{"newsArray":[{"title":"A player called me a “f***ing monkey”: Chambers recalls racist abuse in county cricket","link":"https://indianexpress.com/article/sports/cricket/a-player-called-me-a-fing-monkey-chambers-recalls-racist-abuse-in-county-cricket-7624444/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-11-15 15:38:19","full_description":"As the controversy surrounding the Yorkshire racism case storms on, Maurice Chambers, a Jamaican-born seamer has opened up about the racist abuse he faced while playing for Essex as well as Northamptonshire. Talking to The Cricketer , Chambers said he was called a “f***ing monkey” by one of his colleagues. He also revealed that a senior member of the coaching staff read out racist jokes in the dressing room. It got so bad that Chambers used to go home and cry after matches. “We had a team night out in Chelmsford,” Chambers told The Cricketer . “The other player got pretty drunk. When I got home, he threw a banana down the stairs and said: ‘Climb for it, you f***ing monkey.’ “I mentioned the incident to my mum and she reported it. The other player was forced to apologise to me but I still had to live with him for a while longer. “Apart from that time, I never reported anything. I was always worried about being seen as a troublemaker. I didn’t want to do anything to either risk a new contract or isolating myself further.” Top Sports News Now Behind Drona award, unwanted piece of land that became hockey hotspot Rohit will bring a lot of calm into dressing room, Dravid big on team culture: Rahul Multiple-time ODI champs Australia finally conquer T20 World Cup Click here for more In another incident, Chambers recalls fumbling a ball during fielding practise. Another player, who was also of African-Caribbean heritage, fumbled the next ball, leading to the coach shouting: ‘Is this a black thing?’ “Several of the other players laughed,” Chambers said. “We didn’t find it funny at all. “The same coach used to read out racist jokes on his phone in the dressing room. It would have been nice if some of my teammates had intervened to say ‘this isn’t right’, but it never happened,” Chambers told The Cricketer . “On several other occasions, a senior player would ask me if I wanted a banana. He would do it with a sly smile, like he was trying to rile me. When I became upset, he would turn to the coach and say ‘hey, I’m only offering him some fruit.’ The coach would laugh. It was humiliating. It was isolating. I never told anyone, but I would go home at the end of the day and cry. It made me very unhappy,” he said. Things were not much better in Northamptonshire where he moved after a short stint at Warwickshire. “We were travelling to an away game once and I was sitting three or four rows from the back of the bus,” Chambers recalls. “There was a guy on the backseat of the coach listening to rap music on headphones. He was singing along to the words and it included repeated use of the ‘N’ word. “He must have seen me looking at him, because he asked: ‘You’re okay with this, aren’t you mate?’ “I didn’t reply. I just put my headphones back on. “At that stage he came closer and said to me: ‘You guys use it in American music. I’m just singing along.’ ‘We’re not in America,’ I replied. He stopped singing along,” he told The Cricketer. The England and Wales Cricket Board has said it is “appalled” by fresh racism claims made by former Essex player Maurice Chambers and has vowed to investigate the matter alongside the other allegations at the club. #Breaking The England and Wales Cricket Board has said it is “appalled” by fresh racism claims made by former Essex player Maurice Chambers and has vowed to investigate the matter alongside the other allegations at the club pic.twitter.com/UyhTQGUNWz — PA Sport (@pasport) November 15, 2021","image_url":null,"source_id":"indianexpress"},{"title":"India Test specialists back in action as camp begins in Mumbai","link":"https://sportstar.thehindu.com/cricket/india-vs-new-zealand-test-series-training-camp-mumbai-rahane-pujara-mayank-gill-umesh-saha/article37506512.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"With the limited-overs side busy with the T20I series, the BCCI has organised a short camp for the Test players to help them get accustomed to red-ball cricket.","content":null,"pubDate":"2021-11-15 15:31:15","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"We are here to play cricket: Rahul on air pollution threat to first T20I","link":"https://www.business-standard.com/article/sports/we-are-here-to-play-cricket-rahul-on-air-pollution-threat-to-first-t20i-121111501492_1.html","keywords":null,"creator":null,"video_url":null,"description":"'We are here to play cricket,' said India's T20 vice-captain K L Rahul when asked about the rising air pollution levels in the city ahead of the series opener against New Zealand","content":null,"pubDate":"2021-11-15 15:11:00","full_description":"\"We are here to play cricket,\" said India's T20 vice-captain K L Rahul when asked about the rising air pollution levels in the city ahead of the series opener against New Zealand. Like Delhi, Jaipur's air pollution levels too rose after Diwali earlier this month. Jaipur reported very poor AQI levels on Saturday and smog enveloped the city even on Monday morning. \"Actually, we haven't stepped out yet. We just reached the stadium so I don't know, I don't have an answer to that. I am not carrying a metre with me in my hand to say how bad the pollution is. \"I am sure it won't be that bad. We all are here to play cricket,\" said Rahul before the Indian team's first practice session on Monday. Meanwhile, new head coach Rahul Dravid oversaw his first training session with the national team in the presence of skipper Rohit Sharma, his colleagues and the other support staff members. The team carried out its first practice session after a three-day quarantine. India are scheduled to play three T20 Internationals against New Zealand on Wednesday, Friday and Sunday respectively, after which the two teams will engage in a two-match Test series. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211115/thumb-121111501492.jpg","source_id":"business-standard"},{"title":"Ace Spinner Yasir Shah To Miss Pakistan's Tests In Bangladesh","link":"https://sports.ndtv.com/cricket/ace-spinner-yasir-shah-to-miss-pakistans-tests-in-bangladesh-2612071","keywords":null,"creator":null,"video_url":null,"description":"Ace leg-spinner Yasir Shah will miss Pakistan's two-match Test series in Bangladesh due to a thumb injury, the country's cricket selectors said Monday.","content":null,"pubDate":"2021-11-15 15:09:48","full_description":"Ace leg-spinner Yasir Shah will miss Pakistan's two-match Test series in Bangladesh due to a thumb injury, the country's cricket selectors said Monday. The 35-year-old, who has been a match-winner for Pakistan since 2014, taking 235 wickets in 46 Tests, was injured in September. He is replaced by 36-year-old spinner Bilal Asif, who played the most recent of his five Tests in 2018. Pakistan will play three Twenty20 internationals in Dhaka on November 19, 21 and 22 before the two Tests in Chittagong (26-30 November) and Dhaka (4-8 December). Opener Imam-Ul-Haq and middle-order batter Kamran Ghulam have been named in the 20-player squad. Left-handed Imam returns after stellar performances in the ongoing Quaid-e-Azam Trophy, where he has racked up 488 runs in five innings, including an unbeaten double-century. Imam played his 11th and most recent Test against Australia in Adelaide in 2019. Kamran scored 1,249 runs in the 2020-21 Quaid-e-Azam Trophy, which is a national record. Chief selector Mohammad Wasim said the squad was selected based on conditions in Bangladesh. \"Bangladesh are strong side in their backyard but we have the resources, talent and experience to perform strongly and then carry that momentum into the Australia Tests, which will be in Pakistan next year,\" said Wasim. Promoted Pakistan Test squad: Babar Azam (captain), Mohammad Rizwan, Abdullah Shafique, Abid Ali, Azhar Ali, Bilal Asif, Faheem Ashraf, Fawad Alam, Hasan Ali, Imam-ul-Haq, Kamran Ghulam, Mohammad Abbas, Mohammad Nawaz, Naseem Shah, Nauman Ali, Sajid Khan, Sarfaraz Ahmed, Saud Shakeel, Shaheen Shah Afridi, Zahid Mahmood","image_url":"https://i.ndtvimg.com/i/2017-10/yasir-shah-afp_806x605_71507824370.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"“I felt really bad. I was down for two-three days”: Yuzvendra Chahal expresses disappointment over exclusion from Team India squad for 2021 T20 World Cup","link":"https://thesportsrush.com/cricket-news-felt-really-bad-i-was-down-for-two-three-days-yuzvendra-chahal-expresses-disappointment-over-exclusion-from-team-india-squad-for-2021-t20-world-cup/","keywords":["Cricket","ICC T20 World Cup 2021","Yuzvendra Chahal"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Yuzvendra Chahal expresses disappointment and opens up on his exclusion from Team India squad for the recently concluded T20 World Cup 2021 After team India’s poor outing in the recently concluded 2021 T20 World Cup in UAE, team India’s leg-spinner Yuzvendra Chahal has finally opened up on how he coped up with the news of… The post “I felt really bad. I was down for two-three days”: Yuzvendra Chahal expresses disappointment over exclusion from Team India squad for 2021 T20 World Cup appeared first on The SportsRush.","content":"Yuzvendra Chahal expresses disappointment and opens up on his exclusion from Team India squad for the recently concluded T20 World Cup 2021 After team India’s poor outing in the recently concluded 2021 T20 World Cup in UAE, team India’s leg-spinner Yuzvendra Chahal has finally opened up on how he coped up with the news of his exclusion from the World Cup squad. Chahal, has exclaimed as to how he came to terms with the unexpected news, especially after being an integral part of the team’s bowling line-up in White-ball Cricket for the past four years. He also, laid stress on how his family, friends, and fans continuously backed him up post the selection snub, and how they helped him not lose focus from the UAE leg of the Indian Premier League (IPL). Yuzvendra Chahal expresses disappointment post selection snub Chahal’s non-inclusion from the T20 World Cup squad had raised quite some eyebrows of the fans and experts of the game, including the likes of spinners like Harbhajan Singh and South Africa’s Imran Tahir. Speaking on the matter himself before the start of the India-New Zealand T20I series on November 17, Chahal said, “I was not dropped in four years and then I got dropped for such a marquee event. I felt really bad. I was down for two-three days. But then I knew the second leg of the IPL was still around the corner. I went back to my coaches and spoke to them a lot”. Chahal pic.twitter.com/tgFbY79mCW — Wisden India (@WisdenIndia) November 15, 2021 Exclaiming as to how his family, friends, and fans on social media were his constant support throughout, Chahal said, “My wife and family were constantly encouraging me. My fans kept putting out motivational posts. That buoyed me. I decided to back my strengths and overcome my confusion. I couldn’t have sulked for long because that would have impacted my IPL form”. Chahal was a regular feature for Team India in white ball Cricket until a year ago, but some inconsistent performances before the ongoing T20 World Cup, including the Indian leg of the IPL meant that it was another leg-spinner Rahul Chahar who made the cut ahead of him. Rahul Chahar was picked because of the extra pace he offered through the air (as per BCCI’s selection committee). Chahal bounced back impressively to pick 14 wickets in eight matches in the UAE leg, at an economy rate of 7.06 while Chahar struggled, managing only two wickets in four games at an economy rate of 7.73. Chahal, however, has now been picked for the T20I series against New Zealand which begins from November 17 in Jaipur while Chahar has been dropped after the T20 World Cup, where he played only one game, against Namibia.     The post “I felt really bad. I was down for two-three days”: Yuzvendra Chahal expresses disappointment over exclusion from Team India squad for 2021 T20 World Cup appeared first on The SportsRush.","pubDate":"2021-11-15 15:03:59","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"T20 World Cup awards: And the winner is...","link":"https://www.skysports.com/cricket/news/12040/12469304/t20-world-cup-awards-jos-buttler-adam-zampa-and-david-warner-all-star","keywords":null,"creator":null,"video_url":null,"description":"England star Jos Buttler and Australia duo Adam Zampa and David Warner are among the players praised as Sky Sports Cricket dishes out its awards for the T20 World Cup.","content":null,"pubDate":"2021-11-15 14:58:00","full_description":"Last Updated: 15/11/21 3:15pm England star Jos Buttler and Australia duo Adam Zampa and David Warner are among the players praised as Sky Sports Cricket dishes out its awards for the T20 World Cup. There was drama right to the last in the UAE, with Australia powering past neighbours New Zealand in Sunday's final in Dubai. Opening batter Warner, tricky leg-spinner Zampa and the likes of Josh Hazlewood came to the fore for Justin Langer's winning side, but there were plenty of bright spots, moments of brilliance and feats worthy of recognition across all the teams and throughout the whole competition. Sky Sports pored over the World Cup footage, made some tricky decisions, and can now reveal the winners of our awards - let us know what you think on @SkyCricket Pakistan's fearsome opening pair of Babar Azam and Mohammad Rizwan was probably the fiercest in the tournament, and while Sri Lanka's Charith Asalanka and England's softly-spoken destroyer Jos Buttler impressed, too, we have gone for David Warner . The 35-year-old smashed 289 runs with a strike rate of 146.70, hit a key 49 in the semi-final win over Pakistan and laid the foundations for victory in the final with a muscular 53 off 38 deliveries, winning him the official Player of the Tournament gong from the ICC. Can he take some of that form into red-ball cricket for The Ashes? Sure, watching searing pace bowlers like Trent Boult, Josh Hazlewood and Anrich Nortje steam in with nostrils flaring is all well and good. But the control, variety and wicket-taking ability of the spinners is key, and so it proved again. Shakib Al Hasan was skilful as ever and while top wicket-taker Wanindu Hasaranga (16 at 9.75) was unplayable at times, fellow leggie Adam Zampa was an instrumental part of Australia's side. Please use Chrome browser for a more accessible video player Only 59 cricketers in history have hit a T20I century, and Jos Buttler inscribed his name on that list with a sensational 101 not out off 67 balls against Sri Lanka, the only century of the competition. On a challenging Sharjah wicket, facing far from the tournament's worst bowling attack, the 31-year-old absorbed pressure during a 46-ball fifty and then accelerated, taking just a further 22 balls to reach three figures. Thanks to his heroics, England achieved the rare feat of winning a floodlit game batting first in the tournament. Boult's efforts in the final, taking 2-18 from his four overs, deserve recognition, but Josh Hazlewood 's 3-16 in the same game was a masterclass in line, length, aggression and control. Honourable mentions must also go to Pakistan's Shadab Khan (4-26) against Australia, Liam Livingstone's inspired 2-22 against New Zealand, and Namibia seamer Ruben Trumpelmann, who took three wickets in the first four balls of the game to stifle Scotland. David Warner, Jos Buttler, Babar Azam, Charith Asalanka, Aiden Markram, Moeen Ali, Wanindu Hasaranga, Adam Zampa, Trent Boult, Anrich Nortje, Josh Hazlewood. Although the final didn't live up to its top billing, both semi-finals were outstanding in terms of quality. Elsewhere, there was plenty of late drama as well, with Bangladesh vs West Indies the only game to go down to the last ball, which saw Andre Russell preventing Mahmudullah from hitting the four he needed. However, South Africa's thrilling win against Sri Lanka , with David Miller's last-gasp maximums outdoing Hasaranga's hat-trick was probably the highlight. Scotland's tight win against Bangladesh before the Super 12s was a cracker, too. There are too many outstanding fielding feats to mention, but two other moments stand out: Daryl Mitchell's sporting decision not to take a run after judging he impeded Adil Rashid. In an often gladiatorial sport, in the white heat of a semi-final, it was a classy move. But the best moment has to be Shaheen Shah Afridi dismissing Rohit Sharma for a golden duck. Pakistan against India, arguably the biggest game in cricket, with up to 100 million watching around the world. The seasoned opener Rohit, 34, against the young pretender Shaheen, 21. Four balls in, the bowler raps his pads and Pakistan go on to win by 10 wickets. 🏆🍾 #Australia - #T20WorldCup champions! 🏆🍾 Aaron Finch gets his hands on the trophy as Australia celebrate their maiden T20 crown! 📺 Reaction 👉 https://t.co/17PpNgrwUC 📱 Blog 👉 https://t.co/ILqxyrMx3a pic.twitter.com/uZTsvopYGN Sure, India almost made the semi-finals. But in their three tough group games, they lost two - and by a sizeable margin, coming up woefully short against Pakistan and New Zealand. Bangladesh have the talent to do better too, but a much-vaunted West Indies will not want to look back on a tournament record of four losses with one (very narrow) win. Scotland and Namibia may have struggled at the Super 12s stage, but the Scots made history by making the group stage of the tournament for the first time ever, while Namibia won plenty of fans with their committed and honest style. Arguably, the real overachievers were Australia . Sure, they're a talented side, but you'd have got fairly long odds of them winning the tournament before it all started. They snapped Pakistan's five-match winning streak in the semi-finals and then went on to defeat New Zealand in the final game to win the T20 World Cup for the first time. Watch New Zealand's T20 and Test tour of India on Sky Sports. The first T20 international, in Jaipur, is live on Wednesday from 1.20pm on Sky Sports Cricket and from 1.30pm on Sky Sports Main Event.","image_url":"https://e0.365dm.com/21/11/1920x1080/skysports-david-warner-australia_5583899.jpg?20211115141523","source_id":"skysports"},{"title":"Rohit will bring a lot of calm, Dravid big on team culture: Rahul","link":"https://timesofindia.indiatimes.com/sports/cricket/new-zealand-in-india/rohit-as-leader-will-bring-a-lot-of-calm-into-dressing-room-dravid-big-on-team-culture-rahul/articleshow/87720958.cms","keywords":null,"creator":null,"video_url":null,"description":"As part of a new leadership group, India's T20 vice-captain KL Rahul could not be more excited about working with Rahul Dravid and Rohit Sharma as the head coach is big on setting a good team culture with the new skipper being a tactical genius. The T20 home series against New Zealand marks the start of a new era for Indian cricket after the disappointment of a pre-mature exit from the T20 World Cup.","content":null,"pubDate":"2021-11-15 14:29:58","full_description":null,"image_url":null,"source_id":"toi"},{"title":"T20 World Cup 2021: Talking points - toss, spinners and quality of cricket","link":"https://sportstar.thehindu.com/cricket/icc-mens-t20-world-cup/2021/t20-world-cup-2021-toss-uae-oman-dubai-abu-dhabi-aaron-finch-australia-england-cricket-news/article37503128.ece","keywords":null,"creator":["Amol Karhadkar"],"video_url":null,"description":"After the final, Australia captain Aaron Finch was asked how he managed to win six out of seven tosses. The only time he did not win, England demolished Australia.","content":null,"pubDate":"2021-11-15 13:35:19","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"EAT vs MWT Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for USA One Day National Championship 2021, Match 1","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/eat-vs-mwt-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-usa-one-day-national-championship-2021-match-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-11-15 13:13:15","full_description":"The East (EAT) will take on the Midwest (MWT) in the first match of the USA One Day National Championship 2021 at Minute Maid Park in Houston on Monday. The USA One Day National Championship is a new tournament that the United States Cricket Board has come up with in order to identify and discover new cricketing talents in the country. Eight teams have been split into two groups and the final will be contested by the top teams from each group. While former West Indies player Xavier Marshall is the captain of East Zone, the Midwest will be led by Nikhil Kanchan. EAT XI Xavier Marshall, Derek Narine, Dominique Rikhi, Gajanand Singh, Bhaskar Yadram, Akshay Homraj, Damion Jacobs, Aryan Joshi, Karima Gore, Junaoy Drysdale, Trinson Carmichael MWT XI Shaheer Hasan, Vraj Patel, Fahad Babar, Nikhil Kanchan, Hasan Bemat, Karan Kumar, Mohit Patel, Datta Prakash, Jacobus Pienaar, Najam Iqbal, Farhan Ali EAT vs MWT, USA One Day National Championship 2021, Match 1 Date and Time: 15th November, 2021, 9:00 PM IST Venue: Minute Maid Park, Houston Although not a lot is known about the track at Minute Maid Park in Houston, it is expected to be decent for batting. Batting first will be a better idea as it will give teams an opportunity to assess the surface, which might have some assistance for the fast bowlers. Wicketkeeper Akshay Homraj is a more than decent wicketkeeper-batter who is expected to add a lot of value to your fantasy side. Homraj can score runs at a brisk rate. Batters Xavier Marshall is the captain of the East side and has plenty of experience in this format. He has played 85 matches, amassing 1720 runs. His experience could prove to be crucial for the East team. Although Gajanand Singh might’ve played only eight matches, he has the ability to take the opposition by surprise. All-rounders Bhaskar Yadram could prove to be an extremely important all-rounder for East. Yadram has scored 365 runs and picked up 14 wickets in 18 matches. He’s a safe captaincy choice for your EAT vs MWT Dream11 fantasy side. Damion Jacobs is also a hard-hitting all-rounder who can cause plenty of damage with both the bat and ball. Jacobs has scored 224 runs in 19 games in addition to taking 38 wickets. Bowler Karima Gore is an important player for the East team, having picked up 30 wickets in 26 games. He would like to add a few more scalps to his name today. Bhaskar Yadram (EAT) Damion Jacobs (EAT) Gajanand Singh (EAT) Xavier Marshall (EAT) Karan Kumar (MWT) Bhaskar Yadram: 365 runs and 14 wickets in 18 matches Damion Jacobs: 224 runs and 38 wickets in 19 matches Gajanand Singh: 68 runs in 8 matches Xavier Marshall: 1720 runs in 85 matches Jacobus Pienaar: 444 runs and 13 wickets in 14 matches Fantasy Suggestion #1: A Homraj, S Ali, G Singh, X Marshall, K Kumar, T Ahmed, B Yadram, D Jacobs, J Pienaar, D P Prakash, K Gore Captain: B Yadram. Vice-captain: D Jacobs Fantasy Suggestion #2: A Homraj, D Narine, G Singh, F Babar, X Marshall, K Kumar, B Yadram, D Jacobs, J Pienaar, D P Prakash, K Gore Captain: G Singh. Vice-captain: X Marshall","image_url":"https://static.sportskeeda.com/editor/2021/11/943fa-16369805762991-1920.jpg","source_id":"sportskeeda"},{"title":"Ravi Shastri Joins Legends League Cricket As Commissioner","link":"https://www.sentinelassam.com/sports/cricket/ravi-shastri-joins-legends-league-cricket-as-commissioner-563308","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"''It feels great to remain connected with cricket in the thick of the action, especially with the Legends of the game who have been champions in their own rights,'' Shastri said","content":"New Delhi: After retiring as a Head Coach for Men In Blue, former cricketer Ravi Shastri has joined Legends League Cricket (LLC) as commissioner.The LLC is a professional event for the retired cricketer which will take-off next year and it is expected that first season will be held in January next year in the Gulf.''It feels great to remain connected with cricket in the thick of the action, especially with the Legends of the game who have been champions in their own rights,'' Shastri said in an offical statement.''It is going to be a lot of fun with some serious cricket going. These stalwarts have nothing new to prove but they have their reputation in line and I can assure you, it will be interesting to see how they do justice to it. I am extremely thrilled to be a part of Legends League Cricket. This is a unique initiative and we see a very bright future ahead\", he added.Apart from Shastri, the league will have cricketers from India, Sri Lanka, Pakistan, Australia, England among other players of different nations which will be divided into three teams representing India, Asia and Rest of the world.Andrew Leipus form Australia will be looking at the fitness of the players. Earlier, he was associated with the BCCI as physiotherapist, from October 1999 till 2004.Also read:VVS Laxman finally agrees to head NCAAlso watch:","pubDate":"2021-11-15 13:12:29","full_description":"New Delhi: After retiring as a Head Coach for Men In Blue, former cricketer Ravi Shastri has joined Legends League Cricket (LLC) as commissioner. The LLC is a professional event for the retired cricketer which will take-off next year and it is expected that first season will be held in January next year in the Gulf. ''It feels great to remain connected with cricket in the thick of the action, especially with the Legends of the game who have been champions in their own rights,'' Shastri said in an offical statement. ''It is going to be a lot of fun with some serious cricket going. These stalwarts have nothing new to prove but they have their reputation in line and I can assure you, it will be interesting to see how they do justice to it. I am extremely thrilled to be a part of Legends League Cricket. This is a unique initiative and we see a very bright future ahead\", he added. Apart from Shastri, the league will have cricketers from India, Sri Lanka, Pakistan, Australia, England among other players of different nations which will be divided into three teams representing India, Asia and Rest of the world. Andrew Leipus form Australia will be looking at the fitness of the players. Earlier, he was associated with the BCCI as physiotherapist, from October 1999 till 2004. Also read: VVS Laxman finally agrees to head NCA Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/11/15/269413-ravi-shastri-rtd.jpg","source_id":"sentinel"},{"title":"How epic World Cup win healed festering wounds and delivered Australia a massive Ashes boost","link":"https://www.foxsports.com.au/cricket/t20-world-cup-2021/australia/how-epic-world-cup-win-healed-festering-wounds-and-delivered-australia-a-massive-ashes-boost/news-story/16d48158f119bdbaee86a532db95b424","keywords":null,"creator":null,"video_url":null,"description":"Justin Langer – a man who bleeds for Australian cricket – was an inch away from being asked to leave his helm as coach back in August.","content":null,"pubDate":"2021-11-15 13:00:00","full_description":"Justin Langer – a man who bleeds for Australian cricket – was an inch away from being asked to leave his helm as coach back in August. Off the back of T20 defeats in the West Indies and Bangladesh, which came off another five-match series loss to New Zealand and a 2-1 Test series defeat to India at home, the wolves were at the door. With Langer in hotel quarantine in Adelaide, each passing day brought about a new headline and a new piece of the story being told. Watch a replay of Australia’s triumph in the ICC T20 World Cup Final on Kayo. New to Kayo? Start your free trial today . Langer was an inch away from losing the team. For the second time in the space of half-a-year, emergency talks were held and the ominous backing of the board came from Cricket Australia in a weirdly written statement of support. “Justin (Langer) has done an incredible job in raising the culture, values and behaviours of the Australian men’s team since he took on the role in 2018,” said CA CEO Nick Hockley, following the revelation of the coach’s heated conversation with a CA employed journalist during the Bangladesh series. Not finished yet - Warner stars in Final | 01:05 MORE T20 WORLD CUP NEWS CAREER-DEFINING: The brutal World Cup call that triggered Marsh revival PLAYER RATINGS: Aussie spin star’s heroics as duo shines ‘TOO OLD AND SLOW’: Warner’s wife takes aim at critics “His efforts have restored public faith in the national team which is a side all Australian’s can be incredibly proud of. “He is contracted as head coach through to the middle of next year with the focus now on a successful T20 World Cup campaign followed by the home Ashes defence in what is one of the most anticipated Series and summers of cricket in Australia for many years.” Within hours, the leadership team came together and had a series of heart to hearts. After that, it was decided Langer would continue as coach and, for now, had the support of the team. Despite his backing, it felt as if the writing was still on the wall. The T20 World Cup – a trophy Australia had yet to lift – would still play an important role in shaping Langer’s future within the team and the national cricket team’s path. The former opening batsman’s cryptic message to social media in October did little to change the opinion that the coach would change his intense man-management ways. “A wise man once said: Don’t give them a taste of your own medicine. If they lied, let their medicine be honesty,” it read. “If they played with your emotions, let your medicine be maturity. If they broke you, let your medicine heal you. If they made you cry, let your medicine make them smile. These remedies of yours may take years to work, but they work. And they last. “So be patient. Stay true to yourself. And remember this: it is better for people to value you for who you are, not who you pretend to be. Who you are lasts a lifetime. Who you pretend to be changes like the change of seasons. “Don’t be afraid to be yourself, even if it means removing yourself from lives you want to be in. You are, no doubt, worthy of being valued for who you are. So be who you are. “The wise man says: BE YOURSELF. YOU ARE UNIQUE and YOU ARE SPECIAL. Be happy, be healthy, be calm, be strong and BE YOURSELF.” Only a finals appearance was considered a pass mark for Langer’s Australian team. On Monday AEDT, the gritty left-hander, who smiled in the face of adversity against the world’s quickest bowler Shoaib Akhtar in 1999 after being hit on the head on his way to a matchwinning century, once again was back grinning after presiding over Australia’s World Cup triumph. Marsh leads Australia to glory | 00:50 “I suppose everyone who wins a World Cup says it’s hard to process, it’s hard to put it into words, but this is such a special group of people – and I know every coach and every captain says the same thing, but we’ve got some amazing cricketers here,” said Langer in response to Ian Bishop’s question following their eight-wicket win over New Zealand. “We haven’t had a chance to play together because of different reasons for the last 12 months, so when we all got back together it was almost like a reunion. “There’s so many close relationships there, it’s a very, very special moment for everyone.” Asked to pinpoint what were the keys for their success, Langer said the talent always existed in the team, it was a matter of bringing all the parts together during a Covid-impact lead-in to the campaign. “Well, we knew when we came back together how much talent we had, that’s for one,” Langer said. “There’s enormous talent in this team. “When we were in the West Indies and Bangladesh leading into this series there’s a few missing pieces and Mitch Marsh took one of those pieces - and he’s been brilliant, Bish. “So we had some real talent there. Aussies drop big tunes in sheds | 01:00 “But we also embraced fun,” he added. “In these situations where everyone talks about bubbles, these guys have had so much fun on and off the ground. In the game of cricket it’s important to have fun and enjoy it, right, and the guys have done that. “I think it was an important part of our success here.” Langer’s success has guaranteed he will continue to lead Australia throughout the Ashes, which gets underway in less than a month in Brisbane at The Gabba. It was back in the 2007 New Year’s Test against England Langer signed off from international cricket on his own terms. Should he lead Australia to their third straight Ashes series victory, he will likely be able to decide his future on his own terms. For now, Langer is enjoying a beer among his younger peers. It is amazing what wounds can be healed with the taste of victory.","image_url":null,"source_id":"foxsports"},{"title":"Here's how the Aussies celebrated their T20 World Cup win","link":"https://www.tribuneindia.com/news/sports/heres-how-the-aussies-celebrated-their-t20-world-cup-win-338409","keywords":null,"creator":null,"video_url":null,"description":"Tribune Web DeskChandigarh, November 15 Wild celebrations broke out in the Australian dressing room on Sunday after they took home their maiden world title in the shortest form of cricket on Sunday. Australia beat neighbours New Zealand by eight wickets. A video of the Aussies celebrations that the ICC released on Twitter, along with the caption \"How's your Monday going\", shows Matthew Wade and Marcus Stoinis drinking out of a shoe. The whole team dances jubilantly later in the video. How's your Monday going? 😅#T20WorldCup pic.twitter.com/Fdaf0rxUiV — ICC (@ICC) November 15, 2021","content":null,"pubDate":"2021-11-15 12:41:35","full_description":"Tribune Web Desk Chandigarh, November 15 Wild celebrations broke out in the Australian dressing room on Sunday after they took home their maiden world title in the shortest form of cricket on Sunday. Australia beat neighbours New Zealand by eight wickets. A video of the Aussies celebrations that the ICC released on Twitter, along with the caption “How's your Monday going”, shows Matthew Wade and Marcus Stoinis drinking out of a shoe. The whole team dances jubilantly later in the video. How's your Monday going? 😅 #T20WorldCup pic.twitter.com/Fdaf0rxUiV","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/11/2021_11$largeimg_282775786.jpeg","source_id":"tribuneindia"},{"title":"Ravi Shastri gets NEW JOB after stepping down as Team India coach, check details here","link":"https://zeenews.india.com/cricket/ravi-shastri-gets-new-job-after-stepping-down-as-team-india-coach-check-details-here-2410618.html","keywords":null,"creator":null,"video_url":null,"description":"Shastri completed his term with the Indian cricket team as head coach and he is starting a new inning with Legends League Cricket (LLC). The global league where former cricketers, legends of the game, will be playing competitive cricket is looking at emerging as a professional league, where the legends can relive old rivalries on the field.","content":null,"pubDate":"2021-11-15 12:04:00","full_description":"Legends League Cricket, a professional league for retired cricketers, on Monday announced former India head coach Ravi Shastri has been roped in as Commissioner of the League. Shastri completed his term with the Indian cricket team as head coach and he is starting a new inning with Legends League Cricket (LLC). The global league where former cricketers, legends of the game, will be playing competitive cricket is looking at emerging as a professional league, where the legends can relive old rivalries on the field. Shastri, with his successful career as an all-rounder cricketer and then a thriving coach of Team India, brings immense value to the league. The first season is scheduled to be held in January 2022 in the Gulf. BIG BREAKING! @RaviShastriOfc the Legend himself joins Legends League Cricket as Commissioner to steer head the team on all cricket matters. We feel elated & honoured to have him with us. Exciting days ahead. @llct20 @ramanraheja @vivekkhushalani @khushvk #cricket #RaviShastri pic.twitter.com/dhz7I82h47 — Legends League Cricket (@llct20) November 15, 2021 \"It feels great to remain connected with cricket in the thick of the action, especially with the Legends of the game who have been champions in their own rights. It is going to be a lot of fun with some serious cricket going. These stalwarts have nothing new to prove but they have their reputation in line and I can assure you, it will be interesting to see how they do justice to it. I am extremely thrilled to be a part of Legends League Cricket. This is a unique initiative and we see a very bright future ahead\" , RaviShastri stated in an official release. The first season of LLC is scheduled to be held in January 2022 in the Gulf. The league will have former cricketers from India, Pakistan, Sri Lanka, Australia, England, among other cricket nations divided into 3 teams representing India, Asia and the Rest of the World. Andrew Leipus who had been associated with Team India and also National Cricket Academy has already joined as the Director of Sports Science to oversee the fitness of all the players joining the league. With Ravi Shastri joining the Legends League Cricket as its Commissioner, the league will get more exciting and promising.","image_url":null,"source_id":"zeenews"},{"title":"India vs New Zealand: Early Dew Likely To Minimise Toss Advantage In First T20I In Jaipur, Says Repo.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMingFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL2luZGlhLXZzLW5ldy16ZWFsYW5kLWVhcmx5LWRldy1saWtlbHktdG8tbWluaW1pc2UtdG9zcy1hZHZhbnRhZ2UtaW4tZmlyc3QtdDIwaS1pbi1qYWlwdXItc2F5cy1yZXBvcnQtMjYxMTc1MdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand: Early Dew Likely To Minimise Toss Advantage In First T20I In Jaipur, Says Repo..  NDTV SportsIndia vs New Zealand: Early dew likely to minimise toss advantage in first T20I in Jaipur  Times of IndiaIND vs NZ 2021: A High-Scoring Pitch Being Prepared In Jaipur For 1st T20I - Reports  Cricket AddictorIND vs NZ LIVE: KL Rahul says great opportunity to learn from Dravid  InsideSportNew Zealand team arrives in Jaipur for India tour day after T20 World Cup final loss  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2021-11-15 11:51:00","image_url":null,"source_id":"google"},{"title":"Happy Birthday Sania Mirza: The Tennis Player Celebrates her 35th Birthday","link":"https://www.sentinelassam.com/sports-news/happy-birthday-sania-mirza-the-tennis-player-celebrates-her-35th-birthday-563303","keywords":["Breaking News,Sports,Feature,News Ticker"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Indian Tennis Player Sania Mirza turned 35 on Monday 15 November celebrates her birthday with family and friends, shared pictures of birthday party on Instagram","content":"On Monday 15 November 2021 Tennis Player Sania Mirza turned 35 celebrating her birthday in Dubai with her husband Shoaib Malik and son Izhaan along with other family members and friends. Sania shared the beautiful moments of her birthday celebration in her Instagram feed which shows the cake cutting by her in presence of her son and husband and feeding them the cake. Sania's husband wishes his wife posting a cute picture of them with the caption wishing Happy Birthday Sanu along with a heart emoji. Sania shares her birthday with her mother Nasima Mizra and on her birthday she posted a birthday wish for her mother along with a throwback picture. Sania is the former tennis doubles Worlds No. 1 who received titles of 6 Grand Slams throughout her career. She was ranked as India's No. 1 player from 2003 to 2013 by the Women's Tennis Association of India. Sania was born on 15 November 1986 in Mumbai and started playing tennis at a very young age when she was just 6 years old later started playing professionally in the year 2003. Sania got married to Pakistani Cricket player Shoaib Malik in the year 2010 and settled in Dubai since then. She has had major wins in her life including the win against World No. 1 Martina Hangis. He has received a total of 14 medals from various international multi-sports events such as from Commonwealth Games, Afro-Asian Games, and Asian Games. Sania Mirza made a successful career through her excellent performance in playing tennis which led her to win many reputed awards such as Padma Bhushan in 2016, Padma Shri in 2006, Arjuna Award for Lawn Tennis in 2004, and others. Also read: Pressure of Grand Slam did take a toll on me, concedes DjokovicAlso watch: ","pubDate":"2021-11-15 11:41:02","full_description":"On Monday 15 November 2021 Tennis Player Sania Mirza turned 35 celebrating her birthday in Dubai with her husband Shoaib Malik and son Izhaan along with other family members and friends. Sania shared the beautiful moments of her birthday celebration in her Instagram feed which shows the cake cutting by her in presence of her son and husband and feeding them the cake. Sania's husband wishes his wife posting a cute picture of them with the caption wishing Happy Birthday Sanu along with a heart emoji. Sania shares her birthday with her mother Nasima Mizra and on her birthday she posted a birthday wish for her mother along with a throwback picture. Sania is the former tennis doubles Worlds No. 1 who received titles of 6 Grand Slams throughout her career. She was ranked as India's No. 1 player from 2003 to 2013 by the Women's Tennis Association of India. Sania was born on 15 November 1986 in Mumbai and started playing tennis at a very young age when she was just 6 years old later started playing professionally in the year 2003. Sania got married to Pakistani Cricket player Shoaib Malik in the year 2010 and settled in Dubai since then. She has had major wins in her life including the win against World No. 1 Martina Hangis. He has received a total of 14 medals from various international multi-sports events such as from Commonwealth Games, Afro-Asian Games, and Asian Games. Sania Mirza made a successful career through her excellent performance in playing tennis which led her to win many reputed awards such as Padma Bhushan in 2016, Padma Shri in 2006, Arjuna Award for Lawn Tennis in 2004, and others. Also read: Pressure of Grand Slam did take a toll on me, concedes Djokovic Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/11/15/269372-sania-mirza-3-820x1024.jpg","source_id":"sentinel"},{"title":"Marsh tipped for Ashes nod after T20 heroics","link":"https://wwos.nine.com.au/cricket/mark-taylor-says-mitch-marsh-in-ashes-calculations-after-world-cup-heroics/daf89a73-fb02-4111-a53d-8d6e69b8467f","keywords":null,"creator":["wwos"],"video_url":null,"description":"He starred in the shortest format of the game, and now Mitch Marsh could be recalled into Australia's Test side this summer.","content":"Former Australian Test captain Mark Taylor believes World Cup hero Mitch Marsh may have batted himself into Ashes contention after his match-winning knock in the final.After years of being Australian cricket's whipping boy, Marsh delivered on the biggest stage, guiding his side to its first T20 World Cup with an unbeaten 77 off 50 deliveries. READ MORE: Mitchell Marsh's three ball onslaught at T20 World CupMarsh has enjoyed the most prolific year of his career with the bat in the T20 format, scoring over 600 runs at an average of 36.88 and a strike rate of 129.81 in 2021.A combination of injuries and poor stretches of form have resulted in the 30-year-old having a stop-start international career, but Taylor believes his play in the last 12 months could be a sign of him being a late bloomer. \"What you might see from Mitch Marsh is now he's 31, he's matured and you might see a bit of a late bloomer,\" Taylor told 2GB's Wide World of Sports Radio.\"Everyone assumed 10 years ago that Mitch Marsh would come into the side having captained our Under-19s side about 12 years ago and become a fixture ... and he hasn't nailed it down. READ MORE: World Cup batting masterclass hailed as 'one of the best'\"There's still an opportunity for him to do that. I have no doubt that on the back of his performance last night and the way that he's maturing all the time, that maybe his Test days aren't over. \"We've talked about who might bat No.5 for Australia in a couple of weeks' time, I'll bet you the selectors are sitting down and talking about Usman Khawaja and Travis Head, but Mitch Marsh is back in the equation.\"Taylor also hit back at Marsh's now-famous quote from 2019 where he claimed that Australia \"hated\" him.\"He's wrong, I don't think Australia has hated him at all,\" he said.\"There's no doubt that Australia loves to see our side and our individuals play the best possible cricket and unfortunately for Mitch we haven't seen that at Test level, so there's been a bit of disappointment around his performances. \"I've known Mitch Marsh since he was born, he's a terrific kid and just hasn't performed at that Test match level.\"While England's touring party has been practicing together in Australia during the T20 World Cup, Taylor believes the confidence the likes of David Warner have gained from the World Cup will stand the home side in good stead for the Ashes series.\"I think confidence is as important, if not more important, than momentum,\" he said.\"That win will silence the critics, and will give people like David Warner [confidence] ... he's proven everyone wrong as well, he's ready to go again. READ MORE: Hamilton's horror F1 weekend ends with remarkable glory\"Mitch Marsh believes he's an international cricketer again, even Matthew Wade, who was dropped from the Australian side after last summer for the tour that never happened in South Africa, he now probably believes he's not finished anymore. \"So look out, the Australians will be full of confidence. They may not be quite as Test match prepared, but they are confident now.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-11-15 11:35:45","full_description":"Former Australian Test captain Mark Taylor believes World Cup hero Mitch Marsh may have batted himself into Ashes contention after his match-winning knock in the final. After years of being Australian cricket's whipping boy, Marsh delivered on the biggest stage, guiding his side to its first T20 World Cup with an unbeaten 77 off 50 deliveries . READ MORE: Mitchell Marsh's three ball onslaught at T20 World Cup Marsh has enjoyed the most prolific year of his career with the bat in the T20 format, scoring over 600 runs at an average of 36.88 and a strike rate of 129.81 in 2021. A combination of injuries and poor stretches of form have resulted in the 30-year-old having a stop-start international career, but Taylor believes his play in the last 12 months could be a sign of him being a late bloomer. \"What you might see from Mitch Marsh is now he's 31, he's matured and you might see a bit of a late bloomer,\" Taylor told 2GB's Wide World of Sports Radio. \"Everyone assumed 10 years ago that Mitch Marsh would come into the side having captained our Under-19s side about 12 years ago and become a fixture ... and he hasn't nailed it down. READ MORE: World Cup batting masterclass hailed as 'one of the best' \"There's still an opportunity for him to do that. I have no doubt that on the back of his performance last night and the way that he's maturing all the time, that maybe his Test days aren't over. \"We've talked about who might bat No.5 for Australia in a couple of weeks' time, I'll bet you the selectors are sitting down and talking about Usman Khawaja and Travis Head, but Mitch Marsh is back in the equation.\" Taylor also hit back at Marsh's now-famous quote from 2019 where he claimed that Australia \"hated\" him. \"He's wrong, I don't think Australia has hated him at all,\" he said. \"There's no doubt that Australia loves to see our side and our individuals play the best possible cricket and unfortunately for Mitch we haven't seen that at Test level, so there's been a bit of disappointment around his performances. \"I've known Mitch Marsh since he was born, he's a terrific kid and just hasn't performed at that Test match level.\" While England's touring party has been practicing together in Australia during the T20 World Cup, Taylor believes the confidence the likes of David Warner have gained from the World Cup will stand the home side in good stead for the Ashes series. \"I think confidence is as important, if not more important, than momentum,\" he said. \"That win will silence the critics, and will give people like David Warner [confidence] ... he's proven everyone wrong as well, he's ready to go again. READ MORE: Hamilton's horror F1 weekend ends with remarkable glory \"Mitch Marsh believes he's an international cricketer again, even Matthew Wade, who was dropped from the Australian side after last summer for the tour that never happened in South Africa, he now probably believes he's not finished anymore. \"So look out, the Australians will be full of confidence. They may not be quite as Test match prepared, but they are confident now.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/11/393177/pickerimage.jpg","source_id":"nine"},{"title":"T20 World Cup was flawed, fun and must be viewed through dewy highs | Simon Burnton","link":"https://www.theguardian.com/sport/2021/nov/15/t20-world-cup-flawed-fun-dew-cricket","keywords":["T20 World Cup 2021","T20 World Cup","Twenty20","Cricket","Sport"],"creator":["Simon Burnton"],"video_url":null,"description":"The conditions placed extra importance on winning the toss and it was a better tournament for bowlers than battersIt was not the final we wanted, but it was the final we deserved. There was some drama, certainly some skill, and then the team that batted second won, all watched by a crowd that fell some way short of a full house. The T20 World Cup has been a deeply flawed tournament but it nevertheless proved one basic fact: Twenty20 cricket is enormous fun. It also showed that assembling the world’s best practitioners in a single place to play loads of games in a short space of time is a very good idea. Which is just as well, as it is happening again next year, and then every two years after that.It will be remembered for the match-winning batting power of Matthew Wade, Jimmy Neesham, Asif Ali and David Miller, for David Warner showing his critics where they can stick their scepticism, for hard lengths, hard graft and the thrill of seeing the magnificent Shaheen Shah Afridi standing at the end of his run-up, new ball in hand. For England there was glorious failure, the awesome steamrollerings of West Indies and Australia and the combined excuses of injuries, a lost toss and a successful chase of 57 runs from 24 balls by Neesham and Daryl Mitchell to beat them. Continue reading...","content":null,"pubDate":"2021-11-15 11:04:36","full_description":"I t was not the final we wanted, but it was the final we deserved. There was some drama, certainly some skill, and then the team that batted second won , all watched by a crowd that fell some way short of a full house. The T20 World Cup has been a deeply flawed tournament but it nevertheless proved one basic fact: Twenty20 cricket is enormous fun. It also showed that assembling the world’s best practitioners in a single place to play loads of games in a short space of time is a very good idea. Which is just as well, as it is happening again next year, and then every two years after that. It will be remembered for the match-winning batting power of Matthew Wade, Jimmy Neesham, Asif Ali and David Miller, for David Warner showing his critics where they can stick their scepticism , for hard lengths, hard graft and the thrill of seeing the magnificent Shaheen Shah Afridi standing at the end of his run-up, new ball in hand. For England there was glorious failure , the awesome steamrollerings of West Indies and Australia and the combined excuses of injuries, a lost toss and a successful chase of 57 runs from 24 balls by Neesham and Daryl Mitchell to beat them. It has been a tournament of match-ups and mess-ups, of inspiring catches and dispiriting drops, one that while not being won by one of the favourites also featured only one genuine, 21-carat shock – and that on its very first afternoon when Scotland beat Bangladesh , an upset that sagged in significance with the dawning realisation that Mohammad Mahmudullah’s side were actually completely rubbish. The uneven bounce and unpredictable pace has made this a better tournament for bowlers than for batters, and despite the rising power, skill and aggression of short-form batting it has been the slowest-scoring T20 World Cup ever. However, given that there were less than 48 hours between the last game of the IPL and the start of the World Cup, and the same venues were used for both competitions, they held up admirably. Between them the three World Cup venues have hosted 70 competitive T20 matches in the last two months, an almost unbearable workload. On the subject of workloads, New Zealand played the final on Sunday night and start a T20 series against India on Wednesday, surely some mistake. Thankfully it is not a competition that will be remembered for the impact of Covid-19, with not one case leaking into the players’ rigidly-enforced bio-bubbles – the only positive test among players, officials, staff and assorted match-going professionals involved an English journalist. The one significant impact of the pandemic was to force its relocation from India, at which point there were not many alternative hosts to the UAE, headquarters of the ICC and established now as cricket’s equivalent of the mate you used to call when you needed somewhere to crash for a few nights. Unlike next year’s football World Cup in Qatar, little has been made of these hosts’ use of forced labour and history of human rights abuses – Dubai’s reputation having long since been painstakingly fivestarbeachholidaywashed – but moving the competition threw up practical as well as moral issues. The weather changed markedly during the tournament, from intense heat at the start to verging occasionally on the mild towards its conclusion. But to avoid the worst of the heat and to maximise viewing figures in key Asian markets as many matches as possible were pushed into the evening, at which point the dreaded dew descended. The advantages already built in to chasing really did not need to be further amplified, and the effect has been to massively disadvantage the team batting first, to the extent that it seriously detracted from the sport. In effect, diverting as many have been, every evening match has seen 22 highly skilled sportspeople spend several hours straining to see if they can have a greater impact on the result than the momentary flight of a small metal disc before the action began, and in general they have failed. There are more reasons than just the toss that this became a chasers’ championship, but it is not a good look. For all that every one of the knockout matches followed this script, the two semi-finals were thrillingly tense. A similarly gripping final, ideally won by the side batting first, and the tournament would have been redefined as a sporting success. But Australia took a sledgehammer to that idea, and then used it to set about New Zealand’s bowlers. The result was a sense that this had generally been a tournament of high skill and low drama, and that the next will have much to live up to but a great deal to improve on. Same time next year?","image_url":"https://i.guim.co.uk/img/media/307e4796c6e97275de30d1e4e2c3dce97af01a10/0_129_3200_1921/master/3200.jpg?width=460&quality=85&auto=format&fit=max&s=5935e1b06d630883ab4cbf31d577ee80","source_id":"theguardian"},{"title":"Ranchi match tickets IND vs NZ 2nd T20I: How to book tickets for India vs New Zealand Ranchi T20I?","link":"https://thesportsrush.com/cricket-news-ranchi-match-tickets-ind-vs-nz-2nd-t20i-how-to-book-tickets-for-india-vs-new-zealand-ranchi-t20i/","keywords":["Cricket","India","New Zealand","New Zealand tour of India 2021"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ranchi match tickets online booking: The SportsRush present before you full ticketing details for IND vs NZ 3rd T20I. Coming on the back of finishing as the runners-up in the recently concluded ICC T20 World Cup 2021, New Zealand have only a couple of days to travel, quarantine, rest and rejuvenate ahead of their next… The post Ranchi match tickets IND vs NZ 2nd T20I: How to book tickets for India vs New Zealand Ranchi T20I? appeared first on The SportsRush.","content":"Ranchi match tickets online booking: The SportsRush present before you full ticketing details for IND vs NZ 3rd T20I. Coming on the back of finishing as the runners-up in the recently concluded ICC T20 World Cup 2021, New Zealand have only a couple of days to travel, quarantine, rest and rejuvenate ahead of their next international assignment. The densely-packed international calendar will now see New Zealand play three T20Is and two Tests in India starting with the first T20I in Jaipur on November 17. The Black Caps, who had defeated India convincingly in the T20 World Cup, will be touring the nation after as many as four years. New Zealand, who will play the aforementioned matches within a 22-day period, will also be playing matches in Jaipur, Kolkata, Kanpur and Mumbai. JSCA International Stadium Complex, which has hosted only a couple of T20Is till date, will be hosting New Zealand for the first time in the shortest format. Meanwhile, India have won both their T20Is at this venue. Ranchi match tickets India vs New Zealand 2nd T20I It is worth mentioning that the tickets for the second T20I between India and New Zealand opened for general public today itself. However, contrary to other venues in the country, the tickets haven’t been made available on any online platform for now. Readers must note that sale of tickets has started in an offline mode though. Interested fans will have to visit the stadium box-office to buy the tickets. While ticket price of the second T20I in Ranchi had been announced last week, fans will be able to buy tickets only if they visit the stadium between 10:00 AM – 01:00 PM and 02:00 PM – 05:00 PM. “All persons will have to compulsorily exhibit their vaccination or Covid test certificates at entry gates. This apart, no one will be allowed to carry anything like water bottles, bags, cameras, etc into the stadium, except those who are authorized to do so,” JSCA (Jharkhand State Cricket Association) Secretary Sanjay Singh had said in a statement last week. India vs New Zealand ticket price JSCA have fixed as many as eight price categories for fans to watch this match. They are INR 900, INR 1,200, INR 1,400, INR 1,700, INR 1,800, INR 4,000, INR 5,000 and Rs 5,500. The post Ranchi match tickets IND vs NZ 2nd T20I: How to book tickets for India vs New Zealand Ranchi T20I? appeared first on The SportsRush.","pubDate":"2021-11-15 11:04:10","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Twenty 20 World Cup Final: West Australian Mitch Marsh earns praise from Australia with stellar performance","link":"https://thewest.com.au/sport/australian-cricket-team/twenty-20-world-cup-final-west-australian-mitch-marsh-earns-praise-from-australia-with-stellar-performance-c-4565749","keywords":null,"creator":["John Townsend"],"video_url":null,"description":"World Cup heroics means Mitch Marsh should never again be booed on an Australian cricket ground.","content":null,"pubDate":"2021-11-15 10:43:38","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4565749/110b73bc124d88f7ce515c7cfa547e12350db91d-16x9-x209y335w1645h926.jpg","source_id":"thewest"},{"title":"Concussion scare from bullet delivery!","link":"https://www.news.com.au/sport/cricket/concussion-scare-from-bullet-delivery/video/93e8d9ff8f051db69d88a20a64f23cee","keywords":null,"creator":null,"video_url":null,"description":"Cricket: The doctor and physio were called onto the pitch at The Gabba after Queensland's Jimmy Peirson took a ball to the head and was required to be accessed for a potential concussion.","content":null,"pubDate":"2021-11-15 10:32:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Kane Williamson proud of New Zealand despite another World Cup final loss","link":"https://www.iol.co.za/sport/cricket/international/kane-williamson-proud-of-new-zealand-despite-another-world-cup-final-loss-e05f76a6-1257-5870-a086-72ed904d0bd0","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Skipper Kane Williamson said he remained proud of his team despite New Zealand reaching three World Cup finals in white-ball cricket in the last six years and failing to win one.","content":null,"pubDate":"2021-11-15 10:04:39","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/3a8a2261-b6cc-5d04-a616-188535931384&operation=CROP&offset=0x0&resize=3400x1913","source_id":"iol"},{"title":"Ravi Shastri Roped In As Legends League Cricket Commissioner","link":"https://sports.ndtv.com/cricket/ravi-shastri-roped-in-as-legends-league-cricket-commissioner-2611581","keywords":null,"creator":null,"video_url":null,"description":"Ravi Shastri completed his term with the Indian cricket team as head coach and he is starting a new inning with Legends League Cricket (LLC).","content":null,"pubDate":"2021-11-15 09:45:46","full_description":"Legends League Cricket, a professional league for retired cricketers, on Monday announced former India head coach Ravi Shastri has been roped in as Commissioner of the League. Shastri completed his term with the Indian cricket team as head coach and he is starting a new inning with Legends League Cricket (LLC). The global league where former cricketers, legends of the game, will be playing competitive cricket is looking at emerging as a professional league, where the legends can relive old rivalries on the field. Shastri, with his successful career as an all-rounder cricketer and then a thriving coach of Team India, brings immense value to the league. The first season is scheduled to be held in January 2022 in the Gulf. \"It feels great to remain connected with cricket in the thick of the action, especially with the Legends of the game who have been champions in their own rights. It is going to be a lot of fun with some serious cricket going. These stalwarts have nothing new to prove but they have their reputation in line and I can assure you, it will be interesting to see how they do justice to it. I am extremely thrilled to be a part of Legends League Cricket. This is a unique initiative and we see a very bright future ahead\", RaviShastri stated in an official release. Promoted The first season of LLC is scheduled to be held in January 2022 in the Gulf. The league will have former cricketers from India, Pakistan, Sri Lanka, Australia, England, among other cricket nations divided into 3 teams representing India, Asia and the Rest of the World. Andrew Leipus who had been associated with Team India and also National Cricket Academy has already joined as the Director of Sports Science to oversee the fitness of all the players joining the league. With Ravi Shastri joining the Legends League Cricket as its Commissioner, the league will get more exciting and promising.","image_url":"https://c.ndtvimg.com/2021-09/gndnb15_ravi-shastri-afp_650x400_05_September_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Cricket-Australians Warner, Hazlewood, Zampa make ICC T20 World Cup team","link":"https://www.thestar.com.my/sport/cricket/2021/11/15/cricket-australians-warner-hazlewood-zampa-make-icc-t20-world-cup-team","keywords":null,"creator":null,"video_url":null,"description":"MUMBAI (Reuters) - Three players from champions Australia made the International Cricket Council's team of the Twenty20 World Cup with Pakistan captain Babar Azam chosen to lead the side, the world governing body said on Monday. Read full story","content":null,"pubDate":"2021-11-15 09:39:00","full_description":"MUMBAI (Reuters) - Three players from champions Australia made the International Cricket Council's team of the Twenty20 World Cup with Pakistan captain Babar Azam chosen to lead the side, the world governing body said on Monday. Australia defeated New Zealand in Dubai on Sunday to finally win a maiden T20 World Cup and have the most players in the team picked by a selection panel of commentators, former international players and journalists. Opening batter David Warner, who was adjudged player of the tournament, fast bowler Josh Hazlewood and leg-spinner Adam Zampa made the side. South Africa, Sri Lanka and England had two players each in the team with Babar, the tournament's top-scorer, and New Zealand seamer Trent Boult completing the team. Pre-tournament favourites India, who failed to get past the Super 12 stage, did not have any players in the side. \"As with any team selection there will be varying opinions, and robust discussion on the final composition of the squad,\" former West Indies fast bowler Ian Bishop, who works as a television pundit, said. \"The panel respects that, and we encourage the strong debate that will ensue. This team was incredibly difficult to select over such a highly competitive tournament. Selections were based predominantly on the Super 12 onward to the final.\" England's Jos Buttler was chosen to don the wicketkeeping gloves with Moeen Ali picked as the all-rounder. Batter Charith Asalanka and spinner Wanindu Hasaranga got the nod from Sri Lanka while Aiden Markram and fast bowler Anrich Nortje were the South Africans selected in the side. (Reporting by Sudipto Ganguly; editing by Ed Osmond)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/11/15/1368772.jpg","source_id":"thestar_my"},{"title":"IND vs NZ T20I series: Gary Stead says New Zealand's cricket schedule as 'tough and challenging'","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-nz-t20i-series-gary-stead-says-new-zealand-s-cricket-schedule-as-tough-and-challenging-745168","keywords":null,"creator":null,"video_url":null,"description":"New Zealand coach Gary Stead says his team is bracing up for a \"tough and challenging\" schedule as it heads to India for a three-match T20 series, starting just three days after the T20 World Cup final which the Black Caps lost to Australia here.","content":null,"pubDate":"2021-11-15 09:07:15","full_description":"New Zealand coach Gary Stead says his team is bracing up for a \"tough and challenging\" schedule as it heads to India for a three-match T20 series, starting just three days after the T20 World Cup final which the Black Caps lost to Australia here. New Zealand on Sunday lost to Australia by eight wickets in the showpiece but 's men will hardly have any time to regroup as it faces India in the opening T20I at Jaipur on Wednesday. It will be followed by the second and third T20Is on November 19 and November 21, before they kick off their World Test Championship defence with two games in Kanpur and Mumbai. \"It's the first time that I can remember that we're so quickly into another series immediately at the back-end of the T20 World Cup,\" Stead said. \"It's definitely tough and challenging but it is what is in front of us.\" The members of the Test side, who are not part of the T20 squad, are already in India. It will be a busy time for the kiwi support staff as they juggle with training the Test players in the morning and the T20 cricketers in the evening in the next few weeks. \"We've got nine-ten guys in India already, who are preparing for those Test matches, and hopefully we can get up and have a really great performance against India.\" New Zealand cricketers have been in the bio-bubble for varying time period with 10 members of the T20 squad also competing at the in UAE which preceded the ICC event, while others like Glenn Phillips and Jimmy Neesham played at the Hundred. There were others like , Mark Chapman and , who also stayed in the UAE bubble following New Zealand's decision to call off their tour of Pakistan due to security concerns in September. In some good news for New Zealand, pace spearhead Lockie Ferguson, who missed the T20 World Cup due to a calf injury, is likely to return to action. Ferguson, who was sidelined just hours before New Zealand's opening match against Pakistan in Sharjah, has resumed bowling at the nets in Abu Dhabi and Dubai. \"In terms of Lockie, I think he is pretty close,\" Stead said. \"We will just make sure we get over there, travel okay and there's no issues like seizing up on the flight or anything like that. But I'd expect that he's going to be available for selection, which will be fantastic. \"With all the guys that are going to prepare for the Test matches, we just have to make that call over there - whether we think it's in the best interests of them and also in the best interests of the team being that the Test matches are more of our priority, I think, in the next month than what the T20 matches will be.\"","image_url":null,"source_id":"indiatvnews"},{"title":"Wahab Riaz plans to retire after 2023 World Cup","link":"https://www.indiatvnews.com/sports/cricket/wahab-riaz-plans-to-retire-after-2023-world-cup-745164","keywords":null,"creator":null,"video_url":null,"description":"Left-arm Pakistan fast bowler Wahab Riaz is planning to retire from international cricket after the 2023 World Cup in India.","content":null,"pubDate":"2021-11-15 08:38:35","full_description":"Left-arm Pakistan fast bowler Wahab Riaz is planning to retire from international cricket after the 2023 World Cup in India. The 36-year-old pacer, who has played 27 Tests, 91 ODIs and 36 T20Is, has not been a regular in the Pakistan team for a while now and was also ignored for the T20 World Cup. \"Everyone has to say goodbye to cricket one day. But my target is to carry on playing until the 2023 World Cup, that is if I remain full fit and my passion for the game remains strong as well. Obviously, if I am performing I will carry on,\" Wahab said in an interview. \"I think I still have two or three years of good cricket left in me,\" he said. \"I have been in and out of the national team for a while now but I am playing in domestic cricket and also in different leagues including the Pakistan Super League and I am performing well so that is keeping me going.\" The pacer, who appeared as an expert on the A sports channel for the World Cup, said he firmly believed that he could be around as a performing player until 2023. \"My belief is simple age is not a matter as long as a player is fit and performing and enjoying his cricket. There are so many examples around these days. \"Fitness levels, diet and all these things have improved a lot in modern-day cricket so times have changed.\" Wahab said in Pakistan Cricket unfortunately there has been examples of players being sidelined because of their age. \"I have nothing against young players, obviously you need them in the team. They bring energy and a future with them. But the thing is experience, especially as a fast bowler, is so very important especially in T20 cricket these days,\" he said. Wahab said he was disappointed at missing the World Cup but he could understand the selectors policy. \"My job is to just focus on doing well as a player, that is all which is my control. \"If I can play in next year's T20 World Cup or the 2023 event it would be great.\"","image_url":null,"source_id":"indiatvnews"},{"title":"Kiwi skipper subjected to cruel final act","link":"https://wwos.nine.com.au/cricket/t20-world-cup-kane-williamson-interrupted-australia-celebrations-singing-press-conference-video/f40cbcf9-7404-4d62-b6fe-27eaaee10f60","keywords":null,"creator":["wwos"],"video_url":null,"description":"New Zealand captain Kane Williamson was forced to grit his teeth and endure what must be one of the cruelest moments in sport.","content":"New Zealand captain Kane Williamson was forced to grit his teeth and endure what must be one of the cruelest moments in sport.The Black Caps had just been belted by Australia by eight wickets in the final of the Twenty20 World Cup.Williamson - one of the nicest guys in international cricket - was speaking to media after watching his World Cup dream go up in smoke.But the press conference was interrupted by the raucous celebrations by the Aussie team right next door.\"Australia played really, really well, and you can hear them celebrating next door,\" Williamson said with a grin.\"And rightly so. They had a fantastic campaign. They're a team full of amazing players and they really stood up today.\"He's not the first person to have to endure the awkward moment, and he won't be the last.But given he's loved by cricket fans around the world - not just in New Zealand - it was hard not to feel a little sorry for the Black Caps skipper.READ MORE: Mitchell Marsh's three ball onslaught at T20 World CupREAD MORE: World Cup batting masterclass hailed as 'one of the best'READ MORE: Hamilton's horror F1 weekend ends with remarkable gloryhttps://twitter.com/CricSubhayan/status/1459951621295722499?ref_src=twsrc%5Etfwhttps://twitter.com/clutchplay/status/1459950568391122944?ref_src=twsrc%5EtfwFor a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-11-15 08:10:41","full_description":"New Zealand captain Kane Williamson was forced to grit his teeth and endure what must be one of the cruelest moments in sport. The Black Caps had just been belted by Australia by eight wickets in the final of the Twenty20 World Cup . Williamson - one of the nicest guys in international cricket - was speaking to media after watching his World Cup dream go up in smoke. But the press conference was interrupted by the raucous celebrations by the Aussie team right next door. \"Australia played really, really well, and you can hear them celebrating next door,\" Williamson said with a grin. \"And rightly so. They had a fantastic campaign. They're a team full of amazing players and they really stood up today.\" He's not the first person to have to endure the awkward moment, and he won't be the last. But given he's loved by cricket fans around the world - not just in New Zealand - it was hard not to feel a little sorry for the Black Caps skipper. READ MORE: Mitchell Marsh's three ball onslaught at T20 World Cup READ MORE: World Cup batting masterclass hailed as 'one of the best' READ MORE: Hamilton's horror F1 weekend ends with remarkable glory For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/11/393317/pickerimage.jpg","source_id":"nine"},{"title":"The line between banter and bullying in sport is a blurred one | Sean Ingle","link":"https://www.theguardian.com/sport/blog/2021/nov/15/the-line-between-banter-and-bullying-in-sport-is-a-blurred-one","keywords":["Sport","Race"],"creator":["Sean Ingle"],"video_url":null,"description":"Research reveals there can be a ‘positive’ aspect to some jokes but there needs to be more education to eradicate bullyingOf all the distressing stories to emerge from the racism scandal at Yorkshire County Cricket Club, one of the most shocking was an independent panel found the repeated use of the P-word against Azeem Rafiq was delivered “in the spirit of friendly banter”. Perhaps we shouldn’t be surprised. “It’s just banter,” has long been a get-out-of-jail-free card to excuse laddism, sexism and much else besides. Yet speak to anyone in sport, and they stress that it is also vital for bonding and team-building.The question is: when does banter cross the line into bullying? On the surface, it doesn’t sound that complicated. When Gary Ballance admitted he had used racist language towards Rafiq during their time as teammates, but said it was a feature of their “friendly” two-way verbals, few supported him. On the other end of the spectrum, few would take offence at a mild joke about, say, missing a full toss while batting. However two recent academic studies into banter in British sport suggest the terrain in the middle can be more complex to navigate than many think. Continue reading...","content":null,"pubDate":"2021-11-15 08:00:01","full_description":"O f all the distressing stories to emerge from the racism scandal at Yorkshire County Cricket Club, one of the most shocking was an independent panel found the repeated use of the P-word against Azeem Rafiq was delivered “in the spirit of friendly banter”. Perhaps we shouldn’t be surprised. “It’s just banter,” has long been a get-out-of-jail-free card to excuse laddism, sexism and much else besides. Yet speak to anyone in sport, and they stress that it is also vital for bonding and team-building. The question is: when does banter cross the line into bullying? On the surface, it doesn’t sound that complicated. When Gary Ballance admitted he had used racist language towards Rafiq during their time as teammates, but said it was a feature of their “friendly” two-way verbals, few supported him. On the other end of the spectrum, few would take offence at a mild joke about, say, missing a full toss while batting. However two recent academic studies into banter in British sport suggest the terrain in the middle can be more complex to navigate than many think. In the first study, 12 players from a diverse club in the south-east were asked where the line should be drawn between acceptable and unacceptable banter. For them, “calling another guy on the team by a woman’s name because his surname rhymes with it” and “putting pots of mustard in a teammate’s bag, because he hates mustard in his sandwiches” to “[teammate’s name] pretending to ‘bum’ us with his cricket bat during a break in play” were all fine. You may raise your eyebrows at this. However the academics found that such banter “was described by the vast majority of players as having a largely positive effect on the team – and further indicative of the team relationship”. However, it was agreed that a person’s sexuality or ethnic background was off limits. As one British Asian on the team put it: “Things like that should never be involved. I’ve been called things like ‘Paki’ [on the field by opposing players] – that’s not banter, it’s just harassment.” The study’s authors, William Lawless and Rory Magrath, argue a distinction can be made between “inclusionary” forms of banter – which centre on close friendships and is light-hearted and inoffensive – and exclusionary forms, which are beyond the pale. However they also stress that context, and the dynamics of a relationship, are also key. After all, what is said in the confines of a dressing room might sound very different in a courtroom. As they point out, banter can also serve a double function – outwardly appearing aggressive, and yet also relying on an intimate and personal understanding of the recipient. “We also recognise that banter is complex and often contradictory,” they add. “Accordingly, these concepts should be treated as fluid, rather than binary – particularly when one considers the complicated nature of language and its interpretation.” Is it so easy to separate banter into two neat categories? New research into the attitudes of five coaches at leading football academies suggests not. The study – “When it is no longer a bit of banter: Coaches’ perspectives of bullying in professional soccer” – found that coaches largely agreed on the components of bullying, including someone being frequently being targeted and an imbalance of power. However some also felt players needed to “put up” with banter as a demonstration of their mental strength and masculine worth. As one put it: “You’ve got 20 highly testosterone-fuelled lads, it’s not going to be hunky-dory, chummy-chummy, is it?” The academics noted something else too: there was also a feeling within the coaches’ accounts that bullying in football is dependent on the “weaknesses” in personality or mood of the victims. In other words, the coaches felt that those who didn’t get the banter were at least partly to blame. “It suggests that these values are ingrained from the top down in professional soccer, with the result that academy coaches may suppress bullying under the guise of banter,” the academics note. “Therefore, in professional soccer, these terms may not be as separate as first imagined.” Part of the solution, the academics suggest, is the need for better coach education programmes to raise awareness around bullying and the potential severity of banter, and to encourage coaches to be more self-reflective. But, they suggest, it is broader than that, with sport as a whole needing to consider its workplace culture. On Tuesday we should learn more about what went on at Headingley when Rafiq appears before the Commons’ digital, culture, media and sport select committee along with others involved in the scandal, including the club’s former chair, Roger Hutton. All will be free to answer MPs’ questions freely under parliamentary privilege without fear of legal reprisal. But so far only a summary of the club’s 12-month investigation has been made public, which found Rafiq was a victim of “racial harassment and bullying”. Meanwhile Prof James Newman of Sheffield Hallam University, who led the study into football coaches, believes sport as a whole is still too willing to accept behaviour that would be unacceptable in other professions. “It’s hard-wired into sport that there is tolerance of banter, and that individuals are expected to put up with things that wouldn’t be allowed elsewhere,” he told me. “And, as we are increasingly finding out, it is very hard for a player to say ‘you’ve actually offended me’ when their power base perception is so low.”","image_url":"https://i.guim.co.uk/img/media/aa32b059fd67591808d81676ae6580fc689f7285/0_159_6720_4032/master/6720.jpg?width=460&quality=85&auto=format&fit=max&s=9f1922f4d53dab95d42851bc372e3ba9","source_id":"theguardian"},{"title":"New Zealand captain Kane Williamson interrupted by Aussie celebrations after World Cup final - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMipQFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC90MjAtd29ybGQtY3VwLWthbmUtd2lsbGlhbXNvbi1pbnRlcnJ1cHRlZC1hdXN0cmFsaWEtY2VsZWJyYXRpb25zLXNpbmdpbmctcHJlc3MtY29uZmVyZW5jZS12aWRlby9mNDBjYmNmOS03NDA0LTRkNjItYjZmZS0yN2VhYWVlMTBmNjDSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"New Zealand captain Kane Williamson interrupted by Aussie celebrations after World Cup final  Wide World of SportsAustralia claim maiden men's Twenty20 World Cup title as Mitch Marsh carts New Zealand's bowlers  ABC News‘He’ll be man of the tournament’: Finch’s confident prediction about Warner  Sydney Morning Herald‘Pasting’: World reacts as Aussies smash NZ  NEWS.com.auFinch thanks Warner's critics for 'poking the bear'  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2021-11-15 07:59:31","image_url":null,"source_id":"google"},{"title":"Awkward blunder in World Cup celebrations - NEWS.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L2F1c3NpZS1jcmlja2V0ZXJzLWxldC10aGVpci1oYWlyLWRvd24tYWZ0ZXItd2lubmluZy10MjAtd29ybGQtY3VwL25ld3Mtc3RvcnkvNzc2N2JhMGE0MzBjZjEwMzMwNDc0N2M2OTg5ZDgzYTDSAZcBaHR0cHM6Ly93d3cubmV3cy5jb20uYXUvc3BvcnQvY3JpY2tldC9hdXNzaWUtY3JpY2tldGVycy1sZXQtdGhlaXItaGFpci1kb3duLWFmdGVyLXdpbm5pbmctdDIwLXdvcmxkLWN1cC9uZXdzLXN0b3J5Lzc3NjdiYTBhNDMwY2YxMDMzMDQ3NDdjNjk4OWQ4M2EwP2FtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Awkward blunder in World Cup celebrations  NEWS.com.auSki goggles and champagne: How the Australian players celebrated after historic T20 World Cup cricket victory  ABC NewsMitchell Marsh earns redemption in T20 World Cup final, killing New Zealand's hopes in three-ball onslaught  Wide World of SportsAustralia owes ‘hated’ star an apology  NEWS.com.auSelector Bailey drops hint on Marsh's Ashes chances  The RoarView Full coverage on Google News","content":null,"pubDate":"2021-11-15 07:59:00","image_url":null,"source_id":"google"},{"title":"Timeline of triumph: Aussies' path to World Cup glory - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMijAFodHRwczovL3d3dy5jcmlja2V0LmNvbS5hdS9uZXdzL3ZpY3RvcnktdGltZWxpbmUtYWFyb24tZmluY2gtYXVzdHJhbGlhLXdpbi10MjAtd29ybGQtY3VwLWZpcnN0LXRpbWUtYmVhdC1uZXctemVhbGFuZC1tYXJzaC13YXJuZXIvMjAyMS0xMS0xNdIBlQFodHRwczovL3d3dy5jcmlja2V0LmNvbS5hdS9uZXdzL3ZpY3RvcnktdGltZWxpbmUtYWFyb24tZmluY2gtYXVzdHJhbGlhLXdpbi10MjAtd29ybGQtY3VwLWZpcnN0LXRpbWUtYmVhdC1uZXctemVhbGFuZC1tYXJzaC13YXJuZXIvMjAyMS0xMS0xNT9tb2RlPWFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Timeline of triumph: Aussies' path to World Cup glory  cricket.com.auCandice slaps down David Warner claims  NEWS.com.auT20 World Cup final: David Warner etches his name in cricket's history books for all the right reasons  ABC NewsCricket.com.au's unofficial team of the T20 World Cup  cricket.com.auIPL insult to WC’s best: The ‘borderline arrogance’ that sealed Warner’s T20 revenge  Fox SportsView Full coverage on Google News","content":null,"pubDate":"2021-11-15 07:42:14","image_url":null,"source_id":"google"}]}