{"newsArray":[{"title":"India playing politics to spoil Asian Cup spirit: Ehsan Mazari","link":"https://www.nation.com.pk/31-May-2023/india-playing-politics-to-spoil-asian-cup-spirit-ehsan-mazari","keywords":["Sports"],"creator":["Agencies"],"video_url":null,"description":"ISLAMABAD-Federal Minister for Inter-Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India must not play politics in cricket especially when other sports contingents are visiting Pakistan.","content":"ISLAMABAD-Federal Minister for Inter-Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India must not play politics in cricket especially when other sports contingents are visiting Pakistan. The minister said that ‘Pakistan vs India’ is the most watched cricket match in the world and if India play Asia Cricket Cup in Pakistan, there is no doubt in that Pakistan would visit India as well to play the ICC Cricket World Cup. “We need to keep sports and politics separate,” said Mazari, adding that sports is beyond boundaries. The Minister stated that Indian baseball team recently played a tournament in Islamabad in which more than 30 members contingent played along with other nations. He said that an Indian contingent also participated in Bridge Federation of Asia and Middle East (BFAME) Championship organized in Lahore. He said the reluctance and promotion of cricket remains a question mark. Mazari said that government is working on a comprehensive ‘National Sports Policy’ to uplift the sports in the country. He said all stakeholders including Pakistan Olympic Association has been taken on board and the policy would be implemented in true spirit after the approval of the cabinet. He lauded the efforts of Balochistan government on successfully organizing the 34th National Games, after 19 years. He also extended greetings to the winning teams including Army, Wapda and others and assured his all-out support to those athletes, who made the headlines and earned medals for their respective departments and provinces.","pubDate":"2023-05-30 20:45:34","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB holds firm stance on Asia Cup and World Cup: Sources","link":"https://www.nation.com.pk/31-May-2023/pcb-holds-firm-stance-on-asia-cup-and-world-cup-sources","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The Pakistan Cricket Board (PCB) remains unwavering in its position on the Asia Cup, World Cup, and Champions Trophy 2025 issues.","content":"LAHORE-The Pakistan Cricket Board (PCB) remains unwavering in its position on the Asia Cup, World Cup, and Champions Trophy 2025 issues. In a meeting with ICC Chairman Greg Barclay and Chief Executive Geoff Allardice, the PCB reiterated its commitment to abide by the government’s instructions concerning the Pakistan team’s participation in the upcoming mega events scheduled to be held in India. Financial concerns have also been raised, prompting a second round of talks between PCB and ICC officials scheduled for today (Wednesday). The hosting board has expressed reservations about the ICC’s financial model. On the other hand, Bangladesh has made the decision of the ACC final in the matter of the Asia Cup. Jalal Younis, Chairman of Cricket Operations for the Bangladesh Cricket Board (BCB), stated, “Whatever model is adopted, we are ready to play. If it is decided by consensus to hold the competition in the UAE, then we have to play there as well.” The refusal of the Indian team to travel to Pakistan for the Asia Cup scheduled in September this year has caused confusion regarding several international events. In response to this complex situation, the PCB proposed a hybrid model, suggesting that five matches be played in Pakistan while the remaining matches take place at a neutral venue during the initial phase. Najam Sethi, Head of the PCB Management Committee, has repeatedly stated that if disagreements persist regarding the hybrid model, the Pakistani government may decide not to allow the national team to participate in the World Cup in India. The BCCI also took a clear position during a meeting with ACC members, insisting that the entire event should be hosted by a single country, considering the intense heat in the UAE and Sri Lanka. Efforts are underway to organize the tournament, and the final decision will be made during the ACC Executives meeting, which will also involve the PCB. However, due to the interconnected nature of these issues, the complications surrounding the Asia Cup, World Cup, and Champions Trophy 2025, which Pakistan is set to host, have intensified. Meanwhile, the arrival of ICC Chairman Greg Barclay and Chief Executive Geoff Allardice in Lahore holds significant importance. Both officials arrived at Allama Iqbal Airport from Dubai and were provided with tight security as they were escorted to their hotel. At Gaddafi Stadium, PCB Chief Operating Officer Salman Naseer, accompanied by other officials, warmly welcomed the guests. Discussions on the Asia Cup and related matters took place during the meeting. The sources revealed that the PCB has restated its position on traveling to India for the World Cup, affirming its commitment to comply with the government’s instructions regarding participation in the ICC World Cup. The PCB also expressed concerns about the ICC’s financial model, although no progress has been made regarding an increase in the board’s share of revenue. Further negotiations between PCB and ICC officials are scheduled for today (Wednesday).","pubDate":"2023-05-30 20:45:08","image_url":"https://www.nation.com.pk/print_images/large/2023-05-31/pcb-holds-firm-stance-on-asia-cup-and-world-cup-sources-1685479504-1901.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Charith Asalanka to join team tomorrow after tying the knot","link":"https://www.dailymirror.lk/breaking_news/Charith-Asalanka-to-join-team-tomorrow-after-tying-the-knot/108-260131","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka’s 25-year-old batsman Charith Asalanka, who got married on Monday, is expected to join the rest of Sri Lanka’s squad for the ODI series against Afghanistan, tomorrow.","content":"Sri Lanka's 25-year-old batsman Charith Asalanka, who got married on Monday, is expected to join the rest of Sri Lanka's squad for the ODI series against Afghanistan, tomorrow. The cricketer is believed to have invited most of his team members for the wedding, almost all of whom before travelling to Hambantota on Monday evening. Out of 16 players announced for the first two ODIs, 11 players have already joined the squad. Wanindu Hasaranga is currently undergoing rehabilitation for a foot injury, and he will join the team and return to play once he is cleared to do so. He is, however, doubtful for the first ODI. Captain Dasun Shanaka, who was a part of the Gujarat Titans team in the IPL, is set to join the team hotel on Tuesday night. He was not in the Gujarat Titans final eleven team, which lost the title against Chennai Super Kings. The other two Sri Lankan players, Matheesha Pathirana and Maheesh Theekshana, are also scheduled to join on Wednesday morning. (Bipin Dani)","pubDate":"2023-05-30 19:37:12","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_edaa4b4b84.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"पहलवानों के समर्थन में आए भारत के दिग्गज क्रिकेटर अनिल कुंबले, हाथापाई से हैं निराश","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/india-veteran-cricketers-came-in-support-of-wrestlers-disappointed-with-the-scuffle/articleshow/100629808.cms","keywords":null,"creator":null,"video_url":null,"description":"भारत के पूर्व दिग्गज कप्तान अनिल कुंबले ने पहलवानों का समर्थन किया है। उनका मानना है कि विरोध प्रदर्शन करने वाले पहलवानों के साथ जिस तरह का व्यवहार किया गया वह बिल्कुल भी सही नहीं है। रविवार को पहलवान और उनके समर्थक सुरक्षा घेरा तोड़कर नए संसद भवन की ओर बढ़ने की कोशिश की थी।","content":"भारत के महान क्रिकेटर अनिल कुंबले ने को कहा कि वह जंतर-मंतर पर प्रदर्शन कर रहे देश के शीर्ष पहलवानों के खिलाफ हुई पुलिस की कार्रवाई से निराश हैं। जंतर मंतर पर दिल्ली पुलिस ने विनेश फोगाट, साक्षी मलिक, बजरंग पूनिया और संगीता फोगाट सहित ओलंपिक और विश्व चैंपियनशिप के पदक विजेताओं को जबरदस्ती बस में डाला जब रविवार को पहलवानों और उनके सामर्थकों ने सुरक्षा घेरा तोड़कर महिला ‘महापंचायत’ के लिए नए संसद भवन की ओर बढ़ने की कोशिश की। आंदोलनकारी पहलवान भारतीय कुश्ती महासंघ (डब्ल्यूएफआई) के निवर्तमान अध्यक्ष बृजभूषण शरण सिंह की गिरफ्तारी की मांग कर रहे हैं जिन पर उन्होंने एक नाबालिग सहित कई महिला पहलवानों का यौन उत्पीड़न करने का आरोप लगाया है। उन्होंने संसद की नई इमारत के समीप उस दिन महिला महापंचायत का आह्वान किया जिस दिन प्रधानमंत्री नरेंद्र मोदी ने इसका उद्घाटन किया था। लेग स्पिनर कुंबले को लगता है कि इस मुद्दे को बातचीत से सुलझाया जा सकता था। टेस्ट क्रिकेट में चौथे सबसे ज्यादा विकेट झटकने वाले 52 साल के कुंबले ने मंगलवार को कहा, '28 मई को हमारे पहलवानों के साथ जो हाथापाई हुई, उसे सुनकर काफी निराश हूं। हर चीज उचित बातचीत से सुलझाई जा सकती है। इस मुद्दे के जल्द हल निकलने की उम्मीद करता हूं।' सोमवार को ओलंपिक चैम्पियन निशानेबाज अभिनव बिंद्रा, भारत के सबसे सफल फुटबॉलर सुनील छेत्री और पूर्व भारतीय ऑलराउंडर इरफान पठान ने भी पहलवानों के खिलाफ कार्रवाई की आलोचना की थी। आंदोलन कर रहे पहलवानों में साक्षी मलिक, विनेश फोगाट और बजरंग पूनिया सहित देश के शीर्ष पहलवान मंगलवार को गंगा नदी में अपने ओलंपिक और विश्व पदक विसर्जित करने सैकड़ों समर्थकों के साथ यहां पहुंचे लेकिन खाप और किसान नेताओं के मनाने पर ऐसा नहीं किया हालांकि अपनी मांगे मानने के लिये पांच दिन का समय दिया है। प्रदर्शन कर रहे पहलवान जैसे अपने विश्व और ओलंपिक पदक गंगा नदी में बहाने को तैयार हुए वैसे ही ‘हर की पौड़ी’ पर काफी भीड़ इकट्ठा हो गई। साक्षी, विनेश और उनकी चचेरी बहन संगीता सुबकती दिखाई दीं और उनके पति उन्हें सांत्वना देने की कोशिश कर रहे थे। उनके समर्थकों ने उनके चारों ओर घेरा बनाया हुआ था। पहलवान ‘हर की पौड़ी’ पहुंचकर करीब 20 मिनट तक चुपचाप खड़े रहे। फिर वे गंगा नदी के किनारे अपने पदक हाथ में लेकर बैठ गए। बजरंग 40 मिनट बाद वहां पहुंचे। विनेश के पति सोमबीर राठी के पास एशियाई खेलो में विनेश के जीते पदक थे। साक्षी के हाथ में रियो ओलंपिक का कांस्य पदक था।","pubDate":"2023-05-30 17:11:02","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"CSK in IPL 2023: A season unlike any for MS Dhoni and Co.","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/csk-ipl-final-title-ms-dhoni-analysis-review-2023/article66913324.ece","keywords":null,"creator":null,"video_url":null,"description":"‘Rockstar’ Ravindra Jadeja clubbed Mohit Sharma for a six and four off the last two balls to bring home a fifth IPL title.","content":null,"pubDate":"2023-05-30 16:39:31","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"England’s Woakes feared for his Test future after knee injury","link":"https://sportstar.thehindu.com/cricket/england-test-medium-pacer-chris-woakes-feared-for-test-future-after-injury-ashes-news/article66913299.ece","keywords":null,"creator":null,"video_url":null,"description":"The Warwickshire pace-bowling all-rounder was sidelined from first-class cricket for more than a year after knee surgery and has not played a Test since facing the West Indies in March 2022.","content":null,"pubDate":"2023-05-30 16:35:24","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"TNPL 2023: Impact Player rule, DRS to debut; Reserve days for Playoffs","link":"https://sportstar.thehindu.com/cricket/tnpl-tamil-nadu-premier-league-2023-season-impact-players-rule-playoffs-reserve-day-teams-venues-schedule/article66913224.ece","keywords":null,"creator":null,"video_url":null,"description":"TNPL will be played across four venues in the state in Tirunelveli, Salem, Dindigul, and Coimbatore from June 12.","content":null,"pubDate":"2023-05-30 16:13:18","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"CAB chief Snehasish Ganguly urges GCA to get Eden-like full-ground covers before ODI World Cup","link":"https://sportstar.thehindu.com/cricket/eden-gardens-full-ground-cover-narendra-modi-stadium-rains-ipl-final-drainage-snehasish-ganguly/article66913203.ece","keywords":null,"creator":null,"video_url":null,"description":"Unprecedented rain for two consecutive days hit the Indian Premier League summit clash between Gujarat Titans and Chennai Super Kings, with rainwater seeping into side wickets as groundsmen struggled to dry the areas.","content":null,"pubDate":"2023-05-30 16:05:40","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"Asia Cup 2023: एशिया कप के आयोजन के लिए तैयार है श्रीलंका, जल्द हो सकता है बड़ा एलान","link":"https://www.abplive.com/sports/cricket/sri-lanka-cricket-board-bcci-big-annoucement-on-asia-cup-2023-latest-sports-news-2420367","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Asia Cup 2023 News: एशिया कप 2023 की मेजबानी पर पेंच फंसा हुआ है, लेकिन अब जल्द इस पर बड़ा एलान हो सकता है. दरअसल, पिछले दिनों बीसीसीआई ने पाकिस्तान क्रिकेट बोर्ड के हाइब्रिड मॉडल को खारिज कर दिया था. अब ऐसा माना जा रहा है कि एशिया कप 2023 की मेजबानी पाकिस्तान से छीन सकती है. वहीं, एशिया कप की मेजबानी श्रीलंका को मिल सकती है. मीडिया रिपोर्ट्स में कहा जा रहा है कि श्रीलंका क्रिकेट बोर्ड एशिया कप की मेजबानी के लिए तैयार है. ... तो क्या श्रीलंका में खेला जाएगा एशिया कप 2023 के मुकाबले? दरअसल, पिछले दिनों पाकिस्तान क्रिकेट बोर्ड ने हाइब्रिड मॉडल का सुझाव दिया था. इस हाइब्रिड मॉडल के मुताबिक, एशिया कप की मेजबानी पाकिस्तान के पास रहती, लेकिन भारतीय क्रिकेट टीम अपने मुकाबले किसी न्यूट्रल वेन्यू पर खेल सकती थी. यानि, भारत के पास विकल्प था कि वह पाकिस्तान के बजाय बांग्लादेश, श्रीलंका, दुबई या फिर किसी न्यूट्रल वेन्यू पर अपने मुकाबले खेल सकती थी, लेकिन बीसीसीआई ने पाकिस्तान क्रिकेट बोर्ड के सुझाव को ठुकरा दिया. अब खबरें आ रही हैं कि एशिया कप 2023 का आयोजन श्रीलंका में हो सकता है. साथ ही इस पर जल्द ही बड़ा एलान संभव है. पाकिस्तान क्रिकेट बोर्ड का नया हाइब्रिड मॉडल क्या है? पहला प्रपोजल एशिया कप टूर्नामेंट का आयोजन पाकिस्तान में किया जाएगा, लेकिन भारतीय टीम अपने मुकाबले किसी न्यूट्रल वेन्यू पर खेल सकती है. दूसरा प्रपोजल एशिया कप टूर्नामेंट को दो भागों में विभाजित किया जाएगा. पहले राउंड के मैचों की मेजबानी पाकिस्तान करेगा... इस राउंड में भारत के मुकाबले नहीं होंगे. दरअसल, भारतीय टीम अपने मुकाबले दूसरे राउंड में खेलेगी. साथ ही टूर्नामेंट का फाइनल मैच किसी न्यूट्रल वेन्यू पर खेला जाएगा. ये भी पढ़ें- Ambati Rayudu Retirement: अंबाती रायडू ने भारतीय क्रिकेट के सभी फॉर्मेट किया संन्यास एलान, जानिए कैसा रहा घरेलू क्रिकेट में प्रदर्शन IPL 2023: CSK की सक्सेस के पीछे धोनी के साथ कोच की कितनी अहम रही भूमिका, जानिए चेन्नई के पूरे सपोर्ट स्टाफ के बारे में","content":null,"pubDate":"2023-05-30 15:27:46","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/30/5ebe9667c6dc105980440b43532e30a21685457727678428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sri Lanka call up IPL star Pathirana for Afghanistan series","link":"https://sportstar.thehindu.com/cricket/indian-premier-league-csk-matheesha-pathirana-sri-lanka-odi-squad-afghanistan-series/article66912921.ece","keywords":null,"creator":null,"video_url":null,"description":"If he is included in the final team, it will be the 20-year-old Pathirana’s debut for Sri Lanka in a one-day internationals.","content":null,"pubDate":"2023-05-30 15:16:56","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"India playing politics to spoil Asian Cup spirit: Ehsan Mazari","link":"https://www.nation.com.pk/31-May-2023/india-playing-politics-to-spoil-asian-cup-spirit-ehsan-mazari","keywords":["Sports"],"creator":["Agencies"],"video_url":null,"description":"ISLAMABAD-Federal Minister for Inter-Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India must not play politics in cricket especially when other sports contingents are visiting Pakistan.","content":"ISLAMABAD-Federal Minister for Inter-Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India must not play politics in cricket especially when other sports contingents are visiting Pakistan. The minister said that ‘Pakistan vs India’ is the most watched cricket match in the world and if India play Asia Cricket Cup in Pakistan, there is no doubt in that Pakistan would visit India as well to play the ICC Cricket World Cup. “We need to keep sports and politics separate,” said Mazari, adding that sports is beyond boundaries. The Minister stated that Indian baseball team recently played a tournament in Islamabad in which more than 30 members contingent played along with other nations. He said that an Indian contingent also participated in Bridge Federation of Asia and Middle East (BFAME) Championship organized in Lahore. He said the reluctance and promotion of cricket remains a question mark. Mazari said that government is working on a comprehensive ‘National Sports Policy’ to uplift the sports in the country. He said all stakeholders including Pakistan Olympic Association has been taken on board and the policy would be implemented in true spirit after the approval of the cabinet. He lauded the efforts of Balochistan government on successfully organizing the 34th National Games, after 19 years. He also extended greetings to the winning teams including Army, Wapda and others and assured his all-out support to those athletes, who made the headlines and earned medals for their respective departments and provinces.","pubDate":"2023-05-30 20:45:34","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB holds firm stance on Asia Cup and World Cup: Sources","link":"https://www.nation.com.pk/31-May-2023/pcb-holds-firm-stance-on-asia-cup-and-world-cup-sources","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The Pakistan Cricket Board (PCB) remains unwavering in its position on the Asia Cup, World Cup, and Champions Trophy 2025 issues.","content":"LAHORE-The Pakistan Cricket Board (PCB) remains unwavering in its position on the Asia Cup, World Cup, and Champions Trophy 2025 issues. In a meeting with ICC Chairman Greg Barclay and Chief Executive Geoff Allardice, the PCB reiterated its commitment to abide by the government’s instructions concerning the Pakistan team’s participation in the upcoming mega events scheduled to be held in India. Financial concerns have also been raised, prompting a second round of talks between PCB and ICC officials scheduled for today (Wednesday). The hosting board has expressed reservations about the ICC’s financial model. On the other hand, Bangladesh has made the decision of the ACC final in the matter of the Asia Cup. Jalal Younis, Chairman of Cricket Operations for the Bangladesh Cricket Board (BCB), stated, “Whatever model is adopted, we are ready to play. If it is decided by consensus to hold the competition in the UAE, then we have to play there as well.” The refusal of the Indian team to travel to Pakistan for the Asia Cup scheduled in September this year has caused confusion regarding several international events. In response to this complex situation, the PCB proposed a hybrid model, suggesting that five matches be played in Pakistan while the remaining matches take place at a neutral venue during the initial phase. Najam Sethi, Head of the PCB Management Committee, has repeatedly stated that if disagreements persist regarding the hybrid model, the Pakistani government may decide not to allow the national team to participate in the World Cup in India. The BCCI also took a clear position during a meeting with ACC members, insisting that the entire event should be hosted by a single country, considering the intense heat in the UAE and Sri Lanka. Efforts are underway to organize the tournament, and the final decision will be made during the ACC Executives meeting, which will also involve the PCB. However, due to the interconnected nature of these issues, the complications surrounding the Asia Cup, World Cup, and Champions Trophy 2025, which Pakistan is set to host, have intensified. Meanwhile, the arrival of ICC Chairman Greg Barclay and Chief Executive Geoff Allardice in Lahore holds significant importance. Both officials arrived at Allama Iqbal Airport from Dubai and were provided with tight security as they were escorted to their hotel. At Gaddafi Stadium, PCB Chief Operating Officer Salman Naseer, accompanied by other officials, warmly welcomed the guests. Discussions on the Asia Cup and related matters took place during the meeting. The sources revealed that the PCB has restated its position on traveling to India for the World Cup, affirming its commitment to comply with the government’s instructions regarding participation in the ICC World Cup. The PCB also expressed concerns about the ICC’s financial model, although no progress has been made regarding an increase in the board’s share of revenue. Further negotiations between PCB and ICC officials are scheduled for today (Wednesday).","pubDate":"2023-05-30 20:45:08","image_url":"https://www.nation.com.pk/print_images/large/2023-05-31/pcb-holds-firm-stance-on-asia-cup-and-world-cup-sources-1685479504-1901.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Charith Asalanka to join team tomorrow after tying the knot","link":"https://www.dailymirror.lk/breaking_news/Charith-Asalanka-to-join-team-tomorrow-after-tying-the-knot/108-260131","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka’s 25-year-old batsman Charith Asalanka, who got married on Monday, is expected to join the rest of Sri Lanka’s squad for the ODI series against Afghanistan, tomorrow.","content":"Sri Lanka's 25-year-old batsman Charith Asalanka, who got married on Monday, is expected to join the rest of Sri Lanka's squad for the ODI series against Afghanistan, tomorrow. The cricketer is believed to have invited most of his team members for the wedding, almost all of whom before travelling to Hambantota on Monday evening. Out of 16 players announced for the first two ODIs, 11 players have already joined the squad. Wanindu Hasaranga is currently undergoing rehabilitation for a foot injury, and he will join the team and return to play once he is cleared to do so. He is, however, doubtful for the first ODI. Captain Dasun Shanaka, who was a part of the Gujarat Titans team in the IPL, is set to join the team hotel on Tuesday night. He was not in the Gujarat Titans final eleven team, which lost the title against Chennai Super Kings. The other two Sri Lankan players, Matheesha Pathirana and Maheesh Theekshana, are also scheduled to join on Wednesday morning. (Bipin Dani)","pubDate":"2023-05-30 19:37:12","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_edaa4b4b84.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"पहलवानों के समर्थन में आए भारत के दिग्गज क्रिकेटर अनिल कुंबले, हाथापाई से हैं निराश","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/india-veteran-cricketers-came-in-support-of-wrestlers-disappointed-with-the-scuffle/articleshow/100629808.cms","keywords":null,"creator":null,"video_url":null,"description":"भारत के पूर्व दिग्गज कप्तान अनिल कुंबले ने पहलवानों का समर्थन किया है। उनका मानना है कि विरोध प्रदर्शन करने वाले पहलवानों के साथ जिस तरह का व्यवहार किया गया वह बिल्कुल भी सही नहीं है। रविवार को पहलवान और उनके समर्थक सुरक्षा घेरा तोड़कर नए संसद भवन की ओर बढ़ने की कोशिश की थी।","content":"भारत के महान क्रिकेटर अनिल कुंबले ने को कहा कि वह जंतर-मंतर पर प्रदर्शन कर रहे देश के शीर्ष पहलवानों के खिलाफ हुई पुलिस की कार्रवाई से निराश हैं। जंतर मंतर पर दिल्ली पुलिस ने विनेश फोगाट, साक्षी मलिक, बजरंग पूनिया और संगीता फोगाट सहित ओलंपिक और विश्व चैंपियनशिप के पदक विजेताओं को जबरदस्ती बस में डाला जब रविवार को पहलवानों और उनके सामर्थकों ने सुरक्षा घेरा तोड़कर महिला ‘महापंचायत’ के लिए नए संसद भवन की ओर बढ़ने की कोशिश की। आंदोलनकारी पहलवान भारतीय कुश्ती महासंघ (डब्ल्यूएफआई) के निवर्तमान अध्यक्ष बृजभूषण शरण सिंह की गिरफ्तारी की मांग कर रहे हैं जिन पर उन्होंने एक नाबालिग सहित कई महिला पहलवानों का यौन उत्पीड़न करने का आरोप लगाया है। उन्होंने संसद की नई इमारत के समीप उस दिन महिला महापंचायत का आह्वान किया जिस दिन प्रधानमंत्री नरेंद्र मोदी ने इसका उद्घाटन किया था। लेग स्पिनर कुंबले को लगता है कि इस मुद्दे को बातचीत से सुलझाया जा सकता था। टेस्ट क्रिकेट में चौथे सबसे ज्यादा विकेट झटकने वाले 52 साल के कुंबले ने मंगलवार को कहा, '28 मई को हमारे पहलवानों के साथ जो हाथापाई हुई, उसे सुनकर काफी निराश हूं। हर चीज उचित बातचीत से सुलझाई जा सकती है। इस मुद्दे के जल्द हल निकलने की उम्मीद करता हूं।' सोमवार को ओलंपिक चैम्पियन निशानेबाज अभिनव बिंद्रा, भारत के सबसे सफल फुटबॉलर सुनील छेत्री और पूर्व भारतीय ऑलराउंडर इरफान पठान ने भी पहलवानों के खिलाफ कार्रवाई की आलोचना की थी। आंदोलन कर रहे पहलवानों में साक्षी मलिक, विनेश फोगाट और बजरंग पूनिया सहित देश के शीर्ष पहलवान मंगलवार को गंगा नदी में अपने ओलंपिक और विश्व पदक विसर्जित करने सैकड़ों समर्थकों के साथ यहां पहुंचे लेकिन खाप और किसान नेताओं के मनाने पर ऐसा नहीं किया हालांकि अपनी मांगे मानने के लिये पांच दिन का समय दिया है। प्रदर्शन कर रहे पहलवान जैसे अपने विश्व और ओलंपिक पदक गंगा नदी में बहाने को तैयार हुए वैसे ही ‘हर की पौड़ी’ पर काफी भीड़ इकट्ठा हो गई। साक्षी, विनेश और उनकी चचेरी बहन संगीता सुबकती दिखाई दीं और उनके पति उन्हें सांत्वना देने की कोशिश कर रहे थे। उनके समर्थकों ने उनके चारों ओर घेरा बनाया हुआ था। पहलवान ‘हर की पौड़ी’ पहुंचकर करीब 20 मिनट तक चुपचाप खड़े रहे। फिर वे गंगा नदी के किनारे अपने पदक हाथ में लेकर बैठ गए। बजरंग 40 मिनट बाद वहां पहुंचे। विनेश के पति सोमबीर राठी के पास एशियाई खेलो में विनेश के जीते पदक थे। साक्षी के हाथ में रियो ओलंपिक का कांस्य पदक था।","pubDate":"2023-05-30 17:11:02","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"CSK in IPL 2023: A season unlike any for MS Dhoni and Co.","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/csk-ipl-final-title-ms-dhoni-analysis-review-2023/article66913324.ece","keywords":null,"creator":null,"video_url":null,"description":"‘Rockstar’ Ravindra Jadeja clubbed Mohit Sharma for a six and four off the last two balls to bring home a fifth IPL title.","content":null,"pubDate":"2023-05-30 16:39:31","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"England’s Woakes feared for his Test future after knee injury","link":"https://sportstar.thehindu.com/cricket/england-test-medium-pacer-chris-woakes-feared-for-test-future-after-injury-ashes-news/article66913299.ece","keywords":null,"creator":null,"video_url":null,"description":"The Warwickshire pace-bowling all-rounder was sidelined from first-class cricket for more than a year after knee surgery and has not played a Test since facing the West Indies in March 2022.","content":null,"pubDate":"2023-05-30 16:35:24","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"TNPL 2023: Impact Player rule, DRS to debut; Reserve days for Playoffs","link":"https://sportstar.thehindu.com/cricket/tnpl-tamil-nadu-premier-league-2023-season-impact-players-rule-playoffs-reserve-day-teams-venues-schedule/article66913224.ece","keywords":null,"creator":null,"video_url":null,"description":"TNPL will be played across four venues in the state in Tirunelveli, Salem, Dindigul, and Coimbatore from June 12.","content":null,"pubDate":"2023-05-30 16:13:18","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"CAB chief Snehasish Ganguly urges GCA to get Eden-like full-ground covers before ODI World Cup","link":"https://sportstar.thehindu.com/cricket/eden-gardens-full-ground-cover-narendra-modi-stadium-rains-ipl-final-drainage-snehasish-ganguly/article66913203.ece","keywords":null,"creator":null,"video_url":null,"description":"Unprecedented rain for two consecutive days hit the Indian Premier League summit clash between Gujarat Titans and Chennai Super Kings, with rainwater seeping into side wickets as groundsmen struggled to dry the areas.","content":null,"pubDate":"2023-05-30 16:05:40","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"Asia Cup 2023: एशिया कप के आयोजन के लिए तैयार है श्रीलंका, जल्द हो सकता है बड़ा एलान","link":"https://www.abplive.com/sports/cricket/sri-lanka-cricket-board-bcci-big-annoucement-on-asia-cup-2023-latest-sports-news-2420367","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Asia Cup 2023 News: एशिया कप 2023 की मेजबानी पर पेंच फंसा हुआ है, लेकिन अब जल्द इस पर बड़ा एलान हो सकता है. दरअसल, पिछले दिनों बीसीसीआई ने पाकिस्तान क्रिकेट बोर्ड के हाइब्रिड मॉडल को खारिज कर दिया था. अब ऐसा माना जा रहा है कि एशिया कप 2023 की मेजबानी पाकिस्तान से छीन सकती है. वहीं, एशिया कप की मेजबानी श्रीलंका को मिल सकती है. मीडिया रिपोर्ट्स में कहा जा रहा है कि श्रीलंका क्रिकेट बोर्ड एशिया कप की मेजबानी के लिए तैयार है. ... तो क्या श्रीलंका में खेला जाएगा एशिया कप 2023 के मुकाबले? दरअसल, पिछले दिनों पाकिस्तान क्रिकेट बोर्ड ने हाइब्रिड मॉडल का सुझाव दिया था. इस हाइब्रिड मॉडल के मुताबिक, एशिया कप की मेजबानी पाकिस्तान के पास रहती, लेकिन भारतीय क्रिकेट टीम अपने मुकाबले किसी न्यूट्रल वेन्यू पर खेल सकती थी. यानि, भारत के पास विकल्प था कि वह पाकिस्तान के बजाय बांग्लादेश, श्रीलंका, दुबई या फिर किसी न्यूट्रल वेन्यू पर अपने मुकाबले खेल सकती थी, लेकिन बीसीसीआई ने पाकिस्तान क्रिकेट बोर्ड के सुझाव को ठुकरा दिया. अब खबरें आ रही हैं कि एशिया कप 2023 का आयोजन श्रीलंका में हो सकता है. साथ ही इस पर जल्द ही बड़ा एलान संभव है. पाकिस्तान क्रिकेट बोर्ड का नया हाइब्रिड मॉडल क्या है? पहला प्रपोजल एशिया कप टूर्नामेंट का आयोजन पाकिस्तान में किया जाएगा, लेकिन भारतीय टीम अपने मुकाबले किसी न्यूट्रल वेन्यू पर खेल सकती है. दूसरा प्रपोजल एशिया कप टूर्नामेंट को दो भागों में विभाजित किया जाएगा. पहले राउंड के मैचों की मेजबानी पाकिस्तान करेगा... इस राउंड में भारत के मुकाबले नहीं होंगे. दरअसल, भारतीय टीम अपने मुकाबले दूसरे राउंड में खेलेगी. साथ ही टूर्नामेंट का फाइनल मैच किसी न्यूट्रल वेन्यू पर खेला जाएगा. ये भी पढ़ें- Ambati Rayudu Retirement: अंबाती रायडू ने भारतीय क्रिकेट के सभी फॉर्मेट किया संन्यास एलान, जानिए कैसा रहा घरेलू क्रिकेट में प्रदर्शन IPL 2023: CSK की सक्सेस के पीछे धोनी के साथ कोच की कितनी अहम रही भूमिका, जानिए चेन्नई के पूरे सपोर्ट स्टाफ के बारे में","content":null,"pubDate":"2023-05-30 15:27:46","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/30/5ebe9667c6dc105980440b43532e30a21685457727678428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sri Lanka call up IPL star Pathirana for Afghanistan series","link":"https://sportstar.thehindu.com/cricket/indian-premier-league-csk-matheesha-pathirana-sri-lanka-odi-squad-afghanistan-series/article66912921.ece","keywords":null,"creator":null,"video_url":null,"description":"If he is included in the final team, it will be the 20-year-old Pathirana’s debut for Sri Lanka in a one-day internationals.","content":null,"pubDate":"2023-05-30 15:16:56","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"India playing politics to spoil Asian Cup spirit: Ehsan Mazari","link":"https://www.nation.com.pk/31-May-2023/india-playing-politics-to-spoil-asian-cup-spirit-ehsan-mazari","keywords":["Sports"],"creator":["Agencies"],"video_url":null,"description":"ISLAMABAD-Federal Minister for Inter-Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India must not play politics in cricket especially when other sports contingents are visiting Pakistan.","content":"ISLAMABAD-Federal Minister for Inter-Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India must not play politics in cricket especially when other sports contingents are visiting Pakistan. The minister said that ‘Pakistan vs India’ is the most watched cricket match in the world and if India play Asia Cricket Cup in Pakistan, there is no doubt in that Pakistan would visit India as well to play the ICC Cricket World Cup. “We need to keep sports and politics separate,” said Mazari, adding that sports is beyond boundaries. The Minister stated that Indian baseball team recently played a tournament in Islamabad in which more than 30 members contingent played along with other nations. He said that an Indian contingent also participated in Bridge Federation of Asia and Middle East (BFAME) Championship organized in Lahore. He said the reluctance and promotion of cricket remains a question mark. Mazari said that government is working on a comprehensive ‘National Sports Policy’ to uplift the sports in the country. He said all stakeholders including Pakistan Olympic Association has been taken on board and the policy would be implemented in true spirit after the approval of the cabinet. He lauded the efforts of Balochistan government on successfully organizing the 34th National Games, after 19 years. He also extended greetings to the winning teams including Army, Wapda and others and assured his all-out support to those athletes, who made the headlines and earned medals for their respective departments and provinces.","pubDate":"2023-05-30 20:45:34","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB holds firm stance on Asia Cup and World Cup: Sources","link":"https://www.nation.com.pk/31-May-2023/pcb-holds-firm-stance-on-asia-cup-and-world-cup-sources","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The Pakistan Cricket Board (PCB) remains unwavering in its position on the Asia Cup, World Cup, and Champions Trophy 2025 issues.","content":"LAHORE-The Pakistan Cricket Board (PCB) remains unwavering in its position on the Asia Cup, World Cup, and Champions Trophy 2025 issues. In a meeting with ICC Chairman Greg Barclay and Chief Executive Geoff Allardice, the PCB reiterated its commitment to abide by the government’s instructions concerning the Pakistan team’s participation in the upcoming mega events scheduled to be held in India. Financial concerns have also been raised, prompting a second round of talks between PCB and ICC officials scheduled for today (Wednesday). The hosting board has expressed reservations about the ICC’s financial model. On the other hand, Bangladesh has made the decision of the ACC final in the matter of the Asia Cup. Jalal Younis, Chairman of Cricket Operations for the Bangladesh Cricket Board (BCB), stated, “Whatever model is adopted, we are ready to play. If it is decided by consensus to hold the competition in the UAE, then we have to play there as well.” The refusal of the Indian team to travel to Pakistan for the Asia Cup scheduled in September this year has caused confusion regarding several international events. In response to this complex situation, the PCB proposed a hybrid model, suggesting that five matches be played in Pakistan while the remaining matches take place at a neutral venue during the initial phase. Najam Sethi, Head of the PCB Management Committee, has repeatedly stated that if disagreements persist regarding the hybrid model, the Pakistani government may decide not to allow the national team to participate in the World Cup in India. The BCCI also took a clear position during a meeting with ACC members, insisting that the entire event should be hosted by a single country, considering the intense heat in the UAE and Sri Lanka. Efforts are underway to organize the tournament, and the final decision will be made during the ACC Executives meeting, which will also involve the PCB. However, due to the interconnected nature of these issues, the complications surrounding the Asia Cup, World Cup, and Champions Trophy 2025, which Pakistan is set to host, have intensified. Meanwhile, the arrival of ICC Chairman Greg Barclay and Chief Executive Geoff Allardice in Lahore holds significant importance. Both officials arrived at Allama Iqbal Airport from Dubai and were provided with tight security as they were escorted to their hotel. At Gaddafi Stadium, PCB Chief Operating Officer Salman Naseer, accompanied by other officials, warmly welcomed the guests. Discussions on the Asia Cup and related matters took place during the meeting. The sources revealed that the PCB has restated its position on traveling to India for the World Cup, affirming its commitment to comply with the government’s instructions regarding participation in the ICC World Cup. The PCB also expressed concerns about the ICC’s financial model, although no progress has been made regarding an increase in the board’s share of revenue. Further negotiations between PCB and ICC officials are scheduled for today (Wednesday).","pubDate":"2023-05-30 20:45:08","image_url":"https://www.nation.com.pk/print_images/large/2023-05-31/pcb-holds-firm-stance-on-asia-cup-and-world-cup-sources-1685479504-1901.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Charith Asalanka to join team tomorrow after tying the knot","link":"https://www.dailymirror.lk/breaking_news/Charith-Asalanka-to-join-team-tomorrow-after-tying-the-knot/108-260131","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka’s 25-year-old batsman Charith Asalanka, who got married on Monday, is expected to join the rest of Sri Lanka’s squad for the ODI series against Afghanistan, tomorrow.","content":"Sri Lanka's 25-year-old batsman Charith Asalanka, who got married on Monday, is expected to join the rest of Sri Lanka's squad for the ODI series against Afghanistan, tomorrow. The cricketer is believed to have invited most of his team members for the wedding, almost all of whom before travelling to Hambantota on Monday evening. Out of 16 players announced for the first two ODIs, 11 players have already joined the squad. Wanindu Hasaranga is currently undergoing rehabilitation for a foot injury, and he will join the team and return to play once he is cleared to do so. He is, however, doubtful for the first ODI. Captain Dasun Shanaka, who was a part of the Gujarat Titans team in the IPL, is set to join the team hotel on Tuesday night. He was not in the Gujarat Titans final eleven team, which lost the title against Chennai Super Kings. The other two Sri Lankan players, Matheesha Pathirana and Maheesh Theekshana, are also scheduled to join on Wednesday morning. (Bipin Dani)","pubDate":"2023-05-30 19:37:12","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_edaa4b4b84.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"पहलवानों के समर्थन में आए भारत के दिग्गज क्रिकेटर अनिल कुंबले, हाथापाई से हैं निराश","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/india-veteran-cricketers-came-in-support-of-wrestlers-disappointed-with-the-scuffle/articleshow/100629808.cms","keywords":null,"creator":null,"video_url":null,"description":"भारत के पूर्व दिग्गज कप्तान अनिल कुंबले ने पहलवानों का समर्थन किया है। उनका मानना है कि विरोध प्रदर्शन करने वाले पहलवानों के साथ जिस तरह का व्यवहार किया गया वह बिल्कुल भी सही नहीं है। रविवार को पहलवान और उनके समर्थक सुरक्षा घेरा तोड़कर नए संसद भवन की ओर बढ़ने की कोशिश की थी।","content":"भारत के महान क्रिकेटर अनिल कुंबले ने को कहा कि वह जंतर-मंतर पर प्रदर्शन कर रहे देश के शीर्ष पहलवानों के खिलाफ हुई पुलिस की कार्रवाई से निराश हैं। जंतर मंतर पर दिल्ली पुलिस ने विनेश फोगाट, साक्षी मलिक, बजरंग पूनिया और संगीता फोगाट सहित ओलंपिक और विश्व चैंपियनशिप के पदक विजेताओं को जबरदस्ती बस में डाला जब रविवार को पहलवानों और उनके सामर्थकों ने सुरक्षा घेरा तोड़कर महिला ‘महापंचायत’ के लिए नए संसद भवन की ओर बढ़ने की कोशिश की। आंदोलनकारी पहलवान भारतीय कुश्ती महासंघ (डब्ल्यूएफआई) के निवर्तमान अध्यक्ष बृजभूषण शरण सिंह की गिरफ्तारी की मांग कर रहे हैं जिन पर उन्होंने एक नाबालिग सहित कई महिला पहलवानों का यौन उत्पीड़न करने का आरोप लगाया है। उन्होंने संसद की नई इमारत के समीप उस दिन महिला महापंचायत का आह्वान किया जिस दिन प्रधानमंत्री नरेंद्र मोदी ने इसका उद्घाटन किया था। लेग स्पिनर कुंबले को लगता है कि इस मुद्दे को बातचीत से सुलझाया जा सकता था। टेस्ट क्रिकेट में चौथे सबसे ज्यादा विकेट झटकने वाले 52 साल के कुंबले ने मंगलवार को कहा, '28 मई को हमारे पहलवानों के साथ जो हाथापाई हुई, उसे सुनकर काफी निराश हूं। हर चीज उचित बातचीत से सुलझाई जा सकती है। इस मुद्दे के जल्द हल निकलने की उम्मीद करता हूं।' सोमवार को ओलंपिक चैम्पियन निशानेबाज अभिनव बिंद्रा, भारत के सबसे सफल फुटबॉलर सुनील छेत्री और पूर्व भारतीय ऑलराउंडर इरफान पठान ने भी पहलवानों के खिलाफ कार्रवाई की आलोचना की थी। आंदोलन कर रहे पहलवानों में साक्षी मलिक, विनेश फोगाट और बजरंग पूनिया सहित देश के शीर्ष पहलवान मंगलवार को गंगा नदी में अपने ओलंपिक और विश्व पदक विसर्जित करने सैकड़ों समर्थकों के साथ यहां पहुंचे लेकिन खाप और किसान नेताओं के मनाने पर ऐसा नहीं किया हालांकि अपनी मांगे मानने के लिये पांच दिन का समय दिया है। प्रदर्शन कर रहे पहलवान जैसे अपने विश्व और ओलंपिक पदक गंगा नदी में बहाने को तैयार हुए वैसे ही ‘हर की पौड़ी’ पर काफी भीड़ इकट्ठा हो गई। साक्षी, विनेश और उनकी चचेरी बहन संगीता सुबकती दिखाई दीं और उनके पति उन्हें सांत्वना देने की कोशिश कर रहे थे। उनके समर्थकों ने उनके चारों ओर घेरा बनाया हुआ था। पहलवान ‘हर की पौड़ी’ पहुंचकर करीब 20 मिनट तक चुपचाप खड़े रहे। फिर वे गंगा नदी के किनारे अपने पदक हाथ में लेकर बैठ गए। बजरंग 40 मिनट बाद वहां पहुंचे। विनेश के पति सोमबीर राठी के पास एशियाई खेलो में विनेश के जीते पदक थे। साक्षी के हाथ में रियो ओलंपिक का कांस्य पदक था।","pubDate":"2023-05-30 17:11:02","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"CSK in IPL 2023: A season unlike any for MS Dhoni and Co.","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/csk-ipl-final-title-ms-dhoni-analysis-review-2023/article66913324.ece","keywords":null,"creator":null,"video_url":null,"description":"‘Rockstar’ Ravindra Jadeja clubbed Mohit Sharma for a six and four off the last two balls to bring home a fifth IPL title.","content":null,"pubDate":"2023-05-30 16:39:31","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"England’s Woakes feared for his Test future after knee injury","link":"https://sportstar.thehindu.com/cricket/england-test-medium-pacer-chris-woakes-feared-for-test-future-after-injury-ashes-news/article66913299.ece","keywords":null,"creator":null,"video_url":null,"description":"The Warwickshire pace-bowling all-rounder was sidelined from first-class cricket for more than a year after knee surgery and has not played a Test since facing the West Indies in March 2022.","content":null,"pubDate":"2023-05-30 16:35:24","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"TNPL 2023: Impact Player rule, DRS to debut; Reserve days for Playoffs","link":"https://sportstar.thehindu.com/cricket/tnpl-tamil-nadu-premier-league-2023-season-impact-players-rule-playoffs-reserve-day-teams-venues-schedule/article66913224.ece","keywords":null,"creator":null,"video_url":null,"description":"TNPL will be played across four venues in the state in Tirunelveli, Salem, Dindigul, and Coimbatore from June 12.","content":null,"pubDate":"2023-05-30 16:13:18","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"CAB chief Snehasish Ganguly urges GCA to get Eden-like full-ground covers before ODI World Cup","link":"https://sportstar.thehindu.com/cricket/eden-gardens-full-ground-cover-narendra-modi-stadium-rains-ipl-final-drainage-snehasish-ganguly/article66913203.ece","keywords":null,"creator":null,"video_url":null,"description":"Unprecedented rain for two consecutive days hit the Indian Premier League summit clash between Gujarat Titans and Chennai Super Kings, with rainwater seeping into side wickets as groundsmen struggled to dry the areas.","content":null,"pubDate":"2023-05-30 16:05:40","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"Asia Cup 2023: एशिया कप के आयोजन के लिए तैयार है श्रीलंका, जल्द हो सकता है बड़ा एलान","link":"https://www.abplive.com/sports/cricket/sri-lanka-cricket-board-bcci-big-annoucement-on-asia-cup-2023-latest-sports-news-2420367","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Asia Cup 2023 News: एशिया कप 2023 की मेजबानी पर पेंच फंसा हुआ है, लेकिन अब जल्द इस पर बड़ा एलान हो सकता है. दरअसल, पिछले दिनों बीसीसीआई ने पाकिस्तान क्रिकेट बोर्ड के हाइब्रिड मॉडल को खारिज कर दिया था. अब ऐसा माना जा रहा है कि एशिया कप 2023 की मेजबानी पाकिस्तान से छीन सकती है. वहीं, एशिया कप की मेजबानी श्रीलंका को मिल सकती है. मीडिया रिपोर्ट्स में कहा जा रहा है कि श्रीलंका क्रिकेट बोर्ड एशिया कप की मेजबानी के लिए तैयार है. ... तो क्या श्रीलंका में खेला जाएगा एशिया कप 2023 के मुकाबले? दरअसल, पिछले दिनों पाकिस्तान क्रिकेट बोर्ड ने हाइब्रिड मॉडल का सुझाव दिया था. इस हाइब्रिड मॉडल के मुताबिक, एशिया कप की मेजबानी पाकिस्तान के पास रहती, लेकिन भारतीय क्रिकेट टीम अपने मुकाबले किसी न्यूट्रल वेन्यू पर खेल सकती थी. यानि, भारत के पास विकल्प था कि वह पाकिस्तान के बजाय बांग्लादेश, श्रीलंका, दुबई या फिर किसी न्यूट्रल वेन्यू पर अपने मुकाबले खेल सकती थी, लेकिन बीसीसीआई ने पाकिस्तान क्रिकेट बोर्ड के सुझाव को ठुकरा दिया. अब खबरें आ रही हैं कि एशिया कप 2023 का आयोजन श्रीलंका में हो सकता है. साथ ही इस पर जल्द ही बड़ा एलान संभव है. पाकिस्तान क्रिकेट बोर्ड का नया हाइब्रिड मॉडल क्या है? पहला प्रपोजल एशिया कप टूर्नामेंट का आयोजन पाकिस्तान में किया जाएगा, लेकिन भारतीय टीम अपने मुकाबले किसी न्यूट्रल वेन्यू पर खेल सकती है. दूसरा प्रपोजल एशिया कप टूर्नामेंट को दो भागों में विभाजित किया जाएगा. पहले राउंड के मैचों की मेजबानी पाकिस्तान करेगा... इस राउंड में भारत के मुकाबले नहीं होंगे. दरअसल, भारतीय टीम अपने मुकाबले दूसरे राउंड में खेलेगी. साथ ही टूर्नामेंट का फाइनल मैच किसी न्यूट्रल वेन्यू पर खेला जाएगा. ये भी पढ़ें- Ambati Rayudu Retirement: अंबाती रायडू ने भारतीय क्रिकेट के सभी फॉर्मेट किया संन्यास एलान, जानिए कैसा रहा घरेलू क्रिकेट में प्रदर्शन IPL 2023: CSK की सक्सेस के पीछे धोनी के साथ कोच की कितनी अहम रही भूमिका, जानिए चेन्नई के पूरे सपोर्ट स्टाफ के बारे में","content":null,"pubDate":"2023-05-30 15:27:46","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/30/5ebe9667c6dc105980440b43532e30a21685457727678428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sri Lanka call up IPL star Pathirana for Afghanistan series","link":"https://sportstar.thehindu.com/cricket/indian-premier-league-csk-matheesha-pathirana-sri-lanka-odi-squad-afghanistan-series/article66912921.ece","keywords":null,"creator":null,"video_url":null,"description":"If he is included in the final team, it will be the 20-year-old Pathirana’s debut for Sri Lanka in a one-day internationals.","content":null,"pubDate":"2023-05-30 15:16:56","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"}]}