{"newsArray":[{"title":"Sri Lanka makes cricket history as Aussies sink to 20-year low","link":"https://au.sports.yahoo.com/cricket-2022-sri-lanka-makes-history-aussies-20-year-low-234509683.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-06-19 23:45:09","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/3c97cef0-f029-11ec-9dcf-e4b3fada8d42","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sri Lanka vs Australia ODI tickets: SL vs AUS tickets booking 4th ODI Colombo","link":"https://thesportsrush.com/cricket-news-sri-lanka-vs-australia-odi-tickets-sl-vs-aus-tickets-booking-4th-odi-colombo/","keywords":["Cricket","Australia tour of Sri Lanka 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sri Lanka vs Australia ODI tickets: High on confidence Sri Lanka will take on the Aussies to clinch the five-match ODI series. A resounding six-wicket victory on the back of some fine contributions from Pathum Nissanka (137 off 147) and Kusal Mendis (87 off 85) in the third ODI versus Australia, has meant that Sri… The post Sri Lanka vs Australia ODI tickets: SL vs AUS tickets booking 4th ODI Colombo appeared first on The SportsRush.","content":"Sri Lanka vs Australia ODI tickets: High on confidence Sri Lanka will take on the Aussies to clinch the five-match ODI series. A resounding six-wicket victory on the back of some fine contributions from Pathum Nissanka (137 off 147) and Kusal Mendis (87 off 85) in the third ODI versus Australia, has meant that Sri Lanka are just one step away from clinching the five-match ODI series. Ever since their jaw-dropping victory during the third T20I against the Aussies a few days ago, the Dasun Shanaka-led side have continued to produce some awe-inspiring performances with both bat and the ball, from both their experienced and young players alike. Australia, on the other hand, have been poor with the ball, especially during the death. One more loss in the upcoming two matches would mean that they would lose an away ODI series against Sri Lanka for the first time since 1992. The fourth ODI would, akin the previous one, take place at the R. Premadasa Stadium on June 21, with Sri Lanka perhaps taking the field with a slight advantage after registering their highest successful chase in history at this venue on Sunday. Pathum Nissanka (137) and Kusal Mendis (87) led the charge as Sri Lanka beat Australia by 6 wickets! Sri Lanka take a 2️⃣-1️⃣ series lead 💪 #SLvAUS pic.twitter.com/RP4bDjrtTr — Sri Lanka Cricket 🇱🇰 (@OfficialSLC) June 19, 2022 With a series victory up on the cards, expect a full house yet again at the R. Premadasa Stadium on Tuesday. The interested ones are advised to book their tickets as quickly as possible as seats have already started to fill quickly, with the lowest two price category tickets- LKR 300 and LKR 1500, already sold out. The tickets for the remaining three price categories – LKR 2500, LKR 4000, and LKR 5000 are still available online. One can click here to go directly to the ‘BookMyShow’ ticket booking window. Post that, click on the preferred price category and select the number of tickets you wish to book along with preferred stand. After completing the payment formalities, the ticket holders would have to physically collects from the venue a day before the match from 09:00 am- 05:00 pm.","pubDate":"2022-06-19 20:52:04","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sri Lanka beats Australia by six wickets in Colombo to take a 2-1 lead in the ODI series - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTA2LTIwL3NyaS1sYW5rYS1iZWF0cy1hdXN0cmFsaWEtaW4tdGhpcmQtb2RpLWluLWNvbG9tYm8vMTAxMTY2MTgy0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka beats Australia by six wickets in Colombo to take a 2-1 lead in the ODI series  ABC NewsBig problem in historic Aussie ODI defeat  news.com.auCarey not surprised by 'cagey' Kuhnemann's instant impact | Sri Lanka v Australia 2022  cricket.com.auStar’s ‘all-time’ destruction exposes big Aussie ODI issue in 10-year first  Fox SportsNissanka century helps Sri Lanka to record ODI chase against Australia  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-06-19 20:51:27","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Jason Roy talks up benefits of break from cricket as quickfire half-century helps England down Netherlands","link":"https://www.standard.co.uk/sport/cricket/jason-roy-netherlands-england-b1007055.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"Jason Roy revealed he went through a \"dark time\" over the winter and believes a couple of months of normal family life played a key role in his latest star turn for England.","content":null,"pubDate":"2022-06-19 20:46:55","image_url":"https://static.standard.co.uk/2022/06/19/21/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"De Engelsen zijn in het cricket op alle fronten de bovenliggende partij","link":"https://www.nrc.nl/nieuws/2022/06/19/de-engelsen-zijn-in-cricket-op-alle-fronten-in-overtal-a4133964","keywords":["Sport"],"creator":null,"video_url":null,"description":"De Nederlandse ploeg speelt als enige kleine cricketland in de Super League. Wereldkampioen Engeland is op bezoek in Amstelveen.","content":null,"pubDate":"2022-06-19 20:06:04","image_url":"https://images.nrc.nl/mq3INkcZKRiKcrt806TpWBufzzo=/1280x/filters:no_upscale()/s3/static.nrc.nl/images/gn4/stripped/data87299574-df3e14.jpg","source_id":"nrc","country":["netherland"],"category":["sports"],"language":"dutch"},{"title":"NED vs ENG 2022: ICC Cricket World Cup Super League points table (updated) as on June 19","link":"https://www.sportskeeda.com/cricket/news-ned-vs-eng-2022-icc-cricket-world-cup-super-league-points-table-updated-june-19?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2022-06-19 19:32:54","image_url":"https://static.sportskeeda.com/editor/2022/06/19a74-16556609678139-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Star’s ‘all-time’ destruction exposes big Aussie ODI issue in 10-year first - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMixwFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvYXVzdHJhbGlhL2F1c3RyYWxpYS12cy1zcmktbGFua2EtbGl2ZS1jcmlja2V0LXNjb3Jlcy10aGlyZC1vZGktaG93LXRvLXdhdGNoLXN0cmVhbS1zdGFydC10aW1lLXRlYW1zLXVwZGF0ZXMtaW4tY29sb21iby9uZXdzLXN0b3J5LzU3MzA5NmNhM2NkYWQ4ODNiMzJiNzAzYTJkZDFhMTM00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Star’s ‘all-time’ destruction exposes big Aussie ODI issue in 10-year first  Fox SportsCarey not surprised by 'cagey' Kuhnemann's instant impact | Sri Lanka v Australia 2022  cricket.com.auBig problem in historic Aussie ODI defeat  news.com.auNissanka century helps Sri Lanka to record ODI chase against Australia  The GuardianPathum Nissanka smashes ton as Sri Lanka beat Australia in third ODI  Sydney Morning HeraldView Full coverage on Google News","content":null,"pubDate":"2022-06-19 19:07:30","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Saha in talks with Tripura for ‘player-cum-mentor role’","link":"https://kashmirreader.com/2022/06/20/saha-in-talks-with-tripura-for-player-cum-mentor-role/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"KOLKATA: Discarded Team India wicketkeeper Wriddhiman Saha, who also had a fallout with Cricket Association of Bengal, is in talks with Tripura for a potential player-cum-mentor role, an official said. “He wants a role of being the player-cum-mentor for Tripura. He has been in talks with some Apex Council members in Tripura but nothing has […]","content":"KOLKATA: Discarded Team India wicketkeeper Wriddhiman Saha, who also had a fallout with Cricket Association of Bengal, is in talks with Tripura for a potential player-cum-mentor role, an official said. “He wants a role of being the player-cum-mentor for Tripura. He has been in talks with some Apex Council members in Tripura but nothing has been finalised yet,” an official told PTI here. “He has to first get a clearance (no-objection-certificate) from the CAB and then the BCCI and then it will be taken forward,” he added. Saha was not available for a comment. The 37-year-old, who played a stellar role in Gujarat Titans’ IPL triumph in their debut season this year, had pulled out of the Bengal set-up after being rejected in the Indian Test team for Sri Lanka. After that, CAB joint-secretary Debabrata Das made some unsavoury remarks about Saha’s decision in the media, questioning his commitment, something that annoyed the seasoned wicketkeeper-batter. Having made a mark in the IPL, Saha was named in Bengal’s Ranji Trophy quarterfinal match squad against Jharkhand, but without his consent. The veteran wicketkeeper took strong exception to it and reportedly sought an apology from Das. Later, he made it clear he’s not going to play for Bengal again. Having made his debut for Bengal in 2007, Saha has played 122 first-class matches. —PTI   Press Trust of Indiakashmirreader.com","pubDate":"2022-06-19 18:53:07","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka tour great opportunity to build team: Harmanpreet Kaur","link":"https://kashmirreader.com/2022/06/20/sri-lanka-tour-great-opportunity-to-build-team-harmanpreet-kaur/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"BENGALURU: The likes of Mithali Raj — who retired recently — and Jhulan Goswami are not there in the team but India skipper Harmanpreet Kaur on Saturday reckoned that the upcoming limited overs tour to Sri Lanka is a great opportunity to “build a team”. “We are working hard on our team, we have great […]","content":"BENGALURU: The likes of Mithali Raj — who retired recently — and Jhulan Goswami are not there in the team but India skipper Harmanpreet Kaur on Saturday reckoned that the upcoming limited overs tour to Sri Lanka is a great opportunity to “build a team”. “We are working hard on our team, we have great combinations. And for us, it is a good tour to start, because first-time we are going to play without our seniors and a great opportunity for all of us to build a team,” Harmanpreet said at the virtual pre-departure press conference. “For me, it is a great opportunity where you can build a good team because Sri Lanka, I don’t think it is going to be an easy tour for us.” Mithali Raj has retired from all forms of the game, while experienced pacer Jhulan Goswami is not travelling to the island nation. Harmanpreet has been appointed as the ODI skipper, besides his role as T20I captain. She stressed on giving opportunities to young players. “In the fielding department also, we will give opportunities to young players who can bowl 10 overs and look for breakthroughs. We are trying to do little-little things, where we (have) worked in this (NCA) camp and we are having a vision, so we will look for that (in terms of implementation),” she said. “If we talk about our bowling unit, this is the time they are getting responsibility and this tour will be an ideal platform for them to perform where they can take charge and bowl full quota. “For us it is important whatever we are planning, we should go and deliver, that is what as a unit we are looking forward (to),” she added. India will be playing three ODIs and as many T20Is during their tour to the Island nation, beginning on June 23. “No one can fill Mithali’s place” “Well, as we all know, she (Mithali) has done great for women’s cricket and I don’t think anyone can fill this place. If you talk about Mithali Di, I don’t think there is anyone who can take her place and we will always miss her in our dressing rooms and the things she has done so far,” quipped Harmanpreet. ODIs: Would look to score over 300 runs per match So, does Harman want the team to play any specific brand of cricket in ODIs? “I think we did set some during the World Cup, where we were looking for 300 runs, but were able to score 280, 270. But this time, we will look to score more than 300 runs. “Now we do have some players who are playing good cricket. I think, if we set bigger targets for us, we can look for something bigger for us and as a batting unit that is what we are going to do,” she added. Harman stressed that the team would look to zero-in on the first combination in T20s. “In T20, we will look to (at) our first combination and try to give them as many games as possible. In the ODIs, we have time to prepare for the next World Cup, where we will see if we can give a chance to each and every player,” she added. As a batter, Harmanpreet will look to score as many runs as possible. “I want to score maximum runs for my team. Batting is something that’s very important. Leading a team will be the second part because as a batter, if I can do well, it will be easy for me,” she said. —PTI   Press Trust of Indiakashmirreader.com","pubDate":"2022-06-19 18:52:56","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Nissanka century helps Sri Lanka to record ODI chase against Australia - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMidGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2p1bi8xOS9uaXNzYW5rYS1jZW50dXJ5LWhlbHBzLXNyaS1sYW5rYS10by1yZWNvcmQtb2RpLWNoYXNlLWFnYWluc3QtYXVzdHJhbGlh0gF0aHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3Nwb3J0LzIwMjIvanVuLzE5L25pc3NhbmthLWNlbnR1cnktaGVscHMtc3JpLWxhbmthLXRvLXJlY29yZC1vZGktY2hhc2UtYWdhaW5zdC1hdXN0cmFsaWE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Nissanka century helps Sri Lanka to record ODI chase against Australia  The GuardianBig problem in historic Aussie ODI defeat  news.com.auCarey not surprised by 'cagey' Kuhnemann's instant impact | Sri Lanka v Australia 2022  cricket.com.auStar’s ‘all-time’ destruction exposes big Aussie ODI issue in 10-year first  Fox SportsSri Lanka beats Australia by six wickets in Colombo to take a 2-1 lead in the ODI series  ABC NewsView Full coverage on Google News","content":null,"pubDate":"2022-06-19 18:46:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket-No fireworks this time as England beat Netherlands in second ODI","link":"https://www.thestar.com.my/sport/cricket/2022/06/20/cricket-no-fireworks-this-time-as-england-beat-netherlands-in-second-odi","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England beat Netherlands by six wickets in the second match of their ODI series on Sunday but were made to work much harder than in their spectacular record-breaking opening win. Read full story","content":null,"pubDate":"2022-06-19 18:24:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/06/20/1629173.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Next match in Chinnaswamy Stadium: Upcoming matches in Chinnaswamy Stadium 2022","link":"https://thesportsrush.com/cricket-news-next-match-in-chinnaswamy-stadium-upcoming-matches-in-chinnaswamy-stadium-2022/","keywords":["Cricket","M Chinnaswamy Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Next match in Chinnaswamy Stadium: The potential lip-smacking 5th T20I between India and South Africa at Bengaluru was called-off. Spectators at the M.Chinnaswamy Stadium in Bengaluru had to leave the venue after mere 3.3 Overs, as rain played spoilsport during the 5th T20I between India and South Africa, forcing the match to be ultimately abandoned.… The post Next match in Chinnaswamy Stadium: Upcoming matches in Chinnaswamy Stadium 2022 appeared first on The SportsRush.","content":"Next match in Chinnaswamy Stadium: The potential lip-smacking 5th T20I between India and South Africa at Bengaluru was called-off. Spectators at the M.Chinnaswamy Stadium in Bengaluru had to leave the venue after mere 3.3 Overs, as rain played spoilsport during the 5th T20I between India and South Africa , forcing the match to be ultimately abandoned. A potential lip-smacking encounter was very much on the cards with the five-match T20I series score line reading 2-2. But, with rain failing to relent, fans had to head back dejected with punctured spirits. Moreover, only 50% of their match ticket cost will be ultimately refunded, as Indian batters did play 21 deliveries before the call-off. The series score line of 2-2 has meant that South Africa have managed to have their record intact – of not losing a T20I away series against India ever and not having lost a limited-Overs series against them as well on their home soil since 2011. Spoils shared 🏆 #INDvSA #BePartOfIt pic.twitter.com/iMMItNYWPf — Cricket South Africa (@OfficialCSA) June 19, 2022 Team India would next face England and then West Indies on away tours to these respective nations, from July to August 2022. The Asia Cup (Sri Lanka) and the T20 World Cup (Australia) would extend till November as well. As far as the home series are concerned, Australia will tour India for a three-match T20I series in September as well. Moreover, the year would wrap up with a five-match T20I series against Sri Lanka. The schedule for the aforementioned two home series has not been decided/announced as yet, and thus there is no information whether or not M.Chinnaswamy would host any of these matches. The only confirmed match as of now in the year 2022 at the M. Chinnaswamy Stadium is the Ranji Trophy 2021-22 final which is scheduled to take place from June 22-26. The grand finale of this year’s Ranji Trophy would take place between 41-time champion Mumbai and Madhya Pradesh.","pubDate":"2022-06-19 18:16:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"SL vs AUS 3rd ODI highlights: Yesterday match Sri Lanka vs Australia Colombo highlights","link":"https://thesportsrush.com/cricket-news-sl-vs-aus-3rd-odi-highlights-yesterday-match-sri-lanka-vs-australia-colombo-highlights/","keywords":["Cricket","Australia","Australia tour of Sri Lanka 2022","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"SL vs AUS 3rd ODI highlights: Sri Lanka have registered an emphatic run chase at the R Premdasa Stadium tonight. Going from strength to strength, Sri Lanka have managed to gain a 2-1 lead over Australia in the ongoing five-match ODI series at home. With the hosts having won three out of six white-ball matches… The post SL vs AUS 3rd ODI highlights: Yesterday match Sri Lanka vs Australia Colombo highlights appeared first on The SportsRush.","content":"SL vs AUS 3rd ODI highlights: Sri Lanka have registered an emphatic run chase at the R Premdasa Stadium tonight. Going from strength to strength, Sri Lanka have managed to gain a 2-1 lead over Australia in the ongoing five-match ODI series at home. With the hosts having won three out of six white-ball matches now, they have proved Australia that beating them is no cakewalk. Sri Lanka’s latest triumph has come in the form of a 6-wicket victory while chasing a 292-run target at the R Premdasa Stadium. Their highest successful ODI run-chase at this venue (third-highest at home), it is also Sri Lanka’s highest ODI chase against Australia. Playing his first match of the series in place of injured batter Danushka Gunathilaka, it was Niroshan Dickwella’s 26-ball 25 comprising of five fours which set the tone for what was always going to be a daunting chase on this surface. That being said, a match-winning 170-run second-wicket partnership between Pathum Nissanka (137) and Kusal Mendis (87) turned the tables to the extent that the home team won without any discomfort with nine balls to spare. Nissanka, who hit 11 fours and two sixes at a strike rate of 93.19, registered the highest individual score for a Sri Lankan batter against Australia. A maiden ODI century in his 15th match earned the 24-year old player with a maiden match award in this format. Mendis, on the other hand, missed out on a third ODI century after retiring hurt due to a hamstring niggle in Colombo tonight. All-rounder Dhananjaya de Silva’s brief 17-ball 25 with the help of four fours right after Mendis’ return to the dressing room had further eased pressure of the Sri Lankan batters. Take a bow, Pathum Nissanka 🙌 What a brilliant match winning knock! #SLvAUS pic.twitter.com/Sn4iEDF99P — Sri Lanka Cricket 🇱🇰 (@OfficialSLC) June 19, 2022 For more cricket-related news, click here .","pubDate":"2022-06-19 18:15:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Arsenal ‘make transfer offer for Atletico Madrid striker Alvaro Morata’ but face competition from Juventus","link":"https://www.thesun.co.uk/sport/football/18937472/arsenal-transfer-atletico-madrid-alvaro-morata/","keywords":["Football","Arsenal transfer news","Premier League"],"creator":["Jack Drury"],"video_url":null,"description":"ARSENAL are preparing to launch a bid for Atletico Madrid’s Alvaro Morata. The former Chelsea man looks set to be the latest target as the Gunners look to replace outgoing Alexandre Lacazette. The 29-year-old spent the last two seasons on loan at Juventus, which coincided with the Old Lady losing their grip on the Serie […]","content":"ARSENAL are preparing to launch a bid for Atletico Madrid’s Alvaro Morata. The former Chelsea man looks set to be the latest target as the Gunners look to replace outgoing Alexandre Lacazette. Morata has an impressive international record for SpainReuters The 29-year-old spent the last two seasons on loan at Juventus, which coincided with the Old Lady losing their grip on the Serie A trophy. The Spaniard has not yet seen his loan spell in Turin made permanent, although the Italian giants remain keen on tying him down. Morata joined London rivals Chelsea in 2017, although he failed to reach the heights compatriot Diego Costa hit in the seasons before. According to The Mirror, Mikel Arteta’s side may look to capitalise on the slow negotiations in Italy as they look for a cheaper deal. READ MORE IN FOOTBALL FAB THIRTY Betfair: Get £30 BONUS on football, tennis, cricket and golf - 18+ T&Cs apply GUNNERS NEWS Gabriel DEFENDS Nketiah, Fabio Vieira PROMISE, Raphinha price tag set Arsenal’s need for another body up front is obvious, with Eddie Nketiah the only recognised senior striker after his recently signed new contract at the club. They have already looked to the Serie A for potential replacements, with Tammy Abraham being touted as a name the club are interested in. However, it has been reported the Englishman is happy in Rome. Gabriel Jesus is another name the club have been linked with this summer, after he showed his desire to leave Manchester City. Most read in Football LASH VEGAS JACK Jack Grealish leaves club with brunette beauty after Las Vegas night out DAMNED UNITED Man Utd CEO tells protesters of 'nightmare' season and 'f***ing burned cash' 'GUTTED' Rangers stars ALL miss Defoe's wedding with just 2 Ibrox admin staff at big day JACK IN BUSINESS Middlesbrough add Butland to wishlist with Johnstone set to join Palace SHORE IN LOVE Arsenal ace Ben White takes fiancée on luxury superyacht during Ibiza holiday LONG HAAL Real already plotting £130m Haaland transfer just days after City announce deal FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS They look a lot closer to completing a deal for the Brazilian, with reports suggesting they are happy to pay the fee the champions are asking for. This would see them beat arch-rivals Spurs to the deal, as they look to leapfrog them back into the top four next season.","pubDate":"2022-06-19 17:43:07","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Team India के कोच द्रविड़ ने 6 कप्तानों को लेकर दी प्रतिक्रिया, बताया 8 महीनों को लेकर क्या था प्लान","link":"https://www.abplive.com/sports/cricket/rahul-dravid-says-about-6-captains-of-team-india-in-last-8-months-2150068","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Rahul Dravid Team India:</strong> टीम इंडिया के हेड कोच राहुल द्रविड़ का कहना है कि उन्होंने आठ महीनों में क्रिकेट के सभी प्रारूपों में छह कप्तानों की योजना नहीं बनायी थी लेकिन इससे ग्रुप के अंदर ज्यादा कप्तान तैयार करने का मौका मिला. द्रविड़ ने टी20 विश्व कप के बाद नवंबर में टीम की कोचिंग की कमान संभाली थी. इसके बाद से कोविड-19 संबधित &lsquo;बबल ब्रेक&rsquo; और चोटों के कारण दिये गये ब्रेक के कारण राष्ट्रीय कप्तान के तौर पर विराट कोहली, रोहित शर्मा, शिखर धवन, लोकेश राहुल, ऋषभ पंत, हार्दिक पंड्या (आयरलैंड में टीम की अगुआई को तैयार) ने जिम्मेदारी संभाली.</p> <p style=\"text-align: justify;\">द्रविड़ ने दक्षिण अफ्रीका के खिलाफ पांचवें टी20 अंतरराष्ट्रीय मैच शुरू होने से पहले कहा, &lsquo;&lsquo;यह चुनौतीपूर्ण भी रहा है, हमने अंतिम आठ महीनों में छह कप्तान उतारे, जो वास्तव में योजना नहीं थी. लेकिन हम जितने मैच खेल रहे हैं, यह उसकी वजह से हुआ है.&rsquo;&rsquo;</p> <p style=\"text-align: justify;\">द्रविड़ ने स्वीकार किया कि ऐसा भी समय आता है जब परिस्थितियों को स्वीकार करना पड़ता है. उन्होंने कहा, &lsquo;&lsquo;कोविड-19 के कारण मुझे कुछ लोगों के साथ काम करना पड़ा जो शानदार रहा. कई खिलाड़ियों को टीम की अगुआई का मौका मिला, हमें ग्रुप में और &lsquo;कप्तान&rsquo; तैयार करने का मौका मिला. &rsquo;&rsquo;</p> <p style=\"text-align: justify;\">दक्षिण अफ्रीका में टेस्ट और वनडे श्रृंखला गंवाना निराशाजनक था इसलिये टीम हर पहलू में बेहतर होने की कोशिश में जुटी है. उन्होंने कहा, &lsquo;&lsquo;हम लगातार बेहतर करने की कोशिश करते हैं, हमने विभिन्न लोगों के साथ काफी कोशिश की. पिछले आठ महीनों में दक्षिण अफ्रीका का दौरा टेस्ट क्रिकेट के लिहाज से थोड़ा निराशाजनक रहा. &rsquo;&rsquo;</p> <p style=\"text-align: justify;\">द्रविड़ खुश हैं कि इंडियन प्रीमियर लीग (आईपीएल) की बदौलत गेंदबाजी प्रतिभायें सामने आयी हैं. उन्होंने कहा, &lsquo;&lsquo;हमारा सफेद गेंद का क्रिकेट अच्छा है, इससे टीम का जज्बा झलकता है. आईपीएल के दौरान तेज गेंदबाजी प्रतिभायें देखना शानदार था, विशेषकर कुछ गेंदबाज काफी रफ्तार से गेंदबाजी कर रहे थे.&rsquo;&rsquo;</p> <p style=\"text-align: justify;\">द्रविड़ ने कहा, &lsquo;&lsquo;काफी युवाओं को अपना कौशल दिखाने का मौका मिला और काफी ने अच्छा किया जो भारतीय क्रिकेट के लिये काफी अच्छा संकेत है.&rsquo;&rsquo;</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-bhuvneshwar-kumar-player-of-the-series-m-chinnaswamy-stadium-bengaluru-2150045\">IND vs SA T20: भुवनेश्वर कुमार बने 'प्लेयर ऑफ द सीरीज', बताया किस ट्रिक से की बॉलिंग</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/india-vs-south-africa-5th-t20-called-off-due-to-rain-series-shared-by-2-2-bengaluru-2150033\"><strong>IND vs SA T20 Series: बारिश की वजह से रद्द हुआ बैंगलोर टी20 मैच, 2-2 की बराबरी पर रही सीरीज</strong></a></p> <p style=\"text-align: justify;\">&nbsp;</p>","content":null,"pubDate":"2022-06-19 17:41:33","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket-Nissanka smashes ton as Sri Lanka beat Australia in third ODI","link":"https://www.thestar.com.my/sport/cricket/2022/06/20/cricket-nissanka-smashes-ton-as-sri-lanka-beat-australia-in-third-odi","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Pathum Nissanka cracked a brilliant 137 while Kusal Mendis scored a half-century before getting injured as Sri Lanka beat Australia by six wickets in the third one-day international on Sunday to take a 2-1 lead in the five-match series. Read full story","content":"(Reuters) - Pathum Nissanka cracked a brilliant 137 while Kusal Mendis scored a half-century before getting injured as Sri Lanka beat Australia by six wickets in the third one-day international on Sunday to take a 2-1 lead in the five-match series. Chasing 292 to win, Sri Lanka shook off the early dismissal of Niroshan Dickwella for 25 as Nissanka and Mendis combined for a brilliant 170-run partnership for the second wicket to put their side in complete control. But while Mendis retired hurt with a hamstring injury on 87, Nissanka hung on to take his team close to the finish line which they crossed with nine balls to spare after to a quick-fire 25 by Dhananjaya de Silva and Charith Asalanka's steady 13. Nissanka's knock came off 147 deliveries and contained 11 fours and two sixes. Australia opted to bat first after winning the toss and an unbeaten 70 from Travis Head and 62 from skipper Aaron Finch helped them to a competitive 291-6 on a tricky Colombo wicket which was slow and offered the spin bowlers some turn. Head and Alex Carey (49) combined superbly during their 72-run partnership after Australia found themselves in a difficult position at 121-4, before Glenn Maxwell smashed 33 off 18 balls in a strong finish to the innings. Jeffrey Vandersay was the pick of the bowlers claiming 3-49 for Sri Lanka, who dropped four catches, while Head was lucky to survive a big appeal for leg-before when he was on four as the hosts did not review the umpire's decision. (Reporting by Shrivathsa Sridhar in Bengaluru, editing by Pritha Sarkar)","pubDate":"2022-06-19 17:29:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket-India, South Africa draw T20 series 2-2 as rain plays spoilsport","link":"https://www.thestar.com.my/sport/cricket/2022/06/20/cricket-india-south-africa-draw-t20-series-2-2-as-rain-plays-spoilsport","keywords":null,"creator":null,"video_url":null,"description":"MUMBAI (Reuters) - India and South Africa shared the honours in the Twenty20 International series after the deciding fifth and final match in Bengaluru was abandoned due to rain. Read full story","content":"MUMBAI (Reuters) - India and South Africa shared the honours in the Twenty20 International series after the deciding fifth and final match in Bengaluru was abandoned due to rain. The touring side won the first two matches before India bounced back to level the series at 2-2 to send the series to an effective final on Sunday. Rain forced the players off the field just as play was set to start at the M. Chinnaswamy Stadium and South Africa fast bowler Lungi Ngidi dismissed the hosts' opening batsmen to reduce India to 28-2 after the restart. But it started pouring again with only 3.3 overs bowled and no more play was possible. (Reporting by Sudipto Ganguly; editing by Pritha Sarkar)","pubDate":"2022-06-19 17:28:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Congratulations Sri Lanka cricket team: Twitter reactions on Sri Lanka defeating Australia in 3rd ODI in Colombo","link":"https://thesportsrush.com/cricket-news-congratulations-sri-lanka-cricket-team-twitter-reactions-on-sri-lanka-defeating-australia-in-3rd-odi-in-colombo/","keywords":["Cricket","Australia","Australia tour of Sri Lanka 2022","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sri Lanka defeating Australia in 3rd ODI: The home team has gained a lead over the visitors in this five-match series. During the third ODI of the ongoing Australia’s tour of Sri Lanka in Colombo, Sri Lanka beat Australia by 6 wickets to gain a 2-1 lead with two more matches to be played. Chasing… The post Congratulations Sri Lanka cricket team: Twitter reactions on Sri Lanka defeating Australia in 3rd ODI in Colombo appeared first on The SportsRush.","content":"Sri Lanka defeating Australia in 3rd ODI: The home team has gained a lead over the visitors in this five-match series. During the third ODI of the ongoing Australia’s tour of Sri Lanka in Colombo, Sri Lanka beat Australia by 6 wickets to gain a 2-1 lead with two more matches to be played. Chasing a 292-run target, it appeared unlikely that Sri Lanka would be able to win the match at first. However, the hosts surprised one and all by registering a comfortable victory with nine balls to spare. In what is the 11th highest successful ODI run-chase for Sri Lanka, it is their third-highest at home, second-highest of 2022 and highest against Australia and at the R Premdasa Stadium. Sri Lanka, who have now won three out of six matches against Australia this month, wouldn’t have been able to do the same if not for a match-winning 170-run second-wicket partnership between Pathum Nissanka (137) and Kusal Mendis (87). While Nissanka managed to bring up a maiden ODI century, Mendis missed out on a third ODI century after retiring hurt due to a hamstring niggle tonight. While Australia did manage to dismiss three Sri Lankan batters in the third powerplay, it all become all too late for them to stage a comeback. With bowling figures of 9-0-39-2, Australia fast bowler Jhye Richardson was the pick of the bowlers for them. Twitter reactions on Sri Lanka defeating Australia in 3rd ODI: It gets better and better for @OfficialSLC They are expressing themselves at the right time for Sri Lanka #Slvaus This is the resilience Sri Lankans have been called upon to show time and time again .. Well done Guys .. you have made a Nation smile against all odds — Russel Arnold (@RusselArnold69) June 19, 2022 Pathum Nissanka won the Player of the Match award for his brilliant 137 runs against Australia #LKA #SriLanka #SLvAUS pic.twitter.com/MC6qxInT1R — Sri Lanka Tweet (@SriLankaTweet) June 19, 2022 Pathum Nissanka’s 137 is the highest score for Sri Lanka against Australia in men’s ODIs. Previous highest was 122 by Sanath Jayasuriya in 2003.#SLvAUS — Kausthub Gudipati (@kaustats) June 19, 2022 The Sri Lankan players on this scoreboard have given a country hurting immensely some much needed temporary respite and joy. Literal Sumihiri Pane vibes. #SLvAUS pic.twitter.com/5L8HZclosW — Kithmina Hewage (@kvh0117) June 19, 2022 Finally got to watch us successfully chase at Khettarama after so many years!!! Decades of ODI trauma meant that even with less than 10 to win, I was still nervous. Brilliant performance by Nissanka, Mendis, and Dhananjaya. #SLvAUS — Kithmina Hewage (@kvh0117) June 19, 2022 Can’t really remember the last time Sri Lanka consistently played this well against a top team. NGL, did not see a 2-1 scoreline coming in the ODIs after how the tour started in Colombo. Typing this at 9.30pm and holding to tweet WHEN we win #NoJinx #SLvAUS — Estelle Vasudevan (@Estelle_Vasude1) June 19, 2022 For more cricket-related news, click here. The post Congratulations Sri Lanka cricket team: Twitter reactions on Sri Lanka defeating Australia in 3rd ODI in Colombo appeared first on The SportsRush.","pubDate":"2022-06-19 17:22:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SA T20: भुवनेश्वर कुमार बने 'प्लेयर ऑफ द सीरीज', बताया किस ट्रिक से की बॉलिंग","link":"https://www.abplive.com/sports/cricket/ind-vs-sa-bhuvneshwar-kumar-player-of-the-series-m-chinnaswamy-stadium-bengaluru-2150045","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Bhuvneshwar Kumar Player of the Series India vs South Africa T20:</strong> भारत और दक्षिण अफ्रीका के बीच खेली गई टी20 सीरीज के लिए भुवनेश्वर कुमार को 'प्लेयर ऑफ द सीरीज' चुना गया. भुवनेश्वर टी20 इंटरनेशनल में एक बार से ज्यादा 'प्लेयर ऑफ द सीरीज' अवॉर्ड जीतने वाले पहले भारतीय तेज गेंदबाज बन गए हैं. उन्होंने दक्षिण अफ्रीका के खिलाफ 5 मैचों की सीरीज में 6 विकेट झटके. इस दौरान उन्होंने 85 रन दिए. भुवी ने अवॉर्ड जीतने के बाद अपनी बॉलिंग को लेकर प्रतिक्रिया दी. उन्होंने कहा कि मैं पावरप्ले में गेंदबाजी करता हूं और मुझे अपनी तरह से गेंदबाजी करने की पूरी आजादी है.</p> <p style=\"text-align: justify;\">भुवनेश्वर ने पांच मैचों की सीरीज में शानदार प्रदर्शन किया. इसीलिए उन्हें 'प्लेयर ऑफ द सीरीज' का अवॉर्ड दिया गया. मैच के बाद उन्होंने कहा, '''प्लेयर ऑफ द सीरीज' का खिताब जीतना मेरे लिए गर्व की बात है. मैं अब भी बिल्कुल फिट हूं. मेरा टीम में वही रोल है, जो कि पहले था. मैं पावरप्ले में गेंदबाजी करता हूं और इसके बाद आखिरी ओवरों में बॉलिंग के लिए आता हूं. इसके साथ-साथ सीनियर प्लेयर होने के कारण सभी से बात भी करता हूं. टीम ने मुझे अपनी तरह से बॉलिंग की पूरी आजादी दे रखी है.''</p> <p style=\"text-align: justify;\">दिलचस्प बात यह है कि भुवी टी20 इंटरनेशनल में एक बार से ज्यादा 'प्लेयर ऑफ द सीरीज' अवॉर्ड जीतने वाले पहले भारतीय तेज गेंदबाज बन गए हैं. उन्होंने इससे पहले साल 2018 में दक्षिण अफ्रीका के खिलाफ ही यह खिताब जीता था. लेकिन यह सीरीज भारत में नहीं खेली गई थी. भुवनेश्वर इंटरनेशनल क्रिकेट में सबसे ज्यादा बार यह अवॉर्ड जीतने वाले भारतीय तेज गेंदबाज भी बन गए हैं. उन्होंने इस मामले में इशांत शर्मा और जहीर खान को पीछे छोड़ा.</p> <p style=\"text-align: justify;\"><strong>इंटरनेशनल क्रिकेट में सबसे ज्यादा 'प्लेयर ऑफ द सीरीज' अवॉर्ड जीतने वाले भारतीय तेज गेंदबाज:</strong></p> <ul> <li style=\"text-align: justify;\">4 - भुवनेश्वर कुमार</li> <li style=\"text-align: justify;\">3 - जहीर खान</li> <li style=\"text-align: justify;\">3 - इशांत शर्मा</li> </ul> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/india-vs-south-africa-5th-t20-called-off-due-to-rain-series-shared-by-2-2-bengaluru-2150033\">IND vs SA T20 Series: बारिश की वजह से रद्द हुआ बैंगलोर टी20 मैच, 2-2 की बराबरी पर रही सीरीज</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-5th-t20-yuzvendra-chahal-says-about-m-chinnaswamy-stadium-picth-bengaluru-2150025\"><strong>IND vs SA 5th T20: चहल ने बताया बैंगलोर में गेंदबाजों को कैसे मिल सकती है सफलता, टर्न को लेकर कही खास बात</strong></a></p>","content":null,"pubDate":"2022-06-19 17:00:08","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Match abandoned meaning in cricket: India vs South Africa match update 5th T20I Bengaluru","link":"https://thesportsrush.com/cricket-news-match-abandoned-meaning-in-cricket-india-vs-south-africa-match-update-5th-t20i-bengaluru/","keywords":["Cricket","M Chinnaswamy Stadium","South Africa tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Match abandoned meaning in cricket: The series deciding fifth ODI between India and South Africa commenced with a 20 minute delay. During the fifth T20I of the ongoing South Africa’s tour of India at the M. Chinnaswamy Stadium in Bengaluru, the rain Gods had, in line with the weather forecast decided to have an extended stay,… The post Match abandoned meaning in cricket: India vs South Africa match update 5th T20I Bengaluru appeared first on The SportsRush.","content":"Match abandoned meaning in cricket: The series deciding fifth ODI between India and South Africa commenced with a 20 minute delay. During the fifth T20I of the ongoing South Africa’s tour of India at the M. Chinnaswamy Stadium in Bengaluru, the rain Gods had, in line with the weather forecast decided to have an extended stay, with the match proceeding yet again interrupting after mere 3.3 Overs. For those unaware, the start of play had already been delayed by 20 minutes due to a brief yet intense spell of downpour right before the first delivery, which resulted in the series deciding match being reduced to 19 Overs-a-side each. However, with the rain refusing to relent, and with a cut-off time of 10:12 pm IST for a 5-Over-a-side match, the match officials decided to ultimately abandon the match, with the series result ending in a stalemate at 2-2. Match abandoned, or simply match called-off means that the playing conditions are no longer fit for the resumption of play, and thus no result was possible to arrive at. 🚨 Update 🚨 Play has heen officially called off. The fifth & final @Paytm #INDvSA T20I has been abandoned due to rain. #TeamIndia pic.twitter.com/tQWmfaK3SV — BCCI (@BCCI) June 19, 2022 The series score line of 2-2 has meant that South Africa have managed to have their record intact – of not losing a T20I away series against India ever and not having lost a limited-Overs series against them as well on their home soil since 2011. With only 3.3 Overs of play possible tonight, India, after losing the Toss for the fifth consecutive time this series, were invited to bat first by Proteas skipper Keshav Maharaj (captain in place of injured Temba Bavuma). With Lungi Ngidi striking twice within his two Overs, both the Indian openers – Ishan Kishan (15 off 7) and Ruturaj Gaikwad (10 off 12) were back in the hut with the scorecard reading 28/2 in 3.3 Overs.","pubDate":"2022-06-19 16:57:25","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sue Barker breaks down in tears after Queen’s champ Berrettini takes mic to pay tribute to outgoing BBC tennis presenter","link":"https://www.thesun.co.uk/sport/18937247/sue-barker-tears-matteo-berrettini-queens-wimbledon/","keywords":["Sport","Tennis"],"creator":["Rob Maul"],"video_url":null,"description":"QUEEN’S champion Matteo Berretini had Sue Barker in tears live on-air in a classy tribute to the BBC presenter. Barker, 66, is calling time on her broadcasting career next month following 30 years on our screens. And Berretini had Barker “welling up” after he defended his Queen’s title with a 7-5 6-4 win over Serbia’s […]","content":"QUEEN’S champion Matteo Berretini had Sue Barker in tears live on-air in a classy tribute to the BBC presenter. Barker, 66, is calling time on her broadcasting career next month following 30 years on our screens. BBC SPORTThe classy Matteo Berrettini paid tribute to Sue Barker[/caption] BBC SPORTBarker admitted she was “welling up” after Berrettini’s kind words[/caption] Berrettini successfully defended his Queens titleGetty And Berretini had Barker “welling up” after he defended his Queen’s title with a 7-5 6-4 win over Serbia’s Filip Krajinovic today. Barker grabbed the 26-year-old for an interview following his win in West Kensington and ahead of the big one in SW19 next week. He said: “I just want to say congrats for your career. I heard it’s going to be your last Queen’s and last Wimbledon so good luck for the rest of your beautiful life, and congrats.” An emotional Barker then said: “I’m welling up now, oh dear.” Read More in Tennis DAN & OUT Watch as Medvedev's coach storms off court after tennis star screams at him BET BOOST Get £30 in FREE BETS with William Hill - includes F1, cricket, tennis and golf Barker will quit after the Wimbledon men’s final next month, a match Berrettini himself has a great chance to be in. The Italian heads to the iconic tournament in supreme shape after defending Queen’s. The Italian became the eighth player in the Open Era to win back-to-back singles titles after he overcame shock finalist Krajinovic. Since returning from hand surgery, Berrettini has won nine matches in a row on grass – he beat Andy Murray in last weekend’s Stuttgart Open final. Most read in Sport LASH VEGAS JACK Jack Grealish leaves club with brunette beauty after Las Vegas night out ROYAL DRAMA Horse pulling Beatrice's carriage loses control after being spooked at Ascot LIKE A CHAMP Fans are all saying the same thing as Oleksandr Usyk posts training pictures HOLMES FREE Dame Kelly Holmes reveals she's gay after living 'secret life' for decades DAMNED UNITED Man Utd CEO tells protesters of 'nightmare' season and 'f***ing burned cash' 'GUTTED' Rangers stars ALL miss Defoe's wedding with just 2 Ibrox admin staff at big day FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS And last year’s Wimbledon finalist plans to go one better this time around. His dad Luca flew in from Rome for this match and was rewarded by watching his charismatic son become King of Queen’s once again. Berrettini, who sealed the triumph with a 137mph ace said: “I forgot how heavy this trophy was. “I’ve too many emotions. The last thing I expected after coming back from surgery was winning two titles in a row. “My dad text me after the semis and asked: ‘Should I come or not?’ I said: ‘Of course you have to.’ “I arrived at Stuttgart and I wasn’t feeling great. Not hitting the ball the way I used to do. Read More on The Sun SHAPE OF TWO I've given birth to ‘Ed Sheeran’s’ baby… I named her after the singer's wife CHILL OUT How much does it cost to run a hot tub? “I thought this would be tough but it went pretty well. I guess I’m Italian, so I’m always complaining. But I cannot complain now. “Every time I walk here, it’s tricky, I get lost in this clubhouse. I see all the names, all the champions from past and present, and knowing it is me twice on the same wall, it gives me goose bumps.” Berrettini heads to Wimbledon with a great shot at lifting the trophyGetty","pubDate":"2022-06-19 16:56:53","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Jos Buttler: पूर्व भारतीय क्रिकेटर ने बताया, कैसे जोस बटलर पर IPL टीमें 30-35 करोड़ रूपए खर्च करती...","link":"https://www.abplive.com/sports/cricket/aakash-chopra-said-that-if-the-team-is-allowed-to-spend-200-crores-on-players-in-ipl-then-teams-would-spend-30-35-crores-for-players-like-jos-buttler-for-just-one-season-2150016","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Aakash Chopra On IPL &amp; ICC:</strong> IPL Media Rights से बीसीसीआई (BCCI) को भारी मुनाफा हुआ है. अब पूर्व भारतीय क्रिकेटर आकाश चोपड़ा (Aakash Chopra) ने बड़ा बयान दिया है. दरअसल, आकाश चोपड़ा (Aakash Chopra) के मुताबिक IPL Media Rights से बीसीसीआई (BCCI) को हुए बड़े पैमाने पर लाभ की वजह से खिलाड़ियों के वेतन में भारी अनुपात में बढ़ोतरी किया जा सकता है. साथ ही पूर्व भारतीय ओपनर ने इंग्लैंड के विकेटकीपर बल्लेबाज जोस बटलर (Jos Buttler) की वैल्यू को लेकर बड़ा बयान दिया.</p> <p style=\"text-align: justify;\"><strong>'... तो जोस बटलर को 30 से 35 करोड़ रूपये मिलते'</strong></p> <p style=\"text-align: justify;\">आकाश चोपड़ा (Aakash Chopra) ने कहा कि अगर आईपीएल (IPL) में टीम को खिलाड़ियों के ऊपर 200 करोड़ खर्च करने के लिए अनुमति मिलती है तो टीमें महज एक सीजन के लिए जोस बटलर (Jos Buttler) जैसे खिलाड़ियों के लिए 30-35 करोड़ रूपए खर्च कर सकती है. उन्होंने कहा कि अगर ढ़ाई से महीने के लिए किसी खिलाड़ी को 30 से 35 करोड़ रूपये मिलते हैं तो यह मायने नहीं रखता कि इंग्लैंड क्रिकेट (England Cricket) कितना भुगतान करता है, ऐसे में हर खिलाड़ी आईपीएल (IPL) खेलना चाहेगा. साथ ही आकाश चोपड़ा (Aakash Chopra) ने कहा कि मैं आश्वस्त हूँ कि आईपीएल (IPL) को बड़ी विंडो मिलेगी और यही आईसीसी (ICC) के फ्यूचर टूर प्लान (FTP) में भी देखने को मिलेगा.</p> <p style=\"text-align: justify;\"><strong>भविष्य में IPL को ICC से मिलेगी बड़ी विंडो</strong></p> <p style=\"text-align: justify;\">गौरतलब है कि बीसीसीआई (BCCI) को आईपीएल मीडिया राइट्स (IPL Media Rights) से भारी मुनाफा हुआ है. बीसीसीआई (BCCI) को आईपीएल मीडिया राइट्स (IPL Media Rights) से 48390 रूपये मिले हैं. दरअसल, यह ऑक्शन (Auction) आने वाले 5 सालों के लिए है. इसमें टीवी (TV) और डिजिटल (Digital) दोनों तरह के राइट्स (Rights) शामिल है. वहीं, बीसीसीआई (BCCI) अध्यक्ष जय शाह (Jay Shah) ने कहा कि आने वाले दिनों में आईपीएल (IPL) मैचों को बढ़ाया जाएगा. साथ ही ऐसा माना जा रहा है कि आगामी दिनों में आईसीसी (ICC) से भी आईपीएल (IPL) विंडो बढ़ाने की मांग की जा सकती है.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/arshdeep-singh-and-umran-malik-who-impressed-in-ipl-2022-didn-t-get-a-chance-to-make-their-series-debut-against-south-africa-2149993\">Umran Malik के हाथ फिर लगी निराशा, अर्शदीप को भी नहीं मिला डेब्यू का मौका</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-ishan-kishan-most-runs-in-the-5-match-t20i-series-for-india-m-chinnaswamy-stadium-bengaluru-2149979\">IND vs SA 5th T20: Ishan Kishan ने बैंगलोर में हासिल की बड़ी उपलब्धि, कोहली-राहुल की खास लिस्ट में बनाई जगह</a><br /></strong></p>","content":null,"pubDate":"2022-06-19 16:39:17","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"5th T20I: Rain forces washout as India-South Africa series ends 2-2 - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMipAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9zb3V0aC1hZnJpY2EtaW4taW5kaWEvNXRoLXQyMGktcmFpbi1mb3JjZXMtd2FzaG91dC1hcy1pbmRpYS1zb3V0aC1hZnJpY2Etc2VyaWVzLWVuZHMtMi0yL2FydGljbGVzaG93LzkyMzIxODY0LmNtc9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"5th T20I: Rain forces washout as India-South Africa series ends 2-2  Times of IndiaRecent Match Report - India vs South Africa 5th T20I 2022  ESPNcricinfoIND vs SA 5th T20 Highlights: Match abandoned due to rain, India & South Africa share series  The Indian ExpressIND vs SA: Bangalore Weather Today, India vs South Africa Weather Forecast, South Africa tour of India 2022, 5th T20I  Cricket AddictorLive Cricket Score - India vs South Africa, 5th T20I | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-06-19 16:38:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SA T20 Series: बारिश की वजह से रद्द हुआ बैंगलोर टी20 मैच, 2-2 की बराबरी पर रही सीरीज","link":"https://www.abplive.com/sports/cricket/india-vs-south-africa-5th-t20-called-off-due-to-rain-series-shared-by-2-2-bengaluru-2150033","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>India vs South Africa, 5th T20I Bengaluru:</strong> भारत और दक्षिण अफ्रीका के बीच 5 मैचों की टी20 सीरीज 2-2 की बराबरी पर रही. सीरीज का आखिरी मुकाबला बैंगलोर में खेला जाना था. लेकिन बारिश की वजह से मैच रद्द हो गया. इस मुकाबले में दक्षिण अफ्रीका ने टॉस जीतकर पहले गेंदबाजी का फैसला लिया. जबकि भारतीय टीम पहले बैटिंग करने मैदान में उतरी. टीम इंडिया ने 3.3 ओवरों में 2 विकेट के नुकसान पर 28 रन बना लिए थे. लेकिन इसके बाद बारिश की वजह से खेल शुरू नहीं हो सका.&nbsp;</p> <p style=\"text-align: justify;\">टॉस हारकर पहले बैटिंग करने उतरी भारत टीम ने मैच रद्द होने से पहले 28 रन बना लिए थे. इस दौरान ओपनर ईशान किशन ने 7 गेंदों में 15 रन बनाए. उन्होंने 2 छक्के भी लगाए. जबकि ऋतुराज गायकवाड़ 10 रन बनाकर आउट हुए. श्रेयस अय्यर बिना खाता खोले नाबाद रहे. जबकि ऋषभ पंत एक रन बनाकर नाबाद रहे. हालांकि इसके बाद बारिश लगातार होती रही. इस वजह से मैच नहीं खेला जा सका. यह सीरीज 2-2 की बराबरी पर रही.&nbsp;</p> <p style=\"text-align: justify;\">टीम इंडिया को सीरीज के पहले मैच में हार का सामना करना पड़ा. दिल्ली में खेले गए इस मैच को दक्षिण अफ्रीका ने 7 विकेट से जीत लिया. जबकि कटक में खेला गया दूसरा मैच अफ्रीकी टीम ने 4 विकेट से जीता. इसके बाद भारत ने पासा पलटा. टीम इंडिया ने तीसरा मैच 48 रनों से जीता. यह मुकाबला विशाखापट्टनम में खेला गया. सीरीज का चौथा मैच राजकोट में खेला गया, जिसे भारत ने 82 रनों से जीता. इसके बाद आखिरी मैच बारिश की वजह से रद्द हो गया.&nbsp;</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">🚨 Update 🚨<br /><br />Play has heen officially called off.<br /><br />The fifth &amp; final <a href=\"https://twitter.com/Paytm?ref_src=twsrc%5Etfw\">@Paytm</a> <a href=\"https://twitter.com/hashtag/INDvSA?src=hash&amp;ref_src=twsrc%5Etfw\">#INDvSA</a> T20I has been abandoned due to rain. <a href=\"https://twitter.com/hashtag/TeamIndia?src=hash&amp;ref_src=twsrc%5Etfw\">#TeamIndia</a> <a href=\"https://t.co/tQWmfaK3SV\">pic.twitter.com/tQWmfaK3SV</a></p> &mdash; BCCI (@BCCI) <a href=\"https://twitter.com/BCCI/status/1538559313601409029?ref_src=twsrc%5Etfw\">June 19, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-ishan-kishan-most-runs-in-the-5-match-t20i-series-for-india-m-chinnaswamy-stadium-bengaluru-2149979\">IND vs SA 5th T20: Ishan Kishan ने बैंगलोर में हासिल की बड़ी उपलब्धि, कोहली-राहुल की खास लिस्ट में बनाई जगह</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-5th-t20-rishabh-pant-lost-toss-again-bengaluru-social-media-reaction-2149938\"><strong>IND vs SA 5th T20: Rishabh Pant फिर से हारे टॉस, लोगों ने कोहली को याद कर ऐसे किया ट्रोल</strong></a></p>","content":null,"pubDate":"2022-06-19 16:28:42","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Channel Eye Live Cricket Match today YouTube: Sri Lanka vs Australia live free app in Sri Lanka","link":"https://thesportsrush.com/cricket-news-channel-eye-live-cricket-match-today-youtube-sri-lanka-vs-australia-live-free-app-in-sri-lanka/","keywords":["Cricket","Australia","Australia tour of Sri Lanka 2022","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sri Lanka vs Australia live free app in Sri Lanka: The Sri Lankan fans have multiple options of watching the ongoing ODI series. During the third ODI of the ongoing Australia’s tour of Sri Lanka in Colombo, Sri Lanka have gained a significant advantage in the second innings to the extent that it wouldn’t be… The post Channel Eye Live Cricket Match today YouTube: Sri Lanka vs Australia live free app in Sri Lanka appeared first on The SportsRush.","content":"Sri Lanka vs Australia live free app in Sri Lanka: The Sri Lankan fans have multiple options of watching the ongoing ODI series. During the third ODI of the ongoing Australia’s tour of Sri Lanka in Colombo, Sri Lanka have gained a significant advantage in the second innings to the extent that it wouldn’t be wrong to say that it is their match to lose from here. While a positive start to a 292-run chase was halted a bit by the dismissal of Niroshan Dickwella (25) in the eighth over, a 170-run second-wicket partnership between Pathum Nissanka and Kusal Mendis has put the hosts in a commanding position at the R Premdasa Stadium tonight. While Nissanka has managed to register a maiden ODI century, a serious hamstring niggle forced Mendis to retire hurt when he was on the brink of a third ODI century. Pathum Nissanka👏🏻👏🏻👏🏻👏🏻👏🏻 — Ian Raphael Bishop (@irbishi) June 19, 2022 All-rounder Dhananjaya de Silva putting on display a positive start to his innings has further put Sri Lanka into the driver’s seat. Assuming that Nissanka and de Silva continue to play in this fashion, sealing this chase shouldn’t be difficult for Sri Lanka. The same will also put them forward in the series with a 2-1 lead with two more ODIs to be played. Sri Lankan fans have multiple options of watching this ongoing five-match series. They can tune in to either of Sri Lanka YouTube channel or Channel Eye to follow these matches on an internet streaming platform. As far as the official television channel is concerned, Dialog TV is broadcasting Australia’s tour of Sri Lanka 2022 for Sri Lankan fans. With all of these options (barring Sri Lanka Cricket YouTube channel) requiring paid subscriptions, there’s no official way of watching this series on a streaming app for free.","pubDate":"2022-06-19 16:27:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Highlights, IND vs SA 5th T20, Full Cricket Score: Match called off due to rain, series shared 2-2 - Firstpost - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLWluZC12cy1zYS01dGgtdDIwLWZ1bGwtY3JpY2tldC1zY29yZS1tYXRjaC1jYWxsZWQtb2ZmLWR1ZS10by1yYWluLXNlcmllcy1zaGFyZWQtMi0yLTEwODEwODYxLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights, IND vs SA 5th T20, Full Cricket Score: Match called off due to rain, series shared 2-2 - Firstpost  FirstpostIND vs SA: Bangalore Weather Today, India vs South Africa Weather Forecast, South Africa tour of India 2022, 5th T20I  Cricket AddictorMatch Preview - India vs South Africa, South Africa in India 2022, 5th T20I  ESPNcricinfoIND vs SA 5th T20I LIVE: India vs South Africa scorecard, ball to ball commentary  The Indian ExpressThis ground will erupt for three people: Aakash Chopra on RCB stars’s return to their home ground in Bangalore  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-06-19 16:27:18","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sub air system in cricket stadium: How does sub air system at M Chinnaswamy Stadium Bengaluru work?","link":"https://thesportsrush.com/cricket-news-sub-air-system-in-cricket-stadium-how-does-sub-air-system-at-m-chinnaswamy-stadium-bengaluru-work/","keywords":["Cricket","M Chinnaswamy Stadium","South Africa tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sub air system in cricket stadium: Despite the innovative drainage facility, chances of resumption of 5th T20I between IND vs SA look grim. During the fifth T20I of the ongoing South Africa’s tour of India at the M. Chinnaswamy Stadium in Bengaluru, the rain Gods have yet again made an appearance after mere 3.3 Overs… The post Sub air system in cricket stadium: How does sub air system at M Chinnaswamy Stadium Bengaluru work? appeared first on The SportsRush.","content":"Sub air system in cricket stadium: Despite the innovative drainage facility, chances of resumption of 5th T20I between IND vs SA look grim. During the fifth T20I of the ongoing South Africa’s tour of India at the M. Chinnaswamy Stadium in Bengaluru, the rain Gods have yet again made an appearance after mere 3.3 Overs into the match. It is worth of a mention that, the start of play had already been delayed by 20 minutes due to a brief yet intense spell of downpour right before the first delivery, which resulted in the series deciding match being reduced to 19 Overs-a-side each. The bad news for the fans is that the present rainfall at the venue doesn’t seem like a passing shower as the downpour is quite intense, which has started to puncture the spirit and enthusiasm of the spectators. The aforementioned development has meant that the match is losing one Over for every four minutes lost, which ultimately means that for it to be a 5 Overs contest, the play will have to resume by 10:12 pm IST, which is around 25 minutes from now (at the time of writing). A torrential downpour being witnessed at the stadium has meant that despite the SubAir system, the drying process will take some time, if at all the rain Gods show some mercy. The SubAir surface aeration and vacuum-powered drainage system, or simply the SubAir system is the first of a kind Cricket infrastructure innovation in the country, which was installed at the M. Chinnaswamy Stadium in the year 2017. The technology helps prevent water logging at the stadium ground for long as it reportedly is capable of draining water 36 times faster than under normal circumstances (information source: Cricbuzz ). Basically, SubAir system acts as a vacuum and absorbs water into the pipes much quicker. In layman’s words. https://t.co/ROhIFVoJCU — Bharath Ramaraj (@Fancricket12) June 19, 2022 The system functions by sucking the water out via the super absorption pipes at the rate of over 10,000 litres a minute from the time it begins to rain at the ground. The technology works via activated signals from the remote sensors installed in the field. The aforementioned technology incurred an investment cost of INR 4.25 Crore, borne by the Karnataka State Association Stadium (KSCA). Moreover, the maintenance of this vacuum-powered drainage system will require the KSCA to shed its maintenance cost of INR 7 lakh per year.","pubDate":"2022-06-19 16:17:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Watch as Daniil Medvedev’s coach storms off court after Russian tennis star screams at him leaving wife in tears","link":"https://www.thesun.co.uk/sport/football/18937205/daniil-medvedev-tennis-halle/","keywords":["Football","Tennis"],"creator":["Kealan Hughes"],"video_url":null,"description":"DANIIL MEDVEDEV lost his cool and left his wife in tears after abusing his coach in a Halle Open final defeat to Hubert Hurkacz. The incident occurred at the start of the second set after Medvedev was broken in the first game. Medvedev, 25, lost the first set 6-1 and allowed his anger to boil […]","content":"DANIIL MEDVEDEV lost his cool and left his wife in tears after abusing his coach in a Halle Open final defeat to Hubert Hurkacz. The incident occurred at the start of the second set after Medvedev was broken in the first game. Daniil Medvedev abused his coach Gilles Cervara after being broken in the first game of the second setAmazon Prime Amazon Prime Cervara had enough and packed up his bags to leave[/caption] Amazon Prime The coach then stormed out of the arena[/caption] Amazon Prime Wife Daria Medvedeva put her head in her hands following the incident[/caption] Daria acts as a personal assistant to her husbandInstagram @medwed33 Medvedev, 25, lost the first set 6-1 and allowed his anger to boil over, unfortunately for his coach Gilles Cervara. The Russian began screaming at Cervara who decided to get up and leave the arena rather than put up with any more abuse. Cervara was seated next to Medvedev’s wife Daria who held her head in her hands after her husband’s outburst and appeared to wipe away a tear. She looked like she wanted the ground to swallow her up as the camera zoomed in on her face – but Medvedev did at least apologise to her after his 6-1 6-4 defeat. Read More in Sport FAB THIRTY Betfair: Get £30 BONUS on football, tennis, cricket and golf - 18+ T&Cs apply TAKING THE NICK Kyrgios tells ballboy to 'run properly' and blames him for putting him off He said: “Daria, thanks a lot for this week. Not easy to be with me on the court sometimes but hopefully next time will be easier and much better. “Also thank you guys [the crowd] very much, sorry for not making this match longer and more interesting!” Daria watches all of her husband’s matches and acts as his personal assistant – arranging trips and his financial accounts. Daria also played tennis at junior level but injury cut her career short, with the Russian later turning to modeling. Most read in Football Man Utd news CEO Richard Arnold makes ALARMING admission, Frenkie de Jong a PRIORITY LASH VEGAS JACK Jack Grealish leaves club with brunette beauty after Las Vegas night out DAMNED UNITED Man Utd CEO tells protesters of 'nightmare' season and 'f***ing burned cash' 'GUTTED' Rangers stars ALL miss Defoe's wedding with just 2 Ibrox admin staff at big day JACK IN BUSINESS Middlesbrough add Butland to wishlist with Johnstone set to join Palace SHORE IN LOVE Arsenal ace Ben White takes fiancée on luxury superyacht during Ibiza holiday FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS The pair married in 2018 after meeting and starting a relationship in 2014 with Medvedev viewing his partner as his lucky charm. Medvedev said of Daria: “She gave me a lot of confidence. I always say that the moment I proposed to her is the moment I started to go up.”","pubDate":"2022-06-19 16:05:23","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IND vs SA 5th T20: चहल ने बताया बैंगलोर में गेंदबाजों को कैसे मिल सकती है सफलता, टर्न को लेकर कही खास बात","link":"https://www.abplive.com/sports/cricket/ind-vs-sa-5th-t20-yuzvendra-chahal-says-about-m-chinnaswamy-stadium-picth-bengaluru-2150025","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Yuzvendra Chahal India vs South Africa 5th T20 Bengaluru:</strong> बैंगलोर के एम. चिन्नास्वामी स्टेडियम में भारत और दक्षिण अफ्रीका के बीच निर्णायक मैच खेला जा रहा है. यह स्टेडियम लेग स्पिनर युजवेंद्र चहल के लिए भी यह स्टेडियम घर जैसे रहा है. पूर्व आईपीएल फ्रेंचाइजी रॉयल चैलेंजर्स बैंगलोर के लिए चहल ने शानदार लेग स्पिनर के रूप में अपनी प्रतिष्ठा बनाई, एक ऐसे स्थान पर 51 विकेट लिए, जिसे आमतौर पर गेंदबाजों के लिए अच्छी पिच नहीं मानी जाती है.</p> <p style=\"text-align: justify;\">चहल ने कहा, \"यह एक बहुत छोटा मैदान है, इसलिए मैं अपनी लंबाई बदलने की कोशिश करता हूं. बल्लेबाज इस स्थान पर चौकों से अधिक छक्के लगाना पसंद करते हैं. यदि आप यहां बल्लेबाजों को रोकने की कोशिश करते हैं, तो आप निश्चित रूप से अधिक रन देंगे.\"</p> <p style=\"text-align: justify;\">दक्षिण अफ्रीका के खिलाफ सीरीज के पहले दो मैचों में चहल अपने गेंदबाजी फॉर्म में नहीं दिखे. लेकिन उन्होंने विशाखापत्तनम और राजकोट में पांच मैचों की श्रृंखला में भारत की वापसी कराने के लिए 3/20 और 2/21 विकेट लिए. चहल ने 8.2 की इकॉनमी रेट से श्रृंखला में छह विकेट लिए हैं. उन्होंने बताया कि कैसे उन्होंने अपनी सर्वश्रेष्ठ गेंदबाजी में वापसी की.</p> <p style=\"text-align: justify;\">उन्होंने कहा, \"मैं पहले दो मैचों में थोड़ी तेज गेंदबाजी कर रहा था. इसलिए, भले ही यह अच्छी गेंद थी, लेकिन यह उतना टर्न नहीं ले रही थी. मैंने फिर कोचों और कप्तान ऋषभ पंत से बात की. फिर मैंने सीम (पिछले दो मैचों में) और कोणों को बदलने की कोशिश की, जिससे मुझे विकेट लेने में मदद मिली.\"</p> <p style=\"text-align: justify;\">चहल ने लंबे अंतराल के बाद चिन्नास्वामी में खेलने के बारे में खुशी व्यक्त करते हुए कहा कि श्रृंखला के निर्णायक मैच में दक्षिण अफ्रीका के खिलाफ भारत के अच्छे प्रदर्शन करने की उम्मीद है.</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/arshdeep-singh-and-umran-malik-who-impressed-in-ipl-2022-didn-t-get-a-chance-to-make-their-series-debut-against-south-africa-2149993\">Umran Malik के हाथ फिर लगी निराशा, अर्शदीप को भी नहीं मिला डेब्यू का मौका</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-ishan-kishan-most-runs-in-the-5-match-t20i-series-for-india-m-chinnaswamy-stadium-bengaluru-2149979\"><strong>IND vs SA 5th T20: Ishan Kishan ने बैंगलोर में हासिल की बड़ी उपलब्धि, कोहली-राहुल की खास लिस्ट में बनाई जगह</strong></a></p>","content":null,"pubDate":"2022-06-19 16:04:11","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Harmanpreet Kaur makes BIG statement after Mithali Raj's retirement says, 'Sometimes things were not easy'","link":"https://zeenews.india.com/cricket/harmanpreet-kaur-makes-big-statement-after-mithali-rajs-retirement-says-sometimes-things-were-not-easy-2475714.html","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka Cricket (SLC) on Sunday welcomed the Indian women's cricket team led by Harmanpreet Kaur, which arrived here to play three T20Is and an equal number of ODIs, by posting images of the players alighting from the airport.","content":"Former India captain Mithali Raj announced her retirement from all forms of international cricket this month. With this Harmanpreet Kaur became the captain of the Indian women's team in ODI as well. Kaur is leading the Indian T20 side since 2018. After Mithali's retirement Kaur has expressed that now that she will be leading the team in all formats it will be easy for her to take out the best from the players. Kaur also said that at times it was not easy to mange the team with two different captains in two formats. Ahead of #TeamIndia 's tour of Sri Lanka, Captain @ImHarmanpreet sums up what the legendary @M_Raj03 has done for the game. pic.twitter.com/emXC39PDzO — BCCI Women (@BCCIWomen) June 18, 2022 “I have been leading the T20 side for a long time and now this time, I am getting an opportunity to lead the ODI side as well. I think things will be easy because when two different captains were there, sometimes things were not easy because we both had different ideas. Now, it’s easy for me to tell them what I am expecting from them and things will be much easier for me and my teammates as well,” said Harmanpreet in a press conference ahead of India's tour to Sri Lanka. Harman also said that Mithali is a kind of cricketer no one can replace and she will be missed in the Indian dressing room. \"Well, as we all know, she (Mithali) has done great for women’s cricket and I don’t think anyone can fill this place. If you talk about Mithali Di, I don’t think there is anyone who can take her place and we will always miss her in our dressing rooms and the things she has done so far,” added Harmanpreet. Earlier, in an interview, Mithali opened up on her relationship with Harmanpreet during the controversial phase where he was left out of the Indian team during the 2018 ICC T20 World Cup semifinal match against England under the captaincy of Harmanpreet. “I don’t think there has been any problem between me and Mithali. I can speak for myself. You have to speak to her and ask if she has a problem with me. I have always respected her as a senior. We are mature enough to handle the situation. We will have to play as a unit to take the team forward. We are more team players than individuals. If you think about the team cause, you will put your head down and work towards that. I have met her and spoken to her after all these events and we seem to have moved on,” Harmanpreet was quoted as saying by The Mumbai Mirror. Sri Lanka Cricket (SLC) on Sunday welcomed the Indian women's cricket team led by Harmanpreet Kaur, which arrived here to play three T20Is and an equal number of ODIs, by posting images of the players alighting from the airport.","pubDate":"2022-06-19 16:01:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"}]}