{"newsArray":[{"title":"Incumbent Rashpal Bajwa gets another two-year term as Cricket Canada president","link":"https://www.thestar.com/sports/cricket/2022/05/11/incumbent-rashpal-bajwa-gets-another-two-year-term-as-cricket-canada-president.html","keywords":null,"creator":["The Canadian Press"],"video_url":null,"description":null,"content":null,"pubDate":"2022-05-11 21:41:31","image_url":null,"source_id":"thestar","country":["canada"],"category":["sports"],"language":"english"},{"title":"Cricket stars Mark Cosgrove and Craig Simmons join line-up for 2022 Southern Smash in Albany","link":"https://thewest.com.au/news/albany-advertiser/cricket-stars-mark-cosgrove-and-craig-simmons-join-line-up-for-2022-southern-smash-in-albany--c-6749692","keywords":null,"creator":["Calvin Sims"],"video_url":null,"description":"Former State cricket stars and hard-hitting batters Mark Cosgrove and Craig Simmons have both signed up for the fourth edition of the Smash.","content":null,"pubDate":"2022-05-11 18:00:00","image_url":"https://images.thewest.com.au/publication/C-6749692/b8ef4206bb144594a19f6cb322bcd070d7900226-16x9-x0y296w2002h1126.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, RR vs DC HIGHLIGHTS: Mitchell Marsh's 89-Run Knock Helps Delhi Capitals Defeat Rajasthan Royals By 8 Wickets - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1yci12cy1kYy1saXZlLWNyaWNrZXQtc2NvcmUtcmFqYXN0aGFuLXJveWFscy12cy1kZWxoaS1jYXBpdGFscy1saXZlLXNjb3JlYm9hcmQtYW5kLXVwZGF0ZXMtMjk2NjQ3NNIBmAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1yci12cy1kYy1saXZlLWNyaWNrZXQtc2NvcmUtcmFqYXN0aGFuLXJveWFscy12cy1kZWxoaS1jYXBpdGFscy1saXZlLXNjb3JlYm9hcmQtYW5kLXVwZGF0ZXMtMjk2NjQ3NC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, RR vs DC HIGHLIGHTS: Mitchell Marsh's 89-Run Knock Helps Delhi Capitals Defeat Rajasthan Royals By 8 Wickets  NDTV Sports#IPL2022 | Rajasthan v Delhi, Match 58: Preview  CricbuzzIPL 2022, RR vs DC Live Score Updates: Delhi Capitals register comfortable win  The Indian ExpressRajasthan Royals vs Delhi Capitals Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorStrange Stance, Smashing Sixes & Maiden IPL Fifty- Ashwin Sets Internet on Fire With his Heroics: WATCH  News18View Full coverage on Google News","content":null,"pubDate":"2022-05-11 17:46:18","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"CSK all-rounder Ravindra Jadeja ruled out of IPL 2022 with injury","link":"https://www.thehansindia.com/sports/cricket/csk-all-rounder-ravindra-jadeja-ruled-out-of-ipl-2022-with-injury-742114","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Jadeja scored just 116 runs in 10 gamesCSK have claimed just 4 wins this seasonThe four-time winners next take on MI on Thursday","content":"CSK all-rounder Ravindra Jadeja Chennai Super Kings (CSK) all-rounder Ravindra Jadeja has been ruled out of the rest of the Indian Premier League (IPL) 2022 with a rib injury. \"Ravindra Jadeja reported a bruised rib and was unavailable for Chennai Super Kings' game against Delhi Capitals on Sunday. He was under observation and based on medical advice he has been ruled out for the rest of the IPL season,\" read CSK's official statement. In an interview with ESPNCricinfo, CSK's chief executive officer Kasi Vishwanathan revealed that both franchise and Jadeja agreed it was best for him to recover outside the IPL. \"He has a bruised rib. The medical advice is he should not strain it, so we have decided that he should leave the IPL,\" Viswanathan said. The 33-year-old Jadeja picked up the injury while attempting a catch after running in from the deep against Royal Challengers Bangalore (RCB) on May 4. While he continued playing the game, Jadeja missed out CSK's subsequent game, which was against Delhi Capitals (DC). Interestingly, this was just the second time Jadeja had missed a match for CSK since the four-time champions bought him in 2012. The only other instance was in the 2019 season, when he missed a match against Mumbai Indians (MI) because of illness, a game that even MS Dhoni missed in another rare occurrence. Just two days before the start of IPL 2022, Dhoni stepped down as CSK's captain and handed the baton to Jadeja. However, a poor string of results forced Jadeja to quit the captaincy, which saw Dhoni once again at the helm of CSK. Jadeja managed to lead CSK to just two wins in eight games. The all-rounder took over this season despite little experience of leading at the top level. Jadeja's only previous stint as captain in representative cricket was for India Under-19s, in a series in 2007. He had not captained a senior team full-time prior to this. Jadeja, who has been among the core of CSK over the years, had a poor run in the IPL 2022. He scored just 116 runs with the bat in 10 games, while he picked up just five wickets. With four victories in 11 games, CSK are currently ninth in the IPL 2022 table. Dhoni and Co have only three matches left in the tournament, with their upcoming game scheduled to take place on Thursday against Mumbai Indians (MI) at Wankhede Stadium.","pubDate":"2022-05-11 17:01:52","image_url":"https://assets.thehansindia.com/h-upload/2022/05/11/500x300_1291646-ravindra-jadeja.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Devansh, Raghavendra bag top honours in GHMC sports quiz","link":"https://telanganatoday.com/devansh-raghavendra-bag-top-honours-in-ghmc-sports-quiz","keywords":["Hyderabad","News","Sport","Cricket Marredpally Play Ground","GHMC sports quiz","R Raghavendra Surya"],"creator":["Telangana Today"],"video_url":null,"description":"Hyderabad: R Devansh Surya and R Raghavendra Surya (Boxing Nehru Nagar Play Ground) won the top honours in the sports quiz conducted by Greater Hyderabad Municipal Corporation (GHMC) Summer Coaching Camp Secunderabad Zone at the Swimming pool Secunderabad on Wednesday. Abhinav and Garvit (Basketball Marredpally PlayGround) emerged as runners-up while Vilok and Rithvik (Cricket Marredpally […]","content":"Hyderabad: R Devansh Surya and R Raghavendra Surya (Boxing Nehru Nagar Play Ground) won the top honours in the sports quiz conducted by Greater Hyderabad Municipal Corporation (GHMC) Summer Coaching Camp Secunderabad Zone at the Swimming pool Secunderabad on Wednesday. Abhinav and Garvit (Basketball Marredpally PlayGround) emerged as runners-up while Vilok and Rithvik (Cricket Marredpally Play Ground) settled for third place.","pubDate":"2022-05-11 16:22:16","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Delhi Capitals: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/rajasthan-royals-vs-delhi-capitals-live-score-over-match-58-t20-1-5-updates-2967347","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Rajasthan Royals vs Delhi Capitals from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-05-11 16:13:37","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637879022086465033.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sussex announce signing of New Zealand international wicket-keeper batsman","link":"https://www.theargus.co.uk/sport/20131680.sussex-announce-signing-new-zealand-international-wicket-keeper-batsman/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Sussex Cricket have announced the signing of overseas New Zealand international wicket-keeper batsman, Tim Seifert.","content":null,"pubDate":"2022-05-11 15:37:27","image_url":"https://www.theargus.co.uk/resources/images/13769871/?type=app&htype=0","source_id":"theargus","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Jaded Kohli in all likelihood to be rested for SA T20 home series","link":"https://www.business-standard.com/article/sports/jaded-kohli-in-all-likelihood-to-be-rested-for-sa-t20-home-series-122051101193_1.html","keywords":null,"creator":null,"video_url":null,"description":"Enduring a lean patch, a jaded Virat Kohli, in all likelihood, will be rested for the upcoming five-match Twenty20 series against South Africa. The break is expected to help Kohli recharge his batteries before the high-profile England tour. It has been learnt that the national selection committee, headed by Chetan Sharma, would allow India's No.1 batter to take some time off from the game after spending considerable time in bio-bubble in the last two months. Kohli has been enduring the worst phase of his career as he has not scored a century in almost three years. \"Virat Kohli in all probability will be rested for the South Africa series. He has been playing a lot of cricket and has been in the bubble for a long time,\" a senior BCCI official privy to development told PTI on conditions of anonymity. \"It has been a policy decision regarding Kohli and other senior players that they will be given periodic breaks from time to time.\" South Africa are scheduled to play a five-match Twen","content":"Enduring a lean patch, a jaded Virat Kohli, in all likelihood, will be rested for the upcoming five-match Twenty20 series against South Africa. The break is expected to help Kohli recharge his batteries before the high-profile England tour. It has been learnt that the national selection committee, headed by Chetan Sharma, would allow India's No.1 batter to take some time off from the game after spending considerable time in bio-bubble in the last two months. Kohli has been enduring the worst phase of his career as he has not scored a century in almost three years. \"Virat Kohli in all probability will be rested for the South Africa series. He has been playing a lot of cricket and has been in the bubble for a long time,\" a senior BCCI official privy to development told PTI on conditions of anonymity. \"It has been a policy decision regarding Kohli and other senior players that they will be given periodic breaks from time to time.\" South Africa are scheduled to play a five-match Twenty20 series in India from June 9 to 19. Delhi, Cuttack, Visakhapatnam, Rajkot and Bengaluru will host the matches. India will travel to the UK in June-July. They will first play a T20 series against Ireland and then compete against England in one Test (5th Test of 2021 series) and six white-ball games. Kohli is enduring one of his worst IPL seasons for RCB. He has as many as three golden ducks (first ball dismissals) to his name with just one 50-plus score to show in a below-par contribution of 216 runs. In 12 games he is averaging 19.63 and at a dismal strike-rate of 111.34. There are times when a break away from the bump and grind and consistent scrutiny helps a player to get back his rhythm and Kohli might just need one for himself. Former head coach Ravi Shastri has already spelt it loud and clear that Kohli needs an extended break from the game. \"Whether it's two months or a month-and-a-half, whether it's after England or before England. He needs a break because he has got 6-7 years of cricket left in him and you don't want to lose that with a fried brain,\" Shastri had recently said. Ian Bishop had recently pointed out Kohli has been getting dismissed in varied ways by different types of bowlers and it was worrisome. The selection committee will meet towards the end of the IPL and the series against the Proteas will set in motion the Indian team's preparations for the T20 World Cup, to be held in Australia in October-November. \"Even skipper Rohit Sharma would require adequate rest with so much of cricket being played. Some of the others include KL Rahul, Jasprit Bumrah, Rishabh Pant, who all from time to time will need rest,\" the official said. It remains a possibility that some of the players are rested after the first two or three games in the SA series. While most of the core team players will be available, rookies such as Umran Malik and Arshdeep Singh, who have been impressive in IPL, will also be in contention for national selection. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-05-11 15:22:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220511/thumb-122051101193.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, RR vs DC Live Score Updates: Ashwin going strong for the Royals - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiUmh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLXJyLXZzLWRjLWxpdmUtc2NvcmUtNzkxMTg5OS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, RR vs DC Live Score Updates: Ashwin going strong for the Royals  The Indian Express#IPL2022 | Rajasthan v Delhi, Match 58: Preview  CricbuzzRajasthan Royals vs Delhi Capitals Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Royals vs Capitals, Indian Premier League 2022, 58th Match  ESPNcricinfoRR vs DC Live Score, IPL 2022: Marsh bounces out Jaiswal as Delhi keep Royals in check  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-05-11 14:58:25","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-McCullum a contender to become England test coach: reports","link":"https://www.thestar.com.my/sport/cricket/2022/05/11/cricket-mccullum-a-contender-to-become-england-test-coach-reports","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Former New Zealand captain Brendon McCullum is a contender to take over as England test coach, the BBC and other British media reported. Read full story","content":null,"pubDate":"2022-05-11 14:19:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/05/11/1581945.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"R van der Dussen stats: Why is Shimron Hetmyer not playing today’s IPL 2022 match between Rajasthan Royals and Delhi Capitals?","link":"https://thesportsrush.com/cricket-news-r-van-der-dussen-stats-why-is-shimron-hetmyer-not-playing-todays-ipl-2022-match-between-rajasthan-royals-and-delhi-capitals/","keywords":["Cricket","Delhi Capitals","IPL 2022","Rajasthan Royals","DC","Indian Premier League","rajasthan royals","Rassie van der Dussen","RR","Shimron Hetmyer"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Shimron Hetmyer not playing today: Rajasthan Royals have had to make a solitary change to their Playing XI in Navi Mumbai tonight. During the 58th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Delhi Capitals in Navi Mumbai, Delhi Capitals captain Rishabh Pant has won the toss… The post R van der Dussen stats: Why is Shimron Hetmyer not playing today’s IPL 2022 match between Rajasthan Royals and Delhi Capitals? appeared first on The SportsRush.","content":"Why Shimron Hetmyer not playing today: Rajasthan Royals have had to make a solitary change to their Playing XI in Navi Mumbai tonight. During the 58th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Delhi Capitals in Navi Mumbai, Delhi Capitals captain Rishabh Pant has won the toss and chose to bowl. “We gonna bowl first. The wicket is dry and there might be dew later on. We will try to capitalize on that. We are trying to be positive. We can hold more in the middle overs and that’s something we are looking forward to. Anything around 140-160 would be a good total,” Pant told Star Sports at the toss. Struggling in the lower half of the points table, Delhi have made a couple of changes to their Playing XI by bringing in all-rounder Lalit Yadav and pacer Chetan Sakariya for batter Ripal Patel and pacer Khaleel Ahmed. Having lost yet another toss this season, Rajasthan Royals captain Sanju Samson appeared helpless regarding the outcome of the coin toss not going his way. That said, Samson was contended at the prospect of batting first at the Dr DY Patil Sports Academy. “We don’t mind [batting first], would love to put up a good score here. We have been playing some good cricket and we would like to continue with that. Looks like a good surface, might be a bit sticky to start with but we are okay with it,” Samson told Star Sports at the toss. Only change to Royals’ Playing XI has come in the form of batter Shimron Hetmyer making way for Rassie van der Dussen in the XI. Hetmyer, who has returned home due to the birth of his first child, will return to IPL 2022 at a later stage. Congratulations to @SHetmyer and his wife on the birth of their beautiful baby!😍 Welcome to the Maroon family little one.🙌🏾 #MaroonMagic 🎥: @SHetmyer pic.twitter.com/HlGDW8Gtsm — Windies Cricket (@windiescricket) May 10, 2022 In 11 matches this season, Hetmyer’s 291 runs have come at an average and strike rate of 72.75 and 166.28 respectively. van der Dussen, on the contrary, has scored 10 runs across two innings at a strike rate of 71.42 this season. Overall, 33-year old van der Dussen has scored 4,139 runs at an average and strike rate of 37.62 and 129.91 respectively in his 142-match T20 career.","pubDate":"2022-05-11 14:09:19","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Why Prithvi Shaw not playing today: Why is Khaleel Ahmed not playing today’s IPL 2022 match between Rajasthan Royals and Delhi Capitals?","link":"https://thesportsrush.com/cricket-news-why-prithvi-shaw-not-playing-today-why-is-khaleel-ahmed-not-playing-todays-ipl-2022-match-between-rajasthan-royals-and-delhi-capitals/","keywords":["Cricket","Delhi Capitals","IPL 2022","Rajasthan Royals","DC","Indian Premier League","rajasthan royals","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Khaleel Ahmed not playing today: Delhi Capitals have made two changes to their Playing XI for this match. During the 58th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Delhi Capitals in Navi Mumbai, Delhi Capitals captain Rishabh Pant has won the toss and chose to bowl.… The post Why Prithvi Shaw not playing today: Why is Khaleel Ahmed not playing today’s IPL 2022 match between Rajasthan Royals and Delhi Capitals? appeared first on The SportsRush.","content":"Why Khaleel Ahmed not playing today: Delhi Capitals have made two changes to their Playing XI for this match. During the 58th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Delhi Capitals in Navi Mumbai, Delhi Capitals captain Rishabh Pant has won the toss and chose to bowl. “We gonna bowl first. The wicket is dry and there might be dew later on. We will try to capitalize on that. We are trying to be positive. We can hold more in the middle overs and that’s something we are looking forward to. Anything around 140-160 would be a good total,” Pant told Star Sports at the toss. Rajasthan Royals captain Sanju Samson, who has hardly won a toss this season, remained neutral with respect to being asked to bat first at the Dr DY Patil Sports Academy tonight. “We don’t mind [batting first], would love to put up a good score here. We have been playing some good cricket and we would like to continue with that. Looks like a good surface, might be a bit sticky to start with but we are okay with it,” Samson told Star Sports at the toss. A couple of changes for Capitals have come in the form of all-rounder Lalit Yadav and fast bowler Chetan Sakariya coming in for batter Ripal Patel and fast bowler Khaleel Ahmed. Best pacer for Delhi this season, Ahmed’s exclusion has come as a bit of a surprise. Ahmed, who has picked 16 wickets in eight IPL 2022 matches at an average of 15.50, an economy rate of 7.50 and a strike rate of 12, had missed a few matches earlier in the season as well. While Sakariya is replacing Ahmed for the second time this season, Pant wasn’t asked about the reason behind this change. In two IPL 2022 outings, Sakariya’s lone wicket has come at an economy and strike rate of 8.71 and 42 respectively. 🔺 IN: Lalit Yadav, Chetan Sakariya 🔻 OUT: Ripal Patel, Khaleel Ahmed All set with our Playing XI vs RR! Your thoughts? 👀 #YehHaiNayiDilli | #IPL2022 | #RRvDC | #TATAIPL | #IPL | #DelhiCapitals | @Dream11 pic.twitter.com/HrB1cKkeAN — Delhi Capitals (@DelhiCapitals) May 11, 2022 The development means that DC opening batter Prithvi Shaw will miss his third match in a row. Readers must note that the 22-year old player was recently hospitalized after falling ill . Royals, on the other hand, have made a solitary change to their Playing XI as batter Rassie van der Dussen has come in for batter Shimron Hetmyer. In two IPL 2022 matches, all van der Dussen had scored was 10 runs at a strike rate of 71.42.","pubDate":"2022-05-11 13:55:10","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Delhi Capitals Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/rajasthan-royals-vs-delhi-capitals-live-score-over-match-58-t20-1-5-updates-2966715","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Rajasthan Royals vs Delhi Capitals from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.3 overs, Rajasthan Royals are 36/1. The live updates of Rajasthan Royals vs Delhi Capitals scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Rajasthan Royals vs Delhi Capitals, Rajasthan Royals vs Delhi Capitals live score, Rajasthan Royals vs Delhi Capitals scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (0 Run) A dot to end but back-to-back good overs for Rajasthan! Short and on the body, Jaiswal is beaten for pace and lets it go. 4.5 overs (1 Run) Just the one this time! Shorter and outside off, Ravichandran Ashwin guides it past point, there is a fielder in the deep so only one. 4.4 overs (4 Runs) FOUR! Stand and deliver stuff! Length and on off, Ashwin hits it on the up, through covers. It races away to the fence. Second boundary in the over. Ashwin is on a roll here. This one is a superb shot. 4.3 overs (0 Run) Mistimed but safe! Fuller and on off, Ravichandran Ashwin looks to go downtown but it goes more off the splice, lands well short of the mid off fielder. 4.2 overs (4 Runs) FOUR! That is a really good shot and now runs have started to flow for Rajasthan! On middle, fuller, this is whipped over mid-wicket for a boundary. 4.1 overs (0 Run) Length and on off, Ravichandran Ashwin pushes it to covers. 3.6 overs (6 Runs) SIX! Over the fence! Excellent batting from Yashasvi Jaiswal! Just used the pace of the bowler. Short and outside off, Yashasvi Jaiswal stands tall and upper cuts it over third man for a biggie. A good way to end a good over for Rajasthan. 3.5 overs (1 Run) Ashwin takes one now! Outside off, this is guided down to third man for one. 3.4 overs (0 Run) Angled into the pads, Ashwin looks to flick but misses to get hit high on the pads. 3.3 overs (1 Run) Shorter and outside off, Yashasvi Jaiswal looks to cut, it goes off the underedge on the off side for one. 3.2 overs (0 Run) Fuller and on off, Yashasvi Jaiswal pushes it to mid off. 3.1 overs (4 Runs) FOUR! What a shot that is! Beautiful! Fuller and on off, this is driven, with the full face of the bat, down to long off for a boundary. 2.6 overs (0 Run) End of an oustanding over from Chetan Sakariya! Length and on middle, defended. 2.5 overs (0 Run) OUT! TAKEN! Straight to the man! That is a huge wicket and well deserved too! Chetan Sakariya has been outstanding so far and he gets he big fish. Goes fuller, this one shapes back in, it ends up on middle. Buttler whips it uppishly but straight to the man at mid on. A low score for Buttler and Delhi have got off to the perfect start. Not a lot wrong with the shot, he just did not find the gap. He had got it off the middle but not the gap. Ravichandran Ashwin walks in at number 3. 2.5 overs (1 Run) WIDE! Slips this one down the leg side. Buttler looks to flick but misses. Wided. 2.4 overs (0 Run) 4 dots in a row now! Length and on off, Jos Buttler guides it to point. 2.3 overs (0 Run) Another dot! On a length again, this is guided to point. 2.2 overs (0 Run) Good stuff from Chetan Sakariya! Fuller and attacks the stumps, not letting Buttler free his arms. He pushes it to mid off. 2.1 overs (0 Run) Length and on off, blocked. 1.6 overs (0 Run) Good length and on off, defended. 1.5 overs (0 Run) Good length and on middle, Yashasvi Jaiswal pushes it back to the bowler. 1.4 overs (0 Run) Fuller and on off, Yashasvi Jaiswal pushes it to mid off. 1.3 overs (0 Run) That has taken off! Shorter and outside off, Yashasvi Jaiswal shapes up to cut it but then seeing the bounce, lets it go to the keeper. 1.2 overs (1 Run) Short and outside off, Buttler cuts, it goes down to third man for one. 1.1 overs (4 Runs) FOUR! Finds the gap and that is the first boundary of the game! A full toss on off, Buttler creams it through covers for a boundary. A gift by Anrich Nortje first up and Buttler takes full toll of it. Anrich Nortje to start from the other end. 0.6 over (1 Run) A single to end a good first over by Chetan Sakariya! On off, this is pushed to mid off for one. 0.5 over (0 Run) Yet again a length ball on middle, Buttler pushes it to mid off. 0.4 over (0 Run) Chetan Sakariya was certain he had Jos! Pant though knew it was off the back pad and it indeed did clip the flap. Excellent decision from Pant to not review. That though is a beauty! Length and on middle, this lands and then moves away. Jos is squared up as he tries to defend. There is a sound as it goes past the batter. A huge appeal but turned down. Chetan Sakariya was usually getting the ball back in to the right-hander but this time he took it away. 0.3 over (1 Run) Back of a length and on off, YJ stands tall and guides it through point for one. 0.2 over (1 Run) Buttler is off the mark now! Shorter and outside off, Buttler stands tall and pushes it through covers for one. 0.2 over (1 Run) WIDE! Swing but the line is down the leg side. Buttler looks to flick but misses. 0.1 over (1 Run) Yashasvi Jaiswal starts off with a very confident walk down the wicket. Chetan Sakariya bangs it short and gets it to bounce nicely. Yashasvi Jaiswal looks to fend it away, it goes off the glove on the leg side for one. Rajasthan and Yashasvi Jaiswal are underway! We are all set to begin! Delhi players are out there in the middle. Jos Buttler and Yashasvi Jaiswal are the openers for Rajasthan. Chetan Sakariya to start with the ball for Delhi. Here we go... David Warner is down for a chat. He says that it is a do-or-die game for them and there were a few hiccups here and there and adds that they are ready to go. Tells that it is all about sticking to the basics and keeping it as simple as they can. Mentions that against Chennai they were batting at just one tempo and failed to rotate the strike which they can learn from that game. Tells that for him it is all about batting well for the first 6 overs and taking the game as deep as he can and that helps other batters to take on. Signs off by saying that he is absolutely loving his time in the Indian T20 League. Rajasthan (Playing XI) - Jos Buttler, Yashasvi Jaiswal, Sanju Samson (C) (WK), Devdutt Padikkal, Rassie van der Dussen (In place of Shimron Hetmyer), Riyan Parag, Ravichandran Ashwin, Trent Boult, Prasidh Krishna, Yuzvendra Chahal, Kuldeep Sen. Delhi (Playing XI) - Srikar Bharat, David Warner, Mitchell Marsh, Rishabh Pant (C) (WK), Rovman Powell, Lalit Yadav (In place of Ripal Patel), Axar Patel, Shardul Thakur, Kuldeep Yadav, Chetan Sakariya (In place of Khaleel Ahmed), Anrich Nortje. Sanju Samson, the skipper of Rajasthan, says they do not mind setting a total as they have been doing it well. Informs Rassie van der Dussen comes in for Shimron Hetmyer. Adds they would like to continue to play some good cricket. Reckons the wicket might be a little sticky to begin with but he is looking forward to bat on it. Rishabh Pant, the skipper of Delhi, says the wicket seems on the drier side and there might be dew and hence, they want to bowl first. States they only want to think about positives at the moment. Adds they want to take more wickets in the middle overs. Reckons 140 to 160 will be good to chase. Informs they have two changes as Khaleel Ahmed and Ripal go out. TOSS - The coin goes up and lands in favour of Delhi. They have elected to BOWL first. PITCH REPORT - Graeme Swann is down for the pitch report. He says that boundaries are big on one side and small on the other. Tells that it looks like a fairly good pitch and there is even covering of grass. Adds that some part of the pitch is hard but very dry and it will be tricky to bat second. Mentions that the skipper that wins the toss will look to bat first and overall it is a fairly good pitch first up and will help spinners later on. Delhi have struggled to win two games in a row. They have been pretty inconsistent but can't afford anymore slip ups now. They face a big challenge against Rajasthan who after a couple of slip ups have got back to winning ways and will be eager to continue that. They will be without the services of Shimron Hetmyer and that surely is a big blow for them. However, a win here will see them have one foot in the playoffs. They also won the earlier encounter between the two sides. Can they do the double? Or will Delhi manage to keep their hopes alive? We shall find out. Toss and team sheets in a while. The race for the top 4 spots is heating up and two teams looking to finish in one of those positions will be battling it out today. It is Delhi against Rajasthan. One sits 5th in the table and the other at the 3rd spot. A win for Rajasthan could see them go to second. Whereas, a win for Delhi will see them lessen the margin with the teams above. A lot at stake. Welcome to the coverage. ... MATCH DAY …","pubDate":"2022-05-11 13:45:51","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637878933431672683.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Shaun Marsh eyeing back-to-back Sheffield Shields as he signs on for 22nd season of domestic cricket","link":"https://www.perthnow.com.au/sport/cricket/shaun-marsh-eyeing-back-to-back-sheffield-shields-as-he-signs-on-for-22nd-season-of-domestic-cricket--c-6763423","keywords":null,"creator":["Braden Quartermaine"],"video_url":null,"description":"Shaun Marsh will play on for an extraordinary 22nd season, but could be asked to sit out some or all of the 50-over games next summer to allow WA’s next generation their chance to shine.","content":"Shaun Marsh will play on for an extraordinary 22nd season of domestic cricket but could be asked to sit out some or all of the 50-over games next summer to give the next generation their chance to shine. Marsh, 39 in July, has been included in WA’s squad for next summer as the reigning Sheffield Shield and one-day champions keep their group together. The veteran batsman, who made his shield debut as a 17-year-old and had to wait more than two decades for his first title last season, was always keen to continue and has resisted the temptation to go out on top. “He was really keen to continue playing and feels like there’s still plenty for him to give,” WA coach Adam Voges said. “I think he really enjoys working with a few of our younger players in the squad and I think they keep him young and give him reason to keep getting up and coming to training and getting better. “As long as he has the drive to want to do that, then I’m really happy that he’s going around again.” Marsh, who will remain with Melbourne Renegades for the Big Bash League, may have to take a back seat in the 50-over format with WA. “I think certainly in red-ball cricket his leadership and his run-scoring ability is still going to be really crucial,” Voges said. “We’ll have a discussion around what white-ball cricket looks like for him and whether there’s opportunities to potentially blood some younger players in that form of the game.” WA retained wicketkeeper-batsman Josh Philippe by signing him to a new two-year deal, while teenage prodigy Teague Wyllie was given a full contract after being part of the shield final winning team as a 17-year-old. Left-arm paceman Liam Guthrie, 25, was the only contracted player from last season to miss out. Promising all-rounder Aaron Hardie, who has been chosen for the upcoming Australia A tour of Sri Lanka, received a new three-year deal. Batsman Hilton Cartwright and bowlers Lance Morris and Corey Rocchiccioli have new two-year deals. Charlie Stobo, the former NSW quick who made an appearance for WA in the Marsh Cup in March, was also signed. Voges said the addition of University’s Stobo, 27, would ensure fast-bowling depth for the four-day competition. “He has that ability to be a really consistent performer,” Voges said. “You know what you’re going to get from him.” Fixtures for the 2022/23 domestic season are yet to be released. Voges hoped for a more normal summer after two seasons heavily affected by COVID border restrictions. “Borders are open now but COVID’s not going away,” he said. “We’re still going to have issues with guys who are going to miss time and miss cricket. I think we accept that. “But hopefully now with free travel between the States, there will be a bit more of a resemblance of normality in terms of what the fixtures will look like and that we can certainly get to play a lot more games at home.” WA Squad for 2022/23: Ashton Agar (CA), Cameron Bancroft, Jason Behrendorff, Hilton Cartwright, Sam Fanning, Cameron Gannon, Cam Green (CA), Aaron Hardie, Josh Inglis (CA), Bryce Jackson, Matt Kelly, Mitch Marsh (CA), Shaun Marsh, David Moody, Lance Morris, Joel Paris, Josh Philippe, Jhye Richardson, Corey Rocchiccioli, D’Arcy Short, Charlie Stobo, Marcus Stoinis (CA), Ashton Turner, Sam Whiteman, Teague Wyllie. Rookies: Jayden Goodwin, Cooper Connolly, Sam Greer, Hamish McKenzie.","pubDate":"2022-05-11 10:48:58","image_url":"https://images.perthnow.com.au/publication/C-6763423/e9c798c58c9133779b5cdf43c01aadf2e5e1b7bd-16x9-x0y1308w2450h1378.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussies warned against travelling to Sri Lanka weeks out from cricket tour","link":"https://thewest.com.au/sport/cricket/aussies-warned-against-travelling-to-sri-lanka-weeks-out-from-cricket-tour-c-6763336","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"Just weeks before the Australian cricket team arrives in Sri Lanka, the federal government has warned Aussies to reconsider travelling to the country following ‘several violent incidents’.","content":"Just weeks before the Australian cricket team arrives in Sri Lanka, the federal government has warned Aussies to reconsider travelling to the country following “several violent incidents”. But a spokesperson told News Corp that Cricket Australia’s plans had not yet been affected, despite violent protests occurring less than an hour from the city where the tour will begin. Economic decline in Sri Lanka has led protesters to clash with government supporters for weeks, demanding the resignation of Prime Minister Mahinda Rajapaksa and his brother, President Gotabaya Rajapaksa. The situation escalated this week despite the Prime Minister’s resignation and following two nights of arson attacks near the capital city Colombo, Australia updated its travel advice for those wishing to visit. Ben Smith Nick Taylor Braden Quartermaine The Australian government is warning tourists to be especially wary of large groups and says demonstrations may limit access to food, medicine and other essential items. “Several violent incidents have taken place during large demonstrations,” a government statement reads. “Avoid demonstrations and events that draw large groups. Follow the advice of local authorities and monitor the media for updates. “A Public Emergency has been declared in Sri Lanka and an island wide curfew imposed. Carry relevant travel and identification documents with you at all times. “Public demonstrations continue to occur throughout Sri Lanka. They can also lead to disruptions to traffic and public transport. You may experience disruption to fuel supply and planned, lengthy power outages. Import delays may impact your ability to access some medicines and food items.” Cricket Australia’s plans remain unaffected as at Wednesday evening. On June 7, the Aussie T20 side is due to play its first match in Colombo, roughly 40km from Negombo, where eight people were reported to have been killed in this week’s protests. Of the 14 matches scheduled across all formats, seven are set to be played in Colombo. As it stands, Australia will remain in Sri Lanka until mid-July, when the multi-format series wraps up with the second Test in Galle. Australian players repeatedly assured the press they felt safe on their recent tour of Pakistan and said the team was subject to strict security conditions throughout its stay. Security concerns had kept Australia from visiting Pakistan since 1998.","pubDate":"2022-05-11 10:38:03","image_url":"https://images.thewest.com.au/publication/C-6763336/3c7ff636076f80510a64276806dbaf95d7aab575-16x9-x2693y167w3192h1795.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shaun Marsh contracted for 22nd domestic cricket season as WA eyes back-to-back Sheffield Shield success","link":"https://thewest.com.au/sport/cricket/shaun-marsh-contracted-for-22nd-domestic-cricket-season-as-wa-eyes-back-to-back-sheffield-shield-success-c-6759490","keywords":null,"creator":["Braden Quartermaine"],"video_url":null,"description":"Shaun Marsh will play on for an extraordinary 22nd season, but could be asked to sit out some or all of the 50-over games next summer to allow WA’s next generation their chance to shine.","content":"Shaun Marsh will play on for an extraordinary 22nd season of domestic cricket but could be asked to sit out some or all of the 50-over games next summer to give the next generation their chance to shine. Marsh, 39 in July, has been included in WA’s squad for next summer as the reigning Sheffield Shield and one-day champions keep their group together. The veteran batsman, who made his shield debut as a 17-year-old and had to wait more than two decades for his first title last season, was always keen to continue and has resisted the temptation to go out on top. “He was really keen to continue playing and feels like there’s still plenty for him to give,” WA coach Adam Voges said. Ben Smith “I think he really enjoys working with a few of our younger players in the squad and I think they keep him young and give him reason to keep getting up and coming to training and getting better. “As long as he has the drive to want to do that, then I’m really happy that he’s going around again.” Marsh, who will remain with Melbourne Renegades for the Big Bash League, may have to take a back seat in the 50-over format with WA. “I think certainly in red-ball cricket his leadership and his run-scoring ability is still going to be really crucial,” Voges said. “We’ll have a discussion around what white-ball cricket looks like for him and whether there’s opportunities to potentially blood some younger players in that form of the game.” WA retained wicketkeeper-batsman Josh Philippe by signing him to a new two-year deal, while teenage prodigy Teague Wyllie was given a full contract after being part of the shield final winning team as a 17-year-old. Left-arm paceman Liam Guthrie, 25, was the only contracted player from last season to miss out. Promising all-rounder Aaron Hardie, who has been chosen for the upcoming Australia A tour of Sri Lanka, received a new three-year deal. Batsman Hilton Cartwright and bowlers Lance Morris and Corey Rocchiccioli have new two-year deals. Charlie Stobo, the former NSW quick who made an appearance for WA in the Marsh Cup in March, was also signed. Voges said the addition of University’s Stobo, 27, would ensure fast-bowling depth for the four-day competition. “He has that ability to be a really consistent performer,” Voges said. “You know what you’re going to get from him.” Fixtures for the 2022/23 domestic season are yet to be released. Voges hoped for a more normal summer after two seasons heavily affected by COVID border restrictions. “Borders are open now but COVID’s not going away,” he said. “We’re still going to have issues with guys who are going to miss time and miss cricket. I think we accept that. “But hopefully now with free travel between the States, there will be a bit more of a resemblance of normality in terms of what the fixtures will look like and that we can certainly get to play a lot more games at home.” WA Squad for 2022/23 : Ashton Agar (CA), Cameron Bancroft, Jason Behrendorff, Hilton Cartwright, Sam Fanning, Cameron Gannon, Cam Green (CA), Aaron Hardie, Josh Inglis (CA), Bryce Jackson, Matt Kelly, Mitch Marsh (CA), Shaun Marsh, David Moody, Lance Morris, Joel Paris, Josh Philippe, Jhye Richardson, Corey Rocchiccioli, D’Arcy Short, Charlie Stobo, Marcus Stoinis (CA), Ashton Turner, Sam Whiteman, Teague Wyllie. Rookies : Jayden Goodwin, Cooper Connolly, Sam Greer, Hamish McKenzie.","pubDate":"2022-05-11 10:31:21","image_url":"https://images.thewest.com.au/publication/C-6759490/119c86458dc3685cb6bdab19a8f37083309936bd-16x9-x893y64w3330h1873.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"PHOTO FOCUS - 14 photos from Bridlington Cricket Club Under-13s v Folkton & Flixton Under-13s","link":"https://www.thescarboroughnews.co.uk/sport/cricket/photo-focus-14-photos-from-bridlington-cricket-club-under-13s-v-folkton-flixton-under-13s-3689275","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"Bridlington Cricket Club Under-13s played host to Folkton & Flixton CC Under-13s on Monday night.","content":null,"pubDate":"2022-05-11 10:29:46","image_url":"https://www.thescarboroughnews.co.uk/webimg/QVNIMTI1NjU2MDUx.jpg?width=1024&auto=webp","source_id":"thescarboroughnews","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Delhi vs Rajasthan","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-rr-vs-dc-dream11-prediction-fantasy-cricket-tips-dream11-team-playing-xi-pitch-report-injury-update-rajasthan-royals-vs-delhi-capitals-2022-05-11-775747","keywords":null,"creator":null,"video_url":null,"description":"RR vs DC Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Rajasthan Royals vs Delhi Capitals Match Details Rajasthan Royals vs Delhi Capitals","content":null,"pubDate":"2022-05-11 10:29:24","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"The Spin | Is new women’s T20 tournament in Dubai a sign of progress or a threat?","link":"https://www.theguardian.com/sport/2022/may/11/new-womens-t20-cricket-tournament-in-dubai-the-spin","keywords":["Twenty20","Women's cricket","Sport","Cricket"],"creator":["Raf Nicholson"],"video_url":null,"description":"FairBreak Invitational gives associate nations’ players money and exposure but it’s hard to see how it fits with long-term plansWelcome to The Spin, the Guardian’s weekly (and free) cricket newsletter. Here’s an extract from this week’s edition. To receive the full version every Wednesday, just pop your email in below.“The ICC and its members do not recognise privately owned tournaments or leagues in the men’s or women’s game. Any Twenty20 tournament that features the best players in the world outside ICC competitions would need to be run and controlled by one of the full members, as opposed to by a private operator.” That was the England and Wales Cricket Board’s view, as expressed by Clare Connor, in response to the radical idea of an independent women’s T20 league proposed by the Australian businessman Shaun Martyn in 2014. Continue reading...","content":null,"pubDate":"2022-05-11 09:55:31","image_url":"https://i.guim.co.uk/img/media/2637ef4b77c4cf8f141e717e4047f6de3a7784ae/0_116_5052_3031/master/5052.jpg?width=460&quality=85&auto=format&fit=max&s=e22542ad91e4ffed19a818ccae7c19c2","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Who is Graham Thorpe’s wife?","link":"https://www.thesun.co.uk/sport/18529873/who-is-graham-thorpe-wife-amanda/","keywords":["Cricket","Sport","England Cricket","Explainers"],"creator":["Matt Penn"],"video_url":null,"description":"FORMER England cricketer Graham Thorpe is in hospital after falling ‘seriously ill’ on Tuesday. While his condition has not been spoken on, his family have asked for privacy. Thorpe left the England coaching set-up following their thrashing at the hands of Australia in The Ashes last year. And he was set to become the new […]","content":"FORMER England cricketer Graham Thorpe is in hospital after falling ‘seriously ill’ on Tuesday. While his condition has not been spoken on, his family have asked for privacy. ReutersGraham Thrope is in hospital after falling ‘seriously ill’[/caption] Thorpe left the England coaching set-up following their thrashing at the hands of Australia in The Ashes last year. And he was set to become the new Afghanistan head coach, having accepted a job with them recently. But Thorpe is currently recovering in hospital, where his close family, including wife Amanda, will be supporting him. Sport THORPE HOSPITAL DASH Legendary England batsman in hospital after falling seriously ill GET WELL RYAN Aussie ex-cricketer Ryan Campbell, 50, fighting for life after heart attack Who is Graham Thorpe’s wife Amanda? Thorpe is married to a woman named Amanda, who he met after his divorce to ex-wife Nicky. Thorpe has two children with ex-wife Nicky, but he doesn’t have any with Amanda. The 52-year-old’s life with Amanda has been kept extremely private, and it’s not known how the pair met or what she does for a living. A statement was released by the PCA on behalf of Thorpe’s family on Tuesday afternoon. “Graham Thorpe has recently fallen seriously ill and is currently in hospital receiving treatment,” it read. “His prognosis is unclear at this stage and we ask for privacy for him and his family at this time. Our thoughts are with Graham and his family.” Most read in Cricket THORPE HOSPITAL DASH Legendary England batsman in hospital after falling seriously ill STOKE THE FIRE Watch Stokes hit outrageous 34 runs in over as England skipper breaks record PULLING UP ROOTS Joe Root QUITS as England Test captain after horror run of results A SPIN OFF All the TV info and fixtures for England's 2022 schedule LAST MOMENTS Haunting last pic of Shane Warne walking through Thai villa hours before death PIERS MORGAN Unique, ferocious, mischievous...My pal Warnie wasn’t made like the rest of us","pubDate":"2022-05-11 09:54:29","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Thailand’s women cricketers look past World Cup heartache – ‘the girls want to make a mark for themselves’","link":"https://www.scmp.com/sport/cricket/article/3177293/thailands-women-cricketers-look-past-world-cup-heartache-girls-want?utm_source=rss_feed","keywords":null,"creator":["Agence France-Presse"],"video_url":null,"description":"In contrast to Asian powerhouses India, Pakistan and Sri Lanka, where the game has deep historical roots, cricket remains in its infancy in Thailand and is still virtually unknown.","content":null,"pubDate":"2022-05-11 09:45:10","image_url":"https://cdn.i-scmp.com/sites/default/files/styles/1280x720/public/d8/images/canvas/2022/05/11/2ccb136d-d3e7-4df9-956a-48f081ba1e92_c90d7856.jpg?itok=0siu9uXn","source_id":"scmp","country":["china"],"category":["sports"],"language":"english"},{"title":"MCC returns to traditional ticketing after considering member feedback","link":"https://www.theage.com.au/sport/afl/mcc-returns-to-traditional-ticketing-after-considering-member-feedback-20220509-p5ajqa.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Lachlan Abbott"],"video_url":null,"description":"The Melbourne Cricket Club has scrapped its reserved seat-only ticketing system for significant AFL matches in the Members’ Reserve, and glass will return to Reserve bars from this weekend, amid national hospitality staff shortages.","content":null,"pubDate":"2022-05-11 09:25:18","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Delhi Capitals Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiuAFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L3JhamFzdGhhbi1yb3lhbHMtdnMtZGVsaGktY2FwaXRhbHMtZHJlYW0xMS1wcmVkaWN0aW9uLWZhbnRhc3ktY3JpY2tldC10aXBzLWRyZWFtMTEtdGVhbS1wbGF5aW5nLXhpLXBpdGNoLXJlcG9ydC1pbmp1cnktdXBkYXRlLXRhdGEtaXBsLTIwMjIv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Rajasthan Royals vs Delhi Capitals Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket Addictor#IPL2022 | Rajasthan v Delhi, Match 58: Preview  CricbuzzMatch Preview - Royals vs Capitals, Indian Premier League 2022, 58th Match  ESPNcricinfo'It felt he didn't open because he's a wicketkeeper': Parthiv on Indian batter  Hindustan TimesDifficulties aplenty for inconsistent DC ahead of crucial encounter | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-05-11 08:57:26","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian Football Captain Sunil Chhetri Meets North-East Cricketers at NCA | Watch","link":"https://www.news18.com/news/football/indian-football-captain-sunil-chhetri-meets-north-east-cricketers-at-nca-watch-5153359.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Football legend Sunil Chhetri also took part in some fielding drills at the National Cricket Academy in Bengaluru","content":null,"pubDate":"2022-05-11 08:30:33","image_url":"https://images.news18.com/ibnlive/uploads/2022/05/untitled-design-2-16-16522578003x2.png","source_id":"news18","country":["india"],"category":["sports"],"language":"english"},{"title":"Reflections on Indian sports in IPL season","link":"https://economictimes.indiatimes.com/news/sports/reflections-on-indian-sports-in-ipl-season/articleshow/91488841.cms","keywords":null,"creator":null,"video_url":null,"description":"While it has its share of critics, it cannot be disputed that the IPL has leap-frogged over traditional selection systems for domestic cricket which have not been entirely transparent. With a more professional set up, it has unearthed talent in remote corners of India and fast tracked talented cricketers giving them opportunities like never before.","content":null,"pubDate":"2022-05-11 08:24:17","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-109610,resizemode-4,msid-91488841/reflections-on-indian-sports-in-ipl-season.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"CSK vs MI Match Prediction- Who Will Win Today's IPL Match Between Chennai Super Kings And Mumbai Indians, IPL 2022, Match 59 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMitQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vaW5kaWFuLXByZW1pZXItbGVhZ3VlLWlwbC0yMDIyL2Nzay12cy1taS1tYXRjaC1wcmVkaWN0aW9uLXdoby13aWxsLXdpbi10b2RheXMtaXBsLW1hdGNoLWJldHdlZW4tY2hlbm5haS1zdXBlci1raW5ncy1hbmQtbXVtYmFpLWluZGlhbnMtaXBsLTIwMjItbWF0Y2gtNTkv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CSK vs MI Match Prediction- Who Will Win Today's IPL Match Between Chennai Super Kings And Mumbai Indians, IPL 2022, Match 59  Cricket Addictor'I had to take a 7 AM flight. I got call at 11 PM that I'm no longer in team'  Hindustan TimesCSK’s Simarjeet Singh recalls ‘disheartening’ incident: I got a call telling me that I am no longer a part of the team  India TodayChennai Super Kings vs Mumbai Indians: Mumbai Indians' Predicted Playing XI Against Chennai Super Kings, IPL 2022, Match 59, CSK vs MI  Cricket AddictorReports: CSK all-rounder Ravindra Jadeja likely to be ruled out of IPL 2022 due to injury  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-05-11 08:18:54","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Mark Boucher’s white teammates allowed him to become a scapegoat","link":"https://www.iol.co.za/sport/cricket/proteas/mark-bouchers-white-teammates-allowed-him-to-become-a-scapegoat-404bfaca-f006-4baa-9cf7-88742ab169ed","keywords":null,"creator":["Zaahier Adams"],"video_url":null,"description":"It would be entirely understandable that Boucher would hold Cricket South Africa – his employers – in contempt for orchestrating a virtual witch-hunt to have him dismissed from his post as Proteas Men’s coach.","content":null,"pubDate":"2022-05-11 07:55:39","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/da189211-d88d-5605-ad82-964437f31ddc&operation=CROP&offset=0x103&resize=2001x1126","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Former New Zealand captain McCullum a contender to become England Test coach: Reports","link":"https://www.tribuneindia.com/news/sports/former-new-zealand-captain-mccullum-a-contender-to-become-england-test-coach-reports-393860","keywords":null,"creator":null,"video_url":null,"description":"May 11 Former New Zealand captain Brendon McCullum is a contender to take over as England test coach, the BBC and other British media reported. Chris Silverwood left the role in February in the aftermath of their 4-0 Ashes defeat in Australia, with Paul Collingwood named as caretaker. The England and Wales Cricket Board then invited applications for separate Test and white-ball coaches. The reports said 40-year-old McCullum, who is currently in-charge of Indian Premier League side Kolkata Knight Riders, was keen on taking the job and that an announcement was expected this week. Former South Africa and India head coach Gary Kirsten has been linked with the role, while Collingwood was also considered a candidate. McCullum played the last of his 101 Tests at Christchurch in February 2016 against Australia, where he hit the fastest century in the format (54 balls), finishing his career with 6,453 runs, including 12 tons and 31 half-centuries. England last month unveiled New Zealand-born Ben Stokes as their new Test captain, hoping for a swift turnaround under the talismanic all-rounder after a tame end to Joe Root's five years in charge. England face New Zealand in a three-match home series in June.","content":null,"pubDate":"2022-05-11 07:35:23","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/5/2022_5$largeimg_1225443273.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"RR vs DC Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s RR vs DC IPL Match No. 58 at Dr DY Patil Sports Academy, Mumbai, 7:30 PM IST May 11","link":"https://zeenews.india.com/cricket/rr-vs-dc-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-rr-vs-dc-ipl-match-no-58-at-dr-dy-patil-sports-academy-mumbai-730-pm-ist-may-11-2462353.html","keywords":null,"creator":null,"video_url":null,"description":"Rajasthan Royals vs Delhi Capitals Dream11 Team Prediction, Rajasthan Royals vs Delhi Capitals IPL Match No. 58 - Check My Dream11 Team, Best players list of RR vs DC, Rajasthan Royals Dream11 Team Player List, Delhi Capitals Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Delhi Capitals will aim to quickly recover from their loss in the previous match to stay in the IPL play-offs race while Rajasthan Royals will be eager to hold on to their winning momentum when the two teams clash here on Wednesday. The Capitals have lost six of their 11 games and although they are fifth on the points table, they are bunched alongside Sunrisers Hyderabad and Punjab Kings, who also have 10 points from as many games. Delhi has the advantage of a positive Net Run Rate (+0.150) but the Capitals need to win all their remaining three matches for a shot at the playoffs. Rajasthan, on the other hand, are sitting on the third spot with 14 points and need just two wins to be certain of qualification. They have a healthy 0.326 NRR, which could come in handy even if they lose their remaining games. DC have been one of the most inconsistent teams in the league this season as they have struggled to keep the winning momentum going. After a morale-boosting win against Sunrisers, they were handed a 91-run thrashing by CSK. The Royals have arguably the best bowling side in the competition. With 22 wickets at 14.50, Yuzvendra Chahal leads the bowling charts this season and alongside R Ashwin, Trent Boult and Prasidh Krishna, the Rajasthan attack has the ability to defend any total. One of the positives for the Royals is that have been able to break the overdependence on Orange Cap holder Jos Buttler, who has had a quite couple of outings. Given a chance to play after over a month, young Yashasvi Jaiswal shone with a fine half-century against Punjab Kings, providing the otherwise faltering batting department a boost. The Royals will miss the services of the big-hitting Shimron Hetmyer who flew back to Guyana for the birth of his child. The last time the two sides met drama ensued in the final over due to the no-ball controversy. RR ended up winning the clash and Delhi would hope they can be on the right side of the result this time round. Venue: Dr DY Patil Sports Academy, Mumbai Date & Time: May 11th at 7:30 PM IST Live Streaming: Star Sports Network, Star Gold and Disney+Hotstar Wicketkeepers: Jos Buttler (C), Sanju Samson, Rishabh Pant Batters: David Warner (VC), Rovman Powell, Yashasvi Jaiswal All-rounders: Mitchell Marsh, Ravichandran Ashwin Bowlers: Yuzvendra Chahal, Khaleel Ahmed, Prasidh Krishna Captain: Jos Buttler Vice-Captain: David Warner Rajasthan Royals: Jos Buttler, Yashasvi Jaiswal, Sanju Samson (c & wk), Devdutt Padikkal, Shimron Hetmyer, Riyan Parag, Ravichandran Ashwin, Trent Boult, Prasidh Krishna, Yuzvendra Chahal, Kuldeep Sen Delhi Capitals: Srikar Bharat, David Warner, Mitchell Marsh, Rishabh Pant (c & wk), Rovman Powell, Ripal Patel, Axar Patel, Shardul Thakur, Kuldeep Yadav, Anrich Nortje, Khaleel Ahmed","pubDate":"2022-05-11 06:02:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"It will be hard for Mark Boucher to trust CSA again, but the SJN still provided much value","link":"https://www.iol.co.za/sport/cricket/opinion/it-will-be-hard-for-mark-boucher-to-trust-csa-again-but-the-sjn-still-provided-much-value-edae9c3b-9a22-480f-90ef-983c79bc0214","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"It will be hard for Proteas coach Mark Boucher to trust Cricket South Africa again after his charge for ‘gross misconduct’, which was dropped on Tuesday, writes IOL Sport’s Stuart Hess.","content":null,"pubDate":"2022-05-11 05:47:32","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/13a438d4-ff4f-54cd-af00-379a6890fd01&operation=CROP&offset=0x40&resize=3600x2024","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"}]}