{"newsArray":[{"article_id":"c699a3ae4f7c3cae20d7c21608ced0de","title":"Papers: Real Madrid scout Jobe Bellingham on England duty","link":"https://www.skysports.com/football/news/20876/12985795/real-madrid-scout-jude-bellinghams-brother-jobe-playing-for-england-u19s-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Tuesday's newspapers...","content":"All the top stories and transfer rumours from Tuesday's newspapers... THE SUN Real Madrid are reported to have scouted Jude Bellingham's younger brother Jobe when he featured for England's U19 side against Montenegro last week. Manchester United are stepping up security around Old Trafford ahead of their return in the Champions League next Tuesday, closely followed by their first derby against City at the end of the month, amid growing displeasure that the Glazers appear to be staying as majority owners. Arsenal forward Kai Havertz has signed a lucrative deal with Puma and will be one of the faces of their new range of \"FUTURE\" boots. Former Brentford and West Ham youth player Kaine Wright has been jailed for three years after being convicted of conspiracy to convert criminal property for his part in the attempted sale of a stolen painting valued at nearly £2m. DAILY EXPRESS Stream the Premier League and more with NOW for £21 a month for six months Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Newcastle have reportedly been told that Sandro Tonali will be free to face Crystal Palace when the Premier League returns this weekend despite his involvement in an Italian betting probe. THE ATHLETIC Liverpool owners Fenway Sports Group are considering their options for a new sporting director should they decide to move on from Jorg Schmadtke at the end of the season. TALKSPORT Former Southampton and Tottenham recruitment guru Paul Mitchell is a potential candidate to become part of Manchester United's backroom team if Sir Jim Ratcliffe's purchase of a minority stake in the club is completed. DAILY MAIL Please use Chrome browser for a more accessible video player Sir Jim Ratcliffe's plan for a radical overhaul of Manchester United's football department will be welcomed by manager Erik ten Hag according to Old Trafford sources. Italy's betting scandal is focused on more than 40 players with high-profile names including Newcastle's Sandro Tonali and Aston Villa's Niccolo Zaniolo just among the first names to be released as part of the investigation. Chelsea fear summer signing Romeo Lavia will not be able to make his first-team debut until December as his ankle injury remains an issue. Joao Felix says he is comfortable with his form since joining Barcelona in the summer and has admitted he struggled to achieve anything like it during his time with Atletico Madrid or Chelsea. DAILY MIRROR Barcelona captain Sergi Roberto could be the next of Lionel Messi's former team-mates to join him at Inter Miami - he is weighing up his options for next summer when his contract expires. Please use Chrome browser for a more accessible video player DAILY TELEGRAPH The Government has told the Football Association it needs to do \"much more\" to show support for the victims of the terrorist attacks in Israel after criticism over their decision not to light the Wembley Arch in support ahead of the friendly against Australia last week. Ellis Genge says England's rugby players are enjoying their World Cup villains tag as they prepare for a semi-final against South Africa on Saturday. The British Ju Jitsu Association is \"urgently\" reviewing its policy on trans inclusion after being branded \"jerks\" by tennis legend Martina Navratilova for allowing transgender women to fight in their female categories. Please use Chrome browser for a more accessible video player THE TIMES Two Wales rugby supporters are in hospital in Marseille after allegedly being attacked by England fans following the semi-final against Fiji on Sunday afternoon, with one British man in his mid-30s being arrested in the city for possession of cocaine. Michael Atherton says England's pace bowlers have been exposed at the Cricket World Cup in India and feels the time has come for all-rounder Chris Woakes to be dropped from the team. GOAL Antonio Conte has confirmed he turned down a lucrative offer to coach in Saudi Arabia and wants to try \"an experience in Rome or Napoli one day\". THE SCOTTISH SUN Steven Davis and Alex Rae are candidates to remain on Rangers coaching staff as Philippe Clement wants someone with a \"deep understanding\" of the club by his side. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-16 21:30:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8435fcfbcb45e21b41ef73a0f35833df","title":"Inclusion of lacrosse in 2028 Olympics brings excitement, motivation","link":"https://www.winnipegfreepress.com/sports/olympics/2023/10/16/inclusion-of-lacrosse-in-2028-olympics-brings-excitement-motivation","keywords":["Olympics"],"creator":["Abdulhamid Ibrahim, The Canadian Press"],"video_url":null,"description":"Lacrosse is making its return to the Olympic stage in 2028. And there’s high hopes for far greater exposure for the sport on an international level. It was one of […]","content":"Lacrosse is making its return to the Olympic stage in 2028. And there's high hopes for far greater exposure for the sport on an international level. Read this article for free: Already have an account? To continue reading, please subscribe: * Lacrosse is making its return to the Olympic stage in 2028. And there’s high hopes for far greater exposure for the sport on an international level. It was one of five sports added to the program of the Los Angeles Games on Monday by the International Olympic Committee. Flag football, baseball/softball, cricket and squash were the others. “A lot of excitement,” Canadian player Wesley Berg said of Monday’s long-awaited news. “In terms of trying to grow the sport of lacrosse, and how big of a stage the Olympics is, it’s pretty cool to have the opportunity for people around the world and younger kids to be able to see the game played at the biggest stage.” Lacrosse was in the Olympics in 1904 and 1908. It was also held as a demonstration sport at the Games — meaning it wasn’t a standard medal competition — in 1928, 1932 and 1948. Canada men’s coach Brodie Merrill called lacrosse’s Olympic return a “gradual process.” “There’s been rumblings over the last few years,” he said “It definitely felt different today when it was finalized. Kind of a surreal moment.” Both men’s and women’s lacrosse will be competed in sixes — a fast-paced, compact version at the intersection of field and box lacrosse that was developed in 2018. “It’s almost too fast, there’s no breaks where you don’t really get a replay,” Berg said. “But it’s so exciting and the games go by so quickly and it’s just constant action. “It’s almost like you need to find a way to take a couple breaks between goals. If there’s a crazy highlight, you can appreciate it.” Lacrosse has doubled its membership from 45 to 90 national federations over the last two decades. It’s currently played in all five continental regions, with four continents represented in both the men’s and women’s world top-10 rankings. “Being involved in the game, coaching the game, playing the game so long, lacrosse has always been a little bit under the radar,” Merrill said. “I just think now having lacrosse in the Olympics elevates it to another level.” Berg, of Coquitlam, B.C., echoed a similar sentiment with hopes of competing for Canada at those Games himself. “It makes you want to stay healthier, work that much harder to be able to get a chance to play in the Olympics because it’s something you dream about as a kid,” said the 30-year-old, who plays in both box lacrosse in the National Lacrosse League (San Diego Seals) and field in the Premier Lacrosse League (Chaos LC). “Up until the last couple of years, I didn’t even think it would be an option. “It’s pretty interesting that some guys are right at the peak of their career and depending on injuries and things like that, you just never know what happens. It motivates you a bit more.” This report by The Canadian Press was first published Oct. 16, 2023. Advertisement Advertisement","pubDate":"2023-10-16 20:35:57","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"fc346469f6675759193315b72f2b67e7","title":"Power Ranger: Ro-Hit at the top","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/17/power-ranger-ro-hit-at-the-top-2624531.html","keywords":null,"creator":null,"video_url":null,"description":"The opener's ability to strike at a good rate during the first 10 overs and adapt during middle overs has helped ;ay the platform for India MUMBAI: Shortly after India’s win against Pakistan in Ahmedabad, Hardik Pandya was mic’d up for BCCI.tv to talk with captain Rohit Sharma. Sharma had followed up his swashbuckling century with a blistering 63-ball 86 to set up the chase for India. He was toying with Pakistan pacers, hitting them across the park for fun — a knock that had six sixes and as many fours. To be fair, Sharma has the most international sixes across formats than any other player. On Saturday, he pulled, lofted (down town as well as over cover), swept, lapped, cut, used his feet, and slogged every Pakistan bowler across the Narendra Modi Stadium. If the the pull shot he played against Shaheen Shah Afridi — Sharma got into his front foot stride, stood tall and hooked the left-arm pacer into the stands — was one for ages, the way he pulled Haris Rauf into square leg, from a similar position would be etched in the memories. Then there was the loft over cover off a slower ball from Rauf. He made six-hitting look ridiculously easy that anyone could do that. But it is not. Sharma’s ability to time the ball to six easily comes from the time he has spent trying to middle every delivery he faced over the years. “His ability is such that he middles every ball. When he plays a shot, the ball meets the best part of the bat,\" says Dinesh Lad, Sharma’s childhood coach. \"I never had to tell him how to play a particular ball. He picks the ball early, and the lines early, I never had to explain. He has the extra time to play the shots he wants. He would be in the grounds from morning till evening. He gave all his time to the sport and that is why he has performed the way he has,” the proud coach added. It is not just about his six-hitting though. Unlike the better part of the 2010s, Sharma’s game has changed significantly since he started opening in Tests. That he had to face the new red ball meant Sharma worked on his stance and back-lift. And the results are there to see — his numbers as a Test opener are among the best at the moment. In many ways, his game has filtered into his white-ball batting as well. He is not as expansive as he used to be, especially early on. “Earlier, if you see his footage, the bat used to be down and there was a a circular motion of the bat in his downswing. But now you can very well notice that ever since he's become an excellent Test cricketer, he has reduced that downswing. He keeps the bat upright in the set up. And, yes, he has made a conscious effort to play the ball close to his body,” former cricketer and coach Amol Muzumdar observed in a conversation with this daily. Sharma’s routine at the crease is simple. Stand in leg-stump, shuffle a bit across with a forward press as the pacer runs in. The bat is just above his knees, coming down straight depending on where he wants to meet the ball. A full delivery and he goes forward with his front foot press. If it's short, Sharma quickly shifts weight on backfoot to play the pull or cut while still being on the front foot. Not many in the world can do that and be as successful as the opener is. Along with that, the aggressive approach in the first ten overs has changed the way Sharma and India are batting in ODIs. His power play strike rate progression from 2015-2023 in ODI WCs says it all — 77.17 (2015), 83.66 (2019) and 153.16 (2023). Yes, you read it right. Sharma has been batting at 153.16 SR in this WC when the field is up. If one needs a larger sample size, here are some numbers. Since 2022, Sharma scores at 110.86 SR in the power play. The only openers who are a part of the 2023 WC and above Sharma are Mitchell Marsh (116.27) and Travis Head (126.51). After the Pakistan clash, Pandya asked how Sharma has been able to hit the bowlers like he was batting on PlayStation. And this is what Sharma had to say: “I have been trying to bat like this in the last two years. The wickets are good so I want to play my shots. I know I missed out on a hundred today. In our team, we have quite a few conventional players and someone has to change the game a little bit” Sharma might have missed out on a hundred — it could have been his eighth in ODI WCs, 32nd overall. However, what he is doing is bigger than that. After trying for a year and a half, Sharma is at the forefront, changing how India bat in the 50-over format. He has understood the need for the change up front and has decided to do it himself, allowing the rest to bat the way they want to. For who better to lead the way than the captain himself on the biggest stage?","content":"MUMBAI: Shortly after India’s win against Pakistan in Ahmedabad, Hardik Pandya was mic’d up for BCCI.tv to talk with captain Rohit Sharma. Sharma had followed up his swashbuckling century with a blistering 63-ball 86 to set up the chase for India. He was toying with Pakistan pacers, hitting them across the park for fun — a knock that had six sixes and as many fours. To be fair, Sharma has the most international sixes across formats than any other player. On Saturday, he pulled, lofted (down town as well as over cover), swept, lapped, cut, used his feet, and slogged every Pakistan bowler across the Narendra Modi Stadium. If the the pull shot he played against Shaheen Shah Afridi — Sharma got into his front foot stride, stood tall and hooked the left-arm pacer into the stands — was one for ages, the way he pulled Haris Rauf into square leg, from a similar position would be etched in the memories. Then there was the loft over cover off a slower ball from Rauf. He made six-hitting look ridiculously easy that anyone could do that. But it is not. Sharma’s ability to time the ball to six easily comes from the time he has spent trying to middle every delivery he faced over the years. “His ability is such that he middles every ball. When he plays a shot, the ball meets the best part of the bat,\" says Dinesh Lad, Sharma’s childhood coach. \"I never had to tell him how to play a particular ball. He picks the ball early, and the lines early, I never had to explain. He has the extra time to play the shots he wants. He would be in the grounds from morning till evening. He gave all his time to the sport and that is why he has performed the way he has,” the proud coach added. It is not just about his six-hitting though. Unlike the better part of the 2010s, Sharma’s game has changed significantly since he started opening in Tests. That he had to face the new red ball meant Sharma worked on his stance and back-lift. And the results are there to see — his numbers as a Test opener are among the best at the moment. In many ways, his game has filtered into his white-ball batting as well. He is not as expansive as he used to be, especially early on. “Earlier, if you see his footage, the bat used to be down and there was a a circular motion of the bat in his downswing. But now you can very well notice that ever since he's become an excellent Test cricketer, he has reduced that downswing. He keeps the bat upright in the set up. And, yes, he has made a conscious effort to play the ball close to his body,” former cricketer and coach Amol Muzumdar observed in a conversation with this daily. Sharma’s routine at the crease is simple. Stand in leg-stump, shuffle a bit across with a forward press as the pacer runs in. The bat is just above his knees, coming down straight depending on where he wants to meet the ball. A full delivery and he goes forward with his front foot press. If it's short, Sharma quickly shifts weight on backfoot to play the pull or cut while still being on the front foot. Not many in the world can do that and be as successful as the opener is. Along with that, the aggressive approach in the first ten overs has changed the way Sharma and India are batting in ODIs. His power play strike rate progression from 2015-2023 in ODI WCs says it all — 77.17 (2015), 83.66 (2019) and 153.16 (2023). Yes, you read it right. Sharma has been batting at 153.16 SR in this WC when the field is up. If one needs a larger sample size, here are some numbers. Since 2022, Sharma scores at 110.86 SR in the power play. The only openers who are a part of the 2023 WC and above Sharma are Mitchell Marsh (116.27) and Travis Head (126.51). After the Pakistan clash, Pandya asked how Sharma has been able to hit the bowlers like he was batting on PlayStation. And this is what Sharma had to say: “I have been trying to bat like this in the last two years. The wickets are good so I want to play my shots. I know I missed out on a hundred today. In our team, we have quite a few conventional players and someone has to change the game a little bit” Sharma might have missed out on a hundred — it could have been his eighth in ODI WCs, 32nd overall. However, what he is doing is bigger than that. After trying for a year and a half, Sharma is at the forefront, changing how India bat in the 50-over format. He has understood the need for the change up front and has decided to do it himself, allowing the rest to bat the way they want to. For who better to lead the way than the captain himself on the biggest stage?","pubDate":"2023-10-16 18:38:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3e04f2ff76a76c26ad89c99d65e5e091","title":"How cricket gained Olympic prominence and acceptance","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/17/how-cricket-gained-olympic-prominence-and-acceptance-2624509.html","keywords":null,"creator":null,"video_url":null,"description":"If in 1989, one-day cricket was grudgingly getting acceptance, this time it’s the exponential growth of T20 cricket and its global acceptance that has forced LA28 to include the sport. MUMBAI: In 1989, five Indian cricketers were banned for playing in the US. Among them were Kapil Dev, Dilip Vengsarkar and Ravi Shastri. The players took a detour against the wishes of the Indian cricket board. It’s poetic that thirty-four years later, elite-level international cricket returns to US soil in the world's grandest sporting festival — the Olympics. If in 1989, one-day cricket was grudgingly getting acceptance, this time it’s the exponential growth of T20 cricket and its global acceptance that has forced Los Angeles Olympics 2028 (LA28) to include the sport. Cricket had been an integral part of discussion ever since the Mumbai IOC Session opened six days ago. Then there was the heady mix of cricket and Bollywood too. The LA28 organising committee chairperson, Casey Wasserman, alluded to this after the vote and said the Bollywood connect will be exciting. “The Bollywood connection is exciting for us,” he said while elaborating on hosting cricket matches in a stadium that is being built by LA Knight Ridgers at Great Park in Irvine, California. “If it comes in time we can use it.” The LA28 organising committee chairperson said that cricket was on the list of sports they were excited to think about right from the beginning. “As we went through the processes, it became quite obvious we’d be making a mistake if we didn’t include it,” he said. Watching Indian Premier League (IPL) games also led to a change in perception. He said he had been to IPL and his first game was in 2010. This helped him to understand how to organise and attract the best possible players. “I will never forget my first IPL match. It was electric. And we want to recreate that environment (in LA).” Niccolo Campriani, multiple Olympic gold medallist in the 10m air rifle, said cricket will be a game-changer. “It's a win-win-win scenario not only for the IOC and the cricket community but also for LA28. The idea was to create a perfect combination of American sports to be showcased to the world, but also introducing global sports that are not as developed in the US market. The stars have aligned with Major League Cricket that started this year as well as the T20 World Cup coming in 2024.” The LA28 would be eagerly looking forward to the T20 Cricket World Cup in 2024 to be co-hosted by the US and the West Indies. “We will see if we can take forward the legacy of the World Cup and play matches in stadia created for the World Cup,” he said. The US would not want to invest much in creating new infrastructure. The IOC said it would expect the International Cricket Council (ICC) to send the best players to the Games. Karl Stoss, the chair of the Olympic Programme Commission, said this will be monitored closely. The inclusion of the new disciplines would lead to an increase in the number of athletes in LA as well. In Paris, the number is expected to be 10,500 but in LA, because of the inclusion of four team sports (squash will be individual), total number of athletes will go up to 11,092. Though the IOC has said there will be six teams each in men’s and women’s sections so far, the selection process of the teams and what format it will be played is yet to be finalised. The ICC chairman Greg Barclay, who was present during the voting, said the modalities of selecting teams and other logistics will be discussed and formalised as the Games approaches. “The fact that the IOC confirmation of our selection occurred here in Mumbai, during the ICC Men’s Cricket World Cup, is truly icing on the cake,\" he said, adding that he hoped this would be just the beginning and cricket would be part of the Olympics in future as well. “We are one of the fastest growing team sports in the world but we are under-represented in certain regions and countries, and this is an opportunity to address that,” he said, acknowledging that T20 cricket will grow further and help the sport to remain part of the Olympic movement beyond LA28. Barclay said the ICC worked through to satisfy the LA organising committee and the IOC to admit cricket into the Olympics. “There were myriad issues that would be considered for any sport to be included in the Olympics, so in this case, we were working through all of them,” he said. “(I am) not privy to what exactly drove the decision making — I would like to think so. We are an inclusive sport, our ideals and values line up with the Olympic Movement.” The IOC member in India, Nita Ambani, too played her part. “Cricket is one of the most loved sports globally, and the second most watched,” she said. “It’s a dream of 1.4 billion. I have been batting to include cricket in the Olympics from the time I became a member.” IOC president acknowledged her contribution and said: \"We have always been made aware of this (evolving and development of the game) by IOC member in India Nita Ambani, who has given us good advice.\" ALSO READ | Don't want to see cricket's inclusion in Olympics as a one-off, says ICC chairman Greg Barclay The inclusion of squash paled in comparison to cricket. But years of pitching and consistent pursuance helped the sport to get into LA28 fixtures. Fresh after winning a record nine medals at the Asian Games, the news would give a big boost to the sport in India as well. Former president of World Squash Federation N Ramachandran felt this would help the sport grow. “Not just in terms of popularity but even government’s contribution will increase,” he said. Zena Wooldridge, the president of the WSF, was delighted and said that a lot of things have changed that helped the sport get included in the Olympic programme. “It is all the more exciting because we tried so many times and got very close. We have learned along the way. I think the sport has been on the edge of being in the Olympics, driving us to be more innovative. The length of time that has taken us to get there shows our real desire. We have been persistent.\" ALSO READ | Cricket among five sports given Olympic status for 2028 Los Angeles Games, breakdance dropped She also said that a number of things changed. \"There are a number of things. One of them is that we are universal in terms of our players at the top level and the growth of the professional tour. We have got 34 top-level tour events with £10 million now, going into those top-level tour events and another 750 professional tournaments across the world. That relationship between WSF, the International Federation, and the Professional Squash Associations is really important and it's gotten stronger through this bit because we've worked so closely together.\"","content":"MUMBAI: In 1989, five Indian cricketers were banned for playing in the US. Among them were Kapil Dev, Dilip Vengsarkar and Ravi Shastri. The players took a detour against the wishes of the Indian cricket board. It’s poetic that thirty-four years later, elite-level international cricket returns to US soil in the world's grandest sporting festival — the Olympics. If in 1989, one-day cricket was grudgingly getting acceptance, this time it’s the exponential growth of T20 cricket and its global acceptance that has forced Los Angeles Olympics 2028 (LA28) to include the sport. Cricket had been an integral part of discussion ever since the Mumbai IOC Session opened six days ago. Then there was the heady mix of cricket and Bollywood too. The LA28 organising committee chairperson, Casey Wasserman, alluded to this after the vote and said the Bollywood connect will be exciting. “The Bollywood connection is exciting for us,” he said while elaborating on hosting cricket matches in a stadium that is being built by LA Knight Ridgers at Great Park in Irvine, California. “If it comes in time we can use it.” The LA28 organising committee chairperson said that cricket was on the list of sports they were excited to think about right from the beginning. “As we went through the processes, it became quite obvious we’d be making a mistake if we didn’t include it,” he said. Watching Indian Premier League (IPL) games also led to a change in perception. He said he had been to IPL and his first game was in 2010. This helped him to understand how to organise and attract the best possible players. “I will never forget my first IPL match. It was electric. And we want to recreate that environment (in LA).” Niccolo Campriani, multiple Olympic gold medallist in the 10m air rifle, said cricket will be a game-changer. “It's a win-win-win scenario not only for the IOC and the cricket community but also for LA28. The idea was to create a perfect combination of American sports to be showcased to the world, but also introducing global sports that are not as developed in the US market. The stars have aligned with Major League Cricket that started this year as well as the T20 World Cup coming in 2024.” The LA28 would be eagerly looking forward to the T20 Cricket World Cup in 2024 to be co-hosted by the US and the West Indies. “We will see if we can take forward the legacy of the World Cup and play matches in stadia created for the World Cup,” he said. The US would not want to invest much in creating new infrastructure. The IOC said it would expect the International Cricket Council (ICC) to send the best players to the Games. Karl Stoss, the chair of the Olympic Programme Commission, said this will be monitored closely. The inclusion of the new disciplines would lead to an increase in the number of athletes in LA as well. In Paris, the number is expected to be 10,500 but in LA, because of the inclusion of four team sports (squash will be individual), total number of athletes will go up to 11,092. Though the IOC has said there will be six teams each in men’s and women’s sections so far, the selection process of the teams and what format it will be played is yet to be finalised. The ICC chairman Greg Barclay, who was present during the voting, said the modalities of selecting teams and other logistics will be discussed and formalised as the Games approaches. “The fact that the IOC confirmation of our selection occurred here in Mumbai, during the ICC Men’s Cricket World Cup, is truly icing on the cake,\" he said, adding that he hoped this would be just the beginning and cricket would be part of the Olympics in future as well. “We are one of the fastest growing team sports in the world but we are under-represented in certain regions and countries, and this is an opportunity to address that,” he said, acknowledging that T20 cricket will grow further and help the sport to remain part of the Olympic movement beyond LA28. Barclay said the ICC worked through to satisfy the LA organising committee and the IOC to admit cricket into the Olympics. “There were myriad issues that would be considered for any sport to be included in the Olympics, so in this case, we were working through all of them,” he said. “(I am) not privy to what exactly drove the decision making — I would like to think so. We are an inclusive sport, our ideals and values line up with the Olympic Movement.” The IOC member in India, Nita Ambani, too played her part. “Cricket is one of the most loved sports globally, and the second most watched,” she said. “It’s a dream of 1.4 billion. I have been batting to include cricket in the Olympics from the time I became a member.” IOC president acknowledged her contribution and said: \"We have always been made aware of this (evolving and development of the game) by IOC member in India Nita Ambani, who has given us good advice.\" The inclusion of squash paled in comparison to cricket. But years of pitching and consistent pursuance helped the sport to get into LA28 fixtures. Fresh after winning a record nine medals at the Asian Games, the news would give a big boost to the sport in India as well. Former president of World Squash Federation N Ramachandran felt this would help the sport grow. “Not just in terms of popularity but even government’s contribution will increase,” he said. Zena Wooldridge, the president of the WSF, was delighted and said that a lot of things have changed that helped the sport get included in the Olympic programme. “It is all the more exciting because we tried so many times and got very close. We have learned along the way. I think the sport has been on the edge of being in the Olympics, driving us to be more innovative. The length of time that has taken us to get there shows our real desire. We have been persistent.\" She also said that a number of things changed. \"There are a number of things. One of them is that we are universal in terms of our players at the top level and the growth of the professional tour. We have got 34 top-level tour events with £10 million now, going into those top-level tour events and another 750 professional tournaments across the world. That relationship between WSF, the International Federation, and the Professional Squash Associations is really important and it's gotten stronger through this bit because we've worked so closely together.\"","pubDate":"2023-10-16 18:36:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a2ea47d31ffab5de827392d9eaf0a5a3","title":"Astrologer Predict Australia Beat Sri Lanka: आईसीसी क्रिकेट विश्व कप में ऑस्ट्रेलिया के हाथों श्रीलंका की हार को ज्योतिष ने एक बार फिर की सटीक भविष्यवाणी","link":"https://hindi.latestly.com/socially/sports/cricket/astrology-once-again-accurately-predicted-sri-lankas-defeat-to-australia-in-the-icc-cricket-world-cup-1955484.html","keywords":null,"creator":null,"video_url":null,"description":"ज्योतिषी सुमित बजाज ने पहले इंग्लैंड के खिलाफ अफगानिस्तान की चौंकाने वाली जीत की भविष्यवाणी की थी, उन्होंने श्रीलंका पर ऑस्ट्रेलिया की जीत की भी भविष्यवाणी की थी. 'एक्स' पर उनकी भविष्यवाणी पोस्ट प्रशंसकों के बीच फिर से वायरल हो गई है.","content":"Astrologer Predict Australia Beat Sri Lanka: ऑस्ट्रेलिया ने आईसीसी क्रिकेट विश्व कप 2023 के अपने तीसरे मैच में श्रीलंका पर पांच विकेट से जीत के साथ अंक तालिका में अपना खाता खोला है. वे अंततः अंक तालिका में सबसे नीचे से बाहर हो गए और श्रीलंका और नीदरलैंड को पीछे छोड़ते हुए आठवें स्थान पर पहुंच गए है. ज्योतिषी सुमित बजाज ने पहले इंग्लैंड के खिलाफ अफगानिस्तान की चौंकाने वाली जीत की भविष्यवाणी की थी, उन्होंने श्रीलंका पर ऑस्ट्रेलिया की जीत की भी भविष्यवाणी की थी. 'एक्स' पर उनकी भविष्यवाणी पोस्ट प्रशंसकों के बीच फिर से वायरल हो गई है. ट्वीट देखें: Australia should win against Sri Lanka in their WC encounter at Lucknow. Bettors beware !!! #AusVsSL #SLVsAus #CWC23 — Sumit Bajaj (Astrologer) (@astrosumitbajaj) October 15, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-10-16 18:27:58","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"cec5400061c450882e3354b42ac976e2","title":"विश्वचषकातील पहिल्या विजयानंतर कांगारुंचा आनंद गगनात मावेना, कर्णधाराने दिली प्रतिक्रिया....","link":"https://marathi.abplive.com/sports/cricket/pat-cummins-reaction-on-aus-vs-sl-world-cup-2023-latest-marathi-sports-news-1219489","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup 2023, Pat Cummins Reaction : श्रीलंकेचा पराभव करत ऑस्ट्रेलियाने विजयाचे खाते उघडले आहे. तीन सामन्यात ऑस्ट्रेलियाचा हा पहिलाच विजय आहे. भारत आणि दक्षिण आफ्रिका यांच्याकडून पाच वेळच्या विजेत्या ऑस्ट्रेलियाला पराभवाचा सामना करावा लागला होता. पण आता ऑस्ट्रेलियाच्या विजयाची गाडी पटरीवर परतली आहे. विजयानंतर ऑस्ट्रेलियाच्या खेळाडूंनी जल्लोष केला. विश्वचषकात ऑस्ट्रेलेयाने श्रीलंकेचा नवव्यांदा पराभव केला आहे. श्रीलंकाचा पराभव केल्यानंतर पॅट कमिन्स याने दिलेली प्रतिक्रिया सध्या चर्चेचा विषय आहे.  पॅट कमिन्सने म्हणाला की, मागील दोन पराभवांबाबत मला फारसे बोलायला आवडणार नाही. पण आजच्या सामन्यात आमच्या खेळाडूंनी दाखवलेला उत्साह वाखाणण्याजोगा आहे. श्रीलंकेच्या संघाने शानदार सुरुवात केली होती. पण त्यांना मोठी धावसंख्या उभारता आली नाही. आमच्या गोलंदाजांनी अचूक टप्प्यावर मारा केला.  विजयानंतर पॅट कमिन्स काय म्हणाला ?? पॅट कमिन्स म्हणाला की, \"आमच्या गोलंदाजांनी शानदार गोलंदाजी केली. अचूक टप्प्यावर त्यांनी मारा केला. लखनौच्या इकाना स्टेडिअमची खेळपट्टीवर 300 धावांचा स्कोर आव्हानात्मक होता. श्रीलंकेच्या फलंदाजांनी तशी सुरुवातही केली होती. पण आमच्या गोलंदाजांनी त्यांना रोखलं. चाहते मोठ्या संख्येने सामना पाहण्यासाठी आले होते. त्यांचा सपोर्टही मिळाला. चाहत्यांच्या आवाजाचा आमच्यावर फारसा फरक पडला नाही. कारण, तो खेळाचाच भाग आहे. आजच्या सामन्यात आमच्या खेळाडूंनी शानदार खेळ केला. आगामी सामन्यांमध्ये आम्हाला उत्कृष्ट खेळ कायम ठेवायचा आहे.\" दरम्यान पाकिस्तानचा पुढील सामना 20 ऑक्टोबर रोजी बेंगळुरु येथे पाकिस्तानविरोधात होणार आहे.  ऑस्ट्रेलियाचा पहिला विजय -  श्रीलंकेचा पाच विकेटने पराभव करत ऑस्ट्रेलियाने यंदाच्या विश्वचषकातील विजयाचे खाते उघडले आहे. श्रीलंकेने दिलेले 210 धावांचे आव्हान ऑस्ट्रेलियाने पाच विकेट 35.2 षटकात पार केले. जोश इंग्लिंश आणि मिचेल मार्श यांनी अर्धशतकी खेळी केली.  मिचेल मार्श याने 51 चेंडूत 9 चौकारांच्या मदतीने 52 धावांची खेळी केली. जोश इंग्लिंश याने झंझावती अर्धशतक ठोकले. त्याने एक षटकार आणि पाच चौकारांच्या मदतीने 59 चेंडूत 58 धावांची खेळी केली. लाबुशेन याने 60 चेंडूत 2 चौकारांच्या मदतीने 40 धावा केल्या. मॅक्सवेल याने 21 चेंडूमध्ये दोन षटकार आणि चार चौकारांच्या मदतीने 31 धावांची खेळी केली. तर मार्कस स्टॉयनिस याने एक षटकार आणि दोन चौकारांच्या मदतीने 20 धावांचे योगदान दिले. श्रीलंकाकडून दिलशान मधुशंका याने सर्वाधिक तीन विकेट घेतल्या.   Australia will face Pakistan next at the Chinnaswamy Stadium on 20th October. pic.twitter.com/qVMYTjKDXf — Mufaddal Vohra (@mufaddal_vohra) October 16, 2023","content":"World Cup 2023, Pat Cummins Reaction : श्रीलंकेचा पराभव करत ऑस्ट्रेलियाने विजयाचे खाते उघडले आहे. तीन सामन्यात ऑस्ट्रेलियाचा हा पहिलाच विजय आहे. भारत आणि दक्षिण आफ्रिका यांच्याकडून पाच वेळच्या विजेत्या ऑस्ट्रेलियाला पराभवाचा सामना करावा लागला होता. पण आता ऑस्ट्रेलियाच्या विजयाची गाडी पटरीवर परतली आहे. विजयानंतर ऑस्ट्रेलियाच्या खेळाडूंनी जल्लोष केला. विश्वचषकात ऑस्ट्रेलेयाने श्रीलंकेचा नवव्यांदा पराभव केला आहे. श्रीलंकाचा पराभव केल्यानंतर पॅट कमिन्स याने दिलेली प्रतिक्रिया सध्या चर्चेचा विषय आहे. पॅट कमिन्सने म्हणाला की, मागील दोन पराभवांबाबत मला फारसे बोलायला आवडणार नाही. पण आजच्या सामन्यात आमच्या खेळाडूंनी दाखवलेला उत्साह वाखाणण्याजोगा आहे. श्रीलंकेच्या संघाने शानदार सुरुवात केली होती. पण त्यांना मोठी धावसंख्या उभारता आली नाही. आमच्या गोलंदाजांनी अचूक टप्प्यावर मारा केला. विजयानंतर पॅट कमिन्स काय म्हणाला ?? पॅट कमिन्स म्हणाला की, \"आमच्या गोलंदाजांनी शानदार गोलंदाजी केली. अचूक टप्प्यावर त्यांनी मारा केला. लखनौच्या इकाना स्टेडिअमची खेळपट्टीवर 300 धावांचा स्कोर आव्हानात्मक होता. श्रीलंकेच्या फलंदाजांनी तशी सुरुवातही केली होती. पण आमच्या गोलंदाजांनी त्यांना रोखलं. चाहते मोठ्या संख्येने सामना पाहण्यासाठी आले होते. त्यांचा सपोर्टही मिळाला. चाहत्यांच्या आवाजाचा आमच्यावर फारसा फरक पडला नाही. कारण, तो खेळाचाच भाग आहे. आजच्या सामन्यात आमच्या खेळाडूंनी शानदार खेळ केला. आगामी सामन्यांमध्ये आम्हाला उत्कृष्ट खेळ कायम ठेवायचा आहे.\" दरम्यान पाकिस्तानचा पुढील सामना 20 ऑक्टोबर रोजी बेंगळुरु येथे पाकिस्तानविरोधात होणार आहे. ऑस्ट्रेलियाचा पहिला विजय - googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); श्रीलंकेचा पाच विकेटने पराभव करत ऑस्ट्रेलियाने यंदाच्या विश्वचषकातील विजयाचे खाते उघडले आहे. श्रीलंकेने दिलेले 210 धावांचे आव्हान ऑस्ट्रेलियाने पाच विकेट 35.2 षटकात पार केले. जोश इंग्लिंश आणि मिचेल मार्श यांनी अर्धशतकी खेळी केली. मिचेल मार्श याने 51 चेंडूत 9 चौकारांच्या मदतीने 52 धावांची खेळी केली. जोश इंग्लिंश याने झंझावती अर्धशतक ठोकले. त्याने एक षटकार आणि पाच चौकारांच्या मदतीने 59 चेंडूत 58 धावांची खेळी केली. लाबुशेन याने 60 चेंडूत 2 चौकारांच्या मदतीने 40 धावा केल्या. मॅक्सवेल याने 21 चेंडूमध्ये दोन षटकार आणि चार चौकारांच्या मदतीने 31 धावांची खेळी केली. तर मार्कस स्टॉयनिस याने एक षटकार आणि दोन चौकारांच्या मदतीने 20 धावांचे योगदान दिले. श्रीलंकाकडून दिलशान मधुशंका याने सर्वाधिक तीन विकेट घेतल्या. Australia will face Pakistan next at the Chinnaswamy Stadium on 20th October. pic.twitter.com/qVMYTjKDXf — Mufaddal Vohra (@mufaddal_vohra) October 16, 2023","pubDate":"2023-10-16 18:21:03","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/12/77947e35f37e63f0953bcf3c3c53d9311697131955508428_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"690447c9424b98cb68f419074b0d7ad8","title":"A closer look at the five sports given the go-ahead for the 2028 Olympic Games","link":"https://www.northwalespioneer.co.uk/sport/national/23859610.closer-look-five-sports-given-go-ahead-2028-olympic-games/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events.","content":"Five sports – cricket, squash, baseball/softball, lacrosse and flag football – will either be making their Olympic debut or returning to the programme at the Los Angeles 2028 Games. The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events. Here, the PA news agency looks at all of the confirmed additions and picks out a few current British standouts in each. Hugely exciting that men's and women's cricket will be a part of the 2028 Olympic Games. Read the response of ECB Chief Executive Officer Richard Gould here: — England and Wales Cricket Board (@ECB_cricket) Cricket returns to the Games for the first time in 128 years in the form of six-team men’s and women’s T20 tournaments. It last featured as a men’s-only competition for the Paris Olympic Games in 1900, which means Great Britain’s men will somewhat be going into the competition as defending champions, while the sport’s inclusion is also hailed as a brilliant showcase for the exponentially-growing women’s game. Overtaking his now coach Greg Gaultier to do so, now tops the table for the most consecutive weeks spent inside the top 🔟 🔥 6️⃣7️⃣0️⃣ consecutive weeks in top 104️⃣8️⃣2️⃣ consecutive weeks in top 52️⃣2️⃣1️⃣ weeks spent at World No.1 A modern day legend 👏 Read more… — PSA World Tour (@PSAWorldTour) Squash, one of the sports debuting at LA 2028, has been overlooked by the IOC at the past three Games, and the squash community reacted with incredulity at being ignored in favour of breakdancing for Paris 2024. Monday’s announcement will be welcome news for Great Britain, with three English players currently within the men’s and women’s world top-10 rankings, boasting world and Commonwealth titles between them. LAUNCHED 🚀 — Great Britain Baseball (@GB_Baseball) Great Britain’s baseball and fastpitch softball teams have never been in a better position to qualify for an Olympic Games. Not only did the men’s baseball team qualify for and play in a maiden World Baseball Classic – a bit like the sport’s World Cup this year – they also won a game and did enough to qualify for the next edition, following that up with a third-ever European silver medal in September. GB’s softball team were one win away from making the Tokyo 2020 Olympics – where the sports last featured – and are currently ranked 12th in the latest WBSC World Rankings. They beat a tough challenger in world number three Chinese Taipei earlier this year and, like their baseball counterparts, hold the European silver medal with promising talent in the pipeline. We are very proud to hear the news that Old Alt Tom Bracegirdle has been appointed Captain of the GB Lacrosse team at the World Games in Alabama. Congratulations Tom! — AGSB Head Master (@agsb_official) Like cricket, lacrosse is preparing for its return to the Olympics for the first time in over a century, having last been included on the programme at St Louis 1904 and London 1908. Sixes, the format premiering in Los Angeles, has been described by World Lacrosse as a “fast-paced and compact” version of the game sometimes likened to The Hundred in cricket. Great Britain narrowly missed the podium at the 2022 World Games, placing fourth in both the men’s and women’s competitions, but could certainly be contenders in LA. GB women’s flag football camp ☑️ — Phoebe Schecter (@Phoebe_Schecter) Flag football, a variant of American football, will also make its Olympic debut in just under five years’ time. Unlike the NFL, flag is a pacey non-contact sport where tackles are made by pulling flags off players’ hips. Great Britain’s women are ranked 20th in the world and are the reigning European champions, while the NFL this year launched its first girls’ flag league as part of ambitions to grow the game in the UK.","pubDate":"2023-10-16 18:13:11","image_url":"https://www.northwalespioneer.co.uk/resources/images/17339442/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7c0937faf8d363158a389f93fa4c9bcd","title":"A closer look at the five sports given the go-ahead for the 2028 Olympic Games","link":"https://www.southwalesguardian.co.uk/sport/national/23859610.closer-look-five-sports-given-go-ahead-2028-olympic-games/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events.","content":"Five sports – cricket, squash, baseball/softball, lacrosse and flag football – will either be making their Olympic debut or returning to the programme at the Los Angeles 2028 Games. The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events. Here, the PA news agency looks at all of the confirmed additions and picks out a few current British standouts in each. Cricket Hugely exciting that men's and women's cricket will be a part of the 2028 Olympic Games. Read the response of ECB Chief Executive Officer Richard Gould here: — England and Wales Cricket Board (@ECB_cricket) Cricket returns to the Games for the first time in 128 years in the form of six-team men’s and women’s T20 tournaments. It last featured as a men’s-only competition for the Paris Olympic Games in 1900, which means Great Britain’s men will somewhat be going into the competition as defending champions, while the sport’s inclusion is also hailed as a brilliant showcase for the exponentially-growing women’s game. Squash Overtaking his now coach Greg Gaultier to do so, now tops the table for the most consecutive weeks spent inside the top 🔟 🔥 6️⃣7️⃣0️⃣ consecutive weeks in top 104️⃣8️⃣2️⃣ consecutive weeks in top 52️⃣2️⃣1️⃣ weeks spent at World No.1 A modern day legend 👏 Read more… — PSA World Tour (@PSAWorldTour) Squash, one of the sports debuting at LA 2028, has been overlooked by the IOC at the past three Games, and the squash community reacted with incredulity at being ignored in favour of breakdancing for Paris 2024. Monday’s announcement will be welcome news for Great Britain, with three English players currently within the men’s and women’s world top-10 rankings, boasting world and Commonwealth titles between them. Baseball/Softball LAUNCHED 🚀 — Great Britain Baseball (@GB_Baseball) Great Britain’s baseball and fastpitch softball teams have never been in a better position to qualify for an Olympic Games. Not only did the men’s baseball team qualify for and play in a maiden World Baseball Classic – a bit like the sport’s World Cup this year – they also won a game and did enough to qualify for the next edition, following that up with a third-ever European silver medal in September. GB’s softball team were one win away from making the Tokyo 2020 Olympics – where the sports last featured – and are currently ranked 12th in the latest WBSC World Rankings. They beat a tough challenger in world number three Chinese Taipei earlier this year and, like their baseball counterparts, hold the European silver medal with promising talent in the pipeline. Lacrosse We are very proud to hear the news that Old Alt Tom Bracegirdle has been appointed Captain of the GB Lacrosse team at the World Games in Alabama. Congratulations Tom! — AGSB Head Master (@agsb_official) Like cricket, lacrosse is preparing for its return to the Olympics for the first time in over a century, having last been included on the programme at St Louis 1904 and London 1908. Sixes, the format premiering in Los Angeles, has been described by World Lacrosse as a “fast-paced and compact” version of the game sometimes likened to The Hundred in cricket. Great Britain narrowly missed the podium at the 2022 World Games, placing fourth in both the men’s and women’s competitions, but could certainly be contenders in LA. Flag Football GB women’s flag football camp ☑️ — Phoebe Schecter (@Phoebe_Schecter) Flag football, a variant of American football, will also make its Olympic debut in just under five years’ time. Unlike the NFL, flag is a pacey non-contact sport where tackles are made by pulling flags off players’ hips. Great Britain’s women are ranked 20th in the world and are the reigning European champions, while the NFL this year launched its first girls’ flag league as part of ambitions to grow the game in the UK.","pubDate":"2023-10-16 18:13:11","image_url":"https://www.southwalesguardian.co.uk/resources/images/17339442/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3fda56d6d5edee1a5bf263a6a59784c5","title":"A closer look at the five sports given the go-ahead for the 2028 Olympic Games","link":"https://www.northwaleschronicle.co.uk/sport/national/23859610.closer-look-five-sports-given-go-ahead-2028-olympic-games/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events.","content":"Five sports – cricket, squash, baseball/softball, lacrosse and flag football – will either be making their Olympic debut or returning to the programme at the Los Angeles 2028 Games. The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events. Here, the PA news agency looks at all of the confirmed additions and picks out a few current British standouts in each. Hugely exciting that men's and women's cricket will be a part of the 2028 Olympic Games. Read the response of ECB Chief Executive Officer Richard Gould here: — England and Wales Cricket Board (@ECB_cricket) Cricket returns to the Games for the first time in 128 years in the form of six-team men’s and women’s T20 tournaments. It last featured as a men’s-only competition for the Paris Olympic Games in 1900, which means Great Britain’s men will somewhat be going into the competition as defending champions, while the sport’s inclusion is also hailed as a brilliant showcase for the exponentially-growing women’s game. Overtaking his now coach Greg Gaultier to do so, now tops the table for the most consecutive weeks spent inside the top 🔟 🔥 6️⃣7️⃣0️⃣ consecutive weeks in top 104️⃣8️⃣2️⃣ consecutive weeks in top 52️⃣2️⃣1️⃣ weeks spent at World No.1 A modern day legend 👏 Read more… — PSA World Tour (@PSAWorldTour) Squash, one of the sports debuting at LA 2028, has been overlooked by the IOC at the past three Games, and the squash community reacted with incredulity at being ignored in favour of breakdancing for Paris 2024. Monday’s announcement will be welcome news for Great Britain, with three English players currently within the men’s and women’s world top-10 rankings, boasting world and Commonwealth titles between them. LAUNCHED 🚀 — Great Britain Baseball (@GB_Baseball) Great Britain’s baseball and fastpitch softball teams have never been in a better position to qualify for an Olympic Games. Not only did the men’s baseball team qualify for and play in a maiden World Baseball Classic – a bit like the sport’s World Cup this year – they also won a game and did enough to qualify for the next edition, following that up with a third-ever European silver medal in September. GB’s softball team were one win away from making the Tokyo 2020 Olympics – where the sports last featured – and are currently ranked 12th in the latest WBSC World Rankings. They beat a tough challenger in world number three Chinese Taipei earlier this year and, like their baseball counterparts, hold the European silver medal with promising talent in the pipeline. We are very proud to hear the news that Old Alt Tom Bracegirdle has been appointed Captain of the GB Lacrosse team at the World Games in Alabama. Congratulations Tom! — AGSB Head Master (@agsb_official) Like cricket, lacrosse is preparing for its return to the Olympics for the first time in over a century, having last been included on the programme at St Louis 1904 and London 1908. Sixes, the format premiering in Los Angeles, has been described by World Lacrosse as a “fast-paced and compact” version of the game sometimes likened to The Hundred in cricket. Great Britain narrowly missed the podium at the 2022 World Games, placing fourth in both the men’s and women’s competitions, but could certainly be contenders in LA. GB women’s flag football camp ☑️ — Phoebe Schecter (@Phoebe_Schecter) Flag football, a variant of American football, will also make its Olympic debut in just under five years’ time. Unlike the NFL, flag is a pacey non-contact sport where tackles are made by pulling flags off players’ hips. Great Britain’s women are ranked 20th in the world and are the reigning European champions, while the NFL this year launched its first girls’ flag league as part of ambitions to grow the game in the UK.","pubDate":"2023-10-16 18:13:11","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17339442/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6cb5901991bfa61e4e10d9699e22a204","title":"Australia revive World Cup campaign with victory over Sri Lanka","link":"https://www.brisbanetimes.com.au/sport/cricket/australia-revive-world-cup-campaign-with-victory-over-sri-lanka-20231017-p5ecsu.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Greg Baum"],"video_url":null,"description":"Twice, Australia looked to have played themselves into peril against Sri Lanka, but they came away with a desperately needed win.","content":null,"pubDate":"2023-10-16 18:05:31","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"c699a3ae4f7c3cae20d7c21608ced0de","title":"Papers: Real Madrid scout Jobe Bellingham on England duty","link":"https://www.skysports.com/football/news/20876/12985795/real-madrid-scout-jude-bellinghams-brother-jobe-playing-for-england-u19s-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Tuesday's newspapers...","content":"All the top stories and transfer rumours from Tuesday's newspapers... THE SUN Real Madrid are reported to have scouted Jude Bellingham's younger brother Jobe when he featured for England's U19 side against Montenegro last week. Manchester United are stepping up security around Old Trafford ahead of their return in the Champions League next Tuesday, closely followed by their first derby against City at the end of the month, amid growing displeasure that the Glazers appear to be staying as majority owners. Arsenal forward Kai Havertz has signed a lucrative deal with Puma and will be one of the faces of their new range of \"FUTURE\" boots. Former Brentford and West Ham youth player Kaine Wright has been jailed for three years after being convicted of conspiracy to convert criminal property for his part in the attempted sale of a stolen painting valued at nearly £2m. DAILY EXPRESS Stream the Premier League and more with NOW for £21 a month for six months Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Newcastle have reportedly been told that Sandro Tonali will be free to face Crystal Palace when the Premier League returns this weekend despite his involvement in an Italian betting probe. THE ATHLETIC Liverpool owners Fenway Sports Group are considering their options for a new sporting director should they decide to move on from Jorg Schmadtke at the end of the season. TALKSPORT Former Southampton and Tottenham recruitment guru Paul Mitchell is a potential candidate to become part of Manchester United's backroom team if Sir Jim Ratcliffe's purchase of a minority stake in the club is completed. DAILY MAIL Please use Chrome browser for a more accessible video player Sir Jim Ratcliffe's plan for a radical overhaul of Manchester United's football department will be welcomed by manager Erik ten Hag according to Old Trafford sources. Italy's betting scandal is focused on more than 40 players with high-profile names including Newcastle's Sandro Tonali and Aston Villa's Niccolo Zaniolo just among the first names to be released as part of the investigation. Chelsea fear summer signing Romeo Lavia will not be able to make his first-team debut until December as his ankle injury remains an issue. Joao Felix says he is comfortable with his form since joining Barcelona in the summer and has admitted he struggled to achieve anything like it during his time with Atletico Madrid or Chelsea. DAILY MIRROR Barcelona captain Sergi Roberto could be the next of Lionel Messi's former team-mates to join him at Inter Miami - he is weighing up his options for next summer when his contract expires. Please use Chrome browser for a more accessible video player DAILY TELEGRAPH The Government has told the Football Association it needs to do \"much more\" to show support for the victims of the terrorist attacks in Israel after criticism over their decision not to light the Wembley Arch in support ahead of the friendly against Australia last week. Ellis Genge says England's rugby players are enjoying their World Cup villains tag as they prepare for a semi-final against South Africa on Saturday. The British Ju Jitsu Association is \"urgently\" reviewing its policy on trans inclusion after being branded \"jerks\" by tennis legend Martina Navratilova for allowing transgender women to fight in their female categories. Please use Chrome browser for a more accessible video player THE TIMES Two Wales rugby supporters are in hospital in Marseille after allegedly being attacked by England fans following the semi-final against Fiji on Sunday afternoon, with one British man in his mid-30s being arrested in the city for possession of cocaine. Michael Atherton says England's pace bowlers have been exposed at the Cricket World Cup in India and feels the time has come for all-rounder Chris Woakes to be dropped from the team. GOAL Antonio Conte has confirmed he turned down a lucrative offer to coach in Saudi Arabia and wants to try \"an experience in Rome or Napoli one day\". THE SCOTTISH SUN Steven Davis and Alex Rae are candidates to remain on Rangers coaching staff as Philippe Clement wants someone with a \"deep understanding\" of the club by his side. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-16 21:30:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8435fcfbcb45e21b41ef73a0f35833df","title":"Inclusion of lacrosse in 2028 Olympics brings excitement, motivation","link":"https://www.winnipegfreepress.com/sports/olympics/2023/10/16/inclusion-of-lacrosse-in-2028-olympics-brings-excitement-motivation","keywords":["Olympics"],"creator":["Abdulhamid Ibrahim, The Canadian Press"],"video_url":null,"description":"Lacrosse is making its return to the Olympic stage in 2028. And there’s high hopes for far greater exposure for the sport on an international level. It was one of […]","content":"Lacrosse is making its return to the Olympic stage in 2028. And there's high hopes for far greater exposure for the sport on an international level. Read this article for free: Already have an account? To continue reading, please subscribe: * Lacrosse is making its return to the Olympic stage in 2028. And there’s high hopes for far greater exposure for the sport on an international level. It was one of five sports added to the program of the Los Angeles Games on Monday by the International Olympic Committee. Flag football, baseball/softball, cricket and squash were the others. “A lot of excitement,” Canadian player Wesley Berg said of Monday’s long-awaited news. “In terms of trying to grow the sport of lacrosse, and how big of a stage the Olympics is, it’s pretty cool to have the opportunity for people around the world and younger kids to be able to see the game played at the biggest stage.” Lacrosse was in the Olympics in 1904 and 1908. It was also held as a demonstration sport at the Games — meaning it wasn’t a standard medal competition — in 1928, 1932 and 1948. Canada men’s coach Brodie Merrill called lacrosse’s Olympic return a “gradual process.” “There’s been rumblings over the last few years,” he said “It definitely felt different today when it was finalized. Kind of a surreal moment.” Both men’s and women’s lacrosse will be competed in sixes — a fast-paced, compact version at the intersection of field and box lacrosse that was developed in 2018. “It’s almost too fast, there’s no breaks where you don’t really get a replay,” Berg said. “But it’s so exciting and the games go by so quickly and it’s just constant action. “It’s almost like you need to find a way to take a couple breaks between goals. If there’s a crazy highlight, you can appreciate it.” Lacrosse has doubled its membership from 45 to 90 national federations over the last two decades. It’s currently played in all five continental regions, with four continents represented in both the men’s and women’s world top-10 rankings. “Being involved in the game, coaching the game, playing the game so long, lacrosse has always been a little bit under the radar,” Merrill said. “I just think now having lacrosse in the Olympics elevates it to another level.” Berg, of Coquitlam, B.C., echoed a similar sentiment with hopes of competing for Canada at those Games himself. “It makes you want to stay healthier, work that much harder to be able to get a chance to play in the Olympics because it’s something you dream about as a kid,” said the 30-year-old, who plays in both box lacrosse in the National Lacrosse League (San Diego Seals) and field in the Premier Lacrosse League (Chaos LC). “Up until the last couple of years, I didn’t even think it would be an option. “It’s pretty interesting that some guys are right at the peak of their career and depending on injuries and things like that, you just never know what happens. It motivates you a bit more.” This report by The Canadian Press was first published Oct. 16, 2023. Advertisement Advertisement","pubDate":"2023-10-16 20:35:57","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"fc346469f6675759193315b72f2b67e7","title":"Power Ranger: Ro-Hit at the top","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/17/power-ranger-ro-hit-at-the-top-2624531.html","keywords":null,"creator":null,"video_url":null,"description":"The opener's ability to strike at a good rate during the first 10 overs and adapt during middle overs has helped ;ay the platform for India MUMBAI: Shortly after India’s win against Pakistan in Ahmedabad, Hardik Pandya was mic’d up for BCCI.tv to talk with captain Rohit Sharma. Sharma had followed up his swashbuckling century with a blistering 63-ball 86 to set up the chase for India. He was toying with Pakistan pacers, hitting them across the park for fun — a knock that had six sixes and as many fours. To be fair, Sharma has the most international sixes across formats than any other player. On Saturday, he pulled, lofted (down town as well as over cover), swept, lapped, cut, used his feet, and slogged every Pakistan bowler across the Narendra Modi Stadium. If the the pull shot he played against Shaheen Shah Afridi — Sharma got into his front foot stride, stood tall and hooked the left-arm pacer into the stands — was one for ages, the way he pulled Haris Rauf into square leg, from a similar position would be etched in the memories. Then there was the loft over cover off a slower ball from Rauf. He made six-hitting look ridiculously easy that anyone could do that. But it is not. Sharma’s ability to time the ball to six easily comes from the time he has spent trying to middle every delivery he faced over the years. “His ability is such that he middles every ball. When he plays a shot, the ball meets the best part of the bat,\" says Dinesh Lad, Sharma’s childhood coach. \"I never had to tell him how to play a particular ball. He picks the ball early, and the lines early, I never had to explain. He has the extra time to play the shots he wants. He would be in the grounds from morning till evening. He gave all his time to the sport and that is why he has performed the way he has,” the proud coach added. It is not just about his six-hitting though. Unlike the better part of the 2010s, Sharma’s game has changed significantly since he started opening in Tests. That he had to face the new red ball meant Sharma worked on his stance and back-lift. And the results are there to see — his numbers as a Test opener are among the best at the moment. In many ways, his game has filtered into his white-ball batting as well. He is not as expansive as he used to be, especially early on. “Earlier, if you see his footage, the bat used to be down and there was a a circular motion of the bat in his downswing. But now you can very well notice that ever since he's become an excellent Test cricketer, he has reduced that downswing. He keeps the bat upright in the set up. And, yes, he has made a conscious effort to play the ball close to his body,” former cricketer and coach Amol Muzumdar observed in a conversation with this daily. Sharma’s routine at the crease is simple. Stand in leg-stump, shuffle a bit across with a forward press as the pacer runs in. The bat is just above his knees, coming down straight depending on where he wants to meet the ball. A full delivery and he goes forward with his front foot press. If it's short, Sharma quickly shifts weight on backfoot to play the pull or cut while still being on the front foot. Not many in the world can do that and be as successful as the opener is. Along with that, the aggressive approach in the first ten overs has changed the way Sharma and India are batting in ODIs. His power play strike rate progression from 2015-2023 in ODI WCs says it all — 77.17 (2015), 83.66 (2019) and 153.16 (2023). Yes, you read it right. Sharma has been batting at 153.16 SR in this WC when the field is up. If one needs a larger sample size, here are some numbers. Since 2022, Sharma scores at 110.86 SR in the power play. The only openers who are a part of the 2023 WC and above Sharma are Mitchell Marsh (116.27) and Travis Head (126.51). After the Pakistan clash, Pandya asked how Sharma has been able to hit the bowlers like he was batting on PlayStation. And this is what Sharma had to say: “I have been trying to bat like this in the last two years. The wickets are good so I want to play my shots. I know I missed out on a hundred today. In our team, we have quite a few conventional players and someone has to change the game a little bit” Sharma might have missed out on a hundred — it could have been his eighth in ODI WCs, 32nd overall. However, what he is doing is bigger than that. After trying for a year and a half, Sharma is at the forefront, changing how India bat in the 50-over format. He has understood the need for the change up front and has decided to do it himself, allowing the rest to bat the way they want to. For who better to lead the way than the captain himself on the biggest stage?","content":"MUMBAI: Shortly after India’s win against Pakistan in Ahmedabad, Hardik Pandya was mic’d up for BCCI.tv to talk with captain Rohit Sharma. Sharma had followed up his swashbuckling century with a blistering 63-ball 86 to set up the chase for India. He was toying with Pakistan pacers, hitting them across the park for fun — a knock that had six sixes and as many fours. To be fair, Sharma has the most international sixes across formats than any other player. On Saturday, he pulled, lofted (down town as well as over cover), swept, lapped, cut, used his feet, and slogged every Pakistan bowler across the Narendra Modi Stadium. If the the pull shot he played against Shaheen Shah Afridi — Sharma got into his front foot stride, stood tall and hooked the left-arm pacer into the stands — was one for ages, the way he pulled Haris Rauf into square leg, from a similar position would be etched in the memories. Then there was the loft over cover off a slower ball from Rauf. He made six-hitting look ridiculously easy that anyone could do that. But it is not. Sharma’s ability to time the ball to six easily comes from the time he has spent trying to middle every delivery he faced over the years. “His ability is such that he middles every ball. When he plays a shot, the ball meets the best part of the bat,\" says Dinesh Lad, Sharma’s childhood coach. \"I never had to tell him how to play a particular ball. He picks the ball early, and the lines early, I never had to explain. He has the extra time to play the shots he wants. He would be in the grounds from morning till evening. He gave all his time to the sport and that is why he has performed the way he has,” the proud coach added. It is not just about his six-hitting though. Unlike the better part of the 2010s, Sharma’s game has changed significantly since he started opening in Tests. That he had to face the new red ball meant Sharma worked on his stance and back-lift. And the results are there to see — his numbers as a Test opener are among the best at the moment. In many ways, his game has filtered into his white-ball batting as well. He is not as expansive as he used to be, especially early on. “Earlier, if you see his footage, the bat used to be down and there was a a circular motion of the bat in his downswing. But now you can very well notice that ever since he's become an excellent Test cricketer, he has reduced that downswing. He keeps the bat upright in the set up. And, yes, he has made a conscious effort to play the ball close to his body,” former cricketer and coach Amol Muzumdar observed in a conversation with this daily. Sharma’s routine at the crease is simple. Stand in leg-stump, shuffle a bit across with a forward press as the pacer runs in. The bat is just above his knees, coming down straight depending on where he wants to meet the ball. A full delivery and he goes forward with his front foot press. If it's short, Sharma quickly shifts weight on backfoot to play the pull or cut while still being on the front foot. Not many in the world can do that and be as successful as the opener is. Along with that, the aggressive approach in the first ten overs has changed the way Sharma and India are batting in ODIs. His power play strike rate progression from 2015-2023 in ODI WCs says it all — 77.17 (2015), 83.66 (2019) and 153.16 (2023). Yes, you read it right. Sharma has been batting at 153.16 SR in this WC when the field is up. If one needs a larger sample size, here are some numbers. Since 2022, Sharma scores at 110.86 SR in the power play. The only openers who are a part of the 2023 WC and above Sharma are Mitchell Marsh (116.27) and Travis Head (126.51). After the Pakistan clash, Pandya asked how Sharma has been able to hit the bowlers like he was batting on PlayStation. And this is what Sharma had to say: “I have been trying to bat like this in the last two years. The wickets are good so I want to play my shots. I know I missed out on a hundred today. In our team, we have quite a few conventional players and someone has to change the game a little bit” Sharma might have missed out on a hundred — it could have been his eighth in ODI WCs, 32nd overall. However, what he is doing is bigger than that. After trying for a year and a half, Sharma is at the forefront, changing how India bat in the 50-over format. He has understood the need for the change up front and has decided to do it himself, allowing the rest to bat the way they want to. For who better to lead the way than the captain himself on the biggest stage?","pubDate":"2023-10-16 18:38:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3e04f2ff76a76c26ad89c99d65e5e091","title":"How cricket gained Olympic prominence and acceptance","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/17/how-cricket-gained-olympic-prominence-and-acceptance-2624509.html","keywords":null,"creator":null,"video_url":null,"description":"If in 1989, one-day cricket was grudgingly getting acceptance, this time it’s the exponential growth of T20 cricket and its global acceptance that has forced LA28 to include the sport. MUMBAI: In 1989, five Indian cricketers were banned for playing in the US. Among them were Kapil Dev, Dilip Vengsarkar and Ravi Shastri. The players took a detour against the wishes of the Indian cricket board. It’s poetic that thirty-four years later, elite-level international cricket returns to US soil in the world's grandest sporting festival — the Olympics. If in 1989, one-day cricket was grudgingly getting acceptance, this time it’s the exponential growth of T20 cricket and its global acceptance that has forced Los Angeles Olympics 2028 (LA28) to include the sport. Cricket had been an integral part of discussion ever since the Mumbai IOC Session opened six days ago. Then there was the heady mix of cricket and Bollywood too. The LA28 organising committee chairperson, Casey Wasserman, alluded to this after the vote and said the Bollywood connect will be exciting. “The Bollywood connection is exciting for us,” he said while elaborating on hosting cricket matches in a stadium that is being built by LA Knight Ridgers at Great Park in Irvine, California. “If it comes in time we can use it.” The LA28 organising committee chairperson said that cricket was on the list of sports they were excited to think about right from the beginning. “As we went through the processes, it became quite obvious we’d be making a mistake if we didn’t include it,” he said. Watching Indian Premier League (IPL) games also led to a change in perception. He said he had been to IPL and his first game was in 2010. This helped him to understand how to organise and attract the best possible players. “I will never forget my first IPL match. It was electric. And we want to recreate that environment (in LA).” Niccolo Campriani, multiple Olympic gold medallist in the 10m air rifle, said cricket will be a game-changer. “It's a win-win-win scenario not only for the IOC and the cricket community but also for LA28. The idea was to create a perfect combination of American sports to be showcased to the world, but also introducing global sports that are not as developed in the US market. The stars have aligned with Major League Cricket that started this year as well as the T20 World Cup coming in 2024.” The LA28 would be eagerly looking forward to the T20 Cricket World Cup in 2024 to be co-hosted by the US and the West Indies. “We will see if we can take forward the legacy of the World Cup and play matches in stadia created for the World Cup,” he said. The US would not want to invest much in creating new infrastructure. The IOC said it would expect the International Cricket Council (ICC) to send the best players to the Games. Karl Stoss, the chair of the Olympic Programme Commission, said this will be monitored closely. The inclusion of the new disciplines would lead to an increase in the number of athletes in LA as well. In Paris, the number is expected to be 10,500 but in LA, because of the inclusion of four team sports (squash will be individual), total number of athletes will go up to 11,092. Though the IOC has said there will be six teams each in men’s and women’s sections so far, the selection process of the teams and what format it will be played is yet to be finalised. The ICC chairman Greg Barclay, who was present during the voting, said the modalities of selecting teams and other logistics will be discussed and formalised as the Games approaches. “The fact that the IOC confirmation of our selection occurred here in Mumbai, during the ICC Men’s Cricket World Cup, is truly icing on the cake,\" he said, adding that he hoped this would be just the beginning and cricket would be part of the Olympics in future as well. “We are one of the fastest growing team sports in the world but we are under-represented in certain regions and countries, and this is an opportunity to address that,” he said, acknowledging that T20 cricket will grow further and help the sport to remain part of the Olympic movement beyond LA28. Barclay said the ICC worked through to satisfy the LA organising committee and the IOC to admit cricket into the Olympics. “There were myriad issues that would be considered for any sport to be included in the Olympics, so in this case, we were working through all of them,” he said. “(I am) not privy to what exactly drove the decision making — I would like to think so. We are an inclusive sport, our ideals and values line up with the Olympic Movement.” The IOC member in India, Nita Ambani, too played her part. “Cricket is one of the most loved sports globally, and the second most watched,” she said. “It’s a dream of 1.4 billion. I have been batting to include cricket in the Olympics from the time I became a member.” IOC president acknowledged her contribution and said: \"We have always been made aware of this (evolving and development of the game) by IOC member in India Nita Ambani, who has given us good advice.\" ALSO READ | Don't want to see cricket's inclusion in Olympics as a one-off, says ICC chairman Greg Barclay The inclusion of squash paled in comparison to cricket. But years of pitching and consistent pursuance helped the sport to get into LA28 fixtures. Fresh after winning a record nine medals at the Asian Games, the news would give a big boost to the sport in India as well. Former president of World Squash Federation N Ramachandran felt this would help the sport grow. “Not just in terms of popularity but even government’s contribution will increase,” he said. Zena Wooldridge, the president of the WSF, was delighted and said that a lot of things have changed that helped the sport get included in the Olympic programme. “It is all the more exciting because we tried so many times and got very close. We have learned along the way. I think the sport has been on the edge of being in the Olympics, driving us to be more innovative. The length of time that has taken us to get there shows our real desire. We have been persistent.\" ALSO READ | Cricket among five sports given Olympic status for 2028 Los Angeles Games, breakdance dropped She also said that a number of things changed. \"There are a number of things. One of them is that we are universal in terms of our players at the top level and the growth of the professional tour. We have got 34 top-level tour events with £10 million now, going into those top-level tour events and another 750 professional tournaments across the world. That relationship between WSF, the International Federation, and the Professional Squash Associations is really important and it's gotten stronger through this bit because we've worked so closely together.\"","content":"MUMBAI: In 1989, five Indian cricketers were banned for playing in the US. Among them were Kapil Dev, Dilip Vengsarkar and Ravi Shastri. The players took a detour against the wishes of the Indian cricket board. It’s poetic that thirty-four years later, elite-level international cricket returns to US soil in the world's grandest sporting festival — the Olympics. If in 1989, one-day cricket was grudgingly getting acceptance, this time it’s the exponential growth of T20 cricket and its global acceptance that has forced Los Angeles Olympics 2028 (LA28) to include the sport. Cricket had been an integral part of discussion ever since the Mumbai IOC Session opened six days ago. Then there was the heady mix of cricket and Bollywood too. The LA28 organising committee chairperson, Casey Wasserman, alluded to this after the vote and said the Bollywood connect will be exciting. “The Bollywood connection is exciting for us,” he said while elaborating on hosting cricket matches in a stadium that is being built by LA Knight Ridgers at Great Park in Irvine, California. “If it comes in time we can use it.” The LA28 organising committee chairperson said that cricket was on the list of sports they were excited to think about right from the beginning. “As we went through the processes, it became quite obvious we’d be making a mistake if we didn’t include it,” he said. Watching Indian Premier League (IPL) games also led to a change in perception. He said he had been to IPL and his first game was in 2010. This helped him to understand how to organise and attract the best possible players. “I will never forget my first IPL match. It was electric. And we want to recreate that environment (in LA).” Niccolo Campriani, multiple Olympic gold medallist in the 10m air rifle, said cricket will be a game-changer. “It's a win-win-win scenario not only for the IOC and the cricket community but also for LA28. The idea was to create a perfect combination of American sports to be showcased to the world, but also introducing global sports that are not as developed in the US market. The stars have aligned with Major League Cricket that started this year as well as the T20 World Cup coming in 2024.” The LA28 would be eagerly looking forward to the T20 Cricket World Cup in 2024 to be co-hosted by the US and the West Indies. “We will see if we can take forward the legacy of the World Cup and play matches in stadia created for the World Cup,” he said. The US would not want to invest much in creating new infrastructure. The IOC said it would expect the International Cricket Council (ICC) to send the best players to the Games. Karl Stoss, the chair of the Olympic Programme Commission, said this will be monitored closely. The inclusion of the new disciplines would lead to an increase in the number of athletes in LA as well. In Paris, the number is expected to be 10,500 but in LA, because of the inclusion of four team sports (squash will be individual), total number of athletes will go up to 11,092. Though the IOC has said there will be six teams each in men’s and women’s sections so far, the selection process of the teams and what format it will be played is yet to be finalised. The ICC chairman Greg Barclay, who was present during the voting, said the modalities of selecting teams and other logistics will be discussed and formalised as the Games approaches. “The fact that the IOC confirmation of our selection occurred here in Mumbai, during the ICC Men’s Cricket World Cup, is truly icing on the cake,\" he said, adding that he hoped this would be just the beginning and cricket would be part of the Olympics in future as well. “We are one of the fastest growing team sports in the world but we are under-represented in certain regions and countries, and this is an opportunity to address that,” he said, acknowledging that T20 cricket will grow further and help the sport to remain part of the Olympic movement beyond LA28. Barclay said the ICC worked through to satisfy the LA organising committee and the IOC to admit cricket into the Olympics. “There were myriad issues that would be considered for any sport to be included in the Olympics, so in this case, we were working through all of them,” he said. “(I am) not privy to what exactly drove the decision making — I would like to think so. We are an inclusive sport, our ideals and values line up with the Olympic Movement.” The IOC member in India, Nita Ambani, too played her part. “Cricket is one of the most loved sports globally, and the second most watched,” she said. “It’s a dream of 1.4 billion. I have been batting to include cricket in the Olympics from the time I became a member.” IOC president acknowledged her contribution and said: \"We have always been made aware of this (evolving and development of the game) by IOC member in India Nita Ambani, who has given us good advice.\" The inclusion of squash paled in comparison to cricket. But years of pitching and consistent pursuance helped the sport to get into LA28 fixtures. Fresh after winning a record nine medals at the Asian Games, the news would give a big boost to the sport in India as well. Former president of World Squash Federation N Ramachandran felt this would help the sport grow. “Not just in terms of popularity but even government’s contribution will increase,” he said. Zena Wooldridge, the president of the WSF, was delighted and said that a lot of things have changed that helped the sport get included in the Olympic programme. “It is all the more exciting because we tried so many times and got very close. We have learned along the way. I think the sport has been on the edge of being in the Olympics, driving us to be more innovative. The length of time that has taken us to get there shows our real desire. We have been persistent.\" She also said that a number of things changed. \"There are a number of things. One of them is that we are universal in terms of our players at the top level and the growth of the professional tour. We have got 34 top-level tour events with £10 million now, going into those top-level tour events and another 750 professional tournaments across the world. That relationship between WSF, the International Federation, and the Professional Squash Associations is really important and it's gotten stronger through this bit because we've worked so closely together.\"","pubDate":"2023-10-16 18:36:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a2ea47d31ffab5de827392d9eaf0a5a3","title":"Astrologer Predict Australia Beat Sri Lanka: आईसीसी क्रिकेट विश्व कप में ऑस्ट्रेलिया के हाथों श्रीलंका की हार को ज्योतिष ने एक बार फिर की सटीक भविष्यवाणी","link":"https://hindi.latestly.com/socially/sports/cricket/astrology-once-again-accurately-predicted-sri-lankas-defeat-to-australia-in-the-icc-cricket-world-cup-1955484.html","keywords":null,"creator":null,"video_url":null,"description":"ज्योतिषी सुमित बजाज ने पहले इंग्लैंड के खिलाफ अफगानिस्तान की चौंकाने वाली जीत की भविष्यवाणी की थी, उन्होंने श्रीलंका पर ऑस्ट्रेलिया की जीत की भी भविष्यवाणी की थी. 'एक्स' पर उनकी भविष्यवाणी पोस्ट प्रशंसकों के बीच फिर से वायरल हो गई है.","content":"Astrologer Predict Australia Beat Sri Lanka: ऑस्ट्रेलिया ने आईसीसी क्रिकेट विश्व कप 2023 के अपने तीसरे मैच में श्रीलंका पर पांच विकेट से जीत के साथ अंक तालिका में अपना खाता खोला है. वे अंततः अंक तालिका में सबसे नीचे से बाहर हो गए और श्रीलंका और नीदरलैंड को पीछे छोड़ते हुए आठवें स्थान पर पहुंच गए है. ज्योतिषी सुमित बजाज ने पहले इंग्लैंड के खिलाफ अफगानिस्तान की चौंकाने वाली जीत की भविष्यवाणी की थी, उन्होंने श्रीलंका पर ऑस्ट्रेलिया की जीत की भी भविष्यवाणी की थी. 'एक्स' पर उनकी भविष्यवाणी पोस्ट प्रशंसकों के बीच फिर से वायरल हो गई है. ट्वीट देखें: Australia should win against Sri Lanka in their WC encounter at Lucknow. Bettors beware !!! #AusVsSL #SLVsAus #CWC23 — Sumit Bajaj (Astrologer) (@astrosumitbajaj) October 15, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-10-16 18:27:58","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"cec5400061c450882e3354b42ac976e2","title":"विश्वचषकातील पहिल्या विजयानंतर कांगारुंचा आनंद गगनात मावेना, कर्णधाराने दिली प्रतिक्रिया....","link":"https://marathi.abplive.com/sports/cricket/pat-cummins-reaction-on-aus-vs-sl-world-cup-2023-latest-marathi-sports-news-1219489","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup 2023, Pat Cummins Reaction : श्रीलंकेचा पराभव करत ऑस्ट्रेलियाने विजयाचे खाते उघडले आहे. तीन सामन्यात ऑस्ट्रेलियाचा हा पहिलाच विजय आहे. भारत आणि दक्षिण आफ्रिका यांच्याकडून पाच वेळच्या विजेत्या ऑस्ट्रेलियाला पराभवाचा सामना करावा लागला होता. पण आता ऑस्ट्रेलियाच्या विजयाची गाडी पटरीवर परतली आहे. विजयानंतर ऑस्ट्रेलियाच्या खेळाडूंनी जल्लोष केला. विश्वचषकात ऑस्ट्रेलेयाने श्रीलंकेचा नवव्यांदा पराभव केला आहे. श्रीलंकाचा पराभव केल्यानंतर पॅट कमिन्स याने दिलेली प्रतिक्रिया सध्या चर्चेचा विषय आहे.  पॅट कमिन्सने म्हणाला की, मागील दोन पराभवांबाबत मला फारसे बोलायला आवडणार नाही. पण आजच्या सामन्यात आमच्या खेळाडूंनी दाखवलेला उत्साह वाखाणण्याजोगा आहे. श्रीलंकेच्या संघाने शानदार सुरुवात केली होती. पण त्यांना मोठी धावसंख्या उभारता आली नाही. आमच्या गोलंदाजांनी अचूक टप्प्यावर मारा केला.  विजयानंतर पॅट कमिन्स काय म्हणाला ?? पॅट कमिन्स म्हणाला की, \"आमच्या गोलंदाजांनी शानदार गोलंदाजी केली. अचूक टप्प्यावर त्यांनी मारा केला. लखनौच्या इकाना स्टेडिअमची खेळपट्टीवर 300 धावांचा स्कोर आव्हानात्मक होता. श्रीलंकेच्या फलंदाजांनी तशी सुरुवातही केली होती. पण आमच्या गोलंदाजांनी त्यांना रोखलं. चाहते मोठ्या संख्येने सामना पाहण्यासाठी आले होते. त्यांचा सपोर्टही मिळाला. चाहत्यांच्या आवाजाचा आमच्यावर फारसा फरक पडला नाही. कारण, तो खेळाचाच भाग आहे. आजच्या सामन्यात आमच्या खेळाडूंनी शानदार खेळ केला. आगामी सामन्यांमध्ये आम्हाला उत्कृष्ट खेळ कायम ठेवायचा आहे.\" दरम्यान पाकिस्तानचा पुढील सामना 20 ऑक्टोबर रोजी बेंगळुरु येथे पाकिस्तानविरोधात होणार आहे.  ऑस्ट्रेलियाचा पहिला विजय -  श्रीलंकेचा पाच विकेटने पराभव करत ऑस्ट्रेलियाने यंदाच्या विश्वचषकातील विजयाचे खाते उघडले आहे. श्रीलंकेने दिलेले 210 धावांचे आव्हान ऑस्ट्रेलियाने पाच विकेट 35.2 षटकात पार केले. जोश इंग्लिंश आणि मिचेल मार्श यांनी अर्धशतकी खेळी केली.  मिचेल मार्श याने 51 चेंडूत 9 चौकारांच्या मदतीने 52 धावांची खेळी केली. जोश इंग्लिंश याने झंझावती अर्धशतक ठोकले. त्याने एक षटकार आणि पाच चौकारांच्या मदतीने 59 चेंडूत 58 धावांची खेळी केली. लाबुशेन याने 60 चेंडूत 2 चौकारांच्या मदतीने 40 धावा केल्या. मॅक्सवेल याने 21 चेंडूमध्ये दोन षटकार आणि चार चौकारांच्या मदतीने 31 धावांची खेळी केली. तर मार्कस स्टॉयनिस याने एक षटकार आणि दोन चौकारांच्या मदतीने 20 धावांचे योगदान दिले. श्रीलंकाकडून दिलशान मधुशंका याने सर्वाधिक तीन विकेट घेतल्या.   Australia will face Pakistan next at the Chinnaswamy Stadium on 20th October. pic.twitter.com/qVMYTjKDXf — Mufaddal Vohra (@mufaddal_vohra) October 16, 2023","content":"World Cup 2023, Pat Cummins Reaction : श्रीलंकेचा पराभव करत ऑस्ट्रेलियाने विजयाचे खाते उघडले आहे. तीन सामन्यात ऑस्ट्रेलियाचा हा पहिलाच विजय आहे. भारत आणि दक्षिण आफ्रिका यांच्याकडून पाच वेळच्या विजेत्या ऑस्ट्रेलियाला पराभवाचा सामना करावा लागला होता. पण आता ऑस्ट्रेलियाच्या विजयाची गाडी पटरीवर परतली आहे. विजयानंतर ऑस्ट्रेलियाच्या खेळाडूंनी जल्लोष केला. विश्वचषकात ऑस्ट्रेलेयाने श्रीलंकेचा नवव्यांदा पराभव केला आहे. श्रीलंकाचा पराभव केल्यानंतर पॅट कमिन्स याने दिलेली प्रतिक्रिया सध्या चर्चेचा विषय आहे. पॅट कमिन्सने म्हणाला की, मागील दोन पराभवांबाबत मला फारसे बोलायला आवडणार नाही. पण आजच्या सामन्यात आमच्या खेळाडूंनी दाखवलेला उत्साह वाखाणण्याजोगा आहे. श्रीलंकेच्या संघाने शानदार सुरुवात केली होती. पण त्यांना मोठी धावसंख्या उभारता आली नाही. आमच्या गोलंदाजांनी अचूक टप्प्यावर मारा केला. विजयानंतर पॅट कमिन्स काय म्हणाला ?? पॅट कमिन्स म्हणाला की, \"आमच्या गोलंदाजांनी शानदार गोलंदाजी केली. अचूक टप्प्यावर त्यांनी मारा केला. लखनौच्या इकाना स्टेडिअमची खेळपट्टीवर 300 धावांचा स्कोर आव्हानात्मक होता. श्रीलंकेच्या फलंदाजांनी तशी सुरुवातही केली होती. पण आमच्या गोलंदाजांनी त्यांना रोखलं. चाहते मोठ्या संख्येने सामना पाहण्यासाठी आले होते. त्यांचा सपोर्टही मिळाला. चाहत्यांच्या आवाजाचा आमच्यावर फारसा फरक पडला नाही. कारण, तो खेळाचाच भाग आहे. आजच्या सामन्यात आमच्या खेळाडूंनी शानदार खेळ केला. आगामी सामन्यांमध्ये आम्हाला उत्कृष्ट खेळ कायम ठेवायचा आहे.\" दरम्यान पाकिस्तानचा पुढील सामना 20 ऑक्टोबर रोजी बेंगळुरु येथे पाकिस्तानविरोधात होणार आहे. ऑस्ट्रेलियाचा पहिला विजय - googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); श्रीलंकेचा पाच विकेटने पराभव करत ऑस्ट्रेलियाने यंदाच्या विश्वचषकातील विजयाचे खाते उघडले आहे. श्रीलंकेने दिलेले 210 धावांचे आव्हान ऑस्ट्रेलियाने पाच विकेट 35.2 षटकात पार केले. जोश इंग्लिंश आणि मिचेल मार्श यांनी अर्धशतकी खेळी केली. मिचेल मार्श याने 51 चेंडूत 9 चौकारांच्या मदतीने 52 धावांची खेळी केली. जोश इंग्लिंश याने झंझावती अर्धशतक ठोकले. त्याने एक षटकार आणि पाच चौकारांच्या मदतीने 59 चेंडूत 58 धावांची खेळी केली. लाबुशेन याने 60 चेंडूत 2 चौकारांच्या मदतीने 40 धावा केल्या. मॅक्सवेल याने 21 चेंडूमध्ये दोन षटकार आणि चार चौकारांच्या मदतीने 31 धावांची खेळी केली. तर मार्कस स्टॉयनिस याने एक षटकार आणि दोन चौकारांच्या मदतीने 20 धावांचे योगदान दिले. श्रीलंकाकडून दिलशान मधुशंका याने सर्वाधिक तीन विकेट घेतल्या. Australia will face Pakistan next at the Chinnaswamy Stadium on 20th October. pic.twitter.com/qVMYTjKDXf — Mufaddal Vohra (@mufaddal_vohra) October 16, 2023","pubDate":"2023-10-16 18:21:03","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/12/77947e35f37e63f0953bcf3c3c53d9311697131955508428_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"690447c9424b98cb68f419074b0d7ad8","title":"A closer look at the five sports given the go-ahead for the 2028 Olympic Games","link":"https://www.northwalespioneer.co.uk/sport/national/23859610.closer-look-five-sports-given-go-ahead-2028-olympic-games/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events.","content":"Five sports – cricket, squash, baseball/softball, lacrosse and flag football – will either be making their Olympic debut or returning to the programme at the Los Angeles 2028 Games. The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events. Here, the PA news agency looks at all of the confirmed additions and picks out a few current British standouts in each. Hugely exciting that men's and women's cricket will be a part of the 2028 Olympic Games. Read the response of ECB Chief Executive Officer Richard Gould here: — England and Wales Cricket Board (@ECB_cricket) Cricket returns to the Games for the first time in 128 years in the form of six-team men’s and women’s T20 tournaments. It last featured as a men’s-only competition for the Paris Olympic Games in 1900, which means Great Britain’s men will somewhat be going into the competition as defending champions, while the sport’s inclusion is also hailed as a brilliant showcase for the exponentially-growing women’s game. Overtaking his now coach Greg Gaultier to do so, now tops the table for the most consecutive weeks spent inside the top 🔟 🔥 6️⃣7️⃣0️⃣ consecutive weeks in top 104️⃣8️⃣2️⃣ consecutive weeks in top 52️⃣2️⃣1️⃣ weeks spent at World No.1 A modern day legend 👏 Read more… — PSA World Tour (@PSAWorldTour) Squash, one of the sports debuting at LA 2028, has been overlooked by the IOC at the past three Games, and the squash community reacted with incredulity at being ignored in favour of breakdancing for Paris 2024. Monday’s announcement will be welcome news for Great Britain, with three English players currently within the men’s and women’s world top-10 rankings, boasting world and Commonwealth titles between them. LAUNCHED 🚀 — Great Britain Baseball (@GB_Baseball) Great Britain’s baseball and fastpitch softball teams have never been in a better position to qualify for an Olympic Games. Not only did the men’s baseball team qualify for and play in a maiden World Baseball Classic – a bit like the sport’s World Cup this year – they also won a game and did enough to qualify for the next edition, following that up with a third-ever European silver medal in September. GB’s softball team were one win away from making the Tokyo 2020 Olympics – where the sports last featured – and are currently ranked 12th in the latest WBSC World Rankings. They beat a tough challenger in world number three Chinese Taipei earlier this year and, like their baseball counterparts, hold the European silver medal with promising talent in the pipeline. We are very proud to hear the news that Old Alt Tom Bracegirdle has been appointed Captain of the GB Lacrosse team at the World Games in Alabama. Congratulations Tom! — AGSB Head Master (@agsb_official) Like cricket, lacrosse is preparing for its return to the Olympics for the first time in over a century, having last been included on the programme at St Louis 1904 and London 1908. Sixes, the format premiering in Los Angeles, has been described by World Lacrosse as a “fast-paced and compact” version of the game sometimes likened to The Hundred in cricket. Great Britain narrowly missed the podium at the 2022 World Games, placing fourth in both the men’s and women’s competitions, but could certainly be contenders in LA. GB women’s flag football camp ☑️ — Phoebe Schecter (@Phoebe_Schecter) Flag football, a variant of American football, will also make its Olympic debut in just under five years’ time. Unlike the NFL, flag is a pacey non-contact sport where tackles are made by pulling flags off players’ hips. Great Britain’s women are ranked 20th in the world and are the reigning European champions, while the NFL this year launched its first girls’ flag league as part of ambitions to grow the game in the UK.","pubDate":"2023-10-16 18:13:11","image_url":"https://www.northwalespioneer.co.uk/resources/images/17339442/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7c0937faf8d363158a389f93fa4c9bcd","title":"A closer look at the five sports given the go-ahead for the 2028 Olympic Games","link":"https://www.southwalesguardian.co.uk/sport/national/23859610.closer-look-five-sports-given-go-ahead-2028-olympic-games/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events.","content":"Five sports – cricket, squash, baseball/softball, lacrosse and flag football – will either be making their Olympic debut or returning to the programme at the Los Angeles 2028 Games. The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events. Here, the PA news agency looks at all of the confirmed additions and picks out a few current British standouts in each. Cricket Hugely exciting that men's and women's cricket will be a part of the 2028 Olympic Games. Read the response of ECB Chief Executive Officer Richard Gould here: — England and Wales Cricket Board (@ECB_cricket) Cricket returns to the Games for the first time in 128 years in the form of six-team men’s and women’s T20 tournaments. It last featured as a men’s-only competition for the Paris Olympic Games in 1900, which means Great Britain’s men will somewhat be going into the competition as defending champions, while the sport’s inclusion is also hailed as a brilliant showcase for the exponentially-growing women’s game. Squash Overtaking his now coach Greg Gaultier to do so, now tops the table for the most consecutive weeks spent inside the top 🔟 🔥 6️⃣7️⃣0️⃣ consecutive weeks in top 104️⃣8️⃣2️⃣ consecutive weeks in top 52️⃣2️⃣1️⃣ weeks spent at World No.1 A modern day legend 👏 Read more… — PSA World Tour (@PSAWorldTour) Squash, one of the sports debuting at LA 2028, has been overlooked by the IOC at the past three Games, and the squash community reacted with incredulity at being ignored in favour of breakdancing for Paris 2024. Monday’s announcement will be welcome news for Great Britain, with three English players currently within the men’s and women’s world top-10 rankings, boasting world and Commonwealth titles between them. Baseball/Softball LAUNCHED 🚀 — Great Britain Baseball (@GB_Baseball) Great Britain’s baseball and fastpitch softball teams have never been in a better position to qualify for an Olympic Games. Not only did the men’s baseball team qualify for and play in a maiden World Baseball Classic – a bit like the sport’s World Cup this year – they also won a game and did enough to qualify for the next edition, following that up with a third-ever European silver medal in September. GB’s softball team were one win away from making the Tokyo 2020 Olympics – where the sports last featured – and are currently ranked 12th in the latest WBSC World Rankings. They beat a tough challenger in world number three Chinese Taipei earlier this year and, like their baseball counterparts, hold the European silver medal with promising talent in the pipeline. Lacrosse We are very proud to hear the news that Old Alt Tom Bracegirdle has been appointed Captain of the GB Lacrosse team at the World Games in Alabama. Congratulations Tom! — AGSB Head Master (@agsb_official) Like cricket, lacrosse is preparing for its return to the Olympics for the first time in over a century, having last been included on the programme at St Louis 1904 and London 1908. Sixes, the format premiering in Los Angeles, has been described by World Lacrosse as a “fast-paced and compact” version of the game sometimes likened to The Hundred in cricket. Great Britain narrowly missed the podium at the 2022 World Games, placing fourth in both the men’s and women’s competitions, but could certainly be contenders in LA. Flag Football GB women’s flag football camp ☑️ — Phoebe Schecter (@Phoebe_Schecter) Flag football, a variant of American football, will also make its Olympic debut in just under five years’ time. Unlike the NFL, flag is a pacey non-contact sport where tackles are made by pulling flags off players’ hips. Great Britain’s women are ranked 20th in the world and are the reigning European champions, while the NFL this year launched its first girls’ flag league as part of ambitions to grow the game in the UK.","pubDate":"2023-10-16 18:13:11","image_url":"https://www.southwalesguardian.co.uk/resources/images/17339442/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3fda56d6d5edee1a5bf263a6a59784c5","title":"A closer look at the five sports given the go-ahead for the 2028 Olympic Games","link":"https://www.northwaleschronicle.co.uk/sport/national/23859610.closer-look-five-sports-given-go-ahead-2028-olympic-games/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events.","content":"Five sports – cricket, squash, baseball/softball, lacrosse and flag football – will either be making their Olympic debut or returning to the programme at the Los Angeles 2028 Games. The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events. Here, the PA news agency looks at all of the confirmed additions and picks out a few current British standouts in each. Hugely exciting that men's and women's cricket will be a part of the 2028 Olympic Games. Read the response of ECB Chief Executive Officer Richard Gould here: — England and Wales Cricket Board (@ECB_cricket) Cricket returns to the Games for the first time in 128 years in the form of six-team men’s and women’s T20 tournaments. It last featured as a men’s-only competition for the Paris Olympic Games in 1900, which means Great Britain’s men will somewhat be going into the competition as defending champions, while the sport’s inclusion is also hailed as a brilliant showcase for the exponentially-growing women’s game. Overtaking his now coach Greg Gaultier to do so, now tops the table for the most consecutive weeks spent inside the top 🔟 🔥 6️⃣7️⃣0️⃣ consecutive weeks in top 104️⃣8️⃣2️⃣ consecutive weeks in top 52️⃣2️⃣1️⃣ weeks spent at World No.1 A modern day legend 👏 Read more… — PSA World Tour (@PSAWorldTour) Squash, one of the sports debuting at LA 2028, has been overlooked by the IOC at the past three Games, and the squash community reacted with incredulity at being ignored in favour of breakdancing for Paris 2024. Monday’s announcement will be welcome news for Great Britain, with three English players currently within the men’s and women’s world top-10 rankings, boasting world and Commonwealth titles between them. LAUNCHED 🚀 — Great Britain Baseball (@GB_Baseball) Great Britain’s baseball and fastpitch softball teams have never been in a better position to qualify for an Olympic Games. Not only did the men’s baseball team qualify for and play in a maiden World Baseball Classic – a bit like the sport’s World Cup this year – they also won a game and did enough to qualify for the next edition, following that up with a third-ever European silver medal in September. GB’s softball team were one win away from making the Tokyo 2020 Olympics – where the sports last featured – and are currently ranked 12th in the latest WBSC World Rankings. They beat a tough challenger in world number three Chinese Taipei earlier this year and, like their baseball counterparts, hold the European silver medal with promising talent in the pipeline. We are very proud to hear the news that Old Alt Tom Bracegirdle has been appointed Captain of the GB Lacrosse team at the World Games in Alabama. Congratulations Tom! — AGSB Head Master (@agsb_official) Like cricket, lacrosse is preparing for its return to the Olympics for the first time in over a century, having last been included on the programme at St Louis 1904 and London 1908. Sixes, the format premiering in Los Angeles, has been described by World Lacrosse as a “fast-paced and compact” version of the game sometimes likened to The Hundred in cricket. Great Britain narrowly missed the podium at the 2022 World Games, placing fourth in both the men’s and women’s competitions, but could certainly be contenders in LA. GB women’s flag football camp ☑️ — Phoebe Schecter (@Phoebe_Schecter) Flag football, a variant of American football, will also make its Olympic debut in just under five years’ time. Unlike the NFL, flag is a pacey non-contact sport where tackles are made by pulling flags off players’ hips. Great Britain’s women are ranked 20th in the world and are the reigning European champions, while the NFL this year launched its first girls’ flag league as part of ambitions to grow the game in the UK.","pubDate":"2023-10-16 18:13:11","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17339442/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6cb5901991bfa61e4e10d9699e22a204","title":"Australia revive World Cup campaign with victory over Sri Lanka","link":"https://www.brisbanetimes.com.au/sport/cricket/australia-revive-world-cup-campaign-with-victory-over-sri-lanka-20231017-p5ecsu.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Greg Baum"],"video_url":null,"description":"Twice, Australia looked to have played themselves into peril against Sri Lanka, but they came away with a desperately needed win.","content":null,"pubDate":"2023-10-16 18:05:31","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"c699a3ae4f7c3cae20d7c21608ced0de","title":"Papers: Real Madrid scout Jobe Bellingham on England duty","link":"https://www.skysports.com/football/news/20876/12985795/real-madrid-scout-jude-bellinghams-brother-jobe-playing-for-england-u19s-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Tuesday's newspapers...","content":"All the top stories and transfer rumours from Tuesday's newspapers... THE SUN Real Madrid are reported to have scouted Jude Bellingham's younger brother Jobe when he featured for England's U19 side against Montenegro last week. Manchester United are stepping up security around Old Trafford ahead of their return in the Champions League next Tuesday, closely followed by their first derby against City at the end of the month, amid growing displeasure that the Glazers appear to be staying as majority owners. Arsenal forward Kai Havertz has signed a lucrative deal with Puma and will be one of the faces of their new range of \"FUTURE\" boots. Former Brentford and West Ham youth player Kaine Wright has been jailed for three years after being convicted of conspiracy to convert criminal property for his part in the attempted sale of a stolen painting valued at nearly £2m. DAILY EXPRESS Stream the Premier League and more with NOW for £21 a month for six months Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Newcastle have reportedly been told that Sandro Tonali will be free to face Crystal Palace when the Premier League returns this weekend despite his involvement in an Italian betting probe. THE ATHLETIC Liverpool owners Fenway Sports Group are considering their options for a new sporting director should they decide to move on from Jorg Schmadtke at the end of the season. TALKSPORT Former Southampton and Tottenham recruitment guru Paul Mitchell is a potential candidate to become part of Manchester United's backroom team if Sir Jim Ratcliffe's purchase of a minority stake in the club is completed. DAILY MAIL Please use Chrome browser for a more accessible video player Sir Jim Ratcliffe's plan for a radical overhaul of Manchester United's football department will be welcomed by manager Erik ten Hag according to Old Trafford sources. Italy's betting scandal is focused on more than 40 players with high-profile names including Newcastle's Sandro Tonali and Aston Villa's Niccolo Zaniolo just among the first names to be released as part of the investigation. Chelsea fear summer signing Romeo Lavia will not be able to make his first-team debut until December as his ankle injury remains an issue. Joao Felix says he is comfortable with his form since joining Barcelona in the summer and has admitted he struggled to achieve anything like it during his time with Atletico Madrid or Chelsea. DAILY MIRROR Barcelona captain Sergi Roberto could be the next of Lionel Messi's former team-mates to join him at Inter Miami - he is weighing up his options for next summer when his contract expires. Please use Chrome browser for a more accessible video player DAILY TELEGRAPH The Government has told the Football Association it needs to do \"much more\" to show support for the victims of the terrorist attacks in Israel after criticism over their decision not to light the Wembley Arch in support ahead of the friendly against Australia last week. Ellis Genge says England's rugby players are enjoying their World Cup villains tag as they prepare for a semi-final against South Africa on Saturday. The British Ju Jitsu Association is \"urgently\" reviewing its policy on trans inclusion after being branded \"jerks\" by tennis legend Martina Navratilova for allowing transgender women to fight in their female categories. Please use Chrome browser for a more accessible video player THE TIMES Two Wales rugby supporters are in hospital in Marseille after allegedly being attacked by England fans following the semi-final against Fiji on Sunday afternoon, with one British man in his mid-30s being arrested in the city for possession of cocaine. Michael Atherton says England's pace bowlers have been exposed at the Cricket World Cup in India and feels the time has come for all-rounder Chris Woakes to be dropped from the team. GOAL Antonio Conte has confirmed he turned down a lucrative offer to coach in Saudi Arabia and wants to try \"an experience in Rome or Napoli one day\". THE SCOTTISH SUN Steven Davis and Alex Rae are candidates to remain on Rangers coaching staff as Philippe Clement wants someone with a \"deep understanding\" of the club by his side. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-16 21:30:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8435fcfbcb45e21b41ef73a0f35833df","title":"Inclusion of lacrosse in 2028 Olympics brings excitement, motivation","link":"https://www.winnipegfreepress.com/sports/olympics/2023/10/16/inclusion-of-lacrosse-in-2028-olympics-brings-excitement-motivation","keywords":["Olympics"],"creator":["Abdulhamid Ibrahim, The Canadian Press"],"video_url":null,"description":"Lacrosse is making its return to the Olympic stage in 2028. And there’s high hopes for far greater exposure for the sport on an international level. It was one of […]","content":"Lacrosse is making its return to the Olympic stage in 2028. And there's high hopes for far greater exposure for the sport on an international level. Read this article for free: Already have an account? To continue reading, please subscribe: * Lacrosse is making its return to the Olympic stage in 2028. And there’s high hopes for far greater exposure for the sport on an international level. It was one of five sports added to the program of the Los Angeles Games on Monday by the International Olympic Committee. Flag football, baseball/softball, cricket and squash were the others. “A lot of excitement,” Canadian player Wesley Berg said of Monday’s long-awaited news. “In terms of trying to grow the sport of lacrosse, and how big of a stage the Olympics is, it’s pretty cool to have the opportunity for people around the world and younger kids to be able to see the game played at the biggest stage.” Lacrosse was in the Olympics in 1904 and 1908. It was also held as a demonstration sport at the Games — meaning it wasn’t a standard medal competition — in 1928, 1932 and 1948. Canada men’s coach Brodie Merrill called lacrosse’s Olympic return a “gradual process.” “There’s been rumblings over the last few years,” he said “It definitely felt different today when it was finalized. Kind of a surreal moment.” Both men’s and women’s lacrosse will be competed in sixes — a fast-paced, compact version at the intersection of field and box lacrosse that was developed in 2018. “It’s almost too fast, there’s no breaks where you don’t really get a replay,” Berg said. “But it’s so exciting and the games go by so quickly and it’s just constant action. “It’s almost like you need to find a way to take a couple breaks between goals. If there’s a crazy highlight, you can appreciate it.” Lacrosse has doubled its membership from 45 to 90 national federations over the last two decades. It’s currently played in all five continental regions, with four continents represented in both the men’s and women’s world top-10 rankings. “Being involved in the game, coaching the game, playing the game so long, lacrosse has always been a little bit under the radar,” Merrill said. “I just think now having lacrosse in the Olympics elevates it to another level.” Berg, of Coquitlam, B.C., echoed a similar sentiment with hopes of competing for Canada at those Games himself. “It makes you want to stay healthier, work that much harder to be able to get a chance to play in the Olympics because it’s something you dream about as a kid,” said the 30-year-old, who plays in both box lacrosse in the National Lacrosse League (San Diego Seals) and field in the Premier Lacrosse League (Chaos LC). “Up until the last couple of years, I didn’t even think it would be an option. “It’s pretty interesting that some guys are right at the peak of their career and depending on injuries and things like that, you just never know what happens. It motivates you a bit more.” This report by The Canadian Press was first published Oct. 16, 2023. Advertisement Advertisement","pubDate":"2023-10-16 20:35:57","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"fc346469f6675759193315b72f2b67e7","title":"Power Ranger: Ro-Hit at the top","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/17/power-ranger-ro-hit-at-the-top-2624531.html","keywords":null,"creator":null,"video_url":null,"description":"The opener's ability to strike at a good rate during the first 10 overs and adapt during middle overs has helped ;ay the platform for India MUMBAI: Shortly after India’s win against Pakistan in Ahmedabad, Hardik Pandya was mic’d up for BCCI.tv to talk with captain Rohit Sharma. Sharma had followed up his swashbuckling century with a blistering 63-ball 86 to set up the chase for India. He was toying with Pakistan pacers, hitting them across the park for fun — a knock that had six sixes and as many fours. To be fair, Sharma has the most international sixes across formats than any other player. On Saturday, he pulled, lofted (down town as well as over cover), swept, lapped, cut, used his feet, and slogged every Pakistan bowler across the Narendra Modi Stadium. If the the pull shot he played against Shaheen Shah Afridi — Sharma got into his front foot stride, stood tall and hooked the left-arm pacer into the stands — was one for ages, the way he pulled Haris Rauf into square leg, from a similar position would be etched in the memories. Then there was the loft over cover off a slower ball from Rauf. He made six-hitting look ridiculously easy that anyone could do that. But it is not. Sharma’s ability to time the ball to six easily comes from the time he has spent trying to middle every delivery he faced over the years. “His ability is such that he middles every ball. When he plays a shot, the ball meets the best part of the bat,\" says Dinesh Lad, Sharma’s childhood coach. \"I never had to tell him how to play a particular ball. He picks the ball early, and the lines early, I never had to explain. He has the extra time to play the shots he wants. He would be in the grounds from morning till evening. He gave all his time to the sport and that is why he has performed the way he has,” the proud coach added. It is not just about his six-hitting though. Unlike the better part of the 2010s, Sharma’s game has changed significantly since he started opening in Tests. That he had to face the new red ball meant Sharma worked on his stance and back-lift. And the results are there to see — his numbers as a Test opener are among the best at the moment. In many ways, his game has filtered into his white-ball batting as well. He is not as expansive as he used to be, especially early on. “Earlier, if you see his footage, the bat used to be down and there was a a circular motion of the bat in his downswing. But now you can very well notice that ever since he's become an excellent Test cricketer, he has reduced that downswing. He keeps the bat upright in the set up. And, yes, he has made a conscious effort to play the ball close to his body,” former cricketer and coach Amol Muzumdar observed in a conversation with this daily. Sharma’s routine at the crease is simple. Stand in leg-stump, shuffle a bit across with a forward press as the pacer runs in. The bat is just above his knees, coming down straight depending on where he wants to meet the ball. A full delivery and he goes forward with his front foot press. If it's short, Sharma quickly shifts weight on backfoot to play the pull or cut while still being on the front foot. Not many in the world can do that and be as successful as the opener is. Along with that, the aggressive approach in the first ten overs has changed the way Sharma and India are batting in ODIs. His power play strike rate progression from 2015-2023 in ODI WCs says it all — 77.17 (2015), 83.66 (2019) and 153.16 (2023). Yes, you read it right. Sharma has been batting at 153.16 SR in this WC when the field is up. If one needs a larger sample size, here are some numbers. Since 2022, Sharma scores at 110.86 SR in the power play. The only openers who are a part of the 2023 WC and above Sharma are Mitchell Marsh (116.27) and Travis Head (126.51). After the Pakistan clash, Pandya asked how Sharma has been able to hit the bowlers like he was batting on PlayStation. And this is what Sharma had to say: “I have been trying to bat like this in the last two years. The wickets are good so I want to play my shots. I know I missed out on a hundred today. In our team, we have quite a few conventional players and someone has to change the game a little bit” Sharma might have missed out on a hundred — it could have been his eighth in ODI WCs, 32nd overall. However, what he is doing is bigger than that. After trying for a year and a half, Sharma is at the forefront, changing how India bat in the 50-over format. He has understood the need for the change up front and has decided to do it himself, allowing the rest to bat the way they want to. For who better to lead the way than the captain himself on the biggest stage?","content":"MUMBAI: Shortly after India’s win against Pakistan in Ahmedabad, Hardik Pandya was mic’d up for BCCI.tv to talk with captain Rohit Sharma. Sharma had followed up his swashbuckling century with a blistering 63-ball 86 to set up the chase for India. He was toying with Pakistan pacers, hitting them across the park for fun — a knock that had six sixes and as many fours. To be fair, Sharma has the most international sixes across formats than any other player. On Saturday, he pulled, lofted (down town as well as over cover), swept, lapped, cut, used his feet, and slogged every Pakistan bowler across the Narendra Modi Stadium. If the the pull shot he played against Shaheen Shah Afridi — Sharma got into his front foot stride, stood tall and hooked the left-arm pacer into the stands — was one for ages, the way he pulled Haris Rauf into square leg, from a similar position would be etched in the memories. Then there was the loft over cover off a slower ball from Rauf. He made six-hitting look ridiculously easy that anyone could do that. But it is not. Sharma’s ability to time the ball to six easily comes from the time he has spent trying to middle every delivery he faced over the years. “His ability is such that he middles every ball. When he plays a shot, the ball meets the best part of the bat,\" says Dinesh Lad, Sharma’s childhood coach. \"I never had to tell him how to play a particular ball. He picks the ball early, and the lines early, I never had to explain. He has the extra time to play the shots he wants. He would be in the grounds from morning till evening. He gave all his time to the sport and that is why he has performed the way he has,” the proud coach added. It is not just about his six-hitting though. Unlike the better part of the 2010s, Sharma’s game has changed significantly since he started opening in Tests. That he had to face the new red ball meant Sharma worked on his stance and back-lift. And the results are there to see — his numbers as a Test opener are among the best at the moment. In many ways, his game has filtered into his white-ball batting as well. He is not as expansive as he used to be, especially early on. “Earlier, if you see his footage, the bat used to be down and there was a a circular motion of the bat in his downswing. But now you can very well notice that ever since he's become an excellent Test cricketer, he has reduced that downswing. He keeps the bat upright in the set up. And, yes, he has made a conscious effort to play the ball close to his body,” former cricketer and coach Amol Muzumdar observed in a conversation with this daily. Sharma’s routine at the crease is simple. Stand in leg-stump, shuffle a bit across with a forward press as the pacer runs in. The bat is just above his knees, coming down straight depending on where he wants to meet the ball. A full delivery and he goes forward with his front foot press. If it's short, Sharma quickly shifts weight on backfoot to play the pull or cut while still being on the front foot. Not many in the world can do that and be as successful as the opener is. Along with that, the aggressive approach in the first ten overs has changed the way Sharma and India are batting in ODIs. His power play strike rate progression from 2015-2023 in ODI WCs says it all — 77.17 (2015), 83.66 (2019) and 153.16 (2023). Yes, you read it right. Sharma has been batting at 153.16 SR in this WC when the field is up. If one needs a larger sample size, here are some numbers. Since 2022, Sharma scores at 110.86 SR in the power play. The only openers who are a part of the 2023 WC and above Sharma are Mitchell Marsh (116.27) and Travis Head (126.51). After the Pakistan clash, Pandya asked how Sharma has been able to hit the bowlers like he was batting on PlayStation. And this is what Sharma had to say: “I have been trying to bat like this in the last two years. The wickets are good so I want to play my shots. I know I missed out on a hundred today. In our team, we have quite a few conventional players and someone has to change the game a little bit” Sharma might have missed out on a hundred — it could have been his eighth in ODI WCs, 32nd overall. However, what he is doing is bigger than that. After trying for a year and a half, Sharma is at the forefront, changing how India bat in the 50-over format. He has understood the need for the change up front and has decided to do it himself, allowing the rest to bat the way they want to. For who better to lead the way than the captain himself on the biggest stage?","pubDate":"2023-10-16 18:38:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"3e04f2ff76a76c26ad89c99d65e5e091","title":"How cricket gained Olympic prominence and acceptance","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/17/how-cricket-gained-olympic-prominence-and-acceptance-2624509.html","keywords":null,"creator":null,"video_url":null,"description":"If in 1989, one-day cricket was grudgingly getting acceptance, this time it’s the exponential growth of T20 cricket and its global acceptance that has forced LA28 to include the sport. MUMBAI: In 1989, five Indian cricketers were banned for playing in the US. Among them were Kapil Dev, Dilip Vengsarkar and Ravi Shastri. The players took a detour against the wishes of the Indian cricket board. It’s poetic that thirty-four years later, elite-level international cricket returns to US soil in the world's grandest sporting festival — the Olympics. If in 1989, one-day cricket was grudgingly getting acceptance, this time it’s the exponential growth of T20 cricket and its global acceptance that has forced Los Angeles Olympics 2028 (LA28) to include the sport. Cricket had been an integral part of discussion ever since the Mumbai IOC Session opened six days ago. Then there was the heady mix of cricket and Bollywood too. The LA28 organising committee chairperson, Casey Wasserman, alluded to this after the vote and said the Bollywood connect will be exciting. “The Bollywood connection is exciting for us,” he said while elaborating on hosting cricket matches in a stadium that is being built by LA Knight Ridgers at Great Park in Irvine, California. “If it comes in time we can use it.” The LA28 organising committee chairperson said that cricket was on the list of sports they were excited to think about right from the beginning. “As we went through the processes, it became quite obvious we’d be making a mistake if we didn’t include it,” he said. Watching Indian Premier League (IPL) games also led to a change in perception. He said he had been to IPL and his first game was in 2010. This helped him to understand how to organise and attract the best possible players. “I will never forget my first IPL match. It was electric. And we want to recreate that environment (in LA).” Niccolo Campriani, multiple Olympic gold medallist in the 10m air rifle, said cricket will be a game-changer. “It's a win-win-win scenario not only for the IOC and the cricket community but also for LA28. The idea was to create a perfect combination of American sports to be showcased to the world, but also introducing global sports that are not as developed in the US market. The stars have aligned with Major League Cricket that started this year as well as the T20 World Cup coming in 2024.” The LA28 would be eagerly looking forward to the T20 Cricket World Cup in 2024 to be co-hosted by the US and the West Indies. “We will see if we can take forward the legacy of the World Cup and play matches in stadia created for the World Cup,” he said. The US would not want to invest much in creating new infrastructure. The IOC said it would expect the International Cricket Council (ICC) to send the best players to the Games. Karl Stoss, the chair of the Olympic Programme Commission, said this will be monitored closely. The inclusion of the new disciplines would lead to an increase in the number of athletes in LA as well. In Paris, the number is expected to be 10,500 but in LA, because of the inclusion of four team sports (squash will be individual), total number of athletes will go up to 11,092. Though the IOC has said there will be six teams each in men’s and women’s sections so far, the selection process of the teams and what format it will be played is yet to be finalised. The ICC chairman Greg Barclay, who was present during the voting, said the modalities of selecting teams and other logistics will be discussed and formalised as the Games approaches. “The fact that the IOC confirmation of our selection occurred here in Mumbai, during the ICC Men’s Cricket World Cup, is truly icing on the cake,\" he said, adding that he hoped this would be just the beginning and cricket would be part of the Olympics in future as well. “We are one of the fastest growing team sports in the world but we are under-represented in certain regions and countries, and this is an opportunity to address that,” he said, acknowledging that T20 cricket will grow further and help the sport to remain part of the Olympic movement beyond LA28. Barclay said the ICC worked through to satisfy the LA organising committee and the IOC to admit cricket into the Olympics. “There were myriad issues that would be considered for any sport to be included in the Olympics, so in this case, we were working through all of them,” he said. “(I am) not privy to what exactly drove the decision making — I would like to think so. We are an inclusive sport, our ideals and values line up with the Olympic Movement.” The IOC member in India, Nita Ambani, too played her part. “Cricket is one of the most loved sports globally, and the second most watched,” she said. “It’s a dream of 1.4 billion. I have been batting to include cricket in the Olympics from the time I became a member.” IOC president acknowledged her contribution and said: \"We have always been made aware of this (evolving and development of the game) by IOC member in India Nita Ambani, who has given us good advice.\" ALSO READ | Don't want to see cricket's inclusion in Olympics as a one-off, says ICC chairman Greg Barclay The inclusion of squash paled in comparison to cricket. But years of pitching and consistent pursuance helped the sport to get into LA28 fixtures. Fresh after winning a record nine medals at the Asian Games, the news would give a big boost to the sport in India as well. Former president of World Squash Federation N Ramachandran felt this would help the sport grow. “Not just in terms of popularity but even government’s contribution will increase,” he said. Zena Wooldridge, the president of the WSF, was delighted and said that a lot of things have changed that helped the sport get included in the Olympic programme. “It is all the more exciting because we tried so many times and got very close. We have learned along the way. I think the sport has been on the edge of being in the Olympics, driving us to be more innovative. The length of time that has taken us to get there shows our real desire. We have been persistent.\" ALSO READ | Cricket among five sports given Olympic status for 2028 Los Angeles Games, breakdance dropped She also said that a number of things changed. \"There are a number of things. One of them is that we are universal in terms of our players at the top level and the growth of the professional tour. We have got 34 top-level tour events with £10 million now, going into those top-level tour events and another 750 professional tournaments across the world. That relationship between WSF, the International Federation, and the Professional Squash Associations is really important and it's gotten stronger through this bit because we've worked so closely together.\"","content":"MUMBAI: In 1989, five Indian cricketers were banned for playing in the US. Among them were Kapil Dev, Dilip Vengsarkar and Ravi Shastri. The players took a detour against the wishes of the Indian cricket board. It’s poetic that thirty-four years later, elite-level international cricket returns to US soil in the world's grandest sporting festival — the Olympics. If in 1989, one-day cricket was grudgingly getting acceptance, this time it’s the exponential growth of T20 cricket and its global acceptance that has forced Los Angeles Olympics 2028 (LA28) to include the sport. Cricket had been an integral part of discussion ever since the Mumbai IOC Session opened six days ago. Then there was the heady mix of cricket and Bollywood too. The LA28 organising committee chairperson, Casey Wasserman, alluded to this after the vote and said the Bollywood connect will be exciting. “The Bollywood connection is exciting for us,” he said while elaborating on hosting cricket matches in a stadium that is being built by LA Knight Ridgers at Great Park in Irvine, California. “If it comes in time we can use it.” The LA28 organising committee chairperson said that cricket was on the list of sports they were excited to think about right from the beginning. “As we went through the processes, it became quite obvious we’d be making a mistake if we didn’t include it,” he said. Watching Indian Premier League (IPL) games also led to a change in perception. He said he had been to IPL and his first game was in 2010. This helped him to understand how to organise and attract the best possible players. “I will never forget my first IPL match. It was electric. And we want to recreate that environment (in LA).” Niccolo Campriani, multiple Olympic gold medallist in the 10m air rifle, said cricket will be a game-changer. “It's a win-win-win scenario not only for the IOC and the cricket community but also for LA28. The idea was to create a perfect combination of American sports to be showcased to the world, but also introducing global sports that are not as developed in the US market. The stars have aligned with Major League Cricket that started this year as well as the T20 World Cup coming in 2024.” The LA28 would be eagerly looking forward to the T20 Cricket World Cup in 2024 to be co-hosted by the US and the West Indies. “We will see if we can take forward the legacy of the World Cup and play matches in stadia created for the World Cup,” he said. The US would not want to invest much in creating new infrastructure. The IOC said it would expect the International Cricket Council (ICC) to send the best players to the Games. Karl Stoss, the chair of the Olympic Programme Commission, said this will be monitored closely. The inclusion of the new disciplines would lead to an increase in the number of athletes in LA as well. In Paris, the number is expected to be 10,500 but in LA, because of the inclusion of four team sports (squash will be individual), total number of athletes will go up to 11,092. Though the IOC has said there will be six teams each in men’s and women’s sections so far, the selection process of the teams and what format it will be played is yet to be finalised. The ICC chairman Greg Barclay, who was present during the voting, said the modalities of selecting teams and other logistics will be discussed and formalised as the Games approaches. “The fact that the IOC confirmation of our selection occurred here in Mumbai, during the ICC Men’s Cricket World Cup, is truly icing on the cake,\" he said, adding that he hoped this would be just the beginning and cricket would be part of the Olympics in future as well. “We are one of the fastest growing team sports in the world but we are under-represented in certain regions and countries, and this is an opportunity to address that,” he said, acknowledging that T20 cricket will grow further and help the sport to remain part of the Olympic movement beyond LA28. Barclay said the ICC worked through to satisfy the LA organising committee and the IOC to admit cricket into the Olympics. “There were myriad issues that would be considered for any sport to be included in the Olympics, so in this case, we were working through all of them,” he said. “(I am) not privy to what exactly drove the decision making — I would like to think so. We are an inclusive sport, our ideals and values line up with the Olympic Movement.” The IOC member in India, Nita Ambani, too played her part. “Cricket is one of the most loved sports globally, and the second most watched,” she said. “It’s a dream of 1.4 billion. I have been batting to include cricket in the Olympics from the time I became a member.” IOC president acknowledged her contribution and said: \"We have always been made aware of this (evolving and development of the game) by IOC member in India Nita Ambani, who has given us good advice.\" The inclusion of squash paled in comparison to cricket. But years of pitching and consistent pursuance helped the sport to get into LA28 fixtures. Fresh after winning a record nine medals at the Asian Games, the news would give a big boost to the sport in India as well. Former president of World Squash Federation N Ramachandran felt this would help the sport grow. “Not just in terms of popularity but even government’s contribution will increase,” he said. Zena Wooldridge, the president of the WSF, was delighted and said that a lot of things have changed that helped the sport get included in the Olympic programme. “It is all the more exciting because we tried so many times and got very close. We have learned along the way. I think the sport has been on the edge of being in the Olympics, driving us to be more innovative. The length of time that has taken us to get there shows our real desire. We have been persistent.\" She also said that a number of things changed. \"There are a number of things. One of them is that we are universal in terms of our players at the top level and the growth of the professional tour. We have got 34 top-level tour events with £10 million now, going into those top-level tour events and another 750 professional tournaments across the world. That relationship between WSF, the International Federation, and the Professional Squash Associations is really important and it's gotten stronger through this bit because we've worked so closely together.\"","pubDate":"2023-10-16 18:36:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a2ea47d31ffab5de827392d9eaf0a5a3","title":"Astrologer Predict Australia Beat Sri Lanka: आईसीसी क्रिकेट विश्व कप में ऑस्ट्रेलिया के हाथों श्रीलंका की हार को ज्योतिष ने एक बार फिर की सटीक भविष्यवाणी","link":"https://hindi.latestly.com/socially/sports/cricket/astrology-once-again-accurately-predicted-sri-lankas-defeat-to-australia-in-the-icc-cricket-world-cup-1955484.html","keywords":null,"creator":null,"video_url":null,"description":"ज्योतिषी सुमित बजाज ने पहले इंग्लैंड के खिलाफ अफगानिस्तान की चौंकाने वाली जीत की भविष्यवाणी की थी, उन्होंने श्रीलंका पर ऑस्ट्रेलिया की जीत की भी भविष्यवाणी की थी. 'एक्स' पर उनकी भविष्यवाणी पोस्ट प्रशंसकों के बीच फिर से वायरल हो गई है.","content":"Astrologer Predict Australia Beat Sri Lanka: ऑस्ट्रेलिया ने आईसीसी क्रिकेट विश्व कप 2023 के अपने तीसरे मैच में श्रीलंका पर पांच विकेट से जीत के साथ अंक तालिका में अपना खाता खोला है. वे अंततः अंक तालिका में सबसे नीचे से बाहर हो गए और श्रीलंका और नीदरलैंड को पीछे छोड़ते हुए आठवें स्थान पर पहुंच गए है. ज्योतिषी सुमित बजाज ने पहले इंग्लैंड के खिलाफ अफगानिस्तान की चौंकाने वाली जीत की भविष्यवाणी की थी, उन्होंने श्रीलंका पर ऑस्ट्रेलिया की जीत की भी भविष्यवाणी की थी. 'एक्स' पर उनकी भविष्यवाणी पोस्ट प्रशंसकों के बीच फिर से वायरल हो गई है. ट्वीट देखें: Australia should win against Sri Lanka in their WC encounter at Lucknow. Bettors beware !!! #AusVsSL #SLVsAus #CWC23 — Sumit Bajaj (Astrologer) (@astrosumitbajaj) October 15, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-10-16 18:27:58","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"cec5400061c450882e3354b42ac976e2","title":"विश्वचषकातील पहिल्या विजयानंतर कांगारुंचा आनंद गगनात मावेना, कर्णधाराने दिली प्रतिक्रिया....","link":"https://marathi.abplive.com/sports/cricket/pat-cummins-reaction-on-aus-vs-sl-world-cup-2023-latest-marathi-sports-news-1219489","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup 2023, Pat Cummins Reaction : श्रीलंकेचा पराभव करत ऑस्ट्रेलियाने विजयाचे खाते उघडले आहे. तीन सामन्यात ऑस्ट्रेलियाचा हा पहिलाच विजय आहे. भारत आणि दक्षिण आफ्रिका यांच्याकडून पाच वेळच्या विजेत्या ऑस्ट्रेलियाला पराभवाचा सामना करावा लागला होता. पण आता ऑस्ट्रेलियाच्या विजयाची गाडी पटरीवर परतली आहे. विजयानंतर ऑस्ट्रेलियाच्या खेळाडूंनी जल्लोष केला. विश्वचषकात ऑस्ट्रेलेयाने श्रीलंकेचा नवव्यांदा पराभव केला आहे. श्रीलंकाचा पराभव केल्यानंतर पॅट कमिन्स याने दिलेली प्रतिक्रिया सध्या चर्चेचा विषय आहे.  पॅट कमिन्सने म्हणाला की, मागील दोन पराभवांबाबत मला फारसे बोलायला आवडणार नाही. पण आजच्या सामन्यात आमच्या खेळाडूंनी दाखवलेला उत्साह वाखाणण्याजोगा आहे. श्रीलंकेच्या संघाने शानदार सुरुवात केली होती. पण त्यांना मोठी धावसंख्या उभारता आली नाही. आमच्या गोलंदाजांनी अचूक टप्प्यावर मारा केला.  विजयानंतर पॅट कमिन्स काय म्हणाला ?? पॅट कमिन्स म्हणाला की, \"आमच्या गोलंदाजांनी शानदार गोलंदाजी केली. अचूक टप्प्यावर त्यांनी मारा केला. लखनौच्या इकाना स्टेडिअमची खेळपट्टीवर 300 धावांचा स्कोर आव्हानात्मक होता. श्रीलंकेच्या फलंदाजांनी तशी सुरुवातही केली होती. पण आमच्या गोलंदाजांनी त्यांना रोखलं. चाहते मोठ्या संख्येने सामना पाहण्यासाठी आले होते. त्यांचा सपोर्टही मिळाला. चाहत्यांच्या आवाजाचा आमच्यावर फारसा फरक पडला नाही. कारण, तो खेळाचाच भाग आहे. आजच्या सामन्यात आमच्या खेळाडूंनी शानदार खेळ केला. आगामी सामन्यांमध्ये आम्हाला उत्कृष्ट खेळ कायम ठेवायचा आहे.\" दरम्यान पाकिस्तानचा पुढील सामना 20 ऑक्टोबर रोजी बेंगळुरु येथे पाकिस्तानविरोधात होणार आहे.  ऑस्ट्रेलियाचा पहिला विजय -  श्रीलंकेचा पाच विकेटने पराभव करत ऑस्ट्रेलियाने यंदाच्या विश्वचषकातील विजयाचे खाते उघडले आहे. श्रीलंकेने दिलेले 210 धावांचे आव्हान ऑस्ट्रेलियाने पाच विकेट 35.2 षटकात पार केले. जोश इंग्लिंश आणि मिचेल मार्श यांनी अर्धशतकी खेळी केली.  मिचेल मार्श याने 51 चेंडूत 9 चौकारांच्या मदतीने 52 धावांची खेळी केली. जोश इंग्लिंश याने झंझावती अर्धशतक ठोकले. त्याने एक षटकार आणि पाच चौकारांच्या मदतीने 59 चेंडूत 58 धावांची खेळी केली. लाबुशेन याने 60 चेंडूत 2 चौकारांच्या मदतीने 40 धावा केल्या. मॅक्सवेल याने 21 चेंडूमध्ये दोन षटकार आणि चार चौकारांच्या मदतीने 31 धावांची खेळी केली. तर मार्कस स्टॉयनिस याने एक षटकार आणि दोन चौकारांच्या मदतीने 20 धावांचे योगदान दिले. श्रीलंकाकडून दिलशान मधुशंका याने सर्वाधिक तीन विकेट घेतल्या.   Australia will face Pakistan next at the Chinnaswamy Stadium on 20th October. pic.twitter.com/qVMYTjKDXf — Mufaddal Vohra (@mufaddal_vohra) October 16, 2023","content":"World Cup 2023, Pat Cummins Reaction : श्रीलंकेचा पराभव करत ऑस्ट्रेलियाने विजयाचे खाते उघडले आहे. तीन सामन्यात ऑस्ट्रेलियाचा हा पहिलाच विजय आहे. भारत आणि दक्षिण आफ्रिका यांच्याकडून पाच वेळच्या विजेत्या ऑस्ट्रेलियाला पराभवाचा सामना करावा लागला होता. पण आता ऑस्ट्रेलियाच्या विजयाची गाडी पटरीवर परतली आहे. विजयानंतर ऑस्ट्रेलियाच्या खेळाडूंनी जल्लोष केला. विश्वचषकात ऑस्ट्रेलेयाने श्रीलंकेचा नवव्यांदा पराभव केला आहे. श्रीलंकाचा पराभव केल्यानंतर पॅट कमिन्स याने दिलेली प्रतिक्रिया सध्या चर्चेचा विषय आहे. पॅट कमिन्सने म्हणाला की, मागील दोन पराभवांबाबत मला फारसे बोलायला आवडणार नाही. पण आजच्या सामन्यात आमच्या खेळाडूंनी दाखवलेला उत्साह वाखाणण्याजोगा आहे. श्रीलंकेच्या संघाने शानदार सुरुवात केली होती. पण त्यांना मोठी धावसंख्या उभारता आली नाही. आमच्या गोलंदाजांनी अचूक टप्प्यावर मारा केला. विजयानंतर पॅट कमिन्स काय म्हणाला ?? पॅट कमिन्स म्हणाला की, \"आमच्या गोलंदाजांनी शानदार गोलंदाजी केली. अचूक टप्प्यावर त्यांनी मारा केला. लखनौच्या इकाना स्टेडिअमची खेळपट्टीवर 300 धावांचा स्कोर आव्हानात्मक होता. श्रीलंकेच्या फलंदाजांनी तशी सुरुवातही केली होती. पण आमच्या गोलंदाजांनी त्यांना रोखलं. चाहते मोठ्या संख्येने सामना पाहण्यासाठी आले होते. त्यांचा सपोर्टही मिळाला. चाहत्यांच्या आवाजाचा आमच्यावर फारसा फरक पडला नाही. कारण, तो खेळाचाच भाग आहे. आजच्या सामन्यात आमच्या खेळाडूंनी शानदार खेळ केला. आगामी सामन्यांमध्ये आम्हाला उत्कृष्ट खेळ कायम ठेवायचा आहे.\" दरम्यान पाकिस्तानचा पुढील सामना 20 ऑक्टोबर रोजी बेंगळुरु येथे पाकिस्तानविरोधात होणार आहे. ऑस्ट्रेलियाचा पहिला विजय - googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); श्रीलंकेचा पाच विकेटने पराभव करत ऑस्ट्रेलियाने यंदाच्या विश्वचषकातील विजयाचे खाते उघडले आहे. श्रीलंकेने दिलेले 210 धावांचे आव्हान ऑस्ट्रेलियाने पाच विकेट 35.2 षटकात पार केले. जोश इंग्लिंश आणि मिचेल मार्श यांनी अर्धशतकी खेळी केली. मिचेल मार्श याने 51 चेंडूत 9 चौकारांच्या मदतीने 52 धावांची खेळी केली. जोश इंग्लिंश याने झंझावती अर्धशतक ठोकले. त्याने एक षटकार आणि पाच चौकारांच्या मदतीने 59 चेंडूत 58 धावांची खेळी केली. लाबुशेन याने 60 चेंडूत 2 चौकारांच्या मदतीने 40 धावा केल्या. मॅक्सवेल याने 21 चेंडूमध्ये दोन षटकार आणि चार चौकारांच्या मदतीने 31 धावांची खेळी केली. तर मार्कस स्टॉयनिस याने एक षटकार आणि दोन चौकारांच्या मदतीने 20 धावांचे योगदान दिले. श्रीलंकाकडून दिलशान मधुशंका याने सर्वाधिक तीन विकेट घेतल्या. Australia will face Pakistan next at the Chinnaswamy Stadium on 20th October. pic.twitter.com/qVMYTjKDXf — Mufaddal Vohra (@mufaddal_vohra) October 16, 2023","pubDate":"2023-10-16 18:21:03","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/12/77947e35f37e63f0953bcf3c3c53d9311697131955508428_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"690447c9424b98cb68f419074b0d7ad8","title":"A closer look at the five sports given the go-ahead for the 2028 Olympic Games","link":"https://www.northwalespioneer.co.uk/sport/national/23859610.closer-look-five-sports-given-go-ahead-2028-olympic-games/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events.","content":"Five sports – cricket, squash, baseball/softball, lacrosse and flag football – will either be making their Olympic debut or returning to the programme at the Los Angeles 2028 Games. The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events. Here, the PA news agency looks at all of the confirmed additions and picks out a few current British standouts in each. Hugely exciting that men's and women's cricket will be a part of the 2028 Olympic Games. Read the response of ECB Chief Executive Officer Richard Gould here: — England and Wales Cricket Board (@ECB_cricket) Cricket returns to the Games for the first time in 128 years in the form of six-team men’s and women’s T20 tournaments. It last featured as a men’s-only competition for the Paris Olympic Games in 1900, which means Great Britain’s men will somewhat be going into the competition as defending champions, while the sport’s inclusion is also hailed as a brilliant showcase for the exponentially-growing women’s game. Overtaking his now coach Greg Gaultier to do so, now tops the table for the most consecutive weeks spent inside the top 🔟 🔥 6️⃣7️⃣0️⃣ consecutive weeks in top 104️⃣8️⃣2️⃣ consecutive weeks in top 52️⃣2️⃣1️⃣ weeks spent at World No.1 A modern day legend 👏 Read more… — PSA World Tour (@PSAWorldTour) Squash, one of the sports debuting at LA 2028, has been overlooked by the IOC at the past three Games, and the squash community reacted with incredulity at being ignored in favour of breakdancing for Paris 2024. Monday’s announcement will be welcome news for Great Britain, with three English players currently within the men’s and women’s world top-10 rankings, boasting world and Commonwealth titles between them. LAUNCHED 🚀 — Great Britain Baseball (@GB_Baseball) Great Britain’s baseball and fastpitch softball teams have never been in a better position to qualify for an Olympic Games. Not only did the men’s baseball team qualify for and play in a maiden World Baseball Classic – a bit like the sport’s World Cup this year – they also won a game and did enough to qualify for the next edition, following that up with a third-ever European silver medal in September. GB’s softball team were one win away from making the Tokyo 2020 Olympics – where the sports last featured – and are currently ranked 12th in the latest WBSC World Rankings. They beat a tough challenger in world number three Chinese Taipei earlier this year and, like their baseball counterparts, hold the European silver medal with promising talent in the pipeline. We are very proud to hear the news that Old Alt Tom Bracegirdle has been appointed Captain of the GB Lacrosse team at the World Games in Alabama. Congratulations Tom! — AGSB Head Master (@agsb_official) Like cricket, lacrosse is preparing for its return to the Olympics for the first time in over a century, having last been included on the programme at St Louis 1904 and London 1908. Sixes, the format premiering in Los Angeles, has been described by World Lacrosse as a “fast-paced and compact” version of the game sometimes likened to The Hundred in cricket. Great Britain narrowly missed the podium at the 2022 World Games, placing fourth in both the men’s and women’s competitions, but could certainly be contenders in LA. GB women’s flag football camp ☑️ — Phoebe Schecter (@Phoebe_Schecter) Flag football, a variant of American football, will also make its Olympic debut in just under five years’ time. Unlike the NFL, flag is a pacey non-contact sport where tackles are made by pulling flags off players’ hips. Great Britain’s women are ranked 20th in the world and are the reigning European champions, while the NFL this year launched its first girls’ flag league as part of ambitions to grow the game in the UK.","pubDate":"2023-10-16 18:13:11","image_url":"https://www.northwalespioneer.co.uk/resources/images/17339442/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7c0937faf8d363158a389f93fa4c9bcd","title":"A closer look at the five sports given the go-ahead for the 2028 Olympic Games","link":"https://www.southwalesguardian.co.uk/sport/national/23859610.closer-look-five-sports-given-go-ahead-2028-olympic-games/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events.","content":"Five sports – cricket, squash, baseball/softball, lacrosse and flag football – will either be making their Olympic debut or returning to the programme at the Los Angeles 2028 Games. The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events. Here, the PA news agency looks at all of the confirmed additions and picks out a few current British standouts in each. Cricket Hugely exciting that men's and women's cricket will be a part of the 2028 Olympic Games. Read the response of ECB Chief Executive Officer Richard Gould here: — England and Wales Cricket Board (@ECB_cricket) Cricket returns to the Games for the first time in 128 years in the form of six-team men’s and women’s T20 tournaments. It last featured as a men’s-only competition for the Paris Olympic Games in 1900, which means Great Britain’s men will somewhat be going into the competition as defending champions, while the sport’s inclusion is also hailed as a brilliant showcase for the exponentially-growing women’s game. Squash Overtaking his now coach Greg Gaultier to do so, now tops the table for the most consecutive weeks spent inside the top 🔟 🔥 6️⃣7️⃣0️⃣ consecutive weeks in top 104️⃣8️⃣2️⃣ consecutive weeks in top 52️⃣2️⃣1️⃣ weeks spent at World No.1 A modern day legend 👏 Read more… — PSA World Tour (@PSAWorldTour) Squash, one of the sports debuting at LA 2028, has been overlooked by the IOC at the past three Games, and the squash community reacted with incredulity at being ignored in favour of breakdancing for Paris 2024. Monday’s announcement will be welcome news for Great Britain, with three English players currently within the men’s and women’s world top-10 rankings, boasting world and Commonwealth titles between them. Baseball/Softball LAUNCHED 🚀 — Great Britain Baseball (@GB_Baseball) Great Britain’s baseball and fastpitch softball teams have never been in a better position to qualify for an Olympic Games. Not only did the men’s baseball team qualify for and play in a maiden World Baseball Classic – a bit like the sport’s World Cup this year – they also won a game and did enough to qualify for the next edition, following that up with a third-ever European silver medal in September. GB’s softball team were one win away from making the Tokyo 2020 Olympics – where the sports last featured – and are currently ranked 12th in the latest WBSC World Rankings. They beat a tough challenger in world number three Chinese Taipei earlier this year and, like their baseball counterparts, hold the European silver medal with promising talent in the pipeline. Lacrosse We are very proud to hear the news that Old Alt Tom Bracegirdle has been appointed Captain of the GB Lacrosse team at the World Games in Alabama. Congratulations Tom! — AGSB Head Master (@agsb_official) Like cricket, lacrosse is preparing for its return to the Olympics for the first time in over a century, having last been included on the programme at St Louis 1904 and London 1908. Sixes, the format premiering in Los Angeles, has been described by World Lacrosse as a “fast-paced and compact” version of the game sometimes likened to The Hundred in cricket. Great Britain narrowly missed the podium at the 2022 World Games, placing fourth in both the men’s and women’s competitions, but could certainly be contenders in LA. Flag Football GB women’s flag football camp ☑️ — Phoebe Schecter (@Phoebe_Schecter) Flag football, a variant of American football, will also make its Olympic debut in just under five years’ time. Unlike the NFL, flag is a pacey non-contact sport where tackles are made by pulling flags off players’ hips. Great Britain’s women are ranked 20th in the world and are the reigning European champions, while the NFL this year launched its first girls’ flag league as part of ambitions to grow the game in the UK.","pubDate":"2023-10-16 18:13:11","image_url":"https://www.southwalesguardian.co.uk/resources/images/17339442/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3fda56d6d5edee1a5bf263a6a59784c5","title":"A closer look at the five sports given the go-ahead for the 2028 Olympic Games","link":"https://www.northwaleschronicle.co.uk/sport/national/23859610.closer-look-five-sports-given-go-ahead-2028-olympic-games/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events.","content":"Five sports – cricket, squash, baseball/softball, lacrosse and flag football – will either be making their Olympic debut or returning to the programme at the Los Angeles 2028 Games. The proposal was approved at the International Olympic Committee Session in Mumbai on Monday, with only two delegates voting against the new events. Here, the PA news agency looks at all of the confirmed additions and picks out a few current British standouts in each. Hugely exciting that men's and women's cricket will be a part of the 2028 Olympic Games. Read the response of ECB Chief Executive Officer Richard Gould here: — England and Wales Cricket Board (@ECB_cricket) Cricket returns to the Games for the first time in 128 years in the form of six-team men’s and women’s T20 tournaments. It last featured as a men’s-only competition for the Paris Olympic Games in 1900, which means Great Britain’s men will somewhat be going into the competition as defending champions, while the sport’s inclusion is also hailed as a brilliant showcase for the exponentially-growing women’s game. Overtaking his now coach Greg Gaultier to do so, now tops the table for the most consecutive weeks spent inside the top 🔟 🔥 6️⃣7️⃣0️⃣ consecutive weeks in top 104️⃣8️⃣2️⃣ consecutive weeks in top 52️⃣2️⃣1️⃣ weeks spent at World No.1 A modern day legend 👏 Read more… — PSA World Tour (@PSAWorldTour) Squash, one of the sports debuting at LA 2028, has been overlooked by the IOC at the past three Games, and the squash community reacted with incredulity at being ignored in favour of breakdancing for Paris 2024. Monday’s announcement will be welcome news for Great Britain, with three English players currently within the men’s and women’s world top-10 rankings, boasting world and Commonwealth titles between them. LAUNCHED 🚀 — Great Britain Baseball (@GB_Baseball) Great Britain’s baseball and fastpitch softball teams have never been in a better position to qualify for an Olympic Games. Not only did the men’s baseball team qualify for and play in a maiden World Baseball Classic – a bit like the sport’s World Cup this year – they also won a game and did enough to qualify for the next edition, following that up with a third-ever European silver medal in September. GB’s softball team were one win away from making the Tokyo 2020 Olympics – where the sports last featured – and are currently ranked 12th in the latest WBSC World Rankings. They beat a tough challenger in world number three Chinese Taipei earlier this year and, like their baseball counterparts, hold the European silver medal with promising talent in the pipeline. We are very proud to hear the news that Old Alt Tom Bracegirdle has been appointed Captain of the GB Lacrosse team at the World Games in Alabama. Congratulations Tom! — AGSB Head Master (@agsb_official) Like cricket, lacrosse is preparing for its return to the Olympics for the first time in over a century, having last been included on the programme at St Louis 1904 and London 1908. Sixes, the format premiering in Los Angeles, has been described by World Lacrosse as a “fast-paced and compact” version of the game sometimes likened to The Hundred in cricket. Great Britain narrowly missed the podium at the 2022 World Games, placing fourth in both the men’s and women’s competitions, but could certainly be contenders in LA. GB women’s flag football camp ☑️ — Phoebe Schecter (@Phoebe_Schecter) Flag football, a variant of American football, will also make its Olympic debut in just under five years’ time. Unlike the NFL, flag is a pacey non-contact sport where tackles are made by pulling flags off players’ hips. Great Britain’s women are ranked 20th in the world and are the reigning European champions, while the NFL this year launched its first girls’ flag league as part of ambitions to grow the game in the UK.","pubDate":"2023-10-16 18:13:11","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17339442/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6cb5901991bfa61e4e10d9699e22a204","title":"Australia revive World Cup campaign with victory over Sri Lanka","link":"https://www.brisbanetimes.com.au/sport/cricket/australia-revive-world-cup-campaign-with-victory-over-sri-lanka-20231017-p5ecsu.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Greg Baum"],"video_url":null,"description":"Twice, Australia looked to have played themselves into peril against Sri Lanka, but they came away with a desperately needed win.","content":null,"pubDate":"2023-10-16 18:05:31","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"}]}