{"newsArray":[{"title":"Heath Streak being treated for cancer","link":"https://www.businessweekly.co.zw/heath-streak-being-treated-for-cancer/","keywords":["Sports"],"creator":["abelndooka"],"video_url":null,"description":"“He will continue to fight this disease in a similar vein to that which his opponents faced during his revered days on the cricket field,” his family says. Heath Streak, Zimbabwe’s most celebrated allrounder and a former captain, is undergoing treatment for cancer. “Heath has cancer and is undergoing treatment under one of the most […]","content":"eBusiness Weekly “He will continue to fight this disease in a similar vein to that which his opponents faced during his revered days on the cricket field,” his family says. Heath Streak, Zimbabwe’s most celebrated allrounder and a former captain, is undergoing treatment for cancer. “Heath has cancer and is undergoing treatment under one of the most respected oncologists in South Africa,” his family said in a statement. “He remains in good spirits and will continue to fight this disease in a similar vein to that which his opponents faced during his revered days on the cricket field. “The family hopes that you understand and respect their wish for this to remain a private family matter, and thank you for your prayers and good wishes. There will be no further official statements regarding his health at this time. Any news that becomes public should be regarded as rumour.” Streak, now 49, was a major figure in Zimbabwe cricket through the best part of the 1990s and early 2000s, when they enjoyed their most successful run in international cricket. He represented Zimbabwe in 65 Tests and 189 ODIs between 1993 and 2005, finishing with 1990 runs and 216 wickets in Tests, and 2943 runs and 239 wickets in ODIs. He resigned as Zimbabwe’s captain in 2004 after a clash with the board and retired from international cricket at the age of 31 in 2005. Streak is still the only Zimbabwe bowler with more than 100 Test wickets and over 200 ODI wickets. He captained Zimbabwe in the 2000s, during a difficult period when a number of players withdrew from the national side as relations between the board and team hit rock bottom. In 2021, he was banned for eight years after being charged with – and admitting to – five breaches of the ICC’s anti-corruption code, including accepting payment, in Bitcoin, from a potential corruptor. However, he later said he was not involved in any attempts to fix matches, but he admitted to disclosing inside information pertaining to international games. After his career as a player ended, Streak took up coaching roles with various teams. He served as bowling coach of Bangladesh, Kolkata Knight Riders and Somerset, in addition to having multiple stints in Zimbabwe cricket.","pubDate":"2023-05-18 22:02:59","image_url":null,"source_id":"businessweeklyzw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"'Finally Kaviya Maran Is Happy': SRH's Heinrich Klaasen's Fiery Ton vs RCB Brings The Best Out Of Twitter","link":"https://zeenews.india.com/cricket/finally-kaviya-maran-is-happy-srhs-heinrich-klaasens-fiery-ton-vs-rcb-brings-the-best-out-of-twitter-2609992.html","keywords":null,"creator":null,"video_url":null,"description":"Klaasen produced a T20 batting masterclass vs Royal Challengers Bangalore to take Sunrisers Hyderabad to 186 for 5 in 20 overs after Faf du Plessis won the toss and opted to bowl first in a must-win game.","content":null,"pubDate":"2023-05-18 16:06:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"\"We're Entering Tomorrow's Game As Season's Last One: RR Star On PBKS Game","link":"https://sports.ndtv.com/cricket/were-entering-tomorrows-game-as-seasons-last-one-rr-star-ahead-of-pbks-clash-4046085","keywords":null,"creator":null,"video_url":null,"description":"RR are better placed than Punjab Kings ahead of Friday's game but both will have to rely on other results after an up and down season.","content":"Rajasthan Royals are still mathematically alive in the race for a play-off berth but seamer Sandeep Sharma on Thursday said they will enter their final league game against Punjab Kings' thinking it's their last outing of this IPL season. Considering their superior net run rate, Rajasthan Royals are better placed than Punjab Kings ahead of Friday's game but both will have to rely on other results after an up and down season. \"This kind of game is the easiest to play in, you don't have to think much, just go out there and express yourself. As of now we are entering tomorrow's game as the season's last one and will look to end it on a positive note,\" Sandeep said on the eve of the match. \"Obviously it is a bit stressful, every team wants to qualify for the playoffs, and we found it difficult this year. But, at the same time, as a professional player we have to perform and try to win the game for our team.\" Rajasthan Royals, who looked the team to beat in the first half of IPL with four wins from their first five games, only have themselves to blame for their troubles. While Sandeep starred in the team's win against Chennai Super Kings with his two brilliant yorkers in the last over, his no-ball in the final delivery cost Rajasthan Royals the game against Sunrisers Hyderabad, as Abdul Samad hit the bowler straight over his head for a boundary to win the match for SRH. \"If you are bowling first and you are hit for 15-16 runs, then nobody even thinks about it. But you are bowling second and you have to 15-16 runs, then there is a lot more pressure on the bowler. But for a bowler it is important that he is not scared of the situation and instead accept the challenge. \"And as you can see, batters are too good these days, and boundaries are small, chasing 15-16 runs in the last over is not a big deal anymore. \"So it is important for a bowler to hold his nerves, work hard during training sessions, have faith in his ability and try to execute his plans. Some days you will win a game for your team, and some days you will lose. But it very important to keep practicing and keep trusting yourself,\" Sandeep said. Despite exemplary performances from the likes of Yashasvi Jaiswal and Yuzvendra Chahal, the star-studded outfit has flattered to deceive. Jos Buttler too has played some sensational knocks but has not been consistent enough. Having being dismissed without scoring in the previous two games, the England batter will be itching to perform in the do-or-die game on Friday. Advertisement \"I think we have played some really good cricket this season. In some games we couldn't control the crucial moments so we ended up on the wrong side. But I am pretty sure this ground (HPCA Stadium) is going to suit us a lot. \"I think we have got a few good swing bowlers... when you are bowling in such conditions you try to bowl in good areas, in good lengths, try to swing the ball till its swinging and after that you need to bowl variations. \"It is always easier to plan your bowling by watching other games. We will try to have better plans for tomorrow,\" he signed off. PTI AH AH PDS PDS","pubDate":"2023-05-18 15:06:58","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Cannes: Anil Kumble's Red Carpet Moment With Wife Chetana","link":"https://sports.ndtv.com/cricket/cannes-india-cricket-great-anil-kumbles-red-carpet-moment-with-wife-chetana-4046364","keywords":null,"creator":null,"video_url":null,"description":"Former India captain and coach Anil Kumble has been recently sharing several photos of his time in Cannes","content":null,"pubDate":"2023-05-18 15:04:33","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Suryansh Shedge Replaces Injured Jaydev Unadkat At Lucknow Super Giants","link":"https://sports.ndtv.com/cricket/suryansh-shedge-replaces-injured-jaydev-unadkat-at-lucknow-super-giants-4045730","keywords":null,"creator":null,"video_url":null,"description":"The 20-year-old was included in Mumbai's 17-member Ranji squad last season after scoring 184 runs in eight games and claiming 12 wickets in the U-25 State A Trophy.","content":null,"pubDate":"2023-05-18 14:58:36","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Injured Jaydev Unadkat Replaced By Suryansh Shedge In Lucknow Super Giants Squad Ahead Of KKR Clash","link":"https://zeenews.india.com/cricket/ipl-2023-injured-jaydev-unadkat-replaced-by-suryansh-shedge-in-lucknow-super-giants-squad-ahead-of-kkr-clash-2609926.html","keywords":null,"creator":null,"video_url":null,"description":"Jaydev Unadkat, the left arm pace option, was ruled out of IPL 2023's remaining games after falling on his shoulder in the nets. His replacement Suryansh is an uncapped Mumbai cricketer who plays as an all-rounder.","content":null,"pubDate":"2023-05-18 13:52:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"LIVE: सनराइजर्स हैदराबाद के सामने रॉयल चैलेंजर्स बैंगलोर, यहां देखें मैच का लाइव स्कोरकार्ड","link":"https://navbharattimes.indiatimes.com/sports/cricket/live-score/srh-vs-rcb/scoreboard/matchid-shbc05182023222237.cms","keywords":null,"creator":null,"video_url":null,"description":"Sunrisers Hyderabad vs Royal Challengers Bangalore","content":null,"pubDate":"2023-05-18 13:50:43","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Watch: Kohli Bowls To Du Plessis, Maxwell In Nets. This Happened Next","link":"https://sports.ndtv.com/cricket/virat-kohli-bowls-to-faf-du-plessis-glenn-maxwell-in-nets-with-batting-pads-on-this-happened-next-watch-4044793","keywords":null,"creator":null,"video_url":null,"description":"RCB player Virat Kohli was seen bowling to his teammates Faf du Plesis and Glenn Maxwell with his batting pads on during the team's net session ahead of match against SRH.","content":null,"pubDate":"2023-05-18 13:32:52","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"SRH vs RCB: आरसीबी ने हैदराबाद को पहले बैटिंग के लिए बुलाया, ऐसे है दोनों की प्लेइंग इलेवन","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/rcb-live-score-today-match-scorecard-ball-by-ball-commentary-pitch-report-hyderabad/liveblog/100333879.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-18 13:27:39","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"बल्ले का दिखेगा जोर या गेंदबाज निकाल लेंगे तोड़, पंजाब और राजस्थान के मैच में कैसी होगी धर्मशाला की पिच?","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/pbks-vs-rr-hpca-cricket-stadium-pitch-report-dharamshala-hp-weather-updates/articleshow/100332872.cms","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs RR Pitch Report: आईपीएल 2023 के अपने-अपने आखिरी लीग मैच में पंजाब किंग्स और राजस्थान रॉयल्स की टीमें आमने-सामने होंगी। इस मुकाबले में हारने वाली टीम का प्लेऑफ में पहुंचने की उम्मीद पूरी तरह खत्म हो जाएगी। हम आपको बताते हैं कि इस मैच के लिए धर्मशाला की पिच कैसी होगी।","content":"अभी तक के अपने उतार-चढ़ाव वाले प्रदर्शन के कारण अगर-मगर की कठिन डगर में फंसी पंजाब किंग्स और राजस्थान रॉयल्स की टीम शुक्रवार को आईपीएल 2023 में अपने-अपने आखिरी लीग मैच में खेलने उतरेगी। दोनों ही टीमें खुद को एक दूसरे से बेहतर साबित करके प्लेऑफ में पहुंचने की अपनी धुंधली उम्मीद बरकरार रखने की कोशिश करेंगी। इन दोनों टीम के 13 मैचों में समान 12 अंक हैं लेकिन राजस्थान की टीम बेहतर रन रेट के आधार पर पंजाब से आगे है। इन दोनों टीम को हालांकि इस मैच में जीत दर्ज करने के अलावा बाकी टीम के मैचों में भी अनुकूल परिणाम के लिए प्रार्थना करनी होगी। धर्मशाला के हिमाचल प्रदेश क्रिकेट एसोसिएशन स्टेडियम पर 2013 के बाद बुधवार को पहली बार आईपीएल का मुकाबला खेला गया था। इस मैच मे 400 से ज्यादा रन बने थे। एक बार फिर पंजाब और राजस्थान के मैच में बड़ा स्कोर देखने को मिल सकता है। हालांकि शुरुआती ओवर में तेज गेंदबाजों को मदद रह सकती है। उस समय बल्लेबाजों को सचेत रहने की जरूरत है। पावरप्ले के बाद बल्लेबाजी आसान हो जाने की उम्मीद है। पहाड़ों पर स्थित धर्मशाला में मौसम अभी पूरी तरह साफ है। शुक्रवार को अधिकतम तापमान 27 डिग्री सेल्सियस तक जाने की उम्मीद है। हालांकि मैच शाम साढ़े 7 बजे शुरू होगा और उस समय तक तापमान 20 से 22 डिग्री के आसपास ही होगा। बारिश नहीं होने की वजह से धर्मशाला को फैंस को पूरा मुकाबला देखने को मिलेगा। संजू सैमसन (कप्तान), यशस्वी जायसवाल, जोस बटलर, शिमरोन हेटमायर, जो रूट, देवदत्त पडिक्कल, ध्रुव जुरेल, रियान पराग, संदीप शर्मा, ट्रेंट बोल्ट, ओबेड मैककॉय, नवदीप सैनी, कुलदीप सेन, कुलदीप यादव, रविचंद्रन अश्विन , युजवेंद्र चहल, केसी करियप्पा, जेसन होल्डर, डोनोवन फरेरा, कुणाल राठौर, एडम ज़म्पा, केएम आसिफ, मुरुगन अश्विन, आकाश वशिष्ठ और अब्दुल पीए। शिखर धवन (कप्तान), शाहरुख खान, मैथ्यू शॉर्ट, प्रभसिमरन सिंह, भानुका राजपक्षे, जितेश शर्मा, गुरनूर सिंह बराड़, ऋषि धवन, लियाम लिविंगस्टोन, अथर्व तायडे, अर्शदीप सिंह, बलतेज सिंह, नाथन एलिस, कगिसो रबाडा, राहुल चाहर, हरप्रीत बराड़, सैम कुरेन, सिकंदर रजा, हरप्रीत भाटिया, विद्वाथ कावेरप्पा, मोहित राठी, शिवम सिंह।","pubDate":"2023-05-18 13:10:37","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Heath Streak being treated for cancer","link":"https://www.businessweekly.co.zw/heath-streak-being-treated-for-cancer/","keywords":["Sports"],"creator":["abelndooka"],"video_url":null,"description":"“He will continue to fight this disease in a similar vein to that which his opponents faced during his revered days on the cricket field,” his family says. Heath Streak, Zimbabwe’s most celebrated allrounder and a former captain, is undergoing treatment for cancer. “Heath has cancer and is undergoing treatment under one of the most […]","content":"eBusiness Weekly “He will continue to fight this disease in a similar vein to that which his opponents faced during his revered days on the cricket field,” his family says. Heath Streak, Zimbabwe’s most celebrated allrounder and a former captain, is undergoing treatment for cancer. “Heath has cancer and is undergoing treatment under one of the most respected oncologists in South Africa,” his family said in a statement. “He remains in good spirits and will continue to fight this disease in a similar vein to that which his opponents faced during his revered days on the cricket field. “The family hopes that you understand and respect their wish for this to remain a private family matter, and thank you for your prayers and good wishes. There will be no further official statements regarding his health at this time. Any news that becomes public should be regarded as rumour.” Streak, now 49, was a major figure in Zimbabwe cricket through the best part of the 1990s and early 2000s, when they enjoyed their most successful run in international cricket. He represented Zimbabwe in 65 Tests and 189 ODIs between 1993 and 2005, finishing with 1990 runs and 216 wickets in Tests, and 2943 runs and 239 wickets in ODIs. He resigned as Zimbabwe’s captain in 2004 after a clash with the board and retired from international cricket at the age of 31 in 2005. Streak is still the only Zimbabwe bowler with more than 100 Test wickets and over 200 ODI wickets. He captained Zimbabwe in the 2000s, during a difficult period when a number of players withdrew from the national side as relations between the board and team hit rock bottom. In 2021, he was banned for eight years after being charged with – and admitting to – five breaches of the ICC’s anti-corruption code, including accepting payment, in Bitcoin, from a potential corruptor. However, he later said he was not involved in any attempts to fix matches, but he admitted to disclosing inside information pertaining to international games. After his career as a player ended, Streak took up coaching roles with various teams. He served as bowling coach of Bangladesh, Kolkata Knight Riders and Somerset, in addition to having multiple stints in Zimbabwe cricket.","pubDate":"2023-05-18 22:02:59","image_url":null,"source_id":"businessweeklyzw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"'Finally Kaviya Maran Is Happy': SRH's Heinrich Klaasen's Fiery Ton vs RCB Brings The Best Out Of Twitter","link":"https://zeenews.india.com/cricket/finally-kaviya-maran-is-happy-srhs-heinrich-klaasens-fiery-ton-vs-rcb-brings-the-best-out-of-twitter-2609992.html","keywords":null,"creator":null,"video_url":null,"description":"Klaasen produced a T20 batting masterclass vs Royal Challengers Bangalore to take Sunrisers Hyderabad to 186 for 5 in 20 overs after Faf du Plessis won the toss and opted to bowl first in a must-win game.","content":null,"pubDate":"2023-05-18 16:06:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"\"We're Entering Tomorrow's Game As Season's Last One: RR Star On PBKS Game","link":"https://sports.ndtv.com/cricket/were-entering-tomorrows-game-as-seasons-last-one-rr-star-ahead-of-pbks-clash-4046085","keywords":null,"creator":null,"video_url":null,"description":"RR are better placed than Punjab Kings ahead of Friday's game but both will have to rely on other results after an up and down season.","content":"Rajasthan Royals are still mathematically alive in the race for a play-off berth but seamer Sandeep Sharma on Thursday said they will enter their final league game against Punjab Kings' thinking it's their last outing of this IPL season. Considering their superior net run rate, Rajasthan Royals are better placed than Punjab Kings ahead of Friday's game but both will have to rely on other results after an up and down season. \"This kind of game is the easiest to play in, you don't have to think much, just go out there and express yourself. As of now we are entering tomorrow's game as the season's last one and will look to end it on a positive note,\" Sandeep said on the eve of the match. \"Obviously it is a bit stressful, every team wants to qualify for the playoffs, and we found it difficult this year. But, at the same time, as a professional player we have to perform and try to win the game for our team.\" Rajasthan Royals, who looked the team to beat in the first half of IPL with four wins from their first five games, only have themselves to blame for their troubles. While Sandeep starred in the team's win against Chennai Super Kings with his two brilliant yorkers in the last over, his no-ball in the final delivery cost Rajasthan Royals the game against Sunrisers Hyderabad, as Abdul Samad hit the bowler straight over his head for a boundary to win the match for SRH. \"If you are bowling first and you are hit for 15-16 runs, then nobody even thinks about it. But you are bowling second and you have to 15-16 runs, then there is a lot more pressure on the bowler. But for a bowler it is important that he is not scared of the situation and instead accept the challenge. \"And as you can see, batters are too good these days, and boundaries are small, chasing 15-16 runs in the last over is not a big deal anymore. \"So it is important for a bowler to hold his nerves, work hard during training sessions, have faith in his ability and try to execute his plans. Some days you will win a game for your team, and some days you will lose. But it very important to keep practicing and keep trusting yourself,\" Sandeep said. Despite exemplary performances from the likes of Yashasvi Jaiswal and Yuzvendra Chahal, the star-studded outfit has flattered to deceive. Jos Buttler too has played some sensational knocks but has not been consistent enough. Having being dismissed without scoring in the previous two games, the England batter will be itching to perform in the do-or-die game on Friday. Advertisement \"I think we have played some really good cricket this season. In some games we couldn't control the crucial moments so we ended up on the wrong side. But I am pretty sure this ground (HPCA Stadium) is going to suit us a lot. \"I think we have got a few good swing bowlers... when you are bowling in such conditions you try to bowl in good areas, in good lengths, try to swing the ball till its swinging and after that you need to bowl variations. \"It is always easier to plan your bowling by watching other games. We will try to have better plans for tomorrow,\" he signed off. PTI AH AH PDS PDS","pubDate":"2023-05-18 15:06:58","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Cannes: Anil Kumble's Red Carpet Moment With Wife Chetana","link":"https://sports.ndtv.com/cricket/cannes-india-cricket-great-anil-kumbles-red-carpet-moment-with-wife-chetana-4046364","keywords":null,"creator":null,"video_url":null,"description":"Former India captain and coach Anil Kumble has been recently sharing several photos of his time in Cannes","content":null,"pubDate":"2023-05-18 15:04:33","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Suryansh Shedge Replaces Injured Jaydev Unadkat At Lucknow Super Giants","link":"https://sports.ndtv.com/cricket/suryansh-shedge-replaces-injured-jaydev-unadkat-at-lucknow-super-giants-4045730","keywords":null,"creator":null,"video_url":null,"description":"The 20-year-old was included in Mumbai's 17-member Ranji squad last season after scoring 184 runs in eight games and claiming 12 wickets in the U-25 State A Trophy.","content":null,"pubDate":"2023-05-18 14:58:36","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Injured Jaydev Unadkat Replaced By Suryansh Shedge In Lucknow Super Giants Squad Ahead Of KKR Clash","link":"https://zeenews.india.com/cricket/ipl-2023-injured-jaydev-unadkat-replaced-by-suryansh-shedge-in-lucknow-super-giants-squad-ahead-of-kkr-clash-2609926.html","keywords":null,"creator":null,"video_url":null,"description":"Jaydev Unadkat, the left arm pace option, was ruled out of IPL 2023's remaining games after falling on his shoulder in the nets. His replacement Suryansh is an uncapped Mumbai cricketer who plays as an all-rounder.","content":null,"pubDate":"2023-05-18 13:52:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"LIVE: सनराइजर्स हैदराबाद के सामने रॉयल चैलेंजर्स बैंगलोर, यहां देखें मैच का लाइव स्कोरकार्ड","link":"https://navbharattimes.indiatimes.com/sports/cricket/live-score/srh-vs-rcb/scoreboard/matchid-shbc05182023222237.cms","keywords":null,"creator":null,"video_url":null,"description":"Sunrisers Hyderabad vs Royal Challengers Bangalore","content":null,"pubDate":"2023-05-18 13:50:43","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Watch: Kohli Bowls To Du Plessis, Maxwell In Nets. This Happened Next","link":"https://sports.ndtv.com/cricket/virat-kohli-bowls-to-faf-du-plessis-glenn-maxwell-in-nets-with-batting-pads-on-this-happened-next-watch-4044793","keywords":null,"creator":null,"video_url":null,"description":"RCB player Virat Kohli was seen bowling to his teammates Faf du Plesis and Glenn Maxwell with his batting pads on during the team's net session ahead of match against SRH.","content":null,"pubDate":"2023-05-18 13:32:52","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"SRH vs RCB: आरसीबी ने हैदराबाद को पहले बैटिंग के लिए बुलाया, ऐसे है दोनों की प्लेइंग इलेवन","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/rcb-live-score-today-match-scorecard-ball-by-ball-commentary-pitch-report-hyderabad/liveblog/100333879.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-18 13:27:39","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"बल्ले का दिखेगा जोर या गेंदबाज निकाल लेंगे तोड़, पंजाब और राजस्थान के मैच में कैसी होगी धर्मशाला की पिच?","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/pbks-vs-rr-hpca-cricket-stadium-pitch-report-dharamshala-hp-weather-updates/articleshow/100332872.cms","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs RR Pitch Report: आईपीएल 2023 के अपने-अपने आखिरी लीग मैच में पंजाब किंग्स और राजस्थान रॉयल्स की टीमें आमने-सामने होंगी। इस मुकाबले में हारने वाली टीम का प्लेऑफ में पहुंचने की उम्मीद पूरी तरह खत्म हो जाएगी। हम आपको बताते हैं कि इस मैच के लिए धर्मशाला की पिच कैसी होगी।","content":"अभी तक के अपने उतार-चढ़ाव वाले प्रदर्शन के कारण अगर-मगर की कठिन डगर में फंसी पंजाब किंग्स और राजस्थान रॉयल्स की टीम शुक्रवार को आईपीएल 2023 में अपने-अपने आखिरी लीग मैच में खेलने उतरेगी। दोनों ही टीमें खुद को एक दूसरे से बेहतर साबित करके प्लेऑफ में पहुंचने की अपनी धुंधली उम्मीद बरकरार रखने की कोशिश करेंगी। इन दोनों टीम के 13 मैचों में समान 12 अंक हैं लेकिन राजस्थान की टीम बेहतर रन रेट के आधार पर पंजाब से आगे है। इन दोनों टीम को हालांकि इस मैच में जीत दर्ज करने के अलावा बाकी टीम के मैचों में भी अनुकूल परिणाम के लिए प्रार्थना करनी होगी। धर्मशाला के हिमाचल प्रदेश क्रिकेट एसोसिएशन स्टेडियम पर 2013 के बाद बुधवार को पहली बार आईपीएल का मुकाबला खेला गया था। इस मैच मे 400 से ज्यादा रन बने थे। एक बार फिर पंजाब और राजस्थान के मैच में बड़ा स्कोर देखने को मिल सकता है। हालांकि शुरुआती ओवर में तेज गेंदबाजों को मदद रह सकती है। उस समय बल्लेबाजों को सचेत रहने की जरूरत है। पावरप्ले के बाद बल्लेबाजी आसान हो जाने की उम्मीद है। पहाड़ों पर स्थित धर्मशाला में मौसम अभी पूरी तरह साफ है। शुक्रवार को अधिकतम तापमान 27 डिग्री सेल्सियस तक जाने की उम्मीद है। हालांकि मैच शाम साढ़े 7 बजे शुरू होगा और उस समय तक तापमान 20 से 22 डिग्री के आसपास ही होगा। बारिश नहीं होने की वजह से धर्मशाला को फैंस को पूरा मुकाबला देखने को मिलेगा। संजू सैमसन (कप्तान), यशस्वी जायसवाल, जोस बटलर, शिमरोन हेटमायर, जो रूट, देवदत्त पडिक्कल, ध्रुव जुरेल, रियान पराग, संदीप शर्मा, ट्रेंट बोल्ट, ओबेड मैककॉय, नवदीप सैनी, कुलदीप सेन, कुलदीप यादव, रविचंद्रन अश्विन , युजवेंद्र चहल, केसी करियप्पा, जेसन होल्डर, डोनोवन फरेरा, कुणाल राठौर, एडम ज़म्पा, केएम आसिफ, मुरुगन अश्विन, आकाश वशिष्ठ और अब्दुल पीए। शिखर धवन (कप्तान), शाहरुख खान, मैथ्यू शॉर्ट, प्रभसिमरन सिंह, भानुका राजपक्षे, जितेश शर्मा, गुरनूर सिंह बराड़, ऋषि धवन, लियाम लिविंगस्टोन, अथर्व तायडे, अर्शदीप सिंह, बलतेज सिंह, नाथन एलिस, कगिसो रबाडा, राहुल चाहर, हरप्रीत बराड़, सैम कुरेन, सिकंदर रजा, हरप्रीत भाटिया, विद्वाथ कावेरप्पा, मोहित राठी, शिवम सिंह।","pubDate":"2023-05-18 13:10:37","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Heath Streak being treated for cancer","link":"https://www.businessweekly.co.zw/heath-streak-being-treated-for-cancer/","keywords":["Sports"],"creator":["abelndooka"],"video_url":null,"description":"“He will continue to fight this disease in a similar vein to that which his opponents faced during his revered days on the cricket field,” his family says. Heath Streak, Zimbabwe’s most celebrated allrounder and a former captain, is undergoing treatment for cancer. “Heath has cancer and is undergoing treatment under one of the most […]","content":"eBusiness Weekly “He will continue to fight this disease in a similar vein to that which his opponents faced during his revered days on the cricket field,” his family says. Heath Streak, Zimbabwe’s most celebrated allrounder and a former captain, is undergoing treatment for cancer. “Heath has cancer and is undergoing treatment under one of the most respected oncologists in South Africa,” his family said in a statement. “He remains in good spirits and will continue to fight this disease in a similar vein to that which his opponents faced during his revered days on the cricket field. “The family hopes that you understand and respect their wish for this to remain a private family matter, and thank you for your prayers and good wishes. There will be no further official statements regarding his health at this time. Any news that becomes public should be regarded as rumour.” Streak, now 49, was a major figure in Zimbabwe cricket through the best part of the 1990s and early 2000s, when they enjoyed their most successful run in international cricket. He represented Zimbabwe in 65 Tests and 189 ODIs between 1993 and 2005, finishing with 1990 runs and 216 wickets in Tests, and 2943 runs and 239 wickets in ODIs. He resigned as Zimbabwe’s captain in 2004 after a clash with the board and retired from international cricket at the age of 31 in 2005. Streak is still the only Zimbabwe bowler with more than 100 Test wickets and over 200 ODI wickets. He captained Zimbabwe in the 2000s, during a difficult period when a number of players withdrew from the national side as relations between the board and team hit rock bottom. In 2021, he was banned for eight years after being charged with – and admitting to – five breaches of the ICC’s anti-corruption code, including accepting payment, in Bitcoin, from a potential corruptor. However, he later said he was not involved in any attempts to fix matches, but he admitted to disclosing inside information pertaining to international games. After his career as a player ended, Streak took up coaching roles with various teams. He served as bowling coach of Bangladesh, Kolkata Knight Riders and Somerset, in addition to having multiple stints in Zimbabwe cricket.","pubDate":"2023-05-18 22:02:59","image_url":null,"source_id":"businessweeklyzw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"'Finally Kaviya Maran Is Happy': SRH's Heinrich Klaasen's Fiery Ton vs RCB Brings The Best Out Of Twitter","link":"https://zeenews.india.com/cricket/finally-kaviya-maran-is-happy-srhs-heinrich-klaasens-fiery-ton-vs-rcb-brings-the-best-out-of-twitter-2609992.html","keywords":null,"creator":null,"video_url":null,"description":"Klaasen produced a T20 batting masterclass vs Royal Challengers Bangalore to take Sunrisers Hyderabad to 186 for 5 in 20 overs after Faf du Plessis won the toss and opted to bowl first in a must-win game.","content":null,"pubDate":"2023-05-18 16:06:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"\"We're Entering Tomorrow's Game As Season's Last One: RR Star On PBKS Game","link":"https://sports.ndtv.com/cricket/were-entering-tomorrows-game-as-seasons-last-one-rr-star-ahead-of-pbks-clash-4046085","keywords":null,"creator":null,"video_url":null,"description":"RR are better placed than Punjab Kings ahead of Friday's game but both will have to rely on other results after an up and down season.","content":"Rajasthan Royals are still mathematically alive in the race for a play-off berth but seamer Sandeep Sharma on Thursday said they will enter their final league game against Punjab Kings' thinking it's their last outing of this IPL season. Considering their superior net run rate, Rajasthan Royals are better placed than Punjab Kings ahead of Friday's game but both will have to rely on other results after an up and down season. \"This kind of game is the easiest to play in, you don't have to think much, just go out there and express yourself. As of now we are entering tomorrow's game as the season's last one and will look to end it on a positive note,\" Sandeep said on the eve of the match. \"Obviously it is a bit stressful, every team wants to qualify for the playoffs, and we found it difficult this year. But, at the same time, as a professional player we have to perform and try to win the game for our team.\" Rajasthan Royals, who looked the team to beat in the first half of IPL with four wins from their first five games, only have themselves to blame for their troubles. While Sandeep starred in the team's win against Chennai Super Kings with his two brilliant yorkers in the last over, his no-ball in the final delivery cost Rajasthan Royals the game against Sunrisers Hyderabad, as Abdul Samad hit the bowler straight over his head for a boundary to win the match for SRH. \"If you are bowling first and you are hit for 15-16 runs, then nobody even thinks about it. But you are bowling second and you have to 15-16 runs, then there is a lot more pressure on the bowler. But for a bowler it is important that he is not scared of the situation and instead accept the challenge. \"And as you can see, batters are too good these days, and boundaries are small, chasing 15-16 runs in the last over is not a big deal anymore. \"So it is important for a bowler to hold his nerves, work hard during training sessions, have faith in his ability and try to execute his plans. Some days you will win a game for your team, and some days you will lose. But it very important to keep practicing and keep trusting yourself,\" Sandeep said. Despite exemplary performances from the likes of Yashasvi Jaiswal and Yuzvendra Chahal, the star-studded outfit has flattered to deceive. Jos Buttler too has played some sensational knocks but has not been consistent enough. Having being dismissed without scoring in the previous two games, the England batter will be itching to perform in the do-or-die game on Friday. Advertisement \"I think we have played some really good cricket this season. In some games we couldn't control the crucial moments so we ended up on the wrong side. But I am pretty sure this ground (HPCA Stadium) is going to suit us a lot. \"I think we have got a few good swing bowlers... when you are bowling in such conditions you try to bowl in good areas, in good lengths, try to swing the ball till its swinging and after that you need to bowl variations. \"It is always easier to plan your bowling by watching other games. We will try to have better plans for tomorrow,\" he signed off. PTI AH AH PDS PDS","pubDate":"2023-05-18 15:06:58","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Cannes: Anil Kumble's Red Carpet Moment With Wife Chetana","link":"https://sports.ndtv.com/cricket/cannes-india-cricket-great-anil-kumbles-red-carpet-moment-with-wife-chetana-4046364","keywords":null,"creator":null,"video_url":null,"description":"Former India captain and coach Anil Kumble has been recently sharing several photos of his time in Cannes","content":null,"pubDate":"2023-05-18 15:04:33","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Suryansh Shedge Replaces Injured Jaydev Unadkat At Lucknow Super Giants","link":"https://sports.ndtv.com/cricket/suryansh-shedge-replaces-injured-jaydev-unadkat-at-lucknow-super-giants-4045730","keywords":null,"creator":null,"video_url":null,"description":"The 20-year-old was included in Mumbai's 17-member Ranji squad last season after scoring 184 runs in eight games and claiming 12 wickets in the U-25 State A Trophy.","content":null,"pubDate":"2023-05-18 14:58:36","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Injured Jaydev Unadkat Replaced By Suryansh Shedge In Lucknow Super Giants Squad Ahead Of KKR Clash","link":"https://zeenews.india.com/cricket/ipl-2023-injured-jaydev-unadkat-replaced-by-suryansh-shedge-in-lucknow-super-giants-squad-ahead-of-kkr-clash-2609926.html","keywords":null,"creator":null,"video_url":null,"description":"Jaydev Unadkat, the left arm pace option, was ruled out of IPL 2023's remaining games after falling on his shoulder in the nets. His replacement Suryansh is an uncapped Mumbai cricketer who plays as an all-rounder.","content":null,"pubDate":"2023-05-18 13:52:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"LIVE: सनराइजर्स हैदराबाद के सामने रॉयल चैलेंजर्स बैंगलोर, यहां देखें मैच का लाइव स्कोरकार्ड","link":"https://navbharattimes.indiatimes.com/sports/cricket/live-score/srh-vs-rcb/scoreboard/matchid-shbc05182023222237.cms","keywords":null,"creator":null,"video_url":null,"description":"Sunrisers Hyderabad vs Royal Challengers Bangalore","content":null,"pubDate":"2023-05-18 13:50:43","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Watch: Kohli Bowls To Du Plessis, Maxwell In Nets. This Happened Next","link":"https://sports.ndtv.com/cricket/virat-kohli-bowls-to-faf-du-plessis-glenn-maxwell-in-nets-with-batting-pads-on-this-happened-next-watch-4044793","keywords":null,"creator":null,"video_url":null,"description":"RCB player Virat Kohli was seen bowling to his teammates Faf du Plesis and Glenn Maxwell with his batting pads on during the team's net session ahead of match against SRH.","content":null,"pubDate":"2023-05-18 13:32:52","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"SRH vs RCB: आरसीबी ने हैदराबाद को पहले बैटिंग के लिए बुलाया, ऐसे है दोनों की प्लेइंग इलेवन","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/rcb-live-score-today-match-scorecard-ball-by-ball-commentary-pitch-report-hyderabad/liveblog/100333879.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-18 13:27:39","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"बल्ले का दिखेगा जोर या गेंदबाज निकाल लेंगे तोड़, पंजाब और राजस्थान के मैच में कैसी होगी धर्मशाला की पिच?","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/pbks-vs-rr-hpca-cricket-stadium-pitch-report-dharamshala-hp-weather-updates/articleshow/100332872.cms","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs RR Pitch Report: आईपीएल 2023 के अपने-अपने आखिरी लीग मैच में पंजाब किंग्स और राजस्थान रॉयल्स की टीमें आमने-सामने होंगी। इस मुकाबले में हारने वाली टीम का प्लेऑफ में पहुंचने की उम्मीद पूरी तरह खत्म हो जाएगी। हम आपको बताते हैं कि इस मैच के लिए धर्मशाला की पिच कैसी होगी।","content":"अभी तक के अपने उतार-चढ़ाव वाले प्रदर्शन के कारण अगर-मगर की कठिन डगर में फंसी पंजाब किंग्स और राजस्थान रॉयल्स की टीम शुक्रवार को आईपीएल 2023 में अपने-अपने आखिरी लीग मैच में खेलने उतरेगी। दोनों ही टीमें खुद को एक दूसरे से बेहतर साबित करके प्लेऑफ में पहुंचने की अपनी धुंधली उम्मीद बरकरार रखने की कोशिश करेंगी। इन दोनों टीम के 13 मैचों में समान 12 अंक हैं लेकिन राजस्थान की टीम बेहतर रन रेट के आधार पर पंजाब से आगे है। इन दोनों टीम को हालांकि इस मैच में जीत दर्ज करने के अलावा बाकी टीम के मैचों में भी अनुकूल परिणाम के लिए प्रार्थना करनी होगी। धर्मशाला के हिमाचल प्रदेश क्रिकेट एसोसिएशन स्टेडियम पर 2013 के बाद बुधवार को पहली बार आईपीएल का मुकाबला खेला गया था। इस मैच मे 400 से ज्यादा रन बने थे। एक बार फिर पंजाब और राजस्थान के मैच में बड़ा स्कोर देखने को मिल सकता है। हालांकि शुरुआती ओवर में तेज गेंदबाजों को मदद रह सकती है। उस समय बल्लेबाजों को सचेत रहने की जरूरत है। पावरप्ले के बाद बल्लेबाजी आसान हो जाने की उम्मीद है। पहाड़ों पर स्थित धर्मशाला में मौसम अभी पूरी तरह साफ है। शुक्रवार को अधिकतम तापमान 27 डिग्री सेल्सियस तक जाने की उम्मीद है। हालांकि मैच शाम साढ़े 7 बजे शुरू होगा और उस समय तक तापमान 20 से 22 डिग्री के आसपास ही होगा। बारिश नहीं होने की वजह से धर्मशाला को फैंस को पूरा मुकाबला देखने को मिलेगा। संजू सैमसन (कप्तान), यशस्वी जायसवाल, जोस बटलर, शिमरोन हेटमायर, जो रूट, देवदत्त पडिक्कल, ध्रुव जुरेल, रियान पराग, संदीप शर्मा, ट्रेंट बोल्ट, ओबेड मैककॉय, नवदीप सैनी, कुलदीप सेन, कुलदीप यादव, रविचंद्रन अश्विन , युजवेंद्र चहल, केसी करियप्पा, जेसन होल्डर, डोनोवन फरेरा, कुणाल राठौर, एडम ज़म्पा, केएम आसिफ, मुरुगन अश्विन, आकाश वशिष्ठ और अब्दुल पीए। शिखर धवन (कप्तान), शाहरुख खान, मैथ्यू शॉर्ट, प्रभसिमरन सिंह, भानुका राजपक्षे, जितेश शर्मा, गुरनूर सिंह बराड़, ऋषि धवन, लियाम लिविंगस्टोन, अथर्व तायडे, अर्शदीप सिंह, बलतेज सिंह, नाथन एलिस, कगिसो रबाडा, राहुल चाहर, हरप्रीत बराड़, सैम कुरेन, सिकंदर रजा, हरप्रीत भाटिया, विद्वाथ कावेरप्पा, मोहित राठी, शिवम सिंह।","pubDate":"2023-05-18 13:10:37","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}