{"newsArray":[{"title":"Legends League Cricket 2022 schedule and fixtures: Full list of Legends League Cricket fixtures","link":"https://thesportsrush.com/cricket-news-legends-league-cricket-2022-schedule-and-fixtures-full-list-of-legends-league-cricket-fixtures/","keywords":["Cricket","Legends League Cricket","Legends League Cricket schedule","Legends League Cricket squads"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Legends League Cricket 2022 schedule and fixtures: The SportsRush brings you the full schedule and squad details of the competition. The inaugural edition of the Legends Cricket League will get underway from 20 January 2022. A total of seven games will be played in the tournament across ten days. All the games will be played… The post Legends League Cricket 2022 schedule and fixtures: Full list of Legends League Cricket fixtures appeared first on The SportsRush.","content":"Legends League Cricket 2022 schedule and fixtures: The SportsRush brings you the full schedule and squad details of the competition. The inaugural edition of the Legends Cricket League will get underway from 20 January 2022. A total of seven games will be played in the tournament across ten days. All the games will be played at the Oman Cricket Academy in Oman. There will only be three teams participating in the tournament, namely India Maharajas, Asia Lions, and World Giants. India Maharajas includes players from India, whereas the Lions have all the Asian players except India. The World Giants is a team of players outside Asia. Virender Sehwag will captain the India Maharajas, whereas Harbhajan Singh and Yuvraj Singh will also play in the team. The Asia Lions and World Giants also have some legendary players in their ranks. Let’s have a look at the squads of all three teams. Squads India Maharajas: Virender Sehwag, Yuvraj Singh, Harbhajan Singh, Irfan Pathan, Yusuf Pathan, Badrinath, RP Singh, Pragyan Ojha, Naman Ojha, Manpreet Gony, Hemang Badani, Venugopal Rao, Munaf Patel, Sanjay Bangar, Nayan Mongia, and Amit Bhandari. Asia Lions: Shoaib Akhtar, Shahid Afridi, Sanath Jayasuriya, Muttiah Muralitharan, Kamran Akmal, Chaminda Vaas, Romesh Kaluwitharana, Tillakaratne Dilshan, Azhar Mahmood, Upul Tharanga, Misbah-ul-Haq, Mohammed Hafeez, Shoaib Malik, Mohammed Yousuf, and Umar Gul, Asghar Afghan. World Giants: Daren Sammy, Daniel Vettori, Brett Lee, Jonty Rhodes, Kevin Pietersen, Imran Tahir, Owais Shah, Herschelle Gibbs, Albie Morkel, Morne Morkel, Corey Anderson, Monty Panesar, Brad Haddin, Kevin O’Brien, and Brendan Taylor. T 4152 – CORRECTION : Legends League Cricket T20 , FINAL promo .. apologies .. and regrets for any inconvenience caused .. the error was inadvertent .. #legendsleaguecricket #bosslogonkagame pic.twitter.com/Zo33KqZxKU — Amitabh Bachchan (@SrBachchan) January 8, 2022 Legends League Cricket 2022 schedule 20 January 2022: India Maharajas vs Asia Lions, 8 PM IST 21 January 2022: World Giants vs Asia Lions, 8 PM IST 22 January 2022: World Giants vs India Maharajas, 8 PM IST 24 January 2022: Asia Lions vs India Maharajas, 8 PM IST 26 January 2022: India Maharajas vs World Giants, 8 PM IST 27 January 2022: Asia Lions vs World Giants, 8 PM IST 29 January 2022: Final, 8 PM IST All the games will be broadcasted live on Sony Ten 1 and Sony Ten 3. Digitally, Sony LIV will telecast all the games in India.     The post Legends League Cricket 2022 schedule and fixtures: Full list of Legends League Cricket fixtures appeared first on The SportsRush.","pubDate":"2022-01-20 00:30:14","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"The number one issue confronting the Big Bash","link":"https://www.news.com.au/sport/cricket/international-stars-needed-to-rescue-flagging-big-bash-interest-after-covid-hit-season/news-story/7fe2bacf65805deb0d40c1897c57d0e1","keywords":null,"creator":null,"video_url":null,"description":"World Cup winner Matthew Wade has urged Cricket Australia to seriously address the lack of international star power in the Big Bash to restore flagging interest in a competition hit hard by Covid.","content":null,"pubDate":"2022-01-20 00:16:00","full_description":"World Cup winner Matthew Wade has urged Cricket Australia to seriously address the lack of international star power in the Big Bash to restore flagging interest in a competition hit hard by Covid. As he prepares to lead the Hobart Hurricanes in to a final against the Adelaide Strikers being played at the MCG in a bid to mitigate Covid issues Wade said he “hopes to get some sort of crowd”. Fan fatigue has been blamed by some with a glut of recent matches moved to Melbourne having been played in relatively empty stadiums and players have regularly complained about the 56-match tournament going on too long. But Wade, who was forced to take a mid-tournament break to deal with a Covid issue said it wasn’t the length of the tournament that fazed him, but the lack of international talent. The Hurricanes have enjoyed the likes of superstar English fast bowler Jofra Archer on their playing list in recent seasons. But outside of regular visitor Rashid Khan, West Indian dynamo Andre Russell, who had a brief stint with the Stars was arguably the biggest international name in the tournament this season. Wade said the drawing power of international players was the most important issue for authorities to address. “How long the tournament goes, how many weeks, I don’t really mind too much. But I think we need to find a way to get the bets players playing in the BBL, the internationals,” he said on Thursday. “We have been short on the really big internationals over the last two or three years, whether that’s the time of the year or the length of the tournament I’m not too sure, but I think it needs to be looked at. “The BBL has been a spectacle for a long period now and the players have worked hard to get it to where it’s got to. It needs to be looked at to see how we can pull those big international players again.” Wade said it would be “a lot easier” to get up for the final showdown than it was for mid-season games when the toll of Covid and it’s flow-on effects ran rampant across all teams. “We all had out battles mentally through the middle of the tournament when Covid really hit this competition and we saw a lot of guys put in isolation and we weren’t sure about the fixture and we weren’t sure if we were close contacts there was a lot of moving parts and that hit guys different ways,” he said. “It rattled my head for a long period of time. I went home to sort through a Covid issue and looking back that was the best thing that could happen for me. That’s all behind us now and we are excited to get out there and play a final. “It would be nice to see a few people there but none the less it’s a final, one we didn’t get to play last year and we’re excited to get out there.” The Hurricanes will regain Test cult hero Scott Boland for the match and recall first-choice bowlers who missed the “embarrassing” loss to the Melbourne Stars on Wednesday night. It wasn’t just those watching at the MCG or on TV who were left gobsmacked by the best hitting the Big Bash has ever seen. Melbourne Stars captain Glenn Maxwell has shattered the record books with an “outrageous” batting performance at the MCG. Leg-spinner Cameron Boyce has made cricket history with a stunning spell of bowling for the Melbourne Renegades in the BBL.","image_url":null,"source_id":"news"},{"title":"India vs Ireland Highlights, U19 World Cup 2022: IND qualify for Super League quarterfinals with 174-run win over IRE - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMingFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbmRpYS12cy1pcmVsYW5kLWxpdmUtY3JpY2tldC1zY29yZS1pY2MtdTE5LXdvcmxkLWN1cC0yMDIyLWluZC11MTktdnMtaXJlLXUxOS1tYXRjaC1sYXRlc3QtdXBkYXRlcy0xMDE2NDI1OTI4MjUwMDYuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Ireland Highlights, U19 World Cup 2022: IND qualify for Super League quarterfinals with 174-run win over IRE  Hindustan TimesIndia Under19 vs Ireland Under19 Live: When And Where To Watch IND U19 vs IRE U19 Live In Your Country? ICC U19 World Cup 2022  Cricket AddictorHighlights, India vs Ireland, ICC U19 Cricket World ..022: India qualify for Super League phase with big win  FirstpostTrinidad Weather Update, India U-19 vs Ireland U-19, ICC U-19 World Cup: Weather Forecast for today’s IND U  News18ICC U-19 World Cup 2022, India U-19 vs Ireland U-19, Live Score And Updates  NDTVSports.comView Full coverage on Google News","content":null,"pubDate":"2022-01-19 20:11:40","image_url":null,"source_id":"google"},{"title":"'World Class' cricket stadium set to be built in Santa Clara County","link":"https://www.kron4.com/news/bay-area/world-class-cricket-stadium-set-to-be-built-in-santa-clara-county/","keywords":["Bay Area","News","Sports"],"creator":["Omar Pérez"],"video_url":null,"description":"SANTA CLARA COUNTY, Calif. (KRON) -- A world class cricket stadium is set to be built in Santa Clara County, county and Major League Cricket (MLC) announced. The County and MLC announced Wednesday the approval of an exclusive negotiating agreement (ENA) to move forward with lease negotiations and design approvals to develop an international cricket [...]","content":"SANTA CLARA COUNTY, Calif. (KRON) -- A world class cricket stadium is set to be built in Santa Clara County, county and Major League Cricket (MLC) announced. The County and MLC announced Wednesday the approval of an exclusive negotiating agreement (ENA) to move forward with lease negotiations and design approvals to develop an international cricket stadium on a 14-acre parcel of the Santa Clara County Fairgrounds. The development is part of a multi-million dollar investment by MLC for stadium construction, as they work with international architects to design a \"premier cricketing destination in North America.\" Santa Clara County receives $22 million grant to convert hotel into housing units “Cricket is a sport that’s increasing in popularity in the U.S. and Santa Clara County,” said Santa Clara County Supervisor Otto Lee. “The addition of an international cricket venue to the Santa Clara County Fairgrounds would help attract large numbers of visitors from around the world to the region. We look forward to finalizing plans with Major League Cricket to move forward with this exciting development for Santa Clara County.” Over the next 12 months, MLC and the County will work together to get the approvals required to construct a stadium with a maximum capacity of 15,000. MLC officials said the location and demographics make the Santa Clara County Fairgrounds perfectly suited for the development of a marquee home for one of America's largest cricket fanbases located in the Bay Area. “Major League Cricket’s plans for an international-grade cricket stadium in one of the country’s most vibrant and diverse metropolitan regions adds to the fantastic momentum for cricket’s growth nationwide,” said Paraag Marathe, Chair of USA Cricket Board. “The Bay Area – and Silicon Valley in particular – is an ideal location for this development that could serve as a potential venue for future major international events and as a home stadium for USA National Team matches.” The stadium is a key part of the proposed redevelopment of the 150-acre Santa Clara County Fairgrounds site and will be home to MLC’s Bay Area franchise and serve as a key hub for the U.S. National Teams. It would also be a potential host venue for major international cricket events. Wastewater in Santa Clara County indicates omicron surge declining USA Cricket is expected to bid for future men’s and women’s World Cup tournaments, with the 2024 Men’s T20 World Cup already set to be co-hosted by the United States and the West Indies. “Major League Cricket is excited by the prospect of developing an international quality cricket stadium in a location accessible to so many cricket fans in the Bay Area,” said Sameer Mehta, co-founder of Major League Cricket. “We are grateful to the County of Santa Clara for exploring how the Fairgrounds location can serve as a world class home for Major League Cricket and USA Cricket.” The new stadium plans to include state-of-the-art training facilities, locker rooms, luxury suites, dedicated parking, concessions, and an international-grade pitch to meet ICC accreditation and allow the venue to host the highest levels of international cricket competitions. By the summer of 2023, six teams are expected to begin play in major cities across the country. The plans for development in Santa Clara County follow the already-announced MLC stadium approved for construction in Grand Prairie, Texas.","pubDate":"2022-01-19 19:00:56","full_description":"SANTA CLARA COUNTY, Calif. (KRON) — A “world class” cricket stadium is set to be built in Santa Clara County, county and Major League Cricket (MLC) officials announced. The County and MLC announced Wednesday the approval of an exclusive negotiating agreement (ENA) to move forward with lease negotiations and design approvals to develop an international cricket stadium on a 14-acre parcel of the Santa Clara County Fairgrounds. The development is part of a multi-million dollar investment by MLC for stadium construction, as they work with international architects to design a “premier cricketing destination in North America.” “Cricket is a sport that’s increasing in popularity in the U.S. and Santa Clara County,” said Santa Clara County Supervisor Otto Lee. “The addition of an international cricket venue to the Santa Clara County Fairgrounds would help attract large numbers of visitors from around the world to the region. We look forward to finalizing plans with Major League Cricket to move forward with this exciting development for Santa Clara County.” Over the next 12 months, MLC and the County will work together to get the approvals required to construct a stadium with a maximum capacity of 15,000. MLC officials said the location and demographics make the Santa Clara County Fairgrounds perfectly suited for the development of a marquee home for one of America’s largest cricket fanbases located in the Bay Area. “Major League Cricket’s plans for an international-grade cricket stadium in one of the country’s most vibrant and diverse metropolitan regions adds to the fantastic momentum for cricket’s growth nationwide,” said Paraag Marathe, Chair of USA Cricket Board. “The Bay Area – and Silicon Valley in particular – is an ideal location for this development that could serve as a potential venue for future major international events and as a home stadium for USA National Team matches.” The stadium is a key part of the proposed redevelopment of the 150-acre Santa Clara County Fairgrounds site and will be home to MLC’s Bay Area franchise and serve as a key hub for the U.S. National Teams. It would also be a potential host venue for major international cricket events. USA Cricket is expected to bid for future men’s and women’s World Cup tournaments, with the 2024 Men’s T20 World Cup already set to be co-hosted by the United States and the West Indies. “Major League Cricket is excited by the prospect of developing an international quality cricket stadium in a location accessible to so many cricket fans in the Bay Area,” said Sameer Mehta, co-founder of Major League Cricket. “We are grateful to the County of Santa Clara for exploring how the Fairgrounds location can serve as a world class home for Major League Cricket and USA Cricket.” The new stadium plans to include state-of-the-art training facilities, locker rooms, luxury suites, dedicated parking, concessions, and an international-grade pitch to meet ICC accreditation and allow the venue to host the highest levels of international cricket competitions. By the summer of 2023, six teams are expected to begin play in major cities across the country. The plans for development in Santa Clara County follow the already-announced MLC stadium approved for construction in Grand Prairie, Texas.","image_url":"https://www.kron4.com/wp-content/uploads/sites/11/2022/01/SCC-Fairgrounds1-e1642619027934.jpg?w=900","source_id":"kron4"},{"title":"Cricket-Maxwell hits 154 off 64 balls as Stars post record T20 score","link":"https://www.thestar.com.my/sport/cricket/2022/01/20/cricket-maxwell-hits-154-off-64-balls-as-stars-post-record-t20-score","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Australia all-rounder Glenn Maxwell smashed an unbeaten 154 from 64 balls to post the highest invidual score in Big Bash League (BBL) history and lead the Melbourne Stars to a record Twenty20 total on Wednesday. Read full story","content":null,"pubDate":"2022-01-19 18:50:00","full_description":"(Reuters) - Australia all-rounder Glenn Maxwell smashed an unbeaten 154 from 64 balls to post the highest invidual score in Big Bash League (BBL) history and lead the Melbourne Stars to a record Twenty20 total on Wednesday. Maxwell, 33, brought a dead rubber to life by hitting 22 fours and four sixes at the Melbourne Cricket Ground. Marcus Stoinis chipped in with an unbeaten 75 as the Stars posted a total of 273-2 -- the highest by a T20 franchise team and the third largest of all time in the shortest format of the game. \"It was certainly a lot of fun. It helps you can play with ultimate freedom knowing the season is done for your team so you can pin your ears back and have a real crack,\" Maxwell said. \"I was glad Stoinis came in and started clearing the ropes. It gave me time to chill out at the other end.\" The Stars failed to qualify for the playoffs and Wednesday's game was the final fixture of the regular season. (Reporting by Rohith Nair in Bengaluru, editing by Ed Osmond)","image_url":null,"source_id":"thestar_my"},{"title":"“Most other batsmen would take that”: Ricky Ponting defends Smith Smith despite ordinary returns with the bat during Ashes 2021-22","link":"https://thesportsrush.com/cricket-news-most-other-batsmen-would-take-that-ricky-ponting-defends-smith-smith-despite-ordinary-returns-with-the-bat-during-ashes-2021-22/","keywords":["Cricket","Ashes","Ricky Ponting","Steve Smith"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ricky Ponting defends Smith Smith after latter had a pretty ordinary outing with the bat during the whole of Ashes 2021-22. Winning the 2021 T20 World Cup in Dubai, and then following it up with a 4-0 Ashes series victory, the Australia’s men’s Cricket management could have not asked for a better performance from it… The post “Most other batsmen would take that”: Ricky Ponting defends Smith Smith despite ordinary returns with the bat during Ashes 2021-22 appeared first on The SportsRush.","content":"Ricky Ponting defends Smith Smith after latter had a pretty ordinary outing with the bat during the whole of Ashes 2021-22. Winning the 2021 T20 World Cup in Dubai, and then following it up with a 4-0 Ashes series victory, the Australia’s men’s Cricket management could have not asked for a better performance from it players across formats. Mentioning specifically regarding their batters’ returns this Ashes series, Travis Head, Marnus Labuschane, and Usman Khawaja had outstanding returns with the bat, while Cameron Green emerged as the breakthrough performer with both the bat and the ball. However, Australia’s arguably the best batter in the entire order- Steve Smith, had a pretty ordinary outing as per his standards, as the right-hander could manage to hit only a couple of half-centuries across the 8 innings he played for his side. He scored a total of 244 runs (5 matches, 8 innings) at an average of 30.50, sans a century to boast of. In fact, this is Smith’s first Ashes series since 2013, where he hasn’t scored past 100 in a single innings. Moreover, it is the first time since 2017, that Smith’s average (59.87 presently) has fallen below 60 in the Test format. Despite, all the series numbers, Steve Smith still finished as the 6th highest run scorer in the recently concluded Ashes series. Just the two fifties for Steve Smith in the Ashes… and his career average has fallen below 60 for the first time in over four years pic.twitter.com/gFuOPeKRfG — ESPNcricinfo (@ESPNcricinfo) January 17, 2022 Ricky Ponting defends Smith Smith Australia’s legendary skipper Ricky Ponting, holds Smith in high regards despite coming up with an ordinary performance as per his standards. “The standards that he’d set himself for so long, for that three- or four-year period where he took batting to another level, to try and maintain that for four or five or six years – no-one’s ever done it, and no-one will probably ever do it,” Ponting told cricket.com.au. “You’re going to have your ups and downs and if he’s averaging (in the thirties) in Australia on the back of a couple of lean years, most other batsmen would take that,” Ponting further added. Ponting further remarked that given the standards that Smith has set for himself, he would certainly review his performances, and it would not take him long to bounce back and hit the purple patch. “There’s lots of things that we can probably think about and ask questions about, but it’s not going to be long (before Smith bounces back). “I know what he’s like and he will look back at this – even though Australia has won the series … he’ll look back at his own game and break it down and ask himself those questions as to why things haven’t worked out as much as he would have liked. “He will come up with the right answers because the best players are the best problem solvers, and if he has got a problem … then he’ll work it out pretty quickly,” Ponting exclaimed.   The post “Most other batsmen would take that”: Ricky Ponting defends Smith Smith despite ordinary returns with the bat during Ashes 2021-22 appeared first on The SportsRush.","pubDate":"2022-01-19 18:46:02","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Stars crush Hurricanes as Maxwell makes history | BBL|11 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9VGxad0NWQ3VTRUXSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Stars crush Hurricanes as Maxwell makes history | BBL|11  cricket.com.auGlenn Maxwell smashes BBL record score against Hobart as Stars launch all-out assault  ABC NewsMaxi goes absolutely berserk, makes history  NEWS.com.auTo the Max: The numbers behind Glenn Maxwell’s ton for the ages  Sydney Morning HeraldView Full coverage on Google News","content":null,"pubDate":"2022-01-19 18:00:25","image_url":null,"source_id":"google"},{"title":"Cricket-Bavuma, Van der Dussen tons help S Africa beat India in first ODI","link":"https://www.thestar.com.my/sport/cricket/2022/01/20/cricket-bavuma-van-der-dussen-tons-help-s-africa-beat-india-in-first-odi","keywords":null,"creator":null,"video_url":null,"description":"PAARL, South Africa (Reuters) - Captain Temba Bavuma and Rassie van der Dussen scored centuries and shared a partnership of 204 as hosts South Africa beat India by 31 runs in the first one-day international on Wednesday. Read full story","content":null,"pubDate":"2022-01-19 16:53:00","full_description":"PAARL, South Africa (Reuters) -Captain Temba Bavuma and Rassie van der Dussen scored centuries and shared a partnership of 204 as hosts South Africa beat India by 31 runs in the first one-day international on Wednesday. The home side elected to bat and posted 296 for four in their 50 overs, with Bavuma’s 110 from 143 balls the anchor to go with an unbeaten 129 not out off 96 from Van der Dussen, who scored his maiden ODI ton. India started well as opener Shikhar Dhawan scored 79 from 84 balls and former captain Virat Kohli 51 from 63, but when they were dismissed the touring side struggled to keep up with the required run-rate and finished on 265 for eight. Shardul Thakur provided resistance with an unbeaten 50 from 43 balls, but many of the Indian batsmen struggled for fluency on the slow wicket. Andile Phehlukwayo (2-26) was the pick of the home attack and claimed the key wicket of Rishabh Pant (16), but Tabraiz Shamsi (2-52) and Lungi Ngidi (2-64) also played their part. \"It was a nice game actually. There was so much to learn,\" new India captain KL Rahul said at the post-match presentation. \"We started off well but couldn’t get wickets in the middle (of the South African innings). \"And then when we batted, our middle order couldn’t get going. I thought we would chase it down quite easily but the South Africans came back well.\" The home side's innings was shaped by Bavuma, who was patient from the start after they were in trouble at 68-3 in the 18th over. His stunning partnership of 204 from 183 balls with Van der Dussen, who was the aggressor with nine fours and four sixes, laid the platform for their above-par score. They were particularly impressive in negating the Indian spinners, with seamer Jasprit Bumrah (2-48) the pick of the tourists’ attack. \"We played close to the perfect game. We can take a lot of confidence from what we did out there,\" Bavuma said. \"The partnership (with Van der Dussen) was probably the decider.\" The second match in the series will be played at the same venue on Friday, with the third and final one in Cape Town on Sunday. The results do not count towards the Cricket World Cup Super League. (Reporting by Nick Said, editing by Ed Osmond)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/20/1450664.jpg","source_id":"thestar_my"},{"title":"Sehwag, Yuvraj, Harbhajan set for reunion in Legends League Cricket","link":"https://sportstar.thehindu.com/cricket/virender-sehwag-yuvraj-singh-harbhajan-legends-league-cricket-2022-muscat-shahid-afridi-shoaib-akhtar/article38293568.ece","keywords":null,"creator":["P.K. Ajith Kumar"],"video_url":null,"description":"Over the next few days at the Al Amerat Cricket Stadium in Muscat, the clock will turn several times over in the inaugural edition of the Legends League Cricket.","content":null,"pubDate":"2022-01-19 16:32:04","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"South Africa vs India: South Africa vs India 2021/22 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-1st-odi-odi-46-50-updates-2718050","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Boland Park, Paarl. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-19 16:13:53","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 50.0 overs, India, chasing a target of 297, are 265/8. The live updates of South Africa vs India scorecard is also available. It is the perfect platform to follow your favourite teams in South Africa vs India 2021/22. Keep a track on your favourite batsmen and bowlers through South Africa vs India 2021/22 today match, ball by ball commentary, South Africa vs India, South Africa vs India live score, South Africa vs India scorecard. Follow the excitement of the South Africa vs India 2021/22 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Stay tuned for presentation... Earlier in the day, after electing to bat, South Africa were in trouble as they were three down in for less than 100. Then came the 200-run stand between Rassie van der Dussen and Temba Bavuma with both scoring runs and that powered the hosts close to 300. India began well, for the first part of the second essay, it seemed India would take the lead in this series but in the end, it is the home side who head into the second ODI with the advantage. For South Africa, they did not bowl that well in the first half of this innings! There were far too many boundary balls, they struggled to build pressure on the Indian batters and also bowled quite a few extras. Not their fault too, the ball seemed to be coming on very nicely. Once the ball got old and soft though, it started to grip and then the likes of Shamsi and Maharaj came into their own. Ngidi was also very handful with his cutters and Andile Phehlukwayo also did his job. A really good effort from them after being put under pressure. A very convincing win in the end for South Africa! Never did we feel though it would be that convincing. The top three really played well to get India into a fine position. Especially Kohli and Dhawan. The two added just over 90 and scored half tons each. However, the two fell in quick succession and then it all went down the hill for India. The likes of Pant and the two Iyers failed to contribute a lot. It then became an uphill task and they fell short by some margin. 49.6 overs (1 Run) FIFTY for Thakur but he ends up on the losing side. Something to cheer about for India at the end of the game. Full length, outside off. Thakur lofts it over covers for a single. Bumrah walks across and hugs Thakur. SOUTH AFRICA WIN THE GAME BY 31 RUNS. 49.5 overs (1 Run) Fuller, wide outside off. Bumrah taps it to point for a single. 49.4 overs (1 Run) Full and outside off. Thakur hits it down the ground for a single. 49.3 overs (1 Run) Full and wide outside off. Bumrah steers it to third man for one. 49.3 overs (1 Run) WIDE! Full and wide outside off. Bumrah looks to reach out but fails to get any bat on it. Although, it is outside the tramline and the umpire signals it as a wide. The bowler has to reload. 49.2 overs (0 Run) Full and wide outside off. Bumrah looks to chase it but misses. 49.1 overs (1 Run) Fuller, wide outside off. Thakur drives it through cover for one. 48.6 overs (0 Run) A dot to end the over. A brilliant penultimate over by Tabraiz Shamsi. Full and on off. Bumrah defends it out. Shamsi kept things quiet and gave away only 5 runs. 48.5 overs (1 Run) Full and on leg. Thakur gets low and sweeps it to mid-wicket for a run. 48.4 overs (1 Run) Full and on middle. Bumrah works it to deep square leg and gets a single. 48.3 overs (1 Run) Angled down leg. Thakur swivels and pulls it to fine leg for a run. 48.2 overs (1 Run) Tossed up, full and outside off. Bumrah sweeps it through mid-wicket for a single. 48.1 overs (1 Run) Googly, on middle, Thakur gets it to the leg side off the inside edge. They take a single. 47.6 overs (1 Run) Full and outside off. Thakur slaps it through covers for a single. 47.5 overs (6 Runs) SIX! BANG! Three boundaries in a row and this is much better. Full length, on off. Thakur stays back and smokes it over the square leg fence for a biggie. 47.4 overs (4 Runs) FOUR! Back-to-back boundaries. This time he gets lucky though. Full and outside off. Thakur gets it off the outside edge and bags a boundary at third man. 47.3 overs (4 Runs) FOUR! Nicely played! Full length, wide outside off. Thakur reaches out and crunches it through covers for a boundary. 47.2 overs (1 Run) Full and outside off. Bumrah reaches out and lofts it towards long off for a run. 47.1 overs (1 Run) Good length, on off. Thakur hangs back and pulls it to deep square leg for a single. 46.6 overs (1 Run) Outside off. Thakur drives it down the ground to long off for a single. 46.5 overs (2 Runs) Full and on off. Thakur sweeps it to deep square leg for a couple. 46.4 overs (0 Run) On off, defended out. 46.3 overs (1 Run) Flighted, full and on leg. Bumrah tucks it to mid-wicket. Thakur wanted a single but Bumrah was not convinced, he started his run up late. The fielder misses his shy at the non-striker's end but misses, which gives Bumrah time to get back. The throw comes in again and connects this time but it was a little to late. The replays confirm that Bumrah was in. 46.2 overs (2 Runs) TWO BYES! Full and outside off. Bumrah throws his bat at it but misses. The ball goes through the legs of Quinton de Kock. They collect two byes. 46.1 overs (1 Run) Full and on leg. Thakur slogs it away to deep square leg for a run. 45.6 overs (0 Run) On off, Bumrah strokes it towards deep cover. 45.5 overs (1 Run) Fuller and on middle, this is hit down to long on for one. 45.4 overs (0 Run) Fuller and on off, this is hit hard but to mid off. 45.3 overs (1 Run) Angled into the pads, this is nudged on the leg side for one. 45.2 overs (0 Run) On off, this is pushed to covers. 45.1 overs (4 Runs) TOP EDGE AND FOUR! India need a lot more! Shorter and on the body, this is pulled, it goes over short fine leg for a boundary.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637782254218041559.png","source_id":"ndtv"},{"title":"Legends Cricket League All Teams Squads and Player list","link":"https://thesportsrush.com/cricket-news-legends-cricket-league-all-teams-squads-and-player-list/","keywords":["Cricket","Legends Cricket League"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Legends Cricket League All Teams Squads and Player list: The SportsRush presents the squads of all three teams partaking in the league. The cricketing fraternity will be witness to a sumptuous visual treat as former star players from across continents would gather together for a whole new T20 competition. The Legends Cricket League will commence… The post Legends Cricket League All Teams Squads and Player list appeared first on The SportsRush.","content":"Legends Cricket League All Teams Squads and Player list: The SportsRush presents the squads of all three teams partaking in the league. The cricketing fraternity will be witness to a sumptuous visual treat as former star players from across continents would gather together for a whole new T20 competition. The Legends Cricket League will commence from Thursday, January 20, at the Al Amerat Cricket Ground in Oman. The tournament will be played across 10 days, which will see three teams – India Maharajas, Asia Lions and the World Giants battle it out for the silverware. The first match of the tournament will see the India Maharajas take on the Asia Lions. Each team will face the other two twice, with the final to take place on January 29 (Saturday). Former India opener Virender Sehwag as been appointed as the captain of the ‘India Maharajas’. The teams will be completed by the likes of other former greats of Indian Cricket which include Yuvraj Singh, Harbhajan Singh, Irfan Pathan, RP Singh, Pragyan Ojha et al. The ‘Asia Lions’ will constitute former stars from Pakistan, Sri Lanka and Afghanistan namely Shahid Afridi, Shoaib Akhtar, Sanath Jayasuriya, Muttaih Muralidharan, Shoaib Malik, Asghar Afghan and others. The ‘World Giants’- as the name suggests, will comprise former giants of game like Kevin Pietersen, Brett Lee, Daniel Vettori, Imran Tahir, Morne Morkel, Brad Haddin etc. 1 day to go for some high-voltage action at Oman Cricket Stadium. What will mark the territory? The kings’ seal or the lions’ paws? Find out in Howzat Legends League Cricket starting tomorrow on the @SonySportsNetwk #GameOfGOATs #LegendsLeagueCricket#LLCT20 #T20Cricket pic.twitter.com/VvxGkyCW7h — Legends League Cricket (@llct20) January 19, 2022 Legends Cricket League All Teams Squads and Player list India Maharaja team squad 2022 Virender Sehwag (c), Yuvraj Singh, Harbhajan Singh, Irfan Pathan, Yusuf Pathan, Badrinath, RP Singh, Pragyan Ojha, Naman Ojha, Manpreet Gony, Hemang Badani, Venugopal Rao, Munaf Patel, Sanjay Bangar, Nayan Mongia, and Amit Bhandari. Asia Lions Shoaib Akhtar, Shahid Afridi, Sanath Jayasuriya, Muttiah Muralitharan, Kamran Akmal, Chaminda Vaas, Romesh Kaluwitharana, Tillakaratne Dilshan, Azhar Mahmood, Upul Tharanga, Misbah-ul-Haq, Mohammed Hafeez, Shoaib Malik, Mohammed Yousuf, and Umar Gul, Asghar Afghan. World Giants Daren Sammy, Daniel Vettori, Brett Lee, Jonty Rhodes, Kevin Pietersen, Imran Tahir, Owais Shah, Herschelle Gibbs, Albie Morkel, Morne Morkel, Corey Anderson, Monty Panesar, Brad Haddin, Kevin O’Brien, and Brendan Taylor. The post Legends Cricket League All Teams Squads and Player list appeared first on The SportsRush.","pubDate":"2022-01-19 16:10:31","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"South Africa vs India Live Score Ball by Ball, South Africa vs India 2021/22 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-1st-odi-odi-41-45-updates-2717998","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Boland Park, Paarl. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-19 15:51:59","full_description":"Follow the South Africa vs India 2021/22 live cricket score on Sports.NDTV.com . After 45.2 overs, India, chasing a target of 297, are 228/8. Get live score, ball by ball commentary and much more. Keep track of South Africa vs India 2021/22 today match between South Africa and India. Everything related to South Africa and India match will be available on Sports.NDTV.com . Stay updated with South Africa vs India live score. Do check for South Africa vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 44.6 overs (2 Runs) Shorter and down the leg side, Thakur pulls it fine, two taken. 44.5 overs (0 Run) Tossed up on middle, Thakur swings, it goes off the inner half towards mid-wicket. 44.4 overs (2 Runs) On the pads, this is swept fine on the leg side for two. 44.3 overs (1 Run) On middle, this is pushed down to long on for one. 44.2 overs (0 Run) Slower through the air, on the pads, Bumrah looks to sweep but misses. 44.1 overs (1 Run) On middle, this is played down to long on for one. 43.6 overs (0 Run) Bumrah plays the over out! On middle, he defends. 43.5 overs (2 Runs) Two more! Fuller and on middle, this is pushed wide of mid on, Ngidi dives and stops it. Two taken. 43.4 overs (0 Run) Swing and a miss! Shorter and outside off, Bumrah looks to go big on the leg side but misses it completely. 43.3 overs (0 Run) On middle, Bumrah plays it back to the bowler. 43.3 overs (1 Run) WIDE! Well wide outside off, Bumrah looks to guide it down to third man but misses. 43.2 overs (1 Run) Shorter and on middle, Thakur pulls it through square leg for one. 43.1 overs (0 Run) On middle, defended. 42.6 overs (0 Run) Yet another dot! On middle, kept out. 42.5 overs (0 Run) Flatter and on off, Bumrah defends. 42.4 overs (0 Run) Outside off, it is left alone. 42.3 overs (0 Run) On middle, Bumrah plays it to mid-wicket. Jasprit Bumrah is the new man in. 42.2 overs (0 Run) OUT! Straight to the man! This time no mistake was commited. Bavuma is the catcher and Shamsi gets another one. On middle, this is flicked uppishly but straight into the hands of Bavuma. Soft dismissal. 42.1 overs (0 Run) On the pds, Kumar looks to flick but misses to get hit on the pads. 41.6 overs (0 Run) Fuller and on off, this is driven square to point. 41.5 overs (1 Run) Angled into the pads, this is worked towards mid-wicket for one. 41.4 overs (0 Run) PUT DOWN! That is a dolly! Can't believe Miller has spilled that! He is such a safe fielder! A slower one, Kumar chips it towards him at cover but he spills it. 41.3 overs (1 Run) Fuller and on middle, this is eased down to long on for one. 41.2 overs (0 Run) Short and on middle, that gets big on the batter. Thakur looks to nudge it on the leg side but it goes off a soft leading edge back to the bowler. 41.1 overs (1 Run) Good length and on off, this is played to point for one. 40.6 overs (0 Run) Swing and a miss! A full-length ball, outside off. Thakur looks to chase it but misses. 40.5 overs (0 Run) Angled into the pads, blocked to the leg side. 40.4 overs (4 Runs) FOUR! Second boundary of the over. This is beautifully played. Overpitched. outside off. Thakur creams it through covers for a boundary. 40.3 overs (0 Run) Length and on middle. Thakur pushes it to mid on off the inner half. 40.2 overs (0 Run) Full and on off. Thakur pushes it to mid off. 40.1 overs (4 Runs) FOUR! Nicely played. Full, drifting down leg. Thakur glances it down to fine leg for a boundary.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637782241080325136.png","source_id":"ndtv"},{"title":"South Africa vs India Live Score Ball by Ball, South Africa vs India 2021/22 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-1st-odi-odi-36-40-updates-2717941","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Boland Park, Paarl. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-19 15:33:56","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 40.1 overs, India, chasing a target of 297, are 207/7. The live updates of South Africa vs India scorecard is also available. It is the perfect platform to follow your favourite teams in South Africa vs India 2021/22. Keep a track on your favourite batsmen and bowlers through South Africa vs India 2021/22 today match, ball by ball commentary, South Africa vs India, South Africa vs India live score, South Africa vs India scorecard. Follow the excitement of the South Africa vs India 2021/22 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 39.6 overs (0 Run) Two dots to end the over! A brilliant over by Lungi Ngidi, just three runs off it. Full and outside off. Kumar taps it to point. 39.5 overs (0 Run) Off-pace, full-length delivery, outside off. Kumar defends it out watchfully. 39.4 overs (1 Run) Short and outside off. Thakur cuts it through point for a single. 39.3 overs (0 Run) BEATEN! Full-length ball, outside off. Thakur reaches out but fails to get any blade on it. 39.2 overs (0 Run) Fuller, on off. Thakur pushes it back to the bowler with soft hands. 39.1 overs (1 Run) Full length, outside off. Kumar drives it to cover and gets a single. 39.1 overs (1 Run) WIDE! Full and outside the tramline. Kumar leaves it alone. Wide called. 38.6 overs (1 Run) 200 up for India. Short and outside off. Kumar cuts it through point for a run. 38.5 overs (0 Run) Fuller, outside off. Kumar pushes it to cover. Not in the gap. 38.4 overs (0 Run) Full, on middle and leg. Kumar strides forward and works it towards mid on. Bhuvneshwar Kumar comes in at number 9. 38.3 overs (0 Run) OUT! DRAGGED ON! Brilliant from Andile Phehlukwayo, he gets his second wicket of the game. Into the tail-enders now, South Africa are in a hurry to end things here. A full-length ball, on off, it stays low after hitting the deck. Ashwin makes room and looks to push it to the off side but gets an inside edge and sees the ball shatter the stumps behind. 38.2 overs (1 Run) On the pads, flicked to mid-wicket for a single. 38.1 overs (1 Run) Fuller, outside off. Ashwin slashes it to deep point for just a single. 37.6 overs (0 Run) A dot to end the over! Good length, outside off. Thakur steers it towards backward point. India need 100 runs off 72 balls. 37.5 overs (1 Run) Good length, on the fourth stump line. Ashwin guides it down to third man for a single. 37.4 overs (0 Run) Full and outside off. Ashwin drives it to cover. 37.3 overs (0 Run) Full length, outside off. Ashwin plays it square on the off side. 37.2 overs (1 Run) Full and wide outside off. Thakur throws his bat at it. The ball takes the inside edge and goes to the left of the keeper. Ashwin calls for a single and Thakur gets to the other end safely. 37.1 overs (4 Runs) FOUR! Nicely played. Length ball, drifting down leg. Thakur glances it to fine leg for a boundary. 37.1 overs (1 Run) WIDE! Length, wide outside off. Thakur looks to chase it but misses. Wide called. 36.6 overs (0 Run) Good length, outside off. Ashwin punches it to cover. At the same time, South Africa were at 190 as well but had 7 wickets in hand. India need a solid stand to make it a close contest yet again. 36.5 overs (1 Run) Fuller and outside off. Thakur drives it to deep cover for just one. 36.4 overs (0 Run) Good length, on off. Thakur works it to mid-wicket off the inner half. 36.3 overs (0 Run) Full and outside off. Thakur presses forward and defends it to the off side. 36.2 overs (1 Run) Full, on the pads, Ashwin clips it to mid-wicket for a single. 36.1 overs (0 Run) A full-length ball, on off. Ashwin pushes it to mid on. 35.6 overs (0 Run) Length ball, on off. Thakur defends it to cover. Shardul Thakur is the new man in. 35.5 overs (0 Run) OUT! CAUGHT! Venkatesh Iyer tries to break the shackles but holes out instead. A short ball, on off. Iyer stays inside the crease and hooks it towards deep square leg. He does not get the desired distance on it. Rassie van der Dussen takes a sharp catch in the deep. Lungi Ngidi gets his second wicket of the game. South Africa well on top here. 35.4 overs (1 Run) Length ball, outside off. Ashwin taps it to backward point and scampers through for a quick single. Also, Lungi Ngidi gets a warning for landing in the danger zone after his run up. 35.3 overs (1 Run) Full length, outside off. Iyer drives it to cover for a single. 35.2 overs (0 Run) Back of a length, on top of off. Iyer stays back and defends it to point. 35.1 overs (1 Run) Short ball, outside off. Ashwin cuts it to the left of backward point. The fielder there dives to his left to make a half stop. The batters take a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637782230195457392.png","source_id":"ndtv"},{"title":"South Africa vs India: South Africa vs India 2021/22 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-1st-odi-odi-31-35-updates-2717859","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Boland Park, Paarl. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-19 15:03:56","full_description":"Follow the South Africa vs India 2021/22 live cricket score on Sports.NDTV.com . After 34.0 overs, India, chasing a target of 297, are 182/5. Get live score, ball by ball commentary and much more. Keep track of South Africa vs India 2021/22 today match between South Africa and India. Everything related to South Africa and India match will be available on Sports.NDTV.com . Stay updated with South Africa vs India live score. Do check for South Africa vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 34.1 overs (1 Run) OUT! st Quinton de Kock b Andile Phehlukwayo. Is that a fair stumping? 33.6 overs (0 Run) Short and outside off, Iyer lets it go through to the keeper. No carry at all there. This pitch just seems like getting tougher. 116 needed in 96. DRINKS! With this wicket of Shreyas Iyer, South Africa are well on top here. They would look to keep chipping away wickets and take the game away from the visitors. India on the other hand, need Pant to stick in the middle for long. Venkatesh Iyer joins him in the middle who is making his debut. He had a dream Indian Premier League debut in 2021 and would look to have a similar impact for his country now. 33.5 overs (0 Run) OUT! GLOVED AND TAKEN! Iyer walks back and South Africa now have control over this game. Shreyas was looking at so much ease but now falls! A short one down the leg side, Iyer looks to pull, once again this sticks in the surface. It goes off the glove as Iyer is through his shot. De Kock takes it. An appeal and the finger is raised. Now South Africa are into the all-rounders. India still 116 runs away. 33.4 overs (1 Run) That has been hammered but only for one! Shorter and on middle, Pant pulls it through square leg for one. 33.3 overs (1 Run) On a good length and on off, Iyer guides it down to third man and takes one. Good sensible batting. 33.2 overs (1 Run) On the pads, Pant works it down to fine leg for one. 33.1 overs (1 Run) Slower one, this is guided down to third man for one. Lungi Ngidi comes back into the attack now. 32.6 overs (1 Run) Shorter and on middle, Iyer looks to pull, it goes off the inner half through square leg for a single. An expensive start then from Andile. 32.5 overs (2 Runs) More runs! Two of them! Outside off, this is carved through point. Two taken. 32.4 overs (4 Runs) FOUR! This time he pays the price for bowling a little too straight, on the pads, this is worked behind square on the leg side for a boundary. 32.3 overs (0 Run) Andile Phehlukwayo gets away with one there! On the pads, this is flicked but straight to short fine leg. Iyer sets off but is sent back. 32.2 overs (1 Run) Pant has probably decided to go after Andile! This is full and outside off, Pant swings hard, it goes off the inner half on the leg side for one. 32.1 overs (1 Run) Misfield! Very unlike South Africa today! On middle, this is pushed to mid-wicket. The fielder fumbles and a single is taken. 31.6 overs (1 Run) Iyer wanted two but only one! Fuller and outside off, this is driven nicely through covers for one. 31.5 overs (1 Run) Shorter and on middle, Pant pulls it hard through square leg for one. 31.4 overs (0 Run) Full and wide outside off, Pant throws the kitchen sink at it but misses. 31.3 overs (1 Run) Short and on middle, Iyer pulls it down to fine leg for one. 31.2 overs (1 Run) On middle, Pant works it through mid-wicket for one. 31.1 overs (4 Runs) FOUR! There comes the shot which releases a little pressure! Fuller and on middle, easy pickings, it is driven hard down the ground for a boundary. 30.6 overs (1 Run) Brilliant fielding again! Saves three. On the pads, Pant sweeps it hard, Ngidi at short fine leg dives to his left and gets a hand to it. jansen covers up, just the one. 30.5 overs (0 Run) PUT DOWN! Tough chance but you expect Bavuma to take that. He is exceptional. That would have put South Africa in control quite easily. This is tossed up on off, Pant smacks it hard but uppishly towards cover. Bavume dives to his left and gets two hands to it but does not hang on. 30.4 overs (1 Run) This time finds the gap in the square leg region and takes one. 30.3 overs (0 Run) South Africa have their tails up now! On middle, Iyer flicks, the fielder at square leg, moves quickly to his left and saves a run for his side. 30.2 overs (1 Run) That is outstanding fielding! On middle, Pant sweeps it through square leg. Jansen in the deep, runs to his left, slides and keeps it to one. 30.1 overs (1 Run) Outside off, Iyer slaps it through covers for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637782212273453876.png","source_id":"ndtv"},{"title":"Virat Kohli Slams 51 In His First Match As Former India Captain","link":"https://sports.ndtv.com/cricket/india-vs-south-africa-1st-odi-virat-kohli-slams-51-in-his-first-match-as-former-india-captain-2717879","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli scored a half-century on Wednesday in his first match as former captain of the Indian cricket team.","content":null,"pubDate":"2022-01-19 15:02:24","full_description":"Virat Kohli scored a half-century on Wednesday in his first match as former captain of the Indian cricket team. Kohli, who announced his resignation as Test captain at the end of the three-match Test series against South Africa earlier this month, entered the crease as the No. 3 batter in India's chase of 297 runs in the opening ODI against the Proteas in Paarl on Wednesday. Kohli faced 63 balls and scored 51 runs in a knock that included three fours before being dismissed by Tabraiz Shamsi. Kohli, who stepped down as T20I captain after the T20 World Cup last year before being removed as ODI captain, tried to sweep a Shamsi delivery but failed to connect properly and was caught by South Africa captain Temba Bavuma at midwicket. Earlier in the day, Bavuma and Rassie van der Dussen struck contrasting hundreds en route to their 204-run stand to take South Africa to 296 for four. After a sluggish start, van der Dussen (129 not out off 96) and Bavuma (110 off 143) shared the second highest partnership ever against India in ODIs to ensure a competitive total for the home team. Jasprit Bumrah (2/48) was the stand out bowler for India in an otherwise ordinary bowling effort. South Africa opted to bat on a slow surface at Boland Park. The white ball did a bit early on with both Bumrah and Bhuvneshwar Kumar getting to move it off the pitch as well as in the air. After an inaccurate first over, the usually accurate Bumrah got his act together and had opener Janneman Malan (6) caught behind with an outswinger. Expecting an incoming ball, Malan was caught on the crease with his loose push taking the outside edge. South Africa struggled to 39 for one in 10 overs with Indian bowlers restricting the flow of runs. Quinton de Kock (27 off 41), playing his first game since announcing his Test retirement, and Bavuma found the going tough with ball not coming on to the bat. De Kock perished while trying to break the shackles. Ashwin, featuring in his first ODI since June 2017, found de Kock's stumps with a slider as the opener went for a cut shot. It became 68 for three in the 18th over when Aiden Markram got run out from a direct hit by Venkatesh Iyer after he went for a single that was not for the taking. At that stage, it seemed South Africa would find it tough to get past 200 but a fighting stand between Dussen and Bavuma changed the course of the innings. Promoted (With PTI inputs)","image_url":"https://c.ndtvimg.com/2022-01/ajnhhn18_virat-kohli-afp_625x300_19_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Cricket NFT platform Rario announces partnership with star studded Legends League Cricket","link":"https://www.prnewswire.com:443/news-releases/cricket-nft-platform-rario-announces-partnership-with-star-studded-legends-league-cricket-301463595.html","keywords":["Blockchain","Computer & Electronics","General Sports","Cryptocurrency","SPT","BLN","CPR","ICO"],"creator":null,"video_url":null,"description":"~ Basis this partnership, Rario will create NFTs from cricketing moments of over 50 legends ~ NEW DELHI, Jan. 19, 2022 /PRNewswire/ -- Officially Licensed Cricket NFT platform Rario today announced an exclusive partnership with the upcoming inaugural season of the much anticipated Legends...","content":null,"pubDate":"2022-01-19 15:00:00","full_description":null,"image_url":"https://mma.prnewswire.com/media/1655844/Rario_Logo.jpg?p=publish","source_id":"cision"},{"title":"South Africa vs India: South Africa vs India 2021/22 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-1st-odi-odi-26-30-updates-2717803","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Boland Park, Paarl. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-19 14:43:55","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 29.0 overs, India, chasing a target of 297, are 153/3. The live updates of South Africa vs India scorecard is also available. It is the perfect platform to follow your favourite teams in South Africa vs India 2021/22. Keep a track on your favourite batsmen and bowlers through South Africa vs India 2021/22 today match, ball by ball commentary, South Africa vs India, South Africa vs India live score, South Africa vs India scorecard. Follow the excitement of the South Africa vs India 2021/22 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 28.6 overs (0 Run) No run. 28.5 overs (0 Run) No run. 28.4 overs (0 Run) Pant is disappointed but the sweeps are just not hitting the middle at the moment. This one too holds in the surface. Pant is early in the sweep, he mistimes it to backward square leg. 28.3 overs (1 Run) Not the best of deliveries to the new batter! Short and on the pads, this is worked through square leg for one. Shreyas Iyer is the new man in. 28.2 overs (0 Run) OUT! Top edge and taken! There is the wicket South Africa needed, the big fish, Virat Kohli, once again fails to covert his start into a big one and have to say, the hosts on top now. Also, the wicket has started to play tricks quite a lot now. This is tossed up, slower and on middle, Kohli who is not a natural sweeper, goes for it, the ball though sticks in the surface, Kohli is through his shot, it goes off the toe-end and it is a simple catch to Bavuma at mid-wicket. Kohli looks down at the surface and righty so, that ball just did not arrive. 28.1 overs (0 Run) On middle, defended. 27.6 overs (1 Run) Another single as this is eased down to long off. End of a decent spell by Maharaj. Was not at his best but did get the big wicket of Dhawan. 27.5 overs (1 Run) On middle, Pant flicks it through square leg for one. 27.4 overs (1 Run) Fifty for Kohli! Yet another one for him. Another excellent knock in a run chase. He probably holds the key for his side. He though will not only want to take his side over the line now but also end his wait for his ton. He gets there by working this through square leg. 27.3 overs (0 Run) On middle, this is played back to the bowler. 27.2 overs (1 Run) Yet another easy run! On middle, this is worked towards mid-wicket for one. 27.1 overs (1 Run) Kohli moves onto 49 now! On the pads, this is worked towards square leg for one. 27.1 overs (1 Run) WIDE! Yet another wide! Down the leg side. Left alone. 26.6 overs (0 Run) Nice amount of turn again for Shamsi! On off and spins away. Pant plays it back to the bowler. 26.5 overs (1 Run) On middle, Kohli had to get bat on that, he does work it through square leg for one. 26.4 overs (0 Run) They need more dots! On middle, this is worked to mid-wicket. 26.3 overs (2 Runs) Two more! On middle, this is hit hard down the ground, the fielder at long off runs to his right and keeps it down to two. 26.3 overs (1 Run) Down the leg side, wided. Quite a few wides by Maharaj. 26.2 overs (1 Run) That is frustrating! The last thing they would have wanted after making a few adjustments in the field is an easy single to the new batter. Pant pushes this tossed up ball towards cover and gets to the other end. 26.1 overs (1 Run) On middle, this is worked through square leg for one. 25.6 overs (1 Run) On middle, Kohli works it down to long on and gets to the other end. 25.5 overs (1 Run) Shorter and on middle, this is pulled, not off the middle, more off the inner half through square leg for one. 25.4 overs (0 Run) Pant steps out, this is tossed up, it is worked to mid-wicket. Rishabh Pant comes out at number 4. 25.3 overs (0 Run) OUT! TIMBER! That is a rippa of a delivery! Wow! That came from nowhere. First real sign of the ball turning big in this innings. Dhawan and Kohli, both are taken by surprise here. This is shorter in length and outside off, Dhawan shapes himself to cut it, this one turns back in sharply goes under the bat and hits the stumps. Is that the wicket which changes the game? The stand which was taking the game away has been broken. 159 more needed in 147. Dhawan walks back after a fine knock, a good return for him back in the side. He just did not seem like getting out but Maharaj has produced something special. 25.2 overs (0 Run) Dhawan misses out! A full toss outside off, Dhawan hits it hard but to covers. 25.1 overs (1 Run) On middle, tossed up, this is pushed down to long on for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637782200265441298.png","source_id":"ndtv"},{"title":"Yorkshire hires Gibson amid rebuild after racism scandal","link":"https://sportstar.thehindu.com/cricket/yorkshire-hires-gibson-amid-rebuild-after-racism-scandal-cricket-news/article38293023.ece","keywords":null,"creator":["AP"],"video_url":null,"description":"Former West Indies all-rounder Ottis Gibson was hired as head coach of English cricket team Yorkshire on Wednesday, with the club saying his arrival will “help foster a culture of inclusion” amid a racism scandal.","content":null,"pubDate":"2022-01-19 14:43:35","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Virat Kohli creates history, surpasses Sachin Tendulkar in THIS record list - Zee News","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vemVlbmV3cy5pbmRpYS5jb20vY3JpY2tldC92aXJhdC1rb2hsaS1jcmVhdGVzLWhpc3Rvcnktc3VycGFzc2VzLXNhY2hpbi10ZW5kdWxrYXItaW4tdGhpcy1yZWNvcmQtbGlzdC0yNDI5MTU3Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli creates history, surpasses Sachin Tendulkar in THIS record list  Zee NewsIndia vs South Africa: Kohli goes past Tendulkar for most runs by Indian in away ODIs  Times of IndiaVirat Kohli breaks Sachin Tendulkar's record for massive Indian feat; surpasses Ganguly, Dravid to go 2nd in elite list  Hindustan TimesIND vs SA: Virat Kohli Surpasses Sachin Tendulkar To Score Most Runs In Away ODIs For India  Cricket AddictorVirat Kohli hits fifty in 1st match as pure batter for India since 29 October 2016  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-01-19 14:39:52","image_url":null,"source_id":"google"},{"title":"South Africa vs India: South Africa vs India 2021/22 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-1st-odi-odi-21-25-updates-2717758","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Boland Park, Paarl. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-19 14:32:23","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 25.2 overs, India, chasing a target of 297, are 138/1. The live updates of South Africa vs India scorecard is also available. It is the perfect platform to follow your favourite teams in South Africa vs India 2021/22. Keep a track on your favourite batsmen and bowlers through South Africa vs India 2021/22 today match, ball by ball commentary, South Africa vs India, South Africa vs India live score, South Africa vs India scorecard. Follow the excitement of the South Africa vs India 2021/22 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 24.6 overs (0 Run) Tossed up, slower and outside off, Dhawan looks to sweep but is a touch early in the shot, it goes off toe-end towards mid-wicket. A dot to endd but a productive over for India. 24.5 overs (1 Run) On the pads, Kohli works it towards short fine leg for one 24.4 overs (1 Run) Yet another single! On middle, shorter, this is pushed down to long on for one. 24.3 overs (1 Run) That is a safe shot! Kohli comes down the track and then chips it but it lands well short of long on. Only one. 24.2 overs (4 Runs) FOUR! Put away nicely! Shorter in length and on the pads, Kohli rocks back and pulls it hard, it goes through square leg for a boundary. 24.1 overs (1 Run) On middle, this is pushed down to long on for one. 23.6 overs (1 Run) Good sensible batting! This is on middle, Dhawan works it with the turn towards square leg for one. 23.5 overs (1 Run) On off, Kohli pushes it through covers for one. 23.4 overs (1 Run) Shorter and on off, Dhawan pushes it through covers for one. 23.3 overs (0 Run) Well bowled! Floats it up and lands it on off, defended. 23.2 overs (1 Run) Shorter and on middle, Kohli pulls, it goes off the inner half towards mid-wicket for one. 23.1 overs (0 Run) Flatter and on middle, defended. South Africa need to bowl more dots. There isn't any pressure on the Indian batters at the moment. 22.6 overs (1 Run) Another single as this is flicked down to long on. 22.5 overs (2 Runs) On middle, Kohli works sweeps it hard, through mid-wicket for two. 22.4 overs (0 Run) On off, this is pushed to covers for no runs. 22.3 overs (1 Run) Super work in the field yet again! Shorter and outside off, Kohli cuts it hard but the fielder at point dives to his left and makes a half stop. A single in the end. 22.2 overs (1 Run) On off, this is hit down to long off for one. Really good fielding again. 22.1 overs (2 Runs) Two more! This is tossed up on middle, it is swept hard towards deep mid-wicket for two. 22.1 overs (1 Run) WIDE! Shamsi has not got it right so far! Down the leg side, wided. 21.6 overs (1 Run) That is brilliant work! Kohli comes down the track and chips it over the bowler's head. The fielder at long on runs to his left, stops it with a dive and as he is falling onto the ground, parries it to the man running to his right from long off. Only one. 21.5 overs (1 Run) On off, this is pushed towards cover for one. 21.4 overs (1 Run) On the pads, this is nudged on the leg side for one more. 21.3 overs (0 Run) Well fielded! On middle, this is worked on the leg side, Ngidi at square leg dives to his left and stops one. 21.2 overs (1 Run) This is swept hard but straight to the man at deep mid-wicket. 21.1 overs (0 Run) Outside off, flatter, Dhawan guides it to point. 20.6 overs (1 Run) Full and outside off. Dhawan slashes it through point for a single. An expensive start by Tabraiz Shamsi, 9 runs off his first. Great maneuvering of the ball here. 20.5 overs (0 Run) On off, played back to the bowler. 20.4 overs (4 Runs) FOUR! Nicely played. Floated, full and on leg. Dhawan gets low and looks to sweep it away, it goes off the top-edge and into the boundary at square leg. 20.3 overs (2 Runs) Two runs now! Short and outside off. Dhawan hits it to long on against the turn. 20.2 overs (1 Run) Fuller, on middle. Kohli flicks it to the leg side. The fielder there makes a half stop and the batters take a single. 20.1 overs (0 Run) Outside off. Kohli helps it to covers. 20.1 overs (1 Run) WIDE! Tabraiz Shamsi starts with a loosener. Floated, full and down leg. Kohli looks to flick it but misses. Wide called.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637782193334088306.png","source_id":"ndtv"},{"title":"Is Glenn Maxwell married: Is Glenn Maxwell related to Nick Maxwell?","link":"https://thesportsrush.com/cricket-news-is-glenn-maxwell-married-is-glenn-maxwell-related-to-nick-maxwell/","keywords":["Cricket","BBL 11","Big Bash League","Glenn Maxwell","Hobart Hurricanes","Melbourne Stars"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Glenn Maxwell career-best innings: The captain of Melbourne Stars entered several books on the back of his fifth T20 century. Melbourne Stars captain Glenn Maxwell enticed limelight because of his fifth T20 century against Hobart Hurricanes in the last league match of the ongoing 11th season of the Big Bash League at the Melbourne Cricket… The post Is Glenn Maxwell married: Is Glenn Maxwell related to Nick Maxwell? appeared first on The SportsRush.","content":"Glenn Maxwell career-best innings: The captain of Melbourne Stars entered several books on the back of his fifth T20 century. Melbourne Stars captain Glenn Maxwell enticed limelight because of his fifth T20 century against Hobart Hurricanes in the last league match of the ongoing 11th season of the Big Bash League at the Melbourne Cricket Ground. Maxwell, who eventually scored 154* (64), became the first-ever batter to cross the 150-run mark in a BBL innings. In the process, the right-hand batter powered Stars to 273/2 in 20 overs; highest innings score in the BBL. As far as T20s are concerned, Stars managed to put on board the second-highest innings total. In what wasn’t just Maxwell’s career-best T20 score, it was also the highest individual score in the BBL. Maxwell, 33, hit as many as 22 fours and four sixes to register a phenomenal hard-hitting knock. Glenn Maxwell #BBL — Aakash Chopra (@cricketaakash) January 19, 2022 “It was certainly a lot of fun. It helps you can play with ultimate freedom knowing the season is done for your team so you can pin your ears back and have a real crack. We got away with a few early on getting spin bowled to us in the first few overs, cashed in to get ahead of the game. It was just nice to come off,” Maxwell told Fox Cricket during the post-match presentation ceremony. Is Glenn Maxwell related to Nick Maxwell? For those who are confusing Glenn Maxwell to be a relative of former Australia rules football player Nick Maxwell, it is worth mentioning that the two aren’t related by any way. Is Glenn Maxwell married? Australia all-rounder Maxwell is not married but has been dating pharmacist Vini Raman since 2017. Often seen together during events, Maxwell and Raman had got engaged in March 2020.   View this post on Instagram   A post shared by VINI (@vini.raman) Readers must note that the two had met for the first time during a Melbourne Stars event in 2013. The post Is Glenn Maxwell married: Is Glenn Maxwell related to Nick Maxwell? appeared first on The SportsRush.","pubDate":"2022-01-19 14:13:58","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Test cricket's next challenge: how to avoid another lopsided Ashes series | Geoff Lemon - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2phbi8xOS90ZXN0LWNyaWNrZXRzLW5leHQtY2hhbGxlbmdlLWhvdy10by1hdm9pZC15ZXQtYW5vdGhlci1sb3Atc2lkZWQtYXNoZXMtc2VyaWVz0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Test cricket's next challenge: how to avoid another lopsided Ashes series | Geoff Lemon  The GuardianWhy rudderless England must turn to Alec Stewart in bid to steady ship after Ashes humiliation  Evening StandardTREVOR BAYLISS: Andrew Strauss is the PERFECT man to save English cricket  Daily MailNot all failings of England’s Test team can be blamed on county cricket  The GuardianRob Key column: England need a tough tactician in charge... but deeper problems must be tackled  Evening StandardView Full coverage on Google News","content":null,"pubDate":"2022-01-19 14:08:00","image_url":null,"source_id":"google"},{"title":"South Africa vs India Live Score Ball by Ball, South Africa vs India 2021/22 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-1st-odi-odi-16-20-updates-2717702","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Boland Park, Paarl. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-19 13:53:39","full_description":"Follow the South Africa vs India 2021/22 live cricket score on Sports.NDTV.com . After 20.2 overs, India, chasing a target of 297, are 106/1. Get live score, ball by ball commentary and much more. Keep track of South Africa vs India 2021/22 today match between South Africa and India. Everything related to South Africa and India match will be available on Sports.NDTV.com . Stay updated with South Africa vs India live score. Do check for South Africa vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 19.6 overs (0 Run) Short and on leg. Dhawan comes forward and pulls it to short fine leg. 19.5 overs (1 Run) Tosses it up, on middle. Kohli drives it down the ground for a run. 19.4 overs (0 Run) On the pads, flicked to the onside. 19.3 overs (0 Run) Full and on leg. Kohli leans forward and defends it to mid on. 19.2 overs (1 Run) Full and outside off. Dhawan taps it to point for a quick single. 19.1 overs (0 Run) Touch short, on the pads. Dhawan goes back and flicks it to short fine leg. DRINKS! India are in a really strong position! They are going along well courtesy the pair of Dhawan and Kohli and if they continue to bat the way they are, India should cruise home. South Africa on the other hand, need to break this stand and get into the relatively inexperienced middle order. Can they do it? 18.6 overs (0 Run) Full length, outside off. Kohli leans in and drives it to cover. Not in the gap. 18.5 overs (0 Run) On off, blocked out. 18.4 overs (1 Run) Good length, outside off. Dhawan looks to play it across the line, but is a touch early through his shot, it goes to short third man off the inside edge for a single. 18.4 overs (1 Run) WIDE! A sharp bumber, on middle. Dhawan leaves it alone. The umpire signals a wide due to the height. 18.3 overs (0 Run) Good length, on off. Dhawan defends it to cover. 18.2 overs (4 Runs) FOUR! Up and over! Dhawan picks the gap beautifully and brings up 100 for India. Full-length ball, outside off. Dhawan reaches out and loft it over covers for a boundary. 18.1 overs (2 Runs) Slightly short and outside off. Dhawan hangs back and cuts it to deep cover for a couple now. He plays this under his eyes and gets it off the middle. He is in fine touch. 17.6 overs (0 Run) Two dots to end the over. This one hurries onto the batter, on leg. Kohli goes back and tucks it to the leg side. 17.5 overs (0 Run) On middle, defended out off the front foot. 17.4 overs (1 Run) Darted on the pads. Dhawan nurdles it to the onside for a quick single. 17.3 overs (1 Run) Third single of the over! Floated, full and on leg. Kohli clips it to deep mid-wicket. 17.2 overs (1 Run) Flatter and on off. Dhawan punches it through point for another run. 17.1 overs (1 Run) On leg, flicked to mid-wicket for a single. 16.6 overs (0 Run) Back of a length, around off, shaping away from the left-hander. Dhawan leaves it alone. 16.5 overs (1 Run) Full length, outside off. Kohli drives it to deep cover for a single now. This is good batting. 16.4 overs (4 Runs) FOUR! What a shot! Full length, on off. Kohli comes down the track and flicks it past mid on for a boundary. Ngidi cannot believe how has he hit that so good. 16.3 overs (0 Run) A sharp bouncer, on the body. Kohli comes forward and looks to pull it away but misses. Kohli has a smile across his face. He thinks this was way above the head but the umpire deems it as a first bouncer. 16.2 overs (1 Run) Full length, outside off. Dhawan stays back and cuts it to deep cover for a run. He gets it off the middle this time. 16.1 overs (1 Run) Good length, in the corridor of uncertainty. Kohli punches it past backward point for a single. 15.6 overs (0 Run) Around off, turning away a bit. Dhawan stays back and defends it back to the bowler. 15.5 overs (0 Run) Tossed up, on off. Dhawan defends it out watchfully. 15.4 overs (1 Run) Angled down leg. Kohli flicks it to mid-wicket for a single. 15.3 overs (0 Run) Full, on middle. Kohli defends it out off the front foot. 15.2 overs (2 Runs) On the pads, clipped to deep square leg for a couple this time. 15.1 overs (0 Run) Floated, full, on middle and leg. Kohli defends it into the deck.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637782170039528579.png","source_id":"ndtv"},{"title":"South Africa vs India Live Score Ball by Ball, South Africa vs India 2021/22 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-1st-odi-odi-11-15-updates-2717657","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Boland Park, Paarl. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-19 13:53:23","full_description":"Follow the South Africa vs India 2021/22 live cricket score on Sports.NDTV.com . After 15.4 overs, India, chasing a target of 297, are 84/1. Get live score, ball by ball commentary and much more. Keep track of South Africa vs India 2021/22 today match between South Africa and India. Everything related to South Africa and India match will be available on Sports.NDTV.com . Stay updated with South Africa vs India live score. Do check for South Africa vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (0 Run) Full-length ball, outside off. Dhawan comes down the track and pushes it to cover. Does not find the gap. 14.5 overs (2 Runs) Good running! Length ball, on the pads, too straight. Dhawan clips it to deep square leg for a brace. 14.4 overs (1 Run) Indian players happy to keep the runs ticking. Length ball, angled into the pads. Kohli gets inside the line and nudges it to mid-wicket for a single. 14.3 overs (1 Run) Fuller, outside off. Dhawan punches it through the gap at covers for a run. 14.2 overs (1 Run) On leg, flicked to square leg for a single. 14.1 overs (1 Run) Fuller, outside off. Dhawan steps down the track and punches it to covers for a run. 13.6 overs (1 Run) FIFTY FOR DHAWAN! This has been a good start for Dhawan and gets an applause from the dugout. He will surely be eyeing the three digit figure now. Full and on leg. Dhawan flicks it to mid-wicket for a run. 13.5 overs (0 Run) On leg, blocked out. 13.4 overs (1 Run) Tossed up, full and on leg. Kohli drive it down to long on for another single. 13.3 overs (1 Run) Angled into the pad. Dhawan clips it to square leg for a run. 13.2 overs (1 Run) Floated, full and on leg. Kohli clips it to the leg side for a single. 13.1 overs (0 Run) Tossed up, outside off. Kohli pushes it to mid off. 12.6 overs (1 Run) Length ball, on off. Kohli defends it to square leg off the inner half. He gets across for a single. He will retain the strike. 12.5 overs (1 Run) Full-length ball, outside off. Dhawan punches it through point for a single. 12.4 overs (0 Run) Three dots in a row! On a length, on off. Dhawan pushes it to cover. Not in the gap though. 12.3 overs (0 Run) This time it is full, on off. Dhawan stays back and pushes it to mid off. 12.2 overs (0 Run) BEATEN! Nicely bowled. Good length, outside off, shaping away. Dhawan looks to push it away but gets beaten on the outside edge. 12.1 overs (1 Run) Full length, on off. Kohli comes across and pushes it to mid off for a single. 11.6 overs (4 Runs) FOUR! EDGY! Lucky boundary for Dhawan. Full and outside off. Dhawan hangs his blade out, it goes off the outside edge to third man and into the fence. He moves to 47. 11.5 overs (0 Run) Tosses it up, outside off. Dhawan taps it to point. He was looking for a single but Kohli wisely sends him back. 11.4 overs (0 Run) Full and on off. defends it to the left of the bowler. 11.3 overs (0 Run) Angles in with the arm now. Dhawan prods and looks to defend it out but gets and inisde edge onto the pads. 11.2 overs (2 Runs) Full and on leg. Dhawan clips it to mid-wicket for a couple of runs. This is good running. 11.1 overs (1 Run) Floated, full and outside off. Kohli drives it to long off for an easy single. 10.6 overs (1 Run) Full and on off. Kohli pushes it down the ground for a single. 10.5 overs (1 Run) Floated, full and on off. Dhawan gets it to the left of the bowler off the inside edge. They take a single. 10.4 overs (1 Run) Fuller, on middle and leg. Kohli clips it to mid-wicket for a run. 10.4 overs (1 Run) WIDE! Full and down leg. Kohli leaves it alone. Wide called by the umpire. 10.3 overs (0 Run) Full and on leg. Kohli eases it to mid-wicket. 10.2 overs (0 Run) Full and on off. Kohli leans forward and clips it to mid-wicket. 10.1 overs (1 Run) Tossed it up, on off. Dhawan drives it through covers for an easy one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637782169886379157.png","source_id":"ndtv"},{"title":"India vs South Africa Live Cricket Score Updates, 1st ODI: Markram Removes Rahul in 297 Chase - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMiywFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaW5kaWEtdnMtc291dGgtYWZyaWNhLTIwMjItMXN0LW9kaS1saXZlLWNyaWNrZXQtc2NvcmUtdXBkYXRlcy1ib2xhbmQtcGFyay1pbmQtdnMtc2EtbGl2ZS1zdHJlYW1pbmctbWF0Y2gtb25saW5lLXdhdGNoLWxhdGVzdC1tYXRjaC1jb21tZW50YXJ5LWxpdmVuZXdzLTQ2NzQyMjcuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa Live Cricket Score Updates, 1st ODI: Markram Removes Rahul in 297 Chase  News18Why SA-India series is not part of ODI Super League | Cricbuzz.com - Cricbuzz  CricbuzzMatch Preview - South Africa vs India, India in South Africa 2021/22, 1st ODI  ESPNcricinfoSports Buzz: India takes on South Africa in ODI series opener & other top sports news  DD INDIASubplots drive the interest in second-tier ODI series | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-01-19 13:28:45","image_url":null,"source_id":"google"},{"title":"IND vs SA: I Feel Indians Are Often Obsessed With Statistics: Dilip Vengsarkar Backs Virat Kohli's Batting Efforts In Cape Town - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiuQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vaW5kaWEtdG91ci1vZi1zb3V0aC1hZnJpY2EtMjAyMS9pbmQtdnMtc2EtaS1mZWVsLWluZGlhbnMtYXJlLW9mdGVuLW9ic2Vzc2VkLXdpdGgtc3RhdGlzdGljcy1kaWxpcC12ZW5nc2Fya2FyLWJhY2tzLXZpcmF0LWtvaGxpcy1iYXR0aW5nLWVmZm9ydHMtaW4tY2FwZS10b3duL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: I Feel Indians Are Often Obsessed With Statistics: Dilip Vengsarkar Backs Virat Kohli's Batting Efforts In Cape Town  Cricket Addictor'He's not getting runs, pointing fingers at others': Ex-India pacer says Kohli was 'under pressure' since T20 WC debacle  Hindustan TimesThe question is, who will be vice-captain: and Rishabh Pant fits the bill  The HinduThere was always pressure: Former India pacer shares his take on Virat Kohli`s captaincy resignation  WION‘Dravid remains composed, Kohli is aggressive’: Ex-PAK opener points ‘compatibility issue’ behind Virat's decision  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-01-19 13:27:59","image_url":null,"source_id":"google"},{"title":"South Africa vs India Live Score Ball by Ball, South Africa vs India 2021/22 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-1st-odi-odi-6-10-updates-2717605","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Boland Park, Paarl. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-19 13:24:15","full_description":"Follow the South Africa vs India 2021/22 live cricket score on Sports.NDTV.com . After 10.1 overs, India, chasing a target of 297, are 56/1. Get live score, ball by ball commentary and much more. Keep track of South Africa vs India 2021/22 today match between South Africa and India. Everything related to South Africa and India match will be available on Sports.NDTV.com . Stay updated with South Africa vs India live score. Do check for South Africa vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (0 Run) Slows it up and lands it on middle, defended nicely. Good comeback by the bowler then after going for a boundary early on. 9.5 overs (0 Run) On middle, kept out. 9.4 overs (0 Run) Tosses it up on off, defended. 9.3 overs (1 Run) A single now as this is flicked through mid-wicket. 9.2 overs (0 Run) On middle, this is worked to the left of the bowler. 9.1 overs (4 Runs) FOUR! That is a poor ball to begin with! A total loosener. Short and down the leg side. Dhawan pulls it through fine leg for a boundary. Keshav Maharaj comes into the attack now. He replaces Marco Jansen. 8.6 overs (0 Run) A dot to end a successful over. On middle, Kohli works it to mid-wicket. 8.5 overs (4 Runs) FOUR! Put away and Kohli is off the mark in style. A gift for him. Short and on middle, this is pulled through mid-wicket and it races away to the fence. 8.4 overs (0 Run) On middle, this is worked to mid-wicket. Virat Kohli walks out at number 3 for India. 8.3 overs (0 Run) OUT! EDGED AND TAKEN! There is the big wicket of the Indian skipper and Markram strikes. This is flatter and on off, Rahul plays for the turn. He looks to defend but this goes on with the arm. It takes the outside edge and de Kock takes it. Huge wicket as Rahul is very dangerous once he gets his eye in. Also, like most of the times, it is not the ball that turns but the one that goes on with the arm is what gets you out. 8.2 overs (1 Run) Floated up on off, this is chipped down to long off for one more. 8.1 overs (1 Run) On middle, this is worked through mid-wicket for one. 7.6 overs (0 Run) A dot to end but a good over for India. On off, this is pushed to covers. 7.5 overs (4 Runs) FOUR! Up and over. India finding it very easy at the moment. This is shortish and outside off, this is hit over point for a boundary. 7.4 overs (0 Run) On off, this is cut hard, there is a man close in at point who stops it well. He is hurt. 7.3 overs (4 Runs) FOUR! Put away! Short and on middle, poor delivery with no fielder in the deep on the leg side. Dhawan pulls it through square leg and it races away to the fence. 7.2 overs (0 Run) Just short. Dhawan steps out. This is banged in short. He looks to slap it over covers but it goes off the splice and lands just short of cover. 7.1 overs (1 Run) Good delivery! Probably the first ball Jansen bowls to Rahul. He squares him up, lands on off and then moves away. It goes off the outside edge down to third man for one. 6.6 overs (1 Run) A single to end! On middle, this is worked through mid-wicket for one. 6.5 overs (1 Run) On middle, Dhawan takes one as he eases it to mid on. 6.4 overs (0 Run) On off, this is pushed to covers. 6.3 overs (3 Runs) Lucky runs! Tossed up nicely on off, this one turns back in. Rahul looks to go over mid off but he gets an inside edge, it goes past leg stump. An early dive from Shamsi sees the ball go past him at short fine leg. Three taken. 6.2 overs (1 Run) Angled into the pads, Dhawan works it through mid-wicket for one. 6.1 overs (1 Run) Good shot but not good running. Rahul comes down the track and flicks it wide of mid-wicket. Only one. 5.6 overs (0 Run) On off, Dhawan pushes it to covers. 5.5 overs (0 Run) Another dot! On off, defended. 5.4 overs (4 Runs) FOUR! That is a poor ball! On the pads, this is flicked nicely through mid-wicket for a boundary. Dhawan is looking really good. 5.3 overs (0 Run) On middle, Dhawan works it to mid-wicket. 5.2 overs (0 Run) On off, this is pushed to covers. 5.1 overs (0 Run) Swing and a miss! Good length, outside off. Dhawan looks to chase it but misses.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637782152457827808.png","source_id":"ndtv"},{"title":"South Africa vs India Live Score Ball by Ball, South Africa vs India 2021/22 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/south-africa-vs-india-live-score-over-1st-odi-odi-1-5-updates-2717558","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between South Africa vs India from Boland Park, Paarl. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-01-19 13:14:48","full_description":"Follow the South Africa vs India 2021/22 live cricket score on Sports.NDTV.com . After 5.3 overs, India, chasing a target of 297, are 24/0. Get live score, ball by ball commentary and much more. Keep track of South Africa vs India 2021/22 today match between South Africa and India. Everything related to South Africa and India match will be available on Sports.NDTV.com . Stay updated with South Africa vs India live score. Do check for South Africa vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (0 Run) Full, on middle and leg. Rahul flicks it to the leg side. This has been a stable start for India. 4.5 overs (1 Run) A single as this is eased down to long off. 4.4 overs (4 Runs) FOUR! Nice use of the feet. Full and on middle. Dhawan advances down the track and lofts it over mid on for a boundary. 4.3 overs (0 Run) On leg, worked to square leg. 4.2 overs (0 Run) Full, on middle, blocked back to the bowler. 4.1 overs (1 Run) Full and on leg, flicked to deep square leg for a single. 3.6 overs (0 Run) Length, on leg. Dhawan tucks it square on the leg side. A good over for India. 3.5 overs (2 Runs) Back of a length, on the bodyline. Dhawan swivels and looks to pull it away. The ball brushes the gloves and goes towards fine leg. The batters take two. 3.4 overs (0 Run) Back of a length, on off. Dhawan blocks it back to the bowler. 3.3 overs (4 Runs) FOUR! This is a glorious drive! A full-length ball, outside off. Dhawan presses forward and drives it through the cover region for a boundary. He gets his second boundary off Jansen but this time he timed it to perfection. 3.2 overs (2 Runs) Fuller, on the pads. Dhawan clips it to deep square leg. The fielder takes some time to get to the ball and the batters run two easily. 3.1 overs (0 Run) Length ball, on middle and leg. Dhawan puts his front leg across and defends it to the leg side. 2.6 overs (0 Run) Angled into the pads. Rahul stays back and flicks it to the leg side. Another good over by Aiden Markram. 2.5 overs (2 Runs) Flighted, full and on off. Rahul pushes it to mid off for a quick single. The fielder throws the ball towards the keeper. Quinton de Kock fails to keep it in control which allows the batters to take an extra run. 2.4 overs (0 Run) Full and on off. Rahul prods and defends it to mid-wicket. 2.3 overs (0 Run) Quicker and on off. Rahul blocks it back to the bowler. 2.2 overs (1 Run) Tossed up, full and outside off. Dhawan drives it down the ground to long off for a run. 2.1 overs (1 Run) Slower through the air, on off. Rahul pushes it to mid off for a single. 1.6 overs (0 Run) Length, on off. Dhawan defends it out solidly. 1.5 overs (4 Runs) FOUR! STREAKY! Marco Jansen has his hands on his head. He cannot believe how that missed the stumps. A length ball, angled in on off. Dhawan gets an inside edge, the ball scoots past the stumps and runs down to the fine leg fence. 1.4 overs (0 Run) Short ball, outside off. Dhawan hangs back and cuts it towards point. Aiden Markram flies to his right and gathers the ball. That is some stop. 1.3 overs (0 Run) Make that three! Full length, on middle and leg. Dhawan defends it to the onside. 1.2 overs (0 Run) Two dots in a row! Good length, outside off, Dhawan shuffles across and leaves it alone for the keeper. 1.1 overs (0 Run) Back of a length, outside off. Dhawan stays back and punches it to point. Marco Jansen to steam in from the other end with the second new ball. 0.6 over (0 Run) Looped up, on middle. Rahul eases it back to the bowler. Just two runs off it, a tidy start for the spinner. 0.5 over (0 Run) Full and on middle, flicked to mid-wicket. 0.4 over (0 Run) On off, pushed back to the bowler. 0.3 over (1 Run) Dhawan is off the mark now. Full and on leg. Dhawan clips it to mid-wicket for a single. 0.2 over (0 Run) Full and on middle. Dhawan prods and defends it back to the bowler. 0.1 over (1 Run) KL Rahul and India are off the mark! Tossed up, full and on leg. Rahul clips it to mid-wicket for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637782146786208111.png","source_id":"ndtv"},{"title":"'Seems only you and I are looking at him as all-rounder': Former India cricketers baffled at Iyer not bowling in 1st ODI - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMizgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9zZWVtcy1vbmx5LXlvdS1hbmQtaS1hcmUtbG9va2luZy1hdC1oaW0tYXMtYWxsLXJvdW5kZXItZm9ybWVyLWluZGlhLWNyaWNrZXRlcnMtZ2F1dGFtLWdhbWJoaXItYWFrYXNoLWNob3ByYS1iYWZmbGVkLWF0LWl5ZXItbm90LWJvd2xpbmctaW4tMXN0LW9kaS0xMDE2NDI1OTQ0NDQ1ODQuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'Seems only you and I are looking at him as all-rounder': Former India cricketers baffled at Iyer not bowling in 1st ODI  Hindustan TimesIND vs SA: Maybe KL Rahul Wants To Allow Yuzvendra Chahal To Come Back - Sanjay Manjrekar On Why Venkatesh Iyer Didn't Bowl In First ODI  Cricket AddictorKL Rahul Tries To Find Solution To India's Sixth Bowler Problem, Identifies Venkatesh Iyer As Option..  NDTVSports.comIND vs SA, 1st ODI: Venkatesh Iyer makes debut as Ashwin returns to XI; Shreyas Iyer to play at no.4  Hindustan TimesSouth Africa vs India: Baffling India didn't use Venkatesh Iyer's bowling in 1st ODI, says Aakash Chopra  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-01-19 13:03:34","image_url":null,"source_id":"google"},{"title":"ICC congratulates Erasmus on reaching 100-ODI landmark","link":"https://timesofindia.indiatimes.com/sports/cricket/india-in-south-africa/icc-congratulates-marais-erasmus-on-reaching-100-odi-landmark/articleshow/88998720.cms","keywords":null,"creator":null,"video_url":null,"description":"The International Cricket Council (ICC) has congratulated Marais Erasmus for officiating in 100 men's One Day Internationals as an on-field umpire.","content":null,"pubDate":"2022-01-19 12:51:29","full_description":null,"image_url":null,"source_id":"toi"}]}