{"newsArray":[{"title":"IND vs WI: 6 गेंद में 3 विकेट, युजवेंद्र चहल के आगे कांप गए थे वेस्टइंडीज के बल्लेबाज, फिर भी भारत को मिली हार","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-wi-three-wickets-in-six-balls-west-indies-batsmen-were-trembling-against-yuzvendra-chahal-yet-india-got-defeated/articleshow/102479959.cms","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI, 2nd T20I: पांच टी20 मैचों की सीरीज के दूसरे मुकाबले में स्पिनर गेंदबाज युजवेंद्र चहल ने शानदार गेंदबाजी का प्रदर्शन करते हुए एक ही ओवर में मैच को भारत की तरफ मोड़ दिया। इस कारण टीम इंडिया ने सीरीज में 1-1 की बराबरी कर ली।","content":"पांच वनडे मैचों की सीरीज के दूसरे मुकाबले में भी भारतीय टीम को करारी हार मिली थी। दूसरे टी20 में वेस्टइंडीज ने भारत को 2 विकेट से हरा दिया। इस मैच में टीम इंडिया के कप्तान हार्दिक पंड्या ने टॉस जीतकर पहले गेंदबाजी का फैसला किया था लेकिन वह 20 ओवर में सिर्फ 152 रन का ही स्कोर खड़ा कर पाई। इसके जवाब में वेस्टइंडीज ने 7 गेंद शेष रहते ही लक्ष्य को हासिल कर लिया। वेस्टइंडीज के खिलाफ इस मुकाबले में गेंदबाजी में युजवेंद्र चहल ने कमाल का खेल दिखाया। चहल ने पारी के 16वें ओवर में मैच को पूरी तरह भारत की तरफ मोड़ दिया था। चहल के इस ओवर में टीम इंडिया को तीन बड़ी सफलताएं मिली थी लेकिन इसके बावजूद टीम इंडिया मैच को नहीं जीत पाई। चहल के इस ओवर की पहली गेंद पर शिमरन हेटमायर ने एक सिंगल चुराने का प्रयास किया लेकिन अक्सर पटेल के शानदार थ्रो से रोमारियो शेफर्ड रन आउट हो गए। चहल के इसी ओवर में जेसन होल्डर को ईशान किशन स्टंप आउट किया। इन दो विकेट के बाद ऐसा लगा कि भारतीय टीम ने मैच को अपने पक्ष में कर लिया है और ऐसा हुआ भी। क्योंकि पारी की आखिरी गेंद पर चहल ने हेटमायर को भी एलबीडबल्यू कर दिया। इस तरह चहल के 6 गेंद में भारत को तीन सफलताएं मिल जिसके कारण वेस्टइंडीज हार लगभग तय हो गई थी। हालांकि इसके बाद अकिल होसैन और अल्जारी जोसेफ ने मोर्चा संभाल लिया और नाबाद रहते हुए अपनी टीम को 2 विकेट से जीत दिला दी। अकील होसैन ने 10 गेंद में 16 रनों की पारी खेली जबकि अल्जारी जोसेफ ने 8 गेंद में 10 रन बनाकर नाबाद रहे। इस तरह वेस्टइंडीज की टीम ने पांच मैचों की इस सीरीज में 2-0 की बढ़त बना ली है। वेस्टइंडीज के खिलाफ इस मुकाबले में भारतीय टीम की बल्लेबाजी बुरी तरह फ्लॉप रही। टॉप ऑर्डर में शुभमन गिल, ईशान किशन, सूर्यकुमार यादव और संजू सैमसन ने पूरी तरह से निराश किया। हालांकि तिलक वर्मा ने जरूर 51 रनों की पारी खेली। इसके अलावा और कोई बल्लेबाज कमाल नहीं दिखा सके जिसके कारण भारत 20 ओवर में सिर्फ 152 रन का स्कोर ही खड़ा कर सकी।","pubDate":"2023-08-06 23:30:00","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Surrey slam ‘ludicrous’ claims over Ashes ball change after Australia complaints","link":"https://www.standard.co.uk/sport/cricket/ashes-ball-change-controversy-surrey-b1098965.html","keywords":["Cricket","Sport"],"creator":["Press Association"],"video_url":null,"description":"Surrey have rejected the “ludicrous” claim that an old Dukes ball could have been used in the final Ashes Test at the Kia Oval.","content":"have rejected the “ludicrous” claim that an old Dukes ball could have been used in the final Test at the Kia Oval. were able to win the fifth Test by 49 runs to level the series at 2-2 but the Australian press coverage in the immediate days after last Monday's dramatic finale was dominated by ‘ballgate’ with among a number of current and former players to discuss the subject. Khawaja and fellow opener David Warner were well set on day four in an unbroken century stand when the former was struck on the helmet by a bouncer, which resulted in a change to the Dukes ball being used. Dilip Jajodia, the owner of Dukes Cricket Balls, has vowed to launch an investigation after he added to speculation that a ball from a previous batch could have been used, not a ball from the 2023 batch. A Surrey spokesperson told the PA news agency: “Mr Jajodia is correct to say that Duke's balls are supplied to the Oval and to Surrey CCC ahead of the season for use in matches and training. These balls can also be used as match replacements, as seen during the Test. SPONSORED “There were a wide selection of balls available to the umpire's at all times, with a variety of conditions to choose from, and that decision is entirely at their discretion. “We reject entirely the assertion that a ball from 2018 or 2019 could have been available for selection and think the suggestion itself is ludicrous.” Jajodia, in an interview with News Corp, explained how every ball produced for a specific season has the date stamped on it and while “it's not likely”, he admitted a ball from a different year could have been behind the changed ball on day four, producing more swing and seam movement. “I can't imagine they would risk putting a ball in there with a different date on it. Frankly, the match referee should be on top of it,\" Jajodia said of Surrey, via Wisden.com. “We do bang that number in quite hard, so even if the gold comes off, the ball is imprinted. It wouldn't be easy to get rid of it. I'm not saying it's impossible (that it was a 2018 or 2019 ball), but it's not likely. “I'm going to investigate myself because it affects me. My name is at stake so it's important they don't misallege something was wrong with the ball.”","pubDate":"2023-08-06 20:01:17","image_url":"https://static.standard.co.uk/2023/08/06/19/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Southby shines as Brave beat Superchargers before Fire edge Invincibles","link":"https://www.skysports.com/cricket/news/12040/12934850/the-hundred-rhianna-southby-shines-as-southern-brave-beat-northern-superchargers","keywords":null,"creator":null,"video_url":null,"description":"Rhianna Southby put on a sensational wicketkeeping display as Southern Brave Women returned to winning ways with a five-wicket victory over Northern Superchargers in The Hundred.","content":"Rhianna Southby put on a sensational wicketkeeping display as Southern Brave Women returned to winning ways with a five-wicket victory over Northern Superchargers in The Hundred. Southby affected a Hundred record four wickets - two catches and two stumpings - in her second match in front of an Ageas Bowl record 9,813 crowd. The soon-to-retire Anya Shrubsole starred with two wickets, dismissing overseas duo Jemimah Rodrigues (India) and Phoebe Litchfield (Australia) for six and nought respectively before Georgia Adams bagged 3-21 as Superchargers were restricted to 100-8. Please use Chrome browser for a more accessible video player Southby caught Litchfield and Alice Davidson-Richards (5) brilliantly and also stumped Superchargers skipper Hollie Armitage (21) and top-scorer Marie Kelly (39). Maia Bouchier took control of the chase with 31 off 28 balls as Brave eased to their target with 13 balls to spare to make it two wins from three and leave Superchargers with one victory and one loss from their two matches. Brave opener Danni Wyatt (20 off 18) initially looked the most fluent batter on display, with five sweetly-struck boundaries inside the first 15 balls, but came unstuck when she drilled Kate Cross to point. In the day's second women's match, two-time champions Oval Invincibles were skittled for just 80 as they lost a nervy game to new table-toppers Welsh Fire by three wickets. A white-ball bonanza: How the rest of England's year looks The Hundred - latest standings The Hundred - latest video The Hundred homepage Please use Chrome browser for a more accessible video player Invincibles opener Lauren Winfield-Hill (42 off 35 balls) hit over half of her side's runs with their next highest scorers making seven in No 10 Seren Smale and No 11 Lizzie Scott. Invincibles plummeted to 55-9 in 75 balls as Shabnim Ismail took three wickets and Georgia Elwiss and Alex Griffiths bagged two each, before Winfield-Hill added 25 with last woman Scott. Fire experienced jitters in the chase, losing openers Tammy Beaumont and Hayley Matthews for ducks as they slipped to 5-2 and then twice losing two wickets in as many balls as they plummeted to 49-4 and 69-6, with Invincibles' South African seamer Marizanne Kapp striking four times. Freya Davies then departed with four runs required but Sarah Bryce (9no) and Griffiths (4no) took Fire over the line after vital earlier contributions from Sophia Dunkley (28) and Elwiss (33). Fire have two wins and a washout from their opening three fixtures, while Invincibles are still seeking a first victory with this defeat at The Kia Oval following an abandoned game against London Spirit. Monday's matches in The Hundred come from Emirates Old Trafford as Manchester Originals take on Birmingham Phoenix . The women's game starts at 3pm with the men then under way at 6.30pm. There will be a 30-minute build-up to both games on Sky Sports Cricket. Sky Sports will show all 68 games in The Hundred live this summer. Stream The Hundred for £26 a month and more with NOW","pubDate":"2023-08-06 19:00:00","image_url":"https://e1.365dm.com/23/08/1920x1080/skysports-mary-taylor-the-hundred_6237443.jpg?20230806141517","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"सरफराज खान ने कश्मीर गर्ल से किया निकाह, सुंदरता में देती हैं बॉलीवुड हीरोइनों को टक्कर, तस्वीरें हुई वायरल","link":"https://sports.ndtv.com/hindi/cricket/sarfaraz-khan-got-married-with-kashmir-girl-pic-and-videos-got-viral-wife-give-stiff-competition-to-bollywood-actresses-in-beauty-4274965#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"घरेलू क्रिकेट में हालिया सालों में जमकर रन बरसाने वाले सरफराज खान पिछले दिनों टेस्ट टीम में जगह न मिलने को लेकर चर्चा में रहे थे","content":"सरफराज खान अपने निकाह के दौरान मुंबई के क्रिकेटर सरफराज खान (Sarfarz Khan) ने जम्मू-कश्मीर के शोपियां जिले की एक लड़की से निकाह कर लिया है. वीडियो में इंडियन प्रीमियर लीग (IPL) में दिल्ली कैपिटल्स के लिए खेलने वाले सरफराज (Sarfaraz Khan got married) को अपने ससुराल में काली शेरवानी में देखा जा सकता है. खान ने एक स्थानीय पोर्टल के साथ बातचीत में कहा, ‘कश्मीर में शादी करना किस्मत में था.' घरेलू क्रिकेट पर अच्छा प्रदर्शन करने वाले इस बल्लेबाज ने कहा, ‘अगर अल्लाह की मर्जी हुई तो मैं एक दिन भारत के लिए जरूर खेलूंगा.' क्रिकेटर की एक झलक पाने के लिए बड़ी संख्या में प्रशंसक जमा हो गए. सरफराज के निकाह के वीडियो सामने आते ही ये बहुत ही तेजी से सोशल मीडिया पर वायरल हो गए. वीडियो में सरफराज को पत्नी अंगूठी पहनाते देखा जा सकता है *Star Indian Cricketer Sarfaraz Khan married in Pashpora Village of District Shopian* देखने में सरफराज की पत्नी किसी मॉडल सी लगती हैं Indian Cricketer sarfaraz Khan married in Pashpora Village of District Shopian, सरफराज खान को बधाई देने वालों की सोशल मीडिया पर बाढ़ सी आ गई है Wishing a happy married life for Sarfaraz Khan & his wife. Congratulations to both of them. आप जोड़े को देख सकते हैं Cricketer Sarfaraz Khan gets married in Kashmir!. Wishing Happy married life for Sarfaraz Khan and His wife. Congratulations Both of them!.. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-06 18:42:10","image_url":"https://c.ndtvimg.com/2023-08/2incel5g_sarfaraz-khan_625x300_07_August_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Now it’s your turn, you must come to Pakistan, says visiting Pakistan Hockey Team Assistant Coach Muhammad Saqlain","link":"https://www.livemint.com/sports/news/now-it-s-your-turn-you-must-come-to-pakistan-says-visiting-pakistan-hockey-team-assistant-coach-muhammad-saqlain-11691346488565.html","keywords":null,"creator":null,"video_url":null,"description":"Muhammad Saqlain said, ‘The main thing is continuity in the process. You will see the cricket team coming here, a football team already came here, and a hockey team is also here. Now it’s your turn, you must be come to Pakistan’","content":"Pakistan Hockey Team Assistant Coach Muhammad Saqlain Sunday expressed his desire that Indian teams should visit Pakistan to play matches. He said “India-Pakistan whenever they are playing they are unpredictable. All the crowd love to watch India vs Pakistan match.\" The Pakistan Hockey Team Assistant Coach said, \"The main thing is continuity in the process. You will see the cricket team coming here, a football team already came here, and a hockey team is also here. Now it’s your turn, you must be come to Pakistan.\" The Pakistan government is very positive to become close to the Indian government, he added Rehan Butt, Assistant coach of Pakistan also expressed his happiness to be in India. He said,\" It doesn't feel like we are in India. It feels like we are playing in Pakistan.\" Butt said Pakistan has always welcomed the decision to come to India. It is a positive decision taken by the Foreign Ministry of Pakistan to send the cricket team to India to play World Cup. Pakistan hockey player Abdul Rana said, “People want to see India and Pakistan playing against each other. So, these matches should happen and both teams should come and play in each other's country.\" “India is our neighborhood country and the love we get here in India is amazing. We do not get so much love anywhere,\" Rana added. Earlier on August 2, while talking with TOI, the Pakistan Hockey Team Assistant Coach said it is proud to play against India. “The crowd in India is always marvelous. We are 100% prepared for the take-off. We are always happy to be in India. The people here have very good hearts. Our hearts are also good. When there will be close hearts, there will be definitely more love,\" he said. “We always feel proud to play against India. It is not easy to play against the top-ranking team in the world. India is playing superb hockey in the world. In women side and men side, gradually they are growing up,\" he added.","pubDate":"2023-08-06 18:39:25","image_url":"https://www.livemint.com/lm-img/img/2023/08/06/1600x900/pakistan_1691346778442_1691346784428.JPG","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricketer Sarfaraz Khan Gets Married In Kashmir - See Pics","link":"https://sports.ndtv.com/cricket/cricketer-sarfaraz-khan-gets-married-in-kashmir-see-pics-4274822","keywords":null,"creator":null,"video_url":null,"description":"Several videos have surfaced on social media in which Sarfaraz Khan can be seen in a black sherwani at his in-laws' place.","content":"Mumbai cricketer Sarfaraz Khan has married a girl from Shopian district of Jammu and Kashmir. Several videos have surfaced on social media in which Khan, who plays for Delhi Capitals in the cash-rich IPL, can be seen in a black sherwani at his in-laws' place. Khan even did a tic-tac with a local portal in which he said it was his \"destiny to get married in Kashmir\". \"If the Almighty has destined, I will play for India one day,\" the cricketer, who has been scoring heavily on the domestic circuit, said. A lot of his fans were also seen thronging to get a glimpse of the cricketer. Wishing a happy married life for Sarfaraz Khan & his wife. Congratulations to both of them. pic.twitter.com/BqwXiGGWtd Sarfaraz was overlooked by the selectors for Team India's tour of West Indies. Sarfaraz Khan got married in Kashmir today! The marriage ceremony was held at his wife's place in Shopian pic.twitter.com/m7zTxxg1Ju Despite establishing himself as one of the most consistent batters in the domestic circuit, an India call up has eluded Sarfaraz for long. He scored 556 runs in six games at an average of 92.66 in the 2022-23 Ranji Trophy campaign with the help of three centuries. In the 2021-22 Ranji Trophy season, he had 982 runs at an average of 122.75. Taking to Twitter, former India batter Aakash Chopra slammed the selectors over Sarfaraz's non-selection and also questioned the \"sanctity of first class cricket\". \"Will Sarfraz be remembered as someone who scored a mountain of runs in First-Class cricket and still never got an opportunity to play for India?? I really hope that's not the case. And I hope that what more he needs to do to get picked is communicated to him. Otherwise...the sanctity of first-class cricket (the heart and soul of Indian cricket) will be lost,\" Chopra tweeted. (With PTI inputs)","pubDate":"2023-08-06 18:36:07","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"West Indies vs India: West Indies vs India, 2023 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-live-score-over-2nd-t20i-t20-16-20-updates-4274927","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between West Indies vs India from Providence Stadium, Guyana. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 18.5 overs, West Indies, chasing a target of 153, are 155/8. The live updates of West Indies vs India scorecard is also available. It is the perfect platform to follow your favourite teams in West Indies vs India, 2023. Keep a track on your favourite batsmen and bowlers through West Indies vs India, 2023 today match, ball by ball commentary, West Indies vs India, West Indies vs India live score, West Indies vs India scorecard. Follow the excitement of the West Indies vs India, 2023 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. That is it then from this game and for the first time since 2016, West Indies have beaten India in back-to-back T20I matches. Right then, two down, three more to go and the third T20I will be played at the same ground, the Providence Stadium in Guyana on Tuesday, the 8th of August. The action will begin at 8 pm IST (2.30 pm GMT) but you can join us for the build-up a lot earlier. Cheers! Rovman Powell, the skipper of West Indies informs that they are really in a good position. Says that it was always going to come down to how they bat against the spinners. Feels that they did great in the middle overs but lost their way by the end. States that left-handers have an advantage against wrist spinners and he is glad they have two great players in that role - Nicholas Pooran and Shimron Hetmyer and it's just that at least one of them has to play enough deliveries. Ends by praising Romario Shepherd for his bowling effort as well. Hardik Pandya, the captain of India says that in all honesty, the batting performance from them was under par and even though the wicket was on the slower side, they should have gotten to 160-170. On Nicholas Pooran, he says that it becomes difficult to rotate the spinners when he is hitting the ball like this but they did fight back well. Adds that the current combination that they have, they have to bat with 7 batters and need to trust the team and they need to figure out a way to get more contribution from the tailenders if required but the batters themselves need to take more responsibility. On Tilak Varma, he says that the way he has been batting gives them a solid option in the middle order, especially given that he is a left-hander. Nicholas Pooran wins the Player of the Match award. He starts by saying that he is satisfied with his performance. Mentions that the beauty of this game is that it isn't over until it is over. States that he does not feel that he is in his purple patch, since losing the captaincy he has started to look at the game from a different perspective and adds that all the hard work is paying off. Says that it is all about being positive and having the right energy. The Presentation ceremony... Earlier in the game, Hardik Pandya won the toss and opted to bat first on a pitch that did look a bit spin friendly. The Indian openers went hard at the bowling but Shubman Gill fell early followed by Suryakumar Yadav. Ishan Kishan and Tilak Varma led the fightback before Kishan too got out and after that, there was simply no one to stick around with Varma. Varma did bring up his maiden T20I fifty and a couple of lusty blows from the tailenders took India to over 150. As for the Windies' bowlers, they were pretty good for most of the innings with Akeal Hosein and Alzarri Joseph picking up a couple of wickets while remaining economical. Coming to the chase, it swung from one end to the other but eventually, the hosts managed to get over the line. India will have a lot of mixed emotions at the moment but it is another defeat for them and yet another sub-par display. Skipper Hardik Pandya took the new ball and gave his side a dream start with a double breakthrough in the very first over. But, the visitors did bowl a couple of really expensive overs and got the opposition to get well ahead of the required rate. They seemed to have no answer for Nicholas Pooran and due to this, Axar Patel wasn't even used. They did however get back into the game with a plethora of wickets thanks mainly to the leg-spin duo of Yuzvendra Chahal and Ravi Bishnoi but the pacers simply didn't back it up at the backend of the chase. India now face an uphill task of winning three games in a row to clinch the series. After another solid display with the ball, West Indies got off to a poor start with the bat with Brandon King and Johnson Charles both falling in the first over. There was a counterpunch from Kyle Mayers but he too got out leaving the hosts 32/3. Then came the 57-run stand between skipper Rovman Powell and Nicholas Pooran with the latter in sensational hitting form. This partnership turned the game on its head and at one point they were 126/4 with Pooran spitting fire. This however soon became 129/8 and at that point, the hosts looked down and out. Luckily for them, the pair of Akeal Hosein and Alzarri Joseph came clutch and managed to take the side home with 7 balls to spare. Pheww, that was a humdinger! West Indies have gone from cruising to victory to throwing it all away to just about scraping over the line and they will be mightily relieved. The hosts go 2-0 up in the five-match T20I series, just one game away from sealing the series. 18.5 overs (4 Runs) FOUR! Here are the winning runs. Akeal Hosein takes his side over the line here. An all-round performance from the spinner. Mukesh Kumar pitches it up, on off. Akeal Hosein drills it down the park for a cracking boundary. West Indies win the match by 2 wickets. 18.4 overs (2 Runs) A length ball, on off. Akeal Hosein lofts it over mid on. They take two runs. 18.3 overs (1 Run) A yorker-length delivery, on off. Joseph jams it out to long on for a single. 18.2 overs (6 Runs) SIX! GONE! India in a spot of bother. Back of a length, outside off. Alzarri Joseph stands tall and dispatches it towards deep mid-wicket. The ball has enough in it to lands on the advertising cushions of the boundary ropes. 18.1 overs (1 Run) A length ball, wide of off. Akeal Hosein stays back and punches it to deep point for a single. India need a wicket and that too in this over. 17.6 overs (1 Run) A single now to end the over! 12 needed off 12 now. A slower bumper, outside off. Akeal Hosein knocks it to deep point for one. 17.5 overs (1 Run) Alzarri Joseph now flicks this full ball in front of long on and takes a single. 17.4 overs (2 Runs) A length ball, on fourth stump. Alzarri Joseph lofts it over mid off. The batters take two runs. This is really good running. 17.3 overs (0 Run) Fuller, angled into the pads. Alzarri Joseph clips it into mid-wicket. 17.2 overs (1 Run) Back of a length, on off, moving away. It goes down to third man off the outside edge. One taken. 17.1 overs (4 Runs) FOUR! A much-needed boundary for the hosts. Akeal Hosein is capable enough of putting the ball out of the park, and this boundary can act as a confidence booster for the spinner. An outswinger, full and wide outside off. Akeal Hosein reaches out. uses the pace of the ball and squeezes it out to deep point for four runs. 16.6 overs (0 Run) Two dots in a row to end the over! Back of a length, outside off, swinging away. Alzarri Joseph tries to chase it but gets beaten in the process. 16.5 overs (0 Run) A dot now! An inswinger, full and on off. Alzarri Joseph pushes it into covers. 16.4 overs (1 Run) A length ball, angled across, outside off. Hosein gets an inside edge on it and works it down to fine leg for one. 16.3 overs (0 Run) A dot now! A loud appeal for lbw but turned down. Hardik Pandya goes for the review once again. It is a full-length delivery, on leg. Mukesh Kumar tries to flick it away but misses and gets pinged on his pads. UltraEdge shows no bat is involved. The Ball Tracking shows that the ball is pitching outside leg. The on-field decision stands and with that, India lose all their review. 16.2 overs (1 Run) LEG BYE! West Indies require a run a ball at this stage, so singles are still hurting the Indians here. Fuller, sliding down the leg side. Alzarri Joseph tries to flick it away but misses. It clips his pads and goes past the keeper. Chahal does well to stop it at short fine. They cross for a leg bye, there was a slight confusion amongst the batters as well but no damage done. 16.1 overs (1 Run) It is full and on off. Akeal Hosein drives it down to long off for a single. Alzarri Joseph walks out to bat now. 15.6 overs (0 Run) A loud appeal for lbw but turned down! Chahal is convinced and Hardik Pandya takes the review. It is tossed up, around off, the ball turns into the batter. Shimron Hetmyer tries to flick it away but misses and gets pinged on his pads. The umpire thinks it is going above the sticks and keeps his finger down. Thanks to the technology, India are able to get rid of Shimron Hetmyer now as the Ball Tracking shows three reds. And the suddenly, the floodgates have opened up here. Three wickets come in total in this over. India have the momentum on their side. 15.5 overs (1 Run) On the pads, clipped to deep square leg for one. Akeal Hosein is the next batter in. 15.4 overs (0 Run) OUT! STUMPED! Yuzvendra Chahal now picks up his first wicket of the match and it could've have come at any better time than this. A leg spinner, around off. Jason Holder leans forward and tries to defend it out but misses. The ball zips past the outside edge. Ishan Kishan gathers the ball quickly and takes the bails off in a jiffy. The umpire takes it upstairs to confirm and the third umpire informs that Jason Holder has no part of his leg behind the popping crease. 15.3 overs (0 Run) On the pads, Holder clips it into the leg side. 15.2 overs (0 Run) It is drifted in, on off. The ball grips and turns away. Jason Holder is beaten here. 15.1 overs (1 Run) OUT! RUN OUT! Another one bites the dust. There is still some hope for India. It is looped up, on the pads. Shimron Hetmyer flicks it to deep mid-wicket. The batters push hard for the first one, they are surely looking for the second run here. Romario Shepherd is quick to turn and is committed on the bases of the call, but Shimron Hetmyer denies him then which leaves him hanging in the middle of the pitch. Axar Patel throws is to the keeper, who makes no mistake. Jason Holder is the new man in.","pubDate":"2023-08-06 18:34:26","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs West Indies Highlights, 2nd T20I: Windies take 2-0 lead with 2-wicket victory","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-highlights-2nd-t20i-windies-take-2-0-lead-with-2-wicket-victory-12965032.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs West Indies Highlights, 2nd T20I: Windies take 2-0 lead with 2-wicket victory","content":"Cricket India vs West Indies Highlights, 2nd T20I: Windies take 2-0 lead with 2-wicket victory IND vs WI 2nd T20I Highlights: After restricting Hardik Pandya and Co to 152/7, West Indies completed the chase inside 19 overs with Nicholas Pooran smashing 67 off 40 balls to take a 2-0 lead in the five-match series. FirstCricket Staff Last Updated:August 06, 2023 23:57:16 IST India vs West Indies 2nd T20 LIVE Cricket Score, Commentary, Updates. AP FP commentary Quick Scorecard Full scorecard Ball by ball commentary West Indies Vs India At Providence Stadium, Guyana, 06 August, 2023 06 August, 2023 Starts 20:00 (IST) Match Ended India 152/7 (20.0 ov) 2nd T20I West Indies 155/8 (18.5 ov) West Indies beat India by 2 wickets India vs West Indies 2nd T20I LIVE Score: India will look to bounce back in the five-match T20I series with a victory in the second match on Sunday after losing the first game by a narrow margin of just four runs. Despite restricting West Indies to 149/6 in the first innings, India struggled in the chase as they lost wickets regularly. With Axar Patel getting out on the first ball of the 18th over, the tailenders were left to complete the task in the last 11 balls when 21 was still required and India’s innings was restricted to 145/9. Kuldeep Yadav was India’s No 8 and a long tail did not work in India’s favour in the first T20I. India captain Hardik Pandya may look to sort out the issue in the second T20I but with both the all-rounders Hardik and Axar Patel already part of the playing XI, India don’t have much choice other than dropping a blower. Related Articles India need to get West Indies all out as soon as possible: Zaheer Khan India vs West Indies: Yashasvi Jaiswal, Ishan Kishan the biggest gains as IND fail to bag full WTC points If they do drop a pure bowler, their bowling options come down to just five which is also not an ideal scenario. In such a case India may look to give debut to Yashasvi Jasiwal and push Ishan Kishan to No 3 from the opening slot. That way Hardik could also be pushed down in the batting order to finish off the chase. If this happens Sanju Samson could be the casualty from the playing XI. It’s also possible that India may continue with the same playing XI as they look to sort out the combinations before the 2024 T20 World Cup. Whatever happens, India definitely need to change their batting approach. The openers were took cautious and a different approach would work better for them in the second T20I. IND vs WI LIVE Streaming: The second T20I between India and West Indies will be telecast LIVE across the Doordarshan Network, including DD National and DD Sports. The match will also be LIVE streamed on Fancode and JioCinema. You can also follow LIVE scores on Firstpost.com . Squads India: Ishan Kishan, Shubman Gill, Suryakumar Yadav, Tilak Varma, Hardik Pandya, Sanju Samson, Axar Patel, Kuldeep Yadav, Arshdeep Singh, Yuzvendra Chahal, Mukesh Kumar, Yashasvi Jaiswal, Ravi Bishnoi, Umran Malik, Avesh Khan West Indies: Brandon King, Kyle Mayers, Johnson Charles, Nicholas Pooran, Rovman Powell, Shimron Hetmyer, Romario Shepherd, Jason Holder, Akeal Hosein, Alzarri Joseph, Obed McCoy, Shai Hope, Roston Chase, Oshane Thomas, Odean Smith Published on: August 06, 2023 19:29:38 IST Tags: Cricket India Vs West Indies","pubDate":"2023-08-06 18:27:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/India-vs-West-Indies-2nd-T20-LIVE.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"2nd T20I: Pooran Guides Windies To 2-0 Lead Over India In 5-Match Series","link":"https://sports.ndtv.com/cricket/ind-vs-wi-2nd-t20i-nicholas-pooran-guides-west-indies-to-2-0-lead-over-india-in-five-match-series-4274998","keywords":null,"creator":null,"video_url":null,"description":"West Indies beat India by two wickets in the second T20I to take a 2-0 lead in the five-match series in Guyana on Sunday.","content":"An explosive half-century by Nicholas Pooran defied a brilliant power-play spell by Indian skipper Hardik Pandya and some brilliant bowling in death overs as the hosts West Indies secured a hard-fought two-wicket win over the Men in Blue in the second T20I of the five-match series at Guyana on Sunday. India trails by 2-0 in the series. In the chase of 152, West Indies was off to a nightmarish start when Hardik Pandya got rid of Brandon King (0) and Johnson Charles (2) in the first over itself. WI was restricted to 2/2 in the first over itself. Suryakumar took a stunner of a catch to dismiss King while Charles was caught by Tilak Varma at cover point. Kyle Mayers joined forces with Nicholas Pooran to rebuild the Windies innings. In the third over, Pooran smashed Pandya for 17 runs, including two fours and a six. Arshdeep's next over went for 12 runs though he trapped Kyle Mayers lbw for 15. WI was at 32/3 in 3.4 overs. Pooran helped WI finish off their powerplay on a high, smashing Ravi Bishnoi for 18 runs, including three fours and a six. After six overs, WI was at 61/3, with Pooran (42*) and skipper Rovman Powell (2*) unbeaten. WI had reached the 50-run mark in 5.2 overs. The 57-run stand between Pooran-Powell was ended by Pandya after a diving catch from Mukesh Kumar at third man to send back the WI skipper for 21 off 19 balls. WI was 89/4 in 9.5 overs. WI ended their 10 overs at 91/4, with Pooran (50*) having reached his fifty in 29 balls and joined by Shimron Hetmyer (2*). WI reached the 100-run mark in 11.3 overs and match looked done and dusted at that point. A delivery by Mukesh helped dismiss Pooran, with the help of Samson's safe hands at the cover point. The bowler ended Pooran's knock at 67 in 40 balls, with six fours and four sixes. WI was 126/5 in 14 overs. Advertisement India made a comeback into the match with two quick wickets. First was Romario Shepherd being run out for zero. Later three balls later, Jason Holder was stumped by Ishan Kishan for a duck, giving Yuzvendra Chahal his first wicket. WI was at 128/7 in 15.4 overs. Chahal's golden arm did its magic on the final ball of the over, sending back a dangerous Hetmyer for 22 off 22 balls after he was trapped lbw. WI was 129/8 in 16 overs. The 18th over by Arshdeep released some pressure, giving away nine runs and leaving the hosts with 12 to chase in 12 balls. But a single by Akael Hosein and then a six by Alzarri Joseph left Windies with just five to chase in 10 balls. Akael hit the winning runs and WI won by two wickets with more than an over left. Hardik (3/35) and Chahal (2/19) were impressive with the ball. Arshdeep and Mukesh got one wicket each. Earlier, Tilak Varma's gutsy half-century was the highlight of yet another disappointing show by Indian batters as West Indies restricted the visitors to just 151/7 in their 20 overs in the second T20I of the five-match series at Guyana on Sunday. After electing to bat first, openers Ishan Kishan and Shubman Gill once again failed to give a solid start to the Men in Blue. Though both smashed a six each to make their attacking intentions clear, Gill's sub-par form in T20Is continued. After hitting Alzarri Joseph for a six in the third over, ball four, Shubman went for another big hit on the next one. But the mistimed hit landed straight into the hands of Shimron Hetmyer at the backward point. Gill was out for seven. India was at 16/1 in 2.5 overs. Suryakumar Yadav, playing his 50th T20I match for India, also failed to make an impact as he was run out for just one run off three balls by Kyle Mayers, leaving India at 18/2 in 3.3 overs. Kishan joined forces with Tilak Varma to carry India through the remainder of the powerplay without any loss of wicket, with Kishan (14*) and Tilak (9*) unbeaten and India at 34/2 in six overs. India reached the 50-run mark in 8.1 overs. The budding partnership between these two left-handers was cut short at 42 runs after Romario Shepherd cleaned up Kishan for 27 off 23 balls, consisting of two fours and two sixes, leaving India at 60/3 in 9.3 overs. At the end of 10 overs, India was at 65/3, with Sanju Samson (5*) and Tilak (20*) unbeaten. In the 11th over end, Tilak gave India some momentum with two back-to-back boundaries against Jason Holder. Samson's disappointing run in T20Is continued, dismissed for seven by Akael Hosein after being stumped by Nicholas Pooran. India was 76/4. Hardik Pandya, the skipper joined Tilak, who was batting beautifully, sweeping and smashing every wrong ball. India reached the 100-run mark in 14.2 overs. Tilak reached his maiden half-century in 39 balls, consisting of five fours and a six. India was 106/4 in 15 overs, with Tilak (50*) and Pandya (8*) unbeaten. Tilak's knock of 51 ended in 41 balls, he was caught by McCoy and Akael got his second wicket. India is 114/5 in 15.5 overs. Hardik and Axar seemed to be building a partnership, but Alzarri ended it as Pandya was clean-bowled for 24 off 18. India was 129/6 in 18 overs. Axar Patel's disappointing run with the bat continued as a poorly-timed shot landed into Pooran's hands. He was gone for 14 off 12 balls and Shepherd took his second wicket. India was 139/7 in 19.1 overs. India finished at 151/7 in 20 overs, with Arshdeep Singh (5*) and Ravi Bishnoi (8*) unbeaten. Alzarri (2/28), Romario (2/28) and Akael (2/29) took two wickets each for Windies. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-08-06 18:25:02","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Pakistan cricket team gets government clearance for World Cup in India","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-cricket-team-gets-government-clearance-for-world-cup-in-india-12965432.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan cricket team gets government clearance for World Cup in India","content":"Cricket Pakistan cricket team gets government clearance for World Cup in India Despite the green light, Pakistan said that it has 'deep concerns' about the security of the cricket team and it would relay them to ICC and the Indian authorities. FirstCricket Staff Last Updated:August 06, 2023 23:45:25 IST Pakistan cricket team has received the necessary clearance to travel to India for the cricket World Cup. Reuters The Pakistan cricket team will be travelling to India for the ICC ODI World Cup 2023, it was confirmed on Sunday after the Pakistan government gave clearance to the national side for the mega event. The ODI World Cup 2023 will be taking place in India from 5 October to 19 November and Pakistan are scheduled to play India at the Narendra Modi Stadium in Ahmedabad on 15 October. The date of the match is set to be shifted to 14 October due to security issues in the city as the start of Navratri also falls on 15 October but the same is still to be confirmed by the ICC. Confirming Pakistan’s participation in a press release, the foreign ministry said that sports should not be mixed with politics. Related Articles ICC ODI World Cup 2023: Pakistan cricket team awaits green light for travelling to India ODI World Cup 2023: ICC inspects venues at Bengaluru, Chennai, Thiruvananthapuram and Mumbai “Pakistan believes that the state of bilateral relations with India should not stand in the way of fulfilling its international sports-related obligations,” the foreign ministry release said. The foreign ministry also added that despite giving a green light to the team, Pakistan has “deep concerns” about the security of the cricket team and it would relay them to ICC and the Indian authorities. “Pakistan, however, has deep concerns about the security of its cricket team. We are conveying these concerns to the International Cricket Council and the Indian authorities. “We expect that the full safety and security of the Pakistan cricket team will be ensured during its visit to India,” the release said. The Pakistan government’s latest decision brings an end to the long drawn saga which began last year after former Pakistan Cricket Board (PCB) chief Ramiz Raja said that the national team would not travel to India if Men in Blue don’t travel to Pakistan for the Asia Cup 2023. Asia Cup 2023 will be played on a hybrid mode in August-September with India playing their matches in Sri Lanka. Published on: August 06, 2023 23:45:25 IST Tags: Cricket Pakistan Cricket Team World Cup 2023","pubDate":"2023-08-06 18:15:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/Pakistan-cricket-team1.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI: 6 गेंद में 3 विकेट, युजवेंद्र चहल के आगे कांप गए थे वेस्टइंडीज के बल्लेबाज, फिर भी भारत को मिली हार","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-wi-three-wickets-in-six-balls-west-indies-batsmen-were-trembling-against-yuzvendra-chahal-yet-india-got-defeated/articleshow/102479959.cms","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI, 2nd T20I: पांच टी20 मैचों की सीरीज के दूसरे मुकाबले में स्पिनर गेंदबाज युजवेंद्र चहल ने शानदार गेंदबाजी का प्रदर्शन करते हुए एक ही ओवर में मैच को भारत की तरफ मोड़ दिया। इस कारण टीम इंडिया ने सीरीज में 1-1 की बराबरी कर ली।","content":"पांच वनडे मैचों की सीरीज के दूसरे मुकाबले में भी भारतीय टीम को करारी हार मिली थी। दूसरे टी20 में वेस्टइंडीज ने भारत को 2 विकेट से हरा दिया। इस मैच में टीम इंडिया के कप्तान हार्दिक पंड्या ने टॉस जीतकर पहले गेंदबाजी का फैसला किया था लेकिन वह 20 ओवर में सिर्फ 152 रन का ही स्कोर खड़ा कर पाई। इसके जवाब में वेस्टइंडीज ने 7 गेंद शेष रहते ही लक्ष्य को हासिल कर लिया। वेस्टइंडीज के खिलाफ इस मुकाबले में गेंदबाजी में युजवेंद्र चहल ने कमाल का खेल दिखाया। चहल ने पारी के 16वें ओवर में मैच को पूरी तरह भारत की तरफ मोड़ दिया था। चहल के इस ओवर में टीम इंडिया को तीन बड़ी सफलताएं मिली थी लेकिन इसके बावजूद टीम इंडिया मैच को नहीं जीत पाई। चहल के इस ओवर की पहली गेंद पर शिमरन हेटमायर ने एक सिंगल चुराने का प्रयास किया लेकिन अक्सर पटेल के शानदार थ्रो से रोमारियो शेफर्ड रन आउट हो गए। चहल के इसी ओवर में जेसन होल्डर को ईशान किशन स्टंप आउट किया। इन दो विकेट के बाद ऐसा लगा कि भारतीय टीम ने मैच को अपने पक्ष में कर लिया है और ऐसा हुआ भी। क्योंकि पारी की आखिरी गेंद पर चहल ने हेटमायर को भी एलबीडबल्यू कर दिया। इस तरह चहल के 6 गेंद में भारत को तीन सफलताएं मिल जिसके कारण वेस्टइंडीज हार लगभग तय हो गई थी। हालांकि इसके बाद अकिल होसैन और अल्जारी जोसेफ ने मोर्चा संभाल लिया और नाबाद रहते हुए अपनी टीम को 2 विकेट से जीत दिला दी। अकील होसैन ने 10 गेंद में 16 रनों की पारी खेली जबकि अल्जारी जोसेफ ने 8 गेंद में 10 रन बनाकर नाबाद रहे। इस तरह वेस्टइंडीज की टीम ने पांच मैचों की इस सीरीज में 2-0 की बढ़त बना ली है। वेस्टइंडीज के खिलाफ इस मुकाबले में भारतीय टीम की बल्लेबाजी बुरी तरह फ्लॉप रही। टॉप ऑर्डर में शुभमन गिल, ईशान किशन, सूर्यकुमार यादव और संजू सैमसन ने पूरी तरह से निराश किया। हालांकि तिलक वर्मा ने जरूर 51 रनों की पारी खेली। इसके अलावा और कोई बल्लेबाज कमाल नहीं दिखा सके जिसके कारण भारत 20 ओवर में सिर्फ 152 रन का स्कोर ही खड़ा कर सकी।","pubDate":"2023-08-06 23:30:00","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Surrey slam ‘ludicrous’ claims over Ashes ball change after Australia complaints","link":"https://www.standard.co.uk/sport/cricket/ashes-ball-change-controversy-surrey-b1098965.html","keywords":["Cricket","Sport"],"creator":["Press Association"],"video_url":null,"description":"Surrey have rejected the “ludicrous” claim that an old Dukes ball could have been used in the final Ashes Test at the Kia Oval.","content":"have rejected the “ludicrous” claim that an old Dukes ball could have been used in the final Test at the Kia Oval. were able to win the fifth Test by 49 runs to level the series at 2-2 but the Australian press coverage in the immediate days after last Monday's dramatic finale was dominated by ‘ballgate’ with among a number of current and former players to discuss the subject. Khawaja and fellow opener David Warner were well set on day four in an unbroken century stand when the former was struck on the helmet by a bouncer, which resulted in a change to the Dukes ball being used. Dilip Jajodia, the owner of Dukes Cricket Balls, has vowed to launch an investigation after he added to speculation that a ball from a previous batch could have been used, not a ball from the 2023 batch. A Surrey spokesperson told the PA news agency: “Mr Jajodia is correct to say that Duke's balls are supplied to the Oval and to Surrey CCC ahead of the season for use in matches and training. These balls can also be used as match replacements, as seen during the Test. SPONSORED “There were a wide selection of balls available to the umpire's at all times, with a variety of conditions to choose from, and that decision is entirely at their discretion. “We reject entirely the assertion that a ball from 2018 or 2019 could have been available for selection and think the suggestion itself is ludicrous.” Jajodia, in an interview with News Corp, explained how every ball produced for a specific season has the date stamped on it and while “it's not likely”, he admitted a ball from a different year could have been behind the changed ball on day four, producing more swing and seam movement. “I can't imagine they would risk putting a ball in there with a different date on it. Frankly, the match referee should be on top of it,\" Jajodia said of Surrey, via Wisden.com. “We do bang that number in quite hard, so even if the gold comes off, the ball is imprinted. It wouldn't be easy to get rid of it. I'm not saying it's impossible (that it was a 2018 or 2019 ball), but it's not likely. “I'm going to investigate myself because it affects me. My name is at stake so it's important they don't misallege something was wrong with the ball.”","pubDate":"2023-08-06 20:01:17","image_url":"https://static.standard.co.uk/2023/08/06/19/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Southby shines as Brave beat Superchargers before Fire edge Invincibles","link":"https://www.skysports.com/cricket/news/12040/12934850/the-hundred-rhianna-southby-shines-as-southern-brave-beat-northern-superchargers","keywords":null,"creator":null,"video_url":null,"description":"Rhianna Southby put on a sensational wicketkeeping display as Southern Brave Women returned to winning ways with a five-wicket victory over Northern Superchargers in The Hundred.","content":"Rhianna Southby put on a sensational wicketkeeping display as Southern Brave Women returned to winning ways with a five-wicket victory over Northern Superchargers in The Hundred. Southby affected a Hundred record four wickets - two catches and two stumpings - in her second match in front of an Ageas Bowl record 9,813 crowd. The soon-to-retire Anya Shrubsole starred with two wickets, dismissing overseas duo Jemimah Rodrigues (India) and Phoebe Litchfield (Australia) for six and nought respectively before Georgia Adams bagged 3-21 as Superchargers were restricted to 100-8. Please use Chrome browser for a more accessible video player Southby caught Litchfield and Alice Davidson-Richards (5) brilliantly and also stumped Superchargers skipper Hollie Armitage (21) and top-scorer Marie Kelly (39). Maia Bouchier took control of the chase with 31 off 28 balls as Brave eased to their target with 13 balls to spare to make it two wins from three and leave Superchargers with one victory and one loss from their two matches. Brave opener Danni Wyatt (20 off 18) initially looked the most fluent batter on display, with five sweetly-struck boundaries inside the first 15 balls, but came unstuck when she drilled Kate Cross to point. In the day's second women's match, two-time champions Oval Invincibles were skittled for just 80 as they lost a nervy game to new table-toppers Welsh Fire by three wickets. A white-ball bonanza: How the rest of England's year looks The Hundred - latest standings The Hundred - latest video The Hundred homepage Please use Chrome browser for a more accessible video player Invincibles opener Lauren Winfield-Hill (42 off 35 balls) hit over half of her side's runs with their next highest scorers making seven in No 10 Seren Smale and No 11 Lizzie Scott. Invincibles plummeted to 55-9 in 75 balls as Shabnim Ismail took three wickets and Georgia Elwiss and Alex Griffiths bagged two each, before Winfield-Hill added 25 with last woman Scott. Fire experienced jitters in the chase, losing openers Tammy Beaumont and Hayley Matthews for ducks as they slipped to 5-2 and then twice losing two wickets in as many balls as they plummeted to 49-4 and 69-6, with Invincibles' South African seamer Marizanne Kapp striking four times. Freya Davies then departed with four runs required but Sarah Bryce (9no) and Griffiths (4no) took Fire over the line after vital earlier contributions from Sophia Dunkley (28) and Elwiss (33). Fire have two wins and a washout from their opening three fixtures, while Invincibles are still seeking a first victory with this defeat at The Kia Oval following an abandoned game against London Spirit. Monday's matches in The Hundred come from Emirates Old Trafford as Manchester Originals take on Birmingham Phoenix . The women's game starts at 3pm with the men then under way at 6.30pm. There will be a 30-minute build-up to both games on Sky Sports Cricket. Sky Sports will show all 68 games in The Hundred live this summer. Stream The Hundred for £26 a month and more with NOW","pubDate":"2023-08-06 19:00:00","image_url":"https://e1.365dm.com/23/08/1920x1080/skysports-mary-taylor-the-hundred_6237443.jpg?20230806141517","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"सरफराज खान ने कश्मीर गर्ल से किया निकाह, सुंदरता में देती हैं बॉलीवुड हीरोइनों को टक्कर, तस्वीरें हुई वायरल","link":"https://sports.ndtv.com/hindi/cricket/sarfaraz-khan-got-married-with-kashmir-girl-pic-and-videos-got-viral-wife-give-stiff-competition-to-bollywood-actresses-in-beauty-4274965#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"घरेलू क्रिकेट में हालिया सालों में जमकर रन बरसाने वाले सरफराज खान पिछले दिनों टेस्ट टीम में जगह न मिलने को लेकर चर्चा में रहे थे","content":"सरफराज खान अपने निकाह के दौरान मुंबई के क्रिकेटर सरफराज खान (Sarfarz Khan) ने जम्मू-कश्मीर के शोपियां जिले की एक लड़की से निकाह कर लिया है. वीडियो में इंडियन प्रीमियर लीग (IPL) में दिल्ली कैपिटल्स के लिए खेलने वाले सरफराज (Sarfaraz Khan got married) को अपने ससुराल में काली शेरवानी में देखा जा सकता है. खान ने एक स्थानीय पोर्टल के साथ बातचीत में कहा, ‘कश्मीर में शादी करना किस्मत में था.' घरेलू क्रिकेट पर अच्छा प्रदर्शन करने वाले इस बल्लेबाज ने कहा, ‘अगर अल्लाह की मर्जी हुई तो मैं एक दिन भारत के लिए जरूर खेलूंगा.' क्रिकेटर की एक झलक पाने के लिए बड़ी संख्या में प्रशंसक जमा हो गए. सरफराज के निकाह के वीडियो सामने आते ही ये बहुत ही तेजी से सोशल मीडिया पर वायरल हो गए. वीडियो में सरफराज को पत्नी अंगूठी पहनाते देखा जा सकता है *Star Indian Cricketer Sarfaraz Khan married in Pashpora Village of District Shopian* देखने में सरफराज की पत्नी किसी मॉडल सी लगती हैं Indian Cricketer sarfaraz Khan married in Pashpora Village of District Shopian, सरफराज खान को बधाई देने वालों की सोशल मीडिया पर बाढ़ सी आ गई है Wishing a happy married life for Sarfaraz Khan & his wife. Congratulations to both of them. आप जोड़े को देख सकते हैं Cricketer Sarfaraz Khan gets married in Kashmir!. Wishing Happy married life for Sarfaraz Khan and His wife. Congratulations Both of them!.. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-06 18:42:10","image_url":"https://c.ndtvimg.com/2023-08/2incel5g_sarfaraz-khan_625x300_07_August_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Now it’s your turn, you must come to Pakistan, says visiting Pakistan Hockey Team Assistant Coach Muhammad Saqlain","link":"https://www.livemint.com/sports/news/now-it-s-your-turn-you-must-come-to-pakistan-says-visiting-pakistan-hockey-team-assistant-coach-muhammad-saqlain-11691346488565.html","keywords":null,"creator":null,"video_url":null,"description":"Muhammad Saqlain said, ‘The main thing is continuity in the process. You will see the cricket team coming here, a football team already came here, and a hockey team is also here. Now it’s your turn, you must be come to Pakistan’","content":"Pakistan Hockey Team Assistant Coach Muhammad Saqlain Sunday expressed his desire that Indian teams should visit Pakistan to play matches. He said “India-Pakistan whenever they are playing they are unpredictable. All the crowd love to watch India vs Pakistan match.\" The Pakistan Hockey Team Assistant Coach said, \"The main thing is continuity in the process. You will see the cricket team coming here, a football team already came here, and a hockey team is also here. Now it’s your turn, you must be come to Pakistan.\" The Pakistan government is very positive to become close to the Indian government, he added Rehan Butt, Assistant coach of Pakistan also expressed his happiness to be in India. He said,\" It doesn't feel like we are in India. It feels like we are playing in Pakistan.\" Butt said Pakistan has always welcomed the decision to come to India. It is a positive decision taken by the Foreign Ministry of Pakistan to send the cricket team to India to play World Cup. Pakistan hockey player Abdul Rana said, “People want to see India and Pakistan playing against each other. So, these matches should happen and both teams should come and play in each other's country.\" “India is our neighborhood country and the love we get here in India is amazing. We do not get so much love anywhere,\" Rana added. Earlier on August 2, while talking with TOI, the Pakistan Hockey Team Assistant Coach said it is proud to play against India. “The crowd in India is always marvelous. We are 100% prepared for the take-off. We are always happy to be in India. The people here have very good hearts. Our hearts are also good. When there will be close hearts, there will be definitely more love,\" he said. “We always feel proud to play against India. It is not easy to play against the top-ranking team in the world. India is playing superb hockey in the world. In women side and men side, gradually they are growing up,\" he added.","pubDate":"2023-08-06 18:39:25","image_url":"https://www.livemint.com/lm-img/img/2023/08/06/1600x900/pakistan_1691346778442_1691346784428.JPG","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricketer Sarfaraz Khan Gets Married In Kashmir - See Pics","link":"https://sports.ndtv.com/cricket/cricketer-sarfaraz-khan-gets-married-in-kashmir-see-pics-4274822","keywords":null,"creator":null,"video_url":null,"description":"Several videos have surfaced on social media in which Sarfaraz Khan can be seen in a black sherwani at his in-laws' place.","content":"Mumbai cricketer Sarfaraz Khan has married a girl from Shopian district of Jammu and Kashmir. Several videos have surfaced on social media in which Khan, who plays for Delhi Capitals in the cash-rich IPL, can be seen in a black sherwani at his in-laws' place. Khan even did a tic-tac with a local portal in which he said it was his \"destiny to get married in Kashmir\". \"If the Almighty has destined, I will play for India one day,\" the cricketer, who has been scoring heavily on the domestic circuit, said. A lot of his fans were also seen thronging to get a glimpse of the cricketer. Wishing a happy married life for Sarfaraz Khan & his wife. Congratulations to both of them. pic.twitter.com/BqwXiGGWtd Sarfaraz was overlooked by the selectors for Team India's tour of West Indies. Sarfaraz Khan got married in Kashmir today! The marriage ceremony was held at his wife's place in Shopian pic.twitter.com/m7zTxxg1Ju Despite establishing himself as one of the most consistent batters in the domestic circuit, an India call up has eluded Sarfaraz for long. He scored 556 runs in six games at an average of 92.66 in the 2022-23 Ranji Trophy campaign with the help of three centuries. In the 2021-22 Ranji Trophy season, he had 982 runs at an average of 122.75. Taking to Twitter, former India batter Aakash Chopra slammed the selectors over Sarfaraz's non-selection and also questioned the \"sanctity of first class cricket\". \"Will Sarfraz be remembered as someone who scored a mountain of runs in First-Class cricket and still never got an opportunity to play for India?? I really hope that's not the case. And I hope that what more he needs to do to get picked is communicated to him. Otherwise...the sanctity of first-class cricket (the heart and soul of Indian cricket) will be lost,\" Chopra tweeted. (With PTI inputs)","pubDate":"2023-08-06 18:36:07","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"West Indies vs India: West Indies vs India, 2023 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-live-score-over-2nd-t20i-t20-16-20-updates-4274927","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between West Indies vs India from Providence Stadium, Guyana. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 18.5 overs, West Indies, chasing a target of 153, are 155/8. The live updates of West Indies vs India scorecard is also available. It is the perfect platform to follow your favourite teams in West Indies vs India, 2023. Keep a track on your favourite batsmen and bowlers through West Indies vs India, 2023 today match, ball by ball commentary, West Indies vs India, West Indies vs India live score, West Indies vs India scorecard. Follow the excitement of the West Indies vs India, 2023 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. That is it then from this game and for the first time since 2016, West Indies have beaten India in back-to-back T20I matches. Right then, two down, three more to go and the third T20I will be played at the same ground, the Providence Stadium in Guyana on Tuesday, the 8th of August. The action will begin at 8 pm IST (2.30 pm GMT) but you can join us for the build-up a lot earlier. Cheers! Rovman Powell, the skipper of West Indies informs that they are really in a good position. Says that it was always going to come down to how they bat against the spinners. Feels that they did great in the middle overs but lost their way by the end. States that left-handers have an advantage against wrist spinners and he is glad they have two great players in that role - Nicholas Pooran and Shimron Hetmyer and it's just that at least one of them has to play enough deliveries. Ends by praising Romario Shepherd for his bowling effort as well. Hardik Pandya, the captain of India says that in all honesty, the batting performance from them was under par and even though the wicket was on the slower side, they should have gotten to 160-170. On Nicholas Pooran, he says that it becomes difficult to rotate the spinners when he is hitting the ball like this but they did fight back well. Adds that the current combination that they have, they have to bat with 7 batters and need to trust the team and they need to figure out a way to get more contribution from the tailenders if required but the batters themselves need to take more responsibility. On Tilak Varma, he says that the way he has been batting gives them a solid option in the middle order, especially given that he is a left-hander. Nicholas Pooran wins the Player of the Match award. He starts by saying that he is satisfied with his performance. Mentions that the beauty of this game is that it isn't over until it is over. States that he does not feel that he is in his purple patch, since losing the captaincy he has started to look at the game from a different perspective and adds that all the hard work is paying off. Says that it is all about being positive and having the right energy. The Presentation ceremony... Earlier in the game, Hardik Pandya won the toss and opted to bat first on a pitch that did look a bit spin friendly. The Indian openers went hard at the bowling but Shubman Gill fell early followed by Suryakumar Yadav. Ishan Kishan and Tilak Varma led the fightback before Kishan too got out and after that, there was simply no one to stick around with Varma. Varma did bring up his maiden T20I fifty and a couple of lusty blows from the tailenders took India to over 150. As for the Windies' bowlers, they were pretty good for most of the innings with Akeal Hosein and Alzarri Joseph picking up a couple of wickets while remaining economical. Coming to the chase, it swung from one end to the other but eventually, the hosts managed to get over the line. India will have a lot of mixed emotions at the moment but it is another defeat for them and yet another sub-par display. Skipper Hardik Pandya took the new ball and gave his side a dream start with a double breakthrough in the very first over. But, the visitors did bowl a couple of really expensive overs and got the opposition to get well ahead of the required rate. They seemed to have no answer for Nicholas Pooran and due to this, Axar Patel wasn't even used. They did however get back into the game with a plethora of wickets thanks mainly to the leg-spin duo of Yuzvendra Chahal and Ravi Bishnoi but the pacers simply didn't back it up at the backend of the chase. India now face an uphill task of winning three games in a row to clinch the series. After another solid display with the ball, West Indies got off to a poor start with the bat with Brandon King and Johnson Charles both falling in the first over. There was a counterpunch from Kyle Mayers but he too got out leaving the hosts 32/3. Then came the 57-run stand between skipper Rovman Powell and Nicholas Pooran with the latter in sensational hitting form. This partnership turned the game on its head and at one point they were 126/4 with Pooran spitting fire. This however soon became 129/8 and at that point, the hosts looked down and out. Luckily for them, the pair of Akeal Hosein and Alzarri Joseph came clutch and managed to take the side home with 7 balls to spare. Pheww, that was a humdinger! West Indies have gone from cruising to victory to throwing it all away to just about scraping over the line and they will be mightily relieved. The hosts go 2-0 up in the five-match T20I series, just one game away from sealing the series. 18.5 overs (4 Runs) FOUR! Here are the winning runs. Akeal Hosein takes his side over the line here. An all-round performance from the spinner. Mukesh Kumar pitches it up, on off. Akeal Hosein drills it down the park for a cracking boundary. West Indies win the match by 2 wickets. 18.4 overs (2 Runs) A length ball, on off. Akeal Hosein lofts it over mid on. They take two runs. 18.3 overs (1 Run) A yorker-length delivery, on off. Joseph jams it out to long on for a single. 18.2 overs (6 Runs) SIX! GONE! India in a spot of bother. Back of a length, outside off. Alzarri Joseph stands tall and dispatches it towards deep mid-wicket. The ball has enough in it to lands on the advertising cushions of the boundary ropes. 18.1 overs (1 Run) A length ball, wide of off. Akeal Hosein stays back and punches it to deep point for a single. India need a wicket and that too in this over. 17.6 overs (1 Run) A single now to end the over! 12 needed off 12 now. A slower bumper, outside off. Akeal Hosein knocks it to deep point for one. 17.5 overs (1 Run) Alzarri Joseph now flicks this full ball in front of long on and takes a single. 17.4 overs (2 Runs) A length ball, on fourth stump. Alzarri Joseph lofts it over mid off. The batters take two runs. This is really good running. 17.3 overs (0 Run) Fuller, angled into the pads. Alzarri Joseph clips it into mid-wicket. 17.2 overs (1 Run) Back of a length, on off, moving away. It goes down to third man off the outside edge. One taken. 17.1 overs (4 Runs) FOUR! A much-needed boundary for the hosts. Akeal Hosein is capable enough of putting the ball out of the park, and this boundary can act as a confidence booster for the spinner. An outswinger, full and wide outside off. Akeal Hosein reaches out. uses the pace of the ball and squeezes it out to deep point for four runs. 16.6 overs (0 Run) Two dots in a row to end the over! Back of a length, outside off, swinging away. Alzarri Joseph tries to chase it but gets beaten in the process. 16.5 overs (0 Run) A dot now! An inswinger, full and on off. Alzarri Joseph pushes it into covers. 16.4 overs (1 Run) A length ball, angled across, outside off. Hosein gets an inside edge on it and works it down to fine leg for one. 16.3 overs (0 Run) A dot now! A loud appeal for lbw but turned down. Hardik Pandya goes for the review once again. It is a full-length delivery, on leg. Mukesh Kumar tries to flick it away but misses and gets pinged on his pads. UltraEdge shows no bat is involved. The Ball Tracking shows that the ball is pitching outside leg. The on-field decision stands and with that, India lose all their review. 16.2 overs (1 Run) LEG BYE! West Indies require a run a ball at this stage, so singles are still hurting the Indians here. Fuller, sliding down the leg side. Alzarri Joseph tries to flick it away but misses. It clips his pads and goes past the keeper. Chahal does well to stop it at short fine. They cross for a leg bye, there was a slight confusion amongst the batters as well but no damage done. 16.1 overs (1 Run) It is full and on off. Akeal Hosein drives it down to long off for a single. Alzarri Joseph walks out to bat now. 15.6 overs (0 Run) A loud appeal for lbw but turned down! Chahal is convinced and Hardik Pandya takes the review. It is tossed up, around off, the ball turns into the batter. Shimron Hetmyer tries to flick it away but misses and gets pinged on his pads. The umpire thinks it is going above the sticks and keeps his finger down. Thanks to the technology, India are able to get rid of Shimron Hetmyer now as the Ball Tracking shows three reds. And the suddenly, the floodgates have opened up here. Three wickets come in total in this over. India have the momentum on their side. 15.5 overs (1 Run) On the pads, clipped to deep square leg for one. Akeal Hosein is the next batter in. 15.4 overs (0 Run) OUT! STUMPED! Yuzvendra Chahal now picks up his first wicket of the match and it could've have come at any better time than this. A leg spinner, around off. Jason Holder leans forward and tries to defend it out but misses. The ball zips past the outside edge. Ishan Kishan gathers the ball quickly and takes the bails off in a jiffy. The umpire takes it upstairs to confirm and the third umpire informs that Jason Holder has no part of his leg behind the popping crease. 15.3 overs (0 Run) On the pads, Holder clips it into the leg side. 15.2 overs (0 Run) It is drifted in, on off. The ball grips and turns away. Jason Holder is beaten here. 15.1 overs (1 Run) OUT! RUN OUT! Another one bites the dust. There is still some hope for India. It is looped up, on the pads. Shimron Hetmyer flicks it to deep mid-wicket. The batters push hard for the first one, they are surely looking for the second run here. Romario Shepherd is quick to turn and is committed on the bases of the call, but Shimron Hetmyer denies him then which leaves him hanging in the middle of the pitch. Axar Patel throws is to the keeper, who makes no mistake. Jason Holder is the new man in.","pubDate":"2023-08-06 18:34:26","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs West Indies Highlights, 2nd T20I: Windies take 2-0 lead with 2-wicket victory","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-highlights-2nd-t20i-windies-take-2-0-lead-with-2-wicket-victory-12965032.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs West Indies Highlights, 2nd T20I: Windies take 2-0 lead with 2-wicket victory","content":"Cricket India vs West Indies Highlights, 2nd T20I: Windies take 2-0 lead with 2-wicket victory IND vs WI 2nd T20I Highlights: After restricting Hardik Pandya and Co to 152/7, West Indies completed the chase inside 19 overs with Nicholas Pooran smashing 67 off 40 balls to take a 2-0 lead in the five-match series. FirstCricket Staff Last Updated:August 06, 2023 23:57:16 IST India vs West Indies 2nd T20 LIVE Cricket Score, Commentary, Updates. AP FP commentary Quick Scorecard Full scorecard Ball by ball commentary West Indies Vs India At Providence Stadium, Guyana, 06 August, 2023 06 August, 2023 Starts 20:00 (IST) Match Ended India 152/7 (20.0 ov) 2nd T20I West Indies 155/8 (18.5 ov) West Indies beat India by 2 wickets India vs West Indies 2nd T20I LIVE Score: India will look to bounce back in the five-match T20I series with a victory in the second match on Sunday after losing the first game by a narrow margin of just four runs. Despite restricting West Indies to 149/6 in the first innings, India struggled in the chase as they lost wickets regularly. With Axar Patel getting out on the first ball of the 18th over, the tailenders were left to complete the task in the last 11 balls when 21 was still required and India’s innings was restricted to 145/9. Kuldeep Yadav was India’s No 8 and a long tail did not work in India’s favour in the first T20I. India captain Hardik Pandya may look to sort out the issue in the second T20I but with both the all-rounders Hardik and Axar Patel already part of the playing XI, India don’t have much choice other than dropping a blower. Related Articles India need to get West Indies all out as soon as possible: Zaheer Khan India vs West Indies: Yashasvi Jaiswal, Ishan Kishan the biggest gains as IND fail to bag full WTC points If they do drop a pure bowler, their bowling options come down to just five which is also not an ideal scenario. In such a case India may look to give debut to Yashasvi Jasiwal and push Ishan Kishan to No 3 from the opening slot. That way Hardik could also be pushed down in the batting order to finish off the chase. If this happens Sanju Samson could be the casualty from the playing XI. It’s also possible that India may continue with the same playing XI as they look to sort out the combinations before the 2024 T20 World Cup. Whatever happens, India definitely need to change their batting approach. The openers were took cautious and a different approach would work better for them in the second T20I. IND vs WI LIVE Streaming: The second T20I between India and West Indies will be telecast LIVE across the Doordarshan Network, including DD National and DD Sports. The match will also be LIVE streamed on Fancode and JioCinema. You can also follow LIVE scores on Firstpost.com . Squads India: Ishan Kishan, Shubman Gill, Suryakumar Yadav, Tilak Varma, Hardik Pandya, Sanju Samson, Axar Patel, Kuldeep Yadav, Arshdeep Singh, Yuzvendra Chahal, Mukesh Kumar, Yashasvi Jaiswal, Ravi Bishnoi, Umran Malik, Avesh Khan West Indies: Brandon King, Kyle Mayers, Johnson Charles, Nicholas Pooran, Rovman Powell, Shimron Hetmyer, Romario Shepherd, Jason Holder, Akeal Hosein, Alzarri Joseph, Obed McCoy, Shai Hope, Roston Chase, Oshane Thomas, Odean Smith Published on: August 06, 2023 19:29:38 IST Tags: Cricket India Vs West Indies","pubDate":"2023-08-06 18:27:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/India-vs-West-Indies-2nd-T20-LIVE.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"2nd T20I: Pooran Guides Windies To 2-0 Lead Over India In 5-Match Series","link":"https://sports.ndtv.com/cricket/ind-vs-wi-2nd-t20i-nicholas-pooran-guides-west-indies-to-2-0-lead-over-india-in-five-match-series-4274998","keywords":null,"creator":null,"video_url":null,"description":"West Indies beat India by two wickets in the second T20I to take a 2-0 lead in the five-match series in Guyana on Sunday.","content":"An explosive half-century by Nicholas Pooran defied a brilliant power-play spell by Indian skipper Hardik Pandya and some brilliant bowling in death overs as the hosts West Indies secured a hard-fought two-wicket win over the Men in Blue in the second T20I of the five-match series at Guyana on Sunday. India trails by 2-0 in the series. In the chase of 152, West Indies was off to a nightmarish start when Hardik Pandya got rid of Brandon King (0) and Johnson Charles (2) in the first over itself. WI was restricted to 2/2 in the first over itself. Suryakumar took a stunner of a catch to dismiss King while Charles was caught by Tilak Varma at cover point. Kyle Mayers joined forces with Nicholas Pooran to rebuild the Windies innings. In the third over, Pooran smashed Pandya for 17 runs, including two fours and a six. Arshdeep's next over went for 12 runs though he trapped Kyle Mayers lbw for 15. WI was at 32/3 in 3.4 overs. Pooran helped WI finish off their powerplay on a high, smashing Ravi Bishnoi for 18 runs, including three fours and a six. After six overs, WI was at 61/3, with Pooran (42*) and skipper Rovman Powell (2*) unbeaten. WI had reached the 50-run mark in 5.2 overs. The 57-run stand between Pooran-Powell was ended by Pandya after a diving catch from Mukesh Kumar at third man to send back the WI skipper for 21 off 19 balls. WI was 89/4 in 9.5 overs. WI ended their 10 overs at 91/4, with Pooran (50*) having reached his fifty in 29 balls and joined by Shimron Hetmyer (2*). WI reached the 100-run mark in 11.3 overs and match looked done and dusted at that point. A delivery by Mukesh helped dismiss Pooran, with the help of Samson's safe hands at the cover point. The bowler ended Pooran's knock at 67 in 40 balls, with six fours and four sixes. WI was 126/5 in 14 overs. Advertisement India made a comeback into the match with two quick wickets. First was Romario Shepherd being run out for zero. Later three balls later, Jason Holder was stumped by Ishan Kishan for a duck, giving Yuzvendra Chahal his first wicket. WI was at 128/7 in 15.4 overs. Chahal's golden arm did its magic on the final ball of the over, sending back a dangerous Hetmyer for 22 off 22 balls after he was trapped lbw. WI was 129/8 in 16 overs. The 18th over by Arshdeep released some pressure, giving away nine runs and leaving the hosts with 12 to chase in 12 balls. But a single by Akael Hosein and then a six by Alzarri Joseph left Windies with just five to chase in 10 balls. Akael hit the winning runs and WI won by two wickets with more than an over left. Hardik (3/35) and Chahal (2/19) were impressive with the ball. Arshdeep and Mukesh got one wicket each. Earlier, Tilak Varma's gutsy half-century was the highlight of yet another disappointing show by Indian batters as West Indies restricted the visitors to just 151/7 in their 20 overs in the second T20I of the five-match series at Guyana on Sunday. After electing to bat first, openers Ishan Kishan and Shubman Gill once again failed to give a solid start to the Men in Blue. Though both smashed a six each to make their attacking intentions clear, Gill's sub-par form in T20Is continued. After hitting Alzarri Joseph for a six in the third over, ball four, Shubman went for another big hit on the next one. But the mistimed hit landed straight into the hands of Shimron Hetmyer at the backward point. Gill was out for seven. India was at 16/1 in 2.5 overs. Suryakumar Yadav, playing his 50th T20I match for India, also failed to make an impact as he was run out for just one run off three balls by Kyle Mayers, leaving India at 18/2 in 3.3 overs. Kishan joined forces with Tilak Varma to carry India through the remainder of the powerplay without any loss of wicket, with Kishan (14*) and Tilak (9*) unbeaten and India at 34/2 in six overs. India reached the 50-run mark in 8.1 overs. The budding partnership between these two left-handers was cut short at 42 runs after Romario Shepherd cleaned up Kishan for 27 off 23 balls, consisting of two fours and two sixes, leaving India at 60/3 in 9.3 overs. At the end of 10 overs, India was at 65/3, with Sanju Samson (5*) and Tilak (20*) unbeaten. In the 11th over end, Tilak gave India some momentum with two back-to-back boundaries against Jason Holder. Samson's disappointing run in T20Is continued, dismissed for seven by Akael Hosein after being stumped by Nicholas Pooran. India was 76/4. Hardik Pandya, the skipper joined Tilak, who was batting beautifully, sweeping and smashing every wrong ball. India reached the 100-run mark in 14.2 overs. Tilak reached his maiden half-century in 39 balls, consisting of five fours and a six. India was 106/4 in 15 overs, with Tilak (50*) and Pandya (8*) unbeaten. Tilak's knock of 51 ended in 41 balls, he was caught by McCoy and Akael got his second wicket. India is 114/5 in 15.5 overs. Hardik and Axar seemed to be building a partnership, but Alzarri ended it as Pandya was clean-bowled for 24 off 18. India was 129/6 in 18 overs. Axar Patel's disappointing run with the bat continued as a poorly-timed shot landed into Pooran's hands. He was gone for 14 off 12 balls and Shepherd took his second wicket. India was 139/7 in 19.1 overs. India finished at 151/7 in 20 overs, with Arshdeep Singh (5*) and Ravi Bishnoi (8*) unbeaten. Alzarri (2/28), Romario (2/28) and Akael (2/29) took two wickets each for Windies. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-08-06 18:25:02","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Pakistan cricket team gets government clearance for World Cup in India","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-cricket-team-gets-government-clearance-for-world-cup-in-india-12965432.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan cricket team gets government clearance for World Cup in India","content":"Cricket Pakistan cricket team gets government clearance for World Cup in India Despite the green light, Pakistan said that it has 'deep concerns' about the security of the cricket team and it would relay them to ICC and the Indian authorities. FirstCricket Staff Last Updated:August 06, 2023 23:45:25 IST Pakistan cricket team has received the necessary clearance to travel to India for the cricket World Cup. Reuters The Pakistan cricket team will be travelling to India for the ICC ODI World Cup 2023, it was confirmed on Sunday after the Pakistan government gave clearance to the national side for the mega event. The ODI World Cup 2023 will be taking place in India from 5 October to 19 November and Pakistan are scheduled to play India at the Narendra Modi Stadium in Ahmedabad on 15 October. The date of the match is set to be shifted to 14 October due to security issues in the city as the start of Navratri also falls on 15 October but the same is still to be confirmed by the ICC. Confirming Pakistan’s participation in a press release, the foreign ministry said that sports should not be mixed with politics. Related Articles ICC ODI World Cup 2023: Pakistan cricket team awaits green light for travelling to India ODI World Cup 2023: ICC inspects venues at Bengaluru, Chennai, Thiruvananthapuram and Mumbai “Pakistan believes that the state of bilateral relations with India should not stand in the way of fulfilling its international sports-related obligations,” the foreign ministry release said. The foreign ministry also added that despite giving a green light to the team, Pakistan has “deep concerns” about the security of the cricket team and it would relay them to ICC and the Indian authorities. “Pakistan, however, has deep concerns about the security of its cricket team. We are conveying these concerns to the International Cricket Council and the Indian authorities. “We expect that the full safety and security of the Pakistan cricket team will be ensured during its visit to India,” the release said. The Pakistan government’s latest decision brings an end to the long drawn saga which began last year after former Pakistan Cricket Board (PCB) chief Ramiz Raja said that the national team would not travel to India if Men in Blue don’t travel to Pakistan for the Asia Cup 2023. Asia Cup 2023 will be played on a hybrid mode in August-September with India playing their matches in Sri Lanka. Published on: August 06, 2023 23:45:25 IST Tags: Cricket Pakistan Cricket Team World Cup 2023","pubDate":"2023-08-06 18:15:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/Pakistan-cricket-team1.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI: 6 गेंद में 3 विकेट, युजवेंद्र चहल के आगे कांप गए थे वेस्टइंडीज के बल्लेबाज, फिर भी भारत को मिली हार","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-wi-three-wickets-in-six-balls-west-indies-batsmen-were-trembling-against-yuzvendra-chahal-yet-india-got-defeated/articleshow/102479959.cms","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI, 2nd T20I: पांच टी20 मैचों की सीरीज के दूसरे मुकाबले में स्पिनर गेंदबाज युजवेंद्र चहल ने शानदार गेंदबाजी का प्रदर्शन करते हुए एक ही ओवर में मैच को भारत की तरफ मोड़ दिया। इस कारण टीम इंडिया ने सीरीज में 1-1 की बराबरी कर ली।","content":"पांच वनडे मैचों की सीरीज के दूसरे मुकाबले में भी भारतीय टीम को करारी हार मिली थी। दूसरे टी20 में वेस्टइंडीज ने भारत को 2 विकेट से हरा दिया। इस मैच में टीम इंडिया के कप्तान हार्दिक पंड्या ने टॉस जीतकर पहले गेंदबाजी का फैसला किया था लेकिन वह 20 ओवर में सिर्फ 152 रन का ही स्कोर खड़ा कर पाई। इसके जवाब में वेस्टइंडीज ने 7 गेंद शेष रहते ही लक्ष्य को हासिल कर लिया। वेस्टइंडीज के खिलाफ इस मुकाबले में गेंदबाजी में युजवेंद्र चहल ने कमाल का खेल दिखाया। चहल ने पारी के 16वें ओवर में मैच को पूरी तरह भारत की तरफ मोड़ दिया था। चहल के इस ओवर में टीम इंडिया को तीन बड़ी सफलताएं मिली थी लेकिन इसके बावजूद टीम इंडिया मैच को नहीं जीत पाई। चहल के इस ओवर की पहली गेंद पर शिमरन हेटमायर ने एक सिंगल चुराने का प्रयास किया लेकिन अक्सर पटेल के शानदार थ्रो से रोमारियो शेफर्ड रन आउट हो गए। चहल के इसी ओवर में जेसन होल्डर को ईशान किशन स्टंप आउट किया। इन दो विकेट के बाद ऐसा लगा कि भारतीय टीम ने मैच को अपने पक्ष में कर लिया है और ऐसा हुआ भी। क्योंकि पारी की आखिरी गेंद पर चहल ने हेटमायर को भी एलबीडबल्यू कर दिया। इस तरह चहल के 6 गेंद में भारत को तीन सफलताएं मिल जिसके कारण वेस्टइंडीज हार लगभग तय हो गई थी। हालांकि इसके बाद अकिल होसैन और अल्जारी जोसेफ ने मोर्चा संभाल लिया और नाबाद रहते हुए अपनी टीम को 2 विकेट से जीत दिला दी। अकील होसैन ने 10 गेंद में 16 रनों की पारी खेली जबकि अल्जारी जोसेफ ने 8 गेंद में 10 रन बनाकर नाबाद रहे। इस तरह वेस्टइंडीज की टीम ने पांच मैचों की इस सीरीज में 2-0 की बढ़त बना ली है। वेस्टइंडीज के खिलाफ इस मुकाबले में भारतीय टीम की बल्लेबाजी बुरी तरह फ्लॉप रही। टॉप ऑर्डर में शुभमन गिल, ईशान किशन, सूर्यकुमार यादव और संजू सैमसन ने पूरी तरह से निराश किया। हालांकि तिलक वर्मा ने जरूर 51 रनों की पारी खेली। इसके अलावा और कोई बल्लेबाज कमाल नहीं दिखा सके जिसके कारण भारत 20 ओवर में सिर्फ 152 रन का स्कोर ही खड़ा कर सकी।","pubDate":"2023-08-06 23:30:00","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Surrey slam ‘ludicrous’ claims over Ashes ball change after Australia complaints","link":"https://www.standard.co.uk/sport/cricket/ashes-ball-change-controversy-surrey-b1098965.html","keywords":["Cricket","Sport"],"creator":["Press Association"],"video_url":null,"description":"Surrey have rejected the “ludicrous” claim that an old Dukes ball could have been used in the final Ashes Test at the Kia Oval.","content":"have rejected the “ludicrous” claim that an old Dukes ball could have been used in the final Test at the Kia Oval. were able to win the fifth Test by 49 runs to level the series at 2-2 but the Australian press coverage in the immediate days after last Monday's dramatic finale was dominated by ‘ballgate’ with among a number of current and former players to discuss the subject. Khawaja and fellow opener David Warner were well set on day four in an unbroken century stand when the former was struck on the helmet by a bouncer, which resulted in a change to the Dukes ball being used. Dilip Jajodia, the owner of Dukes Cricket Balls, has vowed to launch an investigation after he added to speculation that a ball from a previous batch could have been used, not a ball from the 2023 batch. A Surrey spokesperson told the PA news agency: “Mr Jajodia is correct to say that Duke's balls are supplied to the Oval and to Surrey CCC ahead of the season for use in matches and training. These balls can also be used as match replacements, as seen during the Test. SPONSORED “There were a wide selection of balls available to the umpire's at all times, with a variety of conditions to choose from, and that decision is entirely at their discretion. “We reject entirely the assertion that a ball from 2018 or 2019 could have been available for selection and think the suggestion itself is ludicrous.” Jajodia, in an interview with News Corp, explained how every ball produced for a specific season has the date stamped on it and while “it's not likely”, he admitted a ball from a different year could have been behind the changed ball on day four, producing more swing and seam movement. “I can't imagine they would risk putting a ball in there with a different date on it. Frankly, the match referee should be on top of it,\" Jajodia said of Surrey, via Wisden.com. “We do bang that number in quite hard, so even if the gold comes off, the ball is imprinted. It wouldn't be easy to get rid of it. I'm not saying it's impossible (that it was a 2018 or 2019 ball), but it's not likely. “I'm going to investigate myself because it affects me. My name is at stake so it's important they don't misallege something was wrong with the ball.”","pubDate":"2023-08-06 20:01:17","image_url":"https://static.standard.co.uk/2023/08/06/19/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Southby shines as Brave beat Superchargers before Fire edge Invincibles","link":"https://www.skysports.com/cricket/news/12040/12934850/the-hundred-rhianna-southby-shines-as-southern-brave-beat-northern-superchargers","keywords":null,"creator":null,"video_url":null,"description":"Rhianna Southby put on a sensational wicketkeeping display as Southern Brave Women returned to winning ways with a five-wicket victory over Northern Superchargers in The Hundred.","content":"Rhianna Southby put on a sensational wicketkeeping display as Southern Brave Women returned to winning ways with a five-wicket victory over Northern Superchargers in The Hundred. Southby affected a Hundred record four wickets - two catches and two stumpings - in her second match in front of an Ageas Bowl record 9,813 crowd. The soon-to-retire Anya Shrubsole starred with two wickets, dismissing overseas duo Jemimah Rodrigues (India) and Phoebe Litchfield (Australia) for six and nought respectively before Georgia Adams bagged 3-21 as Superchargers were restricted to 100-8. Please use Chrome browser for a more accessible video player Southby caught Litchfield and Alice Davidson-Richards (5) brilliantly and also stumped Superchargers skipper Hollie Armitage (21) and top-scorer Marie Kelly (39). Maia Bouchier took control of the chase with 31 off 28 balls as Brave eased to their target with 13 balls to spare to make it two wins from three and leave Superchargers with one victory and one loss from their two matches. Brave opener Danni Wyatt (20 off 18) initially looked the most fluent batter on display, with five sweetly-struck boundaries inside the first 15 balls, but came unstuck when she drilled Kate Cross to point. In the day's second women's match, two-time champions Oval Invincibles were skittled for just 80 as they lost a nervy game to new table-toppers Welsh Fire by three wickets. A white-ball bonanza: How the rest of England's year looks The Hundred - latest standings The Hundred - latest video The Hundred homepage Please use Chrome browser for a more accessible video player Invincibles opener Lauren Winfield-Hill (42 off 35 balls) hit over half of her side's runs with their next highest scorers making seven in No 10 Seren Smale and No 11 Lizzie Scott. Invincibles plummeted to 55-9 in 75 balls as Shabnim Ismail took three wickets and Georgia Elwiss and Alex Griffiths bagged two each, before Winfield-Hill added 25 with last woman Scott. Fire experienced jitters in the chase, losing openers Tammy Beaumont and Hayley Matthews for ducks as they slipped to 5-2 and then twice losing two wickets in as many balls as they plummeted to 49-4 and 69-6, with Invincibles' South African seamer Marizanne Kapp striking four times. Freya Davies then departed with four runs required but Sarah Bryce (9no) and Griffiths (4no) took Fire over the line after vital earlier contributions from Sophia Dunkley (28) and Elwiss (33). Fire have two wins and a washout from their opening three fixtures, while Invincibles are still seeking a first victory with this defeat at The Kia Oval following an abandoned game against London Spirit. Monday's matches in The Hundred come from Emirates Old Trafford as Manchester Originals take on Birmingham Phoenix . The women's game starts at 3pm with the men then under way at 6.30pm. There will be a 30-minute build-up to both games on Sky Sports Cricket. Sky Sports will show all 68 games in The Hundred live this summer. Stream The Hundred for £26 a month and more with NOW","pubDate":"2023-08-06 19:00:00","image_url":"https://e1.365dm.com/23/08/1920x1080/skysports-mary-taylor-the-hundred_6237443.jpg?20230806141517","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"सरफराज खान ने कश्मीर गर्ल से किया निकाह, सुंदरता में देती हैं बॉलीवुड हीरोइनों को टक्कर, तस्वीरें हुई वायरल","link":"https://sports.ndtv.com/hindi/cricket/sarfaraz-khan-got-married-with-kashmir-girl-pic-and-videos-got-viral-wife-give-stiff-competition-to-bollywood-actresses-in-beauty-4274965#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"घरेलू क्रिकेट में हालिया सालों में जमकर रन बरसाने वाले सरफराज खान पिछले दिनों टेस्ट टीम में जगह न मिलने को लेकर चर्चा में रहे थे","content":"सरफराज खान अपने निकाह के दौरान मुंबई के क्रिकेटर सरफराज खान (Sarfarz Khan) ने जम्मू-कश्मीर के शोपियां जिले की एक लड़की से निकाह कर लिया है. वीडियो में इंडियन प्रीमियर लीग (IPL) में दिल्ली कैपिटल्स के लिए खेलने वाले सरफराज (Sarfaraz Khan got married) को अपने ससुराल में काली शेरवानी में देखा जा सकता है. खान ने एक स्थानीय पोर्टल के साथ बातचीत में कहा, ‘कश्मीर में शादी करना किस्मत में था.' घरेलू क्रिकेट पर अच्छा प्रदर्शन करने वाले इस बल्लेबाज ने कहा, ‘अगर अल्लाह की मर्जी हुई तो मैं एक दिन भारत के लिए जरूर खेलूंगा.' क्रिकेटर की एक झलक पाने के लिए बड़ी संख्या में प्रशंसक जमा हो गए. सरफराज के निकाह के वीडियो सामने आते ही ये बहुत ही तेजी से सोशल मीडिया पर वायरल हो गए. वीडियो में सरफराज को पत्नी अंगूठी पहनाते देखा जा सकता है *Star Indian Cricketer Sarfaraz Khan married in Pashpora Village of District Shopian* देखने में सरफराज की पत्नी किसी मॉडल सी लगती हैं Indian Cricketer sarfaraz Khan married in Pashpora Village of District Shopian, सरफराज खान को बधाई देने वालों की सोशल मीडिया पर बाढ़ सी आ गई है Wishing a happy married life for Sarfaraz Khan & his wife. Congratulations to both of them. आप जोड़े को देख सकते हैं Cricketer Sarfaraz Khan gets married in Kashmir!. Wishing Happy married life for Sarfaraz Khan and His wife. Congratulations Both of them!.. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-06 18:42:10","image_url":"https://c.ndtvimg.com/2023-08/2incel5g_sarfaraz-khan_625x300_07_August_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Now it’s your turn, you must come to Pakistan, says visiting Pakistan Hockey Team Assistant Coach Muhammad Saqlain","link":"https://www.livemint.com/sports/news/now-it-s-your-turn-you-must-come-to-pakistan-says-visiting-pakistan-hockey-team-assistant-coach-muhammad-saqlain-11691346488565.html","keywords":null,"creator":null,"video_url":null,"description":"Muhammad Saqlain said, ‘The main thing is continuity in the process. You will see the cricket team coming here, a football team already came here, and a hockey team is also here. Now it’s your turn, you must be come to Pakistan’","content":"Pakistan Hockey Team Assistant Coach Muhammad Saqlain Sunday expressed his desire that Indian teams should visit Pakistan to play matches. He said “India-Pakistan whenever they are playing they are unpredictable. All the crowd love to watch India vs Pakistan match.\" The Pakistan Hockey Team Assistant Coach said, \"The main thing is continuity in the process. You will see the cricket team coming here, a football team already came here, and a hockey team is also here. Now it’s your turn, you must be come to Pakistan.\" The Pakistan government is very positive to become close to the Indian government, he added Rehan Butt, Assistant coach of Pakistan also expressed his happiness to be in India. He said,\" It doesn't feel like we are in India. It feels like we are playing in Pakistan.\" Butt said Pakistan has always welcomed the decision to come to India. It is a positive decision taken by the Foreign Ministry of Pakistan to send the cricket team to India to play World Cup. Pakistan hockey player Abdul Rana said, “People want to see India and Pakistan playing against each other. So, these matches should happen and both teams should come and play in each other's country.\" “India is our neighborhood country and the love we get here in India is amazing. We do not get so much love anywhere,\" Rana added. Earlier on August 2, while talking with TOI, the Pakistan Hockey Team Assistant Coach said it is proud to play against India. “The crowd in India is always marvelous. We are 100% prepared for the take-off. We are always happy to be in India. The people here have very good hearts. Our hearts are also good. When there will be close hearts, there will be definitely more love,\" he said. “We always feel proud to play against India. It is not easy to play against the top-ranking team in the world. India is playing superb hockey in the world. In women side and men side, gradually they are growing up,\" he added.","pubDate":"2023-08-06 18:39:25","image_url":"https://www.livemint.com/lm-img/img/2023/08/06/1600x900/pakistan_1691346778442_1691346784428.JPG","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricketer Sarfaraz Khan Gets Married In Kashmir - See Pics","link":"https://sports.ndtv.com/cricket/cricketer-sarfaraz-khan-gets-married-in-kashmir-see-pics-4274822","keywords":null,"creator":null,"video_url":null,"description":"Several videos have surfaced on social media in which Sarfaraz Khan can be seen in a black sherwani at his in-laws' place.","content":"Mumbai cricketer Sarfaraz Khan has married a girl from Shopian district of Jammu and Kashmir. Several videos have surfaced on social media in which Khan, who plays for Delhi Capitals in the cash-rich IPL, can be seen in a black sherwani at his in-laws' place. Khan even did a tic-tac with a local portal in which he said it was his \"destiny to get married in Kashmir\". \"If the Almighty has destined, I will play for India one day,\" the cricketer, who has been scoring heavily on the domestic circuit, said. A lot of his fans were also seen thronging to get a glimpse of the cricketer. Wishing a happy married life for Sarfaraz Khan & his wife. Congratulations to both of them. pic.twitter.com/BqwXiGGWtd Sarfaraz was overlooked by the selectors for Team India's tour of West Indies. Sarfaraz Khan got married in Kashmir today! The marriage ceremony was held at his wife's place in Shopian pic.twitter.com/m7zTxxg1Ju Despite establishing himself as one of the most consistent batters in the domestic circuit, an India call up has eluded Sarfaraz for long. He scored 556 runs in six games at an average of 92.66 in the 2022-23 Ranji Trophy campaign with the help of three centuries. In the 2021-22 Ranji Trophy season, he had 982 runs at an average of 122.75. Taking to Twitter, former India batter Aakash Chopra slammed the selectors over Sarfaraz's non-selection and also questioned the \"sanctity of first class cricket\". \"Will Sarfraz be remembered as someone who scored a mountain of runs in First-Class cricket and still never got an opportunity to play for India?? I really hope that's not the case. And I hope that what more he needs to do to get picked is communicated to him. Otherwise...the sanctity of first-class cricket (the heart and soul of Indian cricket) will be lost,\" Chopra tweeted. (With PTI inputs)","pubDate":"2023-08-06 18:36:07","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"West Indies vs India: West Indies vs India, 2023 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-live-score-over-2nd-t20i-t20-16-20-updates-4274927","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between West Indies vs India from Providence Stadium, Guyana. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 18.5 overs, West Indies, chasing a target of 153, are 155/8. The live updates of West Indies vs India scorecard is also available. It is the perfect platform to follow your favourite teams in West Indies vs India, 2023. Keep a track on your favourite batsmen and bowlers through West Indies vs India, 2023 today match, ball by ball commentary, West Indies vs India, West Indies vs India live score, West Indies vs India scorecard. Follow the excitement of the West Indies vs India, 2023 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. That is it then from this game and for the first time since 2016, West Indies have beaten India in back-to-back T20I matches. Right then, two down, three more to go and the third T20I will be played at the same ground, the Providence Stadium in Guyana on Tuesday, the 8th of August. The action will begin at 8 pm IST (2.30 pm GMT) but you can join us for the build-up a lot earlier. Cheers! Rovman Powell, the skipper of West Indies informs that they are really in a good position. Says that it was always going to come down to how they bat against the spinners. Feels that they did great in the middle overs but lost their way by the end. States that left-handers have an advantage against wrist spinners and he is glad they have two great players in that role - Nicholas Pooran and Shimron Hetmyer and it's just that at least one of them has to play enough deliveries. Ends by praising Romario Shepherd for his bowling effort as well. Hardik Pandya, the captain of India says that in all honesty, the batting performance from them was under par and even though the wicket was on the slower side, they should have gotten to 160-170. On Nicholas Pooran, he says that it becomes difficult to rotate the spinners when he is hitting the ball like this but they did fight back well. Adds that the current combination that they have, they have to bat with 7 batters and need to trust the team and they need to figure out a way to get more contribution from the tailenders if required but the batters themselves need to take more responsibility. On Tilak Varma, he says that the way he has been batting gives them a solid option in the middle order, especially given that he is a left-hander. Nicholas Pooran wins the Player of the Match award. He starts by saying that he is satisfied with his performance. Mentions that the beauty of this game is that it isn't over until it is over. States that he does not feel that he is in his purple patch, since losing the captaincy he has started to look at the game from a different perspective and adds that all the hard work is paying off. Says that it is all about being positive and having the right energy. The Presentation ceremony... Earlier in the game, Hardik Pandya won the toss and opted to bat first on a pitch that did look a bit spin friendly. The Indian openers went hard at the bowling but Shubman Gill fell early followed by Suryakumar Yadav. Ishan Kishan and Tilak Varma led the fightback before Kishan too got out and after that, there was simply no one to stick around with Varma. Varma did bring up his maiden T20I fifty and a couple of lusty blows from the tailenders took India to over 150. As for the Windies' bowlers, they were pretty good for most of the innings with Akeal Hosein and Alzarri Joseph picking up a couple of wickets while remaining economical. Coming to the chase, it swung from one end to the other but eventually, the hosts managed to get over the line. India will have a lot of mixed emotions at the moment but it is another defeat for them and yet another sub-par display. Skipper Hardik Pandya took the new ball and gave his side a dream start with a double breakthrough in the very first over. But, the visitors did bowl a couple of really expensive overs and got the opposition to get well ahead of the required rate. They seemed to have no answer for Nicholas Pooran and due to this, Axar Patel wasn't even used. They did however get back into the game with a plethora of wickets thanks mainly to the leg-spin duo of Yuzvendra Chahal and Ravi Bishnoi but the pacers simply didn't back it up at the backend of the chase. India now face an uphill task of winning three games in a row to clinch the series. After another solid display with the ball, West Indies got off to a poor start with the bat with Brandon King and Johnson Charles both falling in the first over. There was a counterpunch from Kyle Mayers but he too got out leaving the hosts 32/3. Then came the 57-run stand between skipper Rovman Powell and Nicholas Pooran with the latter in sensational hitting form. This partnership turned the game on its head and at one point they were 126/4 with Pooran spitting fire. This however soon became 129/8 and at that point, the hosts looked down and out. Luckily for them, the pair of Akeal Hosein and Alzarri Joseph came clutch and managed to take the side home with 7 balls to spare. Pheww, that was a humdinger! West Indies have gone from cruising to victory to throwing it all away to just about scraping over the line and they will be mightily relieved. The hosts go 2-0 up in the five-match T20I series, just one game away from sealing the series. 18.5 overs (4 Runs) FOUR! Here are the winning runs. Akeal Hosein takes his side over the line here. An all-round performance from the spinner. Mukesh Kumar pitches it up, on off. Akeal Hosein drills it down the park for a cracking boundary. West Indies win the match by 2 wickets. 18.4 overs (2 Runs) A length ball, on off. Akeal Hosein lofts it over mid on. They take two runs. 18.3 overs (1 Run) A yorker-length delivery, on off. Joseph jams it out to long on for a single. 18.2 overs (6 Runs) SIX! GONE! India in a spot of bother. Back of a length, outside off. Alzarri Joseph stands tall and dispatches it towards deep mid-wicket. The ball has enough in it to lands on the advertising cushions of the boundary ropes. 18.1 overs (1 Run) A length ball, wide of off. Akeal Hosein stays back and punches it to deep point for a single. India need a wicket and that too in this over. 17.6 overs (1 Run) A single now to end the over! 12 needed off 12 now. A slower bumper, outside off. Akeal Hosein knocks it to deep point for one. 17.5 overs (1 Run) Alzarri Joseph now flicks this full ball in front of long on and takes a single. 17.4 overs (2 Runs) A length ball, on fourth stump. Alzarri Joseph lofts it over mid off. The batters take two runs. This is really good running. 17.3 overs (0 Run) Fuller, angled into the pads. Alzarri Joseph clips it into mid-wicket. 17.2 overs (1 Run) Back of a length, on off, moving away. It goes down to third man off the outside edge. One taken. 17.1 overs (4 Runs) FOUR! A much-needed boundary for the hosts. Akeal Hosein is capable enough of putting the ball out of the park, and this boundary can act as a confidence booster for the spinner. An outswinger, full and wide outside off. Akeal Hosein reaches out. uses the pace of the ball and squeezes it out to deep point for four runs. 16.6 overs (0 Run) Two dots in a row to end the over! Back of a length, outside off, swinging away. Alzarri Joseph tries to chase it but gets beaten in the process. 16.5 overs (0 Run) A dot now! An inswinger, full and on off. Alzarri Joseph pushes it into covers. 16.4 overs (1 Run) A length ball, angled across, outside off. Hosein gets an inside edge on it and works it down to fine leg for one. 16.3 overs (0 Run) A dot now! A loud appeal for lbw but turned down. Hardik Pandya goes for the review once again. It is a full-length delivery, on leg. Mukesh Kumar tries to flick it away but misses and gets pinged on his pads. UltraEdge shows no bat is involved. The Ball Tracking shows that the ball is pitching outside leg. The on-field decision stands and with that, India lose all their review. 16.2 overs (1 Run) LEG BYE! West Indies require a run a ball at this stage, so singles are still hurting the Indians here. Fuller, sliding down the leg side. Alzarri Joseph tries to flick it away but misses. It clips his pads and goes past the keeper. Chahal does well to stop it at short fine. They cross for a leg bye, there was a slight confusion amongst the batters as well but no damage done. 16.1 overs (1 Run) It is full and on off. Akeal Hosein drives it down to long off for a single. Alzarri Joseph walks out to bat now. 15.6 overs (0 Run) A loud appeal for lbw but turned down! Chahal is convinced and Hardik Pandya takes the review. It is tossed up, around off, the ball turns into the batter. Shimron Hetmyer tries to flick it away but misses and gets pinged on his pads. The umpire thinks it is going above the sticks and keeps his finger down. Thanks to the technology, India are able to get rid of Shimron Hetmyer now as the Ball Tracking shows three reds. And the suddenly, the floodgates have opened up here. Three wickets come in total in this over. India have the momentum on their side. 15.5 overs (1 Run) On the pads, clipped to deep square leg for one. Akeal Hosein is the next batter in. 15.4 overs (0 Run) OUT! STUMPED! Yuzvendra Chahal now picks up his first wicket of the match and it could've have come at any better time than this. A leg spinner, around off. Jason Holder leans forward and tries to defend it out but misses. The ball zips past the outside edge. Ishan Kishan gathers the ball quickly and takes the bails off in a jiffy. The umpire takes it upstairs to confirm and the third umpire informs that Jason Holder has no part of his leg behind the popping crease. 15.3 overs (0 Run) On the pads, Holder clips it into the leg side. 15.2 overs (0 Run) It is drifted in, on off. The ball grips and turns away. Jason Holder is beaten here. 15.1 overs (1 Run) OUT! RUN OUT! Another one bites the dust. There is still some hope for India. It is looped up, on the pads. Shimron Hetmyer flicks it to deep mid-wicket. The batters push hard for the first one, they are surely looking for the second run here. Romario Shepherd is quick to turn and is committed on the bases of the call, but Shimron Hetmyer denies him then which leaves him hanging in the middle of the pitch. Axar Patel throws is to the keeper, who makes no mistake. Jason Holder is the new man in.","pubDate":"2023-08-06 18:34:26","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs West Indies Highlights, 2nd T20I: Windies take 2-0 lead with 2-wicket victory","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-highlights-2nd-t20i-windies-take-2-0-lead-with-2-wicket-victory-12965032.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs West Indies Highlights, 2nd T20I: Windies take 2-0 lead with 2-wicket victory","content":"Cricket India vs West Indies Highlights, 2nd T20I: Windies take 2-0 lead with 2-wicket victory IND vs WI 2nd T20I Highlights: After restricting Hardik Pandya and Co to 152/7, West Indies completed the chase inside 19 overs with Nicholas Pooran smashing 67 off 40 balls to take a 2-0 lead in the five-match series. FirstCricket Staff Last Updated:August 06, 2023 23:57:16 IST India vs West Indies 2nd T20 LIVE Cricket Score, Commentary, Updates. AP FP commentary Quick Scorecard Full scorecard Ball by ball commentary West Indies Vs India At Providence Stadium, Guyana, 06 August, 2023 06 August, 2023 Starts 20:00 (IST) Match Ended India 152/7 (20.0 ov) 2nd T20I West Indies 155/8 (18.5 ov) West Indies beat India by 2 wickets India vs West Indies 2nd T20I LIVE Score: India will look to bounce back in the five-match T20I series with a victory in the second match on Sunday after losing the first game by a narrow margin of just four runs. Despite restricting West Indies to 149/6 in the first innings, India struggled in the chase as they lost wickets regularly. With Axar Patel getting out on the first ball of the 18th over, the tailenders were left to complete the task in the last 11 balls when 21 was still required and India’s innings was restricted to 145/9. Kuldeep Yadav was India’s No 8 and a long tail did not work in India’s favour in the first T20I. India captain Hardik Pandya may look to sort out the issue in the second T20I but with both the all-rounders Hardik and Axar Patel already part of the playing XI, India don’t have much choice other than dropping a blower. Related Articles India need to get West Indies all out as soon as possible: Zaheer Khan India vs West Indies: Yashasvi Jaiswal, Ishan Kishan the biggest gains as IND fail to bag full WTC points If they do drop a pure bowler, their bowling options come down to just five which is also not an ideal scenario. In such a case India may look to give debut to Yashasvi Jasiwal and push Ishan Kishan to No 3 from the opening slot. That way Hardik could also be pushed down in the batting order to finish off the chase. If this happens Sanju Samson could be the casualty from the playing XI. It’s also possible that India may continue with the same playing XI as they look to sort out the combinations before the 2024 T20 World Cup. Whatever happens, India definitely need to change their batting approach. The openers were took cautious and a different approach would work better for them in the second T20I. IND vs WI LIVE Streaming: The second T20I between India and West Indies will be telecast LIVE across the Doordarshan Network, including DD National and DD Sports. The match will also be LIVE streamed on Fancode and JioCinema. You can also follow LIVE scores on Firstpost.com . Squads India: Ishan Kishan, Shubman Gill, Suryakumar Yadav, Tilak Varma, Hardik Pandya, Sanju Samson, Axar Patel, Kuldeep Yadav, Arshdeep Singh, Yuzvendra Chahal, Mukesh Kumar, Yashasvi Jaiswal, Ravi Bishnoi, Umran Malik, Avesh Khan West Indies: Brandon King, Kyle Mayers, Johnson Charles, Nicholas Pooran, Rovman Powell, Shimron Hetmyer, Romario Shepherd, Jason Holder, Akeal Hosein, Alzarri Joseph, Obed McCoy, Shai Hope, Roston Chase, Oshane Thomas, Odean Smith Published on: August 06, 2023 19:29:38 IST Tags: Cricket India Vs West Indies","pubDate":"2023-08-06 18:27:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/India-vs-West-Indies-2nd-T20-LIVE.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"2nd T20I: Pooran Guides Windies To 2-0 Lead Over India In 5-Match Series","link":"https://sports.ndtv.com/cricket/ind-vs-wi-2nd-t20i-nicholas-pooran-guides-west-indies-to-2-0-lead-over-india-in-five-match-series-4274998","keywords":null,"creator":null,"video_url":null,"description":"West Indies beat India by two wickets in the second T20I to take a 2-0 lead in the five-match series in Guyana on Sunday.","content":"An explosive half-century by Nicholas Pooran defied a brilliant power-play spell by Indian skipper Hardik Pandya and some brilliant bowling in death overs as the hosts West Indies secured a hard-fought two-wicket win over the Men in Blue in the second T20I of the five-match series at Guyana on Sunday. India trails by 2-0 in the series. In the chase of 152, West Indies was off to a nightmarish start when Hardik Pandya got rid of Brandon King (0) and Johnson Charles (2) in the first over itself. WI was restricted to 2/2 in the first over itself. Suryakumar took a stunner of a catch to dismiss King while Charles was caught by Tilak Varma at cover point. Kyle Mayers joined forces with Nicholas Pooran to rebuild the Windies innings. In the third over, Pooran smashed Pandya for 17 runs, including two fours and a six. Arshdeep's next over went for 12 runs though he trapped Kyle Mayers lbw for 15. WI was at 32/3 in 3.4 overs. Pooran helped WI finish off their powerplay on a high, smashing Ravi Bishnoi for 18 runs, including three fours and a six. After six overs, WI was at 61/3, with Pooran (42*) and skipper Rovman Powell (2*) unbeaten. WI had reached the 50-run mark in 5.2 overs. The 57-run stand between Pooran-Powell was ended by Pandya after a diving catch from Mukesh Kumar at third man to send back the WI skipper for 21 off 19 balls. WI was 89/4 in 9.5 overs. WI ended their 10 overs at 91/4, with Pooran (50*) having reached his fifty in 29 balls and joined by Shimron Hetmyer (2*). WI reached the 100-run mark in 11.3 overs and match looked done and dusted at that point. A delivery by Mukesh helped dismiss Pooran, with the help of Samson's safe hands at the cover point. The bowler ended Pooran's knock at 67 in 40 balls, with six fours and four sixes. WI was 126/5 in 14 overs. Advertisement India made a comeback into the match with two quick wickets. First was Romario Shepherd being run out for zero. Later three balls later, Jason Holder was stumped by Ishan Kishan for a duck, giving Yuzvendra Chahal his first wicket. WI was at 128/7 in 15.4 overs. Chahal's golden arm did its magic on the final ball of the over, sending back a dangerous Hetmyer for 22 off 22 balls after he was trapped lbw. WI was 129/8 in 16 overs. The 18th over by Arshdeep released some pressure, giving away nine runs and leaving the hosts with 12 to chase in 12 balls. But a single by Akael Hosein and then a six by Alzarri Joseph left Windies with just five to chase in 10 balls. Akael hit the winning runs and WI won by two wickets with more than an over left. Hardik (3/35) and Chahal (2/19) were impressive with the ball. Arshdeep and Mukesh got one wicket each. Earlier, Tilak Varma's gutsy half-century was the highlight of yet another disappointing show by Indian batters as West Indies restricted the visitors to just 151/7 in their 20 overs in the second T20I of the five-match series at Guyana on Sunday. After electing to bat first, openers Ishan Kishan and Shubman Gill once again failed to give a solid start to the Men in Blue. Though both smashed a six each to make their attacking intentions clear, Gill's sub-par form in T20Is continued. After hitting Alzarri Joseph for a six in the third over, ball four, Shubman went for another big hit on the next one. But the mistimed hit landed straight into the hands of Shimron Hetmyer at the backward point. Gill was out for seven. India was at 16/1 in 2.5 overs. Suryakumar Yadav, playing his 50th T20I match for India, also failed to make an impact as he was run out for just one run off three balls by Kyle Mayers, leaving India at 18/2 in 3.3 overs. Kishan joined forces with Tilak Varma to carry India through the remainder of the powerplay without any loss of wicket, with Kishan (14*) and Tilak (9*) unbeaten and India at 34/2 in six overs. India reached the 50-run mark in 8.1 overs. The budding partnership between these two left-handers was cut short at 42 runs after Romario Shepherd cleaned up Kishan for 27 off 23 balls, consisting of two fours and two sixes, leaving India at 60/3 in 9.3 overs. At the end of 10 overs, India was at 65/3, with Sanju Samson (5*) and Tilak (20*) unbeaten. In the 11th over end, Tilak gave India some momentum with two back-to-back boundaries against Jason Holder. Samson's disappointing run in T20Is continued, dismissed for seven by Akael Hosein after being stumped by Nicholas Pooran. India was 76/4. Hardik Pandya, the skipper joined Tilak, who was batting beautifully, sweeping and smashing every wrong ball. India reached the 100-run mark in 14.2 overs. Tilak reached his maiden half-century in 39 balls, consisting of five fours and a six. India was 106/4 in 15 overs, with Tilak (50*) and Pandya (8*) unbeaten. Tilak's knock of 51 ended in 41 balls, he was caught by McCoy and Akael got his second wicket. India is 114/5 in 15.5 overs. Hardik and Axar seemed to be building a partnership, but Alzarri ended it as Pandya was clean-bowled for 24 off 18. India was 129/6 in 18 overs. Axar Patel's disappointing run with the bat continued as a poorly-timed shot landed into Pooran's hands. He was gone for 14 off 12 balls and Shepherd took his second wicket. India was 139/7 in 19.1 overs. India finished at 151/7 in 20 overs, with Arshdeep Singh (5*) and Ravi Bishnoi (8*) unbeaten. Alzarri (2/28), Romario (2/28) and Akael (2/29) took two wickets each for Windies. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-08-06 18:25:02","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Pakistan cricket team gets government clearance for World Cup in India","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-cricket-team-gets-government-clearance-for-world-cup-in-india-12965432.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan cricket team gets government clearance for World Cup in India","content":"Cricket Pakistan cricket team gets government clearance for World Cup in India Despite the green light, Pakistan said that it has 'deep concerns' about the security of the cricket team and it would relay them to ICC and the Indian authorities. FirstCricket Staff Last Updated:August 06, 2023 23:45:25 IST Pakistan cricket team has received the necessary clearance to travel to India for the cricket World Cup. Reuters The Pakistan cricket team will be travelling to India for the ICC ODI World Cup 2023, it was confirmed on Sunday after the Pakistan government gave clearance to the national side for the mega event. The ODI World Cup 2023 will be taking place in India from 5 October to 19 November and Pakistan are scheduled to play India at the Narendra Modi Stadium in Ahmedabad on 15 October. The date of the match is set to be shifted to 14 October due to security issues in the city as the start of Navratri also falls on 15 October but the same is still to be confirmed by the ICC. Confirming Pakistan’s participation in a press release, the foreign ministry said that sports should not be mixed with politics. Related Articles ICC ODI World Cup 2023: Pakistan cricket team awaits green light for travelling to India ODI World Cup 2023: ICC inspects venues at Bengaluru, Chennai, Thiruvananthapuram and Mumbai “Pakistan believes that the state of bilateral relations with India should not stand in the way of fulfilling its international sports-related obligations,” the foreign ministry release said. The foreign ministry also added that despite giving a green light to the team, Pakistan has “deep concerns” about the security of the cricket team and it would relay them to ICC and the Indian authorities. “Pakistan, however, has deep concerns about the security of its cricket team. We are conveying these concerns to the International Cricket Council and the Indian authorities. “We expect that the full safety and security of the Pakistan cricket team will be ensured during its visit to India,” the release said. The Pakistan government’s latest decision brings an end to the long drawn saga which began last year after former Pakistan Cricket Board (PCB) chief Ramiz Raja said that the national team would not travel to India if Men in Blue don’t travel to Pakistan for the Asia Cup 2023. Asia Cup 2023 will be played on a hybrid mode in August-September with India playing their matches in Sri Lanka. Published on: August 06, 2023 23:45:25 IST Tags: Cricket Pakistan Cricket Team World Cup 2023","pubDate":"2023-08-06 18:15:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/Pakistan-cricket-team1.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"}]}