{"newsArray":[{"article_id":"071b2197f1a575a7692c92f1f41c2336","title":"IPL 2024 के ऑक्शन से पहले बड़ा ऐलान, कोच एंडी फ्लावर ने चुने RCB प्लेइंग XI के टॉप 5 खिलाड़ी","link":"https://sports.ndtv.com/hindi/cricket/andy-flower-confirms-the-top-4-for-rcb-in-ipl-2024-virat-kohli-faf-du-plessis-rajat-patidar-glenn-maxwell-rcb-playing-xi-4701085#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RCB in IPL 2024 Auction: एंडी फ्लावर ने ऑक्शन से पहले कहा है कि आरसीबी के लिए सबसे बड़ी चुनौती है आईपीएल का खिताब जीतने का, ऐसे में टीम ऑक्शन में पूरी तैयारी के साथ जा रही है.","content":"Royal Challengers Bangalore List For IPL 2024: टीम के कोच का बड़ा ऐलान आरसीबी ने आईपीएल 2024 से पहले एंडी फ्लावर को मुख्य कोच नियुक्त किया था. वहीं, अब कोच ने से पहले आरसीबी टीम के टॉप 4 खिलाड़ियों को कंफर्म किया जो इस बार के आईपीएल में टीम की प्लेइंग इलेवन में शामिल रहेंगे. कोच ने चैनल पर आरसीबी प्लेइंग इलेवन (RCB Playing XI for IPL 2024) के टॉप 4 खिलाड़ियों की घोषणा की है. Andy Flower ने कहा है कि इस बार के आईपीएल में आरसीबी के लिए ओपनर की भूमिका विराट कोहली और कप्तान फाफ डु प्लेसी निभाने वाले हैं तो वहीं नंबर 3 पर रजत रजत पाटीदार और नंबर 4 पर ग्लेन मैक्सवेल का नाम टीम के कोच ने लिया है. इसके अलावा कोच ने कैमरून ग्रीन को भी टॉप 5 में रखने की बात की है. इसके अलावा एंडी फ्लॉवर ने सिराज को लेकर भी बात की है और कहा है कि मोहम्मद सिराज आईपीएल में आरसीबी टीम की गेंदबाजी डिपार्टमेंट का नेतृत्व करेंगे. कोच ने कहा कि, सिराज एक बेहतरीन गेंदबाज हैं और फ्रेंचाइजी को पूरा यकीन है कि इस बार के आईपीएल में सिराज काफी अहम किरदार टीम के लिए निभाने वाले हैं. टीम को कोच एंडी फ्लावर ने ऑक्शन से पहले कहा है कि आरसीबी के लिए सबसे बड़ी चुनौती है आईपीएल का खिताब जीतने का, ऐसे में टीम ऑक्शन में पूरी तैयारी के साथ जा रही है. फ्लॉवर ने कहा कि, मेरे लिए सबसे बड़ी चुनौती है कि इस टीम को खिताब दिलाना और एक ऐसी टीम तैयार करना जो आईपीएल का खिताब जीत सके. फाफ डुप्लेसी (कप्तान), रजत पाटीदार, विराट कोहली, अनुज रावत, दिनेश कार्तिक, सुयश प्रभुदेसाई, विल जैक्स, ग्लेन मैक्सवेल, महिपाल लोमरोर, करन शर्मा, मनोज भांडगे, आकाशदीप, मोहम्मद सिराज, रीस टॉप्ली, हिमांशु शर्मा, राजन कुमार, विजयकुमार, कैमरन ग्रीन और मयंक डागर पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-12-19 04:22:07","image_url":"https://i.ndtvimg.com/i/2016-10/andy-flower_650x400_61477408873.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"118db5a366bffcc8186fdb9fb50db0a7","title":"IPL 2024 Auction: Pat Cummins leads stars up for grabs in Dubai","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2024-auction-preview-13519092.html","keywords":["First Cricket News"],"creator":["Tanuj Lakhina"],"video_url":null,"description":"IPL 2024 Auction: Pat Cummins leads stars up for grabs in Dubai","content":"Cricket IPL 2024 Auction: Pat Cummins leads stars up for grabs in Dubai Pat Cummins, having led Australia to the World Cup title, is expected to draw the biggest bid at the IPL 2024 Auction. FirstCricket Staff December 19, 2023 09:42:28 IST Pat Cummins, who played for KKR earlier, is expected to be a big draw at the 2024 IPL Auction. Sportzpics Some of the world’s best cricketers will go under the hammer in Dubai on Tuesday in the mini-auction of the lucrative Indian Premier League (IPL). The franchises can start the bidding for their services from Rs 20 lakh but the best will be snapped up for many times that. IPL 2024 Auction: Everything You Need To Know At the auction, the 10 teams will have a combined Rs 262.95 crore to spend with Gujarat Titans holding the highest remaining purse (Rs 38.15 crore). Related Articles IPL 2024 Auction: Players that each franchise can target at mini-auction IPL 2024 Auction: Indian Premier League trophy unveiled in Dubai ahead of big event Pat Cummins is expected to be the biggest prize at this year’s IPL auction. The Aussie seamer missed last year’s IPL because of a packed calendar but will make a return having led his country to World Cup glory in India. Cummins, 30, who previously made an auction record of Rs 15.5 crore when he signed with the Kolkata Knight Riders in 2019, will enter with a top base price of Rs 2 crore. Josh Hazlewood, Travis Head, Josh Inglis, Mitchell Starc, Steve Smith and Sean Abbott will be among the other Australian World Cup winners in the hunt for a payday. Other names that can draw attention at the IPL auction: Rachin Ravindra amassed 578 runs in the recently-concluded World Cup and could go for big money at the IPL 2024 player auction. AP Rachin Ravindra , the up-and-coming batting all-rounder, scored three centuries in his 578 runs at the World Cup for a strike rate of 106, along with five tournament wickets. Ravindra, a left-handed batter and spinner, had his name chanted by Indian fans during the World Cup and can expect the same enthusiasm from franchises when his name comes up for grabs at a base price of Rs 50 lakh. IPL 2024 Auction: Player list, remaining slots and purse of all 10 franchises Harry Brook: Exciting England batter Brook has plundered runs in all three international formats and has a strike rate of 141.54 in the T20 version. He was snapped up by Sunrisers Hyderabad for Rs 13.25 crore in the previous auction but failed to make much of an impact, barring a century early in this year's IPL. The 24-year-old then managed just 169 runs in six World Cup matches, but recently hit a match-winning 43 in a West Indies ODI and has kept his base price at Rs 2 crore. Gerald Coetzee: One of the breakout stars of the World Cup, Coetzee finished inside the top five bowlers in the competition with 20 wickets. The South African quick made his debut early this year in a Test against West Indies at Centurion and has since played every format to add to the Proteas' pace riches. Coetzee, 23, is looking to boost his career in the money-spinning IPL and has kept himself in the top bracket with a base price of Rs 2 crore. IPL 2024 Auction: Glossary and rules Wanindu Hasaranga: The Sri Lankan has built a reputation of taking wickets at crucial junctures with his leg-spin and has been the country's go-to bowler in white-ball formats. The all-rounder earned a Rs 10.75 crore contract at Royal Challengers Bangalore in 2022 but was released by the team ahead of this year's auction. He has claimed 158 wickets in limited-overs formats and has a T20 strike rate of more than 124 as an attacking middle-order batsman. The 26-year-old missed the World Cup with injury but should expect another lucrative IPL contract with a base price of Rs 1.5 crore. The IPL tournament, the richest T20 league in cricket, is expected to begin in March. (with inputs from AFP) Join our Whatsapp channel to get the latest global news updates Published on: December 19, 2023 09:42:28 IST Tags: Cricket Ipl Ipl 2024 Auction Ipl Auction","pubDate":"2023-12-19 04:12:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/12/Pat-Cummins-Sportzpics-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bbd3a93fd6fad7cfb76f50638b8657cd","title":"Rohit Sharma नहीं, बल्कि रिकी पोंटिंग थे पुल शॉट के असली मास्टर, जन्मदिन पर जानें उनके कुछ अनोखे रिकॉर्ड की कहानी","link":"https://www.abplive.com/sports/cricket/ricky-ponting-birthday-he-was-the-real-master-of-pull-shots-not-rohit-sharma-2563974","keywords":["Cricket"],"creator":["देवेश झा"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Happy Birthday Ricky Ponting:</strong> अंतरराष्ट्रीय क्रिकेट में दुनिया के सबसे महान बल्लेबाजों और कप्तानों में से एक रिकी पोंटिंग आज 49 साल के हो गए हैं. रिकी पोंटिंग का जन्म 19 दिसंबर, 1974 को हुआ था, इसलिए आज वह अपना 49वां जन्मदिन मना रहे हैं. रिकी पोंटिंग विश्व क्रिकेट के एक महान खिलाड़ी हैं. उन्होंने अपनी बल्लेबाजी से तो कई खास रिकॉर्ड बनाए हैं, लेकिन उनकी कप्तानी के कई रिकॉर्ड आजतक कोई तोड़ नहीं पाया है.</p> <h2 style=\"text-align: justify;\"><strong>पुल शॉट के असली मास्टर रिकी पोंटिंग</strong></h2> <p style=\"text-align: justify;\">ऑस्ट्रेलिया के पूर्व कप्तान रिकी पोंटिंग का भारत के साथ हमेशा एक गहरा नाता रहा है. आईपीएल की शुरुआत होने के बाद रिकी पोंटिंग पहले एक खिलाड़ी, और फिर कोच के तौर पर हमेशा भारत में मौजूद रहे हैं. रिकी पोंटिंग की बल्लेबाजी में टाइमिंग के धनी थे. रिकी पोंटिंग के पास हर शॉट के लिए काफी टाइम होता था. आज के जमाने में दुनियाभर के क्रिकेट फैन्स रोहित शर्मा को सबसे अच्छी टाइमिंग वाला बल्लेबाज मानते हैं, और इसलिए वो सबसे अच्छा पुल शॉट भी मारते हैं, लेकिन असल में पुल शॉट के असली मास्टर रिकी पोंटिंग ही थे, जो उस दौर की मुश्किल गेंदबाजी और फील्डिंग परिस्थितियों में भी कमाल की टाइमिंग के साथ पुल शॉट मारा करते थे.</p> <h2 style=\"text-align: justify;\"><strong>रोहित-रिकी का रिश्ता</strong></h2> <p style=\"text-align: justify;\">इस बात को खुद रोहित शर्मा ने भी कई बार कहा है. रोहित शर्मा से जब पूछा जाता है कि उन्होंने किसे देखकर इतना अच्छा पुल शॉट मारना सीखा है, या उन्हें सबसे अच्छी टाइमिंग वाला बल्लेबाज कौन लगता है, तो वो हमेशा रिकी पोंटिंग का नाम लेते हैं. रोहित और रिकी का भी एक अलग रिश्ता रहा है. ये दोनों आईपीएल में मुंबई इंडियंस का हिस्सा रहे हैं. आईपीएल 2013 में मुंबई इंडियंस के कप्तान रिकी पोंटिंग ही थे, लेकिन बीच सीज़न में रिकी पोंटिंग ने कप्तानी छोड़कर रोहित शर्मा को कप्तानी सौंपी थी, और रोहित ने उसी साल अपनी टीम को चैंपियन बना दिया था, और उसके बाद कुल 5 बार आईपीएल चैंपियन बनाया.&nbsp;</p> <h2 style=\"text-align: justify;\"><strong>रिकी पोंटिंग के कुछ खास रिकॉर्ड्स</strong></h2> <p style=\"text-align: justify;\">बहरहाल, आइए हम आपको रिकी पोंटिंग के अंतरराष्ट्रीय करियर की कुछ बातें आपको बताते हैं:</p> <ul style=\"text-align: justify;\"> <li>रिकी पोंटिंग ने अपने टेस्ट करियर में कुल 13, 378 रन बनाए थे.</li> <li>रिकी पोंटिंग ने अपने वनडे करियर में कुल 13, 704 रन बनाए थे.</li> <li>रिकी पोंटिंग ने अंतरराष्ट्रीय क्रिकेट में कुल 70 शतक लगाए थे.</li> <li>रिकी पोंटिंग ने कुल 3 वर्ल्ड कप जीते थे.</li> <li>रिकी पोंटिंग ने बतौर कप्तान ऑस्ट्रेलिया को लगातार दो वर्ल्ड कप जिताए थे.</li> <li>रिकी पोंटिंग ने 2 बार चैंपियंस ट्रॉफी जीती.</li> <li>रिकी पोंटिंग ने बतौर कप्तान आईसीसी की 3 ट्रॉफियां जीती.</li> <li>रिकी पोंटिंग ऐसे खिलाड़ी हैं, जिन्होंने अपनी टीम की जीत में सबसे ज्यादा रन बनाए हैं.</li> <li>रिकी पोंटिंग ने वर्ल्ड कप 2003 के फाइनल में भारत के खिलाफ 140 रनों की शानदार पारी खेली थी, और प्लेयर ऑफ द मैच बने थे.</li> </ul> <p style=\"text-align: justify;\"><strong><a title=\"यह भी पढ़ें: IPL 2024 में आएंगे क्रिकेट के कुछ नए नियम, अब एक ओवर में दो बाउंसर फेंक पाएंगे बॉलर्स!\" href=\"https://www.abplive.com/sports/ipl/ipl-2024-bowler-can-bowl-2-bouncers-in-an-over-according-to-reports-2563959\" target=\"_self\">यह भी पढ़ें: IPL 2024 में आएंगे क्रिकेट के कुछ नए नियम, अब एक ओवर में दो बाउंसर फेंक पाएंगे बॉलर्स!</a></strong></p>","content":"Happy Birthday Ricky Ponting: अंतरराष्ट्रीय क्रिकेट में दुनिया के सबसे महान बल्लेबाजों और कप्तानों में से एक रिकी पोंटिंग आज 49 साल के हो गए हैं. रिकी पोंटिंग का जन्म 19 दिसंबर, 1974 को हुआ था, इसलिए आज वह अपना 49वां जन्मदिन मना रहे हैं. रिकी पोंटिंग विश्व क्रिकेट के एक महान खिलाड़ी हैं. उन्होंने अपनी बल्लेबाजी से तो कई खास रिकॉर्ड बनाए हैं, लेकिन उनकी कप्तानी के कई रिकॉर्ड आजतक कोई तोड़ नहीं पाया है. पुल शॉट के असली मास्टर रिकी पोंटिंग ऑस्ट्रेलिया के पूर्व कप्तान रिकी पोंटिंग का भारत के साथ हमेशा एक गहरा नाता रहा है. आईपीएल की शुरुआत होने के बाद रिकी पोंटिंग पहले एक खिलाड़ी, और फिर कोच के तौर पर हमेशा भारत में मौजूद रहे हैं. रिकी पोंटिंग की बल्लेबाजी में टाइमिंग के धनी थे. रिकी पोंटिंग के पास हर शॉट के लिए काफी टाइम होता था. आज के जमाने में दुनियाभर के क्रिकेट फैन्स रोहित शर्मा को सबसे अच्छी टाइमिंग वाला बल्लेबाज मानते हैं, और इसलिए वो सबसे अच्छा पुल शॉट भी मारते हैं, लेकिन असल में पुल शॉट के असली मास्टर रिकी पोंटिंग ही थे, जो उस दौर की मुश्किल गेंदबाजी और फील्डिंग परिस्थितियों में भी कमाल की टाइमिंग के साथ पुल शॉट मारा करते थे. Ricky Ponting - the master of Pull Shots. pic.twitter.com/gqiPEJNzXJ — Mufaddal Vohra (@mufaddal_vohra) December 19, 2023 रोहित-रिकी का रिश्ता इस बात को खुद रोहित शर्मा ने भी कई बार कहा है. रोहित शर्मा से जब पूछा जाता है कि उन्होंने किसे देखकर इतना अच्छा पुल शॉट मारना सीखा है, या उन्हें सबसे अच्छी टाइमिंग वाला बल्लेबाज कौन लगता है, तो वो हमेशा रिकी पोंटिंग का नाम लेते हैं. रोहित और रिकी का भी एक अलग रिश्ता रहा है. ये दोनों आईपीएल में मुंबई इंडियंस का हिस्सा रहे हैं. आईपीएल 2013 में मुंबई इंडियंस के कप्तान रिकी पोंटिंग ही थे, लेकिन बीच सीज़न में रिकी पोंटिंग ने कप्तानी छोड़कर रोहित शर्मा को कप्तानी सौंपी थी, और रोहित ने उसी साल अपनी टीम को चैंपियन बना दिया था, और उसके बाद कुल 5 बार आईपीएल चैंपियन बनाया. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); रिकी पोंटिंग के कुछ खास रिकॉर्ड्स बहरहाल, आइए हम आपको रिकी पोंटिंग के अंतरराष्ट्रीय करियर की कुछ बातें आपको बताते हैं: रिकी पोंटिंग ने अपने टेस्ट करियर में कुल 13, 378 रन बनाए थे. रिकी पोंटिंग ने अपने वनडे करियर में कुल 13, 704 रन बनाए थे. रिकी पोंटिंग ने अंतरराष्ट्रीय क्रिकेट में कुल 70 शतक लगाए थे. रिकी पोंटिंग ने कुल 3 वर्ल्ड कप जीते थे. रिकी पोंटिंग ने बतौर कप्तान ऑस्ट्रेलिया को लगातार दो वर्ल्ड कप जिताए थे. रिकी पोंटिंग ने 2 बार चैंपियंस ट्रॉफी जीती. रिकी पोंटिंग ने बतौर कप्तान आईसीसी की 3 ट्रॉफियां जीती. रिकी पोंटिंग ऐसे खिलाड़ी हैं, जिन्होंने अपनी टीम की जीत में सबसे ज्यादा रन बनाए हैं. रिकी पोंटिंग ने वर्ल्ड कप 2003 के फाइनल में भारत के खिलाफ 140 रनों की शानदार पारी खेली थी, और प्लेयर ऑफ द मैच बने थे. यह भी पढ़ें: IPL 2024 में आएंगे क्रिकेट के कुछ नए नियम, अब एक ओवर में दो बाउंसर फेंक पाएंगे बॉलर्स!","pubDate":"2023-12-19 04:10:59","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/19/5283cdff2b3a539abe88de1fe870ca621702957802884344_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"5f3a220ac8fb4a1952bce4c06393d575","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.brisbanetimes.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Loading Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Test cricket David Warner Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"5b40da67e8206c280b23e4d2bf8c182b","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.smh.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"3e29435e9cb39f4fa023ea8fefa03694","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.watoday.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Loading Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Test cricket David Warner Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"watoday","source_priority":347743,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"51c7d3b3158482da26fb331c9feda637","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.theage.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2d35f3aec5084c74654699daf7002bed","title":"Marvel-less: Bombers’ bid for extra MCG games","link":"https://www.brisbanetimes.com.au/sport/afl/marvel-less-bombers-bid-for-extra-mcg-games-20231219-p5esf6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Peter Ryan"],"video_url":null,"description":"Essendon are looking to play more home games at the MCG from 2025 onwards, with their agreement to play seven home games at Marvel Stadium finishing at the end of 2024.","content":"Essendon want to play an extra home game at the MCG after their contract to play seven home games per season at Marvel Stadium expires at the end of 2024. The Bombers have been pushing hard to turn their mix of games from 2025 onwards into five home games at the MCG and six at Marvel Stadium, the venue where they have been a tenant club since it opened in 2000. Essendon’s Anzac Day clash against Collingwood at the MCG is always a highlight Credit: The Age In 2024, because of the current contractual arrangement, they will play four home games at the MCG and seven at Marvel Stadium as they did in 2023. Last year, the Bombers played four home and four away games at the MCG, averaging 71,977 spectators for the eight matches at the venue while their average attendance in eight games at Marvel Stadium (seven home, one away) was 36,470. Their average crowds were a little more than 70 per cent of each venue’s capacity. Club CEO Craig Vozzo told members at the club’s annual general meeting the Bombers had been in constructive talks with the AFL about a different mix when the current contract with Marvel Stadium runs its course. “At the moment, it is four [games] at the ’G and seven [games] at Marvel. We would love to play at least another one to two games [at the MCG],” Vozzo said. “We’re aiming to for one to two over the next period of time, and we need to keep pushing our case in a considered way to achieve that outcome, and that is what we are committed to doing.” An opportunity could arise for Essendon to host Hawthorn and North Melbourne at the MCG as those clubs transition away from playing home games in Tasmania now that a licence has been awarded for a standalone team from the Apple Isle to join AFL. Increasing the number of home games Essendon play at the MCG has been on the club’s agenda for several years, but they have been unable to make significant progress because of their contract as a Marvel Stadium tenant, along with Carlton, St Kilda, the Western Bulldogs and North Melbourne. Essendon moved from Windy Hill to play home games at the MCG in 1992 before signing a deal to play home games at the new Docklands Stadium from 2000. Bombers president David Barham told members the club was committed to extra home games at the MCG, and it would be a matter of negotiating what’s possible with the Melbourne Cricket Club and also the AFL, which prepares the fixture and owns Marvel Stadium. The major tenants at the MCG – Collingwood, Richmond, Hawthorn and Melbourne – have won 10 of the past 12 AFL premierships. The AFL, MCG and Marvel Stadium declined to comment. Meanwhile, former Bomber Dean Rioli resigned from the club’s board because of personal reasons after becoming the first Indigenous director in the club’s history in November 2022. The club will look to replace him as it prepares for its VFL and VFLW sides to play a game in Darwin in January. The members also re-elected incumbents Kevin Sheedy and Tim Roberts to the board after anti-pokies campaigner Graham Evans standing was unable to unseat them despite their positions being made vacant. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2024 For subscribers Essendon Bombers Peter Ryan is a sports reporter with The Age. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-12-19 04:00:58","image_url":"https://static.ffx.io/images/$zoom_0.32013301088270857%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_jpg/30002122942afed4a50f7e34c7f467495da28c56","source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"52ea68b79483eaeb42c44e53ee8fd5a6","title":"Marvel-less: Bombers’ bid for extra MCG games","link":"https://www.smh.com.au/sport/afl/marvel-less-bombers-bid-for-extra-mcg-games-20231219-p5esf6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Peter Ryan"],"video_url":null,"description":"Essendon are looking to play more home games at the MCG from 2025 onwards, with their agreement to play seven home games at Marvel Stadium finishing at the end of 2024.","content":"Essendon want to play an extra home game at the MCG after their contract to play seven home games per season at Marvel Stadium expires at the end of 2024. The Bombers have been pushing hard to turn their mix of games from 2025 onwards into five home games at the MCG and six at Marvel Stadium, the venue where they have been a tenant club since it opened in 2000. Essendon’s Anzac Day clash against Collingwood at the MCG is always a highlight Credit: The Age In 2024, because of the current contractual arrangement, they will play four home games at the MCG and seven at Marvel Stadium as they did in 2023. Last year, the Bombers played four home and four away games at the MCG, averaging 71,977 spectators for the eight matches at the venue while their average attendance in eight games at Marvel Stadium (seven home, one away) was 36,470. Their average crowds were a little more than 70 per cent of each venue’s capacity. Club CEO Craig Vozzo told members at the club’s annual general meeting the Bombers had been in constructive talks with the AFL about a different mix when the current contract with Marvel Stadium runs its course. “At the moment, it is four [games] at the ’G and seven [games] at Marvel. We would love to play at least another one to two games [at the MCG],” Vozzo said. “We’re aiming to for one to two over the next period of time, and we need to keep pushing our case in a considered way to achieve that outcome, and that is what we are committed to doing.” An opportunity could arise for Essendon to host Hawthorn and North Melbourne at the MCG as those clubs transition away from playing home games in Tasmania now that a licence has been awarded for a standalone team from the Apple Isle to join AFL. Increasing the number of home games Essendon play at the MCG has been on the club’s agenda for several years, but they have been unable to make significant progress because of their contract as a Marvel Stadium tenant, along with Carlton, St Kilda, the Western Bulldogs and North Melbourne. Essendon moved from Windy Hill to play home games at the MCG in 1992 before signing a deal to play home games at the new Docklands Stadium from 2000. Bombers president David Barham told members the club was committed to extra home games at the MCG, and it would be a matter of negotiating what’s possible with the Melbourne Cricket Club and also the AFL, which prepares the fixture and owns Marvel Stadium. The major tenants at the MCG – Collingwood, Richmond, Hawthorn and Melbourne – have won 10 of the past 12 AFL premierships. The AFL, MCG and Marvel Stadium declined to comment. Meanwhile, former Bomber Dean Rioli resigned from the club’s board because of personal reasons after becoming the first Indigenous director in the club’s history in November 2022. The club will look to replace him as it prepares for its VFL and VFLW sides to play a game in Darwin in January. The members also re-elected incumbents Kevin Sheedy and Tim Roberts to the board after anti-pokies campaigner Graham Evans standing was unable to unseat them despite their positions being made vacant. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:00:58","image_url":"https://static.ffx.io/images/$zoom_0.32013301088270857%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_jpg/30002122942afed4a50f7e34c7f467495da28c56","source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"69dbab1cc5ac0b4ba78732d1a8f8d65b","title":"Marvel-less: Bombers’ bid for extra MCG games","link":"https://www.theage.com.au/sport/afl/marvel-less-bombers-bid-for-extra-mcg-games-20231219-p5esf6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Peter Ryan"],"video_url":null,"description":"Essendon are looking to play more home games at the MCG from 2025 onwards, with their agreement to play seven home games at Marvel Stadium finishing at the end of 2024.","content":"Essendon want to play an extra home game at the MCG after their contract to play seven home games per season at Marvel Stadium expires at the end of 2024. The Bombers have been pushing hard to turn their mix of games from 2025 onwards into five home games at the MCG and six at Marvel Stadium, the venue where they have been a tenant club since it opened in 2000. Essendon’s Anzac Day clash against Collingwood at the MCG is always a highlight Credit: The Age In 2024, because of the current contractual arrangement, they will play four home games at the MCG and seven at Marvel Stadium as they did in 2023. Last year, the Bombers played four home and four away games at the MCG, averaging 71,977 spectators for the eight matches at the venue while their average attendance in eight games at Marvel Stadium (seven home, one away) was 36,470. Their average crowds were a little more than 70 per cent of each venue’s capacity. Club CEO Craig Vozzo told members at the club’s annual general meeting the Bombers had been in constructive talks with the AFL about a different mix when the current contract with Marvel Stadium runs its course. “At the moment, it is four [games] at the ’G and seven [games] at Marvel. We would love to play at least another one to two games [at the MCG],” Vozzo said. “We’re aiming to for one to two over the next period of time, and we need to keep pushing our case in a considered way to achieve that outcome, and that is what we are committed to doing.” An opportunity could arise for Essendon to host Hawthorn and North Melbourne at the MCG as those clubs transition away from playing home games in Tasmania now that a licence has been awarded for a standalone team from the Apple Isle to join AFL. Increasing the number of home games Essendon play at the MCG has been on the club’s agenda for several years, but they have been unable to make significant progress because of their contract as a Marvel Stadium tenant, along with Carlton, St Kilda, the Western Bulldogs and North Melbourne. Essendon moved from Windy Hill to play home games at the MCG in 1992 before signing a deal to play home games at the new Docklands Stadium from 2000. Bombers president David Barham told members the club was committed to extra home games at the MCG, and it would be a matter of negotiating what’s possible with the Melbourne Cricket Club and also the AFL, which prepares the fixture and owns Marvel Stadium. The major tenants at the MCG – Collingwood, Richmond, Hawthorn and Melbourne – have won 10 of the past 12 AFL premierships. The AFL, MCG and Marvel Stadium declined to comment. Meanwhile, former Bomber Dean Rioli resigned from the club’s board because of personal reasons after becoming the first Indigenous director in the club’s history in November 2022. The club will look to replace him as it prepares for its VFL and VFLW sides to play a game in Darwin in January. The members also re-elected incumbents Kevin Sheedy and Tim Roberts to the board after anti-pokies campaigner Graham Evans standing was unable to unseat them despite their positions being made vacant. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:00:58","image_url":"https://static.ffx.io/images/$zoom_0.32013301088270857%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_jpg/30002122942afed4a50f7e34c7f467495da28c56","source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"071b2197f1a575a7692c92f1f41c2336","title":"IPL 2024 के ऑक्शन से पहले बड़ा ऐलान, कोच एंडी फ्लावर ने चुने RCB प्लेइंग XI के टॉप 5 खिलाड़ी","link":"https://sports.ndtv.com/hindi/cricket/andy-flower-confirms-the-top-4-for-rcb-in-ipl-2024-virat-kohli-faf-du-plessis-rajat-patidar-glenn-maxwell-rcb-playing-xi-4701085#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RCB in IPL 2024 Auction: एंडी फ्लावर ने ऑक्शन से पहले कहा है कि आरसीबी के लिए सबसे बड़ी चुनौती है आईपीएल का खिताब जीतने का, ऐसे में टीम ऑक्शन में पूरी तैयारी के साथ जा रही है.","content":"Royal Challengers Bangalore List For IPL 2024: टीम के कोच का बड़ा ऐलान आरसीबी ने आईपीएल 2024 से पहले एंडी फ्लावर को मुख्य कोच नियुक्त किया था. वहीं, अब कोच ने से पहले आरसीबी टीम के टॉप 4 खिलाड़ियों को कंफर्म किया जो इस बार के आईपीएल में टीम की प्लेइंग इलेवन में शामिल रहेंगे. कोच ने चैनल पर आरसीबी प्लेइंग इलेवन (RCB Playing XI for IPL 2024) के टॉप 4 खिलाड़ियों की घोषणा की है. Andy Flower ने कहा है कि इस बार के आईपीएल में आरसीबी के लिए ओपनर की भूमिका विराट कोहली और कप्तान फाफ डु प्लेसी निभाने वाले हैं तो वहीं नंबर 3 पर रजत रजत पाटीदार और नंबर 4 पर ग्लेन मैक्सवेल का नाम टीम के कोच ने लिया है. इसके अलावा कोच ने कैमरून ग्रीन को भी टॉप 5 में रखने की बात की है. इसके अलावा एंडी फ्लॉवर ने सिराज को लेकर भी बात की है और कहा है कि मोहम्मद सिराज आईपीएल में आरसीबी टीम की गेंदबाजी डिपार्टमेंट का नेतृत्व करेंगे. कोच ने कहा कि, सिराज एक बेहतरीन गेंदबाज हैं और फ्रेंचाइजी को पूरा यकीन है कि इस बार के आईपीएल में सिराज काफी अहम किरदार टीम के लिए निभाने वाले हैं. टीम को कोच एंडी फ्लावर ने ऑक्शन से पहले कहा है कि आरसीबी के लिए सबसे बड़ी चुनौती है आईपीएल का खिताब जीतने का, ऐसे में टीम ऑक्शन में पूरी तैयारी के साथ जा रही है. फ्लॉवर ने कहा कि, मेरे लिए सबसे बड़ी चुनौती है कि इस टीम को खिताब दिलाना और एक ऐसी टीम तैयार करना जो आईपीएल का खिताब जीत सके. फाफ डुप्लेसी (कप्तान), रजत पाटीदार, विराट कोहली, अनुज रावत, दिनेश कार्तिक, सुयश प्रभुदेसाई, विल जैक्स, ग्लेन मैक्सवेल, महिपाल लोमरोर, करन शर्मा, मनोज भांडगे, आकाशदीप, मोहम्मद सिराज, रीस टॉप्ली, हिमांशु शर्मा, राजन कुमार, विजयकुमार, कैमरन ग्रीन और मयंक डागर पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-12-19 04:22:07","image_url":"https://i.ndtvimg.com/i/2016-10/andy-flower_650x400_61477408873.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"118db5a366bffcc8186fdb9fb50db0a7","title":"IPL 2024 Auction: Pat Cummins leads stars up for grabs in Dubai","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2024-auction-preview-13519092.html","keywords":["First Cricket News"],"creator":["Tanuj Lakhina"],"video_url":null,"description":"IPL 2024 Auction: Pat Cummins leads stars up for grabs in Dubai","content":"Cricket IPL 2024 Auction: Pat Cummins leads stars up for grabs in Dubai Pat Cummins, having led Australia to the World Cup title, is expected to draw the biggest bid at the IPL 2024 Auction. FirstCricket Staff December 19, 2023 09:42:28 IST Pat Cummins, who played for KKR earlier, is expected to be a big draw at the 2024 IPL Auction. Sportzpics Some of the world’s best cricketers will go under the hammer in Dubai on Tuesday in the mini-auction of the lucrative Indian Premier League (IPL). The franchises can start the bidding for their services from Rs 20 lakh but the best will be snapped up for many times that. IPL 2024 Auction: Everything You Need To Know At the auction, the 10 teams will have a combined Rs 262.95 crore to spend with Gujarat Titans holding the highest remaining purse (Rs 38.15 crore). Related Articles IPL 2024 Auction: Players that each franchise can target at mini-auction IPL 2024 Auction: Indian Premier League trophy unveiled in Dubai ahead of big event Pat Cummins is expected to be the biggest prize at this year’s IPL auction. The Aussie seamer missed last year’s IPL because of a packed calendar but will make a return having led his country to World Cup glory in India. Cummins, 30, who previously made an auction record of Rs 15.5 crore when he signed with the Kolkata Knight Riders in 2019, will enter with a top base price of Rs 2 crore. Josh Hazlewood, Travis Head, Josh Inglis, Mitchell Starc, Steve Smith and Sean Abbott will be among the other Australian World Cup winners in the hunt for a payday. Other names that can draw attention at the IPL auction: Rachin Ravindra amassed 578 runs in the recently-concluded World Cup and could go for big money at the IPL 2024 player auction. AP Rachin Ravindra , the up-and-coming batting all-rounder, scored three centuries in his 578 runs at the World Cup for a strike rate of 106, along with five tournament wickets. Ravindra, a left-handed batter and spinner, had his name chanted by Indian fans during the World Cup and can expect the same enthusiasm from franchises when his name comes up for grabs at a base price of Rs 50 lakh. IPL 2024 Auction: Player list, remaining slots and purse of all 10 franchises Harry Brook: Exciting England batter Brook has plundered runs in all three international formats and has a strike rate of 141.54 in the T20 version. He was snapped up by Sunrisers Hyderabad for Rs 13.25 crore in the previous auction but failed to make much of an impact, barring a century early in this year's IPL. The 24-year-old then managed just 169 runs in six World Cup matches, but recently hit a match-winning 43 in a West Indies ODI and has kept his base price at Rs 2 crore. Gerald Coetzee: One of the breakout stars of the World Cup, Coetzee finished inside the top five bowlers in the competition with 20 wickets. The South African quick made his debut early this year in a Test against West Indies at Centurion and has since played every format to add to the Proteas' pace riches. Coetzee, 23, is looking to boost his career in the money-spinning IPL and has kept himself in the top bracket with a base price of Rs 2 crore. IPL 2024 Auction: Glossary and rules Wanindu Hasaranga: The Sri Lankan has built a reputation of taking wickets at crucial junctures with his leg-spin and has been the country's go-to bowler in white-ball formats. The all-rounder earned a Rs 10.75 crore contract at Royal Challengers Bangalore in 2022 but was released by the team ahead of this year's auction. He has claimed 158 wickets in limited-overs formats and has a T20 strike rate of more than 124 as an attacking middle-order batsman. The 26-year-old missed the World Cup with injury but should expect another lucrative IPL contract with a base price of Rs 1.5 crore. The IPL tournament, the richest T20 league in cricket, is expected to begin in March. (with inputs from AFP) Join our Whatsapp channel to get the latest global news updates Published on: December 19, 2023 09:42:28 IST Tags: Cricket Ipl Ipl 2024 Auction Ipl Auction","pubDate":"2023-12-19 04:12:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/12/Pat-Cummins-Sportzpics-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bbd3a93fd6fad7cfb76f50638b8657cd","title":"Rohit Sharma नहीं, बल्कि रिकी पोंटिंग थे पुल शॉट के असली मास्टर, जन्मदिन पर जानें उनके कुछ अनोखे रिकॉर्ड की कहानी","link":"https://www.abplive.com/sports/cricket/ricky-ponting-birthday-he-was-the-real-master-of-pull-shots-not-rohit-sharma-2563974","keywords":["Cricket"],"creator":["देवेश झा"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Happy Birthday Ricky Ponting:</strong> अंतरराष्ट्रीय क्रिकेट में दुनिया के सबसे महान बल्लेबाजों और कप्तानों में से एक रिकी पोंटिंग आज 49 साल के हो गए हैं. रिकी पोंटिंग का जन्म 19 दिसंबर, 1974 को हुआ था, इसलिए आज वह अपना 49वां जन्मदिन मना रहे हैं. रिकी पोंटिंग विश्व क्रिकेट के एक महान खिलाड़ी हैं. उन्होंने अपनी बल्लेबाजी से तो कई खास रिकॉर्ड बनाए हैं, लेकिन उनकी कप्तानी के कई रिकॉर्ड आजतक कोई तोड़ नहीं पाया है.</p> <h2 style=\"text-align: justify;\"><strong>पुल शॉट के असली मास्टर रिकी पोंटिंग</strong></h2> <p style=\"text-align: justify;\">ऑस्ट्रेलिया के पूर्व कप्तान रिकी पोंटिंग का भारत के साथ हमेशा एक गहरा नाता रहा है. आईपीएल की शुरुआत होने के बाद रिकी पोंटिंग पहले एक खिलाड़ी, और फिर कोच के तौर पर हमेशा भारत में मौजूद रहे हैं. रिकी पोंटिंग की बल्लेबाजी में टाइमिंग के धनी थे. रिकी पोंटिंग के पास हर शॉट के लिए काफी टाइम होता था. आज के जमाने में दुनियाभर के क्रिकेट फैन्स रोहित शर्मा को सबसे अच्छी टाइमिंग वाला बल्लेबाज मानते हैं, और इसलिए वो सबसे अच्छा पुल शॉट भी मारते हैं, लेकिन असल में पुल शॉट के असली मास्टर रिकी पोंटिंग ही थे, जो उस दौर की मुश्किल गेंदबाजी और फील्डिंग परिस्थितियों में भी कमाल की टाइमिंग के साथ पुल शॉट मारा करते थे.</p> <h2 style=\"text-align: justify;\"><strong>रोहित-रिकी का रिश्ता</strong></h2> <p style=\"text-align: justify;\">इस बात को खुद रोहित शर्मा ने भी कई बार कहा है. रोहित शर्मा से जब पूछा जाता है कि उन्होंने किसे देखकर इतना अच्छा पुल शॉट मारना सीखा है, या उन्हें सबसे अच्छी टाइमिंग वाला बल्लेबाज कौन लगता है, तो वो हमेशा रिकी पोंटिंग का नाम लेते हैं. रोहित और रिकी का भी एक अलग रिश्ता रहा है. ये दोनों आईपीएल में मुंबई इंडियंस का हिस्सा रहे हैं. आईपीएल 2013 में मुंबई इंडियंस के कप्तान रिकी पोंटिंग ही थे, लेकिन बीच सीज़न में रिकी पोंटिंग ने कप्तानी छोड़कर रोहित शर्मा को कप्तानी सौंपी थी, और रोहित ने उसी साल अपनी टीम को चैंपियन बना दिया था, और उसके बाद कुल 5 बार आईपीएल चैंपियन बनाया.&nbsp;</p> <h2 style=\"text-align: justify;\"><strong>रिकी पोंटिंग के कुछ खास रिकॉर्ड्स</strong></h2> <p style=\"text-align: justify;\">बहरहाल, आइए हम आपको रिकी पोंटिंग के अंतरराष्ट्रीय करियर की कुछ बातें आपको बताते हैं:</p> <ul style=\"text-align: justify;\"> <li>रिकी पोंटिंग ने अपने टेस्ट करियर में कुल 13, 378 रन बनाए थे.</li> <li>रिकी पोंटिंग ने अपने वनडे करियर में कुल 13, 704 रन बनाए थे.</li> <li>रिकी पोंटिंग ने अंतरराष्ट्रीय क्रिकेट में कुल 70 शतक लगाए थे.</li> <li>रिकी पोंटिंग ने कुल 3 वर्ल्ड कप जीते थे.</li> <li>रिकी पोंटिंग ने बतौर कप्तान ऑस्ट्रेलिया को लगातार दो वर्ल्ड कप जिताए थे.</li> <li>रिकी पोंटिंग ने 2 बार चैंपियंस ट्रॉफी जीती.</li> <li>रिकी पोंटिंग ने बतौर कप्तान आईसीसी की 3 ट्रॉफियां जीती.</li> <li>रिकी पोंटिंग ऐसे खिलाड़ी हैं, जिन्होंने अपनी टीम की जीत में सबसे ज्यादा रन बनाए हैं.</li> <li>रिकी पोंटिंग ने वर्ल्ड कप 2003 के फाइनल में भारत के खिलाफ 140 रनों की शानदार पारी खेली थी, और प्लेयर ऑफ द मैच बने थे.</li> </ul> <p style=\"text-align: justify;\"><strong><a title=\"यह भी पढ़ें: IPL 2024 में आएंगे क्रिकेट के कुछ नए नियम, अब एक ओवर में दो बाउंसर फेंक पाएंगे बॉलर्स!\" href=\"https://www.abplive.com/sports/ipl/ipl-2024-bowler-can-bowl-2-bouncers-in-an-over-according-to-reports-2563959\" target=\"_self\">यह भी पढ़ें: IPL 2024 में आएंगे क्रिकेट के कुछ नए नियम, अब एक ओवर में दो बाउंसर फेंक पाएंगे बॉलर्स!</a></strong></p>","content":"Happy Birthday Ricky Ponting: अंतरराष्ट्रीय क्रिकेट में दुनिया के सबसे महान बल्लेबाजों और कप्तानों में से एक रिकी पोंटिंग आज 49 साल के हो गए हैं. रिकी पोंटिंग का जन्म 19 दिसंबर, 1974 को हुआ था, इसलिए आज वह अपना 49वां जन्मदिन मना रहे हैं. रिकी पोंटिंग विश्व क्रिकेट के एक महान खिलाड़ी हैं. उन्होंने अपनी बल्लेबाजी से तो कई खास रिकॉर्ड बनाए हैं, लेकिन उनकी कप्तानी के कई रिकॉर्ड आजतक कोई तोड़ नहीं पाया है. पुल शॉट के असली मास्टर रिकी पोंटिंग ऑस्ट्रेलिया के पूर्व कप्तान रिकी पोंटिंग का भारत के साथ हमेशा एक गहरा नाता रहा है. आईपीएल की शुरुआत होने के बाद रिकी पोंटिंग पहले एक खिलाड़ी, और फिर कोच के तौर पर हमेशा भारत में मौजूद रहे हैं. रिकी पोंटिंग की बल्लेबाजी में टाइमिंग के धनी थे. रिकी पोंटिंग के पास हर शॉट के लिए काफी टाइम होता था. आज के जमाने में दुनियाभर के क्रिकेट फैन्स रोहित शर्मा को सबसे अच्छी टाइमिंग वाला बल्लेबाज मानते हैं, और इसलिए वो सबसे अच्छा पुल शॉट भी मारते हैं, लेकिन असल में पुल शॉट के असली मास्टर रिकी पोंटिंग ही थे, जो उस दौर की मुश्किल गेंदबाजी और फील्डिंग परिस्थितियों में भी कमाल की टाइमिंग के साथ पुल शॉट मारा करते थे. Ricky Ponting - the master of Pull Shots. pic.twitter.com/gqiPEJNzXJ — Mufaddal Vohra (@mufaddal_vohra) December 19, 2023 रोहित-रिकी का रिश्ता इस बात को खुद रोहित शर्मा ने भी कई बार कहा है. रोहित शर्मा से जब पूछा जाता है कि उन्होंने किसे देखकर इतना अच्छा पुल शॉट मारना सीखा है, या उन्हें सबसे अच्छी टाइमिंग वाला बल्लेबाज कौन लगता है, तो वो हमेशा रिकी पोंटिंग का नाम लेते हैं. रोहित और रिकी का भी एक अलग रिश्ता रहा है. ये दोनों आईपीएल में मुंबई इंडियंस का हिस्सा रहे हैं. आईपीएल 2013 में मुंबई इंडियंस के कप्तान रिकी पोंटिंग ही थे, लेकिन बीच सीज़न में रिकी पोंटिंग ने कप्तानी छोड़कर रोहित शर्मा को कप्तानी सौंपी थी, और रोहित ने उसी साल अपनी टीम को चैंपियन बना दिया था, और उसके बाद कुल 5 बार आईपीएल चैंपियन बनाया. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); रिकी पोंटिंग के कुछ खास रिकॉर्ड्स बहरहाल, आइए हम आपको रिकी पोंटिंग के अंतरराष्ट्रीय करियर की कुछ बातें आपको बताते हैं: रिकी पोंटिंग ने अपने टेस्ट करियर में कुल 13, 378 रन बनाए थे. रिकी पोंटिंग ने अपने वनडे करियर में कुल 13, 704 रन बनाए थे. रिकी पोंटिंग ने अंतरराष्ट्रीय क्रिकेट में कुल 70 शतक लगाए थे. रिकी पोंटिंग ने कुल 3 वर्ल्ड कप जीते थे. रिकी पोंटिंग ने बतौर कप्तान ऑस्ट्रेलिया को लगातार दो वर्ल्ड कप जिताए थे. रिकी पोंटिंग ने 2 बार चैंपियंस ट्रॉफी जीती. रिकी पोंटिंग ने बतौर कप्तान आईसीसी की 3 ट्रॉफियां जीती. रिकी पोंटिंग ऐसे खिलाड़ी हैं, जिन्होंने अपनी टीम की जीत में सबसे ज्यादा रन बनाए हैं. रिकी पोंटिंग ने वर्ल्ड कप 2003 के फाइनल में भारत के खिलाफ 140 रनों की शानदार पारी खेली थी, और प्लेयर ऑफ द मैच बने थे. यह भी पढ़ें: IPL 2024 में आएंगे क्रिकेट के कुछ नए नियम, अब एक ओवर में दो बाउंसर फेंक पाएंगे बॉलर्स!","pubDate":"2023-12-19 04:10:59","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/19/5283cdff2b3a539abe88de1fe870ca621702957802884344_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"5f3a220ac8fb4a1952bce4c06393d575","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.brisbanetimes.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Loading Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Test cricket David Warner Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"5b40da67e8206c280b23e4d2bf8c182b","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.smh.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"3e29435e9cb39f4fa023ea8fefa03694","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.watoday.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Loading Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Test cricket David Warner Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"watoday","source_priority":347743,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"51c7d3b3158482da26fb331c9feda637","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.theage.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2d35f3aec5084c74654699daf7002bed","title":"Marvel-less: Bombers’ bid for extra MCG games","link":"https://www.brisbanetimes.com.au/sport/afl/marvel-less-bombers-bid-for-extra-mcg-games-20231219-p5esf6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Peter Ryan"],"video_url":null,"description":"Essendon are looking to play more home games at the MCG from 2025 onwards, with their agreement to play seven home games at Marvel Stadium finishing at the end of 2024.","content":"Essendon want to play an extra home game at the MCG after their contract to play seven home games per season at Marvel Stadium expires at the end of 2024. The Bombers have been pushing hard to turn their mix of games from 2025 onwards into five home games at the MCG and six at Marvel Stadium, the venue where they have been a tenant club since it opened in 2000. Essendon’s Anzac Day clash against Collingwood at the MCG is always a highlight Credit: The Age In 2024, because of the current contractual arrangement, they will play four home games at the MCG and seven at Marvel Stadium as they did in 2023. Last year, the Bombers played four home and four away games at the MCG, averaging 71,977 spectators for the eight matches at the venue while their average attendance in eight games at Marvel Stadium (seven home, one away) was 36,470. Their average crowds were a little more than 70 per cent of each venue’s capacity. Club CEO Craig Vozzo told members at the club’s annual general meeting the Bombers had been in constructive talks with the AFL about a different mix when the current contract with Marvel Stadium runs its course. “At the moment, it is four [games] at the ’G and seven [games] at Marvel. We would love to play at least another one to two games [at the MCG],” Vozzo said. “We’re aiming to for one to two over the next period of time, and we need to keep pushing our case in a considered way to achieve that outcome, and that is what we are committed to doing.” An opportunity could arise for Essendon to host Hawthorn and North Melbourne at the MCG as those clubs transition away from playing home games in Tasmania now that a licence has been awarded for a standalone team from the Apple Isle to join AFL. Increasing the number of home games Essendon play at the MCG has been on the club’s agenda for several years, but they have been unable to make significant progress because of their contract as a Marvel Stadium tenant, along with Carlton, St Kilda, the Western Bulldogs and North Melbourne. Essendon moved from Windy Hill to play home games at the MCG in 1992 before signing a deal to play home games at the new Docklands Stadium from 2000. Bombers president David Barham told members the club was committed to extra home games at the MCG, and it would be a matter of negotiating what’s possible with the Melbourne Cricket Club and also the AFL, which prepares the fixture and owns Marvel Stadium. The major tenants at the MCG – Collingwood, Richmond, Hawthorn and Melbourne – have won 10 of the past 12 AFL premierships. The AFL, MCG and Marvel Stadium declined to comment. Meanwhile, former Bomber Dean Rioli resigned from the club’s board because of personal reasons after becoming the first Indigenous director in the club’s history in November 2022. The club will look to replace him as it prepares for its VFL and VFLW sides to play a game in Darwin in January. The members also re-elected incumbents Kevin Sheedy and Tim Roberts to the board after anti-pokies campaigner Graham Evans standing was unable to unseat them despite their positions being made vacant. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2024 For subscribers Essendon Bombers Peter Ryan is a sports reporter with The Age. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-12-19 04:00:58","image_url":"https://static.ffx.io/images/$zoom_0.32013301088270857%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_jpg/30002122942afed4a50f7e34c7f467495da28c56","source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"52ea68b79483eaeb42c44e53ee8fd5a6","title":"Marvel-less: Bombers’ bid for extra MCG games","link":"https://www.smh.com.au/sport/afl/marvel-less-bombers-bid-for-extra-mcg-games-20231219-p5esf6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Peter Ryan"],"video_url":null,"description":"Essendon are looking to play more home games at the MCG from 2025 onwards, with their agreement to play seven home games at Marvel Stadium finishing at the end of 2024.","content":"Essendon want to play an extra home game at the MCG after their contract to play seven home games per season at Marvel Stadium expires at the end of 2024. The Bombers have been pushing hard to turn their mix of games from 2025 onwards into five home games at the MCG and six at Marvel Stadium, the venue where they have been a tenant club since it opened in 2000. Essendon’s Anzac Day clash against Collingwood at the MCG is always a highlight Credit: The Age In 2024, because of the current contractual arrangement, they will play four home games at the MCG and seven at Marvel Stadium as they did in 2023. Last year, the Bombers played four home and four away games at the MCG, averaging 71,977 spectators for the eight matches at the venue while their average attendance in eight games at Marvel Stadium (seven home, one away) was 36,470. Their average crowds were a little more than 70 per cent of each venue’s capacity. Club CEO Craig Vozzo told members at the club’s annual general meeting the Bombers had been in constructive talks with the AFL about a different mix when the current contract with Marvel Stadium runs its course. “At the moment, it is four [games] at the ’G and seven [games] at Marvel. We would love to play at least another one to two games [at the MCG],” Vozzo said. “We’re aiming to for one to two over the next period of time, and we need to keep pushing our case in a considered way to achieve that outcome, and that is what we are committed to doing.” An opportunity could arise for Essendon to host Hawthorn and North Melbourne at the MCG as those clubs transition away from playing home games in Tasmania now that a licence has been awarded for a standalone team from the Apple Isle to join AFL. Increasing the number of home games Essendon play at the MCG has been on the club’s agenda for several years, but they have been unable to make significant progress because of their contract as a Marvel Stadium tenant, along with Carlton, St Kilda, the Western Bulldogs and North Melbourne. Essendon moved from Windy Hill to play home games at the MCG in 1992 before signing a deal to play home games at the new Docklands Stadium from 2000. Bombers president David Barham told members the club was committed to extra home games at the MCG, and it would be a matter of negotiating what’s possible with the Melbourne Cricket Club and also the AFL, which prepares the fixture and owns Marvel Stadium. The major tenants at the MCG – Collingwood, Richmond, Hawthorn and Melbourne – have won 10 of the past 12 AFL premierships. The AFL, MCG and Marvel Stadium declined to comment. Meanwhile, former Bomber Dean Rioli resigned from the club’s board because of personal reasons after becoming the first Indigenous director in the club’s history in November 2022. The club will look to replace him as it prepares for its VFL and VFLW sides to play a game in Darwin in January. The members also re-elected incumbents Kevin Sheedy and Tim Roberts to the board after anti-pokies campaigner Graham Evans standing was unable to unseat them despite their positions being made vacant. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:00:58","image_url":"https://static.ffx.io/images/$zoom_0.32013301088270857%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_jpg/30002122942afed4a50f7e34c7f467495da28c56","source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"69dbab1cc5ac0b4ba78732d1a8f8d65b","title":"Marvel-less: Bombers’ bid for extra MCG games","link":"https://www.theage.com.au/sport/afl/marvel-less-bombers-bid-for-extra-mcg-games-20231219-p5esf6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Peter Ryan"],"video_url":null,"description":"Essendon are looking to play more home games at the MCG from 2025 onwards, with their agreement to play seven home games at Marvel Stadium finishing at the end of 2024.","content":"Essendon want to play an extra home game at the MCG after their contract to play seven home games per season at Marvel Stadium expires at the end of 2024. The Bombers have been pushing hard to turn their mix of games from 2025 onwards into five home games at the MCG and six at Marvel Stadium, the venue where they have been a tenant club since it opened in 2000. Essendon’s Anzac Day clash against Collingwood at the MCG is always a highlight Credit: The Age In 2024, because of the current contractual arrangement, they will play four home games at the MCG and seven at Marvel Stadium as they did in 2023. Last year, the Bombers played four home and four away games at the MCG, averaging 71,977 spectators for the eight matches at the venue while their average attendance in eight games at Marvel Stadium (seven home, one away) was 36,470. Their average crowds were a little more than 70 per cent of each venue’s capacity. Club CEO Craig Vozzo told members at the club’s annual general meeting the Bombers had been in constructive talks with the AFL about a different mix when the current contract with Marvel Stadium runs its course. “At the moment, it is four [games] at the ’G and seven [games] at Marvel. We would love to play at least another one to two games [at the MCG],” Vozzo said. “We’re aiming to for one to two over the next period of time, and we need to keep pushing our case in a considered way to achieve that outcome, and that is what we are committed to doing.” An opportunity could arise for Essendon to host Hawthorn and North Melbourne at the MCG as those clubs transition away from playing home games in Tasmania now that a licence has been awarded for a standalone team from the Apple Isle to join AFL. Increasing the number of home games Essendon play at the MCG has been on the club’s agenda for several years, but they have been unable to make significant progress because of their contract as a Marvel Stadium tenant, along with Carlton, St Kilda, the Western Bulldogs and North Melbourne. Essendon moved from Windy Hill to play home games at the MCG in 1992 before signing a deal to play home games at the new Docklands Stadium from 2000. Bombers president David Barham told members the club was committed to extra home games at the MCG, and it would be a matter of negotiating what’s possible with the Melbourne Cricket Club and also the AFL, which prepares the fixture and owns Marvel Stadium. The major tenants at the MCG – Collingwood, Richmond, Hawthorn and Melbourne – have won 10 of the past 12 AFL premierships. The AFL, MCG and Marvel Stadium declined to comment. Meanwhile, former Bomber Dean Rioli resigned from the club’s board because of personal reasons after becoming the first Indigenous director in the club’s history in November 2022. The club will look to replace him as it prepares for its VFL and VFLW sides to play a game in Darwin in January. The members also re-elected incumbents Kevin Sheedy and Tim Roberts to the board after anti-pokies campaigner Graham Evans standing was unable to unseat them despite their positions being made vacant. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:00:58","image_url":"https://static.ffx.io/images/$zoom_0.32013301088270857%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_jpg/30002122942afed4a50f7e34c7f467495da28c56","source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"071b2197f1a575a7692c92f1f41c2336","title":"IPL 2024 के ऑक्शन से पहले बड़ा ऐलान, कोच एंडी फ्लावर ने चुने RCB प्लेइंग XI के टॉप 5 खिलाड़ी","link":"https://sports.ndtv.com/hindi/cricket/andy-flower-confirms-the-top-4-for-rcb-in-ipl-2024-virat-kohli-faf-du-plessis-rajat-patidar-glenn-maxwell-rcb-playing-xi-4701085#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RCB in IPL 2024 Auction: एंडी फ्लावर ने ऑक्शन से पहले कहा है कि आरसीबी के लिए सबसे बड़ी चुनौती है आईपीएल का खिताब जीतने का, ऐसे में टीम ऑक्शन में पूरी तैयारी के साथ जा रही है.","content":"Royal Challengers Bangalore List For IPL 2024: टीम के कोच का बड़ा ऐलान आरसीबी ने आईपीएल 2024 से पहले एंडी फ्लावर को मुख्य कोच नियुक्त किया था. वहीं, अब कोच ने से पहले आरसीबी टीम के टॉप 4 खिलाड़ियों को कंफर्म किया जो इस बार के आईपीएल में टीम की प्लेइंग इलेवन में शामिल रहेंगे. कोच ने चैनल पर आरसीबी प्लेइंग इलेवन (RCB Playing XI for IPL 2024) के टॉप 4 खिलाड़ियों की घोषणा की है. Andy Flower ने कहा है कि इस बार के आईपीएल में आरसीबी के लिए ओपनर की भूमिका विराट कोहली और कप्तान फाफ डु प्लेसी निभाने वाले हैं तो वहीं नंबर 3 पर रजत रजत पाटीदार और नंबर 4 पर ग्लेन मैक्सवेल का नाम टीम के कोच ने लिया है. इसके अलावा कोच ने कैमरून ग्रीन को भी टॉप 5 में रखने की बात की है. इसके अलावा एंडी फ्लॉवर ने सिराज को लेकर भी बात की है और कहा है कि मोहम्मद सिराज आईपीएल में आरसीबी टीम की गेंदबाजी डिपार्टमेंट का नेतृत्व करेंगे. कोच ने कहा कि, सिराज एक बेहतरीन गेंदबाज हैं और फ्रेंचाइजी को पूरा यकीन है कि इस बार के आईपीएल में सिराज काफी अहम किरदार टीम के लिए निभाने वाले हैं. टीम को कोच एंडी फ्लावर ने ऑक्शन से पहले कहा है कि आरसीबी के लिए सबसे बड़ी चुनौती है आईपीएल का खिताब जीतने का, ऐसे में टीम ऑक्शन में पूरी तैयारी के साथ जा रही है. फ्लॉवर ने कहा कि, मेरे लिए सबसे बड़ी चुनौती है कि इस टीम को खिताब दिलाना और एक ऐसी टीम तैयार करना जो आईपीएल का खिताब जीत सके. फाफ डुप्लेसी (कप्तान), रजत पाटीदार, विराट कोहली, अनुज रावत, दिनेश कार्तिक, सुयश प्रभुदेसाई, विल जैक्स, ग्लेन मैक्सवेल, महिपाल लोमरोर, करन शर्मा, मनोज भांडगे, आकाशदीप, मोहम्मद सिराज, रीस टॉप्ली, हिमांशु शर्मा, राजन कुमार, विजयकुमार, कैमरन ग्रीन और मयंक डागर पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-12-19 04:22:07","image_url":"https://i.ndtvimg.com/i/2016-10/andy-flower_650x400_61477408873.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"118db5a366bffcc8186fdb9fb50db0a7","title":"IPL 2024 Auction: Pat Cummins leads stars up for grabs in Dubai","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2024-auction-preview-13519092.html","keywords":["First Cricket News"],"creator":["Tanuj Lakhina"],"video_url":null,"description":"IPL 2024 Auction: Pat Cummins leads stars up for grabs in Dubai","content":"Cricket IPL 2024 Auction: Pat Cummins leads stars up for grabs in Dubai Pat Cummins, having led Australia to the World Cup title, is expected to draw the biggest bid at the IPL 2024 Auction. FirstCricket Staff December 19, 2023 09:42:28 IST Pat Cummins, who played for KKR earlier, is expected to be a big draw at the 2024 IPL Auction. Sportzpics Some of the world’s best cricketers will go under the hammer in Dubai on Tuesday in the mini-auction of the lucrative Indian Premier League (IPL). The franchises can start the bidding for their services from Rs 20 lakh but the best will be snapped up for many times that. IPL 2024 Auction: Everything You Need To Know At the auction, the 10 teams will have a combined Rs 262.95 crore to spend with Gujarat Titans holding the highest remaining purse (Rs 38.15 crore). Related Articles IPL 2024 Auction: Players that each franchise can target at mini-auction IPL 2024 Auction: Indian Premier League trophy unveiled in Dubai ahead of big event Pat Cummins is expected to be the biggest prize at this year’s IPL auction. The Aussie seamer missed last year’s IPL because of a packed calendar but will make a return having led his country to World Cup glory in India. Cummins, 30, who previously made an auction record of Rs 15.5 crore when he signed with the Kolkata Knight Riders in 2019, will enter with a top base price of Rs 2 crore. Josh Hazlewood, Travis Head, Josh Inglis, Mitchell Starc, Steve Smith and Sean Abbott will be among the other Australian World Cup winners in the hunt for a payday. Other names that can draw attention at the IPL auction: Rachin Ravindra amassed 578 runs in the recently-concluded World Cup and could go for big money at the IPL 2024 player auction. AP Rachin Ravindra , the up-and-coming batting all-rounder, scored three centuries in his 578 runs at the World Cup for a strike rate of 106, along with five tournament wickets. Ravindra, a left-handed batter and spinner, had his name chanted by Indian fans during the World Cup and can expect the same enthusiasm from franchises when his name comes up for grabs at a base price of Rs 50 lakh. IPL 2024 Auction: Player list, remaining slots and purse of all 10 franchises Harry Brook: Exciting England batter Brook has plundered runs in all three international formats and has a strike rate of 141.54 in the T20 version. He was snapped up by Sunrisers Hyderabad for Rs 13.25 crore in the previous auction but failed to make much of an impact, barring a century early in this year's IPL. The 24-year-old then managed just 169 runs in six World Cup matches, but recently hit a match-winning 43 in a West Indies ODI and has kept his base price at Rs 2 crore. Gerald Coetzee: One of the breakout stars of the World Cup, Coetzee finished inside the top five bowlers in the competition with 20 wickets. The South African quick made his debut early this year in a Test against West Indies at Centurion and has since played every format to add to the Proteas' pace riches. Coetzee, 23, is looking to boost his career in the money-spinning IPL and has kept himself in the top bracket with a base price of Rs 2 crore. IPL 2024 Auction: Glossary and rules Wanindu Hasaranga: The Sri Lankan has built a reputation of taking wickets at crucial junctures with his leg-spin and has been the country's go-to bowler in white-ball formats. The all-rounder earned a Rs 10.75 crore contract at Royal Challengers Bangalore in 2022 but was released by the team ahead of this year's auction. He has claimed 158 wickets in limited-overs formats and has a T20 strike rate of more than 124 as an attacking middle-order batsman. The 26-year-old missed the World Cup with injury but should expect another lucrative IPL contract with a base price of Rs 1.5 crore. The IPL tournament, the richest T20 league in cricket, is expected to begin in March. (with inputs from AFP) Join our Whatsapp channel to get the latest global news updates Published on: December 19, 2023 09:42:28 IST Tags: Cricket Ipl Ipl 2024 Auction Ipl Auction","pubDate":"2023-12-19 04:12:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/12/Pat-Cummins-Sportzpics-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bbd3a93fd6fad7cfb76f50638b8657cd","title":"Rohit Sharma नहीं, बल्कि रिकी पोंटिंग थे पुल शॉट के असली मास्टर, जन्मदिन पर जानें उनके कुछ अनोखे रिकॉर्ड की कहानी","link":"https://www.abplive.com/sports/cricket/ricky-ponting-birthday-he-was-the-real-master-of-pull-shots-not-rohit-sharma-2563974","keywords":["Cricket"],"creator":["देवेश झा"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Happy Birthday Ricky Ponting:</strong> अंतरराष्ट्रीय क्रिकेट में दुनिया के सबसे महान बल्लेबाजों और कप्तानों में से एक रिकी पोंटिंग आज 49 साल के हो गए हैं. रिकी पोंटिंग का जन्म 19 दिसंबर, 1974 को हुआ था, इसलिए आज वह अपना 49वां जन्मदिन मना रहे हैं. रिकी पोंटिंग विश्व क्रिकेट के एक महान खिलाड़ी हैं. उन्होंने अपनी बल्लेबाजी से तो कई खास रिकॉर्ड बनाए हैं, लेकिन उनकी कप्तानी के कई रिकॉर्ड आजतक कोई तोड़ नहीं पाया है.</p> <h2 style=\"text-align: justify;\"><strong>पुल शॉट के असली मास्टर रिकी पोंटिंग</strong></h2> <p style=\"text-align: justify;\">ऑस्ट्रेलिया के पूर्व कप्तान रिकी पोंटिंग का भारत के साथ हमेशा एक गहरा नाता रहा है. आईपीएल की शुरुआत होने के बाद रिकी पोंटिंग पहले एक खिलाड़ी, और फिर कोच के तौर पर हमेशा भारत में मौजूद रहे हैं. रिकी पोंटिंग की बल्लेबाजी में टाइमिंग के धनी थे. रिकी पोंटिंग के पास हर शॉट के लिए काफी टाइम होता था. आज के जमाने में दुनियाभर के क्रिकेट फैन्स रोहित शर्मा को सबसे अच्छी टाइमिंग वाला बल्लेबाज मानते हैं, और इसलिए वो सबसे अच्छा पुल शॉट भी मारते हैं, लेकिन असल में पुल शॉट के असली मास्टर रिकी पोंटिंग ही थे, जो उस दौर की मुश्किल गेंदबाजी और फील्डिंग परिस्थितियों में भी कमाल की टाइमिंग के साथ पुल शॉट मारा करते थे.</p> <h2 style=\"text-align: justify;\"><strong>रोहित-रिकी का रिश्ता</strong></h2> <p style=\"text-align: justify;\">इस बात को खुद रोहित शर्मा ने भी कई बार कहा है. रोहित शर्मा से जब पूछा जाता है कि उन्होंने किसे देखकर इतना अच्छा पुल शॉट मारना सीखा है, या उन्हें सबसे अच्छी टाइमिंग वाला बल्लेबाज कौन लगता है, तो वो हमेशा रिकी पोंटिंग का नाम लेते हैं. रोहित और रिकी का भी एक अलग रिश्ता रहा है. ये दोनों आईपीएल में मुंबई इंडियंस का हिस्सा रहे हैं. आईपीएल 2013 में मुंबई इंडियंस के कप्तान रिकी पोंटिंग ही थे, लेकिन बीच सीज़न में रिकी पोंटिंग ने कप्तानी छोड़कर रोहित शर्मा को कप्तानी सौंपी थी, और रोहित ने उसी साल अपनी टीम को चैंपियन बना दिया था, और उसके बाद कुल 5 बार आईपीएल चैंपियन बनाया.&nbsp;</p> <h2 style=\"text-align: justify;\"><strong>रिकी पोंटिंग के कुछ खास रिकॉर्ड्स</strong></h2> <p style=\"text-align: justify;\">बहरहाल, आइए हम आपको रिकी पोंटिंग के अंतरराष्ट्रीय करियर की कुछ बातें आपको बताते हैं:</p> <ul style=\"text-align: justify;\"> <li>रिकी पोंटिंग ने अपने टेस्ट करियर में कुल 13, 378 रन बनाए थे.</li> <li>रिकी पोंटिंग ने अपने वनडे करियर में कुल 13, 704 रन बनाए थे.</li> <li>रिकी पोंटिंग ने अंतरराष्ट्रीय क्रिकेट में कुल 70 शतक लगाए थे.</li> <li>रिकी पोंटिंग ने कुल 3 वर्ल्ड कप जीते थे.</li> <li>रिकी पोंटिंग ने बतौर कप्तान ऑस्ट्रेलिया को लगातार दो वर्ल्ड कप जिताए थे.</li> <li>रिकी पोंटिंग ने 2 बार चैंपियंस ट्रॉफी जीती.</li> <li>रिकी पोंटिंग ने बतौर कप्तान आईसीसी की 3 ट्रॉफियां जीती.</li> <li>रिकी पोंटिंग ऐसे खिलाड़ी हैं, जिन्होंने अपनी टीम की जीत में सबसे ज्यादा रन बनाए हैं.</li> <li>रिकी पोंटिंग ने वर्ल्ड कप 2003 के फाइनल में भारत के खिलाफ 140 रनों की शानदार पारी खेली थी, और प्लेयर ऑफ द मैच बने थे.</li> </ul> <p style=\"text-align: justify;\"><strong><a title=\"यह भी पढ़ें: IPL 2024 में आएंगे क्रिकेट के कुछ नए नियम, अब एक ओवर में दो बाउंसर फेंक पाएंगे बॉलर्स!\" href=\"https://www.abplive.com/sports/ipl/ipl-2024-bowler-can-bowl-2-bouncers-in-an-over-according-to-reports-2563959\" target=\"_self\">यह भी पढ़ें: IPL 2024 में आएंगे क्रिकेट के कुछ नए नियम, अब एक ओवर में दो बाउंसर फेंक पाएंगे बॉलर्स!</a></strong></p>","content":"Happy Birthday Ricky Ponting: अंतरराष्ट्रीय क्रिकेट में दुनिया के सबसे महान बल्लेबाजों और कप्तानों में से एक रिकी पोंटिंग आज 49 साल के हो गए हैं. रिकी पोंटिंग का जन्म 19 दिसंबर, 1974 को हुआ था, इसलिए आज वह अपना 49वां जन्मदिन मना रहे हैं. रिकी पोंटिंग विश्व क्रिकेट के एक महान खिलाड़ी हैं. उन्होंने अपनी बल्लेबाजी से तो कई खास रिकॉर्ड बनाए हैं, लेकिन उनकी कप्तानी के कई रिकॉर्ड आजतक कोई तोड़ नहीं पाया है. पुल शॉट के असली मास्टर रिकी पोंटिंग ऑस्ट्रेलिया के पूर्व कप्तान रिकी पोंटिंग का भारत के साथ हमेशा एक गहरा नाता रहा है. आईपीएल की शुरुआत होने के बाद रिकी पोंटिंग पहले एक खिलाड़ी, और फिर कोच के तौर पर हमेशा भारत में मौजूद रहे हैं. रिकी पोंटिंग की बल्लेबाजी में टाइमिंग के धनी थे. रिकी पोंटिंग के पास हर शॉट के लिए काफी टाइम होता था. आज के जमाने में दुनियाभर के क्रिकेट फैन्स रोहित शर्मा को सबसे अच्छी टाइमिंग वाला बल्लेबाज मानते हैं, और इसलिए वो सबसे अच्छा पुल शॉट भी मारते हैं, लेकिन असल में पुल शॉट के असली मास्टर रिकी पोंटिंग ही थे, जो उस दौर की मुश्किल गेंदबाजी और फील्डिंग परिस्थितियों में भी कमाल की टाइमिंग के साथ पुल शॉट मारा करते थे. Ricky Ponting - the master of Pull Shots. pic.twitter.com/gqiPEJNzXJ — Mufaddal Vohra (@mufaddal_vohra) December 19, 2023 रोहित-रिकी का रिश्ता इस बात को खुद रोहित शर्मा ने भी कई बार कहा है. रोहित शर्मा से जब पूछा जाता है कि उन्होंने किसे देखकर इतना अच्छा पुल शॉट मारना सीखा है, या उन्हें सबसे अच्छी टाइमिंग वाला बल्लेबाज कौन लगता है, तो वो हमेशा रिकी पोंटिंग का नाम लेते हैं. रोहित और रिकी का भी एक अलग रिश्ता रहा है. ये दोनों आईपीएल में मुंबई इंडियंस का हिस्सा रहे हैं. आईपीएल 2013 में मुंबई इंडियंस के कप्तान रिकी पोंटिंग ही थे, लेकिन बीच सीज़न में रिकी पोंटिंग ने कप्तानी छोड़कर रोहित शर्मा को कप्तानी सौंपी थी, और रोहित ने उसी साल अपनी टीम को चैंपियन बना दिया था, और उसके बाद कुल 5 बार आईपीएल चैंपियन बनाया. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); रिकी पोंटिंग के कुछ खास रिकॉर्ड्स बहरहाल, आइए हम आपको रिकी पोंटिंग के अंतरराष्ट्रीय करियर की कुछ बातें आपको बताते हैं: रिकी पोंटिंग ने अपने टेस्ट करियर में कुल 13, 378 रन बनाए थे. रिकी पोंटिंग ने अपने वनडे करियर में कुल 13, 704 रन बनाए थे. रिकी पोंटिंग ने अंतरराष्ट्रीय क्रिकेट में कुल 70 शतक लगाए थे. रिकी पोंटिंग ने कुल 3 वर्ल्ड कप जीते थे. रिकी पोंटिंग ने बतौर कप्तान ऑस्ट्रेलिया को लगातार दो वर्ल्ड कप जिताए थे. रिकी पोंटिंग ने 2 बार चैंपियंस ट्रॉफी जीती. रिकी पोंटिंग ने बतौर कप्तान आईसीसी की 3 ट्रॉफियां जीती. रिकी पोंटिंग ऐसे खिलाड़ी हैं, जिन्होंने अपनी टीम की जीत में सबसे ज्यादा रन बनाए हैं. रिकी पोंटिंग ने वर्ल्ड कप 2003 के फाइनल में भारत के खिलाफ 140 रनों की शानदार पारी खेली थी, और प्लेयर ऑफ द मैच बने थे. यह भी पढ़ें: IPL 2024 में आएंगे क्रिकेट के कुछ नए नियम, अब एक ओवर में दो बाउंसर फेंक पाएंगे बॉलर्स!","pubDate":"2023-12-19 04:10:59","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/19/5283cdff2b3a539abe88de1fe870ca621702957802884344_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"5f3a220ac8fb4a1952bce4c06393d575","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.brisbanetimes.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Loading Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Test cricket David Warner Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"5b40da67e8206c280b23e4d2bf8c182b","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.smh.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"3e29435e9cb39f4fa023ea8fefa03694","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.watoday.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Loading Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Test cricket David Warner Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"watoday","source_priority":347743,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"51c7d3b3158482da26fb331c9feda637","title":"Why CA dropped Mitchell Johnson from speaking gigs at Perth Test","link":"https://www.theage.com.au/sport/cricket/why-ca-dropped-mitchell-johnson-from-speaking-gigs-at-perth-test-20231219-p5esib.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Andrew Wu"],"video_url":null,"description":"There was more fallout during the Perth Test over Mitchell Johnson’s spicy column attacking his former teammate David Warner.","content":"Speed demon Mitchell Johnson was pulled from speaking at two Cricket Australia functions during the Perth Test amid the fallout from his vitriolic column slamming David Warner. The governing body made the call to take Johnson out of the guest speaking jobs in the days leading into the game due to concerns over the tone and personal nature of his criticism of Warner and chief selector George Bailey. Mitchell Johnson was pulled from guest speaking at two official Cricket Australia functions during the Perth Test. Credit: Getty Images “Mitchell is one of Australia’s most celebrated bowlers, but we felt on this occasion it was in everyone’s best interests that he was not the guest speaker at the CA functions,” a CA spokesperson said. CA is adamant Johnson was not censored, but the governing body took proactive steps to ensure their players were not upset by the former paceman turned columnist speaking at an official function run by their employer. Johnson had been selected to speak through an agency organising the function, but CA did not sign off on his appearance in light of his fiery column, in which he slammed Warner for not accepting responsibility for the ball-tampering scandal, and nominating his retirement date while out of form. Johnson later admitted he regretted parts of his column, including the quip that “Bunnings would sell out of sandpaper” during Warner’s farewell Test tour. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:04:29","image_url":"https://static.ffx.io/images/$zoom_0.6517%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_104%2C$y_256/t_crop_custom/q_86%2Cf_jpg/82ec4cef23300a4b4d68ebbd433f2304f732c589","source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2d35f3aec5084c74654699daf7002bed","title":"Marvel-less: Bombers’ bid for extra MCG games","link":"https://www.brisbanetimes.com.au/sport/afl/marvel-less-bombers-bid-for-extra-mcg-games-20231219-p5esf6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Peter Ryan"],"video_url":null,"description":"Essendon are looking to play more home games at the MCG from 2025 onwards, with their agreement to play seven home games at Marvel Stadium finishing at the end of 2024.","content":"Essendon want to play an extra home game at the MCG after their contract to play seven home games per season at Marvel Stadium expires at the end of 2024. The Bombers have been pushing hard to turn their mix of games from 2025 onwards into five home games at the MCG and six at Marvel Stadium, the venue where they have been a tenant club since it opened in 2000. Essendon’s Anzac Day clash against Collingwood at the MCG is always a highlight Credit: The Age In 2024, because of the current contractual arrangement, they will play four home games at the MCG and seven at Marvel Stadium as they did in 2023. Last year, the Bombers played four home and four away games at the MCG, averaging 71,977 spectators for the eight matches at the venue while their average attendance in eight games at Marvel Stadium (seven home, one away) was 36,470. Their average crowds were a little more than 70 per cent of each venue’s capacity. Club CEO Craig Vozzo told members at the club’s annual general meeting the Bombers had been in constructive talks with the AFL about a different mix when the current contract with Marvel Stadium runs its course. “At the moment, it is four [games] at the ’G and seven [games] at Marvel. We would love to play at least another one to two games [at the MCG],” Vozzo said. “We’re aiming to for one to two over the next period of time, and we need to keep pushing our case in a considered way to achieve that outcome, and that is what we are committed to doing.” An opportunity could arise for Essendon to host Hawthorn and North Melbourne at the MCG as those clubs transition away from playing home games in Tasmania now that a licence has been awarded for a standalone team from the Apple Isle to join AFL. Increasing the number of home games Essendon play at the MCG has been on the club’s agenda for several years, but they have been unable to make significant progress because of their contract as a Marvel Stadium tenant, along with Carlton, St Kilda, the Western Bulldogs and North Melbourne. Essendon moved from Windy Hill to play home games at the MCG in 1992 before signing a deal to play home games at the new Docklands Stadium from 2000. Bombers president David Barham told members the club was committed to extra home games at the MCG, and it would be a matter of negotiating what’s possible with the Melbourne Cricket Club and also the AFL, which prepares the fixture and owns Marvel Stadium. The major tenants at the MCG – Collingwood, Richmond, Hawthorn and Melbourne – have won 10 of the past 12 AFL premierships. The AFL, MCG and Marvel Stadium declined to comment. Meanwhile, former Bomber Dean Rioli resigned from the club’s board because of personal reasons after becoming the first Indigenous director in the club’s history in November 2022. The club will look to replace him as it prepares for its VFL and VFLW sides to play a game in Darwin in January. The members also re-elected incumbents Kevin Sheedy and Tim Roberts to the board after anti-pokies campaigner Graham Evans standing was unable to unseat them despite their positions being made vacant. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2024 For subscribers Essendon Bombers Peter Ryan is a sports reporter with The Age. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-12-19 04:00:58","image_url":"https://static.ffx.io/images/$zoom_0.32013301088270857%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_jpg/30002122942afed4a50f7e34c7f467495da28c56","source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"52ea68b79483eaeb42c44e53ee8fd5a6","title":"Marvel-less: Bombers’ bid for extra MCG games","link":"https://www.smh.com.au/sport/afl/marvel-less-bombers-bid-for-extra-mcg-games-20231219-p5esf6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Peter Ryan"],"video_url":null,"description":"Essendon are looking to play more home games at the MCG from 2025 onwards, with their agreement to play seven home games at Marvel Stadium finishing at the end of 2024.","content":"Essendon want to play an extra home game at the MCG after their contract to play seven home games per season at Marvel Stadium expires at the end of 2024. The Bombers have been pushing hard to turn their mix of games from 2025 onwards into five home games at the MCG and six at Marvel Stadium, the venue where they have been a tenant club since it opened in 2000. Essendon’s Anzac Day clash against Collingwood at the MCG is always a highlight Credit: The Age In 2024, because of the current contractual arrangement, they will play four home games at the MCG and seven at Marvel Stadium as they did in 2023. Last year, the Bombers played four home and four away games at the MCG, averaging 71,977 spectators for the eight matches at the venue while their average attendance in eight games at Marvel Stadium (seven home, one away) was 36,470. Their average crowds were a little more than 70 per cent of each venue’s capacity. Club CEO Craig Vozzo told members at the club’s annual general meeting the Bombers had been in constructive talks with the AFL about a different mix when the current contract with Marvel Stadium runs its course. “At the moment, it is four [games] at the ’G and seven [games] at Marvel. We would love to play at least another one to two games [at the MCG],” Vozzo said. “We’re aiming to for one to two over the next period of time, and we need to keep pushing our case in a considered way to achieve that outcome, and that is what we are committed to doing.” An opportunity could arise for Essendon to host Hawthorn and North Melbourne at the MCG as those clubs transition away from playing home games in Tasmania now that a licence has been awarded for a standalone team from the Apple Isle to join AFL. Increasing the number of home games Essendon play at the MCG has been on the club’s agenda for several years, but they have been unable to make significant progress because of their contract as a Marvel Stadium tenant, along with Carlton, St Kilda, the Western Bulldogs and North Melbourne. Essendon moved from Windy Hill to play home games at the MCG in 1992 before signing a deal to play home games at the new Docklands Stadium from 2000. Bombers president David Barham told members the club was committed to extra home games at the MCG, and it would be a matter of negotiating what’s possible with the Melbourne Cricket Club and also the AFL, which prepares the fixture and owns Marvel Stadium. The major tenants at the MCG – Collingwood, Richmond, Hawthorn and Melbourne – have won 10 of the past 12 AFL premierships. The AFL, MCG and Marvel Stadium declined to comment. Meanwhile, former Bomber Dean Rioli resigned from the club’s board because of personal reasons after becoming the first Indigenous director in the club’s history in November 2022. The club will look to replace him as it prepares for its VFL and VFLW sides to play a game in Darwin in January. The members also re-elected incumbents Kevin Sheedy and Tim Roberts to the board after anti-pokies campaigner Graham Evans standing was unable to unseat them despite their positions being made vacant. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:00:58","image_url":"https://static.ffx.io/images/$zoom_0.32013301088270857%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_jpg/30002122942afed4a50f7e34c7f467495da28c56","source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"69dbab1cc5ac0b4ba78732d1a8f8d65b","title":"Marvel-less: Bombers’ bid for extra MCG games","link":"https://www.theage.com.au/sport/afl/marvel-less-bombers-bid-for-extra-mcg-games-20231219-p5esf6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Peter Ryan"],"video_url":null,"description":"Essendon are looking to play more home games at the MCG from 2025 onwards, with their agreement to play seven home games at Marvel Stadium finishing at the end of 2024.","content":"Essendon want to play an extra home game at the MCG after their contract to play seven home games per season at Marvel Stadium expires at the end of 2024. The Bombers have been pushing hard to turn their mix of games from 2025 onwards into five home games at the MCG and six at Marvel Stadium, the venue where they have been a tenant club since it opened in 2000. Essendon’s Anzac Day clash against Collingwood at the MCG is always a highlight Credit: The Age In 2024, because of the current contractual arrangement, they will play four home games at the MCG and seven at Marvel Stadium as they did in 2023. Last year, the Bombers played four home and four away games at the MCG, averaging 71,977 spectators for the eight matches at the venue while their average attendance in eight games at Marvel Stadium (seven home, one away) was 36,470. Their average crowds were a little more than 70 per cent of each venue’s capacity. Club CEO Craig Vozzo told members at the club’s annual general meeting the Bombers had been in constructive talks with the AFL about a different mix when the current contract with Marvel Stadium runs its course. “At the moment, it is four [games] at the ’G and seven [games] at Marvel. We would love to play at least another one to two games [at the MCG],” Vozzo said. “We’re aiming to for one to two over the next period of time, and we need to keep pushing our case in a considered way to achieve that outcome, and that is what we are committed to doing.” An opportunity could arise for Essendon to host Hawthorn and North Melbourne at the MCG as those clubs transition away from playing home games in Tasmania now that a licence has been awarded for a standalone team from the Apple Isle to join AFL. Increasing the number of home games Essendon play at the MCG has been on the club’s agenda for several years, but they have been unable to make significant progress because of their contract as a Marvel Stadium tenant, along with Carlton, St Kilda, the Western Bulldogs and North Melbourne. Essendon moved from Windy Hill to play home games at the MCG in 1992 before signing a deal to play home games at the new Docklands Stadium from 2000. Bombers president David Barham told members the club was committed to extra home games at the MCG, and it would be a matter of negotiating what’s possible with the Melbourne Cricket Club and also the AFL, which prepares the fixture and owns Marvel Stadium. The major tenants at the MCG – Collingwood, Richmond, Hawthorn and Melbourne – have won 10 of the past 12 AFL premierships. The AFL, MCG and Marvel Stadium declined to comment. Meanwhile, former Bomber Dean Rioli resigned from the club’s board because of personal reasons after becoming the first Indigenous director in the club’s history in November 2022. The club will look to replace him as it prepares for its VFL and VFLW sides to play a game in Darwin in January. The members also re-elected incumbents Kevin Sheedy and Tim Roberts to the board after anti-pokies campaigner Graham Evans standing was unable to unseat them despite their positions being made vacant. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-19 04:00:58","image_url":"https://static.ffx.io/images/$zoom_0.32013301088270857%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_jpg/30002122942afed4a50f7e34c7f467495da28c56","source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"}]}