{"newsArray":[{"article_id":"bf5823eb9a9976a995f19eecd58e9e4d","title":"Jos Buttler tells England to ‘let it hurt’ after World Cup loss to Afghanistan","link":"https://www.watfordobserver.co.uk/sport/national/23856917.jos-buttler-tells-england-let-hurt-world-cup-loss-afghanistan/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Buttler looked drained and drawn by events at the Arun Jaitley Stadium and accepted his side would need to feel some pain.","content":"The defending champions were thrashed by 69 runs in Delhi, dismissed for 215 with almost 10 overs to spare by a team who walked into the contest with a record of 16 defeats from the previous 17 World Cup matches. That their only previous success came against associates Scotland in 2015 makes the result, and the comfortable margin, even more remarkable. They are not down and out yet, with six group games still to play, but two losses from their first three games mean they must put together a near-perfect run to reach the semi-finals. Buttler looked drained and drawn by events at the Arun Jaitley Stadium and accepted his side would need to feel some pain before plotting their response. “It’s really disappointing. We came here today wanting to put in a really good performance and we got outplayed,” he said. “You’ve got to let these defeats hurt. Let it hurt; then try to figure out where we need to get better. “It never feels good; you never like losing games of cricket or not performing to the level you want to. “As a whole, we were not at the level we would like to be in a World Cup. On the field and off it, we will be trying to put it right. “It’s a big setback. Before the tournament started it’s not how you would have looked at the first three results. “We’ve got to show a lot of character, a lot of resilience within the team and most of all a lot of belief.” England have plenty of issues to ponder when they relocate to Mumbai for what now seems a must-win clash against in-form South Africa. Chris Woakes continued an underwhelming start to the tournament and was awarded just four of his allotted 10 overs after being flogged for 41. For a player who has so often set England up with new ball discipline, his struggles appear emblematic of a team struggling to reach their own high bar. Woakes sent down a wide from the first ball of the match, with Buttler nutmegging himself behind the stumps as the ball tricked away to the boundary rope. As a portent of what was to come, it felt apt. It was also telling that England ended up relying on 24 overs of spin having overlooked Moeen Ali – including a full 10 from Liam Livingstone for the first time in ODI cricket and four from the part-time Joe Root. “Maybe the conditions didn’t play quite as we thought they would. Obviously throughout our bowling innings, spin was the main threat,” he said. “Maybe there wasn’t quite as much dew as we thought there was and maybe the pitch didn’t quite play how we thought it would having watched a few games here so far in the tournament. “But first ball of the day I missed one and it sort of set the tone.” Former England batter Jonathan Trott, forging a new path now as the Afghanistan head coach, was beaming after landing the biggest scalps of his career. “It’s always nice. I think I’ll take any victory. I’m very proud of the performance, whether it’s against England or not,” he said. “I know that the players and the coaching staff deserve it. I’m very keen not to put a dampener on things. “I never soaked up enough or enjoyed moments like this. I’m certainly going to say to the guys, enjoy tonight and, spend the time together, whatever you want to do. “If this can bring a smile to people’s faces anywhere in the world, but also encourage boys and girls to pick up a cricket bat or a cricket ball and get playing cricket in Afghanistan, then that’s the sort of the goal that’s been achieved.”","pubDate":"2023-10-15 21:18:16","image_url":"https://www.watfordobserver.co.uk/resources/images/17335489/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"52577be0343e4dee62cc343b806fc4f2","title":"AFL Draft Power Rankings: Four Tassie prospects in top 20 as Eagles academy gun surges into first-round mix","link":"https://www.foxsports.com.au/afl/draft/afl-draft-2023-power-rankings-afl-draft-news-rankings-after-2023-combine-date-picks-order/news-story/1169252a1e73bbf3d37d5dea0c5f3467","keywords":null,"creator":null,"video_url":null,"description":"While the top 10 has remained stable across recent months, there’s been big moves in the draft rankings among players in the mid to late first-round mix.","content":"While the top 10 has remained stable across recent months, there’s been big moves in the draft rankings among players in the mid to late first-round mix. There’s now four Tassie stars in the top 20, while a talented Eagles academy prospect and the brother of a Hawthorn gun have shot up the order too. After last weekend’s national combine, foxfooty.com.au presents its top 30 2023 AFL Draft Power Rankings ahead of the 2023 AFL Draft, which will be held across two nights: Monday November 20 (first round) and Tuesday November 21 (second round onwards). Watch every match of The ICC Men’s Cricket World Cup Live on Kayo Sports. Join Kayo now and start streaming instantly > Grand Final AFL Sep 30 2:30pm AEST FT Collingwood 90 Brisbane 86 MATCH CENTRE *Odds are current as of 16th October 2023, 7:40am AEST VIEW ALL SCORES Logan Morris of the Western Jets. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 30. LOGAN MORRIS July Ranking: 26 Position: Medium forward/defender Size: 192cm Clubs: Western Jets/Werribee Districts A consistent goalkicker over the past two years with the potential to be a damaging third tall at AFL level. After booting 31 goals from 14 games as a bottom-ager for the Jets, Morris kicked 30 majors from 10 games this year, including seven hauls of at least three goals. He also showed showing off his versatility for Vic Metro, playing the first two carnival games in defence before being swung forward for the final two games. Morris against WA kicked 4.1 from 16 disposals, while he also plucked 11 marks (five contested) as he showed off his elite hands and improved his aerobic capacity. Also kicked two goals in a one-off VFL game for Werribee. Mitchell Edwards of Western Australia. Picture: Sarah Reed/AFL Photos via Getty Images Source: Getty Images 29. MITCH EDWARDS July Ranking: 13 Position: Ruck Size: 205cm Clubs: Peel Thunder/South Mandurah A slide down the rankings for Edwards, who didn’t have a lot of luck at times during this year. One of the best pure rucks in the draft, Edwards has been likened to Tim English in terms of looks and playing style due to his ruck craft and aerial competitiveness. After impressive outings for the AFL Academy, Edwards copped a corky against South Australia then suffered a concussion against Vic Country, which meant he missed the last game against Vic Metro. He finished the season in Peel Thunder’s reserves side, playing six games. Edwards is linked to Fremantle via its Next Generation Academy, but the Dockers can only match a bid on him if it comes outside the top 40 — and even though there’s been a cooling regarding top-10 calculations, it’s unlikely Edwards is getting picked that late. Tew Jiath of the Gippsland Power. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 28. TEW JIATH July Ranking: Not ranked in top 30 Position: Medium defender Size: 187cm Clubs: Gippsland Power/Morwell Didn’t play for Vic Country and didn’t get a national combine invite, but Jiath is an outside chance to be taken in the first round. Jiath – the younger brother of Hawks defender Changkuoth Jiath – has surged up draft boards during the back-end of Gippsland Power’s Coates Talent League campaign, providing eye-catching dash, dare and intercept ability off half-back. His 29-disposal wildcard round display against the Stingrays was particularly noteworthy. Jiath is part of Hawthorn’s Next Generation Academy, meaning the Hawks have rights to match a bid on him if it comes after Pick 40. But Hawthorn appears increasingly likely to miss out on its top NGA prospect, who’s now expected to be drafted within the first 40 selections. George Stevens of the Rebels. Picture: Daniel Pockett/AFL Photos/via Getty Images Source: Getty Images 27. GEORGE STEVENS July Ranking: 24 Position: Midfielder/medium defender Size: 189cm Clubs: GWV Rebels/South Warrnambool Couldn’t have done much more on the field this year to boost his prospects. Only slips a little in these rankings as a few bolters have passed him. Still, Stevens was a standout for Vic Country across the carnival and starred for the Rebels in the Coates Talent League, averaging a whopping 29 disposals, five tackles and five inside 50. He finished third in the Morrish medal voting and was named captain of the league’s team of the year. A powerfully-built 189cm prospect, Stevens spent some time in defence this year, but clubs preferred seeing him as an on-baller where he showed off his cleanliness, decision-making skills and natural ball-winning ability. He plays with great presence when he goes on the ball and is hard to push over in the contest. Charlie Edwards of the Sandringham Dragons. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 26. CHARLIE EDWARDS July Ranking: Not ranked in top 30 Position: Midfielder/medium defender Size: 190cm Clubs: Sandringham Dragons/Sandhurst A genuine late-season bolter, Edwards’ shift from defence to the midfield has paid big dividends. He missed out on playing for Vic Metro at the national champs, but exploded in his final seven Coates Talent League games for the Dragons, booting seven goals and averaging 21 disposals and five inside 50s per outing. Edwards’ ability to burst away from congested stoppages has impressed recruiters, while his 190cm frame also appeals. Archie Roberts of the Sandringham Dragons. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 25. ARCHIE ROBERTS July Ranking: 27 Position: Medium defender Size: 182cm Clubs: Sandringham Dragons/Hampton Rovers Some clubs would have him much higher on their rankings, others would have him lower. After starring for the AFL Academy against Carlton in May, Roberts found plenty of the ball during the national carnival for Vic Metro, averaging 21 disposals and six rebound 50s while going at 75 per cent by foot. He then played three crucial finals to help the Dragons to the Talent League premiership, collecting 19, 25 and 16 disposals respectively. AFL recruiters have remained split over Roberts right throughout the season. His rebounding, ability to gain territory and aerobic capacity (6:08 2km time trial) is unquestionable, but scouts also have doubts over his kicking efficiency, decision-making and defensive accountability. Wouldn’t be a surprise to see him taken on the first night of the draft. William Green of the Northern Knights. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 24. WILL GREEN July Ranking: 25 Position: Ruck Size: 204cm Clubs: Northern Knights/Northcote Might now be the second-best ruck prospect in the draft. Green elevated his standing after an excellent carnival for Vic Metro where he showed off his running power, mobility, ruck craft and competitiveness. Green’s best game came against Ethan Read and the Allies, working himself into the game and finishing with 11 disposals, four clearances and a game-high 30 hit-outs. The Knights co-captain was then named as the starting ruck in the Coates Talent League team of the year after averaging 11 disposals, three marks an 23 hit-outs from 13 games. Koen Sanchez of Western Australia. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 23. KOEN SANCHEZ July Ranking: 19 Position: Small forward/midfielder Size: 176cm Clubs: East Fremantle/Applecross Mt Pleasant This will be too high for some, but we’re big fans of Sanchez — a pocket rocket who booted 6.8 and averaged 18 disposals and nine contested possessions for WA at the carnival. Sanchez played in the midfield for two champs games and as a forward for the other two. Clubs were particularly thrilled by Sanchez’s output when he played closer to goal in the champs as he showed off his powerful kick, goal sense, speed and agility. He was a ball magnet at WAFL colts level, averaging 25 disposals from six games. The reality is if he joins an AFL club, he’ll start as a small forward — and could play early. After being hampered by hip and groin issues for several years, Sanchez delivered at the right time of the year. Looms as a likely second-round pick. Archer Reid of the AFL Academy in action in May. Picture: Michael Willson/AFL Photos via Getty Images Source: Getty Images 22. ARCHER REID July Ranking: 17 Position: Ruck/key forward Size: 203cm Clubs: Gippsland Power/Inverloch-Kongwak An uber talented yet polarising key-position prospect with an enormous ceiling, Reid endured an inconsistent draft campaign. He entered this season as a possible top-10 pick, probably dipped across the first few months, found form and confidence for Gippsland after the champs then went goalless in his final four games. Reid, the brother of Essendon’s Zach Reid, is a mobile forward-ruck who’s exceptional overhead yet great below his knees and possesses good goal sense. His Round 11 Talent League game — 4.0 from 17 disposals, eight marks and 17 hit-outs against the Dragons — was Reid at his best. Will require patience from fans at AFL level, but if it clicks, he could be a tantalising player. Whether a club is prepared to use a first-round pick on him remains uncertain. Riley Hardeman of Swan Districts. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 21. RILEY HARDEMAN July Ranking: 20 Position: Medium defender Size: 185cm Clubs: Swan Districts/Caversham A hard-running defender and WA’s carnival captain, Hardeman had several standout games throughout his draft year. He racked up 23 disposals, nine marks and eight rebound 50s for WA against SA in the carnival, while he had 26-plus disposals in four of his seven colts games. Scouts have been pleased to see Hardeman’s growth in confidence to come forward and intercept mark this year to complement his strong rebounding traits, which include speed and a booming left-foot kick. Arie Schoenmaker of the Tassie Devils. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 20. ARIE SCHOENMAKER July Ranking: Not ranked in top 30 Position: Wing/key defender Size: 194cm Clubs: Tasmania Devils/Launceston A first-round bolter who’s impressed AFL clubs with his rapid on-field growth and off-field dedication to improve. Schoenmaker was hit with a 10-game ban at the start of the year for a training camp indiscretion involving alcohol with a group of his teammates. He didn’t play for the Tassie Devils until Round 8 of the Coates League and was only a late call-up into the Allies squad. But he couldn’t have been more impressive upon return, averaging 27 disposals and 10 rebound 50s for the Devils, while also averaging 16 disposals and eight marks for the Allies. Schoenmaker is the definition of a line-breaker, with the ability to change the course of matches by using his run and carry then thumping the ball forward with his long, raking left boot. He has the size to be a third tall defender, but admits he needs to regain his ability and confidence to intercept before moving into that role at AFL level. Clubs were keen to interview him at last week’s combine – and they were impressed with his willingness to own and learn from his early-year mistake. Now likely to be taken on the first night of the draft. Koltyn Tholstrup of Subiaco. Picture: Michael Klein Source: News Corp Australia 19. KOLTYN THOLSTRUP July Ranking: 18 Position: Medium forward Size: 184cm Clubs: Subiaco/Newtown Condingup A high impact and score involvements player, Tholstrup has been in the first-round mix all season. After missing WA’s first national champs game with a back issue, Tholstrup had several key moments during an impressive outing against SA, including a standout smother, a good contested mark and a classy late-game goal as he finished with 1.1 from 20 disposals, eight marks and four inside 50s. just as importantly, Tholstrup had consistent WAFL league exposure at Subiaco, kicking seven goals from 10 matches against bigger bodies. He also tested well at the combine, finishing equal-ninth in the 2km time trial (6:17) then second in the agility test (8.194). Tholstrup is a natural leader who brings ample energy to the footy field and prides himself on “leaving it all out on the field”. He’s drawn comparisons to North Melbourne star Cam Zurhaar – but he arguably has more polish and composure. Would be a shock if he isn’t taken in the first round. Lance Collard of Subiaco. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 18. LANCE COLLARD July Ranking: 30 Position: Small forward Size: 179cm Clubs: Subiaco/North Beach A few months ago, Collard would’ve been outside the top 40 of some club draft boards. Now he looms as genuine first-round chance – some scouts believe he’s WA’s most talented prospect – after an outstanding finish to his draft year. Collard had just one standout performance in a quiet national carnival for WA – 2.2 against Vic Country – although clubs were sympathetic to the fact he had asked to spend more time with his family during that period. But the Subiaco goalkicker – who’s blessed with an enormous leap, electric speed and great goal nous -produced a stunning back-end to his draft year at WAFL colts level, booting 10.1 in two finals to finish with 32.13 from 11 games for the season. Collard then impressed at the combine with a solid 2km time trial result of 6:32 before recording the fastest agility test of any prospect (8.157 seconds) and finishing fourth in the 20m sprint (2.923 seconds), while clubs were just as impressed by how he carried himself during the interview process. Collard, who grew up a Fremantle supporter, is tied to the Eagles via their Next Generation Academy. Yet West Coast can only match a bid on him if it lands outside the top 40 picks – and any hopes the Eagles had Collard wouldn’t be picked up in the top 40 are now surely dashed. Will McCabe of South Australia. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 17. WILL McCABE July Ranking: 16 Position: Key defender Size: 197cm Clubs: Central District/Tanunda Recruiters widely believe McCabe remains SA’s best first-round chance – yet he has ties to a Victorian club. While McCabe has endured an injury-interrupted 2023 campaign, his glimpses have put him in the first-round mix. He played most of his junior footy as a forward, but starred as a defender this year, averaging 22 disposals and six marks for Central District in the SANFL Under 18s. A mobile and athletic prospect who has great endurance, McCabe can play on either tall or small forwards due to his competitiveness in the air and at ground level. He’s also a precise user by foot, going at 86 per cent kicking efficiency during the national champs. McCabe is father-son eligible to the Hawks as his dad, Luke McCabe, played 138 games for Hawthorn between 1995 to 2004. He was due to meet with Hawthorn last week to chat through his nomination process, but the expectation is he’ll join the club under the father-son rule after the Hawks match a mid to late first-round bid. Caleb Windsor of the Eastern Ranges. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 16. CALEB WINDSOR July Ranking: Not ranked in top 30 Position: Wing Size: 184cm Clubs: Eastern Ranges/Lysterfield The best winger in the draft class a year where there aren’t too many wingers at the top. Windsor’s fan club has grown across the back-half of the season. After averaging 16 disposals and five inside 50s for Vic Metro at the national carnival, Windsor starred for the Ranges, averaging 19 disposals from his final eight Coates Talent League games. Bug what scouts were most impressed with was Windsor’s ability to push forward and consistently hit the scoreboard, kicking at least one goal in all of those eight matches. His electric speed as on display at the national combine, placing third in the 20m sprint (2.916) while also finishing inside the to 10 of both vertical jump tests. One recruiter told foxfooty.com.au last week Windsor looms as an “early teens pick”. James Leake of the Tassie Devils. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 15. JAMES LEAKE July Ranking: Not ranked in top 30 Position: Medium defender/forward Size: 188cm Clubs: Tasmania Devils/Launceston Hello and welcome to the first round mix, James Leake. And it’s richly deserved after a breathtaking back-end to his 2023 campaign. Leake earned a call-up to the Allies squad after a solid start to his Coates Talent League season across half-back – and he delivered on the national stage, playing all four games and averaging 16 disposals and five marks while going at 79 per cent efficiency by foot. But recruiters really took note where Leake was shifted forward late in the season for the Devils – a move that saw Leake kick 15 goals from his last five games, including a haul of five against the Stingrays and a match-turning three against the Falcons. Leake has an excellent leap and strong pair of hands, which helps him at both ends of the field. He’s composed with ball in hand and an excellent interceptor in defence, but lethal around goal inside 50. Should be a top-20 pick. Ollie Murphy of the Sandringham Dragons. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 14. OLLIE MURPHY July Ranking: 12 Position: Key defender Size: 200cm Clubs: Sandringham Dragons/East Brighton Vampires Prior to this year, Murphy was “hopeful” he’d be an AFL player come draft night. Several months later, he looms as a near-certain first-round pick after a captivating rise. Murphy claimed Vic Metro’s MVP award across the champs. One of his more impressive games was against the Allies where he did a great job on Jed Walter – after being moved onto him after quarter-time – while also finishing with 10 touches and five marks. After school footy commitments, Murphy settled back in defence for the finish of Sandringham’s premiership campaign, with his preliminary final performance against the Falcons (18 disposals, 8 marks) a standout. Murphy has great size and athletic ability — he ran a PB 2km time trial at the combine (6:18) — as well as a pinpoint left-foot kick, while he’s an aerial threat and not afraid to put his body on the line. Might’ve slid down a few boards in recent months but is still expected to be taken on the first night. Jordan Croft of Maribyrnong College. Picture: Daniel Pockett/AFL Photos/via Getty Images Source: Getty Images 13. JORDAN CROFT July Ranking: 15 Position: Key forward Size: 200cm Clubs: Calder Cannons/Maribyrnong Park One for Dogs fans to get excited about. Despite a quiet end to his Coates Talent League campaign, Croft still booted 23.17 from 11 games, with 21 of those goals coming across a scintillating seven-game stretch during the middle of the season. While he didn’t quite have the same impact in the national carnival, he was still a standout in Vic Metro’s win over South Australia, booting 3.2 from 10 disposals and three marks. An athletic 200cm prospect who covers the ground superbly – he ran the fourth-best 2km time at the combine (6:05) – Croft prides himself on his competitiveness, both in the air at ground level. He’s looked up to Bulldogs forward Aaron Naughton in that area – and he’s now almost certain to be training with Naughton at Whitten Oval later this year after Croft – the son of Matthew Croft, who played 186 games for the Western Bulldogs – officially nominated the Bulldogs under the father-son rule. He’s highly likely to attract a bit in the mid to later stages of the first round. Darcy Wilson of the Murray Bushrangers. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 12. DARCY WILSON July Ranking: 14 Position: Medium forward/midfielder Size: 185cm Clubs: Murray Bushrangers/Wangaratta Rovers The quiet achiever of this year’s class. Not a big talker off the field, but Wilson is a classy, hard-working prospect who lets his footy do the talking. He starred at every level he played at this season. Wilson kicked 4.3 and averaged 16 disposals and four inside 50s for Vic Country in the recent carnival after two solid games for the AFL Academy against Port Adelaide’s SANFL side (19 disposals) and Carlton’s VFL team (1.0, 12 disposals, 6 marks). Wilson also kicked 16 goals and averaged 25 disposals and four inside 50s for the Bushrangers from 11 Coates Talent League games. His three-goal, 21-disposal performance in the wildcard game against the Rebels was eye-catching. Classy yet exciting, zippy yet can run all day – he finished second in the 2km time trial (5:52) at the combine – daring with the ball yet still efficient — it’s no wonder Wilson is in the first-round mix. Jake Rogers of the AFL Academy with his best on ground medal in May. Picture: Michael Willson/AFL Photos via Getty Images Source: Getty Images 11. JAKE ROGERS July Ranking: 9 Position: Midfielder Size: 172cm Clubs: Gold Coast Suns Academy/Broadbeach A speedy, agile and tenacious prospect with great decision-making ability, Rogers is one of the cleanest players in the draft class who’s thrived at all levels this season. He averaged 26 disposals for the Suns academy in the Coates Talent League before winning the medal for the AFL Academy’s best player across its two matches against state league opposition. Rogers then earned All-Australian honours for his terrific national carnival for the Allies where he averaged 23 disposals, six clearances and five tackles. And he played three games for the Suns’ VFL side. Not only is Rogers clean, his creativity and vision allows him to set up scores for his team. He’s drawn comparisons with Suns co-captain Touk Miller – and, coincidentally, Rogers has worked closely with Miller across the past year in transforming himself from a small forward to a genuine on-baller. In fact Rogers, through the Suns academy system, believes he’s been treated as a first-year AFL player and, therefore, ready to go for next season. Taller Suns prospects Jed Walter and Ethan Read will likely attract top-10 bids before him, but Rogers won’t be too far behind the pair. Nate Caddy of Parade College. Picture: Daniel Pockett/AFL Photos/via Getty Images Source: Getty Images 10. NATE CADDY July Ranking: 11 Position: Medium forward/midfielder Size: 192cm Clubs: Northern Knights/Yarrambat Could be a bit higher than No. 10 on club draft boards, such is the growth left in him — both in his game and in his body. Caddy – the nephew of dual premiership Tiger Josh Caddy – is a unique goalkicker in that he has strong high-marking ability and plays with key-forward like power, dynamism and presence, but isn’t as tall as some of other key forwards in this year’s draft class. To make up for that, he’s shown ominous explosiveness when pinch-hitting at centre bounces. There were three Coates Talent League games this year where he kicked at least four goals from 20-plus disposals. He competed hard without much scoreboard reward for effort for Vic Metro, kicking six goals from three national carnival games. Likely to first come under consideration when it’s the Giants’ turn to pick – and the sense is he won’t slide too far past that pick. Connor O'Sullivan. Picture: Dylan Burns/AFL Photos Source: News Corp Australia 9. CONNOR O’SULLIVAN July Ranking: 10 Position: Key defender Size: 198cm Clubs: Murray Bushrangers/Albury There’s a long queue of clubs interested in O’Sullivan, whose remarkable rise across 2023 has put him in the top-10 mix. He was named the Allies’ MVP – a big honour considering his team’s famous undefeated carnival campaign – after averaging 18 disposals and a competition-high eight marks. O’Sullivan started the Coates Talent League season as a forward but quickly settled down back, averaging 20 disposals and seven marks across nine games. A competitive and hard-working beast with a terrific set of hands – both in the air and at ground level – O’Sullivan is a genuine tall utility who can play inside either arc or even in the midfield – although he’s thrived this year playing predominantly as a key defender. He knows when to stay on his man and when to peel off and intercept – and he’s equally adept at both arts. Likely to come into the mix from Geelong’s first pick. Ryley Sanders of the Sandringham Dragons. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 8. RYLEY SANDERS July Ranking: 8 Position: Midfielder Size: 186cm Clubs: Sandringham Dragons/North Launceston Few players in this year’s pool showed metronomic consistency across all levels like Sanders did in 2023. The Tasmanian product, who’s boarding at Melbourne Grammar and playing for the Sandringham Dragons, barely plays a bad game, thanks to his competitiveness, inside-outside balance and clean hands. He took out the prestigious Larke Medal for the best player of the championships, averaging a whopping 36 disposals, 15 disposals, six inside 50s, six marks and five tackles for the Allies. A brilliant goal against WA — where he sharked a hit-out off WA’s Mitch Edwards, sprinted forward, took a bounce and nailed a kick from just inside the centre square — showcased his burst, power, class and composure in the one passage of play. He also averaged 31 disposals for the Dragons, racking up at least 25 touches in all of his nine games. North Melbourne pushed to have exclusive access to Sanders as part of its special assistance package, but that request was denied. He’s still a Kangaroos North Generation Academy prospect, but there’s little chance he’s still on the board come Pick 10, let alone Pick 40, on draft night. Despite the Kangaroos’ attachment to Sanders, it’s unlikely they’ll use a top-three pick on him. The Western Bulldogs and Melbourne a few picks later, though, is when he’s expected to be in the mix. Nick Watson of Vic Metro. Picture: Chris Hyde/AFL Photos/via Getty Images Source: Getty Images 7. NICK WATSON July Ranking: 7 Position: Small forward Size: 170cm Clubs: Eastern Ranges/East Ringwood Aka ‘The Wizard’ — and for good reason, for he’s as fun and dynamic a prospect as we’ve seen for a while. And he’ll bring AFL fans through the turnstiles for many years. Watson finished as the leading goalkicker of the national carnival, booting 14.6 for Vic Metro. He also showed he could play further up the field during several games for the Eastern Ranges, including some impressive performances behind the ball. Watson describes himself as an “Energizer Bunny”, in that he likes to apply defensive pressure and get under the skin of his opponents. Unsurprisingly, he’s a big Tom Papley fan. With the ball, he has unbelievable goal sense, speed, finishing ability and cleanliness at ground level. The Western Bulldogs recently acquired Pick 4 in the trade period, with Watson undoubtedly in their mix. But whether he gets past Hawthorn remains unclear. Ethan Read of the Gold Coast Suns Academy. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 6. ETHAN READ July Ranking: 6 Position: Ruck/midfielder Size: 200cm Clubs: Gold Coast Suns Academy/Palm Beach Currumbin Suns academy teammate Jed Walter said it best: “Ethan is a freak.” For there aren’t too many 200cm prospects who can run a 5:56 2km time trial while also having the pinpoint skills and reflexes of a classy midfielder and the ability to play across all three lines. But that’s what Damien Hardwick and the Suns will be getting in Read next year. Read’s bonkers workrate and professionalism set him up for a big draft year. He starred for the Allies during the champs, averaging 22 disposals, three clearances, three tackles and 13 hit-outs to be named the All-Australian ruck. Before the carnival, Read averaged 20 disposals, 20 hit-outs and six marks for the Suns academy in the Coates Talent League before one VFL game for the Suns, in which he booted 0.4 from 12 touches. Allies coach Mark McVeigh reckons Read could play a Mark Blicavs-style role at AFL level and fill chasms wherever needed. A bit too early to know where a bid on Read could come, but surely the Suns will be forced to match by the time the Cats pick. Daniel Curtin of Western Australia. Picture: Paul Kane/AFL Photos/via Getty Images Source: Getty Images 5. DANIEL CURTIN July Ranking: 4 Position: Key defender/midfielder Size: 195cm Clubs: Claremont/West Coast If Harley Reid is the draft prospect who’s attracted the most media attention this year, Curtin isn’t far behind him. That’s because of West Coast’s interest in the local WA product. The professional Curtin showed great versatility across his four carnival games to win WA’s MVP award, averaging 24 disposals, nine contested possessions and five tackles while going at 82 per cent by foot. Most clubs see him developing into a composed intercept defender at AFL level. They were thrilled they got to see him take on Jed Walter when WA faced the Allies, while he played behind the ball in his six WAFL league games for Claremont. But Curtin showed in two carnival games against SA and Vic Metro that he can be a damaging tall midfielder as he covered the ground with a Marcus Bontempelli-like presence. Where Curtin lands on draft night, though, remains a mystery. If West Coast trades Pick 1, it’s highly like the club gets a pick back that allows it to take Curtin early. If the Eagles hold Pick 1 and take Reid, there’s every chance Curtin slides down the order as several clubs with early picks are after ball-winners or hybrid forwards. Zane Duursma of the Gippsland Power. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 4. ZANE DUURSMA July Ranking: 5 Position: Medium forward Size: 189cm Clubs: Gippsland Power/Foster Moves into the top four after an awesome finish to his Coates Talent League season. Duursma’s late surge was kickstarted by a dynamic, game-changing performance for Vic Country, kicking four goals – three in the third quarter to swing the game in his team’s favour – from 22 disposals, 10 marks and five inside 50s. He then turned it on for Gippsland Power, booting 20 goals and averaging 26 disposals from his final six games. After an indifferent start to the season, Duursma produced a timely reminder as to why he deserves to be taken at the pointy end of the draft. He’s competitive and strong in the air, explosive out of stoppages, crafty around goal and composed with ball in hand. Should the draft order remain as is, it’s hard to see North Melbourne passing on Duursma. If the Roos do, he won’t get past Hawthorn. Colby McKercher of the Allies. Picture: Sarah Reed/AFL Photos via Getty Images Source: Getty Images 3. COLBY McKERCHER July Ranking: 3 Position: Midfielder Size: 182cm Clubs: Tasmania Devils/Launceston The best pure midfield prospect in a draft where most of the top prospects are outside the centre square – so you can understand why McKercher is in hot demand. McKercher, who’s been likened to Essendon captain Zach Merrett, finished second in the Larke Medal voting after averaging 33 disposals, six marks, six clearances and five inside 50s across four national championships games for the Allies. He also claimed the Morrish Medal – the award given to the best and fairest player of the Coates Talent League – after kicking 11 goals and averaging 31 disposals from just eight games. McKercher is a speedy, clean and damaging on-baller with a lovely inside-outside balance. He loves to take the game on to break open games and create scores – and he isn’t afraid to take the risky option during a match, for he has the kicking skills to often pull it off. Could be taken by North Melbourne with one of its top-three picks, otherwise one of Hawthorn or the Western Bulldogs should pounce soon after. Jed Walter of the Allies. Picture: Sarah Reed/AFL Photos via Getty Images Source: Getty Images 2. JED WALTER July Ranking: 2 Position: Key forward Size: 195cm Clubs: Gold Coast Suns Academy/Palm Beach Currumbin A few AFL clubs – and some of his draft class peers – would have Walter ahead of Harley Reid on their draft boards, for there hasn’t been a key forward prospect like him come through the system. After beating up on a few lower-ranked Coates Talent League teams earlier in the year, Walter showed his wares on the national stage for the Allies, booting 11.10 to earn All-Australian selection for the second straight season. A genuine power forward who loves the physicality of the game, Walter prides himself on his competitiveness in the air, ridiculous want to apply forward pressure and speed when running back to goal. One recruiter told foxfooty.com.au seeing Walter chase an opponent was like “watching a lion chase a zebra” and that there’d never been a key forward prospect so willing to apply relentless defensive pressure. North Melbourne should bid on Walter with one of their first two picks – and the Suns are well placed to match it. The prospect of him and Ben King teaming up in the same forward 50 – under the leadership of new coach Damien Hardwick – is tantalising. Harley Reid in action for the AFL Academy side. Picture: Michael Klein Source: News Corp Australia 1. HARLEY REID July Ranking: 1 Position: Midfielder/forward Size: 185cm Clubs: Bendigo Pioneers/Tongala Came into the season as the No. 1 draft prospect – one recruiter told foxfooty.com.au at the start of this year Reid was the best talent they‘d ever seen come through the pathway system – and will finish it in the same spot. An explosive, mid-sized prospect who’s drawn comparisons to Dustin Martin and plays with an infectious attitude, Reid can play across any line — and win games from any line. He has power at stoppages, great overhead marking ability, a penetrating kick and a knack for hitting the scoreboard consistently. Reid showed off his versatility and power across four national carnival matches, booting 5.6 and averaging 20 disposals, 13 contested possessions and a competition-high seven clearances to win Vic Country’s MVP award. Reid this year also played for the AFL Academy, Bendigo Pioneers, Carlton’s VFL side, Essendon’s VFL side and Tongala – and he admits he struggled to adapt to the different teams . But you wouldn’t have known that from the outside. It’s hard to think of a draft prospect who’s attracted as much attention and headlines as Reid had this year – he was even ‘papped’ at Perth airport then seen signing Eagles gear after a carnival game against WA – but he’s taken it in his stride. Reid should be taken at Pick 1. It’s just a case of which club will hold that pick, with North Melbourne, Hawthorn and Melbourne all set to make more offers to West Coast over the next month.","pubDate":"2023-10-15 20:36:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"29d8f4df0b4080fbe11ad2370d400ea7","title":"\"हमने गेंदबाजी चुनी लेकिन...\" कप्तान बटलर ने बताया अफगानिस्तान के हाथों मिली हार की बड़ी वजह","link":"https://sports.ndtv.com/hindi/cricket/jos-buttler-big-discloser-on-the-reason-of-losing-the-match-vs-afghanistan-in-world-cup-2023-points-table-4484071#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Jos Buttler on Lose over Afghanistan: अफगानिस्तान के हाथों विश्व कप मैच में उलटफेर का शिकार हुए मौजूदा चैम्पियन इंग्लैंड के कप्तान जोस बटलर ने कही दी बड़ी बात.","content":"Jos Buttler on Lose over Afghanistan in WC 2023 सलामी बल्लेबाज रहमानुल्लाह गुरबाज के 57 गेंद में 80 रन के बाद मुजीबुर रहमान की अगुवाई में अपने गेंदबाजों के शानदार प्रदर्शन के दम पर अफगानिस्तान ने इस विश्व कप का सबसे बड़ा उलटफेर करते हुए रविवार को गत चैम्पियन इंग्लैंड को 69 रन से हरा दिया. लंबे समय तक युद्ध की विभीषिका झेलने और राहत शिविरों के अलावा अपने ‘दूसरे घर' भारत में क्रिकेट का ककहरा सीखने वाले अफगान खिलाड़ियों ने अपने क्रिकेट इतिहास का सबसे सुनहरा पन्ना लिख डाला और उसके साक्षी रहे अरूण जेटली स्टेडियम पर उनकी हौसलाअफजाई करने पहुंचे 25000 से अधिक दर्शक. पहले दोनों मैच हारकर यहां आई अफगानिस्तान टीम ने बल्लेबाजी और गेंदबाजी दोनों में इंग्लैड को उन्नीस साबित कर दिया. अफगानिस्तान ने पहले बल्लेबाजी के लिये भेजे जाने पर 49.5 ओवर में 284 रन बनाये. जवाब में इंग्लैंड की टीम 40.3 ओवर में 215 रन पर आउट हो गई. राशिद खान ने जैसे ही मार्क वुड को बोल्ड किया , खुशी से उछलते अफगान क्रिकेटरों के चेहरों पर साफ था कि यह जीत उनके और उनके देश के लिये कितने मायने रखती है. इंग्लैंड के लिये हैरी ब्रूक (61 गेंद में 66 रन ) को छोड़कर कोई बल्लेबाज नहीं टिक सका. वहीं अफगानिस्तान के लिये पहले 16 गेंद में 28 रन बनाने वाले मुजीबुर ने गेंदबाजी में भी जलवा दिखाते हुए तीन विकेट चटकाये. अनुभवी स्पिनर मोहम्मद नबी ने छह ओवर में 16 रन देकर दो विकेट लिये. अफगानिस्तान के हाथों विश्व कप मैच में उलटफेर का शिकार हुए मौजूदा चैम्पियन इंग्लैंड के कप्तान जोस बटलर ने स्वीकार किया कि उनकी टीम उस स्तर पर नहीं खेल पा रही, जैसे खेलना चाहिये. अफगानिस्तान ने इस विश्व कप में सबसे बड़ा उलटफेर करते हुए रविवार को इंग्लैंड को 64 रन से हराया. हार के बाद बटलर ने कहा ,‘‘ यह निराशाजनक है. टॉस जीतने के बाद हमने गेंदबाजी चुनी लेकिन अपेक्षा के अनुरूप प्रदर्शन नहीं कर सके. अफगानिस्तान ने हर विभाग में हमें उन्नीस साबित किया.'' उन्होंने कहा ,‘‘हम उस स्तर पर नहीं खेल पा रहे हैं, जैसे हमें खेलना चाहिये. बल्ले और गेंद दोनों से निराशाजनक रहा. अफगानिस्तान के पास शानदार गेंदबाजी आक्रमण है और मैदान पर वैसी ओस भी नहीं थी जिसकी हमें उम्मीद थी.'' उन्होंने कहा ,‘‘ गेंद को असमान उछाल मिल रहा था. उन्होंने स्टम्प पर गेंद डाली और हम अच्छा खेल नहीं पाये. ऐसी हार खलती है और खलनी भी चाहिये लेकिन, हम इससे उबरकर वापसी करेंगे.'' पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-15 18:40:17","image_url":"https://c.ndtvimg.com/2022-07/h7jb9pbs_jos-buttler_160x120_18_July_22.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"e7862d59ceeb7db3d7e957aa5209fdcb","title":"Kal Ka Match Kaun Jeeta: कल का मैच कौन जीता- इंग्लैंड vs अफगानिस्तान","link":"https://hindi.oneindia.com/news/sports/cricket/kal-ka-match-kaun-jeeta-england-vs-afghanistan-world-cup-2023-834077.html","keywords":null,"creator":null,"video_url":null,"description":"Kal Ka Match Kaun Jeeta: कल का मैच अफगानिस्तान और इंग्लैंड के बीच खेला गया था। दिल्ली के अरुण जेटली स्टेडियम में यह मुकाबला खेला गया था। अफगानिस्तान ने इसमें धाकड़ जीत दर्ज की।","content":"डिफेंडिंग वर्ल्ड चैम्पियन इंग्लैंड के बीच मुकाबला खेला गया था। दिल्ली के अरुण जेटली स्टेडियम में खेले गए इस मुकाबले में अफगानिस्तान ने एक बड़ा धमाका कर दिया। इसके बारे में किसी ने भी शायद सोचा नहीं होगा। इंग्लैंड की टीम को मैच में अफगानिस्तान ने हरा दिया। अफगानिस्तान ने इस मुकाबले में 69 रनों के बड़े अंतर से जीत दर्ज कर ली। इस वर्ल्ड कप में अब तक का यह सबसे बड़ा उलटफेर है। मैच शुरू होने से पहले तक इंग्लैंड को ही इस मैच में फेवरेट माना जा रहा था। टॉस जीतकर इंग्लैंड के कप्तान जोस बटलर ने पहले गेंदबाजी करने का निर्णय लिया और यह उनके लिए गलत साबित हुआ। अफगानिस्तान के ओपनर गुरबाज और जादरान ने मिलकर पहले विकेट के लिए शतकीय भागीदारी की। गुरबाज ने 80 रन बनाए। बाद में इकराम अलीखिल ने भी अर्धशतक जड़ा। अफगानिस्तान की टीम 284 रनों का अच्छा स्कोर बनाकर आउट हो गई। इंग्लैंड की टीम के लिए सबसे अच्छी गेंदबाजी आदिल राशिद ने की थी। आदिल राशिद के खाते में कुल 3 विकेट आए। जवाबी पारी में खेलते हुए इंग्लैंड के बल्लेबाज अफगान स्पिनरों के आगे टिक ही नहीं पाए। एक के बाद एक विकेट गिरते चले गए और इंग्लैंड की परेशानी भी बढ़ती चली गई। सिर्फ हैरी ब्रूक ही एकमात्र ऐसे खिलाड़ी थे, जिनके बल्ले से फिफ्टी आई और वह 66 रन के निजी स्कोर पर आउट हो गए। इसके बाद टीम भी 215 पर आउट हो गई। अफगानिस्तान के लिए मुजीब उर रहमान और राशिद खान ने 3-3 विकेट अपने नाम किये। : रहमानुल्लाह गुरबाज (विकेटकीपर), इब्राहिम जादरान, रहमत शाह, हशमतुल्लाह शाहिदी (कप्तान), अजमतुल्लाह ओरजई, मोहम्मद नबी, इकराम अलीखिल, राशिद खान, मुजीब उर रहमान, नवीन उल हक, फजलहक फारुखी। जॉनी बेयरस्टो, डेविड मलान, जो रूट, हैरी ब्रूक, जोस बटलर (कप्तान), लियाम लिविंगस्टोन, सैम करेन, क्रिस वोक्स, मार्क वुड, आदिल रशीद, रीस टॉप्ली।","pubDate":"2023-10-15 18:20:11","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"6bdc2b632bf006ac427ead912c2282a9","title":"Joe Root ने गेंद से दिखाया जादू, बल्लेबाज को खड़े-खड़े कर दिया बोल्ड, अफगानिस्तानी कप्तान के उड़े होश, Video","link":"https://sports.ndtv.com/hindi/cricket/odi-world-cup-2023-hashmatullah-shahidi-wicket-viral-joe-root-magic-ball-england-vs-afghanistan-13th-match-4483188#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Joe Root ने मैच के दौरान एक ऐसी गेंद फेंकी जिसे देखकर हर कोई हैरान रह गया है. बल्लेबाज आउट होने के बाद यकीन ही नहीं कर पा रहा था कि उसके साथ ऐसा हो सकता है.","content":"Joe Root का मैजिक ODI World Cup 2023: वर्ल्ड कप 2023 के 13वें मैच में अफगानिस्तान के खिलाफ इंग्लैंड के पूर्व कप्तान जो रूट ने अपनी गेंदबाजी से जलवा दिखाया है. दरअसल, जो रूट ऐसे गेंदबाज हैं जो इंग्लैंड के लिए पार्ट टाइम गेंदबाज की भूमिका निभाते है. ऐसे में अफगानिस्तान के खिलाफ मैच के दौरान रूट ने अपनी एक मैजिक गेंद पर अफगानी कप्तान हशमतुल्ला शाहिदी को बोल्ड कर दिया. शाहिदी को यकीन ही नहीं हुआ कि वो पार्ट टाइम गेंदबाज के खिलाफ इस तरह से बोल्ड हो सकते हैं. यही कारण था कि आउट होने के बाद अफगानिस्तानी कप्तान हशमतुल्ला शाहिदी कुछ समय के लिए सन्न रह गए थे. आईसीसी ने सोशल मीडिया पर यह वीडियो भी पोस्ट किया है. जिसमें जो रूट अपनी मैजिक गेंद पर बल्लेबाज को खडे-खड़े बोल्ड कर देते हैं. जो रूट ने वनडे वर्ल्ड कप मे अपना यह चौथा विकेट हासिल किया. वहीं, मैच की बात करें तो इंग्लैंड ने मैच में टॉस जीतकर पहले गेंदबाजी करने का फैसला किया था. अफागनिस्तान की शुरुआत शानदार रही थी, गुरबाज और जादरान ने पहले विकेट के लिए 16.4 ओवर में 114 रन जोड़ने में सफल हो गए थे. गुरबाज मैच में 88 रन बनाकर आउट हुए. गुरबाज दुर्भाग्यशाली रहे कि मैच में वो शतक से चूके और रन आउट हो गए. वहीं, अपनी पारी के दौरान गुरबाज ने 33 गेंद पर अर्धशतक जमाने में सफलता पाई थी. उनकी गेंदबाजी देखकर ऐसा लग रहा था कि वो आज तूफानी शतक लगाएंगे लेकिन दुर्भाग्य से साथी खिलाड़ी के साथ रन लेने की हड़बड़ी में रन आउट हो गए. रहमानुल्लाह गुरबाज़ ने 57 गेंद पर 80 रन की पारी खेली जिसमें 8 चौके और 4 छक्के शामिल रहे. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-15 18:16:47","image_url":"https://c.ndtvimg.com/2023-10/00obtsj_joe-root_625x300_15_October_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"a99724415a6740f64114455bdde83f12","title":"Afridi flayed for comment on Indian bowlers","link":"https://www.dailymirror.lk/breaking-news/Afridi-flayed-for-comment-on-Indian-bowlers/108-269241","keywords":null,"creator":null,"video_url":null,"description":"Former captain of the Pakistan cricket team, Shahid Afridiâ€™s comment ascribing Indiaâ€™s success in cricket to a meat diet has drawn a lot of flak. â€™â€™India has a huge 1.4 billion population, and the quality of cricket has changed over the years. Back then, we used to say that they were producing great batters while Pakistan was creating good bowlers.","content":"Former captain of the Pakistan cricket team, Shahid Afridi’s comment ascribing India’s success in cricket to a meat diet has drawn a lot of flak. \"India has a huge 1.4 billion population, and the quality of cricket has changed over the years. Back then, we used to say that they were producing great batters while Pakistan was creating good bowlers. However, their bowlers have now started eating meat, so they have gained strength,\" Afridi was quoted as saying in a Pakistani sports show, according to reports. This comment has not gone down well with the former India fast bowler, Karsan Ghaveri. The 72-year-old former fast bowler, Ghavri, was one of the first to speak out against the comment. \"It is a stupid statement by Afridi. Vegetarians can have equal strength. Individuals might choose to be vegetarian or nonvegetarian. Our former players like Javagal Srinath, the late Yashpal Sharma, Dilip Doshi, and many others are or were pure vergeterians, and they all were successful players\". \"It is a stupid statement by Afridi. Vegetarian eaters can have equal strength, too. There may be more calories in meat, etc., but vegetables and soup have good protein\". \"Many medals have been won by Indian athletes at the Asian Games, and many of them are vegetarians,\" says Ghavri, who took 109 wickets in 39 Tests and 15 in 19 ODIs. \"One should not listen to Afridi's advice\". It is commonly said that cricketers must consume meat to get the required protein for physically demanding games. But meat is not the primary source of protein for every cricketer. In fact, several members of the present Indian team, like Virat Kohli, Rohit Sharma, Ravichandran Ashwin, and Hardik Pandya, have adopted a vegetarian diet, proving that it is possible to be successful on the field without being a non-vegetarian. Kohli admitted to being a vegetarian on Twitter, adding, \"The biggest myth in the world is that non-meat eaters cannot be muscular.\" (Bipin Dani)","pubDate":"2023-10-15 18:09:53","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_e376274b97.jpg","source_id":"dailymirror","source_priority":43341,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8c902d7f6a79d7747bf056f1bbbec9cf","title":"New captain Mendis says Sri Lanka have edge over Australia","link":"https://www.dailymirror.lk/breaking-news/New-captain-Mendis-says-Sri-Lanka-have-edge-over-Australia/108-269249","keywords":null,"creator":null,"video_url":null,"description":"Kusal Mendis, who had captaincy added to his workload on Friday after injured skipper Dasun Shanaka was ruled out of the Cricket World Cup 2023, believes Sri Lanka has the momentum against Australia, who they face on Monday at the Ekana Stadium in Lucknow.","content":"Kusal Mendis, who had captaincy added to his workload on Friday after injured skipper Dasun Shanaka was ruled out of the Cricket World Cup 2023, believes Sri Lanka has the momentum against Australia, who they face on Monday at the Ekana Stadium in Lucknow. Sri Lanka and Australia are yearning for their first win in the tournament with both sides losing their first two games. “The momentum is with us,” said Mendis, making his firs New captain Mendis says Sri Lanka have edge over Australia Kusal Mendis, who had captaincy added to his workload on Friday after injured skipper Dasun Shanaka was ruled out of the Cricket World Cup 2023, believes Sri Lanka has the momentum against Australia, who they face on Monday at the Ekana Stadium in Lucknow. Sri Lanka and Australia are yearning for their first win in the tournament with both sides losing their first two games. “The momentum is with us,” said Mendis, making his first appearance as Sri Lanka’s ODI skipper. “Yes, we have lost two games. But when you look at those losses, I think, we have done much better than the Australians. They will have some doubts about our team”. While Australia’s problem has been their batting, it has been the bowling for the Sri Lankans. But this does not bother him much as he said “Every bowling unit will struggle on Indian pitches”. “We need to adapt quickly and I strongly believe that the bowlers will do their part to the best of their ability. Not only us, even the top-quality attacks have been taken apart and conceded over 300 or 350 plus on these pitches,” he said, adding that his duty is to get the best out of the players. Mendis who has been the mainstay of Sri Lanka’s batting in the tournament, having scored 76 and 122 to go with his 158 in the practice game against Afghanistan said he will bat with the same aggression as he has done in the previous two games. \"I don't like to change the way I bat,” he said. “Before coming for the World Cup, I didn't think I would play at a higher strike rate like this. But after playing the two warm-up games, I understood that I can play freely, because the pitches are good. There will be times when I will have to be a bit more cautious in my approach because the bowlers will come hard at me with their plans. Even though I am the captain, I will not change the way I bat because I know if I am amongst the runs, we will be able to win games”. (Champika Fernando in Lucknow)","pubDate":"2023-10-15 18:09:53","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_a5500087ae.jpg","source_id":"dailymirror","source_priority":43341,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"aff27519556aa50d55a134546f0c9765","title":"[Breaking] Cricket World Cup: Afghanistan shock England","link":"https://blueprint.ng/breaking-cricket-world-cup-afghanistan-shock-england/","keywords":["Sports","#WorldCup","Cricket"],"creator":["Editor"],"video_url":null,"description":"Afghanistan produced the first shock of the ICC Cricket World Cup 2023 when they beat defending champions England by 69 runs on Sunday at the Arun Jaitley Stadium in New Delhi. Holders England crumbled for 215 runs in front of Afghanistan’s trio of spinners after winning the toss and asking Afghanistan to bat first. The underdogs set England a target Read More The post [Breaking] Cricket World Cup: Afghanistan shock England appeared first on Blueprint Newspapers Limited.","content":"Afghanistan produced the first shock of the ICC Cricket World Cup 2023 when they beat defending champions England by 69 runs on Sunday at the Arun Jaitley Stadium in New Delhi. Holders England crumbled for 215 runs in front of Afghanistan’s trio of spinners after winning the toss and asking Afghanistan to bat first. The underdogs set England a target of 285 runs, thanks to a blistering knock of 80 runs off 57 balls from opener Rahmanullah Gurbaz and a half-century from wicketkeeper Ikram Alikhil. Spinners Rashid Khan (23) and Mujeeb Ur Rahman (28) contributed in a lower-order flourish that saw Afghanistan put up a competitive total and allow their bowlers to go all-out against the England batters. Boasting a powerful batting lineup, England were handed an early loss when left-arm pacer Fazalhaq Farooqi dismissed opener Jonny Bairstow in the second over. From then on, Afghanistan’s spinners took over as off spinner Mujeeb Ur Rahman bowled out Joe Root for 11 runs and Mohammad Nabi dismissed Dawid Malan for 32. England captain Jos Buttler was dimissed for nine runs by pace bowler Naveen-ul-Haq. Star leg spinner Rashid Khan added to England’s woes by dismissing Liam Livingstone and Adil Rashid. Harry Brook put up a resistance with his 66-run innings, but fell to Mujeeb Ur Rahman in the 35th over to send England reeling at 169-8. England lost the tournament’s opening match against New Zealand by nine wickets, but beat Bangladesh by 137 runs. Afghanistan suffered heavy losses in both their matches, as they lost to Bangladesh by six wickets and then to hosts India by eight wickets.","pubDate":"2023-10-15 18:00:41","image_url":null,"source_id":"blueprint","source_priority":917110,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"ef3b55d79adbaf42081b7d2af46496eb","title":"England suffer one of the World Cup's biggest ever shocks as they fall to 69-run defeat and hand Afghanistan their second-ever tournament win","link":"https://www.dailymail.co.uk/sport/cricket/article-12633071/England-suffer-one-World-Cups-biggest-shocks-fall-69-run-defeat-against-Afghanistan.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH IN DELHI: England's World Cup defence is in tatters after they were humiliated by Afghanistan at the Feroz Shah Kotla.","content":"England suffer one of the World Cup's biggest ever shocks as they fall to 69-run defeat and hand Afghanistan their second-ever tournament win Jos Buttler's side were chasing 285 to win but fell well short of the target Afghanistan won just their second-ever World Cup match in Delhi World Cup holders may need to win five of last six matches to reach last four By Lawrence Booth for the Daily Mail Published: 17:01, 15 October 2023 | Updated: 18:48, 15 October 2023 e-mail 224 shares 150 View comments England's World Cup defence is in tatters after they were humiliated by Afghanistan at the Feroz Shah Kotla. The tournament, it's true, needed a shock to spice things up. But few expected this game to provide it. A chastening 69-run defeat leaves Jos Buttler 's side probably needing to win five of their remaining six games to reach the last four - and South Africa , India, Australia and Pakistan lie in wait. On this evidence, England will struggle to beat any of them. This was a glorious night for Afghanistan, and a huge feather in the cap of their English coach Jonathan Trott. In 17 previous World Cup matches, their only victims had been Scotland. To humble the world champions is on another level. Such was England's ineptitude, however, that it was if the white-ball revolution set in motion eight years ago by Eoin Morgan never happened. Where was the cleverness with the ball? The ability to react to circumstance? The relentless aggression with the bat? Buttler has played down the significance of his side's descent to fifth in the rankings. But England's alright-on-the-night mentality has produced two defeats out of three. Their aura is going, if not gone. Jos Buttler (right) saw his England side suffer one of the biggest shocks in World Cup history Afghanistan won just their second-ever match at a World Cup on a memorable night in Delhi Afghanistan opener Rahmanullah Gurbaz scored a spectacular 80 off just 57 balls to set the tone The tone was set by the game's opening delivery, which the increasingly hapless Chris Woakes speared down leg, and Buttler allowed to sneak through for five wides. And it continued as Afghanistan opener Rahmanullah Gurbaz flayed a spectacular 80 off 57 balls before being run out by a horrible call from his captain, Hashmatullah Shahidi. The spinners threatened to tilt the match England's way, only for more sloppiness - including a missed stumping by Buttler - to allow Afghanistan to turn 190 for six into 284. Four days earlier, against the same opponents at the same venue, India had easily knocked off 273 in 35 overs. But the suspicion that England are not the team they were - or even what they think they are - grew during a lame batting display in which only Harry Brook emerged with credit. If and when Ben Stokes returns against South Africa in Mumbai on Saturday, it cannot be Brook who makes way. Afghanistan were superb in pulling off their first win over England in any format. But this was a night to conjure up memories of the bad old times, and a 50-over World Cup defeat to rank with Zimbabwe at Albury in 1992, Australia at Port Elizabeth in 2003, Ireland at Bangalore in 2011 and Bangladesh at Adelaide in 2015. The warning signs have been there. They dismissed the nine-wicket hammering by New Zealand as an aberration, before Bangladesh failed to punish them for a lame final 10 overs with the bat in Dharamshala. But the conservatism that once blighted English cricket seems to have returned. England had a chance here to blood either Gus Atkinson or David Willey, or both. Instead, Woakes - one of the heroes of the Ashes comeback - has made himself unselectable, along with Sam Curran. Woakes has now taken two for 135 at this World Cup, and Curran two for 122. Their combined figures here were 8-0-87-0. All the while, Atkinson has been firing rockets in the nets under the approving eye of bowling coach David Saker. Woakes' first three overs cost 31, and when Buttler brought him back for the 25th, his second ball was whacked over long-on by Azmatullah Omarzai. He was not seen again. Curran, meanwhile, disappeared for 26 in his first two, then 18 in another towards the end. Harry Brook was the only England batter to show any fluency, scoring 66 runs as their batting order collapsed England struggled to deal with Afghanistan's spinners, with Mujeeb Ur Rahman (above) taking three wickets along with Rashid Khan Reece Topley bowled a decent opening spell, though hearts were in mouths when he briefly left the field after hurting his right knee on the boundary. Mark Wood deserved better than two for 50. But the mid-innings success of the spinners, led by Adil Rashid and reinforced by Liam Livingstone, made it all the more curious that Buttler gave only four overs to Root's off-breaks: figures of one for 19 felt unfulfilled. While England's three spinners took five for 94 off 24 overs, their four seamers managed three for 189 off 25.5. Like batting first, it was a misreading of the conditions. Buttler then failed to stump Afghanistan wicketkeeper Ikram Alikhil off Livingstone only 23 runs into his eventual 58, and England's nous deserted them completely at the death. The chase got off to a horrible start as Rod Tucker upheld a marginal lbw to dispatch Jonny Bairstow for two, playing round an inswinger from left-armer Fazalhaq Farooqi. Bairstow stormed off in high dudgeon. Afghanistan are coached by former England batter Jonathan Trott But with the exception of Brook, there was a deflating lack of intent. Joe Root stayed back to off-spinner Mujeeb Ur Rahman and was bowled for 11, before Dawid Malan chipped Mohammad Nabi to short extra for 32. When Buttler was bowled through a gap the size of nearby India Gate by a magnificent inswinger from Naveen-ul-Haq, it was 91 for four. Livingstone was plumb leg-before to Rashid Khan, and wasted a review, before Curran was caught at slip off Nabi. Woakes completed a miserable evening when he was bowled by Mujeeb, and England's final hope evaporated when Brook edged Mujeeb for an otherwise mature 66. On a pitch that slowed as the match progressed, their spinners finished with eight wickets. Soon, Afghanistan were celebrating their most famous night, and a large Delhi crowd celebrated with them. Only 10 days into a tournament England had designs on winning, they have barely half a hand on their trophy. Share or comment on this article: England suffer one of the World Cup's biggest ever shocks as they fall to 69-run defeat and hand Afghanistan their second-ever tournament win e-mail 224 shares Add comment Comments 151 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-15 17:48:29","image_url":"https://i.dailymail.co.uk/1s/2023/10/15/16/76585083-0-image-m-49_1697384578664.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0608b416f44c1670d03252084c92aab7","title":"Aaj Ka Match Kaun Jeeta: आज का मैच कौन जीता- इंग्लैंड vs अफगानिस्तान","link":"https://hindi.oneindia.com/news/sports/cricket/aaj-ka-match-kaun-jeeta-world-cup-mein-afghanistan-vs-england-834045.html","keywords":null,"creator":null,"video_url":null,"description":"England vs Afghanistan: अफगानिस्तान की टीम ने तगड़ा धमाका करते हुए वर्ल्ड चैम्पियन इंग्लैंड को पराजित कर दिया। यह सबसे बड़ा उल्टफेर है।","content":"अफगानिस्तान ने बड़ा उलटफेर कर दिया। दिल्ली के अरुण जेटली स्टेडियम में अफगानिस्तान की टीम ने वर्ल्ड चैम्पियन इंग्लैंड को 69 रनों पराजित कर दिया। साल 2011 में भारत में खेले गए वर्ल्ड कप में इंग्लैंड की टीम को आयरलैंड के खिलाफ हार मिली थी। टॉस जीतकर इंग्लैंड ने पहले गेंदबाजी करने का निर्णय लिया और यह गलत साबित हुआ। अफगानिस्तान के ओपनरों ने जमकर रन बना डाले। अफगानिस्तान के ओपनर गुरबाज और इब्राहिम जादरान के बल्ले से रन आए और एक शतकीय भागीदारी देखने को मिली। जादरान 28 रन की पारी खेलकर आउट हो गए लेकिन गुरबाज के बल्ले से लगातार रन आए। वह अपनी फिफ्टी के बाद भी टिके रहे। इस बीच रहमत शाह 3 रन बनाकर आउट हो गए और शाहीदी 14 रन के निजी स्कोर पर चलते बने। गुरबाज के बल्ले से शतक की उम्मीद थी लेकिन वह 80 के निजी स्कोर पर रन आउट हो गए। गुरबाज के अलावा इकराम अलीखिल ने भी अर्धशतक जड़ा और 58 के निजी स्कोर पर आउट होकर चलते बने। राशिद खान ने 23 और मुजीब उर रहमान ने 28 रनों की पारी खेली और अफगानिस्तान की टीम 284 पर आउट हुई। इंग्लैंड के लिए आदिल राशिद ने 3 विकेट झटके। जवाबी पारी में खेलते हुए इंग्लैंड की टीम ने बेयरस्टो का विकेट जल्दी गंवा दिया। वह 2 रन पर आउट हुए। यहाँ से नियमित अन्तराल पर विकेट गिरे। अफगानिस्तान के स्पिनरों ने इंग्लैंड को नचाया। मलान 32 और रूट 11 रन बनाकर आउट हो गए। एक के बाद एक विकेट गिरे लेकिन हैरी ब्रूक अकेले क्रीज पर टिके। वह 66 रन बनाकर चलते बने और यही इंग्लैंड की हार तय हो गई। अंत में इंग्लैंड की टीम 215 पर आउट हो गई और अफगानिस्तान ने एक बड़ा उलटफेर कर दिया। अफगानिस्तान ने मैच 69 रनों से अपने नाम कर लिया। अफगानिस्तान की टीम के लिए मुजीब उर रहमान और राशिद खान ने मिलकर 3-3 विकेट अपने नाम किये।","pubDate":"2023-10-15 17:44:09","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"bf5823eb9a9976a995f19eecd58e9e4d","title":"Jos Buttler tells England to ‘let it hurt’ after World Cup loss to Afghanistan","link":"https://www.watfordobserver.co.uk/sport/national/23856917.jos-buttler-tells-england-let-hurt-world-cup-loss-afghanistan/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Buttler looked drained and drawn by events at the Arun Jaitley Stadium and accepted his side would need to feel some pain.","content":"The defending champions were thrashed by 69 runs in Delhi, dismissed for 215 with almost 10 overs to spare by a team who walked into the contest with a record of 16 defeats from the previous 17 World Cup matches. That their only previous success came against associates Scotland in 2015 makes the result, and the comfortable margin, even more remarkable. They are not down and out yet, with six group games still to play, but two losses from their first three games mean they must put together a near-perfect run to reach the semi-finals. Buttler looked drained and drawn by events at the Arun Jaitley Stadium and accepted his side would need to feel some pain before plotting their response. “It’s really disappointing. We came here today wanting to put in a really good performance and we got outplayed,” he said. “You’ve got to let these defeats hurt. Let it hurt; then try to figure out where we need to get better. “It never feels good; you never like losing games of cricket or not performing to the level you want to. “As a whole, we were not at the level we would like to be in a World Cup. On the field and off it, we will be trying to put it right. “It’s a big setback. Before the tournament started it’s not how you would have looked at the first three results. “We’ve got to show a lot of character, a lot of resilience within the team and most of all a lot of belief.” England have plenty of issues to ponder when they relocate to Mumbai for what now seems a must-win clash against in-form South Africa. Chris Woakes continued an underwhelming start to the tournament and was awarded just four of his allotted 10 overs after being flogged for 41. For a player who has so often set England up with new ball discipline, his struggles appear emblematic of a team struggling to reach their own high bar. Woakes sent down a wide from the first ball of the match, with Buttler nutmegging himself behind the stumps as the ball tricked away to the boundary rope. As a portent of what was to come, it felt apt. It was also telling that England ended up relying on 24 overs of spin having overlooked Moeen Ali – including a full 10 from Liam Livingstone for the first time in ODI cricket and four from the part-time Joe Root. “Maybe the conditions didn’t play quite as we thought they would. Obviously throughout our bowling innings, spin was the main threat,” he said. “Maybe there wasn’t quite as much dew as we thought there was and maybe the pitch didn’t quite play how we thought it would having watched a few games here so far in the tournament. “But first ball of the day I missed one and it sort of set the tone.” Former England batter Jonathan Trott, forging a new path now as the Afghanistan head coach, was beaming after landing the biggest scalps of his career. “It’s always nice. I think I’ll take any victory. I’m very proud of the performance, whether it’s against England or not,” he said. “I know that the players and the coaching staff deserve it. I’m very keen not to put a dampener on things. “I never soaked up enough or enjoyed moments like this. I’m certainly going to say to the guys, enjoy tonight and, spend the time together, whatever you want to do. “If this can bring a smile to people’s faces anywhere in the world, but also encourage boys and girls to pick up a cricket bat or a cricket ball and get playing cricket in Afghanistan, then that’s the sort of the goal that’s been achieved.”","pubDate":"2023-10-15 21:18:16","image_url":"https://www.watfordobserver.co.uk/resources/images/17335489/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"52577be0343e4dee62cc343b806fc4f2","title":"AFL Draft Power Rankings: Four Tassie prospects in top 20 as Eagles academy gun surges into first-round mix","link":"https://www.foxsports.com.au/afl/draft/afl-draft-2023-power-rankings-afl-draft-news-rankings-after-2023-combine-date-picks-order/news-story/1169252a1e73bbf3d37d5dea0c5f3467","keywords":null,"creator":null,"video_url":null,"description":"While the top 10 has remained stable across recent months, there’s been big moves in the draft rankings among players in the mid to late first-round mix.","content":"While the top 10 has remained stable across recent months, there’s been big moves in the draft rankings among players in the mid to late first-round mix. There’s now four Tassie stars in the top 20, while a talented Eagles academy prospect and the brother of a Hawthorn gun have shot up the order too. After last weekend’s national combine, foxfooty.com.au presents its top 30 2023 AFL Draft Power Rankings ahead of the 2023 AFL Draft, which will be held across two nights: Monday November 20 (first round) and Tuesday November 21 (second round onwards). Watch every match of The ICC Men’s Cricket World Cup Live on Kayo Sports. Join Kayo now and start streaming instantly > Grand Final AFL Sep 30 2:30pm AEST FT Collingwood 90 Brisbane 86 MATCH CENTRE *Odds are current as of 16th October 2023, 7:40am AEST VIEW ALL SCORES Logan Morris of the Western Jets. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 30. LOGAN MORRIS July Ranking: 26 Position: Medium forward/defender Size: 192cm Clubs: Western Jets/Werribee Districts A consistent goalkicker over the past two years with the potential to be a damaging third tall at AFL level. After booting 31 goals from 14 games as a bottom-ager for the Jets, Morris kicked 30 majors from 10 games this year, including seven hauls of at least three goals. He also showed showing off his versatility for Vic Metro, playing the first two carnival games in defence before being swung forward for the final two games. Morris against WA kicked 4.1 from 16 disposals, while he also plucked 11 marks (five contested) as he showed off his elite hands and improved his aerobic capacity. Also kicked two goals in a one-off VFL game for Werribee. Mitchell Edwards of Western Australia. Picture: Sarah Reed/AFL Photos via Getty Images Source: Getty Images 29. MITCH EDWARDS July Ranking: 13 Position: Ruck Size: 205cm Clubs: Peel Thunder/South Mandurah A slide down the rankings for Edwards, who didn’t have a lot of luck at times during this year. One of the best pure rucks in the draft, Edwards has been likened to Tim English in terms of looks and playing style due to his ruck craft and aerial competitiveness. After impressive outings for the AFL Academy, Edwards copped a corky against South Australia then suffered a concussion against Vic Country, which meant he missed the last game against Vic Metro. He finished the season in Peel Thunder’s reserves side, playing six games. Edwards is linked to Fremantle via its Next Generation Academy, but the Dockers can only match a bid on him if it comes outside the top 40 — and even though there’s been a cooling regarding top-10 calculations, it’s unlikely Edwards is getting picked that late. Tew Jiath of the Gippsland Power. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 28. TEW JIATH July Ranking: Not ranked in top 30 Position: Medium defender Size: 187cm Clubs: Gippsland Power/Morwell Didn’t play for Vic Country and didn’t get a national combine invite, but Jiath is an outside chance to be taken in the first round. Jiath – the younger brother of Hawks defender Changkuoth Jiath – has surged up draft boards during the back-end of Gippsland Power’s Coates Talent League campaign, providing eye-catching dash, dare and intercept ability off half-back. His 29-disposal wildcard round display against the Stingrays was particularly noteworthy. Jiath is part of Hawthorn’s Next Generation Academy, meaning the Hawks have rights to match a bid on him if it comes after Pick 40. But Hawthorn appears increasingly likely to miss out on its top NGA prospect, who’s now expected to be drafted within the first 40 selections. George Stevens of the Rebels. Picture: Daniel Pockett/AFL Photos/via Getty Images Source: Getty Images 27. GEORGE STEVENS July Ranking: 24 Position: Midfielder/medium defender Size: 189cm Clubs: GWV Rebels/South Warrnambool Couldn’t have done much more on the field this year to boost his prospects. Only slips a little in these rankings as a few bolters have passed him. Still, Stevens was a standout for Vic Country across the carnival and starred for the Rebels in the Coates Talent League, averaging a whopping 29 disposals, five tackles and five inside 50. He finished third in the Morrish medal voting and was named captain of the league’s team of the year. A powerfully-built 189cm prospect, Stevens spent some time in defence this year, but clubs preferred seeing him as an on-baller where he showed off his cleanliness, decision-making skills and natural ball-winning ability. He plays with great presence when he goes on the ball and is hard to push over in the contest. Charlie Edwards of the Sandringham Dragons. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 26. CHARLIE EDWARDS July Ranking: Not ranked in top 30 Position: Midfielder/medium defender Size: 190cm Clubs: Sandringham Dragons/Sandhurst A genuine late-season bolter, Edwards’ shift from defence to the midfield has paid big dividends. He missed out on playing for Vic Metro at the national champs, but exploded in his final seven Coates Talent League games for the Dragons, booting seven goals and averaging 21 disposals and five inside 50s per outing. Edwards’ ability to burst away from congested stoppages has impressed recruiters, while his 190cm frame also appeals. Archie Roberts of the Sandringham Dragons. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 25. ARCHIE ROBERTS July Ranking: 27 Position: Medium defender Size: 182cm Clubs: Sandringham Dragons/Hampton Rovers Some clubs would have him much higher on their rankings, others would have him lower. After starring for the AFL Academy against Carlton in May, Roberts found plenty of the ball during the national carnival for Vic Metro, averaging 21 disposals and six rebound 50s while going at 75 per cent by foot. He then played three crucial finals to help the Dragons to the Talent League premiership, collecting 19, 25 and 16 disposals respectively. AFL recruiters have remained split over Roberts right throughout the season. His rebounding, ability to gain territory and aerobic capacity (6:08 2km time trial) is unquestionable, but scouts also have doubts over his kicking efficiency, decision-making and defensive accountability. Wouldn’t be a surprise to see him taken on the first night of the draft. William Green of the Northern Knights. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 24. WILL GREEN July Ranking: 25 Position: Ruck Size: 204cm Clubs: Northern Knights/Northcote Might now be the second-best ruck prospect in the draft. Green elevated his standing after an excellent carnival for Vic Metro where he showed off his running power, mobility, ruck craft and competitiveness. Green’s best game came against Ethan Read and the Allies, working himself into the game and finishing with 11 disposals, four clearances and a game-high 30 hit-outs. The Knights co-captain was then named as the starting ruck in the Coates Talent League team of the year after averaging 11 disposals, three marks an 23 hit-outs from 13 games. Koen Sanchez of Western Australia. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 23. KOEN SANCHEZ July Ranking: 19 Position: Small forward/midfielder Size: 176cm Clubs: East Fremantle/Applecross Mt Pleasant This will be too high for some, but we’re big fans of Sanchez — a pocket rocket who booted 6.8 and averaged 18 disposals and nine contested possessions for WA at the carnival. Sanchez played in the midfield for two champs games and as a forward for the other two. Clubs were particularly thrilled by Sanchez’s output when he played closer to goal in the champs as he showed off his powerful kick, goal sense, speed and agility. He was a ball magnet at WAFL colts level, averaging 25 disposals from six games. The reality is if he joins an AFL club, he’ll start as a small forward — and could play early. After being hampered by hip and groin issues for several years, Sanchez delivered at the right time of the year. Looms as a likely second-round pick. Archer Reid of the AFL Academy in action in May. Picture: Michael Willson/AFL Photos via Getty Images Source: Getty Images 22. ARCHER REID July Ranking: 17 Position: Ruck/key forward Size: 203cm Clubs: Gippsland Power/Inverloch-Kongwak An uber talented yet polarising key-position prospect with an enormous ceiling, Reid endured an inconsistent draft campaign. He entered this season as a possible top-10 pick, probably dipped across the first few months, found form and confidence for Gippsland after the champs then went goalless in his final four games. Reid, the brother of Essendon’s Zach Reid, is a mobile forward-ruck who’s exceptional overhead yet great below his knees and possesses good goal sense. His Round 11 Talent League game — 4.0 from 17 disposals, eight marks and 17 hit-outs against the Dragons — was Reid at his best. Will require patience from fans at AFL level, but if it clicks, he could be a tantalising player. Whether a club is prepared to use a first-round pick on him remains uncertain. Riley Hardeman of Swan Districts. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 21. RILEY HARDEMAN July Ranking: 20 Position: Medium defender Size: 185cm Clubs: Swan Districts/Caversham A hard-running defender and WA’s carnival captain, Hardeman had several standout games throughout his draft year. He racked up 23 disposals, nine marks and eight rebound 50s for WA against SA in the carnival, while he had 26-plus disposals in four of his seven colts games. Scouts have been pleased to see Hardeman’s growth in confidence to come forward and intercept mark this year to complement his strong rebounding traits, which include speed and a booming left-foot kick. Arie Schoenmaker of the Tassie Devils. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 20. ARIE SCHOENMAKER July Ranking: Not ranked in top 30 Position: Wing/key defender Size: 194cm Clubs: Tasmania Devils/Launceston A first-round bolter who’s impressed AFL clubs with his rapid on-field growth and off-field dedication to improve. Schoenmaker was hit with a 10-game ban at the start of the year for a training camp indiscretion involving alcohol with a group of his teammates. He didn’t play for the Tassie Devils until Round 8 of the Coates League and was only a late call-up into the Allies squad. But he couldn’t have been more impressive upon return, averaging 27 disposals and 10 rebound 50s for the Devils, while also averaging 16 disposals and eight marks for the Allies. Schoenmaker is the definition of a line-breaker, with the ability to change the course of matches by using his run and carry then thumping the ball forward with his long, raking left boot. He has the size to be a third tall defender, but admits he needs to regain his ability and confidence to intercept before moving into that role at AFL level. Clubs were keen to interview him at last week’s combine – and they were impressed with his willingness to own and learn from his early-year mistake. Now likely to be taken on the first night of the draft. Koltyn Tholstrup of Subiaco. Picture: Michael Klein Source: News Corp Australia 19. KOLTYN THOLSTRUP July Ranking: 18 Position: Medium forward Size: 184cm Clubs: Subiaco/Newtown Condingup A high impact and score involvements player, Tholstrup has been in the first-round mix all season. After missing WA’s first national champs game with a back issue, Tholstrup had several key moments during an impressive outing against SA, including a standout smother, a good contested mark and a classy late-game goal as he finished with 1.1 from 20 disposals, eight marks and four inside 50s. just as importantly, Tholstrup had consistent WAFL league exposure at Subiaco, kicking seven goals from 10 matches against bigger bodies. He also tested well at the combine, finishing equal-ninth in the 2km time trial (6:17) then second in the agility test (8.194). Tholstrup is a natural leader who brings ample energy to the footy field and prides himself on “leaving it all out on the field”. He’s drawn comparisons to North Melbourne star Cam Zurhaar – but he arguably has more polish and composure. Would be a shock if he isn’t taken in the first round. Lance Collard of Subiaco. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 18. LANCE COLLARD July Ranking: 30 Position: Small forward Size: 179cm Clubs: Subiaco/North Beach A few months ago, Collard would’ve been outside the top 40 of some club draft boards. Now he looms as genuine first-round chance – some scouts believe he’s WA’s most talented prospect – after an outstanding finish to his draft year. Collard had just one standout performance in a quiet national carnival for WA – 2.2 against Vic Country – although clubs were sympathetic to the fact he had asked to spend more time with his family during that period. But the Subiaco goalkicker – who’s blessed with an enormous leap, electric speed and great goal nous -produced a stunning back-end to his draft year at WAFL colts level, booting 10.1 in two finals to finish with 32.13 from 11 games for the season. Collard then impressed at the combine with a solid 2km time trial result of 6:32 before recording the fastest agility test of any prospect (8.157 seconds) and finishing fourth in the 20m sprint (2.923 seconds), while clubs were just as impressed by how he carried himself during the interview process. Collard, who grew up a Fremantle supporter, is tied to the Eagles via their Next Generation Academy. Yet West Coast can only match a bid on him if it lands outside the top 40 picks – and any hopes the Eagles had Collard wouldn’t be picked up in the top 40 are now surely dashed. Will McCabe of South Australia. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 17. WILL McCABE July Ranking: 16 Position: Key defender Size: 197cm Clubs: Central District/Tanunda Recruiters widely believe McCabe remains SA’s best first-round chance – yet he has ties to a Victorian club. While McCabe has endured an injury-interrupted 2023 campaign, his glimpses have put him in the first-round mix. He played most of his junior footy as a forward, but starred as a defender this year, averaging 22 disposals and six marks for Central District in the SANFL Under 18s. A mobile and athletic prospect who has great endurance, McCabe can play on either tall or small forwards due to his competitiveness in the air and at ground level. He’s also a precise user by foot, going at 86 per cent kicking efficiency during the national champs. McCabe is father-son eligible to the Hawks as his dad, Luke McCabe, played 138 games for Hawthorn between 1995 to 2004. He was due to meet with Hawthorn last week to chat through his nomination process, but the expectation is he’ll join the club under the father-son rule after the Hawks match a mid to late first-round bid. Caleb Windsor of the Eastern Ranges. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 16. CALEB WINDSOR July Ranking: Not ranked in top 30 Position: Wing Size: 184cm Clubs: Eastern Ranges/Lysterfield The best winger in the draft class a year where there aren’t too many wingers at the top. Windsor’s fan club has grown across the back-half of the season. After averaging 16 disposals and five inside 50s for Vic Metro at the national carnival, Windsor starred for the Ranges, averaging 19 disposals from his final eight Coates Talent League games. Bug what scouts were most impressed with was Windsor’s ability to push forward and consistently hit the scoreboard, kicking at least one goal in all of those eight matches. His electric speed as on display at the national combine, placing third in the 20m sprint (2.916) while also finishing inside the to 10 of both vertical jump tests. One recruiter told foxfooty.com.au last week Windsor looms as an “early teens pick”. James Leake of the Tassie Devils. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 15. JAMES LEAKE July Ranking: Not ranked in top 30 Position: Medium defender/forward Size: 188cm Clubs: Tasmania Devils/Launceston Hello and welcome to the first round mix, James Leake. And it’s richly deserved after a breathtaking back-end to his 2023 campaign. Leake earned a call-up to the Allies squad after a solid start to his Coates Talent League season across half-back – and he delivered on the national stage, playing all four games and averaging 16 disposals and five marks while going at 79 per cent efficiency by foot. But recruiters really took note where Leake was shifted forward late in the season for the Devils – a move that saw Leake kick 15 goals from his last five games, including a haul of five against the Stingrays and a match-turning three against the Falcons. Leake has an excellent leap and strong pair of hands, which helps him at both ends of the field. He’s composed with ball in hand and an excellent interceptor in defence, but lethal around goal inside 50. Should be a top-20 pick. Ollie Murphy of the Sandringham Dragons. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 14. OLLIE MURPHY July Ranking: 12 Position: Key defender Size: 200cm Clubs: Sandringham Dragons/East Brighton Vampires Prior to this year, Murphy was “hopeful” he’d be an AFL player come draft night. Several months later, he looms as a near-certain first-round pick after a captivating rise. Murphy claimed Vic Metro’s MVP award across the champs. One of his more impressive games was against the Allies where he did a great job on Jed Walter – after being moved onto him after quarter-time – while also finishing with 10 touches and five marks. After school footy commitments, Murphy settled back in defence for the finish of Sandringham’s premiership campaign, with his preliminary final performance against the Falcons (18 disposals, 8 marks) a standout. Murphy has great size and athletic ability — he ran a PB 2km time trial at the combine (6:18) — as well as a pinpoint left-foot kick, while he’s an aerial threat and not afraid to put his body on the line. Might’ve slid down a few boards in recent months but is still expected to be taken on the first night. Jordan Croft of Maribyrnong College. Picture: Daniel Pockett/AFL Photos/via Getty Images Source: Getty Images 13. JORDAN CROFT July Ranking: 15 Position: Key forward Size: 200cm Clubs: Calder Cannons/Maribyrnong Park One for Dogs fans to get excited about. Despite a quiet end to his Coates Talent League campaign, Croft still booted 23.17 from 11 games, with 21 of those goals coming across a scintillating seven-game stretch during the middle of the season. While he didn’t quite have the same impact in the national carnival, he was still a standout in Vic Metro’s win over South Australia, booting 3.2 from 10 disposals and three marks. An athletic 200cm prospect who covers the ground superbly – he ran the fourth-best 2km time at the combine (6:05) – Croft prides himself on his competitiveness, both in the air at ground level. He’s looked up to Bulldogs forward Aaron Naughton in that area – and he’s now almost certain to be training with Naughton at Whitten Oval later this year after Croft – the son of Matthew Croft, who played 186 games for the Western Bulldogs – officially nominated the Bulldogs under the father-son rule. He’s highly likely to attract a bit in the mid to later stages of the first round. Darcy Wilson of the Murray Bushrangers. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 12. DARCY WILSON July Ranking: 14 Position: Medium forward/midfielder Size: 185cm Clubs: Murray Bushrangers/Wangaratta Rovers The quiet achiever of this year’s class. Not a big talker off the field, but Wilson is a classy, hard-working prospect who lets his footy do the talking. He starred at every level he played at this season. Wilson kicked 4.3 and averaged 16 disposals and four inside 50s for Vic Country in the recent carnival after two solid games for the AFL Academy against Port Adelaide’s SANFL side (19 disposals) and Carlton’s VFL team (1.0, 12 disposals, 6 marks). Wilson also kicked 16 goals and averaged 25 disposals and four inside 50s for the Bushrangers from 11 Coates Talent League games. His three-goal, 21-disposal performance in the wildcard game against the Rebels was eye-catching. Classy yet exciting, zippy yet can run all day – he finished second in the 2km time trial (5:52) at the combine – daring with the ball yet still efficient — it’s no wonder Wilson is in the first-round mix. Jake Rogers of the AFL Academy with his best on ground medal in May. Picture: Michael Willson/AFL Photos via Getty Images Source: Getty Images 11. JAKE ROGERS July Ranking: 9 Position: Midfielder Size: 172cm Clubs: Gold Coast Suns Academy/Broadbeach A speedy, agile and tenacious prospect with great decision-making ability, Rogers is one of the cleanest players in the draft class who’s thrived at all levels this season. He averaged 26 disposals for the Suns academy in the Coates Talent League before winning the medal for the AFL Academy’s best player across its two matches against state league opposition. Rogers then earned All-Australian honours for his terrific national carnival for the Allies where he averaged 23 disposals, six clearances and five tackles. And he played three games for the Suns’ VFL side. Not only is Rogers clean, his creativity and vision allows him to set up scores for his team. He’s drawn comparisons with Suns co-captain Touk Miller – and, coincidentally, Rogers has worked closely with Miller across the past year in transforming himself from a small forward to a genuine on-baller. In fact Rogers, through the Suns academy system, believes he’s been treated as a first-year AFL player and, therefore, ready to go for next season. Taller Suns prospects Jed Walter and Ethan Read will likely attract top-10 bids before him, but Rogers won’t be too far behind the pair. Nate Caddy of Parade College. Picture: Daniel Pockett/AFL Photos/via Getty Images Source: Getty Images 10. NATE CADDY July Ranking: 11 Position: Medium forward/midfielder Size: 192cm Clubs: Northern Knights/Yarrambat Could be a bit higher than No. 10 on club draft boards, such is the growth left in him — both in his game and in his body. Caddy – the nephew of dual premiership Tiger Josh Caddy – is a unique goalkicker in that he has strong high-marking ability and plays with key-forward like power, dynamism and presence, but isn’t as tall as some of other key forwards in this year’s draft class. To make up for that, he’s shown ominous explosiveness when pinch-hitting at centre bounces. There were three Coates Talent League games this year where he kicked at least four goals from 20-plus disposals. He competed hard without much scoreboard reward for effort for Vic Metro, kicking six goals from three national carnival games. Likely to first come under consideration when it’s the Giants’ turn to pick – and the sense is he won’t slide too far past that pick. Connor O'Sullivan. Picture: Dylan Burns/AFL Photos Source: News Corp Australia 9. CONNOR O’SULLIVAN July Ranking: 10 Position: Key defender Size: 198cm Clubs: Murray Bushrangers/Albury There’s a long queue of clubs interested in O’Sullivan, whose remarkable rise across 2023 has put him in the top-10 mix. He was named the Allies’ MVP – a big honour considering his team’s famous undefeated carnival campaign – after averaging 18 disposals and a competition-high eight marks. O’Sullivan started the Coates Talent League season as a forward but quickly settled down back, averaging 20 disposals and seven marks across nine games. A competitive and hard-working beast with a terrific set of hands – both in the air and at ground level – O’Sullivan is a genuine tall utility who can play inside either arc or even in the midfield – although he’s thrived this year playing predominantly as a key defender. He knows when to stay on his man and when to peel off and intercept – and he’s equally adept at both arts. Likely to come into the mix from Geelong’s first pick. Ryley Sanders of the Sandringham Dragons. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 8. RYLEY SANDERS July Ranking: 8 Position: Midfielder Size: 186cm Clubs: Sandringham Dragons/North Launceston Few players in this year’s pool showed metronomic consistency across all levels like Sanders did in 2023. The Tasmanian product, who’s boarding at Melbourne Grammar and playing for the Sandringham Dragons, barely plays a bad game, thanks to his competitiveness, inside-outside balance and clean hands. He took out the prestigious Larke Medal for the best player of the championships, averaging a whopping 36 disposals, 15 disposals, six inside 50s, six marks and five tackles for the Allies. A brilliant goal against WA — where he sharked a hit-out off WA’s Mitch Edwards, sprinted forward, took a bounce and nailed a kick from just inside the centre square — showcased his burst, power, class and composure in the one passage of play. He also averaged 31 disposals for the Dragons, racking up at least 25 touches in all of his nine games. North Melbourne pushed to have exclusive access to Sanders as part of its special assistance package, but that request was denied. He’s still a Kangaroos North Generation Academy prospect, but there’s little chance he’s still on the board come Pick 10, let alone Pick 40, on draft night. Despite the Kangaroos’ attachment to Sanders, it’s unlikely they’ll use a top-three pick on him. The Western Bulldogs and Melbourne a few picks later, though, is when he’s expected to be in the mix. Nick Watson of Vic Metro. Picture: Chris Hyde/AFL Photos/via Getty Images Source: Getty Images 7. NICK WATSON July Ranking: 7 Position: Small forward Size: 170cm Clubs: Eastern Ranges/East Ringwood Aka ‘The Wizard’ — and for good reason, for he’s as fun and dynamic a prospect as we’ve seen for a while. And he’ll bring AFL fans through the turnstiles for many years. Watson finished as the leading goalkicker of the national carnival, booting 14.6 for Vic Metro. He also showed he could play further up the field during several games for the Eastern Ranges, including some impressive performances behind the ball. Watson describes himself as an “Energizer Bunny”, in that he likes to apply defensive pressure and get under the skin of his opponents. Unsurprisingly, he’s a big Tom Papley fan. With the ball, he has unbelievable goal sense, speed, finishing ability and cleanliness at ground level. The Western Bulldogs recently acquired Pick 4 in the trade period, with Watson undoubtedly in their mix. But whether he gets past Hawthorn remains unclear. Ethan Read of the Gold Coast Suns Academy. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 6. ETHAN READ July Ranking: 6 Position: Ruck/midfielder Size: 200cm Clubs: Gold Coast Suns Academy/Palm Beach Currumbin Suns academy teammate Jed Walter said it best: “Ethan is a freak.” For there aren’t too many 200cm prospects who can run a 5:56 2km time trial while also having the pinpoint skills and reflexes of a classy midfielder and the ability to play across all three lines. But that’s what Damien Hardwick and the Suns will be getting in Read next year. Read’s bonkers workrate and professionalism set him up for a big draft year. He starred for the Allies during the champs, averaging 22 disposals, three clearances, three tackles and 13 hit-outs to be named the All-Australian ruck. Before the carnival, Read averaged 20 disposals, 20 hit-outs and six marks for the Suns academy in the Coates Talent League before one VFL game for the Suns, in which he booted 0.4 from 12 touches. Allies coach Mark McVeigh reckons Read could play a Mark Blicavs-style role at AFL level and fill chasms wherever needed. A bit too early to know where a bid on Read could come, but surely the Suns will be forced to match by the time the Cats pick. Daniel Curtin of Western Australia. Picture: Paul Kane/AFL Photos/via Getty Images Source: Getty Images 5. DANIEL CURTIN July Ranking: 4 Position: Key defender/midfielder Size: 195cm Clubs: Claremont/West Coast If Harley Reid is the draft prospect who’s attracted the most media attention this year, Curtin isn’t far behind him. That’s because of West Coast’s interest in the local WA product. The professional Curtin showed great versatility across his four carnival games to win WA’s MVP award, averaging 24 disposals, nine contested possessions and five tackles while going at 82 per cent by foot. Most clubs see him developing into a composed intercept defender at AFL level. They were thrilled they got to see him take on Jed Walter when WA faced the Allies, while he played behind the ball in his six WAFL league games for Claremont. But Curtin showed in two carnival games against SA and Vic Metro that he can be a damaging tall midfielder as he covered the ground with a Marcus Bontempelli-like presence. Where Curtin lands on draft night, though, remains a mystery. If West Coast trades Pick 1, it’s highly like the club gets a pick back that allows it to take Curtin early. If the Eagles hold Pick 1 and take Reid, there’s every chance Curtin slides down the order as several clubs with early picks are after ball-winners or hybrid forwards. Zane Duursma of the Gippsland Power. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 4. ZANE DUURSMA July Ranking: 5 Position: Medium forward Size: 189cm Clubs: Gippsland Power/Foster Moves into the top four after an awesome finish to his Coates Talent League season. Duursma’s late surge was kickstarted by a dynamic, game-changing performance for Vic Country, kicking four goals – three in the third quarter to swing the game in his team’s favour – from 22 disposals, 10 marks and five inside 50s. He then turned it on for Gippsland Power, booting 20 goals and averaging 26 disposals from his final six games. After an indifferent start to the season, Duursma produced a timely reminder as to why he deserves to be taken at the pointy end of the draft. He’s competitive and strong in the air, explosive out of stoppages, crafty around goal and composed with ball in hand. Should the draft order remain as is, it’s hard to see North Melbourne passing on Duursma. If the Roos do, he won’t get past Hawthorn. Colby McKercher of the Allies. Picture: Sarah Reed/AFL Photos via Getty Images Source: Getty Images 3. COLBY McKERCHER July Ranking: 3 Position: Midfielder Size: 182cm Clubs: Tasmania Devils/Launceston The best pure midfield prospect in a draft where most of the top prospects are outside the centre square – so you can understand why McKercher is in hot demand. McKercher, who’s been likened to Essendon captain Zach Merrett, finished second in the Larke Medal voting after averaging 33 disposals, six marks, six clearances and five inside 50s across four national championships games for the Allies. He also claimed the Morrish Medal – the award given to the best and fairest player of the Coates Talent League – after kicking 11 goals and averaging 31 disposals from just eight games. McKercher is a speedy, clean and damaging on-baller with a lovely inside-outside balance. He loves to take the game on to break open games and create scores – and he isn’t afraid to take the risky option during a match, for he has the kicking skills to often pull it off. Could be taken by North Melbourne with one of its top-three picks, otherwise one of Hawthorn or the Western Bulldogs should pounce soon after. Jed Walter of the Allies. Picture: Sarah Reed/AFL Photos via Getty Images Source: Getty Images 2. JED WALTER July Ranking: 2 Position: Key forward Size: 195cm Clubs: Gold Coast Suns Academy/Palm Beach Currumbin A few AFL clubs – and some of his draft class peers – would have Walter ahead of Harley Reid on their draft boards, for there hasn’t been a key forward prospect like him come through the system. After beating up on a few lower-ranked Coates Talent League teams earlier in the year, Walter showed his wares on the national stage for the Allies, booting 11.10 to earn All-Australian selection for the second straight season. A genuine power forward who loves the physicality of the game, Walter prides himself on his competitiveness in the air, ridiculous want to apply forward pressure and speed when running back to goal. One recruiter told foxfooty.com.au seeing Walter chase an opponent was like “watching a lion chase a zebra” and that there’d never been a key forward prospect so willing to apply relentless defensive pressure. North Melbourne should bid on Walter with one of their first two picks – and the Suns are well placed to match it. The prospect of him and Ben King teaming up in the same forward 50 – under the leadership of new coach Damien Hardwick – is tantalising. Harley Reid in action for the AFL Academy side. Picture: Michael Klein Source: News Corp Australia 1. HARLEY REID July Ranking: 1 Position: Midfielder/forward Size: 185cm Clubs: Bendigo Pioneers/Tongala Came into the season as the No. 1 draft prospect – one recruiter told foxfooty.com.au at the start of this year Reid was the best talent they‘d ever seen come through the pathway system – and will finish it in the same spot. An explosive, mid-sized prospect who’s drawn comparisons to Dustin Martin and plays with an infectious attitude, Reid can play across any line — and win games from any line. He has power at stoppages, great overhead marking ability, a penetrating kick and a knack for hitting the scoreboard consistently. Reid showed off his versatility and power across four national carnival matches, booting 5.6 and averaging 20 disposals, 13 contested possessions and a competition-high seven clearances to win Vic Country’s MVP award. Reid this year also played for the AFL Academy, Bendigo Pioneers, Carlton’s VFL side, Essendon’s VFL side and Tongala – and he admits he struggled to adapt to the different teams . But you wouldn’t have known that from the outside. It’s hard to think of a draft prospect who’s attracted as much attention and headlines as Reid had this year – he was even ‘papped’ at Perth airport then seen signing Eagles gear after a carnival game against WA – but he’s taken it in his stride. Reid should be taken at Pick 1. It’s just a case of which club will hold that pick, with North Melbourne, Hawthorn and Melbourne all set to make more offers to West Coast over the next month.","pubDate":"2023-10-15 20:36:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"29d8f4df0b4080fbe11ad2370d400ea7","title":"\"हमने गेंदबाजी चुनी लेकिन...\" कप्तान बटलर ने बताया अफगानिस्तान के हाथों मिली हार की बड़ी वजह","link":"https://sports.ndtv.com/hindi/cricket/jos-buttler-big-discloser-on-the-reason-of-losing-the-match-vs-afghanistan-in-world-cup-2023-points-table-4484071#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Jos Buttler on Lose over Afghanistan: अफगानिस्तान के हाथों विश्व कप मैच में उलटफेर का शिकार हुए मौजूदा चैम्पियन इंग्लैंड के कप्तान जोस बटलर ने कही दी बड़ी बात.","content":"Jos Buttler on Lose over Afghanistan in WC 2023 सलामी बल्लेबाज रहमानुल्लाह गुरबाज के 57 गेंद में 80 रन के बाद मुजीबुर रहमान की अगुवाई में अपने गेंदबाजों के शानदार प्रदर्शन के दम पर अफगानिस्तान ने इस विश्व कप का सबसे बड़ा उलटफेर करते हुए रविवार को गत चैम्पियन इंग्लैंड को 69 रन से हरा दिया. लंबे समय तक युद्ध की विभीषिका झेलने और राहत शिविरों के अलावा अपने ‘दूसरे घर' भारत में क्रिकेट का ककहरा सीखने वाले अफगान खिलाड़ियों ने अपने क्रिकेट इतिहास का सबसे सुनहरा पन्ना लिख डाला और उसके साक्षी रहे अरूण जेटली स्टेडियम पर उनकी हौसलाअफजाई करने पहुंचे 25000 से अधिक दर्शक. पहले दोनों मैच हारकर यहां आई अफगानिस्तान टीम ने बल्लेबाजी और गेंदबाजी दोनों में इंग्लैड को उन्नीस साबित कर दिया. अफगानिस्तान ने पहले बल्लेबाजी के लिये भेजे जाने पर 49.5 ओवर में 284 रन बनाये. जवाब में इंग्लैंड की टीम 40.3 ओवर में 215 रन पर आउट हो गई. राशिद खान ने जैसे ही मार्क वुड को बोल्ड किया , खुशी से उछलते अफगान क्रिकेटरों के चेहरों पर साफ था कि यह जीत उनके और उनके देश के लिये कितने मायने रखती है. इंग्लैंड के लिये हैरी ब्रूक (61 गेंद में 66 रन ) को छोड़कर कोई बल्लेबाज नहीं टिक सका. वहीं अफगानिस्तान के लिये पहले 16 गेंद में 28 रन बनाने वाले मुजीबुर ने गेंदबाजी में भी जलवा दिखाते हुए तीन विकेट चटकाये. अनुभवी स्पिनर मोहम्मद नबी ने छह ओवर में 16 रन देकर दो विकेट लिये. अफगानिस्तान के हाथों विश्व कप मैच में उलटफेर का शिकार हुए मौजूदा चैम्पियन इंग्लैंड के कप्तान जोस बटलर ने स्वीकार किया कि उनकी टीम उस स्तर पर नहीं खेल पा रही, जैसे खेलना चाहिये. अफगानिस्तान ने इस विश्व कप में सबसे बड़ा उलटफेर करते हुए रविवार को इंग्लैंड को 64 रन से हराया. हार के बाद बटलर ने कहा ,‘‘ यह निराशाजनक है. टॉस जीतने के बाद हमने गेंदबाजी चुनी लेकिन अपेक्षा के अनुरूप प्रदर्शन नहीं कर सके. अफगानिस्तान ने हर विभाग में हमें उन्नीस साबित किया.'' उन्होंने कहा ,‘‘हम उस स्तर पर नहीं खेल पा रहे हैं, जैसे हमें खेलना चाहिये. बल्ले और गेंद दोनों से निराशाजनक रहा. अफगानिस्तान के पास शानदार गेंदबाजी आक्रमण है और मैदान पर वैसी ओस भी नहीं थी जिसकी हमें उम्मीद थी.'' उन्होंने कहा ,‘‘ गेंद को असमान उछाल मिल रहा था. उन्होंने स्टम्प पर गेंद डाली और हम अच्छा खेल नहीं पाये. ऐसी हार खलती है और खलनी भी चाहिये लेकिन, हम इससे उबरकर वापसी करेंगे.'' पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-15 18:40:17","image_url":"https://c.ndtvimg.com/2022-07/h7jb9pbs_jos-buttler_160x120_18_July_22.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"e7862d59ceeb7db3d7e957aa5209fdcb","title":"Kal Ka Match Kaun Jeeta: कल का मैच कौन जीता- इंग्लैंड vs अफगानिस्तान","link":"https://hindi.oneindia.com/news/sports/cricket/kal-ka-match-kaun-jeeta-england-vs-afghanistan-world-cup-2023-834077.html","keywords":null,"creator":null,"video_url":null,"description":"Kal Ka Match Kaun Jeeta: कल का मैच अफगानिस्तान और इंग्लैंड के बीच खेला गया था। दिल्ली के अरुण जेटली स्टेडियम में यह मुकाबला खेला गया था। अफगानिस्तान ने इसमें धाकड़ जीत दर्ज की।","content":"डिफेंडिंग वर्ल्ड चैम्पियन इंग्लैंड के बीच मुकाबला खेला गया था। दिल्ली के अरुण जेटली स्टेडियम में खेले गए इस मुकाबले में अफगानिस्तान ने एक बड़ा धमाका कर दिया। इसके बारे में किसी ने भी शायद सोचा नहीं होगा। इंग्लैंड की टीम को मैच में अफगानिस्तान ने हरा दिया। अफगानिस्तान ने इस मुकाबले में 69 रनों के बड़े अंतर से जीत दर्ज कर ली। इस वर्ल्ड कप में अब तक का यह सबसे बड़ा उलटफेर है। मैच शुरू होने से पहले तक इंग्लैंड को ही इस मैच में फेवरेट माना जा रहा था। टॉस जीतकर इंग्लैंड के कप्तान जोस बटलर ने पहले गेंदबाजी करने का निर्णय लिया और यह उनके लिए गलत साबित हुआ। अफगानिस्तान के ओपनर गुरबाज और जादरान ने मिलकर पहले विकेट के लिए शतकीय भागीदारी की। गुरबाज ने 80 रन बनाए। बाद में इकराम अलीखिल ने भी अर्धशतक जड़ा। अफगानिस्तान की टीम 284 रनों का अच्छा स्कोर बनाकर आउट हो गई। इंग्लैंड की टीम के लिए सबसे अच्छी गेंदबाजी आदिल राशिद ने की थी। आदिल राशिद के खाते में कुल 3 विकेट आए। जवाबी पारी में खेलते हुए इंग्लैंड के बल्लेबाज अफगान स्पिनरों के आगे टिक ही नहीं पाए। एक के बाद एक विकेट गिरते चले गए और इंग्लैंड की परेशानी भी बढ़ती चली गई। सिर्फ हैरी ब्रूक ही एकमात्र ऐसे खिलाड़ी थे, जिनके बल्ले से फिफ्टी आई और वह 66 रन के निजी स्कोर पर आउट हो गए। इसके बाद टीम भी 215 पर आउट हो गई। अफगानिस्तान के लिए मुजीब उर रहमान और राशिद खान ने 3-3 विकेट अपने नाम किये। : रहमानुल्लाह गुरबाज (विकेटकीपर), इब्राहिम जादरान, रहमत शाह, हशमतुल्लाह शाहिदी (कप्तान), अजमतुल्लाह ओरजई, मोहम्मद नबी, इकराम अलीखिल, राशिद खान, मुजीब उर रहमान, नवीन उल हक, फजलहक फारुखी। जॉनी बेयरस्टो, डेविड मलान, जो रूट, हैरी ब्रूक, जोस बटलर (कप्तान), लियाम लिविंगस्टोन, सैम करेन, क्रिस वोक्स, मार्क वुड, आदिल रशीद, रीस टॉप्ली।","pubDate":"2023-10-15 18:20:11","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"6bdc2b632bf006ac427ead912c2282a9","title":"Joe Root ने गेंद से दिखाया जादू, बल्लेबाज को खड़े-खड़े कर दिया बोल्ड, अफगानिस्तानी कप्तान के उड़े होश, Video","link":"https://sports.ndtv.com/hindi/cricket/odi-world-cup-2023-hashmatullah-shahidi-wicket-viral-joe-root-magic-ball-england-vs-afghanistan-13th-match-4483188#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Joe Root ने मैच के दौरान एक ऐसी गेंद फेंकी जिसे देखकर हर कोई हैरान रह गया है. बल्लेबाज आउट होने के बाद यकीन ही नहीं कर पा रहा था कि उसके साथ ऐसा हो सकता है.","content":"Joe Root का मैजिक ODI World Cup 2023: वर्ल्ड कप 2023 के 13वें मैच में अफगानिस्तान के खिलाफ इंग्लैंड के पूर्व कप्तान जो रूट ने अपनी गेंदबाजी से जलवा दिखाया है. दरअसल, जो रूट ऐसे गेंदबाज हैं जो इंग्लैंड के लिए पार्ट टाइम गेंदबाज की भूमिका निभाते है. ऐसे में अफगानिस्तान के खिलाफ मैच के दौरान रूट ने अपनी एक मैजिक गेंद पर अफगानी कप्तान हशमतुल्ला शाहिदी को बोल्ड कर दिया. शाहिदी को यकीन ही नहीं हुआ कि वो पार्ट टाइम गेंदबाज के खिलाफ इस तरह से बोल्ड हो सकते हैं. यही कारण था कि आउट होने के बाद अफगानिस्तानी कप्तान हशमतुल्ला शाहिदी कुछ समय के लिए सन्न रह गए थे. आईसीसी ने सोशल मीडिया पर यह वीडियो भी पोस्ट किया है. जिसमें जो रूट अपनी मैजिक गेंद पर बल्लेबाज को खडे-खड़े बोल्ड कर देते हैं. जो रूट ने वनडे वर्ल्ड कप मे अपना यह चौथा विकेट हासिल किया. वहीं, मैच की बात करें तो इंग्लैंड ने मैच में टॉस जीतकर पहले गेंदबाजी करने का फैसला किया था. अफागनिस्तान की शुरुआत शानदार रही थी, गुरबाज और जादरान ने पहले विकेट के लिए 16.4 ओवर में 114 रन जोड़ने में सफल हो गए थे. गुरबाज मैच में 88 रन बनाकर आउट हुए. गुरबाज दुर्भाग्यशाली रहे कि मैच में वो शतक से चूके और रन आउट हो गए. वहीं, अपनी पारी के दौरान गुरबाज ने 33 गेंद पर अर्धशतक जमाने में सफलता पाई थी. उनकी गेंदबाजी देखकर ऐसा लग रहा था कि वो आज तूफानी शतक लगाएंगे लेकिन दुर्भाग्य से साथी खिलाड़ी के साथ रन लेने की हड़बड़ी में रन आउट हो गए. रहमानुल्लाह गुरबाज़ ने 57 गेंद पर 80 रन की पारी खेली जिसमें 8 चौके और 4 छक्के शामिल रहे. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-15 18:16:47","image_url":"https://c.ndtvimg.com/2023-10/00obtsj_joe-root_625x300_15_October_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"a99724415a6740f64114455bdde83f12","title":"Afridi flayed for comment on Indian bowlers","link":"https://www.dailymirror.lk/breaking-news/Afridi-flayed-for-comment-on-Indian-bowlers/108-269241","keywords":null,"creator":null,"video_url":null,"description":"Former captain of the Pakistan cricket team, Shahid Afridiâ€™s comment ascribing Indiaâ€™s success in cricket to a meat diet has drawn a lot of flak. â€™â€™India has a huge 1.4 billion population, and the quality of cricket has changed over the years. Back then, we used to say that they were producing great batters while Pakistan was creating good bowlers.","content":"Former captain of the Pakistan cricket team, Shahid Afridi’s comment ascribing India’s success in cricket to a meat diet has drawn a lot of flak. \"India has a huge 1.4 billion population, and the quality of cricket has changed over the years. Back then, we used to say that they were producing great batters while Pakistan was creating good bowlers. However, their bowlers have now started eating meat, so they have gained strength,\" Afridi was quoted as saying in a Pakistani sports show, according to reports. This comment has not gone down well with the former India fast bowler, Karsan Ghaveri. The 72-year-old former fast bowler, Ghavri, was one of the first to speak out against the comment. \"It is a stupid statement by Afridi. Vegetarians can have equal strength. Individuals might choose to be vegetarian or nonvegetarian. Our former players like Javagal Srinath, the late Yashpal Sharma, Dilip Doshi, and many others are or were pure vergeterians, and they all were successful players\". \"It is a stupid statement by Afridi. Vegetarian eaters can have equal strength, too. There may be more calories in meat, etc., but vegetables and soup have good protein\". \"Many medals have been won by Indian athletes at the Asian Games, and many of them are vegetarians,\" says Ghavri, who took 109 wickets in 39 Tests and 15 in 19 ODIs. \"One should not listen to Afridi's advice\". It is commonly said that cricketers must consume meat to get the required protein for physically demanding games. But meat is not the primary source of protein for every cricketer. In fact, several members of the present Indian team, like Virat Kohli, Rohit Sharma, Ravichandran Ashwin, and Hardik Pandya, have adopted a vegetarian diet, proving that it is possible to be successful on the field without being a non-vegetarian. Kohli admitted to being a vegetarian on Twitter, adding, \"The biggest myth in the world is that non-meat eaters cannot be muscular.\" (Bipin Dani)","pubDate":"2023-10-15 18:09:53","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_e376274b97.jpg","source_id":"dailymirror","source_priority":43341,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8c902d7f6a79d7747bf056f1bbbec9cf","title":"New captain Mendis says Sri Lanka have edge over Australia","link":"https://www.dailymirror.lk/breaking-news/New-captain-Mendis-says-Sri-Lanka-have-edge-over-Australia/108-269249","keywords":null,"creator":null,"video_url":null,"description":"Kusal Mendis, who had captaincy added to his workload on Friday after injured skipper Dasun Shanaka was ruled out of the Cricket World Cup 2023, believes Sri Lanka has the momentum against Australia, who they face on Monday at the Ekana Stadium in Lucknow.","content":"Kusal Mendis, who had captaincy added to his workload on Friday after injured skipper Dasun Shanaka was ruled out of the Cricket World Cup 2023, believes Sri Lanka has the momentum against Australia, who they face on Monday at the Ekana Stadium in Lucknow. Sri Lanka and Australia are yearning for their first win in the tournament with both sides losing their first two games. “The momentum is with us,” said Mendis, making his firs New captain Mendis says Sri Lanka have edge over Australia Kusal Mendis, who had captaincy added to his workload on Friday after injured skipper Dasun Shanaka was ruled out of the Cricket World Cup 2023, believes Sri Lanka has the momentum against Australia, who they face on Monday at the Ekana Stadium in Lucknow. Sri Lanka and Australia are yearning for their first win in the tournament with both sides losing their first two games. “The momentum is with us,” said Mendis, making his first appearance as Sri Lanka’s ODI skipper. “Yes, we have lost two games. But when you look at those losses, I think, we have done much better than the Australians. They will have some doubts about our team”. While Australia’s problem has been their batting, it has been the bowling for the Sri Lankans. But this does not bother him much as he said “Every bowling unit will struggle on Indian pitches”. “We need to adapt quickly and I strongly believe that the bowlers will do their part to the best of their ability. Not only us, even the top-quality attacks have been taken apart and conceded over 300 or 350 plus on these pitches,” he said, adding that his duty is to get the best out of the players. Mendis who has been the mainstay of Sri Lanka’s batting in the tournament, having scored 76 and 122 to go with his 158 in the practice game against Afghanistan said he will bat with the same aggression as he has done in the previous two games. \"I don't like to change the way I bat,” he said. “Before coming for the World Cup, I didn't think I would play at a higher strike rate like this. But after playing the two warm-up games, I understood that I can play freely, because the pitches are good. There will be times when I will have to be a bit more cautious in my approach because the bowlers will come hard at me with their plans. Even though I am the captain, I will not change the way I bat because I know if I am amongst the runs, we will be able to win games”. (Champika Fernando in Lucknow)","pubDate":"2023-10-15 18:09:53","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_a5500087ae.jpg","source_id":"dailymirror","source_priority":43341,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"aff27519556aa50d55a134546f0c9765","title":"[Breaking] Cricket World Cup: Afghanistan shock England","link":"https://blueprint.ng/breaking-cricket-world-cup-afghanistan-shock-england/","keywords":["Sports","#WorldCup","Cricket"],"creator":["Editor"],"video_url":null,"description":"Afghanistan produced the first shock of the ICC Cricket World Cup 2023 when they beat defending champions England by 69 runs on Sunday at the Arun Jaitley Stadium in New Delhi. Holders England crumbled for 215 runs in front of Afghanistan’s trio of spinners after winning the toss and asking Afghanistan to bat first. The underdogs set England a target Read More The post [Breaking] Cricket World Cup: Afghanistan shock England appeared first on Blueprint Newspapers Limited.","content":"Afghanistan produced the first shock of the ICC Cricket World Cup 2023 when they beat defending champions England by 69 runs on Sunday at the Arun Jaitley Stadium in New Delhi. Holders England crumbled for 215 runs in front of Afghanistan’s trio of spinners after winning the toss and asking Afghanistan to bat first. The underdogs set England a target of 285 runs, thanks to a blistering knock of 80 runs off 57 balls from opener Rahmanullah Gurbaz and a half-century from wicketkeeper Ikram Alikhil. Spinners Rashid Khan (23) and Mujeeb Ur Rahman (28) contributed in a lower-order flourish that saw Afghanistan put up a competitive total and allow their bowlers to go all-out against the England batters. Boasting a powerful batting lineup, England were handed an early loss when left-arm pacer Fazalhaq Farooqi dismissed opener Jonny Bairstow in the second over. From then on, Afghanistan’s spinners took over as off spinner Mujeeb Ur Rahman bowled out Joe Root for 11 runs and Mohammad Nabi dismissed Dawid Malan for 32. England captain Jos Buttler was dimissed for nine runs by pace bowler Naveen-ul-Haq. Star leg spinner Rashid Khan added to England’s woes by dismissing Liam Livingstone and Adil Rashid. Harry Brook put up a resistance with his 66-run innings, but fell to Mujeeb Ur Rahman in the 35th over to send England reeling at 169-8. England lost the tournament’s opening match against New Zealand by nine wickets, but beat Bangladesh by 137 runs. Afghanistan suffered heavy losses in both their matches, as they lost to Bangladesh by six wickets and then to hosts India by eight wickets.","pubDate":"2023-10-15 18:00:41","image_url":null,"source_id":"blueprint","source_priority":917110,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"ef3b55d79adbaf42081b7d2af46496eb","title":"England suffer one of the World Cup's biggest ever shocks as they fall to 69-run defeat and hand Afghanistan their second-ever tournament win","link":"https://www.dailymail.co.uk/sport/cricket/article-12633071/England-suffer-one-World-Cups-biggest-shocks-fall-69-run-defeat-against-Afghanistan.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH IN DELHI: England's World Cup defence is in tatters after they were humiliated by Afghanistan at the Feroz Shah Kotla.","content":"England suffer one of the World Cup's biggest ever shocks as they fall to 69-run defeat and hand Afghanistan their second-ever tournament win Jos Buttler's side were chasing 285 to win but fell well short of the target Afghanistan won just their second-ever World Cup match in Delhi World Cup holders may need to win five of last six matches to reach last four By Lawrence Booth for the Daily Mail Published: 17:01, 15 October 2023 | Updated: 18:48, 15 October 2023 e-mail 224 shares 150 View comments England's World Cup defence is in tatters after they were humiliated by Afghanistan at the Feroz Shah Kotla. The tournament, it's true, needed a shock to spice things up. But few expected this game to provide it. A chastening 69-run defeat leaves Jos Buttler 's side probably needing to win five of their remaining six games to reach the last four - and South Africa , India, Australia and Pakistan lie in wait. On this evidence, England will struggle to beat any of them. This was a glorious night for Afghanistan, and a huge feather in the cap of their English coach Jonathan Trott. In 17 previous World Cup matches, their only victims had been Scotland. To humble the world champions is on another level. Such was England's ineptitude, however, that it was if the white-ball revolution set in motion eight years ago by Eoin Morgan never happened. Where was the cleverness with the ball? The ability to react to circumstance? The relentless aggression with the bat? Buttler has played down the significance of his side's descent to fifth in the rankings. But England's alright-on-the-night mentality has produced two defeats out of three. Their aura is going, if not gone. Jos Buttler (right) saw his England side suffer one of the biggest shocks in World Cup history Afghanistan won just their second-ever match at a World Cup on a memorable night in Delhi Afghanistan opener Rahmanullah Gurbaz scored a spectacular 80 off just 57 balls to set the tone The tone was set by the game's opening delivery, which the increasingly hapless Chris Woakes speared down leg, and Buttler allowed to sneak through for five wides. And it continued as Afghanistan opener Rahmanullah Gurbaz flayed a spectacular 80 off 57 balls before being run out by a horrible call from his captain, Hashmatullah Shahidi. The spinners threatened to tilt the match England's way, only for more sloppiness - including a missed stumping by Buttler - to allow Afghanistan to turn 190 for six into 284. Four days earlier, against the same opponents at the same venue, India had easily knocked off 273 in 35 overs. But the suspicion that England are not the team they were - or even what they think they are - grew during a lame batting display in which only Harry Brook emerged with credit. If and when Ben Stokes returns against South Africa in Mumbai on Saturday, it cannot be Brook who makes way. Afghanistan were superb in pulling off their first win over England in any format. But this was a night to conjure up memories of the bad old times, and a 50-over World Cup defeat to rank with Zimbabwe at Albury in 1992, Australia at Port Elizabeth in 2003, Ireland at Bangalore in 2011 and Bangladesh at Adelaide in 2015. The warning signs have been there. They dismissed the nine-wicket hammering by New Zealand as an aberration, before Bangladesh failed to punish them for a lame final 10 overs with the bat in Dharamshala. But the conservatism that once blighted English cricket seems to have returned. England had a chance here to blood either Gus Atkinson or David Willey, or both. Instead, Woakes - one of the heroes of the Ashes comeback - has made himself unselectable, along with Sam Curran. Woakes has now taken two for 135 at this World Cup, and Curran two for 122. Their combined figures here were 8-0-87-0. All the while, Atkinson has been firing rockets in the nets under the approving eye of bowling coach David Saker. Woakes' first three overs cost 31, and when Buttler brought him back for the 25th, his second ball was whacked over long-on by Azmatullah Omarzai. He was not seen again. Curran, meanwhile, disappeared for 26 in his first two, then 18 in another towards the end. Harry Brook was the only England batter to show any fluency, scoring 66 runs as their batting order collapsed England struggled to deal with Afghanistan's spinners, with Mujeeb Ur Rahman (above) taking three wickets along with Rashid Khan Reece Topley bowled a decent opening spell, though hearts were in mouths when he briefly left the field after hurting his right knee on the boundary. Mark Wood deserved better than two for 50. But the mid-innings success of the spinners, led by Adil Rashid and reinforced by Liam Livingstone, made it all the more curious that Buttler gave only four overs to Root's off-breaks: figures of one for 19 felt unfulfilled. While England's three spinners took five for 94 off 24 overs, their four seamers managed three for 189 off 25.5. Like batting first, it was a misreading of the conditions. Buttler then failed to stump Afghanistan wicketkeeper Ikram Alikhil off Livingstone only 23 runs into his eventual 58, and England's nous deserted them completely at the death. The chase got off to a horrible start as Rod Tucker upheld a marginal lbw to dispatch Jonny Bairstow for two, playing round an inswinger from left-armer Fazalhaq Farooqi. Bairstow stormed off in high dudgeon. Afghanistan are coached by former England batter Jonathan Trott But with the exception of Brook, there was a deflating lack of intent. Joe Root stayed back to off-spinner Mujeeb Ur Rahman and was bowled for 11, before Dawid Malan chipped Mohammad Nabi to short extra for 32. When Buttler was bowled through a gap the size of nearby India Gate by a magnificent inswinger from Naveen-ul-Haq, it was 91 for four. Livingstone was plumb leg-before to Rashid Khan, and wasted a review, before Curran was caught at slip off Nabi. Woakes completed a miserable evening when he was bowled by Mujeeb, and England's final hope evaporated when Brook edged Mujeeb for an otherwise mature 66. On a pitch that slowed as the match progressed, their spinners finished with eight wickets. Soon, Afghanistan were celebrating their most famous night, and a large Delhi crowd celebrated with them. Only 10 days into a tournament England had designs on winning, they have barely half a hand on their trophy. Share or comment on this article: England suffer one of the World Cup's biggest ever shocks as they fall to 69-run defeat and hand Afghanistan their second-ever tournament win e-mail 224 shares Add comment Comments 151 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-15 17:48:29","image_url":"https://i.dailymail.co.uk/1s/2023/10/15/16/76585083-0-image-m-49_1697384578664.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0608b416f44c1670d03252084c92aab7","title":"Aaj Ka Match Kaun Jeeta: आज का मैच कौन जीता- इंग्लैंड vs अफगानिस्तान","link":"https://hindi.oneindia.com/news/sports/cricket/aaj-ka-match-kaun-jeeta-world-cup-mein-afghanistan-vs-england-834045.html","keywords":null,"creator":null,"video_url":null,"description":"England vs Afghanistan: अफगानिस्तान की टीम ने तगड़ा धमाका करते हुए वर्ल्ड चैम्पियन इंग्लैंड को पराजित कर दिया। यह सबसे बड़ा उल्टफेर है।","content":"अफगानिस्तान ने बड़ा उलटफेर कर दिया। दिल्ली के अरुण जेटली स्टेडियम में अफगानिस्तान की टीम ने वर्ल्ड चैम्पियन इंग्लैंड को 69 रनों पराजित कर दिया। साल 2011 में भारत में खेले गए वर्ल्ड कप में इंग्लैंड की टीम को आयरलैंड के खिलाफ हार मिली थी। टॉस जीतकर इंग्लैंड ने पहले गेंदबाजी करने का निर्णय लिया और यह गलत साबित हुआ। अफगानिस्तान के ओपनरों ने जमकर रन बना डाले। अफगानिस्तान के ओपनर गुरबाज और इब्राहिम जादरान के बल्ले से रन आए और एक शतकीय भागीदारी देखने को मिली। जादरान 28 रन की पारी खेलकर आउट हो गए लेकिन गुरबाज के बल्ले से लगातार रन आए। वह अपनी फिफ्टी के बाद भी टिके रहे। इस बीच रहमत शाह 3 रन बनाकर आउट हो गए और शाहीदी 14 रन के निजी स्कोर पर चलते बने। गुरबाज के बल्ले से शतक की उम्मीद थी लेकिन वह 80 के निजी स्कोर पर रन आउट हो गए। गुरबाज के अलावा इकराम अलीखिल ने भी अर्धशतक जड़ा और 58 के निजी स्कोर पर आउट होकर चलते बने। राशिद खान ने 23 और मुजीब उर रहमान ने 28 रनों की पारी खेली और अफगानिस्तान की टीम 284 पर आउट हुई। इंग्लैंड के लिए आदिल राशिद ने 3 विकेट झटके। जवाबी पारी में खेलते हुए इंग्लैंड की टीम ने बेयरस्टो का विकेट जल्दी गंवा दिया। वह 2 रन पर आउट हुए। यहाँ से नियमित अन्तराल पर विकेट गिरे। अफगानिस्तान के स्पिनरों ने इंग्लैंड को नचाया। मलान 32 और रूट 11 रन बनाकर आउट हो गए। एक के बाद एक विकेट गिरे लेकिन हैरी ब्रूक अकेले क्रीज पर टिके। वह 66 रन बनाकर चलते बने और यही इंग्लैंड की हार तय हो गई। अंत में इंग्लैंड की टीम 215 पर आउट हो गई और अफगानिस्तान ने एक बड़ा उलटफेर कर दिया। अफगानिस्तान ने मैच 69 रनों से अपने नाम कर लिया। अफगानिस्तान की टीम के लिए मुजीब उर रहमान और राशिद खान ने मिलकर 3-3 विकेट अपने नाम किये।","pubDate":"2023-10-15 17:44:09","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"bf5823eb9a9976a995f19eecd58e9e4d","title":"Jos Buttler tells England to ‘let it hurt’ after World Cup loss to Afghanistan","link":"https://www.watfordobserver.co.uk/sport/national/23856917.jos-buttler-tells-england-let-hurt-world-cup-loss-afghanistan/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Buttler looked drained and drawn by events at the Arun Jaitley Stadium and accepted his side would need to feel some pain.","content":"The defending champions were thrashed by 69 runs in Delhi, dismissed for 215 with almost 10 overs to spare by a team who walked into the contest with a record of 16 defeats from the previous 17 World Cup matches. That their only previous success came against associates Scotland in 2015 makes the result, and the comfortable margin, even more remarkable. They are not down and out yet, with six group games still to play, but two losses from their first three games mean they must put together a near-perfect run to reach the semi-finals. Buttler looked drained and drawn by events at the Arun Jaitley Stadium and accepted his side would need to feel some pain before plotting their response. “It’s really disappointing. We came here today wanting to put in a really good performance and we got outplayed,” he said. “You’ve got to let these defeats hurt. Let it hurt; then try to figure out where we need to get better. “It never feels good; you never like losing games of cricket or not performing to the level you want to. “As a whole, we were not at the level we would like to be in a World Cup. On the field and off it, we will be trying to put it right. “It’s a big setback. Before the tournament started it’s not how you would have looked at the first three results. “We’ve got to show a lot of character, a lot of resilience within the team and most of all a lot of belief.” England have plenty of issues to ponder when they relocate to Mumbai for what now seems a must-win clash against in-form South Africa. Chris Woakes continued an underwhelming start to the tournament and was awarded just four of his allotted 10 overs after being flogged for 41. For a player who has so often set England up with new ball discipline, his struggles appear emblematic of a team struggling to reach their own high bar. Woakes sent down a wide from the first ball of the match, with Buttler nutmegging himself behind the stumps as the ball tricked away to the boundary rope. As a portent of what was to come, it felt apt. It was also telling that England ended up relying on 24 overs of spin having overlooked Moeen Ali – including a full 10 from Liam Livingstone for the first time in ODI cricket and four from the part-time Joe Root. “Maybe the conditions didn’t play quite as we thought they would. Obviously throughout our bowling innings, spin was the main threat,” he said. “Maybe there wasn’t quite as much dew as we thought there was and maybe the pitch didn’t quite play how we thought it would having watched a few games here so far in the tournament. “But first ball of the day I missed one and it sort of set the tone.” Former England batter Jonathan Trott, forging a new path now as the Afghanistan head coach, was beaming after landing the biggest scalps of his career. “It’s always nice. I think I’ll take any victory. I’m very proud of the performance, whether it’s against England or not,” he said. “I know that the players and the coaching staff deserve it. I’m very keen not to put a dampener on things. “I never soaked up enough or enjoyed moments like this. I’m certainly going to say to the guys, enjoy tonight and, spend the time together, whatever you want to do. “If this can bring a smile to people’s faces anywhere in the world, but also encourage boys and girls to pick up a cricket bat or a cricket ball and get playing cricket in Afghanistan, then that’s the sort of the goal that’s been achieved.”","pubDate":"2023-10-15 21:18:16","image_url":"https://www.watfordobserver.co.uk/resources/images/17335489/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"52577be0343e4dee62cc343b806fc4f2","title":"AFL Draft Power Rankings: Four Tassie prospects in top 20 as Eagles academy gun surges into first-round mix","link":"https://www.foxsports.com.au/afl/draft/afl-draft-2023-power-rankings-afl-draft-news-rankings-after-2023-combine-date-picks-order/news-story/1169252a1e73bbf3d37d5dea0c5f3467","keywords":null,"creator":null,"video_url":null,"description":"While the top 10 has remained stable across recent months, there’s been big moves in the draft rankings among players in the mid to late first-round mix.","content":"While the top 10 has remained stable across recent months, there’s been big moves in the draft rankings among players in the mid to late first-round mix. There’s now four Tassie stars in the top 20, while a talented Eagles academy prospect and the brother of a Hawthorn gun have shot up the order too. After last weekend’s national combine, foxfooty.com.au presents its top 30 2023 AFL Draft Power Rankings ahead of the 2023 AFL Draft, which will be held across two nights: Monday November 20 (first round) and Tuesday November 21 (second round onwards). Watch every match of The ICC Men’s Cricket World Cup Live on Kayo Sports. Join Kayo now and start streaming instantly > Grand Final AFL Sep 30 2:30pm AEST FT Collingwood 90 Brisbane 86 MATCH CENTRE *Odds are current as of 16th October 2023, 7:40am AEST VIEW ALL SCORES Logan Morris of the Western Jets. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 30. LOGAN MORRIS July Ranking: 26 Position: Medium forward/defender Size: 192cm Clubs: Western Jets/Werribee Districts A consistent goalkicker over the past two years with the potential to be a damaging third tall at AFL level. After booting 31 goals from 14 games as a bottom-ager for the Jets, Morris kicked 30 majors from 10 games this year, including seven hauls of at least three goals. He also showed showing off his versatility for Vic Metro, playing the first two carnival games in defence before being swung forward for the final two games. Morris against WA kicked 4.1 from 16 disposals, while he also plucked 11 marks (five contested) as he showed off his elite hands and improved his aerobic capacity. Also kicked two goals in a one-off VFL game for Werribee. Mitchell Edwards of Western Australia. Picture: Sarah Reed/AFL Photos via Getty Images Source: Getty Images 29. MITCH EDWARDS July Ranking: 13 Position: Ruck Size: 205cm Clubs: Peel Thunder/South Mandurah A slide down the rankings for Edwards, who didn’t have a lot of luck at times during this year. One of the best pure rucks in the draft, Edwards has been likened to Tim English in terms of looks and playing style due to his ruck craft and aerial competitiveness. After impressive outings for the AFL Academy, Edwards copped a corky against South Australia then suffered a concussion against Vic Country, which meant he missed the last game against Vic Metro. He finished the season in Peel Thunder’s reserves side, playing six games. Edwards is linked to Fremantle via its Next Generation Academy, but the Dockers can only match a bid on him if it comes outside the top 40 — and even though there’s been a cooling regarding top-10 calculations, it’s unlikely Edwards is getting picked that late. Tew Jiath of the Gippsland Power. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 28. TEW JIATH July Ranking: Not ranked in top 30 Position: Medium defender Size: 187cm Clubs: Gippsland Power/Morwell Didn’t play for Vic Country and didn’t get a national combine invite, but Jiath is an outside chance to be taken in the first round. Jiath – the younger brother of Hawks defender Changkuoth Jiath – has surged up draft boards during the back-end of Gippsland Power’s Coates Talent League campaign, providing eye-catching dash, dare and intercept ability off half-back. His 29-disposal wildcard round display against the Stingrays was particularly noteworthy. Jiath is part of Hawthorn’s Next Generation Academy, meaning the Hawks have rights to match a bid on him if it comes after Pick 40. But Hawthorn appears increasingly likely to miss out on its top NGA prospect, who’s now expected to be drafted within the first 40 selections. George Stevens of the Rebels. Picture: Daniel Pockett/AFL Photos/via Getty Images Source: Getty Images 27. GEORGE STEVENS July Ranking: 24 Position: Midfielder/medium defender Size: 189cm Clubs: GWV Rebels/South Warrnambool Couldn’t have done much more on the field this year to boost his prospects. Only slips a little in these rankings as a few bolters have passed him. Still, Stevens was a standout for Vic Country across the carnival and starred for the Rebels in the Coates Talent League, averaging a whopping 29 disposals, five tackles and five inside 50. He finished third in the Morrish medal voting and was named captain of the league’s team of the year. A powerfully-built 189cm prospect, Stevens spent some time in defence this year, but clubs preferred seeing him as an on-baller where he showed off his cleanliness, decision-making skills and natural ball-winning ability. He plays with great presence when he goes on the ball and is hard to push over in the contest. Charlie Edwards of the Sandringham Dragons. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 26. CHARLIE EDWARDS July Ranking: Not ranked in top 30 Position: Midfielder/medium defender Size: 190cm Clubs: Sandringham Dragons/Sandhurst A genuine late-season bolter, Edwards’ shift from defence to the midfield has paid big dividends. He missed out on playing for Vic Metro at the national champs, but exploded in his final seven Coates Talent League games for the Dragons, booting seven goals and averaging 21 disposals and five inside 50s per outing. Edwards’ ability to burst away from congested stoppages has impressed recruiters, while his 190cm frame also appeals. Archie Roberts of the Sandringham Dragons. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 25. ARCHIE ROBERTS July Ranking: 27 Position: Medium defender Size: 182cm Clubs: Sandringham Dragons/Hampton Rovers Some clubs would have him much higher on their rankings, others would have him lower. After starring for the AFL Academy against Carlton in May, Roberts found plenty of the ball during the national carnival for Vic Metro, averaging 21 disposals and six rebound 50s while going at 75 per cent by foot. He then played three crucial finals to help the Dragons to the Talent League premiership, collecting 19, 25 and 16 disposals respectively. AFL recruiters have remained split over Roberts right throughout the season. His rebounding, ability to gain territory and aerobic capacity (6:08 2km time trial) is unquestionable, but scouts also have doubts over his kicking efficiency, decision-making and defensive accountability. Wouldn’t be a surprise to see him taken on the first night of the draft. William Green of the Northern Knights. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 24. WILL GREEN July Ranking: 25 Position: Ruck Size: 204cm Clubs: Northern Knights/Northcote Might now be the second-best ruck prospect in the draft. Green elevated his standing after an excellent carnival for Vic Metro where he showed off his running power, mobility, ruck craft and competitiveness. Green’s best game came against Ethan Read and the Allies, working himself into the game and finishing with 11 disposals, four clearances and a game-high 30 hit-outs. The Knights co-captain was then named as the starting ruck in the Coates Talent League team of the year after averaging 11 disposals, three marks an 23 hit-outs from 13 games. Koen Sanchez of Western Australia. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 23. KOEN SANCHEZ July Ranking: 19 Position: Small forward/midfielder Size: 176cm Clubs: East Fremantle/Applecross Mt Pleasant This will be too high for some, but we’re big fans of Sanchez — a pocket rocket who booted 6.8 and averaged 18 disposals and nine contested possessions for WA at the carnival. Sanchez played in the midfield for two champs games and as a forward for the other two. Clubs were particularly thrilled by Sanchez’s output when he played closer to goal in the champs as he showed off his powerful kick, goal sense, speed and agility. He was a ball magnet at WAFL colts level, averaging 25 disposals from six games. The reality is if he joins an AFL club, he’ll start as a small forward — and could play early. After being hampered by hip and groin issues for several years, Sanchez delivered at the right time of the year. Looms as a likely second-round pick. Archer Reid of the AFL Academy in action in May. Picture: Michael Willson/AFL Photos via Getty Images Source: Getty Images 22. ARCHER REID July Ranking: 17 Position: Ruck/key forward Size: 203cm Clubs: Gippsland Power/Inverloch-Kongwak An uber talented yet polarising key-position prospect with an enormous ceiling, Reid endured an inconsistent draft campaign. He entered this season as a possible top-10 pick, probably dipped across the first few months, found form and confidence for Gippsland after the champs then went goalless in his final four games. Reid, the brother of Essendon’s Zach Reid, is a mobile forward-ruck who’s exceptional overhead yet great below his knees and possesses good goal sense. His Round 11 Talent League game — 4.0 from 17 disposals, eight marks and 17 hit-outs against the Dragons — was Reid at his best. Will require patience from fans at AFL level, but if it clicks, he could be a tantalising player. Whether a club is prepared to use a first-round pick on him remains uncertain. Riley Hardeman of Swan Districts. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 21. RILEY HARDEMAN July Ranking: 20 Position: Medium defender Size: 185cm Clubs: Swan Districts/Caversham A hard-running defender and WA’s carnival captain, Hardeman had several standout games throughout his draft year. He racked up 23 disposals, nine marks and eight rebound 50s for WA against SA in the carnival, while he had 26-plus disposals in four of his seven colts games. Scouts have been pleased to see Hardeman’s growth in confidence to come forward and intercept mark this year to complement his strong rebounding traits, which include speed and a booming left-foot kick. Arie Schoenmaker of the Tassie Devils. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 20. ARIE SCHOENMAKER July Ranking: Not ranked in top 30 Position: Wing/key defender Size: 194cm Clubs: Tasmania Devils/Launceston A first-round bolter who’s impressed AFL clubs with his rapid on-field growth and off-field dedication to improve. Schoenmaker was hit with a 10-game ban at the start of the year for a training camp indiscretion involving alcohol with a group of his teammates. He didn’t play for the Tassie Devils until Round 8 of the Coates League and was only a late call-up into the Allies squad. But he couldn’t have been more impressive upon return, averaging 27 disposals and 10 rebound 50s for the Devils, while also averaging 16 disposals and eight marks for the Allies. Schoenmaker is the definition of a line-breaker, with the ability to change the course of matches by using his run and carry then thumping the ball forward with his long, raking left boot. He has the size to be a third tall defender, but admits he needs to regain his ability and confidence to intercept before moving into that role at AFL level. Clubs were keen to interview him at last week’s combine – and they were impressed with his willingness to own and learn from his early-year mistake. Now likely to be taken on the first night of the draft. Koltyn Tholstrup of Subiaco. Picture: Michael Klein Source: News Corp Australia 19. KOLTYN THOLSTRUP July Ranking: 18 Position: Medium forward Size: 184cm Clubs: Subiaco/Newtown Condingup A high impact and score involvements player, Tholstrup has been in the first-round mix all season. After missing WA’s first national champs game with a back issue, Tholstrup had several key moments during an impressive outing against SA, including a standout smother, a good contested mark and a classy late-game goal as he finished with 1.1 from 20 disposals, eight marks and four inside 50s. just as importantly, Tholstrup had consistent WAFL league exposure at Subiaco, kicking seven goals from 10 matches against bigger bodies. He also tested well at the combine, finishing equal-ninth in the 2km time trial (6:17) then second in the agility test (8.194). Tholstrup is a natural leader who brings ample energy to the footy field and prides himself on “leaving it all out on the field”. He’s drawn comparisons to North Melbourne star Cam Zurhaar – but he arguably has more polish and composure. Would be a shock if he isn’t taken in the first round. Lance Collard of Subiaco. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 18. LANCE COLLARD July Ranking: 30 Position: Small forward Size: 179cm Clubs: Subiaco/North Beach A few months ago, Collard would’ve been outside the top 40 of some club draft boards. Now he looms as genuine first-round chance – some scouts believe he’s WA’s most talented prospect – after an outstanding finish to his draft year. Collard had just one standout performance in a quiet national carnival for WA – 2.2 against Vic Country – although clubs were sympathetic to the fact he had asked to spend more time with his family during that period. But the Subiaco goalkicker – who’s blessed with an enormous leap, electric speed and great goal nous -produced a stunning back-end to his draft year at WAFL colts level, booting 10.1 in two finals to finish with 32.13 from 11 games for the season. Collard then impressed at the combine with a solid 2km time trial result of 6:32 before recording the fastest agility test of any prospect (8.157 seconds) and finishing fourth in the 20m sprint (2.923 seconds), while clubs were just as impressed by how he carried himself during the interview process. Collard, who grew up a Fremantle supporter, is tied to the Eagles via their Next Generation Academy. Yet West Coast can only match a bid on him if it lands outside the top 40 picks – and any hopes the Eagles had Collard wouldn’t be picked up in the top 40 are now surely dashed. Will McCabe of South Australia. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 17. WILL McCABE July Ranking: 16 Position: Key defender Size: 197cm Clubs: Central District/Tanunda Recruiters widely believe McCabe remains SA’s best first-round chance – yet he has ties to a Victorian club. While McCabe has endured an injury-interrupted 2023 campaign, his glimpses have put him in the first-round mix. He played most of his junior footy as a forward, but starred as a defender this year, averaging 22 disposals and six marks for Central District in the SANFL Under 18s. A mobile and athletic prospect who has great endurance, McCabe can play on either tall or small forwards due to his competitiveness in the air and at ground level. He’s also a precise user by foot, going at 86 per cent kicking efficiency during the national champs. McCabe is father-son eligible to the Hawks as his dad, Luke McCabe, played 138 games for Hawthorn between 1995 to 2004. He was due to meet with Hawthorn last week to chat through his nomination process, but the expectation is he’ll join the club under the father-son rule after the Hawks match a mid to late first-round bid. Caleb Windsor of the Eastern Ranges. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 16. CALEB WINDSOR July Ranking: Not ranked in top 30 Position: Wing Size: 184cm Clubs: Eastern Ranges/Lysterfield The best winger in the draft class a year where there aren’t too many wingers at the top. Windsor’s fan club has grown across the back-half of the season. After averaging 16 disposals and five inside 50s for Vic Metro at the national carnival, Windsor starred for the Ranges, averaging 19 disposals from his final eight Coates Talent League games. Bug what scouts were most impressed with was Windsor’s ability to push forward and consistently hit the scoreboard, kicking at least one goal in all of those eight matches. His electric speed as on display at the national combine, placing third in the 20m sprint (2.916) while also finishing inside the to 10 of both vertical jump tests. One recruiter told foxfooty.com.au last week Windsor looms as an “early teens pick”. James Leake of the Tassie Devils. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 15. JAMES LEAKE July Ranking: Not ranked in top 30 Position: Medium defender/forward Size: 188cm Clubs: Tasmania Devils/Launceston Hello and welcome to the first round mix, James Leake. And it’s richly deserved after a breathtaking back-end to his 2023 campaign. Leake earned a call-up to the Allies squad after a solid start to his Coates Talent League season across half-back – and he delivered on the national stage, playing all four games and averaging 16 disposals and five marks while going at 79 per cent efficiency by foot. But recruiters really took note where Leake was shifted forward late in the season for the Devils – a move that saw Leake kick 15 goals from his last five games, including a haul of five against the Stingrays and a match-turning three against the Falcons. Leake has an excellent leap and strong pair of hands, which helps him at both ends of the field. He’s composed with ball in hand and an excellent interceptor in defence, but lethal around goal inside 50. Should be a top-20 pick. Ollie Murphy of the Sandringham Dragons. Picture: Graham Denholm/AFL Photos via Getty Images Source: Getty Images 14. OLLIE MURPHY July Ranking: 12 Position: Key defender Size: 200cm Clubs: Sandringham Dragons/East Brighton Vampires Prior to this year, Murphy was “hopeful” he’d be an AFL player come draft night. Several months later, he looms as a near-certain first-round pick after a captivating rise. Murphy claimed Vic Metro’s MVP award across the champs. One of his more impressive games was against the Allies where he did a great job on Jed Walter – after being moved onto him after quarter-time – while also finishing with 10 touches and five marks. After school footy commitments, Murphy settled back in defence for the finish of Sandringham’s premiership campaign, with his preliminary final performance against the Falcons (18 disposals, 8 marks) a standout. Murphy has great size and athletic ability — he ran a PB 2km time trial at the combine (6:18) — as well as a pinpoint left-foot kick, while he’s an aerial threat and not afraid to put his body on the line. Might’ve slid down a few boards in recent months but is still expected to be taken on the first night. Jordan Croft of Maribyrnong College. Picture: Daniel Pockett/AFL Photos/via Getty Images Source: Getty Images 13. JORDAN CROFT July Ranking: 15 Position: Key forward Size: 200cm Clubs: Calder Cannons/Maribyrnong Park One for Dogs fans to get excited about. Despite a quiet end to his Coates Talent League campaign, Croft still booted 23.17 from 11 games, with 21 of those goals coming across a scintillating seven-game stretch during the middle of the season. While he didn’t quite have the same impact in the national carnival, he was still a standout in Vic Metro’s win over South Australia, booting 3.2 from 10 disposals and three marks. An athletic 200cm prospect who covers the ground superbly – he ran the fourth-best 2km time at the combine (6:05) – Croft prides himself on his competitiveness, both in the air at ground level. He’s looked up to Bulldogs forward Aaron Naughton in that area – and he’s now almost certain to be training with Naughton at Whitten Oval later this year after Croft – the son of Matthew Croft, who played 186 games for the Western Bulldogs – officially nominated the Bulldogs under the father-son rule. He’s highly likely to attract a bit in the mid to later stages of the first round. Darcy Wilson of the Murray Bushrangers. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 12. DARCY WILSON July Ranking: 14 Position: Medium forward/midfielder Size: 185cm Clubs: Murray Bushrangers/Wangaratta Rovers The quiet achiever of this year’s class. Not a big talker off the field, but Wilson is a classy, hard-working prospect who lets his footy do the talking. He starred at every level he played at this season. Wilson kicked 4.3 and averaged 16 disposals and four inside 50s for Vic Country in the recent carnival after two solid games for the AFL Academy against Port Adelaide’s SANFL side (19 disposals) and Carlton’s VFL team (1.0, 12 disposals, 6 marks). Wilson also kicked 16 goals and averaged 25 disposals and four inside 50s for the Bushrangers from 11 Coates Talent League games. His three-goal, 21-disposal performance in the wildcard game against the Rebels was eye-catching. Classy yet exciting, zippy yet can run all day – he finished second in the 2km time trial (5:52) at the combine – daring with the ball yet still efficient — it’s no wonder Wilson is in the first-round mix. Jake Rogers of the AFL Academy with his best on ground medal in May. Picture: Michael Willson/AFL Photos via Getty Images Source: Getty Images 11. JAKE ROGERS July Ranking: 9 Position: Midfielder Size: 172cm Clubs: Gold Coast Suns Academy/Broadbeach A speedy, agile and tenacious prospect with great decision-making ability, Rogers is one of the cleanest players in the draft class who’s thrived at all levels this season. He averaged 26 disposals for the Suns academy in the Coates Talent League before winning the medal for the AFL Academy’s best player across its two matches against state league opposition. Rogers then earned All-Australian honours for his terrific national carnival for the Allies where he averaged 23 disposals, six clearances and five tackles. And he played three games for the Suns’ VFL side. Not only is Rogers clean, his creativity and vision allows him to set up scores for his team. He’s drawn comparisons with Suns co-captain Touk Miller – and, coincidentally, Rogers has worked closely with Miller across the past year in transforming himself from a small forward to a genuine on-baller. In fact Rogers, through the Suns academy system, believes he’s been treated as a first-year AFL player and, therefore, ready to go for next season. Taller Suns prospects Jed Walter and Ethan Read will likely attract top-10 bids before him, but Rogers won’t be too far behind the pair. Nate Caddy of Parade College. Picture: Daniel Pockett/AFL Photos/via Getty Images Source: Getty Images 10. NATE CADDY July Ranking: 11 Position: Medium forward/midfielder Size: 192cm Clubs: Northern Knights/Yarrambat Could be a bit higher than No. 10 on club draft boards, such is the growth left in him — both in his game and in his body. Caddy – the nephew of dual premiership Tiger Josh Caddy – is a unique goalkicker in that he has strong high-marking ability and plays with key-forward like power, dynamism and presence, but isn’t as tall as some of other key forwards in this year’s draft class. To make up for that, he’s shown ominous explosiveness when pinch-hitting at centre bounces. There were three Coates Talent League games this year where he kicked at least four goals from 20-plus disposals. He competed hard without much scoreboard reward for effort for Vic Metro, kicking six goals from three national carnival games. Likely to first come under consideration when it’s the Giants’ turn to pick – and the sense is he won’t slide too far past that pick. Connor O'Sullivan. Picture: Dylan Burns/AFL Photos Source: News Corp Australia 9. CONNOR O’SULLIVAN July Ranking: 10 Position: Key defender Size: 198cm Clubs: Murray Bushrangers/Albury There’s a long queue of clubs interested in O’Sullivan, whose remarkable rise across 2023 has put him in the top-10 mix. He was named the Allies’ MVP – a big honour considering his team’s famous undefeated carnival campaign – after averaging 18 disposals and a competition-high eight marks. O’Sullivan started the Coates Talent League season as a forward but quickly settled down back, averaging 20 disposals and seven marks across nine games. A competitive and hard-working beast with a terrific set of hands – both in the air and at ground level – O’Sullivan is a genuine tall utility who can play inside either arc or even in the midfield – although he’s thrived this year playing predominantly as a key defender. He knows when to stay on his man and when to peel off and intercept – and he’s equally adept at both arts. Likely to come into the mix from Geelong’s first pick. Ryley Sanders of the Sandringham Dragons. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 8. RYLEY SANDERS July Ranking: 8 Position: Midfielder Size: 186cm Clubs: Sandringham Dragons/North Launceston Few players in this year’s pool showed metronomic consistency across all levels like Sanders did in 2023. The Tasmanian product, who’s boarding at Melbourne Grammar and playing for the Sandringham Dragons, barely plays a bad game, thanks to his competitiveness, inside-outside balance and clean hands. He took out the prestigious Larke Medal for the best player of the championships, averaging a whopping 36 disposals, 15 disposals, six inside 50s, six marks and five tackles for the Allies. A brilliant goal against WA — where he sharked a hit-out off WA’s Mitch Edwards, sprinted forward, took a bounce and nailed a kick from just inside the centre square — showcased his burst, power, class and composure in the one passage of play. He also averaged 31 disposals for the Dragons, racking up at least 25 touches in all of his nine games. North Melbourne pushed to have exclusive access to Sanders as part of its special assistance package, but that request was denied. He’s still a Kangaroos North Generation Academy prospect, but there’s little chance he’s still on the board come Pick 10, let alone Pick 40, on draft night. Despite the Kangaroos’ attachment to Sanders, it’s unlikely they’ll use a top-three pick on him. The Western Bulldogs and Melbourne a few picks later, though, is when he’s expected to be in the mix. Nick Watson of Vic Metro. Picture: Chris Hyde/AFL Photos/via Getty Images Source: Getty Images 7. NICK WATSON July Ranking: 7 Position: Small forward Size: 170cm Clubs: Eastern Ranges/East Ringwood Aka ‘The Wizard’ — and for good reason, for he’s as fun and dynamic a prospect as we’ve seen for a while. And he’ll bring AFL fans through the turnstiles for many years. Watson finished as the leading goalkicker of the national carnival, booting 14.6 for Vic Metro. He also showed he could play further up the field during several games for the Eastern Ranges, including some impressive performances behind the ball. Watson describes himself as an “Energizer Bunny”, in that he likes to apply defensive pressure and get under the skin of his opponents. Unsurprisingly, he’s a big Tom Papley fan. With the ball, he has unbelievable goal sense, speed, finishing ability and cleanliness at ground level. The Western Bulldogs recently acquired Pick 4 in the trade period, with Watson undoubtedly in their mix. But whether he gets past Hawthorn remains unclear. Ethan Read of the Gold Coast Suns Academy. Picture: Dylan Burns/AFL Photos via Getty Images Source: Getty Images 6. ETHAN READ July Ranking: 6 Position: Ruck/midfielder Size: 200cm Clubs: Gold Coast Suns Academy/Palm Beach Currumbin Suns academy teammate Jed Walter said it best: “Ethan is a freak.” For there aren’t too many 200cm prospects who can run a 5:56 2km time trial while also having the pinpoint skills and reflexes of a classy midfielder and the ability to play across all three lines. But that’s what Damien Hardwick and the Suns will be getting in Read next year. Read’s bonkers workrate and professionalism set him up for a big draft year. He starred for the Allies during the champs, averaging 22 disposals, three clearances, three tackles and 13 hit-outs to be named the All-Australian ruck. Before the carnival, Read averaged 20 disposals, 20 hit-outs and six marks for the Suns academy in the Coates Talent League before one VFL game for the Suns, in which he booted 0.4 from 12 touches. Allies coach Mark McVeigh reckons Read could play a Mark Blicavs-style role at AFL level and fill chasms wherever needed. A bit too early to know where a bid on Read could come, but surely the Suns will be forced to match by the time the Cats pick. Daniel Curtin of Western Australia. Picture: Paul Kane/AFL Photos/via Getty Images Source: Getty Images 5. DANIEL CURTIN July Ranking: 4 Position: Key defender/midfielder Size: 195cm Clubs: Claremont/West Coast If Harley Reid is the draft prospect who’s attracted the most media attention this year, Curtin isn’t far behind him. That’s because of West Coast’s interest in the local WA product. The professional Curtin showed great versatility across his four carnival games to win WA’s MVP award, averaging 24 disposals, nine contested possessions and five tackles while going at 82 per cent by foot. Most clubs see him developing into a composed intercept defender at AFL level. They were thrilled they got to see him take on Jed Walter when WA faced the Allies, while he played behind the ball in his six WAFL league games for Claremont. But Curtin showed in two carnival games against SA and Vic Metro that he can be a damaging tall midfielder as he covered the ground with a Marcus Bontempelli-like presence. Where Curtin lands on draft night, though, remains a mystery. If West Coast trades Pick 1, it’s highly like the club gets a pick back that allows it to take Curtin early. If the Eagles hold Pick 1 and take Reid, there’s every chance Curtin slides down the order as several clubs with early picks are after ball-winners or hybrid forwards. Zane Duursma of the Gippsland Power. Picture: Kelly Defina/AFL Photos/via Getty Images Source: Getty Images 4. ZANE DUURSMA July Ranking: 5 Position: Medium forward Size: 189cm Clubs: Gippsland Power/Foster Moves into the top four after an awesome finish to his Coates Talent League season. Duursma’s late surge was kickstarted by a dynamic, game-changing performance for Vic Country, kicking four goals – three in the third quarter to swing the game in his team’s favour – from 22 disposals, 10 marks and five inside 50s. He then turned it on for Gippsland Power, booting 20 goals and averaging 26 disposals from his final six games. After an indifferent start to the season, Duursma produced a timely reminder as to why he deserves to be taken at the pointy end of the draft. He’s competitive and strong in the air, explosive out of stoppages, crafty around goal and composed with ball in hand. Should the draft order remain as is, it’s hard to see North Melbourne passing on Duursma. If the Roos do, he won’t get past Hawthorn. Colby McKercher of the Allies. Picture: Sarah Reed/AFL Photos via Getty Images Source: Getty Images 3. COLBY McKERCHER July Ranking: 3 Position: Midfielder Size: 182cm Clubs: Tasmania Devils/Launceston The best pure midfield prospect in a draft where most of the top prospects are outside the centre square – so you can understand why McKercher is in hot demand. McKercher, who’s been likened to Essendon captain Zach Merrett, finished second in the Larke Medal voting after averaging 33 disposals, six marks, six clearances and five inside 50s across four national championships games for the Allies. He also claimed the Morrish Medal – the award given to the best and fairest player of the Coates Talent League – after kicking 11 goals and averaging 31 disposals from just eight games. McKercher is a speedy, clean and damaging on-baller with a lovely inside-outside balance. He loves to take the game on to break open games and create scores – and he isn’t afraid to take the risky option during a match, for he has the kicking skills to often pull it off. Could be taken by North Melbourne with one of its top-three picks, otherwise one of Hawthorn or the Western Bulldogs should pounce soon after. Jed Walter of the Allies. Picture: Sarah Reed/AFL Photos via Getty Images Source: Getty Images 2. JED WALTER July Ranking: 2 Position: Key forward Size: 195cm Clubs: Gold Coast Suns Academy/Palm Beach Currumbin A few AFL clubs – and some of his draft class peers – would have Walter ahead of Harley Reid on their draft boards, for there hasn’t been a key forward prospect like him come through the system. After beating up on a few lower-ranked Coates Talent League teams earlier in the year, Walter showed his wares on the national stage for the Allies, booting 11.10 to earn All-Australian selection for the second straight season. A genuine power forward who loves the physicality of the game, Walter prides himself on his competitiveness in the air, ridiculous want to apply forward pressure and speed when running back to goal. One recruiter told foxfooty.com.au seeing Walter chase an opponent was like “watching a lion chase a zebra” and that there’d never been a key forward prospect so willing to apply relentless defensive pressure. North Melbourne should bid on Walter with one of their first two picks – and the Suns are well placed to match it. The prospect of him and Ben King teaming up in the same forward 50 – under the leadership of new coach Damien Hardwick – is tantalising. Harley Reid in action for the AFL Academy side. Picture: Michael Klein Source: News Corp Australia 1. HARLEY REID July Ranking: 1 Position: Midfielder/forward Size: 185cm Clubs: Bendigo Pioneers/Tongala Came into the season as the No. 1 draft prospect – one recruiter told foxfooty.com.au at the start of this year Reid was the best talent they‘d ever seen come through the pathway system – and will finish it in the same spot. An explosive, mid-sized prospect who’s drawn comparisons to Dustin Martin and plays with an infectious attitude, Reid can play across any line — and win games from any line. He has power at stoppages, great overhead marking ability, a penetrating kick and a knack for hitting the scoreboard consistently. Reid showed off his versatility and power across four national carnival matches, booting 5.6 and averaging 20 disposals, 13 contested possessions and a competition-high seven clearances to win Vic Country’s MVP award. Reid this year also played for the AFL Academy, Bendigo Pioneers, Carlton’s VFL side, Essendon’s VFL side and Tongala – and he admits he struggled to adapt to the different teams . But you wouldn’t have known that from the outside. It’s hard to think of a draft prospect who’s attracted as much attention and headlines as Reid had this year – he was even ‘papped’ at Perth airport then seen signing Eagles gear after a carnival game against WA – but he’s taken it in his stride. Reid should be taken at Pick 1. It’s just a case of which club will hold that pick, with North Melbourne, Hawthorn and Melbourne all set to make more offers to West Coast over the next month.","pubDate":"2023-10-15 20:36:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"29d8f4df0b4080fbe11ad2370d400ea7","title":"\"हमने गेंदबाजी चुनी लेकिन...\" कप्तान बटलर ने बताया अफगानिस्तान के हाथों मिली हार की बड़ी वजह","link":"https://sports.ndtv.com/hindi/cricket/jos-buttler-big-discloser-on-the-reason-of-losing-the-match-vs-afghanistan-in-world-cup-2023-points-table-4484071#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Jos Buttler on Lose over Afghanistan: अफगानिस्तान के हाथों विश्व कप मैच में उलटफेर का शिकार हुए मौजूदा चैम्पियन इंग्लैंड के कप्तान जोस बटलर ने कही दी बड़ी बात.","content":"Jos Buttler on Lose over Afghanistan in WC 2023 सलामी बल्लेबाज रहमानुल्लाह गुरबाज के 57 गेंद में 80 रन के बाद मुजीबुर रहमान की अगुवाई में अपने गेंदबाजों के शानदार प्रदर्शन के दम पर अफगानिस्तान ने इस विश्व कप का सबसे बड़ा उलटफेर करते हुए रविवार को गत चैम्पियन इंग्लैंड को 69 रन से हरा दिया. लंबे समय तक युद्ध की विभीषिका झेलने और राहत शिविरों के अलावा अपने ‘दूसरे घर' भारत में क्रिकेट का ककहरा सीखने वाले अफगान खिलाड़ियों ने अपने क्रिकेट इतिहास का सबसे सुनहरा पन्ना लिख डाला और उसके साक्षी रहे अरूण जेटली स्टेडियम पर उनकी हौसलाअफजाई करने पहुंचे 25000 से अधिक दर्शक. पहले दोनों मैच हारकर यहां आई अफगानिस्तान टीम ने बल्लेबाजी और गेंदबाजी दोनों में इंग्लैड को उन्नीस साबित कर दिया. अफगानिस्तान ने पहले बल्लेबाजी के लिये भेजे जाने पर 49.5 ओवर में 284 रन बनाये. जवाब में इंग्लैंड की टीम 40.3 ओवर में 215 रन पर आउट हो गई. राशिद खान ने जैसे ही मार्क वुड को बोल्ड किया , खुशी से उछलते अफगान क्रिकेटरों के चेहरों पर साफ था कि यह जीत उनके और उनके देश के लिये कितने मायने रखती है. इंग्लैंड के लिये हैरी ब्रूक (61 गेंद में 66 रन ) को छोड़कर कोई बल्लेबाज नहीं टिक सका. वहीं अफगानिस्तान के लिये पहले 16 गेंद में 28 रन बनाने वाले मुजीबुर ने गेंदबाजी में भी जलवा दिखाते हुए तीन विकेट चटकाये. अनुभवी स्पिनर मोहम्मद नबी ने छह ओवर में 16 रन देकर दो विकेट लिये. अफगानिस्तान के हाथों विश्व कप मैच में उलटफेर का शिकार हुए मौजूदा चैम्पियन इंग्लैंड के कप्तान जोस बटलर ने स्वीकार किया कि उनकी टीम उस स्तर पर नहीं खेल पा रही, जैसे खेलना चाहिये. अफगानिस्तान ने इस विश्व कप में सबसे बड़ा उलटफेर करते हुए रविवार को इंग्लैंड को 64 रन से हराया. हार के बाद बटलर ने कहा ,‘‘ यह निराशाजनक है. टॉस जीतने के बाद हमने गेंदबाजी चुनी लेकिन अपेक्षा के अनुरूप प्रदर्शन नहीं कर सके. अफगानिस्तान ने हर विभाग में हमें उन्नीस साबित किया.'' उन्होंने कहा ,‘‘हम उस स्तर पर नहीं खेल पा रहे हैं, जैसे हमें खेलना चाहिये. बल्ले और गेंद दोनों से निराशाजनक रहा. अफगानिस्तान के पास शानदार गेंदबाजी आक्रमण है और मैदान पर वैसी ओस भी नहीं थी जिसकी हमें उम्मीद थी.'' उन्होंने कहा ,‘‘ गेंद को असमान उछाल मिल रहा था. उन्होंने स्टम्प पर गेंद डाली और हम अच्छा खेल नहीं पाये. ऐसी हार खलती है और खलनी भी चाहिये लेकिन, हम इससे उबरकर वापसी करेंगे.'' पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-15 18:40:17","image_url":"https://c.ndtvimg.com/2022-07/h7jb9pbs_jos-buttler_160x120_18_July_22.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"e7862d59ceeb7db3d7e957aa5209fdcb","title":"Kal Ka Match Kaun Jeeta: कल का मैच कौन जीता- इंग्लैंड vs अफगानिस्तान","link":"https://hindi.oneindia.com/news/sports/cricket/kal-ka-match-kaun-jeeta-england-vs-afghanistan-world-cup-2023-834077.html","keywords":null,"creator":null,"video_url":null,"description":"Kal Ka Match Kaun Jeeta: कल का मैच अफगानिस्तान और इंग्लैंड के बीच खेला गया था। दिल्ली के अरुण जेटली स्टेडियम में यह मुकाबला खेला गया था। अफगानिस्तान ने इसमें धाकड़ जीत दर्ज की।","content":"डिफेंडिंग वर्ल्ड चैम्पियन इंग्लैंड के बीच मुकाबला खेला गया था। दिल्ली के अरुण जेटली स्टेडियम में खेले गए इस मुकाबले में अफगानिस्तान ने एक बड़ा धमाका कर दिया। इसके बारे में किसी ने भी शायद सोचा नहीं होगा। इंग्लैंड की टीम को मैच में अफगानिस्तान ने हरा दिया। अफगानिस्तान ने इस मुकाबले में 69 रनों के बड़े अंतर से जीत दर्ज कर ली। इस वर्ल्ड कप में अब तक का यह सबसे बड़ा उलटफेर है। मैच शुरू होने से पहले तक इंग्लैंड को ही इस मैच में फेवरेट माना जा रहा था। टॉस जीतकर इंग्लैंड के कप्तान जोस बटलर ने पहले गेंदबाजी करने का निर्णय लिया और यह उनके लिए गलत साबित हुआ। अफगानिस्तान के ओपनर गुरबाज और जादरान ने मिलकर पहले विकेट के लिए शतकीय भागीदारी की। गुरबाज ने 80 रन बनाए। बाद में इकराम अलीखिल ने भी अर्धशतक जड़ा। अफगानिस्तान की टीम 284 रनों का अच्छा स्कोर बनाकर आउट हो गई। इंग्लैंड की टीम के लिए सबसे अच्छी गेंदबाजी आदिल राशिद ने की थी। आदिल राशिद के खाते में कुल 3 विकेट आए। जवाबी पारी में खेलते हुए इंग्लैंड के बल्लेबाज अफगान स्पिनरों के आगे टिक ही नहीं पाए। एक के बाद एक विकेट गिरते चले गए और इंग्लैंड की परेशानी भी बढ़ती चली गई। सिर्फ हैरी ब्रूक ही एकमात्र ऐसे खिलाड़ी थे, जिनके बल्ले से फिफ्टी आई और वह 66 रन के निजी स्कोर पर आउट हो गए। इसके बाद टीम भी 215 पर आउट हो गई। अफगानिस्तान के लिए मुजीब उर रहमान और राशिद खान ने 3-3 विकेट अपने नाम किये। : रहमानुल्लाह गुरबाज (विकेटकीपर), इब्राहिम जादरान, रहमत शाह, हशमतुल्लाह शाहिदी (कप्तान), अजमतुल्लाह ओरजई, मोहम्मद नबी, इकराम अलीखिल, राशिद खान, मुजीब उर रहमान, नवीन उल हक, फजलहक फारुखी। जॉनी बेयरस्टो, डेविड मलान, जो रूट, हैरी ब्रूक, जोस बटलर (कप्तान), लियाम लिविंगस्टोन, सैम करेन, क्रिस वोक्स, मार्क वुड, आदिल रशीद, रीस टॉप्ली।","pubDate":"2023-10-15 18:20:11","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"6bdc2b632bf006ac427ead912c2282a9","title":"Joe Root ने गेंद से दिखाया जादू, बल्लेबाज को खड़े-खड़े कर दिया बोल्ड, अफगानिस्तानी कप्तान के उड़े होश, Video","link":"https://sports.ndtv.com/hindi/cricket/odi-world-cup-2023-hashmatullah-shahidi-wicket-viral-joe-root-magic-ball-england-vs-afghanistan-13th-match-4483188#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Joe Root ने मैच के दौरान एक ऐसी गेंद फेंकी जिसे देखकर हर कोई हैरान रह गया है. बल्लेबाज आउट होने के बाद यकीन ही नहीं कर पा रहा था कि उसके साथ ऐसा हो सकता है.","content":"Joe Root का मैजिक ODI World Cup 2023: वर्ल्ड कप 2023 के 13वें मैच में अफगानिस्तान के खिलाफ इंग्लैंड के पूर्व कप्तान जो रूट ने अपनी गेंदबाजी से जलवा दिखाया है. दरअसल, जो रूट ऐसे गेंदबाज हैं जो इंग्लैंड के लिए पार्ट टाइम गेंदबाज की भूमिका निभाते है. ऐसे में अफगानिस्तान के खिलाफ मैच के दौरान रूट ने अपनी एक मैजिक गेंद पर अफगानी कप्तान हशमतुल्ला शाहिदी को बोल्ड कर दिया. शाहिदी को यकीन ही नहीं हुआ कि वो पार्ट टाइम गेंदबाज के खिलाफ इस तरह से बोल्ड हो सकते हैं. यही कारण था कि आउट होने के बाद अफगानिस्तानी कप्तान हशमतुल्ला शाहिदी कुछ समय के लिए सन्न रह गए थे. आईसीसी ने सोशल मीडिया पर यह वीडियो भी पोस्ट किया है. जिसमें जो रूट अपनी मैजिक गेंद पर बल्लेबाज को खडे-खड़े बोल्ड कर देते हैं. जो रूट ने वनडे वर्ल्ड कप मे अपना यह चौथा विकेट हासिल किया. वहीं, मैच की बात करें तो इंग्लैंड ने मैच में टॉस जीतकर पहले गेंदबाजी करने का फैसला किया था. अफागनिस्तान की शुरुआत शानदार रही थी, गुरबाज और जादरान ने पहले विकेट के लिए 16.4 ओवर में 114 रन जोड़ने में सफल हो गए थे. गुरबाज मैच में 88 रन बनाकर आउट हुए. गुरबाज दुर्भाग्यशाली रहे कि मैच में वो शतक से चूके और रन आउट हो गए. वहीं, अपनी पारी के दौरान गुरबाज ने 33 गेंद पर अर्धशतक जमाने में सफलता पाई थी. उनकी गेंदबाजी देखकर ऐसा लग रहा था कि वो आज तूफानी शतक लगाएंगे लेकिन दुर्भाग्य से साथी खिलाड़ी के साथ रन लेने की हड़बड़ी में रन आउट हो गए. रहमानुल्लाह गुरबाज़ ने 57 गेंद पर 80 रन की पारी खेली जिसमें 8 चौके और 4 छक्के शामिल रहे. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-15 18:16:47","image_url":"https://c.ndtvimg.com/2023-10/00obtsj_joe-root_625x300_15_October_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"a99724415a6740f64114455bdde83f12","title":"Afridi flayed for comment on Indian bowlers","link":"https://www.dailymirror.lk/breaking-news/Afridi-flayed-for-comment-on-Indian-bowlers/108-269241","keywords":null,"creator":null,"video_url":null,"description":"Former captain of the Pakistan cricket team, Shahid Afridiâ€™s comment ascribing Indiaâ€™s success in cricket to a meat diet has drawn a lot of flak. â€™â€™India has a huge 1.4 billion population, and the quality of cricket has changed over the years. Back then, we used to say that they were producing great batters while Pakistan was creating good bowlers.","content":"Former captain of the Pakistan cricket team, Shahid Afridi’s comment ascribing India’s success in cricket to a meat diet has drawn a lot of flak. \"India has a huge 1.4 billion population, and the quality of cricket has changed over the years. Back then, we used to say that they were producing great batters while Pakistan was creating good bowlers. However, their bowlers have now started eating meat, so they have gained strength,\" Afridi was quoted as saying in a Pakistani sports show, according to reports. This comment has not gone down well with the former India fast bowler, Karsan Ghaveri. The 72-year-old former fast bowler, Ghavri, was one of the first to speak out against the comment. \"It is a stupid statement by Afridi. Vegetarians can have equal strength. Individuals might choose to be vegetarian or nonvegetarian. Our former players like Javagal Srinath, the late Yashpal Sharma, Dilip Doshi, and many others are or were pure vergeterians, and they all were successful players\". \"It is a stupid statement by Afridi. Vegetarian eaters can have equal strength, too. There may be more calories in meat, etc., but vegetables and soup have good protein\". \"Many medals have been won by Indian athletes at the Asian Games, and many of them are vegetarians,\" says Ghavri, who took 109 wickets in 39 Tests and 15 in 19 ODIs. \"One should not listen to Afridi's advice\". It is commonly said that cricketers must consume meat to get the required protein for physically demanding games. But meat is not the primary source of protein for every cricketer. In fact, several members of the present Indian team, like Virat Kohli, Rohit Sharma, Ravichandran Ashwin, and Hardik Pandya, have adopted a vegetarian diet, proving that it is possible to be successful on the field without being a non-vegetarian. Kohli admitted to being a vegetarian on Twitter, adding, \"The biggest myth in the world is that non-meat eaters cannot be muscular.\" (Bipin Dani)","pubDate":"2023-10-15 18:09:53","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_e376274b97.jpg","source_id":"dailymirror","source_priority":43341,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8c902d7f6a79d7747bf056f1bbbec9cf","title":"New captain Mendis says Sri Lanka have edge over Australia","link":"https://www.dailymirror.lk/breaking-news/New-captain-Mendis-says-Sri-Lanka-have-edge-over-Australia/108-269249","keywords":null,"creator":null,"video_url":null,"description":"Kusal Mendis, who had captaincy added to his workload on Friday after injured skipper Dasun Shanaka was ruled out of the Cricket World Cup 2023, believes Sri Lanka has the momentum against Australia, who they face on Monday at the Ekana Stadium in Lucknow.","content":"Kusal Mendis, who had captaincy added to his workload on Friday after injured skipper Dasun Shanaka was ruled out of the Cricket World Cup 2023, believes Sri Lanka has the momentum against Australia, who they face on Monday at the Ekana Stadium in Lucknow. Sri Lanka and Australia are yearning for their first win in the tournament with both sides losing their first two games. “The momentum is with us,” said Mendis, making his firs New captain Mendis says Sri Lanka have edge over Australia Kusal Mendis, who had captaincy added to his workload on Friday after injured skipper Dasun Shanaka was ruled out of the Cricket World Cup 2023, believes Sri Lanka has the momentum against Australia, who they face on Monday at the Ekana Stadium in Lucknow. Sri Lanka and Australia are yearning for their first win in the tournament with both sides losing their first two games. “The momentum is with us,” said Mendis, making his first appearance as Sri Lanka’s ODI skipper. “Yes, we have lost two games. But when you look at those losses, I think, we have done much better than the Australians. They will have some doubts about our team”. While Australia’s problem has been their batting, it has been the bowling for the Sri Lankans. But this does not bother him much as he said “Every bowling unit will struggle on Indian pitches”. “We need to adapt quickly and I strongly believe that the bowlers will do their part to the best of their ability. Not only us, even the top-quality attacks have been taken apart and conceded over 300 or 350 plus on these pitches,” he said, adding that his duty is to get the best out of the players. Mendis who has been the mainstay of Sri Lanka’s batting in the tournament, having scored 76 and 122 to go with his 158 in the practice game against Afghanistan said he will bat with the same aggression as he has done in the previous two games. \"I don't like to change the way I bat,” he said. “Before coming for the World Cup, I didn't think I would play at a higher strike rate like this. But after playing the two warm-up games, I understood that I can play freely, because the pitches are good. There will be times when I will have to be a bit more cautious in my approach because the bowlers will come hard at me with their plans. Even though I am the captain, I will not change the way I bat because I know if I am amongst the runs, we will be able to win games”. (Champika Fernando in Lucknow)","pubDate":"2023-10-15 18:09:53","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_a5500087ae.jpg","source_id":"dailymirror","source_priority":43341,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"aff27519556aa50d55a134546f0c9765","title":"[Breaking] Cricket World Cup: Afghanistan shock England","link":"https://blueprint.ng/breaking-cricket-world-cup-afghanistan-shock-england/","keywords":["Sports","#WorldCup","Cricket"],"creator":["Editor"],"video_url":null,"description":"Afghanistan produced the first shock of the ICC Cricket World Cup 2023 when they beat defending champions England by 69 runs on Sunday at the Arun Jaitley Stadium in New Delhi. Holders England crumbled for 215 runs in front of Afghanistan’s trio of spinners after winning the toss and asking Afghanistan to bat first. The underdogs set England a target Read More The post [Breaking] Cricket World Cup: Afghanistan shock England appeared first on Blueprint Newspapers Limited.","content":"Afghanistan produced the first shock of the ICC Cricket World Cup 2023 when they beat defending champions England by 69 runs on Sunday at the Arun Jaitley Stadium in New Delhi. Holders England crumbled for 215 runs in front of Afghanistan’s trio of spinners after winning the toss and asking Afghanistan to bat first. The underdogs set England a target of 285 runs, thanks to a blistering knock of 80 runs off 57 balls from opener Rahmanullah Gurbaz and a half-century from wicketkeeper Ikram Alikhil. Spinners Rashid Khan (23) and Mujeeb Ur Rahman (28) contributed in a lower-order flourish that saw Afghanistan put up a competitive total and allow their bowlers to go all-out against the England batters. Boasting a powerful batting lineup, England were handed an early loss when left-arm pacer Fazalhaq Farooqi dismissed opener Jonny Bairstow in the second over. From then on, Afghanistan’s spinners took over as off spinner Mujeeb Ur Rahman bowled out Joe Root for 11 runs and Mohammad Nabi dismissed Dawid Malan for 32. England captain Jos Buttler was dimissed for nine runs by pace bowler Naveen-ul-Haq. Star leg spinner Rashid Khan added to England’s woes by dismissing Liam Livingstone and Adil Rashid. Harry Brook put up a resistance with his 66-run innings, but fell to Mujeeb Ur Rahman in the 35th over to send England reeling at 169-8. England lost the tournament’s opening match against New Zealand by nine wickets, but beat Bangladesh by 137 runs. Afghanistan suffered heavy losses in both their matches, as they lost to Bangladesh by six wickets and then to hosts India by eight wickets.","pubDate":"2023-10-15 18:00:41","image_url":null,"source_id":"blueprint","source_priority":917110,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"ef3b55d79adbaf42081b7d2af46496eb","title":"England suffer one of the World Cup's biggest ever shocks as they fall to 69-run defeat and hand Afghanistan their second-ever tournament win","link":"https://www.dailymail.co.uk/sport/cricket/article-12633071/England-suffer-one-World-Cups-biggest-shocks-fall-69-run-defeat-against-Afghanistan.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH IN DELHI: England's World Cup defence is in tatters after they were humiliated by Afghanistan at the Feroz Shah Kotla.","content":"England suffer one of the World Cup's biggest ever shocks as they fall to 69-run defeat and hand Afghanistan their second-ever tournament win Jos Buttler's side were chasing 285 to win but fell well short of the target Afghanistan won just their second-ever World Cup match in Delhi World Cup holders may need to win five of last six matches to reach last four By Lawrence Booth for the Daily Mail Published: 17:01, 15 October 2023 | Updated: 18:48, 15 October 2023 e-mail 224 shares 150 View comments England's World Cup defence is in tatters after they were humiliated by Afghanistan at the Feroz Shah Kotla. The tournament, it's true, needed a shock to spice things up. But few expected this game to provide it. A chastening 69-run defeat leaves Jos Buttler 's side probably needing to win five of their remaining six games to reach the last four - and South Africa , India, Australia and Pakistan lie in wait. On this evidence, England will struggle to beat any of them. This was a glorious night for Afghanistan, and a huge feather in the cap of their English coach Jonathan Trott. In 17 previous World Cup matches, their only victims had been Scotland. To humble the world champions is on another level. Such was England's ineptitude, however, that it was if the white-ball revolution set in motion eight years ago by Eoin Morgan never happened. Where was the cleverness with the ball? The ability to react to circumstance? The relentless aggression with the bat? Buttler has played down the significance of his side's descent to fifth in the rankings. But England's alright-on-the-night mentality has produced two defeats out of three. Their aura is going, if not gone. Jos Buttler (right) saw his England side suffer one of the biggest shocks in World Cup history Afghanistan won just their second-ever match at a World Cup on a memorable night in Delhi Afghanistan opener Rahmanullah Gurbaz scored a spectacular 80 off just 57 balls to set the tone The tone was set by the game's opening delivery, which the increasingly hapless Chris Woakes speared down leg, and Buttler allowed to sneak through for five wides. And it continued as Afghanistan opener Rahmanullah Gurbaz flayed a spectacular 80 off 57 balls before being run out by a horrible call from his captain, Hashmatullah Shahidi. The spinners threatened to tilt the match England's way, only for more sloppiness - including a missed stumping by Buttler - to allow Afghanistan to turn 190 for six into 284. Four days earlier, against the same opponents at the same venue, India had easily knocked off 273 in 35 overs. But the suspicion that England are not the team they were - or even what they think they are - grew during a lame batting display in which only Harry Brook emerged with credit. If and when Ben Stokes returns against South Africa in Mumbai on Saturday, it cannot be Brook who makes way. Afghanistan were superb in pulling off their first win over England in any format. But this was a night to conjure up memories of the bad old times, and a 50-over World Cup defeat to rank with Zimbabwe at Albury in 1992, Australia at Port Elizabeth in 2003, Ireland at Bangalore in 2011 and Bangladesh at Adelaide in 2015. The warning signs have been there. They dismissed the nine-wicket hammering by New Zealand as an aberration, before Bangladesh failed to punish them for a lame final 10 overs with the bat in Dharamshala. But the conservatism that once blighted English cricket seems to have returned. England had a chance here to blood either Gus Atkinson or David Willey, or both. Instead, Woakes - one of the heroes of the Ashes comeback - has made himself unselectable, along with Sam Curran. Woakes has now taken two for 135 at this World Cup, and Curran two for 122. Their combined figures here were 8-0-87-0. All the while, Atkinson has been firing rockets in the nets under the approving eye of bowling coach David Saker. Woakes' first three overs cost 31, and when Buttler brought him back for the 25th, his second ball was whacked over long-on by Azmatullah Omarzai. He was not seen again. Curran, meanwhile, disappeared for 26 in his first two, then 18 in another towards the end. Harry Brook was the only England batter to show any fluency, scoring 66 runs as their batting order collapsed England struggled to deal with Afghanistan's spinners, with Mujeeb Ur Rahman (above) taking three wickets along with Rashid Khan Reece Topley bowled a decent opening spell, though hearts were in mouths when he briefly left the field after hurting his right knee on the boundary. Mark Wood deserved better than two for 50. But the mid-innings success of the spinners, led by Adil Rashid and reinforced by Liam Livingstone, made it all the more curious that Buttler gave only four overs to Root's off-breaks: figures of one for 19 felt unfulfilled. While England's three spinners took five for 94 off 24 overs, their four seamers managed three for 189 off 25.5. Like batting first, it was a misreading of the conditions. Buttler then failed to stump Afghanistan wicketkeeper Ikram Alikhil off Livingstone only 23 runs into his eventual 58, and England's nous deserted them completely at the death. The chase got off to a horrible start as Rod Tucker upheld a marginal lbw to dispatch Jonny Bairstow for two, playing round an inswinger from left-armer Fazalhaq Farooqi. Bairstow stormed off in high dudgeon. Afghanistan are coached by former England batter Jonathan Trott But with the exception of Brook, there was a deflating lack of intent. Joe Root stayed back to off-spinner Mujeeb Ur Rahman and was bowled for 11, before Dawid Malan chipped Mohammad Nabi to short extra for 32. When Buttler was bowled through a gap the size of nearby India Gate by a magnificent inswinger from Naveen-ul-Haq, it was 91 for four. Livingstone was plumb leg-before to Rashid Khan, and wasted a review, before Curran was caught at slip off Nabi. Woakes completed a miserable evening when he was bowled by Mujeeb, and England's final hope evaporated when Brook edged Mujeeb for an otherwise mature 66. On a pitch that slowed as the match progressed, their spinners finished with eight wickets. Soon, Afghanistan were celebrating their most famous night, and a large Delhi crowd celebrated with them. Only 10 days into a tournament England had designs on winning, they have barely half a hand on their trophy. Share or comment on this article: England suffer one of the World Cup's biggest ever shocks as they fall to 69-run defeat and hand Afghanistan their second-ever tournament win e-mail 224 shares Add comment Comments 151 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-15 17:48:29","image_url":"https://i.dailymail.co.uk/1s/2023/10/15/16/76585083-0-image-m-49_1697384578664.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0608b416f44c1670d03252084c92aab7","title":"Aaj Ka Match Kaun Jeeta: आज का मैच कौन जीता- इंग्लैंड vs अफगानिस्तान","link":"https://hindi.oneindia.com/news/sports/cricket/aaj-ka-match-kaun-jeeta-world-cup-mein-afghanistan-vs-england-834045.html","keywords":null,"creator":null,"video_url":null,"description":"England vs Afghanistan: अफगानिस्तान की टीम ने तगड़ा धमाका करते हुए वर्ल्ड चैम्पियन इंग्लैंड को पराजित कर दिया। यह सबसे बड़ा उल्टफेर है।","content":"अफगानिस्तान ने बड़ा उलटफेर कर दिया। दिल्ली के अरुण जेटली स्टेडियम में अफगानिस्तान की टीम ने वर्ल्ड चैम्पियन इंग्लैंड को 69 रनों पराजित कर दिया। साल 2011 में भारत में खेले गए वर्ल्ड कप में इंग्लैंड की टीम को आयरलैंड के खिलाफ हार मिली थी। टॉस जीतकर इंग्लैंड ने पहले गेंदबाजी करने का निर्णय लिया और यह गलत साबित हुआ। अफगानिस्तान के ओपनरों ने जमकर रन बना डाले। अफगानिस्तान के ओपनर गुरबाज और इब्राहिम जादरान के बल्ले से रन आए और एक शतकीय भागीदारी देखने को मिली। जादरान 28 रन की पारी खेलकर आउट हो गए लेकिन गुरबाज के बल्ले से लगातार रन आए। वह अपनी फिफ्टी के बाद भी टिके रहे। इस बीच रहमत शाह 3 रन बनाकर आउट हो गए और शाहीदी 14 रन के निजी स्कोर पर चलते बने। गुरबाज के बल्ले से शतक की उम्मीद थी लेकिन वह 80 के निजी स्कोर पर रन आउट हो गए। गुरबाज के अलावा इकराम अलीखिल ने भी अर्धशतक जड़ा और 58 के निजी स्कोर पर आउट होकर चलते बने। राशिद खान ने 23 और मुजीब उर रहमान ने 28 रनों की पारी खेली और अफगानिस्तान की टीम 284 पर आउट हुई। इंग्लैंड के लिए आदिल राशिद ने 3 विकेट झटके। जवाबी पारी में खेलते हुए इंग्लैंड की टीम ने बेयरस्टो का विकेट जल्दी गंवा दिया। वह 2 रन पर आउट हुए। यहाँ से नियमित अन्तराल पर विकेट गिरे। अफगानिस्तान के स्पिनरों ने इंग्लैंड को नचाया। मलान 32 और रूट 11 रन बनाकर आउट हो गए। एक के बाद एक विकेट गिरे लेकिन हैरी ब्रूक अकेले क्रीज पर टिके। वह 66 रन बनाकर चलते बने और यही इंग्लैंड की हार तय हो गई। अंत में इंग्लैंड की टीम 215 पर आउट हो गई और अफगानिस्तान ने एक बड़ा उलटफेर कर दिया। अफगानिस्तान ने मैच 69 रनों से अपने नाम कर लिया। अफगानिस्तान की टीम के लिए मुजीब उर रहमान और राशिद खान ने मिलकर 3-3 विकेट अपने नाम किये।","pubDate":"2023-10-15 17:44:09","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"}]}