{"newsArray":[{"title":"Highest individual score in Ranji Trophy: Full list of most runs in an innings by a batter in Ranji Trophy","link":"https://thesportsrush.com/cricket-news-highest-individual-score-in-ranji-trophy-full-list-of-most-runs-in-an-innings-by-a-batter-in-ranji-trophy/","keywords":["Cricket","Bihar","Mizoram","Ranji Trophy","Ranji Trophy 2022","Sakibul Gani"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest individual score in Ranji Trophy: A debutant batter from Bihar entered the record books on the back of a maiden triple century. During a Plate Group match of the ongoing Ranji Trophy season between Bihar and Mizoram in Kolkata, Bihar batter Sakibul Gani created a world-record by becoming the first-ever batter to score a… The post Highest individual score in Ranji Trophy: Full list of most runs in an innings by a batter in Ranji Trophy appeared first on The SportsRush.","content":"Highest individual score in Ranji Trophy: A debutant batter from Bihar entered the record books on the back of a maiden triple century. During a Plate Group match of the ongoing Ranji Trophy season between Bihar and Mizoram in Kolkata, Bihar batter Sakibul Gani created a world-record by becoming the first-ever batter to score a triple century on first-class debut. Coming in to bat at No. 5 in the 23rd over, Gani and Babul Kumar (229*) put together a mammoth 538-run partnership for the fourth wicket. It was Mizoram all-rounder Iqbal Abdulla who dismissed Gani to bring an end to the third-highest fourth-wicket partnership in first-class cricket. Gani, 22, walked back to the pavilion after scoring 341 (405) at a strike rate of 84.19 including 56 fours and two sixes as his and Kumar’s herculean effort powered Bihar to 686/5 dec. in 159.4 overs. In what is the 10th highest individual score in Ranji Trophy, it came on the back of Gani becoming the 42nd batter to score the 47th Ranji Trophy triple century. Highest individual score in Ranji Trophy Score Player Team Opposition Season 443* B. B. Nimbalkar Maharashtra Saurashtra 1948/49 377 Sanjay Manjrekar Bombay Hyderabad 1990/91 366 M. V. Sridhar Hyderabad Andhra 1993/94 359* Vijay Merchant Bombay Maharashtra 1943/44 359* Samit Gohel Gujarat Odisha 2016/17 353 VVS Laxman Hyderabad Karnataka 1999/00 352 Cheteshwar Pujara Saurashtra Karnataka 2012/13 351* Swapnil Gugale Maharashtra Delhi 2016/17 343 Puneet Bisht Meghalaya Sikkim 2018/19 341 Sakibul Gani Bihar Mizroram 2021/22 340 Sunil Gavaskar Bombay Bengal 1981/82 Gani surpassed Madhya Pradesh batter Ajay Rohera’s heroics to become the highest run-scorer on Ranji debut. It was in 2018 that Rohera had scored 267* (345) to play a titular role in Madhya Pradesh defeating Hyderabad by an innings and 253 runs in Indore. RECORD ALERT 3⃣4⃣1⃣ Runs 4⃣0⃣5⃣ Balls 5⃣6⃣ Fours 2⃣ Sixes Sakibul Gani, playing for Bihar, created a world record as he became the 1⃣st batter to score a Triple Ton on First Class debut. #BIHvCAM #RanjiTrophy @Paytm A snippet from that landmark knock pic.twitter.com/LXK7F0yA2N — BCCI Domestic (@BCCIdomestic) February 18, 2022 While India U-19 World Cup winning captain Yash Dhull had gained limelight after scoring a maiden century on first-class debut on Thursday, other debutants who made the most of an opportunity given to them are Maharashtra’s Pavan Shah (219 vs Assam in Rohtak) and Punjab’s Prabhsimran Singh (123 vs Himachal Pradesh in Delhi). Also making his debut, Dhull’s U-19 teammate Nishant Sindhu narrowly missed out on a century after scoring 93* (139) with the help of 10 fours and a six against Tripura in Delhi. The post Highest individual score in Ranji Trophy: Full list of most runs in an innings by a batter in Ranji Trophy appeared first on The SportsRush.","pubDate":"2022-02-19 03:15:37","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Bismah firm on proving themselves","link":"https://www.thenews.com.pk/print/934890-bismah-firm-on-proving-themselves","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Pakistan national women cricket team captain Bismah Maroof feels while participating in the ICC Women’s Cricket World Cup 2022, they have a chance to prove their selves.Bismah in a column on the ICC website stated that the Women’s World Cup is a platform where stars are born,...","content":null,"pubDate":"2022-02-19 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Inglis, Maxwell power Australia to win over SL","link":"https://www.thenews.com.pk/print/934892-inglis-maxwell-power-australia-to-win-over-sl","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE: An aggressive 71-run stand from Josh Inglis and Glenn Maxwell powered Australia to a six-wicket win and their fourth straight Twenty20 victory over Sri Lanka at the Melbourne Cricket Ground on Friday.Chasing 139 for eight, the home team reached the mark for the loss of four wickets with...","content":null,"pubDate":"2022-02-19 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Australia cruise to win over Sri Lanka","link":"https://www.news.com.au/sport/cricket/australia-cruise-to-win-over-sri-lanka/video/5505ba698d65251e86b97088d4abb120","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Australia is now 4-0 up in their best of five T20 series against Sri Lanka, chasing down 140 with 11 balls to spare.","content":null,"pubDate":"2022-02-18 23:00:10","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia cruise to win over Sri Lanka","link":"https://www.cairnspost.com.au/sport/cricket/australia-cruise-to-win-over-sri-lanka/video/5505ba698d65251e86b97088d4abb120","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia is now 4-0 up in their best of five T20 series against Sri Lanka, chasing down 140 with 11 balls to spare.","content":null,"pubDate":"2022-02-18 23:00:10","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Tassie on top early but Blues fight back","link":"https://www.cairnspost.com.au/sport/cricket/tassie-on-top-early-but-blues-fight-back/video/37239583239862c4965162e0c9e4382e","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: NSW have overcome a poor start on the opening day of their Sheffield Shield clash against Tasmania in Sydney.","content":null,"pubDate":"2022-02-18 23:00:09","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Tassie on top early but Blues fight back","link":"https://www.news.com.au/sport/cricket/tassie-on-top-early-but-blues-fight-back/video/37239583239862c4965162e0c9e4382e","keywords":null,"creator":null,"video_url":null,"description":"Cricket: NSW have overcome a poor start on the opening day of their Sheffield Shield clash against Tasmania in Sydney.","content":null,"pubDate":"2022-02-18 23:00:09","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Why Australia's spin future hangs on Pakistan","link":"https://wwos.nine.com.au/cricket/australia-vs-pakistan-tour-squad-team-mitchell-swepson-debut-mark-taylor-stuart-macgill-1998-stats/33e83fa8-e874-4d21-9a98-7f746e5aa2a4","keywords":null,"creator":["wwos"],"video_url":null,"description":"Mark Taylor is eager to see how Australia lines up in Pakistan, with the future of Australia's spin bowling stocks at stake.","content":"Cricket legend Mark Taylor believes uncapped Australian spinner Mitchell Swepson can emulate what Stuart MacGill did on their tour of Pakistan in 1998.The Aussies will next month head to Pakistan for the first time since Taylor captained the team 24 years ago. They're scheduled to play three Tests, three ODIs, and a Twenty20.An 18-man squad was named last week, which featured three specialist spin bowlers. Experienced off-spinner Nathan Lyon is joined by Swepson and Ashton Agar, who both turn the ball away from the right-hander.READ MORE: Magnificent Maxwell inspires Aussie victoryREAD MORE: Turbo sends ominous message ahead of seasonREAD MORE: Raiders skipper passes first test since injuryTaylor is keen for Queensland leggie Swepson to make his Test debut, in the hope he emerges as the frontrunner to replace 34-year-old Lyon once the latter decides to hang up the whites.\"If Swepson was to play and debut then that will be a big challenge (in Pakistan),\" Taylor told Wide World of Sports.\"I can go back to '98 when Australia last toured Pakistan, and Stu MacGill did very well for us. Warnie (Shane Warne) didn't go on that tour in '98, and MacGill had a very good first Test match.\"A good leg-spinner can certainly turn and win you games of Test cricket over there.\"It will be a great challenge for him if he is to play.\"MacGill - a one-Test rookie at the time - took 15 wickets at 27.46 on the Pakistan tour, including a remarkable 9-113 in the first Test at Rawalpindi which the Aussies won by an innings and 99 runs.His career was ultimately hampered by Warne - one of the greatest bowlers of all time - and MacGill played only 44 Tests for Australia, despite his talent.Swepson, though, has a genuine opportunity to become the country's first-choice Test spinner once Lyon retires.Taylor has previously aired his concerns about Australia's spin depth, with no clear Lyon replacement currently waiting in the wings.Pakistan will likely see Swepson debut, and it may well be that he and Lyon play side by side in the same team.\"No doubt I think they could (play together) if they put out slow, low pitches which turn,\" Taylor said.\"Now with (Cameron) Green in at No.6 Australia can easily play two quicks, two slows, and Green and we would have a very good bowling attack.\"That is definitely an option for Australia.\"The series will kick off with a Test match in Rawalpindi on March 4.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-18 21:56:36","full_description":"Cricket legend Mark Taylor believes uncapped Australian spinner Mitchell Swepson can emulate what Stuart MacGill did on their tour of Pakistan in 1998. The Aussies will next month head to Pakistan for the first time since Taylor captained the team 24 years ago. They're scheduled to play three Tests, three ODIs, and a Twenty20. An 18-man squad was named last week , which featured three specialist spin bowlers. Experienced off-spinner Nathan Lyon is joined by Swepson and Ashton Agar, who both turn the ball away from the right-hander. READ MORE: Magnificent Maxwell inspires Aussie victory READ MORE: Turbo sends ominous message ahead of season READ MORE: Raiders skipper passes first test since injury Taylor is keen for Queensland leggie Swepson to make his Test debut, in the hope he emerges as the frontrunner to replace 34-year-old Lyon once the latter decides to hang up the whites. \"If Swepson was to play and debut then that will be a big challenge (in Pakistan),\" Taylor told Wide World of Sports . \"I can go back to '98 when Australia last toured Pakistan, and Stu MacGill did very well for us. Warnie (Shane Warne) didn't go on that tour in '98, and MacGill had a very good first Test match. \"A good leg-spinner can certainly turn and win you games of Test cricket over there. \"It will be a great challenge for him if he is to play.\" MacGill - a one-Test rookie at the time - took 15 wickets at 27.46 on the Pakistan tour, including a remarkable 9-113 in the first Test at Rawalpindi which the Aussies won by an innings and 99 runs. His career was ultimately hampered by Warne - one of the greatest bowlers of all time - and MacGill played only 44 Tests for Australia, despite his talent. Swepson, though, has a genuine opportunity to become the country's first-choice Test spinner once Lyon retires. Taylor has previously aired his concerns about Australia's spin depth, with no clear Lyon replacement currently waiting in the wings. Pakistan will likely see Swepson debut, and it may well be that he and Lyon play side by side in the same team. \"No doubt I think they could (play together) if they put out slow, low pitches which turn,\" Taylor said. \"Now with (Cameron) Green in at No.6 Australia can easily play two quicks, two slows, and Green and we would have a very good bowling attack. \"That is definitely an option for Australia.\" The series will kick off with a Test match in Rawalpindi on March 4. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/410120/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"South Africa biggest defeat in Test Cricket: List of South Africa’s biggest Test defeats","link":"https://thesportsrush.com/cricket-news-south-africa-biggest-defeat-in-test-cricket-list-of-south-africas-biggest-test-defeats/","keywords":["Cricket","New Zealand","South Africa","South Africa tour of New Zealand"],"creator":["Gurpreet Singh"],"video_url":null,"description":"South Africa biggest defeat in Test Cricket: South Africa are staring at a huge defeat ahead of Day 3 of 1st Test versus New Zealand. During the second day of the ongoing first Test match between New Zealand and South Africa at Christchurch, the defending Test champions have tightened the noose around the Proteas batters’… The post South Africa biggest defeat in Test Cricket: List of South Africa’s biggest Test defeats appeared first on The SportsRush.","content":"South Africa biggest defeat in Test Cricket: South Africa are staring at a huge defeat ahead of Day 3 of 1st Test versus New Zealand. During the second day of the ongoing first Test match between New Zealand and South Africa at Christchurch, the defending Test champions have tightened the noose around the Proteas batters’ necks, as they stare at an innings defeat on Day 3 itself. Having bundled up the South African batting line-up for mere 95 in the first innings on Day 1, the Kiwi batters, lead by their night watchman Neil Wagner (49) and Henry Nicholls (105) began Day 2 in a resounding fashion, to post 235/4 at the stroke of Lunch after resuming the innings at the overnight score of 116/3. Some handy contributions from wicketkeeper batter Tom Blundell (96) and Colin de Grandhomme (46) lower down the batting order helped Tom Latham’s men to power the scoreboard to 482/10, with a massive advantage of a 387-run 1st innings lead. South Africa, who had no option but to play the catch-up game, and go for the Draw, were handed an early blow off the second delivery of their second innings, as Tim Southee got rid of the debutant Sarel Erwee (0). Matt Henry-star with the ball in the first innings for the Kiwis, then got rid of skipper Dean Elgar (0), with Southee picking the final wicket of the day soon after by dismissing Aiden Markram (2), as South Africa were reduced to 34/3 at Stumps on Day 2. Trailing by another 353 runs before they go for the lead, the Proteas would need all their batters to play the best innings of their lives, to even think of a Draw. South Africa trail by 353 runs at stumps on day two. New Zealand were dominant in all three sessions and sit in a very comfortable position in the first Test.#NZvSA | #WTC23 pic.twitter.com/quK25g0Wzv — ICC (@ICC) February 18, 2022 South Africa biggest defeat in Test Cricket Interestingly, South Africa arrived at the New Zealand shores with a reputation unparalleled. They have never lost a Test series in New Zealand since 1931, and unbelievably are the only Cricketing nation to have maintained the streak up till now. As far as their biggest Test defeats are concerned, the biggest one came way back in February 2002, when they lost against Australia in Johannesburg by an innings and 360 runs. ALSO READ: Biggest Test win for New Zealand Top-5 biggest South African Test defeats (by innings) Defeat margin Opposition Year Venue Innings & 360 runs Australia 2002 Johannesburg Innings & 259 runs Australia 1950 Port Elizabeth Innings & 202 runs England 1889 Cape Town Innings & 202 runs India 2019 Ranchi Innings & 197 runs England 1896 Johannesburg Top-5 biggest South African Test defeats (by runs) Defeat margin Opposition Year Venue 530 runs Australia 1911 Melbourne 337 runs India 2015 Delhi 313 runs Sri Lanka 2004 Colombo 312 runs England 1957 Cape Town 288 runs England 1896 Port Elizabeth The post South Africa biggest defeat in Test Cricket: List of South Africa’s biggest Test defeats appeared first on The SportsRush.","pubDate":"2022-02-18 20:33:29","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Biggest Test win for New Zealand: List of New Zealand biggest wins in Test cricket","link":"https://thesportsrush.com/cricket-news-biggest-test-win-for-new-zealand-list-of-new-zealand-biggest-wins-in-test-cricket/","keywords":["Cricket","New Zealand","South Africa","South Africa tour of New Zealand 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Biggest Test win for New Zealand: New Zealand are on the brink of registering a record-breaking victory at the Hagley Oval. Despite a dismal head-to-head record including their last victory coming almost a couple of decades ago, all it took for New Zealand to gain an early advantage in the ongoing two-match Test series against… The post Biggest Test win for New Zealand: List of New Zealand biggest wins in Test cricket appeared first on The SportsRush.","content":"Biggest Test win for New Zealand: New Zealand are on the brink of registering a record-breaking victory at the Hagley Oval. Despite a dismal head-to-head record including their last victory coming almost a couple of decades ago, all it took for New Zealand to gain an early advantage in the ongoing two-match Test series against South Africa was a session. Since then, New Zealand have ticked all the possible boxes to be in a position from where a record-breaking victory doesn’t seem very distant. The start of the third day requires New Zealand to pick seven wickets to wrap-up the match at the Hagley Oval. With South Africa trailing by as many as 353 runs, saving this match with three more days remaining doubtlessly requires a miraculous effort. Runs for Dad! @HenryNicholls27 and his wife welcomed their first child into the world in the last month, so two Tests at home have come at the perfect time. Follow Day 3 from Hagley Oval LIVE with @sparknzsport and the rova app. #NZvSA pic.twitter.com/29p11jdIzF — BLACKCAPS (@BLACKCAPS) February 18, 2022 In such a situation, it wouldn’t be wrong to say that this match could enter the record books especially if New Zealand continue their domination on Saturday. Biggest Test win for New Zealand To achieve a personal best Test victory, New Zealand will have to bowl out the Proteas as early as possible on Day 4. It is noteworthy that New Zealand’s biggest-ever Test victory (if it happens tomorrow) might also be their the biggest-ever Test victory at home. Christchurch, which hosted Pakistan last year, had witnessed a biggest Test victory (innings and 176 runs) getting registered. If the same happens in this match, expect the fans to be jubilant at the sight of a thumping victory. As far as the biggest Test wins in New Zealand concerned, West Indies had defeated New Zealand by an innings and 322 runs in 1995. The only other instance of a team winning by an innings and 300+ runs in New Zealand was when the hosts had defeated Zimbabwe in Napier in 2002. In terms of runs, New Zealand had defeated Sri Lanka by 423 runs in 2018 but had lost against Pakistan by 299 runs in Auckland in 2001. By Innings Margin Opposition Ground Year Innings & 301 runs Zimbabwe Napier 2012 Innings & 295 runs Zimbabwe Harare 2005 Innings & 185 runs Pakistan Hamilton 2001 Innings & 176 runs Pakistan Christchurch 2021 Innings & 137 runs Bangladesh Wellington 2008 By Runs Margin Opposition Ground Year 423 Sri Lanka Christchurch 2018 254 Zimbabwe Bulawayo 2016 240 West Indies Hamilton 2017 204 West Indies Bridgetown 2002 199 England Leeds 2015 The post Biggest Test win for New Zealand: List of New Zealand biggest wins in Test cricket appeared first on The SportsRush.","pubDate":"2022-02-18 20:12:52","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Rovman Powell was hitting bullets”: Rishabh Pant heaps praise on Delhi Capitals teammate Rovman Powell post his blistering innings during IND vs WI 2nd T20I","link":"https://thesportsrush.com/cricket-news-rovman-powell-was-hitting-bullets-rishabh-pant-heaps-praise-on-delhi-capitals-teammate-rovman-powell-post-his-blistering-innings-during-ind-vs-wi-2nd-t20i/","keywords":["Cricket","rishabh pant","Rovman Powell","West Indies tour of India"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Rishabh Pant heaps praise on Delhi Capitals teammate Rovman Powell post his fantastic display of power hitting during 2nd T20I at Kolkata. During the 2nd T20I between India and West Indies at the Eden Gardens in Kolkata, the ‘Men in Blue’ prevailed over Kieron Pollard’s men yet again by 8 runs, in what was an… The post “Rovman Powell was hitting bullets”: Rishabh Pant heaps praise on Delhi Capitals teammate Rovman Powell post his blistering innings during IND vs WI 2nd T20I appeared first on The SportsRush.","content":"Rishabh Pant heaps praise on Delhi Capitals teammate Rovman Powell post his fantastic display of power hitting during 2nd T20I at Kolkata. During the 2nd T20I between India and West Indies at the Eden Gardens in Kolkata, the ‘Men in Blue’ prevailed over Kieron Pollard’s men yet again by 8 runs, in what was an edge-of-the-seat encounter between two top T20 sides in World Cricket. Courtesy the win, India take an unassailable 2-0 lead in the 3-match T20I series, with the final encounter to take place on Sunday. While there were at least half-a-dozen useful performances that were instrumental in India’s victory today, the match result eventually boiled down to India’s death bowling, as the likes of Bhuvneshwar Kumar and Harshal Patel were handed the task to defend 37 runs in the last 3 Overs. Chasing the score of 186/5 posted by India first up, West Indies were right in the game till the end, courtesy a 100-run partnership off 60 deliveries by Nicholas Pooran (62 off 41) and Rovman Powell (68* off 36) for the 3rd wicket. But, it were the 18th (bowled by Harshal Patel) and the 19th Over (bowled by Bhuvneshwar Kumar) which leaked mere 8 and 4 runs respectively that eventually tilted the result in India’s favour. With 25 needed of the final Over, and with Powell in no mood to throw in the towel, the 28-year-old made things interesting by tonking Harshal for two power sixes, but could eventually garner mere 16 runs to end up the team’s total at 178/3 in the 20 Overs. Rishabh Pant heaps praise on Delhi Capitals teammate Rovman Powell Earlier, India, on the back of admirable innings from Virat Kohli (52 offf 41) and then by Rishabh Pant (52 off 41) and Venkatesh Iyer (33 off 18) during the latter half of the innings, posted a challenging 186/5 after their 20 Overs. FIFTY!@RishabhPant17 brings up his third T20I half-century off 27 deliveries Live – https://t.co/vJtANowUFr #INDvWI @Paytm pic.twitter.com/PjW5hKsv3k — BCCI (@BCCI) February 18, 2022 Pant, who was eventually elected the ‘Player of the match‘ for his innings which was laden with 7 Fours and a Six, was all in awe of his new Delhi Capitals teammate Rovman Powell’s exhibition of power hits during the chase, which he was witness to from behind the stumps. Powell, who smashed 4 Fours in addition to the 5 gigantic Sixes, was roped in by the Delhi Capitals’ think-tank for INR 2.80 Crore during the recently concluded IPL’s mega auction ahead of the imminent IPL 2022. “I think Powell was hitting bullets out there but at the back of the mind I was happy as well because he will be playing for Delhi Capitals”, remarked Pant when asked to throw some light on Powell’s innings during the Windies chase. The post “Rovman Powell was hitting bullets”: Rishabh Pant heaps praise on Delhi Capitals teammate Rovman Powell post his blistering innings during IND vs WI 2nd T20I appeared first on The SportsRush.","pubDate":"2022-02-18 18:35:00","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Highlights IND vs WI Score 2nd T20I Scorecard: Pant, Kohli Star As India Drub Windies By 8 Runs - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMizwFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2hpZ2hsaWdodHMtaW5kaWEtYmVhdC13ZXN0LWluZGllcy1ieS04LXJ1bnMtMm5kLXQyMGktc2NvcmVjYXJkLXRvZGF5cy1tYXRjaC1pbmQtdnMtd2ktMi0wLWhvdHN0YXIta29sa2F0YS1yb2hpdC1zaGFybWEtdmlyYXQta29obGktcGFudC1wb29yYW4tYmh1dm5lc2h3YXItcG93ZWxsLWhhcnNoYWwtNTI0NjcwNy_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights IND vs WI Score 2nd T20I Scorecard: Pant, Kohli Star As India Drub Windies By 8 Runs  India.comIND vs WI: Watch: Indian Players Run After Venkatesh Iyer Hits A Boundary Towards The Dug Out  Cricket AddictorRecent Match Report - India vs West Indies 2nd T20I 2021/22  ESPNcricinfoIndia vs West Indies 2nd T20I Highlights: India beat West Indies by 8 runs to take unassailable 2-0 lead  Times of IndiaLive Blog Cricket Score - India vs West Indies, 2nd T20I | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-02-18 18:17:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Bowlers fire, batters cruise home as Australia go 4-0 up | Australia v Sri Lanka 2021-22 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9bmJicHlHZnlZdGvSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Bowlers fire, batters cruise home as Australia go 4-0 up | Australia v Sri Lanka 2021-22  cricket.com.auAussie skipper ‘not the player he was’  NEWS.com.auGlenn Maxwell shines at the MCG as Aussies take 4-0 T20 series lead over Sri Lanka  Wide World of Sports‘Don’t know where we go’: Aussies face more questions than answers as WC looms - Talking Pts  Fox SportsAustralia beats Sri Lanka by six wickets in fourth T20 international at MCG  ABC NewsView Full coverage on Google News","content":null,"pubDate":"2022-02-18 18:10:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Christian Vieri was a cricket prodigy who loved Allan Border, runs a fashion label with Paolo Maldini, has his own beer, and played Ivan Drago in a film","link":"https://talksport.com/football/1045564/vieri-was-cricket-allan-border-fashion-label-paolo-maldini-beer-ivan-drago-film/","keywords":["Football","Christian Vieri"],"creator":["Jackson Cole"],"video_url":null,"description":"You’re only scratching the surface when talking about Christian Vieri the footballer. He boasts a limited amount of team honours with just one Serie A title, two Coppas Italia and a UEFA Cup Winners’ Cup to his name, but make no mistake, he was deadly on his day. The late 1990s saw Vieri reach his […]","content":"You’re only scratching the surface when talking about Christian Vieri the footballer. He boasts a limited amount of team honours with just one Serie A title, two Coppas Italia and a UEFA Cup Winners’ Cup to his name, but make no mistake, he was deadly on his day. Vieri certainly has his fingers in many pies The late 1990s saw Vieri reach his peak, the former striker netting five goals for Italy at the 1998 World Cup. His form kicked on in the 1998/99 season as he played a key role in a memorable campaign for Lazio, who won the Suppercoppa Italiana and UEFA Cup Winners’ Cup. They also finished just a point behind Serie A winners AC Milan. That earned him a £32million move to Inter Milan in the summer of 1999, a record transfer fee at the time. His spell at Inter was very un-Vieri-like, though. He was at the San Siro for six years, but at the other 14 clubs in his playing career he was never around for longer than a year. But that’s Vieri in a nutshell. He was professional butterfly who did his career on his own terms. This mindset meant he was never going one to just stick to the football. In a parallel universe Vieri isn’t a football icon at all but actually one of the greatest batsmen of all time. Vieri is Italy’s joint top scorer in World Cup history with nine goalsAFP - Getty Most read in Football blown away Spurs and Burnley affected by Storm Eunice as record-breaking winds wreak havoc gloat McCoist revels in Rangers win and jokes Celtic will drop into Eurovision Song Contest NOT HAPPY Sunderland fans feel 'misled and lied to' after Dreyfus ownership revelation d'oh! Ex-Spurs star couldn't tell West Ham and Villa apart, fought teammate and loved 'Arry BANTER Everton star 'hopes Liverpool don't win UCL' again as he'll get more stick from fans cash 'Scandalous' United are worse than Man City after Liverpool revelation, says Jordan mad Conte's bombshell interview is 'statement of regret' and 'he's covering his own back' role model 'You don’t have to hide your sexuality to play football', says Chelsea superstar When he was in red-hot form at France 1998, Vieri shocked journalists when he revealed his childhood hero was Allan Border… the Australian cricket legend. Vieri spent many of his early years growing up Down Under and naturally took up cricket, and by his account he was a very promising player. “It’s a bit strange that I grew up in Australia but when I was there it was normal – going to school, playing soccer, playing cricket, playing different sports. I was a big fan of cricket,” Vieri said. “Even if we were 13-14, we would go watch Australia play Test matches, ODI matches in Sydney. I’m a very big, big cricket fan. Maybe Vieri would be wiping the floor with England in the Ashes if he made different decisionsGetty “I just love playing. I was probably playing more cricket than soccer at school. You know what we would do? The tennis ball, we would tape it up to make it go faster and swing. I think I would’ve been the best batsman in the world if I played cricket. I was an all-rounder. I was really good.” It’s not just the world of sport he’s dipped into. Vieri can call himself a movie star, having played Rocky Balboa’s Soviet enemy Ivan Drago in Italian comedy Picasso’s Face, a spoof film with a similar premise to Epic Movie or Scary Movie. While playing he even cracked the world of fashion, opening up a label with AC Milan icon Paolo Maldini in 2003 – this all happening while Vieri and Maldini were playing for rival Milan clubs. Sweet Years, which has been endorsed by a number of high profile sports stars including Diego Maradona and Rafael Nadal, has proved to be a successful project as it’s still going now. Vieri had a cameo role in the 2000 film, playing the Rocky’s rivaltwitter @Shuttsapalooza They were enemies on the pitch but Maldini and Vieri sensed a business opportunityGetty When scoring goals Vieri would this is as an opportunity to promote his brand – this was before players would get a yellow card for removing their shirtGetty Since retiring in 2009, Vieri has moved into the punditry world but has also branched out into other business ventures. He’s the owner of Bombeer, an Italian premium lager beer which is mainly supplied to the US market. Christian Vieri – one of football’s great mavericks. We’ll drink to that! Vieri did his career and has lived his life on his own termsGetty Betting Offer Of The Day Bet365: Bet £10 Get £50 in Free Bets* – CLAIM HERE Betfred: Bet £10 Get £60 in Bonuses* – CLAIM HERE Bet365: Min deposit requirement. Free Bets are paid as Bet Credits and are available for use upon settlement of qualifying bets. Min odds, bet and payment method exclusions apply. Returns exclude Bet Credits stake. Time limits and T&Cs apply 18+ Begambleaware.org Betfred: New UK customers only. Register using the promo code BETFRED60, deposit and place first bet of £10+ on Sports (cumulative Evens+) within 7 days of registration. First bet must be on Sports. £20 in Free Bets to be used on Sports, £10 in Free Bets to be used on Lotto and 50 Free Spins (20p per spin) credited within 48 hours of bet settlement. Further £20 in Free Bets credited 5 days after settlement. Bonuses have a 7-day expiry. Payment restrictions apply. SMS verification and/or Proof of I.D and address may be required. Full T&Cs apply. 18+ Begambleaware.org","pubDate":"2022-02-18 18:00:00","full_description":"You’re only scratching the surface when talking about Christian Vieri the footballer. He boasts a limited amount of team honours with just one Serie A title, two Coppas Italia and a UEFA Cup Winners’ Cup to his name, but make no mistake, he was deadly on his day. The late 1990s saw Vieri reach his peak, the former striker netting five goals for Italy at the 1998 World Cup. His form kicked on in the 1998/99 season as he played a key role in a memorable campaign for Lazio, who won the Suppercoppa Italiana and UEFA Cup Winners’ Cup. They also finished just a point behind Serie A winners AC Milan. That earned him a £32million move to Inter Milan in the summer of 1999, a record transfer fee at the time. His spell at Inter was very un-Vieri-like, though. He was at the San Siro for six years, but at the other 14 clubs in his playing career he was never around for longer than a year. But that’s Vieri in a nutshell. He was professional butterfly who did his career on his own terms. This mindset meant he was never going one to just stick to the football. In a parallel universe Vieri isn’t a football icon at all but actually one of the greatest batsmen of all time. When he was in red-hot form at France 1998, Vieri shocked journalists when he revealed his childhood hero was Allan Border… the Australian cricket legend. Vieri spent many of his early years growing up Down Under and naturally took up cricket, and by his account he was a very promising player . “It’s a bit strange that I grew up in Australia but when I was there it was normal – going to school, playing soccer, playing cricket, playing different sports. I was a big fan of cricket,” Vieri said. “Even if we were 13-14, we would go watch Australia play Test matches, ODI matches in Sydney. I’m a very big, big cricket fan. “I just love playing. I was probably playing more cricket than soccer at school. You know what we would do? The tennis ball, we would tape it up to make it go faster and swing. I think I would’ve been the best batsman in the world if I played cricket. I was an all-rounder. I was really good.” It’s not just the world of sport he’s dipped into. Vieri can call himself a movie star, having played Rocky Balboa’s Soviet enemy Ivan Drago in Italian comedy Picasso’s Face, a spoof film with a similar premise to Epic Movie or Scary Movie. While playing he even cracked the world of fashion, opening up a label with AC Milan icon Paolo Maldini in 2003 – this all happening while Vieri and Maldini were playing for rival Milan clubs. Sweet Years, which has been endorsed by a number of high profile sports stars including Diego Maradona and Rafael Nadal, has proved to be a successful project as it’s still going now. Since retiring in 2009, Vieri has moved into the punditry world but has also branched out into other business ventures. He’s the owner of Bombeer, an Italian premium lager beer which is mainly supplied to the US market. Christian Vieri – one of football’s great mavericks. We’ll drink to that! Bet365: Bet £10 Get £50 in Free Bets* – CLAIM HERE Betfred: Bet £10 Get £60 in Bonuses* – CLAIM HERE Bet365: Min deposit requirement. Free Bets are paid as Bet Credits and are available for use upon settlement of qualifying bets. Min odds, bet and payment method exclusions apply. Returns exclude Bet Credits stake. Time limits and T&Cs apply 18+ Begambleaware.org Betfred: New UK customers only. Register using the promo code BETFRED60, deposit and place first bet of £10+ on Sports (cumulative Evens+) within 7 days of registration. First bet must be on Sports. £20 in Free Bets to be used on Sports, £10 in Free Bets to be used on Lotto and 50 Free Spins (20p per spin) credited within 48 hours of bet settlement. Further £20 in Free Bets credited 5 days after settlement. Bonuses have a 7-day expiry. Payment restrictions apply. SMS verification and/or Proof of I.D and address may be required. Full T&Cs apply. 18+ Begambleaware.org","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Edhen Apple Tom: Kerala’s new pace-bowling sensation","link":"https://sportstar.thehindu.com/cricket/domestic/edhen-apple-tom-ranji-trophy-2021-22-kerala-new-pace-bowling-sensation-domestic-cricket/article38429323.ece","keywords":null,"creator":["P.K. Ajith Kumar"],"video_url":null,"description":"Edhen Apple Tom is the first bowler from the State to take a wicket with the first ball in first-class cricket.","content":null,"pubDate":"2022-02-18 17:55:48","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies 2nd T20I LIVE: Harshal Patel holds his nerve as IND win thriller at Eden - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmRpYS12cy13ZXN0LWluZGllcy1pbmQtdnMtd2ktMm5kLXQyMC1saXZlLXNjb3JlLW9ubGluZS11cGRhdGVzLTc3ODAwMjUv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs West Indies 2nd T20I LIVE: Harshal Patel holds his nerve as IND win thriller at Eden  The Indian ExpressIND vs WI: Watch: Indian Players Run After Venkatesh Iyer Hits A Boundary Towards The Dug Out  Cricket AddictorIndia vs West Indies 2nd T20I Highlights: India beat West Indies by 8 runs to take unassailable 2-0 lead  Times of IndiaMatch Preview - India vs West Indies, West Indies in India 2021/22, 2nd T20I  ESPNcricinfoTwitter Reactions: Impeccable death bowling helps India seal the series despite Rovman Powell and Nicholas Pooran’s brutal hitting  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-02-18 17:32:11","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs WI: Watch - Rohit Sharma Kicks The Ball Angrily After Bhuvneshwar Kumar Drops Rovman Powell Off His Own Bowling - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vY3JpY2tldC92aWRlb3Mvd2F0Y2gtcm9oaXQtc2hhcm1hLWtpY2tzLXRoZS1iYWxsLWFuZ3JpbHktYWZ0ZXItYmh1dm5lc2h3YXIta3VtYXItZHJvcHMtcm92bWFuLXBvd2VsbC1vZmYtaGlzLW93bi1ib3dsaW5nL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI: Watch - Rohit Sharma Kicks The Ball Angrily After Bhuvneshwar Kumar Drops Rovman Powell Off His Own Bowling  Cricket AddictorIndia vs West Indies 2nd T20I Highlights: India beat West Indies by 8 runs to take unassailable 2-0 lead  Times of IndiaRecent Match Report - India vs West Indies 2nd T20I 2021/22  ESPNcricinfoIND vs WI: Watch: Indian Players Run After Venkatesh Iyer Hits A Boundary Towards The Dug Out  Cricket AddictorKolkataT20: 'Wide kidhar de raha hai yaar’, an agitated Rohit Sharma at umpire’s decision; stump-mic catches conversation with Kohli  The Tribune IndiaView Full coverage on Google News","content":null,"pubDate":"2022-02-18 17:16:58","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies Live Score Ball by Ball, India vs West Indies 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-live-score-over-2nd-t20i-t20-16-20-updates-2776584","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs West Indies from Eden Gardens, Kolkata. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-18 17:03:46","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, West Indies, chasing a target of 187, are 178/3. The live updates of India vs West Indies scorecard is also available. It is the perfect platform to follow your favourite teams in India vs West Indies 2022. Keep a track on your favourite batsmen and bowlers through India vs West Indies 2022 today match, ball by ball commentary, India vs West Indies, India vs West Indies live score, India vs West Indies scorecard. Follow the excitement of the India vs West Indies 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. With Rovman Powell and Nicholas Pooran out there, hitting everything away. You feel it is an easy chase but sometimes you have to credit the opposition on how they played. The openers of West Indies fell after giving a good start but it was then the Powell-Pooran show. They put up a 100-run partnership and looked like it is going their way but India's last three overs were top notch. The pacers started well for India as there was swing but they didn't get any reward. The spinners then came into the action and got both the openers. The fielding kept India at the bay. Two catches were dropped and both went on to scoring half-centuries. Even the dew kicked in later in the innings and it needed something special from the bowler. They were still in the game with 29 runs to defend in the last two overs. Bhuvneshwar Kumar bowled a splendid penultimate over and then Harshal Patel followed him with an outstanding one. Good job overall and Rohit Sharma will be a happy man. Brilliant bowling from Harshal Patel, this game went till the very last over but Patel did very well, in the end, to defend 25 runs against Rovman Powell and Kieron Pollard. Meanwhile, Yuzvendra Chahal goes straight to Rovman Powell and checks his bat. You feel for him. He played so brilliantly but failed to take his team over the line. With this, India clinches the T20I series as well as they go 2-0 up. This is also Indias 100th win in T20I history. 19.6 overs (1 Run) Slower ball, full again and on middle. Kieron Pollard just taps it towards mid-wicket for a single. India win by 8 runs! 19.5 overs (1 Run) Harshal Patel does well under pressure! A slower one, outside off, very full. Rovman Powell pushes it towards long on for a single. Virat Kohli is celebrating and Rohit Sharma looks like a happy man now! 19.4 overs (6 Runs) SIX! Back-to-back sixes! And Harshal Patel is under immense pressure now! Another overpitched delivery, on middle. Rovman Powell has absolutely hammered that over deep mid-wicket for a big, big six! 11 off 2 balls now! 19.3 overs (6 Runs) SIX! BANG! Very full delivery, around middle. Rovman Powell smashes it over long on for a biggie! 17 runs needed off the last 3 balls. Can Rovman Powell hit 3 sixes in a row? 19.2 overs (1 Run) Another beautiful delivery! Slower one now, full in length, wide of off. Kieron Pollard pushes it towards long off for a single. 19.1 overs (1 Run) Harshal Patel begins the last over with a yorker-length delivery, around middle and leg. Rovman Powell gets an inside edge towards the left of the keeper. A single taken! 18.6 overs (1 Run) A yorker, on middle. Rovman Powell digs it out towards long on for a single. An excellent over from the experienced, Bhuvneshwar Kumar! Just 4 runs off the over. 25 runs needed off the last 6! 18.5 overs (1 Run) A shorter ball, around middle. Kieron Pollard pulls it towards deep mid-wicket for a single. 18.4 overs (1 Run) Fuller ball, on middle and off. Rovman Powell drills it to long off and rotates the strike. The skipper, Kieron Pollard himself walks out to complete the job. 28 needed in 9 balls. 18.3 overs (0 Run) OUT! CAUGHT! Ravi Bishnoi holds on to the catch this time! A good wicket for India at a crucial time. A fuller ball, outside off. Nicholas Pooran looks to go over cover, but the ball goes off the bottom of the bat high towards cover. Ravi Bishnoi there keeps his eyes on the ball and takes a sharp catch running backward. A good knock comes to an end! 18.2 overs (0 Run) Slower ball, fuller and outside off. Nicholas Pooran looks to drive this but misses. 18.1 overs (1 Run) Fuller ball, outside off. Rovman Powell drills it towards deep mid-wicket for a single. That brings up the 100 partnership between these two! 17.6 overs (4 Runs) FOUR! This has boundary has ruined a good over for India! A short-pitched delivery, on middle. Nicholas Pooran has pulled this towards deep square leg for a boundary. 29 runs more need off 12 balls! 17.5 overs (1 Run) An off-pace delivery, full in length, outside off. Rovman Powell pushes it towards deep mid-wicket. Ishan Kishan does well to collect the ball quickly and keep it to just a single. 17.4 overs (1 Run) Slower ball, short and outside off. Nicholas Pooran waits for it and cuts it towards deep point for a single. 17.3 overs (0 Run) Fuller ball, wide of off. Nicholas Pooran looks to drive this but misses. 17.2 overs (1 Run) FIFTY for Rovman Powell! A lethal innings so far! But his job is not done yet. A full toss, around middle. Rovman Powell drags it with the inner half of his bat towards deep mid-wicket for a single. Rovman Powell is not happy with that, he feels he missed out on the full toss ball. 17.1 overs (1 Run) Fuller ball, around middle. Nicholas Pooran drills it to long on and rotates the strike! 16.6 overs (1 Run) Fuller again, outside off. Nicholas Pooran drives it towards extra cover for a single. 16 runs off the over. West Indies need 37 runs off the last 3 overs now. 16.5 overs (6 Runs) SIX! Wonderful shot! Another match and another fifty for Nicholas Pooran! He brings up his consecutive fifty in some style! A fuller ball, on the leg stump. Nicholas Pooran shuffles across and whips it over deep mid-wicket for a biggie! 16.4 overs (1 Run) A yorker now, on middle. Rovman Powell digs it out towards long off. Single taken! 16.3 overs (6 Runs) SIX! WOW! This is a magnificent shot! Deepak Chahar drops it short again, around middle. Rovman Powell picks the length and muscles it way over deep mid-wicket for biggie. 16.2 overs (1 Run) Full again, wide of off. Nicholas Pooran looks to drive but gets an inside edge towards fine leg for a single. 16.1 overs (1 Run) Yorker-length delivery, around middle. Rovman Powell knocks it down to long off for a single. 15.6 overs (1 Run) Very full now, around middle. Rovman Powell drills it to long off for a single. 15.5 overs (2 Runs) DROPPED! Oh, dear! This is the last thing India needed! A shorter ball, outside off. Rovman Powell looks to pull but gets a top edge high towards the left of the bowler. Bhuvneshwar Kumar runs to the ball, and stands under it, but fails to grab the ball. Rohit Sharma across kicks the ball away in aggression. He just cannot believe it. Two taken. 15.5 overs (1 Run) Wide! Slower one, wide of off, full in length. Rovman Powell leaves it alone and wide is called! 15.4 overs (4 Runs) FOUR! CRUNCHED! Rovman Powell is hitting every shot with sheer power! Another length ball, outside off. Rovman Powell hammers it down the ground towards long off for a cracking boundary. 15.3 overs (1 Run) On a length outside off. Nicholas Pooran cuts it towards deep cover for a single. 15.2 overs (1 Run) Fraction shorter, outside off. Rovman Powell drags it from the inner half of his bat towards long on. Single taken! 15.1 overs (0 Run) Good-length delivery, wide of off. Rovman Powell throws his bat at it but fails to get any connection on that.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637808204164465739.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies Live Score Ball by Ball, India vs West Indies 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-live-score-over-2nd-t20i-t20-11-15-updates-2776520","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs West Indies from Eden Gardens, Kolkata. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-18 16:25:41","full_description":"Follow the India vs West Indies 2022 live cricket score on Sports.NDTV.com . After 15.2 overs, West Indies, chasing a target of 187, are 125/2. Get live score, ball by ball commentary and much more. Keep track of India vs West Indies 2022 today match between India and West Indies. Everything related to India and West Indies match will be available on Sports.NDTV.com . Stay updated with India vs West Indies live score. Do check for India vs West Indies scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (0 Run) Another googly, this time Pooran prods to defend but misses. 63 needed in 30 balls. 14.5 overs (4 Runs) FOUR! West Indies changing the gears now! Flatter, outside off, a googly as well. Pooran smacks it to deep cover for a boundary. 14.4 overs (1 Run) Short and on middle. Powell mistimes his pull over mid-wicket for a single. 14.3 overs (4 Runs) FOUR! Good shot! A flatter ball, on middle. Powell smashes it towards long on and it went into the fence like a bullet. 14.2 overs (1 Run) Fuller and outside off, driven to long off for a single. 14.1 overs (1 Run) A short ball, on middle. Powell on the back foot, looks to pull but is a touch late, it went high in the air and wide of long on where Kohli runs to his right and the ball falls just short of him. One. 13.6 overs (2 Runs) A length ball, outside off. Pooran pulls it to mid-wicket. It wasn't timed well and hence they get two runs. 13.5 overs (1 Run) On middle, pushed to long on for a single. Review! India have reviewed an LBW decision against Rovman Powell! The replay rolls in. There is a spike as the ball passes the ball, confirms UltraEdge. Rovman Powell survives and India lose a review here! 13.4 overs (4 Runs) NOT OUT! FOUR! A low dipping full toss, on middle. Powell looks to pull but misses and gets hit high on the pads. The ball races away to the third man fence. The ball was dipping so Patel wants to take it upstairs. UltraEdge shows it went off the back of the bat. Went off the bat so given as runs. 13.3 overs (1 Run) Leg bye! Length and on the pads. Pooran goes down to sweep but misses and gets hit on the pads. A leg bye as it rolls to short fine leg. 13.3 overs (1 Run) Wide! A full toss but down the leg side. Pooran misses his flick. 13.2 overs (1 Run) Length and on middle. Powell turns it to deep mid-wicket for a single. 13.1 overs (0 Run) A full ball, outside off, was the slower delivery. Powell swings across and misses. Harshal Patel comes back to bowl. He went for 13 runs in his first over! 12.6 overs (1 Run) Full and on off. Rovman heaves it to long on for a single to end the over. 12.5 overs (1 Run) Fuller, googly, and outside off. Pooran guides it to point for a single. 12.4 overs (1 Run) Short and outside off, cut away to deep point for one run. 12.3 overs (6 Runs) SIX! 100 up for West Indies! Tossed up, full and on off. Powell gets underneath and powers it over long off for a biggie. 12.2 overs (1 Run) Floated full and on off, drilled down to long off for a single. A direct hit at the bowler's end and Pooran thought of a single but eventually bailed out. 12.2 overs (2 Runs) Two wides! Full and way outside off. Powell leaves it. Pant fumbles to catch it and a single is taken. 12.1 overs (0 Run) Short and slanting on the pads, flicked to mid-wicket. 11.6 overs (1 Run) A full toss, outside off, dragged to long on for a single. 12 coming off it. 11.5 overs (6 Runs) SIX! Sheer power! Short of a length, on middle. Powell pulls it with some serious power, flat and to the deep mid-wicket fence. It hits straight on the cushion. Replay rolls in and the third umpire confirms the same. 11.4 overs (1 Run) Full and on the pads. Pooran whips it to deep square leg where the fielder makes a good stop. One run. 11.3 overs (0 Run) A huge appeal for LBW, the umpire is unmoved, might be pitching outside leg. A full ball, angling on the pads. Pooran misses his flick. Yes, pitching outside leg. 11.2 overs (0 Run) Fuller, slanting across, outside off. Pooran looks to drive but misses. 11.1 overs (4 Runs) FOUR! Cracked away! A length ball, on middle. Pooran pulls it hard and in the gap to square leg for a boundary. Deepak Chahar (2-0-12-0) comes back into the attack. 10.6 overs (1 Run) Fuller, googly and on off. Pooran leans and drives it to sweeper cover for a single. 10.5 overs (1 Run) Short, quicker and on middle. Powell pushes it to deep mid-wicket for a single. 10.4 overs (1 Run) Googly again, punched to deep cover for a single. 10.3 overs (2 Runs) Flatter and outside off. Pooran slaps it through covers for a couple of runs. 10.3 overs (1 Run) Wide! A short ball, way outside off, going with the angle. Pooran slashes and misses. 10.2 overs (0 Run) A googly, outside off. Pooran misses his cut. 10.1 overs (0 Run) A short ball, it skids through, on off. Pooran looks to pull but gets an inside edge onto the pads.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637808181309081295.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: Bihar's Sakibul Gani enters record books after hitting triple ton on debut - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L3JhbmppLXRyb3BoeS1yb3VuZC11cC0yMDIyLWJpaGFycy1zYWtpYnVsLWdhbmktZW50ZXJzLXJlY29yZC1ib29rcy1hZnRlci1oaXR0aW5nLXRyaXBsZS10b24tb24tZGVidXQtMTMwMTgxNNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ranji Trophy: Bihar's Sakibul Gani enters record books after hitting triple ton on debut  ESPNcricinfoRanji Highlights: Sakibul Gani's rare triple ton gives Bihar Day 2 honours | Cricbuzz.com - Cricbuzz  CricbuzzBihar's Sakibul Gani Creates World Record With Tripe Century On First-Class Debut | Cricket News  NDTV SportsWho is Sakibul Gani? All you need to know about the world record holder in first-class cricket  CricTrackerRanji Trophy: Bihar's Sakibul Gani creates world record on first-class debut with incredible triple-century  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-02-18 16:21:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies Live Score Ball by Ball, India vs West Indies 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-live-score-over-2nd-t20i-t20-6-10-updates-2776454","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs West Indies from Eden Gardens, Kolkata. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-18 16:15:41","full_description":"Follow the India vs West Indies 2022 live cricket score on Sports.NDTV.com . After 10.2 overs, West Indies, chasing a target of 187, are 74/2. Get live score, ball by ball commentary and much more. Keep track of India vs West Indies 2022 today match between India and West Indies. Everything related to India and West Indies match will be available on Sports.NDTV.com . Stay updated with India vs West Indies live score. Do check for India vs West Indies scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (0 Run) Fuller ball, slower through the air, around off. Rovman Powell leans and defends it out. 9.5 overs (4 Runs) FOUR! WOW! He has crunched that! Tossed it up, outside off, and full in length. Rovman Powell gets down on his knee and slaps this towards deep mid-wicket for a powerful boundary. 9.4 overs (1 Run) Quicker this time, around middle and leg. Nicholas Pooran tucks it towards deep mid-wicket for a single. 9.3 overs (6 Runs) SIX! HAMMERED! What a shot! A loppy ball, full and on middle. Nicholas Pooran gets down on his knee and sweeps it high over deep square leg for a biggie! 9.2 overs (1 Run) Flatter ball, around middle. Rovman Powell knocks it to long on for a single. 9.1 overs (1 Run) DROPPED! Oh, dear! Ravi Bishnoi has dropped Nicholas Pooran! Could prove to be costly. A shorter ball, on middle. Nicholas Pooran rocks back and pulls it to deep mid-wicket. Ravi Bishnoi runs to his left a bit and dives there to take the catch but fails to pouch it. One run taken! 8.6 overs (0 Run) Fuller again, on middle. Rovman Powell pushes it to the fielder at mid-wicket. A successful lover for Ravi Bishnoi! 8.5 overs (0 Run) Quicker, outside off. Rovman Powell defends it out. 8.4 overs (1 Run) Loopy ball, full and outside off. Nicholas Pooran knocks it down to long off for a single. Rovman Powell comes in. 8.3 overs (0 Run) OUT! CAUGHT Ravi Bishnoi strikes in his first over and he continues his good form from the previous game! West Indies lose their second wicket. Much slower this time, full and on middle. Brandon King steps down the pitch and looks to heave this over long on, but he does so with the inner half of his bat, no timing on that as well. The ball flies high towards long on. Suryakumar Yadav there runs forward and takes it. 8.2 overs (0 Run) Quicker one again, outside off this time. Brandon King looks to heave it over the leg side but misses. 8.1 overs (0 Run) Ravi Bishnoi begins with a flatter ball, firing it on middle. Brandon King looks to flick and misses. 7.6 overs (1 Run) A wrong'un now, on middle. Brandon King knocks it to long on for a single. 7.6 overs (1 Run) Wide! Loopy ball, full, spinning it away from outside off. Brandon King leaves it alone and a wide is given! 7.5 overs (1 Run) A leg spinner, around middle. Nicholas Pooran clips it towards square leg for a single. 7.4 overs (0 Run) Slower through the air, full and on middle. Nicholas Pooran blocks it out. 7.3 overs (1 Run) Flatter ball, quicker again, on the stumps. Brandon King works it away towards deep square leg for a single. 7.2 overs (0 Run) Tad quicker, fuller and a leg break now. Brandon King steps down and drives it to the fielder at cover. 7.1 overs (1 Run) Shotter ball, around middle and leg. Nicholas Pooran hangs back and pushes it towards mid-wicket for a single. 6.6 overs (1 Run) Shorter ball, around middle. Nicholas Pooran pulls it towards square leg for a single. He retains the strike! 6.5 overs (0 Run) Full again, on middle. Nicholas Pooran taps it to the fielder at mid-wicket. 6.4 overs (1 Run) fuller ball, on middle. Brandon King pushes it towards square leg for a single. 6.3 overs (1 Run) On a length, outside off. Nicholas Pooran taps it to cover and runs to the other end. Virat Kohli collects the ball and has shy at the bowler's end but misses. A direct hit could an issue there for Pooran! 6.2 overs (4 Runs) FOUR! Top shot! Another shorter one, outside off this time. Nicholas Pooran stands tall and slices this past point for a cracking boundary. 6.1 overs (6 Runs) SIX! BOOM! Nicholas Pooran takes him straigtaway! A shorter ball, on middle. Nicholas Pooran picks up the length ad pulls it over deep square leg for a biggie! Change. Harshal Patel to bowl now. Review time! Brandon King takes a review for caught behind. Interestingly, UltraEdge shows nothing as the ball crossed the bat and the on-field decision is overturned. There was a sound though. 5.6 overs (0 Run) NOT OUT! A shorter ball, quicker one, outside off. Brandon King stays in his crease and looks to cut this away but misses. But there seems to be some sound there. A huge appeal for caught behind and the umpire raises his finger. Brandon King opts for a review! The replays roll in and UltraEdge confirms no bat involved. A successful review for West Indies and Brandon King survives! West Indies are 41/1 at the end of the Powerplay! 5.5 overs (1 Run) Fuller and slower through the air, on middle. Nicholas Pooran works it away towards mid-wicket for a quick single. 5.4 overs (1 Run) A googly, full and on middle. Brandon King knocks it to long on for a single. 5.3 overs (1 Run) Shorter ball, around middle. Nicholas Pooran sweeps it towards deep mid-wicket for a single. 5.2 overs (4 Runs) FOUR! A boundary straightaway! A loopy ball, full and on middle. Nicholas Pooran looks to heave this away and gets a top edge towards fine leg for a boundary. Nicholas Pooran is the new man in. 5.1 overs (0 Run) OUT! CAUGHT AND BOWLED! Yuzvendra Chahal strikes and draws first blood. Kyle Mayers departs and West Indies lose their wicket. A quicker one this time, shorter and on middle and leg. Kyle Mayers stays in his crease and looks to tuck this on the leg side. But he is early on his shot and the ball goes off the outside edge high on the right of the bowler. Yuzvendra Chahal walks towards his right and takes one of the easiest catches ever!","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637808175315692547.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: Kerala tightens grip on Meghalaya","link":"https://sportstar.thehindu.com/cricket/domestic/ranji-trophy-2021-22-kerala-vs-meghalaya-p-rahul-domestic-cricket/article38429291.ece","keywords":null,"creator":["P.K. Ajith Kumar"],"video_url":null,"description":"Kerala is in firm control of its Ranji Trophy match against Meghalaya at the Saurashtra Cricket Ground.","content":null,"pubDate":"2022-02-18 16:04:30","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Edhen — Kerala’s new pace-bowling sensation","link":"https://www.thehindu.com/sport/edhen-keralas-new-pace-bowling-sensation/article65063379.ece","keywords":null,"creator":["\n        P. K. Ajith Kumar  \n    "],"video_url":null,"description":"First bowler from the State to take a wicket with the first ball in First Class cricket","content":null,"pubDate":"2022-02-18 15:39:37","full_description":"Edhen Apple Tom...what a start! | Photo Credit: Special Arrangement Edhen Apple Tom lived a dream on Thursday. He had visualised that he would take a wicket with his first ball on Ranji Trophy debut. He did that when he came on to bowl the 14th over for Kerala against Mizoram on the opening morning at the Saurashtra Cricket Association Ground (C). He had opener Kishan Lyngdoh caught at slip. He didn’t realise that he had just become the first Kerala bowler ever to achieve the feat of claiming a wicket with the first ball in First Class cricket. Remarkably, he did it at the age of 17. And he went on to take three more wickets to finish with figures of four for 41 from nine overs. “I didn’t know that I would be making my Ranji Trophy debut till the morning of the match,” Edhen told The Hindu . “I was very happy when I was included in the squad, after doing well in the Cooch Behar Under-19 tournament at Vadodara, where I was Kerala’s leading wicket-taker. But I didn’t imagine I would also be playing for the senior Kerala team this season itself.” He was picked in the team because coach Tinu Yohannan, himself a pacer, saw huge potential in him. “I was impressed when I first saw him at a camp,” he said. “He could surprise the batsmen, especially with his pace.” Edhen’s coach Sony Cheruvathur believes the future is bright for him. “He already has a good in-swinger, he is passionate and is a fast learner,” he said. “I could sense there was something special about him when he came to my academy in Dubai.” Edhen moved to Kerala three years ago, for the sake of his career. It has turned out to be a wise decision taken by his parents. Our code of editorial values Printable version | Feb 18, 2022 9:11:24 pm | https://www.thehindu.com/sport/edhen-keralas-new-pace-bowling-sensation/article65063379.ece © THG PUBLISHING PVT LTD.","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies Live Score Ball by Ball, India vs West Indies 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-live-score-over-2nd-t20i-t20-1-5-updates-2776385","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs West Indies from Eden Gardens, Kolkata. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-18 15:36:05","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.1 overs, West Indies, chasing a target of 187, are 34/1. The live updates of India vs West Indies scorecard is also available. It is the perfect platform to follow your favourite teams in India vs West Indies 2022. Keep a track on your favourite batsmen and bowlers through India vs West Indies 2022 today match, ball by ball commentary, India vs West Indies, India vs West Indies live score, India vs West Indies scorecard. Follow the excitement of the India vs West Indies 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (0 Run) Again goes for the pull but this time it is at 120 clicks and King misses his shot. 4.5 overs (0 Run) A length ball, on off, pulled straight to mid-wicket. 4.4 overs (0 Run) On middle, on a length. Blocked out. 4.3 overs (4 Runs) FOUR! In the air and safe! A length ball, on middle. King lifts it high in the air. Venkatesh Iyer at mid on thinks he has a chance as he tracks back but the ball went over him and for a boundary. 4.2 overs (1 Run) A yorker now, on off. Mayers hits it to covers for an easy single. 4.1 overs (1 Run) A fuller ball, knuckle ball, on off. King defends it with soft hands to point for a single. Deepak Chahar (1-0-6-0) comes back to bowl. Change of ends for him! 3.6 overs (1 Run) Sees King coming down the track and Chahal serves it on the slower side. He hits it to long off for a run. 3.5 overs (0 Run) A quicker now! Shorter and on off. King looks to pull but gets a bottom edge on his boot. 3.5 overs (1 Run) Wide! Short, slower and outside off, it stays low off the deck. King misses his cut. 3.4 overs (1 Run) On the pads again, an easy single as this is hit to deep mid-wicket. 3.3 overs (1 Run) Shorter, outside off. Brandon slaps it to long off for a single. 3.2 overs (1 Run) A googly, on the pads, this is flicked to deep mid-wicket for a single. 3.1 overs (1 Run) Flatter and on off. King punches it back to Chahal who half-stops and deflects it to covers. A single taken. Time for some spin! Yuzvendra Chahal comes into the attack. 2.6 overs (4 Runs) FOUR! Crushed! A full ball, width on offer and Mayers drives it hard through covers for a boundary. 2.5 overs (1 Run) A length ball, on off. King looks to work it on the leg side but gets an inside edge and it rolls to point for a single. 2.4 overs (0 Run) Length ball, outside off, slower one. King gets deceived as he misses his pull shot. 2.3 overs (2 Runs) Length ball, outside off. King punches off the back foot to sweeper cover for a brace. 2.2 overs (0 Run) BEATEN! On a length, outside off. King looks to defend on the back foot, but the late movement makes the ball whiz past the outside edge. 2.1 overs (1 Run) On a length, on middle. Kyle taps it late and to the gully region for a single. 1.6 overs (4 Runs) FOUR! First boundary off the blade! A length ball, outside off. King smashes it hard, past the bowler and it races away to the fence. 1.5 overs (1 Run) A full toss, angling on the pads, flicked uppishly and to deep mid-wicket for a single. 1.4 overs (0 Run) A length ball, angling outside off. Mayers hops and blocks it to covers. 1.3 overs (1 Run) On a length, outside off. King taps it to point for a single. 1.2 overs (0 Run) Short of a length, outside off. King looks to cut but misses. Swing again there. 1.1 overs (0 Run) Ohh! What a delivery! A length ball, it lands on off and swing away. King looks to go big, misses it completely. Deepak Chahar will bowl from the other end. 0.6 over (1 Run) A length ball, outside off, bit of away swing and this is punched to mid off for a single. 0.5 over (0 Run) Good delivery! It lands outside off and shapes away sharply, King has a poke at it and misses it. 0.4 over (1 Run) Leg bye! A length ball, angling on the pads. Kyle misses his flick and gets hit on the pads. A leg bye as it rolls to square leg. 0.4 over (5 Runs) FIVE WIDES! The ball movement takes it away! Full and swinging away from the batter, down the leg side. Mayers leaves it and the keeper cannot do much about it. 0.3 over (0 Run) A full ball, outswinger to the left-hander, on middle. Mayers blocks it off the front foot. 0.2 over (1 Run) Length ball, outside off. King punches it to deep point for a single. Harshal Patel with a little fumble but just a single taken. 0.1 over (0 Run) A length ball, outside off, shaping away. King shoulders arms to it.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637808151533335557.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies 2022, 2nd T20I Live Score Updates: West Indies Start Well In Chase Of 187, India Eye Wickets | Cricket News - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2luZGlhLXZzLXdlc3QtaW5kaWVzLTIwMjIvaW5kaWEtdnMtd2VzdC1pbmRpZXMtMjAyMi0ybmQtdDIwaS1pbmQtdnMtd2ktbGl2ZS1zY29yZS11cGRhdGVzLTI3NzU5MjHSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs West Indies 2022, 2nd T20I Live Score Updates: West Indies Start Well In Chase Of 187, India Eye Wickets | Cricket News  NDTV SportsRecent Match Report - India vs West Indies 2nd T20I 2021/22  ESPNcricinfoIndia vs West Indies 2nd T20I Live Score Updates: Rishabh Pant, Venkatesh Iyer power India to 186/5  Times of IndiaIndia vs West Indies Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- West Indies Tour of India, 2nd T20I  Cricket AddictorMatch Preview - India vs West Indies, West Indies in India 2021/22, 2nd T20I  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-02-18 15:27:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Najafgarh's new star Lalit Yadav thanks Ponting for improvement","link":"https://www.business-standard.com/article/sports/najafgarh-s-new-star-lalit-yadav-thanks-ponting-for-improvement-122021801144_1.html","keywords":null,"creator":null,"video_url":null,"description":"Delhi all-rounder Lalit Yadav believes he has a no-nonsense approach to his cricket. And why not? He is from Najafgarh which has gifted India one of its greatest match winners in Virender Sehwag. \"Viru paaji's house is in Najafgarh town and I live in the interiors in the Najafgarh village area,\" Lalit, who played a scintillating knock of 177 for Delhi against Tamil Nadu on second day of the Ranji Trophy, told PTI from Guwahati. So if you have witnessed those 10 towering sixes with Nos 10 and 11 for company, you know the inspiration. So how does it feel? \"It feels good, in fact great,\" the 25 year old, said in a booming voice. \"If you would have asked me at the start of the day whether I would be close to double hundred batting with Nos 9, 10 and 11. I wouldn't have believed it,\" he said, having added 48 for eighth wicket with Simarjit Singh, 92 for the ninth wicket with Vikas Mishra and 59 for the final wicket with Kuldeep Yadav. He reached both his 50 and hundred with a six but","content":null,"pubDate":"2022-02-18 15:10:00","full_description":"Delhi all-rounder Lalit Yadav believes he has a no-nonsense approach to his cricket. And why not? He is from Najafgarh which has gifted India one of its greatest match winners in Virender Sehwag. \"Viru paaji's house is in Najafgarh town and I live in the interiors in the Najafgarh village area,\" Lalit, who played a scintillating knock of 177 for Delhi against Tamil Nadu on second day of the Ranji Trophy, told PTI from Guwahati. So if you have witnessed those 10 towering sixes with Nos 10 and 11 for company, you know the inspiration. So how does it feel? \"It feels good, in fact great,\" the 25 year old, said in a booming voice. \"If you would have asked me at the start of the day whether I would be close to double hundred batting with Nos 9, 10 and 11. I wouldn't have believed it,\" he said, having added 48 for eighth wicket with Simarjit Singh, 92 for the ninth wicket with Vikas Mishra and 59 for the final wicket with Kuldeep Yadav. He reached both his 50 and hundred with a six but he always had the confidence that he could take on the bowlers. \"I never felt that I need to nudge and push to reach three figure mark or for that matter any milestone. What are the chances that the tail ender wouldn't be out?\" he counter questioned. \"I had to take chances and I did. When they spread the field, I had to back my abilities that I could clear the ground. I am happy that I could execute big shots properly,\" he said. Lalit will now be playing as an all-rounder for Delhi Capitals for the third successive season with the franchise buying him back at the auction. So how has it been learning the ropes from a legend like Ricky Ponting. \"I am thankful that I have got Ricky sir's guidance in last couple of seasons. I could feel my game has improved by leaps and bounds,\" said the product of Najafgarh's DFours Academy. Lalit's emergence into Delhi cricket circuit happened with a trial match between Delhi senior team and the U23 team. He smashed the senior team bowlers with such ferocity that he was fast tracked into Ranji Team after that knock. \"When I scored 210 in that game, never did it cross my mind that I was playing Delhi's Ranji bowlers. You can't let the stature of opposition get into your head,\" said Lalit, who believes that IPL experience changed his perspective more than the financial aspect of it. \"Obviously IPL changes your outlook as a cricketer. It's not about money but you start thinking that if I have reached this level, then there is no looking back. You have to improve and get better every day,\" he said. So is he batter who bowls part time off breaks? \"No I am a pure batter who is also a pure bowler. In one word, a pure all rounder,\" he signed off in a baritone voice. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220218/thumb-122021801144.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies: India vs West Indies 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-live-score-over-2nd-t20i-t20-16-20-updates-2776277","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs West Indies from Eden Gardens, Kolkata. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-18 14:55:58","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, India are 186/5. The live updates of India vs West Indies scorecard is also available. It is the perfect platform to follow your favourite teams in India vs West Indies 2022. Keep a track on your favourite batsmen and bowlers through India vs West Indies 2022 today match, ball by ball commentary, India vs West Indies, India vs West Indies live score, India vs West Indies scorecard. Follow the excitement of the India vs West Indies 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. West Indies will be a tad disappointed. They started off well but leaked 77 runs in the last six overs and let India get away with it. Other than, Roston Chase no other bowler found their mojo in the middle. West Indies need 186 runs and they have enough firepower in their batting to chase this down. Also, with the dew coming in, We India would be mighty pleased after being asked to bat first they have done an exceptional job to post a target of 187. After the openers fell cheaply it was Virat Kohli who came in and displayed his aggression straightaway but he perished soon after an exquisite half-century. He needed some runs and stood up on the right occasion. But it was the partnership of Pant and Venkatesh Iyer who put together 76 runs and guided India to a healthy total. The batters have done well and now it's up to the Indian bowlers to defend this and seal the series. An outstanding display of batting by the hosts! They did lose wickets, but the runs always kept coming in for them! West Indies would be disappointed a bit, they leaked many runs at the backend, and the partnership between Rishabh Pant and Venkatesh Iyer was the one that hurt the visitors the most. They face a tough challenge ahead, but the Men in Maroon have a brutal batting line-up who could chase this down. 19.6 overs (1 Run) A good final over from Romario Shepherd! A full toss, outside off. Pant only manages an inside edge towards fine leg for a single. India end at 186/5 19.5 overs (2 Runs) Fifty for Rishabh Pant! What a knock this is! Giving India much needed finish! A length ball, way outside off. Pant tries to chase it and chops it to long off for a couple of runs. 19.4 overs (1 Run) Just a single! Another yorker, on middle, Patel works it to mid-wicket. Harshal Patel walks out to bat now. 19.3 overs (0 Run) OUT! TIMBER! Venkatesh Iyer's cameo comes to an end. A super yorker from Shepherd, around off. Iyer fails to dig it out and the ball sneaks through to hit the stumps. Turning out to be a good final over so far. Can Romario Shepherd finish it well? 19.3 overs (1 Run) Wide! Full ball again, way outside off. Left alone. 19.2 overs (1 Run) Full and way outside off. Pant chases and hits it to deep cover for a single. 19.1 overs (1 Run) Fuller and on off, driven to long off for a run. 18.6 overs (1 Run) On the pads, flicked to deep square leg for a single. 18.6 overs (1 Run) Wide! Too many extras from the Windies! Full ball, again down the leg side. Iyer misses his flick. Pant wants a quick bye but is sent back from halfway mark. Pooran throws to the bowler but the ball hits Pant in its way and the run out chance goes away. Pant didn't change his line though. 18.5 overs (1 Run) Bye! A full ball, way down the leg side. Pant attempts the reverse hit but misses. Iyer calls for a quick bye and they make it with ease. Pooran misses his shy at his end. 18.4 overs (4 Runs) FOUR! Good shot! A full ball, drifting on the pads. Pant gets low and sweeps it, did not middle but just helped it wide of short fine leg for a boundary. 18.3 overs (1 Run) Full ball, on off. Iyer works it to long on for a single. 18.2 overs (1 Run) A yorker, on middle. Pant squeezes it out, it rolls on the deck but both run across to take a quick single. 18.1 overs (6 Runs) SIX! What a start to the over! A full toss, on off. Pant whacks it, more of the helicopter shot, over cow corner for a biggie. His one hand came off but that is the power of Pant. 17.6 overs (0 Run) Length and on off. Venkatesh Iyer miscues his shot back to Shepherd. 12 coming off the over. 17.5 overs (4 Runs) FOUR! In the gap! This partnership continues to hurt West Indies! Full ball way outside off. Iyer skips down and slashes it to covers for a boundary. 17.4 overs (1 Run) Very full and on off, Pant knocks it to covers for a single. 17.4 overs (1 Run) WIDE! Full ball but way outside off. Wided. 17.3 overs (2 Runs) Length and on middle. Pant flicks it to deep square leg where the fielder runs to his right and saves a couple of runs. 17.2 overs (3 Runs) A length ball, on off. Iyer shuffles and smashes it straight down the ground. Pollard at long off comes across and flicks it just wide of the adjacent fielder. Three runs taken easily. 17.1 overs (1 Run) On middle, this is hit to long on for one run. 16.6 overs (1 Run) Full and on off, punched to long off for a single. Romario Shepherd comes back to bowl. He went for 15 runs in his first over! 16.6 overs (2 Runs) TWO WIDES! Full and straying down the leg side. Good stop from the keeper as he dives way to his right. Quick single taken. 16.5 overs (6 Runs) SIX! Powered! A short ball, on middle. Iyer stands tall and pulls it off the middle and over square leg for a biggie. 16.4 overs (1 Run) Low full toss, on the pads. Pant hits it to deep square leg for a single. 16.3 overs (1 Run) Leg bye! Length ball, angling on the pads. Iyer misses his heave and gets hit on the pads. It lobs to the left of pitch and a leg bye is taken. 16.2 overs (0 Run) A yorker, on off. Iyer digs it out back to Holder. Good delivery. 16.1 overs (2 Runs) A fuller ball, on middle. Iyer flicks it wide of long on and takes a couple of runs. 15.6 overs (4 Runs) FOUR! Top shot! This is angling on the pads. Pant whips it off his pads and to the square leg fence. 15 coming off it. 15.5 overs (1 Run) Length and on middle, whacked to deep square leg for a single. 15.4 overs (4 Runs) FOUR! Valiant effort! That is the only thing, Venkatesh Iyer knows, to go big! A slower short ball, on middle. Iyer pulls it towards deep square leg where Brandon King runs to his left, dives but to no avail. 15.3 overs (4 Runs) FOUR! Freebie! A full ball, down the leg side. Iyer whacks it to fine leg for a boundary. 15.2 overs (1 Run) A length ball, angling on off. Pant pushes it to mid on for a single. 15.1 overs (1 Run) On the pads, this is flicked to deep mid-wicket for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637808127449718165.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies 2nd T20I Live Score: Rishabh Pant, Venkatesh Iyer In Fine Form As India Eye Big Total - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2luZGlhLXZzLXdlc3QtaW5kaWVzLTIwMjIvaW5kaWEtdnMtd2VzdC1pbmRpZXMtMjAyMi0ybmQtdDIwaS1pbmQtdnMtd2ktbGl2ZS1zY29yZS11cGRhdGVzLTI3NzU5MjHSAX9odHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy13ZXN0LWluZGllcy0yMDIyL2luZGlhLXZzLXdlc3QtaW5kaWVzLTIwMjItMm5kLXQyMGktaW5kLXZzLXdpLWxpdmUtc2NvcmUtdXBkYXRlcy0yNzc1OTIxL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs West Indies 2nd T20I Live Score: Rishabh Pant, Venkatesh Iyer In Fine Form As India Eye Big Total  NDTVSports.comRecent Match Report - India vs West Indies 2nd T20I 2021/22  ESPNcricinfoIndia vs West Indies Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- West Indies Tour of India, 2nd T20I  Cricket AddictorIndia vs West Indies 2nd T20I Live Score Updates: Roston Chase removes set Virat Kohli as India stutter  Times of IndiaMatch Preview - India vs West Indies, West Indies in India 2021/22, 2nd T20I  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-02-18 14:49:24","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies: India vs West Indies 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-live-score-over-2nd-t20i-t20-11-15-updates-2776223","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs West Indies from Eden Gardens, Kolkata. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-18 14:46:57","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.2 overs, India are 126/4. The live updates of India vs West Indies scorecard is also available. It is the perfect platform to follow your favourite teams in India vs West Indies 2022. Keep a track on your favourite batsmen and bowlers through India vs West Indies 2022 today match, ball by ball commentary, India vs West Indies, India vs West Indies live score, India vs West Indies scorecard. Follow the excitement of the India vs West Indies 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (4 Runs) Four! 14.5 overs (4 Runs) Four! Pollard doing Pollard things. Just at the time of releasing the ball, he stops and has a view at the batter. 14.4 overs (0 Run) No run. 14.3 overs (1 Run) Slower ball, on length, around off. Venkatesh Iyer works it away towards wide of long on for a single. 14.2 overs (1 Run) Another shorter ball, around middle. Rishabh Pant pulls it towards deep square leg for a single. 14.1 overs (4 Runs) FOUR! Shot! A shorter ball, around middle. Rishabh Pant pulls it over short fine leg for a boundary. Change. Kieron Pollard to bowl now. 13.6 overs (0 Run) Shorter ball, on the stumps. Venkatesh Iyer blocks it out. End of a fine spell by Roston Chase 13.5 overs (4 Runs) FOUR! EDGY! A fuller ball, outside off. Venkatesh Iyer looks to drive but gets an inside edge towards fine leg for a boundary. Venkatesh Iyer makes his way out. 13.4 overs (0 Run) OUT! CLELAND HIM UP! What a spell this is turning out to be for Roston Chase! He gets another wicket and gets the big one of Virat Kohli. A beauty to dismiss him! A fuller one, turning it on middle. Virat Kohli looks to flick this away but gets beaten as the ball turns in, and it goes on to knock the stump over. India are now 4 down! 13.3 overs (0 Run) Flatter, quicker, outside off. Virat Kohli looks to cut but misses. He is livid with himself. 13.3 overs (1 Run) Wide! Firing it down the leg side, shorter ball. Virat Kohli misses his flick and wide called. 13.2 overs (6 Runs) SIX! BANG! 50 up in style and some luck! A loopy ball, fuller and on middle. Virat Kohli makes room and tonks it towards long on. Jason Holder one of the tallest men there, stretches, he gets to the ball but fails to grab it and the ball lands over the ropes for a biggie! 13.1 overs (1 Run) Quicker one, around middle. Rishabh Pant tucks it towards square leg for single. 12.6 overs (0 Run) Beaten! Shorter ball, around outside off. Virat Kohli looks to cut it away but misses. 12.5 overs (0 Run) Length, outside off. Virat Kohli pushes it towards cover-point. 12.5 overs (1 Run) Wide! Full in length, down the leg side. Virat Kohli misses his tuck and wide is given! 12.4 overs (1 Run) Shorter ball now, around middle. Rishabh Pant pulls it wide of long on for a single. 12.3 overs (1 Run) Length ball, around middle and leg. Virat Kohli clips it towards square leg and rotates the strike! 12.3 overs (1 Run) Wide! Fuller, spraying it down the leg side. Virat Kohli looks to flick but misses. 12.2 overs (4 Runs) FOUR! Top shot! Short ball, angling it on middle. Virat Kohli leans back, opens the face of the bat, and guides it towards third man for a boundary. 12.1 overs (2 Runs) Shorter now, around middle Virat Kohli works it away towards square leg for a brace. 11.6 overs (0 Run) Fuller, outside off. Rishabh Pant pushes it towards point. Dot to end the over! 11.5 overs (1 Run) Leg bye! Quick again, turning it in on middle. Virat Kohli misses his flick and the ball deflects off his pads goes towards third man. A leg bye taken! 11.4 overs (0 Run) Shorter and quicker, around middle and leg. Virat Kohli tucks it to the fielder at short fine leg. 11.3 overs (1 Run) SLower through the air, around off and fuller. Rishabh Pant leans and taps it towards over for a quick single. 11.2 overs (1 Run) Fuller ball, around middle and leg. Virat Kohli clips it towards short fine leg for a single. 11.1 overs (0 Run) Fuller ball, around middle. Virat Kohli gets an inside edge onto his pads. No run there! 10.6 overs (2 Runs) Shorter ball, around middle. Rishabh Pant pulls it towards deep square leg for a brace. 10.5 overs (4 Runs) FOUR! HAMMERED! A low full toss, around off. Rishabh Pant whips it towards the cow corner region for a boundary. 10.4 overs (1 Run) Slower and shorter outside off. Virat Kohli looks to pull but gets an inside edge on his boot. The ball goes towards point and the batters cross ends. 10.3 overs (1 Run) LEG BYE! A good-length delivery, around middle. Rishabh Pant looks to flick but misses. The ball deflects off his pads goes towards short third man. The batters steal a leg bye! 10.2 overs (0 Run) Shorter ball, around middle and off. Rishabh Pant has no room there and he just taps it towards point. Dot ball! 10.1 overs (1 Run) On a length, darting it on the pads. Virat Kohli knocks it to long on for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637808122028311867.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies Live Score Ball by Ball, India vs West Indies 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-live-score-over-2nd-t20i-t20-6-10-updates-2776163","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs West Indies from Eden Gardens, Kolkata. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-18 14:11:55","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, India are 77/3. The live updates of India vs West Indies scorecard is also available. It is the perfect platform to follow your favourite teams in India vs West Indies 2022. Keep a track on your favourite batsmen and bowlers through India vs West Indies 2022 today match, ball by ball commentary, India vs West Indies, India vs West Indies live score, India vs West Indies scorecard. Follow the excitement of the India vs West Indies 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (4 Runs) FOUR! Pant starts with a boundary! Short ball, outside off. Pant waits and cuts it through point to get off the mark. DRINKS! Roston Chase once again is doing a fine job and providing West Indies with important breakthroughs! India are scoring at a brisk rate, but they have lost big wickets in return as well. A good thing is Virat Kohli is still at the crease and he is looking in good form! Rishabh Pant walks out to join him. 9.5 overs (0 Run) OUT! CAUGHT AND BOWLED! Chase with another wicket and this time he gets the big wicket of Yadav. This is tossed up, full and on off. Yadav is early into his shot as he drives it uppishly and straight back to Chase who has to dive forward to take the low catch. It was dying but Chase did really well to get his fingers under it. It is taken upstairs just to confirm and the third umpire has no issue with it. Is that a clean catch? The umpires check if Roston Chase has taken a clean catch. The soft signal is OUT. The replays roll in. It is indeed a clean catch and Suryakumar Yadav walks back! 9.4 overs (1 Run) Flatter and on off. Kohli dabs it to short third man for one. 9.3 overs (0 Run) Fuller ball, on off. Kohli drives it hard but straight to the fielder at covers. 9.2 overs (1 Run) Full and on middle. Yadav turns it to deep square leg for a single. 9.1 overs (1 Run) Tossed up, on middle, eased down to long on for a single. 8.6 overs (2 Runs) West Indies fielding is very below-par till now! Fuller and outside off, Yadav drives it to covers where Kyle Mayers fails to stop it and two runs are taken. They need to put in more effort. 8.5 overs (1 Run) An arm ball, on middle, drilled down to wide of long on for a single. 8.4 overs (1 Run) A slider, on the pads. Yadav wrists it to mid-wicket for one more. 8.3 overs (0 Run) Short and on middle, punched off the back foot to point. 8.2 overs (4 Runs) FOUR! Makes it looks so easy! Tossed up, full and outside off. Yadav opens the bat face and drives it through point for a boundary. Roston Chase dives inside the ring but to no avail. 8.1 overs (1 Run) On the pads, this is flicked to square leg for one more. 7.6 overs (1 Run) Short and on off. Kohli punches it to long on for a single. Suryakumar Yadav comes to bat at number 4. 7.5 overs (0 Run) OUT! TAKEN! Roston Chase gets Rohit Sharma yet again! Tosses it up, full and on middle. Sharma clears his front leg and looks to heave but gets a top edge, in the air and towards cover. Brandon King there, runs to his right and takes an easy catch. So, the drop catch hasn't proved much costly and Brandon King will be very relieved. 7.4 overs (1 Run) A single as this is hit to deep square leg. 7.3 overs (0 Run) Short and outside off. Kohli mistimes his pull to the right of the bowler. Rohit Sharma tries to evade it but gets hit on the body. 7.2 overs (1 Run) Tossed up, on off. Sharma nudges it to deep mid-wicket for one run. 7.1 overs (1 Run) Loopy ball, full and on middle, whipped to deep square leg for a single. 6.6 overs (0 Run) Short ball, outside off, turns away as well. Sharma looks to cut but misses. Nicholas Pooran is the only one interested to appeal for it. 6.5 overs (1 Run) Short and outside off. Virat cuts it through point for one more. 6.4 overs (1 Run) An arm ball, on middle, tucked to mid-wicket for a single. 6.3 overs (1 Run) Outside off, this is worked to deep point for a single. 6.2 overs (0 Run) Flatter and on off. Kohli guides it to point. 6.1 overs (4 Runs) FOUR! Misfield! Short and outside off. Kohli gets on the back foot and smacks it to covers where it goes through the hands of the fielder and into the fence. Akeal Hosein is frustrated. Akeal Hosein (2-0-14-0) comes back to bowl. 5.6 overs (6 Runs) SIX! In the air and goes over for a biggie! This is on a length and outside off. Sharma looks to go over mid off but is a touch early and it takes the outer portion of the bat, in the air and over covers for a biggie. End of the Powerplay, India are 49 for 1 at the end of it. 5.5 overs (1 Run) Full ball, shaping away, outside off, pushed to mid off for a quick single. 5.4 overs (0 Run) Length and on off, this is hit to point. 5.3 overs (4 Runs) FOUR! Add another boundary to the total as Kohli looks in some form here! Short in length, outside off. Kohli waits and slaps it through covers, nicely in the gap and into the fence. 5.2 overs (4 Runs) FOUR! Dealing in boundaries! A full ball, outside off. Kohli lifts it nicely over mid on for a boundary. 5.1 overs (0 Run) This is full and outside off, with a fair amount of away swing. Kohli makes room and looks to slash at it but misses.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637808101057939490.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}