{"newsArray":[{"title":"Dubai International Cricket Stadium pitch report: DC vs ADKR pitch report today match DPW ILT20 2023","link":"https://thesportsrush.com/cricket-news-dubai-international-cricket-stadium-pitch-report-dc-vs-adkr-pitch-report-today-match-dpw-ilt20-2023/","keywords":["Cricket","Abu Dhabi Knight Riders","Dubai Capitals","Dubai International Stadium","ILT20 League 2023"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"UAE has been one of the most prominent cricketing venues in recent times, and it is now set to host the brand new International League T20. Dubai Capitals and Abu Dhabi Knight Riders will face each other in the first match of the tournament at the Dubai International Stadium. Dubai Capitals will be led by… The post Dubai International Cricket Stadium pitch report: DC vs ADKR pitch report today match DPW ILT20 2023 appeared first on The SportsRush.","content":"UAE has been one of the most prominent cricketing venues in recent times, and it is now set to host the brand new International League T20. Dubai Capitals and Abu Dhabi Knight Riders will face each other in the first match of the tournament at the Dubai International Stadium. Dubai Capitals will be led by Rovman Powell, and they also have Indian veterans Robin Uthappa and Robin Uthappa in their ranks. The all-round department looks strong with the likes of Fabian Allen, Sikandar Raza, Ravi Bopara, etc. They would want to start the tournament on a winning note. Abu Dhabi Knight Riders have retained their KKR core in Andre Russell and Sunil Narine, where Narine is the captain of the side. They have some prominent names like Paul Stirling and Colin Ingtam in batting, whereas the bowling unit looks lethal as well. Dubai International Cricket Stadium pitch report Dubai International Cricket Stadium has hosted a plethora of T20 matches in the past, and this track has always been a great track for a T20 match. This is a ground where both batters and bowlers have enjoyed playing due to its competitive nature. This is a brilliant track to bat on, and the batters will love their time out there in the middle. There are no visible demons, and a high-scoring match is expected here. In the last Asia Cup 2022, a total of 9 T20Is were played here, and the average 1st innings score was 165 runs. The highlighting point of Dubai is that the chasing teams have always done great at this venue. Out of 9 matches, six matches were won by the chasing teams in Asia Cup 2022. The dew will play a massive part in this tournament as well, and the captains would want to chase upon winning the toss. The straighter boundaries are very small at this ground, and this will excite the batters for sure. However, the square boundaries are on the larger side, and the spinners will come into play as the matches will go on. The post Dubai International Cricket Stadium pitch report: DC vs ADKR pitch report today match DPW ILT20 2023 appeared first on The SportsRush.","pubDate":"2023-01-13 08:57:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Virender Sehwag tipped David Warner to be a better Test than T20 batter during IPL 2009 for Delhi Daredevils","link":"https://thesportsrush.com/cricket-news-virender-sehwag-tipped-david-warner-to-be-a-better-test-than-t20-batter-during-ipl-2009-for-delhi-daredevils/","keywords":["Cricket","David Warner","Delhi Daredevils","ipl 2009","Virender Sehwag"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Delhi Capitals (earlier Delhi Daredevils) have not won an IPL title yet, but they have certainly impressed everyone in some seasons of the tournament. In 2009, the tournament shifted to South Africa, and Delhi had a great team that season. Delhi topped the league stage with 10 wins in 14 matches, but they failed to… The post Virender Sehwag tipped David Warner to be a better Test than T20 batter during IPL 2009 for Delhi Daredevils appeared first on The SportsRush.","content":"Delhi Capitals (earlier Delhi Daredevils) have not won an IPL title yet, but they have certainly impressed everyone in some seasons of the tournament. In 2009, the tournament shifted to South Africa, and Delhi had a great team that season. Delhi topped the league stage with 10 wins in 14 matches, but they failed to reach the final of the tournament. The batting unit consisted of players like Virender Sehwag, David Warner, Gautam Gambhir, AB de Villiers, Tillakaratne Dilshan, etc. These are a few of the best T20 batters. It is interesting to note that Warner is the only player amongst the lot who is still going strong, and he is with the Delhi franchise only. In the absence of Rishabh Pant, he is even tipped to lead the side in IPL 2023. Virender Sehwag tipped David Warner to be a better Test batter David Warner gave an interview to Fox Sports, where the recalled how Virender Sehwag spotted his test calibre way earlier than others. Warner said that Sehwag watched him bat during the IPL 2009 season and said that he will be a better player in tests as compared to T20s. Sehwag said Warner that he will get a lot of opportunities to score runs in test cricket as the fielders will be inside the ring, and he will be able to score boundaries without any kind of pressure. Today after almost 14 years, it is safe to say that Warner has done exceedingly well in the test format. “When I went to Delhi, Sehwag watched me a couple of times and said to me, ‘you’ll be a better Test cricketer than what you will be a T20 player’,” Warner told FoxSports.com.au. “I basically looked at him and said, ‘mate, I haven’t even played a first-class game yet’. But he said, ‘all the fielders are around the bat, if the ball is there in your zone you’re still going to hit it.” Warner recently played his 100th test against South Africa, and he scored a double century in that match. He is one of those rare players who is not a liability in any format of the game and has flourished everywhere. The post Virender Sehwag tipped David Warner to be a better Test than T20 batter during IPL 2009 for Delhi Daredevils appeared first on The SportsRush.","pubDate":"2023-01-13 07:05:42","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"News24.com | WATCH | Second fan in SA20 million pot after stunning catch at St George's Park","link":"https://www.news24.com/sport/Cricket/SA20/watch-second-fan-in-sa20-million-pot-after-stunning-catch-at-st-georges-park-20230113","keywords":null,"creator":null,"video_url":null,"description":"A second SA20 cricket fan joined the Catch a Million pot during Thursday's match between the Sunrisers Eastern Cape and Pretoria Capitals at St George's Park.","content":null,"pubDate":"2023-01-13 07:01:41","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Dhruv hits ton, GTC win","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/dhruv-hits-ton-gtc-win-632964","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Assam Premier Club Championship Cricket match held at the Judges Field on 12th January.","content":"Sports Reporter GUWAHATI: Rode on a nice century from Dhruv Raaj Borah (110) Gauhati Town Club (GTC) thrashed Royal Club by 102 runs in a Assam Premier Club Championship Cricket match held at the Judges Field on 12th January, Brief scores: Gauhati Town club 270-5 (40 overs), Dhruv Raaj Borah 110, Abhishek Gupta 51no, Pradyun Saikia (46), Amit Boro 2-36, Royal Club 168-7 (40 overs), Varun Jajodia 33, Bishal Roy 30, Avinav Choudhury 3-14, Nayanjyoti Deka 3-26.Also Read: All-round India down Sri Lanka to take series leadAlso Watch: ","pubDate":"2023-01-13 06:36:38","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/13/430010-cricket-1642491052.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: Mumbai push Assam to verge of defeat","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/mumbai-push-assam-to-verge-of-defeat-632952","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Assam were on the verge of defeat in the Elite 'B' Ranji Trophy tie against Mumbai.","content":"Sports Reporter GUWAHATI: Assam were on the verge of defeat in the Elite 'B' Ranji Trophy tie against Mumbai. In reply to visitors' first innings total 687-4 declared, Assam bowled out 370 in the first innings and were forced to follow on at the Amingaon Cricket Ground here today. In the second innings the hosts were struggling and were 36-5 at stumps. Assam put a good score in the first innings even though their middle order fumbled against the quality bowling attack of Mumbai. First wicket partnership between Subham Mondal and Rahul Hazarika (79) produced 79 runs and on the second wicket Rahul and Rishav Das (75) added 88 runs. Thereafter Assam lost a couple of wickets quickly that put the host on the back foot but again captain Gokul Sharma (70) and Abhishek Thakuri (51) produced a nice partnership on the seventh wicket which produced 80 runs. Shams Mulani, 4-111, was the wrecker-in-chief for Mumbai in the first innings and he got good support from Shardul Thakur (2-68), Mohit Avasthi (2-60) and Tanush Kotian (2-56). In the second innings there was hardly any resistance from the batters of Assam. Opener Subham Mandal returned when the score was zero and thereafter the home team quickly reduced to 17-5. Gokul Sharma (7no) and Swarupam Purkayastha (12 no) stopped further damage on the day. All the batters-Rahul Hazarika (6), Rishav Das (4), Riyan Parag (6) and Abhishek Thakuri (1) along with Subham (0)-who got out today failed to reach double figure score. Shardul Thakur bagged 3-12 and his opening spell partner Mohit Avasthi finished the day 2-19.Also Read: Chirag-Satwik pair and Prannoy reach quarterfinalsAlso Watch: ","pubDate":"2023-01-13 05:54:10","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/13/429989-cricket-1642491052.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"\"विराट, तुम्हें धोनी का सम्मान.....\", जब कोहली चाहते थे एमएस की कप्तानी, तब रवि शास्त्री ने कहा था कुछ ऐसा","link":"https://sports.ndtv.com/hindi/cricket/virat-you-respect-dhoni-when-kohli-wanted-dhonis-white-ball-captaincy-then-ravi-shastri-said-something-like-this-3688181#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"टी20 विश्व कप 2021 में भारत की हार के बाद विराट ने भारतीय टी20 टीम की कप्तानी छोड़ दी थी. वनडे की कप्तानी उनसे छीन ली गई, जिसके बाद 15 जनवरी 2022 को साउथ अफ्रीका दौरे के बाद विराट ने भारत की टेस्ट कप्तानी छोड़ दी.","content":"भारतीय क्रिकेट टीम (Indian Cricket Team) में कप्तानी का परिवर्तन हमेशा सहज नहीं होता है. यह काफी कठिन हो जाता है, जब आपके पास एक अनुभवी कप्तान होने के साथ साथ एक मजबूत उम्मीदवार भी होता है. इसका एक उदाहरण तो अभी देखने को मिल रहा है. देखा जाए तो बीसीसीआई की तरफ से इस बात पर कोई स्पष्टता नहीं है कि हार्दिक पंड्या भारत की टी-20 टीम की कप्तानी संभालेंगे या रोहित ही बने रहेंगे.  हालांकि हार्दिक ने खुद ऐसे बयान दिए हैं जो इसकी ओर इशारा कर रहे हैं कि टी20 में वे ही टीम इंडिया की बागडोर संभालेंगे.  दूसरी ओर, तीनों फॉर्मेट के कप्तान रोहित शर्मा ने बयान दिया है कि उन्होंने अपने टी20 भविष्य पर अभी फैसला नहीं किया है. ऐसे में फिलहाल तो कुछ भी साफ नज़र नहीं आ रहा है. जब कप्तानी को लेकर विराट थे उत्सुकलेकिन आपको बता दें कि साल 2014-15 के समय जब धोनी ने टेस्ट कप्तानी छोड़ी तब विराट कप्तान (Virat Kohli Captaincy) बने, जिसके बाद वे धोनी के नेतृत्व वाली सीमित ओवरों की भारतीय टीम की कप्तानी करने को लेकर आतुर थे. ऐसी स्थिति से टीम में दो मत बन सकते थे, लेकिन कोच रवि शास्त्री (Ravi Shastri On Virat Kohli Captaincy) ने कोहली का मार्गदर्शन करते हुए स्थिति को समझदारी से संभाल लिया. इस बात का खुलासा उस समय भारतीय टीम के फील्डिंग कोच रहे आर श्रीधर ने क्रिकेट राइटर आर कौशिक के साथ मिलकर लिखी अपनी नई किताब 'कोचिंग बियॉन्ड- माई डेज विद द इंडियन क्रिकेट टीम' में किया है.जब रवि शास्त्री ने फोन कर विराट को दी थी सलाहआर श्रीधर (R. Sridhar) ने इस बात की ओर ध्यान खिंचवाया है कि \"कैसे टेस्ट टीम का कप्तान बन जाने के बाद भी कोहली व्हाइट बॉल क्रिकेट का कप्तान बनने के लिए उत्सुक थे. पूर्व फिल्डिंग कोच ने लिखा कि “साल 2016 में एक समय था जब विराट सफेद गेंद वाली टीम का भी कप्तान बनने के लिए  उत्सुक थे. उन्होंने कुछ ऐसी बातें कही जिससे पता चलता है कि वह कप्तानी की तलाश कर रहे थे.\" लेकिन शास्त्री ने इसमें हस्तक्षेप किया और कोहली को सलाह दी कि वह धोनी के खुद व्हाइट बॉल क्रिकेट की कमान सौंपने का इंतजार करें. \"एक शाम, रवि ने विराट को फोन किया और कहा, 'देखो, विराट, एमएस ने तुम्हें रेड-बॉल की कप्तानी दी है ना, आपको उनका सम्मान करना होगा. वह आपको सीमित ओवरों के क्रिकेट में भी मौका देगा, जब समय सही होगा. तब तक अगर आप उनका सम्मान नहीं करते हैं, तो क्योंकि कल को जब आप कप्तान होंगे तो आपको भी अपनी टीम से सम्मान नहीं मिलेगा. आप उनका सम्मान करें, चाहे कुछ भी हो रहा हो. चीज़ें आपके पास आएंगी, आपको इसके पीछे भागने की ज़रूरत नहीं है\".15 जनवरी 2022 को विराट ने छोड़ी थी टेस्ट कप्तानीबता दें कि टी20 विश्व कप 2021 में भारत की हार के बाद विराट ने भारतीय टी20 टीम की कप्तानी छोड़ दी थी. लेकिन वे भारतीय वनडे और टेस्ट टीम की कप्तानी जारी रखना चाहते थे लेकिन बीसीसीआई ने व्हाइट और रेड बॉल क्रिकेट में दो अलग-अलग कप्तान नहीं हो सकते इसका हवाला देकर विराट से वनडे की कप्तानी छीन ली, जिसके बाद 15 जनवरी 2022 को साउथ अफ्रीका दौरे के बाद विराट ने भारत की टेस्ट कप्तानी भी छोड़ दी.  ","pubDate":"2023-01-13 02:55:31","image_url":"https://c.ndtvimg.com/2021-12/g2koeni8_ravi-shastri-and-virat-kohli-_625x300_26_December_21.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"आस्ट्रेलिया पर राशिद खान का पलटवार, अफगानी स्टार ने बीबीएल से बहिष्कार की दी धमकी","link":"https://sports.ndtv.com/hindi/cricket/rashid-khan-hits-back-at-australia-afghani-star-threatens-to-boycott-bbl-3688138#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"क्रिकेट आस्ट्रेलिया ने बृहस्पतिवार को कहा कि उसने अफगानिस्तान के खिलाफ आगामी वनडे श्रृंखला से नाम वापिस ले लिया है क्योंकि महिलाओं और लड़कियों पर तालिबान की बढती पाबंदियों के कारण खेल पाना संभव नहीं है.","content":"क्रिकेट आस्ट्रेलिया (Cricket Australia) ने बृहस्पतिवार को कहा कि उसने अफगानिस्तान के खिलाफ आगामी वनडे श्रृंखला से नाम वापिस ले लिया है क्योंकि महिलाओं और लड़कियों पर तालिबान की बढती पाबंदियों के कारण खेल पाना संभव नहीं है.  इसके विरोध में एसीबी (अफगानिस्तान क्रिकेट बोर्ड) के स्टार खिलाड़ी राशिद खान (Rashid Khan) ने बिग बैश लीग (बीबीएल) से बहिष्कार की धमकी दी है. एसीबी ने क्रिकेट आस्ट्रेलिया के इस फैसले को निराशाजनक करार दिया जबकि राशिद ने सोशल मीडिया पर क्रिकेट आस्ट्रेलिया की आलोचना की.न्यूट्रल वेन्यू पर होनी थी सीरीज़आस्ट्रेलिया को तीन मैचों की वनडे श्रृंखला के तहत अफगानिस्तान के खिलाफ यूएई में मार्च में खेलना था जो आईसीसी सुपर लीग का हिस्सा भी है. आस्ट्रेलिया सरकार समेत सभी पक्षधारकों से मशविरे के बाद क्रिकेट आस्ट्रेलिया ने इसमें भाग नहीं लेने का फैसला किया है. सीए ने एक बयान में कहा ,‘‘क्रिकेट आस्ट्रेलिया ने तय किया है कि आस्ट्रेलिया और अफगानिस्तान के बीच मार्च 2023 में पुरूषों की वनडे श्रृंखला नहीं खेल सकेगा. ''इस वजह से क्रिकेट ऑसंट्रेलिया ने उठाया कदमबता दें कि क्रिकेट ऑस्ट्रेलिया का कहना है कि ‘‘ तालिबान द्वारा महिलाओं और लड़कियों की शिक्षा और रोजगार , पार्क और जिम में उनके जाने पर पाबंदियों के बाद यह फैसला लिया गया. सीए दुनिया भर में महिलाओं और पुरूषों के बीच खेल के विकास का समर्थक है. '' अफगानिस्तान में तालिबान (Taliban) ने महिलाओं के यूनिवर्सिटी जाने और एनजीओ में काम करने पर प्रतिबंध लगा दिया है. अफगानिस्तान आईसीसी का एकमात्र पूर्णकालिक सदस्य देश है जिसकी महिला टीम नहीं है और शनिवार से शुरू हो रहे महिला अंडर 19 टी20 विश्व कप में नहीं खेलेगा.  अपने बचाव में एसीबी ने कहा कि क्रिकेट आस्ट्रेलिया का फैसला राजनीति से प्रेरित है और यह देश में खेल के विकास के लिये बड़ा झटका होगा.अफगानिस्तान क्रिकेट ने दिया बयानएसीबी ने एक बयान में कहा, ‘‘अफगानिस्तान क्रिकेट बोर्ड (Afghanistan Cricket Board) मार्च में क्रिकेट आस्ट्रेलिया के अफगानिस्तान की तीन मैचों की घरेलू श्रृंखला से हटने के निराशाजनक बयान से काफी दुखी और आहत है और हम इस मुद्दे पर आधिकारिक रूप से अंतरराष्ट्रीय क्रिकेट परिषद (आईसीसी) को लिखेंगे. '' उसने कहा, ‘‘एसीबी परिस्थितियों पर करीब से नजर रखे है और अगर अफगानिस्तान की घरेलू श्रृंखला से आस्ट्रेलिया के हटने के फैसले को नहीं बदला गया तो बोर्ड आईसीसी को आधिकारिक रूप से लिखने के अलावा बीबीएल में अफगानिस्तान के खिलाड़ियों की भागीदारी के बारे में दोबारा विचार कर रहा है. ''राशिद खान ने दी धमकीराशिद खान ने भी आस्ट्रेलिया में बीबीएल से हटने की धमकी दी. उन्होंने कहा, ‘‘मुझे यह सुनकर काफी निराशा हो रही है कि आस्ट्रेलिया ने मार्च में हमसे श्रृंखला खेलने से हटने का फैसला किया है. '' उन्होंने कहा, ‘‘अगर अफगानिस्तान के खिलाफ खेलना आस्ट्रेलिया को असहज बनाता है तो मैं बीबीएल में अपनी मौजूदगी से किसी को भी असहज नहीं बनाना चाहूंगा. इसलिये मैं टूर्नामेंट में अपने भविष्य पर कड़ाई से विचार करूंगा. ''आस्ट्रेलिया को गंवाने पड़ेंगे अंकआईसीसी के सीईओ ज्यौफ अलार्डिस ने महिला क्रिकेट को लेकर अफगानिस्तान में प्रतिबद्धता के अभाव के बारे में कहा कि आईसीसी बोर्ड की अगली बैठक में इस पर बात की जायेगी. उन्होंने कहा ,‘‘ अफगानिस्तान का ताजा घटनाक्रम चिंताजनक है. हम हालात पर नजर रखे हुए हैं. बोर्ड अगली बैठक में इस पर बात करेगा. ''आस्ट्रेलिया को इस श्रृंखला में भाग नहीं लेने के कारण 30 प्रतिस्पर्धा अंक गंवाने पड़ेंगे जो अफगानिस्तान को मिलेंगे. वैसे इसके कोई मायने नहीं है क्योंकि आस्ट्रेलिया इस साल भारत में होने वाले वनडे विश्व कप के लिये क्वालीफाई कर चुका है. ","pubDate":"2023-01-13 01:34:17","image_url":"https://c.ndtvimg.com/2022-08/66c6lmtg_rashid-khan_625x300_13_August_22.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Rashid Khan divides cricket world after staggering call to 'quit BBL'","link":"https://au.sports.yahoo.com/rashid-khan-divides-cricket-world-after-staggering-call-to-quit-bbl-235011727.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-01-12 23:50:11","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2023-01/57ed07e0-92d3-11ed-b6f7-db47e253a1c9","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps call up Auckland swing bowler Ben Lister for India series","link":"https://www.newstalkzb.co.nz/news/sport/cricket-black-caps-call-up-auckland-swing-bowler-ben-lister-for-india-series/","keywords":null,"creator":null,"video_url":null,"description":"Auckland left-armer Ben Lister is set for an international debut after earning selection in the Black Caps’ T20 squad to play India later this month. The selection is Lister’s first international call up and comes after he made his New Zealand A debut last year in India. That tour was cut short after the 27-year-old was struck down with pneumonia. The infection saw Lister spend time in hospital before returning home to continue his recovery. But he will soon get a chance to banish those bad memories, with the Black Caps’ bowling stocks depleted through either injury or unavailability. Kyle Jamieson (back), Matt Henry (abdominal) Adam Milne (side) and Ben Sears (back) were unavailable for selection as they continued to manage injuries, while Tim Southee wasn’t considered. Southee, along with captain Kane Williamson and coach Gary Stead, will return to New Zealand after the ODI series in Pakistan to prepare for the visit of England in February. In their absence, Mitchell Santner will again captain the T20 side with batting coach Luke Ronchi taking the off-field reins, while Lister can stake his claim for further opportunities. Black Caps selector Gavin Larsen said the swing bowler - who since his debut in 2017 has been Auckland’s leading wicket-taker in T20 and list A cricket - had impressed with his range of skills. “Ben has made an exciting impact for Auckland early in his career,” Larsen said. “His ability to swing the ball considerably as a left-armer is particularly exciting. “We all felt for Ben after his [NZ A] tour ended the way it did last year, and it’s a testament to his work ethic that he’s been able to return to domestic cricket so strongly.” The 15-man group to play India features an experienced T20 core, including nine players from last year’s World Cup squad, along with a few newer to international cricket. That includes Canterbury all-rounder Henry Shipley, who this week made his international bow in the series against Pakistan, and former Netherlands representative Michael Rippon, who earned a Black Caps debut against Scotland last year. Santner will juggle that mix and Larsen noted the 30-year-old had impressed in his previous opportunities as captain of the T20 team. “Mitch is a leader in our white-ball teams and has captained the T20 side in India before,” he said. “His experience in Indian conditions will be invaluable.” The three-match T20 series starts in Ranchi on January 27, following a three-game ODI series against the same opponents. Black Caps T20 squad to tour India: Mitchell Santner (c), Finn Allen, Michael Bracewell, Mark Chapman, Dane Cleaver, Devon Conway, Jacob Duffy, Lockie Ferguson, Ben Lister, Daryl Mitchell, Glenn Phillips, Michael Rippon, Henry Shipley, Ish Sodhi, Blair Tickner.","content":"Auckland left-armer Ben Lister is set for an international debut after earning selection in the Black Caps’ T20 squad to play India later this month. The selection is Lister’s first international call up and comes after he made his New Zealand A debut last year in India. That tour was cut short after the 27-year-old was struck down with pneumonia. The infection saw Lister spend time in hospital before returning home to continue his recovery. But he will soon get a chance to banish those bad memories, with the Black Caps’ bowling stocks depleted through either injury or unavailability. Kyle Jamieson (back), Matt Henry (abdominal) Adam Milne (side) and Ben Sears (back) were unavailable for selection as they continued to manage injuries, while Tim Southee wasn’t considered. Southee, along with captain Kane Williamson and coach Gary Stead, will return to New Zealand after the ODI series in Pakistan to prepare for the visit of England in February. In their absence, Mitchell Santner will again captain the T20 side with batting coach Luke Ronchi taking the off-field reins, while Lister can stake his claim for further opportunities. Black Caps selector Gavin Larsen said the swing bowler - who since his debut in 2017 has been Auckland’s leading wicket-taker in T20 and list A cricket - had impressed with his range of skills. “Ben has made an exciting impact for Auckland early in his career,” Larsen said. “His ability to swing the ball considerably as a left-armer is particularly exciting. “We all felt for Ben after his [NZ A] tour ended the way it did last year, and it’s a testament to his work ethic that he’s been able to return to domestic cricket so strongly.” The 15-man group to play India features an experienced T20 core, including nine players from last year’s World Cup squad, along with a few newer to international cricket. That includes Canterbury all-rounder Henry Shipley, who this week made his international bow in the series against Pakistan, and former Netherlands representative Michael Rippon, who earned a Black Caps debut against Scotland last year. Santner will juggle that mix and Larsen noted the 30-year-old had impressed in his previous opportunities as captain of the T20 team. “Mitch is a leader in our white-ball teams and has captained the T20 side in India before,” he said. “His experience in Indian conditions will be invaluable.” The three-match T20 series starts in Ranchi on January 27, following a three-game ODI series against the same opponents. Mitchell Santner (c), Finn Allen, Michael Bracewell, Mark Chapman, Dane Cleaver, Devon Conway, Jacob Duffy, Lockie Ferguson, Ben Lister, Daryl Mitchell, Glenn Phillips, Michael Rippon, Henry Shipley, Ish Sodhi, Blair Tickner.","pubDate":"2023-01-12 22:46:25","image_url":"https://www.newstalkzb.co.nz/media/swkgpgql/ben-lister-celebrates-the-wicket-of-henry-shipley-during-the-super-smash-photosportnz.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Cricket: Afghanistan blasts Australia’s decision to cancel ODI series","link":"https://www.newstalkzb.co.nz/news/sport/cricket-afghanistan-blasts-australia-s-decision-to-cancel-odi-series/","keywords":null,"creator":null,"video_url":null,"description":"Afghanistan cricket officials have blasted Australia’s decision to cancel their men’s one-day international cricket series. Cricket Australia cited recent heavier restrictions on women’s rights in Afghanistan by the Taliban government for axing the three ODIs in March in the United Arab Emirates. The Afghanistan Cricket Board said it was “extremely disappointed and saddened by the pathetic statement” from Cricket Australia and it would complain to the International Cricket Council. It accused CA of prioritising political interests over fair play and sportsmanship, undermining the integrity of the game, and damaging the relationship between the two countries. “Cricket has played a significant role in promoting unity and national pride in Afghanistan,” the board said. “After years of war and conflict, cricket has helped to bring people together and provide a sense of normalcy to the country. It has also been an important source of hope and inspiration for all Afghans, particularly young people.” It said it would rethink the participation of Afghan players in the Big Bash League if the decision was not reversed. Afghan fast bowler Naveen ul Haq Murid called scrapping the series “childish” and accused Australia of taking away Afghans’ only reason for happiness instead of being supportive. The ruling Taliban have banned women from sports as well as barring them from most schooling and many realms of work. A number of women posed for an AP photographer for portraits with the equipment of the sports they loved. Though they do not necessarily wear the burqa in regular life, they chose to hide their identities with their burqas because they fear Taliban reprisals and because some of them continue to practice their sports in secret. Photo / AP When Kabul fell to the Taliban in 2021, women were banned from playing sports on the grounds that doing so would contravene Islamic laws requiring their hair and skin to be covered. Recent Taliban restrictions on women’s and girls’ education, employment opportunities and their ability to access parks and gyms were cited by Cricket Australia for dropping the men’s ODIs following consultation with the Australian government and other groups. “CA is committed to supporting growing the game for women and men around the world, including in Afghanistan, and will continue to engage with the Afghanistan Cricket Board in anticipation of improved conditions for women and girls in the country,” CA said. Cricket! The only hope for the country.Keep politics out of it. @CricketAus @BBL @ACBofficials ♥️ 🇦🇫 ♥️ pic.twitter.com/ZPpvOBetPJ— Rashid Khan (@rashidkhan_19) January 12, 2023 Australia gave similar reasons for axing a one-off test match against Afghanistan in Hobart, Australia, in November 2021. In December, the Taliban banned women from completing higher education, having prohibited attendance at gyms and parks a month earlier. Women are also banned from attending school beyond year seven and working most jobs outside of their homes. In November 2021, the ICC formed a working group aiming to support and review women’s and men’s cricket in Afghanistan but more than a year later, the country remains the only full member of the ICC without a fully operational women’s team. Afghanistan is also the only full member not represented at the Under-19 Women’s T20 World Cup in South Africa starting this week.","content":"Afghanistan cricket officials have blasted Australia’s decision to cancel their men’s one-day international cricket series. Cricket Australia cited recent heavier restrictions on women’s rights in Afghanistan by the Taliban government for axing the three ODIs in March in the United Arab Emirates. The Afghanistan Cricket Board said it was “extremely disappointed and saddened by the pathetic statement” from Cricket Australia and it would complain to the International Cricket Council. It accused CA of prioritising political interests over fair play and sportsmanship, undermining the integrity of the game, and damaging the relationship between the two countries. “Cricket has played a significant role in promoting unity and national pride in Afghanistan,” the board said. “After years of war and conflict, cricket has helped to bring people together and provide a sense of normalcy to the country. It has also been an important source of hope and inspiration for all Afghans, particularly young people.” It said it would rethink the participation of Afghan players in the Big Bash League if the decision was not reversed. Afghan fast bowler Naveen ul Haq Murid called scrapping the series “childish” and accused Australia of taking away Afghans’ only reason for happiness instead of being supportive. When Kabul fell to the Taliban in 2021, women were banned from playing sports on the grounds that doing so would contravene Islamic laws requiring their hair and skin to be covered. Recent Taliban restrictions on women’s and girls’ education, employment opportunities and their ability to access parks and gyms were cited by Cricket Australia for dropping the men’s ODIs following consultation with the Australian government and other groups. “CA is committed to supporting growing the game for women and men around the world, including in Afghanistan, and will continue to engage with the Afghanistan Cricket Board in anticipation of improved conditions for women and girls in the country,” CA said. Australia gave similar reasons for axing a one-off test match against Afghanistan in Hobart, Australia, in November 2021. In December, the Taliban banned women from completing higher education, having prohibited attendance at gyms and parks a month earlier. Women are also banned from attending school beyond year seven and working most jobs outside of their homes. In November 2021, the ICC formed a working group aiming to support and review women’s and men’s cricket in Afghanistan but more than a year later, the country remains the only full member of the ICC without a fully operational women’s team. Afghanistan is also the only full member not represented at the Under-19 Women’s T20 World Cup in South Africa starting this week.","pubDate":"2023-01-12 21:45:58","image_url":"https://www.newstalkzb.co.nz/media/ubjngc2m/afghanistan-cricket-photosport.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Star threatens BBL walkout over Afghanistan tour cancellation","link":"https://www.couriermail.com.au/sport/cricket/cricket-2023-afghanistan-star-threatens-to-withdraw-from-bbl-in-response-to-australia-tour-cancel/news-story/f393b1682d4977503b4ebe35dd4313cd","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Rashid Khan has threatened to turn his back on the Big Bash League following Australia’s decision to boycott playing his homeland, Afghanistan.","content":"Arguably the best international export in BBL history, Khan has launched a stinging attack on Cricket Australia over its decision to pull out of an ODI series against Afghanistan in March over a human rights stand.Cricket Australia announced on Thursday that the men’s team had withdrawn from an upcoming series against Afghanistan to be staged in the UAE in response to the ruling Taliban’s “concerning” restrictions on women and girl’s activities in the nation.However, the political stance – which was backed by the Australian Government – could cost the Big Bash its biggest star.“I am really disappointed to hear that Australia have pulled out of the series to play us in March,” Rashid wrote on twitter.“I take great pride in representing my country and we have made great progress on the world stage.“This decision from CA sets us back in that journey.“If playing vs Afghanistan is so uncomfortable for Australia then I wouldn’t want to make anyone uncomfortable with my presence in the BBL.“Therefore, I will be strongly considering my future in that competition.”Rashid played eight matches for the Adelaide Strikers this season before abandoning the competition after January 5 to head to South Africa on massive money for a new cashed-up T20 franchise league which runs against the BBL.The Afghanistan Cricket Board labelled CA’s more as “pathetic” and threatened their player’s participation in the BBL. “Afghanistan Cricket Board is extremely disappointed and saddened by the pathetic statement of Cricket Australia to withdraw from Afghanistan’s home three-match ODI series in March and will officially write to the International Cricket Council about the issue,” the ACB said in a statement. “The decision to withdraw from playing the upcoming ODI series against Afghanistan is unfair and unexpected and will have a negative impact on the development and growth of cricket in Afghanistan as well as will affect the love and passion of the Afghan nation for the game.“The Afghanistan Cricket Board (ACB) is closely monitoring the situation and is considering taking action, including officially writing to ICC and rethinking the participation of Afghan players in the Big Bash League (BBL), if the decision to withdraw from Afghanistan’s home series is not overturned.”The Big Bash helped launch the superstar leg-spinner’s career and he has become a household name with his performances for Adelaide.Even this summer, Rashid provided one of the highlights of the Australian season, when he jumped into the nets to bowl to West Indian legend Brian Lara on Fox Cricket.Another Afghanistan star has also lashed CA for its boycott.“Just read the news of Australia not playing the series against us,” Rahmanulla Gurbaz wrote on social media.“We should never mix politics with cricket and we are expecting the world to support Afghanistan in this difficult situation rather than taking away the only one happiness we have. This is shocking and unacceptable act of CA.”The International Cricket Council allowed Afghanistan to compete in the recent Twenty20 World Cup, with Australia playing them in the group stages in Adelaide.But after “extensive consultation” with relevant stakeholders, including the Australian government, Cricket Australia decided that it would refuse to play Afghanistan in bilateral competition.“This decision follows the recent announcement by the Taliban of further restrictions on women’s and girls’ education and employment opportunities and their ability to access parks and gyms,” a CA statement said.“CA is committed to supporting growing the game for women and men around the world, including in Afghanistan, and will continue to engage with the Afghanistan Cricket Board in anticipation of improved conditions for women and girls in the country.“We thank the Australian Government for its support on this matter.”Australia has never played Afghanistan in a bilateral international series.","pubDate":"2023-01-12 21:37:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Five points separate the bottom eight in the Premier League – this could be the tightest top-flight race to survive ever","link":"https://www.thesun.ie/sport/football/10044334/premier-league-relegation-everton-leeds-leicester/","keywords":["Football","Sport","Premier League"],"creator":["Mark Irwin"],"video_url":null,"description":null,"content":"AS the Premier League reaches its halfway point this weekend, millions of anxious fans are asking the same question. Where are Norwich and Watford to bail us out? GettyConor Coady and Everton are in real trouble[/caption] The Toffees face a reinvigorated Southampton, themselves still in danger, on SaturdayRex Because while the title race might already be down to two teams, the fight to avoid the drop is wide open. Just five points separate the bottom eight and you can make a case for absolutely any of them to be relegated this season. That is because, unlike most years, there are no absolute bankers to go down, with even Fulham refusing to reprise their customary role of top-flight cannon fodder. So from bottom-of-the-table Southampton all the way up to Leicester in 13th, the absence of the usual safety net is making this year’s high-wire act more precarious than ever. The fact that six of the Frightful Eight are facing off this weekend only adds to the drama. And nowhere will the stakes be higher than at Goodison Park when Everton host a Saints side revitalised by two morale-boosting cup wins in a week against Crystal Palace and Manchester City. It’s a pity for Nathan Jones that those victories don’t come with points, because that’s what he needs far more than extra matches right now. Just like tomorrow’s opponents, Southampton have managed just five points from their last ten league games and can no longer take their place among the top-flight elite for granted. HOW TO GET FREE BETS ON FOOTBALL Next week marks the first anniversary of Rafa Benitez’s sacking after his disastrous 200 days in charge at Everton. But things have only gone from bad to worse at the so-called  People’s Club, where they flogged Richarlison, the player who kept them up almost single-handedly last season, and spent the money on Neal Maupay, James Garner and Dwight McNeil. Frank Lampard has just received the backing of owner Farhad Moshiri but it’s the fact there are no obvious managerial alternatives available that is keeping him in a job. The same is probably true at West Ham, where David Moyes spent £158.1million last summer to take the team to one place above the relegation zone. Leeds continue to veer from the sublime to the ridiculous under the highly emotional Jesse Marsch while the dead cat bounce enjoyed by Gary O’Neil is well and truly over at Bournemouth. ReutersJesse Marsch’s Leeds veer from sublime to the ridiculous[/caption] Leicester appeared to have pulled their way out of trouble after a disastrous start to the season but without the injured James Maddison, have dropped right back into trouble and are by no means safe. Nottingham Forest remain as unpredictable as ever, giving Steve Cooper a new contract when everyone expected him to be sacked and continuing to sign new players like there’s no tomorrow. In fact, the only one of the strugglers showing any discernible signs of improvement are Wolves, where the appointment of Julen Lopetegui is finally starting to have an effect. Victory at home to West Ham tomorrow could lift Los Lobos (Portuguese Wolves) out of the relegation zone for the first time in four months and possibly as high as 15th, depending on results elsewhere. But nothing is that straightforward in this year’s fight for survival and the only thing for certain is there will be a lot of loose bowels in the boardrooms in the coming months. TEN WOUT OF TEN QUITE a few eyebrows have been raised by Manchester United’s recent decision to sign Burnley cast-off Wout Weghorst on loan. But having seen the speed with which Erik ten Hag has transformed the team this season, I think he should be given the benefit of the doubt. Wout Weghorst could be a shrewd signing by Erik Ten HagRex The no-nonsense Dutchman might have spent a small fortune acquiring Antony, Casemiro, Tyrell Malacia,  Lisandro Martinez  and Christian Eriksen last summer but they have all been key players in the Old Trafford revival. And if he believes Weghorst can help cement a top-four position this season, who are we to argue? TODD A BLUES DUNCE IF it’s true that a fool and his money are soon parted, then Chelsea’s new owners should be wearing a dunce’s cap. Having paid £4.25billion to buy the club from sanctioned oligarch Roman Abramovich, they spent a further £260million in the summer transfer window. That still wasn’t enough to keep Thomas Tuchel in a job and after 100 days of the new regime he walked away with £15m in compensation. A similar sum was handed to Brighton for boss Graham Potter and less than two weeks into the January window they are still splashing out like a drunk in a whorehouse. David Datro Fofana, Benoit Badiashile, Andrey Santos and the on-loan Joao Felix have already been added to the Boehly Collection this month and enquiries have been made for Enzo Fernandez, Mykhailo Mudryk, Moises Caicedo and God knows who else. Having allegedly suggested a 4-4-3 formation to former manager Tuchel, maybe Tinkerman Todd now favours his Blues going 5-5-4. VAR DOESN’T LINE UP TWO goals were scored from offside positions in Sheffield Wednesday’s FA Cup win against Newcastle because there was no VAR. But they had all the technology in place for the Liverpool v Wolves tie yet still couldn’t tell if Toti Gomes’ late winner should have been ruled out. Josh Windass’ first goal for Sheffield Wednesday against Newcastle would have been ruled offside if there was VARRex Meanwhile, the Carabao Cup will use the red and blue lines now  the competition has reached the semi- final stage despite coping perfectly well without it in the previous rounds. Four years after VAR was introduced into the English game and we still can’t make our minds up if it’s been a help or a hindrance. It’s the sporting equivalent of Brexit. AUSSIES ARE ARCHER’S TARGET JOFRA ARCHER marked his return to cricket with three wickets for MI Cape Town in the new South African T20 competition. After 18 months out with back and shoulder injuries, England’s quickest bowler now seems a shoo-in for this summer’s Ashes series. Skipper Ben Stokes certainly seemed excited when he welcomed Archer’s return on social media. Jofra Archer returned to cricket this week and took three wicketsRex Yet England haven’t struggled in Archer’s absence and it seems unfair one of the front-line bowlers should have to make way for his return. But that’s the nature of elite sport and having someone who can scare the living daylights out of Aussies David Warner and Steve Smith can only be a good thing. HE’S IAN POUTER MOVE on over Cristiano Ronaldo because there is a new king of the sporting prima donnas. LIV golf rebel Ian Poulter threw a hissy fit after the Ryder Cup Team Europe Twitter account did not wish him or Sergio Garcia a happy birthday this week. Pocketing around £20million for his part in tearing the sport apart obviously isn’t enough for the 47-year-old man-child. It seems Poulter now expects colleagues he abandoned to organise him a party with jelly and a cake. The best part of it all was that it was not until 15 minutes after his meltdown that the LIV organisation took to social media to send him birthday greetings.","pubDate":"2023-01-12 20:45:00","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Cricket Australia savaged by Afghanistan over 'pathetic' call on ODI series","link":"https://au.sports.yahoo.com/cricket-australia-savaged-afghanistan-over-pathetic-call-odi-series-194556619.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-01-12 19:45:56","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2023-01/78913690-92b2-11ed-bfdd-d898fe12e6e7","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Beloved cricket cult figure trashes Australia","link":"https://www.couriermail.com.au/sport/cricket/beloved-bbl-cult-figure-rashid-khan-goes-rogue-and-trashes-australia/news-story/c1223584293ad852bd39f735c4c30e72","keywords":["Big Bash News","Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Rashid Khan has declared war on Australia over our national team’s decision to withdraw from a tour of Afghanistan.","content":"The Adelaide Strikers fan favourite — who had Aussie fans cheering for Afghanistan during the recent T20 World Cup in Australia — says he might never play in the Big Bash League again.“I am really disappointed to hear that Australia have pulled out of the series to play us in March,” Khan tweeted on Thursday evening.“I take great pride in representing my country and we have made great progress on the world stage. This decision from CA sets us back in that journey.“If playing vs Afghanistan is so uncomfortable for Australia then I wouldn’t want to make anyone uncomfortable with my presence in the BBL.”It comes after the Australian men’s team withdrew from an upcoming series against Afghanistan in response to the ruling Taliban’s “concerning” restrictions on women and girl’s activities in the nation.A three-match one-day series, which forms part of the ICC Super League, was scheduled for March to be played in the United Arab Emirates.But after “extensive consultation” with relevant stakeholders, including the Australian government, Cricket Australia decided that it wouldn‘t go ahead.“This decision follows the recent announcement by the Taliban of further restrictions on women’s and girls’ education and employment opportunities and their ability to access parks and gyms,” a CA statement said.“CA is committed to supporting growing the game for women and men around the world, including in Afghanistan, and will continue to engage with the Afghanistan Cricket Board in anticipation of improved conditions for women and girls in the country.“We thank the Australian Government for its support on this matter.”Australia will forfeit 30 competition points for the series, which go towards World Cup qualification, and they be awarded to Afghanistan. But the Aussies have already secured automatic qualification to the ODI World Cup in India in October.Afghanistan is the only ICC full member nation without a women’s team, and won’t have a team at the inaugural Women’s U19 T20 World Cup starting on Saturday.The issue remains of concern to the ICC and CEO Geoff Allardice said overnight that developments in Afghanistan were a matter certain to be discussed at the next meeting.“Obviously, the recent developments (banning higher education for girls) in Afghanistan are concerning,” Allardice said during a virtual press conference.“Our board has been monitoring progress since the change of regime. It is a concern that progress is not being made in Afghanistan and it‘s something our board will consider at its next meeting in March. As far as we are aware, there isn’t activity at the moment.”Australia has never played Afghanistan in an ODI or T20 bilateral series.— with NCA NewsWire","pubDate":"2023-01-12 19:30:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"BBL exodus looms over ‘pathetic’ decision","link":"https://www.couriermail.com.au/sport/cricket/afghanistan-cricket-board-slams-cricket-australias-pathetic-decision-to-withdraw-from-odi-series/news-story/1d70ec86fb6ca277e9765ce9e3ee94e5","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"The Afghanistan Cricket Board has slammed Cricket Australia’s “pathetic” decision to withdraw from March’s three-match ODI series in the United Arab Emirates, threatening to contact the International Cricket Council and prohibit Afghan players from participating in the Big Bash League.","content":"On Thursday afternoon, CA announced its decision to pull out of the white-ball series in response to the Taliban’s treatment of women, including growing restrictions on education and employment opportunities.The Taliban recently banned teenage girls from schools and forbade women from attending universities in Afghanistan, which sparked global backlash.Watch BBL12. Every game live and ad-break free during play on Kayo. New to Kayo? Start your free trial now >CA consulted relevant stakeholders and the Australian Government before withdrawing from the series, a decision that did not resonate well with Afghanistan’s cricket stars.Adelaide Strikers leg-spinner Rashid Khan, one of the Big Bash Leauge’s most popular players, released a statement claiming he was “strongly considering” his future in the competition.“I am really disappointed to hear that Australia have pulled out of the series to play us in March,” Khan tweeted on Thursday evening.“I take great pride in representing my country and we have made great progress on the world stage. This decision from CA sets us back in that journey.“If playing vs Afghanistan is so uncomfortable for Australia then I wouldn’t want to make anyone uncomfortable with my presence in the BBL.”Afghanistan bowler Naveen-ul-Haq, who represented the Sydney Sixers this summer, also threatened to boycott the BBL following CA’s announcement.Former Afghanistan captain Gulbadin Naib posted to Twitter: “I was not expecting a country like Australia to encourage the ICC to harm men’s cricket as well, so it was an irresponsible decision taken by Cricket Australia … don’t use sports like a tool for politicians.”On Thursday evening, the ACB released an strongly-worded statement in response to CA’s “unfair and unexpected” withdrawal, accusing the organisation of “prioritising political interests over the principles of fair play and sportsmanship”.“Cricket Australia’s decision to withdraw from upcoming matches against Afghanistan is coming after consultation and potential enforcement from the Australian Government which is an unfortunate attempt to enter the realm of politics and politicise the sport,” the ACB statement read.“Cricket Australia is undermining the integrity of the game and damaging the relationship between the two nations.“The decision to withdraw from playing the upcoming ODI series against Afghanistan is unfair and unexpected and will have a negative impact on the development and growth of cricket in Afghanistan as well as will affect the love and passion of the Afghan nation for the game.”However, the ACB did not once mention women’s rights once in the 445-word statement, instead bragging they “discourage young people from getting involved in drugs”.Since the Taliban regained control of Afghanistan in August 2021, many of Afghanistan’s female athletes have reportedly gone into hiding and received death threats.During the Taliban’s oppressive regime from 1996 to 2001, women were completely banned from playing any sport or receiving education. Sports stadiums were regularly used for public executions.Afghanistan remains the only ICC full member nation without a women’s team.Australia was scheduled to play a Test match against Afghanistan in November 2021, but the historic fixture was ”postponed” following the Taliban invasion.“CA is committed to supporting growing the game for women and men around the world, including in Afghanistan, and will continue to engage with the Afghanistan Cricket Board in anticipation of improved conditions for women and girls in the country,” CA said in a statement.“We thank the Australian Government for its support on this matter.”Australia is scheduled to face Afghanistan in a three-match T20 series at a neutral venue in August 2024 before the Asian nation tours Australia in August 2026 for three T20Is and a Test match.Afghanistan Cricket Board’s Full StatementAfghanistan Cricket Board is extremely disappointed and saddened by the pathetic statement of Cricket Australia to withdraw from Afghanistan’s home three-match ODI series in March and will officially write to the International Cricket Council about the issue.Cricket Australia’s decision to withdraw from upcoming matches against Afghanistan is coming after consultation and potential enforcement from the Australian Government which is an unfortunate attempt to enter the realm of politics and politicise the sport.By prioritising political interests over the principles of fair play and sportsmanship, Cricket Australia is undermining the integrity of the game and damaging the relationship between the two nations.The decision to withdraw from playing the upcoming ODI series against Afghanistan is unfair and unexpected and will have a negative impact on the development and growth of cricket in Afghanistan as well as will affect the love and passion of the Afghan nation for the game.The recent decision by Cricket Australia to withdraw from upcoming matches against Afghanistan has caused a great deal of concern within the Afghan cricket community. The Afghanistan Cricket Board (ACB) is closely monitoring the situation and is considering taking action, including officially writing to ICC and rethinking the participation of Afghan players in the Big Bash League (BBL), if the decision to withdraw from Afghanistan’s home series is not overturned.Cricket has played a significant role in promoting unity and national pride in Afghanistan. After years of war and conflict, cricket has helped to bring people together and provide a sense of normalcy to the country. It has also been an important source of hope and inspiration for all Afghans, particularly young people. In addition, Cricket has also been an important tool for promoting education and social development in the country.The Afghanistan Cricket Board (ACB) has been working to promote cricket in schools and universities, and it has also been using the sport to promote healthy lifestyles and discourage young people from getting involved in drugs and crime. Cricket has been an important tool for promoting peace, unity, and development in Afghanistan, and it will continue to be a source of inspiration and hope for the people of the country in the years to come.Afghanistan’s three-match ODI series against Australia in March is considered to be Afghanistan’s sixth series in the ICC Cricket World Cup’s Super League, which is set to be hosted by Afghanistan in UAE and the ACB has already settled all the required logistical arrangements. Afghanistan Cricket Board has always been responsive and expressed its willingness to work together with Cricket Australia and other member boards including stakeholders; to find a solution that supports the development of the game in Afghanistan.","pubDate":"2023-01-12 19:12:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Punjab gains vital 1st innings lead despite good show by J&K bowlers","link":"https://thenorthlines.com/punjab-gains-vital-1st-innings-lead-despite-good-show-by-jk-bowlers-2/","keywords":["Cricket","Jammu","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Corresspondent Jammu, Jan 12: Punjab gained a vital first innings lead of 56 runs despite a good bowling display by Jammu and Kashmir bowlers in the Ranji Trophy Elite Group-D match at IS Bindra Cricket Stadium, PCA, Mohali today. Earlier, resuming their first innings from an overnight score of 176/6, J&amp;K added 36 runs […] The post Punjab gains vital 1st innings lead despite good show by J&K bowlers appeared first on Northlines.","content":"NL Corresspondent Jammu, Jan 12: Punjab gained a vital first innings lead of 56 runs despite a good bowling display by Jammu and Kashmir bowlers in the Ranji Trophy Elite Group-D match at IS Bindra Cricket Stadium, PCA, Mohali today. Earlier, resuming their first innings from an overnight score of 176/6, J&amp;K added 36 runs in 10.1 overs to score 212 runs in their first innings. Fazil Rashid who was unbeaten on 46 runs was the first man to go on the same score. However, Umar Nazir (20) and Rohit Sharma (10*) made a last wicket partnership of 30 runs to help J&amp;K surpass 200-run mark. Baltej Singh was the most successful bowler for Punjab, who captured 5 wickets by giving away 47 runs in his 15.1 overs, while Sidharth Kaul bagged 4 wickets by conceding 82 runs in his 15 overs. Mayank Markande also claimed one wicket. In reply, Punjab scored 268 runs in their first innings thus gaining a crucial lead of 56 runs. At one point of time, Punjab were struggling on 147/7, however, skipper Mandeep Singh and Gurnoor Brar played sensibly and notched up magnificent half-centuries and made a partnership of 100 runs between them to take the score to 247 runs before Brar was dismissed at his individual score of 64 runs off 60 balls, studded with 5 fours and 3 sixes. Mandeep top scored with 69 runs off 104 balls including 9 boundaries. Abhishek Sharma (32), Nehal Wadhera (25), Prabhsimran Singh (20) and Sidharth Kaul (19*) were the other contractors. For J&amp;K, speedsters Umar Nazir and Rohit Sharma took 3 wickets each, while left-arm spinner Abid Mushtaq bagged 2 wickets. Auqib Nabi and Taizeem Younis Tak claimed one wicket each. J&amp;K were 18/1 in 6 overs in their second essay. Skipper Shubham Khajuria was dismissed at his individual score of 8 runs, while Vivrant Sharma (9) and Musaif Ajaz (1) were at the crease. Baljeet Singh took the lone wicket to fall.The post Punjab gains vital 1st innings lead despite good show by J&K bowlers appeared first on Northlines.","pubDate":"2023-01-12 18:43:08","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"KCSC wins against Game Changers in T20","link":"https://thenorthlines.com/kcsc-wins-against-game-changers-in-t20/","keywords":["Jammu","Jammu Kashmir","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Corresspondent Jammu, Jan 12: The KC Sports Club (KCSC) today registered win against Game Changers beating latter by two wickets in the ongoing New Year T20 Cricket League at KCSC Ground, here. Batting first, Game Changers scored 112 runs for the loss of eight wickets. Tanveer and Touheed were main scorers with 19 and […] The post KCSC wins against Game Changers in T20 appeared first on Northlines.","content":"NL Corresspondent Jammu, Jan 12: The KC Sports Club (KCSC) today registered win against Game Changers beating latter by two wickets in the ongoing New Year T20 Cricket League at KCSC Ground, here. Batting first, Game Changers scored 112 runs for the loss of eight wickets. Tanveer and Touheed were main scorers with 19 and 13 runs respectively. From KCSC, Vishwajeet Singh took two wickets while Krishna, Kanan, Paras, Avinash and Varun shared apiece each. In reply, KCSC chased the target in 16 overs losing eight wickets. Vishwajeet Singh played match winning knock of 64 runs while Kanan contributed 17. From Game Changers, Khalid and Tanveer bowled well taking away three and two wickets respectively. Later, Vishwajeet declared man of the match.The post KCSC wins against Game Changers in T20 appeared first on Northlines.","pubDate":"2023-01-12 18:36:09","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"राशिद खान ने दी क्रिकेट ऑस्ट्रेलिया को यह वॉर्निंग, अफगानिस्तान के खिलाफ सीरीज न खेलने का फैसला लिया था","link":"https://sports.ndtv.com/hindi/cricket/now-rashid-khan-gives-such-warning-after-australia-has-decided-not-to-play-odi-series-against-afghanistan-3687089#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"क्रिकेट ऑस्ट्रेलिया ने अफगानिस्तान में महिलाओ की स्थिति के कारण उसके खिलाफ वनडे सीरीज न खेलने का फैसला लिया था.","content":"क्रिकेट ऑस्ट्रेलिया (CA) के इस साल के आखिरी में यूएई में खेले जाने वाली वनडे सीरीज में अफगानिस्तान के खिलाफ खेलने से इनकार करने के बाद अब इस पर प्रतिक्रिया भी आनी शुरू हो गई है. दरअसल तालिबान के अफगानिस्तान की सत्ता पर काबिज होने के बाद उसने देश में अपनी महिलाओं और लड़कियों पर कई तरह के प्रतिबंध लगा दिए हैं. तालिबान के इसी फैसले के विरोधस्वरूप क्रिकेट ऑस्ट्रेलिया ने अफगानिस्तान के खिलाफ वनडे सीरीज न खेलने का फैसला लिया है. बहरहाल, अब अफगानिस्तान के वैश्विक स्तर पर मशहूर लेग स्पिनर राशिद खान (Rashid Khan warns to CA) ने इस फैसले पर नाराजगी जाहिर करते हुए क्रिकेट ऑस्ट्रेलिया को भी वॉर्निंग दे दी है.Very strong and much needed statement to make! If @cricketcomau is really that uncomfortable than stop playing any game vs @ACBofficials including ICC events as well. And can anyone tell me what is the fault of these players and fans ?— Anoop Singh (@anoopshaashtra) January 12, 2023राशिद खान ने आधिकारिक अकाउंट से ट्वीट करते हुए कहा, \"मैं वास्तव में बहुत ही निराश हूं कि ऑस्ट्रेलिया ने हमारे खिलाफ खेले जाने वाली सीरीज न खेलने का फैसला किया है. अपने देश का प्रतिनिधित्व करके मुझे बहुत ही गौरव का भान होता है और हमने इस खेल में वैश्विक स्तर पर शानदार प्रगति की है. क्रिकेट ऑस्ट्रेलिया का यह निर्णय हमारी इस विकास यात्र में एक झटका है. अगर ऑस्ट्रेलिया के लिए अफगानिस्तान के खिलाफ खेलना इतना ज्यादा असहज करने वाला है, तो मैं बीबीएल में अपनी उपस्थिति से किसी को भी असहज नहीं करना चाहूंगा. इसीलिए, इस प्रतियोगिता में खेलने को लेकर मैं बहुत ही ज्यादा गंभीरता से विचार करूंगा\" इस संदेश के जरिए एक तरह से राशिद ने क्रिकेट ऑस्ट्रेलिया को वॉर्निंग दे दी है कि उसके इस फैसले के बाद उनका बीबीएल में खेलना मुश्किल होगा. अब आगे राशिद क्या फैसला लेते हैं, यह देखने वाली बात होगी. बहरहाल, भारतीय सहित एशिया के फैंस राशिद के इस फैसले की सराहना कर रहे हैं.Country comes 1st. Well done @rashidkhan_19— DRINK CRICKET (@Drink_Cricket) January 12, 2023भारतीय ऐसे ट्वीट जमकर कर रहे हैंLove that unity coming from Afghanistan cricket team. They are the true face of Afghanistan and not the Taliban. Cricket Australia must really consider it. Cricket and Terrorism are different and should be treated separately.— Himanshu Pareek (@Sports_Himanshu) January 12, 2023फैंस राशिद को सही ठहरा रहे हैंYou're right, cricket should be stay away from politics.— Khater Pardes (@KhaterPardes) January 12, 2023यह देखिए एक और भारतीय प्रशंसकVery strong and much needed statement to make! If @cricketcomau is really that uncomfortable than stop playing any game vs @ACBofficials including ICC events as well. And can anyone tell me what is the fault of these players and fans ?— Anoop Singh (@anoopshaashtra) January 12, 2023ये भी पढ़े- Video: मोहम्मद सिराज की गेंद बुलेट की रफ्तार से सीधे स्टंप में घुस गई, बल्लेबाज ने हाथ खड़ा कर दिया रोहित शर्मा ने बताया, क्यों शमी द्वारा शनाका को 'रन आउट' किए जाने के बाद वापस ली अपील और बनाने दिया शतकWatch: उमरान मलिक ने गोली की स्पीड से फेंकी गेंद, 156 KMPH की रफ्तार से बॉल फेंककर मचाया बवालस्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-01-12 18:27:23","image_url":"https://c.ndtvimg.com/2023-01/s9a7u0b8_rashid-khan_625x300_12_January_23.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"India vs Sri Lanka: KL Rahul's unbeaten 64, Kuldeep Yadav shines with ball and other talking points from second ODI","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-sri-lanka-kl-rahuls-unbeaten-64-kuldeep-yadav-shines-with-ball-and-other-talking-points-from-second-odi-11977382.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka: KL Rahul's unbeaten 64, Kuldeep Yadav shines with ball and other talking points from second ODI","content":"Rohit Sharma-led India clinched their first ODI series of 2023 after the Men in Blue scraped past Sri Lanka by four wickets in the second match of the three-match series at Kolkata’s Eden Gardens on Thursday.Debutant Nuwanidu Fernando scored a gritty half-century but the visitors were restricted to 215, a target that India took 43.2 overs to chase down.This was India’s second series win of the new year, after Hardik Pandya-led Men in Blue had clinched the T20I series against the same opposition last week.With the series already decided with a game to spare, let’s now take a look at five talking points from the match:Nuwanidu Fernando scores fifty on debutNuwanidu Fernando made his ODI debut on Thursday against India, and although teamwise, Sri Lanka failed to come out on top, it was still something of a night to remember for Fernando, as the 23-year-old notched up his maiden half-century in 62 balls.Sri Lanka won the toss and opted to bat first. Fernando opened the innings with his partner Avishka Fernando, but the latter fell to Mohammed Siraj in the sixth over, with India’s score reading 29/1.What followed was a 79-run stand with Kusal Mendis for the second wicket, and Mendis, and Dhanjanaya de Silva departed in quick succession to put the Lankans in a spot of bother at 103/3.It was not long until Nuwanidu Fernando was dismissed in the 22nd over with the visitors’ score reading 118/4, and despite mini fightbacks from Wanindu Hasaranga (21), and Dunith Wellalage, nothing much went in Lankans’ favour.In the end, as far as Sri Lanka’s batting was concerned, it was Nuwanidu’s innings that stood out.KL Rahul back among the runsKL Rahul might be fighting for consistency with the bat at the moment. Time and again, he has reminded the national selectors what he is capable of in the ODI format, and Thursday was yet another example of what he could do in crucial junctures of a match.Rahul’s strike-rate of 62.13 might have been questionable, having taken 93 balls to get to his fifty, but the most important thing is that he played calmly under pressure, coming into bat at number five.At the end of the match. Rahul was unbeaten at 64 off 103 ball, with Kuldeep Yadav (10*) at the other end.Rahul’s knock also featured a 75-run stand with Hardik and a 30-run stand with Axar Patel.India’s top-order troublesIf their top-order batting in the first ODI was an example of dominant display, the top-order batters, however, failed to fire this time around at the Eden Gardens.Having been set a target of 216 to chase down, Rohit Sharma could only manage 17 runs as he was edged and caught by Kusal Mendis, the Lankan keeper in the fifth over of the Indian chase.Less than an over later, Lahiru Kumara got rid of Shubman Gill (21), while all Virat Kohli, who had scored a century in the previous ODI, could manage were four runs.Shreyas Iyer (28) was also a victim of a dismissal after getting off to a start. But failing to convert it, with India reeling at 86/4, and credit must be given to where it is due, with KL Rahul turning the tables into India’s favour with a gritty knock.Kuldeep Yadav shines with ballKuldeep Yadav was brought into the playing XI as a replacement for the injured Yuzvendra Chahal, and Yadav’s inclusion proved to be worthy, as he ended up with figures of 3/51 at Eden Gardens, where he has played several matches for Kolkata Knight Riders (KKR) in the Indian Premier League(IPL).Kuldeep not only picked three wickets on Thursday, but also reached the milestone of 200 international wickets. Kuldeep now has 122 wickets alone, in the ODI format.Kuldeep struck for the first time in the 17th over, getting rid of Kusal Mendis off an LBW, and went on to clean up skipper Dasun Shanaka, and a caught and bowled dismissal to see off Asalanka.Kuldeep was adjudged Player of the Match, for his performance with the ball, as well as hitting the winning runs, finishing it up with a boundary.Siraj, too, makes it count with the ballMohammed Siraj was influential with the ball as well, just like Kuldeep Yadav. With figures of 3/30 from 5.4 overs, Siraj enjoyed an economy of 5.29.There will be competition heating up with the ODI World Cup slated to take place in India later this year, and it was Siraj’s chance to make it count.He scalped two wickets in the series-opener, and on Thursday, he returned with three wickets.Siraj drew first blood when he removed Avishka Fernando, cleaning up the batter with a wobble seam delivery, before coming back to haunt the visitors in the 40th over, where he struck twice.Sri Lanka were already eight down by the 40th over, and it was just a matter of time. In the second ball of the over, Axar Patel at backward point made no mistake with the catch to remove Wellalage, whose punch eventually ended in vain. Just two balls later, Siraj cleaned up Lahiru Kumara, to finally see off the Lankan innings.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-12 18:05:48","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Kuldeep-640-2nd-ODI_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Dubai Capitals to go up against Abu Dhabi Knight Riders in the blockbuster ILT20 opener","link":"https://www.firstpost.com/firstcricket/sports-news/dubai-capitals-to-go-up-against-abu-dhabi-knight-riders-in-the-blockbuster-ilt20-opener-11977262.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Dubai Capitals to go up against Abu Dhabi Knight Riders in the blockbuster ILT20 opener","content":"Dubai: Fans in the United Arab Emirates will feel the cricket frenzy in the air as the big-hitting Rovman Powell’s Dubai Capitals take on the mystery spinner Sunil Narine’s Abu Dhabi Knight Riders in the opening match of the DP World International League T20 at the Dubai International Stadium on Friday.However, before the Dubai Capitals and Abu Dhabi Knight Riders go head-to-head in the first match of the season, superstar Badshah and megastar Jason Derulo will dazzle the crowd with their glamourous performances at the opening ceremony of the DP World ILT20 on Friday.Badshah, who has produced the official DP World ILT20 Anthem ‘Halla Halla’, will enthral fans with his most popular numbers like Voodoo, Players, Jugnu, Mercy, and Kala Chashma along with a visually-stunning troop of 40 dancers supporting him. While Derulo will have the crowd on their feet with hit numbers Swalla, Take You Dancing, and In My Head, with six energetic dancers from the middle of the iconic stadium. Furthermore, Dwayne Bravo will put his musician’s hat on and engage the fans with his songs Champion and Run D World at the ‘Ring of Fire’ as well.Also read: ILT20 2023 Full Squads, Schedule, Players List and moreThe DP World ILT20 opening ceremony will be further elevated by the attendance of Bollywood superstar Shah Rukh Khan, one of the biggest film stars in the world and co-owner of Abu Dhabi Knight Riders.Dubai Capitals are packed with several exciting players such as Bhanuka Rajapaksa and Mujeeb Ur Rahman. Rajapaksa was adjudged the player of the match in the Asia Cup 2022 final against Pakistan for his brilliant innings of 71* runs from 45 balls at the Dubai International Stadium. Meanwhile, Mujeeb Ur Rahman picked up seven wickets in five matches at a fantastic average of 15.86 for Afghanistan in the competition. The Capitals also have Joe Root and Robin Uthappa, who are among the most experienced cricketers in the world. Uthappa has scored over 7,000 runs in T20s, while Root has notched over 17,000 runs in his international career.The Abu Dhabi Knight Riders also boast an impressive, strong side with the likes of Brandon Glover, Andre Russell, Paul Stirling and Colin Ingram in their camp. Glover put up a fantastic performance with figures of 3/9 to help the Netherlands register a famous 13-run victory over South Africa in the ICC Men’s T20 World Cup last year. Meanwhile, Russell, Stirling and Ingram boast of stupendous T20 records with over 7,000 runs each under their belts.Speaking about the first match of the season, Dubai Capitals’ Captain Rovman Powell said, “We are very excited to play our first DP World ILT20 game. We arrived here about a week ago and have acclimatised to the conditions here in the UAE. Our team has many exciting players and all of them cannot wait to showcase their magic on the park, especially on our home ground.”Meanwhile, Abu Dhabi Knight Riders’ Captain Sunil Narine remarked, “It’s always lovely to play in the UAE. We have trained hard as a group in the last few days and we are absolutely ready to take on our first challenge. We have a balanced side and if we play at our best, we can certainly win more games than less. The DP World ILT20 is finally here and we are very excited to see how the tournament transpires.”Doors will open for fans to catch the opening ceremony of the DP World ILT20 (Friday 13 January) from 4:00 pm GST (5:30 pm IST) with the electrifying Badshah and Derulo performances starting at 5:15 pm GST (6:45 pm IST), followed by the much anticipated first match of the league between Dubai Capitals and Abu Dhabi Knight Riders set to will kick off at 6.45 pm GST (8:15 pm IST).Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-12 17:25:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/ILt20.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka 2nd ODI: Rohit Sharma not keen on changing batting line-up for sake of including left-handed batter","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-sri-lanka-2nd-odi-rohit-sharma-not-keen-on-changing-batting-line-up-for-sake-of-including-left-handed-batter-11977192.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka 2nd ODI: Rohit Sharma not keen on changing batting line-up for sake of including left-handed batter","content":"Even though Rohit Sharma agreed that a left-hander in the top six would add variation but the Team India skipper made it clear that he isn’t too keen on changing some of the in-form batters just for the heck of it and won’t revamp the batting line-up until necessary.India on Thursday clinched the three-match ODI series against Sri Lanka by winning the low-scoring second ODI by four wickets, however, a top six with only right-handers is indeed making this line-up predictable.Notably, southpaw Ishan Kishan, the fastest double centurion in ODIs has been benched as the team management wanted to give opener Shubman Gill a long run for showing consistency during the whole of 2022.”In hindsight, it will be nice to have a left-hander in the top-order but guys who are being given the chance have got a lot of runs in the last one year,” Rohit didn’t beat around the bush about the fact that Kishan will have to wait for his next opportunity.”Ideally, we would like to have a left-hander but we know the quality of our right-handers and are quite comfortable with that at the moment,” Rohit was even more precise in his next statement.He did praise KL Rahul, the man whose inclusion is keeping both Suryakumar Yadav and Kishan out of the XI. In a low-scoring chase, Rahul’s 64 off 103 balls turned out to be decisive and the Indian captain was pleased as punch..@klrahul scored an unbeaten half-century in the chase when the going got tough and he becomes #TeamIndia‘s Top Performer from the second innings 👏👏 #INDvSLA look at his batting summary 🔽 pic.twitter.com/O0J554bwtK— BCCI (@BCCI) January 12, 2023”It was a close game but games like these teach you a lot. KL has been batting at 5 for a long time now, it gives you that confidence when an experienced batter is batting at 5. It was a good display of batsmanship.”Rohit also praised leggie Kuldeep Yadav, who bagged three crucial wickets in the match, and said that he ‘literally got us back in the game’.“For him (Kuldeep Yadav) to come back and play the game he played today, it was fantastic. Literally got us back in the game. They were batting run-a-ball and Kuldeep, as we’ve seen quite often, comes and gets the wicket. He’s quite confident as a bowler right now and it definitely augurs well with the team,” Rohit said.For his impressive performance with the ball, @imkuldeep18 gets the Player of the Match award as #TeamIndia register a 4⃣-wicket victory in the second #INDvSL ODI 👏👏Scorecard ▶️ https://t.co/jm3ulz5Yr1 @mastercardindia pic.twitter.com/jrSGU8JrB7— BCCI (@BCCI) January 12, 2023Rohit didn’t give any information if he is looking to change the combination in the next game.”We will have a look at the pitch for the third ODI, and another ODI series is coming up as well. So we will see if we need to make any changes.”Meanwhile, Sri Lanka captain Dasun Shanaka rued a lack of runs on the board which ultimately cost visitors the match.“Not enough runs on the board. We got a good start with the bat and then lost a few wickets. We discussed that it was a very flat deck. 300+ was the score to set, but Kuldeep bowled really well in the middle phase. Batsmen not getting starts is a big concern,” Shanaka said.(With PTI inputs)Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-12 17:09:06","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Rohit-Sharma-640_AFP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Rashid Khan hits out at Australia’s decision to abandon Afghanistan series","link":"https://www.theguardian.com/sport/2023/jan/12/rashid-khan-hits-out-australia-decision-abandon-afghanistan-odi-series","keywords":["Afghanistan cricket team","Big Bash League","Cricket","Sport","Australia cricket team","Australia sport"],"creator":["Simon Burnton"],"video_url":null,"description":"Rashid threatens to withdraw services from Big Bash LeagueAustralia took stand because of Taliban’s treatment of womenAfghanistan’s most popular and successful cricketing export, Rashid Khan, has threatened to withdraw his services from Australia’s Big Bash League as a result of that country’s decision to abandon their forthcoming one-day international series against his country because of the Taliban’s treatment of women.Cricket Australia released a statement on Thursday saying it would not sanction the three games scheduled for the United Arab Emirates in March, as it was “committed to supporting growing the game for women and men around the world, including in Afghanistan”. It added that it would “continue to engage with the Afghanistan Cricket Board in anticipation of improved conditions for women and girls in the country”. Continue reading...","content":null,"pubDate":"2023-01-12 17:03:02","image_url":"https://i.guim.co.uk/img/media/0566fd8890bd5ff84bb55565534578a4d291a57a/197_40_1567_940/master/1567.jpg?width=460&quality=85&auto=format&fit=max&s=537d9a73c9d71a16cbf8727d955eee20","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"},{"title":"'Gritty knock': Twitter reacts as KL Rahul half century helps India to series win over Sri Lanka","link":"https://www.firstpost.com/firstcricket/sports-news/gritty-knock-twitter-reacts-as-kl-rahul-half-century-helps-india-to-series-win-over-sri-lanka-11977202.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"'Gritty knock': Twitter reacts as KL Rahul half century helps India to series win over Sri Lanka","content":"India recovered from a precarious 86-4 to beat Sri Lanka by four wickets and take the series in the second one-day international on Thursday.Lokesh Rahul led India with an unbeaten 64 after facing 103 balls. Kuldeep Yadav hit the winning boundary in the 44th over to give India 219-6 in reply to Sri Lanka’s 215 all out.“We thought it was a 280-300 wicket. But our bowlers did well to keep them to under 220,” Rahul said. “They put up a good fight and got breakthroughs. It wasn’t a wicket impossible to bat on, and we always try to find a way to win. Batting at No. 5 has helped me understand my game better.”India has an unassailable 2-0 lead with the last ODI scheduled for Sunday at Thiruvananthapuram.Earlier, Yadav picked 3-51 to help bowl out Sri Lanka — 102-1 at one point — with 10.2 overs to spare.Sri Lanka debutant Nuwanidu Fernando opened with a sedate maiden half-century before enduring a careless runout. He scored 50 off 63 balls.Watch: Hardik Pandya abuses players in dugout for not bringing waterFernando put on 73 runs for the second wicket with Kusal Mendis (34). But when Mendis was trapped by Yadav in the 17th over, Sri Lanka collapsed.Yadav also dismissed Charitha Asalanka (15) and bowled Dasun Shanaka (2) as Sri Lanka fell from 102-1 to 126-6 in 7.2 overs.Sri Lanka managed to cross 200 only thanks to Dunith Wellalage’s 32 off 34 balls.India made a horrible start to the chase when Sri Lanka’s pacers exploited the dewy conditions.Rohit Sharma was caught behind for 17. Shubman Gill was out for 21 to Lahiru Kumara, who also bowled Virat Kohli for 4.India was down to 62-3 and it became 86-4 when Shreyas Iyer (28) was out lbw to Kasun Rajitha.Rahul then built a partnership with Hardik Pandya (36) worth 75 runs for the fifth wicket.Despite Pandya’s dismissal, Rahul continued to hold the innings together, reaching his 11th half-century off 93 balls, including six fours.Axar Patel added 21 off 21 balls to accelerate India’s successful chase.Let’s take a look at how Twitter reacts to KL Rahul’s and Kuldeep Yadav’s series-winning performancesThis match winning inning should give @klrahul lots of confidence.— Irfan Pathan (@IrfanPathan) January 12, 2023#INDvSL #INDvsSL #KLRahulKL Rahul bhi Babar Azam se badhiya hai pic.twitter.com/Og7cqU5MuB— g0v!ñD $#@®mA (@rishu_1809) January 12, 2023KL Rahul at No. 5 in ODIs averages 54 with a SR of 102 with one and six 50+ scores. #INDvsSL— Jigar Mehta (@jigsactin) January 12, 2023When the market takes Test, play even an ODI like a Test and win#KLRahul #KLRahul #INDvsSL #Cricket— Stock Engineers (@StockEngineers_) January 12, 2023Thank You MSD you inspired KLR #INDvsSL #KLRahul pic.twitter.com/3uc87oAyB4— Kushagra (@4kushagra5) January 12, 2023Nind aa gayi BC.Thanks BKL! #INDvsSL— Mr.Professor (@iMrProfessor) January 12, 2023Today was that auspicious day when #KLRahul could play a test knock in an ODI match and save India from defeat #INDvsSL#TeamIndia #BCCI— Nirmal Jyothi (@majornirmal) January 12, 2023Thank God for Kuldeep, just think if we had Chahal instead of him coming into bat – Shami, Siraj & Umran with 20+ runs to get#INDvsSL #SLvsIND— Blunt 3.0 (@0_blunt2) January 12, 2023KL Rahul at number 5 in ODI:7(8), 80(52), 88*(64), 4(8), 112(113), 12(15), 76(66), 5(11), 62*(43), 7(18), 73(70), 14(28), 8(10), 39(29), 64*(103). pic.twitter.com/7Y2B0qfcD4— Johns. (@CricCrazyJohns) January 12, 2023A hard fought fifty for KL Rahul in his 5️⃣0️⃣th ODI match. need 2️⃣3️⃣ runs to take the series 2-0.: BCCI #PlayBold #TeamIndia #INDvSL pic.twitter.com/RHqCM4X725— Royal Challengers Bangalore (@RCBTweets) January 12, 2023 GRITTY KNOCK! KL Rahul has played a gem of a knock to steady the innings & orchestrate the run chase. He registered his 12th ODI fifty in the process! BCCI • #KLRahul #INDvSL #SLvIND #TeamIndia #BharatArmy pic.twitter.com/4YGIIWMYwJ— The Bharat Army (@thebharatarmy) January 12, 2023Ladka itna bura bhi nahi hai… #KLRahul #AthiyaShetty #EdenGardens #jadeja #Slvsind #ViratKohli #siraj #UmranMalik #aksharpatel #Gujarat pic.twitter.com/GtUmDi2fWn— Pruthvi patel (@Pruthvipatel98) January 12, 2023With 12 wickets in his last 6 matches – 10-0-38-2 8-0-39-1 9-0-49-1 4-1-18-4 10-1-53-1 and 10-0-51-3 today , Kuldeep Yadav should not be dropped in the name of combination. Needs as much game time as possible before the world cup. pic.twitter.com/fatZcx26k5— Venkatesh Prasad (@venkateshprasad) January 12, 2023Not sure what Kuldeep Yadav is trying to do here. Taking wickets?!? Each one pushes him closer to getting dropped for the next match.— Sorabh Pant (@hankypanty) January 12, 2023(With inputs from AP)","pubDate":"2023-01-12 16:58:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/KL-Rahul-India-vs-Sri-Lanka.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka 2nd ODI Highlights: भारत ने श्रीलंका को चार विकेट से हराकर सीरीज अपने नाम किया","link":"https://sports.ndtv.com/hindi/cricket/india-vs-sri-lanka-2nd-odi-live-cricket-score-commentary-3685349#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs SL 2nd ODI: कोलकाता में खेले गए दूसरे वनडे में भारत ने श्रीलंका को 4 विकेट से हराकर तीन मैचों की सीरीज में 2-0 से कब्जा कर लिया है. कुलदीप यादव को प्लेयर ऑफ द मैच का अवॉर्ड दिया गया.","content":"India vs Sri Lanka 2nd ODI Highlights: भारत ने गुरुवार को कोलकाता में खेले गए दूसरे वनडे (IND vs SL) में श्रीलंका को 4 विकेट से हरा दिया. टीम इंडिया ने 43.2 ओवर में 216 रनों के लक्ष्य को हासिल किया. जिसमें केएल राहुल ने 64 रनों की नाबाद पारी खेली. उनके अलावा हार्दिक पांड्या ने 36 रन बनाए. वहीं श्रीलंका के लिए लाहिरू कुमारा और चमिका करुणारत्ने ने दो-दो विकेट लिए. श्रीलंका ने पहले बल्लेबाजी करते हुए 215 रन बनाए थे. भारतीय गेंदबाजों ने 39.4 ओवर में श्रीलंकाई टीम को ऑल आउट कर किया था. नुवानिडू फर्नांडो ने अपनी टीम के लिए सबसे ज्यादा 50 रन की पारी खेली. जबकि भारत के लिए मोहम्मद सिराज और कुलदीप यादव ने तीन-तीन विकेट चटकाए. यादव ने कुसल मेंडिस, दासुन शनाका और चरिथ असलंका को आउट किया. सिराज ने अविष्का फर्नांडो, दुनिथ वेलालेज और लाहिरू कुमारा का शिकार किया. श्रीलंकाई कप्तान दासुन शनाका ने टॉस जीतकर पहले बैटिंग का फैसला किया था. इस जीत के साथ तीन मैचों की सीरीज में टीम इंडिया ने 2-0 से कब्जा कर लिया है. पहले वनडे में भारत ने श्रीलंका को 67 रन से हराया था.A victory by 4️⃣ wickets for #TeamIndia in the second #INDvSL ODI here in Kolkata and the series is sealed 2️⃣-0️⃣ ??Scorecard ▶️ https://t.co/jm3ulz5Yr1 @mastercardindia pic.twitter.com/f8HvDZRJIY— BCCI (@BCCI) January 12, 2023 भारत बनाम श्रीलंका, दूसरा वनडे स्कोरकार्ड दोनों टीमों के प्लेइंग 11 इस प्रकार रही:भारत XI: रोहित शर्मा (कप्तान), शुभमन गिल, विराट कोहली, श्रेयस अय्यर, केएल राहुल (विकेटकीपर), हार्दिक पांड्या, अक्षर पटेल, मोहम्मद शमी, कुलदीप यादव, उमरान मलिक, मोहम्मद सिराजश्रीलंका XI: अविष्का फर्नांडो, नुवानिडू फर्नांडो, कुसल मेंडिस (विकेटकीपर), चरिथ असलंका, धनंजया डी सिल्वा, दासुन शनाका (कप्तान), वानिंदु हसरंगा, चमिका करुणारत्ने, दुनिथ वेलालेज, लाहिरू कुमारा, कसुन राजिथाHere are the India vs Sri Lanka, 2nd ODI Highlights Cricket Score, Commentary From Eden Gardens, Kolkata","pubDate":"2023-01-12 16:33:24","image_url":"https://c.ndtvimg.com/2023-01/igql4pdo_kl-rahul-bcci_625x300_12_January_23.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket-Kuldeep, Siraj shine as India claim ODI series win over Sri Lanka","link":"https://www.thestar.com.my/sport/cricket/2023/01/13/cricket-kuldeep-siraj-shine-as-india-claim-odi-series-win-over-sri-lanka","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India's Kuldeep Yadav and Mohammed Siraj wreaked havoc with the ball as the hosts completed a four-wicket victory over Sri Lanka to triumph in the One-Day International series with a game to spare at Eden Gardens on Thursday. Read full story","content":null,"pubDate":"2023-01-12 16:25:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/13/1899477.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Australia pull out from Afghanistan ODI series, Rashid threatens BBL boycott","link":"https://economictimes.indiatimes.com/news/sports/australia-pull-out-from-afghanistan-odi-series-rashid-threatens-bbl-boycott/articleshow/96946483.cms","keywords":null,"creator":null,"video_url":null,"description":"Cricket Australia (CA) on Thursday decided to withdraw from the upcoming ODI series against Afghanistan due to Taliban's growing restrictions on women and girls in that country and in retaliation, ACB and star player Rashid Khan threatened to boycott the Big Bash League.","content":null,"pubDate":"2023-01-12 15:52:03","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-38404,resizemode-4,msid-96946483/australia-pull-out-from-afghanistan-odi-series-rashid-threatens-bbl-boycott.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"'उस दिन मैंने एक सबक सीखा..' PAK गेंदबाज को राहुल द्रविड़ से मिली करियर की सबसे बड़ी सीख","link":"https://sports.ndtv.com/hindi/cricket/pakistani-bowler-shahnawaz-dahani-got-the-biggest-lesson-of-his-career-from-rahul-dravid-says-i-learned-a-lesson-that-day-3684857#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"पाकिस्तान तेज गेंदबाज शाहनवाज दहानी (Shahnawaz Dahani) ने सोशल मीडिया पर एक पोस्ट शेयर किया है जो खूब वायरल हो रहा है","content":"पाकिस्तान तेज गेंदबाज शाहनवाज दहानी (Shahnawaz Dahani) ने सोशल मीडिया पर एक पोस्ट शेयर किया है जो खूब वायरल हो रहा है. दरअसल, 11 जनवरी को राहुल द्रविड़ (Rahul Dravid) का बर्थडे था, ऐसे में Shahnawaz Dahani ने सोशल मीडिया पर एक पोस्ट शेयर किया और द्रविड़ को लेकर एक खास खुलासा किया, जिसकी अब खूब चर्चा हो रही है. दहानी ने अपने पोस्ट में लिखा है कि द्रविड़ से उन्हें उनके करियर की सबसे बड़ी सीख मिली है. पाकिस्तानी गेंदबाज ने द्रविड़ के साथ अपनी तस्वीर शेयर की और उस खास तस्वीर के पीछे की कहानी भी बयां की है. पाकिस्तानी गेंदबाज ने तस्वीर शेयर कर कैप्शन में  लिखा, 'मैं विश्व कप के दौरान ब्रिस्बेन में कुछ दोस्तों के साथ डिनर कर रहा था, सर राहुल द्रविड़ भी उसी रेस्तरां में आए और उन्होंने मुझे देखा था, अपनी सीट सीट खोजने से पहले वो खुद मेरे पास आए और मुझसे और मेरे दोस्तों से प्यार मिले. हम लोगों ने उनके साथ तस्वीर खिंचवाई. जरा कल्पना कीजिए कि प्रतिद्वंद्वी टीम  के कोच आपको और आपके दोस्तों को नमस्ते कहने आते हैं. उस दिन मैंने एक सबक सीखा विनम्रता ही सफलता की कुंजी है' शाहनवाज दहानी के द्वारा किया गया यह पोस्ट सोशल मीडिया पर वायरल हो रहा है. फैन्स इस पोस्ट पर जमकर रिएक्ट भी कर रहे हैं. himself he came to me & met us all with lot of respect & love, we all got pictures with him. Just Imagine a Coach of a rival team & wall of cricket sir Rahul dravid comes to say hello to you & your friends.That day I learnt a lesson \"Humility is key to success\" #RahulDravid— Shahnawaz Dahani (@ShahnawazDahani) January 11, 2023शाहनवाज दहानी के करियर की बात की जाए तो इस गेंदबाज ने अबतक पाकिस्तान के लिए 2 वनडे और 11 टी-20 मैच खेले हैं. वनडे में उनके नाम 1 विकेट तो वहीं टी-20 इंटरनेशनल में दहानी ने 8 विकेट लिए हैं. इसके अलावा टी-20 क्रिकेट में ऑवरऑल दहानी के नाम अबतक 54 विकेट दर्ज है.  शाहनवाज दहानी भी पाकिस्तानी क्रिकेट के उभरते हुए गेंदबाज हैं. ये भी पढ़े- Video: मोहम्मद सिराज की गेंद बुलेट की रफ्तार से सीधे स्टंप में घुस गई, बल्लेबाज ने हाथ खड़ा कर दिया रोहित शर्मा ने बताया, क्यों शमी द्वारा शनाका को 'रन आउट' किए जाने के बाद वापस ली अपील और बनाने दिया शतकWatch: उमरान मलिक ने गोली की स्पीड से फेंकी गेंद, 156 KMPH की रफ्तार से बॉल फेंककर मचाया बवालस्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-01-12 15:50:43","image_url":"https://c.ndtvimg.com/2023-01/gjlg30mg_shahnawaz-dahani-with-rahul-dravid_625x300_12_January_23.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket-Former England batsman Ballance makes winning debut for Zimbabwe","link":"https://www.thestar.com.my/sport/cricket/2023/01/12/cricket-former-england-batsman-ballance-makes-winning-debut-for-zimbabwe","keywords":null,"creator":null,"video_url":null,"description":"HARARE (Reuters) - Former England batsman Gary Ballance contributed 30 runs on his international debut for Zimbabwe as they beat Ireland by five wickets on Thursday to win the opening Twenty20 international of their three-match series. Read full story","content":null,"pubDate":"2023-01-12 15:36:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/12/1899340.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka 2nd ODI HIGHLIGHTS: KL Rahul's half-century leads IND to 4-wicket win","link":"https://www.firstpost.com/firstcricket/sports-news/ind-vs-sl-2nd-odi-live-score-india-vs-sri-lanka-2023-latest-match-updates-live-streaming-tv-kolkata-11971602.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka 2nd ODI HIGHLIGHTS: KL Rahul's half-century leads IND to 4-wicket win","content":"21:49 (IST)India vs Sri Lanka Live:That's it from tonight's coverage folks! We will see you again in the third ODI on Sunday in Trivandrum. Till then, have a good time.21:35 (IST)India vs Sri Lanka Live:Kuldeep Yadav, player of the match |  I am happy with my performance. Since the last one year, I have been trying to back my strength and not think much. Whenever I get my chance, I just think about performing well. I am enjoying my bowling a lot. The team combination matters, so I just try to give my best whenever I get my chance. I bowl faster in the IPL and T20Is, also to give the batter one run. So I just did that here as well. I have worked on my batting a lot of late. Same with fitness. Whenever I get time, I go to the NCA. So thanks to the trainers there. That's one thing I have tried to do in last one year. Earlier, I wasn't much into it. Chahal too gave me inputs about their batters. We will have a bit of fun.21:28 (IST)Rohit Sharma, India captain | It was a close game but games like these teach you a lost. We had to build an innings under pressure. These guys have played under pressure quite a few times. KL has been batting at five for a long period of time now and it gives us the depth. Gives you confidence as well at the top of the order for us to go and bat freely. It was a good display of batsmanship. It'll be nice to have a left-hander, but I don't believe too much into it. The right-handers have got a lot of runs behind them in the last one year. We were not playing a lot of ODIs, so they got a lot of chance. Ideally we would like to have a left-hander, but we know the quality of the right-handers who are out there in the middle. They can tackle situations when put under pressure. We haven't thought about it yet (Changes for the final ODI). Once we get there we'll have a look at the pitch and have a look at some of our guys. There are 3 ODIs coming up against New Zealand as well, so we need to keep the guys fresh. We've got a long season now and we need to keep everything in mind. If needed, we'll make some changes.21:24 (IST)India vs Sri Lanka Live:Mohammed Siraj is gamechanger of the match for his brilliant spell of 3/30.  21:22 (IST)India vs Sri Lanka Live:Dasun Shanaka, Sri Lanka captain | Not enough runs on the board. We got a good start with the bat and then lost a few wickets. At the start, we discussed that it was a very flat deck. 300+ was the score to set, but Kuldeep bowled really well in the middle phase. Batsmen not getting starts is a big concern. We had a chance because the ball was moving. I asked the fast bowlers to stick to their basics.21:06 (IST)India vs Sri Lanka Live:The record for most defeats in ODIs has been broken. ODIs: 437 defeats for Sri Lanka (goes past India's 436 defeats) T20Is: 94 defeats for Sri Lanka21:00 (IST)India vs Sri Lanka Live:KL Rahul | I won't say it was a flat wicket, or it was doing a lot that it was impossible to bat, it was a sporty wicket. When Sri Lanka started, I thought it was a 280-300 wicket. But our bowlers bowled really well to keep them to 220-odd. But they put up a good fight, got early breakthroughs to put us under pressure. But I had a good partnership with Shreyas and Hardik and Axar as well. We always try to find a way to win, and it was nice to cross the line in the end.  In Guwahati, the openers put pressure on the opposition. Then your mindset is to attack, doesn't matter who is bowling (on a different approach against Hasaranga today).  Today we lost early wickets, so it was important to soak the pressure. If we are chasing 280-300, then we would attack him. But today there was no need. The good thing about batting at No. 5 is you don't have to rush. You can take a cold shower, have a nice meal, put your feet up, and watch the game. But I always think what the team needs of me. If you can read the situation when you go in, it helps you and team. Batting at No. 5 has helped me understand my game better. At No. 5 you have to face spin straightaway; I like the ball coming onto the bat but Rohit has been pretty clear that he wants me to bat at No. 5, so that's what I am trying to do. 20:53 (IST)India vs Sri Lanka Live:The openers Rohit Sharma and Shubman Gill had a brisk start, but were dismissed soon enough. Virat Kohli never got going and Shreyas Iyer had a stay similar to the openers. It was Hardik Pandya and KL Rahul who steadied the ship after a flurry of wickets and the latter continued till the end even after Pandya's dismissal. Axar Patel too continued to prove his worth with a small cameo and reduced the pressure with a couple of good shots. Towards the end, it was just a matter of time as India had too few runs to chase with too many balls available. Sri Lanka will have to introspect their batting and despite of the fact that they bowled well today, Dasun Shanaka might want to look at some of his decisions and bowling changes going ahead as they could have created more pressure when India were 4 wickets down.20:49 (IST)India vs Sri Lanka Live:43.2 Kuldeep Yadav plays a flat-batted shot down the ground and hits the winning runs, quite fittingly. He was the star in the first innings and has deservedly hit the winning runs. A hard-fought chase for India, didn't come as easy as it seemed initially, but they will be happy with the win.  A 10th ODI series win for India against Sri Lanka at home!20:44 (IST)India vs Sri Lanka Live:42.4 An inside edge and that has raced away to the boundary as the ball just passes besides the stumps.20:42 (IST)India vs Sri Lanka Live:42.2 Four for KL Rahul this time. A fuller delivery on the pads, Rahul flicks it towards the backward square leg. The practice pitches help him as the fielder dives to save the boundary but in vain.20:40 (IST)India vs Sri Lanka Live:41.6 Kuldeep Yadav gets a boundary to deep backward point now! Sri Lanka clearly don't know what to do. A short ball, he jumps and cuts it up and over backward point. India inching closer. India: 2013/6 after 42 overs20:37 (IST)India vs Sri Lanka Live:Sri Lankans have allowed some easy singles to Kuldeep Yadav. And KL Rahul has not been hesitant either to give the strike back to Kuldeep! India still have the margin of deliveries, but Sri Lanka are clearly running short of runs.20:30 (IST)India vs Sri Lanka Live:40.2 A single on the leg side and that will half-century for KL Rahul! 50 off 93 deliveries. That is also a no-ball. A close call but the bowler will have to pay. Kuldeep will take the strike.20:26 (IST)India vs Sri Lanka Live:39.5 Axar Patel is gone. A brilliant catch in the deep by Chamika Karunaratne. He has his tongue out in celebration. Axar tried to go over the top on off-side but found the fielder at long off. Sri Lanka are still alive, and one more wicket will bring them out of the ICU. Axar Patel c Chamika Karunaratne b Dhananjaya De Silva 21(21) India: 191/6 after 40 overs20:17 (IST)India vs Sri Lanka Live:There is no time for Dasun Shanaka to take it deep now. Does not make any sense to allow part-timer Dhananjaya De Silva an over. Maybe a burst from frontline seamers shall do the job on either side. India need 30 from 12 overs.20:16 (IST)India vs Sri Lanka Live:Axar Patel has certainly eased the pressure with multiple boundaries in the last over. 13 of that over and India need 31 off 74 deliveries now.20:12 (IST)India vs Sri Lanka Live:36.2 Karunaratne tries a short ball and Axar Patel is right on the money to pull that to the cow corner region for a maximum! That was quite slower as well giving Axar ample of time.20:10 (IST)India vs Sri Lanka Live:36.1 Axar Patel has found a gap on the off side, and timed his drive to perfection. That was too full from Karunaratne and Axar has guided that through cover and extra cover. That was a no-ball as well. So a free-hit as well!20:04 (IST)India vs Sri Lanka Live:India still need 51 runs from 90 deliveries. The chase is on, but Sri Lanka might just have a glimmer of hope with Hardik Pandya's wicket. Can they make a comeback here? They will need at least one wicket here to put pressure back on India. Wanindu Hasaranga in his final over. India: 165/5 after 35 overs19:58 (IST)India vs Sri Lanka Live:34.1 A wicket against the run of play for Sri Lanka and Chamika Karunaratne jumps in elation. Hardik Pandya is the batter to depart. Gets a thick edge to the wicket-keeper and Menids holds on to a dipping catch. Pandya went hard for a cover drive but didn't move his feet. Sri Lanka will now look to make a comeback. Hardik Pandya c Kusal Mendis b Karunaratne 36(53)19:53 (IST)32.3 Another shot timed in an exquisite manner by Hardik Pandya, that was travelling at a lightning pace, but the fielder in the deep on leg side makes an excellent dive and saves two runs for his side. A valiant fielding effort in the deep by Bhandara (sub fielder). 19:51 (IST)32.2 Poor line from Karunaratne and Hardik Pandya punishes. Flicks it away through square leg for four runs.19:43 (IST)India vs Sri Lanka Live:Time for some refreshments. Hardik Pandya and KL Rahul have played exceptionally well to keep going in a steady manner. On a track that seemed smooth to get going for the batters, the bowlers have been brilliant. And the Indian pair has defied their wishes to take on the bowlers and played a lot sensibly to keep India in hunt for the chase. India: 147/4 after 31 overs19:37 (IST)India vs Sri Lanka Live:Ajit Agarkar on commentary | Dasun Shanaka has to bring in fast bowlers. Karunaratne has bowled just four overs. Don't think his overs are going to get carried forward to the next game.19:35 (IST)India vs Sri Lanka Live:29.1 Dhananjaya De Silva welcomed with a boundary. That was a lot fuller, Hardik Pandya takes out a big stride and drives it beautifully through the covers. This is clinical batting from the Indian duo.19:31 (IST)India vs Sri Lanka Live:28.4 Fifty-run partnership for KL Rahul and Hardik Pandya - 86 deliveries to reach there. You don't often see so many delivery for these two to reach the partnership. That was bowled fuller from Lahiru Kumara and KL Rahul lofts it over mid-off for four runs. 19:26 (IST)India vs Sri Lanka Live:Lovely shot by KL Rahul. A little fuller from Hasaranga and he drives it through extra cover. The ball races away to the boundary.19:20 (IST)India vs Sri Lanka Live:Another good over from Wanindu Hasaranga. He has conceded just 14 runs from 6 overs. India: 126/4 after 26 overs.19:15 (IST)India vs Sri Lanka Live:24.3 A loud appeal from Dasun Shanaka as KL Rahul gets beaten but they choose against a review.19:09 (IST)India vs Sri Lanka Live:Skipper Dasun Shanaka comes into attack and has started the over with a couple of wides. Sri Lankans have already bowled nine wides in 23 overs. How costly would these wides prove in such a small run chase!19:03 (IST)India vs Sri Lanka Live:20.6 Drifting on the pads and Pandya flicks it through square leg. That was not aerial either and it raced away for four runs. Excellent shot from Hardik Pandya. That over shall break any nerves, if at all, getting on the Indian duo. India: 110/4 after 21 overs19:00 (IST)India vs Sri Lanka Live:20.4 A boundary after quite a while. Overs 11-20 didn't see a single boundary. A fullish delivery from Kasun Rajitha and Hardik Pandya has driven it beautifully down the ground, to the right of mid-off.18:56 (IST)India vs Sri Lanka Live:A slow run of play. Indian batters are taking no risk, playing down the ground consistently. Hardik was seen leaving even a few deliveries wherein he could have scored easily. Meanwhile, India have reached their 100 in the 20th over. A run rate of 5 is still enough for them to get through. Hardik Pandya and KL Rahul have to stay at the crease to keep things easy. India: 101/4 after 20 overs18:46 (IST)India vs Sri Lanka Live:Sri Lanka bowlers are testing the Indian batters hard. This is not going to be easy for India even if they win from here on. Just five runs in last three overs. India: 91/4 after 17 overs18:34 (IST)India vs Sri Lanka Live:Indian batters have not looked uncomfortable and have tried to dominate and establish authority with a flurry of boundaries, but the Sri Lankan bowlers have been excellent and the good deliveries have given them wickets.18:32 (IST)India vs Sri Lanka Live:14.2 An excellent delivery from Kasun Rajitha has caught Shreyas Iyer plumb! A full delivery - almost a yorker and Iyer misses it completely. The ball thuds on his front leg and seemed gone right from the moment. Iyer reviews it but the DRS shows \"Umpire's call\" on wickets. India now really in a spot of bother. Shreyas Iyer lbw b Kasun Rajitha 28 (33)  That will drinks break as well.18:26 (IST)India vs Sri Lanka Live:India slowed down a bit - just two runs in last two overs. However, they should not feel pressure with a couple of silent overs as the required rate is less than 4 runs per over. 18:19 (IST)Not short of action this evening. 12x4, 1x6 and 3 wickets in 10 overs. Really good cricket— Harsha Bhogle (@bhogleharsha) January 12, 202318:15 (IST)India vs Sri Lanka Live:10.3 Back-to-back boundaries for Shreyas Iyer through mid-wicket. Two short deliveries from Karunaratne and Iyer has pulled both of them quite well. The first one a lot flatter and played the second one in the air.18:12 (IST)India vs Sri Lanka Live:9.4 This is some serious battle going on between the two sides. KL Rahul gets a full delivery and drives it gloriously through the covers to get off the mark. Indian batters not holding back despite of the loss of wickets. But they must be feeling a bit of pressure. India: 67/3 after 10 overs18:10 (IST)India vs Sri Lanka Live:9.3 Bowled! Kohli's stumps are shattered and he can't believe it. Lahiru bowls it on good length, nipped back in sharply, the ball gets an inside edge of Kohli's blade and rattles the stumps. That's a rare sight of Kohli's stumps. He seemed a bit confused on that occasion. Virat Kohli 4 (9) b Lahiru Kumara18:08 (IST)India vs Sri Lanka Live:9.2 Virat Kohli finally gets off the mark. A beautiful pull shot through mid-wicket and gets four runs.18:06 (IST)India vs Sri Lanka Live:8.4 Sloppy work at third man position gives India a boundary. Iyer slashed hard at a wide delivery and the ball was easily in the reach of Wellalage but he slips on practice pitches, letting the ball pass through him. Iyer will pick four more runs - his third of the innings. Karunaratne is not happy and lets out a scream in frustration. India: 56/2 after 9 overs18:01 (IST)India vs Sri Lanka Live:7.4 A very lucky Shreyas Iyer! He tries to glance it on the leg side, but the ball gets a leading edge and takes the aerial route on the off side for a while - goes through the gap between backward point and covers and races away to the boundary. Lahiru has hands on his head. India: 52/2 after 8 overs17:56 (IST)India vs Sri Lanka Live:If not for two wides in the seventh over, it would have been a maiden for Chamika Karunaratne against Virat Kohli. India: 47/2 after 7 overs17:51 (IST)India vs Sri Lanka Live:5.5 Now Shreyas Iyer answers back with a beautiful cover drive. Excellent shot to get off the mark.  India: 45/2 after 6 overs17:50 (IST)India vs Sri Lanka Live:5.4 First ball Shreyas Iyer faces and the ball raps him on the pads. The Sri Lankans review as umpire does not adjudge in their favour. The ball was going over the stumps and Iyer will play. Sri Lanka lose their review.17:48 (IST)India vs Sri Lanka Live:5.3 After two back-to-back boundaries, Shubman Gill has been dismissed totally against the run of play. Length ball on off, Gill play short-arm jab pull but finds the man at short mid-wicket. Avishka Fernando reverse cups it. Shubman Gill c Avishka Fernando b Lahiru Kumara 21(12)17:45 (IST)India vs Sri Lanka Live:4.6 Rohit Sharma is gone! A good length delivery and he has edged on to the wicket-keeper. Easy wicket for Sri Lanka and Chamika Karunaratne is elated. Rohit tried to chase it without any foot movement. Rohit Sharma c Kusal Mendis b Chamika Karunaratne 17(21) Guess what, the Eden Gardens is lit up with the chant of 'Virat Virat'India vs Sri Lanka 2nd ODI preview: India will look to clinch the ongoing ODI series against Sri Lanka on Thursday in the second match at Kolkata. Having already won the first ODI of the three-match series by 67 runs, India on Thursday have an opportunity to take an unassailable 2-0 lead with a game to go.Meanwhile, Virat Kohli will be looking to break Sachin Tendulkar’s world record for the most ODI tons at home. Kohli made his 73rd international ton in the first ODI at Guwahati and equalled Tendulkar’s record of 20 ODI tons at home. Another century at Kolkata will help Kohli take the lead in the elite list. Kohli now has 45 ODI tons and is only four behind Tendulkar’s world-record tally of 49 in the 50-over format.Apart from Kohli, Rohit Sharma and Shubman Gill also scored fifties in Guwahati and the top-order’s terrific performance helped India post a winning total of 373/7. They will look to continue the good form. In the middle-order, Shreyas Iyer and KL Rahul failed to convert the starts and their focus will be on making the most of any opportunity they get as India are also in the process to fine-tune their squad for the 2023 ODI World Cup.In the absence of injured Jaspirt Bumrah, Mohammed Siraj and Umran Malik spearheaded India’s pace bowling department with five wickets among them. Mohammed Shami took one but went for 67 runs in nine overs. Spinners Yuzvendra Chahal and Axar Patel together took one wicket on a flat pitch in Guwahati which also offered the challenge of dew for the bowlers. Overall, the bowlers will look to better their performance.Sri Lanka skipper Dasun Shanaka was their best batter in the first ODI as he struck 108 not out off 88 balls and helped his team score 306. But that proved insufficient and he will be looking for more support from other batters. Apart from Shanaka, Pathum Nissanka (72) and Dhananjaya de Silva (40) were the other standout batters for the visitors. It’s the bowling however where they need to improve the most.The match will start at 1.30 PM IST and will be shown live on the Star Sports network and Disney+ Hotstar app.Squads:India: Rohit Sharma (c), Hardik Pandya (vc), Shubman Gill, Virat Kohli, Suryakumar Yadav, Shreyas Iyer, KL Rahul (wk), Ishan Kishan (wk), Washington Sundar, Yuzvendra Chahal, Kuldeep Yadav, Axar Patel, Mohammed Shami, Mohammed Siraj, Umran Malik and Arshdeep Singh.Sri Lanka: Dasun Shanaka (c), Kusal Mendis (vc), Pathum Nissanka, Avishka Fernando, Sadeera Samarawickrama, Charith Asalanka, Dhananjaya de Silva, Wanindu Hasaranga, Ashen Bandara, Maheesh Theekshana, Chamika Karunaratne, Dilshan Madushanka, Kasun Rajitha, Nuwanidu Fernando (ODIs), Dunith Wellalage, Pramod Madushan, Lahiru KumaraRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-12 15:34:46","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/IND-vs-SL-2nd-ODI-LIVE.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Namibia: Kunene Erecting Cricket Facilities","link":"https://allafrica.com/stories/202301120308.html","keywords":null,"creator":["Namibian"],"video_url":null,"description":"[Namibian] THE construction of the first cricket facilities in the Kunene region is underway at Outjo, says Kunene Cricket Namibia development officer Wilhelm Tuhafeni.","content":"THE construction of the first cricket facilities in the Kunene region is underway at Outjo, says Kunene Cricket Namibia development officer Wilhelm Tuhafeni. Tuhafeni said construction of the facilities started on Thursday, 5 January, inside the Etoshapoort Stadium. The building project, sponsored by Standard Bank Namibia, is expected to be completed by March. \"The facilities will include cricket nets for both boys and girls,\" said Tuhafeni, who could not disclose the cost of the facilities as construction is still underway. Tuhafeni is hopeful that more businesses will come on board to help with sport infrastructure development throughout the region. The central plan for this year is to strengthen the existing programmes around the region, he said. \"We also want to grow our participation, therefore, we will be reaching out to areas outside Opuwo and develop the programme,\" said Tuhafeni. The former cricketer also noted that interest in the sport is growing, with children joining the Kwata Cricket programme daily. Their motivation stems from realising there is an opportunity to make a living through cricket, Tuhafeni said. The initiative was introduced in 2014 and has gotten over 13 000 children playing cricket, with the Kunene region having produced six u12 and u13 national players since its inception, he said. \"We are happy for the support we received from schools throughout the region and that's encouraging. We also provide teachers with new coaching skills and information, so that we can provide new activities to children,\" Tuhafeni said.","pubDate":"2023-01-12 14:51:14","image_url":null,"source_id":"allafrica","country":["tanzania"],"category":["sports"],"language":"english"}]}