{"newsArray":[{"title":"Hasnain hopes to get back to international cricket","link":"https://www.thenews.com.pk/print/968634-hasnain-hopes-to-get-back-to-international-cricket","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Pakistan’s fast bowler Mohammad Hasnain expressed his confidence that after getting permission to bowl again he would soon be back in action.Talking to media in Lahore, Hasnain said that the modified bowling action created no trouble for him and he would again be at his very best. He...","content":null,"pubDate":"2022-06-24 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Cricket-Australia retain Maxwell as Head cover for Sri Lanka tests","link":"https://www.thestar.com.my/sport/cricket/2022/06/24/cricket-australia-retain-maxwell-as-head-cover-for-sri-lanka-tests","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - Australia all-rounder Glenn Maxwell will stay in Sri Lanka for the upcoming test series as injury cover for middle order batsman Travis Head, who has a minor hamstring strain. Read full story","content":"SYDNEY (Reuters) - Australia all-rounder Glenn Maxwell will stay in Sri Lanka for the upcoming test series as injury cover for middle order batsman Travis Head, who has a minor hamstring strain. Maxwell was already in the country for two limited overs series, which conclude with the fifth one-day international in Colombo later on Friday. The 33-year-old, famous for his powerful batting in the white ball game, played the last of his seven tests against Bangladesh five years ago. Head, who scored two centuries in the Ashes series around the new year, was ruled out of the final ODI after sustaining the injury in the fourth match, which Sri Lanka won to seal the series. \"It's a bit more of a precaution, especially with where he fields,\" limited overs skipper Aaron Finch said on Thursday. \"He fields in the outfield and the ground is quite heavy. I'm not sure what he'll be like for the tests but he's definitely not available for tomorrow.\" Australia have suffered a series of injury blows in Sri Lanka with batsman Steve Smith, fast bowler Mitchell Starc and all-rounder Ashton Agar among those also on the injury list. Fortunately, Cricket Australia took test, Twenty20, ODI and \"A\" squads on the tour so have plenty of players on hand to call up. Spin bowlers Jon Holland, Matthew Kuhnemann and Todd Murphy will also stay in Sri Lanka after the \"A\" tour concludes to \"assist the test match preparations and to develop their experience in subcontinent conditions\", Cricket Australia said. The first of two tests in Galle begins next Wednesday. (Reporting by Nick Mulvenney; Editing by Shri Navaratnam)","pubDate":"2022-06-24 00:23:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/06/24/1634239.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket world in disbelief over freak dismissal: 'Never seen that'","link":"https://au.sports.yahoo.com/cricket-2022-disbelief-freak-henry-nicholls-dismissal-223718337.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-06-23 22:37:18","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/865ab520-f344-11ec-bfd7-44d3bf7bc26a","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Is this the unluckiest dismissal in Test cricket history?","link":"https://www.theage.com.au/sport/cricket/is-this-the-unluckiest-dismissal-in-test-cricket-history-20220624-p5aw9u.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["AP"],"video_url":null,"description":"Kiwi batsman Henry Nicholls couldn’t believe his misfortune when his straight drive careered into the outstretched bat of Daryl Mitchell at the non-striker’s end.","content":"Leeds: One of the most bizarre dismissals in cricket history was followed by an all-too-familiar counter-attack by Daryl Mitchell and Tom Blundell as New Zealand eked out 5/225 on day one of the third Test against England on Thursday. Henry Nicholls couldn’t believe his misfortune when his straight drive careered into the outstretched bat of Mitchell, who was attempting to take evasive action at the non-striker’s end, and rebounded all the way across to mid-off where Alex Lees was alert enough to take the catch. There were looks of bewilderment across the faces of England’s players — notably Jack Leach, who claimed his second wicket of the day — as Nicholls trudged off for 19 and with New Zealand stuttering on 5/123 at tea at Headingley. That, however, brought together Blundell and Mitchell, who have shared partnerships of 195 and 236 already in this three-match series in which England holds an unassailable 2-0 lead. They put on an unbroken sixth-wicket stand of 102 to be there at stumps, giving the tourists renewed hope of a consolation victory. Blundell was on 45 while Mitchell was on 78 and closing in on his third century of the series. Mitchell capitalised on being given a life — when on 8 — by England captain Ben Stokes, who chose not to review when the New Zealand batter was trapped shin-height in front of the stumps from a full delivery by Matthew Potts that swung in. Henry Nicholls trudges off at Headingley after his bizarre dismissal. Credit: Getty Had Stokes made the signal, Mitchell would have been on his way and the tourists would have been 5/97 and without their best player over the past month. Stuart Broad set the tone for an impressive bowling performance by England, ending the day with figures of 2-45 off his 17 overs as the pacer relished the responsibility of being the senior man in England’s attack without fellow veteran Jimmy Anderson. After New Zealand won the toss, Broad removed Tom Latham for a duck off the sixth ball of the day and got another edge to remove Kane Williamson for 31 before lunch. Between those wickets, the first ball of Leach’s left-arm spin drifted and straightened up, trapping Will Young lbw for 20. Henry Nicholls’ drive catches the bat of teammate Daryl Mitchell on Thursday. Credit: Getty New Zealand had plenty of work to do at 3/65 at lunch, but Devon Conway (26) had only got started when he dragged a seaming delivery from debutant Jamie Overton onto his stumps with a loose drive. Overton was applauded from the balcony by twin brother Craig, who was edged out of the starting team but came on briefly as a substitute fielder early in the day to ensure the siblings were out there at the same time for an over or two. “We used to talk about this as kids — playing Test match cricket is the ultimate goal,” Jamie Overton said. “He was delighted for me.” Potts was looking to elbow his way into the story but was unlucky to see a pair of lbw shouts waved away. The first, against Nicholls on 4, was turned down on review as the slim possibility of inside edge could not be ruled out. Then came the costly second, against Mitchell, which Stokes refused to look at. Mitchell made England pay as he played with the same energy he has shown since touching down in England, sweeping and pulling well before the second of two spiralling sixes off Leach took him past 50. Meanwhile, Stokes stayed mysteriously out of the attack, perhaps to save energy with the series won and with a one-off Test against India coming up next week. AP Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2022-06-23 22:30:00","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Test door opens big time for Maxy","link":"https://www.cairnspost.com.au/sport/cricket/test-batsman-travis-head-has-suffered-a-hamstring-injury-less-than-a-week-before-the-first-match-in-galle/news-story/a817f2b3ea07b4351a37dae876514d5d","keywords":["Breaking News","Cricket news and galleries","National Breaking News","Network News","NewsWire","Sport news and galleries"],"creator":null,"video_url":null,"description":"Glenn Maxwell always thought his best chance of playing Test cricket again was in Asia and he’s on the verge of making that dream come true.","content":"Glenn Maxwell always thought his best chance of playing Test cricket again was in Asia and he’s on the verge of making that dream come true. After five years in the Test wilderness, the Victorian has been called into the Australian squad in Sri Lanka after Travis Head was sidelined by a hamstring strain that has put him under a cloud for the opening Test that begins next Wednesday. Head suffered the minor injury while fielding in the fourth one-day international and was ruled out of the fifth and final clash by captain Aaron Finch, who didn’t know if Head would be ready for the Test. All seven of Maxwell’s Tests, the last of which was played in 2017, have been on the subcontinent, including his only century in India in 2017. With Steve Smith still overcoming a quad issue, although he is expected to play, Maxwell has been added to a squad that only has one back-up batter, reserve keeper Josh Inglis. Watch Australia’s Tour of Sri Lanka. Every T20, ODI and Test Match Live & On-Demand on Kayo. New to Kayo? Try 14-Days Free Now > Maxwell, in Sri Lanka with the ODI and T20 squads, was chosen ahead of Marcus Harris, Nic Maddinson, Matt Renshaw and even all-rounder Mitch Marsh who were also in the country. Spinners Matt Kuhnemann, Jon Holland and rookie Todd Murphy will also stay in Sri Lanka at the end of the Australia A series to bulk up the Test squad’s spin stocks. Head’s injury was thought to be a result of a large fielding workload on grounds players have reported as being very heavy, with the outfielder covering more than 26km in the two games he played, with nearly half of that running. Australia's Travis Head has been doing a lot of fielding in Sri Lanka. Picture: Ishara S. Kodikara / AFP While Finch said the injury was only minor, Head’s Test availability remains unknown. “It’s a bit more of a precaution, especially where he fields,” Finch said of Head’s omission for the dead rubber fifth one-dayer. “He fields in the outfield and the ground is quite heavy and he does a lot of Ks. “I’m not sure what he’ll be like for the Tests, but he’s definitely not available for tomorrow.” Smith was also rested from the final two ODIs after hurting his quad but has been batting in the nets, facing fast bowler Mitchell Starc who should be ready for the Tests after having stitches in his index finger removed. Steve Smith is back batting in the nets. Picture: Ishara S. Kodikara / AFP Finch said the big quick’s wound hadn’t healed “100 per cent” to get him some game time in the final ODI of a five-match series the skipper was disappointed to lose. He put the issue down to batters not forming partnerships on spinning wickets that favoured the local bowlers, conditions not too dissimilar to the ones the Aussies will face in next year’s 50-over World Cup in India. “We’re disappointed with the series not being on the line still,” Finch said. “The reality is we have been in every game; with the bat we’ve had opportunities to chase down some reasonable totals and we didn’t take then. “There’s been times when we feel the game has just skipped away from us but through low-risk cricket, which is quite strange. The game seems to be going in a direction then you lose quick wickets. “When the middle order get starts in every game, it shows the wickets are OK to bat on. But we haven’t maximised those partnerships.” Originally published as Glenn Maxwell called into Test squad in Sri Lanka with Travis Head sidelined by injury More related stories Cricket ‘Never seen anything like it’: Cricket in shock Henry Nicholls must have upset the cricket gods to be delivered a piece of misfortune so unlucky that nobody watching could believe it. Read more Cricket Maxwell back in Aussie Test squad after 5 years After five years in the wilderness, Glenn Maxwell may wear the baggy green following Australia’s huge call to include him in the Test squad. Read more","pubDate":"2022-06-23 22:01:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Never seen anything like it’: Cricket in shock","link":"https://www.cairnspost.com.au/sport/cricket/what-on-earth-cricket-world-cant-believe-unluckiest-dismissal-ever/news-story/1d9eb655dc116cf6e165f8f9ef95a7e7","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"England’s Jack Leach was left reflecting on a “silly game” after capturing the wicket of Henry Nicholls in bizarre fashion on the opening day of the third Test against New Zealand at Headingley.","content":null,"pubDate":"2022-06-23 21:53:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"England benefit from the unluckiest dismissal of all-time?","link":"https://www.cairnspost.com.au/sport/cricket/england-benefit-from-the-unluckiest-dismissal-of-alltime/video/38b08d1964f6eeec7be9780cfdd0f221","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Henry Nicholls had a right to feel hard done by when he was dismissed by Jack Leach in the unluckiest of ways.","content":null,"pubDate":"2022-06-23 21:27:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket Australia's bombshell move on David Warner leadership ban","link":"https://au.sports.yahoo.com/cricket-2022-david-warner-bombshell-move-leadership-ban-205910013.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-06-23 20:59:10","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/c0af72f0-f336-11ec-be65-7a0a0d9af9f1","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Jack Leach’s lucky England wicket showcases randomness of Test cricket - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMic2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2p1bi8yMy9qYWNrLWxlYWNocy1sdWNreS1lbmdsYW5kLXdpY2tldC1zaG93Y2FzZXMtcmFuZG9tbmVzcy1vZi10ZXN0LWNyaWNrZXTSAXNodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvMjAyMi9qdW4vMjMvamFjay1sZWFjaHMtbHVja3ktZW5nbGFuZC13aWNrZXQtc2hvd2Nhc2VzLXJhbmRvbW5lc3Mtb2YtdGVzdC1jcmlja2V0?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Jack Leach’s lucky England wicket showcases randomness of Test cricket  The GuardianHow's it got there! | Bizarre catch dismissal as ball hits Mitchell #shorts #funnymoments  England & Wales Cricket BoardMitchell and Blundell lead New Zealand fightback  Reuters.comEngland v New Zealand: third Test, day one – as it happened  The GuardianWhy England's controlled aggression in the field suggests they are a side on the up  The TelegraphView Full coverage on Google News","content":null,"pubDate":"2022-06-23 19:54:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IND vs Ireland practice match: Warm up match India vs Ireland full list with date and time","link":"https://thesportsrush.com/cricket-news-ind-vs-ireland-practice-match-warm-up-match-india-vs-ireland-full-list-with-date-and-time/","keywords":["Cricket","India tour of Ireland 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IND vs Ireland practice match: Team India is scheduled to play a two-match away T20I series against Ireland beginning June 26. Flamboyant all-rounder Hardik Pandya is all set make his international captaincy debut for team India as they are slated to take on Ireland for a two-match T20I series, on June 26 and June 28… The post IND vs Ireland practice match: Warm up match India vs Ireland full list with date and time appeared first on The SportsRush.","content":"IND vs Ireland practice match: Team India is scheduled to play a two-match away T20I series against Ireland beginning June 26. Flamboyant all-rounder Hardik Pandya is all set make his international captaincy debut for team India as they are slated to take on Ireland for a two-match T20I series, on June 26 and June 28 in Dublin. The 17-member team India squad is devoid of their experienced Test match regulars, but does included some of the experienced T20 stars, including a return back of Sanju Samson, and a maiden call-up for 31-year-old Rahul Tripathi. While the rest of the squad features maximum of them from the ones that recently played the five-match T20I series against South Africa, Suryakumar Yadav marks his return back to the side after injury, with the two pacers in Arshdeep Singh and Umran Malik too yet to earn their debut caps. Ireland, on the other hand have named a 14-member squad for the stern Indian challenge with the experienced Andrew Balbirnie set to lead the side. The squad also marks the inclusion of the uncapped duo of batter Stephen Doheny and pacer Conor Olphert, based on their recent good run of form in club Cricket. What a proud moment to see @hardikpandya7 ‘s hard work and determination paying off as he has been named India captain. From a 5yrold who used to train at my academy in Baroda to captaining India, what a fantastic journey. Hardwork you put in to make a return deserves applause pic.twitter.com/PiHNpaWFLW — Kiran More (@JockMore) June 15, 2022 Team India’s short tour of Ireland would commence with the two T20Is right away, with no practice matches scheduled to precede them. In fact, the players in the squad were allowed to fly back to their respective homes post the South Africa series to spend some time with their families owing to non-stop Cricket they have been playing since this year’s IPL. After the completion of the two T20Is against Ireland, maximum players from this T20I squad would fly to the UK for the two T20 warm-up matches which will coincide with team India’s rescheduled 5th Test match against England beginning July 1. These two matches would take place against Derbyshire and Northamptonshire on July 1 and July 3 respectively.","pubDate":"2022-06-23 19:14:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"\"If you can't accept rules, stop playing cricket!\"- Furious fans slam N Jagadeesan for flashing 'middle finger' after being run-out in TNPL 2022","link":"https://www.sportskeeda.com/cricket/news-tnpl-2022-if-accept-rules-stop-playing-cricket-furious-fans-slam-n-jagadeesan-flashing-middle-finger-run-out?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Anuj Nitin Prabhu"],"video_url":null,"description":null,"content":"The Tamil Nadu Premier League (TNPL) 2022 got off to a fiery start with the clash between Chepauk Super Gillies and Nellai Royal Kings on Thursday, June 23. Two Tamil Nadu stars, Baba Aparajith and N Jagadeesan , engaged in a heated exchange. Aparajith ran out Jagadeesan at the non-striker's end as the latter backed up too much. Even though the bowler was well within his rights to whip the bails off, Jagadeesan wasn't a happy man. He showed his middle finger multiple times before walking back furious into the dugout. Fans on Twitter slammed N Jagadeesan for showing his frustration despite being run out fair and square. They felt Aparajith was well within his rights to run him out. The off-spinner had pulled out of his run-up once to give Jagadeesan an indirect warning. Here are some of the reactions: The TNPL 2022 opener between the Nallai Royal Kings (NRK) and the Chepauk Super Gillies (CSG) produced a thrilling finish. The game went right down to a Super Over. Batting first, NRK were in deep trouble at 27/3 at one stage. However, L Suryaprakash and Sanjay Yadav got together and steadied the ship. While Suryaprakash played second-fiddle, Yadav played an incredible knock of 87* off just 47 balls. His stunning innings took his team to 184/4 in their 20 overs. In reply, CSG skipper Kaushik Gandhi held the fort from one end. However, wickets tumbled from the other end and the game got really interesting towards the end. Harish Kumar played a fantastic cameo to take the game to the Super Over. N Jagadeesan got another chance to bat and pumped a six straight down the ground. However, his team scored just nine runs and that wasn't really going to challenge NRK as they registered their first points of the season. Interested in sports other than cricket? Find more details here Q. 0 votes so far","pubDate":"2022-06-23 19:12:09","image_url":"https://static.sportskeeda.com/editor/2022/06/3317e-16560071772407-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Jack Leach’s lucky England wicket showcases randomness of Test cricket | Jonathan Liew","link":"https://www.theguardian.com/sport/2022/jun/23/jack-leachs-lucky-england-wicket-showcases-randomness-of-test-cricket","keywords":["England v New Zealand 2022","England cricket team","New Zealand cricket team","Cricket","Sport"],"creator":["Jonathan Liew at Clean Slate Headingley"],"video_url":null,"description":"Nicholls’s dismissal happened for no reason but the fluke would not have stood out in the artificial shorter formatsIt was shortly before tea at a clammy, claustrophobic Headingley when Jack Leach stepped up to bowl the final over of the session. After a promising start Leach had begun to lose the thread a little, and so had England.Henry Nicholls had dropped anchor for 98 balls; Daryl Mitchell had simply picked up where he left off at Lord’s and Nottingham; the partnership between them had lasted 20 overs and was slowly squeezing the air out of the day. Continue reading...","content":"I t was shortly before tea at a clammy, claustrophobic Headingley when Jack Leach stepped up to bowl the final over of the session. After a promising start Leach had begun to lose the thread a little, and so had England. Henry Nicholls had dropped anchor for 98 balls; Daryl Mitchell had simply picked up where he left off at Lord’s and Nottingham; the partnership between them had lasted 20 overs and was slowly squeezing the air out of the day . New Zealand’s Mitchell and Blundell hold up England’s charge in Third Test Read more By now, you’ve probably seen what happened next. In a way, the virality of the moment – the way social media can beam it to a billion mobile devices within a matter of seconds – quickly eroded its effect. The thunderous straight drive by Nicholls, the evasive squirm by Mitchell at the other end, the looping deflection off his hanging bat, the simple catch by a disbelieving Alex Lees: as with all content, watch it enough times and before long it all begins to feel a little inevitable, almost predestined. The closest parallel, perhaps, was with the freak boundary off Ben Stokes’s bat in the final over of the 2019 World Cup final . Of course, that won England a World Cup, whereas the stakes here were on a different scale entirely. Indeed, given that Nicholls’s dismissal simply brought in Tom Blundell, who insouciantly accompanied Mitchell to stumps and hauled New Zealand back into the game, you might argue it barely affected the course of the match at all. And yet for the spectators at Headingley on Thursday you suspect it will be the passage of play they remember above all others; the one they will discuss around the dinner table; the one they will recount in years to come. For Leach, coming into this game short of form and nursing a poor record against left-handers, it may prove a quietly pivotal moment. For Nicholls, too, trying to bat himself back into nick after missing the Lord’s Test with Covid, it was the sort of spectacular injustice upon which entire careers can change direction. What on earth!? 😅🙈 Scorecard/clips: https://t.co/AIVHwaRwQv 🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvNZ 🇳🇿 pic.twitter.com/yb41LrnDr9 — England Cricket (@englandcricket) June 23, 2022 The moment itself largely defies analysis. On the television commentary Nasser Hussain gamely tried to explain the wicket as the product of a Stokes field change just a few balls earlier, bringing long-on up to save the single and encouraging Nicholls to go over the top. Which, while intuitively plausible, is a bit like trying to explain the phenomenon of Jesus walking on water in terms of non-Newtonian fluid viscosity and shear stress. There are times when you just have to sit back and let the bafflement wash over you. So, the deflection. As the ball whistles towards him, umpire Richard Kettleborough takes desperate evasive action. Mitchell does the same, and yet by some kind of irrepressible muscle memory, he still manages to meet the ball with the middle of his bat. That’s how well Mitchell is playing at the moment: he can middle the ball even when he’s trying to avoid it entirely. Had it struck literally anything else – the edge of the bat, the toe, the handle, the glove, Mitchell himself – there is no conceivable way it could have flown 25 yards through the air for Lees to catch. Daryl Mitchell’s unfortunate deflection resulted in Nicholls’s demise. Photograph: Mike Egerton/PA Earlier this week the organisers of the Caribbean Premier League announced a new short-form tournament called The 6ixty, to begin later this year. Accompanying the launch was an explanatory video, filmed by Chris Gayle with all the dead-eyed energy of a man trying to flog diet supplements on cable TV at 4am. Gayle dolefully talked us through the rules of the new competition. Sixty balls. Six wickets per team. A bonus Powerplay over for sides who hit two sixes in the first 12 balls. A “mystery free hit”, the timing of which will be decided by a live online vote. A quick-fire general knowledge round. A sexy hideaway fitted with infrared cameras. Live panthers. On first glance, the 6ixty feels like another empty cricketing gimmick: a further blurring of the line between sport and game show. But the really interesting part is how desperately it strives to manufacture the randomness that five-day cricket incorporates naturally. In a way, this is the paradox of short-form cricket: as the format contracts and the range of possible outcomes narrows, it increasingly needs to generate artificial chaos in order to avoid becoming formulaic. The Spin: sign up and get our weekly cricket email. Of course, Nicholls’s dismissal might just as easily have occurred in a Twenty20 or a Ten10. But it wouldn’t have had the same startling effect. It would, instead, have felt like a mere extension of the product: simply the latest in a string of outlandish events. This is the problem with constructing a sporting universe in which supposedly miraculous feats occur every other ball: when the real miracles, happen, they’re much harder to spot. Which is why, on a slow and taut day in Leeds, in the 2,467th men’s Test match, a single flukish deflection felt so special. It wasn’t the result of a grand masterplan. It wasn’t written into the rules. It wasn’t voted into existence by television viewers. It happened for no reason, and if you watch Test cricket until your dying day you might never see it happen again. Here, perhaps, was the real moral: if you want something to appear out of nothing, you need to let nothing happen in the first place.","pubDate":"2022-06-23 18:45:41","image_url":"https://i.guim.co.uk/img/media/9255c7873dc5c840ed7c12c1484a20a6d78ae93c/0_108_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=b6c2b3d54d046259a8556d825a013177","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Live Score India vs Leicestershire 4-Day Warm Up Match Day 1 Live Updates: KS Bharat Star For India On A Gloo - Cricket Country News","link":"https://news.google.com/__i/rss/rd/articles/CBMi4gFodHRwczovL3d3dy5jcmlja2V0Y291bnRyeS5jb20vbmV3cy9saXZlLXNjb3JlLWluZGlhLXZzLWxlaWNlc3RlcnNoaXJlLWxpdmUtc2NvcmUtbGl2ZS1zdHJlYW1pbmctY3JpY2tldC1pbmQtdnMtbGVpYy11cGRhdGVzLXdhcm0tdXAtbWF0Y2gtZGF5LTEtb24taG90c3Rhci1zdHJlYW0tbGl2ZS1jcmlja2V0LW1hdGNoLXZpcmF0LWtvaGxpLWtzLWJoYXJhdC1qYXNwcml0LWJ1bXJhaC0xMDI3ODEz0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Live Score India vs Leicestershire 4-Day Warm Up Match Day 1 Live Updates: KS Bharat Star For India On A Gloo  Cricket Country NewsIndia vs Leicestershire Live Streaming And Live Telecast Details: When And Where To Watch India's Practice Match Live In Your Country?  Cricket AddictorIndia vs Leicestershire, Tour Match, Day 1 Highlights: KS Bharat The Saviour As India Reach 246/8, K..  NDTV SportsPant, Pujara and Bumrah to represent Leicestershire in warm-up fixture | Cricbuzz.com - Cricbuzz  CricbuzzENG VS IND: Virat Kohli Tries To Balance His Willow Just Like Joe Root In England, Video Goes Viral  The twelfth Man TimesView Full coverage on Google News","content":null,"pubDate":"2022-06-23 18:27:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Jamie Overton: England Test debut a special moment for family","link":"https://www.skysports.com/cricket/news/12040/12639352/jamie-overton-england-test-debut-a-special-moment-for-family-simon-doull-new-zealand-still-in-the-fight","keywords":null,"creator":null,"video_url":null,"description":"England debutant Jamie Overton admitted it was a special day for himself and his family as he was presented with his cap by twin brother Craig and he hopes they will have the chance to play Test cricket together in the future.","content":"Last Updated: 23/06/22 9:02pm England debutant Jamie Overton admitted it was a special day for himself and his family as he was presented with his cap by twin brother Craig and he hopes they will have the chance to play Test cricket together in the future. After being brought into the England squad for the third Test against New Zealand in place of the injured Jimmy Anderson, Overton was chosen to step up and made it count, claiming his first Test wicket when he bowled Devon Conway after lunch at Headingley. Overton, 28, who finished the day with figures of 1-41, revealed the wicket helped to settle his nerves and the next goal is to play in a Test match alongside his twin brother, who has made eight Test appearances for England but missed out on a starting place after being named in the original squad. \"Craig has obviously played a few Test matches and it would have been nice to play together, but to get that [cap] off Craig was a very special moment and hopefully we have got a few more games together,\" said Overton. Please use Chrome browser for a more accessible video player \"We have always wanted to play cricket together and Test cricket was the main goal. \"It would have been nice to play together, it was actually between us who was going to play, but he was delighted for me that I was going to get the go. \"The whole way through our careers there has always been that one spot and it has always been between us two. \"Craig got his go before me and then I sort of caught up so it was nice I could kind of catch up with him. \"We didn't play a lot in the backyard because we broke a lot of bats and a lot of windows.\" The Surrey man was pleased with how the first day panned out and is hoping to claim more wickets as England look to break Daryll Mitchell and Tom Blundell's unbroken 102-run partnership, which lifted New Zealand to 225-5 at stumps, in the opening session of day two. Please use Chrome browser for a more accessible video player \"Yes, it has been a good day,\" he said. \"I am a bit tired now but it has been a good day and hopefully we can get a few wickets early tomorrow morning. \"I was a little bit nervous, the slope got me a little bit by surprise. \"I bowled earlier in the week and it felt alright over that side over that hill but there is more of a ridge than you think. \"So the first couple of overs was just getting used to it then settled and felt good rhythms. \"I think the batters are just a higher level, a higher quality. June 24, 2022, 10:15am Live on \"You have got to be on the ball the whole time and if you bowl a bad ball it gets hit for four, whereas in county cricket you can potentially get away with that. \"Overall, I felt like I had a good day.\" Despite an impressive bowling performance by England, Sky Sports' Simon Doull believes New Zealand are still very much in the contest after Blundell and Mitchell put together their third 100 partnership across the three Tests. Please use Chrome browser for a more accessible video player \"I think it is England's day but I don't think it is a 70/30 day,\" said Doull. \"New Zealand's fightback at the end, they just can't seem to get Daryll and Tom out, this partnership is quite incredible. \"It has thwarted England time and time again. \"If New Zealand can work their way from here to 350, I think it is decent batting first. \"England will want those five wickets in the morning, maybe before lunch and 270 or 280 then they are well and truly into the game.\" Day two at Headingley gets under way at 10.15am, with coverage all day on Sky Sports Cricket.","pubDate":"2022-06-23 18:24:00","image_url":"https://e2.365dm.com/22/06/1920x1080/skysports-jamie-overton-craig-overton_5811321.jpg?20220621150300","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"England held up again by Daryl Mitchell and Tom Blundell after bright start to third Test - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2NyaWNrZXQvbmV3cy8xMjEyMy8xMjYzOTAwOC9lbmdsYW5kLWhlbGQtdXAtYWdhaW4tYnktZGFyeWwtbWl0Y2hlbGwtYW5kLXRvbS1ibHVuZGVsbC1hZnRlci1icmlnaHQtc3RhcnQtdG8tdGhpcmQtdGVzdNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England held up again by Daryl Mitchell and Tom Blundell after bright start to third Test  Sky SportsEngland v New Zealand: third Test, day one – as it happened  The GuardianMitchell and Blundell lead New Zealand fightback  Reuters.comWatch: New Zealand batsman caught out in one of the strangest wickets in cricket history  The TelegraphNew Zealand’s Mitchell and Blundell hold up England’s charge in Third Test  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-06-23 17:57:55","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Darren Sammy National Cricket Stadium pitch report: St Lucia pitch report WI vs BAN 2nd Test","link":"https://thesportsrush.com/cricket-news-darren-sammy-national-cricket-stadium-pitch-report-st-lucia-pitch-report-wi-vs-ban-2nd-test/","keywords":["Cricket","Bangladesh tour of West Indies 2022","Darren Sammy National Cricket Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Darren Sammy National Cricket Stadium pitch report: A high in confidence West Indies will take on Bangladesh with eyes on series victory. Brimming with confidence, the West Indies would take on Bangladesh during the 2nd Test at the Darren Sammy National Cricket Stadium in St Lucia, with eyes on a clean sweep in the two-match… The post Darren Sammy National Cricket Stadium pitch report: St Lucia pitch report WI vs BAN 2nd Test appeared first on The SportsRush.","content":"Darren Sammy National Cricket Stadium pitch report: A high in confidence West Indies will take on Bangladesh with eyes on series victory. Brimming with confidence, the West Indies would take on Bangladesh during the 2nd Test at the Darren Sammy National Cricket Stadium in St Lucia, with eyes on a clean sweep in the two-match series. Bangladesh, courtesy of poor show with the bat in the first innings of the opening Test match, were ultimately pinned down by the Windies by 7 wickets, to now find themselves at a place where they can only level the series. While the bowlers did put up a decent effort in the Test, barring their newly appointed skipper Shakib Al Hasan, almost all the Bangladeshi players failed to put on a show with the bat. On the other hand, decent contributions from their batters and bowlers alike, coupled with a top-notch effort in the field, meant that the Windies were on top right till the end of the match. As for the second Test tomorrow, Bangladesh can take some solace from the fact that West Indies have managed to win just one of the nine Tests at the Darren Sammy Stadium since 2003. Bangladesh, on the other hand, have lost one and drawn the other, in the two Test matches they have played here till date. All in boys!👊🏽 #WIvBAN #MenInMaroon pic.twitter.com/YfRFtuYacU — Windies Cricket (@windiescricket) June 23, 2022 As has been observed in the previous few Test matches at this venue, the pitches here have generally assisted the fast bowlers especially during the first innings of the Test. Hence, captain winning the Toss is likely to bowl first and allow his pacers to take advantage of the favorable conditions on offer. With an average first innings score of 263 at this venue, batters are likely to go through a challenging time, with the pitch also likely to assist the spinners from the second-half of the Test. All in all, expect the bowlers to dominate at this venue during the second Test starting today (June 24).","pubDate":"2022-06-23 17:56:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"\"Blessed To Have Spoken To Rohit, Rishabh\": Jemimah Post Starring For IND","link":"https://sports.ndtv.com/cricket/blessed-to-have-spoken-to-rohit-sharma-rishabh-pant-jemimah-rodrigues-after-starring-for-india-vs-sri-lanka-3095263","keywords":null,"creator":null,"video_url":null,"description":"Jemimah Rodrigues marked her return to international cricket with a vital 27-ball 36 not out to give India enough runs to defend in the first T20 International in Dambulla on Thursday.","content":null,"pubDate":"2022-06-23 17:34:33","image_url":"https://c.ndtvimg.com/2022-06/nbrff0so_jemimah-rodrigues-806_625x300_23_June_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Narayan Jagadeesan and Baba Aparajith fight: N Jagadeesan shows middle finger to B Aparajith after getting run out in TNPL 2022","link":"https://thesportsrush.com/cricket-news-narayan-jagadeesan-and-baba-aparajith-fight-n-jagadeesan-shows-middle-finger-to-b-aparajith-after-getting-run-out-in-tnpl-2022/","keywords":["Cricket","Videos","Baba Aparajith","Chepauk Super Gillies","Narayan Jagadeesan","Nellai Royal Kings","Tamil Nadu Premier League","TNPL"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Narayan Jagadeesan and Baba Aparajith fight: The two senior Tamil Nadu players found themselves in an unwanted incident. The first match of the ongoing sixth season of the Tamil Nadu Premier League has commenced on a dramatic note as Nellai Royal Kings all-rounder Baba Aparajith and Chepauk Super Gillies wicket-keeper batter Narayan Jagadeesan found themselves… The post Narayan Jagadeesan and Baba Aparajith fight: N Jagadeesan shows middle finger to B Aparajith after getting run out in TNPL 2022 appeared first on The SportsRush.","content":"Narayan Jagadeesan and Baba Aparajith fight: The two senior Tamil Nadu players found themselves in an unwanted incident. The first match of the ongoing sixth season of the Tamil Nadu Premier League has commenced on a dramatic note as Nellai Royal Kings all-rounder Baba Aparajith and Chepauk Super Gillies wicket-keeper batter Narayan Jagadeesan found themselves in an unwanted incident. While Aparajith didn’t do anything wrong, Jagadeesan couldn’t handle his emotions after the former dismissed him cunningly. As a result, ended up speaking words and doing gestures which aren’t expected from a senior Tamil Nadu player such as him. It all happened on the fourth delivery of the fourth over when Aparajith ran out Jagadeesan at the non-striker’s end. Perhaps having watched Jagadeesan taking undue advantage by leaving his crease way too early, Aparajith ran him out before completing a delivery only to witness a raging 26-year old player. Opening the batting with captain Kaushik Gandhi (64) in a 185-run chase at the Indian Cement Company Ground tonight, Jagadeesan walked back to the pavilion after scoring 25 (15) with the help of four fours. In what wasn’t a regular walk after getting out, Jagadeesan showed his middle finger to the opposition not once but thrice including a third time ensuring doing it in front of a camera. Additionally, there were also a few words exchanged during the incident. Been clearly out under the laws of cricket, there wasn’t any need for Jagadeesan to put on display such obscene gestures. Drama in TNPL 2022 season opener in Tirunelveli wasn’t just restricted to Jagadeesan as defending champions Super Gillies all-rounder Harish Kumar hit two fours and a six in the final over to bring up a super over. 🤐🤐🤐🤐 @Jagadeesan_200 @aparajithbaba senior players of tn🤐🤐🤐 pic.twitter.com/C9orMqRPL3 — Jayaselvaa ᅠ (@jayaselvaa1) June 23, 2022 Tamil cuss words follow! Jagadeesan Mankaded by Baba Aparajith! #TNPL2022 off to an A̶b̶u̶s̶i̶v̶e̶ ̶ Explosive start! 😂🔥 — Venkat Parthasarathy (@Venkrek) June 23, 2022 Baba Aparajith runs out Jagadeesan at non striker’s end on his delivery stride. Out as per the laws. Jagadeesan was not too pleased at all — Sarang Bhalerao (@bhaleraosarang) June 23, 2022 Let’s get this right. Baba Aparajith runs out N Jagadeesan as per laws of the game in the #TNPL2022 opening match #TNPL — Prabhu (@Cricprabhu) June 23, 2022 For more cricket-related news, click here .","pubDate":"2022-06-23 17:17:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Springbok Women run up a cricket score in Rugby Africa Women’s Cup win over Namibia","link":"https://www.iol.co.za/sport/rugby/springboks/springbok-women-run-up-a-cricket-score-in-rugby-africa-womens-cup-win-over-namibia-f3f420c2-2c76-412c-a031-dc57d88f505e","keywords":null,"creator":["Wynona Louw"],"video_url":null,"description":"The Springbok Women secured their second century in as many weeks when they defeated Namibia 128-3 in Pool A of the Rugby Africa Women’s Cup.","content":null,"pubDate":"2022-06-23 16:25:51","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/4239a840-196b-51c2-954f-aeb3b0e65f9b&operation=CROP&offset=0x68&resize=3889x2185","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"LIVE India vs Leicestershire 4-Day Warm-up Test Cricket Score: Bharat-Kohli Star As India Reach 246/8 At Stum - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi5wFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2hpZ2hsaWdodHMtc2NvcmVjYXJkLWluZGlhLXZzLWxlaWNlc3RlcnNoaXJlLTQtZGF5LXdhcm0tdXAtdGVzdC1sZWljZXN0ZXItaW5kLXZzLWxlaS10b2RheS1jcmlja2V0LXNjb3JlLWluZGlhLXZzLWVuZ2xhbmQtNXRoLXRlc3QtYmFsbC1ieS1iYWxsLWNvbW1lbnRhcnkta29obGktd2Fsa2VyLWJoYXJhdC1zaGFtaS1zdHVtcHMtMjQ2LTgtNTQ3MDY5OC_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE India vs Leicestershire 4-Day Warm-up Test Cricket Score: Bharat-Kohli Star As India Reach 246/8 At Stum  India.comIndia vs Leicestershire Live Streaming And Live Telecast Details: When And Where To Watch India's Practice Match Live In Your Country?  Cricket AddictorIndia vs Leicestershire, Tour Match, Day 1 Highlights: KS Bharat The Saviour As India Reach 246/8, K..  NDTV SportsPant, Pujara and Bumrah to represent Leicestershire in warm-up fixture | Cricbuzz.com - Cricbuzz  CricbuzzWhile You Were Asleep: Pujara, Pant, Bumrah to play for Leicestershire, Koepka set to join LIV Golf series as PGA Tour plans to increase cash prizes  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-06-23 16:25:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Sarfaraz Khan averages 81 in FC cricket”: Ian Bishop expresses awe of Sarfaraz Khan after his splendid century vs Madhya Pradesh in Ranji Trophy 2021-22 final","link":"https://thesportsrush.com/cricket-news-sarfaraz-khan-averages-81-in-fc-cricket-ian-bishop-expresses-awe-of-sarfaraz-khan-after-his-splendid-century-vs-madhya-pradesh-in-ranji-trophy-2021-22-final/","keywords":["Cricket","Madhya Pradesh","Mumbai","Ranji Trophy 2021-22","sarfaraz khan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ian Bishop expresses awe of Sarfaraz Khan as latter carried on with his purple patch of form till the Ranji Trophy final with another ton. Continuing with his scintillating run of form in the ongoing Ranji Trophy season, Mumbai middle-order batter Sarfaraz Khan smashed yet another ton, this time in the grand finale against Madhya… The post “Sarfaraz Khan averages 81 in FC cricket”: Ian Bishop expresses awe of Sarfaraz Khan after his splendid century vs Madhya Pradesh in Ranji Trophy 2021-22 final appeared first on The SportsRush.","content":"Ian Bishop expresses awe of Sarfaraz Khan as latter carried on with his purple patch of form till the Ranji Trophy final with another ton. Continuing with his scintillating run of form in the ongoing Ranji Trophy season, Mumbai middle-order batter Sarfaraz Khan smashed yet another ton, this time in the grand finale against Madhya Pradesh at the M. Chinnaswamy Stadium in Bengaluru. After skipper Prithvi Shaw (47) and Yashasvi Jaiswal (78) provided Mumbai an excellent start yet again, it was only due to Sarfaraz’s 243-ball 134 – the only three-figure score in the star-studded Mumbai batting line-up, that the team could post 374 on the scoreboard in the first innings. Sarfaraz’s innings was studded with 13 Fours and 2 Sixes, and he made sure that he came up with the signature move of Punjab’s renowned late singer-actor Sidhu Moose Wala, the moment he smashed the fourth century of the season. To put it in a nutshell, the 24-year-old, in the last 16 Ranji Trophy innings, has smashed a total of – 1 triple hundred, 2 double hundreds, 3 scores in excess of 150, 4 half-centuries, and today’s century against Madhya Pradesh. Ian Bishop expresses awe of Sarfaraz Khan With the highest score of 301*, Sarfaraz now has amassed a total of 2,531 First-class runs across 35 innings (24 matches), at a mind-boggling average of 81.06, with the help of seven fifties and as many tons. Taking cognizance of the aforementioned stat, West Indies legendary pacer Ian Bishop took to his social media handle, to praise and express his awe at Sarfaraz’s stupendous numbers, despite not quite a huge sample size of matches under his belt. Sarfraz Khan averages 81 in FC cricket. Yes, it’s a small sample size of 24 games, but it’s still remarkable. — Ian Raphael Bishop (@irbishi) June 23, 2022 Overall, in Ranji Trophy 2021-22, the Mumbai batter tops the list of highest run-getters with no other batter in the vicinity of his unbelievable numbers. Averaging 133.85, he has amassed 937 runs across 8 innings in the ongoing season, with the assistance of 4 centuries and a couple of fifties, and one possible innings yet to go. The post “Sarfaraz Khan averages 81 in FC cricket”: Ian Bishop expresses awe of Sarfaraz Khan after his splendid century vs Madhya Pradesh in Ranji Trophy 2021-22 final appeared first on The SportsRush.","pubDate":"2022-06-23 16:21:19","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"England spinner Jack Leach takes one of the craziest wickets you’ll ever see as both New Zealand batsmen hit the ball before Henry Nicholls is caught out","link":"https://talksport.com/sport/cricket/1135839/jack-leach-crazy-wicket-barmy-army-england-bowlers-new-zealand-batsmen-third-test/","keywords":["Cricket","Sport","England Cricket","New Zealand Cricket"],"creator":["Cameron Temple"],"video_url":null,"description":"Jack Leach may have just taken one of the most bizarre wickets in cricket history. The England spinner has enjoyed a decent first day of the third test against New Zealand, taking the wicket of Will Young by LBW with his first ball of the day. Leach’s second wicket, however, has taken cricket fans all […]","content":"Jack Leach may have just taken one of the most bizarre wickets in cricket history. The England spinner has enjoyed a decent first day of the third test against New Zealand, taking the wicket of Will Young by LBW with his first ball of the day. His second was a crazy one. Initially it seemed like a normal delivery from Leach, but the result was anything but…Twitter: @englandcricket Henry Nicholls drove the ball back up the other endTwitter: @englandcricket The ball hit the bat of Daryl Mitchell at the non-strikers end and flew into the hands of Alex LeesTwitter: @englandcricket Leach could not believe his eyes like the rest of usTwitter: @englandcricket Leach’s second wicket, however, has taken cricket fans all around the world by surprise. As Leach bowled what would be the final ball before tea, Henry Nicholls hit it straight at his teammate, Daryl Mitchell, at the other end. It hit Mitchell’s bat and rebounded into the hands of Alex Lees, who was stood at mid-off. Leach looked around confused but off walked Nicholls and celebrations ensued. Earlier in the day, Leach had also taken the time to have a little bit of fun, as he downed a bottle of water by the boundary ropes, much to the amusement of the cheering Barmy Army. It’s a special day for Leach, who’s 31st birthday was the day before the Test, but it is also almost three years on from his heroics in the third test of the 2019 Ashes when he saw off seventeen balls under immense pressure from the Australian bowlers and scored the run to take England level with their rivals. Ben Stokes deservedly received most of the plaudits that day for scoring the winning runs to end on 135 not out, but had Leach lost his wicket at the other end, England would have been defeated in the test and the series. Most read in Sport Difficult Mayweather admitted his worry about Paul to his corner during their fight IT'S ON Jake Paul vs Tommy Fury officially announced with date and venue confirmed DONE DEAL Tommy Fury SIGNS CONTRACT for Jake Paul fight and confirms date POPULAR Oleksandr Usyk dances with fans in Saudi Arabia and Anthony Joshua is mobbed ACTION Three men charged over robbery of Amir Khan who had £72,000 watch stolen at gunpoint OPINION Deontay Wilder gives honest prediction for Oleksandr Usyk vs Anthony Joshua rematch it's on Tommy Fury rubbishes Jake Paul claims and reveals date for rescheduled fight HERO Lennox Lewis posts classy tribute to Vitali Klitschko on anniversary of their fight What on earth!? Scorecard/clips: https://t.co/AIVHwaRwQv #ENGvNZ pic.twitter.com/yb41LrnDr9— England Cricket (@englandcricket) June 23, 2022 Jack Leach – complete hero of a man #ENGvNZ pic.twitter.com/0PGL4bdoHw— England’s Barmy Army (@TheBarmyArmy) June 23, 2022 Joe Root has been the man of the series so far with 305 runs in his four inningsAFP As it stands in this Test, England are on top having taken five wickets, two for Leach, two for Stuart Broad and one for debutant Jamie Overton. The New Zealand batsman have not given up their wickets easily, but they have struggled to score. There is still a long way to go in the test, but should England maintain this pressure and perform with the bat, they will be on track to secure a 3-0 win over the current holders of the World Test Championship trophy. This would be a brilliant start to captaincy for Ben Stokes and for new coach Brendon McCullum. Offers Of The Day 888Sport – Bet £10 Get £30 In Free Bets + £10 Casino Bonus* – CLAIM HERE New customers only. Min deposit £10 • A qualifying bet is a ‘real money’ stake of at least £10 • Min odds 1/2 (1.5) • Free Bets credited upon qualifying bet settlement and expires after 7 days • Free Bet stakes not included in returns • Casino Bonus must be claimed within 7 days • To withdraw bonus/related wins, wager bonus amount x40 within 14 days • Casino bonus expires after 60 days • Withdrawal restrictions & full T&Cs apply 18+ begambleaware.org SEE MORE FREE BET OFFERS HERE","pubDate":"2022-06-23 16:06:29","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Washington Sundar: An all-rounder too precious to be missed","link":"https://sportstar.thehindu.com/cricket/washington-sundar-allrounder-too-precious-to-be-missed/article38505387.ece","keywords":null,"creator":["S.Dinakar"],"video_url":null,"description":"Washington averages a whopping 66.25 in Test cricket and has 25 wickets in 31 matches at a laudable economy rate of 7.24 in T20Is.","content":"Impact players should not be lost to Indian cricket. Particularly someone with the natural gifts of Washington Sundar. The lithe 22-year-old smooth-stroking left-hander and an off-spinner with control will be travelling to Lancashire to get a feel of county cricket. Bowling in the tough Power Play overs and holding his own, and always dangerous with the willow, Washington should have been included in the Indian Twenty20 squad for Ireland. READ: Ashwin joins Indian squad in Leicester after COVID-19 recovery He had overcome fitness issues and figured in the last stretch of the IPL with Sunrisers Hyderabad. Not just Twenty20 cricket, here is a lad who has an outstanding Test record showcasing his exquisite timing and left-handed grace with the willow, tight off-spin and a stunning temperament. In four Tests, Washington averages a whopping 66.25 with three half centuries - a game-changing 62 on his Test debut at the bouncy Gabba against a fierce Australian attack, an unbeaten 85 versus England in Chennai, and a 96 not out at the expense of the English attack at Ahmedabad, all the knocks arriving in 2021. In fact, after his unbeaten 96, Washington is yet to figure in a Test.He offers real quality, the left-handed variety, and resilience in the lower middle-order. Washington has a relaxed air about him, but beneath, he is tough as nails. Look at his Test record and you will find that in four Tests, he has strung together four vital partnerships. To the opposition he has been a road block. He added 123 crucial runs for the seventh wicket with the feisty Shardul Thakur as India fought back in the Brisbane Test. Earlier, he had sent down tidy off-spin to scalp three. Then when India chased 328 for a series clinching triumph, Washington’s cameo, a delightful 22, where his gutsy hooked six off the hostile Pat Cummins was the beginning of India’s decisive victory push, underlined his ability and composure in a stressful situation. ALSO READ: Ranji Trophy final: Sarfaraz century puts Mumbai on top against Madhya Pradesh Then Washington put on 80 for the seventh wicket with R. Ashwin at Chepauk, Subsequently, during his unbeaten 96 in Ahmedabad, Washington was involved in two century partnerships, first with Rishabh Pant and then Axar Patel. Fearless, Washington relishes the sniff of combat. And he dissects an attack with strokes of delicate beauty and timing, coaxing the ball through the empty spaces. He has not received too many opportunities to bat in Twenty20 internationals, but has 25 wickets in 31 matches at a laudable economy rate of 7.24. Washington deserves better. He is too precious a talent to be wasted.","pubDate":"2022-06-23 15:58:44","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"'How has it got there?!': Nicholls' freak dismissal must be seen to be believed - International Cricket Council","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzI2NTQwODPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'How has it got there?!': Nicholls' freak dismissal must be seen to be believed  International Cricket CouncilRecent Match Report - New Zealand vs England 3rd Test 2022  ESPNcricinfoENG v NZ: Mitchell leads New Zealand rally after Broad strikes for England  News18Watch | 3rd Test: Henry Nicholls falls in bizarre fashion to Jack Leach  India Today'It's a stupid game that we play' - Jack Leach reflects on moment of Black Cap comedy  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-06-23 15:53:18","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Despite Sarfaraz Khan’s century, Ranji Trophy final hangs in balance","link":"https://www.orissapost.com/despite-sarfaraz-khans-century-ranji-trophy-final-hangs-in-balance/","keywords":["Sports","champions","Madhya Pradesh","mumbai","ranji trophy","Sarfaraz Khan","Yash Dubey"],"creator":["Post News Network"],"video_url":null,"description":"Bangalore: Sarfaraz Khan (134, 243b, 13×4, 2×6) completed his transformation from Mumbai cricket’s resident ‘enfant terrible’ to ‘Man Friday’ with a superb hundred that propelled Mumbai to a competitive score of 374 on the second day of their Ranji Trophy final against Madhya Pradesh here Thursday. In reply Madhya Pradesh came back in a strong […]","content":"Despite Sarfaraz Khan’s century, Ranji Trophy final hangs in balance PTI Updated: June 23rd, 2022, 20:54 IST in Sports 0 Mumbai's Sarfaraz Khan celebrates after scoring his century against Madhya Pradesh in the Ranji Trophy final PTI Photo Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Bangalore: Sarfaraz Khan (134, 243b, 13×4, 2×6) completed his transformation from Mumbai cricket’s resident ‘enfant terrible’ to ‘Man Friday’ with a superb hundred that propelled Mumbai to a competitive score of 374 on the second day of their Ranji Trophy final against Madhya Pradesh here Thursday. In reply Madhya Pradesh came back in a strong manner scoring 123 for the loss of one wicket stumps. With the pitch not holding any terrors for the batters, the match now looks evenly poised. Courtesy Sarfaraz’s fourth hundred of the season the 41-time champions managed a fighting score after beginning the day at 248 for five. But Madhya Pradesh won’t be too unhappy as they finished the second day strongly with Yash Dubey (44 batting, 131b, 6×4) and Shubham Sharma (41 batting, 65b, 5×4) adding 76 runs for the unbroken second wicket. The day belonged to none other than Sarfaraz Khan, who has now scored an astounding 937 runs in Ranji Trophy in just six games. He could make it 1,000 runs for the season if Mumbai bat again in this match. Sarfaraz hit two huge sixes – one over square leg off left-arm spinner Kumar Kartikeya and one down the ground off off-spinner Saransh Jain. But what stood out was how he managed the innings after Shams Mulani was trapped leg before by Gourav Yadav (4/106) in the opening over of the second day with the score on 248. Sarfsraz’s batting with the tail showed his new-found maturity, which is proving to be a boon for Mumbai cricket. Sarfaraz chose loose deliveries for boundary, forcing MP captain Aditya Shrivastava to open the field. The manner in which Sarfaraz has turned a corner since the 2019-20 season (928 runs back then) is phenomenal. He had disciplinary issues early in his career, which also forced him to leave Mumbai for a season. With father Naushad Khan, who also doubles up as his coach, making him play 400 balls (nearly 67 overs including nets and knocking) a day at practice, Sarfaraz 2.0 is a battle-hardened man, the ‘khadoos street fighter’ that any captain would want to go to a war with. Once he reached his 50, Sarfaraz touched the lion’s crest on his jersey, gesturing “Don’t worry, I am going nowhere’. His batting isn’t as pleasing to the eye as Prithvi Shaw’s but highly effective and assuring. He knows how to score those runs on a track that is largely two-paced and in overcast conditions with the ball doing a fair bit. When MP skipper spread the field to stop boundaries, Sarfaraz still found his way to play the controlled square-cut off seamer Anubhav Agarwal, which bisected the two fielders stationed at deep extra cover and deep point to the fence. Having entered the 90s, Sarfaraz played a typical T20 scoop over the keeper’s head while being partially blindsided and completely off-balance. It was a sight worth capturing. At 97, MP skipper Shrivastava put all his fielders at the boundary line with two standing at long-on and long-off. The ploy wasn’t good enough to stop Sarfaraz as he thumped one over bowler’s head which went to the boundary. The Indian Test team’s middle-order is still jam-packed but the manner in which Sarfaraz is batting, to put it in head coach Rahul Dravid’s words, he is not just knocking but banging the selection door down. Sarfaraz was involved in four small, but very effective, partnerships which could prove to be decisive if the match turns out to be an affair of one innings. He added 40 for seventh wicket with Tanush Kotian (15), 26 for the eighth wicket with Dhawal Kulkarni (1), 39 for the ninth with Tushar Deshpande (6) and another 21 priceless runs for the final wicket with Mohit Avasthi (7). By the time, he became Mumbai’s last batter to be dismissed, he had ensured that the total is good enough for his bowlers to defend. But there are ominous signs as MP batters have looked solid so far and Mumbai’s bowling line-up hasn’t made much of an impact, save Tushar Deshpande’s delivery that straightened to find Himanshu Mantri’s (31) pads. Mumbai 374 (Sarfaraz Khan 134, Gaurav Yadac 4/106, Anubhav Agarwal 3/81); Madhya Pradesh 123 for 1 (Yash Dubey 44 batting, Subham Sharma 41 batting). Match to continue. Tags: champions Madhya Pradesh mumbai ranji trophy Sarfaraz Khan Yash Dubey Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Srikar Bharat rescues India after top order fails June 23, 2022 Bhubaneswar may not be able to host U-17 Women’s World Cup India matches: Find out why June 23, 2022 Clinical Indian eves choke Sri Lanka, take 1-0 lead in T20 series June 23, 2022 Indian recurve women archers storm into final of World Cup June 23, 2022 Odisha’s Deep Grace Ekka named vice-captain of Indian team for Birmingham CWG June 23, 2022 Ranji Trophy final: Teary-eyed Sarfaraz celebrates ton in Sidhu Moosewala style June 23, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-06-23 15:24:32","image_url":"https://www.orissapost.com/wp-content/uploads/2022/06/Sarfaraz-Khan-300x155.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs New Zealand, 3rd Test, New Zealand tour of England, 2022 - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiZGh0dHBzOi8vbS5jcmljYnV6ei5jb20vbGl2ZS1jcmlja2V0LXNjb3Jlcy8zODMzMi9uei12cy1lbmctM3JkLXRlc3QtbmV3LXplYWxhbmQtdG91ci1vZi1lbmdsYW5kLTIwMjLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England vs New Zealand, 3rd Test, New Zealand tour of England, 2022  CricbuzzEngland vs New Zealand 3rd Test, Day 1 Highlights: NZ Reach 225/5 At Stumps On Day 1  NDTV SportsNZ 225-5 at stumps; Mitchell, Blundell again share in century stand recap!  Sky SportsENG vs NZ: New Zealand's Predicted Playing XI Against England 3rd Test  Cricket AddictorBen Stokes sets challenge for England team ahead of Leeds Test: Be even more fearless, positive and aggressive  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-06-23 15:17:39","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“One of the strangest dismissals I’ve ever seen”: Twitter reactions on Henry Nicholls bizarre dismissal off Jack Leach in Leeds Test","link":"https://thesportsrush.com/cricket-news-one-of-the-strangest-dismissals-ive-ever-seen-twitter-reactions-on-henry-nicholls-bizarre-dismissal-off-jack-leach-in-leeds-test/","keywords":["Cricket","Henry Nicholls","Jack Leach","New Zealand tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Henry Nicholls bizarre dismissal off Jack Leach during the third Test match at Headingley in Leeds leaves fans’ jaws slacked in disbelief. On Day 1 of the ongoing third Test match between England and New Zealand at Headingley in Leeds, Kiwi Southpaw batter Henry Nicholls gets dismissed in the most bizarre and unluckiest manner possible… The post “One of the strangest dismissals I’ve ever seen”: Twitter reactions on Henry Nicholls bizarre dismissal off Jack Leach in Leeds Test appeared first on The SportsRush.","content":"Henry Nicholls bizarre dismissal off Jack Leach during the third Test match at Headingley in Leeds leaves fans’ jaws slacked in disbelief. On Day 1 of the ongoing third Test match between England and New Zealand at Headingley in Leeds, Kiwi Southpaw batter Henry Nicholls gets dismissed in the most bizarre and unluckiest manner possible right at the stroke of the Tea Break. It all happened on the second delivery of the 56 th Over, after Nicholls and Daryl Mitchell had grinded hard with a gritty 40-run partnership for the fifth wicket, amidst some disciplined bowling by the English bowlers akin the morning session. Left-arm spinner Jack Leach, bowled a full delivery from over the wicket to the left-handed Nicholls, to which the latter decides to step down the track and hit a fierce uppish on-drive. With the least reaction time possible, the beautifully timed stroke from Nicholls bat meant that the ball smashed right on the sweet spot of Daryl Mitchell’s bat at the non-striker’s end. Resultantly, the ball ballooned up straight to Alex Lees’ hands who pouched the simplest of catches at the mid-off region. Thus, the ball which was supposed to head towards the long-on fence, ended straight into the hands of the mid-off fielder, to leave an absolutely dejected Nicholls cursing his luck on his way back towards the dressing room. What on earth!? 😅🙈 Scorecard/clips: https://t.co/AIVHwaRwQv 🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvNZ 🇳🇿 pic.twitter.com/yb41LrnDr9 — England Cricket (@englandcricket) June 23, 2022 An unfortunate dismissal? Yes. But wholly within the Laws. Law 33.2.2.3 states it will be out if a fielder catches the ball after it has touched the wicket, an umpire, another fielder, a runner or the other batter. Read the Law: https://t.co/cCBoJd6xOS pic.twitter.com/eKiAWrbZiI — Marylebone Cricket Club (@MCCOfficial) June 23, 2022 Just like Andrew Symonds and Michael Clarke, I reckon Daryl Mitchell owes Henry Nicholls a drink 😂 #ENGvNZ pic.twitter.com/EZEHPLKWsE — Lachlan McKirdy (@LMcKirdy7) June 23, 2022 Henry Nicholls must have walked under a ladder or run over a black cat. That’s unbelievably bad luck. — Damian Spellman (@DamianSpellman) June 23, 2022 Daryl Mitchell has scored lots of runs, but now dropped two catches, ran two teammates out and middled a Nicholls’ four straight to mid-off. One of the strangest dismissals I’ve ever seen #ENGvNZ — Tyrone Marshall (@TyMarshall_MEN) June 23, 2022 Sheer disbelief in the @bbctms commentary box! 🤯 Have you ever seen anything like it as Henry Nicholls is caught out? 📻 Listen to @bbtms on @BBCSounds #BBCCricket #ENGvNZ pic.twitter.com/db9RJLhq46 — Test Match Special (@bbctms) June 23, 2022 I laugh when people say ‘that’s the best xxxx ever’ etc, but that has to be the unluckiest dismissal ever, doesn’t it? When you’re run out at the non-striker’s end it’s your fault for wandering out of yr crease. I guess you could say Henry Nicholls hit it in the air, but still… — Huw Turbervill (@huwzat) June 23, 2022 Henry Nicholls to Daryl Mitchell in the sheds later #ENGvNZ https://t.co/i0ML9SUbqB pic.twitter.com/LhI2onIVt6 — Cameron Ponsonby (@cameronponsonby) June 23, 2022 This needs new scorecard description Henry Nicholls: Caught Lees – Assisted Mitchell – bowled Leach https://t.co/rpAcJBVkuN — Jigar Mehta (@jigsactin) June 23, 2022 Well, if Henry Nicholls had convinced Stokes to refer Mitchell’s plumb LBW, he’d still be batting. Only himself to blame…. — daniel norcross (@norcrosscricket) June 23, 2022 Poor old Henry Nicholls – battles so hard for 99 balls then when he finally tries a big shot – that happens. #ENGvNZ — Chris Stonadge (@ChrisStonadge) June 23, 2022 It goes without saying that Henry Nicholls’ lottery numbers won’t come in, but he’ll also realise he left his wallet on the counter and his bank account has been drained. #ENGvNZ — Jon Barbuti (@jonbarbuti) June 23, 2022 We just saw live manifestation of law 33, at the dismissal of Henry Nicholls #ENGvNZ pic.twitter.com/YlypWXfwSx — sourabh (@sourabh_kuki) June 23, 2022 You have to feel for Henry Nicholls, that was a ‘the gods are cruel and capricious’ way to lose his wicket. #ENGvNZ @bbctms — David Owen (@OwenWintersgill) June 23, 2022 For more Cricket-related news, click here .","pubDate":"2022-06-23 15:14:55","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Lord Patel receives racist letters over Yorkshire cricket row","link":"https://www.thetelegraphandargus.co.uk/news/20231568.lord-patel-receives-racist-letters-yorkshire-cricket-row/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"YORKSHIRE chair Lord Patel has outlined the \"phenomenally racist\" letters he has received since Azeem Rafiq's shocking claims of racial harassment and bullying in his time at the county.","content":"YORKSHIRE chair Lord Patel of Bradford has outlined the \"phenomenally racist\" letters he has received since Azeem Rafiq's claims of racial harassment and bullying in his time at the county. On the day that Test cricket returned to Headingley for the first time since the racism scandal that engulfed the county last September, Lord Patel said Yorkshire would have gone bust but for England playing in Leeds again. Yorkshire and a number of individuals were charged by the England and Wales Cricket Board last week following an investigation into the racism allegations made by Rafiq, and the handling of those allegations by the club. Yorkshire County Cricket Club Asked if he had received racist letters, Patel told BBC Radio's Test Match Special: \"Phenomenally racist. We have a very small but very vocal group of individuals that do not accept that racism happened at this club. \"I think we have to move beyond that denial. Racism happens in society. It certainly happened at this club. \"Ninety to 95 per cent of members and people I meet on the street and on the train have said thank you for doing what you are doing and have been extremely supportive. \"In any space of life I do have a small but substantial bag of letters that, if I was to take to the police, I think people would be prosecuted. \"We know there is misogyny, discrimination, power imbalances and these things happen. It happened here badly. \"There are some people, for whatever reason, and I am not having a go at them. It has impacted and made our lives very difficult. \"The ECB wanted absolute evidence that we had put things in place that we were going to change and move.\" Yorkshire, who lost several major sponsors after the furore, were stripped of hosting lucrative international matches in November until governance changes were enacted. These changes came in March this year, but Patel said the consequences of losing Test cricket had not \"really resonated\" with him until its actual return to Headingley on Thursday. Asked if Yorkshire would have gone bust without Test cricket, Patel replied: \"In simple terms, yes. I think we would have. I don't think people have realised. \"It was because of that panic situation and (being) caught in the headlights that people didn't look further that actually, if Test matches or international matches didn't come back here, we were going to go bankrupt. We literally were.\" Have you got a story for us? Email newsdesk@telegraphandargus.co.uk or contact us here . Follow us on Facebook , Twitter and Instagram to keep up with all the latest news. Sign up to our newsletter to get updates sent straight to your inbox. You can also call us on 01274 705292.","pubDate":"2022-06-23 14:52:25","image_url":"https://www.thetelegraphandargus.co.uk/resources/images/13921259/?type=app&htype=0","source_id":"thetelegraphandargus","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Star Sports Tamil live commentators: How to watch TNPL live 2022?","link":"https://thesportsrush.com/cricket-news-star-sports-tamil-live-commentators-how-to-watch-tnpl-live-2022/","keywords":["Cricket","Tamil Nadu Premier League","TNPL","TNPL commentators"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Star Sports Tamil live commentators: The SportsRush brings you the list of Tamil Commentators of TNPL 2022. The 6th edition of the Tamil Nadu Premier League started with the match between Chepauk Super Gillies and Nellai Royal Kings at the Indian Cement Company Ground in Tirunelveli. The viewership and buzz of the Tamil Nadu Premier… The post Star Sports Tamil live commentators: How to watch TNPL live 2022? appeared first on The SportsRush.","content":"Star Sports Tamil live commentators: The SportsRush brings you the list of Tamil Commentators of TNPL 2022. The 6th edition of the Tamil Nadu Premier League started with the match between Chepauk Super Gillies and Nellai Royal Kings at the Indian Cement Company Ground in Tirunelveli. The viewership and buzz of the Tamil Nadu Premier League has only increased in the last few years, and this season is expected to be exciting as well. Chepauk Super Gillies have the title a maximum of three times, and they are the defending champions as well. A total of 32 matches will be played in the tournament across four venues in Tamil Nadu i.e. Tirunelveli, Dindigul, Coimbatore, and Salem. R Ashwin and Dinesh Karthik were expected to be a part of the tournament, but they are on national duties. However, Murali Vijay is finally making his return to cricket after a long break. Also Read: Full Squad of all eight TNPL teams Tamil Nadu Premier League will be televised on Star Sports in various languages, and Tamil is one of them. The Tamil viewers can watch the match in Tamil Commentary on Star Sports Tamil. A panel of four commentators has been finalized for the Tamil Commentary on the channel. Pradeep Muthu, Nanee, MD Thirushkamini and Shebani Bhaskar will be doing the Tamil Commentary in Tamil Nadu Premier League. TNPL Commentary-க்கு நம்ம படை களமிறங்கிட்டாங்க🤩 இணைந்திருங்கள் @muthupradeep , @Cricket_Nanee , @MDThirush_16 & @shebanimb உடன்🤝 #TNPL2022 #StarSportsTamil pic.twitter.com/AAESevCXwq — Star Sports Tamil (@StarSportsTamil) June 23, 2022 Pradeep Muthu is a former RJ and currently does commentary for Star Sports Tamil. MD Thirushkamini is a part of the Indian Women’s cricket team, and she has played 39 ODIs for the side. Shebani Bhaskar is an Indian-origin female cricketer who has played 15 T20Is for the USA Women’s cricket team. Apart from watching the action of Tamil Nadu Premier League on Star Sports, the fans can watch the tournament digitally on Voot for free. There is no subscription required to watch Tamil Nadu Premier League online.","pubDate":"2022-06-23 14:44:01","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ton for dad and thigh thump celebration for late Sidhu Moosewala: Sarfaraz Khan","link":"https://www.tribuneindia.com/news/sports/ton-for-dad-and-thigh-thump-celebration-for-late-sidhu-moosewala-sarfaraz-khan-406345","keywords":null,"creator":null,"video_url":null,"description":"Bengaluru, June 23\"This hundred is because of my abbu (father), his sacrifices and holding my hand when I could have been down and out,\" a teary-eyed Sarfaraz Khan choked in front of scribes while dedicating his best century to father and coach Naushad Khan.Those who follow Mumbai cricket closely know how tough Naushad is on his sons Sarfaraz and Mushir (also in Mumbai squad), who don't have a life beyond cricket.So is the dream India call-up on the cards now? His eyes welled up while answering the question after his century lifted Mumbai to 374 against Madhya Pradesh in the Ranji Trophy final here.\"In our lives, it's about all those little dreams that we harbour. The dreams that we (he and his dad) have dreamt together. The nearly 2000 runs that I have scored in two seasons since my Mumbai comeback is because of my 'abbu',\" he said.When there aren't any matches, the brothers train for good six to seven hours per day under their father's supervision.He has had disciplinary issues, has not been the establishment's favourite child, and had to migrate to UP for a season before coming back and serving a cooling-off period before being picked for Mumbai again.\"Aap sab toh jaante ho mere saath kya kya huwa. Abbu na rahte toh main khatm ho jataa (You all know what I have gone through and had my father not been there, I would have been finished by now).\" \"There has been so much of struggle and when I think how my dad dealt with all of it, I get emotional. He didn't leave my hand even once. My brother put up a status on his cell phone and I could see Abbu so happy. It made my day,\" he could finally manage a smile.A fan of Sidhu MoosewalaAsked if his thigh thump celebration was imitation of Punjabi singer Sidhu Moosewala, who was recently gunned down by a gang, he said that was the idea.💯 for Sarfaraz Khan! 👏 👏His 4⃣th in the @Paytm #RanjiTrophy 2021-22 season. 👍 👍This has been a superb knock in the all-important summit clash. 👌 👌 #Final | #MPvMUM | @MumbaiCricAssoc Follow the match ▶️ https://t.co/xwAZ13U3pP pic.twitter.com/gv7mxRRdkV— BCCI Domestic (@BCCIdomestic) June 23, 2022\"This was for Sidhu Moosewala. I love his songs and mostly me and Hardik Tamore (keeper) listen to his songs. I did a similar kind of celebration during an earlier match also (in his memory), but then, Hotstar didn't show it. I had decided once I score another hundred, I would repeat the celebration,\" the burly Mumbaikar said.Planning and pat on back from selectorSarfaraz is nearing 1000 first-class runs for the season (937 currently) at a Bradmanesque average of 81.\"This is my best ever knock in Ranji Trophy as this is the final and it came when the team was in a troublesome situation. We were losing wickets at regular intervals.\"My aim was that whatever happens, I will not throw my wicket away even if it means I will have to play 300 balls. More balls I play, the bigger my knocks will be,\" said Sarfaraz, who scored 134 in 243 balls on the day.A hundred in a Ranji final is special as it reminded him of carrying heavy kitbags in Mumbai local with father Naushad in tow, and also the hours of grind put in for years.\"When I was a little boy, the dream was to wear the Mumbai jersey and score a hundred. When I realised that dream, then I wanted to score a hundred in a Ranji Trophy final when the team is in a precarious position. That's the reason I was overwhelmed with emotion after the hundred,\" Sarfaraz said.Sarfaraz said that once Shams Mulani was out in the first over, he had to change his game plan.\"Once Shams was out, I felt that there could be a collapse round the corner as the MP seamers were getting a fair bit of movement off the track. They were bowling good cutters but then I had a few partnerships which got me closer to the hundred,\" he stated.While he didn't divulge what national selector Sunil Joshi might have told him about his senior team selection in future, he did mention that he was praised for beating MP's tactics.\"It was good talking to Sunil Joshi sir. He understood that Chandu sir (Chandrakant Pandit) had asked his bowlers to block my sweep shot and he said that it was good that I could rotate strike even when my pet shot was stopped.\" His elation aside, Sarfaraz had a word of caution for his bowlers as he felt that a bit more disciplined would be required in the third morning to keep MP under a tight leash after they reached 123 for one in reply to Mumbai's 374.\"We need to be a bit more disciplined tomorrow but I can tell you that the game is far from over. And don't forget, they will have to bat last on this track.\"In any case, we are very confident that we will get first-innings lead but, if somehow, we miss the first-innings lead, we will get them in fourth innings,\" Sarfaraz said.","content":"PTI Bengaluru, June 23 “This hundred is because of my abbu (father), his sacrifices and holding my hand when I could have been down and out,” a teary-eyed Sarfaraz Khan choked in front of scribes while dedicating his best century to father and coach Naushad Khan. Those who follow Mumbai cricket closely know how tough Naushad is on his sons Sarfaraz and Mushir (also in Mumbai squad), who don’t have a life beyond cricket. So is the dream India call-up on the cards now? His eyes welled up while answering the question after his century lifted Mumbai to 374 against Madhya Pradesh in the Ranji Trophy final here. “In our lives, it’s about all those little dreams that we harbour. The dreams that we (he and his dad) have dreamt together. The nearly 2000 runs that I have scored in two seasons since my Mumbai comeback is because of my ‘abbu’,” he said. When there aren’t any matches, the brothers train for good six to seven hours per day under their father’s supervision. He has had disciplinary issues, has not been the establishment’s favourite child, and had to migrate to UP for a season before coming back and serving a cooling-off period before being picked for Mumbai again. “Aap sab toh jaante ho mere saath kya kya huwa. Abbu na rahte toh main khatm ho jataa (You all know what I have gone through and had my father not been there, I would have been finished by now).” “There has been so much of struggle and when I think how my dad dealt with all of it, I get emotional. He didn’t leave my hand even once. My brother put up a status on his cell phone and I could see Abbu so happy. It made my day,” he could finally manage a smile. A fan of Sidhu Moosewala Asked if his thigh thump celebration was imitation of Punjabi singer Sidhu Moosewala, who was recently gunned down by a gang, he said that was the idea. 💯 for Sarfaraz Khan! 👏 👏 His 4⃣th in the @Paytm #RanjiTrophy 2021-22 season. 👍 👍 This has been a superb knock in the all-important summit clash. 👌 👌 #Final | #MPvMUM | @MumbaiCricAssoc Follow the match ▶️ https://t.co/xwAZ13U3pP pic.twitter.com/gv7mxRRdkV “This was for Sidhu Moosewala. I love his songs and mostly me and Hardik Tamore (keeper) listen to his songs. I did a similar kind of celebration during an earlier match also (in his memory), but then, Hotstar didn’t show it. I had decided once I score another hundred, I would repeat the celebration,” the burly Mumbaikar said. Planning and pat on back from selector Sarfaraz is nearing 1000 first-class runs for the season (937 currently) at a Bradmanesque average of 81. “This is my best ever knock in Ranji Trophy as this is the final and it came when the team was in a troublesome situation. We were losing wickets at regular intervals. “My aim was that whatever happens, I will not throw my wicket away even if it means I will have to play 300 balls. More balls I play, the bigger my knocks will be,” said Sarfaraz, who scored 134 in 243 balls on the day. A hundred in a Ranji final is special as it reminded him of carrying heavy kitbags in Mumbai local with father Naushad in tow, and also the hours of grind put in for years. “When I was a little boy, the dream was to wear the Mumbai jersey and score a hundred. When I realised that dream, then I wanted to score a hundred in a Ranji Trophy final when the team is in a precarious position. That’s the reason I was overwhelmed with emotion after the hundred,” Sarfaraz said. Sarfaraz said that once Shams Mulani was out in the first over, he had to change his game plan. “Once Shams was out, I felt that there could be a collapse round the corner as the MP seamers were getting a fair bit of movement off the track. They were bowling good cutters but then I had a few partnerships which got me closer to the hundred,” he stated. While he didn’t divulge what national selector Sunil Joshi might have told him about his senior team selection in future, he did mention that he was praised for beating MP’s tactics. “It was good talking to Sunil Joshi sir. He understood that Chandu sir (Chandrakant Pandit) had asked his bowlers to block my sweep shot and he said that it was good that I could rotate strike even when my pet shot was stopped.” His elation aside, Sarfaraz had a word of caution for his bowlers as he felt that a bit more disciplined would be required in the third morning to keep MP under a tight leash after they reached 123 for one in reply to Mumbai’s 374. “We need to be a bit more disciplined tomorrow but I can tell you that the game is far from over. And don’t forget, they will have to bat last on this track. “In any case, we are very confident that we will get first-innings lead but, if somehow, we miss the first-innings lead, we will get them in fourth innings,” Sarfaraz said. #Sarfaraz Khan #sidhu moosewala","pubDate":"2022-06-23 14:36:26","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/6/2022_6$largeimg_315596555.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"}]}