{"newsArray":[{"title":"IPL 2022: Mayank Agarwal's heartwarming message for Odean Smith after Rahul Tewatia destroys PBKS","link":"https://www.thehansindia.com/sports/cricket/ipl-2022-mayank-agarwals-heartwarming-message-for-odean-smith-after-rahul-tewatia-destroys-pbks-737211","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Gujarat defeated Punjab by 6 wicketsHardik’s Gujarat are yet to lose in IPL 2022They next play against SRH on Monday","content":"Mayank AgarwalMayank AgarwalPunjab Kings (PBKS) captain Mayank Agarwal has backed Odean Smith \"100%\" after Rahul Tewatia smashed the West Indian bowler for two consecutive sixes to help Gujarat Titans (GT) win.GT needed 19 runs off the final over during his chase of 190 in their Indian Premier League (IPL) 2022 clash with PBKS on Friday. After bowling a wide, Odean removed GT captain Hardik Pandya. The dismissal brought Rahul Tewatia in the middle. David Miller hit a four and an overthrow from Odean gifted GT a run, bringing Tewatia at the crease. GT needed 12 runs off the final two balls. SIX! SIX! Odean was left devastated as GT players ran to the ground to embrace their hero, Tewatia. PBKS defeated GT by six wickets to register their third consecutive win in IPL 2022. Shu vaat 'chhe' x 2⃣pic.twitter.com/DiTB9e473X— Gujarat Titans (@gujarat_titans) April 8, 2022 In the post-match interview, Mayank said that the last over could have gone anywhere and they will back Odean totally as it is just a game of cricket. The PBKS skipper also praised Kagiso Rabada and Arshdeep Singh. While Rabada picked up two wickets, the latter did not make a breakthrough but bowled economically. \"It was a tough game but we really fought hard. We were 5-7 runs short but we pulled it back after the start they had. There were a lot of positives for us. We did really well to get ourselves to that score after losing so many wickets, so we were very happy with that. We fought really hard on the field. It was great execution by both of them (Rabada and Arshdeep), a fantastic effort by them to pull the game, they really got us in the game. The last over could have been anyone's game. We totally back Odean, it's fine, he probably had a hard game but that's fine. We back him a 100%. It's just a game of cricket, it could be a bitter one to swallow but it's fine. The talk in the group is we always back the guys. If he has a bad day, he has a bad day, no worries, we back him 100%,\" added Mayank. Earlier, PBKS' Living Liamstone once again produced an entertaining knock as he scored 64 off 27 balls, including seven fours and four sixes. The next best batsman was Shikhar Dhawan, who scored 35 off 30 balls. PBKS have a four-day break before their IPL 2022 clash with Mumbai Indians (MI) on Wednesday (April 13). Gujarat's next game is scheduled to take place on Monday (April 11) and is against Sunrisers Hyderabad (SRH) at DY Patil Stadium, Navi Mumbai.","pubDate":"2022-04-08 19:43:15","full_description":"Mayank Agarwal Punjab Kings (PBKS) captain Mayank Agarwal has backed Odean Smith \"100%\" after Rahul Tewatia smashed the West Indian bowler for two consecutive sixes to help Gujarat Titans (GT) win. GT needed 19 runs off the final over during his chase of 190 in their Indian Premier League (IPL) 2022 clash with PBKS on Friday. After bowling a wide, Odean removed GT captain Hardik Pandya. The dismissal brought Rahul Tewatia in the middle. David Miller hit a four and an overthrow from Odean gifted GT a run, bringing Tewatia at the crease. GT needed 12 runs off the final two balls. SIX! SIX! Odean was left devastated as GT players ran to the ground to embrace their hero, Tewatia. PBKS defeated GT by six wickets to register their third consecutive win in IPL 2022. Shu vaat 'chhe' x 2⃣ pic.twitter.com/DiTB9e473X In the post-match interview, Mayank said that the last over could have gone anywhere and they will back Odean totally as it is just a game of cricket. The PBKS skipper also praised Kagiso Rabada and Arshdeep Singh. While Rabada picked up two wickets, the latter did not make a breakthrough but bowled economically. \"It was a tough game but we really fought hard. We were 5-7 runs short but we pulled it back after the start they had. There were a lot of positives for us. We did really well to get ourselves to that score after losing so many wickets, so we were very happy with that. We fought really hard on the field. It was great execution by both of them (Rabada and Arshdeep), a fantastic effort by them to pull the game, they really got us in the game. The last over could have been anyone's game. We totally back Odean, it's fine, he probably had a hard game but that's fine. We back him a 100%. It's just a game of cricket, it could be a bitter one to swallow but it's fine. The talk in the group is we always back the guys. If he has a bad day, he has a bad day, no worries, we back him 100%,\" added Mayank. Earlier, PBKS' Living Liamstone once again produced an entertaining knock as he scored 64 off 27 balls, including seven fours and four sixes. The next best batsman was Shikhar Dhawan, who scored 35 off 30 balls. PBKS have a four-day break before their IPL 2022 clash with Mumbai Indians (MI) on Wednesday (April 13). Gujarat's next game is scheduled to take place on Monday (April 11) and is against Sunrisers Hyderabad (SRH) at DY Patil Stadium, Navi Mumbai.","image_url":"https://assets.thehansindia.com/h-upload/2022/04/08/500x300_1285975-mayank-agarwal.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 PBKS vs GT Highlights: Tewatia hits 2 sixes to guide Gujarat to 6-wicket win over Punjab - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiY2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLXBia3MtdnMtZ3QtbGl2ZS1jcmlja2V0LXNjb3JlLW9ubGluZS03ODU5OTE1L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 PBKS vs GT Highlights: Tewatia hits 2 sixes to guide Gujarat to 6-wicket win over Punjab  The Indian ExpressIPL Match Stars, PBKS vs GT: Rahul Tewatia's 2 SIXES in final 2 balls. What a thriller!  DNAIndiaNewsLive Cricket Score: PBKS vs GT, Match 16, IPL 2022 | Cricbuzz.com  CricbuzzLive match blog - Punjab Kings vs Titans 16th Match 2022 - Cricket Insights  ESPNcricinfoHighlights, Tata IPL 2022 PBKS vs GT, Full cricket score: Tewatia seals the match as Titans win thriller - Firstcricket News  FirstpostView Full coverage on Google News","content":null,"pubDate":"2022-04-08 19:04:49","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Shubman Gill one of finest talents in world","link":"https://www.thehansindia.com/sports/cricket/shubman-gill-one-of-finest-talents-in-world-737186","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Former India coach Ravi Shastri has called young batter Shubman Gill \"one of the finest talents in world cricket\", someone who is tailor-made for the game's T20 format because of his wide range of strokes.","content":"Mumbai: Former India coach Ravi Shastri has called young batter Shubman Gill \"one of the finest talents in world cricket\", someone who is tailor-made for the game's T20 format because of his wide range of strokes.Gill, 22, who is playing for Gujarat Titans in the IPL, is using the ongoing season as an opportunity to make the Indian team for the ICC T20 World Cup in Australia. Speaking on Gill's performance in the early stages of the tournament, Shastri said on Star Sports' Cricket Live, \"Gill is one of the finest talents in the country and in world cricket, to be honest. If he gets going, he can score big. He makes it (batting) look easy when he's set. \"He's got the punch, he's got the time, and he's got the power to clear the ground. He's just made for this format of the game. It's just his shot selection, his rotation of the strike which helps him take the pressure away.\" Gill has impressed with his game in the ongoing IPL and looks set to play a few influential knocks in the coming weeks. \"He's the guy who's capable of putting bad balls away. Very good on the short ball and the short-arm jab,\" Shastri said. \"Early stages in the tournament, good batting tracks, you get to your highest score, you're playing for a new franchisee, it can only boost your confidence.\" ","pubDate":"2022-04-08 18:59:17","full_description":"Mumbai: Former India coach Ravi Shastri has called young batter Shubman Gill \"one of the finest talents in world cricket\", someone who is tailor-made for the game's T20 format because of his wide range of strokes. Gill, 22, who is playing for Gujarat Titans in the IPL, is using the ongoing season as an opportunity to make the Indian team for the ICC T20 World Cup in Australia. Speaking on Gill's performance in the early stages of the tournament, Shastri said on Star Sports' Cricket Live, \"Gill is one of the finest talents in the country and in world cricket, to be honest. If he gets going, he can score big. He makes it (batting) look easy when he's set. \"He's got the punch, he's got the time, and he's got the power to clear the ground. He's just made for this format of the game. It's just his shot selection, his rotation of the strike which helps him take the pressure away.\" Gill has impressed with his game in the ongoing IPL and looks set to play a few influential knocks in the coming weeks. \"He's the guy who's capable of putting bad balls away. Very good on the short ball and the short-arm jab,\" Shastri said. \"Early stages in the tournament, good batting tracks, you get to your highest score, you're playing for a new franchisee, it can only boost your confidence.\"","image_url":"https://assets.thehansindia.com/h-upload/2022/04/08/500x300_1285940-shubman-gill.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"“I am getting tired”: Hardik Pandya provides fitness update after bowling 4 overs in IPL 2022 matches","link":"https://thesportsrush.com/cricket-news-i-am-getting-tired-hardik-pandya-provides-fitness-update-after-bowling-4-overs-in-ipl-2022-matches/","keywords":["Cricket","Gujarat Titans","IPL 2022","Punjab Kings","GT","Hardik Pandya","Indian Premier League","PBKS"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Hardik Pandya provides fitness update: The captain of Gujarat Titans has been contributing across departments in IPL 2022. Gujarat Titans captain Hardik Pandya has expressed sympathy for Punjab Kings after beating them in a match which they should’ve ideally won. A 190-run chase was brought down to Titans needing 12 runs off the last two… The post “I am getting tired”: Hardik Pandya provides fitness update after bowling 4 overs in IPL 2022 matches appeared first on The SportsRush.","content":"Hardik Pandya provides fitness update: The captain of Gujarat Titans has been contributing across departments in IPL 2022. Gujarat Titans captain Hardik Pandya has expressed sympathy for Punjab Kings after beating them in a match which they should’ve ideally won. A 190-run chase was brought down to Titans needing 12 runs off the last two overs. All-rounder Rahul Tewatia, having played just one delivery, hit consecutive sixes off Odean Smith to seal the chase. “Hats off to [Rahul] Tewatia. It is difficult to go out there and hit, and to do it under this pressure is great. It was [Punjab] Kings’ game, I have sympathy for them,” Pandya told Star Sports during the post-match presentation ceremony. Opening batter Shubman Gill controlled the chase for almost 19 overs to end up with a career-best 96 (59) comprising of 11 fours and a six. With Gujarat losing wicket-keeper batter Matthew Wade (6) cheaply, Gill had put together a 101-run partnership for the second wicket alongside debutant batter Sai Sudharsan (35). “[Shubman] Gill is telling everybody that he is there. A lot of credit goes to Sai [Sudharsan] as well for that partnership. It kept us in the game,” Pandya added. Hardik Pandya provides fitness update after bowling 4 overs in IPL 2022 matches Pandya, who opened the bowling with Mohammed Shami at the Brabourne Stadium tonight, had managed to draw first blood by dismissing counterpart Mayank Agarwal (5). This season has also witnessed Pandya consistently batting at No. 4. The -year old player contributed with 27 (18) with the help of five fours tonight as well. Pandya, who has missed out on a lot of cricket in the last year or so due to his back surgery, appears to be in this good physical state after a long time. Being asked about the same, Pandya admitted to “getting tired” after bowling four overs but remained positive about his overall fitness status. This team incredible! The fighting spirit! We never give up! @gujarat_titans pic.twitter.com/irEsl230iC — hardik pandya (@hardikpandya7) April 8, 2022 “I am going to get better with every game. I am getting tired as I’m not used to bowling four overs. But I’m getting better,” Pandya concluded. Second-highest run-scorer for GT thus far, Pandya’s 91 runs have come at an average and strike rate of 30.33 and 124.65 respectively. In the 12 overs that he’s bowled across three innings, Pandya has picked a couple of wickets at an economy rate of 7.91. The post “I am getting tired”: Hardik Pandya provides fitness update after bowling 4 overs in IPL 2022 matches appeared first on The SportsRush.","pubDate":"2022-04-08 18:56:26","full_description":"Hardik Pandya provides fitness update: The captain of Gujarat Titans has been contributing across departments in IPL 2022. Gujarat Titans captain Hardik Pandya has expressed sympathy for Punjab Kings after beating them in a match which they should’ve ideally won. A 190-run chase was brought down to Titans needing 12 runs off the last two overs. All-rounder Rahul Tewatia, having played just one delivery, hit consecutive sixes off Odean Smith to seal the chase . “Hats off to [Rahul] Tewatia. It is difficult to go out there and hit, and to do it under this pressure is great. It was [Punjab] Kings’ game, I have sympathy for them,” Pandya told Star Sports during the post-match presentation ceremony. Opening batter Shubman Gill controlled the chase for almost 19 overs to end up with a career-best 96 (59) comprising of 11 fours and a six. With Gujarat losing wicket-keeper batter Matthew Wade (6) cheaply, Gill had put together a 101-run partnership for the second wicket alongside debutant batter Sai Sudharsan (35). “[Shubman] Gill is telling everybody that he is there. A lot of credit goes to Sai [Sudharsan] as well for that partnership. It kept us in the game,” Pandya added. Pandya, who opened the bowling with Mohammed Shami at the Brabourne Stadium tonight, had managed to draw first blood by dismissing counterpart Mayank Agarwal (5). This season has also witnessed Pandya consistently batting at No. 4. The 28-year old player contributed with 27 (18) with the help of five fours tonight as well. Pandya, who has missed out on a lot of cricket in the last year or so due to his back surgery, appears to be in this good physical state after a long time. Being asked about the same, Pandya admitted to “getting tired” after bowling four overs but remained positive about his overall fitness status. This team incredible! The fighting spirit! We never give up! 💥💥 @gujarat_titans pic.twitter.com/irEsl230iC — hardik pandya (@hardikpandya7) April 8, 2022 “I am going to get better with every game. I am getting tired as I’m not used to bowling four overs. But I’m getting better,” Pandya concluded. Second-highest run-scorer for GT thus far, Pandya’s 91 runs have come at an average and strike rate of 30.33 and 124.65 respectively. In the 12 overs that he’s bowled across three innings, Pandya has picked a couple of wickets at an economy rate of 7.91.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Na na Tewatia na”: Yuvraj Singh exults no ends as Rahul Tewatia smashes 2 consecutive sixes to win last over thriller vs Punjab Kings in IPL 2022","link":"https://thesportsrush.com/cricket-news-na-na-tewatia-na-yuvraj-singh-exults-no-ends-as-rahul-tewatia-smashes-2-consecutive-sixes-to-win-last-over-thriller-vs-punjab-kings-in-ipl-2022/","keywords":["Cricket","Gujarat Titans","IPL 2022","Punjab Kings","GT","Indian Premier League","IPL","PBKS","Rahul Tewatia","Yuvraj Singh"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Yuvraj Singh exults no ends as Rahul Tewatia pulls of a nearly improbable task yet again in an Indian Premier League game. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans beat Punjab Kings by 6 wickets in… The post “Na na Tewatia na”: Yuvraj Singh exults no ends as Rahul Tewatia smashes 2 consecutive sixes to win last over thriller vs Punjab Kings in IPL 2022 appeared first on The SportsRush.","content":"Yuvraj Singh exults no ends as Rahul Tewatia pulls of a nearly improbable task yet again in an Indian Premier League game. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans beat Punjab Kings by 6 wickets in an absolute humdinger of a contest. In a quintessential edge-of-a-seat thriller, on bound towards the score of 189/9 posted by PBKS after batting first, GT needed 12 runs off the final two deliveries. Not another household name anymore, on the strike was the Southpaw all-rounder Rahul Tewatia, who was again at the cusp of doing the unthinkable. While he just managed to clear the mid-wicket fence off the penultimate delivery of the final Over bowled by Odean Smith, he took a step towards his left on the final ball, wielded his axe towards the same region although with a timing par excellence this time around to lift up the entire stadium and the GT camp in astonishment and awe. The two sixes made the fans go nostalgic back to the 2020 edition of the league, when he hit fives sixes off Sheldon Cottrell (another West Indian) in an Over against Punjab there as well, to eventually take his side home in what was a record chase. ALSO READ: Virender Sehwag’s reaction on Rahul Tewatia’s 2 sixes off Odean Smith Yuvraj Singh exults no ends as Rahul Tewatia does it again Expressing his excitement like every other Cricket fan, former India all-rounder Yuvraj Singh took to his social media handle, to praise Tewatia’s heroics for his three-ball stay at the crease, while also pulling Gujarat Titans’ head coach Ashish Nehra’s leg by taking a dig at his smile. Naam tu suna hoga !! @rahultewatia02 na na tawatiya naaa what a player ! Aur nehra ji ki smile off side what a game !! #IPL2022 at its best #GTvsPBKS — Yuvraj Singh (@YUVSTRONG12) April 8, 2022 For more Cricket-related news, click here. The post “Na na Tewatia na”: Yuvraj Singh exults no ends as Rahul Tewatia smashes 2 consecutive sixes to win last over thriller vs Punjab Kings in IPL 2022 appeared first on The SportsRush.","pubDate":"2022-04-08 18:53:52","full_description":"Yuvraj Singh exults no ends as Rahul Tewatia pulls of a nearly improbable task yet again in an Indian Premier League game. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans beat Punjab Kings by 6 wickets in an absolute humdinger of a contest. In a quintessential edge-of-a-seat thriller, on bound towards the score of 189/9 posted by PBKS after batting first, GT needed 12 runs off the final two deliveries. Not another household name anymore, on the strike was the Southpaw all-rounder Rahul Tewatia, who was again at the cusp of doing the unthinkable. While he just managed to clear the mid-wicket fence off the penultimate delivery of the final Over bowled by Odean Smith, he took a step towards his left on the final ball, wielded his axe towards the same region although with a timing par excellence this time around to lift up the entire stadium and the GT camp in astonishment and awe. The two sixes made the fans go nostalgic back to the 2020 edition of the league, when he hit fives sixes off Sheldon Cottrell (another West Indian) in an Over against Punjab there as well, to eventually take his side home in what was a record chase. ALSO READ : Virender Sehwag’s reaction on Rahul Tewatia’s 2 sixes off Odean Smith Expressing his excitement like every other Cricket fan, former India all-rounder Yuvraj Singh took to his social media handle, to praise Tewatia’s heroics for his three-ball stay at the crease, while also pulling Gujarat Titans’ head coach Ashish Nehra’s leg by taking a dig at his smile. Naam tu suna hoga !! @rahultewatia02 na na tawatiya naaa😂😂😂 what a player ! Aur nehra ji ki smile off side 😁😁😁 what a game !! #IPL2022 at its best #GTvsPBKS — Yuvraj Singh (@YUVSTRONG12) April 8, 2022 For more Cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Need his statue in Punjab King dugout”: Virender Sehwag salutes Rahul Tewatia for hitting 2 sixes off Odean Smith to win IPL 2022 match","link":"https://thesportsrush.com/cricket-news-need-his-statue-in-punjab-king-dugout-virender-sehwag-salutes-rahul-tewatia-for-hitting-2-sixes-off-odean-smith-to-win-ipl-2022-match/","keywords":["Cricket","Gujarat Titans","IPL 2022","Punjab Kings","GT","Indian Premier League","Odean Smith","PBKS","Rahul Tewatia"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rahul Tewatia: The all-rounder from Gujarat Titans single-handedly won the second IPL 2022 match for his team. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans beat Punjab Kings by 6 wickets to win their third consecutive match.… The post “Need his statue in Punjab King dugout”: Virender Sehwag salutes Rahul Tewatia for hitting 2 sixes off Odean Smith to win IPL 2022 match appeared first on The SportsRush.","content":"Rahul Tewatia: The all-rounder from Gujarat Titans single-handedly won the second IPL 2022 match for his team. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans beat Punjab Kings by 6 wickets to win their third consecutive match. Chasing a 190-run target, Gujarat had been keeping up to the required run rate for a large part of their innings. With the match coming down to them needing 37 runs off the last three overs, Punjab fast bowler Arshdeep Singh gave away only five runs to hand a massive advantage to his team. Titans captain Hardik Pandya (27) hit a couple of boundaries in the penultimate over to keep a victory in sight but them losing Pandya and opening batter Shubman Gill (96) in quick succession brought down the equation to requiring 18 runs off five balls. Kings all-rounder Odean Smith did keep his team in the match but failed to deliver when it mattered the most on the back of leaking 12 runs off the last two deliveries. Having come out to bat in the last over, GT all-rounder Rahul Tewatia hit consecutive sixes to win the second match for his team. Tewatia, who preferred his favourite leg-side, sat on his knee to hit Smith towards the mid-wicket region on consecutive deliveries. Twitter reactions on Rahul Tewatia: Waah Lord Tewatia,…. Need his statue in Punjab Kings dugout. What a brainfade by Smith to concede a overthrow with 13 needed of 2. #PBKSvGT — Virender Sehwag (@virendersehwag) April 8, 2022 T E W A T I A. — KSR (@KShriniwasRao) April 8, 2022 T.E.W.A.T.I.A Wouldn’t be an IPL now without him — Lisa Sthalekar (@sthalekar93) April 8, 2022 No tournament gets close to the drama & finishes the #IPL brings … That was ridiculous … #Tewatia — Michael Vaughan (@MichaelVaughan) April 8, 2022 For more cricket-related news, click here. The post “Need his statue in Punjab King dugout”: Virender Sehwag salutes Rahul Tewatia for hitting 2 sixes off Odean Smith to win IPL 2022 match appeared first on The SportsRush.","pubDate":"2022-04-08 18:13:54","full_description":"Rahul Tewatia: The all-rounder from Gujarat Titans single-handedly won the second IPL 2022 match for his team. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans beat Punjab Kings by 6 wickets to win their third consecutive match. Chasing a 190-run target, Gujarat had been keeping up to the required run rate for a large part of their innings. With the match coming down to them needing 37 runs off the last three overs, Punjab fast bowler Arshdeep Singh gave away only five runs to hand a massive advantage to his team. Titans captain Hardik Pandya (27) hit a couple of boundaries in the penultimate over to keep a victory in sight but them losing Pandya and opening batter Shubman Gill (96) in quick succession brought down the equation to requiring 18 runs off five balls. Kings all-rounder Odean Smith did keep his team in the match but failed to deliver when it mattered the most on the back of leaking 12 runs off the last two deliveries. Having come out to bat in the last over, GT all-rounder Rahul Tewatia hit consecutive sixes to win the second match for his team. Tewatia, who preferred his favourite leg-side, sat on his knee to hit Smith towards the mid-wicket region on consecutive deliveries. Waah Lord Tewatia,…. Need his statue in Punjab Kings dugout. What a brainfade by Smith to concede a overthrow with 13 needed of 2. #PBKSvGT — Virender Sehwag (@virendersehwag) April 8, 2022 T E W A T I A. ❤ — KSR (@KShriniwasRao) April 8, 2022 T.E.W.A.T.I.A 💥💥🤯😱 Wouldn’t be an IPL now without him — Lisa Sthalekar (@sthalekar93) April 8, 2022 No tournament gets close to the drama & finishes the #IPL brings … That was ridiculous … #Tewatia — Michael Vaughan (@MichaelVaughan) April 8, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/punjab-kings-vs-gujarat-titans-live-score-over-match-16-t20-16-20-updates-2872348","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Punjab Kings vs Gujarat Titans from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-08 18:05:54","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 20.0 overs, Gujarat Titans, chasing a target of 190, are 190/4. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Punjab Kings and Gujarat Titans. Everything related to Punjab Kings and Gujarat Titans match will be available on Sports.NDTV.com . Stay updated with Punjab Kings vs Gujarat Titans live score. Do check for Punjab Kings vs Gujarat Titans scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. Stay tuned for the presentation... The man of the moment, Rahul Tewatia is up for a quick chat. He says that he had no time to think and just had to hit sixes. Says that he knew that Odean Smith will be looking to bowl it outside off stump and that is the reason he shuffled across to hit the the ball. Mentions that the atmosphere in the dressing room is pretty relaxed and they have a very good support staff. Mayank Agarwal, the skipper of Punjab, is in for a chat. He says It was a tough game for them. Adds that they were 5-10 runs short with the bat. Tells that they did really well to get to 189 after losing wickets in a cluster in the middle overs. Mentions that Kagiso Rabada and Arshdeep Singh did a fantastic job in the end overs. Says that Odean Smith had a bad day but he has full backing of his team. Punjab never gave up! They fought till the very end, which turned this encounter into a nail-biter. The bowler were taken to the cleaners by Gill. The second wicket stand of 101 runs proved to be ominous for them. It was Chahar who came back to break the deadly partnership. In the death overs, Punjab bowlers came back to life and added some pressure with the new batter at the crease. Arshdeep Singh and Kagiso Rabada certainly got them back in the game. As you know, the game of cricket can be a cruel one and that's what Odean Smith had to face today. He failed to defend 19 runs in the final over but his team-mates supported him really well after the game. So, Gujarat still the team to beat this season. It's three in three for them. All points in the bag until now. Even after losing Wade pretty early on, it was Shubman Gill who rose to the occasion and maintained superb control over one end. Gill started his innings with two consecutive boundaries, he played the same way throughout. In his whole innings of 96 runs, only once did he play a weak shot, while rest of them were right on the money. Sai Sudharsan did not came across as a player making a debut in this league. He looked flawless with the blade in his hand. He could not continue at a brisk rate and perished eventually. Hardik came into the crease with Gill still going on. Gujarat needed 32 from 12 balls. But then Gujarat lost both of them in 7 deliveries. It was the heroics of Rahul Tewatia which made them to get over the line. Down to the wire and RAHUL TEWATIA keeps his calm. That's it! There is not much to right about this lad. What temperament Tewatia has. 12 runs were needed off the last two deliveries and Tewatia hits both of them out of the park to extend his side's winning run in the competition. Agony for Punjab, while Gujarat are ecstatic at the moment. 19.6 overs (6 Runs) SIX! BOOM! TEWATIA, YOU BEAUTY! He has done it! The game is not over until that man, Tewatia is at the crease they say, and he proves everyone right. A length ball, outside off. Tewatia shuffles across and smokes it way over the long on region for a biggie. Gujarat win by 6 wickets! 19.5 overs (6 Runs) SIX! BANG! TEWATIA BELIEVES! On a length, outside off. Rahul Tewatia shuffles across and smacks it just over the deep mid-wicket fielder for a maximum. 19.4 overs (1 Run) Smith misses his shy at his end and the batters take a run. A length ball, well outside off. Miller drags it back to the bowler. Smith collects it cleanly but fails to score a direct hit at the non-striker's end. 19.3 overs (4 Runs) FOUR! WHACKED! A length ball, around leg. Miller sits back and heaves it through the mid-wicket region for a boundary. 19.2 overs (1 Run) A full ball, outside off. Rahul Tewatia drives it to deep cover for a single. 17 runs needed off 4 balls. 19.1 overs (0 Run) OUT! RUN OUT! Oh, dear! Absolute chaos in the middle and it is Gujarat's skipper who walks back to the hut. A length ball, outside off. Miller throws his bat at it but he misses. Jonny Bairstow behind the sticks collects the ball cleanly and underarms it towards the stumps at his end as Hardik Pandya was looking to steal a bye. He falls well short of his crease and Pandya is a goner! Rahul Tewatia is the new batter in. 19.1 overs (1 Run) Wide! A length ball, angling across the batter, from well outside off. David Miller lets it be. Wide called. Odean Smith to bowl the final over. 19 needed off 6 balls. The new batter, David Miller on strike. Will Odean Smith be able to defend the target? 18.6 overs (1 Run) A full ball, well outside off. Miller drags it towards long off for a single. 19 runs needed off 6 balls. This game is going down to the wire. Fasten your seatbelts, folks. David Miller is the new man in. 18.5 overs (0 Run) OUT! CAUGHT! Gill holes out and this is a big wicket in the context of this game. A juicy full toss, outside off. Shubman Gill looks to slap it through the off side but he fails to middle it. It goes off the outer half of the blade towards Mayank Agarwal at extra cover who takes a sitter. End of a brilliant innings from Gill but he is absolutely gutted with himself. A crucial wicket for Punjab. GAME ON! 18.4 overs (1 Run) A yorker-length ball, outside off. Pandya squeezes it out towards deep backward point for a single. 18.3 overs (4 Runs) FOUR! AND AGAIN! Rabada misses his mark and serves a low full toss, outside off. Pandya caresses it wide of the long off fielder for another boundary. 18.2 overs (4 Runs) FOUR! A low full toss, around off. Pandya whacks it through the deep mid-wicket region for a boundary. One hand comes off the bat and hence the ball does not go all the way. 18.1 overs (1 Run) Fuller in length, outside off. Gill bunts it towards long on and takes a run. 18.1 overs (2 Runs) NO BALL! A yorker, around middle. Hardik Pandya squeezes it out towards square leg for one run. Rabada oversteps and the umpire signals no ball. Free Hit to follow. 17.6 overs (0 Run) Another yorker, just outside off. Gill shuffles across and looks to scoop it over the short fine leg fielder but he misses and gets hit low on his pad. What an over from Arshdeep Singh! Just 5 runs off the over! The pressure is certainly on Gujarat now. 32 runs needed off 12 balls. 17.5 overs (1 Run) Fuller in length, outside off. Hardik Pandya drills it to long off and manages only a single. 17.4 overs (1 Run) Had that been a direct hit, it would have been curtains for Pandya! A yorker, around middle. Gill digs it out towards square leg for a single. Odean Smith there, collects the ball and has a shy at the striker's end but he misses. 17.3 overs (2 Runs) A full ball, well outside off. Shubman Gill chips it over the extra cover fielder and comes back for the second run. Gill moves to 94. 17.2 overs (1 Run) A yorker, around off. Pandya digs it out towards long off for a single. 17.1 overs (0 Run) A bumper, angling in from off. Hardik Pandya sways away from the line of the delivery. 16.6 overs (2 Runs) Flatter and quicker, outside off. Gill flat-bats it wide of the long off fielder for a brace. 37 runs needed off 18 balls. 16.5 overs (1 Run) DROPPED! Dragged down, on middle. Pandya miscues his pull shot high in the air towards the square leg region. Kagiso Rabada runs in from the deep but puts it down. A single taken. 16.4 overs (0 Run) On a length, outside off. Hardik Pandya punches it back to the bowler. Rahul Chahar dives to his left and stops the ball. 16.3 overs (4 Runs) FOUR! Back-to-back boundaries for the skipper! Full and outside off. Hardik Pandya lofts it back over the bowler's head for another boundary. 16.2 overs (4 Runs) FOUR! A short ball, outside off. Hardik Pandya hangs back and cuts it through the cover region for a boundary. 16.1 overs (0 Run) Nicely tossed, on off. Hardik Pandya blocks it out. 16.1 overs (2 Runs) TWO WIDES! A stumping chance goes abegging! Chahar sees Gill skipping down the track so he bowls it down leg. Jonny Bairstow behind the sticks fails to gather the ball cleanly and the ball goes past him. The batters steal a bye. The umpire calls it wide. 15.6 overs (4 Runs) FOUR! Oh, dear! That spoils a good over for Arshdeep. Still just 6 runs off the over. This is a yorker-length ball, outside off. Pandya sits back and squeezes it out past the diving fielder at backward point for a boundary. 15.5 overs (0 Run) A yorker, outside off. Pandya fails to dig it out. Excellent delivery from Arshdeep. Just 2 runs from the over so far. 15.4 overs (1 Run) Fuller in length, outside off. Gill drives hard but finds the cover fielder. A single taken. 15.3 overs (0 Run) A yorker, wide outside off. Gill squeezes it out towards the short third man fielder. 15.2 overs (1 Run) Back of a length, around off. Hardik Pandya whacks it towards the deep mid-wicket fielder for a single. 15.1 overs (0 Run) A length ball, jagging back in from off, from 'round the wicket. Pandya turns it towards mid-wicket.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637850577467347751.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Shubman Gill is a different class”: Mandeep Singh applauds Shubman Gill for IPL 2022 half-century vs Punjab Kings","link":"https://thesportsrush.com/cricket-news-shubman-gill-is-a-different-class-mandeep-singh-applauds-shubman-gill-for-ipl-2022-half-century-vs-punjab-kings/","keywords":["Cricket","Gujarat Titans","IPL 2022","Punjab Kings","GT","Indian Premier League","mandeep singh","PBKS","Shubman Gill"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Mandeep Singh applauds Shubman Gill: The batter from Delhi Capitals expressed admiration for the batter from Gujarat Titans. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans opening batter Shubman Gill has scored his second consecutive half-century to… The post “Shubman Gill is a different class”: Mandeep Singh applauds Shubman Gill for IPL 2022 half-century vs Punjab Kings appeared first on The SportsRush.","content":"Mandeep Singh applauds Shubman Gill: The batter from Delhi Capitals expressed admiration for the batter from Gujarat Titans. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans opening batter Shubman Gill has scored his second consecutive half-century to . Having scored 84 (46) against Delhi Capitals in their last match at the Maharashtra Cricket Association Stadium earlier this month, Gill walked out to bat in the same rhythm hitting two boundaries off Vaibhav Arora in the first over itself. Facing his Punjab teammate Arshdeep Singh in the next over, Gill hit as many as three eye-catching boundaries on the back of supreme timing which aided him in finding the gaps in the powerplay. While Gujarat had lost wicket-keeper batter Matthew Wade (6) cheaply, Gill managed to score 33* (19) in the powerplay in the company of debutant Sai Sudharshan (35). It was in the eighth over that Gill hit Punjab all-rounder Odean Smith for his only six of the innings. The next over saw the right-hand batter hit another four off Liam Livingstone to bring up a 29-ball half-century. Gill, who appeared certain of scoring his maiden T20 century tonight, departed in a crunch situation in the penultimate over after scoring 96 (59) with the help of 11 fours and a six. In what was his 12th IPL half-century, it was his 14th in T20s and second for Titans. Gill, who seems to be in a different form altogether in terms of being elegant and effortless at the same time, registered his career-best T20 knock at the CCI on Friday. Mandeep Singh applauds Shubman Gill for IPL 2022 half-century vs Punjab Kings While Gill received a lot of applause for his best innings, there were others who were a bit dejected by the prospect of him missing out on a century. Gill, who has played under Mandeep Singh for Punjab in domestic tournaments, managed to impress his former captain as well. @ShubmanGill is a different class #IPL2022 #PBKSvGT — Mandeep Singh (@mandeeps12) April 8, 2022 Playing for Delhi Capitals this season, Mandeep was dropped against Lucknow Super Giants yesterday on the back of back-to-back failures in their first two matches. The post “Shubman Gill is a different class”: Mandeep Singh applauds Shubman Gill for IPL 2022 half-century vs Punjab Kings appeared first on The SportsRush.","pubDate":"2022-04-08 17:58:02","full_description":"Mandeep Singh applauds Shubman Gill: The batter from Delhi Capitals expressed admiration for the batter from Gujarat Titans. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans opening batter Shubman Gill has scored his second consecutive half-century to . Having scored 84 (46) against Delhi Capitals in their last match at the Maharashtra Cricket Association Stadium earlier this month, Gill walked out to bat in the same rhythm hitting two boundaries off Vaibhav Arora in the first over itself. Facing his Punjab teammate Arshdeep Singh in the next over, Gill hit as many as three eye-catching boundaries on the back of supreme timing which aided him in finding the gaps in the powerplay. While Gujarat had lost wicket-keeper batter Matthew Wade (6) cheaply, Gill managed to score 33* (19) in the powerplay in the company of debutant Sai Sudharshan (35). It was in the eighth over that Gill hit Punjab all-rounder Odean Smith for his only six of the innings. The next over saw the right-hand batter hit another four off Liam Livingstone to bring up a 29-ball half-century. Gill, who appeared certain of scoring his maiden T20 century tonight, departed in a crunch situation in the penultimate over after scoring 96 (59) with the help of 11 fours and a six. In what was his 12th IPL half-century, it was his 14th in T20s and second for Titans. Gill, who seems to be in a different form altogether in terms of being elegant and effortless at the same time, registered his career-best T20 knock at the CCI on Friday. While Gill received a lot of applause for his best innings, there were others who were a bit dejected by the prospect of him missing out on a century. Gill, who has played under Mandeep Singh for Punjab in domestic tournaments, managed to impress his former captain as well. @ShubmanGill is a different class 🔥 #IPL2022 #PBKSvGT — Mandeep Singh (@mandeeps12) April 8, 2022 Playing for Delhi Capitals this season, Mandeep was dropped against Lucknow Super Giants yesterday on the back of back-to-back failures in their first two matches.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CSK vs SRH Dream11 Prediction, IPL Fantasy Cricket Tips, Playing XI, Pitch Report & Injury Updates For Match 17 - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMimAFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3NrLXZzLXNyaC1kcmVhbTExLXByZWRpY3Rpb24tZmFudGFzeS1jcmlja2V0LXRpcHMtcGxheWluZy14aS11cGRhdGVzLXBpdGNoLXJlcG9ydC1pbmp1cnktdXBkYXRlcy1mb3ItbWF0Y2gtMTctYXByLTl0aC0yMDIyL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CSK vs SRH Dream11 Prediction, IPL Fantasy Cricket Tips, Playing XI, Pitch Report & Injury Updates For Match 17  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-04-08 17:47:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Match 18, RCB vs MI Match Prediction – Who will win today’s IPL match between RCB and MI? - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vd3d3LmNyaWN0cmFja2VyLmNvbS9pcGwtMjAyMi1tYXRjaC0xOC1yY2ItdnMtbWktbWF0Y2gtcHJlZGljdGlvbi13aG8td2lsbC13aW4tdG9kYXlzLWlwbC1tYXRjaC1iZXR3ZWVuLXJjYi1hbmQtbWkv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Match 18, RCB vs MI Match Prediction – Who will win today’s IPL match between RCB and MI?  CricTrackerRCB v MI: Everything you need to know | IPL 2022 | 12th Man TV  Royal Challengers BangaloreWinless Mumbai Indians seek succour in Pune | Cricbuzz.com - Cricbuzz  CricbuzzRCB vs MI Match Prediction- Who Will Win Today's IPL Match Between Royal Challengers Bangalore and Mumbai Indians, IPL 2022, Match 18  Cricket AddictorMatch Preview - RCB vs Mumbai, Indian Premier League 2022, 18th Match  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-04-08 17:44:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Today match umpire name IPL 2022: What is today IPL match third umpire name?","link":"https://thesportsrush.com/cricket-news-today-match-umpire-name-ipl-2022-what-is-today-ipl-match-third-umpire-name/","keywords":["Cricket","IPL 2022","GT","Indian Premier League","IPL","PBKS"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Today match umpire name IPL 2022: Two Indian umpires are officiating in today’s IPL 2022 match between GT and PBKS. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium in Mumbai, fans were left in splits when the on-field umpires… The post Today match umpire name IPL 2022: What is today IPL match third umpire name? appeared first on The SportsRush.","content":"Today match umpire name IPL 2022: Two Indian umpires are officiating in today’s IPL 2022 match between GT and PBKS. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium in Mumbai, fans were left in splits when the on-field umpires referred a potential run-out appeal by the GT fielders to the third umpire. It happened during the 4th Over of the first innings, with GT being invited to bat first post losing the Toss. Hardik Pandya bowled a short delivery outside the off stump to Jonny Bairstow, to which the latter set off for a quick single after tapping the ball towards the covers. A sharp David Miller stationed at the region, was quick onto the ball to come up with an under arm throw diving forward to hit the stumps. The umpire went upstairs for a decision on the matter. However, the fans were very much intrigued to know who the third umpire was, after he started his conversation with the broadcasters in a voice which very much resembled to the legendary Sachin Tendulkar. Today match umpire name IPL 2022 The umpires officiating in the ongoing GT versus PBKS match are Virender Kumar Sharma and Anil Chaudhary. The third umpire for the day is Pashchim Pathak, the umpire who had been the talking point during IPL 2022 as well, for his long hair and an orthodox standing technique while umpiring on the field. As an on-field umpire, Pathak has featured across 63 T20 matches, and 17 matches as the TV or the third umpire. He has also offered his services in 5 Women’s ODI matches as well – 4 matches as on-field umpire and one as the TV umpire. List of umpires in IPL 2022 Indian Umpires for IPL 2022: Anil Chaudhary, C. Shamshuddin, Virender Sharma, K.N. Ananthapadmanabhan, Nitin Menon, S. Ravi, Vineet Kulkarni, Yashwant Barde, Ulhas Gandhe, Anil Dandekar, K Srinivasan, and Pashchim Pathak. Foreign Umpires for IPL 2022: Richard Illingworth (Eng), Paul Reiffel (Aus), and Christopher Gaffaney (NZ) Twitter reactions on Third umpire Pashchim Pathak during PBKS vs GT match For the information of everyone closely following #GTvsPBKS today, the third umpire today is Pashchim Pathak. Even i had to double check to make sure it wasn’t @sachin_rt .#IPL2022 #CricketTwitter — Saran R S (@CricaholicJammy) April 8, 2022 Did you guys also felt that @sachin_rt is the third umpire for todays match by listening to the umpire’s voice… #PBKSvGT #IPL2022 — Piyush Yadav (@i_am_ydpiyush17) April 8, 2022 Every time I hear #PaschimPathak acting as a third umpire during #IPL, I always end up thinking – @sachin_rt ?? Just me???#IPL2022 pic.twitter.com/iWhEtBGRxE — Anuradha S (@anuradhamax7) April 8, 2022 Is Sachin Tendulkar was the third umpire taday ? #IPL2022 #ipl pic.twitter.com/tDUpleQsu2 — CRICKET (@cric8addictyash) April 8, 2022 “This is not helping me” – @sachin_rt the third umpire(!?) talking to the TV director. Yeah Sachin, this is not helping us either. Why are you the third umpire today? — Dhruv Vemula (@dhruvtv) April 8, 2022 For more Cricket-related news, click here. The post Today match umpire name IPL 2022: What is today IPL match third umpire name? appeared first on The SportsRush.","pubDate":"2022-04-08 17:18:42","full_description":"Today match umpire name IPL 2022: Two Indian umpires are officiating in today’s IPL 2022 match between GT and PBKS. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium in Mumbai, fans were left in splits when the on-field umpires referred a potential run-out appeal by the GT fielders to the third umpire. It happened during the 4 th Over of the first innings, with GT being invited to bat first post losing the Toss. Hardik Pandya bowled a short delivery outside the off stump to Jonny Bairstow, to which the latter set off for a quick single after tapping the ball towards the covers. A sharp David Miller stationed at the region, was quick onto the ball to come up with an under arm throw diving forward to hit the stumps. The umpire went upstairs for a decision on the matter. However, the fans were very much intrigued to know who the third umpire was, after he started his conversation with the broadcasters in a voice which very much resembled to the legendary Sachin Tendulkar. The umpires officiating in the ongoing GT versus PBKS match are Virender Kumar Sharma and Anil Chaudhary. The third umpire for the day is Pashchim Pathak, the umpire who had been the talking point during IPL 2022 as well, for his long hair and an orthodox standing technique while umpiring on the field. As an on-field umpire, Pathak has featured across 63 T20 matches, and 17 matches as the TV or the third umpire. He has also offered his services in 5 Women’s ODI matches as well – 4 matches as on-field umpire and one as the TV umpire. Indian Umpires for IPL 2022: Anil Chaudhary, C. Shamshuddin, Virender Sharma, K.N. Ananthapadmanabhan, Nitin Menon, S. Ravi, Vineet Kulkarni, Yashwant Barde, Ulhas Gandhe, Anil Dandekar, K Srinivasan, and Pashchim Pathak. Foreign Umpires for IPL 2022: Richard Illingworth (Eng), Paul Reiffel (Aus), and Christopher Gaffaney (NZ) For the information of everyone closely following #GTvsPBKS today, the third umpire today is Pashchim Pathak. Even i had to double check to make sure it wasn’t @sachin_rt 😂. #IPL2022 #CricketTwitter — Saran R S (@CricaholicJammy) April 8, 2022 Did you guys also felt that @sachin_rt is the third umpire for todays match by listening to the umpire’s voice…😅😂 #PBKSvGT #IPL2022 — Piyush Yadav (@i_am_ydpiyush17) April 8, 2022 Every time I hear #PaschimPathak acting as a third umpire during #IPL , I always end up thinking – @sachin_rt ??😅😅😅 Just me??? #IPL2022 pic.twitter.com/iWhEtBGRxE — Anuradha S (@anuradhamax7) April 8, 2022 Is Sachin Tendulkar was the third umpire taday ? 😂 #IPL2022 #ipl pic.twitter.com/tDUpleQsu2 — CRICKET (@cric8addictyash) April 8, 2022 “This is not helping me” – @sachin_rt the third umpire(!?) talking to the TV director. Yeah Sachin, this is not helping us either. Why are you the third umpire today? — Dhruv Vemula (@dhruvtv) April 8, 2022 For more Cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/punjab-kings-vs-gujarat-titans-live-score-over-match-16-t20-11-15-updates-2872269","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Punjab Kings vs Gujarat Titans from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-08 17:04:17","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 14.4 overs, Gujarat Titans, chasing a target of 190, are 133/2. The live updates of Punjab Kings vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Punjab Kings vs Gujarat Titans, Punjab Kings vs Gujarat Titans live score, Punjab Kings vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Hardik Pandya walks out to bat now. 14.4 overs (0 Run) OUT! c Mayank Agarwal b Rahul Chahar. 14.3 overs (1 Run) A single as this is worked down to long off. 14.2 overs (2 Runs) Touch short, on off. Gill reverse-hits it over the backward point. The ball lands safely and they take two. 14.1 overs (2 Runs) Fuller, outside off. Gill pushes it gently into covers for two runs. Gill moves to 86, his highest in the Indian T20 League. Rahul Chahar (2-0-22-0) is back on. 13.6 overs (0 Run) Length ball, outside off. Sai Sudharsan blocks it to backward point. 13.5 overs (1 Run) Back of a length, on off. Shubman Gill pulls it to deep square leg for a single. 13.4 overs (1 Run) This time Sai Sudharsan gets a single to mid on. He pushes a full delivery, down the ground. 13.3 overs (4 Runs) FOUR! Incredible stroke. A cross-seamed delivery, on a length, Sai Sudharsan presses forward, loft it over mid on and bags a boundary. 13.2 overs (1 Run) Length, on the pads. Shubman Gill tucks it to square leg for one. 13.1 overs (2 Runs) Full length, on off. Gill flicks it through mid-wicket for two runs. Strategic break! Well, 71 runs required from 42 balls, and one will have to say that Gujarat is clearly in the driver's seat at the moment, with 9 wickets in hand. The pair of Shubman Gill and Sai Sudharsan has made sure that Gujarat keeps up with the asking rate. Punjab will need to break this stand sooner rather than later, as the game has started to drift away from them. Kagiso Rabada comes back into the attack. 12.6 overs (1 Run) Length ball, on the pads. Shubman Gill tucks it to deep square leg for a single. 12.5 overs (1 Run) A short ball, on off. Sai Sudharsan drags his pull to deep mid-wicket for a single. 12.4 overs (1 Run) Full, on leg. Fill flicks it to deep square leg for a single. 12.3 overs (4 Runs) FOUR! CRACKED! Short ball, outside off. Shubman Gill stand tall and cuts it through covers for a boundary. 12.2 overs (1 Run) Another single! Length ball, on the pads. Sai Sudharsan whips it to deep square leg for a single. 12.1 overs (1 Run) Full length, on the stumps. Gill advances down the track and pushes it through covers for one. 11.6 overs (1 Run) Length ball, around off. Gill drives it down the ground for a single. 11.5 overs (4 Runs) FOUR! Everything Gill touches turns into gold. Back of a length, outside off. Shubman Gill pulls it through the gap between deep mid-wicket and wide long on for a boundary. 11.4 overs (1 Run) LEG BYE! Sai Sudharsan moves down leg. Arshdeep Singh follows the batter with a full-length delivery. Sai Sudharsan fails to flick it away. The ball goes to short third man off the pads. They cross for a leg bye. 11.3 overs (0 Run) Good length, outside off. Sai Sudharsan looks to heave it across the line but misses it completely. 11.2 overs (0 Run) Full length, down leg. Sai Sudharsan fails to flick it away. The ball rolls to the leg side off the pads. 11.1 overs (1 Run) Length ball, angled into the bodyline. Shubman Gill flicks it to mid-wicket for one. Arshdeep Singh comes back to bowl. 10.6 overs (1 Run) Back of a length, outside off. Shubman Gill slaps it to deep point for a single. Ouch! Jitesh Sharma seems to have hurt his leg while trying to stop the ball, and he is being taken off the field by the physio. 10.5 overs (4 Runs) FOUR! Cracking shot! It is short, outside off. Gill hangs back and crunches it through covers for a boundary. Gill motoring along really well here. Jitesh Sharma make a sharp dive to his right in the deep but in vain. 10.4 overs (1 Run) Full, wide outside off. Sai Sudharsan slashes it through point for one run. 10.3 overs (1 Run) Short ball, on off. Gill pulls it to deep mid-wicket for a single. 10.2 overs (0 Run) On off, pushed back to the bowler. 10.1 overs (2 Runs) Fuller, on the pads. Shubman Gill flicks it through mid-wicket for two runs. This is excellent running.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637850540503209460.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"FM vs TVS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Sharjah Ramadan T20 League - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiqQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vY3JpY2tldC1uZXdzL2ZtLXZzLXR2cy1kcmVhbTExLXByZWRpY3Rpb24tZmFudGFzeS1jcmlja2V0LXRpcHMtZHJlYW0xMS10ZWFtLXBsYXlpbmcteGktcGl0Y2gtcmVwb3J0LWluanVyeS11cGRhdGUtc2hhcmphaC1yYW1hZGFuLXQyMC1sZWFndWUv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"FM vs TVS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Sharjah Ramadan T20 League  Cricket AddictorFM vs TVS Dream11 Team Prediction: Check Captain, Vice-Captain, and Probable Playing XIs for Sharjah Ramada  News18Sharjah Ramadan T20 League 2022, Match 25: KAS vs DCS Dream11 Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Update  CricTrackerMEM vs RKE Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Sharjah Ramadan T20 League, Match 24  SportskeedaKAS vs DCS Dream11 Team Prediction: Check Captain, Vice-Captain, and Probable Playing XIs for Sharjah Ramad  News18View Full coverage on Google News","content":null,"pubDate":"2022-04-08 16:51:31","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/punjab-kings-vs-gujarat-titans-live-score-over-match-16-t20-6-10-updates-2872168","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Punjab Kings vs Gujarat Titans from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-08 16:44:01","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.4 overs, Gujarat Titans, chasing a target of 190, are 98/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Punjab Kings and Gujarat Titans. Everything related to Punjab Kings and Gujarat Titans match will be available on Sports.NDTV.com . Stay updated with Punjab Kings vs Gujarat Titans live score. Do check for Punjab Kings vs Gujarat Titans scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (0 Run) On a length and angling in from outside off. Sai Sudharsan looks to cut but he gets a thick inside edge, onto the deck and just past the leg stump. 6 runs off the over. 9.5 overs (0 Run) Play and a miss! Short of a length, outside off. Sai Sudharsan throws his bat at it but he fails to get any blade on it. 9.4 overs (4 Runs) FOUR! CLASSY! Fuller in length, well outside off. Sai Sudharsan reaches out and nails his extra cover drive, past the mid off fielder for a boundary. 9.3 overs (0 Run) A low full toss, outside off. Sai Sudharsan looks to slog but he misses out and fails to make any connection. 9.2 overs (1 Run) Short and wide, outside off. Shubman Gill cuts it hard but straight to the deep cover fielder for only a single. 9.1 overs (1 Run) In the air...but safe! On a length, around middle. Sai Sudharsan looks to heave it across the line but it goes off the top edge and falls just in front of the long on fielder who runs in from the deep. A single taken! Strategic break! Gujarat has gotten off to a good start, courtesy of some fine batting from Gill. Although, he must make sure that he bats deep and takes his side closer to Punjab's total. The momentum is clearly with Gujarat at the moment and Punjab needs wickets in a cluster if they are to stage a comeback in this game. 8.6 overs (1 Run) Flatter and quicker, going on with the angle, from middle. Sai Sudharsan nudges it around the corner and takes a run. 8.5 overs (1 Run) Full and on middle. Shubman Gill eases it to long on for a single. 8.4 overs (4 Runs) FOUR! SMASHED! Short and wide, outside off. Gill cuts it hard past the point fielder and fetches himself another boundary. 8.3 overs (0 Run) An appeal for LBW but the umpire says no! A flatter ball, on a length and going on with the angle, from middle. Shubman Gill gets forward to defend but he gets an inside edge onto his pad. 8.2 overs (4 Runs) FOUR! WHACKED! This is some shot from the young man! Tossed up, outside off. Shubman Gill prods and drives it wide of the extra cover fielder for a boundary. FIFTY FOR GILL! 8.1 overs (2 Runs) Flatter and quicker, outside off. Shubman Gill cuts it wide of the deep point fielder for a brace. Slight halt in play. Sai Sudharsan has gone off the field. He is back now and we are good to resume. 7.6 overs (1 Run) Good-length ball, outside off. Shubman Gill looks to push it through the off side but it goes off the thick outside edge towards third man for one run. 7.5 overs (1 Run) On a length, around off. Sai Sudharsan looks to heave it across the line but he gets an inside edge onto his pad. Smith puts in an appeal but the umpire is unmoved. The ball rolls away and the batters take a run. 7.4 overs (1 Run) Short and outside off. Gill slaps it through the cover region and takes a single. 7.3 overs (0 Run) DROPPED! Back of a length, outside off. Gill flat-bats it straight back to Smith who sticks his left hand out. The ball hits his left and lobs up in the air. Smith tries to grab it on the second attempt but he puts it down. 7.2 overs (6 Runs) SIX! BANG! That is a top shot from Gill! He got into position so quickly there! A bumper, around off. Gill stays back and whacks it over the deep mid-wicket region for a biggie. 7.1 overs (1 Run) Short of a length, outside off. Sai Sudharsan cuts it to deep cover and settles for a single. 6.6 overs (2 Runs) Flatter and quicker, around middle. Shubman Gill tucks it to the leg side and pushed hard for the second run. He makes it easily to the other end. Excellent running between the wickets. 6.5 overs (2 Runs) An overpitched ball, on middle. Gill whips it through the deep mid-wicket region and takes a couple of runs as Liam Livingstone in the deep, cuts it off. 6.4 overs (0 Run) Floated, full and around off. Shubman Gill defends it towards cover. 6.3 overs (2 Runs) Flatter and quicker, outside off. Shubman Gill cuts it wide of the deep cover fielder for a brace. 6.2 overs (1 Run) Around middle. Sai Sudharsan nudges it around the corner for a single. 6.1 overs (6 Runs) SIX! BOOM! Tossed up, on off. Sai Sudharsan slog-sweeps it over the deep mid-wicket region for a biggie. 5.6 overs (1 Run) Leg bye! An appeal for LBW but the umpire says no. Punjab opt for a review and it turns out to be a needles one. This is a length ball, around leg. Sai Sudharsan misses his flick and gets hit on his pad. The Ball Tracker shows that the ball was pitched way outside leg and the on-field decision stands. Punjab burn their review. 5.5 overs (1 Run) On a length, around off. Shubman Gill skips down the track and punches it towards mid off. He scampers through to the other end. 5.4 overs (1 Run) On a length, outside off. Sai Sudharsan guides it to third man and takes a single. 5.3 overs (4 Runs) FOUR! A short ball, around leg. Sai Sudharsan sits back and pulls it very fine, over the short fine leg fielder to bag a boundary. 5.2 overs (0 Run) Short of a length, outside off. Sai Sudharsan cuts hard but Rahul Chahar at backward point, dives to his left and stops a certain boundary. 5.1 overs (1 Run) Back of a length, just outside off. Shubman Gill stays back and punches it to the cover fielder. Liam Livingstone dives to his right and keeps it to just one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637850528317855977.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"PBKS vs GT Live Score, IPL 2022: Rabada removes Wade in Powerplay - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9wYmtzLXZzLWd0LWxpdmUtc2NvcmUtaXBsLTIwMjItcHVuamFiLWtpbmdzLXZzLWd1amFyYXQtdGl0YW5zLW1hdGNoLTE2LWxpdmUtdXBkYXRlcy0xMDE2NDk0MTMzMjcyMDUuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs GT Live Score, IPL 2022: Rabada removes Wade in Powerplay  Hindustan TimesPunjab Kings vs Gujarat Titans Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Punjab Kings vs Titans, Indian Premier League 2022, 16th Match  ESPNcricinfoPBKS vs GT Live Score, IPL 2022: Shubman Gill, Sai Sudharsan steady Gujarat Titans run chase  Times of IndiaShubman Gill is one of the finest talents in world cricket: Shastri  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-04-08 16:36:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/punjab-kings-vs-gujarat-titans-live-score-over-match-16-t20-1-5-updates-2872100","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Punjab Kings vs Gujarat Titans from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-08 16:15:44","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.1 overs, Gujarat Titans, chasing a target of 190, are 46/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Punjab Kings and Gujarat Titans. Everything related to Punjab Kings and Gujarat Titans match will be available on Sports.NDTV.com . Stay updated with Punjab Kings vs Gujarat Titans live score. Do check for Punjab Kings vs Gujarat Titans scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (1 Run) Full length, on off. Gill eases it to long on for another single. 4.5 overs (1 Run) Full-length delivery, outside off. Sai Sudharsan pushes it to mid off on the front foot. The fielder at mid off makes an half-stop. The batters cross for a run. 4.4 overs (0 Run) Fuller, outside off. Sai Sudharsan drives it to cover but straight to the fielder. 4.3 overs (1 Run) On a length, on off. Gill flicks it to mid-wicket for a quick single. 4.2 overs (4 Runs) FOUR! Width given and punished! Back of a length, wide of off. Shubman Gill hangs back, hits it along the ground through covers for four. 4.1 overs (1 Run) Full length, angled down leg. Sai Sudharsan flicks it to deep mid-wicket for an easy single. Shubman Gill looks for the second but Sai Sudharsan sends him back wisely. 3.6 overs (0 Run) A yorker length delivery, on middle and leg. Shubman Gill moves back and digs it out solidly. 3.5 overs (1 Run) Full length, on off. Sai Sudharsan drives it towards mid on and scampers across for a quick single. 3.4 overs (4 Runs) FOUR! Sai Sudharsan opens his account in the Indian T20 League with a boundary. This is full and down leg. Sai Sudharsan gets low and whips it to fine leg for a boundary. 3.3 overs (0 Run) Length ball, on off, defended out solidly. Sai Sudharsan walks in at number 3. 3.2 overs (0 Run) OUT! CAUGHT! Kagiso Rabada strikes straightaway. Mayank Agarwal gets him into the attack to break this opening stand and Rabada provides exactly that. Matthew Wade departs on a low score. Good-length delivery, outside off. This one flies off the deck. Matthew Wade tries to punch it away to the off side. The ball takes the outside edge and goes towards the keeper. Jonny Bairstow makes no mistake behind the sticks. 3.1 overs (1 Run) Full length, on the pads. Gill flicks it to deep square for one. Kagiso Rabada comes into the attack. 2.6 overs (0 Run) On a length, on middle and leg. Wade tucks it to the leg side. Two dots to end the over. A good recovery by Arora. 2.5 overs (0 Run) Length, on leg. Wade clips it to mid-wicket. 2.4 overs (1 Run) Length ball, on the pads. Gill clips it to mid-wicket for an easy single. 2.3 overs (1 Run) Length ball, on the pads. Wade flicks it to square leg for one. 2.2 overs (4 Runs) FOUR! Matthew Wade does not want to miss the party here. This is short, wide outside off. Wade slaps it through covers for a boundary. 2.1 overs (1 Run) Full length, outside off. Gill shuffles across and drives it to cover for a single. 1.6 overs (1 Run) A length ball, outside off. Shubman Gill stays back and guides it to deep point for one. He will retain the strike. An expensive start for Arshdeep Singh, as he gives away 14 in his first over. 1.5 overs (4 Runs) FOUR! Shubman Gill bags his fifth boundary in just 9 deliveries. This a length ball, outside off. Shubman Gill prods and crunches it through covers for a boundary. 1.4 overs (0 Run) Fuller, on middle and leg. Gill taps it back to the bowler. 1.3 overs (4 Runs) FOUR! Shubman Gill only dealing in boundaries. Back of a length, outside off. Shubman Gill stands tall and pulls it in front of square on the leg side for four. 1.2 overs (0 Run) Back of a length, outside off. Gill punches it to cover. 1.1 overs (4 Runs) FOUR! Sheer timing! Shubman Gill looks to be in some incredible form this season. It is full length, on middle and leg. Shubman Gill drives it gently down the ground. It beats the effort of Odean Smith at mid on and goes into the boundary. 1.1 overs (1 Run) WIDE! Arshdeep Singh starts with a loosener! Full length, wide outside the tramline. Shubman Gill leaves it alone. Wide called. Who will bowl from the other end? Arshdeep Singh it is. 0.6 over (0 Run) Back of a length, outside off. Matthew Wade cuts it to backward point but straight to the fielder. Gujarat are off to a flying start here. 0.5 over (1 Run) Full length, on middle and leg. Shubman Gill flicks it to mid-wicket for a single. 0.4 over (0 Run) Length ball, outside off. Gill looks to chase it but misses. 0.3 over (4 Runs) FOUR! Too easy for Shubman Gill. Back-to-back boundaries to start the innings with. A length ball, angled down leg. Shubman Gill stays back and tickles it to fine leg for another boundary. 0.2 over (4 Runs) FOUR! Shubman Gill gets off the mark in fine fashion. This is a short ball, outside off. Shubman Gill cuts it hard through covers for a boundary. 0.1 over (1 Run) Gujarat and Wade are off the mark instantly. A length ball, angled across the left-hander. Matthew Wade dabs it to point for a quick single. Starts with the one angled in.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637850511363028238.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Still two years younger for it”: Amit Mishra jokes about playing for CSK in IPL","link":"https://thesportsrush.com/cricket-news-still-two-years-younger-for-it-amit-mishra-jokes-about-playing-for-csk-in-ipl/","keywords":["Cricket","CSK","IPL 2022","Amit Mishra","chennai super kings","csk","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Amit Mishra jokes about playing for CSK: The veteran Indian spinner isn’t playing in the ongoing season of the Indian Premier League. Veteran India spinner Amit Mishra is making the most of his absence from Indian Premier League 2022 by making his presence felt on social media platform Twitter. Third-highest wicket-taker in the IPL, Mishra… The post “Still two years younger for it”: Amit Mishra jokes about playing for CSK in IPL appeared first on The SportsRush.","content":"Amit Mishra jokes about playing for CSK: The veteran Indian spinner isn’t playing in the ongoing season of the Indian Premier League. Veteran India spinner Amit Mishra is making the most of his absence from Indian Premier League 2022 by making his presence felt on social media platform Twitter. Third-highest wicket-taker in the IPL, Mishra had remained unsold in the auction this year. Having not played competitive cricket for almost a year now, Mishra doesn’t appear to have given up on playing days. Mishra, the last of whose 68 matches for India had come in a form of a T20I against England in Bengaluru five years ago, has represented Delhi Capitals (twice), Deccan Chargers and Sunrisers Hyderabad in the IPL. Highest wicket-taker for Capitals by some margin, Mishra has spent as many as 10 seasons at Delhi. Amit Mishra jokes about playing for CSK in IPL Mishra had recently joined the list of prominent personalities to appreciate Gujarat Titans head coach Ashish Nehra as his team remains the only unbeaten team in IPL 2022 before the start of the ongoing 16th match at the Brabourne Stadium. Mishra had tweeted a photo of Nehra with a piece of paper as his conventional coaching approach has reaped fruits for now. Mishra’s sense of humour was brought to light by a fan who requested him to join Chennai Super Kings. Known for the presence of numerous senior players in their squads, Super Kings have earned the nickname “Dad’s Army” for the same. Mishra, 39, however, still considered himself ineligible to play for the second-best IPL franchise. “Sorry mate, Still two years younger for it,” read Mishra’s tweet. Sorry mate, Still two years younger for it. https://t.co/9rCi5SFIz8 — Amit Mishra (@MishiAmit) April 8, 2022 Other than Mishra, tried and tested Indian players namely Suresh Raina, Piyush Chawla, Ishant Sharma and Dhawal Kulkarni had also remained unsold during IPL 2022 mega auction held in Bengaluru earlier this year. The post “Still two years younger for it”: Amit Mishra jokes about playing for CSK in IPL appeared first on The SportsRush.","pubDate":"2022-04-08 16:09:37","full_description":"Amit Mishra jokes about playing for CSK: The veteran Indian spinner isn’t playing in the ongoing season of the Indian Premier League. Veteran India spinner Amit Mishra is making the most of his absence from Indian Premier League 2022 by making his presence felt on social media platform Twitter. Third-highest wicket-taker in the IPL , Mishra had remained unsold in the auction this year. Having not played competitive cricket for almost a year now, Mishra doesn’t appear to have given up on playing days. Mishra, the last of whose 68 matches for India had come in a form of a T20I against England in Bengaluru five years ago, has represented Delhi Capitals (twice), Deccan Chargers and Sunrisers Hyderabad in the IPL. Highest wicket-taker for Capitals by some margin, Mishra has spent as many as 10 seasons at Delhi. Mishra had recently joined the list of prominent personalities to appreciate Gujarat Titans head coach Ashish Nehra as his team remains the only unbeaten team in IPL 2022 before the start of the ongoing 16th match at the Brabourne Stadium. Mishra had tweeted a photo of Nehra with a piece of paper as his conventional coaching approach has reaped fruits for now. Mishra’s sense of humour was brought to light by a fan who requested him to join Chennai Super Kings. Known for the presence of numerous senior players in their squads, Super Kings have earned the nickname “Dad’s Army” for the same. Mishra, 39, however, still considered himself ineligible to play for the second-best IPL franchise. “Sorry mate, Still two years younger for it,” read Mishra’s tweet. Sorry mate, Still two years younger for it. https://t.co/9rCi5SFIz8 — Amit Mishra (@MishiAmit) April 8, 2022 Other than Mishra, tried and tested Indian players namely Suresh Raina, Piyush Chawla, Ishant Sharma and Dhawal Kulkarni had also remained unsold during IPL 2022 mega auction held in Bengaluru earlier this year.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/punjab-kings-vs-gujarat-titans-live-score-over-match-16-t20-16-20-updates-2871933","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Punjab Kings vs Gujarat Titans from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-08 15:54:05","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Punjab Kings are 189/9. The live updates of Punjab Kings vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Punjab Kings vs Gujarat Titans, Punjab Kings vs Gujarat Titans live score, Punjab Kings vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. ... THE RUN CHASE ... Right then! Gujarat require 190 runs from 120 balls to secure their third win in a row. It won't be an easy chase for them, as Punjab do have some quality bowlers in their ranks. Will Gujarat remain unbeaten at the end of this innings? Do join us to find that out as the chase begins shortly. Darshan Nalkande is up for a quick chat. He says that the skipper really boosted his confidence before the match. Mentions, he is happy about the opportunity in hand and will hope to pay back for the side with consistent performances. Mentions the wickets is a good one to bat on. The ball is coming on very nicely. So he hopes their batters can get over the line. Gujarat started well with the ball and it was their skipper, Hardik Pandya who set the tone upfront inside the Powerplay. Although, they did leak some runs when Liam Livingstone and Shikhar Dhawan were going along nicely. It was Rashid Khan's spell that pulled things back in their favor. However, they would be disappointed as they conceded a lot of runs when they had the game under their control. Punjab got off to a sedate start as they lost their skipper early on in the innings. It was Shikhar Dhawan and Liam Livingstone who steadied the ship for them when they lost Jonny Bairstow for a timid score. Dhawan perished but Liam carried on in his merry way and scored yet another fifty. Jitesh Sharma came in and he too started playing shots right from the word go. Punjab was 124/3 at one point but they lost 6 wickets for 38 runs and were put under pressure. If not for Rahul Chahar, they would have been bundled out pretty early. Some crucial runs added by Punjab's tail-enders but still, one will have to say that it has been a good recovery from Gujarat! The pair of Rahul Chahar and Arshdeep Singh added 27 runs for the last wicket and they have ensured that they post a good total on the board. Although, Punjab was cruising along at one point when Jitesh Sharma and Liam Livingstone were taking apart Gujarat's bowlers. 19.6 overs (3 Runs) NOT OUT! Comedy of errors! Arshdeep Singh runs three runs off the final delivery. A short ball, on off. Singh pulls it to deep mid-wicket. The throws comes in from the deep which is overcooked. The batters had take two runs but decide to go for the third one as well. Arshdeep Singh was a tad late into the charge for that run. Hardik Pandya gathers the ball at the ball-striker's end. He knocks the stumps of with his legs though rather than the ball. The third umpire declares it not out. PUNJAB END WITH 189/9 at the end of their innings. Is that a run out? Hardik Pandya seems to have made a mess of the stumps with his leg and the batter might just have got away with that. 19.5 overs (1 Run) Full length, on middle and leg. Rahul Chahar looks to heave across the line. The ball goes to the off side off the pads. The batters cross for a single. Hardik Pandya appeals but the umpire shows no interest. Maybe an inside edge on it. Pandya takes a review, but the UltraEdge shows there is an inside edge before the ball comes in contact with the pad. 19.4 overs (4 Runs) FOUR! Rahul Chahar is on the charge here. Very full, down leg. Rahul Chahar flicks it aerially into the gap at deep square leg. One bounce and over the ropes. 19.3 overs (1 Run) Length ball, outside off. Arshdeep Singh pushes it to mid off for one. 19.2 overs (1 Run) Full length, on the stumps. Rahul Chahar drives it to point for a quick single. 19.1 overs (6 Runs) SIX! Woah! Rahul Chahar putting some life into the scoreboard. A short ball, on off. Rahul Chahar swivels on the back foot and smokes it over the square leg fence for a maximum. Hardik Pandya to bowl the last over of the innings. 18.6 overs (4 Runs) FOUR! This is a wild shot. A new kind of a no look shot. This is full and on leg. Arshdeep Singh keeps no eye on the ball and ends up flicking it towards deep mid-wicket. One bounce over the ropes. 18.5 overs (0 Run) Arshdeep Singh moves down leg. Lockie Ferguson follows him with a short one, cramping Singh for any room. The ball goes through to the keeper. 18.4 overs (1 Run) Short ball, angled down leg. Rahul Chahar drags his pull through square leg for a single. 18.3 overs (0 Run) Good length, on the bodyline. Rahul Chahar blocks it to the leg side. 18.2 overs (4 Runs) FOUR! A much-needed boundary for Punjab. Full length, outside off. Rahul Chahar slashes it hard through covers. The ball races away to the fence. 18.1 overs (0 Run) Full length, on off. Chahar hits it hard back to the bowler. Lockie Ferguson makes a sharp stop. 17.6 overs (2 Runs) Fuller, angled in from outside off. Arshdeep Singh lofts it over covers for two runs. Arshdeep Singh is the last batter in for Punjab. 17.5 overs (0 Run) OUT! TIMBER! Mohammad Shami finally gets himself into the wicket's column. This is a beauty. A full-length ball, nice and straight, aimed at the stumps. Vaibhav Arora tries to heave it away but misses it completely. The ball zips past the outside edge to uproot the off pole on it's way. 17.4 overs (1 Run) Fuller and at the stumps. Rahul Chahar bunts it through point for a single. 17.3 overs (1 Run) Length ball, on middle and leg. Vaibhav Arora taps it gently towards mid on and scampers through for a quick single. 17.2 overs (0 Run) Full length, on the stumps. Vaibhav Arora blocks it back to the bowler. 17.1 overs (0 Run) How has this missed the stumps? So, so close! A length ball, on the fourth stump line. Vaibhav Arora tries to defend inside the line but gets beaten. The ball nips in a touch, scoots past the off pole and goes to the keeper. 16.6 overs (2 Runs) A short ball, on off. Chahar flicks it through mid-wicket for a single. 16.5 overs (0 Run) A slower short ball, on off. Rahul Chahar tries to go for the ramp shot but only connects with thin air. 16.4 overs (1 Run) Full length, outside off. Vaibhav Arora taps it to point for a quick single. 16.4 overs (1 Run) WIDE! Length ball, angled down leg. Vaibhav Arora tries to flick it away but misses. Wide called. 16.3 overs (0 Run) Length ball, on middle. Vaibhav Arora blocks it out. Vaibhav Arora walks out to bat. 16.2 overs (1 Run) OUT! This gets worse for Punjab. Kagiso Rabada gifts his wicket to Gujarat. A length ball, outside off. Rahul Chahar guides it to the right of third man. The batters take a single. Although Kagiso Rabada goes for the second run which was never there, he was later sent back. The throw is a good one from the deep, from Mohammad Shami and Wade makes no mistake. This is a collapse that Punjab never wished to face. 16.1 overs (0 Run) A slower short ball, on off. Rahul Chahar shuffles across and tries to flick it away but misses. Lockie Ferguson (2-0-19-1) comes back into the attack. 15.6 overs (1 Run) Fuller, on middle and leg. Rahul Chahar gets it to fine leg off the inside edge. The batters take one. Rahul Chahar walks out to bat. 15.5 overs (0 Run) OUT! The umpire raises his finger but Shahrukh Khan takes it upstairs for an lbw review. It is quicker, full and on the stumps. Shahrukh Khan clears his front leg and tries to heave it across the line but misses. He gets pinged on his pads. It looked plumb to the naked eye. Rashid Khan appeals and the umpire agrees. The UltraEdge laters confirmed no bat is involved. The Ball Tracking shows three reds and Shahrukh Khan has to walk back now. Gujarat on top of the proceedings here. 15.4 overs (1 Run) Full and outside off. Kagiso Rabada drives it to mid off for a single. Kagiso Rabada walks out to bat. 15.3 overs (0 Run) OUT! CAUGHT! Rashid Khan does the trick for his side. He strikes an important blow again. Liam Livingstone goes back after an exceptional knock. It is short and on off. Liam Livingstone pulls it to deep mid-wicket but straight down the throat of David Miller, who makes no mistake. A timely wicket for Gujarat! 15.2 overs (1 Run) Flatter and on off. Shahrukh Khan miscues his pull to mid-wicket for a single. 15.1 overs (0 Run) A dot to start with! Floated and full, on middle. Shahrukh Khan prods and blocks it back to the bowler.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637850498379183159.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/punjab-kings-vs-gujarat-titans-live-score-over-match-16-t20-11-15-updates-2871799","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Punjab Kings vs Gujarat Titans from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-08 15:16:19","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.3 overs, Punjab Kings are 153/6. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Punjab Kings and Gujarat Titans. Everything related to Punjab Kings and Gujarat Titans match will be available on Sports.NDTV.com . Stay updated with Punjab Kings vs Gujarat Titans live score. Do check for Punjab Kings vs Gujarat Titans scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (4 Runs) FOUR! CLASSY! Shami goes for a yorker but ends up serving a half-volley, outside off. Liam Livingstone drives it through the mid off region and bags a boundary. 18 runs off the over! 14.5 overs (1 Run) A bumper, outside off. Shahrukh Khan mistimes his pull as he gets a top edge towards the vacant mid-wicket region. The batters cross ends. 14.4 overs (6 Runs) SIX! BANG! Nails his shot this time! Another ball that is on a length, around off. Shahrukh Khan clears his front leg and smacks it over the long on fence for another biggie. 14.3 overs (6 Runs) SIX! Just clears the long on fielder who was hovering under it! A length ball, angling in from off. Shahrukh Khan prods and lofts it over the long on fence for a maximum. 14.2 overs (0 Run) A bumper from Shami, outside off. Shahrukh Khan looks to pull hard but he fails to make any connection. 14.1 overs (1 Run) A yorker, around middle. Liam Livingstone squeezes it out towards long on for a single. Strategic break! The debutant, Darshan Nalkande, has stunned Punjab here with two wickets on consecutive delivery. Gujarat have the momentum on their side, although Punjab has a deadly pair at the crease, who can hammer the ball across the park. An enticing passage of play awaits. Can Punjab still make it near the 180-run mark? Gujarat will be hopingto capitalize on this opening. Hence, Mohammad Shami is brought back into the attack to find that inspiration. 13.6 overs (1 Run) Back of a length, outside off. Liam Livingstone punches it towards cover and takes a single. 13.5 overs (4 Runs) FOUR! Pulled away! Short of a length, around off. Liam Livingstone stays back and pulls it behind square on the leg side for another boundary. A well-controlled shot from Liam! 13.4 overs (4 Runs) FOUR! A slower bumper, around middle and leg. Liam Livingstone looks to pull but the ball hits the splice of his bat and races away to the fine leg fence. 13.3 overs (1 Run) Back of a length, outside off. Shahrukh Khan stays back and punches it to deep point for a run. Shahrukh Khan comes in at number 7. 13.2 overs (0 Run) OUT! CAUGHT! Two in two for Darshan Nalkande and wickets are tumbling at the moment for Punjab! This is a slower ball, on a length, outside off. Odean Smith looks to heave it away. The ball takes the bottom half of the bat and goes high in the night sky towards long on. It is that man again, Shubman Gill who settles under it and takes a sitter. Odean Smith departs for a golden duck. Darshan Nalkande is on a hat-trick! Odean Smith is the new man in. 13.1 overs (0 Run) OUT! CAUGHT! Jitesh Sharma looks for another big one but he holes out. Darshan Nalkande gets his maiden wicket in the Indian T20 League. A slower ball, full and outside off. Jitesh Sharma looks to slog it hard but the ball goes off the toe end, high in the air towards the mid on region. Shubman Gill runs in from long on, dives forward and takes a sharp catch. 12.6 overs (6 Runs) SIX! FIFTY FOR LIVINGSTONE! A short ball, around off. Liam Livingstone rocks back and pulls it high and handsomely over the deep mid-wicket fence for a biggie. 24 runs off the over. 12.5 overs (1 Run) DROPPED! Oh, dear! Abhinav Manohar puts down a sitter! Tossed up, well outside off. Jitesh Sharma skips down and lofts it straight to Manohar at long off. He gets towards the ball but spills it. A single taken. 12.4 overs (6 Runs) SIX! Back-to-back sixes! Dragged down, around middle. Jitesh Sharma rocks back and pulls it over the deep mid-wicket region for another biggie. 12.3 overs (6 Runs) SIX! BANG! Tossed up, around off. Jitesh Sharma slog-sweeps it way over deep mid-wicket for a maximum. 12.2 overs (1 Run) Another ball that is short and outside off. Liam Livingstone punches it to the extra cover fielder who half-stops it. A single taken. 12.1 overs (4 Runs) FOUR! SMASHED! A half-tracker, outside off. Liam Livingstone hangs back and slaps it through the cover region for a boundary. 11.6 overs (1 Run) Just wide of the bowler. Liam Livingstone skips down the track so Pandya serves a slower ball, into the deck, around off. Livingstone manages to work it just past Pandya towards long on for a single. 11.5 overs (0 Run) Slightly shorter in length, around off. Liam Livingstone dabs it onto the deck. 11.5 overs (1 Run) Wide! A short ball, around off. Liam Livingstone ducks underneath. The umpire calls it wide for height. 11.4 overs (3 Runs) Good effort in the deep from Shubman Gill! Back of a length, around off. Jitesh Sharma skips down the track and lofts it over the bowler's head. Gill runs across to his left from long on, puts in a dive and saves a run for his side. 11.3 overs (0 Run) Much better line from Pandya! Good-length ball, around off. Jitesh Sharma defends it towards backward point. 11.2 overs (4 Runs) FOUR! Width on offer and Jitesh Sharma pounces on it! Short and wide, outside off. Sharma hangs back and cuts it off the outer half of the bat, wide of the third man fielder for a boundary. 11.1 overs (1 Run) Back of a length, on middle. Liam Livingstone nudges it to deep mid-wicket and rotates the strike. 10.6 overs (0 Run) A bit quicker, outside off. Jitesh Sharma defends it out watchfully. 4 runs and a wicket off the over! 10.5 overs (2 Runs) In the air...but safe! This is a loopy ball, full and outside off. Jitesh Sharma looks to sweep at first but adjusts well in the end as the ball is too wide of off. He chips it aerially towards the long off fielder for one run. 10.4 overs (1 Run) Tosses it up, on middle. Liam Livingstone chips it to deep mid-wicket and settles for a single. 10.3 overs (1 Run) Floated, on a length, around off. Jitesh Sharma looks to defend off the front foot. It goes off the thick inside edge towards mid-wicket for a run. Sharma is off the mark. 10.2 overs (0 Run) Flatter and quicker, around off. Jitesh Sharma stays back and taps it towards point. Jitesh Sharma comes in at number 5. 10.1 overs (0 Run) OUT! CAUGHT BEHIND! Rashid Khan gets his man and breaks the partnership that was looking ominous for Gujarat! He serves a googly, on a length, around off. Shikhar Dhawan prods to defend but he only manages a thick outside edge which goes straight to Matthew Wade behind the sticks. The keeper takes it with ease and Punjab lose their third wicket.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637850475716927968.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Stokes on track for County Championship return next month","link":"https://www.thestar.com.my/sport/cricket/2022/04/08/cricket-stokes-on-track-for-county-championship-return-next-month","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England all-rounder Ben Stokes is on course to return to action in the County Championship next month following a scan on a left knee problem he struggled with during last month's tour of the West Indies. Read full story","content":null,"pubDate":"2022-04-08 15:12:00","full_description":"(Reuters) - England all-rounder Ben Stokes is on course to return to action in the County Championship next month following a scan on a left knee problem he struggled with during last month's tour of the West Indies. The 2022 County Championship began on April 7 and Stokes, who plays for Durham, had said this week that he was unable to make plans on playing for them until the results of his scan were out. \"Ben had a scan on his left knee which didn't reveal anything new,\" Sky Sports quoted the England and Wales Cricket Board as saying in a statement. \"We had planned for him to return to... County Championship cricket in early May and while he is feeling tender in the knee, that plan remains the same following the scan. \"We'll continue to manage him in conjunction with Durham.\" England, who were beaten 1-0 by the West Indies, host New Zealand in a three-test series in June. (Reporting by Shrivathsa Sridhar in Bengaluru; Editing by Toby Davis)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/04/08/1544593.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, PBKS vs GT Live Score: Liam Livingstone Key For PBKS As Rashid Khan Gets Shikhar Dhawan - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLXBia3MtdnMtZ3QtbGl2ZS1zY29yZS11cGRhdGVzLXB1bmphYi1raW5ncy12cy1ndWphcmF0LXRpdGFucy1saXZlLXNjb3JlLTI4NzEyNzLSAX9odHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1wYmtzLXZzLWd0LWxpdmUtc2NvcmUtdXBkYXRlcy1wdW5qYWIta2luZ3MtdnMtZ3VqYXJhdC10aXRhbnMtbGl2ZS1zY29yZS0yODcxMjcyL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, PBKS vs GT Live Score: Liam Livingstone Key For PBKS As Rashid Khan Gets Shikhar Dhawan  NDTV SportsPunjab Kings vs Gujarat Titans Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Punjab Kings vs Titans, Indian Premier League 2022, 16th Match  ESPNcricinfoLIVE | IPL 2022, Punjab Kings vs Gujarat Titans Match 16 Score: Rashid Gets Dhawan, Livingstone Key For PBKS  India.comShubman Gill is one of the finest talents in world cricket: Shastri  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-04-08 15:00:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/punjab-kings-vs-gujarat-titans-live-score-over-match-16-t20-6-10-updates-2871692","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Punjab Kings vs Gujarat Titans from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-08 14:33:47","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Punjab Kings are 86/3. The live updates of Punjab Kings vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Punjab Kings vs Gujarat Titans, Punjab Kings vs Gujarat Titans live score, Punjab Kings vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (4 Runs) FOUR! Liam Livingstone is showing no mercy here. It is a short ball, outside off. Liam Livingstone stands tall and cuts it through covers for a boundary. This one is a freebie for Liam Livingstone. 9.5 overs (1 Run) Back of a length, outside off. Shikhar Dhawan comes down the track and guides it through backward point for a single. 9.4 overs (1 Run) Length ball, on off. Liam Livingstone whips it across the line through mid-wicket for a single. 9.3 overs (0 Run) Full length, wide outside off. Liam Livingstone slashes hard but misses. 9.2 overs (4 Runs) FOUR! AND AGAIN! Another ball that is on a length, just outside off. Liam Livingstone shuffles across yet again and scoops it fine, just over the keeper's head for a boundary. Livingstone is taking the attack to the debutant here! 9.1 overs (6 Runs) SIX! BOOM! Innovative from Liam Livingstone! A length ball, around off. Liam Livingstone shuffles across and scoops it well over the long leg fence for a maximum. 8.6 overs (0 Run) Fuller, on off. Shikhar Dhawan blocks it out solidly. 8.5 overs (1 Run) Length ball, on off. Liam Livingstone pushes it to cover for a single. 8.4 overs (6 Runs) NOT OUT! It's a MAXIMUM! Oh dear, what drama. This could've been a huge wicket for Gujarat but Liam Livingstone gets a lifeline. It is a short ball, on off. Liam Livingstone pulls it to deep mid-wicket. The ball is near the ropes. Hardik Pandya runs to his right and gathers the ball in mid air. Although the momentum takes his right foot way close to the ropes. Hardik Pandya flips the ball in the air and pouches it away from the ropes. He looks ecstatic. The umpire though takes it upstairs to confirm the catch. The replays show Hardik Pandya's right foot was touching the ropes. Maximum. Is that a clean catch? Hardik Pandya has taken a stunning catch in the deep. But the umpires have sent it upstairs to check whether Pandya's foot touched the ropes. Oh, dear! All of Pandya's efforts go in vain as the replays suggest that his right foot touched the ropes when he had the ball in his hand. 8.3 overs (0 Run) Dot now! Fuller, on off. Liam Livingstone eases it back to the bowler. 8.2 overs (1 Run) Fuller, on the stumps. Shikhar Dhawan smothers it to cover for a quick single. 8.1 overs (2 Runs) Full, on middle and leg. Shikhar Dhawan flicks it through square leg for two runs comfortably. Strategic break! Gujarat would be happier of the two sides at the end of 8 overs. They have done well to pick up a couple of wickets. Having said that, Punjab have a very long batting lineup and the batters at the crease, Shikhar Dhawan and Liam Livingstone are more than capable of taking the game away from the opposition. Hardik Pandya and his men would be keen to take wickets at the moment. Just as we were talking about wickets, Rashid Khan comes back into the attack. 7.6 overs (1 Run) On a length, just outside off. Shikhar Dhawan dabs it to point for a quick single. The debutant goes for 11 runs off his first over. He still has three overs in the bank to have a great impact. He certainly seems to be an exciting prospect. 7.5 overs (1 Run) Back of a length, outside off. Liam Livingstone punches it through point for a single. 7.4 overs (6 Runs) SIX! BANG! Liam Livingstone is successful to put some pressure on the debutant. A full-length ball, on off. Liam Livingstone comes down the track, lofts it over the long on fence for a biggie. 7.3 overs (1 Run) On a length, outside off. Shikhar Dhawan cuts it through backward point for a single. 7.2 overs (0 Run) A dot now! A length ball, wide outside off, angled across the left-hander at 133 clicks. Shikhar Dhawan tries to cut it away but misses. The ball dies as it reaches the keeper. 7.1 overs (1 Run) Length ball, outside off. Liam Livingstone taps it to point for a single. 7.1 overs (1 Run) WIDE! A slower bouncer, on off. Liam Livingstone sways away from the line of the delivery. The umpire signals a wide as the ball passes above the batter's head. The debutant, Darshan Nalkande comes into the attack. 6.6 overs (2 Runs) A short ball, outside off. Shikhar Dhawan pulls it to deep mid-wicket. Rashid Khan does well in the deep to keep it down to two. A good over by Lockie Ferguson. He gives away only six runs after leaking a few extra in his first over. 6.5 overs (1 Run) Yorker length delivery, outside off. Liam Livingstone digs it out to point and scampers across for a quick single. 6.4 overs (1 Run) Length ball, outside off. Dhawan shuffles across, tucks it to square leg for a single. 6.3 overs (2 Runs) Full length, wide outside off. Shikhar Dhawan leans in and drives it to sweeper cover. Sai Sudharsan runs to his left and does well to keep it down to just two runs. 6.2 overs (0 Run) Length ball, on off, pushed to safety. 6.1 overs (0 Run) Back of a length, angled into the batter. Shikhar Dhawan remains solid in his back foot defense. 5.6 overs (1 Run) Full, on off. Dhawan tucks it to mid-wicket for a quick single. 5.5 overs (0 Run) Darted on the stumps. Dhawan stays back and blocks it out watchfully. 5.4 overs (2 Runs) Quicker and full, on middle and leg. Shikhar Dhawan flicks it through mid-wicket for a brace. 5.3 overs (0 Run) Looped up, full and on off. Shikhar Dhawan defends it on the front foot back to the bowler. 5.2 overs (1 Run) Another single now! Length ball, around off. Liam Livingstone flicks it to mid-wicket for a quick single. 5.1 overs (1 Run) Full, on leg. Shikhar Dhawan clips it to deep mid-wicket for an easy single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637850450172942545.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"PBKS vs GT: Shikhar Dhawan scripts history, becomes 1st Indian to hit 1000 boundaries in T20s - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9pcGwtMjAyMi9zdG9yeS9zaGlraGFyLWRoYXdhbi0xMDAwLWJvdW5hZGFyaWVzLTFzdC1pbmRpYW4tcGJrcy12cy1ndC1yZWNvcmQtdDIwLWNyaWNrZXQtMTkzNTIzNy0yMDIyLTA0LTA40gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs GT: Shikhar Dhawan scripts history, becomes 1st Indian to hit 1000 boundaries in T20s  India TodayShikhar Dhawan Becomes 1st Indian to Hit 1,000 Boundaries in T20 Cricket  News18IPL 2022: Dhawan achieves huge batting milestone to join Gayle, Warner  Hindustan TimesPBKS vs GT: Shikhar Dhawan becomes first Indian to smash 1,000 fours in T20 cricket  CricTrackerIPL 2022: Shikhar Dhawan Scores 1000 Fours In T20s, Becomes First Indian Batter To Do So  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-08 14:24:29","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sai Sudharsan cricketer: Why are Vijay Shankar and Varun Aaron not playing today’s IPL 2022 match between Punjab Kings and Gujarat Titans?","link":"https://thesportsrush.com/cricket-news-sai-sudharsan-cricketer-why-are-vijay-shankar-and-varun-aaron-not-playing-todays-ipl-2022-match-between-punjab-kings-and-gujarat-titans/","keywords":["Cricket","Gujarat Titans","IPL 2022","Punjab Kings","Vijay Shankar"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Vijay Shankar and Varun Aaron not playing: Gujarat Titans have made a couple of changes to their Playing XI for this match. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans captain Hardik Pandya has won the toss… The post Sai Sudharsan cricketer: Why are Vijay Shankar and Varun Aaron not playing today’s IPL 2022 match between Punjab Kings and Gujarat Titans? appeared first on The SportsRush.","content":"Vijay Shankar and Varun Aaron not playing: Gujarat Titans have made a couple of changes to their Playing XI for this match. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans captain Hardik Pandya has won the toss and chose to bowl. “Going to bowl first because I think dew might be a factor later. We had a couple of good games where things went our side. Lot of courage shown by the boys,” Pandya told Star Sports at the toss. Wanting to follow a trend this season, Punjab Kings captain Mayank Agarwal was also looking to chase a target at the Cricket Club of India tonight. “Would’ve liked to bowl first as well but it is what it is. Did well last game batting first. Guys are taking a lot of responsibility. Have a lot of leaders in our side, makes my job easier,” Agarwal told Star Sports at the toss. Why are Vijay Shankar and Varun Aaron not playing vs Punjab Kings? Only unbeaten team in IPL 2022 thus far, Gujarat have had to make a couple of changes to their Playing XI for this match. Readers must note that all-rounder Vijay Shankar and fast bowler Varun Aaron are missing this match due to respective niggles. As a result, Titans have included a couple of debutants in batter Sai Sudharsan and fast bowler Darshan Nalkande. Both playing their first-ever IPL match, Sudharsan and Nalkande play for Tamil Nadu and Vidarbha respectively in domestic cricket. 2⃣ debutants begin their #SeasonOfFirsts – B Sai Sudharsan and Darshan Nalkande #PBKSvGT | #AavaDe | #TATAIPL pic.twitter.com/CMUSZa4rQW — Gujarat Titans (@gujarat_titans) April 8, 2022 Sudharsan, 20, has scored 182 runs at an average and strike rate of 36.40 and 119.73 respectively in his seven-match T20 career. Meanwhile, 23-year old Nalkande has picked 43 wickets in 22 T20s at an average of 12.76, an economy rate of 7.25 and a strike rate of 10.5. Punjab, on the other hand, have made a lone change by handing England wicket-keeper batter Jonny Bairstow a debut. In-form batter Bhanuka Rajapaksa has been made to sit out to accommodate Bairstow. The post Sai Sudharsan cricketer: Why are Vijay Shankar and Varun Aaron not playing today’s IPL 2022 match between Punjab Kings and Gujarat Titans? appeared first on The SportsRush.","pubDate":"2022-04-08 14:07:50","full_description":"Vijay Shankar and Varun Aaron not playing: Gujarat Titans have made a couple of changes to their Playing XI for this match. During the 16th match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Gujarat Titans at the Brabourne Stadium, Gujarat Titans captain Hardik Pandya has won the toss and chose to bowl. “Going to bowl first because I think dew might be a factor later. We had a couple of good games where things went our side. Lot of courage shown by the boys,” Pandya told Star Sports at the toss. Wanting to follow a trend this season, Punjab Kings captain Mayank Agarwal was also looking to chase a target at the Cricket Club of India tonight. “Would’ve liked to bowl first as well but it is what it is. Did well last game batting first. Guys are taking a lot of responsibility. Have a lot of leaders in our side, makes my job easier,” Agarwal told Star Sports at the toss. Only unbeaten team in IPL 2022 thus far, Gujarat have had to make a couple of changes to their Playing XI for this match. Readers must note that all-rounder Vijay Shankar and fast bowler Varun Aaron are missing this match due to respective niggles. As a result, Titans have included a couple of debutants in batter Sai Sudharsan and fast bowler Darshan Nalkande. Both playing their first-ever IPL match, Sudharsan and Nalkande play for Tamil Nadu and Vidarbha respectively in domestic cricket. 2️⃣ debutants begin their #SeasonOfFirsts – B Sai Sudharsan and Darshan Nalkande 🤩 #PBKSvGT | #AavaDe | #TATAIPL pic.twitter.com/CMUSZa4rQW — Gujarat Titans (@gujarat_titans) April 8, 2022 Sudharsan, 20, has scored 182 runs at an average and strike rate of 36.40 and 119.73 respectively in his seven-match T20 career. Meanwhile, 23-year old Nalkande has picked 43 wickets in 22 T20s at an average of 12.76, an economy rate of 7.25 and a strike rate of 10.5. Punjab, on the other hand, have made a lone change by handing England wicket-keeper batter Jonny Bairstow a debut. In-form batter Bhanuka Rajapaksa has been made to sit out to accommodate Bairstow.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Punjab Kings vs Gujarat Titans: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/punjab-kings-vs-gujarat-titans-live-score-over-match-16-t20-1-5-updates-2871487","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Punjab Kings vs Gujarat Titans from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-08 14:04:07","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.2 overs, Punjab Kings are 40/2. The live updates of Punjab Kings vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Punjab Kings vs Gujarat Titans, Punjab Kings vs Gujarat Titans live score, Punjab Kings vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (4 Runs) FOUR! Easy pickings! A length ball, around leg. Liam Livingstone hangs back and glances it through the fine leg region for a boundary. The Englishman is off the mark in style. Liam Livingstone is the new batter in. 4.5 overs (0 Run) OUT! TAKEN! Pace and bounce does the job for Gujarat yet again and it is Lockie Ferguson who strikes to get rid of the dangerous Jonny Bairstow! A short ball, around off and cramping the batter for room. Bairstow stays back and looks to ramp it over the keeper. The ball hits the splice of the bat and lobs up towards the short third man fielder. Rahul Tewatia moves quickly to his left and takes a good catch. Punjab under a bit of pressure inside the Powerplay. 4.4 overs (0 Run) Ferguson hits the deck hard, around off. Jonny Bairstow dabs it onto the deck. 4.3 overs (1 Run) A yorker-length delivery, outside off. Shikhar Dhawan digs it out towards cover and scampers through to the other end. Slight hesitation between the two batters but no harm done in the end. 4.2 overs (4 Runs) FOUR! Full and outside off. Shikhar Dhawan reaches out and carves it through the cover region for another boundary. Much-needed momentum for Punjab! 4.1 overs (4 Runs) FOUR! Top shot! A full ball, outside off. Shikhar Dhawan prods and lofts it over the mid off fielder. One bounce and over the ropes. 3.6 overs (4 Runs) FOUR! WHACKED! A short ball, around off. Jonny Bairstow waits for the ball to arrive and pulls it in front of square on the leg side to bag a boundary. That spoils a good over for the skipper. 3.5 overs (0 Run) Short of a length, outside off. Jonny Bairstow punches hard but finds the fielder at cover. 3.4 overs (0 Run) Back of a length, on middle. Jonny Bairstow stays back and turns it to mid-wicket. 3.3 overs (1 Run) Good-length ball, around off. Shikhar Dhawan defends it to the off side and sets off for a quick single. David Miller runs in from cover, collects the ball and underarms it to hit the stumps at the striker's end. Bairstow is the man at the danger end and the run out decision is sent upstairs. The replays roll in and it shows that Jonny Bairstow was well inside his crease. 3.2 overs (0 Run) That jagged back in late! Good-length ball, around the fifth stump channel and nipping back in just that little bit. Shikhar Dhawan looks to cut without any feet movement and he fails to get any bat on it. 3.1 overs (0 Run) Play and a miss! Short of a length, just outside off. Shikhar Dhawan hangs back to cut but the ball zips past his outside edge. 2.6 overs (0 Run) Short of a length, outside off. Bairstow looks to push it through the off side but he gets an under-edge, onto the deck. 2.5 overs (0 Run) On a length and jagging back in from off. Jonny Bairstow tucks it towards mid-wicket. 2.4 overs (4 Runs) FOUR! Good-length ball, around middle. Jonny Bairstow skips down a bit and flicks it through the square leg region for a boundary. What a way to get off the mark! 2.3 overs (1 Run) In the air...but safe! Dhawan skips down the track so Shami serves it wider, outside off. The length is a bit short as well. Dhawan gets a thick outside edge which falls just short of the third man fielder for a single. Dhawan living dangerously here! 2.2 overs (0 Run) Shami serves a length ball, just outside off. Shikhar Dhawan lets it be. 2.1 overs (4 Runs) FOUR! EDGY! A length ball, angling in from outside off. Shikhar Dhawan looks to cut but he gets an inside edge yet again which races away to the fine leg fence like a bullet. Jonny Bairstow walks in at number 3. 1.6 overs (0 Run) OUT! CAUGHT! Mayank Agarwal holes out and it is Hardik Pandya who wins the battle between the skippers. Back of a length, around off and hurrying onto the batter. Mayank looks to pull but he gets cramped for room. The ball takes the top edge and goes high in the air towards mid-wicket. Rashid Khan settles under it and pouches it with ease. Punjab lose their first wicket. 1.5 overs (0 Run) On a length, around middle. Mayank Agarwal prods and defends it to the off side. 1.4 overs (1 Run) This is darted on the pads. Dhawan tickles it to fine leg and rotates the strike. 1.3 overs (0 Run) A length ball, shaping away from off. Dhawan lets it through to the keeper. 1.2 overs (4 Runs) FOUR! STREAKY! Back of a length, angling across the batter. Shikhar Dhawan looks to cut but he gets a thick inside edge which goes past the diving Matthew Wade behind the sticks for a boundary. 1.1 overs (1 Run) Leg bye! Pandya starts with a length ball, angling in from middle. Mayank Agarwal misses his flick and gets hit high on his pad. The ball rolls to the leg side for a leg bye. Hardik Pandya to share the new ball. 0.6 over (1 Run) Shorter in length, outside off. Mayank steers it to third and takes a single. He will retain the strike. 0.5 over (0 Run) On a length, just outside off. Mayank Agarwal taps it towards backward point. 0.4 over (4 Runs) FOUR! UP AND OVER! Not from the middle of the bat though! This is a length ball, jagging back in from off. Mayank prods and looks to go downtown. It goes off the inner half of the bat and over the mid on fielder for a boundary. Punjab is underway! 0.3 over (0 Run) Back of a length, around off. Mayank Agarwal gets solid in his back foot defence. 0.2 over (0 Run) Good-length delivery, around middle and shaping away late. Agarwal looks to block but he gets squared up. The ball goes off the outer half of the blade towards point. 0.1 over (0 Run) Shami starts with a length ball, nipping back in from off. Mayank Agarwal defends it to the off side. We are set for the game to begin! The players of Gujarat have made their way out to the middle. Mayank Agarwal and Shikhar Dhawan walk out to bat for Punjab. Mohammad Shami will start proceedings with the ball for Gujarat. Let's go! Jonny Bairstow is up for a quick chat. He says, it's been a great so far with the new franchise. Says, these are exciting times and he will start from zero and look to impress straightaway. Adds it is all about learning. Tells, the training has been going well. Mentions, he isn't much sure if he will don the gloves in the match and it will be a surprise for all of us. PITCH REPORT - Matthew Hayden is near the pitch, He says that it looks like another good track to bat on and it could be a high-scoring game. Tells that there is some grass on it and it will help the pace bowlers initially. Mayank Agarwal, the skipper of Punjab, says that they would have bowled first as well. Adds, they did bat well in their last game and they would be looking to repeat the same. Informs that they have one change, Jonny Bairstow comes in for Bhanuka Rajapaksa. Hardik Pandya, the skipper of Gujarat, says they will bowl first because dew might play a factor in the latter part of the game. Says, the boys showed a lot of courage by the way they pulled things back in the last game. Says, there are two forced changes that give opportunities to two debutants, Sai Sudharsan and Darshan Nalkande. Punjab (Playing XI) - Mayank Agarwal (C), Shikhar Dhawan, Liam Livingstone, Jonny Bairstow (In for Bhanuka Rajapaksa), Odean Smith, Shahrukh Khan, Jitesh Sharma (WK), Arshdeep Singh, Vaibhav Arora, Kagiso Rabada, Rahul Chahar. Gujarat (Playing XI) - Matthew Wade (WK), Shubman Gill, Sai Sudharsan (On debut) (In for Vijay Shankar), Hardik Pandya (C), David Miller, Rahul Tewatia, Abhinav Manohar, Rashid Khan, Lockie Ferguson, Mohammad Shami, Darshan Nalkande (On debut) (In for Varun Aaron). TOSS - Gujarat has won the toss and they have elected to BOWL first. DEBUT ALERT - Sai Sudharsan and Darshan Nalkande would be making their Indian T20 League debut for Gujarat, while Jonny Bairstow has been handed over his debut cap for Punjab. Punjab did lose their second game of the season but it was a Liam Livingstone show at the Brabourne Stadium in their next game against Chennai which saw them get over the line. Punjab too, has some genuine match-winners in their ranks and they will look to give it their all and hand Gujarat their first loss of the season. Lots of things to look forward to in this exciting clash and it promises to be a cracker. Stay tuned for toss and further updates. Hello and a very warm welcome to game number 16 of the Indian T20 League where Punjab will lock horns with Gujarat. Both these sides are coming at the back of a win in their previous game and would be confident of their chances heading into this clash. Infact, Gujarat are yet to lose a game as they have won their first two matches and they seem to be a well-balanced unit. ... Match Day ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637850432393526598.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Was tied, gagged and forgotten the whole night by Andrew Symonds and James Franklin, says Yuzvendra Chahal - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2lwbC93YXRjaC15dXp2ZW5kcmEtY2hhaGFsLXJlY2FsbHMtcmVjYWxscy1ob3ctYS1kcnVuay10ZWFtbWF0ZS1hbG1vc3Qta2lsbGVkLWhpbS03ODU5MTg0L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Was tied, gagged and forgotten the whole night by Andrew Symonds and James Franklin, says Yuzvendra Chahal  The Indian ExpressIPL 2022: 'He was very drunk and dangled me off a 15th floor balcony' - Yuzvendra Chahal reveals shocking  Times of India\"Drunk Player Dangled Me From Balcony\": Yuzvendra Chahal's Shocking Revelation  NDTV Sports'He was very drunk, he took me and hung me out of the 15th-floor balcony'  ESPNcricinfoVirender Sehwag Made A Strong Statement On Yuzvendra Chahal’s Allegations  The Cricket LoungeView Full coverage on Google News","content":null,"pubDate":"2022-04-08 13:29:25","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"OEI vs IR Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for ECS Cartaxo T10, Quarter-Final 4","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/oei-vs-ir-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-ecs-cartaxo-t10-quarter-final-4?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-08 13:16:55","full_description":"Oeiras will take on the Indian Royals in the fourth quarter-final of the ECS Cartaxo T10 at the Gucherre Cricket Ground in Albergaria on Friday. With seven wins from eight matches, Oeiras finished on top of Group B standings. Meanwhile, Indian Royals just about made it to the playoffs after finishing fourth in Group A. They only won three of their eight matches. OEI XI Parth Jounjat, Francoise Stoman, Brendan Badenhorst, Krut Patel, Miguel Stoman, Conrad Greenshields (c), Mohammad Siraj Nipo, Mubeen Tariq, Junaid Khan- II, Diogo Martins, Carlo Buccimazza IR XI Amandeep Khokhar, Sukhwinder Singh (c), Jass Singh, Jay Singh, Devender Mehta, MD Shaikat, Lovejeet Singh, Jai Parkash, Ullah Ahammad, Rayhan Khan, KC Lakshman OEI vs IR, ECS Cartaxo T10, Quarter-Final 4 Date and Time: 8th April, 2022, 7:00 PM IST Venue: Gucherre Cricket Ground, Albergaria The wicket has more pace and bounce and batters are expected to excel. The side winning the toss should look to bat first in order to get enough runs on the board. Wicketkeeper A Khokhar is a reliable choice for the wicket-keeper role. He is a difficult player to stop once he gets going with the bat. He has scored 181 runs in eight innings at an average of 25.85. His strike rate is above 140. Batters F Stoman is a safe choice when it comes to batting in the top order. He has scored 221 runs so far and is expected to score a big knock here too. All-rounders C Greenshields is a wonderful all-rounder who will be looking to contribute with both the bat as well as the ball. He has scored 255 runs and has also picked up six wickets. He will be a wise captaincy pick for your CK vs OEI Dream11 Fantasy Team. M Shaikat is a dependable bowling all-rounder for his side. He has scored 105 runs and has taken eight wickets so far. Bowlers M Tariq is an important player with the ball in hand. He has scalped 11 wickets thus far and will be looking to add more to his tally. C Greenshields (OEI) – 707 points M Shaikat (IR) – 540 points M Tariq (OEI) – 462 points M Siraj Nipo (OEI) – 409 points F Stoman (OEI) – 366 points C Greenshields: 255 runs and 6 wickets M Shaikat: 105 runs and 8 wickets M Tariq: 11 wickets F Stoman: 221 runs A Khokhar: 181 runs Fantasy Suggestion #1: A Khokhar, F Stoman, B Badenhorst, S Singh, J Singh, C Greenshields, M Shaikat, M Siraj Nipo, M Tariq, U Ahammad, C Buccimazza Captain: C Greenshields , Vice-Captain: M Shaikat Fantasy Suggestion #2: A Khokhar, F Stoman, B Badenhorst, S Singh, C Greenshields, M Shaikat, M Siraj Nipo, M Tariq, U Ahammad, C Buccimazza, K Lakshman Captain: F Stoman , Vice-Captain: M Tariq","image_url":"https://static.sportskeeda.com/editor/2022/04/2055c-16494191910106-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"GG vs SS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Spice Isle T10, Match 8","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/gg-vs-ss-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-spice-isle-t10-match-8?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-08 13:16:55","full_description":"Ginger Generals will take on Saffron Strikers in the eighth match of the Spice Isle T10 at the National Cricket Stadium in Grenada on Friday. Ginger Generals have won both their league matches so far and are on top of the points table. They scored a total of 133 in the previous match and ended up securing a 51-run victory. They will be looking to continue with the same momentum. Meanwhile, Saffron Strikers have won one of their two matches thus far and are fourth in the standings. They secured a nice Super Over victory in the last game. GG XI Samuel Charles (wk), Roland Cato (c), George Keone, Lindon Mason, Kimani Melius, MC Donald, Charles Reynold, Kimo Peters, Edward Larry, Redhead Nicklaus, Gilon Tyson SS XI Dillon Douglas, Lendon Lawrence (wk), Mickel Joseph, Ryan John, Jevon Andrew, Kem Charles, Heron Campbell, Jelani George, Nicoby John, Darius Martin, Josh Thomas GG vs SS, Spice Isle T10, Match 8 Date and Time: 8th April, 2022, 9:15 PM IST Venue: National Cricket Stadium, Grenada The wicket has more pace and bounce and batters are expected to excel. The side winning the toss should look to bat first in order to get enough runs on the board. Wicketkeeper S Charles is a decent choice for the wicket-keeper role. He is likely to have a strong influence from behind the stumps. Batters D Douglas is an excellent player who is his side’s leading run-scorer. He has amassed 50 runs in two games so far. All-rounders M Donald Daniel is a fantastic all-rounder who will be looking to contribute with both the bat as well as the ball. He has scored 34 runs and has also picked up three wickets. He will be a great captaincy pick for your GG vs SS Dream11 Fantasy Team. C Reynold is another player you must have in your Dream11 Fantasy Side. He has scalped four wickets in two matches so far. Bowlers K Charles seems to be in good form at the moment. He has taken three wickets thus far and will be eyeing more success. M Donald Daniel (GG) – 155 points C Reynold (GG) – 140 points K Peters (GG) – 115 points K Charles (SS) – 112 points D Douglas (SS) – 107 points M Donald Daniel: 34 runs and 3 wickets C Reynold: 4 wickets K Peters: 3 wickets D Douglas: 50 runs Fantasy Suggestion #1: S Charles, D Douglas, K Melius, R Cato, M Donald Daniel, C Reynold, K Peters, R John, K Charles, R Nicklaus, D Martin Captain: M Donald Daniel , Vice-Captain: D Douglas Fantasy Suggestion #2: S Charles, L Lawrence, D Douglas, K Melius, R Cato, M Donald Daniel, C Reynold, K Charles, R Nicklaus, D Martin, E Larry Captain: C Reynold , Vice-Captain: K Charles","image_url":"https://static.sportskeeda.com/editor/2022/04/7ad96-16494225823940-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE PBKS vs GT Live Score IPL 2022, Punjab Kings vs Gujarat Titans Live Cricket Score Latest Updates","link":"https://www.indiatvnews.com/sports/cricket/pbks-vs-gt-live-score-ipl-2022-punjab-kings-vs-gujarat-titans-match-16-live-updates-2022-04-08-768520","keywords":null,"creator":null,"video_url":null,"description":"LIVE PBKS vs GT Live Score IPL 2022, Punjab Kings vs Gujarat Titans Live Cricket Score Latest Updates","content":null,"pubDate":"2022-04-08 12:45:35","full_description":null,"image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Afghanistan’s Rashid Khan longs for more Test opportunities","link":"https://sportstar.thehindu.com/cricket/rashid-khan-longs-for-more-test-opportunities-afghanistan/article38470210.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"The leg-spinner says playing Test cricket is imperative to grow as a bowler.","content":null,"pubDate":"2022-04-08 12:12:59","full_description":"Afghanistan spinner Rashid Khan longs for opportunities to play Test matches against top teams but is content plying his trade in franchise cricket until that happens, the 23-year-old told Reuters on Friday. Rashid has played all five of Afghanistan’s Tests since the country was granted full membership of the governing International Cricket Council (ICC) in 2017. It was scheduled to play a one-off Test in Hobart in November but Cricket Australia postponed the match citing uncertainty over the future of women’s cricket under Afghanistan’s Taliban rule. Rashid lamented missing out on an opportunity to test his craft against the likes of Steve Smith and Marnus Labuschagne. ALSO READ - Khawaja confident a well-balanced Australia can succeed in Sri Lanka “As a player, it disappoints you because you always wait for opportunities to play big teams,” the leg-spinner, currently playing for Gujarat Titans in the Indian Premier League, told Reuters by telephone. “It’s about improving your cricket and learning new things. We all were looking forward to it but sometimes things do not go your way. I hope we get the opportunity to play them soon.” ‘Want to bowl long spells’ A sought-after name in Twenty20 leagues across the world, Rashid knows playing Test cricket was imperative to grow as a bowler. “You want to bowl long spells to learn more about your bowling. I do hope we get the opportunity in the next few years to play more Test matches.” Rashid has set alight franchise cricket in India, Australia, England, West Indies and Pakistan with his feisty leg-spin and believes the experience would stand him in good stead even in Tests. “Wickets and conditions vary from country to country. You have to think differently and that adds something extra to your game,” he explained. “That experience makes you mentally very strong. It has helped me a lot.” Apart from being an agile fielder, he is also an aggressive lower-order batsman which makes him an asset in franchise cricket. “I think I can be a much better batsman than what I am now,” said Rashid, who launched his merchandising brand ‘RK 19’ earlier this week. “I should be someone taking more responsibility in that department as well. I keep working on my batting. In the last couple of years, there's more expectation from me in that department that I can deliver crucial 20-25 runs with the bat. I know I have the skill and talent to deliver that, it’s just about bringing that confidence in you that you can deliver.”","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"}]}