{"newsArray":[{"article_id":"b057a8df7df9da0ad648f58a4c8b1fdd","title":"ODI World Cup: Kiwis gearing up for the big challenge","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/odi-world-cup-kiwis-gearing-up-for-the-big-challenge-2632880.html","keywords":null,"creator":null,"video_url":null,"description":"The first question fired: “Welcome to Mumbai just going back in history about the 29th of May 1953 about 70 years back…” and Williamson interrupts nonchalantly, MUMBAI: The press conference room at the Wankhede Stadium was packed on a hot and humid Tuesday afternoon. New Zealand captain Kane Williamson saunters in seemingly oblivious of the fact that two stern tests await him. First one of course is during the media interaction in the afternoon where he would be reminded of New Zealand's tales of near misses in ICC top events, and the next one will be on Wednesday when his team takes on India in the most important match of their lives. Photo: Shiba Prasad Sahu / Express Caption: New Zealand players practicing at the Wankhede Stadium in Mumbai ahead of the semi-final against India. The first question fired: “Welcome to Mumbai just going back in history about the 29th of May 1953 about 70 years back…” and Williamson interrupts nonchalantly, “Yeah, I remember that”, as the entire room erupts into laughter. When he walks on to the field on Thursday, it will be his fifth ICC World Cup semifinal across formats as captain. Yet, here was Williamson, less than 24 hours away from what is the most important match they have played so far, turning a serious question about scaling the highest peak in the world into some kind of a joke. And of course, New Zealand would be wary of the highest peak in cricket they are trying to climb. In fact, it pretty much sums up New Zealand’s campaign so far. They kicked off the tournament with four consecutive wins before being in a position where they almost missed out on the semifinals. They had a injury list when put together could be longer than the playing XI. From there on, they pulled back to enter their fifth consecutive ODI World Cup semifinal. The tags like ‘underdogs’ and ‘dark horses’ that are often linked with New Zealand in the lead up to global events usually seem out of place. Considering a country with a population that is a quarter of Mumbai and with just six premier domestic teams where cricket plays second fiddle to their national passion rugby, one must confess New Zealand have been among the most consistent teams at ICC events. In the last four years, they have played two white-ball World Cup finals, one semifinal and have won an ICC World Test Championship title. Ask Lockie Ferguson what makes them tick at World Cups, he doesn’t have a straight specific answer. “I’d love to know” he laughs. “When we start the competition, much like every other team we're here to win it, but of course we know there's a process and I think certainly within our team we've played a lot of cricket together for a long period of time, so we sort of stick to our processes and I know it sounds cliche, but I think it keeps us sort of level-headed and naturally as Kiwis we tend to stay where our feet are, which I think is a positive,” he adds. 'Tend to stay where our feet are' is what stands out. And this comes from one of the most colourful individuals who is filled with life and flair in the New Zealand dressing room. So, it comes as no surprise when Williamson plays down what has been an incredibly tough eight months for him personally. After the injury he suffered at the start of the Indian Premier League, it seemed like he was not going to make it the World Cup. But he did. And then, he is back on the field for his very first game of the tournament only to get hit by a throw and fracture his thumb. But New Zealand Cricket knows he will come back again and they know that the team will need him in the business end of the tournament. They kept him with the team, and he made a come back, again. Williamson calls it “an interesting journey” before expressing his gratitude to be in a position to lead the team in another semifinal. He did make sure that people knew the thumbs fracture was not funny even when he was explaining it with a laugh. “It was quite frustrating and testing but still feeling that it hadn't ruled me out so I still was grateful for that and it's nice to be fitter than perhaps I was yesterday and be sitting here,” he said. This unassuming personality, that takes a step back every time he faces a ball or sets the field during the game, is the essence and spirit of this Black Caps team. They would be the friendliest people when you talk to them, but you would not want to be on the other end off the 22 yards against them. Out there, they give it all. Weeks ago when they played India in Dharamsala, there were questions about the outfield and even India captain Rohit Sharma were gesturing players not to dive. New Zealand, however, were having a ball. They were throwing themselves around to stop the ball, and saved at least 20-30 runs, making it all the more harder for India. \"We’ve got standards within our Black Caps that you come and do everything you can to help us win games of cricket and part of that is diving on the boundary and stopping the ball when you get the chance and that's something we're proud of ourselves as Black Caps and we'll continue to do it no matter where we play in the world,\" Daryl Mitchell said. Expect nothing less when Williamson leads them on to the field in front of a sea of blue on Wednesday. They are going to push India’s limits, give everything they could and put on a spectacle. For that is what the Black Caps are. They will not go down without a fight.","content":"MUMBAI: The press conference room at the Wankhede Stadium was packed on a hot and humid Tuesday afternoon. New Zealand captain Kane Williamson saunters in seemingly oblivious of the fact that two stern tests await him. First one of course is during the media interaction in the afternoon where he would be reminded of New Zealand's tales of near misses in ICC top events, and the next one will be on Wednesday when his team takes on India in the most important match of their lives. The first question fired: “Welcome to Mumbai just going back in history about the 29th of May 1953 about 70 years back…” and Williamson interrupts nonchalantly, “Yeah, I remember that”, as the entire room erupts into laughter. When he walks on to the field on Thursday, it will be his fifth ICC World Cup semifinal across formats as captain. Yet, here was Williamson, less than 24 hours away from what is the most important match they have played so far, turning a serious question about scaling the highest peak in the world into some kind of a joke. And of course, New Zealand would be wary of the highest peak in cricket they are trying to climb. In fact, it pretty much sums up New Zealand’s campaign so far. They kicked off the tournament with four consecutive wins before being in a position where they almost missed out on the semifinals. They had a injury list when put together could be longer than the playing XI. From there on, they pulled back to enter their fifth consecutive ODI World Cup semifinal. The tags like ‘underdogs’ and ‘dark horses’ that are often linked with New Zealand in the lead up to global events usually seem out of place. Considering a country with a population that is a quarter of Mumbai and with just six premier domestic teams where cricket plays second fiddle to their national passion rugby, one must confess New Zealand have been among the most consistent teams at ICC events. In the last four years, they have played two white-ball World Cup finals, one semifinal and have won an ICC World Test Championship title. Ask Lockie Ferguson what makes them tick at World Cups, he doesn’t have a straight specific answer. “I’d love to know” he laughs. “When we start the competition, much like every other team we're here to win it, but of course we know there's a process and I think certainly within our team we've played a lot of cricket together for a long period of time, so we sort of stick to our processes and I know it sounds cliche, but I think it keeps us sort of level-headed and naturally as Kiwis we tend to stay where our feet are, which I think is a positive,” he adds. 'Tend to stay where our feet are' is what stands out. And this comes from one of the most colourful individuals who is filled with life and flair in the New Zealand dressing room. So, it comes as no surprise when Williamson plays down what has been an incredibly tough eight months for him personally. After the injury he suffered at the start of the Indian Premier League, it seemed like he was not going to make it the World Cup. But he did. And then, he is back on the field for his very first game of the tournament only to get hit by a throw and fracture his thumb. But New Zealand Cricket knows he will come back again and they know that the team will need him in the business end of the tournament. They kept him with the team, and he made a come back, again. Williamson calls it “an interesting journey” before expressing his gratitude to be in a position to lead the team in another semifinal. He did make sure that people knew the thumbs fracture was not funny even when he was explaining it with a laugh. “It was quite frustrating and testing but still feeling that it hadn't ruled me out so I still was grateful for that and it's nice to be fitter than perhaps I was yesterday and be sitting here,” he said. This unassuming personality, that takes a step back every time he faces a ball or sets the field during the game, is the essence and spirit of this Black Caps team. They would be the friendliest people when you talk to them, but you would not want to be on the other end off the 22 yards against them. Out there, they give it all. Weeks ago when they played India in Dharamsala, there were questions about the outfield and even India captain Rohit Sharma were gesturing players not to dive. New Zealand, however, were having a ball. They were throwing themselves around to stop the ball, and saved at least 20-30 runs, making it all the more harder for India. \"We’ve got standards within our Black Caps that you come and do everything you can to help us win games of cricket and part of that is diving on the boundary and stopping the ball when you get the chance and that's something we're proud of ourselves as Black Caps and we'll continue to do it no matter where we play in the world,\" Daryl Mitchell said. Expect nothing less when Williamson leads them on to the field in front of a sea of blue on Wednesday. They are going to push India’s limits, give everything they could and put on a spectacle. For that is what the Black Caps are. They will not go down without a fight.","pubDate":"2023-11-15 01:44:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"dd368f8ae4f7b7d1d1ced8b15e47dcf1","title":"Box office showdown: Sparks set to fly as Indian juggernaut faces tricky New Zealand in repeat of 2019 semifinal","link":"https://www.tribuneindia.com/news/sports/box-office-showdown-sparks-set-to-fly-as-indian-juggernaut-faces-tricky-new-zealand-in-repeat-of-2019-semifinal-562482","keywords":null,"creator":null,"video_url":null,"description":"Rohit Mahajan Mumbai, November 14 India have smashed every opponent over the past six weeks, but now comes the moment of truth — and moment of luck, too, says Rohit Sharma, the Indian captain. New Zealand's captain Kane Williamson warms up during practice. Reuters \"The time has come that you need a little bit of luck to go your way,\" said Rohit on the eve of their semifinal against New Zealand. \"Obviously, we're going to be brave enough. And hopefully, fortune favours the brave.\" The time has come that you need a little bit of luck to go your way. Obviously, we're going to be brave enough. And hopefully, fortune favours the brave. Rohit Sharma The underdog thing, from what you guys write, I do not think it has changed too much, but that is fine you know, and India have been exceptional. Kane Williamson Rohit's assertion of positivity seemed to reflect a mind coach's words; his comment about luck, the need for luck, however, reflected the underlying fear of the unknown that preys on the mind of a sportsperson. 85 India currently have the most wickets (85), best economy rate (4.5), best average (19.6) and best strike-rate (26.2) among all teams in the World Cup. 6.5 New Zealand have been effective at scoring runs quickly in this World Cup, having the joint-highest run rate (6.5) among all teams in the tournament. 5 In nine World Cup matches against each other, New Zealand have won five times, while India have won four times. In any game, there are uncontrollables that sportspersons are wary of; at the Wankhede, which side the coin lands on at the toss could be a decisive uncontrollable — teams batting first enjoy a massive advantage at this ground, right from the first game in 1987, when India batted first against Sri Lanka and piled up 299 in those days of relatively conservative batting. During this tournament, batting first, South Africa made 399/7 against England and 382/5 against Bangladesh and won with ease; India then smashed 357/8 against Sri Lanka and routed them by 302 runs; Afghanistan made 291/5 against Australia and lost — but that was only due to a freakish innings of 201 by Glenn Maxwell, and the inexperience of the Afghan bowlers. When the stadium was redeveloped before the 2011 World Cup, the ground became smaller, playing right into the hands of the batsmen. The dice is loaded in favour of the batsmen — in 12 ODIs played at the ground since the stadium's diminution, the team batting first has topped 300 four times, once exceeding 400. The clincher? The average first-innings total here since then is 308, the average for the second innings is 218 — a clear difference of 90 runs. If that doesn't make the toss — perhaps the 'luck' Rohit talked about — critical, nothing would. The mantra would be — bat first, pile up a huge score when the conditions favour the batters, then rock the opposition with movement in the air and off the pitch, as India did against Sri Lanka. What India did to Sri Lanka, New Zealand can do to India under the lights — they do have the resources in Trent Boult, the tall left-handed paceman who can make the ball angle across and then suddenly bend it back into the right-hander. Under the lights at the Wankhede, the ball has swung prodigiously — Boult could be quite a handful here, as he was in Manchester on July 9-10, 2019, when New Zealand beat India at the same stage of the World Cup. India have struck fear into the hearts of the opposition, especially their pace bowlers — and their spin bowlers, and their batsmen! The pace trio of Mohammed Shami, Jasprit Bumrah and Mohammed Siraj has taken 45 wickets; spin twins Ravindra Jadeja and Kuldeep Yadav have another 30; Virat Kohli, Rohit Sharma and Shreyas Iyer have accumulated 1,518 runs, average 72.28; KL Rahul and Shubman Gill have 347 and 270 runs, respectively. Really, it seems India have all their bases covered, as Rohit said. \"The first (part) of the tournament, we chased the first five games, then the next four games we batted first,\" said Rohit. \"So, in terms of the areas that we wanted to cover, I think we've covered almost every bit. We do understand the importance of this week, but I don't think we need to do anything different from what we've been doing in this tournament.\" Yes, but a bit of luck would be most welcome. Everybody wants a piece of Rachin Rachin Ravindra, 24 in four days, is a bald man's envy — he seems to have such a full head of hair as could be enough for three men. But he's also the envy of batsmen of all sorts, hairy or bald — the Wellington-born young man, son of migrants from India, has scored 565 runs in nine innings, average 70.62, with three hundreds and two 50s. Rachin Ravindra and Daryl Mitchell have been New Zealand's best batsmen in the tournament so far. REUTERS He's inspired myths, too, with the internet buzzing with the news that his name is a combination of the names of two legends, Rahul Dravid and Sachin Tendulkar. In fact, he himself seemed to have bought into this, having said: \"Back in the day when Mum and Dad were deciding the names, they both liked Rahul and Sachin, so \"Ra\" from Rahul and \"chin\" from Sachin, but that was a long time ago. We don't talk about it much anymore.\" That's a pleasing and plausible story, but his father now says the son got his facts wrong. He was named Rachin because it \"sounded good, was easy to spell, and short\", says the dad, Ravi Krishnamurthy, who obviously possesses accurate information. He added that Rachin wasn't named \"with the intention to make our child a cricketer\". But he's turned out to be quite a useful cricketer, as Kane Williamson acknowledged with his native effusiveness. \"Yeah, good player, right?\" Kane and Everest Kane Williamson is still cool. He was the losing captain in the 2019 World Cup final, and shrugged off the defeat that July 14 with remarkable stoicism, saying: \"Yeah, obviously, just gutted.\" Today, before the biggest game of the World Cup so far, Williamson put up a comedic performance, raising laughter loud and often. The first question to him started with: \"Kane, just going back in history a bit, 29th of May 1953, about 70 years backhellip;\" Williamson interrupted him: \"I remember, yeah!\" Williamson had been some 30 minutes late for the press conference. His tardiness was punished just as the first question was asked, as the sound failed. Williamson kept the restive reporters in good humour with wisecracks. There was another interruption — the public address system of the ground was being tested, and a male voice boomed through the room: \"Mic check, mic check, mic checkhellip;\" Williamson responded: \"The mic's working, the mic's working!\" The press conference stops, and when it was time to resume it, Williamson sought to know if all's well with: \"Mic check, mic check, mic check,\" mimicking the invisible voice that had caused the interruption. This is my property! Some cricket-lovers were spotted at the Marine Drive today. It was easy to spot them, for they were dressed in identical blue shirts and ICC World Cup caps. They're an excited lot, the few who seem excited about the cricket. They're discussing their exclusive properties, their \"licensed cricket digital collectibles\". The video worth $700. What are these? \"They are digitally signed properties, such as videos, which are released in limited numbers,\" says Vijay Kumar, an engineer from Bengaluru. He then displays a video of Virat Kohli that, he says, is valued at $700. But how can a video that can be watched by everyone on the internet be valued so much, one wonders. \"It's not just the video, one gets privileges if one possesses these properties,\" says Vijay. \"So, those who have certain properties can take part in contests where one can win a sizeable prize money. Today we met Shane Watson, who was in the commentary box, just because we have these collectibles!\" In impressive tones, the talks about a limited edition Sachin Tendulkar digital property — a digitally signed video — which he says is worth $25,000. \"Only five of these have been released so far!\" he says. All this sounds a bit fishy to those used to the idea of brick and mortar companies, but Vijay Kumar and his friends are sure they've got a good thing going. — Rohit Mahajan","content":"Tribune News Service Rohit Mahajan Mumbai, November 14 India have smashed every opponent over the past six weeks, but now comes the moment of truth — and moment of luck, too, says Rohit Sharma, the Indian captain. “The time has come that you need a little bit of luck to go your way,” said Rohit on the eve of their semifinal against New Zealand. “Obviously, we’re going to be brave enough. And hopefully, fortune favours the brave.” The time has come that you need a little bit of luck to go your way. Obviously, we’re going to be brave enough. And hopefully, fortune favours the brave. Rohit Sharma The underdog thing, from what you guys write, I do not think it has changed too much, but that is fine you know, and India have been exceptional. Kane Williamson Rohit’s assertion of positivity seemed to reflect a mind coach’s words; his comment about luck, the need for luck, however, reflected the underlying fear of the unknown that preys on the mind of a sportsperson. 85 India currently have the most wickets (85), best economy rate (4.5), best average (19.6) and best strike-rate (26.2) among all teams in the World Cup. 6.5 New Zealand have been effective at scoring runs quickly in this World Cup, having the joint-highest run rate (6.5) among all teams in the tournament. 5 In nine World Cup matches against each other, New Zealand have won five times, while India have won four times. In any game, there are uncontrollables that sportspersons are wary of; at the Wankhede, which side the coin lands on at the toss could be a decisive uncontrollable — teams batting first enjoy a massive advantage at this ground, right from the first game in 1987, when India batted first against Sri Lanka and piled up 299 in those days of relatively conservative batting. During this tournament, batting first, South Africa made 399/7 against England and 382/5 against Bangladesh and won with ease; India then smashed 357/8 against Sri Lanka and routed them by 302 runs; Afghanistan made 291/5 against Australia and lost — but that was only due to a freakish innings of 201 by Glenn Maxwell, and the inexperience of the Afghan bowlers. When the stadium was redeveloped before the 2011 World Cup, the ground became smaller, playing right into the hands of the batsmen. The dice is loaded in favour of the batsmen — in 12 ODIs played at the ground since the stadium’s diminution, the team batting first has topped 300 four times, once exceeding 400. The clincher? The average first-innings total here since then is 308, the average for the second innings is 218 — a clear difference of 90 runs. If that doesn’t make the toss — perhaps the ‘luck’ Rohit talked about — critical, nothing would. The mantra would be — bat first, pile up a huge score when the conditions favour the batters, then rock the opposition with movement in the air and off the pitch, as India did against Sri Lanka. What India did to Sri Lanka, New Zealand can do to India under the lights — they do have the resources in Trent Boult, the tall left-handed paceman who can make the ball angle across and then suddenly bend it back into the right-hander. Under the lights at the Wankhede, the ball has swung prodigiously — Boult could be quite a handful here, as he was in Manchester on July 9-10, 2019, when New Zealand beat India at the same stage of the World Cup. India have struck fear into the hearts of the opposition, especially their pace bowlers — and their spin bowlers, and their batsmen! The pace trio of Mohammed Shami, Jasprit Bumrah and Mohammed Siraj has taken 45 wickets; spin twins Ravindra Jadeja and Kuldeep Yadav have another 30; Virat Kohli, Rohit Sharma and Shreyas Iyer have accumulated 1,518 runs, average 72.28; KL Rahul and Shubman Gill have 347 and 270 runs, respectively. Really, it seems India have all their bases covered, as Rohit said. “The first (part) of the tournament, we chased the first five games, then the next four games we batted first,” said Rohit. “So, in terms of the areas that we wanted to cover, I think we’ve covered almost every bit. We do understand the importance of this week, but I don’t think we need to do anything different from what we’ve been doing in this tournament.” Yes, but a bit of luck would be most welcome. Everybody wants a piece of Rachin Rachin Ravindra, 24 in four days, is a bald man’s envy — he seems to have such a full head of hair as could be enough for three men. But he’s also the envy of batsmen of all sorts, hairy or bald — the Wellington-born young man, son of migrants from India, has scored 565 runs in nine innings, average 70.62, with three hundreds and two 50s. He’s inspired myths, too, with the internet buzzing with the news that his name is a combination of the names of two legends, Rahul Dravid and Sachin Tendulkar. In fact, he himself seemed to have bought into this, having said: “Back in the day when Mum and Dad were deciding the names, they both liked Rahul and Sachin, so “Ra” from Rahul and “chin” from Sachin, but that was a long time ago. We don’t talk about it much anymore.” That’s a pleasing and plausible story, but his father now says the son got his facts wrong. He was named Rachin because it “sounded good, was easy to spell, and short”, says the dad, Ravi Krishnamurthy, who obviously possesses accurate information. He added that Rachin wasn’t named “with the intention to make our child a cricketer”. But he’s turned out to be quite a useful cricketer, as Kane Williamson acknowledged with his native effusiveness. “Yeah, good player, right?” Kane and Everest Kane Williamson is still cool. He was the losing captain in the 2019 World Cup final, and shrugged off the defeat that July 14 with remarkable stoicism, saying: “Yeah, obviously, just gutted.” Today, before the biggest game of the World Cup so far, Williamson put up a comedic performance, raising laughter loud and often. The first question to him started with: “Kane, just going back in history a bit, 29th of May 1953, about 70 years back…” Williamson interrupted him: “I remember, yeah!” Williamson had been some 30 minutes late for the press conference. His tardiness was punished just as the first question was asked, as the sound failed. Williamson kept the restive reporters in good humour with wisecracks. There was another interruption — the public address system of the ground was being tested, and a male voice boomed through the room: “Mic check, mic check, mic check…” Williamson responded: “The mic’s working, the mic’s working!” The press conference stops, and when it was time to resume it, Williamson sought to know if all’s well with: “Mic check, mic check, mic check,” mimicking the invisible voice that had caused the interruption. This is my property! Some cricket-lovers were spotted at the Marine Drive today. It was easy to spot them, for they were dressed in identical blue shirts and ICC World Cup caps. They’re an excited lot, the few who seem excited about the cricket. They’re discussing their exclusive properties, their “licensed cricket digital collectibles”. What are these? “They are digitally signed properties, such as videos, which are released in limited numbers,” says Vijay Kumar, an engineer from Bengaluru. He then displays a video of Virat Kohli that, he says, is valued at $700. But how can a video that can be watched by everyone on the internet be valued so much, one wonders. “It’s not just the video, one gets privileges if one possesses these properties,” says Vijay. “So, those who have certain properties can take part in contests where one can win a sizeable prize money. Today we met Shane Watson, who was in the commentary box, just because we have these collectibles!” In impressive tones, the talks about a limited edition Sachin Tendulkar digital property — a digitally signed video — which he says is worth $25,000. “Only five of these have been released so far!” he says. All this sounds a bit fishy to those used to the idea of brick and mortar companies, but Vijay Kumar and his friends are sure they’ve got a good thing going. — Rohit Mahajan #Mumbai #New Zealand #Rohit Sharma","pubDate":"2023-11-15 01:41:31","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/11/2023_11$largeimg_1744845718.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4709853e97a7d131d27112a85165235e","title":"World Cup: Fascinating contest on the cards between equals","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/world-cup-fascinating-conteston-the-cards-between-equals-2632887.html","keywords":null,"creator":null,"video_url":null,"description":"Australia and South Africa, two teams familiar to each other at the World Cup stage, meet in second semifinal at Eden Gardens in Kolkata KOLKATA: The Eden Gardens in Kolkata is all decked up for the second semifinal between heavyweights Australia and South Africa. But if one compares the buzz with that of India's league match against the latter at the venue on November 5, the enthusiasm and craze seem to be missing. The roads surrounding the stadium were sparsely occupied on Tuesday with only a few trying to get their hands on the tickets. In fact, almost all of them were successful even with only two days to go for the match. It was the complete opposite when the Men in Blue landed in the City of Joy less than a fortnight ago with the cops resorting to lathi charge to disburse the agitated crowd as they failed to procure the tickets. With Virat Kohli's birthday falling on the match day, the scene became even more chaotic as fans celebrated his birthday on roads, which already were chock-a-block with ticket seekers. Intensity off the field might be missing but the same could not be said inside the venue. Both teams had long training sessions both on Monday and Tuesday and are scheduled to have another one on Wednesday before the clash. Given the history they share, especially in the World Cup, the contest is expected to be loaded with action. Be it the Super Six encounter at the 1999 edition wherein skipper Steve Waugh came up with a gritty unbeaten century to see his team home or the second semifinal only four days apart that ended in a tie with the eventual champions progressing by virtue of their win in the previous match. Australia had it easy eight years later as they won both the league match and second semifinal but South Africa registered a close 10-run victory when they met next in 2019. They extended that run this edition as well when they humbled the five-time champions by 134 runs last month in a league match. Overall, both the sides have played seven matches in the showpiece event since South Africa's return to international cricket in 1992. All those contests have been even-stevens affairs with each side winning three each, with one ending in a tie. Temba Bavuma and Co, however, can take confidence from the fact that the Australians have never defeated them in an ODI in India. Since 1996, when they played three ODIs in the Titan Cup, the Proteas had emerged winners each time, pocketing all the four matches. Come Thursday, the past records have no bearing as a lot will be on stake for both the teams. For South Africa, this will be a chance to break the semifinal hoodoo and march a step closer to holding the coveted trophy. Australia, in turn, will be eager to add yet another silverware to their already full cabinet. Rain threat There is a threat of rain in Kolkata with the Indian Meteorological Department (IMD) predicting formation of a low pressure area over Southeast Bay of Bengal and adjoining Andaman-Nicobar Islands. As per the IMD, it is likely to move west-northwestwards and intensify into a depression over West Central Bay of Bengal on Wednesday. \"Thereafter, it would move northwestwards and may intensify into a deep depression over West Central Bay of Bengal off Andhra Pradesh coast on Thursday. Subsequently, it would recurve north-northeast wards and reach Northwest Bay of Bengal off Odisha coast on Friday,\" the IMD said. The city may see rain from this system on both days, including Friday, reserve day. Snehasish Ganguly, Cricket Association of Bengal (CAB) president, believes they are ready to tackle the situation. \"We can cover the entire ground in no time. The drainage system here is world class. So in that sense we are absolutely ready to host the match,\" the CAB president told this daily. Notably, the association bought covers from the United Kingdom before the 2016 T20 World Cup. \"The covers are divided into four quarters and are lightweight, so they can be easily pulled from corners at each quarter of the ground in no time. Besides, we have three super soppers in case we need to dry the outfield,\" Arindam Basu, venue media manager, told this daily.","content":"KOLKATA: The Eden Gardens in Kolkata is all decked up for the second semifinal between heavyweights Australia and South Africa. But if one compares the buzz with that of India's league match against the latter at the venue on November 5, the enthusiasm and craze seem to be missing. The roads surrounding the stadium were sparsely occupied on Tuesday with only a few trying to get their hands on the tickets. In fact, almost all of them were successful even with only two days to go for the match. It was the complete opposite when the Men in Blue landed in the City of Joy less than a fortnight ago with the cops resorting to lathi charge to disburse the agitated crowd as they failed to procure the tickets. With Virat Kohli's birthday falling on the match day, the scene became even more chaotic as fans celebrated his birthday on roads, which already were chock-a-block with ticket seekers. Intensity off the field might be missing but the same could not be said inside the venue. Both teams had long training sessions both on Monday and Tuesday and are scheduled to have another one on Wednesday before the clash. Given the history they share, especially in the World Cup, the contest is expected to be loaded with action. Be it the Super Six encounter at the 1999 edition wherein skipper Steve Waugh came up with a gritty unbeaten century to see his team home or the second semifinal only four days apart that ended in a tie with the eventual champions progressing by virtue of their win in the previous match. Australia had it easy eight years later as they won both the league match and second semifinal but South Africa registered a close 10-run victory when they met next in 2019. They extended that run this edition as well when they humbled the five-time champions by 134 runs last month in a league match. Overall, both the sides have played seven matches in the showpiece event since South Africa's return to international cricket in 1992. All those contests have been even-stevens affairs with each side winning three each, with one ending in a tie. Temba Bavuma and Co, however, can take confidence from the fact that the Australians have never defeated them in an ODI in India. Since 1996, when they played three ODIs in the Titan Cup, the Proteas had emerged winners each time, pocketing all the four matches. Come Thursday, the past records have no bearing as a lot will be on stake for both the teams. For South Africa, this will be a chance to break the semifinal hoodoo and march a step closer to holding the coveted trophy. Australia, in turn, will be eager to add yet another silverware to their already full cabinet. There is a threat of rain in Kolkata with the Indian Meteorological Department (IMD) predicting formation of a low pressure area over Southeast Bay of Bengal and adjoining Andaman-Nicobar Islands. As per the IMD, it is likely to move west-northwestwards and intensify into a depression over West Central Bay of Bengal on Wednesday. \"Thereafter, it would move northwestwards and may intensify into a deep depression over West Central Bay of Bengal off Andhra Pradesh coast on Thursday. Subsequently, it would recurve north-northeast wards and reach Northwest Bay of Bengal off Odisha coast on Friday,\" the IMD said. The city may see rain from this system on both days, including Friday, reserve day. Snehasish Ganguly, Cricket Association of Bengal (CAB) president, believes they are ready to tackle the situation. \"We can cover the entire ground in no time. The drainage system here is world class. So in that sense we are absolutely ready to host the match,\" the CAB president told this daily. Notably, the association bought covers from the United Kingdom before the 2016 T20 World Cup. \"The covers are divided into four quarters and are lightweight, so they can be easily pulled from corners at each quarter of the ground in no time. Besides, we have three super soppers in case we need to dry the outfield,\" Arindam Basu, venue media manager, told this daily.","pubDate":"2023-11-15 01:27:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"b364ba95b2e1daa7362690359f433d95","title":"Need more U19 and Emerging tours, a domestic red-ball tournament for Indian women: ICC Hall of Famer Diana Edulji","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/need-more-u19-and-emerging-tours-a-domestic-red-ball-tournament-for-indian-women-icc-hall-of-famer-2632889.html","keywords":null,"creator":null,"video_url":null,"description":"Edulji played 20 Tests and 34 ODIs in her career and took 107 wickets across formats. MUMBAI: Former India captain and ICC Hall of Famer Diana Edulji believes that having more U19 and Emerging team tours along with bringing back the domestic red-ball tournament are the way to go forward for women's cricket in India. Edulji, one of the pioneers of women's cricket in India, was inducted into the ICC Hall of Fame earlier this week. And with this, she became the first Indian women cricketer to be given the honour, recognising her contribution to the sport and 17-year-long international career. \"It's a big, big honor for me. I think it is the right time because the World Cup is in India and a woman cricketer from India is being recognized,\" Edulji told this daily during an ICC event ahead of the first semifinal of the 2023 ICC Men's ODI World Cup in Mumbai on Tuesday. Edulji played 20 Tests and 34 ODIs in her career and took 107 wickets across formats. She also led her country in four Tests and 18 ODIs, including in the 1993 Women's World Cup in England. Long after her retirement from international cricket, she served as one of the members of the Supreme Court-appointed Committee of Administrators (CoA) to oversee the running of the BCCI from 2017 to 2019. During the interaction, she credited ICC and BCCI for the work they have put in for women's cricket saying, \"The ICC is doing a lot to promote women's cricket, and BCCI itself is doing a lot and I think together women's cricket now can go forward.\" The year 2023 has been good for women's cricket, especially India. They won the U19 T20 World Cup, reached the semifinal of the senior event, the inaugural season of the Women's Premier League saw viewership reach new heights and the senior team won the gold medal in the Asian Games. When asked how could they take the momentum forward, the 67-year-old said that playing continuous cricket is the way. \"Whether it's domestic, whether it's international, the players can't be playing a lot of cricket in one month and then spend another three months at home. Now there has to be a proper structure. I'm very happy that BCCI has agreed to play Test matches. That is the right step. If you want cricket to improve, you have to learn to play the longer version, then you can play all the versions. You have to get that temperament to stay at the wicket,\" she said referring to India women's two home Tests against England and Australia in December. While India women are getting ready to play their first home Test game in nine years, they do not have a domestic red-ball event at the moment. In the past, there used to be a Senior Women's Cricket Inter Zonal Three-Day tournament, but the competition was discontinued after the 2017-18 season. Edulji believes that there has to be a first-class tournament for the women at the domestic level. \"Definitely domestic cricket has to have one longer version tournament,\" she said. Praising the up-and-coming generation of cricketers who won the U19 T20 World Cup earlier this year, Edulji said that they need to push and make their case, putting pressure on the senior players. \"I'm really surprised that they still haven't yet made it into the senior team. I think they need to put pressure, which will help the seniors also play that there is someone behind now,\" she said. With the next Women's ODI World Cup set to be played in India in 2025, Edulji said there has to be a lot of Women's U19 and Emerging tours like the men do over the next two years. \"That's how we can build bench strength. You need a lot of tours, but it's not necessary that you have to play the big country, you can play the smaller countries with the Under-19, and then it is possible that you can build and have a very strong team and win the World Cup,\" Edulji signed off.","content":"MUMBAI: Former India captain and ICC Hall of Famer Diana Edulji believes that having more U19 and Emerging team tours along with bringing back the domestic red-ball tournament are the way to go forward for women's cricket in India. Edulji, one of the pioneers of women's cricket in India, was inducted into the ICC Hall of Fame earlier this week. And with this, she became the first Indian women cricketer to be given the honour, recognising her contribution to the sport and 17-year-long international career. \"It's a big, big honor for me. I think it is the right time because the World Cup is in India and a woman cricketer from India is being recognized,\" Edulji told this daily during an ICC event ahead of the first semifinal of the 2023 ICC Men's ODI World Cup in Mumbai on Tuesday. Edulji played 20 Tests and 34 ODIs in her career and took 107 wickets across formats. She also led her country in four Tests and 18 ODIs, including in the 1993 Women's World Cup in England. Long after her retirement from international cricket, she served as one of the members of the Supreme Court-appointed Committee of Administrators (CoA) to oversee the running of the BCCI from 2017 to 2019. During the interaction, she credited ICC and BCCI for the work they have put in for women's cricket saying, \"The ICC is doing a lot to promote women's cricket, and BCCI itself is doing a lot and I think together women's cricket now can go forward.\" The year 2023 has been good for women's cricket, especially India. They won the U19 T20 World Cup, reached the semifinal of the senior event, the inaugural season of the Women's Premier League saw viewership reach new heights and the senior team won the gold medal in the Asian Games. When asked how could they take the momentum forward, the 67-year-old said that playing continuous cricket is the way. \"Whether it's domestic, whether it's international, the players can't be playing a lot of cricket in one month and then spend another three months at home. Now there has to be a proper structure. I'm very happy that BCCI has agreed to play Test matches. That is the right step. If you want cricket to improve, you have to learn to play the longer version, then you can play all the versions. You have to get that temperament to stay at the wicket,\" she said referring to India women's two home Tests against England and Australia in December. While India women are getting ready to play their first home Test game in nine years, they do not have a domestic red-ball event at the moment. In the past, there used to be a Senior Women's Cricket Inter Zonal Three-Day tournament, but the competition was discontinued after the 2017-18 season. Edulji believes that there has to be a first-class tournament for the women at the domestic level. \"Definitely domestic cricket has to have one longer version tournament,\" she said. Praising the up-and-coming generation of cricketers who won the U19 T20 World Cup earlier this year, Edulji said that they need to push and make their case, putting pressure on the senior players. \"I'm really surprised that they still haven't yet made it into the senior team. I think they need to put pressure, which will help the seniors also play that there is someone behind now,\" she said. With the next Women's ODI World Cup set to be played in India in 2025, Edulji said there has to be a lot of Women's U19 and Emerging tours like the men do over the next two years. \"That's how we can build bench strength. You need a lot of tours, but it's not necessary that you have to play the big country, you can play the smaller countries with the Under-19, and then it is possible that you can build and have a very strong team and win the World Cup,\" Edulji signed off.","pubDate":"2023-11-15 01:21:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"9d38cd4911d9459f6e7f644f5a751709","title":"With new zeal, India look to bury demons of past","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/with-new-zeal-india-look-to-bury-demons-of-past-2632981.html","keywords":null,"creator":null,"video_url":null,"description":"On Tuesday, it seemed different. The buzz and excitement in the sea breeze are palpable despite the inherent pollution you can feel. MUMBAI: The streets of Colaba are abuzz. They are filled with people, and tourists all through the day so much so that if you stand at any point in the street, the crowd will take you forward all by itself. In fact, it is what a regular day in the commercial capital of India looks like. On Tuesday, it seemed different. The buzz and excitement in the sea breeze are palpable despite the inherent pollution you can feel. In Colaba, everywhere you turn, you can see vendors selling India’s replica jerseys. Pick one and the vendor would say it’s `950 bucks, before convincing you to buy the one he has for `550. The hotels are being swarmed by fans who have travelled to watch the game. At the Wankhede Stadium, final preparations are underway as the iconic venue is set to host what is probably the most significant cricket game they have hosted since April 2, 2011. India vs New Zealand. Semifinal. 2023 ICC Men’s ODI World Cup. This movie has been screened before. In Old Trafford four years ago against the same team. In Sydney, against Australia eight years ago. The Men in Blue would dominate the tournament up until the semifinal only to fall short there. It’s a movie that has given heartbreaks to a billion people year after year in every ICC event in the last decade. This time, however, it seems different. One can feel the hope in the air. This Rohit Sharma-led Indian team has been unstoppable. They have the best batters of the tournament, including Sharma and Virat Kohli. Five among their top seven batters average well over 50 with three striking above run-a-ball. All five — Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja — have taken more than ten wickets (three of them average less than 20), taking turns to win the Player of the Match awards. As a group, they have made a mockery of the term ‘contest’ outplaying every opponent, except one team. New Zealand. The Black Caps are the only team that got in their faces and made them work. Even though India beat them in the league stages, it did not come easy. That is why, the semifinal against New Zealand at Mumbai is poetic in more than one way. For starters, it is the team that has been India’s nemesis in world meets for a while — 2016 World T20 league game, 2019 WC semifinal, and 2021 World Test Championship final, 2021 World T20 league game. And it’s a team that has the resources to test this Indian team at this venue. The shorter boundaries and conditions will help New Zealand take on Indian spinners and they also have the seam attack to trouble the Indian top-order. The trophy drought of this Indian team is vastly talked and discussed about. India have not won an ICC trophy in ten years. In this decade, India entered two T20 WC semifinals, two ODI World Cup semifinals, a Champions Trophy, and two WTC finals. For a team that began its transition in the same year as they won their last ICC title, it is not all that bad. But lack of a trophy for the sports’ only financial behemoth is jarring. Not a champion unless you become one of the world. The players know it too. That could be why some of them, including Sharma, probably playing their last World Cup want to win the trophy badly. He said as much at the start of the event. While acknowledging that there is unfinished business and he is desperate to an extent to hold that trophy aloft come November 19, Sharma insisted on finding a balance. Sharma also mentioned the one thing that India hasn’t had in World Cup knockouts — luck. “Obviously we have to leave a lot of things to Almighty as well because we need that little bit of luck in the tournament. I hope we get that luck. But yeah, it will be nice to win a World Cup,” he had said in Chennai before the game against Australia. Two games away from making that dream come true, Sharma reflected on the league stage, saying that it is all about breaking down into parts and moving forward. “Nine games is a lot of games, literally two or three bilateral series. With different games and different venues, you have to break it down into different styles and strategies as well. I think we did that well. In the first half, we chased the first five games, and next four, we batted first. In terms of areas we wanted to cover, we have covered almost every bit of it. We do understand the importance of this week but for us, I don’t think we need to do anything different from what we have been doing in this tournament. There will be challenges. You just got to respond, front up, and get through that situation,” Sharma said on Tuesday before adding, “Now the time has come, you need a little bit of luck to go your way. Obviously, we are going to be brave enough. Hopefully, fortune will favour the brave.” The demons of the semifinal have chased India at ICC events for far too long now. On Wednesday, India have a chance to bury the demons at a venue where they conquered the world 12 years ago. This current crop has the ability to reach the first global white ball final since 2017. Will they? Only time will tell.","content":"MUMBAI: The streets of Colaba are abuzz. They are filled with people, and tourists all through the day so much so that if you stand at any point in the street, the crowd will take you forward all by itself. In fact, it is what a regular day in the commercial capital of India looks like. On Tuesday, it seemed different. The buzz and excitement in the sea breeze are palpable despite the inherent pollution you can feel. In Colaba, everywhere you turn, you can see vendors selling India’s replica jerseys. Pick one and the vendor would say it’s `950 bucks, before convincing you to buy the one he has for `550. The hotels are being swarmed by fans who have travelled to watch the game. At the Wankhede Stadium, final preparations are underway as the iconic venue is set to host what is probably the most significant cricket game they have hosted since April 2, 2011. India vs New Zealand. Semifinal. 2023 ICC Men’s ODI World Cup. This movie has been screened before. In Old Trafford four years ago against the same team. In Sydney, against Australia eight years ago. The Men in Blue would dominate the tournament up until the semifinal only to fall short there. It’s a movie that has given heartbreaks to a billion people year after year in every ICC event in the last decade. This time, however, it seems different. One can feel the hope in the air. This Rohit Sharma-led Indian team has been unstoppable. They have the best batters of the tournament, including Sharma and Virat Kohli. Five among their top seven batters average well over 50 with three striking above run-a-ball. All five — Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja — have taken more than ten wickets (three of them average less than 20), taking turns to win the Player of the Match awards. As a group, they have made a mockery of the term ‘contest’ outplaying every opponent, except one team. New Zealand. The Black Caps are the only team that got in their faces and made them work. Even though India beat them in the league stages, it did not come easy. That is why, the semifinal against New Zealand at Mumbai is poetic in more than one way. For starters, it is the team that has been India’s nemesis in world meets for a while — 2016 World T20 league game, 2019 WC semifinal, and 2021 World Test Championship final, 2021 World T20 league game. And it’s a team that has the resources to test this Indian team at this venue. The shorter boundaries and conditions will help New Zealand take on Indian spinners and they also have the seam attack to trouble the Indian top-order. The trophy drought of this Indian team is vastly talked and discussed about. India have not won an ICC trophy in ten years. In this decade, India entered two T20 WC semifinals, two ODI World Cup semifinals, a Champions Trophy, and two WTC finals. For a team that began its transition in the same year as they won their last ICC title, it is not all that bad. But lack of a trophy for the sports’ only financial behemoth is jarring. Not a champion unless you become one of the world. The players know it too. That could be why some of them, including Sharma, probably playing their last World Cup want to win the trophy badly. He said as much at the start of the event. While acknowledging that there is unfinished business and he is desperate to an extent to hold that trophy aloft come November 19, Sharma insisted on finding a balance. Sharma also mentioned the one thing that India hasn’t had in World Cup knockouts — luck. “Obviously we have to leave a lot of things to Almighty as well because we need that little bit of luck in the tournament. I hope we get that luck. But yeah, it will be nice to win a World Cup,” he had said in Chennai before the game against Australia. Two games away from making that dream come true, Sharma reflected on the league stage, saying that it is all about breaking down into parts and moving forward. “Nine games is a lot of games, literally two or three bilateral series. With different games and different venues, you have to break it down into different styles and strategies as well. I think we did that well. In the first half, we chased the first five games, and next four, we batted first. In terms of areas we wanted to cover, we have covered almost every bit of it. We do understand the importance of this week but for us, I don’t think we need to do anything different from what we have been doing in this tournament. There will be challenges. You just got to respond, front up, and get through that situation,” Sharma said on Tuesday before adding, “Now the time has come, you need a little bit of luck to go your way. Obviously, we are going to be brave enough. Hopefully, fortune will favour the brave.” The demons of the semifinal have chased India at ICC events for far too long now. On Wednesday, India have a chance to bury the demons at a venue where they conquered the world 12 years ago. This current crop has the ability to reach the first global white ball final since 2017. Will they? Only time will tell.","pubDate":"2023-11-15 01:14:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"57da931ea922a5b8a3a475786d18711d","title":"Freddie Flintoff set for first job since quitting Top Gear after traumatic car crash","link":"https://www.dailystar.co.uk/sport/other-sports/freddie-flintoff-new-job-cricket-31440224","keywords":["Sport"],"creator":null,"video_url":null,"description":"England cricket legend Freddie Flintoff is on the verge of landing a new job, 11 months on from the traumatic car crash which very nearly killed him","content":"Andrew 'Freddie' Flintoff is on the verge of a cricketing comeback after recovering from the horror car crash which forced him to quit . The 45-year-old is expected to be named head coach of Leeds-based team Northern Superchargers, marking his first proper return to the sport since his playing career ended in 2015. Flintoff has been inching his way back into public life following the traumatic crash that nearly claimed his life, which happened while he was filming for Top Gear in December last year. In recent months he's been acting as an unofficial mentor for England's cricket teams, but looks set to return to the game in an official capacity following the departure of Superchargers head coach James Foster last week. The franchise, who play 100-ball, finished dead last in the 2023 season, with five defeats in eight matches. According to , negotiations between Flintoff and the Superchargers could be wrapped up by the end of the week. It's also understood that the former all-rounder will be joined by ex-Lancashire team-mate Kyle Hogg, who is in talks to become the team's new assistant coach. Flintoff spent four years as co-host of the BBC's flagship motoring show, Top Gear. He joined in 2018 alongside Paddy McGuinness and Chris Harris in time for the start of the 27th season. In 2019 he suffered his first major crash while riding a head-first trike at 124 mph during one of the car show's signature competitions. He escaped relatively unscathed, but wasn't so lucky when he crashed for a second time three years later. He was airlifted to hospital after suffering numerous injuries in an accident at Dunsfold Park Aerodrome while driving an open-topped, three-wheeled car at 130 mph. The vehicle flipped and slid along the track, leaving Flintoff with severe facial injuries and broken ribs. He spent several weeks in hospital, and his length recovery left him in a \"dark place\" according to his family. The BBC, who paid Flintoff a £9million settlement, cancelled the rest of the series and announced they'd be re-assessing the show's safety precautions. The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . Flintoff bore some of the scars from the crash after being pictured for the first time since the accident attending an England training session in September. He later described his recovery as \"the hardest time of my life\".","pubDate":"2023-11-14 22:53:03","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31440331.ece/ALTERNATES/s98/0_England-v-New-Zealand-2nd-Metro-Bank-ODI.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"633048f45445cab18a8e9baf531dbd23","title":"Papers: Juventus ready to offer Man Utd escape route for Sancho","link":"https://www.skysports.com/football/news/20876/13008499/juventus-ready-to-offer-manchester-united-outcast-jadon-sancho-old-trafford-escape-route-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Wednesday's newspapers...","content":"All the top stories and transfer rumours from Wednesday's newspapers... DAILY MAIL Juventus are ready to offer Jadon Sancho an escape route from Manchester United in the January transfer window. Harry Kane reportedly has a special clause in his Bayern Munich contract that could see him earn an extra windfall on top of his wages. Andrew Flintoff will take the biggest step yet in his return to cricket when he becomes coach of the Northern Superchargers in next summer's Hundred. A funeral for Sir Bobby Charlton was held in Ghana on the same day as the Manchester United and England icon was laid to rest at his ceremony in England. The Cricket World Cup has been plunged into an astonishing row amid claims the Indian board have switched the pitch for their team's semi-final on Wednesday against New Zealand in Mumbai without the ICC's permission. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! THE TIMES Football's lawmakers are to consider trials of sin-bins for dissent in professional competitions and adopting rugby's rule where only the captain can approach the referee, as part of a drive to tackle misbehaviour. Tom Curry is battling a hip injury that could keep him out of action until Christmas in the latest setback of a difficult year for the England flanker. Please use Chrome browser for a more accessible video player Rory McIlroy has warned that even a deal between the PGA Tour and Saudi Public Investment Fund might not lead to peace in golf's enduring power struggle. Spectators at the ATP Finals in Turin were left incensed on Tuesday when the sudden retirement of Stefanos Tsitsipas after only three games was followed by a replacement exhibition set featuring an injured Taylor Fritz. DAILY TELEGRAPH Andrew Flintoff is expected to take over as head coach of the men's Northern Superchargers team in the Hundred in a landmark moment following his recovery from a devastating car crash. Newcastle United's controversial winner against Arsenal was allowed to stand because the VAR did not have enough camera angles to show whether the ball went out of play, newly released audio has confirmed. Please use Chrome browser for a more accessible video player Emma Hayes will become the highest-paid female coach in world football after being appointed as the new head coach of the United States women's national team on a £1.28m-a-year [$1.6m] contract - three times more than England's head coach Sarina Wiegman. World Rugby has become the first sports governing body to take action against fans responsible for extreme online abuse of referees by passing dossiers of evidence to law-enforcement and government agencies. Rory McIlroy is planning on moving back to the UK on a permanent basis, reversing the trend of British superstars upping sticks to sunnier, not to mention more tax-efficient climes. THE SUN Please use Chrome browser for a more accessible video player Former Arsenal star Alex Song has announced his retirement from football. The 36-year-old has called time on his career that saw him make 49 appearances for the Cameroon national team. But he has hung up his boots at Djibouti Premier League side Arta Solar 7. US billionaire Leon Cooperman has invested in Manchester United in an unexpected twist in the takeover saga. Brighton have slapped a British-record price tag on Evan Ferguson following his contract extension. Chris Kirkland has revealed he took the \"equivalent of six shots of heroin a day\" during a battle with addiction. DAILY MIRROR Please use Chrome browser for a more accessible video player Harry Kane has given Liverpool transfer target Leroy Sane a glowing endorsement ahead of the January transfer window. Sane has been identified as the Reds' primary target amid uncertainty over the future of Mohamed Salah. Please use Chrome browser for a more accessible video player Manchester United are increasingly resigned to losing Andre Onana to the Africa Cup of Nations early next year. David de Gea - who has been without a club since departing Manchester United - has been seen visiting second-tier Spanish side Eldense. Victor Osimhen admits he has Chelsea and Manchester United shirts in his wardrobe amid continued links with the Premier League. DAILY EXPRESS Please use Chrome browser for a more accessible video player Arsenal star Thomas Partey's injury is reportedly worse than first feared in a major blow to Mikel Arteta. Partey's campaign has been disrupted by two separate injuries with a fresh issue likely to keep him out for a lengthy period. Manchester United bidder Sir Jim Ratcliffe is reportedly set to demand that Erik ten Hag reaches an olive branch out to outcast winger Jadon Sancho. The United forward has been exiled from the Red Devils first-team squad since September after a falling-out with Ten Hag. THE GUARDIAN Please use Chrome browser for a more accessible video player Erling Haaland has been tipped to become the first footballer to earn £1bn. The Manchester City star's agent, Rafaela Pimenta, has claimed that he could generate earnings outside of his typical contract. The betting giant Bet365 has admitted the footballer Steven Caulker was dropped from work as a pundit on a series it sponsored because of his public statements about gambling. DAILY RECORD Michael O'Neill is backing Ross McCausland to make a major Northern Ireland impact after forging his way firmly into Philippe Clement's Rangers plans. Hearts gave announced a record turnover of £20.8m in their latest set of accounts. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-14 22:37:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a2d6e06ec10863026f5c6e377e3115ec","title":"Williamson confident New Zealand can end India’s World Cup dreams again","link":"https://www.nation.com.pk/15-Nov-2023/williamson-confident-new-zealand-can-end-india-s-world-cup-dreams-again","keywords":["Sports"],"creator":["Agencies"],"video_url":null,"description":"MUMBAI - New Zealand will approach their blockbuster World Cup semi-final against India with a clean slate and confidence in their ability to upstage the in-form hosts in Mumbai, skipper Kane Williamson said on Tuesday.","content":"MUMBAI - New Zealand will approach their blockbuster World Cup semi-final against India with a clean slate and confidence in their ability to upstage the in-form hosts in Mumbai, skipper Kane Williamson said on Tuesday. The Black Caps began the tournament with four straight wins but suffered the first of four successive defeats against Rohit Sharma’s side amid a period of injury issues, before booking a place in Wednesday’s semi-final with a late push. Williamson, who returned from knee surgery for the World Cup and recovered from a frac­tured finger during it, missed the loss to India but is expect­ing a similarly tough test from the hosts who went unbeaten in the group stage. “We know it’s going to be a really tough chal­lenge. They’re a side that’s been playing extremely well, but we also know come finals time ev­erything starts again and it’s all about the day,” Williamson told reporters. “So for us as a team it’s very much the focus on our cricket again. We’ve played good crick­et throughout. We’ve had a cou­ple of narrow losses and a few wins along the way which have put us in this position we’re in. “We’re excited about the chal­lenge ahead.” New Zealand dashed India’s hopes in the semi-finals of the 2019 edition and Williamson said he was not concerned that his side were still considered underdogs. “I don’t think it has changed too much, but that’s fine and India have been excep­tional,” Williamson said. “One of the, if not the best team going around and playing cricket that matches that. But we know as well, on our day when we play our best cricket it certainly gives us the best chance. And come finals time anything can happen.” Top-order batsman Rachin Ravindra filled the void left by Williamson during their cam­paign and has been a revelation with 565 runs to earn praise from the skipper. “It’s not just the volume of runs that he’s achieved so far but how he’s been scoring them and how it’s been geared towards try­ing to move the team forward,” Williamson said. “Some fantas­tic contributions and at such a young age. I’m sure we’ll see plenty more of it to come.” Replying to a query about the crowd during the semifinal, Williamson said: “We’re expect­ing a fairly blue crowd that will be supporting their team. “We remember over the years, a number of different crowds that we’ve had that haven’t always been your own fans. “We have got a small country that doesn’t always fill out the stadiums, but you still appreci­ate the atmosphere it brings. “Not many people get that op­portunity, cricket in India, play­ing against India in a World Cup semifinal, is special and something to appreciate and look forward to.”","pubDate":"2023-11-14 22:25:18","image_url":"https://www.nation.com.pk/print_images/large/2023-11-15/williamson-confident-new-zealand-can-end-india-s-world-cup-dreams-again-1700000714-9784.jpg","source_id":"nation_pk","source_priority":353644,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"df53d0b5d85a61213328357ed20a178f","title":"Sixers bowler recalled to Aussie team","link":"https://www.news.com.au/sport/cricket/sixers-bowler-recalled-to-aussie-team/video/0341975991f0cd3691f44e377a656108","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Cricket: Sydney Sixers bowler Lauren Cheatle has been recalled to the Australia tour of India.","content":null,"pubDate":"2023-11-14 20:45:16","image_url":null,"source_id":"news","source_priority":5133,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"724c8f7c3cdfbe3d71b29626f507abc8","title":"Grim weather could threaten Aussie final hopes","link":"https://www.news.com.au/sport/cricket/grim-weather-could-threaten-aussie-final-hopes/video/c50ecd4036777714669361698bb95bed","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Cricket World Cup: A bleak outlook for Australia's semi final, and back up day, could impact Australia's progression to the World Cup final!","content":null,"pubDate":"2023-11-14 20:36:20","image_url":null,"source_id":"news","source_priority":5133,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"b057a8df7df9da0ad648f58a4c8b1fdd","title":"ODI World Cup: Kiwis gearing up for the big challenge","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/odi-world-cup-kiwis-gearing-up-for-the-big-challenge-2632880.html","keywords":null,"creator":null,"video_url":null,"description":"The first question fired: “Welcome to Mumbai just going back in history about the 29th of May 1953 about 70 years back…” and Williamson interrupts nonchalantly, MUMBAI: The press conference room at the Wankhede Stadium was packed on a hot and humid Tuesday afternoon. New Zealand captain Kane Williamson saunters in seemingly oblivious of the fact that two stern tests await him. First one of course is during the media interaction in the afternoon where he would be reminded of New Zealand's tales of near misses in ICC top events, and the next one will be on Wednesday when his team takes on India in the most important match of their lives. Photo: Shiba Prasad Sahu / Express Caption: New Zealand players practicing at the Wankhede Stadium in Mumbai ahead of the semi-final against India. The first question fired: “Welcome to Mumbai just going back in history about the 29th of May 1953 about 70 years back…” and Williamson interrupts nonchalantly, “Yeah, I remember that”, as the entire room erupts into laughter. When he walks on to the field on Thursday, it will be his fifth ICC World Cup semifinal across formats as captain. Yet, here was Williamson, less than 24 hours away from what is the most important match they have played so far, turning a serious question about scaling the highest peak in the world into some kind of a joke. And of course, New Zealand would be wary of the highest peak in cricket they are trying to climb. In fact, it pretty much sums up New Zealand’s campaign so far. They kicked off the tournament with four consecutive wins before being in a position where they almost missed out on the semifinals. They had a injury list when put together could be longer than the playing XI. From there on, they pulled back to enter their fifth consecutive ODI World Cup semifinal. The tags like ‘underdogs’ and ‘dark horses’ that are often linked with New Zealand in the lead up to global events usually seem out of place. Considering a country with a population that is a quarter of Mumbai and with just six premier domestic teams where cricket plays second fiddle to their national passion rugby, one must confess New Zealand have been among the most consistent teams at ICC events. In the last four years, they have played two white-ball World Cup finals, one semifinal and have won an ICC World Test Championship title. Ask Lockie Ferguson what makes them tick at World Cups, he doesn’t have a straight specific answer. “I’d love to know” he laughs. “When we start the competition, much like every other team we're here to win it, but of course we know there's a process and I think certainly within our team we've played a lot of cricket together for a long period of time, so we sort of stick to our processes and I know it sounds cliche, but I think it keeps us sort of level-headed and naturally as Kiwis we tend to stay where our feet are, which I think is a positive,” he adds. 'Tend to stay where our feet are' is what stands out. And this comes from one of the most colourful individuals who is filled with life and flair in the New Zealand dressing room. So, it comes as no surprise when Williamson plays down what has been an incredibly tough eight months for him personally. After the injury he suffered at the start of the Indian Premier League, it seemed like he was not going to make it the World Cup. But he did. And then, he is back on the field for his very first game of the tournament only to get hit by a throw and fracture his thumb. But New Zealand Cricket knows he will come back again and they know that the team will need him in the business end of the tournament. They kept him with the team, and he made a come back, again. Williamson calls it “an interesting journey” before expressing his gratitude to be in a position to lead the team in another semifinal. He did make sure that people knew the thumbs fracture was not funny even when he was explaining it with a laugh. “It was quite frustrating and testing but still feeling that it hadn't ruled me out so I still was grateful for that and it's nice to be fitter than perhaps I was yesterday and be sitting here,” he said. This unassuming personality, that takes a step back every time he faces a ball or sets the field during the game, is the essence and spirit of this Black Caps team. They would be the friendliest people when you talk to them, but you would not want to be on the other end off the 22 yards against them. Out there, they give it all. Weeks ago when they played India in Dharamsala, there were questions about the outfield and even India captain Rohit Sharma were gesturing players not to dive. New Zealand, however, were having a ball. They were throwing themselves around to stop the ball, and saved at least 20-30 runs, making it all the more harder for India. \"We’ve got standards within our Black Caps that you come and do everything you can to help us win games of cricket and part of that is diving on the boundary and stopping the ball when you get the chance and that's something we're proud of ourselves as Black Caps and we'll continue to do it no matter where we play in the world,\" Daryl Mitchell said. Expect nothing less when Williamson leads them on to the field in front of a sea of blue on Wednesday. They are going to push India’s limits, give everything they could and put on a spectacle. For that is what the Black Caps are. They will not go down without a fight.","content":"MUMBAI: The press conference room at the Wankhede Stadium was packed on a hot and humid Tuesday afternoon. New Zealand captain Kane Williamson saunters in seemingly oblivious of the fact that two stern tests await him. First one of course is during the media interaction in the afternoon where he would be reminded of New Zealand's tales of near misses in ICC top events, and the next one will be on Wednesday when his team takes on India in the most important match of their lives. The first question fired: “Welcome to Mumbai just going back in history about the 29th of May 1953 about 70 years back…” and Williamson interrupts nonchalantly, “Yeah, I remember that”, as the entire room erupts into laughter. When he walks on to the field on Thursday, it will be his fifth ICC World Cup semifinal across formats as captain. Yet, here was Williamson, less than 24 hours away from what is the most important match they have played so far, turning a serious question about scaling the highest peak in the world into some kind of a joke. And of course, New Zealand would be wary of the highest peak in cricket they are trying to climb. In fact, it pretty much sums up New Zealand’s campaign so far. They kicked off the tournament with four consecutive wins before being in a position where they almost missed out on the semifinals. They had a injury list when put together could be longer than the playing XI. From there on, they pulled back to enter their fifth consecutive ODI World Cup semifinal. The tags like ‘underdogs’ and ‘dark horses’ that are often linked with New Zealand in the lead up to global events usually seem out of place. Considering a country with a population that is a quarter of Mumbai and with just six premier domestic teams where cricket plays second fiddle to their national passion rugby, one must confess New Zealand have been among the most consistent teams at ICC events. In the last four years, they have played two white-ball World Cup finals, one semifinal and have won an ICC World Test Championship title. Ask Lockie Ferguson what makes them tick at World Cups, he doesn’t have a straight specific answer. “I’d love to know” he laughs. “When we start the competition, much like every other team we're here to win it, but of course we know there's a process and I think certainly within our team we've played a lot of cricket together for a long period of time, so we sort of stick to our processes and I know it sounds cliche, but I think it keeps us sort of level-headed and naturally as Kiwis we tend to stay where our feet are, which I think is a positive,” he adds. 'Tend to stay where our feet are' is what stands out. And this comes from one of the most colourful individuals who is filled with life and flair in the New Zealand dressing room. So, it comes as no surprise when Williamson plays down what has been an incredibly tough eight months for him personally. After the injury he suffered at the start of the Indian Premier League, it seemed like he was not going to make it the World Cup. But he did. And then, he is back on the field for his very first game of the tournament only to get hit by a throw and fracture his thumb. But New Zealand Cricket knows he will come back again and they know that the team will need him in the business end of the tournament. They kept him with the team, and he made a come back, again. Williamson calls it “an interesting journey” before expressing his gratitude to be in a position to lead the team in another semifinal. He did make sure that people knew the thumbs fracture was not funny even when he was explaining it with a laugh. “It was quite frustrating and testing but still feeling that it hadn't ruled me out so I still was grateful for that and it's nice to be fitter than perhaps I was yesterday and be sitting here,” he said. This unassuming personality, that takes a step back every time he faces a ball or sets the field during the game, is the essence and spirit of this Black Caps team. They would be the friendliest people when you talk to them, but you would not want to be on the other end off the 22 yards against them. Out there, they give it all. Weeks ago when they played India in Dharamsala, there were questions about the outfield and even India captain Rohit Sharma were gesturing players not to dive. New Zealand, however, were having a ball. They were throwing themselves around to stop the ball, and saved at least 20-30 runs, making it all the more harder for India. \"We’ve got standards within our Black Caps that you come and do everything you can to help us win games of cricket and part of that is diving on the boundary and stopping the ball when you get the chance and that's something we're proud of ourselves as Black Caps and we'll continue to do it no matter where we play in the world,\" Daryl Mitchell said. Expect nothing less when Williamson leads them on to the field in front of a sea of blue on Wednesday. They are going to push India’s limits, give everything they could and put on a spectacle. For that is what the Black Caps are. They will not go down without a fight.","pubDate":"2023-11-15 01:44:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"dd368f8ae4f7b7d1d1ced8b15e47dcf1","title":"Box office showdown: Sparks set to fly as Indian juggernaut faces tricky New Zealand in repeat of 2019 semifinal","link":"https://www.tribuneindia.com/news/sports/box-office-showdown-sparks-set-to-fly-as-indian-juggernaut-faces-tricky-new-zealand-in-repeat-of-2019-semifinal-562482","keywords":null,"creator":null,"video_url":null,"description":"Rohit Mahajan Mumbai, November 14 India have smashed every opponent over the past six weeks, but now comes the moment of truth — and moment of luck, too, says Rohit Sharma, the Indian captain. New Zealand's captain Kane Williamson warms up during practice. Reuters \"The time has come that you need a little bit of luck to go your way,\" said Rohit on the eve of their semifinal against New Zealand. \"Obviously, we're going to be brave enough. And hopefully, fortune favours the brave.\" The time has come that you need a little bit of luck to go your way. Obviously, we're going to be brave enough. And hopefully, fortune favours the brave. Rohit Sharma The underdog thing, from what you guys write, I do not think it has changed too much, but that is fine you know, and India have been exceptional. Kane Williamson Rohit's assertion of positivity seemed to reflect a mind coach's words; his comment about luck, the need for luck, however, reflected the underlying fear of the unknown that preys on the mind of a sportsperson. 85 India currently have the most wickets (85), best economy rate (4.5), best average (19.6) and best strike-rate (26.2) among all teams in the World Cup. 6.5 New Zealand have been effective at scoring runs quickly in this World Cup, having the joint-highest run rate (6.5) among all teams in the tournament. 5 In nine World Cup matches against each other, New Zealand have won five times, while India have won four times. In any game, there are uncontrollables that sportspersons are wary of; at the Wankhede, which side the coin lands on at the toss could be a decisive uncontrollable — teams batting first enjoy a massive advantage at this ground, right from the first game in 1987, when India batted first against Sri Lanka and piled up 299 in those days of relatively conservative batting. During this tournament, batting first, South Africa made 399/7 against England and 382/5 against Bangladesh and won with ease; India then smashed 357/8 against Sri Lanka and routed them by 302 runs; Afghanistan made 291/5 against Australia and lost — but that was only due to a freakish innings of 201 by Glenn Maxwell, and the inexperience of the Afghan bowlers. When the stadium was redeveloped before the 2011 World Cup, the ground became smaller, playing right into the hands of the batsmen. The dice is loaded in favour of the batsmen — in 12 ODIs played at the ground since the stadium's diminution, the team batting first has topped 300 four times, once exceeding 400. The clincher? The average first-innings total here since then is 308, the average for the second innings is 218 — a clear difference of 90 runs. If that doesn't make the toss — perhaps the 'luck' Rohit talked about — critical, nothing would. The mantra would be — bat first, pile up a huge score when the conditions favour the batters, then rock the opposition with movement in the air and off the pitch, as India did against Sri Lanka. What India did to Sri Lanka, New Zealand can do to India under the lights — they do have the resources in Trent Boult, the tall left-handed paceman who can make the ball angle across and then suddenly bend it back into the right-hander. Under the lights at the Wankhede, the ball has swung prodigiously — Boult could be quite a handful here, as he was in Manchester on July 9-10, 2019, when New Zealand beat India at the same stage of the World Cup. India have struck fear into the hearts of the opposition, especially their pace bowlers — and their spin bowlers, and their batsmen! The pace trio of Mohammed Shami, Jasprit Bumrah and Mohammed Siraj has taken 45 wickets; spin twins Ravindra Jadeja and Kuldeep Yadav have another 30; Virat Kohli, Rohit Sharma and Shreyas Iyer have accumulated 1,518 runs, average 72.28; KL Rahul and Shubman Gill have 347 and 270 runs, respectively. Really, it seems India have all their bases covered, as Rohit said. \"The first (part) of the tournament, we chased the first five games, then the next four games we batted first,\" said Rohit. \"So, in terms of the areas that we wanted to cover, I think we've covered almost every bit. We do understand the importance of this week, but I don't think we need to do anything different from what we've been doing in this tournament.\" Yes, but a bit of luck would be most welcome. Everybody wants a piece of Rachin Rachin Ravindra, 24 in four days, is a bald man's envy — he seems to have such a full head of hair as could be enough for three men. But he's also the envy of batsmen of all sorts, hairy or bald — the Wellington-born young man, son of migrants from India, has scored 565 runs in nine innings, average 70.62, with three hundreds and two 50s. Rachin Ravindra and Daryl Mitchell have been New Zealand's best batsmen in the tournament so far. REUTERS He's inspired myths, too, with the internet buzzing with the news that his name is a combination of the names of two legends, Rahul Dravid and Sachin Tendulkar. In fact, he himself seemed to have bought into this, having said: \"Back in the day when Mum and Dad were deciding the names, they both liked Rahul and Sachin, so \"Ra\" from Rahul and \"chin\" from Sachin, but that was a long time ago. We don't talk about it much anymore.\" That's a pleasing and plausible story, but his father now says the son got his facts wrong. He was named Rachin because it \"sounded good, was easy to spell, and short\", says the dad, Ravi Krishnamurthy, who obviously possesses accurate information. He added that Rachin wasn't named \"with the intention to make our child a cricketer\". But he's turned out to be quite a useful cricketer, as Kane Williamson acknowledged with his native effusiveness. \"Yeah, good player, right?\" Kane and Everest Kane Williamson is still cool. He was the losing captain in the 2019 World Cup final, and shrugged off the defeat that July 14 with remarkable stoicism, saying: \"Yeah, obviously, just gutted.\" Today, before the biggest game of the World Cup so far, Williamson put up a comedic performance, raising laughter loud and often. The first question to him started with: \"Kane, just going back in history a bit, 29th of May 1953, about 70 years backhellip;\" Williamson interrupted him: \"I remember, yeah!\" Williamson had been some 30 minutes late for the press conference. His tardiness was punished just as the first question was asked, as the sound failed. Williamson kept the restive reporters in good humour with wisecracks. There was another interruption — the public address system of the ground was being tested, and a male voice boomed through the room: \"Mic check, mic check, mic checkhellip;\" Williamson responded: \"The mic's working, the mic's working!\" The press conference stops, and when it was time to resume it, Williamson sought to know if all's well with: \"Mic check, mic check, mic check,\" mimicking the invisible voice that had caused the interruption. This is my property! Some cricket-lovers were spotted at the Marine Drive today. It was easy to spot them, for they were dressed in identical blue shirts and ICC World Cup caps. They're an excited lot, the few who seem excited about the cricket. They're discussing their exclusive properties, their \"licensed cricket digital collectibles\". The video worth $700. What are these? \"They are digitally signed properties, such as videos, which are released in limited numbers,\" says Vijay Kumar, an engineer from Bengaluru. He then displays a video of Virat Kohli that, he says, is valued at $700. But how can a video that can be watched by everyone on the internet be valued so much, one wonders. \"It's not just the video, one gets privileges if one possesses these properties,\" says Vijay. \"So, those who have certain properties can take part in contests where one can win a sizeable prize money. Today we met Shane Watson, who was in the commentary box, just because we have these collectibles!\" In impressive tones, the talks about a limited edition Sachin Tendulkar digital property — a digitally signed video — which he says is worth $25,000. \"Only five of these have been released so far!\" he says. All this sounds a bit fishy to those used to the idea of brick and mortar companies, but Vijay Kumar and his friends are sure they've got a good thing going. — Rohit Mahajan","content":"Tribune News Service Rohit Mahajan Mumbai, November 14 India have smashed every opponent over the past six weeks, but now comes the moment of truth — and moment of luck, too, says Rohit Sharma, the Indian captain. “The time has come that you need a little bit of luck to go your way,” said Rohit on the eve of their semifinal against New Zealand. “Obviously, we’re going to be brave enough. And hopefully, fortune favours the brave.” The time has come that you need a little bit of luck to go your way. Obviously, we’re going to be brave enough. And hopefully, fortune favours the brave. Rohit Sharma The underdog thing, from what you guys write, I do not think it has changed too much, but that is fine you know, and India have been exceptional. Kane Williamson Rohit’s assertion of positivity seemed to reflect a mind coach’s words; his comment about luck, the need for luck, however, reflected the underlying fear of the unknown that preys on the mind of a sportsperson. 85 India currently have the most wickets (85), best economy rate (4.5), best average (19.6) and best strike-rate (26.2) among all teams in the World Cup. 6.5 New Zealand have been effective at scoring runs quickly in this World Cup, having the joint-highest run rate (6.5) among all teams in the tournament. 5 In nine World Cup matches against each other, New Zealand have won five times, while India have won four times. In any game, there are uncontrollables that sportspersons are wary of; at the Wankhede, which side the coin lands on at the toss could be a decisive uncontrollable — teams batting first enjoy a massive advantage at this ground, right from the first game in 1987, when India batted first against Sri Lanka and piled up 299 in those days of relatively conservative batting. During this tournament, batting first, South Africa made 399/7 against England and 382/5 against Bangladesh and won with ease; India then smashed 357/8 against Sri Lanka and routed them by 302 runs; Afghanistan made 291/5 against Australia and lost — but that was only due to a freakish innings of 201 by Glenn Maxwell, and the inexperience of the Afghan bowlers. When the stadium was redeveloped before the 2011 World Cup, the ground became smaller, playing right into the hands of the batsmen. The dice is loaded in favour of the batsmen — in 12 ODIs played at the ground since the stadium’s diminution, the team batting first has topped 300 four times, once exceeding 400. The clincher? The average first-innings total here since then is 308, the average for the second innings is 218 — a clear difference of 90 runs. If that doesn’t make the toss — perhaps the ‘luck’ Rohit talked about — critical, nothing would. The mantra would be — bat first, pile up a huge score when the conditions favour the batters, then rock the opposition with movement in the air and off the pitch, as India did against Sri Lanka. What India did to Sri Lanka, New Zealand can do to India under the lights — they do have the resources in Trent Boult, the tall left-handed paceman who can make the ball angle across and then suddenly bend it back into the right-hander. Under the lights at the Wankhede, the ball has swung prodigiously — Boult could be quite a handful here, as he was in Manchester on July 9-10, 2019, when New Zealand beat India at the same stage of the World Cup. India have struck fear into the hearts of the opposition, especially their pace bowlers — and their spin bowlers, and their batsmen! The pace trio of Mohammed Shami, Jasprit Bumrah and Mohammed Siraj has taken 45 wickets; spin twins Ravindra Jadeja and Kuldeep Yadav have another 30; Virat Kohli, Rohit Sharma and Shreyas Iyer have accumulated 1,518 runs, average 72.28; KL Rahul and Shubman Gill have 347 and 270 runs, respectively. Really, it seems India have all their bases covered, as Rohit said. “The first (part) of the tournament, we chased the first five games, then the next four games we batted first,” said Rohit. “So, in terms of the areas that we wanted to cover, I think we’ve covered almost every bit. We do understand the importance of this week, but I don’t think we need to do anything different from what we’ve been doing in this tournament.” Yes, but a bit of luck would be most welcome. Everybody wants a piece of Rachin Rachin Ravindra, 24 in four days, is a bald man’s envy — he seems to have such a full head of hair as could be enough for three men. But he’s also the envy of batsmen of all sorts, hairy or bald — the Wellington-born young man, son of migrants from India, has scored 565 runs in nine innings, average 70.62, with three hundreds and two 50s. He’s inspired myths, too, with the internet buzzing with the news that his name is a combination of the names of two legends, Rahul Dravid and Sachin Tendulkar. In fact, he himself seemed to have bought into this, having said: “Back in the day when Mum and Dad were deciding the names, they both liked Rahul and Sachin, so “Ra” from Rahul and “chin” from Sachin, but that was a long time ago. We don’t talk about it much anymore.” That’s a pleasing and plausible story, but his father now says the son got his facts wrong. He was named Rachin because it “sounded good, was easy to spell, and short”, says the dad, Ravi Krishnamurthy, who obviously possesses accurate information. He added that Rachin wasn’t named “with the intention to make our child a cricketer”. But he’s turned out to be quite a useful cricketer, as Kane Williamson acknowledged with his native effusiveness. “Yeah, good player, right?” Kane and Everest Kane Williamson is still cool. He was the losing captain in the 2019 World Cup final, and shrugged off the defeat that July 14 with remarkable stoicism, saying: “Yeah, obviously, just gutted.” Today, before the biggest game of the World Cup so far, Williamson put up a comedic performance, raising laughter loud and often. The first question to him started with: “Kane, just going back in history a bit, 29th of May 1953, about 70 years back…” Williamson interrupted him: “I remember, yeah!” Williamson had been some 30 minutes late for the press conference. His tardiness was punished just as the first question was asked, as the sound failed. Williamson kept the restive reporters in good humour with wisecracks. There was another interruption — the public address system of the ground was being tested, and a male voice boomed through the room: “Mic check, mic check, mic check…” Williamson responded: “The mic’s working, the mic’s working!” The press conference stops, and when it was time to resume it, Williamson sought to know if all’s well with: “Mic check, mic check, mic check,” mimicking the invisible voice that had caused the interruption. This is my property! Some cricket-lovers were spotted at the Marine Drive today. It was easy to spot them, for they were dressed in identical blue shirts and ICC World Cup caps. They’re an excited lot, the few who seem excited about the cricket. They’re discussing their exclusive properties, their “licensed cricket digital collectibles”. What are these? “They are digitally signed properties, such as videos, which are released in limited numbers,” says Vijay Kumar, an engineer from Bengaluru. He then displays a video of Virat Kohli that, he says, is valued at $700. But how can a video that can be watched by everyone on the internet be valued so much, one wonders. “It’s not just the video, one gets privileges if one possesses these properties,” says Vijay. “So, those who have certain properties can take part in contests where one can win a sizeable prize money. Today we met Shane Watson, who was in the commentary box, just because we have these collectibles!” In impressive tones, the talks about a limited edition Sachin Tendulkar digital property — a digitally signed video — which he says is worth $25,000. “Only five of these have been released so far!” he says. All this sounds a bit fishy to those used to the idea of brick and mortar companies, but Vijay Kumar and his friends are sure they’ve got a good thing going. — Rohit Mahajan #Mumbai #New Zealand #Rohit Sharma","pubDate":"2023-11-15 01:41:31","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/11/2023_11$largeimg_1744845718.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4709853e97a7d131d27112a85165235e","title":"World Cup: Fascinating contest on the cards between equals","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/world-cup-fascinating-conteston-the-cards-between-equals-2632887.html","keywords":null,"creator":null,"video_url":null,"description":"Australia and South Africa, two teams familiar to each other at the World Cup stage, meet in second semifinal at Eden Gardens in Kolkata KOLKATA: The Eden Gardens in Kolkata is all decked up for the second semifinal between heavyweights Australia and South Africa. But if one compares the buzz with that of India's league match against the latter at the venue on November 5, the enthusiasm and craze seem to be missing. The roads surrounding the stadium were sparsely occupied on Tuesday with only a few trying to get their hands on the tickets. In fact, almost all of them were successful even with only two days to go for the match. It was the complete opposite when the Men in Blue landed in the City of Joy less than a fortnight ago with the cops resorting to lathi charge to disburse the agitated crowd as they failed to procure the tickets. With Virat Kohli's birthday falling on the match day, the scene became even more chaotic as fans celebrated his birthday on roads, which already were chock-a-block with ticket seekers. Intensity off the field might be missing but the same could not be said inside the venue. Both teams had long training sessions both on Monday and Tuesday and are scheduled to have another one on Wednesday before the clash. Given the history they share, especially in the World Cup, the contest is expected to be loaded with action. Be it the Super Six encounter at the 1999 edition wherein skipper Steve Waugh came up with a gritty unbeaten century to see his team home or the second semifinal only four days apart that ended in a tie with the eventual champions progressing by virtue of their win in the previous match. Australia had it easy eight years later as they won both the league match and second semifinal but South Africa registered a close 10-run victory when they met next in 2019. They extended that run this edition as well when they humbled the five-time champions by 134 runs last month in a league match. Overall, both the sides have played seven matches in the showpiece event since South Africa's return to international cricket in 1992. All those contests have been even-stevens affairs with each side winning three each, with one ending in a tie. Temba Bavuma and Co, however, can take confidence from the fact that the Australians have never defeated them in an ODI in India. Since 1996, when they played three ODIs in the Titan Cup, the Proteas had emerged winners each time, pocketing all the four matches. Come Thursday, the past records have no bearing as a lot will be on stake for both the teams. For South Africa, this will be a chance to break the semifinal hoodoo and march a step closer to holding the coveted trophy. Australia, in turn, will be eager to add yet another silverware to their already full cabinet. Rain threat There is a threat of rain in Kolkata with the Indian Meteorological Department (IMD) predicting formation of a low pressure area over Southeast Bay of Bengal and adjoining Andaman-Nicobar Islands. As per the IMD, it is likely to move west-northwestwards and intensify into a depression over West Central Bay of Bengal on Wednesday. \"Thereafter, it would move northwestwards and may intensify into a deep depression over West Central Bay of Bengal off Andhra Pradesh coast on Thursday. Subsequently, it would recurve north-northeast wards and reach Northwest Bay of Bengal off Odisha coast on Friday,\" the IMD said. The city may see rain from this system on both days, including Friday, reserve day. Snehasish Ganguly, Cricket Association of Bengal (CAB) president, believes they are ready to tackle the situation. \"We can cover the entire ground in no time. The drainage system here is world class. So in that sense we are absolutely ready to host the match,\" the CAB president told this daily. Notably, the association bought covers from the United Kingdom before the 2016 T20 World Cup. \"The covers are divided into four quarters and are lightweight, so they can be easily pulled from corners at each quarter of the ground in no time. Besides, we have three super soppers in case we need to dry the outfield,\" Arindam Basu, venue media manager, told this daily.","content":"KOLKATA: The Eden Gardens in Kolkata is all decked up for the second semifinal between heavyweights Australia and South Africa. But if one compares the buzz with that of India's league match against the latter at the venue on November 5, the enthusiasm and craze seem to be missing. The roads surrounding the stadium were sparsely occupied on Tuesday with only a few trying to get their hands on the tickets. In fact, almost all of them were successful even with only two days to go for the match. It was the complete opposite when the Men in Blue landed in the City of Joy less than a fortnight ago with the cops resorting to lathi charge to disburse the agitated crowd as they failed to procure the tickets. With Virat Kohli's birthday falling on the match day, the scene became even more chaotic as fans celebrated his birthday on roads, which already were chock-a-block with ticket seekers. Intensity off the field might be missing but the same could not be said inside the venue. Both teams had long training sessions both on Monday and Tuesday and are scheduled to have another one on Wednesday before the clash. Given the history they share, especially in the World Cup, the contest is expected to be loaded with action. Be it the Super Six encounter at the 1999 edition wherein skipper Steve Waugh came up with a gritty unbeaten century to see his team home or the second semifinal only four days apart that ended in a tie with the eventual champions progressing by virtue of their win in the previous match. Australia had it easy eight years later as they won both the league match and second semifinal but South Africa registered a close 10-run victory when they met next in 2019. They extended that run this edition as well when they humbled the five-time champions by 134 runs last month in a league match. Overall, both the sides have played seven matches in the showpiece event since South Africa's return to international cricket in 1992. All those contests have been even-stevens affairs with each side winning three each, with one ending in a tie. Temba Bavuma and Co, however, can take confidence from the fact that the Australians have never defeated them in an ODI in India. Since 1996, when they played three ODIs in the Titan Cup, the Proteas had emerged winners each time, pocketing all the four matches. Come Thursday, the past records have no bearing as a lot will be on stake for both the teams. For South Africa, this will be a chance to break the semifinal hoodoo and march a step closer to holding the coveted trophy. Australia, in turn, will be eager to add yet another silverware to their already full cabinet. There is a threat of rain in Kolkata with the Indian Meteorological Department (IMD) predicting formation of a low pressure area over Southeast Bay of Bengal and adjoining Andaman-Nicobar Islands. As per the IMD, it is likely to move west-northwestwards and intensify into a depression over West Central Bay of Bengal on Wednesday. \"Thereafter, it would move northwestwards and may intensify into a deep depression over West Central Bay of Bengal off Andhra Pradesh coast on Thursday. Subsequently, it would recurve north-northeast wards and reach Northwest Bay of Bengal off Odisha coast on Friday,\" the IMD said. The city may see rain from this system on both days, including Friday, reserve day. Snehasish Ganguly, Cricket Association of Bengal (CAB) president, believes they are ready to tackle the situation. \"We can cover the entire ground in no time. The drainage system here is world class. So in that sense we are absolutely ready to host the match,\" the CAB president told this daily. Notably, the association bought covers from the United Kingdom before the 2016 T20 World Cup. \"The covers are divided into four quarters and are lightweight, so they can be easily pulled from corners at each quarter of the ground in no time. Besides, we have three super soppers in case we need to dry the outfield,\" Arindam Basu, venue media manager, told this daily.","pubDate":"2023-11-15 01:27:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"b364ba95b2e1daa7362690359f433d95","title":"Need more U19 and Emerging tours, a domestic red-ball tournament for Indian women: ICC Hall of Famer Diana Edulji","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/need-more-u19-and-emerging-tours-a-domestic-red-ball-tournament-for-indian-women-icc-hall-of-famer-2632889.html","keywords":null,"creator":null,"video_url":null,"description":"Edulji played 20 Tests and 34 ODIs in her career and took 107 wickets across formats. MUMBAI: Former India captain and ICC Hall of Famer Diana Edulji believes that having more U19 and Emerging team tours along with bringing back the domestic red-ball tournament are the way to go forward for women's cricket in India. Edulji, one of the pioneers of women's cricket in India, was inducted into the ICC Hall of Fame earlier this week. And with this, she became the first Indian women cricketer to be given the honour, recognising her contribution to the sport and 17-year-long international career. \"It's a big, big honor for me. I think it is the right time because the World Cup is in India and a woman cricketer from India is being recognized,\" Edulji told this daily during an ICC event ahead of the first semifinal of the 2023 ICC Men's ODI World Cup in Mumbai on Tuesday. Edulji played 20 Tests and 34 ODIs in her career and took 107 wickets across formats. She also led her country in four Tests and 18 ODIs, including in the 1993 Women's World Cup in England. Long after her retirement from international cricket, she served as one of the members of the Supreme Court-appointed Committee of Administrators (CoA) to oversee the running of the BCCI from 2017 to 2019. During the interaction, she credited ICC and BCCI for the work they have put in for women's cricket saying, \"The ICC is doing a lot to promote women's cricket, and BCCI itself is doing a lot and I think together women's cricket now can go forward.\" The year 2023 has been good for women's cricket, especially India. They won the U19 T20 World Cup, reached the semifinal of the senior event, the inaugural season of the Women's Premier League saw viewership reach new heights and the senior team won the gold medal in the Asian Games. When asked how could they take the momentum forward, the 67-year-old said that playing continuous cricket is the way. \"Whether it's domestic, whether it's international, the players can't be playing a lot of cricket in one month and then spend another three months at home. Now there has to be a proper structure. I'm very happy that BCCI has agreed to play Test matches. That is the right step. If you want cricket to improve, you have to learn to play the longer version, then you can play all the versions. You have to get that temperament to stay at the wicket,\" she said referring to India women's two home Tests against England and Australia in December. While India women are getting ready to play their first home Test game in nine years, they do not have a domestic red-ball event at the moment. In the past, there used to be a Senior Women's Cricket Inter Zonal Three-Day tournament, but the competition was discontinued after the 2017-18 season. Edulji believes that there has to be a first-class tournament for the women at the domestic level. \"Definitely domestic cricket has to have one longer version tournament,\" she said. Praising the up-and-coming generation of cricketers who won the U19 T20 World Cup earlier this year, Edulji said that they need to push and make their case, putting pressure on the senior players. \"I'm really surprised that they still haven't yet made it into the senior team. I think they need to put pressure, which will help the seniors also play that there is someone behind now,\" she said. With the next Women's ODI World Cup set to be played in India in 2025, Edulji said there has to be a lot of Women's U19 and Emerging tours like the men do over the next two years. \"That's how we can build bench strength. You need a lot of tours, but it's not necessary that you have to play the big country, you can play the smaller countries with the Under-19, and then it is possible that you can build and have a very strong team and win the World Cup,\" Edulji signed off.","content":"MUMBAI: Former India captain and ICC Hall of Famer Diana Edulji believes that having more U19 and Emerging team tours along with bringing back the domestic red-ball tournament are the way to go forward for women's cricket in India. Edulji, one of the pioneers of women's cricket in India, was inducted into the ICC Hall of Fame earlier this week. And with this, she became the first Indian women cricketer to be given the honour, recognising her contribution to the sport and 17-year-long international career. \"It's a big, big honor for me. I think it is the right time because the World Cup is in India and a woman cricketer from India is being recognized,\" Edulji told this daily during an ICC event ahead of the first semifinal of the 2023 ICC Men's ODI World Cup in Mumbai on Tuesday. Edulji played 20 Tests and 34 ODIs in her career and took 107 wickets across formats. She also led her country in four Tests and 18 ODIs, including in the 1993 Women's World Cup in England. Long after her retirement from international cricket, she served as one of the members of the Supreme Court-appointed Committee of Administrators (CoA) to oversee the running of the BCCI from 2017 to 2019. During the interaction, she credited ICC and BCCI for the work they have put in for women's cricket saying, \"The ICC is doing a lot to promote women's cricket, and BCCI itself is doing a lot and I think together women's cricket now can go forward.\" The year 2023 has been good for women's cricket, especially India. They won the U19 T20 World Cup, reached the semifinal of the senior event, the inaugural season of the Women's Premier League saw viewership reach new heights and the senior team won the gold medal in the Asian Games. When asked how could they take the momentum forward, the 67-year-old said that playing continuous cricket is the way. \"Whether it's domestic, whether it's international, the players can't be playing a lot of cricket in one month and then spend another three months at home. Now there has to be a proper structure. I'm very happy that BCCI has agreed to play Test matches. That is the right step. If you want cricket to improve, you have to learn to play the longer version, then you can play all the versions. You have to get that temperament to stay at the wicket,\" she said referring to India women's two home Tests against England and Australia in December. While India women are getting ready to play their first home Test game in nine years, they do not have a domestic red-ball event at the moment. In the past, there used to be a Senior Women's Cricket Inter Zonal Three-Day tournament, but the competition was discontinued after the 2017-18 season. Edulji believes that there has to be a first-class tournament for the women at the domestic level. \"Definitely domestic cricket has to have one longer version tournament,\" she said. Praising the up-and-coming generation of cricketers who won the U19 T20 World Cup earlier this year, Edulji said that they need to push and make their case, putting pressure on the senior players. \"I'm really surprised that they still haven't yet made it into the senior team. I think they need to put pressure, which will help the seniors also play that there is someone behind now,\" she said. With the next Women's ODI World Cup set to be played in India in 2025, Edulji said there has to be a lot of Women's U19 and Emerging tours like the men do over the next two years. \"That's how we can build bench strength. You need a lot of tours, but it's not necessary that you have to play the big country, you can play the smaller countries with the Under-19, and then it is possible that you can build and have a very strong team and win the World Cup,\" Edulji signed off.","pubDate":"2023-11-15 01:21:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"9d38cd4911d9459f6e7f644f5a751709","title":"With new zeal, India look to bury demons of past","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/with-new-zeal-india-look-to-bury-demons-of-past-2632981.html","keywords":null,"creator":null,"video_url":null,"description":"On Tuesday, it seemed different. The buzz and excitement in the sea breeze are palpable despite the inherent pollution you can feel. MUMBAI: The streets of Colaba are abuzz. They are filled with people, and tourists all through the day so much so that if you stand at any point in the street, the crowd will take you forward all by itself. In fact, it is what a regular day in the commercial capital of India looks like. On Tuesday, it seemed different. The buzz and excitement in the sea breeze are palpable despite the inherent pollution you can feel. In Colaba, everywhere you turn, you can see vendors selling India’s replica jerseys. Pick one and the vendor would say it’s `950 bucks, before convincing you to buy the one he has for `550. The hotels are being swarmed by fans who have travelled to watch the game. At the Wankhede Stadium, final preparations are underway as the iconic venue is set to host what is probably the most significant cricket game they have hosted since April 2, 2011. India vs New Zealand. Semifinal. 2023 ICC Men’s ODI World Cup. This movie has been screened before. In Old Trafford four years ago against the same team. In Sydney, against Australia eight years ago. The Men in Blue would dominate the tournament up until the semifinal only to fall short there. It’s a movie that has given heartbreaks to a billion people year after year in every ICC event in the last decade. This time, however, it seems different. One can feel the hope in the air. This Rohit Sharma-led Indian team has been unstoppable. They have the best batters of the tournament, including Sharma and Virat Kohli. Five among their top seven batters average well over 50 with three striking above run-a-ball. All five — Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja — have taken more than ten wickets (three of them average less than 20), taking turns to win the Player of the Match awards. As a group, they have made a mockery of the term ‘contest’ outplaying every opponent, except one team. New Zealand. The Black Caps are the only team that got in their faces and made them work. Even though India beat them in the league stages, it did not come easy. That is why, the semifinal against New Zealand at Mumbai is poetic in more than one way. For starters, it is the team that has been India’s nemesis in world meets for a while — 2016 World T20 league game, 2019 WC semifinal, and 2021 World Test Championship final, 2021 World T20 league game. And it’s a team that has the resources to test this Indian team at this venue. The shorter boundaries and conditions will help New Zealand take on Indian spinners and they also have the seam attack to trouble the Indian top-order. The trophy drought of this Indian team is vastly talked and discussed about. India have not won an ICC trophy in ten years. In this decade, India entered two T20 WC semifinals, two ODI World Cup semifinals, a Champions Trophy, and two WTC finals. For a team that began its transition in the same year as they won their last ICC title, it is not all that bad. But lack of a trophy for the sports’ only financial behemoth is jarring. Not a champion unless you become one of the world. The players know it too. That could be why some of them, including Sharma, probably playing their last World Cup want to win the trophy badly. He said as much at the start of the event. While acknowledging that there is unfinished business and he is desperate to an extent to hold that trophy aloft come November 19, Sharma insisted on finding a balance. Sharma also mentioned the one thing that India hasn’t had in World Cup knockouts — luck. “Obviously we have to leave a lot of things to Almighty as well because we need that little bit of luck in the tournament. I hope we get that luck. But yeah, it will be nice to win a World Cup,” he had said in Chennai before the game against Australia. Two games away from making that dream come true, Sharma reflected on the league stage, saying that it is all about breaking down into parts and moving forward. “Nine games is a lot of games, literally two or three bilateral series. With different games and different venues, you have to break it down into different styles and strategies as well. I think we did that well. In the first half, we chased the first five games, and next four, we batted first. In terms of areas we wanted to cover, we have covered almost every bit of it. We do understand the importance of this week but for us, I don’t think we need to do anything different from what we have been doing in this tournament. There will be challenges. You just got to respond, front up, and get through that situation,” Sharma said on Tuesday before adding, “Now the time has come, you need a little bit of luck to go your way. Obviously, we are going to be brave enough. Hopefully, fortune will favour the brave.” The demons of the semifinal have chased India at ICC events for far too long now. On Wednesday, India have a chance to bury the demons at a venue where they conquered the world 12 years ago. This current crop has the ability to reach the first global white ball final since 2017. Will they? Only time will tell.","content":"MUMBAI: The streets of Colaba are abuzz. They are filled with people, and tourists all through the day so much so that if you stand at any point in the street, the crowd will take you forward all by itself. In fact, it is what a regular day in the commercial capital of India looks like. On Tuesday, it seemed different. The buzz and excitement in the sea breeze are palpable despite the inherent pollution you can feel. In Colaba, everywhere you turn, you can see vendors selling India’s replica jerseys. Pick one and the vendor would say it’s `950 bucks, before convincing you to buy the one he has for `550. The hotels are being swarmed by fans who have travelled to watch the game. At the Wankhede Stadium, final preparations are underway as the iconic venue is set to host what is probably the most significant cricket game they have hosted since April 2, 2011. India vs New Zealand. Semifinal. 2023 ICC Men’s ODI World Cup. This movie has been screened before. In Old Trafford four years ago against the same team. In Sydney, against Australia eight years ago. The Men in Blue would dominate the tournament up until the semifinal only to fall short there. It’s a movie that has given heartbreaks to a billion people year after year in every ICC event in the last decade. This time, however, it seems different. One can feel the hope in the air. This Rohit Sharma-led Indian team has been unstoppable. They have the best batters of the tournament, including Sharma and Virat Kohli. Five among their top seven batters average well over 50 with three striking above run-a-ball. All five — Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja — have taken more than ten wickets (three of them average less than 20), taking turns to win the Player of the Match awards. As a group, they have made a mockery of the term ‘contest’ outplaying every opponent, except one team. New Zealand. The Black Caps are the only team that got in their faces and made them work. Even though India beat them in the league stages, it did not come easy. That is why, the semifinal against New Zealand at Mumbai is poetic in more than one way. For starters, it is the team that has been India’s nemesis in world meets for a while — 2016 World T20 league game, 2019 WC semifinal, and 2021 World Test Championship final, 2021 World T20 league game. And it’s a team that has the resources to test this Indian team at this venue. The shorter boundaries and conditions will help New Zealand take on Indian spinners and they also have the seam attack to trouble the Indian top-order. The trophy drought of this Indian team is vastly talked and discussed about. India have not won an ICC trophy in ten years. In this decade, India entered two T20 WC semifinals, two ODI World Cup semifinals, a Champions Trophy, and two WTC finals. For a team that began its transition in the same year as they won their last ICC title, it is not all that bad. But lack of a trophy for the sports’ only financial behemoth is jarring. Not a champion unless you become one of the world. The players know it too. That could be why some of them, including Sharma, probably playing their last World Cup want to win the trophy badly. He said as much at the start of the event. While acknowledging that there is unfinished business and he is desperate to an extent to hold that trophy aloft come November 19, Sharma insisted on finding a balance. Sharma also mentioned the one thing that India hasn’t had in World Cup knockouts — luck. “Obviously we have to leave a lot of things to Almighty as well because we need that little bit of luck in the tournament. I hope we get that luck. But yeah, it will be nice to win a World Cup,” he had said in Chennai before the game against Australia. Two games away from making that dream come true, Sharma reflected on the league stage, saying that it is all about breaking down into parts and moving forward. “Nine games is a lot of games, literally two or three bilateral series. With different games and different venues, you have to break it down into different styles and strategies as well. I think we did that well. In the first half, we chased the first five games, and next four, we batted first. In terms of areas we wanted to cover, we have covered almost every bit of it. We do understand the importance of this week but for us, I don’t think we need to do anything different from what we have been doing in this tournament. There will be challenges. You just got to respond, front up, and get through that situation,” Sharma said on Tuesday before adding, “Now the time has come, you need a little bit of luck to go your way. Obviously, we are going to be brave enough. Hopefully, fortune will favour the brave.” The demons of the semifinal have chased India at ICC events for far too long now. On Wednesday, India have a chance to bury the demons at a venue where they conquered the world 12 years ago. This current crop has the ability to reach the first global white ball final since 2017. Will they? Only time will tell.","pubDate":"2023-11-15 01:14:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"57da931ea922a5b8a3a475786d18711d","title":"Freddie Flintoff set for first job since quitting Top Gear after traumatic car crash","link":"https://www.dailystar.co.uk/sport/other-sports/freddie-flintoff-new-job-cricket-31440224","keywords":["Sport"],"creator":null,"video_url":null,"description":"England cricket legend Freddie Flintoff is on the verge of landing a new job, 11 months on from the traumatic car crash which very nearly killed him","content":"Andrew 'Freddie' Flintoff is on the verge of a cricketing comeback after recovering from the horror car crash which forced him to quit . The 45-year-old is expected to be named head coach of Leeds-based team Northern Superchargers, marking his first proper return to the sport since his playing career ended in 2015. Flintoff has been inching his way back into public life following the traumatic crash that nearly claimed his life, which happened while he was filming for Top Gear in December last year. In recent months he's been acting as an unofficial mentor for England's cricket teams, but looks set to return to the game in an official capacity following the departure of Superchargers head coach James Foster last week. The franchise, who play 100-ball, finished dead last in the 2023 season, with five defeats in eight matches. According to , negotiations between Flintoff and the Superchargers could be wrapped up by the end of the week. It's also understood that the former all-rounder will be joined by ex-Lancashire team-mate Kyle Hogg, who is in talks to become the team's new assistant coach. Flintoff spent four years as co-host of the BBC's flagship motoring show, Top Gear. He joined in 2018 alongside Paddy McGuinness and Chris Harris in time for the start of the 27th season. In 2019 he suffered his first major crash while riding a head-first trike at 124 mph during one of the car show's signature competitions. He escaped relatively unscathed, but wasn't so lucky when he crashed for a second time three years later. He was airlifted to hospital after suffering numerous injuries in an accident at Dunsfold Park Aerodrome while driving an open-topped, three-wheeled car at 130 mph. The vehicle flipped and slid along the track, leaving Flintoff with severe facial injuries and broken ribs. He spent several weeks in hospital, and his length recovery left him in a \"dark place\" according to his family. The BBC, who paid Flintoff a £9million settlement, cancelled the rest of the series and announced they'd be re-assessing the show's safety precautions. The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . Flintoff bore some of the scars from the crash after being pictured for the first time since the accident attending an England training session in September. He later described his recovery as \"the hardest time of my life\".","pubDate":"2023-11-14 22:53:03","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31440331.ece/ALTERNATES/s98/0_England-v-New-Zealand-2nd-Metro-Bank-ODI.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"633048f45445cab18a8e9baf531dbd23","title":"Papers: Juventus ready to offer Man Utd escape route for Sancho","link":"https://www.skysports.com/football/news/20876/13008499/juventus-ready-to-offer-manchester-united-outcast-jadon-sancho-old-trafford-escape-route-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Wednesday's newspapers...","content":"All the top stories and transfer rumours from Wednesday's newspapers... DAILY MAIL Juventus are ready to offer Jadon Sancho an escape route from Manchester United in the January transfer window. Harry Kane reportedly has a special clause in his Bayern Munich contract that could see him earn an extra windfall on top of his wages. Andrew Flintoff will take the biggest step yet in his return to cricket when he becomes coach of the Northern Superchargers in next summer's Hundred. A funeral for Sir Bobby Charlton was held in Ghana on the same day as the Manchester United and England icon was laid to rest at his ceremony in England. The Cricket World Cup has been plunged into an astonishing row amid claims the Indian board have switched the pitch for their team's semi-final on Wednesday against New Zealand in Mumbai without the ICC's permission. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! THE TIMES Football's lawmakers are to consider trials of sin-bins for dissent in professional competitions and adopting rugby's rule where only the captain can approach the referee, as part of a drive to tackle misbehaviour. Tom Curry is battling a hip injury that could keep him out of action until Christmas in the latest setback of a difficult year for the England flanker. Please use Chrome browser for a more accessible video player Rory McIlroy has warned that even a deal between the PGA Tour and Saudi Public Investment Fund might not lead to peace in golf's enduring power struggle. Spectators at the ATP Finals in Turin were left incensed on Tuesday when the sudden retirement of Stefanos Tsitsipas after only three games was followed by a replacement exhibition set featuring an injured Taylor Fritz. DAILY TELEGRAPH Andrew Flintoff is expected to take over as head coach of the men's Northern Superchargers team in the Hundred in a landmark moment following his recovery from a devastating car crash. Newcastle United's controversial winner against Arsenal was allowed to stand because the VAR did not have enough camera angles to show whether the ball went out of play, newly released audio has confirmed. Please use Chrome browser for a more accessible video player Emma Hayes will become the highest-paid female coach in world football after being appointed as the new head coach of the United States women's national team on a £1.28m-a-year [$1.6m] contract - three times more than England's head coach Sarina Wiegman. World Rugby has become the first sports governing body to take action against fans responsible for extreme online abuse of referees by passing dossiers of evidence to law-enforcement and government agencies. Rory McIlroy is planning on moving back to the UK on a permanent basis, reversing the trend of British superstars upping sticks to sunnier, not to mention more tax-efficient climes. THE SUN Please use Chrome browser for a more accessible video player Former Arsenal star Alex Song has announced his retirement from football. The 36-year-old has called time on his career that saw him make 49 appearances for the Cameroon national team. But he has hung up his boots at Djibouti Premier League side Arta Solar 7. US billionaire Leon Cooperman has invested in Manchester United in an unexpected twist in the takeover saga. Brighton have slapped a British-record price tag on Evan Ferguson following his contract extension. Chris Kirkland has revealed he took the \"equivalent of six shots of heroin a day\" during a battle with addiction. DAILY MIRROR Please use Chrome browser for a more accessible video player Harry Kane has given Liverpool transfer target Leroy Sane a glowing endorsement ahead of the January transfer window. Sane has been identified as the Reds' primary target amid uncertainty over the future of Mohamed Salah. Please use Chrome browser for a more accessible video player Manchester United are increasingly resigned to losing Andre Onana to the Africa Cup of Nations early next year. David de Gea - who has been without a club since departing Manchester United - has been seen visiting second-tier Spanish side Eldense. Victor Osimhen admits he has Chelsea and Manchester United shirts in his wardrobe amid continued links with the Premier League. DAILY EXPRESS Please use Chrome browser for a more accessible video player Arsenal star Thomas Partey's injury is reportedly worse than first feared in a major blow to Mikel Arteta. Partey's campaign has been disrupted by two separate injuries with a fresh issue likely to keep him out for a lengthy period. Manchester United bidder Sir Jim Ratcliffe is reportedly set to demand that Erik ten Hag reaches an olive branch out to outcast winger Jadon Sancho. The United forward has been exiled from the Red Devils first-team squad since September after a falling-out with Ten Hag. THE GUARDIAN Please use Chrome browser for a more accessible video player Erling Haaland has been tipped to become the first footballer to earn £1bn. The Manchester City star's agent, Rafaela Pimenta, has claimed that he could generate earnings outside of his typical contract. The betting giant Bet365 has admitted the footballer Steven Caulker was dropped from work as a pundit on a series it sponsored because of his public statements about gambling. DAILY RECORD Michael O'Neill is backing Ross McCausland to make a major Northern Ireland impact after forging his way firmly into Philippe Clement's Rangers plans. Hearts gave announced a record turnover of £20.8m in their latest set of accounts. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-14 22:37:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a2d6e06ec10863026f5c6e377e3115ec","title":"Williamson confident New Zealand can end India’s World Cup dreams again","link":"https://www.nation.com.pk/15-Nov-2023/williamson-confident-new-zealand-can-end-india-s-world-cup-dreams-again","keywords":["Sports"],"creator":["Agencies"],"video_url":null,"description":"MUMBAI - New Zealand will approach their blockbuster World Cup semi-final against India with a clean slate and confidence in their ability to upstage the in-form hosts in Mumbai, skipper Kane Williamson said on Tuesday.","content":"MUMBAI - New Zealand will approach their blockbuster World Cup semi-final against India with a clean slate and confidence in their ability to upstage the in-form hosts in Mumbai, skipper Kane Williamson said on Tuesday. The Black Caps began the tournament with four straight wins but suffered the first of four successive defeats against Rohit Sharma’s side amid a period of injury issues, before booking a place in Wednesday’s semi-final with a late push. Williamson, who returned from knee surgery for the World Cup and recovered from a frac­tured finger during it, missed the loss to India but is expect­ing a similarly tough test from the hosts who went unbeaten in the group stage. “We know it’s going to be a really tough chal­lenge. They’re a side that’s been playing extremely well, but we also know come finals time ev­erything starts again and it’s all about the day,” Williamson told reporters. “So for us as a team it’s very much the focus on our cricket again. We’ve played good crick­et throughout. We’ve had a cou­ple of narrow losses and a few wins along the way which have put us in this position we’re in. “We’re excited about the chal­lenge ahead.” New Zealand dashed India’s hopes in the semi-finals of the 2019 edition and Williamson said he was not concerned that his side were still considered underdogs. “I don’t think it has changed too much, but that’s fine and India have been excep­tional,” Williamson said. “One of the, if not the best team going around and playing cricket that matches that. But we know as well, on our day when we play our best cricket it certainly gives us the best chance. And come finals time anything can happen.” Top-order batsman Rachin Ravindra filled the void left by Williamson during their cam­paign and has been a revelation with 565 runs to earn praise from the skipper. “It’s not just the volume of runs that he’s achieved so far but how he’s been scoring them and how it’s been geared towards try­ing to move the team forward,” Williamson said. “Some fantas­tic contributions and at such a young age. I’m sure we’ll see plenty more of it to come.” Replying to a query about the crowd during the semifinal, Williamson said: “We’re expect­ing a fairly blue crowd that will be supporting their team. “We remember over the years, a number of different crowds that we’ve had that haven’t always been your own fans. “We have got a small country that doesn’t always fill out the stadiums, but you still appreci­ate the atmosphere it brings. “Not many people get that op­portunity, cricket in India, play­ing against India in a World Cup semifinal, is special and something to appreciate and look forward to.”","pubDate":"2023-11-14 22:25:18","image_url":"https://www.nation.com.pk/print_images/large/2023-11-15/williamson-confident-new-zealand-can-end-india-s-world-cup-dreams-again-1700000714-9784.jpg","source_id":"nation_pk","source_priority":353644,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"df53d0b5d85a61213328357ed20a178f","title":"Sixers bowler recalled to Aussie team","link":"https://www.news.com.au/sport/cricket/sixers-bowler-recalled-to-aussie-team/video/0341975991f0cd3691f44e377a656108","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Cricket: Sydney Sixers bowler Lauren Cheatle has been recalled to the Australia tour of India.","content":null,"pubDate":"2023-11-14 20:45:16","image_url":null,"source_id":"news","source_priority":5133,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"724c8f7c3cdfbe3d71b29626f507abc8","title":"Grim weather could threaten Aussie final hopes","link":"https://www.news.com.au/sport/cricket/grim-weather-could-threaten-aussie-final-hopes/video/c50ecd4036777714669361698bb95bed","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Cricket World Cup: A bleak outlook for Australia's semi final, and back up day, could impact Australia's progression to the World Cup final!","content":null,"pubDate":"2023-11-14 20:36:20","image_url":null,"source_id":"news","source_priority":5133,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"b057a8df7df9da0ad648f58a4c8b1fdd","title":"ODI World Cup: Kiwis gearing up for the big challenge","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/odi-world-cup-kiwis-gearing-up-for-the-big-challenge-2632880.html","keywords":null,"creator":null,"video_url":null,"description":"The first question fired: “Welcome to Mumbai just going back in history about the 29th of May 1953 about 70 years back…” and Williamson interrupts nonchalantly, MUMBAI: The press conference room at the Wankhede Stadium was packed on a hot and humid Tuesday afternoon. New Zealand captain Kane Williamson saunters in seemingly oblivious of the fact that two stern tests await him. First one of course is during the media interaction in the afternoon where he would be reminded of New Zealand's tales of near misses in ICC top events, and the next one will be on Wednesday when his team takes on India in the most important match of their lives. Photo: Shiba Prasad Sahu / Express Caption: New Zealand players practicing at the Wankhede Stadium in Mumbai ahead of the semi-final against India. The first question fired: “Welcome to Mumbai just going back in history about the 29th of May 1953 about 70 years back…” and Williamson interrupts nonchalantly, “Yeah, I remember that”, as the entire room erupts into laughter. When he walks on to the field on Thursday, it will be his fifth ICC World Cup semifinal across formats as captain. Yet, here was Williamson, less than 24 hours away from what is the most important match they have played so far, turning a serious question about scaling the highest peak in the world into some kind of a joke. And of course, New Zealand would be wary of the highest peak in cricket they are trying to climb. In fact, it pretty much sums up New Zealand’s campaign so far. They kicked off the tournament with four consecutive wins before being in a position where they almost missed out on the semifinals. They had a injury list when put together could be longer than the playing XI. From there on, they pulled back to enter their fifth consecutive ODI World Cup semifinal. The tags like ‘underdogs’ and ‘dark horses’ that are often linked with New Zealand in the lead up to global events usually seem out of place. Considering a country with a population that is a quarter of Mumbai and with just six premier domestic teams where cricket plays second fiddle to their national passion rugby, one must confess New Zealand have been among the most consistent teams at ICC events. In the last four years, they have played two white-ball World Cup finals, one semifinal and have won an ICC World Test Championship title. Ask Lockie Ferguson what makes them tick at World Cups, he doesn’t have a straight specific answer. “I’d love to know” he laughs. “When we start the competition, much like every other team we're here to win it, but of course we know there's a process and I think certainly within our team we've played a lot of cricket together for a long period of time, so we sort of stick to our processes and I know it sounds cliche, but I think it keeps us sort of level-headed and naturally as Kiwis we tend to stay where our feet are, which I think is a positive,” he adds. 'Tend to stay where our feet are' is what stands out. And this comes from one of the most colourful individuals who is filled with life and flair in the New Zealand dressing room. So, it comes as no surprise when Williamson plays down what has been an incredibly tough eight months for him personally. After the injury he suffered at the start of the Indian Premier League, it seemed like he was not going to make it the World Cup. But he did. And then, he is back on the field for his very first game of the tournament only to get hit by a throw and fracture his thumb. But New Zealand Cricket knows he will come back again and they know that the team will need him in the business end of the tournament. They kept him with the team, and he made a come back, again. Williamson calls it “an interesting journey” before expressing his gratitude to be in a position to lead the team in another semifinal. He did make sure that people knew the thumbs fracture was not funny even when he was explaining it with a laugh. “It was quite frustrating and testing but still feeling that it hadn't ruled me out so I still was grateful for that and it's nice to be fitter than perhaps I was yesterday and be sitting here,” he said. This unassuming personality, that takes a step back every time he faces a ball or sets the field during the game, is the essence and spirit of this Black Caps team. They would be the friendliest people when you talk to them, but you would not want to be on the other end off the 22 yards against them. Out there, they give it all. Weeks ago when they played India in Dharamsala, there were questions about the outfield and even India captain Rohit Sharma were gesturing players not to dive. New Zealand, however, were having a ball. They were throwing themselves around to stop the ball, and saved at least 20-30 runs, making it all the more harder for India. \"We’ve got standards within our Black Caps that you come and do everything you can to help us win games of cricket and part of that is diving on the boundary and stopping the ball when you get the chance and that's something we're proud of ourselves as Black Caps and we'll continue to do it no matter where we play in the world,\" Daryl Mitchell said. Expect nothing less when Williamson leads them on to the field in front of a sea of blue on Wednesday. They are going to push India’s limits, give everything they could and put on a spectacle. For that is what the Black Caps are. They will not go down without a fight.","content":"MUMBAI: The press conference room at the Wankhede Stadium was packed on a hot and humid Tuesday afternoon. New Zealand captain Kane Williamson saunters in seemingly oblivious of the fact that two stern tests await him. First one of course is during the media interaction in the afternoon where he would be reminded of New Zealand's tales of near misses in ICC top events, and the next one will be on Wednesday when his team takes on India in the most important match of their lives. The first question fired: “Welcome to Mumbai just going back in history about the 29th of May 1953 about 70 years back…” and Williamson interrupts nonchalantly, “Yeah, I remember that”, as the entire room erupts into laughter. When he walks on to the field on Thursday, it will be his fifth ICC World Cup semifinal across formats as captain. Yet, here was Williamson, less than 24 hours away from what is the most important match they have played so far, turning a serious question about scaling the highest peak in the world into some kind of a joke. And of course, New Zealand would be wary of the highest peak in cricket they are trying to climb. In fact, it pretty much sums up New Zealand’s campaign so far. They kicked off the tournament with four consecutive wins before being in a position where they almost missed out on the semifinals. They had a injury list when put together could be longer than the playing XI. From there on, they pulled back to enter their fifth consecutive ODI World Cup semifinal. The tags like ‘underdogs’ and ‘dark horses’ that are often linked with New Zealand in the lead up to global events usually seem out of place. Considering a country with a population that is a quarter of Mumbai and with just six premier domestic teams where cricket plays second fiddle to their national passion rugby, one must confess New Zealand have been among the most consistent teams at ICC events. In the last four years, they have played two white-ball World Cup finals, one semifinal and have won an ICC World Test Championship title. Ask Lockie Ferguson what makes them tick at World Cups, he doesn’t have a straight specific answer. “I’d love to know” he laughs. “When we start the competition, much like every other team we're here to win it, but of course we know there's a process and I think certainly within our team we've played a lot of cricket together for a long period of time, so we sort of stick to our processes and I know it sounds cliche, but I think it keeps us sort of level-headed and naturally as Kiwis we tend to stay where our feet are, which I think is a positive,” he adds. 'Tend to stay where our feet are' is what stands out. And this comes from one of the most colourful individuals who is filled with life and flair in the New Zealand dressing room. So, it comes as no surprise when Williamson plays down what has been an incredibly tough eight months for him personally. After the injury he suffered at the start of the Indian Premier League, it seemed like he was not going to make it the World Cup. But he did. And then, he is back on the field for his very first game of the tournament only to get hit by a throw and fracture his thumb. But New Zealand Cricket knows he will come back again and they know that the team will need him in the business end of the tournament. They kept him with the team, and he made a come back, again. Williamson calls it “an interesting journey” before expressing his gratitude to be in a position to lead the team in another semifinal. He did make sure that people knew the thumbs fracture was not funny even when he was explaining it with a laugh. “It was quite frustrating and testing but still feeling that it hadn't ruled me out so I still was grateful for that and it's nice to be fitter than perhaps I was yesterday and be sitting here,” he said. This unassuming personality, that takes a step back every time he faces a ball or sets the field during the game, is the essence and spirit of this Black Caps team. They would be the friendliest people when you talk to them, but you would not want to be on the other end off the 22 yards against them. Out there, they give it all. Weeks ago when they played India in Dharamsala, there were questions about the outfield and even India captain Rohit Sharma were gesturing players not to dive. New Zealand, however, were having a ball. They were throwing themselves around to stop the ball, and saved at least 20-30 runs, making it all the more harder for India. \"We’ve got standards within our Black Caps that you come and do everything you can to help us win games of cricket and part of that is diving on the boundary and stopping the ball when you get the chance and that's something we're proud of ourselves as Black Caps and we'll continue to do it no matter where we play in the world,\" Daryl Mitchell said. Expect nothing less when Williamson leads them on to the field in front of a sea of blue on Wednesday. They are going to push India’s limits, give everything they could and put on a spectacle. For that is what the Black Caps are. They will not go down without a fight.","pubDate":"2023-11-15 01:44:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"dd368f8ae4f7b7d1d1ced8b15e47dcf1","title":"Box office showdown: Sparks set to fly as Indian juggernaut faces tricky New Zealand in repeat of 2019 semifinal","link":"https://www.tribuneindia.com/news/sports/box-office-showdown-sparks-set-to-fly-as-indian-juggernaut-faces-tricky-new-zealand-in-repeat-of-2019-semifinal-562482","keywords":null,"creator":null,"video_url":null,"description":"Rohit Mahajan Mumbai, November 14 India have smashed every opponent over the past six weeks, but now comes the moment of truth — and moment of luck, too, says Rohit Sharma, the Indian captain. New Zealand's captain Kane Williamson warms up during practice. Reuters \"The time has come that you need a little bit of luck to go your way,\" said Rohit on the eve of their semifinal against New Zealand. \"Obviously, we're going to be brave enough. And hopefully, fortune favours the brave.\" The time has come that you need a little bit of luck to go your way. Obviously, we're going to be brave enough. And hopefully, fortune favours the brave. Rohit Sharma The underdog thing, from what you guys write, I do not think it has changed too much, but that is fine you know, and India have been exceptional. Kane Williamson Rohit's assertion of positivity seemed to reflect a mind coach's words; his comment about luck, the need for luck, however, reflected the underlying fear of the unknown that preys on the mind of a sportsperson. 85 India currently have the most wickets (85), best economy rate (4.5), best average (19.6) and best strike-rate (26.2) among all teams in the World Cup. 6.5 New Zealand have been effective at scoring runs quickly in this World Cup, having the joint-highest run rate (6.5) among all teams in the tournament. 5 In nine World Cup matches against each other, New Zealand have won five times, while India have won four times. In any game, there are uncontrollables that sportspersons are wary of; at the Wankhede, which side the coin lands on at the toss could be a decisive uncontrollable — teams batting first enjoy a massive advantage at this ground, right from the first game in 1987, when India batted first against Sri Lanka and piled up 299 in those days of relatively conservative batting. During this tournament, batting first, South Africa made 399/7 against England and 382/5 against Bangladesh and won with ease; India then smashed 357/8 against Sri Lanka and routed them by 302 runs; Afghanistan made 291/5 against Australia and lost — but that was only due to a freakish innings of 201 by Glenn Maxwell, and the inexperience of the Afghan bowlers. When the stadium was redeveloped before the 2011 World Cup, the ground became smaller, playing right into the hands of the batsmen. The dice is loaded in favour of the batsmen — in 12 ODIs played at the ground since the stadium's diminution, the team batting first has topped 300 four times, once exceeding 400. The clincher? The average first-innings total here since then is 308, the average for the second innings is 218 — a clear difference of 90 runs. If that doesn't make the toss — perhaps the 'luck' Rohit talked about — critical, nothing would. The mantra would be — bat first, pile up a huge score when the conditions favour the batters, then rock the opposition with movement in the air and off the pitch, as India did against Sri Lanka. What India did to Sri Lanka, New Zealand can do to India under the lights — they do have the resources in Trent Boult, the tall left-handed paceman who can make the ball angle across and then suddenly bend it back into the right-hander. Under the lights at the Wankhede, the ball has swung prodigiously — Boult could be quite a handful here, as he was in Manchester on July 9-10, 2019, when New Zealand beat India at the same stage of the World Cup. India have struck fear into the hearts of the opposition, especially their pace bowlers — and their spin bowlers, and their batsmen! The pace trio of Mohammed Shami, Jasprit Bumrah and Mohammed Siraj has taken 45 wickets; spin twins Ravindra Jadeja and Kuldeep Yadav have another 30; Virat Kohli, Rohit Sharma and Shreyas Iyer have accumulated 1,518 runs, average 72.28; KL Rahul and Shubman Gill have 347 and 270 runs, respectively. Really, it seems India have all their bases covered, as Rohit said. \"The first (part) of the tournament, we chased the first five games, then the next four games we batted first,\" said Rohit. \"So, in terms of the areas that we wanted to cover, I think we've covered almost every bit. We do understand the importance of this week, but I don't think we need to do anything different from what we've been doing in this tournament.\" Yes, but a bit of luck would be most welcome. Everybody wants a piece of Rachin Rachin Ravindra, 24 in four days, is a bald man's envy — he seems to have such a full head of hair as could be enough for three men. But he's also the envy of batsmen of all sorts, hairy or bald — the Wellington-born young man, son of migrants from India, has scored 565 runs in nine innings, average 70.62, with three hundreds and two 50s. Rachin Ravindra and Daryl Mitchell have been New Zealand's best batsmen in the tournament so far. REUTERS He's inspired myths, too, with the internet buzzing with the news that his name is a combination of the names of two legends, Rahul Dravid and Sachin Tendulkar. In fact, he himself seemed to have bought into this, having said: \"Back in the day when Mum and Dad were deciding the names, they both liked Rahul and Sachin, so \"Ra\" from Rahul and \"chin\" from Sachin, but that was a long time ago. We don't talk about it much anymore.\" That's a pleasing and plausible story, but his father now says the son got his facts wrong. He was named Rachin because it \"sounded good, was easy to spell, and short\", says the dad, Ravi Krishnamurthy, who obviously possesses accurate information. He added that Rachin wasn't named \"with the intention to make our child a cricketer\". But he's turned out to be quite a useful cricketer, as Kane Williamson acknowledged with his native effusiveness. \"Yeah, good player, right?\" Kane and Everest Kane Williamson is still cool. He was the losing captain in the 2019 World Cup final, and shrugged off the defeat that July 14 with remarkable stoicism, saying: \"Yeah, obviously, just gutted.\" Today, before the biggest game of the World Cup so far, Williamson put up a comedic performance, raising laughter loud and often. The first question to him started with: \"Kane, just going back in history a bit, 29th of May 1953, about 70 years backhellip;\" Williamson interrupted him: \"I remember, yeah!\" Williamson had been some 30 minutes late for the press conference. His tardiness was punished just as the first question was asked, as the sound failed. Williamson kept the restive reporters in good humour with wisecracks. There was another interruption — the public address system of the ground was being tested, and a male voice boomed through the room: \"Mic check, mic check, mic checkhellip;\" Williamson responded: \"The mic's working, the mic's working!\" The press conference stops, and when it was time to resume it, Williamson sought to know if all's well with: \"Mic check, mic check, mic check,\" mimicking the invisible voice that had caused the interruption. This is my property! Some cricket-lovers were spotted at the Marine Drive today. It was easy to spot them, for they were dressed in identical blue shirts and ICC World Cup caps. They're an excited lot, the few who seem excited about the cricket. They're discussing their exclusive properties, their \"licensed cricket digital collectibles\". The video worth $700. What are these? \"They are digitally signed properties, such as videos, which are released in limited numbers,\" says Vijay Kumar, an engineer from Bengaluru. He then displays a video of Virat Kohli that, he says, is valued at $700. But how can a video that can be watched by everyone on the internet be valued so much, one wonders. \"It's not just the video, one gets privileges if one possesses these properties,\" says Vijay. \"So, those who have certain properties can take part in contests where one can win a sizeable prize money. Today we met Shane Watson, who was in the commentary box, just because we have these collectibles!\" In impressive tones, the talks about a limited edition Sachin Tendulkar digital property — a digitally signed video — which he says is worth $25,000. \"Only five of these have been released so far!\" he says. All this sounds a bit fishy to those used to the idea of brick and mortar companies, but Vijay Kumar and his friends are sure they've got a good thing going. — Rohit Mahajan","content":"Tribune News Service Rohit Mahajan Mumbai, November 14 India have smashed every opponent over the past six weeks, but now comes the moment of truth — and moment of luck, too, says Rohit Sharma, the Indian captain. “The time has come that you need a little bit of luck to go your way,” said Rohit on the eve of their semifinal against New Zealand. “Obviously, we’re going to be brave enough. And hopefully, fortune favours the brave.” The time has come that you need a little bit of luck to go your way. Obviously, we’re going to be brave enough. And hopefully, fortune favours the brave. Rohit Sharma The underdog thing, from what you guys write, I do not think it has changed too much, but that is fine you know, and India have been exceptional. Kane Williamson Rohit’s assertion of positivity seemed to reflect a mind coach’s words; his comment about luck, the need for luck, however, reflected the underlying fear of the unknown that preys on the mind of a sportsperson. 85 India currently have the most wickets (85), best economy rate (4.5), best average (19.6) and best strike-rate (26.2) among all teams in the World Cup. 6.5 New Zealand have been effective at scoring runs quickly in this World Cup, having the joint-highest run rate (6.5) among all teams in the tournament. 5 In nine World Cup matches against each other, New Zealand have won five times, while India have won four times. In any game, there are uncontrollables that sportspersons are wary of; at the Wankhede, which side the coin lands on at the toss could be a decisive uncontrollable — teams batting first enjoy a massive advantage at this ground, right from the first game in 1987, when India batted first against Sri Lanka and piled up 299 in those days of relatively conservative batting. During this tournament, batting first, South Africa made 399/7 against England and 382/5 against Bangladesh and won with ease; India then smashed 357/8 against Sri Lanka and routed them by 302 runs; Afghanistan made 291/5 against Australia and lost — but that was only due to a freakish innings of 201 by Glenn Maxwell, and the inexperience of the Afghan bowlers. When the stadium was redeveloped before the 2011 World Cup, the ground became smaller, playing right into the hands of the batsmen. The dice is loaded in favour of the batsmen — in 12 ODIs played at the ground since the stadium’s diminution, the team batting first has topped 300 four times, once exceeding 400. The clincher? The average first-innings total here since then is 308, the average for the second innings is 218 — a clear difference of 90 runs. If that doesn’t make the toss — perhaps the ‘luck’ Rohit talked about — critical, nothing would. The mantra would be — bat first, pile up a huge score when the conditions favour the batters, then rock the opposition with movement in the air and off the pitch, as India did against Sri Lanka. What India did to Sri Lanka, New Zealand can do to India under the lights — they do have the resources in Trent Boult, the tall left-handed paceman who can make the ball angle across and then suddenly bend it back into the right-hander. Under the lights at the Wankhede, the ball has swung prodigiously — Boult could be quite a handful here, as he was in Manchester on July 9-10, 2019, when New Zealand beat India at the same stage of the World Cup. India have struck fear into the hearts of the opposition, especially their pace bowlers — and their spin bowlers, and their batsmen! The pace trio of Mohammed Shami, Jasprit Bumrah and Mohammed Siraj has taken 45 wickets; spin twins Ravindra Jadeja and Kuldeep Yadav have another 30; Virat Kohli, Rohit Sharma and Shreyas Iyer have accumulated 1,518 runs, average 72.28; KL Rahul and Shubman Gill have 347 and 270 runs, respectively. Really, it seems India have all their bases covered, as Rohit said. “The first (part) of the tournament, we chased the first five games, then the next four games we batted first,” said Rohit. “So, in terms of the areas that we wanted to cover, I think we’ve covered almost every bit. We do understand the importance of this week, but I don’t think we need to do anything different from what we’ve been doing in this tournament.” Yes, but a bit of luck would be most welcome. Everybody wants a piece of Rachin Rachin Ravindra, 24 in four days, is a bald man’s envy — he seems to have such a full head of hair as could be enough for three men. But he’s also the envy of batsmen of all sorts, hairy or bald — the Wellington-born young man, son of migrants from India, has scored 565 runs in nine innings, average 70.62, with three hundreds and two 50s. He’s inspired myths, too, with the internet buzzing with the news that his name is a combination of the names of two legends, Rahul Dravid and Sachin Tendulkar. In fact, he himself seemed to have bought into this, having said: “Back in the day when Mum and Dad were deciding the names, they both liked Rahul and Sachin, so “Ra” from Rahul and “chin” from Sachin, but that was a long time ago. We don’t talk about it much anymore.” That’s a pleasing and plausible story, but his father now says the son got his facts wrong. He was named Rachin because it “sounded good, was easy to spell, and short”, says the dad, Ravi Krishnamurthy, who obviously possesses accurate information. He added that Rachin wasn’t named “with the intention to make our child a cricketer”. But he’s turned out to be quite a useful cricketer, as Kane Williamson acknowledged with his native effusiveness. “Yeah, good player, right?” Kane and Everest Kane Williamson is still cool. He was the losing captain in the 2019 World Cup final, and shrugged off the defeat that July 14 with remarkable stoicism, saying: “Yeah, obviously, just gutted.” Today, before the biggest game of the World Cup so far, Williamson put up a comedic performance, raising laughter loud and often. The first question to him started with: “Kane, just going back in history a bit, 29th of May 1953, about 70 years back…” Williamson interrupted him: “I remember, yeah!” Williamson had been some 30 minutes late for the press conference. His tardiness was punished just as the first question was asked, as the sound failed. Williamson kept the restive reporters in good humour with wisecracks. There was another interruption — the public address system of the ground was being tested, and a male voice boomed through the room: “Mic check, mic check, mic check…” Williamson responded: “The mic’s working, the mic’s working!” The press conference stops, and when it was time to resume it, Williamson sought to know if all’s well with: “Mic check, mic check, mic check,” mimicking the invisible voice that had caused the interruption. This is my property! Some cricket-lovers were spotted at the Marine Drive today. It was easy to spot them, for they were dressed in identical blue shirts and ICC World Cup caps. They’re an excited lot, the few who seem excited about the cricket. They’re discussing their exclusive properties, their “licensed cricket digital collectibles”. What are these? “They are digitally signed properties, such as videos, which are released in limited numbers,” says Vijay Kumar, an engineer from Bengaluru. He then displays a video of Virat Kohli that, he says, is valued at $700. But how can a video that can be watched by everyone on the internet be valued so much, one wonders. “It’s not just the video, one gets privileges if one possesses these properties,” says Vijay. “So, those who have certain properties can take part in contests where one can win a sizeable prize money. Today we met Shane Watson, who was in the commentary box, just because we have these collectibles!” In impressive tones, the talks about a limited edition Sachin Tendulkar digital property — a digitally signed video — which he says is worth $25,000. “Only five of these have been released so far!” he says. All this sounds a bit fishy to those used to the idea of brick and mortar companies, but Vijay Kumar and his friends are sure they’ve got a good thing going. — Rohit Mahajan #Mumbai #New Zealand #Rohit Sharma","pubDate":"2023-11-15 01:41:31","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/11/2023_11$largeimg_1744845718.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4709853e97a7d131d27112a85165235e","title":"World Cup: Fascinating contest on the cards between equals","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/world-cup-fascinating-conteston-the-cards-between-equals-2632887.html","keywords":null,"creator":null,"video_url":null,"description":"Australia and South Africa, two teams familiar to each other at the World Cup stage, meet in second semifinal at Eden Gardens in Kolkata KOLKATA: The Eden Gardens in Kolkata is all decked up for the second semifinal between heavyweights Australia and South Africa. But if one compares the buzz with that of India's league match against the latter at the venue on November 5, the enthusiasm and craze seem to be missing. The roads surrounding the stadium were sparsely occupied on Tuesday with only a few trying to get their hands on the tickets. In fact, almost all of them were successful even with only two days to go for the match. It was the complete opposite when the Men in Blue landed in the City of Joy less than a fortnight ago with the cops resorting to lathi charge to disburse the agitated crowd as they failed to procure the tickets. With Virat Kohli's birthday falling on the match day, the scene became even more chaotic as fans celebrated his birthday on roads, which already were chock-a-block with ticket seekers. Intensity off the field might be missing but the same could not be said inside the venue. Both teams had long training sessions both on Monday and Tuesday and are scheduled to have another one on Wednesday before the clash. Given the history they share, especially in the World Cup, the contest is expected to be loaded with action. Be it the Super Six encounter at the 1999 edition wherein skipper Steve Waugh came up with a gritty unbeaten century to see his team home or the second semifinal only four days apart that ended in a tie with the eventual champions progressing by virtue of their win in the previous match. Australia had it easy eight years later as they won both the league match and second semifinal but South Africa registered a close 10-run victory when they met next in 2019. They extended that run this edition as well when they humbled the five-time champions by 134 runs last month in a league match. Overall, both the sides have played seven matches in the showpiece event since South Africa's return to international cricket in 1992. All those contests have been even-stevens affairs with each side winning three each, with one ending in a tie. Temba Bavuma and Co, however, can take confidence from the fact that the Australians have never defeated them in an ODI in India. Since 1996, when they played three ODIs in the Titan Cup, the Proteas had emerged winners each time, pocketing all the four matches. Come Thursday, the past records have no bearing as a lot will be on stake for both the teams. For South Africa, this will be a chance to break the semifinal hoodoo and march a step closer to holding the coveted trophy. Australia, in turn, will be eager to add yet another silverware to their already full cabinet. Rain threat There is a threat of rain in Kolkata with the Indian Meteorological Department (IMD) predicting formation of a low pressure area over Southeast Bay of Bengal and adjoining Andaman-Nicobar Islands. As per the IMD, it is likely to move west-northwestwards and intensify into a depression over West Central Bay of Bengal on Wednesday. \"Thereafter, it would move northwestwards and may intensify into a deep depression over West Central Bay of Bengal off Andhra Pradesh coast on Thursday. Subsequently, it would recurve north-northeast wards and reach Northwest Bay of Bengal off Odisha coast on Friday,\" the IMD said. The city may see rain from this system on both days, including Friday, reserve day. Snehasish Ganguly, Cricket Association of Bengal (CAB) president, believes they are ready to tackle the situation. \"We can cover the entire ground in no time. The drainage system here is world class. So in that sense we are absolutely ready to host the match,\" the CAB president told this daily. Notably, the association bought covers from the United Kingdom before the 2016 T20 World Cup. \"The covers are divided into four quarters and are lightweight, so they can be easily pulled from corners at each quarter of the ground in no time. Besides, we have three super soppers in case we need to dry the outfield,\" Arindam Basu, venue media manager, told this daily.","content":"KOLKATA: The Eden Gardens in Kolkata is all decked up for the second semifinal between heavyweights Australia and South Africa. But if one compares the buzz with that of India's league match against the latter at the venue on November 5, the enthusiasm and craze seem to be missing. The roads surrounding the stadium were sparsely occupied on Tuesday with only a few trying to get their hands on the tickets. In fact, almost all of them were successful even with only two days to go for the match. It was the complete opposite when the Men in Blue landed in the City of Joy less than a fortnight ago with the cops resorting to lathi charge to disburse the agitated crowd as they failed to procure the tickets. With Virat Kohli's birthday falling on the match day, the scene became even more chaotic as fans celebrated his birthday on roads, which already were chock-a-block with ticket seekers. Intensity off the field might be missing but the same could not be said inside the venue. Both teams had long training sessions both on Monday and Tuesday and are scheduled to have another one on Wednesday before the clash. Given the history they share, especially in the World Cup, the contest is expected to be loaded with action. Be it the Super Six encounter at the 1999 edition wherein skipper Steve Waugh came up with a gritty unbeaten century to see his team home or the second semifinal only four days apart that ended in a tie with the eventual champions progressing by virtue of their win in the previous match. Australia had it easy eight years later as they won both the league match and second semifinal but South Africa registered a close 10-run victory when they met next in 2019. They extended that run this edition as well when they humbled the five-time champions by 134 runs last month in a league match. Overall, both the sides have played seven matches in the showpiece event since South Africa's return to international cricket in 1992. All those contests have been even-stevens affairs with each side winning three each, with one ending in a tie. Temba Bavuma and Co, however, can take confidence from the fact that the Australians have never defeated them in an ODI in India. Since 1996, when they played three ODIs in the Titan Cup, the Proteas had emerged winners each time, pocketing all the four matches. Come Thursday, the past records have no bearing as a lot will be on stake for both the teams. For South Africa, this will be a chance to break the semifinal hoodoo and march a step closer to holding the coveted trophy. Australia, in turn, will be eager to add yet another silverware to their already full cabinet. There is a threat of rain in Kolkata with the Indian Meteorological Department (IMD) predicting formation of a low pressure area over Southeast Bay of Bengal and adjoining Andaman-Nicobar Islands. As per the IMD, it is likely to move west-northwestwards and intensify into a depression over West Central Bay of Bengal on Wednesday. \"Thereafter, it would move northwestwards and may intensify into a deep depression over West Central Bay of Bengal off Andhra Pradesh coast on Thursday. Subsequently, it would recurve north-northeast wards and reach Northwest Bay of Bengal off Odisha coast on Friday,\" the IMD said. The city may see rain from this system on both days, including Friday, reserve day. Snehasish Ganguly, Cricket Association of Bengal (CAB) president, believes they are ready to tackle the situation. \"We can cover the entire ground in no time. The drainage system here is world class. So in that sense we are absolutely ready to host the match,\" the CAB president told this daily. Notably, the association bought covers from the United Kingdom before the 2016 T20 World Cup. \"The covers are divided into four quarters and are lightweight, so they can be easily pulled from corners at each quarter of the ground in no time. Besides, we have three super soppers in case we need to dry the outfield,\" Arindam Basu, venue media manager, told this daily.","pubDate":"2023-11-15 01:27:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"b364ba95b2e1daa7362690359f433d95","title":"Need more U19 and Emerging tours, a domestic red-ball tournament for Indian women: ICC Hall of Famer Diana Edulji","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/need-more-u19-and-emerging-tours-a-domestic-red-ball-tournament-for-indian-women-icc-hall-of-famer-2632889.html","keywords":null,"creator":null,"video_url":null,"description":"Edulji played 20 Tests and 34 ODIs in her career and took 107 wickets across formats. MUMBAI: Former India captain and ICC Hall of Famer Diana Edulji believes that having more U19 and Emerging team tours along with bringing back the domestic red-ball tournament are the way to go forward for women's cricket in India. Edulji, one of the pioneers of women's cricket in India, was inducted into the ICC Hall of Fame earlier this week. And with this, she became the first Indian women cricketer to be given the honour, recognising her contribution to the sport and 17-year-long international career. \"It's a big, big honor for me. I think it is the right time because the World Cup is in India and a woman cricketer from India is being recognized,\" Edulji told this daily during an ICC event ahead of the first semifinal of the 2023 ICC Men's ODI World Cup in Mumbai on Tuesday. Edulji played 20 Tests and 34 ODIs in her career and took 107 wickets across formats. She also led her country in four Tests and 18 ODIs, including in the 1993 Women's World Cup in England. Long after her retirement from international cricket, she served as one of the members of the Supreme Court-appointed Committee of Administrators (CoA) to oversee the running of the BCCI from 2017 to 2019. During the interaction, she credited ICC and BCCI for the work they have put in for women's cricket saying, \"The ICC is doing a lot to promote women's cricket, and BCCI itself is doing a lot and I think together women's cricket now can go forward.\" The year 2023 has been good for women's cricket, especially India. They won the U19 T20 World Cup, reached the semifinal of the senior event, the inaugural season of the Women's Premier League saw viewership reach new heights and the senior team won the gold medal in the Asian Games. When asked how could they take the momentum forward, the 67-year-old said that playing continuous cricket is the way. \"Whether it's domestic, whether it's international, the players can't be playing a lot of cricket in one month and then spend another three months at home. Now there has to be a proper structure. I'm very happy that BCCI has agreed to play Test matches. That is the right step. If you want cricket to improve, you have to learn to play the longer version, then you can play all the versions. You have to get that temperament to stay at the wicket,\" she said referring to India women's two home Tests against England and Australia in December. While India women are getting ready to play their first home Test game in nine years, they do not have a domestic red-ball event at the moment. In the past, there used to be a Senior Women's Cricket Inter Zonal Three-Day tournament, but the competition was discontinued after the 2017-18 season. Edulji believes that there has to be a first-class tournament for the women at the domestic level. \"Definitely domestic cricket has to have one longer version tournament,\" she said. Praising the up-and-coming generation of cricketers who won the U19 T20 World Cup earlier this year, Edulji said that they need to push and make their case, putting pressure on the senior players. \"I'm really surprised that they still haven't yet made it into the senior team. I think they need to put pressure, which will help the seniors also play that there is someone behind now,\" she said. With the next Women's ODI World Cup set to be played in India in 2025, Edulji said there has to be a lot of Women's U19 and Emerging tours like the men do over the next two years. \"That's how we can build bench strength. You need a lot of tours, but it's not necessary that you have to play the big country, you can play the smaller countries with the Under-19, and then it is possible that you can build and have a very strong team and win the World Cup,\" Edulji signed off.","content":"MUMBAI: Former India captain and ICC Hall of Famer Diana Edulji believes that having more U19 and Emerging team tours along with bringing back the domestic red-ball tournament are the way to go forward for women's cricket in India. Edulji, one of the pioneers of women's cricket in India, was inducted into the ICC Hall of Fame earlier this week. And with this, she became the first Indian women cricketer to be given the honour, recognising her contribution to the sport and 17-year-long international career. \"It's a big, big honor for me. I think it is the right time because the World Cup is in India and a woman cricketer from India is being recognized,\" Edulji told this daily during an ICC event ahead of the first semifinal of the 2023 ICC Men's ODI World Cup in Mumbai on Tuesday. Edulji played 20 Tests and 34 ODIs in her career and took 107 wickets across formats. She also led her country in four Tests and 18 ODIs, including in the 1993 Women's World Cup in England. Long after her retirement from international cricket, she served as one of the members of the Supreme Court-appointed Committee of Administrators (CoA) to oversee the running of the BCCI from 2017 to 2019. During the interaction, she credited ICC and BCCI for the work they have put in for women's cricket saying, \"The ICC is doing a lot to promote women's cricket, and BCCI itself is doing a lot and I think together women's cricket now can go forward.\" The year 2023 has been good for women's cricket, especially India. They won the U19 T20 World Cup, reached the semifinal of the senior event, the inaugural season of the Women's Premier League saw viewership reach new heights and the senior team won the gold medal in the Asian Games. When asked how could they take the momentum forward, the 67-year-old said that playing continuous cricket is the way. \"Whether it's domestic, whether it's international, the players can't be playing a lot of cricket in one month and then spend another three months at home. Now there has to be a proper structure. I'm very happy that BCCI has agreed to play Test matches. That is the right step. If you want cricket to improve, you have to learn to play the longer version, then you can play all the versions. You have to get that temperament to stay at the wicket,\" she said referring to India women's two home Tests against England and Australia in December. While India women are getting ready to play their first home Test game in nine years, they do not have a domestic red-ball event at the moment. In the past, there used to be a Senior Women's Cricket Inter Zonal Three-Day tournament, but the competition was discontinued after the 2017-18 season. Edulji believes that there has to be a first-class tournament for the women at the domestic level. \"Definitely domestic cricket has to have one longer version tournament,\" she said. Praising the up-and-coming generation of cricketers who won the U19 T20 World Cup earlier this year, Edulji said that they need to push and make their case, putting pressure on the senior players. \"I'm really surprised that they still haven't yet made it into the senior team. I think they need to put pressure, which will help the seniors also play that there is someone behind now,\" she said. With the next Women's ODI World Cup set to be played in India in 2025, Edulji said there has to be a lot of Women's U19 and Emerging tours like the men do over the next two years. \"That's how we can build bench strength. You need a lot of tours, but it's not necessary that you have to play the big country, you can play the smaller countries with the Under-19, and then it is possible that you can build and have a very strong team and win the World Cup,\" Edulji signed off.","pubDate":"2023-11-15 01:21:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"9d38cd4911d9459f6e7f644f5a751709","title":"With new zeal, India look to bury demons of past","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/15/with-new-zeal-india-look-to-bury-demons-of-past-2632981.html","keywords":null,"creator":null,"video_url":null,"description":"On Tuesday, it seemed different. The buzz and excitement in the sea breeze are palpable despite the inherent pollution you can feel. MUMBAI: The streets of Colaba are abuzz. They are filled with people, and tourists all through the day so much so that if you stand at any point in the street, the crowd will take you forward all by itself. In fact, it is what a regular day in the commercial capital of India looks like. On Tuesday, it seemed different. The buzz and excitement in the sea breeze are palpable despite the inherent pollution you can feel. In Colaba, everywhere you turn, you can see vendors selling India’s replica jerseys. Pick one and the vendor would say it’s `950 bucks, before convincing you to buy the one he has for `550. The hotels are being swarmed by fans who have travelled to watch the game. At the Wankhede Stadium, final preparations are underway as the iconic venue is set to host what is probably the most significant cricket game they have hosted since April 2, 2011. India vs New Zealand. Semifinal. 2023 ICC Men’s ODI World Cup. This movie has been screened before. In Old Trafford four years ago against the same team. In Sydney, against Australia eight years ago. The Men in Blue would dominate the tournament up until the semifinal only to fall short there. It’s a movie that has given heartbreaks to a billion people year after year in every ICC event in the last decade. This time, however, it seems different. One can feel the hope in the air. This Rohit Sharma-led Indian team has been unstoppable. They have the best batters of the tournament, including Sharma and Virat Kohli. Five among their top seven batters average well over 50 with three striking above run-a-ball. All five — Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja — have taken more than ten wickets (three of them average less than 20), taking turns to win the Player of the Match awards. As a group, they have made a mockery of the term ‘contest’ outplaying every opponent, except one team. New Zealand. The Black Caps are the only team that got in their faces and made them work. Even though India beat them in the league stages, it did not come easy. That is why, the semifinal against New Zealand at Mumbai is poetic in more than one way. For starters, it is the team that has been India’s nemesis in world meets for a while — 2016 World T20 league game, 2019 WC semifinal, and 2021 World Test Championship final, 2021 World T20 league game. And it’s a team that has the resources to test this Indian team at this venue. The shorter boundaries and conditions will help New Zealand take on Indian spinners and they also have the seam attack to trouble the Indian top-order. The trophy drought of this Indian team is vastly talked and discussed about. India have not won an ICC trophy in ten years. In this decade, India entered two T20 WC semifinals, two ODI World Cup semifinals, a Champions Trophy, and two WTC finals. For a team that began its transition in the same year as they won their last ICC title, it is not all that bad. But lack of a trophy for the sports’ only financial behemoth is jarring. Not a champion unless you become one of the world. The players know it too. That could be why some of them, including Sharma, probably playing their last World Cup want to win the trophy badly. He said as much at the start of the event. While acknowledging that there is unfinished business and he is desperate to an extent to hold that trophy aloft come November 19, Sharma insisted on finding a balance. Sharma also mentioned the one thing that India hasn’t had in World Cup knockouts — luck. “Obviously we have to leave a lot of things to Almighty as well because we need that little bit of luck in the tournament. I hope we get that luck. But yeah, it will be nice to win a World Cup,” he had said in Chennai before the game against Australia. Two games away from making that dream come true, Sharma reflected on the league stage, saying that it is all about breaking down into parts and moving forward. “Nine games is a lot of games, literally two or three bilateral series. With different games and different venues, you have to break it down into different styles and strategies as well. I think we did that well. In the first half, we chased the first five games, and next four, we batted first. In terms of areas we wanted to cover, we have covered almost every bit of it. We do understand the importance of this week but for us, I don’t think we need to do anything different from what we have been doing in this tournament. There will be challenges. You just got to respond, front up, and get through that situation,” Sharma said on Tuesday before adding, “Now the time has come, you need a little bit of luck to go your way. Obviously, we are going to be brave enough. Hopefully, fortune will favour the brave.” The demons of the semifinal have chased India at ICC events for far too long now. On Wednesday, India have a chance to bury the demons at a venue where they conquered the world 12 years ago. This current crop has the ability to reach the first global white ball final since 2017. Will they? Only time will tell.","content":"MUMBAI: The streets of Colaba are abuzz. They are filled with people, and tourists all through the day so much so that if you stand at any point in the street, the crowd will take you forward all by itself. In fact, it is what a regular day in the commercial capital of India looks like. On Tuesday, it seemed different. The buzz and excitement in the sea breeze are palpable despite the inherent pollution you can feel. In Colaba, everywhere you turn, you can see vendors selling India’s replica jerseys. Pick one and the vendor would say it’s `950 bucks, before convincing you to buy the one he has for `550. The hotels are being swarmed by fans who have travelled to watch the game. At the Wankhede Stadium, final preparations are underway as the iconic venue is set to host what is probably the most significant cricket game they have hosted since April 2, 2011. India vs New Zealand. Semifinal. 2023 ICC Men’s ODI World Cup. This movie has been screened before. In Old Trafford four years ago against the same team. In Sydney, against Australia eight years ago. The Men in Blue would dominate the tournament up until the semifinal only to fall short there. It’s a movie that has given heartbreaks to a billion people year after year in every ICC event in the last decade. This time, however, it seems different. One can feel the hope in the air. This Rohit Sharma-led Indian team has been unstoppable. They have the best batters of the tournament, including Sharma and Virat Kohli. Five among their top seven batters average well over 50 with three striking above run-a-ball. All five — Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja — have taken more than ten wickets (three of them average less than 20), taking turns to win the Player of the Match awards. As a group, they have made a mockery of the term ‘contest’ outplaying every opponent, except one team. New Zealand. The Black Caps are the only team that got in their faces and made them work. Even though India beat them in the league stages, it did not come easy. That is why, the semifinal against New Zealand at Mumbai is poetic in more than one way. For starters, it is the team that has been India’s nemesis in world meets for a while — 2016 World T20 league game, 2019 WC semifinal, and 2021 World Test Championship final, 2021 World T20 league game. And it’s a team that has the resources to test this Indian team at this venue. The shorter boundaries and conditions will help New Zealand take on Indian spinners and they also have the seam attack to trouble the Indian top-order. The trophy drought of this Indian team is vastly talked and discussed about. India have not won an ICC trophy in ten years. In this decade, India entered two T20 WC semifinals, two ODI World Cup semifinals, a Champions Trophy, and two WTC finals. For a team that began its transition in the same year as they won their last ICC title, it is not all that bad. But lack of a trophy for the sports’ only financial behemoth is jarring. Not a champion unless you become one of the world. The players know it too. That could be why some of them, including Sharma, probably playing their last World Cup want to win the trophy badly. He said as much at the start of the event. While acknowledging that there is unfinished business and he is desperate to an extent to hold that trophy aloft come November 19, Sharma insisted on finding a balance. Sharma also mentioned the one thing that India hasn’t had in World Cup knockouts — luck. “Obviously we have to leave a lot of things to Almighty as well because we need that little bit of luck in the tournament. I hope we get that luck. But yeah, it will be nice to win a World Cup,” he had said in Chennai before the game against Australia. Two games away from making that dream come true, Sharma reflected on the league stage, saying that it is all about breaking down into parts and moving forward. “Nine games is a lot of games, literally two or three bilateral series. With different games and different venues, you have to break it down into different styles and strategies as well. I think we did that well. In the first half, we chased the first five games, and next four, we batted first. In terms of areas we wanted to cover, we have covered almost every bit of it. We do understand the importance of this week but for us, I don’t think we need to do anything different from what we have been doing in this tournament. There will be challenges. You just got to respond, front up, and get through that situation,” Sharma said on Tuesday before adding, “Now the time has come, you need a little bit of luck to go your way. Obviously, we are going to be brave enough. Hopefully, fortune will favour the brave.” The demons of the semifinal have chased India at ICC events for far too long now. On Wednesday, India have a chance to bury the demons at a venue where they conquered the world 12 years ago. This current crop has the ability to reach the first global white ball final since 2017. Will they? Only time will tell.","pubDate":"2023-11-15 01:14:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"57da931ea922a5b8a3a475786d18711d","title":"Freddie Flintoff set for first job since quitting Top Gear after traumatic car crash","link":"https://www.dailystar.co.uk/sport/other-sports/freddie-flintoff-new-job-cricket-31440224","keywords":["Sport"],"creator":null,"video_url":null,"description":"England cricket legend Freddie Flintoff is on the verge of landing a new job, 11 months on from the traumatic car crash which very nearly killed him","content":"Andrew 'Freddie' Flintoff is on the verge of a cricketing comeback after recovering from the horror car crash which forced him to quit . The 45-year-old is expected to be named head coach of Leeds-based team Northern Superchargers, marking his first proper return to the sport since his playing career ended in 2015. Flintoff has been inching his way back into public life following the traumatic crash that nearly claimed his life, which happened while he was filming for Top Gear in December last year. In recent months he's been acting as an unofficial mentor for England's cricket teams, but looks set to return to the game in an official capacity following the departure of Superchargers head coach James Foster last week. The franchise, who play 100-ball, finished dead last in the 2023 season, with five defeats in eight matches. According to , negotiations between Flintoff and the Superchargers could be wrapped up by the end of the week. It's also understood that the former all-rounder will be joined by ex-Lancashire team-mate Kyle Hogg, who is in talks to become the team's new assistant coach. Flintoff spent four years as co-host of the BBC's flagship motoring show, Top Gear. He joined in 2018 alongside Paddy McGuinness and Chris Harris in time for the start of the 27th season. In 2019 he suffered his first major crash while riding a head-first trike at 124 mph during one of the car show's signature competitions. He escaped relatively unscathed, but wasn't so lucky when he crashed for a second time three years later. He was airlifted to hospital after suffering numerous injuries in an accident at Dunsfold Park Aerodrome while driving an open-topped, three-wheeled car at 130 mph. The vehicle flipped and slid along the track, leaving Flintoff with severe facial injuries and broken ribs. He spent several weeks in hospital, and his length recovery left him in a \"dark place\" according to his family. The BBC, who paid Flintoff a £9million settlement, cancelled the rest of the series and announced they'd be re-assessing the show's safety precautions. The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . Flintoff bore some of the scars from the crash after being pictured for the first time since the accident attending an England training session in September. He later described his recovery as \"the hardest time of my life\".","pubDate":"2023-11-14 22:53:03","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31440331.ece/ALTERNATES/s98/0_England-v-New-Zealand-2nd-Metro-Bank-ODI.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"633048f45445cab18a8e9baf531dbd23","title":"Papers: Juventus ready to offer Man Utd escape route for Sancho","link":"https://www.skysports.com/football/news/20876/13008499/juventus-ready-to-offer-manchester-united-outcast-jadon-sancho-old-trafford-escape-route-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Wednesday's newspapers...","content":"All the top stories and transfer rumours from Wednesday's newspapers... DAILY MAIL Juventus are ready to offer Jadon Sancho an escape route from Manchester United in the January transfer window. Harry Kane reportedly has a special clause in his Bayern Munich contract that could see him earn an extra windfall on top of his wages. Andrew Flintoff will take the biggest step yet in his return to cricket when he becomes coach of the Northern Superchargers in next summer's Hundred. A funeral for Sir Bobby Charlton was held in Ghana on the same day as the Manchester United and England icon was laid to rest at his ceremony in England. The Cricket World Cup has been plunged into an astonishing row amid claims the Indian board have switched the pitch for their team's semi-final on Wednesday against New Zealand in Mumbai without the ICC's permission. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! THE TIMES Football's lawmakers are to consider trials of sin-bins for dissent in professional competitions and adopting rugby's rule where only the captain can approach the referee, as part of a drive to tackle misbehaviour. Tom Curry is battling a hip injury that could keep him out of action until Christmas in the latest setback of a difficult year for the England flanker. Please use Chrome browser for a more accessible video player Rory McIlroy has warned that even a deal between the PGA Tour and Saudi Public Investment Fund might not lead to peace in golf's enduring power struggle. Spectators at the ATP Finals in Turin were left incensed on Tuesday when the sudden retirement of Stefanos Tsitsipas after only three games was followed by a replacement exhibition set featuring an injured Taylor Fritz. DAILY TELEGRAPH Andrew Flintoff is expected to take over as head coach of the men's Northern Superchargers team in the Hundred in a landmark moment following his recovery from a devastating car crash. Newcastle United's controversial winner against Arsenal was allowed to stand because the VAR did not have enough camera angles to show whether the ball went out of play, newly released audio has confirmed. Please use Chrome browser for a more accessible video player Emma Hayes will become the highest-paid female coach in world football after being appointed as the new head coach of the United States women's national team on a £1.28m-a-year [$1.6m] contract - three times more than England's head coach Sarina Wiegman. World Rugby has become the first sports governing body to take action against fans responsible for extreme online abuse of referees by passing dossiers of evidence to law-enforcement and government agencies. Rory McIlroy is planning on moving back to the UK on a permanent basis, reversing the trend of British superstars upping sticks to sunnier, not to mention more tax-efficient climes. THE SUN Please use Chrome browser for a more accessible video player Former Arsenal star Alex Song has announced his retirement from football. The 36-year-old has called time on his career that saw him make 49 appearances for the Cameroon national team. But he has hung up his boots at Djibouti Premier League side Arta Solar 7. US billionaire Leon Cooperman has invested in Manchester United in an unexpected twist in the takeover saga. Brighton have slapped a British-record price tag on Evan Ferguson following his contract extension. Chris Kirkland has revealed he took the \"equivalent of six shots of heroin a day\" during a battle with addiction. DAILY MIRROR Please use Chrome browser for a more accessible video player Harry Kane has given Liverpool transfer target Leroy Sane a glowing endorsement ahead of the January transfer window. Sane has been identified as the Reds' primary target amid uncertainty over the future of Mohamed Salah. Please use Chrome browser for a more accessible video player Manchester United are increasingly resigned to losing Andre Onana to the Africa Cup of Nations early next year. David de Gea - who has been without a club since departing Manchester United - has been seen visiting second-tier Spanish side Eldense. Victor Osimhen admits he has Chelsea and Manchester United shirts in his wardrobe amid continued links with the Premier League. DAILY EXPRESS Please use Chrome browser for a more accessible video player Arsenal star Thomas Partey's injury is reportedly worse than first feared in a major blow to Mikel Arteta. Partey's campaign has been disrupted by two separate injuries with a fresh issue likely to keep him out for a lengthy period. Manchester United bidder Sir Jim Ratcliffe is reportedly set to demand that Erik ten Hag reaches an olive branch out to outcast winger Jadon Sancho. The United forward has been exiled from the Red Devils first-team squad since September after a falling-out with Ten Hag. THE GUARDIAN Please use Chrome browser for a more accessible video player Erling Haaland has been tipped to become the first footballer to earn £1bn. The Manchester City star's agent, Rafaela Pimenta, has claimed that he could generate earnings outside of his typical contract. The betting giant Bet365 has admitted the footballer Steven Caulker was dropped from work as a pundit on a series it sponsored because of his public statements about gambling. DAILY RECORD Michael O'Neill is backing Ross McCausland to make a major Northern Ireland impact after forging his way firmly into Philippe Clement's Rangers plans. Hearts gave announced a record turnover of £20.8m in their latest set of accounts. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-14 22:37:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a2d6e06ec10863026f5c6e377e3115ec","title":"Williamson confident New Zealand can end India’s World Cup dreams again","link":"https://www.nation.com.pk/15-Nov-2023/williamson-confident-new-zealand-can-end-india-s-world-cup-dreams-again","keywords":["Sports"],"creator":["Agencies"],"video_url":null,"description":"MUMBAI - New Zealand will approach their blockbuster World Cup semi-final against India with a clean slate and confidence in their ability to upstage the in-form hosts in Mumbai, skipper Kane Williamson said on Tuesday.","content":"MUMBAI - New Zealand will approach their blockbuster World Cup semi-final against India with a clean slate and confidence in their ability to upstage the in-form hosts in Mumbai, skipper Kane Williamson said on Tuesday. The Black Caps began the tournament with four straight wins but suffered the first of four successive defeats against Rohit Sharma’s side amid a period of injury issues, before booking a place in Wednesday’s semi-final with a late push. Williamson, who returned from knee surgery for the World Cup and recovered from a frac­tured finger during it, missed the loss to India but is expect­ing a similarly tough test from the hosts who went unbeaten in the group stage. “We know it’s going to be a really tough chal­lenge. They’re a side that’s been playing extremely well, but we also know come finals time ev­erything starts again and it’s all about the day,” Williamson told reporters. “So for us as a team it’s very much the focus on our cricket again. We’ve played good crick­et throughout. We’ve had a cou­ple of narrow losses and a few wins along the way which have put us in this position we’re in. “We’re excited about the chal­lenge ahead.” New Zealand dashed India’s hopes in the semi-finals of the 2019 edition and Williamson said he was not concerned that his side were still considered underdogs. “I don’t think it has changed too much, but that’s fine and India have been excep­tional,” Williamson said. “One of the, if not the best team going around and playing cricket that matches that. But we know as well, on our day when we play our best cricket it certainly gives us the best chance. And come finals time anything can happen.” Top-order batsman Rachin Ravindra filled the void left by Williamson during their cam­paign and has been a revelation with 565 runs to earn praise from the skipper. “It’s not just the volume of runs that he’s achieved so far but how he’s been scoring them and how it’s been geared towards try­ing to move the team forward,” Williamson said. “Some fantas­tic contributions and at such a young age. I’m sure we’ll see plenty more of it to come.” Replying to a query about the crowd during the semifinal, Williamson said: “We’re expect­ing a fairly blue crowd that will be supporting their team. “We remember over the years, a number of different crowds that we’ve had that haven’t always been your own fans. “We have got a small country that doesn’t always fill out the stadiums, but you still appreci­ate the atmosphere it brings. “Not many people get that op­portunity, cricket in India, play­ing against India in a World Cup semifinal, is special and something to appreciate and look forward to.”","pubDate":"2023-11-14 22:25:18","image_url":"https://www.nation.com.pk/print_images/large/2023-11-15/williamson-confident-new-zealand-can-end-india-s-world-cup-dreams-again-1700000714-9784.jpg","source_id":"nation_pk","source_priority":353644,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"df53d0b5d85a61213328357ed20a178f","title":"Sixers bowler recalled to Aussie team","link":"https://www.news.com.au/sport/cricket/sixers-bowler-recalled-to-aussie-team/video/0341975991f0cd3691f44e377a656108","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Cricket: Sydney Sixers bowler Lauren Cheatle has been recalled to the Australia tour of India.","content":null,"pubDate":"2023-11-14 20:45:16","image_url":null,"source_id":"news","source_priority":5133,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"724c8f7c3cdfbe3d71b29626f507abc8","title":"Grim weather could threaten Aussie final hopes","link":"https://www.news.com.au/sport/cricket/grim-weather-could-threaten-aussie-final-hopes/video/c50ecd4036777714669361698bb95bed","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Cricket World Cup: A bleak outlook for Australia's semi final, and back up day, could impact Australia's progression to the World Cup final!","content":null,"pubDate":"2023-11-14 20:36:20","image_url":null,"source_id":"news","source_priority":5133,"country":["australia"],"category":["sports"],"language":"english"}]}