{"newsArray":[{"title":"Men's T20 Cricket World Cup 2022: Fixtures, dates and TV schedule","link":"https://ca.sports.yahoo.com/news/mens-t20-cricket-world-cup-211923737.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-08-28 21:19:23","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Head coach Dravid recovers from COVID, joins Indian cricket team in Dubai","link":"https://kashmirreader.com/2022/08/29/head-coach-dravid-recovers-from-covid-joins-indian-cricket-team-in-dubai/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"DUBAI: Head coach Rahul Dravid has tested negative for COVID-19 and has joined the Indian team ahead of its much-awaited Asia Cup opener against Pakistan here on Sunday. Batting great Dravid, who had tested positive for the virus ahead of the team’s departure for the continental tournament in a routine test, has fully recovered from […]","content":"DUBAI: Head coach Rahul Dravid has tested negative for COVID-19 and has joined the Indian team ahead of its much-awaited Asia Cup opener against Pakistan here on Sunday. Batting great Dravid, who had tested positive for the virus ahead of the team’s departure for the continental tournament in a routine test, has fully recovered from the condition. “Team India Head Coach Rahul Dravid has tested negative for COVID-19 and has joined the team in Dubai. Interim coach, Mr VVS Laxman who was present with the team in Mr. Dravid’s absence, has returned to Bengaluru to oversee the India A programme,” the BCCI said in a statement. The former India skipper didn’t travel with the team after testing positive, forcing the board to name NCA head Laxman as India’s interim coach. Since returning positive in the test conducted on August 23, Dravid had been undergoing home isolation. Earlier, BCCI secretary Jay Shah released a statement where he stated that the Indian head coach had mild symptoms. “Team India Head Coach Rahul Dravid has tested positive for COVID-19 in a routine test conducted ahead of the team’s departure to the UAE for Asia Cup 2022. “Dravid is under the supervision of the BCCI Medical team and has mild symptoms. He will join the team once he returns with a negative COVID-19 report,” Shah had said in a release. —PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-08-28 20:02:26","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan fold to India’s bouncer barrage","link":"https://www.cairnspost.com.au/sport/cricket/pakistan-fold-to-indias-bouncer-barrage/video/3dbe0b43aafca44bc4bae768ad08b57e","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Pakistan's top order didn't have any answer for India's short ball tactics as they lost their opening five wickets to bouncers.","content":null,"pubDate":"2022-08-28 19:54:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pandya gets India home against Pakistan in EPIC chase","link":"https://www.cairnspost.com.au/sport/cricket/pandya-gets-india-home-against-pakistan-in-epic-chase/video/ace06b145158c47b6a12f236ba345492","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: An ice cool Hardik Pandya held his nerve to deliver India a tense five-wicket win over rivals Pakistan in the Asia Cup.","content":null,"pubDate":"2022-08-28 19:45:24","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"SBC vs DPR Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs, Player Stats, Pitch Report for Assam T20, Match 12","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/sbc-vs-dpr-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-player-stats-pitch-report-assam-match-12?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":"Subansiri Champs (SBC) will lock horns with Dihing Patkai Riders (DPR) in the 12th match of the Assam T20 at the Amingaon Cricket Ground in Guwahati on Monday, August 29. Ahead of the match, here's all you need to know about the SBC vs DPR Dream11 prediction , playing XIs and the pitch report for today's Match. Subansiri Champs are fourth in the standings, having won one out of their three matches. They faced a three-wicket defeat in their last match against Barak Bravehearts. Dihing Patkai Riders, on the other hand, are third in the points table, having won two out of their three matches. They lost their last match against Barak Bravehearts by 74 runs. The 12th match of the Assam T20 will be played on August 29 at the Amingaon Cricket Ground in Guwahati. The match is set to take place at 12:30 pm IST. The live score & commentary of the game can be followed in the Sportskeeda Live Score section. SBC vs DPR, Assam T20, Match 12 Date and Time: 29th August, 2022, 12:30 pm IST Venue: Amingaon Cricket Ground, Guwahati The track at the Amingaon Cricket Ground is a bowling-friendly one, which will primarily assist the pacers. The initial phase will be crucial for both the teams as the batters may be seen struggling to score runs. Two of the last three matches so far at this venue have been won by the side batting second. Matches won by batting first: 1 Matches won by bowling first: 2 Average first innings score: 122 Average second innings score: 98 Subansiri Champs: L-L-W Dihing Patkai Riders: L-W-W SBC Injury/Team News No major injury updates. SBC Probable Playing XI Sumit Ghadigaonkar (WK), Saahil Jain (C), Bishal Saha, Rabi Chetry, Protyush Bora, Abdul Ajij Khuraishi, Bishal Roy, Akash Chetri, Ranjit Mali, Mukhtar Hussain, Avinav Choudhury DPR Injury/Team News No major injury updates DPR Probable Playing XI Nasir Ullah (WK), Sandip Paul Mazumdar, Pradyaun Saikia, Nibir Deka, Vijay Gautam, Senglong Rongpi, Nipan Deka (C), Abir Chakraborty, Bikash Chetri, Darshan Rajbongshi, Reshab Dipak Top Wicketkeeper pick Nasir Ullah (3 matches, 45 runs, Strike Rate: 78.95) Ullah is a reliable batter and also a very skilled wicket-keeper who can help you fetch some valuable points with his glovework. He has scored 45 runs at a strike rate of 78.95 in three matches. Top Batter pick Pradyaun Saikia (3 matches, 57 runs, Strike Rate: 126.67) Saikia is an aggressive top-order batter who can prove to be a crucial pick for your fantasy team. He has scored 57 runs at a strike rate of 126.67 in three matches. Top All-rounder pick Abdul Ajij Khuraishi (3 matches, 54 runs and 2 wickets, Strike Rate: 142.11 and Economy Rate: 6.71) Khuraishi has made it into the dream in the last couple of matches with his all-round performances. He has scored 54 runs and also got two wickets in three matches. Top Bowler pick Bikash Chetry (3 matches, 7 wickets, Economy Rate: 4.50) Chetry can provide regular breakthroughs for the Riders in Monday's match. He has scalped seven wickets at an economy rate of 4.50 in three matches. Saahil Jain Jain should be the number one choice to lead your fantasy team in Monday's game as he has been in brilliant touch with the bat. He has scored 100 runs at a strike rate of 131.58 in three matches, while also picking up one wicket. Sumit Ghadigaonkar Ghadigaonkar can be a brilliant pick in your fantasy team because of his reliable batting and wicketkeeping skills. He has scored 66 runs at a strike rate of 108.20 in three matches. SBC vs DPR match expert tips Saahil Jain could prove to be a wise multiplier choice as he can contribute at a high level with both the bat and ball. SBC vs DPR Dream11 Fantasy Tip - Head to Head League Wicketkeepers: Sumit Ghadigaonkar, Nasir Ullah Batters: Saahil Jain, Nibir Deka, Pradyaun Saikia All-rounders: Abdul Ajij Khuraishi, Aman Chetry Bowlers: Ranjit Mali, Nipan Deka, Mukhtar Hussain, Bikash Chetry SBC vs DPR Dream11 Fantasy Tip - Grand League Wicketkeeper: Sumit Ghadigaonkar Batters: Saahil Jain, Bishal Saha, Pradyaun Saikia All-rounders: Abdul Ajij Khuraishi, Aman Chetry, Senglong Rongpi Bowlers: Ranjit Mali, Nipan Deka, Mukhtar Hussain, Abir Chakraborty Q. 0 votes so far","pubDate":"2022-08-28 19:28:31","image_url":"https://static.sportskeeda.com/editor/2022/08/a6ad8-16617108455765-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"“Well done on 100th Virat”: AB de Villiers congratulates Virat Kohli and team India as they defeat Pakistan in their first Asia Cup 2022 match","link":"https://thesportsrush.com/cricket-news-well-done-on-100th-virat-ab-de-villiers-congratulates-virat-kohli-and-team-india-as-they-defeat-pakistan-in-their-first-asia-cup-2022-match/","keywords":["Cricket","AB de Villiers","Asia Cup 2022","India","Pakistan","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"AB de Villiers congratulates Virat Kohli on winning his 100th T2o match in Indian colours versus Pakistan at the Dubai International Stadium. During the first ‘Group A’ match of the ongoing Asia Cup 2022 between India and Pakistan at the Dubai International Stadium, team India huffed-and-puffed to get the better of arch-rivals Pakistan, in what… The post “Well done on 100th Virat”: AB de Villiers congratulates Virat Kohli and team India as they defeat Pakistan in their first Asia Cup 2022 match appeared first on The SportsRush.","content":"AB de Villiers congratulates Virat Kohli on winning his 100th T2o match in Indian colours versus Pakistan at the Dubai International Stadium. During the first ‘Group A’ match of the ongoing Asia Cup 2022 between India and Pakistan at the Dubai International Stadium, team India huffed-and-puffed to get the better of arch-rivals Pakistan by 5 wickets, in what was an absolute humdinger of a match, going down to the wire. En route a rather modest target of 148 runs, team India were rocked back early on as KL Rahul got dismissed on a first-ball Duck off the first Over of the chase. Batting did seem to be challenging indeed, as both Rohit Sharma (12 off 18) and Virat Kohli (35 off 34) looked scratchy whilst their stay at the crease, although the latter did play a few exquisite shots to make the crowd stand up on their feet. With Suryakumar Yadav (18 off 18) back in the hut as well, a well-set Ravindra Jadeja (35 off 29), who was promoted up the order in the absence of Rishabh Pant, and all-rounder Hardik Pandya (33* off 17), with their match-winning fifth wicket partnership of 52 (29), paved the way for an Indian victory, with the latter hitting the winning Six. Requiring 59 runs for victory in the final six Overs, India chased the target down with two balls to spare. South African legendary batter AB de Villiers took to his social media handle, to congratulate Virat Kohli in particular for winning his 100th T20I match. Referring to the Dubai track today as a tricky one, de Villiers also congratulated team India in general, while terming the contest as the one between two ‘really good bowling sides’. Proper Cricket game that! Tricky wicket with two really good bowling attacks. Congrats India and well done on 100th Virat👏👏🎉 — AB de Villiers (@ABdeVilliers17) August 28, 2022 Earlier, a praiseworthy effort from the Indian pace bowling attack meant that Pakistan were skittled for 147 in 19.5 Overs. Bhuvneshwar Kumar (4-0-26-4) and Hardik Pandya (4-0-25-3) were the pick of the bowlers, as they deployed the short-pitched deliveries to dismiss almost whole of Pakistan’s top and middle order line-up. Pandya, was fittingly adjudged the ‘Player of the match’ for his brilliant all-round show in the contest.","pubDate":"2022-08-28 19:25:33","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“You SUPERSTAR”: Krunal Pandya claps for Hardik Pandya in jubilation as India beat Pakistan in Asia Cup 2022","link":"https://thesportsrush.com/cricket-news-you-superstar-krunal-pandya-claps-for-hardik-pandya-in-jubilation-as-india-beat-pakistan-in-asia-cup-2022/","keywords":["Cricket","asia cup","Asia Cup 2022","Hardik Pandya","India","Krunal Pandya","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Krunal Pandya claps for Hardik Pandya: The elder of the two Pandya brothers was watching the match from the stands tonight. India all-rounder Hardik Pandya has added another chapter to a book of comprising of his glorious match-winning performances at the highest level. Pandya’s supreme all-round show at the Dubai International Cricket Stadium tonight was… The post “You SUPERSTAR”: Krunal Pandya claps for Hardik Pandya in jubilation as India beat Pakistan in Asia Cup 2022 appeared first on The SportsRush.","content":"Krunal Pandya claps for Hardik Pandya: The elder of the two Pandya brothers was watching the match from the stands tonight. India all-rounder Hardik Pandya has added another chapter to a book of comprising of his glorious match-winning performances at the highest level. Pandya’s supreme all-round show at the Dubai International Cricket Stadium tonight was all the more special because it came in a high-profile Asia Cup 2022 clash against Pakistan. With India needing 19 runs off 10 balls in a 148-run chase, Pandya hit three fours off four Haris Rauf deliveries to reduce the equation to seven runs in the final over. Pakistan all-rounder Mohammad Nawaz conceding a run off the first three deliveries of the final over didn’t rattle Pandya as an assuring gesture towards non-striker Dinesh Karthik confirmed him being in control of the situation. Needing six off three, Pandya hit Nawaz for a flat six over long-on to register a 5-wicket victory. ALSO READ: Virender Sehwag heaps praise on Hardik Pandya for Dubai heroics Pandya, who scored 33* (17) with the help of four fours and a six at a strike rate of 194.11, had contributed significantly in the bowling department as well. Pandya’s bowling figures of 4-0-25-3 witnessed Pakistan losing three crucial wickets right before the commencement of the death overs earlier in the match. Krunal Pandya claps for Hardik Pandya in jubilation as India beat Pakistan in Asia Cup 2022 India all-rounder and Hardik’s elder brother Krunal Pandya was celebrating in jubilation as his younger brother managed to script a victory in a tight finish. Watching the match from the stands, Krunal took to his social media handles to hail Hardik by calling him a “superstar”. You SUPERSTAR What a game! What a player! @hardikpandya7 Well done pic.twitter.com/ajoAJKowKO — Krunal Pandya (@krunalpandya24) August 28, 2022 It is noteworthy that Hardik Pandya’s awe-inspiring performance in this match earned him a match award for the third time in his T20I career. Second such award for Pandya in as many months, it speaks highly of his recent form in international cricket. The post “You SUPERSTAR”: Krunal Pandya claps for Hardik Pandya in jubilation as India beat Pakistan in Asia Cup 2022 appeared first on The SportsRush.","pubDate":"2022-08-28 19:17:07","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Pandya&#039;s all-round show seals India&#039;s victory over Pakistan","link":"https://www.thestar.com.my/sport/cricket/2022/08/29/cricket-pandya039s-all-round-show-seals-india039s-victory-over-pakistan","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India all-rounder Hardik Pandya picked up three wickets and then smashed an unbeaten 33 to seal a five-wicket victory over arch-rivals Pakistan in a low-scoring thriller in the Asia Cup Twenty20 tournament in Dubai on Sunday. Read full story","content":"(Reuters) - India all-rounder Hardik Pandya picked up three wickets and then smashed an unbeaten 33 to seal a five-wicket victory over arch-rivals Pakistan in a low-scoring thriller in the Asia Cup Twenty20 tournament in Dubai on Sunday. Bhuvneshwar Kumar picked up four wickets, including the prized scalp of Babar Azam, while Pandya expertly used short-pitched deliveries in India's inspired fast-bowling display to help them skittle out Pakistan for 147. All Pakistan wickets fell to India's fast bowlers with Arshdeep Singh taking two and Avesh Khan picking up the remaining one. In reply, the Pakistan bowlers fought hard and took the match to the final over when Pandya hit a massive six to seal the victory with two balls to spare. With bilateral cricket remaining suspended between the bitter neighbours, India and Pakistan play each other only in multi-team tournaments with their rivalry now a rare but enticing occasion for fans worldwide. Pakistan came into the contest having mauled India by 10 wickets in a Twenty20 World Cup match at the same venue in October in their last meeting. It was India who landed the first blow when Bhuvneshwar dismissed Pakistan batting mainstay Babar for 10 in the third over with a sharp rising delivery after captain Rohit Sharma won the toss and opted to field. Pandya dismissed the big-hitting Iftikhar Ahmed for 28 and also sent back well-set opener Mohammad Rizwan, who made 43, and Khushdil Shah in the same over -- all through short-pitched deliveries. After Pandya scythed through the middle order, Bhuvneshwar returned for his second spell to clean up the Pakistan tail by dismissing Asif Ali, Shadab Khan and Naseem Shah. With fast bowler Shaheen Afridi, who made a big impact in their last win over India, missing due to injury, Pakistan's attack missed the firepower necessary to defend a low total and struggled in hot and humid conditions. Fast bowler Naseem, 19, gave Pakistan an ideal start by dismissing KL Rahul without scoring before Virat Kohli and Rohit steadied things for India with a stand of 49. Kohli, who is in the middle of a prolonged lean patch, was dropped at slip off Naseem before he had opened his scoring. He struggled for timing during his laboured 35 off 34 balls. India found themselves in a spot of bother when Kohli and Rohit both fell to left-arm spinner Mohammad Nawaz in successive overs. Ravindra Jadeja, who made 35, and Pandya rescued India with a 52-run stand for the fifth wicket to turn the contest in favour of the defending champions before Nawaz dismissed the former on the first delivery of the final over. Pandya's 17-ball knock was studded with four fours, including three in the penultimate over against seamer Haris Rauf, and the six over long-on against Nawaz. (Reporting by Sudipto Ganguly in Mumbai; editing by Toby Davis)","pubDate":"2022-08-28 18:58:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/29/1715796.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"“Sab kuchh main karega”: Virender Sehwag heaps praise on Hardik Pandya for his all-round performance to win India’s Asia Cup 2022 clash vs Pakistan","link":"https://thesportsrush.com/cricket-news-sab-kuchh-main-karega-virender-sehwag-heaps-praise-on-hardik-pandya-for-his-all-round-performance-to-win-indias-asia-cup-2022-clash-vs-pakistan/","keywords":["Cricket","Asia Cup 2022","Hardik Pandya","India","Pakistan","Virender Sehwag"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Virender Sehwag heaps praise on Hardik Pandya for his brilliant show with both bat and ball, as India defeat Pakistan in the opening match. Team India have prevailed against arch-rivals Pakistan in the first ‘Group A’ match of Asia Cup 2022 by 5 wickets, in what was an edge-of-a-seat thriller between the two sides after… The post “Sab kuchh main karega”: Virender Sehwag heaps praise on Hardik Pandya for his all-round performance to win India’s Asia Cup 2022 clash vs Pakistan appeared first on The SportsRush.","content":"Virender Sehwag heaps praise on Hardik Pandya for his brilliant show with both bat and ball, as India defeat Pakistan in the opening match. Team India have prevailed against arch-rivals Pakistan in the first ‘Group A’ match of Asia Cup 2022 by 5 wickets, in what was an edge-of-a-seat thriller between the two sides after quite a many recent clashes. A 52-run partnership off mere 29 deliveries for the fifth wicket between Hardik Pandya (33* off 17) and Ravindra Jadeja (35 off 29) was instrumental in India chasing the Pakistani total down with couple of balls to spare. En route a rather modest target of 148 runs, team India were handed a huge blow early on, as KL Rahul chopped the delivery by debutant Naseem Shah on to the stumps while facing his very first delivery. Both Rohit Sharma (12 off 18) and Virat Kohli (35 off 34) looked everything but assured and fluent during their respective stays at the crease, as the wicket continued to help the seamers, while also appearing to be a bit two-paced from the outside. Post both the star batters’ dismissal, India continued to play nearly at run-a-ball, while struggling to despatch the Pakistani bowlers for boundaries for most parts of their innings. With 59 runs required off the final six Overs, India just managed to keep up with the required run rate till the very end, as Hardik and Jadeja paved the way for an Indian victory with the former hitting the winning Six. Earlier, a praiseworthy effort from the Indian pace bowling attack meant that Pakistan were skittled for 147 in 19.5 Overs. Bhuvneshwar Kumar (4-0-26-4) and Hardik Pandya (4-0-25-3) were the pick of the bowlers, as they deployed the short-pitched deliveries to dismiss almost whole of Pakistan’s top and middle order line-up. Former India opening batter Virender Sehwag took to his social media handle to praise Hardik for his brilliant all-round performance, which fittingly earned him the ‘Player of the Match’ award. Sehwag also hailed the contributions made by Bhuvneshwar, Kohli, and Jadeja, as he exclaimed enjoying a close India-Pakistan game after a long time. Wow wow wow ! Fantastic Hardik Pandya. Sab kuchh main karega. Brilliant performance by Bhuvi, good hand by Jaddu and Kohli as well. Glad to see a close #INDvsPAK match after a long time. Mast maza aa gaya. pic.twitter.com/HLNrnLRpK8 — Virender Sehwag (@virendersehwag) August 28, 2022 For more Cricket-related news, click here .","pubDate":"2022-08-28 18:50:48","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Man of the Match India vs Pakistan today: Who is Man of the Match today Asia Cup 2022 match between IND and PAK in Dubai?","link":"https://thesportsrush.com/cricket-news-man-of-the-match-india-vs-pakistan-today-who-is-man-of-the-match-today-asia-cup-2022-match-between-ind-and-pak-in-dubai/","keywords":["Cricket","asia cup","Asia Cup 2022","Hardik Pandya","India","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Man of the Match India vs Pakistan: The Indian all-rounder won his third T20I match award at the Dubai International Cricket Stadium tonight. During the second match of Asia Cup 2022 between India and Pakistan in Dubai, India beat Pakistan by 5 wickets to earn a couple of points from their first match itself. Chasing… The post Man of the Match India vs Pakistan today: Who is Man of the Match today Asia Cup 2022 match between IND and PAK in Dubai? appeared first on The SportsRush.","content":"Man of the Match India vs Pakistan: The Indian all-rounder won his third T20I match award at the Dubai International Cricket Stadium tonight. During the second match of Asia Cup 2022 between India and Pakistan in Dubai, India beat Pakistan by 5 wickets to earn a couple of points from their first match itself. Chasing a 148-run target, India managed to secure a victory on the back of a match-winning 29-ball 51-run fifth wicket partnership between all-rounders Ravindra Jadeja (35) and Hardik Pandya (33*). Pakistan chipping in with wickets at regular intervals kept them in the match but it wasn’t to be eventually as Pandya hit four fours and a six at a strike rate of 194.11 to seal the chase with a couple of deliveries remaining in the match. Having hit three fours off Pakistan pacer Haris Rauf in the penultimate over to gain an advantage, Pandya hit all-rounder Mohammad Nawaz for a six when India needed six runs off three balls to win the match. India captain Rohit Sharma (12) electing to bowl after winning the toss worked in their favour as Pakistan were bundled out for 147 in 19.5 overs to put on display a lacklustre performance . Having picked wickets of top-order, middle-order and lower-order batters, India pacer Bhuvneshwar Kumar was the pick of their bowlers with figures of 4-0-26-4. In what was the first-ever instance of Indian pacers picking all the 10 wickets in a T20I, Kumar was well-assisted by Pandya and Arshdeep Singh who picked three and two wickets respectively. Pandya, who dismissed Iftikhar Ahmed (28), Mohammad Rizwan (43) and Khushdil Shah (2) for just 25 runs in his four-over spell, was a deserving candidate of the Player of the Match award tonight. Hardikkkk pandyaaaa 💥 — Mandeep Singh (@mandeeps12) August 28, 2022 “In bowling, it’s important to assess the situations and use your weapons. For me, bowling short and the hard lengths have been my strengths. It’s about using them well and asking the right questions to make the batters commit a mistake,” Pandya told the host broadcaster during the post-match presentation ceremony. “In a chase like this, you always plan over-by-over. I always knew that there is one young bowler and also one left-arm spinner. We only needed 7 off the last over but even if we needed 15, I’d have fancied myself. I know the bowler is under more pressure than me in the 20th over.”","pubDate":"2022-08-28 18:36:25","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"\"Superb Skill And Grit\": PM Modi Congratulates India Post Win Over Pak","link":"https://sports.ndtv.com/cricket/superb-skill-and-grit-pm-modi-congratulates-team-india-for-beating-pakistan-in-asia-cup-3295106","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup: Prime Minister Narendra Modi congratulated the Indian men's cricket team as they beat Pakistan by 5 wickets in a nail-biter in Dubai to start their Asia Cup campaign on a triumphant note.","content":null,"pubDate":"2022-08-28 18:31:44","image_url":"https://c.ndtvimg.com/2022-08/1fo9s77o_hardik-pandya-asia-cup_625x300_28_August_22.jpeg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022, IND vs PAK: Pakistan players are wearing black armbands, here's why","link":"https://www.indiatvnews.com/sports/cricket/asia-cup-2022-ind-vs-pak-pakistan-players-are-wearing-black-armbands-here-s-why-india-vs-pakistan-2022-08-28-803600","keywords":null,"creator":null,"video_url":null,"description":"In the high-voltage match between India and Pakistan, the Babar Azam-led team is seen wearing black armbands. The Pakistan Cricket Board had made an official statement regarding the reason behind players wearing the bands.","content":"In the high-voltage match between India and Pakistan, the -led team is seen wearing black armbands. The Pakistan Cricket Board had made an official statement regarding the reason behind players wearing the bands. In the match which is held in Dubai, the Pakistan cricketers are wearing black bands to show their support for the flood victims of their country. Earlier the Pakistan Cricket Board (PCB) had stated that the reason behind the Pakistani team wearing a black band is to show solidarity with the flood victims. Pakistani captain Babar Azam had also stated the victims in the press conference a day before the match. Azam, while talking to the media a day before launching his campaign for the Asia Cup 2022, appealed to the people of Pakistan to help the flood victims and pray for them. Babar had said that this is a difficult time for our country and the team is praying for the victims. Pakistan has been heavily hit by floods in the Khyber Pakhtunkhwa (KP), Balochistan, and Sindh provinces. Balochistan has also been cut off from the rest of the country as a result of the new downpour. According to reports from the local media of Pakistan, more than 30 million people have been affected by the floods. Thousands have also died there. India and Pakistan are present in Group A of the Asia Cup 2022 along with Hong Kong. After the first match on 28th August, there is a possibility of a match between India and Pakistan in Super-4 on 4 September. At the same time, both the teams are very strong and it is expected that these two arch-rivals will also face each other in the final on September 11.","pubDate":"2022-08-28 17:46:10","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Fair play’ – Zaman walks against India despite confusion","link":"https://www.cairnspost.com.au/sport/cricket/fair-play-zaman-walks-against-india-despite-confusion/video/361b6a22e1f6311e378cb98f4314d9f3","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Despite an uncertain appeal from the Indians, Pakistani batsman Fakhar Zaman decided to walk after edging a ball to the keeper.","content":null,"pubDate":"2022-08-28 17:36:21","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“This is fabulous”: Sanjay Manjrekar describes Virat Kohli four off Haris Rauf in Dubai T20I","link":"https://thesportsrush.com/cricket-news-this-is-fabulous-sanjay-manjrekar-describes-virat-kohli-four-off-haris-rauf-in-dubai-t20i/","keywords":["Cricket","Videos","asia cup","Asia Cup 2022","Haris Rauf","India","Pakistan","Sanjay Manjrekar","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sanjay Manjrekar describes Virat Kohli four: The former Indian captain played a couple of exquisite shots tonight. During the second match of Asia Cup 2022 between India and Pakistan in Dubai, former India captain Virat Kohli provided signs of finding form but failed to convert his start into a match-winning innings. Coming in to bat… The post “This is fabulous”: Sanjay Manjrekar describes Virat Kohli four off Haris Rauf in Dubai T20I appeared first on The SportsRush.","content":"Sanjay Manjrekar describes Virat Kohli four: The former Indian captain played a couple of exquisite shots tonight. During the second match of Asia Cup 2022 between India and Pakistan in Dubai, former India captain Virat Kohli provided signs of finding form but failed to convert his start into a match-winning innings. Coming in to bat at No. 3 in the first over itself, Kohli’s innings comprised of him riding on oodles of luck. For someone who has been unfortunate on several occasions in the recent past, Kohli was fortunate to have witnessed Fakhar Zaman dropping him at second slip on the second ball that he faced. With the Pakistan fast bowlers moving the new ball at will, Kohli played numerous unconvincing shots to survive despite the ball hitting the edges of his bat. In fact, Kohli’s solitary six of the night had also come via a top-edge. It was on the penultimate delivery of the second over when Kohli played his first scoring shot with confidence as a short Shahnawaz Dahani delivery was pulled with a stamp of authority through the mid-wicket region. On the second delivery of the sixth over, Kohli played the shot of the night bringing back his archetype short-arm jab. Facing Haris Rauf, Kohli hit a short delivery over mid-wicket with sheer domination. “This is fabulous,” former India batter Sanjay Manjrekar described Kohli’s boundary while calling the match for Star Sports Network. ❤️‍🔥❤️‍🔥 pic.twitter.com/s0aEja5vQ6 — . (@Vineeth_777) August 28, 2022 Just when India needed captain Rohit Sharma (12) and Kohli (35) to build on a 46-ball 49-run partnership for the second wicket, both the senior Indian batters got out in successive overs trying to play identical shots against the same bowler. Wanting to attack Pakistan all-rounder Mohammad Nawaz, both Sharma and Kohli ended up hitting the ball to Iftikhar Ahmed at long-off. Kohli, who hit three fours and a six at a strike rate of 102.94, repeating the same mistake as his captain put on display a disappointing sight in the form of his dismissal at the Dubai International Cricket Stadium.","pubDate":"2022-08-28 17:32:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Bilkul khelni chahidi hai”: Harbhajan Singh calls for India-Pakistan bilateral series on neutral venues despite political differences between the countries","link":"https://thesportsrush.com/cricket-news-bilkul-khelni-chahidi-hai-harbhajan-singh-calls-for-india-pakistan-bilateral-series-on-neutral-venues-despite-political-differences-between-the-countries-2/","keywords":["Cricket","Miscellaneous","Harbhajan Singh","India","Pakistan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Harbhajan Singh calls for India-Pakistan series on neutral venues in a bid to improve the political tensions between the two countries. Pakistan have been bundled up at a rather modest total of 147 in 19.5 Overs, in the ongoing opening ‘Group A’ match against their arch-rivals India at the Dubai International Stadium. The Indian pace… The post “Bilkul khelni chahidi hai”: Harbhajan Singh calls for India-Pakistan bilateral series on neutral venues despite political differences between the countries appeared first on The SportsRush.","content":"Harbhajan Singh calls for India-Pakistan series on neutral venues in a bid to improve the political tensions between the two countries. Pakistan have been bundled up at a rather modest total of 147 in 19.5 Overs, in the ongoing opening ‘Group A’ match against their arch-rivals India at the Dubai International Stadium. The Indian pace bowling unit, for the time ever in T20I history, managed to pick all the ten opposition wickets, as they deployed the short-pitched deliveries with good effect to dismiss at least five of their top and middle-order batters. The ongoing high-octane clash is the first international assignment between the two countries since the 2021 T20 World Cup, as since 2012-13, they haven’t faced each other in bilateral series due to the political differences. Ahead of the ongoing first match of the tournament between the two countries, former Indian off-spinner Harbhajan Singh called for a resumption in the India-Pakistan bilateral series, having last taken place in 2012-13 in a three-match each ODI and T20I series in India. Harbhajan seemed to be quite happy with the manner players from both the countries met each other wearing smiles on their faces, while also involving in friendly banter of sorts , and in particular the meet-up of the star batters Virat Kohli and Babar Azam. He opined that Cricket can bind and improve the relations between both the countries, and bilateral series should be conducted at neutral venues like Dubai, if not in India or Pakistan, as they presently just face each other during continental (Asia Cup) and global (ICC) tournaments. “Of course they (bilateral series) should take place. Relations will definitely improve once Cricketing action resumes between the two countries. I understand that the political tensions and differences presently have meant that teams cannot travel and play in each other’s soils, but a conduction of the same in the Dubai Stadium, or the some other neutral venue, will not only be good overall for the sport of Cricket, but also for both India and Pakistan,” remarked Harbhajan while interacting with the members of the press. پنجابی پتر اک دوجے نوں مل رے نے بہت ودیا اے @harbhajan_singh #PAKvIND pic.twitter.com/bLOh25V2Cz — Sohail Imran (@sohailimrangeo) August 28, 2022 For more Cricket-related news, click here.","pubDate":"2022-08-28 17:24:37","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Who is Naseem Shah? Pakistan pacer who cleaned up KL Rahul on T20I debut in IND vs PAK clash","link":"https://zeenews.india.com/cricket/ind-vs-pak-naseem-shah-to-make-t20i-debut-for-pakistan-in-asia-cup-2022-clash-vs-india-2502768.html","keywords":null,"creator":null,"video_url":null,"description":"Speaking about his T20I debut, Naseem Shah was heard saying on Pakistan Cricket's social media accounts that he is proud to be playing in all 3 formats for Pakistan.","content":"Pakistan's young pacer Naseem Shah will make his T20I debut today vs India in team's the opening clash of Asia Cup 2022 , Pakistan Cricket team announced on Twitter. Naseem recently made his ODI debut in the series vs Netherlands and was known for making an early impact with the new ball in the first spell of the innings. He made his internationak debut in a Test match vs Australia in Brisbane in 2019 and has played 13 Tests so far. He has picked a total of 33 wickets in Tests while he has 10 wickets in 3 ODIs he has played so far. __ \"Happy to represent Pakistan in all formats\" @iNaseemShah will be making his T20I debut today against India _ #AsiaCup2022 | #INDvPAK pic.twitter.com/cc9IDCEGhk — Pakistan Cricket (@TheRealPCB) August 28, 2022 In 27 first-class games, Naseem has scalped 84 wickets. Follow India vs Pakistan LIVE from Asia Cup 2022 here India openers need to watch out for him in his opening spell. He is known for making early impact via extra pace and bounce he extracts off the pitch. . @iNaseemShah - Pakistan's T20I player No.96 __ _ The young speedster is awarded his T20I debut cap _ #AsiaCup2022 | #INDvPAK pic.twitter.com/eOC3AqMJ3V — Pakistan Cricket (@TheRealPCB) August 28, 2022 Speaking about his T20I debut, the pacer was heard saying on Pakistan Cricket's social media accounts that he is proud to be playing in all 3 formats for Pakistan. \"I did well in my ODI debut series. This is a big match vs India but I will try and keep it normal and hopefully will perform better. This is my third format in international cricket. I had never played white-ball before and I am thankful to god that I am playing all 3 formats for Pakistan,\" said Naseem. Naseem will have an extra pressure on his shoulders in just the first T20I of his career as Pakistan will banking on him for wickets early on in absence of Shaheen Shah Afridi. Shaheen was one of the key architects of Pakistan's big win over India at the T20 World Cup last year. Haris Rauf, Naseem and other bowlers need to step up to ensure Shaheen's absence is not felt.","pubDate":"2022-08-28 16:21:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan Live Updates: KL Rahul Falls For Duck, Virat Kohli Dropped On Zero In Asia Cup Clash - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvaW5kaWEtdnMtcGFraXN0YW4tbGl2ZS1jcmlja2V0LXNjb3JlLWdyb3VwLWEtaW5kLXZzLXBhay1saXZlLXNjb3JlLXVwZGF0ZXMtMzI5Mzk1NdIBfmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvaW5kaWEtdnMtcGFraXN0YW4tbGl2ZS1jcmlja2V0LXNjb3JlLWdyb3VwLWEtaW5kLXZzLXBhay1saXZlLXNjb3JlLXVwZGF0ZXMtMzI5Mzk1NS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Pakistan Live Updates: KL Rahul Falls For Duck, Virat Kohli Dropped On Zero In Asia Cup Clash  NDTV SportsIndia vs Pakistan Live Score And Updates Of Asia Cup 2022 Live Telecast Channel In India, Hardik Pandya And Bhuvneshwar Kumar The Stars For India, Pakistan Set A Target Of 148 Runs For India, IND vs PAK Live Streaming In India: Asia Cup 2022 Live S  Cricket AddictorJammu and Kashmir police issues advisory ahead of Ind vs Pak match, details here  Zee NewsBettors too gear up ahead of India-Pakistan clash today  ThePrintAnswered: What should be India's ideal XI vs Pakistan?  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-08-28 16:18:37","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Hats off to Fakhar Zaman”: Sana Mir admires Fakhar Zaman for walking after edging the ball despite limited appeal from India in Dubai T20I","link":"https://thesportsrush.com/cricket-news-hats-off-to-fakhar-zaman-sana-mir-admires-fakhar-zaman-for-walking-after-edging-the-ball-despite-limited-appeal-from-india-in-dubai-t20i/","keywords":["Cricket","asia cup","Asia Cup 2022","Avesh Khan","dinesh karthik","Fakhar Zaman","India","Pakistan","Sana Mir"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sana Mir admires Fakhar Zaman for walking: The Pakistani batter didn’t even wait for the umpire’s decision before walking tonight. During the second match of Asia Cup 2022 between India and Pakistan in Dubai, Pakistan batter Fakhar Zaman couldn’t leave a mark with the bat in hand but ended up becoming a source of amazement… The post “Hats off to Fakhar Zaman”: Sana Mir admires Fakhar Zaman for walking after edging the ball despite limited appeal from India in Dubai T20I appeared first on The SportsRush.","content":"Sana Mir admires Fakhar Zaman for walking: The Pakistani batter didn’t even wait for the umpire’s decision before walking tonight. During the second match of Asia Cup 2022 between India and Pakistan in Dubai, Pakistan batter Fakhar Zaman couldn’t leave a mark with the bat in hand but ended up becoming a source of amazement because of his honesty. Coming in to bat at No. 3 in the third over, Zaman returned back to the pavilion on the penultimate delivery of the powerplay after scoring 10 (6) with the help of two fours. ALSO READ: Why are Pakistani cricketers wearing black armbands in this match? Wanting to cut a short delivery from India pacer Avesh Khan, Zaman ended up edging the ball behind the wickets to veteran India wicket-keeper Dinesh Karthik. Had it not been for a lot of extra bounce off the pitch, Zaman might have been successful in cutting the ball as per the original plan. Zaman caught the attention of fans across the world when he started to walk right after edging the ball. Zaman walking even before umpire Masudur Rahman raised his finger will be remembered as a quintessential “Spirit of Cricket” moment. Former Pakistan Women’s captain Sana Mir took to social media platform Twitter to speak highly of Zaman’s gesture at the Dubai International Cricket Stadium tonight. Mir appreciated how Zaman had the guts to walk back to the pavilion in a high-profile match such as this. Hats off to @FakharZamanLive for waking off after a nick in a loud stadium when no one heard it. How many would do that specially in such a high profile game? #PakVsInd #AsiaCup2022 — Sana Mir ثناء میر (@mir_sana05) August 28, 2022 A primary reason why Zaman is being praised by one and all is the fact that neither Avesh nor Karthik had appealed for a dismissal in real sense. Considering the electrifying atmosphere inside the stadium on a Sunday night, Indian cricketers not being able to hear a nick was quite understandable.","pubDate":"2022-08-28 15:42:19","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan Live Score Ball by Ball, Asia Cup, 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-pakistan-live-score-over-match-2-t20-11-15-updates-3294686","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Pakistan from Dubai International Cricket Stadium, Dubai. Check commentary and full scoreboard of the match.","content":"Follow the Asia Cup, 2022 live cricket score on Sports.NDTV.com . After 15.2 overs, Pakistan are 105/5. Get live score, ball by ball commentary and much more. Keep track of Asia Cup, 2022 today match between India and Pakistan. Everything related to India and Pakistan match will be available on Sports.NDTV.com . Stay updated with India vs Pakistan live score. Do check for India vs Pakistan scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (1 Run) 1 run. 14.5 overs (2 Runs) 2 runs. 14.4 overs (1 Run) The line is outside off now, slightly shorter now. Shadab Khan pushes it off the back foot towards sweeper cover for a single. 14.4 overs (1 Run) Wide! Back-to-back wides! Hardik Pandya errs in line once again as he serves this down leg, short in length as well. Shadab Khan misses his pull and a wide is called! 14.4 overs (1 Run) Wide! Hardik Pandya sticks to bowling the short ball, this time it's down the leg side. Wide given! Asif Ali is in at number 7. 14.3 overs (0 Run) OUT! TAKEN! Hardik Pandya has two wickets in this over and Pakistan have lost half their side now! Another back-of-a-length delivery, outside off. Khushdil Shah hangs back and tries to upper cut this towards third man. But the ball goes off the outer half and flies towards deep point. Ravindra Jadeja there, pouches it safely. He does not drop many! 14.2 overs (1 Run) Tight single! A length ball, around middle and leg. Shadab Khan taps it towards mid on and scampers across to the other end. Suryakumar Yadav there has a shy at the non-striker's end but he misses. A direct hit would have been curtains for Shadab Khan. Shadab Khan is the new man in. 14.1 overs (0 Run) OUT! CAUGHT! Hardik Pandya gets the big fish, Mohammad Rizwan! Hardik Pandya has his second wicket and India have their fourth! This is smart bowling from Hardik Pandya. He drops it short, around off. Mohammad Rizwan gets low and tries to ramp this over third man but he gets in an awkward position and does not time it well. Avesh Khan there runs forward and takes a good catch. Pakistan are in a spot of bother now! 13.6 overs (1 Run) On a length now, at 140 kph, around middle and leg. Mohammad Rizwan miscues his drive towards the off side for a single. Avesh Khan cuts that one out. 13.5 overs (0 Run) Pulls his length back now, outside off, at 136 clicks. Mohammad Rizwan shuffles across and tries to pull this one but he misses. A good follow-up delivery after being hit for a boundary. 13.4 overs (4 Runs) FOUR! A freebie from Avesh Khan and Mohammad Rizwan makes full use of it! A low full toss, outside off. Mohammad Rizwan drives it past mid off for a boundary. Much needed for Pakistan! 13.3 overs (1 Run) A good-length delivery, outside off, shaping away from the left-hander. Khushdil Shah taps it towards cover-point for a single. 13.2 overs (0 Run) Lovely ball! A length ball, angling away, outside off. Khushdil Shah leans to drive without any foot movement and he gets beaten on the outside edge. 13.1 overs (0 Run) On a length, around middle and off, at 137 clicks. Khushdil Shah pushes it back to the bowler. Avesh Khan (1-0-13-1) is brought back into the attack. 12.6 overs (2 Runs) Hardik Pandya drops it short now, around middle and off. Mohammad Rizwan swivels and pulls it towards the fielder at deep square leg. Two taken! 12.5 overs (0 Run) Hardik Pandya delivers a length ball, swinging in, around his thigh pad. Mohammad Rizwan works it away towards square leg. He wanted a single there, but he is sent back by his partner. 12.4 overs (1 Run) Slightly shorter now, angling into the left-hander, around middle and leg. Khushdil Shah tucks it towards square leg and takes a single. 12.3 overs (0 Run) A good-length delivery, angling in, around the leg pole. Khushdil Shah looks to flick this one but he misses and gets hit on his pads. A muted appeal there for LBW, but the umpire says no! 12.2 overs (0 Run) Hardik Pandya speeds in from over the wicket, and he serves a length ball, outside off. Khushdil Shah opes the face of the bat and guides it towards point for a single. Khushdil Shah is off the mark! Khushdil Shah is in next. 12.1 overs (0 Run) OUT! CAUGHT BEHIND! That dropped catch from Yuzvendra Chahal does not prove to be costly! Hardik Pandya comes back into the attack and strikes straightaway. he gets rid of Iftikhar Ahmed. A shorter ball, around middle and off. Iftikhar Ahmed looks to pull this one. But he manages to get a faint edge back to the keeper. Dinesh Karthik hops and pouches it safely. India have their third wicket! Hardik Pandya (2-0-15-0) is back on. 11.6 overs (1 Run) Yuzvendra Chahal ends his over with a fuller one, a loopy ball, around middle. Iftikhar Ahmed eases it down to long on for a single. He retains the strike. 11.5 overs (0 Run) DROPPED! A chance goes down! A low full toss, around off. Iftikhar Ahmed looks to go over cover but miscues his shot towards the bowler. Yuzvendra Chahal gets his hands on the ball, but he spills it out. An opportunity gone for India! Will this prove to be costly? 11.4 overs (6 Runs) SIX! KABOOM! Iftikhar Ahmed gets hold of this one! A fuller one, outside off, loopy as well. Iftikhar Ahmed gets down on his knee and dispatches this one over long on for a biggie. 11.3 overs (1 Run) Flights this one full, quicker at 96 clicks, around middle and off. Mohammad Rizwan dances down the pitch and strokes it down to long off for a single. 11.2 overs (1 Run) Another loopy ball, very full, around middle and leg. Iftikhar Ahmed knocks it down to long on and rotates the strike. 11.1 overs (2 Runs) Yuzvendra Chahal tosses this one up, serves it full, around middle. Iftikhar Ahmed heaves it wide of long on for a brace. 10.6 overs (1 Run) Ravindra Jadeja ends his over with a shorter ball, outside off. Iftikhar Ahmed stays in his crease and pushes it towards sweeper cover for a single. 10.5 overs (1 Run) Darting this on the pads now, fuller in length. Mohammad Rizwan prods forward and pushes it towards square leg. A single taken! 10.4 overs (0 Run) Flatter and quicker, outside off. Mohammad Rizwan rocks back, opens the face of the bat, and taps it towards the fielder at short third man. No run there! 10.3 overs (1 Run) Back of a length now, around middle. Iftikhar Ahmed pulls it towards deep mid-wicket for a single. 10.2 overs (1 Run) Tight single there! Tad fuller now, outside off. Mohammad Rizwan leans forward and taps it towards cover. Ravindra Jadeja runs towards the ball and has a shy at the non-striker's end but he misses. A single in the end. 10.1 overs (4 Runs) FOUR! In the gap! Nicely done! A shorter one, spinning away, outside off. Mohammad Rizwan hangs back and slashes it through point for a boundary.","pubDate":"2022-08-28 15:23:56","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637973168237466237.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Why are Pakistan wearing black armbands today vs India: Why are the cricketers wearing black armbands today 2022 Asia Cup?","link":"https://thesportsrush.com/cricket-news-why-are-pakistan-wearing-black-armbands-today-vs-india-why-are-the-cricketers-wearing-black-armbands-today-2022-asia-cup/","keywords":["Cricket","asia cup","Asia Cup 2022","India","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why are Pakistan wearing black armbands today: Pakistani cricketers have donning black armbands at the Dubai International Cricket Stadium. Pakistan captain Babar Azam (10) has become their first batter to get out in the second match of Asia Cup 2022 against India in Dubai tonight. An early breakthrough has come as a shot in the… The post Why are Pakistan wearing black armbands today vs India: Why are the cricketers wearing black armbands today 2022 Asia Cup? appeared first on The SportsRush.","content":"Why are Pakistan wearing black armbands today: Pakistani cricketers have donning black armbands at the Dubai International Cricket Stadium. Pakistan captain Babar Azam (10) has become their first batter to get out in the second match of Asia Cup 2022 against India in Dubai tonight. An early breakthrough has come as a shot in the arm for India captain Rohit Sharma’s decision of opting to bowl first after winning the toss. It all happened on the fourth delivery of the third over when Azam’s attempt of pulling India pacer Bhuvneshwar Kumar resulted in his dismissal. A strong puller of the ball otherwise, Azam was a tad bit late to execute the shot on this particular occasion. As a result, ended up top-edging the ball to Arshdeep Singh at short fine leg. Not averse to early wickets with the new ball, Kumar getting a wicket off a bouncer was surely something newer for the Indian fans. Azam, who looked good during his nine-ball stay until mis-timing a pull, had hit a glorious boundary each against Kumar and Arshdeep in the first two overs respectively. As most of you must have noted by now, Pakistani cricketers are wearing black armbands in this match becoming the second international team to do it today. It is worth mentioning that the same has been done to express solidarity with flood victims back home. A disastrous natural calamity in Pakistan has taken over 1,000 lives in the country. According to estimates of National Disaster Management Authority, Pakistan has already received three times the rainfall in 2022 than what is the national average. As a result, national emergency has been announced in the country. Multiple current and former Pakistani cricketers have taken to their social media handles to pray for the well-being of thousands of affected people due to this disastrous situation. Jab bhi hamare watane azeez per azmaish aayi hai, hamari qaum ne zinda hone ka saboot diya hai. This flood is disastrous but it has given us a chance to come together for Pakistan and help our brothers and sisters in need. Intezar na krain, aage berhain Pakistan k liye. 🇵🇰 🤲 — Muhammad Rizwan (@iMRizwanPak) August 27, 2022 A lot of eminent Pakistani personalities have also urged their countrymen including those living abroad to donate in a bid to aid the affected lives.","pubDate":"2022-08-28 14:45:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan Live Score Ball by Ball, Asia Cup, 2022 Live Cricket Score Of Today's Match on NDT.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvaW5kaWEtdnMtcGFraXN0YW4tbGl2ZS1zY29yZS1vdmVyLW1hdGNoLTItdDIwLTEtNS11cGRhdGVzLTMyOTQ0NjjSAW1odHRwczovL3Nwb3J0cy5uZHR2LmNvbS9hc2lhLWN1cC0yMDIyL2luZGlhLXZzLXBha2lzdGFuLWxpdmUtc2NvcmUtb3Zlci1tYXRjaC0yLXQyMC0xLTUtdXBkYXRlcy0zMjk0NDY4L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Pakistan Live Score Ball by Ball, Asia Cup, 2022 Live Cricket Score Of Today's Match on NDT..  NDTV SportsLIVE IND vs PAK, Asia Cup 2022 Updates: Fakhar-Babar Depart Inside Powerplay, Rizwan Key  India.comIndia vs Pakistan, Asia Cup 2022 Live Score Updates: Hardik Pandya bouncing out Pakistan in Dubai  The Indian ExpressMatch Preview - Pakistan vs India, Asia Cup 2022, 2nd Match, Group A  ESPNcricinfoJammu and Kashmir police issues advisory ahead of Ind vs Pak match, details here  Zee NewsView Full coverage on Google News","content":null,"pubDate":"2022-08-28 14:34:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"'Huge surprise': Gambhir slams Rohit for picking Karthik over Pant, Akram reacts - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiuwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9hLWJpZy1jYWxsLWhlLWlzLXRoZS1mdXR1cmUtb2YtaW5kaWFuLWNyaWNrZXQtZ2F1dGFtLWdhbWJoaXItd2FzaW0tYWtyYW0tc3VycHJpc2VkLWFzLXJvaGl0LXBpY2tzLWthcnRoaWstb3Zlci1wYW50LXZzLXBha2lzdGFuLTEwMTY2MTY5NjAxMjQzOC5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'Huge surprise': Gambhir slams Rohit for picking Karthik over Pant, Akram reacts  Hindustan TimesInd vs Pak: Twitter Reacts As Rishabh Pant Misses Out From India's Playing XI  Cricket Addictor'It's a big headache', but Pujara expects India to pick Pant ahead of Karthik  ESPNcricinfoRishabh Pant or Dinesh Karthik? Pujara explains who suits IND better vs PAK  Hindustan TimesIND vs PAK Asia Cup: Dinesh Karthik preferred over Rishabh Pant in Playing XI  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-08-28 14:25:54","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Gutted”: Liam Livingstone wishes luck to Birmingham Phoenix afte being ruled out of the Hundred 2022","link":"https://thesportsrush.com/cricket-news-gutted-liam-livingstone-wishes-luck-to-birmingham-phoenix-afte-being-ruled-out-of-the-hundred-2022/","keywords":["Cricket","Birmingham Phoenix","Liam Livingstone","The Hundred"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Liam Livingstone has been ruled out of the Hundred 2022 due to an ankle injury, and he has wished the side well for the tournament. The Hundred 2022 has reached its business end with just 5 league matches left in the tournament. Trent Rockets and London Spirit are at the top-2 spots, whereas Oval Invincibles… The post “Gutted”: Liam Livingstone wishes luck to Birmingham Phoenix afte being ruled out of the Hundred 2022 appeared first on The SportsRush.","content":"Liam Livingstone has been ruled out of the Hundred 2022 due to an ankle injury, and he has wished the side well for the tournament. The Hundred 2022 has reached its business end with just 5 league matches left in the tournament. Trent Rockets and London Spirit are at the top-2 spots, whereas Oval Invincibles are at the 3rd position, just hanging in the playoff places. Birmingham Phoenix have played one game less than the top-3 teams and if they can win their matches, they will be able to qualify for the playoffs. However, they have dealt a major blow in their pursuit. Birmingham’s star all-rounder Liam Livingstone has been ruled out of the tournament due to an injury. The Phoenix lost in the finals last year, and they would aim to win the tournament this year. Moeen Ali will now have a bigger role to play for the side. Birmingham Phoenix all-rounder Liam Livingstone has wished the side well to do well under his absence. He said that the Hundred is one of the tournaments that he loves playing in, and he is gutted to be missing it due to his injury. Livingstone said that he will do everything to be back on the cricket field. “Gutted to have been ruled out of The Hundred… a tournament I have loved playing in! I’ll be doing everything I can to be back out there ASAP! But for now I’ll be supporting Birmingham Phoenix from the side!,” Liam Livingstone tweeted. Gutted to have been ruled out of @thehundred … a tournament I have loved playing in! I’ll be doing everything I can to be back out there ASAP! But for now I’ll be supporting Birmingham Phoenix from the side! 🧡🧡 — Liam Livingstone (@liaml4893) August 28, 2022 Livingstone was having a great season with the bat in the hundred, where he scored 173 runs at a brilliant strike-rate of 145.37. He has scalped a wicket with the ball as well. The absence of Liam will definitely hurt the Phoenix side in the tournament. The English selectors will be concerned by the number of injuries the players are getting. Jos Buttler has also been ruled out of the tournament, who is the captain of England’s white-ball sides. The pace trio of Chris Jordan, Tymal Mills and Richard Gleeson is also injured, and Reece Topley has pulled out of the tournament as precaution.","pubDate":"2022-08-28 14:10:19","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan: Asia Cup, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-pakistan-live-score-over-match-2-t20-1-5-updates-3294468","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Pakistan from Dubai International Cricket Stadium, Dubai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-08-28 14:08:05","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637973122774529547.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Why is Rishabh Pant not playing today’s Asia Cup T20 between India and Pakistan in Dubai?","link":"https://thesportsrush.com/cricket-news-why-is-rishabh-pant-not-playing-todays-asia-cup-t20-between-india-and-pakistan-in-dubai/","keywords":["Cricket","asia cup","Asia Cup 2022","dinesh karthik","India","Pakistan","rishabh pant"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why is Rishabh Pant not playing today: India have made a brave call with respect to their combination tonight. During the second match of Asia Cup 2022 between India and Pakistan in Dubai, India captain Rohit Sharma has won the toss and chose to bowl. “Honestly, I don’t think the toss is that important. We… The post Why is Rishabh Pant not playing today’s Asia Cup T20 between India and Pakistan in Dubai? appeared first on The SportsRush.","content":"Why is Rishabh Pant not playing today: India have made a brave call with respect to their combination tonight. During the second match of Asia Cup 2022 between India and Pakistan in Dubai, India captain Rohit Sharma has won the toss and chose to bowl. “Honestly, I don’t think the toss is that important. We are just here to play good cricket. We’ve played here in the IPL. So, hopefully, the pitch will be good,” Sharma told the host broadcaster at the toss. Much like Sharma, his Pakistani counterpart in Babar Azam also wanted to bowl first to perhaps put India under pressure by picking early wickets at the Dubai International Cricket Stadium like last year. “We would have also been bowling first but this is not in our hands. We will look to make a big score and see,” Azam told the host broadcaster at the toss. Why is Rishabh Pant not playing today vs Pakistan in Dubai? Not known for taking brave decisions with respect to their T20I combination, India have surprised one and all by picking Dinesh Karthik over Rishabh Pant as their wicket-keeper batter tonight. This Indian lineup is such that only one out of Karthik or Pant would’ve played this match. With India opting for an outright finisher in Karthik, they don’t have any left-handed batter among their specialist batters now. In spite of his heroics in other formats, Pant hasn’t really proved his mettle in T20Is. The surprise element around his omission in this match is more because of his potential than performance. Meanwhile, Karthik would be expected to make the most of his opportunity. The onus lies on the 37-year old player now to justify this selection. “It was a tough call we had to take between playing Dinesh [Karthik] and Rishabh [Pant]. Rishabh sadly misses out,” Sharma added. Refraining from playing a third spinner, India have included all the three pacers of their squad in Bhuvneshwar Kumar, Arshdeep Singh and Avesh Khan. You always thought that India would play their best available XI for this match, and in picking Karthik over Pant, they have answered a big question #INDvPAK — Sambit Bal (@sambitbal) August 28, 2022 Pakistan, on the other hand, have handed a T20I debut to fast bowler Naseem Shah. While Haris Rauf was always expected to play this match, Shahnawaz Dahani has been picked ahead of Mohammad Hasnain as their third pacer. The post Why is Rishabh Pant not playing today’s Asia Cup T20 between India and Pakistan in Dubai? appeared first on The SportsRush.","pubDate":"2022-08-28 13:53:48","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Virat Kohli completes 100 T20Is, joins Ross Taylor in rare list in international cricket","link":"https://www.indiatoday.in/sports/asia-cup-2022/story/virat-kohli-completes-100-t20is-joins-ross-taylor-in-rare-list-in-international-cricket-1993641-2022-08-28?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"IND vs PAK: Virat Kohli completes 100 T20Is, sets new Indian record","content":null,"pubDate":"2022-08-28 13:44:26","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"India opt to field against Pakistan in Asia Cup","link":"https://www.tribuneindia.com/news/sports/india-opt-to-field-against-pakistan-in-asia-cup-426242","keywords":null,"creator":null,"video_url":null,"description":"Dubai, August 28 India won the toss and opted to field against Pakistan in their Asia Cup opener here on Sunday. Virat Kohli will be playing his 100th T20 International and is second player in world cricket after Ross Taylor to complete a century of international appearances. Dinesh Karthik was picked ahead of Rishabh Pant in the playing eleven while Avesh Khan was picked as third pacer alongside Arshdeep Singh and Bhuvneshwar Kumar. Pakistan pacer Naseem Shah will be making his T20I debut. Teams: India: Rohit Sharma (captain), KL Rahul, Virat Kohli, Suryakumar Yadav, Dinesh Karthik, Hardik Pandya, Ravindra Jadeja, Bhuvneshwar Kumar, Avesh Khan, Yuzvendra Chahal, Arshdeep Singh. Pakistan: Babar Azamcopy;, Mohammad Rizwan, Fakhar Zaman, Iftikhar Ahmed, Khushdil Shah, Asif Ali, Shadab Khan, Mohammad Nawaz, Naseem Shah, Haris Rauf, Shahnawaz Dahani.","content":"PTI Dubai, August 28 India won the toss and opted to field against Pakistan in their Asia Cup opener here on Sunday. Virat Kohli will be playing his 100th T20 International and is second player in world cricket after Ross Taylor to complete a century of international appearances. Dinesh Karthik was picked ahead of Rishabh Pant in the playing eleven while Avesh Khan was picked as third pacer alongside Arshdeep Singh and Bhuvneshwar Kumar. Pakistan pacer Naseem Shah will be making his T20I debut. Teams: India: Rohit Sharma (captain), KL Rahul, Virat Kohli, Suryakumar Yadav, Dinesh Karthik, Hardik Pandya, Ravindra Jadeja, Bhuvneshwar Kumar, Avesh Khan, Yuzvendra Chahal, Arshdeep Singh. Pakistan: Babar Azam©, Mohammad Rizwan, Fakhar Zaman, Iftikhar Ahmed, Khushdil Shah, Asif Ali, Shadab Khan, Mohammad Nawaz, Naseem Shah, Haris Rauf, Shahnawaz Dahani.","pubDate":"2022-08-28 13:38:12","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_1543338228.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Ahead of IND vs PAK Asia Cup 2022 clash, Jasprit Bumrah speaks up, says 'looking forward to..'","link":"https://zeenews.india.com/cricket/ahead-of-ind-vs-pak-asia-cup-2022-clash-jasprit-bumrah-speaks-up-says-looking-forward-to-2502781.html","keywords":null,"creator":null,"video_url":null,"description":"Big game for Kohli as well. Apart from Sunday's match marking Kohli's return to international cricket action after the tour of England ended on July 17, it will also see him become only the second men's player after New Zealand`s Ross Taylor to clock 100 appearances in all three formats of international cricket.","content":null,"pubDate":"2022-08-28 13:20:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Babar Azam vs India in T20 runs: Babar Azam vs Bhuvneshwar Kumar T20 head to head record","link":"https://thesportsrush.com/cricket-news-babar-azam-vs-india-in-t20-runs-babar-azam-vs-bhuvneshwar-kumar-t20-head-to-head-record/","keywords":["Cricket","asia cup","Asia Cup 2022","babar azam","Bhuvneshwar Kumar","India","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Babar Azam vs India in T20 runs: The Pakistani captain will be playing only his second T20I against India. Pakistan captain Babar Azam has brushed aside all the ballyhoo ahead of the second Asia Cup 2022 match against India in Dubai tonight. With his feet on the ground ahead of what is perceived to be… The post Babar Azam vs India in T20 runs: Babar Azam vs Bhuvneshwar Kumar T20 head to head record appeared first on The SportsRush.","content":"Babar Azam vs India in T20 runs: The Pakistani captain will be playing only his second T20I against India. Pakistan captain Babar Azam has brushed aside all the ballyhoo ahead of the second Asia Cup 2022 match against India in Dubai tonight. With his feet on the ground ahead of what is perceived to be a high-profile clash, Azam trusted their preparations without wanting to dwell too much about their victory against India in the ICC T20 World Cup at the same venue last year. Labeling the match as a “new fixture”, Azam didn’t hint at relying on past achievements. “I know there is tremendous excitement in both the countries but for us, it is just another game. Our preparations have been excellent and we will take the field oozing with confidence,” Azam said in an official statement published by the PCB (Pakistan Cricket Board). ALSO READ: India vs Pakistan Head to Head record in T20Is “Our victory over India 11 months ago at the same venue is a good reference point, but that’s all. While we will continue to reflect on it positively, Sunday and any other matches down the line will be new fixtures that will be played in new conditions.” Azam, 27, was one of the reasons why Pakistan beat India in their last encounter at the Dubai International Cricket Stadium. A 152-run opening partnership alongside wicket-keeper batter Mohammad Rizwan had witnessed Pakistan beating India in the shortest format after nine years. In what remains Azam’s only T20I against India, he had scored a match-winning 68* (52) with the help of six fours and two sixes. Good luck to the #KingsofPakistan against #India in #AsiaCup2022 . We wish that our #Shaheens will rise again! #YehHaiKarachi #PakvsInd #AsiaCup #Cricket #T20 #Bestofluck @Salman_ARY pic.twitter.com/hmZaZXynC1 — Karachi Kings (@KarachiKingsARY) August 28, 2022 Before that match, the last when an India-Pakistan T20I had happened was during ICC World Twenty20 2016 in Kolkata. While Azam had made his ODI debut in the previous year, his T20I debut had happened later that year. Slated to open the batting alongside Rizwan in this match as well, Azam will have to counter a challenge presented by India pacer Bhuvneshwar Kumar. In their previous encounter against each other, Azam had scored 6 (6) against Kumar without any boundary.","pubDate":"2022-08-28 13:02:30","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Green takes 5 wickets as Zimbabwe post 200","link":"https://www.cairnspost.com.au/sport/cricket/green-takes-5-wickets-as-zimbabwe-post-200/video/d0001059b9a8963cd0ce772cec459869","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: A five-wicket haul from all-rounder Cameron Green has helped Australia take a comfortable win over Zimbabwe on their first ODI at Townsville.","content":null,"pubDate":"2022-08-28 12:36:22","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"}]}