{"newsArray":[{"title":"Hawthorn skipper James Sicily apologies for comments made about Tasmania getting an AFL license","link":"https://7news.com.au/sport/rugby-league/hawthorn-skipper-issues-swift-public-statement-after-copping-furious-backlash-from-tasmania-comments-c-10469368","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"James Sicily was forced to walk back his inflammatory comments just hours after he made them.","content":"captain James Sicily has made a swift backflip on some inflammatory comments he made about the state in which his club plays four home games per year. With a Tasmanian team all but set to be confirmed in coming days from the federal government, Sicily, who has played 22 of his 121 games in the Apple Isle, took an extraordinary swipe at the state following their three-point loss to Adelaide in Launceston at the weekend. Watch the latest sport on Channel 7 or stream for free on That funding boost is set to be and has paved the way to build a state-of-the-art stadium to house the competition’s 19th side. And while those in the state and at AFL House are about to celebrate, Sicily delivered a stinging backhander to the state when asked about its potential, or lack thereof, to attract talent. “I think so, particularly as a young guy, because there’s not much happening down there, it could be difficult,” he told RSN. “I couldn’t imagine myself living there. It would be hard.” Sicily’s comments immediately made headlines around the country, with Tasmanian greats like former Carlton and Brisbane midfielder Mitch Robinson, and Australian cricketer Matthew Wade, taking aim at him for them. “I’m sure sponsors love hearing that, considering Tassie pumps $13.5 million into a club that’s currently on struggle street,” Robinson said. “Tassie people have been fighting years for the chance to get an AFL team. Comments like this do not help us working towards our chance at showing just how good our little state is and will be with our own team,” Wade added. But the Hawks skipper quickly retracted his comments in a statement issued on Wednesday night. “I want to apologise to anyone I have offended or upset about my comments on Tasmania today,” he wrote. “The comments I made on RSN were flippant, and do not reflect my views of Tasmania. “What I said related to my personal situation, that throughout my career, my attachment to Melbourne would have made it hard to live in Tassie full time. “That’s not to say there are not many AFL footballers who would enjoy living there. “I love coming down to Tassie to stay and play, I visit Tassie yearly outside of football to enjoy its golf courses and food. “I’m proud of our long term relationship with the state and I continue to support Tasmania getting its own team.” St Kilda coach Ross Lyon is concerned about stars leaving for the expansion club. “I hope they don’t leave the Saints, I hope they leave the Cats,” Lyon said. “Look, expansion teams are always challenging, I haven’t really got my head around (it). “I think it goes up and down, yesterday it was off, today it’s on, so until we get it officially, until it gets edited and stamped through parliament, we won’t worry about it.” Prime Minister Anthony Albanese will reportedly announce the new funding in Hobart this weekend ahead of the May budget. The Tasmanian government is contributing $375m to the Macquarie Point stadium, with the AFL adding $15m in addition to providing long-term funding to support the club as it does to existing teams. The stadium will be a feather in the cap for AFL chief executive Gillon McLachlan, who announced one year ago that he would retire from his post but has stayed on in part to settle Tasmania’s bid. -","pubDate":"2023-04-26 22:06:16","image_url":"https://images.7news.com.au/publication/C-10469368/5833dee572cf0c12b03bcc9da462a6ab89b52133-16x9-x0y0w1280h720.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"इंग्लैंड क्रिकेट टीम ने नई T20I जर्सी का खुलासा किया","link":"https://jantaserishta.com/sports/england-cricket-team-unveils-new-t20i-jersey-2270177","keywords":["खेल"],"creator":["Rani Sahu"],"video_url":null,"description":null,"content":"लंदन (एएनआई): इंग्लैंड क्रिकेट टीम ने अपनी पुरुष और महिला सीनियर टीमों और विशेष रूप से सक्षम टीमों के लिए अपनी नई टी20ई जर्सी पेश की। इंग्लैंड क्रिकेट ने घोषणा करने के लिए ट्विटर का सहारा लिया। इंग्लैंड क्रिकेट ने ट्वीट किया, \"पेश है हमारा नया इंग्लैंड IT20 किट। हमारे इंग्लैंड के पुरुषों, महिलाओं और विकलांग टीमों द्वारा पहना जाने वाला। अपने खेल में शीर्ष पर रहें। #BetterNeverStops।\" विशेष रूप से, इंग्लैंड ICC T20 विश्व कप में गत चैंपियन है, जिसने पिछले साल फाइनल में पाकिस्तान को पांच विकेट से हराया था। यह उनका दूसरा टी20 विश्व कप खिताब है। इंग्लैंड की अगली अंतरराष्ट्रीय सीरीज 1 जून से घर में आयरलैंड के खिलाफ टेस्ट होगी। उसके बाद, इंग्लैंड 16 जून से घर में ऑस्ट्रेलिया के खिलाफ प्रतिष्ठित एशेज श्रृंखला लड़ेगा। (एएनआई)","pubDate":"2023-04-26 15:33:44","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Skipper Dimuth Karunaratne equals SL record, scores second ton in series against Ireland during 2nd Test","link":"https://thenewsmill.com/2023/04/skipper-dimuth-karunaratne-equals-sl-record-scores-second-ton-in-series-against-ireland-during-2nd-test/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Sri Lankan skipper Dimuth Karunaratne compiled a century on day three in Galle to make his 16th Test hundred and second in the ongoing two-match series against Ireland. Karunaratne, who had made 179 in the first Test at the same venue last week, stitched a 228-run opening stand with Nishan Madushka and made his 16th Test hundred in the process. The left-handed batter equalled the record for most Test hundreds as an opener among Sri Lankan players. He equalled Marvan Atapattu’s record of 16 Test tons with this knock. Besides Karunaratne and Atapattu, Sanath Jayasuriya (13 hundreds as opener) is the only Sri Lankan opener with more than ten Test hundreds. Madushka, meanwhile, became the 19th Sri Lankan opener to notch up a Test hundred and is unbeaten on 149 when rain forced early stumps on day three. Karunaratne is Sri Lanka’s fifth-highest run-getter in Test cricket with 6,524 runs at an average of 41.29. No other Sri Lankan opener has more runs than him in the longest format of the game. He was in good form in the ICC World Test Championship 2021-23 cycle for Sri Lanka, making 1,054 runs at an average of 47.90 with two hundreds. He was the third-highest run-getter among openers in this cycle of the WTC. The skipper has carried that form into the bilateral series, making back-to-back Test hundreds. At stumps on day three, Sri Lanka are trailing Ireland by 135 runs, but has lost just Karunaratne’s wicket with Madushka unbeaten on 149 and Kusal Mendis (83*) closing in a Test hundred. Sri Lanka lead 1-0 in the two-match Test series. Earlier in their first innings, Ireland was bundled out for 492 runs in 145.3 overs. Curtis Campher (111) and Paul Stirling (103) notched centuries for the visitors while skipper Andy Balbirnie (95) and wicket-keeper-batter Lorcan Tucker (80) fell short of their individual records. Prabath Jayasuriya (5/174) was the pick of the bowlers for Sri Lanka. Sri Lanka: 357/1 (Nishan Madushka 149, Dimuth Karunaratne 115, Curtis Campher 1/47) against Ireland: 492 (ANI).","pubDate":"2023-04-26 15:31:37","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Injured Kane Williamson could travel to India for World Cup as team mentor","link":"https://indianexpress.com/article/sports/cricket/injured-kane-williamson-could-travel-to-india-for-world-cup-as-team-mentor-8577804/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-04-26 14:36:54","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Quit international cricket: IPL franchises sound out 6 English players with multi-million pound deal","link":"https://www.tribuneindia.com/news/sports/quit-international-cricket-ipl-franchises-sound-out-6-english-players-with-multi-million-pound-deal-501222","keywords":null,"creator":null,"video_url":null,"description":"London, April 26Owners of top IPL franchises are trying to convince as many as six premier England players to quit international cricket and take up handsome annual contracts ranging up to 5 million pounds in order to play T20 leagues round the year, the 'Times London' reported.Almost all the 10 IPL franchises have branched out in various leagues, including CPL (West Indies), SA T20 (South Africa), Global T20 League (UAE) and the upcoming Major League T20 in the US.The report, however, doesn't state which are the franchise that have approached and who are the players involved in the discussion.There will also be an ambitious Saudi T20 league where some of the IPL franchises might be investing.'The Times' report quotes: \"Initial discussions have taken place after at least six English players, including some international stars, were approached by IPL franchise owners and asked whether, in principle, they would accept a deal that would make an Indian team their main employer, rather than the ECB or an English county.\" \"This development follows discussions among players' unions around the world about the potential implications of 12-month franchise contracts, which would be a significant step towards the football model of elite players being primarily contracted to their team and released for international duty, rather than the other way around.\"One source told The Times that contract offers could come as soon as the end of the year.\" There is no doubt that T20 cricket is here to stay and T10 is also fast catching the imagination of the public.While ICC has always thought about putting a cap on the number of leagues that an active contracted player can take part in a year, one can't rule out a possibility of a lot of young players either retiring from international cricket or giving up on central contracts to become free agents. The only hurdle in such a scenario could be 'NOC' from the respective country's cricket board.\"The probability of such a model being adopted has grown increasingly likely in recent years as some IPL franchise owners have bought stakes in several T20 tournaments in the UAE, South Africa, Caribbean — and now the United States with the new Major League Cricket venture which begins in July,\" the newspaper was quoted as saying.The paper also claimed that a discussion on similar lines took place with star Australian T20 specialists also.\"Discussions have already taken place with a number of high-profile Australian players about full-time deals but this has now been extended to English players. Contracts could be worth upwards of GBP 2 million a year and even as high as GBP 5 million — more than five times the value of the highest England central contracts.\"The paper also spoke about the possibility of having partial contracts both with ECB or county and the IPL franchise, especially, the ones who play white-ball cricket.\"Reduced IPL deals — covering at least three of the rounds — would also be on offer. It is unlikely that any of England's Test stars will walk away from their central contracts in favour of a franchise contract but the sheer amount of money on offer makes that a risk in the future.\"What is more likely is that players will arrange \"bespoke\" deals depending on their own circumstances, which could result in them being part-contracted to their county or the ECB and part-contracted to a franchise.\"","content":"PTI London, April 26 Owners of top IPL franchises are trying to convince as many as six premier England players to quit international cricket and take up handsome annual contracts ranging up to 5 million pounds in order to play T20 leagues round the year, the ‘Times London’ reported. Almost all the 10 IPL franchises have branched out in various leagues, including CPL (West Indies), SA T20 (South Africa), Global T20 League (UAE) and the upcoming Major League T20 in the US. The report, however, doesn’t state which are the franchise that have approached and who are the players involved in the discussion. There will also be an ambitious Saudi T20 league where some of the IPL franchises might be investing. ‘The Times’ report quotes: “Initial discussions have taken place after at least six English players, including some international stars, were approached by IPL franchise owners and asked whether, in principle, they would accept a deal that would make an Indian team their main employer, rather than the ECB or an English county.” “This development follows discussions among players’ unions around the world about the potential implications of 12-month franchise contracts, which would be a significant step towards the football model of elite players being primarily contracted to their team and released for international duty, rather than the other way around. “One source told The Times that contract offers could come as soon as the end of the year.” There is no doubt that T20 cricket is here to stay and T10 is also fast catching the imagination of the public. While ICC has always thought about putting a cap on the number of leagues that an active contracted player can take part in a year, one can’t rule out a possibility of a lot of young players either retiring from international cricket or giving up on central contracts to become free agents. The only hurdle in such a scenario could be ‘NOC’ from the respective country’s cricket board. “The probability of such a model being adopted has grown increasingly likely in recent years as some IPL franchise owners have bought stakes in several T20 tournaments in the UAE, South Africa, Caribbean — and now the United States with the new Major League Cricket venture which begins in July,” the newspaper was quoted as saying. The paper also claimed that a discussion on similar lines took place with star Australian T20 specialists also. “Discussions have already taken place with a number of high-profile Australian players about full-time deals but this has now been extended to English players. Contracts could be worth upwards of GBP 2 million a year and even as high as GBP 5 million — more than five times the value of the highest England central contracts.” The paper also spoke about the possibility of having partial contracts both with ECB or county and the IPL franchise, especially, the ones who play white-ball cricket. “Reduced IPL deals — covering at least three of the rounds — would also be on offer. It is unlikely that any of England’s Test stars will walk away from their central contracts in favour of a franchise contract but the sheer amount of money on offer makes that a risk in the future. “What is more likely is that players will arrange “bespoke” deals depending on their own circumstances, which could result in them being part-contracted to their county or the ECB and part-contracted to a franchise.”","pubDate":"2023-04-26 14:34:55","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/4/2023_4$largeimg_1321485250.jpg","source_id":"tribuneindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Women&#8217;s Super Series fixtures and squads released","link":"https://www.cricketireland.ie/news/article/womens-super-series-fixtures-and-squads-released","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN – Cricket Ireland has today announced the fixture schedule and squads for the Super Series, Ireland’s premier domestic women’s cricket competition.","content":"The Super Series features three representative teams - the Dragons, Scorchers and Typhoons – competing for the Super 50 Cup and the Super T20 Trophy [50-over and 20-over competitions respectively]. Key features of this year’s edition include: Growing the game: Five matches will be played in Northern Ireland this year, continuing Cricket Ireland’s ambition to grow the profile and accessibility of the women’s game in the North. Leadership: Irish internationals’ Rebecca Stokell (Typhoons), Gaby Lewis (Scorchers) and Leah Paul (Dragons) will captain the teams. Coaching: James Cameron-Dow and Paul Davidge remain head coaches of the Dragons and Typhoons respectively. The Scorchers will have a new head coach for 2023 after Glenn Querl moved to a full-time role with the Ireland Women’s senior and pathway set-up – the announcement on the new coach will be made shortly. Growing the profile: Cricket Ireland, in partnership with HBV Studios, will once again provide livestreaming of every match in the competition (over 1 million views) Improving the quality: two overseas players will be added to each squad (announced shortly) to enhance the quality and depth of the competition’s talent Gaby Lewis (capt) (YMCA), Aimee Maguire (The Hills), Anna Kerrison (Pembroke), Annabel Squires (Merrion), Christina Coulter Reilly (Clontarf), Ellie McGee (Rush), Genevieve Morrissey (Clontarf), Hannah Little (Pembroke), Isabelle McLean (The Hills), Jane Maguire (The Hills), Jenny Sparrow (Leinster), Julie McNally (Clontarf), Lara Maritz (Balbriggan), Niamh MacNulty (Merrion), Shauna Kavanagh (WK) (Pembroke), Siúin Woods (YMCA), Sophie MacMahon (Leinster). Scorchers captain Gaby Lewis said: “Preparations have been going really well - we started pretty early as a team, which has been great. While I’ve been away at the Fairbreak Invitational, vice-captain Sophie MacMahon has been leading the group and has kept me in the loop. As back-to-back double winners, we’re definitely there to be shot at. Year-on-year the competitiveness of the Super Series has improved – this year should be no different. “It’s great to see the new players coming through. I think that was the benefit of the Under-19 World Cup to see those players really shine under pressure, and it’s great to have that there. Competition for places in the team will be intense – and that will only drive standards higher still. “As a platform for international honours, the Super Series has shown its worth in recent years. A good season, playing well in the Super Series, can change everything. It’s obviously a step down from international level, but if you do well, the next thing is a senior call up, so it’s very exciting to have those opportunities for the girls as well.” Leah Paul (capt) (Merrion), Abbi Harrison (Waringstown), Alana Dalzell (Bready), Amy Caulfield (Muckamore), Amy Hunter (WK) (Malahide/Instonians), Aoife Fisher (CSNI), Arlene Kelly (Malahide), Cara Murray (Saintfield/Waringstown/Clontarf), Jemma Gillan (CSNI), Jenni Jackson (Eginton), Jess Mayes (CSNI), Kate McEvoy (YMCA), Kia McCartney (Coleraine), Mollie Devine (Fox Lodge), Orla Prendergast (Pembroke), Zara Craig (Eglinton). Dragons head coach James Cameron-Dow said: “I’m obviously looking forward to the season, especially in our second season since our return to the competition. Hopefully, we’ll be able to build on some of the things that we did last year and a few processes that we are trying to put in place. It’s been difficult in the winter with the dynamics of the squad, everyone coming from all over the place. But you know, the girls have all been working very hard in their different groups and in their different unions, and it’s just about bringing that all together now as we come closer to the season. “It’ll be interesting to see how the new players coming in will cope and where they’re at in comparison to the rest of the girls. There will certainly be competition for places, but at the same time it will be very difficult to set the expectations and targets based on the nature of the competition and the availability of players and so on. I think just as long as we play good cricket, tick the right boxes and do what we set out to do, I’ll be happy enough with that. We’re going to be a little bit more focused on ourselves and how we go about things, and less focused on where we finish with regards to results and logs and how we compete in other games. So that’s pretty much the expectation for us this year. “Personally, I really enjoy the coaching role. It’s a challenge getting them all together at the same time on a regular basis, but this year we’re a little bit clearer on what we are trying to do as a squad and how we want to go forward. Now we’re just putting that into practice. “I think the women’s game in the North is getting stronger every year, but it’s a patience game - trying to put in the right structures and the right processes in place. We’re getting there, and it’s exciting to be part of the journey.” Rebecca Stokell (capt) (Merrion), Alice Tector (YMCA), Alice Walsh (Clontarf), Ava Canning (Leinster), Celeste Raack (Merrion), Freya Sargent (Clontarf), Georgina Dempsey (YMCA), Jane Butterly (Rush), Joanna Loughran (Leinster), Lara McBride (The Hills), Laura Delany (Leinster), Louise Little (Pembroke), Mary Waldron (WK) (Pembroke), Rebecca Gough (The Hills), Sarah Forbes (YMCA), Sinead Thompson (Clontarf). Typhoons head Paul Davidge coach said: “I’m very much looking forward to this season with the Typhoons. Following the experiences many of our players had at either the Under-19 or Senior World Cup this winter we have a squad of players who have a much stronger foundation to build from. As the Super Series continues to evolve, so does the players’ desire to put in stand-out performances, which in turn will make their case for national selection stronger. “We have clear targets and expectations set out to all of the players. We’ve challenged players with the prospect of performing in pressurised situations and to back themselves to play naturally and with complete freedom. We have clear outlines and aims for our winter training, which are directly linked to our plans for the season. “It’s great having more time with the group this year. We have already had three pre-season sessions and have a further three before the first game. It is an exciting time for this squad, and I am looking forward to working alongside some very talented players once again. We feel much more settled this year and the group has a real togetherness that will put us in a strong position as we head into the first games.” New to Super Series captaincy, Typhoons captain Rebecca Stokell said: “I was very proud when Paul called and asked me to take on the role during the winter. I had an opportunity to captain some of the games at the end of last season when Dells (Laura Delany) was injured, so was very happy to take it on properly this year. “It’s exciting the number of new girls that have joined the competition – many of them really impressed at the Under-19’s World Cup and put their names forward, so it’ll be really exciting to see what they can do at this level. The aim for us this season is to start with a positive, fearless brand of cricket. We don’t want to carry any baggage from last season. We’ve been unlucky with injuries previously and with new faces to the squad we are ready to turn a corner.” All matches will be livestreamed (announcement made shortly) and live-scored on our Match Centre .","pubDate":"2023-04-26 14:04:26","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Series Against New Zealand A Brilliant Opportunity To Fine-Tune Our Combinations, Says Babar Azam","link":"https://www.thetimesofbengal.com/sports/series-against-new-zealand-a-brilliant-opportunity-to-fine-tune-our-combinations-says-babar-azam/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Series Against New Zealand A Brilliant Opportunity To Fine-Tune Our Combinations, Says Babar Azam The two sides will begin the ODIs after an exciting five-match T20I series ended in a 2-2 draw on Monday.\r Published: April 26, 2023 6:03 PM IST By IANS Babar Azam and Tom Latham pose with the trophy ahead […]","content":"Home Sports Series Against New Zealand A Brilliant Opportunity To Fine-Tune Our Combinations, Says Babar Azam The two sides will begin the ODIs after an exciting five-match T20I series ended in a 2-2 draw on Monday.\r Published: April 26, 2023 6:03 PM IST By IANS Babar Azam and Tom Latham pose with the trophy ahead of the PAK vs NZ series 2023. (Pic: Twitter/ Pakistan Cricket) Rawalpindi: Pakistan skipper Babar Azam stated the upcoming home ODI series against New Zealand, starting at the Pindi Cricket Stadium here on Thursday, is a brilliant chance for his team to fine-tune their combinations while starting their road to prepare for the Asia Cup and ICC Men’s Cricket World Cup 2023. After the series starts from Rawalpindi, the city will also host the second ODI on Saturday, followed by the two teams playing the remaining three matches in Karachi. The two sides will begin the ODIs after an exciting five-match T20I series ended in a 2-2 draw on Monday. “Every match that we play from now on holds great significance for us. This series is a brilliant opportunity for us to fine-tune our combinations and gather the momentum ahead of the mega events in the shape of the Asia Cup and the much-anticipated World Cup,” said Azam in a statement issued by PCB. Pakistan’s record since the start of last year in ODIs has been a remarkable one, beating Australia (2-1), West Indies (3-0), and the Netherlands (3-0) before losing to New Zealand (2-1) earlier in the year in Karachi. They are also scheduled to play three ODIs against Afghanistan in August. ‘This team has done well in the past one year in the one-day format and I have firm faith in my boys that they will perform according to expectations in the exciting next seven months,” added Azam. On the other hand, New Zealand skipper Tom Latham believes adjusting to the conditions and adapting to the format will be a challenge for his team. The visitors will also be on the hunt for an ideal number three batter in the absence of injured Kane Williamson, who is on the road to recovery after rupturing the ACL in his right knee while fielding on the opening day of IPL 2023 and underwent surgery for the same. “The T20Is proved an outstanding series and we’re looking forward to switching to one-day mode now. The preparation wasn’t ideal but for us, that wasn’t an excuse. It was about just keep getting better game by game and keep learning. We did that and to come out with a series draw after being two down was awesome,” said Latham. Thursday’s match will be the first between the two sides at the Pindi Cricket Stadium in 20 years. In 2003, New Zealand played two ODIs and lost both by seven wickets and 49 runs. A year earlier, Pakistan had defeated New Zealand by three wickets. ‘It’s going to be a tough ODI series on the back of what this T20I series has produced. We have seen some great games of cricket and the one-day series is going to be no different. It’s a new format, and we have to adapt quickly. Hopefully, we can do that straight away,” added Latham. Both Pakistan and New Zealand have qualified directly for the ICC Men’s Cricket World Cup 2023 after finishing in the top eight of the 13-team ICC Men’s Cricket World Cup Super League. Published Date: April 26, 2023 6:03 PM IST $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-04-26 13:40:04","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Certa to fuel Ireland Women’s cricket team’s drive for success on world stage","link":"https://www.cricketireland.ie/news/article/certa-to-fuel-ireland-womens-cricket-teams-drive-for-success-on-world-stage","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN - Certa, Ireland’s largest fuel supplier, is set to fuel Cricket Ireland’s ambition to develop women’s cricket as a major sport in Ireland, and to develop into a major nation in world cricket, after becoming the new title sponsor of the Ireland Women’s cricket team.","content":"Certa, which is part of DCC plc, is a new brand operating in the fuel, home, business and lubricants space with a vision to become Ireland’s most progressive energy company. It operates Ireland’s largest network of unmanned, pay@pump forecourts and home heating depots. The two-year partnership comes at a very exciting time for women’s cricket in Ireland, with Cricket Ireland becoming only the second sport in Ireland to offer full-time professional playing contracts for women last year, while the senior squads’ eye-catching performances against the world’s best teams have already seen them become the 10th ranked team in the world rankings. Certa will empower the team to continue pushing new boundaries and to perform competitively against the top nations in women’s cricket. It will also help the sport to thrive from grassroots to elite level and to inspire young players to follow their dream of becoming professional cricket players in Ireland. Certa is part of communities all over Ireland with 39 unmanned, pay@pump forecourts and 22 home heating depots. It will develop campaigns that harness this network to raise awareness of the Ireland Women’s cricket team, to create a better understanding of the sport, and to build the profile of its rising stars. Team captain Laura Delany and star player Gaby Lewis will take on roles as Certa Brand Ambassadors. They will support the company’s drive to connect people and businesses to the most progressive energy solutions available and to reduce their carbon footprint by switching to Hydrotreated Vegetable Oil (HVO) as a sustainable fuel. 23 players have been offered professional women’s playing contracts for 2023. The new partnership with Certa has been announced as the Ireland Women’s team prepares to compete against recently crowned T20 World Champions, Australia, who are set to visit Clontarf for a three-match ODI series this July. The Ireland Women’s team secured a memorable win over Australia in a T20 World Cup warm-up game and are aiming to repeat the feat with home support. The series will be preceded by a six-match tour to the Caribbean for a series against the West Indies and will be followed by a three-match tour to the Netherlands. Andrew Graham , Managing Director, Certa Ireland said: “Certa is excited to get behind such a progressive sport and trailblazing team. These women are the rising stars of Irish sport, and they share our values of pushing new boundaries and challenging the status quo. Their achievements are an inspiration to people of all ages, and they deserve a bigger spotlight. “In little over one year, they have introduced full-time professional contracts in Ireland that have already raised their standard of competitiveness against the world’s best teams. Their culture of high performance and pursuit of excellence is shared by everyone at Certa, and we look forward to working together to move the dial on how the Ireland Women’s cricket team performs and advances through the world rankings.” Warren Deutrom , Chief Executive of Cricket Ireland said: “We are delighted to announce this partnership with Certa as the new title sponsors of the Ireland Women’s cricket team. This is a great step forward for women’s cricket in Ireland, and to take this step with a renowned Irish brand is genuinely exciting. Certa and Cricket Ireland will be working together to grow the profile, brand and engagement of women’s and girls’ cricket, from grassroots to elite level. “The Ireland Women’s cricket team have demonstrated over the last couple of years that they are able to compete with the best teams in the world. The experience that this young squad is gaining is invaluable to their ongoing development and to the profile of cricket in Ireland. We are very much looking forward to the summer fixtures against Australia, the West Indies and the Netherlands. It continues to be an exciting time for Ed Joyce and his squad, and we wish them all the best in the exciting next couple of years with our new partners.”","pubDate":"2023-04-26 13:32:49","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Sicily sorry for Tassie jibe; Pendlebury cleared of serious damage after eye poke; Bont’s Dunkley spur;","link":"https://www.smh.com.au/sport/afl/hawks-weigh-up-immediate-senior-return-for-lewis-lyon-calm-amid-saints-hype-20230426-p5d3ff.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"," Michael Gleeson and Jake Niall"],"video_url":null,"description":"Hawthorn skipper James Sicily apologises after upsetting a former Australian cricket captain with his remarks about Tasmania, while Collingwood champion Scott Pendlebury has been cleared of serious eye damage, and Marcus Bontempelli explains how Josh Dunkley’s exit was a spur for him to become the league’s clearance king.","content":"Andrew Wu Hawthorn skipper James Sicily has apologised for “flippant” comments he made about Tasmania’s lifestyle, which created a social media storm involving two former Australia cricket captains. What started as a casual chat on breakfast radio about the Apple Isle’s potential difficulties in retaining players finished in a late night mea culpa after Sicily’s remarks raised the hackles of Tassie cricket royalty Matthew Wade and Tim Paine. James Sicily caused a social media stir with his comments about Tasmania’s lifestyle. Credit: Getty Images On face value, Sicily’s quip that “there’s not much happening” in Tasmania seemed harmless enough, but the state government has been a long-term sponsor of the Hawks and earlier this year extended their partnership with a two-year deal worth $13.5 million. After a long struggle for its own team in the AFL, Tasmania is on the verge of securing the league’s 19th licence after the federal government pledged a $240 million commitment to build a new stadium. The announcement is expected to be made this weekend by Prime Minister Anthony Albanese. Speaking on RSN on Wednesday morning, Sicily said he believed Tasmania would have trouble holding on to players because of its quieter way of life. “I think so, particularly as a young guy, because there’s not much happening,” Sicily, who has played 22 games in Tasmania, said. “It would be quite difficult, I couldn’t imagine myself living there as a young fella. It’s a difficult one. I’ve only spent time in Launy, Hobart’s a bit different, there’s a little bit more happening in Hobart. “I haven’t had too much experience in Hobart. It would be hard.” The remark drew a hand on face emoji from former Test captain Paine and a sterner response from former national T20 skipper Wade, who has a reputation for his aggressive play with the bat and behind the stumps. “Tassie people have been fighting years for the chance to get an AFL team. Comments like this do not help us working towards our chance at showing just how good our little state is and will be with our own team,” Wade wrote on Instagram late Wednesday afternoon. “@jsicily6 Whenever you want the door is open to come down and I can show you around our boring island if you like!” Sicily apologised several hours later, saying in a statement that referred to Tasmania’s tourist attractions that he was fully supportive of the state having its own club. “I want to apologise to anyone I have offended or upset about my comments on Tasmania today,” Sicily wrote. “The comments I made on RSN were flippant, and do not reflect my views of Tasmania. “What I said related to my personal situation, that throughout my career, my attachment to Melbourne would have made it hard to live in Tassie full time. “That’s not to say there are not many AFL footballers who would enjoy living there. “I love coming down to Tassie to stay and play, I visit Tassie yearly outside of football to enjoy its golf courses and food. I’m proud of our long-term relationship with the state and I continue to support Tasmania getting its own team. (thumbs up emoji).” Michael Gleeson, Jake Niall Collingwood champion Scott Pendlebury has been cleared of serious eye damage after getting a poke in the eye in the last quarter of the Anzac Day win over Essendon. Pendlebury consulted an eye specialist and was cleared of serious damage from the blow. He will be re-assessed later in the week but is expected to be clear to play against the Crows in Adelaide on Sunday afternoon. Scott Pendlebury copped a knock to the face during the last quarter on Tuesday. Credit: AFL Photos Pendlebury went from the ground in pain and bleeding after being struck in the face via an accidental knock in a marking contest. He stayed down and was bleeding heavily from the nose and had suffered the poke in the eye at the same time. Pendlebury’s teammate Mason Cox had suffered serious damage from a similar poke in the eye in a previous incident. However, Cox’s injury uncovered an underlying retinal issue that sidelined him at length and then required him to wear protective prescription glasses when he plays. Essendon key defender Jayden Laverde will need to have shoulder surgery and will be sidelined for some time in a blow to Essendon’s otherwise promising start to the season. Laverde suffered what coach Brad Scott said was an AC joint injury during the Bombers’ loss to Collingwood on Tuesday . He was subbed out in the third quarter. These injuries are typically less serious than shoulder dislocations, but he will still require surgery. Andrew Wu Top dog Marcus Bontempelli used Josh Dunkley’s departure from the kennel as the spur to become the league’s clearance king. After an underwhelming 2022, the Bulldogs captain has been instrumental to his club’s resurgence after a poor start to the season, re-establishing himself as one of the game’s premier midfielders. Marcus Bontempelli is number one for clearances after six rounds. Credit: Getty For a player who was needled as a junior by his uncle for being too “clean”, Bontempelli said he made a concerted effort to get his paws dirty to fill the void left by reigning club champion Dunkley, who defected to Brisbane. Bontempelli’s focus on the blue-collar side of the game is reflected in him returning career-best numbers for contested possessions, clearances and tackles. Noted stoppage beasts Patrick Cripps , Lachie Neale and Clayton Oliver are all chasing Bontempelli, whose 51 clearances place him at the top of the pile. “Losing Josh was a big talking point, he was a very combative inside player for us,” Bontempelli said on Wednesday before his 200th game this weekend. “He took care of that with Tom [Liberatore] and others at different points when we’ve been dominant in our years at the football club. “Someone like that in that area of the game does leave a bit of a hole. We all discussed trying to discuss the parts of the game Josh did really well. So far this year I’ve looked to fill that gap, explore that part of my game and still let the front half game be a key factor. “You’re always looking for new strings to add to your bow and that’s been me this year.” Bontempelli acknowledged Tim English’s emergence as one of the game’s best ruckmen had helped him hone his stoppage craft. As a player who thrives on leading through his on-field deeds, last year was a particular struggle for Bontempelli, who, dogged by injury, was unable to lift his club out of their mid-table struggles. He detailed his physical and emotional struggles in an interview with this masthead on the eve of this season. Six rounds into the season, it is evident Bontempelli can now be the captain he wants to be. “There’s no doubt as a leader at this football club and captain you wear the responsibility of when things aren’t going well, and you do try and lead in a way that’s going to get the most immediate impact,” Bontempelli said. “For me, that’s how I ended up in the position at the football club because I valued the on-field performance so much and really tried to instigate, be someone who can start and shift momentum. “We’ve had a number of players who have been able to do that a lot in the past. You do feel the responsibility, definitely at times on-field to try and turn the tide or set the tone really early. “It’s something I will always really value and try to do as much as I can until the curtain comes down.” Bontempelli paid tribute to his uncle, Jim Hunt, whose tough love as a junior coach pushed him and his cousin Liam to go over and above. “He always used to think my football was a bit clean so I tend to let him know if I had more than four or five tackles - he never used to think I tackled,” Bontempelli said. “I’ve got him to thank ... for being particularly hard on me. “Uncles seem to be that way, particularly if they’re your coach. They seem to really pump up the other boys. We had to play extra special, me and Liam, to get any accolades from Jim. Him coaching us from a young age definitely trains that extra level of excellence in you.” Andrew Wu Hawthorn spearhead Mitch Lewis will almost certainly be rushed straight into the senior side this week to bolster the Hawks’ flagging forward line. Lewis has not played at any level this season after spraining his anterior cruciate ligament in late January, an injury that was expected to sideline him for the first month of the season. The Hawks had been looking at a return in round four or five, but that was pushed back due to an issue with his other knee . Lewis, who last played in round 20 last year, has one more main training session to get through and appears destined to take on the Western Bulldogs on Saturday at Marvel Stadium. Mitch Lewis is expected to play his first competitive game this week. Credit: Getty Though short of match practice, Lewis has trained with the main group for a month to build on his conditioning, gradually increasing his exposure to contact. “I’m 99 per cent confident that the coaches will pick him in the AFL – so it’s all very positive, he’s ready to play football,” Hawks high-performance manager Peter Burge said. “He’s been really strong on the track – he did a game-length session on Sunday while we were playing in Tassie. “We’ve replicated game loads in terms of all the running metrics, he’s been doing full contact for the last two weeks. “He’s ticked every box, every piece of information suggests he’s ready to play.” In Lewis’ absence, the Hawks have mainly fielded an undersized forward line without the traditional taller focal point. Lewis would add firepower to a Hawks forward line that ranks last for points scored after the first six rounds. A fifth-round selection in the 2016 draft, Lewis cemented himself as the Hawks’ No.1 key forward last year with 37 games in 15 games. Prized youngster Will Day will come back after serving a two-match suspension. The 21-year-old had been one of the Hawks’ best players in the first month of the season. AAP While he doesn’t expect to go through the AFL season without another loss, St Kilda coach Ross Lyon sees no reason why they can’t maintain their table-topping status. The Saints remained ladder leaders - ahead of Collingwood on percentage - after nailing their fifth win of the campaign with a victory over Carlton on Sunday. Their only blip has been a one-goal loss to the Magpies in round five . Last season they held the same win-loss record after six rounds, although sat fifth with four teams locked on 20 points trailing runaway leaders Melbourne. Ahead of Friday night’s clash with Port Adelaide at Marvel Stadium, gun-shy fans are wary of the Saints falling away like in 2022 when they dropped four games between rounds 12 and 15 to drop out of the eight for the remainder of the season. Aware the “narrative” could quickly change on the back of some losses, Lyon said on Wednesday he could see the team continuing to improve. “Our goals are really clear - every session give us as much as we can, concentrate and learn,” Lyon said when asked if expectations had changed given their early success. “We’re just in a state of continuous improvement. “You can’t play in finals until you’ve earnt the right, so we’re all just inching forward because if you look too far ahead, you sort of trip over, so we’re just going to stay in the moment. “We believe in what we’re doing, but we understand there’s going to be challenges so we’ll just keep chipping away at it.” Lyon said it was exciting to be able to add star players to the mix, with key forward Max King nearing a return from a shoulder reconstruction . Brad Crouch celebrates with Saints fans after the win over Carlton. Credit: AFL Photos While no date has been set, the 22-year-old joined in the first three drills of the main session on Wednesday. “He’s rehabbing really well, he trained incredibly on the weekend ... he’s been basically up to 100 per cent speed over the last few weeks so that’s getting exciting,” Lyon said. “Tim Membrey came back in and added a bit, and it’s great to be able to add players throughout the year - clearly Max King is a pretty important asset for us.” Jack Billings is also in the selection mix after impressing in the VFL on Sunday in his first game back from a broken leg. The clash against seventh-placed Port is St Kilda’s first on the big Friday night stage, but Lyon felt they could handle the pressure. “I think we’ve handled a lot of pressure this year ... there’s in-built expectations to perform in a high-performance environment. “Port Adelaide are a really strong club, well-coached, so we expect a fierce battle.” Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter .","pubDate":"2023-04-26 12:58:57","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Chandrakant Pandit Hopeful Of KKR’s Comeback In Second-Half of IPL 2023, Says This Is The Beginning","link":"https://www.thetimesofbengal.com/sports/chandrakant-pandit-hopeful-of-kkrs-comeback-in-second-half-of-ipl-2023-says-this-is-the-beginning/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Chandrakant Pandit Hopeful Of KKR’s Comeback In Second-Half of IPL 2023, Says This Is The Beginning KKR returned to winning ways, with two consecutive wins, including a last-over win against GT where Rinku Singh hit 5 sixes in the final over. Published: April 26, 2023 5:06 PM IST By IANS ‘This Is The […]","content":"Home Sports Chandrakant Pandit Hopeful Of KKR’s Comeback In Second-Half of IPL 2023, Says This Is The Beginning KKR returned to winning ways, with two consecutive wins, including a last-over win against GT where Rinku Singh hit 5 sixes in the final over. Published: April 26, 2023 5:06 PM IST By IANS ‘This Is The Beginning’, Chandrakant Pandit Hopes For KKR Comeback In IPL 2023. (Pic: IANS) New Delhi: Kolkata Knight Riders (KKR) head coach Chandrakant Pandit has voiced his confidence in his team’s ability to make a formidable comeback in the second half of the IPL 2023, saying the team is looking forward to starting afresh. After a close defeat to Punjab Kings in the tournament opener, KKR returned to winning ways, with two back-to-back wins, including a last-over thriller against Gujarat Titans where Rinku Singh hit 5 sixes in the final over, before losing their next four fixtures on the bounce to be placed eighth in the 10-team points table with just 2 wins from 7 outings. “This is the beginning, I would say, this is the beginning again in the 2nd half. Winning the first game, we have beaten them earlier. That confidence we should have. I am sure that just one spark in our team that will take us forward,” Chandrakant Pandit said in a video shared by KKR. “One has to be very optimistic. I mean, how I look at this tournament now is that the tournament is starting for us from tomorrow. And that is a positive angle from which I look at it. Obviously, a different environment has been created and the confidence level which we had in the first-half, we shouldn’t forget about that,” he added. The head coach further highlighted that the team’s overall performance was not poor and there were some exceptional individual displays duringa four-match losing streak. “It’s not that we have not been playing good cricket. So, every individual player has raised his hand, and shown us that he is ready to take responsibility,” he said. Chandrakant also said that he got good vibes as soon as he stepped into the dressing room at the M Chinnaswamy Stadium, where Madhya Pradesh clinched their maiden Ranji Trophy title last year. The head coach is optimistic that the venue could mark the turning point for his team in IPL 2023. “It’s a great memory that I cannot forget. Just last season, a year before, Madhya Pradesh won the trophy here. As soon as I entered the dressing room, it gave me that positivity that this is where we are going to start the second half and we are going to be killing it,” he said. Published Date: April 26, 2023 5:06 PM IST $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-04-26 12:50:55","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Hawthorn skipper James Sicily apologies for comments made about Tasmania getting an AFL license","link":"https://7news.com.au/sport/rugby-league/hawthorn-skipper-issues-swift-public-statement-after-copping-furious-backlash-from-tasmania-comments-c-10469368","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"James Sicily was forced to walk back his inflammatory comments just hours after he made them.","content":"captain James Sicily has made a swift backflip on some inflammatory comments he made about the state in which his club plays four home games per year. With a Tasmanian team all but set to be confirmed in coming days from the federal government, Sicily, who has played 22 of his 121 games in the Apple Isle, took an extraordinary swipe at the state following their three-point loss to Adelaide in Launceston at the weekend. Watch the latest sport on Channel 7 or stream for free on That funding boost is set to be and has paved the way to build a state-of-the-art stadium to house the competition’s 19th side. And while those in the state and at AFL House are about to celebrate, Sicily delivered a stinging backhander to the state when asked about its potential, or lack thereof, to attract talent. “I think so, particularly as a young guy, because there’s not much happening down there, it could be difficult,” he told RSN. “I couldn’t imagine myself living there. It would be hard.” Sicily’s comments immediately made headlines around the country, with Tasmanian greats like former Carlton and Brisbane midfielder Mitch Robinson, and Australian cricketer Matthew Wade, taking aim at him for them. “I’m sure sponsors love hearing that, considering Tassie pumps $13.5 million into a club that’s currently on struggle street,” Robinson said. “Tassie people have been fighting years for the chance to get an AFL team. Comments like this do not help us working towards our chance at showing just how good our little state is and will be with our own team,” Wade added. But the Hawks skipper quickly retracted his comments in a statement issued on Wednesday night. “I want to apologise to anyone I have offended or upset about my comments on Tasmania today,” he wrote. “The comments I made on RSN were flippant, and do not reflect my views of Tasmania. “What I said related to my personal situation, that throughout my career, my attachment to Melbourne would have made it hard to live in Tassie full time. “That’s not to say there are not many AFL footballers who would enjoy living there. “I love coming down to Tassie to stay and play, I visit Tassie yearly outside of football to enjoy its golf courses and food. “I’m proud of our long term relationship with the state and I continue to support Tasmania getting its own team.” St Kilda coach Ross Lyon is concerned about stars leaving for the expansion club. “I hope they don’t leave the Saints, I hope they leave the Cats,” Lyon said. “Look, expansion teams are always challenging, I haven’t really got my head around (it). “I think it goes up and down, yesterday it was off, today it’s on, so until we get it officially, until it gets edited and stamped through parliament, we won’t worry about it.” Prime Minister Anthony Albanese will reportedly announce the new funding in Hobart this weekend ahead of the May budget. The Tasmanian government is contributing $375m to the Macquarie Point stadium, with the AFL adding $15m in addition to providing long-term funding to support the club as it does to existing teams. The stadium will be a feather in the cap for AFL chief executive Gillon McLachlan, who announced one year ago that he would retire from his post but has stayed on in part to settle Tasmania’s bid. -","pubDate":"2023-04-26 22:06:16","image_url":"https://images.7news.com.au/publication/C-10469368/5833dee572cf0c12b03bcc9da462a6ab89b52133-16x9-x0y0w1280h720.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"इंग्लैंड क्रिकेट टीम ने नई T20I जर्सी का खुलासा किया","link":"https://jantaserishta.com/sports/england-cricket-team-unveils-new-t20i-jersey-2270177","keywords":["खेल"],"creator":["Rani Sahu"],"video_url":null,"description":null,"content":"लंदन (एएनआई): इंग्लैंड क्रिकेट टीम ने अपनी पुरुष और महिला सीनियर टीमों और विशेष रूप से सक्षम टीमों के लिए अपनी नई टी20ई जर्सी पेश की। इंग्लैंड क्रिकेट ने घोषणा करने के लिए ट्विटर का सहारा लिया। इंग्लैंड क्रिकेट ने ट्वीट किया, \"पेश है हमारा नया इंग्लैंड IT20 किट। हमारे इंग्लैंड के पुरुषों, महिलाओं और विकलांग टीमों द्वारा पहना जाने वाला। अपने खेल में शीर्ष पर रहें। #BetterNeverStops।\" विशेष रूप से, इंग्लैंड ICC T20 विश्व कप में गत चैंपियन है, जिसने पिछले साल फाइनल में पाकिस्तान को पांच विकेट से हराया था। यह उनका दूसरा टी20 विश्व कप खिताब है। इंग्लैंड की अगली अंतरराष्ट्रीय सीरीज 1 जून से घर में आयरलैंड के खिलाफ टेस्ट होगी। उसके बाद, इंग्लैंड 16 जून से घर में ऑस्ट्रेलिया के खिलाफ प्रतिष्ठित एशेज श्रृंखला लड़ेगा। (एएनआई)","pubDate":"2023-04-26 15:33:44","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Skipper Dimuth Karunaratne equals SL record, scores second ton in series against Ireland during 2nd Test","link":"https://thenewsmill.com/2023/04/skipper-dimuth-karunaratne-equals-sl-record-scores-second-ton-in-series-against-ireland-during-2nd-test/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Sri Lankan skipper Dimuth Karunaratne compiled a century on day three in Galle to make his 16th Test hundred and second in the ongoing two-match series against Ireland. Karunaratne, who had made 179 in the first Test at the same venue last week, stitched a 228-run opening stand with Nishan Madushka and made his 16th Test hundred in the process. The left-handed batter equalled the record for most Test hundreds as an opener among Sri Lankan players. He equalled Marvan Atapattu’s record of 16 Test tons with this knock. Besides Karunaratne and Atapattu, Sanath Jayasuriya (13 hundreds as opener) is the only Sri Lankan opener with more than ten Test hundreds. Madushka, meanwhile, became the 19th Sri Lankan opener to notch up a Test hundred and is unbeaten on 149 when rain forced early stumps on day three. Karunaratne is Sri Lanka’s fifth-highest run-getter in Test cricket with 6,524 runs at an average of 41.29. No other Sri Lankan opener has more runs than him in the longest format of the game. He was in good form in the ICC World Test Championship 2021-23 cycle for Sri Lanka, making 1,054 runs at an average of 47.90 with two hundreds. He was the third-highest run-getter among openers in this cycle of the WTC. The skipper has carried that form into the bilateral series, making back-to-back Test hundreds. At stumps on day three, Sri Lanka are trailing Ireland by 135 runs, but has lost just Karunaratne’s wicket with Madushka unbeaten on 149 and Kusal Mendis (83*) closing in a Test hundred. Sri Lanka lead 1-0 in the two-match Test series. Earlier in their first innings, Ireland was bundled out for 492 runs in 145.3 overs. Curtis Campher (111) and Paul Stirling (103) notched centuries for the visitors while skipper Andy Balbirnie (95) and wicket-keeper-batter Lorcan Tucker (80) fell short of their individual records. Prabath Jayasuriya (5/174) was the pick of the bowlers for Sri Lanka. Sri Lanka: 357/1 (Nishan Madushka 149, Dimuth Karunaratne 115, Curtis Campher 1/47) against Ireland: 492 (ANI).","pubDate":"2023-04-26 15:31:37","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Injured Kane Williamson could travel to India for World Cup as team mentor","link":"https://indianexpress.com/article/sports/cricket/injured-kane-williamson-could-travel-to-india-for-world-cup-as-team-mentor-8577804/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-04-26 14:36:54","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Quit international cricket: IPL franchises sound out 6 English players with multi-million pound deal","link":"https://www.tribuneindia.com/news/sports/quit-international-cricket-ipl-franchises-sound-out-6-english-players-with-multi-million-pound-deal-501222","keywords":null,"creator":null,"video_url":null,"description":"London, April 26Owners of top IPL franchises are trying to convince as many as six premier England players to quit international cricket and take up handsome annual contracts ranging up to 5 million pounds in order to play T20 leagues round the year, the 'Times London' reported.Almost all the 10 IPL franchises have branched out in various leagues, including CPL (West Indies), SA T20 (South Africa), Global T20 League (UAE) and the upcoming Major League T20 in the US.The report, however, doesn't state which are the franchise that have approached and who are the players involved in the discussion.There will also be an ambitious Saudi T20 league where some of the IPL franchises might be investing.'The Times' report quotes: \"Initial discussions have taken place after at least six English players, including some international stars, were approached by IPL franchise owners and asked whether, in principle, they would accept a deal that would make an Indian team their main employer, rather than the ECB or an English county.\" \"This development follows discussions among players' unions around the world about the potential implications of 12-month franchise contracts, which would be a significant step towards the football model of elite players being primarily contracted to their team and released for international duty, rather than the other way around.\"One source told The Times that contract offers could come as soon as the end of the year.\" There is no doubt that T20 cricket is here to stay and T10 is also fast catching the imagination of the public.While ICC has always thought about putting a cap on the number of leagues that an active contracted player can take part in a year, one can't rule out a possibility of a lot of young players either retiring from international cricket or giving up on central contracts to become free agents. The only hurdle in such a scenario could be 'NOC' from the respective country's cricket board.\"The probability of such a model being adopted has grown increasingly likely in recent years as some IPL franchise owners have bought stakes in several T20 tournaments in the UAE, South Africa, Caribbean — and now the United States with the new Major League Cricket venture which begins in July,\" the newspaper was quoted as saying.The paper also claimed that a discussion on similar lines took place with star Australian T20 specialists also.\"Discussions have already taken place with a number of high-profile Australian players about full-time deals but this has now been extended to English players. Contracts could be worth upwards of GBP 2 million a year and even as high as GBP 5 million — more than five times the value of the highest England central contracts.\"The paper also spoke about the possibility of having partial contracts both with ECB or county and the IPL franchise, especially, the ones who play white-ball cricket.\"Reduced IPL deals — covering at least three of the rounds — would also be on offer. It is unlikely that any of England's Test stars will walk away from their central contracts in favour of a franchise contract but the sheer amount of money on offer makes that a risk in the future.\"What is more likely is that players will arrange \"bespoke\" deals depending on their own circumstances, which could result in them being part-contracted to their county or the ECB and part-contracted to a franchise.\"","content":"PTI London, April 26 Owners of top IPL franchises are trying to convince as many as six premier England players to quit international cricket and take up handsome annual contracts ranging up to 5 million pounds in order to play T20 leagues round the year, the ‘Times London’ reported. Almost all the 10 IPL franchises have branched out in various leagues, including CPL (West Indies), SA T20 (South Africa), Global T20 League (UAE) and the upcoming Major League T20 in the US. The report, however, doesn’t state which are the franchise that have approached and who are the players involved in the discussion. There will also be an ambitious Saudi T20 league where some of the IPL franchises might be investing. ‘The Times’ report quotes: “Initial discussions have taken place after at least six English players, including some international stars, were approached by IPL franchise owners and asked whether, in principle, they would accept a deal that would make an Indian team their main employer, rather than the ECB or an English county.” “This development follows discussions among players’ unions around the world about the potential implications of 12-month franchise contracts, which would be a significant step towards the football model of elite players being primarily contracted to their team and released for international duty, rather than the other way around. “One source told The Times that contract offers could come as soon as the end of the year.” There is no doubt that T20 cricket is here to stay and T10 is also fast catching the imagination of the public. While ICC has always thought about putting a cap on the number of leagues that an active contracted player can take part in a year, one can’t rule out a possibility of a lot of young players either retiring from international cricket or giving up on central contracts to become free agents. The only hurdle in such a scenario could be ‘NOC’ from the respective country’s cricket board. “The probability of such a model being adopted has grown increasingly likely in recent years as some IPL franchise owners have bought stakes in several T20 tournaments in the UAE, South Africa, Caribbean — and now the United States with the new Major League Cricket venture which begins in July,” the newspaper was quoted as saying. The paper also claimed that a discussion on similar lines took place with star Australian T20 specialists also. “Discussions have already taken place with a number of high-profile Australian players about full-time deals but this has now been extended to English players. Contracts could be worth upwards of GBP 2 million a year and even as high as GBP 5 million — more than five times the value of the highest England central contracts.” The paper also spoke about the possibility of having partial contracts both with ECB or county and the IPL franchise, especially, the ones who play white-ball cricket. “Reduced IPL deals — covering at least three of the rounds — would also be on offer. It is unlikely that any of England’s Test stars will walk away from their central contracts in favour of a franchise contract but the sheer amount of money on offer makes that a risk in the future. “What is more likely is that players will arrange “bespoke” deals depending on their own circumstances, which could result in them being part-contracted to their county or the ECB and part-contracted to a franchise.”","pubDate":"2023-04-26 14:34:55","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/4/2023_4$largeimg_1321485250.jpg","source_id":"tribuneindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Women&#8217;s Super Series fixtures and squads released","link":"https://www.cricketireland.ie/news/article/womens-super-series-fixtures-and-squads-released","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN – Cricket Ireland has today announced the fixture schedule and squads for the Super Series, Ireland’s premier domestic women’s cricket competition.","content":"The Super Series features three representative teams - the Dragons, Scorchers and Typhoons – competing for the Super 50 Cup and the Super T20 Trophy [50-over and 20-over competitions respectively]. Key features of this year’s edition include: Growing the game: Five matches will be played in Northern Ireland this year, continuing Cricket Ireland’s ambition to grow the profile and accessibility of the women’s game in the North. Leadership: Irish internationals’ Rebecca Stokell (Typhoons), Gaby Lewis (Scorchers) and Leah Paul (Dragons) will captain the teams. Coaching: James Cameron-Dow and Paul Davidge remain head coaches of the Dragons and Typhoons respectively. The Scorchers will have a new head coach for 2023 after Glenn Querl moved to a full-time role with the Ireland Women’s senior and pathway set-up – the announcement on the new coach will be made shortly. Growing the profile: Cricket Ireland, in partnership with HBV Studios, will once again provide livestreaming of every match in the competition (over 1 million views) Improving the quality: two overseas players will be added to each squad (announced shortly) to enhance the quality and depth of the competition’s talent Gaby Lewis (capt) (YMCA), Aimee Maguire (The Hills), Anna Kerrison (Pembroke), Annabel Squires (Merrion), Christina Coulter Reilly (Clontarf), Ellie McGee (Rush), Genevieve Morrissey (Clontarf), Hannah Little (Pembroke), Isabelle McLean (The Hills), Jane Maguire (The Hills), Jenny Sparrow (Leinster), Julie McNally (Clontarf), Lara Maritz (Balbriggan), Niamh MacNulty (Merrion), Shauna Kavanagh (WK) (Pembroke), Siúin Woods (YMCA), Sophie MacMahon (Leinster). Scorchers captain Gaby Lewis said: “Preparations have been going really well - we started pretty early as a team, which has been great. While I’ve been away at the Fairbreak Invitational, vice-captain Sophie MacMahon has been leading the group and has kept me in the loop. As back-to-back double winners, we’re definitely there to be shot at. Year-on-year the competitiveness of the Super Series has improved – this year should be no different. “It’s great to see the new players coming through. I think that was the benefit of the Under-19 World Cup to see those players really shine under pressure, and it’s great to have that there. Competition for places in the team will be intense – and that will only drive standards higher still. “As a platform for international honours, the Super Series has shown its worth in recent years. A good season, playing well in the Super Series, can change everything. It’s obviously a step down from international level, but if you do well, the next thing is a senior call up, so it’s very exciting to have those opportunities for the girls as well.” Leah Paul (capt) (Merrion), Abbi Harrison (Waringstown), Alana Dalzell (Bready), Amy Caulfield (Muckamore), Amy Hunter (WK) (Malahide/Instonians), Aoife Fisher (CSNI), Arlene Kelly (Malahide), Cara Murray (Saintfield/Waringstown/Clontarf), Jemma Gillan (CSNI), Jenni Jackson (Eginton), Jess Mayes (CSNI), Kate McEvoy (YMCA), Kia McCartney (Coleraine), Mollie Devine (Fox Lodge), Orla Prendergast (Pembroke), Zara Craig (Eglinton). Dragons head coach James Cameron-Dow said: “I’m obviously looking forward to the season, especially in our second season since our return to the competition. Hopefully, we’ll be able to build on some of the things that we did last year and a few processes that we are trying to put in place. It’s been difficult in the winter with the dynamics of the squad, everyone coming from all over the place. But you know, the girls have all been working very hard in their different groups and in their different unions, and it’s just about bringing that all together now as we come closer to the season. “It’ll be interesting to see how the new players coming in will cope and where they’re at in comparison to the rest of the girls. There will certainly be competition for places, but at the same time it will be very difficult to set the expectations and targets based on the nature of the competition and the availability of players and so on. I think just as long as we play good cricket, tick the right boxes and do what we set out to do, I’ll be happy enough with that. We’re going to be a little bit more focused on ourselves and how we go about things, and less focused on where we finish with regards to results and logs and how we compete in other games. So that’s pretty much the expectation for us this year. “Personally, I really enjoy the coaching role. It’s a challenge getting them all together at the same time on a regular basis, but this year we’re a little bit clearer on what we are trying to do as a squad and how we want to go forward. Now we’re just putting that into practice. “I think the women’s game in the North is getting stronger every year, but it’s a patience game - trying to put in the right structures and the right processes in place. We’re getting there, and it’s exciting to be part of the journey.” Rebecca Stokell (capt) (Merrion), Alice Tector (YMCA), Alice Walsh (Clontarf), Ava Canning (Leinster), Celeste Raack (Merrion), Freya Sargent (Clontarf), Georgina Dempsey (YMCA), Jane Butterly (Rush), Joanna Loughran (Leinster), Lara McBride (The Hills), Laura Delany (Leinster), Louise Little (Pembroke), Mary Waldron (WK) (Pembroke), Rebecca Gough (The Hills), Sarah Forbes (YMCA), Sinead Thompson (Clontarf). Typhoons head Paul Davidge coach said: “I’m very much looking forward to this season with the Typhoons. Following the experiences many of our players had at either the Under-19 or Senior World Cup this winter we have a squad of players who have a much stronger foundation to build from. As the Super Series continues to evolve, so does the players’ desire to put in stand-out performances, which in turn will make their case for national selection stronger. “We have clear targets and expectations set out to all of the players. We’ve challenged players with the prospect of performing in pressurised situations and to back themselves to play naturally and with complete freedom. We have clear outlines and aims for our winter training, which are directly linked to our plans for the season. “It’s great having more time with the group this year. We have already had three pre-season sessions and have a further three before the first game. It is an exciting time for this squad, and I am looking forward to working alongside some very talented players once again. We feel much more settled this year and the group has a real togetherness that will put us in a strong position as we head into the first games.” New to Super Series captaincy, Typhoons captain Rebecca Stokell said: “I was very proud when Paul called and asked me to take on the role during the winter. I had an opportunity to captain some of the games at the end of last season when Dells (Laura Delany) was injured, so was very happy to take it on properly this year. “It’s exciting the number of new girls that have joined the competition – many of them really impressed at the Under-19’s World Cup and put their names forward, so it’ll be really exciting to see what they can do at this level. The aim for us this season is to start with a positive, fearless brand of cricket. We don’t want to carry any baggage from last season. We’ve been unlucky with injuries previously and with new faces to the squad we are ready to turn a corner.” All matches will be livestreamed (announcement made shortly) and live-scored on our Match Centre .","pubDate":"2023-04-26 14:04:26","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Series Against New Zealand A Brilliant Opportunity To Fine-Tune Our Combinations, Says Babar Azam","link":"https://www.thetimesofbengal.com/sports/series-against-new-zealand-a-brilliant-opportunity-to-fine-tune-our-combinations-says-babar-azam/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Series Against New Zealand A Brilliant Opportunity To Fine-Tune Our Combinations, Says Babar Azam The two sides will begin the ODIs after an exciting five-match T20I series ended in a 2-2 draw on Monday.\r Published: April 26, 2023 6:03 PM IST By IANS Babar Azam and Tom Latham pose with the trophy ahead […]","content":"Home Sports Series Against New Zealand A Brilliant Opportunity To Fine-Tune Our Combinations, Says Babar Azam The two sides will begin the ODIs after an exciting five-match T20I series ended in a 2-2 draw on Monday.\r Published: April 26, 2023 6:03 PM IST By IANS Babar Azam and Tom Latham pose with the trophy ahead of the PAK vs NZ series 2023. (Pic: Twitter/ Pakistan Cricket) Rawalpindi: Pakistan skipper Babar Azam stated the upcoming home ODI series against New Zealand, starting at the Pindi Cricket Stadium here on Thursday, is a brilliant chance for his team to fine-tune their combinations while starting their road to prepare for the Asia Cup and ICC Men’s Cricket World Cup 2023. After the series starts from Rawalpindi, the city will also host the second ODI on Saturday, followed by the two teams playing the remaining three matches in Karachi. The two sides will begin the ODIs after an exciting five-match T20I series ended in a 2-2 draw on Monday. “Every match that we play from now on holds great significance for us. This series is a brilliant opportunity for us to fine-tune our combinations and gather the momentum ahead of the mega events in the shape of the Asia Cup and the much-anticipated World Cup,” said Azam in a statement issued by PCB. Pakistan’s record since the start of last year in ODIs has been a remarkable one, beating Australia (2-1), West Indies (3-0), and the Netherlands (3-0) before losing to New Zealand (2-1) earlier in the year in Karachi. They are also scheduled to play three ODIs against Afghanistan in August. ‘This team has done well in the past one year in the one-day format and I have firm faith in my boys that they will perform according to expectations in the exciting next seven months,” added Azam. On the other hand, New Zealand skipper Tom Latham believes adjusting to the conditions and adapting to the format will be a challenge for his team. The visitors will also be on the hunt for an ideal number three batter in the absence of injured Kane Williamson, who is on the road to recovery after rupturing the ACL in his right knee while fielding on the opening day of IPL 2023 and underwent surgery for the same. “The T20Is proved an outstanding series and we’re looking forward to switching to one-day mode now. The preparation wasn’t ideal but for us, that wasn’t an excuse. It was about just keep getting better game by game and keep learning. We did that and to come out with a series draw after being two down was awesome,” said Latham. Thursday’s match will be the first between the two sides at the Pindi Cricket Stadium in 20 years. In 2003, New Zealand played two ODIs and lost both by seven wickets and 49 runs. A year earlier, Pakistan had defeated New Zealand by three wickets. ‘It’s going to be a tough ODI series on the back of what this T20I series has produced. We have seen some great games of cricket and the one-day series is going to be no different. It’s a new format, and we have to adapt quickly. Hopefully, we can do that straight away,” added Latham. Both Pakistan and New Zealand have qualified directly for the ICC Men’s Cricket World Cup 2023 after finishing in the top eight of the 13-team ICC Men’s Cricket World Cup Super League. Published Date: April 26, 2023 6:03 PM IST $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-04-26 13:40:04","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Certa to fuel Ireland Women’s cricket team’s drive for success on world stage","link":"https://www.cricketireland.ie/news/article/certa-to-fuel-ireland-womens-cricket-teams-drive-for-success-on-world-stage","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN - Certa, Ireland’s largest fuel supplier, is set to fuel Cricket Ireland’s ambition to develop women’s cricket as a major sport in Ireland, and to develop into a major nation in world cricket, after becoming the new title sponsor of the Ireland Women’s cricket team.","content":"Certa, which is part of DCC plc, is a new brand operating in the fuel, home, business and lubricants space with a vision to become Ireland’s most progressive energy company. It operates Ireland’s largest network of unmanned, pay@pump forecourts and home heating depots. The two-year partnership comes at a very exciting time for women’s cricket in Ireland, with Cricket Ireland becoming only the second sport in Ireland to offer full-time professional playing contracts for women last year, while the senior squads’ eye-catching performances against the world’s best teams have already seen them become the 10th ranked team in the world rankings. Certa will empower the team to continue pushing new boundaries and to perform competitively against the top nations in women’s cricket. It will also help the sport to thrive from grassroots to elite level and to inspire young players to follow their dream of becoming professional cricket players in Ireland. Certa is part of communities all over Ireland with 39 unmanned, pay@pump forecourts and 22 home heating depots. It will develop campaigns that harness this network to raise awareness of the Ireland Women’s cricket team, to create a better understanding of the sport, and to build the profile of its rising stars. Team captain Laura Delany and star player Gaby Lewis will take on roles as Certa Brand Ambassadors. They will support the company’s drive to connect people and businesses to the most progressive energy solutions available and to reduce their carbon footprint by switching to Hydrotreated Vegetable Oil (HVO) as a sustainable fuel. 23 players have been offered professional women’s playing contracts for 2023. The new partnership with Certa has been announced as the Ireland Women’s team prepares to compete against recently crowned T20 World Champions, Australia, who are set to visit Clontarf for a three-match ODI series this July. The Ireland Women’s team secured a memorable win over Australia in a T20 World Cup warm-up game and are aiming to repeat the feat with home support. The series will be preceded by a six-match tour to the Caribbean for a series against the West Indies and will be followed by a three-match tour to the Netherlands. Andrew Graham , Managing Director, Certa Ireland said: “Certa is excited to get behind such a progressive sport and trailblazing team. These women are the rising stars of Irish sport, and they share our values of pushing new boundaries and challenging the status quo. Their achievements are an inspiration to people of all ages, and they deserve a bigger spotlight. “In little over one year, they have introduced full-time professional contracts in Ireland that have already raised their standard of competitiveness against the world’s best teams. Their culture of high performance and pursuit of excellence is shared by everyone at Certa, and we look forward to working together to move the dial on how the Ireland Women’s cricket team performs and advances through the world rankings.” Warren Deutrom , Chief Executive of Cricket Ireland said: “We are delighted to announce this partnership with Certa as the new title sponsors of the Ireland Women’s cricket team. This is a great step forward for women’s cricket in Ireland, and to take this step with a renowned Irish brand is genuinely exciting. Certa and Cricket Ireland will be working together to grow the profile, brand and engagement of women’s and girls’ cricket, from grassroots to elite level. “The Ireland Women’s cricket team have demonstrated over the last couple of years that they are able to compete with the best teams in the world. The experience that this young squad is gaining is invaluable to their ongoing development and to the profile of cricket in Ireland. We are very much looking forward to the summer fixtures against Australia, the West Indies and the Netherlands. It continues to be an exciting time for Ed Joyce and his squad, and we wish them all the best in the exciting next couple of years with our new partners.”","pubDate":"2023-04-26 13:32:49","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Sicily sorry for Tassie jibe; Pendlebury cleared of serious damage after eye poke; Bont’s Dunkley spur;","link":"https://www.smh.com.au/sport/afl/hawks-weigh-up-immediate-senior-return-for-lewis-lyon-calm-amid-saints-hype-20230426-p5d3ff.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"," Michael Gleeson and Jake Niall"],"video_url":null,"description":"Hawthorn skipper James Sicily apologises after upsetting a former Australian cricket captain with his remarks about Tasmania, while Collingwood champion Scott Pendlebury has been cleared of serious eye damage, and Marcus Bontempelli explains how Josh Dunkley’s exit was a spur for him to become the league’s clearance king.","content":"Andrew Wu Hawthorn skipper James Sicily has apologised for “flippant” comments he made about Tasmania’s lifestyle, which created a social media storm involving two former Australia cricket captains. What started as a casual chat on breakfast radio about the Apple Isle’s potential difficulties in retaining players finished in a late night mea culpa after Sicily’s remarks raised the hackles of Tassie cricket royalty Matthew Wade and Tim Paine. James Sicily caused a social media stir with his comments about Tasmania’s lifestyle. Credit: Getty Images On face value, Sicily’s quip that “there’s not much happening” in Tasmania seemed harmless enough, but the state government has been a long-term sponsor of the Hawks and earlier this year extended their partnership with a two-year deal worth $13.5 million. After a long struggle for its own team in the AFL, Tasmania is on the verge of securing the league’s 19th licence after the federal government pledged a $240 million commitment to build a new stadium. The announcement is expected to be made this weekend by Prime Minister Anthony Albanese. Speaking on RSN on Wednesday morning, Sicily said he believed Tasmania would have trouble holding on to players because of its quieter way of life. “I think so, particularly as a young guy, because there’s not much happening,” Sicily, who has played 22 games in Tasmania, said. “It would be quite difficult, I couldn’t imagine myself living there as a young fella. It’s a difficult one. I’ve only spent time in Launy, Hobart’s a bit different, there’s a little bit more happening in Hobart. “I haven’t had too much experience in Hobart. It would be hard.” The remark drew a hand on face emoji from former Test captain Paine and a sterner response from former national T20 skipper Wade, who has a reputation for his aggressive play with the bat and behind the stumps. “Tassie people have been fighting years for the chance to get an AFL team. Comments like this do not help us working towards our chance at showing just how good our little state is and will be with our own team,” Wade wrote on Instagram late Wednesday afternoon. “@jsicily6 Whenever you want the door is open to come down and I can show you around our boring island if you like!” Sicily apologised several hours later, saying in a statement that referred to Tasmania’s tourist attractions that he was fully supportive of the state having its own club. “I want to apologise to anyone I have offended or upset about my comments on Tasmania today,” Sicily wrote. “The comments I made on RSN were flippant, and do not reflect my views of Tasmania. “What I said related to my personal situation, that throughout my career, my attachment to Melbourne would have made it hard to live in Tassie full time. “That’s not to say there are not many AFL footballers who would enjoy living there. “I love coming down to Tassie to stay and play, I visit Tassie yearly outside of football to enjoy its golf courses and food. I’m proud of our long-term relationship with the state and I continue to support Tasmania getting its own team. (thumbs up emoji).” Michael Gleeson, Jake Niall Collingwood champion Scott Pendlebury has been cleared of serious eye damage after getting a poke in the eye in the last quarter of the Anzac Day win over Essendon. Pendlebury consulted an eye specialist and was cleared of serious damage from the blow. He will be re-assessed later in the week but is expected to be clear to play against the Crows in Adelaide on Sunday afternoon. Scott Pendlebury copped a knock to the face during the last quarter on Tuesday. Credit: AFL Photos Pendlebury went from the ground in pain and bleeding after being struck in the face via an accidental knock in a marking contest. He stayed down and was bleeding heavily from the nose and had suffered the poke in the eye at the same time. Pendlebury’s teammate Mason Cox had suffered serious damage from a similar poke in the eye in a previous incident. However, Cox’s injury uncovered an underlying retinal issue that sidelined him at length and then required him to wear protective prescription glasses when he plays. Essendon key defender Jayden Laverde will need to have shoulder surgery and will be sidelined for some time in a blow to Essendon’s otherwise promising start to the season. Laverde suffered what coach Brad Scott said was an AC joint injury during the Bombers’ loss to Collingwood on Tuesday . He was subbed out in the third quarter. These injuries are typically less serious than shoulder dislocations, but he will still require surgery. Andrew Wu Top dog Marcus Bontempelli used Josh Dunkley’s departure from the kennel as the spur to become the league’s clearance king. After an underwhelming 2022, the Bulldogs captain has been instrumental to his club’s resurgence after a poor start to the season, re-establishing himself as one of the game’s premier midfielders. Marcus Bontempelli is number one for clearances after six rounds. Credit: Getty For a player who was needled as a junior by his uncle for being too “clean”, Bontempelli said he made a concerted effort to get his paws dirty to fill the void left by reigning club champion Dunkley, who defected to Brisbane. Bontempelli’s focus on the blue-collar side of the game is reflected in him returning career-best numbers for contested possessions, clearances and tackles. Noted stoppage beasts Patrick Cripps , Lachie Neale and Clayton Oliver are all chasing Bontempelli, whose 51 clearances place him at the top of the pile. “Losing Josh was a big talking point, he was a very combative inside player for us,” Bontempelli said on Wednesday before his 200th game this weekend. “He took care of that with Tom [Liberatore] and others at different points when we’ve been dominant in our years at the football club. “Someone like that in that area of the game does leave a bit of a hole. We all discussed trying to discuss the parts of the game Josh did really well. So far this year I’ve looked to fill that gap, explore that part of my game and still let the front half game be a key factor. “You’re always looking for new strings to add to your bow and that’s been me this year.” Bontempelli acknowledged Tim English’s emergence as one of the game’s best ruckmen had helped him hone his stoppage craft. As a player who thrives on leading through his on-field deeds, last year was a particular struggle for Bontempelli, who, dogged by injury, was unable to lift his club out of their mid-table struggles. He detailed his physical and emotional struggles in an interview with this masthead on the eve of this season. Six rounds into the season, it is evident Bontempelli can now be the captain he wants to be. “There’s no doubt as a leader at this football club and captain you wear the responsibility of when things aren’t going well, and you do try and lead in a way that’s going to get the most immediate impact,” Bontempelli said. “For me, that’s how I ended up in the position at the football club because I valued the on-field performance so much and really tried to instigate, be someone who can start and shift momentum. “We’ve had a number of players who have been able to do that a lot in the past. You do feel the responsibility, definitely at times on-field to try and turn the tide or set the tone really early. “It’s something I will always really value and try to do as much as I can until the curtain comes down.” Bontempelli paid tribute to his uncle, Jim Hunt, whose tough love as a junior coach pushed him and his cousin Liam to go over and above. “He always used to think my football was a bit clean so I tend to let him know if I had more than four or five tackles - he never used to think I tackled,” Bontempelli said. “I’ve got him to thank ... for being particularly hard on me. “Uncles seem to be that way, particularly if they’re your coach. They seem to really pump up the other boys. We had to play extra special, me and Liam, to get any accolades from Jim. Him coaching us from a young age definitely trains that extra level of excellence in you.” Andrew Wu Hawthorn spearhead Mitch Lewis will almost certainly be rushed straight into the senior side this week to bolster the Hawks’ flagging forward line. Lewis has not played at any level this season after spraining his anterior cruciate ligament in late January, an injury that was expected to sideline him for the first month of the season. The Hawks had been looking at a return in round four or five, but that was pushed back due to an issue with his other knee . Lewis, who last played in round 20 last year, has one more main training session to get through and appears destined to take on the Western Bulldogs on Saturday at Marvel Stadium. Mitch Lewis is expected to play his first competitive game this week. Credit: Getty Though short of match practice, Lewis has trained with the main group for a month to build on his conditioning, gradually increasing his exposure to contact. “I’m 99 per cent confident that the coaches will pick him in the AFL – so it’s all very positive, he’s ready to play football,” Hawks high-performance manager Peter Burge said. “He’s been really strong on the track – he did a game-length session on Sunday while we were playing in Tassie. “We’ve replicated game loads in terms of all the running metrics, he’s been doing full contact for the last two weeks. “He’s ticked every box, every piece of information suggests he’s ready to play.” In Lewis’ absence, the Hawks have mainly fielded an undersized forward line without the traditional taller focal point. Lewis would add firepower to a Hawks forward line that ranks last for points scored after the first six rounds. A fifth-round selection in the 2016 draft, Lewis cemented himself as the Hawks’ No.1 key forward last year with 37 games in 15 games. Prized youngster Will Day will come back after serving a two-match suspension. The 21-year-old had been one of the Hawks’ best players in the first month of the season. AAP While he doesn’t expect to go through the AFL season without another loss, St Kilda coach Ross Lyon sees no reason why they can’t maintain their table-topping status. The Saints remained ladder leaders - ahead of Collingwood on percentage - after nailing their fifth win of the campaign with a victory over Carlton on Sunday. Their only blip has been a one-goal loss to the Magpies in round five . Last season they held the same win-loss record after six rounds, although sat fifth with four teams locked on 20 points trailing runaway leaders Melbourne. Ahead of Friday night’s clash with Port Adelaide at Marvel Stadium, gun-shy fans are wary of the Saints falling away like in 2022 when they dropped four games between rounds 12 and 15 to drop out of the eight for the remainder of the season. Aware the “narrative” could quickly change on the back of some losses, Lyon said on Wednesday he could see the team continuing to improve. “Our goals are really clear - every session give us as much as we can, concentrate and learn,” Lyon said when asked if expectations had changed given their early success. “We’re just in a state of continuous improvement. “You can’t play in finals until you’ve earnt the right, so we’re all just inching forward because if you look too far ahead, you sort of trip over, so we’re just going to stay in the moment. “We believe in what we’re doing, but we understand there’s going to be challenges so we’ll just keep chipping away at it.” Lyon said it was exciting to be able to add star players to the mix, with key forward Max King nearing a return from a shoulder reconstruction . Brad Crouch celebrates with Saints fans after the win over Carlton. Credit: AFL Photos While no date has been set, the 22-year-old joined in the first three drills of the main session on Wednesday. “He’s rehabbing really well, he trained incredibly on the weekend ... he’s been basically up to 100 per cent speed over the last few weeks so that’s getting exciting,” Lyon said. “Tim Membrey came back in and added a bit, and it’s great to be able to add players throughout the year - clearly Max King is a pretty important asset for us.” Jack Billings is also in the selection mix after impressing in the VFL on Sunday in his first game back from a broken leg. The clash against seventh-placed Port is St Kilda’s first on the big Friday night stage, but Lyon felt they could handle the pressure. “I think we’ve handled a lot of pressure this year ... there’s in-built expectations to perform in a high-performance environment. “Port Adelaide are a really strong club, well-coached, so we expect a fierce battle.” Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter .","pubDate":"2023-04-26 12:58:57","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Chandrakant Pandit Hopeful Of KKR’s Comeback In Second-Half of IPL 2023, Says This Is The Beginning","link":"https://www.thetimesofbengal.com/sports/chandrakant-pandit-hopeful-of-kkrs-comeback-in-second-half-of-ipl-2023-says-this-is-the-beginning/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Chandrakant Pandit Hopeful Of KKR’s Comeback In Second-Half of IPL 2023, Says This Is The Beginning KKR returned to winning ways, with two consecutive wins, including a last-over win against GT where Rinku Singh hit 5 sixes in the final over. Published: April 26, 2023 5:06 PM IST By IANS ‘This Is The […]","content":"Home Sports Chandrakant Pandit Hopeful Of KKR’s Comeback In Second-Half of IPL 2023, Says This Is The Beginning KKR returned to winning ways, with two consecutive wins, including a last-over win against GT where Rinku Singh hit 5 sixes in the final over. Published: April 26, 2023 5:06 PM IST By IANS ‘This Is The Beginning’, Chandrakant Pandit Hopes For KKR Comeback In IPL 2023. (Pic: IANS) New Delhi: Kolkata Knight Riders (KKR) head coach Chandrakant Pandit has voiced his confidence in his team’s ability to make a formidable comeback in the second half of the IPL 2023, saying the team is looking forward to starting afresh. After a close defeat to Punjab Kings in the tournament opener, KKR returned to winning ways, with two back-to-back wins, including a last-over thriller against Gujarat Titans where Rinku Singh hit 5 sixes in the final over, before losing their next four fixtures on the bounce to be placed eighth in the 10-team points table with just 2 wins from 7 outings. “This is the beginning, I would say, this is the beginning again in the 2nd half. Winning the first game, we have beaten them earlier. That confidence we should have. I am sure that just one spark in our team that will take us forward,” Chandrakant Pandit said in a video shared by KKR. “One has to be very optimistic. I mean, how I look at this tournament now is that the tournament is starting for us from tomorrow. And that is a positive angle from which I look at it. Obviously, a different environment has been created and the confidence level which we had in the first-half, we shouldn’t forget about that,” he added. The head coach further highlighted that the team’s overall performance was not poor and there were some exceptional individual displays duringa four-match losing streak. “It’s not that we have not been playing good cricket. So, every individual player has raised his hand, and shown us that he is ready to take responsibility,” he said. Chandrakant also said that he got good vibes as soon as he stepped into the dressing room at the M Chinnaswamy Stadium, where Madhya Pradesh clinched their maiden Ranji Trophy title last year. The head coach is optimistic that the venue could mark the turning point for his team in IPL 2023. “It’s a great memory that I cannot forget. Just last season, a year before, Madhya Pradesh won the trophy here. As soon as I entered the dressing room, it gave me that positivity that this is where we are going to start the second half and we are going to be killing it,” he said. Published Date: April 26, 2023 5:06 PM IST $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-04-26 12:50:55","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Hawthorn skipper James Sicily apologies for comments made about Tasmania getting an AFL license","link":"https://7news.com.au/sport/rugby-league/hawthorn-skipper-issues-swift-public-statement-after-copping-furious-backlash-from-tasmania-comments-c-10469368","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"James Sicily was forced to walk back his inflammatory comments just hours after he made them.","content":"captain James Sicily has made a swift backflip on some inflammatory comments he made about the state in which his club plays four home games per year. With a Tasmanian team all but set to be confirmed in coming days from the federal government, Sicily, who has played 22 of his 121 games in the Apple Isle, took an extraordinary swipe at the state following their three-point loss to Adelaide in Launceston at the weekend. Watch the latest sport on Channel 7 or stream for free on That funding boost is set to be and has paved the way to build a state-of-the-art stadium to house the competition’s 19th side. And while those in the state and at AFL House are about to celebrate, Sicily delivered a stinging backhander to the state when asked about its potential, or lack thereof, to attract talent. “I think so, particularly as a young guy, because there’s not much happening down there, it could be difficult,” he told RSN. “I couldn’t imagine myself living there. It would be hard.” Sicily’s comments immediately made headlines around the country, with Tasmanian greats like former Carlton and Brisbane midfielder Mitch Robinson, and Australian cricketer Matthew Wade, taking aim at him for them. “I’m sure sponsors love hearing that, considering Tassie pumps $13.5 million into a club that’s currently on struggle street,” Robinson said. “Tassie people have been fighting years for the chance to get an AFL team. Comments like this do not help us working towards our chance at showing just how good our little state is and will be with our own team,” Wade added. But the Hawks skipper quickly retracted his comments in a statement issued on Wednesday night. “I want to apologise to anyone I have offended or upset about my comments on Tasmania today,” he wrote. “The comments I made on RSN were flippant, and do not reflect my views of Tasmania. “What I said related to my personal situation, that throughout my career, my attachment to Melbourne would have made it hard to live in Tassie full time. “That’s not to say there are not many AFL footballers who would enjoy living there. “I love coming down to Tassie to stay and play, I visit Tassie yearly outside of football to enjoy its golf courses and food. “I’m proud of our long term relationship with the state and I continue to support Tasmania getting its own team.” St Kilda coach Ross Lyon is concerned about stars leaving for the expansion club. “I hope they don’t leave the Saints, I hope they leave the Cats,” Lyon said. “Look, expansion teams are always challenging, I haven’t really got my head around (it). “I think it goes up and down, yesterday it was off, today it’s on, so until we get it officially, until it gets edited and stamped through parliament, we won’t worry about it.” Prime Minister Anthony Albanese will reportedly announce the new funding in Hobart this weekend ahead of the May budget. The Tasmanian government is contributing $375m to the Macquarie Point stadium, with the AFL adding $15m in addition to providing long-term funding to support the club as it does to existing teams. The stadium will be a feather in the cap for AFL chief executive Gillon McLachlan, who announced one year ago that he would retire from his post but has stayed on in part to settle Tasmania’s bid. -","pubDate":"2023-04-26 22:06:16","image_url":"https://images.7news.com.au/publication/C-10469368/5833dee572cf0c12b03bcc9da462a6ab89b52133-16x9-x0y0w1280h720.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"इंग्लैंड क्रिकेट टीम ने नई T20I जर्सी का खुलासा किया","link":"https://jantaserishta.com/sports/england-cricket-team-unveils-new-t20i-jersey-2270177","keywords":["खेल"],"creator":["Rani Sahu"],"video_url":null,"description":null,"content":"लंदन (एएनआई): इंग्लैंड क्रिकेट टीम ने अपनी पुरुष और महिला सीनियर टीमों और विशेष रूप से सक्षम टीमों के लिए अपनी नई टी20ई जर्सी पेश की। इंग्लैंड क्रिकेट ने घोषणा करने के लिए ट्विटर का सहारा लिया। इंग्लैंड क्रिकेट ने ट्वीट किया, \"पेश है हमारा नया इंग्लैंड IT20 किट। हमारे इंग्लैंड के पुरुषों, महिलाओं और विकलांग टीमों द्वारा पहना जाने वाला। अपने खेल में शीर्ष पर रहें। #BetterNeverStops।\" विशेष रूप से, इंग्लैंड ICC T20 विश्व कप में गत चैंपियन है, जिसने पिछले साल फाइनल में पाकिस्तान को पांच विकेट से हराया था। यह उनका दूसरा टी20 विश्व कप खिताब है। इंग्लैंड की अगली अंतरराष्ट्रीय सीरीज 1 जून से घर में आयरलैंड के खिलाफ टेस्ट होगी। उसके बाद, इंग्लैंड 16 जून से घर में ऑस्ट्रेलिया के खिलाफ प्रतिष्ठित एशेज श्रृंखला लड़ेगा। (एएनआई)","pubDate":"2023-04-26 15:33:44","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Skipper Dimuth Karunaratne equals SL record, scores second ton in series against Ireland during 2nd Test","link":"https://thenewsmill.com/2023/04/skipper-dimuth-karunaratne-equals-sl-record-scores-second-ton-in-series-against-ireland-during-2nd-test/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Sri Lankan skipper Dimuth Karunaratne compiled a century on day three in Galle to make his 16th Test hundred and second in the ongoing two-match series against Ireland. Karunaratne, who had made 179 in the first Test at the same venue last week, stitched a 228-run opening stand with Nishan Madushka and made his 16th Test hundred in the process. The left-handed batter equalled the record for most Test hundreds as an opener among Sri Lankan players. He equalled Marvan Atapattu’s record of 16 Test tons with this knock. Besides Karunaratne and Atapattu, Sanath Jayasuriya (13 hundreds as opener) is the only Sri Lankan opener with more than ten Test hundreds. Madushka, meanwhile, became the 19th Sri Lankan opener to notch up a Test hundred and is unbeaten on 149 when rain forced early stumps on day three. Karunaratne is Sri Lanka’s fifth-highest run-getter in Test cricket with 6,524 runs at an average of 41.29. No other Sri Lankan opener has more runs than him in the longest format of the game. He was in good form in the ICC World Test Championship 2021-23 cycle for Sri Lanka, making 1,054 runs at an average of 47.90 with two hundreds. He was the third-highest run-getter among openers in this cycle of the WTC. The skipper has carried that form into the bilateral series, making back-to-back Test hundreds. At stumps on day three, Sri Lanka are trailing Ireland by 135 runs, but has lost just Karunaratne’s wicket with Madushka unbeaten on 149 and Kusal Mendis (83*) closing in a Test hundred. Sri Lanka lead 1-0 in the two-match Test series. Earlier in their first innings, Ireland was bundled out for 492 runs in 145.3 overs. Curtis Campher (111) and Paul Stirling (103) notched centuries for the visitors while skipper Andy Balbirnie (95) and wicket-keeper-batter Lorcan Tucker (80) fell short of their individual records. Prabath Jayasuriya (5/174) was the pick of the bowlers for Sri Lanka. Sri Lanka: 357/1 (Nishan Madushka 149, Dimuth Karunaratne 115, Curtis Campher 1/47) against Ireland: 492 (ANI).","pubDate":"2023-04-26 15:31:37","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Injured Kane Williamson could travel to India for World Cup as team mentor","link":"https://indianexpress.com/article/sports/cricket/injured-kane-williamson-could-travel-to-india-for-world-cup-as-team-mentor-8577804/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-04-26 14:36:54","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Quit international cricket: IPL franchises sound out 6 English players with multi-million pound deal","link":"https://www.tribuneindia.com/news/sports/quit-international-cricket-ipl-franchises-sound-out-6-english-players-with-multi-million-pound-deal-501222","keywords":null,"creator":null,"video_url":null,"description":"London, April 26Owners of top IPL franchises are trying to convince as many as six premier England players to quit international cricket and take up handsome annual contracts ranging up to 5 million pounds in order to play T20 leagues round the year, the 'Times London' reported.Almost all the 10 IPL franchises have branched out in various leagues, including CPL (West Indies), SA T20 (South Africa), Global T20 League (UAE) and the upcoming Major League T20 in the US.The report, however, doesn't state which are the franchise that have approached and who are the players involved in the discussion.There will also be an ambitious Saudi T20 league where some of the IPL franchises might be investing.'The Times' report quotes: \"Initial discussions have taken place after at least six English players, including some international stars, were approached by IPL franchise owners and asked whether, in principle, they would accept a deal that would make an Indian team their main employer, rather than the ECB or an English county.\" \"This development follows discussions among players' unions around the world about the potential implications of 12-month franchise contracts, which would be a significant step towards the football model of elite players being primarily contracted to their team and released for international duty, rather than the other way around.\"One source told The Times that contract offers could come as soon as the end of the year.\" There is no doubt that T20 cricket is here to stay and T10 is also fast catching the imagination of the public.While ICC has always thought about putting a cap on the number of leagues that an active contracted player can take part in a year, one can't rule out a possibility of a lot of young players either retiring from international cricket or giving up on central contracts to become free agents. The only hurdle in such a scenario could be 'NOC' from the respective country's cricket board.\"The probability of such a model being adopted has grown increasingly likely in recent years as some IPL franchise owners have bought stakes in several T20 tournaments in the UAE, South Africa, Caribbean — and now the United States with the new Major League Cricket venture which begins in July,\" the newspaper was quoted as saying.The paper also claimed that a discussion on similar lines took place with star Australian T20 specialists also.\"Discussions have already taken place with a number of high-profile Australian players about full-time deals but this has now been extended to English players. Contracts could be worth upwards of GBP 2 million a year and even as high as GBP 5 million — more than five times the value of the highest England central contracts.\"The paper also spoke about the possibility of having partial contracts both with ECB or county and the IPL franchise, especially, the ones who play white-ball cricket.\"Reduced IPL deals — covering at least three of the rounds — would also be on offer. It is unlikely that any of England's Test stars will walk away from their central contracts in favour of a franchise contract but the sheer amount of money on offer makes that a risk in the future.\"What is more likely is that players will arrange \"bespoke\" deals depending on their own circumstances, which could result in them being part-contracted to their county or the ECB and part-contracted to a franchise.\"","content":"PTI London, April 26 Owners of top IPL franchises are trying to convince as many as six premier England players to quit international cricket and take up handsome annual contracts ranging up to 5 million pounds in order to play T20 leagues round the year, the ‘Times London’ reported. Almost all the 10 IPL franchises have branched out in various leagues, including CPL (West Indies), SA T20 (South Africa), Global T20 League (UAE) and the upcoming Major League T20 in the US. The report, however, doesn’t state which are the franchise that have approached and who are the players involved in the discussion. There will also be an ambitious Saudi T20 league where some of the IPL franchises might be investing. ‘The Times’ report quotes: “Initial discussions have taken place after at least six English players, including some international stars, were approached by IPL franchise owners and asked whether, in principle, they would accept a deal that would make an Indian team their main employer, rather than the ECB or an English county.” “This development follows discussions among players’ unions around the world about the potential implications of 12-month franchise contracts, which would be a significant step towards the football model of elite players being primarily contracted to their team and released for international duty, rather than the other way around. “One source told The Times that contract offers could come as soon as the end of the year.” There is no doubt that T20 cricket is here to stay and T10 is also fast catching the imagination of the public. While ICC has always thought about putting a cap on the number of leagues that an active contracted player can take part in a year, one can’t rule out a possibility of a lot of young players either retiring from international cricket or giving up on central contracts to become free agents. The only hurdle in such a scenario could be ‘NOC’ from the respective country’s cricket board. “The probability of such a model being adopted has grown increasingly likely in recent years as some IPL franchise owners have bought stakes in several T20 tournaments in the UAE, South Africa, Caribbean — and now the United States with the new Major League Cricket venture which begins in July,” the newspaper was quoted as saying. The paper also claimed that a discussion on similar lines took place with star Australian T20 specialists also. “Discussions have already taken place with a number of high-profile Australian players about full-time deals but this has now been extended to English players. Contracts could be worth upwards of GBP 2 million a year and even as high as GBP 5 million — more than five times the value of the highest England central contracts.” The paper also spoke about the possibility of having partial contracts both with ECB or county and the IPL franchise, especially, the ones who play white-ball cricket. “Reduced IPL deals — covering at least three of the rounds — would also be on offer. It is unlikely that any of England’s Test stars will walk away from their central contracts in favour of a franchise contract but the sheer amount of money on offer makes that a risk in the future. “What is more likely is that players will arrange “bespoke” deals depending on their own circumstances, which could result in them being part-contracted to their county or the ECB and part-contracted to a franchise.”","pubDate":"2023-04-26 14:34:55","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/4/2023_4$largeimg_1321485250.jpg","source_id":"tribuneindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Women&#8217;s Super Series fixtures and squads released","link":"https://www.cricketireland.ie/news/article/womens-super-series-fixtures-and-squads-released","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN – Cricket Ireland has today announced the fixture schedule and squads for the Super Series, Ireland’s premier domestic women’s cricket competition.","content":"The Super Series features three representative teams - the Dragons, Scorchers and Typhoons – competing for the Super 50 Cup and the Super T20 Trophy [50-over and 20-over competitions respectively]. Key features of this year’s edition include: Growing the game: Five matches will be played in Northern Ireland this year, continuing Cricket Ireland’s ambition to grow the profile and accessibility of the women’s game in the North. Leadership: Irish internationals’ Rebecca Stokell (Typhoons), Gaby Lewis (Scorchers) and Leah Paul (Dragons) will captain the teams. Coaching: James Cameron-Dow and Paul Davidge remain head coaches of the Dragons and Typhoons respectively. The Scorchers will have a new head coach for 2023 after Glenn Querl moved to a full-time role with the Ireland Women’s senior and pathway set-up – the announcement on the new coach will be made shortly. Growing the profile: Cricket Ireland, in partnership with HBV Studios, will once again provide livestreaming of every match in the competition (over 1 million views) Improving the quality: two overseas players will be added to each squad (announced shortly) to enhance the quality and depth of the competition’s talent Gaby Lewis (capt) (YMCA), Aimee Maguire (The Hills), Anna Kerrison (Pembroke), Annabel Squires (Merrion), Christina Coulter Reilly (Clontarf), Ellie McGee (Rush), Genevieve Morrissey (Clontarf), Hannah Little (Pembroke), Isabelle McLean (The Hills), Jane Maguire (The Hills), Jenny Sparrow (Leinster), Julie McNally (Clontarf), Lara Maritz (Balbriggan), Niamh MacNulty (Merrion), Shauna Kavanagh (WK) (Pembroke), Siúin Woods (YMCA), Sophie MacMahon (Leinster). Scorchers captain Gaby Lewis said: “Preparations have been going really well - we started pretty early as a team, which has been great. While I’ve been away at the Fairbreak Invitational, vice-captain Sophie MacMahon has been leading the group and has kept me in the loop. As back-to-back double winners, we’re definitely there to be shot at. Year-on-year the competitiveness of the Super Series has improved – this year should be no different. “It’s great to see the new players coming through. I think that was the benefit of the Under-19 World Cup to see those players really shine under pressure, and it’s great to have that there. Competition for places in the team will be intense – and that will only drive standards higher still. “As a platform for international honours, the Super Series has shown its worth in recent years. A good season, playing well in the Super Series, can change everything. It’s obviously a step down from international level, but if you do well, the next thing is a senior call up, so it’s very exciting to have those opportunities for the girls as well.” Leah Paul (capt) (Merrion), Abbi Harrison (Waringstown), Alana Dalzell (Bready), Amy Caulfield (Muckamore), Amy Hunter (WK) (Malahide/Instonians), Aoife Fisher (CSNI), Arlene Kelly (Malahide), Cara Murray (Saintfield/Waringstown/Clontarf), Jemma Gillan (CSNI), Jenni Jackson (Eginton), Jess Mayes (CSNI), Kate McEvoy (YMCA), Kia McCartney (Coleraine), Mollie Devine (Fox Lodge), Orla Prendergast (Pembroke), Zara Craig (Eglinton). Dragons head coach James Cameron-Dow said: “I’m obviously looking forward to the season, especially in our second season since our return to the competition. Hopefully, we’ll be able to build on some of the things that we did last year and a few processes that we are trying to put in place. It’s been difficult in the winter with the dynamics of the squad, everyone coming from all over the place. But you know, the girls have all been working very hard in their different groups and in their different unions, and it’s just about bringing that all together now as we come closer to the season. “It’ll be interesting to see how the new players coming in will cope and where they’re at in comparison to the rest of the girls. There will certainly be competition for places, but at the same time it will be very difficult to set the expectations and targets based on the nature of the competition and the availability of players and so on. I think just as long as we play good cricket, tick the right boxes and do what we set out to do, I’ll be happy enough with that. We’re going to be a little bit more focused on ourselves and how we go about things, and less focused on where we finish with regards to results and logs and how we compete in other games. So that’s pretty much the expectation for us this year. “Personally, I really enjoy the coaching role. It’s a challenge getting them all together at the same time on a regular basis, but this year we’re a little bit clearer on what we are trying to do as a squad and how we want to go forward. Now we’re just putting that into practice. “I think the women’s game in the North is getting stronger every year, but it’s a patience game - trying to put in the right structures and the right processes in place. We’re getting there, and it’s exciting to be part of the journey.” Rebecca Stokell (capt) (Merrion), Alice Tector (YMCA), Alice Walsh (Clontarf), Ava Canning (Leinster), Celeste Raack (Merrion), Freya Sargent (Clontarf), Georgina Dempsey (YMCA), Jane Butterly (Rush), Joanna Loughran (Leinster), Lara McBride (The Hills), Laura Delany (Leinster), Louise Little (Pembroke), Mary Waldron (WK) (Pembroke), Rebecca Gough (The Hills), Sarah Forbes (YMCA), Sinead Thompson (Clontarf). Typhoons head Paul Davidge coach said: “I’m very much looking forward to this season with the Typhoons. Following the experiences many of our players had at either the Under-19 or Senior World Cup this winter we have a squad of players who have a much stronger foundation to build from. As the Super Series continues to evolve, so does the players’ desire to put in stand-out performances, which in turn will make their case for national selection stronger. “We have clear targets and expectations set out to all of the players. We’ve challenged players with the prospect of performing in pressurised situations and to back themselves to play naturally and with complete freedom. We have clear outlines and aims for our winter training, which are directly linked to our plans for the season. “It’s great having more time with the group this year. We have already had three pre-season sessions and have a further three before the first game. It is an exciting time for this squad, and I am looking forward to working alongside some very talented players once again. We feel much more settled this year and the group has a real togetherness that will put us in a strong position as we head into the first games.” New to Super Series captaincy, Typhoons captain Rebecca Stokell said: “I was very proud when Paul called and asked me to take on the role during the winter. I had an opportunity to captain some of the games at the end of last season when Dells (Laura Delany) was injured, so was very happy to take it on properly this year. “It’s exciting the number of new girls that have joined the competition – many of them really impressed at the Under-19’s World Cup and put their names forward, so it’ll be really exciting to see what they can do at this level. The aim for us this season is to start with a positive, fearless brand of cricket. We don’t want to carry any baggage from last season. We’ve been unlucky with injuries previously and with new faces to the squad we are ready to turn a corner.” All matches will be livestreamed (announcement made shortly) and live-scored on our Match Centre .","pubDate":"2023-04-26 14:04:26","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Series Against New Zealand A Brilliant Opportunity To Fine-Tune Our Combinations, Says Babar Azam","link":"https://www.thetimesofbengal.com/sports/series-against-new-zealand-a-brilliant-opportunity-to-fine-tune-our-combinations-says-babar-azam/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Series Against New Zealand A Brilliant Opportunity To Fine-Tune Our Combinations, Says Babar Azam The two sides will begin the ODIs after an exciting five-match T20I series ended in a 2-2 draw on Monday.\r Published: April 26, 2023 6:03 PM IST By IANS Babar Azam and Tom Latham pose with the trophy ahead […]","content":"Home Sports Series Against New Zealand A Brilliant Opportunity To Fine-Tune Our Combinations, Says Babar Azam The two sides will begin the ODIs after an exciting five-match T20I series ended in a 2-2 draw on Monday.\r Published: April 26, 2023 6:03 PM IST By IANS Babar Azam and Tom Latham pose with the trophy ahead of the PAK vs NZ series 2023. (Pic: Twitter/ Pakistan Cricket) Rawalpindi: Pakistan skipper Babar Azam stated the upcoming home ODI series against New Zealand, starting at the Pindi Cricket Stadium here on Thursday, is a brilliant chance for his team to fine-tune their combinations while starting their road to prepare for the Asia Cup and ICC Men’s Cricket World Cup 2023. After the series starts from Rawalpindi, the city will also host the second ODI on Saturday, followed by the two teams playing the remaining three matches in Karachi. The two sides will begin the ODIs after an exciting five-match T20I series ended in a 2-2 draw on Monday. “Every match that we play from now on holds great significance for us. This series is a brilliant opportunity for us to fine-tune our combinations and gather the momentum ahead of the mega events in the shape of the Asia Cup and the much-anticipated World Cup,” said Azam in a statement issued by PCB. Pakistan’s record since the start of last year in ODIs has been a remarkable one, beating Australia (2-1), West Indies (3-0), and the Netherlands (3-0) before losing to New Zealand (2-1) earlier in the year in Karachi. They are also scheduled to play three ODIs against Afghanistan in August. ‘This team has done well in the past one year in the one-day format and I have firm faith in my boys that they will perform according to expectations in the exciting next seven months,” added Azam. On the other hand, New Zealand skipper Tom Latham believes adjusting to the conditions and adapting to the format will be a challenge for his team. The visitors will also be on the hunt for an ideal number three batter in the absence of injured Kane Williamson, who is on the road to recovery after rupturing the ACL in his right knee while fielding on the opening day of IPL 2023 and underwent surgery for the same. “The T20Is proved an outstanding series and we’re looking forward to switching to one-day mode now. The preparation wasn’t ideal but for us, that wasn’t an excuse. It was about just keep getting better game by game and keep learning. We did that and to come out with a series draw after being two down was awesome,” said Latham. Thursday’s match will be the first between the two sides at the Pindi Cricket Stadium in 20 years. In 2003, New Zealand played two ODIs and lost both by seven wickets and 49 runs. A year earlier, Pakistan had defeated New Zealand by three wickets. ‘It’s going to be a tough ODI series on the back of what this T20I series has produced. We have seen some great games of cricket and the one-day series is going to be no different. It’s a new format, and we have to adapt quickly. Hopefully, we can do that straight away,” added Latham. Both Pakistan and New Zealand have qualified directly for the ICC Men’s Cricket World Cup 2023 after finishing in the top eight of the 13-team ICC Men’s Cricket World Cup Super League. Published Date: April 26, 2023 6:03 PM IST $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-04-26 13:40:04","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Certa to fuel Ireland Women’s cricket team’s drive for success on world stage","link":"https://www.cricketireland.ie/news/article/certa-to-fuel-ireland-womens-cricket-teams-drive-for-success-on-world-stage","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN - Certa, Ireland’s largest fuel supplier, is set to fuel Cricket Ireland’s ambition to develop women’s cricket as a major sport in Ireland, and to develop into a major nation in world cricket, after becoming the new title sponsor of the Ireland Women’s cricket team.","content":"Certa, which is part of DCC plc, is a new brand operating in the fuel, home, business and lubricants space with a vision to become Ireland’s most progressive energy company. It operates Ireland’s largest network of unmanned, pay@pump forecourts and home heating depots. The two-year partnership comes at a very exciting time for women’s cricket in Ireland, with Cricket Ireland becoming only the second sport in Ireland to offer full-time professional playing contracts for women last year, while the senior squads’ eye-catching performances against the world’s best teams have already seen them become the 10th ranked team in the world rankings. Certa will empower the team to continue pushing new boundaries and to perform competitively against the top nations in women’s cricket. It will also help the sport to thrive from grassroots to elite level and to inspire young players to follow their dream of becoming professional cricket players in Ireland. Certa is part of communities all over Ireland with 39 unmanned, pay@pump forecourts and 22 home heating depots. It will develop campaigns that harness this network to raise awareness of the Ireland Women’s cricket team, to create a better understanding of the sport, and to build the profile of its rising stars. Team captain Laura Delany and star player Gaby Lewis will take on roles as Certa Brand Ambassadors. They will support the company’s drive to connect people and businesses to the most progressive energy solutions available and to reduce their carbon footprint by switching to Hydrotreated Vegetable Oil (HVO) as a sustainable fuel. 23 players have been offered professional women’s playing contracts for 2023. The new partnership with Certa has been announced as the Ireland Women’s team prepares to compete against recently crowned T20 World Champions, Australia, who are set to visit Clontarf for a three-match ODI series this July. The Ireland Women’s team secured a memorable win over Australia in a T20 World Cup warm-up game and are aiming to repeat the feat with home support. The series will be preceded by a six-match tour to the Caribbean for a series against the West Indies and will be followed by a three-match tour to the Netherlands. Andrew Graham , Managing Director, Certa Ireland said: “Certa is excited to get behind such a progressive sport and trailblazing team. These women are the rising stars of Irish sport, and they share our values of pushing new boundaries and challenging the status quo. Their achievements are an inspiration to people of all ages, and they deserve a bigger spotlight. “In little over one year, they have introduced full-time professional contracts in Ireland that have already raised their standard of competitiveness against the world’s best teams. Their culture of high performance and pursuit of excellence is shared by everyone at Certa, and we look forward to working together to move the dial on how the Ireland Women’s cricket team performs and advances through the world rankings.” Warren Deutrom , Chief Executive of Cricket Ireland said: “We are delighted to announce this partnership with Certa as the new title sponsors of the Ireland Women’s cricket team. This is a great step forward for women’s cricket in Ireland, and to take this step with a renowned Irish brand is genuinely exciting. Certa and Cricket Ireland will be working together to grow the profile, brand and engagement of women’s and girls’ cricket, from grassroots to elite level. “The Ireland Women’s cricket team have demonstrated over the last couple of years that they are able to compete with the best teams in the world. The experience that this young squad is gaining is invaluable to their ongoing development and to the profile of cricket in Ireland. We are very much looking forward to the summer fixtures against Australia, the West Indies and the Netherlands. It continues to be an exciting time for Ed Joyce and his squad, and we wish them all the best in the exciting next couple of years with our new partners.”","pubDate":"2023-04-26 13:32:49","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Sicily sorry for Tassie jibe; Pendlebury cleared of serious damage after eye poke; Bont’s Dunkley spur;","link":"https://www.smh.com.au/sport/afl/hawks-weigh-up-immediate-senior-return-for-lewis-lyon-calm-amid-saints-hype-20230426-p5d3ff.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"," Michael Gleeson and Jake Niall"],"video_url":null,"description":"Hawthorn skipper James Sicily apologises after upsetting a former Australian cricket captain with his remarks about Tasmania, while Collingwood champion Scott Pendlebury has been cleared of serious eye damage, and Marcus Bontempelli explains how Josh Dunkley’s exit was a spur for him to become the league’s clearance king.","content":"Andrew Wu Hawthorn skipper James Sicily has apologised for “flippant” comments he made about Tasmania’s lifestyle, which created a social media storm involving two former Australia cricket captains. What started as a casual chat on breakfast radio about the Apple Isle’s potential difficulties in retaining players finished in a late night mea culpa after Sicily’s remarks raised the hackles of Tassie cricket royalty Matthew Wade and Tim Paine. James Sicily caused a social media stir with his comments about Tasmania’s lifestyle. Credit: Getty Images On face value, Sicily’s quip that “there’s not much happening” in Tasmania seemed harmless enough, but the state government has been a long-term sponsor of the Hawks and earlier this year extended their partnership with a two-year deal worth $13.5 million. After a long struggle for its own team in the AFL, Tasmania is on the verge of securing the league’s 19th licence after the federal government pledged a $240 million commitment to build a new stadium. The announcement is expected to be made this weekend by Prime Minister Anthony Albanese. Speaking on RSN on Wednesday morning, Sicily said he believed Tasmania would have trouble holding on to players because of its quieter way of life. “I think so, particularly as a young guy, because there’s not much happening,” Sicily, who has played 22 games in Tasmania, said. “It would be quite difficult, I couldn’t imagine myself living there as a young fella. It’s a difficult one. I’ve only spent time in Launy, Hobart’s a bit different, there’s a little bit more happening in Hobart. “I haven’t had too much experience in Hobart. It would be hard.” The remark drew a hand on face emoji from former Test captain Paine and a sterner response from former national T20 skipper Wade, who has a reputation for his aggressive play with the bat and behind the stumps. “Tassie people have been fighting years for the chance to get an AFL team. Comments like this do not help us working towards our chance at showing just how good our little state is and will be with our own team,” Wade wrote on Instagram late Wednesday afternoon. “@jsicily6 Whenever you want the door is open to come down and I can show you around our boring island if you like!” Sicily apologised several hours later, saying in a statement that referred to Tasmania’s tourist attractions that he was fully supportive of the state having its own club. “I want to apologise to anyone I have offended or upset about my comments on Tasmania today,” Sicily wrote. “The comments I made on RSN were flippant, and do not reflect my views of Tasmania. “What I said related to my personal situation, that throughout my career, my attachment to Melbourne would have made it hard to live in Tassie full time. “That’s not to say there are not many AFL footballers who would enjoy living there. “I love coming down to Tassie to stay and play, I visit Tassie yearly outside of football to enjoy its golf courses and food. I’m proud of our long-term relationship with the state and I continue to support Tasmania getting its own team. (thumbs up emoji).” Michael Gleeson, Jake Niall Collingwood champion Scott Pendlebury has been cleared of serious eye damage after getting a poke in the eye in the last quarter of the Anzac Day win over Essendon. Pendlebury consulted an eye specialist and was cleared of serious damage from the blow. He will be re-assessed later in the week but is expected to be clear to play against the Crows in Adelaide on Sunday afternoon. Scott Pendlebury copped a knock to the face during the last quarter on Tuesday. Credit: AFL Photos Pendlebury went from the ground in pain and bleeding after being struck in the face via an accidental knock in a marking contest. He stayed down and was bleeding heavily from the nose and had suffered the poke in the eye at the same time. Pendlebury’s teammate Mason Cox had suffered serious damage from a similar poke in the eye in a previous incident. However, Cox’s injury uncovered an underlying retinal issue that sidelined him at length and then required him to wear protective prescription glasses when he plays. Essendon key defender Jayden Laverde will need to have shoulder surgery and will be sidelined for some time in a blow to Essendon’s otherwise promising start to the season. Laverde suffered what coach Brad Scott said was an AC joint injury during the Bombers’ loss to Collingwood on Tuesday . He was subbed out in the third quarter. These injuries are typically less serious than shoulder dislocations, but he will still require surgery. Andrew Wu Top dog Marcus Bontempelli used Josh Dunkley’s departure from the kennel as the spur to become the league’s clearance king. After an underwhelming 2022, the Bulldogs captain has been instrumental to his club’s resurgence after a poor start to the season, re-establishing himself as one of the game’s premier midfielders. Marcus Bontempelli is number one for clearances after six rounds. Credit: Getty For a player who was needled as a junior by his uncle for being too “clean”, Bontempelli said he made a concerted effort to get his paws dirty to fill the void left by reigning club champion Dunkley, who defected to Brisbane. Bontempelli’s focus on the blue-collar side of the game is reflected in him returning career-best numbers for contested possessions, clearances and tackles. Noted stoppage beasts Patrick Cripps , Lachie Neale and Clayton Oliver are all chasing Bontempelli, whose 51 clearances place him at the top of the pile. “Losing Josh was a big talking point, he was a very combative inside player for us,” Bontempelli said on Wednesday before his 200th game this weekend. “He took care of that with Tom [Liberatore] and others at different points when we’ve been dominant in our years at the football club. “Someone like that in that area of the game does leave a bit of a hole. We all discussed trying to discuss the parts of the game Josh did really well. So far this year I’ve looked to fill that gap, explore that part of my game and still let the front half game be a key factor. “You’re always looking for new strings to add to your bow and that’s been me this year.” Bontempelli acknowledged Tim English’s emergence as one of the game’s best ruckmen had helped him hone his stoppage craft. As a player who thrives on leading through his on-field deeds, last year was a particular struggle for Bontempelli, who, dogged by injury, was unable to lift his club out of their mid-table struggles. He detailed his physical and emotional struggles in an interview with this masthead on the eve of this season. Six rounds into the season, it is evident Bontempelli can now be the captain he wants to be. “There’s no doubt as a leader at this football club and captain you wear the responsibility of when things aren’t going well, and you do try and lead in a way that’s going to get the most immediate impact,” Bontempelli said. “For me, that’s how I ended up in the position at the football club because I valued the on-field performance so much and really tried to instigate, be someone who can start and shift momentum. “We’ve had a number of players who have been able to do that a lot in the past. You do feel the responsibility, definitely at times on-field to try and turn the tide or set the tone really early. “It’s something I will always really value and try to do as much as I can until the curtain comes down.” Bontempelli paid tribute to his uncle, Jim Hunt, whose tough love as a junior coach pushed him and his cousin Liam to go over and above. “He always used to think my football was a bit clean so I tend to let him know if I had more than four or five tackles - he never used to think I tackled,” Bontempelli said. “I’ve got him to thank ... for being particularly hard on me. “Uncles seem to be that way, particularly if they’re your coach. They seem to really pump up the other boys. We had to play extra special, me and Liam, to get any accolades from Jim. Him coaching us from a young age definitely trains that extra level of excellence in you.” Andrew Wu Hawthorn spearhead Mitch Lewis will almost certainly be rushed straight into the senior side this week to bolster the Hawks’ flagging forward line. Lewis has not played at any level this season after spraining his anterior cruciate ligament in late January, an injury that was expected to sideline him for the first month of the season. The Hawks had been looking at a return in round four or five, but that was pushed back due to an issue with his other knee . Lewis, who last played in round 20 last year, has one more main training session to get through and appears destined to take on the Western Bulldogs on Saturday at Marvel Stadium. Mitch Lewis is expected to play his first competitive game this week. Credit: Getty Though short of match practice, Lewis has trained with the main group for a month to build on his conditioning, gradually increasing his exposure to contact. “I’m 99 per cent confident that the coaches will pick him in the AFL – so it’s all very positive, he’s ready to play football,” Hawks high-performance manager Peter Burge said. “He’s been really strong on the track – he did a game-length session on Sunday while we were playing in Tassie. “We’ve replicated game loads in terms of all the running metrics, he’s been doing full contact for the last two weeks. “He’s ticked every box, every piece of information suggests he’s ready to play.” In Lewis’ absence, the Hawks have mainly fielded an undersized forward line without the traditional taller focal point. Lewis would add firepower to a Hawks forward line that ranks last for points scored after the first six rounds. A fifth-round selection in the 2016 draft, Lewis cemented himself as the Hawks’ No.1 key forward last year with 37 games in 15 games. Prized youngster Will Day will come back after serving a two-match suspension. The 21-year-old had been one of the Hawks’ best players in the first month of the season. AAP While he doesn’t expect to go through the AFL season without another loss, St Kilda coach Ross Lyon sees no reason why they can’t maintain their table-topping status. The Saints remained ladder leaders - ahead of Collingwood on percentage - after nailing their fifth win of the campaign with a victory over Carlton on Sunday. Their only blip has been a one-goal loss to the Magpies in round five . Last season they held the same win-loss record after six rounds, although sat fifth with four teams locked on 20 points trailing runaway leaders Melbourne. Ahead of Friday night’s clash with Port Adelaide at Marvel Stadium, gun-shy fans are wary of the Saints falling away like in 2022 when they dropped four games between rounds 12 and 15 to drop out of the eight for the remainder of the season. Aware the “narrative” could quickly change on the back of some losses, Lyon said on Wednesday he could see the team continuing to improve. “Our goals are really clear - every session give us as much as we can, concentrate and learn,” Lyon said when asked if expectations had changed given their early success. “We’re just in a state of continuous improvement. “You can’t play in finals until you’ve earnt the right, so we’re all just inching forward because if you look too far ahead, you sort of trip over, so we’re just going to stay in the moment. “We believe in what we’re doing, but we understand there’s going to be challenges so we’ll just keep chipping away at it.” Lyon said it was exciting to be able to add star players to the mix, with key forward Max King nearing a return from a shoulder reconstruction . Brad Crouch celebrates with Saints fans after the win over Carlton. Credit: AFL Photos While no date has been set, the 22-year-old joined in the first three drills of the main session on Wednesday. “He’s rehabbing really well, he trained incredibly on the weekend ... he’s been basically up to 100 per cent speed over the last few weeks so that’s getting exciting,” Lyon said. “Tim Membrey came back in and added a bit, and it’s great to be able to add players throughout the year - clearly Max King is a pretty important asset for us.” Jack Billings is also in the selection mix after impressing in the VFL on Sunday in his first game back from a broken leg. The clash against seventh-placed Port is St Kilda’s first on the big Friday night stage, but Lyon felt they could handle the pressure. “I think we’ve handled a lot of pressure this year ... there’s in-built expectations to perform in a high-performance environment. “Port Adelaide are a really strong club, well-coached, so we expect a fierce battle.” Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter .","pubDate":"2023-04-26 12:58:57","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Chandrakant Pandit Hopeful Of KKR’s Comeback In Second-Half of IPL 2023, Says This Is The Beginning","link":"https://www.thetimesofbengal.com/sports/chandrakant-pandit-hopeful-of-kkrs-comeback-in-second-half-of-ipl-2023-says-this-is-the-beginning/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Chandrakant Pandit Hopeful Of KKR’s Comeback In Second-Half of IPL 2023, Says This Is The Beginning KKR returned to winning ways, with two consecutive wins, including a last-over win against GT where Rinku Singh hit 5 sixes in the final over. Published: April 26, 2023 5:06 PM IST By IANS ‘This Is The […]","content":"Home Sports Chandrakant Pandit Hopeful Of KKR’s Comeback In Second-Half of IPL 2023, Says This Is The Beginning KKR returned to winning ways, with two consecutive wins, including a last-over win against GT where Rinku Singh hit 5 sixes in the final over. Published: April 26, 2023 5:06 PM IST By IANS ‘This Is The Beginning’, Chandrakant Pandit Hopes For KKR Comeback In IPL 2023. (Pic: IANS) New Delhi: Kolkata Knight Riders (KKR) head coach Chandrakant Pandit has voiced his confidence in his team’s ability to make a formidable comeback in the second half of the IPL 2023, saying the team is looking forward to starting afresh. After a close defeat to Punjab Kings in the tournament opener, KKR returned to winning ways, with two back-to-back wins, including a last-over thriller against Gujarat Titans where Rinku Singh hit 5 sixes in the final over, before losing their next four fixtures on the bounce to be placed eighth in the 10-team points table with just 2 wins from 7 outings. “This is the beginning, I would say, this is the beginning again in the 2nd half. Winning the first game, we have beaten them earlier. That confidence we should have. I am sure that just one spark in our team that will take us forward,” Chandrakant Pandit said in a video shared by KKR. “One has to be very optimistic. I mean, how I look at this tournament now is that the tournament is starting for us from tomorrow. And that is a positive angle from which I look at it. Obviously, a different environment has been created and the confidence level which we had in the first-half, we shouldn’t forget about that,” he added. The head coach further highlighted that the team’s overall performance was not poor and there were some exceptional individual displays duringa four-match losing streak. “It’s not that we have not been playing good cricket. So, every individual player has raised his hand, and shown us that he is ready to take responsibility,” he said. Chandrakant also said that he got good vibes as soon as he stepped into the dressing room at the M Chinnaswamy Stadium, where Madhya Pradesh clinched their maiden Ranji Trophy title last year. The head coach is optimistic that the venue could mark the turning point for his team in IPL 2023. “It’s a great memory that I cannot forget. Just last season, a year before, Madhya Pradesh won the trophy here. As soon as I entered the dressing room, it gave me that positivity that this is where we are going to start the second half and we are going to be killing it,” he said. Published Date: April 26, 2023 5:06 PM IST $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-04-26 12:50:55","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"}]}