{"newsArray":[{"title":"WTC Final में जीत का दावा करने वालों की हरभजन सिंह ने खोली पोल, बोले- नकली है टीम इंडिया का कॉन्फिडेंस","link":"https://hindi.oneindia.com/news/sports/cricket/harbhajan-singh-says-fake-confidence-by-winning-on-bad-matches-wtc-final-2023-781226.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के खिलाफ विश्व टेस्ट चैंपियनशिप के फाइनल में टीम इंडिया की हार के बाद हरभजन सिंह ने बड़ा बयान दिया है। उन्होंने कहा कि स्पिन के लिए अनुकूल भारतीय पिचों पर सिर्फ तीन दिन के भीतर टेस्ट मैच खत्म करके भारत खुद को बड़े मुकाबलों के लिए पूरी तरह से तैयार नहीं कर सकता है और उन्हें सभी पांच दिनों तक कड़ी मेहनत करने की जरूरत है।","content":"वर्ल्ड टेस्ट चैंपियनशिप फाइनल में ऑस्ट्रेलिया के खिलाफ टीम इंडिया को पूरी उम्मीद दी थी कि वो ट्रॉफी लेकर ही लौटेंगे। खिलाड़ियों में आत्मविश्वास की कोई कमी नहीं थी, मोहम्मद शमी ने तो यहां तक कह दिया था कि 100 प्रतिशत हर किसी को भरोसा है कि हम ये मैच जीतेंगे, लेकिन आगे क्या हुआ वो सभी को पता है। इस बीच अब पूर्व भारतीय स्पिनर हरभजन सिंह ने टीम इंडिया के इस आत्मविश्वास को फेक कॉन्फिडेंस बताया है। द ओवल में ऑस्ट्रेलिया के खिलाफ भारत की हार के बाद हरभजन सिंह ने भारत में अत्यधिक स्पिन फ्रेंडली पिचों पर सवाल उठाए हैं और बताया है कि कैसे बड़े मैचों के लिए भारत की तैयारी को प्रभावित करता है। द ओवल में फाइनल में भारत के खिलाफ 209 रनों से आईसीसी विश्व टेस्ट चैम्पियनशिप खिताब जीतने के बाद ऑस्ट्रेलिया ने सभी फॉर्मेट में आईसीसी ट्राफियां जीतकर इतिहास रच दिया। पांच दिनों तक भारत पर हावी रहने के बाद ऑस्ट्रेलिया ने रविवार को लंदन में अपना पहला विश्व टेस्ट चैंपियनशिप 2023 का खिताब हासिल किया। हरभजन ने कहा कि स्पिन की मददगार भारतीय पिचों पर सिर्फ तीन दिन के अंदर टेस्ट मैच खत्म करके भारत खुद को बड़े मुकाबलों के लिए पूरी तरह से तैयार नहीं कर सकता और उन्हें पूरे पांच दिन कड़ी मेहनत करने की जरूरत है, और इसे अपनी आदत बना लेना चाहिए। मैच के बाद स्टार स्पोर्ट्स पर हरभजन ने कहा, 'आप खराब पिचों पर मैच खेलने और जीतने के बाद खुद को वह नकली आत्मविश्वास नहीं दे सकते, जहां गेंद पहली गेंद से घूमने लगती है। आपको पांच दिनों तक कड़ी मेहनत करने की आदत डालनी होगी। तेज गेंदबाजों को इन पिचों पर ज्यादा गेंदबाजी करने का मौका नहीं मिलता है, पहले ओवर से ही स्पिनरों का इस्तेमाल किया जाता है। हमें बहुत सी चीजों में सुधार करना चाहिए।' इस साल की शुरुआत में ऑस्ट्रेलिया के खिलाफ हाल ही में समाप्त हुई बॉर्डर-गावस्कर ट्रॉफी में स्पिन गेंदबाज काफी सफल साबित हुए थे और चार में से तीन टेस्ट तीन दिनों में समाप्त हुए। इस दौरान रविचंद्रन अश्विन (25 विकेट), रवींद्र जडेजा (22) और नाथन लियोन (22) ने सबसे अधिक विकेट लिए। हालांकि, ऑस्ट्रेलिया के खिलाफ इंडियन टीम में अश्विन को प्लेइंग-11 में जगह न देने पर कप्तान रोहित शर्मा की काफी आलोचना हुई।","pubDate":"2023-06-13 07:35:00","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"'ऑस्ट्रेलियाई टीम चुस्त और भारत सुस्त,' मोहम्मद कैफ ने टीम इंडिया की फील्डिंग पर कही तीखी बात","link":"https://hindi.oneindia.com/news/sports/cricket/wtc-final-indian-fielding-was-lazy-says-mohammed-kaif-781222.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय टीम की फील्डिंग को लेकर मोहम्मद कैफ ने बड़ी प्रतिक्रिया दी है। कैफ ने कहा है कि ऑस्ट्रेलिया ने फुर्ती दिखाई लेकिन भारत के फील्डर बिलकुल आलसी दिखाई दे रहे थे।","content":"ऑस्ट्रेलिया के खिलाफ वर्ल्ड टेस्ट चैम्पियनशिप के फाइनल मैच में भारतीय टीम से हुई गलतियों की तरफ हर कोई इशारा कर रहा है। बातें हो रही हैं और विश्लेषण भी सामने आ रहे हैं। मोहम्मद कैफ ने दोनों टीमों की फील्डिंग को लेकर अहम बयान दिया है। कैफ ने ऑस्ट्रेलिया की फील्डिंग को भारत से बेहतर बताया। उन्होंने कहा कि भारतीय टीम मौकों का फायदा उठाने में नाकाम रही। ऑस्ट्रेलियाई टीम मैदान पर ज्यादा चुस्त दिखाई दे रही थी। कंगारुओं ने अपने पास आए मौकों का लाभ बखूबी उठाया। इंडियन एक्सप्रेस की एक रिपोर्ट के अनुसार कैफ ने स्लिप फील्डिंग को अहम मानते हुए कहा कि यहाँ कॉर्डिनेशन ख़ास होता है क्योंकि स्लिप एक अहम पोजीशन है। इंग्लैंड में गेंद मूव ज्यादा होती है इस वजह से ज्यादातर आउट विकेट के पीछे होते हैं। इस वजह से स्लिप का फील्डर हर समय गेम में अहम होता है। कैफ ने कहा कि आप कैच मिस नहीं कर सकते। मैदान पर जाने से पहले आपको इन चीजों का हल निकालना होता है। पुजारा स्लिप में पैड पहनकर खड़े थे। इसे लेकर कैफ ने कहा कि यह सुस्ती दर्शाता है। फील्डर सोचता है कि स्लिप में कैच नहीं आएगा। खेल के अहम क्षणों में भारत किसी भी तरह की चूक बर्दाश्त नहीं कर सकता था। पूर्व भारतीय खिलाड़ी ने कहा कि पैड पहनने से आप ज्यादा हिल नहीं सकते और पूरी तरह से झुक भी नहीं सकते। ये ऐसी गलतियाँ हैं जिनको मैंने पहली बार नहीं देखा है। इस तरह की चीजें पहले भी होती दिखी हैं। कोई भी इन पर ज्यादा ध्यान नहीं देता है। गौरतलब है कि ऑस्ट्रेलिया के खिलाफ इस अहम मैच में भारत की स्लिप फील्डिंग भी खास नहीं थी। दूसरी तरफ ऑस्ट्रेलिया की टीम मुस्तैदी के साथ मैदान पर थी। स्मिथ और कैमरन ग्रीन ने अपने शानदार कैच लेकर मजबूत फील्डिंग का अहसास करा दिया था।","pubDate":"2023-06-13 07:23:35","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sourav on Virat: 'আমরাও অবাক হয়ে গিয়েছিলাম', বিরাট অধিনায়কত্ব ছাড়া নিয়ে ফের বিস্ফোরক সৌরভ","link":"https://bengali.abplive.com/sports/cricket/sourav-ganguly-claims-virat-kohli-s-resignation-from-captaincy-was-unexpected-for-bcci-too-985165","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"নয়াদিল্লি: সাম্প্রতিক সময়ে বিরাট কোহলি (Virat Kohli) ও সৌরভ গঙ্গোপাধ্যায়ের (Sourav Ganguly) মধ্যেকার সম্পর্ক তথা বিবাদ বারংবার শিরোনাম কেড়েছে। সৌরভের বিসিসিআইয়ের সভাপতি থাকার সময়ই বিরাট কোহলি জাতীয় দলের অধিনায়ক পদ থেকে পদত্যাগ করেছিলেন বিরাট। সেই নিয়ে অনেক জল্পনা-কল্পনা চলেছে। সৌরভ দাবি করেছিলেন বোর্ড বিরাটকে ইস্তফা না দেওয়ার আবেদন করেছিল। তবে বিরাট সম্পূর্ণ ভিন্ন দাবি করেন। তারপর গঙ্গা দিয়ে অনেক জল বয়ে গিয়েছে। তবে সৌরভ কিন্তু নিজের দাবিতে অনড়। তিনি বলেন, 'বিরাট কোহলির টেস্ট অধিনায়কত্ব ছাড়ার জন্য কিন্তু বিসিসিআই প্রস্তুত ছিল না। দক্ষিণ আফ্রিকা সফরের পর হঠাৎ করে এমন একটা সিদ্ধান্ত আমাদের সকলকেই চমকে দিয়েছিল। আমরা সবাই অবাক হয়ে গিয়েছিলাম। শুধু কোহলিই জানে ও কেন অধিনায়কত্ব থেকে সরে দাঁড়াল। তবে এখন আর এ বিষয়ে কথা বলার কোনও মানে নেই। নির্বাচকদের তো একজনকে অধিনায়ক নিয়োগ করতেই হত। রোহিতই ওই সময় সেরা বিকল্প ছিল।' বিরাটের অধিনায়কত্বে ভারতীয় দল বিদেশের মাটিতে বিশেষত টেস্টে দুর্দান্ত পারফর্ম করলেও, কোনও আইসিসি ট্রফি জিততে পারেনি। বিরাটের পর রোহিতের অধিনায়কত্বেও কিন্তু এই নিয়ে দুই বছরে দ্বিতীয় আইসিসি খেতাব হাতছাড়া করল ভারত। এই নিয়ে অনেকেই আইপিএলকে কাঠগড়ায় দাঁড় করাচ্ছে। এরই মাঝে সৌরভের দাবি বিশ্বকাপ জেতার থেকে কিন্তু আইপিএল জেতা অনেক কঠিন। তিনি বলেন, 'আইপিএল জেতাটা বিশ্বকাপ জয়ের থেকে অনেক বেশি কঠিন। গ্রুপ পর্বে ১৪টি ম্যাচ খেলার পর প্লে অফ খেলতে হয় আইপিএলে। সেখানে বিশ্বকাপে চার পাঁচটি ম্যাচ খেলার পরেই দলগুলি সেমিফাইনাল এবং সেখান থেকে ফাইনালে পৌঁছয়।' আরও পড়ুন: চুলের রুক্ষ-শুষ্ক ভাব দূর করতে সারাবছরই প্রয়োজন যত্ন, কীভাবে পরিচর্যা করবেন?","content":"নয়াদিল্লি: সাম্প্রতিক সময়ে বিরাট কোহলি (Virat Kohli) ও সৌরভ গঙ্গোপাধ্যায়ের (Sourav Ganguly) মধ্যেকার সম্পর্ক তথা বিবাদ বারংবার শিরোনাম কেড়েছে। সৌরভের বিসিসিআইয়ের সভাপতি থাকার সময়ই বিরাট কোহলি জাতীয় দলের অধিনায়ক পদ থেকে পদত্যাগ করেছিলেন বিরাট। সেই নিয়ে অনেক জল্পনা-কল্পনা চলেছে। সৌরভ দাবি করেছিলেন বোর্ড বিরাটকে ইস্তফা না দেওয়ার আবেদন করেছিল। তবে বিরাট সম্পূর্ণ ভিন্ন দাবি করেন। তারপর গঙ্গা দিয়ে অনেক জল বয়ে গিয়েছে। তবে সৌরভ কিন্তু নিজের দাবিতে অনড়। তিনি বলেন, 'বিরাট কোহলির টেস্ট অধিনায়কত্ব ছাড়ার জন্য কিন্তু বিসিসিআই প্রস্তুত ছিল না। দক্ষিণ আফ্রিকা সফরের পর হঠাৎ করে এমন একটা সিদ্ধান্ত আমাদের সকলকেই চমকে দিয়েছিল। আমরা সবাই অবাক হয়ে গিয়েছিলাম। শুধু কোহলি ই জানে ও কেন অধিনায়কত্ব থেকে সরে দাঁড়াল। তবে এখন আর এ বিষয়ে কথা বলার কোনও মানে নেই। নির্বাচকদের তো একজনকে অধিনায়ক নিয়োগ করতেই হত। রোহিতই (শর্মা) ওই সময় সেরা বিকল্প ছিল।' ভারত রোহিতের অধিনায়কত্বে টেস্টের সেরা হওয়ার সুযোগ হাতছাড়া করলেও, সৌরভ কিন্তু এখনও রোহিতকে (Rohit Sharma) অধিনায়ক পদে বহাল রাখার পক্ষেই। তিনি বলেন, 'দিনের শেষে অধিনায়ক বাছাইয়ের কাজটা তো নির্বাচকদের, এই সিদ্ধান্ত সোশ্যাল মিডিয়ার দ্বারা কীভাব প্রভাবিত হতে পারে? বিরাট নিজেই বছর দুই আগে আর টেস্টে অধিনায়কত্ব করতে চায়নি। আমাকে যদি প্রশ্ন করা হয় যে ভারতের অধিনায়ক ও কোচ কার হওয়া উচিত, আমি কিন্তু এখনও রোহিত এবং রাহুলের কথাই বলব। এটাই সঠিক সিদ্ধান্ত।' বিরাটের অধিনায়কত্বে ভারতীয় দল বিদেশের মাটিতে বিশেষত টেস্টে দুর্দান্ত পারফর্ম করলেও, কোনও আইসিসি ট্রফি জিততে পারেনি। বিরাটের পর রোহিতের অধিনায়কত্বেও কিন্তু এই নিয়ে দুই বছরে দ্বিতীয় আইসিসি খেতাব হাতছাড়া করল ভারত। এই নিয়ে অনেকেই আইপিএলকে কাঠগড়ায় দাঁড় করাচ্ছে। এরই মাঝে সৌরভের দাবি বিশ্বকাপ জেতার থেকে কিন্তু আইপিএল জেতা অনেক কঠিন। তিনি বলেন, 'আইপিএল জেতাটা বিশ্বকাপ জয়ের থেকে অনেক বেশি কঠিন। গ্রুপ পর্বে ১৪টি ম্যাচ খেলার পর প্লে অফ খেলতে হয় আইপিএল ে। সেখানে বিশ্বকাপে চার পাঁচটি ম্যাচ খেলার পরেই দলগুলি সেমিফাইনাল এবং সেখান থেকে ফাইনালে পৌঁছয়।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); এবিপি আনন্দ এখন টেলিগ্রামেও, ক্লিক করুন এই লিঙ্কে https://t.me/abpanandaofficial আরও পড়ুন: চুলের রুক্ষ-শুষ্ক ভাব দূর করতে সারাবছরই প্রয়োজন যত্ন, কীভাবে পরিচর্যা করবেন? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-13 07:18:57","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/13/422cf57772b95a864d3da000316f95211686636712529507_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"अश्विन के साथ जैसा बर्ताव हुआ, वैसा किसी और क्रिकेटर के साथ नहीं : गावस्कर","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-no-other-cricketer-was-treated-like-ashwin-gavaskar-news-hindi-1-566869-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"दिग्गज बल्लेबाज सुनील गावस्कर का मानना है कि भारत में किसी अन्य शीर्ष क्रिकेटर के साथ ऐसा चौंकाने वाला बर्ताव नहीं किया गया है, जैसा शीर्ष ऑफ स्पिनर रविचंद्रन अश्विन के साथ किया गया।","content":"नई दिल्ली। दिग्गज बल्लेबाज सुनील गावस्कर का मानना है कि भारत में किसी अन्य शीर्ष क्रिकेटर के साथ ऐसा चौंकाने वाला बर्ताव नहीं किया गया है, जैसा शीर्ष ऑफ स्पिनर रविचंद्रन अश्विन के साथ किया गया। उन्हें अंतिम एकादश से बाहर रखा गया। यही वजह है कि द ओवल में वल्र्ड टेस्ट चैंपियनशिप (डब्ल्यूटीसी) फाइनल में भारत की ऑस्ट्रेलिया से 209 रनों से हार हुई। अश्विन के प्लेइंग इलेवन में होने या न होने की दुविधा डब्ल्यूटीसी फाइनल के लिए रन-अप में चर्चा का एक बड़ा विषय बना, क्योंकि भारत की गेंदबाजी नियंत्रण में नहीं थी, इसके लिए दोनों देशों के पूर्व क्रिकेटरों की कड़ी आलोचना हुई। गावस्कर ने सोमवार को मिड-डे के लिए अपने कॉलम में लिखा, आधुनिक युग में किसी भी अन्य शीर्ष-श्रेणी के भारतीय क्रिकेटर के साथ अश्विन के साथ ऐसा व्यवहार नहीं किया गया है, क्योंकि पहले के समय में उन्होंने घास वाली पिच पर रन नहीं बनाए थे या अगर उन्होंने सूखी स्पिन की अनुकूल पिच पर रन नहीं बनाए थे? निश्चित रूप से नहीं। उन्होंने कहा, यह घटना के बाद बुद्धिमान होना नहीं है, बल्कि एक पैटर्न है जो वर्षो से देखा गया है। इस सोच को समझना मुश्किल है कि वह पहले 100 से अधिक टेस्ट मैच खेल चुका होता। गावस्कर ने कहा, यहां तक कि अगर भारत को जीतना था, तो हमें अश्विन को दिए गए उपचार के लिए अंधा नहीं होना चाहिए और जो भी स्पष्टीकरण दिया गया है, उस मैच में गेंदबाजी के परिणाम जहां भारत को 444 का पीछा करने के लिए कहा गया, हमें बताता है कि उसे छोड़ना सही नहीं था, कॉल टू मेक। 92 मैचों में 51.8 की स्ट्राइक-रेट से 474 विकेट के साथ, जिसमें 32 पांच विकेट प्रति पारी शामिल हैं, अश्विन शीर्ष क्रम के टेस्ट गेंदबाज, मार्की संघर्ष से बाहर रह गए, क्योंकि भारत ने उनके मौजूद रहने के बावजूद चार तेज गेंदबाजों को प्राथमिकता दी। ऑस्ट्रेलिया के बल्लेबाजी क्रम में बाएं हाथ के पांच बल्लेबाजों में से अश्विन को 2021 और 2022 में इंग्लैंड में होने वाले भारत के मैचों से भी बाहर कर दिया गया था, जिसका कारण परिस्थितियों का हवाला दिया गया था। उन्होंने कहा, भारत ने आईसीसी रैंकिंग के अनुसार, खेल में नंबर 1 गेंदबाज रविचंद्रन अश्विन को हटा दिया। ऑस्ट्रेलियाई टीम में पांच बाएं हाथ के बल्लेबाज थे और जबकि एक बाएं हाथ के खिलाड़ी - ट्रैविस हेड - ने पहली पारी में तेज शतक बनाया, दूसरा दक्षिणपूर्वी एलेक्स कैरी ने पहली पारी में 48 और दूसरी पारी में नाबाद 66 रन बनाए। गावस्कर ने कहा, उस दूसरी पारी के प्रयास के दौरान उन्होंने एक और बाएं हाथ के मिशेल स्टार्क के साथ 93 रन जोड़े, जब भारत दूसरी पारी में ऑस्ट्रेलिया को सस्ते में आउट करना चाह रहा था। अगर अश्विन टीम में होते, तो वह बल्ले से भी योगदान दे सकते थे।(आईएएनएस)","pubDate":"2023-06-13 07:17:01","image_url":null,"source_id":"khaskhabar","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Australia’s Lyon primed to rattle England and join exclusive club","link":"https://www.dailymirror.lk/top-story-01/Australia’s-Lyon-primed-to-rattle-England-and-join-exclusive-club/316-261006","keywords":null,"creator":null,"video_url":null,"description":"Australian spinner Nathan Lyon heads into another Ashes campaign on the cusp of joining an elite group of players with 500 Test wickets -- and warning he can still get better.","content":"Australian spinner Nathan Lyon heads into another Ashes campaign on the cusp of joining an elite group of players with 500 Test wickets -- and warning he can still get better. The veteran of 120 Tests will do battle once more with England this week and is primed to torment a country that has accounted for 101 of his 487 scalps. The 35-year-old Lyon declared last month he believed \"100 percent\" that a whitewash of their hosts and arch-rivals was doable. Affectionately known as \"Garry\" after former Aussie Rules player Garry Lyon, he is one of the most prolific off-spinners to grace Test cricket. He took four wickets in India's second innings to help Australia win the World Test Championship final at The Oval on Sunday and is poised to join spin greats Shane Warne, Anil Kumble and Muttiah Muralitharan in the exclusive 500-club. Two of his England rivals, Jimmy Anderson and Stuart Broad, are also among the seven players to have taken 500 or more Test wickets. Lyon's fellow Australian Glenn McGrath and Courtney Walsh of the West Indies are the other two. A classical spinner who flights the ball, the durable right-armer could feasibly catch Walsh (519) during the five-Test Ashes series starting at Edgbaston on Friday. While his seemingly anointed off-spinning successor Todd Murphy was also included in Australia's squad, Lyon is not ready to slow down or give selectors any reason to consider his 22-year-old teammate as an alternative. \"There's no end in sight for me,\" Lyon, whose longevity is partly due to having not played international white-ball cricket since 2019, told reporters ahead of his departure from Australia. \"I still feel like I can get better. I feel like I'm still learning about the art of off-break bowling. I'm trying to get a lot more consistent and trying to get my stock ball even better with a few variations as well.\" He will face an added challenge in England with short boundaries designed to aid the home side's aggressive batsmen set to be deployed, which risks him being routinely pummelled to the ropes. But the opportunistic Lyon, who made his Test debut in 2011, only sees this as another chance to boost his wicket haul. \"I've been hit for six... it must be getting close to 300 (times) now for me,\" he said. \"I'm not worried by it at all, I'm not scared by it. It provides a chance (of wickets) in my eyes.\" In Murphy, Australia appear to have a long-term heir from their never-ending conveyor belt of top-class spin bowlers. This time last year he was a virtual unknown, handed a surprise Test call-up after just seven first-class matches for Victoria. He grabbed the chance with both hands in a stunning debut against India at Nagpur in February where he bagged a seven-wicket haul in their first innings while beautifully bowling in tandem with Lyon. Able to beat the bat on both edges, Australian coach Andrew McDonald said earlier this year: \"I think he's a clear number two. \"I think there's been discussion over a period of time what would happen if we didn't have Nathan Lyon. That's been one of the real positives that we've got an obvious number two that can play in all conditions.\" The bespectacled Murphy, who won a Cricket Australia contract this year, knows he is still learning the ropes, with spinning in often cold and seam-friendly English conditions a different ball game to the sub-continent. When he gets the chance to add to his four caps remains to be seen, but it appears unlikely to be in England, where the need for two spinners is rare. Chief selector George Bailey has urged him to bide his time, saying: \"We think he has a really bright future.\" (AFP)","pubDate":"2023-06-13 07:16:15","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_37fc035125.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Andrew McDonald Credits 'Subcontinent Journey' For WTC Triumph","link":"https://sports.ndtv.com/cricket/mcdonald-credits-subcontinent-journey-for-wtc-triumph-4116579","keywords":null,"creator":null,"video_url":null,"description":"Having missed out due to over-rate penalties in the 2019-21 cycle, Australia on Sunday became the first team to win ICC world titles across formats when they defeated India by 209 runs","content":"They might have failed to conquer the 'Final Frontier' on their last tour of India, but Australia head coach Andrew McDonald feels their \"sub-continent journey\" helped them get the World Test Championship mace. Having missed out due to over-rate penalties in the 2019-21 cycle, Australia on Sunday became the first team to win ICC world titles across formats when they defeated India by 209 runs in a lopsided WTC Final at The Oval. \"You can string down series in isolation, you can talk about the subcontinent journey where we went from Pakistan to Sri Lanka into India,\" McDonald told reporters. \"We had to navigate through that. So, it was a tricky World Test championship cycle and I think the wins in the subcontinent got us here.\" The Pat Cummins-led side had enjoyed some splendid wins in the sub-continent before travelling to India in pursuit of its first Test series triumph since 2004-05 in the final leg of the WTC cycle. Before travelling to India, Australia won a three-match series in Pakistan 1-0 with a crushing 115-run defeat of the hosts in Lahore in March. Then in Sri Lanka, they won the first Test by 10 wickets only to go down by an innings and 39 runs in a drawn 1-1 series. On turning Indian conditions where the matches failed to last the distance, Australia's biggest bright spot in a 1-2 loss was their nine-wicket win in the third Test in Indore. It also sealed their WTC Final berth with a round to spare in the 2021-23 cycle. \"We're really strong in Australia. So I think that most people would expect us to be winning Test matches in Australia, but to be able to execute in Pakistan, win a Test match in Sri Lanka and then to get that win in Indore to secure a place in the final was vitally important to give us this opportunity. And we've been able to take that, so it's a job well done.\" The 42-year-old further said they were just buying into the \"new concept\" of the WTC having missed out on the inaugural final in 2021. \"It's a new concept. But we're certainly buying into the concept and I think that was probably the disappointment of the first couple of years when it was in existence where we missed out due to over rate so we've made it a significant focus of ours. \"Every time we come into a series we're checking in around where we are, there's a ladder, albeit stretched out over two years, which is a little bit different to other sports, but yeah, it's high on the priority list. \"And you put on the priority list, you want to be here and you want to win it and that's what we've been able to do. So it's right up there. And if you go into that dressing room at the moment, there's a lot of happy people about, reflecting on what they've been able to achieve over the last few years.\" The focus however will shift to the marquee Ashes showdown in less than a week when they will be looking to break a 22-year drought in England. Advertisement \"Probably the next 24 hours we will switch our focus as you will, in what you do to the Ashes and the first Test,\" he said. The five-match Ashes begins with the Edgbaston Test from Friday. \"We can't wait for it to come around. First was the World Test Championship final. Let's enjoy what the team's been able to achieve over the last couple of years and then get excited about Edgbaston ball one. \"So one thing that we've got to factor into England is how we deny them those boundaries. So there's a couple of things that we can potentially tidy up and take from this game into the next one, but different opponent. So we'll get back to the drawing board around that.\" Selection conundrum Scott Boland's impressive show -- five wickets -- in the WTC Final has led to a selection headache. With Josh Hazlewood set to return, left-arm seamer Mitchell Starc's spot could come under the scanner, especially after leaking runs against India. \"India showed good intent at certain times and the game went at high three-four runs per over,\" he said. \"Mitch at times went a bit more than that and he generally goes at a fraction more than the other bowlers, and they complement each other really, really well. His wicket-taking ability is second to none. We've got to weigh all that up when we make decisions. \"But it's not a concern because we know what we're in for in the summer is slightly higher run-rate and that's because of the grounds and the surfaces. \"We value Mitch and what he's been able to do but we also value Scott and Josh and Patty (Cummins) is clearly an automatic pick being the captain and then you've got Nathan Lyon and Cameron Green in and around that. \"We feel as though we've got really good coverage and we've got some people here playing county cricket if anything should go wrong,\" the coach concluded. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-06-13 07:12:11","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"CSK Pacer Tushar Deshpande Gets Engaged To His School Crush Nabha Gaddamwar, Pictures Go Viral","link":"https://news.abplive.com/sports/cricket/csk-pacer-tushar-deshpande-gets-engaged-to-his-school-crush-nabha-gaddamwar-pictures-go-viral-1608713","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"As soon as the sixteenth edition of the Indian Premier League (IPL) came to an end, news of multiple players who were busy playing in the league getting married or engaged has come to the fore. And now, another such cricketer has joined the club. Chennai Super Kings (CSK) pacer Tushar Deshpande got engaged to his \"school crush\" Nabha Gaddamwar in a beautiful ceremony in Mumbai on Monday (June 12). Notably, Deshpande played a vital role in CSK's title-winning campaign in IPL 2023 which saw them beat the defending champions Gujarat Titans (GT) in a last-ball win in the summit clash at the Narendra Modi Stadium in Ahmedabad. In 16 matches, Deshpande scalped 21 wickets and finished the season as the Men in Yellow's leading wicket-taker. Overall, he was the sixth-highest wicket taker in the competition.The 28-year-old took to Instagram to share pictures from his engagement ceremomy and even accompanied it with a heartfelt caption. \"𝟭𝟮.𝟬𝟲.𝟮𝟬𝟮𝟯She got promoted from my school crush to MY FIANCÉ ! 😱🥰🥳❤️,\" he wrote.           View this post on Instagram                       A post shared by Tushar Deshpande (@tushardeshpande96) The Mumbai cricketer has so far played 29 first-class matches and 34 List A Games apart from 59 T20Is. In these, the Chennai bowler has managed to scalp 80, 35 and 83 wickets respectively.Post his performance in IPL 2023, Deshpande spoke about how he listens to MS Dhoni like a soldier and is convinced that the legendary captain won't take him on a wrong path. \"You know you have someone who will guide and show the light when things are not going in our favour. He is a selfless guy and keeps things simple. He doesn’t complicate things and will be with you in your bad times. Like a soldier, I will just follow whatever he says. I know he can never take me on a wrong path,\" Deshpande told Indian Express.\"Dhoni plans are very clear that this is what you need to do and then one has to execute. He will give freedom as well and when needed he will put a word. He told me that I have everything to play at the top, just be calm, take a deep breath,\" he added.Earlier, CSK opener Ruturaj Gaikwad had also gotten married. He had informed the BCCI that he won't be travelling with the Indian team for the ICC World Test Championship (WTC) final as a reserve opener because of his marriage. He tied the knot with Utkarsha Pawar, an all-rounder, who has played for Maharashtra in domestic tournaments.","content":"As soon as the sixteenth edition of the Indian Premier League (IPL) came to an end, news of multiple players who were busy playing in the league getting married or engaged has come to the fore. And now, another such cricketer has joined the club. Chennai Super Kings (CSK) pacer Tushar Deshpande got engaged to his \"school crush\" Nabha Gaddamwar in a beautiful ceremony in Mumbai on Monday (June 12). Notably, Deshpande played a vital role in CSK's title-winning campaign in IPL 2023 which saw them beat the defending champions Gujarat Titans (GT) in a last-ball win in the summit clash at the Narendra Modi Stadium in Ahmedabad. In 16 matches, Deshpande scalped 21 wickets and finished the season as the Men in Yellow's leading wicket-taker. Overall, he was the sixth-highest wicket taker in the competition. The 28-year-old took to Instagram to share pictures from his engagement ceremomy and even accompanied it with a heartfelt caption. \"𝟭𝟮.𝟬𝟲.𝟮𝟬𝟮𝟯 She got promoted from my school crush to MY FIANCÉ ! 😱🥰🥳❤️,\" he wrote. View this post on Instagram A post shared by Tushar Deshpande (@tushardeshpande96) The Mumbai cricketer has so far played 29 first-class matches and 34 List A Games apart from 59 T20Is. In these, the Chennai bowler has managed to scalp 80, 35 and 83 wickets respectively. Post his performance in IPL 2023 , Deshpande spoke about how he listens to MS Dhoni like a soldier and is convinced that the legendary captain won't take him on a wrong path. \"You know you have someone who will guide and show the light when things are not going in our favour. He is a selfless guy and keeps things simple. He doesn’t complicate things and will be with you in your bad times. Like a soldier, I will just follow whatever he says. I know he can never take me on a wrong path,\" Deshpande told Indian Express. \"Dhoni plans are very clear that this is what you need to do and then one has to execute. He will give freedom as well and when needed he will put a word. He told me that I have everything to play at the top, just be calm, take a deep breath,\" he added. Earlier, CSK opener Ruturaj Gaikwad had also gotten married. He had informed the BCCI that he won't be travelling with the Indian team for the ICC World Test Championship (WTC) final as a reserve opener because of his marriage. He tied the knot with Utkarsha Pawar, an all-rounder, who has played for Maharashtra in domestic tournaments. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); });","pubDate":"2023-06-13 06:55:06","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/13/f21ccad333116307bb3bcac05068cac51686639130316625_original.png","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"'अश्विन के साथ जो बर्ताव किया गया, ऐसा किसी के साथ नहीं होता', सुनील गावस्कर ने रोहित शर्मा को लताड़ा","link":"https://hindi.oneindia.com/news/sports/cricket/wtc-final-2023-sunil-gavaskar-said-no-any-indian-cricketer-treated-as-badly-as-r-ashwin-781184.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय टीम के दिग्गज ऑफ स्पिनर आर अश्विन को भारत ने ऑस्ट्रेलिया के खिलाफ फाइनल मैच में प्लेइंग इलेवन में जगह नहीं दी थी। बेहतरीन रिकॉर्ड होने के बावजूद अश्विन को अनदेखी का शिकार होना पड़ा था। आर अश्विन को बाहर किए जाने पर क्रिकेट के कई दिग्गजों ने अपनी नाराजगी जाहिर की है।","content":"वर्ल्ड टेस्ट चैंपियनशिप फाइनल में भारत को ऑस्ट्रेलिया की टीम ने 209 रन से हरा दिया। इस हार के साथ ही लंबे समय बाद आईसीसी ट्रॉफी जीतने का सपना भारत का टूट गया। भारतीय टीम के बल्लेबाजों ने उम्मीद के मुताबिक प्रदर्शन नहीं किया, जिस कारण टीम को एक शर्मनाक हार झेलनी पड़ी। : भारत की हार के बाद रविचंद्रन अश्विन को प्लेइंग इलेवन से बाहर रखने के फैसले पर लगातार सवाल खड़े किए जा रहे हैं। कई दिग्गजों का मानना है कि भारतीय कप्तान रोहित शर्मा और कोच राहुल द्रविड़ का यह फैसला सही नहीं था। सचिन तेंदुलकर से लेकर सुनील गावस्कर तक ने इस फैसले पर निराशा व्यक्त की है। पूर्व भारतीय सलामी बल्लेबाज सुनील गावस्कर अश्विन की टीम को बाहर किए जाने फैसले को समझ नहीं पा रहे हैं। मिड-डे के लिए अपने कॉलम में सुनील गावस्कर ने अश्विन को लेकर कई बातों का जिक्र किया है। गावस्कर ने लिखा कि भारत में किसी दूसरे टॉप क्रिकेटर के साथ ऐसा हैरान करने वाला बर्ताव नहीं किया गया है, जैसा टॉप स्पिनर रविचंद्रन अश्विन के साथ किया गया। सुनीला गावस्कर ने सवाल पूछा कि क्या कोई बल्लेबाज आईसीसी में टॉप रैंकिंग पर होता तो उसे बाहर किया जाता? अगर वह पिछले कुछ समय से घास वाली पिचों पर रन नहीं बना पाया हो तो क्या उसे टीम से बाहर कर दिया गया होता? बिल्कुल नहीं। गावस्कर के मुताबिक अश्विन के साथ जिस तरीके का व्यवहार किया गया है वो आज से पहले भारतीय क्रिकेट में किसी क्रिकेटर के साथ नहीं हुआ था। अश्विन टॉप ऑर्डर के टेस्ट गेंदबाज हैं जो लो-ऑर्डर में आकर बल्ले से भी टीम के लिए अहम योगदान देने का काम करते रहे हैं। ऑस्ट्रेलियाई टीम में पांच बाएं हाथ के बल्लेबाज थे, जिसके लिए अश्विन असरदार साबित हो सकते थे। ऑस्ट्रेलिया के बाएं हाथ के बल्लेबाज ट्रैविस हेड ने पहली पारी में 150 से अधिक रन बनाए थे। अगर अश्विन गेंदबाजी करते तो शायद परिणाम कुछ और होता।","pubDate":"2023-06-13 06:46:35","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"TNPL 2023: आईपीएल के बाद फिर चमके साईं सुदर्शन, 8 चौके और 4 छक्के जड़ टीम को दिलाई जीत","link":"https://hindi.oneindia.com/news/sports/cricket/after-ipl-2023-star-sai-sudharsan-starts-new-season-with-half-century-in-tnpl-2023-781205.html","keywords":null,"creator":null,"video_url":null,"description":"गुजरात टाइटंस की टीम आईपीएल 2023 का खिताब जीतने में भले ही चूक गई हो, लेकिन टीम के कई खिलाड़ियों ने अपने प्रदर्शन से सभी को खासा प्रभावित किया। इन खिलाड़ियों की लिस्ट में युवा बल्लेबाज साईं सुदर्शन भी हैं। आईपीएल के बाद भी साईं सुदर्शन बल्ले से धमाल मचा रहे हैं।","content":"तमिलनाडु प्रीमियर लीग का आगाज लाइका कीवई किंग्स और आईड्रीम तिरुप्पुर तमिझंस के बीच खेले गए मैच के साथ किया गया। आईपीएल 2023 के फाइनल में तूफानी पारी खेलने वाले साईं सुदर्शन ने इस मुकाबले में मैच विनिंग पारी खेली। गुजरात टाइटंस के बल्लेबाज बी साई सुदर्शन ने आईपीएल फाइनल में चेन्नई सुपरकिंग्स के खिलाफ 47 गेंदों में 96 रन की शानदार पारी खेली थी। वह इस मैच में अपना शतक पूरा करने से सिर्फ चार रनों से चूक गए थे। अब लाइका कीवई किंग्स की तरफ से पहले मैच में उन्होंने अपने पुराने फॉर्म को बरकरार रखा है और टीम के लिए धांसू पारी खेलने का काम किया। आईड्रीम तिरुप्पुर तमिझंस ने इस मुकाबले में टॉस जीतकर लाइका कीवई किंग्स को पहले बल्लेबाजी का न्योता दिया। लाइका कीवई किंग्स की शुरुआत खराब रही और टीम ने महज 14 के स्कोर पर अपने तीन खिलाड़ियों का विकेट गंवा दिया। लेकिन इसके बाद साई सुदर्शन ने आकर जबरदस्त बल्लेबाजी कर टीम को मैच विनिंग स्कोर तक पहुंचाया। टीएनपीएल 2023 के शुरुआती मुकाबले में ही आईपीएल 2023 के फाइनल वाले अंदाज में बल्लेबाजी करते हुए साई सुदर्शन ने महज 45 गेंद में 86 रन जड़ दिए। साई सुदर्शन ने अपनी पारी के दौरान 8 चौके और 4 छक्के लगाने का काम किया। साई सुदर्शन की पारी की बदौलत लाइका कीवई किंग्स ने 20 ओवर में 7 विकेट खोकर 179 रन बनाए। जिसके जवाब में आईड्रीम तिरुप्पुर तमिझंस की टीम 109 के स्कोर पर ऑल आउट हो गई। बी सचिन, जे सुरेश कुमार (विकेटकीपर), साई सुदर्शन, राम अरविंद, यू मुकिलेश, शाहरुख खान (कप्तान), एम मोहम्मद, किरण आकाश, मणिमारन सिद्धार्थ, झटवेध सुब्रमण्यन, के गौतम थमराई कन्नन। बालचंदर अनिरुद्ध, एनएस चतुर्वेद, एस गणेश, विजय शंकर, राजेंद्रन विवेक, तुषार रहेजा (विकेटकीपर), पी भुवनेश्वरन, एस अजित राम, रविश्रीनिवासन साई किशोर (कप्तान), जी पेरियास्वामी, एस मणिगंदन।","pubDate":"2023-06-13 06:43:08","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final: ऑस्ट्रेलियाई दिग्गज ने फाइनल को लेकर रोहित शर्मा के बयान का किया समर्थन, कही ये बड़ी बात","link":"https://hindi.oneindia.com/news/sports/cricket/brad-hogg-agrees-with-rohit-sharma-s-statement-on-wtc-final-3-matches-series-781204.html","keywords":null,"creator":null,"video_url":null,"description":"ब्रैड हॉग ने टीम इंडिया के कप्तान रोहित शर्मा के उस बयान का समर्थन किया है, जिसमें उन्होंने कहा कि विश्व टेस्ट चैंपियनशिप (WTC) का फाइनल तीन मैचों का होना चाहिए। ब्रैड हॉग का कहना है कि वह रोहित शर्मा से सहमत हैं कि वर्ल्ड टेस्ट चैंपियनशिप का फाइनल तीन मैचों की सीरीज होनी चाहिए।","content":"पूर्व ऑस्ट्रेलियाई स्पिनर ब्रैड हॉग ने टीम इंडिया के कप्तान रोहित शर्मा के बयान का समर्थन किया है कि विश्व टेस्ट चैंपियनशिप (WTC) का फाइनल तीन मैचों का होना चाहिए। ब्रैड हॉग का कहना है कि वह रोहित शर्मा से सहमत हैं कि वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में तीन मैचों की सीरीज होनी चाहिए। विश्व टेस्ट चैंपियनशिप के फाइनल में भारत को ऑस्ट्रेलिया के हाथों हार का सामना करना पड़ा। इस टूर्नामेंट में भारत का टॉप ऑर्डर पूरी तरह से फ्लॉप साबित हुआ, जिसके कारण इंडिया को ट्रॉफी गंवानी पड़ी। इसके बाद कप्तान रोहित शर्मा समेत अन्य खिलाड़ियों को तीखी आलोचनाओं का सामना करना पड़ा। हॉग ने अपने यूट्यूब चैनल पर अपलोड किए गए वीडियो में कहा कि 'डब्ल्यूटीसी फाइनल के साथ-साथ टूर्नामेंट के लिए एक नया फॉर्मेट पेश करने के बारे में रोहित के विचारों से सहमत हैं। उन्होंने कहा कि, 'मैं रोहित शर्मा से सहमत हूं कि डब्ल्यूटीसी फाइनल तीन मैचों की सीरीज होनी चाहिए।' उन्होंने आगे कहा कि, 'इस बार यह एक मैच का फाइनल था, जोकि ऑस्ट्रेलिया ने अपने नाम किया। इसका क्रेडिट उन्हें मिलना चाहिए। मेरे हिसाब से चार-चार टीमों का दो डिवीजन होना चाहिए। डिवीजन वन में टॉप-4 टीमें और उसके बाद बाकी टीमें दूसरे डिवीजन का हिस्सा होनी चाहिए। एसोसिएट टीमें डिवीजन थ्री में हो सकती हैं।' वहीं ऑस्ट्रेलिया के कप्तान पैट कमिंस ने विश्व टेस्ट चैंपियनशिप फाइनल के अगले टूर्नामेंट में तीन मैचों की सीरीज खेलने की रोहित शर्मा की इच्छा पर अपनी असहमती जताई है। इसके अलावा दिग्गज सुनील गावस्कर ने भी इस तरह के सुझाव के लिए भारत के कप्तान की आलोचना की और कहा कि हर टीम को ऐसे बड़े आयोजनों को खेलने से पहले मानसिक रूप से तैयार रहना चाहिए। दरअसल, भारतीट टीम द ओवल में डब्ल्यूटीसी फाइनल में ऑस्ट्रेलिया के खिलाफ 209 रनों से हार गई। टीम जब 444 रनों का पीछा करने उतरी तो एक बार फिर टॉप ऑर्डर फ्लॉप साबित हुआ, जिसके चलते टीम 234 रनों पर ढेर हो गई, और टीम इंडिया के हाथ एक बार फिर सिर्फ निराशा लगी।","pubDate":"2023-06-13 06:42:39","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final में जीत का दावा करने वालों की हरभजन सिंह ने खोली पोल, बोले- नकली है टीम इंडिया का कॉन्फिडेंस","link":"https://hindi.oneindia.com/news/sports/cricket/harbhajan-singh-says-fake-confidence-by-winning-on-bad-matches-wtc-final-2023-781226.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के खिलाफ विश्व टेस्ट चैंपियनशिप के फाइनल में टीम इंडिया की हार के बाद हरभजन सिंह ने बड़ा बयान दिया है। उन्होंने कहा कि स्पिन के लिए अनुकूल भारतीय पिचों पर सिर्फ तीन दिन के भीतर टेस्ट मैच खत्म करके भारत खुद को बड़े मुकाबलों के लिए पूरी तरह से तैयार नहीं कर सकता है और उन्हें सभी पांच दिनों तक कड़ी मेहनत करने की जरूरत है।","content":"वर्ल्ड टेस्ट चैंपियनशिप फाइनल में ऑस्ट्रेलिया के खिलाफ टीम इंडिया को पूरी उम्मीद दी थी कि वो ट्रॉफी लेकर ही लौटेंगे। खिलाड़ियों में आत्मविश्वास की कोई कमी नहीं थी, मोहम्मद शमी ने तो यहां तक कह दिया था कि 100 प्रतिशत हर किसी को भरोसा है कि हम ये मैच जीतेंगे, लेकिन आगे क्या हुआ वो सभी को पता है। इस बीच अब पूर्व भारतीय स्पिनर हरभजन सिंह ने टीम इंडिया के इस आत्मविश्वास को फेक कॉन्फिडेंस बताया है। द ओवल में ऑस्ट्रेलिया के खिलाफ भारत की हार के बाद हरभजन सिंह ने भारत में अत्यधिक स्पिन फ्रेंडली पिचों पर सवाल उठाए हैं और बताया है कि कैसे बड़े मैचों के लिए भारत की तैयारी को प्रभावित करता है। द ओवल में फाइनल में भारत के खिलाफ 209 रनों से आईसीसी विश्व टेस्ट चैम्पियनशिप खिताब जीतने के बाद ऑस्ट्रेलिया ने सभी फॉर्मेट में आईसीसी ट्राफियां जीतकर इतिहास रच दिया। पांच दिनों तक भारत पर हावी रहने के बाद ऑस्ट्रेलिया ने रविवार को लंदन में अपना पहला विश्व टेस्ट चैंपियनशिप 2023 का खिताब हासिल किया। हरभजन ने कहा कि स्पिन की मददगार भारतीय पिचों पर सिर्फ तीन दिन के अंदर टेस्ट मैच खत्म करके भारत खुद को बड़े मुकाबलों के लिए पूरी तरह से तैयार नहीं कर सकता और उन्हें पूरे पांच दिन कड़ी मेहनत करने की जरूरत है, और इसे अपनी आदत बना लेना चाहिए। मैच के बाद स्टार स्पोर्ट्स पर हरभजन ने कहा, 'आप खराब पिचों पर मैच खेलने और जीतने के बाद खुद को वह नकली आत्मविश्वास नहीं दे सकते, जहां गेंद पहली गेंद से घूमने लगती है। आपको पांच दिनों तक कड़ी मेहनत करने की आदत डालनी होगी। तेज गेंदबाजों को इन पिचों पर ज्यादा गेंदबाजी करने का मौका नहीं मिलता है, पहले ओवर से ही स्पिनरों का इस्तेमाल किया जाता है। हमें बहुत सी चीजों में सुधार करना चाहिए।' इस साल की शुरुआत में ऑस्ट्रेलिया के खिलाफ हाल ही में समाप्त हुई बॉर्डर-गावस्कर ट्रॉफी में स्पिन गेंदबाज काफी सफल साबित हुए थे और चार में से तीन टेस्ट तीन दिनों में समाप्त हुए। इस दौरान रविचंद्रन अश्विन (25 विकेट), रवींद्र जडेजा (22) और नाथन लियोन (22) ने सबसे अधिक विकेट लिए। हालांकि, ऑस्ट्रेलिया के खिलाफ इंडियन टीम में अश्विन को प्लेइंग-11 में जगह न देने पर कप्तान रोहित शर्मा की काफी आलोचना हुई।","pubDate":"2023-06-13 07:35:00","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"'ऑस्ट्रेलियाई टीम चुस्त और भारत सुस्त,' मोहम्मद कैफ ने टीम इंडिया की फील्डिंग पर कही तीखी बात","link":"https://hindi.oneindia.com/news/sports/cricket/wtc-final-indian-fielding-was-lazy-says-mohammed-kaif-781222.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय टीम की फील्डिंग को लेकर मोहम्मद कैफ ने बड़ी प्रतिक्रिया दी है। कैफ ने कहा है कि ऑस्ट्रेलिया ने फुर्ती दिखाई लेकिन भारत के फील्डर बिलकुल आलसी दिखाई दे रहे थे।","content":"ऑस्ट्रेलिया के खिलाफ वर्ल्ड टेस्ट चैम्पियनशिप के फाइनल मैच में भारतीय टीम से हुई गलतियों की तरफ हर कोई इशारा कर रहा है। बातें हो रही हैं और विश्लेषण भी सामने आ रहे हैं। मोहम्मद कैफ ने दोनों टीमों की फील्डिंग को लेकर अहम बयान दिया है। कैफ ने ऑस्ट्रेलिया की फील्डिंग को भारत से बेहतर बताया। उन्होंने कहा कि भारतीय टीम मौकों का फायदा उठाने में नाकाम रही। ऑस्ट्रेलियाई टीम मैदान पर ज्यादा चुस्त दिखाई दे रही थी। कंगारुओं ने अपने पास आए मौकों का लाभ बखूबी उठाया। इंडियन एक्सप्रेस की एक रिपोर्ट के अनुसार कैफ ने स्लिप फील्डिंग को अहम मानते हुए कहा कि यहाँ कॉर्डिनेशन ख़ास होता है क्योंकि स्लिप एक अहम पोजीशन है। इंग्लैंड में गेंद मूव ज्यादा होती है इस वजह से ज्यादातर आउट विकेट के पीछे होते हैं। इस वजह से स्लिप का फील्डर हर समय गेम में अहम होता है। कैफ ने कहा कि आप कैच मिस नहीं कर सकते। मैदान पर जाने से पहले आपको इन चीजों का हल निकालना होता है। पुजारा स्लिप में पैड पहनकर खड़े थे। इसे लेकर कैफ ने कहा कि यह सुस्ती दर्शाता है। फील्डर सोचता है कि स्लिप में कैच नहीं आएगा। खेल के अहम क्षणों में भारत किसी भी तरह की चूक बर्दाश्त नहीं कर सकता था। पूर्व भारतीय खिलाड़ी ने कहा कि पैड पहनने से आप ज्यादा हिल नहीं सकते और पूरी तरह से झुक भी नहीं सकते। ये ऐसी गलतियाँ हैं जिनको मैंने पहली बार नहीं देखा है। इस तरह की चीजें पहले भी होती दिखी हैं। कोई भी इन पर ज्यादा ध्यान नहीं देता है। गौरतलब है कि ऑस्ट्रेलिया के खिलाफ इस अहम मैच में भारत की स्लिप फील्डिंग भी खास नहीं थी। दूसरी तरफ ऑस्ट्रेलिया की टीम मुस्तैदी के साथ मैदान पर थी। स्मिथ और कैमरन ग्रीन ने अपने शानदार कैच लेकर मजबूत फील्डिंग का अहसास करा दिया था।","pubDate":"2023-06-13 07:23:35","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sourav on Virat: 'আমরাও অবাক হয়ে গিয়েছিলাম', বিরাট অধিনায়কত্ব ছাড়া নিয়ে ফের বিস্ফোরক সৌরভ","link":"https://bengali.abplive.com/sports/cricket/sourav-ganguly-claims-virat-kohli-s-resignation-from-captaincy-was-unexpected-for-bcci-too-985165","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"নয়াদিল্লি: সাম্প্রতিক সময়ে বিরাট কোহলি (Virat Kohli) ও সৌরভ গঙ্গোপাধ্যায়ের (Sourav Ganguly) মধ্যেকার সম্পর্ক তথা বিবাদ বারংবার শিরোনাম কেড়েছে। সৌরভের বিসিসিআইয়ের সভাপতি থাকার সময়ই বিরাট কোহলি জাতীয় দলের অধিনায়ক পদ থেকে পদত্যাগ করেছিলেন বিরাট। সেই নিয়ে অনেক জল্পনা-কল্পনা চলেছে। সৌরভ দাবি করেছিলেন বোর্ড বিরাটকে ইস্তফা না দেওয়ার আবেদন করেছিল। তবে বিরাট সম্পূর্ণ ভিন্ন দাবি করেন। তারপর গঙ্গা দিয়ে অনেক জল বয়ে গিয়েছে। তবে সৌরভ কিন্তু নিজের দাবিতে অনড়। তিনি বলেন, 'বিরাট কোহলির টেস্ট অধিনায়কত্ব ছাড়ার জন্য কিন্তু বিসিসিআই প্রস্তুত ছিল না। দক্ষিণ আফ্রিকা সফরের পর হঠাৎ করে এমন একটা সিদ্ধান্ত আমাদের সকলকেই চমকে দিয়েছিল। আমরা সবাই অবাক হয়ে গিয়েছিলাম। শুধু কোহলিই জানে ও কেন অধিনায়কত্ব থেকে সরে দাঁড়াল। তবে এখন আর এ বিষয়ে কথা বলার কোনও মানে নেই। নির্বাচকদের তো একজনকে অধিনায়ক নিয়োগ করতেই হত। রোহিতই ওই সময় সেরা বিকল্প ছিল।' বিরাটের অধিনায়কত্বে ভারতীয় দল বিদেশের মাটিতে বিশেষত টেস্টে দুর্দান্ত পারফর্ম করলেও, কোনও আইসিসি ট্রফি জিততে পারেনি। বিরাটের পর রোহিতের অধিনায়কত্বেও কিন্তু এই নিয়ে দুই বছরে দ্বিতীয় আইসিসি খেতাব হাতছাড়া করল ভারত। এই নিয়ে অনেকেই আইপিএলকে কাঠগড়ায় দাঁড় করাচ্ছে। এরই মাঝে সৌরভের দাবি বিশ্বকাপ জেতার থেকে কিন্তু আইপিএল জেতা অনেক কঠিন। তিনি বলেন, 'আইপিএল জেতাটা বিশ্বকাপ জয়ের থেকে অনেক বেশি কঠিন। গ্রুপ পর্বে ১৪টি ম্যাচ খেলার পর প্লে অফ খেলতে হয় আইপিএলে। সেখানে বিশ্বকাপে চার পাঁচটি ম্যাচ খেলার পরেই দলগুলি সেমিফাইনাল এবং সেখান থেকে ফাইনালে পৌঁছয়।' আরও পড়ুন: চুলের রুক্ষ-শুষ্ক ভাব দূর করতে সারাবছরই প্রয়োজন যত্ন, কীভাবে পরিচর্যা করবেন?","content":"নয়াদিল্লি: সাম্প্রতিক সময়ে বিরাট কোহলি (Virat Kohli) ও সৌরভ গঙ্গোপাধ্যায়ের (Sourav Ganguly) মধ্যেকার সম্পর্ক তথা বিবাদ বারংবার শিরোনাম কেড়েছে। সৌরভের বিসিসিআইয়ের সভাপতি থাকার সময়ই বিরাট কোহলি জাতীয় দলের অধিনায়ক পদ থেকে পদত্যাগ করেছিলেন বিরাট। সেই নিয়ে অনেক জল্পনা-কল্পনা চলেছে। সৌরভ দাবি করেছিলেন বোর্ড বিরাটকে ইস্তফা না দেওয়ার আবেদন করেছিল। তবে বিরাট সম্পূর্ণ ভিন্ন দাবি করেন। তারপর গঙ্গা দিয়ে অনেক জল বয়ে গিয়েছে। তবে সৌরভ কিন্তু নিজের দাবিতে অনড়। তিনি বলেন, 'বিরাট কোহলির টেস্ট অধিনায়কত্ব ছাড়ার জন্য কিন্তু বিসিসিআই প্রস্তুত ছিল না। দক্ষিণ আফ্রিকা সফরের পর হঠাৎ করে এমন একটা সিদ্ধান্ত আমাদের সকলকেই চমকে দিয়েছিল। আমরা সবাই অবাক হয়ে গিয়েছিলাম। শুধু কোহলি ই জানে ও কেন অধিনায়কত্ব থেকে সরে দাঁড়াল। তবে এখন আর এ বিষয়ে কথা বলার কোনও মানে নেই। নির্বাচকদের তো একজনকে অধিনায়ক নিয়োগ করতেই হত। রোহিতই (শর্মা) ওই সময় সেরা বিকল্প ছিল।' ভারত রোহিতের অধিনায়কত্বে টেস্টের সেরা হওয়ার সুযোগ হাতছাড়া করলেও, সৌরভ কিন্তু এখনও রোহিতকে (Rohit Sharma) অধিনায়ক পদে বহাল রাখার পক্ষেই। তিনি বলেন, 'দিনের শেষে অধিনায়ক বাছাইয়ের কাজটা তো নির্বাচকদের, এই সিদ্ধান্ত সোশ্যাল মিডিয়ার দ্বারা কীভাব প্রভাবিত হতে পারে? বিরাট নিজেই বছর দুই আগে আর টেস্টে অধিনায়কত্ব করতে চায়নি। আমাকে যদি প্রশ্ন করা হয় যে ভারতের অধিনায়ক ও কোচ কার হওয়া উচিত, আমি কিন্তু এখনও রোহিত এবং রাহুলের কথাই বলব। এটাই সঠিক সিদ্ধান্ত।' বিরাটের অধিনায়কত্বে ভারতীয় দল বিদেশের মাটিতে বিশেষত টেস্টে দুর্দান্ত পারফর্ম করলেও, কোনও আইসিসি ট্রফি জিততে পারেনি। বিরাটের পর রোহিতের অধিনায়কত্বেও কিন্তু এই নিয়ে দুই বছরে দ্বিতীয় আইসিসি খেতাব হাতছাড়া করল ভারত। এই নিয়ে অনেকেই আইপিএলকে কাঠগড়ায় দাঁড় করাচ্ছে। এরই মাঝে সৌরভের দাবি বিশ্বকাপ জেতার থেকে কিন্তু আইপিএল জেতা অনেক কঠিন। তিনি বলেন, 'আইপিএল জেতাটা বিশ্বকাপ জয়ের থেকে অনেক বেশি কঠিন। গ্রুপ পর্বে ১৪টি ম্যাচ খেলার পর প্লে অফ খেলতে হয় আইপিএল ে। সেখানে বিশ্বকাপে চার পাঁচটি ম্যাচ খেলার পরেই দলগুলি সেমিফাইনাল এবং সেখান থেকে ফাইনালে পৌঁছয়।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); এবিপি আনন্দ এখন টেলিগ্রামেও, ক্লিক করুন এই লিঙ্কে https://t.me/abpanandaofficial আরও পড়ুন: চুলের রুক্ষ-শুষ্ক ভাব দূর করতে সারাবছরই প্রয়োজন যত্ন, কীভাবে পরিচর্যা করবেন? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-13 07:18:57","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/13/422cf57772b95a864d3da000316f95211686636712529507_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"अश्विन के साथ जैसा बर्ताव हुआ, वैसा किसी और क्रिकेटर के साथ नहीं : गावस्कर","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-no-other-cricketer-was-treated-like-ashwin-gavaskar-news-hindi-1-566869-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"दिग्गज बल्लेबाज सुनील गावस्कर का मानना है कि भारत में किसी अन्य शीर्ष क्रिकेटर के साथ ऐसा चौंकाने वाला बर्ताव नहीं किया गया है, जैसा शीर्ष ऑफ स्पिनर रविचंद्रन अश्विन के साथ किया गया।","content":"नई दिल्ली। दिग्गज बल्लेबाज सुनील गावस्कर का मानना है कि भारत में किसी अन्य शीर्ष क्रिकेटर के साथ ऐसा चौंकाने वाला बर्ताव नहीं किया गया है, जैसा शीर्ष ऑफ स्पिनर रविचंद्रन अश्विन के साथ किया गया। उन्हें अंतिम एकादश से बाहर रखा गया। यही वजह है कि द ओवल में वल्र्ड टेस्ट चैंपियनशिप (डब्ल्यूटीसी) फाइनल में भारत की ऑस्ट्रेलिया से 209 रनों से हार हुई। अश्विन के प्लेइंग इलेवन में होने या न होने की दुविधा डब्ल्यूटीसी फाइनल के लिए रन-अप में चर्चा का एक बड़ा विषय बना, क्योंकि भारत की गेंदबाजी नियंत्रण में नहीं थी, इसके लिए दोनों देशों के पूर्व क्रिकेटरों की कड़ी आलोचना हुई। गावस्कर ने सोमवार को मिड-डे के लिए अपने कॉलम में लिखा, आधुनिक युग में किसी भी अन्य शीर्ष-श्रेणी के भारतीय क्रिकेटर के साथ अश्विन के साथ ऐसा व्यवहार नहीं किया गया है, क्योंकि पहले के समय में उन्होंने घास वाली पिच पर रन नहीं बनाए थे या अगर उन्होंने सूखी स्पिन की अनुकूल पिच पर रन नहीं बनाए थे? निश्चित रूप से नहीं। उन्होंने कहा, यह घटना के बाद बुद्धिमान होना नहीं है, बल्कि एक पैटर्न है जो वर्षो से देखा गया है। इस सोच को समझना मुश्किल है कि वह पहले 100 से अधिक टेस्ट मैच खेल चुका होता। गावस्कर ने कहा, यहां तक कि अगर भारत को जीतना था, तो हमें अश्विन को दिए गए उपचार के लिए अंधा नहीं होना चाहिए और जो भी स्पष्टीकरण दिया गया है, उस मैच में गेंदबाजी के परिणाम जहां भारत को 444 का पीछा करने के लिए कहा गया, हमें बताता है कि उसे छोड़ना सही नहीं था, कॉल टू मेक। 92 मैचों में 51.8 की स्ट्राइक-रेट से 474 विकेट के साथ, जिसमें 32 पांच विकेट प्रति पारी शामिल हैं, अश्विन शीर्ष क्रम के टेस्ट गेंदबाज, मार्की संघर्ष से बाहर रह गए, क्योंकि भारत ने उनके मौजूद रहने के बावजूद चार तेज गेंदबाजों को प्राथमिकता दी। ऑस्ट्रेलिया के बल्लेबाजी क्रम में बाएं हाथ के पांच बल्लेबाजों में से अश्विन को 2021 और 2022 में इंग्लैंड में होने वाले भारत के मैचों से भी बाहर कर दिया गया था, जिसका कारण परिस्थितियों का हवाला दिया गया था। उन्होंने कहा, भारत ने आईसीसी रैंकिंग के अनुसार, खेल में नंबर 1 गेंदबाज रविचंद्रन अश्विन को हटा दिया। ऑस्ट्रेलियाई टीम में पांच बाएं हाथ के बल्लेबाज थे और जबकि एक बाएं हाथ के खिलाड़ी - ट्रैविस हेड - ने पहली पारी में तेज शतक बनाया, दूसरा दक्षिणपूर्वी एलेक्स कैरी ने पहली पारी में 48 और दूसरी पारी में नाबाद 66 रन बनाए। गावस्कर ने कहा, उस दूसरी पारी के प्रयास के दौरान उन्होंने एक और बाएं हाथ के मिशेल स्टार्क के साथ 93 रन जोड़े, जब भारत दूसरी पारी में ऑस्ट्रेलिया को सस्ते में आउट करना चाह रहा था। अगर अश्विन टीम में होते, तो वह बल्ले से भी योगदान दे सकते थे।(आईएएनएस)","pubDate":"2023-06-13 07:17:01","image_url":null,"source_id":"khaskhabar","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Australia’s Lyon primed to rattle England and join exclusive club","link":"https://www.dailymirror.lk/top-story-01/Australia’s-Lyon-primed-to-rattle-England-and-join-exclusive-club/316-261006","keywords":null,"creator":null,"video_url":null,"description":"Australian spinner Nathan Lyon heads into another Ashes campaign on the cusp of joining an elite group of players with 500 Test wickets -- and warning he can still get better.","content":"Australian spinner Nathan Lyon heads into another Ashes campaign on the cusp of joining an elite group of players with 500 Test wickets -- and warning he can still get better. The veteran of 120 Tests will do battle once more with England this week and is primed to torment a country that has accounted for 101 of his 487 scalps. The 35-year-old Lyon declared last month he believed \"100 percent\" that a whitewash of their hosts and arch-rivals was doable. Affectionately known as \"Garry\" after former Aussie Rules player Garry Lyon, he is one of the most prolific off-spinners to grace Test cricket. He took four wickets in India's second innings to help Australia win the World Test Championship final at The Oval on Sunday and is poised to join spin greats Shane Warne, Anil Kumble and Muttiah Muralitharan in the exclusive 500-club. Two of his England rivals, Jimmy Anderson and Stuart Broad, are also among the seven players to have taken 500 or more Test wickets. Lyon's fellow Australian Glenn McGrath and Courtney Walsh of the West Indies are the other two. A classical spinner who flights the ball, the durable right-armer could feasibly catch Walsh (519) during the five-Test Ashes series starting at Edgbaston on Friday. While his seemingly anointed off-spinning successor Todd Murphy was also included in Australia's squad, Lyon is not ready to slow down or give selectors any reason to consider his 22-year-old teammate as an alternative. \"There's no end in sight for me,\" Lyon, whose longevity is partly due to having not played international white-ball cricket since 2019, told reporters ahead of his departure from Australia. \"I still feel like I can get better. I feel like I'm still learning about the art of off-break bowling. I'm trying to get a lot more consistent and trying to get my stock ball even better with a few variations as well.\" He will face an added challenge in England with short boundaries designed to aid the home side's aggressive batsmen set to be deployed, which risks him being routinely pummelled to the ropes. But the opportunistic Lyon, who made his Test debut in 2011, only sees this as another chance to boost his wicket haul. \"I've been hit for six... it must be getting close to 300 (times) now for me,\" he said. \"I'm not worried by it at all, I'm not scared by it. It provides a chance (of wickets) in my eyes.\" In Murphy, Australia appear to have a long-term heir from their never-ending conveyor belt of top-class spin bowlers. This time last year he was a virtual unknown, handed a surprise Test call-up after just seven first-class matches for Victoria. He grabbed the chance with both hands in a stunning debut against India at Nagpur in February where he bagged a seven-wicket haul in their first innings while beautifully bowling in tandem with Lyon. Able to beat the bat on both edges, Australian coach Andrew McDonald said earlier this year: \"I think he's a clear number two. \"I think there's been discussion over a period of time what would happen if we didn't have Nathan Lyon. That's been one of the real positives that we've got an obvious number two that can play in all conditions.\" The bespectacled Murphy, who won a Cricket Australia contract this year, knows he is still learning the ropes, with spinning in often cold and seam-friendly English conditions a different ball game to the sub-continent. When he gets the chance to add to his four caps remains to be seen, but it appears unlikely to be in England, where the need for two spinners is rare. Chief selector George Bailey has urged him to bide his time, saying: \"We think he has a really bright future.\" (AFP)","pubDate":"2023-06-13 07:16:15","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_37fc035125.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Andrew McDonald Credits 'Subcontinent Journey' For WTC Triumph","link":"https://sports.ndtv.com/cricket/mcdonald-credits-subcontinent-journey-for-wtc-triumph-4116579","keywords":null,"creator":null,"video_url":null,"description":"Having missed out due to over-rate penalties in the 2019-21 cycle, Australia on Sunday became the first team to win ICC world titles across formats when they defeated India by 209 runs","content":"They might have failed to conquer the 'Final Frontier' on their last tour of India, but Australia head coach Andrew McDonald feels their \"sub-continent journey\" helped them get the World Test Championship mace. Having missed out due to over-rate penalties in the 2019-21 cycle, Australia on Sunday became the first team to win ICC world titles across formats when they defeated India by 209 runs in a lopsided WTC Final at The Oval. \"You can string down series in isolation, you can talk about the subcontinent journey where we went from Pakistan to Sri Lanka into India,\" McDonald told reporters. \"We had to navigate through that. So, it was a tricky World Test championship cycle and I think the wins in the subcontinent got us here.\" The Pat Cummins-led side had enjoyed some splendid wins in the sub-continent before travelling to India in pursuit of its first Test series triumph since 2004-05 in the final leg of the WTC cycle. Before travelling to India, Australia won a three-match series in Pakistan 1-0 with a crushing 115-run defeat of the hosts in Lahore in March. Then in Sri Lanka, they won the first Test by 10 wickets only to go down by an innings and 39 runs in a drawn 1-1 series. On turning Indian conditions where the matches failed to last the distance, Australia's biggest bright spot in a 1-2 loss was their nine-wicket win in the third Test in Indore. It also sealed their WTC Final berth with a round to spare in the 2021-23 cycle. \"We're really strong in Australia. So I think that most people would expect us to be winning Test matches in Australia, but to be able to execute in Pakistan, win a Test match in Sri Lanka and then to get that win in Indore to secure a place in the final was vitally important to give us this opportunity. And we've been able to take that, so it's a job well done.\" The 42-year-old further said they were just buying into the \"new concept\" of the WTC having missed out on the inaugural final in 2021. \"It's a new concept. But we're certainly buying into the concept and I think that was probably the disappointment of the first couple of years when it was in existence where we missed out due to over rate so we've made it a significant focus of ours. \"Every time we come into a series we're checking in around where we are, there's a ladder, albeit stretched out over two years, which is a little bit different to other sports, but yeah, it's high on the priority list. \"And you put on the priority list, you want to be here and you want to win it and that's what we've been able to do. So it's right up there. And if you go into that dressing room at the moment, there's a lot of happy people about, reflecting on what they've been able to achieve over the last few years.\" The focus however will shift to the marquee Ashes showdown in less than a week when they will be looking to break a 22-year drought in England. Advertisement \"Probably the next 24 hours we will switch our focus as you will, in what you do to the Ashes and the first Test,\" he said. The five-match Ashes begins with the Edgbaston Test from Friday. \"We can't wait for it to come around. First was the World Test Championship final. Let's enjoy what the team's been able to achieve over the last couple of years and then get excited about Edgbaston ball one. \"So one thing that we've got to factor into England is how we deny them those boundaries. So there's a couple of things that we can potentially tidy up and take from this game into the next one, but different opponent. So we'll get back to the drawing board around that.\" Selection conundrum Scott Boland's impressive show -- five wickets -- in the WTC Final has led to a selection headache. With Josh Hazlewood set to return, left-arm seamer Mitchell Starc's spot could come under the scanner, especially after leaking runs against India. \"India showed good intent at certain times and the game went at high three-four runs per over,\" he said. \"Mitch at times went a bit more than that and he generally goes at a fraction more than the other bowlers, and they complement each other really, really well. His wicket-taking ability is second to none. We've got to weigh all that up when we make decisions. \"But it's not a concern because we know what we're in for in the summer is slightly higher run-rate and that's because of the grounds and the surfaces. \"We value Mitch and what he's been able to do but we also value Scott and Josh and Patty (Cummins) is clearly an automatic pick being the captain and then you've got Nathan Lyon and Cameron Green in and around that. \"We feel as though we've got really good coverage and we've got some people here playing county cricket if anything should go wrong,\" the coach concluded. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-06-13 07:12:11","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"CSK Pacer Tushar Deshpande Gets Engaged To His School Crush Nabha Gaddamwar, Pictures Go Viral","link":"https://news.abplive.com/sports/cricket/csk-pacer-tushar-deshpande-gets-engaged-to-his-school-crush-nabha-gaddamwar-pictures-go-viral-1608713","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"As soon as the sixteenth edition of the Indian Premier League (IPL) came to an end, news of multiple players who were busy playing in the league getting married or engaged has come to the fore. And now, another such cricketer has joined the club. Chennai Super Kings (CSK) pacer Tushar Deshpande got engaged to his \"school crush\" Nabha Gaddamwar in a beautiful ceremony in Mumbai on Monday (June 12). Notably, Deshpande played a vital role in CSK's title-winning campaign in IPL 2023 which saw them beat the defending champions Gujarat Titans (GT) in a last-ball win in the summit clash at the Narendra Modi Stadium in Ahmedabad. In 16 matches, Deshpande scalped 21 wickets and finished the season as the Men in Yellow's leading wicket-taker. Overall, he was the sixth-highest wicket taker in the competition.The 28-year-old took to Instagram to share pictures from his engagement ceremomy and even accompanied it with a heartfelt caption. \"𝟭𝟮.𝟬𝟲.𝟮𝟬𝟮𝟯She got promoted from my school crush to MY FIANCÉ ! 😱🥰🥳❤️,\" he wrote.           View this post on Instagram                       A post shared by Tushar Deshpande (@tushardeshpande96) The Mumbai cricketer has so far played 29 first-class matches and 34 List A Games apart from 59 T20Is. In these, the Chennai bowler has managed to scalp 80, 35 and 83 wickets respectively.Post his performance in IPL 2023, Deshpande spoke about how he listens to MS Dhoni like a soldier and is convinced that the legendary captain won't take him on a wrong path. \"You know you have someone who will guide and show the light when things are not going in our favour. He is a selfless guy and keeps things simple. He doesn’t complicate things and will be with you in your bad times. Like a soldier, I will just follow whatever he says. I know he can never take me on a wrong path,\" Deshpande told Indian Express.\"Dhoni plans are very clear that this is what you need to do and then one has to execute. He will give freedom as well and when needed he will put a word. He told me that I have everything to play at the top, just be calm, take a deep breath,\" he added.Earlier, CSK opener Ruturaj Gaikwad had also gotten married. He had informed the BCCI that he won't be travelling with the Indian team for the ICC World Test Championship (WTC) final as a reserve opener because of his marriage. He tied the knot with Utkarsha Pawar, an all-rounder, who has played for Maharashtra in domestic tournaments.","content":"As soon as the sixteenth edition of the Indian Premier League (IPL) came to an end, news of multiple players who were busy playing in the league getting married or engaged has come to the fore. And now, another such cricketer has joined the club. Chennai Super Kings (CSK) pacer Tushar Deshpande got engaged to his \"school crush\" Nabha Gaddamwar in a beautiful ceremony in Mumbai on Monday (June 12). Notably, Deshpande played a vital role in CSK's title-winning campaign in IPL 2023 which saw them beat the defending champions Gujarat Titans (GT) in a last-ball win in the summit clash at the Narendra Modi Stadium in Ahmedabad. In 16 matches, Deshpande scalped 21 wickets and finished the season as the Men in Yellow's leading wicket-taker. Overall, he was the sixth-highest wicket taker in the competition. The 28-year-old took to Instagram to share pictures from his engagement ceremomy and even accompanied it with a heartfelt caption. \"𝟭𝟮.𝟬𝟲.𝟮𝟬𝟮𝟯 She got promoted from my school crush to MY FIANCÉ ! 😱🥰🥳❤️,\" he wrote. View this post on Instagram A post shared by Tushar Deshpande (@tushardeshpande96) The Mumbai cricketer has so far played 29 first-class matches and 34 List A Games apart from 59 T20Is. In these, the Chennai bowler has managed to scalp 80, 35 and 83 wickets respectively. Post his performance in IPL 2023 , Deshpande spoke about how he listens to MS Dhoni like a soldier and is convinced that the legendary captain won't take him on a wrong path. \"You know you have someone who will guide and show the light when things are not going in our favour. He is a selfless guy and keeps things simple. He doesn’t complicate things and will be with you in your bad times. Like a soldier, I will just follow whatever he says. I know he can never take me on a wrong path,\" Deshpande told Indian Express. \"Dhoni plans are very clear that this is what you need to do and then one has to execute. He will give freedom as well and when needed he will put a word. He told me that I have everything to play at the top, just be calm, take a deep breath,\" he added. Earlier, CSK opener Ruturaj Gaikwad had also gotten married. He had informed the BCCI that he won't be travelling with the Indian team for the ICC World Test Championship (WTC) final as a reserve opener because of his marriage. He tied the knot with Utkarsha Pawar, an all-rounder, who has played for Maharashtra in domestic tournaments. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); });","pubDate":"2023-06-13 06:55:06","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/13/f21ccad333116307bb3bcac05068cac51686639130316625_original.png","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"'अश्विन के साथ जो बर्ताव किया गया, ऐसा किसी के साथ नहीं होता', सुनील गावस्कर ने रोहित शर्मा को लताड़ा","link":"https://hindi.oneindia.com/news/sports/cricket/wtc-final-2023-sunil-gavaskar-said-no-any-indian-cricketer-treated-as-badly-as-r-ashwin-781184.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय टीम के दिग्गज ऑफ स्पिनर आर अश्विन को भारत ने ऑस्ट्रेलिया के खिलाफ फाइनल मैच में प्लेइंग इलेवन में जगह नहीं दी थी। बेहतरीन रिकॉर्ड होने के बावजूद अश्विन को अनदेखी का शिकार होना पड़ा था। आर अश्विन को बाहर किए जाने पर क्रिकेट के कई दिग्गजों ने अपनी नाराजगी जाहिर की है।","content":"वर्ल्ड टेस्ट चैंपियनशिप फाइनल में भारत को ऑस्ट्रेलिया की टीम ने 209 रन से हरा दिया। इस हार के साथ ही लंबे समय बाद आईसीसी ट्रॉफी जीतने का सपना भारत का टूट गया। भारतीय टीम के बल्लेबाजों ने उम्मीद के मुताबिक प्रदर्शन नहीं किया, जिस कारण टीम को एक शर्मनाक हार झेलनी पड़ी। : भारत की हार के बाद रविचंद्रन अश्विन को प्लेइंग इलेवन से बाहर रखने के फैसले पर लगातार सवाल खड़े किए जा रहे हैं। कई दिग्गजों का मानना है कि भारतीय कप्तान रोहित शर्मा और कोच राहुल द्रविड़ का यह फैसला सही नहीं था। सचिन तेंदुलकर से लेकर सुनील गावस्कर तक ने इस फैसले पर निराशा व्यक्त की है। पूर्व भारतीय सलामी बल्लेबाज सुनील गावस्कर अश्विन की टीम को बाहर किए जाने फैसले को समझ नहीं पा रहे हैं। मिड-डे के लिए अपने कॉलम में सुनील गावस्कर ने अश्विन को लेकर कई बातों का जिक्र किया है। गावस्कर ने लिखा कि भारत में किसी दूसरे टॉप क्रिकेटर के साथ ऐसा हैरान करने वाला बर्ताव नहीं किया गया है, जैसा टॉप स्पिनर रविचंद्रन अश्विन के साथ किया गया। सुनीला गावस्कर ने सवाल पूछा कि क्या कोई बल्लेबाज आईसीसी में टॉप रैंकिंग पर होता तो उसे बाहर किया जाता? अगर वह पिछले कुछ समय से घास वाली पिचों पर रन नहीं बना पाया हो तो क्या उसे टीम से बाहर कर दिया गया होता? बिल्कुल नहीं। गावस्कर के मुताबिक अश्विन के साथ जिस तरीके का व्यवहार किया गया है वो आज से पहले भारतीय क्रिकेट में किसी क्रिकेटर के साथ नहीं हुआ था। अश्विन टॉप ऑर्डर के टेस्ट गेंदबाज हैं जो लो-ऑर्डर में आकर बल्ले से भी टीम के लिए अहम योगदान देने का काम करते रहे हैं। ऑस्ट्रेलियाई टीम में पांच बाएं हाथ के बल्लेबाज थे, जिसके लिए अश्विन असरदार साबित हो सकते थे। ऑस्ट्रेलिया के बाएं हाथ के बल्लेबाज ट्रैविस हेड ने पहली पारी में 150 से अधिक रन बनाए थे। अगर अश्विन गेंदबाजी करते तो शायद परिणाम कुछ और होता।","pubDate":"2023-06-13 06:46:35","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"TNPL 2023: आईपीएल के बाद फिर चमके साईं सुदर्शन, 8 चौके और 4 छक्के जड़ टीम को दिलाई जीत","link":"https://hindi.oneindia.com/news/sports/cricket/after-ipl-2023-star-sai-sudharsan-starts-new-season-with-half-century-in-tnpl-2023-781205.html","keywords":null,"creator":null,"video_url":null,"description":"गुजरात टाइटंस की टीम आईपीएल 2023 का खिताब जीतने में भले ही चूक गई हो, लेकिन टीम के कई खिलाड़ियों ने अपने प्रदर्शन से सभी को खासा प्रभावित किया। इन खिलाड़ियों की लिस्ट में युवा बल्लेबाज साईं सुदर्शन भी हैं। आईपीएल के बाद भी साईं सुदर्शन बल्ले से धमाल मचा रहे हैं।","content":"तमिलनाडु प्रीमियर लीग का आगाज लाइका कीवई किंग्स और आईड्रीम तिरुप्पुर तमिझंस के बीच खेले गए मैच के साथ किया गया। आईपीएल 2023 के फाइनल में तूफानी पारी खेलने वाले साईं सुदर्शन ने इस मुकाबले में मैच विनिंग पारी खेली। गुजरात टाइटंस के बल्लेबाज बी साई सुदर्शन ने आईपीएल फाइनल में चेन्नई सुपरकिंग्स के खिलाफ 47 गेंदों में 96 रन की शानदार पारी खेली थी। वह इस मैच में अपना शतक पूरा करने से सिर्फ चार रनों से चूक गए थे। अब लाइका कीवई किंग्स की तरफ से पहले मैच में उन्होंने अपने पुराने फॉर्म को बरकरार रखा है और टीम के लिए धांसू पारी खेलने का काम किया। आईड्रीम तिरुप्पुर तमिझंस ने इस मुकाबले में टॉस जीतकर लाइका कीवई किंग्स को पहले बल्लेबाजी का न्योता दिया। लाइका कीवई किंग्स की शुरुआत खराब रही और टीम ने महज 14 के स्कोर पर अपने तीन खिलाड़ियों का विकेट गंवा दिया। लेकिन इसके बाद साई सुदर्शन ने आकर जबरदस्त बल्लेबाजी कर टीम को मैच विनिंग स्कोर तक पहुंचाया। टीएनपीएल 2023 के शुरुआती मुकाबले में ही आईपीएल 2023 के फाइनल वाले अंदाज में बल्लेबाजी करते हुए साई सुदर्शन ने महज 45 गेंद में 86 रन जड़ दिए। साई सुदर्शन ने अपनी पारी के दौरान 8 चौके और 4 छक्के लगाने का काम किया। साई सुदर्शन की पारी की बदौलत लाइका कीवई किंग्स ने 20 ओवर में 7 विकेट खोकर 179 रन बनाए। जिसके जवाब में आईड्रीम तिरुप्पुर तमिझंस की टीम 109 के स्कोर पर ऑल आउट हो गई। बी सचिन, जे सुरेश कुमार (विकेटकीपर), साई सुदर्शन, राम अरविंद, यू मुकिलेश, शाहरुख खान (कप्तान), एम मोहम्मद, किरण आकाश, मणिमारन सिद्धार्थ, झटवेध सुब्रमण्यन, के गौतम थमराई कन्नन। बालचंदर अनिरुद्ध, एनएस चतुर्वेद, एस गणेश, विजय शंकर, राजेंद्रन विवेक, तुषार रहेजा (विकेटकीपर), पी भुवनेश्वरन, एस अजित राम, रविश्रीनिवासन साई किशोर (कप्तान), जी पेरियास्वामी, एस मणिगंदन।","pubDate":"2023-06-13 06:43:08","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final: ऑस्ट्रेलियाई दिग्गज ने फाइनल को लेकर रोहित शर्मा के बयान का किया समर्थन, कही ये बड़ी बात","link":"https://hindi.oneindia.com/news/sports/cricket/brad-hogg-agrees-with-rohit-sharma-s-statement-on-wtc-final-3-matches-series-781204.html","keywords":null,"creator":null,"video_url":null,"description":"ब्रैड हॉग ने टीम इंडिया के कप्तान रोहित शर्मा के उस बयान का समर्थन किया है, जिसमें उन्होंने कहा कि विश्व टेस्ट चैंपियनशिप (WTC) का फाइनल तीन मैचों का होना चाहिए। ब्रैड हॉग का कहना है कि वह रोहित शर्मा से सहमत हैं कि वर्ल्ड टेस्ट चैंपियनशिप का फाइनल तीन मैचों की सीरीज होनी चाहिए।","content":"पूर्व ऑस्ट्रेलियाई स्पिनर ब्रैड हॉग ने टीम इंडिया के कप्तान रोहित शर्मा के बयान का समर्थन किया है कि विश्व टेस्ट चैंपियनशिप (WTC) का फाइनल तीन मैचों का होना चाहिए। ब्रैड हॉग का कहना है कि वह रोहित शर्मा से सहमत हैं कि वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में तीन मैचों की सीरीज होनी चाहिए। विश्व टेस्ट चैंपियनशिप के फाइनल में भारत को ऑस्ट्रेलिया के हाथों हार का सामना करना पड़ा। इस टूर्नामेंट में भारत का टॉप ऑर्डर पूरी तरह से फ्लॉप साबित हुआ, जिसके कारण इंडिया को ट्रॉफी गंवानी पड़ी। इसके बाद कप्तान रोहित शर्मा समेत अन्य खिलाड़ियों को तीखी आलोचनाओं का सामना करना पड़ा। हॉग ने अपने यूट्यूब चैनल पर अपलोड किए गए वीडियो में कहा कि 'डब्ल्यूटीसी फाइनल के साथ-साथ टूर्नामेंट के लिए एक नया फॉर्मेट पेश करने के बारे में रोहित के विचारों से सहमत हैं। उन्होंने कहा कि, 'मैं रोहित शर्मा से सहमत हूं कि डब्ल्यूटीसी फाइनल तीन मैचों की सीरीज होनी चाहिए।' उन्होंने आगे कहा कि, 'इस बार यह एक मैच का फाइनल था, जोकि ऑस्ट्रेलिया ने अपने नाम किया। इसका क्रेडिट उन्हें मिलना चाहिए। मेरे हिसाब से चार-चार टीमों का दो डिवीजन होना चाहिए। डिवीजन वन में टॉप-4 टीमें और उसके बाद बाकी टीमें दूसरे डिवीजन का हिस्सा होनी चाहिए। एसोसिएट टीमें डिवीजन थ्री में हो सकती हैं।' वहीं ऑस्ट्रेलिया के कप्तान पैट कमिंस ने विश्व टेस्ट चैंपियनशिप फाइनल के अगले टूर्नामेंट में तीन मैचों की सीरीज खेलने की रोहित शर्मा की इच्छा पर अपनी असहमती जताई है। इसके अलावा दिग्गज सुनील गावस्कर ने भी इस तरह के सुझाव के लिए भारत के कप्तान की आलोचना की और कहा कि हर टीम को ऐसे बड़े आयोजनों को खेलने से पहले मानसिक रूप से तैयार रहना चाहिए। दरअसल, भारतीट टीम द ओवल में डब्ल्यूटीसी फाइनल में ऑस्ट्रेलिया के खिलाफ 209 रनों से हार गई। टीम जब 444 रनों का पीछा करने उतरी तो एक बार फिर टॉप ऑर्डर फ्लॉप साबित हुआ, जिसके चलते टीम 234 रनों पर ढेर हो गई, और टीम इंडिया के हाथ एक बार फिर सिर्फ निराशा लगी।","pubDate":"2023-06-13 06:42:39","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final में जीत का दावा करने वालों की हरभजन सिंह ने खोली पोल, बोले- नकली है टीम इंडिया का कॉन्फिडेंस","link":"https://hindi.oneindia.com/news/sports/cricket/harbhajan-singh-says-fake-confidence-by-winning-on-bad-matches-wtc-final-2023-781226.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के खिलाफ विश्व टेस्ट चैंपियनशिप के फाइनल में टीम इंडिया की हार के बाद हरभजन सिंह ने बड़ा बयान दिया है। उन्होंने कहा कि स्पिन के लिए अनुकूल भारतीय पिचों पर सिर्फ तीन दिन के भीतर टेस्ट मैच खत्म करके भारत खुद को बड़े मुकाबलों के लिए पूरी तरह से तैयार नहीं कर सकता है और उन्हें सभी पांच दिनों तक कड़ी मेहनत करने की जरूरत है।","content":"वर्ल्ड टेस्ट चैंपियनशिप फाइनल में ऑस्ट्रेलिया के खिलाफ टीम इंडिया को पूरी उम्मीद दी थी कि वो ट्रॉफी लेकर ही लौटेंगे। खिलाड़ियों में आत्मविश्वास की कोई कमी नहीं थी, मोहम्मद शमी ने तो यहां तक कह दिया था कि 100 प्रतिशत हर किसी को भरोसा है कि हम ये मैच जीतेंगे, लेकिन आगे क्या हुआ वो सभी को पता है। इस बीच अब पूर्व भारतीय स्पिनर हरभजन सिंह ने टीम इंडिया के इस आत्मविश्वास को फेक कॉन्फिडेंस बताया है। द ओवल में ऑस्ट्रेलिया के खिलाफ भारत की हार के बाद हरभजन सिंह ने भारत में अत्यधिक स्पिन फ्रेंडली पिचों पर सवाल उठाए हैं और बताया है कि कैसे बड़े मैचों के लिए भारत की तैयारी को प्रभावित करता है। द ओवल में फाइनल में भारत के खिलाफ 209 रनों से आईसीसी विश्व टेस्ट चैम्पियनशिप खिताब जीतने के बाद ऑस्ट्रेलिया ने सभी फॉर्मेट में आईसीसी ट्राफियां जीतकर इतिहास रच दिया। पांच दिनों तक भारत पर हावी रहने के बाद ऑस्ट्रेलिया ने रविवार को लंदन में अपना पहला विश्व टेस्ट चैंपियनशिप 2023 का खिताब हासिल किया। हरभजन ने कहा कि स्पिन की मददगार भारतीय पिचों पर सिर्फ तीन दिन के अंदर टेस्ट मैच खत्म करके भारत खुद को बड़े मुकाबलों के लिए पूरी तरह से तैयार नहीं कर सकता और उन्हें पूरे पांच दिन कड़ी मेहनत करने की जरूरत है, और इसे अपनी आदत बना लेना चाहिए। मैच के बाद स्टार स्पोर्ट्स पर हरभजन ने कहा, 'आप खराब पिचों पर मैच खेलने और जीतने के बाद खुद को वह नकली आत्मविश्वास नहीं दे सकते, जहां गेंद पहली गेंद से घूमने लगती है। आपको पांच दिनों तक कड़ी मेहनत करने की आदत डालनी होगी। तेज गेंदबाजों को इन पिचों पर ज्यादा गेंदबाजी करने का मौका नहीं मिलता है, पहले ओवर से ही स्पिनरों का इस्तेमाल किया जाता है। हमें बहुत सी चीजों में सुधार करना चाहिए।' इस साल की शुरुआत में ऑस्ट्रेलिया के खिलाफ हाल ही में समाप्त हुई बॉर्डर-गावस्कर ट्रॉफी में स्पिन गेंदबाज काफी सफल साबित हुए थे और चार में से तीन टेस्ट तीन दिनों में समाप्त हुए। इस दौरान रविचंद्रन अश्विन (25 विकेट), रवींद्र जडेजा (22) और नाथन लियोन (22) ने सबसे अधिक विकेट लिए। हालांकि, ऑस्ट्रेलिया के खिलाफ इंडियन टीम में अश्विन को प्लेइंग-11 में जगह न देने पर कप्तान रोहित शर्मा की काफी आलोचना हुई।","pubDate":"2023-06-13 07:35:00","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"'ऑस्ट्रेलियाई टीम चुस्त और भारत सुस्त,' मोहम्मद कैफ ने टीम इंडिया की फील्डिंग पर कही तीखी बात","link":"https://hindi.oneindia.com/news/sports/cricket/wtc-final-indian-fielding-was-lazy-says-mohammed-kaif-781222.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय टीम की फील्डिंग को लेकर मोहम्मद कैफ ने बड़ी प्रतिक्रिया दी है। कैफ ने कहा है कि ऑस्ट्रेलिया ने फुर्ती दिखाई लेकिन भारत के फील्डर बिलकुल आलसी दिखाई दे रहे थे।","content":"ऑस्ट्रेलिया के खिलाफ वर्ल्ड टेस्ट चैम्पियनशिप के फाइनल मैच में भारतीय टीम से हुई गलतियों की तरफ हर कोई इशारा कर रहा है। बातें हो रही हैं और विश्लेषण भी सामने आ रहे हैं। मोहम्मद कैफ ने दोनों टीमों की फील्डिंग को लेकर अहम बयान दिया है। कैफ ने ऑस्ट्रेलिया की फील्डिंग को भारत से बेहतर बताया। उन्होंने कहा कि भारतीय टीम मौकों का फायदा उठाने में नाकाम रही। ऑस्ट्रेलियाई टीम मैदान पर ज्यादा चुस्त दिखाई दे रही थी। कंगारुओं ने अपने पास आए मौकों का लाभ बखूबी उठाया। इंडियन एक्सप्रेस की एक रिपोर्ट के अनुसार कैफ ने स्लिप फील्डिंग को अहम मानते हुए कहा कि यहाँ कॉर्डिनेशन ख़ास होता है क्योंकि स्लिप एक अहम पोजीशन है। इंग्लैंड में गेंद मूव ज्यादा होती है इस वजह से ज्यादातर आउट विकेट के पीछे होते हैं। इस वजह से स्लिप का फील्डर हर समय गेम में अहम होता है। कैफ ने कहा कि आप कैच मिस नहीं कर सकते। मैदान पर जाने से पहले आपको इन चीजों का हल निकालना होता है। पुजारा स्लिप में पैड पहनकर खड़े थे। इसे लेकर कैफ ने कहा कि यह सुस्ती दर्शाता है। फील्डर सोचता है कि स्लिप में कैच नहीं आएगा। खेल के अहम क्षणों में भारत किसी भी तरह की चूक बर्दाश्त नहीं कर सकता था। पूर्व भारतीय खिलाड़ी ने कहा कि पैड पहनने से आप ज्यादा हिल नहीं सकते और पूरी तरह से झुक भी नहीं सकते। ये ऐसी गलतियाँ हैं जिनको मैंने पहली बार नहीं देखा है। इस तरह की चीजें पहले भी होती दिखी हैं। कोई भी इन पर ज्यादा ध्यान नहीं देता है। गौरतलब है कि ऑस्ट्रेलिया के खिलाफ इस अहम मैच में भारत की स्लिप फील्डिंग भी खास नहीं थी। दूसरी तरफ ऑस्ट्रेलिया की टीम मुस्तैदी के साथ मैदान पर थी। स्मिथ और कैमरन ग्रीन ने अपने शानदार कैच लेकर मजबूत फील्डिंग का अहसास करा दिया था।","pubDate":"2023-06-13 07:23:35","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sourav on Virat: 'আমরাও অবাক হয়ে গিয়েছিলাম', বিরাট অধিনায়কত্ব ছাড়া নিয়ে ফের বিস্ফোরক সৌরভ","link":"https://bengali.abplive.com/sports/cricket/sourav-ganguly-claims-virat-kohli-s-resignation-from-captaincy-was-unexpected-for-bcci-too-985165","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"নয়াদিল্লি: সাম্প্রতিক সময়ে বিরাট কোহলি (Virat Kohli) ও সৌরভ গঙ্গোপাধ্যায়ের (Sourav Ganguly) মধ্যেকার সম্পর্ক তথা বিবাদ বারংবার শিরোনাম কেড়েছে। সৌরভের বিসিসিআইয়ের সভাপতি থাকার সময়ই বিরাট কোহলি জাতীয় দলের অধিনায়ক পদ থেকে পদত্যাগ করেছিলেন বিরাট। সেই নিয়ে অনেক জল্পনা-কল্পনা চলেছে। সৌরভ দাবি করেছিলেন বোর্ড বিরাটকে ইস্তফা না দেওয়ার আবেদন করেছিল। তবে বিরাট সম্পূর্ণ ভিন্ন দাবি করেন। তারপর গঙ্গা দিয়ে অনেক জল বয়ে গিয়েছে। তবে সৌরভ কিন্তু নিজের দাবিতে অনড়। তিনি বলেন, 'বিরাট কোহলির টেস্ট অধিনায়কত্ব ছাড়ার জন্য কিন্তু বিসিসিআই প্রস্তুত ছিল না। দক্ষিণ আফ্রিকা সফরের পর হঠাৎ করে এমন একটা সিদ্ধান্ত আমাদের সকলকেই চমকে দিয়েছিল। আমরা সবাই অবাক হয়ে গিয়েছিলাম। শুধু কোহলিই জানে ও কেন অধিনায়কত্ব থেকে সরে দাঁড়াল। তবে এখন আর এ বিষয়ে কথা বলার কোনও মানে নেই। নির্বাচকদের তো একজনকে অধিনায়ক নিয়োগ করতেই হত। রোহিতই ওই সময় সেরা বিকল্প ছিল।' বিরাটের অধিনায়কত্বে ভারতীয় দল বিদেশের মাটিতে বিশেষত টেস্টে দুর্দান্ত পারফর্ম করলেও, কোনও আইসিসি ট্রফি জিততে পারেনি। বিরাটের পর রোহিতের অধিনায়কত্বেও কিন্তু এই নিয়ে দুই বছরে দ্বিতীয় আইসিসি খেতাব হাতছাড়া করল ভারত। এই নিয়ে অনেকেই আইপিএলকে কাঠগড়ায় দাঁড় করাচ্ছে। এরই মাঝে সৌরভের দাবি বিশ্বকাপ জেতার থেকে কিন্তু আইপিএল জেতা অনেক কঠিন। তিনি বলেন, 'আইপিএল জেতাটা বিশ্বকাপ জয়ের থেকে অনেক বেশি কঠিন। গ্রুপ পর্বে ১৪টি ম্যাচ খেলার পর প্লে অফ খেলতে হয় আইপিএলে। সেখানে বিশ্বকাপে চার পাঁচটি ম্যাচ খেলার পরেই দলগুলি সেমিফাইনাল এবং সেখান থেকে ফাইনালে পৌঁছয়।' আরও পড়ুন: চুলের রুক্ষ-শুষ্ক ভাব দূর করতে সারাবছরই প্রয়োজন যত্ন, কীভাবে পরিচর্যা করবেন?","content":"নয়াদিল্লি: সাম্প্রতিক সময়ে বিরাট কোহলি (Virat Kohli) ও সৌরভ গঙ্গোপাধ্যায়ের (Sourav Ganguly) মধ্যেকার সম্পর্ক তথা বিবাদ বারংবার শিরোনাম কেড়েছে। সৌরভের বিসিসিআইয়ের সভাপতি থাকার সময়ই বিরাট কোহলি জাতীয় দলের অধিনায়ক পদ থেকে পদত্যাগ করেছিলেন বিরাট। সেই নিয়ে অনেক জল্পনা-কল্পনা চলেছে। সৌরভ দাবি করেছিলেন বোর্ড বিরাটকে ইস্তফা না দেওয়ার আবেদন করেছিল। তবে বিরাট সম্পূর্ণ ভিন্ন দাবি করেন। তারপর গঙ্গা দিয়ে অনেক জল বয়ে গিয়েছে। তবে সৌরভ কিন্তু নিজের দাবিতে অনড়। তিনি বলেন, 'বিরাট কোহলির টেস্ট অধিনায়কত্ব ছাড়ার জন্য কিন্তু বিসিসিআই প্রস্তুত ছিল না। দক্ষিণ আফ্রিকা সফরের পর হঠাৎ করে এমন একটা সিদ্ধান্ত আমাদের সকলকেই চমকে দিয়েছিল। আমরা সবাই অবাক হয়ে গিয়েছিলাম। শুধু কোহলি ই জানে ও কেন অধিনায়কত্ব থেকে সরে দাঁড়াল। তবে এখন আর এ বিষয়ে কথা বলার কোনও মানে নেই। নির্বাচকদের তো একজনকে অধিনায়ক নিয়োগ করতেই হত। রোহিতই (শর্মা) ওই সময় সেরা বিকল্প ছিল।' ভারত রোহিতের অধিনায়কত্বে টেস্টের সেরা হওয়ার সুযোগ হাতছাড়া করলেও, সৌরভ কিন্তু এখনও রোহিতকে (Rohit Sharma) অধিনায়ক পদে বহাল রাখার পক্ষেই। তিনি বলেন, 'দিনের শেষে অধিনায়ক বাছাইয়ের কাজটা তো নির্বাচকদের, এই সিদ্ধান্ত সোশ্যাল মিডিয়ার দ্বারা কীভাব প্রভাবিত হতে পারে? বিরাট নিজেই বছর দুই আগে আর টেস্টে অধিনায়কত্ব করতে চায়নি। আমাকে যদি প্রশ্ন করা হয় যে ভারতের অধিনায়ক ও কোচ কার হওয়া উচিত, আমি কিন্তু এখনও রোহিত এবং রাহুলের কথাই বলব। এটাই সঠিক সিদ্ধান্ত।' বিরাটের অধিনায়কত্বে ভারতীয় দল বিদেশের মাটিতে বিশেষত টেস্টে দুর্দান্ত পারফর্ম করলেও, কোনও আইসিসি ট্রফি জিততে পারেনি। বিরাটের পর রোহিতের অধিনায়কত্বেও কিন্তু এই নিয়ে দুই বছরে দ্বিতীয় আইসিসি খেতাব হাতছাড়া করল ভারত। এই নিয়ে অনেকেই আইপিএলকে কাঠগড়ায় দাঁড় করাচ্ছে। এরই মাঝে সৌরভের দাবি বিশ্বকাপ জেতার থেকে কিন্তু আইপিএল জেতা অনেক কঠিন। তিনি বলেন, 'আইপিএল জেতাটা বিশ্বকাপ জয়ের থেকে অনেক বেশি কঠিন। গ্রুপ পর্বে ১৪টি ম্যাচ খেলার পর প্লে অফ খেলতে হয় আইপিএল ে। সেখানে বিশ্বকাপে চার পাঁচটি ম্যাচ খেলার পরেই দলগুলি সেমিফাইনাল এবং সেখান থেকে ফাইনালে পৌঁছয়।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); এবিপি আনন্দ এখন টেলিগ্রামেও, ক্লিক করুন এই লিঙ্কে https://t.me/abpanandaofficial আরও পড়ুন: চুলের রুক্ষ-শুষ্ক ভাব দূর করতে সারাবছরই প্রয়োজন যত্ন, কীভাবে পরিচর্যা করবেন? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-13 07:18:57","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/13/422cf57772b95a864d3da000316f95211686636712529507_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"अश्विन के साथ जैसा बर्ताव हुआ, वैसा किसी और क्रिकेटर के साथ नहीं : गावस्कर","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-no-other-cricketer-was-treated-like-ashwin-gavaskar-news-hindi-1-566869-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"दिग्गज बल्लेबाज सुनील गावस्कर का मानना है कि भारत में किसी अन्य शीर्ष क्रिकेटर के साथ ऐसा चौंकाने वाला बर्ताव नहीं किया गया है, जैसा शीर्ष ऑफ स्पिनर रविचंद्रन अश्विन के साथ किया गया।","content":"नई दिल्ली। दिग्गज बल्लेबाज सुनील गावस्कर का मानना है कि भारत में किसी अन्य शीर्ष क्रिकेटर के साथ ऐसा चौंकाने वाला बर्ताव नहीं किया गया है, जैसा शीर्ष ऑफ स्पिनर रविचंद्रन अश्विन के साथ किया गया। उन्हें अंतिम एकादश से बाहर रखा गया। यही वजह है कि द ओवल में वल्र्ड टेस्ट चैंपियनशिप (डब्ल्यूटीसी) फाइनल में भारत की ऑस्ट्रेलिया से 209 रनों से हार हुई। अश्विन के प्लेइंग इलेवन में होने या न होने की दुविधा डब्ल्यूटीसी फाइनल के लिए रन-अप में चर्चा का एक बड़ा विषय बना, क्योंकि भारत की गेंदबाजी नियंत्रण में नहीं थी, इसके लिए दोनों देशों के पूर्व क्रिकेटरों की कड़ी आलोचना हुई। गावस्कर ने सोमवार को मिड-डे के लिए अपने कॉलम में लिखा, आधुनिक युग में किसी भी अन्य शीर्ष-श्रेणी के भारतीय क्रिकेटर के साथ अश्विन के साथ ऐसा व्यवहार नहीं किया गया है, क्योंकि पहले के समय में उन्होंने घास वाली पिच पर रन नहीं बनाए थे या अगर उन्होंने सूखी स्पिन की अनुकूल पिच पर रन नहीं बनाए थे? निश्चित रूप से नहीं। उन्होंने कहा, यह घटना के बाद बुद्धिमान होना नहीं है, बल्कि एक पैटर्न है जो वर्षो से देखा गया है। इस सोच को समझना मुश्किल है कि वह पहले 100 से अधिक टेस्ट मैच खेल चुका होता। गावस्कर ने कहा, यहां तक कि अगर भारत को जीतना था, तो हमें अश्विन को दिए गए उपचार के लिए अंधा नहीं होना चाहिए और जो भी स्पष्टीकरण दिया गया है, उस मैच में गेंदबाजी के परिणाम जहां भारत को 444 का पीछा करने के लिए कहा गया, हमें बताता है कि उसे छोड़ना सही नहीं था, कॉल टू मेक। 92 मैचों में 51.8 की स्ट्राइक-रेट से 474 विकेट के साथ, जिसमें 32 पांच विकेट प्रति पारी शामिल हैं, अश्विन शीर्ष क्रम के टेस्ट गेंदबाज, मार्की संघर्ष से बाहर रह गए, क्योंकि भारत ने उनके मौजूद रहने के बावजूद चार तेज गेंदबाजों को प्राथमिकता दी। ऑस्ट्रेलिया के बल्लेबाजी क्रम में बाएं हाथ के पांच बल्लेबाजों में से अश्विन को 2021 और 2022 में इंग्लैंड में होने वाले भारत के मैचों से भी बाहर कर दिया गया था, जिसका कारण परिस्थितियों का हवाला दिया गया था। उन्होंने कहा, भारत ने आईसीसी रैंकिंग के अनुसार, खेल में नंबर 1 गेंदबाज रविचंद्रन अश्विन को हटा दिया। ऑस्ट्रेलियाई टीम में पांच बाएं हाथ के बल्लेबाज थे और जबकि एक बाएं हाथ के खिलाड़ी - ट्रैविस हेड - ने पहली पारी में तेज शतक बनाया, दूसरा दक्षिणपूर्वी एलेक्स कैरी ने पहली पारी में 48 और दूसरी पारी में नाबाद 66 रन बनाए। गावस्कर ने कहा, उस दूसरी पारी के प्रयास के दौरान उन्होंने एक और बाएं हाथ के मिशेल स्टार्क के साथ 93 रन जोड़े, जब भारत दूसरी पारी में ऑस्ट्रेलिया को सस्ते में आउट करना चाह रहा था। अगर अश्विन टीम में होते, तो वह बल्ले से भी योगदान दे सकते थे।(आईएएनएस)","pubDate":"2023-06-13 07:17:01","image_url":null,"source_id":"khaskhabar","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Australia’s Lyon primed to rattle England and join exclusive club","link":"https://www.dailymirror.lk/top-story-01/Australia’s-Lyon-primed-to-rattle-England-and-join-exclusive-club/316-261006","keywords":null,"creator":null,"video_url":null,"description":"Australian spinner Nathan Lyon heads into another Ashes campaign on the cusp of joining an elite group of players with 500 Test wickets -- and warning he can still get better.","content":"Australian spinner Nathan Lyon heads into another Ashes campaign on the cusp of joining an elite group of players with 500 Test wickets -- and warning he can still get better. The veteran of 120 Tests will do battle once more with England this week and is primed to torment a country that has accounted for 101 of his 487 scalps. The 35-year-old Lyon declared last month he believed \"100 percent\" that a whitewash of their hosts and arch-rivals was doable. Affectionately known as \"Garry\" after former Aussie Rules player Garry Lyon, he is one of the most prolific off-spinners to grace Test cricket. He took four wickets in India's second innings to help Australia win the World Test Championship final at The Oval on Sunday and is poised to join spin greats Shane Warne, Anil Kumble and Muttiah Muralitharan in the exclusive 500-club. Two of his England rivals, Jimmy Anderson and Stuart Broad, are also among the seven players to have taken 500 or more Test wickets. Lyon's fellow Australian Glenn McGrath and Courtney Walsh of the West Indies are the other two. A classical spinner who flights the ball, the durable right-armer could feasibly catch Walsh (519) during the five-Test Ashes series starting at Edgbaston on Friday. While his seemingly anointed off-spinning successor Todd Murphy was also included in Australia's squad, Lyon is not ready to slow down or give selectors any reason to consider his 22-year-old teammate as an alternative. \"There's no end in sight for me,\" Lyon, whose longevity is partly due to having not played international white-ball cricket since 2019, told reporters ahead of his departure from Australia. \"I still feel like I can get better. I feel like I'm still learning about the art of off-break bowling. I'm trying to get a lot more consistent and trying to get my stock ball even better with a few variations as well.\" He will face an added challenge in England with short boundaries designed to aid the home side's aggressive batsmen set to be deployed, which risks him being routinely pummelled to the ropes. But the opportunistic Lyon, who made his Test debut in 2011, only sees this as another chance to boost his wicket haul. \"I've been hit for six... it must be getting close to 300 (times) now for me,\" he said. \"I'm not worried by it at all, I'm not scared by it. It provides a chance (of wickets) in my eyes.\" In Murphy, Australia appear to have a long-term heir from their never-ending conveyor belt of top-class spin bowlers. This time last year he was a virtual unknown, handed a surprise Test call-up after just seven first-class matches for Victoria. He grabbed the chance with both hands in a stunning debut against India at Nagpur in February where he bagged a seven-wicket haul in their first innings while beautifully bowling in tandem with Lyon. Able to beat the bat on both edges, Australian coach Andrew McDonald said earlier this year: \"I think he's a clear number two. \"I think there's been discussion over a period of time what would happen if we didn't have Nathan Lyon. That's been one of the real positives that we've got an obvious number two that can play in all conditions.\" The bespectacled Murphy, who won a Cricket Australia contract this year, knows he is still learning the ropes, with spinning in often cold and seam-friendly English conditions a different ball game to the sub-continent. When he gets the chance to add to his four caps remains to be seen, but it appears unlikely to be in England, where the need for two spinners is rare. Chief selector George Bailey has urged him to bide his time, saying: \"We think he has a really bright future.\" (AFP)","pubDate":"2023-06-13 07:16:15","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_37fc035125.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Andrew McDonald Credits 'Subcontinent Journey' For WTC Triumph","link":"https://sports.ndtv.com/cricket/mcdonald-credits-subcontinent-journey-for-wtc-triumph-4116579","keywords":null,"creator":null,"video_url":null,"description":"Having missed out due to over-rate penalties in the 2019-21 cycle, Australia on Sunday became the first team to win ICC world titles across formats when they defeated India by 209 runs","content":"They might have failed to conquer the 'Final Frontier' on their last tour of India, but Australia head coach Andrew McDonald feels their \"sub-continent journey\" helped them get the World Test Championship mace. Having missed out due to over-rate penalties in the 2019-21 cycle, Australia on Sunday became the first team to win ICC world titles across formats when they defeated India by 209 runs in a lopsided WTC Final at The Oval. \"You can string down series in isolation, you can talk about the subcontinent journey where we went from Pakistan to Sri Lanka into India,\" McDonald told reporters. \"We had to navigate through that. So, it was a tricky World Test championship cycle and I think the wins in the subcontinent got us here.\" The Pat Cummins-led side had enjoyed some splendid wins in the sub-continent before travelling to India in pursuit of its first Test series triumph since 2004-05 in the final leg of the WTC cycle. Before travelling to India, Australia won a three-match series in Pakistan 1-0 with a crushing 115-run defeat of the hosts in Lahore in March. Then in Sri Lanka, they won the first Test by 10 wickets only to go down by an innings and 39 runs in a drawn 1-1 series. On turning Indian conditions where the matches failed to last the distance, Australia's biggest bright spot in a 1-2 loss was their nine-wicket win in the third Test in Indore. It also sealed their WTC Final berth with a round to spare in the 2021-23 cycle. \"We're really strong in Australia. So I think that most people would expect us to be winning Test matches in Australia, but to be able to execute in Pakistan, win a Test match in Sri Lanka and then to get that win in Indore to secure a place in the final was vitally important to give us this opportunity. And we've been able to take that, so it's a job well done.\" The 42-year-old further said they were just buying into the \"new concept\" of the WTC having missed out on the inaugural final in 2021. \"It's a new concept. But we're certainly buying into the concept and I think that was probably the disappointment of the first couple of years when it was in existence where we missed out due to over rate so we've made it a significant focus of ours. \"Every time we come into a series we're checking in around where we are, there's a ladder, albeit stretched out over two years, which is a little bit different to other sports, but yeah, it's high on the priority list. \"And you put on the priority list, you want to be here and you want to win it and that's what we've been able to do. So it's right up there. And if you go into that dressing room at the moment, there's a lot of happy people about, reflecting on what they've been able to achieve over the last few years.\" The focus however will shift to the marquee Ashes showdown in less than a week when they will be looking to break a 22-year drought in England. Advertisement \"Probably the next 24 hours we will switch our focus as you will, in what you do to the Ashes and the first Test,\" he said. The five-match Ashes begins with the Edgbaston Test from Friday. \"We can't wait for it to come around. First was the World Test Championship final. Let's enjoy what the team's been able to achieve over the last couple of years and then get excited about Edgbaston ball one. \"So one thing that we've got to factor into England is how we deny them those boundaries. So there's a couple of things that we can potentially tidy up and take from this game into the next one, but different opponent. So we'll get back to the drawing board around that.\" Selection conundrum Scott Boland's impressive show -- five wickets -- in the WTC Final has led to a selection headache. With Josh Hazlewood set to return, left-arm seamer Mitchell Starc's spot could come under the scanner, especially after leaking runs against India. \"India showed good intent at certain times and the game went at high three-four runs per over,\" he said. \"Mitch at times went a bit more than that and he generally goes at a fraction more than the other bowlers, and they complement each other really, really well. His wicket-taking ability is second to none. We've got to weigh all that up when we make decisions. \"But it's not a concern because we know what we're in for in the summer is slightly higher run-rate and that's because of the grounds and the surfaces. \"We value Mitch and what he's been able to do but we also value Scott and Josh and Patty (Cummins) is clearly an automatic pick being the captain and then you've got Nathan Lyon and Cameron Green in and around that. \"We feel as though we've got really good coverage and we've got some people here playing county cricket if anything should go wrong,\" the coach concluded. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-06-13 07:12:11","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"CSK Pacer Tushar Deshpande Gets Engaged To His School Crush Nabha Gaddamwar, Pictures Go Viral","link":"https://news.abplive.com/sports/cricket/csk-pacer-tushar-deshpande-gets-engaged-to-his-school-crush-nabha-gaddamwar-pictures-go-viral-1608713","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"As soon as the sixteenth edition of the Indian Premier League (IPL) came to an end, news of multiple players who were busy playing in the league getting married or engaged has come to the fore. And now, another such cricketer has joined the club. Chennai Super Kings (CSK) pacer Tushar Deshpande got engaged to his \"school crush\" Nabha Gaddamwar in a beautiful ceremony in Mumbai on Monday (June 12). Notably, Deshpande played a vital role in CSK's title-winning campaign in IPL 2023 which saw them beat the defending champions Gujarat Titans (GT) in a last-ball win in the summit clash at the Narendra Modi Stadium in Ahmedabad. In 16 matches, Deshpande scalped 21 wickets and finished the season as the Men in Yellow's leading wicket-taker. Overall, he was the sixth-highest wicket taker in the competition.The 28-year-old took to Instagram to share pictures from his engagement ceremomy and even accompanied it with a heartfelt caption. \"𝟭𝟮.𝟬𝟲.𝟮𝟬𝟮𝟯She got promoted from my school crush to MY FIANCÉ ! 😱🥰🥳❤️,\" he wrote.           View this post on Instagram                       A post shared by Tushar Deshpande (@tushardeshpande96) The Mumbai cricketer has so far played 29 first-class matches and 34 List A Games apart from 59 T20Is. In these, the Chennai bowler has managed to scalp 80, 35 and 83 wickets respectively.Post his performance in IPL 2023, Deshpande spoke about how he listens to MS Dhoni like a soldier and is convinced that the legendary captain won't take him on a wrong path. \"You know you have someone who will guide and show the light when things are not going in our favour. He is a selfless guy and keeps things simple. He doesn’t complicate things and will be with you in your bad times. Like a soldier, I will just follow whatever he says. I know he can never take me on a wrong path,\" Deshpande told Indian Express.\"Dhoni plans are very clear that this is what you need to do and then one has to execute. He will give freedom as well and when needed he will put a word. He told me that I have everything to play at the top, just be calm, take a deep breath,\" he added.Earlier, CSK opener Ruturaj Gaikwad had also gotten married. He had informed the BCCI that he won't be travelling with the Indian team for the ICC World Test Championship (WTC) final as a reserve opener because of his marriage. He tied the knot with Utkarsha Pawar, an all-rounder, who has played for Maharashtra in domestic tournaments.","content":"As soon as the sixteenth edition of the Indian Premier League (IPL) came to an end, news of multiple players who were busy playing in the league getting married or engaged has come to the fore. And now, another such cricketer has joined the club. Chennai Super Kings (CSK) pacer Tushar Deshpande got engaged to his \"school crush\" Nabha Gaddamwar in a beautiful ceremony in Mumbai on Monday (June 12). Notably, Deshpande played a vital role in CSK's title-winning campaign in IPL 2023 which saw them beat the defending champions Gujarat Titans (GT) in a last-ball win in the summit clash at the Narendra Modi Stadium in Ahmedabad. In 16 matches, Deshpande scalped 21 wickets and finished the season as the Men in Yellow's leading wicket-taker. Overall, he was the sixth-highest wicket taker in the competition. The 28-year-old took to Instagram to share pictures from his engagement ceremomy and even accompanied it with a heartfelt caption. \"𝟭𝟮.𝟬𝟲.𝟮𝟬𝟮𝟯 She got promoted from my school crush to MY FIANCÉ ! 😱🥰🥳❤️,\" he wrote. View this post on Instagram A post shared by Tushar Deshpande (@tushardeshpande96) The Mumbai cricketer has so far played 29 first-class matches and 34 List A Games apart from 59 T20Is. In these, the Chennai bowler has managed to scalp 80, 35 and 83 wickets respectively. Post his performance in IPL 2023 , Deshpande spoke about how he listens to MS Dhoni like a soldier and is convinced that the legendary captain won't take him on a wrong path. \"You know you have someone who will guide and show the light when things are not going in our favour. He is a selfless guy and keeps things simple. He doesn’t complicate things and will be with you in your bad times. Like a soldier, I will just follow whatever he says. I know he can never take me on a wrong path,\" Deshpande told Indian Express. \"Dhoni plans are very clear that this is what you need to do and then one has to execute. He will give freedom as well and when needed he will put a word. He told me that I have everything to play at the top, just be calm, take a deep breath,\" he added. Earlier, CSK opener Ruturaj Gaikwad had also gotten married. He had informed the BCCI that he won't be travelling with the Indian team for the ICC World Test Championship (WTC) final as a reserve opener because of his marriage. He tied the knot with Utkarsha Pawar, an all-rounder, who has played for Maharashtra in domestic tournaments. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); });","pubDate":"2023-06-13 06:55:06","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/13/f21ccad333116307bb3bcac05068cac51686639130316625_original.png","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"'अश्विन के साथ जो बर्ताव किया गया, ऐसा किसी के साथ नहीं होता', सुनील गावस्कर ने रोहित शर्मा को लताड़ा","link":"https://hindi.oneindia.com/news/sports/cricket/wtc-final-2023-sunil-gavaskar-said-no-any-indian-cricketer-treated-as-badly-as-r-ashwin-781184.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय टीम के दिग्गज ऑफ स्पिनर आर अश्विन को भारत ने ऑस्ट्रेलिया के खिलाफ फाइनल मैच में प्लेइंग इलेवन में जगह नहीं दी थी। बेहतरीन रिकॉर्ड होने के बावजूद अश्विन को अनदेखी का शिकार होना पड़ा था। आर अश्विन को बाहर किए जाने पर क्रिकेट के कई दिग्गजों ने अपनी नाराजगी जाहिर की है।","content":"वर्ल्ड टेस्ट चैंपियनशिप फाइनल में भारत को ऑस्ट्रेलिया की टीम ने 209 रन से हरा दिया। इस हार के साथ ही लंबे समय बाद आईसीसी ट्रॉफी जीतने का सपना भारत का टूट गया। भारतीय टीम के बल्लेबाजों ने उम्मीद के मुताबिक प्रदर्शन नहीं किया, जिस कारण टीम को एक शर्मनाक हार झेलनी पड़ी। : भारत की हार के बाद रविचंद्रन अश्विन को प्लेइंग इलेवन से बाहर रखने के फैसले पर लगातार सवाल खड़े किए जा रहे हैं। कई दिग्गजों का मानना है कि भारतीय कप्तान रोहित शर्मा और कोच राहुल द्रविड़ का यह फैसला सही नहीं था। सचिन तेंदुलकर से लेकर सुनील गावस्कर तक ने इस फैसले पर निराशा व्यक्त की है। पूर्व भारतीय सलामी बल्लेबाज सुनील गावस्कर अश्विन की टीम को बाहर किए जाने फैसले को समझ नहीं पा रहे हैं। मिड-डे के लिए अपने कॉलम में सुनील गावस्कर ने अश्विन को लेकर कई बातों का जिक्र किया है। गावस्कर ने लिखा कि भारत में किसी दूसरे टॉप क्रिकेटर के साथ ऐसा हैरान करने वाला बर्ताव नहीं किया गया है, जैसा टॉप स्पिनर रविचंद्रन अश्विन के साथ किया गया। सुनीला गावस्कर ने सवाल पूछा कि क्या कोई बल्लेबाज आईसीसी में टॉप रैंकिंग पर होता तो उसे बाहर किया जाता? अगर वह पिछले कुछ समय से घास वाली पिचों पर रन नहीं बना पाया हो तो क्या उसे टीम से बाहर कर दिया गया होता? बिल्कुल नहीं। गावस्कर के मुताबिक अश्विन के साथ जिस तरीके का व्यवहार किया गया है वो आज से पहले भारतीय क्रिकेट में किसी क्रिकेटर के साथ नहीं हुआ था। अश्विन टॉप ऑर्डर के टेस्ट गेंदबाज हैं जो लो-ऑर्डर में आकर बल्ले से भी टीम के लिए अहम योगदान देने का काम करते रहे हैं। ऑस्ट्रेलियाई टीम में पांच बाएं हाथ के बल्लेबाज थे, जिसके लिए अश्विन असरदार साबित हो सकते थे। ऑस्ट्रेलिया के बाएं हाथ के बल्लेबाज ट्रैविस हेड ने पहली पारी में 150 से अधिक रन बनाए थे। अगर अश्विन गेंदबाजी करते तो शायद परिणाम कुछ और होता।","pubDate":"2023-06-13 06:46:35","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"TNPL 2023: आईपीएल के बाद फिर चमके साईं सुदर्शन, 8 चौके और 4 छक्के जड़ टीम को दिलाई जीत","link":"https://hindi.oneindia.com/news/sports/cricket/after-ipl-2023-star-sai-sudharsan-starts-new-season-with-half-century-in-tnpl-2023-781205.html","keywords":null,"creator":null,"video_url":null,"description":"गुजरात टाइटंस की टीम आईपीएल 2023 का खिताब जीतने में भले ही चूक गई हो, लेकिन टीम के कई खिलाड़ियों ने अपने प्रदर्शन से सभी को खासा प्रभावित किया। इन खिलाड़ियों की लिस्ट में युवा बल्लेबाज साईं सुदर्शन भी हैं। आईपीएल के बाद भी साईं सुदर्शन बल्ले से धमाल मचा रहे हैं।","content":"तमिलनाडु प्रीमियर लीग का आगाज लाइका कीवई किंग्स और आईड्रीम तिरुप्पुर तमिझंस के बीच खेले गए मैच के साथ किया गया। आईपीएल 2023 के फाइनल में तूफानी पारी खेलने वाले साईं सुदर्शन ने इस मुकाबले में मैच विनिंग पारी खेली। गुजरात टाइटंस के बल्लेबाज बी साई सुदर्शन ने आईपीएल फाइनल में चेन्नई सुपरकिंग्स के खिलाफ 47 गेंदों में 96 रन की शानदार पारी खेली थी। वह इस मैच में अपना शतक पूरा करने से सिर्फ चार रनों से चूक गए थे। अब लाइका कीवई किंग्स की तरफ से पहले मैच में उन्होंने अपने पुराने फॉर्म को बरकरार रखा है और टीम के लिए धांसू पारी खेलने का काम किया। आईड्रीम तिरुप्पुर तमिझंस ने इस मुकाबले में टॉस जीतकर लाइका कीवई किंग्स को पहले बल्लेबाजी का न्योता दिया। लाइका कीवई किंग्स की शुरुआत खराब रही और टीम ने महज 14 के स्कोर पर अपने तीन खिलाड़ियों का विकेट गंवा दिया। लेकिन इसके बाद साई सुदर्शन ने आकर जबरदस्त बल्लेबाजी कर टीम को मैच विनिंग स्कोर तक पहुंचाया। टीएनपीएल 2023 के शुरुआती मुकाबले में ही आईपीएल 2023 के फाइनल वाले अंदाज में बल्लेबाजी करते हुए साई सुदर्शन ने महज 45 गेंद में 86 रन जड़ दिए। साई सुदर्शन ने अपनी पारी के दौरान 8 चौके और 4 छक्के लगाने का काम किया। साई सुदर्शन की पारी की बदौलत लाइका कीवई किंग्स ने 20 ओवर में 7 विकेट खोकर 179 रन बनाए। जिसके जवाब में आईड्रीम तिरुप्पुर तमिझंस की टीम 109 के स्कोर पर ऑल आउट हो गई। बी सचिन, जे सुरेश कुमार (विकेटकीपर), साई सुदर्शन, राम अरविंद, यू मुकिलेश, शाहरुख खान (कप्तान), एम मोहम्मद, किरण आकाश, मणिमारन सिद्धार्थ, झटवेध सुब्रमण्यन, के गौतम थमराई कन्नन। बालचंदर अनिरुद्ध, एनएस चतुर्वेद, एस गणेश, विजय शंकर, राजेंद्रन विवेक, तुषार रहेजा (विकेटकीपर), पी भुवनेश्वरन, एस अजित राम, रविश्रीनिवासन साई किशोर (कप्तान), जी पेरियास्वामी, एस मणिगंदन।","pubDate":"2023-06-13 06:43:08","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WTC Final: ऑस्ट्रेलियाई दिग्गज ने फाइनल को लेकर रोहित शर्मा के बयान का किया समर्थन, कही ये बड़ी बात","link":"https://hindi.oneindia.com/news/sports/cricket/brad-hogg-agrees-with-rohit-sharma-s-statement-on-wtc-final-3-matches-series-781204.html","keywords":null,"creator":null,"video_url":null,"description":"ब्रैड हॉग ने टीम इंडिया के कप्तान रोहित शर्मा के उस बयान का समर्थन किया है, जिसमें उन्होंने कहा कि विश्व टेस्ट चैंपियनशिप (WTC) का फाइनल तीन मैचों का होना चाहिए। ब्रैड हॉग का कहना है कि वह रोहित शर्मा से सहमत हैं कि वर्ल्ड टेस्ट चैंपियनशिप का फाइनल तीन मैचों की सीरीज होनी चाहिए।","content":"पूर्व ऑस्ट्रेलियाई स्पिनर ब्रैड हॉग ने टीम इंडिया के कप्तान रोहित शर्मा के बयान का समर्थन किया है कि विश्व टेस्ट चैंपियनशिप (WTC) का फाइनल तीन मैचों का होना चाहिए। ब्रैड हॉग का कहना है कि वह रोहित शर्मा से सहमत हैं कि वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में तीन मैचों की सीरीज होनी चाहिए। विश्व टेस्ट चैंपियनशिप के फाइनल में भारत को ऑस्ट्रेलिया के हाथों हार का सामना करना पड़ा। इस टूर्नामेंट में भारत का टॉप ऑर्डर पूरी तरह से फ्लॉप साबित हुआ, जिसके कारण इंडिया को ट्रॉफी गंवानी पड़ी। इसके बाद कप्तान रोहित शर्मा समेत अन्य खिलाड़ियों को तीखी आलोचनाओं का सामना करना पड़ा। हॉग ने अपने यूट्यूब चैनल पर अपलोड किए गए वीडियो में कहा कि 'डब्ल्यूटीसी फाइनल के साथ-साथ टूर्नामेंट के लिए एक नया फॉर्मेट पेश करने के बारे में रोहित के विचारों से सहमत हैं। उन्होंने कहा कि, 'मैं रोहित शर्मा से सहमत हूं कि डब्ल्यूटीसी फाइनल तीन मैचों की सीरीज होनी चाहिए।' उन्होंने आगे कहा कि, 'इस बार यह एक मैच का फाइनल था, जोकि ऑस्ट्रेलिया ने अपने नाम किया। इसका क्रेडिट उन्हें मिलना चाहिए। मेरे हिसाब से चार-चार टीमों का दो डिवीजन होना चाहिए। डिवीजन वन में टॉप-4 टीमें और उसके बाद बाकी टीमें दूसरे डिवीजन का हिस्सा होनी चाहिए। एसोसिएट टीमें डिवीजन थ्री में हो सकती हैं।' वहीं ऑस्ट्रेलिया के कप्तान पैट कमिंस ने विश्व टेस्ट चैंपियनशिप फाइनल के अगले टूर्नामेंट में तीन मैचों की सीरीज खेलने की रोहित शर्मा की इच्छा पर अपनी असहमती जताई है। इसके अलावा दिग्गज सुनील गावस्कर ने भी इस तरह के सुझाव के लिए भारत के कप्तान की आलोचना की और कहा कि हर टीम को ऐसे बड़े आयोजनों को खेलने से पहले मानसिक रूप से तैयार रहना चाहिए। दरअसल, भारतीट टीम द ओवल में डब्ल्यूटीसी फाइनल में ऑस्ट्रेलिया के खिलाफ 209 रनों से हार गई। टीम जब 444 रनों का पीछा करने उतरी तो एक बार फिर टॉप ऑर्डर फ्लॉप साबित हुआ, जिसके चलते टीम 234 रनों पर ढेर हो गई, और टीम इंडिया के हाथ एक बार फिर सिर्फ निराशा लगी।","pubDate":"2023-06-13 06:42:39","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"}]}