{"newsArray":[{"article_id":"1bfe147699f437ef5ff39391f28bc8ea","title":"Johnson details reasons for explosive Warner takedown","link":"https://thewest.com.au/sport/cricket/johnson-details-reasons-for-explosive-warner-takedown-c-12789942","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Mitchell Johnson admits he has fallen out with his former Australia teammates David Warner and George Bailey over his explosive cricket columns.","content":"There was a personal side to Mitchell Johnson's extraordinary attack on former Australia teammate David Warner's farewell Test series, the former champion quick admits. Johnson has explained why he blasted Warner and chairman of selectors George Bailey in an explosive column in The West Australian. The former bowler concedes his relationship with Warner and fellow former teammate Bailey was already damaged but insists that was not solely why he wrote the article. \"People have touched on it, (that) there seems to be a personal side to it, which there is as well,\" the 42-year-old said on his Mitchell Johnson Cricket Show podcast with broadcaster Bharat Sundaresan. \"But when I've written my articles, I've always tried to do it in a way that I can back things up ... it is my opinion, it is only an opinion piece. \"This one was a difficult one to do ... when I wrote it, I knew it was probably going to get a bit of attention.\" Sydneysider Warner has expressed a desire to finish his red-ball career at home when Australia face Pakistan at the SCG in the third and final Test of this summer's series. He and Johnson played together for Australia for more than five years, including in the 2013-14 Ashes whitewash and 2015's ODI World Cup victory. Johnson said he received a \"quite personal\" response to a column he wrote after Warner's wife Candice defended her husband's position in the Test team on Fox Sport's program, The Back Page. \"I tried to ring (Warner) to talk to him about it, which I've always been open about with the guys,\" Johnson said. \"It was never a personal thing then. Until that point. \"That is what prompted me to write the article, or part of it, as well. It's definitely a factor. \"Some of the things that he mentioned in that message, I won't say it because that's up to Dave to say if he wants to talk about it, (but) there was some stuff in there, which was extremely disappointing ... and pretty bad to be honest.\" Johnson said he had received strong feedback from Bailey after publishing an article about emerging Western Australia quick Lance Morris. In a press conference on Sunday, Bailey responded to Johnson's latest column, saying, \"I've been sent little snippets of it - I hope he's OK\". Johnson took exception to Bailey's remarks. The former left-arm tearaway has previously been open about his mental-health challenges. \"I'm fine. I'm not angry. I'm not jealous. I'm just writing a piece that I felt I needed to write,\" Johnson said. \"It's basically having a dig at someone's mental health and saying that I must have something going on, (that) a mental-health issue has made me say what I've said. \"It sort of tries to downplay the questions that I've asked in that article ... It seems very childish from George, and condescending.'' Warner has yet to acknowledge Johnson's scathing criticism but the opener's manager James Erskine described the 73-Test bowling star \"ignorant\" and a \"backseat driver\". \"If he basically thinks three people did sandpaper-gate, then he should go to the moon for a holiday. I mean, it's just a joke,\" Erskine told SEN on Monday.","pubDate":"2023-12-05 00:01:29","image_url":"https://images.thewest.com.au/publication/C-12789942/ff276ca1cd91cd79ade05e7bdb940a06d28c3a8f-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"3427cd1012bad6f482ffb6e62a000885","title":"Southern Districts look to start new year strongly in Bradman Cup","link":"https://www.goulburnpost.com.au/story/8428468/southern-districts-look-to-start-new-year-strongly-in-bradman-cup/?src=rss","keywords":null,"creator":["Burney Wong"],"video_url":null,"description":"Young cricketers from the Southern Tablelands and the Highlands have been taking on the state's best players.","content":"Cricket ball and bails. File picture. Young cricketers from the Southern Tablelands and the Highlands have been taking on the state's best players, but it's been a struggle. Three games into Country Cricket NSW's Bradman Cup competition, the Southern Districts are still winless, but they'll have a chance to regroup before taking on Newcastle in the new year. Their first match was a rain affected loss to the Western region. READ ALSO: Legendary singer-songwriter James Taylor to play in Bowral $100k a sweet reward for Highlands Dessert Master Where you can mail your letters to Santa in the Highlands Winning the toss and batting first, Southern Districts only managed to put 94 runs on board, with vice captain Issac Roxburgh top scoring with 30 runs. Mikah Millar took two wickets in the second innings but it wasn't enough to get his side across the line via the DLS method. The second match saw Southern Districts bowl first and get beaten comprehensively by Riverina which made 162 runs in their 20 overs. Southern Districts never stood a chance chasing as wickets continually fell and they ended up being bowled out for just 42 runs. Their final game of the year was a one day match against Riverina and they put up yet another disappointing batting performance. After being put in to bowl first, Southern Districts captain Samuel McGregor led from the front by taking four wickets off his nine overs, but Riverina were still able to put up a strong total of 310 runs off their 50 overs. Heading into the second innings, the batting side was optimistic but found themselves on the backfoot after losing their openers cheaply. Just like their opening match, Isaac top scored, this time with 46 runs, but it wasn't enough to get his side across the line. The 151 run loss put the Southern Districts at the bottom of the ladder heading into the new year. Did you know the Southern Highland News is now offering breaking news alerts and a weekly email newsletter? Keep up-to-date with all the local news: sign up below. Share Facebook Twitter Whatsapp Email Copy Burney Wong Journalist I love sport. You can reach me at burney.wong@austcommunitymedia.com.au or on 0437 291 518. I love sport. You can reach me at burney.wong@austcommunitymedia.com.au or on 0437 291 518. More from Latest News Battling borrowers bank on pre-Christmas rates relief 7m ago Goulburn Regional Art Gallery hosts Archibald prizes as part of tour 9m ago Late payment repeat offenders to be named and shamed 20m ago Life's no beach as funding knockback shrinks photo fest 27m ago More from Latest News Battling borrowers bank on pre-Christmas rates relief 7m ago Goulburn Regional Art Gallery hosts Archibald prizes as part of tour 9m ago Late payment repeat offenders to be named and shamed 20m ago Life's no beach as funding knockback shrinks photo fest 27m ago Andrew O'Keefe pleads guilty to drug-driving 44m ago Council experiences phone drop outs 49m ago More from Latest News Battling borrowers bank on pre-Christmas rates relief 7m ago Goulburn Regional Art Gallery hosts Archibald prizes as part of tour 9m ago Late payment repeat offenders to be named and shamed 20m ago Life's no beach as funding knockback shrinks photo fest 27m ago Andrew O'Keefe pleads guilty to drug-driving 44m ago Council experiences phone drop outs 49m ago","pubDate":"2023-12-05 00:00:00","image_url":"https://www.goulburnpost.com.au/images/transform/v1/crop/frm/Xn3KP2xbyFBWgTmsCMnW6P/7a27b78c-b159-4b6b-8e7e-fba489ec90fb.jpg/r88_105_940_585_w600_h338_fmax.jpg","source_id":"goulburnpost","source_priority":1442959,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"19fd738c183acaab56f44c693c17ebb8","title":"Amazon Prime secures rights to all ICC events, but Australian summer still live and free on Seven","link":"https://7news.com.au/sport/cricket/amazon-prime-secures-rights-to-all-icc-events-but-australian-summer-still-live-and-free-on-seven-c-12788301","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia’s international teams will play behind a paywall when the landmark new deal kicks in.","content":"Australia’s World Test Championship and defences will be shown exclusively on Amazon Prime Video. The streaming platform has secured the broadcast rights in Australia for all men’s and women’s International Cricket Council (ICC) tournaments. , but Foxtel/Kayo broadcast the entire recent Cricket World Cup, while Nine screened Australia’s overseas games and some other major matches this year. The Amazon move comes just days after the federal government reaffirmed its commitment to sport anti-siphoning measures. Communications minister Michelle Rowland last week introduced laws to parliament updating anti-siphoning measures that would require free-to-air services to be offered first refusal for important sporting events. “All Australians regardless of where they live, or what they earn, should have the opportunity to enjoy free TV coverage of iconic sporting events,” Rowland said. But ICC boss Geoff Allardice welcomed the partnership with Amazon, which brings with it a paywall. “We are very excited to be entering a new four-year partnership with Prime Video for ICC cricket rights in Australia,” he said in a statement. “The recently concluded men’s World Cup has highlighted the interest and passion for ICC events across the globe, and especially in Australia where cricket fans have enjoyed the recent success of their men’s and women’s teams. “We look forward to working with Prime Video Australia to provide an innovative coverage of world class cricket to more fans in Australia.” The new partnership between the ICC and Amazon will begin in January. “Over the next four years, Prime members in Australia will be able to watch their favourite cricket teams and players compete for the game’s biggest prize, on demand, on the device of their choice — exclusively on Prime Video,” Prime Video Australia and New Zealand boss Hushidar Kharas said.","pubDate":"2023-12-04 23:49:09","image_url":"https://images.7news.com.au/publication/C-12788301/19f737008efe6ca89c481fd2ec6d224e6aac3c32-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0cd31d463058cdca21518c70164907cd","title":"Usman Khawaja defends David Warner after Mitchell Johnson’s attack on Australian batter","link":"https://www.nzherald.co.nz/sport/cricket/usman-khawaja-defends-david-warner-after-mitchell-johnsons-attack-on-australian-batter/EUMS3C2JXZF3PPXCZVBDQTQBEE/","keywords":null,"creator":["Joel Gould and Oliver Caffrey"],"video_url":null,"description":"The former quick says Warner doesn't deserve to have a farewell send-off.","content":"Usman Khawaja has fired back at Mitchell Johnson’s criticism of test teammate David Warner , declaring his opening partner is “a hero” who has paid his dues for the Sandpaper-gate scandal. Former fast bowler Johnson said his old teammate Warner did not deserve to be given a farewell in the third test of the summer series against Pakistan. Johnson said Warner had not taken full responsibility for his role in the Sandpaper-gate affair in South Africa in 2018 that earned him a 12-month ban. He questioned “why a player at the centre of one of the biggest scandals in Australian cricket history warrants a hero’s send-off”. Khawaja said he “strongly disagreed” with Johnson’s column in the West Australian newspaper, adding Warner and former skipper Steve Smith, who was also banned for a year, had paid for their mistakes. “Davey Warner and Steve Smith are heroes in my mind,” Khawaja said. “They missed a year of cricket through dark times in Australian cricket but they have paid their dues. “No one is perfect. Mitchell Johnson isn’t perfect. I am not perfect. Steve Smith is not perfect. David Warner isn’t perfect. “What they have done for the game and to grow the game far outweighs anything else they have done. “So for (Johnson) to imply that Dave Warner or anyone else involved in Sandpaper-(gate) is not a hero I strongly disagree with because I believe they have paid their dues.” Warner is yet to respond to the explosive remarks but his manager James Erskine has called Johnson “ignorant”. “This reminds me of backseat drivers, they’re bloody annoying, and quite frankly, we don’t need it,” Erskine told SEN. “He (Johnson) is basically making comments that I think are incendiary. “Come up with an alternative solution, pal. “If he thinks basically thinks three people did Sandpaper-gate, then he should go to the moon for holiday. I mean, it’s just a joke.” Khawaja also disagreed with Johnson’s comments about chairman of selectors George Bailey being too close to Warner. He said Bailey had brought a “breath of fresh air” to the role. Under Bailey’s chairmanship, Australia have won the 2021-22 Ashes and retained them in 2023, and have been victorious in the 2021 T20 World Cup, this year’s World Test Championship and ODI World Cup. “‘I’m not sure you can argue with that. (The criticism) is harsh,” Khawaja said. Khawaja also praised the influence of Andrew McDonald, although he did respond to the coach’ floating Marnus Labuschagne as an option to replace Warner as an opener in the Test team. “Have you asked Marnus this? I think he would give you a really clear, ‘hell no’,” Khawaja said. “Marnus has got opening-itis. I am pretty sure Davey Warner hurt his arm and sent Alex Carey out to open. I think that is a long shot.” Khawaja said he had no preference about who got the gig but made the point it should be a regular opener. Cameron Bancroft, Matt Renshaw and Marcus Harris are all in contention. “Opening is not easy. I can tell you that because I have batted No.1, 2, 3, 4, 5 and 6 for Australia and opening is by far the hardest,” Khawaja said. “It is very hard to bring somewhere up there that hasn’t opened. “I am positive if you put Marnus up there he would do very well but would he do as well as he does at No.3?” - AAP","pubDate":"2023-12-04 23:40:00","image_url":"https://www.nzherald.co.nz/resizer/pCqwcrrL5cchEf03eu2lMRB3yr8=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/CYIAM2TSU5D6JPMG4B3Z2HQ26Q.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"63e8956179e1e34318d6a5bb820ecbd8","title":"Live updates: White Ferns vs Pakistan, second Twenty20","link":"https://www.nzherald.co.nz/sport/cricket/live-updates-white-ferns-vs-pakistan-second-twenty20/3YXNTZAHJBFJZON52FXBB4YBIU/","keywords":null,"creator":null,"video_url":null,"description":"The White Ferns look to bounce back after the opening defeat to Pakistan.","content":"Live updates of the second Twenty20 between the White Ferns and Pakistan. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-12-04 23:37:57","image_url":"https://www.nzherald.co.nz/resizer/M7Z2uHle7mR0fnpC2xosotPCJhw=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/VO4FYOA72ZDNVJLV3NHRSRACIY.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"f66bcef2b526004c3a00efb3cdad34de","title":"How to Watch NZ-W vs PAK-W, 2nd T20I 2023 Live Streaming Online? Get Telecast Details of New Zealand Women vs Pakistan Women Cricket Match With Time in IST","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-nz-w-vs-pak-w-2nd-t20i-2023-live-streaming-online-get-telecast-details-of-new-zealand-women-vs-pakistan-women-cricket-match-with-time-in-ist-5607257.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Women clinched victory against the white ferns in the first match by seven wickets. Scroll down to get live streaming and telecast details.","content":"New Zealand women's team are currently engaged with their counterparts from Pakistan in the second of a three-match T20I series, on December 5. The second T20I between these two teams will be played at the University Oval in Dunedin and it starts at 5:30 am IST (Indian Standard Time). Amazon Prime Video has the rights to broadcast international cricket matches in New Zealand. Fans in India can watch the NZ-W vs PAK-W live streaming online on the Amazon Prime Video app. The live telecast of the New Zealand Women vs Pakistan Women 2nd T20I will not be available. it’s game on! 🏏 watch Women’s 2nd T20I, LIVE and exclusive only on Prime Video! — prime video IN (@PrimeVideoIN)","pubDate":"2023-12-04 23:30:04","image_url":"https://st1.latestly.com/wp-content/uploads/2023/12/Pakistan-Women-380x214.jpg","source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"54309a05c2750779fdcbd968bc5a3de5","title":"Golf internet sensation Mac Boucher rounds off Chasing the Fox field","link":"https://www.nzherald.co.nz/sport/golf-internet-sensation-mac-boucher-rounds-off-chasing-the-fox-field/PG4T3PLGBZBV5LORGUGYUWUSMM/","keywords":null,"creator":null,"video_url":null,"description":"Golf Instagram sensation Mac Boucher will play alongside two Kiwi greats.","content":"Golf Instagram sensation Mac Boucher has rounded out the field for the second Chasing the Fox event at Royal Auckland and Grange Golf Club next week. The Canadian has more than 330,000 followers on Instagram and has attracted almost four million likes on TikTok making him the most popular golfer from his country. He’s been touring New Zealand courses over the last week, sharing videos of his unique slinging shots as he tries to reach a scratch handicap playing both left and right-handed. The event takes place on December 14 and is a short format, teams contest where golfers get to take on world number 28 Ryan Fox. Fox had another stellar season, winning the BMW Championship in September, and finished fifth on the DP Tour season standings. All Blacks Anton Leinert-Brown, Damien McKenzie and Will Jordan will make up Team Rugby, coming off the back of a superb showing at the Rugby World Cup where they were edged in the final by the Springboks. Jordan finished the tournament as top try scorer. On Team Cricket, Mitchell Santner and Lockie Ferguson will be joined on the tee by Black Caps great Ross Taylor. Act leader David Seymour, Sir John Key and Max Key will make up the Politicians team while two-time Olympic champion Eric Murray, Black Sticks great Simon Child and surfer Billy Stairmand are in the Olympians team. Last year Sir John Key sunk an ace at the par three eighth at the Middlemore course before he was mobbed with hugs, high-fives and handshakes moments after pulling off the rare feat. He was given a guard of honour set up by fellow players on the green, leading towards the hole. Warriors duo Shaun Johnson and Wayde Egan will be joined by club great Awen Guttenbeil while Team Legends include comedian Mike King, chef Josh Emett and Boucher. Meanwhile, 12-year-old schoolboy, Bayleigh Teepa-Tarau will caddie for Fox . Teepa-Tarau, who has autism, is from a small rural town in the Bay of Plenty and caused a seismic shock-wave in New Zealand’s golfing scene by winning a national title at the Aims Games after only having played three rounds of golf in his life. A group of Royal Auckland and Grange members which includes former All Blacks coach John Hart and rugby great Grant Fox are funding the trip for Bayleigh and his family to attend the event and experience the day. Chasing the Fox this year is partnering up with I Am Hope as the charity partner.","pubDate":"2023-12-04 23:15:47","image_url":"https://www.nzherald.co.nz/resizer/t8rcRcm1w7lRCgi7vtnKZtE53u8=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/QAZW5LUNPFBNXMWVOULI5XHC3U.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"61bccc11828ee407811f9bfbf16fb13f","title":"New Zealand eye comeback final Test win in Bangladesh","link":"https://www.thehindu.com/sport/cricket/new-zealand-eye-comeback-final-test-win-in-bangladesh/article67605401.ece","keywords":["Cricket"],"creator":null,"video_url":null,"description":"The Kiwis, who started their long season with a tour to Pakistan in April, have also played series in Britain, Bangladesh and the United Arab Emirates, before playing in the World Cup in India","content":"New Zealand leg spinner Ish Sodhi said his side hoped to finish their long season away from home on a high by beating Bangladesh in the upcoming second Test. \"It's been a really, really long time away,\" Sodhi told reporters in Dhaka. \"It's been a really successful last six or so months for the team, but it can come with a lot of emotions\". The Kiwis, who started their long season with a tour to Pakistan in April, have also played series in Britain, Bangladesh and the United Arab Emirates, before playing in the World Cup in India, a time Sodhi described as emotional \"rollercoasters\". The Kiwis are trailing Bangladesh 0-1 in the two-Test series after their 150-run defeat in the opening Test in Sylhet. The second Test in Dhaka begins on Wednesday. \"It'll be really nice to finish on a high,\" he said. \"I think the boys are super motivated. Hopefully, we'll get some treats here before we leave, and then we can go and smell that beer. It's going to be beautiful New Zealand air pretty soon.\" New Zealand's defeat in Sylhet was their first Test defeat in Bangladesh and only second against the side. But Sodhi said they had learned lessons they would use in the final match. \"I think the way Bangladesh played, they certainly outplayed us,\" he said. \"But, upon reflection, I think they gave us a blueprint on what is successful in these conditions, and hopefully we can apply that to this next Test match.\" The Kiwis have not won a Test in Bangladesh since their three-wicket win in Chittagong in 2008. Their next three Tests ended in a draw, before the side slumped to defeat in the opening Test of the series. New Zealand, however, defeated Bangladesh 2-0 in the ODI leg of the tour before the World Cup to end their 15-year wait for a series victory in the country. COMMents SHARE Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit cricket / New Zealand","pubDate":"2023-12-04 23:11:00","image_url":"https://th-i.thgim.com/public/incoming/9u36u1/article67605434.ece/alternates/LANDSCAPE_1200/Bangladesh_New_Zealand_Cricket_71006.jpg","source_id":"thehindu","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7ef5f377cedc86f70af8b7b5d8a0049b","title":"The text messages that fuelled Mitchell Johnson’s explosive Warner column","link":"https://www.theage.com.au/sport/cricket/the-text-messages-that-fuelled-mitchell-johnson-s-explosive-warner-column-20231205-p5ep18.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"Mitchell Johnson has revealed text messages he received from David Warner and George Bailey fuelled his fiery column that has set cricket tongues wagging.","content":"Mitchell Johnson has revealed a pair of text exchanges with David Warner and George Bailey fuelled his fiery column questioning the pair , though he now admits to some regret about the personal tone of the piece. Warner messaged Johnson after a public exchange earlier this year between the former fast bowler and Candice Warner around the opening batter’s place in the Ashes team. Mitchell Johnson and David Warner in happier times. Credit: Reuters Bailey, more recently, contacted Johnson from India to express displeasure at an earlier opinion piece stating that Cricket Australia should stop asking the young fast bowler Lance Morris to rest from games. In his regular podcast, The Mitchell Johnson Show , with journalist Bharat Sundaresan, Johnson also took issue with Bailey publicly questioning if he was “OK”. Bailey made that comment on Sunday when he was announcing the Australian Test squad and was asked about Johnson’s column for The West Australian . “No, I’m not angry. I’m OK. Just want to make sure that everyone knows that I’m OK, and I’m in a good headspace,” Johnson told Sundaresan. “That’s another point which was really disappointing. To ask if I’m OK [by George Bailey] because I’ve had mental health issues is pretty much downplaying my article and putting it on mental health, which is quite disgusting, I think. I’m fine. I’m not angry. I’m not jealous. “It’s basically having a dig at someone’s mental health and saying that I must have something going on, a mental health issue, has made me say what I’ve said. That’s not the truth. That’s completely the opposite. I’m actually clear-minded. “It’s based on my interactions that I’ve had with him in recent times. It sort of tries to downplay the questions that I’ve asked in that article. And to say that I’m not allowed to have an opinion, that’s what it feels like. It seems very childish from George and condescending. “I’m just writing a piece that, for me, I felt like I needed to write. There was that personal aspect to it. But mostly I’ve tried to write things that is backed up by performances and question why players are picked when you hear about players should be picked on form, and he’s not being picked.” A Cricket Australia spokesperson said categorically that Bailey’s comments about Johnson were not any reference to his mental health. Australia’s Mitchell Johnson, left, Michael Clarke, second from left, and David Warner, third from left, celebrate the wicket of England’s Stuart Broad in 2013. Credit: AP Johnson explained the back and forth with Warner earlier in 2023 and Bailey during the World Cup in India. “It was around the time that Candice had said on the [TV program The ] Back Page about there not being openers good enough to take his position. That’s when I responded to that,” Johnson said. “And I got a message from Dave, which was quite personal, and I tried to ring him to talk to him about it, which I’ve always been open about with the guys. “When I finished playing, I said when I’m in the media, if I’m saying things or writing things that you guys don’t like, just come and speak to me. It was never a personal thing then. Until that point. That is what prompted me to write the article or part of it as well. It’s definitely a factor. Some of the things that he mentioned in that message. I won’t say it because that’s up to Dave to say if he wants to talk about it. There was some stuff in there, which was extremely disappointing what he said, and pretty bad, to be honest. That sort of was a bit of a driver. “And a bit with George as well. He’d sent me a message after the Lance Morris article. It was just a bit condescending. Typical George sort of stuff. When you receive it at odd hours in the morning, it was disappointing.” That being said, Johnson explained that he was still relatively new to writing opinion pieces, and would reconsider his tone in future. “I think, in general, the tone of my articles have been fair apart from this one,” Johnson said. “The rest have been fine. Even the one that I had written about what Candice had said on The Back Page , I still wrote a lot of good things about David and his career. I was only bringing up the point of his performances and also players who should have an opportunity. I feel like that’s fair. “It does make me think with this one that it probably wasn’t the right tone. But those are the things that you learn. You’re allowed to make, I guess, like Davey made that mistake, I guess, well, but this is not a mistake. No, I don’t think it’s a mistake. It’s just me thinking about the tone in which I’ve gone with here. “I’ve never made any of my other articles personal. I definitely feel the difference with this one. It comes from a place where I think I had to go that way.” Johnson also reflected on how he had to differentiate between friends he played cricket with and acquaintances from his time in the national team. Johnson will see his former teammates in Perth when he commentates on the first Test for Triple M. “It’s just about finding out that you’ve got your mates, and then you had acquaintances with whom you played a sport,” he said. “You always had each other’s backs on the training paddock, but then it’s just about differentiating those relationships. “It is sad when it gets to this, though. I’m not a person who likes that confrontation. Even if it looked like that on TV. That’s not me. It really is hard to go down this path. It is what it is. It’s done. I’ve taken ownership of it. It is difficult to write pieces. It’s out there and it’s public. You’re putting yourself out there in the open to cop the criticism.” Both Bailey and Warner declined to comment. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-04 23:05:34","image_url":null,"source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f809ec9a1d63ad5dbe345f80de62aea6","title":"The text messages that fuelled Mitchell Johnson’s explosive Warner column","link":"https://www.smh.com.au/sport/cricket/the-text-messages-that-fuelled-mitchell-johnson-s-explosive-warner-column-20231205-p5ep18.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"Mitchell Johnson has revealed text messages he received from David Warner and George Bailey fuelled his fiery column that has set cricket tongues wagging.","content":"Mitchell Johnson has revealed a pair of text exchanges with David Warner and George Bailey fuelled his fiery column questioning the pair , though he now admits to some regret about the personal tone of the piece. Warner messaged Johnson after a public exchange earlier this year between the former fast bowler and Candice Warner around the opening batter’s place in the Ashes team. Mitchell Johnson and David Warner in happier times. Credit: Reuters Bailey, more recently, contacted Johnson from India to express displeasure at an earlier opinion piece stating that Cricket Australia should stop asking the young fast bowler Lance Morris to rest from games. In his regular podcast, The Mitchell Johnson Show , with journalist Bharat Sundaresan, Johnson also took issue with Bailey publicly questioning if he was “OK”. Bailey made that comment on Sunday when he was announcing the Australian Test squad and was asked about Johnson’s column for The West Australian . “No, I’m not angry. I’m OK. Just want to make sure that everyone knows that I’m OK, and I’m in a good headspace,” Johnson told Sundaresan. “That’s another point which was really disappointing. To ask if I’m OK [by George Bailey] because I’ve had mental health issues is pretty much downplaying my article and putting it on mental health, which is quite disgusting, I think. I’m fine. I’m not angry. I’m not jealous. “It’s basically having a dig at someone’s mental health and saying that I must have something going on, a mental health issue, has made me say what I’ve said. That’s not the truth. That’s completely the opposite. I’m actually clear-minded. “It’s based on my interactions that I’ve had with him in recent times. It sort of tries to downplay the questions that I’ve asked in that article. And to say that I’m not allowed to have an opinion, that’s what it feels like. It seems very childish from George and condescending. “I’m just writing a piece that, for me, I felt like I needed to write. There was that personal aspect to it. But mostly I’ve tried to write things that is backed up by performances and question why players are picked when you hear about players should be picked on form, and he’s not being picked.” A Cricket Australia spokesperson said categorically that Bailey’s comments about Johnson were not any reference to his mental health. Australia’s Mitchell Johnson, left, Michael Clarke, second from left, and David Warner, third from left, celebrate the wicket of England’s Stuart Broad in 2013. Credit: AP Johnson explained the back and forth with Warner earlier in 2023 and Bailey during the World Cup in India. “It was around the time that Candice had said on the [TV program The ] Back Page about there not being openers good enough to take his position. That’s when I responded to that,” Johnson said. “And I got a message from Dave, which was quite personal, and I tried to ring him to talk to him about it, which I’ve always been open about with the guys. “When I finished playing, I said when I’m in the media, if I’m saying things or writing things that you guys don’t like, just come and speak to me. It was never a personal thing then. Until that point. That is what prompted me to write the article or part of it as well. It’s definitely a factor. Some of the things that he mentioned in that message. I won’t say it because that’s up to Dave to say if he wants to talk about it. There was some stuff in there, which was extremely disappointing what he said, and pretty bad, to be honest. That sort of was a bit of a driver. “And a bit with George as well. He’d sent me a message after the Lance Morris article. It was just a bit condescending. Typical George sort of stuff. When you receive it at odd hours in the morning, it was disappointing.” That being said, Johnson explained that he was still relatively new to writing opinion pieces, and would reconsider his tone in future. “I think, in general, the tone of my articles have been fair apart from this one,” Johnson said. “The rest have been fine. Even the one that I had written about what Candice had said on The Back Page , I still wrote a lot of good things about David and his career. I was only bringing up the point of his performances and also players who should have an opportunity. I feel like that’s fair. “It does make me think with this one that it probably wasn’t the right tone. But those are the things that you learn. You’re allowed to make, I guess, like Davey made that mistake, I guess, well, but this is not a mistake. No, I don’t think it’s a mistake. It’s just me thinking about the tone in which I’ve gone with here. “I’ve never made any of my other articles personal. I definitely feel the difference with this one. It comes from a place where I think I had to go that way.” Johnson also reflected on how he had to differentiate between friends he played cricket with and acquaintances from his time in the national team. Johnson will see his former teammates in Perth when he commentates on the first Test for Triple M. “It’s just about finding out that you’ve got your mates, and then you had acquaintances with whom you played a sport,” he said. “You always had each other’s backs on the training paddock, but then it’s just about differentiating those relationships. “It is sad when it gets to this, though. I’m not a person who likes that confrontation. Even if it looked like that on TV. That’s not me. It really is hard to go down this path. It is what it is. It’s done. I’ve taken ownership of it. It is difficult to write pieces. It’s out there and it’s public. You’re putting yourself out there in the open to cop the criticism.” Both Bailey and Warner declined to comment. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-04 23:05:34","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"1bfe147699f437ef5ff39391f28bc8ea","title":"Johnson details reasons for explosive Warner takedown","link":"https://thewest.com.au/sport/cricket/johnson-details-reasons-for-explosive-warner-takedown-c-12789942","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Mitchell Johnson admits he has fallen out with his former Australia teammates David Warner and George Bailey over his explosive cricket columns.","content":"There was a personal side to Mitchell Johnson's extraordinary attack on former Australia teammate David Warner's farewell Test series, the former champion quick admits. Johnson has explained why he blasted Warner and chairman of selectors George Bailey in an explosive column in The West Australian. The former bowler concedes his relationship with Warner and fellow former teammate Bailey was already damaged but insists that was not solely why he wrote the article. \"People have touched on it, (that) there seems to be a personal side to it, which there is as well,\" the 42-year-old said on his Mitchell Johnson Cricket Show podcast with broadcaster Bharat Sundaresan. \"But when I've written my articles, I've always tried to do it in a way that I can back things up ... it is my opinion, it is only an opinion piece. \"This one was a difficult one to do ... when I wrote it, I knew it was probably going to get a bit of attention.\" Sydneysider Warner has expressed a desire to finish his red-ball career at home when Australia face Pakistan at the SCG in the third and final Test of this summer's series. He and Johnson played together for Australia for more than five years, including in the 2013-14 Ashes whitewash and 2015's ODI World Cup victory. Johnson said he received a \"quite personal\" response to a column he wrote after Warner's wife Candice defended her husband's position in the Test team on Fox Sport's program, The Back Page. \"I tried to ring (Warner) to talk to him about it, which I've always been open about with the guys,\" Johnson said. \"It was never a personal thing then. Until that point. \"That is what prompted me to write the article, or part of it, as well. It's definitely a factor. \"Some of the things that he mentioned in that message, I won't say it because that's up to Dave to say if he wants to talk about it, (but) there was some stuff in there, which was extremely disappointing ... and pretty bad to be honest.\" Johnson said he had received strong feedback from Bailey after publishing an article about emerging Western Australia quick Lance Morris. In a press conference on Sunday, Bailey responded to Johnson's latest column, saying, \"I've been sent little snippets of it - I hope he's OK\". Johnson took exception to Bailey's remarks. The former left-arm tearaway has previously been open about his mental-health challenges. \"I'm fine. I'm not angry. I'm not jealous. I'm just writing a piece that I felt I needed to write,\" Johnson said. \"It's basically having a dig at someone's mental health and saying that I must have something going on, (that) a mental-health issue has made me say what I've said. \"It sort of tries to downplay the questions that I've asked in that article ... It seems very childish from George, and condescending.'' Warner has yet to acknowledge Johnson's scathing criticism but the opener's manager James Erskine described the 73-Test bowling star \"ignorant\" and a \"backseat driver\". \"If he basically thinks three people did sandpaper-gate, then he should go to the moon for a holiday. I mean, it's just a joke,\" Erskine told SEN on Monday.","pubDate":"2023-12-05 00:01:29","image_url":"https://images.thewest.com.au/publication/C-12789942/ff276ca1cd91cd79ade05e7bdb940a06d28c3a8f-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"3427cd1012bad6f482ffb6e62a000885","title":"Southern Districts look to start new year strongly in Bradman Cup","link":"https://www.goulburnpost.com.au/story/8428468/southern-districts-look-to-start-new-year-strongly-in-bradman-cup/?src=rss","keywords":null,"creator":["Burney Wong"],"video_url":null,"description":"Young cricketers from the Southern Tablelands and the Highlands have been taking on the state's best players.","content":"Cricket ball and bails. File picture. Young cricketers from the Southern Tablelands and the Highlands have been taking on the state's best players, but it's been a struggle. Three games into Country Cricket NSW's Bradman Cup competition, the Southern Districts are still winless, but they'll have a chance to regroup before taking on Newcastle in the new year. Their first match was a rain affected loss to the Western region. READ ALSO: Legendary singer-songwriter James Taylor to play in Bowral $100k a sweet reward for Highlands Dessert Master Where you can mail your letters to Santa in the Highlands Winning the toss and batting first, Southern Districts only managed to put 94 runs on board, with vice captain Issac Roxburgh top scoring with 30 runs. Mikah Millar took two wickets in the second innings but it wasn't enough to get his side across the line via the DLS method. The second match saw Southern Districts bowl first and get beaten comprehensively by Riverina which made 162 runs in their 20 overs. Southern Districts never stood a chance chasing as wickets continually fell and they ended up being bowled out for just 42 runs. Their final game of the year was a one day match against Riverina and they put up yet another disappointing batting performance. After being put in to bowl first, Southern Districts captain Samuel McGregor led from the front by taking four wickets off his nine overs, but Riverina were still able to put up a strong total of 310 runs off their 50 overs. Heading into the second innings, the batting side was optimistic but found themselves on the backfoot after losing their openers cheaply. Just like their opening match, Isaac top scored, this time with 46 runs, but it wasn't enough to get his side across the line. The 151 run loss put the Southern Districts at the bottom of the ladder heading into the new year. Did you know the Southern Highland News is now offering breaking news alerts and a weekly email newsletter? Keep up-to-date with all the local news: sign up below. Share Facebook Twitter Whatsapp Email Copy Burney Wong Journalist I love sport. You can reach me at burney.wong@austcommunitymedia.com.au or on 0437 291 518. I love sport. You can reach me at burney.wong@austcommunitymedia.com.au or on 0437 291 518. More from Latest News Battling borrowers bank on pre-Christmas rates relief 7m ago Goulburn Regional Art Gallery hosts Archibald prizes as part of tour 9m ago Late payment repeat offenders to be named and shamed 20m ago Life's no beach as funding knockback shrinks photo fest 27m ago More from Latest News Battling borrowers bank on pre-Christmas rates relief 7m ago Goulburn Regional Art Gallery hosts Archibald prizes as part of tour 9m ago Late payment repeat offenders to be named and shamed 20m ago Life's no beach as funding knockback shrinks photo fest 27m ago Andrew O'Keefe pleads guilty to drug-driving 44m ago Council experiences phone drop outs 49m ago More from Latest News Battling borrowers bank on pre-Christmas rates relief 7m ago Goulburn Regional Art Gallery hosts Archibald prizes as part of tour 9m ago Late payment repeat offenders to be named and shamed 20m ago Life's no beach as funding knockback shrinks photo fest 27m ago Andrew O'Keefe pleads guilty to drug-driving 44m ago Council experiences phone drop outs 49m ago","pubDate":"2023-12-05 00:00:00","image_url":"https://www.goulburnpost.com.au/images/transform/v1/crop/frm/Xn3KP2xbyFBWgTmsCMnW6P/7a27b78c-b159-4b6b-8e7e-fba489ec90fb.jpg/r88_105_940_585_w600_h338_fmax.jpg","source_id":"goulburnpost","source_priority":1442959,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"19fd738c183acaab56f44c693c17ebb8","title":"Amazon Prime secures rights to all ICC events, but Australian summer still live and free on Seven","link":"https://7news.com.au/sport/cricket/amazon-prime-secures-rights-to-all-icc-events-but-australian-summer-still-live-and-free-on-seven-c-12788301","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia’s international teams will play behind a paywall when the landmark new deal kicks in.","content":"Australia’s World Test Championship and defences will be shown exclusively on Amazon Prime Video. The streaming platform has secured the broadcast rights in Australia for all men’s and women’s International Cricket Council (ICC) tournaments. , but Foxtel/Kayo broadcast the entire recent Cricket World Cup, while Nine screened Australia’s overseas games and some other major matches this year. The Amazon move comes just days after the federal government reaffirmed its commitment to sport anti-siphoning measures. Communications minister Michelle Rowland last week introduced laws to parliament updating anti-siphoning measures that would require free-to-air services to be offered first refusal for important sporting events. “All Australians regardless of where they live, or what they earn, should have the opportunity to enjoy free TV coverage of iconic sporting events,” Rowland said. But ICC boss Geoff Allardice welcomed the partnership with Amazon, which brings with it a paywall. “We are very excited to be entering a new four-year partnership with Prime Video for ICC cricket rights in Australia,” he said in a statement. “The recently concluded men’s World Cup has highlighted the interest and passion for ICC events across the globe, and especially in Australia where cricket fans have enjoyed the recent success of their men’s and women’s teams. “We look forward to working with Prime Video Australia to provide an innovative coverage of world class cricket to more fans in Australia.” The new partnership between the ICC and Amazon will begin in January. “Over the next four years, Prime members in Australia will be able to watch their favourite cricket teams and players compete for the game’s biggest prize, on demand, on the device of their choice — exclusively on Prime Video,” Prime Video Australia and New Zealand boss Hushidar Kharas said.","pubDate":"2023-12-04 23:49:09","image_url":"https://images.7news.com.au/publication/C-12788301/19f737008efe6ca89c481fd2ec6d224e6aac3c32-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0cd31d463058cdca21518c70164907cd","title":"Usman Khawaja defends David Warner after Mitchell Johnson’s attack on Australian batter","link":"https://www.nzherald.co.nz/sport/cricket/usman-khawaja-defends-david-warner-after-mitchell-johnsons-attack-on-australian-batter/EUMS3C2JXZF3PPXCZVBDQTQBEE/","keywords":null,"creator":["Joel Gould and Oliver Caffrey"],"video_url":null,"description":"The former quick says Warner doesn't deserve to have a farewell send-off.","content":"Usman Khawaja has fired back at Mitchell Johnson’s criticism of test teammate David Warner , declaring his opening partner is “a hero” who has paid his dues for the Sandpaper-gate scandal. Former fast bowler Johnson said his old teammate Warner did not deserve to be given a farewell in the third test of the summer series against Pakistan. Johnson said Warner had not taken full responsibility for his role in the Sandpaper-gate affair in South Africa in 2018 that earned him a 12-month ban. He questioned “why a player at the centre of one of the biggest scandals in Australian cricket history warrants a hero’s send-off”. Khawaja said he “strongly disagreed” with Johnson’s column in the West Australian newspaper, adding Warner and former skipper Steve Smith, who was also banned for a year, had paid for their mistakes. “Davey Warner and Steve Smith are heroes in my mind,” Khawaja said. “They missed a year of cricket through dark times in Australian cricket but they have paid their dues. “No one is perfect. Mitchell Johnson isn’t perfect. I am not perfect. Steve Smith is not perfect. David Warner isn’t perfect. “What they have done for the game and to grow the game far outweighs anything else they have done. “So for (Johnson) to imply that Dave Warner or anyone else involved in Sandpaper-(gate) is not a hero I strongly disagree with because I believe they have paid their dues.” Warner is yet to respond to the explosive remarks but his manager James Erskine has called Johnson “ignorant”. “This reminds me of backseat drivers, they’re bloody annoying, and quite frankly, we don’t need it,” Erskine told SEN. “He (Johnson) is basically making comments that I think are incendiary. “Come up with an alternative solution, pal. “If he thinks basically thinks three people did Sandpaper-gate, then he should go to the moon for holiday. I mean, it’s just a joke.” Khawaja also disagreed with Johnson’s comments about chairman of selectors George Bailey being too close to Warner. He said Bailey had brought a “breath of fresh air” to the role. Under Bailey’s chairmanship, Australia have won the 2021-22 Ashes and retained them in 2023, and have been victorious in the 2021 T20 World Cup, this year’s World Test Championship and ODI World Cup. “‘I’m not sure you can argue with that. (The criticism) is harsh,” Khawaja said. Khawaja also praised the influence of Andrew McDonald, although he did respond to the coach’ floating Marnus Labuschagne as an option to replace Warner as an opener in the Test team. “Have you asked Marnus this? I think he would give you a really clear, ‘hell no’,” Khawaja said. “Marnus has got opening-itis. I am pretty sure Davey Warner hurt his arm and sent Alex Carey out to open. I think that is a long shot.” Khawaja said he had no preference about who got the gig but made the point it should be a regular opener. Cameron Bancroft, Matt Renshaw and Marcus Harris are all in contention. “Opening is not easy. I can tell you that because I have batted No.1, 2, 3, 4, 5 and 6 for Australia and opening is by far the hardest,” Khawaja said. “It is very hard to bring somewhere up there that hasn’t opened. “I am positive if you put Marnus up there he would do very well but would he do as well as he does at No.3?” - AAP","pubDate":"2023-12-04 23:40:00","image_url":"https://www.nzherald.co.nz/resizer/pCqwcrrL5cchEf03eu2lMRB3yr8=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/CYIAM2TSU5D6JPMG4B3Z2HQ26Q.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"63e8956179e1e34318d6a5bb820ecbd8","title":"Live updates: White Ferns vs Pakistan, second Twenty20","link":"https://www.nzherald.co.nz/sport/cricket/live-updates-white-ferns-vs-pakistan-second-twenty20/3YXNTZAHJBFJZON52FXBB4YBIU/","keywords":null,"creator":null,"video_url":null,"description":"The White Ferns look to bounce back after the opening defeat to Pakistan.","content":"Live updates of the second Twenty20 between the White Ferns and Pakistan. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-12-04 23:37:57","image_url":"https://www.nzherald.co.nz/resizer/M7Z2uHle7mR0fnpC2xosotPCJhw=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/VO4FYOA72ZDNVJLV3NHRSRACIY.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"f66bcef2b526004c3a00efb3cdad34de","title":"How to Watch NZ-W vs PAK-W, 2nd T20I 2023 Live Streaming Online? Get Telecast Details of New Zealand Women vs Pakistan Women Cricket Match With Time in IST","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-nz-w-vs-pak-w-2nd-t20i-2023-live-streaming-online-get-telecast-details-of-new-zealand-women-vs-pakistan-women-cricket-match-with-time-in-ist-5607257.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Women clinched victory against the white ferns in the first match by seven wickets. Scroll down to get live streaming and telecast details.","content":"New Zealand women's team are currently engaged with their counterparts from Pakistan in the second of a three-match T20I series, on December 5. The second T20I between these two teams will be played at the University Oval in Dunedin and it starts at 5:30 am IST (Indian Standard Time). Amazon Prime Video has the rights to broadcast international cricket matches in New Zealand. Fans in India can watch the NZ-W vs PAK-W live streaming online on the Amazon Prime Video app. The live telecast of the New Zealand Women vs Pakistan Women 2nd T20I will not be available. it’s game on! 🏏 watch Women’s 2nd T20I, LIVE and exclusive only on Prime Video! — prime video IN (@PrimeVideoIN)","pubDate":"2023-12-04 23:30:04","image_url":"https://st1.latestly.com/wp-content/uploads/2023/12/Pakistan-Women-380x214.jpg","source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"54309a05c2750779fdcbd968bc5a3de5","title":"Golf internet sensation Mac Boucher rounds off Chasing the Fox field","link":"https://www.nzherald.co.nz/sport/golf-internet-sensation-mac-boucher-rounds-off-chasing-the-fox-field/PG4T3PLGBZBV5LORGUGYUWUSMM/","keywords":null,"creator":null,"video_url":null,"description":"Golf Instagram sensation Mac Boucher will play alongside two Kiwi greats.","content":"Golf Instagram sensation Mac Boucher has rounded out the field for the second Chasing the Fox event at Royal Auckland and Grange Golf Club next week. The Canadian has more than 330,000 followers on Instagram and has attracted almost four million likes on TikTok making him the most popular golfer from his country. He’s been touring New Zealand courses over the last week, sharing videos of his unique slinging shots as he tries to reach a scratch handicap playing both left and right-handed. The event takes place on December 14 and is a short format, teams contest where golfers get to take on world number 28 Ryan Fox. Fox had another stellar season, winning the BMW Championship in September, and finished fifth on the DP Tour season standings. All Blacks Anton Leinert-Brown, Damien McKenzie and Will Jordan will make up Team Rugby, coming off the back of a superb showing at the Rugby World Cup where they were edged in the final by the Springboks. Jordan finished the tournament as top try scorer. On Team Cricket, Mitchell Santner and Lockie Ferguson will be joined on the tee by Black Caps great Ross Taylor. Act leader David Seymour, Sir John Key and Max Key will make up the Politicians team while two-time Olympic champion Eric Murray, Black Sticks great Simon Child and surfer Billy Stairmand are in the Olympians team. Last year Sir John Key sunk an ace at the par three eighth at the Middlemore course before he was mobbed with hugs, high-fives and handshakes moments after pulling off the rare feat. He was given a guard of honour set up by fellow players on the green, leading towards the hole. Warriors duo Shaun Johnson and Wayde Egan will be joined by club great Awen Guttenbeil while Team Legends include comedian Mike King, chef Josh Emett and Boucher. Meanwhile, 12-year-old schoolboy, Bayleigh Teepa-Tarau will caddie for Fox . Teepa-Tarau, who has autism, is from a small rural town in the Bay of Plenty and caused a seismic shock-wave in New Zealand’s golfing scene by winning a national title at the Aims Games after only having played three rounds of golf in his life. A group of Royal Auckland and Grange members which includes former All Blacks coach John Hart and rugby great Grant Fox are funding the trip for Bayleigh and his family to attend the event and experience the day. Chasing the Fox this year is partnering up with I Am Hope as the charity partner.","pubDate":"2023-12-04 23:15:47","image_url":"https://www.nzherald.co.nz/resizer/t8rcRcm1w7lRCgi7vtnKZtE53u8=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/QAZW5LUNPFBNXMWVOULI5XHC3U.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"61bccc11828ee407811f9bfbf16fb13f","title":"New Zealand eye comeback final Test win in Bangladesh","link":"https://www.thehindu.com/sport/cricket/new-zealand-eye-comeback-final-test-win-in-bangladesh/article67605401.ece","keywords":["Cricket"],"creator":null,"video_url":null,"description":"The Kiwis, who started their long season with a tour to Pakistan in April, have also played series in Britain, Bangladesh and the United Arab Emirates, before playing in the World Cup in India","content":"New Zealand leg spinner Ish Sodhi said his side hoped to finish their long season away from home on a high by beating Bangladesh in the upcoming second Test. \"It's been a really, really long time away,\" Sodhi told reporters in Dhaka. \"It's been a really successful last six or so months for the team, but it can come with a lot of emotions\". The Kiwis, who started their long season with a tour to Pakistan in April, have also played series in Britain, Bangladesh and the United Arab Emirates, before playing in the World Cup in India, a time Sodhi described as emotional \"rollercoasters\". The Kiwis are trailing Bangladesh 0-1 in the two-Test series after their 150-run defeat in the opening Test in Sylhet. The second Test in Dhaka begins on Wednesday. \"It'll be really nice to finish on a high,\" he said. \"I think the boys are super motivated. Hopefully, we'll get some treats here before we leave, and then we can go and smell that beer. It's going to be beautiful New Zealand air pretty soon.\" New Zealand's defeat in Sylhet was their first Test defeat in Bangladesh and only second against the side. But Sodhi said they had learned lessons they would use in the final match. \"I think the way Bangladesh played, they certainly outplayed us,\" he said. \"But, upon reflection, I think they gave us a blueprint on what is successful in these conditions, and hopefully we can apply that to this next Test match.\" The Kiwis have not won a Test in Bangladesh since their three-wicket win in Chittagong in 2008. Their next three Tests ended in a draw, before the side slumped to defeat in the opening Test of the series. New Zealand, however, defeated Bangladesh 2-0 in the ODI leg of the tour before the World Cup to end their 15-year wait for a series victory in the country. COMMents SHARE Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit cricket / New Zealand","pubDate":"2023-12-04 23:11:00","image_url":"https://th-i.thgim.com/public/incoming/9u36u1/article67605434.ece/alternates/LANDSCAPE_1200/Bangladesh_New_Zealand_Cricket_71006.jpg","source_id":"thehindu","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7ef5f377cedc86f70af8b7b5d8a0049b","title":"The text messages that fuelled Mitchell Johnson’s explosive Warner column","link":"https://www.theage.com.au/sport/cricket/the-text-messages-that-fuelled-mitchell-johnson-s-explosive-warner-column-20231205-p5ep18.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"Mitchell Johnson has revealed text messages he received from David Warner and George Bailey fuelled his fiery column that has set cricket tongues wagging.","content":"Mitchell Johnson has revealed a pair of text exchanges with David Warner and George Bailey fuelled his fiery column questioning the pair , though he now admits to some regret about the personal tone of the piece. Warner messaged Johnson after a public exchange earlier this year between the former fast bowler and Candice Warner around the opening batter’s place in the Ashes team. Mitchell Johnson and David Warner in happier times. Credit: Reuters Bailey, more recently, contacted Johnson from India to express displeasure at an earlier opinion piece stating that Cricket Australia should stop asking the young fast bowler Lance Morris to rest from games. In his regular podcast, The Mitchell Johnson Show , with journalist Bharat Sundaresan, Johnson also took issue with Bailey publicly questioning if he was “OK”. Bailey made that comment on Sunday when he was announcing the Australian Test squad and was asked about Johnson’s column for The West Australian . “No, I’m not angry. I’m OK. Just want to make sure that everyone knows that I’m OK, and I’m in a good headspace,” Johnson told Sundaresan. “That’s another point which was really disappointing. To ask if I’m OK [by George Bailey] because I’ve had mental health issues is pretty much downplaying my article and putting it on mental health, which is quite disgusting, I think. I’m fine. I’m not angry. I’m not jealous. “It’s basically having a dig at someone’s mental health and saying that I must have something going on, a mental health issue, has made me say what I’ve said. That’s not the truth. That’s completely the opposite. I’m actually clear-minded. “It’s based on my interactions that I’ve had with him in recent times. It sort of tries to downplay the questions that I’ve asked in that article. And to say that I’m not allowed to have an opinion, that’s what it feels like. It seems very childish from George and condescending. “I’m just writing a piece that, for me, I felt like I needed to write. There was that personal aspect to it. But mostly I’ve tried to write things that is backed up by performances and question why players are picked when you hear about players should be picked on form, and he’s not being picked.” A Cricket Australia spokesperson said categorically that Bailey’s comments about Johnson were not any reference to his mental health. Australia’s Mitchell Johnson, left, Michael Clarke, second from left, and David Warner, third from left, celebrate the wicket of England’s Stuart Broad in 2013. Credit: AP Johnson explained the back and forth with Warner earlier in 2023 and Bailey during the World Cup in India. “It was around the time that Candice had said on the [TV program The ] Back Page about there not being openers good enough to take his position. That’s when I responded to that,” Johnson said. “And I got a message from Dave, which was quite personal, and I tried to ring him to talk to him about it, which I’ve always been open about with the guys. “When I finished playing, I said when I’m in the media, if I’m saying things or writing things that you guys don’t like, just come and speak to me. It was never a personal thing then. Until that point. That is what prompted me to write the article or part of it as well. It’s definitely a factor. Some of the things that he mentioned in that message. I won’t say it because that’s up to Dave to say if he wants to talk about it. There was some stuff in there, which was extremely disappointing what he said, and pretty bad, to be honest. That sort of was a bit of a driver. “And a bit with George as well. He’d sent me a message after the Lance Morris article. It was just a bit condescending. Typical George sort of stuff. When you receive it at odd hours in the morning, it was disappointing.” That being said, Johnson explained that he was still relatively new to writing opinion pieces, and would reconsider his tone in future. “I think, in general, the tone of my articles have been fair apart from this one,” Johnson said. “The rest have been fine. Even the one that I had written about what Candice had said on The Back Page , I still wrote a lot of good things about David and his career. I was only bringing up the point of his performances and also players who should have an opportunity. I feel like that’s fair. “It does make me think with this one that it probably wasn’t the right tone. But those are the things that you learn. You’re allowed to make, I guess, like Davey made that mistake, I guess, well, but this is not a mistake. No, I don’t think it’s a mistake. It’s just me thinking about the tone in which I’ve gone with here. “I’ve never made any of my other articles personal. I definitely feel the difference with this one. It comes from a place where I think I had to go that way.” Johnson also reflected on how he had to differentiate between friends he played cricket with and acquaintances from his time in the national team. Johnson will see his former teammates in Perth when he commentates on the first Test for Triple M. “It’s just about finding out that you’ve got your mates, and then you had acquaintances with whom you played a sport,” he said. “You always had each other’s backs on the training paddock, but then it’s just about differentiating those relationships. “It is sad when it gets to this, though. I’m not a person who likes that confrontation. Even if it looked like that on TV. That’s not me. It really is hard to go down this path. It is what it is. It’s done. I’ve taken ownership of it. It is difficult to write pieces. It’s out there and it’s public. You’re putting yourself out there in the open to cop the criticism.” Both Bailey and Warner declined to comment. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-04 23:05:34","image_url":null,"source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f809ec9a1d63ad5dbe345f80de62aea6","title":"The text messages that fuelled Mitchell Johnson’s explosive Warner column","link":"https://www.smh.com.au/sport/cricket/the-text-messages-that-fuelled-mitchell-johnson-s-explosive-warner-column-20231205-p5ep18.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"Mitchell Johnson has revealed text messages he received from David Warner and George Bailey fuelled his fiery column that has set cricket tongues wagging.","content":"Mitchell Johnson has revealed a pair of text exchanges with David Warner and George Bailey fuelled his fiery column questioning the pair , though he now admits to some regret about the personal tone of the piece. Warner messaged Johnson after a public exchange earlier this year between the former fast bowler and Candice Warner around the opening batter’s place in the Ashes team. Mitchell Johnson and David Warner in happier times. Credit: Reuters Bailey, more recently, contacted Johnson from India to express displeasure at an earlier opinion piece stating that Cricket Australia should stop asking the young fast bowler Lance Morris to rest from games. In his regular podcast, The Mitchell Johnson Show , with journalist Bharat Sundaresan, Johnson also took issue with Bailey publicly questioning if he was “OK”. Bailey made that comment on Sunday when he was announcing the Australian Test squad and was asked about Johnson’s column for The West Australian . “No, I’m not angry. I’m OK. Just want to make sure that everyone knows that I’m OK, and I’m in a good headspace,” Johnson told Sundaresan. “That’s another point which was really disappointing. To ask if I’m OK [by George Bailey] because I’ve had mental health issues is pretty much downplaying my article and putting it on mental health, which is quite disgusting, I think. I’m fine. I’m not angry. I’m not jealous. “It’s basically having a dig at someone’s mental health and saying that I must have something going on, a mental health issue, has made me say what I’ve said. That’s not the truth. That’s completely the opposite. I’m actually clear-minded. “It’s based on my interactions that I’ve had with him in recent times. It sort of tries to downplay the questions that I’ve asked in that article. And to say that I’m not allowed to have an opinion, that’s what it feels like. It seems very childish from George and condescending. “I’m just writing a piece that, for me, I felt like I needed to write. There was that personal aspect to it. But mostly I’ve tried to write things that is backed up by performances and question why players are picked when you hear about players should be picked on form, and he’s not being picked.” A Cricket Australia spokesperson said categorically that Bailey’s comments about Johnson were not any reference to his mental health. Australia’s Mitchell Johnson, left, Michael Clarke, second from left, and David Warner, third from left, celebrate the wicket of England’s Stuart Broad in 2013. Credit: AP Johnson explained the back and forth with Warner earlier in 2023 and Bailey during the World Cup in India. “It was around the time that Candice had said on the [TV program The ] Back Page about there not being openers good enough to take his position. That’s when I responded to that,” Johnson said. “And I got a message from Dave, which was quite personal, and I tried to ring him to talk to him about it, which I’ve always been open about with the guys. “When I finished playing, I said when I’m in the media, if I’m saying things or writing things that you guys don’t like, just come and speak to me. It was never a personal thing then. Until that point. That is what prompted me to write the article or part of it as well. It’s definitely a factor. Some of the things that he mentioned in that message. I won’t say it because that’s up to Dave to say if he wants to talk about it. There was some stuff in there, which was extremely disappointing what he said, and pretty bad, to be honest. That sort of was a bit of a driver. “And a bit with George as well. He’d sent me a message after the Lance Morris article. It was just a bit condescending. Typical George sort of stuff. When you receive it at odd hours in the morning, it was disappointing.” That being said, Johnson explained that he was still relatively new to writing opinion pieces, and would reconsider his tone in future. “I think, in general, the tone of my articles have been fair apart from this one,” Johnson said. “The rest have been fine. Even the one that I had written about what Candice had said on The Back Page , I still wrote a lot of good things about David and his career. I was only bringing up the point of his performances and also players who should have an opportunity. I feel like that’s fair. “It does make me think with this one that it probably wasn’t the right tone. But those are the things that you learn. You’re allowed to make, I guess, like Davey made that mistake, I guess, well, but this is not a mistake. No, I don’t think it’s a mistake. It’s just me thinking about the tone in which I’ve gone with here. “I’ve never made any of my other articles personal. I definitely feel the difference with this one. It comes from a place where I think I had to go that way.” Johnson also reflected on how he had to differentiate between friends he played cricket with and acquaintances from his time in the national team. Johnson will see his former teammates in Perth when he commentates on the first Test for Triple M. “It’s just about finding out that you’ve got your mates, and then you had acquaintances with whom you played a sport,” he said. “You always had each other’s backs on the training paddock, but then it’s just about differentiating those relationships. “It is sad when it gets to this, though. I’m not a person who likes that confrontation. Even if it looked like that on TV. That’s not me. It really is hard to go down this path. It is what it is. It’s done. I’ve taken ownership of it. It is difficult to write pieces. It’s out there and it’s public. You’re putting yourself out there in the open to cop the criticism.” Both Bailey and Warner declined to comment. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-04 23:05:34","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"1bfe147699f437ef5ff39391f28bc8ea","title":"Johnson details reasons for explosive Warner takedown","link":"https://thewest.com.au/sport/cricket/johnson-details-reasons-for-explosive-warner-takedown-c-12789942","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Mitchell Johnson admits he has fallen out with his former Australia teammates David Warner and George Bailey over his explosive cricket columns.","content":"There was a personal side to Mitchell Johnson's extraordinary attack on former Australia teammate David Warner's farewell Test series, the former champion quick admits. Johnson has explained why he blasted Warner and chairman of selectors George Bailey in an explosive column in The West Australian. The former bowler concedes his relationship with Warner and fellow former teammate Bailey was already damaged but insists that was not solely why he wrote the article. \"People have touched on it, (that) there seems to be a personal side to it, which there is as well,\" the 42-year-old said on his Mitchell Johnson Cricket Show podcast with broadcaster Bharat Sundaresan. \"But when I've written my articles, I've always tried to do it in a way that I can back things up ... it is my opinion, it is only an opinion piece. \"This one was a difficult one to do ... when I wrote it, I knew it was probably going to get a bit of attention.\" Sydneysider Warner has expressed a desire to finish his red-ball career at home when Australia face Pakistan at the SCG in the third and final Test of this summer's series. He and Johnson played together for Australia for more than five years, including in the 2013-14 Ashes whitewash and 2015's ODI World Cup victory. Johnson said he received a \"quite personal\" response to a column he wrote after Warner's wife Candice defended her husband's position in the Test team on Fox Sport's program, The Back Page. \"I tried to ring (Warner) to talk to him about it, which I've always been open about with the guys,\" Johnson said. \"It was never a personal thing then. Until that point. \"That is what prompted me to write the article, or part of it, as well. It's definitely a factor. \"Some of the things that he mentioned in that message, I won't say it because that's up to Dave to say if he wants to talk about it, (but) there was some stuff in there, which was extremely disappointing ... and pretty bad to be honest.\" Johnson said he had received strong feedback from Bailey after publishing an article about emerging Western Australia quick Lance Morris. In a press conference on Sunday, Bailey responded to Johnson's latest column, saying, \"I've been sent little snippets of it - I hope he's OK\". Johnson took exception to Bailey's remarks. The former left-arm tearaway has previously been open about his mental-health challenges. \"I'm fine. I'm not angry. I'm not jealous. I'm just writing a piece that I felt I needed to write,\" Johnson said. \"It's basically having a dig at someone's mental health and saying that I must have something going on, (that) a mental-health issue has made me say what I've said. \"It sort of tries to downplay the questions that I've asked in that article ... It seems very childish from George, and condescending.'' Warner has yet to acknowledge Johnson's scathing criticism but the opener's manager James Erskine described the 73-Test bowling star \"ignorant\" and a \"backseat driver\". \"If he basically thinks three people did sandpaper-gate, then he should go to the moon for a holiday. I mean, it's just a joke,\" Erskine told SEN on Monday.","pubDate":"2023-12-05 00:01:29","image_url":"https://images.thewest.com.au/publication/C-12789942/ff276ca1cd91cd79ade05e7bdb940a06d28c3a8f-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"3427cd1012bad6f482ffb6e62a000885","title":"Southern Districts look to start new year strongly in Bradman Cup","link":"https://www.goulburnpost.com.au/story/8428468/southern-districts-look-to-start-new-year-strongly-in-bradman-cup/?src=rss","keywords":null,"creator":["Burney Wong"],"video_url":null,"description":"Young cricketers from the Southern Tablelands and the Highlands have been taking on the state's best players.","content":"Cricket ball and bails. File picture. Young cricketers from the Southern Tablelands and the Highlands have been taking on the state's best players, but it's been a struggle. Three games into Country Cricket NSW's Bradman Cup competition, the Southern Districts are still winless, but they'll have a chance to regroup before taking on Newcastle in the new year. Their first match was a rain affected loss to the Western region. READ ALSO: Legendary singer-songwriter James Taylor to play in Bowral $100k a sweet reward for Highlands Dessert Master Where you can mail your letters to Santa in the Highlands Winning the toss and batting first, Southern Districts only managed to put 94 runs on board, with vice captain Issac Roxburgh top scoring with 30 runs. Mikah Millar took two wickets in the second innings but it wasn't enough to get his side across the line via the DLS method. The second match saw Southern Districts bowl first and get beaten comprehensively by Riverina which made 162 runs in their 20 overs. Southern Districts never stood a chance chasing as wickets continually fell and they ended up being bowled out for just 42 runs. Their final game of the year was a one day match against Riverina and they put up yet another disappointing batting performance. After being put in to bowl first, Southern Districts captain Samuel McGregor led from the front by taking four wickets off his nine overs, but Riverina were still able to put up a strong total of 310 runs off their 50 overs. Heading into the second innings, the batting side was optimistic but found themselves on the backfoot after losing their openers cheaply. Just like their opening match, Isaac top scored, this time with 46 runs, but it wasn't enough to get his side across the line. The 151 run loss put the Southern Districts at the bottom of the ladder heading into the new year. Did you know the Southern Highland News is now offering breaking news alerts and a weekly email newsletter? Keep up-to-date with all the local news: sign up below. Share Facebook Twitter Whatsapp Email Copy Burney Wong Journalist I love sport. You can reach me at burney.wong@austcommunitymedia.com.au or on 0437 291 518. I love sport. You can reach me at burney.wong@austcommunitymedia.com.au or on 0437 291 518. More from Latest News Battling borrowers bank on pre-Christmas rates relief 7m ago Goulburn Regional Art Gallery hosts Archibald prizes as part of tour 9m ago Late payment repeat offenders to be named and shamed 20m ago Life's no beach as funding knockback shrinks photo fest 27m ago More from Latest News Battling borrowers bank on pre-Christmas rates relief 7m ago Goulburn Regional Art Gallery hosts Archibald prizes as part of tour 9m ago Late payment repeat offenders to be named and shamed 20m ago Life's no beach as funding knockback shrinks photo fest 27m ago Andrew O'Keefe pleads guilty to drug-driving 44m ago Council experiences phone drop outs 49m ago More from Latest News Battling borrowers bank on pre-Christmas rates relief 7m ago Goulburn Regional Art Gallery hosts Archibald prizes as part of tour 9m ago Late payment repeat offenders to be named and shamed 20m ago Life's no beach as funding knockback shrinks photo fest 27m ago Andrew O'Keefe pleads guilty to drug-driving 44m ago Council experiences phone drop outs 49m ago","pubDate":"2023-12-05 00:00:00","image_url":"https://www.goulburnpost.com.au/images/transform/v1/crop/frm/Xn3KP2xbyFBWgTmsCMnW6P/7a27b78c-b159-4b6b-8e7e-fba489ec90fb.jpg/r88_105_940_585_w600_h338_fmax.jpg","source_id":"goulburnpost","source_priority":1442959,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"19fd738c183acaab56f44c693c17ebb8","title":"Amazon Prime secures rights to all ICC events, but Australian summer still live and free on Seven","link":"https://7news.com.au/sport/cricket/amazon-prime-secures-rights-to-all-icc-events-but-australian-summer-still-live-and-free-on-seven-c-12788301","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia’s international teams will play behind a paywall when the landmark new deal kicks in.","content":"Australia’s World Test Championship and defences will be shown exclusively on Amazon Prime Video. The streaming platform has secured the broadcast rights in Australia for all men’s and women’s International Cricket Council (ICC) tournaments. , but Foxtel/Kayo broadcast the entire recent Cricket World Cup, while Nine screened Australia’s overseas games and some other major matches this year. The Amazon move comes just days after the federal government reaffirmed its commitment to sport anti-siphoning measures. Communications minister Michelle Rowland last week introduced laws to parliament updating anti-siphoning measures that would require free-to-air services to be offered first refusal for important sporting events. “All Australians regardless of where they live, or what they earn, should have the opportunity to enjoy free TV coverage of iconic sporting events,” Rowland said. But ICC boss Geoff Allardice welcomed the partnership with Amazon, which brings with it a paywall. “We are very excited to be entering a new four-year partnership with Prime Video for ICC cricket rights in Australia,” he said in a statement. “The recently concluded men’s World Cup has highlighted the interest and passion for ICC events across the globe, and especially in Australia where cricket fans have enjoyed the recent success of their men’s and women’s teams. “We look forward to working with Prime Video Australia to provide an innovative coverage of world class cricket to more fans in Australia.” The new partnership between the ICC and Amazon will begin in January. “Over the next four years, Prime members in Australia will be able to watch their favourite cricket teams and players compete for the game’s biggest prize, on demand, on the device of their choice — exclusively on Prime Video,” Prime Video Australia and New Zealand boss Hushidar Kharas said.","pubDate":"2023-12-04 23:49:09","image_url":"https://images.7news.com.au/publication/C-12788301/19f737008efe6ca89c481fd2ec6d224e6aac3c32-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0cd31d463058cdca21518c70164907cd","title":"Usman Khawaja defends David Warner after Mitchell Johnson’s attack on Australian batter","link":"https://www.nzherald.co.nz/sport/cricket/usman-khawaja-defends-david-warner-after-mitchell-johnsons-attack-on-australian-batter/EUMS3C2JXZF3PPXCZVBDQTQBEE/","keywords":null,"creator":["Joel Gould and Oliver Caffrey"],"video_url":null,"description":"The former quick says Warner doesn't deserve to have a farewell send-off.","content":"Usman Khawaja has fired back at Mitchell Johnson’s criticism of test teammate David Warner , declaring his opening partner is “a hero” who has paid his dues for the Sandpaper-gate scandal. Former fast bowler Johnson said his old teammate Warner did not deserve to be given a farewell in the third test of the summer series against Pakistan. Johnson said Warner had not taken full responsibility for his role in the Sandpaper-gate affair in South Africa in 2018 that earned him a 12-month ban. He questioned “why a player at the centre of one of the biggest scandals in Australian cricket history warrants a hero’s send-off”. Khawaja said he “strongly disagreed” with Johnson’s column in the West Australian newspaper, adding Warner and former skipper Steve Smith, who was also banned for a year, had paid for their mistakes. “Davey Warner and Steve Smith are heroes in my mind,” Khawaja said. “They missed a year of cricket through dark times in Australian cricket but they have paid their dues. “No one is perfect. Mitchell Johnson isn’t perfect. I am not perfect. Steve Smith is not perfect. David Warner isn’t perfect. “What they have done for the game and to grow the game far outweighs anything else they have done. “So for (Johnson) to imply that Dave Warner or anyone else involved in Sandpaper-(gate) is not a hero I strongly disagree with because I believe they have paid their dues.” Warner is yet to respond to the explosive remarks but his manager James Erskine has called Johnson “ignorant”. “This reminds me of backseat drivers, they’re bloody annoying, and quite frankly, we don’t need it,” Erskine told SEN. “He (Johnson) is basically making comments that I think are incendiary. “Come up with an alternative solution, pal. “If he thinks basically thinks three people did Sandpaper-gate, then he should go to the moon for holiday. I mean, it’s just a joke.” Khawaja also disagreed with Johnson’s comments about chairman of selectors George Bailey being too close to Warner. He said Bailey had brought a “breath of fresh air” to the role. Under Bailey’s chairmanship, Australia have won the 2021-22 Ashes and retained them in 2023, and have been victorious in the 2021 T20 World Cup, this year’s World Test Championship and ODI World Cup. “‘I’m not sure you can argue with that. (The criticism) is harsh,” Khawaja said. Khawaja also praised the influence of Andrew McDonald, although he did respond to the coach’ floating Marnus Labuschagne as an option to replace Warner as an opener in the Test team. “Have you asked Marnus this? I think he would give you a really clear, ‘hell no’,” Khawaja said. “Marnus has got opening-itis. I am pretty sure Davey Warner hurt his arm and sent Alex Carey out to open. I think that is a long shot.” Khawaja said he had no preference about who got the gig but made the point it should be a regular opener. Cameron Bancroft, Matt Renshaw and Marcus Harris are all in contention. “Opening is not easy. I can tell you that because I have batted No.1, 2, 3, 4, 5 and 6 for Australia and opening is by far the hardest,” Khawaja said. “It is very hard to bring somewhere up there that hasn’t opened. “I am positive if you put Marnus up there he would do very well but would he do as well as he does at No.3?” - AAP","pubDate":"2023-12-04 23:40:00","image_url":"https://www.nzherald.co.nz/resizer/pCqwcrrL5cchEf03eu2lMRB3yr8=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/CYIAM2TSU5D6JPMG4B3Z2HQ26Q.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"63e8956179e1e34318d6a5bb820ecbd8","title":"Live updates: White Ferns vs Pakistan, second Twenty20","link":"https://www.nzherald.co.nz/sport/cricket/live-updates-white-ferns-vs-pakistan-second-twenty20/3YXNTZAHJBFJZON52FXBB4YBIU/","keywords":null,"creator":null,"video_url":null,"description":"The White Ferns look to bounce back after the opening defeat to Pakistan.","content":"Live updates of the second Twenty20 between the White Ferns and Pakistan. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-12-04 23:37:57","image_url":"https://www.nzherald.co.nz/resizer/M7Z2uHle7mR0fnpC2xosotPCJhw=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/VO4FYOA72ZDNVJLV3NHRSRACIY.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"f66bcef2b526004c3a00efb3cdad34de","title":"How to Watch NZ-W vs PAK-W, 2nd T20I 2023 Live Streaming Online? Get Telecast Details of New Zealand Women vs Pakistan Women Cricket Match With Time in IST","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-nz-w-vs-pak-w-2nd-t20i-2023-live-streaming-online-get-telecast-details-of-new-zealand-women-vs-pakistan-women-cricket-match-with-time-in-ist-5607257.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Women clinched victory against the white ferns in the first match by seven wickets. Scroll down to get live streaming and telecast details.","content":"New Zealand women's team are currently engaged with their counterparts from Pakistan in the second of a three-match T20I series, on December 5. The second T20I between these two teams will be played at the University Oval in Dunedin and it starts at 5:30 am IST (Indian Standard Time). Amazon Prime Video has the rights to broadcast international cricket matches in New Zealand. Fans in India can watch the NZ-W vs PAK-W live streaming online on the Amazon Prime Video app. The live telecast of the New Zealand Women vs Pakistan Women 2nd T20I will not be available. it’s game on! 🏏 watch Women’s 2nd T20I, LIVE and exclusive only on Prime Video! — prime video IN (@PrimeVideoIN)","pubDate":"2023-12-04 23:30:04","image_url":"https://st1.latestly.com/wp-content/uploads/2023/12/Pakistan-Women-380x214.jpg","source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"54309a05c2750779fdcbd968bc5a3de5","title":"Golf internet sensation Mac Boucher rounds off Chasing the Fox field","link":"https://www.nzherald.co.nz/sport/golf-internet-sensation-mac-boucher-rounds-off-chasing-the-fox-field/PG4T3PLGBZBV5LORGUGYUWUSMM/","keywords":null,"creator":null,"video_url":null,"description":"Golf Instagram sensation Mac Boucher will play alongside two Kiwi greats.","content":"Golf Instagram sensation Mac Boucher has rounded out the field for the second Chasing the Fox event at Royal Auckland and Grange Golf Club next week. The Canadian has more than 330,000 followers on Instagram and has attracted almost four million likes on TikTok making him the most popular golfer from his country. He’s been touring New Zealand courses over the last week, sharing videos of his unique slinging shots as he tries to reach a scratch handicap playing both left and right-handed. The event takes place on December 14 and is a short format, teams contest where golfers get to take on world number 28 Ryan Fox. Fox had another stellar season, winning the BMW Championship in September, and finished fifth on the DP Tour season standings. All Blacks Anton Leinert-Brown, Damien McKenzie and Will Jordan will make up Team Rugby, coming off the back of a superb showing at the Rugby World Cup where they were edged in the final by the Springboks. Jordan finished the tournament as top try scorer. On Team Cricket, Mitchell Santner and Lockie Ferguson will be joined on the tee by Black Caps great Ross Taylor. Act leader David Seymour, Sir John Key and Max Key will make up the Politicians team while two-time Olympic champion Eric Murray, Black Sticks great Simon Child and surfer Billy Stairmand are in the Olympians team. Last year Sir John Key sunk an ace at the par three eighth at the Middlemore course before he was mobbed with hugs, high-fives and handshakes moments after pulling off the rare feat. He was given a guard of honour set up by fellow players on the green, leading towards the hole. Warriors duo Shaun Johnson and Wayde Egan will be joined by club great Awen Guttenbeil while Team Legends include comedian Mike King, chef Josh Emett and Boucher. Meanwhile, 12-year-old schoolboy, Bayleigh Teepa-Tarau will caddie for Fox . Teepa-Tarau, who has autism, is from a small rural town in the Bay of Plenty and caused a seismic shock-wave in New Zealand’s golfing scene by winning a national title at the Aims Games after only having played three rounds of golf in his life. A group of Royal Auckland and Grange members which includes former All Blacks coach John Hart and rugby great Grant Fox are funding the trip for Bayleigh and his family to attend the event and experience the day. Chasing the Fox this year is partnering up with I Am Hope as the charity partner.","pubDate":"2023-12-04 23:15:47","image_url":"https://www.nzherald.co.nz/resizer/t8rcRcm1w7lRCgi7vtnKZtE53u8=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/QAZW5LUNPFBNXMWVOULI5XHC3U.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"61bccc11828ee407811f9bfbf16fb13f","title":"New Zealand eye comeback final Test win in Bangladesh","link":"https://www.thehindu.com/sport/cricket/new-zealand-eye-comeback-final-test-win-in-bangladesh/article67605401.ece","keywords":["Cricket"],"creator":null,"video_url":null,"description":"The Kiwis, who started their long season with a tour to Pakistan in April, have also played series in Britain, Bangladesh and the United Arab Emirates, before playing in the World Cup in India","content":"New Zealand leg spinner Ish Sodhi said his side hoped to finish their long season away from home on a high by beating Bangladesh in the upcoming second Test. \"It's been a really, really long time away,\" Sodhi told reporters in Dhaka. \"It's been a really successful last six or so months for the team, but it can come with a lot of emotions\". The Kiwis, who started their long season with a tour to Pakistan in April, have also played series in Britain, Bangladesh and the United Arab Emirates, before playing in the World Cup in India, a time Sodhi described as emotional \"rollercoasters\". The Kiwis are trailing Bangladesh 0-1 in the two-Test series after their 150-run defeat in the opening Test in Sylhet. The second Test in Dhaka begins on Wednesday. \"It'll be really nice to finish on a high,\" he said. \"I think the boys are super motivated. Hopefully, we'll get some treats here before we leave, and then we can go and smell that beer. It's going to be beautiful New Zealand air pretty soon.\" New Zealand's defeat in Sylhet was their first Test defeat in Bangladesh and only second against the side. But Sodhi said they had learned lessons they would use in the final match. \"I think the way Bangladesh played, they certainly outplayed us,\" he said. \"But, upon reflection, I think they gave us a blueprint on what is successful in these conditions, and hopefully we can apply that to this next Test match.\" The Kiwis have not won a Test in Bangladesh since their three-wicket win in Chittagong in 2008. Their next three Tests ended in a draw, before the side slumped to defeat in the opening Test of the series. New Zealand, however, defeated Bangladesh 2-0 in the ODI leg of the tour before the World Cup to end their 15-year wait for a series victory in the country. COMMents SHARE Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit cricket / New Zealand","pubDate":"2023-12-04 23:11:00","image_url":"https://th-i.thgim.com/public/incoming/9u36u1/article67605434.ece/alternates/LANDSCAPE_1200/Bangladesh_New_Zealand_Cricket_71006.jpg","source_id":"thehindu","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7ef5f377cedc86f70af8b7b5d8a0049b","title":"The text messages that fuelled Mitchell Johnson’s explosive Warner column","link":"https://www.theage.com.au/sport/cricket/the-text-messages-that-fuelled-mitchell-johnson-s-explosive-warner-column-20231205-p5ep18.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"Mitchell Johnson has revealed text messages he received from David Warner and George Bailey fuelled his fiery column that has set cricket tongues wagging.","content":"Mitchell Johnson has revealed a pair of text exchanges with David Warner and George Bailey fuelled his fiery column questioning the pair , though he now admits to some regret about the personal tone of the piece. Warner messaged Johnson after a public exchange earlier this year between the former fast bowler and Candice Warner around the opening batter’s place in the Ashes team. Mitchell Johnson and David Warner in happier times. Credit: Reuters Bailey, more recently, contacted Johnson from India to express displeasure at an earlier opinion piece stating that Cricket Australia should stop asking the young fast bowler Lance Morris to rest from games. In his regular podcast, The Mitchell Johnson Show , with journalist Bharat Sundaresan, Johnson also took issue with Bailey publicly questioning if he was “OK”. Bailey made that comment on Sunday when he was announcing the Australian Test squad and was asked about Johnson’s column for The West Australian . “No, I’m not angry. I’m OK. Just want to make sure that everyone knows that I’m OK, and I’m in a good headspace,” Johnson told Sundaresan. “That’s another point which was really disappointing. To ask if I’m OK [by George Bailey] because I’ve had mental health issues is pretty much downplaying my article and putting it on mental health, which is quite disgusting, I think. I’m fine. I’m not angry. I’m not jealous. “It’s basically having a dig at someone’s mental health and saying that I must have something going on, a mental health issue, has made me say what I’ve said. That’s not the truth. That’s completely the opposite. I’m actually clear-minded. “It’s based on my interactions that I’ve had with him in recent times. It sort of tries to downplay the questions that I’ve asked in that article. And to say that I’m not allowed to have an opinion, that’s what it feels like. It seems very childish from George and condescending. “I’m just writing a piece that, for me, I felt like I needed to write. There was that personal aspect to it. But mostly I’ve tried to write things that is backed up by performances and question why players are picked when you hear about players should be picked on form, and he’s not being picked.” A Cricket Australia spokesperson said categorically that Bailey’s comments about Johnson were not any reference to his mental health. Australia’s Mitchell Johnson, left, Michael Clarke, second from left, and David Warner, third from left, celebrate the wicket of England’s Stuart Broad in 2013. Credit: AP Johnson explained the back and forth with Warner earlier in 2023 and Bailey during the World Cup in India. “It was around the time that Candice had said on the [TV program The ] Back Page about there not being openers good enough to take his position. That’s when I responded to that,” Johnson said. “And I got a message from Dave, which was quite personal, and I tried to ring him to talk to him about it, which I’ve always been open about with the guys. “When I finished playing, I said when I’m in the media, if I’m saying things or writing things that you guys don’t like, just come and speak to me. It was never a personal thing then. Until that point. That is what prompted me to write the article or part of it as well. It’s definitely a factor. Some of the things that he mentioned in that message. I won’t say it because that’s up to Dave to say if he wants to talk about it. There was some stuff in there, which was extremely disappointing what he said, and pretty bad, to be honest. That sort of was a bit of a driver. “And a bit with George as well. He’d sent me a message after the Lance Morris article. It was just a bit condescending. Typical George sort of stuff. When you receive it at odd hours in the morning, it was disappointing.” That being said, Johnson explained that he was still relatively new to writing opinion pieces, and would reconsider his tone in future. “I think, in general, the tone of my articles have been fair apart from this one,” Johnson said. “The rest have been fine. Even the one that I had written about what Candice had said on The Back Page , I still wrote a lot of good things about David and his career. I was only bringing up the point of his performances and also players who should have an opportunity. I feel like that’s fair. “It does make me think with this one that it probably wasn’t the right tone. But those are the things that you learn. You’re allowed to make, I guess, like Davey made that mistake, I guess, well, but this is not a mistake. No, I don’t think it’s a mistake. It’s just me thinking about the tone in which I’ve gone with here. “I’ve never made any of my other articles personal. I definitely feel the difference with this one. It comes from a place where I think I had to go that way.” Johnson also reflected on how he had to differentiate between friends he played cricket with and acquaintances from his time in the national team. Johnson will see his former teammates in Perth when he commentates on the first Test for Triple M. “It’s just about finding out that you’ve got your mates, and then you had acquaintances with whom you played a sport,” he said. “You always had each other’s backs on the training paddock, but then it’s just about differentiating those relationships. “It is sad when it gets to this, though. I’m not a person who likes that confrontation. Even if it looked like that on TV. That’s not me. It really is hard to go down this path. It is what it is. It’s done. I’ve taken ownership of it. It is difficult to write pieces. It’s out there and it’s public. You’re putting yourself out there in the open to cop the criticism.” Both Bailey and Warner declined to comment. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-04 23:05:34","image_url":null,"source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f809ec9a1d63ad5dbe345f80de62aea6","title":"The text messages that fuelled Mitchell Johnson’s explosive Warner column","link":"https://www.smh.com.au/sport/cricket/the-text-messages-that-fuelled-mitchell-johnson-s-explosive-warner-column-20231205-p5ep18.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"Mitchell Johnson has revealed text messages he received from David Warner and George Bailey fuelled his fiery column that has set cricket tongues wagging.","content":"Mitchell Johnson has revealed a pair of text exchanges with David Warner and George Bailey fuelled his fiery column questioning the pair , though he now admits to some regret about the personal tone of the piece. Warner messaged Johnson after a public exchange earlier this year between the former fast bowler and Candice Warner around the opening batter’s place in the Ashes team. Mitchell Johnson and David Warner in happier times. Credit: Reuters Bailey, more recently, contacted Johnson from India to express displeasure at an earlier opinion piece stating that Cricket Australia should stop asking the young fast bowler Lance Morris to rest from games. In his regular podcast, The Mitchell Johnson Show , with journalist Bharat Sundaresan, Johnson also took issue with Bailey publicly questioning if he was “OK”. Bailey made that comment on Sunday when he was announcing the Australian Test squad and was asked about Johnson’s column for The West Australian . “No, I’m not angry. I’m OK. Just want to make sure that everyone knows that I’m OK, and I’m in a good headspace,” Johnson told Sundaresan. “That’s another point which was really disappointing. To ask if I’m OK [by George Bailey] because I’ve had mental health issues is pretty much downplaying my article and putting it on mental health, which is quite disgusting, I think. I’m fine. I’m not angry. I’m not jealous. “It’s basically having a dig at someone’s mental health and saying that I must have something going on, a mental health issue, has made me say what I’ve said. That’s not the truth. That’s completely the opposite. I’m actually clear-minded. “It’s based on my interactions that I’ve had with him in recent times. It sort of tries to downplay the questions that I’ve asked in that article. And to say that I’m not allowed to have an opinion, that’s what it feels like. It seems very childish from George and condescending. “I’m just writing a piece that, for me, I felt like I needed to write. There was that personal aspect to it. But mostly I’ve tried to write things that is backed up by performances and question why players are picked when you hear about players should be picked on form, and he’s not being picked.” A Cricket Australia spokesperson said categorically that Bailey’s comments about Johnson were not any reference to his mental health. Australia’s Mitchell Johnson, left, Michael Clarke, second from left, and David Warner, third from left, celebrate the wicket of England’s Stuart Broad in 2013. Credit: AP Johnson explained the back and forth with Warner earlier in 2023 and Bailey during the World Cup in India. “It was around the time that Candice had said on the [TV program The ] Back Page about there not being openers good enough to take his position. That’s when I responded to that,” Johnson said. “And I got a message from Dave, which was quite personal, and I tried to ring him to talk to him about it, which I’ve always been open about with the guys. “When I finished playing, I said when I’m in the media, if I’m saying things or writing things that you guys don’t like, just come and speak to me. It was never a personal thing then. Until that point. That is what prompted me to write the article or part of it as well. It’s definitely a factor. Some of the things that he mentioned in that message. I won’t say it because that’s up to Dave to say if he wants to talk about it. There was some stuff in there, which was extremely disappointing what he said, and pretty bad, to be honest. That sort of was a bit of a driver. “And a bit with George as well. He’d sent me a message after the Lance Morris article. It was just a bit condescending. Typical George sort of stuff. When you receive it at odd hours in the morning, it was disappointing.” That being said, Johnson explained that he was still relatively new to writing opinion pieces, and would reconsider his tone in future. “I think, in general, the tone of my articles have been fair apart from this one,” Johnson said. “The rest have been fine. Even the one that I had written about what Candice had said on The Back Page , I still wrote a lot of good things about David and his career. I was only bringing up the point of his performances and also players who should have an opportunity. I feel like that’s fair. “It does make me think with this one that it probably wasn’t the right tone. But those are the things that you learn. You’re allowed to make, I guess, like Davey made that mistake, I guess, well, but this is not a mistake. No, I don’t think it’s a mistake. It’s just me thinking about the tone in which I’ve gone with here. “I’ve never made any of my other articles personal. I definitely feel the difference with this one. It comes from a place where I think I had to go that way.” Johnson also reflected on how he had to differentiate between friends he played cricket with and acquaintances from his time in the national team. Johnson will see his former teammates in Perth when he commentates on the first Test for Triple M. “It’s just about finding out that you’ve got your mates, and then you had acquaintances with whom you played a sport,” he said. “You always had each other’s backs on the training paddock, but then it’s just about differentiating those relationships. “It is sad when it gets to this, though. I’m not a person who likes that confrontation. Even if it looked like that on TV. That’s not me. It really is hard to go down this path. It is what it is. It’s done. I’ve taken ownership of it. It is difficult to write pieces. It’s out there and it’s public. You’re putting yourself out there in the open to cop the criticism.” Both Bailey and Warner declined to comment. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-04 23:05:34","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"}]}