{"newsArray":[{"title":"IND vs WI 2nd T20 2023 Dream11 Prediction: आज दूसरे टी20 में वेस्टइंडीज से भिड़ेगी भारतीय टीम, यहां जानें कैसे चुने बेस्ट फैंटसी प्लेइंग इलेवन","link":"https://hindi.latestly.com/sports/cricket/indian-team-will-take-on-west-indies-in-second-t20-today-know-here-how-to-choose-best-fantasy-playing-xi-1887721.html","keywords":null,"creator":null,"video_url":null,"description":"IND बनाम WI ड्रीम 11 फैंटेसी टीम के कप्तान के रूप में ईशान किशन(IND) को जबकि ब्रैंडन किंग(WI) को उप-कप्तान के रूप में चुना जा सकता है.","content":"IND vs WI 2nd T20 2023 Dream11 Prediction: 6 अगस्त (रविवार) को भारत और वेस्टइंडीज गुयाना के प्रोविडेंस स्टेडियम में पांच मैचों की टी20 सीरीज के दूसरे मैच में एक्शन में होंगे. दोनों टीमों ने पहले टी20 मैच में अपना सब कुछ झोंक दिया था. प्रशंसकों को रोमांचक क्रिकेट देखने को मिला. मैच बिल्कुल ख़राब हो गया लेकिन रोवमैन पॉवेल एंड कंपनी ने धैर्य बनाए रखते हुए गेम को चार विकेट से जीत लिया. जेसन होल्डर को उनके सनसनीखेज गेंदबाजी प्रदर्शन के लिए प्लेयर ऑफ द मैच चुना गया. यह भी पढ़ें: गुयाना में खेला जाएगा वेस्टइंडीज बनाम भारत दूसरे टी20 मैच, यहां जानें दोनों टीमों का संभावित प्लेइंग इलेवन भारत आगामी मुकाबले में विशेषकर बल्लेबाजी विभाग में सुधार करना चाहेगा, मेन इन ब्लू पहले टी20ई में 150 के लक्ष्य का पीछा करने में असमर्थ रहे और टीम मैनेजमेंट को बल्लेबाजों से बेहतर प्रदर्शन की उम्मीद होगी. हार्दिक पंड्या एंड कंपनी रविवार को होने वाले मुकाबले में संपूर्ण प्रदर्शन करने और सीरीज बराबर करने के लिए उत्सुक होगी. यह भी पढ़ें: आज गुयाना में खेला जाएगा भारत बनाम वेस्टइंडीज दूसरे टी20 मुकाबला, जानें कैसी रहेगी प्रोविडेंस स्टेडियम में मौसम और पिच का हाल दूसरी ओर, वेस्टइंडीज इस प्रतियोगिता में पूरे जोश के साथ उतरेगी, जिसने सितारों से सजी भारतीय टीम के खिलाफ शानदार गेंदबाजी का प्रदर्शन कर रही है. वे उसी प्रदर्शन को दोहराकर सीरीज में 2-0 से बढ़त हासिल करना चाहेंगे, हालाँकि, कैरेबियाई टीम चाहेगी कि मेहमान उन पर कड़ा प्रहार करें और इस प्रकार, उन्हें सभी विभागों में अपना सर्वश्रेष्ठ प्रदर्शन करने की आवश्यकता होगी. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: विकेटकीपर - ईशान किशन (IND), शाई होप (WI) को IND बनाम WI फैंटसी टीम के लिए विकेट-कीपर के रूप में हमारी पसंद हो सकते हैं. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: बल्लेबाज - बल्लेबाजी में भारी ड्रीम 11 फैंटसी टीम में ब्रैंडन किंग(WI), शुभमन गिल (IND), तिलक वर्मा(IND) को IND बनाम WI ड्रीम 11 टीम में चुना जा सकता है. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: ऑलराउंडर - हम तीन ऑलराउंडर हार्दिक पंड्या(IND), रोमारियो शेफर्ड(WI), काइल मेयर्स(WI) को IND बनाम WI फैंटसी टीम में चुना जा सकता है. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: गेंदबाज -याजुवेंद्र चहल (IND), कुलदीप यादव (IND), गुडाकेश मोती(WI) को IND बनाम WI ड्रीम 11 फैंटसी टीम में अकेले गेंदबाज हो सकते हैं. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: ईशान किशन (IND), शाई होप (WI), ब्रैंडन किंग(WI), शुभमन गिल (IND), तिलक वर्मा(IND), हार्दिक पंड्या(IND), रोमारियो शेफर्ड(WI), काइल मेयर्स(WI), याजुवेंद्र चहल(IND), कुलदीप यादव (IND), गुडाकेश मोती(WI) IND बनाम WI ड्रीम 11 फैंटेसी टीम के कप्तान के रूप में ईशान किशन(IND) को जबकि ब्रैंडन किंग(WI) को उप-कप्तान के रूप में चुना जा सकता है.","pubDate":"2023-08-06 06:16:22","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Global T20 Canada 2023: Montreal Tigers Beat Vancouver Knights by 1 Wicket, to Face Surrey Jaguars in Final","link":"https://www.latestly.com/sports/cricket/global-t20-canada-2023-montreal-tigers-beat-vancouver-knights-by-1-wicket-to-face-surrey-jaguars-in-final-5320390.html","keywords":null,"creator":null,"video_url":null,"description":"Montreal Tigers defeated Vancouver Knights by one wicket in Qualifier 2 to reach the final of Global T20 Canada, here.","content":"Brampton, August 6 : Montreal Tigers defeated Vancouver Knights by one wicket in Qualifier 2 to reach the final of Global T20 Canada, here. The star performers for Montreal Tigers were Abbas Afridi (5/29) who picked up five wickets, including a hattrick and Sherfane Rutherfords (48 not out off in 34 balls). Rutherfords's last over heroics with the bat ensured that Tigers win by 1 wicket and 3 balls remaining. Abbas Afridi Takes First Hattrick of Global T20 Canada 2023, Achieves Feat During Vancouver Knights vs Montreal Tigers Qualifier 2 Clash (Watch Video) Montreal Tigers will take on the Surrey Jaguars in the final clash of the tournament on Sunday at the TD Cricket Arena. After the Montreal Tigers won the toss and elected to field first, Vancouver Knights had a steady start to the innings despite losing Vritya Aravind (7) early. At the end of the powerplay, the Knights were 35/1. Mohammad Rizwan (39) and Corbin Bosch (36) built yet another essential partnership of 57 runs. Corbin Bosch looked threatening, clearing the ropes on three occasions. However, the momentum switched rapidly when the Knights lost four wickets in just as many balls. The innings went from 90/1 to 90/5 as Corbin Bosch triggered the collapse when he was scalped by Abbas Afridi. The very next delivery saw Abbas Afridi dismiss Rassie Van Der Dussen (0) followed by Najibullah Zadran (0), completing the bowler’s hat trick. The first ball of the next over saw Mohammad Rizwan (39) also dismissed by Ayaan Afzal Khan. Following this, Fabian Allen (10) was Abbas Afridi’s fifth victim of the day. In the death overs, Harsh Thaker (26) provided the Knights with a vital injection, with 17 runs coming off the final over. The Vancouver Knights finished at an above par score of 137/6. In response, the Tigers had an explosive start. Muhammad Waseem (13) struck two maximums in the first over before he was dismissed by Corbin Bosch. Chris Lynn (7), Srimantha Wijeyeratne (6) and Dilpreet Singh (2) followed soon after. At the end of the powerplay, the Tigers were struggling at 37/4. Dipendra Singh Airee (25) and Sherfane Rutherford (48 not out) came together to stabilise the run chase, putting on a 43-run partnership. Andre Russel (17) came out with intent and struck three boundaries in eleven deliveries, before he was Junaid Siddique's second wicket of the day. Team India Cricket Players Visit Indian High Commission in Guyana Ahead of IND vs WI 2nd T20I 2023 (See Pics) With five overs remaining the Tigers needed 46 runs from 30 balls. Carlos Braithwaite (1) failed to make an impact leaving the onus on Rutherford. Aayan Afzal Khan (18) chipped in with a breezy knock, before Junaid Siddique took two more wickets in the nineteenth over. With 15 runs needed off the last over, and only a wicket in hand, a composed Sherfane Rutherford launched Rayyan Pathan for three consecutive sixes to earn the Tigers a sensational victory. Brief Scores: Vancouver Knights 137/6 in 20 overs, (Mohammed Rizwan 39, Corbin Bosch 36; Abbas Afridi 5/25, Ayaan Afzal Khan 1/30 ) lost to Montreal Tigers 141/9 in 19.3 overs (Sherfane Rutherford 48 not out, Dipendra Singh Airee 25, Junaid Siddique 4-22, Fabian Allen 2-15, Corbin Bosch 2-18) by 1 wicket (The above story first appeared on LatestLY on Aug 06, 2023 10:56 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-08-06 05:26:26","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 2nd T20I 2023, Guyana Weather & Pitch Report: आज गुयाना में खेला जाएगा भारत बनाम वेस्टइंडीज दूसरे टी20 मुकाबला, जानें कैसी रहेगी प्रोविडेंस स्टेडियम में मौसम और पिच का हाल","link":"https://hindi.latestly.com/sports/cricket/today-india-vs-west-indies-second-t20-match-will-be-played-in-guyana-know-how-will-be-the-condition-of-weather-and-pitch-at-providence-stadium-1887675.html","keywords":null,"creator":null,"video_url":null,"description":"भारत बनाम वेस्टइंडीज दूसरा टी20 मैच देखना चाहते हैं उनके लिए आगामी मैच के लिए मौसम अच्छा लग रहा है. मौसम विशेषज्ञों के अनुसार, दूसरे टी20 मैच के लिए मौसम मिश्रित रहने की संभावना है, जिसमें कुछ बादल छाए रहेंगे, सुबह की बारिश होगी. हालांकि दिन में धूप रहेगी और अधिकतम तापमान 32 डिग्री सेल्सियस के आसपास रहने की उम्मीद है, 0-7 प्रतिशत वर्षा की चांस है. इतने कम वर्षा प्रतिशत के साथ, एक पूर्ण मैच की उम्मीद की जा सकती है.","content":"IND vs WI 2nd T20I 2023, Guyana Weather & Pitch Report: वेस्टइंडीज के खिलाफ सीरीज के पहले टी20 मैच चार रन से हारने के बाद भारतीय टीम वापसी कर सीरीज 1-1 से बराबर करना चाहेगी. 6 अगस्त (रविवार) को पांच मैचों की श्रृंसीरीज के दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में खेला जाएगा. वेस्टइंडीज ने पहले टी20 मैच में टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया और कुल 149/6 का स्कोर बनाया. रोवमॉल पॉवेल ने 32 गेंदों पर 48 रनों की महत्वपूर्ण पारी खेली जिसमें तीन चौके और तीन छक्के लगाए थे. उन्होंने वेस्टइंडीज को एक सम्मानजनक स्कोर तक पहुंचाया, जिसमें निकोलस पूरन (34 गेंदों पर 41 रन) ने भी बल्ले से योगदान दिया. यह भी पढ़ें: आज वेस्टइंडीज के खिलाफ दूसरे टी20 में जीत के साथ वापसी करने उतरेगी भारतीय टीम, मैच से पहले जानें संभावित प्लेइंग XI, हेड टू हेड और स्ट्रीमिंग समेत सभी डिटेल्स भारत के लिए गेंदबाज युजवेंद्र चहल और कुलदीप यादव ने दो-दो विकेट हासिल किए. 150 रनों का पीछा करने उतरी भारत की शुरुआत अच्छी रही लेकिन नियमित अंतराल पर विकेट गिरने से वह लक्ष्य से चार रन पीछे रह गई. जब भारत के लिए बल्ले से योगदान देने की बात आई, तो केवल डेब्यू करने वाले तिलक वर्मा ने शानदार प्रदर्शन किया और 22 गेंदों में दो चौकों और तीन छक्कों की मदद से 39 रन बनाए. जॉर्जटाउन की मौसम रिपोर्ट( Guyana Weather Report) भारतीय क्रिकेट फैंस के लिए अच्छी खबर है, जो भारत बनाम वेस्टइंडीज दूसरा टी20 मैच देखना चाहते हैं उनके लिए आगामी मैच के लिए मौसम अच्छा लग रहा है. मौसम विशेषज्ञों के अनुसार, दूसरे टी20 मैच के लिए मौसम मिश्रित रहने की संभावना है, जिसमें कुछ बादल छाए रहेंगे, सुबह की बारिश होगी. हालांकि दिन में धूप रहेगी और अधिकतम तापमान 32 डिग्री सेल्सियस के आसपास रहने की उम्मीद है, 0-7 प्रतिशत वर्षा की चांस है. इतने कम वर्षा प्रतिशत के साथ, एक पूर्ण मैच की उम्मीद की जा सकती है. प्रोविडेंस स्टेडियम की पिच रिपोर्ट( Guyana Pitch Report) यह एक ऐसा स्थान है जहां कई कम स्कोर वाले मैच देखने को मिले हैं. तेज गेंदबाजों ने इस स्थान पर गेंदबाजी का आनंद लिया है, पहली पारी का औसत स्कोर 123 है. चूंकि ट्रैक थोड़ा धीमा है, इससे स्पिनरों को मदद मिलती है. इस प्रकार मैच आगे बढ़ने के साथ रन बनाना कठिन हो जाता है. हालाँकि, सबसे हालिया ट्वेंटी-ट्वेंटी मुकाबले में एक टीम ने 150 का पीछा पूरा किया. इसलिए, यह साबित होता है कि इस स्थान पर लक्ष्य का पीछा करने वाली टीमें फायदे में हो सकती हैं.","pubDate":"2023-08-06 05:25:03","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Top AFL journalist Caroline Wilson blames Matildas' 'secrecy' and stage-managed interviews as she says World Cup hasn't lived up to its potential in Australia","link":"https://www.dailymail.co.uk/sport/football/article-12377455/Caroline-Wilson-Matildas-World-Cup-big-mark-Australia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Caroline Wilson believes that despite some thrilling games the Women's World Cup hasn't made a huge impact in Australia, and blames the element of 'secrecy' around the Matildas.","content":"Top AFL journalist Caroline Wilson blames Matildas' 'secrecy' and stage-managed treatment of stars as she says World Cup hasn't captured the imagination of Aussies Reporter complains about secrecy around Matildas Says Australians can't get to know the players Described team's media management as 'extraordinary' By James Cooney For Daily Mail Australia Updated: 05:57 BST, 6 August 2023 e-mail View comments Top footy reporter Caroline Wilson believes that despite some thrilling games the Women's World Cup hasn't made a huge impact in Australia - and she blames the 'secrecy' surrounding the Matildas. The Matildas stormed into the tournament's round of 16 on Monday after hammering reigning Olympic champions Canada 4-0 last week. On Monday, Sydney will turn green and gold as the Aussie team takes on Denmark in front of a sellout crowd of about 80,000 fans. Superstar Sam Kerr didn't play in the group stage after injuring her left calf on the eve of the tournament, but she's set to be unleashed against Denmark after the team kept fans in the dark about the complaint in order not to give their rivals an edge. Wilson was sharply critical of how the team has handled itself and its stars in a TV appearance on Sunday morning. Caroline Wilson has complained about the 'secrecy' surrounding the Matildas at their home World Cup, blaming it for the tournament failing to live up to its potential Wilson says there's so many other great stars in the side besides Sam Kerr (pictured at training) but the public can't get to know them because they aren't allowed to give interviews 'I have to be brutal, I don't (think the tournament is cutting through),' she told the ABC's Offsiders program. 'Certainly when the Matildas win - and the games have been unbelievable, don't get me wrong - but I don't feel I know the Matildas any better now than I did a few weeks ago. 'The whole campaign was built around Sam Kerr. There was the shock of her not playing. 'There's so many other brilliant players in the team, but because you're not allowed to give interviews and they are heavily media managed... 'There is an element of secrecy. I understand this is World Cups. You don't see it in Olympic Games or certainly not in the football code I cover [AFL]. You don't see it as Wimbledon or the British Open Golf. 'It's quite extraordinary. I just want to get to know my team better.' Football commentator Simon Hill responded to Wilson's complaints, arguing that the way the Matildas are managed is part of 'the culture' of a World Cup - and that players are micro managed and protected because the world's media are trying to all get access to them. Despite the sell-out crowds and huge TV ratings, the World Cup has attracted criticism in Australia because the vast majority of games have only been available to Optus subscribers. Wilson said there is an element of secrecy around the Matildas making it hard to know them Simon Hill suggested that players are micro managed because it's the culture of a World Cup SBS commentator Lucy Zelic said it was 'baffling' that such an enormous sporting event had so few football matches available to the public on free-to-air TV. Optus have defended the decision to keep most of the matches behind a paywall. 'Broadcaster rights fees are key to ensuring the continued growth and equality of women's sport, and contribute to everything from grassroots momentum to salaries for our national players,' a spokesperson told news.com.au. 'This is enabled by matches being broadcast across a combination of free and paid environments which is normal across the sports landscape. 'For example, viewers from the previous host nation of the FIFA Women's World Cup 2019 viewed most games behind a paywall in France, and the majority of games for the most recent major world sports event hosted in Australia,' the Optus representative continued. 'The 2022 Men's Cricket T20 World Cup (was) behind a paywall on Foxtel/Kayo, as well as for most major domestic sports in Australia, such as AFL, NRL and cricket.' Actual ticket sales for the tournament have been outstanding, with Football Australia announcing before the tournament that more than 1.5 million had been sold - establishing a new benchmark for any FIFA Women's World Cup event. Australia has contributed more than 1.1 million of the total ticket sales, showing the booming interest in women's football Down Under. Share or comment on this article: Top AFL journalist Caroline Wilson blames Matildas' 'secrecy' and stage-managed interviews as she says World Cup hasn't lived up to its potential in Australia e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-06 04:57:19","image_url":"https://i.dailymail.co.uk/1s/2023/08/06/05/74008993-0-image-a-50_1691295519164.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs WI 2nd T20 Pitch Report: गुयाना में बल्लेबाजों के लिए रन बनाना होगा मुश्किल, जानें कैसा है पिच का हाल, क्या कहते हैं आंकड़े","link":"https://hindi.latestly.com/sports/cricket/ind-vs-wi-2nd-t20-pitch-report-it-will-be-difficult-for-batsmen-to-score-runs-in-guyana-know-how-the-pitch-is-what-the-figures-say-1887658.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम ने सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी.","content":"IND vs WI 2nd T20 Pitch Report: भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी. वहीं भारतीय टीम को दूसरा मुक़ाबला जीतना महत्वपूर्ण है क्योंकि पहले मुक़ाबले में टीम इंडिया को एक नजदीकी मुक़ाबले में हार का सामना करना पड़ा था. ऐसे में दूसरे मुक़ाबले में बल्लेबाजों से बेहतर प्रदर्शन की उम्मीद है. बता दें की T20 सीरीज का दूसरा मुक़ाबला गुयाना के प्रोविडेंस स्टेडियम में खेला जाएगा. ऐसे में चलिए जानते हैं कैसी है यहां की पिच का हाल और क्या कहते हैं आंकड़े. यह भी पढ़ें: Big Blow to Australia! ऑस्ट्रेलिया को लगा बड़ा झटका, कप्तान पैट कमिंस आईसीसी क्रिकेट विश्व कप से पहले भारतीय दौरे से हुए बाहर गुयाना की पिच किसके लिए मददगार है गुयाना की पिच तेज गेंदबाजों के लिए मददगार साबित होती है. हाला की मैच जीतना आगे बढ़त है स्पिनर्स भी अपना रोले निभाते है. इस मैदान पर आज तक टी20 अंतराष्ट्रीय मुकाबले में किसी भी पारी में 200 रन नहीं बने है. इससे अंदाजा लगाया जा सकता है कि बल्लेबाजों के लिए कैसी होगी यह पिच. यहां अभी तक 27 अंतराष्ट्रीय टी20 मैच खेले गए हैं जिसमें 13 बार पहले बल्लेबाजी करने वाली टीम ने जीत हासिल की है तो वहीं 10 मैचों में लक्ष्य का पीछा करने वाली टीम ने जीत हासिल की है. इस मैदान पर टॉस जीतने वाली टीम पहले गेंदबाजी करने का फैसला कर सकती है. पहली पारी का औसत स्कोर इस मैदान पर 156 है. हाला की भारतीय बल्लेबाज जिस फॉर्म से गुजर रहे हैं, उसे देखते हुए अगर टीम इंडिया पहले गेंदबाज़ी करती है तो गेंदबाजों को मेजबान टीम को कम स्कोर पर रोकना होगा . बता दें की मुकेश कुमार पहले मुकाबले में विकेट तो हासिल नहीं कर पाए थे लेकिन डेथ ओवर्स में उन्होंने काफी किफायती गेंदबाजी से सबको प्रभावित किया था. अर्शदीप ने भी आखिरी ओवर में विकेट निकाले थे और रन भी बचाए थे . चहल और कुलदीप इस मैच में एक अहम भूमिका निभा सकतें हैं. टी20 सीरीज के लिए भारत और वेस्टइंडीज की टीम भारत : शुभमन गिल, ईशान किशन (विकेटकीपर), सूर्यकुमार यादव, तिलक वर्मा, हार्दिक पंड्या (कप्तान), संजू सैमसन, अक्षर पटेल, कुलदीप यादव, युजवेंद्र चहल, अर्शदीप सिंह और मुकेश कुमार. वेस्टइंडीज : काइल मेयर्स, ब्रैंडन किंग, जॉनसन चार्ल्स, निकोलस पूरन (विकेटकीपर), शिमरन हेटमायर, रोवमैन पॉवेल (कप्तान), जेसन होल्डर, रोमारियो शेफर्ड, अकील होसेन, अल्जारी जोसेफ और ओबेद मैकॉय.","pubDate":"2023-08-06 04:56:36","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rohit Sharma To Launch Cricket Academy In USA: देश से बाहर अमेरिका में क्रिकेट अकादमी खोलेंगे भारतीय कप्तान रोहित शर्मा, जल्द लॉन्च होगी क्रिकिंगडम","link":"https://hindi.latestly.com/socially/sports/cricket/indian-captain-rohit-sharma-will-open-cricket-academy-outside-the-country-in-america-cricketing-kingdom-will-be-launched-soon-1887663.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय कप्तान के स्वामित्व वाली क्रिकेट अकादमी दुनिया की सबसे बड़ी क्रिकेट अकादमी में से एकहोगी. क्रिकिंगडम भारत में अच्छी तरह से फैला हुआ है. धीरे-धीरे देश के बाहर अपनी जड़ें विकसित कर रहा है.","content":"संयुक्त राज्य अमेरिका (USA) में रोहित शर्मा अपनी क्रिकेट अकादमी 'क्रिकिंगडम' लॉन्च करने के लिए पूरी तरह तैयार हैं. भारतीय कप्तान के स्वामित्व वाली क्रिकेट अकादमी दुनिया की सबसे बड़ी क्रिकेट अकादमी में से एकहोगी. क्रिकिंगडम भारत में अच्छी तरह से फैला हुआ है. धीरे-धीरे देश के बाहर अपनी जड़ें विकसित कर रहा है. ट्वीट देखें: Crickingdom Cricket Academy! 💥 Rohit Sharma is going to launch his Cricket Academy in USA. 👏😍 #RohitSharma #cricket pic.twitter.com/KB11C9CMbp — 12th Khiladi (@12th_khiladi) August 5, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-06 04:43:36","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 2nd T20 Pitch Report: गुयाना में बल्लेबाज़ों के लिए रन बनाना होगा मुस्खिल, जानें कैसा है पिच का हाल, क्या कहते हैं आंकड़े","link":"https://hindi.latestly.com/sports/cricket/ind-vs-wi-2nd-t20-pitch-report-it-will-be-difficult-for-the-batsmen-to-score-runs-in-guyana-know-how-the-pitch-is-what-the-figures-say-1887658.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम ने सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी.","content":"IND vs WI 2nd T20 Pitch Report: भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम ने सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी. वहीं भारतीय टीम को दूसरा मुक़ाबला जीतना महत्वपूर्ण है क्योंकि पहले मुक़ाबले में टीम इंडिया को एक नजदीकी मुक़ाबले में हार का सामना करना पड़ा था. ऐसे में दूसरे मुक़ाबले में टीम से बेहतर प्रदर्शन की उम्मीद है. बता दें की T20 सीरीज का दूसरा मुक़ाबला गुयाना के प्रोविडेंस स्टेडियम में खेला जाएगा. ऐसे में चलिए जानते हैं कैसी है यहां की पिच का हाल और क्या कहते हैं आंकड़े. यह भी पढ़ें: Big Blow to Australia! ऑस्ट्रेलिया को लगा बड़ा झटका, कप्तान पैट कमिंस आईसीसी क्रिकेट विश्व कप से पहले भारतीय दौरे से हुए बाहर गुयाना की पिच किसके लिए मददगार है गुयाना की पिच तेज गेंदबाजों के लिए मददगार साबित होती है गेंद को दोनों तरफ स्विंग करा सकते हैं और मैच जीतना आगे बढ़त है स्पिनर्स भी अपना रोले निभाते है. इस मैदान पर आज तक टी20 इंटरनेशनल मुकाबले में किसी भी पारी में 200 रन नहीं बने. इससे अंदाजा लगाया जा सकता है कि बल्लेबाजों के लिए कैसी होगी यह पिच. यहां अभी तक 27 अंतराष्ट्रीय टी20 मैच खेले गए हैं जिसमें 13 बार पहले बल्लेबाजी करने वाली टीम ने जीत हासिल की है तो वहीं 10 मैचों में लक्ष्य का पीछा करने वाली टीम ने जीत हासिल की है. टॉस जीतने वाली टीमें पहले गेंदबाजी करने का फैसला कर सकती है. पहली पारी का औसत स्कोर 156 है. 150 का लक्ष्य इस मैदान पर डिफेंडबल हो सकता है. हाला की भारतीय बल्लेबाज जिस फॉर्म से गुजर रहे हैं, उसे देखते अगर टीम इंडिया पहले गेंदबाज़ी करती है तो गेंदबाजों को मेजबान टीम को कम स्कोर पर रोकना की कोशिश करना होगा . मुकेश कुमार पहले मुकाबले में विकेट तो हासिल नहीं कर पाए थे लेकिन डेथ ओवर्स में उन्होंने काफी किफायती गेंदबाजी से सबको प्रभावित किया. अर्शदीप ने भी आखिरी ओवर में विकेट निकाले और रन भी बचाए. चहल और कुलदीप इस मैच में एक अहम भूमिका निभा सकतें हैं. टी20 सीरीज के लिए भारत और वेस्टइंडीज की टीम वेस्टइंडीज : काइल मेयर्स, ब्रैंडन किंग, जॉनसन चार्ल्स, निकोलस पूरन (विकेटकीपर), शिमरन हेटमायर, रोवमैन पॉवेल (कप्तान), जेसन होल्डर, रोमारियो शेफर्ड, अकील होसेन, अल्जारी जोसेफ और ओबेद मैकॉय. भारत : शुभमन गिल, ईशान किशन (विकेटकीपर), सूर्यकुमार यादव, तिलक वर्मा, हार्दिक पंड्या (कप्तान), संजू सैमसन, अक्षर पटेल, कुलदीप यादव, युजवेंद्र चहल, अर्शदीप सिंह और मुकेश कुमार.","pubDate":"2023-08-06 04:35:26","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Big Blow to Australia! ऑस्ट्रेलिया को लगा बड़ा झटका, कप्तान पैट कमिंस आईसीसी क्रिकेट विश्व कप से पहले भारतीय दौरे से हुए बाहर","link":"https://hindi.latestly.com/socially/sports/cricket/big-blow-to-australia-captain-pat-cummins-ruled-out-of-indian-tour-before-icc-cricket-world-cup-1887653.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के कप्तान पैट कमिंस कलाई की चोट के कारण भारत के खिलाफ वनडे सीरीज से चूक सकते हैं. ऑस्ट्रेलियाई टीम को 22 सितंबर से भारत में तीन मैचों की एकदिवसीय श्रृंखला के लिए भारत का सामना करेगी.","content":"भारत के खिलाफ वनडे सीरीज से पहले ऑस्ट्रेलियाई क्रिकेट टीम को बड़ा झटका लगा है. ऑस्ट्रेलिया के कप्तान पैट कमिंस कलाई की चोट के कारण भारत के खिलाफ वनडे सीरीज से चूक सकते हैं. ऑस्ट्रेलियाई टीम को 22 सितंबर से भारत में तीन मैचों की एकदिवसीय श्रृंखला के लिए भारत का सामना करेगी. ट्वीट देखें: Pat Cummins could miss the 3 match ODI series against India next month due to a wrist injury. pic.twitter.com/n1ApOg2rPg — Mufaddal Vohra (@mufaddal_vohra) August 5, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-06 04:21:49","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Cyclists debut strong at Commonwealth Youth Games","link":"https://www.fbcnews.com.fj/sports/cyclists-debut-strong-at-commonwealth-youth-games/","keywords":["Sports"],"creator":["Nitesh Raniga"],"video_url":null,"description":"Fiji’s emerging cyclers, Don Younger and Aiden Caine, made their first appearance at the Commonwealth Youth Games in Trinidad and Tobago today. In a spirited performance, Younger clinched the 25th position with a timing of 23.37.15 seconds, while Caine secured the 28th spot, completing the men’s individual trial at the Brian Lara Cricket Stadium in […]","content":"Fiji’s emerging cyclers, Don Younger and Aiden Caine, made their first appearance at the Commonwealth Youth Games in Trinidad and Tobago today. In a spirited performance, Younger clinched the 25th position with a timing of 23.37.15 seconds, while Caine secured the 28th spot, completing the men’s individual trial at the Brian Lara Cricket Stadium in 28.2.38 seconds. A team of 36 athletes are representing Fiji across multiple disciplines including cycling, 7s rugby, swimming, athletics, and triathlon. Chef de Mission of Team Fiji Kelvin Yee expressed unwavering determination as he articulated the squad’s ambitious goal of clinching medals. The Commonwealth Youth Games will be held over eight days and it will conclude on Friday.","pubDate":"2023-08-06 04:05:30","image_url":null,"source_id":"fbcnews","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"\"Last I Played Was In IPL\": Chahal Opens Up On Frequent Team India Drops","link":"https://sports.ndtv.com/cricket/last-i-played-was-in-ipl-yuzvendra-chahal-opens-up-on-frequent-drops-from-indian-team-4273232","keywords":null,"creator":null,"video_url":null,"description":"Yuzvendra Chahal wasn't picked in any of the three ODIs against West Indies but was part of the 1st T20I.","content":"One of India's finest spinners in white-ball cricket, Yuzvedra Chahal, hasn't found breaking into the Indian playing XI easy of late. Though Chahal has been a part of most of India's white-ball assignments, more often than not, only one of him and Kuldeep Yadav has managed to break into the team. While there's been plenty of chatter over Chahal's non-selection in certain matches, the wrist-spinner isn't bothered by his lack of game-time at all. When asked about the frequent snubs, Chahal gave reporters a firm response, suggesting cricket is a team game, unlike chess. \"Team combination is our priority and it is not something new,\" Chahal told reporters of the second T20I against West Indies. \"At 7 we generally play Ravindra Jadeja or Axar Patel . Three spinners can only play if the wickets are spin friendly. Kuldeep is bowling really well, he is in a great rhythm and that's why team is backing him. I keep working on nets so that whenever I get the chance I will grab it. \"I've not been playing in the last two-three series. Previously you would have seen me playing in England or West Indies and Kuldeep (Yadav) was not playing then.\" Chahal didn't get a go in the Indian team in any of the three ODIs against West Indies but found a spot for himself in the first T20I. The veteran spinner said that he is very happy to be wearing the Indian jersey, whether as part of the playing XI or one of the 15 members of the squad picked for the tour. \"We are professional cricketers. I was playing after two months, last I played was in the IPL. It is all about the preparation. This is not an individual sport, you are playing here for your team. There are times when players has to sit out for two series, so it doesn't mean that they are not part of the team. \"I am very happy that I am getting to wear the blue jersey every day. I am not sitting at home. I am travelling with the team. I am part of the team. I have played chess, it is an individual game but cricket is a team sport. Out of fifteen people in the squad only eleven can play. In the past few series, when I was playing Kuldeep was not getting the chances,\" he explained.","pubDate":"2023-08-06 04:04:19","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 2nd T20 2023 Dream11 Prediction: आज दूसरे टी20 में वेस्टइंडीज से भिड़ेगी भारतीय टीम, यहां जानें कैसे चुने बेस्ट फैंटसी प्लेइंग इलेवन","link":"https://hindi.latestly.com/sports/cricket/indian-team-will-take-on-west-indies-in-second-t20-today-know-here-how-to-choose-best-fantasy-playing-xi-1887721.html","keywords":null,"creator":null,"video_url":null,"description":"IND बनाम WI ड्रीम 11 फैंटेसी टीम के कप्तान के रूप में ईशान किशन(IND) को जबकि ब्रैंडन किंग(WI) को उप-कप्तान के रूप में चुना जा सकता है.","content":"IND vs WI 2nd T20 2023 Dream11 Prediction: 6 अगस्त (रविवार) को भारत और वेस्टइंडीज गुयाना के प्रोविडेंस स्टेडियम में पांच मैचों की टी20 सीरीज के दूसरे मैच में एक्शन में होंगे. दोनों टीमों ने पहले टी20 मैच में अपना सब कुछ झोंक दिया था. प्रशंसकों को रोमांचक क्रिकेट देखने को मिला. मैच बिल्कुल ख़राब हो गया लेकिन रोवमैन पॉवेल एंड कंपनी ने धैर्य बनाए रखते हुए गेम को चार विकेट से जीत लिया. जेसन होल्डर को उनके सनसनीखेज गेंदबाजी प्रदर्शन के लिए प्लेयर ऑफ द मैच चुना गया. यह भी पढ़ें: गुयाना में खेला जाएगा वेस्टइंडीज बनाम भारत दूसरे टी20 मैच, यहां जानें दोनों टीमों का संभावित प्लेइंग इलेवन भारत आगामी मुकाबले में विशेषकर बल्लेबाजी विभाग में सुधार करना चाहेगा, मेन इन ब्लू पहले टी20ई में 150 के लक्ष्य का पीछा करने में असमर्थ रहे और टीम मैनेजमेंट को बल्लेबाजों से बेहतर प्रदर्शन की उम्मीद होगी. हार्दिक पंड्या एंड कंपनी रविवार को होने वाले मुकाबले में संपूर्ण प्रदर्शन करने और सीरीज बराबर करने के लिए उत्सुक होगी. यह भी पढ़ें: आज गुयाना में खेला जाएगा भारत बनाम वेस्टइंडीज दूसरे टी20 मुकाबला, जानें कैसी रहेगी प्रोविडेंस स्टेडियम में मौसम और पिच का हाल दूसरी ओर, वेस्टइंडीज इस प्रतियोगिता में पूरे जोश के साथ उतरेगी, जिसने सितारों से सजी भारतीय टीम के खिलाफ शानदार गेंदबाजी का प्रदर्शन कर रही है. वे उसी प्रदर्शन को दोहराकर सीरीज में 2-0 से बढ़त हासिल करना चाहेंगे, हालाँकि, कैरेबियाई टीम चाहेगी कि मेहमान उन पर कड़ा प्रहार करें और इस प्रकार, उन्हें सभी विभागों में अपना सर्वश्रेष्ठ प्रदर्शन करने की आवश्यकता होगी. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: विकेटकीपर - ईशान किशन (IND), शाई होप (WI) को IND बनाम WI फैंटसी टीम के लिए विकेट-कीपर के रूप में हमारी पसंद हो सकते हैं. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: बल्लेबाज - बल्लेबाजी में भारी ड्रीम 11 फैंटसी टीम में ब्रैंडन किंग(WI), शुभमन गिल (IND), तिलक वर्मा(IND) को IND बनाम WI ड्रीम 11 टीम में चुना जा सकता है. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: ऑलराउंडर - हम तीन ऑलराउंडर हार्दिक पंड्या(IND), रोमारियो शेफर्ड(WI), काइल मेयर्स(WI) को IND बनाम WI फैंटसी टीम में चुना जा सकता है. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: गेंदबाज -याजुवेंद्र चहल (IND), कुलदीप यादव (IND), गुडाकेश मोती(WI) को IND बनाम WI ड्रीम 11 फैंटसी टीम में अकेले गेंदबाज हो सकते हैं. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: ईशान किशन (IND), शाई होप (WI), ब्रैंडन किंग(WI), शुभमन गिल (IND), तिलक वर्मा(IND), हार्दिक पंड्या(IND), रोमारियो शेफर्ड(WI), काइल मेयर्स(WI), याजुवेंद्र चहल(IND), कुलदीप यादव (IND), गुडाकेश मोती(WI) IND बनाम WI ड्रीम 11 फैंटेसी टीम के कप्तान के रूप में ईशान किशन(IND) को जबकि ब्रैंडन किंग(WI) को उप-कप्तान के रूप में चुना जा सकता है.","pubDate":"2023-08-06 06:16:22","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Global T20 Canada 2023: Montreal Tigers Beat Vancouver Knights by 1 Wicket, to Face Surrey Jaguars in Final","link":"https://www.latestly.com/sports/cricket/global-t20-canada-2023-montreal-tigers-beat-vancouver-knights-by-1-wicket-to-face-surrey-jaguars-in-final-5320390.html","keywords":null,"creator":null,"video_url":null,"description":"Montreal Tigers defeated Vancouver Knights by one wicket in Qualifier 2 to reach the final of Global T20 Canada, here.","content":"Brampton, August 6 : Montreal Tigers defeated Vancouver Knights by one wicket in Qualifier 2 to reach the final of Global T20 Canada, here. The star performers for Montreal Tigers were Abbas Afridi (5/29) who picked up five wickets, including a hattrick and Sherfane Rutherfords (48 not out off in 34 balls). Rutherfords's last over heroics with the bat ensured that Tigers win by 1 wicket and 3 balls remaining. Abbas Afridi Takes First Hattrick of Global T20 Canada 2023, Achieves Feat During Vancouver Knights vs Montreal Tigers Qualifier 2 Clash (Watch Video) Montreal Tigers will take on the Surrey Jaguars in the final clash of the tournament on Sunday at the TD Cricket Arena. After the Montreal Tigers won the toss and elected to field first, Vancouver Knights had a steady start to the innings despite losing Vritya Aravind (7) early. At the end of the powerplay, the Knights were 35/1. Mohammad Rizwan (39) and Corbin Bosch (36) built yet another essential partnership of 57 runs. Corbin Bosch looked threatening, clearing the ropes on three occasions. However, the momentum switched rapidly when the Knights lost four wickets in just as many balls. The innings went from 90/1 to 90/5 as Corbin Bosch triggered the collapse when he was scalped by Abbas Afridi. The very next delivery saw Abbas Afridi dismiss Rassie Van Der Dussen (0) followed by Najibullah Zadran (0), completing the bowler’s hat trick. The first ball of the next over saw Mohammad Rizwan (39) also dismissed by Ayaan Afzal Khan. Following this, Fabian Allen (10) was Abbas Afridi’s fifth victim of the day. In the death overs, Harsh Thaker (26) provided the Knights with a vital injection, with 17 runs coming off the final over. The Vancouver Knights finished at an above par score of 137/6. In response, the Tigers had an explosive start. Muhammad Waseem (13) struck two maximums in the first over before he was dismissed by Corbin Bosch. Chris Lynn (7), Srimantha Wijeyeratne (6) and Dilpreet Singh (2) followed soon after. At the end of the powerplay, the Tigers were struggling at 37/4. Dipendra Singh Airee (25) and Sherfane Rutherford (48 not out) came together to stabilise the run chase, putting on a 43-run partnership. Andre Russel (17) came out with intent and struck three boundaries in eleven deliveries, before he was Junaid Siddique's second wicket of the day. Team India Cricket Players Visit Indian High Commission in Guyana Ahead of IND vs WI 2nd T20I 2023 (See Pics) With five overs remaining the Tigers needed 46 runs from 30 balls. Carlos Braithwaite (1) failed to make an impact leaving the onus on Rutherford. Aayan Afzal Khan (18) chipped in with a breezy knock, before Junaid Siddique took two more wickets in the nineteenth over. With 15 runs needed off the last over, and only a wicket in hand, a composed Sherfane Rutherford launched Rayyan Pathan for three consecutive sixes to earn the Tigers a sensational victory. Brief Scores: Vancouver Knights 137/6 in 20 overs, (Mohammed Rizwan 39, Corbin Bosch 36; Abbas Afridi 5/25, Ayaan Afzal Khan 1/30 ) lost to Montreal Tigers 141/9 in 19.3 overs (Sherfane Rutherford 48 not out, Dipendra Singh Airee 25, Junaid Siddique 4-22, Fabian Allen 2-15, Corbin Bosch 2-18) by 1 wicket (The above story first appeared on LatestLY on Aug 06, 2023 10:56 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-08-06 05:26:26","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 2nd T20I 2023, Guyana Weather & Pitch Report: आज गुयाना में खेला जाएगा भारत बनाम वेस्टइंडीज दूसरे टी20 मुकाबला, जानें कैसी रहेगी प्रोविडेंस स्टेडियम में मौसम और पिच का हाल","link":"https://hindi.latestly.com/sports/cricket/today-india-vs-west-indies-second-t20-match-will-be-played-in-guyana-know-how-will-be-the-condition-of-weather-and-pitch-at-providence-stadium-1887675.html","keywords":null,"creator":null,"video_url":null,"description":"भारत बनाम वेस्टइंडीज दूसरा टी20 मैच देखना चाहते हैं उनके लिए आगामी मैच के लिए मौसम अच्छा लग रहा है. मौसम विशेषज्ञों के अनुसार, दूसरे टी20 मैच के लिए मौसम मिश्रित रहने की संभावना है, जिसमें कुछ बादल छाए रहेंगे, सुबह की बारिश होगी. हालांकि दिन में धूप रहेगी और अधिकतम तापमान 32 डिग्री सेल्सियस के आसपास रहने की उम्मीद है, 0-7 प्रतिशत वर्षा की चांस है. इतने कम वर्षा प्रतिशत के साथ, एक पूर्ण मैच की उम्मीद की जा सकती है.","content":"IND vs WI 2nd T20I 2023, Guyana Weather & Pitch Report: वेस्टइंडीज के खिलाफ सीरीज के पहले टी20 मैच चार रन से हारने के बाद भारतीय टीम वापसी कर सीरीज 1-1 से बराबर करना चाहेगी. 6 अगस्त (रविवार) को पांच मैचों की श्रृंसीरीज के दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में खेला जाएगा. वेस्टइंडीज ने पहले टी20 मैच में टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया और कुल 149/6 का स्कोर बनाया. रोवमॉल पॉवेल ने 32 गेंदों पर 48 रनों की महत्वपूर्ण पारी खेली जिसमें तीन चौके और तीन छक्के लगाए थे. उन्होंने वेस्टइंडीज को एक सम्मानजनक स्कोर तक पहुंचाया, जिसमें निकोलस पूरन (34 गेंदों पर 41 रन) ने भी बल्ले से योगदान दिया. यह भी पढ़ें: आज वेस्टइंडीज के खिलाफ दूसरे टी20 में जीत के साथ वापसी करने उतरेगी भारतीय टीम, मैच से पहले जानें संभावित प्लेइंग XI, हेड टू हेड और स्ट्रीमिंग समेत सभी डिटेल्स भारत के लिए गेंदबाज युजवेंद्र चहल और कुलदीप यादव ने दो-दो विकेट हासिल किए. 150 रनों का पीछा करने उतरी भारत की शुरुआत अच्छी रही लेकिन नियमित अंतराल पर विकेट गिरने से वह लक्ष्य से चार रन पीछे रह गई. जब भारत के लिए बल्ले से योगदान देने की बात आई, तो केवल डेब्यू करने वाले तिलक वर्मा ने शानदार प्रदर्शन किया और 22 गेंदों में दो चौकों और तीन छक्कों की मदद से 39 रन बनाए. जॉर्जटाउन की मौसम रिपोर्ट( Guyana Weather Report) भारतीय क्रिकेट फैंस के लिए अच्छी खबर है, जो भारत बनाम वेस्टइंडीज दूसरा टी20 मैच देखना चाहते हैं उनके लिए आगामी मैच के लिए मौसम अच्छा लग रहा है. मौसम विशेषज्ञों के अनुसार, दूसरे टी20 मैच के लिए मौसम मिश्रित रहने की संभावना है, जिसमें कुछ बादल छाए रहेंगे, सुबह की बारिश होगी. हालांकि दिन में धूप रहेगी और अधिकतम तापमान 32 डिग्री सेल्सियस के आसपास रहने की उम्मीद है, 0-7 प्रतिशत वर्षा की चांस है. इतने कम वर्षा प्रतिशत के साथ, एक पूर्ण मैच की उम्मीद की जा सकती है. प्रोविडेंस स्टेडियम की पिच रिपोर्ट( Guyana Pitch Report) यह एक ऐसा स्थान है जहां कई कम स्कोर वाले मैच देखने को मिले हैं. तेज गेंदबाजों ने इस स्थान पर गेंदबाजी का आनंद लिया है, पहली पारी का औसत स्कोर 123 है. चूंकि ट्रैक थोड़ा धीमा है, इससे स्पिनरों को मदद मिलती है. इस प्रकार मैच आगे बढ़ने के साथ रन बनाना कठिन हो जाता है. हालाँकि, सबसे हालिया ट्वेंटी-ट्वेंटी मुकाबले में एक टीम ने 150 का पीछा पूरा किया. इसलिए, यह साबित होता है कि इस स्थान पर लक्ष्य का पीछा करने वाली टीमें फायदे में हो सकती हैं.","pubDate":"2023-08-06 05:25:03","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Top AFL journalist Caroline Wilson blames Matildas' 'secrecy' and stage-managed interviews as she says World Cup hasn't lived up to its potential in Australia","link":"https://www.dailymail.co.uk/sport/football/article-12377455/Caroline-Wilson-Matildas-World-Cup-big-mark-Australia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Caroline Wilson believes that despite some thrilling games the Women's World Cup hasn't made a huge impact in Australia, and blames the element of 'secrecy' around the Matildas.","content":"Top AFL journalist Caroline Wilson blames Matildas' 'secrecy' and stage-managed treatment of stars as she says World Cup hasn't captured the imagination of Aussies Reporter complains about secrecy around Matildas Says Australians can't get to know the players Described team's media management as 'extraordinary' By James Cooney For Daily Mail Australia Updated: 05:57 BST, 6 August 2023 e-mail View comments Top footy reporter Caroline Wilson believes that despite some thrilling games the Women's World Cup hasn't made a huge impact in Australia - and she blames the 'secrecy' surrounding the Matildas. The Matildas stormed into the tournament's round of 16 on Monday after hammering reigning Olympic champions Canada 4-0 last week. On Monday, Sydney will turn green and gold as the Aussie team takes on Denmark in front of a sellout crowd of about 80,000 fans. Superstar Sam Kerr didn't play in the group stage after injuring her left calf on the eve of the tournament, but she's set to be unleashed against Denmark after the team kept fans in the dark about the complaint in order not to give their rivals an edge. Wilson was sharply critical of how the team has handled itself and its stars in a TV appearance on Sunday morning. Caroline Wilson has complained about the 'secrecy' surrounding the Matildas at their home World Cup, blaming it for the tournament failing to live up to its potential Wilson says there's so many other great stars in the side besides Sam Kerr (pictured at training) but the public can't get to know them because they aren't allowed to give interviews 'I have to be brutal, I don't (think the tournament is cutting through),' she told the ABC's Offsiders program. 'Certainly when the Matildas win - and the games have been unbelievable, don't get me wrong - but I don't feel I know the Matildas any better now than I did a few weeks ago. 'The whole campaign was built around Sam Kerr. There was the shock of her not playing. 'There's so many other brilliant players in the team, but because you're not allowed to give interviews and they are heavily media managed... 'There is an element of secrecy. I understand this is World Cups. You don't see it in Olympic Games or certainly not in the football code I cover [AFL]. You don't see it as Wimbledon or the British Open Golf. 'It's quite extraordinary. I just want to get to know my team better.' Football commentator Simon Hill responded to Wilson's complaints, arguing that the way the Matildas are managed is part of 'the culture' of a World Cup - and that players are micro managed and protected because the world's media are trying to all get access to them. Despite the sell-out crowds and huge TV ratings, the World Cup has attracted criticism in Australia because the vast majority of games have only been available to Optus subscribers. Wilson said there is an element of secrecy around the Matildas making it hard to know them Simon Hill suggested that players are micro managed because it's the culture of a World Cup SBS commentator Lucy Zelic said it was 'baffling' that such an enormous sporting event had so few football matches available to the public on free-to-air TV. Optus have defended the decision to keep most of the matches behind a paywall. 'Broadcaster rights fees are key to ensuring the continued growth and equality of women's sport, and contribute to everything from grassroots momentum to salaries for our national players,' a spokesperson told news.com.au. 'This is enabled by matches being broadcast across a combination of free and paid environments which is normal across the sports landscape. 'For example, viewers from the previous host nation of the FIFA Women's World Cup 2019 viewed most games behind a paywall in France, and the majority of games for the most recent major world sports event hosted in Australia,' the Optus representative continued. 'The 2022 Men's Cricket T20 World Cup (was) behind a paywall on Foxtel/Kayo, as well as for most major domestic sports in Australia, such as AFL, NRL and cricket.' Actual ticket sales for the tournament have been outstanding, with Football Australia announcing before the tournament that more than 1.5 million had been sold - establishing a new benchmark for any FIFA Women's World Cup event. Australia has contributed more than 1.1 million of the total ticket sales, showing the booming interest in women's football Down Under. Share or comment on this article: Top AFL journalist Caroline Wilson blames Matildas' 'secrecy' and stage-managed interviews as she says World Cup hasn't lived up to its potential in Australia e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-06 04:57:19","image_url":"https://i.dailymail.co.uk/1s/2023/08/06/05/74008993-0-image-a-50_1691295519164.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs WI 2nd T20 Pitch Report: गुयाना में बल्लेबाजों के लिए रन बनाना होगा मुश्किल, जानें कैसा है पिच का हाल, क्या कहते हैं आंकड़े","link":"https://hindi.latestly.com/sports/cricket/ind-vs-wi-2nd-t20-pitch-report-it-will-be-difficult-for-batsmen-to-score-runs-in-guyana-know-how-the-pitch-is-what-the-figures-say-1887658.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम ने सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी.","content":"IND vs WI 2nd T20 Pitch Report: भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी. वहीं भारतीय टीम को दूसरा मुक़ाबला जीतना महत्वपूर्ण है क्योंकि पहले मुक़ाबले में टीम इंडिया को एक नजदीकी मुक़ाबले में हार का सामना करना पड़ा था. ऐसे में दूसरे मुक़ाबले में बल्लेबाजों से बेहतर प्रदर्शन की उम्मीद है. बता दें की T20 सीरीज का दूसरा मुक़ाबला गुयाना के प्रोविडेंस स्टेडियम में खेला जाएगा. ऐसे में चलिए जानते हैं कैसी है यहां की पिच का हाल और क्या कहते हैं आंकड़े. यह भी पढ़ें: Big Blow to Australia! ऑस्ट्रेलिया को लगा बड़ा झटका, कप्तान पैट कमिंस आईसीसी क्रिकेट विश्व कप से पहले भारतीय दौरे से हुए बाहर गुयाना की पिच किसके लिए मददगार है गुयाना की पिच तेज गेंदबाजों के लिए मददगार साबित होती है. हाला की मैच जीतना आगे बढ़त है स्पिनर्स भी अपना रोले निभाते है. इस मैदान पर आज तक टी20 अंतराष्ट्रीय मुकाबले में किसी भी पारी में 200 रन नहीं बने है. इससे अंदाजा लगाया जा सकता है कि बल्लेबाजों के लिए कैसी होगी यह पिच. यहां अभी तक 27 अंतराष्ट्रीय टी20 मैच खेले गए हैं जिसमें 13 बार पहले बल्लेबाजी करने वाली टीम ने जीत हासिल की है तो वहीं 10 मैचों में लक्ष्य का पीछा करने वाली टीम ने जीत हासिल की है. इस मैदान पर टॉस जीतने वाली टीम पहले गेंदबाजी करने का फैसला कर सकती है. पहली पारी का औसत स्कोर इस मैदान पर 156 है. हाला की भारतीय बल्लेबाज जिस फॉर्म से गुजर रहे हैं, उसे देखते हुए अगर टीम इंडिया पहले गेंदबाज़ी करती है तो गेंदबाजों को मेजबान टीम को कम स्कोर पर रोकना होगा . बता दें की मुकेश कुमार पहले मुकाबले में विकेट तो हासिल नहीं कर पाए थे लेकिन डेथ ओवर्स में उन्होंने काफी किफायती गेंदबाजी से सबको प्रभावित किया था. अर्शदीप ने भी आखिरी ओवर में विकेट निकाले थे और रन भी बचाए थे . चहल और कुलदीप इस मैच में एक अहम भूमिका निभा सकतें हैं. टी20 सीरीज के लिए भारत और वेस्टइंडीज की टीम भारत : शुभमन गिल, ईशान किशन (विकेटकीपर), सूर्यकुमार यादव, तिलक वर्मा, हार्दिक पंड्या (कप्तान), संजू सैमसन, अक्षर पटेल, कुलदीप यादव, युजवेंद्र चहल, अर्शदीप सिंह और मुकेश कुमार. वेस्टइंडीज : काइल मेयर्स, ब्रैंडन किंग, जॉनसन चार्ल्स, निकोलस पूरन (विकेटकीपर), शिमरन हेटमायर, रोवमैन पॉवेल (कप्तान), जेसन होल्डर, रोमारियो शेफर्ड, अकील होसेन, अल्जारी जोसेफ और ओबेद मैकॉय.","pubDate":"2023-08-06 04:56:36","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rohit Sharma To Launch Cricket Academy In USA: देश से बाहर अमेरिका में क्रिकेट अकादमी खोलेंगे भारतीय कप्तान रोहित शर्मा, जल्द लॉन्च होगी क्रिकिंगडम","link":"https://hindi.latestly.com/socially/sports/cricket/indian-captain-rohit-sharma-will-open-cricket-academy-outside-the-country-in-america-cricketing-kingdom-will-be-launched-soon-1887663.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय कप्तान के स्वामित्व वाली क्रिकेट अकादमी दुनिया की सबसे बड़ी क्रिकेट अकादमी में से एकहोगी. क्रिकिंगडम भारत में अच्छी तरह से फैला हुआ है. धीरे-धीरे देश के बाहर अपनी जड़ें विकसित कर रहा है.","content":"संयुक्त राज्य अमेरिका (USA) में रोहित शर्मा अपनी क्रिकेट अकादमी 'क्रिकिंगडम' लॉन्च करने के लिए पूरी तरह तैयार हैं. भारतीय कप्तान के स्वामित्व वाली क्रिकेट अकादमी दुनिया की सबसे बड़ी क्रिकेट अकादमी में से एकहोगी. क्रिकिंगडम भारत में अच्छी तरह से फैला हुआ है. धीरे-धीरे देश के बाहर अपनी जड़ें विकसित कर रहा है. ट्वीट देखें: Crickingdom Cricket Academy! 💥 Rohit Sharma is going to launch his Cricket Academy in USA. 👏😍 #RohitSharma #cricket pic.twitter.com/KB11C9CMbp — 12th Khiladi (@12th_khiladi) August 5, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-06 04:43:36","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 2nd T20 Pitch Report: गुयाना में बल्लेबाज़ों के लिए रन बनाना होगा मुस्खिल, जानें कैसा है पिच का हाल, क्या कहते हैं आंकड़े","link":"https://hindi.latestly.com/sports/cricket/ind-vs-wi-2nd-t20-pitch-report-it-will-be-difficult-for-the-batsmen-to-score-runs-in-guyana-know-how-the-pitch-is-what-the-figures-say-1887658.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम ने सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी.","content":"IND vs WI 2nd T20 Pitch Report: भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम ने सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी. वहीं भारतीय टीम को दूसरा मुक़ाबला जीतना महत्वपूर्ण है क्योंकि पहले मुक़ाबले में टीम इंडिया को एक नजदीकी मुक़ाबले में हार का सामना करना पड़ा था. ऐसे में दूसरे मुक़ाबले में टीम से बेहतर प्रदर्शन की उम्मीद है. बता दें की T20 सीरीज का दूसरा मुक़ाबला गुयाना के प्रोविडेंस स्टेडियम में खेला जाएगा. ऐसे में चलिए जानते हैं कैसी है यहां की पिच का हाल और क्या कहते हैं आंकड़े. यह भी पढ़ें: Big Blow to Australia! ऑस्ट्रेलिया को लगा बड़ा झटका, कप्तान पैट कमिंस आईसीसी क्रिकेट विश्व कप से पहले भारतीय दौरे से हुए बाहर गुयाना की पिच किसके लिए मददगार है गुयाना की पिच तेज गेंदबाजों के लिए मददगार साबित होती है गेंद को दोनों तरफ स्विंग करा सकते हैं और मैच जीतना आगे बढ़त है स्पिनर्स भी अपना रोले निभाते है. इस मैदान पर आज तक टी20 इंटरनेशनल मुकाबले में किसी भी पारी में 200 रन नहीं बने. इससे अंदाजा लगाया जा सकता है कि बल्लेबाजों के लिए कैसी होगी यह पिच. यहां अभी तक 27 अंतराष्ट्रीय टी20 मैच खेले गए हैं जिसमें 13 बार पहले बल्लेबाजी करने वाली टीम ने जीत हासिल की है तो वहीं 10 मैचों में लक्ष्य का पीछा करने वाली टीम ने जीत हासिल की है. टॉस जीतने वाली टीमें पहले गेंदबाजी करने का फैसला कर सकती है. पहली पारी का औसत स्कोर 156 है. 150 का लक्ष्य इस मैदान पर डिफेंडबल हो सकता है. हाला की भारतीय बल्लेबाज जिस फॉर्म से गुजर रहे हैं, उसे देखते अगर टीम इंडिया पहले गेंदबाज़ी करती है तो गेंदबाजों को मेजबान टीम को कम स्कोर पर रोकना की कोशिश करना होगा . मुकेश कुमार पहले मुकाबले में विकेट तो हासिल नहीं कर पाए थे लेकिन डेथ ओवर्स में उन्होंने काफी किफायती गेंदबाजी से सबको प्रभावित किया. अर्शदीप ने भी आखिरी ओवर में विकेट निकाले और रन भी बचाए. चहल और कुलदीप इस मैच में एक अहम भूमिका निभा सकतें हैं. टी20 सीरीज के लिए भारत और वेस्टइंडीज की टीम वेस्टइंडीज : काइल मेयर्स, ब्रैंडन किंग, जॉनसन चार्ल्स, निकोलस पूरन (विकेटकीपर), शिमरन हेटमायर, रोवमैन पॉवेल (कप्तान), जेसन होल्डर, रोमारियो शेफर्ड, अकील होसेन, अल्जारी जोसेफ और ओबेद मैकॉय. भारत : शुभमन गिल, ईशान किशन (विकेटकीपर), सूर्यकुमार यादव, तिलक वर्मा, हार्दिक पंड्या (कप्तान), संजू सैमसन, अक्षर पटेल, कुलदीप यादव, युजवेंद्र चहल, अर्शदीप सिंह और मुकेश कुमार.","pubDate":"2023-08-06 04:35:26","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Big Blow to Australia! ऑस्ट्रेलिया को लगा बड़ा झटका, कप्तान पैट कमिंस आईसीसी क्रिकेट विश्व कप से पहले भारतीय दौरे से हुए बाहर","link":"https://hindi.latestly.com/socially/sports/cricket/big-blow-to-australia-captain-pat-cummins-ruled-out-of-indian-tour-before-icc-cricket-world-cup-1887653.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के कप्तान पैट कमिंस कलाई की चोट के कारण भारत के खिलाफ वनडे सीरीज से चूक सकते हैं. ऑस्ट्रेलियाई टीम को 22 सितंबर से भारत में तीन मैचों की एकदिवसीय श्रृंखला के लिए भारत का सामना करेगी.","content":"भारत के खिलाफ वनडे सीरीज से पहले ऑस्ट्रेलियाई क्रिकेट टीम को बड़ा झटका लगा है. ऑस्ट्रेलिया के कप्तान पैट कमिंस कलाई की चोट के कारण भारत के खिलाफ वनडे सीरीज से चूक सकते हैं. ऑस्ट्रेलियाई टीम को 22 सितंबर से भारत में तीन मैचों की एकदिवसीय श्रृंखला के लिए भारत का सामना करेगी. ट्वीट देखें: Pat Cummins could miss the 3 match ODI series against India next month due to a wrist injury. pic.twitter.com/n1ApOg2rPg — Mufaddal Vohra (@mufaddal_vohra) August 5, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-06 04:21:49","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Cyclists debut strong at Commonwealth Youth Games","link":"https://www.fbcnews.com.fj/sports/cyclists-debut-strong-at-commonwealth-youth-games/","keywords":["Sports"],"creator":["Nitesh Raniga"],"video_url":null,"description":"Fiji’s emerging cyclers, Don Younger and Aiden Caine, made their first appearance at the Commonwealth Youth Games in Trinidad and Tobago today. In a spirited performance, Younger clinched the 25th position with a timing of 23.37.15 seconds, while Caine secured the 28th spot, completing the men’s individual trial at the Brian Lara Cricket Stadium in […]","content":"Fiji’s emerging cyclers, Don Younger and Aiden Caine, made their first appearance at the Commonwealth Youth Games in Trinidad and Tobago today. In a spirited performance, Younger clinched the 25th position with a timing of 23.37.15 seconds, while Caine secured the 28th spot, completing the men’s individual trial at the Brian Lara Cricket Stadium in 28.2.38 seconds. A team of 36 athletes are representing Fiji across multiple disciplines including cycling, 7s rugby, swimming, athletics, and triathlon. Chef de Mission of Team Fiji Kelvin Yee expressed unwavering determination as he articulated the squad’s ambitious goal of clinching medals. The Commonwealth Youth Games will be held over eight days and it will conclude on Friday.","pubDate":"2023-08-06 04:05:30","image_url":null,"source_id":"fbcnews","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"\"Last I Played Was In IPL\": Chahal Opens Up On Frequent Team India Drops","link":"https://sports.ndtv.com/cricket/last-i-played-was-in-ipl-yuzvendra-chahal-opens-up-on-frequent-drops-from-indian-team-4273232","keywords":null,"creator":null,"video_url":null,"description":"Yuzvendra Chahal wasn't picked in any of the three ODIs against West Indies but was part of the 1st T20I.","content":"One of India's finest spinners in white-ball cricket, Yuzvedra Chahal, hasn't found breaking into the Indian playing XI easy of late. Though Chahal has been a part of most of India's white-ball assignments, more often than not, only one of him and Kuldeep Yadav has managed to break into the team. While there's been plenty of chatter over Chahal's non-selection in certain matches, the wrist-spinner isn't bothered by his lack of game-time at all. When asked about the frequent snubs, Chahal gave reporters a firm response, suggesting cricket is a team game, unlike chess. \"Team combination is our priority and it is not something new,\" Chahal told reporters of the second T20I against West Indies. \"At 7 we generally play Ravindra Jadeja or Axar Patel . Three spinners can only play if the wickets are spin friendly. Kuldeep is bowling really well, he is in a great rhythm and that's why team is backing him. I keep working on nets so that whenever I get the chance I will grab it. \"I've not been playing in the last two-three series. Previously you would have seen me playing in England or West Indies and Kuldeep (Yadav) was not playing then.\" Chahal didn't get a go in the Indian team in any of the three ODIs against West Indies but found a spot for himself in the first T20I. The veteran spinner said that he is very happy to be wearing the Indian jersey, whether as part of the playing XI or one of the 15 members of the squad picked for the tour. \"We are professional cricketers. I was playing after two months, last I played was in the IPL. It is all about the preparation. This is not an individual sport, you are playing here for your team. There are times when players has to sit out for two series, so it doesn't mean that they are not part of the team. \"I am very happy that I am getting to wear the blue jersey every day. I am not sitting at home. I am travelling with the team. I am part of the team. I have played chess, it is an individual game but cricket is a team sport. Out of fifteen people in the squad only eleven can play. In the past few series, when I was playing Kuldeep was not getting the chances,\" he explained.","pubDate":"2023-08-06 04:04:19","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 2nd T20 2023 Dream11 Prediction: आज दूसरे टी20 में वेस्टइंडीज से भिड़ेगी भारतीय टीम, यहां जानें कैसे चुने बेस्ट फैंटसी प्लेइंग इलेवन","link":"https://hindi.latestly.com/sports/cricket/indian-team-will-take-on-west-indies-in-second-t20-today-know-here-how-to-choose-best-fantasy-playing-xi-1887721.html","keywords":null,"creator":null,"video_url":null,"description":"IND बनाम WI ड्रीम 11 फैंटेसी टीम के कप्तान के रूप में ईशान किशन(IND) को जबकि ब्रैंडन किंग(WI) को उप-कप्तान के रूप में चुना जा सकता है.","content":"IND vs WI 2nd T20 2023 Dream11 Prediction: 6 अगस्त (रविवार) को भारत और वेस्टइंडीज गुयाना के प्रोविडेंस स्टेडियम में पांच मैचों की टी20 सीरीज के दूसरे मैच में एक्शन में होंगे. दोनों टीमों ने पहले टी20 मैच में अपना सब कुछ झोंक दिया था. प्रशंसकों को रोमांचक क्रिकेट देखने को मिला. मैच बिल्कुल ख़राब हो गया लेकिन रोवमैन पॉवेल एंड कंपनी ने धैर्य बनाए रखते हुए गेम को चार विकेट से जीत लिया. जेसन होल्डर को उनके सनसनीखेज गेंदबाजी प्रदर्शन के लिए प्लेयर ऑफ द मैच चुना गया. यह भी पढ़ें: गुयाना में खेला जाएगा वेस्टइंडीज बनाम भारत दूसरे टी20 मैच, यहां जानें दोनों टीमों का संभावित प्लेइंग इलेवन भारत आगामी मुकाबले में विशेषकर बल्लेबाजी विभाग में सुधार करना चाहेगा, मेन इन ब्लू पहले टी20ई में 150 के लक्ष्य का पीछा करने में असमर्थ रहे और टीम मैनेजमेंट को बल्लेबाजों से बेहतर प्रदर्शन की उम्मीद होगी. हार्दिक पंड्या एंड कंपनी रविवार को होने वाले मुकाबले में संपूर्ण प्रदर्शन करने और सीरीज बराबर करने के लिए उत्सुक होगी. यह भी पढ़ें: आज गुयाना में खेला जाएगा भारत बनाम वेस्टइंडीज दूसरे टी20 मुकाबला, जानें कैसी रहेगी प्रोविडेंस स्टेडियम में मौसम और पिच का हाल दूसरी ओर, वेस्टइंडीज इस प्रतियोगिता में पूरे जोश के साथ उतरेगी, जिसने सितारों से सजी भारतीय टीम के खिलाफ शानदार गेंदबाजी का प्रदर्शन कर रही है. वे उसी प्रदर्शन को दोहराकर सीरीज में 2-0 से बढ़त हासिल करना चाहेंगे, हालाँकि, कैरेबियाई टीम चाहेगी कि मेहमान उन पर कड़ा प्रहार करें और इस प्रकार, उन्हें सभी विभागों में अपना सर्वश्रेष्ठ प्रदर्शन करने की आवश्यकता होगी. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: विकेटकीपर - ईशान किशन (IND), शाई होप (WI) को IND बनाम WI फैंटसी टीम के लिए विकेट-कीपर के रूप में हमारी पसंद हो सकते हैं. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: बल्लेबाज - बल्लेबाजी में भारी ड्रीम 11 फैंटसी टीम में ब्रैंडन किंग(WI), शुभमन गिल (IND), तिलक वर्मा(IND) को IND बनाम WI ड्रीम 11 टीम में चुना जा सकता है. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: ऑलराउंडर - हम तीन ऑलराउंडर हार्दिक पंड्या(IND), रोमारियो शेफर्ड(WI), काइल मेयर्स(WI) को IND बनाम WI फैंटसी टीम में चुना जा सकता है. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: गेंदबाज -याजुवेंद्र चहल (IND), कुलदीप यादव (IND), गुडाकेश मोती(WI) को IND बनाम WI ड्रीम 11 फैंटसी टीम में अकेले गेंदबाज हो सकते हैं. IND बनाम WI, ड्रीम 11 टीम प्रेडिक्शन: ईशान किशन (IND), शाई होप (WI), ब्रैंडन किंग(WI), शुभमन गिल (IND), तिलक वर्मा(IND), हार्दिक पंड्या(IND), रोमारियो शेफर्ड(WI), काइल मेयर्स(WI), याजुवेंद्र चहल(IND), कुलदीप यादव (IND), गुडाकेश मोती(WI) IND बनाम WI ड्रीम 11 फैंटेसी टीम के कप्तान के रूप में ईशान किशन(IND) को जबकि ब्रैंडन किंग(WI) को उप-कप्तान के रूप में चुना जा सकता है.","pubDate":"2023-08-06 06:16:22","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Global T20 Canada 2023: Montreal Tigers Beat Vancouver Knights by 1 Wicket, to Face Surrey Jaguars in Final","link":"https://www.latestly.com/sports/cricket/global-t20-canada-2023-montreal-tigers-beat-vancouver-knights-by-1-wicket-to-face-surrey-jaguars-in-final-5320390.html","keywords":null,"creator":null,"video_url":null,"description":"Montreal Tigers defeated Vancouver Knights by one wicket in Qualifier 2 to reach the final of Global T20 Canada, here.","content":"Brampton, August 6 : Montreal Tigers defeated Vancouver Knights by one wicket in Qualifier 2 to reach the final of Global T20 Canada, here. The star performers for Montreal Tigers were Abbas Afridi (5/29) who picked up five wickets, including a hattrick and Sherfane Rutherfords (48 not out off in 34 balls). Rutherfords's last over heroics with the bat ensured that Tigers win by 1 wicket and 3 balls remaining. Abbas Afridi Takes First Hattrick of Global T20 Canada 2023, Achieves Feat During Vancouver Knights vs Montreal Tigers Qualifier 2 Clash (Watch Video) Montreal Tigers will take on the Surrey Jaguars in the final clash of the tournament on Sunday at the TD Cricket Arena. After the Montreal Tigers won the toss and elected to field first, Vancouver Knights had a steady start to the innings despite losing Vritya Aravind (7) early. At the end of the powerplay, the Knights were 35/1. Mohammad Rizwan (39) and Corbin Bosch (36) built yet another essential partnership of 57 runs. Corbin Bosch looked threatening, clearing the ropes on three occasions. However, the momentum switched rapidly when the Knights lost four wickets in just as many balls. The innings went from 90/1 to 90/5 as Corbin Bosch triggered the collapse when he was scalped by Abbas Afridi. The very next delivery saw Abbas Afridi dismiss Rassie Van Der Dussen (0) followed by Najibullah Zadran (0), completing the bowler’s hat trick. The first ball of the next over saw Mohammad Rizwan (39) also dismissed by Ayaan Afzal Khan. Following this, Fabian Allen (10) was Abbas Afridi’s fifth victim of the day. In the death overs, Harsh Thaker (26) provided the Knights with a vital injection, with 17 runs coming off the final over. The Vancouver Knights finished at an above par score of 137/6. In response, the Tigers had an explosive start. Muhammad Waseem (13) struck two maximums in the first over before he was dismissed by Corbin Bosch. Chris Lynn (7), Srimantha Wijeyeratne (6) and Dilpreet Singh (2) followed soon after. At the end of the powerplay, the Tigers were struggling at 37/4. Dipendra Singh Airee (25) and Sherfane Rutherford (48 not out) came together to stabilise the run chase, putting on a 43-run partnership. Andre Russel (17) came out with intent and struck three boundaries in eleven deliveries, before he was Junaid Siddique's second wicket of the day. Team India Cricket Players Visit Indian High Commission in Guyana Ahead of IND vs WI 2nd T20I 2023 (See Pics) With five overs remaining the Tigers needed 46 runs from 30 balls. Carlos Braithwaite (1) failed to make an impact leaving the onus on Rutherford. Aayan Afzal Khan (18) chipped in with a breezy knock, before Junaid Siddique took two more wickets in the nineteenth over. With 15 runs needed off the last over, and only a wicket in hand, a composed Sherfane Rutherford launched Rayyan Pathan for three consecutive sixes to earn the Tigers a sensational victory. Brief Scores: Vancouver Knights 137/6 in 20 overs, (Mohammed Rizwan 39, Corbin Bosch 36; Abbas Afridi 5/25, Ayaan Afzal Khan 1/30 ) lost to Montreal Tigers 141/9 in 19.3 overs (Sherfane Rutherford 48 not out, Dipendra Singh Airee 25, Junaid Siddique 4-22, Fabian Allen 2-15, Corbin Bosch 2-18) by 1 wicket (The above story first appeared on LatestLY on Aug 06, 2023 10:56 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-08-06 05:26:26","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 2nd T20I 2023, Guyana Weather & Pitch Report: आज गुयाना में खेला जाएगा भारत बनाम वेस्टइंडीज दूसरे टी20 मुकाबला, जानें कैसी रहेगी प्रोविडेंस स्टेडियम में मौसम और पिच का हाल","link":"https://hindi.latestly.com/sports/cricket/today-india-vs-west-indies-second-t20-match-will-be-played-in-guyana-know-how-will-be-the-condition-of-weather-and-pitch-at-providence-stadium-1887675.html","keywords":null,"creator":null,"video_url":null,"description":"भारत बनाम वेस्टइंडीज दूसरा टी20 मैच देखना चाहते हैं उनके लिए आगामी मैच के लिए मौसम अच्छा लग रहा है. मौसम विशेषज्ञों के अनुसार, दूसरे टी20 मैच के लिए मौसम मिश्रित रहने की संभावना है, जिसमें कुछ बादल छाए रहेंगे, सुबह की बारिश होगी. हालांकि दिन में धूप रहेगी और अधिकतम तापमान 32 डिग्री सेल्सियस के आसपास रहने की उम्मीद है, 0-7 प्रतिशत वर्षा की चांस है. इतने कम वर्षा प्रतिशत के साथ, एक पूर्ण मैच की उम्मीद की जा सकती है.","content":"IND vs WI 2nd T20I 2023, Guyana Weather & Pitch Report: वेस्टइंडीज के खिलाफ सीरीज के पहले टी20 मैच चार रन से हारने के बाद भारतीय टीम वापसी कर सीरीज 1-1 से बराबर करना चाहेगी. 6 अगस्त (रविवार) को पांच मैचों की श्रृंसीरीज के दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में खेला जाएगा. वेस्टइंडीज ने पहले टी20 मैच में टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया और कुल 149/6 का स्कोर बनाया. रोवमॉल पॉवेल ने 32 गेंदों पर 48 रनों की महत्वपूर्ण पारी खेली जिसमें तीन चौके और तीन छक्के लगाए थे. उन्होंने वेस्टइंडीज को एक सम्मानजनक स्कोर तक पहुंचाया, जिसमें निकोलस पूरन (34 गेंदों पर 41 रन) ने भी बल्ले से योगदान दिया. यह भी पढ़ें: आज वेस्टइंडीज के खिलाफ दूसरे टी20 में जीत के साथ वापसी करने उतरेगी भारतीय टीम, मैच से पहले जानें संभावित प्लेइंग XI, हेड टू हेड और स्ट्रीमिंग समेत सभी डिटेल्स भारत के लिए गेंदबाज युजवेंद्र चहल और कुलदीप यादव ने दो-दो विकेट हासिल किए. 150 रनों का पीछा करने उतरी भारत की शुरुआत अच्छी रही लेकिन नियमित अंतराल पर विकेट गिरने से वह लक्ष्य से चार रन पीछे रह गई. जब भारत के लिए बल्ले से योगदान देने की बात आई, तो केवल डेब्यू करने वाले तिलक वर्मा ने शानदार प्रदर्शन किया और 22 गेंदों में दो चौकों और तीन छक्कों की मदद से 39 रन बनाए. जॉर्जटाउन की मौसम रिपोर्ट( Guyana Weather Report) भारतीय क्रिकेट फैंस के लिए अच्छी खबर है, जो भारत बनाम वेस्टइंडीज दूसरा टी20 मैच देखना चाहते हैं उनके लिए आगामी मैच के लिए मौसम अच्छा लग रहा है. मौसम विशेषज्ञों के अनुसार, दूसरे टी20 मैच के लिए मौसम मिश्रित रहने की संभावना है, जिसमें कुछ बादल छाए रहेंगे, सुबह की बारिश होगी. हालांकि दिन में धूप रहेगी और अधिकतम तापमान 32 डिग्री सेल्सियस के आसपास रहने की उम्मीद है, 0-7 प्रतिशत वर्षा की चांस है. इतने कम वर्षा प्रतिशत के साथ, एक पूर्ण मैच की उम्मीद की जा सकती है. प्रोविडेंस स्टेडियम की पिच रिपोर्ट( Guyana Pitch Report) यह एक ऐसा स्थान है जहां कई कम स्कोर वाले मैच देखने को मिले हैं. तेज गेंदबाजों ने इस स्थान पर गेंदबाजी का आनंद लिया है, पहली पारी का औसत स्कोर 123 है. चूंकि ट्रैक थोड़ा धीमा है, इससे स्पिनरों को मदद मिलती है. इस प्रकार मैच आगे बढ़ने के साथ रन बनाना कठिन हो जाता है. हालाँकि, सबसे हालिया ट्वेंटी-ट्वेंटी मुकाबले में एक टीम ने 150 का पीछा पूरा किया. इसलिए, यह साबित होता है कि इस स्थान पर लक्ष्य का पीछा करने वाली टीमें फायदे में हो सकती हैं.","pubDate":"2023-08-06 05:25:03","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Top AFL journalist Caroline Wilson blames Matildas' 'secrecy' and stage-managed interviews as she says World Cup hasn't lived up to its potential in Australia","link":"https://www.dailymail.co.uk/sport/football/article-12377455/Caroline-Wilson-Matildas-World-Cup-big-mark-Australia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Caroline Wilson believes that despite some thrilling games the Women's World Cup hasn't made a huge impact in Australia, and blames the element of 'secrecy' around the Matildas.","content":"Top AFL journalist Caroline Wilson blames Matildas' 'secrecy' and stage-managed treatment of stars as she says World Cup hasn't captured the imagination of Aussies Reporter complains about secrecy around Matildas Says Australians can't get to know the players Described team's media management as 'extraordinary' By James Cooney For Daily Mail Australia Updated: 05:57 BST, 6 August 2023 e-mail View comments Top footy reporter Caroline Wilson believes that despite some thrilling games the Women's World Cup hasn't made a huge impact in Australia - and she blames the 'secrecy' surrounding the Matildas. The Matildas stormed into the tournament's round of 16 on Monday after hammering reigning Olympic champions Canada 4-0 last week. On Monday, Sydney will turn green and gold as the Aussie team takes on Denmark in front of a sellout crowd of about 80,000 fans. Superstar Sam Kerr didn't play in the group stage after injuring her left calf on the eve of the tournament, but she's set to be unleashed against Denmark after the team kept fans in the dark about the complaint in order not to give their rivals an edge. Wilson was sharply critical of how the team has handled itself and its stars in a TV appearance on Sunday morning. Caroline Wilson has complained about the 'secrecy' surrounding the Matildas at their home World Cup, blaming it for the tournament failing to live up to its potential Wilson says there's so many other great stars in the side besides Sam Kerr (pictured at training) but the public can't get to know them because they aren't allowed to give interviews 'I have to be brutal, I don't (think the tournament is cutting through),' she told the ABC's Offsiders program. 'Certainly when the Matildas win - and the games have been unbelievable, don't get me wrong - but I don't feel I know the Matildas any better now than I did a few weeks ago. 'The whole campaign was built around Sam Kerr. There was the shock of her not playing. 'There's so many other brilliant players in the team, but because you're not allowed to give interviews and they are heavily media managed... 'There is an element of secrecy. I understand this is World Cups. You don't see it in Olympic Games or certainly not in the football code I cover [AFL]. You don't see it as Wimbledon or the British Open Golf. 'It's quite extraordinary. I just want to get to know my team better.' Football commentator Simon Hill responded to Wilson's complaints, arguing that the way the Matildas are managed is part of 'the culture' of a World Cup - and that players are micro managed and protected because the world's media are trying to all get access to them. Despite the sell-out crowds and huge TV ratings, the World Cup has attracted criticism in Australia because the vast majority of games have only been available to Optus subscribers. Wilson said there is an element of secrecy around the Matildas making it hard to know them Simon Hill suggested that players are micro managed because it's the culture of a World Cup SBS commentator Lucy Zelic said it was 'baffling' that such an enormous sporting event had so few football matches available to the public on free-to-air TV. Optus have defended the decision to keep most of the matches behind a paywall. 'Broadcaster rights fees are key to ensuring the continued growth and equality of women's sport, and contribute to everything from grassroots momentum to salaries for our national players,' a spokesperson told news.com.au. 'This is enabled by matches being broadcast across a combination of free and paid environments which is normal across the sports landscape. 'For example, viewers from the previous host nation of the FIFA Women's World Cup 2019 viewed most games behind a paywall in France, and the majority of games for the most recent major world sports event hosted in Australia,' the Optus representative continued. 'The 2022 Men's Cricket T20 World Cup (was) behind a paywall on Foxtel/Kayo, as well as for most major domestic sports in Australia, such as AFL, NRL and cricket.' Actual ticket sales for the tournament have been outstanding, with Football Australia announcing before the tournament that more than 1.5 million had been sold - establishing a new benchmark for any FIFA Women's World Cup event. Australia has contributed more than 1.1 million of the total ticket sales, showing the booming interest in women's football Down Under. Share or comment on this article: Top AFL journalist Caroline Wilson blames Matildas' 'secrecy' and stage-managed interviews as she says World Cup hasn't lived up to its potential in Australia e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-06 04:57:19","image_url":"https://i.dailymail.co.uk/1s/2023/08/06/05/74008993-0-image-a-50_1691295519164.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs WI 2nd T20 Pitch Report: गुयाना में बल्लेबाजों के लिए रन बनाना होगा मुश्किल, जानें कैसा है पिच का हाल, क्या कहते हैं आंकड़े","link":"https://hindi.latestly.com/sports/cricket/ind-vs-wi-2nd-t20-pitch-report-it-will-be-difficult-for-batsmen-to-score-runs-in-guyana-know-how-the-pitch-is-what-the-figures-say-1887658.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम ने सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी.","content":"IND vs WI 2nd T20 Pitch Report: भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी. वहीं भारतीय टीम को दूसरा मुक़ाबला जीतना महत्वपूर्ण है क्योंकि पहले मुक़ाबले में टीम इंडिया को एक नजदीकी मुक़ाबले में हार का सामना करना पड़ा था. ऐसे में दूसरे मुक़ाबले में बल्लेबाजों से बेहतर प्रदर्शन की उम्मीद है. बता दें की T20 सीरीज का दूसरा मुक़ाबला गुयाना के प्रोविडेंस स्टेडियम में खेला जाएगा. ऐसे में चलिए जानते हैं कैसी है यहां की पिच का हाल और क्या कहते हैं आंकड़े. यह भी पढ़ें: Big Blow to Australia! ऑस्ट्रेलिया को लगा बड़ा झटका, कप्तान पैट कमिंस आईसीसी क्रिकेट विश्व कप से पहले भारतीय दौरे से हुए बाहर गुयाना की पिच किसके लिए मददगार है गुयाना की पिच तेज गेंदबाजों के लिए मददगार साबित होती है. हाला की मैच जीतना आगे बढ़त है स्पिनर्स भी अपना रोले निभाते है. इस मैदान पर आज तक टी20 अंतराष्ट्रीय मुकाबले में किसी भी पारी में 200 रन नहीं बने है. इससे अंदाजा लगाया जा सकता है कि बल्लेबाजों के लिए कैसी होगी यह पिच. यहां अभी तक 27 अंतराष्ट्रीय टी20 मैच खेले गए हैं जिसमें 13 बार पहले बल्लेबाजी करने वाली टीम ने जीत हासिल की है तो वहीं 10 मैचों में लक्ष्य का पीछा करने वाली टीम ने जीत हासिल की है. इस मैदान पर टॉस जीतने वाली टीम पहले गेंदबाजी करने का फैसला कर सकती है. पहली पारी का औसत स्कोर इस मैदान पर 156 है. हाला की भारतीय बल्लेबाज जिस फॉर्म से गुजर रहे हैं, उसे देखते हुए अगर टीम इंडिया पहले गेंदबाज़ी करती है तो गेंदबाजों को मेजबान टीम को कम स्कोर पर रोकना होगा . बता दें की मुकेश कुमार पहले मुकाबले में विकेट तो हासिल नहीं कर पाए थे लेकिन डेथ ओवर्स में उन्होंने काफी किफायती गेंदबाजी से सबको प्रभावित किया था. अर्शदीप ने भी आखिरी ओवर में विकेट निकाले थे और रन भी बचाए थे . चहल और कुलदीप इस मैच में एक अहम भूमिका निभा सकतें हैं. टी20 सीरीज के लिए भारत और वेस्टइंडीज की टीम भारत : शुभमन गिल, ईशान किशन (विकेटकीपर), सूर्यकुमार यादव, तिलक वर्मा, हार्दिक पंड्या (कप्तान), संजू सैमसन, अक्षर पटेल, कुलदीप यादव, युजवेंद्र चहल, अर्शदीप सिंह और मुकेश कुमार. वेस्टइंडीज : काइल मेयर्स, ब्रैंडन किंग, जॉनसन चार्ल्स, निकोलस पूरन (विकेटकीपर), शिमरन हेटमायर, रोवमैन पॉवेल (कप्तान), जेसन होल्डर, रोमारियो शेफर्ड, अकील होसेन, अल्जारी जोसेफ और ओबेद मैकॉय.","pubDate":"2023-08-06 04:56:36","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rohit Sharma To Launch Cricket Academy In USA: देश से बाहर अमेरिका में क्रिकेट अकादमी खोलेंगे भारतीय कप्तान रोहित शर्मा, जल्द लॉन्च होगी क्रिकिंगडम","link":"https://hindi.latestly.com/socially/sports/cricket/indian-captain-rohit-sharma-will-open-cricket-academy-outside-the-country-in-america-cricketing-kingdom-will-be-launched-soon-1887663.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय कप्तान के स्वामित्व वाली क्रिकेट अकादमी दुनिया की सबसे बड़ी क्रिकेट अकादमी में से एकहोगी. क्रिकिंगडम भारत में अच्छी तरह से फैला हुआ है. धीरे-धीरे देश के बाहर अपनी जड़ें विकसित कर रहा है.","content":"संयुक्त राज्य अमेरिका (USA) में रोहित शर्मा अपनी क्रिकेट अकादमी 'क्रिकिंगडम' लॉन्च करने के लिए पूरी तरह तैयार हैं. भारतीय कप्तान के स्वामित्व वाली क्रिकेट अकादमी दुनिया की सबसे बड़ी क्रिकेट अकादमी में से एकहोगी. क्रिकिंगडम भारत में अच्छी तरह से फैला हुआ है. धीरे-धीरे देश के बाहर अपनी जड़ें विकसित कर रहा है. ट्वीट देखें: Crickingdom Cricket Academy! 💥 Rohit Sharma is going to launch his Cricket Academy in USA. 👏😍 #RohitSharma #cricket pic.twitter.com/KB11C9CMbp — 12th Khiladi (@12th_khiladi) August 5, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-06 04:43:36","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 2nd T20 Pitch Report: गुयाना में बल्लेबाज़ों के लिए रन बनाना होगा मुस्खिल, जानें कैसा है पिच का हाल, क्या कहते हैं आंकड़े","link":"https://hindi.latestly.com/sports/cricket/ind-vs-wi-2nd-t20-pitch-report-it-will-be-difficult-for-the-batsmen-to-score-runs-in-guyana-know-how-the-pitch-is-what-the-figures-say-1887658.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम ने सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी.","content":"IND vs WI 2nd T20 Pitch Report: भारत और वेस्टइंडीज के बीच 5 मैचों की टी20 सीरीज का दूसरा मुकाबला गुयाना के प्रोविडेंस स्टेडियम में रविवार, 6 अगस्त को खेला जाएगा. मेजबान टीम ने सीरीज का पहला मुक़ाबला जीतकर 1-0 से आगे है और टीम इंडिया को दूसरे मुक़ाबले में हराने के उम्मीद से मैदान में उतरेगी. वहीं भारतीय टीम को दूसरा मुक़ाबला जीतना महत्वपूर्ण है क्योंकि पहले मुक़ाबले में टीम इंडिया को एक नजदीकी मुक़ाबले में हार का सामना करना पड़ा था. ऐसे में दूसरे मुक़ाबले में टीम से बेहतर प्रदर्शन की उम्मीद है. बता दें की T20 सीरीज का दूसरा मुक़ाबला गुयाना के प्रोविडेंस स्टेडियम में खेला जाएगा. ऐसे में चलिए जानते हैं कैसी है यहां की पिच का हाल और क्या कहते हैं आंकड़े. यह भी पढ़ें: Big Blow to Australia! ऑस्ट्रेलिया को लगा बड़ा झटका, कप्तान पैट कमिंस आईसीसी क्रिकेट विश्व कप से पहले भारतीय दौरे से हुए बाहर गुयाना की पिच किसके लिए मददगार है गुयाना की पिच तेज गेंदबाजों के लिए मददगार साबित होती है गेंद को दोनों तरफ स्विंग करा सकते हैं और मैच जीतना आगे बढ़त है स्पिनर्स भी अपना रोले निभाते है. इस मैदान पर आज तक टी20 इंटरनेशनल मुकाबले में किसी भी पारी में 200 रन नहीं बने. इससे अंदाजा लगाया जा सकता है कि बल्लेबाजों के लिए कैसी होगी यह पिच. यहां अभी तक 27 अंतराष्ट्रीय टी20 मैच खेले गए हैं जिसमें 13 बार पहले बल्लेबाजी करने वाली टीम ने जीत हासिल की है तो वहीं 10 मैचों में लक्ष्य का पीछा करने वाली टीम ने जीत हासिल की है. टॉस जीतने वाली टीमें पहले गेंदबाजी करने का फैसला कर सकती है. पहली पारी का औसत स्कोर 156 है. 150 का लक्ष्य इस मैदान पर डिफेंडबल हो सकता है. हाला की भारतीय बल्लेबाज जिस फॉर्म से गुजर रहे हैं, उसे देखते अगर टीम इंडिया पहले गेंदबाज़ी करती है तो गेंदबाजों को मेजबान टीम को कम स्कोर पर रोकना की कोशिश करना होगा . मुकेश कुमार पहले मुकाबले में विकेट तो हासिल नहीं कर पाए थे लेकिन डेथ ओवर्स में उन्होंने काफी किफायती गेंदबाजी से सबको प्रभावित किया. अर्शदीप ने भी आखिरी ओवर में विकेट निकाले और रन भी बचाए. चहल और कुलदीप इस मैच में एक अहम भूमिका निभा सकतें हैं. टी20 सीरीज के लिए भारत और वेस्टइंडीज की टीम वेस्टइंडीज : काइल मेयर्स, ब्रैंडन किंग, जॉनसन चार्ल्स, निकोलस पूरन (विकेटकीपर), शिमरन हेटमायर, रोवमैन पॉवेल (कप्तान), जेसन होल्डर, रोमारियो शेफर्ड, अकील होसेन, अल्जारी जोसेफ और ओबेद मैकॉय. भारत : शुभमन गिल, ईशान किशन (विकेटकीपर), सूर्यकुमार यादव, तिलक वर्मा, हार्दिक पंड्या (कप्तान), संजू सैमसन, अक्षर पटेल, कुलदीप यादव, युजवेंद्र चहल, अर्शदीप सिंह और मुकेश कुमार.","pubDate":"2023-08-06 04:35:26","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Big Blow to Australia! ऑस्ट्रेलिया को लगा बड़ा झटका, कप्तान पैट कमिंस आईसीसी क्रिकेट विश्व कप से पहले भारतीय दौरे से हुए बाहर","link":"https://hindi.latestly.com/socially/sports/cricket/big-blow-to-australia-captain-pat-cummins-ruled-out-of-indian-tour-before-icc-cricket-world-cup-1887653.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के कप्तान पैट कमिंस कलाई की चोट के कारण भारत के खिलाफ वनडे सीरीज से चूक सकते हैं. ऑस्ट्रेलियाई टीम को 22 सितंबर से भारत में तीन मैचों की एकदिवसीय श्रृंखला के लिए भारत का सामना करेगी.","content":"भारत के खिलाफ वनडे सीरीज से पहले ऑस्ट्रेलियाई क्रिकेट टीम को बड़ा झटका लगा है. ऑस्ट्रेलिया के कप्तान पैट कमिंस कलाई की चोट के कारण भारत के खिलाफ वनडे सीरीज से चूक सकते हैं. ऑस्ट्रेलियाई टीम को 22 सितंबर से भारत में तीन मैचों की एकदिवसीय श्रृंखला के लिए भारत का सामना करेगी. ट्वीट देखें: Pat Cummins could miss the 3 match ODI series against India next month due to a wrist injury. pic.twitter.com/n1ApOg2rPg — Mufaddal Vohra (@mufaddal_vohra) August 5, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-06 04:21:49","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Cyclists debut strong at Commonwealth Youth Games","link":"https://www.fbcnews.com.fj/sports/cyclists-debut-strong-at-commonwealth-youth-games/","keywords":["Sports"],"creator":["Nitesh Raniga"],"video_url":null,"description":"Fiji’s emerging cyclers, Don Younger and Aiden Caine, made their first appearance at the Commonwealth Youth Games in Trinidad and Tobago today. In a spirited performance, Younger clinched the 25th position with a timing of 23.37.15 seconds, while Caine secured the 28th spot, completing the men’s individual trial at the Brian Lara Cricket Stadium in […]","content":"Fiji’s emerging cyclers, Don Younger and Aiden Caine, made their first appearance at the Commonwealth Youth Games in Trinidad and Tobago today. In a spirited performance, Younger clinched the 25th position with a timing of 23.37.15 seconds, while Caine secured the 28th spot, completing the men’s individual trial at the Brian Lara Cricket Stadium in 28.2.38 seconds. A team of 36 athletes are representing Fiji across multiple disciplines including cycling, 7s rugby, swimming, athletics, and triathlon. Chef de Mission of Team Fiji Kelvin Yee expressed unwavering determination as he articulated the squad’s ambitious goal of clinching medals. The Commonwealth Youth Games will be held over eight days and it will conclude on Friday.","pubDate":"2023-08-06 04:05:30","image_url":null,"source_id":"fbcnews","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"\"Last I Played Was In IPL\": Chahal Opens Up On Frequent Team India Drops","link":"https://sports.ndtv.com/cricket/last-i-played-was-in-ipl-yuzvendra-chahal-opens-up-on-frequent-drops-from-indian-team-4273232","keywords":null,"creator":null,"video_url":null,"description":"Yuzvendra Chahal wasn't picked in any of the three ODIs against West Indies but was part of the 1st T20I.","content":"One of India's finest spinners in white-ball cricket, Yuzvedra Chahal, hasn't found breaking into the Indian playing XI easy of late. Though Chahal has been a part of most of India's white-ball assignments, more often than not, only one of him and Kuldeep Yadav has managed to break into the team. While there's been plenty of chatter over Chahal's non-selection in certain matches, the wrist-spinner isn't bothered by his lack of game-time at all. When asked about the frequent snubs, Chahal gave reporters a firm response, suggesting cricket is a team game, unlike chess. \"Team combination is our priority and it is not something new,\" Chahal told reporters of the second T20I against West Indies. \"At 7 we generally play Ravindra Jadeja or Axar Patel . Three spinners can only play if the wickets are spin friendly. Kuldeep is bowling really well, he is in a great rhythm and that's why team is backing him. I keep working on nets so that whenever I get the chance I will grab it. \"I've not been playing in the last two-three series. Previously you would have seen me playing in England or West Indies and Kuldeep (Yadav) was not playing then.\" Chahal didn't get a go in the Indian team in any of the three ODIs against West Indies but found a spot for himself in the first T20I. The veteran spinner said that he is very happy to be wearing the Indian jersey, whether as part of the playing XI or one of the 15 members of the squad picked for the tour. \"We are professional cricketers. I was playing after two months, last I played was in the IPL. It is all about the preparation. This is not an individual sport, you are playing here for your team. There are times when players has to sit out for two series, so it doesn't mean that they are not part of the team. \"I am very happy that I am getting to wear the blue jersey every day. I am not sitting at home. I am travelling with the team. I am part of the team. I have played chess, it is an individual game but cricket is a team sport. Out of fifteen people in the squad only eleven can play. In the past few series, when I was playing Kuldeep was not getting the chances,\" he explained.","pubDate":"2023-08-06 04:04:19","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"}]}