{"newsArray":[{"title":"Aussie superstar announces cricket retirement","link":"https://www.theage.com.au/sport/cricket/aussie-superstar-announces-cricket-retirement-20220915-p5bi8k.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":null,"video_url":null,"description":"Long-time Australian batter Rachael Haynes has announced her retirement from international cricket.","content":null,"pubDate":"2022-09-14 23:44:09","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australian vice-captain Rachael Haynes announces her international retirement","link":"https://www.foxsports.com.au/cricket/australian-vicecaptain-rachael-haynes-announces-her-international-retirement/news-story/e322cea0719a508a8fba7dfe7313e7c0","keywords":null,"creator":null,"video_url":null,"description":"Another Australian leadership vacancy has opened up, with national vice-captain Rachael Haynes announcing her retirement from international cricket.","content":null,"pubDate":"2022-09-14 23:39:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Australian vice-captain Rachael Haynes announces her international retirement","link":"https://www.perthnow.com.au/sport/cricket-australian-vice-captain-rachael-haynes-announces-her-international-retirement-c-8244603","keywords":null,"creator":[" "],"video_url":null,"description":"There’s been more movement among the leadership of Australian cricket with a veteran batter calling time.","content":null,"pubDate":"2022-09-14 23:27:01","image_url":"https://images.perthnow.com.au/publication/C-8244603/b2bbe0c9cb431ebc35e66307816b5b40185d4b23-16x9-x0y15w2048h1152.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie star calls time on her career","link":"https://www.cairnspost.com.au/sport/cricket/cricket-australian-vicecaptain-rachael-haynes-announces-her-international-retirement/news-story/5ea8d4b588c4bf202a6f6b74cda355cf","keywords":["Breaking News","Cricket news and galleries","National Breaking News","NewsWire","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"Another Australian leadership vacancy has opened up with national vice-captain Rachael Haynes announcing her retirement from international cricket.","content":null,"pubDate":"2022-09-14 22:53:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australian batter Rachael Haynes announces retirement from international cricket","link":"https://sportstar.thehindu.com/cricket/womens-cricket/rachael-haynes-australia-batter-retires-international-womens-cricket-wbbl/article65892438.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Left-handed batter Haynes will end her professional career at the end of next month’s Women’s Big Bash League in which she will play for Sydney Thunder.","content":"Australian batter Rachael Haynes announced her retirement from international cricket on Thursday. Left-handed batter Haynes will end her professional career at the end of next month’s Women’s Big Bash League in which she will play for Sydney Thunder, as per a report by cricket.com.au . The 35-year-old Haynes was vice-captain of the Australian team and her last appearance was the gold medal match against India at the 2022 Commonwealth Games which the Kangaroos won by nine runs. Coming at number six, Haynes scored a crucial 18 not out off 10 balls. Not only one of the greatest players of her generation, @RachaelHaynes has been an outstanding contributor to the culture of our team. Congrats on an incredible career, Rach. We'll miss you pic.twitter.com/3dDBlfusXx Haynes, who made her international debut at Lord’s in 2009, played six Tests (383 runs), 77 ODIs (2585 runs) and 84 T20Is (850 runs) for the national side. She won two ODI World Cups and three T20 World Cups with the team. As per cricket.com.au , Haynes said in a statement, “Playing at this level isn’t possible without the support of many people. From clubs, states, coaches, family and friends, I’m so grateful to those who helped me along the way. In particular, I want to thank my parents Ian and Jenni, and partner Leah for their unwavering support.” She added, “The ability to help players transition smoothly has been instrumental to our team’s success. To be a leader within this environment has been the greatest privilege of my career.” Read more stories on Women's Cricket.","pubDate":"2022-09-14 22:34:46","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Haynes calls stumps on dominant career","link":"https://www.perthnow.com.au/sport/cricket/haynes-calls-stumps-on-dominant-career-c-8244129","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Veteran Rachael Haynes has retired from international cricket, leaving Australian selectors with a potential call to make on the side's captaincy.","content":"Rachael Haynes has become the first member of Australia's golden generation to retire from international cricket, ending her decorated career with a Commonwealth Games gold medal. Haynes ended months of speculation around her future on Thursday, calling time on a 13-year international career that included 167 games across all formats. The 35-year-old has also retired from domestic one-day cricket, but will commit to this summer's WBBL with the Sydney Thunder before ceasing to play entirely. Haynes' retirement leaves Cricket Australia with another potential captaincy decision to make, as she has been skipper Meg Lanning's deputy for the past five years. Lanning has taken an indefinite break from cricket for personal reasons, and is not guaranteed to return before Australia's next match in India in December. Alyssa Healy would be the most likely candidate to fill the role if required, after serving as Lanning's deputy for part of last summer when Haynes was injured. One of the world's best top-order batters, Haynes enjoyed a career split in two after she was forced to fight her way back into the team following the loss in the 2013 Ashes. She had to wait until 2017 to be recalled, taking over as captain almost immediately in that year's one-day World Cup. The left-hander scored more than half of her 3818 career runs from that point, averaging 41.25 since her return to the side in all formats. \"One of the great things about having a long career is watching those around you develop,\" Haynes said in a statement. \"I'm extremely proud of the way this team has brought players in and nurtured their development. \"The ability to help players transition smoothly has been instrumental to our team's success. \"To be a leader within this environment has been the greatest privilege of my career.\" Haynes' career includes wins in three T20 World Cups and two one-day titles, while she also sits fourth all-time in leading run-scorers in the Women's National Cricket League. Her retirement follows coach Matthew Mott's decision to walk away from the all-conquering Australian side earlier this year to take up the job as England's men's white-ball coach. In turn, she becomes the first member of the team to quit the international game since Alex Blackwell in early 2018. Australia's selectors have long set their eyes on succession planning, with Lanning (30), Healy (32) and Ellyse Perry (31) having all been part of the team for more than 12 years.","pubDate":"2022-09-14 22:02:53","image_url":"https://images.perthnow.com.au/publication/C-8244129/ad72654b30288cf94a7d2dd9bcfde91629ff1dff-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Wife’s orders: Hannant fighting Gallen for family pool","link":"https://www.themercury.com.au/sport/boxing-mma/paul-gallen-v-justin-hodges-ben-hannant-boxing-how-to-watch-livestream-time-fight-card/news-story/f658158c2bcb6217810d27671be0241f","keywords":["Boxing MMA"],"creator":null,"video_url":null,"description":"Ben Hannant said “no’’ three times to a fight with Paul Gallen before giving in to someone he had no chance of defeating … his wife.","content":"“I kept on saying no but we are building a new house and my wife (Emma) kept saying if I took this fight we could put a pool in,’’ Hannant said.“You know what they say – happy wife, happy life – so here we go.’’That yet-to-be-constructed pool – let’s call it the Paul Gallen Aquatic Centre – is set for a major workout.Hannant is a father of eight and while the new house gets built on his Gold Coast acreage, Hannant, Emma and their eight children have squeezed into a three bedroom, one bathroom cottage at the back of their property.Hannant is expected to fight warrior Gallen in the first of Gallen’s two fights at Nissan Arena before former fellow Bronco Justin Hodges takes the 41-year-old on an hour or so later.The night has become to boxing what the Big Bash is to cricket – an unusual spectacle which some (Hannant) rate as an entertainment event while others (Gallen) treat deadly seriously.“I definitely think what I am doing is all about entertainment,’’ Hannant said at Wednesday’s weigh-in.Watch Origin Rumble LIVE on Main Event available on Kayo & Foxtel, Thursday 15 September from 7pm AEST. ORDER NOW >“I would be kidding myself – and this is the mistake I made when I fought Hodgo – if I thought I could do in four weeks what boxers take 10 to 20 years to learn. You cannot do that.“I’m a dumb front-rower. We can absorb one or two key points, that’s all. We are going to be throwing sledgehammers. All you need is one or two to connect …’’Hannant, who really should change his nickname from the Polar Bear to the Grizzly Bear if he is to be treated seriously by the boxing world, was flashing his ready smile on fight eve but this is a dangerous night.Prize-fighter Gallen is no-one’s idea of Australia’s Tyson Fury but he is tough, experienced and ruthless.Gal v hodgo fact boxIt will be in his best interests to try and finish off Hannant as quickly as possible to conserve energy for Hodges.Hannant may consider it entertainment but there’s nothing entertaining about eating a leather sandwich for dinner when your kids are ringside so he must be prepared to handle some heavy treatment.When Hodges was knocked out by Darcy Lussick he said the most chastening part of the entire night in the ring was having his son Carter cry on the phone to him when he returned to the dressing room.Gallen Hodges pollIt raises the question about how boxers can shield their children to the fallout but Hannant has no reservations about bringing his clan. “It’s real life. A lot of time as parents we protect our kids and shelter them. This is the real world. You are going to have people go against what you believe. “The older kids are coming up for the fight. It’s a late night for them but it’s a win-win. They are proud of their dad for getting in and having a crack. If I win they will be proud and if I lose they get to take the piss out of me. We are family. We will together and we lose together and have fun. “I’ve done iron mans and marathons. I think if you face challenges and run towards them you are never the same again.’’","pubDate":"2022-09-14 20:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"POR vs SPA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for European Cricket Championship T10 2022 Match 17","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/portugal-vs-spain-dream11-prediction-european-cricket-championship-t10-2022?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-14 19:09:26","image_url":"https://static.sportskeeda.com/editor/2022/09/a1573-16631783155612-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Moeen Ali and Adil Rashid decline offer to represent England again in Test cricket - Reports","link":"https://www.sportskeeda.com/cricket/news-moeen-ali-adil-rashid-decline-offer-represent-england-test-cricket-reports?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Gokul Nair"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-14 19:09:26","image_url":"https://static.sportskeeda.com/editor/2022/09/7f2bc-16631774882011-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"World Wrestling Championships 2022: Vinesh Phogat clinches bronze; Nisha Dahiya remains in contention for medal","link":"https://www.firstpost.com/sports/world-wrestling-championships-2022-vinesh-phogat-clinches-bronze-medal-beats-swedens-jonna-malmgren-11255411.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"World Wrestling Championships 2022: Vinesh Phogat clinches bronze; Nisha Dahiya remains in contention for medal","content":"Sports World Wrestling Championships 2022: Vinesh Phogat clinches bronze; Nisha Dahiya remains in contention for medal FP Sports September 14, 2022 22:15:44 IST Vinesh Phogat with WFI coach Randhir Malik after winning the World Wrestling Championships bronze medal in Belgrade on Wednesday. Screenshot/UWW Vinesh Phogat defeated Sweden’s Jonna Malmgren 8-0 in the final of the 53kg repechage round to clinch the bronze medal at the World Wrestling Championships 2022 in Belgrade on Wednesday. Vinesh opened her account with two points in the first minute of the opening half. The remaining of the half saw Vinesh cautiously giving away no points while going into the 30-second break with 2-0 lead. The 28-year-old Indian dominated the second half with some comfort as she picked the next six points within two minutes to win the bout 8-0 (VPO: Points without the opponent scoring). The victory comes for Vinesh after she lost her opening bout on Tuesday and had to face criticism before luck favoured her with repechage round option opened for her. Nisha Dahiya remains in medal contention In the other Indian women’s wrestling bout on the day, Nisha Dahiya prominently kept herself in the medal run of the 68kg category. The 24-year-old wrestler showcased strong form on the day as she defeated all her rivals convincingly before narrowly losing her semifinal bout. Nisha defeated Danute Domikaityte (11-0), Adela Hanzlikcova (13-8) and Sofiya Georgieva (11-0) to book her semis spot. Facing Japan’s Ami Ishii, who won the U-20 World title earlier this year, Nisha looked favourite to take the bout as she took lead twice in the bout. However, the Japanese fought well to clinch the encounter in the closing seconds to qualify for the final. All other Indian women wrestlers competing on the day, couldn’t go the distance and had to return empty-handed. This included last year’s bronze medallist (59kg) Sarita Mor, who lost in the 57kg pre-quarters to Poland’s Anhelina Lysak Apart from her, Mansi Ahlawat lost in the 59kg quarterfinals to World No. 1 Jowita Maria Wrzesien (5-3). Both Lysak and Wrzesien lost in the semifinals; closing the repechage round doors for the Indians. Earlier on Tuesday, Vinesh suffered a shock defeat to Asian Championship silver medallist Khulan Batkhuyag (Mongolia) in the qualification round as the former World No. 1 lost 7-0 in her first bout of the tournament. Batkhuyag, however, went all the way to the final while opening Vinesh’s door to the repechage round that were scheduled on Wednesday. The three-time CWG gold medallist had little difficulty in reaching the final. Vinesh defeated 2022 Asian Championships bronze medallist Zhuldyz Eshimova (Kazakhstan) by fall (4-0) to reach the second round, where she earned a walkover with her opponent Leyla Gurbanova (Azerbaijan) opting out. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: September 15, 2022 00:37:22 IST TAGS: Vinesh Phogat World Wrestling Championships 2022 Wrestling","pubDate":"2022-09-14 19:07:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Vinesh-Phogat-Randhir-Malik.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"SC modifies BCCI’s constitution, office bearers can serve continuously for 12 years in State & BCCI","link":"https://kashmirreader.com/2022/09/15/sc-modifies-bccis-constitution-office-bearers-can-serve-continuously-for-12-years-in-state-bcci/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: The Supreme Court Wednesday allowed modification of BCCI’s constitution and paved the way for its President Sourav Ganguly and secretary Jay Shah to continue in office without having to serve the mandatory cooling-off period. A bench of Justices DY Chandrachud and Hima Kohli said that an office bearer can have continuous tenure of […]","content":"New Delhi: The Supreme Court Wednesday allowed modification of BCCI’s constitution and paved the way for its President Sourav Ganguly and secretary Jay Shah to continue in office without having to serve the mandatory cooling-off period. A bench of Justices DY Chandrachud and Hima Kohli said that an office bearer can have continuous tenure of 12 years which includes six years in State Association and six years in BCCI before the cooling-off period of three years triggers. The bench said that an office bearer can serve on a particular post for two consecutive terms, both at the BCCI and the State Association level, after which he would have to serve three years cooling-off period. “The purpose of the cooling-off period is not to create undesirable monopolies”, the bench said. The top court’s order came on the Board’s plea seeking to amend its constitution concerning the tenure of its office bearers including its President Sourav Ganguly and Secretary Jay Shah by doing away with the mandatory cooling-off period between tenures of office bearers across state cricket associations and the BCCI. The BCCI, in its proposed amendment, has sought the abolition of a cooling-off period for its office bearers which would enable Ganguly and Shah to continue in office as President and Secretary despite them having completed six years at respective state cricket associations. Earlier, the Justice R M Lodha-led committee had recommended reforms in the BCCI which have been accepted by the top court. The constitution of the BCCI, which was earlier approved by the top court, stipulates a mandatory three-year cooling-off period for anyone who had served two consecutive terms of three years each in the state cricket association or the BCCI. While Ganguly was an office bearer in the Cricket Association of Bengal, Shah had served in the Gujarat Cricket Association. —PTI SC modifies BCCI’s constitution, office bearers can serve continuously for 12 years in State & BCCI added by Press Trust of India on 12:29 am September 15, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-09-14 18:59:14","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"“Dhoni cannot go on forever and ever, right?”: Sridharan Sriram compares Mahmudullah with MS Dhoni while justifying his exclusion from Bangladesh T20 World Cup squad","link":"https://thesportsrush.com/cricket-news-dhoni-cannot-go-on-forever-and-ever-right-sridharan-sriram-compares-mahmudullah-with-ms-dhoni-while-justifying-his-exclusion-from-bangladesh-t20-world-cup-squad/","keywords":["Cricket","ICC T20 World Cup 2022","Mahmudullah","MS Dhoni","Sridharan Sriram"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sridharan Sriram compares Mahmudullah with MS Dhoni as former finds no place in Bangladesh’s T20 squad for upcoming T20 World Cup. Bangladesh’s most capped allrounder Mahmudullah has surprisingly been left out of Bangladesh’s 15-member squad due to travel Australia to partake in the imminent T20 World Cup in Australia. With experienced wicket-keeper batter Mushfiqur Rahim… The post “Dhoni cannot go on forever and ever, right?”: Sridharan Sriram compares Mahmudullah with MS Dhoni while justifying his exclusion from Bangladesh T20 World Cup squad appeared first on The SportsRush.","content":"Sridharan Sriram compares Mahmudullah with MS Dhoni as former finds no place in Bangladesh’s T20 squad for upcoming T20 World Cup. Bangladesh’s most capped allrounder Mahmudullah has surprisingly been left out of Bangladesh’s 15-member squad due to travel Australia to partake in the imminent T20 World Cup in Australia. With experienced wicket-keeper batter Mushfiqur Rahim having retired from T20Is a few days ago, Shakib-Al-Hasan will now lead a relatively young side in the 12-team shortest format World Championship title. Having failed to make it through to the ‘Super 4’ stage of the recently concluded Asia Cup 2022, Bangladesh have also decided to leave out the likes of Parvez Hossain Emon, Anamul Haque, Mahedi Hasan, and Mohammad Naim – all of who were part of Asia Cup, from the upcoming World Cup squad. As for the positives, Nurul Hasan Sohan and Liton Das claimed their spot back after recovering from their respective injuries. Technical Consultant of the Bangladesh T20 side , Sridharan Sriram, has compared Mahmudullah with former India skipper MS Dhoni, while justifying the experienced batter’s exclusion from the 15-member World Cup squad. Sriram exclaimed that Mahmudullah’s role in the side all these years has been that of a finisher, something which MS Dhoni was expected to do for the Indian Cricket team in the past as well, while batting at no.6. However, just like a renowned finisher like Dhoni cannot provide his services perennially, Sriram also reckons that the team needs to look beyond Mahmudullah in the T20 format, who can take the responsibility to fill in the big shoes of the 36-year-old. “I think our cricket team needs to have a succession plan. I have always equated Mahmudullah with MS Dhoni with the role that he performs for the team. He batted at No.6 just like Dhoni has done for India. He has finished off games. Dhoni cannot go on forever and ever, right? “You need to have a succession plan for who [next]. I think this was the right time to think of someone who can fill in Mahmudullah’s big shoes. You need someone. Unless we start playing players in that role, we won’t find them,” exclaimed Sriram.","pubDate":"2022-09-14 18:47:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians' Arjun Tendulkar to play for THIS team - full details inside","link":"https://zeenews.india.com/cricket/sachin-tendulkars-son-and-mumbai-indian-pacer-arjun-tendulkar-to-now-play-for-this-team-2510135.html","keywords":null,"creator":null,"video_url":null,"description":"The participating teams include Goa Cricket Association, Players Academy XI Delhi, HPCA, JKCA, Minerva Cricket Academy, UTCA Chandigarh, Players XI Bihar, Baroda Cricket Association, RBI Mumbai, PCA Colts and MPCA.","content":"Chandigarh: Legendary batter Sachin Tendulkar's son Arjun will feature in the 27th All-India J P Atray memorial cricket tournament beginning here from September 22, organising secretary Sushil Kapoor said on Wednesday. The 16 teams taking part in the tournament have been drawn into four pools of four sides each. \"Arjun Tendulkar (22-year-old left-arm pacer) will be playing in the tournament from the Goa Cricket Association side,\" Kapoor said at a press conference. The participating teams include Goa Cricket Association, Players Academy XI Delhi, HPCA, JKCA, Minerva Cricket Academy, UTCA Chandigarh, Players XI Bihar, Baroda Cricket Association, RBI Mumbai, PCA Colts and MPCA. \"We have been able to eke out a 12 days playing time encompassing 31 matches in six venues with the help and support of Punjab Cricket Association management, Chandigarh UT Sports Department and Haryana Sports Department,\" convener of the tournament Vivek Atray said. Over the years, the BCCI-recognised tournament has seen participation of more than 100 players who later have gone on to don the national colours. Chander Shekhar, a former Punjab police DGP and chairman of the organising committee of the tournament, said the winners will get a cash prize of Rs 2 lakh while the runners-up will get Rs 1 lakh. There will be a man-of-the-match award for each game, he said. \"Best batsman, best bowler and player of the tournament special prizes will be given during the finals,\" he said. \"This is the most prestigious and long standing cricket tournament in north India and has won a wide acclaim all over the country as being one of the best organised event.\" The tournament will be held at Maharaja Yadavindra Singh International Cricket Stadium, Mullanpur, I S Bindra Cricket Stadium, Mohali, Sector 16 cricket stadium, Chandigarh, Tau Devi Lal Cricket Stadium, Panchkula and GMSS, Sector 26, Chandigarh. The finals will be played on October 3 at Mohali. With PTI inputs","pubDate":"2022-09-14 18:11:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Why are Andre Russell and Sunil Narine not playing ICC T20 World Cup in Australia?","link":"https://thesportsrush.com/cricket-news-why-are-andre-russell-and-sunil-narine-not-playing-icc-t20-world-cup-in-australia/","keywords":["Cricket","Andre Russell","ICC T20 World Cup 2022","Sunil Narine","West Indies"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Andre Russell and Sunil Narine not playing: The star West Indian all-rounders have been dropped from the T20 World Cup squad. Andre Russell and Sunil Narine – two world-class all-rounders especially in the T20 format, have not been included in the 15-member West Indies squad which will tour Australia to partake in the imminent T22… The post Why are Andre Russell and Sunil Narine not playing ICC T20 World Cup in Australia? appeared first on The SportsRush.","content":"Andre Russell and Sunil Narine not playing: The star West Indian all-rounders have been dropped from the T20 World Cup squad. Andre Russell and Sunil Narine – two world-class all-rounders especially in the T20 format, have not been included in the 15-member West Indies squad which will tour Australia to partake in the imminent T22 World Cup 2022. With Southpaw batter Nicholas Pooran set to lead the side, there have been a few other surprise selections as well, along with the exclusions of the aforementioned big names in the world of T20 Cricket. Uncapped players in 30-year-old wrist spinner Yannic Carriah, and left-arm seam-bowling allrounder Raymon Riefer make it to the 15-member World Cup squad, over the regulars in leg-spinner Hayden Walsh and Romario Shephard. At the top of the order, wicket-keeper Johnson Charles, on the back of his decent enough numbers in CPL 2022 so far, marks his return back to the side, having last played a T20I in December 2016. Also, Evin Lewis, who has been failing to meet the fitness standards in the past few months, has been given the affirmative nod. He will join the likes of Brandon King and Kyle Mayers, as the other options in the top-order. With room for just one left-arm spinner in the squad, as per Cricket West Indies chief selector Desmond Haynes, Akeal Hosein has been preferred over Fabien Allen. ICYMI: CWI has announced the 15-man squad for the Men’s T20 World Cup 2022 in Australia! #MenInMaroon #T20WorldCup More details⬇️ https://t.co/t6ils9Xdox pic.twitter.com/GKxgCHZcvG — Windies Cricket (@windiescricket) September 14, 2022 Having managed to score mere 34 runs across 4 innings at an average of mere 8.50 in CPL 2022 for far, Andre Russell has been dropped from the 15-member squad, with past reputation being no ground for selection, as per Haynes. “We had a meeting with Andre Russell earlier in the year,” Haynes said. “We’re still not convinced yet, he’s not performing as well as we would like to see him in the competition. I think in the situation with Andre Russell, we’ve just decided to just move on, and look for someone who’s in form, and doing well in the T20 format,” exclaimed Haynes. As for Narine, who has not yet been able to get his issues resolved with the West Indies Cricket Board, the 34-year-old has, alike the 2021 T20 World Cup been left out of the squad yet again. “Yes, again, the captain [Nicholas Pooran] told me he’s reached out to Narine, but I’m not too sure he wants to play,” Haynes remarked when queried about Narine.","pubDate":"2022-09-14 17:35:00","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Wishes pour in for Robin Uthappa as he retires from all forms of cricket","link":"https://www.indiatvnews.com/sports/cricket/robin-uthappa-retires-wishes-pour-for-him-on-twitter-2022-09-14-808335","keywords":null,"creator":null,"video_url":null,"description":"Robin Uthappa announced his retirement from all forms of cricket on Wednesday, 14 September. The veteran batter last played for India in 2015 and played for CSK in the 2022 season.","content":"Robin Uthappa announced his retirement from all forms of cricket on Wednesday, 14 September. The veteran batter last played for India in 2015 and played for CSK in the 2022 season. \"It has been my greatest honour to represent my country and my state, Karnataka. However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket,\" Uthappa tweeted. As expected, Twitter poured in with wishes for the 36-year-old. Here are the best reactions. Robin has played all 15 seasons of . He has played for six teams - Chennai Super Kings, Mumbai Indian, Kolkata Knight Riders, Royal Challengers Bangalore, Pune Warriors India, and Rajasthan Royals. During his IPL journey, Uthappa played 205 matches and scored 4952 runs with an average of 27.51. He has played 46 ODIs and has scored 934 runs including six half-centuries with an average of 25.94. In 13 matches in the shortest format of cricket, Uthappa amassed 249 runs at an average of 24.90. Numbers aside, Robin has had a great impact on the game and here's wishing him a great future ahead with a cracker of a new innings.","pubDate":"2022-09-14 16:48:46","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-West Indies recall Lewis for T20 World Cup, Russell and Narine left out","link":"https://www.thestar.com.my/sport/cricket/2022/09/15/cricket-west-indies-recall-lewis-for-t20-world-cup-russell-and-narine-left-out","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - West Indies recalled opener Evin Lewis on Wednesday for the Twenty20 World Cup in Australia but excluded all-rounder Andre Russell and spinner Sunil Narine as part of their 15-man squad. Read full story","content":null,"pubDate":"2022-09-14 16:41:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/09/15/1737645.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"“Two things I always remember”: Irfan Pathan states what Robin Uthappa will always be remembered for as he retires from all forms of Indian Cricket","link":"https://thesportsrush.com/cricket-news-two-things-i-always-remember-irfan-pathan-states-what-robin-uthappa-will-always-be-remembered-for-as-he-retires-from-all-forms-of-indian-cricket/","keywords":["Cricket","Irfan Pathan","Robin Uthappa"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Irfan Pathan states what Robin Uthappa will always be remembered for, after latter decides to bid adieu from all forms of Indian Cricket. Former India all-rounder Irfan Pathan has congratulated his fellow ICC Twenty20 World Cup 2007 winning teammate Robin Uthappa on his stellar career, after the latter, on Thursday, decided to retire from all… The post “Two things I always remember”: Irfan Pathan states what Robin Uthappa will always be remembered for as he retires from all forms of Indian Cricket appeared first on The SportsRush.","content":"Irfan Pathan states what Robin Uthappa will always be remembered for, after latter decides to bid adieu from all forms of Indian Cricket. Former India all-rounder Irfan Pathan has congratulated his fellow ICC Twenty20 World Cup 2007 winning teammate Robin Uthappa on his stellar career, after the latter, on Thursday, decided to retire from all forms of Indian and International Cricket. Having last featured in a competitive Cricket match for his former IPL franchise Chennai Super Kings (CSK) in this year’s IPL, Uthappa began his domestic Cricket years for his state team Karnataka in 2002-03, and ended while playing for Kerala during the 2020-21 season. Amidst all these years, he represented team India across 46 ODIs (scoring 934 runs) and 13 T20Is (scoring 249 runs), at an average of 25.94 and 24.90 respectively. While he donned his Indian team jersey for the final time during the limited-Overs tour of Zimbabwe in 2015, he also played for Saurashtra during the 2017-18 and 2018-19 seasons. As for his IPL career , the 36-year-old, while representing six franchise across 15 seasons, will finish his career as the ninth highest run-scorer (until the previous season), piling on 4952 runs across 205 matches, at a strike rate of 130.35 and an average of 27.51, with the help of 27 half-centuries. Post Uthappa breaking his retirement news, Irfan Pathan too took to his social media handle, to not only congratulate the former for being a stellar contributor to Indian Cricket and the IPL, but also reminisced two aspects of his game and personal self, which will always have a place in his memory. While Pathan mentioned how he would never forget him (Uthappa) smashing one of the fastest pacers back then – Mitchell Johnson, for two Sixes during the 2007 Twenty20 World Cup semis, he also hilariously mentioned how he would walk away from him whenever he (Pathan) troubled him. Two things I always remember. You Walking down to one of the fastest bowler of that time n hitting him for a six and also walking away when I troubled you;) @robbieuthappa You should be proud of yourself in your career my brother, ur contribution 4 team india n in ipl is immense. pic.twitter.com/wTIFN8R0RC — Irfan Pathan (@IrfanPathan) September 14, 2022 pic.twitter.com/WXV5GrSUKx — iqram ismail (@ikkuiqram) September 14, 2022 For more Cricket-related news, click here .","pubDate":"2022-09-14 16:31:20","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India's T20 World Cup winner Robin Uthappa retires from all forms of cricket","link":"https://www.thehansindia.com/sports/cricket/indias-t20-world-cup-winner-robin-uthappa-retires-from-all-forms-of-cricket-761740","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Robin Uthappa made his India debut in 2006He helped KKR win the IPL in 2014Uthappa last played for India in 2015","content":"Robin Uthappa made his India debut in 2006 India's T20 World Cup winner Robin Uthappa on Wednesday announced his retirement from all forms of cricket. Uthappa, who made his India debut in 2006, played a key part in the Men in Blue winning the inaugural edition of the T20 World Cup in South Africa in 2007. He became a popular name in the country when he helped India win the bowl-out against Pakistan in what was the very first meeting between the rivals in the T20Is. In the final, while Uthappa did not contribute much with the bat, he inflicted a run out and took a catch. Uthappa scored 113 runs in six innings and was India's fourth leading run-scorer in the tournament after Gautam Gambhir, MS Dhoni, Yuvraj Singh, and Virender Sehwag. \"It has been my greatest honour to represent my country and my state, Karnataka. However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket,\" Uthappa wrote on Twitter. \"It's been 20 years since I started playing professional cricket and it has been the greatest honour to represent my country and state, Karnataka - a wonderful journey full of ups and downs; one that has been fulfilling, rewarding, and enjoyable, and has allowed me to grow as a human being,\" the 36-year-old wrote in a statement. It has been my greatest honour to represent my country and my state, Karnataka. However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket. Thank you all ❤️ pic.twitter.com/GvWrIx2NRs \"However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket. While I will spend significant time with my young family, I look forward to chatting a new phase of my life,\" the batsman added further. Uthappa's statement read he would be retiring from \"all forms of Indian cricket,\" meaning he could soon be seen playing in T20 leagues overseas. In fact, he has reportedly obtained a no-objection Certificate (NOC) from Kerala, the last state he played for in domestic cricket, and will be free to take up assignments in overseas T20 leagues and \"charting a new phase in my life,\" according to ESPNCricinfo. Uthappa never managed to capitalised on his T20 World Cup success in 2007. The following year, he had a poor year in international cricket in 2008, scoring only 179 runs in 11 ODI innings. As a result, he was dropped from the Indian team. It took him time to deliver in the domestic circuit as well after that. Finally, in the 2013-14 season, he had a superb domestic season in which Karnataka completed a rare treble - winning the Ranji Trophy, Irani Cup, and Vijay Hazare Trophy. The Karnataka batsman carried the form into the Indian Premier League (IPL). His move to Kolkata Knight Riders (KKR) paid off as he scored 40 or more in 10 successive innings in the IPL 2014. He helped KKR win the title as he finished as the tournament with most runs – 600 – and that saw him return to the Indian national team. Team India roped in Uthappa for the tour to Bangladesh for the ODI series in 2014, where he made one fifty in a series of rain-interrupted matches. While Uthappa never managed to play Tests for India, he represented India 59 times (46 ODIs and 13 T20Is). However, he had a fine record in First-Class as he accumulated 9,446 runs in 142 games at an average of 40.71, including 22 centuries and 52 fifties. He had a nine-year career with India between 2006 and 2015.","pubDate":"2022-09-14 15:58:52","image_url":"https://assets.thehansindia.com/h-upload/2022/09/14/500x300_1312337-robin-uthappa.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 WC winner Robin Uthappa announces retirement from all forms of cricket","link":"https://www.business-standard.com/article/sports/t20-wc-winner-robin-uthappa-announces-retirement-from-all-forms-of-cricket-122091401130_1.html","keywords":null,"creator":null,"video_url":null,"description":"The right-handed batter said it has been \"greatest honour\" to represent India and Karnataka during this illustrious career.","content":"Former India opener Robin Uthappa on Wednesday announced his retirement from all forms of Indian cricket . Uthappa shared a heartfelt post announcing his retirement from all forms of cricket on social media. The right-handed batter said it has been \"greatest honour\" to represent India and Karnataka during this illustrious career. \"It has been my greatest honour to represent my country and my state, Karnataka. However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket . Thank you all,\" Uthappa said on the Koo app. Uthappa played the 2004 Under-19 World Cup. He made his international debut two years later and featured in 46 ODIs and 13 T20Is for India. \"It's been 20 years since I started playing professional cricket, and it has been the greatest honour to represent my country and state, Karnataka- wonderful journey of ups and downs; one that has been fulfilling, rewarding, enjoyable and has allowed me to grow as a human being,\" Uthappa further said in the post. The stylish batter was a part of the Indian side which lifted the inaugural T20 World Cup in 2007 in South Africa. The batter from Karnataka has won two IPL trophies-- one for KKR and one for CSK in 2014 and 2021 respectively. --IANS cs (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-09-14 15:44:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220914/thumb-122091401130.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Robin Uthappa retirement: Is Robin Uthappa retired from IPL?","link":"https://thesportsrush.com/cricket-news-robin-uthappa-retirement-is-robin-uthappa-retired-from-ipl/","keywords":["Cricket","Indian Premier League","IPL","Robin Uthappa"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Robin Uthappa retirement: The 36-year-old last played for the Chennai Super Kings (CSK) in the 15th season of the IPL this year. Team India’s right-handed batter, and an important part of the MS Dhoni-led side that lifted the inaugural edition of the ICC Twenty20 World Cup in 2007, Robin Uthappa, has decided to retire from… The post Robin Uthappa retirement: Is Robin Uthappa retired from IPL? appeared first on The SportsRush.","content":"Robin Uthappa retirement: The 36-year-old last played for the Chennai Super Kings (CSK) in the 15th season of the IPL this year. Team India’s right-handed batter, and an important part of the MS Dhoni-led side that lifted the inaugural edition of the ICC Twenty20 World Cup in 2007, Robin Uthappa, has decided to retire from all forms of Indian Cricket. “It has been my greatest honour to represent my country and my state, Karnataka. However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket. Thank you all!,”, remarked Uthappa, before thanking each and everyone involved in his journey so far, as he took to his social media handle to break the news. It has been my greatest honour to represent my country and my state, Karnataka. However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket. Thank you all ❤️ pic.twitter.com/GvWrIx2NRs — Robin Aiyuda Uthappa (@robbieuthappa) September 14, 2022 Uthappa, who commenced his domestic career for Karnataka in the 2002-03 season, played his last competitive Cricket match for the IPL franchise Chennai Super Kings (CSK) on May 2022, at the Wankhede Stadium in Mumbai. The 36-year-old scored 934 runs across 46 ODIs for India and 249 runs in 13 T20Is, at an average of 25.94 and 24.90 respectively, having last represented his country during the limited-Overs tour of Zimbabwe in 2015. Perhaps having his eyes set on participating in the various T20 leagues outside BCCI’s ambit, Uthappa, f ollowing Suresh Raina from around a week ago, will now have to do away with the IPL as well. Despite him being roped in by the CSK ahead of the previous season mega auction at the base price of INR 2 Crore, Uthappa will, after today’s decision, no longer take part in the cash-rich league, which will begin with its 16th season next year. Uthappa featured in all the 15 seasons of the IPL, while representing as many as six franchises – Chennai Super Kings, Kolkata Knight Riders, Mumbai Indians, Pune Warriors India, Royal Challengers Bangalore and Rajasthan Royals. Across 205 IPL matches in his career, the right-hander amassed 4952 runs at a strike rate of 130.35 and an average of 27.51, with the help of 27 half-centuries. He was a crucial part of CSK that lifted the 2021 IPL title, and was also an integral part of the Kolkata Knight Riders that had won the title in 2012 and 2014 under Gautam Gambhir.","pubDate":"2022-09-14 15:26:35","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"‘Bro, I’ve To Bowl' - When Robin Uthappa turned India's hero with ball in 2007 T20 World Cup","link":"https://www.indiatvnews.com/sports/cricket/bro-i-ve-to-bowl-when-robin-uthappa-turned-india-s-hero-with-ball-in-2007-t20-world-cup-2022-09-14-808314","keywords":null,"creator":null,"video_url":null,"description":"Wednesday (September 14) evening saw another star of the famous 2007 T20 World Cup drop curtains on his career as Robin Uthappa called time on a successful stint with Team India. Now the former star of Indian cricket, he had a great time with the Indian team before he decided to say goodbye. One such incident took place in the 2007 T20 World Cup.","content":"Wednesday (September 14) evening saw another star of the famous 2007 T20 World Cup drop curtains on his career as Robin Uthappa called time on a successful stint with Team India. Now the former star of Indian cricket, he had a great time with the Indian team before he decided to say goodbye. One such incident took place in the 2007 T20 World Cup. While the Indian team is preparing for the upcoming T20 World Cup in Australia to end its trophy drought, Robin Uthappa will have good memories of the day. Exactly, 15 years ago Uthappa and a young Team India led by won the only ball-out in T20 history against arch-rivals Pakistan in Durban. Having played only a handful of T20 matches, Team India entered the 2007 T20 World Cup on the back of a disappointing ODI triumph in the West Indies. On a cold night in Durban, India put only 141 runs on board against Pakistan. After a nail-biting finish to the contest, the match went into ball-out and surprisingly, Uthappa who had been a batting hero just a week before in England was a bowling sensation. Uthappa said. As they say, the rest is history, India would beat Pakistan in the group stage in ball-out, while later going on to win the whole thing on September, 24 in Johannesburg. The date 14 September will go down as a special occasion for Uthappa as he won a World Cup match with the ball and announced his retirement.","pubDate":"2022-09-14 15:08:21","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Robin Uthappa Retirement: भारतीय क्रिकेटर रॉबिन उथप्पा ने इंटरनेशनल क्रिकेट को कहा अलविदा","link":"https://www.abplive.com/sports/cricket/indian-cricketer-robin-uthappa-announced-retirement-from-all-forms-of-indian-cricket-2215745","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Robin Uthappa: भारतीय क्रिकेटर रॉबिन उथप्पा ने इंटरनेशनल क्रिकेट को अलविदा कह दिया है. दरअसल, बुधवार को इस भारतीय बल्लेबाज ने इंटरनेशनल क्रिकेट को अलविदा कहने का ऐलान किया. रॉबिन उथप्पा भारत के लिए वनडे और टी20 फॉर्मेट में खेल चुके हैं. साथ ही रॉबिन उथप्पा साल 2007 में महेन्द्र सिंह धोनी की अगुवाई में टी20 वर्ल्ड कप जीतने वाली टीम का हिस्सा थे. रॉबिन उथप्पा ने साल 2006 में किया था इंटरनेशनल डेब्यू गौरतलब है कि रॉबिन उथप्पा ने साल 2006 में भारत के लिए डेब्यू किया था. इससे पहले वह भारत की 2004 अंडर-19 विश्व कप टीम का हिस्सा थे. रॉबिन उथप्पा ने भारत के लिए 46 वनडे मैचों के अलावा 13 टी20 मैच भी खेले. 2007 में दक्षिण अफ्रीका में उद्घाटन टी20 विश्व कप जीतने के अलावा वह दो बार आईपीएल खिताब 2014 में कोलकाता नाइट राइडर्स के साथ और 2021 में चेन्नई सुपर किंग्स के साथ जीता. इसके अलावा उन्होंने कर्नाटक के साथ कई घरेलू खिताब भी जीते. वह आईपीएल में 3 बार ऑरेंज कैप विजेता रह चुके हैं. It has been my greatest honour to represent my country and my state, Karnataka. However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket.Thank you all ❤️ pic.twitter.com/GvWrIx2NRs — Robin Aiyuda Uthappa (@robbieuthappa) September 14, 2022 'देश और अपने राज्य का प्रतिनिधित्व करना मेरे लिए सबसे बड़ा सम्मान' रॉबिन उथप्पा ने अपने रिटायरमेंट के बाद एक ट्वीट किया. इस ट्वीट में उन्होंने लिखा  अपने देश और अपने राज्य कर्नाटक का प्रतिनिधित्व करना मेरे लिए सबसे बड़ा सम्मान रहा है, हालांकि, सभी अच्छी चीजों का अंत होना चाहिए. उन्होंने आगे लिखा कि मैंने भारतीय क्रिकेट के सभी प्रारूपों से संन्यास लेने का फैसला किया है, आप सभी को धन्यवाद. साथ ही उन्होंने लिखा कि मुझे पेशेवर क्रिकेट खेलना शुरू किए 20 साल हो गए हैं और यह मेरे देश और राज्य, कर्नाटक का प्रतिनिधित्व करने के लिए सबसे बड़ा सम्मान रहा है. ये भी पढ़ें- INDW vs ENGW 2022: इंग्लैंड को हराने के बाद कप्तान हरमनप्रीत कौर का बयान, कहा- कॉन्फिडेंस और सही रणनीति से मिली जीत ICC ODI Batsman Ranking: स्टीव स्मिथ करीब 5 साल बाद टॉप-10 में शामिल, बाबर आजम की बादशाहत बरकरार","content":null,"pubDate":"2022-09-14 14:54:33","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Ex-England cricketer Chris Tremlett’s astonishing body transformation from skinny bowler to bodybuilder","link":"https://www.thesun.co.uk/sport/19806707/england-cricketer-tremlett-major-body-transformation/","keywords":["Cricket","Sport","Ashes","Bodybuilding","Instagram"],"creator":["Tony Robertson"],"video_url":null,"description":null,"content":"EX-ENGLAND cricketer Chris Tremlett has undergone a stunning body transformation since retiring from cricket. Tremlett, a former fast-medium bowler, retired from all forms of cricket in 2015 after taking specialist advice to call time on his injury-riddled career. Instagram/@christremlett33 Chris Tremlett shows off his muscles on his Instagram[/caption] Instagram/@christremlett33After retiring from cricket in 2015, Tremlett has gone on to become a fitness lover[/caption] Tremlett had a far leaner build during his time as a cricketerAction Images - Reuters But now at the age of 41, you would be hard-pressed to recognise him as a former England cricketer. These days Tremlett is an avid fitness lover, and regularly shows off his body transformation on his Instagram page. He almost has 14,000 followers, who he keeps up to date with regular posts about his fitness regime. Standing at 6ft 7″, Tremlett was never one who could be easily lost in a crowd, but now paired with his new mega muscles it would be easy to mistake him for a career bodybuilder. READ MORE IN CRICKET CRAWL TO VICTORY England smash SA by nine wickets to win Test & series after Crawley knock BET BOOST How to get free bets on horse racing - the best bookies for offers and rewards During his career in cricket, Tremlett played for Hampshire and Surrey at county level. For England he played 12 tests between 2007-2013, taking 53 wickets. Though he is best known for his heroics in the 2010-11 Ashes series, as he finished as the leading-wicket taker on either side. Meanwhile, in ODI cricket he took 15 wickets in as many innings and took 75 wickets in just 59 matches in T20 format. Most read in Football Mus-t be joking Chelsea fans say the same thing after selling Jamal Musiala for just £180k FAN FURY Bayern Munich fans display banner slamming Uefa's response to the Queen's death SPORTING 2 TOTTENHAM 0 Spurs COLLAPSE in injury time to lose first match since April SETTING UP CAMP Chelsea offer PSG chief Luis Campos £135k a week as sporting director JAK THE LAD Everton sign Eldin Jakupovic on a free as Lampard fights keeper injury crisis SHIRT HAPPENS England's kits for World Cup 'leaked online' - with nod to past iconic shirts JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) His final England appearance of any level came against Australia in 2013, as his career was looked back upon with many wondering what could have been if Tremlett’s body had been more durable. Injuries were a constant nuisance in his career, with hamstring injuries and back injuries being particularly difficult to due to their recurring nature. In 2020, Tremlett recalled an incident with Jimmy Anderson where he broke his compatriot’s ribs ahead of the 2010-11 Ashes series. He told the Daily Mail: “We were put in a boxing ring to spar against each other and for some reason I was up against Jimmy Anderson. Read More on The Sun 'DISGUSTING' Royal fans complain about 'disrespectful' gestures at Queen's procession EMOTIONAL WALK Heartbroken fans say same thing about Harry & William in Queen's procession “It was 20 seconds of trying to whack the s*** out of the other guy and I hit Jimmy pretty hard and cracked one of his ribs. “Luckily he was able to quickly come back because it would have been a disaster if he hadn’t been able to bowl in the first couple of Tests.”","pubDate":"2022-09-14 14:48:35","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"CSA still struggling to attract sponsors as new domestic season approaches","link":"https://www.iol.co.za/sport/cricket/domestic/csa-still-struggling-to-attract-sponsors-as-new-domestic-season-approaches-d4a7396a-c74b-4709-88a8-13b7207fd1ff","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Another season of domestic season is approaching with Cricket South Africa still struggling to attract any sponsors for the various local competitions.","content":null,"pubDate":"2022-09-14 14:42:54","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/d5048009-409b-530b-ab36-fdfec87051cb&operation=CROP&offset=0x151&resize=3543x1992","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Babar Azam’s celebrated cover drive gets place in science text book of Pakistan","link":"https://www.tribuneindia.com/news/sports/babar-azams-celebrated-cover-drive-gets-place-in-science-text-book-of-pakistan-431702","keywords":null,"creator":null,"video_url":null,"description":"Chandigarh, September 14Pakistan's flamboyant batter Babar Azam has accomplished a significant renown over the past few years. His consistency has been able to keep him at the top in ICC ODI rankings for quite some time now.Babar's cover drive is so famed that a question related to him got featured in Class 9 Physics textbook in Pakistan. The photo of the textbook page has been doing the round across social media platforms.A question about Babar Azam's cover drive has made it to the Physics syllabus of Class 9 in Pakistan #Cricket pic.twitter.com/QXvH5irBoF— Saj Sadiq (@SajSadiqCricket) September 14, 2022In an example of the textbook, tweeted out by a Pakistani journalist Shiraz Hassan, the question can be seen as, \"Babar Azam has hit a cover drive by giving kinetic energy of 150j to the ball by his bat. (a) At what speed will the ball go to the boundary if the mass of the ball is 120 g? (b) How much kinetic energy a footballer must impart to a football of mass 450 g to make it move at this speed? Since being shared, the tweet has garnered over 3,900 likes.","content":null,"pubDate":"2022-09-14 14:39:14","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1779355547.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Robin Uthappa retires from Indian cricket","link":"https://www.tribuneindia.com/news/sports/robin-uthappa-retires-from-indian-cricket-431698","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, September 14 Right-handed batter Robin Uthappa on Wednesday announced his retirement from all forms of Indian cricket. The 2007 T20 World Cup-winning batter, who last played for India in 2015, took to Twitter to announce his decision. \"It's been 20 years since I started playing professional cricket, and it has been the greatest honour to represent my country and state, Karnataka- wonderful journey of ups and downs; one that has been fulfilling, rewarding, enjoyable and has allowed me to grow as a human being. However, all good things must come to an end and with a grateful heart I have decided to retire from all forms of Indian cricket. While I will spend a significant time with my young family, I look forward to charting a new phase in life,\" he wrote in his farewell note. He also thanked all the IPL teams he has played so far. In the Indian Premier League, he played for Chennai Super Kings last season. He also appeared for Mumbai Indians, Royal Challengers Bangalore, Pune Warriors India, Rajasthan Royals and Kolkata Knight Riders in the 14 years of IPL. In domestic cricket, he represented Karnataka, Saurashtra and Kerala, respectively. --IANS Koo App It has been my greatest honour to represent my country and my state, Karnataka. However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket. Thank you all ❤️ View attached media content - Robin Uthappa (@robinuthappa) 14 Sep 2022","content":null,"pubDate":"2022-09-14 14:39:01","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_217069028.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Robin Uthappa retires from all forms of Indian cricket","link":"https://www.moneycontrol.com/news/sports/robin-uthappa-retiresall-formsindian-cricket_16622981.html","keywords":null,"creator":null,"video_url":null,"description":"\"All good things must come to an end\",\" the 36-year-old Robin Uthappa said, as he drew curtains over his two decades of career as a cricketer.","content":null,"pubDate":"2022-09-14 14:36:52","image_url":null,"source_id":"money_control","country":["india"],"category":["sports"],"language":"english"},{"title":"World T20 winner Robin Uthappa retires from all forms of cricket","link":"https://www.firstpost.com/firstcricket/sports-news/csk-player-robin-uthappa-retires-from-all-forms-of-cricket-11254841.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"World T20 winner Robin Uthappa retires from all forms of cricket","content":"Indian batter Robin Uthappa decided to call it a day on Wednesday as the 36-year-old cricketer took to Twitter on Wednesday (14 September 2022) to announce his retirement from all forms of cricket.“It has been my greatest honour to represent my country and my state, Karnataka. However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket,” read an excerpt of his long tweet.It has been my greatest honour to represent my country and my state, Karnataka. However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket.Thank you all ❤️ pic.twitter.com/GvWrIx2NRs— Robin Aiyuda Uthappa (@robbieuthappa) September 14, 2022Uthappa was part of the Team India squad that lifted the inaugural World T20 trophy in South Africa in 2007. He also started his international career with a blast by scoring a record 86 against England on 15 April 2006 in ODIs.Uthappa played for multiple IPL franchises since the inaugural season in 2008, starting with Mumbai Indians. He moved to Royal Challengers Bangalore in 2009 befor moving to now-defunct Pune Warriors in 2011. The Karnataka batter, Ranji debut in 2022, moved to Kolkata Knight Riders in 2014 and won the IPL that season. He also scored 660 runs that season at a strike rate of 138.At the fag end of his career, the cricketer moved to Rajasthan Royals in 2020 before being moved to Chennai Super Kings in 2021. CSK bought back the batter at the mega auction earlier this year at his base price of Rs 2 crore. In total, he scored 4952 runs (ninth in the all-time top-scorers) in the T20 franchise league with the highest score of 88. He scored 27 fifties as well.For India, he played 59 international matches (46 ODIs) and scored 1042 runs (211 in T20Is) but never scored a century at the highest level. Uthappa, however, never featured in Test cricket.“It’s been 20 years since I started playing professional cricket and it has been the greatest honour to represent my country and state, Karnataka – a wonderful journey full of ups and downs; one that has been fulfilling, rewarding, and enjoyable and has allowed me to grow as a human being,” the player wrote further.“However, all good things must come to an end, and with a grateful heart, I have decided to retire from all forms of Indian cricket. While I will spend significant time with my young family, I look forward to chatting a new phase of my life,” he further continued.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-14 14:34:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Robin-Uthappa-CSK-RCB-IPL-2022-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-England rope in Hussey, Saker as consultants for T20 World Cup","link":"https://www.thestar.com.my/sport/cricket/2022/09/14/cricket-england-rope-in-hussey-saker-as-consultants-for-t20-world-cup","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England have added former Australia batsman Michael Hussey and the ex-bowling coach David Saker to their backroom staff for the Twenty20 World Cup, the country's cricket board (ECB) said on Wednesday. Read full story","content":"(Reuters) - England have added former Australia batsman Michael Hussey and the ex-bowling coach David Saker to their backroom staff for the Twenty20 World Cup, the country's cricket board (ECB) said on Wednesday. Hussey, batting coach of Indian Premier League franchise Chennai Super Kings, and Australian Saker, who was England's bowling coach from 2010 to 2015, will work as consultants alongside head coach Matthew Mott. \"Saker will join the tourists in Pakistan for the seven-match tour preceding the World Cup,\" the ECB said in a statement, with Hussey coming on board for the tournament that gets underway in Australia on Oct. 16. England, who have not won the T20 World Cup since 2009, also play Australia in a three-match series before kicking off their campaign against Afghanistan on Oct. 22. (Reporting by Dhruv Munjal in Bengaluru; Editing by Christian Radnedge)","pubDate":"2022-09-14 14:28:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/09/14/1737387.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Aiden Markram still has a bright future in Test cricket, says Proteas captain Dean Elgar","link":"https://www.iol.co.za/sport/cricket/proteas/aiden-markram-still-has-a-bright-future-in-test-cricket-says-proteas-captain-dean-elgar-0cd6eefe-34e9-413f-9e5b-979d920b6a7a","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Proteas captain Dean Elgar has backed Aiden Markram to rediscover his form and establish himself in the team in the future.","content":null,"pubDate":"2022-09-14 14:17:10","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/bd8a4c52-90cc-5c50-9df7-f2a5ae3be82e&operation=CROP&offset=0x0&resize=6000x3371","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"}]}