{"newsArray":[{"title":"England cricket news 2022: Ben Stokes new captain, reaction, James Anderson and Stuart Broad recalled, team, Joe Root","link":"https://www.foxsports.com.au/cricket/countries/england/england-cricket-news-2022-ben-stokes-new-captain-reaction-james-anderson-and-stuart-broad-recalled-team-joe-root/news-story/52ee879073ab880665842e7a721a321a","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes has agreed to take on the challenge and fill the void left behind by Joe Root as England’s new men’s Test captain, according to multiple reports.","content":null,"pubDate":"2022-04-27 21:33:00","full_description":"Ben Stokes has agreed to take on the challenge and fill the void left behind by Joe Root as England’s new men’s Test captain, according to multiple reports. And Stokes has already made his mark as the new skipper, telling new managing director Rob Key he wants James Anderson and Stuart Broad recalled into the side. Anderson (40 years old) and Broad (35) will still need to be rotated in and out of the squad so that the workload is not too demanding on either but nonetheless, Stokes wants both to be a key part of the set-up. Watch The 2022 Indian Premier League on Kayo. Every Match Live & On-Demand. New to Kayo? Try 14-Days Free Now > End of the King? Kohli's 2 golden ducks! | 01:23 The fast-bowling pair were left out of the West Indies tour in a controversial move that drew immediate and very public criticism from Broad, who said he was “blindsided” by the decision. “Neither Jimmy nor I saw this coming,” he wrote at the time. Stokes is said to have met with Key for talks on Tuesday, where he was offered the captaincy honour after Root stepped down from the role earlier this month. While Stokes has limited experience as skipper, he was vice-captain for the majority of Root’s time at the helm and was widely-tipped as the man to take England forward. The Telegraph’s Oliver Brown though wrote in his column that while Stokes had the final say on whether to take on the role, it could nevertheless prove “borderline irresponsible” to burden him with the captaincy. Ben Stokes is set to take over the captaincy. (Photo by William WEST / AFP) Source: AFP “Ben Stokes is just nine months removed from mental health problems so acute that he announced an indefinite hiatus from cricket,” he wrote. Be it breaking his wrist after punching a dressing-room locker or an expletive-ridden outburst at a fan in Johannesburg in 2020, Brown worried how Stokes will handle the increased pressure. “Stokes’ pattern of behaviour suggests he does not take kindly to being judged,” he wrote. “As England captain, though, he will not have much choice in the matter. From the second he leads out his team for the first Test against New Zealand at Lord’s in June, his every move will be subject to merciless scrutiny. It looks, frankly, like an implosion waiting to happen.” Not everyone subscribed to that view though, with England Test great Michael Vaughan writing in the wake of Root stepping down that Stokes was the “only person” for the job. “He’s got a great cricket brain - you can see that when he bats. And his will to win is incredible,” Vaughan wrote in The Telegraph at the time. Ben Stokes is a winner according to Vaughan. (Photo by Mark Kolbe/Getty Images) Source: Getty Images “Yes, Stokes doesn’t have that much captaincy experience. But sometimes that is not so important if you have a presence and feel for the game.” While there may be a legitimate argument in how Stokes will deal with the added scrutiny, Vaughan pointed out that even as captain he can still lean on Root for advice. “He will not be the vice-captain but he will be able to give Ben his honest feedback day in, day out. They are very close,” Vaughan wrote of Root. “What Ben will need around him is people who tell him: ‘Ben, you can’t do everything.’ My slight worry is that Ben will try to do everything - he will not get his own performances right if he goes in with that mentality. “It is just about getting the right people in the right positions - England have a lot of support staff, who they need to get right. And Joe Root could be his biggest ally.” Key is expected to formally announce Stoke’s appointment when he holds his first press conference on Thursday (local time).","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"KER-W vs NAG-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for India Women’s Senior T20, Match 20","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ker-w-vs-nag-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-india-women-s-senior-t20-match-20?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-27 19:12:44","image_url":"https://static.sportskeeda.com/editor/2022/04/3b654-16510803464814-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Exclusive: T20 World Cup 2022 Strongest Predicted Squad for Team India - AK4TSay1 Cricalytics","link":"https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vd3d3LmFrNHRzYXkxLmNvbS9leGNsdXNpdmUtdDIwLXdvcmxkLWN1cC0yMDIyLXN0cm9uZ2VzdC1wcmVkaWN0ZWQtc3F1YWQtZm9yLXRlYW0taW5kaWEv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Exclusive: T20 World Cup 2022 Strongest Predicted Squad for Team India  AK4TSay1 CricalyticsIPL 2022: Wasim Jaffer, Nikhil Chopra predict best bowling teams in second half of the tournament  CricTrackerHow Indians are shaping up in T20 World Cup year  Hindustan TimesThe 2022 T20 World Cup form guide: Who is impressing in the IPL?  International Cricket CouncilNikhil Chopra, Wasim Jaffer pick openers and No. 3 choices for Asia Cup, T20 WC 2022  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-04-27 19:02:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Memo to Ben Stokes: take the captaincy – but get out while the going is good | Andy Bull","link":"https://www.theguardian.com/sport/blog/2022/apr/27/ben-stokes-england-captain-cricket","keywords":["England cricket team","Joe Root","Ben Stokes","Cricket","Sport","Sport politics"],"creator":["Andy Bull"],"video_url":null,"description":"Whether effective or not, too many of England’s leaders have had to depart under a cloud, tarnishing their reputationThe career of an England Test captain, like a life in politics, always seems to end in failure. Maybe it’s at a tearful press conference after back-to-back thrashings by South Africa. Or by a hastily arranged England Cricket Board statement sent out after a row that also cost the head coach his job. Or off the back of an almighty spat with your star batsman that started when he was caught sending texts to the opposition slating your leadership. Or at the fag end of a slump of form in which the team lost five series in a row. In the end the job seems to break everyone who takes it on.Experience tells you that whoever takes over next – and it looks as if it will be Ben Stokes – will end up in a similar place. Sooner or later, the captaincy becomes a study in watching a good man get ground down. The question is what he and his team can achieve along the way. Continue reading...","content":null,"pubDate":"2022-04-27 19:00:38","full_description":"T he career of an England Test captain, like a life in politics, always seems to end in failure. Maybe it’s at a tearful press conference after back-to-back thrashings by South Africa. Or by a hastily arranged England Cricket Board statement sent out after a row that also cost the head coach his job . Or off the back of an almighty spat with your star batsman that started when he was caught sending texts to the opposition slating your leadership. Or at the fag end of a slump of form in which the team lost five series in a row . In the end the job seems to break everyone who takes it on. Experience tells you that whoever takes over next – and it looks as if it will be Ben Stokes – will end up in a similar place. Sooner or later, the captaincy becomes a study in watching a good man get ground down. The question is what he and his team can achieve along the way. The Spin | Too weak, too stern, too strict, too lax: a brief history of England coaches Read more It makes you wonder what it is about leading England in particular that seems to take so much out of a cricketer (and why, as Derek Underwood once asked, “so many players want to be captain anyway”). Doug Insole , who led Essex in the 1950s and did a stretch as Peter May’s deputy when England toured South Africa in 1956-57, said a captain needs to be “a public relations officer, agricultural consultant, psychiatrist, accountant, nursemaid, and diplomat”, as well as a player, selector and tactician. It tells you plenty about how stiff the job is that Joe Root ended up in the position he did even though he seemed to do so well in so many of those different roles. He had the batting. Unlike Mike Brearley, Root always demanded a place in the team, since he was the best batsman in the country; unlike Michael Vaughan, he was able to maintain the best part of his form while he was leading it, even if his batting average did drop a few points. And he had the man‑management. Unlike Andrew Strauss, Root always seemed to have the support of all of his players, who never had a bad word to say about him (in Afrikaans or any other language). But Brearley, Vaughan and Strauss will be remembered as three of the best captains England had. Unlike Root. Root never ended up on the front pages of the papers after being accused of having a tryst with a barmaid in his hotel room during a Test, never squared off with an umpire in the middle of a match because he didn’t agree with his decision, never got caught rubbing dirt on the ball, never called a foreign journalist a buffoon in a press conference, never turned up for practice so hungover that his coach made him sit out the session because he thought he was still drunk (if that last one seems like a low bar, it is still one that one of his predecessors failed to get over). Root didn’t look at his team and say: “My God, look what they’ve sent me,” which is what Archie MacLaren came out with when the selectors announced his side to play Australia at Old Trafford. And he never greeted one of his debutants with: “Gracious me! Don’t tell me you’re playing!” as Johnny Douglas is supposed to have done. He was never run out by one of his own teammates because they were so fed up with him, like Geoff Boycott, never provoked one of the most pitiless attacks ever put together by promising to make them “grovel”, like Tony Greig . Andrew Strauss led England to some memorable successes but struggled with his batting and some relationships in the dressing room. Photograph: Gareth Copley/PA What Root didn’t have was that touch of the mystic that may just be the most venerated quality of all. “Captaincy,” said Richie Benaud , “is the ability to think ahead of play, not be left responding to it.” Root didn’t have a feel for bowling changes or field placings. Although, since everyone in the game has got an opinion on how to do the job, you don’t have to look far to find good judges who will tell you that side of it is overrated anyway. “‘A dynamic bowling change’ you write about is probably sheer luck nine times out of 10,” said Graham Gooch when he was captain. “OK, you bring on someone and he gets a wicket – great, but I haven’t solved the mysteries of the universe have I?” The Spin: sign up and get our weekly cricket email. There are myriad ways to fail, so many that even when you’re winning, there will be plenty who think you’re going about it in the wrong way (as Strauss found out). It feels as if the England captain isn’t just leading the 10 other players on the field, but the entirety of English cricket. Perhaps the last man who really managed it was May, who Wisden described as “the beau ideal of English sportsmanship”. However, even he fell out with the press when he brought his fiancee on tour. May finished with the captaincy when he was 31. After he quit, Wisden waited nine years before publishing a tribute to him because everyone was hoping he would make a comeback. There’s a lesson there for Stokes when the time comes: it’s best to quit while you’re ahead if you can. They’ll remember you better for it.","image_url":"https://i.guim.co.uk/img/media/4215e5e617d75e9a1af9279c786d2f70ff38acae/62_101_1998_1199/master/1998.jpg?width=460&quality=85&auto=format&fit=max&s=a416a8aeff9470835ec0043d56e5478a","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"IPL 2022 GT vs SRH Highlights: Gujarat Titans beat Sunrisers Hyderabad by 5 wickets - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiU2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWd0LXZzLXNyaC1odWdobGlnaHRzLTc4OTAwMzYv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 GT vs SRH Highlights: Gujarat Titans beat Sunrisers Hyderabad by 5 wickets  The Indian ExpressHighlights | IPL 2022, GT vs SRH Scorecard: Rashid-Tewatia Survive Umran Scare To Lead GT To Victory  India.comLive Cricket Score - GT vs SRH, Match 40, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022, GT vs SRH Highlights: Gujarat Titans Edge Past SunRisers Hyderabad, Win By 5 Wickets  NDTV SportsRecent Match Report - Sunrisers vs Titans 40th Match 2022  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-04-27 18:22:41","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Points Table, Orange Cap and Purple Cap Latest Table Today: SRH reclaim top spot after beating SRH","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-points-table-orange-cap-and-purple-cap-latest-table-today-srh-reclaim-top-spot-after-beating-srh-10447751.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022 Points Table, Orange Cap and Purple Cap Latest Table Today: SRH reclaim top spot after beating SRH","content":"IPL 2022 has in store new teams, changed squad line-ups and a different format. But that will not necessarily impact the point system.This year the format is going to be a little different, wherein the 10 teams will be split into two groups - Group A and B.Group A - Mumbai Indians, Kolkata Knight Riders, Rajasthan Royals, Delhi Capitals, Lucknow Super GiantsGroup B - Chennai Super Kings, Sunrisers Hyderabad, Royal Challengers Bangalore, Punjab Kings, Gujarat TitansNow, within the groups, each team will play each other twice, as well as twice against the team in the same row from the other group. Then each team from every group will play against all the other teams in the other group once. That brings it to a total of 14 (8 + 5 + 1) matches for all teams.On Wednesday, GT reclaimed top spot in the points table with a five-wicket thrilling win over SRH.Here's the list of current Orange and Purple Cap holders:Orange Cap holder: Jos Buttler (RR) - 499 runsPurple Cap holder: Yuzvendra Chahal (RR) - 18 wicketsHere's the latest updated IPL 2022 league table: PositionTeamMatchesWonLostNRNet RRPoints1GT8710 +0.371142RR8620+0.561123SRH8520+0.600104LSG8530-0.334105RCB9540-0.572106PBKS8440-0.41987DC7340+0.71568KKR8350+0.08069CSK8260-0.538410MI8080-1.0000Click here to view the full Orange Cap standingsClick here to view the full Purple Cap standings Click here to read Factboxes of all teamsClick here to follow comprehensive coverage of IPL 2022Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-27 18:21:34","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/02/IPL-Trophy-640-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Highest last over chase in IPL: Highest run chase in last over in IPL history","link":"https://thesportsrush.com/cricket-news-highest-last-over-chase-in-ipl-highest-run-chase-in-last-over-in-ipl-history/","keywords":["Cricket","Gujarat Titans","IPL 2022","Sunrisers Hyderabad","GT","Indian Premier League","Rahul Tewatia","rashid khan","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest last over chase in IPL: The all-rounder and vice-captain of Gujarat Titans put together a match-winning partnership tonight. During the 40th match of the ongoing 15th season of the Indian Premier League between Gujarat Titans and Sunrisers Hyderabad at the Wankhede Stadium, Gujarat Titans beat Sunrisers Hyderabad by 5 wickets to reclaim their position… The post Highest last over chase in IPL: Highest run chase in last over in IPL history appeared first on The SportsRush.","content":"Highest last over chase in IPL: The all-rounder and vice-captain of Gujarat Titans put together a match-winning partnership tonight. During the 40th match of the ongoing 15th season of the Indian Premier League between Gujarat Titans and Sunrisers Hyderabad at the Wankhede Stadium, Gujarat Titans beat Sunrisers Hyderabad by 5 wickets to reclaim their position at the top of the points table. Chasing a 196-run target, GT needed 47 runs in the last three overs to register their seventh victory of the season. With their specialist batters getting out, Gujarat thrived on the back of a match-winning 59-run sixth-wicket partnership between all-rounder Rahul Tewatia (40*) and vice-captain Rashid Khan (31*). Needing as many as 22 runs in the last over being bowled by Marco Jansen, Tewatia and Khan hit one and three sixes to seal an emphatic chase tonight. While Tewatia batted with a strike rate of 190.47, Khan smashed four sixes at a strike rate of 281.81. Having conceded 45 runs in the first innings without picking a wicket, Khan made amends by a game-changing contribution with the bat in hand. Before these two dominated the proceedings, Hyderabad got off to a brilliant start on the back of wicket-keeper batter Wriddhiman Saha contributing with 68 (38) with the help of 11 fours and a six. Tewatia and Khan’s heroic 24-ball partnership meant that SRH pacer Umran Malik’s (4-0-25-5) maiden T20 five-wicket would result in a losing cause. Highest last over chase in IPL Runs Team Opposition Ground Year 23 Rising Pune Super Giant Punjab Kings Vizag 2016 22 Gujarat Titans Sunrisers Hyderabad Mumbai 2022 21 Deccan Chargers Kolkata Knight Riders Johannesburg 2009 21 Mumbai Indians Kolkata Knight Riders Kolkata 2011 21 Royal Challengers Bangalore Pune Warriors India Bengaluru 2012   What a game of cricket !! #UmranMalik top spell but one bowler can’t win you the game ! @rashidkhan_19 u beauty @rahultewatia02 great partnership . Aur yeh nehra ji ki smile off side #SRHvsGT #IPL2022 at its best — Yuvraj Singh (@YUVSTRONG12) April 27, 2022 No game is safe with @rahultewatia02 at the crease!! Incredible ending to a pulsating @IPL fixture. I even drowned out the vuvuzelas by the end. Amazing from @rashidkhan_19 entering beast mode too @gujarat_titans — Graeme Swann (@Swannyg66) April 27, 2022 Does Rashid Khan with the bat also remind you of Leander Paes at the net. Such fast hands …. — Harsha Bhogle (@bhogleharsha) April 27, 2022 Noooo he didn’t @rashidkhan_19 #IPL — Danielle Wyatt (@Danni_Wyatt) April 27, 2022 What a nerve-racking game! Rashid & Tewatia you both are unbelievable. Well done guys #RashidKhan #RahulTewatia #GTvSRH #IPL2022 — Vinay Kumar R (@Vinay_Kumar_R) April 27, 2022 For more cricket-related news, click here. The post Highest last over chase in IPL: Highest run chase in last over in IPL history appeared first on The SportsRush.","pubDate":"2022-04-27 18:10:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, GT vs SRH Highlights: Gujarat Titans Edge Past SunRisers Hyderabad, Win By 5 Wickets - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWd0LXZzLXNyaC1saXZlLXNjb3JlLXVwZGF0ZXMtZ3VqYXJhdC10aXRhbnMtdnMtc3VucmlzZXJzLWh5ZGVyYWJhZC1saXZlLXNjb3JlLTI5MjU1MDbSAYUBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvaXBsLTIwMjItZ3QtdnMtc3JoLWxpdmUtc2NvcmUtdXBkYXRlcy1ndWphcmF0LXRpdGFucy12cy1zdW5yaXNlcnMtaHlkZXJhYmFkLWxpdmUtc2NvcmUtMjkyNTUwNi9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, GT vs SRH Highlights: Gujarat Titans Edge Past SunRisers Hyderabad, Win By 5 Wickets  NDTV SportsGT Won By 5 Wickets | Highlights | GT 199/5 (20) vs SRH 195/6 (20) Scorecard | IPL 2022 | Gujarat Titans vs SunRisers Hyderabad | Hotstar  India.comLive Cricket Score - GT vs SRH, Match 40, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022: How Shami celebrated a wicket sitting in the dugout  The Indian ExpressIPL 2022: Shubman Gill Had 2 Good Knocks But His Performance Dipped, He Is Due For Runs - Aakash Chopra  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-27 17:55:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Live Score| IPL 2022 Gujarat Titans Vs Sunrisers Hyderabad Live Update: Umran removes the set Saha to dent GT","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-live-update-gujarat-titans-vs-sunrisers-hyderabad-live-score-online-check-live-streaming-today-match-10601301.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Live Score| IPL 2022 Gujarat Titans Vs Sunrisers Hyderabad Live Update: Umran removes the set Saha to dent GT","content":"22:49 (IST)FOUR! Cracked away! Width offered by Bhuvneshwar, Tewatia slashes it through backward point.22:47 (IST)DROPPED! A very tough one for Bhuvneshwar. Miller smacks it straight back with power, Bhuvneshwar doesn't manage to hold on to it.22:46 (IST)After 14 overs,Gujarat Titans 127/3 ( David Miller 13 , Rahul Tewatia 5)IPL 2022, GT vs SRH Live ScoreSaha and Miller take 12 runs off the Washington over. But GT are jolted as Umran is brought back and he castles Saha off the first ball. Tewatia gets off the mark with a FOUR to third man but overall it's a brilliant over for SRH as he gives away just 6 runs. 18 runs and a wicket off the last two overs. 69 needed off 36.22:44 (IST)FOUR! Nicely done. Back of a length delivery outside off, Tewatia just guides it fine to third man for a one bounce FOUR.22:42 (IST)OUT! Umran castles Saha. A 153 kmph yorker. What a delivery! Saha backs away but Umran bowls a pin point yorker on middle. Saha looks to dig it at the last moment but it's already past his bat and onto the stumps.22:36 (IST)FOUR! Good use of the feet and gap finding. Saha charges and hoicks it over square leg, off Washington.22:35 (IST)After 12 overs,Gujarat Titans 109/2 ( Wriddhiman Saha (W) 62 , David Miller 8)IPL 2022, GT vs SRH Live ScoreA mixed couple of overs for Gujarat Titans. They take just five singles off the Washington Sundar over. But Saha ups the ante in the Jansen over as after five runs off the first four balls, he smacks a coupls of FOURS through mid on to make it 13 off the over. 18 off the last two overs. 87 needed off 48. 22:34 (IST)FOUR! 2 in 2! Just wide of the fielder. Full on middle and leg, Saha lofts it just wide of mid on. It flies past the diving fielder. 22:33 (IST)FOUR! Smacked! Full outside off from Jansen, Saha thumps it over mid on.22:27 (IST)FIFTY for Saha. He brings it up off just 28 balls. It's a really good innings so far. ​22:26 (IST)After 10 overs,Gujarat Titans 91/2 ( Wriddhiman Saha (W) 49 , David Miller 4)IPL 2022, GT vs SRH Live ScoreA decent couple of overs for SRH. Saha does hit a FOUR off Washington but overall, they take just 8 runs off it. Umran then breathes fire again as he gets the wicket of Pandya after the GT captain hits him for a FOUR first ball. Miller gets off the mark with a FOUR, but overall it's a successful over for SRH as they got the wicket of Pandya. 10 off the Umran over. 18 runs and a wicket off the last two.22:22 (IST)FOUR! Good placement! Short of good length delivery outside off, Miller guides it wide of the backward point fielder.22:21 (IST)OUT! Umran gets his 2nd. A HUGE WICKET of Hardik Pandya. It's not that short, outside off, Pandya goes for a pull but gets a top edge to third man where Jansen settles under it and takes a good catch.22:20 (IST)FOUR! Short of the fielder and into the fence. Hardik whips it uppishly, it falls short of the mid on fielder who charges in to catch it and misses it. It runs away to the fence.22:18 (IST)FOUR! Terrific placement, Saha backs away and crunches it thorugh extra cover, off Washington.22:16 (IST)After 8 overs,Gujarat Titans 73/1 ( Wriddhiman Saha (W) 42 , Hardik Pandya (C) 4)IPL 2022, GT vs SRH Live ScoreWhat a fiery start from Umran. He knocks down Gill's off stump and then hits Pandya's shoulder with a bouncer. Pandya then gives a strong reply as he punches one through the vacant mid off region for a FOUR. 5 runs off the over.22:14 (IST)FOUR! Brilliant timing! Pandya stands tall and punches a good length delivery from Umran through mid off.22:14 (IST)Ouch! What a snorter from Umran, a short one on off, Hardik at first looks to pull but then looks to fend, misses and the ball hits his shoulder. He is in some pain. The physio runs out but Pandya sends him back. 22:13 (IST)OUT! Umran Malik strikes. Knocks down Shubman Gill's off stump. Good length delivery on off, Gill backs away and looks to slash it away. But it's too quick for him, the ball knocks down the off stump even before Gill could get his bat down. 22:06 (IST)After 7 overs,Gujarat Titans 68/0 ( Wriddhiman Saha (W) 41 , Shubman Gill 22)IPL 2022, GT vs SRH Live ScoreGood calculative cricket. After one run off the first two balls off the Washington over, Gill smacks a SIX. A couple of singles more off the next three balls make it 9 off the over.22:03 (IST)SIX! What a hit! Gill comes forward and launches it over deep mid-wicket, off Washington Sundar.22:01 (IST)After 6 overs,Gujarat Titans 59/0 ( Wriddhiman Saha (W) 39 , Shubman Gill 15)IPL 2022, GT vs SRH Live ScoreA very good powerplay for GT, Saha takes the aggressor's role to hit 39* off 18 balls. GT 59/0 from 6 overs. This is good controlled aggression from GT. Saha lofts one over mid off for a FOUR off Jansen. They take 3 more singles to make it 7 off the Jansen over. Saha then takes on Natarajan and cracks a couple of FOURS. A couple of singles and a two make it 12 off the over. 19 off the last two overs. 21:58 (IST)FOURS! 2 in 2 Poor ball, down the leg side from Natarajan, Saha pulls it wide of short fine leg. The next one is a short one on the leg stump, Saha pulls it over backward square leg for consecutive FOURS.21:54 (IST)FOUR! Smacked! It's the slower cutter outside off, full, Saha lofts it over mid off, off Jansen.21:52 (IST)After 4 overs,Gujarat Titans 40/0 ( Wriddhiman Saha (W) 25 , Shubman Gill 10)IPL 2022, GT vs SRH Live ScoreThis is good stuff from Saha and Gill. Saha taking the aggressive route. He hits Bhuvneshwar for a couple of FOURS. One is due to a mis field and the other well placed wide of short fine leg. Three more singles make it 11 off the over. Gill then flicks one non chalantly off Natarajan for a FOUR before Saha lofts the last ball of the over over extra cover for the second FOUR of the over. 9 off the Natarajan over. 20 off the last two overs. 21:51 (IST)FOUR! Saha playing well here. Lofts a full delivery outside off, over extra cover, off Natarajan.21:48 (IST)FOUR! Brilliant timing! Full outside off from Natarajan, Gill flicks it non chalantly wide of mid on. 21:48 (IST)FOUR! Nice placement! On the pads from Bhuvneshwar, Saha clips it wide of short fine leg, it runs away.21:45 (IST)FOUR! Misfield from Natarajan! Saha charges and swings it to deep square leg where Natarajan makes a mess of it and lets it through.21:43 (IST)After 2 overs,Gujarat Titans 20/0 ( Wriddhiman Saha (W) 12 , Shubman Gill 3)IPL 2022, GT vs SRH Live ScoreA mixed couple of overs to start off for GT. Bhuvneshwar Kumar bowls a very good first over and gives away just two runs. Saha then takes on the attack to Jansen and hits him for a FOUR and a SIX. After a single, Jansen beats Gill's outside edge with a beauty. But then errs in line and concedes FIVE WIDES. A single off the last ball makes it 18 off the over. 20 off the last two.21:42 (IST)FIVE WIDES! Another poor ball, Down the leg side from Jansen, it flies past the batter and the keeper to fine leg.21:40 (IST)SIX! Poor delivery from Jansen, full and on the pads, Saha flicks it over long leg.21:39 (IST)FOUR! Swung away! Full outside off, from Jansen Saha hoicks it over square leg, not quite off the middle but still effective.21:36 (IST)Back for the chase. Wriddhiman Saha and Shubman Gill are the openers. Bhuvneshwar Kumar will start off proceedings.21:20 (IST)After 20 overs,Sunrisers Hyderabad 195/6 ( Shashank Singh 25 , Marco Jansen 8)6 0 1 6 6 6 Shashank Singh finishes the innings in some style as he takes on Ferguson. #SRH post a healthy 195/6.21:19 (IST)SIX! SRH Post 195/6! What a finish from Shashank Singh! It's full outside off, Shashank lofts it over long off..21:18 (IST)SIX! This is brilliant from Shashank! Shuffles and scoops a full toss over fine leg.21:17 (IST)SIX! Smashed! Short from Ferguson, Shashank pulls it over mid-wicket, powerful hit. It was the slower ball.21:16 (IST)Single! Jansen looks to go big but ends up getting a bottom edge onto the ground and towards the keeper. They run through for a quick single.21:16 (IST)DOT BALL! Full and a touch wide outside off, Jansen can't reach it and leaves it alone.21:15 (IST)SIX! Hammered! Slower from Ferguson, Jansen launches into it and clobbers it over long on.21:14 (IST)After 19 overs,Sunrisers Hyderabad 170/6 ( Shashank Singh 7 , Marco Jansen 1)A DOT and a single off the last two balls make it 9 runs off the penultimate over.21:12 (IST)Single! Shashank taps it towards point and takes a single.21:11 (IST)TWO! Shashank clips it to the leg side and scampers through for a quick couple.21:10 (IST)FOUR! Good start from Shashank Singh. Lofts a full delivery outside off, over extra cover. It races away.21:10 (IST)OUT! Run out! Brilliant work from Joseph off his own bowling and Washington Sundar walks back. Washington looks to pulls but misses, they run through as the ball hits his thigh pads and rolls to the leg side, Joseph charges on his follow through and scores a direct hit at the bowler's end. Washington is found short.21:07 (IST)After 18 overs,Sunrisers Hyderabad 161/5 ( Washington Sundar 3 , Shashank Singh 0)IPL 2022, GT vs SRH Live ScoreDayal bowls another very good over. He bowls it very full and gives away just singles and twos. The slower ball does the trick off the last ball as he sends back the set Markram. Just 6 runs and a wicket off the over.21:06 (IST)OUT! Dayal has Markram caught at long off. It's a slower full delivery outside off, a touch wide. Markram looks to loft but ends up hitting it off the bottom of the bat. Mistimes it to long off where Miller takes a very good catch.21:03 (IST)After 17 overs,Sunrisers Hyderabad 155/4 ( Aiden Markram 52 , Washington Sundar 1)IPL 2022, GT vs SRH Live ScoreA good couple of overs fro GT. Joseph gives away just five runs and gets the wicket of Abhishek Shrama. Shami then comes back and gets the wicket of Pooran. It was turning out to be a good over before Markram cracked a SIX off the penultimate ball. 10 runs off the Shami over along with a wicket. 15 runs and two wickets off the last two overs.21:01 (IST)SIX! FIFTY for Markram, he brings it up with a SIX. 50 off 35 balls. Slower short ball from Shami, Markram pulls it over mid-wicket.Gujarat Titans vs Sunrisers Hyderabad Live update, IPL 2022 Live Score, watch Cricket Live score Gujarat Titans and Sunrisers Hyderabad on online and watch on TV: Saha and Miller take 12 runs off the Washington over. But GT are jolted as Umran is brought back and he castles Saha off the first ball. Tewatia gets off the mark with a FOUR to third man but overall it's a brilliant over for SRH as he gives away just 6 runs. 18 runs and a wicket off the last two overs. 69 needed off 36.Preview: It will be Hardik Pandya vs Kane Williamson when Gujarat Titans (GT) will meet Sunrisers Hyderabad on Wednesday night at the Wankhede Stadium. It has been a brilliant debut season for the Gujarat Titans. There were few concerns over the squad, but Hardik Pandya has led the side brilliantly and his own form with the bat and ball has rendered a lot of balance to the squad.On the other hand, the Sunrisers Hyderabad have bounced back superbly after their defeats in the first two matches. They look like one of the most balanced sides in the tournament. And, their bowling attack has been superb in their 5-match winning spree.When will the Gujarat Titans and Sunrisers Hyderabad match be played?The GT vs SRH IPL 2022 match will take place on 27 April.Where will the Gujarat Titans and Sunrisers Hyderabad match be held?The GT vs SRH IPL 2022 match will be held at Wankhede Stadium in Mumbai.What time will the Gujarat Titans and Sunrisers Hyderabad match start?The GT vs SRH IPL 2022 match will begin from 7:30 pm onwards. The toss will be held at 7 pm on the same day.Where can you watch GT vs SRH IPL 2022 match on TV and online?The GT vs SRH IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The encounter will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the GT vs SRH IPL 2022 match.Complete Squads:Gujarat Titans: Hardik Pandya (c), Rashid Khan, Lockie Ferguson, Vijay Shankar, Shubman Gill, Noor Ahmed, Wriddhiman Saha, Mohammed Shami, Rahul Tewatia, Sai Kishore, Jayant Yadav, Dominic Drakes, Darshan Nalkande, Yash Dayal, Alzarri Joseph, Rahmanullah Gurbaz, Pradeep Sangwan, David Miller, Matthew Wade, Abhinav Manohar, Varun Aaron, B Sai SudharshanSunrisers Hyderabad: Kane Williamson (c), Karik Tyagi, Umran Malik, Marco Jansen, Washington Sundar, Nicholas Pooran, R Samarth, T Natarajan, Jagadeesha Suchith, Bhuvneshwar Kumar, Priyam Garg, Rahul Tripathi, Abhishek Sharma, Saurabh Dubey, Shreyas Gopal, Aiden Markram, Romario Shepherd, Sean Abbott, Shashank Singh, Abdul Samad, Vishnu Vinod, Glenn Philips, Fazalhaq FarooqiRead all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-27 17:17:01","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/GT-team-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Hardik Pandya's Wife Natasa Dejected After Umran Malik Dismisses The GT Captain - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vY3JpY2tldC9ndC12cy1zcmgtd2F0Y2gtaGFyZGlrLXBhbmR5YXMtd2lmZS1uYXRhc2EtZGVqZWN0ZWQtYWZ0ZXItdW1yYW4tbWFsaWstZGlzbWlzc2VzLXRoZS1ndC1jYXB0YWluL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Hardik Pandya's Wife Natasa Dejected After Umran Malik Dismisses The GT Captain  Cricket AddictorIPL 2022: After Umran Malik, 25-yr-old Indian talent aims to clock ‘150 kmph’  Hindustan TimesIPL 2022, GT vs SRH Highlights: Rashid Khan seals victory with a six off final delivery as Umran Malik's fifer  CNBCTV18WATCH: Umran Malik cleans up Wriddhiman Saha with 153 kmph yorker, bags maiden 5-wicket haul in IPL  WIONSteyn told Umran Malik, 'Don't worry about line-length, bowl as fast as you can'  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-04-27 17:15:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes to be rubber-stamped as England Test captain","link":"https://www.theguardian.com/sport/2022/apr/27/ben-stokes-to-be-rubber-stamped-as-england-test-captain","keywords":["England cricket team","Ben Stokes","ECB","Cricket","Sport","News Corporation","Jimmy Anderson","Stuart Broad"],"creator":["Ali Martin"],"video_url":null,"description":"Appointment to be revealed by Rob Key on ThursdayBroad and Anderson set to return to Test team this summerBen Stokes is expected to be named as England Test captain on Thursday when Rob Key holds his first media conference since becoming managing director of men’s cricket.Stokes was offered the role by Key on Tuesday during face-to-face talks in the north-east and though he always played down any captaincy ambitions during his time as Joe Root’s deputy, the 30-year-old all-rounder has accepted the challenge. Continue reading...","content":null,"pubDate":"2022-04-27 16:57:59","image_url":"https://i.guim.co.uk/img/media/c232f2c1a84b76085413b46b401b21314764b8ac/86_168_2914_1749/master/2914.jpg?width=460&quality=85&auto=format&fit=max&s=0724134d35ed309a0c2d93ba706da457","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"“Shashank kaun hai bhai”: Yuvraj Singh amazed by Shashank Singh as he smashes 25 runs off Lockie Ferguson’s Over during GT vs SRH IPL 2022 match","link":"https://thesportsrush.com/cricket-news-shashank-kaun-hai-bhai-yuvraj-singh-amazed-by-shashank-singh-as-he-smashes-25-runs-off-lockie-fergusons-over-during-gt-vs-srh-ipl-2022-match/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL","Shashank Singh","Yuvraj Singh"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Yuvraj Singh amazed by Shashank Singh as latter comes up with a scintillating cameo for the Sunrisers Hyderabad against Gujarat Titans. During the 40th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, Sunrisers Hyderabad’s all-rounder Shashank Singh delivered a wonderful cameo in the death, to power… The post “Shashank kaun hai bhai”: Yuvraj Singh amazed by Shashank Singh as he smashes 25 runs off Lockie Ferguson’s Over during GT vs SRH IPL 2022 match appeared first on The SportsRush.","content":"Yuvraj Singh amazed by Shashank Singh as latter comes up with a scintillating cameo for the Sunrisers Hyderabad against Gujarat Titans. During the 40th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, Sunrisers Hyderabad’s all-rounder Shashank Singh delivered a wonderful cameo in the death, to power his team’s total to 195/6 after 20 Overs against the Gujarat Titans. Having lost the Toss for the first time in IPL 2022, Kane Williamson, for the first time in the season was asked to bat first and was not disappointed at all after a 96-run partnership off 60 deliveries between Aiden Markram (56 off 40) and Abhishek Sharma (65 off 42) helped SRH post 170 on the board at the 19-Over mark. However, having already smashed 140 on the scoreboard after 15 Overs with 8 wickets in hand, SRH needed someone to finish strongly with both Markram and Sharma back in the pavilion. With six deliveries remaining, and the fastest bowler of the league so far Lockie Ferguson set to bowl those, a certain 30-year-old from Mumbai – Shashank Singh, tonked the Kiwi pacer for 25 runs in the Over, which included four Sixes (including a hat-trick of them) all around the park to hand his side the vital momentum boost as SRH defend a total for the first time in the ongoing season. Yuvraj Singh amazed by Shashank Singh Having already unearthed some breath-taking Indian talent so far, Shashank Singh was the latest entrant in the list, as he pounced on to the opportunity to bat for the first time in the present season. Quite amazed to watch the 30-year-old’s heroics with the bat, former India batter Yuvraj Singh took to his twitter handle to acknowledge and appreciate the same, while also admitting to have never heard of him before. The former Southpaw all-rounder also commended the wonderful stand between Abhishek and Markram, while also making sure to not miss the opportunity to pull GT’s head coach Ashish Nehra’s leg for the umpteenth time. Great partnership between @IamAbhiSharma4 and @AidzMarkram Abhishek growing to maturity and markram beautiful to watch !! Par yeh #shashank kaun hai bhai ? what hitting so who’s winning !! ? #SRHvsGT my guess Gt cause we all need nehra ji ki smile — Yuvraj Singh (@YUVSTRONG12) April 27, 2022 For more Cricket-related news, click here. The post “Shashank kaun hai bhai”: Yuvraj Singh amazed by Shashank Singh as he smashes 25 runs off Lockie Ferguson’s Over during GT vs SRH IPL 2022 match appeared first on The SportsRush.","pubDate":"2022-04-27 16:47:41","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Sunrisers Hyderabad Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-sunrisers-hyderabad-live-score-over-match-40-t20-6-10-updates-2926527","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Sunrisers Hyderabad from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-27 16:36:05","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637866939571079320.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"If Jurgen Klopp wanted someone to be in form to face Villarreal, it is Mo Salah: David James","link":"https://www.firstpost.com/sports/if-jurgen-klopp-wanted-someone-to-be-in-form-to-face-villarreal-it-is-mo-salah-david-james-10606441.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"If Jurgen Klopp wanted someone to be in form to face Villarreal, it is Mo Salah: David James","content":"Manchester City took a slender lead over Real Madrid in the first leg of the Champions League on Tuesday night. On Wednesday, Liverpool would be hopeful of taking a sizeable lead over another Spanish side in Villarreal in Europe's elite competition.Should Manchester City and Liverpool progress to the final in Paris on May 28, it would be a third all-English final in four years.It begs the question: why are the Premier League teams getting to this stage repeatedly now?\"The Premier League is strong, or stronger than the rest of the leagues. Real Madrid capitalised on Chelsea's mistakes to deny them the chance to be the third English team in the semi-finals. But when you look at Unai Emery, you look at Villarreal, you're not looking at a financial powerhouse in European football and therefore styles of football or organisation of football teams has been successful in that sense,\" said former England goalkeeper David James who is the expert on broadcaster Sony Network.\"I love the Champions League but finances is something that is dominating the chances of winning it. Not that having spent the most money will get you the successes as we've seen at PSG but it gives you a better chance of being there in the last round,\" added the former Manchester City and Liverpool goalkeeper.Liverpool have only lost once at Anfield in over a year - the defeat coming against Inter Milan in March. The Merseyside club would be boosted by the fact that they play the first leg at home and come into it after a stiff 2-0 win over against Everton.\"If you look at the way Villarreal setup, 4-4-2, they're confident and comfortable in that position defensively. So like against Everton, you're going to have to break down a very stubborn defence. Personnel is going to be key, so someone like (Luis) Diaz would find it difficult. I wouldn't be surprised to see (Diogo) Jota in there for the aerial threat rather than the threat on the floor.\"\"But I think for every Liverpool fan at the moment, the thing that they've got to be happiest about is Mohamed Salah is not only scoring but he's getting his assists back again as well. If Jurgen Klopp wanted someone to be in form at this moment, it would be Mo Salah.\"Away from the riches of Manchester City, Liverpool and Real Madrid sit Villarreal - a tiny club from Valencia. A city with population of just 51,000 and one trophy (Europa League) to show for their efforts. But this season, they've bundled out Juventus and Bayern Munich. Managed by Unai Emery, Villarreal have a strong defensive unit who would be hopeful of containing Liverpool at Anfield.\"I don't expect plenty of goals but I would say win for Liverpool is important. And a clean sheet would be fantastic to take into the second leg not because obviously way goals or anything like that, but simply because as we saw at Bayern Munich, it could be very tight in the second leg. I don't think any Liverpool fan wants it to go right to the wire even though it might be exciting!\"Watch UEFA Champions League 2021-22 (Semi Final Leg 1) - Liverpool vs. Villarreal LIVE on SONY TEN 2 (English), SONY TEN 3 (Hindi) & SONY TEN 4 (Tamil & Telugu) channels on 28th April 2022, at 12:30 am IST.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-27 16:21:56","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Liverpool-AP-6402.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 GT vs SRH Live Score Updates: Gujarat need 196 runs to win - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiW2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWd0LXZzLXNyaC1saXZlLXNjb3JlLXVwZGF0ZXMtNzg5MDAzNi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 GT vs SRH Live Score Updates: Gujarat need 196 runs to win  The Indian ExpressMatch Preview - Titans vs Sunrisers, Indian Premier League 2022, 40th Match  ESPNcricinfoGT vs SRH Match Prediction- Who Will Win Today's IPL Match Between Gujarat Titans and Sunrisers Hyderabad, IPL 2022, Match 40  Cricket AddictorGujarat Titans, Sunrisers Hyderabad battle to establish bowling supremacy, Indian Premier League 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022: How Shami celebrated a wicket sitting in the dugout  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-04-27 16:09:21","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Matchpoint Paradox Podcast: Legacy teams flounder, new franchises make hay in the sun - IPL 2022, Women's T20 Challenge updates","link":"https://sportstar.thehindu.com/podcast/matchpoint-paradox-cricket-podcast-this-week-ipl-2022-analysis-mumbai-indians-losing-csk-hardik-pandya-gujarat-titans-lsg-womens-t20-challenge/article38481232.ece","keywords":null,"creator":["Ayan Acharya"," Santadeep Dey"," Dhruva Prasad"],"video_url":null,"description":"On Matchpoint Paradox this week, Ayan Acharya, Santadeep Dey, and Dhruva Prasad discuss the ongoing edition of the Indian Premier League and other developments in Indian cricket this week.","content":null,"pubDate":"2022-04-27 16:04:17","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Match Preview - Capitals vs KKR, Indian Premier League 2022, 41st Match - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi0xMjk4NDIzL2RlbGhpLWNhcGl0YWxzLXZzLWtvbGthdGEta25pZ2h0LXJpZGVycy00MXN0LW1hdGNoLTEzMDQwODcvbWF0Y2gtcHJldmlld9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - Capitals vs KKR, Indian Premier League 2022, 41st Match  ESPNcricinfoDelhi Capitals vs Kolkata Knight Riders Match Prediction: Who Will Win The Match Between DC And KKR? IPL 2022, Match 41, DC vs KKR  Cricket AddictorShane Watson Interview | Delhi Capitals  Delhi CapitalsIPL 2022: Match 41, DC vs KKR Match Prediction – Who will win today’s IPL match between DC and KKR?  CricTrackerDC vs KKR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-27 16:04:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Pull out of the IPL”: Ravi Shastri advices Virat Kohli to take a break from IPL 2022 following poor run","link":"https://thesportsrush.com/cricket-news-pull-out-of-the-ipl-ravi-shastri-advices-virat-kohli-to-take-a-break-from-ipl-2022-following-poor-run/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL","Ravi Shastri","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ravi Shastri advices Virat Kohli to pull out of the ongoing 15th season of the IPL after a string of low scores in the marquee league. Almost nothing has been going the way of Virat Kohli as the former India and RCB skipper keeps struggling to find his form back after his disappointing run continues… The post “Pull out of the IPL”: Ravi Shastri advices Virat Kohli to take a break from IPL 2022 following poor run appeared first on The SportsRush.","content":"Ravi Shastri advices Virat Kohli to pull out of the ongoing 15th season of the IPL after a string of low scores in the marquee league. Almost nothing has been going the way of Virat Kohli as the former India and RCB skipper keeps struggling to find his form back after his disappointing run continues in the ongoing IPL 2022 as well. Just a glance at his previous three innings for RCB is enough testament to his batting woes. While he headed back to the pavilion after registering successive Golden Ducks against Lucknow Super Giants (LSG) and Sunrisers Hyderabad (SRH), his innings of 9 (10) the previous night against Rajasthan Royals (RR) was as rusty as ever – an adjective which one hardly associates with the 33-year-old. In fact, with the 15th IPL season running, Kohli has, only for the first time, been dismissed off the very first ball in two successive matches. A tough, tough time for Virat Kohli, but the fans still believe. pic.twitter.com/JkeHNHbK21 — Wisden India (@WisdenIndia) April 27, 2022 Ravi Shastri advices Virat Kohli to take a break from Cricket and IPL 2022 Former team India coach Ravi Shastri, who shares a good enough rapport with Kohli, has now advised the latter to pull out of the ongoing 15th edition of the IPL, and take a much needed break from the game, after a consistent run of poor form. In order to prolong his International career, Shastri exclaimed that the only time that India do not play Cricket is during the IPL, and there is no better time for the former India captain to take a break than now. “I think a break is ideal for him because he has played non-stop cricket and he has captained the side across all formats. It will be wise of him to take a break. You know, sometimes you have to draw the balance. This year he is already into the tournament (IPL 2022), tomorrow if push comes to shove and you want to prolong your international career and make a mark there for 6-7 years, pull out of the IPL, for all you care,” remarked Shastri during an interaction with renowned presenter Jatin Sapru’s via his YouTube channel. As far as IPL 2022 is concerned, Kohli has managed to garner mere 128 runs at an average of 16 and a strike rate of 119.62 across 9 innings, without a single half-century under his belt. The post “Pull out of the IPL”: Ravi Shastri advices Virat Kohli to take a break from IPL 2022 following poor run appeared first on The SportsRush.","pubDate":"2022-04-27 15:45:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Live Score| IPL 2022 Gujarat Titans Vs Sunrisers Hyd..e Update: GT remove Sharma, Pooran in quick succession - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMirgFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9pcGwtMjAyMi1saXZlLXVwZGF0ZS1ndWphcmF0LXRpdGFucy12cy1zdW5yaXNlcnMtaHlkZXJhYmFkLWxpdmUtc2NvcmUtb25saW5lLWNoZWNrLWxpdmUtc3RyZWFtaW5nLXRvZGF5LW1hdGNoLTEwNjAxMzAxLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Live Score| IPL 2022 Gujarat Titans Vs Sunrisers Hyd..e Update: GT remove Sharma, Pooran in quick succession  FirstpostMatch Preview - Titans vs Sunrisers, Indian Premier League 2022, 40th Match  ESPNcricinfoGT vs SRH Match Prediction- Who Will Win Today's IPL Match Between Gujarat Titans and Sunrisers Hyderabad, IPL 2022, Match 40  Cricket AddictorGujarat Titans, Sunrisers Hyderabad battle to establish bowling supremacy, Indian Premier League 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022: How Shami celebrated a wicket sitting in the dugout  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-04-27 15:34:03","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Big blow to Gujarat Titans as KEY member to step down after IPL 2022, says report","link":"https://zeenews.india.com/cricket/ipl-2022-big-blow-to-gujarat-titans-as-coach-gary-kirsten-to-step-down-after-ipl-2022-says-report-2458043.html","keywords":null,"creator":null,"video_url":null,"description":"Gary Kirsten's stay as head coach of Gujarat Titans may turn out to be a short one as the former South African opener is likely to join England men's cricket team as their head coach.","content":null,"pubDate":"2022-04-27 15:24:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Tendulkar gives epic reply after ICC calls Master Blaster an 'occasional bowler' - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMilgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9zYWNoaW4tdGVuZHVsa2FyLWdpdmVzLWVwaWMtcmVwbHktYWZ0ZXItaWNjLXJlZmVycy10by1pbmRpYS1sZWdlbmQtYXMtYW4tb2NjYXNpb25hbC1ib3dsZXItMTAxNjUxMDY3MzA2MTE3Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Tendulkar gives epic reply after ICC calls Master Blaster an 'occasional bowler'  Hindustan Times‘Iska matlab tu sirf 24th April ko hi chup baithega?’- Sachin Tendulkar on hilarious birthday tweet by Virender Sehwag  CricTracker‘Always special for me’ – Sachin Tendulkar in awe after crowd at the Wankhede chants ‘Sachin Sachin’  India TodayVirender Sehwag’s Gift of Silence to Sachin Tendulkar’s on His 49th Birthday, Master Responds  News18Sachin Tendulkar Gave A Hilarious Reply To The ICC  The Cricket LoungeView Full coverage on Google News","content":null,"pubDate":"2022-04-27 13:56:13","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rashid Khan wife: Is Rashid Khan married? Rashid Khan family details","link":"https://thesportsrush.com/cricket-news-rashid-khan-wife-is-rashid-khan-married-rashid-khan-family-details/","keywords":["Cricket","AFG","IPL","rashid khan"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Is Rashid Khan married: Afghan spinner Rashid Khan is playing for Gujarat Titans in the Indian Premier League 2022 season. Afghanistan’s leg-spinner Rashid Khan is one of the best spinners to ever play the game. He is regarded as the best T20 spinner around. Rashid Khan is currently representing Gujarat Titans in the Indian Premier… The post Rashid Khan wife: Is Rashid Khan married? Rashid Khan family details appeared first on The SportsRush.","content":"Is Rashid Khan married: Afghan spinner Rashid Khan is playing for Gujarat Titans in the Indian Premier League 2022 season. Afghanistan’s leg-spinner Rashid Khan is one of the best spinners to ever play the game. He is regarded as the best T20 spinner around. Rashid Khan is currently representing Gujarat Titans in the Indian Premier League 2022. Gujarat Titans signed Rashid Khan ahead of the IPL 2022 auction. Rashid Khan is one of the few players who has played in almost T20 league around the world. Rashid Khan has scalped 443 T20 wickets in 318 games at an economy of 6.35. Is Rashid Khan married? Rashid Khan is 23 years old, and he is not married yet. He once came into a lot of internet trolling when he said that he won’t marry until Afghanistan wins a World Cup trophy. However, ahead of the T20 World Cup in 2021, Rashid Khan clarified that he didn’t say anything like that, and his message was misinterpreted. “Actually, I was so shocked when I heard this because, to be honest, I never made a statement that I will marry once I win the World Cup,” Rashid Khan said. “I just said that in the next few years I have more cricket and three World Cups (the 2021 and 2022 Twenty20 World Cups and the 50-over World Cup in 2023) so my focus will be on cricket rather than on getting married.” Great team effort Happy to be contributing to the win tonight Thank you for your love and support, 100 wickets in the @IPL but the hard work doesn’t stop #KKRvGT #SeasonOfFirsts #AavaDe pic.twitter.com/YVdq4Pga5S — Rashid Khan (@rashidkhan_19) April 23, 2022 Rashid Khan’s mother’s and father’s names are not known. Rashid Khan lost his father in 2018, and he also shared a heartfelt message on social media. He was very close to her mother as well, but he never shared a picture with her. Rashid’s mother also passed away in June 2020. It is interesting to note that he has 10 siblings, six brothers and four sisters. He has shared some videos of playing cricket in the backyard. The post Rashid Khan wife: Is Rashid Khan married? Rashid Khan family details appeared first on The SportsRush.","pubDate":"2022-04-27 13:54:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Dausa gang-rape and murder: NCW chairperson to visit crime scene, meet victim's family","link":"https://www.firstpost.com/india/dausa-gang-rape-and-murder-ncw-chairperson-to-visit-crime-scene-meet-victims-family-10607051.html","keywords":["India"],"creator":["FP Staff"],"video_url":null,"description":"Dausa gang-rape and murder: NCW chairperson to visit crime scene, meet victim's family","content":"New Delhi: National Commission for Women chairperson Rekha Sharma will be in Rajasthan on Thursday to visit the crime scene in the Dausa gang-rape and murder case.She will meet the police officials and the victim's family. Later on, a press conference will be held at 5 pm.Earlier on Tuesday, NCW took suo-motu cognizance of the alleged gang-rape and murder of a woman at a village in the Dausa district of Rajasthan. Directing the Director-General of Police, Rajasthan to immediately file an FIR, the body has sought the arrest of all accused at the earliest, ANI reported.\"The National Commission for Women has come across several articles regarding the alleged gang-rape and murder of women at a village in Dausa district of Rajasthan. It has also been reported that the accused after murdering her, dumped the body of the victim in a well. The police have so far managed to arrest only one accused. The commission has taken serious note of the heinous crime,\" NCW said in an official statement.\"The chairperson of NCW Rekha Sharma has written to the Director-General of Police, Rajasthan to immediately file an FIR in the natter under relevant provisions of the law. NCW has also sought the arrest of all the accused at the earliest. A team led by NCW Chairperson Rekha Sharma will be visiting the crime scene on Thursday that is April 28, 2022. The NCW team will also meet the concerned police officials and the family of the victim,\" the notice further stated.The body of the woman was found in a well. \"A woman was allegedly gang-raped and murdered at a village in Dausa district. The woman's body was found in a well. She was walking towards her parents' house when the accused offered her a lift in their vehicle,\" said Dausa Additional Superintendant of Police Lal Chand Kayal.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-27 13:49:46","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Rekha-Sharma1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: After Umran Malik, 25-yr-old Indian talent aims to clock ‘150 kmph’ - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMigQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9hZnRlci11bXJhbi1tYWxpay1rdWxkZWVwLXNlbi1jb25maWRlbnQtdG8tY2xvY2stMTUwLWttcGgtaW4taXBsLTIwMjItMTAxNjUxMDY0MzMxOTEyLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: After Umran Malik, 25-yr-old Indian talent aims to clock ‘150 kmph’  Hindustan TimesWatch: Hardik Pandya's Wife Natasa Dejected After Umran Malik Dismisses The GT Captain  Cricket AddictorGT vs SRH: Umran Malik breathes fire to claim first five-wicket haul in IPL  India TodayWATCH: Umran Malik cleans up Wriddhiman Saha with 153 kmph yorker, bags maiden 5-wicket haul in IPL  WIONUmran Malik continues to impress with his bowling in IPL  Greater KashmirView Full coverage on Google News","content":null,"pubDate":"2022-04-27 13:40:06","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Explained: All you need to know about Diego Maradona death saga","link":"https://www.firstpost.com/sports/explained-all-you-need-to-know-about-diego-maradona-death-saga-10560901.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Explained: All you need to know about Diego Maradona death saga","content":"Legend Diego Maradona left for his heavenly abode on 25 November, 2020, after suffering a heart attack two weeks post a brain surgery.While the world mourned this unfathomable loss in terms of both a sports legend, many raised a hue and cry about the legitimacy of the way he died. Maradona's medical team thus came in the line of fire of public backlash. But how valid are these concerns and why do prosecutors want his medical team to go on trial after almost one-and-a-half years? Let's revisit the developments since his death to understand the situation better.Maradona's death (25 November, 2020)Maradona, having struggled with cocaine and alcohol addiction, suffered from poor health in his latter years. Two weeks before his death he underwent a brain surgery for a clot.Sources close to Maradona said he suffered from depression during eight months of coronavirus restrictions that confined him to home as he was considered a high-risk person.Maradona was suffering from liver, kidney and cardiovascular disorders when he died.A first autopsy conducted the day Maradona died, found he had suffered from liquid in the lungs with acute heart failure brought on by a disease of the heart muscles that makes it harder to pump blood.Many questioned how Maradona had been allowed to go home and recover after such a hefty surgery and thus the seeds of doubt were sown.Medical Board formed (8 March, 2021)Argentina's public prosecutor's office convened a medical board on 8 March to decide whether or not late football legend Diego Maradona was given proper treatment before his death.The legal proceedings were prompted by a complaint filed by two of Maradona's five daughters against Luque, whom they blamed for their father's deteriorating condition after the brain operation.Nine experts were called on 8 March including the medical examiners that took part in Maradona's autopsy.The public prosecutor in San Isidro, a suburb of the capital Buenos Aires, also called two more witnesses to appear before investigators: a nursing coordinator and the doctor tasked with coordinating Maradona's home care during the days before he died.Five other people, including neurosurgeon Leopoldo Luque and psychiatrist Agustina Cosachov, were already under investigation in the involuntary manslaughter probe.Two of Maradona's daughters — Gianinna, 31, and Jana, 24 accused Luque of responsibility in Maradona's deteriorating health.Fans demand closure (10 March, 2021)Hundreds of Argentine football fans demonstrated on Wednesday (10 March) in Buenos Aires to demand justice for superstar player Diego Maradona.The \"10M\" demonstration was organized on social media by different Maradona fan groups under the slogan \"Justice for Diego, he did not die, he was killed.\"Two of his daughters, Dalma and Gianinna, as well as the youngest of his five children – Diego Fernando, 8 – were at the protest, though they had to leave as the atmosphere turned tense.'Maradona received inadequate medical care': Medical Board (30 April, 2021)Argentine football icon Diego Maradona received inadequate medical care and was left to his fate for a \"prolonged, agonizing period\" before he died last year, an expert medical panel of 20 medical experts convened by Argentina's public prosecutor concluded on 30 April.In a 70-page document, the panel stated that Maradona, who succumbed to a heart attack on 25 November at the age of 60, \"started to die at least 12 hours before\" the moment he was found dead in his bed.The panel concluded that Maradona \"would have had a better chance of survival\" with adequate treatment in an appropriate medical facility.Maradona died in his bed in a rented house in an exclusive Buenos Aires neighborhood, where he was receiving home care.Maradona did not have \"full use of his mental faculties\" and should not have been left to decide where he would be treated, the experts said.They also found that his treatment was rife with \"deficiencies and irregularities\" and the medical team had left his survival \"to fate\".Sebastian Sanchi, a former spokesman for Maradona, told AFP, \"it is clear that the panel says that things were not done right.\"Maradona's doctors charged with premeditated murder (20 May, 2022)Seven people were placed under formal investigation for manslaughter. The accused, who include Maradona's neurosurgeon Leopoldo Luque, psychiatrist Agustina Cosachov and psychologist Carlos Diaz, thus faced a potential eight to 25 years in prison if convicted.All seven were prohibited from leaving the country.Luque, by then, had repeatedly defended his actions, saying \"I did my best. I offered Diego everything I could: some things he accepted, others not.\"The doctor sought a dismissal of the case and said Maradona had been depressed in his final days.\"I know that the (coronavirus) quarantine hit him very hard,\" Luque said.Hearing by Argentine prosecutors (14 June, 2021)A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors that he was following orders \"not to disturb\" the football icon while he slept.Ricardo Almiron, 37, was Maradona's nighttime carer and was one of the last people to see the World Cup winning captain alive.He was suspected of lying when he claimed Maradona was sleeping and breathing normally hours before he died. An autopsy revealed he was dying at that time.Almiron is one of seven people under investigation for manslaughter after a board of experts looking into Maradona's death found he had received inadequate care and was abandoned to his fate for a \"prolonged, agonizing period\".Almiron arrived just after midday with his lawyer Franco Chiarelli at the San Isidro public prosecutor's office on the outskirts of the capital Buenos Aires.Speaking to journalists after the interview, Chiarelli said Almiron \"always treated Maradona as a patient with a complex psychiatric\" condition but was never told about \"an issue related to heart disease.\"\"He was told by his superiors not to disturb the patient. My client had the wisdom to carry out his tasks without the patient feeling encroached upon, which was something he had to deal with the entire time he was there,\" Chiarelli added.Over the next two weeks, the accused had to appear one by one before prosecutors, accompanied by defense lawyers, to reply to the allegations against them.The hearings, postponed from April due to a spike in coronavirus cases in Argentina, ended with Luque, 39, on 28 June.Nurse's lawyer blames doctors for demise (17 June, 2021)\"They killed Diego,\" attorney Rodolfo Baque told reporters after his client, nurse Dahiana Gisela Madrid, was questioned by prosecutors.Baque insisted it was the doctors treating Maradona while he recovered from the brain operation, not his client, who were to blame for the soccer legend's death.He said Maradona was being treated for heart trouble but at the same time was on psychiatric medication that sped up his heart rate.Also, Maradona fell while in the hospital, and when Madrid asked to have a CAT scan done on him, an aide to Maradona refused, arguing that if the press found out it would look bad, Baque said.\"In the end, there were many warning signs that Maradona was going to die, give or take a day. And none of the doctors did anything to prevent it,\" Baque said during a break in the interrogation of Madrid, which went on for more than eight hours.Madrid was Maradona's daytime nurse and one of the last people to see him alive.Madrid was one of the people to have found Maradona with no signs of life and had tried to revive him, she said in a previous witness statement.Psychiatrist denies responsibility for death (26 June, 2021)The psychiatrist who was treating Diego Maradona denied any responsibility for his demise.Agustina Cosachov's lawyer Vadim Mischanchuk said the footballer \"died of a coronary issue that in no way related to the psychiatric issues she was attending to\".\"She was a psychiatric doctor, she had nothing to do with the clinical management of the patient,\" the lawyer said.According to the investigation record Cosachov and Luque were the key personnel in charge of Maradona's care. Cosachov and psychologist Carlos Diaz, 29, found Maradona dead.'I did my best' (28 June, 2021)Diego Maradona's personal physician denied through his lawyer Monday any responsibility for the football icon's death, in which he and six other health care workers are being investigated for manslaughter, and requested a new medical board be assigned to the case.Neurosurgeon Leopoldo Luque, 39, appeared before Buenos Aires prosecutors to answer to claims that he and other caregivers had neglected Maradona in his final days, precipitating his death.\"Luque has nothing to feel guilty for,\" the doctor's defense attorney Julio Rivas said at the end of Monday's hearing near Buenos Aires.\"What he said was simply that he was always concerned with Maradona's health, and every time he was called for any issue, he went and helped him. He was his family doctor, but not in charge of his home care.\"\"I see no responsibility either in Agustina or in Leo\" for Maradona's death, Rivas said of Luque and co-accused psychiatrist Agustina Cosachov, 36.According to Luque's lawyers, two private health care companies bear that responsibility.But other members of the team have said the duo was in charge of the retired footballer's care.Luque, 39, has repeatedly denied guilt and recently said, \"I'm proud of what I did\" to assist the patient, denying he had abandoned him.\"I did my best. I offered Diego everything I could: some things he accepted, others not,\" Luque said in an interview around that time.The doctor said Maradona had been depressed in his final days.\"I know that the (coronavirus) quarantine hit him very hard,\" Luque said.'Twist in the tale' (26 October, 2021)Diego Maradona's former lawyer said Monday the medical treatment given to his client was \"very bad\", after giving testimony in the investigation into the death of the Argentine football star.\"There were many mistakes made because Diego died, they inflated and inflated the poor guy until his heart exploded,\" Matias Morla told reporters after his more than three hours of testimony at the prosecutor's office in San Isidro.The medical treatment Maradona received was \"very bad, that's why he died,\" Morla said.Morla said that during his last visit with Maradona on November 16, \"he had a strange voice, robotic, very high-pitched and intermittent.\"I informed everyone of Diego's condition,\" Morla said. \"I then realized it was because of the amount of water retained in his body.\"The lawyer denounced as \"crazy\" the family's decision to have Maradona recover outside of a hospital.Maradona \"had no reason to go to a house when the doctors said he had to stay in a clinic,\" Morla said, adding he believed his client had been \"abandoned by his daughters.\"\"But one thing is moral responsibility and another is legal responsibility.\"Prosecutors call for trial (14 April, 2022)Prosecutors investigating the 2020 death of Argentine football legend Diego Maradona have asked that the medical staff who treated him be tried for negligent homicide.In their request on Wednesday, the prosecutors said \"omissions\" and mismanagement by eight medical professionals in charge of Maradona placed him in a \"situation of helplessness\" and abandoned him \"to his fate\" during his home hospitalisation, according to the court filing cited by the official Telam news agency.The prosecution accuses them of \"simple homicide with dolus eventualis,\" an offense in which a person is negligent while knowing their negligence can cause someone's death.They could face sentences ranging from eight to 25 years in prison.According to the prosecutors, the defendants \"were the protagonists of an unprecedented, totally deficient and reckless hospitalization at home\", and allegedly committed a \"series of improvisations, mismanagement and shortcomings\".The defense must now present its arguments and may ask for the case to be dismissed.With inputs from agenciesRead all the Latest News, Trending News, Cricket News, IPl Live Score UpdateLatest IPL Schedule 2022 , and , IPl 2022 Points tableEntertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-27 13:37:04","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/large_file_plugin/2021/01/1610610992_maradona640(1).jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Sunrisers Hyderabad: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-sunrisers-hyderabad-live-score-over-match-40-t20-1-5-updates-2925807","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Sunrisers Hyderabad from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-27 13:34:13","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 2.5 overs, Sunrisers Hyderabad are 26/1. The live updates of Gujarat Titans vs Sunrisers Hyderabad scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Gujarat Titans vs Sunrisers Hyderabad, Gujarat Titans vs Sunrisers Hyderabad live score, Gujarat Titans vs Sunrisers Hyderabad scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Who comes in next? 2.5 overs (0 Run) OUT! b Mohammad Shami. 2.4 overs (0 Run) Bounces over the stumps! Kane Williamson though was aware where the ball was heading though! Length and on off, this lands and jags back in. Kane Williamson looks to play it late and with soft hands. It hits the underedge and bounces over the stumps. 2.3 overs (0 Run) Good length and on off, Kane Williamson waits and guides it to point. 2.2 overs (4 Runs) FOUR! That is bread and butter stuff for Kane! On the pads, Williamson flicks it uppishly and over square leg for his first boundary. Hyderabad are off to an absolute flier here. 2.1 overs (0 Run) Solid! Good length and on middle, Williamson plays it back to the bowler. 1.6 overs (0 Run) A dot to end the over but another good one for Hyderabad! Length and on off, swinging away. Left alone. 1.5 overs (4 Runs) FOUR! Up and over! That is a shot played with a lot of authority! Quality! Stand and deliver! Length and on off, not a very bad delivery, just a little bit of width. Sharma lofts it over the cover fielder and bags a boundary. 1.5 overs (1 Run) WIDE! Down the leg side, Sharma looks to flick but misses to put bat on ball. Another extra as it is another wide. 1.4 overs (4 Runs) FOUR! Cracks it away! Shorter and outside off, Sharma stands tall and slaps it through point for a boundary. That is a quality shot. First boundary off the bat! 1.3 overs (1 Run) Almost! This one comes back in from outside off, late, it is on the fuller side. Williamson looks to jam it out, it goes off the inner half through square leg for one. 1.2 overs (0 Run) BEATEN! Quite an aggressive stroke there. There is width on offer, it is on a length and outside off. Williamson looks to go hard at it but is beaten. 1.1 overs (1 Run) Quick run! Length and on off, Sharma guides it to point and takes one. Yash Dayal to share the new ball with Mohammad Shami. 0.6 over (0 Run) Half an appeal but there was an inside edge! A good end to the over but an expensive one! Length and on off, this lands and jags back in. Williamson looks to defend but gets an inside edge onto the pads. 0.5 over (1 Run) First run off the bat! Sharma is off the mark! Length and on off, this is guided down to third man for one. 0.5 over (5 Runs) FIVE WIDES AGAIN! That is the second in the over. Shami is not able to control the balls coming back in. He is a little too straight on those inswingers, this one goes past the pads of the batter, past the dive of the keeper and into the fence in the fine leg region. 10 runs and none of the bat. 0.4 over (0 Run) Yet another beauty! This is on a length and around off, this one also lands and moves away. Sharma is beaten all ends up as he tries to block. 0.3 over (0 Run) Back of a length and on off, Sharma defends. 0.2 over (0 Run) Angled into the pads, Sharma flicks it but to mid-wicket. He timed it well but did not find the gap. 0.2 over (5 Runs) FIVE WIDES! Bonus runs! Hyderabad get underway! This one swings in, swings big, it starts from outside off and keeps coming in. Ends up down the leg side, keeps moving away from the keeper who dives and it goes to the fine leg fence. 0.1 over (0 Run) That is an absolute jaffa to begin with! What a delivery! Length, and on off, angled in from around the wicket. It lands and moves away. Sharma looks to defend but is beaten. We are ready for play! The two umpires stride out to the middle, followed by the players from Gujarat. Hyderabad openers Abhishek Sharma and Kane Williamson walk out to bat for the first time in this stadium this season. Mohammad Shami has the new ball in hand and is raring to go. Let's play... Nicholas Pooran is up for a quick chat. Pooran says that his current form is due to him knowing exactly what the team needs from him. About Aiden Markram, he says that they have played together for Punjab as well and reckons Markram is a hard worker and is happy that both he and Markram are able to do well. Pooran then talks about the hierarchy in the batting order and there is a set role for everyone in the team which helps. He adds that he wants to stay in the present and do whatever the team requires from him. Kane Williamson, the captain of Hyderabad, says they have enjoyed chasing but they knew there will come a time when they'll have to chase and they are looking forward to it. Informs about one change as Washington Sundar comes in for Jagadeesha Suchith. Adds Umran is keen to go and he is fit and ready. Gujarat skipper, Hardik Pandya says they are not sure why they will be bowling, they have done well batting first and bowling first. Mentions the wicket here does play a few tricks at the start and they are hoping to make use of it. Mentions with the lineup they have, it will be better to bat second. Informs they are playing the same team. Ends by saying if needed he will bowl. Hyderabad (Playing XI) - Abhishek Sharma, Kane Williamson (C), Rahul Tripathi, Aiden Markram, Nicholas Pooran (WK), Washington Sundar (In for Jagadeesha Suchith), Shashank Singh, Bhuvneshwar Kumar, Marco Jansen, T Natarajan and Umran Malik. Gujarat (Unchanged XI) - Wriddhiman Saha (WK), Shubman Gill, Hardik Pandya (C), David Miller, Rahul Tewatia, Rashid Khan, Abhinav Manohar, Lockie Ferguson, Alzarri Joseph, Yash Dayal and Mohammad Shami. TOSS - It's time for the toss and it is won by Gujarat. They will have a BOWL first. PITCH REPORT - Matthew Hayden is pitchside. Haydos says that the square boundaries are 62 meters and 67 meters with the straight boundary being over 70 meters. He adds that the wicket is quite dry but is very, very hard. Mentions that the totals in the last few matches here haven't been high which might be a sign to bat first. Gujarat have lost just the one game so far and that was against Hyderabad earlier on in the tournament. Since then, they are on a three-game winning run and will be looking to make it 4 today. Hyderabad on the other hand, have been unbeatable. After losing two to begin the tournament, they now have won 5 in a row and will look to make it 6. Two sides with excellent bowling attacks, this is promising to be a cracker. The Indian T20 League is moving along quickly as we head into game 40. It is a clash between two sides, Gujarat and Hyderabad, who have done exceedingly well so far. Just the two points separate these two and they sit in the 2nd and 3rd position respectively. The side which wins the game tonight has a chance to go on top. Who will come out on top? ... MATCH DAY ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637866830447979351.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Shane Warne Rajasthan Royals ceremony schedule: Shane Warne tribute galary details","link":"https://thesportsrush.com/cricket-news-shane-warne-rajasthan-royals-ceremony-schedule-shane-warne-tribute-galary-details/","keywords":["Cricket","IPL 2022","Rajasthan Royals","IPL","rajasthan royals","Shane Warne"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Shane Warne Rajasthan Royals ceremony schedule: The Rajasthan franchise will organize an event at the DY Patil Stadium. The cricketing world went into shock when Shane Warne passed away earlier this year. The legendary Australian leg-spinner Shane Warne passed away on 4 March 2022 from a suspected heart attack in Thailand. Shane Warne is arguably… The post Shane Warne Rajasthan Royals ceremony schedule: Shane Warne tribute galary details appeared first on The SportsRush.","content":"Shane Warne Rajasthan Royals ceremony schedule: The Rajasthan franchise will organize an event at the DY Patil Stadium. The cricketing world went into shock when Shane Warne passed away earlier this year. The legendary Australian leg-spinner Shane Warne passed away on 4 March 2022 from a suspected heart attack in Thailand. Shane Warne is arguably one of the greatest players to ever play the game. He was the first bowler in the world to claim 700 test wickets. He ended his career with 708 test wickets, whereas he has 293 ODI wickets under his belt. Shane Warne played for Rajasthan Royals for four years, but he was later appointed as the mentor and brand ambassador of the club. He was always in close association with the franchise over the years. Shane Warne Rajasthan Royals ceremony schedule Rajasthan Royals will pay tribute to Shane Warne in an event on 30 April 2022 at the DY Patil Stadium in Mumbai. The Royals will face Mumbai Indians in that game. DY Patil Stadium has been chosen because Shane Warne won the IPL 2008 trophy at the very same venue. Jason Warne, brother of Shane Warne will travel to Mumbai to be a part of the occasion. #ForWarnie, on April 30, and forever. You. Us. All together. #RRvMI | #RoyalsFamily pic.twitter.com/TCXkv5pskP — Rajasthan Royals (@rajasthanroyals) April 27, 2022 “It is befitting that the same stadium where Warne lifted the IPL trophy will see the cricketing world come together to pay their respects and celebrate his life. The franchise would like to iterate that it will not be an occasion to mourn, but to commemorate the great man, and salute him for his never-ending contribution to the game of cricket as well as impacting thousands of lives around the world through his words, energy, and actions both on and off the field,” the Royals stated in a communique. The players will wear the initials ‘SW23’ on the leading collar of their official match jerseys. Rajasthan Royals have also asked the players of 2008 to send their wishes to Shane Warne. A special area will be created at the DY Patil Stadium for the honours. The post Shane Warne Rajasthan Royals ceremony schedule: Shane Warne tribute galary details appeared first on The SportsRush.","pubDate":"2022-04-27 13:20:26","full_description":"Shane Warne Rajasthan Royals ceremony schedule: The Rajasthan franchise will organize an event at the DY Patil Stadium. The cricketing world went into shock when Shane Warne passed away earlier this year. The legendary Australian leg-spinner Shane Warne passed away on 4 March 2022 from a suspected heart attack in Thailand. Shane Warne is arguably one of the greatest players to ever play the game. He was the first bowler in the world to claim 700 test wickets. He ended his career with 708 test wickets, whereas he has 293 ODI wickets under his belt. Shane Warne played for Rajasthan Royals for four years, but he was later appointed as the mentor and brand ambassador of the club. He was always in close association with the franchise over the years. Rajasthan Royals will pay tribute to Shane Warne in an event on 30 April 2022 at the DY Patil Stadium in Mumbai. The Royals will face Mumbai Indians in that game. DY Patil Stadium has been chosen because Shane Warne won the IPL 2008 trophy at the very same venue. Jason Warne, brother of Shane Warne will travel to Mumbai to be a part of the occasion. #ForWarnie , on April 30, and forever. 💗 You. Us. All together. #RRvMI | #RoyalsFamily pic.twitter.com/TCXkv5pskP — Rajasthan Royals (@rajasthanroyals) April 27, 2022 “It is befitting that the same stadium where Warne lifted the IPL trophy will see the cricketing world come together to pay their respects and celebrate his life. The franchise would like to iterate that it will not be an occasion to mourn, but to commemorate the great man, and salute him for his never-ending contribution to the game of cricket as well as impacting thousands of lives around the world through his words, energy, and actions both on and off the field,” the Royals stated in a communique. The players will wear the initials ‘SW23’ on the leading collar of their official match jerseys. Rajasthan Royals have also asked the players of 2008 to send their wishes to Shane Warne. A special area will be created at the DY Patil Stadium for the honours.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"SRI vs CWA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Jamaica T10 2022, Match 17","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/sri-vs-cwa-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-jamaica-t10-2022-match-17?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-27 13:10:16","image_url":"https://static.sportskeeda.com/editor/2022/04/608bd-16510627481705-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"What Lies Ahead for Streaming After Netflix and CNN’s Bad Week?","link":"https://www.theringer.com/tv/2022/4/27/23043837/streaming-tv-services-wars-netflix-cnn-plus-disney","keywords":null,"creator":["Alison Herman"],"video_url":null,"description":null,"content":"Getty Images/Ringer illustration April has been one of the rockiest months of the Streaming Wars in recent memory, but new strategies are emerging as the tide of the battle turns In terms of output, streaming TV seems to be doing better than ever. Rarely does a week go by without some bingeable popcorn like The Ultimatum sweeping social media. And with spring comes the onset of Emmy Season, a condensed sprint to premiere high-profile shows so they’re fresh in the Television Academy’s mind when voters begin casting their ballots in June. This year, contenders include Russian Doll (Netflix), Shining Girls (Apple TV+), Undone (Amazon Prime Video), The Flight Attendant (HBO Max), The Offer (Paramount+), and Under the Banner of Heaven (technically FX, but exclusively on Hulu in the United States). Not every show in contention is backed by a streamer; subscribers can nonetheless choose from a plethora of options that streaming platforms hope will justify the monthly cost. Zoom out, though, and April has been one of the rockiest months of the Streaming Wars in recent memory. Until now, the story of Hollywood’s pivot to digital has largely been one of growth: growth in subscribers, growth in share prices, growth in the field of competitors. High-profile crashes like Quibi’s were the exception that proved the rule. Streaming services made series about hubristic tech companies that flew too close to the sun; they certainly weren’t the subjects. Yet observers have long predicted that the proliferation of services, from premium hubs like Apple TV+ to free, ad-supported products like Tubi, would eventually correct itself. That day isn’t quite upon us, but it appears to be closer than ever. Within just a few days, one service announced plans to shutter mere weeks after its launch, while the long-established market leader reported an alarming contraction in its user base, sending its stock price into a tailspin. Meanwhile, the industry continued in its usual contortions, with some smaller developments overshadowed by more dramatic reversals. It’s a lot to take in, so we’ll tackle it one issue at a time. Netflix Stalls Out If you’re clicking on a story about streaming, you’ve probably already heard the news about Netflix, or at least know it isn’t good, least of all for its shareholders (many of whom are also its employees). To recap: In its latest quarterly earnings report, the world’s biggest streaming service announced it had lost subscribers for the first time in a decade and forecasts losing millions more in the quarter to come. A slight dip of 200,000 or so users isn’t the end of the world, especially in light of mitigating circumstances like suspending 700,000 active accounts in Russia as a response to the war with Ukraine. But planning for a major exodus? That’s enough to sink not just Netflix’s stock, which is down by more than 40 percent as of this writing, but also competitors like Disney and Warner Bros. Discovery, though those declines aren’t nearly as dramatic. As for Netflix, it’s lost billions in market value, a plunge that is, to quote co-CEO Reed Hastings, “a bitch.” Interestingly, Wall Street panicked in spite of some more reassuring data points. Netflix revenue actually increased, thanks to a recent price hike; its churn rate, which represents the proportion of users who cancel the service, remains lower than its competitors; and the company continues to produce massive hits like Bridgerton, whose second season just set a platform record for viewing hours on an English-language TV series. But the streaming boom has partly been predicated on an expectation of continued expansion—and indications that the streaming-native content distributor may be close to its ceiling, especially in mature markets like the United States, are enough to make investors look askance at the assumption that subscription-funded streaming is the future of entertainment. Netflix has put forward a few strategies for stanching the flow, including a crackdown on password sharing and the potential rollout of a cheaper, ad-supported option (more on that shortly). But that’s not the same thing as a serious look inward at what’s gone wrong. For that, we can look to writers like Vulture’s Joe Adalian, whose Buffering newsletter floats a host of theories that include increased competition and a stubborn commitment to potentially outdated methods like a near-exclusive preference for the binge-style release. It’s hard to pin this particular vibe shift down to any single cause, though they add up to a potentially dramatic realignment. The Best Things in Life Are Free(-ish) Hastings’s proposal for an ad-supported Netflix tier signals an openness to abandoning one of the company’s foundational principles, a primary differentiator from its old-fashioned ancestors in linear broadcasting. For one thing, episodes of scripted Netflix series are typically written without formal act breaks to lead into commercials; it’s hard to picture an episode of Ozark abruptly cutting to a promotion for this year’s Toyotathon. A Netflix with ads is nonetheless in tune with recent trends. Last year, HBO Max launched a $10 monthly plan (a third cheaper than the regular price, which is around $15) that includes ads; outgoing WarnerMedia chief Jason Kilar has been talking the option up in exit interviews, telling Bloomberg that “close to 50 percent” of new subscribers are choosing the less expensive tier. For Hulu, which has long offered an ad-supported option, the substantial majority of subscribers allow advertisers to subsidize their viewing experience. But subscription-based services opting for advertising is only part of the story. Free, ad-supported TV—abbreviated FAST—is one of the great unsung battles of the Streaming Wars. Services like Tubi, owned by Fox, and Pluto TV, owned by Paramount Global, bring in enormous revenue at a much less substantial cost than Netflix’s multibillion-dollar budget for original programming. Earlier this month, Amazon announced it would rename its FAST offering IMDb TV, rechristening it as Amazon Freevee. The new moniker is admittedly silly, but it’s also much more straightforward than the previous one. The service is free to watch, and it’s owned by Amazon, two facts that were previously easy to miss. The jokes write themselves: The great streaming revolution has innovated itself back into the business model that supported broadcast TV for decades. Netflix is still a long way off from turning into 1990s-era NBC; still, subscriptions are no longer the sole currency of streaming, nor have they been for a while. It’s time to update our assumptions accordingly. CNN Bites the Plus Now that the ink is dry on the merger between WarnerMedia and Discovery into the entity known, quite creatively, as Warner Bros. Discovery, changes are afoot. That’s the only way to make sense of what is, at first glance, a pretty baffling about-face: shuttering the service CNN+ at the end of April, just a month after its launch. However dismal the early ratings, the CNN+ team wasn’t given much of a chance to correct them, instead becoming the Streaming Wars’ first major casualty since Quibi. Viewed through the lens of the corporate baton-passing, the decision is a little less shocking, if still extreme. CNN+ was initially overseen by a head executive, Kilar, and a network leader, Jeff Zucker, who are no longer in charge; Kilar was pushed out by a spinoff deal forged behind his back, and Zucker was forced to resign after failing to disclose a romantic relationship with another CNN executive. Discovery’s David Zaslav now leads the newly combined conglomerate, and Zucker’s replacement, Chris Licht—most recently executive producer of The Late Show With Stephen Colbert—starts next month. It checks out that Zaslav doesn’t want to burden his new hire with a dead-on-arrival project neither have much stake in. The demise of CNN+ plays into some of Zaslav’s rhetoric about being “careful” and “judicious” (read: not Netflix) when it comes to spending on streaming. It also forecasts a future in which companies may consolidate their streaming options into a single hub to better maximize its value to subscribers. HBO Max and Discovery+ are already combining into a single super-service; why would Warner Bros. Discovery want a smaller service hanging around as an independent shingle? Doesn’t CNN make more sense as another sub-brand on the HBO Max menu, like Cartoon Network or TCM? We’ve yet to get word on the fate of CNN+ original programming like chef Alison Roman’s yet-to-air cooking show. It nonetheless seems likely at least some of it will end up on Max. Customers weren’t willing to shell out for even more nonstop news, but maybe they’ll go for it as a side dish to other forms of entertainment. Sports Waltzes Onto Disney+ Let’s close out with a more lighthearted, though still meaningful, shift. Sports, and especially live sports, have long been streaming’s final frontier. With each passing day, that frontier gets increasingly settled. Peacock partially hosted its second Olympics; Apple recently signed on for the first 12 weeks of Friday Night Baseball. Tim Cook’s kingdom is also reportedly in contention for the NFL’s Sunday Ticket. Held up against these blockbuster deals, Disney’s decision to internally shuffle Dancing With the Stars from ABC to Disney+ barely registered as news. Frankly, Dancing With the Stars barely registers to most people as sports, but it’s a live competition of athleticism and grace—what else do you call it? Still, the move is a telling indication of how Disney plans to diversify its wholly owned, international streaming service. (Hulu is technically still split with Comcast for another few years, and is available only in the U.S.) Disney is no stranger to the intersection of streaming and sports, or the importance the latter can have to a fledgling product; its Indian edition, Disney+ Hotstar, features cricket from the Indian Premier League, which helped it gain a foothold on the subcontinent. Dancing With the Stars is more targeted, and speaks to how its parent company wants to expand the reach of Disney+ beyond the families and franchise fandoms who make up its core constituencies. If you’re tuning in for Marvel or Star Wars or Pixar, chances are you’ve already signed up for Disney+. But Dancing With the Stars caters to an older audience, who Disney hopes it can lure onto streaming and help round out Disney+’s demographics. Like the internal consolidation within Warner Bros. Discovery, the decision goes to show just how much entertainment companies are coming to value four-quadrant appeal. There’s only so far you can get when engaging with only young viewers. Much like Peter Jackson’s Get Back, Dancing With the Stars signals how serious Disney+ is about proving it isn’t just for kids. Let the games begin—or rather, continue.","pubDate":"2022-04-27 12:49:13","image_url":null,"source_id":"theringer","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Pakistan Cricket Board should be independent from the government: Former skipper Shahid Afridi","link":"https://www.indiatvnews.com/sports/cricket/pakistan-cricket-board-should-be-independent-from-the-government-former-skipper-shahid-afridi-2022-04-27-772609","keywords":null,"creator":null,"video_url":null,"description":"Former skipper Shahid Afridi has called for making the Pakistan Cricket Board (PCB) a totally independent body.","content":null,"pubDate":"2022-04-27 12:22:05","full_description":"Former skipper Shahid Afridi has called for making the Pakistan Cricket Board (PCB) a totally independent body. Afridi's comments came at a time when uncertainty surrounds the future of the present chairman Ramiz Raja with the change in government and prime minister. Speculations are rife that he would be replaced by a person who is the choice of the new PM Shahbaz Sharif. In Pakistan cricket, the PM is automatically appointed Patron in chiefs of the PCB and he/she nominates two candidates one of whom is elected by the general body as chairman. (Inputs from PTI)","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"}]}