{"newsArray":[{"article_id":"0d6284e5a74a769042012bfe30c4602e","title":"South Africa dominate Sri Lanka to kick start World Cup campaign","link":"https://www.nation.com.pk/08-Oct-2023/south-africa-dominate-sri-lanka-to-kick-start-world-cup-campaign","keywords":["Sports"],"creator":["Agencies"],"video_url":null,"description":"DELHI - South Africa started their ICC Men’s World Cup 2023 cam­paign with a massive 102-run victory against Sri Lanka at the Arun Jaitley Stadium, Delhi, In­dia on Saturday.","content":"DELHI - South Africa started their ICC Men’s World Cup 2023 cam­paign with a massive 102-run victory against Sri Lanka at the Arun Jaitley Stadium, Delhi, In­dia on Saturday. It was raining fours and sixes in Delhi on Saturday and the Sri Lankan bowlers became the victim of it as they were hit all over the ground by the Proteas’ destructive batting lineup who created multiple records in the process. Batting first, South Af­rica set a gargantuan 429-run target for Sri Lanka courtesy of Quinton de Kock, Rassie van der Dussen and Aiden Markram’s blistering knocks. All three bat­ters completed their centuries with Markram scoring the fastest ever in the history of the World Cup as the 29-year-old complet­ed his hundred in just 49 balls — breaking Ireland’s Kevin O’Brien record, who scored a memorable hundred against England on just 50 balls in the 2011 World Cup, which too was played in India. This was the highest-ever total in the history of the World Cup and also the first time three dif­ferent batters scored a century in a single innings. In reply to the South Africa’s colossal total, Sri Lanka were all out for 326 runs in 44.5 overs. The Islanders started badly as the opener Pathum Nissanka was clean-bowled by Marco Jan­sen’s in-swinging beauty in the first over. However, after Nis­sanka walked back to the pavil­ion, Kusal Mendis took charge of the Lankan batting lineup and, scored a quick 76 off 42 which in­cluded eight sixes and four fours. For once, it seemed like Men­dis would do the impossible tonight by chasing the mamoth­target, but he fell prey to Kagiso Rabada. Sri Lanka kept on los­ing wickets but after Mendis, Charith Asalanka played an ex­cellent innings, scoring 79 off 65 with 12 boundaries. Skipper Dasun Shanaka con­tributed 68 runs as well but nothing was enough in front of the tremendous target. Sri Lanka will now look forward to recov­ering from this loss as they play their second World Cup match against Pakistan in Hyderabad on October 10. Meanwhile, South Africa will take on Austra­lia in Lucknow on October 12. CLINICAL BANGLADESH EASE PAST AFGHANISTAN Bangladesh secured a convincing six-wicket victory over Afghani­stan on Saturday in the third match of the ICC Men’s Cricket World Cup in Dharamshala. The Tigers successfully chased down the target in 34.4 overs after limiting the Hashmatullah Sha­hidi-led side to a total of 156. Na­jmul Hossain Shanto remained unbeaten on 59 while Mehidy Hasan hit 57. The duo dominated the chase with 97-run stand for the third wicket. Despite Afghanistan mak­ing a decent start at 47-1 and 112-2 after being put into bat, they suffered a dramatic bat­ting collapse, losing their last eight wickets for just 44 runs. This led to their dismissal for a mere 156 runs, with more than 11 overs to spare. Left-arm spinner Shakib fin­ished with figures of 3-30 in eight overs while Mehidy Hasan Miraz took 3-25. From Afghani­stan, the major contribution came from opener Rahmanul­lah Gurbaz, who scored 47 runs.","pubDate":"2023-10-07 19:34:25","image_url":"https://www.nation.com.pk/print_images/large/2023-10-08/south-africa-dominate-sri-lanka-to-kick-start-world-cup-campaign-1696707261-5826.jpg","source_id":"nation_pk","source_priority":353644,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"20a0d337ae779846f2acd1f29fc56539","title":"Jyothi, Ojas complete golden hat-trick","link":"https://www.hindustantimes.com/sports/others/jyothi-ojas-complete-golden-hattrick-101696703224528.html","keywords":null,"creator":null,"video_url":null,"description":"India's compound archers won seven medals in Hangzhou, including all five gold medals on offer","content":"Jyothi Surekha Vennam and Ojas Deotale entered this Asian Games with contrasting goals. While Vennam, competing in her third Asian Games, was searching for her first success at this stage, Deotale, in his first Asian Games, was looking to add weight to his world champion tag. On a cold and wet Saturday morning at the Fuyang Yinhu Sports Centre, the two compound archers met their goals in style, ending the Hangzhou Asiad with three gold apiece as India won all five compound gold medals on offer. India's Jyothi Surekha Vennam competes against South Korea's So Chae-won in the archery compound women's individual gold medal match during the 2022 Asian Games in Hangzhou in China's eastern Zhejiang province(AFP) Veteran Abhishek Verma went down to Deotale in an all-India final to add a silver to India's tally while the 17-year-old world champion Aditi Swami bagged a bronze medal in the women's individual compound event. India thus ended their archery campaign with nine medals, seven of which came in the compound division. We're now on WhatsApp. Click to join. Vennam beat South Korea's Chaewon So 149-145 in the individual compound final to bag her third gold at Hangzhou. With wind conditions favourable after the last couple of tough days, Vennam shot with familiar calm and precision, missing the 10 only once in 15 shots to score 140 out of a possible 150. The Korean, barring a first perfect series, erred in every following sequence to finish with 145. Reflecting on her long wait for Asiad success, Vennam said, \"Waiting is always tough for everyone and it was the same for me. Now that the good times have come, I just want to live in this moment. We should not forget the past reflecting on it helps us attain greater highs.\" The 27-year-old multiple Worlds medallist was also part of the gold medal-winning women’s and mixed teams earlier this week. The secret of her success besides the obvious hard work, she said, lay in positive thinking. In fact, Vennam began the year thinking that this would be her stage to shine. \"I started to think more positively. I began the year thinking that this would be my year. I decided to focus more on the positives in life,\" she said. Meanwhile, Deotale capped his stunning maiden Asian Games by beating his mentor Abhishek Verma 149-147 in another display of sublime shooting. The reigning world champion had gone into the final calling it a \"fun match\", but never let his focus waver. Verma and Deotale shot a perfect first series of three shots each before the former hit a nine on the last shot of his next series. A nerveless Deotale took the opportunity to complete another perfect series and open a slender one-point lead. He built on that advantage with another perfect series even as Verma hit an eight as the gap rose to three points. Verma bowed out with two perfect series while Deotale nailed 10s on all but one chance, missing out on yet another perfect 150 but taking the gold. Earlier this week, Deotale had shot 150 twice in back-to-back matches to create a Games record. The 21-year-old had earlier partnered with Vennam for the compound mixed team gold and was also a part of the men’s team, alongside Abhishek Verma and Prathamesh Jawkar, who claimed gold. \"This was my first Asian Games and I have won gold medals in all three events. What more do I need? I feel like I am living in a dream,\" Deotale gushed after the win. On competing against Verma for gold, he said, \"I had told myself that this is going to be a friendly match between us. But there is still some pressure, no matter how many times we say it's a friendly match because there is a little pressure. It is a gold medal after all, but we knew that whatever happens, it will be for India.\" \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with Asian Games 2023 Live , India vs Afghanistan Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Shantanu Srivastava Shantanu Srivastava is an experienced sports journalist who has worked across print and digital media. He covers cricket and Olympic sports. ...view detail Topics Asian Games Subscribe to our best newsletters HT Daily Capsule Pick a topic of your interest and subscribe All Newsletters Subscribe Subscribed to newsletter successfully Thank you for subscribing to our Daily News Capsule newsletter.","pubDate":"2023-10-07 18:40:15","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/07/1600x900/ARCHERY-ASIAD-2022-2023-HANGZHOU-1_1696703908824_1696703946595.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f1e71763afb2897618ca036abe04aa33","title":"Kabaddi: India beat Iran in a controversial final","link":"https://www.hindustantimes.com/sports/others/kabaddi-india-beat-iran-in-a-controversial-final-101696703087892.html","keywords":null,"creator":null,"video_url":null,"description":"The match was suspended for almost 60 minutes due to a refereeing error before India won 33-29.","content":"A conventional kabaddi match lasts 45 minutes -- two halves of 20 minutes each interspersed by a five-minute break. On Saturday, the India-Iran men's kabaddi final lasted about 100 minutes, including a 60-minute break in a final of farcical proportions. Seven-time champions India had waited for five years to reclaim the men's kabaddi gold, and after being locked at 28-all with a minute to go, the desperation spilled onto the mat in Xiaoshan Guali Sports Centre on Saturday. India players argue with a referee on a disputed decision in the men's kabaddi gold medal match between India and Iran during the Hangzhou 2022 Asian Games in Hangzhou, in China's eastern Zhejiang province(AFP) Eventually, India won the match (33-29) and the gold they coveted, but it was a controversial affair. With Iran having emerged as a genuine threat to India's supremacy, the match was always going to be a tense affair and it lived up to the billing. The teams went toe-to-toe in regulation time and beyond, the chaotic flashpoint arriving with just 65 seconds remaining in the final. We're now on WhatsApp. Click to join. Drama began shortly after India captain Pawan Sehrawat stepped up for a raid. He tried to tag an opposing defender but was unable to do so and hence stepped out into the lobby with the Iranians in pursuit. The lobby, in kabaddi parlance, is a one-metre wide area between the outer edge of the mat to the inner line and is considered active only when contact has been made between the raider and a defender. Sehrawat was followed by at least three Iranians who entered the danger zone looking to tackle him down. One of the Iranians lost balance and stepped out of bounds at the back. That's where the confusion began. As per Rule No. 28 of the International Kabaddi Federation rulebook, \"If a defender or defenders who has/have touched the ground outside the boundary, hold a raider, the raider will be declared not out. The defender or defenders who have gone out of bounds only will be declared out.\" Simply put, unless a raider has touched a defender initiating a struggle, no defender can enter the lobby in pursuit. And if anyone does enter or touches the raider in the lobby, all defenders in the lobby with a touch on that raider will be declared out. However, as per new Pro Kabaddi League (PKL) rules that were introduced this season, if a raider steps out into the lobby without a touch, the raid immediately ends and the raider is declared out. No defender who follows the raider in the lobby can be declared out. The PKL rule effectively is the exact opposite of what the international rule states. In a bizarre turn of events, the referee followed the PKL rule and awarded a point each to both teams, something that India challenged. The Indian coaching staff and players sat on the mat disputing the decision and refused to play. The Indians asked for a video referral following which three points were awarded to India and one point to Iran. Now, the Iranians launched a protest. Skipper Fazel Atrachali came off the bench to lead his players out of the playing arena. The referees and judges again went for more replays and restored their decision of awarding a point each to both teams. Confusion continued as the Indians began another round of protests with coach Edicherry Bhaskaran asking his players to sit on the mat. The Indian team also threatened a walkout. With the situation getting completely out of control, the Asian Amateur Kabaddi Federation (AAKF) officials were summoned and they sought to award a point each to both teams. The Indians didn't take the offer and continued to protest. Next, the referees and judges awarded three points to India much to the Iranians' dismay. They reluctantly resumed the match which had, by then, been reduced to an absolute mess. The post-match press conference was called off but Iran coach Gholamreza Mazandarani made his feelings known in the mixed zone. “This is very bad for kabaddi. The officials made some terrible mistakes and decisions. All of (India’s) team, their coaches and managers were putting pressure on the referees to reverse the decision and they did exactly that,\" Mazandarani said. Bhaskaran returned the favour. “They were trying to influence the decision. As per the rulebook, the decision to award us three points was correct. But they want to manipulate that. It’s bad for the image of kabaddi,\" he said. Earlier, the women's team prevailed in a tough final against Chinese-Taipei 26-25 to claim its third gold in the Asian Games history. The Indians trailed their opponents by two points in the second half but came back strongly to secure the win. The win also marked the 100th medal for India at the Asian Games. \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with Asian Games 2023 Live , India vs Afghanistan Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Shantanu Srivastava Shantanu Srivastava is an experienced sports journalist who has worked across print and digital media. He covers cricket and Olympic sports. ...view detail Topics Asian Games Subscribe to our best newsletters HT Daily Capsule Pick a topic of your interest and subscribe All Newsletters Subscribe Subscribed to newsletter successfully Thank you for subscribing to our Daily News Capsule newsletter.","pubDate":"2023-10-07 18:38:20","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/07/1600x900/KABADDI-ASIAD-2022-2023-HANGZHOU-19_1696703153062_1696703187745.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"deb701674b53b7480ba1ada482532fef","title":"SA vs SL: ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ ਜਿੱਤ ਨਾਲ ਵਿਸ਼ਵ ਕੱਪ ਦੀ ਕੀਤੀ ਸ਼ੁਰੂਆਤ, ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ ਬੁਰੀ ਤਰ੍ਹਾਂ ਨਾਲ ਹਰਾਇਆ","link":"https://punjabi.abplive.com/sports/cricket/south-africa-starts-the-world-cup-with-a-win-defeats-sri-lanka-badly-750268","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"South Africa Vs Sri Lanka: ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕੀਤੀ। ਪਹਿਲੇ ਮੈਚ 'ਚ ਅਫਰੀਕਾ ਨੇ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ 102 ਦੌੜਾਂ ਨਾਲ ਹਰਾਇਆ ਸੀ। ਮੈਚ ਵਿੱਚ ਅਫਰੀਕਾ ਵੱਲੋਂ ਤਿੰਨ ਸੈਂਕੜੇ ਲੱਗੇ, ਜਿਸ ਵਿੱਚ ਏਡਨ ਮਾਰਕਰਮ ਨੇ ਇੱਕ ਰਿਕਾਰਡ ਬਣਾਇਆ ਅਤੇ 49 ਗੇਂਦਾਂ ਵਿੱਚ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਸਭ ਤੋਂ ਤੇਜ਼ ਸੈਂਕੜਾ ਬਣਾਇਆ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਕਵਿੰਟਨ ਡੀ ਕਾਕ ਅਤੇ ਰਾਸੀ ਵੈਨ ਡੇਰ ਡੁਸਨ ਨੇ ਵੀ ਸੈਂਕੜੇ ਵਾਲੀ ਪਾਰੀ ਖੇਡੀ। ਅਫਰੀਕਾ ਨੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਦੇ ਹੋਏ 50 ਓਵਰਾਂ ਵਿੱਚ ਕੁੱਲ 428/5 ਦੌੜਾਂ ਬਣਾਈਆਂ। ਜਿਸ ਦੇ ਜਵਾਬ 'ਚ ਸ਼੍ਰੀਲੰਕਾ 326 'ਤੇ ਆਲ ਆਊਟ ਹੋ ਗਈ। ਲੰਕਾ ਦੀ ਸ਼ੁਰੂਆਤ ਚੰਗੀ ਨਹੀਂ ਰਹੀ, ਮੈਂਡਿਸ ਨੇ ਉਮੀਦ ਜਗਾਈ ਵੱਡੇ ਟੀਚੇ ਦਾ ਪਿੱਛਾ ਕਰਨ ਉਤਰੀ ਸ਼੍ਰੀਲੰਕਾ ਨੇ ਦੂਜੇ ਓਵਰ ਵਿੱਚ ਹੀ ਪਹਿਲੀ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ। ਟੀਮ ਦੇ ਸਲਾਮੀ ਬੱਲੇਬਾਜ਼ ਪਥੁਮ ਨਿਸਾਂਕਾ ਬਿਨਾਂ ਖੇਡੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਲਈ ਟੀਮ ਦਾ ਸਕੋਰ ਵਧਿਆ ਅਤੇ 8ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੰਕਾ ਨੇ ਦੂਜਾ ਵਿਕਟ ਗਵਾ ਦਿੱਤਾ। ਇਸ ਵਾਰ ਕੁਸਲ ਪਰੇਰਾ 7 (15) ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਦੌਰਾਨ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਕੁਸਲ ਮੈਂਡਿਸ ਨੇ ਆਪਣੀ ਧਮਾਕੇਦਾਰ ਪਾਰੀ ਨਾਲ ਟੀਮ ਨੂੰ ਉਮੀਦ ਜਗਾਈ। ਪਰ ਮੈਂਡਿਸ ਵੀ 12ਵੇਂ ਓਵਰ ਦੀ ਚੌਥੀ ਗੇਂਦ 'ਤੇ ਆਊਟ ਹੋ ਗਿਆ। ਮੇਂਡਿਸ ਨੇ 42 ਗੇਂਦਾਂ 'ਤੇ 180.95 ਦੀ ਸਟ੍ਰਾਈਕ ਰੇਟ ਨਾਲ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ, ਜਿਸ 'ਚ ਉਸ ਨੇ 4 ਚੌਕੇ ਅਤੇ 8 ਛੱਕੇ ਲਗਾਏ। ਇਸ ਤਰ੍ਹਾਂ ਲੰਕਾ ਨੇ 109 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਤੀਜਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਬਾਅਦ ਯਾਨੀ 14ਵੇਂ ਓਵਰ 'ਚ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ ਚੌਥਾ ਝਟਕਾ ਲੱਗਾ। ਇਸ ਵਾਰ ਸਾਦਿਰਾ ਸਮਰਾਵਿਕਰਮਾ 23 ਦੌੜਾਂ ਬਣਾ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਈ। ਚਰਿਥ ਅਸਾਲੰਕਾ ਅਤੇ ਦਾਸੁਨ ਦੀ ਪਾਰੀ ਵਿਅਰਥ ਗਈ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਚਰਿਥ ਅਸਾਲੰਕਾ ਨੇ ਇਕ ਵਾਰ ਫਿਰ ਸ਼੍ਰੀਲੰਕਾਈ ਪ੍ਰਸ਼ੰਸਕਾਂ ਦੀਆਂ ਉਮੀਦਾਂ 'ਤੇ ਪਾਣੀ ਫੇਰ ਦਿੱਤਾ। ਉਸ ਨੇ 65 ਗੇਂਦਾਂ 'ਤੇ 8 ਚੌਕਿਆਂ ਅਤੇ 4 ਛੱਕਿਆਂ ਦੀ ਮਦਦ ਨਾਲ 79 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਹਾਲਾਂਕਿ ਇਸ ਦੌਰਾਨ ਸ਼੍ਰੀਲੰਕਾ ਨੇ 150 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਧਨੰਜੈ ਡੀ ਸਿਲਵਾ (11) ਦੇ ਰੂਪ 'ਚ 5ਵੀਂ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ ਸੀ। ਫਿਰ ਅਸਾਲੰਕਾ 32ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੁੰਗੀ ਨਗਿਡੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਗਈ। ਫਿਰ 33ਵੇਂ ਓਵਰ ਵਿੱਚ ਡੁਨਿਥ ਵੇਲਾਲਾਘੇ ਗੋਲਡ ਡਕ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ ਅਤੇ 40ਵੇਂ ਓਵਰ ਵਿੱਚ ਕਪਤਾਨ ਦਾਸੁਨ ਸ਼ਨਾਕਾ 68 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਤੋਂ ਬਾਅਦ 44ਵੇਂ ਓਵਰ ਵਿੱਚ ਕੁਸਨ ਰਜਿਥਾ ਨੇ ਆਪਣਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਰਜਿਥਾ 33 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਫਰੀਕੀ ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣੇ। ਫਿਰ ਅੰਤ ਵਿੱਚ ਕਾਗਿਸੋ ਰਬਾਡਾ ਨੇ ਮਤਿਸ਼ਾ ਪਥੀਰਾਨਾ ਨੂੰ ਬੋਲਡ ਕਰਕੇ ਮੈਚ ਦਾ ਅੰਤ ਕੀਤਾ। ਇਸ ਤਰ੍ਹਾਂ ਦੀ ਸੀ ਅਫਰੀਕਾ ਦੀ ਗੇਂਦਬਾਜ਼ੀ ਟੀਮ ਲਈ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਨੇ ਸਭ ਤੋਂ ਵੱਧ 3 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦਕਿ ਮਾਰਕੋ ਜੈਨਸ ਨੇ 10 ਓਵਰਾਂ 'ਚ 9.20 ਦੀ ਆਰਥਿਕਤਾ 'ਤੇ 92 ਦੌੜਾਂ ਦੇ ਕੇ 2 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਰਬਾਡਾ ਅਤੇ ਕੇਸ਼ਵ ਮਹਾਰਾਜ ਨੇ 2-2 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦੋਂ ਕਿ ਅੰਗੀਡੀ ਨੂੰ 1 ਸਫਲਤਾ ਮਿਲੀ।","content":"South Africa Vs Sri Lanka: ਦੱ ਖਣੀ ਅਫਰੀਕਾ ਨੇ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕੀਤੀ। ਪਹਿਲੇ ਮੈਚ 'ਚ ਅਫਰੀਕਾ ਨੇ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ 102 ਦੌੜਾਂ ਨਾਲ ਹਰਾਇਆ ਸੀ। ਮੈਚ ਵਿੱਚ ਅਫਰੀਕਾ ਵੱਲੋਂ ਤਿੰਨ ਸੈਂਕੜੇ ਲੱਗੇ, ਜਿਸ ਵਿੱਚ ਏਡਨ ਮਾਰਕਰਮ ਨੇ ਇੱਕ ਰਿਕਾਰਡ ਬਣਾਇਆ ਅਤੇ 49 ਗੇਂਦਾਂ ਵਿੱਚ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਸਭ ਤੋਂ ਤੇਜ਼ ਸੈਂਕੜਾ ਬਣਾਇਆ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਕਵਿੰਟਨ ਡੀ ਕਾਕ ਅਤੇ ਰਾਸੀ ਵੈਨ ਡੇਰ ਡੁਸਨ ਨੇ ਵੀ ਸੈਂਕੜੇ ਵਾਲੀ ਪਾਰੀ ਖੇਡੀ। ਅਫਰੀਕਾ ਨੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਦੇ ਹੋਏ 50 ਓਵਰਾਂ ਵਿੱਚ ਕੁੱਲ 428/5 ਦੌੜਾਂ ਬਣਾਈਆਂ। ਜਿਸ ਦੇ ਜਵਾਬ 'ਚ ਸ਼੍ਰੀਲੰਕਾ 326 'ਤੇ ਆਲ ਆਊਟ ਹੋ ਗਈ। ਲੰਕਾ ਦੀ ਸ਼ੁਰੂਆਤ ਚੰਗੀ ਨਹੀਂ ਰਹੀ, ਮੈਂਡਿਸ ਨੇ ਉਮੀਦ ਜਗਾਈ ਵੱਡੇ ਟੀਚੇ ਦਾ ਪਿੱਛਾ ਕਰਨ ਉਤਰੀ ਸ਼੍ਰੀਲੰਕਾ ਨੇ ਦੂਜੇ ਓਵਰ ਵਿੱਚ ਹੀ ਪਹਿਲੀ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ। ਟੀਮ ਦੇ ਸਲਾਮੀ ਬੱਲੇਬਾਜ਼ ਪਥੁਮ ਨਿਸਾਂਕਾ ਬਿਨਾਂ ਖੇਡੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਲਈ ਟੀਮ ਦਾ ਸਕੋਰ ਵਧਿਆ ਅਤੇ 8ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੰਕਾ ਨੇ ਦੂਜਾ ਵਿਕਟ ਗਵਾ ਦਿੱਤਾ। ਇਸ ਵਾਰ ਕੁਸਲ ਪਰੇਰਾ 7 (15) ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਦੌਰਾਨ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਕੁਸਲ ਮੈਂਡਿਸ ਨੇ ਆਪਣੀ ਧਮਾਕੇਦਾਰ ਪਾਰੀ ਨਾਲ ਟੀਮ ਨੂੰ ਉਮੀਦ ਜਗਾਈ। ਪਰ ਮੈਂਡਿਸ ਵੀ 12ਵੇਂ ਓਵਰ ਦੀ ਚੌਥੀ ਗੇਂਦ 'ਤੇ ਆਊਟ ਹੋ ਗਿਆ। ਮੇਂਡਿਸ ਨੇ 42 ਗੇਂਦਾਂ 'ਤੇ 180.95 ਦੀ ਸਟ੍ਰਾਈਕ ਰੇਟ ਨਾਲ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ, ਜਿਸ 'ਚ ਉਸ ਨੇ 4 ਚੌਕੇ ਅਤੇ 8 ਛੱਕੇ ਲਗਾਏ। ਇਸ ਤਰ੍ਹਾਂ ਲੰਕਾ ਨੇ 109 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਤੀਜਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਬਾਅਦ ਯਾਨੀ 14ਵੇਂ ਓਵਰ 'ਚ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ ਚੌਥਾ ਝਟਕਾ ਲੱਗਾ। ਇਸ ਵਾਰ ਸਾਦਿਰਾ ਸਮਰਾਵਿਕਰਮਾ 23 ਦੌੜਾਂ ਬਣਾ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਈ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਚਰਿਥ ਅਸਾਲੰਕਾ ਅਤੇ ਦਾਸੁਨ ਦੀ ਪਾਰੀ ਵਿਅਰਥ ਗਈ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਚਰਿਥ ਅਸਾਲੰਕਾ ਨੇ ਇਕ ਵਾਰ ਫਿਰ ਸ਼੍ਰੀਲੰਕਾਈ ਪ੍ਰਸ਼ੰਸਕਾਂ ਦੀਆਂ ਉਮੀਦਾਂ 'ਤੇ ਪਾਣੀ ਫੇਰ ਦਿੱਤਾ। ਉਸ ਨੇ 65 ਗੇਂਦਾਂ 'ਤੇ 8 ਚੌਕਿਆਂ ਅਤੇ 4 ਛੱਕਿਆਂ ਦੀ ਮਦਦ ਨਾਲ 79 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਹਾਲਾਂਕਿ ਇਸ ਦੌਰਾਨ ਸ਼੍ਰੀਲੰਕਾ ਨੇ 150 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਧਨੰਜੈ ਡੀ ਸਿਲਵਾ (11) ਦੇ ਰੂਪ 'ਚ 5ਵੀਂ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ ਸੀ। ਫਿਰ ਅਸਾਲੰਕਾ 32ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੁੰਗੀ ਨਗਿਡੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਗਈ। ਫਿਰ 33ਵੇਂ ਓਵਰ ਵਿੱਚ ਡੁਨਿਥ ਵੇਲਾਲਾਘੇ ਗੋਲਡ ਡਕ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ ਅਤੇ 40ਵੇਂ ਓਵਰ ਵਿੱਚ ਕਪਤਾਨ ਦਾਸੁਨ ਸ਼ਨਾਕਾ 68 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਤੋਂ ਬਾਅਦ 44ਵੇਂ ਓਵਰ ਵਿੱਚ ਕੁਸਨ ਰਜਿਥਾ ਨੇ ਆਪਣਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਰਜਿਥਾ 33 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਫਰੀਕੀ ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣੇ। ਫਿਰ ਅੰਤ ਵਿੱਚ ਕਾਗਿਸੋ ਰਬਾਡਾ ਨੇ ਮਤਿਸ਼ਾ ਪਥੀਰਾਨਾ ਨੂੰ ਬੋਲਡ ਕਰਕੇ ਮੈਚ ਦਾ ਅੰਤ ਕੀਤਾ। ਇਸ ਤਰ੍ਹਾਂ ਦੀ ਸੀ ਅਫਰੀਕਾ ਦੀ ਗੇਂਦਬਾਜ਼ੀ ਟੀਮ ਲਈ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਨੇ ਸਭ ਤੋਂ ਵੱਧ 3 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦਕਿ ਮਾਰਕੋ ਜੈਨਸ ਨੇ 10 ਓਵਰਾਂ 'ਚ 9.20 ਦੀ ਆਰਥਿਕਤਾ 'ਤੇ 92 ਦੌੜਾਂ ਦੇ ਕੇ 2 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਰਬਾਡਾ ਅਤੇ ਕੇਸ਼ਵ ਮਹਾਰਾਜ ਨੇ 2-2 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦੋਂ ਕਿ ਅੰਗੀਡੀ ਨੂੰ 1 ਸਫਲਤਾ ਮਿਲੀ।","pubDate":"2023-10-07 17:22:17","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/07/88c54e799c768139809c7a45c765ad381696699316733497_original.JPG","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"3d02948dd103099fc9763c963b320f2a","title":"IND vs AUS: ਆਸਟ੍ਰੇਲੀਆ ਖ਼ਿਲਾਫ਼ ਇਸ ਤਰ੍ਹਾਂ ਹੋ ਸਕਦੀ ਹੈ ਭਾਰਤ ਦੀ ਪਲੇਇੰਗ ਇਲੈਵਨ, ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਜਗ੍ਹਾ ਲੈ ਸਕਦੇ ਨੇ ਈਸ਼ਾਨ ਕਿਸ਼ਨ","link":"https://punjabi.abplive.com/sports/cricket/india-s-playing-eleven-could-be-like-this-against-australia-ishan-kishan-can-replace-shubman-gill-750267","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"India Playing 11 vs Australia World Cup 2023: ਭਾਰਤ ਅਤੇ ਆਸਟ੍ਰੇਲੀਆ ਵਿਚਾਲੇ 2023 ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਭਲਕੇ ਯਾਨੀ ਐਤਵਾਰ 8 ਅਕਤੂਬਰ ਨੂੰ ਮੁਕਾਬਲਾ ਹੋਵੇਗਾ। ਇਸ ਮੈਚ ਤੋਂ ਪਹਿਲਾਂ ਸਟਾਰ ਓਪਨਰ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਬੀਮਾਰੀ ਟੀਮ ਇੰਡੀਆ ਲਈ ਚਿੰਤਾ ਦਾ ਵਿਸ਼ਾ ਹੈ। ਕਈ ਮੀਡੀਆ ਰਿਪੋਰਟਾਂ ਵਿੱਚ ਦਾਅਵਾ ਕੀਤਾ ਗਿਆ ਹੈ ਕਿ ਗਿੱਲ ਵਿਸ਼ਵ ਕੱਪ ਦੇ ਸ਼ੁਰੂਆਤੀ ਮੈਚ ਨਹੀਂ ਖੇਡ ਸਕਣਗੇ। ਦਰਅਸਲ ਗਿੱਲ ਨੂੰ ਡੇਂਗੂ ਹੋ ਗਿਆ ਹੈ। ਭਾਰਤ ਅਤੇ ਆਸਟਰੇਲੀਆ ਵਿਚਾਲੇ ਮੈਚ ਚੇਨਈ ਦੇ ਐੱਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਇਹ ਮੈਚ ਦੁਪਹਿਰ 2 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਦਾ ਇਹ 2023 ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਪਹਿਲਾ ਮੈਚ ਹੈ। ਅਜਿਹੇ 'ਚ ਦੋਵੇਂ ਵਿਸ਼ਵ ਕੱਪ ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕਰਨਾ ਚਾਹੁਣਗੇ। ਇਹ ਖਿਡਾਰੀ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਕਰੇਗਾ ਓਪਨਿੰਗ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਗੈਰ-ਮੌਜੂਦਗੀ ਵਿੱਚ ਇਸ਼ਾਨ ਕਿਸ਼ਨ ਕਪਤਾਨ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਪਾਰੀ ਦੀ ਸ਼ੁਰੂਆਤ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਰਾਟ ਕੋਹਲੀ ਦਾ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਈਸ਼ਾਨ ਜਿਸ ਫਾਰਮ 'ਚ ਹਨ, ਉਸ ਨੂੰ ਦੇਖਦੇ ਹੋਏ ਕਿਹਾ ਜਾ ਸਕਦਾ ਹੈ ਕਿ ਟੀਮ ਇੰਡੀਆ ਗਿੱਲ ਦੀ ਕਮੀ ਨਹੀਂ ਛੱਡੇਗੀ। ਇਸ ਤਰ੍ਹਾਂ ਹੋਵੇਗਾ ਮਿਡਲ ਆਰਡਰ  ਸ਼੍ਰੇਅਸ ਅਈਅਰ ਚੌਥੇ ਨੰਬਰ 'ਤੇ ਖੇਡ ਸਕਦਾ ਹੈ। ਅਈਅਰ 2023 ਏਸ਼ੀਆ ਕੱਪ ਲਈ ਟੀਮ 'ਚ ਵਾਪਸੀ ਕਰ ਚੁੱਕੇ ਹਨ। ਉਹ ਚੰਗੀ ਫਾਰਮ 'ਚ ਨਜ਼ਰ ਆ ਰਿਹਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਕਟਕੀਪਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਦਾ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪੰਡਯਾ ਦਾ ਵੀ ਛੇਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਯਕੀਨੀ ਹੈ। ਤਿੰਨ ਸਪਿਨਰਾਂ ਦੇ ਨਾਲ ਉੱਤਰ ਸਕਦੀ ਹੈ ਟੀਮ ਇੰਡੀਆ  ਭਾਰਤ ਦਾ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਮੈਚ ਚੇਨਈ ਦੇ ਐਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਣਾ ਹੈ। ਇੱਥੋਂ ਦੀ ਪਿੱਚ ਸਪਿਨਰਾਂ ਲਈ ਢੁਕਵੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀਮ ਇੰਡੀਆ ਤਿੰਨ ਸਪਿਨਰਾਂ ਨਾਲ ਆਸਟ੍ਰੇਲੀਆ ਦੇ ਖਿਲਾਫ ਉਤਰ ਸਕਦੀ ਹੈ। ਇਸ ਦਾ ਮਤਲਬ ਹੈ ਕਿ ਕੁਲਦੀਪ ਯਾਦਵ, ਰਵਿੰਦਰ ਜਡੇਜਾ ਅਤੇ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਦੀ ਤਿਕੜੀ ਐਕਸ਼ਨ 'ਚ ਨਜ਼ਰ ਆ ਸਕਦੀ ਹੈ। ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ੀ ਦੀ ਜ਼ਿੰਮੇਵਾਰੀ ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ ਦੇ ਮੋਢਿਆਂ 'ਤੇ ਹੋਵੇਗੀ। ਆਸਟ੍ਰੇਲੀਆ ਵਿਰੁੱਧ ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ - ਰੋਹਿਤ ਸ਼ਰਮਾ (ਕਪਤਾਨ), ਈਸ਼ਾਨ ਕਿਸ਼ਨ, ਵਿਰਾਟ ਕੋਹਲੀ, ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਕੇਐਲ ਰਾਹੁਲ (ਵਿਕਟਕੀਪਰ), ਹਾਰਦਿਕ ਪੰਡਯਾ, ਰਵਿੰਦਰ ਜਡੇਜਾ, ਆਰ ਅਸ਼ਵਿਨ, ਕੁਲਦੀਪ ਯਾਦਵ, ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ।","content":"India Playing 11 vs Australia World Cup 2023: ਭਾਰਤ ਅਤੇ ਆਸਟ੍ਰੇਲੀਆ ਵਿਚਾਲੇ 2023 ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਭਲਕੇ ਯਾਨੀ ਐਤਵਾਰ 8 ਅਕਤੂਬਰ ਨੂੰ ਮੁਕਾਬਲਾ ਹੋਵੇਗਾ। ਇਸ ਮੈਚ ਤੋਂ ਪਹਿਲਾਂ ਸਟਾਰ ਓਪਨਰ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਬੀਮਾਰੀ ਟੀਮ ਇੰਡੀਆ ਲਈ ਚਿੰਤਾ ਦਾ ਵਿਸ਼ਾ ਹੈ। ਕਈ ਮੀਡੀਆ ਰਿਪੋਰਟਾਂ ਵਿੱਚ ਦਾਅਵਾ ਕੀਤਾ ਗਿਆ ਹੈ ਕਿ ਗਿੱਲ ਵਿਸ਼ਵ ਕੱਪ ਦੇ ਸ਼ੁਰੂਆਤੀ ਮੈਚ ਨਹੀਂ ਖੇਡ ਸਕਣਗੇ। ਦਰਅਸਲ ਗਿੱਲ ਨੂੰ ਡੇਂਗੂ ਹੋ ਗਿਆ ਹੈ। ਭਾਰਤ ਅਤੇ ਆਸਟਰੇਲੀਆ ਵਿਚਾਲੇ ਮੈਚ ਚੇਨਈ ਦੇ ਐੱਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਇਹ ਮੈਚ ਦੁਪਹਿਰ 2 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਦਾ ਇਹ 2023 ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਪਹਿਲਾ ਮੈਚ ਹੈ। ਅਜਿਹੇ 'ਚ ਦੋਵੇਂ ਵਿਸ਼ਵ ਕੱਪ ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕਰਨਾ ਚਾਹੁਣਗੇ। ਇਹ ਖਿਡਾਰੀ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਕਰੇਗਾ ਓਪਨਿੰਗ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਗੈਰ-ਮੌਜੂਦਗੀ ਵਿੱਚ ਇਸ਼ਾਨ ਕਿਸ਼ਨ ਕਪਤਾਨ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਪਾਰੀ ਦੀ ਸ਼ੁਰੂਆਤ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਰਾਟ ਕੋਹਲੀ ਦਾ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਈਸ਼ਾਨ ਜਿਸ ਫਾਰਮ 'ਚ ਹਨ, ਉਸ ਨੂੰ ਦੇਖਦੇ ਹੋਏ ਕਿਹਾ ਜਾ ਸਕਦਾ ਹੈ ਕਿ ਟੀਮ ਇੰਡੀਆ ਗਿੱਲ ਦੀ ਕਮੀ ਨਹੀਂ ਛੱਡੇਗੀ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਇਸ ਤਰ੍ਹਾਂ ਹੋਵੇਗਾ ਮਿਡਲ ਆਰਡਰ ਸ਼੍ਰੇਅਸ ਅਈਅਰ ਚੌਥੇ ਨੰਬਰ 'ਤੇ ਖੇਡ ਸਕਦਾ ਹੈ। ਅਈਅਰ 2023 ਏਸ਼ੀਆ ਕੱਪ ਲਈ ਟੀਮ 'ਚ ਵਾਪਸੀ ਕਰ ਚੁੱਕੇ ਹਨ। ਉਹ ਚੰਗੀ ਫਾਰਮ 'ਚ ਨਜ਼ਰ ਆ ਰਿਹਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਕਟਕੀਪਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਦਾ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪੰਡਯਾ ਦਾ ਵੀ ਛੇਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਯਕੀਨੀ ਹੈ। ਤਿੰਨ ਸਪਿਨਰਾਂ ਦੇ ਨਾਲ ਉੱਤਰ ਸਕਦੀ ਹੈ ਟੀਮ ਇੰਡੀਆ ਭਾਰਤ ਦਾ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਮੈਚ ਚੇਨਈ ਦੇ ਐਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਣਾ ਹੈ। ਇੱਥੋਂ ਦੀ ਪਿੱਚ ਸਪਿਨਰਾਂ ਲਈ ਢੁਕਵੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀਮ ਇੰਡੀਆ ਤਿੰਨ ਸਪਿਨਰਾਂ ਨਾਲ ਆਸਟ੍ਰੇਲੀਆ ਦੇ ਖਿਲਾਫ ਉਤਰ ਸਕਦੀ ਹੈ। ਇਸ ਦਾ ਮਤਲਬ ਹੈ ਕਿ ਕੁਲਦੀਪ ਯਾਦਵ, ਰਵਿੰਦਰ ਜਡੇਜਾ ਅਤੇ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਦੀ ਤਿਕੜੀ ਐਕਸ਼ਨ 'ਚ ਨਜ਼ਰ ਆ ਸਕਦੀ ਹੈ। ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ੀ ਦੀ ਜ਼ਿੰਮੇਵਾਰੀ ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ ਦੇ ਮੋਢਿਆਂ 'ਤੇ ਹੋਵੇਗੀ। ਆਸਟ੍ਰੇਲੀਆ ਵਿਰੁੱਧ ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ - ਰੋਹਿਤ ਸ਼ਰਮਾ (ਕਪਤਾਨ), ਈਸ਼ਾਨ ਕਿਸ਼ਨ, ਵਿਰਾਟ ਕੋਹਲੀ , ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਕੇਐਲ ਰਾਹੁਲ (ਵਿਕਟਕੀਪਰ), ਹਾਰਦਿਕ ਪੰਡਯਾ , ਰਵਿੰਦਰ ਜਡੇਜਾ, ਆਰ ਅਸ਼ਵਿਨ, ਕੁਲਦੀਪ ਯਾਦਵ, ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ।","pubDate":"2023-10-07 17:17:32","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/07/ac395fe7509dc42379a0419cbaf2827b1696699035411497_original.JPG","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"7debdaef82eff900d62a79f846564469","title":"Markram hits fastest World Cup century in SA win","link":"https://www.bbc.co.uk/sport/cricket/67038427","keywords":null,"creator":null,"video_url":null,"description":"Aiden Markram hits the fastest World Cup hundred as South Africa made 428-5 - the highest score in the tournament's history - in a 102-run victory over Sri Lanka.","content":null,"pubDate":"2023-10-07 17:14:31","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"17e9d5bb7d77059c91f4b10256566b67","title":"World Cup: South Africa thrash Sri Lanka by 102 runs after tons by Markram, de Kock, van der Dussen","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/07/world-cup-south-africa-thrash-sri-lanka-by-102-runs-after-tons-by-markram-de-kock-van-der-dussen-2621793.html","keywords":null,"creator":null,"video_url":null,"description":"The contest ended with the distinction of featuring the most runs scored in a World Cup game -- 754 NEW DELHI: A rampant South Africa crushed Sri Lanka by 102 runs here on Saturday to begin their World Cup campaign with a huge win, after setting the record for the highest total by any team in the history of the competition. Aiden Markram (106 off 54 balls) smashed a century off 49 balls to create the record of fastest ton in World Cups, while Quinton de Kock (100) and Rassie van der Dussen (108) crossed triple figures, as the Proteas made 428/5. In reply, Kusal Mendis dazzled at the top with a rapid 76, Charith Asalanka top scored with 79 in the middle-order and Dasun Shanaka found form to hit 68. But the target was way beyond Sri Lanka, who did well to make 326 in 44.5 overs, keeping South Africa on the park for as long as they could. In fact, the contest ended with the distinction of featuring the most runs scored in a World Cup game -- 754 runs were scored here at the Arun Jaitley Stadium. After Marco Jansen (2/92) cleaned up Pathum Nissanka (0) in the second over, Mendis unleashed a flurry of spectacular sixes on both sides of the wicket to provide Sri Lanka with the early impetus. With South African pacers spraying their deliveries on his pads, Mendis dispatched each of them far into the stands to raise a 25-ball fifty. The senior Sri Lanka batter seemed to be waging a lone battle as Kusal Perera (7) and Sadeera Samarawickrama (23) failed to match their partner in his endeavour. In the absence of any support from the other end, Mendis fell after a 42-ball blitz that saw him hit eight sixes and four boundaries for his 76 runs. ALSO READ | Markram stars as record-setting South Africa blitz Sri Lanka He tried cutting a delivery from Kagiso Rabada (2/50) too close to the body and was caught behind. Samarawickrama followed Mendis soon, chipping one towards midwicket with Jansen moving quickly in front to take a clean catch, off Gerald Coetzee (3/68). Asalanka also took a bit of time to settle in, but to his credit, recovered well to hit four sixes and eight fours to make 79 off 65 balls, as by then, it had become abundantly clear that Sri Lanka were only looking to reduce the margin of defeat. While Dhananjaya de Silva perished for 11, Sri Lanka captain Dasun Shanaka failed to get a move on for a large part of his innings. But Shanaka too hit his straps, smoking a six and five fours on the trot off Coetzee to bring up his fifty. Shanaka's innings ended when Keshav Maharaj (2/62) cleaned him up for 68 off 62 balls (6x4s, 3x6s). Towards the end, Kasun Rajitha swung his bat to a good effect, getting 33 from 31 balls (4x4s, 1x6s). In the first half, de Kock (100 off 84 balls; 12x4s, 3x6s), Van der Dussen (108 off 110 balls; 13x4s, 2x6s) and Markram (106 off 54 balls; 14x4s, 3x6s) powered South Africa past the highest World Cup total ever, held by Australia, who had made 417/7 against Afghanistan in the 2015 edition. After De Kock and Van der Dussen set the platform for a massive score with their second-wicket stand of 204 runs, Markram pulverised Sri Lanka. All three South African centurions -- De Kock, Van der Dussen and Markram -- also recorded their maiden World Cup hundreds. A total of 39 fours and eight sixes came collectively from the Proteas trio. Heinrich Klaasen hit another three fours and a six for his 20-ball 32 and David Miller clobbered three fours and two sixes for his unbeaten 21-ball 39. Making the most of a favourable pitch against a depleted and erring Sri Lankan bowling line-up, South African batters motored on at a high scoring rate in the middle-overs to wrest control. An early blow was dealt when Dilshan Madushanka pinned Temba Bavuma (8) in front of the wicket, but that was the only moment of joy for the Sri Lankans. De Kock and Van der Dussen, who came together a mere 10 balls into the contest, were separated only after putting their team in a commanding position with the fourth highest-ever partnership for any wicket for South Africa in the World Cup. De Kock, set to retire from ODIs after the tournament, was in his elements in getting a hundred. On the other hand, Van der Dussen celebrated his 50th ODI with a fifth ton of his career, cracking 13 fours and two sixes in the process. Markram began with two cracking straight drives for four off Madushanka and brought out every conventional stroke in his book to break the record set by Ireland's Kevin O'Brien (50 balls for 100) in 2011.","content":"NEW DELHI: A rampant South Africa crushed Sri Lanka by 102 runs here on Saturday to begin their World Cup campaign with a huge win, after setting the record for the highest total by any team in the history of the competition. Aiden Markram (106 off 54 balls) smashed a century off 49 balls to create the record of fastest ton in World Cups, while Quinton de Kock (100) and Rassie van der Dussen (108) crossed triple figures, as the Proteas made 428/5. In reply, Kusal Mendis dazzled at the top with a rapid 76, Charith Asalanka top scored with 79 in the middle-order and Dasun Shanaka found form to hit 68. But the target was way beyond Sri Lanka, who did well to make 326 in 44.5 overs, keeping South Africa on the park for as long as they could. In fact, the contest ended with the distinction of featuring the most runs scored in a World Cup game -- 754 runs were scored here at the Arun Jaitley Stadium. After Marco Jansen (2/92) cleaned up Pathum Nissanka (0) in the second over, Mendis unleashed a flurry of spectacular sixes on both sides of the wicket to provide Sri Lanka with the early impetus. With South African pacers spraying their deliveries on his pads, Mendis dispatched each of them far into the stands to raise a 25-ball fifty. The senior Sri Lanka batter seemed to be waging a lone battle as Kusal Perera (7) and Sadeera Samarawickrama (23) failed to match their partner in his endeavour. In the absence of any support from the other end, Mendis fell after a 42-ball blitz that saw him hit eight sixes and four boundaries for his 76 runs. He tried cutting a delivery from Kagiso Rabada (2/50) too close to the body and was caught behind. Samarawickrama followed Mendis soon, chipping one towards midwicket with Jansen moving quickly in front to take a clean catch, off Gerald Coetzee (3/68). Asalanka also took a bit of time to settle in, but to his credit, recovered well to hit four sixes and eight fours to make 79 off 65 balls, as by then, it had become abundantly clear that Sri Lanka were only looking to reduce the margin of defeat. While Dhananjaya de Silva perished for 11, Sri Lanka captain Dasun Shanaka failed to get a move on for a large part of his innings. But Shanaka too hit his straps, smoking a six and five fours on the trot off Coetzee to bring up his fifty. Shanaka's innings ended when Keshav Maharaj (2/62) cleaned him up for 68 off 62 balls (6x4s, 3x6s). Towards the end, Kasun Rajitha swung his bat to a good effect, getting 33 from 31 balls (4x4s, 1x6s). In the first half, de Kock (100 off 84 balls; 12x4s, 3x6s), Van der Dussen (108 off 110 balls; 13x4s, 2x6s) and Markram (106 off 54 balls; 14x4s, 3x6s) powered South Africa past the highest World Cup total ever, held by Australia, who had made 417/7 against Afghanistan in the 2015 edition. After De Kock and Van der Dussen set the platform for a massive score with their second-wicket stand of 204 runs, Markram pulverised Sri Lanka. All three South African centurions -- De Kock, Van der Dussen and Markram -- also recorded their maiden World Cup hundreds. A total of 39 fours and eight sixes came collectively from the Proteas trio. Heinrich Klaasen hit another three fours and a six for his 20-ball 32 and David Miller clobbered three fours and two sixes for his unbeaten 21-ball 39. Making the most of a favourable pitch against a depleted and erring Sri Lankan bowling line-up, South African batters motored on at a high scoring rate in the middle-overs to wrest control. An early blow was dealt when Dilshan Madushanka pinned Temba Bavuma (8) in front of the wicket, but that was the only moment of joy for the Sri Lankans. De Kock and Van der Dussen, who came together a mere 10 balls into the contest, were separated only after putting their team in a commanding position with the fourth highest-ever partnership for any wicket for South Africa in the World Cup. De Kock, set to retire from ODIs after the tournament, was in his elements in getting a hundred. On the other hand, Van der Dussen celebrated his 50th ODI with a fifth ton of his career, cracking 13 fours and two sixes in the process. Markram began with two cracking straight drives for four off Madushanka and brought out every conventional stroke in his book to break the record set by Ireland's Kevin O'Brien (50 balls for 100) in 2011.","pubDate":"2023-10-07 17:10:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0708666141aca96f7f6fdb9f87cdc7a7","title":"Liam Livingstone: England can rediscover their power-hitting mojo in Dharamshala","link":"https://www.echo-news.co.uk/sport/national/23841020.liam-livingstone-england-can-rediscover-power-hitting-mojo-dharamshala/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The altitude provides a boost for big-hitting batters at the picturesque HPCA Stadium.","content":"The reigning champions had a stuttering start to their title defence, thrashed by nine wickets after a timid performance in the curtain-raiser against New Zealand, and will be eyeing a much-improved performance against Bangladesh on Tuesday. The game takes place at the picturesque HPCA Stadium, framed against the backdrop of the Dhauladhar mountain range and sitting 1,500 metres above sea level. The altitude provides a boost for big-hitting batters, with the ball travelling further in the thinner air, and Livingstone had a chance to test the theory in the IPL earlier this year. He smashed 94 in just 48 balls for Punjab Kings, launching nine sixes along the way. And, after labouring to an under-par 282 against the Black Caps in their opener, there could not be a better venue for England to rediscover their power-hitting mojo. “It’s an incredible ground and an incredible place to bat if it’s anything like it was that day,” said Livingstone. “Conditions here should suit us and the boys are really excited. We want to get over what happened the other day and almost go twice as hard. We want to put on a really good show and get things kickstarted in this tournament. “Because of the altitude the ball just flies really well here. You can feel it, it makes you more confident to take on the boundaries. “They aren’t that big anyway and the altitude just makes it better with the power we’ve got in our line-up. It certainly helps as a batter, standing there knowing you can take the fielders on. “It’s the kind of place you can really set up the back end of the innings and score highly. Personally, I’ve got good memories here and hopefully I can repeat it.” Despite the remote nature of Dharamshala, an area better known for its proximity to the Dalai Lama’s residence just 10km away in McLeod Ganj, Livingstone is not the only squad member to have played here. Sam Curran and Jos Buttler have also passed through on IPL duty, while Buttler, Joe Root and Chris Woakes all played in England’s first ever international at the venue in 2013. England beat India on that occasion, taking seven wickets with fast bowlers, and they are likely to be tempted by an extra seamer this time. Left-armer Reece Topley was unlucky to miss out against New Zealand and heads the queue to come in, while Gus Atkinson and David Willey also stand by with Moeen Ali’s spot vulnerable. “It’s a good pitch, with good pace and carry and it can nip around,” Livingstone said. “It’s probably as English a pitch as there is out here and will probably suit us more than many grounds around the country. Hopefully that can play in our favour.” The one change England would most like to make, bringing Ben Stokes back in to bolster their middle order, is unlikely to happen as he continues to struggle with a hip problem. Without him the onus will fall on others to fashion a fitting response to their loss in Ahmedabad and Livingstone insists they are ready to oblige. He was part of the team that lost to Ireland in the group stages of last year’s T20 World Cup and went on to lift the trophy and is unfazed a single setback. “There’s no point looking back and regretting. We could have lost by one run or the way we did, either way, we move on,” he said. “One game doesn’t define a tournament and if you’re going to lose a game like that you’d probably rather it was the first one. “You can lose games and win a World Cup, we’ve shown that before. The one thing this group does well when we’ve lost a game of cricket is double down on our aggressive approach and we’ve got a chance to do that on Tuesday.”","pubDate":"2023-10-07 17:10:00","image_url":"https://www.echo-news.co.uk/resources/images/17308242/?type=app&htype=0","source_id":"echo_uk","source_priority":159993,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8691eda935ba4cf1ece325b324af0510","title":"Liam Livingstone: England can rediscover their power-hitting mojo in Dharamshala","link":"https://www.northwalespioneer.co.uk/sport/national/23841020.liam-livingstone-england-can-rediscover-power-hitting-mojo-dharamshala/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The altitude provides a boost for big-hitting batters at the picturesque HPCA Stadium.","content":"Liam Livingstone unleashed a six-hitting spree the last time he visited the Himalayan city of Dharamshala and believes it could be the perfect place for England to put their World Cup campaign back on track. The reigning champions had a stuttering start to their title defence, thrashed by nine wickets after a timid performance in the curtain-raiser against New Zealand, and will be eyeing a much-improved performance against Bangladesh on Tuesday. The game takes place at the picturesque HPCA Stadium, framed against the backdrop of the Dhauladhar mountain range and sitting 1,500 metres above sea level. The altitude provides a boost for big-hitting batters, with the ball travelling further in the thinner air, and Livingstone had a chance to test the theory in the IPL earlier this year. He smashed 94 in just 48 balls for Punjab Kings, launching nine sixes along the way. And, after labouring to an under-par 282 against the Black Caps in their opener, there could not be a better venue for England to rediscover their power-hitting mojo. “It’s an incredible ground and an incredible place to bat if it’s anything like it was that day,” said Livingstone. “Conditions here should suit us and the boys are really excited. We want to get over what happened the other day and almost go twice as hard. We want to put on a really good show and get things kickstarted in this tournament. “Because of the altitude the ball just flies really well here. You can feel it, it makes you more confident to take on the boundaries. “They aren’t that big anyway and the altitude just makes it better with the power we’ve got in our line-up. It certainly helps as a batter, standing there knowing you can take the fielders on. “It’s the kind of place you can really set up the back end of the innings and score highly. Personally, I’ve got good memories here and hopefully I can repeat it.” Despite the remote nature of Dharamshala, an area better known for its proximity to the Dalai Lama’s residence just 10km away in McLeod Ganj, Livingstone is not the only squad member to have played here. Sam Curran and Jos Buttler have also passed through on IPL duty, while Buttler, Joe Root and Chris Woakes all played in England’s first ever international at the venue in 2013. England beat India on that occasion, taking seven wickets with fast bowlers, and they are likely to be tempted by an extra seamer this time. Left-armer Reece Topley was unlucky to miss out against New Zealand and heads the queue to come in, while Gus Atkinson and David Willey also stand by with Moeen Ali’s spot vulnerable. “It’s a good pitch, with good pace and carry and it can nip around,” Livingstone said. “It’s probably as English a pitch as there is out here and will probably suit us more than many grounds around the country. Hopefully that can play in our favour.” The one change England would most like to make, bringing Ben Stokes back in to bolster their middle order, is unlikely to happen as he continues to struggle with a hip problem. Without him the onus will fall on others to fashion a fitting response to their loss in Ahmedabad and Livingstone insists they are ready to oblige. He was part of the team that lost to Ireland in the group stages of last year’s T20 World Cup and went on to lift the trophy and is unfazed a single setback. “There’s no point looking back and regretting. We could have lost by one run or the way we did, either way, we move on,” he said. “One game doesn’t define a tournament and if you’re going to lose a game like that you’d probably rather it was the first one. “You can lose games and win a World Cup, we’ve shown that before. The one thing this group does well when we’ve lost a game of cricket is double down on our aggressive approach and we’ve got a chance to do that on Tuesday.”","pubDate":"2023-10-07 17:10:00","image_url":"https://www.northwalespioneer.co.uk/resources/images/17308242/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3cb70cece59306994f8493b5e9098565","title":"Liam Livingstone: England can rediscover their power-hitting mojo in Dharamshala","link":"https://www.southwalesguardian.co.uk/sport/national/23841020.liam-livingstone-england-can-rediscover-power-hitting-mojo-dharamshala/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The altitude provides a boost for big-hitting batters at the picturesque HPCA Stadium.","content":"Liam Livingstone unleashed a six-hitting spree the last time he visited the Himalayan city of Dharamshala and believes it could be the perfect place for England to put their World Cup campaign back on track. The reigning champions had a stuttering start to their title defence, thrashed by nine wickets after a timid performance in the curtain-raiser against New Zealand, and will be eyeing a much-improved performance against Bangladesh on Tuesday. The game takes place at the picturesque HPCA Stadium, framed against the backdrop of the Dhauladhar mountain range and sitting 1,500 metres above sea level. The altitude provides a boost for big-hitting batters, with the ball travelling further in the thinner air, and Livingstone had a chance to test the theory in the IPL earlier this year. He smashed 94 in just 48 balls for Punjab Kings, launching nine sixes along the way. And, after labouring to an under-par 282 against the Black Caps in their opener, there could not be a better venue for England to rediscover their power-hitting mojo. “It’s an incredible ground and an incredible place to bat if it’s anything like it was that day,” said Livingstone. “Conditions here should suit us and the boys are really excited. We want to get over what happened the other day and almost go twice as hard. We want to put on a really good show and get things kickstarted in this tournament. “Because of the altitude the ball just flies really well here. You can feel it, it makes you more confident to take on the boundaries. “They aren’t that big anyway and the altitude just makes it better with the power we’ve got in our line-up. It certainly helps as a batter, standing there knowing you can take the fielders on. “It’s the kind of place you can really set up the back end of the innings and score highly. Personally, I’ve got good memories here and hopefully I can repeat it.” Despite the remote nature of Dharamshala, an area better known for its proximity to the Dalai Lama’s residence just 10km away in McLeod Ganj, Livingstone is not the only squad member to have played here. Sam Curran and Jos Buttler have also passed through on IPL duty, while Buttler, Joe Root and Chris Woakes all played in England’s first ever international at the venue in 2013. England beat India on that occasion, taking seven wickets with fast bowlers, and they are likely to be tempted by an extra seamer this time. Left-armer Reece Topley was unlucky to miss out against New Zealand and heads the queue to come in, while Gus Atkinson and David Willey also stand by with Moeen Ali’s spot vulnerable. “It’s a good pitch, with good pace and carry and it can nip around,” Livingstone said. “It’s probably as English a pitch as there is out here and will probably suit us more than many grounds around the country. Hopefully that can play in our favour.” The one change England would most like to make, bringing Ben Stokes back in to bolster their middle order, is unlikely to happen as he continues to struggle with a hip problem. Without him the onus will fall on others to fashion a fitting response to their loss in Ahmedabad and Livingstone insists they are ready to oblige. He was part of the team that lost to Ireland in the group stages of last year’s T20 World Cup and went on to lift the trophy and is unfazed a single setback. “There’s no point looking back and regretting. We could have lost by one run or the way we did, either way, we move on,” he said. “One game doesn’t define a tournament and if you’re going to lose a game like that you’d probably rather it was the first one. “You can lose games and win a World Cup, we’ve shown that before. The one thing this group does well when we’ve lost a game of cricket is double down on our aggressive approach and we’ve got a chance to do that on Tuesday.”","pubDate":"2023-10-07 17:10:00","image_url":"https://www.southwalesguardian.co.uk/resources/images/17308242/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0d6284e5a74a769042012bfe30c4602e","title":"South Africa dominate Sri Lanka to kick start World Cup campaign","link":"https://www.nation.com.pk/08-Oct-2023/south-africa-dominate-sri-lanka-to-kick-start-world-cup-campaign","keywords":["Sports"],"creator":["Agencies"],"video_url":null,"description":"DELHI - South Africa started their ICC Men’s World Cup 2023 cam­paign with a massive 102-run victory against Sri Lanka at the Arun Jaitley Stadium, Delhi, In­dia on Saturday.","content":"DELHI - South Africa started their ICC Men’s World Cup 2023 cam­paign with a massive 102-run victory against Sri Lanka at the Arun Jaitley Stadium, Delhi, In­dia on Saturday. It was raining fours and sixes in Delhi on Saturday and the Sri Lankan bowlers became the victim of it as they were hit all over the ground by the Proteas’ destructive batting lineup who created multiple records in the process. Batting first, South Af­rica set a gargantuan 429-run target for Sri Lanka courtesy of Quinton de Kock, Rassie van der Dussen and Aiden Markram’s blistering knocks. All three bat­ters completed their centuries with Markram scoring the fastest ever in the history of the World Cup as the 29-year-old complet­ed his hundred in just 49 balls — breaking Ireland’s Kevin O’Brien record, who scored a memorable hundred against England on just 50 balls in the 2011 World Cup, which too was played in India. This was the highest-ever total in the history of the World Cup and also the first time three dif­ferent batters scored a century in a single innings. In reply to the South Africa’s colossal total, Sri Lanka were all out for 326 runs in 44.5 overs. The Islanders started badly as the opener Pathum Nissanka was clean-bowled by Marco Jan­sen’s in-swinging beauty in the first over. However, after Nis­sanka walked back to the pavil­ion, Kusal Mendis took charge of the Lankan batting lineup and, scored a quick 76 off 42 which in­cluded eight sixes and four fours. For once, it seemed like Men­dis would do the impossible tonight by chasing the mamoth­target, but he fell prey to Kagiso Rabada. Sri Lanka kept on los­ing wickets but after Mendis, Charith Asalanka played an ex­cellent innings, scoring 79 off 65 with 12 boundaries. Skipper Dasun Shanaka con­tributed 68 runs as well but nothing was enough in front of the tremendous target. Sri Lanka will now look forward to recov­ering from this loss as they play their second World Cup match against Pakistan in Hyderabad on October 10. Meanwhile, South Africa will take on Austra­lia in Lucknow on October 12. CLINICAL BANGLADESH EASE PAST AFGHANISTAN Bangladesh secured a convincing six-wicket victory over Afghani­stan on Saturday in the third match of the ICC Men’s Cricket World Cup in Dharamshala. The Tigers successfully chased down the target in 34.4 overs after limiting the Hashmatullah Sha­hidi-led side to a total of 156. Na­jmul Hossain Shanto remained unbeaten on 59 while Mehidy Hasan hit 57. The duo dominated the chase with 97-run stand for the third wicket. Despite Afghanistan mak­ing a decent start at 47-1 and 112-2 after being put into bat, they suffered a dramatic bat­ting collapse, losing their last eight wickets for just 44 runs. This led to their dismissal for a mere 156 runs, with more than 11 overs to spare. Left-arm spinner Shakib fin­ished with figures of 3-30 in eight overs while Mehidy Hasan Miraz took 3-25. From Afghani­stan, the major contribution came from opener Rahmanul­lah Gurbaz, who scored 47 runs.","pubDate":"2023-10-07 19:34:25","image_url":"https://www.nation.com.pk/print_images/large/2023-10-08/south-africa-dominate-sri-lanka-to-kick-start-world-cup-campaign-1696707261-5826.jpg","source_id":"nation_pk","source_priority":353644,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"20a0d337ae779846f2acd1f29fc56539","title":"Jyothi, Ojas complete golden hat-trick","link":"https://www.hindustantimes.com/sports/others/jyothi-ojas-complete-golden-hattrick-101696703224528.html","keywords":null,"creator":null,"video_url":null,"description":"India's compound archers won seven medals in Hangzhou, including all five gold medals on offer","content":"Jyothi Surekha Vennam and Ojas Deotale entered this Asian Games with contrasting goals. While Vennam, competing in her third Asian Games, was searching for her first success at this stage, Deotale, in his first Asian Games, was looking to add weight to his world champion tag. On a cold and wet Saturday morning at the Fuyang Yinhu Sports Centre, the two compound archers met their goals in style, ending the Hangzhou Asiad with three gold apiece as India won all five compound gold medals on offer. India's Jyothi Surekha Vennam competes against South Korea's So Chae-won in the archery compound women's individual gold medal match during the 2022 Asian Games in Hangzhou in China's eastern Zhejiang province(AFP) Veteran Abhishek Verma went down to Deotale in an all-India final to add a silver to India's tally while the 17-year-old world champion Aditi Swami bagged a bronze medal in the women's individual compound event. India thus ended their archery campaign with nine medals, seven of which came in the compound division. We're now on WhatsApp. Click to join. Vennam beat South Korea's Chaewon So 149-145 in the individual compound final to bag her third gold at Hangzhou. With wind conditions favourable after the last couple of tough days, Vennam shot with familiar calm and precision, missing the 10 only once in 15 shots to score 140 out of a possible 150. The Korean, barring a first perfect series, erred in every following sequence to finish with 145. Reflecting on her long wait for Asiad success, Vennam said, \"Waiting is always tough for everyone and it was the same for me. Now that the good times have come, I just want to live in this moment. We should not forget the past reflecting on it helps us attain greater highs.\" The 27-year-old multiple Worlds medallist was also part of the gold medal-winning women’s and mixed teams earlier this week. The secret of her success besides the obvious hard work, she said, lay in positive thinking. In fact, Vennam began the year thinking that this would be her stage to shine. \"I started to think more positively. I began the year thinking that this would be my year. I decided to focus more on the positives in life,\" she said. Meanwhile, Deotale capped his stunning maiden Asian Games by beating his mentor Abhishek Verma 149-147 in another display of sublime shooting. The reigning world champion had gone into the final calling it a \"fun match\", but never let his focus waver. Verma and Deotale shot a perfect first series of three shots each before the former hit a nine on the last shot of his next series. A nerveless Deotale took the opportunity to complete another perfect series and open a slender one-point lead. He built on that advantage with another perfect series even as Verma hit an eight as the gap rose to three points. Verma bowed out with two perfect series while Deotale nailed 10s on all but one chance, missing out on yet another perfect 150 but taking the gold. Earlier this week, Deotale had shot 150 twice in back-to-back matches to create a Games record. The 21-year-old had earlier partnered with Vennam for the compound mixed team gold and was also a part of the men’s team, alongside Abhishek Verma and Prathamesh Jawkar, who claimed gold. \"This was my first Asian Games and I have won gold medals in all three events. What more do I need? I feel like I am living in a dream,\" Deotale gushed after the win. On competing against Verma for gold, he said, \"I had told myself that this is going to be a friendly match between us. But there is still some pressure, no matter how many times we say it's a friendly match because there is a little pressure. It is a gold medal after all, but we knew that whatever happens, it will be for India.\" \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with Asian Games 2023 Live , India vs Afghanistan Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Shantanu Srivastava Shantanu Srivastava is an experienced sports journalist who has worked across print and digital media. He covers cricket and Olympic sports. ...view detail Topics Asian Games Subscribe to our best newsletters HT Daily Capsule Pick a topic of your interest and subscribe All Newsletters Subscribe Subscribed to newsletter successfully Thank you for subscribing to our Daily News Capsule newsletter.","pubDate":"2023-10-07 18:40:15","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/07/1600x900/ARCHERY-ASIAD-2022-2023-HANGZHOU-1_1696703908824_1696703946595.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f1e71763afb2897618ca036abe04aa33","title":"Kabaddi: India beat Iran in a controversial final","link":"https://www.hindustantimes.com/sports/others/kabaddi-india-beat-iran-in-a-controversial-final-101696703087892.html","keywords":null,"creator":null,"video_url":null,"description":"The match was suspended for almost 60 minutes due to a refereeing error before India won 33-29.","content":"A conventional kabaddi match lasts 45 minutes -- two halves of 20 minutes each interspersed by a five-minute break. On Saturday, the India-Iran men's kabaddi final lasted about 100 minutes, including a 60-minute break in a final of farcical proportions. Seven-time champions India had waited for five years to reclaim the men's kabaddi gold, and after being locked at 28-all with a minute to go, the desperation spilled onto the mat in Xiaoshan Guali Sports Centre on Saturday. India players argue with a referee on a disputed decision in the men's kabaddi gold medal match between India and Iran during the Hangzhou 2022 Asian Games in Hangzhou, in China's eastern Zhejiang province(AFP) Eventually, India won the match (33-29) and the gold they coveted, but it was a controversial affair. With Iran having emerged as a genuine threat to India's supremacy, the match was always going to be a tense affair and it lived up to the billing. The teams went toe-to-toe in regulation time and beyond, the chaotic flashpoint arriving with just 65 seconds remaining in the final. We're now on WhatsApp. Click to join. Drama began shortly after India captain Pawan Sehrawat stepped up for a raid. He tried to tag an opposing defender but was unable to do so and hence stepped out into the lobby with the Iranians in pursuit. The lobby, in kabaddi parlance, is a one-metre wide area between the outer edge of the mat to the inner line and is considered active only when contact has been made between the raider and a defender. Sehrawat was followed by at least three Iranians who entered the danger zone looking to tackle him down. One of the Iranians lost balance and stepped out of bounds at the back. That's where the confusion began. As per Rule No. 28 of the International Kabaddi Federation rulebook, \"If a defender or defenders who has/have touched the ground outside the boundary, hold a raider, the raider will be declared not out. The defender or defenders who have gone out of bounds only will be declared out.\" Simply put, unless a raider has touched a defender initiating a struggle, no defender can enter the lobby in pursuit. And if anyone does enter or touches the raider in the lobby, all defenders in the lobby with a touch on that raider will be declared out. However, as per new Pro Kabaddi League (PKL) rules that were introduced this season, if a raider steps out into the lobby without a touch, the raid immediately ends and the raider is declared out. No defender who follows the raider in the lobby can be declared out. The PKL rule effectively is the exact opposite of what the international rule states. In a bizarre turn of events, the referee followed the PKL rule and awarded a point each to both teams, something that India challenged. The Indian coaching staff and players sat on the mat disputing the decision and refused to play. The Indians asked for a video referral following which three points were awarded to India and one point to Iran. Now, the Iranians launched a protest. Skipper Fazel Atrachali came off the bench to lead his players out of the playing arena. The referees and judges again went for more replays and restored their decision of awarding a point each to both teams. Confusion continued as the Indians began another round of protests with coach Edicherry Bhaskaran asking his players to sit on the mat. The Indian team also threatened a walkout. With the situation getting completely out of control, the Asian Amateur Kabaddi Federation (AAKF) officials were summoned and they sought to award a point each to both teams. The Indians didn't take the offer and continued to protest. Next, the referees and judges awarded three points to India much to the Iranians' dismay. They reluctantly resumed the match which had, by then, been reduced to an absolute mess. The post-match press conference was called off but Iran coach Gholamreza Mazandarani made his feelings known in the mixed zone. “This is very bad for kabaddi. The officials made some terrible mistakes and decisions. All of (India’s) team, their coaches and managers were putting pressure on the referees to reverse the decision and they did exactly that,\" Mazandarani said. Bhaskaran returned the favour. “They were trying to influence the decision. As per the rulebook, the decision to award us three points was correct. But they want to manipulate that. It’s bad for the image of kabaddi,\" he said. Earlier, the women's team prevailed in a tough final against Chinese-Taipei 26-25 to claim its third gold in the Asian Games history. The Indians trailed their opponents by two points in the second half but came back strongly to secure the win. The win also marked the 100th medal for India at the Asian Games. \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with Asian Games 2023 Live , India vs Afghanistan Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Shantanu Srivastava Shantanu Srivastava is an experienced sports journalist who has worked across print and digital media. He covers cricket and Olympic sports. ...view detail Topics Asian Games Subscribe to our best newsletters HT Daily Capsule Pick a topic of your interest and subscribe All Newsletters Subscribe Subscribed to newsletter successfully Thank you for subscribing to our Daily News Capsule newsletter.","pubDate":"2023-10-07 18:38:20","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/07/1600x900/KABADDI-ASIAD-2022-2023-HANGZHOU-19_1696703153062_1696703187745.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"deb701674b53b7480ba1ada482532fef","title":"SA vs SL: ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ ਜਿੱਤ ਨਾਲ ਵਿਸ਼ਵ ਕੱਪ ਦੀ ਕੀਤੀ ਸ਼ੁਰੂਆਤ, ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ ਬੁਰੀ ਤਰ੍ਹਾਂ ਨਾਲ ਹਰਾਇਆ","link":"https://punjabi.abplive.com/sports/cricket/south-africa-starts-the-world-cup-with-a-win-defeats-sri-lanka-badly-750268","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"South Africa Vs Sri Lanka: ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕੀਤੀ। ਪਹਿਲੇ ਮੈਚ 'ਚ ਅਫਰੀਕਾ ਨੇ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ 102 ਦੌੜਾਂ ਨਾਲ ਹਰਾਇਆ ਸੀ। ਮੈਚ ਵਿੱਚ ਅਫਰੀਕਾ ਵੱਲੋਂ ਤਿੰਨ ਸੈਂਕੜੇ ਲੱਗੇ, ਜਿਸ ਵਿੱਚ ਏਡਨ ਮਾਰਕਰਮ ਨੇ ਇੱਕ ਰਿਕਾਰਡ ਬਣਾਇਆ ਅਤੇ 49 ਗੇਂਦਾਂ ਵਿੱਚ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਸਭ ਤੋਂ ਤੇਜ਼ ਸੈਂਕੜਾ ਬਣਾਇਆ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਕਵਿੰਟਨ ਡੀ ਕਾਕ ਅਤੇ ਰਾਸੀ ਵੈਨ ਡੇਰ ਡੁਸਨ ਨੇ ਵੀ ਸੈਂਕੜੇ ਵਾਲੀ ਪਾਰੀ ਖੇਡੀ। ਅਫਰੀਕਾ ਨੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਦੇ ਹੋਏ 50 ਓਵਰਾਂ ਵਿੱਚ ਕੁੱਲ 428/5 ਦੌੜਾਂ ਬਣਾਈਆਂ। ਜਿਸ ਦੇ ਜਵਾਬ 'ਚ ਸ਼੍ਰੀਲੰਕਾ 326 'ਤੇ ਆਲ ਆਊਟ ਹੋ ਗਈ। ਲੰਕਾ ਦੀ ਸ਼ੁਰੂਆਤ ਚੰਗੀ ਨਹੀਂ ਰਹੀ, ਮੈਂਡਿਸ ਨੇ ਉਮੀਦ ਜਗਾਈ ਵੱਡੇ ਟੀਚੇ ਦਾ ਪਿੱਛਾ ਕਰਨ ਉਤਰੀ ਸ਼੍ਰੀਲੰਕਾ ਨੇ ਦੂਜੇ ਓਵਰ ਵਿੱਚ ਹੀ ਪਹਿਲੀ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ। ਟੀਮ ਦੇ ਸਲਾਮੀ ਬੱਲੇਬਾਜ਼ ਪਥੁਮ ਨਿਸਾਂਕਾ ਬਿਨਾਂ ਖੇਡੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਲਈ ਟੀਮ ਦਾ ਸਕੋਰ ਵਧਿਆ ਅਤੇ 8ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੰਕਾ ਨੇ ਦੂਜਾ ਵਿਕਟ ਗਵਾ ਦਿੱਤਾ। ਇਸ ਵਾਰ ਕੁਸਲ ਪਰੇਰਾ 7 (15) ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਦੌਰਾਨ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਕੁਸਲ ਮੈਂਡਿਸ ਨੇ ਆਪਣੀ ਧਮਾਕੇਦਾਰ ਪਾਰੀ ਨਾਲ ਟੀਮ ਨੂੰ ਉਮੀਦ ਜਗਾਈ। ਪਰ ਮੈਂਡਿਸ ਵੀ 12ਵੇਂ ਓਵਰ ਦੀ ਚੌਥੀ ਗੇਂਦ 'ਤੇ ਆਊਟ ਹੋ ਗਿਆ। ਮੇਂਡਿਸ ਨੇ 42 ਗੇਂਦਾਂ 'ਤੇ 180.95 ਦੀ ਸਟ੍ਰਾਈਕ ਰੇਟ ਨਾਲ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ, ਜਿਸ 'ਚ ਉਸ ਨੇ 4 ਚੌਕੇ ਅਤੇ 8 ਛੱਕੇ ਲਗਾਏ। ਇਸ ਤਰ੍ਹਾਂ ਲੰਕਾ ਨੇ 109 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਤੀਜਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਬਾਅਦ ਯਾਨੀ 14ਵੇਂ ਓਵਰ 'ਚ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ ਚੌਥਾ ਝਟਕਾ ਲੱਗਾ। ਇਸ ਵਾਰ ਸਾਦਿਰਾ ਸਮਰਾਵਿਕਰਮਾ 23 ਦੌੜਾਂ ਬਣਾ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਈ। ਚਰਿਥ ਅਸਾਲੰਕਾ ਅਤੇ ਦਾਸੁਨ ਦੀ ਪਾਰੀ ਵਿਅਰਥ ਗਈ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਚਰਿਥ ਅਸਾਲੰਕਾ ਨੇ ਇਕ ਵਾਰ ਫਿਰ ਸ਼੍ਰੀਲੰਕਾਈ ਪ੍ਰਸ਼ੰਸਕਾਂ ਦੀਆਂ ਉਮੀਦਾਂ 'ਤੇ ਪਾਣੀ ਫੇਰ ਦਿੱਤਾ। ਉਸ ਨੇ 65 ਗੇਂਦਾਂ 'ਤੇ 8 ਚੌਕਿਆਂ ਅਤੇ 4 ਛੱਕਿਆਂ ਦੀ ਮਦਦ ਨਾਲ 79 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਹਾਲਾਂਕਿ ਇਸ ਦੌਰਾਨ ਸ਼੍ਰੀਲੰਕਾ ਨੇ 150 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਧਨੰਜੈ ਡੀ ਸਿਲਵਾ (11) ਦੇ ਰੂਪ 'ਚ 5ਵੀਂ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ ਸੀ। ਫਿਰ ਅਸਾਲੰਕਾ 32ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੁੰਗੀ ਨਗਿਡੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਗਈ। ਫਿਰ 33ਵੇਂ ਓਵਰ ਵਿੱਚ ਡੁਨਿਥ ਵੇਲਾਲਾਘੇ ਗੋਲਡ ਡਕ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ ਅਤੇ 40ਵੇਂ ਓਵਰ ਵਿੱਚ ਕਪਤਾਨ ਦਾਸੁਨ ਸ਼ਨਾਕਾ 68 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਤੋਂ ਬਾਅਦ 44ਵੇਂ ਓਵਰ ਵਿੱਚ ਕੁਸਨ ਰਜਿਥਾ ਨੇ ਆਪਣਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਰਜਿਥਾ 33 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਫਰੀਕੀ ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣੇ। ਫਿਰ ਅੰਤ ਵਿੱਚ ਕਾਗਿਸੋ ਰਬਾਡਾ ਨੇ ਮਤਿਸ਼ਾ ਪਥੀਰਾਨਾ ਨੂੰ ਬੋਲਡ ਕਰਕੇ ਮੈਚ ਦਾ ਅੰਤ ਕੀਤਾ। ਇਸ ਤਰ੍ਹਾਂ ਦੀ ਸੀ ਅਫਰੀਕਾ ਦੀ ਗੇਂਦਬਾਜ਼ੀ ਟੀਮ ਲਈ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਨੇ ਸਭ ਤੋਂ ਵੱਧ 3 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦਕਿ ਮਾਰਕੋ ਜੈਨਸ ਨੇ 10 ਓਵਰਾਂ 'ਚ 9.20 ਦੀ ਆਰਥਿਕਤਾ 'ਤੇ 92 ਦੌੜਾਂ ਦੇ ਕੇ 2 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਰਬਾਡਾ ਅਤੇ ਕੇਸ਼ਵ ਮਹਾਰਾਜ ਨੇ 2-2 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦੋਂ ਕਿ ਅੰਗੀਡੀ ਨੂੰ 1 ਸਫਲਤਾ ਮਿਲੀ।","content":"South Africa Vs Sri Lanka: ਦੱ ਖਣੀ ਅਫਰੀਕਾ ਨੇ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕੀਤੀ। ਪਹਿਲੇ ਮੈਚ 'ਚ ਅਫਰੀਕਾ ਨੇ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ 102 ਦੌੜਾਂ ਨਾਲ ਹਰਾਇਆ ਸੀ। ਮੈਚ ਵਿੱਚ ਅਫਰੀਕਾ ਵੱਲੋਂ ਤਿੰਨ ਸੈਂਕੜੇ ਲੱਗੇ, ਜਿਸ ਵਿੱਚ ਏਡਨ ਮਾਰਕਰਮ ਨੇ ਇੱਕ ਰਿਕਾਰਡ ਬਣਾਇਆ ਅਤੇ 49 ਗੇਂਦਾਂ ਵਿੱਚ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਸਭ ਤੋਂ ਤੇਜ਼ ਸੈਂਕੜਾ ਬਣਾਇਆ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਕਵਿੰਟਨ ਡੀ ਕਾਕ ਅਤੇ ਰਾਸੀ ਵੈਨ ਡੇਰ ਡੁਸਨ ਨੇ ਵੀ ਸੈਂਕੜੇ ਵਾਲੀ ਪਾਰੀ ਖੇਡੀ। ਅਫਰੀਕਾ ਨੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਦੇ ਹੋਏ 50 ਓਵਰਾਂ ਵਿੱਚ ਕੁੱਲ 428/5 ਦੌੜਾਂ ਬਣਾਈਆਂ। ਜਿਸ ਦੇ ਜਵਾਬ 'ਚ ਸ਼੍ਰੀਲੰਕਾ 326 'ਤੇ ਆਲ ਆਊਟ ਹੋ ਗਈ। ਲੰਕਾ ਦੀ ਸ਼ੁਰੂਆਤ ਚੰਗੀ ਨਹੀਂ ਰਹੀ, ਮੈਂਡਿਸ ਨੇ ਉਮੀਦ ਜਗਾਈ ਵੱਡੇ ਟੀਚੇ ਦਾ ਪਿੱਛਾ ਕਰਨ ਉਤਰੀ ਸ਼੍ਰੀਲੰਕਾ ਨੇ ਦੂਜੇ ਓਵਰ ਵਿੱਚ ਹੀ ਪਹਿਲੀ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ। ਟੀਮ ਦੇ ਸਲਾਮੀ ਬੱਲੇਬਾਜ਼ ਪਥੁਮ ਨਿਸਾਂਕਾ ਬਿਨਾਂ ਖੇਡੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਲਈ ਟੀਮ ਦਾ ਸਕੋਰ ਵਧਿਆ ਅਤੇ 8ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੰਕਾ ਨੇ ਦੂਜਾ ਵਿਕਟ ਗਵਾ ਦਿੱਤਾ। ਇਸ ਵਾਰ ਕੁਸਲ ਪਰੇਰਾ 7 (15) ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਦੌਰਾਨ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਕੁਸਲ ਮੈਂਡਿਸ ਨੇ ਆਪਣੀ ਧਮਾਕੇਦਾਰ ਪਾਰੀ ਨਾਲ ਟੀਮ ਨੂੰ ਉਮੀਦ ਜਗਾਈ। ਪਰ ਮੈਂਡਿਸ ਵੀ 12ਵੇਂ ਓਵਰ ਦੀ ਚੌਥੀ ਗੇਂਦ 'ਤੇ ਆਊਟ ਹੋ ਗਿਆ। ਮੇਂਡਿਸ ਨੇ 42 ਗੇਂਦਾਂ 'ਤੇ 180.95 ਦੀ ਸਟ੍ਰਾਈਕ ਰੇਟ ਨਾਲ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ, ਜਿਸ 'ਚ ਉਸ ਨੇ 4 ਚੌਕੇ ਅਤੇ 8 ਛੱਕੇ ਲਗਾਏ। ਇਸ ਤਰ੍ਹਾਂ ਲੰਕਾ ਨੇ 109 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਤੀਜਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਬਾਅਦ ਯਾਨੀ 14ਵੇਂ ਓਵਰ 'ਚ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ ਚੌਥਾ ਝਟਕਾ ਲੱਗਾ। ਇਸ ਵਾਰ ਸਾਦਿਰਾ ਸਮਰਾਵਿਕਰਮਾ 23 ਦੌੜਾਂ ਬਣਾ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਈ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਚਰਿਥ ਅਸਾਲੰਕਾ ਅਤੇ ਦਾਸੁਨ ਦੀ ਪਾਰੀ ਵਿਅਰਥ ਗਈ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਚਰਿਥ ਅਸਾਲੰਕਾ ਨੇ ਇਕ ਵਾਰ ਫਿਰ ਸ਼੍ਰੀਲੰਕਾਈ ਪ੍ਰਸ਼ੰਸਕਾਂ ਦੀਆਂ ਉਮੀਦਾਂ 'ਤੇ ਪਾਣੀ ਫੇਰ ਦਿੱਤਾ। ਉਸ ਨੇ 65 ਗੇਂਦਾਂ 'ਤੇ 8 ਚੌਕਿਆਂ ਅਤੇ 4 ਛੱਕਿਆਂ ਦੀ ਮਦਦ ਨਾਲ 79 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਹਾਲਾਂਕਿ ਇਸ ਦੌਰਾਨ ਸ਼੍ਰੀਲੰਕਾ ਨੇ 150 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਧਨੰਜੈ ਡੀ ਸਿਲਵਾ (11) ਦੇ ਰੂਪ 'ਚ 5ਵੀਂ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ ਸੀ। ਫਿਰ ਅਸਾਲੰਕਾ 32ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੁੰਗੀ ਨਗਿਡੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਗਈ। ਫਿਰ 33ਵੇਂ ਓਵਰ ਵਿੱਚ ਡੁਨਿਥ ਵੇਲਾਲਾਘੇ ਗੋਲਡ ਡਕ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ ਅਤੇ 40ਵੇਂ ਓਵਰ ਵਿੱਚ ਕਪਤਾਨ ਦਾਸੁਨ ਸ਼ਨਾਕਾ 68 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਤੋਂ ਬਾਅਦ 44ਵੇਂ ਓਵਰ ਵਿੱਚ ਕੁਸਨ ਰਜਿਥਾ ਨੇ ਆਪਣਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਰਜਿਥਾ 33 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਫਰੀਕੀ ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣੇ। ਫਿਰ ਅੰਤ ਵਿੱਚ ਕਾਗਿਸੋ ਰਬਾਡਾ ਨੇ ਮਤਿਸ਼ਾ ਪਥੀਰਾਨਾ ਨੂੰ ਬੋਲਡ ਕਰਕੇ ਮੈਚ ਦਾ ਅੰਤ ਕੀਤਾ। ਇਸ ਤਰ੍ਹਾਂ ਦੀ ਸੀ ਅਫਰੀਕਾ ਦੀ ਗੇਂਦਬਾਜ਼ੀ ਟੀਮ ਲਈ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਨੇ ਸਭ ਤੋਂ ਵੱਧ 3 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦਕਿ ਮਾਰਕੋ ਜੈਨਸ ਨੇ 10 ਓਵਰਾਂ 'ਚ 9.20 ਦੀ ਆਰਥਿਕਤਾ 'ਤੇ 92 ਦੌੜਾਂ ਦੇ ਕੇ 2 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਰਬਾਡਾ ਅਤੇ ਕੇਸ਼ਵ ਮਹਾਰਾਜ ਨੇ 2-2 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦੋਂ ਕਿ ਅੰਗੀਡੀ ਨੂੰ 1 ਸਫਲਤਾ ਮਿਲੀ।","pubDate":"2023-10-07 17:22:17","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/07/88c54e799c768139809c7a45c765ad381696699316733497_original.JPG","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"3d02948dd103099fc9763c963b320f2a","title":"IND vs AUS: ਆਸਟ੍ਰੇਲੀਆ ਖ਼ਿਲਾਫ਼ ਇਸ ਤਰ੍ਹਾਂ ਹੋ ਸਕਦੀ ਹੈ ਭਾਰਤ ਦੀ ਪਲੇਇੰਗ ਇਲੈਵਨ, ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਜਗ੍ਹਾ ਲੈ ਸਕਦੇ ਨੇ ਈਸ਼ਾਨ ਕਿਸ਼ਨ","link":"https://punjabi.abplive.com/sports/cricket/india-s-playing-eleven-could-be-like-this-against-australia-ishan-kishan-can-replace-shubman-gill-750267","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"India Playing 11 vs Australia World Cup 2023: ਭਾਰਤ ਅਤੇ ਆਸਟ੍ਰੇਲੀਆ ਵਿਚਾਲੇ 2023 ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਭਲਕੇ ਯਾਨੀ ਐਤਵਾਰ 8 ਅਕਤੂਬਰ ਨੂੰ ਮੁਕਾਬਲਾ ਹੋਵੇਗਾ। ਇਸ ਮੈਚ ਤੋਂ ਪਹਿਲਾਂ ਸਟਾਰ ਓਪਨਰ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਬੀਮਾਰੀ ਟੀਮ ਇੰਡੀਆ ਲਈ ਚਿੰਤਾ ਦਾ ਵਿਸ਼ਾ ਹੈ। ਕਈ ਮੀਡੀਆ ਰਿਪੋਰਟਾਂ ਵਿੱਚ ਦਾਅਵਾ ਕੀਤਾ ਗਿਆ ਹੈ ਕਿ ਗਿੱਲ ਵਿਸ਼ਵ ਕੱਪ ਦੇ ਸ਼ੁਰੂਆਤੀ ਮੈਚ ਨਹੀਂ ਖੇਡ ਸਕਣਗੇ। ਦਰਅਸਲ ਗਿੱਲ ਨੂੰ ਡੇਂਗੂ ਹੋ ਗਿਆ ਹੈ। ਭਾਰਤ ਅਤੇ ਆਸਟਰੇਲੀਆ ਵਿਚਾਲੇ ਮੈਚ ਚੇਨਈ ਦੇ ਐੱਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਇਹ ਮੈਚ ਦੁਪਹਿਰ 2 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਦਾ ਇਹ 2023 ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਪਹਿਲਾ ਮੈਚ ਹੈ। ਅਜਿਹੇ 'ਚ ਦੋਵੇਂ ਵਿਸ਼ਵ ਕੱਪ ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕਰਨਾ ਚਾਹੁਣਗੇ। ਇਹ ਖਿਡਾਰੀ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਕਰੇਗਾ ਓਪਨਿੰਗ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਗੈਰ-ਮੌਜੂਦਗੀ ਵਿੱਚ ਇਸ਼ਾਨ ਕਿਸ਼ਨ ਕਪਤਾਨ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਪਾਰੀ ਦੀ ਸ਼ੁਰੂਆਤ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਰਾਟ ਕੋਹਲੀ ਦਾ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਈਸ਼ਾਨ ਜਿਸ ਫਾਰਮ 'ਚ ਹਨ, ਉਸ ਨੂੰ ਦੇਖਦੇ ਹੋਏ ਕਿਹਾ ਜਾ ਸਕਦਾ ਹੈ ਕਿ ਟੀਮ ਇੰਡੀਆ ਗਿੱਲ ਦੀ ਕਮੀ ਨਹੀਂ ਛੱਡੇਗੀ। ਇਸ ਤਰ੍ਹਾਂ ਹੋਵੇਗਾ ਮਿਡਲ ਆਰਡਰ  ਸ਼੍ਰੇਅਸ ਅਈਅਰ ਚੌਥੇ ਨੰਬਰ 'ਤੇ ਖੇਡ ਸਕਦਾ ਹੈ। ਅਈਅਰ 2023 ਏਸ਼ੀਆ ਕੱਪ ਲਈ ਟੀਮ 'ਚ ਵਾਪਸੀ ਕਰ ਚੁੱਕੇ ਹਨ। ਉਹ ਚੰਗੀ ਫਾਰਮ 'ਚ ਨਜ਼ਰ ਆ ਰਿਹਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਕਟਕੀਪਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਦਾ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪੰਡਯਾ ਦਾ ਵੀ ਛੇਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਯਕੀਨੀ ਹੈ। ਤਿੰਨ ਸਪਿਨਰਾਂ ਦੇ ਨਾਲ ਉੱਤਰ ਸਕਦੀ ਹੈ ਟੀਮ ਇੰਡੀਆ  ਭਾਰਤ ਦਾ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਮੈਚ ਚੇਨਈ ਦੇ ਐਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਣਾ ਹੈ। ਇੱਥੋਂ ਦੀ ਪਿੱਚ ਸਪਿਨਰਾਂ ਲਈ ਢੁਕਵੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀਮ ਇੰਡੀਆ ਤਿੰਨ ਸਪਿਨਰਾਂ ਨਾਲ ਆਸਟ੍ਰੇਲੀਆ ਦੇ ਖਿਲਾਫ ਉਤਰ ਸਕਦੀ ਹੈ। ਇਸ ਦਾ ਮਤਲਬ ਹੈ ਕਿ ਕੁਲਦੀਪ ਯਾਦਵ, ਰਵਿੰਦਰ ਜਡੇਜਾ ਅਤੇ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਦੀ ਤਿਕੜੀ ਐਕਸ਼ਨ 'ਚ ਨਜ਼ਰ ਆ ਸਕਦੀ ਹੈ। ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ੀ ਦੀ ਜ਼ਿੰਮੇਵਾਰੀ ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ ਦੇ ਮੋਢਿਆਂ 'ਤੇ ਹੋਵੇਗੀ। ਆਸਟ੍ਰੇਲੀਆ ਵਿਰੁੱਧ ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ - ਰੋਹਿਤ ਸ਼ਰਮਾ (ਕਪਤਾਨ), ਈਸ਼ਾਨ ਕਿਸ਼ਨ, ਵਿਰਾਟ ਕੋਹਲੀ, ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਕੇਐਲ ਰਾਹੁਲ (ਵਿਕਟਕੀਪਰ), ਹਾਰਦਿਕ ਪੰਡਯਾ, ਰਵਿੰਦਰ ਜਡੇਜਾ, ਆਰ ਅਸ਼ਵਿਨ, ਕੁਲਦੀਪ ਯਾਦਵ, ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ।","content":"India Playing 11 vs Australia World Cup 2023: ਭਾਰਤ ਅਤੇ ਆਸਟ੍ਰੇਲੀਆ ਵਿਚਾਲੇ 2023 ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਭਲਕੇ ਯਾਨੀ ਐਤਵਾਰ 8 ਅਕਤੂਬਰ ਨੂੰ ਮੁਕਾਬਲਾ ਹੋਵੇਗਾ। ਇਸ ਮੈਚ ਤੋਂ ਪਹਿਲਾਂ ਸਟਾਰ ਓਪਨਰ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਬੀਮਾਰੀ ਟੀਮ ਇੰਡੀਆ ਲਈ ਚਿੰਤਾ ਦਾ ਵਿਸ਼ਾ ਹੈ। ਕਈ ਮੀਡੀਆ ਰਿਪੋਰਟਾਂ ਵਿੱਚ ਦਾਅਵਾ ਕੀਤਾ ਗਿਆ ਹੈ ਕਿ ਗਿੱਲ ਵਿਸ਼ਵ ਕੱਪ ਦੇ ਸ਼ੁਰੂਆਤੀ ਮੈਚ ਨਹੀਂ ਖੇਡ ਸਕਣਗੇ। ਦਰਅਸਲ ਗਿੱਲ ਨੂੰ ਡੇਂਗੂ ਹੋ ਗਿਆ ਹੈ। ਭਾਰਤ ਅਤੇ ਆਸਟਰੇਲੀਆ ਵਿਚਾਲੇ ਮੈਚ ਚੇਨਈ ਦੇ ਐੱਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਇਹ ਮੈਚ ਦੁਪਹਿਰ 2 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਦਾ ਇਹ 2023 ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਪਹਿਲਾ ਮੈਚ ਹੈ। ਅਜਿਹੇ 'ਚ ਦੋਵੇਂ ਵਿਸ਼ਵ ਕੱਪ ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕਰਨਾ ਚਾਹੁਣਗੇ। ਇਹ ਖਿਡਾਰੀ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਕਰੇਗਾ ਓਪਨਿੰਗ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਗੈਰ-ਮੌਜੂਦਗੀ ਵਿੱਚ ਇਸ਼ਾਨ ਕਿਸ਼ਨ ਕਪਤਾਨ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਪਾਰੀ ਦੀ ਸ਼ੁਰੂਆਤ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਰਾਟ ਕੋਹਲੀ ਦਾ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਈਸ਼ਾਨ ਜਿਸ ਫਾਰਮ 'ਚ ਹਨ, ਉਸ ਨੂੰ ਦੇਖਦੇ ਹੋਏ ਕਿਹਾ ਜਾ ਸਕਦਾ ਹੈ ਕਿ ਟੀਮ ਇੰਡੀਆ ਗਿੱਲ ਦੀ ਕਮੀ ਨਹੀਂ ਛੱਡੇਗੀ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਇਸ ਤਰ੍ਹਾਂ ਹੋਵੇਗਾ ਮਿਡਲ ਆਰਡਰ ਸ਼੍ਰੇਅਸ ਅਈਅਰ ਚੌਥੇ ਨੰਬਰ 'ਤੇ ਖੇਡ ਸਕਦਾ ਹੈ। ਅਈਅਰ 2023 ਏਸ਼ੀਆ ਕੱਪ ਲਈ ਟੀਮ 'ਚ ਵਾਪਸੀ ਕਰ ਚੁੱਕੇ ਹਨ। ਉਹ ਚੰਗੀ ਫਾਰਮ 'ਚ ਨਜ਼ਰ ਆ ਰਿਹਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਕਟਕੀਪਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਦਾ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪੰਡਯਾ ਦਾ ਵੀ ਛੇਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਯਕੀਨੀ ਹੈ। ਤਿੰਨ ਸਪਿਨਰਾਂ ਦੇ ਨਾਲ ਉੱਤਰ ਸਕਦੀ ਹੈ ਟੀਮ ਇੰਡੀਆ ਭਾਰਤ ਦਾ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਮੈਚ ਚੇਨਈ ਦੇ ਐਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਣਾ ਹੈ। ਇੱਥੋਂ ਦੀ ਪਿੱਚ ਸਪਿਨਰਾਂ ਲਈ ਢੁਕਵੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀਮ ਇੰਡੀਆ ਤਿੰਨ ਸਪਿਨਰਾਂ ਨਾਲ ਆਸਟ੍ਰੇਲੀਆ ਦੇ ਖਿਲਾਫ ਉਤਰ ਸਕਦੀ ਹੈ। ਇਸ ਦਾ ਮਤਲਬ ਹੈ ਕਿ ਕੁਲਦੀਪ ਯਾਦਵ, ਰਵਿੰਦਰ ਜਡੇਜਾ ਅਤੇ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਦੀ ਤਿਕੜੀ ਐਕਸ਼ਨ 'ਚ ਨਜ਼ਰ ਆ ਸਕਦੀ ਹੈ। ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ੀ ਦੀ ਜ਼ਿੰਮੇਵਾਰੀ ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ ਦੇ ਮੋਢਿਆਂ 'ਤੇ ਹੋਵੇਗੀ। ਆਸਟ੍ਰੇਲੀਆ ਵਿਰੁੱਧ ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ - ਰੋਹਿਤ ਸ਼ਰਮਾ (ਕਪਤਾਨ), ਈਸ਼ਾਨ ਕਿਸ਼ਨ, ਵਿਰਾਟ ਕੋਹਲੀ , ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਕੇਐਲ ਰਾਹੁਲ (ਵਿਕਟਕੀਪਰ), ਹਾਰਦਿਕ ਪੰਡਯਾ , ਰਵਿੰਦਰ ਜਡੇਜਾ, ਆਰ ਅਸ਼ਵਿਨ, ਕੁਲਦੀਪ ਯਾਦਵ, ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ।","pubDate":"2023-10-07 17:17:32","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/07/ac395fe7509dc42379a0419cbaf2827b1696699035411497_original.JPG","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"7debdaef82eff900d62a79f846564469","title":"Markram hits fastest World Cup century in SA win","link":"https://www.bbc.co.uk/sport/cricket/67038427","keywords":null,"creator":null,"video_url":null,"description":"Aiden Markram hits the fastest World Cup hundred as South Africa made 428-5 - the highest score in the tournament's history - in a 102-run victory over Sri Lanka.","content":null,"pubDate":"2023-10-07 17:14:31","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"17e9d5bb7d77059c91f4b10256566b67","title":"World Cup: South Africa thrash Sri Lanka by 102 runs after tons by Markram, de Kock, van der Dussen","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/07/world-cup-south-africa-thrash-sri-lanka-by-102-runs-after-tons-by-markram-de-kock-van-der-dussen-2621793.html","keywords":null,"creator":null,"video_url":null,"description":"The contest ended with the distinction of featuring the most runs scored in a World Cup game -- 754 NEW DELHI: A rampant South Africa crushed Sri Lanka by 102 runs here on Saturday to begin their World Cup campaign with a huge win, after setting the record for the highest total by any team in the history of the competition. Aiden Markram (106 off 54 balls) smashed a century off 49 balls to create the record of fastest ton in World Cups, while Quinton de Kock (100) and Rassie van der Dussen (108) crossed triple figures, as the Proteas made 428/5. In reply, Kusal Mendis dazzled at the top with a rapid 76, Charith Asalanka top scored with 79 in the middle-order and Dasun Shanaka found form to hit 68. But the target was way beyond Sri Lanka, who did well to make 326 in 44.5 overs, keeping South Africa on the park for as long as they could. In fact, the contest ended with the distinction of featuring the most runs scored in a World Cup game -- 754 runs were scored here at the Arun Jaitley Stadium. After Marco Jansen (2/92) cleaned up Pathum Nissanka (0) in the second over, Mendis unleashed a flurry of spectacular sixes on both sides of the wicket to provide Sri Lanka with the early impetus. With South African pacers spraying their deliveries on his pads, Mendis dispatched each of them far into the stands to raise a 25-ball fifty. The senior Sri Lanka batter seemed to be waging a lone battle as Kusal Perera (7) and Sadeera Samarawickrama (23) failed to match their partner in his endeavour. In the absence of any support from the other end, Mendis fell after a 42-ball blitz that saw him hit eight sixes and four boundaries for his 76 runs. ALSO READ | Markram stars as record-setting South Africa blitz Sri Lanka He tried cutting a delivery from Kagiso Rabada (2/50) too close to the body and was caught behind. Samarawickrama followed Mendis soon, chipping one towards midwicket with Jansen moving quickly in front to take a clean catch, off Gerald Coetzee (3/68). Asalanka also took a bit of time to settle in, but to his credit, recovered well to hit four sixes and eight fours to make 79 off 65 balls, as by then, it had become abundantly clear that Sri Lanka were only looking to reduce the margin of defeat. While Dhananjaya de Silva perished for 11, Sri Lanka captain Dasun Shanaka failed to get a move on for a large part of his innings. But Shanaka too hit his straps, smoking a six and five fours on the trot off Coetzee to bring up his fifty. Shanaka's innings ended when Keshav Maharaj (2/62) cleaned him up for 68 off 62 balls (6x4s, 3x6s). Towards the end, Kasun Rajitha swung his bat to a good effect, getting 33 from 31 balls (4x4s, 1x6s). In the first half, de Kock (100 off 84 balls; 12x4s, 3x6s), Van der Dussen (108 off 110 balls; 13x4s, 2x6s) and Markram (106 off 54 balls; 14x4s, 3x6s) powered South Africa past the highest World Cup total ever, held by Australia, who had made 417/7 against Afghanistan in the 2015 edition. After De Kock and Van der Dussen set the platform for a massive score with their second-wicket stand of 204 runs, Markram pulverised Sri Lanka. All three South African centurions -- De Kock, Van der Dussen and Markram -- also recorded their maiden World Cup hundreds. A total of 39 fours and eight sixes came collectively from the Proteas trio. Heinrich Klaasen hit another three fours and a six for his 20-ball 32 and David Miller clobbered three fours and two sixes for his unbeaten 21-ball 39. Making the most of a favourable pitch against a depleted and erring Sri Lankan bowling line-up, South African batters motored on at a high scoring rate in the middle-overs to wrest control. An early blow was dealt when Dilshan Madushanka pinned Temba Bavuma (8) in front of the wicket, but that was the only moment of joy for the Sri Lankans. De Kock and Van der Dussen, who came together a mere 10 balls into the contest, were separated only after putting their team in a commanding position with the fourth highest-ever partnership for any wicket for South Africa in the World Cup. De Kock, set to retire from ODIs after the tournament, was in his elements in getting a hundred. On the other hand, Van der Dussen celebrated his 50th ODI with a fifth ton of his career, cracking 13 fours and two sixes in the process. Markram began with two cracking straight drives for four off Madushanka and brought out every conventional stroke in his book to break the record set by Ireland's Kevin O'Brien (50 balls for 100) in 2011.","content":"NEW DELHI: A rampant South Africa crushed Sri Lanka by 102 runs here on Saturday to begin their World Cup campaign with a huge win, after setting the record for the highest total by any team in the history of the competition. Aiden Markram (106 off 54 balls) smashed a century off 49 balls to create the record of fastest ton in World Cups, while Quinton de Kock (100) and Rassie van der Dussen (108) crossed triple figures, as the Proteas made 428/5. In reply, Kusal Mendis dazzled at the top with a rapid 76, Charith Asalanka top scored with 79 in the middle-order and Dasun Shanaka found form to hit 68. But the target was way beyond Sri Lanka, who did well to make 326 in 44.5 overs, keeping South Africa on the park for as long as they could. In fact, the contest ended with the distinction of featuring the most runs scored in a World Cup game -- 754 runs were scored here at the Arun Jaitley Stadium. After Marco Jansen (2/92) cleaned up Pathum Nissanka (0) in the second over, Mendis unleashed a flurry of spectacular sixes on both sides of the wicket to provide Sri Lanka with the early impetus. With South African pacers spraying their deliveries on his pads, Mendis dispatched each of them far into the stands to raise a 25-ball fifty. The senior Sri Lanka batter seemed to be waging a lone battle as Kusal Perera (7) and Sadeera Samarawickrama (23) failed to match their partner in his endeavour. In the absence of any support from the other end, Mendis fell after a 42-ball blitz that saw him hit eight sixes and four boundaries for his 76 runs. He tried cutting a delivery from Kagiso Rabada (2/50) too close to the body and was caught behind. Samarawickrama followed Mendis soon, chipping one towards midwicket with Jansen moving quickly in front to take a clean catch, off Gerald Coetzee (3/68). Asalanka also took a bit of time to settle in, but to his credit, recovered well to hit four sixes and eight fours to make 79 off 65 balls, as by then, it had become abundantly clear that Sri Lanka were only looking to reduce the margin of defeat. While Dhananjaya de Silva perished for 11, Sri Lanka captain Dasun Shanaka failed to get a move on for a large part of his innings. But Shanaka too hit his straps, smoking a six and five fours on the trot off Coetzee to bring up his fifty. Shanaka's innings ended when Keshav Maharaj (2/62) cleaned him up for 68 off 62 balls (6x4s, 3x6s). Towards the end, Kasun Rajitha swung his bat to a good effect, getting 33 from 31 balls (4x4s, 1x6s). In the first half, de Kock (100 off 84 balls; 12x4s, 3x6s), Van der Dussen (108 off 110 balls; 13x4s, 2x6s) and Markram (106 off 54 balls; 14x4s, 3x6s) powered South Africa past the highest World Cup total ever, held by Australia, who had made 417/7 against Afghanistan in the 2015 edition. After De Kock and Van der Dussen set the platform for a massive score with their second-wicket stand of 204 runs, Markram pulverised Sri Lanka. All three South African centurions -- De Kock, Van der Dussen and Markram -- also recorded their maiden World Cup hundreds. A total of 39 fours and eight sixes came collectively from the Proteas trio. Heinrich Klaasen hit another three fours and a six for his 20-ball 32 and David Miller clobbered three fours and two sixes for his unbeaten 21-ball 39. Making the most of a favourable pitch against a depleted and erring Sri Lankan bowling line-up, South African batters motored on at a high scoring rate in the middle-overs to wrest control. An early blow was dealt when Dilshan Madushanka pinned Temba Bavuma (8) in front of the wicket, but that was the only moment of joy for the Sri Lankans. De Kock and Van der Dussen, who came together a mere 10 balls into the contest, were separated only after putting their team in a commanding position with the fourth highest-ever partnership for any wicket for South Africa in the World Cup. De Kock, set to retire from ODIs after the tournament, was in his elements in getting a hundred. On the other hand, Van der Dussen celebrated his 50th ODI with a fifth ton of his career, cracking 13 fours and two sixes in the process. Markram began with two cracking straight drives for four off Madushanka and brought out every conventional stroke in his book to break the record set by Ireland's Kevin O'Brien (50 balls for 100) in 2011.","pubDate":"2023-10-07 17:10:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0708666141aca96f7f6fdb9f87cdc7a7","title":"Liam Livingstone: England can rediscover their power-hitting mojo in Dharamshala","link":"https://www.echo-news.co.uk/sport/national/23841020.liam-livingstone-england-can-rediscover-power-hitting-mojo-dharamshala/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The altitude provides a boost for big-hitting batters at the picturesque HPCA Stadium.","content":"The reigning champions had a stuttering start to their title defence, thrashed by nine wickets after a timid performance in the curtain-raiser against New Zealand, and will be eyeing a much-improved performance against Bangladesh on Tuesday. The game takes place at the picturesque HPCA Stadium, framed against the backdrop of the Dhauladhar mountain range and sitting 1,500 metres above sea level. The altitude provides a boost for big-hitting batters, with the ball travelling further in the thinner air, and Livingstone had a chance to test the theory in the IPL earlier this year. He smashed 94 in just 48 balls for Punjab Kings, launching nine sixes along the way. And, after labouring to an under-par 282 against the Black Caps in their opener, there could not be a better venue for England to rediscover their power-hitting mojo. “It’s an incredible ground and an incredible place to bat if it’s anything like it was that day,” said Livingstone. “Conditions here should suit us and the boys are really excited. We want to get over what happened the other day and almost go twice as hard. We want to put on a really good show and get things kickstarted in this tournament. “Because of the altitude the ball just flies really well here. You can feel it, it makes you more confident to take on the boundaries. “They aren’t that big anyway and the altitude just makes it better with the power we’ve got in our line-up. It certainly helps as a batter, standing there knowing you can take the fielders on. “It’s the kind of place you can really set up the back end of the innings and score highly. Personally, I’ve got good memories here and hopefully I can repeat it.” Despite the remote nature of Dharamshala, an area better known for its proximity to the Dalai Lama’s residence just 10km away in McLeod Ganj, Livingstone is not the only squad member to have played here. Sam Curran and Jos Buttler have also passed through on IPL duty, while Buttler, Joe Root and Chris Woakes all played in England’s first ever international at the venue in 2013. England beat India on that occasion, taking seven wickets with fast bowlers, and they are likely to be tempted by an extra seamer this time. Left-armer Reece Topley was unlucky to miss out against New Zealand and heads the queue to come in, while Gus Atkinson and David Willey also stand by with Moeen Ali’s spot vulnerable. “It’s a good pitch, with good pace and carry and it can nip around,” Livingstone said. “It’s probably as English a pitch as there is out here and will probably suit us more than many grounds around the country. Hopefully that can play in our favour.” The one change England would most like to make, bringing Ben Stokes back in to bolster their middle order, is unlikely to happen as he continues to struggle with a hip problem. Without him the onus will fall on others to fashion a fitting response to their loss in Ahmedabad and Livingstone insists they are ready to oblige. He was part of the team that lost to Ireland in the group stages of last year’s T20 World Cup and went on to lift the trophy and is unfazed a single setback. “There’s no point looking back and regretting. We could have lost by one run or the way we did, either way, we move on,” he said. “One game doesn’t define a tournament and if you’re going to lose a game like that you’d probably rather it was the first one. “You can lose games and win a World Cup, we’ve shown that before. The one thing this group does well when we’ve lost a game of cricket is double down on our aggressive approach and we’ve got a chance to do that on Tuesday.”","pubDate":"2023-10-07 17:10:00","image_url":"https://www.echo-news.co.uk/resources/images/17308242/?type=app&htype=0","source_id":"echo_uk","source_priority":159993,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8691eda935ba4cf1ece325b324af0510","title":"Liam Livingstone: England can rediscover their power-hitting mojo in Dharamshala","link":"https://www.northwalespioneer.co.uk/sport/national/23841020.liam-livingstone-england-can-rediscover-power-hitting-mojo-dharamshala/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The altitude provides a boost for big-hitting batters at the picturesque HPCA Stadium.","content":"Liam Livingstone unleashed a six-hitting spree the last time he visited the Himalayan city of Dharamshala and believes it could be the perfect place for England to put their World Cup campaign back on track. The reigning champions had a stuttering start to their title defence, thrashed by nine wickets after a timid performance in the curtain-raiser against New Zealand, and will be eyeing a much-improved performance against Bangladesh on Tuesday. The game takes place at the picturesque HPCA Stadium, framed against the backdrop of the Dhauladhar mountain range and sitting 1,500 metres above sea level. The altitude provides a boost for big-hitting batters, with the ball travelling further in the thinner air, and Livingstone had a chance to test the theory in the IPL earlier this year. He smashed 94 in just 48 balls for Punjab Kings, launching nine sixes along the way. And, after labouring to an under-par 282 against the Black Caps in their opener, there could not be a better venue for England to rediscover their power-hitting mojo. “It’s an incredible ground and an incredible place to bat if it’s anything like it was that day,” said Livingstone. “Conditions here should suit us and the boys are really excited. We want to get over what happened the other day and almost go twice as hard. We want to put on a really good show and get things kickstarted in this tournament. “Because of the altitude the ball just flies really well here. You can feel it, it makes you more confident to take on the boundaries. “They aren’t that big anyway and the altitude just makes it better with the power we’ve got in our line-up. It certainly helps as a batter, standing there knowing you can take the fielders on. “It’s the kind of place you can really set up the back end of the innings and score highly. Personally, I’ve got good memories here and hopefully I can repeat it.” Despite the remote nature of Dharamshala, an area better known for its proximity to the Dalai Lama’s residence just 10km away in McLeod Ganj, Livingstone is not the only squad member to have played here. Sam Curran and Jos Buttler have also passed through on IPL duty, while Buttler, Joe Root and Chris Woakes all played in England’s first ever international at the venue in 2013. England beat India on that occasion, taking seven wickets with fast bowlers, and they are likely to be tempted by an extra seamer this time. Left-armer Reece Topley was unlucky to miss out against New Zealand and heads the queue to come in, while Gus Atkinson and David Willey also stand by with Moeen Ali’s spot vulnerable. “It’s a good pitch, with good pace and carry and it can nip around,” Livingstone said. “It’s probably as English a pitch as there is out here and will probably suit us more than many grounds around the country. Hopefully that can play in our favour.” The one change England would most like to make, bringing Ben Stokes back in to bolster their middle order, is unlikely to happen as he continues to struggle with a hip problem. Without him the onus will fall on others to fashion a fitting response to their loss in Ahmedabad and Livingstone insists they are ready to oblige. He was part of the team that lost to Ireland in the group stages of last year’s T20 World Cup and went on to lift the trophy and is unfazed a single setback. “There’s no point looking back and regretting. We could have lost by one run or the way we did, either way, we move on,” he said. “One game doesn’t define a tournament and if you’re going to lose a game like that you’d probably rather it was the first one. “You can lose games and win a World Cup, we’ve shown that before. The one thing this group does well when we’ve lost a game of cricket is double down on our aggressive approach and we’ve got a chance to do that on Tuesday.”","pubDate":"2023-10-07 17:10:00","image_url":"https://www.northwalespioneer.co.uk/resources/images/17308242/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3cb70cece59306994f8493b5e9098565","title":"Liam Livingstone: England can rediscover their power-hitting mojo in Dharamshala","link":"https://www.southwalesguardian.co.uk/sport/national/23841020.liam-livingstone-england-can-rediscover-power-hitting-mojo-dharamshala/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The altitude provides a boost for big-hitting batters at the picturesque HPCA Stadium.","content":"Liam Livingstone unleashed a six-hitting spree the last time he visited the Himalayan city of Dharamshala and believes it could be the perfect place for England to put their World Cup campaign back on track. The reigning champions had a stuttering start to their title defence, thrashed by nine wickets after a timid performance in the curtain-raiser against New Zealand, and will be eyeing a much-improved performance against Bangladesh on Tuesday. The game takes place at the picturesque HPCA Stadium, framed against the backdrop of the Dhauladhar mountain range and sitting 1,500 metres above sea level. The altitude provides a boost for big-hitting batters, with the ball travelling further in the thinner air, and Livingstone had a chance to test the theory in the IPL earlier this year. He smashed 94 in just 48 balls for Punjab Kings, launching nine sixes along the way. And, after labouring to an under-par 282 against the Black Caps in their opener, there could not be a better venue for England to rediscover their power-hitting mojo. “It’s an incredible ground and an incredible place to bat if it’s anything like it was that day,” said Livingstone. “Conditions here should suit us and the boys are really excited. We want to get over what happened the other day and almost go twice as hard. We want to put on a really good show and get things kickstarted in this tournament. “Because of the altitude the ball just flies really well here. You can feel it, it makes you more confident to take on the boundaries. “They aren’t that big anyway and the altitude just makes it better with the power we’ve got in our line-up. It certainly helps as a batter, standing there knowing you can take the fielders on. “It’s the kind of place you can really set up the back end of the innings and score highly. Personally, I’ve got good memories here and hopefully I can repeat it.” Despite the remote nature of Dharamshala, an area better known for its proximity to the Dalai Lama’s residence just 10km away in McLeod Ganj, Livingstone is not the only squad member to have played here. Sam Curran and Jos Buttler have also passed through on IPL duty, while Buttler, Joe Root and Chris Woakes all played in England’s first ever international at the venue in 2013. England beat India on that occasion, taking seven wickets with fast bowlers, and they are likely to be tempted by an extra seamer this time. Left-armer Reece Topley was unlucky to miss out against New Zealand and heads the queue to come in, while Gus Atkinson and David Willey also stand by with Moeen Ali’s spot vulnerable. “It’s a good pitch, with good pace and carry and it can nip around,” Livingstone said. “It’s probably as English a pitch as there is out here and will probably suit us more than many grounds around the country. Hopefully that can play in our favour.” The one change England would most like to make, bringing Ben Stokes back in to bolster their middle order, is unlikely to happen as he continues to struggle with a hip problem. Without him the onus will fall on others to fashion a fitting response to their loss in Ahmedabad and Livingstone insists they are ready to oblige. He was part of the team that lost to Ireland in the group stages of last year’s T20 World Cup and went on to lift the trophy and is unfazed a single setback. “There’s no point looking back and regretting. We could have lost by one run or the way we did, either way, we move on,” he said. “One game doesn’t define a tournament and if you’re going to lose a game like that you’d probably rather it was the first one. “You can lose games and win a World Cup, we’ve shown that before. The one thing this group does well when we’ve lost a game of cricket is double down on our aggressive approach and we’ve got a chance to do that on Tuesday.”","pubDate":"2023-10-07 17:10:00","image_url":"https://www.southwalesguardian.co.uk/resources/images/17308242/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0d6284e5a74a769042012bfe30c4602e","title":"South Africa dominate Sri Lanka to kick start World Cup campaign","link":"https://www.nation.com.pk/08-Oct-2023/south-africa-dominate-sri-lanka-to-kick-start-world-cup-campaign","keywords":["Sports"],"creator":["Agencies"],"video_url":null,"description":"DELHI - South Africa started their ICC Men’s World Cup 2023 cam­paign with a massive 102-run victory against Sri Lanka at the Arun Jaitley Stadium, Delhi, In­dia on Saturday.","content":"DELHI - South Africa started their ICC Men’s World Cup 2023 cam­paign with a massive 102-run victory against Sri Lanka at the Arun Jaitley Stadium, Delhi, In­dia on Saturday. It was raining fours and sixes in Delhi on Saturday and the Sri Lankan bowlers became the victim of it as they were hit all over the ground by the Proteas’ destructive batting lineup who created multiple records in the process. Batting first, South Af­rica set a gargantuan 429-run target for Sri Lanka courtesy of Quinton de Kock, Rassie van der Dussen and Aiden Markram’s blistering knocks. All three bat­ters completed their centuries with Markram scoring the fastest ever in the history of the World Cup as the 29-year-old complet­ed his hundred in just 49 balls — breaking Ireland’s Kevin O’Brien record, who scored a memorable hundred against England on just 50 balls in the 2011 World Cup, which too was played in India. This was the highest-ever total in the history of the World Cup and also the first time three dif­ferent batters scored a century in a single innings. In reply to the South Africa’s colossal total, Sri Lanka were all out for 326 runs in 44.5 overs. The Islanders started badly as the opener Pathum Nissanka was clean-bowled by Marco Jan­sen’s in-swinging beauty in the first over. However, after Nis­sanka walked back to the pavil­ion, Kusal Mendis took charge of the Lankan batting lineup and, scored a quick 76 off 42 which in­cluded eight sixes and four fours. For once, it seemed like Men­dis would do the impossible tonight by chasing the mamoth­target, but he fell prey to Kagiso Rabada. Sri Lanka kept on los­ing wickets but after Mendis, Charith Asalanka played an ex­cellent innings, scoring 79 off 65 with 12 boundaries. Skipper Dasun Shanaka con­tributed 68 runs as well but nothing was enough in front of the tremendous target. Sri Lanka will now look forward to recov­ering from this loss as they play their second World Cup match against Pakistan in Hyderabad on October 10. Meanwhile, South Africa will take on Austra­lia in Lucknow on October 12. CLINICAL BANGLADESH EASE PAST AFGHANISTAN Bangladesh secured a convincing six-wicket victory over Afghani­stan on Saturday in the third match of the ICC Men’s Cricket World Cup in Dharamshala. The Tigers successfully chased down the target in 34.4 overs after limiting the Hashmatullah Sha­hidi-led side to a total of 156. Na­jmul Hossain Shanto remained unbeaten on 59 while Mehidy Hasan hit 57. The duo dominated the chase with 97-run stand for the third wicket. Despite Afghanistan mak­ing a decent start at 47-1 and 112-2 after being put into bat, they suffered a dramatic bat­ting collapse, losing their last eight wickets for just 44 runs. This led to their dismissal for a mere 156 runs, with more than 11 overs to spare. Left-arm spinner Shakib fin­ished with figures of 3-30 in eight overs while Mehidy Hasan Miraz took 3-25. From Afghani­stan, the major contribution came from opener Rahmanul­lah Gurbaz, who scored 47 runs.","pubDate":"2023-10-07 19:34:25","image_url":"https://www.nation.com.pk/print_images/large/2023-10-08/south-africa-dominate-sri-lanka-to-kick-start-world-cup-campaign-1696707261-5826.jpg","source_id":"nation_pk","source_priority":353644,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"20a0d337ae779846f2acd1f29fc56539","title":"Jyothi, Ojas complete golden hat-trick","link":"https://www.hindustantimes.com/sports/others/jyothi-ojas-complete-golden-hattrick-101696703224528.html","keywords":null,"creator":null,"video_url":null,"description":"India's compound archers won seven medals in Hangzhou, including all five gold medals on offer","content":"Jyothi Surekha Vennam and Ojas Deotale entered this Asian Games with contrasting goals. While Vennam, competing in her third Asian Games, was searching for her first success at this stage, Deotale, in his first Asian Games, was looking to add weight to his world champion tag. On a cold and wet Saturday morning at the Fuyang Yinhu Sports Centre, the two compound archers met their goals in style, ending the Hangzhou Asiad with three gold apiece as India won all five compound gold medals on offer. India's Jyothi Surekha Vennam competes against South Korea's So Chae-won in the archery compound women's individual gold medal match during the 2022 Asian Games in Hangzhou in China's eastern Zhejiang province(AFP) Veteran Abhishek Verma went down to Deotale in an all-India final to add a silver to India's tally while the 17-year-old world champion Aditi Swami bagged a bronze medal in the women's individual compound event. India thus ended their archery campaign with nine medals, seven of which came in the compound division. We're now on WhatsApp. Click to join. Vennam beat South Korea's Chaewon So 149-145 in the individual compound final to bag her third gold at Hangzhou. With wind conditions favourable after the last couple of tough days, Vennam shot with familiar calm and precision, missing the 10 only once in 15 shots to score 140 out of a possible 150. The Korean, barring a first perfect series, erred in every following sequence to finish with 145. Reflecting on her long wait for Asiad success, Vennam said, \"Waiting is always tough for everyone and it was the same for me. Now that the good times have come, I just want to live in this moment. We should not forget the past reflecting on it helps us attain greater highs.\" The 27-year-old multiple Worlds medallist was also part of the gold medal-winning women’s and mixed teams earlier this week. The secret of her success besides the obvious hard work, she said, lay in positive thinking. In fact, Vennam began the year thinking that this would be her stage to shine. \"I started to think more positively. I began the year thinking that this would be my year. I decided to focus more on the positives in life,\" she said. Meanwhile, Deotale capped his stunning maiden Asian Games by beating his mentor Abhishek Verma 149-147 in another display of sublime shooting. The reigning world champion had gone into the final calling it a \"fun match\", but never let his focus waver. Verma and Deotale shot a perfect first series of three shots each before the former hit a nine on the last shot of his next series. A nerveless Deotale took the opportunity to complete another perfect series and open a slender one-point lead. He built on that advantage with another perfect series even as Verma hit an eight as the gap rose to three points. Verma bowed out with two perfect series while Deotale nailed 10s on all but one chance, missing out on yet another perfect 150 but taking the gold. Earlier this week, Deotale had shot 150 twice in back-to-back matches to create a Games record. The 21-year-old had earlier partnered with Vennam for the compound mixed team gold and was also a part of the men’s team, alongside Abhishek Verma and Prathamesh Jawkar, who claimed gold. \"This was my first Asian Games and I have won gold medals in all three events. What more do I need? I feel like I am living in a dream,\" Deotale gushed after the win. On competing against Verma for gold, he said, \"I had told myself that this is going to be a friendly match between us. But there is still some pressure, no matter how many times we say it's a friendly match because there is a little pressure. It is a gold medal after all, but we knew that whatever happens, it will be for India.\" \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with Asian Games 2023 Live , India vs Afghanistan Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Shantanu Srivastava Shantanu Srivastava is an experienced sports journalist who has worked across print and digital media. He covers cricket and Olympic sports. ...view detail Topics Asian Games Subscribe to our best newsletters HT Daily Capsule Pick a topic of your interest and subscribe All Newsletters Subscribe Subscribed to newsletter successfully Thank you for subscribing to our Daily News Capsule newsletter.","pubDate":"2023-10-07 18:40:15","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/07/1600x900/ARCHERY-ASIAD-2022-2023-HANGZHOU-1_1696703908824_1696703946595.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f1e71763afb2897618ca036abe04aa33","title":"Kabaddi: India beat Iran in a controversial final","link":"https://www.hindustantimes.com/sports/others/kabaddi-india-beat-iran-in-a-controversial-final-101696703087892.html","keywords":null,"creator":null,"video_url":null,"description":"The match was suspended for almost 60 minutes due to a refereeing error before India won 33-29.","content":"A conventional kabaddi match lasts 45 minutes -- two halves of 20 minutes each interspersed by a five-minute break. On Saturday, the India-Iran men's kabaddi final lasted about 100 minutes, including a 60-minute break in a final of farcical proportions. Seven-time champions India had waited for five years to reclaim the men's kabaddi gold, and after being locked at 28-all with a minute to go, the desperation spilled onto the mat in Xiaoshan Guali Sports Centre on Saturday. India players argue with a referee on a disputed decision in the men's kabaddi gold medal match between India and Iran during the Hangzhou 2022 Asian Games in Hangzhou, in China's eastern Zhejiang province(AFP) Eventually, India won the match (33-29) and the gold they coveted, but it was a controversial affair. With Iran having emerged as a genuine threat to India's supremacy, the match was always going to be a tense affair and it lived up to the billing. The teams went toe-to-toe in regulation time and beyond, the chaotic flashpoint arriving with just 65 seconds remaining in the final. We're now on WhatsApp. Click to join. Drama began shortly after India captain Pawan Sehrawat stepped up for a raid. He tried to tag an opposing defender but was unable to do so and hence stepped out into the lobby with the Iranians in pursuit. The lobby, in kabaddi parlance, is a one-metre wide area between the outer edge of the mat to the inner line and is considered active only when contact has been made between the raider and a defender. Sehrawat was followed by at least three Iranians who entered the danger zone looking to tackle him down. One of the Iranians lost balance and stepped out of bounds at the back. That's where the confusion began. As per Rule No. 28 of the International Kabaddi Federation rulebook, \"If a defender or defenders who has/have touched the ground outside the boundary, hold a raider, the raider will be declared not out. The defender or defenders who have gone out of bounds only will be declared out.\" Simply put, unless a raider has touched a defender initiating a struggle, no defender can enter the lobby in pursuit. And if anyone does enter or touches the raider in the lobby, all defenders in the lobby with a touch on that raider will be declared out. However, as per new Pro Kabaddi League (PKL) rules that were introduced this season, if a raider steps out into the lobby without a touch, the raid immediately ends and the raider is declared out. No defender who follows the raider in the lobby can be declared out. The PKL rule effectively is the exact opposite of what the international rule states. In a bizarre turn of events, the referee followed the PKL rule and awarded a point each to both teams, something that India challenged. The Indian coaching staff and players sat on the mat disputing the decision and refused to play. The Indians asked for a video referral following which three points were awarded to India and one point to Iran. Now, the Iranians launched a protest. Skipper Fazel Atrachali came off the bench to lead his players out of the playing arena. The referees and judges again went for more replays and restored their decision of awarding a point each to both teams. Confusion continued as the Indians began another round of protests with coach Edicherry Bhaskaran asking his players to sit on the mat. The Indian team also threatened a walkout. With the situation getting completely out of control, the Asian Amateur Kabaddi Federation (AAKF) officials were summoned and they sought to award a point each to both teams. The Indians didn't take the offer and continued to protest. Next, the referees and judges awarded three points to India much to the Iranians' dismay. They reluctantly resumed the match which had, by then, been reduced to an absolute mess. The post-match press conference was called off but Iran coach Gholamreza Mazandarani made his feelings known in the mixed zone. “This is very bad for kabaddi. The officials made some terrible mistakes and decisions. All of (India’s) team, their coaches and managers were putting pressure on the referees to reverse the decision and they did exactly that,\" Mazandarani said. Bhaskaran returned the favour. “They were trying to influence the decision. As per the rulebook, the decision to award us three points was correct. But they want to manipulate that. It’s bad for the image of kabaddi,\" he said. Earlier, the women's team prevailed in a tough final against Chinese-Taipei 26-25 to claim its third gold in the Asian Games history. The Indians trailed their opponents by two points in the second half but came back strongly to secure the win. The win also marked the 100th medal for India at the Asian Games. \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with Asian Games 2023 Live , India vs Afghanistan Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Shantanu Srivastava Shantanu Srivastava is an experienced sports journalist who has worked across print and digital media. He covers cricket and Olympic sports. ...view detail Topics Asian Games Subscribe to our best newsletters HT Daily Capsule Pick a topic of your interest and subscribe All Newsletters Subscribe Subscribed to newsletter successfully Thank you for subscribing to our Daily News Capsule newsletter.","pubDate":"2023-10-07 18:38:20","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/07/1600x900/KABADDI-ASIAD-2022-2023-HANGZHOU-19_1696703153062_1696703187745.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"deb701674b53b7480ba1ada482532fef","title":"SA vs SL: ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ ਜਿੱਤ ਨਾਲ ਵਿਸ਼ਵ ਕੱਪ ਦੀ ਕੀਤੀ ਸ਼ੁਰੂਆਤ, ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ ਬੁਰੀ ਤਰ੍ਹਾਂ ਨਾਲ ਹਰਾਇਆ","link":"https://punjabi.abplive.com/sports/cricket/south-africa-starts-the-world-cup-with-a-win-defeats-sri-lanka-badly-750268","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"South Africa Vs Sri Lanka: ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕੀਤੀ। ਪਹਿਲੇ ਮੈਚ 'ਚ ਅਫਰੀਕਾ ਨੇ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ 102 ਦੌੜਾਂ ਨਾਲ ਹਰਾਇਆ ਸੀ। ਮੈਚ ਵਿੱਚ ਅਫਰੀਕਾ ਵੱਲੋਂ ਤਿੰਨ ਸੈਂਕੜੇ ਲੱਗੇ, ਜਿਸ ਵਿੱਚ ਏਡਨ ਮਾਰਕਰਮ ਨੇ ਇੱਕ ਰਿਕਾਰਡ ਬਣਾਇਆ ਅਤੇ 49 ਗੇਂਦਾਂ ਵਿੱਚ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਸਭ ਤੋਂ ਤੇਜ਼ ਸੈਂਕੜਾ ਬਣਾਇਆ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਕਵਿੰਟਨ ਡੀ ਕਾਕ ਅਤੇ ਰਾਸੀ ਵੈਨ ਡੇਰ ਡੁਸਨ ਨੇ ਵੀ ਸੈਂਕੜੇ ਵਾਲੀ ਪਾਰੀ ਖੇਡੀ। ਅਫਰੀਕਾ ਨੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਦੇ ਹੋਏ 50 ਓਵਰਾਂ ਵਿੱਚ ਕੁੱਲ 428/5 ਦੌੜਾਂ ਬਣਾਈਆਂ। ਜਿਸ ਦੇ ਜਵਾਬ 'ਚ ਸ਼੍ਰੀਲੰਕਾ 326 'ਤੇ ਆਲ ਆਊਟ ਹੋ ਗਈ। ਲੰਕਾ ਦੀ ਸ਼ੁਰੂਆਤ ਚੰਗੀ ਨਹੀਂ ਰਹੀ, ਮੈਂਡਿਸ ਨੇ ਉਮੀਦ ਜਗਾਈ ਵੱਡੇ ਟੀਚੇ ਦਾ ਪਿੱਛਾ ਕਰਨ ਉਤਰੀ ਸ਼੍ਰੀਲੰਕਾ ਨੇ ਦੂਜੇ ਓਵਰ ਵਿੱਚ ਹੀ ਪਹਿਲੀ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ। ਟੀਮ ਦੇ ਸਲਾਮੀ ਬੱਲੇਬਾਜ਼ ਪਥੁਮ ਨਿਸਾਂਕਾ ਬਿਨਾਂ ਖੇਡੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਲਈ ਟੀਮ ਦਾ ਸਕੋਰ ਵਧਿਆ ਅਤੇ 8ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੰਕਾ ਨੇ ਦੂਜਾ ਵਿਕਟ ਗਵਾ ਦਿੱਤਾ। ਇਸ ਵਾਰ ਕੁਸਲ ਪਰੇਰਾ 7 (15) ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਦੌਰਾਨ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਕੁਸਲ ਮੈਂਡਿਸ ਨੇ ਆਪਣੀ ਧਮਾਕੇਦਾਰ ਪਾਰੀ ਨਾਲ ਟੀਮ ਨੂੰ ਉਮੀਦ ਜਗਾਈ। ਪਰ ਮੈਂਡਿਸ ਵੀ 12ਵੇਂ ਓਵਰ ਦੀ ਚੌਥੀ ਗੇਂਦ 'ਤੇ ਆਊਟ ਹੋ ਗਿਆ। ਮੇਂਡਿਸ ਨੇ 42 ਗੇਂਦਾਂ 'ਤੇ 180.95 ਦੀ ਸਟ੍ਰਾਈਕ ਰੇਟ ਨਾਲ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ, ਜਿਸ 'ਚ ਉਸ ਨੇ 4 ਚੌਕੇ ਅਤੇ 8 ਛੱਕੇ ਲਗਾਏ। ਇਸ ਤਰ੍ਹਾਂ ਲੰਕਾ ਨੇ 109 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਤੀਜਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਬਾਅਦ ਯਾਨੀ 14ਵੇਂ ਓਵਰ 'ਚ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ ਚੌਥਾ ਝਟਕਾ ਲੱਗਾ। ਇਸ ਵਾਰ ਸਾਦਿਰਾ ਸਮਰਾਵਿਕਰਮਾ 23 ਦੌੜਾਂ ਬਣਾ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਈ। ਚਰਿਥ ਅਸਾਲੰਕਾ ਅਤੇ ਦਾਸੁਨ ਦੀ ਪਾਰੀ ਵਿਅਰਥ ਗਈ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਚਰਿਥ ਅਸਾਲੰਕਾ ਨੇ ਇਕ ਵਾਰ ਫਿਰ ਸ਼੍ਰੀਲੰਕਾਈ ਪ੍ਰਸ਼ੰਸਕਾਂ ਦੀਆਂ ਉਮੀਦਾਂ 'ਤੇ ਪਾਣੀ ਫੇਰ ਦਿੱਤਾ। ਉਸ ਨੇ 65 ਗੇਂਦਾਂ 'ਤੇ 8 ਚੌਕਿਆਂ ਅਤੇ 4 ਛੱਕਿਆਂ ਦੀ ਮਦਦ ਨਾਲ 79 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਹਾਲਾਂਕਿ ਇਸ ਦੌਰਾਨ ਸ਼੍ਰੀਲੰਕਾ ਨੇ 150 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਧਨੰਜੈ ਡੀ ਸਿਲਵਾ (11) ਦੇ ਰੂਪ 'ਚ 5ਵੀਂ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ ਸੀ। ਫਿਰ ਅਸਾਲੰਕਾ 32ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੁੰਗੀ ਨਗਿਡੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਗਈ। ਫਿਰ 33ਵੇਂ ਓਵਰ ਵਿੱਚ ਡੁਨਿਥ ਵੇਲਾਲਾਘੇ ਗੋਲਡ ਡਕ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ ਅਤੇ 40ਵੇਂ ਓਵਰ ਵਿੱਚ ਕਪਤਾਨ ਦਾਸੁਨ ਸ਼ਨਾਕਾ 68 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਤੋਂ ਬਾਅਦ 44ਵੇਂ ਓਵਰ ਵਿੱਚ ਕੁਸਨ ਰਜਿਥਾ ਨੇ ਆਪਣਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਰਜਿਥਾ 33 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਫਰੀਕੀ ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣੇ। ਫਿਰ ਅੰਤ ਵਿੱਚ ਕਾਗਿਸੋ ਰਬਾਡਾ ਨੇ ਮਤਿਸ਼ਾ ਪਥੀਰਾਨਾ ਨੂੰ ਬੋਲਡ ਕਰਕੇ ਮੈਚ ਦਾ ਅੰਤ ਕੀਤਾ। ਇਸ ਤਰ੍ਹਾਂ ਦੀ ਸੀ ਅਫਰੀਕਾ ਦੀ ਗੇਂਦਬਾਜ਼ੀ ਟੀਮ ਲਈ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਨੇ ਸਭ ਤੋਂ ਵੱਧ 3 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦਕਿ ਮਾਰਕੋ ਜੈਨਸ ਨੇ 10 ਓਵਰਾਂ 'ਚ 9.20 ਦੀ ਆਰਥਿਕਤਾ 'ਤੇ 92 ਦੌੜਾਂ ਦੇ ਕੇ 2 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਰਬਾਡਾ ਅਤੇ ਕੇਸ਼ਵ ਮਹਾਰਾਜ ਨੇ 2-2 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦੋਂ ਕਿ ਅੰਗੀਡੀ ਨੂੰ 1 ਸਫਲਤਾ ਮਿਲੀ।","content":"South Africa Vs Sri Lanka: ਦੱ ਖਣੀ ਅਫਰੀਕਾ ਨੇ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 2023 ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕੀਤੀ। ਪਹਿਲੇ ਮੈਚ 'ਚ ਅਫਰੀਕਾ ਨੇ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ 102 ਦੌੜਾਂ ਨਾਲ ਹਰਾਇਆ ਸੀ। ਮੈਚ ਵਿੱਚ ਅਫਰੀਕਾ ਵੱਲੋਂ ਤਿੰਨ ਸੈਂਕੜੇ ਲੱਗੇ, ਜਿਸ ਵਿੱਚ ਏਡਨ ਮਾਰਕਰਮ ਨੇ ਇੱਕ ਰਿਕਾਰਡ ਬਣਾਇਆ ਅਤੇ 49 ਗੇਂਦਾਂ ਵਿੱਚ ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਸਭ ਤੋਂ ਤੇਜ਼ ਸੈਂਕੜਾ ਬਣਾਇਆ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਕਵਿੰਟਨ ਡੀ ਕਾਕ ਅਤੇ ਰਾਸੀ ਵੈਨ ਡੇਰ ਡੁਸਨ ਨੇ ਵੀ ਸੈਂਕੜੇ ਵਾਲੀ ਪਾਰੀ ਖੇਡੀ। ਅਫਰੀਕਾ ਨੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਦੇ ਹੋਏ 50 ਓਵਰਾਂ ਵਿੱਚ ਕੁੱਲ 428/5 ਦੌੜਾਂ ਬਣਾਈਆਂ। ਜਿਸ ਦੇ ਜਵਾਬ 'ਚ ਸ਼੍ਰੀਲੰਕਾ 326 'ਤੇ ਆਲ ਆਊਟ ਹੋ ਗਈ। ਲੰਕਾ ਦੀ ਸ਼ੁਰੂਆਤ ਚੰਗੀ ਨਹੀਂ ਰਹੀ, ਮੈਂਡਿਸ ਨੇ ਉਮੀਦ ਜਗਾਈ ਵੱਡੇ ਟੀਚੇ ਦਾ ਪਿੱਛਾ ਕਰਨ ਉਤਰੀ ਸ਼੍ਰੀਲੰਕਾ ਨੇ ਦੂਜੇ ਓਵਰ ਵਿੱਚ ਹੀ ਪਹਿਲੀ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ। ਟੀਮ ਦੇ ਸਲਾਮੀ ਬੱਲੇਬਾਜ਼ ਪਥੁਮ ਨਿਸਾਂਕਾ ਬਿਨਾਂ ਖੇਡੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਲਈ ਟੀਮ ਦਾ ਸਕੋਰ ਵਧਿਆ ਅਤੇ 8ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੰਕਾ ਨੇ ਦੂਜਾ ਵਿਕਟ ਗਵਾ ਦਿੱਤਾ। ਇਸ ਵਾਰ ਕੁਸਲ ਪਰੇਰਾ 7 (15) ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਦੌਰਾਨ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਕੁਸਲ ਮੈਂਡਿਸ ਨੇ ਆਪਣੀ ਧਮਾਕੇਦਾਰ ਪਾਰੀ ਨਾਲ ਟੀਮ ਨੂੰ ਉਮੀਦ ਜਗਾਈ। ਪਰ ਮੈਂਡਿਸ ਵੀ 12ਵੇਂ ਓਵਰ ਦੀ ਚੌਥੀ ਗੇਂਦ 'ਤੇ ਆਊਟ ਹੋ ਗਿਆ। ਮੇਂਡਿਸ ਨੇ 42 ਗੇਂਦਾਂ 'ਤੇ 180.95 ਦੀ ਸਟ੍ਰਾਈਕ ਰੇਟ ਨਾਲ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ, ਜਿਸ 'ਚ ਉਸ ਨੇ 4 ਚੌਕੇ ਅਤੇ 8 ਛੱਕੇ ਲਗਾਏ। ਇਸ ਤਰ੍ਹਾਂ ਲੰਕਾ ਨੇ 109 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਤੀਜਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਫਿਰ ਕੁਝ ਸਮੇਂ ਬਾਅਦ ਯਾਨੀ 14ਵੇਂ ਓਵਰ 'ਚ ਸ਼੍ਰੀਲੰਕਾ ਨੂੰ ਚੌਥਾ ਝਟਕਾ ਲੱਗਾ। ਇਸ ਵਾਰ ਸਾਦਿਰਾ ਸਮਰਾਵਿਕਰਮਾ 23 ਦੌੜਾਂ ਬਣਾ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਈ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਚਰਿਥ ਅਸਾਲੰਕਾ ਅਤੇ ਦਾਸੁਨ ਦੀ ਪਾਰੀ ਵਿਅਰਥ ਗਈ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਆਏ ਚਰਿਥ ਅਸਾਲੰਕਾ ਨੇ ਇਕ ਵਾਰ ਫਿਰ ਸ਼੍ਰੀਲੰਕਾਈ ਪ੍ਰਸ਼ੰਸਕਾਂ ਦੀਆਂ ਉਮੀਦਾਂ 'ਤੇ ਪਾਣੀ ਫੇਰ ਦਿੱਤਾ। ਉਸ ਨੇ 65 ਗੇਂਦਾਂ 'ਤੇ 8 ਚੌਕਿਆਂ ਅਤੇ 4 ਛੱਕਿਆਂ ਦੀ ਮਦਦ ਨਾਲ 79 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਹਾਲਾਂਕਿ ਇਸ ਦੌਰਾਨ ਸ਼੍ਰੀਲੰਕਾ ਨੇ 150 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਧਨੰਜੈ ਡੀ ਸਿਲਵਾ (11) ਦੇ ਰੂਪ 'ਚ 5ਵੀਂ ਵਿਕਟ ਗਵਾ ਦਿੱਤੀ ਸੀ। ਫਿਰ ਅਸਾਲੰਕਾ 32ਵੇਂ ਓਵਰ ਦੀ ਆਖਰੀ ਗੇਂਦ 'ਤੇ ਲੁੰਗੀ ਨਗਿਡੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਗਈ। ਫਿਰ 33ਵੇਂ ਓਵਰ ਵਿੱਚ ਡੁਨਿਥ ਵੇਲਾਲਾਘੇ ਗੋਲਡ ਡਕ ਦਾ ਸ਼ਿਕਾਰ ਬਣ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ ਅਤੇ 40ਵੇਂ ਓਵਰ ਵਿੱਚ ਕਪਤਾਨ ਦਾਸੁਨ ਸ਼ਨਾਕਾ 68 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਊਟ ਹੋ ਗਏ। ਇਸ ਤੋਂ ਬਾਅਦ 44ਵੇਂ ਓਵਰ ਵਿੱਚ ਕੁਸਨ ਰਜਿਥਾ ਨੇ ਆਪਣਾ ਵਿਕਟ ਗੁਆ ਦਿੱਤਾ। ਰਜਿਥਾ 33 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਫਰੀਕੀ ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਦਾ ਸ਼ਿਕਾਰ ਬਣੇ। ਫਿਰ ਅੰਤ ਵਿੱਚ ਕਾਗਿਸੋ ਰਬਾਡਾ ਨੇ ਮਤਿਸ਼ਾ ਪਥੀਰਾਨਾ ਨੂੰ ਬੋਲਡ ਕਰਕੇ ਮੈਚ ਦਾ ਅੰਤ ਕੀਤਾ। ਇਸ ਤਰ੍ਹਾਂ ਦੀ ਸੀ ਅਫਰੀਕਾ ਦੀ ਗੇਂਦਬਾਜ਼ੀ ਟੀਮ ਲਈ ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ ਨੇ ਸਭ ਤੋਂ ਵੱਧ 3 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦਕਿ ਮਾਰਕੋ ਜੈਨਸ ਨੇ 10 ਓਵਰਾਂ 'ਚ 9.20 ਦੀ ਆਰਥਿਕਤਾ 'ਤੇ 92 ਦੌੜਾਂ ਦੇ ਕੇ 2 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਰਬਾਡਾ ਅਤੇ ਕੇਸ਼ਵ ਮਹਾਰਾਜ ਨੇ 2-2 ਵਿਕਟਾਂ ਲਈਆਂ। ਜਦੋਂ ਕਿ ਅੰਗੀਡੀ ਨੂੰ 1 ਸਫਲਤਾ ਮਿਲੀ।","pubDate":"2023-10-07 17:22:17","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/07/88c54e799c768139809c7a45c765ad381696699316733497_original.JPG","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"3d02948dd103099fc9763c963b320f2a","title":"IND vs AUS: ਆਸਟ੍ਰੇਲੀਆ ਖ਼ਿਲਾਫ਼ ਇਸ ਤਰ੍ਹਾਂ ਹੋ ਸਕਦੀ ਹੈ ਭਾਰਤ ਦੀ ਪਲੇਇੰਗ ਇਲੈਵਨ, ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਜਗ੍ਹਾ ਲੈ ਸਕਦੇ ਨੇ ਈਸ਼ਾਨ ਕਿਸ਼ਨ","link":"https://punjabi.abplive.com/sports/cricket/india-s-playing-eleven-could-be-like-this-against-australia-ishan-kishan-can-replace-shubman-gill-750267","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"India Playing 11 vs Australia World Cup 2023: ਭਾਰਤ ਅਤੇ ਆਸਟ੍ਰੇਲੀਆ ਵਿਚਾਲੇ 2023 ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਭਲਕੇ ਯਾਨੀ ਐਤਵਾਰ 8 ਅਕਤੂਬਰ ਨੂੰ ਮੁਕਾਬਲਾ ਹੋਵੇਗਾ। ਇਸ ਮੈਚ ਤੋਂ ਪਹਿਲਾਂ ਸਟਾਰ ਓਪਨਰ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਬੀਮਾਰੀ ਟੀਮ ਇੰਡੀਆ ਲਈ ਚਿੰਤਾ ਦਾ ਵਿਸ਼ਾ ਹੈ। ਕਈ ਮੀਡੀਆ ਰਿਪੋਰਟਾਂ ਵਿੱਚ ਦਾਅਵਾ ਕੀਤਾ ਗਿਆ ਹੈ ਕਿ ਗਿੱਲ ਵਿਸ਼ਵ ਕੱਪ ਦੇ ਸ਼ੁਰੂਆਤੀ ਮੈਚ ਨਹੀਂ ਖੇਡ ਸਕਣਗੇ। ਦਰਅਸਲ ਗਿੱਲ ਨੂੰ ਡੇਂਗੂ ਹੋ ਗਿਆ ਹੈ। ਭਾਰਤ ਅਤੇ ਆਸਟਰੇਲੀਆ ਵਿਚਾਲੇ ਮੈਚ ਚੇਨਈ ਦੇ ਐੱਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਇਹ ਮੈਚ ਦੁਪਹਿਰ 2 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਦਾ ਇਹ 2023 ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਪਹਿਲਾ ਮੈਚ ਹੈ। ਅਜਿਹੇ 'ਚ ਦੋਵੇਂ ਵਿਸ਼ਵ ਕੱਪ ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕਰਨਾ ਚਾਹੁਣਗੇ। ਇਹ ਖਿਡਾਰੀ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਕਰੇਗਾ ਓਪਨਿੰਗ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਗੈਰ-ਮੌਜੂਦਗੀ ਵਿੱਚ ਇਸ਼ਾਨ ਕਿਸ਼ਨ ਕਪਤਾਨ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਪਾਰੀ ਦੀ ਸ਼ੁਰੂਆਤ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਰਾਟ ਕੋਹਲੀ ਦਾ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਈਸ਼ਾਨ ਜਿਸ ਫਾਰਮ 'ਚ ਹਨ, ਉਸ ਨੂੰ ਦੇਖਦੇ ਹੋਏ ਕਿਹਾ ਜਾ ਸਕਦਾ ਹੈ ਕਿ ਟੀਮ ਇੰਡੀਆ ਗਿੱਲ ਦੀ ਕਮੀ ਨਹੀਂ ਛੱਡੇਗੀ। ਇਸ ਤਰ੍ਹਾਂ ਹੋਵੇਗਾ ਮਿਡਲ ਆਰਡਰ  ਸ਼੍ਰੇਅਸ ਅਈਅਰ ਚੌਥੇ ਨੰਬਰ 'ਤੇ ਖੇਡ ਸਕਦਾ ਹੈ। ਅਈਅਰ 2023 ਏਸ਼ੀਆ ਕੱਪ ਲਈ ਟੀਮ 'ਚ ਵਾਪਸੀ ਕਰ ਚੁੱਕੇ ਹਨ। ਉਹ ਚੰਗੀ ਫਾਰਮ 'ਚ ਨਜ਼ਰ ਆ ਰਿਹਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਕਟਕੀਪਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਦਾ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪੰਡਯਾ ਦਾ ਵੀ ਛੇਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਯਕੀਨੀ ਹੈ। ਤਿੰਨ ਸਪਿਨਰਾਂ ਦੇ ਨਾਲ ਉੱਤਰ ਸਕਦੀ ਹੈ ਟੀਮ ਇੰਡੀਆ  ਭਾਰਤ ਦਾ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਮੈਚ ਚੇਨਈ ਦੇ ਐਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਣਾ ਹੈ। ਇੱਥੋਂ ਦੀ ਪਿੱਚ ਸਪਿਨਰਾਂ ਲਈ ਢੁਕਵੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀਮ ਇੰਡੀਆ ਤਿੰਨ ਸਪਿਨਰਾਂ ਨਾਲ ਆਸਟ੍ਰੇਲੀਆ ਦੇ ਖਿਲਾਫ ਉਤਰ ਸਕਦੀ ਹੈ। ਇਸ ਦਾ ਮਤਲਬ ਹੈ ਕਿ ਕੁਲਦੀਪ ਯਾਦਵ, ਰਵਿੰਦਰ ਜਡੇਜਾ ਅਤੇ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਦੀ ਤਿਕੜੀ ਐਕਸ਼ਨ 'ਚ ਨਜ਼ਰ ਆ ਸਕਦੀ ਹੈ। ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ੀ ਦੀ ਜ਼ਿੰਮੇਵਾਰੀ ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ ਦੇ ਮੋਢਿਆਂ 'ਤੇ ਹੋਵੇਗੀ। ਆਸਟ੍ਰੇਲੀਆ ਵਿਰੁੱਧ ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ - ਰੋਹਿਤ ਸ਼ਰਮਾ (ਕਪਤਾਨ), ਈਸ਼ਾਨ ਕਿਸ਼ਨ, ਵਿਰਾਟ ਕੋਹਲੀ, ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਕੇਐਲ ਰਾਹੁਲ (ਵਿਕਟਕੀਪਰ), ਹਾਰਦਿਕ ਪੰਡਯਾ, ਰਵਿੰਦਰ ਜਡੇਜਾ, ਆਰ ਅਸ਼ਵਿਨ, ਕੁਲਦੀਪ ਯਾਦਵ, ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ।","content":"India Playing 11 vs Australia World Cup 2023: ਭਾਰਤ ਅਤੇ ਆਸਟ੍ਰੇਲੀਆ ਵਿਚਾਲੇ 2023 ਵਨਡੇ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਭਲਕੇ ਯਾਨੀ ਐਤਵਾਰ 8 ਅਕਤੂਬਰ ਨੂੰ ਮੁਕਾਬਲਾ ਹੋਵੇਗਾ। ਇਸ ਮੈਚ ਤੋਂ ਪਹਿਲਾਂ ਸਟਾਰ ਓਪਨਰ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਬੀਮਾਰੀ ਟੀਮ ਇੰਡੀਆ ਲਈ ਚਿੰਤਾ ਦਾ ਵਿਸ਼ਾ ਹੈ। ਕਈ ਮੀਡੀਆ ਰਿਪੋਰਟਾਂ ਵਿੱਚ ਦਾਅਵਾ ਕੀਤਾ ਗਿਆ ਹੈ ਕਿ ਗਿੱਲ ਵਿਸ਼ਵ ਕੱਪ ਦੇ ਸ਼ੁਰੂਆਤੀ ਮੈਚ ਨਹੀਂ ਖੇਡ ਸਕਣਗੇ। ਦਰਅਸਲ ਗਿੱਲ ਨੂੰ ਡੇਂਗੂ ਹੋ ਗਿਆ ਹੈ। ਭਾਰਤ ਅਤੇ ਆਸਟਰੇਲੀਆ ਵਿਚਾਲੇ ਮੈਚ ਚੇਨਈ ਦੇ ਐੱਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਇਹ ਮੈਚ ਦੁਪਹਿਰ 2 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਦਾ ਇਹ 2023 ਵਿਸ਼ਵ ਕੱਪ ਦਾ ਪਹਿਲਾ ਮੈਚ ਹੈ। ਅਜਿਹੇ 'ਚ ਦੋਵੇਂ ਵਿਸ਼ਵ ਕੱਪ ਦੀ ਸ਼ੁਰੂਆਤ ਜਿੱਤ ਨਾਲ ਕਰਨਾ ਚਾਹੁਣਗੇ। ਇਹ ਖਿਡਾਰੀ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਕਰੇਗਾ ਓਪਨਿੰਗ ਸ਼ੁਭਮਨ ਗਿੱਲ ਦੀ ਗੈਰ-ਮੌਜੂਦਗੀ ਵਿੱਚ ਇਸ਼ਾਨ ਕਿਸ਼ਨ ਕਪਤਾਨ ਰੋਹਿਤ ਸ਼ਰਮਾ ਨਾਲ ਪਾਰੀ ਦੀ ਸ਼ੁਰੂਆਤ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਰਾਟ ਕੋਹਲੀ ਦਾ ਤੀਜੇ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਈਸ਼ਾਨ ਜਿਸ ਫਾਰਮ 'ਚ ਹਨ, ਉਸ ਨੂੰ ਦੇਖਦੇ ਹੋਏ ਕਿਹਾ ਜਾ ਸਕਦਾ ਹੈ ਕਿ ਟੀਮ ਇੰਡੀਆ ਗਿੱਲ ਦੀ ਕਮੀ ਨਹੀਂ ਛੱਡੇਗੀ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਇਸ ਤਰ੍ਹਾਂ ਹੋਵੇਗਾ ਮਿਡਲ ਆਰਡਰ ਸ਼੍ਰੇਅਸ ਅਈਅਰ ਚੌਥੇ ਨੰਬਰ 'ਤੇ ਖੇਡ ਸਕਦਾ ਹੈ। ਅਈਅਰ 2023 ਏਸ਼ੀਆ ਕੱਪ ਲਈ ਟੀਮ 'ਚ ਵਾਪਸੀ ਕਰ ਚੁੱਕੇ ਹਨ। ਉਹ ਚੰਗੀ ਫਾਰਮ 'ਚ ਨਜ਼ਰ ਆ ਰਿਹਾ ਹੈ। ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਕਟਕੀਪਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਦਾ ਪੰਜਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਤੈਅ ਹੈ। ਸਟਾਰ ਆਲਰਾਊਂਡਰ ਹਾਰਦਿਕ ਪੰਡਯਾ ਦਾ ਵੀ ਛੇਵੇਂ ਨੰਬਰ 'ਤੇ ਖੇਡਣਾ ਯਕੀਨੀ ਹੈ। ਤਿੰਨ ਸਪਿਨਰਾਂ ਦੇ ਨਾਲ ਉੱਤਰ ਸਕਦੀ ਹੈ ਟੀਮ ਇੰਡੀਆ ਭਾਰਤ ਦਾ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਮੈਚ ਚੇਨਈ ਦੇ ਐਮਏ ਚਿਦੰਬਰਮ ਸਟੇਡੀਅਮ 'ਚ ਖੇਡਿਆ ਜਾਣਾ ਹੈ। ਇੱਥੋਂ ਦੀ ਪਿੱਚ ਸਪਿਨਰਾਂ ਲਈ ਢੁਕਵੀਂ ਹੈ। ਅਜਿਹੇ 'ਚ ਟੀਮ ਇੰਡੀਆ ਤਿੰਨ ਸਪਿਨਰਾਂ ਨਾਲ ਆਸਟ੍ਰੇਲੀਆ ਦੇ ਖਿਲਾਫ ਉਤਰ ਸਕਦੀ ਹੈ। ਇਸ ਦਾ ਮਤਲਬ ਹੈ ਕਿ ਕੁਲਦੀਪ ਯਾਦਵ, ਰਵਿੰਦਰ ਜਡੇਜਾ ਅਤੇ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਦੀ ਤਿਕੜੀ ਐਕਸ਼ਨ 'ਚ ਨਜ਼ਰ ਆ ਸਕਦੀ ਹੈ। ਤੇਜ਼ ਗੇਂਦਬਾਜ਼ੀ ਦੀ ਜ਼ਿੰਮੇਵਾਰੀ ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ ਦੇ ਮੋਢਿਆਂ 'ਤੇ ਹੋਵੇਗੀ। ਆਸਟ੍ਰੇਲੀਆ ਵਿਰੁੱਧ ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ - ਰੋਹਿਤ ਸ਼ਰਮਾ (ਕਪਤਾਨ), ਈਸ਼ਾਨ ਕਿਸ਼ਨ, ਵਿਰਾਟ ਕੋਹਲੀ , ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਕੇਐਲ ਰਾਹੁਲ (ਵਿਕਟਕੀਪਰ), ਹਾਰਦਿਕ ਪੰਡਯਾ , ਰਵਿੰਦਰ ਜਡੇਜਾ, ਆਰ ਅਸ਼ਵਿਨ, ਕੁਲਦੀਪ ਯਾਦਵ, ਜਸਪ੍ਰੀਤ ਬੁਮਰਾਹ ਅਤੇ ਮੁਹੰਮਦ ਸਿਰਾਜ।","pubDate":"2023-10-07 17:17:32","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/07/ac395fe7509dc42379a0419cbaf2827b1696699035411497_original.JPG","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"7debdaef82eff900d62a79f846564469","title":"Markram hits fastest World Cup century in SA win","link":"https://www.bbc.co.uk/sport/cricket/67038427","keywords":null,"creator":null,"video_url":null,"description":"Aiden Markram hits the fastest World Cup hundred as South Africa made 428-5 - the highest score in the tournament's history - in a 102-run victory over Sri Lanka.","content":null,"pubDate":"2023-10-07 17:14:31","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"17e9d5bb7d77059c91f4b10256566b67","title":"World Cup: South Africa thrash Sri Lanka by 102 runs after tons by Markram, de Kock, van der Dussen","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/07/world-cup-south-africa-thrash-sri-lanka-by-102-runs-after-tons-by-markram-de-kock-van-der-dussen-2621793.html","keywords":null,"creator":null,"video_url":null,"description":"The contest ended with the distinction of featuring the most runs scored in a World Cup game -- 754 NEW DELHI: A rampant South Africa crushed Sri Lanka by 102 runs here on Saturday to begin their World Cup campaign with a huge win, after setting the record for the highest total by any team in the history of the competition. Aiden Markram (106 off 54 balls) smashed a century off 49 balls to create the record of fastest ton in World Cups, while Quinton de Kock (100) and Rassie van der Dussen (108) crossed triple figures, as the Proteas made 428/5. In reply, Kusal Mendis dazzled at the top with a rapid 76, Charith Asalanka top scored with 79 in the middle-order and Dasun Shanaka found form to hit 68. But the target was way beyond Sri Lanka, who did well to make 326 in 44.5 overs, keeping South Africa on the park for as long as they could. In fact, the contest ended with the distinction of featuring the most runs scored in a World Cup game -- 754 runs were scored here at the Arun Jaitley Stadium. After Marco Jansen (2/92) cleaned up Pathum Nissanka (0) in the second over, Mendis unleashed a flurry of spectacular sixes on both sides of the wicket to provide Sri Lanka with the early impetus. With South African pacers spraying their deliveries on his pads, Mendis dispatched each of them far into the stands to raise a 25-ball fifty. The senior Sri Lanka batter seemed to be waging a lone battle as Kusal Perera (7) and Sadeera Samarawickrama (23) failed to match their partner in his endeavour. In the absence of any support from the other end, Mendis fell after a 42-ball blitz that saw him hit eight sixes and four boundaries for his 76 runs. ALSO READ | Markram stars as record-setting South Africa blitz Sri Lanka He tried cutting a delivery from Kagiso Rabada (2/50) too close to the body and was caught behind. Samarawickrama followed Mendis soon, chipping one towards midwicket with Jansen moving quickly in front to take a clean catch, off Gerald Coetzee (3/68). Asalanka also took a bit of time to settle in, but to his credit, recovered well to hit four sixes and eight fours to make 79 off 65 balls, as by then, it had become abundantly clear that Sri Lanka were only looking to reduce the margin of defeat. While Dhananjaya de Silva perished for 11, Sri Lanka captain Dasun Shanaka failed to get a move on for a large part of his innings. But Shanaka too hit his straps, smoking a six and five fours on the trot off Coetzee to bring up his fifty. Shanaka's innings ended when Keshav Maharaj (2/62) cleaned him up for 68 off 62 balls (6x4s, 3x6s). Towards the end, Kasun Rajitha swung his bat to a good effect, getting 33 from 31 balls (4x4s, 1x6s). In the first half, de Kock (100 off 84 balls; 12x4s, 3x6s), Van der Dussen (108 off 110 balls; 13x4s, 2x6s) and Markram (106 off 54 balls; 14x4s, 3x6s) powered South Africa past the highest World Cup total ever, held by Australia, who had made 417/7 against Afghanistan in the 2015 edition. After De Kock and Van der Dussen set the platform for a massive score with their second-wicket stand of 204 runs, Markram pulverised Sri Lanka. All three South African centurions -- De Kock, Van der Dussen and Markram -- also recorded their maiden World Cup hundreds. A total of 39 fours and eight sixes came collectively from the Proteas trio. Heinrich Klaasen hit another three fours and a six for his 20-ball 32 and David Miller clobbered three fours and two sixes for his unbeaten 21-ball 39. Making the most of a favourable pitch against a depleted and erring Sri Lankan bowling line-up, South African batters motored on at a high scoring rate in the middle-overs to wrest control. An early blow was dealt when Dilshan Madushanka pinned Temba Bavuma (8) in front of the wicket, but that was the only moment of joy for the Sri Lankans. De Kock and Van der Dussen, who came together a mere 10 balls into the contest, were separated only after putting their team in a commanding position with the fourth highest-ever partnership for any wicket for South Africa in the World Cup. De Kock, set to retire from ODIs after the tournament, was in his elements in getting a hundred. On the other hand, Van der Dussen celebrated his 50th ODI with a fifth ton of his career, cracking 13 fours and two sixes in the process. Markram began with two cracking straight drives for four off Madushanka and brought out every conventional stroke in his book to break the record set by Ireland's Kevin O'Brien (50 balls for 100) in 2011.","content":"NEW DELHI: A rampant South Africa crushed Sri Lanka by 102 runs here on Saturday to begin their World Cup campaign with a huge win, after setting the record for the highest total by any team in the history of the competition. Aiden Markram (106 off 54 balls) smashed a century off 49 balls to create the record of fastest ton in World Cups, while Quinton de Kock (100) and Rassie van der Dussen (108) crossed triple figures, as the Proteas made 428/5. In reply, Kusal Mendis dazzled at the top with a rapid 76, Charith Asalanka top scored with 79 in the middle-order and Dasun Shanaka found form to hit 68. But the target was way beyond Sri Lanka, who did well to make 326 in 44.5 overs, keeping South Africa on the park for as long as they could. In fact, the contest ended with the distinction of featuring the most runs scored in a World Cup game -- 754 runs were scored here at the Arun Jaitley Stadium. After Marco Jansen (2/92) cleaned up Pathum Nissanka (0) in the second over, Mendis unleashed a flurry of spectacular sixes on both sides of the wicket to provide Sri Lanka with the early impetus. With South African pacers spraying their deliveries on his pads, Mendis dispatched each of them far into the stands to raise a 25-ball fifty. The senior Sri Lanka batter seemed to be waging a lone battle as Kusal Perera (7) and Sadeera Samarawickrama (23) failed to match their partner in his endeavour. In the absence of any support from the other end, Mendis fell after a 42-ball blitz that saw him hit eight sixes and four boundaries for his 76 runs. He tried cutting a delivery from Kagiso Rabada (2/50) too close to the body and was caught behind. Samarawickrama followed Mendis soon, chipping one towards midwicket with Jansen moving quickly in front to take a clean catch, off Gerald Coetzee (3/68). Asalanka also took a bit of time to settle in, but to his credit, recovered well to hit four sixes and eight fours to make 79 off 65 balls, as by then, it had become abundantly clear that Sri Lanka were only looking to reduce the margin of defeat. While Dhananjaya de Silva perished for 11, Sri Lanka captain Dasun Shanaka failed to get a move on for a large part of his innings. But Shanaka too hit his straps, smoking a six and five fours on the trot off Coetzee to bring up his fifty. Shanaka's innings ended when Keshav Maharaj (2/62) cleaned him up for 68 off 62 balls (6x4s, 3x6s). Towards the end, Kasun Rajitha swung his bat to a good effect, getting 33 from 31 balls (4x4s, 1x6s). In the first half, de Kock (100 off 84 balls; 12x4s, 3x6s), Van der Dussen (108 off 110 balls; 13x4s, 2x6s) and Markram (106 off 54 balls; 14x4s, 3x6s) powered South Africa past the highest World Cup total ever, held by Australia, who had made 417/7 against Afghanistan in the 2015 edition. After De Kock and Van der Dussen set the platform for a massive score with their second-wicket stand of 204 runs, Markram pulverised Sri Lanka. All three South African centurions -- De Kock, Van der Dussen and Markram -- also recorded their maiden World Cup hundreds. A total of 39 fours and eight sixes came collectively from the Proteas trio. Heinrich Klaasen hit another three fours and a six for his 20-ball 32 and David Miller clobbered three fours and two sixes for his unbeaten 21-ball 39. Making the most of a favourable pitch against a depleted and erring Sri Lankan bowling line-up, South African batters motored on at a high scoring rate in the middle-overs to wrest control. An early blow was dealt when Dilshan Madushanka pinned Temba Bavuma (8) in front of the wicket, but that was the only moment of joy for the Sri Lankans. De Kock and Van der Dussen, who came together a mere 10 balls into the contest, were separated only after putting their team in a commanding position with the fourth highest-ever partnership for any wicket for South Africa in the World Cup. De Kock, set to retire from ODIs after the tournament, was in his elements in getting a hundred. On the other hand, Van der Dussen celebrated his 50th ODI with a fifth ton of his career, cracking 13 fours and two sixes in the process. Markram began with two cracking straight drives for four off Madushanka and brought out every conventional stroke in his book to break the record set by Ireland's Kevin O'Brien (50 balls for 100) in 2011.","pubDate":"2023-10-07 17:10:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0708666141aca96f7f6fdb9f87cdc7a7","title":"Liam Livingstone: England can rediscover their power-hitting mojo in Dharamshala","link":"https://www.echo-news.co.uk/sport/national/23841020.liam-livingstone-england-can-rediscover-power-hitting-mojo-dharamshala/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The altitude provides a boost for big-hitting batters at the picturesque HPCA Stadium.","content":"The reigning champions had a stuttering start to their title defence, thrashed by nine wickets after a timid performance in the curtain-raiser against New Zealand, and will be eyeing a much-improved performance against Bangladesh on Tuesday. The game takes place at the picturesque HPCA Stadium, framed against the backdrop of the Dhauladhar mountain range and sitting 1,500 metres above sea level. The altitude provides a boost for big-hitting batters, with the ball travelling further in the thinner air, and Livingstone had a chance to test the theory in the IPL earlier this year. He smashed 94 in just 48 balls for Punjab Kings, launching nine sixes along the way. And, after labouring to an under-par 282 against the Black Caps in their opener, there could not be a better venue for England to rediscover their power-hitting mojo. “It’s an incredible ground and an incredible place to bat if it’s anything like it was that day,” said Livingstone. “Conditions here should suit us and the boys are really excited. We want to get over what happened the other day and almost go twice as hard. We want to put on a really good show and get things kickstarted in this tournament. “Because of the altitude the ball just flies really well here. You can feel it, it makes you more confident to take on the boundaries. “They aren’t that big anyway and the altitude just makes it better with the power we’ve got in our line-up. It certainly helps as a batter, standing there knowing you can take the fielders on. “It’s the kind of place you can really set up the back end of the innings and score highly. Personally, I’ve got good memories here and hopefully I can repeat it.” Despite the remote nature of Dharamshala, an area better known for its proximity to the Dalai Lama’s residence just 10km away in McLeod Ganj, Livingstone is not the only squad member to have played here. Sam Curran and Jos Buttler have also passed through on IPL duty, while Buttler, Joe Root and Chris Woakes all played in England’s first ever international at the venue in 2013. England beat India on that occasion, taking seven wickets with fast bowlers, and they are likely to be tempted by an extra seamer this time. Left-armer Reece Topley was unlucky to miss out against New Zealand and heads the queue to come in, while Gus Atkinson and David Willey also stand by with Moeen Ali’s spot vulnerable. “It’s a good pitch, with good pace and carry and it can nip around,” Livingstone said. “It’s probably as English a pitch as there is out here and will probably suit us more than many grounds around the country. Hopefully that can play in our favour.” The one change England would most like to make, bringing Ben Stokes back in to bolster their middle order, is unlikely to happen as he continues to struggle with a hip problem. Without him the onus will fall on others to fashion a fitting response to their loss in Ahmedabad and Livingstone insists they are ready to oblige. He was part of the team that lost to Ireland in the group stages of last year’s T20 World Cup and went on to lift the trophy and is unfazed a single setback. “There’s no point looking back and regretting. We could have lost by one run or the way we did, either way, we move on,” he said. “One game doesn’t define a tournament and if you’re going to lose a game like that you’d probably rather it was the first one. “You can lose games and win a World Cup, we’ve shown that before. The one thing this group does well when we’ve lost a game of cricket is double down on our aggressive approach and we’ve got a chance to do that on Tuesday.”","pubDate":"2023-10-07 17:10:00","image_url":"https://www.echo-news.co.uk/resources/images/17308242/?type=app&htype=0","source_id":"echo_uk","source_priority":159993,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8691eda935ba4cf1ece325b324af0510","title":"Liam Livingstone: England can rediscover their power-hitting mojo in Dharamshala","link":"https://www.northwalespioneer.co.uk/sport/national/23841020.liam-livingstone-england-can-rediscover-power-hitting-mojo-dharamshala/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The altitude provides a boost for big-hitting batters at the picturesque HPCA Stadium.","content":"Liam Livingstone unleashed a six-hitting spree the last time he visited the Himalayan city of Dharamshala and believes it could be the perfect place for England to put their World Cup campaign back on track. The reigning champions had a stuttering start to their title defence, thrashed by nine wickets after a timid performance in the curtain-raiser against New Zealand, and will be eyeing a much-improved performance against Bangladesh on Tuesday. The game takes place at the picturesque HPCA Stadium, framed against the backdrop of the Dhauladhar mountain range and sitting 1,500 metres above sea level. The altitude provides a boost for big-hitting batters, with the ball travelling further in the thinner air, and Livingstone had a chance to test the theory in the IPL earlier this year. He smashed 94 in just 48 balls for Punjab Kings, launching nine sixes along the way. And, after labouring to an under-par 282 against the Black Caps in their opener, there could not be a better venue for England to rediscover their power-hitting mojo. “It’s an incredible ground and an incredible place to bat if it’s anything like it was that day,” said Livingstone. “Conditions here should suit us and the boys are really excited. We want to get over what happened the other day and almost go twice as hard. We want to put on a really good show and get things kickstarted in this tournament. “Because of the altitude the ball just flies really well here. You can feel it, it makes you more confident to take on the boundaries. “They aren’t that big anyway and the altitude just makes it better with the power we’ve got in our line-up. It certainly helps as a batter, standing there knowing you can take the fielders on. “It’s the kind of place you can really set up the back end of the innings and score highly. Personally, I’ve got good memories here and hopefully I can repeat it.” Despite the remote nature of Dharamshala, an area better known for its proximity to the Dalai Lama’s residence just 10km away in McLeod Ganj, Livingstone is not the only squad member to have played here. Sam Curran and Jos Buttler have also passed through on IPL duty, while Buttler, Joe Root and Chris Woakes all played in England’s first ever international at the venue in 2013. England beat India on that occasion, taking seven wickets with fast bowlers, and they are likely to be tempted by an extra seamer this time. Left-armer Reece Topley was unlucky to miss out against New Zealand and heads the queue to come in, while Gus Atkinson and David Willey also stand by with Moeen Ali’s spot vulnerable. “It’s a good pitch, with good pace and carry and it can nip around,” Livingstone said. “It’s probably as English a pitch as there is out here and will probably suit us more than many grounds around the country. Hopefully that can play in our favour.” The one change England would most like to make, bringing Ben Stokes back in to bolster their middle order, is unlikely to happen as he continues to struggle with a hip problem. Without him the onus will fall on others to fashion a fitting response to their loss in Ahmedabad and Livingstone insists they are ready to oblige. He was part of the team that lost to Ireland in the group stages of last year’s T20 World Cup and went on to lift the trophy and is unfazed a single setback. “There’s no point looking back and regretting. We could have lost by one run or the way we did, either way, we move on,” he said. “One game doesn’t define a tournament and if you’re going to lose a game like that you’d probably rather it was the first one. “You can lose games and win a World Cup, we’ve shown that before. The one thing this group does well when we’ve lost a game of cricket is double down on our aggressive approach and we’ve got a chance to do that on Tuesday.”","pubDate":"2023-10-07 17:10:00","image_url":"https://www.northwalespioneer.co.uk/resources/images/17308242/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3cb70cece59306994f8493b5e9098565","title":"Liam Livingstone: England can rediscover their power-hitting mojo in Dharamshala","link":"https://www.southwalesguardian.co.uk/sport/national/23841020.liam-livingstone-england-can-rediscover-power-hitting-mojo-dharamshala/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The altitude provides a boost for big-hitting batters at the picturesque HPCA Stadium.","content":"Liam Livingstone unleashed a six-hitting spree the last time he visited the Himalayan city of Dharamshala and believes it could be the perfect place for England to put their World Cup campaign back on track. The reigning champions had a stuttering start to their title defence, thrashed by nine wickets after a timid performance in the curtain-raiser against New Zealand, and will be eyeing a much-improved performance against Bangladesh on Tuesday. The game takes place at the picturesque HPCA Stadium, framed against the backdrop of the Dhauladhar mountain range and sitting 1,500 metres above sea level. The altitude provides a boost for big-hitting batters, with the ball travelling further in the thinner air, and Livingstone had a chance to test the theory in the IPL earlier this year. He smashed 94 in just 48 balls for Punjab Kings, launching nine sixes along the way. And, after labouring to an under-par 282 against the Black Caps in their opener, there could not be a better venue for England to rediscover their power-hitting mojo. “It’s an incredible ground and an incredible place to bat if it’s anything like it was that day,” said Livingstone. “Conditions here should suit us and the boys are really excited. We want to get over what happened the other day and almost go twice as hard. We want to put on a really good show and get things kickstarted in this tournament. “Because of the altitude the ball just flies really well here. You can feel it, it makes you more confident to take on the boundaries. “They aren’t that big anyway and the altitude just makes it better with the power we’ve got in our line-up. It certainly helps as a batter, standing there knowing you can take the fielders on. “It’s the kind of place you can really set up the back end of the innings and score highly. Personally, I’ve got good memories here and hopefully I can repeat it.” Despite the remote nature of Dharamshala, an area better known for its proximity to the Dalai Lama’s residence just 10km away in McLeod Ganj, Livingstone is not the only squad member to have played here. Sam Curran and Jos Buttler have also passed through on IPL duty, while Buttler, Joe Root and Chris Woakes all played in England’s first ever international at the venue in 2013. England beat India on that occasion, taking seven wickets with fast bowlers, and they are likely to be tempted by an extra seamer this time. Left-armer Reece Topley was unlucky to miss out against New Zealand and heads the queue to come in, while Gus Atkinson and David Willey also stand by with Moeen Ali’s spot vulnerable. “It’s a good pitch, with good pace and carry and it can nip around,” Livingstone said. “It’s probably as English a pitch as there is out here and will probably suit us more than many grounds around the country. Hopefully that can play in our favour.” The one change England would most like to make, bringing Ben Stokes back in to bolster their middle order, is unlikely to happen as he continues to struggle with a hip problem. Without him the onus will fall on others to fashion a fitting response to their loss in Ahmedabad and Livingstone insists they are ready to oblige. He was part of the team that lost to Ireland in the group stages of last year’s T20 World Cup and went on to lift the trophy and is unfazed a single setback. “There’s no point looking back and regretting. We could have lost by one run or the way we did, either way, we move on,” he said. “One game doesn’t define a tournament and if you’re going to lose a game like that you’d probably rather it was the first one. “You can lose games and win a World Cup, we’ve shown that before. The one thing this group does well when we’ve lost a game of cricket is double down on our aggressive approach and we’ve got a chance to do that on Tuesday.”","pubDate":"2023-10-07 17:10:00","image_url":"https://www.southwalesguardian.co.uk/resources/images/17308242/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"}]}