{"newsArray":[{"title":"Rohail to lead Pakistan Shaheens in Darwin series","link":"https://www.thenews.com.pk/print/1092530-rohail-to-lead-pakistan-shaheens-in-darwin-series","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: The Pakistan Cricket Board has appointed wicketkeeper-batter Rohail Nazir as the Pakistan Shaheens captain for the Top End T20 Series in Darwin, Australia, which is being organised by Northern Territory Cricket from 30 July to 6 August.Apart from the NTC side, NT Strike, and Pakistan...","content":"LAHORE: The Pakistan Cricket Board (PCB) has appointed wicketkeeper-batter Rohail Nazir as the Pakistan Shaheens captain for the Top End T20 Series in Darwin, Australia, which is being organised by Northern Territory Cricket (NTC) from 30 July to 6 August. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } } min-width: 336px; min-height: 280px; */ Apart from the NTC side, NT Strike, and Pakistan Shaheens, Australian Capitol Territory’s ACT Comets, Melbourne Stars, Melbourne Renegades and Papua New Guinea (PNG) will participate in the six-team tournament in a T20 format with the top-two sides progressing to the final. Afterwards, Shaheens will also play two 50-over matches against PNG and NT Strike on 8 and 9 August, respectively. The Darwin tour is part of the PCB’s policy to create opportunities for the emerging cricketers to play away cricket in different conditions against different oppositions across all formats. Rohail has played 33 first-class matches and has previously captained Pakistan Shaheens. He recently toured Zimbabwe where the Shaheens played two four-dayers and six 50-over matches in May. Pakistan Shaheens squad: Rohail Nazir (captain), Aaliyan Mahmood, Ali Asfand, Amir Hassan, Arafat Minhas, Azan Awais, Basit Ali, Faisal Akram, Mohammad Imran, Sajjad Ali, Mohammad Irfan Khan, Shamyl Hussain, Shawaiz Irfan, Syed Zeeshan Zameer and Wahaj Riaz.","pubDate":"2023-07-21 01:00:00","image_url":null,"source_id":"thenews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Slow progress in restoration of departmental teams","link":"https://www.thenews.com.pk/print/1092525-slow-progress-in-restoration-of-departmental-teams","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Only about a month is left before the domestic cricket season starts, but not a single departmental team has been announced officially so far.Pakistan PM Shehbaz Sharif, who is also patron in chief of PCB, lifted the ban on departmental sports last year. Pakistan first class cricket...","content":"KARACHI: Only about a month is left before the domestic cricket season starts, but not a single departmental team has been announced officially so far. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } } min-width: 336px; min-height: 280px; */ Pakistan PM Shehbaz Sharif, who is also patron in chief of PCB, lifted the ban on departmental sports last year. Pakistan first class cricket season starts in September. Eight departmental cricket teams will participate in the Quaid-e-Azam Trophy this year. Departmental teams which were abolished in 2019 and are to participate in domestic cricket after a gap of two years have not announced the establishment of their teams so far. Sources connected to the development of restoration of departmental cricket teams said that verbal agreement between the players and management of different departments have been completed but letters have not been issued so far. Sources said that one of the main reasons in the delay of the restoration of departmental cricket teams is the lack of approval of sports budget by the own departments. They said that contract letters and appointment letters would be issued in August, sources said. Sources explained that the sports budget of the departments is finalised and approved one to two months after the federal government budget. \"That's why there is delay in the establishment of cricket teams but all preparations have been completed,\" said a source. Sources said in August a number of departments would announce their cricket teams and officials. Sources further said that the change in the PCB’s hierarchy earlier this month and country’s political and economical circumstances are also the reason of sluggish pace in the restoration of departmental sports teams. But the departments sports officials are seriously working on this matter and holding talks with cricketers. A numbers of leading cricketers and emerging cricketers have been informally hired and details in this regard would emerge next month, sources said. Meanwhile, it was learnt that seven departmental teams have confirmed their participation in the Quaid-e-Azam Trophy.","pubDate":"2023-07-21 01:00:00","image_url":null,"source_id":"thenews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IND Vs WI Test: கோலி அபாரம்..ரோகித், ஜெய்ஷ்வால் அசத்தல்..மேற்கிந்திய தீவுகளுக்கு எதிரான டெஸ்டில் 288 ரன்கள் குவிப்பு","link":"https://tamil.abplive.com/sports/cricket/ind-vs-wi-2nd-test-india-in-control-with-kohli-rohit-jaiswal-s-fifties-on-day-1-ends-with-288-runs-130142","keywords":["கிரிக்கெட்"],"creator":["குலசேகரன் முனிரத்தினம்"],"video_url":null,"description":"மேற்கிந்திய தீவுகள் அணிக்கு எதிரான இரண்டாவது டெஸ்ட் போட்டியின் முதல் நாளில்,  இந்திய அணி 288 ரன்களை குவித்துள்ளது.  இந்திய அணி பேட்டிங்: போர்ட் ஆஃப் ஸ்பெயினில் நடைபெறும் போட்டியில் டாஸ் வென்ற மேற்கிந்திய தீவுகள் அணி, முதலில் பந்துவீச்சை தேர்வு செய்தது. இதையடுத்து களமிறங்கிய இந்திய அணியின் தொடக்க வீரர்களான கேப்டன் ரோகித் சர்மா மற்றும் ஜெய்ஷ்வால் ஆகியோர் அணிக்கு நல்ல தொடக்கம் அளித்தனர். ரோகித் சர்மா  அரைசதம் கடக்க, சக வீரரான ஜெய்ஷ்வாலும் அரைசதம் விளாசினார். இந்த கூட்டணி முதல் விக்கெட்டிற்கு 139 ரன்களை குவித்து இருந்தபோது, 57 ரன்கள் சேர்த்து இருந்த ஜெய்ஷ்வால் ஆட்டமிழந்தார். அவரை தொடர்ந்து வந்த சுப்மன் கில் வெறும் 10 ரன்களில் நடையை கட்டினார். பொறுப்புடன் விளையாடி வந்த ரோகித் சர்மா சதம் விளாசுவார் என எதிர்பார்க்கப்பட்டது. ஆனால், 80 ரன்கள் குவித்து இருந்தபோது அவர் வாரிகன் பந்துவீச்சில் ஆட்டமிழந்தார்.  கோலி அபாரம்: அவரை தொடர்ந்து ராகானேவும் 8 ரன்களில் பெவிலியன் திரும்பினார். இதனால் 182 ரன்களை சேர்ப்பதற்குள் 4 விக்கெட்டுகளை இழந்து இந்திய அணி திணறியது. இதையடுத்து, 5வது விக்கெட்டிற்கு ஜோடி சேர்ந்த கோலி மற்றும் ஜடேஜா பொறுப்புடன் விளையாடி ரன் சேர்த்து அணியை சரிவில் இருந்து மீட்டனர். கோலி அரைசதம் கடந்து அசத்தினார். இதனால், இந்திய அணி முதல் நாள் முடிவில் 4 விக்கெட்டுகளை இழந்து 288 ரன்களை சேர்த்துள்ளது. கோலி 87 ரன்களுடனும், ஜடேஜா 36 ரன்களுடன் களத்தில் உள்ளனர். மேற்கிந்திய தீவுகள் அணி சார்பில் கெமார் ரோச், கேப்ரியல், வாரிகன் மற்றும் ஹோல்டர் ஆகியோர் தலா ஒரு விக்கெட்டை வீழ்த்தினர்.","content":"மேற்கிந்திய தீவுகள் அணிக்கு எதிரான இரண்டாவது டெஸ்ட் போட்டியின் முதல் நாளில், இந்திய அணி 288 ரன்களை குவித்துள்ளது. இந்திய அணி பேட்டிங்: போர்ட் ஆஃப் ஸ்பெயினில் நடைபெறும் போட்டியில் டாஸ் வென்ற மேற்கிந்திய தீவுகள் அணி, முதலில் பந்துவீச்சை தேர்வு செய்தது. இதையடுத்து களமிறங்கிய இந்திய அணியின் தொடக்க வீரர்களான கேப்டன் ரோகித் சர்மா மற்றும் ஜெய்ஷ்வால் ஆகியோர் அணிக்கு நல்ல தொடக்கம் அளித்தனர். ரோகித் சர்மா அரைசதம் கடக்க, சக வீரரான ஜெய்ஷ்வாலும் அரைசதம் விளாசினார். இந்த கூட்டணி முதல் விக்கெட்டிற்கு 139 ரன்களை குவித்து இருந்தபோது, 57 ரன்கள் சேர்த்து இருந்த ஜெய்ஷ்வால் ஆட்டமிழந்தார். அவரை தொடர்ந்து வந்த சுப்மன் கில் வெறும் 10 ரன்களில் நடையை கட்டினார். பொறுப்புடன் விளையாடி வந்த ரோகித் சர்மா சதம் விளாசுவார் என எதிர்பார்க்கப்பட்டது. ஆனால், 80 ரன்கள் குவித்து இருந்தபோது அவர் வாரிகன் பந்துவீச்சில் ஆட்டமிழந்தார். கோலி அபாரம்: googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); அவரை தொடர்ந்து ராகானேவும் 8 ரன்களில் பெவிலியன் திரும்பினார். இதனால் 182 ரன்களை சேர்ப்பதற்குள் 4 விக்கெட்டுகளை இழந்து இந்திய அணி திணறியது. இதையடுத்து, 5வது விக்கெட்டிற்கு ஜோடி சேர்ந்த கோலி மற்றும் ஜடேஜா பொறுப்புடன் விளையாடி ரன் சேர்த்து அணியை சரிவில் இருந்து மீட்டனர். கோலி அரைசதம் கடந்து அசத்தினார். இதனால், இந்திய அணி முதல் நாள் முடிவில் 4 விக்கெட்டுகளை இழந்து 288 ரன்களை சேர்த்துள்ளது. கோலி 87 ரன்களுடனும், ஜடேஜா 36 ரன்களுடன் களத்தில் உள்ளனர். மேற்கிந்திய தீவுகள் அணி சார்பில் கெமார் ரோச், கேப்ரியல், வாரிகன் மற்றும் ஹோல்டர் ஆகியோர் தலா ஒரு விக்கெட்டை வீழ்த்தினர்.","pubDate":"2023-07-21 00:49:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/21/f8d8d0b464c6e58ed3c9218053bfa65c1689884721398344_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Tamil"},{"title":"IND vs WI: రాణించిన రోహిత్‌, జైస్వాల్, కోహ్లీ- రెండో టెస్టులో మొదటి రోజు 288 పరుగులు చేసిన టీమిండియా","link":"https://telugu.abplive.com/sports/cricket/ind-vs-wi-2nd-test-1st-day-hilights-team-india-score-288-runs-virat-kohli-half-century-rohit-sharma-trinidad-105604","keywords":["క్రికెట్"],"creator":["ABP Desam"],"video_url":null,"description":"India vs West Indies 2nd Test 1st Day: ట్రినిడాడ్‌లో వెస్టిండీస్‌తో జరుగుతున్న రెండో టెస్టు మ్యాచ్‌లో మొదటి రోజు టీమిండియా 288 పరుగులు చేసింది. నాలుగు వికెట్లను కోల్పోయింది. మరోసారి ఓపెనింగ్ బ్యాటర్లు కెప్టెన్ రోహిత్ శర్మ, జశ్వంత్‌ జైస్వాల్‌ అద్భుతంగా రాణించి జట్టుకు మంచి ఆరంభాన్ని అందించారు.  రెండో టెస్టు మ్యాచ్ తొలి రోజు కెప్టెన్ రోహిత్ శర్మ 143 బంతులు ఎదుర్కొని 80 పరుగులు చేస్తే జైస్వాల్ 74 బంతుల్లో 57 పరుగులు చేశాడు. 500వ మ్యాచ్ ఆడుతున్న విరాట్ కోహ్లీ సెంచరీకి దగ్గరలో ఉన్నాడు. ప్రస్తుతం 87 పరుగులతో క్రీజ్‌లో ఉన్నాడు విరాట్‌. అతనికి రవీంద్ర జడేజా 36 పరుగులతో తోడుగా ఉన్నాడు. విండీస్‌ బౌలర్లలో జాసన్ హోల్డర్‌, జోమెల్ వారికన్‌, కెమర్‌ రోచ్, షానన్ గాబ్రియల్ తలో వికెట్ తీశారు.  కోహ్లీ, రవీంద్ర జడేజా అద్భతమైన బ్యాటింగ్‌తో విండీస్ బౌలర్లను అడ్డుకున్నారు. ఆఖరిల సెషన్‌లో మరో వికెట్ పడకుండా జాగ్రత్త పడ్డారు. ఆ టైంలో వీళ్లు 33.2 బంతులు ఎదుర్కొని 106 పరుగులు చేశారు. మొత్తంగా మొదటి రోజు విండీస్‌ బౌల‌ర్లు 84 ఓవర్లు బౌల్ చేశారు. కోహ్లీ మొదటి బంతి నుంచి చాలా జాగ్రత్తగా ఆడుతున్నాడు. తొలి రన్ చేసేందుకు అతను 20 బంతులు ఎదుర్కోవాల్సి వచ్చింది. రెండో రోజు ఆలో విరాట్‌ 14 పరుగులు చేస్తే ఐదేళ్ల తర్వాత విదేశీ గడ్డపై సెంచరీ చేసినట్టు అవుతుంది. 2018 డిసెంబర్ నుంచి ఇప్పటి వరకు ఓవర్‌సీస్‌లో అతను సెంచరీ చేయలేదు.  కోహ్లీ క్రీజ్‌లోకి వచ్చినప్పటి నుంచి స్టంప్స్‌కు అవతలి వైపు నాల్గో స్టంప్‌ దిశగా విండీస్‌ బౌలర్లు బంతులు వేశారు. కోహ్లీ తరచూ ఈ బంతులను టచ్ చేసి అవుట్ అవ్వడం తెలిసిందే. విండీస్ బౌలర్లు అదే స్ట్రాటజీని ఇక్కడ ఫాలో అయ్యారు. అయితే కోహ్లీ చాలా చాకచక్యంగా ఆడి 86 పరుగులు సాధించారు.  ఉదయం సెషన్‌లో పరుగులు కాస్త వేగంగా వచ్చిన మధ్యాహ్నానికి పిచ్‌ స్వభావం పూర్తిగా మారిపోయింది. దీంతో పరుగులు రావడం కష్టమైపోయింది. మధ్యాహ్నం 24.4 ఓవర్లలో 61 పరుగులు మాత్రమే చేసింది. టీ విరామానికి రోహిత్, జైస్వాల్, శుభ్‌మన్ గిల్ (12 బంతుల్లో 10), అజింక్యా రహానే (36 బంతుల్లో 8) ఔట్‌ కావలసి వచ్చింది.  జైస్వాల్‌ని మొదటి స్లిప్‌లో కిర్క్ మెకెంజీ అద్బుతమైన క్యాచ్‌ పెవిలియన్ పంపించారు. ఆట ప్రారంభమైనప్పటి నుంచి ఆ యాంగిల్‌లో చాలా స్కోరు చేయగలిగాడు జైస్వాల్. దీంతో ఫీల్డింగా మార్చిన విండీస్... గల్లీ ఫీల్డర్‌ను వెనక్కి పంపించి తన వ్యూహాన్ని అమలు చేసింది. అనుకున్నట్టుగానే జైస్వాల్ దొరికిపోయి అవుట్ అయ్యాడు.  జైస్వాల్‌ వెళ్లిన తర్వాత వచ్చిన గిల్ మరోసారి నిరాశపరిచాడు. వరుసగా రెండో మ్యాచ్‌లో కూడా ఫెయిల్ అయ్యాడు. రోచ్ ఆఫ్ స్టంప్ బాల్స్ వేస్తూ గిల్‌కు ఉచ్చు బిగించాడు. ఓ గుడ్‌ లెంగ్త్‌ బాల్‌కు గిల్ దొరికిపోయాడు. కీపర్‌కు క్యాచ్ ఇచ్చి పెవిలియన్ చేరాడు. కాసేపటికే వారికన్ బౌలింగ్‌లో రోహిత్ ఔటయ్యాడు. రహానే (36 బంతుల్లో 8) గాబ్రియేల్‌కు చిక్కాడు. లంచ్ విరామానికి వికెట్లు నష్టపోకుండా 121 పరుగులు చేసిన టీమిండియా టీ బ్రేక్ సమాయానికి నాలుగు వికెట్లను కోల్పోయింది.  ఇరు జట్ల మధ్య జరుగుతున్న వంద టెస్టుకావడంతో భారత్, వెస్టిండీస్ కెప్టెన్‌లకు బ్రియాన్ లారా ప్రత్యేక జ్ఞాపికను అందజేశారు.","content":"India vs West Indies 2nd Test 1st Day: ట్రినిడాడ్‌లో వెస్టిండీస్‌తో జరుగుతున్న రెండో టెస్టు మ్యాచ్‌లో మొదటి రోజు టీమిండియా 288 పరుగులు చేసింది. నాలుగు వికెట్లను కోల్పోయింది. మరోసారి ఓపెనింగ్ బ్యాటర్లు కెప్టెన్ రోహిత్ శర్మ, జశ్వంత్‌ జైస్వాల్‌ అద్భుతంగా రాణించి జట్టుకు మంచి ఆరంభాన్ని అందించారు. రెండో టెస్టు మ్యాచ్ తొలి రోజు కెప్టెన్ రోహిత్ శర్మ 143 బంతులు ఎదుర్కొని 80 పరుగులు చేస్తే జైస్వాల్ 74 బంతుల్లో 57 పరుగులు చేశాడు. 500వ మ్యాచ్ ఆడుతున్న విరాట్ కోహ్లీ సెంచరీకి దగ్గరలో ఉన్నాడు. ప్రస్తుతం 87 పరుగులతో క్రీజ్‌లో ఉన్నాడు విరాట్‌. అతనికి రవీంద్ర జడేజా 36 పరుగులతో తోడుగా ఉన్నాడు. విండీస్‌ బౌలర్లలో జాసన్ హోల్డర్‌, జోమెల్ వారికన్‌, కెమర్‌ రోచ్, షానన్ గాబ్రియల్ తలో వికెట్ తీశారు. కోహ్లీ, రవీంద్ర జడేజా అద్భతమైన బ్యాటింగ్‌తో విండీస్ బౌలర్లను అడ్డుకున్నారు. ఆఖరిల సెషన్‌లో మరో వికెట్ పడకుండా జాగ్రత్త పడ్డారు. ఆ టైంలో వీళ్లు 33.2 బంతులు ఎదుర్కొని 106 పరుగులు చేశారు. మొత్తంగా మొదటి రోజు విండీస్‌ బౌల‌ర్లు 84 ఓవర్లు బౌల్ చేశారు. కోహ్లీ మొదటి బంతి నుంచి చాలా జాగ్రత్తగా ఆడుతున్నాడు. తొలి రన్ చేసేందుకు అతను 20 బంతులు ఎదుర్కోవాల్సి వచ్చింది. రెండో రోజు ఆలో విరాట్‌ 14 పరుగులు చేస్తే ఐదేళ్ల తర్వాత విదేశీ గడ్డపై సెంచరీ చేసినట్టు అవుతుంది. 2018 డిసెంబర్ నుంచి ఇప్పటి వరకు ఓవర్‌సీస్‌లో అతను సెంచరీ చేయలేదు. కోహ్లీ క్రీజ్‌లోకి వచ్చినప్పటి నుంచి స్టంప్స్‌కు అవతలి వైపు నాల్గో స్టంప్‌ దిశగా విండీస్‌ బౌలర్లు బంతులు వేశారు. కోహ్లీ తరచూ ఈ బంతులను టచ్ చేసి అవుట్ అవ్వడం తెలిసిందే. విండీస్ బౌలర్లు అదే స్ట్రాటజీని ఇక్కడ ఫాలో అయ్యారు. అయితే కోహ్లీ చాలా చాకచక్యంగా ఆడి 86 పరుగులు సాధించారు. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ఉదయం సెషన్‌లో పరుగులు కాస్త వేగంగా వచ్చిన మధ్యాహ్నానికి పిచ్‌ స్వభావం పూర్తిగా మారిపోయింది. దీంతో పరుగులు రావడం కష్టమైపోయింది. మధ్యాహ్నం 24.4 ఓవర్లలో 61 పరుగులు మాత్రమే చేసింది. టీ విరామానికి రోహిత్, జైస్వాల్, శుభ్‌మన్ గిల్ (12 బంతుల్లో 10), అజింక్యా రహానే (36 బంతుల్లో 8) ఔట్‌ కావలసి వచ్చింది. జైస్వాల్‌ని మొదటి స్లిప్‌లో కిర్క్ మెకెంజీ అద్బుతమైన క్యాచ్‌ పెవిలియన్ పంపించారు. ఆట ప్రారంభమైనప్పటి నుంచి ఆ యాంగిల్‌లో చాలా స్కోరు చేయగలిగాడు జైస్వాల్. దీంతో ఫీల్డింగా మార్చిన విండీస్... గల్లీ ఫీల్డర్‌ను వెనక్కి పంపించి తన వ్యూహాన్ని అమలు చేసింది. అనుకున్నట్టుగానే జైస్వాల్ దొరికిపోయి అవుట్ అయ్యాడు. జైస్వాల్‌ వెళ్లిన తర్వాత వచ్చిన గిల్ మరోసారి నిరాశపరిచాడు. వరుసగా రెండో మ్యాచ్‌లో కూడా ఫెయిల్ అయ్యాడు. రోచ్ ఆఫ్ స్టంప్ బాల్స్ వేస్తూ గిల్‌కు ఉచ్చు బిగించాడు. ఓ గుడ్‌ లెంగ్త్‌ బాల్‌కు గిల్ దొరికిపోయాడు. కీపర్‌కు క్యాచ్ ఇచ్చి పెవిలియన్ చేరాడు. కాసేపటికే వారికన్ బౌలింగ్‌లో రోహిత్ ఔటయ్యాడు. రహానే (36 బంతుల్లో 8) గాబ్రియేల్‌కు చిక్కాడు. లంచ్ విరామానికి వికెట్లు నష్టపోకుండా 121 పరుగులు చేసిన టీమిండియా టీ బ్రేక్ సమాయానికి నాలుగు వికెట్లను కోల్పోయింది. ఇరు జట్ల మధ్య జరుగుతున్న వంద టెస్టుకావడంతో భారత్, వెస్టిండీస్ కెప్టెన్‌లకు బ్రియాన్ లారా ప్రత్యేక జ్ఞాపికను అందజేశారు.","pubDate":"2023-07-21 00:37:35","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/21/9e9a1153326d0e79827b98404485bd8d1689899755317215_original.png","source_id":"abplive","category":["sports"],"country":["india"],"language":"Telugu"},{"title":"Old Thomians gear up for 2nd Annual Guru Cricket Bash","link":"https://www.ft.lk/sports/Old-Thomians-gear-up-for-2nd-Annual-Guru-Cricket-Bash/23-750872","keywords":null,"creator":null,"video_url":null,"description":null,"content":"At the height of the Second World War, 700 students at the prestigious S. Thomas’ College, Mount Lavinia, were suddenly displaced when the State ordered the closure of schools in Colombo. A blessing then came in the form of a 45-acre farm belonging to the de Saram family, hidden away in the frosty hills of Nuwara Eliya. Helmed by Oxford educationist Dr. R.L. Hayman, the College branched out from the coast to the central highlands. The history of S. Thomas’ College Gurutalawa (STCG) began here, in 1942, when it was declared open for students to continue their education during the war. 81 years later, the college has fostered numerous extracurricular activities that have bound several generations of its alumni in brotherhood. The annual Guru Cricket Bash is a testament to the college’s tight-knit fraternity united in its shared love of cricket. Launched in 2022, the event was conceptualised by the old boys of the class of 1984, also known as ‘The Prodigies’. The group also formed the STCG Brotherhood in 2021 and has been initiating reunions among the college’s old boys ever since. The first ‘Prodigy’ event of great magnitude, the Guru Cricket Bash, is a six-a-side cricket tournament where alumni of STCG compete for the Patrick Gunawardene Championship Trophy, fondly named after a beloved headmaster. The teams are formed by Old Thomians, based on their classes/batches. There are 18 registered teams who will be competing for the championship trophy this year. The Guru Cricket Bash will take place at the 5 Field Engineering Regiment Army Camp in Mattegoda, Polgasowita on 22 July. The organisers expect a considerable number of attendees. There will be a variety of entertainment activities and segments planned, including DJ music, papare bands, live bands, and dance crews. Additionally, PUB 84, a dedicated pub offering entertainment, will be open throughout the event. Morning snacks and lunch will be provided for all visitors. Furthermore, there will be vendors offering coffee, tea, ice cream, and snacks available for purchase at the grounds. The event is open to all STCG old Thomians and their families. It will begin at 8 a.m. and continue until 7 p.m. on 22 July.","pubDate":"2023-07-21 00:15:00","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Zak attack: Why Crawley is the model Bazball player","link":"https://www.smh.com.au/sport/cricket/an-itch-to-attack-why-zak-crawley-is-the-model-bazball-player-20230721-p5dq35.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"England’s opener Zak Crawley personifies Bazball, the risks involved and the rich payoff at Old Trafford in the fourth Test for sticking to it.","content":"In an interview before this Ashes series, Brendon McCullum pondered the prospect of a day when Zak Crawley went off with a big score. “Zak has a much stronger offensive game, and we believe in his ability to put opposition teams under pressure. Every now and then he’s going to get out. It can happen, but if he gets going ...” McCullum trailed off, as though not wanting to actually say the words . Zak Crawley blazed for England on day two of the fourth Test in Manchester. Credit: Reuters On day two at Old Trafford, as vital as any day of this series , Crawley did indeed get going. He is as much the key player for England in the Bazball era as Scott Hatteberg was in the film adaptation of Moneyball , the film about Billy Beane and the Oakland A’s. Hatteberg was a catcher turned into a first baseman because of his hitting ability, fitting him into a team that was fashioned into success from unpromising origins. Crawley, likewise, was shaping as something of a mediocrity before McCullum and Ben Stokes gave him permission to attack, using his height and power to put pressure on bowlers. It doesn’t always work, but as was seen on a sunny afternoon in Manchester, when it does the sky is the limit. For Crawley, the innings of 189 from 182 balls , including a thrilling 26-ball sprint from 50 to 100, was vindication for listening to McCullum and Stokes and doing what he does best, rather than trying to bat like his partner for 206 runs, the phlegmatic Joe Root. England were 4-384 at stumps, leading by 67. “It’s fair to say that under any other coach or captain I probably wouldn’t be playing this series,” Crawley said. “So, to be backed by them gives me a lot of confidence. They’ve always said not to worry about being consistent, just to go out and try to win games for England. “We chat a lot and he [McCullum] is really good at that, having those little conversations with you about playing. I understand what he means, I’m at my best when I’m putting them under pressure and attacking and so is he. “He maybe wasn’t the most consistent, but he played some incredible knocks and I think that’s what he wants from me. As long as they want that from me, I’m happy to take that punt at the top of the order.” Looking back to the 2021-22 Ashes series in Australia, Crawley offered moments of promise, not least at the SCG. But he was struggling to put it all together. “I was just trying to sit on bowlers and make them come to me and try and build an innings like that,” he said. “I found at this level you get so many good balls, especially at the top of the order, I was getting a couple of nice scores then getting out and it wasn’t really me. “I always felt an itch to attack a bit more and when you’re playing with such great players like Joe and Stokesy, you try and emulate them a lot, but there comes a point where you have to bat your own way as well. Just trying to be a bit more positive is more like me.” Crawley persisted in this mindset despite the frustrations of the first three Tests, including a pair of innings at Headingley where he threatened to go big, only to edge Mitch Marsh behind. “Those thoughts are always coming into your head,” he said of the doubts all batters face. “When I got out at Headingley I got a couple of nice knocks there but didn’t convert them, and I was thinking too much about the score rather than being immersed in the moment. Zak Crawley is bowled by Scott Boland at the SCG in 2022. Credit: AP “I was a lot more present today and I think that helped me go on and get a big score rather than worrying about getting a big score before you’re already there.” Overall, the effect of Crawley’s innings was not only to keep England in the Ashes despite an indifferent weather forecast for Manchester over the next three days, but also to underline that Bazball is the best way forward for this England side. “We’ve shown that being positive suits our players,” Crawley said. “At other times we absorb pressure but most of the time we try and put pressure back on them and get them thinking about what they’re doing rather than what we’re doing. “I feel like today was a really good day for that. And even yesterday [Chris] Woakes bowled so well and was putting pressure on them with the ball. It works with both bat and ball. We’ve played really well so far in this game over the last two days and hopefully we continue that in the next couple of days.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-21 00:03:32","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Trinity award seven ‘Lions’ for cricketers","link":"https://www.ft.lk/sports/Trinity-award-seven--Lions--for-cricketers/23-750871","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Trinity College awarded Cricket ‘Lions’ for their outstanding 7 of the under 19 cricket outfit which had a great school season during 2022/2023. Skipper, Rahal Amarasinghe, Manula Kularatne, Dinuka Thenekoon, Dinusha Peiris, Kusal Wijethunge, Theeraka Ranathunge and Tharana Wimaladharma won their cricket “Lion”. Theeraka and Manula represented the Under 19 national outfit tour to UAE. Meanwhile Jayavi Liyanagama, Supun Waduge, Janith Warunakula won cricket colours while Vibhawith Ehalapola was re-awarded with his cricket colours. (SJ)","pubDate":"2023-07-21 00:00:00","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"If I try to be consistent, I would not have days like these: England’s Crawley on century against Australia","link":"https://thenewsmill.com/2023/07/if-i-try-to-be-consistent-i-would-not-have-days-like-these-englands-crawley-on-century-against-australia/","keywords":["Cricket","Sports"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Following his massive hundred against Australia in the fourth Ashes Test at Old Trafford, England opener Zak Crawley said that though his high-risk approach as a batter has caused himself some self-doubt, he encourages himself to “be me” and added that he prefers a big, impactful knock after some low scores over being more consistent. Zak Crawley’s 189 and half-centuries by Joe Root and Moeen Ali provided 67 runs lead to England over Australia on the second day of the fourth Test match of the Ashes series here at Old Trafford Cricket Ground on Thursday. Right from the moment he launched the first delivery of the Ashes bowled by Aussie skipper Pat Cummins for four, Crawley has been repaying the faith shown by skipper Ben Stokes and coach Brendon McCullum during 2021 and 2022, when he battled patchy form and inconsistency. Stokes-McCullum backed him to come good and live up to his potential, often saying that his impactful innings at the top could prove match-winning and drive England’s ‘Bazball’ approach of cricket forward, which favours aggression, positivity and hunger for a win or a result at least. After scoring 173 in 16 innings at an average of around 10 in 2021 and 844 in 29 innings at an average of just above 30, Crawley has shown massive improvement this year. With 518 runs in 13 innings at an average of over 42, one century and two fifties, Crawley is having a great year in red-ball cricket so far. He is currently the highest run-scorer in this year’s Ashes. He has scored 385 runs in seven innings of four matches at an average of 55.00 with one century and one fifty. His runs have come at a strike rate of almost 90. These numbers have surely made the hard times worth enduring. “Today was a good day for us. We are in a good position as a team. It was good fun. I rode my luck at times but hit some good shots along the way. I do doubt myself at times but I have to say ‘keep being me’. That is the way I play. I am quite streaky but then I go on a run. They [coach and captain] tell me to go out and have an impact at the top of the order. Sometimes I am going to have streaks of a low scores, because I am taking a punt, but thankfully today it came off,” said Crawley as quoted by ESPNCricinfo to Sky Sports. Last summer when he was facing low scores, McCullum defended Crawley, saying that his “skillset is not to be a consistent cricketer”. Crawley feels that criticism over consistency is fair, but he would not have days like the one at Old Trafford if he chases consistency. “They do not want me to lose days like today. If I try to be more consistent, maybe I would not have a day like today. I much prefer this, a few low scores and then a big one. [Criticism] is definitely fair, because I have not been consistent, but I think I have shown that, at my best, I am good enough for this level. I was pleased with how it went. That was more my template,” said Crawley. Crawley’s aggression against Travis Head, Aussie’s part-time spinner without their frontline star Nathan Lyon and Cummins, who went for 93 runs in his 16 overs, was a major highlight of his knock. “It is definitely a conscious effort to take them down, because obviously they are great bowlers who are trying to rest [between spells]. When those bowlers come on, I think it is important to put them under pressure and so that does not give them time to rest and come back. I would try to bat time and build an innings like [Joe] Root or any of those guys up there, but it is much better when I put the bowler under a bit more pressure before they can get me. Sometimes it comes off, and sometimes it doesn’t,” he said. Despite his massive figures, his century did not look convincing to many as he inside-edged past his own stumps frequently for four and some shots just flew over the slips for four and looked close enough to be caught. Crawley feels that he has earned this luck. “I have had a lot of nicks over the slips this series. And actually, I do not think that is good luck. I have earned that luck. If you go harder, the ball goes over the slips. So I would rather err on that side then go negative,” he said. Crawley, who scored 267 against Pakistan in 2020 in a match played behind closed doors during the COVID-19 pandemic felt really happy to receive the applause from the crowd for the first time at home after a century. “The crowd were amazing. Obviously, I had not scored a hundred in England, apart from in Covid, so there was no one to clap me off there. But it is pretty cool to have the whole crowd clapping you off and the Aussies too, some great players there shook my hand, so that is pretty cool as well. It was an amazing feeling. You have a lot of low scores and bad form along the way. So days like today make it all worth it. I would not swap it for anything,” he said. When Crawley was at the crease, England racked up 178 runs in just 25 overs of the afternoon session. But once ball started to get older and softer, the innings got difficult for England. Both Root and Crawley lost their wickets to deliveries that kept low. “The ball definitely went soft. They were trying to change it a lot and it was definitely out of shape, which made it two-paced. Joe was so unlucky. That wicket was unplayable and even Stokesy had a couple of pop up at him and keep low. So it might be the oldness of the ball, but hopefully, it is the wicket, and hopefully, it keeps playing tricks and we bowl well [in the second innings],” said the opener. But before Australia, second innings, England has to build a lead and they could declare because the weather forecast for the weekend is not really promising. “I will leave that to the bosses up there. but if we can get another 130-140, it will be really good. It may be even just another 100, because it looks like it is going to be trickier out there at the back-end, so it could be a good chance to bowl tomorrow afternoon and hopefully get a few wickets,” he concluded. Coming to the match, after opting to field first, England bundled out Australia for 317 in the first innings. Australia had finished their first day on 299/8. James Anderson (1/51) and Chris Woakes (5/62) bundled out Australia early in the day. England in their first innings lost Ben Duckett for just one. Following this, Moeen (54) had a 121-run stand for the second wicket with Zak Crawley. Following Moeen’s dismissal, Crawley brought up his maiden Ashes ton and fourth overall in Tests. He also had a 206-run partnership for the third wicket with Joe Root before being dismissed for 189 off 182 balls, consisting of 21 fours and three sixes. Root was also dismissed soon for 84 off 95 balls, consisting of eight fours and a six. England ended the second day at 384/4, with skipper Ben Stokes (24*) and Harry Brook (14*) unbeaten. The hosts had a 67-run lead. (ANI)","pubDate":"2023-07-20 23:34:57","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Virat Kohli surpasses Jacques Kallis, becomes 5th highest run-scorer in international cricket","link":"https://thenewsmill.com/2023/07/virat-kohli-surpasses-jacques-kallis-becomes-5th-highest-run-scorer-in-international-cricket/","keywords":["Cricket","Sports"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Star India batter Virat Kohli on Friday surpassed South Africa’s Jacques Kallis to become the fifth-highest run-scorer in international cricket history. Kohli achieved this upward movement in the batting charts during India’s second Test against West Indies at Port of Spain. On the first day of the match, which is also his 500th international game, Virat ended unbeaten on 87 in 161 balls. His knocks included eight boundaries. The second day of the match could see Virat smashing his 76th international century and delivering the ‘Kohli Special’ fans have been waiting for. Currently in 500 matches, Virat has scored 25,548 runs at an average of 53.67. He has smashed 75 centuries and 132 half-centuries in 559 innings, with the best score of 254 onwards. Virat has overtaken Kallis’ tally of 25,534 runs in 519 matches, with 62 centuries and 149 fifties. He can add to this on day two of the match. Currently, ahead of Kohli are legends like Sri Lanka’s Mahela Jayawardene (25,957 runs in 652 matches), Ricky Ponting from Australia (27,483 runs in 560 matches), SL’s Kumar Sangakkara (28,016 runs in 594 matches) and Indian legendary cricketer Sachin Tendulkar (34,357 runs in 664 matches). In 111 Tests, Virat has scored 8642 runs at an average of 49.38. He has scored 28 centuries and 30 fifties so far in the longest format, with the best score of 254*. He is India’s fifth-highest run scorer in Tests. In 274 ODI matches, Virat has scored 12,898 runs at an average of 57.32. He has scored 46 centuries and 65 half-centuries. He is India’s second-highest run-scorer in ODI cricket. Overall, he is the fifth-highest-run scorer in ODI cricket. The veteran batter is the highest-run scorer in the T20I format in its history. In 115 matches, he has scored 4,008 runs at an average of 52.73. He has scored one century and 37 fifties in the format, with the best score of 122*. Coming to the match, a century partnership between Virat and Ravindra Jadeja brought back India into the game and Kohli is nearing his 29th Test century at the end of the first day of the second Test against West Indies in Port of Spain on Friday. At stumps, India was 288/4, with Virat (87*) and Jadeja (36*). India finished the first session at 121/0, with Rohit Sharma 63*, Yashasvi Jaiswal 52* unbeaten at the crease. But their partnership broke at 139 runs in the second session, with fall of Jaiswal for 57. Shubman Gill (10) and Rohit (80) fell in quick succession, leaving India at 155/3. Virat then took innings forward with vice-captain Ajinkya Rahane, who fell for eight on the final ball of the second session. India ended the second session at 182/4, with Virat (18*) unbeaten. WI elected to bowl first after winning the toss. (ANI)","pubDate":"2023-07-20 23:34:44","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Canadian cricketer Aaron Johnson shines at Global T20 Canada","link":"https://torontosun.com/sports/other-sports/canadian-cricketer-aaron-johnson-shines-at-global-t20-canada","keywords":["Other Sports","Sports"],"creator":["Richard Mauntah"],"video_url":null,"description":null,"content":"It’s a tournament where local players rub shoulders with the game’s biggest stars. And should one of the locals take a game over, it could propel him to new heights. Aaron Johnson is relatively new to the Canadian national team after spending much of his career playing in British Columbia. But his overall performance in the opening game of Global T20 Canada is one he won’t soon forget as he led the Brampton Wolves to a crushing win over the Mississauga Panthers in a weather-shortened match. After holding Mississauga to just 121 in their innings, the Wolves responded with 99 in just nine overs having lost just one wicket, more than enough of a run rate to win if the match had to be called early. Sure enough, darkening skies and the threat of lightning caused the umpires to put an early end to the day’s proceedings. Johnson also distinguished himself in the field, and while the catch he made may have been one he has taken many times, this one was against Chris Gayle at a time when the West Indian legend was just starting to heat up. But it was with the bat where Johnson became the star of the day, smashing three sixes and five fours for a total of 48 not out off just 26 balls. Only the skies prevented him from a much bigger total. If there’s a reason for this tournament to exist, it is for players such as Johnson. Test players have their pick of T20 tournaments in which to participate. Others have more limited options. For Canadians, this may be their only opportunity to impress to the point that other offers come their way. Johnson earned his way onto the Canadian national team last year. Born and raised in Jamaica, his family moved to Fort McMurray, Alta., late in his teens. His national team highlight came in a T20 international against Oman where he scored 109, a record for a Canadian batsman in the short format of the game. With Gayle on the bench, it was up to his Panthers teammates to put a decent total. Young Pakistan wicket keeper Azam Khan faced that challenge head on and flourished, scoring 65, including five fours and three sixes, two being majestic strikes with five overs remaining. “It was good for the team. The team needed it,” Khan said. “I clicked at the right moment.” The batting performance aside, the Kirachi native is enjoying his time in this part of the world. “It’s my first time in Canada and I’m loving it,” he said. “The people have been really supportive.” He did much of that damage alongside former Canadian team captain Navneet Dhaliwal, who scored 29, including the first maximum of the tournament. But four wickets from Logan van Beek, including that of Khan, and two wickets each from Chris Green and Jan Frylinck limited Mississauga. Green also contributed with a perfect throw to the wicket to cause another runout. The Wolves wasted no time in their chase. Usman Khan hit a six to open the innings on his way to a score of 12. Brampton also got a big performance from Mark Chapman, the New Zealand international originally from Hong Kong. Chapman scored 30 including three fours and a six. Bowling-wise, Mississauga captain Shoaib Malik had a tough day. In his two overs, he gave up 34 runs. Zahoor Khan took the only wicket. Global T20 Canada continues Friday with the Toronto Nationals facing the Vancouver Knights and the Surrey Jaguars taking the field for the first time against the Montreal Tigers. Logan van Beek ( Brampton Wolves) Age: 32 Country: Netherlands Career Highlight: In a 2023 World Cup qualifier against the West Indies in June, van Beek scored a world-record 30 runs in the tie-breaking Super Over then took two West Indian wickets to preserve the upset win. Check out our sports section for the latest news and analysis. Care for a wager? Head to our sports betting section for news and odds.","pubDate":"2023-07-20 23:31:29","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/07/0721-welcomecricket-scaled-e1689895652968.jpg?quality=100&strip=all","source_id":"torontosun","category":["sports"],"country":["canada"],"language":"english"},{"title":"Rohail to lead Pakistan Shaheens in Darwin series","link":"https://www.thenews.com.pk/print/1092530-rohail-to-lead-pakistan-shaheens-in-darwin-series","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: The Pakistan Cricket Board has appointed wicketkeeper-batter Rohail Nazir as the Pakistan Shaheens captain for the Top End T20 Series in Darwin, Australia, which is being organised by Northern Territory Cricket from 30 July to 6 August.Apart from the NTC side, NT Strike, and Pakistan...","content":"LAHORE: The Pakistan Cricket Board (PCB) has appointed wicketkeeper-batter Rohail Nazir as the Pakistan Shaheens captain for the Top End T20 Series in Darwin, Australia, which is being organised by Northern Territory Cricket (NTC) from 30 July to 6 August. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } } min-width: 336px; min-height: 280px; */ Apart from the NTC side, NT Strike, and Pakistan Shaheens, Australian Capitol Territory’s ACT Comets, Melbourne Stars, Melbourne Renegades and Papua New Guinea (PNG) will participate in the six-team tournament in a T20 format with the top-two sides progressing to the final. Afterwards, Shaheens will also play two 50-over matches against PNG and NT Strike on 8 and 9 August, respectively. The Darwin tour is part of the PCB’s policy to create opportunities for the emerging cricketers to play away cricket in different conditions against different oppositions across all formats. Rohail has played 33 first-class matches and has previously captained Pakistan Shaheens. He recently toured Zimbabwe where the Shaheens played two four-dayers and six 50-over matches in May. Pakistan Shaheens squad: Rohail Nazir (captain), Aaliyan Mahmood, Ali Asfand, Amir Hassan, Arafat Minhas, Azan Awais, Basit Ali, Faisal Akram, Mohammad Imran, Sajjad Ali, Mohammad Irfan Khan, Shamyl Hussain, Shawaiz Irfan, Syed Zeeshan Zameer and Wahaj Riaz.","pubDate":"2023-07-21 01:00:00","image_url":null,"source_id":"thenews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Slow progress in restoration of departmental teams","link":"https://www.thenews.com.pk/print/1092525-slow-progress-in-restoration-of-departmental-teams","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Only about a month is left before the domestic cricket season starts, but not a single departmental team has been announced officially so far.Pakistan PM Shehbaz Sharif, who is also patron in chief of PCB, lifted the ban on departmental sports last year. Pakistan first class cricket...","content":"KARACHI: Only about a month is left before the domestic cricket season starts, but not a single departmental team has been announced officially so far. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } } min-width: 336px; min-height: 280px; */ Pakistan PM Shehbaz Sharif, who is also patron in chief of PCB, lifted the ban on departmental sports last year. Pakistan first class cricket season starts in September. Eight departmental cricket teams will participate in the Quaid-e-Azam Trophy this year. Departmental teams which were abolished in 2019 and are to participate in domestic cricket after a gap of two years have not announced the establishment of their teams so far. Sources connected to the development of restoration of departmental cricket teams said that verbal agreement between the players and management of different departments have been completed but letters have not been issued so far. Sources said that one of the main reasons in the delay of the restoration of departmental cricket teams is the lack of approval of sports budget by the own departments. They said that contract letters and appointment letters would be issued in August, sources said. Sources explained that the sports budget of the departments is finalised and approved one to two months after the federal government budget. \"That's why there is delay in the establishment of cricket teams but all preparations have been completed,\" said a source. Sources said in August a number of departments would announce their cricket teams and officials. Sources further said that the change in the PCB’s hierarchy earlier this month and country’s political and economical circumstances are also the reason of sluggish pace in the restoration of departmental sports teams. But the departments sports officials are seriously working on this matter and holding talks with cricketers. A numbers of leading cricketers and emerging cricketers have been informally hired and details in this regard would emerge next month, sources said. Meanwhile, it was learnt that seven departmental teams have confirmed their participation in the Quaid-e-Azam Trophy.","pubDate":"2023-07-21 01:00:00","image_url":null,"source_id":"thenews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IND Vs WI Test: கோலி அபாரம்..ரோகித், ஜெய்ஷ்வால் அசத்தல்..மேற்கிந்திய தீவுகளுக்கு எதிரான டெஸ்டில் 288 ரன்கள் குவிப்பு","link":"https://tamil.abplive.com/sports/cricket/ind-vs-wi-2nd-test-india-in-control-with-kohli-rohit-jaiswal-s-fifties-on-day-1-ends-with-288-runs-130142","keywords":["கிரிக்கெட்"],"creator":["குலசேகரன் முனிரத்தினம்"],"video_url":null,"description":"மேற்கிந்திய தீவுகள் அணிக்கு எதிரான இரண்டாவது டெஸ்ட் போட்டியின் முதல் நாளில்,  இந்திய அணி 288 ரன்களை குவித்துள்ளது.  இந்திய அணி பேட்டிங்: போர்ட் ஆஃப் ஸ்பெயினில் நடைபெறும் போட்டியில் டாஸ் வென்ற மேற்கிந்திய தீவுகள் அணி, முதலில் பந்துவீச்சை தேர்வு செய்தது. இதையடுத்து களமிறங்கிய இந்திய அணியின் தொடக்க வீரர்களான கேப்டன் ரோகித் சர்மா மற்றும் ஜெய்ஷ்வால் ஆகியோர் அணிக்கு நல்ல தொடக்கம் அளித்தனர். ரோகித் சர்மா  அரைசதம் கடக்க, சக வீரரான ஜெய்ஷ்வாலும் அரைசதம் விளாசினார். இந்த கூட்டணி முதல் விக்கெட்டிற்கு 139 ரன்களை குவித்து இருந்தபோது, 57 ரன்கள் சேர்த்து இருந்த ஜெய்ஷ்வால் ஆட்டமிழந்தார். அவரை தொடர்ந்து வந்த சுப்மன் கில் வெறும் 10 ரன்களில் நடையை கட்டினார். பொறுப்புடன் விளையாடி வந்த ரோகித் சர்மா சதம் விளாசுவார் என எதிர்பார்க்கப்பட்டது. ஆனால், 80 ரன்கள் குவித்து இருந்தபோது அவர் வாரிகன் பந்துவீச்சில் ஆட்டமிழந்தார்.  கோலி அபாரம்: அவரை தொடர்ந்து ராகானேவும் 8 ரன்களில் பெவிலியன் திரும்பினார். இதனால் 182 ரன்களை சேர்ப்பதற்குள் 4 விக்கெட்டுகளை இழந்து இந்திய அணி திணறியது. இதையடுத்து, 5வது விக்கெட்டிற்கு ஜோடி சேர்ந்த கோலி மற்றும் ஜடேஜா பொறுப்புடன் விளையாடி ரன் சேர்த்து அணியை சரிவில் இருந்து மீட்டனர். கோலி அரைசதம் கடந்து அசத்தினார். இதனால், இந்திய அணி முதல் நாள் முடிவில் 4 விக்கெட்டுகளை இழந்து 288 ரன்களை சேர்த்துள்ளது. கோலி 87 ரன்களுடனும், ஜடேஜா 36 ரன்களுடன் களத்தில் உள்ளனர். மேற்கிந்திய தீவுகள் அணி சார்பில் கெமார் ரோச், கேப்ரியல், வாரிகன் மற்றும் ஹோல்டர் ஆகியோர் தலா ஒரு விக்கெட்டை வீழ்த்தினர்.","content":"மேற்கிந்திய தீவுகள் அணிக்கு எதிரான இரண்டாவது டெஸ்ட் போட்டியின் முதல் நாளில், இந்திய அணி 288 ரன்களை குவித்துள்ளது. இந்திய அணி பேட்டிங்: போர்ட் ஆஃப் ஸ்பெயினில் நடைபெறும் போட்டியில் டாஸ் வென்ற மேற்கிந்திய தீவுகள் அணி, முதலில் பந்துவீச்சை தேர்வு செய்தது. இதையடுத்து களமிறங்கிய இந்திய அணியின் தொடக்க வீரர்களான கேப்டன் ரோகித் சர்மா மற்றும் ஜெய்ஷ்வால் ஆகியோர் அணிக்கு நல்ல தொடக்கம் அளித்தனர். ரோகித் சர்மா அரைசதம் கடக்க, சக வீரரான ஜெய்ஷ்வாலும் அரைசதம் விளாசினார். இந்த கூட்டணி முதல் விக்கெட்டிற்கு 139 ரன்களை குவித்து இருந்தபோது, 57 ரன்கள் சேர்த்து இருந்த ஜெய்ஷ்வால் ஆட்டமிழந்தார். அவரை தொடர்ந்து வந்த சுப்மன் கில் வெறும் 10 ரன்களில் நடையை கட்டினார். பொறுப்புடன் விளையாடி வந்த ரோகித் சர்மா சதம் விளாசுவார் என எதிர்பார்க்கப்பட்டது. ஆனால், 80 ரன்கள் குவித்து இருந்தபோது அவர் வாரிகன் பந்துவீச்சில் ஆட்டமிழந்தார். கோலி அபாரம்: googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); அவரை தொடர்ந்து ராகானேவும் 8 ரன்களில் பெவிலியன் திரும்பினார். இதனால் 182 ரன்களை சேர்ப்பதற்குள் 4 விக்கெட்டுகளை இழந்து இந்திய அணி திணறியது. இதையடுத்து, 5வது விக்கெட்டிற்கு ஜோடி சேர்ந்த கோலி மற்றும் ஜடேஜா பொறுப்புடன் விளையாடி ரன் சேர்த்து அணியை சரிவில் இருந்து மீட்டனர். கோலி அரைசதம் கடந்து அசத்தினார். இதனால், இந்திய அணி முதல் நாள் முடிவில் 4 விக்கெட்டுகளை இழந்து 288 ரன்களை சேர்த்துள்ளது. கோலி 87 ரன்களுடனும், ஜடேஜா 36 ரன்களுடன் களத்தில் உள்ளனர். மேற்கிந்திய தீவுகள் அணி சார்பில் கெமார் ரோச், கேப்ரியல், வாரிகன் மற்றும் ஹோல்டர் ஆகியோர் தலா ஒரு விக்கெட்டை வீழ்த்தினர்.","pubDate":"2023-07-21 00:49:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/21/f8d8d0b464c6e58ed3c9218053bfa65c1689884721398344_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Tamil"},{"title":"IND vs WI: రాణించిన రోహిత్‌, జైస్వాల్, కోహ్లీ- రెండో టెస్టులో మొదటి రోజు 288 పరుగులు చేసిన టీమిండియా","link":"https://telugu.abplive.com/sports/cricket/ind-vs-wi-2nd-test-1st-day-hilights-team-india-score-288-runs-virat-kohli-half-century-rohit-sharma-trinidad-105604","keywords":["క్రికెట్"],"creator":["ABP Desam"],"video_url":null,"description":"India vs West Indies 2nd Test 1st Day: ట్రినిడాడ్‌లో వెస్టిండీస్‌తో జరుగుతున్న రెండో టెస్టు మ్యాచ్‌లో మొదటి రోజు టీమిండియా 288 పరుగులు చేసింది. నాలుగు వికెట్లను కోల్పోయింది. మరోసారి ఓపెనింగ్ బ్యాటర్లు కెప్టెన్ రోహిత్ శర్మ, జశ్వంత్‌ జైస్వాల్‌ అద్భుతంగా రాణించి జట్టుకు మంచి ఆరంభాన్ని అందించారు.  రెండో టెస్టు మ్యాచ్ తొలి రోజు కెప్టెన్ రోహిత్ శర్మ 143 బంతులు ఎదుర్కొని 80 పరుగులు చేస్తే జైస్వాల్ 74 బంతుల్లో 57 పరుగులు చేశాడు. 500వ మ్యాచ్ ఆడుతున్న విరాట్ కోహ్లీ సెంచరీకి దగ్గరలో ఉన్నాడు. ప్రస్తుతం 87 పరుగులతో క్రీజ్‌లో ఉన్నాడు విరాట్‌. అతనికి రవీంద్ర జడేజా 36 పరుగులతో తోడుగా ఉన్నాడు. విండీస్‌ బౌలర్లలో జాసన్ హోల్డర్‌, జోమెల్ వారికన్‌, కెమర్‌ రోచ్, షానన్ గాబ్రియల్ తలో వికెట్ తీశారు.  కోహ్లీ, రవీంద్ర జడేజా అద్భతమైన బ్యాటింగ్‌తో విండీస్ బౌలర్లను అడ్డుకున్నారు. ఆఖరిల సెషన్‌లో మరో వికెట్ పడకుండా జాగ్రత్త పడ్డారు. ఆ టైంలో వీళ్లు 33.2 బంతులు ఎదుర్కొని 106 పరుగులు చేశారు. మొత్తంగా మొదటి రోజు విండీస్‌ బౌల‌ర్లు 84 ఓవర్లు బౌల్ చేశారు. కోహ్లీ మొదటి బంతి నుంచి చాలా జాగ్రత్తగా ఆడుతున్నాడు. తొలి రన్ చేసేందుకు అతను 20 బంతులు ఎదుర్కోవాల్సి వచ్చింది. రెండో రోజు ఆలో విరాట్‌ 14 పరుగులు చేస్తే ఐదేళ్ల తర్వాత విదేశీ గడ్డపై సెంచరీ చేసినట్టు అవుతుంది. 2018 డిసెంబర్ నుంచి ఇప్పటి వరకు ఓవర్‌సీస్‌లో అతను సెంచరీ చేయలేదు.  కోహ్లీ క్రీజ్‌లోకి వచ్చినప్పటి నుంచి స్టంప్స్‌కు అవతలి వైపు నాల్గో స్టంప్‌ దిశగా విండీస్‌ బౌలర్లు బంతులు వేశారు. కోహ్లీ తరచూ ఈ బంతులను టచ్ చేసి అవుట్ అవ్వడం తెలిసిందే. విండీస్ బౌలర్లు అదే స్ట్రాటజీని ఇక్కడ ఫాలో అయ్యారు. అయితే కోహ్లీ చాలా చాకచక్యంగా ఆడి 86 పరుగులు సాధించారు.  ఉదయం సెషన్‌లో పరుగులు కాస్త వేగంగా వచ్చిన మధ్యాహ్నానికి పిచ్‌ స్వభావం పూర్తిగా మారిపోయింది. దీంతో పరుగులు రావడం కష్టమైపోయింది. మధ్యాహ్నం 24.4 ఓవర్లలో 61 పరుగులు మాత్రమే చేసింది. టీ విరామానికి రోహిత్, జైస్వాల్, శుభ్‌మన్ గిల్ (12 బంతుల్లో 10), అజింక్యా రహానే (36 బంతుల్లో 8) ఔట్‌ కావలసి వచ్చింది.  జైస్వాల్‌ని మొదటి స్లిప్‌లో కిర్క్ మెకెంజీ అద్బుతమైన క్యాచ్‌ పెవిలియన్ పంపించారు. ఆట ప్రారంభమైనప్పటి నుంచి ఆ యాంగిల్‌లో చాలా స్కోరు చేయగలిగాడు జైస్వాల్. దీంతో ఫీల్డింగా మార్చిన విండీస్... గల్లీ ఫీల్డర్‌ను వెనక్కి పంపించి తన వ్యూహాన్ని అమలు చేసింది. అనుకున్నట్టుగానే జైస్వాల్ దొరికిపోయి అవుట్ అయ్యాడు.  జైస్వాల్‌ వెళ్లిన తర్వాత వచ్చిన గిల్ మరోసారి నిరాశపరిచాడు. వరుసగా రెండో మ్యాచ్‌లో కూడా ఫెయిల్ అయ్యాడు. రోచ్ ఆఫ్ స్టంప్ బాల్స్ వేస్తూ గిల్‌కు ఉచ్చు బిగించాడు. ఓ గుడ్‌ లెంగ్త్‌ బాల్‌కు గిల్ దొరికిపోయాడు. కీపర్‌కు క్యాచ్ ఇచ్చి పెవిలియన్ చేరాడు. కాసేపటికే వారికన్ బౌలింగ్‌లో రోహిత్ ఔటయ్యాడు. రహానే (36 బంతుల్లో 8) గాబ్రియేల్‌కు చిక్కాడు. లంచ్ విరామానికి వికెట్లు నష్టపోకుండా 121 పరుగులు చేసిన టీమిండియా టీ బ్రేక్ సమాయానికి నాలుగు వికెట్లను కోల్పోయింది.  ఇరు జట్ల మధ్య జరుగుతున్న వంద టెస్టుకావడంతో భారత్, వెస్టిండీస్ కెప్టెన్‌లకు బ్రియాన్ లారా ప్రత్యేక జ్ఞాపికను అందజేశారు.","content":"India vs West Indies 2nd Test 1st Day: ట్రినిడాడ్‌లో వెస్టిండీస్‌తో జరుగుతున్న రెండో టెస్టు మ్యాచ్‌లో మొదటి రోజు టీమిండియా 288 పరుగులు చేసింది. నాలుగు వికెట్లను కోల్పోయింది. మరోసారి ఓపెనింగ్ బ్యాటర్లు కెప్టెన్ రోహిత్ శర్మ, జశ్వంత్‌ జైస్వాల్‌ అద్భుతంగా రాణించి జట్టుకు మంచి ఆరంభాన్ని అందించారు. రెండో టెస్టు మ్యాచ్ తొలి రోజు కెప్టెన్ రోహిత్ శర్మ 143 బంతులు ఎదుర్కొని 80 పరుగులు చేస్తే జైస్వాల్ 74 బంతుల్లో 57 పరుగులు చేశాడు. 500వ మ్యాచ్ ఆడుతున్న విరాట్ కోహ్లీ సెంచరీకి దగ్గరలో ఉన్నాడు. ప్రస్తుతం 87 పరుగులతో క్రీజ్‌లో ఉన్నాడు విరాట్‌. అతనికి రవీంద్ర జడేజా 36 పరుగులతో తోడుగా ఉన్నాడు. విండీస్‌ బౌలర్లలో జాసన్ హోల్డర్‌, జోమెల్ వారికన్‌, కెమర్‌ రోచ్, షానన్ గాబ్రియల్ తలో వికెట్ తీశారు. కోహ్లీ, రవీంద్ర జడేజా అద్భతమైన బ్యాటింగ్‌తో విండీస్ బౌలర్లను అడ్డుకున్నారు. ఆఖరిల సెషన్‌లో మరో వికెట్ పడకుండా జాగ్రత్త పడ్డారు. ఆ టైంలో వీళ్లు 33.2 బంతులు ఎదుర్కొని 106 పరుగులు చేశారు. మొత్తంగా మొదటి రోజు విండీస్‌ బౌల‌ర్లు 84 ఓవర్లు బౌల్ చేశారు. కోహ్లీ మొదటి బంతి నుంచి చాలా జాగ్రత్తగా ఆడుతున్నాడు. తొలి రన్ చేసేందుకు అతను 20 బంతులు ఎదుర్కోవాల్సి వచ్చింది. రెండో రోజు ఆలో విరాట్‌ 14 పరుగులు చేస్తే ఐదేళ్ల తర్వాత విదేశీ గడ్డపై సెంచరీ చేసినట్టు అవుతుంది. 2018 డిసెంబర్ నుంచి ఇప్పటి వరకు ఓవర్‌సీస్‌లో అతను సెంచరీ చేయలేదు. కోహ్లీ క్రీజ్‌లోకి వచ్చినప్పటి నుంచి స్టంప్స్‌కు అవతలి వైపు నాల్గో స్టంప్‌ దిశగా విండీస్‌ బౌలర్లు బంతులు వేశారు. కోహ్లీ తరచూ ఈ బంతులను టచ్ చేసి అవుట్ అవ్వడం తెలిసిందే. విండీస్ బౌలర్లు అదే స్ట్రాటజీని ఇక్కడ ఫాలో అయ్యారు. అయితే కోహ్లీ చాలా చాకచక్యంగా ఆడి 86 పరుగులు సాధించారు. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ఉదయం సెషన్‌లో పరుగులు కాస్త వేగంగా వచ్చిన మధ్యాహ్నానికి పిచ్‌ స్వభావం పూర్తిగా మారిపోయింది. దీంతో పరుగులు రావడం కష్టమైపోయింది. మధ్యాహ్నం 24.4 ఓవర్లలో 61 పరుగులు మాత్రమే చేసింది. టీ విరామానికి రోహిత్, జైస్వాల్, శుభ్‌మన్ గిల్ (12 బంతుల్లో 10), అజింక్యా రహానే (36 బంతుల్లో 8) ఔట్‌ కావలసి వచ్చింది. జైస్వాల్‌ని మొదటి స్లిప్‌లో కిర్క్ మెకెంజీ అద్బుతమైన క్యాచ్‌ పెవిలియన్ పంపించారు. ఆట ప్రారంభమైనప్పటి నుంచి ఆ యాంగిల్‌లో చాలా స్కోరు చేయగలిగాడు జైస్వాల్. దీంతో ఫీల్డింగా మార్చిన విండీస్... గల్లీ ఫీల్డర్‌ను వెనక్కి పంపించి తన వ్యూహాన్ని అమలు చేసింది. అనుకున్నట్టుగానే జైస్వాల్ దొరికిపోయి అవుట్ అయ్యాడు. జైస్వాల్‌ వెళ్లిన తర్వాత వచ్చిన గిల్ మరోసారి నిరాశపరిచాడు. వరుసగా రెండో మ్యాచ్‌లో కూడా ఫెయిల్ అయ్యాడు. రోచ్ ఆఫ్ స్టంప్ బాల్స్ వేస్తూ గిల్‌కు ఉచ్చు బిగించాడు. ఓ గుడ్‌ లెంగ్త్‌ బాల్‌కు గిల్ దొరికిపోయాడు. కీపర్‌కు క్యాచ్ ఇచ్చి పెవిలియన్ చేరాడు. కాసేపటికే వారికన్ బౌలింగ్‌లో రోహిత్ ఔటయ్యాడు. రహానే (36 బంతుల్లో 8) గాబ్రియేల్‌కు చిక్కాడు. లంచ్ విరామానికి వికెట్లు నష్టపోకుండా 121 పరుగులు చేసిన టీమిండియా టీ బ్రేక్ సమాయానికి నాలుగు వికెట్లను కోల్పోయింది. ఇరు జట్ల మధ్య జరుగుతున్న వంద టెస్టుకావడంతో భారత్, వెస్టిండీస్ కెప్టెన్‌లకు బ్రియాన్ లారా ప్రత్యేక జ్ఞాపికను అందజేశారు.","pubDate":"2023-07-21 00:37:35","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/21/9e9a1153326d0e79827b98404485bd8d1689899755317215_original.png","source_id":"abplive","category":["sports"],"country":["india"],"language":"Telugu"},{"title":"Old Thomians gear up for 2nd Annual Guru Cricket Bash","link":"https://www.ft.lk/sports/Old-Thomians-gear-up-for-2nd-Annual-Guru-Cricket-Bash/23-750872","keywords":null,"creator":null,"video_url":null,"description":null,"content":"At the height of the Second World War, 700 students at the prestigious S. Thomas’ College, Mount Lavinia, were suddenly displaced when the State ordered the closure of schools in Colombo. A blessing then came in the form of a 45-acre farm belonging to the de Saram family, hidden away in the frosty hills of Nuwara Eliya. Helmed by Oxford educationist Dr. R.L. Hayman, the College branched out from the coast to the central highlands. The history of S. Thomas’ College Gurutalawa (STCG) began here, in 1942, when it was declared open for students to continue their education during the war. 81 years later, the college has fostered numerous extracurricular activities that have bound several generations of its alumni in brotherhood. The annual Guru Cricket Bash is a testament to the college’s tight-knit fraternity united in its shared love of cricket. Launched in 2022, the event was conceptualised by the old boys of the class of 1984, also known as ‘The Prodigies’. The group also formed the STCG Brotherhood in 2021 and has been initiating reunions among the college’s old boys ever since. The first ‘Prodigy’ event of great magnitude, the Guru Cricket Bash, is a six-a-side cricket tournament where alumni of STCG compete for the Patrick Gunawardene Championship Trophy, fondly named after a beloved headmaster. The teams are formed by Old Thomians, based on their classes/batches. There are 18 registered teams who will be competing for the championship trophy this year. The Guru Cricket Bash will take place at the 5 Field Engineering Regiment Army Camp in Mattegoda, Polgasowita on 22 July. The organisers expect a considerable number of attendees. There will be a variety of entertainment activities and segments planned, including DJ music, papare bands, live bands, and dance crews. Additionally, PUB 84, a dedicated pub offering entertainment, will be open throughout the event. Morning snacks and lunch will be provided for all visitors. Furthermore, there will be vendors offering coffee, tea, ice cream, and snacks available for purchase at the grounds. The event is open to all STCG old Thomians and their families. It will begin at 8 a.m. and continue until 7 p.m. on 22 July.","pubDate":"2023-07-21 00:15:00","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Zak attack: Why Crawley is the model Bazball player","link":"https://www.smh.com.au/sport/cricket/an-itch-to-attack-why-zak-crawley-is-the-model-bazball-player-20230721-p5dq35.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"England’s opener Zak Crawley personifies Bazball, the risks involved and the rich payoff at Old Trafford in the fourth Test for sticking to it.","content":"In an interview before this Ashes series, Brendon McCullum pondered the prospect of a day when Zak Crawley went off with a big score. “Zak has a much stronger offensive game, and we believe in his ability to put opposition teams under pressure. Every now and then he’s going to get out. It can happen, but if he gets going ...” McCullum trailed off, as though not wanting to actually say the words . Zak Crawley blazed for England on day two of the fourth Test in Manchester. Credit: Reuters On day two at Old Trafford, as vital as any day of this series , Crawley did indeed get going. He is as much the key player for England in the Bazball era as Scott Hatteberg was in the film adaptation of Moneyball , the film about Billy Beane and the Oakland A’s. Hatteberg was a catcher turned into a first baseman because of his hitting ability, fitting him into a team that was fashioned into success from unpromising origins. Crawley, likewise, was shaping as something of a mediocrity before McCullum and Ben Stokes gave him permission to attack, using his height and power to put pressure on bowlers. It doesn’t always work, but as was seen on a sunny afternoon in Manchester, when it does the sky is the limit. For Crawley, the innings of 189 from 182 balls , including a thrilling 26-ball sprint from 50 to 100, was vindication for listening to McCullum and Stokes and doing what he does best, rather than trying to bat like his partner for 206 runs, the phlegmatic Joe Root. England were 4-384 at stumps, leading by 67. “It’s fair to say that under any other coach or captain I probably wouldn’t be playing this series,” Crawley said. “So, to be backed by them gives me a lot of confidence. They’ve always said not to worry about being consistent, just to go out and try to win games for England. “We chat a lot and he [McCullum] is really good at that, having those little conversations with you about playing. I understand what he means, I’m at my best when I’m putting them under pressure and attacking and so is he. “He maybe wasn’t the most consistent, but he played some incredible knocks and I think that’s what he wants from me. As long as they want that from me, I’m happy to take that punt at the top of the order.” Looking back to the 2021-22 Ashes series in Australia, Crawley offered moments of promise, not least at the SCG. But he was struggling to put it all together. “I was just trying to sit on bowlers and make them come to me and try and build an innings like that,” he said. “I found at this level you get so many good balls, especially at the top of the order, I was getting a couple of nice scores then getting out and it wasn’t really me. “I always felt an itch to attack a bit more and when you’re playing with such great players like Joe and Stokesy, you try and emulate them a lot, but there comes a point where you have to bat your own way as well. Just trying to be a bit more positive is more like me.” Crawley persisted in this mindset despite the frustrations of the first three Tests, including a pair of innings at Headingley where he threatened to go big, only to edge Mitch Marsh behind. “Those thoughts are always coming into your head,” he said of the doubts all batters face. “When I got out at Headingley I got a couple of nice knocks there but didn’t convert them, and I was thinking too much about the score rather than being immersed in the moment. Zak Crawley is bowled by Scott Boland at the SCG in 2022. Credit: AP “I was a lot more present today and I think that helped me go on and get a big score rather than worrying about getting a big score before you’re already there.” Overall, the effect of Crawley’s innings was not only to keep England in the Ashes despite an indifferent weather forecast for Manchester over the next three days, but also to underline that Bazball is the best way forward for this England side. “We’ve shown that being positive suits our players,” Crawley said. “At other times we absorb pressure but most of the time we try and put pressure back on them and get them thinking about what they’re doing rather than what we’re doing. “I feel like today was a really good day for that. And even yesterday [Chris] Woakes bowled so well and was putting pressure on them with the ball. It works with both bat and ball. We’ve played really well so far in this game over the last two days and hopefully we continue that in the next couple of days.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-21 00:03:32","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Trinity award seven ‘Lions’ for cricketers","link":"https://www.ft.lk/sports/Trinity-award-seven--Lions--for-cricketers/23-750871","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Trinity College awarded Cricket ‘Lions’ for their outstanding 7 of the under 19 cricket outfit which had a great school season during 2022/2023. Skipper, Rahal Amarasinghe, Manula Kularatne, Dinuka Thenekoon, Dinusha Peiris, Kusal Wijethunge, Theeraka Ranathunge and Tharana Wimaladharma won their cricket “Lion”. Theeraka and Manula represented the Under 19 national outfit tour to UAE. Meanwhile Jayavi Liyanagama, Supun Waduge, Janith Warunakula won cricket colours while Vibhawith Ehalapola was re-awarded with his cricket colours. (SJ)","pubDate":"2023-07-21 00:00:00","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"If I try to be consistent, I would not have days like these: England’s Crawley on century against Australia","link":"https://thenewsmill.com/2023/07/if-i-try-to-be-consistent-i-would-not-have-days-like-these-englands-crawley-on-century-against-australia/","keywords":["Cricket","Sports"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Following his massive hundred against Australia in the fourth Ashes Test at Old Trafford, England opener Zak Crawley said that though his high-risk approach as a batter has caused himself some self-doubt, he encourages himself to “be me” and added that he prefers a big, impactful knock after some low scores over being more consistent. Zak Crawley’s 189 and half-centuries by Joe Root and Moeen Ali provided 67 runs lead to England over Australia on the second day of the fourth Test match of the Ashes series here at Old Trafford Cricket Ground on Thursday. Right from the moment he launched the first delivery of the Ashes bowled by Aussie skipper Pat Cummins for four, Crawley has been repaying the faith shown by skipper Ben Stokes and coach Brendon McCullum during 2021 and 2022, when he battled patchy form and inconsistency. Stokes-McCullum backed him to come good and live up to his potential, often saying that his impactful innings at the top could prove match-winning and drive England’s ‘Bazball’ approach of cricket forward, which favours aggression, positivity and hunger for a win or a result at least. After scoring 173 in 16 innings at an average of around 10 in 2021 and 844 in 29 innings at an average of just above 30, Crawley has shown massive improvement this year. With 518 runs in 13 innings at an average of over 42, one century and two fifties, Crawley is having a great year in red-ball cricket so far. He is currently the highest run-scorer in this year’s Ashes. He has scored 385 runs in seven innings of four matches at an average of 55.00 with one century and one fifty. His runs have come at a strike rate of almost 90. These numbers have surely made the hard times worth enduring. “Today was a good day for us. We are in a good position as a team. It was good fun. I rode my luck at times but hit some good shots along the way. I do doubt myself at times but I have to say ‘keep being me’. That is the way I play. I am quite streaky but then I go on a run. They [coach and captain] tell me to go out and have an impact at the top of the order. Sometimes I am going to have streaks of a low scores, because I am taking a punt, but thankfully today it came off,” said Crawley as quoted by ESPNCricinfo to Sky Sports. Last summer when he was facing low scores, McCullum defended Crawley, saying that his “skillset is not to be a consistent cricketer”. Crawley feels that criticism over consistency is fair, but he would not have days like the one at Old Trafford if he chases consistency. “They do not want me to lose days like today. If I try to be more consistent, maybe I would not have a day like today. I much prefer this, a few low scores and then a big one. [Criticism] is definitely fair, because I have not been consistent, but I think I have shown that, at my best, I am good enough for this level. I was pleased with how it went. That was more my template,” said Crawley. Crawley’s aggression against Travis Head, Aussie’s part-time spinner without their frontline star Nathan Lyon and Cummins, who went for 93 runs in his 16 overs, was a major highlight of his knock. “It is definitely a conscious effort to take them down, because obviously they are great bowlers who are trying to rest [between spells]. When those bowlers come on, I think it is important to put them under pressure and so that does not give them time to rest and come back. I would try to bat time and build an innings like [Joe] Root or any of those guys up there, but it is much better when I put the bowler under a bit more pressure before they can get me. Sometimes it comes off, and sometimes it doesn’t,” he said. Despite his massive figures, his century did not look convincing to many as he inside-edged past his own stumps frequently for four and some shots just flew over the slips for four and looked close enough to be caught. Crawley feels that he has earned this luck. “I have had a lot of nicks over the slips this series. And actually, I do not think that is good luck. I have earned that luck. If you go harder, the ball goes over the slips. So I would rather err on that side then go negative,” he said. Crawley, who scored 267 against Pakistan in 2020 in a match played behind closed doors during the COVID-19 pandemic felt really happy to receive the applause from the crowd for the first time at home after a century. “The crowd were amazing. Obviously, I had not scored a hundred in England, apart from in Covid, so there was no one to clap me off there. But it is pretty cool to have the whole crowd clapping you off and the Aussies too, some great players there shook my hand, so that is pretty cool as well. It was an amazing feeling. You have a lot of low scores and bad form along the way. So days like today make it all worth it. I would not swap it for anything,” he said. When Crawley was at the crease, England racked up 178 runs in just 25 overs of the afternoon session. But once ball started to get older and softer, the innings got difficult for England. Both Root and Crawley lost their wickets to deliveries that kept low. “The ball definitely went soft. They were trying to change it a lot and it was definitely out of shape, which made it two-paced. Joe was so unlucky. That wicket was unplayable and even Stokesy had a couple of pop up at him and keep low. So it might be the oldness of the ball, but hopefully, it is the wicket, and hopefully, it keeps playing tricks and we bowl well [in the second innings],” said the opener. But before Australia, second innings, England has to build a lead and they could declare because the weather forecast for the weekend is not really promising. “I will leave that to the bosses up there. but if we can get another 130-140, it will be really good. It may be even just another 100, because it looks like it is going to be trickier out there at the back-end, so it could be a good chance to bowl tomorrow afternoon and hopefully get a few wickets,” he concluded. Coming to the match, after opting to field first, England bundled out Australia for 317 in the first innings. Australia had finished their first day on 299/8. James Anderson (1/51) and Chris Woakes (5/62) bundled out Australia early in the day. England in their first innings lost Ben Duckett for just one. Following this, Moeen (54) had a 121-run stand for the second wicket with Zak Crawley. Following Moeen’s dismissal, Crawley brought up his maiden Ashes ton and fourth overall in Tests. He also had a 206-run partnership for the third wicket with Joe Root before being dismissed for 189 off 182 balls, consisting of 21 fours and three sixes. Root was also dismissed soon for 84 off 95 balls, consisting of eight fours and a six. England ended the second day at 384/4, with skipper Ben Stokes (24*) and Harry Brook (14*) unbeaten. The hosts had a 67-run lead. (ANI)","pubDate":"2023-07-20 23:34:57","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Virat Kohli surpasses Jacques Kallis, becomes 5th highest run-scorer in international cricket","link":"https://thenewsmill.com/2023/07/virat-kohli-surpasses-jacques-kallis-becomes-5th-highest-run-scorer-in-international-cricket/","keywords":["Cricket","Sports"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Star India batter Virat Kohli on Friday surpassed South Africa’s Jacques Kallis to become the fifth-highest run-scorer in international cricket history. Kohli achieved this upward movement in the batting charts during India’s second Test against West Indies at Port of Spain. On the first day of the match, which is also his 500th international game, Virat ended unbeaten on 87 in 161 balls. His knocks included eight boundaries. The second day of the match could see Virat smashing his 76th international century and delivering the ‘Kohli Special’ fans have been waiting for. Currently in 500 matches, Virat has scored 25,548 runs at an average of 53.67. He has smashed 75 centuries and 132 half-centuries in 559 innings, with the best score of 254 onwards. Virat has overtaken Kallis’ tally of 25,534 runs in 519 matches, with 62 centuries and 149 fifties. He can add to this on day two of the match. Currently, ahead of Kohli are legends like Sri Lanka’s Mahela Jayawardene (25,957 runs in 652 matches), Ricky Ponting from Australia (27,483 runs in 560 matches), SL’s Kumar Sangakkara (28,016 runs in 594 matches) and Indian legendary cricketer Sachin Tendulkar (34,357 runs in 664 matches). In 111 Tests, Virat has scored 8642 runs at an average of 49.38. He has scored 28 centuries and 30 fifties so far in the longest format, with the best score of 254*. He is India’s fifth-highest run scorer in Tests. In 274 ODI matches, Virat has scored 12,898 runs at an average of 57.32. He has scored 46 centuries and 65 half-centuries. He is India’s second-highest run-scorer in ODI cricket. Overall, he is the fifth-highest-run scorer in ODI cricket. The veteran batter is the highest-run scorer in the T20I format in its history. In 115 matches, he has scored 4,008 runs at an average of 52.73. He has scored one century and 37 fifties in the format, with the best score of 122*. Coming to the match, a century partnership between Virat and Ravindra Jadeja brought back India into the game and Kohli is nearing his 29th Test century at the end of the first day of the second Test against West Indies in Port of Spain on Friday. At stumps, India was 288/4, with Virat (87*) and Jadeja (36*). India finished the first session at 121/0, with Rohit Sharma 63*, Yashasvi Jaiswal 52* unbeaten at the crease. But their partnership broke at 139 runs in the second session, with fall of Jaiswal for 57. Shubman Gill (10) and Rohit (80) fell in quick succession, leaving India at 155/3. Virat then took innings forward with vice-captain Ajinkya Rahane, who fell for eight on the final ball of the second session. India ended the second session at 182/4, with Virat (18*) unbeaten. WI elected to bowl first after winning the toss. (ANI)","pubDate":"2023-07-20 23:34:44","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Canadian cricketer Aaron Johnson shines at Global T20 Canada","link":"https://torontosun.com/sports/other-sports/canadian-cricketer-aaron-johnson-shines-at-global-t20-canada","keywords":["Other Sports","Sports"],"creator":["Richard Mauntah"],"video_url":null,"description":null,"content":"It’s a tournament where local players rub shoulders with the game’s biggest stars. And should one of the locals take a game over, it could propel him to new heights. Aaron Johnson is relatively new to the Canadian national team after spending much of his career playing in British Columbia. But his overall performance in the opening game of Global T20 Canada is one he won’t soon forget as he led the Brampton Wolves to a crushing win over the Mississauga Panthers in a weather-shortened match. After holding Mississauga to just 121 in their innings, the Wolves responded with 99 in just nine overs having lost just one wicket, more than enough of a run rate to win if the match had to be called early. Sure enough, darkening skies and the threat of lightning caused the umpires to put an early end to the day’s proceedings. Johnson also distinguished himself in the field, and while the catch he made may have been one he has taken many times, this one was against Chris Gayle at a time when the West Indian legend was just starting to heat up. But it was with the bat where Johnson became the star of the day, smashing three sixes and five fours for a total of 48 not out off just 26 balls. Only the skies prevented him from a much bigger total. If there’s a reason for this tournament to exist, it is for players such as Johnson. Test players have their pick of T20 tournaments in which to participate. Others have more limited options. For Canadians, this may be their only opportunity to impress to the point that other offers come their way. Johnson earned his way onto the Canadian national team last year. Born and raised in Jamaica, his family moved to Fort McMurray, Alta., late in his teens. His national team highlight came in a T20 international against Oman where he scored 109, a record for a Canadian batsman in the short format of the game. With Gayle on the bench, it was up to his Panthers teammates to put a decent total. Young Pakistan wicket keeper Azam Khan faced that challenge head on and flourished, scoring 65, including five fours and three sixes, two being majestic strikes with five overs remaining. “It was good for the team. The team needed it,” Khan said. “I clicked at the right moment.” The batting performance aside, the Kirachi native is enjoying his time in this part of the world. “It’s my first time in Canada and I’m loving it,” he said. “The people have been really supportive.” He did much of that damage alongside former Canadian team captain Navneet Dhaliwal, who scored 29, including the first maximum of the tournament. But four wickets from Logan van Beek, including that of Khan, and two wickets each from Chris Green and Jan Frylinck limited Mississauga. Green also contributed with a perfect throw to the wicket to cause another runout. The Wolves wasted no time in their chase. Usman Khan hit a six to open the innings on his way to a score of 12. Brampton also got a big performance from Mark Chapman, the New Zealand international originally from Hong Kong. Chapman scored 30 including three fours and a six. Bowling-wise, Mississauga captain Shoaib Malik had a tough day. In his two overs, he gave up 34 runs. Zahoor Khan took the only wicket. Global T20 Canada continues Friday with the Toronto Nationals facing the Vancouver Knights and the Surrey Jaguars taking the field for the first time against the Montreal Tigers. Logan van Beek ( Brampton Wolves) Age: 32 Country: Netherlands Career Highlight: In a 2023 World Cup qualifier against the West Indies in June, van Beek scored a world-record 30 runs in the tie-breaking Super Over then took two West Indian wickets to preserve the upset win. Check out our sports section for the latest news and analysis. Care for a wager? Head to our sports betting section for news and odds.","pubDate":"2023-07-20 23:31:29","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/07/0721-welcomecricket-scaled-e1689895652968.jpg?quality=100&strip=all","source_id":"torontosun","category":["sports"],"country":["canada"],"language":"english"},{"title":"Rohail to lead Pakistan Shaheens in Darwin series","link":"https://www.thenews.com.pk/print/1092530-rohail-to-lead-pakistan-shaheens-in-darwin-series","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: The Pakistan Cricket Board has appointed wicketkeeper-batter Rohail Nazir as the Pakistan Shaheens captain for the Top End T20 Series in Darwin, Australia, which is being organised by Northern Territory Cricket from 30 July to 6 August.Apart from the NTC side, NT Strike, and Pakistan...","content":"LAHORE: The Pakistan Cricket Board (PCB) has appointed wicketkeeper-batter Rohail Nazir as the Pakistan Shaheens captain for the Top End T20 Series in Darwin, Australia, which is being organised by Northern Territory Cricket (NTC) from 30 July to 6 August. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } } min-width: 336px; min-height: 280px; */ Apart from the NTC side, NT Strike, and Pakistan Shaheens, Australian Capitol Territory’s ACT Comets, Melbourne Stars, Melbourne Renegades and Papua New Guinea (PNG) will participate in the six-team tournament in a T20 format with the top-two sides progressing to the final. Afterwards, Shaheens will also play two 50-over matches against PNG and NT Strike on 8 and 9 August, respectively. The Darwin tour is part of the PCB’s policy to create opportunities for the emerging cricketers to play away cricket in different conditions against different oppositions across all formats. Rohail has played 33 first-class matches and has previously captained Pakistan Shaheens. He recently toured Zimbabwe where the Shaheens played two four-dayers and six 50-over matches in May. Pakistan Shaheens squad: Rohail Nazir (captain), Aaliyan Mahmood, Ali Asfand, Amir Hassan, Arafat Minhas, Azan Awais, Basit Ali, Faisal Akram, Mohammad Imran, Sajjad Ali, Mohammad Irfan Khan, Shamyl Hussain, Shawaiz Irfan, Syed Zeeshan Zameer and Wahaj Riaz.","pubDate":"2023-07-21 01:00:00","image_url":null,"source_id":"thenews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Slow progress in restoration of departmental teams","link":"https://www.thenews.com.pk/print/1092525-slow-progress-in-restoration-of-departmental-teams","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Only about a month is left before the domestic cricket season starts, but not a single departmental team has been announced officially so far.Pakistan PM Shehbaz Sharif, who is also patron in chief of PCB, lifted the ban on departmental sports last year. Pakistan first class cricket...","content":"KARACHI: Only about a month is left before the domestic cricket season starts, but not a single departmental team has been announced officially so far. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } } min-width: 336px; min-height: 280px; */ Pakistan PM Shehbaz Sharif, who is also patron in chief of PCB, lifted the ban on departmental sports last year. Pakistan first class cricket season starts in September. Eight departmental cricket teams will participate in the Quaid-e-Azam Trophy this year. Departmental teams which were abolished in 2019 and are to participate in domestic cricket after a gap of two years have not announced the establishment of their teams so far. Sources connected to the development of restoration of departmental cricket teams said that verbal agreement between the players and management of different departments have been completed but letters have not been issued so far. Sources said that one of the main reasons in the delay of the restoration of departmental cricket teams is the lack of approval of sports budget by the own departments. They said that contract letters and appointment letters would be issued in August, sources said. Sources explained that the sports budget of the departments is finalised and approved one to two months after the federal government budget. \"That's why there is delay in the establishment of cricket teams but all preparations have been completed,\" said a source. Sources said in August a number of departments would announce their cricket teams and officials. Sources further said that the change in the PCB’s hierarchy earlier this month and country’s political and economical circumstances are also the reason of sluggish pace in the restoration of departmental sports teams. But the departments sports officials are seriously working on this matter and holding talks with cricketers. A numbers of leading cricketers and emerging cricketers have been informally hired and details in this regard would emerge next month, sources said. Meanwhile, it was learnt that seven departmental teams have confirmed their participation in the Quaid-e-Azam Trophy.","pubDate":"2023-07-21 01:00:00","image_url":null,"source_id":"thenews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IND Vs WI Test: கோலி அபாரம்..ரோகித், ஜெய்ஷ்வால் அசத்தல்..மேற்கிந்திய தீவுகளுக்கு எதிரான டெஸ்டில் 288 ரன்கள் குவிப்பு","link":"https://tamil.abplive.com/sports/cricket/ind-vs-wi-2nd-test-india-in-control-with-kohli-rohit-jaiswal-s-fifties-on-day-1-ends-with-288-runs-130142","keywords":["கிரிக்கெட்"],"creator":["குலசேகரன் முனிரத்தினம்"],"video_url":null,"description":"மேற்கிந்திய தீவுகள் அணிக்கு எதிரான இரண்டாவது டெஸ்ட் போட்டியின் முதல் நாளில்,  இந்திய அணி 288 ரன்களை குவித்துள்ளது.  இந்திய அணி பேட்டிங்: போர்ட் ஆஃப் ஸ்பெயினில் நடைபெறும் போட்டியில் டாஸ் வென்ற மேற்கிந்திய தீவுகள் அணி, முதலில் பந்துவீச்சை தேர்வு செய்தது. இதையடுத்து களமிறங்கிய இந்திய அணியின் தொடக்க வீரர்களான கேப்டன் ரோகித் சர்மா மற்றும் ஜெய்ஷ்வால் ஆகியோர் அணிக்கு நல்ல தொடக்கம் அளித்தனர். ரோகித் சர்மா  அரைசதம் கடக்க, சக வீரரான ஜெய்ஷ்வாலும் அரைசதம் விளாசினார். இந்த கூட்டணி முதல் விக்கெட்டிற்கு 139 ரன்களை குவித்து இருந்தபோது, 57 ரன்கள் சேர்த்து இருந்த ஜெய்ஷ்வால் ஆட்டமிழந்தார். அவரை தொடர்ந்து வந்த சுப்மன் கில் வெறும் 10 ரன்களில் நடையை கட்டினார். பொறுப்புடன் விளையாடி வந்த ரோகித் சர்மா சதம் விளாசுவார் என எதிர்பார்க்கப்பட்டது. ஆனால், 80 ரன்கள் குவித்து இருந்தபோது அவர் வாரிகன் பந்துவீச்சில் ஆட்டமிழந்தார்.  கோலி அபாரம்: அவரை தொடர்ந்து ராகானேவும் 8 ரன்களில் பெவிலியன் திரும்பினார். இதனால் 182 ரன்களை சேர்ப்பதற்குள் 4 விக்கெட்டுகளை இழந்து இந்திய அணி திணறியது. இதையடுத்து, 5வது விக்கெட்டிற்கு ஜோடி சேர்ந்த கோலி மற்றும் ஜடேஜா பொறுப்புடன் விளையாடி ரன் சேர்த்து அணியை சரிவில் இருந்து மீட்டனர். கோலி அரைசதம் கடந்து அசத்தினார். இதனால், இந்திய அணி முதல் நாள் முடிவில் 4 விக்கெட்டுகளை இழந்து 288 ரன்களை சேர்த்துள்ளது. கோலி 87 ரன்களுடனும், ஜடேஜா 36 ரன்களுடன் களத்தில் உள்ளனர். மேற்கிந்திய தீவுகள் அணி சார்பில் கெமார் ரோச், கேப்ரியல், வாரிகன் மற்றும் ஹோல்டர் ஆகியோர் தலா ஒரு விக்கெட்டை வீழ்த்தினர்.","content":"மேற்கிந்திய தீவுகள் அணிக்கு எதிரான இரண்டாவது டெஸ்ட் போட்டியின் முதல் நாளில், இந்திய அணி 288 ரன்களை குவித்துள்ளது. இந்திய அணி பேட்டிங்: போர்ட் ஆஃப் ஸ்பெயினில் நடைபெறும் போட்டியில் டாஸ் வென்ற மேற்கிந்திய தீவுகள் அணி, முதலில் பந்துவீச்சை தேர்வு செய்தது. இதையடுத்து களமிறங்கிய இந்திய அணியின் தொடக்க வீரர்களான கேப்டன் ரோகித் சர்மா மற்றும் ஜெய்ஷ்வால் ஆகியோர் அணிக்கு நல்ல தொடக்கம் அளித்தனர். ரோகித் சர்மா அரைசதம் கடக்க, சக வீரரான ஜெய்ஷ்வாலும் அரைசதம் விளாசினார். இந்த கூட்டணி முதல் விக்கெட்டிற்கு 139 ரன்களை குவித்து இருந்தபோது, 57 ரன்கள் சேர்த்து இருந்த ஜெய்ஷ்வால் ஆட்டமிழந்தார். அவரை தொடர்ந்து வந்த சுப்மன் கில் வெறும் 10 ரன்களில் நடையை கட்டினார். பொறுப்புடன் விளையாடி வந்த ரோகித் சர்மா சதம் விளாசுவார் என எதிர்பார்க்கப்பட்டது. ஆனால், 80 ரன்கள் குவித்து இருந்தபோது அவர் வாரிகன் பந்துவீச்சில் ஆட்டமிழந்தார். கோலி அபாரம்: googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); அவரை தொடர்ந்து ராகானேவும் 8 ரன்களில் பெவிலியன் திரும்பினார். இதனால் 182 ரன்களை சேர்ப்பதற்குள் 4 விக்கெட்டுகளை இழந்து இந்திய அணி திணறியது. இதையடுத்து, 5வது விக்கெட்டிற்கு ஜோடி சேர்ந்த கோலி மற்றும் ஜடேஜா பொறுப்புடன் விளையாடி ரன் சேர்த்து அணியை சரிவில் இருந்து மீட்டனர். கோலி அரைசதம் கடந்து அசத்தினார். இதனால், இந்திய அணி முதல் நாள் முடிவில் 4 விக்கெட்டுகளை இழந்து 288 ரன்களை சேர்த்துள்ளது. கோலி 87 ரன்களுடனும், ஜடேஜா 36 ரன்களுடன் களத்தில் உள்ளனர். மேற்கிந்திய தீவுகள் அணி சார்பில் கெமார் ரோச், கேப்ரியல், வாரிகன் மற்றும் ஹோல்டர் ஆகியோர் தலா ஒரு விக்கெட்டை வீழ்த்தினர்.","pubDate":"2023-07-21 00:49:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/21/f8d8d0b464c6e58ed3c9218053bfa65c1689884721398344_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Tamil"},{"title":"IND vs WI: రాణించిన రోహిత్‌, జైస్వాల్, కోహ్లీ- రెండో టెస్టులో మొదటి రోజు 288 పరుగులు చేసిన టీమిండియా","link":"https://telugu.abplive.com/sports/cricket/ind-vs-wi-2nd-test-1st-day-hilights-team-india-score-288-runs-virat-kohli-half-century-rohit-sharma-trinidad-105604","keywords":["క్రికెట్"],"creator":["ABP Desam"],"video_url":null,"description":"India vs West Indies 2nd Test 1st Day: ట్రినిడాడ్‌లో వెస్టిండీస్‌తో జరుగుతున్న రెండో టెస్టు మ్యాచ్‌లో మొదటి రోజు టీమిండియా 288 పరుగులు చేసింది. నాలుగు వికెట్లను కోల్పోయింది. మరోసారి ఓపెనింగ్ బ్యాటర్లు కెప్టెన్ రోహిత్ శర్మ, జశ్వంత్‌ జైస్వాల్‌ అద్భుతంగా రాణించి జట్టుకు మంచి ఆరంభాన్ని అందించారు.  రెండో టెస్టు మ్యాచ్ తొలి రోజు కెప్టెన్ రోహిత్ శర్మ 143 బంతులు ఎదుర్కొని 80 పరుగులు చేస్తే జైస్వాల్ 74 బంతుల్లో 57 పరుగులు చేశాడు. 500వ మ్యాచ్ ఆడుతున్న విరాట్ కోహ్లీ సెంచరీకి దగ్గరలో ఉన్నాడు. ప్రస్తుతం 87 పరుగులతో క్రీజ్‌లో ఉన్నాడు విరాట్‌. అతనికి రవీంద్ర జడేజా 36 పరుగులతో తోడుగా ఉన్నాడు. విండీస్‌ బౌలర్లలో జాసన్ హోల్డర్‌, జోమెల్ వారికన్‌, కెమర్‌ రోచ్, షానన్ గాబ్రియల్ తలో వికెట్ తీశారు.  కోహ్లీ, రవీంద్ర జడేజా అద్భతమైన బ్యాటింగ్‌తో విండీస్ బౌలర్లను అడ్డుకున్నారు. ఆఖరిల సెషన్‌లో మరో వికెట్ పడకుండా జాగ్రత్త పడ్డారు. ఆ టైంలో వీళ్లు 33.2 బంతులు ఎదుర్కొని 106 పరుగులు చేశారు. మొత్తంగా మొదటి రోజు విండీస్‌ బౌల‌ర్లు 84 ఓవర్లు బౌల్ చేశారు. కోహ్లీ మొదటి బంతి నుంచి చాలా జాగ్రత్తగా ఆడుతున్నాడు. తొలి రన్ చేసేందుకు అతను 20 బంతులు ఎదుర్కోవాల్సి వచ్చింది. రెండో రోజు ఆలో విరాట్‌ 14 పరుగులు చేస్తే ఐదేళ్ల తర్వాత విదేశీ గడ్డపై సెంచరీ చేసినట్టు అవుతుంది. 2018 డిసెంబర్ నుంచి ఇప్పటి వరకు ఓవర్‌సీస్‌లో అతను సెంచరీ చేయలేదు.  కోహ్లీ క్రీజ్‌లోకి వచ్చినప్పటి నుంచి స్టంప్స్‌కు అవతలి వైపు నాల్గో స్టంప్‌ దిశగా విండీస్‌ బౌలర్లు బంతులు వేశారు. కోహ్లీ తరచూ ఈ బంతులను టచ్ చేసి అవుట్ అవ్వడం తెలిసిందే. విండీస్ బౌలర్లు అదే స్ట్రాటజీని ఇక్కడ ఫాలో అయ్యారు. అయితే కోహ్లీ చాలా చాకచక్యంగా ఆడి 86 పరుగులు సాధించారు.  ఉదయం సెషన్‌లో పరుగులు కాస్త వేగంగా వచ్చిన మధ్యాహ్నానికి పిచ్‌ స్వభావం పూర్తిగా మారిపోయింది. దీంతో పరుగులు రావడం కష్టమైపోయింది. మధ్యాహ్నం 24.4 ఓవర్లలో 61 పరుగులు మాత్రమే చేసింది. టీ విరామానికి రోహిత్, జైస్వాల్, శుభ్‌మన్ గిల్ (12 బంతుల్లో 10), అజింక్యా రహానే (36 బంతుల్లో 8) ఔట్‌ కావలసి వచ్చింది.  జైస్వాల్‌ని మొదటి స్లిప్‌లో కిర్క్ మెకెంజీ అద్బుతమైన క్యాచ్‌ పెవిలియన్ పంపించారు. ఆట ప్రారంభమైనప్పటి నుంచి ఆ యాంగిల్‌లో చాలా స్కోరు చేయగలిగాడు జైస్వాల్. దీంతో ఫీల్డింగా మార్చిన విండీస్... గల్లీ ఫీల్డర్‌ను వెనక్కి పంపించి తన వ్యూహాన్ని అమలు చేసింది. అనుకున్నట్టుగానే జైస్వాల్ దొరికిపోయి అవుట్ అయ్యాడు.  జైస్వాల్‌ వెళ్లిన తర్వాత వచ్చిన గిల్ మరోసారి నిరాశపరిచాడు. వరుసగా రెండో మ్యాచ్‌లో కూడా ఫెయిల్ అయ్యాడు. రోచ్ ఆఫ్ స్టంప్ బాల్స్ వేస్తూ గిల్‌కు ఉచ్చు బిగించాడు. ఓ గుడ్‌ లెంగ్త్‌ బాల్‌కు గిల్ దొరికిపోయాడు. కీపర్‌కు క్యాచ్ ఇచ్చి పెవిలియన్ చేరాడు. కాసేపటికే వారికన్ బౌలింగ్‌లో రోహిత్ ఔటయ్యాడు. రహానే (36 బంతుల్లో 8) గాబ్రియేల్‌కు చిక్కాడు. లంచ్ విరామానికి వికెట్లు నష్టపోకుండా 121 పరుగులు చేసిన టీమిండియా టీ బ్రేక్ సమాయానికి నాలుగు వికెట్లను కోల్పోయింది.  ఇరు జట్ల మధ్య జరుగుతున్న వంద టెస్టుకావడంతో భారత్, వెస్టిండీస్ కెప్టెన్‌లకు బ్రియాన్ లారా ప్రత్యేక జ్ఞాపికను అందజేశారు.","content":"India vs West Indies 2nd Test 1st Day: ట్రినిడాడ్‌లో వెస్టిండీస్‌తో జరుగుతున్న రెండో టెస్టు మ్యాచ్‌లో మొదటి రోజు టీమిండియా 288 పరుగులు చేసింది. నాలుగు వికెట్లను కోల్పోయింది. మరోసారి ఓపెనింగ్ బ్యాటర్లు కెప్టెన్ రోహిత్ శర్మ, జశ్వంత్‌ జైస్వాల్‌ అద్భుతంగా రాణించి జట్టుకు మంచి ఆరంభాన్ని అందించారు. రెండో టెస్టు మ్యాచ్ తొలి రోజు కెప్టెన్ రోహిత్ శర్మ 143 బంతులు ఎదుర్కొని 80 పరుగులు చేస్తే జైస్వాల్ 74 బంతుల్లో 57 పరుగులు చేశాడు. 500వ మ్యాచ్ ఆడుతున్న విరాట్ కోహ్లీ సెంచరీకి దగ్గరలో ఉన్నాడు. ప్రస్తుతం 87 పరుగులతో క్రీజ్‌లో ఉన్నాడు విరాట్‌. అతనికి రవీంద్ర జడేజా 36 పరుగులతో తోడుగా ఉన్నాడు. విండీస్‌ బౌలర్లలో జాసన్ హోల్డర్‌, జోమెల్ వారికన్‌, కెమర్‌ రోచ్, షానన్ గాబ్రియల్ తలో వికెట్ తీశారు. కోహ్లీ, రవీంద్ర జడేజా అద్భతమైన బ్యాటింగ్‌తో విండీస్ బౌలర్లను అడ్డుకున్నారు. ఆఖరిల సెషన్‌లో మరో వికెట్ పడకుండా జాగ్రత్త పడ్డారు. ఆ టైంలో వీళ్లు 33.2 బంతులు ఎదుర్కొని 106 పరుగులు చేశారు. మొత్తంగా మొదటి రోజు విండీస్‌ బౌల‌ర్లు 84 ఓవర్లు బౌల్ చేశారు. కోహ్లీ మొదటి బంతి నుంచి చాలా జాగ్రత్తగా ఆడుతున్నాడు. తొలి రన్ చేసేందుకు అతను 20 బంతులు ఎదుర్కోవాల్సి వచ్చింది. రెండో రోజు ఆలో విరాట్‌ 14 పరుగులు చేస్తే ఐదేళ్ల తర్వాత విదేశీ గడ్డపై సెంచరీ చేసినట్టు అవుతుంది. 2018 డిసెంబర్ నుంచి ఇప్పటి వరకు ఓవర్‌సీస్‌లో అతను సెంచరీ చేయలేదు. కోహ్లీ క్రీజ్‌లోకి వచ్చినప్పటి నుంచి స్టంప్స్‌కు అవతలి వైపు నాల్గో స్టంప్‌ దిశగా విండీస్‌ బౌలర్లు బంతులు వేశారు. కోహ్లీ తరచూ ఈ బంతులను టచ్ చేసి అవుట్ అవ్వడం తెలిసిందే. విండీస్ బౌలర్లు అదే స్ట్రాటజీని ఇక్కడ ఫాలో అయ్యారు. అయితే కోహ్లీ చాలా చాకచక్యంగా ఆడి 86 పరుగులు సాధించారు. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ఉదయం సెషన్‌లో పరుగులు కాస్త వేగంగా వచ్చిన మధ్యాహ్నానికి పిచ్‌ స్వభావం పూర్తిగా మారిపోయింది. దీంతో పరుగులు రావడం కష్టమైపోయింది. మధ్యాహ్నం 24.4 ఓవర్లలో 61 పరుగులు మాత్రమే చేసింది. టీ విరామానికి రోహిత్, జైస్వాల్, శుభ్‌మన్ గిల్ (12 బంతుల్లో 10), అజింక్యా రహానే (36 బంతుల్లో 8) ఔట్‌ కావలసి వచ్చింది. జైస్వాల్‌ని మొదటి స్లిప్‌లో కిర్క్ మెకెంజీ అద్బుతమైన క్యాచ్‌ పెవిలియన్ పంపించారు. ఆట ప్రారంభమైనప్పటి నుంచి ఆ యాంగిల్‌లో చాలా స్కోరు చేయగలిగాడు జైస్వాల్. దీంతో ఫీల్డింగా మార్చిన విండీస్... గల్లీ ఫీల్డర్‌ను వెనక్కి పంపించి తన వ్యూహాన్ని అమలు చేసింది. అనుకున్నట్టుగానే జైస్వాల్ దొరికిపోయి అవుట్ అయ్యాడు. జైస్వాల్‌ వెళ్లిన తర్వాత వచ్చిన గిల్ మరోసారి నిరాశపరిచాడు. వరుసగా రెండో మ్యాచ్‌లో కూడా ఫెయిల్ అయ్యాడు. రోచ్ ఆఫ్ స్టంప్ బాల్స్ వేస్తూ గిల్‌కు ఉచ్చు బిగించాడు. ఓ గుడ్‌ లెంగ్త్‌ బాల్‌కు గిల్ దొరికిపోయాడు. కీపర్‌కు క్యాచ్ ఇచ్చి పెవిలియన్ చేరాడు. కాసేపటికే వారికన్ బౌలింగ్‌లో రోహిత్ ఔటయ్యాడు. రహానే (36 బంతుల్లో 8) గాబ్రియేల్‌కు చిక్కాడు. లంచ్ విరామానికి వికెట్లు నష్టపోకుండా 121 పరుగులు చేసిన టీమిండియా టీ బ్రేక్ సమాయానికి నాలుగు వికెట్లను కోల్పోయింది. ఇరు జట్ల మధ్య జరుగుతున్న వంద టెస్టుకావడంతో భారత్, వెస్టిండీస్ కెప్టెన్‌లకు బ్రియాన్ లారా ప్రత్యేక జ్ఞాపికను అందజేశారు.","pubDate":"2023-07-21 00:37:35","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/21/9e9a1153326d0e79827b98404485bd8d1689899755317215_original.png","source_id":"abplive","category":["sports"],"country":["india"],"language":"Telugu"},{"title":"Old Thomians gear up for 2nd Annual Guru Cricket Bash","link":"https://www.ft.lk/sports/Old-Thomians-gear-up-for-2nd-Annual-Guru-Cricket-Bash/23-750872","keywords":null,"creator":null,"video_url":null,"description":null,"content":"At the height of the Second World War, 700 students at the prestigious S. Thomas’ College, Mount Lavinia, were suddenly displaced when the State ordered the closure of schools in Colombo. A blessing then came in the form of a 45-acre farm belonging to the de Saram family, hidden away in the frosty hills of Nuwara Eliya. Helmed by Oxford educationist Dr. R.L. Hayman, the College branched out from the coast to the central highlands. The history of S. Thomas’ College Gurutalawa (STCG) began here, in 1942, when it was declared open for students to continue their education during the war. 81 years later, the college has fostered numerous extracurricular activities that have bound several generations of its alumni in brotherhood. The annual Guru Cricket Bash is a testament to the college’s tight-knit fraternity united in its shared love of cricket. Launched in 2022, the event was conceptualised by the old boys of the class of 1984, also known as ‘The Prodigies’. The group also formed the STCG Brotherhood in 2021 and has been initiating reunions among the college’s old boys ever since. The first ‘Prodigy’ event of great magnitude, the Guru Cricket Bash, is a six-a-side cricket tournament where alumni of STCG compete for the Patrick Gunawardene Championship Trophy, fondly named after a beloved headmaster. The teams are formed by Old Thomians, based on their classes/batches. There are 18 registered teams who will be competing for the championship trophy this year. The Guru Cricket Bash will take place at the 5 Field Engineering Regiment Army Camp in Mattegoda, Polgasowita on 22 July. The organisers expect a considerable number of attendees. There will be a variety of entertainment activities and segments planned, including DJ music, papare bands, live bands, and dance crews. Additionally, PUB 84, a dedicated pub offering entertainment, will be open throughout the event. Morning snacks and lunch will be provided for all visitors. Furthermore, there will be vendors offering coffee, tea, ice cream, and snacks available for purchase at the grounds. The event is open to all STCG old Thomians and their families. It will begin at 8 a.m. and continue until 7 p.m. on 22 July.","pubDate":"2023-07-21 00:15:00","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Zak attack: Why Crawley is the model Bazball player","link":"https://www.smh.com.au/sport/cricket/an-itch-to-attack-why-zak-crawley-is-the-model-bazball-player-20230721-p5dq35.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"England’s opener Zak Crawley personifies Bazball, the risks involved and the rich payoff at Old Trafford in the fourth Test for sticking to it.","content":"In an interview before this Ashes series, Brendon McCullum pondered the prospect of a day when Zak Crawley went off with a big score. “Zak has a much stronger offensive game, and we believe in his ability to put opposition teams under pressure. Every now and then he’s going to get out. It can happen, but if he gets going ...” McCullum trailed off, as though not wanting to actually say the words . Zak Crawley blazed for England on day two of the fourth Test in Manchester. Credit: Reuters On day two at Old Trafford, as vital as any day of this series , Crawley did indeed get going. He is as much the key player for England in the Bazball era as Scott Hatteberg was in the film adaptation of Moneyball , the film about Billy Beane and the Oakland A’s. Hatteberg was a catcher turned into a first baseman because of his hitting ability, fitting him into a team that was fashioned into success from unpromising origins. Crawley, likewise, was shaping as something of a mediocrity before McCullum and Ben Stokes gave him permission to attack, using his height and power to put pressure on bowlers. It doesn’t always work, but as was seen on a sunny afternoon in Manchester, when it does the sky is the limit. For Crawley, the innings of 189 from 182 balls , including a thrilling 26-ball sprint from 50 to 100, was vindication for listening to McCullum and Stokes and doing what he does best, rather than trying to bat like his partner for 206 runs, the phlegmatic Joe Root. England were 4-384 at stumps, leading by 67. “It’s fair to say that under any other coach or captain I probably wouldn’t be playing this series,” Crawley said. “So, to be backed by them gives me a lot of confidence. They’ve always said not to worry about being consistent, just to go out and try to win games for England. “We chat a lot and he [McCullum] is really good at that, having those little conversations with you about playing. I understand what he means, I’m at my best when I’m putting them under pressure and attacking and so is he. “He maybe wasn’t the most consistent, but he played some incredible knocks and I think that’s what he wants from me. As long as they want that from me, I’m happy to take that punt at the top of the order.” Looking back to the 2021-22 Ashes series in Australia, Crawley offered moments of promise, not least at the SCG. But he was struggling to put it all together. “I was just trying to sit on bowlers and make them come to me and try and build an innings like that,” he said. “I found at this level you get so many good balls, especially at the top of the order, I was getting a couple of nice scores then getting out and it wasn’t really me. “I always felt an itch to attack a bit more and when you’re playing with such great players like Joe and Stokesy, you try and emulate them a lot, but there comes a point where you have to bat your own way as well. Just trying to be a bit more positive is more like me.” Crawley persisted in this mindset despite the frustrations of the first three Tests, including a pair of innings at Headingley where he threatened to go big, only to edge Mitch Marsh behind. “Those thoughts are always coming into your head,” he said of the doubts all batters face. “When I got out at Headingley I got a couple of nice knocks there but didn’t convert them, and I was thinking too much about the score rather than being immersed in the moment. Zak Crawley is bowled by Scott Boland at the SCG in 2022. Credit: AP “I was a lot more present today and I think that helped me go on and get a big score rather than worrying about getting a big score before you’re already there.” Overall, the effect of Crawley’s innings was not only to keep England in the Ashes despite an indifferent weather forecast for Manchester over the next three days, but also to underline that Bazball is the best way forward for this England side. “We’ve shown that being positive suits our players,” Crawley said. “At other times we absorb pressure but most of the time we try and put pressure back on them and get them thinking about what they’re doing rather than what we’re doing. “I feel like today was a really good day for that. And even yesterday [Chris] Woakes bowled so well and was putting pressure on them with the ball. It works with both bat and ball. We’ve played really well so far in this game over the last two days and hopefully we continue that in the next couple of days.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-21 00:03:32","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Trinity award seven ‘Lions’ for cricketers","link":"https://www.ft.lk/sports/Trinity-award-seven--Lions--for-cricketers/23-750871","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Trinity College awarded Cricket ‘Lions’ for their outstanding 7 of the under 19 cricket outfit which had a great school season during 2022/2023. Skipper, Rahal Amarasinghe, Manula Kularatne, Dinuka Thenekoon, Dinusha Peiris, Kusal Wijethunge, Theeraka Ranathunge and Tharana Wimaladharma won their cricket “Lion”. Theeraka and Manula represented the Under 19 national outfit tour to UAE. Meanwhile Jayavi Liyanagama, Supun Waduge, Janith Warunakula won cricket colours while Vibhawith Ehalapola was re-awarded with his cricket colours. (SJ)","pubDate":"2023-07-21 00:00:00","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"If I try to be consistent, I would not have days like these: England’s Crawley on century against Australia","link":"https://thenewsmill.com/2023/07/if-i-try-to-be-consistent-i-would-not-have-days-like-these-englands-crawley-on-century-against-australia/","keywords":["Cricket","Sports"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Following his massive hundred against Australia in the fourth Ashes Test at Old Trafford, England opener Zak Crawley said that though his high-risk approach as a batter has caused himself some self-doubt, he encourages himself to “be me” and added that he prefers a big, impactful knock after some low scores over being more consistent. Zak Crawley’s 189 and half-centuries by Joe Root and Moeen Ali provided 67 runs lead to England over Australia on the second day of the fourth Test match of the Ashes series here at Old Trafford Cricket Ground on Thursday. Right from the moment he launched the first delivery of the Ashes bowled by Aussie skipper Pat Cummins for four, Crawley has been repaying the faith shown by skipper Ben Stokes and coach Brendon McCullum during 2021 and 2022, when he battled patchy form and inconsistency. Stokes-McCullum backed him to come good and live up to his potential, often saying that his impactful innings at the top could prove match-winning and drive England’s ‘Bazball’ approach of cricket forward, which favours aggression, positivity and hunger for a win or a result at least. After scoring 173 in 16 innings at an average of around 10 in 2021 and 844 in 29 innings at an average of just above 30, Crawley has shown massive improvement this year. With 518 runs in 13 innings at an average of over 42, one century and two fifties, Crawley is having a great year in red-ball cricket so far. He is currently the highest run-scorer in this year’s Ashes. He has scored 385 runs in seven innings of four matches at an average of 55.00 with one century and one fifty. His runs have come at a strike rate of almost 90. These numbers have surely made the hard times worth enduring. “Today was a good day for us. We are in a good position as a team. It was good fun. I rode my luck at times but hit some good shots along the way. I do doubt myself at times but I have to say ‘keep being me’. That is the way I play. I am quite streaky but then I go on a run. They [coach and captain] tell me to go out and have an impact at the top of the order. Sometimes I am going to have streaks of a low scores, because I am taking a punt, but thankfully today it came off,” said Crawley as quoted by ESPNCricinfo to Sky Sports. Last summer when he was facing low scores, McCullum defended Crawley, saying that his “skillset is not to be a consistent cricketer”. Crawley feels that criticism over consistency is fair, but he would not have days like the one at Old Trafford if he chases consistency. “They do not want me to lose days like today. If I try to be more consistent, maybe I would not have a day like today. I much prefer this, a few low scores and then a big one. [Criticism] is definitely fair, because I have not been consistent, but I think I have shown that, at my best, I am good enough for this level. I was pleased with how it went. That was more my template,” said Crawley. Crawley’s aggression against Travis Head, Aussie’s part-time spinner without their frontline star Nathan Lyon and Cummins, who went for 93 runs in his 16 overs, was a major highlight of his knock. “It is definitely a conscious effort to take them down, because obviously they are great bowlers who are trying to rest [between spells]. When those bowlers come on, I think it is important to put them under pressure and so that does not give them time to rest and come back. I would try to bat time and build an innings like [Joe] Root or any of those guys up there, but it is much better when I put the bowler under a bit more pressure before they can get me. Sometimes it comes off, and sometimes it doesn’t,” he said. Despite his massive figures, his century did not look convincing to many as he inside-edged past his own stumps frequently for four and some shots just flew over the slips for four and looked close enough to be caught. Crawley feels that he has earned this luck. “I have had a lot of nicks over the slips this series. And actually, I do not think that is good luck. I have earned that luck. If you go harder, the ball goes over the slips. So I would rather err on that side then go negative,” he said. Crawley, who scored 267 against Pakistan in 2020 in a match played behind closed doors during the COVID-19 pandemic felt really happy to receive the applause from the crowd for the first time at home after a century. “The crowd were amazing. Obviously, I had not scored a hundred in England, apart from in Covid, so there was no one to clap me off there. But it is pretty cool to have the whole crowd clapping you off and the Aussies too, some great players there shook my hand, so that is pretty cool as well. It was an amazing feeling. You have a lot of low scores and bad form along the way. So days like today make it all worth it. I would not swap it for anything,” he said. When Crawley was at the crease, England racked up 178 runs in just 25 overs of the afternoon session. But once ball started to get older and softer, the innings got difficult for England. Both Root and Crawley lost their wickets to deliveries that kept low. “The ball definitely went soft. They were trying to change it a lot and it was definitely out of shape, which made it two-paced. Joe was so unlucky. That wicket was unplayable and even Stokesy had a couple of pop up at him and keep low. So it might be the oldness of the ball, but hopefully, it is the wicket, and hopefully, it keeps playing tricks and we bowl well [in the second innings],” said the opener. But before Australia, second innings, England has to build a lead and they could declare because the weather forecast for the weekend is not really promising. “I will leave that to the bosses up there. but if we can get another 130-140, it will be really good. It may be even just another 100, because it looks like it is going to be trickier out there at the back-end, so it could be a good chance to bowl tomorrow afternoon and hopefully get a few wickets,” he concluded. Coming to the match, after opting to field first, England bundled out Australia for 317 in the first innings. Australia had finished their first day on 299/8. James Anderson (1/51) and Chris Woakes (5/62) bundled out Australia early in the day. England in their first innings lost Ben Duckett for just one. Following this, Moeen (54) had a 121-run stand for the second wicket with Zak Crawley. Following Moeen’s dismissal, Crawley brought up his maiden Ashes ton and fourth overall in Tests. He also had a 206-run partnership for the third wicket with Joe Root before being dismissed for 189 off 182 balls, consisting of 21 fours and three sixes. Root was also dismissed soon for 84 off 95 balls, consisting of eight fours and a six. England ended the second day at 384/4, with skipper Ben Stokes (24*) and Harry Brook (14*) unbeaten. The hosts had a 67-run lead. (ANI)","pubDate":"2023-07-20 23:34:57","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Virat Kohli surpasses Jacques Kallis, becomes 5th highest run-scorer in international cricket","link":"https://thenewsmill.com/2023/07/virat-kohli-surpasses-jacques-kallis-becomes-5th-highest-run-scorer-in-international-cricket/","keywords":["Cricket","Sports"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Star India batter Virat Kohli on Friday surpassed South Africa’s Jacques Kallis to become the fifth-highest run-scorer in international cricket history. Kohli achieved this upward movement in the batting charts during India’s second Test against West Indies at Port of Spain. On the first day of the match, which is also his 500th international game, Virat ended unbeaten on 87 in 161 balls. His knocks included eight boundaries. The second day of the match could see Virat smashing his 76th international century and delivering the ‘Kohli Special’ fans have been waiting for. Currently in 500 matches, Virat has scored 25,548 runs at an average of 53.67. He has smashed 75 centuries and 132 half-centuries in 559 innings, with the best score of 254 onwards. Virat has overtaken Kallis’ tally of 25,534 runs in 519 matches, with 62 centuries and 149 fifties. He can add to this on day two of the match. Currently, ahead of Kohli are legends like Sri Lanka’s Mahela Jayawardene (25,957 runs in 652 matches), Ricky Ponting from Australia (27,483 runs in 560 matches), SL’s Kumar Sangakkara (28,016 runs in 594 matches) and Indian legendary cricketer Sachin Tendulkar (34,357 runs in 664 matches). In 111 Tests, Virat has scored 8642 runs at an average of 49.38. He has scored 28 centuries and 30 fifties so far in the longest format, with the best score of 254*. He is India’s fifth-highest run scorer in Tests. In 274 ODI matches, Virat has scored 12,898 runs at an average of 57.32. He has scored 46 centuries and 65 half-centuries. He is India’s second-highest run-scorer in ODI cricket. Overall, he is the fifth-highest-run scorer in ODI cricket. The veteran batter is the highest-run scorer in the T20I format in its history. In 115 matches, he has scored 4,008 runs at an average of 52.73. He has scored one century and 37 fifties in the format, with the best score of 122*. Coming to the match, a century partnership between Virat and Ravindra Jadeja brought back India into the game and Kohli is nearing his 29th Test century at the end of the first day of the second Test against West Indies in Port of Spain on Friday. At stumps, India was 288/4, with Virat (87*) and Jadeja (36*). India finished the first session at 121/0, with Rohit Sharma 63*, Yashasvi Jaiswal 52* unbeaten at the crease. But their partnership broke at 139 runs in the second session, with fall of Jaiswal for 57. Shubman Gill (10) and Rohit (80) fell in quick succession, leaving India at 155/3. Virat then took innings forward with vice-captain Ajinkya Rahane, who fell for eight on the final ball of the second session. India ended the second session at 182/4, with Virat (18*) unbeaten. WI elected to bowl first after winning the toss. (ANI)","pubDate":"2023-07-20 23:34:44","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Canadian cricketer Aaron Johnson shines at Global T20 Canada","link":"https://torontosun.com/sports/other-sports/canadian-cricketer-aaron-johnson-shines-at-global-t20-canada","keywords":["Other Sports","Sports"],"creator":["Richard Mauntah"],"video_url":null,"description":null,"content":"It’s a tournament where local players rub shoulders with the game’s biggest stars. And should one of the locals take a game over, it could propel him to new heights. Aaron Johnson is relatively new to the Canadian national team after spending much of his career playing in British Columbia. But his overall performance in the opening game of Global T20 Canada is one he won’t soon forget as he led the Brampton Wolves to a crushing win over the Mississauga Panthers in a weather-shortened match. After holding Mississauga to just 121 in their innings, the Wolves responded with 99 in just nine overs having lost just one wicket, more than enough of a run rate to win if the match had to be called early. Sure enough, darkening skies and the threat of lightning caused the umpires to put an early end to the day’s proceedings. Johnson also distinguished himself in the field, and while the catch he made may have been one he has taken many times, this one was against Chris Gayle at a time when the West Indian legend was just starting to heat up. But it was with the bat where Johnson became the star of the day, smashing three sixes and five fours for a total of 48 not out off just 26 balls. Only the skies prevented him from a much bigger total. If there’s a reason for this tournament to exist, it is for players such as Johnson. Test players have their pick of T20 tournaments in which to participate. Others have more limited options. For Canadians, this may be their only opportunity to impress to the point that other offers come their way. Johnson earned his way onto the Canadian national team last year. Born and raised in Jamaica, his family moved to Fort McMurray, Alta., late in his teens. His national team highlight came in a T20 international against Oman where he scored 109, a record for a Canadian batsman in the short format of the game. With Gayle on the bench, it was up to his Panthers teammates to put a decent total. Young Pakistan wicket keeper Azam Khan faced that challenge head on and flourished, scoring 65, including five fours and three sixes, two being majestic strikes with five overs remaining. “It was good for the team. The team needed it,” Khan said. “I clicked at the right moment.” The batting performance aside, the Kirachi native is enjoying his time in this part of the world. “It’s my first time in Canada and I’m loving it,” he said. “The people have been really supportive.” He did much of that damage alongside former Canadian team captain Navneet Dhaliwal, who scored 29, including the first maximum of the tournament. But four wickets from Logan van Beek, including that of Khan, and two wickets each from Chris Green and Jan Frylinck limited Mississauga. Green also contributed with a perfect throw to the wicket to cause another runout. The Wolves wasted no time in their chase. Usman Khan hit a six to open the innings on his way to a score of 12. Brampton also got a big performance from Mark Chapman, the New Zealand international originally from Hong Kong. Chapman scored 30 including three fours and a six. Bowling-wise, Mississauga captain Shoaib Malik had a tough day. In his two overs, he gave up 34 runs. Zahoor Khan took the only wicket. Global T20 Canada continues Friday with the Toronto Nationals facing the Vancouver Knights and the Surrey Jaguars taking the field for the first time against the Montreal Tigers. Logan van Beek ( Brampton Wolves) Age: 32 Country: Netherlands Career Highlight: In a 2023 World Cup qualifier against the West Indies in June, van Beek scored a world-record 30 runs in the tie-breaking Super Over then took two West Indian wickets to preserve the upset win. Check out our sports section for the latest news and analysis. Care for a wager? Head to our sports betting section for news and odds.","pubDate":"2023-07-20 23:31:29","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/07/0721-welcomecricket-scaled-e1689895652968.jpg?quality=100&strip=all","source_id":"torontosun","category":["sports"],"country":["canada"],"language":"english"}]}