{"newsArray":[{"title":"Juventus, i dettagli economici della cessione di De Winter: 8 milioni più bonus","link":"https://www.tuttomercatoweb.com/serie-a/juventus-i-dettagli-economici-della-cessione-di-de-winter-8-milioni-piu-bonus-1863205","keywords":["Serie A"],"creator":null,"video_url":null,"description":"Attraverso i propri canali ufficiali, la Juventus ha reso noti i dettagli del passaggio di Koni De Winter al Genoa, con un comunicato che spiega tutti i passaggi economici: \"Juventus Football Club S.","content":"Attraverso i propri canali ufficiali, la Juventus ha reso noti i dettagli del passaggio di Koni De Winter al Genoa, con un comunicato che spiega tutti i passaggi economici: \"Juventus Football Club S.p.A. comunica di aver raggiunto un accordo con la società Genoa Cricket and Football Club S.p.A. per la cessione, a titolo temporaneo gratuito fino al 30 giugno 2024, del diritto alle prestazioni sportive del calciatore Koni De Winter. L’accordo prevede: • l’obbligo da parte del Genoa di acquisire a titolo definitivo le prestazioni sportive del giocatore al raggiungimento di determinati obiettivi sportivi nel corso della stagione 2023/2024; • la facoltà da parte del Genoa di acquisire a titolo definitivo le prestazioni sportive del giocatore qualora detti obiettivi non fossero raggiunti. Il corrispettivo pattuito per l’acquisizione definitiva, in entrambi i casi, è pari a € 8 milioni, pagabili in quattro esercizi, e potrà essere aumentato al raggiungimento di ulteriori obiettivi, nel corso della durata del contratto di prestazione sportiva con il calciatore, per un ammontare non superiore a € 2 milioni\". Ufficiale | Koni De Winter in prestito al @GenoaCFC — JuventusFC (@juventusfc) August 11, 2023","pubDate":"2023-08-11 22:08:18","image_url":"https://tmw-storage.tcccdn.com/storage/tuttomercatoweb.com/img_notizie/thumb3/83/838fd7208be0595489328181272e1f31-87031-oooz0000.jpeg","source_id":"tuttomercatoweb","category":["sports"],"country":["italy"],"language":"italian"},{"title":"Brothers in cricket!…The Campbell legacy continues Zimbabwe’s rich tradition","link":"https://www.chronicle.co.zw/brothers-in-cricket-the-campbell-legacy-continues-zimbabwes-rich-tradition/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com The dream of many young cricketers is to play alongside their brothers at the highest level and as such the bond between siblings in the world of sport can be a force to reckon with. The cricketing world has in fact witnessed iconic pairs of brothers who left an indomitable legacy because […]","content":"The Chronicle The dream of many young cricketers is to play alongside their brothers at the highest level and as such the bond between siblings in the world of sport can be a force to reckon with. The cricketing world has in fact witnessed iconic pairs of brothers who left an indomitable legacy because of this siblings’ desire to partner in sport. From New Zealand’s McCullum brothers, Brendon and Nathan, to Australia’s Waugh brothers, Steve and Mark, cricket has indeed benefited from extraordinary sibling duos. In India, the “Pathan Bandhu”, Irfan and Yusuf Pathan, enthralled fans with their talents. The list of cricketing siblings is long and it includes among others, Zimbabwe’s legends — the Flower brothers. Andy and Grant Flower, Zimbabwe’s finest talents, graced the cricketing arena in the 90s and early 2000s, leaving an everlasting impression. Andy holds the record for the second-highest individual score in Test cricket, an unbeaten 232 runs while Grant’s remarkable feat of carrying his bat through a completed One Day International (ODI) innings, earned him a distinguished place in cricket history. Zimbabwe cricket is once again witnessing the rise of two brothers destined for greatness — Jonathan and Matthew Campbell. The Campbell legacy was written by their father, the legendary Alistair Campbell and Andy Flower is Campbell brothers’ godfather. The pair are determined to make their mark in the world of cricket. Jonathan has already made a name for himself on the Zimbabwe’s domestic cricket scene, boasting numerous First-Class and List-A caps. His younger brother, Matthew, is on the brink of bursting onto the scene, promising to make his presence felt soon. Having grown up with cricket as an integral part of their lives, the Campbell brothers have always looked up to their father, a former national team player and captain of the Chevrons. For Jonathan, inspiration stems from left-handed cricketers like his father. “My dad has had a huge impact on our game and we are doing our best to make him proud. We looked up to my dad, obviously, he played a lot of cricket and Andy Flower is actually my godfather and recently, someone like Brendan Taylor, a very good cricketer, Sikandar Raza and Sean Williams. There are a lot of left-handed batters, my dad, Andy, Williams so there’s a lot to look up to from the local point of view,” he said. Matthew said: “I just looked up to my father. He achieved a lot in Zimbabwe Cricket and if I can achieve half of that it would be gold.” The two brothers recently participated in the inaugural Zim Cyber City Zim Afro T10 league, showcasing their talent on a global stage. Jonathan’s remarkable catch Cape Town Samp Army under lights at Harare Sports Club added to the excitement of the tournament. “I couldn’t believe it, I know I played well in the trials but from a club cricketer who just came back a year ago from America playing golf to getting picked up as a professional cricketer is crazy, I didn’t expect it at all,” said Mathew, who played for the Johannesburg Buffaloes. Both brothers dream of donning the national colours as they want to follow in their fathers’ footsteps. Alistar achieved remarkable milestones as the captain, including a historic series victory in Pakistan in 1998-99 and qualification for the Super Sixes in the 1999 World Cup. Jonathan has been knocking on the doors of the national team, eagerly awaiting his breakthrough moment. Meanwhile, Mathew aspires to be the best in the world, firmly believing in the power of dreams that continually evolve and lead them on extraordinary paths. “I have been playing professional cricket for five years and this (T10 league) is a stepping stone in the right direction for me. I have played a lot of games for Zimbabwe-A and I am hopefully on the brink of playing for the national side in the months to come so I look forward to that,” said Jonathan. His brothers said: “My dreams continue to change, from playing golf to cricket, two professional tournaments in just over a year. The dreams keep changing but I’m aiming to be the best in the world.” In First-Class cricket, Jonathan has played 21 matches and managed to score 910 runs at an average of 25, 27 and a high score of 73 not out. In List A, he has played 31 games, scored 842 runs and an average of 35, 08 with a high score of 76. The two Campbell brothers look on track to become Zimbabwe’s next big cricket siblings. @brandon_malvin","pubDate":"2023-08-11 22:02:06","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"तिलक वर्मा की World Cup में नंबर-4 पर खेलने की बात, कुछ यह जवाब दिया रोहित शर्मा ने","link":"https://sports.ndtv.com/hindi/cricket/this-is-what-reply-rohit-sharm-give-about-tilak-vermas-claim-for-no-4-for-world-cup-4290326#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"विंडीज के खिलाफ जारी टी20 सीरीज में तिलक वर्मा (Tilak Varma) की बैटिंग के बाद कई समीकरण बदलते दिख रहे हैं","content":"तिलक वर्मा ने Asia Cup और World Cup के लिए नए समीकरण पैदा कर दिए हैं विंडीज के खिलाफ जारी टी20 सीरीज में स्टारों की नाकामी के बीच तिलक वर्मा (Tilak Varma) के उभार ने एक नई बहस छेड़ दी है. पूर्व क्रिकेटरों का एक तबका उन्हें एशिया कप और World Cup तक में नंबर चार बल्लेबाज के लिए दबाव बना रहा है. और वास्तव में जिस तरह की बैटिंग तिलक ने पिछले तीन मैचों में दिखाई है, उससे प्रबंधन भी प्लान बदलने पर मजबूर हो सकता है. और अब कप्तान रोहित शर्मा (Rohit Sharma) ने भी इससे पूरी तरह इनकार नहीं किया विश्व कप में नंबर चार के लिए वर्मा की दावेदारी पर कुछ भी कहने से बचते हुए रोहित ने इस लेफ्टी की तारीफ करते हुए कहा कि वह उदीयमान दिखाई पड़ता है. मैं तिलक को पिछले दो साल से लेकर अभी तक देख चुका हूं. उनकी रन बनाने की भूख बहुत ज्यादा बढ़ गई है. और यही सबसे महत्वपूर्ण बात है. भारतीय कप्तान ने कहा कि मैं देख सकता हूं कि इस उम्र में वह काफी परिपक्व बल्लेबाज हैं. वह बल्लेबाजी को अच्छी तरह जानते हैं. जब मैं उनसे बात करता हूं, तो यह पता चलता है कि वह अपनी बल्लेबाजी को अच्छी तरह जानता है. उसे मालूम है कि कहां शॉट लगाना है और पिच पर समय विशेष पर क्या करना है. रोहित ने कहा कि मैं तिलक के बारे में फिलहाल इतना ही कह सकता हूं. मैं विश्व कप के बारे में नहीं जानता है, लेकिन यह खिलाड़ी प्रतिभाशाली है. और भारत के लिए खेले कुछ ही मैचों में उसने इस बात को बहुत ही अच्छी तरह से साबित किया है. रोहित ने यह भी स्वीकार किया कि युवराज के जाने के बाद से भारत को भरोसेमंद नंबर चार बल्लेबाज हासिल करने में खासा संघर्ष करना पड़ा है. रोहित ने यह भी कहा कि उन्हें पूरा भरोसा है कि केएल राहुल और श्रेयस अय्यर के लिए भले ही एक बार को भले ही एशिया कप के लिए वापसी मुश्किल हो, लेकिन ये दोनों World Cup 2023 के लिए फिट हो जाएंगे. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-11 18:47:00","image_url":"https://c.ndtvimg.com/2023-08/8ja2up8o_tilak-varma_625x300_11_August_23.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"केकेआर कप्तान अब दिल्ली के लिए रणजी ट्रॉफी नहीं खेलना चाहते, NOC मांगी, यह है असल वजह","link":"https://sports.ndtv.com/hindi/cricket/kkr-captain-now-doesnt-to-play-for-delhi-in-ranji-asks-for-noc-these-are-the-reason-4290470#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"डीडीसीए (दिल्ली एवं जिला क्रिकेट संघ) के संयुक्त सचिव राजन मनचंदा ने शुक्रवार को इस घटनाक्रम की पुष्टि की. उन्होंने हालांकि आश्वासन दिया कि दोनों क्रिकेटरों से बात की जाएगी","content":"नीतिश राणा IPL में केकेआर की कप्तानी करते हैं दिल्ली क्रिकेट के लिए मुश्किलें कम होने का नाम नहीं ले रही हैं क्योंकि पूर्व कप्तान और IPL में केकेआर की कप्तानी करने वाले नितीश राणा (Nitish Rana) अब राज्य के लिए रणजी ट्रॉफी नहीं खेलना चाहते हैं. उन्होंने दिल्ली एवं जिला क्रिकेट संघ (डीडीसीए) से अनापत्ति प्रमाण-पत्र मांगा है. नितीश के अलावा पिछले साल रणजी ट्रॉफी में टीम के लिए सबसे ज्यादा रन बनाने वाले ध्रुव शोरे एक और खिलाड़ी हैं, जो अब दिल्ली के लिए नहीं खेलना चाहते. डीडीसीए (दिल्ली एवं जिला क्रिकेट संघ) के संयुक्त सचिव राजन मनचंदा ने शुक्रवार को इस घटनाक्रम की पुष्टि की. उन्होंने हालांकि आश्वासन दिया कि दोनों क्रिकेटरों से बात की जाएगी और उनकी परेशानी को धैर्यपूर्वक सुना जाएगा ताकि पता लगाया जा सके कि वे ऐसा निर्णय क्यों लेना चाहते हैं. वैसे नितीश राणा के साथ कई बातें जिनके कारण वह अब दिल्ली के लिए नहीं खेलना चाहते. आप वजहे जान लीजिए. दिल्ली ने पिछले सीजन में रेड बॉल फॉर्मेट में बीच सीजन में ही नितीश को कप्तानी से हटकर युवा यश धुल को कप्तान बना दिया था. हालांकि, राणा का प्रदर्शन बहुत ही ज्यादा खराब रहा था. और इसी के कारण सेलेक्टरों को यह फैसला लेना पड़ा. लेकिन राणा का कहना था कि धुल एक ही सीजन दिल्ली के लिए खेले थे और उन्हें कप्तानी से हटाना सही फैसला नहीं था नितीशा राणा को दिल्ली के ड्रेसिंग रूम में भी कुछ खिलाड़ियों से परेशानी है. इस साल IPL में मुंबई इंडियंस के लिए खेल रहे रितिक शौकीन और उनके बीच हुए वॉक-युद्ध के दौरान सभी ने देखा कि मामला कितना गरम हो गया था. और सूर्यकुमार साहित तमाम खिलाड़ियों ने इनके बीच-बचाव कराया. रितिक ने रेड बॉल से दिल्ली के लिए भी अच्छा प्रदर्शन किया था. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-11 18:33:14","image_url":"https://c.ndtvimg.com/2021-04/jgme8i88_nitish-rana-kkr-instagram-630_240x180_03_April_21.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"India vs West Indies: US' Lauderhill Stadium in numbers and how Men in Blue and Windies have fared here","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-us-lauderhill-stadium-in-numbers-and-how-men-in-blue-and-windies-have-fared-here-12986542.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs West Indies: US' Lauderhill Stadium in numbers and how Men in Blue and Windies have fared here","content":"Cricket India vs West Indies: US' Lauderhill Stadium in numbers and how Men in Blue and Windies have fared here India and West Indies arrive in the United States of America for the fourth and fifth T20Is, which will take place at Lauderhill in Broward County, Florida over the weekend. FirstCricket Staff Last Updated:August 12, 2023 00:03:03 IST The Central Broward Regional Park Stadium Turf Ground in Lauderhill, Florida hosted the first-ever international match in the United States of America in the summer of 2010. Image credit: Twitter/@windiescricket India’s tour of the Caribbean and the United States has come down to it’s final weekend, the tournament spanning exactly a month and featuring all three formats with the Indians triumphing in the Tests and ODIs and now setting their sights on the T20I victory. The ongoing T20I series began in Tarouba and then moved to Guyana in South America for the next two matches. After India’s clinical victory in the third T20I that kept their hopes of a series win hanging by a thread, the two sides move to a whole new continent for the last two matches. Read | Ingenious India and brilliant SKY fightback to stay alive in T20Is Related Articles India vs West Indies 3rd ODI: Undercooked Men in Blue hope to improve in series decider India vs West Indies: Shai Hope recalled for five-match T20I series The two sides arrive in the United States of America for the fourth and fifth T20Is, which will take place at Lauderhill in Broward County, Florida. And with India sending out a warning to their opponents with their clinical chase on Tuesday after losing the first two games by a narrow margin, the weekend promises to be an action-packed, closely-contested affair that should be a fitting conclusion to the tour. Miami ✈️ #TeamIndia | #WIvIND pic.twitter.com/SKJTbj0hgS — BCCI (@BCCI) August 10, 2023 Ahead of the last two games of the tour, we take a look at the history behind the Central Broward Regional Park Stadium Turf Ground that will play host to the business end of India’s ongoing tour: History: Though it is gradually expanding its reach in the American market through the introduction of the Major League Cricket (MLC) along with plans for hosting the T20 World Cup in that region next year, cricket in the United States remains in its infancy and is still primarily limited to the south Asian and the Caribbean diaspora. This despite the fact that the first-ever recorded international match was said to have taken place not between England and Australia, but between the United States and Canada in 1844. The CBRSP in Lauderhill — a town that has a large Caribbean American population and is located close to Miami — happens to be the primary cricket venue in the USA and is one of the two American venues that has hosted international matches. It all started with the two-match T20I series between New Zealand and Sri Lanka in May, 2010 that ended in a 1-1 draw. The Black Caps would also feature in the first-ever match hosted by West Indies on American soil — two years since the T20I series against Sri Lanka. The Windies would end up winning both matches in the T20I series to complete a sweep, before heading back to the Caribbean for the ODIs and Tests. Statistics The venue has hosted a total of six ODIs and 14 T20Is since the first-ever match at the start of the previous decade. As far as T20Is are concerned, the venue is a high-scoring one which primarily favours the side opting to bat. Out of the 14 T20Is that have taken place at this venue till date, teams batting first have won 11 while the one batting second have won only two, with one game getting abandoned. Here’s a detailed look at the ODI and T20I statistics pertaining to this venue: T20Is Total matches: 14 Matches won batting first: 11 Matches won batting second: 2 Matches ending in a tie: 0 Matches ending in a ‘No Result’: 1 Highest total: 245/6, West Indies vs India, 2016 Lowest total: 81, New Zealand vs Sri Lanka, 2010 Highest individual score: KL Rahul (India), 110 not out vs West Indies, 2016 ODIs Total matches: 6 Matches won batting first: 4 Matches won batting second: 2 Matches tied: 0 Matches ending in a ‘No Result’: 0 Highest total: 287/8, Namibia vs United States, 2019 Lowest total: 115, Papua New Guinea vs United States, 2019 Highest individual score: JP Kotze (Namibia), 136 vs United States, 2019 West Indies’ record at this venue Since hosting their first match in the United States in 2012, the West Indians have played a total of 10 matches at Lauderhill, winning three and losing six with one match ending in a no-result. They would start off by winning each of their first three games — sweeping the two-match series against New Zealand in 2012 and beating India in the first of the two matches in 2016, with the second one getting rained off. The Men in Maroon would then go on to lose every single match that they have played at this venue. Their highest total at this venue happens to be the 245/6 that they posted against India in 2016. India’s record at this venue India made their American debut during the 2016 tour, in which they played two T20Is in Florida. They would lose their opening game by just one run in a high-scoring encounter in which the West Indians posted 245/6 on the board. India, in reply, would finish on 244/4 — their highest-total at this venue — with KL Rahul’s unbeaten 110 taking them to the brink of victory. India have played a total of six T20Is at Lauderhill and their graph follows a direction that is completely opposite to that of the West Indies. After losing their opening game, with the next one in the same tour getting rained off, India have won each of their last four matches at this venue — two each in 2019 and 2022 respectively. Published on: August 11, 2023 16:25:08 IST Tags: Central Broward Regional Park Stadium Cricket India Vs West Indies West Indies Vs India","pubDate":"2023-08-11 18:33:03","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/Central-Broward-Regional-Park-Stadium-Turf-Ground-Twitter-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Sachin Tendulkar: ব্য়াট হাতে বাইশ গজে নয়, এবার অটো চালকের আসনে সচিন!","link":"https://bengali.abplive.com/sports/cricket/sachin-tendulkar-shares-special-post-on-social-media-picture-goes-viral-1000405","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: খেলোয়াড় হিসাবে অনেকদিনই অবসর নিয়েছেন সচিন তেন্ডুলকর (Sachin Tendulkar)। তবে তাতে তাঁর জনপ্রিয়তায় এতটুকু ভাটা পড়েনি। তিনি সোশ্যাল মিডিয়ায় যাই পোস্ট করেন, তাই হু হু করে ভাইরাল হয়ে যায়। এতে 'মাস্টার ব্লাস্টার'-এর জনপ্রিয়তার পরিচয় পাওয়া যায়। সম্প্রতি সোশ্যাল মিডিয়ায় ফের একটি ছবি পোস্ট করেছেন তিনি, যা বেশ ভাইরাল হয়েছে। বর্তমানে ছুটি কাটাচ্ছেন সচিন তেন্ডুলকর। তিনি আপাতত শ্রীলঙ্কায় (Sri Lanka) রয়েছেন। সেখানেই এক অটোতে বসে সচিন একটি ছবি তোলেন। তিনি সোশ্যাল মিডিয়ায় সেই ছবি শেয়ার করে ক্যাপশনে লেখেন, 'মুম্বইকরকে মুম্বইয়ের বাইরে নিয়ে যাওয়া সম্ভব, তবে..... ' এরপরেই সচিন যে জায়গায় এই ছবিটি তোলা সেই জায়গাটির নামও শেয়ার করেন। সচিন জানান তিনি আপাতত শ্রীলঙ্কার রুমানওয়েলায় রয়েছেন।             View this post on Instagram                       A post shared by Sachin Tendulkar (@sachintendulkar)   প্রসঙ্গত, দ্বীপরাষ্ট্রে শুধু ছুটি কাটানোই নয়, ক্রিকেটের কিংবদন্তি না না সমাজ সচেতনতামূলক কাজেও লিপ্ত রয়েছেন। দিন কয়েক আগেই তিনি সোশ্যাল মিডিয়াতেই আরও একটি পোস্ট শেয়ার করেছিলেন যেখানে সচিনের মানবিক রূপটা ভেসে উঠেছিল। বোলারদের রাতের ঘুম কেড়ে নেওয়া সচিন মাঠের বাইরে উদার। তিনি কখনও সাফাইকর্মীদের সঙ্গে জঞ্জাল পরিষ্কার করার কাজে হাত লাগান। তো তাঁকে আবার কখনও দুঃস্থ শিশুদের পড়াশোনার দায়িত্ব নিতে দেখা গিয়েছে। শ্রীলঙ্কাতেই ছুটি কাটানোর মাঝে কিছু খুদের সঙ্গে সময় কাটান সচিন। খুদেগের কাণ্ড মন জিতে নিয়েছে সচিনের। যিনি ইউনিসেফের (UNICEF) দূতও। সেই কাজে বিশ্বের বিভিন্ন প্রান্তে সচেতনতামূলক প্রচার চালান। সচিন নিজের সোশ্যাল মিডিয়ায় একটি ছবি পোস্ট করেছেন। সেই ছবিতে তাঁকে দেখা যাচ্ছে সবুজের মাঝে। এক ঝাঁক স্কুল পড়ুয়ার সঙ্গে। মাস্টার ব্লাস্টার লিখেছেন, ‘শিশুরাই সেরা শিক্ষক। সহরজ জিনিসের মধ্যেও ওরা আমাদের জ্ঞানের উন্মোচন ঘটায়। শ্রীলঙ্কার প্রত্যন্ত এক গ্রামের এই স্কুলে আমরা সহমর্মিতা উদযাপন করলাম।’ কীভাবে? ব্যাখ্যা করেছেন সচিন। লিখেছেন, ‘প্রত্যেক ছাত্র তাদের প্লেট থেকে অল্প পরিমাণ খাবার বাঁচিয়ে একটা বড় থালায় রেখেছিল। তারপর সেই খাবার পাখিদের খাওয়ানো হয়। ভাগ করে নেওয়ার অসাধারণ এক ভাবনা। আমরা কৃতজ্ঞ। এটা সকলেরই অনুকরণ করা উচিত।’  আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপ ও বিশ্বকাপে বাংলাদেশকে নেতৃত্ব দেবেন কে? ঘোষণা হয়ে গেল শুক্রবার","content":"কলম্বো: খেলোয়াড় হিসাবে অনেকদিনই অবসর নিয়েছেন সচিন তেন্ডুলকর (Sachin Tendulkar)। তবে তাতে তাঁর জনপ্রিয়তায় এতটুকু ভাটা পড়েনি। তিনি সোশ্যাল মিডিয়ায় যাই পোস্ট করেন, তাই হু হু করে ভাইরাল হয়ে যায়। এতে 'মাস্টার ব্লাস্টার'-এর জনপ্রিয়তার পরিচয় পাওয়া যায়। সম্প্রতি সোশ্যাল মিডিয়ায় ফের একটি ছবি পোস্ট করেছেন তিনি, যা বেশ ভাইরাল হয়েছে। বর্তমানে ছুটি কাটাচ্ছেন সচিন তেন্ডুলকর। তিনি আপাতত শ্রীলঙ্কায় (Sri Lanka) রয়েছেন। সেখানেই এক অটোতে বসে সচিন একটি ছবি তোলেন। তিনি সোশ্যাল মিডিয়ায় সেই ছবি শেয়ার করে ক্যাপশনে লেখেন, 'মুম্বইকরকে মুম্বইয়ের বাইরে নিয়ে যাওয়া সম্ভব, তবে..... ' এরপরেই সচিন যে জায়গায় এই ছবিটি তোলা সেই জায়গাটির নামও শেয়ার করেন। সচিন জানান তিনি আপাতত শ্রীলঙ্কার রুমানওয়েলায় রয়েছেন। View this post on Instagram A post shared by Sachin Tendulkar (@sachintendulkar) googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); প্রসঙ্গত, দ্বীপরাষ্ট্রে শুধু ছুটি কাটানোই নয়, ক্রিকেটের কিংবদন্তি না না সমাজ সচেতনতামূলক কাজেও লিপ্ত রয়েছেন। দিন কয়েক আগেই তিনি সোশ্যাল মিডিয়াতেই আরও একটি পোস্ট শেয়ার করেছিলেন যেখানে সচিনের মানবিক রূপটা ভেসে উঠেছিল। বোলারদের রাতের ঘুম কেড়ে নেওয়া সচিন মাঠের বাইরে উদার। তিনি কখনও সাফাইকর্মীদের সঙ্গে জঞ্জাল পরিষ্কার করার কাজে হাত লাগান। তো তাঁকে আবার কখনও দুঃস্থ শিশুদের পড়াশোনার দায়িত্ব নিতে দেখা গিয়েছে। শ্রীলঙ্কাতেই ছুটি কাটানোর মাঝে কিছু খুদের সঙ্গে সময় কাটান সচিন। খুদেগের কাণ্ড মন জিতে নিয়েছে সচিনের। যিনি ইউনিসেফের (UNICEF) দূতও। সেই কাজে বিশ্বের বিভিন্ন প্রান্তে সচেতনতামূলক প্রচার চালান। সচিন নিজের সোশ্যাল মিডিয়ায় একটি ছবি পোস্ট করেছেন। সেই ছবিতে তাঁকে দেখা যাচ্ছে সবুজের মাঝে। এক ঝাঁক স্কুল পড়ুয়ার সঙ্গে। মাস্টার ব্লাস্টার লিখেছেন, ‘শিশুরাই সেরা শিক্ষক। সহরজ জিনিসের মধ্যেও ওরা আমাদের জ্ঞানের উন্মোচন ঘটায়। শ্রীলঙ্কার প্রত্যন্ত এক গ্রামের এই স্কুলে আমরা সহমর্মিতা উদযাপন করলাম।’ কীভাবে? ব্যাখ্যা করেছেন সচিন। লিখেছেন, ‘প্রত্যেক ছাত্র তাদের প্লেট থেকে অল্প পরিমাণ খাবার বাঁচিয়ে একটা বড় থালায় রেখেছিল। তারপর সেই খাবার পাখিদের খাওয়ানো হয়। ভাগ করে নেওয়ার অসাধারণ এক ভাবনা। আমরা কৃতজ্ঞ। এটা সকলেরই অনুকরণ করা উচিত।’ আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপ ও বিশ্বকাপে বাংলাদেশকে নেতৃত্ব দেবেন কে? ঘোষণা হয়ে গেল শুক্রবার var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-08-11 18:28:12","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/11/c1ca1a6bbcc078bb1e40d2e4744529a01691777793654507_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Samson is due some runs and won't get a better pitch: Jaffer ahead of 4th T20I","link":"https://www.indiatoday.in/sports/cricket/story/wi-vs-ind-sanju-samson-is-due-some-runs-and-he-wont-get-a-better-pitch-says-wasim-jaffer-ahead-of-4th-t20i-2419893-2023-08-11?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Samson is due some runs and won't get a better pitch: Jaffer ahead of 4th T20I","content":null,"pubDate":"2023-08-11 18:15:30","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"'भारतीय टीम को बर्बाद किया जा रहा है', वर्ल्ड कप से पहले पूर्व पाकिस्तानी खिलाड़ी ने उगला जहर","link":"https://www.indiatv.in/sports/cricket/former-pakistan-bowler-sarfraz-nawaz-on-indian-cricket-team-before-odi-world-cup-2023-experiments-2023-08-11-980706","keywords":null,"creator":null,"video_url":null,"description":"वनडे वर्ल्ड कप से पहले पाकिस्तान के पूर्व तेज गेंदबाज सरफराज नवाज ने बड़ा बयान दिया है।","content":"वनडे वर्ल्ड कप 2023 की शुरुआत भारत की धरती पर 8 अक्टूबर से हो रही है। वर्ल्ड कप का फाइनल मुकाबला 19 नवंबर को खेला जाएगा। टीम इंडिया पिछले 10 सालों से एक भी आईसीसी टूर्नामेंट नहीं जीत पाई है। वहीं, वर्ल्ड कप से कुछ दिन पहले ही वेस्टइंडीज दौरे पर टीम इंडिया में कई बदलाव हुए हैं। टीम के कई स्टार खिलाड़ी चोटिल हैं, जो इस समय एनसीए में हैं। अब वर्ल्ड कप से पहले ही पाकिस्तान के पूर्व तेज गेंदबाज सरफराज नवाज ने बड़ा बयान दिया है। सरफराज नवाज ने शुक्रवार को लाहौर में पत्रकारों से कहा कि पाकिस्तान की टीम भारत की तुलना में एशिया कप और विश्वकप के लिए अधिक व्यवस्थित और स्थिर नजर आती है। भारतीय टीम इन प्रमुख टूर्नामेंट्स से पहले अभी तक अपना अंतिम संयोजन तैयार नहीं कर पाई है। कप्तान बदले जा रहे हैं, कई नए खिलाड़ियों को आजमाया जा रहा है और ऐसे में भारतीय टीम उचित संयोजन तैयार नहीं कर पाई है। मेरा मानना है कि भारतीय टीम को तैयार करने के बजाए बर्बाद किया जा रहा है। सरफराज ने इसके साथ ही कहा कि भारत पर अपनी धरती पर विश्वकप खेलने और पिछले 10 सालों से आईसीसी ट्रॉफी नहीं जीतने का दबाव भी रहेगा। उन्होंने कहा कि जब आप स्वदेश में खेल रहे होते हैं तो निश्चित तौर पर आप से काफी उम्मीद की जाती है, जिससे कि दबाव बनता है। भारत के लिए अच्छी बात यह है कि उनके पास कुछ अच्छे सीनियर खिलाड़ी हैं। टीम इंडिया में पिछले कुछ समय लगातार बदलाव हुए हैं, जिससे कई बड़े सवाल खड़े हुए। वेस्टइंडीज के खिलाफ पहले वनडे मैच में भारतीय कप्तान रोहित शर्मा नंबर सात पर उतरे थे। वहीं, विराट कोहली को बल्लेबाजी करने का मौका ही नहीं मिला। इसके बाद दूसरे और तीसरे वनडे मैच से इन दोनों खिलाड़ियों को रेस्ट दे दिया। ये बदलाव उस समय हुए जब वर्ल्ड कप में कुछ ही समय बचा हुआ है।","pubDate":"2023-08-11 18:12:25","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"‘Honorary Welshwoman’ Shabnim Ismail brings worldwide spirit to Welsh Fire","link":"https://www.businesslend.com/sports/honorary-welshwoman-shabnim-ismail-brings-international-spirit-to-welsh-fire/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on the whole lot from biking to boxing Sign as much as our free sport e-mail for all the most recent information Shabnim Ismail has revealed how representing Welsh Fire in The Hundred helps her fill the void left by her [...] The post ‘Honorary Welshwoman’ Shabnim Ismail brings worldwide spirit to Welsh Fire appeared first on BusinessLend.","content":"Shabnim Ismail has revealed how representing Welsh Fire in The Hundred helps her fill the void left by her retirement from worldwide cricket. The tempo bowler has been integral to reviving the fortunes of the Cardiff-based aspect, who completed all-time low final summer time, and powered them to the highest of the desk with a nerveless hat-trick on the demise to see off Birmingham Phoenix on Thursday night time. Ismail is a confirmed winner within the 100-ball format, having helped Oval Invincibles to the title in 2021 and 2022, however didn’t shrink from the problem after being drafted by the struggling Fire and has thrown herself into the duty. The 34-year-old known as an finish to her South Africa profession earlier this yr however feels that doing her bit for the principality helps her discover her peak efficiency. “When I moved I didn’t really realise it wasn’t just Welsh Fire the club, but Wales the country. I’m so proud to play in the Welsh colours,” she instructed the PA information company. “I’m calling myself an honorary Welshwoman, of course! I’m retired from internationals but I’m lucky that I still get to play for a country. To represent a nation, it almost feels like I’m back with South Africa at a World Cup. It makes me play with my heart on my sleeve and do well for them. “I was nervous first of all coming into the team but it has been like a family, an amazing welcome. I always say I can only produce the goods and play to the best of my ability when I’m comfortable in the environment and here I know I can speak my mind with no drama, everybody trusts me.” Ismail definitely had no drawback discovering her best kind when she conjured a traditional end to defeat the Phoenix in a nail-biter at Edgbaston. Defending 4 runs from the final three balls of the match she dismissed Tess Flintoff, Erin Burns and Issy Wong. More exceptional than the feat itself, although, was the truth that Ismail didn’t even realise she had achieved it. I did not even hear the gang initially, nevertheless it pumped me up once I did. I believe we made the entire of Birmingham indignant. “I knew exactly what I wanted to do and I told the team I wanted the last five balls. But I was so in the zone I didn’t even know I had a hat-trick,” she stated. “I just didn’t realise it was three in a row, in my head every wicket was a dot ball. I didn’t even hear the crowd initially, but it pumped me up when I did. I think we made the whole of Birmingham angry.” Welsh Fire now discover themselves within the surprising place of main the way in which after two years of under-delivering however, if that could be a shock to some, Ismail known as it earlier than a ball had been bowled. “When I met Breesey (head coach Gareth Breese), I told him ‘we are going to win this’,” she stated. “I told him things will be different this year. He told me ‘baby steps, one at a time’ but I keep telling him we’ve got this. Now we all believe, we know we can do it.” Manchester United agree cope with Fenerbahce for Fred","pubDate":"2023-08-11 18:11:32","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"रोहित ने सूर्यकुमार की वनडे में भूमिका को लेकर दिया बड़ा इशारा, भारतीय कप्तान बोले कि...","link":"https://sports.ndtv.com/hindi/cricket/captain-rohit-gives-big-indication-about-suryakumar-yadav-role-in-odi-4291325#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"सूर्यकुमार को लेकर वनडे में किया गया निवेश अभी तक नाकाम रहा है. और World Cup नजदीक देखते हुए अब द्रविड़ एंड कंपनी उन्हें लेकर प्लान बदलती दिख रही है","content":"Asia Cup 2023 की दिशा में समय आगे चल पड़ा है, तो तिलक वर्मा (Tilak Varma) के उभार के साथ ही नंबर-4 को लेकर चर्चा ने जोर पकड़ लिया है. केएल राहुल (KL Rahul) और श्रेयस अय्यर (Shreyas Iyer) चोटिल हैं, तो बाकी बल्लेबाज आउट ऑफ फॉर्म हो चले हैं. पिछले कुछ समय में भारत ने नंबर चार के लिए सूर्यकुमार यादव (Suryakumar Yadav) में निवेश किया था, लेकिन इससे मनवांछित परिणाम नहीं मिला. \\ इसी विषय पर जहां रोहित शर्मा ने वनडे में फॉर्म हासिल करने के लिए सूर्यकुमार यादव का समर्थन किया है, लेकिन उन्होंने यह भी कहा कि हमें देखना होगा कि टी20 में विश्व कप सर्वश्रेष्ठ बल्लेबाज का कितने लंबे समय तक समर्थन किया जा सकता है. मैनेजमेंट ने अब यादव को वनडे में नंबर छह पर धकेल दिया है. कोच राहुल द्रविड़ ने यादव से खुद को नंबर छह के लिए तैयार रखने के लिए कह दिया है. रोहित बोले कि सूर्य कड़ी मेहनत कर रहे हैं. वह उन दिग्गजों से बहुत ज्यादा बात कर रहे हैं, जिन्होंने बहुत ज्यादा वनडे क्रिकेट खेली है. वह जानना चाहते हैं कि उन्हें किस तरह के रवैये और मनोदशा की जरुरत है. भारतीय कप्तान बोले कि उनके जैसे बल्लेबाजों को आत्मविश्वास और फॉर्म हासिल करने के लिए अतिरिक्त मैच देना जरूरी है. आईपीएल के शुरुआती 4-5 मैचों में नहीं चले थे, लेकिन आप देखिए कि बाद में उन्होंने क्या किया. सूर्यकुमार की भूमिका के बारे में इशारा करते हुए रोहित बोले कि उनके जैसे खिलाड़ी के लिए हमारा काम हालात बनाना है. अगर आप दो-तीन मैचों में अच्छा नहीं करते, तो कोई बात नहीं. लेकिन जब आप फॉर्म में आते हैं, तो हम जातने हैं कि आप हमारे लिए मैच जीतोगे. कुछ ऐसा ही उन्होंने तीसरे टी20 मैच में किया. जब शीर्ष बल्लेबाज आउट हो गए, तो सूर्या ने अपने ही अंदाज में बैटिंग की. यह एक अलग फॉर्मेट है, लेकिन हमें देखना होगा कि कितने लंबे समय हम यह खींच सकते हैं (नंबर-4 पर सुर्यकुमार) * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-11 18:02:27","image_url":"https://c.ndtvimg.com/2023-08/rh0oh8kg_suryakumar-yadav-afp_625x300_10_August_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Juventus, i dettagli economici della cessione di De Winter: 8 milioni più bonus","link":"https://www.tuttomercatoweb.com/serie-a/juventus-i-dettagli-economici-della-cessione-di-de-winter-8-milioni-piu-bonus-1863205","keywords":["Serie A"],"creator":null,"video_url":null,"description":"Attraverso i propri canali ufficiali, la Juventus ha reso noti i dettagli del passaggio di Koni De Winter al Genoa, con un comunicato che spiega tutti i passaggi economici: \"Juventus Football Club S.","content":"Attraverso i propri canali ufficiali, la Juventus ha reso noti i dettagli del passaggio di Koni De Winter al Genoa, con un comunicato che spiega tutti i passaggi economici: \"Juventus Football Club S.p.A. comunica di aver raggiunto un accordo con la società Genoa Cricket and Football Club S.p.A. per la cessione, a titolo temporaneo gratuito fino al 30 giugno 2024, del diritto alle prestazioni sportive del calciatore Koni De Winter. L’accordo prevede: • l’obbligo da parte del Genoa di acquisire a titolo definitivo le prestazioni sportive del giocatore al raggiungimento di determinati obiettivi sportivi nel corso della stagione 2023/2024; • la facoltà da parte del Genoa di acquisire a titolo definitivo le prestazioni sportive del giocatore qualora detti obiettivi non fossero raggiunti. Il corrispettivo pattuito per l’acquisizione definitiva, in entrambi i casi, è pari a € 8 milioni, pagabili in quattro esercizi, e potrà essere aumentato al raggiungimento di ulteriori obiettivi, nel corso della durata del contratto di prestazione sportiva con il calciatore, per un ammontare non superiore a € 2 milioni\". Ufficiale | Koni De Winter in prestito al @GenoaCFC — JuventusFC (@juventusfc) August 11, 2023","pubDate":"2023-08-11 22:08:18","image_url":"https://tmw-storage.tcccdn.com/storage/tuttomercatoweb.com/img_notizie/thumb3/83/838fd7208be0595489328181272e1f31-87031-oooz0000.jpeg","source_id":"tuttomercatoweb","category":["sports"],"country":["italy"],"language":"italian"},{"title":"Brothers in cricket!…The Campbell legacy continues Zimbabwe’s rich tradition","link":"https://www.chronicle.co.zw/brothers-in-cricket-the-campbell-legacy-continues-zimbabwes-rich-tradition/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com The dream of many young cricketers is to play alongside their brothers at the highest level and as such the bond between siblings in the world of sport can be a force to reckon with. The cricketing world has in fact witnessed iconic pairs of brothers who left an indomitable legacy because […]","content":"The Chronicle The dream of many young cricketers is to play alongside their brothers at the highest level and as such the bond between siblings in the world of sport can be a force to reckon with. The cricketing world has in fact witnessed iconic pairs of brothers who left an indomitable legacy because of this siblings’ desire to partner in sport. From New Zealand’s McCullum brothers, Brendon and Nathan, to Australia’s Waugh brothers, Steve and Mark, cricket has indeed benefited from extraordinary sibling duos. In India, the “Pathan Bandhu”, Irfan and Yusuf Pathan, enthralled fans with their talents. The list of cricketing siblings is long and it includes among others, Zimbabwe’s legends — the Flower brothers. Andy and Grant Flower, Zimbabwe’s finest talents, graced the cricketing arena in the 90s and early 2000s, leaving an everlasting impression. Andy holds the record for the second-highest individual score in Test cricket, an unbeaten 232 runs while Grant’s remarkable feat of carrying his bat through a completed One Day International (ODI) innings, earned him a distinguished place in cricket history. Zimbabwe cricket is once again witnessing the rise of two brothers destined for greatness — Jonathan and Matthew Campbell. The Campbell legacy was written by their father, the legendary Alistair Campbell and Andy Flower is Campbell brothers’ godfather. The pair are determined to make their mark in the world of cricket. Jonathan has already made a name for himself on the Zimbabwe’s domestic cricket scene, boasting numerous First-Class and List-A caps. His younger brother, Matthew, is on the brink of bursting onto the scene, promising to make his presence felt soon. Having grown up with cricket as an integral part of their lives, the Campbell brothers have always looked up to their father, a former national team player and captain of the Chevrons. For Jonathan, inspiration stems from left-handed cricketers like his father. “My dad has had a huge impact on our game and we are doing our best to make him proud. We looked up to my dad, obviously, he played a lot of cricket and Andy Flower is actually my godfather and recently, someone like Brendan Taylor, a very good cricketer, Sikandar Raza and Sean Williams. There are a lot of left-handed batters, my dad, Andy, Williams so there’s a lot to look up to from the local point of view,” he said. Matthew said: “I just looked up to my father. He achieved a lot in Zimbabwe Cricket and if I can achieve half of that it would be gold.” The two brothers recently participated in the inaugural Zim Cyber City Zim Afro T10 league, showcasing their talent on a global stage. Jonathan’s remarkable catch Cape Town Samp Army under lights at Harare Sports Club added to the excitement of the tournament. “I couldn’t believe it, I know I played well in the trials but from a club cricketer who just came back a year ago from America playing golf to getting picked up as a professional cricketer is crazy, I didn’t expect it at all,” said Mathew, who played for the Johannesburg Buffaloes. Both brothers dream of donning the national colours as they want to follow in their fathers’ footsteps. Alistar achieved remarkable milestones as the captain, including a historic series victory in Pakistan in 1998-99 and qualification for the Super Sixes in the 1999 World Cup. Jonathan has been knocking on the doors of the national team, eagerly awaiting his breakthrough moment. Meanwhile, Mathew aspires to be the best in the world, firmly believing in the power of dreams that continually evolve and lead them on extraordinary paths. “I have been playing professional cricket for five years and this (T10 league) is a stepping stone in the right direction for me. I have played a lot of games for Zimbabwe-A and I am hopefully on the brink of playing for the national side in the months to come so I look forward to that,” said Jonathan. His brothers said: “My dreams continue to change, from playing golf to cricket, two professional tournaments in just over a year. The dreams keep changing but I’m aiming to be the best in the world.” In First-Class cricket, Jonathan has played 21 matches and managed to score 910 runs at an average of 25, 27 and a high score of 73 not out. In List A, he has played 31 games, scored 842 runs and an average of 35, 08 with a high score of 76. The two Campbell brothers look on track to become Zimbabwe’s next big cricket siblings. @brandon_malvin","pubDate":"2023-08-11 22:02:06","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"तिलक वर्मा की World Cup में नंबर-4 पर खेलने की बात, कुछ यह जवाब दिया रोहित शर्मा ने","link":"https://sports.ndtv.com/hindi/cricket/this-is-what-reply-rohit-sharm-give-about-tilak-vermas-claim-for-no-4-for-world-cup-4290326#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"विंडीज के खिलाफ जारी टी20 सीरीज में तिलक वर्मा (Tilak Varma) की बैटिंग के बाद कई समीकरण बदलते दिख रहे हैं","content":"तिलक वर्मा ने Asia Cup और World Cup के लिए नए समीकरण पैदा कर दिए हैं विंडीज के खिलाफ जारी टी20 सीरीज में स्टारों की नाकामी के बीच तिलक वर्मा (Tilak Varma) के उभार ने एक नई बहस छेड़ दी है. पूर्व क्रिकेटरों का एक तबका उन्हें एशिया कप और World Cup तक में नंबर चार बल्लेबाज के लिए दबाव बना रहा है. और वास्तव में जिस तरह की बैटिंग तिलक ने पिछले तीन मैचों में दिखाई है, उससे प्रबंधन भी प्लान बदलने पर मजबूर हो सकता है. और अब कप्तान रोहित शर्मा (Rohit Sharma) ने भी इससे पूरी तरह इनकार नहीं किया विश्व कप में नंबर चार के लिए वर्मा की दावेदारी पर कुछ भी कहने से बचते हुए रोहित ने इस लेफ्टी की तारीफ करते हुए कहा कि वह उदीयमान दिखाई पड़ता है. मैं तिलक को पिछले दो साल से लेकर अभी तक देख चुका हूं. उनकी रन बनाने की भूख बहुत ज्यादा बढ़ गई है. और यही सबसे महत्वपूर्ण बात है. भारतीय कप्तान ने कहा कि मैं देख सकता हूं कि इस उम्र में वह काफी परिपक्व बल्लेबाज हैं. वह बल्लेबाजी को अच्छी तरह जानते हैं. जब मैं उनसे बात करता हूं, तो यह पता चलता है कि वह अपनी बल्लेबाजी को अच्छी तरह जानता है. उसे मालूम है कि कहां शॉट लगाना है और पिच पर समय विशेष पर क्या करना है. रोहित ने कहा कि मैं तिलक के बारे में फिलहाल इतना ही कह सकता हूं. मैं विश्व कप के बारे में नहीं जानता है, लेकिन यह खिलाड़ी प्रतिभाशाली है. और भारत के लिए खेले कुछ ही मैचों में उसने इस बात को बहुत ही अच्छी तरह से साबित किया है. रोहित ने यह भी स्वीकार किया कि युवराज के जाने के बाद से भारत को भरोसेमंद नंबर चार बल्लेबाज हासिल करने में खासा संघर्ष करना पड़ा है. रोहित ने यह भी कहा कि उन्हें पूरा भरोसा है कि केएल राहुल और श्रेयस अय्यर के लिए भले ही एक बार को भले ही एशिया कप के लिए वापसी मुश्किल हो, लेकिन ये दोनों World Cup 2023 के लिए फिट हो जाएंगे. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-11 18:47:00","image_url":"https://c.ndtvimg.com/2023-08/8ja2up8o_tilak-varma_625x300_11_August_23.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"केकेआर कप्तान अब दिल्ली के लिए रणजी ट्रॉफी नहीं खेलना चाहते, NOC मांगी, यह है असल वजह","link":"https://sports.ndtv.com/hindi/cricket/kkr-captain-now-doesnt-to-play-for-delhi-in-ranji-asks-for-noc-these-are-the-reason-4290470#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"डीडीसीए (दिल्ली एवं जिला क्रिकेट संघ) के संयुक्त सचिव राजन मनचंदा ने शुक्रवार को इस घटनाक्रम की पुष्टि की. उन्होंने हालांकि आश्वासन दिया कि दोनों क्रिकेटरों से बात की जाएगी","content":"नीतिश राणा IPL में केकेआर की कप्तानी करते हैं दिल्ली क्रिकेट के लिए मुश्किलें कम होने का नाम नहीं ले रही हैं क्योंकि पूर्व कप्तान और IPL में केकेआर की कप्तानी करने वाले नितीश राणा (Nitish Rana) अब राज्य के लिए रणजी ट्रॉफी नहीं खेलना चाहते हैं. उन्होंने दिल्ली एवं जिला क्रिकेट संघ (डीडीसीए) से अनापत्ति प्रमाण-पत्र मांगा है. नितीश के अलावा पिछले साल रणजी ट्रॉफी में टीम के लिए सबसे ज्यादा रन बनाने वाले ध्रुव शोरे एक और खिलाड़ी हैं, जो अब दिल्ली के लिए नहीं खेलना चाहते. डीडीसीए (दिल्ली एवं जिला क्रिकेट संघ) के संयुक्त सचिव राजन मनचंदा ने शुक्रवार को इस घटनाक्रम की पुष्टि की. उन्होंने हालांकि आश्वासन दिया कि दोनों क्रिकेटरों से बात की जाएगी और उनकी परेशानी को धैर्यपूर्वक सुना जाएगा ताकि पता लगाया जा सके कि वे ऐसा निर्णय क्यों लेना चाहते हैं. वैसे नितीश राणा के साथ कई बातें जिनके कारण वह अब दिल्ली के लिए नहीं खेलना चाहते. आप वजहे जान लीजिए. दिल्ली ने पिछले सीजन में रेड बॉल फॉर्मेट में बीच सीजन में ही नितीश को कप्तानी से हटकर युवा यश धुल को कप्तान बना दिया था. हालांकि, राणा का प्रदर्शन बहुत ही ज्यादा खराब रहा था. और इसी के कारण सेलेक्टरों को यह फैसला लेना पड़ा. लेकिन राणा का कहना था कि धुल एक ही सीजन दिल्ली के लिए खेले थे और उन्हें कप्तानी से हटाना सही फैसला नहीं था नितीशा राणा को दिल्ली के ड्रेसिंग रूम में भी कुछ खिलाड़ियों से परेशानी है. इस साल IPL में मुंबई इंडियंस के लिए खेल रहे रितिक शौकीन और उनके बीच हुए वॉक-युद्ध के दौरान सभी ने देखा कि मामला कितना गरम हो गया था. और सूर्यकुमार साहित तमाम खिलाड़ियों ने इनके बीच-बचाव कराया. रितिक ने रेड बॉल से दिल्ली के लिए भी अच्छा प्रदर्शन किया था. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-11 18:33:14","image_url":"https://c.ndtvimg.com/2021-04/jgme8i88_nitish-rana-kkr-instagram-630_240x180_03_April_21.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"India vs West Indies: US' Lauderhill Stadium in numbers and how Men in Blue and Windies have fared here","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-us-lauderhill-stadium-in-numbers-and-how-men-in-blue-and-windies-have-fared-here-12986542.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs West Indies: US' Lauderhill Stadium in numbers and how Men in Blue and Windies have fared here","content":"Cricket India vs West Indies: US' Lauderhill Stadium in numbers and how Men in Blue and Windies have fared here India and West Indies arrive in the United States of America for the fourth and fifth T20Is, which will take place at Lauderhill in Broward County, Florida over the weekend. FirstCricket Staff Last Updated:August 12, 2023 00:03:03 IST The Central Broward Regional Park Stadium Turf Ground in Lauderhill, Florida hosted the first-ever international match in the United States of America in the summer of 2010. Image credit: Twitter/@windiescricket India’s tour of the Caribbean and the United States has come down to it’s final weekend, the tournament spanning exactly a month and featuring all three formats with the Indians triumphing in the Tests and ODIs and now setting their sights on the T20I victory. The ongoing T20I series began in Tarouba and then moved to Guyana in South America for the next two matches. After India’s clinical victory in the third T20I that kept their hopes of a series win hanging by a thread, the two sides move to a whole new continent for the last two matches. Read | Ingenious India and brilliant SKY fightback to stay alive in T20Is Related Articles India vs West Indies 3rd ODI: Undercooked Men in Blue hope to improve in series decider India vs West Indies: Shai Hope recalled for five-match T20I series The two sides arrive in the United States of America for the fourth and fifth T20Is, which will take place at Lauderhill in Broward County, Florida. And with India sending out a warning to their opponents with their clinical chase on Tuesday after losing the first two games by a narrow margin, the weekend promises to be an action-packed, closely-contested affair that should be a fitting conclusion to the tour. Miami ✈️ #TeamIndia | #WIvIND pic.twitter.com/SKJTbj0hgS — BCCI (@BCCI) August 10, 2023 Ahead of the last two games of the tour, we take a look at the history behind the Central Broward Regional Park Stadium Turf Ground that will play host to the business end of India’s ongoing tour: History: Though it is gradually expanding its reach in the American market through the introduction of the Major League Cricket (MLC) along with plans for hosting the T20 World Cup in that region next year, cricket in the United States remains in its infancy and is still primarily limited to the south Asian and the Caribbean diaspora. This despite the fact that the first-ever recorded international match was said to have taken place not between England and Australia, but between the United States and Canada in 1844. The CBRSP in Lauderhill — a town that has a large Caribbean American population and is located close to Miami — happens to be the primary cricket venue in the USA and is one of the two American venues that has hosted international matches. It all started with the two-match T20I series between New Zealand and Sri Lanka in May, 2010 that ended in a 1-1 draw. The Black Caps would also feature in the first-ever match hosted by West Indies on American soil — two years since the T20I series against Sri Lanka. The Windies would end up winning both matches in the T20I series to complete a sweep, before heading back to the Caribbean for the ODIs and Tests. Statistics The venue has hosted a total of six ODIs and 14 T20Is since the first-ever match at the start of the previous decade. As far as T20Is are concerned, the venue is a high-scoring one which primarily favours the side opting to bat. Out of the 14 T20Is that have taken place at this venue till date, teams batting first have won 11 while the one batting second have won only two, with one game getting abandoned. Here’s a detailed look at the ODI and T20I statistics pertaining to this venue: T20Is Total matches: 14 Matches won batting first: 11 Matches won batting second: 2 Matches ending in a tie: 0 Matches ending in a ‘No Result’: 1 Highest total: 245/6, West Indies vs India, 2016 Lowest total: 81, New Zealand vs Sri Lanka, 2010 Highest individual score: KL Rahul (India), 110 not out vs West Indies, 2016 ODIs Total matches: 6 Matches won batting first: 4 Matches won batting second: 2 Matches tied: 0 Matches ending in a ‘No Result’: 0 Highest total: 287/8, Namibia vs United States, 2019 Lowest total: 115, Papua New Guinea vs United States, 2019 Highest individual score: JP Kotze (Namibia), 136 vs United States, 2019 West Indies’ record at this venue Since hosting their first match in the United States in 2012, the West Indians have played a total of 10 matches at Lauderhill, winning three and losing six with one match ending in a no-result. They would start off by winning each of their first three games — sweeping the two-match series against New Zealand in 2012 and beating India in the first of the two matches in 2016, with the second one getting rained off. The Men in Maroon would then go on to lose every single match that they have played at this venue. Their highest total at this venue happens to be the 245/6 that they posted against India in 2016. India’s record at this venue India made their American debut during the 2016 tour, in which they played two T20Is in Florida. They would lose their opening game by just one run in a high-scoring encounter in which the West Indians posted 245/6 on the board. India, in reply, would finish on 244/4 — their highest-total at this venue — with KL Rahul’s unbeaten 110 taking them to the brink of victory. India have played a total of six T20Is at Lauderhill and their graph follows a direction that is completely opposite to that of the West Indies. After losing their opening game, with the next one in the same tour getting rained off, India have won each of their last four matches at this venue — two each in 2019 and 2022 respectively. Published on: August 11, 2023 16:25:08 IST Tags: Central Broward Regional Park Stadium Cricket India Vs West Indies West Indies Vs India","pubDate":"2023-08-11 18:33:03","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/Central-Broward-Regional-Park-Stadium-Turf-Ground-Twitter-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Sachin Tendulkar: ব্য়াট হাতে বাইশ গজে নয়, এবার অটো চালকের আসনে সচিন!","link":"https://bengali.abplive.com/sports/cricket/sachin-tendulkar-shares-special-post-on-social-media-picture-goes-viral-1000405","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: খেলোয়াড় হিসাবে অনেকদিনই অবসর নিয়েছেন সচিন তেন্ডুলকর (Sachin Tendulkar)। তবে তাতে তাঁর জনপ্রিয়তায় এতটুকু ভাটা পড়েনি। তিনি সোশ্যাল মিডিয়ায় যাই পোস্ট করেন, তাই হু হু করে ভাইরাল হয়ে যায়। এতে 'মাস্টার ব্লাস্টার'-এর জনপ্রিয়তার পরিচয় পাওয়া যায়। সম্প্রতি সোশ্যাল মিডিয়ায় ফের একটি ছবি পোস্ট করেছেন তিনি, যা বেশ ভাইরাল হয়েছে। বর্তমানে ছুটি কাটাচ্ছেন সচিন তেন্ডুলকর। তিনি আপাতত শ্রীলঙ্কায় (Sri Lanka) রয়েছেন। সেখানেই এক অটোতে বসে সচিন একটি ছবি তোলেন। তিনি সোশ্যাল মিডিয়ায় সেই ছবি শেয়ার করে ক্যাপশনে লেখেন, 'মুম্বইকরকে মুম্বইয়ের বাইরে নিয়ে যাওয়া সম্ভব, তবে..... ' এরপরেই সচিন যে জায়গায় এই ছবিটি তোলা সেই জায়গাটির নামও শেয়ার করেন। সচিন জানান তিনি আপাতত শ্রীলঙ্কার রুমানওয়েলায় রয়েছেন।             View this post on Instagram                       A post shared by Sachin Tendulkar (@sachintendulkar)   প্রসঙ্গত, দ্বীপরাষ্ট্রে শুধু ছুটি কাটানোই নয়, ক্রিকেটের কিংবদন্তি না না সমাজ সচেতনতামূলক কাজেও লিপ্ত রয়েছেন। দিন কয়েক আগেই তিনি সোশ্যাল মিডিয়াতেই আরও একটি পোস্ট শেয়ার করেছিলেন যেখানে সচিনের মানবিক রূপটা ভেসে উঠেছিল। বোলারদের রাতের ঘুম কেড়ে নেওয়া সচিন মাঠের বাইরে উদার। তিনি কখনও সাফাইকর্মীদের সঙ্গে জঞ্জাল পরিষ্কার করার কাজে হাত লাগান। তো তাঁকে আবার কখনও দুঃস্থ শিশুদের পড়াশোনার দায়িত্ব নিতে দেখা গিয়েছে। শ্রীলঙ্কাতেই ছুটি কাটানোর মাঝে কিছু খুদের সঙ্গে সময় কাটান সচিন। খুদেগের কাণ্ড মন জিতে নিয়েছে সচিনের। যিনি ইউনিসেফের (UNICEF) দূতও। সেই কাজে বিশ্বের বিভিন্ন প্রান্তে সচেতনতামূলক প্রচার চালান। সচিন নিজের সোশ্যাল মিডিয়ায় একটি ছবি পোস্ট করেছেন। সেই ছবিতে তাঁকে দেখা যাচ্ছে সবুজের মাঝে। এক ঝাঁক স্কুল পড়ুয়ার সঙ্গে। মাস্টার ব্লাস্টার লিখেছেন, ‘শিশুরাই সেরা শিক্ষক। সহরজ জিনিসের মধ্যেও ওরা আমাদের জ্ঞানের উন্মোচন ঘটায়। শ্রীলঙ্কার প্রত্যন্ত এক গ্রামের এই স্কুলে আমরা সহমর্মিতা উদযাপন করলাম।’ কীভাবে? ব্যাখ্যা করেছেন সচিন। লিখেছেন, ‘প্রত্যেক ছাত্র তাদের প্লেট থেকে অল্প পরিমাণ খাবার বাঁচিয়ে একটা বড় থালায় রেখেছিল। তারপর সেই খাবার পাখিদের খাওয়ানো হয়। ভাগ করে নেওয়ার অসাধারণ এক ভাবনা। আমরা কৃতজ্ঞ। এটা সকলেরই অনুকরণ করা উচিত।’  আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপ ও বিশ্বকাপে বাংলাদেশকে নেতৃত্ব দেবেন কে? ঘোষণা হয়ে গেল শুক্রবার","content":"কলম্বো: খেলোয়াড় হিসাবে অনেকদিনই অবসর নিয়েছেন সচিন তেন্ডুলকর (Sachin Tendulkar)। তবে তাতে তাঁর জনপ্রিয়তায় এতটুকু ভাটা পড়েনি। তিনি সোশ্যাল মিডিয়ায় যাই পোস্ট করেন, তাই হু হু করে ভাইরাল হয়ে যায়। এতে 'মাস্টার ব্লাস্টার'-এর জনপ্রিয়তার পরিচয় পাওয়া যায়। সম্প্রতি সোশ্যাল মিডিয়ায় ফের একটি ছবি পোস্ট করেছেন তিনি, যা বেশ ভাইরাল হয়েছে। বর্তমানে ছুটি কাটাচ্ছেন সচিন তেন্ডুলকর। তিনি আপাতত শ্রীলঙ্কায় (Sri Lanka) রয়েছেন। সেখানেই এক অটোতে বসে সচিন একটি ছবি তোলেন। তিনি সোশ্যাল মিডিয়ায় সেই ছবি শেয়ার করে ক্যাপশনে লেখেন, 'মুম্বইকরকে মুম্বইয়ের বাইরে নিয়ে যাওয়া সম্ভব, তবে..... ' এরপরেই সচিন যে জায়গায় এই ছবিটি তোলা সেই জায়গাটির নামও শেয়ার করেন। সচিন জানান তিনি আপাতত শ্রীলঙ্কার রুমানওয়েলায় রয়েছেন। View this post on Instagram A post shared by Sachin Tendulkar (@sachintendulkar) googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); প্রসঙ্গত, দ্বীপরাষ্ট্রে শুধু ছুটি কাটানোই নয়, ক্রিকেটের কিংবদন্তি না না সমাজ সচেতনতামূলক কাজেও লিপ্ত রয়েছেন। দিন কয়েক আগেই তিনি সোশ্যাল মিডিয়াতেই আরও একটি পোস্ট শেয়ার করেছিলেন যেখানে সচিনের মানবিক রূপটা ভেসে উঠেছিল। বোলারদের রাতের ঘুম কেড়ে নেওয়া সচিন মাঠের বাইরে উদার। তিনি কখনও সাফাইকর্মীদের সঙ্গে জঞ্জাল পরিষ্কার করার কাজে হাত লাগান। তো তাঁকে আবার কখনও দুঃস্থ শিশুদের পড়াশোনার দায়িত্ব নিতে দেখা গিয়েছে। শ্রীলঙ্কাতেই ছুটি কাটানোর মাঝে কিছু খুদের সঙ্গে সময় কাটান সচিন। খুদেগের কাণ্ড মন জিতে নিয়েছে সচিনের। যিনি ইউনিসেফের (UNICEF) দূতও। সেই কাজে বিশ্বের বিভিন্ন প্রান্তে সচেতনতামূলক প্রচার চালান। সচিন নিজের সোশ্যাল মিডিয়ায় একটি ছবি পোস্ট করেছেন। সেই ছবিতে তাঁকে দেখা যাচ্ছে সবুজের মাঝে। এক ঝাঁক স্কুল পড়ুয়ার সঙ্গে। মাস্টার ব্লাস্টার লিখেছেন, ‘শিশুরাই সেরা শিক্ষক। সহরজ জিনিসের মধ্যেও ওরা আমাদের জ্ঞানের উন্মোচন ঘটায়। শ্রীলঙ্কার প্রত্যন্ত এক গ্রামের এই স্কুলে আমরা সহমর্মিতা উদযাপন করলাম।’ কীভাবে? ব্যাখ্যা করেছেন সচিন। লিখেছেন, ‘প্রত্যেক ছাত্র তাদের প্লেট থেকে অল্প পরিমাণ খাবার বাঁচিয়ে একটা বড় থালায় রেখেছিল। তারপর সেই খাবার পাখিদের খাওয়ানো হয়। ভাগ করে নেওয়ার অসাধারণ এক ভাবনা। আমরা কৃতজ্ঞ। এটা সকলেরই অনুকরণ করা উচিত।’ আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপ ও বিশ্বকাপে বাংলাদেশকে নেতৃত্ব দেবেন কে? ঘোষণা হয়ে গেল শুক্রবার var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-08-11 18:28:12","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/11/c1ca1a6bbcc078bb1e40d2e4744529a01691777793654507_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Samson is due some runs and won't get a better pitch: Jaffer ahead of 4th T20I","link":"https://www.indiatoday.in/sports/cricket/story/wi-vs-ind-sanju-samson-is-due-some-runs-and-he-wont-get-a-better-pitch-says-wasim-jaffer-ahead-of-4th-t20i-2419893-2023-08-11?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Samson is due some runs and won't get a better pitch: Jaffer ahead of 4th T20I","content":null,"pubDate":"2023-08-11 18:15:30","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"'भारतीय टीम को बर्बाद किया जा रहा है', वर्ल्ड कप से पहले पूर्व पाकिस्तानी खिलाड़ी ने उगला जहर","link":"https://www.indiatv.in/sports/cricket/former-pakistan-bowler-sarfraz-nawaz-on-indian-cricket-team-before-odi-world-cup-2023-experiments-2023-08-11-980706","keywords":null,"creator":null,"video_url":null,"description":"वनडे वर्ल्ड कप से पहले पाकिस्तान के पूर्व तेज गेंदबाज सरफराज नवाज ने बड़ा बयान दिया है।","content":"वनडे वर्ल्ड कप 2023 की शुरुआत भारत की धरती पर 8 अक्टूबर से हो रही है। वर्ल्ड कप का फाइनल मुकाबला 19 नवंबर को खेला जाएगा। टीम इंडिया पिछले 10 सालों से एक भी आईसीसी टूर्नामेंट नहीं जीत पाई है। वहीं, वर्ल्ड कप से कुछ दिन पहले ही वेस्टइंडीज दौरे पर टीम इंडिया में कई बदलाव हुए हैं। टीम के कई स्टार खिलाड़ी चोटिल हैं, जो इस समय एनसीए में हैं। अब वर्ल्ड कप से पहले ही पाकिस्तान के पूर्व तेज गेंदबाज सरफराज नवाज ने बड़ा बयान दिया है। सरफराज नवाज ने शुक्रवार को लाहौर में पत्रकारों से कहा कि पाकिस्तान की टीम भारत की तुलना में एशिया कप और विश्वकप के लिए अधिक व्यवस्थित और स्थिर नजर आती है। भारतीय टीम इन प्रमुख टूर्नामेंट्स से पहले अभी तक अपना अंतिम संयोजन तैयार नहीं कर पाई है। कप्तान बदले जा रहे हैं, कई नए खिलाड़ियों को आजमाया जा रहा है और ऐसे में भारतीय टीम उचित संयोजन तैयार नहीं कर पाई है। मेरा मानना है कि भारतीय टीम को तैयार करने के बजाए बर्बाद किया जा रहा है। सरफराज ने इसके साथ ही कहा कि भारत पर अपनी धरती पर विश्वकप खेलने और पिछले 10 सालों से आईसीसी ट्रॉफी नहीं जीतने का दबाव भी रहेगा। उन्होंने कहा कि जब आप स्वदेश में खेल रहे होते हैं तो निश्चित तौर पर आप से काफी उम्मीद की जाती है, जिससे कि दबाव बनता है। भारत के लिए अच्छी बात यह है कि उनके पास कुछ अच्छे सीनियर खिलाड़ी हैं। टीम इंडिया में पिछले कुछ समय लगातार बदलाव हुए हैं, जिससे कई बड़े सवाल खड़े हुए। वेस्टइंडीज के खिलाफ पहले वनडे मैच में भारतीय कप्तान रोहित शर्मा नंबर सात पर उतरे थे। वहीं, विराट कोहली को बल्लेबाजी करने का मौका ही नहीं मिला। इसके बाद दूसरे और तीसरे वनडे मैच से इन दोनों खिलाड़ियों को रेस्ट दे दिया। ये बदलाव उस समय हुए जब वर्ल्ड कप में कुछ ही समय बचा हुआ है।","pubDate":"2023-08-11 18:12:25","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"‘Honorary Welshwoman’ Shabnim Ismail brings worldwide spirit to Welsh Fire","link":"https://www.businesslend.com/sports/honorary-welshwoman-shabnim-ismail-brings-international-spirit-to-welsh-fire/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on the whole lot from biking to boxing Sign as much as our free sport e-mail for all the most recent information Shabnim Ismail has revealed how representing Welsh Fire in The Hundred helps her fill the void left by her [...] The post ‘Honorary Welshwoman’ Shabnim Ismail brings worldwide spirit to Welsh Fire appeared first on BusinessLend.","content":"Shabnim Ismail has revealed how representing Welsh Fire in The Hundred helps her fill the void left by her retirement from worldwide cricket. The tempo bowler has been integral to reviving the fortunes of the Cardiff-based aspect, who completed all-time low final summer time, and powered them to the highest of the desk with a nerveless hat-trick on the demise to see off Birmingham Phoenix on Thursday night time. Ismail is a confirmed winner within the 100-ball format, having helped Oval Invincibles to the title in 2021 and 2022, however didn’t shrink from the problem after being drafted by the struggling Fire and has thrown herself into the duty. The 34-year-old known as an finish to her South Africa profession earlier this yr however feels that doing her bit for the principality helps her discover her peak efficiency. “When I moved I didn’t really realise it wasn’t just Welsh Fire the club, but Wales the country. I’m so proud to play in the Welsh colours,” she instructed the PA information company. “I’m calling myself an honorary Welshwoman, of course! I’m retired from internationals but I’m lucky that I still get to play for a country. To represent a nation, it almost feels like I’m back with South Africa at a World Cup. It makes me play with my heart on my sleeve and do well for them. “I was nervous first of all coming into the team but it has been like a family, an amazing welcome. I always say I can only produce the goods and play to the best of my ability when I’m comfortable in the environment and here I know I can speak my mind with no drama, everybody trusts me.” Ismail definitely had no drawback discovering her best kind when she conjured a traditional end to defeat the Phoenix in a nail-biter at Edgbaston. Defending 4 runs from the final three balls of the match she dismissed Tess Flintoff, Erin Burns and Issy Wong. More exceptional than the feat itself, although, was the truth that Ismail didn’t even realise she had achieved it. I did not even hear the gang initially, nevertheless it pumped me up once I did. I believe we made the entire of Birmingham indignant. “I knew exactly what I wanted to do and I told the team I wanted the last five balls. But I was so in the zone I didn’t even know I had a hat-trick,” she stated. “I just didn’t realise it was three in a row, in my head every wicket was a dot ball. I didn’t even hear the crowd initially, but it pumped me up when I did. I think we made the whole of Birmingham angry.” Welsh Fire now discover themselves within the surprising place of main the way in which after two years of under-delivering however, if that could be a shock to some, Ismail known as it earlier than a ball had been bowled. “When I met Breesey (head coach Gareth Breese), I told him ‘we are going to win this’,” she stated. “I told him things will be different this year. He told me ‘baby steps, one at a time’ but I keep telling him we’ve got this. Now we all believe, we know we can do it.” Manchester United agree cope with Fenerbahce for Fred","pubDate":"2023-08-11 18:11:32","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"रोहित ने सूर्यकुमार की वनडे में भूमिका को लेकर दिया बड़ा इशारा, भारतीय कप्तान बोले कि...","link":"https://sports.ndtv.com/hindi/cricket/captain-rohit-gives-big-indication-about-suryakumar-yadav-role-in-odi-4291325#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"सूर्यकुमार को लेकर वनडे में किया गया निवेश अभी तक नाकाम रहा है. और World Cup नजदीक देखते हुए अब द्रविड़ एंड कंपनी उन्हें लेकर प्लान बदलती दिख रही है","content":"Asia Cup 2023 की दिशा में समय आगे चल पड़ा है, तो तिलक वर्मा (Tilak Varma) के उभार के साथ ही नंबर-4 को लेकर चर्चा ने जोर पकड़ लिया है. केएल राहुल (KL Rahul) और श्रेयस अय्यर (Shreyas Iyer) चोटिल हैं, तो बाकी बल्लेबाज आउट ऑफ फॉर्म हो चले हैं. पिछले कुछ समय में भारत ने नंबर चार के लिए सूर्यकुमार यादव (Suryakumar Yadav) में निवेश किया था, लेकिन इससे मनवांछित परिणाम नहीं मिला. \\ इसी विषय पर जहां रोहित शर्मा ने वनडे में फॉर्म हासिल करने के लिए सूर्यकुमार यादव का समर्थन किया है, लेकिन उन्होंने यह भी कहा कि हमें देखना होगा कि टी20 में विश्व कप सर्वश्रेष्ठ बल्लेबाज का कितने लंबे समय तक समर्थन किया जा सकता है. मैनेजमेंट ने अब यादव को वनडे में नंबर छह पर धकेल दिया है. कोच राहुल द्रविड़ ने यादव से खुद को नंबर छह के लिए तैयार रखने के लिए कह दिया है. रोहित बोले कि सूर्य कड़ी मेहनत कर रहे हैं. वह उन दिग्गजों से बहुत ज्यादा बात कर रहे हैं, जिन्होंने बहुत ज्यादा वनडे क्रिकेट खेली है. वह जानना चाहते हैं कि उन्हें किस तरह के रवैये और मनोदशा की जरुरत है. भारतीय कप्तान बोले कि उनके जैसे बल्लेबाजों को आत्मविश्वास और फॉर्म हासिल करने के लिए अतिरिक्त मैच देना जरूरी है. आईपीएल के शुरुआती 4-5 मैचों में नहीं चले थे, लेकिन आप देखिए कि बाद में उन्होंने क्या किया. सूर्यकुमार की भूमिका के बारे में इशारा करते हुए रोहित बोले कि उनके जैसे खिलाड़ी के लिए हमारा काम हालात बनाना है. अगर आप दो-तीन मैचों में अच्छा नहीं करते, तो कोई बात नहीं. लेकिन जब आप फॉर्म में आते हैं, तो हम जातने हैं कि आप हमारे लिए मैच जीतोगे. कुछ ऐसा ही उन्होंने तीसरे टी20 मैच में किया. जब शीर्ष बल्लेबाज आउट हो गए, तो सूर्या ने अपने ही अंदाज में बैटिंग की. यह एक अलग फॉर्मेट है, लेकिन हमें देखना होगा कि कितने लंबे समय हम यह खींच सकते हैं (नंबर-4 पर सुर्यकुमार) * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-11 18:02:27","image_url":"https://c.ndtvimg.com/2023-08/rh0oh8kg_suryakumar-yadav-afp_625x300_10_August_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Juventus, i dettagli economici della cessione di De Winter: 8 milioni più bonus","link":"https://www.tuttomercatoweb.com/serie-a/juventus-i-dettagli-economici-della-cessione-di-de-winter-8-milioni-piu-bonus-1863205","keywords":["Serie A"],"creator":null,"video_url":null,"description":"Attraverso i propri canali ufficiali, la Juventus ha reso noti i dettagli del passaggio di Koni De Winter al Genoa, con un comunicato che spiega tutti i passaggi economici: \"Juventus Football Club S.","content":"Attraverso i propri canali ufficiali, la Juventus ha reso noti i dettagli del passaggio di Koni De Winter al Genoa, con un comunicato che spiega tutti i passaggi economici: \"Juventus Football Club S.p.A. comunica di aver raggiunto un accordo con la società Genoa Cricket and Football Club S.p.A. per la cessione, a titolo temporaneo gratuito fino al 30 giugno 2024, del diritto alle prestazioni sportive del calciatore Koni De Winter. L’accordo prevede: • l’obbligo da parte del Genoa di acquisire a titolo definitivo le prestazioni sportive del giocatore al raggiungimento di determinati obiettivi sportivi nel corso della stagione 2023/2024; • la facoltà da parte del Genoa di acquisire a titolo definitivo le prestazioni sportive del giocatore qualora detti obiettivi non fossero raggiunti. Il corrispettivo pattuito per l’acquisizione definitiva, in entrambi i casi, è pari a € 8 milioni, pagabili in quattro esercizi, e potrà essere aumentato al raggiungimento di ulteriori obiettivi, nel corso della durata del contratto di prestazione sportiva con il calciatore, per un ammontare non superiore a € 2 milioni\". Ufficiale | Koni De Winter in prestito al @GenoaCFC — JuventusFC (@juventusfc) August 11, 2023","pubDate":"2023-08-11 22:08:18","image_url":"https://tmw-storage.tcccdn.com/storage/tuttomercatoweb.com/img_notizie/thumb3/83/838fd7208be0595489328181272e1f31-87031-oooz0000.jpeg","source_id":"tuttomercatoweb","category":["sports"],"country":["italy"],"language":"italian"},{"title":"Brothers in cricket!…The Campbell legacy continues Zimbabwe’s rich tradition","link":"https://www.chronicle.co.zw/brothers-in-cricket-the-campbell-legacy-continues-zimbabwes-rich-tradition/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com The dream of many young cricketers is to play alongside their brothers at the highest level and as such the bond between siblings in the world of sport can be a force to reckon with. The cricketing world has in fact witnessed iconic pairs of brothers who left an indomitable legacy because […]","content":"The Chronicle The dream of many young cricketers is to play alongside their brothers at the highest level and as such the bond between siblings in the world of sport can be a force to reckon with. The cricketing world has in fact witnessed iconic pairs of brothers who left an indomitable legacy because of this siblings’ desire to partner in sport. From New Zealand’s McCullum brothers, Brendon and Nathan, to Australia’s Waugh brothers, Steve and Mark, cricket has indeed benefited from extraordinary sibling duos. In India, the “Pathan Bandhu”, Irfan and Yusuf Pathan, enthralled fans with their talents. The list of cricketing siblings is long and it includes among others, Zimbabwe’s legends — the Flower brothers. Andy and Grant Flower, Zimbabwe’s finest talents, graced the cricketing arena in the 90s and early 2000s, leaving an everlasting impression. Andy holds the record for the second-highest individual score in Test cricket, an unbeaten 232 runs while Grant’s remarkable feat of carrying his bat through a completed One Day International (ODI) innings, earned him a distinguished place in cricket history. Zimbabwe cricket is once again witnessing the rise of two brothers destined for greatness — Jonathan and Matthew Campbell. The Campbell legacy was written by their father, the legendary Alistair Campbell and Andy Flower is Campbell brothers’ godfather. The pair are determined to make their mark in the world of cricket. Jonathan has already made a name for himself on the Zimbabwe’s domestic cricket scene, boasting numerous First-Class and List-A caps. His younger brother, Matthew, is on the brink of bursting onto the scene, promising to make his presence felt soon. Having grown up with cricket as an integral part of their lives, the Campbell brothers have always looked up to their father, a former national team player and captain of the Chevrons. For Jonathan, inspiration stems from left-handed cricketers like his father. “My dad has had a huge impact on our game and we are doing our best to make him proud. We looked up to my dad, obviously, he played a lot of cricket and Andy Flower is actually my godfather and recently, someone like Brendan Taylor, a very good cricketer, Sikandar Raza and Sean Williams. There are a lot of left-handed batters, my dad, Andy, Williams so there’s a lot to look up to from the local point of view,” he said. Matthew said: “I just looked up to my father. He achieved a lot in Zimbabwe Cricket and if I can achieve half of that it would be gold.” The two brothers recently participated in the inaugural Zim Cyber City Zim Afro T10 league, showcasing their talent on a global stage. Jonathan’s remarkable catch Cape Town Samp Army under lights at Harare Sports Club added to the excitement of the tournament. “I couldn’t believe it, I know I played well in the trials but from a club cricketer who just came back a year ago from America playing golf to getting picked up as a professional cricketer is crazy, I didn’t expect it at all,” said Mathew, who played for the Johannesburg Buffaloes. Both brothers dream of donning the national colours as they want to follow in their fathers’ footsteps. Alistar achieved remarkable milestones as the captain, including a historic series victory in Pakistan in 1998-99 and qualification for the Super Sixes in the 1999 World Cup. Jonathan has been knocking on the doors of the national team, eagerly awaiting his breakthrough moment. Meanwhile, Mathew aspires to be the best in the world, firmly believing in the power of dreams that continually evolve and lead them on extraordinary paths. “I have been playing professional cricket for five years and this (T10 league) is a stepping stone in the right direction for me. I have played a lot of games for Zimbabwe-A and I am hopefully on the brink of playing for the national side in the months to come so I look forward to that,” said Jonathan. His brothers said: “My dreams continue to change, from playing golf to cricket, two professional tournaments in just over a year. The dreams keep changing but I’m aiming to be the best in the world.” In First-Class cricket, Jonathan has played 21 matches and managed to score 910 runs at an average of 25, 27 and a high score of 73 not out. In List A, he has played 31 games, scored 842 runs and an average of 35, 08 with a high score of 76. The two Campbell brothers look on track to become Zimbabwe’s next big cricket siblings. @brandon_malvin","pubDate":"2023-08-11 22:02:06","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"तिलक वर्मा की World Cup में नंबर-4 पर खेलने की बात, कुछ यह जवाब दिया रोहित शर्मा ने","link":"https://sports.ndtv.com/hindi/cricket/this-is-what-reply-rohit-sharm-give-about-tilak-vermas-claim-for-no-4-for-world-cup-4290326#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"विंडीज के खिलाफ जारी टी20 सीरीज में तिलक वर्मा (Tilak Varma) की बैटिंग के बाद कई समीकरण बदलते दिख रहे हैं","content":"तिलक वर्मा ने Asia Cup और World Cup के लिए नए समीकरण पैदा कर दिए हैं विंडीज के खिलाफ जारी टी20 सीरीज में स्टारों की नाकामी के बीच तिलक वर्मा (Tilak Varma) के उभार ने एक नई बहस छेड़ दी है. पूर्व क्रिकेटरों का एक तबका उन्हें एशिया कप और World Cup तक में नंबर चार बल्लेबाज के लिए दबाव बना रहा है. और वास्तव में जिस तरह की बैटिंग तिलक ने पिछले तीन मैचों में दिखाई है, उससे प्रबंधन भी प्लान बदलने पर मजबूर हो सकता है. और अब कप्तान रोहित शर्मा (Rohit Sharma) ने भी इससे पूरी तरह इनकार नहीं किया विश्व कप में नंबर चार के लिए वर्मा की दावेदारी पर कुछ भी कहने से बचते हुए रोहित ने इस लेफ्टी की तारीफ करते हुए कहा कि वह उदीयमान दिखाई पड़ता है. मैं तिलक को पिछले दो साल से लेकर अभी तक देख चुका हूं. उनकी रन बनाने की भूख बहुत ज्यादा बढ़ गई है. और यही सबसे महत्वपूर्ण बात है. भारतीय कप्तान ने कहा कि मैं देख सकता हूं कि इस उम्र में वह काफी परिपक्व बल्लेबाज हैं. वह बल्लेबाजी को अच्छी तरह जानते हैं. जब मैं उनसे बात करता हूं, तो यह पता चलता है कि वह अपनी बल्लेबाजी को अच्छी तरह जानता है. उसे मालूम है कि कहां शॉट लगाना है और पिच पर समय विशेष पर क्या करना है. रोहित ने कहा कि मैं तिलक के बारे में फिलहाल इतना ही कह सकता हूं. मैं विश्व कप के बारे में नहीं जानता है, लेकिन यह खिलाड़ी प्रतिभाशाली है. और भारत के लिए खेले कुछ ही मैचों में उसने इस बात को बहुत ही अच्छी तरह से साबित किया है. रोहित ने यह भी स्वीकार किया कि युवराज के जाने के बाद से भारत को भरोसेमंद नंबर चार बल्लेबाज हासिल करने में खासा संघर्ष करना पड़ा है. रोहित ने यह भी कहा कि उन्हें पूरा भरोसा है कि केएल राहुल और श्रेयस अय्यर के लिए भले ही एक बार को भले ही एशिया कप के लिए वापसी मुश्किल हो, लेकिन ये दोनों World Cup 2023 के लिए फिट हो जाएंगे. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-11 18:47:00","image_url":"https://c.ndtvimg.com/2023-08/8ja2up8o_tilak-varma_625x300_11_August_23.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"केकेआर कप्तान अब दिल्ली के लिए रणजी ट्रॉफी नहीं खेलना चाहते, NOC मांगी, यह है असल वजह","link":"https://sports.ndtv.com/hindi/cricket/kkr-captain-now-doesnt-to-play-for-delhi-in-ranji-asks-for-noc-these-are-the-reason-4290470#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"डीडीसीए (दिल्ली एवं जिला क्रिकेट संघ) के संयुक्त सचिव राजन मनचंदा ने शुक्रवार को इस घटनाक्रम की पुष्टि की. उन्होंने हालांकि आश्वासन दिया कि दोनों क्रिकेटरों से बात की जाएगी","content":"नीतिश राणा IPL में केकेआर की कप्तानी करते हैं दिल्ली क्रिकेट के लिए मुश्किलें कम होने का नाम नहीं ले रही हैं क्योंकि पूर्व कप्तान और IPL में केकेआर की कप्तानी करने वाले नितीश राणा (Nitish Rana) अब राज्य के लिए रणजी ट्रॉफी नहीं खेलना चाहते हैं. उन्होंने दिल्ली एवं जिला क्रिकेट संघ (डीडीसीए) से अनापत्ति प्रमाण-पत्र मांगा है. नितीश के अलावा पिछले साल रणजी ट्रॉफी में टीम के लिए सबसे ज्यादा रन बनाने वाले ध्रुव शोरे एक और खिलाड़ी हैं, जो अब दिल्ली के लिए नहीं खेलना चाहते. डीडीसीए (दिल्ली एवं जिला क्रिकेट संघ) के संयुक्त सचिव राजन मनचंदा ने शुक्रवार को इस घटनाक्रम की पुष्टि की. उन्होंने हालांकि आश्वासन दिया कि दोनों क्रिकेटरों से बात की जाएगी और उनकी परेशानी को धैर्यपूर्वक सुना जाएगा ताकि पता लगाया जा सके कि वे ऐसा निर्णय क्यों लेना चाहते हैं. वैसे नितीश राणा के साथ कई बातें जिनके कारण वह अब दिल्ली के लिए नहीं खेलना चाहते. आप वजहे जान लीजिए. दिल्ली ने पिछले सीजन में रेड बॉल फॉर्मेट में बीच सीजन में ही नितीश को कप्तानी से हटकर युवा यश धुल को कप्तान बना दिया था. हालांकि, राणा का प्रदर्शन बहुत ही ज्यादा खराब रहा था. और इसी के कारण सेलेक्टरों को यह फैसला लेना पड़ा. लेकिन राणा का कहना था कि धुल एक ही सीजन दिल्ली के लिए खेले थे और उन्हें कप्तानी से हटाना सही फैसला नहीं था नितीशा राणा को दिल्ली के ड्रेसिंग रूम में भी कुछ खिलाड़ियों से परेशानी है. इस साल IPL में मुंबई इंडियंस के लिए खेल रहे रितिक शौकीन और उनके बीच हुए वॉक-युद्ध के दौरान सभी ने देखा कि मामला कितना गरम हो गया था. और सूर्यकुमार साहित तमाम खिलाड़ियों ने इनके बीच-बचाव कराया. रितिक ने रेड बॉल से दिल्ली के लिए भी अच्छा प्रदर्शन किया था. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-11 18:33:14","image_url":"https://c.ndtvimg.com/2021-04/jgme8i88_nitish-rana-kkr-instagram-630_240x180_03_April_21.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"India vs West Indies: US' Lauderhill Stadium in numbers and how Men in Blue and Windies have fared here","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-us-lauderhill-stadium-in-numbers-and-how-men-in-blue-and-windies-have-fared-here-12986542.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs West Indies: US' Lauderhill Stadium in numbers and how Men in Blue and Windies have fared here","content":"Cricket India vs West Indies: US' Lauderhill Stadium in numbers and how Men in Blue and Windies have fared here India and West Indies arrive in the United States of America for the fourth and fifth T20Is, which will take place at Lauderhill in Broward County, Florida over the weekend. FirstCricket Staff Last Updated:August 12, 2023 00:03:03 IST The Central Broward Regional Park Stadium Turf Ground in Lauderhill, Florida hosted the first-ever international match in the United States of America in the summer of 2010. Image credit: Twitter/@windiescricket India’s tour of the Caribbean and the United States has come down to it’s final weekend, the tournament spanning exactly a month and featuring all three formats with the Indians triumphing in the Tests and ODIs and now setting their sights on the T20I victory. The ongoing T20I series began in Tarouba and then moved to Guyana in South America for the next two matches. After India’s clinical victory in the third T20I that kept their hopes of a series win hanging by a thread, the two sides move to a whole new continent for the last two matches. Read | Ingenious India and brilliant SKY fightback to stay alive in T20Is Related Articles India vs West Indies 3rd ODI: Undercooked Men in Blue hope to improve in series decider India vs West Indies: Shai Hope recalled for five-match T20I series The two sides arrive in the United States of America for the fourth and fifth T20Is, which will take place at Lauderhill in Broward County, Florida. And with India sending out a warning to their opponents with their clinical chase on Tuesday after losing the first two games by a narrow margin, the weekend promises to be an action-packed, closely-contested affair that should be a fitting conclusion to the tour. Miami ✈️ #TeamIndia | #WIvIND pic.twitter.com/SKJTbj0hgS — BCCI (@BCCI) August 10, 2023 Ahead of the last two games of the tour, we take a look at the history behind the Central Broward Regional Park Stadium Turf Ground that will play host to the business end of India’s ongoing tour: History: Though it is gradually expanding its reach in the American market through the introduction of the Major League Cricket (MLC) along with plans for hosting the T20 World Cup in that region next year, cricket in the United States remains in its infancy and is still primarily limited to the south Asian and the Caribbean diaspora. This despite the fact that the first-ever recorded international match was said to have taken place not between England and Australia, but between the United States and Canada in 1844. The CBRSP in Lauderhill — a town that has a large Caribbean American population and is located close to Miami — happens to be the primary cricket venue in the USA and is one of the two American venues that has hosted international matches. It all started with the two-match T20I series between New Zealand and Sri Lanka in May, 2010 that ended in a 1-1 draw. The Black Caps would also feature in the first-ever match hosted by West Indies on American soil — two years since the T20I series against Sri Lanka. The Windies would end up winning both matches in the T20I series to complete a sweep, before heading back to the Caribbean for the ODIs and Tests. Statistics The venue has hosted a total of six ODIs and 14 T20Is since the first-ever match at the start of the previous decade. As far as T20Is are concerned, the venue is a high-scoring one which primarily favours the side opting to bat. Out of the 14 T20Is that have taken place at this venue till date, teams batting first have won 11 while the one batting second have won only two, with one game getting abandoned. Here’s a detailed look at the ODI and T20I statistics pertaining to this venue: T20Is Total matches: 14 Matches won batting first: 11 Matches won batting second: 2 Matches ending in a tie: 0 Matches ending in a ‘No Result’: 1 Highest total: 245/6, West Indies vs India, 2016 Lowest total: 81, New Zealand vs Sri Lanka, 2010 Highest individual score: KL Rahul (India), 110 not out vs West Indies, 2016 ODIs Total matches: 6 Matches won batting first: 4 Matches won batting second: 2 Matches tied: 0 Matches ending in a ‘No Result’: 0 Highest total: 287/8, Namibia vs United States, 2019 Lowest total: 115, Papua New Guinea vs United States, 2019 Highest individual score: JP Kotze (Namibia), 136 vs United States, 2019 West Indies’ record at this venue Since hosting their first match in the United States in 2012, the West Indians have played a total of 10 matches at Lauderhill, winning three and losing six with one match ending in a no-result. They would start off by winning each of their first three games — sweeping the two-match series against New Zealand in 2012 and beating India in the first of the two matches in 2016, with the second one getting rained off. The Men in Maroon would then go on to lose every single match that they have played at this venue. Their highest total at this venue happens to be the 245/6 that they posted against India in 2016. India’s record at this venue India made their American debut during the 2016 tour, in which they played two T20Is in Florida. They would lose their opening game by just one run in a high-scoring encounter in which the West Indians posted 245/6 on the board. India, in reply, would finish on 244/4 — their highest-total at this venue — with KL Rahul’s unbeaten 110 taking them to the brink of victory. India have played a total of six T20Is at Lauderhill and their graph follows a direction that is completely opposite to that of the West Indies. After losing their opening game, with the next one in the same tour getting rained off, India have won each of their last four matches at this venue — two each in 2019 and 2022 respectively. Published on: August 11, 2023 16:25:08 IST Tags: Central Broward Regional Park Stadium Cricket India Vs West Indies West Indies Vs India","pubDate":"2023-08-11 18:33:03","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/Central-Broward-Regional-Park-Stadium-Turf-Ground-Twitter-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Sachin Tendulkar: ব্য়াট হাতে বাইশ গজে নয়, এবার অটো চালকের আসনে সচিন!","link":"https://bengali.abplive.com/sports/cricket/sachin-tendulkar-shares-special-post-on-social-media-picture-goes-viral-1000405","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: খেলোয়াড় হিসাবে অনেকদিনই অবসর নিয়েছেন সচিন তেন্ডুলকর (Sachin Tendulkar)। তবে তাতে তাঁর জনপ্রিয়তায় এতটুকু ভাটা পড়েনি। তিনি সোশ্যাল মিডিয়ায় যাই পোস্ট করেন, তাই হু হু করে ভাইরাল হয়ে যায়। এতে 'মাস্টার ব্লাস্টার'-এর জনপ্রিয়তার পরিচয় পাওয়া যায়। সম্প্রতি সোশ্যাল মিডিয়ায় ফের একটি ছবি পোস্ট করেছেন তিনি, যা বেশ ভাইরাল হয়েছে। বর্তমানে ছুটি কাটাচ্ছেন সচিন তেন্ডুলকর। তিনি আপাতত শ্রীলঙ্কায় (Sri Lanka) রয়েছেন। সেখানেই এক অটোতে বসে সচিন একটি ছবি তোলেন। তিনি সোশ্যাল মিডিয়ায় সেই ছবি শেয়ার করে ক্যাপশনে লেখেন, 'মুম্বইকরকে মুম্বইয়ের বাইরে নিয়ে যাওয়া সম্ভব, তবে..... ' এরপরেই সচিন যে জায়গায় এই ছবিটি তোলা সেই জায়গাটির নামও শেয়ার করেন। সচিন জানান তিনি আপাতত শ্রীলঙ্কার রুমানওয়েলায় রয়েছেন।             View this post on Instagram                       A post shared by Sachin Tendulkar (@sachintendulkar)   প্রসঙ্গত, দ্বীপরাষ্ট্রে শুধু ছুটি কাটানোই নয়, ক্রিকেটের কিংবদন্তি না না সমাজ সচেতনতামূলক কাজেও লিপ্ত রয়েছেন। দিন কয়েক আগেই তিনি সোশ্যাল মিডিয়াতেই আরও একটি পোস্ট শেয়ার করেছিলেন যেখানে সচিনের মানবিক রূপটা ভেসে উঠেছিল। বোলারদের রাতের ঘুম কেড়ে নেওয়া সচিন মাঠের বাইরে উদার। তিনি কখনও সাফাইকর্মীদের সঙ্গে জঞ্জাল পরিষ্কার করার কাজে হাত লাগান। তো তাঁকে আবার কখনও দুঃস্থ শিশুদের পড়াশোনার দায়িত্ব নিতে দেখা গিয়েছে। শ্রীলঙ্কাতেই ছুটি কাটানোর মাঝে কিছু খুদের সঙ্গে সময় কাটান সচিন। খুদেগের কাণ্ড মন জিতে নিয়েছে সচিনের। যিনি ইউনিসেফের (UNICEF) দূতও। সেই কাজে বিশ্বের বিভিন্ন প্রান্তে সচেতনতামূলক প্রচার চালান। সচিন নিজের সোশ্যাল মিডিয়ায় একটি ছবি পোস্ট করেছেন। সেই ছবিতে তাঁকে দেখা যাচ্ছে সবুজের মাঝে। এক ঝাঁক স্কুল পড়ুয়ার সঙ্গে। মাস্টার ব্লাস্টার লিখেছেন, ‘শিশুরাই সেরা শিক্ষক। সহরজ জিনিসের মধ্যেও ওরা আমাদের জ্ঞানের উন্মোচন ঘটায়। শ্রীলঙ্কার প্রত্যন্ত এক গ্রামের এই স্কুলে আমরা সহমর্মিতা উদযাপন করলাম।’ কীভাবে? ব্যাখ্যা করেছেন সচিন। লিখেছেন, ‘প্রত্যেক ছাত্র তাদের প্লেট থেকে অল্প পরিমাণ খাবার বাঁচিয়ে একটা বড় থালায় রেখেছিল। তারপর সেই খাবার পাখিদের খাওয়ানো হয়। ভাগ করে নেওয়ার অসাধারণ এক ভাবনা। আমরা কৃতজ্ঞ। এটা সকলেরই অনুকরণ করা উচিত।’  আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপ ও বিশ্বকাপে বাংলাদেশকে নেতৃত্ব দেবেন কে? ঘোষণা হয়ে গেল শুক্রবার","content":"কলম্বো: খেলোয়াড় হিসাবে অনেকদিনই অবসর নিয়েছেন সচিন তেন্ডুলকর (Sachin Tendulkar)। তবে তাতে তাঁর জনপ্রিয়তায় এতটুকু ভাটা পড়েনি। তিনি সোশ্যাল মিডিয়ায় যাই পোস্ট করেন, তাই হু হু করে ভাইরাল হয়ে যায়। এতে 'মাস্টার ব্লাস্টার'-এর জনপ্রিয়তার পরিচয় পাওয়া যায়। সম্প্রতি সোশ্যাল মিডিয়ায় ফের একটি ছবি পোস্ট করেছেন তিনি, যা বেশ ভাইরাল হয়েছে। বর্তমানে ছুটি কাটাচ্ছেন সচিন তেন্ডুলকর। তিনি আপাতত শ্রীলঙ্কায় (Sri Lanka) রয়েছেন। সেখানেই এক অটোতে বসে সচিন একটি ছবি তোলেন। তিনি সোশ্যাল মিডিয়ায় সেই ছবি শেয়ার করে ক্যাপশনে লেখেন, 'মুম্বইকরকে মুম্বইয়ের বাইরে নিয়ে যাওয়া সম্ভব, তবে..... ' এরপরেই সচিন যে জায়গায় এই ছবিটি তোলা সেই জায়গাটির নামও শেয়ার করেন। সচিন জানান তিনি আপাতত শ্রীলঙ্কার রুমানওয়েলায় রয়েছেন। View this post on Instagram A post shared by Sachin Tendulkar (@sachintendulkar) googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); প্রসঙ্গত, দ্বীপরাষ্ট্রে শুধু ছুটি কাটানোই নয়, ক্রিকেটের কিংবদন্তি না না সমাজ সচেতনতামূলক কাজেও লিপ্ত রয়েছেন। দিন কয়েক আগেই তিনি সোশ্যাল মিডিয়াতেই আরও একটি পোস্ট শেয়ার করেছিলেন যেখানে সচিনের মানবিক রূপটা ভেসে উঠেছিল। বোলারদের রাতের ঘুম কেড়ে নেওয়া সচিন মাঠের বাইরে উদার। তিনি কখনও সাফাইকর্মীদের সঙ্গে জঞ্জাল পরিষ্কার করার কাজে হাত লাগান। তো তাঁকে আবার কখনও দুঃস্থ শিশুদের পড়াশোনার দায়িত্ব নিতে দেখা গিয়েছে। শ্রীলঙ্কাতেই ছুটি কাটানোর মাঝে কিছু খুদের সঙ্গে সময় কাটান সচিন। খুদেগের কাণ্ড মন জিতে নিয়েছে সচিনের। যিনি ইউনিসেফের (UNICEF) দূতও। সেই কাজে বিশ্বের বিভিন্ন প্রান্তে সচেতনতামূলক প্রচার চালান। সচিন নিজের সোশ্যাল মিডিয়ায় একটি ছবি পোস্ট করেছেন। সেই ছবিতে তাঁকে দেখা যাচ্ছে সবুজের মাঝে। এক ঝাঁক স্কুল পড়ুয়ার সঙ্গে। মাস্টার ব্লাস্টার লিখেছেন, ‘শিশুরাই সেরা শিক্ষক। সহরজ জিনিসের মধ্যেও ওরা আমাদের জ্ঞানের উন্মোচন ঘটায়। শ্রীলঙ্কার প্রত্যন্ত এক গ্রামের এই স্কুলে আমরা সহমর্মিতা উদযাপন করলাম।’ কীভাবে? ব্যাখ্যা করেছেন সচিন। লিখেছেন, ‘প্রত্যেক ছাত্র তাদের প্লেট থেকে অল্প পরিমাণ খাবার বাঁচিয়ে একটা বড় থালায় রেখেছিল। তারপর সেই খাবার পাখিদের খাওয়ানো হয়। ভাগ করে নেওয়ার অসাধারণ এক ভাবনা। আমরা কৃতজ্ঞ। এটা সকলেরই অনুকরণ করা উচিত।’ আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপ ও বিশ্বকাপে বাংলাদেশকে নেতৃত্ব দেবেন কে? ঘোষণা হয়ে গেল শুক্রবার var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-08-11 18:28:12","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/11/c1ca1a6bbcc078bb1e40d2e4744529a01691777793654507_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Samson is due some runs and won't get a better pitch: Jaffer ahead of 4th T20I","link":"https://www.indiatoday.in/sports/cricket/story/wi-vs-ind-sanju-samson-is-due-some-runs-and-he-wont-get-a-better-pitch-says-wasim-jaffer-ahead-of-4th-t20i-2419893-2023-08-11?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Samson is due some runs and won't get a better pitch: Jaffer ahead of 4th T20I","content":null,"pubDate":"2023-08-11 18:15:30","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"'भारतीय टीम को बर्बाद किया जा रहा है', वर्ल्ड कप से पहले पूर्व पाकिस्तानी खिलाड़ी ने उगला जहर","link":"https://www.indiatv.in/sports/cricket/former-pakistan-bowler-sarfraz-nawaz-on-indian-cricket-team-before-odi-world-cup-2023-experiments-2023-08-11-980706","keywords":null,"creator":null,"video_url":null,"description":"वनडे वर्ल्ड कप से पहले पाकिस्तान के पूर्व तेज गेंदबाज सरफराज नवाज ने बड़ा बयान दिया है।","content":"वनडे वर्ल्ड कप 2023 की शुरुआत भारत की धरती पर 8 अक्टूबर से हो रही है। वर्ल्ड कप का फाइनल मुकाबला 19 नवंबर को खेला जाएगा। टीम इंडिया पिछले 10 सालों से एक भी आईसीसी टूर्नामेंट नहीं जीत पाई है। वहीं, वर्ल्ड कप से कुछ दिन पहले ही वेस्टइंडीज दौरे पर टीम इंडिया में कई बदलाव हुए हैं। टीम के कई स्टार खिलाड़ी चोटिल हैं, जो इस समय एनसीए में हैं। अब वर्ल्ड कप से पहले ही पाकिस्तान के पूर्व तेज गेंदबाज सरफराज नवाज ने बड़ा बयान दिया है। सरफराज नवाज ने शुक्रवार को लाहौर में पत्रकारों से कहा कि पाकिस्तान की टीम भारत की तुलना में एशिया कप और विश्वकप के लिए अधिक व्यवस्थित और स्थिर नजर आती है। भारतीय टीम इन प्रमुख टूर्नामेंट्स से पहले अभी तक अपना अंतिम संयोजन तैयार नहीं कर पाई है। कप्तान बदले जा रहे हैं, कई नए खिलाड़ियों को आजमाया जा रहा है और ऐसे में भारतीय टीम उचित संयोजन तैयार नहीं कर पाई है। मेरा मानना है कि भारतीय टीम को तैयार करने के बजाए बर्बाद किया जा रहा है। सरफराज ने इसके साथ ही कहा कि भारत पर अपनी धरती पर विश्वकप खेलने और पिछले 10 सालों से आईसीसी ट्रॉफी नहीं जीतने का दबाव भी रहेगा। उन्होंने कहा कि जब आप स्वदेश में खेल रहे होते हैं तो निश्चित तौर पर आप से काफी उम्मीद की जाती है, जिससे कि दबाव बनता है। भारत के लिए अच्छी बात यह है कि उनके पास कुछ अच्छे सीनियर खिलाड़ी हैं। टीम इंडिया में पिछले कुछ समय लगातार बदलाव हुए हैं, जिससे कई बड़े सवाल खड़े हुए। वेस्टइंडीज के खिलाफ पहले वनडे मैच में भारतीय कप्तान रोहित शर्मा नंबर सात पर उतरे थे। वहीं, विराट कोहली को बल्लेबाजी करने का मौका ही नहीं मिला। इसके बाद दूसरे और तीसरे वनडे मैच से इन दोनों खिलाड़ियों को रेस्ट दे दिया। ये बदलाव उस समय हुए जब वर्ल्ड कप में कुछ ही समय बचा हुआ है।","pubDate":"2023-08-11 18:12:25","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"‘Honorary Welshwoman’ Shabnim Ismail brings worldwide spirit to Welsh Fire","link":"https://www.businesslend.com/sports/honorary-welshwoman-shabnim-ismail-brings-international-spirit-to-welsh-fire/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on the whole lot from biking to boxing Sign as much as our free sport e-mail for all the most recent information Shabnim Ismail has revealed how representing Welsh Fire in The Hundred helps her fill the void left by her [...] The post ‘Honorary Welshwoman’ Shabnim Ismail brings worldwide spirit to Welsh Fire appeared first on BusinessLend.","content":"Shabnim Ismail has revealed how representing Welsh Fire in The Hundred helps her fill the void left by her retirement from worldwide cricket. The tempo bowler has been integral to reviving the fortunes of the Cardiff-based aspect, who completed all-time low final summer time, and powered them to the highest of the desk with a nerveless hat-trick on the demise to see off Birmingham Phoenix on Thursday night time. Ismail is a confirmed winner within the 100-ball format, having helped Oval Invincibles to the title in 2021 and 2022, however didn’t shrink from the problem after being drafted by the struggling Fire and has thrown herself into the duty. The 34-year-old known as an finish to her South Africa profession earlier this yr however feels that doing her bit for the principality helps her discover her peak efficiency. “When I moved I didn’t really realise it wasn’t just Welsh Fire the club, but Wales the country. I’m so proud to play in the Welsh colours,” she instructed the PA information company. “I’m calling myself an honorary Welshwoman, of course! I’m retired from internationals but I’m lucky that I still get to play for a country. To represent a nation, it almost feels like I’m back with South Africa at a World Cup. It makes me play with my heart on my sleeve and do well for them. “I was nervous first of all coming into the team but it has been like a family, an amazing welcome. I always say I can only produce the goods and play to the best of my ability when I’m comfortable in the environment and here I know I can speak my mind with no drama, everybody trusts me.” Ismail definitely had no drawback discovering her best kind when she conjured a traditional end to defeat the Phoenix in a nail-biter at Edgbaston. Defending 4 runs from the final three balls of the match she dismissed Tess Flintoff, Erin Burns and Issy Wong. More exceptional than the feat itself, although, was the truth that Ismail didn’t even realise she had achieved it. I did not even hear the gang initially, nevertheless it pumped me up once I did. I believe we made the entire of Birmingham indignant. “I knew exactly what I wanted to do and I told the team I wanted the last five balls. But I was so in the zone I didn’t even know I had a hat-trick,” she stated. “I just didn’t realise it was three in a row, in my head every wicket was a dot ball. I didn’t even hear the crowd initially, but it pumped me up when I did. I think we made the whole of Birmingham angry.” Welsh Fire now discover themselves within the surprising place of main the way in which after two years of under-delivering however, if that could be a shock to some, Ismail known as it earlier than a ball had been bowled. “When I met Breesey (head coach Gareth Breese), I told him ‘we are going to win this’,” she stated. “I told him things will be different this year. He told me ‘baby steps, one at a time’ but I keep telling him we’ve got this. Now we all believe, we know we can do it.” Manchester United agree cope with Fenerbahce for Fred","pubDate":"2023-08-11 18:11:32","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"रोहित ने सूर्यकुमार की वनडे में भूमिका को लेकर दिया बड़ा इशारा, भारतीय कप्तान बोले कि...","link":"https://sports.ndtv.com/hindi/cricket/captain-rohit-gives-big-indication-about-suryakumar-yadav-role-in-odi-4291325#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"सूर्यकुमार को लेकर वनडे में किया गया निवेश अभी तक नाकाम रहा है. और World Cup नजदीक देखते हुए अब द्रविड़ एंड कंपनी उन्हें लेकर प्लान बदलती दिख रही है","content":"Asia Cup 2023 की दिशा में समय आगे चल पड़ा है, तो तिलक वर्मा (Tilak Varma) के उभार के साथ ही नंबर-4 को लेकर चर्चा ने जोर पकड़ लिया है. केएल राहुल (KL Rahul) और श्रेयस अय्यर (Shreyas Iyer) चोटिल हैं, तो बाकी बल्लेबाज आउट ऑफ फॉर्म हो चले हैं. पिछले कुछ समय में भारत ने नंबर चार के लिए सूर्यकुमार यादव (Suryakumar Yadav) में निवेश किया था, लेकिन इससे मनवांछित परिणाम नहीं मिला. \\ इसी विषय पर जहां रोहित शर्मा ने वनडे में फॉर्म हासिल करने के लिए सूर्यकुमार यादव का समर्थन किया है, लेकिन उन्होंने यह भी कहा कि हमें देखना होगा कि टी20 में विश्व कप सर्वश्रेष्ठ बल्लेबाज का कितने लंबे समय तक समर्थन किया जा सकता है. मैनेजमेंट ने अब यादव को वनडे में नंबर छह पर धकेल दिया है. कोच राहुल द्रविड़ ने यादव से खुद को नंबर छह के लिए तैयार रखने के लिए कह दिया है. रोहित बोले कि सूर्य कड़ी मेहनत कर रहे हैं. वह उन दिग्गजों से बहुत ज्यादा बात कर रहे हैं, जिन्होंने बहुत ज्यादा वनडे क्रिकेट खेली है. वह जानना चाहते हैं कि उन्हें किस तरह के रवैये और मनोदशा की जरुरत है. भारतीय कप्तान बोले कि उनके जैसे बल्लेबाजों को आत्मविश्वास और फॉर्म हासिल करने के लिए अतिरिक्त मैच देना जरूरी है. आईपीएल के शुरुआती 4-5 मैचों में नहीं चले थे, लेकिन आप देखिए कि बाद में उन्होंने क्या किया. सूर्यकुमार की भूमिका के बारे में इशारा करते हुए रोहित बोले कि उनके जैसे खिलाड़ी के लिए हमारा काम हालात बनाना है. अगर आप दो-तीन मैचों में अच्छा नहीं करते, तो कोई बात नहीं. लेकिन जब आप फॉर्म में आते हैं, तो हम जातने हैं कि आप हमारे लिए मैच जीतोगे. कुछ ऐसा ही उन्होंने तीसरे टी20 मैच में किया. जब शीर्ष बल्लेबाज आउट हो गए, तो सूर्या ने अपने ही अंदाज में बैटिंग की. यह एक अलग फॉर्मेट है, लेकिन हमें देखना होगा कि कितने लंबे समय हम यह खींच सकते हैं (नंबर-4 पर सुर्यकुमार) * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-08-11 18:02:27","image_url":"https://c.ndtvimg.com/2023-08/rh0oh8kg_suryakumar-yadav-afp_625x300_10_August_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"}]}