{"newsArray":[{"title":"In his place of birth, Ajaz Patel joins Kumble and Laker in exclusive 10-for club - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvaW4taGlzLXBsYWNlLW9mLWJpcnRoLWFqYXotcGF0ZWwtam9pbnMta3VtYmxlLWFuZC1sYWtlci1pbi1leGNsdXNpdmUtMTAtZm9yLWNsdWItNzY1NTk3OS_SAY8BaHR0cHM6Ly9pbmRpYW5leHByZXNzLmNvbS9hcnRpY2xlL3Nwb3J0cy9jcmlja2V0L2luLWhpcy1wbGFjZS1vZi1iaXJ0aC1hamF6LXBhdGVsLWpvaW5zLWt1bWJsZS1hbmQtbGFrZXItaW4tZXhjbHVzaXZlLTEwLWZvci1jbHViLTc2NTU5NzkvbGl0ZS8?oc=5","keywords":null,"creator":null,"video_url":null,"description":"In his place of birth, Ajaz Patel joins Kumble and Laker in exclusive 10-for club  The Indian ExpressThese kind of things probably don't sink in till much later: Ajaz Patel  CricbuzzIND vs NZ 2021: Watch - Ajaz Patel's Historic 10-Wicket Haul  Cricket AddictorStars Have Aligned, Very Special to Come Back to Mumbai And Achieve Something Like This: Ajaz Patel  News18Ajaz Patel's magical 10-fer makes me fall in love with cricket again: Simon Doull  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2021-12-04 21:27:27","image_url":null,"source_id":"google"},{"title":"A perfect 10! Kiwi Ajaz Patel spins history on ‘home’ pitch - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9uZXctemVhbGFuZC1pbi1pbmRpYS9hLXBlcmZlY3QtMTAta2l3aS1hamF6LXBhdGVsLXNwaW5zLWhpc3Rvcnktb24taG9tZS1waXRjaC9hcnRpY2xlc2hvdy84ODA5ODI3MS5jbXPSAZQBaHR0cHM6Ly9tLnRpbWVzb2ZpbmRpYS5jb20vc3BvcnRzL2NyaWNrZXQvbmV3LXplYWxhbmQtaW4taW5kaWEvYS1wZXJmZWN0LTEwLWtpd2ktYWphei1wYXRlbC1zcGlucy1oaXN0b3J5LW9uLWhvbWUtcGl0Y2gvYW1wX2FydGljbGVzaG93Lzg4MDk4MjcxLmNtcw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"A perfect 10! Kiwi Ajaz Patel spins history on ‘home’ pitch  Times of IndiaThese kind of things probably don't sink in till much later: Ajaz Patel  CricbuzzIND vs NZ 2021: Watch - Ajaz Patel's Historic 10-Wicket Haul  Cricket AddictorStars Have Aligned, Very Special to Come Back to Mumbai And Achieve Something Like This: Ajaz Patel  News18Ajaz Patel's magical 10-fer makes me fall in love with cricket again: Simon Doull  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2021-12-04 21:27:00","image_url":null,"source_id":"google"},{"title":"Recent Match Report - Gladiators vs Delhi Bulls Final 2021/22 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc2VyaWVzL2FidS1kaGFiaS10MTAtMjAyMS0yMi0xMjg4OTkwL2RlY2Nhbi1nbGFkaWF0b3JzLXZzLWRlbGhpLWJ1bGxzLWZpbmFsLTEyODkwMjYvbWF0Y2gtcmVwb3J00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Recent Match Report - Gladiators vs Delhi Bulls Final 2021/22  ESPNcricinfoBT vs TAD Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Abu Dhabi T10  Cricket AddictorAbu Dhabi T10 League 2021, 3rd Place Play-off: BT vs TAD Dream11 Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Update  CricTrackerTeam Abu Dhabi vs Bangla Tigers Preview & Prediction  The Stats ZoneKohler-Cadmore and Hasaranga have Gladiators dreaming of T10 title  ESPNcricinfo.comView Full coverage on Google News","content":null,"pubDate":"2021-12-04 20:40:23","image_url":null,"source_id":"google"},{"title":"MAW vs GBM Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Bengal Inter District T20 2021, Match 25","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/maw-vs-gbm-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-bengal-inter-district-t20-2021-match-25?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-04 19:28:16","full_description":"Manbhum Warriors (MAW) will take on Gour Badsha Malda (GBM) in the 25th match of the Bengal Inter District T20 2021 at the Bengal Cricket Academy Ground in Kalyani on Sunday. Manbhum Warriors haven’t had a strong start to their campaign. They lost their opening two matches against Uttar Dinajpur Kulik Bird and Nadia Super Dazzlers. They will look to turn the tide and get a win here. Meanwhile, Gour Badsha Malda have had an even more unremarkable start to their campaign, losing all three games. Bikash Kumar Das (wk), Rana Adhikary (c), Gourav Gupta, Arnab Kundu, Sanjay Mohato, Sourav Dey, Mustafa Ansari, Bishnu Bouri, Bikram Gorain, Afraful Ansari, Rampravesh Prasad. Manas Roy Choudhury (wk), Md Nizamuddin (c), Ananta Pramanik, Md Firoz Hossain, Mrityunjoy Mandal, Jhantu Sanyal, Bakul Das, Rajdeep Chowdhury, Barun Kumar Mahato, Najibul Sk, Suraj Shah Match: MAW vs GBM, Bengal Inter District T20 2021, Match 25. Date and Time: 5th December, 2021; 8:45 AM IST. Venue: Bengal Cricket Academy Ground, Kalyani. The surface is expected to favour bowlers, considering the conditions on offer in the first day of the tournament. The average score here is 100 runs, so the team winning the toss should ideally look to bowl first. M Roy-Choudhury is a decent wicketkeeper choice for your Dream11 Fantasy side. He’s safe behind the stumps, and can also add key runs. R Adhikary is a key batter for Manbhum Warriors. He scored 47 runs and also picked up two wickets in the first match. M Mandal is another player you must have in your Dream11 Fantasy side. Although he failed to make much of an impact in his previous game, Mandal is expected to have a crucial impact for his team in this match. B Das has been consistent in the competition. He has picked up three wickets in three matches so far, and will look to add a few more in this game. R Adhikary (MAW) – 133 points B Das (GBM) – 117 points M Mandal (GBM) – 86 points M Roy Choudhury (GBM) – 86 points M Nizamuddin (GBM) – 67 points. R Adhikary: 48 runs and 2 wickets B Das: 3 wickets M Mandal: 19 runs and 2 wickets M Roy Choudhury: 66 runs M Nizamuddin: 41 runs. Fantasy Suggestion #1: M Roy Choudhury, R Adhikary, M Nizamuddin, G Gupta, M Mandal, M Firoz Hossain, B Bouri, S Dey, B Das, A Ansary, B Gorain. Captain: R Adhikary. Vice-Captain: M Mandal. Fantasy Suggestion #2: M Roy Choudhury, R Adhikary, M Nizamuddin, G Gupta, M Mandal, M Firoz Hossain, B Bouri, A Pramanik, B Das, A Ansary, R Prasad. Captain: M Firoz Hossain. Vice-Captain: B Das.","image_url":"https://static.sportskeeda.com/editor/2021/12/0d762-16386423261273-1920.jpg","source_id":"sportskeeda"},{"title":"WF vs CS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Super Smash 2021-22 Match 4","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/wf-vs-cs-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-super-smash-2021-22?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-04 19:28:16","full_description":"The Wellington Firebirds will be taking on the Central Stags in the fourth match of the Dream11 Super Smash T20 on December 5 at Basin Reserve, Wellington. The Wellington Firebirds had a great start in this season of the Super Smash, winning their first match against the Canterbury Knights by 27 runs. They have quality players in the lineup and will be hoping to replicate their previous performance. Meanwhile, the Central Stags had a similar start to their campaign as they defeated the Otago Sparks by five wickets. They will now look to grab another win against the Firebirds and maintain the top spot. Wellington Firebirds Finn Allen (WK), Luke Georgeson, Nick Greenwood, Michael Bracewell (C), Tim Robinson, Jamie Gibson, Nathan Smith, Logan van Beek, Peter Younghusband , Ben Sears, Hamish Bennett Central Stags Greg Hay, Bayley Wiggins, Dane Cleaver (WK), Ben Smith, Tom Bruce (C), Christian Leopard, Doug Bracewell , Ben Wheeler , Jayden Lennox, Blair Tickner , Seth Rance Match : Wellington Firebirds vs Central Stags, Dream11 Super Smash T20 Date and Time: 5 December, 07.10 am IST Venue : Basin Reserve, Wellington The wicket at Basin Reserve is well-balanced. Batters will enjoy batting on this surface as the ball comes nicely onto the bat while the pacers will receive some initial movement. A target of 170 runs will be a challenging one at this venue. Wicketkeeper Dane Cleaver: Dane will be an excellent option for the wicket-keeper position in today’s game. He played a brilliant 114 run knock in the previous match and is expected to repeat the same. Batters Michael Bracewell: Michael is a reliable batter for the Firebirds who can score big runs and also contribute a few overs with the ball. He scored 27 runs and picked up three wickets in the last game. Greg Hay: Greg smashed 56 runs in the previous game with a strike rate of 121.74. He will be a key player from the batting department in this battle. All-rounders Logan van Beek: Logan can make contributions with both the bat and ball, scoring handy runs and also chipping in a few wickets. He will be a good option for the vice-captain in this game. Doug Bracewell: Doug is another decent option for the all-rounder in today’s match. He can bat in the lower-middle order and also bowl a few overs for his side. Bowlers Hamish Bennett: Hamish scalped two wickets for the Wellington Firebirds in the last game with an economy of 7.50. He can be lethal in death overs and fetch you good points. Seth Rance: Seth Rance was expensive in the previous match but also picked up a wicket. His subtle variations and wicket-taking abilities make him a top-pick for this contest. Dane Cleaver: 170 points Michael Bracewell: 139 points Finn Allen: 99 points Greg Hay: 74 points Nathan Smith: 72 points Dane Cleaver: 1 match, 114 runs Michael Bracewell: 1 match, 27 runs, 3 wickets Finn Allen: 1 match, 57 runs Greg Hay: 1 match, 56 runs Nathan Smith: 1 match, 2 wickets Fantasy Suggestion #1: Dane Cleaver, Finn Allen, Michael Bracewell, Greg Hay, Nick Greenwood, Doug Bracewell, Logan van Beek, Jamie Gibson, Seth Rance, Ben Wheeler, Hamish Bennet Captain: Michael Bracewell Vice-Captain: Greg Hay Fantasy Suggestion #2: Dane Cleaver, Michael Bracewell, Greg Hay, Luke Georgeson, Doug Bracewell, Logan van Beek, Peter Younghusband, Seth Rance, Nathan Smith, Jayden Lennox, Hamish Bennet Captain: Dane Cleaver Vice Captain: Logan van Beek","image_url":"https://static.sportskeeda.com/editor/2021/12/61fdc-16386398665297-1920.jpg","source_id":"sportskeeda"},{"title":"SL-U19 vs EN-U19 Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Youth ODI, Match 3","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/sl-u19-vs-en-u19-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-youth-odi-match-3?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-04 19:28:16","full_description":"Sri Lanka U19 will take on England U19 in the third match of their Youth ODI series, at the Sinhalese Sports Club Ground in Colombo on Sunday. The series has been an interesting one. England U19 won the first ODI. However, the hosts gave a strong account of themselves and bounced back in the second match. Sri Lanka U19 scored 252 runs on the board. They then restricted the visitors to just 103 runs to cap off a wonderful display. Chamindu Wickramasinghe, Anjala Bandara (wk), Shevon Daniel, Pawan Pathiraja, Ranuda Somarathne, Dunith Wellalage (c), Raveen de Silva, Wanuja Sahan, Yasiru Rodrigo, Treveen Mathew, Matheesha Pathirana. Jacob Bethell (c), Tom Prest, George Bell, William Luxton, James Rew, Danial Ibrahim, Rehan Ahmed, James Coles, Thomas Aspinwall, Fateh Singh, Joshua Boyden. Match: SL-U19 vs EN-U19, Youth ODI, Match 3. Date and Time: 5th December, 2021; 9:45 AM IST. Venue: Sinhalese Sports Club Ground, Colombo. The surface is expected to be a balanced one. Both batters and bowlers will look to get the most out of the conditions. J Rew is a decent wicketkeeper choice for your Dream11 Fantasy side. He’s safe behind the stumps, and can also score key runs. P Pathiraja is a key batter for Sri Lanka U19. Pathiraja was sensational in the previous game, and scored a fantastic century. He made 113 runs in 130 balls, an innings that was laced with 13 boundaries. D Wellalage is a wonderful player to have in your Dream11 Fantasy side. He scored 38 runs in his last game, and also picked up a wicket. Wellalage could prove to be a fine multiplier choice in this match. W Sahan is very consistent, and had a wonderful performance in his last match, picking up five wickets. W Sahan (SL-U19) – 183 points P Pathiraja (SL-U19) – 146 points D Wellalage (SL-U19) – 88 points J Rew (SL-U19) – 74 points R Somarathne (SL-U19) – 70 points. W Sahan: 5 wickets P Pathiraja: 113 runs J Rew: 50 runs. Fantasy Suggestion #1: J Rew, P Pathiraja, S Daniel, T Prest, J Bethell, D Wellalage, Y Rodrigo, R Ahmed, W Sahan, R Somarathne, J Boyden. Captain: D Wellalage. Vice-Captain: P Pathiraja. Fantasy Suggestion #2: J Rew, P Pathiraja, S Daniel, C Wickramasinghe, J Bethell, D Wellalage, Y Rodrigo, R Ahmed, W Sahan, R Somarathne, J Boyden. Captain: W Sahan. Vice-Captain: R Ahmed.","image_url":"https://static.sportskeeda.com/editor/2021/12/a2ec4-16386437592090-1920.jpg","source_id":"sportskeeda"},{"title":"Australia and England must find way through Bear Hunt of Ashes obstacles | Geoff Lemon","link":"https://www.theguardian.com/sport/2021/dec/04/australia-and-england-must-find-way-through-ashes-obstacles-cricket","keywords":["Ashes 2021-22","The Ashes","Australia cricket team","England cricket team","Cricket","Sport","Australia sport"],"creator":["Geoff Lemon in Brisbane"],"video_url":null,"description":"From Tim Paine’s resignation to border closures, the buildup to this Ashes series has been about everything but cricketWith the first Ashes Test almost upon us, some things have finally started to settle. In Australia, Tim Paine’s exit as captain and player has been absorbed, with not much time needed to get used to Pat Cummins as the entirely expected successor. A new wicketkeeper and a new vice-captain have been chosen, largely as predicted.In the UK, five weeks after releasing the statement that “Yorkshire County Cricket Club is pleased to announce the actions it has taken” over its investigation into racism, which recommended no action against any of the offenders, the club’s new management has sacked the old staff en masse. Given Yorkshire’s intransigence until now, it was the only viable method of slate-cleaning. Accordingly, the cricket administrators of both countries will be eager to claim some goodwill on entering this marquee series. Continue reading...","content":null,"pubDate":"2021-12-04 19:00:33","full_description":"W ith the first Ashes Test almost upon us, some things have finally started to settle. In Australia, Tim Paine’s exit as captain and player has been absorbed, with not much time needed to get used to Pat Cummins as the entirely expected successor. A new wicketkeeper and a new vice-captain have been chosen, largely as predicted. In the UK, five weeks after releasing the statement that “Yorkshire County Cricket Club is pleased to announce the actions it has taken” over its investigation into racism, which recommended no action against any of the offenders, the club’s new management has sacked the old staff en masse. Given Yorkshire’s intransigence until now, it was the only viable method of slate-cleaning. Accordingly, the cricket administrators of both countries will be eager to claim some goodwill on entering this marquee series. Unfortunately, things are the opposite of being settled in the arena of the virus. You know the one – it has had enough airtime by now. Having seen a new variant, suddenly Australian politicians are back to border closures . The federal government has banned arrivals from some African countries – though not European where cases have been found. In any case, the variant is already in New South Wales. Both Ashes teams have done two weeks of quarantine to enter Queensland on the expectation that travel from there would be open and easy to South Australia, then Victoria, then NSW. Cricket Australia could have avoided that by changing the order of Tests , given Queensland’s proximity to its vaccination target, but the players accepted a relaxed resort quarantine near Brisbane was not significantly more onerous than the precautions they would have needed to take in a training camp in Melbourne or Sydney. But now South Australia is an unknown: some political reporters were briefed on Saturday that a border closure to Victoria and New South Wales was imminent, only for the premier to hold a press conference announcing that it would not happen . This kind of non-announcement tends to be a softener for the change to be implemented later. The players would probably still get into Adelaide from Brisbane, but almost all of the media contingent would be stuck in Melbourne or Sydney, where broadcasters and journalists have planned to cover the match off television to avoid Queensland quarantine. Western Australia’s government has surely ended the last wispy notion of a Perth Test, despite Cricket Australia clinging to the phantasm even as daylight dissolves it. For the teams to play in Perth they would have to fit two weeks of quarantine into the four free days after the Sydney Test, something beyond even the considerable adaptability of Marnus Labuschagne. Another venue is required, several are being considered . Cricket Tasmania is now lobbying CA to get that match, days after savaging CA for encouraging local boy Paine’s resignation over sexual text messages sent to a colleague. “The treatment afforded to the Australian Test captain by Cricket Australia has been appalling and the worst since Bill Lawry over 50 years ago,” was the line from CT chair, Andrew Gaggin. He has been less forthright about the Federal Court sexual harassment case brought against the institution on 26 November by the recipient of Paine’s messages, with reports that at least two other CT employees behaved similarly. CT made sure news outlets knew the organisation had accused the woman of theft, but not that she had already lodged a harassment claim before their accusation was made. Shades of Yorkshire in Hobart. Just another calm and easy Ashes buildup then? At least the sun has come out in Brisbane after 10 days of torrents. The percentages on that sample may not be favourable, but it shows good conditions are possible even under the weeping of La Niña. Boards in trouble always hope people will stop paying attention when the matches start. It is also true that when matches start, it is usually a relief. So it would sting if the first Test is a parade of rain delays. This southern summer was supposed to be the free and easy one, after two bad years. But complications threaten. As any kid who has read We’re All Going on a Bear Hunt knows: we can’t go over it. We can’t go under it. We’ll have to go through it.","image_url":"https://i.guim.co.uk/img/media/001b46116696657a2c1ace4904d17c96d5d07a68/0_365_5472_3283/master/5472.jpg?width=460&quality=85&auto=format&fit=max&s=65ec9c375623c0ded76d290bc7381e28","source_id":"theguardian"},{"title":"Pat Cummins new mission","link":"https://www.news.com.au/sport/pat-cummins-new-mission/video/0bd2d19cf35d81f41d543ba21e41d81b","keywords":null,"creator":null,"video_url":null,"description":"New Australian cricket captain is hoping to improve the lives of children as a new ambassador for UNICEF.","content":null,"pubDate":"2021-12-04 19:00:00","full_description":null,"image_url":null,"source_id":"news"},{"title":"World's oldest test cricket player Eileen Ash passes away at 110","link":"https://zeenews.india.com/cricket/worlds-oldest-test-player-eileen-ash-passes-away-at-110-2416230.html","keywords":null,"creator":null,"video_url":null,"description":"Right-arm seamer Ash played seven tests for England after making her debut against Australia in 1937. She retired in 1949 but she also played golf until the age of 98 and even practiced yoga at the age of 105.","content":null,"pubDate":"2021-12-04 18:26:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Big Bash League 2021 All Teams Squads and Player List","link":"https://thesportsrush.com/cricket-news-big-bash-league-2021-all-teams-squads-and-player-list/","keywords":["Cricket","BBL 11","Big Bash League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Big Bash League 2021 All Teams Squads: The SportsRush present before you full squads of teams taking part in Big Bash League 2021-22. The 11th season of the Big Bash League will kick-start with the first match set to be played between Sydney Sixers and Melbourne Stars in Sydney tomorrow. The proceedings will then move… The post Big Bash League 2021 All Teams Squads and Player List appeared first on The SportsRush.","content":"Big Bash League 2021 All Teams Squads: The SportsRush present before you full squads of teams taking part in Big Bash League 2021-22. The 11th season of the Big Bash League will kick-start with the first match set to be played between Sydney Sixers and Melbourne Stars in Sydney tomorrow. The proceedings will then move to Canberra where Sydney Thunder and Brisbane Heat will lock horns on Monday. Australia’s premier T20 tournament comprises of eight teams which will play 14 matches each (seven home and seven away format) in the league stage. The top five teams will then qualify for the playoffs which will be played between January 21-28. A total of 61 matches will be played across 55 days in BBL 2021-22. A primary reason why this BBL season will be followed more closely by the Indian fans is the presence of former India U-19 captain Unmukt Chand at Melbourne Renegades. Chand, 28, had retired from Indian cricket earlier this year to ply his trade in overseas tournaments. ALSO READ: When and where to watch Big Bash League 11 in India and Australia? Readers must note that Chand is among the 22 overseas players taking part in BBL 11. The most number of overseas players (13) are from England as their senior men’s team is also in Australia to play the Ashes series which will run parallel to the BBL. Big Bash League 2021 All Teams Squads and Player List Adelaide Strikers Travis Head (c), Wes Agar, Fawad Ahmed, Alex Carey, Harry Conway, George Garton (England), Ryan Gibson, Spencer Johnson, Rashid Khan (Afghanistan), Harry Nielsen, Liam O’Connor, Matthew Renshaw, Liam Scott, Matt Short, Peter Siddle, Jake Weatherald, Jon Wells, Daniel Worrall. Look who’s back in the blue The countdown to #BBL11 is officially on pic.twitter.com/5ZfzvE6OJQ — Adelaide Strikers (@StrikersBBL) December 1, 2021 Brisbane Heat Jimmy Peirson (c), Tom Abell (England), Xavier Bartlett, James Bazley, Max Bryant, Hugo Burdon, Tom Cooper, Ben Duckett (England), Cameron Gannon, Liam Guthrie, Sam Heazlett, Matt Kuhnemann, Marnus Labuschagne, Chris Lynn, Nathan McSweeney, Michael Neser, Will Prestwidge, Mark Steketee, Mitchell Swepson, Mujeeb Ur Rahman (Afghanistan), Jack Wildermuth. Hobart Hurricanes Matthew Wade (c), Scott Boland, Harry Brook (England), Tim David, Nathan Ellis, Peter Handscomb, Caleb Jewell, Josh Kann, Sandeep Lamichhane (Nepal), Ben McDermott, Riley Meredith, Mitch Owen, Joel Paris, Wil Parker, Tom Rogers, D’Arcy Short, Jordan Thompson (England), Mac Wright. Melbourne Renegades Nic Maddinson (c), Cameron Boyce, Unmukt Chand (India), Zak Evans, Aaron Finch, Jake Fraser-McGurk, Sam Harper, Marcus Harris, MacKenzie Harvey, Zahir Khan (Afghanistan), Josh Lalor, Shaun Marsh, Jonathan Merlo, Mohammad Nabi (Afghanistan), James Pattinson, Mitch Perry, Jack Prestwidge, Kane Richardson, James Seymour, Will Sutherland, Reece Topley (England). Melbourne Stars Glenn Maxwell (c), Qaid Ahmad (Afghanistan), Joe Burns, Hilton Cartwright, Joe Clarke, Brody Couch, Nathan Coulter-Nile, Sam Elliott, Syed Fariddun (Pakistan), Liam Hatcher, Clint Hinchliffe, Nick Larkin, Peter Nevill, Tom O’Connell, Sam Rainbird, Marcus Stoinis, Beau Webster, Adam Zampa. Yep, you read that right ONE SLEEP TO GO!!! #TeamGreen pic.twitter.com/JlAFbwrJis — Melbourne Stars (@StarsBBL) December 4, 2021 Perth Scorchers Ashton Turner (c), Ashton Agar, Cameron Bancroft, Jason Behrendorff, Cooper Connolly, Laurie Evans (England), Aaron Hardie, Peter Hatzoglou, Nick Hobson, Josh Inglis, Matthew Kelly, Mitchell Marsh, Tymal Mills, David Moody, Lance Morris, Colin Munro (New Zealand), Kurtis Patterson, Jhye Richardson, Andrew Tye. Sydney Sixers Moises Henriques (c), Sean Abbott, Jackson Bird, Dan Christian, Tom Curran (England), Ben Dwarshuis, Jack Edwards, Mickey Edwards, Daniel Hughes, Chris Jordan (England), Hayden Kerr, Nathan Lyon, Ben Manenti, Lawrence Neil-Smith, Stephen O’Keefe, Josh Philippe, Lloyd Pope, Jordan Silk, James Vince (England), Nick Winter. Sydney Thunder Usman Khawaja (c), Sam Billings (England), Jonathan Cook, Ben Cutting, Oliver Davies, Brendan Doggett, Matt Gilkes, Chris Green, Alex Hales (England), Baxter Holt, Saqib Mahmood (England), Nathan McAndrew, Arjun Nair, Alex Ross, Daniel Sams, Gurinder Sandhu, Jason Sangha, Tanveer Sangha, Chris Tremain, Sam Whiteman. The post Big Bash League 2021 All Teams Squads and Player List appeared first on The SportsRush.","pubDate":"2021-12-04 17:57:30","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Ravichandran Ashwin's Post On Ajaz Patel's 10-Wicket Haul Against India Wins Hearts - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL3JhdmljaGFuZHJhbi1hc2h3aW5zLXBvc3Qtb24tYWphei1wYXRlbC1hZnRlci1oaXMtMTAtd2lja2V0LWhhdWwtd2lucy1oZWFydHMtMjYzNzQ2NdIBjAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL3JhdmljaGFuZHJhbi1hc2h3aW5zLXBvc3Qtb24tYWphei1wYXRlbC1hZnRlci1oaXMtMTAtd2lja2V0LWhhdWwtd2lucy1oZWFydHMtMjYzNzQ2NS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ravichandran Ashwin's Post On Ajaz Patel's 10-Wicket Haul Against India Wins Hearts  NDTVSports.comThese kind of things probably don't sink in till much later: Ajaz Patel  CricbuzzIND vs NZ 2021: Watch - Ajaz Patel's Historic 10-Wicket Haul  Cricket AddictorIndia 332 runs ahead against New Zealand - Jammu Kashmir Latest News | Tourism | Breaking News J&K  Daily ExcelsiorAjaz Patel's Perfect 10 | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2021-12-04 16:59:56","image_url":null,"source_id":"google"},{"title":"Eileen Ash, oldest Test cricketer, dies at 110","link":"https://www.indiatvnews.com/sports/cricket/eileen-ash-oldest-test-cricketer-dies-at-110-748115","keywords":null,"creator":null,"video_url":null,"description":"Eileen Ash, the oldest living Test cricketer, has died at the age of 110, the England and Wales Cricket Board (ECB) said on Saturday. Ash played seven Tests for England on either side of the second world war, taking 10 wickets at an average of 23 with her right-arm pace bowling.","content":null,"pubDate":"2021-12-04 16:07:54","full_description":"Eileen Ash, the oldest living Test cricketer, has died at the age of 110, the England and Wales Cricket Board (ECB) said on Saturday. Ash played seven Tests for England on either side of the second world war, taking 10 wickets at an average of 23 with her right-arm pace bowling. Ash was the oldest-ever Test cricketer at the time of her death having debuted against Australia in 1937. She was part of tour of Australia in 1949 apart from playing representative cricket for Civil Service Women, Middlesex Women and South Women in the domestic arena. \"The England and Wales Cricket Board is deeply saddened to learn of the death of Eileen Ash at the age of 110,\" the ECB said in a statement. \"Ash, who made her Test debut against Australia in 1937, was a remarkable woman who led an extraordinary life. A right-arm seamer, Ash (née Whelan) made her Test debut against Australia at Northampton in 1937 and went on to represent her country on seven occasions either side of World War II, retiring in 1949.\" The London-born player rang the bell ahead of England Women's nail-biting victory over India in the 2017 World Cup final. Apart from her cricket career, Ash also worked for MI6, the Secret Intelligence Service, during World War II. Clare Connor, the former England cricketer, who currently serves as ECB's managing director of women's cricket and the MCC's president, mourned her demise. \"Our sport owes so much to its pioneers and Eileen was one of them. I am deeply sad to be saying goodbye to her today. Heather and I went to visit Eileen about six months before the 2017 ICC Women's World Cup – she was 105 at the time – and it was one of the most remarkable experiences,\" she said.","image_url":null,"source_id":"indiatvnews"},{"title":"World’s oldest Test cricketer, Eileen Ash, dies at 110","link":"https://punchng.com/worlds-oldest-test-cricketer-eileen-ash-dies-at-110/","keywords":["Sports"],"creator":["Agency Report"],"video_url":null,"description":"London, United Kingdom | AFP | Saturday 12/4/2021 – 15:47 UTC+1 | 216 words Eileen Ash, the oldest-ever Test cricketer, has died at the age of 110, the England and Wales Cricket Board announced on Saturday. Ash, a right-arm seam bowler, who made her Test debut against Australia in 1937, represented England seven times either… Read More","content":null,"pubDate":"2021-12-04 15:53:29","full_description":null,"image_url":"https://cdn.punchng.com/wp-content/uploads/2021/12/04174818/Eileen-Ash.jpg","source_id":"punchng"},{"title":"World's oldest Test cricketer Eileen Ash dies at 110","link":"https://www.iol.co.za/sport/cricket/international/worlds-oldest-test-cricketer-eileen-ash-dies-at-110-d447f84f-9e12-46af-9e0a-1c0acd9dd434","keywords":null,"creator":["AFP"],"video_url":null,"description":"Eileen Ash, the oldest-ever Test cricketer, has died at the age of 110, the England and Wales Cricket Board has announced.","content":null,"pubDate":"2021-12-04 15:36:55","full_description":null,"image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/27fb3578-4581-5b2c-b3a9-c3ed2ee987a6&operation=CROP&offset=0x0&resize=680x382","source_id":"iol"},{"title":"Laxman to join NCA on Dec 13, will travel with U-19s for World Cup","link":"https://www.indiatvnews.com/sports/cricket/laxman-to-join-nca-on-dec-13-will-travel-with-u-19s-for-world-cup-748110","keywords":null,"creator":null,"video_url":null,"description":"Batting great VVS Laxman will be joining NCA as the head of cricket on December 13 as his appointment, along with that of other coaches, was ratified by the general body of the BCCI on Saturday.","content":null,"pubDate":"2021-12-04 15:32:11","full_description":"Batting great VVS Laxman will be joining NCA as the head of cricket on December 13 as his appointment, along with that of other coaches, was ratified by the general body of the BCCI on Saturday. Laxman, along with the appointment of former Australia and England bowling coach Troy Cooley as the pace bowling coach of National Cricket Academy, was finalised during the Annual General Meeting in Kolkata. \"Laxman's contract has been signed already. His last media assignment is the second Test between New Zealand and India. He will be joining Bengaluru from December 13. He is also for a certain period be in the West Indies for the the U-19 ICC World Cup,\" a senior BCCI office-bearer, privy to the development, told PTI after the meeting. He informed that one among the NCA coaches Hrishikesh Kanitkar or Sitanshu Kotak will don the head coach's hat for the U-19 global event. \"We have also finalised all the NCA coaching appointments and it has been minuted,\" he said. BCCI president Sourav Ganguly and secretary Jay Shah have been invited by Cricket South Africa for the 'Annual Nelson Mandela Dinner' scheduled on January 2. However, it is still not certain whether the BCCI bigwigs will travel to the Rainbow Nation to attend the prestigious event following the emergence of the Omicron variant that has caused a spike in COVID-19 cases in the region. India will be sending 20 players across two formats for the upcoming three-Test and three ODI series in South Africa along with extra net bowlers. Some among the 20 members will be those who are currently in South Africa for the A-series. \"Most of them will come back after the third A Test but may be a couple will be selected in the main squad and a few who will be net bowler,\" the official said.","image_url":null,"source_id":"indiatvnews"},{"title":"Big Bash League 2021 Live Telecast Channel in India and Australia: When and where to watch BBL 11?","link":"https://thesportsrush.com/cricket-news-big-bash-league-2021-live-telecast-channel-in-india-and-australia-when-and-where-to-watch-bbl-11/","keywords":["Cricket","BBL 11","Big Bash League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Big Bash League 2021 Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of BBL 2021-22. Big Bash League, the biggest T20 tournament in Australia, is all in readiness of commencing from tomorrow at the Sydney Cricket Ground. Defending champions Sydney Sixers will host Melbourne Stars in the season opener… The post Big Bash League 2021 Live Telecast Channel in India and Australia: When and where to watch BBL 11? appeared first on The SportsRush.","content":"Big Bash League 2021 Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of BBL 2021-22. Big Bash League, the biggest T20 tournament in Australia, is all in readiness of commencing from tomorrow at the Sydney Cricket Ground. Defending champions Sydney Sixers will host Melbourne Stars in the season opener on a Sunday evening. BBL 11 will witness a total of 61 matches being played over a 55-day period across multiple cities in the country. Other than a solitary match being played on the opening day, there will be numerous double-headers which will be played during the course of the tournament. In addition to Sixers and Stars, Sydney Thunder, Melbourne Renegades, Perth Scorchers, Adelaide Strikers, Brisbane Heat and Hobart Hurricanes will be part of this eight-team tournament. The 11th season will be following the format of the previous season wherein a total of five teams will qualify for the playoffs which will comprise of Eliminator, Qualifier, Knockout, Challenger and Final. Can’t wait to #BringtheHEAT #BBL11 I #like #love #Enjoy to play in #Australia @HeatBBL @BBL pic.twitter.com/yIS9kmVE2I — Muj R 88 (@Mujeeb_R88) December 4, 2021 Big Bash League 2021 Live Telecast Channel in India and Australia Sony Sports Network, which had televised the recently concluded Women’s Big Bash League 2021-22 in India, will be broadcasting the men’s tournament as well. As was the case with WBBL 2021, Sony SIX should be televising BBL 2021-22 matches in India. Having said that, there hasn’t been an official confirmation with respect to the exact channel as of now. Talking about an official confirmation, one has been made around the live streaming of this tournament as online users can log in to Sony’s streaming application named Sony LIV. It is worth mentioning that fans no longer have the option of watching the match on Airtel Xstream app as Sony Network’s channels are no longer available on this platform. Readers must note that BBL 2021-22 matches will only be available in English commentary in India. As far as the local fans in Australia are concerned, they will be able to watch this Big Bash League’s matches on Channel 7 and Foxtel. Fans in the UK will have to switch to BT Sport for following this tournament. Date – 05/12/2021 (Saturday) – 28/01/2022 (Friday). Match start Time – 10:00 AM, 10:30 AM, 12:35 PM, 01:45 PM, 02:00 PM, 04:00 PM (India) and 03:40 PM and 06:35 PM, 07:15 PM, 07:35 PM, 09:30 PM (Australia). TV Channel – Channel 7 and Foxtel (Australia) and BT Sport (UK). Online platform – Sony LIV (India) and Kayo App (Australia). The post Big Bash League 2021 Live Telecast Channel in India and Australia: When and where to watch BBL 11? appeared first on The SportsRush.","pubDate":"2021-12-04 15:16:51","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Lanka Premier League 2021 schedule and fixtures: When and where will LPL 2021 matches be played?","link":"https://thesportsrush.com/cricket-news-lanka-premier-league-2021-schedule-and-fixtures-when-and-where-will-lpl-2021-matches-be-played/","keywords":["Cricket","Lanka Premier league 2021","LPL 2021"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Lanka Premier League 2021 schedule and fixtures: Galle Gladiators will take on the Jaffna Kings in the tournament opener of LPL 2021. The second edition of the Lanka Premier League is all set to commence from December 5 (Sunday). The opening encounter will take place between the defending champions Jaffna Kings (renamed) and Galle Gladiators… The post Lanka Premier League 2021 schedule and fixtures: When and where will LPL 2021 matches be played? appeared first on The SportsRush.","content":"Lanka Premier League 2021 schedule and fixtures: Galle Gladiators will take on the Jaffna Kings in the tournament opener of LPL 2021. The second edition of the Lanka Premier League is all set to commence from December 5 (Sunday). The opening encounter will take place between the defending champions Jaffna Kings (renamed) and Galle Gladiators at the R Premadasa Stadium in Sri Lanka. It is worth of a mention that the upcoming season will be played in a different format unlike the one followed last year wherein 4 teams (out of 6) had an equal chance to lift the silverware. The league will follow the Indian Premier League (IPL) template with the introduction of the Qualifiers and Eliminator. The playoffs will see the top-two teams in the points table face off in Qualifier 1, while the teams placed third and fourth will face each other in the Eliminator, and the loser of Qualifier 1 will play the winner of the Eliminator in Qualifier 2 for a place in the final against the winner of Qualifier 1. With the magic of last year still fresh in our minds, the excitement of LPL 2021 is now in crescendo!@KingsJaffna @PereraThisara#LPL2021#එක්වජයගමු #ஒன்றாகவென்றிடுவோம் #EkwaJayagamu #Cricket #WinTogether #SriLanka #Season2 #T20cricket #LankaPremierLeague #TheFutureisHere pic.twitter.com/AuO42VnMLi — LPL – Lanka Premier League (@LPLT20) December 4, 2021 Lanka Premier League 2021 schedule and fixtures: When and where will LPL 2021 matches be played? The 2021 edition of the LPL would run across a total of 19 days with the final set for December 23. As mentioned above, the tournament opener will take place at the R Premadasa Stadium. In fact all the league matches- 20 in number, would be played at the same venue. The 4 remaining matches of the Playoffs, including the Final on December 23, would take place at the Mahinda Rajapaksa Stadium in Hambantota. A reserve day has also been allocated this year for the final, on December 24. The tournament has had to be postponed twice in order to avoid clashes with other T20 leagues around the world. All the teams are allowed to have a squad of 20 players, wherein six overseas cricketers can be included. Colombo Stars, Dambulla Giants, Galle Gladiators, Jaffna Kings, and Kandy Warriors are the teams that will feature in this edition of the tournament. This year’s edition has reportedly seen 74 international cricketers register for the player draft, including Imran Tahir, Mohammad Amir, Chris Gayle, Andre Russell, Dawid Malan and Faf du Plessis to name a few. Schedule and fixtures December 5– Galle Gladiators vs Jaffna Kings, (7.30 pm) December 6- Dambulla Giants vs Kandy Warriors, 3.30 pm Colombo Stars vs Galle Gladiators, 7.30 pm December 7- Jaffna Kings vs Dambulla Giants, 3.30 pm Kandy Warriors vs Galle Gladiators, 7.30 pm December 8- Colombo Stars vs Dambulla Giants, 3.30 pm Kandy Warriors vs Jaffna Kings, 7.30 pm December 10– Dambulla Giants vs Galle Gladiators, 3.30 pm Jaffna Kings vs Colombo Stars, 7.30 pm December 11- Galle Gladiators vs Kandy Warriors, 3.30 pm Jaffna Kings vs Colombo Stars, 7.30 pm December 12- Jaffna Kings vs Kandy Warriors, 3.30 pm Galle Gladiators vs Colombo Stars, 7.30 pm December 13- Galle Gladiators vs Dambulla Giants, 7.30 pm December 14– Kandy Warriors vs Colombo Stars, 3.30 pm Dambulla Giants vs Jaffna Kings, 7.30 pm December 16- Colombo Stars vs Jaffna Kings, 3.30 pm Kandy Warriors vs Dambulla Giants, 7.30 pm December 17- Jaffna Kings vs Galle Gladiators, 3.30 pm Colombo Stars vs Kandy Warriors, 7.30 pm December 20– Eliminator (Team 3 vs Team 4), 3.30 pm Qualifier 1, (Team 2 vs Team 4), 7.30 pm December 21– Qualifier 2 (Loser of Qualifier 1 vs winner of Eliminator), 7.30 pm December 23– Final, 7.30 pm.       The post Lanka Premier League 2021 schedule and fixtures: When and where will LPL 2021 matches be played? appeared first on The SportsRush.","pubDate":"2021-12-04 14:50:11","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Cricket-World&#039;s oldest test player Ash dies at 110","link":"https://www.thestar.com.my/sport/cricket/2021/12/04/cricket-world039s-oldest-test-player-ash-dies-at-110","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England's Eileen Ash, the world's oldest test player described as a 'pioneer' of the sport, has died aged 110, the country's cricket board (ECB) has said. Read full story","content":null,"pubDate":"2021-12-04 14:49:00","full_description":"(Reuters) - England's Eileen Ash, the world's oldest test player described as a 'pioneer' of the sport, has died aged 110, the country's cricket board (ECB) has said. Right-arm seamer Ash played seven tests for England after making her debut against Australia in 1937. She retired in 1949 but she also played golf until the age of 98 and even practiced yoga at the age of 105. The ECB described her as \"a remarkable woman who led an extraordinary life\". Her portrait was unveiled at Lord's in 2019 and she had a life-long honorary membership with the Marylebone Cricket Club. \"Ash – who was the oldest-ever test cricketer at the time of her death – was a natural high-achiever, on and off the pitch,\" the ECB statement https://www.ecb.co.uk/news/2392824/ecb-pays-tribute-to-eileen-ash-the-worlds-oldest-ever-test-cricketer read. During her England career, Ash was also seconded to MI6 - Britain's foreign intelligence service - during the second World War. \"Our sport owes so much to its pioneers and Eileen was one of them. I am deeply sad to be saying goodbye to her today,\" Clare Connor, ECB managing director of women's cricket, said. \"Our thoughts and prayers are with Eileen's family as they come to terms with losing such a wonderful woman and the end of an astonishing life.\" (Reporting by Manasi Pathak in Bengaluru; Editing by Rohith Nair)","image_url":null,"source_id":"thestar_my"},{"title":"Mumbai Test: Ajaz inspired by watching Kumble take all 10 wickets - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9tdW1iYWktdGVzdC1hamF6LWluc3BpcmVkLWJ5LXdhdGNoaW5nLWt1bWJsZS10YWtlLWFsbC0xMC13aWNrZXRzLTc2NTY0ODEv0gF_aHR0cHM6Ly9pbmRpYW5leHByZXNzLmNvbS9hcnRpY2xlL3Nwb3J0cy9jcmlja2V0L211bWJhaS10ZXN0LWFqYXotaW5zcGlyZWQtYnktd2F0Y2hpbmcta3VtYmxlLXRha2UtYWxsLTEwLXdpY2tldHMtNzY1NjQ4MS9saXRlLw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Mumbai Test: Ajaz inspired by watching Kumble take all 10 wickets  The Indian ExpressIND vs NZ 2021: Watch - Ajaz Patel's Historic 10-Wicket Haul  Cricket AddictorThese kind of things probably don't sink in till much later: Ajaz Patel  CricbuzzIndia 332 runs ahead against New Zealand - Jammu Kashmir Latest News | Tourism | Breaking News J&K  Daily ExcelsiorWatch: Virat Kohli And Rahul Dravid Walk To The New Zealand Dugout To Congratulate Ajaz Patel After Stumps On Day 2  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2021-12-04 14:28:06","image_url":null,"source_id":"google"},{"title":"Cricket: Decades’ gap between 10 wickets haul","link":"https://www.thehindubusinessline.com/news/sports/cricket-decades-gap-between-10-wickets-haul/article37840966.ece","keywords":null,"creator":["AJ Vinayak"],"video_url":null,"description":"South African bowler Ajaz Patel took 10 wickets against India in Mumbai in the first innings of the Test match no. 2438","content":null,"pubDate":"2021-12-04 14:25:25","full_description":null,"image_url":null,"source_id":"thehindubusinessline"},{"title":"'Stars align' in Patel's 10-wicket NZ haul","link":"https://thewest.com.au/sport/cricket/stars-align-in-patels-10-wicket-nz-haul-c-4817702","keywords":null,"creator":["AAP"],"video_url":null,"description":"India have taken complete command after New Zealand's Ajaz Patel spun himself into Test cricket's record books, claiming all 10 wickets in an innings.","content":null,"pubDate":"2021-12-04 14:12:40","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4817702/30b5b11844d6093408739854c308986679cfbc8d-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"'Stars align' in Patel's 10-wicket NZ haul","link":"https://www.perthnow.com.au/sport/cricket/stars-align-in-patels-10-wicket-nz-haul-c-4817698","keywords":null,"creator":["AAP"],"video_url":null,"description":"India have taken complete command after New Zealand's Ajaz Patel spun himself into Test cricket's record books, claiming all 10 wickets in an innings.","content":null,"pubDate":"2021-12-04 14:12:22","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4817698/30b5b11844d6093408739854c308986679cfbc8d-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"India tour to go ahead under \"strictest Covid-19 guidelines\": Cricket South Africa ","link":"https://www.channelnewsasia.com/sport/india-tour-go-ahead-under-strictest-covid-19-guidelines-cricket-south-africa-2358541","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-04 14:12:02","full_description":null,"image_url":"https://onecms-res.cloudinary.com/image/upload/s--SB-owJP2--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:afp_watermark%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/605fe803533fdfa7e13e0cb9161a9b7d8fd8dde3.jpg?itok=-gnS7mt1","source_id":"channelnewsasia"},{"title":"Watch: Ravichandran Ashwin Signals For DRS After Being Bowled By Ajaz Patel In Mumbai Test - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL3JhdmljaGFuZHJhbi1hc2h3aW4tc2lnbmFscy1mb3ItZHJzLWFmdGVyLWJlaW5nLWJvd2xlZC1ieS1hamF6LXBhdGVsLWluLW11bWJhaS10ZXN0LXdhdGNoLXZpZGVvLTI2MzcyNDbSAZ8BaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaW5kaWEtdnMtbmV3LXplYWxhbmQtMjAyMS9yYXZpY2hhbmRyYW4tYXNod2luLXNpZ25hbHMtZm9yLWRycy1hZnRlci1iZWluZy1ib3dsZWQtYnktYWphei1wYXRlbC1pbi1tdW1iYWktdGVzdC13YXRjaC12aWRlby0yNjM3MjQ2L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Ravichandran Ashwin Signals For DRS After Being Bowled By Ajaz Patel In Mumbai Test  NDTVSports.comIND vs NZ 2021: Watch - Ajaz Patel's Historic 10-Wicket Haul  Cricket AddictorAjaz Patel's Perfect 10 | Cricbuzz.com - Cricbuzz  CricbuzzIndia 332 runs ahead against New Zealand - Jammu Kashmir Latest News | Tourism | Breaking News J&K  Daily ExcelsiorIND vs NZ 2021: Watch - Ajaz Patel Turns Big To Clean Up R Ashwin, Batsman Left Shell-Shocked  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2021-12-04 13:32:55","image_url":null,"source_id":"google"},{"title":"India delay South Africa cricket tour over Omicron","link":"https://ewn.co.za/2021/12/04/india-delay-south-africa-cricket-tour-over-omicron","keywords":null,"creator":null,"video_url":null,"description":"The tour \"will proceed with the revised dates and itinerary\", Jay Shah, secretary for the Board of Control for Cricket in India (BCCI), said in a statement.","content":null,"pubDate":"2021-12-04 13:30:00","full_description":"India delay South Africa cricket tour over Omicron The tour \"will proceed with the revised dates and itinerary\", Jay Shah, secretary for the Board of Control for Cricket in India (BCCI), said in a statement. FILE: The Proteas lost 3-0 to India in the tests. Picture: @ICC/Twitter. Coronavirus Proteas India Cricket Omicron Email Print Tweet Share AFP | 11 hours ago NEW DELHI - India's cricket board on Saturday delayed the national side's South Africa tour over the heavily mutated Omicron strain of Covid-19, it said in a statement. Omicron was first detected by scientists in South Africa and has led to global panic, uncertainty and fresh travel curbs in the last few days, raising questions over the prospects for the tour. The first Test of a three-match series against the Proteas has been put back from 17 December 17 to 26 December. The tour \"will proceed with the revised dates and itinerary\", Jay Shah, secretary for the Board of Control for Cricket in India (BCCI), said in a statement. As originally scheduled, a three-match ODI series will follow the five-day games, Shah said, but he did not give timings for the team's arrival in South Africa or a detailed match itinerary. India's Test skipper Virat Kohli this week sought clarity on the series after conflicting media reports about Omicron. Some players would need to quarantine ahead of the tour, he said. \"Those kinds of things you want to seek clarity as soon as possible,\" Kohli added. The BCCI is the world's richest cricket body and any Indian tour can easily generate millions of dollars for the hosts. South Africa has praised India for its \"solidarity\" in not cancelling the tour and promised the most stringent measures to ensure the safety of the visiting contingent.","image_url":null,"source_id":"ewn"},{"title":"Biswanath thrash Kokrajhar by 10 wickets","link":"https://www.sentinelassam.com/sports/cricket/biswanath-thrash-kokrajhar-by-10-wickets-566263","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Biswanath thrashed Kokrajhar by 10 wickets in the RG Bauah Cricket tournament held at the Nehru Stadium here today. Chasing 60 runs to win, Biswanath took just 10.4 overs to get the winning runs without losing a single wicket. Atharba Kashyap and Ankit Gupta remained not out on 25 and 22 runs respectively.","content":"Our Sports ReporterGUWAHATI: Biswanath thrashed Kokrajhar by 10 wickets in the RG Bauah Cricket tournament held at the Nehru Stadium here today. Chasing 60 runs to win, Biswanath took just 10.4 overs to get the winning runs without losing a single wicket. Atharba Kashyap and Ankit Gupta remained not out on 25 and 22 runs respectively. In another game at ACA Stadium, Barsapara (ground 1) Rangiya registered 7 wickets victory over Bokakhat. Elected to bat, Bokakhat bowled out 134 in 34.4 overs. Chintu Das and Razek Siddik bagged 4 and 3 wickets respectively while Binod Mazi of Bokakhat contributed 37 with the bat. In reply Varun Jajodia (54 no) and Sumit Bishnoi (25 no) guided Rangia to victory with two responsible knocks.The duo added 71 runs for the unbeten fourth-wicket partnership. At Amingaon North Salmara won against Udalguri by 69 runs. The star of the game was Janisar Ahmed of the winning team who bagged 7 wickets giving away only 4 runs. In the other game of the day at the second ground in ACA Stadium, Barsapara, Bajali beat Mangaldoi by 35 runs. Uday Bhaskar Sarkar of Mangaldoi and Bayu Agarwal of Bajali bagged five wickets each in the game. Brief scores: Kokrajhar vs Biswanath: Kokrajhar 59 (24.2 Overs), Jwel Dey 24, Abhishek Kr Rai 3-20, Isha Khan 3-20, Biswanath 62/0 (10.4 overs), Atharba Kashyap 25, Ankit Gupta 22. Bokakhat vs Rangia-Bokakhat 134 (34.4 overs)-Binod Mazi 37, Chintu Das 4-21, Razek Siddik 3-27, Rangia 136-3 (21.3 overs), Varun Jajodia 54 (no), Sumit Bishnoi 25 (no). North Salmara Vs Udalguri-North Salmara N.Salmara 147 (23.1 overs), Kalyanjit Ray 45, Ramkrishno Sarkar 4-33, Lucky Paswan 3-42, Udalguri 78 (14.3 overs), Janisar Ahmed 7-4. Bajali vs Mangaldoi-Bajali 144 (30 overs), Deep Bharadwaz 40,Nayan Mani Das 29, Uday Bhaskar Sarkar 5-29, Mangaldoi 109 (26.1 overs), Pragyan Hazarika 32, Bayu Agarwal 5-24. Also Read: Ronaldo powers United to win; goes past 800-goal markAlso Watch:","pubDate":"2021-12-04 13:20:45","full_description":"Our Sports Reporter GUWAHATI: Biswanath thrashed Kokrajhar by 10 wickets in the RG Bauah Cricket tournament held at the Nehru Stadium here today. Chasing 60 runs to win, Biswanath took just 10.4 overs to get the winning runs without losing a single wicket. Atharba Kashyap and Ankit Gupta remained not out on 25 and 22 runs respectively. In another game at ACA Stadium, Barsapara (ground 1) Rangiya registered 7 wickets victory over Bokakhat. Elected to bat, Bokakhat bowled out 134 in 34.4 overs. Chintu Das and Razek Siddik bagged 4 and 3 wickets respectively while Binod Mazi of Bokakhat contributed 37 with the bat. In reply Varun Jajodia (54 no) and Sumit Bishnoi (25 no) guided Rangia to victory with two responsible knocks.The duo added 71 runs for the unbeten fourth-wicket partnership. At Amingaon North Salmara won against Udalguri by 69 runs. The star of the game was Janisar Ahmed of the winning team who bagged 7 wickets giving away only 4 runs. In the other game of the day at the second ground in ACA Stadium, Barsapara, Bajali beat Mangaldoi by 35 runs. Uday Bhaskar Sarkar of Mangaldoi and Bayu Agarwal of Bajali bagged five wickets each in the game. Brief scores: Kokrajhar vs Biswanath: Kokrajhar 59 (24.2 Overs), Jwel Dey 24, Abhishek Kr Rai 3-20, Isha Khan 3-20, Biswanath 62/0 (10.4 overs), Atharba Kashyap 25, Ankit Gupta 22. Bokakhat vs Rangia-Bokakhat 134 (34.4 overs)-Binod Mazi 37, Chintu Das 4-21, Razek Siddik 3-27, Rangia 136-3 (21.3 overs), Varun Jajodia 54 (no), Sumit Bishnoi 25 (no). North Salmara Vs Udalguri-North Salmara N.Salmara 147 (23.1 overs), Kalyanjit Ray 45, Ramkrishno Sarkar 4-33, Lucky Paswan 3-42, Udalguri 78 (14.3 overs), Janisar Ahmed 7-4. Bajali vs Mangaldoi-Bajali 144 (30 overs), Deep Bharadwaz 40,Nayan Mani Das 29, Uday Bhaskar Sarkar 5-29, Mangaldoi 109 (26.1 overs), Pragyan Hazarika 32, Bayu Agarwal 5-24. Also Read: Ronaldo powers United to win; goes past 800-goal mark Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/04/277948-istockphoto-177427917-612x612.jpg","source_id":"sentinel"},{"title":"Jay Shah says panel formed to investigate Ahmedabad franchise owners' betting links","link":"https://zeenews.india.com/cricket/jay-shah-says-panel-formed-to-investigate-ahmedabad-franchise-owners-betting-links-2416189.html","keywords":null,"creator":null,"video_url":null,"description":"Former India batting great VVS Laxman will have to come \"through the process\" for succeeding Rahul Dravid as the head of National Cricket Academy, BCCI secretary Jay Shah said here on Saturday.","content":null,"pubDate":"2021-12-04 13:13:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"New Zealand spinner Ajaz Patel takes all 10 wickets in Test against India - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIxL2RlYy8wNC9uZXctemVhbGFuZC1zcGlubmVyLWFqYXotcGF0ZWwtdGFrZXMtYWxsLTEwLXdpY2tldHMtaW4tdGVzdC1hZ2FpbnN0LWluZGlhLWNyaWNrZXTSAX9odHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvMjAyMS9kZWMvMDQvbmV3LXplYWxhbmQtc3Bpbm5lci1hamF6LXBhdGVsLXRha2VzLWFsbC0xMC13aWNrZXRzLWluLXRlc3QtYWdhaW5zdC1pbmRpYS1jcmlja2V0?oc=5","keywords":null,"creator":null,"video_url":null,"description":"New Zealand spinner Ajaz Patel takes all 10 wickets in Test against India  The Guardian10 wickets in an innings! New Zealand's Ajaz Patel third bowler in Test cricket to achieve the feat  Sky SportsAjaz Patel takes TEN wickets in an innings for New Zealand against India  Daily Mail'Absolute joke': Cricket world rages over Virat Kohli 'disgrace'  Yahoo News NZMayank Agarwal's unbeaten century helps India build a sizeable first-day total as New Zealand's Ajaz Patel impresses with four wickets  Sky SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-04 13:09:00","image_url":null,"source_id":"google"},{"title":"Watch: Virat Kohli And Rahul Dravid Walk To The New Zealand Dugout To Congratulate Ajaz Patel After Stumps On Day 2 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMirgFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vbmV3LXplYWxhbmQtdG91ci1vZi1pbmRpYS0yMDIxL3dhdGNoLXZpcmF0LWtvaGxpLWFuZC1yYWh1bC1kcmF2aWQtd2Fsay10by10aGUtbmV3LXplYWxhbmQtZHVnb3V0LXRvLWNvbmdyYXR1bGF0ZS1hamF6LXBhdGVsLWFmdGVyLXN0dW1wcy1vbi1kYXktMi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Virat Kohli And Rahul Dravid Walk To The New Zealand Dugout To Congratulate Ajaz Patel After Stumps On Day 2  Cricket AddictorAjaz Patel's Perfect 10 | Cricbuzz.com - Cricbuzz  CricbuzzIndia 332 runs ahead against New Zealand - Jammu Kashmir Latest News | Tourism | Breaking News J&K  Daily ExcelsiorIND vs NZ 2021: Watch - Ajaz Patel's Historic 10-Wicket Haul  Cricket AddictorIND vs NZ: Mohammed Siraj sends back Ross Taylor in a quick succession with a peach  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2021-12-04 13:03:11","image_url":null,"source_id":"google"},{"title":"VVS Laxman \"Has To Apply\" For NCA Post: Cricket Board Secretary","link":"https://sports.ndtv.com/cricket/vvs-laxman-has-to-apply-for-nca-post-panel-formed-to-investigate-cvcs-betting-links-2637185","keywords":null,"creator":null,"video_url":null,"description":"Indian stalwart Dravid too had to go through a similar process before becoming the India head coach. Initially reluctant to shift base to Bangalore from Hyderabad, Laxman has already quit from his...","content":null,"pubDate":"2021-12-04 12:41:41","full_description":"Former India batting great VVS Laxman will have to come \"through the process\" for succeeding Rahul Dravid as the head of National Cricket Academy, BCCI secretary Jay Shah said on Saturday. The topmost NCA post fell vacant after Dravid took over as the head coach of Team India following team's T20 World Cup exit in the UAE last month. \"We will advertise for the NCA appointment. First, he (VVS) has to apply for the post,\" BCCI secretary Jay Shah told PTI after their 90th AGM. Indian stalwart Dravid too had to go through a similar process before becoming the India head coach. Initially reluctant to shift base to Bangalore from Hyderabad, Laxman has already quit from his role as mentor of IPL team Sunrisers Hyderabad. He will also have to quit commentary or writing columns for newspapers to avoid conflict of interest. Laxman's appointment was one of the points of discussion at the AGM. On the IPL 2022 Mega Auction which is slated for next year, Shah said: \"The IPL Governing council will take a call on this.\" The BCCI has also formed a neutral panel to investigate CVC Capital who pipped favourites Adani Group to own the Ahmedabad franchise. The company has paid a whopping Rs 5625 Crore in the auctions, but now find itself under the spotlight for their alleged connection with some betting companies outside India. Promoted \"We have formed a committee who are investigating into the matter,\" Shah added. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://i.ndtvimg.com/i/2018-03/vvs-laxman-ndtv_806x605_61522234436.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"}]}