{"newsArray":[{"title":"जडेजा के चौके से चेन्नई ने गुजरात के जबड़े से छीनी जीत, धोनी एंड कंपनी ने 5वीं बार आईपीएल ट्रॉफी पर किया कब्जा","link":"https://hindi.news18.com/news/sports/cricket-ravindra-jadeja-shine-as-chennai-super-kings-beat-gujarat-titans-by-5-wickets-clinch-5th-time-ipl-trophy-equals-mumbai-indians-record-6355425.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"गुजरात टाइटंस ने पहले बैटिंग करते हुए 4 विकेट पर 214 रन बनाए. साई सुदर्श ने 47 गेंदों पर 46 रन की पारी खेली. वह आईपीएल फाइनल में सबसे बड़ी पारी खेलने वाले बतौर अनकैप्ड दूसरे खिलाड़ी बने. गुजरात ने आईपीएल फाइनल का सबसे बड़ा स्कोर बनाया. इससे पहले सनराइजर्स हैदरबाद ने साल 2016 में फाइनल में आरसीबी के खिलाफ 7 विकेट पर 208 रन बनाए थे. इसके बाद बारिश शुरू हो गई. बारिश के बाद जब खेल शुरू तब सीएसके को 15 ओवर में 171 रन का संशोधित लक्ष्य मिला.","content":"रवींद्र जडेजा ने आखिरी गेंद पर चौका जड़ चेन्नई को यादगार जीत दिलाई. नई दिल्ली. रवींद्र जडेजा की आखिरी गेंद पर चौके के दम पर चेन्नई सुपरकिंग्स ने फाइनल में गुजरात टाइटंस को 5 विकेट से हराकर 5वीं बार आईपीएल खिताब अपने नाम कर लिया है. वर्षा से बाधित मुकाबले में सीएसके को 15 ओवर में 171 रन का संशोधित लक्ष्य मिला था. उसने 15 ओवर में 5 विकेट पर लक्ष्य हासिल कर लिया. गुजरात ने पहले बैटिंग करते हुए 4 विकेट पर 214 रन बनाए थे. लक्ष्य का पीछा करने उतरी सीएसके की पारी के पहले ओवर की तीसरी गेंद के बाद फिर बारिश शुरू हो गई जिसमें काफी समय जाया हुआ. देर रात 12:10 में मुकाबले को 15 ओवर का कर दिया गया और सीएसके को संशोधित लक्ष्य दिया गया. बारिश से पहले सीएसके ने 4 रन बनाए थे. सीएसके को ऋतुराज गायकवाड़ और डेवोन कॉनवे की ओपनिंग जोड़ी ने धमाकेदार शुरुआत दिलाई. दोनों ने पहले विकेट के लिए 74 रन की साझेदारी की. ऋतुराज को नूर अहमद की गेंद पर राशिद खान ने कैच किया. गायकवाड़ 16 गेंदों पर 26 रन बनाकर आउट हुए. इसके बाद डेवोन कॉनवे भी ज्यादा देर तक क्रीज पर नहीं ठहर सके और नूर अहमद को विकेट थमाकर चलते बने. कॉनवे ने 25 गेंदों पर 47 रन बनाए. अजिंक्य रहाणे 27 रन बनाकर आउट हुए वहीं अंबाती रायुडू ने 19 रन का योगदान दिया . धोनी कुछ खास कमाल नहीं कर सके और पहली ही गेंद पर पवेलियन लौट गए. उन्हें मोहित शर्मा ने मिलर के हाथों कैच कराया. शिवम दुबे 32 और रवींद्र जडेजा 19 रन बनाकर नाबाद लौटे. गुजरात की ओर से मोहित शर्मा ने 3 जबकि नूर अहमद ने 2 विकेट चटकाए. बाबर आजम मेरा EX मंगेतर नहीं है जिसे मैं… मोहम्मद आमिर के बिगड़े बोल, स्पॉट फिक्सिंग में जा चुके हैं जेल गुजरात ने 4 विकेट पर 214 रन बनाए इससे पहले साई सुदर्शन के 47 गेंद में 96 रन की मदद से गुजरात टाइटंस ने 4 विकेट पर 214 रन बनाए. सुदर्शन ने अपनी पारी में 8 चौके और 6 छक्के लगाए. उन्होंने महत्वपूर्ण साझेदारियां निभाकर गुजरात को विशाल स्कोर दिया. इससे पहले शुभमन गिल 20 गेंद में 39 और रिधिमान साहा अर्धशतक बनाकर आउट हुए. दूसरे ही ओवर में गिल ने तुषार देशपांडे की गेंद पर लेग साइड में शॉट खेला लेकिन शॉर्ट फाइन लेग पर खड़े दीपक चाहर ने कैच टपका दिया. गिल हालांकि मुंबई इंडियंस के खिलाफ दूसरे क्वालीफायर में किये गए प्रदर्शन को दोहरा नहीं सके. धोनी ने स्टंपिंग में किया कमाल दूसरे छोर से साहा ने तीसरे ओवर में 16 रन निकालकर चेन्नई पर दबाव बनाया. इसके बाद गिल ने देशपांडे को लगातार तीन चौके लगाए जबकि साहा का रिटर्न कैच चाहर ने छोड़ा. पावरप्ले के बाद गुजरात का स्कोर बिना किसी नुकसान के 62 रन था. सातवें ओवर में हालांकि महेंद्र सिंह धोनी ने कुशल स्टम्पिंग का नमूना पेश करते हुए गिल को पवेलियन भेजा जबकि गेंदबाज रवींद्र जडेजा थे. गिल ने इस सीजन में 17 मैचों में 59 . 33 की औसत और 157 . 80 के स्ट्राइक रेट से 890 रन बनाए जो आईपीएल के इतिहास में किसी बल्लेबाज का दूसरा सर्वश्रेष्ठ प्रदर्शन है. पथिराना ने सुदर्शन को शतक से रोका साहा ने इस आईपीएल में अपना दूसरा अर्धशतक 13वें ओवर में पूरा किया. उनके और साई सुदर्शन के बीच 64 रन की साझेदारी 14वें ओवर में खत्म हुई जब चाहर ने उन्हें धोनी के हाथों लपकवाया. साहा ने 39 गेंद में पांच चौकों और एक छक्के की मदद से 54 रन बनाए. इस सत्र में गुजरात के लिये सर्वाधिक रन बनाने वाले दूसरे बल्लेबाज सुदर्शन ने अपना तीसरा अर्धशतक मथीषा पथिराना को लगातार चौके लगाकर पूरा किया. उन्होंने तीक्षणा को दो छक्के लगाए जबकि देशपांडे को तीन चौके और एक छक्का जड़ा. आखिरी ओवर में पथिराना ने सुदर्शन को एलबीडब्ल्यू आउट करके शतक से वंचित कर दिया. हार्दिक पंड्या ने 12 गेंद में नाबाद 21 रन बनाए. . Tags: Chennai super kings , Gujarat Titans , Hardik Pandya , IPL 2023 , Shubman gill , Wriddhiman saha IPL Rising Star: 5 युवा खिलाड़ियों को नहीं भूल पाएंगे आप, जल्दी ही दिख सकते हैं नेशनल टीम में मारधाड़ से हटकर बनी ये 8 फिल्में, कहानी के दम पर मचाया तहलका, तीसरे नंबर वाली को जितना देखो मन नहीं भरता 'KGF 2' और 'कांतारा' के बाद, साउथ से फिर उठने वाला है 1 बड़ा बवंडर, जल्द हिलने वाला है बॉक्स ऑफिस","pubDate":"2023-05-29 20:12:21","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/msd-16853921773x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Anderson, Robinson expected to be fit for England’s Ashes bid","link":"https://thefrontierpost.com/anderson-robinson-expected-to-be-fit-for-englands-ashes-bid/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"LONDON (Agencies): England head coach Brendon McCullum expects James Anderson and Ollie Robinson to be fit for the Ashes clash with Australia despite ruling the pace bowlers out of this week’s Test against Ireland. Anderson strained his groin while on Lancashire duty and Robinson suffered an ankle issue playing for Sussex earlier this month. The […]","content":"LONDON (Agencies): England head coach Brendon McCullum expects James Anderson and Ollie Robinson to be fit for the Ashes clash with Australia despite ruling the pace bowlers out of this week’s Test against Ireland. Anderson strained his groin while on Lancashire duty and Robinson suffered an ankle issue playing for Sussex earlier this month. The pair will remain sidelined when England host Ireland at Lord’s in a four-day match prior to the first Ashes Test. The five-match series against Australia begins on June 16, but McCullum is confident Anderson and Robinson can return in time for the opener in Birmingham. “For the first Ashes Test, I think they should be fit,” McCullum said on Monday. “They won’t be fit for this one against Ireland. We’ll just have to monitor it over this next sort of while, but we’ve got some great options right throughout the squad. “When I first took over this job, people said there wasn’t much depth in English cricket and I disagree with that completely. “I think there is an immense amount of depth and we’ve got plenty of good options throughout the squad.” England already have fitness concerns over a number of other bowlers, with Jofra Archer and Olly Stone struggling with elbow and hamstring problems respectively. With Anderson and Robinson ruled out, Stuart Broad will lead the bowling attack against Ireland but Mark Wood will have to be assessed before a final decision is made on his fitness. “He is bowling over there at the moment and seems to be getting through his work so hopefully he will be fine too,” McCullum said of Wood. “We’ve still got a couple of days and will make the decision when we need to, but he seems to be progressing well.” All eyes were on captain Ben Stokes during England’s training session on Monday. There are doubts over how much he will bowl this summer following an Indian Premier League series where he only played twice and sent down just one over for Chennai Super Kings. McCullum remains positive the talismanic all-rounder can still make an impact with the ball. Asked if Stokes will bowl against Ireland, McCullum responded: “I don’t know. You’ll have to ask Stokesy. He’s progressing well too. “He looks really fit as well, looks in great order and has a big smile on his face. “He is delighted to be back around the group and as our leader, having that sort of energy he brings is fantastic so again we’ll monitor that and see what happens. “I think he’ll bowl at some stage throughout the summer, yeah, no doubt. “He is a world class all-rounder and if he is able to bowl, fantastic. If not, we’ll find a way.”","pubDate":"2023-05-29 18:53:54","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Bismah charged for code of conduct violation","link":"https://thefrontierpost.com/bismah-charged-for-code-of-conduct-violation/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report KARACHI: Dynamites’ Bismah Maroof has been fined 20 per cent of match fee for a level 1 breach of the PCB’s Code of Conduct for Players and Player Support Personnel during her side’s match against Blasters in the ongoing Pakistan Cup Women’s Cricket Tournament 2022-23 at the State Bank Stadium on Monday. Bismah […]","content":"F.P. Report KARACHI: Dynamites’ Bismah Maroof has been fined 20 per cent of match fee for a level 1 breach of the PCB’s Code of Conduct for Players and Player Support Personnel during her side’s match against Blasters in the ongoing Pakistan Cup Women’s Cricket Tournament 2022-23 at the State Bank Stadium on Monday. Bismah was found to have violated Article 2.8 of the PCB Code of Conduct, which reads as: “Showing dissent at an Umpire’s decision during a Match”. The incident happened in the 40th over of Dynamites innings when Bismah showed obvious disappointment over the umpiring decision when she was given out LBW. The charge was imposed by on-field umpires Alay Hyder and Sabahat Rashid. Bismah accepted the charge and the fine was imposed by the match referee Mohammad Anees.","pubDate":"2023-05-29 18:51:18","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"England head coach McCullum says captain Stokes will bowl at 'some stage' during the Ashes","link":"https://www.dailymail.co.uk/sport/cricket/article-12136817/England-head-coach-McCullum-says-captain-Stokes-bowl-stage-Ashes.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"England will begin their Test summer on Thursday against Ireland at Lord's still uncertain about Ben Stokes's availability as a bowler because of his problematic left knee.","content":null,"pubDate":"2023-05-29 17:00:52","image_url":"https://i.dailymail.co.uk/1s/2023/05/29/17/71538295-0-image-a-15_1685379010046.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"CSK vs GT Live Score, IPL 2023 Final: GT openers OUT, score at 143/2 in 15 overs | Mint - Mint","link":"https://news.google.com/rss/articles/CBMiqQFodHRwczovL3d3dy5saXZlbWludC5jb20vbmV3cy9pbmRpYS9pcGwtZmluYWwtMjAyMy1jc2stdnMtZ3QtbWF0Y2gtbGl2ZS1jaGVubmFpLXN1cGVyLWtpbmdzLXZzLWd1amFyYXQtdGl0YW5zLXNjb3JlY2FyZC1wbGF5ZXJzLW1zLWRob25pLWRldm9uLWNvbndheS0xMTY4NTI1NjIzNzQ2Ni5odG1s0gGtAWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9uZXdzL2luZGlhL2lwbC1maW5hbC0yMDIzLWNzay12cy1ndC1tYXRjaC1saXZlLWNoZW5uYWktc3VwZXIta2luZ3MtdnMtZ3VqYXJhdC10aXRhbnMtc2NvcmVjYXJkLXBsYXllcnMtbXMtZGhvbmktZGV2b24tY29ud2F5L2FtcC0xMTY4NTI1NjIzNzQ2Ni5odG1s?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CSK vs GT Live Score, IPL 2023 Final: GT openers OUT, score at 143/2 in 15 overs | Mint  MintTake a cab to the hotel and disappear: Fans slam Deepak Chahar after he drops Gill and Saha inside the powerplay  Crictoday.com (Cricket News) Revealed: What Is written in Sanskrit on the IPL trophy which Dhoni or Hardik will lift  Crictoday.com (Cricket News) IPL LIVE Match Today | CSK Vs GT LIVE Match | Can MS Dhoni Beat Hardik Pandya At IPL Final 2023?  CNN-News18Seven questions about the IPL 2023 final reserve day | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2023-05-29 15:15:35","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Babar Azam addresses Islamic convention in US after joining Harvard Business School","link":"https://en.dailypakistan.com.pk/29-May-2023/babar-azam-addresses-islamic-convention-in-us-after-joining-harvard-business-schools","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE – Pakistan skipper Babar received another honour in the United States as he delivered a speech at one of the largest and most diverse Islamic conventions in Baltimore, a city in Maryland state.","content":"LAHORE – Pakistan skipper Babar received another honour in the United States as he delivered a speech at one of the largest and most diverse Islamic conventions in Baltimore, a city in Maryland state. A video shared on social media shows the World No.1 ODI batsman appearing on the stage of The 48th Annual ICNA-MAS Convention and sharing her thoughts in a jam-packed hall. Delivering his speech in Urdu language, the right-hand batsman urged the youth to keep themselves engage in the learning process. He also asked them to respect their elders and ponder over what they advise as they have more life experience. https://twitter.com/Rnawaz31888/status/1662762411282120704 Another Twitter shows the Pakistan captain and opener Mohammad Rizwan offering prayer after attending the convention. Earlier this week, Babar Azam, and wicketkeeper-batter, Mohammad Rizwan, made history by enrolling in the prestigious Harvard Business School’s executive education programme on the Business of Entertainment, Media, and Sports (BEMS). They are the first cricketers to join this renowned institution. From May 31 to June 3, the star duo will actively participate in the programme held on the Harvard campus in Boston, Massachusetts. Following the programme, both cricketers will engage with various communities in the United States until June 13, broadening their exposure.","pubDate":"2023-05-29 14:38:56","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-05-29/babar-azam-addresses-islamic-convention-in-us-after-joining-harvard-business-schools-1685357420-5010.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Chennai Super Kings vs Gujarat Titans Live Cricket Score, Quick Scorecard and Summary - Hindustan Times","link":"https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9saXZlLXNjb3JlY2FyZC1jc2stdnMtZ3QtaXBsLTIwMjMtZmluYWwtY2hlbm5haS1zdXBlci1raW5ncy12cy1ndWphcmF0LXRpdGFucy10MjAtbGl2ZS1zY29yZS1ja2FobTA1MjgyMDIzMjI1OTkwL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings vs Gujarat Titans Live Cricket Score, Quick Scorecard and Summary  Hindustan TimesIPL 2023: Chennai Super Kings vs Gujarat Titans Match Preview, IPL 2023  SportskeedaCSK vs GT Live Score - IPL 2023 Live Score & Commentary | Chennai Super Kings vs Gujarat Titans Score  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2023-05-29 14:00:00","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Sidra Amin helps Dynamites to third straight win","link":"https://thefrontierpost.com/sidra-amin-helps-dynamites-to-third-straight-win/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report LAHORE: Dynamites captain Sidra Amin made 95 off 100 balls to help her side to their third straight win in the Pakistan Cup Women’s Cricket Tournament as they beat Blasters by 78 runs at the State Bank Ground on Monday. The right-hander struck 13 fours and stitched a 130-run partnership for the second […]","content":"F.P. Report LAHORE: Dynamites captain Sidra Amin made 95 off 100 balls to help her side to their third straight win in the Pakistan Cup Women’s Cricket Tournament as they beat Blasters by 78 runs at the State Bank Ground on Monday. The right-hander struck 13 fours and stitched a 130-run partnership for the second wicket with Bismah Maroof, who made 95-ball 65 (hitting two fours and a six). The two came together when Khadija Chishti was out caught and bowled for five by Diana Baig with 23 runs on board. Sidra and Bismah now lead the tournament batting charts with 195 runs at 97.50 and 94 runs at 94, respectively. The partnership pushed back Blasters bowlers and propelled Dynamites to 214 for four in 45 overs. Diana and Saba Nazir picked up two wickets each. Blasters were all out for 136 in 37.3 overs as off-spinner Rameen Shamim took three wickets for 25, while Nashra Sundhu, Ghulam Fatima and Maham Manzoor picked up two wickets each. Blasters captain Muneeba Ali top-scored with 33 and the second best performance with the bat in the innings came from opener Ayesha Zafar, who made 30. Fatima, the leg-spinner, has the most wickets in the tournament with eight scalps at 7.88. Diana Baig and Aliya Riaz follow her with six and five wickets, respectively. Challengers, who are yet to win a match, will play Blasters on Wednesday. Scores in brief: Dynamites beat Blasters by 78 runs Dynamites 214-4, 45 overs (Sidra Amin 95, Bismah Maroof 65, Aliya Riaz 21; Saba Nazir 2-36, Diana Baig 2-37) Blasters 136 all out, 37.3 overs (Muneeba Ali 33, Ayesha Zafar 30; Rameen Shamim 3-25, Maham Manzoor 2-17, Nashra Sundhu 2-28, Ghulam Fatima 2-28) Player of the match – Sidra Amin (Dynamites)","pubDate":"2023-05-29 13:55:05","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Virat Kohli joins Team India's training session ahead of WTC final","link":"https://timesofindia.indiatimes.com/sports/cricket/news/virat-kohli-joins-team-indias-training-session-ahead-of-wtc-final/articleshow/100598375.cms","keywords":null,"creator":null,"video_url":null,"description":"India's batting sensation and former captain, Virat Kohli, joined the national team's training session on Monday at the picturesque Arundel Castle Cricket Club. Kohli's return to the squad has bolstered hopes for the upcoming World Test Championship (WTC) final against Australia at the Oval, scheduled from June 7 to 11.","content":null,"pubDate":"2023-05-29 13:48:09","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Virat Kohli joins Team India's training session ahead of WTC final - Indiatimes.com","link":"https://news.google.com/rss/articles/CBMiigFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9zcG9ydHMvY3JpY2tldC9uZXdzL3ZpcmF0LWtvaGxpLWpvaW5zLXRlYW0taW5kaWFzLXRyYWluaW5nLXNlc3Npb24tYWhlYWQtb2Ytd3RjLWZpbmFsL2FydGljbGVzaG93LzEwMDU5ODM3NS5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli joins Team India's training session ahead of WTC final  Indiatimes.comAustralia, India finalise squads for World Test Championship final  ICC CricketBig Boost For Team India As Injured Player Recovers Before WTC Final, Leaves For London - See Pic  Times NowICC World Test Championship Final: Scott Boland Front-Runner To Be In Australia's XI For WTC Final Against India - Reports  Cricket AddictorMitchell Marsh, Matt Renshaw left out as Australia trim Ashes squad for WTC final | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2023-05-29 13:48:00","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"जडेजा के चौके से चेन्नई ने गुजरात के जबड़े से छीनी जीत, धोनी एंड कंपनी ने 5वीं बार आईपीएल ट्रॉफी पर किया कब्जा","link":"https://hindi.news18.com/news/sports/cricket-ravindra-jadeja-shine-as-chennai-super-kings-beat-gujarat-titans-by-5-wickets-clinch-5th-time-ipl-trophy-equals-mumbai-indians-record-6355425.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"गुजरात टाइटंस ने पहले बैटिंग करते हुए 4 विकेट पर 214 रन बनाए. साई सुदर्श ने 47 गेंदों पर 46 रन की पारी खेली. वह आईपीएल फाइनल में सबसे बड़ी पारी खेलने वाले बतौर अनकैप्ड दूसरे खिलाड़ी बने. गुजरात ने आईपीएल फाइनल का सबसे बड़ा स्कोर बनाया. इससे पहले सनराइजर्स हैदरबाद ने साल 2016 में फाइनल में आरसीबी के खिलाफ 7 विकेट पर 208 रन बनाए थे. इसके बाद बारिश शुरू हो गई. बारिश के बाद जब खेल शुरू तब सीएसके को 15 ओवर में 171 रन का संशोधित लक्ष्य मिला.","content":"रवींद्र जडेजा ने आखिरी गेंद पर चौका जड़ चेन्नई को यादगार जीत दिलाई. नई दिल्ली. रवींद्र जडेजा की आखिरी गेंद पर चौके के दम पर चेन्नई सुपरकिंग्स ने फाइनल में गुजरात टाइटंस को 5 विकेट से हराकर 5वीं बार आईपीएल खिताब अपने नाम कर लिया है. वर्षा से बाधित मुकाबले में सीएसके को 15 ओवर में 171 रन का संशोधित लक्ष्य मिला था. उसने 15 ओवर में 5 विकेट पर लक्ष्य हासिल कर लिया. गुजरात ने पहले बैटिंग करते हुए 4 विकेट पर 214 रन बनाए थे. लक्ष्य का पीछा करने उतरी सीएसके की पारी के पहले ओवर की तीसरी गेंद के बाद फिर बारिश शुरू हो गई जिसमें काफी समय जाया हुआ. देर रात 12:10 में मुकाबले को 15 ओवर का कर दिया गया और सीएसके को संशोधित लक्ष्य दिया गया. बारिश से पहले सीएसके ने 4 रन बनाए थे. सीएसके को ऋतुराज गायकवाड़ और डेवोन कॉनवे की ओपनिंग जोड़ी ने धमाकेदार शुरुआत दिलाई. दोनों ने पहले विकेट के लिए 74 रन की साझेदारी की. ऋतुराज को नूर अहमद की गेंद पर राशिद खान ने कैच किया. गायकवाड़ 16 गेंदों पर 26 रन बनाकर आउट हुए. इसके बाद डेवोन कॉनवे भी ज्यादा देर तक क्रीज पर नहीं ठहर सके और नूर अहमद को विकेट थमाकर चलते बने. कॉनवे ने 25 गेंदों पर 47 रन बनाए. अजिंक्य रहाणे 27 रन बनाकर आउट हुए वहीं अंबाती रायुडू ने 19 रन का योगदान दिया . धोनी कुछ खास कमाल नहीं कर सके और पहली ही गेंद पर पवेलियन लौट गए. उन्हें मोहित शर्मा ने मिलर के हाथों कैच कराया. शिवम दुबे 32 और रवींद्र जडेजा 19 रन बनाकर नाबाद लौटे. गुजरात की ओर से मोहित शर्मा ने 3 जबकि नूर अहमद ने 2 विकेट चटकाए. बाबर आजम मेरा EX मंगेतर नहीं है जिसे मैं… मोहम्मद आमिर के बिगड़े बोल, स्पॉट फिक्सिंग में जा चुके हैं जेल गुजरात ने 4 विकेट पर 214 रन बनाए इससे पहले साई सुदर्शन के 47 गेंद में 96 रन की मदद से गुजरात टाइटंस ने 4 विकेट पर 214 रन बनाए. सुदर्शन ने अपनी पारी में 8 चौके और 6 छक्के लगाए. उन्होंने महत्वपूर्ण साझेदारियां निभाकर गुजरात को विशाल स्कोर दिया. इससे पहले शुभमन गिल 20 गेंद में 39 और रिधिमान साहा अर्धशतक बनाकर आउट हुए. दूसरे ही ओवर में गिल ने तुषार देशपांडे की गेंद पर लेग साइड में शॉट खेला लेकिन शॉर्ट फाइन लेग पर खड़े दीपक चाहर ने कैच टपका दिया. गिल हालांकि मुंबई इंडियंस के खिलाफ दूसरे क्वालीफायर में किये गए प्रदर्शन को दोहरा नहीं सके. धोनी ने स्टंपिंग में किया कमाल दूसरे छोर से साहा ने तीसरे ओवर में 16 रन निकालकर चेन्नई पर दबाव बनाया. इसके बाद गिल ने देशपांडे को लगातार तीन चौके लगाए जबकि साहा का रिटर्न कैच चाहर ने छोड़ा. पावरप्ले के बाद गुजरात का स्कोर बिना किसी नुकसान के 62 रन था. सातवें ओवर में हालांकि महेंद्र सिंह धोनी ने कुशल स्टम्पिंग का नमूना पेश करते हुए गिल को पवेलियन भेजा जबकि गेंदबाज रवींद्र जडेजा थे. गिल ने इस सीजन में 17 मैचों में 59 . 33 की औसत और 157 . 80 के स्ट्राइक रेट से 890 रन बनाए जो आईपीएल के इतिहास में किसी बल्लेबाज का दूसरा सर्वश्रेष्ठ प्रदर्शन है. पथिराना ने सुदर्शन को शतक से रोका साहा ने इस आईपीएल में अपना दूसरा अर्धशतक 13वें ओवर में पूरा किया. उनके और साई सुदर्शन के बीच 64 रन की साझेदारी 14वें ओवर में खत्म हुई जब चाहर ने उन्हें धोनी के हाथों लपकवाया. साहा ने 39 गेंद में पांच चौकों और एक छक्के की मदद से 54 रन बनाए. इस सत्र में गुजरात के लिये सर्वाधिक रन बनाने वाले दूसरे बल्लेबाज सुदर्शन ने अपना तीसरा अर्धशतक मथीषा पथिराना को लगातार चौके लगाकर पूरा किया. उन्होंने तीक्षणा को दो छक्के लगाए जबकि देशपांडे को तीन चौके और एक छक्का जड़ा. आखिरी ओवर में पथिराना ने सुदर्शन को एलबीडब्ल्यू आउट करके शतक से वंचित कर दिया. हार्दिक पंड्या ने 12 गेंद में नाबाद 21 रन बनाए. . Tags: Chennai super kings , Gujarat Titans , Hardik Pandya , IPL 2023 , Shubman gill , Wriddhiman saha IPL Rising Star: 5 युवा खिलाड़ियों को नहीं भूल पाएंगे आप, जल्दी ही दिख सकते हैं नेशनल टीम में मारधाड़ से हटकर बनी ये 8 फिल्में, कहानी के दम पर मचाया तहलका, तीसरे नंबर वाली को जितना देखो मन नहीं भरता 'KGF 2' और 'कांतारा' के बाद, साउथ से फिर उठने वाला है 1 बड़ा बवंडर, जल्द हिलने वाला है बॉक्स ऑफिस","pubDate":"2023-05-29 20:12:21","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/msd-16853921773x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Anderson, Robinson expected to be fit for England’s Ashes bid","link":"https://thefrontierpost.com/anderson-robinson-expected-to-be-fit-for-englands-ashes-bid/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"LONDON (Agencies): England head coach Brendon McCullum expects James Anderson and Ollie Robinson to be fit for the Ashes clash with Australia despite ruling the pace bowlers out of this week’s Test against Ireland. Anderson strained his groin while on Lancashire duty and Robinson suffered an ankle issue playing for Sussex earlier this month. The […]","content":"LONDON (Agencies): England head coach Brendon McCullum expects James Anderson and Ollie Robinson to be fit for the Ashes clash with Australia despite ruling the pace bowlers out of this week’s Test against Ireland. Anderson strained his groin while on Lancashire duty and Robinson suffered an ankle issue playing for Sussex earlier this month. The pair will remain sidelined when England host Ireland at Lord’s in a four-day match prior to the first Ashes Test. The five-match series against Australia begins on June 16, but McCullum is confident Anderson and Robinson can return in time for the opener in Birmingham. “For the first Ashes Test, I think they should be fit,” McCullum said on Monday. “They won’t be fit for this one against Ireland. We’ll just have to monitor it over this next sort of while, but we’ve got some great options right throughout the squad. “When I first took over this job, people said there wasn’t much depth in English cricket and I disagree with that completely. “I think there is an immense amount of depth and we’ve got plenty of good options throughout the squad.” England already have fitness concerns over a number of other bowlers, with Jofra Archer and Olly Stone struggling with elbow and hamstring problems respectively. With Anderson and Robinson ruled out, Stuart Broad will lead the bowling attack against Ireland but Mark Wood will have to be assessed before a final decision is made on his fitness. “He is bowling over there at the moment and seems to be getting through his work so hopefully he will be fine too,” McCullum said of Wood. “We’ve still got a couple of days and will make the decision when we need to, but he seems to be progressing well.” All eyes were on captain Ben Stokes during England’s training session on Monday. There are doubts over how much he will bowl this summer following an Indian Premier League series where he only played twice and sent down just one over for Chennai Super Kings. McCullum remains positive the talismanic all-rounder can still make an impact with the ball. Asked if Stokes will bowl against Ireland, McCullum responded: “I don’t know. You’ll have to ask Stokesy. He’s progressing well too. “He looks really fit as well, looks in great order and has a big smile on his face. “He is delighted to be back around the group and as our leader, having that sort of energy he brings is fantastic so again we’ll monitor that and see what happens. “I think he’ll bowl at some stage throughout the summer, yeah, no doubt. “He is a world class all-rounder and if he is able to bowl, fantastic. If not, we’ll find a way.”","pubDate":"2023-05-29 18:53:54","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Bismah charged for code of conduct violation","link":"https://thefrontierpost.com/bismah-charged-for-code-of-conduct-violation/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report KARACHI: Dynamites’ Bismah Maroof has been fined 20 per cent of match fee for a level 1 breach of the PCB’s Code of Conduct for Players and Player Support Personnel during her side’s match against Blasters in the ongoing Pakistan Cup Women’s Cricket Tournament 2022-23 at the State Bank Stadium on Monday. Bismah […]","content":"F.P. Report KARACHI: Dynamites’ Bismah Maroof has been fined 20 per cent of match fee for a level 1 breach of the PCB’s Code of Conduct for Players and Player Support Personnel during her side’s match against Blasters in the ongoing Pakistan Cup Women’s Cricket Tournament 2022-23 at the State Bank Stadium on Monday. Bismah was found to have violated Article 2.8 of the PCB Code of Conduct, which reads as: “Showing dissent at an Umpire’s decision during a Match”. The incident happened in the 40th over of Dynamites innings when Bismah showed obvious disappointment over the umpiring decision when she was given out LBW. The charge was imposed by on-field umpires Alay Hyder and Sabahat Rashid. Bismah accepted the charge and the fine was imposed by the match referee Mohammad Anees.","pubDate":"2023-05-29 18:51:18","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"England head coach McCullum says captain Stokes will bowl at 'some stage' during the Ashes","link":"https://www.dailymail.co.uk/sport/cricket/article-12136817/England-head-coach-McCullum-says-captain-Stokes-bowl-stage-Ashes.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"England will begin their Test summer on Thursday against Ireland at Lord's still uncertain about Ben Stokes's availability as a bowler because of his problematic left knee.","content":null,"pubDate":"2023-05-29 17:00:52","image_url":"https://i.dailymail.co.uk/1s/2023/05/29/17/71538295-0-image-a-15_1685379010046.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"CSK vs GT Live Score, IPL 2023 Final: GT openers OUT, score at 143/2 in 15 overs | Mint - Mint","link":"https://news.google.com/rss/articles/CBMiqQFodHRwczovL3d3dy5saXZlbWludC5jb20vbmV3cy9pbmRpYS9pcGwtZmluYWwtMjAyMy1jc2stdnMtZ3QtbWF0Y2gtbGl2ZS1jaGVubmFpLXN1cGVyLWtpbmdzLXZzLWd1amFyYXQtdGl0YW5zLXNjb3JlY2FyZC1wbGF5ZXJzLW1zLWRob25pLWRldm9uLWNvbndheS0xMTY4NTI1NjIzNzQ2Ni5odG1s0gGtAWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9uZXdzL2luZGlhL2lwbC1maW5hbC0yMDIzLWNzay12cy1ndC1tYXRjaC1saXZlLWNoZW5uYWktc3VwZXIta2luZ3MtdnMtZ3VqYXJhdC10aXRhbnMtc2NvcmVjYXJkLXBsYXllcnMtbXMtZGhvbmktZGV2b24tY29ud2F5L2FtcC0xMTY4NTI1NjIzNzQ2Ni5odG1s?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CSK vs GT Live Score, IPL 2023 Final: GT openers OUT, score at 143/2 in 15 overs | Mint  MintTake a cab to the hotel and disappear: Fans slam Deepak Chahar after he drops Gill and Saha inside the powerplay  Crictoday.com (Cricket News) Revealed: What Is written in Sanskrit on the IPL trophy which Dhoni or Hardik will lift  Crictoday.com (Cricket News) IPL LIVE Match Today | CSK Vs GT LIVE Match | Can MS Dhoni Beat Hardik Pandya At IPL Final 2023?  CNN-News18Seven questions about the IPL 2023 final reserve day | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2023-05-29 15:15:35","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Babar Azam addresses Islamic convention in US after joining Harvard Business School","link":"https://en.dailypakistan.com.pk/29-May-2023/babar-azam-addresses-islamic-convention-in-us-after-joining-harvard-business-schools","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE – Pakistan skipper Babar received another honour in the United States as he delivered a speech at one of the largest and most diverse Islamic conventions in Baltimore, a city in Maryland state.","content":"LAHORE – Pakistan skipper Babar received another honour in the United States as he delivered a speech at one of the largest and most diverse Islamic conventions in Baltimore, a city in Maryland state. A video shared on social media shows the World No.1 ODI batsman appearing on the stage of The 48th Annual ICNA-MAS Convention and sharing her thoughts in a jam-packed hall. Delivering his speech in Urdu language, the right-hand batsman urged the youth to keep themselves engage in the learning process. He also asked them to respect their elders and ponder over what they advise as they have more life experience. https://twitter.com/Rnawaz31888/status/1662762411282120704 Another Twitter shows the Pakistan captain and opener Mohammad Rizwan offering prayer after attending the convention. Earlier this week, Babar Azam, and wicketkeeper-batter, Mohammad Rizwan, made history by enrolling in the prestigious Harvard Business School’s executive education programme on the Business of Entertainment, Media, and Sports (BEMS). They are the first cricketers to join this renowned institution. From May 31 to June 3, the star duo will actively participate in the programme held on the Harvard campus in Boston, Massachusetts. Following the programme, both cricketers will engage with various communities in the United States until June 13, broadening their exposure.","pubDate":"2023-05-29 14:38:56","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-05-29/babar-azam-addresses-islamic-convention-in-us-after-joining-harvard-business-schools-1685357420-5010.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Chennai Super Kings vs Gujarat Titans Live Cricket Score, Quick Scorecard and Summary - Hindustan Times","link":"https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9saXZlLXNjb3JlY2FyZC1jc2stdnMtZ3QtaXBsLTIwMjMtZmluYWwtY2hlbm5haS1zdXBlci1raW5ncy12cy1ndWphcmF0LXRpdGFucy10MjAtbGl2ZS1zY29yZS1ja2FobTA1MjgyMDIzMjI1OTkwL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings vs Gujarat Titans Live Cricket Score, Quick Scorecard and Summary  Hindustan TimesIPL 2023: Chennai Super Kings vs Gujarat Titans Match Preview, IPL 2023  SportskeedaCSK vs GT Live Score - IPL 2023 Live Score & Commentary | Chennai Super Kings vs Gujarat Titans Score  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2023-05-29 14:00:00","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Sidra Amin helps Dynamites to third straight win","link":"https://thefrontierpost.com/sidra-amin-helps-dynamites-to-third-straight-win/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report LAHORE: Dynamites captain Sidra Amin made 95 off 100 balls to help her side to their third straight win in the Pakistan Cup Women’s Cricket Tournament as they beat Blasters by 78 runs at the State Bank Ground on Monday. The right-hander struck 13 fours and stitched a 130-run partnership for the second […]","content":"F.P. Report LAHORE: Dynamites captain Sidra Amin made 95 off 100 balls to help her side to their third straight win in the Pakistan Cup Women’s Cricket Tournament as they beat Blasters by 78 runs at the State Bank Ground on Monday. The right-hander struck 13 fours and stitched a 130-run partnership for the second wicket with Bismah Maroof, who made 95-ball 65 (hitting two fours and a six). The two came together when Khadija Chishti was out caught and bowled for five by Diana Baig with 23 runs on board. Sidra and Bismah now lead the tournament batting charts with 195 runs at 97.50 and 94 runs at 94, respectively. The partnership pushed back Blasters bowlers and propelled Dynamites to 214 for four in 45 overs. Diana and Saba Nazir picked up two wickets each. Blasters were all out for 136 in 37.3 overs as off-spinner Rameen Shamim took three wickets for 25, while Nashra Sundhu, Ghulam Fatima and Maham Manzoor picked up two wickets each. Blasters captain Muneeba Ali top-scored with 33 and the second best performance with the bat in the innings came from opener Ayesha Zafar, who made 30. Fatima, the leg-spinner, has the most wickets in the tournament with eight scalps at 7.88. Diana Baig and Aliya Riaz follow her with six and five wickets, respectively. Challengers, who are yet to win a match, will play Blasters on Wednesday. Scores in brief: Dynamites beat Blasters by 78 runs Dynamites 214-4, 45 overs (Sidra Amin 95, Bismah Maroof 65, Aliya Riaz 21; Saba Nazir 2-36, Diana Baig 2-37) Blasters 136 all out, 37.3 overs (Muneeba Ali 33, Ayesha Zafar 30; Rameen Shamim 3-25, Maham Manzoor 2-17, Nashra Sundhu 2-28, Ghulam Fatima 2-28) Player of the match – Sidra Amin (Dynamites)","pubDate":"2023-05-29 13:55:05","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Virat Kohli joins Team India's training session ahead of WTC final","link":"https://timesofindia.indiatimes.com/sports/cricket/news/virat-kohli-joins-team-indias-training-session-ahead-of-wtc-final/articleshow/100598375.cms","keywords":null,"creator":null,"video_url":null,"description":"India's batting sensation and former captain, Virat Kohli, joined the national team's training session on Monday at the picturesque Arundel Castle Cricket Club. Kohli's return to the squad has bolstered hopes for the upcoming World Test Championship (WTC) final against Australia at the Oval, scheduled from June 7 to 11.","content":null,"pubDate":"2023-05-29 13:48:09","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Virat Kohli joins Team India's training session ahead of WTC final - Indiatimes.com","link":"https://news.google.com/rss/articles/CBMiigFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9zcG9ydHMvY3JpY2tldC9uZXdzL3ZpcmF0LWtvaGxpLWpvaW5zLXRlYW0taW5kaWFzLXRyYWluaW5nLXNlc3Npb24tYWhlYWQtb2Ytd3RjLWZpbmFsL2FydGljbGVzaG93LzEwMDU5ODM3NS5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli joins Team India's training session ahead of WTC final  Indiatimes.comAustralia, India finalise squads for World Test Championship final  ICC CricketBig Boost For Team India As Injured Player Recovers Before WTC Final, Leaves For London - See Pic  Times NowICC World Test Championship Final: Scott Boland Front-Runner To Be In Australia's XI For WTC Final Against India - Reports  Cricket AddictorMitchell Marsh, Matt Renshaw left out as Australia trim Ashes squad for WTC final | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2023-05-29 13:48:00","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"जडेजा के चौके से चेन्नई ने गुजरात के जबड़े से छीनी जीत, धोनी एंड कंपनी ने 5वीं बार आईपीएल ट्रॉफी पर किया कब्जा","link":"https://hindi.news18.com/news/sports/cricket-ravindra-jadeja-shine-as-chennai-super-kings-beat-gujarat-titans-by-5-wickets-clinch-5th-time-ipl-trophy-equals-mumbai-indians-record-6355425.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"गुजरात टाइटंस ने पहले बैटिंग करते हुए 4 विकेट पर 214 रन बनाए. साई सुदर्श ने 47 गेंदों पर 46 रन की पारी खेली. वह आईपीएल फाइनल में सबसे बड़ी पारी खेलने वाले बतौर अनकैप्ड दूसरे खिलाड़ी बने. गुजरात ने आईपीएल फाइनल का सबसे बड़ा स्कोर बनाया. इससे पहले सनराइजर्स हैदरबाद ने साल 2016 में फाइनल में आरसीबी के खिलाफ 7 विकेट पर 208 रन बनाए थे. इसके बाद बारिश शुरू हो गई. बारिश के बाद जब खेल शुरू तब सीएसके को 15 ओवर में 171 रन का संशोधित लक्ष्य मिला.","content":"रवींद्र जडेजा ने आखिरी गेंद पर चौका जड़ चेन्नई को यादगार जीत दिलाई. नई दिल्ली. रवींद्र जडेजा की आखिरी गेंद पर चौके के दम पर चेन्नई सुपरकिंग्स ने फाइनल में गुजरात टाइटंस को 5 विकेट से हराकर 5वीं बार आईपीएल खिताब अपने नाम कर लिया है. वर्षा से बाधित मुकाबले में सीएसके को 15 ओवर में 171 रन का संशोधित लक्ष्य मिला था. उसने 15 ओवर में 5 विकेट पर लक्ष्य हासिल कर लिया. गुजरात ने पहले बैटिंग करते हुए 4 विकेट पर 214 रन बनाए थे. लक्ष्य का पीछा करने उतरी सीएसके की पारी के पहले ओवर की तीसरी गेंद के बाद फिर बारिश शुरू हो गई जिसमें काफी समय जाया हुआ. देर रात 12:10 में मुकाबले को 15 ओवर का कर दिया गया और सीएसके को संशोधित लक्ष्य दिया गया. बारिश से पहले सीएसके ने 4 रन बनाए थे. सीएसके को ऋतुराज गायकवाड़ और डेवोन कॉनवे की ओपनिंग जोड़ी ने धमाकेदार शुरुआत दिलाई. दोनों ने पहले विकेट के लिए 74 रन की साझेदारी की. ऋतुराज को नूर अहमद की गेंद पर राशिद खान ने कैच किया. गायकवाड़ 16 गेंदों पर 26 रन बनाकर आउट हुए. इसके बाद डेवोन कॉनवे भी ज्यादा देर तक क्रीज पर नहीं ठहर सके और नूर अहमद को विकेट थमाकर चलते बने. कॉनवे ने 25 गेंदों पर 47 रन बनाए. अजिंक्य रहाणे 27 रन बनाकर आउट हुए वहीं अंबाती रायुडू ने 19 रन का योगदान दिया . धोनी कुछ खास कमाल नहीं कर सके और पहली ही गेंद पर पवेलियन लौट गए. उन्हें मोहित शर्मा ने मिलर के हाथों कैच कराया. शिवम दुबे 32 और रवींद्र जडेजा 19 रन बनाकर नाबाद लौटे. गुजरात की ओर से मोहित शर्मा ने 3 जबकि नूर अहमद ने 2 विकेट चटकाए. बाबर आजम मेरा EX मंगेतर नहीं है जिसे मैं… मोहम्मद आमिर के बिगड़े बोल, स्पॉट फिक्सिंग में जा चुके हैं जेल गुजरात ने 4 विकेट पर 214 रन बनाए इससे पहले साई सुदर्शन के 47 गेंद में 96 रन की मदद से गुजरात टाइटंस ने 4 विकेट पर 214 रन बनाए. सुदर्शन ने अपनी पारी में 8 चौके और 6 छक्के लगाए. उन्होंने महत्वपूर्ण साझेदारियां निभाकर गुजरात को विशाल स्कोर दिया. इससे पहले शुभमन गिल 20 गेंद में 39 और रिधिमान साहा अर्धशतक बनाकर आउट हुए. दूसरे ही ओवर में गिल ने तुषार देशपांडे की गेंद पर लेग साइड में शॉट खेला लेकिन शॉर्ट फाइन लेग पर खड़े दीपक चाहर ने कैच टपका दिया. गिल हालांकि मुंबई इंडियंस के खिलाफ दूसरे क्वालीफायर में किये गए प्रदर्शन को दोहरा नहीं सके. धोनी ने स्टंपिंग में किया कमाल दूसरे छोर से साहा ने तीसरे ओवर में 16 रन निकालकर चेन्नई पर दबाव बनाया. इसके बाद गिल ने देशपांडे को लगातार तीन चौके लगाए जबकि साहा का रिटर्न कैच चाहर ने छोड़ा. पावरप्ले के बाद गुजरात का स्कोर बिना किसी नुकसान के 62 रन था. सातवें ओवर में हालांकि महेंद्र सिंह धोनी ने कुशल स्टम्पिंग का नमूना पेश करते हुए गिल को पवेलियन भेजा जबकि गेंदबाज रवींद्र जडेजा थे. गिल ने इस सीजन में 17 मैचों में 59 . 33 की औसत और 157 . 80 के स्ट्राइक रेट से 890 रन बनाए जो आईपीएल के इतिहास में किसी बल्लेबाज का दूसरा सर्वश्रेष्ठ प्रदर्शन है. पथिराना ने सुदर्शन को शतक से रोका साहा ने इस आईपीएल में अपना दूसरा अर्धशतक 13वें ओवर में पूरा किया. उनके और साई सुदर्शन के बीच 64 रन की साझेदारी 14वें ओवर में खत्म हुई जब चाहर ने उन्हें धोनी के हाथों लपकवाया. साहा ने 39 गेंद में पांच चौकों और एक छक्के की मदद से 54 रन बनाए. इस सत्र में गुजरात के लिये सर्वाधिक रन बनाने वाले दूसरे बल्लेबाज सुदर्शन ने अपना तीसरा अर्धशतक मथीषा पथिराना को लगातार चौके लगाकर पूरा किया. उन्होंने तीक्षणा को दो छक्के लगाए जबकि देशपांडे को तीन चौके और एक छक्का जड़ा. आखिरी ओवर में पथिराना ने सुदर्शन को एलबीडब्ल्यू आउट करके शतक से वंचित कर दिया. हार्दिक पंड्या ने 12 गेंद में नाबाद 21 रन बनाए. . Tags: Chennai super kings , Gujarat Titans , Hardik Pandya , IPL 2023 , Shubman gill , Wriddhiman saha IPL Rising Star: 5 युवा खिलाड़ियों को नहीं भूल पाएंगे आप, जल्दी ही दिख सकते हैं नेशनल टीम में मारधाड़ से हटकर बनी ये 8 फिल्में, कहानी के दम पर मचाया तहलका, तीसरे नंबर वाली को जितना देखो मन नहीं भरता 'KGF 2' और 'कांतारा' के बाद, साउथ से फिर उठने वाला है 1 बड़ा बवंडर, जल्द हिलने वाला है बॉक्स ऑफिस","pubDate":"2023-05-29 20:12:21","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/msd-16853921773x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Anderson, Robinson expected to be fit for England’s Ashes bid","link":"https://thefrontierpost.com/anderson-robinson-expected-to-be-fit-for-englands-ashes-bid/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"LONDON (Agencies): England head coach Brendon McCullum expects James Anderson and Ollie Robinson to be fit for the Ashes clash with Australia despite ruling the pace bowlers out of this week’s Test against Ireland. Anderson strained his groin while on Lancashire duty and Robinson suffered an ankle issue playing for Sussex earlier this month. The […]","content":"LONDON (Agencies): England head coach Brendon McCullum expects James Anderson and Ollie Robinson to be fit for the Ashes clash with Australia despite ruling the pace bowlers out of this week’s Test against Ireland. Anderson strained his groin while on Lancashire duty and Robinson suffered an ankle issue playing for Sussex earlier this month. The pair will remain sidelined when England host Ireland at Lord’s in a four-day match prior to the first Ashes Test. The five-match series against Australia begins on June 16, but McCullum is confident Anderson and Robinson can return in time for the opener in Birmingham. “For the first Ashes Test, I think they should be fit,” McCullum said on Monday. “They won’t be fit for this one against Ireland. We’ll just have to monitor it over this next sort of while, but we’ve got some great options right throughout the squad. “When I first took over this job, people said there wasn’t much depth in English cricket and I disagree with that completely. “I think there is an immense amount of depth and we’ve got plenty of good options throughout the squad.” England already have fitness concerns over a number of other bowlers, with Jofra Archer and Olly Stone struggling with elbow and hamstring problems respectively. With Anderson and Robinson ruled out, Stuart Broad will lead the bowling attack against Ireland but Mark Wood will have to be assessed before a final decision is made on his fitness. “He is bowling over there at the moment and seems to be getting through his work so hopefully he will be fine too,” McCullum said of Wood. “We’ve still got a couple of days and will make the decision when we need to, but he seems to be progressing well.” All eyes were on captain Ben Stokes during England’s training session on Monday. There are doubts over how much he will bowl this summer following an Indian Premier League series where he only played twice and sent down just one over for Chennai Super Kings. McCullum remains positive the talismanic all-rounder can still make an impact with the ball. Asked if Stokes will bowl against Ireland, McCullum responded: “I don’t know. You’ll have to ask Stokesy. He’s progressing well too. “He looks really fit as well, looks in great order and has a big smile on his face. “He is delighted to be back around the group and as our leader, having that sort of energy he brings is fantastic so again we’ll monitor that and see what happens. “I think he’ll bowl at some stage throughout the summer, yeah, no doubt. “He is a world class all-rounder and if he is able to bowl, fantastic. If not, we’ll find a way.”","pubDate":"2023-05-29 18:53:54","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Bismah charged for code of conduct violation","link":"https://thefrontierpost.com/bismah-charged-for-code-of-conduct-violation/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report KARACHI: Dynamites’ Bismah Maroof has been fined 20 per cent of match fee for a level 1 breach of the PCB’s Code of Conduct for Players and Player Support Personnel during her side’s match against Blasters in the ongoing Pakistan Cup Women’s Cricket Tournament 2022-23 at the State Bank Stadium on Monday. Bismah […]","content":"F.P. Report KARACHI: Dynamites’ Bismah Maroof has been fined 20 per cent of match fee for a level 1 breach of the PCB’s Code of Conduct for Players and Player Support Personnel during her side’s match against Blasters in the ongoing Pakistan Cup Women’s Cricket Tournament 2022-23 at the State Bank Stadium on Monday. Bismah was found to have violated Article 2.8 of the PCB Code of Conduct, which reads as: “Showing dissent at an Umpire’s decision during a Match”. The incident happened in the 40th over of Dynamites innings when Bismah showed obvious disappointment over the umpiring decision when she was given out LBW. The charge was imposed by on-field umpires Alay Hyder and Sabahat Rashid. Bismah accepted the charge and the fine was imposed by the match referee Mohammad Anees.","pubDate":"2023-05-29 18:51:18","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"England head coach McCullum says captain Stokes will bowl at 'some stage' during the Ashes","link":"https://www.dailymail.co.uk/sport/cricket/article-12136817/England-head-coach-McCullum-says-captain-Stokes-bowl-stage-Ashes.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"England will begin their Test summer on Thursday against Ireland at Lord's still uncertain about Ben Stokes's availability as a bowler because of his problematic left knee.","content":null,"pubDate":"2023-05-29 17:00:52","image_url":"https://i.dailymail.co.uk/1s/2023/05/29/17/71538295-0-image-a-15_1685379010046.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"CSK vs GT Live Score, IPL 2023 Final: GT openers OUT, score at 143/2 in 15 overs | Mint - Mint","link":"https://news.google.com/rss/articles/CBMiqQFodHRwczovL3d3dy5saXZlbWludC5jb20vbmV3cy9pbmRpYS9pcGwtZmluYWwtMjAyMy1jc2stdnMtZ3QtbWF0Y2gtbGl2ZS1jaGVubmFpLXN1cGVyLWtpbmdzLXZzLWd1amFyYXQtdGl0YW5zLXNjb3JlY2FyZC1wbGF5ZXJzLW1zLWRob25pLWRldm9uLWNvbndheS0xMTY4NTI1NjIzNzQ2Ni5odG1s0gGtAWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9uZXdzL2luZGlhL2lwbC1maW5hbC0yMDIzLWNzay12cy1ndC1tYXRjaC1saXZlLWNoZW5uYWktc3VwZXIta2luZ3MtdnMtZ3VqYXJhdC10aXRhbnMtc2NvcmVjYXJkLXBsYXllcnMtbXMtZGhvbmktZGV2b24tY29ud2F5L2FtcC0xMTY4NTI1NjIzNzQ2Ni5odG1s?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CSK vs GT Live Score, IPL 2023 Final: GT openers OUT, score at 143/2 in 15 overs | Mint  MintTake a cab to the hotel and disappear: Fans slam Deepak Chahar after he drops Gill and Saha inside the powerplay  Crictoday.com (Cricket News) Revealed: What Is written in Sanskrit on the IPL trophy which Dhoni or Hardik will lift  Crictoday.com (Cricket News) IPL LIVE Match Today | CSK Vs GT LIVE Match | Can MS Dhoni Beat Hardik Pandya At IPL Final 2023?  CNN-News18Seven questions about the IPL 2023 final reserve day | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2023-05-29 15:15:35","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Babar Azam addresses Islamic convention in US after joining Harvard Business School","link":"https://en.dailypakistan.com.pk/29-May-2023/babar-azam-addresses-islamic-convention-in-us-after-joining-harvard-business-schools","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE – Pakistan skipper Babar received another honour in the United States as he delivered a speech at one of the largest and most diverse Islamic conventions in Baltimore, a city in Maryland state.","content":"LAHORE – Pakistan skipper Babar received another honour in the United States as he delivered a speech at one of the largest and most diverse Islamic conventions in Baltimore, a city in Maryland state. A video shared on social media shows the World No.1 ODI batsman appearing on the stage of The 48th Annual ICNA-MAS Convention and sharing her thoughts in a jam-packed hall. Delivering his speech in Urdu language, the right-hand batsman urged the youth to keep themselves engage in the learning process. He also asked them to respect their elders and ponder over what they advise as they have more life experience. https://twitter.com/Rnawaz31888/status/1662762411282120704 Another Twitter shows the Pakistan captain and opener Mohammad Rizwan offering prayer after attending the convention. Earlier this week, Babar Azam, and wicketkeeper-batter, Mohammad Rizwan, made history by enrolling in the prestigious Harvard Business School’s executive education programme on the Business of Entertainment, Media, and Sports (BEMS). They are the first cricketers to join this renowned institution. From May 31 to June 3, the star duo will actively participate in the programme held on the Harvard campus in Boston, Massachusetts. Following the programme, both cricketers will engage with various communities in the United States until June 13, broadening their exposure.","pubDate":"2023-05-29 14:38:56","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-05-29/babar-azam-addresses-islamic-convention-in-us-after-joining-harvard-business-schools-1685357420-5010.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Chennai Super Kings vs Gujarat Titans Live Cricket Score, Quick Scorecard and Summary - Hindustan Times","link":"https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9saXZlLXNjb3JlY2FyZC1jc2stdnMtZ3QtaXBsLTIwMjMtZmluYWwtY2hlbm5haS1zdXBlci1raW5ncy12cy1ndWphcmF0LXRpdGFucy10MjAtbGl2ZS1zY29yZS1ja2FobTA1MjgyMDIzMjI1OTkwL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings vs Gujarat Titans Live Cricket Score, Quick Scorecard and Summary  Hindustan TimesIPL 2023: Chennai Super Kings vs Gujarat Titans Match Preview, IPL 2023  SportskeedaCSK vs GT Live Score - IPL 2023 Live Score & Commentary | Chennai Super Kings vs Gujarat Titans Score  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2023-05-29 14:00:00","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Sidra Amin helps Dynamites to third straight win","link":"https://thefrontierpost.com/sidra-amin-helps-dynamites-to-third-straight-win/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report LAHORE: Dynamites captain Sidra Amin made 95 off 100 balls to help her side to their third straight win in the Pakistan Cup Women’s Cricket Tournament as they beat Blasters by 78 runs at the State Bank Ground on Monday. The right-hander struck 13 fours and stitched a 130-run partnership for the second […]","content":"F.P. Report LAHORE: Dynamites captain Sidra Amin made 95 off 100 balls to help her side to their third straight win in the Pakistan Cup Women’s Cricket Tournament as they beat Blasters by 78 runs at the State Bank Ground on Monday. The right-hander struck 13 fours and stitched a 130-run partnership for the second wicket with Bismah Maroof, who made 95-ball 65 (hitting two fours and a six). The two came together when Khadija Chishti was out caught and bowled for five by Diana Baig with 23 runs on board. Sidra and Bismah now lead the tournament batting charts with 195 runs at 97.50 and 94 runs at 94, respectively. The partnership pushed back Blasters bowlers and propelled Dynamites to 214 for four in 45 overs. Diana and Saba Nazir picked up two wickets each. Blasters were all out for 136 in 37.3 overs as off-spinner Rameen Shamim took three wickets for 25, while Nashra Sundhu, Ghulam Fatima and Maham Manzoor picked up two wickets each. Blasters captain Muneeba Ali top-scored with 33 and the second best performance with the bat in the innings came from opener Ayesha Zafar, who made 30. Fatima, the leg-spinner, has the most wickets in the tournament with eight scalps at 7.88. Diana Baig and Aliya Riaz follow her with six and five wickets, respectively. Challengers, who are yet to win a match, will play Blasters on Wednesday. Scores in brief: Dynamites beat Blasters by 78 runs Dynamites 214-4, 45 overs (Sidra Amin 95, Bismah Maroof 65, Aliya Riaz 21; Saba Nazir 2-36, Diana Baig 2-37) Blasters 136 all out, 37.3 overs (Muneeba Ali 33, Ayesha Zafar 30; Rameen Shamim 3-25, Maham Manzoor 2-17, Nashra Sundhu 2-28, Ghulam Fatima 2-28) Player of the match – Sidra Amin (Dynamites)","pubDate":"2023-05-29 13:55:05","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Virat Kohli joins Team India's training session ahead of WTC final","link":"https://timesofindia.indiatimes.com/sports/cricket/news/virat-kohli-joins-team-indias-training-session-ahead-of-wtc-final/articleshow/100598375.cms","keywords":null,"creator":null,"video_url":null,"description":"India's batting sensation and former captain, Virat Kohli, joined the national team's training session on Monday at the picturesque Arundel Castle Cricket Club. Kohli's return to the squad has bolstered hopes for the upcoming World Test Championship (WTC) final against Australia at the Oval, scheduled from June 7 to 11.","content":null,"pubDate":"2023-05-29 13:48:09","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Virat Kohli joins Team India's training session ahead of WTC final - Indiatimes.com","link":"https://news.google.com/rss/articles/CBMiigFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9zcG9ydHMvY3JpY2tldC9uZXdzL3ZpcmF0LWtvaGxpLWpvaW5zLXRlYW0taW5kaWFzLXRyYWluaW5nLXNlc3Npb24tYWhlYWQtb2Ytd3RjLWZpbmFsL2FydGljbGVzaG93LzEwMDU5ODM3NS5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli joins Team India's training session ahead of WTC final  Indiatimes.comAustralia, India finalise squads for World Test Championship final  ICC CricketBig Boost For Team India As Injured Player Recovers Before WTC Final, Leaves For London - See Pic  Times NowICC World Test Championship Final: Scott Boland Front-Runner To Be In Australia's XI For WTC Final Against India - Reports  Cricket AddictorMitchell Marsh, Matt Renshaw left out as Australia trim Ashes squad for WTC final | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2023-05-29 13:48:00","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"}]}