{"newsArray":[{"title":"Khawaja video exposes Langer’s problem","link":"https://www.themercury.com.au/sport/cricket/usman-khawajas-relationship-with-justin-langer-comes-under-the-spotlight-following-explosive-interview/news-story/1f619a362f6dd85f5db18e8ba8909175","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"The relationship between Australian batter Usman Khawaja and former mentor Justin Langer has come under the spotlight following explosive remarks about his tenure as national coach.","content":"In a revealing and insightful interview with CODE Sports, Langer attacked anonymous “cowards” that leaked against him, taking aim at the Cricket Australia board for his unceremonious sacking.Watch Australia v West Indies. Every test match live and ad-break in play on Kayo. New to Kayo? Start your free trial now >The 52-year-old claimed Australian captains Pat Cummins and Aaron Finch failed to provide direct feedback about the playing group’s grievances with his intense coaching style.“I spoke to Pat Cummins. He said to me about five times, ‘This might be brutally honest.’ I said, ‘Pat, there is nothing brutal about your feedback. What is brutal is I’m hearing it behind my back through the media or through sources.’ No one’s telling me. Tell me,” Langer said.“Everyone was being nice to my face but I was reading about this stuff and half of it, I swear to God and on my kids’ lives, I could not believe that is what was making the papers.“A lot of journalists use the word ‘source’. I would say, change that word to ‘coward’. A coward says, not a source. Because what do you mean a source says? They’ve either got an axe to grind with someone and they won’t come and say it to your face, or they’re just leaking stuff for their own agenda. I hate that.”Langer’s remarks were rubbished by CA chief executive Nick Hockley on Wednesday, who claimed that “regular formal and informal opportunities to provide and receive feedback took place throughout his tenure”.According to The Age, Langer was handed extensive feedback following two separate independent reviews conducted by leadership expert Tim Ford.And the West Australian was seen struggling to accept feedback from Khawaja during popular docuseries The Test: A New Era for Australia’s Team.Following the 2018 Boxing Day Test against India at the MCG, a nervous Khawaja directly informed Langer that players were “intimidated” by him.“We can’t always control the result. You get better as individuals, players, staff, everyone, be in better control of that emotion, be more level-headed, without trying to make it too complicated,” Khawaja said.“I think that’s what the boys are trying to say. Does that makes sense?“The boys are intimidated by you, Alf. I think there’s a bit of the walking on eggshells sort of thing. I feel like I think the boys are afraid to say it.”Players were seemingly afraid to confront Langer — with the exception of Khawaja.The Queenslander was dropped from the Test side in 2019 following an underwhelming Ashes campaign, but the talented left-hander threw his support behind Langer after reports of player unrest emerged two years later.“How do you think JL feels? He probably feels like the guys in the team are stabbing him in the back, and that’s what it looks like,” Khawaja said on his YouTube channel last year.“That’s why it’s so disappointing. It’s actually a really bad look. This is something the group needs to sort out ASAP.”Last year, Hockley and then CA chair Earl Eddings were forced to call an emergency meeting with senior players to address issues within the changeroom, prompting Langer to take a step back and delegate more control to his support staff.The team’s performance improved after Langer handed responsibility over to assistant coaches Andrew McDonald and Michael Di Venuto, winning a maiden T20 World Cup title in the United Arab Emirates and retaining the Ashes undefeated on home soil.In February, Langer resigned as national coach after CA offered him a six-month contract extension.News Corp reporter Robert Craddocksuggests that Khawaja was the only player capable of short-circuiting the vicious feud between Langer and his team.Unfortunately, he wasn’t in the changeroom when Australia needed him.“I didn’t really know what was going on. I wasn’t part of the process. I just came back into the team a few months ago,” Khawaja said following Langer’s resignation.“I’ve been a little bit out of it.“I love him as a bloke, he’s a legend.“He brought humility back to the Australian team … I know what we played like before he was coach and I know what we played like when he was coach.”Nine months after Langer’s unceremonious resignation, tensions have reached breaking point.A war of words has erupted between CA and Langer one week out from the first Test of the home summer, an unnecessary distortion ahead of West Indies series.“We have not commented to date other than to correct inaccuracies, of which there are a number in Justin’s comments,” Hockley said in a statement.“I am disappointed by Justin’s comments unfairly criticising some of our players. The playing group are aware they have my full support.“After an excellent performance against England in the one-day international series, we are fully focused on an exciting Test series against the West Indies and South Africa.”","pubDate":"2022-11-23 23:29:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Hussey opens up on Langer’s ‘coward’ comments","link":"https://www.themercury.com.au/sport/cricket/hussey-opens-up-on-langers-coward-comments/video/1b18e2377264305dd6247305fc21fb4a","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Former Australian star Mike Hussey has given his thoughts on Justin Langer's controversial comments following his axing from the position of Australian coach.","content":"Cricket: Former Australian star Mike Hussey has given his thoughts on Justin Langer's controversial comments following his axing from the position of Australian coach.","pubDate":"2022-11-23 23:27:20","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"20 wickets fall on a chaotic Day 2 between WA & NSW","link":"https://www.themercury.com.au/sport/cricket/20-wickets-fall-on-a-chaotic-day-2-between-wa-nsw/video/90c647f27a096b3dbfcf59c650ee368a","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: In a chaotic day at the SCG, 20 wickets have fallen on Day 2 of New South Wales'clash against Western Australia.","content":"Cricket: In a chaotic day at the SCG, 20 wickets have fallen on Day 2 of New South Wales'clash against Western Australia.","pubDate":"2022-11-23 23:09:21","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Everyone was being nice to my face: Langer slams ‘cowards’ in Australia team","link":"https://kashmirreader.com/2022/11/24/everyone-was-being-nice-to-my-face-langer-slams-cowards-in-australia-team/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Melbourne: Former Australia coach Justin Langer has hit out at the “cowards” in the national team, saying he “hated” that some players were going behind his back and leaking details from inside the dressing room. The 52-year-old, who guided Australia to a 4-0 series win in the Ashes at home and a maiden T20 World […]","content":"Melbourne: Former Australia coach Justin Langer has hit out at the “cowards” in the national team, saying he “hated” that some players were going behind his back and leaking details from inside the dressing room. The 52-year-old, who guided Australia to a 4-0 series win in the Ashes at home and a maiden T20 World Cup title last year, stepped down as chief coach in February after he was not offered a long-term contract extension by Cricket Australia. Langer had faced complaints about his “rigid” coaching style from senior players such as Aaron Finch, Pat Cummins and former Test captain Tim Paine. “Everyone was being nice to my face, but I was reading about this stuff and half of it, I swear to God and on my kids’ lives, I could not believe that is what was making the papers. A lot of journalists use the word ‘source’. I would say, change that word to ‘coward’,” Langer was quoted as saying by News Corp media. “Because what do you mean ‘a source says’? They’ve either got an axe to grind with someone and they won’t come and say it to your face, or they’re just leaking stuff for their own agenda. I hate that.” There have been numerous media reports in the run-up to the T20 World Cup about alleged discontent in the dressing room due to Langer’s coaching style. Langer, who had taken charge after Darren Lehmann quit following the ball-tampering scandal in South Africa, said it was difficult to resign as he was enjoying his job. “We were number one in the world. I’ve never enjoyed coaching more and I’ve still got sacked. That’s the hardest thing,” Langer said. —PTI Everyone was being nice to my face: Langer slams ‘cowards’ in Australia team added by KR Desk on 12:11 am November 24, 2022 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-23 18:41:55","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"T-20 Martyrs Police Premier Cricket League concludes","link":"https://thenorthlines.com/t-20-martyrs-police-premier-cricket-league-concludes/","keywords":["Jammu Kashmir","Kashmir","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Correspondent Ganderbal Nov 23: The valedictory function of ‘T20 Martyrs Police Premier Cricket League Tournament’ was held at Qamariya Ground Ganderbal. The said Cricket Tournament was organised by Police on 23rd October 2022 under the aegis of Civic Action Programme (CAP) and to provide a platform to the talented youth and channelize their energy […] The post T-20 Martyrs Police Premier Cricket League concludes appeared first on Northlines.","content":"NL Correspondent Ganderbal Nov 23: The valedictory function of ‘T20 Martyrs Police Premier Cricket League Tournament’ was held at Qamariya Ground Ganderbal. The said Cricket Tournament was organised by Police on 23rd October 2022 under the aegis of Civic Action Programme (CAP) and to provide a platform to the talented youth and channelize their energy in positive manner. SSP Ganderbal Shri Nikhil Borkar-IPS graced the occasion as Chief Guest. Besides, ASP Ganderbal Shri Feroz Yeyha-JKPS, SDPO Kangan, DySP Headquarters Ganderbal, DySP DAR Ganderbal, Senior Cricket Player Sayim Mustafa and other senior officers were also present on the occasion. The Grand Finale of the tournament was played between Libra Blues Saloora Vs Sultan Lions Tulmulla. Libra Blues Saloora scored 110 runs in allotted 20 overs. Sultan Lions Tulmulla reached the target with ease and won the tournament. SSP Ganderbal while interacting with the players said that Police are committed to promote sports and other youth development activities to channelize their energy in positive manner. He further stated that sports activities are important for personality development, positivity, good health and sense of achievement. He also congratulated the winner team for showcasing excellent performance in the final match. Besides, large number of people witnessed the Grand Finale event. They expressed their gratitude towards Police and appreciated their role to channelize the energy of the youth of District towards sports and other constructive activities. At the conclusion of the event, both winner and runner up teams were awarded with cash prizes, trophies and medals to boost their morale.","pubDate":"2022-11-23 18:12:43","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Dinesh Karthik puts up cryptic post about T20 World Cup, prompts speculation around retirement","link":"https://www.firstpost.com/firstcricket/sports-news/dinesh-karthik-puts-up-cryptic-post-about-t20-world-cup-prompts-speculation-around-retirement-11684061.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Dinesh Karthik puts up cryptic post about T20 World Cup, prompts speculation around retirement","content":"Cricket Dinesh Karthik puts up cryptic post about T20 World Cup, prompts speculation around retirement The post has prompted speculation among Karthik’s fans. Many users were left guessing if the wicketkeeper-batter has unofficially announced his retirement. FP Trending November 23rd, 2022 23:37:32 IST Dinesh Karthik might not be seen in Indian colours again. Sportzpics The T20 World Cup in Australia was a bittersweet moment for Dinesh Karthik. The wicketkeeper-batter, who made a spectacular comeback into the Indian side this year, was included in the T20 World Cup squad after a long time. But Karthik failed to make his mark in the high-stakes tournament . India endured a crushing defeat against England in the semi-finals, ending their dreams of lifting the trophy for a second time. Now, Dinesh Karthik, who is presently being rested by the selectors, has put up a cryptic post, prompting speculations about his retirement. “Worked hard towards the goal of playing the T20 World Cup for India and it was such a proud feeling to do so… we did fall short of the ultimate motive, but it did fill my life with many memories to cherish. Thank you to all my fellow players, coaches, friends, and most importantly the fans for the undying support,” wrote Dinesh Karthik. He ended his post with the hashtag – ‘dreams do come true’. A video shared by Karthik also features a montage of moments from the tournament. In the clip, Karthik can be seen hanging out with his family and his kids. The video also featured him enjoying some light moments with Hardik Pandya, Yuzvendra Chahal, and Ravichandran Ashwin. Watch: View this post on Instagram A post shared by Dinesh Karthik (@dk00019) Many users were left guessing if the wicketkeeper-batter has unofficially announced his retirement. “Don’t announce your retirement, we aren’t ready,” wrote one fan. Another remarked, “Pls DK we beg you not to retire from any format, come back again even stronger”. Dinesh Karthik was chosen for the T20 World Cup squad due to his role as a finisher for Royal Challengers Bangalore in last season’s Indian Premier League (IPL). For team India, Karthik had to compete with Rishabh Pant for the wicketkeeper’s role. In the World Cup, Karthik failed to score big. In the four games he played, he managed to score only 14 runs. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 23, 2022 23:37:32 IST Tags: Cricket Dinesh Karthik Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-23 18:07:32","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Dinesh-Karthik-2.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2023: Mumbai Indians’ Auction Gamble Could Pay off as Jofra Archer Breathes Fire on Return","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-mumbai-indians-auction-gamble-could-pay-off-as-jofra-archer-breathes-fire-on-return-11684651.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"IPL 2023: Mumbai Indians’ Auction Gamble Could Pay off as Jofra Archer Breathes Fire on Return","content":"Cricket IPL 2023: Mumbai Indians’ Auction Gamble Could Pay off as Jofra Archer Breathes Fire on Return Still early days, but Jofra Archer’s return to competitive cricket will trigger a sigh of relief in the Mumbai Indians camp. Sahil Malhotra November 23rd, 2022 23:20:02 IST Jofra Archer/ Twitter In the February mega auction ahead of the 2022 edition of the Indian Premier League, it was player No. 171 who caught the attention of everyone. England speedster Jofra Archer had registered himself for the auction but was only available for the 2023 and 2024 seasons due to an injury. The 27-year-old, who last played international cricket in the away series against India, underwent elbow surgery before a stress fracture on return to the County circuit ruled him out for the remainder of the English season back then. All this, however, didn’t affect Mumbai Indians’ plans one bit as the franchise went hard for the speedster at the mega auctions. MI owner Akash Ambani didn’t put the pedal down and the war between Rajasthan Royals and MI took the bidding to Rs 4.6 crores in a few minutes. Both RR and MI had acquired 12 players each till then but Mumbai’s superior purse – Rs 23.70 crores – allowed them to go all out for the seamer. SRH joined the party briefly towards the fag end before MI sealed the deal at Rs 8 crores. There were a lot of riders at that signing, but Mumbai were clear with its plans. The franchise put to work a long-term vision with a potentially explosive pairing of Jasprit Bumrah and Archer. Against popular perception, MI didn’t look to beef up their wallets ahead of the mini-auctions too as they retained the English seamer. Jofra Archer bowling in England whites, to Zak Crawley pic.twitter.com/Z8Z8appECw — Will Macpherson (@willis_macp) November 23, 2022 After a long absence , Archer is back in the middle and was seen in action during the fixture between England and England Lions in Abu Dhabi. According to a Telegraph report, Archer troubled England opener Zak Crawley and even hit him on the helmet. MI’s pace battery Still early days, but Archer’s return to competitive cricket will trigger a sigh of relief in the Mumbai Indians camp. The five-time IPL winners had also acquired Australia seamer Jason Behrendorff in a trade with RCB earlier this month and with Archer and Bumrah, the trio are set to make a very potent seam-bowling attack. While many termed the Archer bid a gamble from Mumbai Indians, the franchise seemed clear with its thought process. And an injury was certainly not going to change their thought process. “If someone would have told me that we would be walking back with Ishan Kishan and Jofra Archer, I wouldn’t have believed them,” Akash Ambani had said after the mega auction. The focus could be on spin at mini-auction and Indian seamers Archer’s return could also help MI get some answers and help them get a lot of clarity ahead of mini-auctions. A quick look at the retained players list is enough to understand what’s missing. The team could now well look to add some Indian seamers to the mix and look for quality spin options – something which was missing in the previous editions. MI released Mayank Markande, Murugan Ashwin, and Sanjay Yadav and with only Hrithik Shokeen and Kumar Kartikeya in the ranks, the team is likely to go big on a spin in the upcoming auctions. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 23, 2022 23:20:02 IST Tags: Cricket Jofra Archer Mumbai Indians Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-23 17:50:02","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Jofra-Archer.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Bangladesh moves third ODI against India from Dhaka to Chittagong after protest threat","link":"https://sportstar.thehindu.com/cricket/bangladesh-moves-india-match-from-dhaka-to-chittangong-protest-threat/article66175577.ece","keywords":null,"creator":["\n         AFP  \n    "],"video_url":null,"description":"Bangladesh’s cricket board has moved a one-day international against India next month from Dhaka after the country’s opposition announced plans for a protest that could paralyse the capital the same day.","content":null,"pubDate":"2022-11-23 17:03:50","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup फाइनल में हारने वाली पाकिस्तानी क्रिकेट टीम को सम्मानित करेगी पीसीबी, जानें क्या है कारण","link":"https://www.abplive.com/sports/cricket/pcb-to-honor-players-of-pakistan-cricket-team-at-an-event-in-islamabad-2266008","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Pakistan Cricket Team: पाकिस्तान की क्रिकेट टीम के लिए साल 2022 शानदार रहा है. दरअसल, बाबर आजम की टीम एशिया कप फाइनल के बाद टी20 वर्ल्ड कप के फाइनल तक पहुंची. हालांकि, दोनों टूर्नामेंट्स के फाइनल मैच में पाकिस्तान टीम को हार का सामना करना पड़ा, लेकिन टीम ने प्रदर्शन से खासा प्रभावित किया. अब पीसीबी ने पाकिस्तान टीम को सम्मानित करने का फैसला किया है. इसके लिए इस्लामाबाद में एक कार्यक्रम का आयोजन किया जाएगा. वहीं, इस आयोजन में पाकिस्तान टेस्ट टीम के सदस्यों को भी बुलाया गया है. पीसीबी अपने खिलाड़ियों को करेगा सम्मानित यहीं नहीं, इसके अलावा राजनयिक, राजनीतिक हस्तियां, पूर्व कप्तान और खिलाड़ी इस आयोजन का हिस्सा होंगे. मीडिया रिपोर्ट्स के मुताबिक, इसका उद्देश्य खिलाड़ियों को दो बड़े टूर्नामेंटों में उनके प्रदर्शन के लिए सम्मान और मनोबल बढ़ाना है. वहीं, एशिया कप के बाद टी20 वर्ल्ड कप के फाइनल तक पहुंचने वाली पाकिस्तानी टीम को कुछ आर्थिक पुरस्कार भी दिया जा सकता है. बताया जा रहा है कि इस आयोजन के बाबत पीसीबी अध्यक्ष पहले ही बाबर और मुख्य कोच सकलेन मुश्ताक से मिल चुके हैं. 'हम सभी प्रारूपों में सर्वश्रेष्ठ प्रदर्शन करने के खिलाड़ियों को सम्मानित करेंगे' पीसीबी अध्यक्ष रमीज राजा ने पाकिस्तान टीम की सराहना की. उन्होंने कहा कि टीम ने दो बड़े टूर्नामेंट्स के फाइनल में जगह बनाई. हम सभी प्रारूपों में सर्वश्रेष्ठ प्रदर्शन करने के खिलाड़ियों को सम्मानित करेंगे. हालांकि, उन्होंने कहा कि अब भी टीम को अपनी कई खामियों पर काम करना होगा. गौरतलब है कि पाकिस्तान संयुक्त अरब अमीरात में एशिया कप का फाइनल श्रीलंका से हार गया था. इसके अलावा बाबर आजम की टीम टी20 विश्व कप फाइनल में इंग्लैंड के खिलाफ हार गई थी. ये भी पढ़ें- Chamika Karunaratne Suspended: T20 विश्वकप में करुणारत्ने को नियम तोड़ना पड़ा भारी, श्रीलंका ने लगाया एक साल का प्रतिबंध RCB ने ट्वीट कर डुप्लेसी को खास अंदाज में दी शादी सालगिरह की बधाई, फोटो वायरल","content":"Pakistan Cricket Team: पाकिस्तान की क्रिकेट टीम के लिए साल 2022 शानदार रहा है. दरअसल, बाबर आजम की टीम एशिया कप फाइनल के बाद टी20 वर्ल्ड कप के फाइनल तक पहुंची. हालांकि, दोनों टूर्नामेंट्स के फाइनल मैच में पाकिस्तान टीम को हार का सामना करना पड़ा, लेकिन टीम ने प्रदर्शन से खासा प्रभावित किया. अब पीसीबी ने पाकिस्तान टीम को सम्मानित करने का फैसला किया है. इसके लिए इस्लामाबाद में एक कार्यक्रम का आयोजन किया जाएगा. वहीं, इस आयोजन में पाकिस्तान टेस्ट टीम के सदस्यों को भी बुलाया गया है. पीसीबी अपने खिलाड़ियों को करेगा सम्मानित यहीं नहीं, इसके अलावा राजनयिक, राजनीतिक हस्तियां, पूर्व कप्तान और खिलाड़ी इस आयोजन का हिस्सा होंगे. मीडिया रिपोर्ट्स के मुताबिक, इसका उद्देश्य खिलाड़ियों को दो बड़े टूर्नामेंटों में उनके प्रदर्शन के लिए सम्मान और मनोबल बढ़ाना है. वहीं, एशिया कप के बाद टी20 वर्ल्ड कप के फाइनल तक पहुंचने वाली पाकिस्तानी टीम को कुछ आर्थिक पुरस्कार भी दिया जा सकता है. बताया जा रहा है कि इस आयोजन के बाबत पीसीबी अध्यक्ष पहले ही बाबर और मुख्य कोच सकलेन मुश्ताक से मिल चुके हैं. 'हम सभी प्रारूपों में सर्वश्रेष्ठ प्रदर्शन करने के खिलाड़ियों को सम्मानित करेंगे' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels पीसीबी अध्यक्ष रमीज राजा ने पाकिस्तान टीम की सराहना की. उन्होंने कहा कि टीम ने दो बड़े टूर्नामेंट्स के फाइनल में जगह बनाई. हम सभी प्रारूपों में सर्वश्रेष्ठ प्रदर्शन करने के खिलाड़ियों को सम्मानित करेंगे. हालांकि, उन्होंने कहा कि अब भी टीम को अपनी कई खामियों पर काम करना होगा. गौरतलब है कि पाकिस्तान संयुक्त अरब अमीरात में एशिया कप का फाइनल श्रीलंका से हार गया था. इसके अलावा बाबर आजम की टीम टी20 विश्व कप फाइनल में इंग्लैंड के खिलाफ हार गई थी. ये भी पढ़ें- Chamika Karunaratne Suspended: T20 विश्वकप में करुणारत्ने को नियम तोड़ना पड़ा भारी, श्रीलंका ने लगाया एक साल का प्रतिबंध RCB ने ट्वीट कर डुप्लेसी को खास अंदाज में दी शादी सालगिरह की बधाई, फोटो वायरल var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-11-23 16:18:52","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Rehan Ahmed earns a call-up for Pakistan tour, could become youngest man to play a Test for England","link":"https://sportstar.thehindu.com/cricket/rehan-ahmed-earns-a-call-up-england-vs-pakistan-test-youngest-man-to-play-test-cricket/article66175205.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"If the youngster goes on to make it to the final eleven, he will become the youngest player to play Test cricket for England men’s team. In July 1949, Brian Close made his debut for England at 18 years 149 days.","content":null,"pubDate":"2022-11-23 15:33:35","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup के दौरान करुणारत्ने को नियम तोड़ना पड़ा भारी, श्रीलंका क्रिकेट ने लगा दिया एक साल का प्रतिबंध","link":"https://www.abplive.com/sports/cricket/sri-lanka-suspended-chamika-karunaratne-for-one-year-ban-from-all-cricket-t20-world-cup-2022-2265941","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Sri Lanka Ban Chamika Karunaratne: ऑलराउंडर चमिका करुणारत्ने को ऑस्ट्रेलिया में आईसीसी टी20 विश्व कप के दौरान श्रीलंका क्रिकेट (एसएलसी) के अनुबंध का उल्लंघन करने पर क्रिकेट के सभी प्रारूपों से एक साल का निलंबित प्रतिबंध लगा दिया गया. करुणारत्ने को खिलाड़ी समझौते में कई धाराओं के उल्लंघन सहित उनके खिलाफ लगाए गए सभी आरोपों के लिए दोषी ठहराया गया है. एसएलसी ने कहा कि राष्ट्रीय अनुबंधित खिलाड़ी द्वारा कथित उल्लंघन में तीन सदस्यीय जांच पैनल द्वारा अनुशासनात्मक जांच की गई थी. इससे पहले रिपोर्ट ने संकेत दिया था कि करुणारत्ने विश्व कप के दौरान एक कैसीनो में कथित तौर पर गए थे. हालांकि जब आईएएनएस द्वारा पूछताछ की गई, तो एसएलसी ने गेंदबाजी ऑलराउंडर के खिलाफ सटीक आरोपों का खुलासा नहीं किया. एसएलसी ने कहा, \"करुणारत्ने के उल्लंघनों की गंभीरता को देखते हुए, जांच पैनल ने अपनी रिपोर्ट द्वारा एसएलसी की कार्यकारी समिति को खिलाड़ी को और उल्लंघनों से बचने के लिए कड़ी चेतावनी देने की सिफारिश की है और एक ऐसी सजा देने की सिफारिश की है जिसका उनके क्रिकेट करियर पर कोई प्रभाव नहीं पड़ेगा.\" जांच पैनल के निष्कर्षों और सिफारिशों के बाद, एसएलसी की कार्यकारी समिति ने क्रिकेट के सभी प्रारूपों में भाग लेने से एक साल का प्रतिबंध लगा दिया है, और उक्त प्रतिबंध को एक वर्ष की अवधि के लिए निलंबित कर दिया गया था. करुणारत्ने पर 5,000 डॉलर का जुर्माना भी लगाया गया है. करुणारत्ने को 25 नवंबर से कैंडी में शुरू होने वाली तीन मैचों की श्रृंखला में अफगानिस्तान के खिलाफ वनडे टीम से भी बाहर कर दिया गया है. एक अन्य घायल बल्लेबाज दनुष्का गुनातिलका को सिडनी में एक अदालती मामले में एक महिला द्वारा कथित यौन उत्पीड़न की शिकायत पर रिमांड पर लिया गया था, जिससे उन्होंने एक डेटिंग ऐप पर बातचीत की थी. हालांकि जमानत दी गई, गुनातिलका को ऑस्ट्रेलिया छोड़ने पर रोक लगा दी गई है. A breach in player agreement clause during the #T20WorldCup in Australia has seen the player handed a one-year ban by Sri Lanka Cricket 😮Details 👇https://t.co/Yvlnqb8Ug9 — ICC (@ICC) November 23, 2022 यह भी पढ़ें : FIFA WC 2022: अर्जेंटीना के मैनेजर स्कोलोनी ने सऊदी अरब से मिली हार पर दी प्रतिक्रिया, बताया क्या होगा अगले मैच में प्लान","content":"Sri Lanka Ban Chamika Karunaratne: ऑलराउंडर चमिका करुणारत्ने को ऑस्ट्रेलिया में आईसीसी टी20 विश्व कप के दौरान श्रीलंका क्रिकेट (एसएलसी) के अनुबंध का उल्लंघन करने पर क्रिकेट के सभी प्रारूपों से एक साल का निलंबित प्रतिबंध लगा दिया गया. करुणारत्ने को खिलाड़ी समझौते में कई धाराओं के उल्लंघन सहित उनके खिलाफ लगाए गए सभी आरोपों के लिए दोषी ठहराया गया है. एसएलसी ने कहा कि राष्ट्रीय अनुबंधित खिलाड़ी द्वारा कथित उल्लंघन में तीन सदस्यीय जांच पैनल द्वारा अनुशासनात्मक जांच की गई थी. इससे पहले रिपोर्ट ने संकेत दिया था कि करुणारत्ने विश्व कप के दौरान एक कैसीनो में कथित तौर पर गए थे. हालांकि जब आईएएनएस द्वारा पूछताछ की गई, तो एसएलसी ने गेंदबाजी ऑलराउंडर के खिलाफ सटीक आरोपों का खुलासा नहीं किया. एसएलसी ने कहा, \"करुणारत्ने के उल्लंघनों की गंभीरता को देखते हुए, जांच पैनल ने अपनी रिपोर्ट द्वारा एसएलसी की कार्यकारी समिति को खिलाड़ी को और उल्लंघनों से बचने के लिए कड़ी चेतावनी देने की सिफारिश की है और एक ऐसी सजा देने की सिफारिश की है जिसका उनके क्रिकेट करियर पर कोई प्रभाव नहीं पड़ेगा.\" जांच पैनल के निष्कर्षों और सिफारिशों के बाद, एसएलसी की कार्यकारी समिति ने क्रिकेट के सभी प्रारूपों में भाग लेने से एक साल का प्रतिबंध लगा दिया है, और उक्त प्रतिबंध को एक वर्ष की अवधि के लिए निलंबित कर दिया गया था. करुणारत्ने पर 5,000 डॉलर का जुर्माना भी लगाया गया है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels करुणारत्ने को 25 नवंबर से कैंडी में शुरू होने वाली तीन मैचों की श्रृंखला में अफगानिस्तान के खिलाफ वनडे टीम से भी बाहर कर दिया गया है. एक अन्य घायल बल्लेबाज दनुष्का गुनातिलका को सिडनी में एक अदालती मामले में एक महिला द्वारा कथित यौन उत्पीड़न की शिकायत पर रिमांड पर लिया गया था, जिससे उन्होंने एक डेटिंग ऐप पर बातचीत की थी. हालांकि जमानत दी गई, गुनातिलका को ऑस्ट्रेलिया छोड़ने पर रोक लगा दी गई है. A breach in player agreement clause during the #T20WorldCup in Australia has seen the player handed a one-year ban by Sri Lanka Cricket 😮 Details 👇 https://t.co/Yvlnqb8Ug9 — ICC (@ICC) November 23, 2022 यह भी पढ़ें : FIFA WC 2022: अर्जेंटीना के मैनेजर स्कोलोनी ने सऊदी अरब से मिली हार पर दी प्रतिक्रिया, बताया क्या होगा अगले मैच में प्लान var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-11-23 14:36:59","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"England and Wales Cricket Board (ECB) - The Official Website of the ECB - ECB.co.uk","link":"https://news.google.com/__i/rss/rd/articles/CBMiImh0dHBzOi8vd3d3LmVjYi5jby51ay9uZXdzLzI5MTU1MzXSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England and Wales Cricket Board (ECB) - The Official Website of the ECB  ECB.co.ukRehan Ahmed in line to become England’s youngest men’s Test cricketer  The GuardianRehan Ahmed could become youngest man to play a Test for England after call-up for Pakistan tour  ESPNcricinfoEngland add teenage spinner Ahmed to Pakistan squad  Arab NewsRehan Ahmed added to England men’s Test squad  Sky SportsView Full coverage on Google News","content":null,"pubDate":"2022-11-23 13:51:04","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Irish players in franchise league moves","link":"https://www.cricketireland.ie/news/article/irish-players-in-franchise-league-moves","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN – Irish internationals Paul Stirling, Josh Little and Curtis Campher have been offered deals in various white-ball franchise leagues, with Cricket Ireland agreeing to No Objection Certificates (NOC) allowing the players to take up the opportunities.","content":"Paul Stirling Stirling, Ireland’s most experienced current player, has played in T20 franchises in Bangladesh, Afghanistan, Sri Lanka, Pakistan, West Indies and England. He has signed up with New York Strikers in Abu Dhabi. His first game is 23 November 2022, with the tournament set to finish on 4 December 2022. Follow the scores here . The full New York Strikers squad is: Kieron Pollard (c), Azam Khan, Eoin Morgan, Paul Stirling, Romario Shepherd, Wahab Riaz, Jordan Thompson, Andre Fletcher, Kesrick Williams, Izharulhaq Naveed, Tom Hartley, Muhammad Waseem, Nav Pabreja, Muhammad Farooq, Akeal Hosein, Ravi Rampaul, Stuart Binny. Coach: Carl Crowe. Josh Little After a very successful ICC T20 World Cup campaign Little, 22, has signed for last year’s winners Deccan Gladiators. He has previously played with Dambulla Giants of the Lanka Premier League, and Manchester Originals in The Hundred, where they finished runners-up this summer. Little heads to the tournament after taking 11 wickets in Australia, including a brilliant hat-trick against New Zealand. His first game is 23 November 2022, with the tournament set to finish on 4 December 2022. Follow the scores here The full Deccan Gladiators squad is: Nicholas Pooran, Andre Russell, Zahoor Khan, Tom Kohler-Cadmore, David Wiese, Odean Smith, Jason Roy, Mujeeb Ur Rahman, Luke Wood, Josh Little, Will Smeed, Zahir Khan, Curtis Campher, Adeel Malik, Sultan Ahmed, Taskin Ahmed, Suresh Raina, Tabraiz Shamsi, Tom Helm. Coach: Mushtaq Ahmed. Curtis Campher Following another eye-catching performance at a T20 World Cup, Campher, 23, will play for the Chattogram Challengers in the ninth edition of the Bangladesh Premier League. He has previously played with the Chennai Braves in the Abu Dhabi T10. The first game is of the tournament is 5 January 2023, with the tournament set to finish on 16 February 2023. The full Chattogram Challengers squad is: Afif Hossain, Vishwa Fernando, Ashan Priyanjan, Curtis Campher, Mrittunjoy Chowdhury, Shuvagata Hom, Mehedi Hasan Rana, Irfan Shukkur, Mehedi Maruf, Ziaur Rahman, Maxwell Patrick, Unmukt Chand, Taijul Islam, Abu Jayed Rahi, Farhad Reza, Towfiq Khan.","pubDate":"2022-11-23 13:08:58","image_url":null,"source_id":"cricketireland","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Chamika Karunaratne handed one-year suspended ban by Sri Lanka Cricket","link":"https://sportstar.thehindu.com/cricket/chamika-karunaratne-handed-one-year-suspended-ban-sri-lanka-cricket/article66174239.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Chamika Karunaratne has been handed a one-year suspended ban from taking part in all forms of cricket by Sri Lanka Cricket for breaching several clauses in the player agreement during the T20 World Cup.","content":null,"pubDate":"2022-11-23 12:55:13","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan Cricket Board to felicitate players","link":"https://sportstar.thehindu.com/cricket/pakistan-cricket-board-felicitate-players-t20-world-cup-final-asia-cup-runner-up-ramiz-raja-babar-azam/article66173996.ece","keywords":null,"creator":["\n         PTI  \n    "],"video_url":null,"description":"Pakistan lost the final of the Asia Cup to Sri Lanka in the UAE and then was beaten by England in the T20 World Cup summit clash in Melbourne earlier this month.","content":null,"pubDate":"2022-11-23 12:19:14","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Germany vs Japan, FIFA World Cup 2022 Live Updates: Four-time champions eye winning start in Group E","link":"https://www.firstpost.com/sports/fifa-world-cup-2022-live-germany-vs-japan-football-match-live-score-qatar-latest-updates-11683241.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Germany vs Japan, FIFA World Cup 2022 Live Updates: Four-time champions eye winning start in Group E","content":"17:38 (IST)Hello and welcome to our live coverage of the opening game of the Group E of the 2022 FIFA World Cup, with Germany taking on Japan at the Khalifa International Stadium in Doha on Wednesday.Preview: Germany will hope to get their 2022 FIFA World Cup campaign off to a winning start when they square off against Japan on Wednesday.FIFA World Cup: Fixtures | Results | Points Table | Squads | RecordsThe Hansi Flick-managed side, who defeated Argentina in the 2014 final in Brazil in what was their fourth FIFA World Cup win, are hoping to go the distance in Qatar this time around after enduring a disappointing run in Russia four years ago.Germany were knocked out in the group stage for the first time ever in FIFA World Cup history after defeats against Mexico and South Korea, resulting in the team finishing at the bottom of Group F.Japan, aka the Samurai Blue, have consistently made it to the FIFA World Cup since making their debut in the 1998 edition in France, going as far as the pre-quarter-finals thrice in six appearances. They had finished second in Group H in 2018, but bowed out after a narrow 3-2 loss against Belgium in the Round of 16.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-23 12:09:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Germany-training-Japan-World-Cup-AP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"‘He is better than everyone else, it’s hard to watch’: Glenn Maxwell praises Suryakumar Yadav","link":"https://www.firstpost.com/firstcricket/sports-news/he-is-better-than-everyone-else-its-hard-to-watch-glenn-maxwell-praises-suryakumar-yadav-11683031.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"‘He is better than everyone else, it’s hard to watch’: Glenn Maxwell praises Suryakumar Yadav","content":"Australia all-rounder Glenn Maxwell showered praise on India’s latest batting sensation Suryakumar Yadav stating that he is better than everyone else.Suryakumar has taken the cricketing world by storm with the range of shots he has been playing and has shown his class every alternate game.The right-hander recently scored 111 off 51 deliveries in the second T20I against New Zealand and that surprised Maxwell.“I saw the scorecard from the first innings and I screenshot it and sent it to Finchy and said, ‘What is going on here? This bloke is batting on a different planet.’ Look at everyone else’s scores and look at this bloke that’s 111 off 50 (51),” Maxwell said on the Grade Cricketer Podcast.“So the next day, I watched the full replay on Kayo, watched the full innings. The embarrassing thing is he is so much better than everyone else. It’s actually hard to watch, it’s like ohh God, no one we have got is close to that.” View this post on Instagram A post shared by The Grade Cricketer (@thegradecricketer) Suryakumar has developed a reputation as a 360-degree player because of the shots he has been playing around the field. Maxwell believes that it is ridiculous and bizarre since he makes it look casual.“Suryakumar Yadav is doing in such a bizarre ungainly way where he’s hitting the middle of the bat by just like stepping across to someone who is bowling 145 from off the wicket on the other side and then just put his head down, walking down, chewing some gum, glove tap, bat tap, then off he goes and does it again.“He’s playing some of the most ridiculous shots I’ve ever seen and he’s doing it stupidly consistently. It’s actually hard to watch because he makes everyone else look so much worse for not being able to do that.”Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-23 12:07:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Suryakumar-Yadav-Maxwell.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"PSL 2023 drafting date: When and where will Pakistan Super League 2023 draft take place?","link":"https://thesportsrush.com/cricket-news-psl-2023-drafting-date-when-and-where-will-pakistan-super-league-2023-draft-take-place/","keywords":["Cricket","Pakistan Super League","PSL","PSL 2023 draft"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Pakistan Super League 2023 is set to take place next year, and the teams have submitted their retentions ahead of the tournament. A player’s draft will now take place soon and the teams will be able to finalize their squads for the upcoming PSL season. Lahore Qalandars won the PSL 2022 title by beating Multan… The post PSL 2023 drafting date: When and where will Pakistan Super League 2023 draft take place? appeared first on The SportsRush.","content":"Pakistan Super League 2023 is set to take place next year, and the teams have submitted their retentions ahead of the tournament. A player’s draft will now take place soon and the teams will be able to finalize their squads for the upcoming PSL season. Lahore Qalandars won the PSL 2022 title by beating Multan Sultans in the final of the tournament under the captaincy of Shaheen Afridi. Lahore’s Fakhar Zaman was the highest run-scorer of the tournament with 588 runs, whereas Shaheen Afridi was the highest wicket-taker with 20 wickets. It was certain that the Qalandars dominated the last season. In the draft, all six franchises will have a right-to-match card as well which will allow them to buy back one of their released players during the draft process. A team can have a maximum of 18 players on their roster. A total of 493 players have registered for the draft and some big names are set to take part in the tournament this year. PSL 2023 drafting date Pakistan Cricket Board have finally announced the date of the Pakistan Super League draft. The draft plays a very important part in shaping up the teams, and it will take place on December 15 in Karachi. The date has now been made official by the tournament organizers. The #HBLPSLDraft will be held on the 15th of December in Karachi. #HBLPSL8 pic.twitter.com/ph1PkS0zNd — PakistanSuperLeague (@thePSLt20) November 23, 2022 Ahead of the draft, the teams have already announced their retentions and some big trades have been made as well. Babar Azam will no more play for Karachi Kings, and he has been traded with Peshawar Zalmi. Karachi Kings got Shoaib Malik and Haider Ali in return for Babar. The defending champions Lahore Qalandars have retained their captain Afridi, whereas their star player Rashid Khan is also retained. Shadab Khan has been retained by Islamabad United in the platinum category, whereas Mohammad Nawaz and Mohammad Rizwan are platinum players of Quetta Gladiators and Islamabad United respectively.   The post PSL 2023 drafting date: When and where will Pakistan Super League 2023 draft take place? appeared first on The SportsRush.","pubDate":"2022-11-23 11:20:43","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"When Shane Warne was fined $5000 for giving captaincy to James Faulkner in BBL to avoid Ban","link":"https://thesportsrush.com/cricket-news-when-shane-warne-was-fined-5000-for-giving-captaincy-to-james-faulkner-in-bbl-to-avoid-ban/","keywords":["Cricket","Big Bash League","James Faulkner","Melbourne Stars","Shane Warne"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Australian legend Shane Warne achieved some big heights during his playing career, and he was surrounded by a lot of controversies as well. One such incident happened during the Big Bash League 2012-13 where he was fined $5000 for unfair means. The Australian legend passed away earlier this year which led the whole cricketing universe… The post When Shane Warne was fined $5000 for giving captaincy to James Faulkner in BBL to avoid Ban appeared first on The SportsRush.","content":"Australian legend Shane Warne achieved some big heights during his playing career, and he was surrounded by a lot of controversies as well. One such incident happened during the Big Bash League 2012-13 where he was fined $5000 for unfair means. The Australian legend passed away earlier this year which led the whole cricketing universe in shock. He died of a suspected heart attack in Thailand. Warne was the first bowler to achieve the mark of 700 test wickets, and he was one of the two bowlers to take 1000 international wickets. Warne was also the first captain to win the IPL trophy when he led Rajasthan Royals to the win in the 2008 season. In an interesting story, it was said that Warne once threatened the Royals that he can leave the side even before the competition started. When Shane Warne was fined $5000 for giving captaincy to James Faulkner Shane Warne is often surrounded by controversies, and one such event happened during the semi-final of BBL 2012-13. Warne was the captain of the Melbourne Stars, whereas Cameron White was the vice-captain. Both Warne and White were playing the match, but the Stars surprised everyone by handing the captaincy to James Faulkner in the semi-final. The move was made to save Warne from a potential ban due to slow over rate, he was punished for the same once in the tournament for the same and one more strike would have banned him to play in the final of the tournament. The same was the case with White as well, and that’s why Faulkner was made the captain. ALSO READ: When Rajasthan Royals paid $657,000 and 0.75% ownership to Shane Warne However, this thing came under unfair rules, and Warne was fined $5000 for the same. Later, Warne said that he was not aware of that rule, or he would have informed the management about the same. “Just got feedback that I was fined $5000 for spirit of cricket,” Warne said. “Clarification – I had no idea about the rule/law… If I was aware of the law/rule I would have tossed the coin, to me I should have been informed and made aware by management!” Melbourne Stars lost the semi-final against Perth Scorchers by 8 wickets against the Scorchers on the DLS method. The Stars scored 183/2 in 18 overs, and the Scorchers scored 142/2 in 13 overs to register a win. The post When Shane Warne was fined $5000 for giving captaincy to James Faulkner in BBL to avoid Ban appeared first on The SportsRush.","pubDate":"2022-11-23 10:12:11","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"ICC ODI Rankings: Suryakumar continues to stay at top, Hardik 50th among batters","link":"https://www.orissapost.com/icc-odi-rankings-suryakumar-continues-to-stay-at-top-hardik-50th-among-batters/","keywords":["Sports","ICC ODI Rankings","suryakumar yadav"],"creator":["Post News Network"],"video_url":null,"description":"Dubai: Star India batter Suryakumar Yadav retained his top spot while all-rounder Hardik Pandya reached joint-50th position in the latest ICC men’s T20I batting rankings released here Wednesday. Suryakumar consolidated his position at the top of the rankings after his stupendous 111 not out in the second T20I against New Zealand. Suryakumar has gained 31 […]","content":"ICC ODI Rankings: Suryakumar continues to stay at top, Hardik 50th among batters PTI Updated: November 23rd, 2022, 15:32 IST in Sports 0 Pic- BCCI Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Dubai: Star India batter Suryakumar Yadav retained his top spot while all-rounder Hardik Pandya reached joint-50th position in the latest ICC men’s T20I batting rankings released here Wednesday. Suryakumar consolidated his position at the top of the rankings after his stupendous 111 not out in the second T20I against New Zealand. Suryakumar has gained 31 rating points from the series and his 890 points keep him 54 ahead of Pakistan’s Mohammed Rizwan, who is placed second. On the other hand, Hardik, who led India in the series against New Zealand, reached joint-50th among batters courtesy his unbeaten 30 in the final match. In the bowlers’ chart, seasoned pacer Bhuvneshwar Kumar has climbed two places to 11th, with left-arm seamer Arshdeep Singh moving up a place to 21st. Spinner Yuzvendra Chahal has jumped eight places to 40th. The talismanic Virat Kohli has climbed up to the sixth spot in the ODI rankings while skipper Rohit Sharma continued his stay at number eight. The injured Jasprit Bumrah, who is 11th, is the top-ranked Indian in the bowlers’ list . Australia openers David Warner and Travis Head have made notable gains in ODI player rankings after an epic 269-run partnership at the Melbourne Cricket Ground (MCG) while Steve Smith’s consistence performances in the home series against England has helped him attain a career-best equalling seventh position. Warner, a formerly top-ranked batter, has gained one spot to reach fifth position in the list after a score of 106 in the final match that helped him finish with 240 runs and win the Player of the Series award. Head, who accumulated 208 runs after his Player of the Match effort of 152 at the MCG, has progressed 12 spots to reach 30th position. Smith finished third in the list of run-scorers, his 195 runs good enough to lift him three places to seventh place, a position he had held in January 2017. Marnus Labuschagne and Mitchell Marsh too have moved up the list and occupy 68th and 84th positions, respectively. Fast bowler Mitchell Starc, who was named Player of the Match for a haul of four for 47 in the second ODI in Sydney, has moved up four places to take fourth position while leg-spinner Adam Zampa (up eight places to seventh) and Pat Cummins (up one place to 17th) have also moved up the bowlers’ rankings. For England, Phil Salt and Dawid Malan have entered the top 100. Salt has progressed six slots to reach 97th position while Malan has advanced 56 places and is ranked 100th. Tags: ICC ODI Rankings suryakumar yadav Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Senegal’s Kouyate to miss World Cup game against Qatar November 23, 2022 Cristiano Ronaldo out to impress in Portugal’s first game at World Cup November 23, 2022 SC to hear plea related to All India Football Federation Dec 6 November 23, 2022 Jadeja unlikely to get fit for Bangladesh Tests, will new committee induct Surya as extra batter? November 23, 2022 World Cup stunner: Saudi Arabia beats Messi’s Argentina 2-1 November 22, 2022 Rain-hit 3rd T20I against New Zealand ends in tie, India wins series 1-0 November 22, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-11-23 10:02:33","image_url":"https://www.orissapost.com/wp-content/uploads/2022/11/Suryakumar-Yadav--300x230.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Langer unloads on ‘coward’ Aussie’s","link":"https://www.themercury.com.au/sport/cricket/langer-unloads-on-coward-aussies/video/bbf6538010456ae61c9421012d90c4d5","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Ex Australian cricket coach Justin Langer has told his story throughout coaching the national team over an eventful four year period.","content":"Cricket: Ex Australian cricket coach Justin Langer has told his story throughout coaching the national team over an eventful four year period.","pubDate":"2022-11-23 09:27:23","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"'Always try to learn from the experiece of senior players', Arshdeep Singh on his 4 wicket spell against New Zealand","link":"https://www.dnaindia.com/cricket/report-always-try-to-learn-from-the-experiece-of-senior-players-arshdeep-singh-on-his-4-wicket-spell-3004818","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Arshdeep Singh picked his best-ever figures in T20I cricket with 4/37 in four overs in the third and final T20I against New Zealand.","content":"The steady rise of India's young left-arm pacer Arshdeep Singh continued as he picked his best-ever figures in T20I cricket with 4/37 in four overs in the third and final T20I against New Zealand at McLean Park in Napier. READ: French defender Lucas Hernandez ruled out of FIFA World Cup after getting injured during match against Australia While Mohammed Siraj rattled New Zealand batters with his hard lengths, Arshdeep was bringing out all the tools he had in his armoury to outclass the hosts' batting line-up. He took out Daryl Mitchell with a potent bouncer and then dismissed Ish Sodhi for a first-ball duck with a pin-point yorker. Apart from this, Arshdeep had taken out openers Finn Allen and Devon Conway too. He also showed his ability to bowl the knuckle-ball too. He credited senior pacers in the Indian team for helping him with adding more variety to his bowling skills. \"It`s all from the guidance from the experienced players in the team. I constantly try to learn from them. I try to learn hard-length deliveries from you (Siraj). I am learning knuckleball from Bhuvi (Bhuvneshwar Kumar) bhai.\" \"Earlier I learned how to use yorkers from (Mohammed) Shami bhai. I try to improve myself and hope to step-up and perform well when the team requires you to stop runs or get a wicket,\" said Arshdeep in a chat with Mohammed Siraj in a video posted on BCCI.TV. READ: New Zealand cricket releases Martin Guptill from its central contract Arshdeep was also on the verge of a hat-trick, but Siraj made it a team hat-trick by running out Adam Milne with a direct-hit from backward point. \"I even had a thought that I can take a hattrick or a five-wicket haul. But you did make a run-out and gave a team hattrick. The seniors advised me to bowl length and slower balls to deceive the opponent,\" he added. Arshdeep has been the find for India in T20Is this year, stepping up admirably in Jasprit Bumrah`s absence to pick ten wickets in the Men`s T20 World Cup in Australia. Since his T20I debut against England in July this year, he has picked 33 wickets in 21 matches at an average of 18.12 and economy rate of 8.17. \"I am learning and will try to implement it in the future. All is well that ends well. The team has got a series win and I am happy to witness your bowling and will try to do well in the future,\" he concluded.","pubDate":"2022-11-23 09:26:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Seasoned racer Sandeep Kumar all praise for Hyderabad Street Circuit after FIA-accredited venue hosts JKNRC 2022 Round 3","link":"https://www.firstpost.com/sports/seasoned-racer-sandeep-kumar-all-praise-for-hyderabad-street-circuit-after-fia-accredited-venue-hosts-jknrc-2022-round-3-11677131.html","keywords":["Sports"],"creator":["Amit Banerjee"],"video_url":null,"description":"Seasoned racer Sandeep Kumar all praise for Hyderabad Street Circuit after FIA-accredited venue hosts JKNRC 2022 Round 3","content":"Sports Seasoned racer Sandeep Kumar all praise for Hyderabad Street Circuit after FIA-accredited venue hosts JKNRC 2022 Round 3 Sandeep, racing for the Dark Don team at the JK Tyre FMSCI National Racing Championship, was among the first to get a taste of what the Hyderabad Street Circuit, which will host India's first-ever Formula E event, has to offer. Amit Banerjee November 23, 2022 14:33:57 IST File image of seasoned Indian racer Sandeep Kumar. Image credit: FMSCI Hyderabad witnessed a new chapter unfold in Indian motorsport with its brand new street circuit being put to use for the first time over the weekend. The Telangana capital hosted the third round of the JK Tyre FMSCI National Racing Championship LGB Formula 4 event on Sunday with the practice and qualifying rounds for the same taking place on the preceding day at the FIA-accredited Hyderabad Street Circuit. Fans in the city not only got to witness the riveting action that the premier motorsport event had to offer in its silver jubilee edition, but they also got a taste of what they can expect a little under three months from now with the first-ever Formula E race in the country set to take place at the very same venue. And besides fans, the racers participating in the JKNRC too have been left impressed. Among them is seasoned LGB Formula 4 driver Sandeep Kumar, part of the Dark Don Racing Team participating in the championship. “It’s a phenomenal job and the task as such is colossal. The time when the place was handed over to organisers and what they’ve pulled out in a matter of a few days, big, big shout out to whole team who’s put this whole show together. “And of course this is one of the top-spec street circuits we have here in India. I think once it (street circuit) has happened in the past in Pune where I was a kid and I was driving go-karts. A full-fledged Formula or a touring car kind of speced circuit is really, really a big step forward in Indian motorsport. “The track as such is very technical. You have long, fast straights, few technical corners, few fast chicanes, it’s a mix of everything at the back. It’s very, very important to have something like that in the country and it’s a great step forward for Indian motorsport,” said the 30-year-old, who had won the championship in 2020. Building a track such as this, however, is by no means an easy feat. Unlike the Buddh International Circuit, which was built on the outskirts of Greater Noida at a fair distance from New Delhi, the Hyderabad Street Circuit had been constructed in the heart of the city, on the NTR Marg between the Hussain Sagar Lake and the NTR Gardens, next to the iconic PV Narasimha Rao Marg, aka the Necklace Road. And with important roads getting closed due to the race, traffic snarls occurred even during the non-rush hours over the weekend, which then became a talking point for residents of the ‘City of Pearls’. Sandeep, however, chose to look at the bigger picture, which is that of the contribution that the street circuit could have towards Indian motorsport with the high-profile events that it is set to host in the near future. “As such motorsport is not the sport of the nation. It’s like going and playing cricket or kabaddi in Spain (chuckles). So, let’s be practical about it. But what they’ve done as a team together to put this whole show together is incredibly phenomenal and this as such is going to raise a lot of awareness among people with regards to what motorsport is and to put things to perspective that this is also a sport and this is also something that people also pursue as a career. So I think this is a big step towards creating awareness in the space of Indian motorsport,” Sandeep said. The third round of the 25th edition of the JK Tyre National Racing Championship took place simultaneously alongside the inaugural edition of the Indian Racing League — a franchised-based event featuring five city-based teams that essentially is a reboot of the X1 Racing League that took place in 2019. However, while the first round of the Indian Racing League had to be called off owing to logistical and technical issues, the JKNRC ensured fans got to witness thrilling action at the venue with all three races of Round 3 taking place on Sunday. MSport’s Raghul Rangaswamy led the way, winning the first two races with timings of 13.08.789 and 24.53.474 respectively and finishing second in the third race of the round with a timing of 19.32.429. Ahura Racing also zoomed ahead in the championship ladder with Vishwas Vijayaraj and Diljith TS finishing second and third in the opening race. Vishwas would then go on to win Race 3, beating Raghul by a fraction of a second to prevent him from completing a hat-trick. The first two editions of the JKNRC — which also features events such as the Novice Cup and the Royal Enfield Continental GT Cup besides the LGB Formula 4 race — took place at the Kari Motor Speedway in Coimbatore before the action moved north to Hyderabad for the third round. The caravan then returns to Coimbatore for the fourth and final round in December. Round 3 Provisional Race Results: LGB Formula 4 (Race 1) Raghul Rangasamy (MSport) – 13.08.789 Viswas Vijayaraj (Ahura Racing) – 13.11.769 Diljith TS (Ahura Racing) – 13.14.242 LGB Formula 4 (Race 2) Raghul Rangasamy (MSport) – 24.53.474 Saran Vikram Tmars (Mars Racing) – 24.54.716 Ashwin Datta (Dark Don racing) – 24.55.691 LGB Formula 4 (Race 3) Vishwas VIjayaraj (Ahura Racing) – 19:31.807 Raghul Rangasamy (MSPort) – 19: 32. 429 Arya Singh (Dark Don Racing) – 19:38.785 Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 23, 2022 14:33:57 IST TAGS: Jk Tyre-fmsci National Racing Championship Motorsport National Racing Championship","pubDate":"2022-11-23 09:03:57","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Sandeep-Kumar-FMSCI-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Suryakumar Yadav continues to stay at top in latest ICC men’s T20 batting ranking","link":"https://www.tribuneindia.com/news/sports/suryakumar-yadav-continues-to-stay-at-top-in-latest-icc-mens-t20-batting-ranking-453910","keywords":null,"creator":null,"video_url":null,"description":"Dubai, November 23 Star India batter Suryakumar Yadav retained his top spot while all-rounder Hardik Pandya reached joint-50th position in the latest ICC men's T20I batting rankings released here on Wednesday. Suryakumar consolidated his position at the top of the rankings after his stupendous 111 not out in the second T20I against New Zealand. Suryakumar has gained 31 rating points from the series and his 890 points keep him 54 ahead of Pakistan's Mohammed Rizwan, who is placed second. On the other hand, Hardik, who led India in the series against New Zealand, reached joint-50th among batters courtesy his unbeaten 30 in the final match. In the bowlers' chart, seasoned pacer Bhuvneshwar Kumar has climbed two places to 11th, with left-arm seamer Arshdeep Singh moving up a place to 21st. Spinner Yuzvendra Chahal has jumped eight places to 40th. The talismanic Virat Kohli has climbed up to the sixth spot in the ODI rankings while skipper Rohit Sharma continued his stay at number eight. The injured Jasprit Bumrah, who is 11th, is the top-ranked Indian in the bowlers' list. Australia openers David Warner and Travis Head have made notable gains in ODI player rankings after an epic 269-run partnership at the Melbourne Cricket Ground while Steve Smith's consistence performances in the home series against England have helped him attain a career-best equalling seventh position. Warner, a formerly top-ranked batter, has gained one spot to reach fifth position in the list after a score of 106 in the final match that helped him finish with 240 runs and win the Player of the Series award. Head, who accumulated 208 runs after his Player of the Match effort of 152 at the MCG, has progressed 12 spots to reach the 30th position. Smith finished third in the list of run-scorers, his 195 runs good enough to lift him three places to seventh, a position he had held in January 2017. Marnus Labuschagne and Mitchell Marsh, too, have moved up the list and occupy 68th and 84th positions, respectively. Fast bowler Mitchell Starc, who was named Player of the Match for a haul of four for 47 in the second ODI in Sydney, has moved up four places to take fourth position while leg-spinner Adam Zampa (up eight places to seventh) and Pat Cummins (up one place to 17th) have also moved up the bowlers' rankings. For England, Phil Salt and Dawid Malan have entered the top 100. Salt has progressed six slots to reach 97th position while Malan has advanced 56 places and is ranked 100th.","content":null,"pubDate":"2022-11-23 08:41:25","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_740699166.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"‘An example of how not to do it’: Devil’s bargain behind record low cricket crowds","link":"https://www.watoday.com.au/sport/cricket/an-example-of-how-not-to-do-it-devil-s-bargain-behind-record-low-cricket-crowds-20221123-p5c0nm.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"A meaningless series between Australia and England, including a record-low MCG crowd, offered a chilling preview of cricket’s landscape over the next four years.","content":null,"pubDate":"2022-11-23 08:40:00","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ross Taylor returns to NZ domestic cricket to represent Central Districts","link":"https://thenewsmill.com/2022/11/ross-taylor-returns-to-nz-domestic-cricket-to-represent-central-districts/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Former New Zealand batter Ross Taylor is set to return to his country’s domestic scene to represent Central Districts in their first one-day match of the season in Ford Trophy. As per ESPNCricinfo, Taylor, who had retired from international cricket earlier this year, is still available to play at the domestic level and is among 13 players selected to play CD’s opening match against Otago. This will be the batter’s 20th season for CD, the team to which he has stayed loyal throughout his career. In last season, he topped his side’s batting charts with 279 runs at an average of 55.80 and a strike rate of 137.43, which included two fifties and a 49-ball ton against Wellington. “It was good to make the final last year, but hopefully we will go one better this year,” Taylor said as quoted by ESPNCricinfo. “I have not played for CD for a while after the BLACKCAPS retirement, so it is nice to be back playing cricket in New Zealand again, and with a lot of team-mates whom I have played a lot of cricket with.” “One-day cricket was probably my best format in international cricket, so it is nice to be playing some white ball and Ford Trophy. I am really looking forward to it,” concluded Taylor. He has been training with CD in recent weeks after returning from India, where he participated in two tournaments featuring retired international players- Road Safety World Series and Legends League Cricket in September and October. Will Young will be leading CD for the six rounds of the trophy to give regular captain Tom Bruce a break. Bruce will take over the reins for the Super Smash competition, the domestic T20 competition and the remainder of the Ford Trophy. Central Districts squad: Will Young (capt), Doug Bracewell, Tom Bruce, Josh Clarkson, Dane Cleaver (wk), Jayden Lennox, Ajaz Patel, Brett Randell, Seth Rance, Brad Schmulian, Ross Taylor, Blair Tickner, Ray Toole. (ANI) ALSO READ: England to receive $US 1.6 million following their T20 World Cup win This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2022-11-23 08:31:18","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"Joe Root IPL 2023: Has Root ever played in the IPL?","link":"https://thesportsrush.com/cricket-news-joe-root-ipl-2023-has-root-ever-played-in-the-ipl/","keywords":["Cricket","IPL 2023","Joe Root"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"England’s Joe Root has to be one of the best players to ever play the game. He has proved his class in the test and ODI formats of the match, but he certainly has not made his mark in the T20 format of the game. Root played his last T20I for England in 219, which… The post Joe Root IPL 2023: Has Root ever played in the IPL? appeared first on The SportsRush.","content":"England’s Joe Root has to be one of the best players to ever play the game. He has proved his class in the test and ODI formats of the match, but he certainly has not made his mark in the T20 format of the game. Root played his last T20I for England in 219, which speaks a lot. Root resigned as the test captain of the English side earlier this year, and now he wants to focus on the T20 format as well. He has stayed away from this format in order to focus on his red-ball game. Root represented Sydney Thunder in the BBL during 2018-19, which was his last overseas T20 league appearance. Having scored 10504 test and 6207 ODI runs, Root is one of the greatest batters in England. He has scored 2083 T20 runs as well with the help of 13 half-centuries, which proves that he is naive to the shortest format either. Root is currently in Abu Dhabi to prepare for the test series in Pakistan. Joe Root IPL 2023 England’s Joe Root has given his name in the IPL 2023 auction, and he will be one of the top names to go under the hammer in Kochi next month. Root has constantly prioritized test cricket, and that’s why he used to skip the auctions, but this time he will be officially entering the auction pool. Root gave his name in the IPL 2018 mega auction, but he went unsold. It will be for the first time since 2018 that Root will be featuring in an IPL auction. He has not played for any IPL team in his career. In 2018, Sourav Ganguly praised Root’s performance and also tagged Delhi Capitals’ owner Parth Jindal, which ignited a lot of news that the Delhi franchise may sign Root, but it never happened. What a performance from joe root and england on that surface ..one of the best test hundreds one will see on a pitch which is turning square .. @root66 @ParthJindal11 @ECB_cricket — Sourav Ganguly (@SGanguly99) November 16, 2018 Root recently gave an interview to the Mail where he said that he is not considering retirement from any format of the game and insists that he wants to play more in the T20 format in the next couple of years as he has rested quite a lot from this format. “The next couple of years, might be a good time to explore playing a little bit more of that format and see how far I can take that side of my game,” Joe Root said to the Mail.   The post Joe Root IPL 2023: Has Root ever played in the IPL? appeared first on The SportsRush.","pubDate":"2022-11-23 07:54:11","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Virat Kohli shows support for Kevin Pietersen’s statement on Ronaldo's Manchester United row","link":"https://www.firstpost.com/firstcricket/sports-news/virat-kohli-shows-support-for-kevin-pietersens-statement-on-ronaldos-manchester-united-row-11679981.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Virat Kohli shows support for Kevin Pietersen’s statement on Ronaldo's Manchester United row","content":"The relationship between Cristiano Ronaldo and Manchester United is over after it became quite bitter since the Red Devils manager Erik Ten Hag sidelined the iconic striker for the Premier League match against Chelsea. Ronaldo then lashed out at Ten Hag during a bombshell interview with popular British broadcaster Piers Morgan. Additionally, he criticised the Glazer family, his former United teammate Wayne Rooney, and defender Garry Neville.The five-time Ballon d’Or winner slammed Manchester United executives for lacking compassion when he failed to arrive on time for the preseason training session due to his daughter’s illness. Since the news broke out, it gave rise to several questions regarding the internal scenario of the club.Read: Where next for ‘betrayed’ Cristiano Ronaldo after Manchester United exit?The former England cricketer Kevin Pietersen has now come out in support of Ronaldo during an interview with Piers Morgan on TalkTv. A clip of the conversation has been shared by the cricketer himself on his personal social media handles. Among the people who liked Pietersen’s show of support for Ronaldo was Indian star cricketer Virat Kohli.Kohli is known to be a huge supporter of Ronaldo. This time, he hit the ‘like’ button on Pietersen’s statement, showing his support for the Portugal captain. View this post on Instagram A post shared by Kevin Pietersen 🦏 MBE (@kevinpietersen) Pietersen stated in the interview, “If what he said is true about them not believing what’s been happening with this family, I can’t say whether it’s true or not, he says it is true, that’s almost unforgivable. He is a human at the end of the day, yes he’s super famous, yes he’s worth hundreds of millions of dollars, he’s achieved it because he’s amazing at what he does.”On Tuesday, Manchester United announced the departure of Ronaldo from the team. Taking to their official Twitter handle, the club revealed that the striker would leave Old Trafford for the second time. However, they also mentioned the agreement was mutual.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-23 07:53:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Virat-Kohli-Ronaldo.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022: Why are football players regularly spotted spitting on pitch?","link":"https://www.firstpost.com/explainers/fifa-world-cup-2022-football-players-spitting-carb-rinsing-11679991.html","keywords":["Explainers"],"creator":["FP Explainers"],"video_url":null,"description":"FIFA World Cup 2022: Why are football players regularly spotted spitting on pitch?","content":"We are four days into FIFA World Cup 2022 and there’s already big news emerging from the mega event. From Saudi Arabia’s shock win over Argentina to Iranian players keeping mum during the national anthem, football has been making all the news.Amid all the drama emerging from Qatar, the one constant visual that football fans are seeing is players spitting on the field while at play. But why do players do it? What purpose does spitting actually serve? How come footballers do it so often, and not other types of athletes?FIFA World Cup: Fixtures | Results | Points Table | Squads | RecordsWe take a closer look at the situation and give you all the answers you were looking for.Science behind spitting in footballSpitting is a common practice in football. It turns out that there’s some science and performance-building factor behind it and not just players showing their distaste for a situation.Studies have shown that exercise increases the amount of protein secreted into the saliva, especially a kind of mucus called MUC5B. This makes the saliva thicker, making it harder to swallow. Hence, there are so many visuals of footballers spitting out, even though it appears distasteful.Dr Udit Kapoor, senior consultant, Asian Hospital, Faridabad was quoted as telling Indian Express that the saliva in the mouth thickens during physically strenuous activities like football matches, which players consider better to spit out. “The thicker saliva makes it harder to swallow. So, it is best to spit it out,” he was quoted as saying.He added that it’s not just footballers who spit, and even cricketers, and rugby players spit — it’s considered legal in the sport.Also read: Why Qatar is a controversial host for the 2022 World Cup tournamentEchoing similar thoughts is Joseph Dosu, a former goalie for Nigeria. He has been quoted as saying that footballers spit because “they need something to clear their throat… they make a run of maybe 10 to 15 yards and they need air to breathe”.There are a few other theories about spitting being a regular occurrence in football. Some say that it’s a case of OCD behaviour, while others believe that it could be a display of masculinity designed to intimidate.Carb-rinsingSince the start of the World Cup there have also been visuals of players such as England’s Harry Kane forcefully spraying a drink into his and then spitting the entire mouthful over the nearest patch of bare earth.However, there’s an explanation to this activity, called carb-rinsing. The basic premise of carb-rising is filling your mouth with a carb-filled liquid, in this instance a sugar and salt-heavy sports drink, activates pleasure and sense receptors in your brain that make it think extra energy in the form of food is on the way. This, in theory, stops your brain from thinking the body is fatigued.Asker Jeukendrup, an exercise physiologist and sports nutritionist, had told The New York Times previously that the practice is similar to tricking the brain a “little bit”. In fact, in a study he conducted with the University of Birmingham in 2004, he found that that carb-rinsing made cyclists about a minute faster in 40-kilometer cycling time trials.The benefits of carb-rinsing have been espoused by others in the field too. Dr Sourav Poddar, a sports-medicine physician has also been quoted as saying that carb rinsing can boost one’s performance by two to three per cent.Another study published in the European Journal of Sport Science in 2017 had also found that carb-rinsing boosted performance. The study researched 12 healthy men in their 20s and found that they could jump higher, do more bench presses and squats, sprint faster, and were more alert after carb-rinsing.Similarly, a study published in the International Journal of Sports Nutrition and Exercise Metabolism found that 12 competitive male athletes experienced less fatigue after carb rinsing.Why only football though?Spitting in football is not illegal at the World Cup. However, spitting at someone is a red-card offence.In other sports such as cricket and rugby too, spitting is not considered illegal. However, there are many who argue that it’s only footballers who are seen spit during matches.There’s an explanation for this too: Many sports enthusiasts have said that perhaps cricketers are not seen spitting on television because the players are spread so thinly over the ground and there is so much “non-active” time that it is statistically improbable that a spitting player would be caught on television.Moreover, football players are seeing spitting on screen owing to the style of coverage, —highlighting with a close-up the player who has just made a long sprint to score a goal.When spitting became the biggest news Over the years, footballers spitting at their opponents during a World Cup match have grabbed headlines.Undoubtedly the most famous spitting incident in football came during a World Cup match between Germany and the Netherlands during the 1990 Italy World Cup. Dutch player Frank Rijkaard aimed his spit at Germany’s Rudi Voller after a crunching tackle.Arsenal’s Patrick Vieira found himself in hot water in 1999 for his spitting incident. He was handed down a six-match ban and a £30,000 fine for spitting at West Ham’s Neil ‘Razor’ Ruddock.Even the game’s great, Cristiano Ronaldo was seen spitting at Derby’s Robbie Savage during a 2009 FA Cup match.Argentina’s Lionel Messi has also been held guilty of the offence. Back in 2008, he was spotted aiming spit at the back of the jersey of Malaga winger Duda.With inputs from agenciesRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-23 07:39:50","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/spit1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"The missing man who could have stopped Langer’s war with players","link":"https://www.themercury.com.au/sport/cricket/uncivil-war-is-shredding-the-reputation-of-australias-test-team/news-story/32940549d599d89b5471edeca7210bcf","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Usman Khawaja vanished from Test cricket just when Australia needed him most.","content":"Not his batting. His voice.Khawaja would have been the only player capable of short-circuiting the vicious feud between Australian coach Justin Langer and his players which has reached volcanic levels after Langer’s interview with CODE Sports where he calls out dressing room “cowards’’ who allegedly backstabbed him.In The Test documentary which featured the 2019 Ashes tour, straight-taking Khawaja spoke up at a team meeting telling Langer players were “walking on eggshells’’ around him.Not long after that Khawaja straightened up the argument in the other direction when he strongly criticised the players for bagging Langer behind his back. Sadly, before his current resurgence, Khawaja drifted out of the Test team for two years in a period where Australia desperately needed a strong voice brave enough to call out faults on both sides of a complex argument. No-one in Cricket Australia has come close to doing so as Langer’s career went the same way as so many coaches who were raised in a flint hard era and struggled to adjust to a softer one when they took up the clipboard.Both Langer and the players must take their share of the blame for the fallout, the players for being too timid about their grievances and Langer for not reading the signs that he was falling out of favour.Langer does not believe he lost the dressing room. That may be the truth as he sees it but it is not the reality of the situation.Losing a dressing room does not mean losing all 11 players. Marnus Labuschagne, for example, has no published objection to Langer and occasionally speaks up for him.But Langer still lost the room. Maybe not everyone but many of them and certainly most of the bowlers.SCBBL PROMOThis is significant because, unlike other eras when batsmen were kings and bowlers the workhorses of cricket, the bowlers are the powerbrokers in the Australian side and generally get what they want.Langer felt his honestly was mistaken for intensity but the coach’s intensity was never an issue with the players. Volatility was the word.Players found the ups and downs unsettling. The demise of Langer only strengthens the theory that cricket coaches who go the long journey after normally the po faced likes of Trevor Bayliss and John Buchanan who keep their most extreme emotions well hidden. The team and Langer are also at odds about several essential threads of the narrative.Langer insists he had never enjoyed coaching more than in his final season last summer when Australia won the T20 World Cup and the Ashes.The players privately insist that by that stage he was under orders to take a back seat and then assistant and now head coach Andrew McDonald was running the show.The players will feel they have the stronger side of the argument in pushing for Langer’s exit – and they probably have – but that doesn’t mean they will win the debate.Far from it. Of the first 130 comments made on News Corp websites below the story of Langer’s outburst about 90 per cent of them are criticising the team rather than Langer.Some of the arguments about “Woke Warriors’’ are left field not directly relevant but it’s a worrying sign that the popularity of the team is under siege.","pubDate":"2022-11-23 07:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"}]}