{"newsArray":[{"title":"How Mac Point stadium could become Tassie’s ‘cathedral’","link":"https://www.themercury.com.au/news/tasmania/a-macquarie-point-multipurpose-covered-stadium-could-become-tasmanias-cathedral/news-story/878794b0e9b878163bd91e8128fe79d6","keywords":["AFL","Tasmania News and Galleries"],"creator":null,"video_url":null,"description":"A MULTIPURPOSE stadium at Macquarie Point could become Tasmania’s sport and cultural “cathedral” and new Stadiums Tasmania chairman Michael Malouf says the whole of Australia is barracking for Tasmania to get an AFL licence.","content":"In Hobart only a day after his appointment to head Stadiums Tasmania’s new board, Mr Malouf was buoyant about the state’s bid for a 19th licence, with the AFL still holding back on an announcement. As a former chief executive officer of the City of Geelong, CEO of Carlton Football Club and chief executive officer of City of Melbourne Council, Mr Malouf is in no doubt what an AFL team could do for the state.“Getting an AFL licence and an AFLW licence will be historic and the whole of Australia is barracking for Tasmania to get that licence,” Mr Malouf said.“But once you get the licence, to have a world-class stadium to host that team and a stadium that is modern and multipurpose with a precinct for arts, culture, entertainment, and that’s outward-looking, linking back to the city, that will be transformational.”Mr Malouf has seen what modern venues can do for other cities like Geelong, Adelaide and Perth.“That is 100 per cent transferable to Hobart,” he said.“At the moment you don’t have an AFL licence. But when you do get an AFL licence and leverage that with a new stadium, that will have a huge economic, social and environmental impact on the economy.“You won’t know yourselves down here.”Geelong is Mr Malouf’s favourite example of a football stadium being an economic and social showpiece for a city.“Having an AFL team in the middle of Geelong at a multi-use precinct, with netball, swimming, cricket – it’s just the centre of the town, almost a cathedral,” Mr Malouf said.“The state government, federal government, the footy club and the AFL contributed to building a stadium that recently hosted the Foo Fighters, will host the closing ceremony of the Commonwealth Games, World Cup cricket, the Matildas, the Renegades [BBL] and a whole range of other activities that will really solidify the Geelong economy and the community is so much better off for having it.”Stadiums Tasmania’s charter is to look after five Tasmanian venues – Blundstone Arena, MyState Bank Arena, UTAS Stadium, the Silverdome and Dial Park in Penguin.“Everybody has done a really good job in getting them to a really good condition,” Mr Malouf said. “The purpose of Stadiums Tasmania is to take them to another level and gain maximum potential out of all of those stadiums to attract national and international events. “The government’s view is to maximise the potential of all those stadiums for the economic and social wellbeing of the state.”james.bresnehan@news.com.au","pubDate":"2022-12-02 23:52:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Henriquez falls just shy of a century","link":"https://www.couriermail.com.au/sport/cricket/henriquez-falls-just-shy-of-a-century/video/890d0233f264fb7ca862ab86058b55bc","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Moises Henriques fell just short of a century in the Sheffield Shield, with 97 runs for NSW.","content":"Cricket: Moises Henriques fell just short of a century in the Sheffield Shield, with 97 runs for NSW.","pubDate":"2022-12-02 23:00:18","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"After 14 years, Saurashtra won the title of champions – Unadgad","link":"https://thenewsglory.com/after-14-years-saurashtra-won-the-title-of-champions-unadgad/","keywords":["Sports","Jayadev Unathkat","Jaydev Unadkat","Saurashtra","Vijay Hazare Trophy"],"creator":["The News Glory"],"video_url":null,"description":"Ahmedabad: Saurashtra team has won the final of the Vijay Hazare Cup series and won the champion title. The Jaidev Unathkat led team won against Maharashtra by 5 wickets. After about 14 years, the team has won the championship title in this series. The final was played at the Narendra Modi Cricket Stadium in Ahmedabad. […]","content":"Ahmedabad : Saurashtra team has won the final of the Vijay Hazare Cup series and won the champion title. The Jaidev Unathkat led team won against Maharashtra by 5 wickets. After about 14 years, the team has won the championship title in this series. The final was played at the Narendra Modi Cricket Stadium in Ahmedabad. Saurashtra won the toss and chose to bowl. Batting first, Maharashtra scored 248 runs for the loss of 9 wickets in 50 overs. The captain of that team, Ruduraj Gaikwad, had a hundred. Saurashtra chased down the target of 249 runs. The team’s opener, Sheldon Jackson, scored 133 runs off 136 balls without losing a wicket till the end. The team’s openers put on a partnership of 125 runs. Saurashtra won by scoring 249 runs for the loss of 5 wickets in 46.3 overs. This time the Saurashtra team was led by Jayadev Unathkat. Jayadev Unathgat has made Saurashtra’s trophy dream come true after 14 years after passing the tests of expulsion from the Indian team and expulsion from the Mumbai Indians. Despite a series of omissions, Unadgat was given the responsibility to lead the Saurashtra team in 2021 after their defeat in the 2017 Vijay Hazare Trophy series. Accordingly, the Saurashtra team, who have performed well this year, faced a strong Karnataka team in the semi-finals. Unathkat bowled brilliantly in that match and took 4 wickets to lead the team to the final. Now after 14 years, he has won the trophy. After winning the final, Unadgad sat down on his knees on the field and was stunned for a while. These photos are now going viral.","pubDate":"2022-12-02 22:55:13","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan fight back against England","link":"https://www.themercury.com.au/sport/cricket/pakistan-fight-back-against-england/video/e2cacc5961d1d7457ecbe458902301b6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Pakistan have recovered from the early English onslaught in their test match, but still face a mammoth task.","content":"Cricket: Pakistan have recovered from the early English onslaught in their test match, but still face a mammoth task.","pubDate":"2022-12-02 22:45:20","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"After Syed Mushtaq Ali T20, BCCI set to introduce ‘impact player’ rule in IPL","link":"https://kashmirreader.com/2022/12/03/after-syed-mushtaq-ali-t20-bcci-set-to-introduce-impact-player-rule-in-ipl/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: In its bid to provide tactical flexibility to the teams, the BCCI is all set to introduce the ‘impact player’ system in the upcoming edition of IPL where the captains will be able to replace one playing-XI member with a substitute player during the match. BCCI had put the system on trial during […]","content":"New Delhi: In its bid to provide tactical flexibility to the teams, the BCCI is all set to introduce the ‘impact player’ system in the upcoming edition of IPL where the captains will be able to replace one playing-XI member with a substitute player during the match. BCCI had put the system on trial during the Syed Mushtaq Ali T20 tournament in October and the move was largely welcomed by the state teams. According to sources privy to development, the matter was discussed at the IPL Governing Council on Thursday evening. The franchises have already been sent a note with regards to introduction of tactical substitution. “The matter has been discussed at the IPL GC meeting and BCCI will share the details soon,” an IPL franchise source told PTI on conditions of anonymity. While the exact details are awaited, the playing regulations, followed during the Syed Mushtaq Ali Trophy, would be adopted. According to the ‘impact player’, a team can have four pre-decided substitute players who can be pencilled as “tactical substitutions” and one of them can be used in a match situation. However any such substitute has to be introduced, if required, into the match before or by the end of the 14th over of a team’s innings. The 2023 IPL will played between April and October. So how does ‘impact player’ rule works? If Delhi Capitals’ Prithvi Shaw and gets out cheaply and the team feels that they have a like-for-like power-hitter in Yash Dhull sitting in the dug-out as one of the four substitutes, he can come out for batting. Similarly in case of a bowling team, if MS Dhoni uses Deepak Chahar’s four over spell within the first eight overs and feels conditions at the Eden Garden’s are aiding seam and swing, he can substitute Chahar with Sam Curran (if picked by CSK) before the 14th over and ask bowl his full quota of four overs for maximum advantage. —PTI “With the ever-growing popularity of T20 cricket, it is imperative that we look at introducing new dimensions which will make this format more attractive and interesting not only for our viewers but also the participating teams from a strategic viewpoint,” the BCCI, in its note to state units had said before the Mushtaq Ali Trophy. PTI After Syed Mushtaq Ali T20, BCCI set to introduce ‘impact player’ rule in IPL added by Press Trust of India on 2:07 am December 3, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-02 20:37:51","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket South Africa has set goal to build biggest franchise-based league after IPL: Graeme Smith","link":"https://economictimes.indiatimes.com/news/sports/cricket-south-africa-has-set-goal-to-build-biggest-franchise-based-league-after-ipl-graeme-smith/articleshow/95947459.cms","keywords":null,"creator":null,"video_url":null,"description":"SA20 has been billed as a miniIPL since all the six teams are owned by IPL franchise owners. The teams are: Durban’s Super Giants (RPSG Sports), Jo’burg Super Kings (India Cements), MI Cape Town (Reliance), Paarl Royals (Rajasthan Royals), Pretoria Capitals (JSW Sports) and Sunrisers Eastern Cape (Sun TV).","content":"Synopsis SA20 has been billed as a miniIPL since all the six teams are owned by IPL franchise owners. The teams are: Durban’s Super Giants (RPSG Sports), Jo’burg Super Kings (India Cements), MI Cape Town (Reliance), Paarl Royals (Rajasthan Royals), Pretoria Capitals (JSW Sports) and Sunrisers Eastern Cape (Sun TV). Cricket South Africa's cricket league has been billed as a mini-IPL since all the 6teams are owned by IPL franchise owners. Former South African cricket captain and the commissioner of SA20 Graeme Smith has set himself a goal of building the largest franchise-based cricket league in the world after the cash-rich Indian Premier League. SA20 is Cricket South Africa's franchise-based cricket league that has been created on the lines of the IPL . “IPL is the strongest and biggest league in the game. We want to grow the biggest league outside of India. That's the objective,” he said, during an interaction on the sidelines of an event organised by Viacom18 Sports in Mumbai. Viacom18 Sports has bagged the media rights to telecast/live stream SA20 in India for 10 years. Smith hopes that the SA20 league will appeal to the Indian audiences due to a favourable time zone and affinity of Indian fans towards South African cricketers. SA20 has been billed as a miniIPL since all the six teams are owned by IPL franchise owners. The teams are: Durban’s Super Giants (RPSG Sports), Jo’burg Super Kings ( India Cements ), MI Cape Town ( Reliance ), Paarl Royals (Rajasthan Royals), Pretoria Capitals (JSW Sports) and Sunrisers Eastern Cape ( Sun TV ). Smith said the IPL franchise owners fit the bill to own the SA20 teams due to their expertise in running cricket franchises. “The conscious choice was to attract the best type of partners to the game. IPL team owners understand franchise cricket due to their ownership of IPL teams. They will bring their expertise and business acumen to South African cricket,” he added. Smith said the league would help the franchise owners to break even as soon as possible so that they could invest more money into cricket. SA20's first goal is to build the league in South Africa, he said. \"We want to make sure that its success there and if it's a success there, it will grow,\" Smith said, while noting that India would be a key market for SA20. Friday, 02 Dec, 2022 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies Brands & Companies More Nov GST Mop-up Rises 11%; Factory PMI at 3-Mth High India’s goods and services tax (GST) collections rose 11% in November from a year earlier to ₹1.46 lakh crore, adding to other data released on Thursday that showed economic resilience despite rising headwinds. Best Offer 60% Below Liquidation Value, RCap Lenders to Meet All Bidders Today The administrator at Anil Ambani-owned Reliance Capital has told lenders that the highest bid received for the insolvent financial services company is 60% below its aggregate liquidation value, making it imperative to seek improved plans from bidders, two people aware of the development told ET. Read More News on sa20 graeme smith ipl durban’s super giants paarl royals (rajasthan royals) india cements reliance sun tv (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Nykaa bonus issue: A financial masterstroke or a corporate-governance nightmare? 5 mins read 3 insights to kick-start your day, featuring Tata vs Mittal vs Ambani vs Musk 3 mins read Strategy Stock Radar: Dabur India breaks above bullish flag pattern; fresh record highs possible 3 mins read Subscribe to ETPrime","pubDate":"2022-12-02 19:11:49","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-81316,resizemode-4,msid-95947459/cricket-south-africa-has-set-goal-to-build-biggest-franchise-based-league-after-ipl-graeme-smith.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"If Asia Cup series is not held in Pakistan, chances are we will leave: Ramis Raza","link":"https://thenewsglory.com/if-asia-cup-series-is-not-held-in-pakistan-chances-are-we-will-leave-ramis-raza/","keywords":["Sports","Cricket","India","Pakistan"],"creator":["The News Glory"],"video_url":null,"description":"Rawalpindi: Pakistan Cricket Board Chairman Ramis Raza has said that if the upcoming Asia Cup cricket series is not held in Pakistan, there is a high chance that we will be out of the series. Earlier, BCCI Secretary Jay Shah had said that the Asia Cup series could be held at a common venue by […]","content":"Rawalpindi: Pakistan Cricket Board Chairman Ramis Raza has said that if the upcoming Asia Cup cricket series is not held in Pakistan, there is a high chance that we will be out of the series. Earlier, BCCI Secretary Jay Shah had said that the Asia Cup series could be held at a common venue by the two countries by last October. He said this when asked whether the Indian team will go to Pakistan. “We deservedly got the right to host the Asia Cup series. If this series is not held in Pakistan, there is a high chance of our team leaving the series,” said Ramis Raza during the first Test match between England and Pakistan. Earlier, “We will not participate in the 2023 ODI World Cup in India if the Indian team does not come to Pakistan to play in the Asia Cup series. It is also noteworthy that he had publicly said that “Nobody will watch the series without Pakistan playing”.","pubDate":"2022-12-02 18:51:10","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Socceroos all the rage while Test cricket flails","link":"https://www.watoday.com.au/sport/soccer/socceroos-all-the-rage-while-test-cricket-flails-20221202-p5c36q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Peter FitzSimons"],"video_url":null,"description":"The throngs watching the Socceroos in Melbourne at 2am was in stark contrast to what went down in Perth.","content":"Bloody hell. Talk about the times they are a’changing! Can we compare and contrast Federation Square in Melbourne at 2am on Thursday morning with Perth’s Optus Stadium at noon of the same day? Who would have thought, even 20 years ago, that the former would be chokka-blok at that time of night with people cheering, crying, stomping, completely absorbed by every spine-tingling minute as Australia held on against all odds in a fabulous World Cup match against the Danes while ... for a Test cricket match against the Windies , the stadium is a fifth full, if that, just 10,000 people, and even those who are there don’t seem to care any more than we do about Australia smashing all before them. Honestly, only a short time ago, wouldn’t this have been the most unheard of thing anyone had ever heard of? And yes, I guess it would be more significant if there was any probability that the success of the Socceroos was going to re-invigorate the A-League, but it already feels like a week never seen before in Australian sport. And of course we can’t beat Argentina, but ... But if we did, I think we can all agree that it would surpass the finest moment so far of Australian sport, which was winning the America’s Cup? Illustration Credit: John Shakespeare Sydney’s missed chance for live site And speaking of the extraordinary scenes out of Federation Square this week. Why, Premier Dominic Perrottet was asked on Thursday, didn’t Sydney have its own live site to watch the World Cup, the way the Melburnians did for the first three pool games?","pubDate":"2022-12-02 18:05:00","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"LIVE, 2022 FIFA World Cup: Brazil take on Cameroon; Switzerland, Serbia square off for knockout spot","link":"https://www.firstpost.com/sports/fifa-world-cup-2022-serbia-vs-switzerland-cameroon-vs-brazil-live-score-group-g-football-latest-updates-11741831.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"LIVE, 2022 FIFA World Cup: Brazil take on Cameroon; Switzerland, Serbia square off for knockout spot","content":"LIVE, 2022 FIFA World Cup: Cameroon 0-0 Brazil; Serbia 0-0 Switzerland Brazil can guarantee the top spot in Group G with a draw against Cameroon while Serbia and Switzerland play for everything in final matches of group stages. FP Sports December 02, 2022 23:12:40 IST Auto refresh feeds LIVE, 2022 FIFA World Cup: Brazil have already progressed to the knockout stages as group toppers while Cameroon, Switzerland and Serbia remain in hunt. AP Highlights LIVE NEWS and UPDATES Dec 03, 2022 - 00:17 (IST) FIFA World Cup Group G Live A look at Cameroon's starting XI for the game The player that will shine in #CMR v #BRA is ___________ #FIFAWorldCup | #Qatar2022 — FIFA World Cup (@FIFAWorldCup) December 2, 2022 Dec 03, 2022 - 00:15 (IST) LINEUPS | #SRBSUI 📝 It is 𝐝𝐨-𝐨𝐫-𝐝𝐢𝐞 for #Serbia & #Switzerland . Who will deliver the winning 👊 in this virtual knockout❓ Watch #FIFAWorldCup ➡️ LIVE on #JioCinema & @Sports18 📺📲 #Qatar2022 #WorldsGreatestShow #FIFAWConJioCinema #FIFAWConSports18 pic.twitter.com/SN2iOerDpT — JioCinema (@JioCinema) December 2, 2022 Dec 03, 2022 - 00:05 (IST) FIFA World Cup Group G Live Serbia name a strong line-up against Switzerland in a do-or-die game. Serbia starting XI vs Switzerland. Napred Srbijo!!!! 🇷🇸🇷🇸🇷🇸 pic.twitter.com/6GHoes4Co0 — Serbian Football (@SerbianFooty) December 2, 2022 Dec 03, 2022 - 00:02 (IST) FIFA World Cup Group G Live Cameroon will fancy their chances tonight as Brazil rest key players for the game with the last 16 spot sealed. Casemiro, Vinicius Junior, Richarlison, Thiago Silva are among key players that are rested while Eder Militao, Dani Alves, Rodrygo among others are picked for the starting XI. Quality is certainly not an issue for the Brazilians; still a task for the Africans! Equipe definida! 💪🤩 Os 11 jogadores que iniciarão a partida entre 🇧🇷 e 🇨🇲 foram definidos pelo técnico Tite e sua comissão. Classificada para as oitavas de final, a Seleção Brasileira busca garantir o primeiro lugar do Grupo G. Vamos juntos por mais uma vitória! 🙏 pic.twitter.com/xmPGnAFqu8 — CBF Futebol (@CBF_Futebol) December 2, 2022 Dec 02, 2022 - 23:56 (IST) FIFA World Cup Group G Live As we inch closer towards the final games of Group G, let's take a look at the points table. As mentioned, Brazil need a draw to win the group. Switzerland vs Serbia match is of particular interest as a winner among the two is likely to reach the knockout stages as second runners-up. The equation is bit dicey for Serbia as a win won't be enough if Cameroon stun Brazil. Dec 02, 2022 - 23:19 (IST) FIFA World Cup Group G Live Hello and welcome to the Live coverage of the FIFA World Cup Group G matches as three teams remain in contention for a knockout spot wile World No. 1 Brazil walk into their game against Cameroon feeling comfortable with their last-16 spot ensured with back-to-back wins. The five-time champions, however will like to seal the top spot at least and a draw will ensure that. Matches Cameroon vs Brazil 12:30 PM IST Serbia vs Switzerland 12:30 PM IST Neymar is for sure out against Cameroon, and many of Brazil’s stars may join him on the sideline. Brazil can guarantee the top spot in Group G with a draw, so coach Tite was expected to make changes at nearly every position against Cameroon. “Tite had already told us after the game against Switzerland that he intended to make changes in the lineup,” Brazil midfielder Fabinho said. “He said he wanted everyone to play and we are happy with that decision.” FIFA World Cup: Fixtures | Results | Points Table | Squads | Records Tite planned to use only reserve players: Ederson will replace Alisson in goal, and Dani Alves, Fabinho, Antony and Gabriel Martinelli are all expected to start. If the 39-year-old Alves does play, he would become the oldest Brazilian to play at a World Cup — ahead of the 38-year-old Thiago Silva, who is Brazil’s captain in Qatar. Alves’ last game at a World Cup was in the round of 16 of the 2014 tournament in Brazil. He was injured four years ago in Russia. Cameroon needs to beat Brazil and that might not be enough to advance past the group stage for the first time since its run to the quarterfinals in 1990. But Cameroon is at the mercy of other match results, and if both Serbia and Cameroon win its games, then advancing would come down to goal difference. “We are going to be focused and very disciplined for the whole 90 minutes,” Cameroon coach Rigobert Song said. “I want to see the determination and commitment that will allow us to get the three points.” Cameroon sent goalkeeper Andre Onana home for disciplinary reasons after a dispute with Song. He was dropped from the lineup before Cameroon’s second game and the Inter Milan goalkeeper was sent home at the beginning of the week. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 03, 2022 00:25:36 IST TAGS: Fifa World Cup 2022 Kickingaround","pubDate":"2022-12-02 17:49:40","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Brazil-FIFA-World-Cup.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Test cricket and ODIs will stay, says Sehwag","link":"https://thenorthlines.com/test-cricket-and-odis-will-stay-says-sehwag/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies Twenty20 cricket has brought much-needed financial security for players and while there are concerns it may divert attention and resources away from tests and ODIs former India batsman Virender Sehwag sees no reason why all three formats cannot co-exist. The success of the Indian Premier League (IPL) has spawned similar T20 competitions around the […] The post Test cricket and ODIs will stay, says Sehwag appeared first on Northlines.","content":"Agencies Twenty20 cricket has brought much-needed financial security for players and while there are concerns it may divert attention and resources away from tests and ODIs former India batsman Virender Sehwag sees no reason why all three formats cannot co-exist. The success of the Indian Premier League (IPL) has spawned similar T20 competitions around the world , and the governing International Cricket Council (ICC) sees T20 as a vehicle to break new ground and push for the game’s Olympic inclusion. The vast number of games on the cricket calendar has prompted some players to prioritise formats, though few are willing to walk away from the lucrative T20 leagues. “I don’t agree that only T20 is the way forward,” Sehwag told Reuters. “Test cricket and One-day cricket will stay because the ICC makes sure countries play them so it can organise the World Test Championship and the ODI World Cup. “Test cricket and ODIs are very much part of how the game moves forward.” Having played seven seasons in the IPL and witnessed the emergence of franchise leagues, Sehwag said professional cricketers never had it so good. “I think this is the best time to play cricket because even if you don’t play for your country and just play these T20 leagues, you are secure from a financial point of view,” he added. A calendar logjam looms next month when new competitions in the United Arab Emirates and South Africa clash with the Big Bash League in Australia and the Bangladesh Premier League. India’s Zee Entertainment Enterprises has bagged the broadcast and digital rights of the International League T20 (ILT20) in the UAE and Sehwag is the face of its pre-tournament promotional campaign.","pubDate":"2022-12-02 17:37:35","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs BAN: Litton Das to lead Bangladesh in ODI series against India after Tamim Iqbal's injury","link":"https://www.dnaindia.com/cricket/report-ind-vs-ban-litton-das-to-lead-bangladesh-in-odi-series-against-india-after-tamim-iqbal-s-injury-3007566","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Bangladesh Cricket Board have handed over the captaincy to Litton Das in Tamim Iqbal's absence after the veteran was ruled out through injury.","content":"Bangladesh were handed a massive blow on Thursday as limited overs skipper Tamim Iqbal picked up a groin injury while playing in a warmup game ahead of India's tour of Bangladesh. Iqbal has been asked to rest for two weeks and remains a doubt for the Test series between the two teams. In Iqbal's place, Litton Das has been tasked to lead the Bangla Tigers for their home assignment against Rohit Sharma's men. Bangladesh Cricket Board's chairman of cricket operations, Jalal Yunus confirmed the development. Bangladesh are already without the services of Taskin Ahmed for the first ODI, and after having their skipper ruled out, the Bangla Tigers will be led by the promising Litton Das. READ| IND vs BAN: Meet the beautiful WAGs of Bangladesh players ahead of India's tour \"Litton is one of the more experienced players in the side and has demonstrated leadership qualities. He has a sharp cricketing mind and reads the game well,\" said Jalal in a statement. \"It is most unfortunate to lose Tamim to injury for this very important series, especially because under his captaincy the team has played some outstanding cricket in the last couple of years and he has been our most prolific batsman in this format,\" he added. In Taskin's place, Shoriful Islam has been added to Bangladesh's squad for the first ODI. Das, who scored a 60-run knock against India in the T20 World Cup has been very impressive in 2022. READ| IPL 2023: What is an Impact Player? All you need to know about BCCI's new rule The 28-year-old has been the Bangla Tigers' highest run-scorer in ODIs in 2022, as he smashed 500 runs in 10 innings with a stunning average of 62.50. Das has already led his nation before in T20Is, but against India, it will be his maiden ODI outing as skipper.","pubDate":"2022-12-02 17:25:37","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Essex chairman steps aside pending review of social media posts","link":"https://www.thestar.com.my/sport/cricket/2022/12/03/cricket-essex-chairman-steps-aside-pending-review-of-social-media-posts","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - Azeem Akhtar has voluntarily stepped aside as chairman of Essex county cricket club, only days after he was appointed to the role, pending an independent review into historic posts on social media. Read full story","content":null,"pubDate":"2022-12-02 16:46:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Pakistan's Pitches From 'Dark Ages', Says Cricket Board Chief Ramiz Raja","link":"https://sports.ndtv.com/cricket/pakistans-pitches-from-dark-ages-says-cricket-board-chief-ramiz-raja-3573504","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Ramiz Raja, a former national captain and now Pakistan Cricket Board chief, said he was \"not happy at all\" over the state of the pitch, which he admitted was \"not a great advert\" for Test cricket.","content":null,"pubDate":"2022-12-02 16:34:08","image_url":"https://c.ndtvimg.com/2022-12/2i0bl8mo_rawalpindi_625x300_02_December_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Vijay Hazare Trophy: Wife of late cricketer Avi Barot lives husband’s ‘second’ dream as Saurashtra lifts title","link":"https://sportstar.thehindu.com/cricket/domestic/vijay-hazare-trophy-final-saurashtra-vs-maharashtra-opener-avi-barot-wife-nidhi-lives-husband-dream/article66216282.ece","keywords":null,"creator":["\n        Amol Karhadkar  \n    "],"video_url":null,"description":"It was the first time Nidhi - wife of late Saurashtra opener Avi Barot - had brought her daughter Radhya to watch a cricket match. It was Nidhi’s first time at the Narendra Modi Stadium too since the sudden demise of her husband.","content":null,"pubDate":"2022-12-02 16:30:24","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"33 overs, 235 runs: Poor performance by Pakistan bowlers on debut","link":"https://thenewsglory.com/33-overs-235-runs-poor-performance-by-pakistan-bowlers-on-debut/","keywords":["Sports","Cricket","India","Pakistan","test"],"creator":["The News Glory"],"video_url":null,"description":"Rawalpindi: Zahid Mohammad, the debutant bowler of Pakistan team, has made the worst record in the Test cricket match against the England team. He bowled 33 overs and conceded 235 runs in the first innings of this match. With this, he has become the bowler who conceded the most runs in an innings in the […]","content":"Rawalpindi: Zahid Mohammad, the debutant bowler of Pakistan team, has made the worst record in the Test cricket match against the England team. He bowled 33 overs and conceded 235 runs in the first innings of this match. With this, he has become the bowler who conceded the most runs in an innings in the history of Test cricket. The England cricket team is touring Pakistan for a three-match Test series. Both the teams are currently playing the first match of the series. England won the toss and were all out for 657 runs in 101 overs in the first innings. It was in that innings that the debutant bowler Zahid Mohammed bowled the England players. He bowled a total of 33 overs and conceded 235 runs including 1 maiden. He has taken 4 wickets. Bowlers who scored most runs in an innings on debut:","pubDate":"2022-12-02 15:48:10","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Vijay Hazare Trophy: Fans hail Sheldon Jackson’s ‘jordar’ ton as Saurashtra defeat Maharashtra in final","link":"https://www.firstpost.com/firstcricket/sports-news/vijay-hazare-trophy-fans-hail-sheldon-jacksons-jordar-ton-as-saurashtra-defeat-maharashtra-in-final-11740861.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Vijay Hazare Trophy: Fans hail Sheldon Jackson’s ‘jordar’ ton as Saurashtra defeat Maharashtra in final","content":"Saurashtra beat Maharashtra by five wickets to win the 2022 Vijay Hazare Trophy in Ahmedabad on Friday with experienced campaigner Sheldon Jackson playing a primary role in the victory .Jackson was named the Player of the Match thanks to his unbeaten 133 off 136 deliveries, while opposition batter Ruturaj Gaikwad was awarded the Player of the Tournament title for his exceptional performances throughout the event. The Maharashtra skipper recorded as many as four centuries including 108 in the final.Except for Gaikwad, no other batter from the Maharashtra side managed to register a big score. The captain’s knock and a couple of important cameos from Azim Kazi and Naushad Shaikh helped them produce a decent total of 248 runs in 50 overs. For Saurashtra, pacer Chirag Jani picked up three wickets.In reply, Jackson, a seasoned player on the domestic circuit, made his experience count in the summit game. He stayed at the crease till the last over and led his team to the victory line with 21 balls left to spare. However, he was seen struggling a bit during the entire campaign.Jackson’s opening partner Harvik Desai also registered a commendable half-century in 67 balls. And Chirag Jani contributed to the victory both with ball and ball, collecting three wickets for 43 runs to restrict Maharashtra before scoring an unbeaten 30 off 25 balls to guide his team home in Jackson’s company.A fan lauded Jackson’s effort and wrote on Twitter, “What an innings from Sheldon Jackson played under pressure in the final of Vijay Hazare Trophy. He was unbeaten at 133* runs from 136 balls including 12 fours and 5 Sixes in the successful run chase.”What an innings from Sheldon Jackson played in under pressure in final of Vijay Hazare Trophy. He unbeatan 133* runs from 136 balls including 12 fours and 5 Sixes in successful run chase.Outstanding innings, Sheldon Jackson. pic.twitter.com/UXKVOsfwzR— CricketMAN2 (@ImTanujSingh) December 2, 2022 Another user noted, “What an innings from Sheldon Jackson played under pressure in the final of the Vijay Hazare Trophy.”What an innings from Sheldon Jackson played in under pressure in final of Vijay Hazare Trophy.. Jordar inning bhai @ShelJackson27 #VijayHazareTrophy2022 pic.twitter.com/ozpwlA7ofj— ∑(³)=(∑)² (@Crickeuler) December 2, 2022 A person shared a photograph of the massive celebration by the Saurashtra cricketers after the remarkable victory.The winning celebration of Saurashtra – beating Maharashtra in the Final of Vijay Hazare Trophy. pic.twitter.com/AccT619qqi— Mufaddal Vohra (@mufaddal_vohra) December 2, 2022 Here are some other note-worthy reactions:2022/23 Vijay Hazare Trophy: FinalSaurashtra 249/5 beat Maharashtra 248/9 by 5 wicketsTop Performers :Chirag Jani – 30*(25) & 3/43 Sheldon Jackson – 133*(136) Ruturaj Gaikwad – 108(131) Vicky Ostwal – 2/20#VijayHazareTrophy2022 #VijayHazareTrophy #crickettwitter pic.twitter.com/bvKjCmiaf1— Indian Domestic Cricket Forum – IDCF (@IndianIdcf) December 2, 2022What a incredible All-round performance by Chirag Jani in the final of Vijay Hazare Trophy vs Maharashtra:•With the ball: 10-1-43-3 •With the bat: 30*(25). •2 catches. •1 run-out. •Hat-trick.Take a bow, Chirag Jani. pic.twitter.com/AWFNM26Rqr— CricketMAN2 (@ImTanujSingh) December 2, 2022Captain Jaydev Unadkat’s celebrations after Saurashtra won the Vijay Hazare Trophy final pic.twitter.com/ONCthjtfbH— CricketFans (@_fans_cricket) December 2, 2022The celebrations of Saurashtra team when they won Vijay Hazare Trophy final. pic.twitter.com/da4kqHucDe— CricketMAN2 (@ImTanujSingh) December 2, 2022Well Played @ShelJackson27 133 runs in the final of Vijay hazare trophy pic.twitter.com/elQO1JYmgN— Ashish Shrivastava (@ashishayush1177) December 2, 2022 With his third consecutive hundred in the final, Gaikwad became the player with the most number of centuries (12) in the history of the Vijay Hazare Trophy followed by veteran batter Robin Uthappa.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-02 15:14:20","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Sheldon-Jackson-Vijay-Hazare-Trophy-final-Twitter-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh: 'Rishabh Pant is not making the most out of opportunities,' feels Aakash Chopra","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-rishabh-pant-is-not-making-the-most-out-of-opportunities-feels-aakash-chopra-11739861.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"India vs Bangladesh: 'Rishabh Pant is not making the most out of opportunities,' feels Aakash Chopra","content":"A number of senior cricketers from the Indian side will return to action when India face Bangladesh in a multi-format series consisting of three ODIs and two Tests. Ahead of the ODI series, former India cricketer Akash Chopra made a stern remark regarding the poor form of wicketkeeper-batter Rishabh Pant.The Southpaw failed to produce anything significant in the recently-concluded New Zealand tour. Referring to his continued lean patch with the bat, Chopra noted that another below-par show during the Bangladesh tour can see the Delhi Capitals skipper losing his position in India’s white-ball unit.Having the opportunity to bat in two ODIs against the Kiwis, Pant, the vice-captain of the side, managed to record just 25 runs. He also could not utilise the limited chances he got in the T20 World Cup. In this context, Chopra, while speaking on his YouTube channel, explained, “His record in ODIs is superior to T20Is. He had the chance twice and the time to take advantage of it, but he wasn’t able to make the most of it.”The ex-player further warned that the 25-year-old might not be included in the squad for India’s upcoming fixtures on home soil next year, if this form continues. Another youngster, Ishan Kishan, has also earned his ticket to Bangladesh. However, according to Chopra, the Rohit Sharma-led side will rely on KL Rahul and hand him the keeper’s role. As a reason, Chopra asserted: “Given that Shikhar Dhawan is already in the team, the team may consider KL Rahul to play as a keeper-batter.“In my opinion, he is still on thin ice. It is definitely a tightrope walk for him. The team’s vice-captain for the New Zealand tour might not be selected for the squad for the forthcoming home matches if he doesn’t play well in the Bangladesh ODIs. Overall, he was unable to make use of his opportunity in New Zealand, and as a result, his future won’t be that easy,” the presenter further added in the last.India will lock horns with Bangladesh for the opening ODI on 4 December at the Sher-e-Bangla Stadium. The red-ball action is slated to commence with the first Test beginning on 14 December.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-02 15:06:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Rishabh-Pant.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ruturaj Gaikwad last 10 innings score: How many runs has CSK batter scored in Indian domestic season 2022 23?","link":"https://thesportsrush.com/cricket-news-ruturaj-gaikwad-last-10-innings-score-how-many-runs-has-csk-batter-scored-in-indian-domestic-season-2022-23/","keywords":["Cricket","chennai super kings","csk","India","Maharashtra","Ruturaj Gaikwad","Syed Mushtaq Ali Trophy","Vijay Hazare Trophy 2022-23"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ruturaj Gaikwad couldn’t lead Maharashtra to his maiden domestic title as captain but was utterly successful in piling on superabundant runs throughout the white-ball leg of the ongoing Indian domestic season. Eight-highest run-scorer in Syed Mushtaq Ali Trophy 2022-23, Gaikwad followed it with becoming the second-highest run-scorer in the most recently concluded Vijay Hazare Trophy… The post Ruturaj Gaikwad last 10 innings score: How many runs has CSK batter scored in Indian domestic season 2022 23? appeared first on The SportsRush.","content":"Ruturaj Gaikwad couldn’t lead Maharashtra to his maiden domestic title as captain but was utterly successful in piling on superabundant runs throughout the white-ball leg of the ongoing Indian domestic season. Eight-highest run-scorer in Syed Mushtaq Ali Trophy 2022-23, Gaikwad followed it with becoming the second-highest run-scorer in the most recently concluded Vijay Hazare Trophy 2022-23. A free-flowing run-scoring spree has found Gaikwad hitting six centuries in his last 10 List A and T20 innings. Gaikwad, who hit a career-best 220* (159) in the second quarter-final against Uttar Pradesh on Monday, put on display his big-hitting skills on the back of hitting seven sixes in an over in a record-breaking innings. Yet to make a mark in his 10-match limited-overs career at the highest level, Gaikwad is doing his best to make a comeback into the national squad. Not part of a 17-member Indian squad for the tour of Bangladesh, it will be difficult for the selectors to continue keeping Gaikwad out of contention considering the number of runs he is amassing in domestic circuit. All in all, Gaikwad has scored a grand total of 955 runs at an average and strike rate of 119.75 and 122.12 respectively in his last 10 innings in representative cricket spanning across five venues in three different states. Gaikwad’s calibre of contributing in big matches can be observed from the fact that he scored three consecutive centuries in knockout matches of Vijay Hazare Trophy. Ruturaj Gaikwad last 10 innings score Match 1 – 108 (131) vs Saurashtra at Narendra Modi Stadium Match 2 – 168 (126) vs Assam at Narendra Modi Stadium Match 3 – 220* (159) vs Uttar Pradesh at Narendra Modi Stadium Match 4 – 40 (42) vs Bengal at JSCA International Stadium Complex Match 5 – 124* (123) vs Railways at Metallurgical & Engineering Consultant Ltd Sail Stadium Match 6 – 19 (19) vs Haryana at Maharaja Yadavindra Singh International Cricket Stadium Match 7 – 114 (68) vs Kerala at Maharaja Yadavindra Singh International Cricket Stadium Match 8 – 38 (33) vs Meghalaya at Punjab Cricket Association IS Bindra Stadium Match 9 – 12 (16) vs Jammu & Kashmir at Punjab Cricket Association IS Bindra Stadium Match 10 – 112 (65) vs Services at Punjab Cricket Association IS Bindra Stadium The post Ruturaj Gaikwad last 10 innings score: How many runs has CSK batter scored in Indian domestic season 2022 23? appeared first on The SportsRush.","pubDate":"2022-12-02 14:38:19","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 LIVE: Portugal face South Korea, Ghana takes on Uruguay to close Group H","link":"https://www.firstpost.com/sports/fifa-world-cup-2022-live-score-south-korea-vs-portugal-ghana-vs-uruguay-today-football-latest-updates-11741411.html","keywords":["Sports"],"creator":["Bansal Shah"],"video_url":null,"description":"FIFA World Cup 2022 LIVE: Portugal face South Korea, Ghana takes on Uruguay to close Group H","content":"FIFA World Cup 2022 LIVE: Portugal 1 - 0 South Korea, Ghana 0 - 0 Uruguay FIFA World Cup 2022 LIVE: Group H final day kicks off as Portugal face South Korea and Ghana face Uruguay in an acid test Bansal Shah December 02, 2022 19:56:39 IST Auto refresh feeds Cristiano Ronaldo greets fans prior to the World Cup group H match between South Korea and Portugal. AP Highlights LIVE NEWS and UPDATES Dec 02, 2022 - 20:52 (IST) FIFA World Cup Group H Live, Uruguay vs Ghana: 21' | Excellent save by Rochet! Heartbreak for Ghana players and fans alike. A glorious opportunity has been washed away. Ayew tries to shoot it to the left side of the net, but Rochet had read his mind. Uruguay 0 - 0 Ghana Dec 02, 2022 - 20:50 (IST) FIFA World Cup Group H Live, Uruguay vs Ghana: 18' | Some heated moments and Ghana have won a penalty kick! Dec 02, 2022 - 20:49 (IST) FIFA World Cup Group H Live, Portugal vs South Korea: 17' | A superb save from Diego Costa against a brilliant header. Korea tried to scored on the rebound, but the flag went up for off side. Portugal 1 - 0 South Korea Dec 02, 2022 - 20:40 (IST) FIFA World Cup Group H Live, Portugal vs South Korea: Interesting stat - Portugal have never lost a World Cup match when they have scored first! Dec 02, 2022 - 20:40 (IST) FIFA World Cup Group H Live, Portugal vs South Korea: 5' | Portugal have drawn the first blood! It's a goal. Excellent attack by the Portuguese front line. Just the fifth minute in the match and they have struck. Dalot ran almost to the byline and then passed the ball to Horta who was in front of the goal post, on the edge of the six-yard box. He shoots to the far side corner and that could not have been stopped! Portugal 1 - 0 South Korea Dec 02, 2022 - 20:29 (IST) FIFA World Cup Group H Live: National anthems have been done. We are just moments away from live action. Cristiano Ronaldo who was doubtful to start is leading Portugal from the front. Dec 02, 2022 - 20:24 (IST) FIFA World Cup Group H Live Starting line-ups: South Korea (4-2-3-1) Kim Seung-gyu; Kim Jin-su, Kim Young-gwon, Kwon Kyung-won, Kim Moon-hwan; Jung Woo-young, Hwang In-beom; Lee Kang-in, Lee Jae-sung, Son Heung-min (c); Cho Gue-sung Portugal (4-2-3-1) Diogo Costa; Diogo Dalot, Antonio Silva, Pepe, Joao Cancelo; Ruben Neves, Matheus Nunes; Ricardo Horta, Joao Mario, Vitinha; Cristiano Ronaldo (c) Dec 02, 2022 - 20:23 (IST) FIFA World Cup Group H Live Starting line-ups: Ghana (4-2-3-1) Lawrence Ati Zigi; Alidu Seidu, Daniel Amartey, Mohammed Salisu, Baba Rahman; Salis Abdul Samed, Thomas Partey; Mohammed Kudus, Andre Ayew (capt), Jordan Ayew; Inaki Williams Uruguay (4-3-3) Sergio Rochet; Guillermo Varela, Jose Maria Gimenez, Sebastian Coates, Mathias Olivera; Federico Valverde, Rodrigo Bentancur, Giorgian De Arrascaeta; Facundo Pellistri, Luis Suarez (capt), Darwin Nunez Dec 02, 2022 - 20:06 (IST) FIFA World Cup Group H Live: Let us take a look at the Group H points table ahead of the games Dec 02, 2022 - 20:04 (IST) FIFA World Cup Group H Live: Portugal vs South Korea - Education City Stadium Ghana vs Uruguay - Al Janoub Stadium Load More Customary favourites Portugal have already qualified for the last 16 to the delight of their fans in a World Cup marred with upsets. However, the other team to proceed to the knockouts is yet to be decided. Do not forget, this is the final day of the group stage and only two slots are left to be filled for the Round of 16 – one each from Group G and Group H. Ghana are currently placed second on the points table with three points but face an acid test in Luiz Suarez’s Uruguay. A win will undoubtedly see them proceed, irrespective of other results, but if they draw against Uruguay, they will want Portugal to win or draw against South Korea. Uruguay are in a similar situation, maybe slightly worse. A win will make sure they remain alive in the World Cup if Portugal beats South Korea. If South Korea draws against Portugal, Uruguay will have to better their goal difference which is currently -2, against -1 of South Korea. Exciting times wait ahead as Group H kicks off at 8.30 pm IST. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 02, 2022 20:48:21 IST TAGS: Fifa World Cup 2022 Kickingaround","pubDate":"2022-12-02 14:26:39","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Portugal-vs-South-Korea.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Vijay Hazare Trophy | Ruduraj scored three centuries in a row","link":"https://thenewsglory.com/vijay-hazare-trophy-ruduraj-scored-three-centuries-in-a-row/","keywords":["Sports","Cent","Chennai Super Kings","India","Rudu Raj","Ruturaj Gaikwad","Twitter","Vijay Hazare"],"creator":["The News Glory"],"video_url":null,"description":"Ahmedabad: Ruduraj Gaekwad has made it three consecutive centuries in the series with his century in the final of the ongoing Vijay Hazare Trophy. Ruduraj, playing for Maharashtra in the quarter final match of Vijay Hazare Trophy, had scored a double century. He then scored a century in the semi-finals. At this stage, he scored […]","content":"Ahmedabad: Ruduraj Gaekwad has made it three consecutive centuries in the series with his century in the final of the ongoing Vijay Hazare Trophy. Ruduraj, playing for Maharashtra in the quarter final match of Vijay Hazare Trophy, had scored a double century. He then scored a century in the semi-finals. At this stage, he scored a century again in the final against Saurashtra. He has scored 108 runs in 131 balls in this match. With this, Ruduraj has registered hundreds in three consecutive matches. All three of these centuries were in knockout matches. It is worth noting that Rudhuraj has scored a total of 12 centuries in the Vijay Hazare Trophy series alone. Ruturaj Gaikwad 100 Moment in Vizay Hazare Trophy Final !!! His Celebration shows how frustrated he was & badly wanted this 100! Played 3 matches in Knockouts…100 in all 3 ! Started very slow, but recovered well later! Go on Rutu pic.twitter.com/Hy6oLXfYvT — Shantanu Congratulations are pouring in on social networking sites for him who keeps scoring hundreds. Commenting on Ruduraj’s performance, former Australian Mike Hussey said, “He is as calm as Dhoni. “He faces the balls faster than others,” he praised. It is noted that Ruduraj is playing for the Chennai Super Kings team led by Dhoni in the IPL cricket.","pubDate":"2022-12-02 14:11:50","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2023: PCB Chief Ramiz Raja threatens to pull out if Pakistan’s hosting rights are withdrawn","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2023-pcb-chief-ramiz-raja-threatens-to-pull-out-if-pakistans-hosting-rights-are-withdrawn-11741171.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2023: PCB Chief Ramiz Raja threatens to pull out if Pakistan’s hosting rights are withdrawn","content":"Pakistan Cricket Board Chairman Ramiz Raja said that Pakistan might consider pulling out of the 2023 Asia Cup if their hosting right are withdrawn and the tournament is shifted to another country.BCCI Secretary Jay Shah had, in October, said that India will not travel to Pakistan for the Asia Cup next year and that the tournament will be held at a neutral venue. Shah is also the Asian Cricket Council’s president.“It’s not as if we don’t have hosting rights and we’re pleading to host it. We won the rights fair and square. If India doesn’t come, they won’t come. If the Asia Cup gets taken away from Pakistan, maybe we’re the ones that pull out,” Ramiz said on the sidelines of the Pakistan vs England Test in Rawalpindi.England have toured Pakistan after a period of 17 years and New Zealand will be playing a test series in Pakistan starting from the last week of December. Australia as well travelled to Pakistan during March 2022.“We’ve shown we can host great teams. I can understand issues relating to bilateral cricket, but the Asia Cup is a multi-nation tournament, almost as big as the World Cup for the Asian bloc,” PCB Chief added.“Why give it to us in the first place and then make all those statements about India not travelling to Pakistan? I accept that India won’t come because the government won’t allow them to come – fine. But to take the Asia Cup away from the host on that basis isn’t right.”PCB Chairman Ramiz Raja interacts with media personnel in the media box#PAKvENG pic.twitter.com/yyObmYO3gv— Pakistan Cricket (@TheRealPCB) December 2, 2022 Ramiz was also vocal about the fact that there will be no excitement about the tournament without an India vs Pakistan contest.“Common sense,” Ramiz told BBC’s Test Match Special when asked what it would take for India to play in Pakistan.“There is no contest if India and Pakistan are not playing. I have mentioned it so many times. I have always been loved in India; I’ve done so many IPL editions [as a commentator]. I know the fans want to see India against Pakistan.”Ramiz further exemplified the attendance at MCG during the T20 World Cup match between India and Pakistan.“You saw what happened in the World Cup – 90,000 fans turned up [at MCG]. I am just a little disappointed with the ICC. When the point was put to the FIFA president, why is the US playing Iran, Iran has so many issues regarding women’s rights. He picked up the football and said this can solve a lot of issues. Through sports, we can take care of the tribe mentality. I feel let bat and ball talk.”Ramiz concluded stating that Test cricket as well needs matches between the arch-rivals for its monetization and revival.“What happens if the government of Pakistan doesn’t allow Pakistan to travel to India because of security issues?” Ramiz said when asked if he was worried about the ramifications of a pullout. “It is quite an emotional subject here. The debate was started by BCCI in a way. We had to respond. Test cricket needs India v Pakistan.”Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-02 13:58:38","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Ramiz-Raja.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'I don’t know how India backed Dinesh Karthik for so long,' says Maninder Singh","link":"https://www.firstpost.com/firstcricket/sports-news/i-dont-know-how-india-backed-dinesh-karthik-for-so-long-says-maninder-singh-11740561.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"'I don’t know how India backed Dinesh Karthik for so long,' says Maninder Singh","content":"Veteran cricketer Dinesh Karthik was considered the first choice for the wicketkeeper’s role in the T20 World Cup in Australia. However, his subpar performance has earned the ire of ex-Indian bowler Maninder Singh. The former spinner slammed the Indian team selectors for keeping Karthik with the side.The 37-year-old batter had caught the attention of the management with a match-winning cameo in the 2018 Nidahas Trophy Final against Bangladesh. Referring to that innings, Singh noted that it has been four years since then and he could not notice the same approach in recent times.Looking at his numbers in the World Cup, Karthik failed to produce anything productive on the fast-paced, bouncy tracks in Australia. In the tournament opener against Pakistan, he came in late and left the field contributing just one run to the scoresheet. The lean patch continued in the following fixture against South Africa.This time, the right-handed batter was restricted to single digits once again and scored just six runs. The scenario was quite the same in his final appearance against Bangladesh which saw him going back to the pavilion for seven runs.Taking a dig at those below-par performances, Singh explained, “I don’t know how India backed Dinesh Karthik for so long. I saw him finish just one match, that too the Nidahas Final four years ago. Even in the T20 World Cup, he was backed to the hilt and it felt like he was under pressure due to that finisher’s tag. So if someone is not performing then you need to make changes.”Notably, Karthik made a comeback to the Indian T20I lineup following a dominant performance as a finisher for Royal Challengers Bangalore in the IPL 2022. He finished the session with 330 runs under his belt at an impressive strike rate of 183.33.Additionally, Singh highlighted the situation India faced during the World Cup for not having a proper wrist spinner in the unit. According to him, the selectors have made a similar mistake in the upcoming Bangladesh tour.The former spinner wasted no time suggesting the name of Kuldeep Yadav who has not featured in Blue Jersey for quite some time. “How would you know what bowlers like Kuldeep can give us if you don’t routinely play them?” he raised the question.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-02 13:57:12","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Dinesh-Karthik.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ricky Ponting Hospitalization – Sudden Health Crisis During Live Commentary","link":"https://thenewsglory.com/ricky-ponting-hospitalization-sudden-health-crisis-during-live-commentary/","keywords":["Sports","Australia","Cricket","Hospital","Live","ricky ponting"],"creator":["The News Glory"],"video_url":null,"description":"Perth: Former Australian cricket captain Ricky Ponting has pulled out of the live commentary of the Test match between Australia and West Indies due to a sudden illness. He has also been admitted to a hospital in Perth, according to local media. Both teams are currently playing a Test match at the Perth Stadium. He […]","content":"Perth: Former Australian cricket captain Ricky Ponting has pulled out of the live commentary of the Test match between Australia and West Indies due to a sudden illness. He has also been admitted to a hospital in Perth, according to local media. Both teams are currently playing a Test match at the Perth Stadium. He walked out of the Perth stadium during the lunch break on the third day of the tournament. He has reportedly not returned to the field since then. Notably, the Australian team led by Ponting won the 2003 and 2007 ODI World Cup series. The 47-year-old has been leading the ODI cricket team since 2002 and the Test cricket team since 2004. He retired from international cricket in 2012. He has scored a total of 27,483 runs in international cricket in 168 Tests, 375 ODIs and 17 T20Is. He is currently working as the coach of Delhi Capitals.","pubDate":"2022-12-02 13:46:10","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh: Maninder Singh urges under-fire KL Rahul to 'come out of shell', bat ‘fearlessly’","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-maninder-singh-urges-under-fire-kl-rahul-to-come-out-of-shell-bat-fearlessly-11740301.html","keywords":["First Cricket News"],"creator":["Bansal Shah"],"video_url":null,"description":"India vs Bangladesh: Maninder Singh urges under-fire KL Rahul to 'come out of shell', bat ‘fearlessly’","content":"Cricketer-turned-commentator Maninder Singh expressed his views on KL Rahul’s poor form in recent times and said that he needs to come out of his shell. The former left-arm spinner also said that India need to look ahead of Bhuvneshwar Kumar in the bowling department.KL Rahul has not been able to play in his freewheeling style in international games that is often at display in the IPL. Maninder believes that he has gone into a shell after his injury and someone needs to talk to him and bring him out of that shell.pic.twitter.com/lbBi48y5DT— K L Rahul (@klrahul) November 24, 2022 “As far as KL Rahul is concerned, a lot of talking needs to be done to him. He seems to have gone into a shell after the injury when he started playing the Zimbabwe series. He has to come out of that shell, because we know what kind of a cricketer he is, and we know about his class,” Maninder said in a media interaction ahead of India’s tour to Bangladesh.Rohit Sharma-led India will play three ODIs and two Tests against their eastern neighbours. Rahul will serve as his deputy.“If he goes into a shell and thinks that first five-six overs I will try to stay and then I will start hitting, that’s too many overs being taken even in ODIs. You need to take advantage in first 10 overs (powerplay) and if you play five overs like that, it will be wasted. He needs to be told that the fearless approach he used to have is very necessary in T20I and ODIs,” Maninder added.Read | Indian cricket needs return to 2007’s bold approach to win ICC trophies againHowever, he does not believe that Rahul is blocking a place in the playing XI considering his position as vice-captain.“The times we are in, you will be dropped if you do not perform well, even if you are the vice-captain. I don’t see a problem there that he is blocking a place but he is a very talented cricketer and he has to rediscover himself.”Maninder also vouched for Shubman Gill and expressed that he should be given a longer rope in all the formats.“Shubman Gill has done well in any kind of cricket he has played. He has done well in T20 cricket and also, in IPL. I am surprised that he is not playing T20 cricket (internationals).“In ODIs, he has done wonderfully well. He looks a different player, I see a different class in him as compared to other players. He is somebody we need to give confidence to in all kinds of cricket. In white-ball cricket, you can open with him, and in Test cricket, you can play him at number 3 or number 5, wherever the coaches think he is fit.”Bhuvneshwar Kumar has been India’s highest ranked men T20i bowler since the last 484 days.— Mufaddal Vohra (@mufaddal_vohra) November 24, 2022Meanwhile, talking about the pace attack, the commentator said that India should look at the young crop of fast bowlers. He opined that Bhuvneshwar should not be given a longer stint.“Even in T20I Cricket, we need to look forward (ahead of Bhuvneshwar). We have got quite a few youngsters doing well in IPL and I am sure they are doing well for their First-Class teams as well. So time to look ahead.“If you think of a long time ahead with Bhuvneshwar, I don’t get the confidence in him. He is a fantastic bowler, he can swing the ball, but he has not performed well in pressure situations.“So I would like to go forward with youngsters. There are quite a few in this team like Kuldeep Sen. I don’t know what is going on with Prasiddh Krishna, is he injured or what. Mohammed Siraj has got a fantastic attitude. He gets over excited sometimes, but the coaches have to handle that.”Notably, Maninder has applied for a position in the senior selection committee.Watch the LIVE coverage of Bangladesh vs India – 1st ODI on SONY SPORTS TEN 5 (English) SONY SPORTS TEN 3 (Hindi) & SONY SPORTS TEN 4 (Tamil & Telugu) channels on 4th December 2022 from 12:30 PM.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-02 13:36:06","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/KL-Rahul.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Impact Player in IPL 2023: What BCCI's new rule is all about and how it was used in SMAT","link":"https://www.firstpost.com/firstcricket/sports-news/impact-player-in-ipl-2023-what-bccis-new-rule-is-all-about-and-how-it-was-used-in-smat-11740251.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Impact Player in IPL 2023: What BCCI's new rule is all about and how it was used in SMAT","content":"The BCCI on Friday introduced a major change in the Indian Premier League (IPL) by making the ‘Impact Player’ rule official from the 2023 season.“Time for a New Season. Time for a New rule. How big an “impact” will the substitute player have this edition of the #TATAIPL,” tweeted the official handle of the cash-rich Indian league that will enter its 16th season next year.“From the IPL 2023 season a tactical concept will be introduced to add a new dimension to the IPL, wherein one substitute player per team will be able to make a more active part in an IPL match,” the league further wrote in the post.Time for a New season 😃Time for a New rule 😎How big an “impact” will the substitute player have this edition of the #TATAIPL 🤔 pic.twitter.com/19mNntUcUW— IndianPremierLeague (@IPL) December 2, 2022Introducing the ‘Impact Player’ rule however, is by no means entering uncharted territory as the BCCI has already put it to the test in its domestic competitions — the recently-concluded Syed Mushtaq Ali in this case.So what exactly is the new rule and how has it been utilised in recent events? And is it similar to rules introduced by other cricket boards in their competitions? Let’s find out…What is the ‘Impact Player’ rule?The ‘Impact Player’ rule allows teams to bring in what is cricket’s equivalent of a substitute midway through the game, allowing the side to make adjustments according to changing conditions or to replace a non-performing player.The rule that was implemented in the Syed Mushtaq Ali earlier this year required teams to name four substitutes besides their Playing XI before the first ball of the match is bowled. One of those four substitutes can be brought in as the ‘Impact Player’.Unlike the concussion substitute or the ‘Super Sub’ that the ICC had introduced long back, the ‘Impact Player’ does not have to be identical in role to the player getting substituted. In other words, a bowler can replace a batter or an all-rounder.When can the Impact Player be introduced during a match?A team can call in one of the four substitutes as the ‘Impact Player’ either while batting or bowling, but before the 14th over of the innings. The player can be brought onto the field in the middle of an over as well, in case a wicket has fallen or a fielder is injured. The player that gets replaced then is ineligible to take part in the remainder of the game.The captain, the head coach or the team manager will have to notify the match officials before bringing forth one of the four substitutes. Additionally, the ‘Impact Player’ can bat for the remainder of the innings or bowl his full quota of overs.There are certain restrictions on the ‘Impact Player’ rule in case of rain-affected games; if a match has been reduced to 10-overs a side or less, then the rule cannot be enforced.Who was the first player to be named ‘Impact Player’?Delhi’s Hrithik Shokeen became the first ‘Impact Player’ in the Syed Mushtaq Ali earlier this year after the rule was officially introduced in the domestic T20 competition.Off-spinner Shokeen, who made his IPL debut with the Mumbai Indians earlier this year, replaced opener Hiten Dalal in their group match against Manipur. Dalal got replaced after scoring 47 off 27 balls, and Shokeen would make an impact with the ball, collecting two wickets for 13 runs to guide his side to a 71-run win.Is it similar to rules introduced by other leagues/tournaments?BCCI’s ‘Impact Player’ rule is similar to the X-Factor rule in the Big Bash League, which was introduced ahead of the 2020 season.In the ‘X-Factor’ rule, a member of the starting XI can be substituted at the 10-over mark of the first innings by either the 12th or the 13th player — who have to be named accordingly in the team sheets at toss.However, the member of the starting XI getting replaced cannot have batted or bowled more than one over.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-02 13:02:04","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/IPL-trophy-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Vijay Hazare Trophy Final: Sheldon Jackson stars in Saurashtra's second title triumph","link":"https://www.firstpost.com/firstcricket/sports-news/vijay-hazare-trophy-final-sheldon-jackson-stars-in-saurashtras-second-title-triumph-11740641.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Vijay Hazare Trophy Final: Sheldon Jackson stars in Saurashtra's second title triumph","content":"Ahmedabad: Senior batter Sheldon Jackson struck an unbeaten 133 as Saurashtra beat Maharashtra by five wickets to win their second Vijay Hazare Trophy title on Friday.Chasing a below-par target of 249, Saurashtra looked comfortable for the most part of their chase as Maharashtra bowlers failed to make inroads in the Saurashtra’s batting order.Jackson stitched a 125-run opening partnership alongside Harvik Desai and that led Saurashtra to cruise away in their run chase.M. O. O. D as Saurashtra win the #VijayHazareTrophy ☺️ 🏆Scorecard👉 https://t.co/CGhKsFz4eI #Final | #SAUvMAH | @mastercardindia | @saucricket pic.twitter.com/DCiEWmU7Qi— BCCI Domestic (@BCCIdomestic) December 2, 2022 Batting first, Maharashtra rode on skipper Ruturaj Gaikwad’s third consecutive hundred (108 off 131 balls) to reach 248 for 9 in 50 overs. Chirag Jani (3/43) took a hat-trick for Saurashtra.Maharashtra batters boasted of heaps of runs coming into the final of the tournament, but apart from Gaikwad, none could replicate their previous outings against a formidable Saurashtra bowling. Maharashtra were chocked for runs as they reached 100 only in 30th over.WHAT. A. WIN! 🙌 🙌Those celebrations! 👏 👏The @JUnadkat-led Saurashtra beat the spirited Maharashtra side to bag the #VijayHazareTrophy title 🏆Scorecard 👉 https://t.co/CGhKsFzC4g #Final | #SAUvMAH | @mastercardindia | @saucricket pic.twitter.com/2aPwxHkcPD— BCCI Domestic (@BCCIdomestic) December 2, 2022In reply, Saurashtra reached the target in 46.3 overs with Jackson scoring his runs off 136 balls with 12 4s and five 6s.Brief Scores: Maharashtra 248/9 in 50 overs (Ruturaj Gaikwad 108, Chirag Jani 3/43) vs Saurashtra 249/5 in 46.3 overs (Sheldon Jackson 133 not out). Saurashtra won by 5 wickets.With inputs from PTIRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-02 12:58:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Vijay-Hazare-Trophy.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Vijay Hazare Trophy | Saurashtra won the champion title","link":"https://thenewsglory.com/vijay-hazare-trophy-saurashtra-won-the-champion-title/","keywords":["Sports","Cricket","India","Saurashtra","Vijay Hazare Trophy"],"creator":["The News Glory"],"video_url":null,"description":"Ahmedabad: Saurashtra won the Vijay Hazare Cup final and won the title. The Jaidev Unadgad led team won against Maharashtra by 5 wickets. After about 14 years, the team has won the championship title in this series. The final was played at the Narendra Modi Cricket Stadium in Ahmedabad. Saurashtra won the toss and chose […]","content":"Ahmedabad: Saurashtra won the Vijay Hazare Cup final and won the title. The Jaidev Unadgad led team won against Maharashtra by 5 wickets. After about 14 years, the team has won the championship title in this series. The final was played at the Narendra Modi Cricket Stadium in Ahmedabad. Saurashtra won the toss and chose to bowl. Batting first, Maharashtra scored 248 runs for the loss of 9 wickets in 50 overs. The captain of that team, Ruduraj Gaikwad, had a hundred.","pubDate":"2022-12-02 12:45:09","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs ENG 1st Test Highlights: England 657 all out, Pakistan 181/0; Stumps Day 2","link":"https://sportstar.thehindu.com/cricket/pak-vs-eng-1st-test-live-score-streaming-info-pakistan-vs-england-rawalpindi-test-day-2-scorecard-results-highlights/article66213528.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Pakistan vs England 1st Test Day 2 Live Score Streaming: Get the live cricket score, scorecard and results from 1st Test between PAK vs ENG in Rawalpindi.","content":null,"pubDate":"2022-12-02 12:14:33","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan v England: Abdullah Shafique and Imam Ul-Haq dig in in Rawalpindi - BBC","link":"https://news.google.com/__i/rss/rd/articles/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9zcG9ydC9jcmlja2V0LzYzODI3MjEx0gEuaHR0cHM6Ly93d3cuYmJjLmNvbS9zcG9ydC9jcmlja2V0LzYzODI3MjExLmFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan v England: Abdullah Shafique and Imam Ul-Haq dig in in Rawalpindi  BBCEngland make history in Pakistan by scoring 506-4 on day one with four players hitting centuries  MKFMPakistan v England: first Test, day two – as it happened  The GuardianPakistan v England: Are Ben Stokes' team changing Test cricket forever?  BBCEngland break more records as they rack up 657 all out but First Test vs Pakistan heading for draw with...  The SunView Full coverage on Google News","content":null,"pubDate":"2022-12-02 12:02:27","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Vijay Hazare Trophy Final 2022 Highlights: Saurashtra beats Maharashtra by 5 wickets to win title; SAU 249/5, MAH 248/8","link":"https://sportstar.thehindu.com/cricket/vijay-hazare-trophy-final-live-score-streaming-saurashtra-vs-maharashtra-updates-scorecard-result-highlights/article66211505.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Vijay Hazare Trophy 2022 Final Live Updates: Get the live cricket score updates of SAU vs MAH in Narendra Modi Stadium, Ahmedabad.","content":null,"pubDate":"2022-12-02 11:48:59","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"}]}