{"newsArray":[{"title":"WC Qualifier: அயர்லாந்துக்கு அணிக்கு அதிர்ச்சி அளித்த ஓமன்.. உலககோப்பை தகுதிச்சுற்றில் அபார வெற்றி..!","link":"https://tamil.abplive.com/sports/cricket/world-cup-qualifier-2023-oman-won-against-3-wicket-different-ireland-124097","keywords":["கிரிக்கெட்"],"creator":["சுகுமாறன்"],"video_url":null,"description":"உலககோப்பை தொடரில் முன்னேறுவதற்காக கடைசி 2 இடங்களுக்காக 10 அணிகள் தகுதிச்சுற்று தொடரில் ஆடி வருகின்றனர். முன்னாள் சாம்பியன்களான இலங்கை, வெஸ்ட் இண்டீஸ் ஆகிய அணிகளுடன் ஓமன், நேபாளம், அமெரிக்கா போன்ற அணிகளும் களமிறங்கியுள்ளன. பலமிகுந்த அயர்லாந்து: ஜிம்பாப்வேயில் நடைபெற்று வரும் இந்த தொடரில் புலவாயோ நகரில் நடைபெற்ற நேற்றைய போட்டியில் அயர்லாந்து – ஓமன் அணிகள் நேருக்கு நேர் மோதின. அயர்லாந்து அணி பாகிஸ்தான் அணியையே ஏற்கனவே வீழ்த்திய அனுபவம் கொண்ட அணி என்பதாலும், ஓமனுடன் ஒப்பிடும்போது அயர்லாந்து அணி பலமிகுந்த அணி என்பதாலும் இந்த போட்டியில் அயர்லாந்து எளிதாக வெற்றி பெற்று விடும் என்றே ரசிகர்கள் நினைத்தனர். ஆனால், நடந்ததோ வேறு. டாஸ் வென்ற ஓமன் அணி முதலில் பந்துவீசியது. அயர்லாந்து அணிக்கு மெக்ப்ரைன் – ஸ்டிர்லிங் சிறப்பான தொடக்கம் அளித்தனர். 51 ரன்களை எட்டியபோது ஸ்டிர்லிங் 23 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து களமிறங்கிய கேப்டன் பால்பிரைன் நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடி வந்த மெக்பிரைன் 20 ரன்களில் அவுட்டாக, கேப்டன் பால்பிரைன் 7 ரன்களில் அவுட்டானார். 282 ரன்கள் டார்கெட்: அடுத்து ஹாரி டெக்டர் – டக்கருடன் ஜோடி சேர்ந்தார். களமிறங்கியது முதல் அதிரடியாக டக்கர் 18 பந்தில் 5 பவுண்டரியுடன் 26 ரன்கள் எடுத்த நிலையில் ஆயன்கான் பந்தில் போல்டானார். 107 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த அயர்லாந்து அணிக்காக டெக்டர் – டாக்ரெல் ஜோடி சிறப்பாக ஆடியது. இவர்கள் இருவரும் நிதானமாகவும், நேர்த்தியான பந்துகளை மட்டும் அடித்தும் ஆடினர். இதனால், அயர்லாந்து ஸ்கோர் மெல்ல, மெல்ல ஏறியது. சிறப்பாக ஆடி அரைசதம் அடித்த டெக்டர் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த டெலனி 14 பந்துகளில் அதிரடியாக 20 ரன்கள் எடுக்க, மார்க் அடெய்ர் 15 ரன்களும் எடுத்து ஆட்டமிழக்க மறுமுனையில் டாக்ரெல் கடைசி கட்டத்தில் அதிரடி காட்டினர், இதனால், அயர்லாந்து அணி 50 ஓவர்களில் 7 விக்கெட் இழப்பிற்கு 281 ரன்கள் எடுத்தது. டாக்ரெல் 89 பந்துகளில் 7 பவுண்டரி 2 சிக்ஸருடன் 91 ரன்களுடனும், ஹூமே 12 பந்தில் 1 பவுண்டரியுடன் 15 ரன்கள் எடுத்தும் களத்தில் இருந்தனர். அதிரடி காட்டிய ஓமன்: அடுத்து 285 ரன்கள் என்ற கடின இலக்குடன் களமிறங்கிய ஓமனுக்கு தொடக்கமே அதிர்ச்சி காத்திருந்தது. தொடக்க வீரர் ஜதீந்தர் சிங் 1 ரன்னில் அவுட்டாக அடுத்து ஜோடி சேர்ந்த காஷ்யப் – அகீப் ஜோடி அதிரடியாக ஆடியது. சிறப்பாக ஆடிய இருவரும் அரைசதம் அடித்தனர். அகிப் இலியாஸ் 49 பந்துகளில் 8 பவுண்டரியுடன் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த கேப்டன் மக்சூத் பொறுப்புடன் ஆடினார். மறுமுனையில் சிறப்பாக ஆடிய காஷ்யப் 74 பந்தில் 6 பவுண்டரி 1 சிக்ஸருடன் 72 ரன்கள் எடுத்த நிலையில் அவுட்டானார். பின்னர், கேப்டன் மக்சூத் – நதீம் ஜோடி சிறப்பாக ஆடினர். அணியின் ஸ்கோர் 222 ரன்களை எட்டியபோது கேப்டன் மக்சூத் 59 ரன்களில் ஆட்டமிழந்தார். அவர் 67 பந்துகளில் 4 பவுண்டரி 1 சிக்ஸர் விளாசினார். அடுத்து வந்த ஆயன் கான் 21 பந்தில் 21 ரன்களில் வெளியேற அடுத்து மேற்கொண்டு விக்கெட் விழாமல் ஓமன் வீரர்கள் பார்த்துக்கொண்டனர். அயர்லாந்துக்கு அதிர்ச்சி: கடைசியில் ஓமன் 48.1 ஓவர்களில் 285 ரன்கள் எடுத்து அபார வெற்றி பெற்றது. முகமது நதீம் 53 பந்துகளில் 4 பவுண்டரியுடன் 46 ரன்களுடனும், சோயப் கான் 17 பந்தில் 3 பவுண்டரியுடன் 19 ரன்களுடனும் களத்தில் இருந்தனர். பலமிகுந்த அயர்லாந்து அணியை ஓமன் அணி வீழ்த்தியதை அந்த நாட்டு ரசிகர்கள் கொண்டாடி வருகின்றனர்.   ","content":"உலககோப்பை தொடரில் முன்னேறுவதற்காக கடைசி 2 இடங்களுக்காக 10 அணிகள் தகுதிச்சுற்று தொடரில் ஆடி வருகின்றனர். முன்னாள் சாம்பியன்களான இலங்கை, வெஸ்ட் இண்டீஸ் ஆகிய அணிகளுடன் ஓமன், நேபாளம், அமெரிக்கா போன்ற அணிகளும் களமிறங்கியுள்ளன. பலமிகுந்த அயர்லாந்து: ஜிம்பாப்வேயில் நடைபெற்று வரும் இந்த தொடரில் புலவாயோ நகரில் நடைபெற்ற நேற்றைய போட்டியில் அயர்லாந்து – ஓமன் அணிகள் நேருக்கு நேர் மோதின. அயர்லாந்து அணி பாகிஸ்தான் அணியையே ஏற்கனவே வீழ்த்திய அனுபவம் கொண்ட அணி என்பதாலும், ஓமனுடன் ஒப்பிடும்போது அயர்லாந்து அணி பலமிகுந்த அணி என்பதாலும் இந்த போட்டியில் அயர்லாந்து எளிதாக வெற்றி பெற்று விடும் என்றே ரசிகர்கள் நினைத்தனர். ஆனால், நடந்ததோ வேறு. டாஸ் வென்ற ஓமன் அணி முதலில் பந்துவீசியது. அயர்லாந்து அணிக்கு மெக்ப்ரைன் – ஸ்டிர்லிங் சிறப்பான தொடக்கம் அளித்தனர். 51 ரன்களை எட்டியபோது ஸ்டிர்லிங் 23 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து களமிறங்கிய கேப்டன் பால்பிரைன் நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடி வந்த மெக்பிரைன் 20 ரன்களில் அவுட்டாக, கேப்டன் பால்பிரைன் 7 ரன்களில் அவுட்டானார். googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); 282 ரன்கள் டார்கெட்: அடுத்து ஹாரி டெக்டர் – டக்கருடன் ஜோடி சேர்ந்தார். களமிறங்கியது முதல் அதிரடியாக டக்கர் 18 பந்தில் 5 பவுண்டரியுடன் 26 ரன்கள் எடுத்த நிலையில் ஆயன்கான் பந்தில் போல்டானார். 107 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த அயர்லாந்து அணிக்காக டெக்டர் – டாக்ரெல் ஜோடி சிறப்பாக ஆடியது. இவர்கள் இருவரும் நிதானமாகவும், நேர்த்தியான பந்துகளை மட்டும் அடித்தும் ஆடினர். இதனால், அயர்லாந்து ஸ்கோர் மெல்ல, மெல்ல ஏறியது. சிறப்பாக ஆடி அரைசதம் அடித்த டெக்டர் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த டெலனி 14 பந்துகளில் அதிரடியாக 20 ரன்கள் எடுக்க, மார்க் அடெய்ர் 15 ரன்களும் எடுத்து ஆட்டமிழக்க மறுமுனையில் டாக்ரெல் கடைசி கட்டத்தில் அதிரடி காட்டினர், இதனால், அயர்லாந்து அணி 50 ஓவர்களில் 7 விக்கெட் இழப்பிற்கு 281 ரன்கள் எடுத்தது. டாக்ரெல் 89 பந்துகளில் 7 பவுண்டரி 2 சிக்ஸருடன் 91 ரன்களுடனும், ஹூமே 12 பந்தில் 1 பவுண்டரியுடன் 15 ரன்கள் எடுத்தும் களத்தில் இருந்தனர். அதிரடி காட்டிய ஓமன்: அடுத்து 285 ரன்கள் என்ற கடின இலக்குடன் களமிறங்கிய ஓமனுக்கு தொடக்கமே அதிர்ச்சி காத்திருந்தது. தொடக்க வீரர் ஜதீந்தர் சிங் 1 ரன்னில் அவுட்டாக அடுத்து ஜோடி சேர்ந்த காஷ்யப் – அகீப் ஜோடி அதிரடியாக ஆடியது. சிறப்பாக ஆடிய இருவரும் அரைசதம் அடித்தனர். அகிப் இலியாஸ் 49 பந்துகளில் 8 பவுண்டரியுடன் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த கேப்டன் மக்சூத் பொறுப்புடன் ஆடினார். மறுமுனையில் சிறப்பாக ஆடிய காஷ்யப் 74 பந்தில் 6 பவுண்டரி 1 சிக்ஸருடன் 72 ரன்கள் எடுத்த நிலையில் அவுட்டானார். பின்னர், கேப்டன் மக்சூத் – நதீம் ஜோடி சிறப்பாக ஆடினர். அணியின் ஸ்கோர் 222 ரன்களை எட்டியபோது கேப்டன் மக்சூத் 59 ரன்களில் ஆட்டமிழந்தார். அவர் 67 பந்துகளில் 4 பவுண்டரி 1 சிக்ஸர் விளாசினார். அடுத்து வந்த ஆயன் கான் 21 பந்தில் 21 ரன்களில் வெளியேற அடுத்து மேற்கொண்டு விக்கெட் விழாமல் ஓமன் வீரர்கள் பார்த்துக்கொண்டனர். அயர்லாந்துக்கு அதிர்ச்சி: கடைசியில் ஓமன் 48.1 ஓவர்களில் 285 ரன்கள் எடுத்து அபார வெற்றி பெற்றது. முகமது நதீம் 53 பந்துகளில் 4 பவுண்டரியுடன் 46 ரன்களுடனும், சோயப் கான் 17 பந்தில் 3 பவுண்டரியுடன் 19 ரன்களுடனும் களத்தில் இருந்தனர். பலமிகுந்த அயர்லாந்து அணியை ஓமன் அணி வீழ்த்தியதை அந்த நாட்டு ரசிகர்கள் கொண்டாடி வருகின்றனர்.","pubDate":"2023-06-20 04:02:06","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/20/64f4773a43e6fe8a453d6910b2d3c9751687232946064102_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Tamil"},{"title":"Ashes Test: இறுதிக்கட்டத்தில் ஆஷஸ்.. 281 ரன்களை எட்டிப்பிடிக்குமா ஆஸ்திரேலியா..? வெற்றி பெறுமா இங்கிலாந்து..?","link":"https://tamil.abplive.com/sports/cricket/ashes-test-2023-australia-have-281-runs-target-against-england-know-full-details-124091","keywords":["கிரிக்கெட்"],"creator":["சுகுமாறன்"],"video_url":null,"description":"பர்மிங்காமில் நடைபெற்று வரும் ஆஷஸ் தொடரின் முதல் டெஸ்ட் போட்டி விறுவிறுப்பான இறுதிக்கட்டத்தை எட்டியுள்ளது. முதல் இன்னிங்சில் ஜோ ரூட்டின் சதத்தால் இங்கிலாந்து 393 ரன்களை குவிக்க, ஆஸ்திரேலியா கவாஜா சதத்தால் 383 ரன்களை குவிக்க 2வது இன்னிங்சில் இமாலய இலக்கை நிர்ணயிக்கும் நோக்கில் களமிறங்கிய இங்கிலாந்து அணி 4ம் நாளான நேற்று ஆட்டத்தை தொடங்கியது. 273 ரன்களுக்கு ஆல் அவுட்: ஒல்லி போப்பும், ஜோ ரூட்டும் ஆட்டத்தை தொடர்ந்தனர். ஒல்லி போப் 14 ரன்களில் அவுட்டாக அடுத்து வந்த ஹாரி ப்ரூக் – ஜோ ரூட் ஜோடி நிதானமாக ஆடியது. அரைசதம் அடிப்பார் என்று எதிர்பார்க்கப்பட்ட ஜோ ரூட் 46 ரன்களில் அவுட்டானார். அவர் ஆட்டமிழந்த சிறிது நேரத்தில் 46 ரன்களில் ஆட்டமிழக்க 150 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த இங்கிலாந்து அணிக்கு கேப்டன் பென்ஸ்டோக்ஸ் சிறப்பாக ஆடினார். அவருக்கு ஜானி பார்ஸ்டோ நல்ல ஒத்துழைப்பு அளித்தார். பார்ஸ்டோ 39 பந்துகளில் 3 பவுண்டரியுடன் 20 ரன்களை எடுத்த நிலையில் அவுட்டாக, அடுத்து வந்த மொயின் அலி நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடிய கேப்டன் ஸ்டோக்ஸ் 66 பந்தில் 5 பவுண்டரியுடன் 43 ரன்கள் எடுத்த நிலையில் அவுட்டானார். கடைசியில் ராபின்சன் 27 ரன்கள் எடுக்க இங்கிலாந்து அணி 66.2 ஓவர்களில் அனைத்து விக்கெட்டுகளையும் இழந்து 273 ரன்கள் எடுத்தது. வெற்றி பெறப்போவது யார்? இதையடுத்து, ஆஸ்திரேலிய அணிக்கு 281 ரன்களை இங்கிலாந்து அணி இலக்காக நிர்ணயித்தது. இதையடுத்து, இந்த மைதானத்தில் 281 ரன்கள் என்பது சற்று கடினமானதே ஆகும். இதைத்தொடர்ந்து ஆட்டத்தை தொடங்கிய உஸ்மான் கவாஜா – டேவிட் வார்னர் ஜோடி நிதானமாக ஆட்டத்தை தொடங்கினர். கடந்த இன்னிங்சில் சொதப்பிய வார்னர் 57 பந்துகளில் 4 பவுண்டரியுடன் 36 ரன்கள் எடுத்த நிலையில் ஆட்டமிழந்தார்.  அடுத்து மிகவும் எதிர்பார்க்கப்பட்ட லபுஷேனே களமிறங்கினார். அவர் 15 பந்துகளில் 3 பவுண்டரி விளாசிய நிலையில் 13 ரன்கள் எடுத்திருந்தபோது பிராட் பந்தில் அவுட்டானார். அடுத்து வந்த ஸ்டீவ் ஸ்மித் இந்த இன்னிங்சில் அசத்துவார் என்று எதிர்பார்த்த ரசிகர்களுக்கு ஏமாற்றமே மிஞ்சியது. 13 பந்துகளில் 6 ரன்கள் எடுத்திருந்த ஸ்டீவ் ஸ்மித்தை பிராட் அவுட்டாக்கினார். நெருக்கடியில் ஆஸ்திரேலியா? நேற்றைய ஆட்ட நேர முடிவில் 30 ஓவர்களில் 3 விக்கெட்டுகளை இழந்து ஆஸ்திரேலிய அணி 107 ரன்கள் எடுத்திருந்தது. கவாஜா 34 ரன்களுடனும், போலந்து 13 ரன்களுடனும் களத்தில் உள்ளனர். கடைசி நாளான இன்று ஆஸ்திரேலியாவின் வெற்றிக்கு 174 ரன்கள் தேவைப்படுகிறது. முதல் டெஸ்ட் போட்டியை வெற்றியுடன் தொடங்க இங்கிலாந்திற்கு இன்னும் 7 விக்கெட்டுகள் தேவைப்படுகிறது. முக்கிய விக்கெட்டுகளான டேவிட் வார்னர், ஸ்டீவ் ஸ்மித், லபுஷேனே அவுட்டாகியுள்ள நிலையில் ஆஸ்திரேலியா நெருக்கடிக்கு ஆளாகியுள்ளது. அந்த அணியில் ட்ராவிஸ் ஹெட், கிரீன், கேரி, கம்மின்ஸ் சிறப்பாக ஆட வேண்டிய கட்டாயத்தில் உள்ளனர். கடைசி நாள் பரப்பான கட்டத்தை எட்டியுள்ளதால் இரு நாட்டு ரசிகர்களும் வெற்றிபெற போவது யார் என்பதை காண ஆர்வமுடன் உள்ளனர். மேலும் படிக்க: WC Qualifiers: வெஸ்ட் இண்டீசுக்கு எதிராக சதமடித்த அமெரிக்க வீரர்.. உலகக்கோப்பை தகுதிச்சுற்றில் அசத்தல்..! மேலும் படிக்க: IND vs WI: புஜாராவுக்கு இடமில்லையா..? அவருக்கு பதிலாக இந்திய அணியில் யார்..? வெஸ்ட் இண்டீஸ் தொடர் ஒரு பார்வை!","content":"பர்மிங்காமில் நடைபெற்று வரும் ஆஷஸ் தொடரின் முதல் டெஸ்ட் போட்டி விறுவிறுப்பான இறுதிக்கட்டத்தை எட்டியுள்ளது. முதல் இன்னிங்சில் ஜோ ரூட்டின் சதத்தால் இங்கிலாந்து 393 ரன்களை குவிக்க, ஆஸ்திரேலியா கவாஜா சதத்தால் 383 ரன்களை குவிக்க 2வது இன்னிங்சில் இமாலய இலக்கை நிர்ணயிக்கும் நோக்கில் களமிறங்கிய இங்கிலாந்து அணி 4ம் நாளான நேற்று ஆட்டத்தை தொடங்கியது. 273 ரன்களுக்கு ஆல் அவுட்: ஒல்லி போப்பும், ஜோ ரூட்டும் ஆட்டத்தை தொடர்ந்தனர். ஒல்லி போப் 14 ரன்களில் அவுட்டாக அடுத்து வந்த ஹாரி ப்ரூக் – ஜோ ரூட் ஜோடி நிதானமாக ஆடியது. அரைசதம் அடிப்பார் என்று எதிர்பார்க்கப்பட்ட ஜோ ரூட் 46 ரன்களில் அவுட்டானார். அவர் ஆட்டமிழந்த சிறிது நேரத்தில் 46 ரன்களில் ஆட்டமிழக்க 150 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த இங்கிலாந்து அணிக்கு கேப்டன் பென்ஸ்டோக்ஸ் சிறப்பாக ஆடினார். அவருக்கு ஜானி பார்ஸ்டோ நல்ல ஒத்துழைப்பு அளித்தார். பார்ஸ்டோ 39 பந்துகளில் 3 பவுண்டரியுடன் 20 ரன்களை எடுத்த நிலையில் அவுட்டாக, அடுத்து வந்த மொயின் அலி நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடிய கேப்டன் ஸ்டோக்ஸ் 66 பந்தில் 5 பவுண்டரியுடன் 43 ரன்கள் எடுத்த நிலையில் அவுட்டானார். கடைசியில் ராபின்சன் 27 ரன்கள் எடுக்க இங்கிலாந்து அணி 66.2 ஓவர்களில் அனைத்து விக்கெட்டுகளையும் இழந்து 273 ரன்கள் எடுத்தது. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); வெற்றி பெறப்போவது யார்? இதையடுத்து, ஆஸ்திரேலிய அணிக்கு 281 ரன்களை இங்கிலாந்து அணி இலக்காக நிர்ணயித்தது. இதையடுத்து, இந்த மைதானத்தில் 281 ரன்கள் என்பது சற்று கடினமானதே ஆகும். இதைத்தொடர்ந்து ஆட்டத்தை தொடங்கிய உஸ்மான் கவாஜா – டேவிட் வார்னர் ஜோடி நிதானமாக ஆட்டத்தை தொடங்கினர். கடந்த இன்னிங்சில் சொதப்பிய வார்னர் 57 பந்துகளில் 4 பவுண்டரியுடன் 36 ரன்கள் எடுத்த நிலையில் ஆட்டமிழந்தார். அடுத்து மிகவும் எதிர்பார்க்கப்பட்ட லபுஷேனே களமிறங்கினார். அவர் 15 பந்துகளில் 3 பவுண்டரி விளாசிய நிலையில் 13 ரன்கள் எடுத்திருந்தபோது பிராட் பந்தில் அவுட்டானார். அடுத்து வந்த ஸ்டீவ் ஸ்மித் இந்த இன்னிங்சில் அசத்துவார் என்று எதிர்பார்த்த ரசிகர்களுக்கு ஏமாற்றமே மிஞ்சியது. 13 பந்துகளில் 6 ரன்கள் எடுத்திருந்த ஸ்டீவ் ஸ்மித்தை பிராட் அவுட்டாக்கினார். நெருக்கடியில் ஆஸ்திரேலியா? நேற்றைய ஆட்ட நேர முடிவில் 30 ஓவர்களில் 3 விக்கெட்டுகளை இழந்து ஆஸ்திரேலிய அணி 107 ரன்கள் எடுத்திருந்தது. கவாஜா 34 ரன்களுடனும், போலந்து 13 ரன்களுடனும் களத்தில் உள்ளனர். கடைசி நாளான இன்று ஆஸ்திரேலியாவின் வெற்றிக்கு 174 ரன்கள் தேவைப்படுகிறது. முதல் டெஸ்ட் போட்டியை வெற்றியுடன் தொடங்க இங்கிலாந்திற்கு இன்னும் 7 விக்கெட்டுகள் தேவைப்படுகிறது. முக்கிய விக்கெட்டுகளான டேவிட் வார்னர், ஸ்டீவ் ஸ்மித், லபுஷேனே அவுட்டாகியுள்ள நிலையில் ஆஸ்திரேலியா நெருக்கடிக்கு ஆளாகியுள்ளது. அந்த அணியில் ட்ராவிஸ் ஹெட், கிரீன், கேரி, கம்மின்ஸ் சிறப்பாக ஆட வேண்டிய கட்டாயத்தில் உள்ளனர். கடைசி நாள் பரப்பான கட்டத்தை எட்டியுள்ளதால் இரு நாட்டு ரசிகர்களும் வெற்றிபெற போவது யார் என்பதை காண ஆர்வமுடன் உள்ளனர். மேலும் படிக்க: WC Qualifiers: வெஸ்ட் இண்டீசுக்கு எதிராக சதமடித்த அமெரிக்க வீரர்.. உலகக்கோப்பை தகுதிச்சுற்றில் அசத்தல்..! மேலும் படிக்க: IND vs WI: புஜாராவுக்கு இடமில்லையா..? அவருக்கு பதிலாக இந்திய அணியில் யார்..? வெஸ்ட் இண்டீஸ் தொடர் ஒரு பார்வை!","pubDate":"2023-06-20 03:15:30","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/20/1d5552444a7f5e6d14b6d9ee9a5206bc1687230509158102_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Tamil"},{"title":"On Stokes' \"Umbrella Field\" For Khawaja, Ponting's Reaction Says It All","link":"https://sports.ndtv.com/cricket/on-ben-stokes-umbrella-field-for-usman-khawaja-ricky-pontings-reaction-says-it-all-4133471","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes' \"umbrella field\" setting for Usman Khawaja even caught Australia great Ricky Ponting off-guard.","content":"The first Ashes Test between Australia and England is off to a flier, with every single day of the Edgbaston encounter unfolding new incidents to talk about. England skipper Ben Stokes ' 'umbrella-like' field to pile the pressure on Australia batter Usman Khawaja became a huge talking-point on social media. As fans and multiple former cricketers hailed Stokes' captaincy, Australia great Ricky Ponting also gave a million-dollar reaction to Stokes' tactical decision, admitted that he had never seen anything like that before. \"I don't think I've ever seen a field like that in Test cricket before. There was just an umbrella of fielders around in front of the batsman's face. And it was all about bowling a couple of slower balls and being able to bowl a yorker. And sure enough, Khawaja used his feet, gave himself some room, gave up his stumps, and the yorker knocked his off stump out of the ground,\" Ponting told the ICC . \"It's fantastic stuff. It's really refreshing for the Test game to see a team play this way and a captain happy to try everything he possibly can.\" Further lauding Stokes' captaincy, Ponting lauded the England skipper's willingness to explore all options of picking up a wicket, pressing every little opportunity he senses to unnerve the batter. \"It's hard to keep up with them all, he's making a change almost every ball, which is great, it's proactive captaincy. He's always trying to move the game forward, he's looking at any little way that he possibly can to pick up a wicket and change the momentum of the game,\" Ponting said. What a ball from Robinson, Fantastic by Stokes as a captain. End of an incredible knock from Khawaja. pic.twitter.com/8Bz5ejFAvj \"With Khawaja's innings, I'd hate to try and count how many times he changed the field for him and how many bowling changes and tactical changes he made to try and get Khawaja out - and then it finally worked,\" the ex-Australia captain said. Australia were bowled out for 386 while chasing England's first innings score of 393. By the end of Day 3, Australia had picked up two English wickets, with the score reading 28/2 at the end of 10.3 overs.","pubDate":"2023-06-20 02:40:31","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Marnus Labuschagne is called a cheat by English fans after claiming he took dodgy Ashes catch","link":"https://247newsaroundtheworld.com/sports/marnus-labuschagne-is-called-a-cheat-by-english-fans-after-claiming-he-took-dodgy-ashes-catch/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World First it was Cameron Green, now Marnus Labuschagne is called a cheat… The post Marnus Labuschagne is called a cheat by English fans after claiming he took dodgy Ashes catch appeared first on 247 News Around The World.","content":"First it was Cameron Green, now Marnus Labuschagne is called a cheat by English fans after claiming he took a dodgy catch to dismiss Ollie Robinson Marnus Labuschagne called a cheat by English fans Labuschagne claimed a catch where ball touched grass Fans chanted ‘Same old Aussies, always cheating’ By James Cooney For Daily Mail Australia and Scott Bailey For Australian Associated Press Published: 22:14 EDT, 19 June 2023 | Updated: 22:14 EDT, 19 June 2023 Marnus Labuschagne has been labelled a cheat by English cricket fans after claiming he took a stunning catch to remove Ollie Robinson during the opening Ashes Test at Edgbaston. The fired-up Birmingham crowd gave it to the Aussies on day four of the match, and Cameron Green also copped it from the Barmy Army on day three after taking a remarkable catch to dismiss Ben Duckett off the bowling of Scott Boland. Even though Green’s catch was reviewed and given out, the crowd chanted: ‘Same old Aussies, always cheating.’ As England looked for runs on day four, it was Labuschagne’s turn to get a grilling when he dived forward in an attempt to take a one-handed grab after tail-ender Ollie Robinson gloved a Josh Hazlewood delivery into the air. Labuschagne was slammed by English cricket fans for celebrating a non-catch that he claimed had dismissed Ollie Robinson (pictured) Replays showed that the ball had scraped the turf (pictured) – and the fans weren’t shy when it came to letting Labuschagne know all about it Labuschagne celebrated immediately, but the on-field umpires sent the decision upstairs and it didn’t take long for the third official to confirm the catch was not genuine. Replays showed that the Aussie took the ball cleanly – but the ball had scraped the turf. Unsurprisingly, the crowd weren’t happy and chanted ‘Same old Aussies, always cheating’ around the ground – the same song they sang to Green and have used at other points in the tense contest. Australia need 174 runs and England seven wickets to secure a famous Ashes victory after Stuart Broad’s heroics ensured the enthralling series opener would enter day five with everything to play for. Set 281 to win, Australia slumped from 0-61 to 3-107 at stumps, after David Warner, Marnus Labuschagne and Steve Smith all fell in the space of eight dramatic overs late on Monday. Broad was the chief destroyer for England, getting the world’s two top-ranked batsmen caught behind with Labuschagne nicking to an outswinger and Smith an inswinger. That has left-first innings centurion Usman Khawaja as Australia’s key man at Edgbaston, still at the crease on 34no with nightwatchman Scott Boland at the other end on 13. ‘It probably wasn’t our greatest 40 minutes to lose Marnus, Steve and Davey but you have to give credit where it’s due, England’s bowled well,’ Australia spinner Nathan Lyon said. The rowdy Birmingham crowd weren’t happy with the dubious catch and chanted ‘Same old, Aussies always cheating’ around the ground Australia need 174 runs and England seven wickets to secure a famous Ashes victory ‘But I’m backing our boys, I’m confident our boys can go out there and bat well. ‘It’s set up to be a thrilling Test match and it’s been one hell of a way to start the series.’ Rain is forecast for Tuesday morning in Birmingham and is due to clear by lunchtime, leaving all results still on the table. In a Test where no team has truly been in control, Australia briefly had the upper hand on Monday evening. Warner looked as good as he has at any point in the past three years as he cut and pulled his way to 36 on a wicket lacking pace. But when he edged off to Ollie Robinson on 36, the door was open for Broad to send the Edgbaston crowd into overdrive as he delivered on his plan to take down Labuschagne (13) and Smith (6) this summer. ‘Obviously they are No.1 and No.2 in the world, they know what they are doing.’ Broad said. ‘One thing we know as a bowling group, you have to put them under pressure early. If they get to 30 or 40 they don’t give it away cheaply. ‘Today has been one of those days that sums up Ashes cricket. ‘You think you’re getting ahead of the game and you lose a wicket. And the Aussies would have thought the same as well.’ Share or comment on this article: Post source: Daily mail","pubDate":"2023-06-20 02:40:03","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"“I wanted closure”: Ashwin Finally Opens Up About His ‘Explosive Tweet’ After WTC final","link":"https://www.cricketcountry.com/news/i-wanted-closure-ashwin-finally-opened-up-about-explosive-tweet-after-wtc-final-1099483","keywords":["News","Ashwin","India vs Australia","WTC Final"],"creator":["CricketCountry Staff"],"video_url":null,"description":"Weeks after Australia won WTC final, Ashwin who was not a part of India's playing XI, opened up after his tweet said he needed closure.","content":"Weeks after Australia won WTC final, Ashwin who was not a part of India's playing XI, opened up after his tweet said he needed closure. More than a week ago, Australia became World Test Champions after defeating India in the WTC final at the Ovals in London. Many experts and ex-cricketers slammed Rohit Sharma and coach Rahul Dravid's team selection. India's star pacer Umesh Yadav was picked in place of World No. 1 test bowler Ravichandran Ashwin in the playing XI. Right after the Baggy Greens lifted the trophy, Ashwin put out an explosive tweet expressing his disappointment over India's loss. \"Congratulations Australia on winning this #WTCFinal and closing out this cycle of test cricket. It is disappointing to end up on the wrong side of things, nevertheless it was a great effort over the last 2 years or so to get here in the first place. Amidst all the chaos and scathing assessments, i feel it's very important to acknowledge all my team mates who played in this cycle and most importantly the coaching and support staffs who have held on like a rock of support,\" he had tweeted. Congratulations Australia on winning this and closing out this cycle of test cricket. It is disappointing to end up on the wrong side of things, nevertheless it was a great effort over the last 2 years or so to get here in the first place. Amidst all the chaos and Ashwin ?? (@ashwinravi99) Ashwin Reveals The Reason Behind His Tweet After WTC Final Finally, Ashwin opened up about the tweet that he posted right after the WTC final. He revealed that it was just a closure for his omission from the WTC final squad. He further said that the fans were giving him sympathy, which he was not able to accept anymore. \"I have got no sympathy for my journey. It's very easy for me to go back and say, okay, this didn't happen for me or something happened for him. I don't give myself one second of sympathy. That's why I put that tweet because I wanted closure. I hated the fact that people are giving me sympathy, I just couldn't take it anymore\", Ashwin told Indian Express. \"In this social media age, you don't play and sometimes you are bigger than if you had played the game, right? People are talking, 'if he had played we would have won'. I am not sure if I had played, we would have won. I would have given my best and I definitely think I gave myself the best opportunity to succeed there. I also think I earned my stripes. That's all I can do. But the moment it got done, I just wanted to move on and focus on the TNPL for Dindigul Dragons,\" he concluded. Also Read LIVE SCOREBOARD","pubDate":"2023-06-20 02:39:10","image_url":"https://www.cricketcountry.com//wp-content/uploads/2023/06/Collage-Maker-20-Jun-2023-08-04-AM-5925.jpg","source_id":"cricketcountry","category":["sports"],"country":["india"],"language":"english"},{"title":"\"Out Cricket Is Bigger\": Pakistan Legend's Bold Stance On ODI WC Scenario","link":"https://sports.ndtv.com/cricket/out-cricket-is-bigger-pakistan-legends-bold-stance-on-odi-world-cup-scenario-4132870","keywords":null,"creator":null,"video_url":null,"description":"Pakistan legend Javed Miandad doesn't think the PCB should send its team to India for ODI World Cup 2023 unless the BCCI sends its team to Pakistan.","content":"Batting great Javed Miandad spewed fresh venom at India, saying Pakistan should not travel to the neighbouring country for matches, including this year's ICC ODI World Cup, until the BCCI agrees to send its team to his nation first. As per the draft schedule prepared by the ICC, Pakistan are scheduled to play India in the blockbuster World Cup clash at the Narendra Modi stadium in Ahmedabad on October 15. But the 66-year-old former captain feels it is now India's time to reciprocate by touring Pakistan. \"Pakistan has been to India in 2012 and even in 2016 now it is the turn of the Indians to come here,\" Miandad said. \"If I had to make a decision I would never go to India to play any match, even the World Cup. We are always ready to play them (India) but they never respond in the same manner. \"Pakistan cricket is bigger...we are still producing quality players. So I don't think even if we don't go to India it will make any difference to us,\" he added. پاکستان کو ورلڈ کپ کیلئے بھارت نہیں جانا چاہیئے... مودی نے کرکٹ کیساتھ بھارت کو بھی تباہ کردیا ہے، جاوید میانداد #Pakistan #India #AsiaCup2023 #Cricket pic.twitter.com/kpmSJkEsqs India last visited Pakistan in 2008 for the 50-over Asia Cup. Since then bilateral cricket ties were suspended due to long-standing geo-political tensions between the two nations. Miandad feels sports not be mixed with politics. \"I always say one can't choose its neighbours, so it is better to live by cooperating with each other. And I have always said cricket is a sport which brings people closer to each other and can remove misunderstandings and grievances between countries,\" he said. Miandad's fresh attack came after Pakistan were forced to host the upcoming Asia Cup in a hybrid model with India playing all their matches in Sri Lanka. This decision didn't go down well with Miandad, a vocal critic of India. \"It was on the cards that they would again not send their team to Pakistan for the Asia Cup so it is time we also take a strong stand now,\" he said. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Advertisement","pubDate":"2023-06-20 02:24:06","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"\"My Father Goes Through Twice The Trauma I Do\": Ravichandran Ashwin","link":"https://sports.ndtv.com/cricket/my-father-goes-through-twice-the-trauma-i-do-ravichandran-ashwin-4132822","keywords":null,"creator":null,"video_url":null,"description":"Often branded as an 'overthinker', Ravichandran Ashwin spoke about the 'trauma' he and his family have gone through over the years.","content":"One of the greats of the modern game, Ravichandran Ashwin has had quite a journey. From being central to India's plans across formats to becoming a specialist, before eventually returning to white-ball cricket, the off-spinner has had a roller-coaster of a ride. After Ashwin was snubbed for a spot in India's playing XI for the World Test Championship final against Australia, his absence became one of the biggest talking points on social media. The veteran cricketer, who has found himself in such positions on multiple occasions, opened up about the 'trauma' he and his family have gone through over the years and the 'overthinker' tag that has been given to him. When it comes to overseas Tests, Ashwin isn't one of the first names on the teamsheets. In the WTC final against Australia, it was Ravindra Jadeja who was preferred by the Indian team for the sole spinner's spot. There's a perception that Ashwin tends to 'overthink' on certain occasions, a mindset that has worked against him multiple times. In a chat with the Indian Express , Ashwin said that the tag of being an 'overthinker' was created to work against him. \"A lot of people marketed me and positioned me that I am an overthinker. A person who will get 15-20 matches on the go doesn't have to be mentally overthinking. A person who knows that they will get only two games will be traumatised and will be overthinking because it's my job. It's my journey. So this is what suits me,\" he said. \"If somebody is going to tell me, 'you're going to play 15 matches, you will be looked after, you will be this, you are responsible for players, you are in the leadership role, I won't be overthinking. Why would I? It's unfair to actually say somebody's an overthinker because that person's journey is his own. And nobody has a right or business to do that,\" he further said. On the 'overthinker' tag, Ashwin said that a lot of things have been said about him whenever the talk of taking up a 'leadership role' has come his way. \"It was created to work against me, right? And as I said, there have been statements that people have made all along when leadership question has come my way, there have been people who are been out there telling, my name is not the first name on the sheet when India tour abroad. \"Whether that name is first on the sheet or not is something I can't control. If I earned it, it's got to be there and that's my belief. As I said, I have no complaints, I have no time to sit back and throw punches or regret or anything. I have no regrets about anyone,\" he explained. During the interview, Ashwin also said that his family, especially his father, goes through twice the trauma he does whenever it comes to such affairs. \"The moment, the final finished I put out a tweet because I realised one thing is that I need closure. The moment I get the closure I can move on. There is no time to hang around. I have understood life a lot better now. \"The more I see it, the kind of trauma toll it takes on my family is incredible. My father has a heart problem and other issues. Every single game, every single day, something happens, he will call me. He is stressed. It's very easy for me to go out and play because it is still in my control. For my father, it is not and he goes through double of what I do. So looking at this in hindsight, everybody on the outside is irrelevant,\" Ashwin explained.","pubDate":"2023-06-20 02:20:55","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Ricky Ponting lands ruthless clapback on overexcited Kevin Pietersen claim over Joe Root’s Ashes innings","link":"https://7news.com.au/sport/cricket/ricky-ponting-lands-ruthless-clapback-on-overexcited-kevin-pietersen-claim-over-joe-roots-ashes-innings-c-11032505","keywords":null,"creator":["Digital Staff"],"video_url":null,"description":"The Australian legend maintained a straight face for his former adversary’s speech - but he was quick to fire back.","content":"Already arguably the most universally loved commentator in Australian sport, Ricky Ponting has earned even more plaudits from Aussie fans after landing a ruthless clapback at Kevin Pietersen during the Ashes on UK television. Pietersen was laying on the love for his former teammate Joe Root and claimed the England batsman’s aggressive start to day four had Australia running scared. Watch, Stream & Catch Up with Australia's Home of Cricket on There was only one problem: Root undid all his groundwork when he danced Nathan Lyon and was out stumped on 46, leaving England on 4-129 with a nervous lead of just 136 runs. “He just owned the game,” Pietersen told Sky Sports of Root. “He ran the game, he was pure quality and he just owned that space. And just had all this lot scratching their heads going ‘what do we do?’” Ponting maintained a straight face while Pietersen spoke but showed a quick wit afterwards. “Well he’s out now, he got 40,” the ex-Australian captain said bluntly. Pietersen, for his part, took the blow in his stride, as the pair laughed and Ponting moved on. Meanwhile, Ponting opted against entering a public slanging match with Ollie Robinson as the fallout from the England quick’s fiery send-off continued. Robinson attracted headlines on Sunday when he first swore at Usman Khawaja after dismissing him for 141, before doubling down on the antics post-play. Included in Robinson’s claims were that Australia now could not handle sledging, after pointing at the behaviour of past players such as Ponting as an example. The former captain indicated on Monday that he had initially been agitated by the comments, firing off messages in a commentary WhatsApp group. “If I had been able to catch up with Ollie last night, things might have been vastly different to what they were this morning, let’s put it that way,” Ponting said. The former Australian captain did expect Australia’s current team to remind Robinson of his actions. He also questioned whether multiple England players had got ahead of themselves in the past year through the Bazball era. England have been particularly brash in recent days, with Robinson and assistant coach Paul Collingwood accusing Pat Cummins’ team of defensive cricket. Robinson also stated on Sunday that Australia had three No.11s, while Harry Brook was bullish before the match about taking down Australia’s attack. “That will be stored up,” Ponting said of the Robinson incident. “A lot of the things we are talking about here with what Harry Brook has had to say and Ollie Robinson has had to say. “A lot of the cricket these guys have played hasn’t been against this hard-nosed Australian cricket team. “It’s one thing to go out and say what they are saying. In Ashes cricket, names and reputations are made or not. “Some of these English players have had terrific starts to their careers. But we will find out more about them as this series goes on.” Cummins had declared before the series this was an Australian team no longer interested in instigating sledging, after their overhaul following the 2018 ball-tampering scandal. “You’ve seen over the past couple of years our team is pretty chilled out there,” he said. “We’re quite a confident bunch but we’re not overly loud or in your face. I think you’ve seen our personalities reflected out on the field. “I am sure there is going to be emotions at times, but I would be surprised if that bubbled over like maybe it has in the past.”","pubDate":"2023-06-20 00:48:07","image_url":"https://images.7news.com.au/publication/C-11032505/c50a86a47cdc502f0507296874b00c4fbe6f3989-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jude Bellingham won’t crash and burn at Real Madrid like Gareth Bale – he’s learning from Welshman’s mistakes","link":"https://www.thesun.ie/sport/football/10907766/jude-bellingham-gaeth-bale-real-madrid-transfer-kidd-column/","keywords":["Football","Sport","Champions League","Real Madrid transfer news"],"creator":["Dave Kidd"],"video_url":null,"description":null,"content":"GARETH BALE collected five Champions League winner’s medals with Real Madrid, scoring in two finals, including an extraordinary bicycle kick against Liverpool in 2018. So you’d be hard-pressed to describe the Welshman’s nine-year stint at the Bernabeu as any sort of failure. Yet Bale left the Spanish capital largely unloved. Chiefly because he made it clear Real were not his favourite team and that football wasn’t even his favourite sport. Bale was ‘The Golfer’, who loved playing for Wales, but never Real — a remote figure who never embraced the language or culture. A man who never seemed to fully appreciate what it was to play for the world’s most famous club and who outstayed his welcome as a bench-warming trouserer of fortunes. As Jude Bellingham becomes the latest British footballer to roll up at the Bernabeu, it is clear the England midfielder is learning from Bale’s mistakes. This country’s most expensive footballer is still a gangly Brummie teenager — he turns 20 next week — and so you might have imagined him to look a little awkward at last week’s media unveiling. Especially as he was inheriting Zinedine Zidane’s famed No 5 shirt and had just signed his six-year contract in a room with “14 European Cups staring at me”. But while no footballer is judged primarily on his media performances, Bellingham’s appearance was a triumph. He was humble and gracious, likeable and amusing. CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 He blew sunshine up a prominent Spanish-based English journalist — a genuine rather than cynical move — and had a demanding local press corps eating out of his hand. “A Galactico for the next ten years,” was one newspaper’s prediction. But ‘Galactico’ became a byword for an era when Real stockpiled famous, experienced players with commercial clout, while never producing a balanced team and rarely winning anything. Bellingham is part of an exciting Real rebuild centring on youth. Eduardo Camavinga, 20, Aurelien Tchouameni, 23, and Bellingham will eventually replace the midfield triangle of Luka Modric , 37, Toni Kroos, 33, and the already-departed 31-year-old Casemiro . Kylian Mbappe, 24, may well arrive too because Real remains the des res of the world’s best young players, whatever the Premier League’s lure. It helps that Bellingham had already illuminated a World Cup and spent three years at Borussia Dortmund , sometimes captaining a mighty club in front of the Westfalenstadion’s vast Yellow Wall. Those kind of experiences tend to knock the shyness out of a kid. In Dortmund, he befriended old club legends, sought their advice and became part of the fabric, rather than just another foreign player passing through. In Madrid, Bellingham has hired an FA player-liaison officer to work for him full-time as he settles in — a move which suggests he wants to impress off the pitch too. Many are surprised Bellingham chose Real, rather than a move back to England. Yet those close to him insist this has always been his dream. As with many of his generation, his formative experiences of watching football came during the peak years of the Messi-Ronaldo El Clasicos. There would have been far more replica Real Madrid and Barcelona shirts around the playing fields of Birmingham than those of Liverpool or the Manchester clubs. The fixtures for the next LaLiga season are released tomorrow and Bellingham will be eagerly seeking out the dates when he will face champions Barca and become part of that grand and bitter rivalry. Bellingham, who left Birmingham City at 16, has never played in the Premier League and is unlikely to do so until he is in his mid-to-late 20s. That is remarkable for the finest English footballer of his generation during an era of supreme Premier League financial dominance. It does, though, suggest a bravery, curiosity, and independence of thought which will serve him well. There should still be some caution. Bellingham is a high-mileage player, with a phenomenal 200 senior appearances in club and international football as a teenager. He has missed England’s last two matches with a long-standing knee problem and players who play too much, too early, often fail to last the distance. But like Bale before him, Bellingham has the talent, adaptability, attitude and physique to become a major success in Madrid. He might not end up with five Champions League winner’s medals, but Bellingham is very likely to discover the affection and acceptance which eluded Bale. MARTIN TYLER may have been the voice of English football’s bold new era of world domination, as Sky’s lead commentator since the Premier League’s inception 31 years ago. But one of the chief reasons why he was such a success was his strong bond with the game’s roots. Tyler delayed his move into broadcast journalism by several years be- cause he was a useful centre-forward for Corinthian Casuals. And he continued to coach at non-league sides such as Woking, the club he has always supported, and Dartford while calling matches in the world’s richest league. This brought him authenticity to go with his eloquence. Tyler — who is leaving Sky aged 77 but insisting he has not retired from commentating — will be missed. GARY O’NEIL and Bournemouth felt a perfect match — understated, overachieving and entertaining. And while there have been some savagely unexpected managerial sackings which have worked out well for clubs, O’Neil’s dismissal — after he saved the club from relegation — suggests a new American ownership with serious delusions of grandeur. WHEN Spurs appointed Ange Postecoglou as their new manager, Celtic fans told us to expect a treat when watching the Aussie’s revolutionary ‘Angeball’ approach. Turns out Postecoglou expects his players to run around a lot, win the ball back quickly and try to score a lot of goals — much like every other elite coach. Which brings us to Kai Havertz — the Chelsea striker pursued by Arsenal . In a footballing landscape that is obsessed with pace, here is a modern-day Dimitar Berbatov, who is all about subtlety of touch, slowing the game down, finding the time and space to do something different. Arsenal could do with an out-and-out goalscorer, which Havertz — despite scoring the winner in the 2021 Champions League final — is not. But his signing could prove a masterstroke from Mikel Arteta. And Arsene Wenger would definitely approve of it. GOOD to see Jack Grealish becoming Manchester City ’s answer to Freddie Flintoff by leading the drinking spree on his club’s open-top bus parade. If a likeable, good-looking, young multi-millionaire cannot fully enjoy winning the Treble, then what’s the point of being a likeable, good-looking, young multi-millionaire Treble winner? Next expect Grealish to head out into the Caribbean on a pedalo — Flintoff-style, several sheets to the wind — then become one of our top light entertainers. WHY all the high-horsemanship from our Australian friends after England bowler Ollie Robinson shouted “f*** off you f***ing p***k” at Usman Khawaja after dismissing the opener at Edgbaston? Last time I was in Australia, that counted as a warm expression of endearment. The incident does, though, confirm the greatest myth in cricket — that sledging is often imaginative and witty. WHILE the fast-scoring of England’s Bazball approach thrills the nation, Dom ­Sibley — ditched by the national team two years ago — ground his way to the slowest century in County Championship history. It took Surrey opener Sibley almost nine hours to reach three figures. As a display of ‘b****cks-to-the-zeitgeist’ contrariness, it takes some beating. But it worked. Surrey reached a target of 501 to beat Kent.","pubDate":"2023-06-19 23:07:42","image_url":null,"source_id":"thesun_ie","category":["sports"],"country":["ireland"],"language":"english"},{"title":"NO WEAK OPPONENTS: Coach HOUGHTON","link":"https://www.hmetro.co.zw/no-weak-opponents-coach-houghton/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Blessing Malinganiza Zimbabwe head coach, Dave Houghton has thrown caution to the wind insisting that there are no weaker sides in the ongoing ICC Men’s Cricket World Cup Qualifier underway in the country as the Chevrons prepare for this morning’s clash against Netherlands. The locals played a blinder of a match, accounting for Nepal by […]","content":"H-Metro Blessing Malinganiza Zimbabwe head coach, Dave Houghton has thrown caution to the wind insisting that there are no weaker sides in the ongoing ICC Men’s Cricket World Cup Qualifier underway in the country as the Chevrons prepare for this morning’s clash against Netherlands. The locals played a blinder of a match, accounting for Nepal by a heavy eight-wicket win in their opening match of the Qualifier. Captain Craig Ervine scored an unbeaten 121 from 128 balls while all-rounder Sean Williams smashed Zimbabwe’s fastest One Day International 100 from just 70 balls to close the match on 102 not out. Prior to Williams’ milestone on a day he reached his 150th ODI, former captain, Brendan Taylor held the record of a fastest ODI hundred which he achieved from 79 balls against Ireland at the 2015 World Cup hosted by Australia and New Zealand. “Every team that we play in this tournament is a good side, they didn’t arrive here by accident,” Houghton said at a press conference yesterday. “We will be playing our game the way we have been building up over the last few months. “We have got a solid seam attack, we have got some good spinners, our fielding is good, it’s sharp, we have a good batting line up. We will be doing that. “Holland is a decent team, we won the last series 2-1 (In March at Harare Sports Club) but they have made six or seven changes, so I am not sure we know all their players that well, but this tournament for me is about what we do on the field. If we do what we do well we should win it.” Wicketkeeper batsman, Joylord Gumbie made his ODI debut against Nepal scoring 25 up the order before he was given out LBW. All-rounder Wessly Madhevere chipped in with 32 runs as Zimbabwe scored 291/2 in response to Nepal’s 290/8. Earlier, the bowlers had struggled to get wickets after Ervine elected to field upon winning the toss. It was however offspinner Wellington Masakadza who got the set batsmen for Nepal in successive overs. Masakadza finished with two wickets while Richard Ngarava enjoyed success later on with four wickets for 43 runs from nine overs. “I think our batting got it right. It was a good batting performance chasing such a big score. We made it look easy, our bowling and feeling wasn’t great at the start but we came back around 30 overs. Lots of fighting spirit, good resilience, we didn’t have a good start but we came back,” added Houghton. Netherlands captain Scott Edwards said confidence is high having played a good series against Zimbabwe in Harare in March. “We take a lot of confidence in playing three games in these conditions, I think we are quite lucky in that regard. We know we have played them recently so we know how their batters go about it and how their bowlers go about it,” he said. Last time it was a close series, we feel like we match up well against them. We are looking forward to tomorrow (today). Hopefully there will be a big crowd, all cricketers enjoy playing in front of a big crowd regardless of who they are backing. The boys are looking forward to the challenge and hopefully it brings the best from us.”","pubDate":"2023-06-19 22:08:24","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"WC Qualifier: அயர்லாந்துக்கு அணிக்கு அதிர்ச்சி அளித்த ஓமன்.. உலககோப்பை தகுதிச்சுற்றில் அபார வெற்றி..!","link":"https://tamil.abplive.com/sports/cricket/world-cup-qualifier-2023-oman-won-against-3-wicket-different-ireland-124097","keywords":["கிரிக்கெட்"],"creator":["சுகுமாறன்"],"video_url":null,"description":"உலககோப்பை தொடரில் முன்னேறுவதற்காக கடைசி 2 இடங்களுக்காக 10 அணிகள் தகுதிச்சுற்று தொடரில் ஆடி வருகின்றனர். முன்னாள் சாம்பியன்களான இலங்கை, வெஸ்ட் இண்டீஸ் ஆகிய அணிகளுடன் ஓமன், நேபாளம், அமெரிக்கா போன்ற அணிகளும் களமிறங்கியுள்ளன. பலமிகுந்த அயர்லாந்து: ஜிம்பாப்வேயில் நடைபெற்று வரும் இந்த தொடரில் புலவாயோ நகரில் நடைபெற்ற நேற்றைய போட்டியில் அயர்லாந்து – ஓமன் அணிகள் நேருக்கு நேர் மோதின. அயர்லாந்து அணி பாகிஸ்தான் அணியையே ஏற்கனவே வீழ்த்திய அனுபவம் கொண்ட அணி என்பதாலும், ஓமனுடன் ஒப்பிடும்போது அயர்லாந்து அணி பலமிகுந்த அணி என்பதாலும் இந்த போட்டியில் அயர்லாந்து எளிதாக வெற்றி பெற்று விடும் என்றே ரசிகர்கள் நினைத்தனர். ஆனால், நடந்ததோ வேறு. டாஸ் வென்ற ஓமன் அணி முதலில் பந்துவீசியது. அயர்லாந்து அணிக்கு மெக்ப்ரைன் – ஸ்டிர்லிங் சிறப்பான தொடக்கம் அளித்தனர். 51 ரன்களை எட்டியபோது ஸ்டிர்லிங் 23 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து களமிறங்கிய கேப்டன் பால்பிரைன் நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடி வந்த மெக்பிரைன் 20 ரன்களில் அவுட்டாக, கேப்டன் பால்பிரைன் 7 ரன்களில் அவுட்டானார். 282 ரன்கள் டார்கெட்: அடுத்து ஹாரி டெக்டர் – டக்கருடன் ஜோடி சேர்ந்தார். களமிறங்கியது முதல் அதிரடியாக டக்கர் 18 பந்தில் 5 பவுண்டரியுடன் 26 ரன்கள் எடுத்த நிலையில் ஆயன்கான் பந்தில் போல்டானார். 107 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த அயர்லாந்து அணிக்காக டெக்டர் – டாக்ரெல் ஜோடி சிறப்பாக ஆடியது. இவர்கள் இருவரும் நிதானமாகவும், நேர்த்தியான பந்துகளை மட்டும் அடித்தும் ஆடினர். இதனால், அயர்லாந்து ஸ்கோர் மெல்ல, மெல்ல ஏறியது. சிறப்பாக ஆடி அரைசதம் அடித்த டெக்டர் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த டெலனி 14 பந்துகளில் அதிரடியாக 20 ரன்கள் எடுக்க, மார்க் அடெய்ர் 15 ரன்களும் எடுத்து ஆட்டமிழக்க மறுமுனையில் டாக்ரெல் கடைசி கட்டத்தில் அதிரடி காட்டினர், இதனால், அயர்லாந்து அணி 50 ஓவர்களில் 7 விக்கெட் இழப்பிற்கு 281 ரன்கள் எடுத்தது. டாக்ரெல் 89 பந்துகளில் 7 பவுண்டரி 2 சிக்ஸருடன் 91 ரன்களுடனும், ஹூமே 12 பந்தில் 1 பவுண்டரியுடன் 15 ரன்கள் எடுத்தும் களத்தில் இருந்தனர். அதிரடி காட்டிய ஓமன்: அடுத்து 285 ரன்கள் என்ற கடின இலக்குடன் களமிறங்கிய ஓமனுக்கு தொடக்கமே அதிர்ச்சி காத்திருந்தது. தொடக்க வீரர் ஜதீந்தர் சிங் 1 ரன்னில் அவுட்டாக அடுத்து ஜோடி சேர்ந்த காஷ்யப் – அகீப் ஜோடி அதிரடியாக ஆடியது. சிறப்பாக ஆடிய இருவரும் அரைசதம் அடித்தனர். அகிப் இலியாஸ் 49 பந்துகளில் 8 பவுண்டரியுடன் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த கேப்டன் மக்சூத் பொறுப்புடன் ஆடினார். மறுமுனையில் சிறப்பாக ஆடிய காஷ்யப் 74 பந்தில் 6 பவுண்டரி 1 சிக்ஸருடன் 72 ரன்கள் எடுத்த நிலையில் அவுட்டானார். பின்னர், கேப்டன் மக்சூத் – நதீம் ஜோடி சிறப்பாக ஆடினர். அணியின் ஸ்கோர் 222 ரன்களை எட்டியபோது கேப்டன் மக்சூத் 59 ரன்களில் ஆட்டமிழந்தார். அவர் 67 பந்துகளில் 4 பவுண்டரி 1 சிக்ஸர் விளாசினார். அடுத்து வந்த ஆயன் கான் 21 பந்தில் 21 ரன்களில் வெளியேற அடுத்து மேற்கொண்டு விக்கெட் விழாமல் ஓமன் வீரர்கள் பார்த்துக்கொண்டனர். அயர்லாந்துக்கு அதிர்ச்சி: கடைசியில் ஓமன் 48.1 ஓவர்களில் 285 ரன்கள் எடுத்து அபார வெற்றி பெற்றது. முகமது நதீம் 53 பந்துகளில் 4 பவுண்டரியுடன் 46 ரன்களுடனும், சோயப் கான் 17 பந்தில் 3 பவுண்டரியுடன் 19 ரன்களுடனும் களத்தில் இருந்தனர். பலமிகுந்த அயர்லாந்து அணியை ஓமன் அணி வீழ்த்தியதை அந்த நாட்டு ரசிகர்கள் கொண்டாடி வருகின்றனர்.   ","content":"உலககோப்பை தொடரில் முன்னேறுவதற்காக கடைசி 2 இடங்களுக்காக 10 அணிகள் தகுதிச்சுற்று தொடரில் ஆடி வருகின்றனர். முன்னாள் சாம்பியன்களான இலங்கை, வெஸ்ட் இண்டீஸ் ஆகிய அணிகளுடன் ஓமன், நேபாளம், அமெரிக்கா போன்ற அணிகளும் களமிறங்கியுள்ளன. பலமிகுந்த அயர்லாந்து: ஜிம்பாப்வேயில் நடைபெற்று வரும் இந்த தொடரில் புலவாயோ நகரில் நடைபெற்ற நேற்றைய போட்டியில் அயர்லாந்து – ஓமன் அணிகள் நேருக்கு நேர் மோதின. அயர்லாந்து அணி பாகிஸ்தான் அணியையே ஏற்கனவே வீழ்த்திய அனுபவம் கொண்ட அணி என்பதாலும், ஓமனுடன் ஒப்பிடும்போது அயர்லாந்து அணி பலமிகுந்த அணி என்பதாலும் இந்த போட்டியில் அயர்லாந்து எளிதாக வெற்றி பெற்று விடும் என்றே ரசிகர்கள் நினைத்தனர். ஆனால், நடந்ததோ வேறு. டாஸ் வென்ற ஓமன் அணி முதலில் பந்துவீசியது. அயர்லாந்து அணிக்கு மெக்ப்ரைன் – ஸ்டிர்லிங் சிறப்பான தொடக்கம் அளித்தனர். 51 ரன்களை எட்டியபோது ஸ்டிர்லிங் 23 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து களமிறங்கிய கேப்டன் பால்பிரைன் நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடி வந்த மெக்பிரைன் 20 ரன்களில் அவுட்டாக, கேப்டன் பால்பிரைன் 7 ரன்களில் அவுட்டானார். googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); 282 ரன்கள் டார்கெட்: அடுத்து ஹாரி டெக்டர் – டக்கருடன் ஜோடி சேர்ந்தார். களமிறங்கியது முதல் அதிரடியாக டக்கர் 18 பந்தில் 5 பவுண்டரியுடன் 26 ரன்கள் எடுத்த நிலையில் ஆயன்கான் பந்தில் போல்டானார். 107 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த அயர்லாந்து அணிக்காக டெக்டர் – டாக்ரெல் ஜோடி சிறப்பாக ஆடியது. இவர்கள் இருவரும் நிதானமாகவும், நேர்த்தியான பந்துகளை மட்டும் அடித்தும் ஆடினர். இதனால், அயர்லாந்து ஸ்கோர் மெல்ல, மெல்ல ஏறியது. சிறப்பாக ஆடி அரைசதம் அடித்த டெக்டர் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த டெலனி 14 பந்துகளில் அதிரடியாக 20 ரன்கள் எடுக்க, மார்க் அடெய்ர் 15 ரன்களும் எடுத்து ஆட்டமிழக்க மறுமுனையில் டாக்ரெல் கடைசி கட்டத்தில் அதிரடி காட்டினர், இதனால், அயர்லாந்து அணி 50 ஓவர்களில் 7 விக்கெட் இழப்பிற்கு 281 ரன்கள் எடுத்தது. டாக்ரெல் 89 பந்துகளில் 7 பவுண்டரி 2 சிக்ஸருடன் 91 ரன்களுடனும், ஹூமே 12 பந்தில் 1 பவுண்டரியுடன் 15 ரன்கள் எடுத்தும் களத்தில் இருந்தனர். அதிரடி காட்டிய ஓமன்: அடுத்து 285 ரன்கள் என்ற கடின இலக்குடன் களமிறங்கிய ஓமனுக்கு தொடக்கமே அதிர்ச்சி காத்திருந்தது. தொடக்க வீரர் ஜதீந்தர் சிங் 1 ரன்னில் அவுட்டாக அடுத்து ஜோடி சேர்ந்த காஷ்யப் – அகீப் ஜோடி அதிரடியாக ஆடியது. சிறப்பாக ஆடிய இருவரும் அரைசதம் அடித்தனர். அகிப் இலியாஸ் 49 பந்துகளில் 8 பவுண்டரியுடன் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த கேப்டன் மக்சூத் பொறுப்புடன் ஆடினார். மறுமுனையில் சிறப்பாக ஆடிய காஷ்யப் 74 பந்தில் 6 பவுண்டரி 1 சிக்ஸருடன் 72 ரன்கள் எடுத்த நிலையில் அவுட்டானார். பின்னர், கேப்டன் மக்சூத் – நதீம் ஜோடி சிறப்பாக ஆடினர். அணியின் ஸ்கோர் 222 ரன்களை எட்டியபோது கேப்டன் மக்சூத் 59 ரன்களில் ஆட்டமிழந்தார். அவர் 67 பந்துகளில் 4 பவுண்டரி 1 சிக்ஸர் விளாசினார். அடுத்து வந்த ஆயன் கான் 21 பந்தில் 21 ரன்களில் வெளியேற அடுத்து மேற்கொண்டு விக்கெட் விழாமல் ஓமன் வீரர்கள் பார்த்துக்கொண்டனர். அயர்லாந்துக்கு அதிர்ச்சி: கடைசியில் ஓமன் 48.1 ஓவர்களில் 285 ரன்கள் எடுத்து அபார வெற்றி பெற்றது. முகமது நதீம் 53 பந்துகளில் 4 பவுண்டரியுடன் 46 ரன்களுடனும், சோயப் கான் 17 பந்தில் 3 பவுண்டரியுடன் 19 ரன்களுடனும் களத்தில் இருந்தனர். பலமிகுந்த அயர்லாந்து அணியை ஓமன் அணி வீழ்த்தியதை அந்த நாட்டு ரசிகர்கள் கொண்டாடி வருகின்றனர்.","pubDate":"2023-06-20 04:02:06","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/20/64f4773a43e6fe8a453d6910b2d3c9751687232946064102_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Tamil"},{"title":"Ashes Test: இறுதிக்கட்டத்தில் ஆஷஸ்.. 281 ரன்களை எட்டிப்பிடிக்குமா ஆஸ்திரேலியா..? வெற்றி பெறுமா இங்கிலாந்து..?","link":"https://tamil.abplive.com/sports/cricket/ashes-test-2023-australia-have-281-runs-target-against-england-know-full-details-124091","keywords":["கிரிக்கெட்"],"creator":["சுகுமாறன்"],"video_url":null,"description":"பர்மிங்காமில் நடைபெற்று வரும் ஆஷஸ் தொடரின் முதல் டெஸ்ட் போட்டி விறுவிறுப்பான இறுதிக்கட்டத்தை எட்டியுள்ளது. முதல் இன்னிங்சில் ஜோ ரூட்டின் சதத்தால் இங்கிலாந்து 393 ரன்களை குவிக்க, ஆஸ்திரேலியா கவாஜா சதத்தால் 383 ரன்களை குவிக்க 2வது இன்னிங்சில் இமாலய இலக்கை நிர்ணயிக்கும் நோக்கில் களமிறங்கிய இங்கிலாந்து அணி 4ம் நாளான நேற்று ஆட்டத்தை தொடங்கியது. 273 ரன்களுக்கு ஆல் அவுட்: ஒல்லி போப்பும், ஜோ ரூட்டும் ஆட்டத்தை தொடர்ந்தனர். ஒல்லி போப் 14 ரன்களில் அவுட்டாக அடுத்து வந்த ஹாரி ப்ரூக் – ஜோ ரூட் ஜோடி நிதானமாக ஆடியது. அரைசதம் அடிப்பார் என்று எதிர்பார்க்கப்பட்ட ஜோ ரூட் 46 ரன்களில் அவுட்டானார். அவர் ஆட்டமிழந்த சிறிது நேரத்தில் 46 ரன்களில் ஆட்டமிழக்க 150 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த இங்கிலாந்து அணிக்கு கேப்டன் பென்ஸ்டோக்ஸ் சிறப்பாக ஆடினார். அவருக்கு ஜானி பார்ஸ்டோ நல்ல ஒத்துழைப்பு அளித்தார். பார்ஸ்டோ 39 பந்துகளில் 3 பவுண்டரியுடன் 20 ரன்களை எடுத்த நிலையில் அவுட்டாக, அடுத்து வந்த மொயின் அலி நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடிய கேப்டன் ஸ்டோக்ஸ் 66 பந்தில் 5 பவுண்டரியுடன் 43 ரன்கள் எடுத்த நிலையில் அவுட்டானார். கடைசியில் ராபின்சன் 27 ரன்கள் எடுக்க இங்கிலாந்து அணி 66.2 ஓவர்களில் அனைத்து விக்கெட்டுகளையும் இழந்து 273 ரன்கள் எடுத்தது. வெற்றி பெறப்போவது யார்? இதையடுத்து, ஆஸ்திரேலிய அணிக்கு 281 ரன்களை இங்கிலாந்து அணி இலக்காக நிர்ணயித்தது. இதையடுத்து, இந்த மைதானத்தில் 281 ரன்கள் என்பது சற்று கடினமானதே ஆகும். இதைத்தொடர்ந்து ஆட்டத்தை தொடங்கிய உஸ்மான் கவாஜா – டேவிட் வார்னர் ஜோடி நிதானமாக ஆட்டத்தை தொடங்கினர். கடந்த இன்னிங்சில் சொதப்பிய வார்னர் 57 பந்துகளில் 4 பவுண்டரியுடன் 36 ரன்கள் எடுத்த நிலையில் ஆட்டமிழந்தார்.  அடுத்து மிகவும் எதிர்பார்க்கப்பட்ட லபுஷேனே களமிறங்கினார். அவர் 15 பந்துகளில் 3 பவுண்டரி விளாசிய நிலையில் 13 ரன்கள் எடுத்திருந்தபோது பிராட் பந்தில் அவுட்டானார். அடுத்து வந்த ஸ்டீவ் ஸ்மித் இந்த இன்னிங்சில் அசத்துவார் என்று எதிர்பார்த்த ரசிகர்களுக்கு ஏமாற்றமே மிஞ்சியது. 13 பந்துகளில் 6 ரன்கள் எடுத்திருந்த ஸ்டீவ் ஸ்மித்தை பிராட் அவுட்டாக்கினார். நெருக்கடியில் ஆஸ்திரேலியா? நேற்றைய ஆட்ட நேர முடிவில் 30 ஓவர்களில் 3 விக்கெட்டுகளை இழந்து ஆஸ்திரேலிய அணி 107 ரன்கள் எடுத்திருந்தது. கவாஜா 34 ரன்களுடனும், போலந்து 13 ரன்களுடனும் களத்தில் உள்ளனர். கடைசி நாளான இன்று ஆஸ்திரேலியாவின் வெற்றிக்கு 174 ரன்கள் தேவைப்படுகிறது. முதல் டெஸ்ட் போட்டியை வெற்றியுடன் தொடங்க இங்கிலாந்திற்கு இன்னும் 7 விக்கெட்டுகள் தேவைப்படுகிறது. முக்கிய விக்கெட்டுகளான டேவிட் வார்னர், ஸ்டீவ் ஸ்மித், லபுஷேனே அவுட்டாகியுள்ள நிலையில் ஆஸ்திரேலியா நெருக்கடிக்கு ஆளாகியுள்ளது. அந்த அணியில் ட்ராவிஸ் ஹெட், கிரீன், கேரி, கம்மின்ஸ் சிறப்பாக ஆட வேண்டிய கட்டாயத்தில் உள்ளனர். கடைசி நாள் பரப்பான கட்டத்தை எட்டியுள்ளதால் இரு நாட்டு ரசிகர்களும் வெற்றிபெற போவது யார் என்பதை காண ஆர்வமுடன் உள்ளனர். மேலும் படிக்க: WC Qualifiers: வெஸ்ட் இண்டீசுக்கு எதிராக சதமடித்த அமெரிக்க வீரர்.. உலகக்கோப்பை தகுதிச்சுற்றில் அசத்தல்..! மேலும் படிக்க: IND vs WI: புஜாராவுக்கு இடமில்லையா..? அவருக்கு பதிலாக இந்திய அணியில் யார்..? வெஸ்ட் இண்டீஸ் தொடர் ஒரு பார்வை!","content":"பர்மிங்காமில் நடைபெற்று வரும் ஆஷஸ் தொடரின் முதல் டெஸ்ட் போட்டி விறுவிறுப்பான இறுதிக்கட்டத்தை எட்டியுள்ளது. முதல் இன்னிங்சில் ஜோ ரூட்டின் சதத்தால் இங்கிலாந்து 393 ரன்களை குவிக்க, ஆஸ்திரேலியா கவாஜா சதத்தால் 383 ரன்களை குவிக்க 2வது இன்னிங்சில் இமாலய இலக்கை நிர்ணயிக்கும் நோக்கில் களமிறங்கிய இங்கிலாந்து அணி 4ம் நாளான நேற்று ஆட்டத்தை தொடங்கியது. 273 ரன்களுக்கு ஆல் அவுட்: ஒல்லி போப்பும், ஜோ ரூட்டும் ஆட்டத்தை தொடர்ந்தனர். ஒல்லி போப் 14 ரன்களில் அவுட்டாக அடுத்து வந்த ஹாரி ப்ரூக் – ஜோ ரூட் ஜோடி நிதானமாக ஆடியது. அரைசதம் அடிப்பார் என்று எதிர்பார்க்கப்பட்ட ஜோ ரூட் 46 ரன்களில் அவுட்டானார். அவர் ஆட்டமிழந்த சிறிது நேரத்தில் 46 ரன்களில் ஆட்டமிழக்க 150 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த இங்கிலாந்து அணிக்கு கேப்டன் பென்ஸ்டோக்ஸ் சிறப்பாக ஆடினார். அவருக்கு ஜானி பார்ஸ்டோ நல்ல ஒத்துழைப்பு அளித்தார். பார்ஸ்டோ 39 பந்துகளில் 3 பவுண்டரியுடன் 20 ரன்களை எடுத்த நிலையில் அவுட்டாக, அடுத்து வந்த மொயின் அலி நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடிய கேப்டன் ஸ்டோக்ஸ் 66 பந்தில் 5 பவுண்டரியுடன் 43 ரன்கள் எடுத்த நிலையில் அவுட்டானார். கடைசியில் ராபின்சன் 27 ரன்கள் எடுக்க இங்கிலாந்து அணி 66.2 ஓவர்களில் அனைத்து விக்கெட்டுகளையும் இழந்து 273 ரன்கள் எடுத்தது. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); வெற்றி பெறப்போவது யார்? இதையடுத்து, ஆஸ்திரேலிய அணிக்கு 281 ரன்களை இங்கிலாந்து அணி இலக்காக நிர்ணயித்தது. இதையடுத்து, இந்த மைதானத்தில் 281 ரன்கள் என்பது சற்று கடினமானதே ஆகும். இதைத்தொடர்ந்து ஆட்டத்தை தொடங்கிய உஸ்மான் கவாஜா – டேவிட் வார்னர் ஜோடி நிதானமாக ஆட்டத்தை தொடங்கினர். கடந்த இன்னிங்சில் சொதப்பிய வார்னர் 57 பந்துகளில் 4 பவுண்டரியுடன் 36 ரன்கள் எடுத்த நிலையில் ஆட்டமிழந்தார். அடுத்து மிகவும் எதிர்பார்க்கப்பட்ட லபுஷேனே களமிறங்கினார். அவர் 15 பந்துகளில் 3 பவுண்டரி விளாசிய நிலையில் 13 ரன்கள் எடுத்திருந்தபோது பிராட் பந்தில் அவுட்டானார். அடுத்து வந்த ஸ்டீவ் ஸ்மித் இந்த இன்னிங்சில் அசத்துவார் என்று எதிர்பார்த்த ரசிகர்களுக்கு ஏமாற்றமே மிஞ்சியது. 13 பந்துகளில் 6 ரன்கள் எடுத்திருந்த ஸ்டீவ் ஸ்மித்தை பிராட் அவுட்டாக்கினார். நெருக்கடியில் ஆஸ்திரேலியா? நேற்றைய ஆட்ட நேர முடிவில் 30 ஓவர்களில் 3 விக்கெட்டுகளை இழந்து ஆஸ்திரேலிய அணி 107 ரன்கள் எடுத்திருந்தது. கவாஜா 34 ரன்களுடனும், போலந்து 13 ரன்களுடனும் களத்தில் உள்ளனர். கடைசி நாளான இன்று ஆஸ்திரேலியாவின் வெற்றிக்கு 174 ரன்கள் தேவைப்படுகிறது. முதல் டெஸ்ட் போட்டியை வெற்றியுடன் தொடங்க இங்கிலாந்திற்கு இன்னும் 7 விக்கெட்டுகள் தேவைப்படுகிறது. முக்கிய விக்கெட்டுகளான டேவிட் வார்னர், ஸ்டீவ் ஸ்மித், லபுஷேனே அவுட்டாகியுள்ள நிலையில் ஆஸ்திரேலியா நெருக்கடிக்கு ஆளாகியுள்ளது. அந்த அணியில் ட்ராவிஸ் ஹெட், கிரீன், கேரி, கம்மின்ஸ் சிறப்பாக ஆட வேண்டிய கட்டாயத்தில் உள்ளனர். கடைசி நாள் பரப்பான கட்டத்தை எட்டியுள்ளதால் இரு நாட்டு ரசிகர்களும் வெற்றிபெற போவது யார் என்பதை காண ஆர்வமுடன் உள்ளனர். மேலும் படிக்க: WC Qualifiers: வெஸ்ட் இண்டீசுக்கு எதிராக சதமடித்த அமெரிக்க வீரர்.. உலகக்கோப்பை தகுதிச்சுற்றில் அசத்தல்..! மேலும் படிக்க: IND vs WI: புஜாராவுக்கு இடமில்லையா..? அவருக்கு பதிலாக இந்திய அணியில் யார்..? வெஸ்ட் இண்டீஸ் தொடர் ஒரு பார்வை!","pubDate":"2023-06-20 03:15:30","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/20/1d5552444a7f5e6d14b6d9ee9a5206bc1687230509158102_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Tamil"},{"title":"On Stokes' \"Umbrella Field\" For Khawaja, Ponting's Reaction Says It All","link":"https://sports.ndtv.com/cricket/on-ben-stokes-umbrella-field-for-usman-khawaja-ricky-pontings-reaction-says-it-all-4133471","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes' \"umbrella field\" setting for Usman Khawaja even caught Australia great Ricky Ponting off-guard.","content":"The first Ashes Test between Australia and England is off to a flier, with every single day of the Edgbaston encounter unfolding new incidents to talk about. England skipper Ben Stokes ' 'umbrella-like' field to pile the pressure on Australia batter Usman Khawaja became a huge talking-point on social media. As fans and multiple former cricketers hailed Stokes' captaincy, Australia great Ricky Ponting also gave a million-dollar reaction to Stokes' tactical decision, admitted that he had never seen anything like that before. \"I don't think I've ever seen a field like that in Test cricket before. There was just an umbrella of fielders around in front of the batsman's face. And it was all about bowling a couple of slower balls and being able to bowl a yorker. And sure enough, Khawaja used his feet, gave himself some room, gave up his stumps, and the yorker knocked his off stump out of the ground,\" Ponting told the ICC . \"It's fantastic stuff. It's really refreshing for the Test game to see a team play this way and a captain happy to try everything he possibly can.\" Further lauding Stokes' captaincy, Ponting lauded the England skipper's willingness to explore all options of picking up a wicket, pressing every little opportunity he senses to unnerve the batter. \"It's hard to keep up with them all, he's making a change almost every ball, which is great, it's proactive captaincy. He's always trying to move the game forward, he's looking at any little way that he possibly can to pick up a wicket and change the momentum of the game,\" Ponting said. What a ball from Robinson, Fantastic by Stokes as a captain. End of an incredible knock from Khawaja. pic.twitter.com/8Bz5ejFAvj \"With Khawaja's innings, I'd hate to try and count how many times he changed the field for him and how many bowling changes and tactical changes he made to try and get Khawaja out - and then it finally worked,\" the ex-Australia captain said. Australia were bowled out for 386 while chasing England's first innings score of 393. By the end of Day 3, Australia had picked up two English wickets, with the score reading 28/2 at the end of 10.3 overs.","pubDate":"2023-06-20 02:40:31","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Marnus Labuschagne is called a cheat by English fans after claiming he took dodgy Ashes catch","link":"https://247newsaroundtheworld.com/sports/marnus-labuschagne-is-called-a-cheat-by-english-fans-after-claiming-he-took-dodgy-ashes-catch/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World First it was Cameron Green, now Marnus Labuschagne is called a cheat… The post Marnus Labuschagne is called a cheat by English fans after claiming he took dodgy Ashes catch appeared first on 247 News Around The World.","content":"First it was Cameron Green, now Marnus Labuschagne is called a cheat by English fans after claiming he took a dodgy catch to dismiss Ollie Robinson Marnus Labuschagne called a cheat by English fans Labuschagne claimed a catch where ball touched grass Fans chanted ‘Same old Aussies, always cheating’ By James Cooney For Daily Mail Australia and Scott Bailey For Australian Associated Press Published: 22:14 EDT, 19 June 2023 | Updated: 22:14 EDT, 19 June 2023 Marnus Labuschagne has been labelled a cheat by English cricket fans after claiming he took a stunning catch to remove Ollie Robinson during the opening Ashes Test at Edgbaston. The fired-up Birmingham crowd gave it to the Aussies on day four of the match, and Cameron Green also copped it from the Barmy Army on day three after taking a remarkable catch to dismiss Ben Duckett off the bowling of Scott Boland. Even though Green’s catch was reviewed and given out, the crowd chanted: ‘Same old Aussies, always cheating.’ As England looked for runs on day four, it was Labuschagne’s turn to get a grilling when he dived forward in an attempt to take a one-handed grab after tail-ender Ollie Robinson gloved a Josh Hazlewood delivery into the air. Labuschagne was slammed by English cricket fans for celebrating a non-catch that he claimed had dismissed Ollie Robinson (pictured) Replays showed that the ball had scraped the turf (pictured) – and the fans weren’t shy when it came to letting Labuschagne know all about it Labuschagne celebrated immediately, but the on-field umpires sent the decision upstairs and it didn’t take long for the third official to confirm the catch was not genuine. Replays showed that the Aussie took the ball cleanly – but the ball had scraped the turf. Unsurprisingly, the crowd weren’t happy and chanted ‘Same old Aussies, always cheating’ around the ground – the same song they sang to Green and have used at other points in the tense contest. Australia need 174 runs and England seven wickets to secure a famous Ashes victory after Stuart Broad’s heroics ensured the enthralling series opener would enter day five with everything to play for. Set 281 to win, Australia slumped from 0-61 to 3-107 at stumps, after David Warner, Marnus Labuschagne and Steve Smith all fell in the space of eight dramatic overs late on Monday. Broad was the chief destroyer for England, getting the world’s two top-ranked batsmen caught behind with Labuschagne nicking to an outswinger and Smith an inswinger. That has left-first innings centurion Usman Khawaja as Australia’s key man at Edgbaston, still at the crease on 34no with nightwatchman Scott Boland at the other end on 13. ‘It probably wasn’t our greatest 40 minutes to lose Marnus, Steve and Davey but you have to give credit where it’s due, England’s bowled well,’ Australia spinner Nathan Lyon said. The rowdy Birmingham crowd weren’t happy with the dubious catch and chanted ‘Same old, Aussies always cheating’ around the ground Australia need 174 runs and England seven wickets to secure a famous Ashes victory ‘But I’m backing our boys, I’m confident our boys can go out there and bat well. ‘It’s set up to be a thrilling Test match and it’s been one hell of a way to start the series.’ Rain is forecast for Tuesday morning in Birmingham and is due to clear by lunchtime, leaving all results still on the table. In a Test where no team has truly been in control, Australia briefly had the upper hand on Monday evening. Warner looked as good as he has at any point in the past three years as he cut and pulled his way to 36 on a wicket lacking pace. But when he edged off to Ollie Robinson on 36, the door was open for Broad to send the Edgbaston crowd into overdrive as he delivered on his plan to take down Labuschagne (13) and Smith (6) this summer. ‘Obviously they are No.1 and No.2 in the world, they know what they are doing.’ Broad said. ‘One thing we know as a bowling group, you have to put them under pressure early. If they get to 30 or 40 they don’t give it away cheaply. ‘Today has been one of those days that sums up Ashes cricket. ‘You think you’re getting ahead of the game and you lose a wicket. And the Aussies would have thought the same as well.’ Share or comment on this article: Post source: Daily mail","pubDate":"2023-06-20 02:40:03","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"“I wanted closure”: Ashwin Finally Opens Up About His ‘Explosive Tweet’ After WTC final","link":"https://www.cricketcountry.com/news/i-wanted-closure-ashwin-finally-opened-up-about-explosive-tweet-after-wtc-final-1099483","keywords":["News","Ashwin","India vs Australia","WTC Final"],"creator":["CricketCountry Staff"],"video_url":null,"description":"Weeks after Australia won WTC final, Ashwin who was not a part of India's playing XI, opened up after his tweet said he needed closure.","content":"Weeks after Australia won WTC final, Ashwin who was not a part of India's playing XI, opened up after his tweet said he needed closure. More than a week ago, Australia became World Test Champions after defeating India in the WTC final at the Ovals in London. Many experts and ex-cricketers slammed Rohit Sharma and coach Rahul Dravid's team selection. India's star pacer Umesh Yadav was picked in place of World No. 1 test bowler Ravichandran Ashwin in the playing XI. Right after the Baggy Greens lifted the trophy, Ashwin put out an explosive tweet expressing his disappointment over India's loss. \"Congratulations Australia on winning this #WTCFinal and closing out this cycle of test cricket. It is disappointing to end up on the wrong side of things, nevertheless it was a great effort over the last 2 years or so to get here in the first place. Amidst all the chaos and scathing assessments, i feel it's very important to acknowledge all my team mates who played in this cycle and most importantly the coaching and support staffs who have held on like a rock of support,\" he had tweeted. Congratulations Australia on winning this and closing out this cycle of test cricket. It is disappointing to end up on the wrong side of things, nevertheless it was a great effort over the last 2 years or so to get here in the first place. Amidst all the chaos and Ashwin ?? (@ashwinravi99) Ashwin Reveals The Reason Behind His Tweet After WTC Final Finally, Ashwin opened up about the tweet that he posted right after the WTC final. He revealed that it was just a closure for his omission from the WTC final squad. He further said that the fans were giving him sympathy, which he was not able to accept anymore. \"I have got no sympathy for my journey. It's very easy for me to go back and say, okay, this didn't happen for me or something happened for him. I don't give myself one second of sympathy. That's why I put that tweet because I wanted closure. I hated the fact that people are giving me sympathy, I just couldn't take it anymore\", Ashwin told Indian Express. \"In this social media age, you don't play and sometimes you are bigger than if you had played the game, right? People are talking, 'if he had played we would have won'. I am not sure if I had played, we would have won. I would have given my best and I definitely think I gave myself the best opportunity to succeed there. I also think I earned my stripes. That's all I can do. But the moment it got done, I just wanted to move on and focus on the TNPL for Dindigul Dragons,\" he concluded. Also Read LIVE SCOREBOARD","pubDate":"2023-06-20 02:39:10","image_url":"https://www.cricketcountry.com//wp-content/uploads/2023/06/Collage-Maker-20-Jun-2023-08-04-AM-5925.jpg","source_id":"cricketcountry","category":["sports"],"country":["india"],"language":"english"},{"title":"\"Out Cricket Is Bigger\": Pakistan Legend's Bold Stance On ODI WC Scenario","link":"https://sports.ndtv.com/cricket/out-cricket-is-bigger-pakistan-legends-bold-stance-on-odi-world-cup-scenario-4132870","keywords":null,"creator":null,"video_url":null,"description":"Pakistan legend Javed Miandad doesn't think the PCB should send its team to India for ODI World Cup 2023 unless the BCCI sends its team to Pakistan.","content":"Batting great Javed Miandad spewed fresh venom at India, saying Pakistan should not travel to the neighbouring country for matches, including this year's ICC ODI World Cup, until the BCCI agrees to send its team to his nation first. As per the draft schedule prepared by the ICC, Pakistan are scheduled to play India in the blockbuster World Cup clash at the Narendra Modi stadium in Ahmedabad on October 15. But the 66-year-old former captain feels it is now India's time to reciprocate by touring Pakistan. \"Pakistan has been to India in 2012 and even in 2016 now it is the turn of the Indians to come here,\" Miandad said. \"If I had to make a decision I would never go to India to play any match, even the World Cup. We are always ready to play them (India) but they never respond in the same manner. \"Pakistan cricket is bigger...we are still producing quality players. So I don't think even if we don't go to India it will make any difference to us,\" he added. پاکستان کو ورلڈ کپ کیلئے بھارت نہیں جانا چاہیئے... مودی نے کرکٹ کیساتھ بھارت کو بھی تباہ کردیا ہے، جاوید میانداد #Pakistan #India #AsiaCup2023 #Cricket pic.twitter.com/kpmSJkEsqs India last visited Pakistan in 2008 for the 50-over Asia Cup. Since then bilateral cricket ties were suspended due to long-standing geo-political tensions between the two nations. Miandad feels sports not be mixed with politics. \"I always say one can't choose its neighbours, so it is better to live by cooperating with each other. And I have always said cricket is a sport which brings people closer to each other and can remove misunderstandings and grievances between countries,\" he said. Miandad's fresh attack came after Pakistan were forced to host the upcoming Asia Cup in a hybrid model with India playing all their matches in Sri Lanka. This decision didn't go down well with Miandad, a vocal critic of India. \"It was on the cards that they would again not send their team to Pakistan for the Asia Cup so it is time we also take a strong stand now,\" he said. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Advertisement","pubDate":"2023-06-20 02:24:06","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"\"My Father Goes Through Twice The Trauma I Do\": Ravichandran Ashwin","link":"https://sports.ndtv.com/cricket/my-father-goes-through-twice-the-trauma-i-do-ravichandran-ashwin-4132822","keywords":null,"creator":null,"video_url":null,"description":"Often branded as an 'overthinker', Ravichandran Ashwin spoke about the 'trauma' he and his family have gone through over the years.","content":"One of the greats of the modern game, Ravichandran Ashwin has had quite a journey. From being central to India's plans across formats to becoming a specialist, before eventually returning to white-ball cricket, the off-spinner has had a roller-coaster of a ride. After Ashwin was snubbed for a spot in India's playing XI for the World Test Championship final against Australia, his absence became one of the biggest talking points on social media. The veteran cricketer, who has found himself in such positions on multiple occasions, opened up about the 'trauma' he and his family have gone through over the years and the 'overthinker' tag that has been given to him. When it comes to overseas Tests, Ashwin isn't one of the first names on the teamsheets. In the WTC final against Australia, it was Ravindra Jadeja who was preferred by the Indian team for the sole spinner's spot. There's a perception that Ashwin tends to 'overthink' on certain occasions, a mindset that has worked against him multiple times. In a chat with the Indian Express , Ashwin said that the tag of being an 'overthinker' was created to work against him. \"A lot of people marketed me and positioned me that I am an overthinker. A person who will get 15-20 matches on the go doesn't have to be mentally overthinking. A person who knows that they will get only two games will be traumatised and will be overthinking because it's my job. It's my journey. So this is what suits me,\" he said. \"If somebody is going to tell me, 'you're going to play 15 matches, you will be looked after, you will be this, you are responsible for players, you are in the leadership role, I won't be overthinking. Why would I? It's unfair to actually say somebody's an overthinker because that person's journey is his own. And nobody has a right or business to do that,\" he further said. On the 'overthinker' tag, Ashwin said that a lot of things have been said about him whenever the talk of taking up a 'leadership role' has come his way. \"It was created to work against me, right? And as I said, there have been statements that people have made all along when leadership question has come my way, there have been people who are been out there telling, my name is not the first name on the sheet when India tour abroad. \"Whether that name is first on the sheet or not is something I can't control. If I earned it, it's got to be there and that's my belief. As I said, I have no complaints, I have no time to sit back and throw punches or regret or anything. I have no regrets about anyone,\" he explained. During the interview, Ashwin also said that his family, especially his father, goes through twice the trauma he does whenever it comes to such affairs. \"The moment, the final finished I put out a tweet because I realised one thing is that I need closure. The moment I get the closure I can move on. There is no time to hang around. I have understood life a lot better now. \"The more I see it, the kind of trauma toll it takes on my family is incredible. My father has a heart problem and other issues. Every single game, every single day, something happens, he will call me. He is stressed. It's very easy for me to go out and play because it is still in my control. For my father, it is not and he goes through double of what I do. So looking at this in hindsight, everybody on the outside is irrelevant,\" Ashwin explained.","pubDate":"2023-06-20 02:20:55","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Ricky Ponting lands ruthless clapback on overexcited Kevin Pietersen claim over Joe Root’s Ashes innings","link":"https://7news.com.au/sport/cricket/ricky-ponting-lands-ruthless-clapback-on-overexcited-kevin-pietersen-claim-over-joe-roots-ashes-innings-c-11032505","keywords":null,"creator":["Digital Staff"],"video_url":null,"description":"The Australian legend maintained a straight face for his former adversary’s speech - but he was quick to fire back.","content":"Already arguably the most universally loved commentator in Australian sport, Ricky Ponting has earned even more plaudits from Aussie fans after landing a ruthless clapback at Kevin Pietersen during the Ashes on UK television. Pietersen was laying on the love for his former teammate Joe Root and claimed the England batsman’s aggressive start to day four had Australia running scared. Watch, Stream & Catch Up with Australia's Home of Cricket on There was only one problem: Root undid all his groundwork when he danced Nathan Lyon and was out stumped on 46, leaving England on 4-129 with a nervous lead of just 136 runs. “He just owned the game,” Pietersen told Sky Sports of Root. “He ran the game, he was pure quality and he just owned that space. And just had all this lot scratching their heads going ‘what do we do?’” Ponting maintained a straight face while Pietersen spoke but showed a quick wit afterwards. “Well he’s out now, he got 40,” the ex-Australian captain said bluntly. Pietersen, for his part, took the blow in his stride, as the pair laughed and Ponting moved on. Meanwhile, Ponting opted against entering a public slanging match with Ollie Robinson as the fallout from the England quick’s fiery send-off continued. Robinson attracted headlines on Sunday when he first swore at Usman Khawaja after dismissing him for 141, before doubling down on the antics post-play. Included in Robinson’s claims were that Australia now could not handle sledging, after pointing at the behaviour of past players such as Ponting as an example. The former captain indicated on Monday that he had initially been agitated by the comments, firing off messages in a commentary WhatsApp group. “If I had been able to catch up with Ollie last night, things might have been vastly different to what they were this morning, let’s put it that way,” Ponting said. The former Australian captain did expect Australia’s current team to remind Robinson of his actions. He also questioned whether multiple England players had got ahead of themselves in the past year through the Bazball era. England have been particularly brash in recent days, with Robinson and assistant coach Paul Collingwood accusing Pat Cummins’ team of defensive cricket. Robinson also stated on Sunday that Australia had three No.11s, while Harry Brook was bullish before the match about taking down Australia’s attack. “That will be stored up,” Ponting said of the Robinson incident. “A lot of the things we are talking about here with what Harry Brook has had to say and Ollie Robinson has had to say. “A lot of the cricket these guys have played hasn’t been against this hard-nosed Australian cricket team. “It’s one thing to go out and say what they are saying. In Ashes cricket, names and reputations are made or not. “Some of these English players have had terrific starts to their careers. But we will find out more about them as this series goes on.” Cummins had declared before the series this was an Australian team no longer interested in instigating sledging, after their overhaul following the 2018 ball-tampering scandal. “You’ve seen over the past couple of years our team is pretty chilled out there,” he said. “We’re quite a confident bunch but we’re not overly loud or in your face. I think you’ve seen our personalities reflected out on the field. “I am sure there is going to be emotions at times, but I would be surprised if that bubbled over like maybe it has in the past.”","pubDate":"2023-06-20 00:48:07","image_url":"https://images.7news.com.au/publication/C-11032505/c50a86a47cdc502f0507296874b00c4fbe6f3989-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jude Bellingham won’t crash and burn at Real Madrid like Gareth Bale – he’s learning from Welshman’s mistakes","link":"https://www.thesun.ie/sport/football/10907766/jude-bellingham-gaeth-bale-real-madrid-transfer-kidd-column/","keywords":["Football","Sport","Champions League","Real Madrid transfer news"],"creator":["Dave Kidd"],"video_url":null,"description":null,"content":"GARETH BALE collected five Champions League winner’s medals with Real Madrid, scoring in two finals, including an extraordinary bicycle kick against Liverpool in 2018. So you’d be hard-pressed to describe the Welshman’s nine-year stint at the Bernabeu as any sort of failure. Yet Bale left the Spanish capital largely unloved. Chiefly because he made it clear Real were not his favourite team and that football wasn’t even his favourite sport. Bale was ‘The Golfer’, who loved playing for Wales, but never Real — a remote figure who never embraced the language or culture. A man who never seemed to fully appreciate what it was to play for the world’s most famous club and who outstayed his welcome as a bench-warming trouserer of fortunes. As Jude Bellingham becomes the latest British footballer to roll up at the Bernabeu, it is clear the England midfielder is learning from Bale’s mistakes. This country’s most expensive footballer is still a gangly Brummie teenager — he turns 20 next week — and so you might have imagined him to look a little awkward at last week’s media unveiling. Especially as he was inheriting Zinedine Zidane’s famed No 5 shirt and had just signed his six-year contract in a room with “14 European Cups staring at me”. But while no footballer is judged primarily on his media performances, Bellingham’s appearance was a triumph. He was humble and gracious, likeable and amusing. CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 He blew sunshine up a prominent Spanish-based English journalist — a genuine rather than cynical move — and had a demanding local press corps eating out of his hand. “A Galactico for the next ten years,” was one newspaper’s prediction. But ‘Galactico’ became a byword for an era when Real stockpiled famous, experienced players with commercial clout, while never producing a balanced team and rarely winning anything. Bellingham is part of an exciting Real rebuild centring on youth. Eduardo Camavinga, 20, Aurelien Tchouameni, 23, and Bellingham will eventually replace the midfield triangle of Luka Modric , 37, Toni Kroos, 33, and the already-departed 31-year-old Casemiro . Kylian Mbappe, 24, may well arrive too because Real remains the des res of the world’s best young players, whatever the Premier League’s lure. It helps that Bellingham had already illuminated a World Cup and spent three years at Borussia Dortmund , sometimes captaining a mighty club in front of the Westfalenstadion’s vast Yellow Wall. Those kind of experiences tend to knock the shyness out of a kid. In Dortmund, he befriended old club legends, sought their advice and became part of the fabric, rather than just another foreign player passing through. In Madrid, Bellingham has hired an FA player-liaison officer to work for him full-time as he settles in — a move which suggests he wants to impress off the pitch too. Many are surprised Bellingham chose Real, rather than a move back to England. Yet those close to him insist this has always been his dream. As with many of his generation, his formative experiences of watching football came during the peak years of the Messi-Ronaldo El Clasicos. There would have been far more replica Real Madrid and Barcelona shirts around the playing fields of Birmingham than those of Liverpool or the Manchester clubs. The fixtures for the next LaLiga season are released tomorrow and Bellingham will be eagerly seeking out the dates when he will face champions Barca and become part of that grand and bitter rivalry. Bellingham, who left Birmingham City at 16, has never played in the Premier League and is unlikely to do so until he is in his mid-to-late 20s. That is remarkable for the finest English footballer of his generation during an era of supreme Premier League financial dominance. It does, though, suggest a bravery, curiosity, and independence of thought which will serve him well. There should still be some caution. Bellingham is a high-mileage player, with a phenomenal 200 senior appearances in club and international football as a teenager. He has missed England’s last two matches with a long-standing knee problem and players who play too much, too early, often fail to last the distance. But like Bale before him, Bellingham has the talent, adaptability, attitude and physique to become a major success in Madrid. He might not end up with five Champions League winner’s medals, but Bellingham is very likely to discover the affection and acceptance which eluded Bale. MARTIN TYLER may have been the voice of English football’s bold new era of world domination, as Sky’s lead commentator since the Premier League’s inception 31 years ago. But one of the chief reasons why he was such a success was his strong bond with the game’s roots. Tyler delayed his move into broadcast journalism by several years be- cause he was a useful centre-forward for Corinthian Casuals. And he continued to coach at non-league sides such as Woking, the club he has always supported, and Dartford while calling matches in the world’s richest league. This brought him authenticity to go with his eloquence. Tyler — who is leaving Sky aged 77 but insisting he has not retired from commentating — will be missed. GARY O’NEIL and Bournemouth felt a perfect match — understated, overachieving and entertaining. And while there have been some savagely unexpected managerial sackings which have worked out well for clubs, O’Neil’s dismissal — after he saved the club from relegation — suggests a new American ownership with serious delusions of grandeur. WHEN Spurs appointed Ange Postecoglou as their new manager, Celtic fans told us to expect a treat when watching the Aussie’s revolutionary ‘Angeball’ approach. Turns out Postecoglou expects his players to run around a lot, win the ball back quickly and try to score a lot of goals — much like every other elite coach. Which brings us to Kai Havertz — the Chelsea striker pursued by Arsenal . In a footballing landscape that is obsessed with pace, here is a modern-day Dimitar Berbatov, who is all about subtlety of touch, slowing the game down, finding the time and space to do something different. Arsenal could do with an out-and-out goalscorer, which Havertz — despite scoring the winner in the 2021 Champions League final — is not. But his signing could prove a masterstroke from Mikel Arteta. And Arsene Wenger would definitely approve of it. GOOD to see Jack Grealish becoming Manchester City ’s answer to Freddie Flintoff by leading the drinking spree on his club’s open-top bus parade. If a likeable, good-looking, young multi-millionaire cannot fully enjoy winning the Treble, then what’s the point of being a likeable, good-looking, young multi-millionaire Treble winner? Next expect Grealish to head out into the Caribbean on a pedalo — Flintoff-style, several sheets to the wind — then become one of our top light entertainers. WHY all the high-horsemanship from our Australian friends after England bowler Ollie Robinson shouted “f*** off you f***ing p***k” at Usman Khawaja after dismissing the opener at Edgbaston? Last time I was in Australia, that counted as a warm expression of endearment. The incident does, though, confirm the greatest myth in cricket — that sledging is often imaginative and witty. WHILE the fast-scoring of England’s Bazball approach thrills the nation, Dom ­Sibley — ditched by the national team two years ago — ground his way to the slowest century in County Championship history. It took Surrey opener Sibley almost nine hours to reach three figures. As a display of ‘b****cks-to-the-zeitgeist’ contrariness, it takes some beating. But it worked. Surrey reached a target of 501 to beat Kent.","pubDate":"2023-06-19 23:07:42","image_url":null,"source_id":"thesun_ie","category":["sports"],"country":["ireland"],"language":"english"},{"title":"NO WEAK OPPONENTS: Coach HOUGHTON","link":"https://www.hmetro.co.zw/no-weak-opponents-coach-houghton/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Blessing Malinganiza Zimbabwe head coach, Dave Houghton has thrown caution to the wind insisting that there are no weaker sides in the ongoing ICC Men’s Cricket World Cup Qualifier underway in the country as the Chevrons prepare for this morning’s clash against Netherlands. The locals played a blinder of a match, accounting for Nepal by […]","content":"H-Metro Blessing Malinganiza Zimbabwe head coach, Dave Houghton has thrown caution to the wind insisting that there are no weaker sides in the ongoing ICC Men’s Cricket World Cup Qualifier underway in the country as the Chevrons prepare for this morning’s clash against Netherlands. The locals played a blinder of a match, accounting for Nepal by a heavy eight-wicket win in their opening match of the Qualifier. Captain Craig Ervine scored an unbeaten 121 from 128 balls while all-rounder Sean Williams smashed Zimbabwe’s fastest One Day International 100 from just 70 balls to close the match on 102 not out. Prior to Williams’ milestone on a day he reached his 150th ODI, former captain, Brendan Taylor held the record of a fastest ODI hundred which he achieved from 79 balls against Ireland at the 2015 World Cup hosted by Australia and New Zealand. “Every team that we play in this tournament is a good side, they didn’t arrive here by accident,” Houghton said at a press conference yesterday. “We will be playing our game the way we have been building up over the last few months. “We have got a solid seam attack, we have got some good spinners, our fielding is good, it’s sharp, we have a good batting line up. We will be doing that. “Holland is a decent team, we won the last series 2-1 (In March at Harare Sports Club) but they have made six or seven changes, so I am not sure we know all their players that well, but this tournament for me is about what we do on the field. If we do what we do well we should win it.” Wicketkeeper batsman, Joylord Gumbie made his ODI debut against Nepal scoring 25 up the order before he was given out LBW. All-rounder Wessly Madhevere chipped in with 32 runs as Zimbabwe scored 291/2 in response to Nepal’s 290/8. Earlier, the bowlers had struggled to get wickets after Ervine elected to field upon winning the toss. It was however offspinner Wellington Masakadza who got the set batsmen for Nepal in successive overs. Masakadza finished with two wickets while Richard Ngarava enjoyed success later on with four wickets for 43 runs from nine overs. “I think our batting got it right. It was a good batting performance chasing such a big score. We made it look easy, our bowling and feeling wasn’t great at the start but we came back around 30 overs. Lots of fighting spirit, good resilience, we didn’t have a good start but we came back,” added Houghton. Netherlands captain Scott Edwards said confidence is high having played a good series against Zimbabwe in Harare in March. “We take a lot of confidence in playing three games in these conditions, I think we are quite lucky in that regard. We know we have played them recently so we know how their batters go about it and how their bowlers go about it,” he said. Last time it was a close series, we feel like we match up well against them. We are looking forward to tomorrow (today). Hopefully there will be a big crowd, all cricketers enjoy playing in front of a big crowd regardless of who they are backing. The boys are looking forward to the challenge and hopefully it brings the best from us.”","pubDate":"2023-06-19 22:08:24","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"WC Qualifier: அயர்லாந்துக்கு அணிக்கு அதிர்ச்சி அளித்த ஓமன்.. உலககோப்பை தகுதிச்சுற்றில் அபார வெற்றி..!","link":"https://tamil.abplive.com/sports/cricket/world-cup-qualifier-2023-oman-won-against-3-wicket-different-ireland-124097","keywords":["கிரிக்கெட்"],"creator":["சுகுமாறன்"],"video_url":null,"description":"உலககோப்பை தொடரில் முன்னேறுவதற்காக கடைசி 2 இடங்களுக்காக 10 அணிகள் தகுதிச்சுற்று தொடரில் ஆடி வருகின்றனர். முன்னாள் சாம்பியன்களான இலங்கை, வெஸ்ட் இண்டீஸ் ஆகிய அணிகளுடன் ஓமன், நேபாளம், அமெரிக்கா போன்ற அணிகளும் களமிறங்கியுள்ளன. பலமிகுந்த அயர்லாந்து: ஜிம்பாப்வேயில் நடைபெற்று வரும் இந்த தொடரில் புலவாயோ நகரில் நடைபெற்ற நேற்றைய போட்டியில் அயர்லாந்து – ஓமன் அணிகள் நேருக்கு நேர் மோதின. அயர்லாந்து அணி பாகிஸ்தான் அணியையே ஏற்கனவே வீழ்த்திய அனுபவம் கொண்ட அணி என்பதாலும், ஓமனுடன் ஒப்பிடும்போது அயர்லாந்து அணி பலமிகுந்த அணி என்பதாலும் இந்த போட்டியில் அயர்லாந்து எளிதாக வெற்றி பெற்று விடும் என்றே ரசிகர்கள் நினைத்தனர். ஆனால், நடந்ததோ வேறு. டாஸ் வென்ற ஓமன் அணி முதலில் பந்துவீசியது. அயர்லாந்து அணிக்கு மெக்ப்ரைன் – ஸ்டிர்லிங் சிறப்பான தொடக்கம் அளித்தனர். 51 ரன்களை எட்டியபோது ஸ்டிர்லிங் 23 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து களமிறங்கிய கேப்டன் பால்பிரைன் நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடி வந்த மெக்பிரைன் 20 ரன்களில் அவுட்டாக, கேப்டன் பால்பிரைன் 7 ரன்களில் அவுட்டானார். 282 ரன்கள் டார்கெட்: அடுத்து ஹாரி டெக்டர் – டக்கருடன் ஜோடி சேர்ந்தார். களமிறங்கியது முதல் அதிரடியாக டக்கர் 18 பந்தில் 5 பவுண்டரியுடன் 26 ரன்கள் எடுத்த நிலையில் ஆயன்கான் பந்தில் போல்டானார். 107 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த அயர்லாந்து அணிக்காக டெக்டர் – டாக்ரெல் ஜோடி சிறப்பாக ஆடியது. இவர்கள் இருவரும் நிதானமாகவும், நேர்த்தியான பந்துகளை மட்டும் அடித்தும் ஆடினர். இதனால், அயர்லாந்து ஸ்கோர் மெல்ல, மெல்ல ஏறியது. சிறப்பாக ஆடி அரைசதம் அடித்த டெக்டர் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த டெலனி 14 பந்துகளில் அதிரடியாக 20 ரன்கள் எடுக்க, மார்க் அடெய்ர் 15 ரன்களும் எடுத்து ஆட்டமிழக்க மறுமுனையில் டாக்ரெல் கடைசி கட்டத்தில் அதிரடி காட்டினர், இதனால், அயர்லாந்து அணி 50 ஓவர்களில் 7 விக்கெட் இழப்பிற்கு 281 ரன்கள் எடுத்தது. டாக்ரெல் 89 பந்துகளில் 7 பவுண்டரி 2 சிக்ஸருடன் 91 ரன்களுடனும், ஹூமே 12 பந்தில் 1 பவுண்டரியுடன் 15 ரன்கள் எடுத்தும் களத்தில் இருந்தனர். அதிரடி காட்டிய ஓமன்: அடுத்து 285 ரன்கள் என்ற கடின இலக்குடன் களமிறங்கிய ஓமனுக்கு தொடக்கமே அதிர்ச்சி காத்திருந்தது. தொடக்க வீரர் ஜதீந்தர் சிங் 1 ரன்னில் அவுட்டாக அடுத்து ஜோடி சேர்ந்த காஷ்யப் – அகீப் ஜோடி அதிரடியாக ஆடியது. சிறப்பாக ஆடிய இருவரும் அரைசதம் அடித்தனர். அகிப் இலியாஸ் 49 பந்துகளில் 8 பவுண்டரியுடன் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த கேப்டன் மக்சூத் பொறுப்புடன் ஆடினார். மறுமுனையில் சிறப்பாக ஆடிய காஷ்யப் 74 பந்தில் 6 பவுண்டரி 1 சிக்ஸருடன் 72 ரன்கள் எடுத்த நிலையில் அவுட்டானார். பின்னர், கேப்டன் மக்சூத் – நதீம் ஜோடி சிறப்பாக ஆடினர். அணியின் ஸ்கோர் 222 ரன்களை எட்டியபோது கேப்டன் மக்சூத் 59 ரன்களில் ஆட்டமிழந்தார். அவர் 67 பந்துகளில் 4 பவுண்டரி 1 சிக்ஸர் விளாசினார். அடுத்து வந்த ஆயன் கான் 21 பந்தில் 21 ரன்களில் வெளியேற அடுத்து மேற்கொண்டு விக்கெட் விழாமல் ஓமன் வீரர்கள் பார்த்துக்கொண்டனர். அயர்லாந்துக்கு அதிர்ச்சி: கடைசியில் ஓமன் 48.1 ஓவர்களில் 285 ரன்கள் எடுத்து அபார வெற்றி பெற்றது. முகமது நதீம் 53 பந்துகளில் 4 பவுண்டரியுடன் 46 ரன்களுடனும், சோயப் கான் 17 பந்தில் 3 பவுண்டரியுடன் 19 ரன்களுடனும் களத்தில் இருந்தனர். பலமிகுந்த அயர்லாந்து அணியை ஓமன் அணி வீழ்த்தியதை அந்த நாட்டு ரசிகர்கள் கொண்டாடி வருகின்றனர்.   ","content":"உலககோப்பை தொடரில் முன்னேறுவதற்காக கடைசி 2 இடங்களுக்காக 10 அணிகள் தகுதிச்சுற்று தொடரில் ஆடி வருகின்றனர். முன்னாள் சாம்பியன்களான இலங்கை, வெஸ்ட் இண்டீஸ் ஆகிய அணிகளுடன் ஓமன், நேபாளம், அமெரிக்கா போன்ற அணிகளும் களமிறங்கியுள்ளன. பலமிகுந்த அயர்லாந்து: ஜிம்பாப்வேயில் நடைபெற்று வரும் இந்த தொடரில் புலவாயோ நகரில் நடைபெற்ற நேற்றைய போட்டியில் அயர்லாந்து – ஓமன் அணிகள் நேருக்கு நேர் மோதின. அயர்லாந்து அணி பாகிஸ்தான் அணியையே ஏற்கனவே வீழ்த்திய அனுபவம் கொண்ட அணி என்பதாலும், ஓமனுடன் ஒப்பிடும்போது அயர்லாந்து அணி பலமிகுந்த அணி என்பதாலும் இந்த போட்டியில் அயர்லாந்து எளிதாக வெற்றி பெற்று விடும் என்றே ரசிகர்கள் நினைத்தனர். ஆனால், நடந்ததோ வேறு. டாஸ் வென்ற ஓமன் அணி முதலில் பந்துவீசியது. அயர்லாந்து அணிக்கு மெக்ப்ரைன் – ஸ்டிர்லிங் சிறப்பான தொடக்கம் அளித்தனர். 51 ரன்களை எட்டியபோது ஸ்டிர்லிங் 23 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து களமிறங்கிய கேப்டன் பால்பிரைன் நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடி வந்த மெக்பிரைன் 20 ரன்களில் அவுட்டாக, கேப்டன் பால்பிரைன் 7 ரன்களில் அவுட்டானார். googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); 282 ரன்கள் டார்கெட்: அடுத்து ஹாரி டெக்டர் – டக்கருடன் ஜோடி சேர்ந்தார். களமிறங்கியது முதல் அதிரடியாக டக்கர் 18 பந்தில் 5 பவுண்டரியுடன் 26 ரன்கள் எடுத்த நிலையில் ஆயன்கான் பந்தில் போல்டானார். 107 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த அயர்லாந்து அணிக்காக டெக்டர் – டாக்ரெல் ஜோடி சிறப்பாக ஆடியது. இவர்கள் இருவரும் நிதானமாகவும், நேர்த்தியான பந்துகளை மட்டும் அடித்தும் ஆடினர். இதனால், அயர்லாந்து ஸ்கோர் மெல்ல, மெல்ல ஏறியது. சிறப்பாக ஆடி அரைசதம் அடித்த டெக்டர் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த டெலனி 14 பந்துகளில் அதிரடியாக 20 ரன்கள் எடுக்க, மார்க் அடெய்ர் 15 ரன்களும் எடுத்து ஆட்டமிழக்க மறுமுனையில் டாக்ரெல் கடைசி கட்டத்தில் அதிரடி காட்டினர், இதனால், அயர்லாந்து அணி 50 ஓவர்களில் 7 விக்கெட் இழப்பிற்கு 281 ரன்கள் எடுத்தது. டாக்ரெல் 89 பந்துகளில் 7 பவுண்டரி 2 சிக்ஸருடன் 91 ரன்களுடனும், ஹூமே 12 பந்தில் 1 பவுண்டரியுடன் 15 ரன்கள் எடுத்தும் களத்தில் இருந்தனர். அதிரடி காட்டிய ஓமன்: அடுத்து 285 ரன்கள் என்ற கடின இலக்குடன் களமிறங்கிய ஓமனுக்கு தொடக்கமே அதிர்ச்சி காத்திருந்தது. தொடக்க வீரர் ஜதீந்தர் சிங் 1 ரன்னில் அவுட்டாக அடுத்து ஜோடி சேர்ந்த காஷ்யப் – அகீப் ஜோடி அதிரடியாக ஆடியது. சிறப்பாக ஆடிய இருவரும் அரைசதம் அடித்தனர். அகிப் இலியாஸ் 49 பந்துகளில் 8 பவுண்டரியுடன் 52 ரன்கள் எடுத்த நிலையில் அவுட்டானார். அடுத்து வந்த கேப்டன் மக்சூத் பொறுப்புடன் ஆடினார். மறுமுனையில் சிறப்பாக ஆடிய காஷ்யப் 74 பந்தில் 6 பவுண்டரி 1 சிக்ஸருடன் 72 ரன்கள் எடுத்த நிலையில் அவுட்டானார். பின்னர், கேப்டன் மக்சூத் – நதீம் ஜோடி சிறப்பாக ஆடினர். அணியின் ஸ்கோர் 222 ரன்களை எட்டியபோது கேப்டன் மக்சூத் 59 ரன்களில் ஆட்டமிழந்தார். அவர் 67 பந்துகளில் 4 பவுண்டரி 1 சிக்ஸர் விளாசினார். அடுத்து வந்த ஆயன் கான் 21 பந்தில் 21 ரன்களில் வெளியேற அடுத்து மேற்கொண்டு விக்கெட் விழாமல் ஓமன் வீரர்கள் பார்த்துக்கொண்டனர். அயர்லாந்துக்கு அதிர்ச்சி: கடைசியில் ஓமன் 48.1 ஓவர்களில் 285 ரன்கள் எடுத்து அபார வெற்றி பெற்றது. முகமது நதீம் 53 பந்துகளில் 4 பவுண்டரியுடன் 46 ரன்களுடனும், சோயப் கான் 17 பந்தில் 3 பவுண்டரியுடன் 19 ரன்களுடனும் களத்தில் இருந்தனர். பலமிகுந்த அயர்லாந்து அணியை ஓமன் அணி வீழ்த்தியதை அந்த நாட்டு ரசிகர்கள் கொண்டாடி வருகின்றனர்.","pubDate":"2023-06-20 04:02:06","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/20/64f4773a43e6fe8a453d6910b2d3c9751687232946064102_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Tamil"},{"title":"Ashes Test: இறுதிக்கட்டத்தில் ஆஷஸ்.. 281 ரன்களை எட்டிப்பிடிக்குமா ஆஸ்திரேலியா..? வெற்றி பெறுமா இங்கிலாந்து..?","link":"https://tamil.abplive.com/sports/cricket/ashes-test-2023-australia-have-281-runs-target-against-england-know-full-details-124091","keywords":["கிரிக்கெட்"],"creator":["சுகுமாறன்"],"video_url":null,"description":"பர்மிங்காமில் நடைபெற்று வரும் ஆஷஸ் தொடரின் முதல் டெஸ்ட் போட்டி விறுவிறுப்பான இறுதிக்கட்டத்தை எட்டியுள்ளது. முதல் இன்னிங்சில் ஜோ ரூட்டின் சதத்தால் இங்கிலாந்து 393 ரன்களை குவிக்க, ஆஸ்திரேலியா கவாஜா சதத்தால் 383 ரன்களை குவிக்க 2வது இன்னிங்சில் இமாலய இலக்கை நிர்ணயிக்கும் நோக்கில் களமிறங்கிய இங்கிலாந்து அணி 4ம் நாளான நேற்று ஆட்டத்தை தொடங்கியது. 273 ரன்களுக்கு ஆல் அவுட்: ஒல்லி போப்பும், ஜோ ரூட்டும் ஆட்டத்தை தொடர்ந்தனர். ஒல்லி போப் 14 ரன்களில் அவுட்டாக அடுத்து வந்த ஹாரி ப்ரூக் – ஜோ ரூட் ஜோடி நிதானமாக ஆடியது. அரைசதம் அடிப்பார் என்று எதிர்பார்க்கப்பட்ட ஜோ ரூட் 46 ரன்களில் அவுட்டானார். அவர் ஆட்டமிழந்த சிறிது நேரத்தில் 46 ரன்களில் ஆட்டமிழக்க 150 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த இங்கிலாந்து அணிக்கு கேப்டன் பென்ஸ்டோக்ஸ் சிறப்பாக ஆடினார். அவருக்கு ஜானி பார்ஸ்டோ நல்ல ஒத்துழைப்பு அளித்தார். பார்ஸ்டோ 39 பந்துகளில் 3 பவுண்டரியுடன் 20 ரன்களை எடுத்த நிலையில் அவுட்டாக, அடுத்து வந்த மொயின் அலி நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடிய கேப்டன் ஸ்டோக்ஸ் 66 பந்தில் 5 பவுண்டரியுடன் 43 ரன்கள் எடுத்த நிலையில் அவுட்டானார். கடைசியில் ராபின்சன் 27 ரன்கள் எடுக்க இங்கிலாந்து அணி 66.2 ஓவர்களில் அனைத்து விக்கெட்டுகளையும் இழந்து 273 ரன்கள் எடுத்தது. வெற்றி பெறப்போவது யார்? இதையடுத்து, ஆஸ்திரேலிய அணிக்கு 281 ரன்களை இங்கிலாந்து அணி இலக்காக நிர்ணயித்தது. இதையடுத்து, இந்த மைதானத்தில் 281 ரன்கள் என்பது சற்று கடினமானதே ஆகும். இதைத்தொடர்ந்து ஆட்டத்தை தொடங்கிய உஸ்மான் கவாஜா – டேவிட் வார்னர் ஜோடி நிதானமாக ஆட்டத்தை தொடங்கினர். கடந்த இன்னிங்சில் சொதப்பிய வார்னர் 57 பந்துகளில் 4 பவுண்டரியுடன் 36 ரன்கள் எடுத்த நிலையில் ஆட்டமிழந்தார்.  அடுத்து மிகவும் எதிர்பார்க்கப்பட்ட லபுஷேனே களமிறங்கினார். அவர் 15 பந்துகளில் 3 பவுண்டரி விளாசிய நிலையில் 13 ரன்கள் எடுத்திருந்தபோது பிராட் பந்தில் அவுட்டானார். அடுத்து வந்த ஸ்டீவ் ஸ்மித் இந்த இன்னிங்சில் அசத்துவார் என்று எதிர்பார்த்த ரசிகர்களுக்கு ஏமாற்றமே மிஞ்சியது. 13 பந்துகளில் 6 ரன்கள் எடுத்திருந்த ஸ்டீவ் ஸ்மித்தை பிராட் அவுட்டாக்கினார். நெருக்கடியில் ஆஸ்திரேலியா? நேற்றைய ஆட்ட நேர முடிவில் 30 ஓவர்களில் 3 விக்கெட்டுகளை இழந்து ஆஸ்திரேலிய அணி 107 ரன்கள் எடுத்திருந்தது. கவாஜா 34 ரன்களுடனும், போலந்து 13 ரன்களுடனும் களத்தில் உள்ளனர். கடைசி நாளான இன்று ஆஸ்திரேலியாவின் வெற்றிக்கு 174 ரன்கள் தேவைப்படுகிறது. முதல் டெஸ்ட் போட்டியை வெற்றியுடன் தொடங்க இங்கிலாந்திற்கு இன்னும் 7 விக்கெட்டுகள் தேவைப்படுகிறது. முக்கிய விக்கெட்டுகளான டேவிட் வார்னர், ஸ்டீவ் ஸ்மித், லபுஷேனே அவுட்டாகியுள்ள நிலையில் ஆஸ்திரேலியா நெருக்கடிக்கு ஆளாகியுள்ளது. அந்த அணியில் ட்ராவிஸ் ஹெட், கிரீன், கேரி, கம்மின்ஸ் சிறப்பாக ஆட வேண்டிய கட்டாயத்தில் உள்ளனர். கடைசி நாள் பரப்பான கட்டத்தை எட்டியுள்ளதால் இரு நாட்டு ரசிகர்களும் வெற்றிபெற போவது யார் என்பதை காண ஆர்வமுடன் உள்ளனர். மேலும் படிக்க: WC Qualifiers: வெஸ்ட் இண்டீசுக்கு எதிராக சதமடித்த அமெரிக்க வீரர்.. உலகக்கோப்பை தகுதிச்சுற்றில் அசத்தல்..! மேலும் படிக்க: IND vs WI: புஜாராவுக்கு இடமில்லையா..? அவருக்கு பதிலாக இந்திய அணியில் யார்..? வெஸ்ட் இண்டீஸ் தொடர் ஒரு பார்வை!","content":"பர்மிங்காமில் நடைபெற்று வரும் ஆஷஸ் தொடரின் முதல் டெஸ்ட் போட்டி விறுவிறுப்பான இறுதிக்கட்டத்தை எட்டியுள்ளது. முதல் இன்னிங்சில் ஜோ ரூட்டின் சதத்தால் இங்கிலாந்து 393 ரன்களை குவிக்க, ஆஸ்திரேலியா கவாஜா சதத்தால் 383 ரன்களை குவிக்க 2வது இன்னிங்சில் இமாலய இலக்கை நிர்ணயிக்கும் நோக்கில் களமிறங்கிய இங்கிலாந்து அணி 4ம் நாளான நேற்று ஆட்டத்தை தொடங்கியது. 273 ரன்களுக்கு ஆல் அவுட்: ஒல்லி போப்பும், ஜோ ரூட்டும் ஆட்டத்தை தொடர்ந்தனர். ஒல்லி போப் 14 ரன்களில் அவுட்டாக அடுத்து வந்த ஹாரி ப்ரூக் – ஜோ ரூட் ஜோடி நிதானமாக ஆடியது. அரைசதம் அடிப்பார் என்று எதிர்பார்க்கப்பட்ட ஜோ ரூட் 46 ரன்களில் அவுட்டானார். அவர் ஆட்டமிழந்த சிறிது நேரத்தில் 46 ரன்களில் ஆட்டமிழக்க 150 ரன்களுக்கு 5 விக்கெட்டுகளை இழந்த இங்கிலாந்து அணிக்கு கேப்டன் பென்ஸ்டோக்ஸ் சிறப்பாக ஆடினார். அவருக்கு ஜானி பார்ஸ்டோ நல்ல ஒத்துழைப்பு அளித்தார். பார்ஸ்டோ 39 பந்துகளில் 3 பவுண்டரியுடன் 20 ரன்களை எடுத்த நிலையில் அவுட்டாக, அடுத்து வந்த மொயின் அலி நிதானமாக ஆடினார். மறுமுனையில் நிதானமாக ஆடிய கேப்டன் ஸ்டோக்ஸ் 66 பந்தில் 5 பவுண்டரியுடன் 43 ரன்கள் எடுத்த நிலையில் அவுட்டானார். கடைசியில் ராபின்சன் 27 ரன்கள் எடுக்க இங்கிலாந்து அணி 66.2 ஓவர்களில் அனைத்து விக்கெட்டுகளையும் இழந்து 273 ரன்கள் எடுத்தது. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); வெற்றி பெறப்போவது யார்? இதையடுத்து, ஆஸ்திரேலிய அணிக்கு 281 ரன்களை இங்கிலாந்து அணி இலக்காக நிர்ணயித்தது. இதையடுத்து, இந்த மைதானத்தில் 281 ரன்கள் என்பது சற்று கடினமானதே ஆகும். இதைத்தொடர்ந்து ஆட்டத்தை தொடங்கிய உஸ்மான் கவாஜா – டேவிட் வார்னர் ஜோடி நிதானமாக ஆட்டத்தை தொடங்கினர். கடந்த இன்னிங்சில் சொதப்பிய வார்னர் 57 பந்துகளில் 4 பவுண்டரியுடன் 36 ரன்கள் எடுத்த நிலையில் ஆட்டமிழந்தார். அடுத்து மிகவும் எதிர்பார்க்கப்பட்ட லபுஷேனே களமிறங்கினார். அவர் 15 பந்துகளில் 3 பவுண்டரி விளாசிய நிலையில் 13 ரன்கள் எடுத்திருந்தபோது பிராட் பந்தில் அவுட்டானார். அடுத்து வந்த ஸ்டீவ் ஸ்மித் இந்த இன்னிங்சில் அசத்துவார் என்று எதிர்பார்த்த ரசிகர்களுக்கு ஏமாற்றமே மிஞ்சியது. 13 பந்துகளில் 6 ரன்கள் எடுத்திருந்த ஸ்டீவ் ஸ்மித்தை பிராட் அவுட்டாக்கினார். நெருக்கடியில் ஆஸ்திரேலியா? நேற்றைய ஆட்ட நேர முடிவில் 30 ஓவர்களில் 3 விக்கெட்டுகளை இழந்து ஆஸ்திரேலிய அணி 107 ரன்கள் எடுத்திருந்தது. கவாஜா 34 ரன்களுடனும், போலந்து 13 ரன்களுடனும் களத்தில் உள்ளனர். கடைசி நாளான இன்று ஆஸ்திரேலியாவின் வெற்றிக்கு 174 ரன்கள் தேவைப்படுகிறது. முதல் டெஸ்ட் போட்டியை வெற்றியுடன் தொடங்க இங்கிலாந்திற்கு இன்னும் 7 விக்கெட்டுகள் தேவைப்படுகிறது. முக்கிய விக்கெட்டுகளான டேவிட் வார்னர், ஸ்டீவ் ஸ்மித், லபுஷேனே அவுட்டாகியுள்ள நிலையில் ஆஸ்திரேலியா நெருக்கடிக்கு ஆளாகியுள்ளது. அந்த அணியில் ட்ராவிஸ் ஹெட், கிரீன், கேரி, கம்மின்ஸ் சிறப்பாக ஆட வேண்டிய கட்டாயத்தில் உள்ளனர். கடைசி நாள் பரப்பான கட்டத்தை எட்டியுள்ளதால் இரு நாட்டு ரசிகர்களும் வெற்றிபெற போவது யார் என்பதை காண ஆர்வமுடன் உள்ளனர். மேலும் படிக்க: WC Qualifiers: வெஸ்ட் இண்டீசுக்கு எதிராக சதமடித்த அமெரிக்க வீரர்.. உலகக்கோப்பை தகுதிச்சுற்றில் அசத்தல்..! மேலும் படிக்க: IND vs WI: புஜாராவுக்கு இடமில்லையா..? அவருக்கு பதிலாக இந்திய அணியில் யார்..? வெஸ்ட் இண்டீஸ் தொடர் ஒரு பார்வை!","pubDate":"2023-06-20 03:15:30","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/20/1d5552444a7f5e6d14b6d9ee9a5206bc1687230509158102_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Tamil"},{"title":"On Stokes' \"Umbrella Field\" For Khawaja, Ponting's Reaction Says It All","link":"https://sports.ndtv.com/cricket/on-ben-stokes-umbrella-field-for-usman-khawaja-ricky-pontings-reaction-says-it-all-4133471","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes' \"umbrella field\" setting for Usman Khawaja even caught Australia great Ricky Ponting off-guard.","content":"The first Ashes Test between Australia and England is off to a flier, with every single day of the Edgbaston encounter unfolding new incidents to talk about. England skipper Ben Stokes ' 'umbrella-like' field to pile the pressure on Australia batter Usman Khawaja became a huge talking-point on social media. As fans and multiple former cricketers hailed Stokes' captaincy, Australia great Ricky Ponting also gave a million-dollar reaction to Stokes' tactical decision, admitted that he had never seen anything like that before. \"I don't think I've ever seen a field like that in Test cricket before. There was just an umbrella of fielders around in front of the batsman's face. And it was all about bowling a couple of slower balls and being able to bowl a yorker. And sure enough, Khawaja used his feet, gave himself some room, gave up his stumps, and the yorker knocked his off stump out of the ground,\" Ponting told the ICC . \"It's fantastic stuff. It's really refreshing for the Test game to see a team play this way and a captain happy to try everything he possibly can.\" Further lauding Stokes' captaincy, Ponting lauded the England skipper's willingness to explore all options of picking up a wicket, pressing every little opportunity he senses to unnerve the batter. \"It's hard to keep up with them all, he's making a change almost every ball, which is great, it's proactive captaincy. He's always trying to move the game forward, he's looking at any little way that he possibly can to pick up a wicket and change the momentum of the game,\" Ponting said. What a ball from Robinson, Fantastic by Stokes as a captain. End of an incredible knock from Khawaja. pic.twitter.com/8Bz5ejFAvj \"With Khawaja's innings, I'd hate to try and count how many times he changed the field for him and how many bowling changes and tactical changes he made to try and get Khawaja out - and then it finally worked,\" the ex-Australia captain said. Australia were bowled out for 386 while chasing England's first innings score of 393. By the end of Day 3, Australia had picked up two English wickets, with the score reading 28/2 at the end of 10.3 overs.","pubDate":"2023-06-20 02:40:31","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Marnus Labuschagne is called a cheat by English fans after claiming he took dodgy Ashes catch","link":"https://247newsaroundtheworld.com/sports/marnus-labuschagne-is-called-a-cheat-by-english-fans-after-claiming-he-took-dodgy-ashes-catch/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World First it was Cameron Green, now Marnus Labuschagne is called a cheat… The post Marnus Labuschagne is called a cheat by English fans after claiming he took dodgy Ashes catch appeared first on 247 News Around The World.","content":"First it was Cameron Green, now Marnus Labuschagne is called a cheat by English fans after claiming he took a dodgy catch to dismiss Ollie Robinson Marnus Labuschagne called a cheat by English fans Labuschagne claimed a catch where ball touched grass Fans chanted ‘Same old Aussies, always cheating’ By James Cooney For Daily Mail Australia and Scott Bailey For Australian Associated Press Published: 22:14 EDT, 19 June 2023 | Updated: 22:14 EDT, 19 June 2023 Marnus Labuschagne has been labelled a cheat by English cricket fans after claiming he took a stunning catch to remove Ollie Robinson during the opening Ashes Test at Edgbaston. The fired-up Birmingham crowd gave it to the Aussies on day four of the match, and Cameron Green also copped it from the Barmy Army on day three after taking a remarkable catch to dismiss Ben Duckett off the bowling of Scott Boland. Even though Green’s catch was reviewed and given out, the crowd chanted: ‘Same old Aussies, always cheating.’ As England looked for runs on day four, it was Labuschagne’s turn to get a grilling when he dived forward in an attempt to take a one-handed grab after tail-ender Ollie Robinson gloved a Josh Hazlewood delivery into the air. Labuschagne was slammed by English cricket fans for celebrating a non-catch that he claimed had dismissed Ollie Robinson (pictured) Replays showed that the ball had scraped the turf (pictured) – and the fans weren’t shy when it came to letting Labuschagne know all about it Labuschagne celebrated immediately, but the on-field umpires sent the decision upstairs and it didn’t take long for the third official to confirm the catch was not genuine. Replays showed that the Aussie took the ball cleanly – but the ball had scraped the turf. Unsurprisingly, the crowd weren’t happy and chanted ‘Same old Aussies, always cheating’ around the ground – the same song they sang to Green and have used at other points in the tense contest. Australia need 174 runs and England seven wickets to secure a famous Ashes victory after Stuart Broad’s heroics ensured the enthralling series opener would enter day five with everything to play for. Set 281 to win, Australia slumped from 0-61 to 3-107 at stumps, after David Warner, Marnus Labuschagne and Steve Smith all fell in the space of eight dramatic overs late on Monday. Broad was the chief destroyer for England, getting the world’s two top-ranked batsmen caught behind with Labuschagne nicking to an outswinger and Smith an inswinger. That has left-first innings centurion Usman Khawaja as Australia’s key man at Edgbaston, still at the crease on 34no with nightwatchman Scott Boland at the other end on 13. ‘It probably wasn’t our greatest 40 minutes to lose Marnus, Steve and Davey but you have to give credit where it’s due, England’s bowled well,’ Australia spinner Nathan Lyon said. The rowdy Birmingham crowd weren’t happy with the dubious catch and chanted ‘Same old, Aussies always cheating’ around the ground Australia need 174 runs and England seven wickets to secure a famous Ashes victory ‘But I’m backing our boys, I’m confident our boys can go out there and bat well. ‘It’s set up to be a thrilling Test match and it’s been one hell of a way to start the series.’ Rain is forecast for Tuesday morning in Birmingham and is due to clear by lunchtime, leaving all results still on the table. In a Test where no team has truly been in control, Australia briefly had the upper hand on Monday evening. Warner looked as good as he has at any point in the past three years as he cut and pulled his way to 36 on a wicket lacking pace. But when he edged off to Ollie Robinson on 36, the door was open for Broad to send the Edgbaston crowd into overdrive as he delivered on his plan to take down Labuschagne (13) and Smith (6) this summer. ‘Obviously they are No.1 and No.2 in the world, they know what they are doing.’ Broad said. ‘One thing we know as a bowling group, you have to put them under pressure early. If they get to 30 or 40 they don’t give it away cheaply. ‘Today has been one of those days that sums up Ashes cricket. ‘You think you’re getting ahead of the game and you lose a wicket. And the Aussies would have thought the same as well.’ Share or comment on this article: Post source: Daily mail","pubDate":"2023-06-20 02:40:03","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"“I wanted closure”: Ashwin Finally Opens Up About His ‘Explosive Tweet’ After WTC final","link":"https://www.cricketcountry.com/news/i-wanted-closure-ashwin-finally-opened-up-about-explosive-tweet-after-wtc-final-1099483","keywords":["News","Ashwin","India vs Australia","WTC Final"],"creator":["CricketCountry Staff"],"video_url":null,"description":"Weeks after Australia won WTC final, Ashwin who was not a part of India's playing XI, opened up after his tweet said he needed closure.","content":"Weeks after Australia won WTC final, Ashwin who was not a part of India's playing XI, opened up after his tweet said he needed closure. More than a week ago, Australia became World Test Champions after defeating India in the WTC final at the Ovals in London. Many experts and ex-cricketers slammed Rohit Sharma and coach Rahul Dravid's team selection. India's star pacer Umesh Yadav was picked in place of World No. 1 test bowler Ravichandran Ashwin in the playing XI. Right after the Baggy Greens lifted the trophy, Ashwin put out an explosive tweet expressing his disappointment over India's loss. \"Congratulations Australia on winning this #WTCFinal and closing out this cycle of test cricket. It is disappointing to end up on the wrong side of things, nevertheless it was a great effort over the last 2 years or so to get here in the first place. Amidst all the chaos and scathing assessments, i feel it's very important to acknowledge all my team mates who played in this cycle and most importantly the coaching and support staffs who have held on like a rock of support,\" he had tweeted. Congratulations Australia on winning this and closing out this cycle of test cricket. It is disappointing to end up on the wrong side of things, nevertheless it was a great effort over the last 2 years or so to get here in the first place. Amidst all the chaos and Ashwin ?? (@ashwinravi99) Ashwin Reveals The Reason Behind His Tweet After WTC Final Finally, Ashwin opened up about the tweet that he posted right after the WTC final. He revealed that it was just a closure for his omission from the WTC final squad. He further said that the fans were giving him sympathy, which he was not able to accept anymore. \"I have got no sympathy for my journey. It's very easy for me to go back and say, okay, this didn't happen for me or something happened for him. I don't give myself one second of sympathy. That's why I put that tweet because I wanted closure. I hated the fact that people are giving me sympathy, I just couldn't take it anymore\", Ashwin told Indian Express. \"In this social media age, you don't play and sometimes you are bigger than if you had played the game, right? People are talking, 'if he had played we would have won'. I am not sure if I had played, we would have won. I would have given my best and I definitely think I gave myself the best opportunity to succeed there. I also think I earned my stripes. That's all I can do. But the moment it got done, I just wanted to move on and focus on the TNPL for Dindigul Dragons,\" he concluded. Also Read LIVE SCOREBOARD","pubDate":"2023-06-20 02:39:10","image_url":"https://www.cricketcountry.com//wp-content/uploads/2023/06/Collage-Maker-20-Jun-2023-08-04-AM-5925.jpg","source_id":"cricketcountry","category":["sports"],"country":["india"],"language":"english"},{"title":"\"Out Cricket Is Bigger\": Pakistan Legend's Bold Stance On ODI WC Scenario","link":"https://sports.ndtv.com/cricket/out-cricket-is-bigger-pakistan-legends-bold-stance-on-odi-world-cup-scenario-4132870","keywords":null,"creator":null,"video_url":null,"description":"Pakistan legend Javed Miandad doesn't think the PCB should send its team to India for ODI World Cup 2023 unless the BCCI sends its team to Pakistan.","content":"Batting great Javed Miandad spewed fresh venom at India, saying Pakistan should not travel to the neighbouring country for matches, including this year's ICC ODI World Cup, until the BCCI agrees to send its team to his nation first. As per the draft schedule prepared by the ICC, Pakistan are scheduled to play India in the blockbuster World Cup clash at the Narendra Modi stadium in Ahmedabad on October 15. But the 66-year-old former captain feels it is now India's time to reciprocate by touring Pakistan. \"Pakistan has been to India in 2012 and even in 2016 now it is the turn of the Indians to come here,\" Miandad said. \"If I had to make a decision I would never go to India to play any match, even the World Cup. We are always ready to play them (India) but they never respond in the same manner. \"Pakistan cricket is bigger...we are still producing quality players. So I don't think even if we don't go to India it will make any difference to us,\" he added. پاکستان کو ورلڈ کپ کیلئے بھارت نہیں جانا چاہیئے... مودی نے کرکٹ کیساتھ بھارت کو بھی تباہ کردیا ہے، جاوید میانداد #Pakistan #India #AsiaCup2023 #Cricket pic.twitter.com/kpmSJkEsqs India last visited Pakistan in 2008 for the 50-over Asia Cup. Since then bilateral cricket ties were suspended due to long-standing geo-political tensions between the two nations. Miandad feels sports not be mixed with politics. \"I always say one can't choose its neighbours, so it is better to live by cooperating with each other. And I have always said cricket is a sport which brings people closer to each other and can remove misunderstandings and grievances between countries,\" he said. Miandad's fresh attack came after Pakistan were forced to host the upcoming Asia Cup in a hybrid model with India playing all their matches in Sri Lanka. This decision didn't go down well with Miandad, a vocal critic of India. \"It was on the cards that they would again not send their team to Pakistan for the Asia Cup so it is time we also take a strong stand now,\" he said. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Advertisement","pubDate":"2023-06-20 02:24:06","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"\"My Father Goes Through Twice The Trauma I Do\": Ravichandran Ashwin","link":"https://sports.ndtv.com/cricket/my-father-goes-through-twice-the-trauma-i-do-ravichandran-ashwin-4132822","keywords":null,"creator":null,"video_url":null,"description":"Often branded as an 'overthinker', Ravichandran Ashwin spoke about the 'trauma' he and his family have gone through over the years.","content":"One of the greats of the modern game, Ravichandran Ashwin has had quite a journey. From being central to India's plans across formats to becoming a specialist, before eventually returning to white-ball cricket, the off-spinner has had a roller-coaster of a ride. After Ashwin was snubbed for a spot in India's playing XI for the World Test Championship final against Australia, his absence became one of the biggest talking points on social media. The veteran cricketer, who has found himself in such positions on multiple occasions, opened up about the 'trauma' he and his family have gone through over the years and the 'overthinker' tag that has been given to him. When it comes to overseas Tests, Ashwin isn't one of the first names on the teamsheets. In the WTC final against Australia, it was Ravindra Jadeja who was preferred by the Indian team for the sole spinner's spot. There's a perception that Ashwin tends to 'overthink' on certain occasions, a mindset that has worked against him multiple times. In a chat with the Indian Express , Ashwin said that the tag of being an 'overthinker' was created to work against him. \"A lot of people marketed me and positioned me that I am an overthinker. A person who will get 15-20 matches on the go doesn't have to be mentally overthinking. A person who knows that they will get only two games will be traumatised and will be overthinking because it's my job. It's my journey. So this is what suits me,\" he said. \"If somebody is going to tell me, 'you're going to play 15 matches, you will be looked after, you will be this, you are responsible for players, you are in the leadership role, I won't be overthinking. Why would I? It's unfair to actually say somebody's an overthinker because that person's journey is his own. And nobody has a right or business to do that,\" he further said. On the 'overthinker' tag, Ashwin said that a lot of things have been said about him whenever the talk of taking up a 'leadership role' has come his way. \"It was created to work against me, right? And as I said, there have been statements that people have made all along when leadership question has come my way, there have been people who are been out there telling, my name is not the first name on the sheet when India tour abroad. \"Whether that name is first on the sheet or not is something I can't control. If I earned it, it's got to be there and that's my belief. As I said, I have no complaints, I have no time to sit back and throw punches or regret or anything. I have no regrets about anyone,\" he explained. During the interview, Ashwin also said that his family, especially his father, goes through twice the trauma he does whenever it comes to such affairs. \"The moment, the final finished I put out a tweet because I realised one thing is that I need closure. The moment I get the closure I can move on. There is no time to hang around. I have understood life a lot better now. \"The more I see it, the kind of trauma toll it takes on my family is incredible. My father has a heart problem and other issues. Every single game, every single day, something happens, he will call me. He is stressed. It's very easy for me to go out and play because it is still in my control. For my father, it is not and he goes through double of what I do. So looking at this in hindsight, everybody on the outside is irrelevant,\" Ashwin explained.","pubDate":"2023-06-20 02:20:55","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Ricky Ponting lands ruthless clapback on overexcited Kevin Pietersen claim over Joe Root’s Ashes innings","link":"https://7news.com.au/sport/cricket/ricky-ponting-lands-ruthless-clapback-on-overexcited-kevin-pietersen-claim-over-joe-roots-ashes-innings-c-11032505","keywords":null,"creator":["Digital Staff"],"video_url":null,"description":"The Australian legend maintained a straight face for his former adversary’s speech - but he was quick to fire back.","content":"Already arguably the most universally loved commentator in Australian sport, Ricky Ponting has earned even more plaudits from Aussie fans after landing a ruthless clapback at Kevin Pietersen during the Ashes on UK television. Pietersen was laying on the love for his former teammate Joe Root and claimed the England batsman’s aggressive start to day four had Australia running scared. Watch, Stream & Catch Up with Australia's Home of Cricket on There was only one problem: Root undid all his groundwork when he danced Nathan Lyon and was out stumped on 46, leaving England on 4-129 with a nervous lead of just 136 runs. “He just owned the game,” Pietersen told Sky Sports of Root. “He ran the game, he was pure quality and he just owned that space. And just had all this lot scratching their heads going ‘what do we do?’” Ponting maintained a straight face while Pietersen spoke but showed a quick wit afterwards. “Well he’s out now, he got 40,” the ex-Australian captain said bluntly. Pietersen, for his part, took the blow in his stride, as the pair laughed and Ponting moved on. Meanwhile, Ponting opted against entering a public slanging match with Ollie Robinson as the fallout from the England quick’s fiery send-off continued. Robinson attracted headlines on Sunday when he first swore at Usman Khawaja after dismissing him for 141, before doubling down on the antics post-play. Included in Robinson’s claims were that Australia now could not handle sledging, after pointing at the behaviour of past players such as Ponting as an example. The former captain indicated on Monday that he had initially been agitated by the comments, firing off messages in a commentary WhatsApp group. “If I had been able to catch up with Ollie last night, things might have been vastly different to what they were this morning, let’s put it that way,” Ponting said. The former Australian captain did expect Australia’s current team to remind Robinson of his actions. He also questioned whether multiple England players had got ahead of themselves in the past year through the Bazball era. England have been particularly brash in recent days, with Robinson and assistant coach Paul Collingwood accusing Pat Cummins’ team of defensive cricket. Robinson also stated on Sunday that Australia had three No.11s, while Harry Brook was bullish before the match about taking down Australia’s attack. “That will be stored up,” Ponting said of the Robinson incident. “A lot of the things we are talking about here with what Harry Brook has had to say and Ollie Robinson has had to say. “A lot of the cricket these guys have played hasn’t been against this hard-nosed Australian cricket team. “It’s one thing to go out and say what they are saying. In Ashes cricket, names and reputations are made or not. “Some of these English players have had terrific starts to their careers. But we will find out more about them as this series goes on.” Cummins had declared before the series this was an Australian team no longer interested in instigating sledging, after their overhaul following the 2018 ball-tampering scandal. “You’ve seen over the past couple of years our team is pretty chilled out there,” he said. “We’re quite a confident bunch but we’re not overly loud or in your face. I think you’ve seen our personalities reflected out on the field. “I am sure there is going to be emotions at times, but I would be surprised if that bubbled over like maybe it has in the past.”","pubDate":"2023-06-20 00:48:07","image_url":"https://images.7news.com.au/publication/C-11032505/c50a86a47cdc502f0507296874b00c4fbe6f3989-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jude Bellingham won’t crash and burn at Real Madrid like Gareth Bale – he’s learning from Welshman’s mistakes","link":"https://www.thesun.ie/sport/football/10907766/jude-bellingham-gaeth-bale-real-madrid-transfer-kidd-column/","keywords":["Football","Sport","Champions League","Real Madrid transfer news"],"creator":["Dave Kidd"],"video_url":null,"description":null,"content":"GARETH BALE collected five Champions League winner’s medals with Real Madrid, scoring in two finals, including an extraordinary bicycle kick against Liverpool in 2018. So you’d be hard-pressed to describe the Welshman’s nine-year stint at the Bernabeu as any sort of failure. Yet Bale left the Spanish capital largely unloved. Chiefly because he made it clear Real were not his favourite team and that football wasn’t even his favourite sport. Bale was ‘The Golfer’, who loved playing for Wales, but never Real — a remote figure who never embraced the language or culture. A man who never seemed to fully appreciate what it was to play for the world’s most famous club and who outstayed his welcome as a bench-warming trouserer of fortunes. As Jude Bellingham becomes the latest British footballer to roll up at the Bernabeu, it is clear the England midfielder is learning from Bale’s mistakes. This country’s most expensive footballer is still a gangly Brummie teenager — he turns 20 next week — and so you might have imagined him to look a little awkward at last week’s media unveiling. Especially as he was inheriting Zinedine Zidane’s famed No 5 shirt and had just signed his six-year contract in a room with “14 European Cups staring at me”. But while no footballer is judged primarily on his media performances, Bellingham’s appearance was a triumph. He was humble and gracious, likeable and amusing. CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 He blew sunshine up a prominent Spanish-based English journalist — a genuine rather than cynical move — and had a demanding local press corps eating out of his hand. “A Galactico for the next ten years,” was one newspaper’s prediction. But ‘Galactico’ became a byword for an era when Real stockpiled famous, experienced players with commercial clout, while never producing a balanced team and rarely winning anything. Bellingham is part of an exciting Real rebuild centring on youth. Eduardo Camavinga, 20, Aurelien Tchouameni, 23, and Bellingham will eventually replace the midfield triangle of Luka Modric , 37, Toni Kroos, 33, and the already-departed 31-year-old Casemiro . Kylian Mbappe, 24, may well arrive too because Real remains the des res of the world’s best young players, whatever the Premier League’s lure. It helps that Bellingham had already illuminated a World Cup and spent three years at Borussia Dortmund , sometimes captaining a mighty club in front of the Westfalenstadion’s vast Yellow Wall. Those kind of experiences tend to knock the shyness out of a kid. In Dortmund, he befriended old club legends, sought their advice and became part of the fabric, rather than just another foreign player passing through. In Madrid, Bellingham has hired an FA player-liaison officer to work for him full-time as he settles in — a move which suggests he wants to impress off the pitch too. Many are surprised Bellingham chose Real, rather than a move back to England. Yet those close to him insist this has always been his dream. As with many of his generation, his formative experiences of watching football came during the peak years of the Messi-Ronaldo El Clasicos. There would have been far more replica Real Madrid and Barcelona shirts around the playing fields of Birmingham than those of Liverpool or the Manchester clubs. The fixtures for the next LaLiga season are released tomorrow and Bellingham will be eagerly seeking out the dates when he will face champions Barca and become part of that grand and bitter rivalry. Bellingham, who left Birmingham City at 16, has never played in the Premier League and is unlikely to do so until he is in his mid-to-late 20s. That is remarkable for the finest English footballer of his generation during an era of supreme Premier League financial dominance. It does, though, suggest a bravery, curiosity, and independence of thought which will serve him well. There should still be some caution. Bellingham is a high-mileage player, with a phenomenal 200 senior appearances in club and international football as a teenager. He has missed England’s last two matches with a long-standing knee problem and players who play too much, too early, often fail to last the distance. But like Bale before him, Bellingham has the talent, adaptability, attitude and physique to become a major success in Madrid. He might not end up with five Champions League winner’s medals, but Bellingham is very likely to discover the affection and acceptance which eluded Bale. MARTIN TYLER may have been the voice of English football’s bold new era of world domination, as Sky’s lead commentator since the Premier League’s inception 31 years ago. But one of the chief reasons why he was such a success was his strong bond with the game’s roots. Tyler delayed his move into broadcast journalism by several years be- cause he was a useful centre-forward for Corinthian Casuals. And he continued to coach at non-league sides such as Woking, the club he has always supported, and Dartford while calling matches in the world’s richest league. This brought him authenticity to go with his eloquence. Tyler — who is leaving Sky aged 77 but insisting he has not retired from commentating — will be missed. GARY O’NEIL and Bournemouth felt a perfect match — understated, overachieving and entertaining. And while there have been some savagely unexpected managerial sackings which have worked out well for clubs, O’Neil’s dismissal — after he saved the club from relegation — suggests a new American ownership with serious delusions of grandeur. WHEN Spurs appointed Ange Postecoglou as their new manager, Celtic fans told us to expect a treat when watching the Aussie’s revolutionary ‘Angeball’ approach. Turns out Postecoglou expects his players to run around a lot, win the ball back quickly and try to score a lot of goals — much like every other elite coach. Which brings us to Kai Havertz — the Chelsea striker pursued by Arsenal . In a footballing landscape that is obsessed with pace, here is a modern-day Dimitar Berbatov, who is all about subtlety of touch, slowing the game down, finding the time and space to do something different. Arsenal could do with an out-and-out goalscorer, which Havertz — despite scoring the winner in the 2021 Champions League final — is not. But his signing could prove a masterstroke from Mikel Arteta. And Arsene Wenger would definitely approve of it. GOOD to see Jack Grealish becoming Manchester City ’s answer to Freddie Flintoff by leading the drinking spree on his club’s open-top bus parade. If a likeable, good-looking, young multi-millionaire cannot fully enjoy winning the Treble, then what’s the point of being a likeable, good-looking, young multi-millionaire Treble winner? Next expect Grealish to head out into the Caribbean on a pedalo — Flintoff-style, several sheets to the wind — then become one of our top light entertainers. WHY all the high-horsemanship from our Australian friends after England bowler Ollie Robinson shouted “f*** off you f***ing p***k” at Usman Khawaja after dismissing the opener at Edgbaston? Last time I was in Australia, that counted as a warm expression of endearment. The incident does, though, confirm the greatest myth in cricket — that sledging is often imaginative and witty. WHILE the fast-scoring of England’s Bazball approach thrills the nation, Dom ­Sibley — ditched by the national team two years ago — ground his way to the slowest century in County Championship history. It took Surrey opener Sibley almost nine hours to reach three figures. As a display of ‘b****cks-to-the-zeitgeist’ contrariness, it takes some beating. But it worked. Surrey reached a target of 501 to beat Kent.","pubDate":"2023-06-19 23:07:42","image_url":null,"source_id":"thesun_ie","category":["sports"],"country":["ireland"],"language":"english"},{"title":"NO WEAK OPPONENTS: Coach HOUGHTON","link":"https://www.hmetro.co.zw/no-weak-opponents-coach-houghton/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Blessing Malinganiza Zimbabwe head coach, Dave Houghton has thrown caution to the wind insisting that there are no weaker sides in the ongoing ICC Men’s Cricket World Cup Qualifier underway in the country as the Chevrons prepare for this morning’s clash against Netherlands. The locals played a blinder of a match, accounting for Nepal by […]","content":"H-Metro Blessing Malinganiza Zimbabwe head coach, Dave Houghton has thrown caution to the wind insisting that there are no weaker sides in the ongoing ICC Men’s Cricket World Cup Qualifier underway in the country as the Chevrons prepare for this morning’s clash against Netherlands. The locals played a blinder of a match, accounting for Nepal by a heavy eight-wicket win in their opening match of the Qualifier. Captain Craig Ervine scored an unbeaten 121 from 128 balls while all-rounder Sean Williams smashed Zimbabwe’s fastest One Day International 100 from just 70 balls to close the match on 102 not out. Prior to Williams’ milestone on a day he reached his 150th ODI, former captain, Brendan Taylor held the record of a fastest ODI hundred which he achieved from 79 balls against Ireland at the 2015 World Cup hosted by Australia and New Zealand. “Every team that we play in this tournament is a good side, they didn’t arrive here by accident,” Houghton said at a press conference yesterday. “We will be playing our game the way we have been building up over the last few months. “We have got a solid seam attack, we have got some good spinners, our fielding is good, it’s sharp, we have a good batting line up. We will be doing that. “Holland is a decent team, we won the last series 2-1 (In March at Harare Sports Club) but they have made six or seven changes, so I am not sure we know all their players that well, but this tournament for me is about what we do on the field. If we do what we do well we should win it.” Wicketkeeper batsman, Joylord Gumbie made his ODI debut against Nepal scoring 25 up the order before he was given out LBW. All-rounder Wessly Madhevere chipped in with 32 runs as Zimbabwe scored 291/2 in response to Nepal’s 290/8. Earlier, the bowlers had struggled to get wickets after Ervine elected to field upon winning the toss. It was however offspinner Wellington Masakadza who got the set batsmen for Nepal in successive overs. Masakadza finished with two wickets while Richard Ngarava enjoyed success later on with four wickets for 43 runs from nine overs. “I think our batting got it right. It was a good batting performance chasing such a big score. We made it look easy, our bowling and feeling wasn’t great at the start but we came back around 30 overs. Lots of fighting spirit, good resilience, we didn’t have a good start but we came back,” added Houghton. Netherlands captain Scott Edwards said confidence is high having played a good series against Zimbabwe in Harare in March. “We take a lot of confidence in playing three games in these conditions, I think we are quite lucky in that regard. We know we have played them recently so we know how their batters go about it and how their bowlers go about it,” he said. Last time it was a close series, we feel like we match up well against them. We are looking forward to tomorrow (today). Hopefully there will be a big crowd, all cricketers enjoy playing in front of a big crowd regardless of who they are backing. The boys are looking forward to the challenge and hopefully it brings the best from us.”","pubDate":"2023-06-19 22:08:24","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"}]}