{"newsArray":[{"article_id":"6fa17e39f07d26416ef84a5e5979bb6a","title":"Surrey wrap up back-to-back County Championship titles after second-placed Essex bowled out for 211 in final game against Northamptonshire","link":"https://www.dailymail.co.uk/sport/cricket/article-12572077/Surrey-wrap-County-Championship-titles-second-placed-Essex-bowled-211-final-game-against-Northamptonshire.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Alec Stewart saw Surrey wrap up another Championship title before being given a little family reminder of how far they still have to go to match the greatest of all county sides.","content":"Surrey wrap up back-to-back County Championship titles after second-placed Essex bowled out for 211 in final game against Northamptonshire Surrey have won the County Championship for a second successive year The title was confirmed when Essex were bowled out for 211 by Northants Surrey have strength in depth despite losing players to England and the IPL By Paul Newman for the Daily Mail Published: 17:41 BST, 28 September 2023 | Updated: 00:01 BST, 29 September 2023 e-mail 8 shares 5 View comments Alec Stewart saw Surrey wrap up another Championship title on Thursday before being given a little family reminder of how far they still have to go to match the greatest of all county sides. The second successive title, fourth in the last six years and 21st in all for Surrey was confirmed when Essex were bowled out for 211 by Northants in their forlorn pursuit of the score of 400 that might have taken this one-sided title race to a final day. In truth it has been all but decided since Essex were defeated by Hampshire last week, with Surrey not needing to be anywhere near their best at the Ageas Bowl against the same opponents before the big moment came with Will Jacks in the middle of an over. That will not matter to Surrey and their director of cricket and Oval and England legend Stewart who is well placed to judge how good this modern powerhouse of a county side are compared with the very best teams to grace the Oval in their illustrious history. ‘Dad still goes on about being part of the team that won it seven times on the trot,’ smiled Stewart of his father Micky’s role in the all-conquering Surrey side of the 1950s. Surrey have won the County Championship for a second successive year as their triumph was confirmed on Thursday ‘We have now won it back to back and we will try to do it again next year but there are still plenty of challenges ahead. It’s certainly not a question of two titles and that’s it.’ Surrey should be able to dominate for some time yet, with their strength in depth emphasised by them using 19 players across 14 games having lost so many to England and the IPL. They will only add to that strength next year when Dan Lawrence joins from Essex. Lawrence had a miserable goodbye to Essex when they went on to be beaten by an innings by relegated Northants, with there also being no fanfare or fitting departure for Alastair Cook. England’s record runscorer and former captain was dismissed for just six in what still seems certain to be his last innings before retirement. Share or comment on this article: Surrey wrap up back-to-back County Championship titles after second-placed Essex bowled out for 211 in final game against Northamptonshire e-mail 8 shares Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-28 23:01:58","image_url":"https://i.dailymail.co.uk/1s/2023/09/28/17/75944911-0-image-m-12_1695918619338.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4428bf8387f476b02d0d28b4d20940f3","title":"‘Mr Chibuku’ misses CAPS United match","link":"https://www.herald.co.zw/mr-chibuku-misses-caps-united-match/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty.","content":"GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. Makepekepe and Highlanders will clash for the first time in this tournament on Sunday at Barbourfields. Addressing a pre-match press conference yesterday, the Green Machine assistant coach Fungai Tostao Kwashi said they will miss Manondo, the club’s top goal scorer with six strikes to his name this season. Not many years ago, Manondo endeared himself to the domestic football fraternity as “Mr Chibuku” because of his distinct scoring record in this competition, after leading Harare City to two titles in 2015 and 2017 with his unrivalled marksmanship. However, the 32-year-old will not be available for the crucial battle against Bosso, along with defender Godknows Murwira. The pair is in Botswana with the national team for the neighbours’ independence day celebrations invitational match to be played in Gaborone tomorrow. Bosso defender Peter Muduhwa and midfielder Brighton Manhire are also out of this match because of the Warriors’ commitments while injured goalkeeper and captain Ariel Sibanda is a doubtful starter. “Obviously, any team would want to have a full complement of their squad or their best players for such a match as this (against Highlanders). But if you look at the other side of the coin, it’s actually an opportunity for the other players who will be getting the starts to shine. “Sometimes these things work as a blessing in disguise. So the guys who will be given the chance should grab it with both hands and give an excellent performance. “We wish Murwira and Manondo all the best with the national team. The club has enough personnel and enough quality players to play this weekend and get the results,” said Kwashi. Makepekepe progressed to the quarter-final after beating Hwange in the last 16. But they have a poor record in the Chibuku Super Cup, in which they only managed to go past the quarter-final stage once, in 2018, before losing to Harare City in the last four. In fact, they have historically struggled to go beyond the first round. This year’s Chibuku Super Cup tournament has coincided with a troubled league campaign, in which they find themselves closer to the relegation zone than they are to the team at the top. But Kwashi believes Chibuku could be their hope to finish with silverware and gatecrash into CAF inter-club competitions. “At this juncture, we are in the Chibuku Super Cup and we would want to go as far as possible. And obviously because we are known as the Cup Kings, we have done well in Africa before. So our target is going back into the continent. “This is the route, the other one being the league competition. So we are serious and we are challenging ourselves to go step further than we have done before in the Chibuku Super Cup. “We haven’t won the Chibuku Cup yet but we are known as the Cup Kings. So it’s one cup which we need in our trophy cabinet; and we are not putting ourselves under pressure. “But after the performances we gave, especially in the second half (of the 1-0 Harare Derby defeat to Dynamos) last week, we are going into this game against Highlanders with so much confidence, so much exuberance and zeal to do better. “We have to try and give something back to the fans who have been supporting us through this tough period we are going through. “We owe them a victory; we owe them a cup but like I said we are going to do this without putting unnecessary pressure on ourselves. “We are going to work hard, give everything we have so that we enhance our chances of winning. We are going to take it one game at a time and we have an important game on Sunday,” said Kwashi. FC Platinum v Dynamos (Mandava), Chicken Inn v Black Rhinos (Luveve) Herentals v Ngezi Platinum Stars (National Sports Stadium), Highlanders v CAPS United (Barbourfields) THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club. REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday.","pubDate":"2023-09-28 22:04:34","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"e4b1da57b2d78908a4e7ed884ba33e3f","title":"ZOC to push team sports to qualify","link":"https://www.herald.co.zw/zoc-to-push-team-sports-to-qualify/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games.","content":"THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. Throughout history, only two women’s teams have made it to the Olympic games. Zimbabwe had the women’s hockey team at the 1980 Olympic Games in Russia and the women’s football team at the Rio 2016 Olympic Games in Brazil. They have mostly had individual athletes qualifying for the Games and in an interview with Zimpapers Television Network, ZTN Prime’s Morning Rush, ZOC chief executive Marlene Gadzirayi said for the Paris 2024 Olympic Games, they have provided assistance for teams to help their qualification bids. These include rugby — the Cheetahs and Lady Cheetahs — as well as the national men and women’s hockey teams that are chasing qualification. The Lady Cheetahs are set to travel to Tunisia for the Olympic qualifier to take place on October 14 and 15 and the hockey teams are expected to compete in their qualifier from October 29 to November 5 in Pretoria, South Africa. The Cheetahs missed out on qualification when coming fourth at the Rugby Africa Men’s Sevens staged at Harare Sports Club about two weeks ago. The 12-team tournament was al-so serving as the qualifiers for the Paris 2024 Olympic Games. “So in terms of scholarships, yes they are for individual sport, but then another example is yes we are actually supporting the hockey team, they are going for qualifiers in South Africa . . . So it would really just always be better for Zimbabwe to have more athletes at the Olympics. “It’s always good when you (are) looking at the Opening ceremony to see countries that have big delegations and Zimbabwe have maybe sometimes less than 10, so having a team qualifying is beyond amazing for Zimbabwe. “So we really need to keep pushing on that and like I have said we were supporting the sevens — the Cheetahs, the Lady Cheetahs, the hockey team as well will be going to South Africa for qualifiers. “So we are also trying our best to ensure that teams also get to qualify because it’s really better not just for the Olympic Committee but for the nation as a whole,” said Gadzirayi. So far only marathon runner Isaac Mpofu has qualified for the Games. He is one of the 10 beneficiaries of the IOC Olympic Solidarity scholarships. The other recipients are Andie Kuipers (triathlon), Donata Katai and Nomvula Mjimba (swimming) Justine Carla Hobbs and Stephen Cox (rowing), Fortunate Chidzivo, Chengetayi Mapaya and Tinotenda Matiyenga (athletics) and judoka Christi Rose Prestorius. Most of the athletes are still in the qualification phase and the ZOC chief executive said they are optimistic. And are also supporting other individual athletes that did not receive the Olympic Solidarity scholarships such as South Africa-based long distance runner Rutendo Nyahora. “So we have one who has qualified, Isaac Mpofu in marathon. But others are still going through the qualifiers. “Rutendo Nyahora, she is not on the scholarship but we have assisted her. We have Andie Kuipers in triathlon. “So the qualifiers are still going on, so we actually are still keeping our fingers crossed that at least some of them qualify. “We have Donata Katai also in swimming and Nomvula in swimming as well. So all those athletes are the ones who have the potential and we are hoping that as they go to the quali-fiers they do qualify,” said Gadzirayi. In the previous Games, Zimbabwe had a team of five athletes competing in athletics, swimming, rowing and golf. They will be hoping for an improved number of athletes this time around. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club. REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday. ZIMBABWE international defender, Jordan Zemura made his fourth Serie A appearance on yet another losing note on Wednesday night as champions Napoli demolished his Udinese 4-1.","pubDate":"2023-09-28 22:01:59","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"44cc3b9eade9e29bdc99cbd61c685d7c","title":"Uprising biggest winners in round 3","link":"https://www.herald.co.zw/uprising-biggest-winners-in-round-3/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","content":"UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club. At Old Hararians Sports Club, opener Nicholas Welch led the Uprising scoring with 68 off 37 balls, hitting six fours and four sixes while Takudzwanaishe Kaitano made 54 off 26 balls, which included five sixes and four fours for a score of 202/6 after 20 overs. In response, Rainbow could only manage 120 all out in 17.2 overs with Jonathan Campbell the only defiant batsman with 41 off 22 balls while seven others failed to reach double figures. Brian Bennet led the Uprising attack with five wickets for 17 off his four overs. In the other afternoon match at Takashinga Sports Club, Takashinga 2 beat Takashinga 1 by 18 runs in a high scoring match. Takashinga 2 made 195/6 batting first with Antum Navqi scoring 65 off 37 balls and opener Baxon Gopito adding 45 off 29 balls while the bowlers gave away 21 extras in 20 overs. Richard Ngarava was, by far, the most disciplined of the Takashinga 1 bowlers as he took three wickets for just 11 runs in his four overs, including one maiden. The extras came back to haunt Takashinga 1 as they could only reach 177/9 off their 20 overs in response. Batting at number three, Innocent Kaia had a match highest score of 71 off 46 balls, including nine fours, while Wellington Masakadza had the second highest contribution of 43 off 21 balls at number six. Takashinga 2 gave away just six extras with captain Prince Masvaure clainming three wickets for 30 off his four overs as did Takudzwa Chataira. In the morning matches, Mutare Sports Club beat Amakhosi by 13 runs defending 146/6 at Masvingo Sports Club. Jayden Schadendorf had the match highest score of 52 off 54 balls while opener Mathew Welch made 44 of 24 balls. In response, Amakhosi could only manage 133/8 off their 20 overs with a highest contribution of an unbeaten 47 off 34 balls coming from number six, Tanatswa Bechani. Bechani featured in the innings’ best partnership of 25 for the sixth wicket with Brandon James who had the second highest contribution of 18 off 15 balls. Tendai Chatara led the attack with four wickets for 32 in four overs while man-of-the-match Schadendorf took three wickets for 28 in four overs. At Mutare Sports Club, Westside held their nerves to secure a seven-run victory over Gladiators in a match pitting teams that had a 100 percent record. Westside made 180/5 with opener Definate Mawadzi scoring 73 off 47 balls while Tinashe Muchawaya was unbeaten on 25 off 18 balls. Gladiators were wayward with their bowling as they conceded 16 wides in 17 extras. Number three Milton Shumba scored 68 off 45 balls with Tony Munyonga’s 27 off 24 balls the second highest contribution in Gladiators’ 173/8. Westside were a bit expensive in their bowling as they gave away 17 extras, as much as their opponents- while Fortune Mhlanga claimed three wickets for 32 for the innings’ best bowling figures. Takashinga 2 v Rainbow (Takashinga Sports Club), Amakhosi v Takashinga 1 (Kwekwe Sports Club), Westside v Uprising (Old Hararians), Mutare Sports Club v Gladiators (Takashinga) P W L T NR PTS NRR Westside 3 3 0 0 0 6 1.690 Uprising 3 2 1 0 0 4 0.886 Gladiators 3 2 1 0 0 4 0.756 Takashinga 2 3 2 1 0 4 0.634 Mutare 3 2 1 0 0 4 0.317 Takashinga 1 3 1 2 0 0 -0.067 Amakhosi 3 0 3 0 0 0 -1.643 Rainbow 3 0 3 0 0 0 -1.700 GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday.","pubDate":"2023-09-28 22:01:51","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"37bdcaeb296458c20c48134220018004","title":"Bosso wary of ailing Makepekepe","link":"https://www.herald.co.zw/bosso-wary-of-ailing-makepekepe/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday.","content":"REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday. CAPS United is having a difficult league season which has seen their win-less streak stretching to nine matches. Their last league victory came against Green Fuel on August 7. Since then, they have lost five games and drawn four. CAPS United edged Hwange 1-0 to progress to the quarter-finals of the Chibuku Super Cup. Hosts Highlanders who booked a quarter-final place by winning 6-5 on penalties against Bulawayo Chiefs are also not on a good run in the league. Bosso have won one match in their last five games in the league. Both sides will know a cup game is never determined by league form but is rather a game won by whoever rises to the occasion on the day. “We are trying to work according to the programme which the coach has given us day by day. We respect CAPS United, make no mistake about that one. We really respect them. But we are not going to let them just walk over our heads just like that. We are going to give them a good fight,” said Ndlovu a hero of many cup and league games over Caps United in the 1980s. He challenged his troops to forget their present form and focus on winning against CAPS United. “It’s like a money game where we have to give it our all. “We have to give it our best. We want to assure our fans that we will give it our best. Let’s not dwell on the defeats we have suffered. Let’s look at things game by game. “Let’s look at CAPS United and see how we play against them according to the way we have trained. If our system does not work, then tough luck, we know in football there are three results, a win, a loss and a draw. “Our priority is to win the game. We will do our best to win the game. We are going to be working hard with the players to make sure we win the game. We will ask the players to come to the party. We are doing our best to lift up the boys because at this point in time, they are picking up in terms of morale,” said Ndlovu. Highlanders have a number of injury concerns going into Sunday’s game. Calvin Chigonero and Archford Faira picked up injuries in yesterday’s training session and are doubtful. Captain Ariel Sibanda is out with a foot injury. Devine Mhindirira, Darlington Mukuli and Godfrey Makaruse are also in the treatment room. The injuries at Highlanders should be a worrying factor, could it be the training or pitch? Added to that, Bosso will also be without defender Peter Muduhwa and midfielder Brighton Mhanhire, who are with the national team. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:46","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"28e5d4037ca518d61ca03c49e82548bc","title":"Another Serie A loss for Zemura","link":"https://www.herald.co.zw/another-serie-a-loss-for-zemura/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWE international defender, Jordan Zemura made his fourth Serie A appearance on yet another losing note on Wednesday night as champions Napoli demolished his Udinese 4-1.","content":"ZIMBABWE international defender, Jordan Zemura made his fourth Serie A appearance on yet another losing note on Wednesday night as champions Napoli demolished his Udinese 4-1. Napoli had endured a three-match win-less run prior to Wednesday night’s victory. As was the case of his previous three appearances, Zemura (23) was a second half substitute and replacing Hassane Kamara, 29, from Cote d’Ivoire. Udinese have now lost three of the four matches in which Zemura has played a part – Juventus (0-3), Fiorentina (0-2) and Napoli (1-4). In Wednesday’s game, Zemura was introduced in the 72nd minute when Napoli were leading 2-0 and it became 3-0 two minutes after the former Bournemouth left-back joined the fray — thus three of the night’s five goals were scored with Zemura in action. Zemura was given a rating of 6.2 out of 10, the second lowest of the five substitutes but it was deemed better than 10 of Udinese’s 11 starters with 24-year-old Slovenian centre-back Jaka Bijol getting a team lowest mark of 2.5 out of 10. After six Serie A games, Udinese are now in the relegation zone on goal difference with three points ahead of a home match against Genoa on Sunday. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:43","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"e93573b3ff2406855e82bce6522ccded","title":"Warriors ready for Botswana clash . . . captain Muduhwa happy to bounce back","link":"https://www.herald.co.zw/warriors-ready-for-botswana-clash-captain-muduhwa-happy-to-bounce-back/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE country’s senior men’s football team, the Warriors yesterday conducted two training sessions ahead of their friendly match against Botswana in Gaborone tomorrow.","content":"THE country’s senior men’s football team, the Warriors yesterday conducted two training sessions ahead of their friendly match against Botswana in Gaborone tomorrow. The Warriors squad for the tie was called last week only to assemble in the capital on Tuesday and leave for Botswana on Wednesday without conducting a single training session. Yesterday, Baltemar Brito held training sessions at Botswana Football Association Lekedi Football Centre. The first one started at 10am while the second workout was held after lunch at the same venue. Highlanders’ vice-captain Peter Muduhwa, who has since been appointed team captain, said they were pleased that the country has bounced back to the international football family. “As players we are very much happy that the country is back to playing international football after a long-time. This is a development that will benefit the players, clubs and the nation at large. Everyone always dreams to play for the national team and as players we are very much pleased and we will need more support from our fans,” said Muduhwa. Asked about his analysis of the two workouts they conducted yesterday, the combative Muduhwa said: “The training sessions that we had were okay. You could tell from the movement that there is some understanding within the players, we are used to each other. There are very few that we have not played together.” Liberty Mugari, who is part of the Zimbabwe Football Association (Zifa) communications department said all was well in camp. “The Warriors arrived well in Botswana. Just like Frank (Makarati) and Andrew (Mbeba), Shepherd Mhlanga of Chicken Inn was dropped for the same reason of seeking to balance the team and avoid having more than two players from one local club,” said Mugari. The trio of Thubelihle Jubane of Sheasham, Manica Diamonds’ Trevor Mavhunga and Clive Mandivhei of Yadah were last minute additions. Donovan Bernard (Chicken Inn), Nelson Chadya (Ngezi Platinum Stars) Peter Muduhwa, Godknows Murwira (Caps United), Farai Banda (Manica Diamonds), Qadr Amini (Ngezi Platinum Stars), Xolani Ndlovu (Chicken Inn), Thubelihle Jubane (Sheasham) Brighton Manhire (Highlanders), Brian Banda (FC Platinum), Tanaka Shandirwa (Dynamos), Mthokozisi Msebe (Bulawayo Chiefs), Donald Mudadi (Dynamos), Davison Marowa (Herentals), Walter Musona (FC Platinum), Tinotenda Benza (Herentals) Manica Diamonds’ Trevor Mavhunga (Manica Diamonds) Clive Mandivhei (Yadah) William Manondo (Caps United), Fortune Binzi (Manica Diamonds), Obriel Chirinda (Bulawayo Chiefs)- GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:36","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"76cbd39e4e5a44a3a9ffa062e754ffd8","title":"Munetsi gets Ligue 1 special mention","link":"https://www.herald.co.zw/munetsi-gets-ligue-1-special-mention/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE French Ligue 1 yesterday saluted Zimbabwe international Marshal Munetsi for an impressive start to the season with fifth-placed Stade de Reims.","content":"THE French Ligue 1 yesterday saluted Zimbabwe international Marshal Munetsi for an impressive start to the season with fifth-placed Stade de Reims. The 27-year-old Munetsi has featured in all Reims’ six matches, scoring once (first half opener) in the 2-0 win over Clermont and assisting thrice while also getting one yellow card. Yesterday, Ligue 1 took to X (formerly Twitter) to laud Munetsi: “Marshal Munetsi, the creator (Zimbabwe flag), 4 league goal contributions in 6 games (fire emoji).” Munetsi has been in Ligue 1 since the 2019/20 season after two seasons with Soweto giants, Orlando Pirates in the South African Premier Soccer League. With one goal, Munetsi is joint-third at Reims, behind Teddy Teuma with three goals and Mohamad Daramy (two). The three assists in six games put him joint-second with Moses Simon of Nantes, Takumi Minamino of Monaco and Le Havre’s Josue Casimir. Monaco’s Caio Henrique leads the charts with four assists. Munetsi’s assists came against Marseille on the opening weekend on August 12, providing J Ito with the opener after 10 minutes but they eventually lost the match 2-1 and then both in Reims’ 2-1 win at Lille on Tuesday. In Tuesday’s win, Munetsi assisted Mohamed Daramy with a headed pass from a corner in the 12th minute and then from open play four minutes later, allowing Keito Nakamura to blast home from the centre of the box. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:27","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"755cf064efaf6249dc3cb3538da36de7","title":"Rhinos seek successive victory","link":"https://www.herald.co.zw/rhinos-seek-successive-victory/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"Black Rhinos midfielder Nkosi Mhlanga says they will be gunning for victory when they face Chicken Inn in the Chibuku Super Cup at Luveve on Saturday.","content":"Black Rhinos midfielder Nkosi Mhlanga says they will be gunning for victory when they face Chicken Inn in the Chibuku Super Cup at Luveve on Saturday. Despite having a poor season, Black Rhinos have emerged as a force in the cup after knocking out fellow army side Cranborne Bullets and favourites Manica Diamonds and are now looking forward to upsetting the Gamecocks in their backyard. Last year Rhinos edged Chicken in the quarter-finals to book a ticket to the semi-final and they will be looking to replicate that same feat. Mhlanga believes they are in good shape as a team and can grind a much-needed result. The team is inspired by their last win against title aspirants Manica Diamonds. “We want to win and make sure we progress to the next round,’’ said Mhlanga. “This is a cup game and every small detail has to be taken note of as there is a need for high-concentration. “Normally we don’t look into form but what you are putting into on the day. How you are going to apply yourself in the field of play. “We have been struggling in the league but I guess the win against Manica is a good motivation for us. We want to win as many games as we can in all the competitions. If we win on Saturday it means winning two more games in the cup will see us being crowned champions and that will mean we have to work for it. “I am quite sure as a team we have enough respect for our opponents but we are going all out to defeat them. We are not underdogs though many are looking. “We have improved a lot and it means we have a good chance to stand our own ground and dictate our own terms. “The fact that we are not losing gives us a boost and will see us upset a number of teams that will be considering us underdogs. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:09","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"de5eb984905a465a1628e3f34b2a3eb8","title":"Hadebe wins US Open silverware","link":"https://www.herald.co.zw/hadebe-wins-us-open-silverware/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWE international Teenage Hadebe lifted his first silverware in the United States Major League football when he won the US Open Cup title with Houston Dynamo on Wednesday night. The 28-year-old played a cameo after he was introduced in the 91st minute to help see out the game for Houston Dynamo who beat Lionel Messi’s Inter-Milan and landed their second US Open Cup title. Speaking to Zimpapers Sport, Hadebe said:","content":"ZIMBABWE international Teenage Hadebe lifted his first silverware in the United States Major League football when he won the US Open Cup title with Houston Dynamo on Wednesday night. The 28-year-old played a cameo after he was introduced in the 91st minute to help see out the game for Houston Dynamo who beat Lionel Messi’s Inter-Milan and landed their second US Open Cup title. Speaking to Zimpapers Sport, Hadebe said: “I am happy to win my first silverware with the club, it’s something I always dreamt of since I got here. “And I’m proud that we’ve managed to do that as a team. “Of course it was an emotional moment for me, it’s something I was looking for-ward to. And this will be one of the highlights of my career as a footballer. “I want to thank everyone who wished my team good fortunes and everyone who has been sending me congratulatory messages,” he said. He added: “I want to prove my worth to the club and do all I can in making sure that I help my club in achieving their targets. “My target is to finish off at a better position and help my team win some more silverware.” Hadebe, who moved to the United States in 2021, recently returned from injury and was on target in Houston’s last league assignment, which they lost 1-2 to Kansas City. Hadebe has been out with injury for the last for months. He had surgery in May and has been recovering on the sidelines. The defender had last featured for his club during their third round US Open Cup match against Tampa Bay Rowdies which they won 1-0 on April 27. He could have rubbed shoulders against Messi and his former Barcelona teammate Jordi Alba but the duo watched from the sidelines after they were ruled out be-cause of injuries. With two of their stars missing, Houston took full advantage, scoring twice in the first half from Griffin Dorsey’s close-range thunderbolt and a penalty by Amine Bassi. Hadebe was part of the history when the final whistle blew, as Houston added a second US Open Cup to their trophy case after winning it in 2018. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:07","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"6fa17e39f07d26416ef84a5e5979bb6a","title":"Surrey wrap up back-to-back County Championship titles after second-placed Essex bowled out for 211 in final game against Northamptonshire","link":"https://www.dailymail.co.uk/sport/cricket/article-12572077/Surrey-wrap-County-Championship-titles-second-placed-Essex-bowled-211-final-game-against-Northamptonshire.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Alec Stewart saw Surrey wrap up another Championship title before being given a little family reminder of how far they still have to go to match the greatest of all county sides.","content":"Surrey wrap up back-to-back County Championship titles after second-placed Essex bowled out for 211 in final game against Northamptonshire Surrey have won the County Championship for a second successive year The title was confirmed when Essex were bowled out for 211 by Northants Surrey have strength in depth despite losing players to England and the IPL By Paul Newman for the Daily Mail Published: 17:41 BST, 28 September 2023 | Updated: 00:01 BST, 29 September 2023 e-mail 8 shares 5 View comments Alec Stewart saw Surrey wrap up another Championship title on Thursday before being given a little family reminder of how far they still have to go to match the greatest of all county sides. The second successive title, fourth in the last six years and 21st in all for Surrey was confirmed when Essex were bowled out for 211 by Northants in their forlorn pursuit of the score of 400 that might have taken this one-sided title race to a final day. In truth it has been all but decided since Essex were defeated by Hampshire last week, with Surrey not needing to be anywhere near their best at the Ageas Bowl against the same opponents before the big moment came with Will Jacks in the middle of an over. That will not matter to Surrey and their director of cricket and Oval and England legend Stewart who is well placed to judge how good this modern powerhouse of a county side are compared with the very best teams to grace the Oval in their illustrious history. ‘Dad still goes on about being part of the team that won it seven times on the trot,’ smiled Stewart of his father Micky’s role in the all-conquering Surrey side of the 1950s. Surrey have won the County Championship for a second successive year as their triumph was confirmed on Thursday ‘We have now won it back to back and we will try to do it again next year but there are still plenty of challenges ahead. It’s certainly not a question of two titles and that’s it.’ Surrey should be able to dominate for some time yet, with their strength in depth emphasised by them using 19 players across 14 games having lost so many to England and the IPL. They will only add to that strength next year when Dan Lawrence joins from Essex. Lawrence had a miserable goodbye to Essex when they went on to be beaten by an innings by relegated Northants, with there also being no fanfare or fitting departure for Alastair Cook. England’s record runscorer and former captain was dismissed for just six in what still seems certain to be his last innings before retirement. Share or comment on this article: Surrey wrap up back-to-back County Championship titles after second-placed Essex bowled out for 211 in final game against Northamptonshire e-mail 8 shares Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-28 23:01:58","image_url":"https://i.dailymail.co.uk/1s/2023/09/28/17/75944911-0-image-m-12_1695918619338.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4428bf8387f476b02d0d28b4d20940f3","title":"‘Mr Chibuku’ misses CAPS United match","link":"https://www.herald.co.zw/mr-chibuku-misses-caps-united-match/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty.","content":"GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. Makepekepe and Highlanders will clash for the first time in this tournament on Sunday at Barbourfields. Addressing a pre-match press conference yesterday, the Green Machine assistant coach Fungai Tostao Kwashi said they will miss Manondo, the club’s top goal scorer with six strikes to his name this season. Not many years ago, Manondo endeared himself to the domestic football fraternity as “Mr Chibuku” because of his distinct scoring record in this competition, after leading Harare City to two titles in 2015 and 2017 with his unrivalled marksmanship. However, the 32-year-old will not be available for the crucial battle against Bosso, along with defender Godknows Murwira. The pair is in Botswana with the national team for the neighbours’ independence day celebrations invitational match to be played in Gaborone tomorrow. Bosso defender Peter Muduhwa and midfielder Brighton Manhire are also out of this match because of the Warriors’ commitments while injured goalkeeper and captain Ariel Sibanda is a doubtful starter. “Obviously, any team would want to have a full complement of their squad or their best players for such a match as this (against Highlanders). But if you look at the other side of the coin, it’s actually an opportunity for the other players who will be getting the starts to shine. “Sometimes these things work as a blessing in disguise. So the guys who will be given the chance should grab it with both hands and give an excellent performance. “We wish Murwira and Manondo all the best with the national team. The club has enough personnel and enough quality players to play this weekend and get the results,” said Kwashi. Makepekepe progressed to the quarter-final after beating Hwange in the last 16. But they have a poor record in the Chibuku Super Cup, in which they only managed to go past the quarter-final stage once, in 2018, before losing to Harare City in the last four. In fact, they have historically struggled to go beyond the first round. This year’s Chibuku Super Cup tournament has coincided with a troubled league campaign, in which they find themselves closer to the relegation zone than they are to the team at the top. But Kwashi believes Chibuku could be their hope to finish with silverware and gatecrash into CAF inter-club competitions. “At this juncture, we are in the Chibuku Super Cup and we would want to go as far as possible. And obviously because we are known as the Cup Kings, we have done well in Africa before. So our target is going back into the continent. “This is the route, the other one being the league competition. So we are serious and we are challenging ourselves to go step further than we have done before in the Chibuku Super Cup. “We haven’t won the Chibuku Cup yet but we are known as the Cup Kings. So it’s one cup which we need in our trophy cabinet; and we are not putting ourselves under pressure. “But after the performances we gave, especially in the second half (of the 1-0 Harare Derby defeat to Dynamos) last week, we are going into this game against Highlanders with so much confidence, so much exuberance and zeal to do better. “We have to try and give something back to the fans who have been supporting us through this tough period we are going through. “We owe them a victory; we owe them a cup but like I said we are going to do this without putting unnecessary pressure on ourselves. “We are going to work hard, give everything we have so that we enhance our chances of winning. We are going to take it one game at a time and we have an important game on Sunday,” said Kwashi. FC Platinum v Dynamos (Mandava), Chicken Inn v Black Rhinos (Luveve) Herentals v Ngezi Platinum Stars (National Sports Stadium), Highlanders v CAPS United (Barbourfields) THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club. REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday.","pubDate":"2023-09-28 22:04:34","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"e4b1da57b2d78908a4e7ed884ba33e3f","title":"ZOC to push team sports to qualify","link":"https://www.herald.co.zw/zoc-to-push-team-sports-to-qualify/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games.","content":"THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. Throughout history, only two women’s teams have made it to the Olympic games. Zimbabwe had the women’s hockey team at the 1980 Olympic Games in Russia and the women’s football team at the Rio 2016 Olympic Games in Brazil. They have mostly had individual athletes qualifying for the Games and in an interview with Zimpapers Television Network, ZTN Prime’s Morning Rush, ZOC chief executive Marlene Gadzirayi said for the Paris 2024 Olympic Games, they have provided assistance for teams to help their qualification bids. These include rugby — the Cheetahs and Lady Cheetahs — as well as the national men and women’s hockey teams that are chasing qualification. The Lady Cheetahs are set to travel to Tunisia for the Olympic qualifier to take place on October 14 and 15 and the hockey teams are expected to compete in their qualifier from October 29 to November 5 in Pretoria, South Africa. The Cheetahs missed out on qualification when coming fourth at the Rugby Africa Men’s Sevens staged at Harare Sports Club about two weeks ago. The 12-team tournament was al-so serving as the qualifiers for the Paris 2024 Olympic Games. “So in terms of scholarships, yes they are for individual sport, but then another example is yes we are actually supporting the hockey team, they are going for qualifiers in South Africa . . . So it would really just always be better for Zimbabwe to have more athletes at the Olympics. “It’s always good when you (are) looking at the Opening ceremony to see countries that have big delegations and Zimbabwe have maybe sometimes less than 10, so having a team qualifying is beyond amazing for Zimbabwe. “So we really need to keep pushing on that and like I have said we were supporting the sevens — the Cheetahs, the Lady Cheetahs, the hockey team as well will be going to South Africa for qualifiers. “So we are also trying our best to ensure that teams also get to qualify because it’s really better not just for the Olympic Committee but for the nation as a whole,” said Gadzirayi. So far only marathon runner Isaac Mpofu has qualified for the Games. He is one of the 10 beneficiaries of the IOC Olympic Solidarity scholarships. The other recipients are Andie Kuipers (triathlon), Donata Katai and Nomvula Mjimba (swimming) Justine Carla Hobbs and Stephen Cox (rowing), Fortunate Chidzivo, Chengetayi Mapaya and Tinotenda Matiyenga (athletics) and judoka Christi Rose Prestorius. Most of the athletes are still in the qualification phase and the ZOC chief executive said they are optimistic. And are also supporting other individual athletes that did not receive the Olympic Solidarity scholarships such as South Africa-based long distance runner Rutendo Nyahora. “So we have one who has qualified, Isaac Mpofu in marathon. But others are still going through the qualifiers. “Rutendo Nyahora, she is not on the scholarship but we have assisted her. We have Andie Kuipers in triathlon. “So the qualifiers are still going on, so we actually are still keeping our fingers crossed that at least some of them qualify. “We have Donata Katai also in swimming and Nomvula in swimming as well. So all those athletes are the ones who have the potential and we are hoping that as they go to the quali-fiers they do qualify,” said Gadzirayi. In the previous Games, Zimbabwe had a team of five athletes competing in athletics, swimming, rowing and golf. They will be hoping for an improved number of athletes this time around. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club. REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday. ZIMBABWE international defender, Jordan Zemura made his fourth Serie A appearance on yet another losing note on Wednesday night as champions Napoli demolished his Udinese 4-1.","pubDate":"2023-09-28 22:01:59","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"44cc3b9eade9e29bdc99cbd61c685d7c","title":"Uprising biggest winners in round 3","link":"https://www.herald.co.zw/uprising-biggest-winners-in-round-3/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","content":"UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club. At Old Hararians Sports Club, opener Nicholas Welch led the Uprising scoring with 68 off 37 balls, hitting six fours and four sixes while Takudzwanaishe Kaitano made 54 off 26 balls, which included five sixes and four fours for a score of 202/6 after 20 overs. In response, Rainbow could only manage 120 all out in 17.2 overs with Jonathan Campbell the only defiant batsman with 41 off 22 balls while seven others failed to reach double figures. Brian Bennet led the Uprising attack with five wickets for 17 off his four overs. In the other afternoon match at Takashinga Sports Club, Takashinga 2 beat Takashinga 1 by 18 runs in a high scoring match. Takashinga 2 made 195/6 batting first with Antum Navqi scoring 65 off 37 balls and opener Baxon Gopito adding 45 off 29 balls while the bowlers gave away 21 extras in 20 overs. Richard Ngarava was, by far, the most disciplined of the Takashinga 1 bowlers as he took three wickets for just 11 runs in his four overs, including one maiden. The extras came back to haunt Takashinga 1 as they could only reach 177/9 off their 20 overs in response. Batting at number three, Innocent Kaia had a match highest score of 71 off 46 balls, including nine fours, while Wellington Masakadza had the second highest contribution of 43 off 21 balls at number six. Takashinga 2 gave away just six extras with captain Prince Masvaure clainming three wickets for 30 off his four overs as did Takudzwa Chataira. In the morning matches, Mutare Sports Club beat Amakhosi by 13 runs defending 146/6 at Masvingo Sports Club. Jayden Schadendorf had the match highest score of 52 off 54 balls while opener Mathew Welch made 44 of 24 balls. In response, Amakhosi could only manage 133/8 off their 20 overs with a highest contribution of an unbeaten 47 off 34 balls coming from number six, Tanatswa Bechani. Bechani featured in the innings’ best partnership of 25 for the sixth wicket with Brandon James who had the second highest contribution of 18 off 15 balls. Tendai Chatara led the attack with four wickets for 32 in four overs while man-of-the-match Schadendorf took three wickets for 28 in four overs. At Mutare Sports Club, Westside held their nerves to secure a seven-run victory over Gladiators in a match pitting teams that had a 100 percent record. Westside made 180/5 with opener Definate Mawadzi scoring 73 off 47 balls while Tinashe Muchawaya was unbeaten on 25 off 18 balls. Gladiators were wayward with their bowling as they conceded 16 wides in 17 extras. Number three Milton Shumba scored 68 off 45 balls with Tony Munyonga’s 27 off 24 balls the second highest contribution in Gladiators’ 173/8. Westside were a bit expensive in their bowling as they gave away 17 extras, as much as their opponents- while Fortune Mhlanga claimed three wickets for 32 for the innings’ best bowling figures. Takashinga 2 v Rainbow (Takashinga Sports Club), Amakhosi v Takashinga 1 (Kwekwe Sports Club), Westside v Uprising (Old Hararians), Mutare Sports Club v Gladiators (Takashinga) P W L T NR PTS NRR Westside 3 3 0 0 0 6 1.690 Uprising 3 2 1 0 0 4 0.886 Gladiators 3 2 1 0 0 4 0.756 Takashinga 2 3 2 1 0 4 0.634 Mutare 3 2 1 0 0 4 0.317 Takashinga 1 3 1 2 0 0 -0.067 Amakhosi 3 0 3 0 0 0 -1.643 Rainbow 3 0 3 0 0 0 -1.700 GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday.","pubDate":"2023-09-28 22:01:51","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"37bdcaeb296458c20c48134220018004","title":"Bosso wary of ailing Makepekepe","link":"https://www.herald.co.zw/bosso-wary-of-ailing-makepekepe/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday.","content":"REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday. CAPS United is having a difficult league season which has seen their win-less streak stretching to nine matches. Their last league victory came against Green Fuel on August 7. Since then, they have lost five games and drawn four. CAPS United edged Hwange 1-0 to progress to the quarter-finals of the Chibuku Super Cup. Hosts Highlanders who booked a quarter-final place by winning 6-5 on penalties against Bulawayo Chiefs are also not on a good run in the league. Bosso have won one match in their last five games in the league. Both sides will know a cup game is never determined by league form but is rather a game won by whoever rises to the occasion on the day. “We are trying to work according to the programme which the coach has given us day by day. We respect CAPS United, make no mistake about that one. We really respect them. But we are not going to let them just walk over our heads just like that. We are going to give them a good fight,” said Ndlovu a hero of many cup and league games over Caps United in the 1980s. He challenged his troops to forget their present form and focus on winning against CAPS United. “It’s like a money game where we have to give it our all. “We have to give it our best. We want to assure our fans that we will give it our best. Let’s not dwell on the defeats we have suffered. Let’s look at things game by game. “Let’s look at CAPS United and see how we play against them according to the way we have trained. If our system does not work, then tough luck, we know in football there are three results, a win, a loss and a draw. “Our priority is to win the game. We will do our best to win the game. We are going to be working hard with the players to make sure we win the game. We will ask the players to come to the party. We are doing our best to lift up the boys because at this point in time, they are picking up in terms of morale,” said Ndlovu. Highlanders have a number of injury concerns going into Sunday’s game. Calvin Chigonero and Archford Faira picked up injuries in yesterday’s training session and are doubtful. Captain Ariel Sibanda is out with a foot injury. Devine Mhindirira, Darlington Mukuli and Godfrey Makaruse are also in the treatment room. The injuries at Highlanders should be a worrying factor, could it be the training or pitch? Added to that, Bosso will also be without defender Peter Muduhwa and midfielder Brighton Mhanhire, who are with the national team. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:46","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"28e5d4037ca518d61ca03c49e82548bc","title":"Another Serie A loss for Zemura","link":"https://www.herald.co.zw/another-serie-a-loss-for-zemura/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWE international defender, Jordan Zemura made his fourth Serie A appearance on yet another losing note on Wednesday night as champions Napoli demolished his Udinese 4-1.","content":"ZIMBABWE international defender, Jordan Zemura made his fourth Serie A appearance on yet another losing note on Wednesday night as champions Napoli demolished his Udinese 4-1. Napoli had endured a three-match win-less run prior to Wednesday night’s victory. As was the case of his previous three appearances, Zemura (23) was a second half substitute and replacing Hassane Kamara, 29, from Cote d’Ivoire. Udinese have now lost three of the four matches in which Zemura has played a part – Juventus (0-3), Fiorentina (0-2) and Napoli (1-4). In Wednesday’s game, Zemura was introduced in the 72nd minute when Napoli were leading 2-0 and it became 3-0 two minutes after the former Bournemouth left-back joined the fray — thus three of the night’s five goals were scored with Zemura in action. Zemura was given a rating of 6.2 out of 10, the second lowest of the five substitutes but it was deemed better than 10 of Udinese’s 11 starters with 24-year-old Slovenian centre-back Jaka Bijol getting a team lowest mark of 2.5 out of 10. After six Serie A games, Udinese are now in the relegation zone on goal difference with three points ahead of a home match against Genoa on Sunday. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:43","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"e93573b3ff2406855e82bce6522ccded","title":"Warriors ready for Botswana clash . . . captain Muduhwa happy to bounce back","link":"https://www.herald.co.zw/warriors-ready-for-botswana-clash-captain-muduhwa-happy-to-bounce-back/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE country’s senior men’s football team, the Warriors yesterday conducted two training sessions ahead of their friendly match against Botswana in Gaborone tomorrow.","content":"THE country’s senior men’s football team, the Warriors yesterday conducted two training sessions ahead of their friendly match against Botswana in Gaborone tomorrow. The Warriors squad for the tie was called last week only to assemble in the capital on Tuesday and leave for Botswana on Wednesday without conducting a single training session. Yesterday, Baltemar Brito held training sessions at Botswana Football Association Lekedi Football Centre. The first one started at 10am while the second workout was held after lunch at the same venue. Highlanders’ vice-captain Peter Muduhwa, who has since been appointed team captain, said they were pleased that the country has bounced back to the international football family. “As players we are very much happy that the country is back to playing international football after a long-time. This is a development that will benefit the players, clubs and the nation at large. Everyone always dreams to play for the national team and as players we are very much pleased and we will need more support from our fans,” said Muduhwa. Asked about his analysis of the two workouts they conducted yesterday, the combative Muduhwa said: “The training sessions that we had were okay. You could tell from the movement that there is some understanding within the players, we are used to each other. There are very few that we have not played together.” Liberty Mugari, who is part of the Zimbabwe Football Association (Zifa) communications department said all was well in camp. “The Warriors arrived well in Botswana. Just like Frank (Makarati) and Andrew (Mbeba), Shepherd Mhlanga of Chicken Inn was dropped for the same reason of seeking to balance the team and avoid having more than two players from one local club,” said Mugari. The trio of Thubelihle Jubane of Sheasham, Manica Diamonds’ Trevor Mavhunga and Clive Mandivhei of Yadah were last minute additions. Donovan Bernard (Chicken Inn), Nelson Chadya (Ngezi Platinum Stars) Peter Muduhwa, Godknows Murwira (Caps United), Farai Banda (Manica Diamonds), Qadr Amini (Ngezi Platinum Stars), Xolani Ndlovu (Chicken Inn), Thubelihle Jubane (Sheasham) Brighton Manhire (Highlanders), Brian Banda (FC Platinum), Tanaka Shandirwa (Dynamos), Mthokozisi Msebe (Bulawayo Chiefs), Donald Mudadi (Dynamos), Davison Marowa (Herentals), Walter Musona (FC Platinum), Tinotenda Benza (Herentals) Manica Diamonds’ Trevor Mavhunga (Manica Diamonds) Clive Mandivhei (Yadah) William Manondo (Caps United), Fortune Binzi (Manica Diamonds), Obriel Chirinda (Bulawayo Chiefs)- GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:36","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"76cbd39e4e5a44a3a9ffa062e754ffd8","title":"Munetsi gets Ligue 1 special mention","link":"https://www.herald.co.zw/munetsi-gets-ligue-1-special-mention/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE French Ligue 1 yesterday saluted Zimbabwe international Marshal Munetsi for an impressive start to the season with fifth-placed Stade de Reims.","content":"THE French Ligue 1 yesterday saluted Zimbabwe international Marshal Munetsi for an impressive start to the season with fifth-placed Stade de Reims. The 27-year-old Munetsi has featured in all Reims’ six matches, scoring once (first half opener) in the 2-0 win over Clermont and assisting thrice while also getting one yellow card. Yesterday, Ligue 1 took to X (formerly Twitter) to laud Munetsi: “Marshal Munetsi, the creator (Zimbabwe flag), 4 league goal contributions in 6 games (fire emoji).” Munetsi has been in Ligue 1 since the 2019/20 season after two seasons with Soweto giants, Orlando Pirates in the South African Premier Soccer League. With one goal, Munetsi is joint-third at Reims, behind Teddy Teuma with three goals and Mohamad Daramy (two). The three assists in six games put him joint-second with Moses Simon of Nantes, Takumi Minamino of Monaco and Le Havre’s Josue Casimir. Monaco’s Caio Henrique leads the charts with four assists. Munetsi’s assists came against Marseille on the opening weekend on August 12, providing J Ito with the opener after 10 minutes but they eventually lost the match 2-1 and then both in Reims’ 2-1 win at Lille on Tuesday. In Tuesday’s win, Munetsi assisted Mohamed Daramy with a headed pass from a corner in the 12th minute and then from open play four minutes later, allowing Keito Nakamura to blast home from the centre of the box. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:27","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"755cf064efaf6249dc3cb3538da36de7","title":"Rhinos seek successive victory","link":"https://www.herald.co.zw/rhinos-seek-successive-victory/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"Black Rhinos midfielder Nkosi Mhlanga says they will be gunning for victory when they face Chicken Inn in the Chibuku Super Cup at Luveve on Saturday.","content":"Black Rhinos midfielder Nkosi Mhlanga says they will be gunning for victory when they face Chicken Inn in the Chibuku Super Cup at Luveve on Saturday. Despite having a poor season, Black Rhinos have emerged as a force in the cup after knocking out fellow army side Cranborne Bullets and favourites Manica Diamonds and are now looking forward to upsetting the Gamecocks in their backyard. Last year Rhinos edged Chicken in the quarter-finals to book a ticket to the semi-final and they will be looking to replicate that same feat. Mhlanga believes they are in good shape as a team and can grind a much-needed result. The team is inspired by their last win against title aspirants Manica Diamonds. “We want to win and make sure we progress to the next round,’’ said Mhlanga. “This is a cup game and every small detail has to be taken note of as there is a need for high-concentration. “Normally we don’t look into form but what you are putting into on the day. How you are going to apply yourself in the field of play. “We have been struggling in the league but I guess the win against Manica is a good motivation for us. We want to win as many games as we can in all the competitions. If we win on Saturday it means winning two more games in the cup will see us being crowned champions and that will mean we have to work for it. “I am quite sure as a team we have enough respect for our opponents but we are going all out to defeat them. We are not underdogs though many are looking. “We have improved a lot and it means we have a good chance to stand our own ground and dictate our own terms. “The fact that we are not losing gives us a boost and will see us upset a number of teams that will be considering us underdogs. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:09","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"de5eb984905a465a1628e3f34b2a3eb8","title":"Hadebe wins US Open silverware","link":"https://www.herald.co.zw/hadebe-wins-us-open-silverware/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWE international Teenage Hadebe lifted his first silverware in the United States Major League football when he won the US Open Cup title with Houston Dynamo on Wednesday night. The 28-year-old played a cameo after he was introduced in the 91st minute to help see out the game for Houston Dynamo who beat Lionel Messi’s Inter-Milan and landed their second US Open Cup title. Speaking to Zimpapers Sport, Hadebe said:","content":"ZIMBABWE international Teenage Hadebe lifted his first silverware in the United States Major League football when he won the US Open Cup title with Houston Dynamo on Wednesday night. The 28-year-old played a cameo after he was introduced in the 91st minute to help see out the game for Houston Dynamo who beat Lionel Messi’s Inter-Milan and landed their second US Open Cup title. Speaking to Zimpapers Sport, Hadebe said: “I am happy to win my first silverware with the club, it’s something I always dreamt of since I got here. “And I’m proud that we’ve managed to do that as a team. “Of course it was an emotional moment for me, it’s something I was looking for-ward to. And this will be one of the highlights of my career as a footballer. “I want to thank everyone who wished my team good fortunes and everyone who has been sending me congratulatory messages,” he said. He added: “I want to prove my worth to the club and do all I can in making sure that I help my club in achieving their targets. “My target is to finish off at a better position and help my team win some more silverware.” Hadebe, who moved to the United States in 2021, recently returned from injury and was on target in Houston’s last league assignment, which they lost 1-2 to Kansas City. Hadebe has been out with injury for the last for months. He had surgery in May and has been recovering on the sidelines. The defender had last featured for his club during their third round US Open Cup match against Tampa Bay Rowdies which they won 1-0 on April 27. He could have rubbed shoulders against Messi and his former Barcelona teammate Jordi Alba but the duo watched from the sidelines after they were ruled out be-cause of injuries. With two of their stars missing, Houston took full advantage, scoring twice in the first half from Griffin Dorsey’s close-range thunderbolt and a penalty by Amine Bassi. Hadebe was part of the history when the final whistle blew, as Houston added a second US Open Cup to their trophy case after winning it in 2018. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:07","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"6fa17e39f07d26416ef84a5e5979bb6a","title":"Surrey wrap up back-to-back County Championship titles after second-placed Essex bowled out for 211 in final game against Northamptonshire","link":"https://www.dailymail.co.uk/sport/cricket/article-12572077/Surrey-wrap-County-Championship-titles-second-placed-Essex-bowled-211-final-game-against-Northamptonshire.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Alec Stewart saw Surrey wrap up another Championship title before being given a little family reminder of how far they still have to go to match the greatest of all county sides.","content":"Surrey wrap up back-to-back County Championship titles after second-placed Essex bowled out for 211 in final game against Northamptonshire Surrey have won the County Championship for a second successive year The title was confirmed when Essex were bowled out for 211 by Northants Surrey have strength in depth despite losing players to England and the IPL By Paul Newman for the Daily Mail Published: 17:41 BST, 28 September 2023 | Updated: 00:01 BST, 29 September 2023 e-mail 8 shares 5 View comments Alec Stewart saw Surrey wrap up another Championship title on Thursday before being given a little family reminder of how far they still have to go to match the greatest of all county sides. The second successive title, fourth in the last six years and 21st in all for Surrey was confirmed when Essex were bowled out for 211 by Northants in their forlorn pursuit of the score of 400 that might have taken this one-sided title race to a final day. In truth it has been all but decided since Essex were defeated by Hampshire last week, with Surrey not needing to be anywhere near their best at the Ageas Bowl against the same opponents before the big moment came with Will Jacks in the middle of an over. That will not matter to Surrey and their director of cricket and Oval and England legend Stewart who is well placed to judge how good this modern powerhouse of a county side are compared with the very best teams to grace the Oval in their illustrious history. ‘Dad still goes on about being part of the team that won it seven times on the trot,’ smiled Stewart of his father Micky’s role in the all-conquering Surrey side of the 1950s. Surrey have won the County Championship for a second successive year as their triumph was confirmed on Thursday ‘We have now won it back to back and we will try to do it again next year but there are still plenty of challenges ahead. It’s certainly not a question of two titles and that’s it.’ Surrey should be able to dominate for some time yet, with their strength in depth emphasised by them using 19 players across 14 games having lost so many to England and the IPL. They will only add to that strength next year when Dan Lawrence joins from Essex. Lawrence had a miserable goodbye to Essex when they went on to be beaten by an innings by relegated Northants, with there also being no fanfare or fitting departure for Alastair Cook. England’s record runscorer and former captain was dismissed for just six in what still seems certain to be his last innings before retirement. Share or comment on this article: Surrey wrap up back-to-back County Championship titles after second-placed Essex bowled out for 211 in final game against Northamptonshire e-mail 8 shares Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-28 23:01:58","image_url":"https://i.dailymail.co.uk/1s/2023/09/28/17/75944911-0-image-m-12_1695918619338.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4428bf8387f476b02d0d28b4d20940f3","title":"‘Mr Chibuku’ misses CAPS United match","link":"https://www.herald.co.zw/mr-chibuku-misses-caps-united-match/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty.","content":"GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. Makepekepe and Highlanders will clash for the first time in this tournament on Sunday at Barbourfields. Addressing a pre-match press conference yesterday, the Green Machine assistant coach Fungai Tostao Kwashi said they will miss Manondo, the club’s top goal scorer with six strikes to his name this season. Not many years ago, Manondo endeared himself to the domestic football fraternity as “Mr Chibuku” because of his distinct scoring record in this competition, after leading Harare City to two titles in 2015 and 2017 with his unrivalled marksmanship. However, the 32-year-old will not be available for the crucial battle against Bosso, along with defender Godknows Murwira. The pair is in Botswana with the national team for the neighbours’ independence day celebrations invitational match to be played in Gaborone tomorrow. Bosso defender Peter Muduhwa and midfielder Brighton Manhire are also out of this match because of the Warriors’ commitments while injured goalkeeper and captain Ariel Sibanda is a doubtful starter. “Obviously, any team would want to have a full complement of their squad or their best players for such a match as this (against Highlanders). But if you look at the other side of the coin, it’s actually an opportunity for the other players who will be getting the starts to shine. “Sometimes these things work as a blessing in disguise. So the guys who will be given the chance should grab it with both hands and give an excellent performance. “We wish Murwira and Manondo all the best with the national team. The club has enough personnel and enough quality players to play this weekend and get the results,” said Kwashi. Makepekepe progressed to the quarter-final after beating Hwange in the last 16. But they have a poor record in the Chibuku Super Cup, in which they only managed to go past the quarter-final stage once, in 2018, before losing to Harare City in the last four. In fact, they have historically struggled to go beyond the first round. This year’s Chibuku Super Cup tournament has coincided with a troubled league campaign, in which they find themselves closer to the relegation zone than they are to the team at the top. But Kwashi believes Chibuku could be their hope to finish with silverware and gatecrash into CAF inter-club competitions. “At this juncture, we are in the Chibuku Super Cup and we would want to go as far as possible. And obviously because we are known as the Cup Kings, we have done well in Africa before. So our target is going back into the continent. “This is the route, the other one being the league competition. So we are serious and we are challenging ourselves to go step further than we have done before in the Chibuku Super Cup. “We haven’t won the Chibuku Cup yet but we are known as the Cup Kings. So it’s one cup which we need in our trophy cabinet; and we are not putting ourselves under pressure. “But after the performances we gave, especially in the second half (of the 1-0 Harare Derby defeat to Dynamos) last week, we are going into this game against Highlanders with so much confidence, so much exuberance and zeal to do better. “We have to try and give something back to the fans who have been supporting us through this tough period we are going through. “We owe them a victory; we owe them a cup but like I said we are going to do this without putting unnecessary pressure on ourselves. “We are going to work hard, give everything we have so that we enhance our chances of winning. We are going to take it one game at a time and we have an important game on Sunday,” said Kwashi. FC Platinum v Dynamos (Mandava), Chicken Inn v Black Rhinos (Luveve) Herentals v Ngezi Platinum Stars (National Sports Stadium), Highlanders v CAPS United (Barbourfields) THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club. REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday.","pubDate":"2023-09-28 22:04:34","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"e4b1da57b2d78908a4e7ed884ba33e3f","title":"ZOC to push team sports to qualify","link":"https://www.herald.co.zw/zoc-to-push-team-sports-to-qualify/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games.","content":"THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. Throughout history, only two women’s teams have made it to the Olympic games. Zimbabwe had the women’s hockey team at the 1980 Olympic Games in Russia and the women’s football team at the Rio 2016 Olympic Games in Brazil. They have mostly had individual athletes qualifying for the Games and in an interview with Zimpapers Television Network, ZTN Prime’s Morning Rush, ZOC chief executive Marlene Gadzirayi said for the Paris 2024 Olympic Games, they have provided assistance for teams to help their qualification bids. These include rugby — the Cheetahs and Lady Cheetahs — as well as the national men and women’s hockey teams that are chasing qualification. The Lady Cheetahs are set to travel to Tunisia for the Olympic qualifier to take place on October 14 and 15 and the hockey teams are expected to compete in their qualifier from October 29 to November 5 in Pretoria, South Africa. The Cheetahs missed out on qualification when coming fourth at the Rugby Africa Men’s Sevens staged at Harare Sports Club about two weeks ago. The 12-team tournament was al-so serving as the qualifiers for the Paris 2024 Olympic Games. “So in terms of scholarships, yes they are for individual sport, but then another example is yes we are actually supporting the hockey team, they are going for qualifiers in South Africa . . . So it would really just always be better for Zimbabwe to have more athletes at the Olympics. “It’s always good when you (are) looking at the Opening ceremony to see countries that have big delegations and Zimbabwe have maybe sometimes less than 10, so having a team qualifying is beyond amazing for Zimbabwe. “So we really need to keep pushing on that and like I have said we were supporting the sevens — the Cheetahs, the Lady Cheetahs, the hockey team as well will be going to South Africa for qualifiers. “So we are also trying our best to ensure that teams also get to qualify because it’s really better not just for the Olympic Committee but for the nation as a whole,” said Gadzirayi. So far only marathon runner Isaac Mpofu has qualified for the Games. He is one of the 10 beneficiaries of the IOC Olympic Solidarity scholarships. The other recipients are Andie Kuipers (triathlon), Donata Katai and Nomvula Mjimba (swimming) Justine Carla Hobbs and Stephen Cox (rowing), Fortunate Chidzivo, Chengetayi Mapaya and Tinotenda Matiyenga (athletics) and judoka Christi Rose Prestorius. Most of the athletes are still in the qualification phase and the ZOC chief executive said they are optimistic. And are also supporting other individual athletes that did not receive the Olympic Solidarity scholarships such as South Africa-based long distance runner Rutendo Nyahora. “So we have one who has qualified, Isaac Mpofu in marathon. But others are still going through the qualifiers. “Rutendo Nyahora, she is not on the scholarship but we have assisted her. We have Andie Kuipers in triathlon. “So the qualifiers are still going on, so we actually are still keeping our fingers crossed that at least some of them qualify. “We have Donata Katai also in swimming and Nomvula in swimming as well. So all those athletes are the ones who have the potential and we are hoping that as they go to the quali-fiers they do qualify,” said Gadzirayi. In the previous Games, Zimbabwe had a team of five athletes competing in athletics, swimming, rowing and golf. They will be hoping for an improved number of athletes this time around. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club. REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday. ZIMBABWE international defender, Jordan Zemura made his fourth Serie A appearance on yet another losing note on Wednesday night as champions Napoli demolished his Udinese 4-1.","pubDate":"2023-09-28 22:01:59","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"44cc3b9eade9e29bdc99cbd61c685d7c","title":"Uprising biggest winners in round 3","link":"https://www.herald.co.zw/uprising-biggest-winners-in-round-3/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","content":"UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club. At Old Hararians Sports Club, opener Nicholas Welch led the Uprising scoring with 68 off 37 balls, hitting six fours and four sixes while Takudzwanaishe Kaitano made 54 off 26 balls, which included five sixes and four fours for a score of 202/6 after 20 overs. In response, Rainbow could only manage 120 all out in 17.2 overs with Jonathan Campbell the only defiant batsman with 41 off 22 balls while seven others failed to reach double figures. Brian Bennet led the Uprising attack with five wickets for 17 off his four overs. In the other afternoon match at Takashinga Sports Club, Takashinga 2 beat Takashinga 1 by 18 runs in a high scoring match. Takashinga 2 made 195/6 batting first with Antum Navqi scoring 65 off 37 balls and opener Baxon Gopito adding 45 off 29 balls while the bowlers gave away 21 extras in 20 overs. Richard Ngarava was, by far, the most disciplined of the Takashinga 1 bowlers as he took three wickets for just 11 runs in his four overs, including one maiden. The extras came back to haunt Takashinga 1 as they could only reach 177/9 off their 20 overs in response. Batting at number three, Innocent Kaia had a match highest score of 71 off 46 balls, including nine fours, while Wellington Masakadza had the second highest contribution of 43 off 21 balls at number six. Takashinga 2 gave away just six extras with captain Prince Masvaure clainming three wickets for 30 off his four overs as did Takudzwa Chataira. In the morning matches, Mutare Sports Club beat Amakhosi by 13 runs defending 146/6 at Masvingo Sports Club. Jayden Schadendorf had the match highest score of 52 off 54 balls while opener Mathew Welch made 44 of 24 balls. In response, Amakhosi could only manage 133/8 off their 20 overs with a highest contribution of an unbeaten 47 off 34 balls coming from number six, Tanatswa Bechani. Bechani featured in the innings’ best partnership of 25 for the sixth wicket with Brandon James who had the second highest contribution of 18 off 15 balls. Tendai Chatara led the attack with four wickets for 32 in four overs while man-of-the-match Schadendorf took three wickets for 28 in four overs. At Mutare Sports Club, Westside held their nerves to secure a seven-run victory over Gladiators in a match pitting teams that had a 100 percent record. Westside made 180/5 with opener Definate Mawadzi scoring 73 off 47 balls while Tinashe Muchawaya was unbeaten on 25 off 18 balls. Gladiators were wayward with their bowling as they conceded 16 wides in 17 extras. Number three Milton Shumba scored 68 off 45 balls with Tony Munyonga’s 27 off 24 balls the second highest contribution in Gladiators’ 173/8. Westside were a bit expensive in their bowling as they gave away 17 extras, as much as their opponents- while Fortune Mhlanga claimed three wickets for 32 for the innings’ best bowling figures. Takashinga 2 v Rainbow (Takashinga Sports Club), Amakhosi v Takashinga 1 (Kwekwe Sports Club), Westside v Uprising (Old Hararians), Mutare Sports Club v Gladiators (Takashinga) P W L T NR PTS NRR Westside 3 3 0 0 0 6 1.690 Uprising 3 2 1 0 0 4 0.886 Gladiators 3 2 1 0 0 4 0.756 Takashinga 2 3 2 1 0 4 0.634 Mutare 3 2 1 0 0 4 0.317 Takashinga 1 3 1 2 0 0 -0.067 Amakhosi 3 0 3 0 0 0 -1.643 Rainbow 3 0 3 0 0 0 -1.700 GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday.","pubDate":"2023-09-28 22:01:51","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"37bdcaeb296458c20c48134220018004","title":"Bosso wary of ailing Makepekepe","link":"https://www.herald.co.zw/bosso-wary-of-ailing-makepekepe/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday.","content":"REGARDLESS of CAPS United’s poor form, Highlanders assistant coach Madinda Ndlovu says they will treat the Harare Giants with respect when the two teams clash in a Chibuku Super Cup quarter-final tie at Barbourfields Stadium on Sunday. CAPS United is having a difficult league season which has seen their win-less streak stretching to nine matches. Their last league victory came against Green Fuel on August 7. Since then, they have lost five games and drawn four. CAPS United edged Hwange 1-0 to progress to the quarter-finals of the Chibuku Super Cup. Hosts Highlanders who booked a quarter-final place by winning 6-5 on penalties against Bulawayo Chiefs are also not on a good run in the league. Bosso have won one match in their last five games in the league. Both sides will know a cup game is never determined by league form but is rather a game won by whoever rises to the occasion on the day. “We are trying to work according to the programme which the coach has given us day by day. We respect CAPS United, make no mistake about that one. We really respect them. But we are not going to let them just walk over our heads just like that. We are going to give them a good fight,” said Ndlovu a hero of many cup and league games over Caps United in the 1980s. He challenged his troops to forget their present form and focus on winning against CAPS United. “It’s like a money game where we have to give it our all. “We have to give it our best. We want to assure our fans that we will give it our best. Let’s not dwell on the defeats we have suffered. Let’s look at things game by game. “Let’s look at CAPS United and see how we play against them according to the way we have trained. If our system does not work, then tough luck, we know in football there are three results, a win, a loss and a draw. “Our priority is to win the game. We will do our best to win the game. We are going to be working hard with the players to make sure we win the game. We will ask the players to come to the party. We are doing our best to lift up the boys because at this point in time, they are picking up in terms of morale,” said Ndlovu. Highlanders have a number of injury concerns going into Sunday’s game. Calvin Chigonero and Archford Faira picked up injuries in yesterday’s training session and are doubtful. Captain Ariel Sibanda is out with a foot injury. Devine Mhindirira, Darlington Mukuli and Godfrey Makaruse are also in the treatment room. The injuries at Highlanders should be a worrying factor, could it be the training or pitch? Added to that, Bosso will also be without defender Peter Muduhwa and midfielder Brighton Mhanhire, who are with the national team. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:46","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"28e5d4037ca518d61ca03c49e82548bc","title":"Another Serie A loss for Zemura","link":"https://www.herald.co.zw/another-serie-a-loss-for-zemura/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWE international defender, Jordan Zemura made his fourth Serie A appearance on yet another losing note on Wednesday night as champions Napoli demolished his Udinese 4-1.","content":"ZIMBABWE international defender, Jordan Zemura made his fourth Serie A appearance on yet another losing note on Wednesday night as champions Napoli demolished his Udinese 4-1. Napoli had endured a three-match win-less run prior to Wednesday night’s victory. As was the case of his previous three appearances, Zemura (23) was a second half substitute and replacing Hassane Kamara, 29, from Cote d’Ivoire. Udinese have now lost three of the four matches in which Zemura has played a part – Juventus (0-3), Fiorentina (0-2) and Napoli (1-4). In Wednesday’s game, Zemura was introduced in the 72nd minute when Napoli were leading 2-0 and it became 3-0 two minutes after the former Bournemouth left-back joined the fray — thus three of the night’s five goals were scored with Zemura in action. Zemura was given a rating of 6.2 out of 10, the second lowest of the five substitutes but it was deemed better than 10 of Udinese’s 11 starters with 24-year-old Slovenian centre-back Jaka Bijol getting a team lowest mark of 2.5 out of 10. After six Serie A games, Udinese are now in the relegation zone on goal difference with three points ahead of a home match against Genoa on Sunday. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:43","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"e93573b3ff2406855e82bce6522ccded","title":"Warriors ready for Botswana clash . . . captain Muduhwa happy to bounce back","link":"https://www.herald.co.zw/warriors-ready-for-botswana-clash-captain-muduhwa-happy-to-bounce-back/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE country’s senior men’s football team, the Warriors yesterday conducted two training sessions ahead of their friendly match against Botswana in Gaborone tomorrow.","content":"THE country’s senior men’s football team, the Warriors yesterday conducted two training sessions ahead of their friendly match against Botswana in Gaborone tomorrow. The Warriors squad for the tie was called last week only to assemble in the capital on Tuesday and leave for Botswana on Wednesday without conducting a single training session. Yesterday, Baltemar Brito held training sessions at Botswana Football Association Lekedi Football Centre. The first one started at 10am while the second workout was held after lunch at the same venue. Highlanders’ vice-captain Peter Muduhwa, who has since been appointed team captain, said they were pleased that the country has bounced back to the international football family. “As players we are very much happy that the country is back to playing international football after a long-time. This is a development that will benefit the players, clubs and the nation at large. Everyone always dreams to play for the national team and as players we are very much pleased and we will need more support from our fans,” said Muduhwa. Asked about his analysis of the two workouts they conducted yesterday, the combative Muduhwa said: “The training sessions that we had were okay. You could tell from the movement that there is some understanding within the players, we are used to each other. There are very few that we have not played together.” Liberty Mugari, who is part of the Zimbabwe Football Association (Zifa) communications department said all was well in camp. “The Warriors arrived well in Botswana. Just like Frank (Makarati) and Andrew (Mbeba), Shepherd Mhlanga of Chicken Inn was dropped for the same reason of seeking to balance the team and avoid having more than two players from one local club,” said Mugari. The trio of Thubelihle Jubane of Sheasham, Manica Diamonds’ Trevor Mavhunga and Clive Mandivhei of Yadah were last minute additions. Donovan Bernard (Chicken Inn), Nelson Chadya (Ngezi Platinum Stars) Peter Muduhwa, Godknows Murwira (Caps United), Farai Banda (Manica Diamonds), Qadr Amini (Ngezi Platinum Stars), Xolani Ndlovu (Chicken Inn), Thubelihle Jubane (Sheasham) Brighton Manhire (Highlanders), Brian Banda (FC Platinum), Tanaka Shandirwa (Dynamos), Mthokozisi Msebe (Bulawayo Chiefs), Donald Mudadi (Dynamos), Davison Marowa (Herentals), Walter Musona (FC Platinum), Tinotenda Benza (Herentals) Manica Diamonds’ Trevor Mavhunga (Manica Diamonds) Clive Mandivhei (Yadah) William Manondo (Caps United), Fortune Binzi (Manica Diamonds), Obriel Chirinda (Bulawayo Chiefs)- GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:36","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"76cbd39e4e5a44a3a9ffa062e754ffd8","title":"Munetsi gets Ligue 1 special mention","link":"https://www.herald.co.zw/munetsi-gets-ligue-1-special-mention/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE French Ligue 1 yesterday saluted Zimbabwe international Marshal Munetsi for an impressive start to the season with fifth-placed Stade de Reims.","content":"THE French Ligue 1 yesterday saluted Zimbabwe international Marshal Munetsi for an impressive start to the season with fifth-placed Stade de Reims. The 27-year-old Munetsi has featured in all Reims’ six matches, scoring once (first half opener) in the 2-0 win over Clermont and assisting thrice while also getting one yellow card. Yesterday, Ligue 1 took to X (formerly Twitter) to laud Munetsi: “Marshal Munetsi, the creator (Zimbabwe flag), 4 league goal contributions in 6 games (fire emoji).” Munetsi has been in Ligue 1 since the 2019/20 season after two seasons with Soweto giants, Orlando Pirates in the South African Premier Soccer League. With one goal, Munetsi is joint-third at Reims, behind Teddy Teuma with three goals and Mohamad Daramy (two). The three assists in six games put him joint-second with Moses Simon of Nantes, Takumi Minamino of Monaco and Le Havre’s Josue Casimir. Monaco’s Caio Henrique leads the charts with four assists. Munetsi’s assists came against Marseille on the opening weekend on August 12, providing J Ito with the opener after 10 minutes but they eventually lost the match 2-1 and then both in Reims’ 2-1 win at Lille on Tuesday. In Tuesday’s win, Munetsi assisted Mohamed Daramy with a headed pass from a corner in the 12th minute and then from open play four minutes later, allowing Keito Nakamura to blast home from the centre of the box. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:27","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"755cf064efaf6249dc3cb3538da36de7","title":"Rhinos seek successive victory","link":"https://www.herald.co.zw/rhinos-seek-successive-victory/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"Black Rhinos midfielder Nkosi Mhlanga says they will be gunning for victory when they face Chicken Inn in the Chibuku Super Cup at Luveve on Saturday.","content":"Black Rhinos midfielder Nkosi Mhlanga says they will be gunning for victory when they face Chicken Inn in the Chibuku Super Cup at Luveve on Saturday. Despite having a poor season, Black Rhinos have emerged as a force in the cup after knocking out fellow army side Cranborne Bullets and favourites Manica Diamonds and are now looking forward to upsetting the Gamecocks in their backyard. Last year Rhinos edged Chicken in the quarter-finals to book a ticket to the semi-final and they will be looking to replicate that same feat. Mhlanga believes they are in good shape as a team and can grind a much-needed result. The team is inspired by their last win against title aspirants Manica Diamonds. “We want to win and make sure we progress to the next round,’’ said Mhlanga. “This is a cup game and every small detail has to be taken note of as there is a need for high-concentration. “Normally we don’t look into form but what you are putting into on the day. How you are going to apply yourself in the field of play. “We have been struggling in the league but I guess the win against Manica is a good motivation for us. We want to win as many games as we can in all the competitions. If we win on Saturday it means winning two more games in the cup will see us being crowned champions and that will mean we have to work for it. “I am quite sure as a team we have enough respect for our opponents but we are going all out to defeat them. We are not underdogs though many are looking. “We have improved a lot and it means we have a good chance to stand our own ground and dictate our own terms. “The fact that we are not losing gives us a boost and will see us upset a number of teams that will be considering us underdogs. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:09","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"de5eb984905a465a1628e3f34b2a3eb8","title":"Hadebe wins US Open silverware","link":"https://www.herald.co.zw/hadebe-wins-us-open-silverware/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWE international Teenage Hadebe lifted his first silverware in the United States Major League football when he won the US Open Cup title with Houston Dynamo on Wednesday night. The 28-year-old played a cameo after he was introduced in the 91st minute to help see out the game for Houston Dynamo who beat Lionel Messi’s Inter-Milan and landed their second US Open Cup title. Speaking to Zimpapers Sport, Hadebe said:","content":"ZIMBABWE international Teenage Hadebe lifted his first silverware in the United States Major League football when he won the US Open Cup title with Houston Dynamo on Wednesday night. The 28-year-old played a cameo after he was introduced in the 91st minute to help see out the game for Houston Dynamo who beat Lionel Messi’s Inter-Milan and landed their second US Open Cup title. Speaking to Zimpapers Sport, Hadebe said: “I am happy to win my first silverware with the club, it’s something I always dreamt of since I got here. “And I’m proud that we’ve managed to do that as a team. “Of course it was an emotional moment for me, it’s something I was looking for-ward to. And this will be one of the highlights of my career as a footballer. “I want to thank everyone who wished my team good fortunes and everyone who has been sending me congratulatory messages,” he said. He added: “I want to prove my worth to the club and do all I can in making sure that I help my club in achieving their targets. “My target is to finish off at a better position and help my team win some more silverware.” Hadebe, who moved to the United States in 2021, recently returned from injury and was on target in Houston’s last league assignment, which they lost 1-2 to Kansas City. Hadebe has been out with injury for the last for months. He had surgery in May and has been recovering on the sidelines. The defender had last featured for his club during their third round US Open Cup match against Tampa Bay Rowdies which they won 1-0 on April 27. He could have rubbed shoulders against Messi and his former Barcelona teammate Jordi Alba but the duo watched from the sidelines after they were ruled out be-cause of injuries. With two of their stars missing, Houston took full advantage, scoring twice in the first half from Griffin Dorsey’s close-range thunderbolt and a penalty by Amine Bassi. Hadebe was part of the history when the final whistle blew, as Houston added a second US Open Cup to their trophy case after winning it in 2018. GIANTS CAPS United are ready to go into the Chibuku Super Cup battle against old foes Highlanders without their top marksman William Manondo who is away on national team duty. THE Zimbabwe Olympic Committee will keep pushing to have team sports qualify for the Olympic Games. UPRISING were the biggest winners in Round 3 of the National Premier League T20 Blast cricket tournament on Wednesday as they beat Rainbow by 82 runs while there were wins for Takashinga 2, Westside and Mutare Sports Club.","pubDate":"2023-09-28 22:01:07","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"}]}