{"newsArray":[{"title":"Maris Stella meet St. Sylvester’s in the Under 19 Tier ‘B’ quarter-final","link":"http://island.lk/maris-stella-meet-st-sylvesters-in-the-under-19-tier-b-quarter-final/","keywords":["Sports","Maris Stella","St. Sylvesters","Under 19 Tier ‘B’ quarter-final"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group […]","content":"Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group (Z). St. Sylvester’s are led by Malith Kulatunge. Maris Stella (from): Kaveen Fernando (Captain), Shen Adithya (Vice Captain), Navindu Wijesooriya, Sachiru Hansala, Ayesh Perera, Sandew Rathnayaka, Rahumath Deen, Ramith Bandara, Levin Fernando, Randeera de Silva, Nethum Basnayaka, Akalanka Fernando, Mineth Fernando, Hasindu Perera, Anshen De Silva, Ameesha Fernando, Manjua Nayanajith, Shevin Hewavitharana, Binal Fernando, Rayan Punchihewa, Hansala Kulasooriya, Adithya Fernando, Pawan Edirisinghe, Hasthika De Silva, Rasul Fernando, Dilash Fernando, Senura Liyanage. St. Sylvester’s (from): Malith Kulatunge (Captain), Akila Wickramasinghe, Isuru Gunasekara, Khanka Wickramasinghe, Charuka Ayeshan, Sahan Dissanayake, Kavishka Imesh, Chandupa Waduge, Yoshitha Isuranga, Wageesha Hansala, Chamod Dissanayake, Dion Fernando, Pansilu Bandara, Nimesha Silva, Kashyapa Dissanayake, Piyumaka Karunarathna, Chandimal Wijewardana, Arusha Mendis, Sihina Bandara, Sandaruwan Herath, Published on By Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as well. Suranga Ranaweera of Dehiwala Mount Lavinia Sports Club was placed third. Air Force won the women’s team championship In the women’s event, which was an 84-kilo metres race, Dinesha Dilrukshi (2:34.46 secs) of Sri Lanka Air Force was the winner. Sudharika Priyadharshani was placed second, while Navy’s Anne Shenali settled for the third position in this one-day event. The three-stage men’s event commenced with a participation of 160 cyclists on March 2 at close proximity to the Air Force headquarters in Colombo. Sri Lanka Air Force conducted the event for the 24th time. Men’s event was conducted in three stages Some 160 participants competed Men’s event was conducted in three stages. in the men’s event Dinesha Dilrukshi of the Air Force was the winner of the women’s race. Published on By With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa. Published on By BBC reported that a man has died after a fight between football fans outside a pub. Tony Johnson, 55, was found with a serious head injury near The Manchester bar on the Promenade in Blackpool at 19:00 GMT on Saturday. Blackpool Football Club said they were “deeply shocked and saddened” by the grandfather’s death. Johnson’s partner said his family were “heartbroken” and “devastated”. Supporters had clashed after the match between Blackpool and Burnley.","pubDate":"2023-03-07 00:00:55","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Chandana, Avishka guide Army to clinch cycling title","link":"http://island.lk/chandana-avishka-guide-army-to-clinch-cycling-title/","keywords":["Sports","Air Force cycle race","Air Force cycle race 2023"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as […]","content":"Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as well. Suranga Ranaweera of Dehiwala Mount Lavinia Sports Club was placed third. Air Force won the women’s team championship In the women’s event, which was an 84-kilo metres race, Dinesha Dilrukshi (2:34.46 secs) of Sri Lanka Air Force was the winner. Sudharika Priyadharshani was placed second, while Navy’s Anne Shenali settled for the third position in this one-day event. The three-stage men’s event commenced with a participation of 160 cyclists on March 2 at close proximity to the Air Force headquarters in Colombo. Sri Lanka Air Force conducted the event for the 24th time. Men’s event was conducted in three stages Some 160 participants competed Men’s event was conducted in three stages. in the men’s event Dinesha Dilrukshi of the Air Force was the winner of the women’s race. Published on By Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group (Z). St. Sylvester’s are led by Malith Kulatunge. Maris Stella (from): Kaveen Fernando (Captain), Shen Adithya (Vice Captain), Navindu Wijesooriya, Sachiru Hansala, Ayesh Perera, Sandew Rathnayaka, Rahumath Deen, Ramith Bandara, Levin Fernando, Randeera de Silva, Nethum Basnayaka, Akalanka Fernando, Mineth Fernando, Hasindu Perera, Anshen De Silva, Ameesha Fernando, Manjua Nayanajith, Shevin Hewavitharana, Binal Fernando, Rayan Punchihewa, Hansala Kulasooriya, Adithya Fernando, Pawan Edirisinghe, Hasthika De Silva, Rasul Fernando, Dilash Fernando, Senura Liyanage. St. Sylvester’s (from): Malith Kulatunge (Captain), Akila Wickramasinghe, Isuru Gunasekara, Khanka Wickramasinghe, Charuka Ayeshan, Sahan Dissanayake, Kavishka Imesh, Chandupa Waduge, Yoshitha Isuranga, Wageesha Hansala, Chamod Dissanayake, Dion Fernando, Pansilu Bandara, Nimesha Silva, Kashyapa Dissanayake, Piyumaka Karunarathna, Chandimal Wijewardana, Arusha Mendis, Sihina Bandara, Sandaruwan Herath, Published on By With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa. Published on By BBC reported that a man has died after a fight between football fans outside a pub. Tony Johnson, 55, was found with a serious head injury near The Manchester bar on the Promenade in Blackpool at 19:00 GMT on Saturday. Blackpool Football Club said they were “deeply shocked and saddened” by the grandfather’s death. Johnson’s partner said his family were “heartbroken” and “devastated”. Supporters had clashed after the match between Blackpool and Burnley.","pubDate":"2023-03-07 00:00:00","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Nirmal, Abhishek help Richmond take upper hand","link":"http://island.lk/nirmal-abhishek-help-richmond-take-upper-hand/","keywords":["Sports","Featured","Sharon Abhishek","Tharinda Nirmal","Under 19 Division I Tier"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Under 19 Division I Tier ‘A’ Cricket Quarter-Final by Reemus Fernando With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points […]","content":"With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa. Published on By BBC reported that a man has died after a fight between football fans outside a pub. Tony Johnson, 55, was found with a serious head injury near The Manchester bar on the Promenade in Blackpool at 19:00 GMT on Saturday. Blackpool Football Club said they were “deeply shocked and saddened” by the grandfather’s death. Johnson’s partner said his family were “heartbroken” and “devastated”. Supporters had clashed after the match between Blackpool and Burnley. Published on By Hayley Matthews starred with the bat and ball as Mumbai Indians hammered Royal Challengers Bangalore by nine wickets at the Brabourne Stadium. It was MI’s second consecutive win while RCB are yet to get off the mark after two games. Brief Scores: RCB 155 in 18.4 overs (Richa Ghosh 28;Haley Matthews 3-28) MI 159/1 in 14.2 overs (Hayley Matthews 77*, Nat Sciver-Brunt 55*) by 9 wickets Published on By Shakib Al Hasan’s all-round efforts prevented England from clean-sweeping the ODI series as Bangladesh won the final ODI by 50 runs. Following patient half-centuries from Mushfiqur Rahim and Najmul Hossain, Shakib struck a 71-ball 75 to help Bangladesh to 246 despite wickets falling from the other end. The left-handed all-rounder then made key incisions with the ball, picking his 300th ODI wicket en route to figures of 4 for 35 as England folded for 196. Brief scores: 246 in 48.5 overs (Shakib Al Hasan 75, Mushfiqur Rahim 70; Jofra Archer 3-35, Adil Rashid 2-21) 196 in 43.1 overs (James Vince 38, Chris Woakes 34; Shakib Al Hasan 4-35, Ebadot Hossain 2-38)","pubDate":"2023-03-06 23:55:57","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Australian cricketer Nathan Bracken is unrecognisable as he stands for Liberals in NSW election","link":"https://www.dailymail.co.uk/sport/cricket/article-11824759/Australian-cricketer-Nathan-Bracken-unrecognisable-stands-Liberals-NSW-election.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"An Aussie limited overs genius who took 186 wickets for Australia from 121 international matches looks nothing like the cult hero he was as he makes a surprise foray into state politics.","content":"Aussie cult cricket star is unrecognisable from his playing days as he makes a shock career switch ODI cricketing legend has made career switch Star quick is standing in NSW State election He is unrecognisable without iconic locks By Kristy Williams For Daily Mail Australia Published: 05:33, 6 March 2023 | Updated: 21:26, 6 March 2023 e-mail 15 View comments Aussie limited-overs cricket star Nathan Bracken took 186 wickets for Australia from 121 international matches - but surprisingly, politics is where the cult hero now plies his trade. The left-arm quick was one of the first bowlers to really master the art of slower cutter balls, and was the second-fastest bowler to reach 100 ODI wickets - behind only two legendary players: Shane Warne and Dennis Lillee. During his international playing days from 2001-2009, Bracken was known for flowing blond locks that were often held in place by a headband. But he doesn't look like that anymore. The 45-year-old, who was raised in the Blue Mountains west of Sydney, now resides on the state's Central Coast, and is running as the Liberal candidate for The Entrance electorate in the upcoming State election. Nathan Bracken took an incredible 174 wickets in a brilliant 116-match ODI career for Australia that was cut short by injury The towering quick, pictured with wife Haley, is unrecognisable from his days when he was one of the Australia side's most popular players Bracken sends one down during the 2006 ICC Champions Trophy - which Australia won - sporting his iconic blonde locks Gone are the iconic locks. The towering 195cm ex-cricketer now sports a short, cropped style with a middle part, which is often accompanied by a scruffy, pepper-coloured beard. Since he had to retire in 2011 due to a debilitating knee injury - which he sued Cricket Australia for $1million over - Bracken has taken to a variety of jobs. After doing a Bachelor of Communications, Bracken has dipped his toe in commentary, done a significant amount of cricket coaching, filled a variety of business manager roles and is currently an account manager at Boral Concrete, according to his LinkedIn page. And now embattled Liberals leader Dominic Perrottet has turned to the ex-cricketer to try and overcome a 5.2 per cent swing against Labor incumbent David Mehan, who has held the seat since 2015. Bracken, who has been a member of the Liberal Party for two years, previously ran as an Independent (who preferenced the Liberals) for the Federal seat in 2013, though he will be hoping to go much better this time around after only securing 8.2 per cent of the primary vote. Nathan Bracken lives with long-time wife Haley and sons Chase and Tag on the NSW Central Coast after growing up in the Blue Mountains, west of Sydney Bracken celebrates a wicket in one of his five Tests for Australia. The left-armer was considered a limited-overs specialist given the stacked talent of quicks during his generation The lanky quick said he wanted to give the burgeoning Central Coast population 'a voice' in State parliament ahead of the election - which the Labor party is heavily favoured to win - on March 25. 'I've been on the Central Coast now for pretty much close to 20 years … I made a decision a while a go to not be someone who sits around and whinges about it …(I want to focus on) what it can be, the infrastructure, the opportunities all the residents want it to have,' he told the Daily Telegraph . 'What Dominic (Perrottet) has been through and where he is taking us … going forward, (it's) a great opportunity to leapfrog out of Covid and put us on the front foot for the future.' Though he appears to have a short memory when it comes to political allegiances. When standing as an independent in the 2013 Federal election, Bracken insisted he had no interest in joining a major party, and 'floats around' the political spectrum. 'Once you have alignment with a party you can't make a judgement call on every issue,' he told News Corp in 2012. 'When I was playing cricket I knew where it was going, what my plan was, and if things changed I could go with it. With a party sometimes you can't change direction.' Nathan Bracken, sporting his iconic blonde locks, sends one down in Australia's successful 2007 ODI World Cup campaign But ten years down the track he insists that he has always been on the Liberals side. 'My views have always been down the Liberal side of things, even when I ran as an independent, I preferenced the Liberals,' Bracken said. The popular community man, who has been an ambassador for a vast amount of charities, isn't expected to win, unfortunately. Forecasting site AE Forecasts gives the Aussie cricketer no hope of upsetting the incumbent, with Bracken just a 1.4 per cent chance of toppling Mehan as the seat swings even further to Chris Minns' Labor. That being said, he is expected to win slightly more of the primary vote given his shift to a major party. The wily quick will need to draw on all those bowling skills of old and nab a huge swing in his direction. Share or comment on this article: Australian cricketer Nathan Bracken is unrecognisable as he stands for Liberals in NSW election e-mail Add comment Comments 15 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-06 21:26:28","image_url":"https://i.dailymail.co.uk/1s/2023/03/06/21/68398991-0-image-m-18_1678137648707.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"AB De Villiers ने Virat Kohli नहीं बल्कि इस क्रिकेटर को बताया टी20 इतिहास का सबसे महान खिलाड़ी","link":"https://sports.ndtv.com/hindi/cricket/ab-de-villiers-picks-greatest-t20-player-of-all-time-but-his-good-friend-virat-kohli-is-not-in-his-list-3840035#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"साउथ अफ्रीका के पूर्व कप्तान व मि. 360 डिग्री के नाम से मशहूर एबी डिविलियर्स ने भी टी20 इतिहास का अब तक का सबसे महान खिलाड़ी चुना है. लेकिन खास बात ये है कि उन्होंने अपने खास दोस्त और ग्लोबल स्टार विराट कोहली को नहीं बल्कि किसी और खिलाड़ी को अब तक का सबसे महान टी20 क्रिकेटर बताया है.","content":"डिविलियर्स ने कोहली नहीं बल्कि इस क्रिकेटर को बताया टी20 इतिहास का सबसे महान खिलाड़ी इंडियन प्रीमियर लीग दुनिया की सबसे पॉपुलर लीग है, जहां पर विश्व भर के स्टार प्लेयर्स अपना जलवा दिखाते हुए नज़र आते हैं. आईपीएल के 15 शानदार सीज़न भी हो चुके हैं. विश्व के बाकी देशों में भी टी20 लीग्स का काफी बोलवाला है. ऐसे में समय समय पर क्रिकेट जगत के महान प्लेयर्स अब तक के टी20 के सर्वकालिक महान खिलाड़ी चुनते हैं. जिसकी काफी चर्चाए भी होती हैं. इसी बीच साउथ अफ्रीका के पूर्व कप्तान व मि. 360 डिग्री के नाम से मशहूर एबी डिविलियर्स ने भी टी20 इतिहास का अब तक का सबसे महान खिलाड़ी चुना है. लेकिन खास बात ये है कि उन्होंने अपने खास दोस्त और ग्लोबल स्टार विराट कोहली को नहीं बल्कि किसी और खिलाड़ी को अब तक का सबसे महान टी20 क्रिकेटर बताया है. एबी डिविलियर्स ने राशिद खान को टी20 का सबसे महान खिलाड़ी बताया है. उन्होंने कहा कि वे बल्ले और गेंद दोनों से प्रभावित करता है, वे दोनों में मैच विजेता है. वे हमेशा जीतना चाहता है.वे सर्वश्रेष्ठ में से एक नहीं, बल्कि सर्वश्रेष्ठ हैं. कई क्रिकेट फैंस और विशेषज्ञों ने इतिहास के सबसे महान टी20 क्रिकेटर पर काफी बहस भी की है, जिनमें से कई विराट कोहली, क्रिस गेल, जोस बटलर, डेविड वार्नर और कीरोन पोलार्ड को पसंद करते हैं.लेकिन डिविलियर्स ने अफगानिस्तान के स्टार स्पिनर राशिद खान को टी20 का सबसे महान खिलाड़ी बताया है. वहीं कोहली की अगर बात करें तो टी20ई क्रिकेट में सबसे अधिक रन बनाने वाले खिलाड़ी हैं. टी20 इंटरनेशनल क्रिकेट में विराट के नाम 115 मैचों में 4008 रन दर्ज हैं. जिसमें उन्होंने 1 शतक व 37 अर्धशतक जड़े हैं.वहीं आईपीएल के 223 मैचों में उन्होंने 6624 रन बनाए हैं, जिसमें 5 शतक और 44 अर्धशतक शामिल हैं. अंतर्राष्ट्रीय क्रिकेट में विराट के बाद सबसे ज्यादा रन टीम इंडिया के कप्तान रोहित शर्मा के नाम दर्ज हैं. रोहित ने 148 टी20 मुकाबलों में 3853 रन बनाए हैं, जिसमें चार शतक और 29 अर्द्धशतक शामिल हैं. बता दें कि एबी डिविलियर्स व विराट कोहली आईपीएल की टीम RCB क लिए एक साथ खेलते हुए नज़र आते थे. वे एक ऐसे खिलाड़ी हैं,जिन्हें टी20 स्पेशलिस्ट माना जाता था, और उन्हें इतिहास के सबसे महान बल्लेबाजों में भी माना जाता है. इसलिए जब दक्षिण अफ्रीकी बल्लेबाज़ से उनके अब तक के सबसे महान टी20 क्रिकेटर के बारे में पूछा गया, तो उन्होंने अपने जवाब से सभी को चौंका दिया, और आरसीबी के अपने पूर्व साथी और अच्छे दोस्त विराट कोहली को भी इसमें शामिल नहीं किया. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 18:11:24","image_url":"https://c.ndtvimg.com/2023-03/kvrc35gg_kohli-de-villiers_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL 2023: हेली मैथ्यूज ने लगाया ऐसा शॉट की खुली रह गई गेंदबाज़ की आंखें, जमाया विस्फोटक अर्धशतक","link":"https://sports.ndtv.com/hindi/cricket/wpl-2023-haley-mathews-hit-such-a-shot-that-left-the-bowlers-eyes-open-scored-a-blistering-half-century-3840027#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"MI vs RCB WPL 2023: मुंबई की तरफ से मैथ्यूज (Hayley Matthews) ने 26 रन देकर तीन विकेट लिए, लेकिन जब मुंबई की तरफ से बल्लेबाज़ी करने उतरी तो मानों ये पहले से ही इरादा बनाकर आई थी की आज मैदान पर तहलका मचाना है.","content":"Hayley Matthews मुंबई इंडियंस में सोमवार को यहां रॉयल चैलेंजर्स बेंगलोर (RCB) को नौ विकेट से हराकर महिला प्रीमियर लीग (WPL 2023) टी20 टूर्नामेंट में अपनी लगातार दूसरी जीत दर्ज की, आरसीबी के अधिकतर बल्लेबाजों ने अच्छी शुरुआत की लेकिन उनमें से कोई भी बड़ी पारी नहीं खेल पाया, उनकी तरफ से विकेटकीपर बल्लेबाज रिचा घोष ने सर्वाधिक 28 रन बनाए लेकिन इसके लिए उन्होंने 26 गेंदे खेली , मुंबई की तरफ से हेली मैथ्यूज (Hayley Matthews) ने 26 रन देकर तीन विकेट लिए, लेकिन जब मुंबई की तरफ से बल्लेबाज़ी करने उतरी तो मानों ये पहले से ही इरादा बनाकर आई थी की आज मैदान पर तहलका मचाना है. मैथ्यूज (Hayley Matthews Half Century vs RCB) ने आरसीबी के खिलाफ शानदार बल्लेबाज़ी की बदौलत 124 रनों के साथ अब (WPL 2023) की टॉप रन स्कोरर बन गई हैं और ऑरेंज कैप (Hayley Matthews Orange Cap Holder) पर कब्ज़ा जमा लिया हैं. Clean striking 💥 on a roll with the bat too! Follow the match ▶️ | आरसीबी के खिलाफ बैटिंग करती हुए मैथ्यूज ने 202.63 की स्ट्राइक रेट से मात्र 38 गेंदों में 13 चौके और एक छक्के की मदद से 77 रन की धुआंधार पारी खेली और प्लेयर ऑफ द मैच बनीं और उनका बखूबी साथ दिया नट सीवर ब्रंट (Nat Sciver-Brunt) ने जिन्होंने 189.66 की स्ट्राइक रेट से 9 चौके और 1 छक्के की मदद से 29 गेंदों में 55 रनों की पारी खेली. आरसीबी की टीम पहले बल्लेबाजी करते हुए 18.4 ओवर में 155 रन पर आउट हो गई. मुंबई ने 14.2 ओवर में एक विकेट पर 159 रन बनाकर जीत दर्ज की. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 18:08:04","image_url":"https://c.ndtvimg.com/2023-03/b4boa5ng_matthews_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MI VS RCB: मुंबई इंडियंस ने रॉयल चैलेंजर्स बेंगलुरू पर दर्ज की 9 विकेट से शानदार जीत","link":"https://sports.ndtv.com/hindi/cricket/wpl-2023-mi-vs-rcb-live-mumbai-indians-women-vs-royal-challengers-bangalore-women-4th-match-live-cricket-score-commentary-3838941#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"MI Women vs RCB Women: ब्रेबॉन स्टेडियम में मुंबई इंडियंस और रॉयल चैलेंजर्स बेंगलुरू के बीच खेले गए मुकाबले में मुंबई ने बेंगलुरू को 9 विकेट से हरा दिया है.","content":"MI vs RCB ब्रेबॉन स्टेडियम में मुंबई इंडियंस और रॉयल चैलेंजर्स बेंगलुरू के बीच खेले गए मुकाबले में मुंबई ने बेंगलुरू को 9 विकेट से हरा दिया है. हरमनप्रीत कौर की अगुवाई वाली मुंबई इंडियंस ने बेंगलुरू से मिले 156 रनों के टारगेट का पीछा करते हुए मात्र 1 विकेट गंवाकर 14.2 ओवर में ही जीत दर्ज कर ली. मुंबई की तरफ से हेली मैथ्यूज़ ने 38 गेंद में 77 रनों की विस्फोटक पारी खेली. वहीं नेट सीवर ब्रंट ने 29 गेंद में 55 रन बनाए. बेंगलुरू की तरफ से प्रीति बॉस ही 1 विकेट चटका पाईं. इससे पहले टॉस जीतकर पहले बल्लेबाज़ी करने उतरी आरसीबी की टीम 20 ओवर भी नहीं खेल पाई और 18.4 ओवर में ही 155 रन पर सिमट गई. मैच में बेंगलुरू की तरफ से ऋचा घोष ने सबसे ज्यादा 28 रन बनाए. वहीं कप्तान मंधाना व श्रेयंका पाटिल ने 23-23 रनों का योगदान दिया. मुंबई की तरफ से हेली मैथ्यूज़ ने 3 विकेट चटकाए वहीं साइका इसाक व अमेलिया केर ने 2-2 विकेट लिए. बेंगलुरू की टीम को इससे पहले भी अपने पहले ही मुकाबले में दिल्ली से 60 रनों से करारी शिकस्त झेलनी पड़ी थी. वहीं ओपनिंग मुकाबले में 143 रनों से बड़ी जीत दर्ज कर कप्तान हरमन समेत धमाल मचाने वाली मुंबई ने लगातार अपना दूसरा मुकाबला भी जीत लिया है. बेंगलुरू ने इस मैच के लिए अपनी टीम में एक बदलाव करके आशा शोभना की जगह श्रेयंका पाटिल को अंतिम इलेवन में रखा था. वहीं मुंबई ने टीम में कोई बदलाव नहीं किया. यास्तिका भाटिया (विकेटकीपर), हेले मैथ्यूज, नेट साइवर-ब्रंट, हरमनप्रीत कौर (कप्तान), अमेलिया केर, पूजा वस्त्राकर, इस्सी वोंग, अमनजोत कौर, हुमायरा काजी, जिंतिमनी कलिता, सायका इशाक स्मृति मंधाना (कप्तान), सोफी डिवाइन, एलिसे पेरी, दिशा कासत, ऋचा घोष (विकेटकीपर), हीदर नाइट, कनिका आहूजा, मेगन शुट्ट, श्रेयंका पाटिल, प्रीति बोस, रेणुका ठाकुर सिंह पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 17:21:17","image_url":"https://c.ndtvimg.com/2023-03/q4hr1irg_mi-vs-rcb_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"England are BEATEN by 50 runs in the third ODI against Bangladesh in Chattogram","link":"https://www.dailymail.co.uk/sport/cricket/article-11826163/England-BEATEN-50-runs-ODI-against-Bangladesh-Chattogram.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"RICHARD GIBSON: History was made as Rehan Ahmed became England's youngest one-day international cricketer on Monday - but unlike his Test debut it did not come in a winning cause.","content":"England are BEATEN by 50 runs in the third ODI against Bangladesh in Chittagong... with Jos Buttler's experimental side coming up short against the hosts, who saw Shakib Al Hasan bag his 300th ODI wicket England have lost the third and final one-day international against Bangladesh Jos Buttler's visiting side were defeated by 50 runs in Chattogram on Monday Rehan Ahmed became the country's youngest one-day international cricketer By Richard Gibson For Mailonline Published: 08:34 EST, 6 March 2023 | Updated: 12:12 EST, 6 March 2023 e-mail 5 View comments History was made on Monday as Rehan Ahmed became England’s youngest one-day international cricketer but there was to be no repeat of his glorious Test debut in Karachi. Back in Karachi in December, the 18-year-old celebrated inheriting similar junior status as a Test player with a five-wicket haul amongst seven for the match in victory over Pakistan. Here, replacing the injured Will Jacks, he had to settle for one - from his final delivery - and a galling defeat after an experimental England side squandered the chance to seal a first 50-over series whitewash in Asia since a 3-0 success over Bangladesh in 2010. Such a turn of events came down to a combination of a stellar all-round performance by Shakib Al Hasan and their own failings. All the talk here has been of a rift in the home camp but there was little sign of disharmony as Shakib, one of the players at the heart of the brouhaha, powered the hosts to a defendable score by powering 75 of their final 131 runs, and then bagged four for 35, including Ahmed as his 300th victim in ODIs, during an England implosion. History was made as Rehan Ahmed became England's youngest one-day international cricketer on Monday - but it came in a 50-run defeat against Bangladesh in Chittagong The 18-year-old leg-spinner was congratulated by team-mates after taking his first ODI wicket England were beaten in the third and final ODI, but ended up winning the bilateral series 2-1 The clean sweep appeared on the cards when Phil Salt powered out of the blocks with seven fours during a first-wicket stand of 54 but his tame guide to cover-point - swiftly followed by the departures of the series’ two centurions Dawid Malan and Jason Roy, also to cross-batted shots at a cost of one run - turned the tide on the Bay of Bengal. There is an all-or-nothing aspect to Malan’s one-day international career. His miscue to mid-on left his tally at 5-4 in the ducks versus hundreds stakes. And when Roy had his stumps splattered by Shakib, it exposed the tourists’ tinkering. Ahmed’s inclusion meant Adil Rashid, the senior leg-spinner, bowled only half of his allocation while Sam Curran walked in to bat at five. England saw benefit in involving the teenager as heavily as possible; while if Ben Stokes does not reverse his retirement decision for this autumn's World Cup, it would be useful to have a seam-bowling option amongst the batters. Curran stabilised things, sharing 49 for the fourth wicket with top scorer James Vince but in conditions that must have felt like facing a cannon ball on quicksand, Bangladesh’s spin-heavy attack prospered, Shakib producing the delivery of the match to nick off Vince, and fellow left-armer Taijul Islam sliding one under Jos Buttler’s reverse sweep to leave only the tail and a run-a-ball asking rate for the final dozen overs. It was never going to end well from there. ‘We certainly believed we could have won the game, and if we’d played well enough we would have, but it was absolutely an opportunity to give Rehan his debut, for Sam to bat at no 5 and it is the last ODI we play now until September, so especially in these conditions, it was a chance to gather as much information as we possibly could and expose people to different situations,’ said Buttler. England’s dressing room believed Bangladesh were under par at halfway after Jofra Archer and Curran top and tailed the innings with wickets, either side of a fine spell of two for 21 by Rashid. The home side Bangladesh restricted England well with constant wickets after scoring 246 Star all-rounder Shakib Al Hasan (centre) scored 75 off 71 before taking 4-35 in his 10 overs Share or comment on this article: England are BEATEN by 50 runs in the third ODI against Bangladesh in Chattogram e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-06 17:12:59","image_url":"https://i.dailymail.co.uk/1s/2023/03/06/17/68384361-0-image-m-11_1678122752905.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"MI vs RCB: ऋचा घोष को अंपायर ने दिया नॉटआउट तो हरमनप्रीत ने लिया रिव्यू, DRS पर मचा बवाल","link":"https://sports.ndtv.com/hindi/cricket/mi-vs-rcb-richa-ghosh-was-given-not-out-by-the-umpire-harmanpreet-took-the-review-there-was-a-ruckus-on-drs-3839803#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RCB vs MI: आरसीबी (RCB) के अधिकतर बल्लेबाजों ने अच्छी शुरुआत की लेकिन उनमें से कोई भी बड़ी पारी नहीं खेल पाया.","content":"Richa Ghosh ऑफ स्पिनर हेली मैथ्यूज (Hayley Matthews) की अगुवाई में मुंबई इंडियंस के गेंदबाजों ने रॉयल चैलेंजर्स बेंगलोर (RCB) के किसी भी बल्लेबाज को बड़ी पारी नहीं खेलने दी और उसकी पूरी टीम को महिला प्रीमियर लीग (WPL) टी20 टूर्नामेंट में सोमवार को यहां 18.4 ओवर में 155 रन पर आउट कर दिया. आरसीबी के अधिकतर बल्लेबाजों ने अच्छी शुरुआत की लेकिन उनमें से कोई भी बड़ी पारी नहीं खेल पाया. उसकी तरफ से विकेटकीपर बल्लेबाज रिचा घोष (Richa Ghosh) ने सर्वाधिक 28 रन बनाए लेकिन इसके लिए उन्होंने 26 गेंदे खेली, लेकिन 8वें ओवर में ऋचा घोष के चलने के बाद (एमआई के डीआरएस चुनने से पहले) हरमनप्रीत कौर (Harmanpreet Kaur DRS Review) को अल्ट्रा एज पर विश्वास नहीं हो रहा था. ऋचा घोष (Richa Ghosh Wicket) ने पुल शॉट मरने का प्रयास किया था, लेकिन वो सफल नहीं हो पाई ऐसे में विकेटकीपर यस्तिका भाटिया ने अपील की और उसके बाद ऋचा घोष खुद से पवेलियन की ओर लौटने लगी. Unreal scenes, Reply showed Richa Ghosh got a deflection but Ultra Edge showed no bat involved, Harmanpreet Kaur can't believe what just happened अंपायर ने ऋचा को नॉटआउट करार दिया लेकिन अंपायर के फैसले के खिलाफ मुंबई की कप्तान हरमनप्रीत कौर ने रिव्यु ले लिया लेकिन रिव्यु में गेंद बल्ले से (Ultra Edge) लगती हुई नहीं दिखाई दी और मुंबई ने अपना एक रिव्यु भी गवां दिया, कप्तान हरमनप्रीत का ये रिएक्शन सोशल मीडिया पर वायरल हो गया. Harmanpreet Kaur can't believe the ultra edge after Richa Ghosh had started walking(before MI opted for DRS) in the 8th over. . . मुंबई की तरफ से मैथ्यूज ने 26 रन देकर तीन विकेट लिए. उन्हें सैका इशाक (26 रन देकर दो) और अमेलिया केर ( 30 रन देकर दो) का अच्छा साथ मिला. स्मृति मंधाना (17 गेंदों पर 23 रन, पांच चौके) ने टॉस जीतकर पहले बल्लेबाजी का फैसला करने के बाद सोफी डिवाइन (11 गेंदों पर 16 रन, दो चौके, एक छक्का) के साथ पहले विकेट के लिए 39 रन की साझेदारी करके आरसीबी को तेजतर्रार शुरुआत दिलाई, लेकिन इसके बाद उसने आठ गेंदों के अंदर चार विकेट गंवा दिए. मुंबई की पिछले मैच में गुजरात जायंट्स (MI vs GG) के खिलाफ जीत में 11 रन देकर चार विकेट लेने वाली बाएं हाथ की स्पिनर सैका इशाक ने डिवाइन को सीमा रेखा पर कैच कराने के बाद दिशा कसाट को बोल्ड किया. मैथ्यूज ने अगले ओवर में मंधाना और हीथर नाइट को लगातार गेंदों पर आउट करके आरसीबी का स्कोर चार विकेट पर 47 रन कर दिया. एलिस पेरी (सात गेंदों पर 13 रन) ने रिचा के साथ मिलकर कुछ करारे शॉट जमाए लेकिन तेजी से रन चुराने के प्रयास में ऑस्ट्रेलियाई ऑलराउंडर रन आउट हो गई. आरसीबी (RCB) ने इसके बावजूद आक्रामक रवैया जारी रखा. रिचा ने कनिका आहूजा के साथ छठे विकेट के लिए 34 रन की साझेदारी की. कनिका ने पूजा वस्त्राकर की गेंद पर विकेटकीपर को कैच देने से पहले 13 गेंदों पर 22 रन बनाए जिसमें तीन चौके और अमेलिया केर पर लगाया गया दर्शनीय छक्का शामिल है. आरसीबी (RCB vs MI WPL 2023) का दारोमदार रिचा पर था, लेकिन मैथ्यूज ने अपने दूसरे स्पेल इस आक्रामक विकेटकीपर बल्लेबाज को पवेलियन की राह दिखा दी. रिचा (Richa Ghosh) ने अपनी पारी में तीन चौके एक छक्का लगाया. श्रेयंका पाटिल ने 15 गेंदों पर चार चौकों की मदद से 23 रन बनाकर अपनी बल्लेबाजी क्षमता का परिचय दिया. उन्होंने आउट होने से पहले मेगान शट (20) के साथ 34 रन की उपयोगी साझेदारी की. केर ने रेणुका सिंह और मेगान को आउट करके आरसीबी की पारी का अंत किया. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 16:54:22","image_url":"https://c.ndtvimg.com/2023-03/drmmpu2g_richa-_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MI vs RCB WPL 2023: स्मृति मंधना की बल्लेबाज़ी से फैंस हुए निराश, ट्विटर पर आई मीम्स की बाढ़","link":"https://sports.ndtv.com/hindi/cricket/rcbw-vs-miw-wpl-2023-fans-disappointed-with-smriti-mandhanas-batting-twitter-flooded-with-memes-tata-wpl-2023-3839573#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RCBW vs MIW WPL 2023: ब्रेबोर्न स्टेडियम में मुंबई और आरसीबी के बीच खेले जा रहे WPL 2023 के चौथे मुकाबले में स्मृति मंधना (Smriti Mandhana) की कप्तानी में खेल रही बेंगलुरु (RCB) की टीम ने पहले टॉस जीत कर बल्लेबाज़ी का फैसला किया.","content":"Smriti Mandhana WPL में अपने उद्घाटन मुकाबले में रॉयल चैलेंजर्स (Royal Challengers Bangalore) की कप्तान स्मृति मंधना (Smriti Mandhana) ने 23 गेंदों में 35 रन की शानदार पारी खेली थी अपनी पारी के दौरान स्मृति ने 152.17 के स्ट्राइक रेट से 5 चौके और 1 छक्का लगाया था, लेकिन उनकी कप्तानी में बेंगलुरु ने अपना पहले मुकाबला गवां दिया. ब्रेबोर्न स्टेडियम में मुंबई और आरसीबी के बीच खेले जा रहे WPL के चौथे मुकाबले में स्मृति मंधना (Smriti Mandhana) की कप्तानी में खेल रही बेंगलुरु की टीम ने पहले टॉस जीत कर बल्लेबाज़ी का फैसला किया. Smriti Mandhana dismissed for 23 off 17 balls ° Smriti Mandhana in this WPL - 35(23) & 23(17). She played well in both matches. ©KBcric शुरुआत में स्मृति मंधना (Smriti Mandhana) और सोफी डिवाइन (Sophie Devine) की जोड़ी शानदार लय में दिख रही थी, लेकिन 39 के स्कोर पे आरसीबी (RCB) को पहला झटका लगने के बाद मानो टीम को नज़र लग गई और महज 4 रन जोड़ने के दौरान टीम को तीन झटके और लग गए और स्कोर 43 -4 विकेट हो गया. 1⃣ brings 2⃣, they say! 💬 Saika Ishaque agrees & how! 👏 👏 Watch how she dismissed Sophie Devine & Disha Kasat 🔽 Follow the match ▶️ | | स्मृति ने मुंबई (Smriti Mandhana vs MI) के खिलाफ 135.29 के स्ट्राइक रेट से 17 गेंदों में 23 रन की पारी खेली और इस दौरान उन्होंने 5 चौके लगाए, लेकिन सोशल मीडिया (Social Media Reaction on Smriti Mandhana) पर स्मृति को लेकर कुछ ट्वीट किये गए हैं जिसमे उनको ओवररेटेड कहा गया, तो कुछ फैंस ने उनके बल्लेबाज़ी की तारीफ भी की है. Smriti Mandhana is kinda overrated, accept it or not 🤝 स्मृति मंधना के पास जो बल्लेबाज़ी की काबिलियत है उसके अनुसार अब तक दोनों ही मुकाबले में उनके बल्ले से वैसा प्रदर्शन नहीं देखने को मिला जिसका इंतज़ार स्मृति के फैंस को रहता हैं. हालांकि जिस अंदाज में उनका विकेट गिरा वो शॉट लगाने में हेली मैथ्यूज की गेंद पर वोंग के हाथों लपकी गई. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 15:55:39","image_url":"https://c.ndtvimg.com/2023-03/lqsnlg4o_smriti-mandhana-bcci_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Maris Stella meet St. Sylvester’s in the Under 19 Tier ‘B’ quarter-final","link":"http://island.lk/maris-stella-meet-st-sylvesters-in-the-under-19-tier-b-quarter-final/","keywords":["Sports","Maris Stella","St. Sylvesters","Under 19 Tier ‘B’ quarter-final"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group […]","content":"Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group (Z). St. Sylvester’s are led by Malith Kulatunge. Maris Stella (from): Kaveen Fernando (Captain), Shen Adithya (Vice Captain), Navindu Wijesooriya, Sachiru Hansala, Ayesh Perera, Sandew Rathnayaka, Rahumath Deen, Ramith Bandara, Levin Fernando, Randeera de Silva, Nethum Basnayaka, Akalanka Fernando, Mineth Fernando, Hasindu Perera, Anshen De Silva, Ameesha Fernando, Manjua Nayanajith, Shevin Hewavitharana, Binal Fernando, Rayan Punchihewa, Hansala Kulasooriya, Adithya Fernando, Pawan Edirisinghe, Hasthika De Silva, Rasul Fernando, Dilash Fernando, Senura Liyanage. St. Sylvester’s (from): Malith Kulatunge (Captain), Akila Wickramasinghe, Isuru Gunasekara, Khanka Wickramasinghe, Charuka Ayeshan, Sahan Dissanayake, Kavishka Imesh, Chandupa Waduge, Yoshitha Isuranga, Wageesha Hansala, Chamod Dissanayake, Dion Fernando, Pansilu Bandara, Nimesha Silva, Kashyapa Dissanayake, Piyumaka Karunarathna, Chandimal Wijewardana, Arusha Mendis, Sihina Bandara, Sandaruwan Herath, Published on By Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as well. Suranga Ranaweera of Dehiwala Mount Lavinia Sports Club was placed third. Air Force won the women’s team championship In the women’s event, which was an 84-kilo metres race, Dinesha Dilrukshi (2:34.46 secs) of Sri Lanka Air Force was the winner. Sudharika Priyadharshani was placed second, while Navy’s Anne Shenali settled for the third position in this one-day event. The three-stage men’s event commenced with a participation of 160 cyclists on March 2 at close proximity to the Air Force headquarters in Colombo. Sri Lanka Air Force conducted the event for the 24th time. Men’s event was conducted in three stages Some 160 participants competed Men’s event was conducted in three stages. in the men’s event Dinesha Dilrukshi of the Air Force was the winner of the women’s race. Published on By With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa. Published on By BBC reported that a man has died after a fight between football fans outside a pub. Tony Johnson, 55, was found with a serious head injury near The Manchester bar on the Promenade in Blackpool at 19:00 GMT on Saturday. Blackpool Football Club said they were “deeply shocked and saddened” by the grandfather’s death. Johnson’s partner said his family were “heartbroken” and “devastated”. Supporters had clashed after the match between Blackpool and Burnley.","pubDate":"2023-03-07 00:00:55","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Chandana, Avishka guide Army to clinch cycling title","link":"http://island.lk/chandana-avishka-guide-army-to-clinch-cycling-title/","keywords":["Sports","Air Force cycle race","Air Force cycle race 2023"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as […]","content":"Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as well. Suranga Ranaweera of Dehiwala Mount Lavinia Sports Club was placed third. Air Force won the women’s team championship In the women’s event, which was an 84-kilo metres race, Dinesha Dilrukshi (2:34.46 secs) of Sri Lanka Air Force was the winner. Sudharika Priyadharshani was placed second, while Navy’s Anne Shenali settled for the third position in this one-day event. The three-stage men’s event commenced with a participation of 160 cyclists on March 2 at close proximity to the Air Force headquarters in Colombo. Sri Lanka Air Force conducted the event for the 24th time. Men’s event was conducted in three stages Some 160 participants competed Men’s event was conducted in three stages. in the men’s event Dinesha Dilrukshi of the Air Force was the winner of the women’s race. Published on By Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group (Z). St. Sylvester’s are led by Malith Kulatunge. Maris Stella (from): Kaveen Fernando (Captain), Shen Adithya (Vice Captain), Navindu Wijesooriya, Sachiru Hansala, Ayesh Perera, Sandew Rathnayaka, Rahumath Deen, Ramith Bandara, Levin Fernando, Randeera de Silva, Nethum Basnayaka, Akalanka Fernando, Mineth Fernando, Hasindu Perera, Anshen De Silva, Ameesha Fernando, Manjua Nayanajith, Shevin Hewavitharana, Binal Fernando, Rayan Punchihewa, Hansala Kulasooriya, Adithya Fernando, Pawan Edirisinghe, Hasthika De Silva, Rasul Fernando, Dilash Fernando, Senura Liyanage. St. Sylvester’s (from): Malith Kulatunge (Captain), Akila Wickramasinghe, Isuru Gunasekara, Khanka Wickramasinghe, Charuka Ayeshan, Sahan Dissanayake, Kavishka Imesh, Chandupa Waduge, Yoshitha Isuranga, Wageesha Hansala, Chamod Dissanayake, Dion Fernando, Pansilu Bandara, Nimesha Silva, Kashyapa Dissanayake, Piyumaka Karunarathna, Chandimal Wijewardana, Arusha Mendis, Sihina Bandara, Sandaruwan Herath, Published on By With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa. Published on By BBC reported that a man has died after a fight between football fans outside a pub. Tony Johnson, 55, was found with a serious head injury near The Manchester bar on the Promenade in Blackpool at 19:00 GMT on Saturday. Blackpool Football Club said they were “deeply shocked and saddened” by the grandfather’s death. Johnson’s partner said his family were “heartbroken” and “devastated”. Supporters had clashed after the match between Blackpool and Burnley.","pubDate":"2023-03-07 00:00:00","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Nirmal, Abhishek help Richmond take upper hand","link":"http://island.lk/nirmal-abhishek-help-richmond-take-upper-hand/","keywords":["Sports","Featured","Sharon Abhishek","Tharinda Nirmal","Under 19 Division I Tier"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Under 19 Division I Tier ‘A’ Cricket Quarter-Final by Reemus Fernando With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points […]","content":"With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa. Published on By BBC reported that a man has died after a fight between football fans outside a pub. Tony Johnson, 55, was found with a serious head injury near The Manchester bar on the Promenade in Blackpool at 19:00 GMT on Saturday. Blackpool Football Club said they were “deeply shocked and saddened” by the grandfather’s death. Johnson’s partner said his family were “heartbroken” and “devastated”. Supporters had clashed after the match between Blackpool and Burnley. Published on By Hayley Matthews starred with the bat and ball as Mumbai Indians hammered Royal Challengers Bangalore by nine wickets at the Brabourne Stadium. It was MI’s second consecutive win while RCB are yet to get off the mark after two games. Brief Scores: RCB 155 in 18.4 overs (Richa Ghosh 28;Haley Matthews 3-28) MI 159/1 in 14.2 overs (Hayley Matthews 77*, Nat Sciver-Brunt 55*) by 9 wickets Published on By Shakib Al Hasan’s all-round efforts prevented England from clean-sweeping the ODI series as Bangladesh won the final ODI by 50 runs. Following patient half-centuries from Mushfiqur Rahim and Najmul Hossain, Shakib struck a 71-ball 75 to help Bangladesh to 246 despite wickets falling from the other end. The left-handed all-rounder then made key incisions with the ball, picking his 300th ODI wicket en route to figures of 4 for 35 as England folded for 196. Brief scores: 246 in 48.5 overs (Shakib Al Hasan 75, Mushfiqur Rahim 70; Jofra Archer 3-35, Adil Rashid 2-21) 196 in 43.1 overs (James Vince 38, Chris Woakes 34; Shakib Al Hasan 4-35, Ebadot Hossain 2-38)","pubDate":"2023-03-06 23:55:57","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Australian cricketer Nathan Bracken is unrecognisable as he stands for Liberals in NSW election","link":"https://www.dailymail.co.uk/sport/cricket/article-11824759/Australian-cricketer-Nathan-Bracken-unrecognisable-stands-Liberals-NSW-election.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"An Aussie limited overs genius who took 186 wickets for Australia from 121 international matches looks nothing like the cult hero he was as he makes a surprise foray into state politics.","content":"Aussie cult cricket star is unrecognisable from his playing days as he makes a shock career switch ODI cricketing legend has made career switch Star quick is standing in NSW State election He is unrecognisable without iconic locks By Kristy Williams For Daily Mail Australia Published: 05:33, 6 March 2023 | Updated: 21:26, 6 March 2023 e-mail 15 View comments Aussie limited-overs cricket star Nathan Bracken took 186 wickets for Australia from 121 international matches - but surprisingly, politics is where the cult hero now plies his trade. The left-arm quick was one of the first bowlers to really master the art of slower cutter balls, and was the second-fastest bowler to reach 100 ODI wickets - behind only two legendary players: Shane Warne and Dennis Lillee. During his international playing days from 2001-2009, Bracken was known for flowing blond locks that were often held in place by a headband. But he doesn't look like that anymore. The 45-year-old, who was raised in the Blue Mountains west of Sydney, now resides on the state's Central Coast, and is running as the Liberal candidate for The Entrance electorate in the upcoming State election. Nathan Bracken took an incredible 174 wickets in a brilliant 116-match ODI career for Australia that was cut short by injury The towering quick, pictured with wife Haley, is unrecognisable from his days when he was one of the Australia side's most popular players Bracken sends one down during the 2006 ICC Champions Trophy - which Australia won - sporting his iconic blonde locks Gone are the iconic locks. The towering 195cm ex-cricketer now sports a short, cropped style with a middle part, which is often accompanied by a scruffy, pepper-coloured beard. Since he had to retire in 2011 due to a debilitating knee injury - which he sued Cricket Australia for $1million over - Bracken has taken to a variety of jobs. After doing a Bachelor of Communications, Bracken has dipped his toe in commentary, done a significant amount of cricket coaching, filled a variety of business manager roles and is currently an account manager at Boral Concrete, according to his LinkedIn page. And now embattled Liberals leader Dominic Perrottet has turned to the ex-cricketer to try and overcome a 5.2 per cent swing against Labor incumbent David Mehan, who has held the seat since 2015. Bracken, who has been a member of the Liberal Party for two years, previously ran as an Independent (who preferenced the Liberals) for the Federal seat in 2013, though he will be hoping to go much better this time around after only securing 8.2 per cent of the primary vote. Nathan Bracken lives with long-time wife Haley and sons Chase and Tag on the NSW Central Coast after growing up in the Blue Mountains, west of Sydney Bracken celebrates a wicket in one of his five Tests for Australia. The left-armer was considered a limited-overs specialist given the stacked talent of quicks during his generation The lanky quick said he wanted to give the burgeoning Central Coast population 'a voice' in State parliament ahead of the election - which the Labor party is heavily favoured to win - on March 25. 'I've been on the Central Coast now for pretty much close to 20 years … I made a decision a while a go to not be someone who sits around and whinges about it …(I want to focus on) what it can be, the infrastructure, the opportunities all the residents want it to have,' he told the Daily Telegraph . 'What Dominic (Perrottet) has been through and where he is taking us … going forward, (it's) a great opportunity to leapfrog out of Covid and put us on the front foot for the future.' Though he appears to have a short memory when it comes to political allegiances. When standing as an independent in the 2013 Federal election, Bracken insisted he had no interest in joining a major party, and 'floats around' the political spectrum. 'Once you have alignment with a party you can't make a judgement call on every issue,' he told News Corp in 2012. 'When I was playing cricket I knew where it was going, what my plan was, and if things changed I could go with it. With a party sometimes you can't change direction.' Nathan Bracken, sporting his iconic blonde locks, sends one down in Australia's successful 2007 ODI World Cup campaign But ten years down the track he insists that he has always been on the Liberals side. 'My views have always been down the Liberal side of things, even when I ran as an independent, I preferenced the Liberals,' Bracken said. The popular community man, who has been an ambassador for a vast amount of charities, isn't expected to win, unfortunately. Forecasting site AE Forecasts gives the Aussie cricketer no hope of upsetting the incumbent, with Bracken just a 1.4 per cent chance of toppling Mehan as the seat swings even further to Chris Minns' Labor. That being said, he is expected to win slightly more of the primary vote given his shift to a major party. The wily quick will need to draw on all those bowling skills of old and nab a huge swing in his direction. Share or comment on this article: Australian cricketer Nathan Bracken is unrecognisable as he stands for Liberals in NSW election e-mail Add comment Comments 15 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-06 21:26:28","image_url":"https://i.dailymail.co.uk/1s/2023/03/06/21/68398991-0-image-m-18_1678137648707.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"AB De Villiers ने Virat Kohli नहीं बल्कि इस क्रिकेटर को बताया टी20 इतिहास का सबसे महान खिलाड़ी","link":"https://sports.ndtv.com/hindi/cricket/ab-de-villiers-picks-greatest-t20-player-of-all-time-but-his-good-friend-virat-kohli-is-not-in-his-list-3840035#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"साउथ अफ्रीका के पूर्व कप्तान व मि. 360 डिग्री के नाम से मशहूर एबी डिविलियर्स ने भी टी20 इतिहास का अब तक का सबसे महान खिलाड़ी चुना है. लेकिन खास बात ये है कि उन्होंने अपने खास दोस्त और ग्लोबल स्टार विराट कोहली को नहीं बल्कि किसी और खिलाड़ी को अब तक का सबसे महान टी20 क्रिकेटर बताया है.","content":"डिविलियर्स ने कोहली नहीं बल्कि इस क्रिकेटर को बताया टी20 इतिहास का सबसे महान खिलाड़ी इंडियन प्रीमियर लीग दुनिया की सबसे पॉपुलर लीग है, जहां पर विश्व भर के स्टार प्लेयर्स अपना जलवा दिखाते हुए नज़र आते हैं. आईपीएल के 15 शानदार सीज़न भी हो चुके हैं. विश्व के बाकी देशों में भी टी20 लीग्स का काफी बोलवाला है. ऐसे में समय समय पर क्रिकेट जगत के महान प्लेयर्स अब तक के टी20 के सर्वकालिक महान खिलाड़ी चुनते हैं. जिसकी काफी चर्चाए भी होती हैं. इसी बीच साउथ अफ्रीका के पूर्व कप्तान व मि. 360 डिग्री के नाम से मशहूर एबी डिविलियर्स ने भी टी20 इतिहास का अब तक का सबसे महान खिलाड़ी चुना है. लेकिन खास बात ये है कि उन्होंने अपने खास दोस्त और ग्लोबल स्टार विराट कोहली को नहीं बल्कि किसी और खिलाड़ी को अब तक का सबसे महान टी20 क्रिकेटर बताया है. एबी डिविलियर्स ने राशिद खान को टी20 का सबसे महान खिलाड़ी बताया है. उन्होंने कहा कि वे बल्ले और गेंद दोनों से प्रभावित करता है, वे दोनों में मैच विजेता है. वे हमेशा जीतना चाहता है.वे सर्वश्रेष्ठ में से एक नहीं, बल्कि सर्वश्रेष्ठ हैं. कई क्रिकेट फैंस और विशेषज्ञों ने इतिहास के सबसे महान टी20 क्रिकेटर पर काफी बहस भी की है, जिनमें से कई विराट कोहली, क्रिस गेल, जोस बटलर, डेविड वार्नर और कीरोन पोलार्ड को पसंद करते हैं.लेकिन डिविलियर्स ने अफगानिस्तान के स्टार स्पिनर राशिद खान को टी20 का सबसे महान खिलाड़ी बताया है. वहीं कोहली की अगर बात करें तो टी20ई क्रिकेट में सबसे अधिक रन बनाने वाले खिलाड़ी हैं. टी20 इंटरनेशनल क्रिकेट में विराट के नाम 115 मैचों में 4008 रन दर्ज हैं. जिसमें उन्होंने 1 शतक व 37 अर्धशतक जड़े हैं.वहीं आईपीएल के 223 मैचों में उन्होंने 6624 रन बनाए हैं, जिसमें 5 शतक और 44 अर्धशतक शामिल हैं. अंतर्राष्ट्रीय क्रिकेट में विराट के बाद सबसे ज्यादा रन टीम इंडिया के कप्तान रोहित शर्मा के नाम दर्ज हैं. रोहित ने 148 टी20 मुकाबलों में 3853 रन बनाए हैं, जिसमें चार शतक और 29 अर्द्धशतक शामिल हैं. बता दें कि एबी डिविलियर्स व विराट कोहली आईपीएल की टीम RCB क लिए एक साथ खेलते हुए नज़र आते थे. वे एक ऐसे खिलाड़ी हैं,जिन्हें टी20 स्पेशलिस्ट माना जाता था, और उन्हें इतिहास के सबसे महान बल्लेबाजों में भी माना जाता है. इसलिए जब दक्षिण अफ्रीकी बल्लेबाज़ से उनके अब तक के सबसे महान टी20 क्रिकेटर के बारे में पूछा गया, तो उन्होंने अपने जवाब से सभी को चौंका दिया, और आरसीबी के अपने पूर्व साथी और अच्छे दोस्त विराट कोहली को भी इसमें शामिल नहीं किया. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 18:11:24","image_url":"https://c.ndtvimg.com/2023-03/kvrc35gg_kohli-de-villiers_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL 2023: हेली मैथ्यूज ने लगाया ऐसा शॉट की खुली रह गई गेंदबाज़ की आंखें, जमाया विस्फोटक अर्धशतक","link":"https://sports.ndtv.com/hindi/cricket/wpl-2023-haley-mathews-hit-such-a-shot-that-left-the-bowlers-eyes-open-scored-a-blistering-half-century-3840027#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"MI vs RCB WPL 2023: मुंबई की तरफ से मैथ्यूज (Hayley Matthews) ने 26 रन देकर तीन विकेट लिए, लेकिन जब मुंबई की तरफ से बल्लेबाज़ी करने उतरी तो मानों ये पहले से ही इरादा बनाकर आई थी की आज मैदान पर तहलका मचाना है.","content":"Hayley Matthews मुंबई इंडियंस में सोमवार को यहां रॉयल चैलेंजर्स बेंगलोर (RCB) को नौ विकेट से हराकर महिला प्रीमियर लीग (WPL 2023) टी20 टूर्नामेंट में अपनी लगातार दूसरी जीत दर्ज की, आरसीबी के अधिकतर बल्लेबाजों ने अच्छी शुरुआत की लेकिन उनमें से कोई भी बड़ी पारी नहीं खेल पाया, उनकी तरफ से विकेटकीपर बल्लेबाज रिचा घोष ने सर्वाधिक 28 रन बनाए लेकिन इसके लिए उन्होंने 26 गेंदे खेली , मुंबई की तरफ से हेली मैथ्यूज (Hayley Matthews) ने 26 रन देकर तीन विकेट लिए, लेकिन जब मुंबई की तरफ से बल्लेबाज़ी करने उतरी तो मानों ये पहले से ही इरादा बनाकर आई थी की आज मैदान पर तहलका मचाना है. मैथ्यूज (Hayley Matthews Half Century vs RCB) ने आरसीबी के खिलाफ शानदार बल्लेबाज़ी की बदौलत 124 रनों के साथ अब (WPL 2023) की टॉप रन स्कोरर बन गई हैं और ऑरेंज कैप (Hayley Matthews Orange Cap Holder) पर कब्ज़ा जमा लिया हैं. Clean striking 💥 on a roll with the bat too! Follow the match ▶️ | आरसीबी के खिलाफ बैटिंग करती हुए मैथ्यूज ने 202.63 की स्ट्राइक रेट से मात्र 38 गेंदों में 13 चौके और एक छक्के की मदद से 77 रन की धुआंधार पारी खेली और प्लेयर ऑफ द मैच बनीं और उनका बखूबी साथ दिया नट सीवर ब्रंट (Nat Sciver-Brunt) ने जिन्होंने 189.66 की स्ट्राइक रेट से 9 चौके और 1 छक्के की मदद से 29 गेंदों में 55 रनों की पारी खेली. आरसीबी की टीम पहले बल्लेबाजी करते हुए 18.4 ओवर में 155 रन पर आउट हो गई. मुंबई ने 14.2 ओवर में एक विकेट पर 159 रन बनाकर जीत दर्ज की. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 18:08:04","image_url":"https://c.ndtvimg.com/2023-03/b4boa5ng_matthews_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MI VS RCB: मुंबई इंडियंस ने रॉयल चैलेंजर्स बेंगलुरू पर दर्ज की 9 विकेट से शानदार जीत","link":"https://sports.ndtv.com/hindi/cricket/wpl-2023-mi-vs-rcb-live-mumbai-indians-women-vs-royal-challengers-bangalore-women-4th-match-live-cricket-score-commentary-3838941#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"MI Women vs RCB Women: ब्रेबॉन स्टेडियम में मुंबई इंडियंस और रॉयल चैलेंजर्स बेंगलुरू के बीच खेले गए मुकाबले में मुंबई ने बेंगलुरू को 9 विकेट से हरा दिया है.","content":"MI vs RCB ब्रेबॉन स्टेडियम में मुंबई इंडियंस और रॉयल चैलेंजर्स बेंगलुरू के बीच खेले गए मुकाबले में मुंबई ने बेंगलुरू को 9 विकेट से हरा दिया है. हरमनप्रीत कौर की अगुवाई वाली मुंबई इंडियंस ने बेंगलुरू से मिले 156 रनों के टारगेट का पीछा करते हुए मात्र 1 विकेट गंवाकर 14.2 ओवर में ही जीत दर्ज कर ली. मुंबई की तरफ से हेली मैथ्यूज़ ने 38 गेंद में 77 रनों की विस्फोटक पारी खेली. वहीं नेट सीवर ब्रंट ने 29 गेंद में 55 रन बनाए. बेंगलुरू की तरफ से प्रीति बॉस ही 1 विकेट चटका पाईं. इससे पहले टॉस जीतकर पहले बल्लेबाज़ी करने उतरी आरसीबी की टीम 20 ओवर भी नहीं खेल पाई और 18.4 ओवर में ही 155 रन पर सिमट गई. मैच में बेंगलुरू की तरफ से ऋचा घोष ने सबसे ज्यादा 28 रन बनाए. वहीं कप्तान मंधाना व श्रेयंका पाटिल ने 23-23 रनों का योगदान दिया. मुंबई की तरफ से हेली मैथ्यूज़ ने 3 विकेट चटकाए वहीं साइका इसाक व अमेलिया केर ने 2-2 विकेट लिए. बेंगलुरू की टीम को इससे पहले भी अपने पहले ही मुकाबले में दिल्ली से 60 रनों से करारी शिकस्त झेलनी पड़ी थी. वहीं ओपनिंग मुकाबले में 143 रनों से बड़ी जीत दर्ज कर कप्तान हरमन समेत धमाल मचाने वाली मुंबई ने लगातार अपना दूसरा मुकाबला भी जीत लिया है. बेंगलुरू ने इस मैच के लिए अपनी टीम में एक बदलाव करके आशा शोभना की जगह श्रेयंका पाटिल को अंतिम इलेवन में रखा था. वहीं मुंबई ने टीम में कोई बदलाव नहीं किया. यास्तिका भाटिया (विकेटकीपर), हेले मैथ्यूज, नेट साइवर-ब्रंट, हरमनप्रीत कौर (कप्तान), अमेलिया केर, पूजा वस्त्राकर, इस्सी वोंग, अमनजोत कौर, हुमायरा काजी, जिंतिमनी कलिता, सायका इशाक स्मृति मंधाना (कप्तान), सोफी डिवाइन, एलिसे पेरी, दिशा कासत, ऋचा घोष (विकेटकीपर), हीदर नाइट, कनिका आहूजा, मेगन शुट्ट, श्रेयंका पाटिल, प्रीति बोस, रेणुका ठाकुर सिंह पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 17:21:17","image_url":"https://c.ndtvimg.com/2023-03/q4hr1irg_mi-vs-rcb_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"England are BEATEN by 50 runs in the third ODI against Bangladesh in Chattogram","link":"https://www.dailymail.co.uk/sport/cricket/article-11826163/England-BEATEN-50-runs-ODI-against-Bangladesh-Chattogram.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"RICHARD GIBSON: History was made as Rehan Ahmed became England's youngest one-day international cricketer on Monday - but unlike his Test debut it did not come in a winning cause.","content":"England are BEATEN by 50 runs in the third ODI against Bangladesh in Chittagong... with Jos Buttler's experimental side coming up short against the hosts, who saw Shakib Al Hasan bag his 300th ODI wicket England have lost the third and final one-day international against Bangladesh Jos Buttler's visiting side were defeated by 50 runs in Chattogram on Monday Rehan Ahmed became the country's youngest one-day international cricketer By Richard Gibson For Mailonline Published: 08:34 EST, 6 March 2023 | Updated: 12:12 EST, 6 March 2023 e-mail 5 View comments History was made on Monday as Rehan Ahmed became England’s youngest one-day international cricketer but there was to be no repeat of his glorious Test debut in Karachi. Back in Karachi in December, the 18-year-old celebrated inheriting similar junior status as a Test player with a five-wicket haul amongst seven for the match in victory over Pakistan. Here, replacing the injured Will Jacks, he had to settle for one - from his final delivery - and a galling defeat after an experimental England side squandered the chance to seal a first 50-over series whitewash in Asia since a 3-0 success over Bangladesh in 2010. Such a turn of events came down to a combination of a stellar all-round performance by Shakib Al Hasan and their own failings. All the talk here has been of a rift in the home camp but there was little sign of disharmony as Shakib, one of the players at the heart of the brouhaha, powered the hosts to a defendable score by powering 75 of their final 131 runs, and then bagged four for 35, including Ahmed as his 300th victim in ODIs, during an England implosion. History was made as Rehan Ahmed became England's youngest one-day international cricketer on Monday - but it came in a 50-run defeat against Bangladesh in Chittagong The 18-year-old leg-spinner was congratulated by team-mates after taking his first ODI wicket England were beaten in the third and final ODI, but ended up winning the bilateral series 2-1 The clean sweep appeared on the cards when Phil Salt powered out of the blocks with seven fours during a first-wicket stand of 54 but his tame guide to cover-point - swiftly followed by the departures of the series’ two centurions Dawid Malan and Jason Roy, also to cross-batted shots at a cost of one run - turned the tide on the Bay of Bengal. There is an all-or-nothing aspect to Malan’s one-day international career. His miscue to mid-on left his tally at 5-4 in the ducks versus hundreds stakes. And when Roy had his stumps splattered by Shakib, it exposed the tourists’ tinkering. Ahmed’s inclusion meant Adil Rashid, the senior leg-spinner, bowled only half of his allocation while Sam Curran walked in to bat at five. England saw benefit in involving the teenager as heavily as possible; while if Ben Stokes does not reverse his retirement decision for this autumn's World Cup, it would be useful to have a seam-bowling option amongst the batters. Curran stabilised things, sharing 49 for the fourth wicket with top scorer James Vince but in conditions that must have felt like facing a cannon ball on quicksand, Bangladesh’s spin-heavy attack prospered, Shakib producing the delivery of the match to nick off Vince, and fellow left-armer Taijul Islam sliding one under Jos Buttler’s reverse sweep to leave only the tail and a run-a-ball asking rate for the final dozen overs. It was never going to end well from there. ‘We certainly believed we could have won the game, and if we’d played well enough we would have, but it was absolutely an opportunity to give Rehan his debut, for Sam to bat at no 5 and it is the last ODI we play now until September, so especially in these conditions, it was a chance to gather as much information as we possibly could and expose people to different situations,’ said Buttler. England’s dressing room believed Bangladesh were under par at halfway after Jofra Archer and Curran top and tailed the innings with wickets, either side of a fine spell of two for 21 by Rashid. The home side Bangladesh restricted England well with constant wickets after scoring 246 Star all-rounder Shakib Al Hasan (centre) scored 75 off 71 before taking 4-35 in his 10 overs Share or comment on this article: England are BEATEN by 50 runs in the third ODI against Bangladesh in Chattogram e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-06 17:12:59","image_url":"https://i.dailymail.co.uk/1s/2023/03/06/17/68384361-0-image-m-11_1678122752905.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"MI vs RCB: ऋचा घोष को अंपायर ने दिया नॉटआउट तो हरमनप्रीत ने लिया रिव्यू, DRS पर मचा बवाल","link":"https://sports.ndtv.com/hindi/cricket/mi-vs-rcb-richa-ghosh-was-given-not-out-by-the-umpire-harmanpreet-took-the-review-there-was-a-ruckus-on-drs-3839803#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RCB vs MI: आरसीबी (RCB) के अधिकतर बल्लेबाजों ने अच्छी शुरुआत की लेकिन उनमें से कोई भी बड़ी पारी नहीं खेल पाया.","content":"Richa Ghosh ऑफ स्पिनर हेली मैथ्यूज (Hayley Matthews) की अगुवाई में मुंबई इंडियंस के गेंदबाजों ने रॉयल चैलेंजर्स बेंगलोर (RCB) के किसी भी बल्लेबाज को बड़ी पारी नहीं खेलने दी और उसकी पूरी टीम को महिला प्रीमियर लीग (WPL) टी20 टूर्नामेंट में सोमवार को यहां 18.4 ओवर में 155 रन पर आउट कर दिया. आरसीबी के अधिकतर बल्लेबाजों ने अच्छी शुरुआत की लेकिन उनमें से कोई भी बड़ी पारी नहीं खेल पाया. उसकी तरफ से विकेटकीपर बल्लेबाज रिचा घोष (Richa Ghosh) ने सर्वाधिक 28 रन बनाए लेकिन इसके लिए उन्होंने 26 गेंदे खेली, लेकिन 8वें ओवर में ऋचा घोष के चलने के बाद (एमआई के डीआरएस चुनने से पहले) हरमनप्रीत कौर (Harmanpreet Kaur DRS Review) को अल्ट्रा एज पर विश्वास नहीं हो रहा था. ऋचा घोष (Richa Ghosh Wicket) ने पुल शॉट मरने का प्रयास किया था, लेकिन वो सफल नहीं हो पाई ऐसे में विकेटकीपर यस्तिका भाटिया ने अपील की और उसके बाद ऋचा घोष खुद से पवेलियन की ओर लौटने लगी. Unreal scenes, Reply showed Richa Ghosh got a deflection but Ultra Edge showed no bat involved, Harmanpreet Kaur can't believe what just happened अंपायर ने ऋचा को नॉटआउट करार दिया लेकिन अंपायर के फैसले के खिलाफ मुंबई की कप्तान हरमनप्रीत कौर ने रिव्यु ले लिया लेकिन रिव्यु में गेंद बल्ले से (Ultra Edge) लगती हुई नहीं दिखाई दी और मुंबई ने अपना एक रिव्यु भी गवां दिया, कप्तान हरमनप्रीत का ये रिएक्शन सोशल मीडिया पर वायरल हो गया. Harmanpreet Kaur can't believe the ultra edge after Richa Ghosh had started walking(before MI opted for DRS) in the 8th over. . . मुंबई की तरफ से मैथ्यूज ने 26 रन देकर तीन विकेट लिए. उन्हें सैका इशाक (26 रन देकर दो) और अमेलिया केर ( 30 रन देकर दो) का अच्छा साथ मिला. स्मृति मंधाना (17 गेंदों पर 23 रन, पांच चौके) ने टॉस जीतकर पहले बल्लेबाजी का फैसला करने के बाद सोफी डिवाइन (11 गेंदों पर 16 रन, दो चौके, एक छक्का) के साथ पहले विकेट के लिए 39 रन की साझेदारी करके आरसीबी को तेजतर्रार शुरुआत दिलाई, लेकिन इसके बाद उसने आठ गेंदों के अंदर चार विकेट गंवा दिए. मुंबई की पिछले मैच में गुजरात जायंट्स (MI vs GG) के खिलाफ जीत में 11 रन देकर चार विकेट लेने वाली बाएं हाथ की स्पिनर सैका इशाक ने डिवाइन को सीमा रेखा पर कैच कराने के बाद दिशा कसाट को बोल्ड किया. मैथ्यूज ने अगले ओवर में मंधाना और हीथर नाइट को लगातार गेंदों पर आउट करके आरसीबी का स्कोर चार विकेट पर 47 रन कर दिया. एलिस पेरी (सात गेंदों पर 13 रन) ने रिचा के साथ मिलकर कुछ करारे शॉट जमाए लेकिन तेजी से रन चुराने के प्रयास में ऑस्ट्रेलियाई ऑलराउंडर रन आउट हो गई. आरसीबी (RCB) ने इसके बावजूद आक्रामक रवैया जारी रखा. रिचा ने कनिका आहूजा के साथ छठे विकेट के लिए 34 रन की साझेदारी की. कनिका ने पूजा वस्त्राकर की गेंद पर विकेटकीपर को कैच देने से पहले 13 गेंदों पर 22 रन बनाए जिसमें तीन चौके और अमेलिया केर पर लगाया गया दर्शनीय छक्का शामिल है. आरसीबी (RCB vs MI WPL 2023) का दारोमदार रिचा पर था, लेकिन मैथ्यूज ने अपने दूसरे स्पेल इस आक्रामक विकेटकीपर बल्लेबाज को पवेलियन की राह दिखा दी. रिचा (Richa Ghosh) ने अपनी पारी में तीन चौके एक छक्का लगाया. श्रेयंका पाटिल ने 15 गेंदों पर चार चौकों की मदद से 23 रन बनाकर अपनी बल्लेबाजी क्षमता का परिचय दिया. उन्होंने आउट होने से पहले मेगान शट (20) के साथ 34 रन की उपयोगी साझेदारी की. केर ने रेणुका सिंह और मेगान को आउट करके आरसीबी की पारी का अंत किया. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 16:54:22","image_url":"https://c.ndtvimg.com/2023-03/drmmpu2g_richa-_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MI vs RCB WPL 2023: स्मृति मंधना की बल्लेबाज़ी से फैंस हुए निराश, ट्विटर पर आई मीम्स की बाढ़","link":"https://sports.ndtv.com/hindi/cricket/rcbw-vs-miw-wpl-2023-fans-disappointed-with-smriti-mandhanas-batting-twitter-flooded-with-memes-tata-wpl-2023-3839573#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RCBW vs MIW WPL 2023: ब्रेबोर्न स्टेडियम में मुंबई और आरसीबी के बीच खेले जा रहे WPL 2023 के चौथे मुकाबले में स्मृति मंधना (Smriti Mandhana) की कप्तानी में खेल रही बेंगलुरु (RCB) की टीम ने पहले टॉस जीत कर बल्लेबाज़ी का फैसला किया.","content":"Smriti Mandhana WPL में अपने उद्घाटन मुकाबले में रॉयल चैलेंजर्स (Royal Challengers Bangalore) की कप्तान स्मृति मंधना (Smriti Mandhana) ने 23 गेंदों में 35 रन की शानदार पारी खेली थी अपनी पारी के दौरान स्मृति ने 152.17 के स्ट्राइक रेट से 5 चौके और 1 छक्का लगाया था, लेकिन उनकी कप्तानी में बेंगलुरु ने अपना पहले मुकाबला गवां दिया. ब्रेबोर्न स्टेडियम में मुंबई और आरसीबी के बीच खेले जा रहे WPL के चौथे मुकाबले में स्मृति मंधना (Smriti Mandhana) की कप्तानी में खेल रही बेंगलुरु की टीम ने पहले टॉस जीत कर बल्लेबाज़ी का फैसला किया. Smriti Mandhana dismissed for 23 off 17 balls ° Smriti Mandhana in this WPL - 35(23) & 23(17). She played well in both matches. ©KBcric शुरुआत में स्मृति मंधना (Smriti Mandhana) और सोफी डिवाइन (Sophie Devine) की जोड़ी शानदार लय में दिख रही थी, लेकिन 39 के स्कोर पे आरसीबी (RCB) को पहला झटका लगने के बाद मानो टीम को नज़र लग गई और महज 4 रन जोड़ने के दौरान टीम को तीन झटके और लग गए और स्कोर 43 -4 विकेट हो गया. 1⃣ brings 2⃣, they say! 💬 Saika Ishaque agrees & how! 👏 👏 Watch how she dismissed Sophie Devine & Disha Kasat 🔽 Follow the match ▶️ | | स्मृति ने मुंबई (Smriti Mandhana vs MI) के खिलाफ 135.29 के स्ट्राइक रेट से 17 गेंदों में 23 रन की पारी खेली और इस दौरान उन्होंने 5 चौके लगाए, लेकिन सोशल मीडिया (Social Media Reaction on Smriti Mandhana) पर स्मृति को लेकर कुछ ट्वीट किये गए हैं जिसमे उनको ओवररेटेड कहा गया, तो कुछ फैंस ने उनके बल्लेबाज़ी की तारीफ भी की है. Smriti Mandhana is kinda overrated, accept it or not 🤝 स्मृति मंधना के पास जो बल्लेबाज़ी की काबिलियत है उसके अनुसार अब तक दोनों ही मुकाबले में उनके बल्ले से वैसा प्रदर्शन नहीं देखने को मिला जिसका इंतज़ार स्मृति के फैंस को रहता हैं. हालांकि जिस अंदाज में उनका विकेट गिरा वो शॉट लगाने में हेली मैथ्यूज की गेंद पर वोंग के हाथों लपकी गई. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 15:55:39","image_url":"https://c.ndtvimg.com/2023-03/lqsnlg4o_smriti-mandhana-bcci_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Maris Stella meet St. Sylvester’s in the Under 19 Tier ‘B’ quarter-final","link":"http://island.lk/maris-stella-meet-st-sylvesters-in-the-under-19-tier-b-quarter-final/","keywords":["Sports","Maris Stella","St. Sylvesters","Under 19 Tier ‘B’ quarter-final"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group […]","content":"Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group (Z). St. Sylvester’s are led by Malith Kulatunge. Maris Stella (from): Kaveen Fernando (Captain), Shen Adithya (Vice Captain), Navindu Wijesooriya, Sachiru Hansala, Ayesh Perera, Sandew Rathnayaka, Rahumath Deen, Ramith Bandara, Levin Fernando, Randeera de Silva, Nethum Basnayaka, Akalanka Fernando, Mineth Fernando, Hasindu Perera, Anshen De Silva, Ameesha Fernando, Manjua Nayanajith, Shevin Hewavitharana, Binal Fernando, Rayan Punchihewa, Hansala Kulasooriya, Adithya Fernando, Pawan Edirisinghe, Hasthika De Silva, Rasul Fernando, Dilash Fernando, Senura Liyanage. St. Sylvester’s (from): Malith Kulatunge (Captain), Akila Wickramasinghe, Isuru Gunasekara, Khanka Wickramasinghe, Charuka Ayeshan, Sahan Dissanayake, Kavishka Imesh, Chandupa Waduge, Yoshitha Isuranga, Wageesha Hansala, Chamod Dissanayake, Dion Fernando, Pansilu Bandara, Nimesha Silva, Kashyapa Dissanayake, Piyumaka Karunarathna, Chandimal Wijewardana, Arusha Mendis, Sihina Bandara, Sandaruwan Herath, Published on By Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as well. Suranga Ranaweera of Dehiwala Mount Lavinia Sports Club was placed third. Air Force won the women’s team championship In the women’s event, which was an 84-kilo metres race, Dinesha Dilrukshi (2:34.46 secs) of Sri Lanka Air Force was the winner. Sudharika Priyadharshani was placed second, while Navy’s Anne Shenali settled for the third position in this one-day event. The three-stage men’s event commenced with a participation of 160 cyclists on March 2 at close proximity to the Air Force headquarters in Colombo. Sri Lanka Air Force conducted the event for the 24th time. Men’s event was conducted in three stages Some 160 participants competed Men’s event was conducted in three stages. in the men’s event Dinesha Dilrukshi of the Air Force was the winner of the women’s race. Published on By With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa. Published on By BBC reported that a man has died after a fight between football fans outside a pub. Tony Johnson, 55, was found with a serious head injury near The Manchester bar on the Promenade in Blackpool at 19:00 GMT on Saturday. Blackpool Football Club said they were “deeply shocked and saddened” by the grandfather’s death. Johnson’s partner said his family were “heartbroken” and “devastated”. Supporters had clashed after the match between Blackpool and Burnley.","pubDate":"2023-03-07 00:00:55","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Chandana, Avishka guide Army to clinch cycling title","link":"http://island.lk/chandana-avishka-guide-army-to-clinch-cycling-title/","keywords":["Sports","Air Force cycle race","Air Force cycle race 2023"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as […]","content":"Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as well. Suranga Ranaweera of Dehiwala Mount Lavinia Sports Club was placed third. Air Force won the women’s team championship In the women’s event, which was an 84-kilo metres race, Dinesha Dilrukshi (2:34.46 secs) of Sri Lanka Air Force was the winner. Sudharika Priyadharshani was placed second, while Navy’s Anne Shenali settled for the third position in this one-day event. The three-stage men’s event commenced with a participation of 160 cyclists on March 2 at close proximity to the Air Force headquarters in Colombo. Sri Lanka Air Force conducted the event for the 24th time. Men’s event was conducted in three stages Some 160 participants competed Men’s event was conducted in three stages. in the men’s event Dinesha Dilrukshi of the Air Force was the winner of the women’s race. Published on By Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group (Z). St. Sylvester’s are led by Malith Kulatunge. Maris Stella (from): Kaveen Fernando (Captain), Shen Adithya (Vice Captain), Navindu Wijesooriya, Sachiru Hansala, Ayesh Perera, Sandew Rathnayaka, Rahumath Deen, Ramith Bandara, Levin Fernando, Randeera de Silva, Nethum Basnayaka, Akalanka Fernando, Mineth Fernando, Hasindu Perera, Anshen De Silva, Ameesha Fernando, Manjua Nayanajith, Shevin Hewavitharana, Binal Fernando, Rayan Punchihewa, Hansala Kulasooriya, Adithya Fernando, Pawan Edirisinghe, Hasthika De Silva, Rasul Fernando, Dilash Fernando, Senura Liyanage. St. Sylvester’s (from): Malith Kulatunge (Captain), Akila Wickramasinghe, Isuru Gunasekara, Khanka Wickramasinghe, Charuka Ayeshan, Sahan Dissanayake, Kavishka Imesh, Chandupa Waduge, Yoshitha Isuranga, Wageesha Hansala, Chamod Dissanayake, Dion Fernando, Pansilu Bandara, Nimesha Silva, Kashyapa Dissanayake, Piyumaka Karunarathna, Chandimal Wijewardana, Arusha Mendis, Sihina Bandara, Sandaruwan Herath, Published on By With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa. Published on By BBC reported that a man has died after a fight between football fans outside a pub. Tony Johnson, 55, was found with a serious head injury near The Manchester bar on the Promenade in Blackpool at 19:00 GMT on Saturday. Blackpool Football Club said they were “deeply shocked and saddened” by the grandfather’s death. Johnson’s partner said his family were “heartbroken” and “devastated”. Supporters had clashed after the match between Blackpool and Burnley.","pubDate":"2023-03-07 00:00:00","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Nirmal, Abhishek help Richmond take upper hand","link":"http://island.lk/nirmal-abhishek-help-richmond-take-upper-hand/","keywords":["Sports","Featured","Sharon Abhishek","Tharinda Nirmal","Under 19 Division I Tier"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"Under 19 Division I Tier ‘A’ Cricket Quarter-Final by Reemus Fernando With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points […]","content":"With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa. Published on By BBC reported that a man has died after a fight between football fans outside a pub. Tony Johnson, 55, was found with a serious head injury near The Manchester bar on the Promenade in Blackpool at 19:00 GMT on Saturday. Blackpool Football Club said they were “deeply shocked and saddened” by the grandfather’s death. Johnson’s partner said his family were “heartbroken” and “devastated”. Supporters had clashed after the match between Blackpool and Burnley. Published on By Hayley Matthews starred with the bat and ball as Mumbai Indians hammered Royal Challengers Bangalore by nine wickets at the Brabourne Stadium. It was MI’s second consecutive win while RCB are yet to get off the mark after two games. Brief Scores: RCB 155 in 18.4 overs (Richa Ghosh 28;Haley Matthews 3-28) MI 159/1 in 14.2 overs (Hayley Matthews 77*, Nat Sciver-Brunt 55*) by 9 wickets Published on By Shakib Al Hasan’s all-round efforts prevented England from clean-sweeping the ODI series as Bangladesh won the final ODI by 50 runs. Following patient half-centuries from Mushfiqur Rahim and Najmul Hossain, Shakib struck a 71-ball 75 to help Bangladesh to 246 despite wickets falling from the other end. The left-handed all-rounder then made key incisions with the ball, picking his 300th ODI wicket en route to figures of 4 for 35 as England folded for 196. Brief scores: 246 in 48.5 overs (Shakib Al Hasan 75, Mushfiqur Rahim 70; Jofra Archer 3-35, Adil Rashid 2-21) 196 in 43.1 overs (James Vince 38, Chris Woakes 34; Shakib Al Hasan 4-35, Ebadot Hossain 2-38)","pubDate":"2023-03-06 23:55:57","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Australian cricketer Nathan Bracken is unrecognisable as he stands for Liberals in NSW election","link":"https://www.dailymail.co.uk/sport/cricket/article-11824759/Australian-cricketer-Nathan-Bracken-unrecognisable-stands-Liberals-NSW-election.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"An Aussie limited overs genius who took 186 wickets for Australia from 121 international matches looks nothing like the cult hero he was as he makes a surprise foray into state politics.","content":"Aussie cult cricket star is unrecognisable from his playing days as he makes a shock career switch ODI cricketing legend has made career switch Star quick is standing in NSW State election He is unrecognisable without iconic locks By Kristy Williams For Daily Mail Australia Published: 05:33, 6 March 2023 | Updated: 21:26, 6 March 2023 e-mail 15 View comments Aussie limited-overs cricket star Nathan Bracken took 186 wickets for Australia from 121 international matches - but surprisingly, politics is where the cult hero now plies his trade. The left-arm quick was one of the first bowlers to really master the art of slower cutter balls, and was the second-fastest bowler to reach 100 ODI wickets - behind only two legendary players: Shane Warne and Dennis Lillee. During his international playing days from 2001-2009, Bracken was known for flowing blond locks that were often held in place by a headband. But he doesn't look like that anymore. The 45-year-old, who was raised in the Blue Mountains west of Sydney, now resides on the state's Central Coast, and is running as the Liberal candidate for The Entrance electorate in the upcoming State election. Nathan Bracken took an incredible 174 wickets in a brilliant 116-match ODI career for Australia that was cut short by injury The towering quick, pictured with wife Haley, is unrecognisable from his days when he was one of the Australia side's most popular players Bracken sends one down during the 2006 ICC Champions Trophy - which Australia won - sporting his iconic blonde locks Gone are the iconic locks. The towering 195cm ex-cricketer now sports a short, cropped style with a middle part, which is often accompanied by a scruffy, pepper-coloured beard. Since he had to retire in 2011 due to a debilitating knee injury - which he sued Cricket Australia for $1million over - Bracken has taken to a variety of jobs. After doing a Bachelor of Communications, Bracken has dipped his toe in commentary, done a significant amount of cricket coaching, filled a variety of business manager roles and is currently an account manager at Boral Concrete, according to his LinkedIn page. And now embattled Liberals leader Dominic Perrottet has turned to the ex-cricketer to try and overcome a 5.2 per cent swing against Labor incumbent David Mehan, who has held the seat since 2015. Bracken, who has been a member of the Liberal Party for two years, previously ran as an Independent (who preferenced the Liberals) for the Federal seat in 2013, though he will be hoping to go much better this time around after only securing 8.2 per cent of the primary vote. Nathan Bracken lives with long-time wife Haley and sons Chase and Tag on the NSW Central Coast after growing up in the Blue Mountains, west of Sydney Bracken celebrates a wicket in one of his five Tests for Australia. The left-armer was considered a limited-overs specialist given the stacked talent of quicks during his generation The lanky quick said he wanted to give the burgeoning Central Coast population 'a voice' in State parliament ahead of the election - which the Labor party is heavily favoured to win - on March 25. 'I've been on the Central Coast now for pretty much close to 20 years … I made a decision a while a go to not be someone who sits around and whinges about it …(I want to focus on) what it can be, the infrastructure, the opportunities all the residents want it to have,' he told the Daily Telegraph . 'What Dominic (Perrottet) has been through and where he is taking us … going forward, (it's) a great opportunity to leapfrog out of Covid and put us on the front foot for the future.' Though he appears to have a short memory when it comes to political allegiances. When standing as an independent in the 2013 Federal election, Bracken insisted he had no interest in joining a major party, and 'floats around' the political spectrum. 'Once you have alignment with a party you can't make a judgement call on every issue,' he told News Corp in 2012. 'When I was playing cricket I knew where it was going, what my plan was, and if things changed I could go with it. With a party sometimes you can't change direction.' Nathan Bracken, sporting his iconic blonde locks, sends one down in Australia's successful 2007 ODI World Cup campaign But ten years down the track he insists that he has always been on the Liberals side. 'My views have always been down the Liberal side of things, even when I ran as an independent, I preferenced the Liberals,' Bracken said. The popular community man, who has been an ambassador for a vast amount of charities, isn't expected to win, unfortunately. Forecasting site AE Forecasts gives the Aussie cricketer no hope of upsetting the incumbent, with Bracken just a 1.4 per cent chance of toppling Mehan as the seat swings even further to Chris Minns' Labor. That being said, he is expected to win slightly more of the primary vote given his shift to a major party. The wily quick will need to draw on all those bowling skills of old and nab a huge swing in his direction. Share or comment on this article: Australian cricketer Nathan Bracken is unrecognisable as he stands for Liberals in NSW election e-mail Add comment Comments 15 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-06 21:26:28","image_url":"https://i.dailymail.co.uk/1s/2023/03/06/21/68398991-0-image-m-18_1678137648707.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"AB De Villiers ने Virat Kohli नहीं बल्कि इस क्रिकेटर को बताया टी20 इतिहास का सबसे महान खिलाड़ी","link":"https://sports.ndtv.com/hindi/cricket/ab-de-villiers-picks-greatest-t20-player-of-all-time-but-his-good-friend-virat-kohli-is-not-in-his-list-3840035#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"साउथ अफ्रीका के पूर्व कप्तान व मि. 360 डिग्री के नाम से मशहूर एबी डिविलियर्स ने भी टी20 इतिहास का अब तक का सबसे महान खिलाड़ी चुना है. लेकिन खास बात ये है कि उन्होंने अपने खास दोस्त और ग्लोबल स्टार विराट कोहली को नहीं बल्कि किसी और खिलाड़ी को अब तक का सबसे महान टी20 क्रिकेटर बताया है.","content":"डिविलियर्स ने कोहली नहीं बल्कि इस क्रिकेटर को बताया टी20 इतिहास का सबसे महान खिलाड़ी इंडियन प्रीमियर लीग दुनिया की सबसे पॉपुलर लीग है, जहां पर विश्व भर के स्टार प्लेयर्स अपना जलवा दिखाते हुए नज़र आते हैं. आईपीएल के 15 शानदार सीज़न भी हो चुके हैं. विश्व के बाकी देशों में भी टी20 लीग्स का काफी बोलवाला है. ऐसे में समय समय पर क्रिकेट जगत के महान प्लेयर्स अब तक के टी20 के सर्वकालिक महान खिलाड़ी चुनते हैं. जिसकी काफी चर्चाए भी होती हैं. इसी बीच साउथ अफ्रीका के पूर्व कप्तान व मि. 360 डिग्री के नाम से मशहूर एबी डिविलियर्स ने भी टी20 इतिहास का अब तक का सबसे महान खिलाड़ी चुना है. लेकिन खास बात ये है कि उन्होंने अपने खास दोस्त और ग्लोबल स्टार विराट कोहली को नहीं बल्कि किसी और खिलाड़ी को अब तक का सबसे महान टी20 क्रिकेटर बताया है. एबी डिविलियर्स ने राशिद खान को टी20 का सबसे महान खिलाड़ी बताया है. उन्होंने कहा कि वे बल्ले और गेंद दोनों से प्रभावित करता है, वे दोनों में मैच विजेता है. वे हमेशा जीतना चाहता है.वे सर्वश्रेष्ठ में से एक नहीं, बल्कि सर्वश्रेष्ठ हैं. कई क्रिकेट फैंस और विशेषज्ञों ने इतिहास के सबसे महान टी20 क्रिकेटर पर काफी बहस भी की है, जिनमें से कई विराट कोहली, क्रिस गेल, जोस बटलर, डेविड वार्नर और कीरोन पोलार्ड को पसंद करते हैं.लेकिन डिविलियर्स ने अफगानिस्तान के स्टार स्पिनर राशिद खान को टी20 का सबसे महान खिलाड़ी बताया है. वहीं कोहली की अगर बात करें तो टी20ई क्रिकेट में सबसे अधिक रन बनाने वाले खिलाड़ी हैं. टी20 इंटरनेशनल क्रिकेट में विराट के नाम 115 मैचों में 4008 रन दर्ज हैं. जिसमें उन्होंने 1 शतक व 37 अर्धशतक जड़े हैं.वहीं आईपीएल के 223 मैचों में उन्होंने 6624 रन बनाए हैं, जिसमें 5 शतक और 44 अर्धशतक शामिल हैं. अंतर्राष्ट्रीय क्रिकेट में विराट के बाद सबसे ज्यादा रन टीम इंडिया के कप्तान रोहित शर्मा के नाम दर्ज हैं. रोहित ने 148 टी20 मुकाबलों में 3853 रन बनाए हैं, जिसमें चार शतक और 29 अर्द्धशतक शामिल हैं. बता दें कि एबी डिविलियर्स व विराट कोहली आईपीएल की टीम RCB क लिए एक साथ खेलते हुए नज़र आते थे. वे एक ऐसे खिलाड़ी हैं,जिन्हें टी20 स्पेशलिस्ट माना जाता था, और उन्हें इतिहास के सबसे महान बल्लेबाजों में भी माना जाता है. इसलिए जब दक्षिण अफ्रीकी बल्लेबाज़ से उनके अब तक के सबसे महान टी20 क्रिकेटर के बारे में पूछा गया, तो उन्होंने अपने जवाब से सभी को चौंका दिया, और आरसीबी के अपने पूर्व साथी और अच्छे दोस्त विराट कोहली को भी इसमें शामिल नहीं किया. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 18:11:24","image_url":"https://c.ndtvimg.com/2023-03/kvrc35gg_kohli-de-villiers_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL 2023: हेली मैथ्यूज ने लगाया ऐसा शॉट की खुली रह गई गेंदबाज़ की आंखें, जमाया विस्फोटक अर्धशतक","link":"https://sports.ndtv.com/hindi/cricket/wpl-2023-haley-mathews-hit-such-a-shot-that-left-the-bowlers-eyes-open-scored-a-blistering-half-century-3840027#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"MI vs RCB WPL 2023: मुंबई की तरफ से मैथ्यूज (Hayley Matthews) ने 26 रन देकर तीन विकेट लिए, लेकिन जब मुंबई की तरफ से बल्लेबाज़ी करने उतरी तो मानों ये पहले से ही इरादा बनाकर आई थी की आज मैदान पर तहलका मचाना है.","content":"Hayley Matthews मुंबई इंडियंस में सोमवार को यहां रॉयल चैलेंजर्स बेंगलोर (RCB) को नौ विकेट से हराकर महिला प्रीमियर लीग (WPL 2023) टी20 टूर्नामेंट में अपनी लगातार दूसरी जीत दर्ज की, आरसीबी के अधिकतर बल्लेबाजों ने अच्छी शुरुआत की लेकिन उनमें से कोई भी बड़ी पारी नहीं खेल पाया, उनकी तरफ से विकेटकीपर बल्लेबाज रिचा घोष ने सर्वाधिक 28 रन बनाए लेकिन इसके लिए उन्होंने 26 गेंदे खेली , मुंबई की तरफ से हेली मैथ्यूज (Hayley Matthews) ने 26 रन देकर तीन विकेट लिए, लेकिन जब मुंबई की तरफ से बल्लेबाज़ी करने उतरी तो मानों ये पहले से ही इरादा बनाकर आई थी की आज मैदान पर तहलका मचाना है. मैथ्यूज (Hayley Matthews Half Century vs RCB) ने आरसीबी के खिलाफ शानदार बल्लेबाज़ी की बदौलत 124 रनों के साथ अब (WPL 2023) की टॉप रन स्कोरर बन गई हैं और ऑरेंज कैप (Hayley Matthews Orange Cap Holder) पर कब्ज़ा जमा लिया हैं. Clean striking 💥 on a roll with the bat too! Follow the match ▶️ | आरसीबी के खिलाफ बैटिंग करती हुए मैथ्यूज ने 202.63 की स्ट्राइक रेट से मात्र 38 गेंदों में 13 चौके और एक छक्के की मदद से 77 रन की धुआंधार पारी खेली और प्लेयर ऑफ द मैच बनीं और उनका बखूबी साथ दिया नट सीवर ब्रंट (Nat Sciver-Brunt) ने जिन्होंने 189.66 की स्ट्राइक रेट से 9 चौके और 1 छक्के की मदद से 29 गेंदों में 55 रनों की पारी खेली. आरसीबी की टीम पहले बल्लेबाजी करते हुए 18.4 ओवर में 155 रन पर आउट हो गई. मुंबई ने 14.2 ओवर में एक विकेट पर 159 रन बनाकर जीत दर्ज की. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 18:08:04","image_url":"https://c.ndtvimg.com/2023-03/b4boa5ng_matthews_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MI VS RCB: मुंबई इंडियंस ने रॉयल चैलेंजर्स बेंगलुरू पर दर्ज की 9 विकेट से शानदार जीत","link":"https://sports.ndtv.com/hindi/cricket/wpl-2023-mi-vs-rcb-live-mumbai-indians-women-vs-royal-challengers-bangalore-women-4th-match-live-cricket-score-commentary-3838941#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"MI Women vs RCB Women: ब्रेबॉन स्टेडियम में मुंबई इंडियंस और रॉयल चैलेंजर्स बेंगलुरू के बीच खेले गए मुकाबले में मुंबई ने बेंगलुरू को 9 विकेट से हरा दिया है.","content":"MI vs RCB ब्रेबॉन स्टेडियम में मुंबई इंडियंस और रॉयल चैलेंजर्स बेंगलुरू के बीच खेले गए मुकाबले में मुंबई ने बेंगलुरू को 9 विकेट से हरा दिया है. हरमनप्रीत कौर की अगुवाई वाली मुंबई इंडियंस ने बेंगलुरू से मिले 156 रनों के टारगेट का पीछा करते हुए मात्र 1 विकेट गंवाकर 14.2 ओवर में ही जीत दर्ज कर ली. मुंबई की तरफ से हेली मैथ्यूज़ ने 38 गेंद में 77 रनों की विस्फोटक पारी खेली. वहीं नेट सीवर ब्रंट ने 29 गेंद में 55 रन बनाए. बेंगलुरू की तरफ से प्रीति बॉस ही 1 विकेट चटका पाईं. इससे पहले टॉस जीतकर पहले बल्लेबाज़ी करने उतरी आरसीबी की टीम 20 ओवर भी नहीं खेल पाई और 18.4 ओवर में ही 155 रन पर सिमट गई. मैच में बेंगलुरू की तरफ से ऋचा घोष ने सबसे ज्यादा 28 रन बनाए. वहीं कप्तान मंधाना व श्रेयंका पाटिल ने 23-23 रनों का योगदान दिया. मुंबई की तरफ से हेली मैथ्यूज़ ने 3 विकेट चटकाए वहीं साइका इसाक व अमेलिया केर ने 2-2 विकेट लिए. बेंगलुरू की टीम को इससे पहले भी अपने पहले ही मुकाबले में दिल्ली से 60 रनों से करारी शिकस्त झेलनी पड़ी थी. वहीं ओपनिंग मुकाबले में 143 रनों से बड़ी जीत दर्ज कर कप्तान हरमन समेत धमाल मचाने वाली मुंबई ने लगातार अपना दूसरा मुकाबला भी जीत लिया है. बेंगलुरू ने इस मैच के लिए अपनी टीम में एक बदलाव करके आशा शोभना की जगह श्रेयंका पाटिल को अंतिम इलेवन में रखा था. वहीं मुंबई ने टीम में कोई बदलाव नहीं किया. यास्तिका भाटिया (विकेटकीपर), हेले मैथ्यूज, नेट साइवर-ब्रंट, हरमनप्रीत कौर (कप्तान), अमेलिया केर, पूजा वस्त्राकर, इस्सी वोंग, अमनजोत कौर, हुमायरा काजी, जिंतिमनी कलिता, सायका इशाक स्मृति मंधाना (कप्तान), सोफी डिवाइन, एलिसे पेरी, दिशा कासत, ऋचा घोष (विकेटकीपर), हीदर नाइट, कनिका आहूजा, मेगन शुट्ट, श्रेयंका पाटिल, प्रीति बोस, रेणुका ठाकुर सिंह पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 17:21:17","image_url":"https://c.ndtvimg.com/2023-03/q4hr1irg_mi-vs-rcb_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"England are BEATEN by 50 runs in the third ODI against Bangladesh in Chattogram","link":"https://www.dailymail.co.uk/sport/cricket/article-11826163/England-BEATEN-50-runs-ODI-against-Bangladesh-Chattogram.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"RICHARD GIBSON: History was made as Rehan Ahmed became England's youngest one-day international cricketer on Monday - but unlike his Test debut it did not come in a winning cause.","content":"England are BEATEN by 50 runs in the third ODI against Bangladesh in Chittagong... with Jos Buttler's experimental side coming up short against the hosts, who saw Shakib Al Hasan bag his 300th ODI wicket England have lost the third and final one-day international against Bangladesh Jos Buttler's visiting side were defeated by 50 runs in Chattogram on Monday Rehan Ahmed became the country's youngest one-day international cricketer By Richard Gibson For Mailonline Published: 08:34 EST, 6 March 2023 | Updated: 12:12 EST, 6 March 2023 e-mail 5 View comments History was made on Monday as Rehan Ahmed became England’s youngest one-day international cricketer but there was to be no repeat of his glorious Test debut in Karachi. Back in Karachi in December, the 18-year-old celebrated inheriting similar junior status as a Test player with a five-wicket haul amongst seven for the match in victory over Pakistan. Here, replacing the injured Will Jacks, he had to settle for one - from his final delivery - and a galling defeat after an experimental England side squandered the chance to seal a first 50-over series whitewash in Asia since a 3-0 success over Bangladesh in 2010. Such a turn of events came down to a combination of a stellar all-round performance by Shakib Al Hasan and their own failings. All the talk here has been of a rift in the home camp but there was little sign of disharmony as Shakib, one of the players at the heart of the brouhaha, powered the hosts to a defendable score by powering 75 of their final 131 runs, and then bagged four for 35, including Ahmed as his 300th victim in ODIs, during an England implosion. History was made as Rehan Ahmed became England's youngest one-day international cricketer on Monday - but it came in a 50-run defeat against Bangladesh in Chittagong The 18-year-old leg-spinner was congratulated by team-mates after taking his first ODI wicket England were beaten in the third and final ODI, but ended up winning the bilateral series 2-1 The clean sweep appeared on the cards when Phil Salt powered out of the blocks with seven fours during a first-wicket stand of 54 but his tame guide to cover-point - swiftly followed by the departures of the series’ two centurions Dawid Malan and Jason Roy, also to cross-batted shots at a cost of one run - turned the tide on the Bay of Bengal. There is an all-or-nothing aspect to Malan’s one-day international career. His miscue to mid-on left his tally at 5-4 in the ducks versus hundreds stakes. And when Roy had his stumps splattered by Shakib, it exposed the tourists’ tinkering. Ahmed’s inclusion meant Adil Rashid, the senior leg-spinner, bowled only half of his allocation while Sam Curran walked in to bat at five. England saw benefit in involving the teenager as heavily as possible; while if Ben Stokes does not reverse his retirement decision for this autumn's World Cup, it would be useful to have a seam-bowling option amongst the batters. Curran stabilised things, sharing 49 for the fourth wicket with top scorer James Vince but in conditions that must have felt like facing a cannon ball on quicksand, Bangladesh’s spin-heavy attack prospered, Shakib producing the delivery of the match to nick off Vince, and fellow left-armer Taijul Islam sliding one under Jos Buttler’s reverse sweep to leave only the tail and a run-a-ball asking rate for the final dozen overs. It was never going to end well from there. ‘We certainly believed we could have won the game, and if we’d played well enough we would have, but it was absolutely an opportunity to give Rehan his debut, for Sam to bat at no 5 and it is the last ODI we play now until September, so especially in these conditions, it was a chance to gather as much information as we possibly could and expose people to different situations,’ said Buttler. England’s dressing room believed Bangladesh were under par at halfway after Jofra Archer and Curran top and tailed the innings with wickets, either side of a fine spell of two for 21 by Rashid. The home side Bangladesh restricted England well with constant wickets after scoring 246 Star all-rounder Shakib Al Hasan (centre) scored 75 off 71 before taking 4-35 in his 10 overs Share or comment on this article: England are BEATEN by 50 runs in the third ODI against Bangladesh in Chattogram e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-06 17:12:59","image_url":"https://i.dailymail.co.uk/1s/2023/03/06/17/68384361-0-image-m-11_1678122752905.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"MI vs RCB: ऋचा घोष को अंपायर ने दिया नॉटआउट तो हरमनप्रीत ने लिया रिव्यू, DRS पर मचा बवाल","link":"https://sports.ndtv.com/hindi/cricket/mi-vs-rcb-richa-ghosh-was-given-not-out-by-the-umpire-harmanpreet-took-the-review-there-was-a-ruckus-on-drs-3839803#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RCB vs MI: आरसीबी (RCB) के अधिकतर बल्लेबाजों ने अच्छी शुरुआत की लेकिन उनमें से कोई भी बड़ी पारी नहीं खेल पाया.","content":"Richa Ghosh ऑफ स्पिनर हेली मैथ्यूज (Hayley Matthews) की अगुवाई में मुंबई इंडियंस के गेंदबाजों ने रॉयल चैलेंजर्स बेंगलोर (RCB) के किसी भी बल्लेबाज को बड़ी पारी नहीं खेलने दी और उसकी पूरी टीम को महिला प्रीमियर लीग (WPL) टी20 टूर्नामेंट में सोमवार को यहां 18.4 ओवर में 155 रन पर आउट कर दिया. आरसीबी के अधिकतर बल्लेबाजों ने अच्छी शुरुआत की लेकिन उनमें से कोई भी बड़ी पारी नहीं खेल पाया. उसकी तरफ से विकेटकीपर बल्लेबाज रिचा घोष (Richa Ghosh) ने सर्वाधिक 28 रन बनाए लेकिन इसके लिए उन्होंने 26 गेंदे खेली, लेकिन 8वें ओवर में ऋचा घोष के चलने के बाद (एमआई के डीआरएस चुनने से पहले) हरमनप्रीत कौर (Harmanpreet Kaur DRS Review) को अल्ट्रा एज पर विश्वास नहीं हो रहा था. ऋचा घोष (Richa Ghosh Wicket) ने पुल शॉट मरने का प्रयास किया था, लेकिन वो सफल नहीं हो पाई ऐसे में विकेटकीपर यस्तिका भाटिया ने अपील की और उसके बाद ऋचा घोष खुद से पवेलियन की ओर लौटने लगी. Unreal scenes, Reply showed Richa Ghosh got a deflection but Ultra Edge showed no bat involved, Harmanpreet Kaur can't believe what just happened अंपायर ने ऋचा को नॉटआउट करार दिया लेकिन अंपायर के फैसले के खिलाफ मुंबई की कप्तान हरमनप्रीत कौर ने रिव्यु ले लिया लेकिन रिव्यु में गेंद बल्ले से (Ultra Edge) लगती हुई नहीं दिखाई दी और मुंबई ने अपना एक रिव्यु भी गवां दिया, कप्तान हरमनप्रीत का ये रिएक्शन सोशल मीडिया पर वायरल हो गया. Harmanpreet Kaur can't believe the ultra edge after Richa Ghosh had started walking(before MI opted for DRS) in the 8th over. . . मुंबई की तरफ से मैथ्यूज ने 26 रन देकर तीन विकेट लिए. उन्हें सैका इशाक (26 रन देकर दो) और अमेलिया केर ( 30 रन देकर दो) का अच्छा साथ मिला. स्मृति मंधाना (17 गेंदों पर 23 रन, पांच चौके) ने टॉस जीतकर पहले बल्लेबाजी का फैसला करने के बाद सोफी डिवाइन (11 गेंदों पर 16 रन, दो चौके, एक छक्का) के साथ पहले विकेट के लिए 39 रन की साझेदारी करके आरसीबी को तेजतर्रार शुरुआत दिलाई, लेकिन इसके बाद उसने आठ गेंदों के अंदर चार विकेट गंवा दिए. मुंबई की पिछले मैच में गुजरात जायंट्स (MI vs GG) के खिलाफ जीत में 11 रन देकर चार विकेट लेने वाली बाएं हाथ की स्पिनर सैका इशाक ने डिवाइन को सीमा रेखा पर कैच कराने के बाद दिशा कसाट को बोल्ड किया. मैथ्यूज ने अगले ओवर में मंधाना और हीथर नाइट को लगातार गेंदों पर आउट करके आरसीबी का स्कोर चार विकेट पर 47 रन कर दिया. एलिस पेरी (सात गेंदों पर 13 रन) ने रिचा के साथ मिलकर कुछ करारे शॉट जमाए लेकिन तेजी से रन चुराने के प्रयास में ऑस्ट्रेलियाई ऑलराउंडर रन आउट हो गई. आरसीबी (RCB) ने इसके बावजूद आक्रामक रवैया जारी रखा. रिचा ने कनिका आहूजा के साथ छठे विकेट के लिए 34 रन की साझेदारी की. कनिका ने पूजा वस्त्राकर की गेंद पर विकेटकीपर को कैच देने से पहले 13 गेंदों पर 22 रन बनाए जिसमें तीन चौके और अमेलिया केर पर लगाया गया दर्शनीय छक्का शामिल है. आरसीबी (RCB vs MI WPL 2023) का दारोमदार रिचा पर था, लेकिन मैथ्यूज ने अपने दूसरे स्पेल इस आक्रामक विकेटकीपर बल्लेबाज को पवेलियन की राह दिखा दी. रिचा (Richa Ghosh) ने अपनी पारी में तीन चौके एक छक्का लगाया. श्रेयंका पाटिल ने 15 गेंदों पर चार चौकों की मदद से 23 रन बनाकर अपनी बल्लेबाजी क्षमता का परिचय दिया. उन्होंने आउट होने से पहले मेगान शट (20) के साथ 34 रन की उपयोगी साझेदारी की. केर ने रेणुका सिंह और मेगान को आउट करके आरसीबी की पारी का अंत किया. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 16:54:22","image_url":"https://c.ndtvimg.com/2023-03/drmmpu2g_richa-_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MI vs RCB WPL 2023: स्मृति मंधना की बल्लेबाज़ी से फैंस हुए निराश, ट्विटर पर आई मीम्स की बाढ़","link":"https://sports.ndtv.com/hindi/cricket/rcbw-vs-miw-wpl-2023-fans-disappointed-with-smriti-mandhanas-batting-twitter-flooded-with-memes-tata-wpl-2023-3839573#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RCBW vs MIW WPL 2023: ब्रेबोर्न स्टेडियम में मुंबई और आरसीबी के बीच खेले जा रहे WPL 2023 के चौथे मुकाबले में स्मृति मंधना (Smriti Mandhana) की कप्तानी में खेल रही बेंगलुरु (RCB) की टीम ने पहले टॉस जीत कर बल्लेबाज़ी का फैसला किया.","content":"Smriti Mandhana WPL में अपने उद्घाटन मुकाबले में रॉयल चैलेंजर्स (Royal Challengers Bangalore) की कप्तान स्मृति मंधना (Smriti Mandhana) ने 23 गेंदों में 35 रन की शानदार पारी खेली थी अपनी पारी के दौरान स्मृति ने 152.17 के स्ट्राइक रेट से 5 चौके और 1 छक्का लगाया था, लेकिन उनकी कप्तानी में बेंगलुरु ने अपना पहले मुकाबला गवां दिया. ब्रेबोर्न स्टेडियम में मुंबई और आरसीबी के बीच खेले जा रहे WPL के चौथे मुकाबले में स्मृति मंधना (Smriti Mandhana) की कप्तानी में खेल रही बेंगलुरु की टीम ने पहले टॉस जीत कर बल्लेबाज़ी का फैसला किया. Smriti Mandhana dismissed for 23 off 17 balls ° Smriti Mandhana in this WPL - 35(23) & 23(17). She played well in both matches. ©KBcric शुरुआत में स्मृति मंधना (Smriti Mandhana) और सोफी डिवाइन (Sophie Devine) की जोड़ी शानदार लय में दिख रही थी, लेकिन 39 के स्कोर पे आरसीबी (RCB) को पहला झटका लगने के बाद मानो टीम को नज़र लग गई और महज 4 रन जोड़ने के दौरान टीम को तीन झटके और लग गए और स्कोर 43 -4 विकेट हो गया. 1⃣ brings 2⃣, they say! 💬 Saika Ishaque agrees & how! 👏 👏 Watch how she dismissed Sophie Devine & Disha Kasat 🔽 Follow the match ▶️ | | स्मृति ने मुंबई (Smriti Mandhana vs MI) के खिलाफ 135.29 के स्ट्राइक रेट से 17 गेंदों में 23 रन की पारी खेली और इस दौरान उन्होंने 5 चौके लगाए, लेकिन सोशल मीडिया (Social Media Reaction on Smriti Mandhana) पर स्मृति को लेकर कुछ ट्वीट किये गए हैं जिसमे उनको ओवररेटेड कहा गया, तो कुछ फैंस ने उनके बल्लेबाज़ी की तारीफ भी की है. Smriti Mandhana is kinda overrated, accept it or not 🤝 स्मृति मंधना के पास जो बल्लेबाज़ी की काबिलियत है उसके अनुसार अब तक दोनों ही मुकाबले में उनके बल्ले से वैसा प्रदर्शन नहीं देखने को मिला जिसका इंतज़ार स्मृति के फैंस को रहता हैं. हालांकि जिस अंदाज में उनका विकेट गिरा वो शॉट लगाने में हेली मैथ्यूज की गेंद पर वोंग के हाथों लपकी गई. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-06 15:55:39","image_url":"https://c.ndtvimg.com/2023-03/lqsnlg4o_smriti-mandhana-bcci_625x300_06_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"}]}