{"newsArray":[{"title":"Rasheed shakes up Bangla","link":"https://www.tribuneindia.com/news/sports/rasheed-shakes-up-bangla-356563","keywords":null,"creator":null,"video_url":null,"description":"Sharjah, December 30 Powered by an unbeaten knock of 90 by Shaik Rasheed, India thrashed Bangladesh by 103 runs in the semifinals of the U-19 Asia Cup cricket tournament here today, thus setting up a summit clash with Sri Lanka. India No. 3 Rasheed came in at 23/1 in eight overs and anchored the innings to 243/8 with his excellent knock, even as no other batsman passed even 30. Andhra Pradesh youngster Rasheed paced his innings to perfection after India had lost the two openers — Angkrish Raghuvanshi (16) and Harnoor Singh (15) — before the 50-run mark, by the 17th over. Defending 243, the Indian bowlers produced a cohesive effort to bundle out Bangladesh for 140 in 38.2 overs. Ariful Islam top-scored for Bangladesh with a 77-ball 42 while opener Mahfijul Islam made 26. Bangladesh's chase never got going as the Indian bowlers picked up wickets at regular intervals, with only Ariful providing some resistance. Four bowlers picked up two wickets each — Ravi Kumar (2/22), Vicky Ostwal (2/25), Raj Bawa (2/26) and Rajvardhan Hangargekar (2/36) — while Kaushal Tambe (1/5) and Nishant Sindhu (1/25) accounted for the other two wickets. Rasheed to the fore Earlier, the Indian openers found the going tough and it was only after their dismissal that the run rate started to improve. India lost No. 4 Sindhu for only 5 before Rasheed and skipper Yash Dhull (26 off 29) added 41 runs for the fourth wicket to stabilise the innings. Bawa (23), Ostwal (28 not out off 18 balls) and Hangargekar (16) also played useful cameos even as Rasheed did the bulk of scoring. Though it wasn't a spectacular knock from Rasheed — he hit only three fours and one six — he did enough to give the Indian bowlers a target to defend. For Bangladesh, left-arm orthodox spinner Rakibul Hasan was the pick of the bowlers with figures of three for 41 from 10 overs. Lanka defend 147 India will face Sri Lanka in the title clash in Dubai on Friday. Sri Lanka defeated Pakistan by 22 runs the other semifinal. Sri Lanka made a modest 147 all out after opting to bat and then restricted Pakistan to 125. — PTI Brief scores: India U-19 243/8 (Rasheed 90; Rakibul 3/41); Bangladesh U-19 140 all out in 38.2 overs (Ariful 42; Ravi 2/22, Ostwal 2/25, Bawa 2/26, Hangargekar 2/36)","content":null,"pubDate":"2021-12-31 02:39:11","full_description":"Sharjah, December 30 Powered by an unbeaten knock of 90 by Shaik Rasheed, India thrashed Bangladesh by 103 runs in the semifinals of the U-19 Asia Cup cricket tournament here today, thus setting up a summit clash with Sri Lanka. India No. 3 Rasheed came in at 23/1 in eight overs and anchored the innings to 243/8 with his excellent knock, even as no other batsman passed even 30. Andhra Pradesh youngster Rasheed paced his innings to perfection after India had lost the two openers — Angkrish Raghuvanshi (16) and Harnoor Singh (15) — before the 50-run mark, by the 17th over. Defending 243, the Indian bowlers produced a cohesive effort to bundle out Bangladesh for 140 in 38.2 overs. Ariful Islam top-scored for Bangladesh with a 77-ball 42 while opener Mahfijul Islam made 26. Bangladesh’s chase never got going as the Indian bowlers picked up wickets at regular intervals, with only Ariful providing some resistance. Four bowlers picked up two wickets each — Ravi Kumar (2/22), Vicky Ostwal (2/25), Raj Bawa (2/26) and Rajvardhan Hangargekar (2/36) — while Kaushal Tambe (1/5) and Nishant Sindhu (1/25) accounted for the other two wickets. Rasheed to the fore Earlier, the Indian openers found the going tough and it was only after their dismissal that the run rate started to improve. India lost No. 4 Sindhu for only 5 before Rasheed and skipper Yash Dhull (26 off 29) added 41 runs for the fourth wicket to stabilise the innings. Bawa (23), Ostwal (28 not out off 18 balls) and Hangargekar (16) also played useful cameos even as Rasheed did the bulk of scoring. Though it wasn’t a spectacular knock from Rasheed — he hit only three fours and one six — he did enough to give the Indian bowlers a target to defend. For Bangladesh, left-arm orthodox spinner Rakibul Hasan was the pick of the bowlers with figures of three for 41 from 10 overs. Lanka defend 147 India will face Sri Lanka in the title clash in Dubai on Friday. Sri Lanka defeated Pakistan by 22 runs the other semifinal. Sri Lanka made a modest 147 all out after opting to bat and then restricted Pakistan to 125. — PTI Brief scores: India U-19 243/8 (Rasheed 90; Rakibul 3/41); Bangladesh U-19 140 all out in 38.2 overs (Ariful 42; Ravi 2/22, Ostwal 2/25, Bawa 2/26, Hangargekar 2/36)","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/12/2021_12$largeimg_680853834.JPG","source_id":"tribuneindia"},{"title":"Vaishali 2nd in women's section, Humpy joint third","link":"https://www.tribuneindia.com/news/sports/vaishali-2nd-in-womens-section-humpy-joint-third-356568","keywords":null,"creator":null,"video_url":null,"description":"Warsaw R Vaishali was in second place with 7.5 points from nine rounds in the women's section of the World Blitz chess championship here while Koneru Humpy was joint third. DubaiMandhana nominated for T20 player of year awardIndia opener Smriti Mandhana was today nominated for the ICC Women's T20 Player of the Year award. England cricketers Tammy Beaumont and Nat Sciver and Ireland's Gaby Lewis were also nominated. WellingtonVeteran Ross Taylor to retire from international cricketVeteran New Zealand batsman Ross Taylor says he will retire from international cricket after the current domestic season. The second Test against Bangladesh next month will be his last. VascoBengaluru win six-goal thriller against ChennaiyinInspired substitutions from Bengaluru FC head coach Marco Pezzaiuoli did the trick as his side ran out 4-2 winners over Chennaiyin FC in the Indian Super League here today. Agencies","content":null,"pubDate":"2021-12-31 02:39:11","full_description":"Warsaw R Vaishali was in second place with 7.5 points from nine rounds in the women’s section of the World Blitz chess championship here while Koneru Humpy was joint third. Dubai Mandhana nominated for T20 player of year award India opener Smriti Mandhana was today nominated for the ICC Women’s T20 Player of the Year award. England cricketers Tammy Beaumont and Nat Sciver and Ireland’s Gaby Lewis were also nominated. Wellington Veteran Ross Taylor to retire from international cricket Veteran New Zealand batsman Ross Taylor says he will retire from international cricket after the current domestic season. The second Test against Bangladesh next month will be his last. Vasco Bengaluru win six-goal thriller against Chennaiyin Inspired substitutions from Bengaluru FC head coach Marco Pezzaiuoli did the trick as his side ran out 4-2 winners over Chennaiyin FC in the Indian Super League here today. Agencies","image_url":"https://www.tribuneindia.com/Content/images/rss-tribune-thumb.jpg","source_id":"tribuneindia"},{"title":"Pace like fire","link":"https://www.tribuneindia.com/news/sports/pace-like-fire-356558","keywords":null,"creator":null,"video_url":null,"description":"Centurion, December 30 India's fast bowlers destroyed a listless South Africa with their relentless attack to fashion an emphatic 113-run win in the first Test here today, setting the team on the path to a first-ever Test series win in the country. If 2021 started with India breaching Fortress Gabba in Brisbane in Australia, there couldn't have been a better end for the year for the team as it brought down South Africa in Supersport Park, which has been a citadel for the home team for the longest time. The target of 305 on a track with a lot of uneven bounce was always out of the question for a South African unit that is low on quality, and today's events unfolded as per the script. The home team folded up for 191 in 68 overs to give India a 1-0 lead in three-match series. Such was the command of the Indian pacers that they even took rain out of the equation, with one full day's play being lost due to the wet weather. It was a pity to see South Africa, which boasts of some of the greatest names of the sport, fail to post even 200 runs in both innings, with skipper Dean Elgar's 77 off 156 balls today failing to save the team. Quinton de Kock will miss the next Test as he will be away on paternity leave, and this will make it easier for India to claim their first series win in South Africa, after six series defeats and one draw since they first toured here in 1992. Pace like fire For India, the four pacers took 18 wickets between them and Ravichandran Ashwin wrapped up the South African tail in the second session to complete the formalities. The three men who won the match for India were vice-captain KL Rahul for that first innings hundred that gave the team a big platform, the supremely talented Mohammed Shami (5/44 and 3/63) who had a match-haul of eight wickets, and the peerless Jasprit Bumrah. Bumrah is perhaps Indian cricket's biggest gift, a freaky fast bowler who can provide moments of magic, as he did on the fourth evening to put India right on top. Mohammed Siraj and Shardul Thakur were the perfect supporting cast in the win, one of the most comfortable overseas victories for Virat Kohli's men. Indian bullies \"They bullied South Africa in their backyard and it's not often seen,\" said former South Africa fast bowler Morne Morkel. Bumrah (3/50) set the tone for the final morning by removing the dogged Proteas skipper Elgar (77 off 156 balls) while Siraj (2/47) and Shami also got into the act, with the knowledge that some rain was forecast for the afternoon session. Having gauged the variable bounce of the track, skipper Elgar knew that survival would not be an option and he needed to counterattack today. With the stodgy Temba Bavuma (35 not out off 80 balls) for company, 36 runs were added in the first 45 minutes but the best part was that there was no let-up in the intensity of the Indian attack as Kohli and wicketkeeper Rishabh Pant were constantly heard cheering the bowlers on. Shami dropped Elgar off his own bowling, but Bumrah was relentless, asking probing questions of the Proteas skipper. With one delivery that was angled into the left-hander, he beat the skipper and umpire Adrian Holdstock had an easy LBW verdict on his hands. De Kock (21) came in and hit a couple of delicious shots off Bumrah, trying to knock off as many runs as possible off the target. But when the hardworking Siraj bowled one with the scrambled seam, just like the first innings, de Kock tried to cut with very little room and played on. Wiaan Mulder (1), who had a forgettable match with no wickets, got a Shami ball that was way above his skill-set: It pitched on a length, landing on the seam, and Mulder played as if it were coming in, but it straightened enough to kiss the outside edge of his bat before landing into Pant's gloves. Ashwin then removed fast bowlers Kagiso Rabada and Lungi Ngidi off consecutive balls in the 68th over, setting off celebrations among the Indian players. — PTI","content":null,"pubDate":"2021-12-31 02:39:11","full_description":"Centurion, December 30 India’s fast bowlers destroyed a listless South Africa with their relentless attack to fashion an emphatic 113-run win in the first Test here today, setting the team on the path to a first-ever Test series win in the country. If 2021 started with India breaching Fortress Gabba in Brisbane in Australia, there couldn’t have been a better end for the year for the team as it brought down South Africa in Supersport Park, which has been a citadel for the home team for the longest time. The target of 305 on a track with a lot of uneven bounce was always out of the question for a South African unit that is low on quality, and today’s events unfolded as per the script. The home team folded up for 191 in 68 overs to give India a 1-0 lead in three-match series. Such was the command of the Indian pacers that they even took rain out of the equation, with one full day’s play being lost due to the wet weather. It was a pity to see South Africa, which boasts of some of the greatest names of the sport, fail to post even 200 runs in both innings, with skipper Dean Elgar’s 77 off 156 balls today failing to save the team. Quinton de Kock will miss the next Test as he will be away on paternity leave, and this will make it easier for India to claim their first series win in South Africa, after six series defeats and one draw since they first toured here in 1992. Pace like fire For India, the four pacers took 18 wickets between them and Ravichandran Ashwin wrapped up the South African tail in the second session to complete the formalities. The three men who won the match for India were vice-captain KL Rahul for that first innings hundred that gave the team a big platform, the supremely talented Mohammed Shami (5/44 and 3/63) who had a match-haul of eight wickets, and the peerless Jasprit Bumrah. Bumrah is perhaps Indian cricket’s biggest gift, a freaky fast bowler who can provide moments of magic, as he did on the fourth evening to put India right on top. Mohammed Siraj and Shardul Thakur were the perfect supporting cast in the win, one of the most comfortable overseas victories for Virat Kohli’s men. Indian bullies “They bullied South Africa in their backyard and it’s not often seen,” said former South Africa fast bowler Morne Morkel. Bumrah (3/50) set the tone for the final morning by removing the dogged Proteas skipper Elgar (77 off 156 balls) while Siraj (2/47) and Shami also got into the act, with the knowledge that some rain was forecast for the afternoon session. Having gauged the variable bounce of the track, skipper Elgar knew that survival would not be an option and he needed to counterattack today. With the stodgy Temba Bavuma (35 not out off 80 balls) for company, 36 runs were added in the first 45 minutes but the best part was that there was no let-up in the intensity of the Indian attack as Kohli and wicketkeeper Rishabh Pant were constantly heard cheering the bowlers on. Shami dropped Elgar off his own bowling, but Bumrah was relentless, asking probing questions of the Proteas skipper. With one delivery that was angled into the left-hander, he beat the skipper and umpire Adrian Holdstock had an easy LBW verdict on his hands. De Kock (21) came in and hit a couple of delicious shots off Bumrah, trying to knock off as many runs as possible off the target. But when the hardworking Siraj bowled one with the scrambled seam, just like the first innings, de Kock tried to cut with very little room and played on. Wiaan Mulder (1), who had a forgettable match with no wickets, got a Shami ball that was way above his skill-set: It pitched on a length, landing on the seam, and Mulder played as if it were coming in, but it straightened enough to kiss the outside edge of his bat before landing into Pant’s gloves. Ashwin then removed fast bowlers Kagiso Rabada and Lungi Ngidi off consecutive balls in the 68th over, setting off celebrations among the Indian players. — PTI","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/12/2021_12$largeimg_390511009.JPG","source_id":"tribuneindia"},{"title":"Is Big Bash cancelled: Multiple Melbourne Stars players and support staff test positive for COVID-19","link":"https://thesportsrush.com/cricket-news-is-big-bash-cancelled-multiple-melbourne-stars-players-and-support-staff-test-positive-for-covid-19/","keywords":["Cricket","BBL 11","Big Bash League","Melbourne Stars"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Is Big Bash cancelled: Multiple positive COVID-19 cases have hit the 11th season of the Big Bash League in Australia. As many as 15 Melbourne Stars players and support staff members have tested positive for COVID-19 to put the future of the ongoing 11th season of the Big Bash League under hot water. The shocking… The post Is Big Bash cancelled: Multiple Melbourne Stars players and support staff test positive for COVID-19 appeared first on The SportsRush.","content":"Is Big Bash cancelled: Multiple positive COVID-19 cases have hit the 11th season of the Big Bash League in Australia. As many as 15 Melbourne Stars players and support staff members have tested positive for COVID-19 to put the future of the ongoing 11th season of the Big Bash League under hot water. The shocking and devastating development has come as the third such news this morning after it was confirmed that a Sydney Thunder player and Australia batter Travis Head have contacted the virus. Fox Sports journalist Tom Morris has confirmed the aforementioned number by taking to his social media platform Twitter handle. Cricket Australia, on the other hand, are yet to release an official statement on the matter. As far as Stars are concerned, their BBL 11 clash against Perth Scorchers had to be postponed yesterday after one of their support staff members had returned a positive COVID-19 result. Given the dozen+ positive cases in their squad now, it appears unlikely that they will be able to play against Scorchers on January 2. Readers must note that Stars are also scheduled to face Melbourne Renegades and Adelaide Strikers on January 3 and 7 respectively. Is Big Bash cancelled? As mentioned above, Cricket Australia are yet to provide any update about the matter. Therefore, BBL 2021-22 hasn’t been cancelled or postponed for now. The possibility of all Melbourne Stars matches getting affected is quite high though. Assuming that the tournament goes ahead as planned without any serious interruption, it wouldn’t be a surprise if Cricket Australia increase the restrictions to a large extent. Sounds like Covid about to cause proper carnage in the BBL — Will Macpherson (@willis_macp) December 31, 2021 While there could also be a possibility of the rest of the tournament being played behind closed doors, all of this is nothing but speculations at this point in time especially in the absence of an official update. The post Is Big Bash cancelled: Multiple Melbourne Stars players and support staff test positive for COVID-19 appeared first on The SportsRush.","pubDate":"2021-12-31 02:26:57","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"At 29, S Africa's Quinton de Kock announces retirement from Test cricket","link":"https://www.business-standard.com/article/sports/at-29-s-africa-s-quinton-de-kock-announces-retirement-from-test-cricket-121123001498_1.html","keywords":null,"creator":null,"video_url":null,"description":"South Africa's star wicketkeeper-batter Quinton de Kock on Thursday announced his retirement from Test cricket with immediate effect, said the country's apex body, CSA","content":null,"pubDate":"2021-12-31 01:46:00","full_description":"South Africa's star wicketkeeper-batter Quinton de Kock on Thursday announced his retirement from Test cricket with immediate effect, said the country's apex body, CSA, hours after the team's defeat in the first Test against India. A former Test captain, De Kock is only 29 and it is believed that he will continue playing in the white-ball formats for the Proteas, with a lot of focus on franchise-based T20 leagues. \"De Kock has cited his intentions to spend more time with his growing family for the timing and reason for his relatively early retirement from the format. He and his wife, Sasha, are anticipating the imminent birth of their first-born child in the coming days,\" Cricket South Africa (CSA) said in a statement. On his part, the player said that it wasn't an easy decision. \"This is not a decision that I have come to very easily. I have taken a lot of time to think about what my future looks like and what needs to take priority in my life now that Sasha and I are about to welcome our first child into this world and look to grow our family beyond that,\" De Kock said. \"My family is everything to me and I want to have the time and space to be able to be with them during this new and exciting chapter of our lives.\" De Kock made his Proteas Test debut against Australia in Gqeberha in 2014. In 54 matches, he scored 3300 runs with a highest score of 141 not out, at an average of 38.82 and strike rate of 70.93. He has six centuries and 22 half-centuries under his belt along with 232 dismissals, which includes 221 catches and 11 stumpings. De Kock has also taken the third-most number of catches in the inaugural ICC World Test Championship -- 48 in 11 matches (47 catches and 1 stumping) and has a personal best of six dismissals in an innings, against England in Centurion in 2019. South Africa lost the opening Test to India by 113 runs in Centurion. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211230/thumb-121123001498.jpg","source_id":"business-standard"},{"title":"Cricket Covid: Travis Head to miss New Years Test Sydney after testing positive for COVID-19","link":"https://thesportsrush.com/cricket-news-cricket-covid-travis-head-to-miss-new-years-test-sydney-after-testing-positive-for-covid-19/","keywords":["Cricket","Ashes 2021-22","Australia","England","Travis Head"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Travis Head tests positive for COVID-19: The Australian batter won’t be travelling to Sydney for 4th Ashes Test 2022. COVID-19 continues to take a toll on Australian cricket as batter Travis Head has returned a positive test hours before the Test team was scheduled to travel from Melbourne to Sydney for the New Year’s Test.… The post Cricket Covid: Travis Head to miss New Years Test Sydney after testing positive for COVID-19 appeared first on The SportsRush.","content":"Travis Head tests positive for COVID-19: The Australian batter won’t be travelling to Sydney for 4th Ashes Test 2022. COVID-19 continues to take a toll on Australian cricket as batter Travis Head has returned a positive test hours before the Test team was scheduled to travel from Melbourne to Sydney for the New Year’s Test. Head has followed the likes of England head coach Chris Silverwood’s family member, match referee David Boon, Melbourne Stars’ support staff and a Sydney Thunder player to contact the virus in the recent days. Head, who is asymptomatic, will isolate with his partner for seven days in Melbourne before moving to Hobart for the fifth Test assuming he recovers in time. While Scorchers vs Stars BBL 2021-22 match was postponed yesterday, Strikers vs Thunder New Year’s eve clash is likely to walk the same path today. Fourth Ashes 2021-22 Test, on the other hand, will be played as per the original plan from January 5. “As part of our testing procedures, we are PCR testing players, their families and our support staff daily,” a Cricket Australia spokesperson was quoted as saying by cricket.com.au. “Unfortunately, Travis returned a positive Covid-19 result earlier today. Thankfully, he is asymptomatic at this stage. We anticipate that he will be available to play in the fifth Vodafone men’s Ashes Test in Hobart.” Who will replace Travis Head for Ashes 2021-22 New Years Test Sydney? Although with a delay due to Head testing positive, both the teams and their families will be travelling to Sydney separately via charter flights today itself after undergoing PCR and RAT tests this morning. Australia, who have a reserve batter in Usman Khawaja in their 15-member Ashes squad, are more than likely to include the 35-year old batter into their Playing XI for the fourth Test after more than a couple of years. However, Australia have still included Perth Scorchers-pair of Mitchell Marsh and Josh Inglis and Melbourne Renegades captain Nic Maddinson as cover for the fourth Test is Sydney. While Marsh has been is stellar T20 form, Inglis and Maddinson haven’t had the best of Big Bash seasons so far. The comedy #ashes narrative will only be complete when Mitch Marsh scores a century in a session to seal a 5-0 whitewash in front of a capacity crowd at Hobart. — Isabelle Westbury (@izzywestbury) December 31, 2021 Having scored 352 runs in five Tests at an average of 70.40 at the Sydney Cricket Ground including one century and half-century each, Khawaja would be hoping to continuing the same form to replace an in-form Head. It is noteworthy that Head is Australia’s highest run-scorer in Ashes 2021-22 on the back of scoring 248 runs at an average and strike rate of 62 and 86.71 respectively including a century and half-century. The post Cricket Covid: Travis Head to miss New Years Test Sydney after testing positive for COVID-19 appeared first on The SportsRush.","pubDate":"2021-12-31 01:40:59","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Travis Head tests positive to COVID, three new names added to squad for third Ashes Test in Sydney - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiVWh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIxLTEyLTMxL3RyYXZpcy1oZWFkLXRlc3RzLXBvc2l0aXZlLWZvci1jb3ZpZC8xMDA3MzI5MDTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Travis Head tests positive to COVID, three new names added to squad for third Ashes Test in Sydney  ABC NewsAussies rocked as Test star contracts Covid  NEWS.com.auTravis Head tests positive to COVID-19, will miss Sydney Test  Wide World of SportsAussie cricket legend hit by positive Covid test  Herald SunBig Bash cancelled due to COVID-19 outbreak, Ashes match referee David Boon tests positive to virus  ABC NewsView Full coverage on Google News","content":null,"pubDate":"2021-12-31 01:29:29","image_url":null,"source_id":"google"},{"title":"Aussies rocked as Test star contracts Covid","link":"https://www.cairnspost.com.au/sport/cricket/reports-covid19-cases-rock-australian-test-squad-bbl/news-story/145d1c2acd984f94d6e640a3a80c3d71","keywords":["Big Bash News","Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australian cricket star Travis Head will miss the next Ashes Test match in Sydney after contracting Covid-19.","content":null,"pubDate":"2021-12-31 01:29:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Aussies rocked as Test star contracts Covid","link":"https://www.news.com.au/sport/cricket/reports-covid19-cases-rock-australian-test-squad-bbl/news-story/145d1c2acd984f94d6e640a3a80c3d71","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket star Travis Head will miss the next Ashes Test match in Sydney after contracting Covid-19.","content":null,"pubDate":"2021-12-31 01:17:00","full_description":"Australian cricket star Travis Head will miss the next Ashes Test match in Sydney after contracting Covid-19. Cricket Australia confirmed the batter is asymptomatic but returned a positive PCR test and will remain in Melbourne to isolate for seven days with his partner. CA said in a statement: “The remainder of the Australian squad, their families and the support staff have undergone PCR and RAT tests this morning. Both the Australian and England squads are expected to separately travel to Sydney as planned today. “As a precautionary measure Mitchell Marsh, Nic Maddinson and Josh Inglis have joined the Australian squad as additional cover.” A Cricket Australia spokesperson added: “As part of our testing procedures, we are PCR testing players, their families and our support staff daily. Unfortunately, Travis returned a positive Covid-19 result earlier today. Thankfully, he is asymptomatic at this stage. We anticipate that he will be available to play in the fifth Vodafone men’s Ashes Test in Hobart. “We are grateful to our exceptional medical staff for all the work they have done throughout this series and we will continue to work with and support the players, their families and staff from both teams.” Usman Khawaja has been the spare batter in the Test squad and looms as Head’s likely replacement in the middle order for the Sydney Test, which begins on Januray 5. The Queenslander was close to being chosen for the start of the series in Brisbane but lost out in a selection shoot-out with Head. Head has been a shining light for Australia against England, returning to the Test side after being dropped last summer. He scored a spectacular 152 at the Gabba and followed that up with a sparkling half century in Adelaide. Victorian batter Nic Maddinson has been in fine form for the past two summers and is another option for selectors if they want to blood a younger player than the 35-year-old Khawaja, after drafting the left-hander into the squad because of Head’s withdrawal. The other two additions — Mitchell Marsh and Josh Inglis — are more unlikely replacements because they are an all-rounder and wicketkeeper respectively, rather than specialist batters. Cameron Green has impressed with the ball as the all-rounder in the Aussie side this summer and Alex Carey has, for the most part, been tidy with the gloves since taking over from former captain Tim Paine. Meanwhile, Code cricket writer Daniel Cherny reports positive cases have also been identified at several BBL franchises. “Players at multiple BBL clubs have tested positive for Covid-19, placing a cloud on the Big Bash League’s immediate future,” Cherny said on Twitter. Foxsports.com.au is reporting the New Year’s Eve clash between Adelaide Strikers and Sydney Thunder is in doubt after a Thunder player tested positive. The latest developments come after ICC match referee David Boon — the former Australian batter who was officiating the Ashes — tested positive to Covid and was ruled out of the Sydney Test. England has also been hit hard by the virus. On Thursday it was confirmed coach Chris Silverwood will miss the fourth Test in Sydney because he needs to isolate in Melbourne after being identified as a close contact to a positive Covid-19 case. The Covid outbreak within the England camp, which rose from four to six during the Boxing Day Test , grew again as another family member tested positive — bringing the total number of cases to seven. Silverwood — who is under pressure to keep his job — must isolate in Melbourne with his family for 10 days, meaning he won’t be able to take charge of the team for the Test at the SCG. The head coach isn’t the only key member of the England camp to be affected. Bowling coach Jon Lewis, spin bowling coach Jeetan Patel and strength and conditioning coach Darren Veness are also in isolation after contracting the virus. Batting coach Graham Thorpe will take over from Silverwood for the Sydney Test, which will see Joe Root and his men try to restore some pride after being thrashed by an innings and 14 runs in Melbourne . There were fears for Chris Cairns’ life earlier this year after he suffered life-threatening medical trauma, but the cricketer is back at the crease. The horror show we call 2021 threw another curve ball Steve Smith’s way when he finally thought he was done with this dog of a year. Eyebrows have been raised and fans are asking if there’s more to the story after one of cricket’s most recognisable faces decided to walk away.","image_url":null,"source_id":"news"},{"title":"Sydney Thunder COVID positive: Will Strikers vs Thunder BBL 2021-22 match be played as originally planned?","link":"https://thesportsrush.com/cricket-news-sydney-thunder-covid-positive-will-strikers-vs-thunder-bbl-2021-22-match-be-played-as-originally-planned/","keywords":["Cricket","Adelaide Strikers","BBL 11","Big Bash League","Sydney Thunder"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sydney Thunder COVID positive: A player from Sydney Thunder has returned a positive COVID-19 result in Adelaide. The 28th match of the ongoing 11th season of the Big Bash League is slated to be played between Adelaide Strikers and Sydney Thunder in Adelaide today. Having won only one out of their six matches this season… The post Sydney Thunder COVID positive: Will Strikers vs Thunder BBL 2021-22 match be played as originally planned? appeared first on The SportsRush.","content":"Sydney Thunder COVID positive: A player from Sydney Thunder has returned a positive COVID-19 result in Adelaide. The 28th match of the ongoing 11th season of the Big Bash League is slated to be played between Adelaide Strikers and Sydney Thunder in Adelaide today. Having won only one out of their six matches this season so far, Adelaide Strikers are reeling at the penultimate position on the points table. Sydney Thunder, on the other hand, have done comparatively better by winning and losing three matches each till now to be at the fourth position on the points table. In the 14 matches that Strikers and Thunder have played against each other in the BBL, both of them have won six matches which speaks highly about their intense rivalry over the years. As far as playing at the Adelaide Oval is concerned, visitors Thunder have a slight advantage after having won four as compared to Strikers’ three victories. Let’s finish 2021 with a W! #BBL11 #ThunderNation pic.twitter.com/MWniNSJwVu — Sydney Thunder (@ThunderBBL) December 30, 2021 Sydney Thunder COVID positive result In what will be a significant blow, BBL 2021-22’s New Year’s eve clash appears to be going the same way as Perth Scorchers vs Melbourne Stars match in Melbourne yesterday. While BBL or Cricket Australia are yet to confirm anything, Fox Sports have confirmed the presence of a positive COVID-19 result in Thunder’s camp. Unlike Thursday where a support staff member had contacted the virus, a player from Sydney Thunder is said to have tested positive for COVID-19. All other Thunder’s players and support staff are awaiting PCR results. Meanwhile, the Strikers’ contingent is said to be absolutely safe. Even if the remaining Thunder’s players return with COVID-19 negative tests, it would be unlikely for this match to continue as a precautionary measure. In such a situation, it would be played at a later date much like the Scorchers vs Stars fixture from December 30. More to follow… The post Sydney Thunder COVID positive: Will Strikers vs Thunder BBL 2021-22 match be played as originally planned? appeared first on The SportsRush.","pubDate":"2021-12-31 01:07:39","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Babar nominated for ODI Player of the Year award","link":"https://www.thenews.com.pk/print/921249-babar-nominated-for-odi-player-of-the-year-award","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: The International Cricket Council has nominated Pakistan’s all-format captain Babar Azam for the Men’s ODI Player of the Year award.Babar is the third Pakistani player after Mohammad Rizwan and Fatima Sana to be nominated for this year’s ICC awards. On Wednesday, Rizwan...","content":null,"pubDate":"2021-12-31 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Abdul Rahman â€” a coach par excellence in domestic cricket","link":"https://www.thenews.com.pk/print/921250-abdul-rahman-a-coach-par-excellence-in-domestic-cricket","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: KPK continues to produce top results in domestic cricket. The province has enormous talent. And it can be seen through the composition of their brigade for this year’s Quaid-e-Azam Trophy which they won by conquering Northern by 169 runs in the final here at the National Stadium on...","content":null,"pubDate":"2021-12-31 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Aussie Ashes star tests positive for COVID-19","link":"https://wwos.nine.com.au/cricket/ashes-2021-australian-batter-travis-head-tests-positive-for-covid19/27a06340-178e-4525-b7a2-a885e5a0b037","keywords":null,"creator":["wwos"],"video_url":null,"description":"The Australian camp has been rocked ahead of the fourth Ashes Test, with the news that a player has tested positive for COVID-19.","content":"The Australian camp has been rocked ahead of the fourth Ashes Test, with Travis Head testing positive for COVID-19.The team's flight to Sydney has been delayed, and the middle-order batter ruled out of the match, which starts on Thursday at the SCG.\"Head is asymptomatic and will remain in Melbourne and isolate with his partner for seven days in line with Victorian Government Health requirements,\" a Cricket Australia statement read.READ MORE: Cricket legend David Boon positive for COVID-19READ MORE: Bailey opens door for Swepson selectionThe remainder of the squad, as well as families and staff, has undergone PCR and RAT tests.Mitch Marsh, Nic Maddinson and Josh Inglis have joined the squad as cover.\"As part of our testing procedures, we are PCR testing players, their families and our support staff daily. Unfortunately, Travis returned a positive COVID-19 result earlier today. Thankfully, he is asymptomatic at this stage,\" a CA spokesperson said.Head is expected to be available for selection for the fifth Test in Hobart.\"We are grateful to our exceptional medical staff for all the work they have done throughout this series and we will continue to work with and support the players, their families and staff from both teams,\" the spokesperson said.It comes just a day after it was confirmed that English coach Chris Silverwood would miss the match at the SCG after a member of his family tested positive.More to come...","pubDate":"2021-12-31 00:51:43","full_description":"The Australian camp has been rocked ahead of the fourth Ashes Test, with Travis Head testing positive for COVID-19. The team's flight to Sydney has been delayed, and the middle-order batter ruled out of the match, which starts on Thursday at the SCG. \"Head is asymptomatic and will remain in Melbourne and isolate with his partner for seven days in line with Victorian Government Health requirements,\" a Cricket Australia statement read. READ MORE: Cricket legend David Boon positive for COVID-19 READ MORE: Bailey opens door for Swepson selection The remainder of the squad, as well as families and staff, has undergone PCR and RAT tests. Mitch Marsh, Nic Maddinson and Josh Inglis have joined the squad as cover. \"As part of our testing procedures, we are PCR testing players, their families and our support staff daily. Unfortunately, Travis returned a positive COVID-19 result earlier today. Thankfully, he is asymptomatic at this stage,\" a CA spokesperson said. Head is expected to be available for selection for the fifth Test in Hobart. \"We are grateful to our exceptional medical staff for all the work they have done throughout this series and we will continue to work with and support the players, their families and staff from both teams,\" the spokesperson said. It comes just a day after it was confirmed that English coach Chris Silverwood would miss the match at the SCG after a member of his family tested positive. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400906/281221cricketwin.png","source_id":"nine"},{"title":"Leather-flingers strike back: Why short-form cricket has restored bowling’s dominance","link":"https://www.smh.com.au/sport/cricket/leather-flingers-strike-back-why-short-form-cricket-has-restored-bowling-s-dominance-20211231-p59l1x.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Knox"],"video_url":null,"description":"Around the world, Test cricket is seeing a resurgence in bowling. This, along with the commensurate decline in batting, is an unforeseen consequence of the Twenty20 revolution.","content":null,"pubDate":"2021-12-31 00:30:00","full_description":"Scott Boland is the popularly-elected president of as many constituencies as there are balls in an over: Indigenous Australians, Victorians, ‘MCG specialists’, debutants, mid-career journeymen, shy and retiring nice blokes. Those are all exceptions to the rule and Christmas gifts to put a smile on every face. There is one group Boland represents more staunchly, a group enjoying a sustained and overdue golden age: the proletarian union of leather-flingers. Boland’s six for seven in Melbourne conjured names like Albert Trott and Tom Kendall, whose bowling records he almost equalled. That Australia can score 267 runs in a Test match and still win by an innings takes us back to the 19th century, that brief dawn of Test cricket before it became a batsmen’s game, a time when demanding pitches and clever bowlers ensured that every run had to be earned. For this to happen today, in an era dominated by Twenty20, a format designed for the pleasure of batters and battering, should not be as much a surprise as it first appears. Around the world, Test cricket is seeing a resurgence in bowling. This, along with the commensurate decline in batting, is an unforeseen consequence of the Twenty20 revolution. The lament about England’s hopelessness in the Ashes series, and about the structural causes behind it, along with the low scores in the first Test match in South Africa, carry a big asterisk. Those who look at these performances and say Test cricket is going down the gurgler are those who have been conditioned by decades of constructing and defining cricket as a game of run-scoring. Scott Boland of Australia celebrates after dismissing Joe Root. Credit: Getty If batters were scoring hundreds and punishing bowlers for five days of boring draws, few would be wringing their hands over the death of Test cricket. Most of cricket’s leaders and influencers are batters, unhappy with the ineptitude they are seeing. What’s really happening is that bowlers, when they are given some encouragement by curators, are getting better at a faster rate than batters. And the chief cause for this, outrageously and joyously, is Twenty20. It has been a summer for bowlers. For Australia Mitchell Starc, Patrick Cummins, Josh Hazlewood, Jhye Richardson, Nathan Lyon and Boland have all been outstanding. For England, James Anderson could have routed Australia each time he has bowled, while Mark Wood and Ollie Robinson have also had the better of their opponents at different times. Over in South Africa, Mohammed Shami, Jasprit Bumrah, Lungi Ngidi and Kagiso Rabada have bossed their batting counterparts. The Test cricket year has been a happy one for bowlers wherever pitches have given them a fair go. Hang on, wasn’t Twenty20 meant to demoralise and enslave the modern bowler? Structural problems have been blamed for England’s poor batting, particularly the priority given to short-form cricket over the red-ball game. But the conditions that have produced the dearth of capable English Test batters also apply in Australia and India, and all around the world. Just as England has marginalised its county championship, Australia has pushed the Sheffield Shield and India the Ranji Trophy to the fringes. Long-form red-ball cricket is being downgraded as much in Australia as it is in England. Kurtis Patterson crunches one through the covers in the Sheffield Shield. Credit: Getty Australia’s preparation for these Ashes was just as skimpy as England’s. Subtract a few freakish talents and Marnus Labuschagne’s habit of snicking balls to people who can’t catch, and beneath the surface Australia is suffering from the same deficit of solid Test batters as England and most of the cricket world. It doesn’t matter whether teams have been playing too little Test cricket, as South Africa’s captain Temba Bavuma complained, or too much, like England’s bubble-weary crew, globally Test batting is in a miserable state. Or, to put it another way, Test bowling is pretty brilliant right now. The decline in batting and the strength in bowling stems from the same source. Watch any of the dozen Big Bash League games this week, and two aspects jump out. Batters are getting better at skills that have no place in Test cricket. Trick shots, clouts into the next suburb, improvisations of ramping and flipping and shovelling the ball over the wicketkeeper’s head – it’s quite mesmerising how even glorified grade cricketers have refined these shots, none of which would help them survive an hour against Cummins or Starc with a red ball on a sporting pitch. Fed on a sugary diet of easy surfaces and snug boundaries, in a game that can be won with a few minutes of steady concentration, batters have become sideshow artists. Bowlers, on the other hand, were meant to be fodder for Twenty20. As a modern-day Dr Grace might say, they’ve come to watch me bat, not you bowl. But things have taken a curious turn. The demand for control and accuracy is so high, bowlers must improve or perish. Scott Boland has played seven seasons of Twenty20 cricket for the Melbourne Stars, Rising Pune Supergiants and Hobart Hurricanes, not to mention countless short-form games at club level. Where does he develop the control to land the ball exactly on the spot when he gets his chance in a Test match? Where have Starc and Cummins played most of their cricket in the past three years? The Twenty20 arena is so unforgiving of inaccuracy that the bowler’s only path to survival is to upskill urgently. Some of the wrist spin in Twenty20, a decade after it was pronounced dead, is beyond excellent, and will soon burst back into Tet cricket. Sean Abbott bending the back for the Sixers in the Big Bash. Credit: Getty Bowlers can transfer these improvements to red-ball cricket more easily than batters can transfer theirs. While the bowlers have adapted gratefully to red-ball cricket, few Australian or English batters have been able to locate any gear between first and fifth. Ben Stokes and Jos Buttler can block all day or slog all night, but seemingly nothing in between. Smith and Labuschagne have tried to defend their way into Test form, lingering long at the wicket while hoping their fluency comes back. Travis Head played a match-winning Jackson Pollock of an innings in Brisbane, all streaks and flamboyant gestures without ever calming the nerves. Only England’s Joe Root and Australia’s David Warner have been repeatedly able to produce anything resembling their natural game in these Ashes so far. The poverty of batting does not have to equal a poverty of Test cricket. Nobody expected this, but the incursion of Twenty20 into professional cricketers’ lives has produced some of the most skilful bowling in decades. Test cricket – good Test cricket – doesn’t have to be biased in favour of the bat. Are we seeing woeful batting around the world, or a transformative improvement in bowling? Historically, bowlers have seldom had it their way, and it probably won’t last. Administrators and their broadcasting pals have too much at stake to keep providing conditions that allow bowlers three days of fun. But fun it has been, to see the bowlers out-adapt the batters. Instead of complaining about how low one side of the scale has dipped, we might cheer for how high the other side has risen.","image_url":null,"source_id":"smh"},{"title":"Leather-flingers strike back: Why short-form cricket has restored bowling’s dominance","link":"https://www.theage.com.au/sport/cricket/leather-flingers-strike-back-why-short-form-cricket-has-restored-bowling-s-dominance-20211231-p59l1x.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Knox"],"video_url":null,"description":"Around the world, Test cricket is seeing a resurgence in bowling. This, along with the commensurate decline in batting, is an unforeseen consequence of the Twenty20 revolution.","content":null,"pubDate":"2021-12-31 00:30:00","full_description":"Scott Boland is the popularly-elected president of as many constituencies as there are balls in an over: Indigenous Australians, Victorians, ‘MCG specialists’, debutants, mid-career journeymen, shy and retiring nice blokes. Those are all exceptions to the rule and Christmas gifts to put a smile on every face. There is one group Boland represents more staunchly, a group enjoying a sustained and overdue golden age: the proletarian union of leather-flingers. Boland’s six for seven in Melbourne conjured names like Albert Trott and Tom Kendall, whose bowling records he almost equalled. That Australia can score 267 runs in a Test match and still win by an innings takes us back to the 19th century, that brief dawn of Test cricket before it became a batsmen’s game, a time when demanding pitches and clever bowlers ensured that every run had to be earned. For this to happen today, in an era dominated by Twenty20, a format designed for the pleasure of batters and battering, should not be as much a surprise as it first appears. Around the world, Test cricket is seeing a resurgence in bowling. This, along with the commensurate decline in batting, is an unforeseen consequence of the Twenty20 revolution. The lament about England’s hopelessness in the Ashes series, and about the structural causes behind it, along with the low scores in the first Test match in South Africa, carry a big asterisk. Those who look at these performances and say Test cricket is going down the gurgler are those who have been conditioned by decades of constructing and defining cricket as a game of run-scoring. Scott Boland of Australia celebrates after dismissing Joe Root. Credit: Getty If batters were scoring hundreds and punishing bowlers for five days of boring draws, few would be wringing their hands over the death of Test cricket. Most of cricket’s leaders and influencers are batters, unhappy with the ineptitude they are seeing. What’s really happening is that bowlers, when they are given some encouragement by curators, are getting better at a faster rate than batters. And the chief cause for this, outrageously and joyously, is Twenty20. It has been a summer for bowlers. For Australia Mitchell Starc, Patrick Cummins, Josh Hazlewood, Jhye Richardson, Nathan Lyon and Boland have all been outstanding. For England, James Anderson could have routed Australia each time he has bowled, while Mark Wood and Ollie Robinson have also had the better of their opponents at different times. Over in South Africa, Mohammed Shami, Jasprit Bumrah, Lungi Ngidi and Kagiso Rabada have bossed their batting counterparts. The Test cricket year has been a happy one for bowlers wherever pitches have given them a fair go. Hang on, wasn’t Twenty20 meant to demoralise and enslave the modern bowler? Structural problems have been blamed for England’s poor batting, particularly the priority given to short-form cricket over the red-ball game. But the conditions that have produced the dearth of capable English Test batters also apply in Australia and India, and all around the world. Just as England has marginalised its county championship, Australia has pushed the Sheffield Shield and India the Ranji Trophy to the fringes. Long-form red-ball cricket is being downgraded as much in Australia as it is in England. Kurtis Patterson crunches one through the covers in the Sheffield Shield. Credit: Getty Australia’s preparation for these Ashes was just as skimpy as England’s. Subtract a few freakish talents and Marnus Labuschagne’s habit of snicking balls to people who can’t catch, and beneath the surface Australia is suffering from the same deficit of solid Test batters as England and most of the cricket world. It doesn’t matter whether teams have been playing too little Test cricket, as South Africa’s captain Temba Bavuma complained, or too much, like England’s bubble-weary crew, globally Test batting is in a miserable state. Or, to put it another way, Test bowling is pretty brilliant right now. The decline in batting and the strength in bowling stems from the same source. Watch any of the dozen Big Bash League games this week, and two aspects jump out. Batters are getting better at skills that have no place in Test cricket. Trick shots, clouts into the next suburb, improvisations of ramping and flipping and shovelling the ball over the wicketkeeper’s head – it’s quite mesmerising how even glorified grade cricketers have refined these shots, none of which would help them survive an hour against Cummins or Starc with a red ball on a sporting pitch. Fed on a sugary diet of easy surfaces and snug boundaries, in a game that can be won with a few minutes of steady concentration, batters have become sideshow artists. Bowlers, on the other hand, were meant to be fodder for Twenty20. As a modern-day Dr Grace might say, they’ve come to watch me bat, not you bowl. But things have taken a curious turn. The demand for control and accuracy is so high, bowlers must improve or perish. Scott Boland has played seven seasons of Twenty20 cricket for the Melbourne Stars, Rising Pune Supergiants and Hobart Hurricanes, not to mention countless short-form games at club level. Where does he develop the control to land the ball exactly on the spot when he gets his chance in a Test match? Where have Starc and Cummins played most of their cricket in the past three years? The Twenty20 arena is so unforgiving of inaccuracy that the bowler’s only path to survival is to upskill urgently. Some of the wrist spin in Twenty20, a decade after it was pronounced dead, is beyond excellent, and will soon burst back into Tet cricket. Sean Abbott bending the back for the Sixers in the Big Bash. Credit: Getty Bowlers can transfer these improvements to red-ball cricket more easily than batters can transfer theirs. While the bowlers have adapted gratefully to red-ball cricket, few Australian or English batters have been able to locate any gear between first and fifth. Ben Stokes and Jos Buttler can block all day or slog all night, but seemingly nothing in between. Smith and Labuschagne have tried to defend their way into Test form, lingering long at the wicket while hoping their fluency comes back. Travis Head played a match-winning Jackson Pollock of an innings in Brisbane, all streaks and flamboyant gestures without ever calming the nerves. Only England’s Joe Root and Australia’s David Warner have been repeatedly able to produce anything resembling their natural game in these Ashes so far. The poverty of batting does not have to equal a poverty of Test cricket. Nobody expected this, but the incursion of Twenty20 into professional cricketers’ lives has produced some of the most skilful bowling in decades. Test cricket – good Test cricket – doesn’t have to be biased in favour of the bat. Are we seeing woeful batting around the world, or a transformative improvement in bowling? Historically, bowlers have seldom had it their way, and it probably won’t last. Administrators and their broadcasting pals have too much at stake to keep providing conditions that allow bowlers three days of fun. But fun it has been, to see the bowlers out-adapt the batters. Instead of complaining about how low one side of the scale has dipped, we might cheer for how high the other side has risen.","image_url":null,"source_id":"theage"},{"title":"QDK retirement: Was Quinton de Kock South Africa’s best Test wicket-keeper batter?","link":"https://thesportsrush.com/cricket-news-qdk-retirement-was-quinton-de-kock-south-africas-best-test-wicket-keeper-batter/","keywords":["Cricket","Quinton De Kock","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"QDK retirement: The South African wicket-keeper batter astonishingly called time upon his Test career a few hours ago. South Africa’s Quinton de Kock surprised one and all by retiring from Test cricket a few hours after the culmination of first South Africa vs India Test match in Centurion. de Kock, 29, was slated for a… The post QDK retirement: Was Quinton de Kock South Africa’s best Test wicket-keeper batter? appeared first on The SportsRush.","content":"QDK retirement: The South African wicket-keeper batter astonishingly called time upon his Test career a few hours ago. South Africa’s Quinton de Kock surprised one and all by retiring from Test cricket a few hours after the culmination of first South Africa vs India Test match in Centurion. de Kock, 29, was slated for a paternity leave to miss the remaining two Tests for he and wife Sasha de Kock are expecting their first child in the next few days. Stating that “family is everything” to him, de Kock opted for “not an easy” decision in order to “have the time and space to be able to be with them”. “I love Test cricket and I love representing my country and all that it comes with,” de Kock said in an official statement issued by Cricket South Africa. “I’ve enjoyed the ups and the downs, the celebrations and even the disappointments, but now I’ve found something that I love even more. In life, you can buy almost everything except for time, and right now, it’s time to do right by the people that mean the most to me.” QDK retirement After making his white-ball debuts in the previous two years, de Kock was handed with a maiden Test cap in February 2014. In 54 Tests, de Kock had scored 3,300 runs at an average and strike rate of 38.82 and 70.93 respectively. For a batter who batted at No. 6 and 7 in 68 out of 91 Test innings, scoring six centuries and 22 half-centuries is no mean feat. Before de Kock, only former England wicket-keeper batter Alan Knott, former India captain Kapil Dev and former New Zealand captain Brendon McCullum had five Test centuries at No. 7 to their name. Former Australia wicket-keeper batter Adam Gilchrist (12) is the only player with more Test centuries at No. 7. Since his debut, de Kock is the 20th highest run-scorer in Test cricket. However, his real impact can be judged from the fact that no other wicket-keeper batter has scored more runs than him in this period. Most Test centuries at No. 7: 12 – Gilchrist 5 – Knott, Kapil, McCullum & de Kock Adam Gilchrist and Quinton de Kock are the only two wicket-keeper batters with a Test average and strike rate of >40 and >70 respectively (minimum 5 Tests). — Dixit Bhargav (@dixitbhargav09) December 31, 2021 Was Quinton de Kock South Africa’s best Test wicket-keeper batter? de Kock finishes cricket’s ancestral format as South Africa’s 15th highest Test run-scorer. As far as wicket-keeping is concerned, de Kock (232 dismissals) is way behind former South Africa wicket-keeper and current head coach Mark Boucher (553 dismissals). Overall, de Kock’s 221 catches and 11 stumping dismissals put him in the 12th position in the list of most dismissals as a wicket-keeper in Test cricket. Had de Kock continued in the same way for a few more years, he would’ve surely surpassed what Boucher (5,515 runs at 30.30) had achieved with the bat. Having said that, matching Boucher’s wicket-keeping dismissals would’ve been some task. de Kock, who played almost one-third of Boucher’s (147) Tests, appeared to be a much better batter but the same can’t be said of the job behind the wickets. MSD Test retirement In a strange co-incidence, de Kock has joined former India captain Mahendra Singh Dhoni (also the captain then) as a wicket-keeper batter to retire midway through a Test series on December 30. Dhoni, who had retired from Test cricket seven years ago, had scored 4,876 runs in 90 Tests at an average and strike rate of 38.09 and 59.11 respectively. In his first 54 Tests, Dhoni had scored 2,925 runs at an average of 40.06 including four centuries and 20 half-centuries. The post QDK retirement: Was Quinton de Kock South Africa’s best Test wicket-keeper batter? appeared first on The SportsRush.","pubDate":"2021-12-31 00:12:28","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Man City star assaulted by 'four cowards'","link":"https://wwos.nine.com.au/football/epl-2021-manchester-city-defender-joao-cancelo-victim-of-cowardly-assault/04a41b66-0e74-41fd-9654-08fb409ebea9","keywords":null,"creator":["wwos"],"video_url":null,"description":"Manchester City player Joao Cancelo has posted a photo of scars on his face after being attacked by four people on Thursday.","content":"Manchester City player Joao Cancelo has posted a photo of scars on his face after being attacked by four people on Thursday.The Portugal defender did not say on his Instagram Story post where the attack happened.READ MORE: Cricket legend David Boon positive for COVID-19READ MORE: Bailey opens door for Swepson selectionREAD MORE: Barcelona devastated by COVID cases“Unfortunately today I was assaulted by four cowards who hurt me and tried to hurt my family,” Cancelo wrote. “When you show resistance this is what happens. They managed to take all my jewelry and leave me with my face with this state.\"The photo showed a deep cut above his right eye.“I don't know how there are people with such meanness,” he wrote. https://twitter.com/FootballlForAll/status/1476690402795216896“The most important thing for me is my family and luckily they are all OK. And I after many obstacles in my life, this is just one more that I will overcome. Firm and strong, like always.”City did not reply to a message seeking comment on Thursday night.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-30 23:48:37","full_description":"Manchester City player Joao Cancelo has posted a photo of scars on his face after being attacked by four people on Thursday. The Portugal defender did not say on his Instagram Story post where the attack happened. READ MORE: Cricket legend David Boon positive for COVID-19 READ MORE: Bailey opens door for Swepson selection READ MORE: Barcelona devastated by COVID cases “Unfortunately today I was assaulted by four cowards who hurt me and tried to hurt my family,” Cancelo wrote. “When you show resistance this is what happens. They managed to take all my jewelry and leave me with my face with this state.\" The photo showed a deep cut above his right eye. “I don't know how there are people with such meanness,” he wrote. “The most important thing for me is my family and luckily they are all OK. And I after many obstacles in my life, this is just one more that I will overcome. Firm and strong, like always.” City did not reply to a message seeking comment on Thursday night. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/401293/pickerimage.jpg","source_id":"nine"},{"title":"South African cricket star Quinton de Kock retires from Test cricket - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiWmh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIxLTEyLTMxL3F1aW50b24tZGUta29jay1yZXRpcmVzLWZyb20tdGVzdC1jcmlja2V0LzEwMDczMjUzMtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"South African cricket star Quinton de Kock retires from Test cricket  ABC NewsCricket shocked as star retires at just 29  NEWS.com.auSouth Africa's Quinton de Kock quits Test cricket at age 29  Wide World of SportsDe Kock shocks by calling time on Test career  cricket.com.auSouth Africa shock as De Kock quits Tests  7NEWSView Full coverage on Google News","content":null,"pubDate":"2021-12-30 22:11:12","image_url":null,"source_id":"google"},{"title":"England considering shock bid for Ponting","link":"https://www.cairnspost.com.au/sport/cricket/england-considering-shock-bid-for-ponting/video/a737d4a918d2e681ab3df729071bec65","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: With England's head coach days appearing to be numbered, rumours are circling that they may consider a shock bid for Ricky Ponting.","content":null,"pubDate":"2021-12-30 21:40:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"England considering shock bid for Ponting","link":"https://www.news.com.au/sport/cricket/england-considering-shock-bid-for-ponting/video/a737d4a918d2e681ab3df729071bec65","keywords":null,"creator":null,"video_url":null,"description":"Cricket: With England's head coach days appearing to be numbered, rumours are circling that they may consider a shock bid for Ricky Ponting.","content":null,"pubDate":"2021-12-30 21:40:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Paralysed cricket star’s heartwarming update","link":"https://www.cairnspost.com.au/sport/cricket/cricket-great-chris-cairns-back-at-the-crease-after-lifethreatening-stroke-paralysis/news-story/6d2ace2a2e9f483e1780ea6eb1e58c4b","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Former New Zealand all-rounder Chris Cairns is back holding a cricket bat as he continues to recover from the life-threatening injuries he suffered four months ago.","content":null,"pubDate":"2021-12-30 21:37:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Paralysed cricket star’s heartwarming update","link":"https://www.news.com.au/sport/cricket/cricket-great-chris-cairns-back-at-the-crease-after-lifethreatening-stroke-paralysis/news-story/6d2ace2a2e9f483e1780ea6eb1e58c4b","keywords":null,"creator":null,"video_url":null,"description":"Former New Zealand all-rounder Chris Cairns is back holding a cricket bat as he continues to recover from the life-threatening injuries he suffered four months ago.","content":null,"pubDate":"2021-12-30 21:37:00","full_description":"Former New Zealand all-rounder Chris Cairns is back holding a cricket bat as he continues to recover from the life-threatening injuries he suffered four months ago. The Kiwi cricket great shared a post on social media taking a dip in the pool and playing backyard cricket over the Christmas period in Canberra. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . Backyard cricket & pool time = summer. Happy to be here, grateful for great mates. âï¸â¤ï¸ð #notdoneyet #backyardcricket #mates #summer pic.twitter.com/4Fp197aC3r In August, Cairns collapsed in his Canberra home and was transferred to Sydney for emergency heart surgery to combat a tear in the inner layer of the body’s main artery. He subsequently suffered a spinal stroke, resulting in leg paralysis, and is undergoing daily rehabilitation at a specialist hospital in Canberra. That rehab routine involves five hours of work in a gym, six days per week, as he attempts to strengthen muscles that have been effectively separated from his control for months now. Earlier this month Cairns was able to use a hydrotherapy pool for the first time, standing unaided in the water in an experience he described as “the most free I’ve ever felt”. Cairns revealed that the extent of his injuries means he may never walk again but that his elite sport background was helping him deal with his new reality. “Having rehabbed during a sporting career you understand mental discipline is required,” he said. “I know that some people in rehab facilities don’t have that background and they struggle with motivation to get up every day. They are not seeing many gains. “Having that background and single mindedness will play a role in helping me get to where I want to get to. Best day of rehab yet. First time using the hydrotherapy pool, first time standing unaided and to walk/float my way up the pool! Man! Iâve heard freedom is the oxygen of the soulâ¦.being able to swim and kick my legs today was the most free Iâve ever felt. ð #justkeepswimming pic.twitter.com/xmjUFSRFb3 “It would be quite easy to give up and accept, maybe this is it. I will try and squeeze everything I can in over the next 12-24 months. Having been in a career when bones and muscles take six weeks to repair, there is no timeline here. I may get a flicker in three months in one muscle but it may take nine months. “Your muscles atrophy over time and so then that takes time to build back up. It is one thing getting nerves to turn back on but then you have to build the muscle back up so you can stand and then walk. “I don’t know if I will ever walk again and I have made my peace with that,” he says. “It is now about understanding I can lead a full and enjoyable life in a wheelchair but at the same time knowing it will be different.” This story first appeared on the NZ Herald and was reproduced with permission The horror show we call 2021 threw another curve ball Steve Smith’s way when he finally thought he was done with this dog of a year. Eyebrows have been raised and fans are asking if there’s more to the story after one of cricket’s most recognisable faces decided to walk away. Brett Lee may have retired from cricket many years ago but his son found out he is still more than capable of bowling a nasty yorker.","image_url":null,"source_id":"news"},{"title":"Poms eyeing Ponting as SA legend stakes claim; Anderson’s ‘brutally honest’ admission — Ashes Daily - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMizAFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvYXNoZXMtMjAyMS1jcmlja2V0LW5ld3MtZm91cnRoLXRlc3Qtc2NnLWNocmlzLXNpbHZlcndvb2QtY29udHJhY3QtbmV4dC1lbmdsYW5kLWNvYWNoLXJpY2t5LXBvbnRpbmctamltbXktYW5kZXJzb24taW50ZXJ2aWV3L25ld3Mtc3RvcnkvYWIxZWU5MzNmMGY5NDM4NWVhOTg3YzQyYjhlYzNiOWTSAcwBaHR0cHM6Ly93d3cuZm94c3BvcnRzLmNvbS5hdS9jcmlja2V0L2FzaGVzLTIwMjEtY3JpY2tldC1uZXdzLWZvdXJ0aC10ZXN0LXNjZy1jaHJpcy1zaWx2ZXJ3b29kLWNvbnRyYWN0LW5leHQtZW5nbGFuZC1jb2FjaC1yaWNreS1wb250aW5nLWppbW15LWFuZGVyc29uLWludGVydmlldy9uZXdzLXN0b3J5L2FiMWVlOTMzZjBmOTQzODVlYTk4N2M0MmI4ZWMzYjlk?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Poms eyeing Ponting as SA legend stakes claim; Anderson’s ‘brutally honest’ admission — Ashes Daily  Fox SportsAshes 2021/22: Ricky Ponting on ECB's radar for top coaching role, Chris Silverwood in Covid isolation  The West AustralianGary Kirsten declares interest in becoming England's Test coach  ESPNcricinfoEngland considering shock bid for Punter  Fox SportsGary Kirsten: England job of interest to former India and South Africa coach if role is limited to Test cricket  Sky SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-30 21:27:09","image_url":null,"source_id":"google"},{"title":"Cricket star Steve Smith records viral video while stuck in a lift for almost an hour - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiUGh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIxLTEyLTMxL3N0ZXZlLXNtaXRoLXN0dWNrLWluLWhvdGVsLWxpZnQvMTAwNzMyNTA40gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Cricket star Steve Smith records viral video while stuck in a lift for almost an hour  ABC NewsSteve Smith trapped in late night ordeal  NEWS.com.auSteve Smith gets stuck in a lift #shorts  ESPN UKSmith trapped in lift, goes viral  Bendigo Advertiser‘Not quite the evening I had planned’: Steve Smith got stuck in a lift for an hour  Fox SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-30 21:19:04","image_url":null,"source_id":"google"},{"title":"'Shocking': Cricket world in disbelief over sad Quinton De Kock news","link":"https://au.sports.yahoo.com/cricket-quinton-de-kock-retirement-south-african-steps-down-test-cricket-204028201.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-30 20:40:28","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2021-12/643554a0-69b0-11ec-9fed-7e0563be2c98","source_id":"yahoo"},{"title":"Cricket Australia scrambling to keep Ashes on track amid Covid outbreak - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMidWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIxL2RlYy8zMC9jcmlja2V0LWF1c3RyYWxpYS1zY3JhbWJsaW5nLXRvLWtlZXAtYXNoZXMtb24tdHJhY2stYW1pZC1jb3ZpZC1vdXRicmVha9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Cricket Australia scrambling to keep Ashes on track amid Covid outbreak  The GuardianBig Bash cancelled due to COVID-19 outbreak, Ashes match referee David Boon tests positive to virus  ABC NewsAshes rocked yet again by Covid case  NEWS.com.auAshes referee and Australian cricket legend David Boon tests positive for COVID-19  Wide World of SportsEngland coach Chris Silverwood to miss fourth Ashes Test in Sydney due to COVID-19 outbreak  ABC NewsView Full coverage on Google News","content":null,"pubDate":"2021-12-30 20:31:00","image_url":null,"source_id":"google"},{"title":"Pacemen lead India to first Test win over Proteas - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL3d3dy5jcmlja2V0LmNvbS5hdS9uZXdzL21hdGNoLXJlcG9ydC9pbmRpYS1zb3V0aC1hZnJpY2EtZmlyc3QtdGVzdC1jZW50dXJpb24tc2hhbWktYnVtcmFoLWtvaGxpLWVsZ2FyLWhpZ2hsaWdodHMvMjAyMS0xMi0zMdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pacemen lead India to first Test win over Proteas  cricket.com.auIndian attack too good as visitors claim impressive first Test win in South Africa  Fox SportsIndia take first Test over Proteas  The RoarSA captain Elgar admits partnership with Markram needs to produce the goods  SowetanLIVEIndia six wickets away from victory in first Test  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2021-12-30 20:29:18","image_url":null,"source_id":"google"},{"title":"Cricket shocked as star retires at just 29","link":"https://www.news.com.au/sport/cricket/cricket-world-shocked-as-quinton-de-kock-retires-from-test-cricket-at-29/news-story/5e959e6b7d4553b7a531d0718ad33f89","keywords":null,"creator":null,"video_url":null,"description":"South African wicketkeeper-batsman Quinton de Kock announced his retirement from Test cricket with immediate effect.","content":null,"pubDate":"2021-12-30 20:23:00","full_description":"South African wicketkeeper-batsman Quinton de Kock announced his retirement from Test cricket with immediate effect. The shock announcement from de Kock, 29, came just hours after he was part of the South African team beaten by 113 runs in the first Test against India at SuperSport Park. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . De Kock said he remained committed to playing international limited overs cricket. Twice named as South African Cricketer of the Year, de Kock said in a statement that he wanted to spend more time with his family. It had already been announced he would miss the second and third Tests against India because his wife, Sasha, is about to give birth to the couple’s first child. De Kock was embroiled in controversy during the T20 World Cup in October when he refused an order from Cricket South Africa to take the knee in support of the Black Lives Matter movement. The order came shortly before a match against the West Indies and it was initially announced that de Kock had withdrawn from the match for personal reasons. After a meeting with Cricket South Africa officials, de Kock apologised and committed to the gesture for future matches although in making his apology he said he had felt his “rights were taken away” in the way the order was conveyed. He made no mention of the incident in his retirement statement. “This is not a decision that I have come to very easily. I have taken a lot of time to think about what my future looks like and what needs to take priority in my life now that Sasha and I are about to welcome our first child into this world and look to grow our family beyond that,” de Kock said. “My family is everything to me and I want to have the time and space to be able to be with them during this new and exciting chapter of our lives. “I love Test cricket and I love representing my country and all that it comes with. I’ve enjoyed the ups and the downs, the celebrations and even the disappointments, but now I’ve found something that I love even more. “In life, you can buy almost everything except for time, and right now, it’s time to do right by the people that mean the most to me.” The cricket world was shocked by the announcement. Former India opening batter Aakash Chopra tweeted: “He was expected to take the paternity leave but to announce retirement. Well … didn’t see this coming. Nobody did, I guess. All of 29. Already done with the longest format.” Journalist Manish Pandey wrote: “A surprise de Kock has chosen to retire completely. Was expected to take paternity leave, but to retire completely from Test match cricket at 29 is a blow to South Africa and the game in general.” Cricket writer S. Sundarshanan added: “Woahh! Quinton de Kock retires from Tests. Didn’t see it coming. Wonder if there’s more to it.” De Kock was regarded as one of the most talented wicketkeeper-batsmen in the world. He scored 3300 runs at an average of 38.82 in 54 Tests, scoring at a rate of more than 70 runs per 100 balls. He took 221 catches and completed 11 stumpings. De Kock captained his country in four Tests last season but did not look happy in the role. In January, he questioned the sustainability of bio-secure environments as a result of Covid-19 restrictions and said “bubble life is very unsettling”. His retirement means that only three players in the current South African squad have made Test centuries — captain Dean Elgar, Aiden Markram and Temba Bavuma. De Kock’s place in the Test team is expected to be taken by Kyle Verreynne, who made his debut as a specialist batsman during a series in the West Indies in June. The horror show we call 2021 threw another curve ball Steve Smith’s way when he finally thought he was done with this dog of a year. Brett Lee may have retired from cricket many years ago but his son found out he is still more than capable of bowling a nasty yorker. Ex-Australian captain Ricky Ponting has let rip at England’s pathetic Ashes performance in a scathing assessment of the tourists.","image_url":null,"source_id":"news"},{"title":"South African star retires in his prime","link":"https://wwos.nine.com.au/cricket/south-africa-v-india-test-series-quinton-de-kock-announces-retirement-from-test-cricket/c4a4395a-1a48-4b03-8094-6ad2ca43a52c","keywords":null,"creator":["wwos"],"video_url":null,"description":"South Africa's Quinton de Kock retired from Test cricket on Thursday in a shock move just hours after losing to India.","content":"South Africa wicketkeeper-batsman Quinton de Kock retired from Test cricket on Thursday in a shock move announced just a few hours after he played in the defeat to India in the first Test in Centurion.In a statement, the 29-year-old de Kock said he made his decision in order to have more time to spend with his family. De Kock and his wife Sasha are expecting their first child in the coming days.“This is not a decision that I have come to very easily,\" de Kock said. \"I have taken a lot of time to think about what my future looks like and what needs to take priority in my life now that Sasha and I are about to welcome our first child into this world and look to grow our family beyond that.READ MORE: Cricket legend and Ashes referee David Boon positive for COVID-19READ MORE: Bailey opens door for Swepson selection“My family is everything to me and I want to have the time and space to be able to be with them during this new and exciting chapter of our lives.”De Kock said he was still “fully committed” to playing limited-overs cricket for South Africa and signed off his statement with: \"See you in the ODIs and T20s.\"His move seemingly took Cricket South Africa by surprise, too. Its CEO, Pholetsi Moseki, said: “It’s sad to lose a player of Quinton’s caliber at what we still see as the prime of his career.”De Kock made his debut against Australia in 2014 and played 54 Tests, sometimes balancing the responsibility of opening the batting and keeping wicket, and later leading the team as captain. He made six Test centuries with his best score, 141 not out against West Indies this year, underlining the fact that he was still one of South Africa's leading batters. His Test average is 38.82.He took 221 catches in Tests, with 11 stumpings.De Kock had spoken previously of the toll Test cricket had taken on his personal life, especially in the pandemic era when players must often stay in bio-bubbles during long series, not allowed to leave team hotels except for matches and training sessions and not allowed to be with family and loved ones.He took a break from all cricket at the start of this year for mental health reasons, citing the “unsettling” effect of being in those coronavirus bio-bubbles.De Kock also made headlines at the Twenty20 World Cup in October when he refused to play in a game after Cricket South Africa ordered all its players to take a knee for the Black Lives Matter movement. De Kock apologized and took a knee in later games but said he felt forcing players to perform the anti-racism gesture undermined its significance.South Africa lost the first Test against India by 113 runs earlier Thursday to go 1-0 down in the three-Testseries. De Kock was already set to miss the rest of the series for the birth of his child but had given no public indication that he was about to quit Test cricket for good.\"I love Test cricket and I love representing my country and all that it comes with,\" he said in his statement. \"I’ve enjoyed the ups and the downs, the celebrations and even the disappointments, but now I’ve found something that I love even more.“In life, you can buy almost everything except for time, and right now, it’s time to do right by the people that mean the most to me.”For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-30 20:21:58","full_description":"South Africa wicketkeeper-batsman Quinton de Kock retired from Test cricket on Thursday in a shock move announced just a few hours after he played in the defeat to India in the first Test in Centurion. In a statement, the 29-year-old de Kock said he made his decision in order to have more time to spend with his family. De Kock and his wife Sasha are expecting their first child in the coming days. “This is not a decision that I have come to very easily,\" de Kock said. \"I have taken a lot of time to think about what my future looks like and what needs to take priority in my life now that Sasha and I are about to welcome our first child into this world and look to grow our family beyond that. READ MORE: Cricket legend and Ashes referee David Boon positive for COVID-19 READ MORE: Bailey opens door for Swepson selection “My family is everything to me and I want to have the time and space to be able to be with them during this new and exciting chapter of our lives.” De Kock said he was still “fully committed” to playing limited-overs cricket for South Africa and signed off his statement with: \"See you in the ODIs and T20s.\" His move seemingly took Cricket South Africa by surprise, too. Its CEO, Pholetsi Moseki, said: “It’s sad to lose a player of Quinton’s caliber at what we still see as the prime of his career.” De Kock made his debut against Australia in 2014 and played 54 Tests, sometimes balancing the responsibility of opening the batting and keeping wicket, and later leading the team as captain. He made six Test centuries with his best score, 141 not out against West Indies this year, underlining the fact that he was still one of South Africa's leading batters. His Test average is 38.82. He took 221 catches in Tests, with 11 stumpings. De Kock had spoken previously of the toll Test cricket had taken on his personal life, especially in the pandemic era when players must often stay in bio-bubbles during long series, not allowed to leave team hotels except for matches and training sessions and not allowed to be with family and loved ones. He took a break from all cricket at the start of this year for mental health reasons, citing the “unsettling” effect of being in those coronavirus bio-bubbles. De Kock also made headlines at the Twenty20 World Cup in October when he refused to play in a game after Cricket South Africa ordered all its players to take a knee for the Black Lives Matter movement. De Kock apologized and took a knee in later games but said he felt forcing players to perform the anti-racism gesture undermined its significance. South Africa lost the first Test against India by 113 runs earlier Thursday to go 1-0 down in the three-Testseries. De Kock was already set to miss the rest of the series for the birth of his child but had given no public indication that he was about to quit Test cricket for good. \"I love Test cricket and I love representing my country and all that it comes with,\" he said in his statement. \"I’ve enjoyed the ups and the downs, the celebrations and even the disappointments, but now I’ve found something that I love even more. “In life, you can buy almost everything except for time, and right now, it’s time to do right by the people that mean the most to me.” For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/401234/pickerimage.jpg","source_id":"nine"},{"title":"‘Pack your bags’: Brett Lee destroys son in game of front yard cricket","link":"https://www.foxsports.com.au/cricket/australia/pack-your-bags-brett-lee-destroys-son-in-game-of-front-yard-cricket/news-story/7575e2223f0f7947ec696546a0204232","keywords":null,"creator":null,"video_url":null,"description":"Brett Lee has still got it.","content":null,"pubDate":"2021-12-30 19:39:00","full_description":"Brett Lee has still got it. The former Australian fast bowler may have retired from international cricket a decade ago but he can still send down the odd thunderbolt of a delivery. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. Footage has emerged of Lee showing absolutely no mercy on his son Preston in a game of cricket out the front of a house on a suburban footpath. In a video posted by Lee’s older brother Shane — who played 45 ODIs for Australia himself — Lee can be seen bowling to his son on a shortened concrete pitch. The 46-year-old casually walks up to the crease before bowling a searing yorker that knocked middle stump out of the ground and very nearly crushed his son’s bare feet. Lee was clearly pleased with his effort, jogging towards Preston and raising his finger in the air. Brett commented on Shane’s Instagram post of the video: “Oh yeh !!!!! Pack your bags Presto”, along with a cry laughing emoji. Shane captioned his video: “Front yard cricket with the Lee’s. @brettlee_58 to @1prestonlee Bowled for 112 #ashes #packyourbags”. Brett Lee was showing no mercy on his son. Source: Instagram Binga was pumped. Source: Instagram He regularly bowled at speeds of 150km/h playing for Australia and many years after retiring from professional cricket, the sight of Binga sending stumps cartwheeling is enough to make any Aussie cricket fan smile. Lee took 310 wickets for Australia during his 76-Test career and is also tied with Glenn McGrath for the most ODI wickets taken by an Australian (380). He will be part of Fox Cricket’s commentary team for the fourth Ashes Test, which will get underway on Wednesday January 5 at the SCG.","image_url":null,"source_id":"foxsports"}]}