{"newsArray":[{"title":"McDonald coy on head coaching aspirations","link":"https://www.perthnow.com.au/sport/cricket/mcdonald-coy-on-head-coaching-aspirations-c-5671203","keywords":null,"creator":["Troy Whittaker"],"video_url":null,"description":"Andrew McDonald hasn't given much away on his appetite for taking on Australia's cricket coaching role full-time but says there won't be much short-term change.","content":null,"pubDate":"2022-02-12 04:40:56","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5671203/e772bd79a607690ed56ddc32347375bf4af8b152-16x9-x0y75w800h450.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"McDonald coy on head coaching aspirations","link":"https://thewest.com.au/sport/cricket/mcdonald-coy-on-head-coaching-aspirations-c-5671201","keywords":null,"creator":["Troy Whittaker"],"video_url":null,"description":"Andrew McDonald hasn't given much away on his appetite for taking on Australia's cricket coaching role full-time but says there won't be much short-term change.","content":null,"pubDate":"2022-02-12 04:40:56","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5671201/e772bd79a607690ed56ddc32347375bf4af8b152-16x9-x0y75w800h450.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL auction LIVE: $100m in talent on the table as Aussies set for mega paydays","link":"https://www.foxsports.com.au/cricket/indian-premier-league/ipl-auction-2022-live-updates-indian-premier-league-mega-auction-list-of-players-australian-players-teams-prices-news/news-story/f7cfef55c86f63137ad8b4bc8a0d2de1","keywords":null,"creator":null,"video_url":null,"description":"There’s no better proof of the mouth-watering money on offer in the Indian Premier League than tonight’s $100 million mega auction. Watch it live on Fox Cricket from 5:30pm AEDT!","content":null,"pubDate":"2022-02-12 04:28:00","full_description":"There’s no better proof of the mouth-watering money on offer in the Indian Premier League than tonight’s $100 million mega auction. Watch it live on Fox Cricket from 5:30pm AEDT! David Warner and Pat Cummins are two of the 10 marquee stars who will kick off the auction, determining the IPL homes of almost every player for the 2022 season. Cummins set the record as the most expensive overseas player in 2020 when he went for $3.17 million. MORE IPL AUCTION THE AUSSIES: $8m of Aussie talent on offer, and the asking price for all 47 ULTIMATE GUIDE: Everything you need to know about the IPL auction There are 47 Aussies on offer as the IPL expands to 10 teams, meaning more money and more spots up for grabs. Two new franchises, Lucknow Super Giants and Ahmedabad’s Gujarat Titans, have joined Chennai Super Kings, Delhi Capitals, Kolkata Knight Riders, Mumbai Indians, Punjab Kings, Rajasthan Royals, Royal Challengers Bangalore and Sunrisers Hyderabad. Marcus Stoinis (Lucknow) and Glenn Maxwell (Bangalore) were two of the 27 players retained by the clubs. In total 590 players are in the pool - 370 Indian and 220 overseas - with 49 of them set at the maximum reserve price of INR 2 crore (20 million rupees, or $377,000). The auction will run over two days, with the 2022 IPL season taking place from April 2 until June 3. RETAINED PLAYERS (Purchased in case of Lucknow, Gujarat) Punjab Kings: Mayank Agarwal, Arshdeep Singh Sunrisers Hyderabad: Kane Williamson, Abdul Samad, Umran Malik Rajasthan Royals: Yashasvi Jaiswal, Sanju Samson, Jos Buttler Royal Challengers Bangalore: Virat Kohli, Glenn Maxwell, Mohammed Siraj Chennai Super Kings: Ruturaj Gaikwad, MS Dhoni, Moeen Ali, Ravindra Jadeja Kolkata Knight Riders: Andre Russell, Venkatesh Iyer, Sunil Narine, Varun Chakravarty Mumbai Indians: Rohit Sharma, Suryakumar Yadav, Kieron Pollard, Jasprit Bumrah Delhi Capitals: Prithvi Shaw, Rishabh Pant, Axar Patel, Anrich Nortje Gujarat Titans: Shubman Gill, Hardik Pandya, Rashid Khan Lucknow Super Giants: KL Rahul, Marcus Stoinis, Ravi Bishnoi Follow the 2022 IPL mega auction in our live blog below! If you can’t see the blog, tap here.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket’s sad truth: Golden boy must retire now","link":"https://www.cairnspost.com.au/sport/cricket/will-pucovski-concussion-victorian-batsman-must-retire-from-cricket-writes-peter-lalor/news-story/e05211a5be1b42804738ec7fa187e9b7","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Will Pucovski, the best young batsman in the country, needs to retire from cricket.","content":null,"pubDate":"2022-02-12 03:57:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Concussion forces Pucovski out of Shield clash","link":"https://wwos.nine.com.au/cricket/will-pucovski-suffers-another-concussion-in-sheffield-shield-clash-victoria-vs-south-australia/bcbbf5df-65fc-4604-97d2-98812218890b","keywords":null,"creator":["wwos"],"video_url":null,"description":"Will Pucovski's long-awaited comeback match has ended with the young opener suffering yet another concussion.","content":"Will Pucovski has been subbed out of Victoria's Sheffield Shield clash with South Australia after suffering another concussion in his comeback match.Playing in his first match after an extended break, Pucovski did not join Marcus Harris at the top of Victoria's order for its second innings after an incident during the warm-up prior to Day 4.The 24-year-old was substituted out of the match and has been replaced by Travis Dean.LIVE UPDATES: Aussie heartbreak in mixed snowboard quartersThe concussion is understood to be the 11th the right-hander has suffered in his young cricket career.It is a shattering blow to Pucovski, who was making his first appearance since his Test debut against India during last year's New Year's Test.After his Test debut had been delayed due to concussions, Pucovski showed glimpses of his immense talent with a half-century against India before a shoulder injury put his career on hold yet again.He'd hoped to make his return for Australia's Ashes campaign this summer before yet another concussion setback that left former Test skipper Tim Paine \"shattered\".Despite over 12 months away from the cricket field, Pucovski showed little sign of any rust in Victoria's first innings, scoring 54 in a 110-run stand with Harris for the opening wicket.Pucovski had previously voiced his intention to return to the international fold during Australia's upcoming tour of Pakistan, but was left out of the 18-man squad earlier this week.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-12 03:13:37","full_description":"Will Pucovski has been subbed out of Victoria's Sheffield Shield clash with South Australia after suffering another concussion in his comeback match. Playing in his first match after an extended break, Pucovski did not join Marcus Harris at the top of Victoria's order for its second innings after an incident during the warm-up prior to Day 4. The 24-year-old was substituted out of the match and has been replaced by Travis Dean. LIVE UPDATES: Aussie heartbreak in mixed snowboard quarters The concussion is understood to be the 11th the right-hander has suffered in his young cricket career. It is a shattering blow to Pucovski, who was making his first appearance since his Test debut against India during last year's New Year's Test. After his Test debut had been delayed due to concussions, Pucovski showed glimpses of his immense talent with a half-century against India before a shoulder injury put his career on hold yet again. He'd hoped to make his return for Australia's Ashes campaign this summer before yet another concussion setback that left former Test skipper Tim Paine \"shattered\" . Despite over 12 months away from the cricket field, Pucovski showed little sign of any rust in Victoria's first innings, scoring 54 in a 110-run stand with Harris for the opening wicket. Pucovski had previously voiced his intention to return to the international fold during Australia's upcoming tour of Pakistan, but was left out of the 18-man squad earlier this week. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/398647/211212-chappel.png","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pucovski’s future up in the air after concussion in Shield game - Sydney Morning Herald","link":"https://news.google.com/__i/rss/rd/articles/CBMiW2h0dHBzOi8vd3d3LnNtaC5jb20uYXUvc3BvcnQvY3JpY2tldC9wdWNvdnNraS1jb25jdXNzZWQtaW4tc2hpZWxkLWdhbWUtMjAyMjAyMTItcDU5dnd5Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pucovski’s future up in the air after concussion in Shield game  Sydney Morning HeraldWill Pucovski subbed out of Shield clash after suffering another concussion  Wide World of SportsAussie prodigy’s ‘heartbreaking’ nightmare  NEWS.com.auAussie young gun in the runs as comeback continues  SENPucovski concussed, subbed out of Shield match | cricket.com.au  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-02-12 03:08:09","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 auction players list: Full list of players with base price of Rs 2 crore","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-auction/ipl-2022-auction-players-list-base-price-2-crore-pool/article38416713.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"IPL 2022 auction players list: This will be the 15th season of the IPL and some of the biggest stars of world cricket will be coming together to light up the prestigious tournament.","content":null,"pubDate":"2022-02-12 02:51:56","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL mega auction: Big-name veterans may not find initial takers - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pcGwtbWVnYS1hdWN0aW9uLWJpZy1uYW1lLXZldGVyYW5zLW1heS1ub3QtZmluZC1pbml0aWFsLXRha2Vycy03NzY4MTI5L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL mega auction: Big-name veterans may not find initial takers  The Indian ExpressIPL 2022 Mega Auction - Top All-Rounders  Royal Challengers BangaloreIPL Auction Live Updates 2022, Live Players Bought By CSK, DC, KKR, MI, PBKS, RR, RCB, SRH, Lucknow, Ahmedabad Players List, Remaining Purse Value Of All 10 Teams  Cricket AddictorIPL Auction 2022 Rapid Fire: Best auction strategy, player-team combination & more  CricbuzzIPL Auction 2022: Five lesser-known players from overseas league who could land lucrative deals  FirstpostView Full coverage on Google News","content":null,"pubDate":"2022-02-12 02:34:21","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"CCH vs SYL Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BPL 2022 Match No. 29 at Sher-e-Bangla National Stadium, Dhaka, 12 PM IST February 12","link":"https://zeenews.india.com/cricket/cch-vs-syl-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-bpl-2022-match-no-29-at-sher-e-bangla-national-stadium-dhaka-12-pm-ist-february-12-2435635.html","keywords":null,"creator":null,"video_url":null,"description":"Chattogram Challengers vs Sylhet Sunrisers Dream11 Team Prediction Chattogram Challengers vs Sylhet Sunrisers Match No. 29 - Check My Dream11 Team, Best players list of CCH vs SYL, Chattogram Challengers Dream11 Team Player List, Sylhet Sunrisers Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Bangladesh Premier League 2022, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-02-12 02:11:00","full_description":null,"image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Fawad replaces Rashid in Qalandars squad","link":"https://www.thenews.com.pk/print/932885-fawad-replaces-rashid-in-qalandars-squad","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Lahore Qalandars have picked Australia’s Fawad Ahmed as a replacement for Rashid Khan, who will leave the Lahore Qalandars squad on February 19 owing to his national cricket team duty.Rashid Khan, who is set to represent Afghanistan in their away series against Bangladesh from...","content":null,"pubDate":"2022-02-12 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Yorkshire regain right to host England matches","link":"https://www.thenews.com.pk/print/932890-yorkshire-regain-right-to-host-england-matches","keywords":null,"creator":null,"video_url":null,"description":"LONDON: England cricket chiefs lifted a ban on Yorkshire staging international matches on Friday following the club’s handling of a racism scandal that rocked the game.Former player Azeem Rafiq accused Yorkshire of failing to deal adequately with the abuse he suffered at the northern county,...","content":null,"pubDate":"2022-02-12 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Fawad replaces Rashid in Qalandars squad","link":"https://www.thenews.com.pk/print/932885-fawad-replaces-rashid-in-qalandars-squad","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Lahore Qalandars have picked Australia’s Fawad Ahmed as a replacement for Rashid Khan, who will leave the Lahore Qalandars squad on February 19 owing to his national cricket team duty.Rashid Khan, who is set to represent Afghanistan in their away series against Bangladesh from...","content":null,"pubDate":"2022-02-12 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"'What the hell': Cricket world stunned by 'extraordinary' scenes","link":"https://au.sports.yahoo.com/australia-sri-lanka-cricket-world-stunned-bizarre-scenes-220034289.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-11 22:00:34","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-02/3e52d590-8b85-11ec-af56-3723d6ef6379","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Alex Dombrandt: ‘I’m proud I went down a different route to the norm’","link":"https://www.theguardian.com/sport/2022/feb/11/alex-dombrandt-england-harlequins-rugby-proud-different-route","keywords":["England rugby union team","Six Nations 2022","Six Nations","Rugby union","Sport"],"creator":["Robert Kitson"],"video_url":null,"description":"Not long ago the Harlequins player was enjoying himself at university – now he is poised to start for England against ItalyFor every aspiring England international the road to the summit is a long and winding one. Not since Hannibal marched his elephants over the Alps, though, has a player taken such a less-travelled route to Rome than Alex Dombrandt, already the toast of student unions nationwide as he prepares to start a Six Nations game for the first time at the Stadio Olimpico on Sunday.Not too long ago, Dombrandt was enjoying himself at Cardiff Metropolitan University, where he had enrolled hoping to play both cricket and rugby, having never featured in England’s age-group sides or academies. Now the Harlequins No 8, still only 24, is about to start a match for his country, is a Premiership title-winner and is on course to be a key part of Eddie Jones’s 2023 World Cup plans. Continue reading...","content":null,"pubDate":"2022-02-11 22:00:01","full_description":"F or every aspiring England international the road to the summit is a long and winding one. Not since Hannibal marched his elephants over the Alps, though, has a player taken such a less-travelled route to Rome than Alex Dombrandt, already the toast of student unions nationwide as he prepares to start a Six Nations game for the first time at the Stadio Olimpico on Sunday. Not too long ago, Dombrandt was enjoying himself at Cardiff Metropolitan University, where he had enrolled hoping to play both cricket and rugby, having never featured in England’s age-group sides or academies. Now the Harlequins No 8, still only 24, is about to start a match for his country, is a Premiership title-winner and is on course to be a key part of Eddie Jones’s 2023 World Cup plans. Could it be these apparently conflicting strands of his CV are actually connected? The way Dombrandt plays – his anticipation, instincts, great hands, love of scoring tries – sticks out like a strawberry daiquiri on a trayful of lagers. Maybe it is precisely because he didn’t spend his formative years toeing the conventional academy line that he is soaring so high now. Dombrandt himself does not disagree and would recommend university to anyone. “I’m quite proud of the fact I went down a different route to the norm,” he says. “I’m also quite proud of the fact I’ve got a university degree and also managed to come out with a professional contract. For me it was a win-win situation. Rugby’s only going to last for so long, you need something to fall back on.” His story, he believes, should also be a quiet prod to others who suffer early rejection and consequently assume they are not good enough. “I do hope it paves the way for boys growing up who aren’t in an academy setup. A lot of boys that age, when they don’t get into academies, can think: ‘That’s it.’ Hopefully the fact I’ve gone down a different path will encourage other boys to go down that route as well.” Interestingly the trend already seems to be accelerating. Dombrandt, Luke Northmore and, now, Tom Pearson have all featured in England’s senior squad this month having played in BUCS Super Rugby at Cardiff Met. Wales’s Aaron Wainwright is another former “Archer”, while Christ Tshiunza was readying himself for an Exeter University game last October when the national coach Wayne Pivac called him up. It also shows what is possible when people put down their beers and commit to playing the game for the pure, life-enhancing sake of it. Dombrandt’s time as a PE student in Cardiff was not entirely blissful – on two separate occasions he had his jaw broken following cowardly assaults in games against local club opposition – but the so-called “Dominator” still did enough to attract the Wales age-group selectors despite his complete lack of Welsh family ties. Studying in Wales, though, was enough to make him eligible, which is how, five years ago this week, he ended up representing Wales U20s against England U20s. His memories of that wet and windy night in Colwyn Bay – “England beat us quite convincingly so it wasn’t the greatest game” – are mixed but Harlequins were offering him a contract soon enough. He grabbed it with both hands – they were his local side growing up in Surrey – and has never looked back. The “uni rig” famously referenced by Quins’ then-head coach Paul Gustard has since acquired a more elite physique but there are still occasional glimpses of the cake-loving, multi-sport amateur he once was. Along with his father, Steve, who maintains those big pitchside cameras now commonplace in sports stadiums, and his elder brother Ben, who works in marketing, he remains a longtime cricket fan and believes playing different sports undoubtedly helped his rugby. “I grew up as a keen footballer and loved my cricket as well. That helps with the hand-eye coordination. I would definitely encourage people to play as many sports as possible.” It also helps to explain why he and Marcus Smith, his Quins and England teammate, are such firm friends, regularly meeting up for coffee and food in and around Guildford. “I’d say we are similar types of people. We enjoy doing similar things.” They live just 10 minutes apart and their innate understanding on the field is no coincidence. Now, at last, the pair have a chance to dovetail in a major fixture, with Jones suggesting the extra space potentially available against Italy makes it sensible to use the No 8 from the start. Jones sees similarities with the former Springboks captain Bob Skinstad, and Dombrandt is now desperate to nail down a regular starting jersey. “I don’t think you will ever meet a rugby player who is just happy sitting on the bench. I want to start. When you know you’re starting the whole buildup is different.” Now he also has the chance to put behind him the lineout malfunction involving himself and Joe Marler – “Hopefully that situation doesn’t arise again” – which hurt England in the final quarter in Edinburgh. The sting of that Murrayfield loss has not gone – “It was a game we should have won” – but in Dombrandt’s opinion England’s future remains bright. “I think the potential is sky-high. The amount of talent we’ve got in the changing room when you look around is amazing. It’s just about working hard each day as a collective, trying to improve and really pushing each other. Then the sky’s the limit. This week there’s been a big focus on ourselves, what we want to put out on the pitch and how we want to play.” It has not gone undiscussed within the squad, either, that England won the Six Nations title two years ago having lost their opening game. Ultimately it is the quest for more feelgood moments that drives Dombrandt onwards. “The Premiership final was the best day of my life. I’d love to be able to wake up and do it all again. As a kid you dream about winning the Premiership; it was something I never thought would be possible. That’s the memory I’ll cherish forever.” And this weekend? “All I want to do is enjoy the game. When I’m enjoying it and have a smile on my face that’s when I feel I play my best rugby.” When in Rome, why change what comes naturally?","image_url":"https://i.guim.co.uk/img/media/0d0976e57942f03499e492c36b0f31e9b9e623cb/0_44_6908_4147/master/6908.jpg?width=460&quality=85&auto=format&fit=max&s=d46867c5b2ca21fb2816665071f863b4","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"John Buchanan believes a good coach challenges players","link":"https://www.cairnspost.com.au/sport/cricket/john-buchanan-believes-a-good-coach-challenges-players/video/f6bdcd568d3cf3bf2f90829ea0137624","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Former coach John Buchanan has given his insight into what he believes a good coach should be.","content":null,"pubDate":"2022-02-11 21:04:07","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"John Buchanan believes a good coach challenges players","link":"https://www.news.com.au/sport/cricket/john-buchanan-believes-a-good-coach-challenges-players/video/f6bdcd568d3cf3bf2f90829ea0137624","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Former coach John Buchanan has given his insight into what he believes a good coach should be.","content":null,"pubDate":"2022-02-11 21:04:07","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Revealed: Aussie stars among social media’s most despised","link":"https://www.cairnspost.com.au/sport/social-media-in-sport-the-most-loved-and-divisive-stars-online/news-story/4badc16f96e61b0bdc6925cb72e4321a","keywords":["Boxing MMA","Cricket news and galleries","Sport news and galleries","Tennis news and galleries","UFC"],"creator":null,"video_url":null,"description":"While Ash Barty stands alone as the most popular athlete on the planet right now, cricket captain Pat Cummins has discovered the perils of rolling a coach.","content":null,"pubDate":"2022-02-11 21:00:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Warne unleashes on CA's Langer 'disgrace'","link":"https://wwos.nine.com.au/cricket/shane-warne-labels-justin-langer-saga-disgrace-pat-cummins-captaincy/42ba6bc9-3349-4dcd-9f32-7ffa2b7261aa","keywords":null,"creator":["wwos"],"video_url":null,"description":"Shane Warne has once again taken aim at Cricket Australia for the way Justin Langer's exit as coach was handled.","content":"Shane Warne has heaped pressure on Pat Cummins and the rest of the Australian dressing room after labelling the handling of Justin Langer's exit a \"disgrace\".Despite overseeing a successful Ashes summer as well as a victorious T20 World Cup campaign, Langer was given no choice but to walk after a six-month contract extension offer from Cricket Australia. The WA native's exit was met with fury by a number of his ex-teammates, and Warne doubled down on his criticism of Cricket Australia's handling of the saga.READ MORE: 'Second gear' Australia shuts down Sri Lanka in T20 opener\"I thought the treatment of Justin wasn't right at all,\" Warne told Fox Cricket.\"And take Justin Langer out of it. Even just the position of the men's coach, I thought was really poor from Cricket Australia.\"The way it was handled, I thought was a disgrace.\"I don't know if it was the right decision. I'm not sure how it got to that.\"It sounded like, what we're hearing — and all we can do is go on what the players are saying — is the players didn't want him anymore. He lost the dressing room — which I don't know is right. I think you just want the best candidate for the job.\"READ MORE: Urgent hearing to decide Russian medal favourite's fateREAD MORE: Adesanya's ruthless Whittaker taunt ahead of UFC 271With player power having won after Langer's exit, Warne said the pressure would fall on Test captain Pat Cummins and the rest of the Australian side.\"They basically got rid of the Australian coach,\" he said. \"So they want to start performing, because this is not a great Australian cricket team, the men's Test team.\"They're doing okay ... we're just starting to see the rewards for that by winning a World Cup, winning an Ashes series. So suddenly they're starting to see the rewards, and now he's gone.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-11 20:58:34","full_description":"Shane Warne has heaped pressure on Pat Cummins and the rest of the Australian dressing room after labelling the handling of Justin Langer's exit a \"disgrace\". Despite overseeing a successful Ashes summer as well as a victorious T20 World Cup campaign, Langer was given no choice but to walk after a six-month contract extension offer from Cricket Australia. The WA native's exit was met with fury by a number of his ex-teammates, and Warne doubled down on his criticism of Cricket Australia's handling of the saga. READ MORE: 'Second gear' Australia shuts down Sri Lanka in T20 opener \"I thought the treatment of Justin wasn't right at all,\" Warne told Fox Cricket. \"And take Justin Langer out of it. Even just the position of the men's coach, I thought was really poor from Cricket Australia. \"The way it was handled, I thought was a disgrace. \"I don't know if it was the right decision. I'm not sure how it got to that. \"It sounded like, what we're hearing — and all we can do is go on what the players are saying — is the players didn't want him anymore. He lost the dressing room — which I don't know is right. I think you just want the best candidate for the job.\" READ MORE: Urgent hearing to decide Russian medal favourite's fate READ MORE: Adesanya's ruthless Whittaker taunt ahead of UFC 271 With player power having won after Langer's exit, Warne said the pressure would fall on Test captain Pat Cummins and the rest of the Australian side. \"They basically got rid of the Australian coach,\" he said. \"So they want to start performing, because this is not a great Australian cricket team, the men's Test team. \"They're doing okay ... we're just starting to see the rewards for that by winning a World Cup, winning an Ashes series. So suddenly they're starting to see the rewards, and now he's gone.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/409637/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia claim first win without Justin Langer","link":"https://www.news.com.au/sport/cricket/australia-claim-first-win-without-justin-langer/video/052787818af8c0a7453769f8380705cb","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Australia have defeated Sri Lanka in the first T20 international, winning by 20 runs in their first match without Justin Langer at the helm.","content":null,"pubDate":"2022-02-11 20:32:09","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia claim first win without Justin Langer","link":"https://www.cairnspost.com.au/sport/cricket/australia-claim-first-win-without-justin-langer/video/052787818af8c0a7453769f8380705cb","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia have defeated Sri Lanka in the first T20 international, winning by 20 runs in their first match without Justin Langer at the helm.","content":null,"pubDate":"2022-02-11 20:32:09","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Today IPL auction time 2022: Time table for IPL mega auction 2022","link":"https://thesportsrush.com/cricket-news-today-ipl-auction-time-2022-time-table-for-ipl-mega-auction-2022/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL","IPL 2022 mega auction"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Today IPL auction time 2022: The highly anticipated mega auction ahead of the 15th season of the IPL would commence today in Bengaluru. The time has nearly arrived for the commencement of one of the most exciting two-day event of India’s biggest T20 tournament. Bengaluru is ready to host the 10 IPL franchises as their… The post Today IPL auction time 2022: Time table for IPL mega auction 2022 appeared first on The SportsRush.","content":"Today IPL auction time 2022: The highly anticipated mega auction ahead of the 15th season of the IPL would commence today in Bengaluru. The time has nearly arrived for the commencement of one of the most exciting two-day event of India’s biggest T20 tournament. Bengaluru is ready to host the 10 IPL franchises as their respective think-tanks would assemble under a roof to kick-off the much anticipated mega auction ahead of the tournament’s 15th edition. A total of 590 names of players would go under the hammer on February 12 and 13, with the ten franchises strategizing and brainstorming their ways to form their respective squads within a purse limit of INR 90 Crore. The 590 Cricketers, comprise 220 overseas and 370 Indian players; and to further break it down 228 capped players, and 355 uncapped players. The auction event would kick-start with the list of 10 marquee players, who would be up for grabs at their respective base price of INR 2 Crore. Today (February 12), a total of 97 players (up to Set No. 11) will be put up for bidding. The first six sets (54 players) would feature the capped players, while the remaining 5 sets of the day would comprise the uncapped ones (23 players). Check the full format and schedule here. Rs 515.5 cr is waiting to be spent on 289 players over next 2 days. Even if the money is equally divided, each player will still walk away with Rs 1.78 cr. That’s still higher than the highest salary a player earns in any other cricket league. That’s why IPL is what it is. : ) — KSR (@KShriniwasRao) February 11, 2022 Today IPL auction time 2022 Star Sports Network will be broadcasting the live streaming of Indian Premier League mega auction 2022 in India. As has been the case with everything related to Indian men’s cricket team in the recent years, Star have arranged extensive coverage for the auction as well. Fans following the auction from different states will get to hear commentary across designated TV channels for various languages, such as English, Hindi, Tamil, Telugu and Kannada. All these channels will telecast both days of the auction event from 12 pm (IST) onwards. The 10 franchise think-tanks would take a nearly half-an-hour Afternoon tea break at around the 5 pm mark. The auction would also make way for some short breathers from time to time for the franchises’ interaction with the host broadcaster, wherein the fans would get to know an insight as to what led the franchise bid for a particular player(s) at the auction table. The post Today IPL auction time 2022: Time table for IPL mega auction 2022 appeared first on The SportsRush.","pubDate":"2022-02-11 19:31:43","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL auction 2022, cricket news: Australia players in Indian Premier League, date, prices, values, Mitch Marsh, David Warner","link":"https://www.foxsports.com.au/cricket/indian-premier-league/ipl-auction-2022-cricket-news-australia-players-in-indian-premier-league-date-prices-values-mitch-marsh-david-warner/news-story/68f32b89c44b53bab8151ac288fae85e","keywords":null,"creator":null,"video_url":null,"description":"The Indian Premier League auction starts tonight (5.30pm AEDT) with franchises set to splash millions of dollars each in their quest to fill a title-winning squad.","content":null,"pubDate":"2022-02-11 19:00:00","full_description":"The Indian Premier League auction starts tonight (5.30pm AEDT) with franchises set to splash millions of dollars each in their quest to fill a title-winning squad. The event will take place over two nights this year, starting on Saturday February 12 before concluding the following night. A total of 590 cricketers will go under the hammer during the mega auction taking place in Bengaluru. Watch The Dettol T20 Series Australia vs Sri Lanka. Every Game Live & On-Demand on Kayo. New to Kayo? Start your free trial now > ULTIMATE GUIDE: What you need to know about $27m IPL bonanza as 590 players chase mega paydays NEW FOX CRICKET PODCAST - Shane Warne: ‘What is Cricket Australia doing!?’ Listen below or subscribe in iTunes or Spotify Of those 590, a whopping 228 are capped players, while Australians make-up the greatest overseas portion with 47 enlisted cricketers. Below, we take a look at the Australian cohort looking to land a massive payday at this year’s auction, hoping to match the mega deals Glenn Maxwell ($2.5m), Jhye Richardson ($2.5m) and Riley Meredith ($1.4m) earnt in 2021. This year, Maxwell is the only Australian who has been retained by a franchise with Royal Challengers Bangalore renewing his multimillion-dollar contract. It means the likes of Pat Cummins, Mitch Marsh and, for the first time ever, former Sunrisers Hyderabad captain David Warner, will be up for sale. Marcus Stoinis, meanwhile, was snapped up by new franchise Lucknow Super Giants for a reported $2 million. Cummins breaks silence on JL's exit | 18:09 AUSTRALIANS IN THE 2022 IPL AUCTION Below is the full list of all 47 Australians who will go under the hammer this weekend, and the base prices they have nominated. The highest base price a player can set is 200 lakh, or approximately $375,000 AUD. Some players in the highest bracket fetch well in excess of that base price, however. For example, Maxwell was bought for $2.5 million last year — more than six times over the base price. On base price alone, the 47 Australians can be bought for a collective total of approx. $7,923,000 AUD. In reality, many will go without deals, while others will make well over the base price. Last year, only eight Australians were bought at the auction while 27 went unsold. The eight Australians were purchased for a combined total of $9.4 million. Base price of 200 lakh (approx. A$375,000) Pat Cummins, David Warner, Steve Smith, Mitch Marsh, Matthew Wade, Josh Hazlewood, Adam Zampa, Nathan Coulter-Nile, Ashton Agar Base price of 150 lakh (approx. A$280,000) Aaron Finch, Chris Lynn, Usman Khawaja, Kane Richardson Base price of 100 lakh (approx. A$186,000) Marnus Labuschagne, Daniel Sams, Andrew Tye, Moises Henriques, Riley Meredith, James Faulkner, D’Arcy Short, Josh Philippe Base price of 75 lakh (approx. A$140,000) Nathan Ellis, Jason Behrendorff, Sean Abbott, Billy Stanlake, Ben Cutting Base price of 50 lakh (approx. A$93,000) Ben McDermott, Kurtis Patterson, Wes Agar, Jack Wildermuth, Joel Paris, Hilton Cartwright Base price of 40 lakh (approx. A$75,000) Tim David, Chris Green Base price of 30 lakh (approx. A$57,000) Ben Dwarshuis, Matt Kelly Base price of 20 lakh (approx. A$38,000) Hayden Kerr, Tanveer Sangha, Alex Ross, Jake Weatherald, Nathan McAndrew, Tom Rogers, Liam Guthrie, Liam Hatcher, Jason Sangha, Matt Short, Aidan Cahill Finch backs Cummins | 01:21 WHAT ARE THE REMAINING PURSES AND OVERSEAS AVAILABILITIES? Franchisee, Salary Cap left for the 2022 Player Auction Rs. Crore, No. of open player slots, No. of open overseas player slots Chennai Super Kings 48, 21, 7 Delhi Capitals 47.5, 21, 7 Kolkata Knight Riders 48, 21, 6 Lucknow Super Giants 59, 22, 7 Mumbai Indians 48, 21, 7 Punjab Kings 72, 23, 8 Rajasthan Royals 62, 22, 7 Royal Challengers Bangalore 57, 22, 7 Sunrisers Hyderabad 68, 22, 7 Team Ahmedabad 52, 22, 7","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"McDermott fires before Zampa, Hazlewood rip through | Australia v Sri Lanka 2021-22 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9ZEVyOVY0cjN1NTTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"McDermott fires before Zampa, Hazlewood rip through | Australia v Sri Lanka 2021-22  cricket.com.auAussie gun puts ‘cult hero’ in his place  NEWS.com.auAustralia put into bat by Sri Lanka  The Northern Daily LeaderMcDermott, Hazlewood inspire Aussie win  Illawarra Mercury‘Bloody good’: Aussie breaks 1208-day drought  NEWS.com.auView Full coverage on Google News","content":null,"pubDate":"2022-02-11 18:00:19","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘They don’t micromanage’: Player power and modern cricket coaches","link":"https://www.smh.com.au/sport/cricket/they-don-t-micromanage-player-power-and-modern-cricket-coaches-20220211-p59vo6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"Former greats have been angered by the players’ role in Justin Langer’s exit but the events of the past week show how much has changed in the past 15 years regarding what players want from a coach.","content":null,"pubDate":"2022-02-11 18:00:00","full_description":"At a selection meeting for Australia’s epic 2001 tour of India, then captain Steve Waugh argued strongly for Matthew Hayden’s inclusion. “He said to the selectors we need Matthew Hayden in the side,” recalled John Buchanan, Australia’s coach during the golden years. Neither he nor Waugh were selectors at the time. “We need him in India, not only because of his ability, but he has the character to withstand the pressure, rigours and confronting nature of an Indian tour.” Justin Langer with the players he coached for four years. Credit: Getty Images Buchanan tells this story in the context of delineating between the roles of the captain and coach. The coach, in Buchanan’s opinion, should be driving the overall direction of the team but with “one foot in the present, one in the future”, while the captain takes charge on the field. If this was the divide between players and coach, it should not surprise why many players from that era railed so hard against the circumstances around Justin Langer’s departure as coach. That Langer was a close friend to them was another factor. The role of player power in this episode has upset many of the former greats, angered by the lack of dressing-room support for Langer. The events of the past week show how much has changed in 15 years regarding what players want from a coach, and their role in shaping the environment around them. Langer eventually did change his methods but, from the comments made this week by captain Pat Cummins and selection chair George Bailey, it came too late to inspire faith he would not go back to old ways should the team start losing. There is no one size fits all. Greg Shipperd, the BBL-winning Sydney Sixers mentor who previously oversaw Victoria’s domestic dominance, sees the coach as needing to be a “performer”. Equally, one person familiar with the Australian set-up has described Langer’s unpredictable ways as being like “theatre”. Justin Langer and Pat Cummins in Hobart last month. Credit: Getty Images “You need to display light and shade,” Shipperd said. “At times you need to be soft and caring, other times you need to be firm and direct and everything in between. Having that intuition to play that performance game with your players is part of the game.” Shipperd, one of the most respected voices in Australian cricket, says players want from the head coach affirmation that the game plan worked, and they had the skills to carry it out. For a modern player perspective, take recently retired Test spinner and NSW and Sixers stalwart Stephen O’Keefe. He has a saying when it comes to coaches: “They’re not the god, they’re the glue.” O’Keefe describes himself as neutral Switzerland on the Langer issue but his comments on what he wants from a coach will resonate with players who called for change. “They’re integral but not everything, they don’t assert authority or micromanage,” O’Keefe said. “It’s a common theme in the past. Some coaches think it’s about them, it’s their ship. You can see it in press conferences and across all codes. “As soon as you see the coach controlling the whole narrative, the whole story, you know you’ll lose the group and support staff.” In 14 years as a NSW player, and one as captain, O’Keefe has seen his share of successful and dysfunctional dressing rooms. The best teams he has been a part of have had a successful captain-coach pairing. He agrees with Cummins’ belief the captain should have his voice heard on the coach. “That relationship is paramount,” O’Keefe said. “When the team environment is happy and people are on the same page you get the best out of that team. “Should the players have a say? Yes. It’s not everything. It’s not the players to pick their best mate because he’ll be the coach who will allow them to get away with absolute murder. “You’re picking an Australian team of trusted, well-respected cricketers who are at the top of their game. Why wouldn’t you ask who will make them a better player?” Buchanan agrees players should be heard but says they, like many other stakeholders in the game, do not adequately understand what a coach does. He says Cummins, in asking for a calm and collaborative approach, has only a narrow perspective of the role. Though firmly in the Langer camp, Buchanan, who enjoyed strong relationships with his captains Waugh and Ricky Ponting, was not surprised his former protégé lost out. “You need to find allies within the group and hopefully those allies are your captain and senior players – they’re important to drive change and deliver on the vision you want,” Buchanan said. “From Justin’s point of view, for whatever reason players, maybe support staff if we accept the media comments that have arisen, a number of those people haven’t jumped on board. “They have resisted or not accepted what Justin has been trying to do. In the end if you don’t have the support of the captain, some senior players, and you’re meeting resistance from the CEO and maybe high-performance director then it’s very difficult as a coach given the job you have. If you haven’t got that support it becomes untenable.”","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘They don’t micromanage’: Player power and modern cricket coaches","link":"https://www.theage.com.au/sport/cricket/they-don-t-micromanage-player-power-and-modern-cricket-coaches-20220211-p59vo6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"Former greats have been angered by the players’ role in Justin Langer’s exit but the events of the past week show how much has changed in the past 15 years regarding what players want from a coach.","content":null,"pubDate":"2022-02-11 18:00:00","full_description":"At a selection meeting for Australia’s epic 2001 tour of India, then captain Steve Waugh argued strongly for Matthew Hayden’s inclusion. “He said to the selectors we need Matthew Hayden in the side,” recalled John Buchanan, Australia’s coach during the golden years. Neither he nor Waugh were selectors at the time. “We need him in India, not only because of his ability, but he has the character to withstand the pressure, rigours and confronting nature of an Indian tour.” Justin Langer with the players he coached for four years. Credit: Getty Images Buchanan tells this story in the context of delineating between the roles of the captain and coach. The coach, in Buchanan’s opinion, should be driving the overall direction of the team but with “one foot in the present, one in the future”, while the captain takes charge on the field. If this was the divide between players and coach, it should not surprise why many players from that era railed so hard against the circumstances around Justin Langer’s departure as coach. That Langer was a close friend to them was another factor. The role of player power in this episode has upset many of the former greats, angered by the lack of dressing-room support for Langer. The events of the past week show how much has changed in 15 years regarding what players want from a coach, and their role in shaping the environment around them. Langer eventually did change his methods but, from the comments made this week by captain Pat Cummins and selection chair George Bailey, it came too late to inspire faith he would not go back to old ways should the team start losing. There is no one size fits all. Greg Shipperd, the BBL-winning Sydney Sixers mentor who previously oversaw Victoria’s domestic dominance, sees the coach as needing to be a “performer”. Equally, one person familiar with the Australian set-up has described Langer’s unpredictable ways as being like “theatre”. Justin Langer and Pat Cummins in Hobart last month. Credit: Getty Images “You need to display light and shade,” Shipperd said. “At times you need to be soft and caring, other times you need to be firm and direct and everything in between. Having that intuition to play that performance game with your players is part of the game.” Shipperd, one of the most respected voices in Australian cricket, says players want from the head coach affirmation that the game plan worked, and they had the skills to carry it out. For a modern player perspective, take recently retired Test spinner and NSW and Sixers stalwart Stephen O’Keefe. He has a saying when it comes to coaches: “They’re not the god, they’re the glue.” O’Keefe describes himself as neutral Switzerland on the Langer issue but his comments on what he wants from a coach will resonate with players who called for change. “They’re integral but not everything, they don’t assert authority or micromanage,” O’Keefe said. “It’s a common theme in the past. Some coaches think it’s about them, it’s their ship. You can see it in press conferences and across all codes. “As soon as you see the coach controlling the whole narrative, the whole story, you know you’ll lose the group and support staff.” In 14 years as a NSW player, and one as captain, O’Keefe has seen his share of successful and dysfunctional dressing rooms. The best teams he has been a part of have had a successful captain-coach pairing. He agrees with Cummins’ belief the captain should have his voice heard on the coach. “That relationship is paramount,” O’Keefe said. “When the team environment is happy and people are on the same page you get the best out of that team. “Should the players have a say? Yes. It’s not everything. It’s not the players to pick their best mate because he’ll be the coach who will allow them to get away with absolute murder. “You’re picking an Australian team of trusted, well-respected cricketers who are at the top of their game. Why wouldn’t you ask who will make them a better player?” Buchanan agrees players should be heard but says they, like many other stakeholders in the game, do not adequately understand what a coach does. He says Cummins, in asking for a calm and collaborative approach, has only a narrow perspective of the role. Though firmly in the Langer camp, Buchanan, who enjoyed strong relationships with his captains Waugh and Ricky Ponting, was not surprised his former protégé lost out. “You need to find allies within the group and hopefully those allies are your captain and senior players – they’re important to drive change and deliver on the vision you want,” Buchanan said. “From Justin’s point of view, for whatever reason players, maybe support staff if we accept the media comments that have arisen, a number of those people haven’t jumped on board. “They have resisted or not accepted what Justin has been trying to do. In the end if you don’t have the support of the captain, some senior players, and you’re meeting resistance from the CEO and maybe high-performance director then it’s very difficult as a coach given the job you have. If you haven’t got that support it becomes untenable.”","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ravi Kumar eyeing successful switch to red ball cricket","link":"https://www.thehindu.com/sport/cricket/ravi-kumar-eyeing-successful-switch-to-red-ball-cricket/article38414901.ece","keywords":null,"creator":["Y.B. Sarangi"],"video_url":null,"description":"Left-arm speedster says he has to change mindset and learn how to be more patient","content":null,"pubDate":"2022-02-11 17:23:29","full_description":null,"image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Yorkshire can host major cricket matches after ban lifted","link":"https://indianexpress.com/article/sports/cricket/yorkshire-can-host-major-cricket-matches-after-ban-lifted-7768356/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-11 16:59:49","full_description":"Yorkshire cricket club can resume hosting international matches after the sport’s governing body in England lifted its suspension on Friday in recognition of the club’s “good progress” on addressing problems of racism and bullying. Yorkshire’s Headingley Stadium will now host England’s third test against New Zealand in June and a one-day international against South Africa in July. The England and Wales Cricket Board in November suspended Yorkshire from hosting international matches as punishment for the club’s `wholly unacceptable’ response to the racism faced by former player Azeem Rafiq. https://images.indianexpress.com/2020/08/1x1.png In lifting the suspension, the ECB said it `acknowledged the hard work and good progress made by the club.’ It said Yorkshire has shown a commitment to ‘building a culture of equity, diversity and inclusion,’ and that the club has committed `to identifying and tackling historic cases of discrimination.’ Top Sports News Now IPL mega auction: Big-name veterans may not find initial takers HC suspends TTFI executive committee after Manika’s complaint A teenaged Tendulkar would wonder: Can I hit a six at Wankhede? Click here for more Friday’s decision is conditional on further requirements to be made by the end of March. Those include amending club rules related to appointing board members.","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"IND VS WI: KL Rahul, Axar Patel ruled out of T20I series, BCCI names replacements","link":"https://www.thehansindia.com/sports/cricket/ind-vs-wi-kl-rahul-axar-patel-ruled-out-of-t20i-series-bcci-names-replacements-728836","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"The three-match T20I series is set to begin next weekAll the matches are going to be played at Eden GardensKL Rahul sustained a hamstring injury during the 2nd ODI","content":"IND VS WI: KL Rahul, Axar Patel ruled out of T20I series, BCCI names replacementsIND VS WI: KL Rahul, Axar Patel ruled out of T20I series, BCCI names replacementsKL Rahul and Axar Patel have been ruled out of the Twenty20 International (T20I) series between India and West Indies, starting next week.India's vice-captain Rahul, who missed the first One-Day International (ODI) due to personal reasons, sustained a hamstring while fielding in the second ODI earlier this week. Meanwhile, Axar is still recovering from covid-19, according to an official release from the Board of Control for Cricket in India (BCCI). \"Rahul sustained an upper left hamstring strain during fielding in the 2nd ODI on 9th February 2022 while Axar has resumed the final stage of his rehabilitation after recently recovering from Covid-19. They will now head to the National Cricket Academy in Bengaluru for further management of their injury,\" said the BCCI. The Indian selectors have named Ruturaj Gaikwad and Deepak Hooda as replacements. Hooda made his India debut in the first ODI, while Gaikwad contracted covid-19 just before the series opener. The three-match T20I series is scheduled to begin on Feb. 16 at the Eden Gardens, Kolkata. Team India thrashed West Indies by 96 runs to win the third ODI on Friday and complete a clean sweep of 3-0. It was India's first whitewash win since they defeated Sri Lanka 5-0 in 2017. With that, Rohit Sharma became the eighth Indian captain to lead the team to an ODI series whitewash victory if his side wins the third ODI joining Kapil Dev, Dilip Vengsarkar, Mohammad Azharuddin, Mahendra Singh Dhoni, Gautam Gambhir, Virat Kohli, and Ajinkya Rahane. India's T20I squad: Rohit Sharma (c), Ishan Kishan, Virat Kohli, Shreyas Iyer, Surya Kumar Yadav, Rishabh Pant (wk), Venkatesh Iyer, Deepak Chahar, Shardul Thakur, Ravi Bishnoi, Yuzvendra Chahal, Washington Sundar, Mohd. Siraj, Bhuvneshwar Kumar, Avesh Khan, Harshal Patel, Ruturaj Gaikwad, Deepak Hooda.","pubDate":"2022-02-11 16:57:15","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/02/11/500x300_1270792-kl-rahul-axar-patel.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Auction 2022 UK Time: When and where to watch IPL Auction in UK and Australia?","link":"https://thesportsrush.com/cricket-news-ipl-auction-2022-uk-time-when-and-where-to-watch-ipl-auction-in-uk-and-australia/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL","IPL 2022 mega auction"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IPL Auction 2022 UK Time: The 10 franchises have geared up for the much anticipated mega auction of the 15th edition of the league. The time has nearly arrived for the commencement of one of the most exciting two-day event of India’s biggest T20 tournament. Bengaluru is ready to host the 10 IPL franchises as… The post IPL Auction 2022 UK Time: When and where to watch IPL Auction in UK and Australia? appeared first on The SportsRush.","content":"IPL Auction 2022 UK Time: The 10 franchises have geared up for the much anticipated mega auction of the 15th edition of the league. The time has nearly arrived for the commencement of one of the most exciting two-day event of India’s biggest T20 tournament. Bengaluru is ready to host the 10 IPL franchises as their respective think-tanks would assemble under a roof to kick-off the much anticipated mega auction ahead of the tournament’s 15th edition. A total of 590 names of players would go under the hammer on February 12 and 13, with the ten franchises strategizing and brainstorming their ways to form their respective squads within a purse limit of INR 90 Crore. The 590 Cricketers, comprise 220 overseas and 370 Indian players; and to further break it down 228 capped players, and 355 uncapped players. As the franchises would more or less build their respective teams from scratch, some big Indian and overseas players would be centre of attraction of the potential high-octane bidding war. Going by the buzz, Shreyas Iyer, Ishan Kishan, Shikhar Dhawan, Ravichandran Ashwin, Deepak Chahar are some of the notable Indian players likely to invite the interests of the franchises. On the other hand, the likes of David Warner, Mitchell Marsh, Kagiso Rabada, Quinton de Kock et al are some of the biggest overseas names likely to make it big at the auction tables. Big weekend coming up and wish all the best to every player, young and otherwise in the #IPLAuction Happy to see many attain financial security for themselves and their loved ones. That security is one of the things so many aspire to in this life. — Ian Bishop (@irbishi) February 11, 2022 IPL Auction 2022 UK Time As far as the Cricket fans in the United Kingdom are concerned, the live broadcast of the two-day event would commence at 6:30 am UK time on Sky Sports. For the Australian fans, the live broadcast would begin at 5:30 pm AEDT (Australian Eastern Daylight Time) on Fox Sports. Fans in India can take note of the broadcast details here. Date – 12/02/2022 (Saturday) and 13/02/2022 (Sunday). Auction start Time – 6:30 am (UK) and 5:30 pm (Australia) Broadcast alternatives – Sky Sports Cricket (UK); Fox Sports and Yupp TV (Australia). The post IPL Auction 2022 UK Time: When and where to watch IPL Auction in UK and Australia? appeared first on The SportsRush.","pubDate":"2022-02-11 16:14:06","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Highlights, India vs West Indies, 3rd ODI Match, Ful..ricket Score: India win by 96 runs, complete 3-0 sweep - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMiqQFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLWluZGlhLXZzLXdlc3QtaW5kaWVzLTNyZC1vZGktbWF0Y2gtZnVsbC1jcmlja2V0LXNjb3JlLWluZGlhLXdpbi1ieS05Ni1ydW5zLWNvbXBsZXRlLTMtMC1zd2VlcC0xMDM2MzgyMS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights, India vs West Indies, 3rd ODI Match, Ful..ricket Score: India win by 96 runs, complete 3-0 sweep  FirstpostRecent Match Report - India vs West Indies 3rd ODI 2021/22  ESPNcricinfoRevealed: Here's Why KL Rahul, Yuzvendra Chahal, Deepak Hooda, And Shardul Thakur Are Not Playing The 3rd ODI vs West Indies  Cricket AddictorIndia vs West Indies 3rd ODI 2022 Highlights, Score Updates: India thump West Indies by 96 runs to sweep the series 3-0  Times of IndiaHighlights IND vs WI 3rd ODI Scorecard: Indian Bowlers Run Riot As India Whitewash West Indies 3-0  India.comView Full coverage on Google News","content":null,"pubDate":"2022-02-11 15:49:45","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}