{"newsArray":[{"article_id":"a802f1e76d6707bff8a67f39beecf4e5","title":"HARARE DERBY SET FOR NSS RETURN","link":"https://www.herald.co.zw/harare-derby-set-for-nss-return/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium.","content":"THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. Giants Dynamos, weary of travelling to Bulawayo for their home games at Barbourfields since the giant stadium closed for renovations two months ago, have been pushing for the return to Harare. The Harare Derby, for the first time in history, was set to take place outside Harare due to the current situation with the stadiums in Harare. But Dynamos last week wrote to the Sports and Recreation Commission and are hoping for a positive response before the end of the week. Dynamos vice-chairman Vincent Chawonza yesterday told the Zimpapers Sports that the SRC acknowledged receipt of their letter and indicated considerable ground had been covered in the renovations. The stadium inspection committee is expected to run the rule before reopening the gates. “It’s not yet confirmed but what we did after returning from Bulawayo last week was that we wrote to the SRC inquiring about our return to the National Sports Stadium and they indicated the ground was due for inspection. “So we are praying that the Harare Derby be played in Harare because it’s also good for our supporters and for us as a team, financially. “We have been travelling a lot week in and week out. We are happy our fans in Bulawayo made us feel at home at Barbourfields. The supporters have been coming in good numbers and supporting us and the boys were enjoying playing there,” said Chawonza. The Premier Soccer League decided to vacate the National Sports Stadium in July to allow authorities to renovate the broken-down toilets and the water reticulation system. The venue had become overwhelmed by overuse due to the stadium crisis in Harare. However, the Sports Commission has been working behind the scenes to make the National Sports available for domestic football in the shortest possible time. An official yesterday could not give the time-lines but promised an update tomorrow on the state of the ground as well as DeMbare’s request. “We are working behind the scenes to organise the inspection. We will give an update when there is something tangible,” said the official. The reverse fixture of the Derby was played at the National Sports Stadium, with DeMbare winning 2-0. DeMbare vice chairman Chawonza yesterday said they will also make inquiries on Rufaro, which remains their preferred home ground. Rufaro has been closed for four years after it became worn out due to lack of maintenance. However, it has been undergoing renovations for the last few months. “Rufaro is central to our fans and very convenient. It is still our number one choice home venue followed by the National Sports Stadium. “So, we are planning to engage the authorities behind the stadium as well as paying a courtesy call to the new Mayor to find out his plans since there have been changes in the Council leadership. “Council had promised us that the first Derby would be played there, and it didn’t happen. We will not hesitate to jump over to Rufaro once it is available. It means a lot to us as a club,” said Chawonza. Dynamos and CAPS United have already put in place plans to hold a joint road show ahead of the Harare Derby. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club. BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday.","pubDate":"2023-09-18 22:05:39","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"cb10404d0e86da32ebc225111d19c270","title":"President salutes Streak","link":"https://www.chronicle.co.zw/president-salutes-streak/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Sports Writer THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just […]","content":"THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just over two weeks ago after losing a fierce battle to cancer. He was honoured with a State-assisted funeral in recognition of his contribution to the game. President Mnangagwa yesterday extended his condolences to the family after meeting Streak’s widow Nadine and children Charlotte, Harry and Kevin at State House. The Sports and Recreation Commission said in a brief statement yesterday that the Streak family also expressed their gratitude for the honour bestowed to the cricket icon by the Government. “This morning His Excellency, President ED Mnangagwa conveyed his condolences to Heath Streak’s widow, Nadine Streak at State House. “…Nadine Streak thanked His Excellency and the Government for honouring Heath with a State Assisted funeral. His Excellency also extended his condolences to Heath’s parents, Denis and Sheona Streak describing Heath as a ‘great sportsman and a true patriot of his country’.” Streak’s body was cremated as per his wish, two weeks ago. He will always be remembered as one of Zimbabwe’s greatest cricketers. His cricket ability was always apparent as a pace bowler who could bat, and after only one first-class match he was selected for Zimbabwe’s tour of England in 1993, and then played his first Test matches in Pakistan later that year, at the age of 19. He was a hero of Zimbabwe’s first-ever Test match victory, over Pakistan at Harare Sports Club in the 1994/95 season, taking nine wickets in the match. For most of his career, with varying degrees of support, he was the champion of Zimbabwe’s bowling, and in his 65 Test matches he took 216 wickets and remains the only Zimbabwean to have taken over 100 Test wickets, at an average of 28.14, with best figures of 6/73 in his final Test match against India in Harare in the 2005/06 season. He managed to achieve a rare feat of 2 000 runs and 200 wickets in One Day Internationals (ODIs) in just 187 appearances for the Chevrons where he scored 2 901 runs for Zimbabwe at 28,44 and 237 wickets at 29,81. He also captained his country between 2001 and 2006. After retiring from Zimbabwe cricket in 2006, he played two seasons for the English county Warwickshire and had also featured for Hampshire in 1995. He later became an excellent coach, taking charge of the national team between 2016 and 2018 leading Zimbabwe to a historic series win against Sri Lanka which was their first ever in 2017. He had also founded the Heath Streak Cricket Academy with long-time friend Joseph Rego 10 years ago. The institution, whose Trust has since entered into fruitful relationship with Old Mutual, has been instrumental in opening doors to budding cricketers in the communities. The institution held its 10th anniversary celebrations in Bulawayo with two cricket tournaments last Saturday. “As Old Mutual Zimbabwe we are honoured to have worked with the late former Zimbabwe Cricket captain, Heath Streak. His passion for the sport can be vouched for by many. “He leaves behind a legacy and we would love to keep his memory alive by continuing with what he had started and believed in. “In 2014, Mr Streak started a cricket academy with the aim to offer talented youth, and those with a desire to learn, the opportunity to showcase their abilities. “We are honoured to have been part of this project. Our journey with the legend does not end here and we will play our part to see his vision through. May his soul continue to rest in peace,” said Old Mutual in a statement recently. Gerald Sibanda, JUST a day after expressing his wish to play for the national team, Zimbabwean Daniel Msendami scored the only goal for his side Jwaneng Galaxy in their final Preliminary round first leg match against South African giants Orlando Pirates at Gaborone National Stadium on Sunday. It was his first start in the […] Innocent Kurira, WITH 33 points still up for the taking, the Castle Lager Premier Soccer League title remains there for anyone’s taking. The race to the title is heating up and none of the top sides can afford any slackening at this stage. One or two missteps could see a team fall out of […] Blessing Malinganiza MARVELOUS Nakamba’s heroics in the Luton Town midfield continue to go in vain after they suffered another 1-0 defeat at Fulham at the weekend. This becomes Town’s fourth defeat in a row, leaving them at the foot of the Premier League standings. And again, Nakamba was among the best performers on the pitch […]","pubDate":"2023-09-18 22:05:01","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"6b59187510ef4f674cae4d0573688b0c","title":"President salutes Heath Streak","link":"https://www.herald.co.zw/president-salutes-heath-streak/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.”","content":"THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 years, at his family’s farm in Inyathi, Matabeleland North, just over two weeks ago after losing a fierce battle to cancer. He was honoured with a state-assisted funeral by the Government of Zimbabwe in remembrance of his contribution to the game. President Mnangagwa yesterday extended his condolences to the family after meeting Streak’s widow Nadine and children Charlotte, Harry and Kevin at State House. The Sports and Recreation Commission said in a brief statement yesterday that the Streak family also expressed their gratitude for the honour bestowed to the cricket icon by the Government. “This morning His Excellency, President ED Mnangagwa conveyed his condolences to Heath Streak’s widow, Nadine Streak at State House. “ . . . Nadine Streak thanked His Excellency and the Government for honouring Heath with a State Assisted funeral. His Excellency also extended his condolences to Heath’s parents, Denis and Sheona Streak describing Heath as a “great sportsman and a true patriot of his country.” Streak’s body was cremated as per his wish, two weeks ago. He will always be remembered as one of Zimbabwe’s greatest cricketers. His cricket ability was always apparent as a pace bowler who could bat, and after only one first-class match he was selected for Zimbabwe’s tour of England in 1993, and then played his first Test matches in Pakistan later that year, at the age of 19. He was a hero of Zimbabwe’s first-ever Test match victory, over Pakistan at Harare Sports Club in the 1994/95 season, taking nine wickets in the match. For most of his career, with varying degrees of support, he was the champion of Zimbabwe’s bowling, and in his 65 Test matches he took 216 wickets and remains the only Zimbabwean to have taken over 100 Test wickets, at an average of 28.14, with best figures of 6/73 in his final Test match against India in Harare in the 2005/06 season. He managed to achieve a rare feat of 2 000 runs and 200 wickets in One Day Internationals (ODIs) in just 187 appearances for the Chevrons where he scored 2 901 runs for Zimbabwe at 28,44 and 237 wickets at 29,81. He also captained his country between 2001 and 2006. After retiring from Zimbabwe cricket in 2006, he played two seasons for the English county Warwickshire and had also featured for Hampshire in 1995. He later became an excellent coach, taking charge of the national team between 2016 and 2018 leading Zimbabwe to a historic series win against Sri Lanka which was their first ever in 2017. He had also founded the Heath Streak Cricket Academy with long-time friend Joseph Rego 10 years ago. The institution, whose Trust has since entered into fruitful relationship with Old Mutual, has been instrumental in opening doors to budding cricketers in the communities. The institution held its 10th anniversary celebrations in Bulawayo with two cricket tournaments last Saturday. “As Old Mutual Zimbabwe we are honoured to have worked with the late former Zimbabwe Cricket captain, Heath Streak. His passion for the sport can be vouched for by many. “He leaves behind a legacy and we would love to keep his memory alive by continuing with what he had started and believed in. “In 2014, Mr Streak started a cricket academy with the aim to offer talented youth, and those with a desire to learn, the opportunity to showcase their abilities. “We are honoured to have been part of this project. Our journey with the legend does not end here and we will play our part to see his vision through. May his soul continue to rest in peace,” said Old Mutual in a statement recently. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club. BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday.","pubDate":"2023-09-18 22:04:43","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"017e14698ed810f043b709a49e03c113","title":"Wolves hail Zim teen Chirewa","link":"https://www.herald.co.zw/wolves-hail-zim-teen-chirewa/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","content":"ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club. The 19-year-old Chirewa joined the Wolves Under-21s to bolster their midfield ranks and they even look at him as ripe to make an impact in the short term. He joined Wolves from Ipswich Town in the Championship and becomes the second player to link-up with James Collins’ side for 2023/24 following the earlier arrival of Matty Whittingham. Ipswich said they received compensation from Wolves. “The Club can confirm Tawanda Chirewa has joined Wolverhampton Wanderers, with Town receiving an undisclosed compensation fee. “After making his Town debut as a 15-year-old in an EFL Trophy clash with Colchester in 2019, Tawanda ultimately made a total of three senior appearances for the Club, all in cup competitions. “He has now joined Premier League side Wolves, with the Club wishing him well for the future,” said Ipswich in a statement. Chirewa made his senior debut for Ipswich in November 2019, appearing as a second half substitute against Colchester United in an EFL Trophy group stage fixture. In the process, he became the second youngest player to feature for the Tractor Boys, behind Connor Wickham, aged just 16 years and 31 days old. In July 2020, Chirewa signed a two-year scholarship at Portman Road and was then rewarded with a first professional contract four months later. Wolves Academy manager for football, Jon Hunter-Barrett, has explained how Chirewa has been on the club’s radar for some time and said: “It’s one that we’re delighted to get over the line. We’ve been watching Tawanda for a while now, since the age of 16, and monitoring his progress before picking the right opportunity to approach and get him across for his services. “His key qualities are his handling of the ball in tight areas and an ability to get the team up the pitch to create and score from deep areas. “As always, with one of our key strategies of looking at loan opportunities for our players at the right time, the departures of Harvey (Griffiths) and Alfie (Pond) and steady progression of one or two others into the first-team squad, it was important we strengthened our under-21s to ensure they have the ability to compete throughout the season.” Head of UK academy recruitment, Harry Hooman, added: “Tawanda is someone we have liked and monitored for a long time, dating back to when he was an under-16. Although nothing happened at the time, we continued to monitor his development closely over the last few seasons. “He is an athletic, talented player with the ability to score and create goals. He wants to get on the ball and is not afraid to take responsibility and take risks to make things happen. “We feel he has the attributes and potential to do well for us both in the short and long-term. This is a fresh challenge for him and we are excited to see him kick on again with us.” BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday. THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela. THE National Premier League cricket tournament winners look set to be decided on the final day after the seemingly invincible Gladiators suffered their first defeat of the season at Takashinga Sports Club on Sunday.","pubDate":"2023-09-18 22:03:33","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"ef4ad846940824c167397dbedfce25f7","title":"WATCH: Homela supports regional games","link":"https://www.chronicle.co.zw/watch-homela-supports-regional-games/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Lovemore Dube THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players. He also called for the introduction of a selection committee. A member of the technical committee put in place by the Normalisation Committee, legendary footballer Gibson Homela, who is also a coaches’ instructor believes in […]","content":"Sports Writer THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just […] Gerald Sibanda, JUST a day after expressing his wish to play for the national team, Zimbabwean Daniel Msendami scored the only goal for his side Jwaneng Galaxy in their final Preliminary round first leg match against South African giants Orlando Pirates at Gaborone National Stadium on Sunday. It was his first start in the […] Innocent Kurira, WITH 33 points still up for the taking, the Castle Lager Premier Soccer League title remains there for anyone’s taking. The race to the title is heating up and none of the top sides can afford any slackening at this stage. One or two missteps could see a team fall out of […]","pubDate":"2023-09-18 22:02:05","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"221a02b8e654351530d3dc2823b59e2a","title":"Zim Saints expelled from Div One","link":"https://www.herald.co.zw/zim-saints-expelled-from-div-one/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday.","content":"BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday. Saints were expelled for failure to pay Affiliation fees in full and for many walkovers. The club has felt the financial heat in the absence of a dedicated sponsor with individuals who have stood by the club also feeling the heat and fatigue of having to dig from their pockets at the expense of their families. But management has assured sympathisers and members that it is not the end of the journey for the club. Ishmael Kaguru, the Zimbabwe Saints acting chairman who has over the past 30 years been among those that have stood solidly behind the historic football project THAT boasts some big names in its player list like William Sibanda, Gibson Homela, Agent Sawu, Ephraim Chawanda, Muzondiwa Mugadza, Moses Moyo and the late Vice President of Zimbabwe Joseph Msika, described Friday as an unfortunate day in the history of the institution. He said the lack of support from the business sector had affected the club’s day-to-day survival. “It’s very unfortunate that we have now been expelled from the league, but irrespective of that, the situation is beyond our control considering where we stand right now as a nation economically,” said a despairing Kaguru who has held fort in trying times. He said their bubble was burst last year when their “benefactor” Adrian “Adachi” Mtungwazi withdrew his support of the club to start his own project that is campaigning in the same league they were expelled from. Kaguru said Adachi had given them a glimmer of hope for revival. The club which used to be the biggest in Bulawayo in the 1960s and 1970s, has struggled to stand on its own in the last 25 years and has been a “yo-yo” team shuttling between non-existence, Division Two, juniors, Premiership and Division One. “We were hoping that when we got the sponsorship from Adachi last year, we would push with them, but unfortunately somewhere along the lines, things did not go our way,” said Kaguru. He assured Zimbabweans that it is not the end of the road for the club whose legacy is etched among the biggest and most successful clubs ever, in Zimbabwe. Kaguru said they will go the academy and lower division route next year. “It is not the end of Zimbabwe Saints, the way forward is that probably next year we will go back, probably to Division Four where we will start afresh and we are also planning on an academy, so Zimbabwe Saints will never die. One day the economy will pick up, and one day we will get a sponsor so that we get back to our roots, so it’s all about money and nothing else,” said the acting chairman. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","pubDate":"2023-09-18 22:01:57","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"1c14a40c3c91285359f3a59accf539cd","title":"Homela supports regional games","link":"https://www.herald.co.zw/homela-supports-regional-games/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela.","content":"THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela. He also called for the introduction of a selection committee. A member of the technical committee put in place by the Normalisation Committee, legendary footballer Gibson Homela, who is also a coaches’ instructor believes in the process. He said it will provide a wider selection base for the coaches. “The idea is to provide ourselves with a very broad selection base. Imagine where you are going to have four regions playing and out of those four regions, the coaches or the technical committee is going to be privileged in selecting the best players out of the four regions,” said Homela. He said he was concerned with how they had gone about the business of selecting national teams in the past. Homela made reference to the team that faced Namibia on President Mnangagwa’s inauguration two weeks ago. He said in the limited time they had, he would not fault the selectors. “I had the privilege to watch Zimbabwe playing against Namibia two weeks ago and I wouldn’t say it was a job well done because I thought it was something done in Harare and it was something done with a lot of limitation in selecting the players. I personally think we must be broad and also remember there is also the diaspora players which were not in that selection,” said Homela. He called for a tracking mechanism that would ensure a thorough job is done and the best get to represent their country. “I really wish there was a tracking mechanism (to track diaspora players) where we are able to keep track of the individual when he plays but at the moment, the other day I was surprised to listen to someone who came up with a selection, I think there were about 11 foreign based players, some I know but the rest I didn’t know, so I think if that is going to be the criteria by which we will choose the national team I beg to differ,” said Homela. Asked what he did during his time as national team coach and technical adviser, Homela confessed that the process was not that good. “I must confess they were very limited then (foreign based players) and I must also confess that our system was also short then. It was not a system that we can rely upon, I think people were chosen because I knew there was Gibson in Scotland and those that I didn’t know were left out,” said Homela a great striker turned defender at both club and national team. He advocated for a selection panel. “They should be a selection committee, their task should be to follow up, investigating and finding out all those that are abroad and not only do they concentrate on those that are abroad, they also come home and also look for the better players, that is the selection committee or the technical committee. “National team players, I would say you can go down 17, you can also get a very good national team player at the age of 17 so when we look at these players, we must expand our selection base, go wide,” said Homela. Homela said age should not be a factor for the national team. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","pubDate":"2023-09-18 22:01:42","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"b7306c3f9200107073fda6c4d0fdb335","title":"Gladiators suffer first NPL defeat","link":"https://www.herald.co.zw/gladiators-suffer-first-npl-defeat/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE National Premier League cricket tournament winners look set to be decided on the final day after the seemingly invincible Gladiators suffered their first defeat of the season at Takashinga Sports Club on Sunday.","content":"THE National Premier League cricket tournament winners look set to be decided on the final day after the seemingly invincible Gladiators suffered their first defeat of the season at Takashinga Sports Club on Sunday. Gladiators suffered a three-wicket loss to Westside in a thrilling finish to their match. The man to open the first cracks in the Gladiators team was Prosper Mugeri, who took their first three wickets to fall after they were put in to bat. This included the vital wicket of Wessly Madhevere, who scored 36 opening the batting, which proved to be the top score of the innings. After that the Gladiators batting was quite indifferent, as three of their middle order reached double figures but failed to build an innings and go beyond 20, while the tail-enders batted weakly, the last four men scraping together only five runs among them to total 161. Mugeri in six overs took three wickets for 30 runs, while Tinashe Muchawaya finished off the tail with three for 29. Westside had a golden opportunity now to become the first team to beat Gladiators, but they had a fight on their hands. Tinashe Chiorah (36) and Definate Mawadzi (21) laid the foundation by scoring 46 for the first wicket, but apart from 28 from Tinashe Chimbambo the middle order did little. When the seventh wicket fell at 113 it seemed that Westside had lost their chance and Gladiators were about to claim another victory after all. Then came the most thrilling stage of the match, as Frank Mwazviita joined Vincent Masekesa and the two fought the best Gladiators could throw at them as they kept their eyes on the target. For 13 overs they stayed together, Masekesa as captain playing a very careful, responsible innings, while Mwazviita was more aggressive, hitting well when he had opportunity. They did have plenty of time, and in the end with great jubilation they reached their target after a partnership of 49, Masekesa finishing on 17 and Mwazviita 31. It was a wonderful victory for Westside, who have the honour of becoming the first team to lower the colours of the great Gladiators team as they were on the verge of securing another NPL title. At Kwekwe Sports Club, Takashinga Patriots 1 got the better of Amakhosi, who were tormented by the spin of Wellington Masakadza, by eight wickets. Gunda did his best to hold his team together with 34, but they were all out for 71 in the 25th over, with Masakadza taking four wickets for 26 in his nine overs. Takashinga lost two wickets for 38, but Tinashe Kamunhukamwe hit 26 not out off 15 balls and, helped by 16 not out from Joylord Gumbie, took the Harare side to an eight-wicket victory. At Queens Sports Club, splendid all-round performances from Carl Mumba and Victor Chirwa were the main factors in Kadoma’s convincing 195-run victory over the hosts. The visitors chose to bat and a fine innings of Mumba, who smashed 93 off 48 balls, with four sixes and nine fours before being bowled by the last ball of the innings, and Chirwa, 61 not out off 60 balls. They put on 138 in less than 14 overs for the seventh wicket, giving a total of 289 for seven wickets. In response, the only batter able to stay long was Tinaye Shayamano with 31, and Queens were dismissed for 94 in 22.2 overs. Mumba’s figures were five wickets for 31 and Chirwa had four for 16. At Masvingo Sports Club, fifties from Tadiwanashe Marumani and Tafadzwa Mahachi gave Uprising an advantage in their 193-run victory over Golden Bulls. Marumani played one of his brilliant attacking innings to score 61 off 39 balls and was backed up by Mahachi with an almost equally dazzling score of 86 off 61 balls, and later Aisha Chibanda hit 66 to take the eventual Uprising score to 295 all out. Golden Bulls were unable to put up a fight and were dismissed in 28.2 overs for 102, with no batter able to reach 20. Jeremiah Makanya was the best of the bowlers with four wickets for 25. At Mutare Sports Club, a brilliant innings of 95 off 88 balls by Aliakbar Hamid propelled Takashinga Patriots 2 to a fine eight-wicket victory over the hosts. – 161 all out in 26.4 overs (Wessly Madhevere 36, Tony Munyonga 24, Owen Muzondo 20; Tinashe Muchawaya 3/29, Prosper Mugeri 3/30, Mashford Shungu 2/34) – 162-7 in 35.1 overs (Tinashe Chiorah 36, Frank Mazviita 31*, Tinashe Chimbambo 28; Milton Shumba 2/26, Malcom Chikuhwa 2/34, Ashley Mufandauya 1/7) – 71 all out in 24.4 overs (Farai Gunda 34*, Keith Ndlovu 21, Admire Mupembe 4*; Wellington Masakadza 4/26, Tapiwa Mufudza 2/12, Roy Kaia 2/17) – 73-2 in 11 overs (Tinashe Kamunhukamwe 26*, Cunningham Ncube 21, Joylord Gumbie 16*; Cedric Dube 1/13, Shaun Dzakatira 1/26) …. – 289-7 in 45 overs (Carl Mumba 93, Victor Chirwa 61*, Bright Matsiwe 47; Isheunopa Musekwa 4/45, Petros Sithole 1/51, Tanatswa Bechani 1/53) – 94 all out 22.2 overs (Tinaye Shayamano 31, Tanatswa Bechani 22, Donald Tapfuma 14; Carl Mumba 5/31, Victor Chirwa 4/16) RESULT: Kadoma Sports Club won by 195 runs …. – 208-9 in 42 overs (Nigel Bonyongwe 61, Donald Tiripano 50, Michael Maposa 29; Cuthbert Musoko 4/53, Takudzwa Chataira 3/33, Daich Nyandoro 2/43) – 212-2 in 32.4 overs (Aliakbar Ali 95, Baxon Gopito 45, Rodney Mupfudza 41*; Silent Mujaji 1/25, Tendai Chatara 1/38) ….. – 295 all out in 39 overs (Tafadzwa Mahachi 86, Aisha Chibanda 66, Tadiwanashe Marumani 61; Elvin Nxumalo 4/33, Marshall Maruta 3/32, Shallom Mangudze 2/47) – 102 all out in 28.2 overs (Luyanda Mutomba 18, Tendai Tapera 17, Kelvin Mabvute 13; Jeremiah Makanya 4/25, Anesu Mlambo 2/19, Kudakwashe Katumba 2/22) Latest NPL Standings P W L T NR PTS NRR Gladiators 12 11 1 0 0 110 1.710 Takashinga 2 12 10 1 0 1 106 1.246 Takashinga 1 12 10 2 0 0 100 3.108 Uprising 12 10 2 0 0 100 1.850 Westside 12 8 3 0 1 86 1.528 Mutare 12 7 5 0 0 70 0.606 Rainbow 12 6 5 1 0 66 0.053 Kadoma 12 5 7 0 0 50 0.746 Amakhosi 12 5 7 0 0 50 -0.631 Queens 12 3 9 0 0 30 -0.638 BAC 12 3 9 0 0 30 -1.597 Scorpions 12 2 9 1 0 26 -1.425 Mbizo 12 2 10 0 0 20 -2.114 Golden Bulls 12 0 12 0 0 0 -3.846 THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela. ZIFA Normalisation Committee is set to appoint the Mighty Warriors coach this Thursday. The gaffer is expected to quickly select the players that will go into camp early next week ahead of the COSAFA Women’s Championship. Dynamos midfielder Tanaka “Kante” Shandirwa says he has adapted well since joining the club from Castle Lager Premier Soccer league side, Yadah.","pubDate":"2023-09-18 22:01:36","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"823b1da11a0cbb0a608412df35674ba3","title":"Three in race for Mighty Warriors top job","link":"https://www.herald.co.zw/three-in-race-for-mighty-warriors-top-job/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIFA Normalisation Committee is set to appoint the Mighty Warriors coach this Thursday. The gaffer is expected to quickly select the players that will go into camp early next week ahead of the COSAFA Women’s Championship.","content":"ZIFA Normalisation Committee is set to appoint the Mighty Warriors coach this Thursday. The gaffer is expected to quickly select the players that will go into camp early next week ahead of the COSAFA Women’s Championship. The regional tournament will run from October 4 to 15 in South Africa, Gauteng province. The southern regional tournament will be the first competition for Zimbabwean senior women’s football since the country was re-admitted into international football. According to Normalisation Committee member Rosemary Mugadza, they have shortlisted three coaches. The interviews will take place today and tomorrow. The Committee chaired by Lincoln Mutasa is then expected to appoint the coach. Zimbabwe missed the 2022 Women’s Championships edition due to suspension. “We are expecting to appoint the coach on Thursday. We will have the interviews on Tuesday and Wednesday then on Thursday, we will put the coach in place. “As the Normalisation Committee, we want the Mighty Warriors to be in camp for two weeks. The team is scheduled to arrive in South Africa on the 3rd, so we hope by Monday they will be getting into camp,” said Mugadza. The Mighty Warriors are in the same group as Namibia, Botswana and Lesotho. 12 countries will battle for the title with the top team in each group qualifying automatically for the semi-finals as well as the best runner from all the three groups. Record winners and hosts South Africa are in Group A alongside Malawi, Madagascar and Eswatini while Group B has Zambia, Mozambique, Angola and Comoros. The Mighty Warriors who won the Championship once in 2011 when they hosted the regional tournament at Rufaro stadium have a lot of work to do to reclaim the past glory. They last participated in the tournament in 2021 where they failed to progress beyond the group stage. The other countries that have won the regional title once are Zambia who are the defending champions while perennial East African guests Tanzania won the title in 2021. South Africa Banyana Banyana are the record winners having won seven of the previous 10 Championships. Meanwhile, the Zimbabwe Women’s Football Super League entered Match Day 18 with routine victories from pacesetters Herentals Queens who beat MSU Queens 1-0 at Motor Action Sports Club. The Students consolidated their position and have 45 points from 17 matches. They are followed by Harare City Queens who have 45 points from 18 games. Black Rhinos Queens are third with 40 points having played 16 games. Chapungu Queens also have 40 points from 16 games and Correctional Queens are fifth placed with 39 points from 17 outings. Herentals Queens 1, MSU Queens 0; Platinum Royals 1, Chipembere Queens 1; Correctional Queens 3, Yadah Queens 0; Shine Shine Queens 0, Harare City Queens 3 (walkover), Queen Lozikeyi 1, Maningi Youth Academy 1. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","pubDate":"2023-09-18 22:01:30","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"98453e51a1b8be9cc605dd9735f4bea4","title":"WATCH: Chaenda Chikwata, as Saints expelled from Division One","link":"https://www.chronicle.co.zw/watch-chaenda-chikwata-as-saints-expelled-from-division-one/","keywords":["Sport","Uncategorized"],"creator":["Chronicle Editor"],"video_url":null,"description":"Lovemore Dube FRIDAY, September 15, 2023 was not ordinary day for Bulawayo and Zimbabwe football as Zimbabwe Saints FC were expelled from the Zifa Southern Region Division One League. Behind Bulawayo Rovers FC and Highlanders FC, Chikwata as Saints were affectionately called by their multitudes of fans, are the city’s second most successful club. Saints […]","content":"Sports Writer THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just […] Gerald Sibanda, JUST a day after expressing his wish to play for the national team, Zimbabwean Daniel Msendami scored the only goal for his side Jwaneng Galaxy in their final Preliminary round first leg match against South African giants Orlando Pirates at Gaborone National Stadium on Sunday. It was his first start in the […] Innocent Kurira, WITH 33 points still up for the taking, the Castle Lager Premier Soccer League title remains there for anyone’s taking. The race to the title is heating up and none of the top sides can afford any slackening at this stage. One or two missteps could see a team fall out of […]","pubDate":"2023-09-18 22:01:21","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"a802f1e76d6707bff8a67f39beecf4e5","title":"HARARE DERBY SET FOR NSS RETURN","link":"https://www.herald.co.zw/harare-derby-set-for-nss-return/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium.","content":"THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. Giants Dynamos, weary of travelling to Bulawayo for their home games at Barbourfields since the giant stadium closed for renovations two months ago, have been pushing for the return to Harare. The Harare Derby, for the first time in history, was set to take place outside Harare due to the current situation with the stadiums in Harare. But Dynamos last week wrote to the Sports and Recreation Commission and are hoping for a positive response before the end of the week. Dynamos vice-chairman Vincent Chawonza yesterday told the Zimpapers Sports that the SRC acknowledged receipt of their letter and indicated considerable ground had been covered in the renovations. The stadium inspection committee is expected to run the rule before reopening the gates. “It’s not yet confirmed but what we did after returning from Bulawayo last week was that we wrote to the SRC inquiring about our return to the National Sports Stadium and they indicated the ground was due for inspection. “So we are praying that the Harare Derby be played in Harare because it’s also good for our supporters and for us as a team, financially. “We have been travelling a lot week in and week out. We are happy our fans in Bulawayo made us feel at home at Barbourfields. The supporters have been coming in good numbers and supporting us and the boys were enjoying playing there,” said Chawonza. The Premier Soccer League decided to vacate the National Sports Stadium in July to allow authorities to renovate the broken-down toilets and the water reticulation system. The venue had become overwhelmed by overuse due to the stadium crisis in Harare. However, the Sports Commission has been working behind the scenes to make the National Sports available for domestic football in the shortest possible time. An official yesterday could not give the time-lines but promised an update tomorrow on the state of the ground as well as DeMbare’s request. “We are working behind the scenes to organise the inspection. We will give an update when there is something tangible,” said the official. The reverse fixture of the Derby was played at the National Sports Stadium, with DeMbare winning 2-0. DeMbare vice chairman Chawonza yesterday said they will also make inquiries on Rufaro, which remains their preferred home ground. Rufaro has been closed for four years after it became worn out due to lack of maintenance. However, it has been undergoing renovations for the last few months. “Rufaro is central to our fans and very convenient. It is still our number one choice home venue followed by the National Sports Stadium. “So, we are planning to engage the authorities behind the stadium as well as paying a courtesy call to the new Mayor to find out his plans since there have been changes in the Council leadership. “Council had promised us that the first Derby would be played there, and it didn’t happen. We will not hesitate to jump over to Rufaro once it is available. It means a lot to us as a club,” said Chawonza. Dynamos and CAPS United have already put in place plans to hold a joint road show ahead of the Harare Derby. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club. BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday.","pubDate":"2023-09-18 22:05:39","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"cb10404d0e86da32ebc225111d19c270","title":"President salutes Streak","link":"https://www.chronicle.co.zw/president-salutes-streak/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Sports Writer THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just […]","content":"THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just over two weeks ago after losing a fierce battle to cancer. He was honoured with a State-assisted funeral in recognition of his contribution to the game. President Mnangagwa yesterday extended his condolences to the family after meeting Streak’s widow Nadine and children Charlotte, Harry and Kevin at State House. The Sports and Recreation Commission said in a brief statement yesterday that the Streak family also expressed their gratitude for the honour bestowed to the cricket icon by the Government. “This morning His Excellency, President ED Mnangagwa conveyed his condolences to Heath Streak’s widow, Nadine Streak at State House. “…Nadine Streak thanked His Excellency and the Government for honouring Heath with a State Assisted funeral. His Excellency also extended his condolences to Heath’s parents, Denis and Sheona Streak describing Heath as a ‘great sportsman and a true patriot of his country’.” Streak’s body was cremated as per his wish, two weeks ago. He will always be remembered as one of Zimbabwe’s greatest cricketers. His cricket ability was always apparent as a pace bowler who could bat, and after only one first-class match he was selected for Zimbabwe’s tour of England in 1993, and then played his first Test matches in Pakistan later that year, at the age of 19. He was a hero of Zimbabwe’s first-ever Test match victory, over Pakistan at Harare Sports Club in the 1994/95 season, taking nine wickets in the match. For most of his career, with varying degrees of support, he was the champion of Zimbabwe’s bowling, and in his 65 Test matches he took 216 wickets and remains the only Zimbabwean to have taken over 100 Test wickets, at an average of 28.14, with best figures of 6/73 in his final Test match against India in Harare in the 2005/06 season. He managed to achieve a rare feat of 2 000 runs and 200 wickets in One Day Internationals (ODIs) in just 187 appearances for the Chevrons where he scored 2 901 runs for Zimbabwe at 28,44 and 237 wickets at 29,81. He also captained his country between 2001 and 2006. After retiring from Zimbabwe cricket in 2006, he played two seasons for the English county Warwickshire and had also featured for Hampshire in 1995. He later became an excellent coach, taking charge of the national team between 2016 and 2018 leading Zimbabwe to a historic series win against Sri Lanka which was their first ever in 2017. He had also founded the Heath Streak Cricket Academy with long-time friend Joseph Rego 10 years ago. The institution, whose Trust has since entered into fruitful relationship with Old Mutual, has been instrumental in opening doors to budding cricketers in the communities. The institution held its 10th anniversary celebrations in Bulawayo with two cricket tournaments last Saturday. “As Old Mutual Zimbabwe we are honoured to have worked with the late former Zimbabwe Cricket captain, Heath Streak. His passion for the sport can be vouched for by many. “He leaves behind a legacy and we would love to keep his memory alive by continuing with what he had started and believed in. “In 2014, Mr Streak started a cricket academy with the aim to offer talented youth, and those with a desire to learn, the opportunity to showcase their abilities. “We are honoured to have been part of this project. Our journey with the legend does not end here and we will play our part to see his vision through. May his soul continue to rest in peace,” said Old Mutual in a statement recently. Gerald Sibanda, JUST a day after expressing his wish to play for the national team, Zimbabwean Daniel Msendami scored the only goal for his side Jwaneng Galaxy in their final Preliminary round first leg match against South African giants Orlando Pirates at Gaborone National Stadium on Sunday. It was his first start in the […] Innocent Kurira, WITH 33 points still up for the taking, the Castle Lager Premier Soccer League title remains there for anyone’s taking. The race to the title is heating up and none of the top sides can afford any slackening at this stage. One or two missteps could see a team fall out of […] Blessing Malinganiza MARVELOUS Nakamba’s heroics in the Luton Town midfield continue to go in vain after they suffered another 1-0 defeat at Fulham at the weekend. This becomes Town’s fourth defeat in a row, leaving them at the foot of the Premier League standings. And again, Nakamba was among the best performers on the pitch […]","pubDate":"2023-09-18 22:05:01","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"6b59187510ef4f674cae4d0573688b0c","title":"President salutes Heath Streak","link":"https://www.herald.co.zw/president-salutes-heath-streak/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.”","content":"THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 years, at his family’s farm in Inyathi, Matabeleland North, just over two weeks ago after losing a fierce battle to cancer. He was honoured with a state-assisted funeral by the Government of Zimbabwe in remembrance of his contribution to the game. President Mnangagwa yesterday extended his condolences to the family after meeting Streak’s widow Nadine and children Charlotte, Harry and Kevin at State House. The Sports and Recreation Commission said in a brief statement yesterday that the Streak family also expressed their gratitude for the honour bestowed to the cricket icon by the Government. “This morning His Excellency, President ED Mnangagwa conveyed his condolences to Heath Streak’s widow, Nadine Streak at State House. “ . . . Nadine Streak thanked His Excellency and the Government for honouring Heath with a State Assisted funeral. His Excellency also extended his condolences to Heath’s parents, Denis and Sheona Streak describing Heath as a “great sportsman and a true patriot of his country.” Streak’s body was cremated as per his wish, two weeks ago. He will always be remembered as one of Zimbabwe’s greatest cricketers. His cricket ability was always apparent as a pace bowler who could bat, and after only one first-class match he was selected for Zimbabwe’s tour of England in 1993, and then played his first Test matches in Pakistan later that year, at the age of 19. He was a hero of Zimbabwe’s first-ever Test match victory, over Pakistan at Harare Sports Club in the 1994/95 season, taking nine wickets in the match. For most of his career, with varying degrees of support, he was the champion of Zimbabwe’s bowling, and in his 65 Test matches he took 216 wickets and remains the only Zimbabwean to have taken over 100 Test wickets, at an average of 28.14, with best figures of 6/73 in his final Test match against India in Harare in the 2005/06 season. He managed to achieve a rare feat of 2 000 runs and 200 wickets in One Day Internationals (ODIs) in just 187 appearances for the Chevrons where he scored 2 901 runs for Zimbabwe at 28,44 and 237 wickets at 29,81. He also captained his country between 2001 and 2006. After retiring from Zimbabwe cricket in 2006, he played two seasons for the English county Warwickshire and had also featured for Hampshire in 1995. He later became an excellent coach, taking charge of the national team between 2016 and 2018 leading Zimbabwe to a historic series win against Sri Lanka which was their first ever in 2017. He had also founded the Heath Streak Cricket Academy with long-time friend Joseph Rego 10 years ago. The institution, whose Trust has since entered into fruitful relationship with Old Mutual, has been instrumental in opening doors to budding cricketers in the communities. The institution held its 10th anniversary celebrations in Bulawayo with two cricket tournaments last Saturday. “As Old Mutual Zimbabwe we are honoured to have worked with the late former Zimbabwe Cricket captain, Heath Streak. His passion for the sport can be vouched for by many. “He leaves behind a legacy and we would love to keep his memory alive by continuing with what he had started and believed in. “In 2014, Mr Streak started a cricket academy with the aim to offer talented youth, and those with a desire to learn, the opportunity to showcase their abilities. “We are honoured to have been part of this project. Our journey with the legend does not end here and we will play our part to see his vision through. May his soul continue to rest in peace,” said Old Mutual in a statement recently. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club. BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday.","pubDate":"2023-09-18 22:04:43","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"017e14698ed810f043b709a49e03c113","title":"Wolves hail Zim teen Chirewa","link":"https://www.herald.co.zw/wolves-hail-zim-teen-chirewa/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","content":"ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club. The 19-year-old Chirewa joined the Wolves Under-21s to bolster their midfield ranks and they even look at him as ripe to make an impact in the short term. He joined Wolves from Ipswich Town in the Championship and becomes the second player to link-up with James Collins’ side for 2023/24 following the earlier arrival of Matty Whittingham. Ipswich said they received compensation from Wolves. “The Club can confirm Tawanda Chirewa has joined Wolverhampton Wanderers, with Town receiving an undisclosed compensation fee. “After making his Town debut as a 15-year-old in an EFL Trophy clash with Colchester in 2019, Tawanda ultimately made a total of three senior appearances for the Club, all in cup competitions. “He has now joined Premier League side Wolves, with the Club wishing him well for the future,” said Ipswich in a statement. Chirewa made his senior debut for Ipswich in November 2019, appearing as a second half substitute against Colchester United in an EFL Trophy group stage fixture. In the process, he became the second youngest player to feature for the Tractor Boys, behind Connor Wickham, aged just 16 years and 31 days old. In July 2020, Chirewa signed a two-year scholarship at Portman Road and was then rewarded with a first professional contract four months later. Wolves Academy manager for football, Jon Hunter-Barrett, has explained how Chirewa has been on the club’s radar for some time and said: “It’s one that we’re delighted to get over the line. We’ve been watching Tawanda for a while now, since the age of 16, and monitoring his progress before picking the right opportunity to approach and get him across for his services. “His key qualities are his handling of the ball in tight areas and an ability to get the team up the pitch to create and score from deep areas. “As always, with one of our key strategies of looking at loan opportunities for our players at the right time, the departures of Harvey (Griffiths) and Alfie (Pond) and steady progression of one or two others into the first-team squad, it was important we strengthened our under-21s to ensure they have the ability to compete throughout the season.” Head of UK academy recruitment, Harry Hooman, added: “Tawanda is someone we have liked and monitored for a long time, dating back to when he was an under-16. Although nothing happened at the time, we continued to monitor his development closely over the last few seasons. “He is an athletic, talented player with the ability to score and create goals. He wants to get on the ball and is not afraid to take responsibility and take risks to make things happen. “We feel he has the attributes and potential to do well for us both in the short and long-term. This is a fresh challenge for him and we are excited to see him kick on again with us.” BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday. THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela. THE National Premier League cricket tournament winners look set to be decided on the final day after the seemingly invincible Gladiators suffered their first defeat of the season at Takashinga Sports Club on Sunday.","pubDate":"2023-09-18 22:03:33","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"ef4ad846940824c167397dbedfce25f7","title":"WATCH: Homela supports regional games","link":"https://www.chronicle.co.zw/watch-homela-supports-regional-games/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Lovemore Dube THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players. He also called for the introduction of a selection committee. A member of the technical committee put in place by the Normalisation Committee, legendary footballer Gibson Homela, who is also a coaches’ instructor believes in […]","content":"Sports Writer THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just […] Gerald Sibanda, JUST a day after expressing his wish to play for the national team, Zimbabwean Daniel Msendami scored the only goal for his side Jwaneng Galaxy in their final Preliminary round first leg match against South African giants Orlando Pirates at Gaborone National Stadium on Sunday. It was his first start in the […] Innocent Kurira, WITH 33 points still up for the taking, the Castle Lager Premier Soccer League title remains there for anyone’s taking. The race to the title is heating up and none of the top sides can afford any slackening at this stage. One or two missteps could see a team fall out of […]","pubDate":"2023-09-18 22:02:05","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"221a02b8e654351530d3dc2823b59e2a","title":"Zim Saints expelled from Div One","link":"https://www.herald.co.zw/zim-saints-expelled-from-div-one/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday.","content":"BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday. Saints were expelled for failure to pay Affiliation fees in full and for many walkovers. The club has felt the financial heat in the absence of a dedicated sponsor with individuals who have stood by the club also feeling the heat and fatigue of having to dig from their pockets at the expense of their families. But management has assured sympathisers and members that it is not the end of the journey for the club. Ishmael Kaguru, the Zimbabwe Saints acting chairman who has over the past 30 years been among those that have stood solidly behind the historic football project THAT boasts some big names in its player list like William Sibanda, Gibson Homela, Agent Sawu, Ephraim Chawanda, Muzondiwa Mugadza, Moses Moyo and the late Vice President of Zimbabwe Joseph Msika, described Friday as an unfortunate day in the history of the institution. He said the lack of support from the business sector had affected the club’s day-to-day survival. “It’s very unfortunate that we have now been expelled from the league, but irrespective of that, the situation is beyond our control considering where we stand right now as a nation economically,” said a despairing Kaguru who has held fort in trying times. He said their bubble was burst last year when their “benefactor” Adrian “Adachi” Mtungwazi withdrew his support of the club to start his own project that is campaigning in the same league they were expelled from. Kaguru said Adachi had given them a glimmer of hope for revival. The club which used to be the biggest in Bulawayo in the 1960s and 1970s, has struggled to stand on its own in the last 25 years and has been a “yo-yo” team shuttling between non-existence, Division Two, juniors, Premiership and Division One. “We were hoping that when we got the sponsorship from Adachi last year, we would push with them, but unfortunately somewhere along the lines, things did not go our way,” said Kaguru. He assured Zimbabweans that it is not the end of the road for the club whose legacy is etched among the biggest and most successful clubs ever, in Zimbabwe. Kaguru said they will go the academy and lower division route next year. “It is not the end of Zimbabwe Saints, the way forward is that probably next year we will go back, probably to Division Four where we will start afresh and we are also planning on an academy, so Zimbabwe Saints will never die. One day the economy will pick up, and one day we will get a sponsor so that we get back to our roots, so it’s all about money and nothing else,” said the acting chairman. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","pubDate":"2023-09-18 22:01:57","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"1c14a40c3c91285359f3a59accf539cd","title":"Homela supports regional games","link":"https://www.herald.co.zw/homela-supports-regional-games/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela.","content":"THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela. He also called for the introduction of a selection committee. A member of the technical committee put in place by the Normalisation Committee, legendary footballer Gibson Homela, who is also a coaches’ instructor believes in the process. He said it will provide a wider selection base for the coaches. “The idea is to provide ourselves with a very broad selection base. Imagine where you are going to have four regions playing and out of those four regions, the coaches or the technical committee is going to be privileged in selecting the best players out of the four regions,” said Homela. He said he was concerned with how they had gone about the business of selecting national teams in the past. Homela made reference to the team that faced Namibia on President Mnangagwa’s inauguration two weeks ago. He said in the limited time they had, he would not fault the selectors. “I had the privilege to watch Zimbabwe playing against Namibia two weeks ago and I wouldn’t say it was a job well done because I thought it was something done in Harare and it was something done with a lot of limitation in selecting the players. I personally think we must be broad and also remember there is also the diaspora players which were not in that selection,” said Homela. He called for a tracking mechanism that would ensure a thorough job is done and the best get to represent their country. “I really wish there was a tracking mechanism (to track diaspora players) where we are able to keep track of the individual when he plays but at the moment, the other day I was surprised to listen to someone who came up with a selection, I think there were about 11 foreign based players, some I know but the rest I didn’t know, so I think if that is going to be the criteria by which we will choose the national team I beg to differ,” said Homela. Asked what he did during his time as national team coach and technical adviser, Homela confessed that the process was not that good. “I must confess they were very limited then (foreign based players) and I must also confess that our system was also short then. It was not a system that we can rely upon, I think people were chosen because I knew there was Gibson in Scotland and those that I didn’t know were left out,” said Homela a great striker turned defender at both club and national team. He advocated for a selection panel. “They should be a selection committee, their task should be to follow up, investigating and finding out all those that are abroad and not only do they concentrate on those that are abroad, they also come home and also look for the better players, that is the selection committee or the technical committee. “National team players, I would say you can go down 17, you can also get a very good national team player at the age of 17 so when we look at these players, we must expand our selection base, go wide,” said Homela. Homela said age should not be a factor for the national team. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","pubDate":"2023-09-18 22:01:42","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"b7306c3f9200107073fda6c4d0fdb335","title":"Gladiators suffer first NPL defeat","link":"https://www.herald.co.zw/gladiators-suffer-first-npl-defeat/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE National Premier League cricket tournament winners look set to be decided on the final day after the seemingly invincible Gladiators suffered their first defeat of the season at Takashinga Sports Club on Sunday.","content":"THE National Premier League cricket tournament winners look set to be decided on the final day after the seemingly invincible Gladiators suffered their first defeat of the season at Takashinga Sports Club on Sunday. Gladiators suffered a three-wicket loss to Westside in a thrilling finish to their match. The man to open the first cracks in the Gladiators team was Prosper Mugeri, who took their first three wickets to fall after they were put in to bat. This included the vital wicket of Wessly Madhevere, who scored 36 opening the batting, which proved to be the top score of the innings. After that the Gladiators batting was quite indifferent, as three of their middle order reached double figures but failed to build an innings and go beyond 20, while the tail-enders batted weakly, the last four men scraping together only five runs among them to total 161. Mugeri in six overs took three wickets for 30 runs, while Tinashe Muchawaya finished off the tail with three for 29. Westside had a golden opportunity now to become the first team to beat Gladiators, but they had a fight on their hands. Tinashe Chiorah (36) and Definate Mawadzi (21) laid the foundation by scoring 46 for the first wicket, but apart from 28 from Tinashe Chimbambo the middle order did little. When the seventh wicket fell at 113 it seemed that Westside had lost their chance and Gladiators were about to claim another victory after all. Then came the most thrilling stage of the match, as Frank Mwazviita joined Vincent Masekesa and the two fought the best Gladiators could throw at them as they kept their eyes on the target. For 13 overs they stayed together, Masekesa as captain playing a very careful, responsible innings, while Mwazviita was more aggressive, hitting well when he had opportunity. They did have plenty of time, and in the end with great jubilation they reached their target after a partnership of 49, Masekesa finishing on 17 and Mwazviita 31. It was a wonderful victory for Westside, who have the honour of becoming the first team to lower the colours of the great Gladiators team as they were on the verge of securing another NPL title. At Kwekwe Sports Club, Takashinga Patriots 1 got the better of Amakhosi, who were tormented by the spin of Wellington Masakadza, by eight wickets. Gunda did his best to hold his team together with 34, but they were all out for 71 in the 25th over, with Masakadza taking four wickets for 26 in his nine overs. Takashinga lost two wickets for 38, but Tinashe Kamunhukamwe hit 26 not out off 15 balls and, helped by 16 not out from Joylord Gumbie, took the Harare side to an eight-wicket victory. At Queens Sports Club, splendid all-round performances from Carl Mumba and Victor Chirwa were the main factors in Kadoma’s convincing 195-run victory over the hosts. The visitors chose to bat and a fine innings of Mumba, who smashed 93 off 48 balls, with four sixes and nine fours before being bowled by the last ball of the innings, and Chirwa, 61 not out off 60 balls. They put on 138 in less than 14 overs for the seventh wicket, giving a total of 289 for seven wickets. In response, the only batter able to stay long was Tinaye Shayamano with 31, and Queens were dismissed for 94 in 22.2 overs. Mumba’s figures were five wickets for 31 and Chirwa had four for 16. At Masvingo Sports Club, fifties from Tadiwanashe Marumani and Tafadzwa Mahachi gave Uprising an advantage in their 193-run victory over Golden Bulls. Marumani played one of his brilliant attacking innings to score 61 off 39 balls and was backed up by Mahachi with an almost equally dazzling score of 86 off 61 balls, and later Aisha Chibanda hit 66 to take the eventual Uprising score to 295 all out. Golden Bulls were unable to put up a fight and were dismissed in 28.2 overs for 102, with no batter able to reach 20. Jeremiah Makanya was the best of the bowlers with four wickets for 25. At Mutare Sports Club, a brilliant innings of 95 off 88 balls by Aliakbar Hamid propelled Takashinga Patriots 2 to a fine eight-wicket victory over the hosts. – 161 all out in 26.4 overs (Wessly Madhevere 36, Tony Munyonga 24, Owen Muzondo 20; Tinashe Muchawaya 3/29, Prosper Mugeri 3/30, Mashford Shungu 2/34) – 162-7 in 35.1 overs (Tinashe Chiorah 36, Frank Mazviita 31*, Tinashe Chimbambo 28; Milton Shumba 2/26, Malcom Chikuhwa 2/34, Ashley Mufandauya 1/7) – 71 all out in 24.4 overs (Farai Gunda 34*, Keith Ndlovu 21, Admire Mupembe 4*; Wellington Masakadza 4/26, Tapiwa Mufudza 2/12, Roy Kaia 2/17) – 73-2 in 11 overs (Tinashe Kamunhukamwe 26*, Cunningham Ncube 21, Joylord Gumbie 16*; Cedric Dube 1/13, Shaun Dzakatira 1/26) …. – 289-7 in 45 overs (Carl Mumba 93, Victor Chirwa 61*, Bright Matsiwe 47; Isheunopa Musekwa 4/45, Petros Sithole 1/51, Tanatswa Bechani 1/53) – 94 all out 22.2 overs (Tinaye Shayamano 31, Tanatswa Bechani 22, Donald Tapfuma 14; Carl Mumba 5/31, Victor Chirwa 4/16) RESULT: Kadoma Sports Club won by 195 runs …. – 208-9 in 42 overs (Nigel Bonyongwe 61, Donald Tiripano 50, Michael Maposa 29; Cuthbert Musoko 4/53, Takudzwa Chataira 3/33, Daich Nyandoro 2/43) – 212-2 in 32.4 overs (Aliakbar Ali 95, Baxon Gopito 45, Rodney Mupfudza 41*; Silent Mujaji 1/25, Tendai Chatara 1/38) ….. – 295 all out in 39 overs (Tafadzwa Mahachi 86, Aisha Chibanda 66, Tadiwanashe Marumani 61; Elvin Nxumalo 4/33, Marshall Maruta 3/32, Shallom Mangudze 2/47) – 102 all out in 28.2 overs (Luyanda Mutomba 18, Tendai Tapera 17, Kelvin Mabvute 13; Jeremiah Makanya 4/25, Anesu Mlambo 2/19, Kudakwashe Katumba 2/22) Latest NPL Standings P W L T NR PTS NRR Gladiators 12 11 1 0 0 110 1.710 Takashinga 2 12 10 1 0 1 106 1.246 Takashinga 1 12 10 2 0 0 100 3.108 Uprising 12 10 2 0 0 100 1.850 Westside 12 8 3 0 1 86 1.528 Mutare 12 7 5 0 0 70 0.606 Rainbow 12 6 5 1 0 66 0.053 Kadoma 12 5 7 0 0 50 0.746 Amakhosi 12 5 7 0 0 50 -0.631 Queens 12 3 9 0 0 30 -0.638 BAC 12 3 9 0 0 30 -1.597 Scorpions 12 2 9 1 0 26 -1.425 Mbizo 12 2 10 0 0 20 -2.114 Golden Bulls 12 0 12 0 0 0 -3.846 THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela. ZIFA Normalisation Committee is set to appoint the Mighty Warriors coach this Thursday. The gaffer is expected to quickly select the players that will go into camp early next week ahead of the COSAFA Women’s Championship. Dynamos midfielder Tanaka “Kante” Shandirwa says he has adapted well since joining the club from Castle Lager Premier Soccer league side, Yadah.","pubDate":"2023-09-18 22:01:36","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"823b1da11a0cbb0a608412df35674ba3","title":"Three in race for Mighty Warriors top job","link":"https://www.herald.co.zw/three-in-race-for-mighty-warriors-top-job/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIFA Normalisation Committee is set to appoint the Mighty Warriors coach this Thursday. The gaffer is expected to quickly select the players that will go into camp early next week ahead of the COSAFA Women’s Championship.","content":"ZIFA Normalisation Committee is set to appoint the Mighty Warriors coach this Thursday. The gaffer is expected to quickly select the players that will go into camp early next week ahead of the COSAFA Women’s Championship. The regional tournament will run from October 4 to 15 in South Africa, Gauteng province. The southern regional tournament will be the first competition for Zimbabwean senior women’s football since the country was re-admitted into international football. According to Normalisation Committee member Rosemary Mugadza, they have shortlisted three coaches. The interviews will take place today and tomorrow. The Committee chaired by Lincoln Mutasa is then expected to appoint the coach. Zimbabwe missed the 2022 Women’s Championships edition due to suspension. “We are expecting to appoint the coach on Thursday. We will have the interviews on Tuesday and Wednesday then on Thursday, we will put the coach in place. “As the Normalisation Committee, we want the Mighty Warriors to be in camp for two weeks. The team is scheduled to arrive in South Africa on the 3rd, so we hope by Monday they will be getting into camp,” said Mugadza. The Mighty Warriors are in the same group as Namibia, Botswana and Lesotho. 12 countries will battle for the title with the top team in each group qualifying automatically for the semi-finals as well as the best runner from all the three groups. Record winners and hosts South Africa are in Group A alongside Malawi, Madagascar and Eswatini while Group B has Zambia, Mozambique, Angola and Comoros. The Mighty Warriors who won the Championship once in 2011 when they hosted the regional tournament at Rufaro stadium have a lot of work to do to reclaim the past glory. They last participated in the tournament in 2021 where they failed to progress beyond the group stage. The other countries that have won the regional title once are Zambia who are the defending champions while perennial East African guests Tanzania won the title in 2021. South Africa Banyana Banyana are the record winners having won seven of the previous 10 Championships. Meanwhile, the Zimbabwe Women’s Football Super League entered Match Day 18 with routine victories from pacesetters Herentals Queens who beat MSU Queens 1-0 at Motor Action Sports Club. The Students consolidated their position and have 45 points from 17 matches. They are followed by Harare City Queens who have 45 points from 18 games. Black Rhinos Queens are third with 40 points having played 16 games. Chapungu Queens also have 40 points from 16 games and Correctional Queens are fifth placed with 39 points from 17 outings. Herentals Queens 1, MSU Queens 0; Platinum Royals 1, Chipembere Queens 1; Correctional Queens 3, Yadah Queens 0; Shine Shine Queens 0, Harare City Queens 3 (walkover), Queen Lozikeyi 1, Maningi Youth Academy 1. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","pubDate":"2023-09-18 22:01:30","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"98453e51a1b8be9cc605dd9735f4bea4","title":"WATCH: Chaenda Chikwata, as Saints expelled from Division One","link":"https://www.chronicle.co.zw/watch-chaenda-chikwata-as-saints-expelled-from-division-one/","keywords":["Sport","Uncategorized"],"creator":["Chronicle Editor"],"video_url":null,"description":"Lovemore Dube FRIDAY, September 15, 2023 was not ordinary day for Bulawayo and Zimbabwe football as Zimbabwe Saints FC were expelled from the Zifa Southern Region Division One League. Behind Bulawayo Rovers FC and Highlanders FC, Chikwata as Saints were affectionately called by their multitudes of fans, are the city’s second most successful club. Saints […]","content":"Sports Writer THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just […] Gerald Sibanda, JUST a day after expressing his wish to play for the national team, Zimbabwean Daniel Msendami scored the only goal for his side Jwaneng Galaxy in their final Preliminary round first leg match against South African giants Orlando Pirates at Gaborone National Stadium on Sunday. It was his first start in the […] Innocent Kurira, WITH 33 points still up for the taking, the Castle Lager Premier Soccer League title remains there for anyone’s taking. The race to the title is heating up and none of the top sides can afford any slackening at this stage. One or two missteps could see a team fall out of […]","pubDate":"2023-09-18 22:01:21","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"a802f1e76d6707bff8a67f39beecf4e5","title":"HARARE DERBY SET FOR NSS RETURN","link":"https://www.herald.co.zw/harare-derby-set-for-nss-return/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium.","content":"THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. Giants Dynamos, weary of travelling to Bulawayo for their home games at Barbourfields since the giant stadium closed for renovations two months ago, have been pushing for the return to Harare. The Harare Derby, for the first time in history, was set to take place outside Harare due to the current situation with the stadiums in Harare. But Dynamos last week wrote to the Sports and Recreation Commission and are hoping for a positive response before the end of the week. Dynamos vice-chairman Vincent Chawonza yesterday told the Zimpapers Sports that the SRC acknowledged receipt of their letter and indicated considerable ground had been covered in the renovations. The stadium inspection committee is expected to run the rule before reopening the gates. “It’s not yet confirmed but what we did after returning from Bulawayo last week was that we wrote to the SRC inquiring about our return to the National Sports Stadium and they indicated the ground was due for inspection. “So we are praying that the Harare Derby be played in Harare because it’s also good for our supporters and for us as a team, financially. “We have been travelling a lot week in and week out. We are happy our fans in Bulawayo made us feel at home at Barbourfields. The supporters have been coming in good numbers and supporting us and the boys were enjoying playing there,” said Chawonza. The Premier Soccer League decided to vacate the National Sports Stadium in July to allow authorities to renovate the broken-down toilets and the water reticulation system. The venue had become overwhelmed by overuse due to the stadium crisis in Harare. However, the Sports Commission has been working behind the scenes to make the National Sports available for domestic football in the shortest possible time. An official yesterday could not give the time-lines but promised an update tomorrow on the state of the ground as well as DeMbare’s request. “We are working behind the scenes to organise the inspection. We will give an update when there is something tangible,” said the official. The reverse fixture of the Derby was played at the National Sports Stadium, with DeMbare winning 2-0. DeMbare vice chairman Chawonza yesterday said they will also make inquiries on Rufaro, which remains their preferred home ground. Rufaro has been closed for four years after it became worn out due to lack of maintenance. However, it has been undergoing renovations for the last few months. “Rufaro is central to our fans and very convenient. It is still our number one choice home venue followed by the National Sports Stadium. “So, we are planning to engage the authorities behind the stadium as well as paying a courtesy call to the new Mayor to find out his plans since there have been changes in the Council leadership. “Council had promised us that the first Derby would be played there, and it didn’t happen. We will not hesitate to jump over to Rufaro once it is available. It means a lot to us as a club,” said Chawonza. Dynamos and CAPS United have already put in place plans to hold a joint road show ahead of the Harare Derby. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club. BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday.","pubDate":"2023-09-18 22:05:39","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"cb10404d0e86da32ebc225111d19c270","title":"President salutes Streak","link":"https://www.chronicle.co.zw/president-salutes-streak/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Sports Writer THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just […]","content":"THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just over two weeks ago after losing a fierce battle to cancer. He was honoured with a State-assisted funeral in recognition of his contribution to the game. President Mnangagwa yesterday extended his condolences to the family after meeting Streak’s widow Nadine and children Charlotte, Harry and Kevin at State House. The Sports and Recreation Commission said in a brief statement yesterday that the Streak family also expressed their gratitude for the honour bestowed to the cricket icon by the Government. “This morning His Excellency, President ED Mnangagwa conveyed his condolences to Heath Streak’s widow, Nadine Streak at State House. “…Nadine Streak thanked His Excellency and the Government for honouring Heath with a State Assisted funeral. His Excellency also extended his condolences to Heath’s parents, Denis and Sheona Streak describing Heath as a ‘great sportsman and a true patriot of his country’.” Streak’s body was cremated as per his wish, two weeks ago. He will always be remembered as one of Zimbabwe’s greatest cricketers. His cricket ability was always apparent as a pace bowler who could bat, and after only one first-class match he was selected for Zimbabwe’s tour of England in 1993, and then played his first Test matches in Pakistan later that year, at the age of 19. He was a hero of Zimbabwe’s first-ever Test match victory, over Pakistan at Harare Sports Club in the 1994/95 season, taking nine wickets in the match. For most of his career, with varying degrees of support, he was the champion of Zimbabwe’s bowling, and in his 65 Test matches he took 216 wickets and remains the only Zimbabwean to have taken over 100 Test wickets, at an average of 28.14, with best figures of 6/73 in his final Test match against India in Harare in the 2005/06 season. He managed to achieve a rare feat of 2 000 runs and 200 wickets in One Day Internationals (ODIs) in just 187 appearances for the Chevrons where he scored 2 901 runs for Zimbabwe at 28,44 and 237 wickets at 29,81. He also captained his country between 2001 and 2006. After retiring from Zimbabwe cricket in 2006, he played two seasons for the English county Warwickshire and had also featured for Hampshire in 1995. He later became an excellent coach, taking charge of the national team between 2016 and 2018 leading Zimbabwe to a historic series win against Sri Lanka which was their first ever in 2017. He had also founded the Heath Streak Cricket Academy with long-time friend Joseph Rego 10 years ago. The institution, whose Trust has since entered into fruitful relationship with Old Mutual, has been instrumental in opening doors to budding cricketers in the communities. The institution held its 10th anniversary celebrations in Bulawayo with two cricket tournaments last Saturday. “As Old Mutual Zimbabwe we are honoured to have worked with the late former Zimbabwe Cricket captain, Heath Streak. His passion for the sport can be vouched for by many. “He leaves behind a legacy and we would love to keep his memory alive by continuing with what he had started and believed in. “In 2014, Mr Streak started a cricket academy with the aim to offer talented youth, and those with a desire to learn, the opportunity to showcase their abilities. “We are honoured to have been part of this project. Our journey with the legend does not end here and we will play our part to see his vision through. May his soul continue to rest in peace,” said Old Mutual in a statement recently. Gerald Sibanda, JUST a day after expressing his wish to play for the national team, Zimbabwean Daniel Msendami scored the only goal for his side Jwaneng Galaxy in their final Preliminary round first leg match against South African giants Orlando Pirates at Gaborone National Stadium on Sunday. It was his first start in the […] Innocent Kurira, WITH 33 points still up for the taking, the Castle Lager Premier Soccer League title remains there for anyone’s taking. The race to the title is heating up and none of the top sides can afford any slackening at this stage. One or two missteps could see a team fall out of […] Blessing Malinganiza MARVELOUS Nakamba’s heroics in the Luton Town midfield continue to go in vain after they suffered another 1-0 defeat at Fulham at the weekend. This becomes Town’s fourth defeat in a row, leaving them at the foot of the Premier League standings. And again, Nakamba was among the best performers on the pitch […]","pubDate":"2023-09-18 22:05:01","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"6b59187510ef4f674cae4d0573688b0c","title":"President salutes Heath Streak","link":"https://www.herald.co.zw/president-salutes-heath-streak/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.”","content":"THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 years, at his family’s farm in Inyathi, Matabeleland North, just over two weeks ago after losing a fierce battle to cancer. He was honoured with a state-assisted funeral by the Government of Zimbabwe in remembrance of his contribution to the game. President Mnangagwa yesterday extended his condolences to the family after meeting Streak’s widow Nadine and children Charlotte, Harry and Kevin at State House. The Sports and Recreation Commission said in a brief statement yesterday that the Streak family also expressed their gratitude for the honour bestowed to the cricket icon by the Government. “This morning His Excellency, President ED Mnangagwa conveyed his condolences to Heath Streak’s widow, Nadine Streak at State House. “ . . . Nadine Streak thanked His Excellency and the Government for honouring Heath with a State Assisted funeral. His Excellency also extended his condolences to Heath’s parents, Denis and Sheona Streak describing Heath as a “great sportsman and a true patriot of his country.” Streak’s body was cremated as per his wish, two weeks ago. He will always be remembered as one of Zimbabwe’s greatest cricketers. His cricket ability was always apparent as a pace bowler who could bat, and after only one first-class match he was selected for Zimbabwe’s tour of England in 1993, and then played his first Test matches in Pakistan later that year, at the age of 19. He was a hero of Zimbabwe’s first-ever Test match victory, over Pakistan at Harare Sports Club in the 1994/95 season, taking nine wickets in the match. For most of his career, with varying degrees of support, he was the champion of Zimbabwe’s bowling, and in his 65 Test matches he took 216 wickets and remains the only Zimbabwean to have taken over 100 Test wickets, at an average of 28.14, with best figures of 6/73 in his final Test match against India in Harare in the 2005/06 season. He managed to achieve a rare feat of 2 000 runs and 200 wickets in One Day Internationals (ODIs) in just 187 appearances for the Chevrons where he scored 2 901 runs for Zimbabwe at 28,44 and 237 wickets at 29,81. He also captained his country between 2001 and 2006. After retiring from Zimbabwe cricket in 2006, he played two seasons for the English county Warwickshire and had also featured for Hampshire in 1995. He later became an excellent coach, taking charge of the national team between 2016 and 2018 leading Zimbabwe to a historic series win against Sri Lanka which was their first ever in 2017. He had also founded the Heath Streak Cricket Academy with long-time friend Joseph Rego 10 years ago. The institution, whose Trust has since entered into fruitful relationship with Old Mutual, has been instrumental in opening doors to budding cricketers in the communities. The institution held its 10th anniversary celebrations in Bulawayo with two cricket tournaments last Saturday. “As Old Mutual Zimbabwe we are honoured to have worked with the late former Zimbabwe Cricket captain, Heath Streak. His passion for the sport can be vouched for by many. “He leaves behind a legacy and we would love to keep his memory alive by continuing with what he had started and believed in. “In 2014, Mr Streak started a cricket academy with the aim to offer talented youth, and those with a desire to learn, the opportunity to showcase their abilities. “We are honoured to have been part of this project. Our journey with the legend does not end here and we will play our part to see his vision through. May his soul continue to rest in peace,” said Old Mutual in a statement recently. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club. BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday.","pubDate":"2023-09-18 22:04:43","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"017e14698ed810f043b709a49e03c113","title":"Wolves hail Zim teen Chirewa","link":"https://www.herald.co.zw/wolves-hail-zim-teen-chirewa/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","content":"ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club. The 19-year-old Chirewa joined the Wolves Under-21s to bolster their midfield ranks and they even look at him as ripe to make an impact in the short term. He joined Wolves from Ipswich Town in the Championship and becomes the second player to link-up with James Collins’ side for 2023/24 following the earlier arrival of Matty Whittingham. Ipswich said they received compensation from Wolves. “The Club can confirm Tawanda Chirewa has joined Wolverhampton Wanderers, with Town receiving an undisclosed compensation fee. “After making his Town debut as a 15-year-old in an EFL Trophy clash with Colchester in 2019, Tawanda ultimately made a total of three senior appearances for the Club, all in cup competitions. “He has now joined Premier League side Wolves, with the Club wishing him well for the future,” said Ipswich in a statement. Chirewa made his senior debut for Ipswich in November 2019, appearing as a second half substitute against Colchester United in an EFL Trophy group stage fixture. In the process, he became the second youngest player to feature for the Tractor Boys, behind Connor Wickham, aged just 16 years and 31 days old. In July 2020, Chirewa signed a two-year scholarship at Portman Road and was then rewarded with a first professional contract four months later. Wolves Academy manager for football, Jon Hunter-Barrett, has explained how Chirewa has been on the club’s radar for some time and said: “It’s one that we’re delighted to get over the line. We’ve been watching Tawanda for a while now, since the age of 16, and monitoring his progress before picking the right opportunity to approach and get him across for his services. “His key qualities are his handling of the ball in tight areas and an ability to get the team up the pitch to create and score from deep areas. “As always, with one of our key strategies of looking at loan opportunities for our players at the right time, the departures of Harvey (Griffiths) and Alfie (Pond) and steady progression of one or two others into the first-team squad, it was important we strengthened our under-21s to ensure they have the ability to compete throughout the season.” Head of UK academy recruitment, Harry Hooman, added: “Tawanda is someone we have liked and monitored for a long time, dating back to when he was an under-16. Although nothing happened at the time, we continued to monitor his development closely over the last few seasons. “He is an athletic, talented player with the ability to score and create goals. He wants to get on the ball and is not afraid to take responsibility and take risks to make things happen. “We feel he has the attributes and potential to do well for us both in the short and long-term. This is a fresh challenge for him and we are excited to see him kick on again with us.” BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday. THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela. THE National Premier League cricket tournament winners look set to be decided on the final day after the seemingly invincible Gladiators suffered their first defeat of the season at Takashinga Sports Club on Sunday.","pubDate":"2023-09-18 22:03:33","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"ef4ad846940824c167397dbedfce25f7","title":"WATCH: Homela supports regional games","link":"https://www.chronicle.co.zw/watch-homela-supports-regional-games/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Lovemore Dube THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players. He also called for the introduction of a selection committee. A member of the technical committee put in place by the Normalisation Committee, legendary footballer Gibson Homela, who is also a coaches’ instructor believes in […]","content":"Sports Writer THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just […] Gerald Sibanda, JUST a day after expressing his wish to play for the national team, Zimbabwean Daniel Msendami scored the only goal for his side Jwaneng Galaxy in their final Preliminary round first leg match against South African giants Orlando Pirates at Gaborone National Stadium on Sunday. It was his first start in the […] Innocent Kurira, WITH 33 points still up for the taking, the Castle Lager Premier Soccer League title remains there for anyone’s taking. The race to the title is heating up and none of the top sides can afford any slackening at this stage. One or two missteps could see a team fall out of […]","pubDate":"2023-09-18 22:02:05","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"221a02b8e654351530d3dc2823b59e2a","title":"Zim Saints expelled from Div One","link":"https://www.herald.co.zw/zim-saints-expelled-from-div-one/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday.","content":"BULAWAYO’S second most successful football side, Zimbabwe Saints were expelled from the Zifa Southern Region Division One League last Friday. Saints were expelled for failure to pay Affiliation fees in full and for many walkovers. The club has felt the financial heat in the absence of a dedicated sponsor with individuals who have stood by the club also feeling the heat and fatigue of having to dig from their pockets at the expense of their families. But management has assured sympathisers and members that it is not the end of the journey for the club. Ishmael Kaguru, the Zimbabwe Saints acting chairman who has over the past 30 years been among those that have stood solidly behind the historic football project THAT boasts some big names in its player list like William Sibanda, Gibson Homela, Agent Sawu, Ephraim Chawanda, Muzondiwa Mugadza, Moses Moyo and the late Vice President of Zimbabwe Joseph Msika, described Friday as an unfortunate day in the history of the institution. He said the lack of support from the business sector had affected the club’s day-to-day survival. “It’s very unfortunate that we have now been expelled from the league, but irrespective of that, the situation is beyond our control considering where we stand right now as a nation economically,” said a despairing Kaguru who has held fort in trying times. He said their bubble was burst last year when their “benefactor” Adrian “Adachi” Mtungwazi withdrew his support of the club to start his own project that is campaigning in the same league they were expelled from. Kaguru said Adachi had given them a glimmer of hope for revival. The club which used to be the biggest in Bulawayo in the 1960s and 1970s, has struggled to stand on its own in the last 25 years and has been a “yo-yo” team shuttling between non-existence, Division Two, juniors, Premiership and Division One. “We were hoping that when we got the sponsorship from Adachi last year, we would push with them, but unfortunately somewhere along the lines, things did not go our way,” said Kaguru. He assured Zimbabweans that it is not the end of the road for the club whose legacy is etched among the biggest and most successful clubs ever, in Zimbabwe. Kaguru said they will go the academy and lower division route next year. “It is not the end of Zimbabwe Saints, the way forward is that probably next year we will go back, probably to Division Four where we will start afresh and we are also planning on an academy, so Zimbabwe Saints will never die. One day the economy will pick up, and one day we will get a sponsor so that we get back to our roots, so it’s all about money and nothing else,” said the acting chairman. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","pubDate":"2023-09-18 22:01:57","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"1c14a40c3c91285359f3a59accf539cd","title":"Homela supports regional games","link":"https://www.herald.co.zw/homela-supports-regional-games/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela.","content":"THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela. He also called for the introduction of a selection committee. A member of the technical committee put in place by the Normalisation Committee, legendary footballer Gibson Homela, who is also a coaches’ instructor believes in the process. He said it will provide a wider selection base for the coaches. “The idea is to provide ourselves with a very broad selection base. Imagine where you are going to have four regions playing and out of those four regions, the coaches or the technical committee is going to be privileged in selecting the best players out of the four regions,” said Homela. He said he was concerned with how they had gone about the business of selecting national teams in the past. Homela made reference to the team that faced Namibia on President Mnangagwa’s inauguration two weeks ago. He said in the limited time they had, he would not fault the selectors. “I had the privilege to watch Zimbabwe playing against Namibia two weeks ago and I wouldn’t say it was a job well done because I thought it was something done in Harare and it was something done with a lot of limitation in selecting the players. I personally think we must be broad and also remember there is also the diaspora players which were not in that selection,” said Homela. He called for a tracking mechanism that would ensure a thorough job is done and the best get to represent their country. “I really wish there was a tracking mechanism (to track diaspora players) where we are able to keep track of the individual when he plays but at the moment, the other day I was surprised to listen to someone who came up with a selection, I think there were about 11 foreign based players, some I know but the rest I didn’t know, so I think if that is going to be the criteria by which we will choose the national team I beg to differ,” said Homela. Asked what he did during his time as national team coach and technical adviser, Homela confessed that the process was not that good. “I must confess they were very limited then (foreign based players) and I must also confess that our system was also short then. It was not a system that we can rely upon, I think people were chosen because I knew there was Gibson in Scotland and those that I didn’t know were left out,” said Homela a great striker turned defender at both club and national team. He advocated for a selection panel. “They should be a selection committee, their task should be to follow up, investigating and finding out all those that are abroad and not only do they concentrate on those that are abroad, they also come home and also look for the better players, that is the selection committee or the technical committee. “National team players, I would say you can go down 17, you can also get a very good national team player at the age of 17 so when we look at these players, we must expand our selection base, go wide,” said Homela. Homela said age should not be a factor for the national team. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","pubDate":"2023-09-18 22:01:42","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"b7306c3f9200107073fda6c4d0fdb335","title":"Gladiators suffer first NPL defeat","link":"https://www.herald.co.zw/gladiators-suffer-first-npl-defeat/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE National Premier League cricket tournament winners look set to be decided on the final day after the seemingly invincible Gladiators suffered their first defeat of the season at Takashinga Sports Club on Sunday.","content":"THE National Premier League cricket tournament winners look set to be decided on the final day after the seemingly invincible Gladiators suffered their first defeat of the season at Takashinga Sports Club on Sunday. Gladiators suffered a three-wicket loss to Westside in a thrilling finish to their match. The man to open the first cracks in the Gladiators team was Prosper Mugeri, who took their first three wickets to fall after they were put in to bat. This included the vital wicket of Wessly Madhevere, who scored 36 opening the batting, which proved to be the top score of the innings. After that the Gladiators batting was quite indifferent, as three of their middle order reached double figures but failed to build an innings and go beyond 20, while the tail-enders batted weakly, the last four men scraping together only five runs among them to total 161. Mugeri in six overs took three wickets for 30 runs, while Tinashe Muchawaya finished off the tail with three for 29. Westside had a golden opportunity now to become the first team to beat Gladiators, but they had a fight on their hands. Tinashe Chiorah (36) and Definate Mawadzi (21) laid the foundation by scoring 46 for the first wicket, but apart from 28 from Tinashe Chimbambo the middle order did little. When the seventh wicket fell at 113 it seemed that Westside had lost their chance and Gladiators were about to claim another victory after all. Then came the most thrilling stage of the match, as Frank Mwazviita joined Vincent Masekesa and the two fought the best Gladiators could throw at them as they kept their eyes on the target. For 13 overs they stayed together, Masekesa as captain playing a very careful, responsible innings, while Mwazviita was more aggressive, hitting well when he had opportunity. They did have plenty of time, and in the end with great jubilation they reached their target after a partnership of 49, Masekesa finishing on 17 and Mwazviita 31. It was a wonderful victory for Westside, who have the honour of becoming the first team to lower the colours of the great Gladiators team as they were on the verge of securing another NPL title. At Kwekwe Sports Club, Takashinga Patriots 1 got the better of Amakhosi, who were tormented by the spin of Wellington Masakadza, by eight wickets. Gunda did his best to hold his team together with 34, but they were all out for 71 in the 25th over, with Masakadza taking four wickets for 26 in his nine overs. Takashinga lost two wickets for 38, but Tinashe Kamunhukamwe hit 26 not out off 15 balls and, helped by 16 not out from Joylord Gumbie, took the Harare side to an eight-wicket victory. At Queens Sports Club, splendid all-round performances from Carl Mumba and Victor Chirwa were the main factors in Kadoma’s convincing 195-run victory over the hosts. The visitors chose to bat and a fine innings of Mumba, who smashed 93 off 48 balls, with four sixes and nine fours before being bowled by the last ball of the innings, and Chirwa, 61 not out off 60 balls. They put on 138 in less than 14 overs for the seventh wicket, giving a total of 289 for seven wickets. In response, the only batter able to stay long was Tinaye Shayamano with 31, and Queens were dismissed for 94 in 22.2 overs. Mumba’s figures were five wickets for 31 and Chirwa had four for 16. At Masvingo Sports Club, fifties from Tadiwanashe Marumani and Tafadzwa Mahachi gave Uprising an advantage in their 193-run victory over Golden Bulls. Marumani played one of his brilliant attacking innings to score 61 off 39 balls and was backed up by Mahachi with an almost equally dazzling score of 86 off 61 balls, and later Aisha Chibanda hit 66 to take the eventual Uprising score to 295 all out. Golden Bulls were unable to put up a fight and were dismissed in 28.2 overs for 102, with no batter able to reach 20. Jeremiah Makanya was the best of the bowlers with four wickets for 25. At Mutare Sports Club, a brilliant innings of 95 off 88 balls by Aliakbar Hamid propelled Takashinga Patriots 2 to a fine eight-wicket victory over the hosts. – 161 all out in 26.4 overs (Wessly Madhevere 36, Tony Munyonga 24, Owen Muzondo 20; Tinashe Muchawaya 3/29, Prosper Mugeri 3/30, Mashford Shungu 2/34) – 162-7 in 35.1 overs (Tinashe Chiorah 36, Frank Mazviita 31*, Tinashe Chimbambo 28; Milton Shumba 2/26, Malcom Chikuhwa 2/34, Ashley Mufandauya 1/7) – 71 all out in 24.4 overs (Farai Gunda 34*, Keith Ndlovu 21, Admire Mupembe 4*; Wellington Masakadza 4/26, Tapiwa Mufudza 2/12, Roy Kaia 2/17) – 73-2 in 11 overs (Tinashe Kamunhukamwe 26*, Cunningham Ncube 21, Joylord Gumbie 16*; Cedric Dube 1/13, Shaun Dzakatira 1/26) …. – 289-7 in 45 overs (Carl Mumba 93, Victor Chirwa 61*, Bright Matsiwe 47; Isheunopa Musekwa 4/45, Petros Sithole 1/51, Tanatswa Bechani 1/53) – 94 all out 22.2 overs (Tinaye Shayamano 31, Tanatswa Bechani 22, Donald Tapfuma 14; Carl Mumba 5/31, Victor Chirwa 4/16) RESULT: Kadoma Sports Club won by 195 runs …. – 208-9 in 42 overs (Nigel Bonyongwe 61, Donald Tiripano 50, Michael Maposa 29; Cuthbert Musoko 4/53, Takudzwa Chataira 3/33, Daich Nyandoro 2/43) – 212-2 in 32.4 overs (Aliakbar Ali 95, Baxon Gopito 45, Rodney Mupfudza 41*; Silent Mujaji 1/25, Tendai Chatara 1/38) ….. – 295 all out in 39 overs (Tafadzwa Mahachi 86, Aisha Chibanda 66, Tadiwanashe Marumani 61; Elvin Nxumalo 4/33, Marshall Maruta 3/32, Shallom Mangudze 2/47) – 102 all out in 28.2 overs (Luyanda Mutomba 18, Tendai Tapera 17, Kelvin Mabvute 13; Jeremiah Makanya 4/25, Anesu Mlambo 2/19, Kudakwashe Katumba 2/22) Latest NPL Standings P W L T NR PTS NRR Gladiators 12 11 1 0 0 110 1.710 Takashinga 2 12 10 1 0 1 106 1.246 Takashinga 1 12 10 2 0 0 100 3.108 Uprising 12 10 2 0 0 100 1.850 Westside 12 8 3 0 1 86 1.528 Mutare 12 7 5 0 0 70 0.606 Rainbow 12 6 5 1 0 66 0.053 Kadoma 12 5 7 0 0 50 0.746 Amakhosi 12 5 7 0 0 50 -0.631 Queens 12 3 9 0 0 30 -0.638 BAC 12 3 9 0 0 30 -1.597 Scorpions 12 2 9 1 0 26 -1.425 Mbizo 12 2 10 0 0 20 -2.114 Golden Bulls 12 0 12 0 0 0 -3.846 THE Zifa Normalisation Committee’s proposed inter-regional games will provide a more transparent way of choosing national team players according to football legend, Gibson Homela. ZIFA Normalisation Committee is set to appoint the Mighty Warriors coach this Thursday. The gaffer is expected to quickly select the players that will go into camp early next week ahead of the COSAFA Women’s Championship. Dynamos midfielder Tanaka “Kante” Shandirwa says he has adapted well since joining the club from Castle Lager Premier Soccer league side, Yadah.","pubDate":"2023-09-18 22:01:36","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"823b1da11a0cbb0a608412df35674ba3","title":"Three in race for Mighty Warriors top job","link":"https://www.herald.co.zw/three-in-race-for-mighty-warriors-top-job/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIFA Normalisation Committee is set to appoint the Mighty Warriors coach this Thursday. The gaffer is expected to quickly select the players that will go into camp early next week ahead of the COSAFA Women’s Championship.","content":"ZIFA Normalisation Committee is set to appoint the Mighty Warriors coach this Thursday. The gaffer is expected to quickly select the players that will go into camp early next week ahead of the COSAFA Women’s Championship. The regional tournament will run from October 4 to 15 in South Africa, Gauteng province. The southern regional tournament will be the first competition for Zimbabwean senior women’s football since the country was re-admitted into international football. According to Normalisation Committee member Rosemary Mugadza, they have shortlisted three coaches. The interviews will take place today and tomorrow. The Committee chaired by Lincoln Mutasa is then expected to appoint the coach. Zimbabwe missed the 2022 Women’s Championships edition due to suspension. “We are expecting to appoint the coach on Thursday. We will have the interviews on Tuesday and Wednesday then on Thursday, we will put the coach in place. “As the Normalisation Committee, we want the Mighty Warriors to be in camp for two weeks. The team is scheduled to arrive in South Africa on the 3rd, so we hope by Monday they will be getting into camp,” said Mugadza. The Mighty Warriors are in the same group as Namibia, Botswana and Lesotho. 12 countries will battle for the title with the top team in each group qualifying automatically for the semi-finals as well as the best runner from all the three groups. Record winners and hosts South Africa are in Group A alongside Malawi, Madagascar and Eswatini while Group B has Zambia, Mozambique, Angola and Comoros. The Mighty Warriors who won the Championship once in 2011 when they hosted the regional tournament at Rufaro stadium have a lot of work to do to reclaim the past glory. They last participated in the tournament in 2021 where they failed to progress beyond the group stage. The other countries that have won the regional title once are Zambia who are the defending champions while perennial East African guests Tanzania won the title in 2021. South Africa Banyana Banyana are the record winners having won seven of the previous 10 Championships. Meanwhile, the Zimbabwe Women’s Football Super League entered Match Day 18 with routine victories from pacesetters Herentals Queens who beat MSU Queens 1-0 at Motor Action Sports Club. The Students consolidated their position and have 45 points from 17 matches. They are followed by Harare City Queens who have 45 points from 18 games. Black Rhinos Queens are third with 40 points having played 16 games. Chapungu Queens also have 40 points from 16 games and Correctional Queens are fifth placed with 39 points from 17 outings. Herentals Queens 1, MSU Queens 0; Platinum Royals 1, Chipembere Queens 1; Correctional Queens 3, Yadah Queens 0; Shine Shine Queens 0, Harare City Queens 3 (walkover), Queen Lozikeyi 1, Maningi Youth Academy 1. THE long-awaited Harare Derby is set to return to Harare this weekend as Dynamos keep their fingers crossed to get the greenlight to host their traditional crosstown rivals CAPS United at the National Sports Stadium. THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans, with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” ENGLISH Premier Soccer League side, Wolverhampton Wanderers yesterday hailed Zimbabwean teenager, Tawanda Chirewa as a talented match winner with the potential to influence matches for the club.","pubDate":"2023-09-18 22:01:30","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"98453e51a1b8be9cc605dd9735f4bea4","title":"WATCH: Chaenda Chikwata, as Saints expelled from Division One","link":"https://www.chronicle.co.zw/watch-chaenda-chikwata-as-saints-expelled-from-division-one/","keywords":["Sport","Uncategorized"],"creator":["Chronicle Editor"],"video_url":null,"description":"Lovemore Dube FRIDAY, September 15, 2023 was not ordinary day for Bulawayo and Zimbabwe football as Zimbabwe Saints FC were expelled from the Zifa Southern Region Division One League. Behind Bulawayo Rovers FC and Highlanders FC, Chikwata as Saints were affectionately called by their multitudes of fans, are the city’s second most successful club. Saints […]","content":"Sports Writer THE late cricket icon Heath Streak is likely to live long in the memories of many Zimbabweans with President Mnangagwa yesterday describing the former national team captain and coach as a “great sportsman and a true patriot of his country.” Streak died aged 49 at his family’s farm in Inyathi, Matabeleland North, just […] Gerald Sibanda, JUST a day after expressing his wish to play for the national team, Zimbabwean Daniel Msendami scored the only goal for his side Jwaneng Galaxy in their final Preliminary round first leg match against South African giants Orlando Pirates at Gaborone National Stadium on Sunday. It was his first start in the […] Innocent Kurira, WITH 33 points still up for the taking, the Castle Lager Premier Soccer League title remains there for anyone’s taking. The race to the title is heating up and none of the top sides can afford any slackening at this stage. One or two missteps could see a team fall out of […]","pubDate":"2023-09-18 22:01:21","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"}]}