{"newsArray":[{"title":"India vs Pakistan Asia Cup 2022: Virat Kohli will be mentally and physically fresh ahead of clash, says Shane Watson","link":"https://zeenews.india.com/cricket/india-vs-pakistan-asia-cup-2022-virat-kohli-will-be-mentally-and-physically-fresh-ahead-of-clash-says-shane-watson-2501344.html","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli will return to cricket after missing out the series against the West Indies and Zimbabwe. Kohli will be back in action against arch-rivals Pakistan on Sunday (August 28).","content":null,"pubDate":"2022-08-25 01:01:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"India name Laxman interim head coach","link":"https://www.thenews.com.pk/print/985184-india-name-laxman-interim-head-coach","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI: Former batsman VVS Laxman will be the interim head coach of the Indian side for the Asia Cup in the United Arab Emirates, the country’s cricket board said Wednesday.The Twenty20 tournament begins on Saturday, with Sri Lanka taking on Afghanistan.India’s first match is a...","content":null,"pubDate":"2022-08-25 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Five foreigners join Cricket Coaching Project","link":"https://www.thenews.com.pk/print/985197-five-foreigners-join-cricket-coaching-project","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Five elite cricket coaches will commence work at the Cricket Coaching Project under the PCB Pathway Programme.The first phase of the programme begins at the National High Performance Centre, Lahore, later this week. The coaches are expected to arrive in Lahore in the next seven to 10 days....","content":null,"pubDate":"2022-08-25 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"PCB to look for women team head coach","link":"https://www.thenews.com.pk/print/985189-pcb-to-look-for-women-team-head-coach","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: The Pakistan Cricket Board will be looking for a new women’s national team head coach as David Hemp has decided not to seek an extension.Pakistan Cricket Board said on Wednesday that the head coach is not seeking an extension to his two-year contract, which expires in October.David...","content":null,"pubDate":"2022-08-25 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"National U19 Championship final begins today","link":"https://www.thenews.com.pk/print/985188-national-u19-championship-final-begins-today","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Sindh Blues will take on Sindh Whites in the four-day final of the National Under-19 Cricket Championship 2022-23 which will begin here at the UBL Sports Complex on Thursday .The winning team will get Rs 1.5million. The team that ends up second will bag Rs750,000. The player of the final...","content":null,"pubDate":"2022-08-25 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Big Bash blaster reveals new home","link":"https://www.themercury.com.au/sport/cricket/big-bash/big-bash-blaster-chris-lynn-reveals-new-home/news-story/bd3736ffaf52c36abf2f006e13c960d9","keywords":["Big Bash News","Breaking News","National Breaking News","NewsWire"],"creator":null,"video_url":null,"description":"Fears that Chris Lynn may have been lost to the Big Bash League have been allayed, with the big-hitting batter inking a new deal to join the Adelaide Strikers for the upcoming season.","content":"It looked like Lynn would be lost to Australian cricket when he joined the newly formed UAE T20 league, but a deal has been struck that means he can play in both tournaments.Lynn’s signing is a huge coup for the Strikers given he’s the only player in BBL history to score 3000 runs, while he also leads the way with a whopping 180 sixes during his time with the Brisbane Heat.The Heat opted not to re-sign the most destructive hitter in the game who also captained the franchise for several years, and it sets up a spicy showdown when the Strikers head north to take on the Heat at the Gabba on December 23. “I’ll be doing my best,” Lynn said ahead of the big move.“I’ll be coming down to Adelaide fit and strong and ready to score a heap of runs and, even more importantly, put on a show for the fans, who are the backbone of the Adelaide Strikers.“It’s always such a great atmosphere walking into Adelaide Oval, and not only that but walking over the bridge on game day, the atmosphere in the city is great. I know the fans will be out in force this summer.”It’s been four years since Lynn last represented Australia, but the 32-year-old has remained a force across the world, acting as a bat-for-hire for countless T20 franchises.Keeping him in the BBL is crucial for Cricket Australia who are relying on local talent and international stars to revive interest in a competition that struggled to capture the attention of the public last summer. Getting Lynn is just what the Strikers need ahead of Sunday’s hugely anticipated BBL draft, as Adelaide look to bounce back after their heartbreaking loss to the Sixers in last season’s playoffs. “We all know the qualities that Chris Lynn brings to the table. He is a proven matchwinner, an experienced leader and a great character to have around the group,” Strikers coach Jason Gillespie said.“His record speaks for itself. We’re thrilled to have him and know he can play an important role for us this summer.”The Strikers won’t have to wait long for retribution when they open their campaign against the Sixers on December 14.","pubDate":"2022-08-24 23:30:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ben Stokes drives mental health message","link":"https://www.cairnspost.com.au/sport/cricket/ben-stokes-drives-mental-health-message/video/884b305cae04548f0948977a160dcc3d","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Ben Stokes has opened up about his battle with anxiety and panic attacks in his new Amazon Prime documentary.","content":null,"pubDate":"2022-08-24 23:09:24","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Records tumble as Ireland claim superb series win in the Netherlands","link":"https://www.the42.ie/ireland-cricket-netherlands-5848640-Aug2022/","keywords":["What A Day"],"creator":null,"video_url":null,"description":"It was a day to remember for the Irish women’s cricket team.","content":null,"pubDate":"2022-08-24 19:35:13","image_url":"https://c0.thejournal.ie/media/2022/08/leah-11-630x420.jpeg","source_id":"the42","country":["ireland"],"category":["sports"],"language":"english"},{"title":"“Sachin will be a proud man”: When Virat Kohli soaked in all the pressure to nail a challenging chase vs Pakistan during 2016 T20 World Cup at Eden Gardens","link":"https://thesportsrush.com/cricket-news-sachin-will-be-a-proud-man-when-virat-kohli-soaked-in-all-the-pressure-to-nail-a-challenging-chase-vs-pakistan-during-2016-t20-world-cup-at-eden-gardens/","keywords":["Cricket","Eden Gardens","T20 World Cup 2016","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Virat Kohli soaked in all the pressure to stand true to the expectations of a jam-packed Eden Gardens against arch-rivals Pakistan. Team India has arrived at the UAE shores to participated in the Asia Cup 2022, with the opening match against arch-rival Pakistan to take place on August 28 at the Dubai International Stadium. Former… The post “Sachin will be a proud man”: When Virat Kohli soaked in all the pressure to nail a challenging chase vs Pakistan during 2016 T20 World Cup at Eden Gardens appeared first on The SportsRush.","content":"Virat Kohli soaked in all the pressure to stand true to the expectations of a jam-packed Eden Gardens against arch-rivals Pakistan. Team India has arrived at the UAE shores to participated in the Asia Cup 2022, with the opening match against arch-rival Pakistan to take place on August 28 at the Dubai International Stadium. Former team India captain, Virat Kohli was the first to dash through to the nets, as talks around his slump in form are louder than ever in his illustrious career so far. Virat Kohli the first Indian batter to dash out to the nets in their first training session of the Asia Cup. — Shashank Kishore (@captainshanky) August 24, 2022 However, public memory is still afresh with respect to the champion batter that he has been all these years for the Indian Cricket team. It was the year 2016, when King Kohli was experiencing one of the golden phases of his Cricketing career across all formats. It was also the year of the T20 World Cup which took place in India, and one of the only multi-nation tournament, when the fierce competitors India and Pakistan get to face each other. And in line with the expectations, with India having never lost against their neighbours in an ICC tournament before, Kohli delivered, amidst all the pressure of the world in a run-chase, with the team’s back against the wall. In a match which was reduced to 18-Overs a side, team India were handed a modest total of 119 to carry on with their winning streak against Pakistan in ICC events. On a pitch which was gripping and challenging to bat on, India lost Rohit Sharma (10), Shikhar Dhawan (6), and Suresh Raina (0) within five Overs of the chase. Virat Kohli, in at no. 3 in the order, had just watched Dhawan and Raina get out on successive deliveries off pacer Mohammad Sami from the other end, with the scorecard reading 23/3. However, trusting his technique and brimming with confidence, Kohli soaked in all the pressure alongside the experienced Yuvraj Singh (24), to stitch a half-century stand for the fourth wicket. Kohli not only played some delightful strokes off the in-rhythm Sami, but also played out the experienced spinners in Shoaib Malik and Shahid Afridi, on a track which was unexpectedly turning big for the spinners. With the assistance of 7 Fours and a Six, Kohli nailed the chase with perfection, with a crafty innings of 55 off mere 37 deliveries, on a pitch where nearly all the batters from both sides struggled to get going and failing to even surpass the 30-run mark. He was fittingly adjudged the ‘Player of the Match’ with the jam-packed Eden Gardens standing up to applaud yet another gem of an innings from the chase master, and the one which will be etched in their memories for quite a many years to come.","pubDate":"2022-08-24 19:29:42","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Emirates Old Trafford Manchester Test records: Old Trafford cricket ground Test record and highest innings total","link":"https://thesportsrush.com/cricket-news-emirates-old-trafford-manchester-test-records-old-trafford-cricket-ground-test-record-and-highest-innings-total/","keywords":["Cricket","England","South Africa","South Africa tour of Englanf 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Emirates Old Trafford Manchester Test records: Old Trafford will be hosting a Test match after more than two years. The first day of the second Test of South Africa’s tour of England 2022 will be played in Manchester tomorrow. Considering the nature of the English summer this year, expecting a riveting Test wouldn’t be asking… The post Emirates Old Trafford Manchester Test records: Old Trafford cricket ground Test record and highest innings total appeared first on The SportsRush.","content":"Emirates Old Trafford Manchester Test records: Old Trafford will be hosting a Test match after more than two years. The first day of the second Test of South Africa’s tour of England 2022 will be played in Manchester tomorrow. Considering the nature of the English summer this year, expecting a riveting Test wouldn’t be asking for too much. Set to host an international match after just over a month, Old Trafford will be hosting a Test match after more than two years. England, who’ve played 81 out of the 82 Manchester Tests, have won 31 and lost 15 matches over the years. South Africa, on the other hand, have won one and lost five out of their 10 Tests at this venue. Having played only three Tests here since their solitary victory in 1955, the Proteas would be wanting to end a long-drought this week. Highest run-scorers in Manchester Tests are Denis Compton (818), Joe Root (781), Michael Atherton (729), Alec Stewart (704) and Len Hutton (701). A list of best batters at this venue among active cricketers is given below: All set for tomorrow! 😀 🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvSA 🇿🇦 pic.twitter.com/wbdafFCqrg — England Cricket (@englandcricket) August 24, 2022 Highest Test wicket-takers at Old Trafford are Alec Bedser (51), Stuart Broad (40), James Anderson (31), Jim Laker (27) and Monty Panesar (25). A list of best bowlers here among active cricketers is provided below: Only two active South African cricketers who have played a Manchester Test in the past are captain Dean Elgar (0 and 5) and fast bowler Kagiso Rabada (4/91 and 2/50). Hence, the Proteas don’t have any major objections in the above mentioned lists. ALSO READ: Pitch report England vs South Africa 2nd Test at Old Trafford Out of all these Test matches played here, only 12 have been won by teams chasing down a target in the fourth innings. Highest successful Test run-chase at Old Trafford has been registered by the hosts by scoring 294/4 in 88 overs to beat New Zealand by 6 wickets 14 years ago.","pubDate":"2022-08-24 19:01:24","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"General Duty in the IAF Does not end a Sportsperson's Career Says HC","link":"https://www.news18.com/news/sports/general-duty-in-the-iaf-does-not-end-a-sportspersons-career-says-hc-5815933.html","keywords":["sports"],"creator":null,"video_url":null,"description":"The nature of his duties or his posting/transfer would not be an impediment, and we believe he would easily find his way through and move up the ranks to represent the services cricket team soon. Assigning trade duty cannot deprive him of his opportunity to play cricket or jeopardise his cricketing career, a bench of Justices Suresh Kumar Kait and Saurabh Banerjee ruled","content":null,"pubDate":"2022-08-24 18:25:45","image_url":"https://images.news18.com/ibnlive/uploads/2022/02/delhi-hc.png","source_id":"news18","country":["india"],"category":["sports"],"language":"english"},{"title":"Kapil Dev recalls loss vs Pakistan in 1986; says can't stop thinking about it till date","link":"https://www.indiatvnews.com/sports/cricket/kapil-dev-recalls-loss-vs-pakistan-in-1986-javed-miandad-hit-a-six-on-the-final-ball-off-chetan-sharma-2022-08-24-802761","keywords":null,"creator":null,"video_url":null,"description":"The rivalry between India and Pakistan on a cricket field is unlike any other we have seen in the history of the game. England vs Australia may come close, but there is a certain oomph in India vs Pakistan matches that refuse to die down even after all these years.","content":"The rivalry between India and Pakistan on a cricket field is unlike any other we have seen in the history of the game. England vs Australia may come close, but there is a certain oomph in India vs Pakistan matches that refuse to die down even after all these years. The last time India and Pakistan met on a cricket field, Pakistan infamously steamrolled India by 10 wickets to win their opening encounter at the T20 World Cup in UAE. But this wasn't the only loss against Pakistan that is talked about till today. Kapil Dev, in conversation with Wasim Akram, recalled India's loss against Pakistan in 1986 when Javed Miandad hit a six on the final ball off Chetan Sharma to win the game for his team. \"That famous game, where you were well on your way to score 270. But then, I got three quick wickets and you eventually scored 245,” said Akram. \"We thought we should have 12-13 runs to defend in the last over. It was a difficult task, almost impossible in those times,\" Kapil started by telling his side of the story. \"When the last over came, we went to Chetan. To this day, I still feel it wasn't his mistake. They needed 4 runs on the last ball and we decided that it would be a low yorker. There was no other alternative. He tried his best, we all tried. It turned out to be a low full-toss. Miandad kept his backfoot intact and connected it. Even when we remember that today, we can't sleep. That defeat crushed the whole side's confidence for the next four years. It was very difficult to make a comeback from there.\" Asia Cup 2022 will add another chapter to this storied rivalry when the two teams take on each other on August 28.","pubDate":"2022-08-24 18:16:31","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"YuppTV obtiene los derechos de transmisión de la Copa de Asia 2022","link":"https://www.prnewswire.com:443/news-releases/yupptv-obtiene-los-derechos-de-transmision-de-la-copa-de-asia-2022-884012208.html","keywords":["Multimedia & Internet","Entertainment","General Sports","Sporting Events","SSE","ENT","SPT","MLM"],"creator":null,"video_url":null,"description":"La 15ª edición de la Copa de Asia de Cricket se retransmitirá en directo a través de la plataforma OTT de YuppTV en más de 70 países. ATLANTA, 24 de agosto de 2022 /PRNewswire/ -- YuppTV, una de las principales plataformas OTT del mundo, se ha hecho con los derechos de emisión de la Copa...","content":null,"pubDate":"2022-08-24 18:09:00","image_url":"https://mma.prnewswire.com/media/1884515/YuppTV_Asia_Cup_2022.jpg?p=publish","source_id":"cision","country":["singapore"],"category":["sports"],"language":"english"},{"title":"“Go out and entertain people for five days in a row”: Ben Stokes shares how he’s working to remove pressure of international Cricket from his players as England Test captain","link":"https://thesportsrush.com/cricket-news-go-out-and-entertain-people-for-five-days-in-a-row-ben-stokes-shares-how-hes-working-to-remove-pressure-of-international-cricket-from-his-players-as-england-test-captain/","keywords":["Cricket","Ben Stokes"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ben Stokes shares his approach towards playing international Cricket in a way that it helps remove the unwarranted pressure from his players. From the Bristol club crawl to winning the World Cup for England, and from the triumph in the ever famous Headingley Test, to taking a mental health break from the sport he loves… The post “Go out and entertain people for five days in a row”: Ben Stokes shares how he’s working to remove pressure of international Cricket from his players as England Test captain appeared first on The SportsRush.","content":"Ben Stokes shares his approach towards playing international Cricket in a way that it helps remove the unwarranted pressure from his players. From the Bristol club crawl to winning the World Cup for England, and from the triumph in the ever famous Headingley Test, to taking a mental health break from the sport he loves the most, Ben Stokes has perhaps seen it all in his decade old international career so far. An Amazon series documentary – ‘Ben Stokes: Phoenix from the Ashes’, talks about this very journey of the champion all-rounder rising to the top, who has now been handed the responsibility to proudly lead the English Test side. The present journey, for the sake of which he even decided to retire from the ODI format, commenced with a new, fresh approach with the assistance of the aggressive, former Kiwi international batter Brendon McCullum, known as the ‘Bazball’. Four wins off the first four Tests, all of them while chasing scores above 275 runs, the 31-year-old has yet again began like the champion that he is, amidst abundant praises and criticisms as well, that always come the way of players of his caliber. Brilliant .. An incredible movie .. https://t.co/OQraHkgAlA — Michael Vaughan (@MichaelVaughan) August 24, 2022 Ben Stokes shares his approach towards playing international Cricket During an interaction session while promoting his Amazon documentary series, the England Test captain did share some of his invaluable insights, one of which concerned with his approach towards playing international Cricket, without taking the undue pressure that comes the way. Stokes shed light on how he helps his teammates, in the capacity of the skipper, to treat the sport like an entertainment business, and thus keep the pressure at bay, despite the weight of expectations. He stated that cricketers forget that fans, unlike the players, treat the game as a source of entertainment, and expect the men on the field to provide them with the same, throughout the five days of Test Cricket. “Something I have tried to bring in is to remove the pressure of international cricket among the players. Sometimes we tend to forget that we are in the entertainment business. People come to watch us play because we are at the top level of our sport and sport is entertainment,” said Stokes, while talking about his approach to the game as a captain. “So, we have to go out and entertain people for five days in a row, every session. And if we play good cricket, we give ourselves a good chance of winning. If we play poorly, we lose. It is simple,” he further added. The Durham all-rounder is presently leading England in a three-match Test series at home against South Africa. The post “Go out and entertain people for five days in a row”: Ben Stokes shares how he’s working to remove pressure of international Cricket from his players as England Test captain appeared first on The SportsRush.","pubDate":"2022-08-24 18:00:23","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Williamson, Boult in New Zealand squad for Chappell-Hadlee series","link":"https://www.thestar.com.my/sport/cricket/2022/08/25/cricket-williamson-boult-in-new-zealand-squad-for-chappell-hadlee-series","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Kane Williamson has returned from injury and will captain New Zealand in the Chappell-Hadlee one-day international series against Australia while fast bowler Trent Boult is also included, New Zealand Cricket (NZC) said on Thursday. Read full story","content":"(Reuters) - Kane Williamson has returned from injury and will captain New Zealand in the Chappell-Hadlee one-day international series against Australia while fast bowler Trent Boult is also included, New Zealand Cricket (NZC) said on Thursday. Williamson had missed the final two games against the West Indies last week due to a quad injury but is available for the Sept. 6-11 three-match series in Cairns. Boult, who was released from his central contract with NZC at his own request earlier this month so he could spend less time travelling and more time at home with his family, is also in the 15-man squad. \"It's a great rivalry we have with Australia, it's always a huge occasion for the fans, and the team really look forward to it,\" Williamson said. \"You grow up watching the Chappell-Hadlee Trophy series and remembering the great battles, so to be part of another chapter is pretty special. \"We know how tough Australia are to beat in their own conditions and we're looking forward to the challenge.\" Fast bowler Matt Henry has also recovered from a rib injury to be named in the squad at spinner Ish Sodhi's expense. Injuries to Kyle Jamieson (back) and Adam Milne (Achilles) meant they did not make the cut. Australia, who have won the trophy six times, are the defending champions. \"We know how much the Chappell-Hadlee Trophy means to our fans and we're excited by the opportunity to head to Australia and try and win it back,\" coach Gary Stead said. \"With the ICC ODI World Cup in India just 14 months away - it's great to be playing more ODI cricket as we build towards the tournament next October-November.\" NEW ZEALAND SQUAD Kane Williamson (captain), Finn Allen, Trent Boult, Michael Bracewell, Devon Conway, Lockie Ferguson, Martin Guptill, Matt Henry, Tom Latham (wicketkeeper), Daryl Mitchell, Jimmy Neesham, Glenn Phillips, Mitchell Santner, Ben Sears, Tim Southee. (Reporting by Rohith Nair in Bengaluru; Editing by Toby Davis)","pubDate":"2022-08-24 17:51:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/25/1710512.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Shane Watson Predicts Winner Of Asia Cup 2022 Ahead Of The India vs Pakistan Match - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vY3JpY2tldGFkZGljdG9yLmNvbS9hc2lhLWN1cC0yMDIyL3NoYW5lLXdhdHNvbi1wcmVkaWN0cy13aW5uZXItb2YtYXNpYS1jdXAtMjAyMi1haGVhZC1vZi10aGUtaW5kaWEtdnMtcGFraXN0YW4tbWF0Y2gv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Watson Predicts Winner Of Asia Cup 2022 Ahead Of The India vs Pakistan Match  Cricket Addictor\"They Can Beat Indian Team...\": Shane Watson On Rohit Sharma-led Side's Biggest Hurdle In Asia Cup  NDTV SportsStanding room tickets released for sold out Men's T20 World Cup India v Pakistan fixture  ICC CricketIND vs PAK Asia Cup 2022 Match T20 Schedule, Date, Time, Venue, Squads, Playing XI, Live Streaming In India and Live Telecast In India  Cricket AddictorThe mystery spinner on a Karachi night, the infamy of a 100th hundred, a tie without a super over: Five classic Asia Cup matches  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-08-24 17:37:52","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Wouldn&#039;t have come this far in international cricket without ability to counter situations: Virat Kohli","link":"https://www.thehindu.com/sport/cricket/wouldnt-have-come-this-far-in-international-cricket-without-ability-to-counter-situations-virat-kohli/article65807361.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"Former India skipper Virat Kohli has gone without an international hundred across formats for nearly three years now but he feels that there isn't much scope for course correction","content":"File picture of Virat Kohli | Photo Credit: Getty Images He doesn't find any particular pattern to his prolonged slump in form unlike 2014, but then to succeed in international cricket for as long as Virat Kohli has, it could not have happened without his ability to counter adversities. The former India skipper has gone without an international hundred across formats for nearly three years now but he feels that there isn't much scope for course correction. The reason being that he isn't having any particular technical problem like one he had during England tour of 2014 when he was poking at deliveries on off-stump channel. \"I know where my game stands and you cannot run this far in your international career without having the ability to counter situations and counter conditions and counter different kinds of bowling. So, this for me, is an easier phase to process, but I don't want to put this phase behind me,\" Kohli said on Star Sports show 'Game Plan'. He then spoke how a pattern of dismissals was detected on that tour and then after technical adjustments scored nearly 600 runs during the tour of 2018. \"What happened in England was a pattern, so something that I could work on and something that I had to kind of overcome. Right now, as you rightly mentioned, there is nothing that you can point out saying that the problem is happening here,\" Kohli noted. However of late, Kohli has got out in every possible manner, to rising deliveries, to fuller balls, to swinging deliveries, to cutters, off-spin, leg-spin and left-arm spin. He feels that when there aren't any patterns, that's the best thing to have happened. \"So, that for me, is actually an easier thing to process because I know that I'm batting well and at times, when I start feeling that rhythm back, then I know that I'm batting well. \"So, that for me is not an issue, which wasn't the case in England (2014). I didn't feel like I was batting well at all. So, I had to work hard on one thing that could be exposed again and again which I overcame; right now this is not the case,\" he added. As he gets ready for the Asia Cup, Kohli knows that he will have to fight these ups and downs which are part and parcel of an elite sportsman's life. \"I know there are ups and downs, and when I come out of this phase, I know how consistent I can be. My experiences are sacred to me,\" he said. \"Whatever I have experienced in this phase or in the past, as well one thing that I can. \"So, this for me, is an easier phase to process, but I don't want to put this phase behind me. I want to learn from it and I want to understand what are the core values that I have, as a sportsperson and as a human being,\" he added. Our code of editorial values Printable version | Aug 25, 2022 2:52:59 am | https://www.thehindu.com/sport/cricket/wouldnt-have-come-this-far-in-international-cricket-without-ability-to-counter-situations-virat-kohli/article65807361.ece © THG PUBLISHING PVT LTD.","pubDate":"2022-08-24 17:30:41","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Laxman named as India's interim head coach in Dravid's absence for Asia Cup","link":"https://www.thehansindia.com/sports/cricket/laxman-named-as-indias-interim-head-coach-in-dravids-absence-for-asia-cup-759100","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Former batsman and present National Cricket Academy (NCA) head VVS Laxman on Wednesday was named as the interim head coach of the Indian cricket team for the upcoming Asia Cup 2022, to be played in the UAE, in Rahul Dravid's absence.","content":"New Delhi: Former batsman and present National Cricket Academy (NCA) head VVS Laxman on Wednesday was named as the interim head coach of the Indian cricket team for the upcoming Asia Cup 2022, to be played in the UAE, in Rahul Dravid's absence.Laxman who served as the coach in India's just-concluded three-match ODI series in Zimbabwe, will oversee the team's preparation in the absence of Dravid, who tested positive for Covid-19 before the team's departure to the UAE. The 49-year-old Dravid will join the team once he tests negative and is cleared by the BCCI Medical Team. Apart from Laxman, vice-captain KL Rahul, Deepak Hooda and Avesh Khan, who travelled from Harare, have also linked up with the squad in Dubai, a BCCI release said. The rest of the Zimbabwe series squad members, who are not part of the Asia Cup contingent, have returned to India. The Rohit Sharma-led India will begin their Asia Cup campaign against arch-rivals Pakistan on Sunday.","pubDate":"2022-08-24 16:59:19","image_url":"https://assets.thehansindia.com/h-upload/2022/08/24/500x300_1309320-vvs-laxman.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"EXCLUSIVE | Batters aren't scared, pace can't guarantee place in team: Veteran Chandu Borde on Umran Malik","link":"https://www.indiatvnews.com/sports/cricket/veteran-indian-player-chandu-borde-makes-big-statement-about-umran-malik-and-samson-ahead-of-asia-cup-2022-2022-08-24-802736","keywords":null,"creator":null,"video_url":null,"description":"Umran Malik has been a curious case for Indian cricket in a recent while. From rising through the ranks to get in the national team following IPL to being dropped from the team after a string of poor performances, Umran Malik has had a wild ride in recent months.","content":"Umran Malik has been a curious case for Indian cricket in a recent while. From rising through the ranks to get in the national team following to being dropped from the team after a string of poor performances, Umran Malik has had a wild ride in recent months. In an exclusive chat with India TV, Veteran Indian Test batter Chandu Borde said that while Umran has got a lot of pace, the game has evolved, and only pace can't guarantee you a place in the team. Also Read: \"See, Umran Malik has got a lot of speed, but the thing is that batters these days are protected from head to toe. Earlier, in my time, batters used to be scared. The protection wasn't really up to the mark. These days, even if the batsmen get hit, more often than not, the injuries aren't serious,\" said Borde. He added that, more than pace, it is the control and the number of variations that determine how successful a bowler is. \"So, just because someone has speed, it doesn't really guarantee a place in the Indian team. The variations and control are what matter. Only speed can't help you or the team,\" Borde added. The legend also talked about Sanju Samson and said that while he is a great player, he needs to find consistency in order to level up. \"Sanju Samson is a great player. He is a great competitor. The thing with Samson is that he makes this 70s and 80s, but doesn't follow it up and makes it count. He is inconsistent. But anyways, he is a wonderful player,\" said Borde. Both Umran Malik and Sanju Samson, it seems, are not part of team management plans for the T20 World Cup down-under as both remain out of favour for the Asia Cup in UAE.","pubDate":"2022-08-24 16:49:49","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan Sends Bowling Coach To Assist Shaun Tait At Asia Cup","link":"https://sports.ndtv.com/cricket/pakistan-sends-bowling-coach-to-assist-shaun-tait-at-asia-cup-3283817","keywords":null,"creator":null,"video_url":null,"description":"The Pakistan Cricket Board has sent a bowling coach from its national high performance centre in Lahore to assist the team's head bowling coach, Shaun Tait of Australia in the Asia Cup, beginning in...","content":"The Pakistan Cricket Board has sent a bowling coach from its national high performance centre in Lahore to assist the team's head bowling coach, Shaun Tait of Australia in the Asia Cup, beginning in the UAE from Saturday. Umar Rasheed left on Wednesday to join the Pakistan team on the recommendation of head coach, Saqlain Mushtaq. \"One is that since Mohammad Hasnain is in the squad Umar will keep on monitoring his bowling action as he worked on correcting his action when the fast bowler was first reported for an illegal bowling action early this year,\" a PCB source said. \"The idea is that Umar will act as the bridge for proper communication between Shaun Tait and the players.\" Pakistan has lost its main bowler, Shaheen Shah Afridi for the Asia Cup and the seven T20 Internationals at home against England because of a lingering knee ligament injury sustained in July. Afridi has been advised six to eight weeks rest before his injury will be assessed again. The fast bowler is presently with the Pakistan team in the UAE because the source said the team head coach, trainer, doctor and physio all suggested that Afridi can have the best possible treatment and rehab in Dubai. Promoted The Pakistani selectors replaced Afridi with young fast bowler Hasnain. Pakistan's pace attack in the Asia Cup is pretty thin on T20 internationals exposure as Hasnain, Haris Rauf, Mohammad Wasim junior, Shahnawaz Dahani have played a total of 66 matches between them while Naseem Shah is yet to make his T20 debut.","pubDate":"2022-08-24 16:43:26","image_url":"https://c.ndtvimg.com/2022-08/6678pb68_shaun-tait-240_120x90_24_August_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“I hit 100-150 sixes daily” – Pakistan batsman shares Asia Cup training ‘secret’","link":"https://thenewsglory.com/i-hit-100-150-sixes-daily-pakistan-batsman-shares-asia-cup-training-secret/","keywords":["Sports","Cricket","game","India","Pakistan"],"creator":["The News Glory"],"video_url":null,"description":"Pakistan batsman Asif Ali has said that Vlasi has taken special training while practicing 100 to 150 sixes daily for the Asia Cup series. India and Pakistan will play a multi-Test series at the Dubai Cricket Stadium on the 28th. In this case, he said this. The Pakistan Cricket Board shared a video of him […]","content":"Pakistan batsman Asif Ali has said that Vlasi has taken special training while practicing 100 to 150 sixes daily for the Asia Cup series. India and Pakistan will play a multi-Test series at the Dubai Cricket Stadium on the 28th. In this case, he said this. The Pakistan Cricket Board shared a video of him undergoing special training. In which he said, “In my batting position, an over requires an average of 10 runs. You have to play big shots to get those runs. It takes a lot of practice. That’s why I try to hit 100-150 sixes in daily practice. My hope is to score 4 or 5 sixes in the game with that. \r \r It all depends on the context of the game though. When I come to bat, there is pressure in the game. I usually approach the ball to suit its line and length. I don’t play the same shot over and over again. “Playing tap ball (tennis ball) cricket has helped my power-hitting a lot,” he said. The two teams clashed at the same Dubai Cricket Ground last year. Pakistan won it without losing a wicket. Winning the toss is very important on this ground. However, it is noteworthy that the Indian team is now taking the field with a new leap led by Rohit.","pubDate":"2022-08-24 16:29:14","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"\"They Can Beat Indian Team...\": Shane Watson On Rohit Sharma-led Side's Biggest Hurdle In Asia Cup - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMidWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvbXktcHJlZGljdGVkLXdpbm5lci1pcy1zaGFuZS13YXRzb24tb24taW5kaWEtdnMtcGFraXN0YW4tYXNpYS1jdXAtY2xhc2gtMzI4MzcwOdIBe2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvbXktcHJlZGljdGVkLXdpbm5lci1pcy1zaGFuZS13YXRzb24tb24taW5kaWEtdnMtcGFraXN0YW4tYXNpYS1jdXAtY2xhc2gtMzI4MzcwOS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"They Can Beat Indian Team...\": Shane Watson On Rohit Sharma-led Side's Biggest Hurdle In Asia Cup  NDTV SportsIndia vs Pakistan: 3 Pakistan Born Players Who Played For India  Cricket AddictorAsia Cup LIVE Broadcast: Starsports launch new promotion video for Asia Cup 2022: Check Out  InsideSportStanding room tickets released for sold out Men's T20 World Cup India v Pakistan fixture  ICC CricketIND vs PAK Asia Cup 2022 Match T20 Schedule, Date, Time, Venue, Squads, Playing XI, Live Streaming In India and Live Telecast In India  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-08-24 16:24:07","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"ECB to show support for Rainbow Laces during England Test","link":"https://www.skysports.com/cricket/news/12040/12680642/ecb-to-show-support-for-rainbow-laces-during-englands-second-test-with-south-africa","keywords":null,"creator":null,"video_url":null,"description":"The England and Wales Cricket Board is supporting Stonewall's Rainbow Laces campaign for the fifth time, and the first time during an England men's Test match.","content":null,"pubDate":"2022-08-24 16:20:00","image_url":"https://e0.365dm.com/22/08/1920x1080/skysports-rainbow-laces-cricket_5874843.jpg?20220824170354","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Old Trafford Manchester pitch report: Old Trafford cricket ground pitch report for England vs South Africa 2nd Test","link":"https://thesportsrush.com/cricket-news-old-trafford-manchester-pitch-report-old-trafford-cricket-ground-pitch-report-for-england-vs-south-africa-2nd-test/","keywords":["Cricket","Old Trafford","South Africa tour of Englanf 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Old Trafford Manchester pitch report: With an aim to get back to winning ways, England take on the Proteas in the 2nd Test match tomorrow. After suffering a humbling innings defeat against South Africa in the first Test match at Lord’s, England are all set to get back to their winning ways, with the second… The post Old Trafford Manchester pitch report: Old Trafford cricket ground pitch report for England vs South Africa 2nd Test appeared first on The SportsRush.","content":"Old Trafford Manchester pitch report: With an aim to get back to winning ways, England take on the Proteas in the 2nd Test match tomorrow. After suffering a humbling innings defeat against South Africa in the first Test match at Lord’s, England are all set to get back to their winning ways, with the second of the three-match Test series scheduled to commence from tomorrow onwards at the Emirates Old Trafford, in Manchester. Having lost his maiden Test match ever since his appointment as England’s Test skipper, the margin of defeat would have perhaps pinched Ben Stokes a bit harder, especially after South Afican skipper Dean Elgar seemed to almost rubbish their most-talked about ‘Bazball’ approach ahead of the Lord’s Test, while even challenging the same against their pace-attack. As things turned out, the Proteas pacers managed to scalp 18 of the 20 English wickets, to decimate the hosts by an innings margin. As has been their custom off-late in the format, England have named their Playing XI for the second Test, with all-rounder Ollie Robinson replacing pacer Matthew Potts from the Lord’s Test. ALSO READ : Weather at Old Trafford cricket ground tomorrow for 2nd Test The Emirates Old Trafford is set to host its first Test match since August 2020, after the hosts defeated Pakistan by 3 wickets during the first of the three-match Test series. England boast of a good record against the Proteas at this venue, having lost just one out of the nine Test matches here, and with four wins and as many draws. The past few Test matches at the Old Trafford have been high scoring ones, and a fresh pitch after a two-year-gap is likely to act no different. Team batting first will likely target a score at least in the vicinity of the 350-run mark. On the flip side, the pacers are likely to extract significant purchase majorly on the first Day’s play, on what overall will be a track which will assist the batters. Here’s the pitch – the one they’re standing on; not the one on the right of the pic – for the second Test: pic.twitter.com/NKfdHSo1n2 — George Dobell (@GeorgeDobell1) August 23, 2022 The spinners too, are likely to come into the game as the match progresses, with the pitch at this venue developing the tendency to break and thus slow down a tad. Chasing teams have won just one of the last eight matches in Manchester. Thus, it would be interesting to see whether England do opt to chase if they win the Toss tomorrow.","pubDate":"2022-08-24 16:16:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"\"Can Beat India...\": Watson On Rohit-led Side's Biggest Hurdle In Asia Cup","link":"https://sports.ndtv.com/cricket/my-predicted-winner-is-shane-watson-on-india-vs-pakistan-asia-cup-clash-3283709","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team will play Pakistan at the Asia Cup on August 28","content":"The Asia Cup 2022 will see arch-rivals Indian cricket team and Pakistan cricket team facing each other on August 28. Every time these two teams face off on the cricket field, the focus and scrutiny on the match is intense. The last time the two teams played each other, at the 2021 T20 World Cup, Pakistan emerged victorious to register their first-ever win against India in a World Cup contest. Virat Kohli was the captain of the Indian side then, whereas Rohit Sharma is the skipper now. Ahead of the high-voltage contest, former Australian cricket team player Shane Watson was asked on 'The ICC Review' to predict the winner of the Asia Cup. \"My predicted winner is India. They're so strong and depending on what the conditions are, they adapt easily to conditions,\" Watson said. When asked about India's big hurdle on their way to win the title, Watson said arch-rivals Pakistan would pose a major challenge. Promoted \"That first game is going to be very special to watch because Pakistan have full belief now that they can beat this Indian team,” said Watson. “I think, really, whoever wins that game is going to go on and win the Asia Cup. [But] I've just got a feeling India [will win the tournament]. They've got so much firepower all the way through their batting order, so it's going to be hard to be able to contain them.\" India's squad for Asia Cup: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, Ravindra Jadeja, R. Ashwin, Yuzvendra Chahal, Ravi Bishnoi, Bhuvneshwar Kumar, Arshdeep Singh, Avesh Khan","pubDate":"2022-08-24 16:11:55","image_url":"https://c.ndtvimg.com/2022-06/88j1lifg_virat-kohli-babar-azam_625x300_08_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Virat Kohli, Babar Azam catch up ahead of India vs Pakistan Asia Cup tie - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMirQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC93YXRjaC12aXJhdC1rb2hsaS1iYWJhci1hemFtLWNhdGNoLXVwLWJlZm9yZS1pbmRpYS1wYWtpc3Rhbi1hc2lhLWN1cC10aWUtdHdpdHRlci1yZWFjdHMtY2FuLXQtc2VlLWFueXRoaW5nLWJldHRlci0xMDE2NjEzNTUwODE5MzIuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Virat Kohli, Babar Azam catch up ahead of India vs Pakistan Asia Cup tie  Hindustan TimesWatch: Virat Kohli Meets Pakistan Captain Babar Azam Ahead Of Asia Cup 2022  NDTV Sports`I know that I`m batting..`: Virat Kohli BREAKS his silence on poor form ahead of Asia Cup 2022 IND vs PAK...  Zee News“I know where my game stands, wouldn't have come this far in int'l cricket without ability to counter situations”: Virat Kohli  The Indian Express'Can't run this far without abilities': Virat Kohli's indirect reply to critics  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-08-24 16:08:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup Qualifiers Live: Hong Kong Win Toss, Opt To Bowl vs UAE","link":"https://sports.ndtv.com/cricket/hong-kong-vs-united-arab-emirates-asia-cup-qualifiers-live-score-updates-3283698","keywords":null,"creator":null,"video_url":null,"description":"Hong Kong vs United Arab Emirates, Asia Cup Qualifiers, Live Updates: Hong Kong face UAE in the sixth and final match of the Asia Cup qualifier on Wednesday at Al Amerat Cricket Ground, Oman","content":null,"pubDate":"2022-08-24 16:07:27","image_url":"https://c.ndtvimg.com/2022-08/pa9j626_uae-cricket_625x300_22_August_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Virat Kohli Meets Pakistan Captain Babar Azam Ahead Of Asia Cup 2022 - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMibGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvdmlyYXQta29obGktbWVldHMtd2l0aC1iYWJhci1hemFtLWFoZWFkLW9mLWFzaWEtY3VwLTIwMjItd2F0Y2gtMzI4MzUyMtIBcmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvdmlyYXQta29obGktbWVldHMtd2l0aC1iYWJhci1hemFtLWFoZWFkLW9mLWFzaWEtY3VwLTIwMjItd2F0Y2gtMzI4MzUyMi9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Virat Kohli Meets Pakistan Captain Babar Azam Ahead Of Asia Cup 2022  NDTV Sports`I know that I`m batting..`: Virat Kohli BREAKS his silence on poor form ahead of Asia Cup 2022 IND vs PAK...  Zee News'Can't run this far without abilities': Virat Kohli's indirect reply to critics  Hindustan Times\"Mouths Will Be Shut...\": Ravi Shastri's Strong Take On Virat Kohli Regaining Form  NDTV SportsIndia vs Pakistan: You Need To Be Diplomatic As A Coach - Danish Kaneria To Saqlain Mushtaq Over Comments On Shaheen Afridi's Absence  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-08-24 15:30:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup | VVS Lashman has been appointed as the interim coach of the Indian team","link":"https://thenewsglory.com/asia-cup-vvs-lashman-has-been-appointed-as-the-interim-coach-of-the-indian-team/","keywords":["Sports","Cricket","game","India","Lakshman","Lashman","VVS Laxman"],"creator":["The News Glory"],"video_url":null,"description":"Mumbai: The Board of Control for Cricket in India has announced that VVS Lashman will act as the interim coach of the Indian team for the upcoming Asia Cup series. This announcement has been made while head coach Rahul Dravid has been confirmed to be infected with Corona. Lashman played well in the international cricket […]","content":"Mumbai: The Board of Control for Cricket in India has announced that VVS Lashman will act as the interim coach of the Indian team for the upcoming Asia Cup series. This announcement has been made while head coach Rahul Dravid has been confirmed to be infected with Corona. Lashman played well in the international cricket field for the Indian team from 1996 to 2012. He has played 134 Tests and 86 ODIs. He has accumulated a total of 11,119 runs. Recently he worked as the acting coach of the Indian team in Ireland and Zimbabwe series. In this case, head coach Rahul Dravid was confirmed to be infected with Corona virus yesterday. Since then, there were reports that Lashman might be appointed as the coach of the Indian team. Now BCCI has confirmed it. Due to this, it is reported that he has joined the flight to Dubai from Harare with the players in the team for the Asia Cup series. Players like KL Rahul, Deepak Hooda and Avesh Khan have left Harare for Dubai. The Asia Cup series runs from 27 August to 11 September. The Indian team is led by Rohit in this series. \r NEWS – VVS Laxman named interim Head Coach for Asia Cup 2022. More details here https://t.co/K4TMnLnbch #AsiaCup #TeamIndia","pubDate":"2022-08-24 15:28:06","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"“More fearless in my approach”: Cheteshwar Pujara explains reason behind Royal London Cup 2022 run-spree for Sussex","link":"https://thesportsrush.com/cricket-news-more-fearless-in-my-approach-cheteshwar-pujara-explains-reason-behind-royal-london-cup-2022-run-spree-for-sussex/","keywords":["Cricket","Cheteshwar Pujara","Royal London Cup 2022","Sussex"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Cheteshwar Pujara explains reason for his purple patch of form in the ongoing Royal London One-Day Cup 2022 in England. A yet another century in the ongoing Royal London One-Day Cup 2022 for Sussex, has meant that Cheteshwar Pujara has helped his side march on towards the tournament semi-final, set to be played on August… The post “More fearless in my approach”: Cheteshwar Pujara explains reason behind Royal London Cup 2022 run-spree for Sussex appeared first on The SportsRush.","content":"Cheteshwar Pujara explains reason for his purple patch of form in the ongoing Royal London One-Day Cup 2022 in England. A yet another century in the ongoing Royal London One-Day Cup 2022 for Sussex, has meant that Cheteshwar Pujara has helped his side march on towards the tournament semi-final, set to be played on August 30. Smashing his third century across eight innings yesterday, against Middlesex this time around, the 34-year-old surpassed the three-figure mark off mere 76 deliveries, to ultimately score a classy 90-ball 132. Thus, after posting 400/4 on the scoreboard, Sussex restricted the Middlesex batting line-up to 243 in 38.1 Overs, to win the contest by 157 runs, and with it, top Group ‘A’, with six wins out of eight matches. Fans took to social media post his aforementioned ton, as he also completed 5,000 List-A runs across 109 innings, at an average of 57.76. Cheteshwar Pujara explains reason for his purple patch of form The Saurashtra batter, post yesterday’s innings, ranks second in the tournament’s highest run-getter this season, with 614 runs under his belt at an average of 102.3, constituting 3 centuries and a couple of half-centuries. However, scoring these runs at a strike-rate of 116.28, has emerged as a major talking point, for a batter who is considered a ‘Test-match specialist’, and having not played a single limited Overs match since only his 5th ODI in 2014 against Zimbabwe. Perhaps after soaking in all the words of praises and congratulatory messages, Pujara took to his Twitter handle a few hours ago, to begin a question and answer session with his followers for a period of half-an-hour. One of his followers queried regarding a possible change in his technique or mindset while approaching an ODI game, which has paved the way for his brilliant run in the ongoing tournament. As a response to the question, Pujara stated that he has adopted a more fearless approach, while also adding a few more shots to his game. I am more fearless in my approach and added a few more shots in my game https://t.co/PIHuJth49G — Cheteshwar Pujara (@cheteshwar1) August 24, 2022 He also admitted that the popularity of the ODI format has indeed received a dent, as talks around the sustenance of the format has been questioned off-late, especially in relation with the rise in number and popularity of the various T20 leagues around the world. Unfortunately yes it is losing its popularity https://t.co/uQgdBLYGkN — Cheteshwar Pujara (@cheteshwar1) August 24, 2022 For more Cricket-related news, click here. The post “More fearless in my approach”: Cheteshwar Pujara explains reason behind Royal London Cup 2022 run-spree for Sussex appeared first on The SportsRush.","pubDate":"2022-08-24 15:23:16","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}