{"newsArray":[{"title":"India vs New Zealand LIVE score 3rd ODI: IND look to level series vs NZ","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-3rd-odi-ind-vs-nz-live-score-cricket-match-latest-updates-christchurch-rain-weather-11721461.html","keywords":["First Cricket News"],"creator":["Somya Kapoor"],"video_url":null,"description":"India vs New Zealand LIVE score 3rd ODI: IND look to level series vs NZ","content":"New Zealand Vs India LIVE SCORE (odi) Quick Scorecard Full scorecard Ball by ball commentary FP commentary New Zealand Vs India At Hagley Oval, Christchurch, 30 November, 2022 30 November, 2022 Starts 07:00 (IST) Match yet to begin India 0/0 (0.0 ov) 3rd ODI New Zealand Yet To Bat Live Blog India New Zealand 0/0 (0.0 ov) - R/R 0.0 Match yet to begin This Over Batting Status R B 4s 6s Bowling 0 M R W Current Partnership Last Wicket 0/0 (0) 0 (0) R/R: 0 0 0(0) S.R (0) India vs New Zealand LIVE score 3rd ODI: NZ opt to bowl vs IND India vs New Zealand LIVE cricket score and updates, IND vs NZ 3rd ODI, ball by ball commentary: Kane Williamson won the toss and elected to bowl first. Catch all the LIVE UPDATES here! Live Updates Highlights 06:49 (IST) India vs New Zealand LIVE Playing XI India: Shikhar Dhawan(c), Shubman Gill, Suryakumar Yadav, Shreyas Iyer, Rishabh Pant(w), Deepak Hooda, Washington Sundar, Deepak Chahar, Umran Malik, Arshdeep Singh, Yuzvendra Chahal Full Scorecard 06:49 (IST) India vs New Zealand LIVE Playing XI New Zealand: Finn Allen, Devon Conway, Kane Williamson(c), Daryl Mitchell, Tom Latham(w), Glenn Phillips, Mitchell Santner, Adam Milne, Matt Henry, Tim Southee, Lockie Ferguson Full Scorecard 06:47 (IST) India vs New Zealand LIVE UPDATES Kane Williamson has once again called it right. New Zealand have won the toss and elected to field first against India in this final showdown Full Scorecard 06:41 (IST) Trams 🚃, Cafes ☕️ & old memories 👌 Explore Christchurch with Mumbaikars @ShreyasIyer15 & @imShard 🙌 P.S - Do not miss skipper @SDhawan25 's guest appearance 😎 - by @ameyatilak Full interview 🔽🎥 #TeamIndia https://t.co/0U4ewOEZWG pic.twitter.com/OnHOp6ijJZ — BCCI (@BCCI) November 29, 2022 Full Scorecard 06:36 (IST) India vs New Zealand The covers have been removed. The toss will take place in sometime now. We just hope that the rain stays away today. India are trailing the series 0-1 and need to win this one Full Scorecard 06:32 (IST) India vs New Zealand LIVE GOOD NEWS! The rain has stopped but the covers are still on. The players are warming up. Hope, we can have the toss soon Full Scorecard 06:28 (IST) India vs New Zealand It's not really looking good today as well. The covers are on. It's drizzling as well. This India tour of New Zealand has been a rain-affected one. We could get only one result in the T20I series while the second ODI was also washed away Full Scorecard 06:26 (IST) India vs New Zealand- Pre-match talks \"I benefit bowling with him because the batters can get deceived as the pace drops from 155kph to 135kph. We're enjoying bowling with each other and off the field as well,\" Arshdeep said ahead of the match Full Scorecard 06:08 (IST) Hello and welcome to the LIVE COVERAGE of the final ODI between India and New Zealand Full Scorecard Highlights India vs New Zealand, 3rd ODI, LIVE SCORE: IND take on NZ in Christchurch. AP PREVIEW: India and New Zealand take on each other in the final ODI in Christchurch. The home side leads the series 1-0 after winning the first ODI, courtesy a batting masterclass from Tom Latham while the second encounter was called off due to rain. India on the other hand, would look to win this final clash to end the series 1-1. SQUADS: India: Shikhar Dhawan(c), Shubman Gill, Suryakumar Yadav, Shreyas Iyer, Rishabh Pant(w), Deepak Hooda, Washington Sundar, Deepak Chahar, Umran Malik, Arshdeep Singh, Yuzvendra Chahal, Sanju Samson, Kuldeep Yadav, Shardul Thakur New Zealand: Finn Allen, Devon Conway, Kane Williamson(c), Daryl Mitchell, Tom Latham(w), Glenn Phillips, Mitchell Santner, Michael Bracewell, Matt Henry, Tim Southee, Lockie Ferguson, James Neesham, Adam Milne Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 30, 2022 06:58:26 IST Tags: Cricket India Vs New Zealand Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-30 00:54:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/India-vs-New-Zealand-3rd-ODI-LIVE.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"‘He was there’: Warne’s hand in stirring win","link":"https://www.couriermail.com.au/sport/golf/emotional-win-at-st-andrews-fuelled-by-memories-of-shane-warne/news-story/edb44e0595c58b111c8ef9266a75e880","keywords":["Breaking News","Golf news","National Breaking News","NewsWire"],"creator":null,"video_url":null,"description":"Whenever his phone pinged and Shane Warne’s name flashed on the screen, Ryan Fox smiled because he knew he was in for a good golfing time.","content":"The Kiwi star has enjoyed the best year of his own career in 2022, which included an emotional victory in the Dunhill Links at St Andrews, a teams event where until Warne’s untimely death the pair had formed an incredible bond. Fox has decided to end his year in Melbourne, in bayside Melbourne too, Warne territory, hoping he has enough juice in the tank to challenge for an Australian Open win that would be a fitting tribute to his great mate. As the Test season begins for the first time in nearly 30 years without Warne involved as a player or commentator, Fox conceded his world too was different now knowing those messages for a game, usually in London, would no longer come. But even the thought of those calls from nowhere brought a big smile to Fox’s face as he remembered what a “great man” Warne, who loved telling the story of his hole in one at Augusta, was. “I mean, if you spoke to him enough, he was obsessed with golf. I think he’s a member of more golf clubs than anyone. He probably played more golf than probably I did,” Fox said. “And it was his competition. Obviously, (he) couldn’t give up the competition side of his life, and that was his competition when cricket finished.“It meant a lot this year to win at Dunhill, and I would have loved for him to be there. He absolutely loved that event. “Last year we finished second as a team and I’d birdied the last hole at Kingsbarns the day before to get us in the team cut and me in the pro cut and he was absolutely buzzing about that.“He was so excited to play on Sunday and we did have probably a few too many vodka Red Bulls that Saturday night, but he was just such a huge golf fan.”More than that, Warne was a huge Fox supporter, and as so many of Warne’s friends recalled upon his death, he enjoyed their successes too. “Anytime I did well on something I’d get a message from him and to have one of your idols do that was amazing. To be able to call him a mate was an honour,” Fox said. “It was pretty emotional week at Dunhill, and I don’t know if I believe in that stuff, but I kind of felt like he was there somehow that week looking down, helping out.“Everything just felt nice and calm out on the golf course. And that was kind of what he was like, right? No matter what was going on elsewhere, he’d get on the pitch and he’d just turn it on and that’s kind of what it felt like that week for me.”They didn’t often win as a pairing though, including in a showdown with former English tennis great Tim Henman on one of those occasions Fox was invited into the Warne world, that world where he knew everyone. “It was always cool to get a message from Warnie when he was in the UK and say, ‘Hey, I’m playing golf at Greenwood or we’re playing golf at Sunningdale’, and he’d ask me to join,” Fox said. “We played Sunningdale with Tim Henman and another one of his good mates Terry Crawley (father of English batter Zac), who is off scratch, and Henman’s off plus four and me and Warnie got absolutely wiped, they hammered us.“He (Warne) always had a few bets going and he just absolutely loved it.“He had so much time for everyone and I experienced that first hand and I was lucky enough to be to be one of those people able to call him a mate.”","pubDate":"2022-11-30 00:04:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND vs NZ 3rd ODI: Desperate India hope for full game in final match","link":"https://kashmirreader.com/2022/11/30/ind-vs-nz-3rd-odi-desperate-india-hope-for-full-game-in-final-match/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"CHRISTCHURCH: Frustrated by the fickle weather, a desperate Indian team would pray for a rain-free final ODI against New Zealand in its bid to finish on an even keel in a series that neither had context nor any major takeaways. There is forecast of scattered showers in Christchurch and nothing can be more irritating than […]","content":"CHRISTCHURCH: Frustrated by the fickle weather, a desperate Indian team would pray for a rain-free final ODI against New Zealand in its bid to finish on an even keel in a series that neither had context nor any major takeaways. There is forecast of scattered showers in Christchurch and nothing can be more irritating than playing a series where the Gen-Next of Indian cricket hardly got any game time to show their prowess. Out of five white-ball games that also includes three-match T20I series, two matches (one T20I and one ODI) didn’t yield any result and one game (T20I) was curtailed significantly and ended in a tie due to Duckworth-Lewis method. With the series in line, Shikhar Dhawan and his men would aim to put up an impactful performance at the picturesque Hagley Oval ground, which has traditionally helped the seam bowlers and has an average score in the 230 range in the past few years. The Indian batting in first Powerplay (first 10 overs) has been much talked about and even though skipper Dhawan has been a prolific ODI opener over the years, even he understands that to secure his place for the next World Cup, his approach needs a sea change. His young opening partner Shubman Gill, however, has shown more intent in shot selection with scores of 50 and 45 not out in the two games. So has Indian cricket’s current blue-eyed boy Suryakumar Yadav, whose three sixes in a short 12.5 overs of play at the Seddon Park, did send the Indian supporters into raptures. But the bigger challenge for Indian batting line-up will be to put up an above par score against New Zealand on a ground where swing bowlers have ruled the roost in the past few ODI games. And for that, not just the openers or Surya but the likes of Rishabh Pant also needs to step up and be counted. Rishabh’s ODI record is pretty impressive but currently, the runs have dried up since the tour of England (primarily in 20 over cricket) and he is one player, who needs to fire in order to ensure that Indian middle-order looks competitive against a quality Black Caps attack. Rishabh’s presence and lack of bowling options among the specialist batters also effectively mean that Sanju Samson has to once again sit out, like the last game where Deepak Hooda, because of his all-round skills, was preferred over the immensely popular cricketer from Kerala. Since the last match was a wash-out, it will be interesting if interim head coach VVS Laxman decides to shuffle with the playing XI, especially the bowling attack where Kuldeep Yadav is yet to get an opportunity. But to leave out either Yuzvendra Chahal or Washington Sundar will be doing them a disservice. Shardul Thakur looked pedestrian in the opening ODI in Auckland and, in all likelihood, Arshdeep Singh, Deepak Chahar and the fiery Umran Malik will continue to lead the pace attack. For the New Zealand pacers Matt Henry, Tim Southee and Lockie Ferguson, there couldn’t be a better venue to exploit the frailties in India’s batting to the fullest. Similarly, the Indian bowling attack would get a conducive bowling track to ask some probing questions to the likes of Tom Latham and Kane Williamson, who have proved to be the thorn in flesh during the last game. Match Starts: 7 am IST. —PTI IND vs NZ 3rd ODI: Desperate India hope for full game in final match added by Press Trust of India on 12:30 am November 30, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-29 19:00:43","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Umran Malik’s speed helps me to deceive batters with lesser pace: Arshdeep Singh","link":"https://kashmirreader.com/2022/11/30/umran-maliks-speed-helps-me-to-deceive-batters-with-lesser-pace-arshdeep-singh/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"CHRISTCHURCH: Their bowling styles are like chalk and cheese, but Arshdeep Singh finds Umran Malik’s frightening pace beneficial as the batters are always struggling to adjust due to the marked difference in their respective speed. Jammu pace sensation Malik is one of the fastest bowlers in world cricket alongside South African Anrich Nortje and Englishman […]","content":"CHRISTCHURCH: Their bowling styles are like chalk and cheese, but Arshdeep Singh finds Umran Malik’s frightening pace beneficial as the batters are always struggling to adjust due to the marked difference in their respective speed. Jammu pace sensation Malik is one of the fastest bowlers in world cricket alongside South African Anrich Nortje and Englishman Mark Wood to name a few, who regularly hit 150 kmph. Arshdeep is more of a swing bowler, who normally, when in rhythm, hits around early 130 kmph mark. Both the IPL performers made their ODI debut against New Zealand in the opening game in Auckland and the Punjab man wants the partnership to continue forever. “It is always good to bowl alongside Umran and he is also fun-loving so the dressing room atmosphere remains nice,” Arshdeep said ahead of the third and final ODI against New Zealand, here on Wednesday. “As far as bowling is concerned, I get a lot of benefit from Umran’s bowling as batters need to adjust heavily from 155 kmph to 135 kmph. And they get deceived by pace and we enjoy bowling with each other. I expect we are able to continue this partnership for longest time,” he said. Having made a name in T20Is, Arshdeep doesn’t want to change too much while playing the 50-over format. “My way of bowling is attack at the start and defensive at the end in T20Is. Not very different in ODIs for me and wherever I get a chance, I will try to do well.” ‘Fans have a right to criticise’ Arshdeep in his short career has already seen the ugly side of fandom when he was mercilessly trolled on social media after India’s loss to Pakistan in an Asia Cup game in Dubai. A drunk fan had also abused him while he was getting into the team bus. But showing maturity beyond years, the 23-year-old said that he has learnt to take everything in his stride. “If you do well, you get love and praise and when you don’t, the fans have the right to criticise us. They also love the game and the team. You will get love and brickbats both along the way but key is to accept both with equal humility,” Arshdeep said. Recently in Australia, he got a lot of support and there were quite a number of devoted Arshdeep fans, who would have his photographs printed on their T-shirts. “It feels great to see (people wearing T-shirt with his photo) and pen lyrics dedicated to him but focus is always on the game, good or bad, one needs to conduct one’s self well,” he said. For him staying in the moment is the most important thing. “When you play the game, you want to enjoy rather than think that I want to be the main bowler of the side. You want to stay in the moment rather than think where I will be one year down the line. If you stay in present, it helps you as a player,” said Arshdeep, who has 33 wickets in 21 T20Is. About the rain-affected series, he said that some things are beyond anyone’s control. “Weather is not in our control and even during breaks one needs to be mentally prepared. We need to follow the process and there should be no let up in preparation,” he concluded. —PTI Umran Malik’s speed helps me to deceive batters with lesser pace: Arshdeep Singh added by Press Trust of India on 12:30 am November 30, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-29 19:00:22","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"More players might give central contracts for T20 leagues, hints NZ pacer Southee","link":"https://kashmirreader.com/2022/11/30/more-players-might-give-central-contracts-for-t20-leagues-hints-nz-pacer-southee/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Christchurch: The assortment of T20 leagues, including the cash-rich IPL has entirely changed the landscape of cricket with more and more players inclined to forego their national contracts in lure of lucrative overseas deals, feels New Zealand pacer Tim Southee. Three New Zealand players — Trent Boult, Martin Guptill and Jimmy Neesham — have so […]","content":"Christchurch: The assortment of T20 leagues, including the cash-rich IPL has entirely changed the landscape of cricket with more and more players inclined to forego their national contracts in lure of lucrative overseas deals, feels New Zealand pacer Tim Southee. Three New Zealand players — Trent Boult, Martin Guptill and Jimmy Neesham — have so far given up their central contract to play in different leagues across the globe. “It has been an interesting last few months where the landscape of cricket has changed, quicker than most thought,” Southee said ahead of Wednesday’s third ODI against India. “I am contracted to New Zealand Cricket at the moment and I’ve been back to the IPL (Indian Premier League) this year and we’ll see what happens over the coming years. But it’s definitely changing the landscape of cricket to what it was two-three years ago.” Southee will turn up for Kolkata Knight Riders in 2023 IPL season. Southee, himself, remained non-committal about the possibility of following the footsteps of his teammates and stepping away from his national contracts. “I haven’t looked too far ahead, to be honest. There’s enough cricket to come in the coming months to worry about before having to look too far ahead. But it’s something all players are trying to stay with and think about in the moving landscape of the game,” he said. —PTI More players might give central contracts for T20 leagues, hints NZ pacer Southee added by Press Trust of India on 12:30 am November 30, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-29 19:00:13","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 Live Score: Iran, USA faceoff in do-or-die contest; England meet Wales","link":"https://www.firstpost.com/sports/fifa-world-cup-2022-iran-vs-usa-wales-vs-england-live-score-group-b-football-latest-updates-11721171.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"FIFA World Cup 2022 Live Score: Iran, USA faceoff in do-or-die contest; England meet Wales","content":"23:33 (IST)Hello and welcome to our LIVE coverage of the third and final matchday in Group B of the FIFA World Cup. Group B consists of England, Wales, Iran and the United States of America, and all four teams can go through to the round of 16, but only two teams will eventually make it. Both matches in Qatar kick off at the same time (10 pm local time, 12.30 am IST). Here's the matchday three schedule of Group B: Wales vs England at Al Rayyan Stadium Iran vs USA at Al Thumama StadiumPreview: England face Wales in a blockbuster FIFA World Cup Group B clash in Qatar’s Al Rayyan on Tuesday, knowing a win will all but secure themselves a place in the round of 16 phase.England began the tournament in astounding fashion, thumping Iran 6-2, after which they played out a goalless draw against USA.For Wales, however, things have not quite gone as per their plan. They endured a 1-1 draw against USA, in which Gareth Bale scored a penalty, and followed it up with a shock 0-2 defeat to Iran.England (Four points) and Iran (three) occupy the top two spots in Group B after two games but all that could change during the course of 90 minutes. Iran, meanwhile, takes third placed USA (two points) in a winner-takes-all contest. Wales are currently fourth in the standings, with just one point, and their goal difference of -2 does not help their case either.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-29 18:15:40","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Harry-Kane-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI serves conflict of interest notice to its president","link":"https://www.orissapost.com/bcci-serves-conflict-of-interest-notice-to-its-president/","keywords":["Sports","bcci","Conflict of Interest","Roger Binny"],"creator":["Post News Network"],"video_url":null,"description":"New Delhi: BCCI ethics officer Vineet Saran has served a conflict of interest notice to board president Roger Binny. PTI has learnt that Saran has asked Binny to file a written response by December 20 against the conflict of interest allegations levelled against him. The complainant, Sanjeev Gupta, has alleged that Binny is conflicted as […]","content":"BCCI serves conflict of interest notice to its president PTI Updated: November 29th, 2022, 21:53 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin New Delhi: BCCI ethics officer Vineet Saran has served a conflict of interest notice to board president Roger Binny. PTI has learnt that Saran has asked Binny to file a written response by December 20 against the conflict of interest allegations levelled against him. The complainant, Sanjeev Gupta, has alleged that Binny is conflicted as his daughter-in-law works for Star Sports which has home season media rights for Indian cricket. “You are hereby informed that a complaint has been received under Rule 39(2)(b) of the Rules and Regulations of BCCI by the Ethics Officer, BCCI for breach of Rule 38 (1) (i) and Rule 38(2) of the said rules, constituting an instance of “conflict of interest” on your part. “You are directed to file your Written Response to the accompanying complaint on or before 20/12/2022. The said response should be supported by a duly executed affidavit,” wrote Saran in the notice dated November 21. World Cup winner Binny had become the 36th BCCI president in October, replacing former India captain Sourav Ganguly. The 67-year-old played 27 Tests and T20 ODIs for India. PTI Tags: bcci Conflict of Interest Roger Binny Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Mexico faces early World Cup exit against Saudi Arabia November 29, 2022 There are no cowards in Australian team: Cummins hits back at Langer November 29, 2022 Ronaldo denied goal, Portugal beats Uruguay 2-0 in World Cup November 29, 2022 Injured Neymar gets treatment at hotel as Brazil play at World Cup November 28, 2022 Shiv Sundar Das applies for BCCI’s senior selection panel November 28, 2022 Cameroon, Serbia play out thrilling draw, share points, 6 goals November 28, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-11-29 16:23:44","image_url":"https://www.orissapost.com/wp-content/uploads/2022/07/BCCI-300x169.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA WC 2022 | That’s Bruno’s goal… No contact with Ronaldo: adidas confirmed by sensor","link":"https://thenewsglory.com/fifa-wc-2022-thats-brunos-goal-no-contact-with-ronaldo-adidas-confirmed-by-sensor/","keywords":["Sports","Controversy","FIFA","FIFA WC 2022","FIFA World Cup","FIFA World Cup Qatar 2022","FIFA WorldCup 2022","Football","handball","online special","Portugal","World Cup"],"creator":["The News Glory"],"video_url":null,"description":"Portugal won 2-0 against Uruguay in the ongoing FIFA World Cup. There was a debate over who scored Portugal’s first goal in the match. In this context Adidas has ensured that with the help of technology. On the one hand, Ronaldo decided to celebrate scoring a goal. On the other hand, the referees ruled that […]","content":"Portugal won 2-0 against Uruguay in the ongoing FIFA World Cup. There was a debate over who scored Portugal’s first goal in the match. In this context Adidas has ensured that with the help of technology. On the one hand, Ronaldo decided to celebrate scoring a goal. On the other hand, the referees ruled that it was a goal scored by Bruno. Some fans are calling this goal as ‘Hair of God’. As such, Adidas has jumped into the fray and given the verdict. The ‘Al Rahla’ ball being played in this series is manufactured by Adidas. Therefore, the company said that it was either Ronaldo or Bruno Fernandes who scored the goal with the help of technology. For the first time in the history of the Football World Cup, the ball being played in the current series is fitted with sensor technology. The technology is said to help referees greatly with VAR technology. It is reported that the umpires can detect even the lightest touches by the players with the sensor on the ball. Now it is confirmed by this sensor. A snicko meter determines whether the ball has hit the bat in cricket. That’s how this sensor works. When Bruno touched the ball it was clearly visible on the sensor. But the ball is neutral when it crosses Ronaldo. Adidas said it was Bruno’s goal. Adidas has announced that its technology [thanks to the sensor in the ball] has shown that Cristiano Ronaldo did not touch the ball on the Portugal goal. (Source: @TheAthleticFC ) pic.twitter.com/OHnMNPKS1F","pubDate":"2022-11-29 15:35:13","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs NZ 3rd ODI Dream11 prediction: Fantasy cricket tips for India vs New Zealand 3rd ODI match in Christchurch","link":"https://www.dnaindia.com/cricket/report-ind-vs-nz-3rd-odi-dream11-prediction-fantasy-cricket-tips-for-india-vs-new-zealand-christchurch-amazon-prime-3006634","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"IND vs NZ 3rd ODI ODI Dream 11 Team - Check My Dream11 Team, Best Player's list for India vs New Zealand 3rd ODI in Christchurch.","content":"Team India and New Zealand are set to lock horns for the last time in 2022 with the final ODI of the three-match series set to take place at Hagley Oval. For Shikhar Dhawan's men, it's a chance to level the series after the second ODI was washed out. They are currently trailing the series, and only a win will see the series drawn. There was a lot of talk surrounding the exclusion of Sanju Samson in the second ODI, he played well in the third ODI, but was still left out with Deepak Hooda being favoured in his place. Dhawan revealed that he made the change in need of a sixth bowling option. India failed to defend a 307-run target in the first ODI and thus needed more bite in their bowling attack. Shardul Thakur paved the way for Deepak Chahar, so it remains to be seen how the Indian team will line up for the must-win game. READ| 'Crowd is putting Sanju against BCCI and belittling Rishabh Pant': Samson's childhood coach makes shocking claim Dream11 Prediction – IND vs NZ 3rd ODI Keeper – Devon Conway (c), Tom Latham Batsmen – Kane Williamson, Shubman Gill (vc), Shikhar Dhawan, Suryakumar Yadav All-rounders – Washington Sundar, Mitchell Santner Bowlers – Arshdeep Singh, Umran Malik, Tim Southee India vs New Zealand 3rd ODI Probable Playing XIs India: Shikhar Dhawan, Shubman Gill, Shreyas Iyer, Suryakumar Yadav, Rishabh Pant, Sanju Samson, Shardul Thakur, Washington Sundar, Yuzvendra Chahal, Arshdeep Singh, Umran Malik New Zealand: Tom Latham, Finn Allen, Kane Williamson, Devon Conway, Daryl Mitchell, Glenn Phillips, Adam Milne, Mitchell Santner, Matt Henry, Tim Southee, Lockie Ferguson READ| Gautam Gambhir picks Hardik Pandya and Prithvi Shaw as the future T20I skipper of Indian cricket team IND vs NZ 3rd ODI My Dream11 team Devon Conway (c), Tom Latham, Kane Williamson, Shubman Gill (vc), Shikhar Dhawan, Suryakumar Yadav, Washington Sundar, Mitchell Santner, Arshdeep Singh, Umran Malik, Tim Southee India vs New Zealand 3rd ODI Match Details India vs New Zealand 3rd ODI is scheduled to start at 07:00 AM IST on Wednesday, November 30 at Christchurch. The live telecast will be available on the DD Sports channel. The live streaming will be available on the Amazon Prime app and website. Squads: India: Shikhar Dhawan(c), Shubman Gill, Shreyas Iyer, Rishabh Pant(w), Suryakumar Yadav, Sanju Samson, Washington Sundar, Shardul Thakur, Umran Malik, Arshdeep Singh, Yuzvendra Chahal, Deepak Hooda, Kuldeep Yadav, Deepak Chahar READ| LIVE| Ecuador vs Senegal, Netherlands vs Qatar FIFA World Cup 2022 Group A football match score: Check playing XIs New Zealand: Finn Allen, Devon Conway, Kane Williamson(c), Daryl Mitchell, Tom Latham(w), Glenn Phillips, Mitchell Santner, Adam Milne, Matt Henry, Tim Southee, Lockie Ferguson, Michael Bracewell, James Neesham","pubDate":"2022-11-29 15:12:14","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup LIVE Scores: Netherlands face Qatar, Ecuador clash against Senegal to confirm knockout stage position","link":"https://www.firstpost.com/sports/fifa-world-cup-2022-live-score-ecuador-vs-senegal-netherlands-vs-qatar-group-a-football-latest-updates-11720441.html","keywords":["Sports"],"creator":["Bansal Shah"],"video_url":null,"description":"FIFA World Cup LIVE Scores: Netherlands face Qatar, Ecuador clash against Senegal to confirm knockout stage position","content":"19:53 (IST)FIFA World Cup Live Group A Live Scores:Hello and welcome to our live coverage of the FIFA World Cup day 10 as Group A will play their last league stage games and the two slots in the Round of 16 will be confirmed. Two interesting matches are awaited to start -Netherlands vs Qatar at the Al Bayt StadiumEcuador vs Senegal at the Khalifa International StadiumGroup B competition will come to an end on Tuesday evening with two simultaneous games kicking off at 8:30 PM IST, as the Netherlands face host Qatar and Ecuador clash with Senegal to confirm a place in the last 16.The Netherlands will start their match against Qatar as the favourites, and are expected to make a smooth move to the knockout stage, whereas the other match involving Ecuador and Senegal is expected to raise tensions with a clash of two equal sides.Ecuador sit a point ahead of Senegal on the points table, having drawn their game against the Netherlands, but will have to win the match or end it in a draw to advance to the next round. Senegal have no option but to beat Ecuador to stay alive in the competition.An exciting prospect awaits as Ecuador will top the group if they finish with a better goal difference than the Netherlands. If this happens, the Netherlands are expected to face England in the Round of 16, eliminating one of the high-profile teams quite prematurely.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-29 14:23:48","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Netherlands-Ecuador-Senegal-Qatar.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI serves conflict of interest notice to its president Roger Binny","link":"https://economictimes.indiatimes.com/news/sports/bcci-serves-conflict-of-interest-notice-to-its-president-roger-binny/articleshow/95860779.cms","keywords":null,"creator":null,"video_url":null,"description":"The complainant, Sanjeev Gupta, has alleged that Binny is conflicted as his daughter-in-law works for Star Sports which has home season media rights for Indian cricket. \"You are hereby informed that a complaint has been received under Rule 39(2)(b) of the Rules and Regulations of BCCI by the Ethics Officer, BCCI for breach of Rule 38 (1) (i) and Rule 38(2) of the said rules, constituting an instance of \"conflict of interest\" on your part.","content":"Synopsis The complainant, Sanjeev Gupta, has alleged that Binny is conflicted as his daughter-in-law works for Star Sports which has home season media rights for Indian cricket. \"You are hereby informed that a complaint has been received under Rule 39(2)(b) of the Rules and Regulations of BCCI by the Ethics Officer, BCCI for breach of Rule 38 (1) (i) and Rule 38(2) of the said rules, constituting an instance of \"conflict of interest\" on your part. AP Newly elected BCCI president Roger Binny. (AP Photo) BCCI ethics officer Vineet Saran has served a conflict of interest notice to board president Roger Binny . PTI has learnt that Saran has asked Binny to file a written response by December 20 against the conflict of interest allegations levelled against him. The complainant, Sanjeev Gupta , has alleged that Binny is conflicted as his daughter-in-law works for Star Sports which has home season media rights for Indian cricket. \"You are hereby informed that a complaint has been received under Rule 39(2)(b) of the Rules and Regulations of BCCI by the Ethics Officer, BCCI for breach of Rule 38 (1) (i) and Rule 38(2) of the said rules, constituting an instance of \"conflict of interest\" on your part. \"You are directed to file your Written Response to the accompanying complaint on or before 20/12/2022. The said response should be supported by a duly executed affidavit,\" wrote Saran in the notice dated November 21. World Cup winner Binny had become the 36th BCCI president in October, replacing former India captain Sourav Ganguly . The 67-year-old played 27 Tests and T20 ODIs for India. Tuesday, 29 Nov, 2022 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies Disruption More Sumitomo Mitsui, 4 Others Sought Info on IDBI Sale Sumitomo Mitsui Financial Group and one other global bank are among five potential investors that have sought information from the Centre about the sale of state equity in IDBI Bank through a formal query process that closed on November 10, people familiar with the matter told ET. Flipkart may go in for $700m Esop Buyback Walmart-owned homegrown ecommerce marketplace Flipkart is likely to facilitate a $700 million employee stock buyback as part of digital payments platform PhonePe’s new financing round, multiple sources briefed on the matter told ET. Falling Input Costs may Cool Prices of Essentials, Apparel Prices of groceries, daily essentials and apparel are likely to fall over the next two quarters as input costs are expected to decline, spurring sales in the process, according to consumer goods makers. Read More News on Roger Binny saran binny star sports sourav ganguly vineet saran sanjeev gupta world cup (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Policy and regulations Away from the noise, GM mustard is an idea whose time has come 8 mins read Four insights to kick-start your day: featuring Cipla-Medley’s deal 4 mins read Strategy Stock Radar: ACC records a fresh breakout above symmetrical triangle; likely to hit fresh 52-week high soon 3 mins read Subscribe to ETPrime","pubDate":"2022-11-29 14:05:40","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-51736,resizemode-4,msid-95860779/bcci-serves-conflict-of-interest-notice-to-its-president-roger-binny.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"'Brother, my English is finished now': Naseem Shah's hilarious response in press conference","link":"https://www.firstpost.com/firstcricket/sports-news/brother-my-english-is-finished-now-naseem-shahs-hilarious-response-in-press-conference-11719861.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"'Brother, my English is finished now': Naseem Shah's hilarious response in press conference","content":"Pakistan pacer Naseem Shah is carrying the legacy of fast bowling that his country is known for. The 19-year-old is looking forward to playing the historic Test series against England on home soil. The Three Lions have travelled to Pakistan after 17 years for red-ball cricket. Ahead of the first game of the three-match series, Shah discussed the upcoming fixture during a press conference. He seemed quite excited to perform in front of veteran pacer James Anderson and termed the English bowler “a legend.”While being asked about the reason behind Anderson’s long cricketing career, Shah showered immense praise on his dedication towards the game. The 40-year-old quick is going to appear in his 176th Test in Rawalpindi on 1 December. According to the youngster, it was only “hard work” that helped him come a long way.Shah explained, “Being a fast bowler, I know how difficult it is, so it is a massive achievement. He is a legend, and we can gain a lot from him. Whenever we meet, we talk about this. You can only guess how much effort he is putting in since he is still playing at the age of 40.”The reporter further probed the topic by asking Shah’s view on the “pace vs skill” debate stating that Anderson still has the skills, even though his speed has decreased. Cutting short the question, the cricketer came up with a hilarious reply, “Brother, I only have 30 percent English. My English is done now.”Never a dull moment with Naseem Shah ♥️ #PAKvENG pic.twitter.com/yhdKl8T2km— Farid Khan (@_FaridKhan) November 29, 2022However, he turned back to the topic and noted that Anderson’s long career has helped him gain a great understanding of the game. “I told you, he’s the legend. He knows everything. He knows how to take wickets because he has played cricket everywhere in the world. That’s why he’s one of the best bowlers in the world,” the Pakistan prodigy further added.At this age, Naseem Shah has already featured in 13 Tests and has fetched a total of 33 scalps. He earned his maiden Test call-up back in 2019 in Australia despite featuring in just five first-class games. His exceptional display of pace and swing during the T20 World Cup in Australia earned him much popularity. However, he only managed to pick up three wickets in Pakistan’s run till the final.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-29 13:45:32","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Naseem-Shah3.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Aussie ‘soccer’ explained to world media","link":"https://www.couriermail.com.au/sport/football/world-cup/graham-arnold-explains-aussie-footballs-place-before-world-cup-game/news-story/834fd0e8aa496ecdf0fdc2ff9db72322","keywords":["Football","Sport news and galleries","World Cup"],"creator":null,"video_url":null,"description":"Socceroos coach Graham Arnold has explained where football sits in Australia’s pecking order before the do-or-die World Cup match against Denmark.","content":"The Socceroos need a draw against Denmark to advance to the final 16 team for the first time since 2006, unless Tunisia pulls off an upset against world champions France.Arnold said the scenes back in Australia after the 1-0 win against Tunisia proves that football is “alive and well” in Australia.“Something that’s been proven right, is that there’s one sporting team that unites Australia and it’s the Socceroos,” he said before the Denmark match.“It just shows you that football is alive and well in Australia.”But Arnold is realistic about where football is in Australia compared to other football codes and cricket.When asked by a British reporter if advancing from the group could mean young Australians wanted to be the next Mitchell Duke or Mathew Leckie rather than Shane Warne or Brad Fittler, he had a simple response.“That’s the whole purpose,” he said. “My goal is to put a smile on the faces of Australians.“If you’re not Australian and you don’t know, football in Australia is probably the fourth or fifth main sport.“After AFL, rugby league, rugby union, cricket - then it’s football, they call it soccer. To leave a legacy is huge.“In 2006 and what that generation did, I was very fortunate, I was there as assistant coach with Guus Hiddink and experienced that as well.“This generation (of players) was 10 years of age watching these guys do what they did in 2006. Those guys were the inspiration“This generation is talking about emulating the 2006 squad and achieving the same goals they saw as 10 year olds.“It’s about putting football a bit more on the map in Australia, (but) there’s so much more work to do - it’s crazy.”In 2006, a Socceroos squad dripping in talent progressed to the second round in Australia’s first World Cup in 32 years.Then that tournament Australia had only won one game at three World Cups before the breakthrough against Tunisia.But Arnold said his team wanted to do more than the 2006 squad, which included the likes of Harry Kewell, Mark Viduka, Tim Cahill and Mark Schwarzer.“In 06 we got one win (against Japan) and one draw (against Croatia) - our ambition is to get two wins and have the most wins at a World Cup,” he said.Socceroos winger Leckie talked about growing up in an AFL environment, and how the World Cup could change football’s fortune.“It could be one of those things that clicks in their head, and says I want to be a footballer rather than an AFL player,” he said.“When I was younger in an AFL environment, one thing that did bring my family to follow football was the national team and the World Cup.”","pubDate":"2022-11-29 13:30:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"ILT20: Dubai Capitals vs Abu Dhabi Knight Riders fixture to kick off inaugural edition on 13 January","link":"https://www.firstpost.com/firstcricket/sports-news/ilt20-dubai-capitals-vs-abu-dhabi-knight-riders-fixture-to-kick-off-inaugural-edition-on-13-january-11719831.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"ILT20: Dubai Capitals vs Abu Dhabi Knight Riders fixture to kick off inaugural edition on 13 January","content":"The first season of UAE’s International League T20 will commence with a clash between Dubai Capitals and Abu Dhabi Knight Riders on 13 January 2023 – Friday.The organisers released a schedule of the tournament based on which, the tournament will start on 13 January and continue till 12 February.Reliance Group’s MI Emirates and Capri Global’s Sharjah Warriors will face off on the next day at Zayed Cricket Stadium in Abu Dhabi, which is expected to be a mouthwatering clash. The same teams will clash with each other again on 17 January at the history-rich Sharjah Cricket Stadium.A total of eight matches will be played in Sharjah, whereas Abu Dhabi will host 10 games, and Dubai will host 16 games.THE WAIT IS OVERExplosive new sporting battles begin from 13th Jan. Mark your calendars 🗓️The schedule for #ILT20 is here 👇🏻 #ALeagueApart pic.twitter.com/biUyKkmiyd— International League T20 (@ILT20Official) November 29, 2022 Speaking about the ILT20 schedule, Mubashshir Usmani, General Secretary of the Emirates Cricket Board said, “This is a very exciting time for the league and, collectively, we are delighted to announce the 2023 ILT20 playing schedule.“To have superstars such as Dubai Capital’s Dasun Shanaka and Abu Dhabi Knight Rider’s Andre Russell open their teams’ accounts is very exciting. We cannot wait for the teams to arrive (in early January) and battle it out on the park and provide world-class entertainment to the cricket fans here, in the UAE, and around the globe.“It is very important for us to launch the first season in an emphatic style, and the league management is very excited to have engaged with globally recognised artists in Badshah and Jason Derulo, both of whom will undoubtedly energise the teams, and the fans leading into the opening match. We are confident that the ILT20 will be a huge success.”A total of six franchises comprising 84 international players and 24 UAE-based players will participate in the tournament.Cricket fans across the world can catch the LIVE telecast of this exciting cricket league on ZEE’s linear channels, digital platform, Zee5 as well as Zee Cinema SD, Zee Cinema HD, Zee Anmol Cinema, &Pictures HD, &Flix SD, &Flix HD, Zee Zest SD, Zee Zest HD, Zee Bangla Cinema and Zee Thirai.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-29 13:10:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/ILT20-UAE.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Desperate India hopes for full game in final ODI against New Zealand","link":"https://sportstar.thehindu.com/cricket/india-vs-new-zealand-final-odi-weather-full-game-shikhar-dhawan/article66200355.ece","keywords":null,"creator":["\n         PTI  \n    "],"video_url":null,"description":"There is forecast of scattered showers in Christchurch and nothing can be more irritating than playing a series where the Gen-Next of Indian cricket hardly got any game time to show their prowess.","content":null,"pubDate":"2022-11-29 13:03:02","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Cooch Behar Trophy: Hyderabad take three points after draw against Pondicherry","link":"https://telanganatoday.com/cooch-behar-trophy-hyderabad-take-three-points-after-draw-against-pondicherry","keywords":["News","Sport","Cooch Behar Trophy","Hyderabad","Pondicherry","Rajiv Gandhi International Cricket Stadium"],"creator":["Telangana Today"],"video_url":null,"description":"Hosts Hyderabad took three points by virtue of the first innings lead as they ended their four-day BCCI Men’s under-19 Cooch Behar","content":"Home | News | Cooch Behar Trophy Hyderabad Take Three Points After Draw Against Pondicherry Cooch Behar Trophy: Hyderabad take three points after draw against Pondicherry Hosts Hyderabad took three points by virtue of the first innings lead as they ended their four-day BCCI Men’s under-19 Cooch Behar By Telangana Today Published Date - 06:27 PM, Tue - 29 November 22 Hyderabad: Hosts Hyderabad took three points by virtue of the first innings lead as they ended their four-day BCCI Men’s under-19 Cooch Behar match against Pondicherry in a draw, at the Rajiv Gandhi International Cricket Stadium at Uppal, Hyderabad on Tuesday. Resuming at the overnight score of 313/8, visitors Pondicherry were bowled out for 344 runs. Hyderabad, in pursuit of 246 runs for victory on the final day, ended the day at 188/6 in 79 overs. Also Read Cooch Behar Trophy: Hyderabad restricts Pondicherry to 313/8 on Day 3 Murugan Abhishek top-scored with a 62-run knock. Earlier, Hyderabad dismissed Pondicherry for 162 in their first innings and scored 260 in their first innings. Brief Scores: Pondicherry CA U19 162 & 344 in 113.1 overs (Aarya Udupa 3/59, N NItin Sai Yadav 5/ 69) drew with Hyderabad CA U19 260 & 188/6 in 79 overs (Murugan Abhishek 62; K G Shree Varshan 3/47, Sai Hari Ram 2/48). Follow Us : Tags Cooch Behar Trophy Hyderabad Pondicherry Rajiv Gandhi International Cricket Stadium Related News Pratishta Mahotsav of five Jain Lords held in Hyderabad Hyderabad to have 31 STPs for 100 percent sewage treatment by next year: KTR SCR, Postal Department chalk out end-to-end parcel services 18 SNDP works taken up to revamp storm-water drains in Hyderabad Malla Reddy’s kin appear before I-T officials Skating for a change: Meet Vidya Golla from Hyderabad showing way for other women to take up action sport","pubDate":"2022-11-29 12:57:11","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Ramiz Raja fielded at slips 'because his father was a commissioner': Wasim Akram","link":"https://www.firstpost.com/firstcricket/sports-news/ramiz-raja-fielded-at-slips-because-his-father-was-a-commissioner-wasim-akram-11718661.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Ramiz Raja fielded at slips 'because his father was a commissioner': Wasim Akram","content":"Former Pakistan skipper Wasim Akram has often been in the news, be it for dismantling the opposition with his fiery deliveries or for his views on the current Men in Green. Now, the speedster has once again made headlines, this time for the startling revelations in his autobiography Sultan: A Memoir.The left-arm pacer’s book, which was released earlier this month, includes some explosive claims about Akram’s former teammate and current Pakistan Cricket Board chairman Ramiz Raja. According to Akram, Ramiz Raja fielded in the slips only due to the “rank” system. The Sultan of Swing, as Akram is fondly called, also lambasted his teammate’s fielding skills.Ramiz Raja and Wasim Akram were part of Imran Khan’s 1992 World Cup-winning unit and played together for over a decade.Describing his fielding skills in a Test against New Zealand, Akram wrote, “The first over the next day was delivered by Asif Faridi, a local quick; I was thrown the new ball for the second. I was in my fourth over when John Wright, New Zealand’s captain, nicked to Ramiz at second slip. For all his batting kill, Ramiz was at slip for reasons of rank, because his father was a commissioner and because he’d attended Aitchison College – he dropped more than he caught, frankly.”This is not the only shocking disclosure made by Akram in his. In his autobiography, the left-arm pacer had also slammed the attitude of former Pakistan captain Saleem Malik during their careers. Akram revealed that Malik used to treat him “like a servant” and made him clean his boots and clothes.“He would take advantage of my junior status. He was negative, selfish and treated me like a servant. He demanded I massage him, he ordered me to clean his clothes and boots,” Akram alleged about Saleem Malik.Malik has responded to the claims and added that he was trying to contact Akram to find out why he had written such negative things about him. “If I was narrow minded, I would not have given him the chance to bowl. I will ask him why he wrote such remarks about me,” Malik stated.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-29 12:48:29","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/WasimAkram1.jpeg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand 3rd ODI weather update: Rain likely to play spoilsport again at Hagley Oval in Christchurch","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-3rd-odi-weather-update-rain-likely-to-play-spoilsport-again-at-hagley-oval-in-christchurch-11718821.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand 3rd ODI weather update: Rain likely to play spoilsport again at Hagley Oval in Christchurch","content":"Team India would aim to finish the ODI series against New Zealand on an even keel when both teams lock horns in the third and final ODI of the series on Wednesday in Christchurch. However, the rain gods are showing no respite to fans as after the second ODI got abandoned in Hamilton, there is a very high chance that the final match of the series will also face the same fate.Notably, out of five white-ball games that also include three-match T20I series, two matches (one T20I and one ODI) didn’t yield any result and one game (T20I) was curtailed significantly and ended in a tie due to Duckworth-Lewis method.Once again, there’s bad news for cricket fans as the third ODI is expected to be marred by rain. As per AccuWeather, there is an 88 percent possibility of precipitation and a 16 percent possibility of thunderstorms on Wednesday.As per New Zealand’s MetService, Christchurch weather will be gloomy on Wednesday. There are high chances of showers in the later part of the day and the temperature is expected to drop to below 10 degrees Celsius.“High cloud, then showers developing from afternoon, possibly heavy. Westerlies turning fresh southerly in the afternoon, strong about Banks Peninsula,” the MET department predicted for Wednesday.It is worth noting that a minimum of 20 over will need to be completed between the two sides for it to officially constitute an ODI match.Earlier, India’s young pace sensation Arshdeep Singh said that the teams cannot control the weather.“The weather is not in our hands, weather is something we cannot control. So it is important that we give our best whenever we get a chance. If there is a break in the game due to rain, we have to always be mentally and physically prepared for the match to start anytime. It is our endeavour that the process is followed properly and there is no shortage of preparation. And the plans that are made should be executed in the match,” Arshdeep Singh said in a pre-match press conference. Squads:India: Shikhar Dhawan (c), Shubman Gill, Deepak Hooda, Suryakumar Yadav, Shreyas Iyer, Rishabh Pant (vc and wk), Sanju Samson (wk), Washington Sundar, Shardul Thakur, Yuzvendra Chahal, Kuldeep Yadav, Arshdeep Singh, Deepak Chahar, Umran Malik.New Zealand: Kane Williamson (c), Finn Allen, Michael Bracewell, Devon Conway (wk), Lockie Ferguson, Matt Henry, Tom Latham (wk), Daryl Mitchell, Adam Milne, Jimmy Neesham, Glenn Phillips, Mitchell Santner, Tim Southee, Henry Nicholls.","pubDate":"2022-11-29 12:15:23","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/India-vs-New-Zealand-4.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI Sets The Bar: Base Price For Women’s IPL Franchise Will be Rs 400 Crore","link":"https://www.firstpost.com/firstcricket/sports-news/bcci-sets-the-bar-base-price-for-womens-ipl-franchise-will-be-rs-400-crore-11718961.html","keywords":["First Cricket News"],"creator":["K Shrinwas Rao"],"video_url":null,"description":"BCCI Sets The Bar: Base Price For Women’s IPL Franchise Will be Rs 400 Crore","content":"Cricket BCCI Sets The Bar: Base Price For Women’s IPL Franchise Will be Rs 400 Crore The BCCI has asked the existing men’s IPL team owners to participate in the bidding but the tender process is open to any and all investors who meet the cricket board’s minimum eligibility criteria. K Shrinwas Rao November 29th, 2022 17:30:21 IST The BCCI will sell the women’s IPL franchises and the broadcast rights by way of a closed bid. BCCI The BCCI, looking to auction five franchises for the upcoming women’s T20 league starting March 2023 by way of a closed tender, has kept the base price at Rs 400 crore (USD 50m approx.). The cricket board has arrived at this decision by taking into account the value of the costliest franchise that was sold back in 2007-08 – Mumbai Indians at USD 111.9m (approx. Rs 446 cr) at Rs 40 / dollar. “The benchmark had to be set somewhere and the BCCI had been gathering a bit of market intelligence on this, keeping in mind the demand and market interest,” those in the know of developments say. The Board expects the franchise to be sold between Rs 1000 and Rs 1500 crore, or even more, depending on the kind of interest the auction generates once the tender document is out. However, nobody is ready yet to speak about these expectations on record. “The winning franchise will pay the ownership fees to the BCCI over a period of five years in equal instalments and continue to own the property for perpetuity, like in the men’s IPL,” add those in the know. If the value of the US dollar from 15 years ago is taken into consideration, the current base price (Rs 400 cr) set by the cricket board is slightly lesser than the value at which the costliest franchise (Mumbai Indians) was sold in the Indian Premier League (IPL) back in 2007-08 (Rs 446 cr / US$111.9m). BCCI could be looking to raise anywhere between Rs 6,000 and Rs 8000 crore. BCCI In doing so, the BCCI could be looking to raise anywhere between Rs 6,000 and Rs 8000 crore (in the range of a billion dollars) from the sale of these five franchises. Cricket board could be missing a few tricks The BCCI has asked the existing men’s IPL team owners to participate in the bidding but the tender process is open to any and all investors who meet the cricket board’s minimum eligibility criteria. There is no guarantee whatsoever that should the bid of an existing IPL franchise owner and a new investor match, any preference shall be given to the existing franchise owner. In doing this, the BCCI could be missing out on a few tricks. Here’s what some industry executives have to say on the matter: If men’s IPL franchise owners are allowed to bid for women’s franchises too, profits from men’s IPL can be reinvested in the women’s game. For a newcomer, this will clearly be a loss-making enterprise for a while. So, will it be sustainable in the longer run? By not giving men’s IPL franchise owners a preference, the BCCI is potentially losing an opportunity on the learnings that existing team owners have had over the course of time, IPs, operational synergies, the traction that can be generated from existing businesses that can be beneficial to women’s cricket and more. Long-term running of a franchise, ensuring good infrastructure, building of a brand, etc, can be done in a far smoother manner if existing franchises are involved. Further, as a reference point, BCCI can take into consideration that the English Premier League’s women’s leg – the Women’s Super League – has all 12 EPL club owners. In women’s NBA in the US, the existing clubs were given first rights of refusal in their region and when the women’s teams were handed out, four NBA clubs took the rights reserved while four other teams were bought by individuals owning clubs in the NFL. “The BCCI should have a very strict and specific technical bid in this case. If an existing franchise owner and a new investor were to put in the same financial bid, the technical bid should allow the bidder with more experience in this space to prevail. It will be good for the women’s league on the longer run,” industry voices say. For the record, the BCCI will sell the women’s IPL franchises and the broadcast rights by way of a closed bid and not an e-auction. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 29, 2022 17:30:21 IST Tags: Bcci Indian Premier League Women's Ipl Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-29 12:00:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Womens-IPL-Base-price.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's IPL: वीमेंस आईपीएल की पांच टीमें के लिए बीसीसीआई जल्द जारी करेगा टेंडर, जानें पूरी प्रक्रिया","link":"https://www.abplive.com/sports/cricket/bcci-will-soon-issue-tender-for-five-teams-of-women-s-ipl-here-know-the-latest-news-2270241","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Women's IPL, BCCI: क्रिकेट फैंस के लिए अच्छी खबर है. दरअसल, वीमेंस आईपीएल का पहला संस्करण मार्च 2023 में खेला जाएगा. इसके लिए बीसीसीआई जल्द ही 5 आईपीएल टीमों के लिए टेंडर जारी करने वाला है. वहीं, सभी टीमों की बेस प्राइस 400 करोड़ रूपए होगी. बीसीसीआई जल्द ई-ऑक्शन के लिए टेंडर जारी करेगा. आईपीएल की मौजूदा टीमें भी इसमें हिस्सा ले सकती हैं. दरअसल, बीसीसीआई की मीटिंग में 18 अक्टूबर के दिन यह फैसला लिया गया, यह बीसीसीआई की 91वीं मीटिंग थी. ऐसा होगा वीमेंस आईपीएल का फॉर्मेट पिछले दिनों बीसीसीआई ने कहा था कि वीमेंस आईपीएल का आयोजन साल 2023 से किया जाएगा. मेंस आईपीएल की तर्ज पर यह टूर्नामेंट भी 20-20 ओवर का होगा. इस टूर्नामेंट की सभी टीमें एक-दूसरे से 2-2 बार भिडे़ंगी. टेबल टॉपर्स को फाइनल के लिए सीधी प्रवेश मिलेगी. जबकि एलिमिनेटर में दूसरे और तीसरे स्थान पर रहने वाली टीमों के बीच मुकाबला होगा. त्येक टीम के प्लेइंग इलेवन में पांच से अधिक विदेशी क्रिकेटर नहीं हो सकते हैं. सभी टीमों में अधिकतम 18 खिलाड़ी होंगे बीसीसीआई के मुताबिक, घरेलू और अंतरराष्ट्रीय खिलाड़ियों के साथ अच्छी टीम बनाने के लिए पहले पांच टीमें इस टूर्नामेंट में खेलेंगी. प्रत्येक टीम में अधिकतम अठारह खिलाड़ी शामिल हो सकते हैं. इन 18 खिलाड़ियों में छह से अधिक विदेशी खिलाड़ी नहीं होंगे. गौरतलब है कि ऑस्ट्रेलिया में महिला बिग बैश लीग का आयोजन साल 2016 से हो रहा है. इसके अलावा पिछले साल इंग्लैंड में वीमेंस द हंड्रेड खेला गया था. पाकिस्तान क्रिकेट बोर्ड ने भी अगले साल से वीमेंस लीग आयोजन करने का फैसला किया है. ये भी पढ़ें- Arshdeep Singh ने ट्रोल होने पर तोड़ी चुप्पी, ये बात कहकर फिर से जीत लिया है दिल ICC Cricket WC 2023: पूर्व भारतीय क्रिकेटर का बयान, कहा- नए प्रयोगों और बदलावों के लिए वक्त नहीं रह गया है...","content":"Women's IPL, BCCI: क्रिकेट फैंस के लिए अच्छी खबर है. दरअसल, वीमेंस आईपीएल का पहला संस्करण मार्च 2023 में खेला जाएगा. इसके लिए बीसीसीआई जल्द ही 5 आईपीएल टीमों के लिए टेंडर जारी करने वाला है. वहीं, सभी टीमों की बेस प्राइस 400 करोड़ रूपए होगी. बीसीसीआई जल्द ई-ऑक्शन के लिए टेंडर जारी करेगा. आईपीएल की मौजूदा टीमें भी इसमें हिस्सा ले सकती हैं. दरअसल, बीसीसीआई की मीटिंग में 18 अक्टूबर के दिन यह फैसला लिया गया, यह बीसीसीआई की 91वीं मीटिंग थी. ऐसा होगा वीमेंस आईपीएल का फॉर्मेट पिछले दिनों बीसीसीआई ने कहा था कि वीमेंस आईपीएल का आयोजन साल 2023 से किया जाएगा. मेंस आईपीएल की तर्ज पर यह टूर्नामेंट भी 20-20 ओवर का होगा. इस टूर्नामेंट की सभी टीमें एक-दूसरे से 2-2 बार भिडे़ंगी. टेबल टॉपर्स को फाइनल के लिए सीधी प्रवेश मिलेगी. जबकि एलिमिनेटर में दूसरे और तीसरे स्थान पर रहने वाली टीमों के बीच मुकाबला होगा. त्येक टीम के प्लेइंग इलेवन में पांच से अधिक विदेशी क्रिकेटर नहीं हो सकते हैं. सभी टीमों में अधिकतम 18 खिलाड़ी होंगे googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels बीसीसीआई के मुताबिक, घरेलू और अंतरराष्ट्रीय खिलाड़ियों के साथ अच्छी टीम बनाने के लिए पहले पांच टीमें इस टूर्नामेंट में खेलेंगी. प्रत्येक टीम में अधिकतम अठारह खिलाड़ी शामिल हो सकते हैं. इन 18 खिलाड़ियों में छह से अधिक विदेशी खिलाड़ी नहीं होंगे. गौरतलब है कि ऑस्ट्रेलिया में महिला बिग बैश लीग का आयोजन साल 2016 से हो रहा है. इसके अलावा पिछले साल इंग्लैंड में वीमेंस द हंड्रेड खेला गया था. पाकिस्तान क्रिकेट बोर्ड ने भी अगले साल से वीमेंस लीग आयोजन करने का फैसला किया है. ये भी पढ़ें- Arshdeep Singh ने ट्रोल होने पर तोड़ी चुप्पी, ये बात कहकर फिर से जीत लिया है दिल ICC Cricket WC 2023: पूर्व भारतीय क्रिकेटर का बयान, कहा- नए प्रयोगों और बदलावों के लिए वक्त नहीं रह गया है... var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-11-29 11:16:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/29/ffa0c642eab02a59b77f3654b56b69c71669720347552428_original.webp","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"पंत बनाम सैमसन मामले पर कोच बिजू जॉर्ज बोले- मल्लू की भीड़ संजू को बीसीसीआई के खिलाफ खड़ा कर रही है","link":"https://www.abplive.com/sports/cricket/coach-biju-george-on-rishabh-pant-vs-sanju-samson-said-mallu-crowd-is-putting-him-against-bcci-2270228","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Biju George on Sanju Samson: भारतीय क्रिकेट टीम के विकेटकीपर बल्लेबाज संजू सैमसन की तगड़ी फैन फॉलोइंग है. उनके चाहने वाले दुनियाभर में फैले हुए हैं. हाल ही में उनके कुछ फैंस को कतर में खेले जाए रहे फीफा वर्ल्ड कप के मैच में देखा गया. संजू जब टीम इंडिया से बाहर होते हैं तो उनके फैंस नाराजगी जाहिर करते हैं. यह भारत और न्यूजीलैंड के बीच खेली जा रही क्रिकेट सीरीज के दौरान देखने को मिला है. संजू को न्यूजीलैंड के खिलाफ पहले वनडे में मौका मिला जबकि दूसरे मैच में उन्हें बाहर कर दिया गया. जिसके बाद संजू के फैंस ने बीसीसीआई को लेकर कड़ी आलोचना की. फैंस अक्सर इस बात पर बहस करते हैं कि ऋषभ पंत और संजू सैमसन में से बेहतर विकेटकीपर कौन है. वहीं, अब इस मामले पर संजू के बचपन के कोच बिजू जॉर्ज ने बयान दिया है.  पंत की विकेटकीपिंग स्किल बेहतर क्रिकेटनेक्स्ट से बात करते हुए संजू सैमसन के बचपन के कोच बिजू जॉर्ज ने कहा, सोशल मीडिया पर ये क्या चल रहा है लोग बिना कारण ही ऋषभ पंत के खिलाफ हो रहे हैं. पंत टीम में इसलिए हैं कि उन्होंने लंबे समय से शानदार प्रदर्शन किया है. देखिए, ऋषभ पंत और संजू सैमसन के बीच कोई क्लेश नहीं है. सैमसन खेल रहे हैं वह एक विशुद्ध बल्लेबाज के तौर पर भारत के लिए खेल सकते हैं. पंत ने बीते कुछ समय से विकेट के पीछे कोई बड़ी गलती नहीं की है. पंत की विकेटकीपिंग स्किल बहुत अच्छी है. वह काफी समय से भारत के लिए रेड और व्हाइट बॉल क्रिकेट में बढ़िया प्रदर्शन कर रहे हैं.  भीड़ संजू को BCCI के खिलाफ खड़ा कर रही कोच बिजू जॉर्ज ने आगे कहा, मुझे यह पसंद नहीं है कि मल्लू की भीड़ संजू सैमसन को बीसीसीआई के खिलाफ खड़ा कर रही है और ऋषभ पंत को नीचा दिखा रही है. यह बहुत गलत बात है. केरल के राजनेताओं को लगता है कि क्रिकेट राजनीति का एक और खेल है. वह कहते हैं कि संजू को शिकार बनाया जा रहा है. लेकिन ऐसा बिल्कुल नहीं है. मैं ऐसा नहीं मानता हूं. बस इतनी बात जरूर है कि परिस्थितियां संजू के पक्ष में काम नहीं कर रही हैं. उन्हें जानबूझकर निशाना नहीं बनाया जा रहा है. मुझे नहीं लगता कि भारतीय क्रिकेट में किसी को जानबूझकर निशाना बनाया जाएगा.  यह भी पढ़ें: ICC Cricket WC 2023: पूर्व भारतीय क्रिकेटर का बयान, कहा- नए प्रयोगों और बदलावों के लिए वक्त नहीं रह गया है... किसी खिलाड़ी को रिटायर होने के लिए नहीं कहेगा बीसीसीआई, रोहित-विराट का टी20 इंटरनेशनल से बाहर होना तय","content":"Biju George on Sanju Samson: भारतीय क्रिकेट टीम के विकेटकीपर बल्लेबाज संजू सैमसन की तगड़ी फैन फॉलोइंग है. उनके चाहने वाले दुनियाभर में फैले हुए हैं. हाल ही में उनके कुछ फैंस को कतर में खेले जाए रहे फीफा वर्ल्ड कप के मैच में देखा गया. संजू जब टीम इंडिया से बाहर होते हैं तो उनके फैंस नाराजगी जाहिर करते हैं. यह भारत और न्यूजीलैंड के बीच खेली जा रही क्रिकेट सीरीज के दौरान देखने को मिला है. संजू को न्यूजीलैंड के खिलाफ पहले वनडे में मौका मिला जबकि दूसरे मैच में उन्हें बाहर कर दिया गया. जिसके बाद संजू के फैंस ने बीसीसीआई को लेकर कड़ी आलोचना की. फैंस अक्सर इस बात पर बहस करते हैं कि ऋषभ पंत और संजू सैमसन में से बेहतर विकेटकीपर कौन है. वहीं, अब इस मामले पर संजू के बचपन के कोच बिजू जॉर्ज ने बयान दिया है. पंत की विकेटकीपिंग स्किल बेहतर क्रिकेटनेक्स्ट से बात करते हुए संजू सैमसन के बचपन के कोच बिजू जॉर्ज ने कहा, सोशल मीडिया पर ये क्या चल रहा है लोग बिना कारण ही ऋषभ पंत के खिलाफ हो रहे हैं. पंत टीम में इसलिए हैं कि उन्होंने लंबे समय से शानदार प्रदर्शन किया है. देखिए, ऋषभ पंत और संजू सैमसन के बीच कोई क्लेश नहीं है. सैमसन खेल रहे हैं वह एक विशुद्ध बल्लेबाज के तौर पर भारत के लिए खेल सकते हैं. पंत ने बीते कुछ समय से विकेट के पीछे कोई बड़ी गलती नहीं की है. पंत की विकेटकीपिंग स्किल बहुत अच्छी है. वह काफी समय से भारत के लिए रेड और व्हाइट बॉल क्रिकेट में बढ़िया प्रदर्शन कर रहे हैं. भीड़ संजू को BCCI के खिलाफ खड़ा कर रही googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels कोच बिजू जॉर्ज ने आगे कहा, मुझे यह पसंद नहीं है कि मल्लू की भीड़ संजू सैमसन को बीसीसीआई के खिलाफ खड़ा कर रही है और ऋषभ पंत को नीचा दिखा रही है. यह बहुत गलत बात है. केरल के राजनेताओं को लगता है कि क्रिकेट राजनीति का एक और खेल है. वह कहते हैं कि संजू को शिकार बनाया जा रहा है. लेकिन ऐसा बिल्कुल नहीं है. मैं ऐसा नहीं मानता हूं. बस इतनी बात जरूर है कि परिस्थितियां संजू के पक्ष में काम नहीं कर रही हैं. उन्हें जानबूझकर निशाना नहीं बनाया जा रहा है. मुझे नहीं लगता कि भारतीय क्रिकेट में किसी को जानबूझकर निशाना बनाया जाएगा. यह भी पढ़ें: ICC Cricket WC 2023: पूर्व भारतीय क्रिकेटर का बयान, कहा- नए प्रयोगों और बदलावों के लिए वक्त नहीं रह गया है... किसी खिलाड़ी को रिटायर होने के लिए नहीं कहेगा बीसीसीआई, रोहित-विराट का टी20 इंटरनेशनल से बाहर होना तय var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-11-29 11:04:32","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/29/86176d3b1b3ac073916a6200acbca36f1669719572964366_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"ICC Cricket WC 2023: पूर्व भारतीय क्रिकेटर का बयान, कहा- नए प्रयोगों और बदलावों के लिए वक्त नहीं रह गया है...","link":"https://www.abplive.com/sports/cricket/preparations-start-from-here-no-time-for-experiments-mohammad-kaif-reaction-on-2023-cricket-world-cup-2270183","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Mohammad Kaif On Cricket World Cup 2023: पिछले दिनों भारतीय टीम को टी20 वर्ल्ड कप के सेमीफाइनल मैच में हार का सामना करना पड़ा. टीम इंडिया को इंग्लैंड ने सेमीफाइनल मैच में 10 विकेट से हरा दिया. भारतीय टीम की इस हार के बाद टीम सेलेक्शन पर काफी सवाल उठे. अब अगले साल यानि 2023 में वनडे वर्ल्ड कप का आयोजन होना है. वनडे वर्ल्ड कप 2023 की मेजबानी भारत करेगा. अब पूर्व भारतीय खिलाड़ी मोहम्मद कैफ ने बड़ा बयान दिया है. दरअसल, मोहम्मद कैफ ने कहा कि टीम इंडिया को अगले वर्ल्ड कप की तैयारी शुरू कर देनी चाहिए. अब नए प्रयोगों का वक्त नहीं रह गया है. 'अब नए प्रयोग करने का वक्त नहीं रह गया है' मोहम्मद कैफ ने कहा कि अगर आप किसी खिलाड़ी को आजमा रहे हैं, तो उन्हें लगातार मौके दें. उन्होंने कहा कि वक्त तुंरत निकल जाएगा, कुछ महीने बाद आप पाएंगे कि वर्ल्ड कप सामने खड़ा है. इस वजह से यह अहम है कि आप जिस खिलाड़ी को मैच में मौके दे रहे हैं, उन्हें लगातार मौके दें. अब नए प्रयोग करने का वक्त नहीं रह गया है. साथ ही पूर्व भारतीय खिलाड़ी का मानना है कि टीम इंडिया को वर्ल्ड कप की तैयारी शुरू कर देनी चाहिए. इसके अलावा उन्होंने युवा तेज गेंदबाज उमरान मलिक पर अपनी राय दी. 'वर्ल्ड कप में जसप्रीत बुमराह की कमी खली' मोहम्मद कैफ कहते हैं कि हम लगातार उमरान मलिक की स्पीड पर बात करते हैं, लेकिन टी20 वर्ल्ड कप से पहले जसप्रीत बुमराह चोटिल हो गए. जिसके बाद हमारी टीम में कोई ऐसा गेंदबाज नहीं था, जो जसप्रीत बुमराह की तरह गेंदबाजी कर सकें. मोहम्मद कैफ ने कहा कि भुवनेश्वर कुमार के अलावा मोहम्मद शमी और अर्शदीप सिंह भारतीय टीम के पास तेज गेंदबाजी के विकल्प थे, लेकिन तीनों गेंदबाजों की स्पीड तकरीबन एक जैसी है. साथ ही उन्होंने कहा कि वर्ल्ड कप में हमारी टीम को एक ऐसे गेंदबाज की दरकार थी, जो तकरीबन 145 किलोमीटर प्रतिघंटा स्पीड पर गेंद फेंक सकें. उमरान मलिक इसके लिए बेहतर विकल्प हो सकते थे. ये भी पढ़ें- Ruturaj Gaikwad: बैक बेंचर से लगातार 7 छक्के मारने वाले ऋतुराज गायकवाड़ में कैसे आया इतना बदवाल, पढ़ें दिलचस्प कहानी Arshdeep Singh ने ट्रोल होने पर तोड़ी चुप्पी, ये बात कहकर फिर से जीत लिया है दिल","content":"Mohammad Kaif On Cricket World Cup 2023: पिछले दिनों भारतीय टीम को टी20 वर्ल्ड कप के सेमीफाइनल मैच में हार का सामना करना पड़ा. टीम इंडिया को इंग्लैंड ने सेमीफाइनल मैच में 10 विकेट से हरा दिया. भारतीय टीम की इस हार के बाद टीम सेलेक्शन पर काफी सवाल उठे. अब अगले साल यानि 2023 में वनडे वर्ल्ड कप का आयोजन होना है. वनडे वर्ल्ड कप 2023 की मेजबानी भारत करेगा. अब पूर्व भारतीय खिलाड़ी मोहम्मद कैफ ने बड़ा बयान दिया है. दरअसल, मोहम्मद कैफ ने कहा कि टीम इंडिया को अगले वर्ल्ड कप की तैयारी शुरू कर देनी चाहिए. अब नए प्रयोगों का वक्त नहीं रह गया है. 'अब नए प्रयोग करने का वक्त नहीं रह गया है' मोहम्मद कैफ ने कहा कि अगर आप किसी खिलाड़ी को आजमा रहे हैं, तो उन्हें लगातार मौके दें. उन्होंने कहा कि वक्त तुंरत निकल जाएगा, कुछ महीने बाद आप पाएंगे कि वर्ल्ड कप सामने खड़ा है. इस वजह से यह अहम है कि आप जिस खिलाड़ी को मैच में मौके दे रहे हैं, उन्हें लगातार मौके दें. अब नए प्रयोग करने का वक्त नहीं रह गया है. साथ ही पूर्व भारतीय खिलाड़ी का मानना है कि टीम इंडिया को वर्ल्ड कप की तैयारी शुरू कर देनी चाहिए. इसके अलावा उन्होंने युवा तेज गेंदबाज उमरान मलिक पर अपनी राय दी. 'वर्ल्ड कप में जसप्रीत बुमराह की कमी खली' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels मोहम्मद कैफ कहते हैं कि हम लगातार उमरान मलिक की स्पीड पर बात करते हैं, लेकिन टी20 वर्ल्ड कप से पहले जसप्रीत बुमराह चोटिल हो गए. जिसके बाद हमारी टीम में कोई ऐसा गेंदबाज नहीं था, जो जसप्रीत बुमराह की तरह गेंदबाजी कर सकें. मोहम्मद कैफ ने कहा कि भुवनेश्वर कुमार के अलावा मोहम्मद शमी और अर्शदीप सिंह भारतीय टीम के पास तेज गेंदबाजी के विकल्प थे, लेकिन तीनों गेंदबाजों की स्पीड तकरीबन एक जैसी है. साथ ही उन्होंने कहा कि वर्ल्ड कप में हमारी टीम को एक ऐसे गेंदबाज की दरकार थी, जो तकरीबन 145 किलोमीटर प्रतिघंटा स्पीड पर गेंद फेंक सकें. उमरान मलिक इसके लिए बेहतर विकल्प हो सकते थे. ये भी पढ़ें- Ruturaj Gaikwad: बैक बेंचर से लगातार 7 छक्के मारने वाले ऋतुराज गायकवाड़ में कैसे आया इतना बदवाल, पढ़ें दिलचस्प कहानी Arshdeep Singh ने ट्रोल होने पर तोड़ी चुप्पी, ये बात कहकर फिर से जीत लिया है दिल var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-11-29 10:53:07","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/29/20373568a3440b8673eeba9a7d75b56a1669716945454428_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Women's IPL: Base Price Of Franchise Set At Rs 400 crore, Say Sources","link":"https://sports.ndtv.com/cricket/womens-ipl-base-price-of-franchise-set-at-rs-400-crore-say-sources-3562753","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Sources have confirmed that the Indian cricket board will float tender for five teams and the base price for each franchise has been kept as Rs 400 crore.","content":null,"pubDate":"2022-11-29 10:34:01","image_url":"https://c.ndtvimg.com/2022-05/3qk31frg_harmanpreet-kaur-smriti-mandhana-bcci_625x300_16_May_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Cummins backs teammates amidst Langer drama","link":"https://www.themercury.com.au/sport/cricket/cummins-backs-teammates-amidst-langer-drama/video/bd52110ffb164be0b8a5f9246aac55cb","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Pat Cummins is thankful Justin Langer clarified his remarks, while backing his teammates amongst the fallout.","content":"Cricket: Pat Cummins is thankful Justin Langer clarified his remarks, while backing his teammates amongst the fallout.","pubDate":"2022-11-29 10:27:17","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND vs NZ 3rd ODI: When and Where to watch India vs New Zealand Live telecast","link":"https://www.firstpost.com/firstcricket/sports-news/ind-vs-nz-3rd-odi-when-and-where-to-watch-india-vs-new-zealand-live-telecast-11718251.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IND vs NZ 3rd ODI: When and Where to watch India vs New Zealand Live telecast","content":"Shikhar Dhawan and Co are ready to take on New Zealand in the third and final match of the three-game ODI series in Christchurch. India is down 1-0 and will aim to save the series on Wednesday in the final ODI.In the first match, the hosts trumped India by seven wickets. New Zealand chased down the target of 306 set by India with 2.5 overs to spare in the first ODI of three-match series here at Eden Park in Auckland on Friday. The marathon chase was powered by the stunning century from Tom Latham and the skipper Kane Williamson’s undefeated 94. The duo chased the target with an unbeaten 221-run stand.India’s match against New Zealand was called off with the Men in Blue scoring 89/1 in 12.5 overs at the time rain intervened for the final time and put any possibility of further action to rest.Here are the Live streaming and telecast details of India vs New Zealand 3rd ODI:When will India vs New Zealand third ODI be played?The India vs New Zealand third ODI will be played on 30th November 2022 (Wednesday).What is the venue for India vs New Zealand third ODI?The India vs New Zealand third ODI will be played at Hagley Oval, Christchurch.At what time will India vs New Zealand third ODI start?The India vs New Zealand third ODI will start at 7 AM IST, with the toss at 6.30 am IST.Where can we watch India vs New Zealand third ODI?The India vs New Zealand third ODI will be streamed live on Amazon Prime Video. It can also be watched on the DD Sports channel. You can also follow the match and scores live on Firstpost.com.How to get Amazon Prime Video subscription?For this, you will need to open an account on Amazon and then avail Prime subscription by paying a fee to watch the India-New Zealand series.India vs New Zealand ODI Squads:India: Shikhar Dhawan (c), Shubman Gill, Deepak Hooda, Suryakumar Yadav, Shreyas Iyer, Rishabh Pant (vc and wk), Sanju Samson (wk), Washington Sundar, Shardul Thakur, Yuzvendra Chahal, Kuldeep Yadav, Arshdeep Singh, Deepak Chahar, Umran Malik.New Zealand: Kane Williamson (c), Finn Allen, Michael Bracewell, Devon Conway (wk), Lockie Ferguson, Matt Henry, Tom Latham (wk), Daryl Mitchell, Adam Milne, Jimmy Neesham, Glenn Phillips, Mitchell Santner, Tim Southee, Henry Nicholls.(With ANI inputs)Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-29 10:22:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Shreyas-Iyer-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Rangers hero Ally McCoist reveals who he’s supporting as Wales take on England at the World Cup and fans can’t handle it","link":"https://www.thescottishsun.co.uk/sport/football/9842196/rangers-ally-mccoist-supporting-wales-england-world-cup-fans/","keywords":["Football","Sport","World Cup 2022"],"creator":["Stewart Fisher"],"video_url":null,"description":null,"content":"ALLY McCOIST has been getting it in the neck from England fans - after admitting he's supporting Wales in tonight's World Cup clash. The Rangers and Scotland legend was put on the spot when it comes to tonight's Group B clash. 2 Ally McCoist was put on the spot about tonight's clash Credit: PA 2 Gareth Bale addresses a press conference at the Qatar National Convention Center Credit: AFP McCoist - a man who has no problem supporting the England cricket team- has been eulogised as one of the UK's best World Cup pundits. But when push came to a shove, he said he wanted Wales to win tonight's clash - as that could mean both British sides reaching the last 16. Anything but an outlandish 4-0 defeat would see Gareth Southgate's men take their place in the knockout stages. Put on the spot by co-host Laura Woods on TalkSPORT , McCoist said: \"I nearly said I don't care. Read More In Football COSTLY BUSINESS Gers SUED for £1.7m by Sydney Super Cup bosses as 'Old Firm' row laid bare TOP OFFER World Cup sign-up offer: Bet £19 Get £66 in FREE BETS to use today with Bet UK \"I would still love both teams to go through. \"What if Wales win and England still go through? \"Okay, I would be learning more towards Wales. \"There you are, you put me on the spot.\" Most read in Football COSTLY BUSINESS Gers SUED for £1.7m by Sydney Super Cup bosses as 'Old Firm' row laid bare OUT THE HAT Scottish Cup fourth round draw in full as Celtic and Rangers discover fate GOING MAD Hilarious moment topless Rangers fan interrupts reporter with Michael Beale chant HAVING A GO Boyd trolls QPR over Beale appointment as he makes 'one eye' on Ibrox claim Woods replied: \"There you go, Ally McCoist is on the side of Wales..\" McCoist said: \"You should see the daggers I'm getting from the production boys.\" Fans weren't happy, though, with one pointing out that he is \"more confused than Scooby Doo\" when it comes to which British team he chooses to support. Another said: \"Ally, you were my favourite Scottish person until you made that comment about Wales.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2022-11-29 09:49:02","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Sunil Gavaskar का बड़ा बयान, कहा- वनडे वर्ल्ड कप 2023 तक किसी खिलाड़ी को नहीं दिया जाए आराम","link":"https://www.abplive.com/sports/cricket/former-indian-player-sunil-gavaskar-said-that-no-indian-player-should-be-given-rest-till-the-odi-world-cup-2023-2270154","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Sunil Gavaskar On Indian Cricket Team: न्यूजीलैंड दोरे के लिए रोहित शर्मा और विराट कोहली जैसे खिलाड़ियों को आराम दिया गया है. दरअसल, टी20 वर्ल्ड कप के बाद वर्कलोड मैनेज करने के लिए इन खिलाड़ियों को आराम दिया गया, लेकिन पूर्व भारतीय खिलाड़ी सुनील गावस्कर इससे इत्तेफाक नहीं रखते. साथ ही उन्होंने भारतीय टीम मैनेजमेंट को एक सलाह दी है. सुनील गावस्कर ने कहा कि अगले साल भारत में वनडे वर्ल्ड कप खेला जाना है. इस वजह से कम से कम वर्ल्ड तक किसी टॉप ऑर्डर बल्लेबाज को आराम नहीं दिया जाना चाहिए. 'मैनेजमेंट के पास वर्ल्ड कप के लिए कोई ठोस प्लान होना अहम' सुनील गावस्कर का मानना है कि टीम में लगातार बदलाव अनिश्चितता का माहौल पैदा करता है, जो टीम के लिहाज से ठीक नहीं है. उन्होंने कहा कि भारतीय टीम मैनजेमेंट के पास अगले वनडे वर्ल्ड कप के लिए कोई ठोस प्लान होना चाहिए. भारतीय टीम मैनेजमेंट को चाहिए कि वर्ल्ड कप तक सभी खिलाड़ी साथ खेलें, खिलाड़ियों को आराम नहीं दिया जाए, इससे आपसी समझबूझ बेहतर होगी, यह टीम के लिए जरूरी है. पूर्व भारतीय खिलाड़ी ने कहा कि लिमिटेड ओवर फॉर्मेट में पार्टनरशिप काफी अहम है, अगर आप लगातार एक-दूसरे के साथ खेलते हैं तो आपको ऐसा करने में मदद मिलेगी. रोहित शर्मा और विराट कोहली जैसे खिलाड़ियों को आराम गौरतलब है कि भारतीय टीम फिलहाल न्यूजीलैंड के दौर पर है. इस दौरे पर टीम इंडिया के नियमित कप्तान रोहित शर्मा के अलावा विराट कोहली और केएल राहुल जैसे खिलाड़ी टीम का हिस्सा नहीं हैं. भारतीय टीम मैनेजमेंट ने टी20 वर्ल्ड कप के बाद इन खिलाड़ियों का वर्कलोड कम करने के लिए आराम देने का फैसला किया था. इस वजह से न्यूजीलैंड के खिलाफ 3 टी20 मैचों की सीरीज में हार्दिक पांड्या ने कप्तानी की. वहीं, वनडे सीरीज में शिखर धवन टीम की कप्तानी कर रहे हैं. भारतीय टीम 3 वनडे मैचों की सीरीज में फिलहाल 1-0 से पीछे है. इस सीरीज का आखिरी वनडे मैच 30 नवंबर को क्राइस्टचर्च में खेला जाएगा. यह मैच भारतीय समयनुसार सुबह 7 बजे शुरू होगा. ये भी पढ़ें- आस्ट्रेलियाई टीम में नहीं है कोई कायर, कप्तान कमिंस का पूर्व कोच को करारा जवाब Ruturaj Gaikwad: बैक बेंचर से लगातार 7 छक्के मारने वाले ऋतुराज गायकवाड़ में कैसे आया इतना बदवाल, पढ़ें दिलचस्प कहानी","content":null,"pubDate":"2022-11-29 09:41:54","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/29/7c409690bc9acf2a7cdee28aa3e7e8041669714805023428_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"&#039;No cowards&#039; in Australia team, says captain Cummins, hitting back at Langer","link":"https://www.thehindu.com/sport/cricket/no-cowards-in-australia-team-says-captain-cummins-hitting-back-at-langer/article66199576.ece","keywords":null,"creator":["\n         Reuters  \n    "],"video_url":null,"description":"Former national team coach Justin Langer had lashed out at \"cowards\" in the Australian cricket team who complained in the media about his intense coaching style","content":null,"pubDate":"2022-11-29 09:12:44","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"'Preparations start from here, no time for experiments': Mohammad Kaif on 2023 World Cup","link":"https://www.firstpost.com/firstcricket/sports-news/preparations-start-from-here-no-time-for-experiments-mohammad-kaif-on-2023-world-cup-11717501.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"'Preparations start from here, no time for experiments': Mohammad Kaif on 2023 World Cup","content":"Cricket 'Preparations start from here, no time for experiments': Mohammad Kaif on 2023 World Cup Mohammad Kaif urged for Umran Malik to be backed especially after omission from the T20 World Cup. FirstCricket Staff November 29th, 2022 14:34:09 IST File image of Mohammad Kaif. Sportzpics India’s quest for an ICC trophy got longer when they fell short in the semi-finals of the T20 World Cup. Rohit Sharma-captained India were beaten by England in a one-sided contest in the last-four. Now, focus has already shifted to the ODI World Cup, to be held next year, in India. With that in mind, one aspect that is being keenly observed is the team selection. To make it an even more challenging task, the Chetan Sharma-led selection committee was sacked , and a new body is yet to be appointed. They will have the onus to select a group of 15-20 players who can end India’s nine year ICC trophy drought. But before that happens, former India cricketer Mohammad Kaif has asked for players to be backed and patience from the think tank. “Why is Bhuvneshwar Kumar not in the squad, I have no clue. He’s a good bowler, but not part of the squad. In the search for new players, we are losing out on the old ones. There’s a saying: in search of diamonds, we lost the gold,” Kaif said on Amazon Prime Video . “You had good players in the squad so this shouldn’t be the case. If you’re backing someone, please do it nicely. The preparation starts from here, there’s no time for experiments. The months will pass, and suddenly you’ll find yourself approaching the World Cup. So, you decide on the players and keep backing them,” he added. Kaif urged for Umran Malik to be backed especially after omission from the T20 World Cup. “Umran Malik, the extra pace that we often talk about, (Jasprit) Bumrah got injured at the T20 World Cup, there was no one with that kind of pace. The three pacers – Arshdeep (Singh), Bhuvneshwar Kumar, and (Mohammed) Shami all three of them bowl nearly at the same pace. In the World Cup, we missed someone, who can bowl 145 cases per hour. Someone like Umran Malik, definitely, back him from here on,” Kaif concluded. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 29, 2022 14:34:09 IST Tags: Cricket India Vs New Zealand Mohammad Kaif Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-29 09:04:09","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2021/07/Mohammad-Kaif-Delhi-Capitals-IPL-2020-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs Wales Live Streaming: When and Where to Watch FIFA World Cup 2022 Live","link":"https://www.firstpost.com/sports/england-vs-wales-live-streaming-when-where-how-to-watch-fifa-world-cup-2022-live-qatar-match-coverage-tv-online-11717331.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"England vs Wales Live Streaming: When and Where to Watch FIFA World Cup 2022 Live","content":"If England need any added motivation ahead of their final World Cup group game against Wales on Tuesday, they only have to watch a certain video from 2016.FIFA World Cup: Fixtures | Results | Points Table | Squads | RecordsFootage of Wales players celebrating wildly as their British neighbors crashed out of the European Championship after losing to Iceland went viral at the time.England were humiliated. Wales, which lost 2-1 to the Three Lions in the group stage but went on to reach the semifinals, was jubilant.Much has changed since then. England’s tournament performances over the last four years inlcude — reaching the semifinals of the World Cup in 2018 and the final of last year’s European Championship, which they lost on penalties to Italy.FIFA World Cup: Knockout stage scenariosEngland are among the favourites to triumph in Qatar and only need a point against Wales to guarantee qualification to the knockout stages. Depending on goal difference, England could still progress even if they lose that match.For Wales, the jeopardy is much higher.Bottom of the group with one point from their first two matches, Wales must win to have any chance of reaching the round of 16 at their first World Cup since 1958.Here’s everything you need to know about the England vs Wales FIFA World Cup game.When is England vs Wales in the FIFA World Cup?England vs Wales is scheduled to be played on 29 November (30 November in India).What time is England vs Wales in the FIFA World Cup?England vs Wales will kick off at 10 pm local time which is 12.30 AM IST on Wednesday.Where will England vs Wales be played in Qatar during the FIFA World Cup?England vs Wales will be played at the Ahmed bin Ali Stadium in Ar-Ryyan which has a capacity for 45,032 fans.Which TV channel will broadcast England vs Wales in the FIFA World Cup?England vs Wales match will be shown live on Sports18, Sports18 HD and MTV HD.Which streaming app will show England vs Wales live?England vs Wales match will be live streamed on the JioCinema app. You can also follow the match live on firstpost.com.With AP inputsRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-29 08:52:49","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/England-vs-Wales-FIFA-World-Cup.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}