{"newsArray":[{"title":"‘I’m never the guy who will dodge a fight’: Usman Khawaja warns fans following ‘nasty’ Ashes tour","link":"https://thewest.com.au/news/im-never-the-guy-who-will-dodge-a-fight-usman-khawaja-warns-fans-following-nasty-ashes-tour-c-11724369","keywords":null,"creator":["Martin Gabor"],"video_url":null,"description":"Usman Khawaja wasn’t afraid to call out fans who crossed the line in England, and he’s warned others that he’ll continue to fight back if it continues.","content":"Test opener Usman Khawaja says he’ll always stand up for himself and his teammates if fans cross the line with their abuse following an Ashes series marred by ugly altercations between English supporters and Australian players. Khawaja and Marnus Labuschagne copped abuse from a fan as they were leaving the field during the final Test at the Oval where they were accused of playing “boring” cricket in a series that finished 2-2. But the ugliest moment came in the second Test at Lord’s when members of the Marylebone Cricket Club hurled vile abuse and got in the faces of Australian players after English wicketkeeper Jonny Bairstow was controversially stumped. Several members of the exclusive club were suspended after video footage showed them calling Australian players “cheats” in an aggressive tirade that earnt the ire of Khawaja and his teammates. There’s long been a mutual respect between the two teams, with the 2005 series going down as the greatest in history as England finally regained the Urn after weeks of drama, but Khawaja says the recent tour crossed a line. “The English summer this time was very different. This was my third English summer away for the Ashes and I’ve been there for a World Cup, but this was a different vibe,” he said. “It was a little nastier than anything I’ve experienced in the past and a little bit more in your face. “I don’t know if that was because of the whole Bazball thing or us being the so-called ‘villains’ over there. “There’s always been banter over there, but it’s usually more respectful. Maybe that’s where the game is going, and if that’s where it is, then that’s a bit unfortunate.” The veteran opener is a lover of all sports and has seen crowd interactions get more heated in the NBA in recent years, with controversial superstar Kyrie Irving often targeted, which has led to spectators getting kicked out of arenas. He fears it could start creeping into other sports and it’s why Khawaja will continue to bite back if he feels that fans are being disrespectful. “I’ve never been a big fan of the crowd being able to say whatever they want, and that’s in Australia, England or anywhere in the world,” he said. “If I feel like they’ve crossed my line – I say my line because I feel everyone’s line is different – and if I feel they’ve gone too far with me, then I’ll always pull them up. “I’ll never shy away from that because I’m never the guy who will dodge a fight. If you’re disrespectful to me, then I have a right to come back at you. “I love sport and seeing fans get involved with sport, but I think we still have a long way to go. “We see it a lot in basketball these days when fans get up close and personal, and we’re seeing it in cricket as well when we go to the change rooms and there are people right next to you. “If you’re in a privileged position where you get to be shoulder to shoulder with the athletes, then you need to be respectful.” The 36-year-old is long odds to be on the next Ashes tour, but he needn’t worry, with Khawaja signing on to join the Fox Cricket commentary team once he retires. Khawaja has grown up watching Fox Sports and even remembers the old channel numbers from when he was a kid. He’s promised to hold nothing back when he switches the bat and gloves for the microphone. “I think I’ll be myself, and without even meaning to I end up stirring the pot a little bit,” he said. “I don’t mean to but I just speak openly from the heart. “I’ve always felt that as long as you’re respectful, then you can voice your opinion how you want to. I’ve always tried to be quite respectful, but I also won’t shy away from hard conversations because I’m not a fence-sitter. “If I have an opinion then I’ll say it, especially if I feel it’s valid and that it will add something to the conversation. “On top of that, I’m ready to have some fun. If anyone knows me, I’m all about fun and I try to bring that everywhere. Hopefully, I can bring that into the commentary.” Originally published as ‘I’m never the guy who will dodge a fight’: Usman Khawaja warns fans following ‘nasty’ Ashes tour Sign up for our emails","pubDate":"2023-08-27 23:56:14","image_url":"https://images.thewest.com.au/publication/C-11724369/7617aa33463643810cd43ed8d20a805540d0d359-16x9-x0y61w648h365.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"title":"[Watch] 41-year-old Fidel Edwards dismisses Kamran Akmal for a golden duck in US Masters T10 Final","link":"https://www.sportskeeda.com/cricket/watch-41-year-old-fidel-edwards-dismisses-kamran-akmal-golden-duck-us-masters-t10-final","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Fidel Edwards did not allow Kamran Akmal to score a single run in the US Masters T10 League 2023 Final. The Caribbean pacer dismissed the Pakistani batter for a golden duck off the opening ball of the contest between New York Warriors and Texas Chargers. The final of the US Masters T10 League got underway earlier today in Florida. New York Warriors are up against the Texas Chargers in the summit clash of the inaugural edition of US Masters T10. Texas Chargers won the toss and opted to field first. Kamran Akmal came out to open the batting for New York Warriors along with former Sri Lankan captain, TM Dilshan. Fidel Edwards charged in with the new ball to open the bowling for the Chargers. Edwards bowled a short delivery straightaway. Akmal tried to pull it towards the mid-wicket region. However, he could not time the shot to perfection and ended up chopping the ball onto his stumps. Akmal was in decent touch during the previous games. He scored an eight-ball 23 for New York Warriors during their match against Morrisville Unity, while in the previous battle against the Texas Chargers, he scored 15 runs off 11 balls. Although Edwards started the final with a wicket off the first ball, he could not add more wickets to his tally in the summit clash. He completed his quota of two overs for the Texas Chargers and ended with figures of 1/21. Jonathan Carter played a brilliant knock of 39 runs from 16 deliveries for the New York Warriors, helping them post a 92-run total on the board. Chasing 93 for a win, the Texas Chargers have started well. It will be interesting to see which team wins the inaugural edition of US Masters T10 League. Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/65975-16931585995751-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"Shahid Afridi defends 1 run off 2 balls in US Masters T10 League Final, takes match into Super Over","link":"https://www.sportskeeda.com/cricket/news-shahid-afridi-defends-1-run-2-balls-us-masters-t10-league-final-takes-match-super-over","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Shahid Afridi once again proved himself as one of the biggest game-changers in cricket history by defending one run off two balls in the final of the US Masters T10 League. Playing for the New York Warriors, the 46-year-old Pakistan legend came to defend nine runs off the last six balls. Neil Broom and Sohail Tanvir were batting in the middle for the Texas Chargers. They took two runs off the first three balls before Tanvir whacked the fourth delivery for a maximum. With one run needed off two deliveries, the Texas Chargers were the favorites to win the match. However, Shahid Afridi dismissed Tanvir on the next ball. Fidel Edwards came out to bat next, with Texas requiring one run off one delivery. Edwards could not read Afridi's delivery as he was trapped in front of his stumps LBW. The match ended in a tie, forcing a Super Over between New York Warriors and Texas Chargers in the US Masters T10 League Final. Afridi had a forgettable outing with the bat in the first innings, managing only one run off two balls before handing a catch to Fidel Edwards off Ehsan Adil's bowling. Texas Chargers batted first in the one-over eliminator and scored 15 runs. Ben Dunk scored six runs off two balls, while Mohammad Hafeez and Muktar Ahmed were not out on one and eight, respectively. Sohail Khan bowled the Super Over for the New York Warriors. Chasing 16 for a win, New York sent Shahid Afridi and Jonathan Carter in the middle. Afridi took a single on the first ball bowled by Sohail Tanvir. Carter hit a four and then rotated the strike. Afridi surprisingly refused for a single on the fourth ball, bringing the equation down to 10 off two. Afridi went for a big shot on the fifth ball, but Tanvir got the top edge of his bat, resulting in only one run. Jonathan Carter hit a six on the last ball as the Texas Chargers won by two runs. Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/fd57b-16931620224454-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"[Watch] Shahid Afridi loses his wicket for 1 run in US Masters T10 League Final","link":"https://www.sportskeeda.com/cricket/news-watch-shahid-afridi-loses-wicket-1-run-us-masters-t10-league-final","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Shahid Afridi could not make much of an impact with the bat for the New York Warriors in the US Masters T10 League Final against the Texas Chargers. The Pakistan legend got out for one run off two balls in the big game. Coming out to bat at number five for the New York Warriors when the team was down to 41/3 in the sixth over, Afridi tried for a big shot towards the leg-side on the second ball itself. He tried to send a delivery from Ehsan Adil outside the boundary line. However, the timing was not perfect. The ball ended up landing in the hands of Fidel Edwards , who was standing in the deep. Afridi was in good touch with the bat during the previous matches of US Masters T10 League. The all-rounder smacked a 11-ball 22 against Morrisville Unity, while in the previous game against the Texas Chargers, he smacked an eight-ball 18. Afridi also scored 22 runs off 14 balls against Atlanta Riders. Regarded by many as the biggest match-winner in Pakistan cricket history, Shahid Afridi made his presence felt in the bowling department later in the US Masters T10 League Final. Afridi had to defend nine runs off the last over against the Texas Chargers. The legendary all-rounder kept his nerve and conceded eight runs. He gave away eight runs off the first four balls only. Afridi then dismissed Sohail Tanvir and Fidel Edwards off the last two deliveries to help the New York Warriors take the match into a Super Over. Texas Chargers batted first and scored 15 runs in the Super Over. New York Warriors tried their bset to chase down the 16-run target, but could only muster up 11, crowning the Chargers as champions of the US Masters T10 League. Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/9c335-16931604561390-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"CPL 2023: Match 12, St Kitts and Nevis Patriots vs Trinbago Knight Riders: Probable XIs, Pitch Report, Weather Forecast, and Live Streaming","link":"https://www.sportskeeda.com/cricket/cpl-2023-match-12-st-kitts-nevis-patriots-vs-trinbago-knight-riders-probable-xis-pitch-report-weather-forecast-live-streaming","keywords":["Cricket"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":"St Kitts and Nevis Patriots and Trinbago Knight Riders will lock horns in Match 12 of the Caribbean Premier League 2023 on Sunday, August 27 (Monday, August 28 in India). The Warner Park in Basseterre, St Kitts will play host to this match. The Patriots, led by Evin Lewis, are placed fifth in the points table with a net run rate of -1.989. Out of five matches, the Patriots are yet to see the face of victory. While they have lost three, two games ended in no result. The Patriots will go into the match after losing to Barbados Royals by six wickets. After setting up a massive target of 198 for the opponents to chase down, the Patriots' bowlers faltered as the Royals romped home with nine balls to spare. The Knight Riders, led by Kieron Pollard, need to find their feet at the earliest to climb the ladder. They are currently placed at the bottom of the table with a net run rate of -2.700. They will go into the game after losing to Faf du Plessis' Saint Lucia Kings by 54 runs. After being asked to chase down a challenging target of 168, the Knights folded for 113 in 14.5 overs. Match : St Kitts and Nevis Patriots vs Trinbago Knight Riders, Match 12, Caribbean Premier League 2023 Date and Time : August 28, 2023, Monday, 04:30 am IST Venue : Warner Park, Basseterre, St Kitts The pitch at the venue in St Kitts has been an excellent one for the batters until now. Teams should opt to field first after winning the toss. There is no chance of rain for the time being in St Kitts. Temperatures will be around 28 degrees Celsius. St Kitts and Nevis Patriots Evin Lewis (c), Andre Fletcher , Joshua Da Silva (wk), Ambati Rayudu, Sherfane Rutherford, Dominic Drakes, Jyd Goolie, Corbin Bosch, Izharulhaq Naveed, Ashmead Nedd, Oshane Thomas Trinbago Knight Riders Martin Guptill, Mark Deyal , Chadwick Walton, Nicholas Pooran (wk), Kieron Pollard (c), Andre Russell, Dwayne Bravo, Sunil Narine , Akeal Hosein, Ali Khan, Jaden Carmichael Both St Kitts and Nevis Patriots and Trinbago Knight Riders are yet to open their account in the tournament. But the Knights will be fancying their chances as the Patriots are completely out of form. Prediction: Trinbago Knight Riders to win this Caribbean Premier League 2023 match TV : N/A Live Streaming : Fancode Poll : Ambati Rayudu to score a half-century? Yes No 1 votes Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/1a615-16931607186170-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"[In Pictures] \"Living the Miami life\" - Dhanashree Verma gives fans a glimpse of her vacation with Yuzvendra Chahal","link":"https://www.sportskeeda.com/cricket/news-in-pictures-living-miami-life-dhanashree-verma-gives-fans-glimpse-vacation-yuzvendra-chahal","keywords":["Cricket"],"creator":["Aditya Suketu Desai"],"video_url":null,"description":null,"content":"Team India leg spinner, Yuzvendra Chahal, is making the most of his time away from the game. The cricket star is rejuvenating himself with a vacation in Miami alongside his wife, Dhanashree Verma. Taking to her Instagram handle on Sunday, August 27, Dhanashree shared a few pictures from the trip to give fans a glimpse of their recent getaway. Captioning the post, she wrote: Instagram Post Notably, Yuzvendra Chahal failed to make it to India's squad for the upcoming Asia Cup 2023 . The crafty spinner was overlooked as the national selectors gave the nod to the in-form Kuldeep Yadav over him. Chahal was last seen in action during India's five-match T20I series against Ireland. He bagged five wickets in as many appearances. While he was also part of the Men in Blue side for the three ODI matches of the tour, he was benched throughout the series. Reacting to India's squad for the Asia Cup 2023, former South Africa captain Ab de Villers expressed disappointment over the exclusion of Yuzvendra Chahal. De Villiers pointed out that Chahal can be a very useful option with is leg-spin and is a smart operator. Speaking about the senior bowler's non-selection, he said on his YouTube channel: Rohit Sharma and Co. will open their Asia Cup campaign with a blockbuster clash against arch-rivals Pakistan at the Pallekele International Cricket Stadium in Sri Lanka on September 2. India's Asia Cup 2023 squad: Rohit Sharma (c), Shubman Gill, Virat Kohli, Shreyas Iyer, KL Rahul, Suryakumar Yadav, Tilak Varma, Ishan Kishan, Hardik Pandya (vc), Ravindra Jadeja, Axar Patel, Shardul Thakur, Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Kuldeep Yadav, Prasidh Krishna, Sanju Samson (travelling reserve). Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/cec24-16931604981884-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"Oval Invincibles crowned Hundred champions at Lord's as Tom Curran shows England what they're missing hitting an unbeaten 67","link":"https://www.dailymail.co.uk/sport/cricket/article-12451359/Oval-Invincibles-crowned-champions-Lords-Tom-Curran-shows-England-theyre-missing-hitting-unbeaten-67.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The 28-year-old, whose last international appearance was two years ago, missed out on the World Cup squad. He showed England what they will be missing with an outstanding display.","content":"Oval Invincibles crowned Hundred champions at Lord's as Tom Curran shows England what they're missing hitting an unbeaten 67 Tom Curran was the star of the show guiding Oval Invincibles to glory on Sunday They beat Manchester Originals in the final of the men's Hundred at Lord's Curran struck an unbeaten 67 and took 1-25 as his side claimed their first title By Gary Fitzgerald For The Daily Mail Updated: 17:37 EDT, 27 August 2023 e-mail View comments Tom Curran shrugged off his latest England rejection to help Oval Invincibles lift their first Hundred title at Lord’s. The 28-year-old, whose last international appearance was two years ago, missed out on the World Cup squad. He showed England what they will be missing with an outstanding all-round display as his unbeaten 67 and then 1-25 earned him a player of the match award in his side’s 14-run victory over Manchester Originals. And Curran insisted: ‘We deserved this win. I’m really happy and proud of the boys.’ Tom outshone younger brother Sam, who is in the 15-man party for the upcoming white ball clashes with New Zealand and the big October tournament in India. Oval Invincibles and Southern Brave were crowned champions of the men's and women's Hundred on Sunday evening Tom Curran (right) held the trophy with his brother Sam (left) as they both starred in the Invincibles win over Manchester Originals Curran was impressive with the bat scoring an unbeaten 67 and taking 1-25 to help his side claim their first Hundred title Sam made a first ball duck but Tom top scored in his side’s 161-5. He and Jimmy Neesham (57) rescued Invincibles after being put in by Jos Buttler and crumbling to 34-5. But their stunning 127-run sixth wicket partnership — after Jason Roy made a duck — proved crucial. Richard Gleeson was Originals’ best bowler with 2-37 but it was Curran who stole the spotlight. He turned wicket-taker when Originals set off to try and chase down the target, removing Phil Salt (25) before spinners Danny Briggs, Will Jacks and Nathan Sowter grabbed four wickets between them including Buttler for 11. Southern Brave were also victorious in the women's final claiming 34-run victory over Northern Superchargers Anya Shrubsole (right) signed off a glittering playing career leading Southern Brave to victory Max Holden smashed a quickfire 37 but he fell lbw to Sam Curran and Invincibles held strong for victory with Originals making just 147-6. Earlier, Anya Shrubsole signed off her glittering playing career by leading Southern Brave to victory in the women’s final. The former England hero was overwhelmed with emotion as she celebrated a 34-run win over Northern Superchargers. Shrubsole, 31, took a wicket on her last appearance and admitted: ‘I’m feeling a whole range of emotions.’ Share or comment on this article: Oval Invincibles crowned Hundred champions at Lord's as Tom Curran shows England what they're missing hitting an unbeaten 67 e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-27 21:37:04","image_url":"https://i.dailymail.co.uk/1s/2023/08/27/22/74776465-0-image-m-19_1693171753692.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Neyland's cricketers toast treble by lifting Harrison-Allen Bowl","link":"https://www.westerntelegraph.co.uk/sport/23750558.neylands-cricketers-toast-treble-lifting-harrison-allen-bowl/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Harrison-Allen Bowl Final 2023 – Sponsored by Puffin Produce:","content":"PEMBROKESHIRE's 2023 cricket champions Neyland toasted the treble as they lifted the Harrison-Allen Bowl with a solid win over Lawrenny in the final at Cresselly Cricket Club. Having already secured the division one title and the DR Morris Cup, Neyland (156 for 7 & 199 for 5) came through to beat Lawrenny (117 all out & 156 all out) by 81 runs. Ross Hardy was named as man of the match for his all-round contribution of 59 and 45 with the bat, and figures of 3 for 27 and 4 for 58 with the ball, plus two catches. On winning the toss, Lawrenny skipper Jamie Lewis invited Neyland to bat and openers Nick Koomen and Brad McDermott-Jenkins made a very bright start to the innings. They struck seven boundaries between them, before both were caught for 17, and when Paul Murray was also bowled Lawrenny's hopes were lifted with the score at 45 for 3. Ashley Sutton and Ross Hardy steadied matters for a while and the scoring rate slowed, but then Dai Davies came in and struck three boundaries in his unbeaten 30 runs. Hardy also stepped things up with one four and six sixes in his 59 and Sean Hannon added 10 before he was run out from the final ball to leave his side on 156 for 7. Kyle Marsh finished with 2 for 17 from two overs, before Lawrenny, after losing Finley Lewis, added 66 runs in good time from Kyle Marsh and James Phillips by the ninth over. Phillips made 21, with 4 fours, and Marsh went on to reach 48 in 35 balls, including 6 fours and 2 sixes, before Lawrenny collapsed from 69 for 1 to 117 all out in 20.4 overs. Troy Purslowe (12) and Tom Cole (14) and Ryan Morton (13) made double figures, but Andrew Miller took 4 for 21, Hardy claimed 3 for 27 and Nick Kooman took 3 for 30. After tea, Neyland lost Nick Koomen for 6, but McDermott-Jenkins and Sutton, with three sixes in his 30 runs, added 75 to positively take the score on to 101 in 13 overs. Paul Murray made a quick-fire 22, Hardy smashed 4 fours and 3 sixes in his 45 and McDermott-Jenkins added 3 fours and 6 sixes before eventually being caufght out. Morton had achieved figures of 2 for 48, but Neyland had raced to 199 for 5, leaving Lawrenny needing a massive 239 runs to deny the division one champions the treble. They were soon in trouble at 32 for 4 as key wickets fell to Hardy (4 for 68) and Patrick Hannon (2 for 37), although Morton struck 3 fours and 6 sixes in his top score of 62. Joe Kidney (28) also offered resistance, but Miller claimed 2 for 19 - and match figures of 6 for 40 - before veteran James Buckle also chipped in with a late 23 not out. Neyland secured an 81-run victory, and skipper Sean Hannon collected the coveted Harrison Allen Bowl from Mr Huw Harrison-Allen to complete a superb season. Meanwhile organisers have voiced disappointment at the behaviour by a small number of apparently drunken 'supporters' on the clubhouse verandah, which caused the game to be halted. There were repeated requests from announcer Richard Merriman to halt their bad language and lack of respect for some players, and they were eventually removed from that vantage point.","pubDate":"2023-08-27 19:56:01","image_url":"https://www.westerntelegraph.co.uk/resources/images/17162020/?type=app&htype=0","source_id":"western_telegraph","source_priority":553531,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Chopra wins India's first gold at world championships in javelin","link":"https://www.channelnewsasia.com/sport/chopra-wins-indias-first-gold-world-championships-javelin-3728461","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide 2022 Best News Website or Mobile Service Digital Media Awards Worldwide 2022 BUDAPEST: Olympic champion Neeraj Chopra became the first Indian to win a gold medal at the World Athletics Championships when he pipped Pakistan's Arshad Nadeem in the men's javelin on Sunday (Aug 27) with an 88.17 metre effort in the final. Chopra won Olympic gold in Tokyo but managed only a silver at the worlds in Eugene last year. The only other Indian to win a medal at the worlds was Anju Bobby George, who took bronze in the women's long jump in 2003 in Paris. Pakistan's Nadeem, coming back from elbow surgery and a knee injury, produced his season's best effort of 87.82 on his third attempt to win the silver medal, while the Czech Republic's Jakub Vadlejch took the bronze with 86.67. \"This was great. After the Olympic gold I really wanted to win the world championships. I just wanted to throw further. This is brilliant for the national team but it was my dream to win gold at the world championships,\" Chopra said. \"This has been a great championships for India and I am proud to bring another title to my country. I don't think I am the best thrower here. I wanted to throw more tonight. \"I wanted to throw more than 90m tonight but it needs all parts of the puzzle to be there. I couldn't put it all together this evening. Maybe next time.\" Chopra needed only one attempt in the qualification round to lead the field with a season-best 88.77 metres. But the Indian was unhappy with his first effort in the final, deliberately stepping over the line for a foul. Under pressure, the 25-year-old then soared into the lead on his second attempt, turning his back and celebrating in trademark fashion with his arms aloft while pointing at the sky immediately after his throw, knowing it was good. Nadeem was competing in his first event of the year and as soon as the javelin landed on his third attempt, he broke into a wide grin as he moved up to second. India and Pakistan may have a heated rivalry in cricket but on a warm night in Budapest, all eyes were on two athletes competing for javelin gold. But that was as close as Nadeem, the 2022 Commonwealth Games champion, got to Chopra as he ran out of steam. Julian Weber was very close to giving Germany their first medal in Budapest on the final day of the championships, but he was pushed down to fourth when Vadlejch saved his best for his fifth attempt. \"It was a big fight and I am afraid that Julian Weber will not like me anymore,\" Vadlejch said. Kishore Jena and DP Manu finished fifth and sixth, respectively, to give India three athletes in the top six.","pubDate":"2023-08-27 19:44:00","image_url":null,"source_id":"channelnewsasia","source_priority":37829,"country":["singapore"],"category":["sports"],"language":"english"},{"title":"PCB unveils ODI World Cup 2023 kit today","link":"https://en.dailypakistan.com.pk/27-Aug-2023/pcb-unveils-odi-world-cup-2023-kit-today","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE - The World Cup 2023 kit for Pakistan's cricket squad will be unveiled tomorrow in Lahore.","content":"LAHORE - The World Cup 2023 kit for Pakistan's cricket squad will be unveiled tomorrow in Lahore. The kit unveiling event will take place at Gaddafi Stadium at 3pm. Zaka Ashraf, the chairman of the Pakistan Cricket Board, will be the special guest at this significant occasion. For this major occasion, PCB has created a kit that is visually stunning. For the most hyped-up kit, PCB media earlier today also posted on 'X' (formerly Twitter). The Pakistani squad intends to leave for Hyderabad, India, on September 28 after the Asia Cup. On September 29, a round of exhibition games will get under way. On October 6, Pakistan will play its first World Cup encounter against the Netherlands.","pubDate":"2023-08-27 19:16:12","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-08-27/pcb-to-unveil-world-cup-kit-tomorrow-1693155554-1290.jpg","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"title":"‘I’m never the guy who will dodge a fight’: Usman Khawaja warns fans following ‘nasty’ Ashes tour","link":"https://thewest.com.au/news/im-never-the-guy-who-will-dodge-a-fight-usman-khawaja-warns-fans-following-nasty-ashes-tour-c-11724369","keywords":null,"creator":["Martin Gabor"],"video_url":null,"description":"Usman Khawaja wasn’t afraid to call out fans who crossed the line in England, and he’s warned others that he’ll continue to fight back if it continues.","content":"Test opener Usman Khawaja says he’ll always stand up for himself and his teammates if fans cross the line with their abuse following an Ashes series marred by ugly altercations between English supporters and Australian players. Khawaja and Marnus Labuschagne copped abuse from a fan as they were leaving the field during the final Test at the Oval where they were accused of playing “boring” cricket in a series that finished 2-2. But the ugliest moment came in the second Test at Lord’s when members of the Marylebone Cricket Club hurled vile abuse and got in the faces of Australian players after English wicketkeeper Jonny Bairstow was controversially stumped. Several members of the exclusive club were suspended after video footage showed them calling Australian players “cheats” in an aggressive tirade that earnt the ire of Khawaja and his teammates. There’s long been a mutual respect between the two teams, with the 2005 series going down as the greatest in history as England finally regained the Urn after weeks of drama, but Khawaja says the recent tour crossed a line. “The English summer this time was very different. This was my third English summer away for the Ashes and I’ve been there for a World Cup, but this was a different vibe,” he said. “It was a little nastier than anything I’ve experienced in the past and a little bit more in your face. “I don’t know if that was because of the whole Bazball thing or us being the so-called ‘villains’ over there. “There’s always been banter over there, but it’s usually more respectful. Maybe that’s where the game is going, and if that’s where it is, then that’s a bit unfortunate.” The veteran opener is a lover of all sports and has seen crowd interactions get more heated in the NBA in recent years, with controversial superstar Kyrie Irving often targeted, which has led to spectators getting kicked out of arenas. He fears it could start creeping into other sports and it’s why Khawaja will continue to bite back if he feels that fans are being disrespectful. “I’ve never been a big fan of the crowd being able to say whatever they want, and that’s in Australia, England or anywhere in the world,” he said. “If I feel like they’ve crossed my line – I say my line because I feel everyone’s line is different – and if I feel they’ve gone too far with me, then I’ll always pull them up. “I’ll never shy away from that because I’m never the guy who will dodge a fight. If you’re disrespectful to me, then I have a right to come back at you. “I love sport and seeing fans get involved with sport, but I think we still have a long way to go. “We see it a lot in basketball these days when fans get up close and personal, and we’re seeing it in cricket as well when we go to the change rooms and there are people right next to you. “If you’re in a privileged position where you get to be shoulder to shoulder with the athletes, then you need to be respectful.” The 36-year-old is long odds to be on the next Ashes tour, but he needn’t worry, with Khawaja signing on to join the Fox Cricket commentary team once he retires. Khawaja has grown up watching Fox Sports and even remembers the old channel numbers from when he was a kid. He’s promised to hold nothing back when he switches the bat and gloves for the microphone. “I think I’ll be myself, and without even meaning to I end up stirring the pot a little bit,” he said. “I don’t mean to but I just speak openly from the heart. “I’ve always felt that as long as you’re respectful, then you can voice your opinion how you want to. I’ve always tried to be quite respectful, but I also won’t shy away from hard conversations because I’m not a fence-sitter. “If I have an opinion then I’ll say it, especially if I feel it’s valid and that it will add something to the conversation. “On top of that, I’m ready to have some fun. If anyone knows me, I’m all about fun and I try to bring that everywhere. Hopefully, I can bring that into the commentary.” Originally published as ‘I’m never the guy who will dodge a fight’: Usman Khawaja warns fans following ‘nasty’ Ashes tour Sign up for our emails","pubDate":"2023-08-27 23:56:14","image_url":"https://images.thewest.com.au/publication/C-11724369/7617aa33463643810cd43ed8d20a805540d0d359-16x9-x0y61w648h365.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"title":"[Watch] 41-year-old Fidel Edwards dismisses Kamran Akmal for a golden duck in US Masters T10 Final","link":"https://www.sportskeeda.com/cricket/watch-41-year-old-fidel-edwards-dismisses-kamran-akmal-golden-duck-us-masters-t10-final","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Fidel Edwards did not allow Kamran Akmal to score a single run in the US Masters T10 League 2023 Final. The Caribbean pacer dismissed the Pakistani batter for a golden duck off the opening ball of the contest between New York Warriors and Texas Chargers. The final of the US Masters T10 League got underway earlier today in Florida. New York Warriors are up against the Texas Chargers in the summit clash of the inaugural edition of US Masters T10. Texas Chargers won the toss and opted to field first. Kamran Akmal came out to open the batting for New York Warriors along with former Sri Lankan captain, TM Dilshan. Fidel Edwards charged in with the new ball to open the bowling for the Chargers. Edwards bowled a short delivery straightaway. Akmal tried to pull it towards the mid-wicket region. However, he could not time the shot to perfection and ended up chopping the ball onto his stumps. Akmal was in decent touch during the previous games. He scored an eight-ball 23 for New York Warriors during their match against Morrisville Unity, while in the previous battle against the Texas Chargers, he scored 15 runs off 11 balls. Although Edwards started the final with a wicket off the first ball, he could not add more wickets to his tally in the summit clash. He completed his quota of two overs for the Texas Chargers and ended with figures of 1/21. Jonathan Carter played a brilliant knock of 39 runs from 16 deliveries for the New York Warriors, helping them post a 92-run total on the board. Chasing 93 for a win, the Texas Chargers have started well. It will be interesting to see which team wins the inaugural edition of US Masters T10 League. Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/65975-16931585995751-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"Shahid Afridi defends 1 run off 2 balls in US Masters T10 League Final, takes match into Super Over","link":"https://www.sportskeeda.com/cricket/news-shahid-afridi-defends-1-run-2-balls-us-masters-t10-league-final-takes-match-super-over","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Shahid Afridi once again proved himself as one of the biggest game-changers in cricket history by defending one run off two balls in the final of the US Masters T10 League. Playing for the New York Warriors, the 46-year-old Pakistan legend came to defend nine runs off the last six balls. Neil Broom and Sohail Tanvir were batting in the middle for the Texas Chargers. They took two runs off the first three balls before Tanvir whacked the fourth delivery for a maximum. With one run needed off two deliveries, the Texas Chargers were the favorites to win the match. However, Shahid Afridi dismissed Tanvir on the next ball. Fidel Edwards came out to bat next, with Texas requiring one run off one delivery. Edwards could not read Afridi's delivery as he was trapped in front of his stumps LBW. The match ended in a tie, forcing a Super Over between New York Warriors and Texas Chargers in the US Masters T10 League Final. Afridi had a forgettable outing with the bat in the first innings, managing only one run off two balls before handing a catch to Fidel Edwards off Ehsan Adil's bowling. Texas Chargers batted first in the one-over eliminator and scored 15 runs. Ben Dunk scored six runs off two balls, while Mohammad Hafeez and Muktar Ahmed were not out on one and eight, respectively. Sohail Khan bowled the Super Over for the New York Warriors. Chasing 16 for a win, New York sent Shahid Afridi and Jonathan Carter in the middle. Afridi took a single on the first ball bowled by Sohail Tanvir. Carter hit a four and then rotated the strike. Afridi surprisingly refused for a single on the fourth ball, bringing the equation down to 10 off two. Afridi went for a big shot on the fifth ball, but Tanvir got the top edge of his bat, resulting in only one run. Jonathan Carter hit a six on the last ball as the Texas Chargers won by two runs. Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/fd57b-16931620224454-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"[Watch] Shahid Afridi loses his wicket for 1 run in US Masters T10 League Final","link":"https://www.sportskeeda.com/cricket/news-watch-shahid-afridi-loses-wicket-1-run-us-masters-t10-league-final","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Shahid Afridi could not make much of an impact with the bat for the New York Warriors in the US Masters T10 League Final against the Texas Chargers. The Pakistan legend got out for one run off two balls in the big game. Coming out to bat at number five for the New York Warriors when the team was down to 41/3 in the sixth over, Afridi tried for a big shot towards the leg-side on the second ball itself. He tried to send a delivery from Ehsan Adil outside the boundary line. However, the timing was not perfect. The ball ended up landing in the hands of Fidel Edwards , who was standing in the deep. Afridi was in good touch with the bat during the previous matches of US Masters T10 League. The all-rounder smacked a 11-ball 22 against Morrisville Unity, while in the previous game against the Texas Chargers, he smacked an eight-ball 18. Afridi also scored 22 runs off 14 balls against Atlanta Riders. Regarded by many as the biggest match-winner in Pakistan cricket history, Shahid Afridi made his presence felt in the bowling department later in the US Masters T10 League Final. Afridi had to defend nine runs off the last over against the Texas Chargers. The legendary all-rounder kept his nerve and conceded eight runs. He gave away eight runs off the first four balls only. Afridi then dismissed Sohail Tanvir and Fidel Edwards off the last two deliveries to help the New York Warriors take the match into a Super Over. Texas Chargers batted first and scored 15 runs in the Super Over. New York Warriors tried their bset to chase down the 16-run target, but could only muster up 11, crowning the Chargers as champions of the US Masters T10 League. Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/9c335-16931604561390-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"CPL 2023: Match 12, St Kitts and Nevis Patriots vs Trinbago Knight Riders: Probable XIs, Pitch Report, Weather Forecast, and Live Streaming","link":"https://www.sportskeeda.com/cricket/cpl-2023-match-12-st-kitts-nevis-patriots-vs-trinbago-knight-riders-probable-xis-pitch-report-weather-forecast-live-streaming","keywords":["Cricket"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":"St Kitts and Nevis Patriots and Trinbago Knight Riders will lock horns in Match 12 of the Caribbean Premier League 2023 on Sunday, August 27 (Monday, August 28 in India). The Warner Park in Basseterre, St Kitts will play host to this match. The Patriots, led by Evin Lewis, are placed fifth in the points table with a net run rate of -1.989. Out of five matches, the Patriots are yet to see the face of victory. While they have lost three, two games ended in no result. The Patriots will go into the match after losing to Barbados Royals by six wickets. After setting up a massive target of 198 for the opponents to chase down, the Patriots' bowlers faltered as the Royals romped home with nine balls to spare. The Knight Riders, led by Kieron Pollard, need to find their feet at the earliest to climb the ladder. They are currently placed at the bottom of the table with a net run rate of -2.700. They will go into the game after losing to Faf du Plessis' Saint Lucia Kings by 54 runs. After being asked to chase down a challenging target of 168, the Knights folded for 113 in 14.5 overs. Match : St Kitts and Nevis Patriots vs Trinbago Knight Riders, Match 12, Caribbean Premier League 2023 Date and Time : August 28, 2023, Monday, 04:30 am IST Venue : Warner Park, Basseterre, St Kitts The pitch at the venue in St Kitts has been an excellent one for the batters until now. Teams should opt to field first after winning the toss. There is no chance of rain for the time being in St Kitts. Temperatures will be around 28 degrees Celsius. St Kitts and Nevis Patriots Evin Lewis (c), Andre Fletcher , Joshua Da Silva (wk), Ambati Rayudu, Sherfane Rutherford, Dominic Drakes, Jyd Goolie, Corbin Bosch, Izharulhaq Naveed, Ashmead Nedd, Oshane Thomas Trinbago Knight Riders Martin Guptill, Mark Deyal , Chadwick Walton, Nicholas Pooran (wk), Kieron Pollard (c), Andre Russell, Dwayne Bravo, Sunil Narine , Akeal Hosein, Ali Khan, Jaden Carmichael Both St Kitts and Nevis Patriots and Trinbago Knight Riders are yet to open their account in the tournament. But the Knights will be fancying their chances as the Patriots are completely out of form. Prediction: Trinbago Knight Riders to win this Caribbean Premier League 2023 match TV : N/A Live Streaming : Fancode Poll : Ambati Rayudu to score a half-century? Yes No 1 votes Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/1a615-16931607186170-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"[In Pictures] \"Living the Miami life\" - Dhanashree Verma gives fans a glimpse of her vacation with Yuzvendra Chahal","link":"https://www.sportskeeda.com/cricket/news-in-pictures-living-miami-life-dhanashree-verma-gives-fans-glimpse-vacation-yuzvendra-chahal","keywords":["Cricket"],"creator":["Aditya Suketu Desai"],"video_url":null,"description":null,"content":"Team India leg spinner, Yuzvendra Chahal, is making the most of his time away from the game. The cricket star is rejuvenating himself with a vacation in Miami alongside his wife, Dhanashree Verma. Taking to her Instagram handle on Sunday, August 27, Dhanashree shared a few pictures from the trip to give fans a glimpse of their recent getaway. Captioning the post, she wrote: Instagram Post Notably, Yuzvendra Chahal failed to make it to India's squad for the upcoming Asia Cup 2023 . The crafty spinner was overlooked as the national selectors gave the nod to the in-form Kuldeep Yadav over him. Chahal was last seen in action during India's five-match T20I series against Ireland. He bagged five wickets in as many appearances. While he was also part of the Men in Blue side for the three ODI matches of the tour, he was benched throughout the series. Reacting to India's squad for the Asia Cup 2023, former South Africa captain Ab de Villers expressed disappointment over the exclusion of Yuzvendra Chahal. De Villiers pointed out that Chahal can be a very useful option with is leg-spin and is a smart operator. Speaking about the senior bowler's non-selection, he said on his YouTube channel: Rohit Sharma and Co. will open their Asia Cup campaign with a blockbuster clash against arch-rivals Pakistan at the Pallekele International Cricket Stadium in Sri Lanka on September 2. India's Asia Cup 2023 squad: Rohit Sharma (c), Shubman Gill, Virat Kohli, Shreyas Iyer, KL Rahul, Suryakumar Yadav, Tilak Varma, Ishan Kishan, Hardik Pandya (vc), Ravindra Jadeja, Axar Patel, Shardul Thakur, Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Kuldeep Yadav, Prasidh Krishna, Sanju Samson (travelling reserve). Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/cec24-16931604981884-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"Oval Invincibles crowned Hundred champions at Lord's as Tom Curran shows England what they're missing hitting an unbeaten 67","link":"https://www.dailymail.co.uk/sport/cricket/article-12451359/Oval-Invincibles-crowned-champions-Lords-Tom-Curran-shows-England-theyre-missing-hitting-unbeaten-67.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The 28-year-old, whose last international appearance was two years ago, missed out on the World Cup squad. He showed England what they will be missing with an outstanding display.","content":"Oval Invincibles crowned Hundred champions at Lord's as Tom Curran shows England what they're missing hitting an unbeaten 67 Tom Curran was the star of the show guiding Oval Invincibles to glory on Sunday They beat Manchester Originals in the final of the men's Hundred at Lord's Curran struck an unbeaten 67 and took 1-25 as his side claimed their first title By Gary Fitzgerald For The Daily Mail Updated: 17:37 EDT, 27 August 2023 e-mail View comments Tom Curran shrugged off his latest England rejection to help Oval Invincibles lift their first Hundred title at Lord’s. The 28-year-old, whose last international appearance was two years ago, missed out on the World Cup squad. He showed England what they will be missing with an outstanding all-round display as his unbeaten 67 and then 1-25 earned him a player of the match award in his side’s 14-run victory over Manchester Originals. And Curran insisted: ‘We deserved this win. I’m really happy and proud of the boys.’ Tom outshone younger brother Sam, who is in the 15-man party for the upcoming white ball clashes with New Zealand and the big October tournament in India. Oval Invincibles and Southern Brave were crowned champions of the men's and women's Hundred on Sunday evening Tom Curran (right) held the trophy with his brother Sam (left) as they both starred in the Invincibles win over Manchester Originals Curran was impressive with the bat scoring an unbeaten 67 and taking 1-25 to help his side claim their first Hundred title Sam made a first ball duck but Tom top scored in his side’s 161-5. He and Jimmy Neesham (57) rescued Invincibles after being put in by Jos Buttler and crumbling to 34-5. But their stunning 127-run sixth wicket partnership — after Jason Roy made a duck — proved crucial. Richard Gleeson was Originals’ best bowler with 2-37 but it was Curran who stole the spotlight. He turned wicket-taker when Originals set off to try and chase down the target, removing Phil Salt (25) before spinners Danny Briggs, Will Jacks and Nathan Sowter grabbed four wickets between them including Buttler for 11. Southern Brave were also victorious in the women's final claiming 34-run victory over Northern Superchargers Anya Shrubsole (right) signed off a glittering playing career leading Southern Brave to victory Max Holden smashed a quickfire 37 but he fell lbw to Sam Curran and Invincibles held strong for victory with Originals making just 147-6. Earlier, Anya Shrubsole signed off her glittering playing career by leading Southern Brave to victory in the women’s final. The former England hero was overwhelmed with emotion as she celebrated a 34-run win over Northern Superchargers. Shrubsole, 31, took a wicket on her last appearance and admitted: ‘I’m feeling a whole range of emotions.’ Share or comment on this article: Oval Invincibles crowned Hundred champions at Lord's as Tom Curran shows England what they're missing hitting an unbeaten 67 e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-27 21:37:04","image_url":"https://i.dailymail.co.uk/1s/2023/08/27/22/74776465-0-image-m-19_1693171753692.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Neyland's cricketers toast treble by lifting Harrison-Allen Bowl","link":"https://www.westerntelegraph.co.uk/sport/23750558.neylands-cricketers-toast-treble-lifting-harrison-allen-bowl/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Harrison-Allen Bowl Final 2023 – Sponsored by Puffin Produce:","content":"PEMBROKESHIRE's 2023 cricket champions Neyland toasted the treble as they lifted the Harrison-Allen Bowl with a solid win over Lawrenny in the final at Cresselly Cricket Club. Having already secured the division one title and the DR Morris Cup, Neyland (156 for 7 & 199 for 5) came through to beat Lawrenny (117 all out & 156 all out) by 81 runs. Ross Hardy was named as man of the match for his all-round contribution of 59 and 45 with the bat, and figures of 3 for 27 and 4 for 58 with the ball, plus two catches. On winning the toss, Lawrenny skipper Jamie Lewis invited Neyland to bat and openers Nick Koomen and Brad McDermott-Jenkins made a very bright start to the innings. They struck seven boundaries between them, before both were caught for 17, and when Paul Murray was also bowled Lawrenny's hopes were lifted with the score at 45 for 3. Ashley Sutton and Ross Hardy steadied matters for a while and the scoring rate slowed, but then Dai Davies came in and struck three boundaries in his unbeaten 30 runs. Hardy also stepped things up with one four and six sixes in his 59 and Sean Hannon added 10 before he was run out from the final ball to leave his side on 156 for 7. Kyle Marsh finished with 2 for 17 from two overs, before Lawrenny, after losing Finley Lewis, added 66 runs in good time from Kyle Marsh and James Phillips by the ninth over. Phillips made 21, with 4 fours, and Marsh went on to reach 48 in 35 balls, including 6 fours and 2 sixes, before Lawrenny collapsed from 69 for 1 to 117 all out in 20.4 overs. Troy Purslowe (12) and Tom Cole (14) and Ryan Morton (13) made double figures, but Andrew Miller took 4 for 21, Hardy claimed 3 for 27 and Nick Kooman took 3 for 30. After tea, Neyland lost Nick Koomen for 6, but McDermott-Jenkins and Sutton, with three sixes in his 30 runs, added 75 to positively take the score on to 101 in 13 overs. Paul Murray made a quick-fire 22, Hardy smashed 4 fours and 3 sixes in his 45 and McDermott-Jenkins added 3 fours and 6 sixes before eventually being caufght out. Morton had achieved figures of 2 for 48, but Neyland had raced to 199 for 5, leaving Lawrenny needing a massive 239 runs to deny the division one champions the treble. They were soon in trouble at 32 for 4 as key wickets fell to Hardy (4 for 68) and Patrick Hannon (2 for 37), although Morton struck 3 fours and 6 sixes in his top score of 62. Joe Kidney (28) also offered resistance, but Miller claimed 2 for 19 - and match figures of 6 for 40 - before veteran James Buckle also chipped in with a late 23 not out. Neyland secured an 81-run victory, and skipper Sean Hannon collected the coveted Harrison Allen Bowl from Mr Huw Harrison-Allen to complete a superb season. Meanwhile organisers have voiced disappointment at the behaviour by a small number of apparently drunken 'supporters' on the clubhouse verandah, which caused the game to be halted. There were repeated requests from announcer Richard Merriman to halt their bad language and lack of respect for some players, and they were eventually removed from that vantage point.","pubDate":"2023-08-27 19:56:01","image_url":"https://www.westerntelegraph.co.uk/resources/images/17162020/?type=app&htype=0","source_id":"western_telegraph","source_priority":553531,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Chopra wins India's first gold at world championships in javelin","link":"https://www.channelnewsasia.com/sport/chopra-wins-indias-first-gold-world-championships-javelin-3728461","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide 2022 Best News Website or Mobile Service Digital Media Awards Worldwide 2022 BUDAPEST: Olympic champion Neeraj Chopra became the first Indian to win a gold medal at the World Athletics Championships when he pipped Pakistan's Arshad Nadeem in the men's javelin on Sunday (Aug 27) with an 88.17 metre effort in the final. Chopra won Olympic gold in Tokyo but managed only a silver at the worlds in Eugene last year. The only other Indian to win a medal at the worlds was Anju Bobby George, who took bronze in the women's long jump in 2003 in Paris. Pakistan's Nadeem, coming back from elbow surgery and a knee injury, produced his season's best effort of 87.82 on his third attempt to win the silver medal, while the Czech Republic's Jakub Vadlejch took the bronze with 86.67. \"This was great. After the Olympic gold I really wanted to win the world championships. I just wanted to throw further. This is brilliant for the national team but it was my dream to win gold at the world championships,\" Chopra said. \"This has been a great championships for India and I am proud to bring another title to my country. I don't think I am the best thrower here. I wanted to throw more tonight. \"I wanted to throw more than 90m tonight but it needs all parts of the puzzle to be there. I couldn't put it all together this evening. Maybe next time.\" Chopra needed only one attempt in the qualification round to lead the field with a season-best 88.77 metres. But the Indian was unhappy with his first effort in the final, deliberately stepping over the line for a foul. Under pressure, the 25-year-old then soared into the lead on his second attempt, turning his back and celebrating in trademark fashion with his arms aloft while pointing at the sky immediately after his throw, knowing it was good. Nadeem was competing in his first event of the year and as soon as the javelin landed on his third attempt, he broke into a wide grin as he moved up to second. India and Pakistan may have a heated rivalry in cricket but on a warm night in Budapest, all eyes were on two athletes competing for javelin gold. But that was as close as Nadeem, the 2022 Commonwealth Games champion, got to Chopra as he ran out of steam. Julian Weber was very close to giving Germany their first medal in Budapest on the final day of the championships, but he was pushed down to fourth when Vadlejch saved his best for his fifth attempt. \"It was a big fight and I am afraid that Julian Weber will not like me anymore,\" Vadlejch said. Kishore Jena and DP Manu finished fifth and sixth, respectively, to give India three athletes in the top six.","pubDate":"2023-08-27 19:44:00","image_url":null,"source_id":"channelnewsasia","source_priority":37829,"country":["singapore"],"category":["sports"],"language":"english"},{"title":"PCB unveils ODI World Cup 2023 kit today","link":"https://en.dailypakistan.com.pk/27-Aug-2023/pcb-unveils-odi-world-cup-2023-kit-today","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE - The World Cup 2023 kit for Pakistan's cricket squad will be unveiled tomorrow in Lahore.","content":"LAHORE - The World Cup 2023 kit for Pakistan's cricket squad will be unveiled tomorrow in Lahore. The kit unveiling event will take place at Gaddafi Stadium at 3pm. Zaka Ashraf, the chairman of the Pakistan Cricket Board, will be the special guest at this significant occasion. For this major occasion, PCB has created a kit that is visually stunning. For the most hyped-up kit, PCB media earlier today also posted on 'X' (formerly Twitter). The Pakistani squad intends to leave for Hyderabad, India, on September 28 after the Asia Cup. On September 29, a round of exhibition games will get under way. On October 6, Pakistan will play its first World Cup encounter against the Netherlands.","pubDate":"2023-08-27 19:16:12","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-08-27/pcb-to-unveil-world-cup-kit-tomorrow-1693155554-1290.jpg","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"title":"‘I’m never the guy who will dodge a fight’: Usman Khawaja warns fans following ‘nasty’ Ashes tour","link":"https://thewest.com.au/news/im-never-the-guy-who-will-dodge-a-fight-usman-khawaja-warns-fans-following-nasty-ashes-tour-c-11724369","keywords":null,"creator":["Martin Gabor"],"video_url":null,"description":"Usman Khawaja wasn’t afraid to call out fans who crossed the line in England, and he’s warned others that he’ll continue to fight back if it continues.","content":"Test opener Usman Khawaja says he’ll always stand up for himself and his teammates if fans cross the line with their abuse following an Ashes series marred by ugly altercations between English supporters and Australian players. Khawaja and Marnus Labuschagne copped abuse from a fan as they were leaving the field during the final Test at the Oval where they were accused of playing “boring” cricket in a series that finished 2-2. But the ugliest moment came in the second Test at Lord’s when members of the Marylebone Cricket Club hurled vile abuse and got in the faces of Australian players after English wicketkeeper Jonny Bairstow was controversially stumped. Several members of the exclusive club were suspended after video footage showed them calling Australian players “cheats” in an aggressive tirade that earnt the ire of Khawaja and his teammates. There’s long been a mutual respect between the two teams, with the 2005 series going down as the greatest in history as England finally regained the Urn after weeks of drama, but Khawaja says the recent tour crossed a line. “The English summer this time was very different. This was my third English summer away for the Ashes and I’ve been there for a World Cup, but this was a different vibe,” he said. “It was a little nastier than anything I’ve experienced in the past and a little bit more in your face. “I don’t know if that was because of the whole Bazball thing or us being the so-called ‘villains’ over there. “There’s always been banter over there, but it’s usually more respectful. Maybe that’s where the game is going, and if that’s where it is, then that’s a bit unfortunate.” The veteran opener is a lover of all sports and has seen crowd interactions get more heated in the NBA in recent years, with controversial superstar Kyrie Irving often targeted, which has led to spectators getting kicked out of arenas. He fears it could start creeping into other sports and it’s why Khawaja will continue to bite back if he feels that fans are being disrespectful. “I’ve never been a big fan of the crowd being able to say whatever they want, and that’s in Australia, England or anywhere in the world,” he said. “If I feel like they’ve crossed my line – I say my line because I feel everyone’s line is different – and if I feel they’ve gone too far with me, then I’ll always pull them up. “I’ll never shy away from that because I’m never the guy who will dodge a fight. If you’re disrespectful to me, then I have a right to come back at you. “I love sport and seeing fans get involved with sport, but I think we still have a long way to go. “We see it a lot in basketball these days when fans get up close and personal, and we’re seeing it in cricket as well when we go to the change rooms and there are people right next to you. “If you’re in a privileged position where you get to be shoulder to shoulder with the athletes, then you need to be respectful.” The 36-year-old is long odds to be on the next Ashes tour, but he needn’t worry, with Khawaja signing on to join the Fox Cricket commentary team once he retires. Khawaja has grown up watching Fox Sports and even remembers the old channel numbers from when he was a kid. He’s promised to hold nothing back when he switches the bat and gloves for the microphone. “I think I’ll be myself, and without even meaning to I end up stirring the pot a little bit,” he said. “I don’t mean to but I just speak openly from the heart. “I’ve always felt that as long as you’re respectful, then you can voice your opinion how you want to. I’ve always tried to be quite respectful, but I also won’t shy away from hard conversations because I’m not a fence-sitter. “If I have an opinion then I’ll say it, especially if I feel it’s valid and that it will add something to the conversation. “On top of that, I’m ready to have some fun. If anyone knows me, I’m all about fun and I try to bring that everywhere. Hopefully, I can bring that into the commentary.” Originally published as ‘I’m never the guy who will dodge a fight’: Usman Khawaja warns fans following ‘nasty’ Ashes tour Sign up for our emails","pubDate":"2023-08-27 23:56:14","image_url":"https://images.thewest.com.au/publication/C-11724369/7617aa33463643810cd43ed8d20a805540d0d359-16x9-x0y61w648h365.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"title":"[Watch] 41-year-old Fidel Edwards dismisses Kamran Akmal for a golden duck in US Masters T10 Final","link":"https://www.sportskeeda.com/cricket/watch-41-year-old-fidel-edwards-dismisses-kamran-akmal-golden-duck-us-masters-t10-final","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Fidel Edwards did not allow Kamran Akmal to score a single run in the US Masters T10 League 2023 Final. The Caribbean pacer dismissed the Pakistani batter for a golden duck off the opening ball of the contest between New York Warriors and Texas Chargers. The final of the US Masters T10 League got underway earlier today in Florida. New York Warriors are up against the Texas Chargers in the summit clash of the inaugural edition of US Masters T10. Texas Chargers won the toss and opted to field first. Kamran Akmal came out to open the batting for New York Warriors along with former Sri Lankan captain, TM Dilshan. Fidel Edwards charged in with the new ball to open the bowling for the Chargers. Edwards bowled a short delivery straightaway. Akmal tried to pull it towards the mid-wicket region. However, he could not time the shot to perfection and ended up chopping the ball onto his stumps. Akmal was in decent touch during the previous games. He scored an eight-ball 23 for New York Warriors during their match against Morrisville Unity, while in the previous battle against the Texas Chargers, he scored 15 runs off 11 balls. Although Edwards started the final with a wicket off the first ball, he could not add more wickets to his tally in the summit clash. He completed his quota of two overs for the Texas Chargers and ended with figures of 1/21. Jonathan Carter played a brilliant knock of 39 runs from 16 deliveries for the New York Warriors, helping them post a 92-run total on the board. Chasing 93 for a win, the Texas Chargers have started well. It will be interesting to see which team wins the inaugural edition of US Masters T10 League. Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/65975-16931585995751-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"Shahid Afridi defends 1 run off 2 balls in US Masters T10 League Final, takes match into Super Over","link":"https://www.sportskeeda.com/cricket/news-shahid-afridi-defends-1-run-2-balls-us-masters-t10-league-final-takes-match-super-over","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Shahid Afridi once again proved himself as one of the biggest game-changers in cricket history by defending one run off two balls in the final of the US Masters T10 League. Playing for the New York Warriors, the 46-year-old Pakistan legend came to defend nine runs off the last six balls. Neil Broom and Sohail Tanvir were batting in the middle for the Texas Chargers. They took two runs off the first three balls before Tanvir whacked the fourth delivery for a maximum. With one run needed off two deliveries, the Texas Chargers were the favorites to win the match. However, Shahid Afridi dismissed Tanvir on the next ball. Fidel Edwards came out to bat next, with Texas requiring one run off one delivery. Edwards could not read Afridi's delivery as he was trapped in front of his stumps LBW. The match ended in a tie, forcing a Super Over between New York Warriors and Texas Chargers in the US Masters T10 League Final. Afridi had a forgettable outing with the bat in the first innings, managing only one run off two balls before handing a catch to Fidel Edwards off Ehsan Adil's bowling. Texas Chargers batted first in the one-over eliminator and scored 15 runs. Ben Dunk scored six runs off two balls, while Mohammad Hafeez and Muktar Ahmed were not out on one and eight, respectively. Sohail Khan bowled the Super Over for the New York Warriors. Chasing 16 for a win, New York sent Shahid Afridi and Jonathan Carter in the middle. Afridi took a single on the first ball bowled by Sohail Tanvir. Carter hit a four and then rotated the strike. Afridi surprisingly refused for a single on the fourth ball, bringing the equation down to 10 off two. Afridi went for a big shot on the fifth ball, but Tanvir got the top edge of his bat, resulting in only one run. Jonathan Carter hit a six on the last ball as the Texas Chargers won by two runs. Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/fd57b-16931620224454-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"[Watch] Shahid Afridi loses his wicket for 1 run in US Masters T10 League Final","link":"https://www.sportskeeda.com/cricket/news-watch-shahid-afridi-loses-wicket-1-run-us-masters-t10-league-final","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Shahid Afridi could not make much of an impact with the bat for the New York Warriors in the US Masters T10 League Final against the Texas Chargers. The Pakistan legend got out for one run off two balls in the big game. Coming out to bat at number five for the New York Warriors when the team was down to 41/3 in the sixth over, Afridi tried for a big shot towards the leg-side on the second ball itself. He tried to send a delivery from Ehsan Adil outside the boundary line. However, the timing was not perfect. The ball ended up landing in the hands of Fidel Edwards , who was standing in the deep. Afridi was in good touch with the bat during the previous matches of US Masters T10 League. The all-rounder smacked a 11-ball 22 against Morrisville Unity, while in the previous game against the Texas Chargers, he smacked an eight-ball 18. Afridi also scored 22 runs off 14 balls against Atlanta Riders. Regarded by many as the biggest match-winner in Pakistan cricket history, Shahid Afridi made his presence felt in the bowling department later in the US Masters T10 League Final. Afridi had to defend nine runs off the last over against the Texas Chargers. The legendary all-rounder kept his nerve and conceded eight runs. He gave away eight runs off the first four balls only. Afridi then dismissed Sohail Tanvir and Fidel Edwards off the last two deliveries to help the New York Warriors take the match into a Super Over. Texas Chargers batted first and scored 15 runs in the Super Over. New York Warriors tried their bset to chase down the 16-run target, but could only muster up 11, crowning the Chargers as champions of the US Masters T10 League. Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/9c335-16931604561390-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"CPL 2023: Match 12, St Kitts and Nevis Patriots vs Trinbago Knight Riders: Probable XIs, Pitch Report, Weather Forecast, and Live Streaming","link":"https://www.sportskeeda.com/cricket/cpl-2023-match-12-st-kitts-nevis-patriots-vs-trinbago-knight-riders-probable-xis-pitch-report-weather-forecast-live-streaming","keywords":["Cricket"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":"St Kitts and Nevis Patriots and Trinbago Knight Riders will lock horns in Match 12 of the Caribbean Premier League 2023 on Sunday, August 27 (Monday, August 28 in India). The Warner Park in Basseterre, St Kitts will play host to this match. The Patriots, led by Evin Lewis, are placed fifth in the points table with a net run rate of -1.989. Out of five matches, the Patriots are yet to see the face of victory. While they have lost three, two games ended in no result. The Patriots will go into the match after losing to Barbados Royals by six wickets. After setting up a massive target of 198 for the opponents to chase down, the Patriots' bowlers faltered as the Royals romped home with nine balls to spare. The Knight Riders, led by Kieron Pollard, need to find their feet at the earliest to climb the ladder. They are currently placed at the bottom of the table with a net run rate of -2.700. They will go into the game after losing to Faf du Plessis' Saint Lucia Kings by 54 runs. After being asked to chase down a challenging target of 168, the Knights folded for 113 in 14.5 overs. Match : St Kitts and Nevis Patriots vs Trinbago Knight Riders, Match 12, Caribbean Premier League 2023 Date and Time : August 28, 2023, Monday, 04:30 am IST Venue : Warner Park, Basseterre, St Kitts The pitch at the venue in St Kitts has been an excellent one for the batters until now. Teams should opt to field first after winning the toss. There is no chance of rain for the time being in St Kitts. Temperatures will be around 28 degrees Celsius. St Kitts and Nevis Patriots Evin Lewis (c), Andre Fletcher , Joshua Da Silva (wk), Ambati Rayudu, Sherfane Rutherford, Dominic Drakes, Jyd Goolie, Corbin Bosch, Izharulhaq Naveed, Ashmead Nedd, Oshane Thomas Trinbago Knight Riders Martin Guptill, Mark Deyal , Chadwick Walton, Nicholas Pooran (wk), Kieron Pollard (c), Andre Russell, Dwayne Bravo, Sunil Narine , Akeal Hosein, Ali Khan, Jaden Carmichael Both St Kitts and Nevis Patriots and Trinbago Knight Riders are yet to open their account in the tournament. But the Knights will be fancying their chances as the Patriots are completely out of form. Prediction: Trinbago Knight Riders to win this Caribbean Premier League 2023 match TV : N/A Live Streaming : Fancode Poll : Ambati Rayudu to score a half-century? Yes No 1 votes Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/1a615-16931607186170-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"[In Pictures] \"Living the Miami life\" - Dhanashree Verma gives fans a glimpse of her vacation with Yuzvendra Chahal","link":"https://www.sportskeeda.com/cricket/news-in-pictures-living-miami-life-dhanashree-verma-gives-fans-glimpse-vacation-yuzvendra-chahal","keywords":["Cricket"],"creator":["Aditya Suketu Desai"],"video_url":null,"description":null,"content":"Team India leg spinner, Yuzvendra Chahal, is making the most of his time away from the game. The cricket star is rejuvenating himself with a vacation in Miami alongside his wife, Dhanashree Verma. Taking to her Instagram handle on Sunday, August 27, Dhanashree shared a few pictures from the trip to give fans a glimpse of their recent getaway. Captioning the post, she wrote: Instagram Post Notably, Yuzvendra Chahal failed to make it to India's squad for the upcoming Asia Cup 2023 . The crafty spinner was overlooked as the national selectors gave the nod to the in-form Kuldeep Yadav over him. Chahal was last seen in action during India's five-match T20I series against Ireland. He bagged five wickets in as many appearances. While he was also part of the Men in Blue side for the three ODI matches of the tour, he was benched throughout the series. Reacting to India's squad for the Asia Cup 2023, former South Africa captain Ab de Villers expressed disappointment over the exclusion of Yuzvendra Chahal. De Villiers pointed out that Chahal can be a very useful option with is leg-spin and is a smart operator. Speaking about the senior bowler's non-selection, he said on his YouTube channel: Rohit Sharma and Co. will open their Asia Cup campaign with a blockbuster clash against arch-rivals Pakistan at the Pallekele International Cricket Stadium in Sri Lanka on September 2. India's Asia Cup 2023 squad: Rohit Sharma (c), Shubman Gill, Virat Kohli, Shreyas Iyer, KL Rahul, Suryakumar Yadav, Tilak Varma, Ishan Kishan, Hardik Pandya (vc), Ravindra Jadeja, Axar Patel, Shardul Thakur, Jasprit Bumrah, Mohammed Shami, Mohammed Siraj, Kuldeep Yadav, Prasidh Krishna, Sanju Samson (travelling reserve). Quick Links","pubDate":"2023-08-27 22:52:37","image_url":"https://staticc.sportskeeda.com/editor/2023/08/cec24-16931604981884-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"Oval Invincibles crowned Hundred champions at Lord's as Tom Curran shows England what they're missing hitting an unbeaten 67","link":"https://www.dailymail.co.uk/sport/cricket/article-12451359/Oval-Invincibles-crowned-champions-Lords-Tom-Curran-shows-England-theyre-missing-hitting-unbeaten-67.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The 28-year-old, whose last international appearance was two years ago, missed out on the World Cup squad. He showed England what they will be missing with an outstanding display.","content":"Oval Invincibles crowned Hundred champions at Lord's as Tom Curran shows England what they're missing hitting an unbeaten 67 Tom Curran was the star of the show guiding Oval Invincibles to glory on Sunday They beat Manchester Originals in the final of the men's Hundred at Lord's Curran struck an unbeaten 67 and took 1-25 as his side claimed their first title By Gary Fitzgerald For The Daily Mail Updated: 17:37 EDT, 27 August 2023 e-mail View comments Tom Curran shrugged off his latest England rejection to help Oval Invincibles lift their first Hundred title at Lord’s. The 28-year-old, whose last international appearance was two years ago, missed out on the World Cup squad. He showed England what they will be missing with an outstanding all-round display as his unbeaten 67 and then 1-25 earned him a player of the match award in his side’s 14-run victory over Manchester Originals. And Curran insisted: ‘We deserved this win. I’m really happy and proud of the boys.’ Tom outshone younger brother Sam, who is in the 15-man party for the upcoming white ball clashes with New Zealand and the big October tournament in India. Oval Invincibles and Southern Brave were crowned champions of the men's and women's Hundred on Sunday evening Tom Curran (right) held the trophy with his brother Sam (left) as they both starred in the Invincibles win over Manchester Originals Curran was impressive with the bat scoring an unbeaten 67 and taking 1-25 to help his side claim their first Hundred title Sam made a first ball duck but Tom top scored in his side’s 161-5. He and Jimmy Neesham (57) rescued Invincibles after being put in by Jos Buttler and crumbling to 34-5. But their stunning 127-run sixth wicket partnership — after Jason Roy made a duck — proved crucial. Richard Gleeson was Originals’ best bowler with 2-37 but it was Curran who stole the spotlight. He turned wicket-taker when Originals set off to try and chase down the target, removing Phil Salt (25) before spinners Danny Briggs, Will Jacks and Nathan Sowter grabbed four wickets between them including Buttler for 11. Southern Brave were also victorious in the women's final claiming 34-run victory over Northern Superchargers Anya Shrubsole (right) signed off a glittering playing career leading Southern Brave to victory Max Holden smashed a quickfire 37 but he fell lbw to Sam Curran and Invincibles held strong for victory with Originals making just 147-6. Earlier, Anya Shrubsole signed off her glittering playing career by leading Southern Brave to victory in the women’s final. The former England hero was overwhelmed with emotion as she celebrated a 34-run win over Northern Superchargers. Shrubsole, 31, took a wicket on her last appearance and admitted: ‘I’m feeling a whole range of emotions.’ Share or comment on this article: Oval Invincibles crowned Hundred champions at Lord's as Tom Curran shows England what they're missing hitting an unbeaten 67 e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-27 21:37:04","image_url":"https://i.dailymail.co.uk/1s/2023/08/27/22/74776465-0-image-m-19_1693171753692.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Neyland's cricketers toast treble by lifting Harrison-Allen Bowl","link":"https://www.westerntelegraph.co.uk/sport/23750558.neylands-cricketers-toast-treble-lifting-harrison-allen-bowl/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Harrison-Allen Bowl Final 2023 – Sponsored by Puffin Produce:","content":"PEMBROKESHIRE's 2023 cricket champions Neyland toasted the treble as they lifted the Harrison-Allen Bowl with a solid win over Lawrenny in the final at Cresselly Cricket Club. Having already secured the division one title and the DR Morris Cup, Neyland (156 for 7 & 199 for 5) came through to beat Lawrenny (117 all out & 156 all out) by 81 runs. Ross Hardy was named as man of the match for his all-round contribution of 59 and 45 with the bat, and figures of 3 for 27 and 4 for 58 with the ball, plus two catches. On winning the toss, Lawrenny skipper Jamie Lewis invited Neyland to bat and openers Nick Koomen and Brad McDermott-Jenkins made a very bright start to the innings. They struck seven boundaries between them, before both were caught for 17, and when Paul Murray was also bowled Lawrenny's hopes were lifted with the score at 45 for 3. Ashley Sutton and Ross Hardy steadied matters for a while and the scoring rate slowed, but then Dai Davies came in and struck three boundaries in his unbeaten 30 runs. Hardy also stepped things up with one four and six sixes in his 59 and Sean Hannon added 10 before he was run out from the final ball to leave his side on 156 for 7. Kyle Marsh finished with 2 for 17 from two overs, before Lawrenny, after losing Finley Lewis, added 66 runs in good time from Kyle Marsh and James Phillips by the ninth over. Phillips made 21, with 4 fours, and Marsh went on to reach 48 in 35 balls, including 6 fours and 2 sixes, before Lawrenny collapsed from 69 for 1 to 117 all out in 20.4 overs. Troy Purslowe (12) and Tom Cole (14) and Ryan Morton (13) made double figures, but Andrew Miller took 4 for 21, Hardy claimed 3 for 27 and Nick Kooman took 3 for 30. After tea, Neyland lost Nick Koomen for 6, but McDermott-Jenkins and Sutton, with three sixes in his 30 runs, added 75 to positively take the score on to 101 in 13 overs. Paul Murray made a quick-fire 22, Hardy smashed 4 fours and 3 sixes in his 45 and McDermott-Jenkins added 3 fours and 6 sixes before eventually being caufght out. Morton had achieved figures of 2 for 48, but Neyland had raced to 199 for 5, leaving Lawrenny needing a massive 239 runs to deny the division one champions the treble. They were soon in trouble at 32 for 4 as key wickets fell to Hardy (4 for 68) and Patrick Hannon (2 for 37), although Morton struck 3 fours and 6 sixes in his top score of 62. Joe Kidney (28) also offered resistance, but Miller claimed 2 for 19 - and match figures of 6 for 40 - before veteran James Buckle also chipped in with a late 23 not out. Neyland secured an 81-run victory, and skipper Sean Hannon collected the coveted Harrison Allen Bowl from Mr Huw Harrison-Allen to complete a superb season. Meanwhile organisers have voiced disappointment at the behaviour by a small number of apparently drunken 'supporters' on the clubhouse verandah, which caused the game to be halted. There were repeated requests from announcer Richard Merriman to halt their bad language and lack of respect for some players, and they were eventually removed from that vantage point.","pubDate":"2023-08-27 19:56:01","image_url":"https://www.westerntelegraph.co.uk/resources/images/17162020/?type=app&htype=0","source_id":"western_telegraph","source_priority":553531,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Chopra wins India's first gold at world championships in javelin","link":"https://www.channelnewsasia.com/sport/chopra-wins-indias-first-gold-world-championships-javelin-3728461","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide 2022 Best News Website or Mobile Service Digital Media Awards Worldwide 2022 BUDAPEST: Olympic champion Neeraj Chopra became the first Indian to win a gold medal at the World Athletics Championships when he pipped Pakistan's Arshad Nadeem in the men's javelin on Sunday (Aug 27) with an 88.17 metre effort in the final. Chopra won Olympic gold in Tokyo but managed only a silver at the worlds in Eugene last year. The only other Indian to win a medal at the worlds was Anju Bobby George, who took bronze in the women's long jump in 2003 in Paris. Pakistan's Nadeem, coming back from elbow surgery and a knee injury, produced his season's best effort of 87.82 on his third attempt to win the silver medal, while the Czech Republic's Jakub Vadlejch took the bronze with 86.67. \"This was great. After the Olympic gold I really wanted to win the world championships. I just wanted to throw further. This is brilliant for the national team but it was my dream to win gold at the world championships,\" Chopra said. \"This has been a great championships for India and I am proud to bring another title to my country. I don't think I am the best thrower here. I wanted to throw more tonight. \"I wanted to throw more than 90m tonight but it needs all parts of the puzzle to be there. I couldn't put it all together this evening. Maybe next time.\" Chopra needed only one attempt in the qualification round to lead the field with a season-best 88.77 metres. But the Indian was unhappy with his first effort in the final, deliberately stepping over the line for a foul. Under pressure, the 25-year-old then soared into the lead on his second attempt, turning his back and celebrating in trademark fashion with his arms aloft while pointing at the sky immediately after his throw, knowing it was good. Nadeem was competing in his first event of the year and as soon as the javelin landed on his third attempt, he broke into a wide grin as he moved up to second. India and Pakistan may have a heated rivalry in cricket but on a warm night in Budapest, all eyes were on two athletes competing for javelin gold. But that was as close as Nadeem, the 2022 Commonwealth Games champion, got to Chopra as he ran out of steam. Julian Weber was very close to giving Germany their first medal in Budapest on the final day of the championships, but he was pushed down to fourth when Vadlejch saved his best for his fifth attempt. \"It was a big fight and I am afraid that Julian Weber will not like me anymore,\" Vadlejch said. Kishore Jena and DP Manu finished fifth and sixth, respectively, to give India three athletes in the top six.","pubDate":"2023-08-27 19:44:00","image_url":null,"source_id":"channelnewsasia","source_priority":37829,"country":["singapore"],"category":["sports"],"language":"english"},{"title":"PCB unveils ODI World Cup 2023 kit today","link":"https://en.dailypakistan.com.pk/27-Aug-2023/pcb-unveils-odi-world-cup-2023-kit-today","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE - The World Cup 2023 kit for Pakistan's cricket squad will be unveiled tomorrow in Lahore.","content":"LAHORE - The World Cup 2023 kit for Pakistan's cricket squad will be unveiled tomorrow in Lahore. The kit unveiling event will take place at Gaddafi Stadium at 3pm. Zaka Ashraf, the chairman of the Pakistan Cricket Board, will be the special guest at this significant occasion. For this major occasion, PCB has created a kit that is visually stunning. For the most hyped-up kit, PCB media earlier today also posted on 'X' (formerly Twitter). The Pakistani squad intends to leave for Hyderabad, India, on September 28 after the Asia Cup. On September 29, a round of exhibition games will get under way. On October 6, Pakistan will play its first World Cup encounter against the Netherlands.","pubDate":"2023-08-27 19:16:12","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-08-27/pcb-to-unveil-world-cup-kit-tomorrow-1693155554-1290.jpg","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"}]}