{"newsArray":[{"title":"An underdog, a positive approach and the victory no one saw coming","link":"http://island.lk/an-underdog-a-positive-approach-and-the-victory-no-one-saw-coming/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"By Reemus Fernando Royal beat the odds to register a stunning 180 runs victory against their arch-rivals S. Thomas’ at the 144th Battle of the Blues at the SSC on Saturday. It was a victory no one saw coming as the outfit trained by Rohan Soysa entered the annual battle as underdogs. Royal’s back-to-back defeats […]","content":"Royal beat the odds to register a stunning 180 runs victory against their arch-rivals S. Thomas’ at the 144th Battle of the Blues at the SSC on Saturday. It was a victory no one saw coming as the outfit trained by Rohan Soysa entered the annual battle as underdogs. Royal’s back-to-back defeats at the hands of Trinity in the run up to the historic encounter were overshadowing even the couple of victories they had registered during the season and the fact that they had reached the quarter-finals at the end of the league stage. Reaching the last eight of the tournament was something their arch-rivals had failed to achieve. S. Thomas’ on the other hand had remained unbeaten though they failed to reach the business end of the tournament. Both teams had wanted to bowl first under overcast conditions on day one and the Thomians had the ideal start to the annual battle as they took the first three wickets for just 19 runs. That was when Dasis Manchanayake came to the crease. The new ball was just eight overs old when he started the repair job with Ovina Ambanpola. Despite the early damage, the Royalists stayed positive. “Manchanayake’s approach was decisive,” said Royal coach Rohan Soysa following the victory. Manchanayake rewarded for staying positive in adversity After being four wickets down for 63 runs at one stage, Royal recovered to post 326 runs for eight wickets declared thanks to the record-breaking partnership put on by Manchanayake and Ramiru Perera. The stage for victory was built on that partnership as the pair put on 229 runs off 293 balls. In the process the pair broke a 70-year-old partnership record for the fifth wicket. Manchanayake stayed there for five hours as they disappointed Thomians during an entire second session. There was no turning back for Royal from then on as they won all sessions.Few expected Royal to declare on their overnight score under clear skies on day two morning. By lunch they had accounted for four top-order batsmen in the Thomian innings except for opener Senadhi Bulankulame. By tea on day two Royal were in complete command as they dismissed their opponents for 153 runs and they needed just 26 overs in the final session to amass 168 runs for the loss of four wickets. Manchanayake entered the Battle of the Blues record books as the only Royal captain to score a century and a half-century in a match. In history only two batsmen had done that (M. Thotiwilage 95 and 108 in 2001 and Ganganath Rathnayake 75 and 111n.o. in 2011). What was more remarkable was the fact that the rare achievement coincided with victory. Ramiru Perera too could have earned the rare achievement had not Royal declared their innings on the overnight score on day three morning. Perera was unbeaten on 46 runs. Incidentally, of the players who batted, Royal had only three batsmen reaching double figures in the first innings. And in the second innings apart from Manchanayake and Perera, Uvindu Weerasekara was the only batsman to top 20 runs. Royal’s Sri Lanka Under 19 player Sineth Jayawardena (1 & 4) failed in both innings. Royal and two other schools had received exemptions from Sri Lanka Cricket to field their Sri Lanka Under 19 players in the weekend’s Big Matches despite Sri Lanka Under 19 leaving for UAE for a tournament. As expected pacemen played a crucial role in the match. Ranuka Malaviarachchi, Bulan Weerathunga and Sandesh Ramanayake accounted for ten wickets in the match with the latter becoming the third brother of the Ramanayake family to associate with a Royal victory. Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.”","pubDate":"2023-03-20 00:01:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"New Zealand on top despite Karunaratne’s twin fifties","link":"http://island.lk/new-zealand-on-top-despite-karunaratnes-twin-fifties/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, […]","content":"New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.” Published on By Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( )","pubDate":"2023-03-19 23:40:42","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Starc’s five-for, Marsh-Head century stand sink India for 1-1","link":"http://island.lk/starcs-five-for-marsh-head-century-stand-sink-india-for-1-1/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc […]","content":"Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.” Published on By Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( )","pubDate":"2023-03-19 23:40:39","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Hope: WI ‘trying everything’ to turn around ODI fortunes","link":"http://island.lk/hope-wi-trying-everything-to-turn-around-odi-fortunes/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him […]","content":"A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.” Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( )","pubDate":"2023-03-19 23:40:27","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Novak Djokovic to miss Miami Open over vaccine status","link":"http://island.lk/novak-djokovic-to-miss-miami-open-over-vaccine-status/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis […]","content":"Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( ) Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.”","pubDate":"2023-03-19 23:40:11","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India vs Australia 3rd ODI pitch report: Chennai pitch report Chidambaram Stadium IND vs AUS 3rd ODI","link":"https://thesportsrush.com/cricket-news-india-vs-australia-3rd-odi-pitch-report-chennai-pitch-report-chidambaram-stadium-ind-vs-aus-3rd-odi/","keywords":["Cricket","Australia tour of India 2023","Chennai","MA Chidambaram Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"After registering a resilient victory during the first ODI in Mumbai, team India faced their biggest ever defeat in the format history tonight in Vishakhapatnam, as the Aussie opening pair of Travis Head (51* off 30) and Mitchell Marsh (66* off 36) chased down the target of 118 in mere 11 Overs. The action for… The post India vs Australia 3rd ODI pitch report: Chennai pitch report Chidambaram Stadium IND vs AUS 3rd ODI appeared first on The SportsRush.","content":"After registering a resilient victory during the first ODI in Mumbai, team India faced their biggest ever defeat in the format history tonight in Vishakhapatnam, as the Aussie opening pair of Travis Head (51* off 30) and Mitchell Marsh (66* off 36) chased down the target of 118 in mere 11 Overs. The action for the third and final match of the series will take place at the MA Chidambaram Stadium in Chennai, on March 22 (Wednesday). No points for guessing that the visitors would be really high in confidence comparatively going into the final ODI, but looking at team India’s knack of nailing the the series deciders in the past few White Ball series, one can really expect a neck-to-neck battle on Wednesday. India vs Australia 3rd ODI pitch report The average score across the 21 completed ODIs which have taken place at the MA Chidambaram Stadium in Chennai since 1987, has been 259 runs. The pitch at this venue since the past few years has generally been on the slower side, and the spinners have had much of the say in the match proceedings. Chasing totals at this venue has been a challenging task, with the dry pitch getting slower as match progresses. Batting is expected to be relatively easy during the first innings, when the batters will be able to get on top of the bounce and play shots through the line. This will also be the ripe time for the pacers to get some inroads, who would have to later rely on their variations to have the better of the batters. All in all, expect a much better contest between bat and bowl in Chennai during the third ODI. West Indies humbled India during the last ODI in Chennai The previous ODI at this venue took place in December 2019, when India took on the West Indies. Expecting to post a challenging total with the pitch expected to play slow during the latter half, skipper Virat Kohli was in for a surprise. The pitch in fact, got quicker under the lights and the Windies chased down the target of 288 with eight wickets in hand, and 13 deliveries to spare. The post India vs Australia 3rd ODI pitch report: Chennai pitch report Chidambaram Stadium IND vs AUS 3rd ODI appeared first on The SportsRush.","pubDate":"2023-03-19 17:39:46","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"IND vs AUS: सूर्या को आखिर हुआ क्या, मिचेल स्टार्क ने लगातार दो बार पहली ही गेंद पर कैसे किया आउट, मैच के बाद बताया","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/india-vs-australia-how-mitchell-starc-trapped-suryakumar-yadav-in-consecutive-two-odis/articleshow/98777828.cms","keywords":null,"creator":null,"video_url":null,"description":"Suryakumar yadav vs Mitchell Starc: टी-20 के नंबर-1 बल्लेबाज सूर्यकुमार यादव वनडे फॉर्मेट में लगातार फेल हो रहे हैं। ऑस्ट्रेलिया के खिलाफ शुरुआती दोनों वनडे में वह बिना खाता खोले पहली ही गेंद पर चलने बने।","content":"भारत को ऑस्ट्रेलिया के खिलाफ अपनी सबसे खराब वनडे हार का सामना करना पड़ा, जिसमें मेहमान टीम ने 10 विकेट से जीत दर्ज की और तीन मैचों की श्रृंखला 1-1 से बराबर की। मिचेल स्टार्क ने पावरप्ले में भारत के पूरे टॉप ऑर्डर को ही समेट दिया। बाएं हाथ के इस तेज गेंदबाज ने पावरप्ले में चार विकेट की बदौलत 53 रन देकर पांच विकेट चटकाए। अपने इस चमत्कारिक खेल के बाद मैन ऑफ द मैच चुने गए स्टार्क का मानना है कि शुरुआती विकेट लेने के बाद ही उनके जोड़ीदार भी जोश में आ गए, जिससे भारत को महज 26 ओवर में 117 रन पर समेटने में कामयाबी मिली। मिचेल स्टार्क ने कहा, ‘यह हमारा पूरी तरह से दबदबे वाला गेंदबाजी प्रदर्शन था, बल्कि हमने पावरप्ले में विकेट झटके, जिससे हमें पूरी पारी के दौरान और अधिक आक्रामकता से गेंदबाजी करने में मदद मिली।’ उन्होंने साथ ही कहा कि बल्लेबाजी के दौरान उनकी आक्रामकता का कारण भी भारत को कम स्कोर पर समेटना रहा। उन्होंने कहा, ‘इतने कम स्कोर के लक्ष्य का पीछा करना था, हम पावरप्ले में आक्रामक बल्लेबाजी कर सकते थे। और मिच (मार्श) और ट्राव (ट्रेविस हेड) ने बल्ले से शानदार प्रदर्शन किया।’ यह पूछने पर कि क्या सूर्यकुमार यादव के खिलाफ उन्होंने कोई योजना बनाई थी क्योंकि वह लगातार दूसरी बार इस गेंदबाज की पहली गेंद पर शून्य पर आउट हुए। इस पर स्टार्क ने कहा, ‘मैं नहीं कह सकता हूं कि मैंने इसे तरीके से सोचा था कि कौन बल्लेबाज है। मेरे लिए योजना नहीं बदलती, भले ही वो बाएं हाथ का बल्लेबाज हो या फिर दाएं हाथ का बल्लेबाज। मैं तेज गेंदबाजी के साथ स्विंग और स्टंप हिट करने की कोशिश करता हूं। मेरी योजना में पिछले 13 साल से बदलाव नहीं हुआ है जो स्टंप पर गेंदबाजी करने और स्विंग करने की होती है। मेरी भूमिका पावरप्ले में विकेट चटकाने की कोशिश करने की है।’","pubDate":"2023-03-19 17:25:01","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Shahid Afridi Obliges A Fan With An Autograph On Indian Flag","link":"https://www.thetimesofbengal.com/sports/shahid-afridi-obliges-a-fan-with-an-autograph-on-indian-flag/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Shahid Afridi Obliges A Fan With An Autograph On Indian Flag | Watch Viral Video Shahid Afridi is currently representing Asia Lions in the Legends League Cricket in Doha.\r Shahid Afridi is the captain of Asia Lions in Legends League Cricket. (Image: Twitter) Doha: In a sweet gesture, former Pakistan captain Shahid Afridi […]","content":"Doha: In a sweet gesture, former Pakistan captain Shahid Afridi respectfully gave an autograph to a fan o the Indian flag, the video of which went viral on social media. Afridi is currently playing for Asia Lions in the Legends League Cricket. The incident happened during Asia Lions’ travelling on Saturday after defeating India Maharajas in the LLC Eliminator match in Doha. Afridi had just got on the team bus when a fan came up to him with an Indian flag and asked for an autograph. Afridi oblighed the fan who returned with a smile on his face. Here is the video. Meanwhile, Afridi’s Asia Lions registered a 85-run victory against India Maharajas to make their way into the final. They will be facing World Giants in the summit clash. Talking about the game, Asia Lions posted 191/5 in 20 overs, thanks to Upul Tharanga’s 50 off 31 balls and Mohammad Hafeez’s 38 off 24 balls. In reply, Maharajas were all out for 106 with Sohail Tanvir, Abdur Razzak and Hafeez taking two wickets each. For India Maharajas, captain Gautam Gambhir top-scored with 32 runs off 17 balls. In bowling, Stuart Binny and Pragyan Ojha took two wickets each. Source link","pubDate":"2023-03-19 17:17:54","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Kenneth Waiswa ton inspires Cricket Cranes in Qatar","link":"https://kawowo.com/2023/03/19/kenneth-waiswa-ton-inspires-cricket-cranes-in-qatar/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Match Summary | 3rd ODI Match | Uganda v Qatar Uganda 292/6 50 overs Qatar 154 all out 39/50 overs Henry Ssenyondo 3/37Frank Nsubuga 2/23 Uganda won by 138 runs Kenneth Waiswa struck an unbeaten 101 as the Cricket Cranes raced to their second tour win against the hosts Qatar. Th Cricket Cranes won the […] The post Kenneth Waiswa ton inspires Cricket Cranes in Qatar appeared first on Kawowo Sports.","content":"Uganda 292/6 50 overs Qatar 154 all out 39/50 overs Henry Ssenyondo 3/37 Frank Nsubuga 2/23 Kenneth Waiswa struck an unbeaten 101 as the Cricket Cranes raced to their second tour win against the hosts Qatar. Th Cricket Cranes won the toss and elected to bat and a the decision was vindicated with an opening stand of 99 between Roger Mukasa (57) and Simon Ssesazi (45). Ronak Patel and Ronald Lutaaya fell cheaply but the middle order took over the show led by Kenneth Waiswa (101 not out) who was able to make his start count after falling for 39 yesterday. The Cricket Cranes put on 292 runs in their 50 overs. In response, the chase started well for the hosts but Henry Ssenyondo who is having a great time in the desert pegged back hosts with some tidy bowling. Ssenyondo (3/37) and Frank Nsubuga (2/23) were the stand out players with the bowl and got support from Juma Miyagi and Cosmas Kyewuta. It is second win for the Cricket Cranes as they take a 2-1 lead in the four-match ODI Series. The team will take a break tomorrow (Monday) and play their final ODI match on Tuesday.","pubDate":"2023-03-19 16:45:32","image_url":null,"source_id":"kawowo","category":["sports"],"country":["uganda"],"language":"english"},{"title":"IND vs AUS: हम लेफ्ट आर्म-राइट आर्म नहीं देखते, मिचेल स्टार्क ने किया बर्बाद तो रोहित शर्मा ने ऐसे दी सफाई","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/mitchell-takes-five-wicket-indian-captain-rohit-sharma-makes-important-statement-on-left-arm-pacer/articleshow/98776975.cms","keywords":null,"creator":null,"video_url":null,"description":"Mitchell Starc vs India: एकबार फिर लेफ्ट आर्म पेसर्स के खिलाफ भारतीय बल्लेबाजों की कलई खुल गई। चोट से वापसी करते हुए मिचेल स्टार्क ने लगातार दूसरे मैच में भारतीय टीम को परेशान किया। मुंबई वनडे में तीन विकेट लेने के बाद वाइजैग में उन्होंने पंजा खोला।","content":"लेफ्ट आर्म पेसर मिचेल स्टार्क ने पहले वनडे में तीन विकेट लिए हालांकि टीम को जीत नहीं दिला सके, लेकिन रविवार को दूसरे वनडे में पांच विकेट लेकर ऑस्ट्रेलिया को 10 विकेट से जीत दिलाई। मैच के बाद कप्तान रोहित शर्मा ने ऑस्ट्रेलियाई तेज गेंदबाज मिचेल स्टार्क के खिलाफ भारतीय टॉपऑर्डर की विफलता को ज्यादा तूल नहीं दिया। कप्तान रोहित ने कहा कि टीम मैनेजमेंट को इसे लेकर ज्यादा चिंतित होने की जरूरत नहीं है, क्योंकि बाएं हाथ के पेसर्स ने पहले भी भारतीय बल्लेबाजों को परेशान किया है। उन्होंने कहा, ‘जब विरोधी टीम में शानदार गेंदबाज हैं तो वह विकेट लेगा ही। वह बेस्ट खिलाड़ियों को आउट करने की कोशिश करेगा। दाहिने हाथ का गेंदबाज हो या बाएं हाथ का, वह विकेट लेगा ही। हम दाहिने या बाएं हाथ के बारे में नहीं सोचते, विकेट तो विकेट ही है। विकेट गिरना चिंता की बात है। हम इस पर आत्ममंथन करेंगे।’ ? भारत के पास बल्लेबाजी क्रम में दो खब्बू बल्लेबाज रविंद्र जडेजा और अक्षर पटेल थे, जिन्हें स्टार्क का सामना करने के लिए ऊपर भेजा जा सकता था, लेकिन रोहित ने कहा कि यह दाव उलटा भी पड़ सकता था। उन्होंने कहा, ‘यह कर सकते थे, लेकिन अगर ऊपर आकर वे जल्दी आउट होते तो फिर कुछ और बात कही जाती। ऐसा ही होता है। नाकाम होने पर तरह तरह की बातें होती है। हम सर्वश्रेष्ठ खिलाड़ियों को चुनौती का सामना करने के लिए उतारने की कोशिश करते हैं। आज हम नाकाम रहे लेकिन चेन्नई में शायद ऐसा नहीं होगा।’ वनडे क्रिकेट में लय हासिल करने के लिए जूझ रहे बल्लेबाज सूर्यकुमार यादव को पता है कि उसे अच्छा प्रदर्शन करना होगा और टीम मैनेजमेंट उसे लगातार मौके देगा। सूर्यकुमार ऑस्ट्रेलिया के खिलाफ पहले दोनों वनडे में खाता भी नहीं खोल सके। पिछली 16 वनडे पारियों में वह अर्धशतक भी नहीं बना सके हैं। न्यूजीलैंड के खिलाफ नाबाद 34 रन उनका सर्वोच्च स्कोर है।","pubDate":"2023-03-19 16:25:56","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"An underdog, a positive approach and the victory no one saw coming","link":"http://island.lk/an-underdog-a-positive-approach-and-the-victory-no-one-saw-coming/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"By Reemus Fernando Royal beat the odds to register a stunning 180 runs victory against their arch-rivals S. Thomas’ at the 144th Battle of the Blues at the SSC on Saturday. It was a victory no one saw coming as the outfit trained by Rohan Soysa entered the annual battle as underdogs. Royal’s back-to-back defeats […]","content":"Royal beat the odds to register a stunning 180 runs victory against their arch-rivals S. Thomas’ at the 144th Battle of the Blues at the SSC on Saturday. It was a victory no one saw coming as the outfit trained by Rohan Soysa entered the annual battle as underdogs. Royal’s back-to-back defeats at the hands of Trinity in the run up to the historic encounter were overshadowing even the couple of victories they had registered during the season and the fact that they had reached the quarter-finals at the end of the league stage. Reaching the last eight of the tournament was something their arch-rivals had failed to achieve. S. Thomas’ on the other hand had remained unbeaten though they failed to reach the business end of the tournament. Both teams had wanted to bowl first under overcast conditions on day one and the Thomians had the ideal start to the annual battle as they took the first three wickets for just 19 runs. That was when Dasis Manchanayake came to the crease. The new ball was just eight overs old when he started the repair job with Ovina Ambanpola. Despite the early damage, the Royalists stayed positive. “Manchanayake’s approach was decisive,” said Royal coach Rohan Soysa following the victory. Manchanayake rewarded for staying positive in adversity After being four wickets down for 63 runs at one stage, Royal recovered to post 326 runs for eight wickets declared thanks to the record-breaking partnership put on by Manchanayake and Ramiru Perera. The stage for victory was built on that partnership as the pair put on 229 runs off 293 balls. In the process the pair broke a 70-year-old partnership record for the fifth wicket. Manchanayake stayed there for five hours as they disappointed Thomians during an entire second session. There was no turning back for Royal from then on as they won all sessions.Few expected Royal to declare on their overnight score under clear skies on day two morning. By lunch they had accounted for four top-order batsmen in the Thomian innings except for opener Senadhi Bulankulame. By tea on day two Royal were in complete command as they dismissed their opponents for 153 runs and they needed just 26 overs in the final session to amass 168 runs for the loss of four wickets. Manchanayake entered the Battle of the Blues record books as the only Royal captain to score a century and a half-century in a match. In history only two batsmen had done that (M. Thotiwilage 95 and 108 in 2001 and Ganganath Rathnayake 75 and 111n.o. in 2011). What was more remarkable was the fact that the rare achievement coincided with victory. Ramiru Perera too could have earned the rare achievement had not Royal declared their innings on the overnight score on day three morning. Perera was unbeaten on 46 runs. Incidentally, of the players who batted, Royal had only three batsmen reaching double figures in the first innings. And in the second innings apart from Manchanayake and Perera, Uvindu Weerasekara was the only batsman to top 20 runs. Royal’s Sri Lanka Under 19 player Sineth Jayawardena (1 & 4) failed in both innings. Royal and two other schools had received exemptions from Sri Lanka Cricket to field their Sri Lanka Under 19 players in the weekend’s Big Matches despite Sri Lanka Under 19 leaving for UAE for a tournament. As expected pacemen played a crucial role in the match. Ranuka Malaviarachchi, Bulan Weerathunga and Sandesh Ramanayake accounted for ten wickets in the match with the latter becoming the third brother of the Ramanayake family to associate with a Royal victory. Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.”","pubDate":"2023-03-20 00:01:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"New Zealand on top despite Karunaratne’s twin fifties","link":"http://island.lk/new-zealand-on-top-despite-karunaratnes-twin-fifties/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, […]","content":"New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.” Published on By Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( )","pubDate":"2023-03-19 23:40:42","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Starc’s five-for, Marsh-Head century stand sink India for 1-1","link":"http://island.lk/starcs-five-for-marsh-head-century-stand-sink-india-for-1-1/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc […]","content":"Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.” Published on By Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( )","pubDate":"2023-03-19 23:40:39","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Hope: WI ‘trying everything’ to turn around ODI fortunes","link":"http://island.lk/hope-wi-trying-everything-to-turn-around-odi-fortunes/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him […]","content":"A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.” Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( )","pubDate":"2023-03-19 23:40:27","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Novak Djokovic to miss Miami Open over vaccine status","link":"http://island.lk/novak-djokovic-to-miss-miami-open-over-vaccine-status/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis […]","content":"Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( ) Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.”","pubDate":"2023-03-19 23:40:11","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India vs Australia 3rd ODI pitch report: Chennai pitch report Chidambaram Stadium IND vs AUS 3rd ODI","link":"https://thesportsrush.com/cricket-news-india-vs-australia-3rd-odi-pitch-report-chennai-pitch-report-chidambaram-stadium-ind-vs-aus-3rd-odi/","keywords":["Cricket","Australia tour of India 2023","Chennai","MA Chidambaram Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"After registering a resilient victory during the first ODI in Mumbai, team India faced their biggest ever defeat in the format history tonight in Vishakhapatnam, as the Aussie opening pair of Travis Head (51* off 30) and Mitchell Marsh (66* off 36) chased down the target of 118 in mere 11 Overs. The action for… The post India vs Australia 3rd ODI pitch report: Chennai pitch report Chidambaram Stadium IND vs AUS 3rd ODI appeared first on The SportsRush.","content":"After registering a resilient victory during the first ODI in Mumbai, team India faced their biggest ever defeat in the format history tonight in Vishakhapatnam, as the Aussie opening pair of Travis Head (51* off 30) and Mitchell Marsh (66* off 36) chased down the target of 118 in mere 11 Overs. The action for the third and final match of the series will take place at the MA Chidambaram Stadium in Chennai, on March 22 (Wednesday). No points for guessing that the visitors would be really high in confidence comparatively going into the final ODI, but looking at team India’s knack of nailing the the series deciders in the past few White Ball series, one can really expect a neck-to-neck battle on Wednesday. India vs Australia 3rd ODI pitch report The average score across the 21 completed ODIs which have taken place at the MA Chidambaram Stadium in Chennai since 1987, has been 259 runs. The pitch at this venue since the past few years has generally been on the slower side, and the spinners have had much of the say in the match proceedings. Chasing totals at this venue has been a challenging task, with the dry pitch getting slower as match progresses. Batting is expected to be relatively easy during the first innings, when the batters will be able to get on top of the bounce and play shots through the line. This will also be the ripe time for the pacers to get some inroads, who would have to later rely on their variations to have the better of the batters. All in all, expect a much better contest between bat and bowl in Chennai during the third ODI. West Indies humbled India during the last ODI in Chennai The previous ODI at this venue took place in December 2019, when India took on the West Indies. Expecting to post a challenging total with the pitch expected to play slow during the latter half, skipper Virat Kohli was in for a surprise. The pitch in fact, got quicker under the lights and the Windies chased down the target of 288 with eight wickets in hand, and 13 deliveries to spare. The post India vs Australia 3rd ODI pitch report: Chennai pitch report Chidambaram Stadium IND vs AUS 3rd ODI appeared first on The SportsRush.","pubDate":"2023-03-19 17:39:46","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"IND vs AUS: सूर्या को आखिर हुआ क्या, मिचेल स्टार्क ने लगातार दो बार पहली ही गेंद पर कैसे किया आउट, मैच के बाद बताया","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/india-vs-australia-how-mitchell-starc-trapped-suryakumar-yadav-in-consecutive-two-odis/articleshow/98777828.cms","keywords":null,"creator":null,"video_url":null,"description":"Suryakumar yadav vs Mitchell Starc: टी-20 के नंबर-1 बल्लेबाज सूर्यकुमार यादव वनडे फॉर्मेट में लगातार फेल हो रहे हैं। ऑस्ट्रेलिया के खिलाफ शुरुआती दोनों वनडे में वह बिना खाता खोले पहली ही गेंद पर चलने बने।","content":"भारत को ऑस्ट्रेलिया के खिलाफ अपनी सबसे खराब वनडे हार का सामना करना पड़ा, जिसमें मेहमान टीम ने 10 विकेट से जीत दर्ज की और तीन मैचों की श्रृंखला 1-1 से बराबर की। मिचेल स्टार्क ने पावरप्ले में भारत के पूरे टॉप ऑर्डर को ही समेट दिया। बाएं हाथ के इस तेज गेंदबाज ने पावरप्ले में चार विकेट की बदौलत 53 रन देकर पांच विकेट चटकाए। अपने इस चमत्कारिक खेल के बाद मैन ऑफ द मैच चुने गए स्टार्क का मानना है कि शुरुआती विकेट लेने के बाद ही उनके जोड़ीदार भी जोश में आ गए, जिससे भारत को महज 26 ओवर में 117 रन पर समेटने में कामयाबी मिली। मिचेल स्टार्क ने कहा, ‘यह हमारा पूरी तरह से दबदबे वाला गेंदबाजी प्रदर्शन था, बल्कि हमने पावरप्ले में विकेट झटके, जिससे हमें पूरी पारी के दौरान और अधिक आक्रामकता से गेंदबाजी करने में मदद मिली।’ उन्होंने साथ ही कहा कि बल्लेबाजी के दौरान उनकी आक्रामकता का कारण भी भारत को कम स्कोर पर समेटना रहा। उन्होंने कहा, ‘इतने कम स्कोर के लक्ष्य का पीछा करना था, हम पावरप्ले में आक्रामक बल्लेबाजी कर सकते थे। और मिच (मार्श) और ट्राव (ट्रेविस हेड) ने बल्ले से शानदार प्रदर्शन किया।’ यह पूछने पर कि क्या सूर्यकुमार यादव के खिलाफ उन्होंने कोई योजना बनाई थी क्योंकि वह लगातार दूसरी बार इस गेंदबाज की पहली गेंद पर शून्य पर आउट हुए। इस पर स्टार्क ने कहा, ‘मैं नहीं कह सकता हूं कि मैंने इसे तरीके से सोचा था कि कौन बल्लेबाज है। मेरे लिए योजना नहीं बदलती, भले ही वो बाएं हाथ का बल्लेबाज हो या फिर दाएं हाथ का बल्लेबाज। मैं तेज गेंदबाजी के साथ स्विंग और स्टंप हिट करने की कोशिश करता हूं। मेरी योजना में पिछले 13 साल से बदलाव नहीं हुआ है जो स्टंप पर गेंदबाजी करने और स्विंग करने की होती है। मेरी भूमिका पावरप्ले में विकेट चटकाने की कोशिश करने की है।’","pubDate":"2023-03-19 17:25:01","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Shahid Afridi Obliges A Fan With An Autograph On Indian Flag","link":"https://www.thetimesofbengal.com/sports/shahid-afridi-obliges-a-fan-with-an-autograph-on-indian-flag/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Shahid Afridi Obliges A Fan With An Autograph On Indian Flag | Watch Viral Video Shahid Afridi is currently representing Asia Lions in the Legends League Cricket in Doha.\r Shahid Afridi is the captain of Asia Lions in Legends League Cricket. (Image: Twitter) Doha: In a sweet gesture, former Pakistan captain Shahid Afridi […]","content":"Doha: In a sweet gesture, former Pakistan captain Shahid Afridi respectfully gave an autograph to a fan o the Indian flag, the video of which went viral on social media. Afridi is currently playing for Asia Lions in the Legends League Cricket. The incident happened during Asia Lions’ travelling on Saturday after defeating India Maharajas in the LLC Eliminator match in Doha. Afridi had just got on the team bus when a fan came up to him with an Indian flag and asked for an autograph. Afridi oblighed the fan who returned with a smile on his face. Here is the video. Meanwhile, Afridi’s Asia Lions registered a 85-run victory against India Maharajas to make their way into the final. They will be facing World Giants in the summit clash. Talking about the game, Asia Lions posted 191/5 in 20 overs, thanks to Upul Tharanga’s 50 off 31 balls and Mohammad Hafeez’s 38 off 24 balls. In reply, Maharajas were all out for 106 with Sohail Tanvir, Abdur Razzak and Hafeez taking two wickets each. For India Maharajas, captain Gautam Gambhir top-scored with 32 runs off 17 balls. In bowling, Stuart Binny and Pragyan Ojha took two wickets each. Source link","pubDate":"2023-03-19 17:17:54","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Kenneth Waiswa ton inspires Cricket Cranes in Qatar","link":"https://kawowo.com/2023/03/19/kenneth-waiswa-ton-inspires-cricket-cranes-in-qatar/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Match Summary | 3rd ODI Match | Uganda v Qatar Uganda 292/6 50 overs Qatar 154 all out 39/50 overs Henry Ssenyondo 3/37Frank Nsubuga 2/23 Uganda won by 138 runs Kenneth Waiswa struck an unbeaten 101 as the Cricket Cranes raced to their second tour win against the hosts Qatar. Th Cricket Cranes won the […] The post Kenneth Waiswa ton inspires Cricket Cranes in Qatar appeared first on Kawowo Sports.","content":"Uganda 292/6 50 overs Qatar 154 all out 39/50 overs Henry Ssenyondo 3/37 Frank Nsubuga 2/23 Kenneth Waiswa struck an unbeaten 101 as the Cricket Cranes raced to their second tour win against the hosts Qatar. Th Cricket Cranes won the toss and elected to bat and a the decision was vindicated with an opening stand of 99 between Roger Mukasa (57) and Simon Ssesazi (45). Ronak Patel and Ronald Lutaaya fell cheaply but the middle order took over the show led by Kenneth Waiswa (101 not out) who was able to make his start count after falling for 39 yesterday. The Cricket Cranes put on 292 runs in their 50 overs. In response, the chase started well for the hosts but Henry Ssenyondo who is having a great time in the desert pegged back hosts with some tidy bowling. Ssenyondo (3/37) and Frank Nsubuga (2/23) were the stand out players with the bowl and got support from Juma Miyagi and Cosmas Kyewuta. It is second win for the Cricket Cranes as they take a 2-1 lead in the four-match ODI Series. The team will take a break tomorrow (Monday) and play their final ODI match on Tuesday.","pubDate":"2023-03-19 16:45:32","image_url":null,"source_id":"kawowo","category":["sports"],"country":["uganda"],"language":"english"},{"title":"IND vs AUS: हम लेफ्ट आर्म-राइट आर्म नहीं देखते, मिचेल स्टार्क ने किया बर्बाद तो रोहित शर्मा ने ऐसे दी सफाई","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/mitchell-takes-five-wicket-indian-captain-rohit-sharma-makes-important-statement-on-left-arm-pacer/articleshow/98776975.cms","keywords":null,"creator":null,"video_url":null,"description":"Mitchell Starc vs India: एकबार फिर लेफ्ट आर्म पेसर्स के खिलाफ भारतीय बल्लेबाजों की कलई खुल गई। चोट से वापसी करते हुए मिचेल स्टार्क ने लगातार दूसरे मैच में भारतीय टीम को परेशान किया। मुंबई वनडे में तीन विकेट लेने के बाद वाइजैग में उन्होंने पंजा खोला।","content":"लेफ्ट आर्म पेसर मिचेल स्टार्क ने पहले वनडे में तीन विकेट लिए हालांकि टीम को जीत नहीं दिला सके, लेकिन रविवार को दूसरे वनडे में पांच विकेट लेकर ऑस्ट्रेलिया को 10 विकेट से जीत दिलाई। मैच के बाद कप्तान रोहित शर्मा ने ऑस्ट्रेलियाई तेज गेंदबाज मिचेल स्टार्क के खिलाफ भारतीय टॉपऑर्डर की विफलता को ज्यादा तूल नहीं दिया। कप्तान रोहित ने कहा कि टीम मैनेजमेंट को इसे लेकर ज्यादा चिंतित होने की जरूरत नहीं है, क्योंकि बाएं हाथ के पेसर्स ने पहले भी भारतीय बल्लेबाजों को परेशान किया है। उन्होंने कहा, ‘जब विरोधी टीम में शानदार गेंदबाज हैं तो वह विकेट लेगा ही। वह बेस्ट खिलाड़ियों को आउट करने की कोशिश करेगा। दाहिने हाथ का गेंदबाज हो या बाएं हाथ का, वह विकेट लेगा ही। हम दाहिने या बाएं हाथ के बारे में नहीं सोचते, विकेट तो विकेट ही है। विकेट गिरना चिंता की बात है। हम इस पर आत्ममंथन करेंगे।’ ? भारत के पास बल्लेबाजी क्रम में दो खब्बू बल्लेबाज रविंद्र जडेजा और अक्षर पटेल थे, जिन्हें स्टार्क का सामना करने के लिए ऊपर भेजा जा सकता था, लेकिन रोहित ने कहा कि यह दाव उलटा भी पड़ सकता था। उन्होंने कहा, ‘यह कर सकते थे, लेकिन अगर ऊपर आकर वे जल्दी आउट होते तो फिर कुछ और बात कही जाती। ऐसा ही होता है। नाकाम होने पर तरह तरह की बातें होती है। हम सर्वश्रेष्ठ खिलाड़ियों को चुनौती का सामना करने के लिए उतारने की कोशिश करते हैं। आज हम नाकाम रहे लेकिन चेन्नई में शायद ऐसा नहीं होगा।’ वनडे क्रिकेट में लय हासिल करने के लिए जूझ रहे बल्लेबाज सूर्यकुमार यादव को पता है कि उसे अच्छा प्रदर्शन करना होगा और टीम मैनेजमेंट उसे लगातार मौके देगा। सूर्यकुमार ऑस्ट्रेलिया के खिलाफ पहले दोनों वनडे में खाता भी नहीं खोल सके। पिछली 16 वनडे पारियों में वह अर्धशतक भी नहीं बना सके हैं। न्यूजीलैंड के खिलाफ नाबाद 34 रन उनका सर्वोच्च स्कोर है।","pubDate":"2023-03-19 16:25:56","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"An underdog, a positive approach and the victory no one saw coming","link":"http://island.lk/an-underdog-a-positive-approach-and-the-victory-no-one-saw-coming/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"By Reemus Fernando Royal beat the odds to register a stunning 180 runs victory against their arch-rivals S. Thomas’ at the 144th Battle of the Blues at the SSC on Saturday. It was a victory no one saw coming as the outfit trained by Rohan Soysa entered the annual battle as underdogs. Royal’s back-to-back defeats […]","content":"Royal beat the odds to register a stunning 180 runs victory against their arch-rivals S. Thomas’ at the 144th Battle of the Blues at the SSC on Saturday. It was a victory no one saw coming as the outfit trained by Rohan Soysa entered the annual battle as underdogs. Royal’s back-to-back defeats at the hands of Trinity in the run up to the historic encounter were overshadowing even the couple of victories they had registered during the season and the fact that they had reached the quarter-finals at the end of the league stage. Reaching the last eight of the tournament was something their arch-rivals had failed to achieve. S. Thomas’ on the other hand had remained unbeaten though they failed to reach the business end of the tournament. Both teams had wanted to bowl first under overcast conditions on day one and the Thomians had the ideal start to the annual battle as they took the first three wickets for just 19 runs. That was when Dasis Manchanayake came to the crease. The new ball was just eight overs old when he started the repair job with Ovina Ambanpola. Despite the early damage, the Royalists stayed positive. “Manchanayake’s approach was decisive,” said Royal coach Rohan Soysa following the victory. Manchanayake rewarded for staying positive in adversity After being four wickets down for 63 runs at one stage, Royal recovered to post 326 runs for eight wickets declared thanks to the record-breaking partnership put on by Manchanayake and Ramiru Perera. The stage for victory was built on that partnership as the pair put on 229 runs off 293 balls. In the process the pair broke a 70-year-old partnership record for the fifth wicket. Manchanayake stayed there for five hours as they disappointed Thomians during an entire second session. There was no turning back for Royal from then on as they won all sessions.Few expected Royal to declare on their overnight score under clear skies on day two morning. By lunch they had accounted for four top-order batsmen in the Thomian innings except for opener Senadhi Bulankulame. By tea on day two Royal were in complete command as they dismissed their opponents for 153 runs and they needed just 26 overs in the final session to amass 168 runs for the loss of four wickets. Manchanayake entered the Battle of the Blues record books as the only Royal captain to score a century and a half-century in a match. In history only two batsmen had done that (M. Thotiwilage 95 and 108 in 2001 and Ganganath Rathnayake 75 and 111n.o. in 2011). What was more remarkable was the fact that the rare achievement coincided with victory. Ramiru Perera too could have earned the rare achievement had not Royal declared their innings on the overnight score on day three morning. Perera was unbeaten on 46 runs. Incidentally, of the players who batted, Royal had only three batsmen reaching double figures in the first innings. And in the second innings apart from Manchanayake and Perera, Uvindu Weerasekara was the only batsman to top 20 runs. Royal’s Sri Lanka Under 19 player Sineth Jayawardena (1 & 4) failed in both innings. Royal and two other schools had received exemptions from Sri Lanka Cricket to field their Sri Lanka Under 19 players in the weekend’s Big Matches despite Sri Lanka Under 19 leaving for UAE for a tournament. As expected pacemen played a crucial role in the match. Ranuka Malaviarachchi, Bulan Weerathunga and Sandesh Ramanayake accounted for ten wickets in the match with the latter becoming the third brother of the Ramanayake family to associate with a Royal victory. Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.”","pubDate":"2023-03-20 00:01:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"New Zealand on top despite Karunaratne’s twin fifties","link":"http://island.lk/new-zealand-on-top-despite-karunaratnes-twin-fifties/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, […]","content":"New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.” Published on By Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( )","pubDate":"2023-03-19 23:40:42","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Starc’s five-for, Marsh-Head century stand sink India for 1-1","link":"http://island.lk/starcs-five-for-marsh-head-century-stand-sink-india-for-1-1/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc […]","content":"Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.” Published on By Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( )","pubDate":"2023-03-19 23:40:39","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Hope: WI ‘trying everything’ to turn around ODI fortunes","link":"http://island.lk/hope-wi-trying-everything-to-turn-around-odi-fortunes/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him […]","content":"A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.” Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( )","pubDate":"2023-03-19 23:40:27","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Novak Djokovic to miss Miami Open over vaccine status","link":"http://island.lk/novak-djokovic-to-miss-miami-open-over-vaccine-status/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis […]","content":"Novak Djokovic will miss next week’s Miami Open after being denied an exemption that would have allowed him to enter the U.S. despite not being vaccinated against COVID-19, tournament director James Blake said Friday. “We tried to get Novak Djokovic to be allowed to get an exemption, but that wasn’t able to happen,” Blake told Tennis Channel. “Obviously, we’re one of the premier tournaments in the world. We’d like to have the best players that can play. We did all that we could. We tried to talk to the government, but that’s out of our hands.” Florida Gov. Ron DeSantis and Sens. Marco Rubio and Rick Scott were among those calling on the Biden administration to allow Djokovic to enter the U.S. and compete at the tournament he has won six times, most recently in 2016. Djokovic, 35, is also missing the ongoing Masters tournament in Indian Wells, California, due to his inability to secure the exemption.The U.S. currently bars unvaccinated foreigners from entry into the country, a policy that is expected to be lifted when the government ends its COVID-19 emergency declarations May 11.A U.S. Tennis Association spokesperson said Saturday that the group is “very hopeful” that Djokovic will be allowed into the country for the US Open, which begins Aug. 28. “We are very hopeful that the policy preventing Novak Djokovic from entering the United States will be rescinded, or lapse, in the near future,” the USTA’s Chris Widmaier wrote to The Associated Press. “No COVID-19 restrictions are in place at the U.S. Open for any player, fan or other attendee. Novak, one of our sport’s great champions, would be welcome to compete at the 2023 U.S. Open.” Djokovic, who missed last year’s Australian Open after being deported from that country because of his vaccination status, has said he would skip Grand Slams rather than receive a COVID-19 shot.He won his record-tying 22nd Grand Slam at the Australian Open in January. He has not played at Indian Wells or the Miami Open since 2019. A representative for Djokovic said the player would make no further comment regarding his absence from the Miami tournament and that he planned to return to the tour at the Monte Carlo Masters clay-court event that begins April 9.Djokovic will then continue his preparations for the French Open in May by playing in the Srpska Open in Banja Luka, Bosnia. ( ) Published on By New Zealand’s bowlers propelled their side to the brink of a 2-0 series whitewash over Sri Lanka, picking up ten wickets on the third day, forcing a follow-on and leaving the visitors still 303 runs behind with eight wickets and two days of cricket still to go. At the crease for the visitors were Kusal Mendis, unbeaten on 50, and Angelo Mathews on 1 – the pair that had so memorably saved a Test at the same ground back in 2018. Back then they had batted out the entirety of the fourth day before rain intervened on the fifth to help secure the draw, and Sri Lanka will certainly be hoping history repeats itself – with rain forecast over the coming days. But even the help of the weather gods might not be enough if Sri Lanka repeat their poor batting display from the third day.While credit must go to New Zealand’s bowlers for sticking to their plans diligently and maximising the conditions on offer, Sri Lanka’s batters were undoubtedly guilty of far too often failing to put a price on their wickets. While the nightwatcher Prabath Jayasuriya received a delivery he was far too ill-equipped to deal with, one that pitched on a length and seamed away taking his edge in the process, Mathews could have no such excuse, edging a similar – but wider – delivery when fending outside off. This left Sri Lanka four down for 34 with barely an hour played in the morning. But that setback would be followed by a solid period of consolidation between Dimuth Karunaratne and Dinesh Chandimal, with the Sri Lakna captain, in particular, looking in good touch. He was patient with deliveries outside off, but not averse to punishing any that were overpitched. Together the pair would put on 80 for the fifth wicket, and the hope heading into lunch was that they could continue to make steady progress having already got in. What followed though was Sri Lanka’s most inexcusable period of the entire series, losing their final six wickets for just 55 runs in the period between lunch and tea. It was Chandimal that would trigger the capitulation. Having swept Michael Bracewell, who was finding some extra turn and bounce for his offbreaks, for four, Chandimal would charge him just a delivery later only to have the ball turn through bat and pad and offer Tom Blundell a straightforward stumping. A brain fade at the most ill-advised moment. This was followed by Dhananjaya de Silva coming down the track and chipping an easy catch straight to short midwicket – put in place for precisely such a stroke – shortly after. At 116 for 6, this would see Nishan Madushka, the debutant, enter. He would string together a 40-run stand with Karunaratne at the other end, who was continuing unfazed despite the chaos around him. In this period, Madushka even produced some stellar stroke play, especially when driving through the offside. But eventually he too would fall, courtesy of the extra bounce the pitch was more consistently producing, edging through to second slip. After Kasun Rajitha was run out, Karunaratne’s patience would finally wear thin, uncharacteristically looking to beat the man in the deep, and holing out at long-off for a 188-ball 89. Last man Asitha Fernando would not last much longer either, as Sri Lanka were bowled out 164, with Matt Henry and Bracewell taking three wickets apiece. With a 416-run lead, Tim Southee then had little hesitation in enforcing the follow-on, and back out came Karunaratne for his second essay a little over 10 minutes after he had been dismissed.Sri Lanka’s second effort with the bat definitely fared better, but two wickets lost against the run of play may still come to haunt them. Oshada Fernando, who’s had a tour to forget, ended up flicking one off his hips straight to square leg, but the wicket that will hurt the most is that of Karunaratne’s. Having struck at a rate of 47.34 in the first innings, Karunaratne’s second outing ticked along at 61.44, showing a more proactive streak and an inclination to take on the New Zealand bowlers. Alongside a similarly positive Mendis, the pair frequently took on a splattering of short stuff served up by the seamers on an increasingly bouncy track. It would be the relative comfort with which they handle pulling and cutting however that will likely grate Karunaratne as he looks back on his dismissal this evening, as it was an umpteenth short ball that he wound up top edging to deep midwicket. It having come after reaching his second fifty of the day would only have been salt in the wounds. Mercifully for Sri Lanka, they would lose no further wickets, with Mathews especially happy to shut up shop during his 40-ball knock for just a solitary run, but the visitors will know they’ll need to do much better if they’re to survive the next two sessions, let alone the next two days. (cricinfo) Published on By Mitchell Starc produced a masterclass in new-ball swing bowling before openers Mitchell Marsh and Travis Head hammered rapid fifties to complete a knockout performance against India and level the series 1-1. India received a thrashing like no other in Visakhapatnam – their heaviest defeat in terms of balls remaining – when they were bowled out for 117 in just 26 overs. Starc was the tormentor in chief with his 5 for 53, his ninth five-for in ODIs, and gave Marsh and Head freedom to bat with no scoreboard pressure; Marsh raced to 28-ball fifty before Head got to his in 29 balls and Australia chased the target down in just 11 overs. Starc got deliveries to swing in as well as angle across to the right-hand batters in equal measure. His work up top allowed Sean Abbott and Nathan Ellis to join hands and run through the lower middle order thereafter. In all, the Australian bowlers were done with their shift inside two hours and 20 minutes, with the three seamers sharing all ten wickets. When Starc got the deliveries to angle across, he tempted Shubman Gill and Rohit Sharma to drive away from their bodies, only for both to get dismissed cheaply. Gill was the first to go, out for a duck in the first over, when he chased a full and wide delivery and drove to point, in what was a repeat of his dismissal from the Mumbai ODI. Rohit, returning to the side in place of Ishan Kishan, was out in the fifth over. He had had moved to 13 by relying on leg-side flicks, but then swung big against a wide ball to edge to first slip. Suryakumar Yadav walked in looking to make up for his first-ball duck from the first ODI, but he suffered the same fate when Starc swing the ball into him again, and had him lbw for another golden duck. In what was another repeat from the first ODI, KL Rahul came in trying to survive a hat-trick delivery. He did that successfully, but could not last too much longer. The half-centurion from the previous game was also trapped lbw by Starc, on 9, with another inswinging delivery that got him missing a shot across the line. At 48 for 4, India needed a recovery job, but that wouldn’t come. Abbott got a length ball to bounce a bit more and Hardik Pandya poked at it only to see Steven Smith take a stunning one-handed diving catch at first slip to rock them further. Virat Kohli and Ravindra Jadeja tried to resurrect the innings, but they failed as well this time. Kohli was trapped lbw by Ellis when, on 31, he swiped across the line to a full ball, and didn’t bother reviewing the on-field decision. Ellis then came around the wicket to get Jadeja edging a catch to the wicketkeeper Alex Carey. At 91 for 7, India were on the mat and the crowd was completely silenced. Published on By A career-defining century by a cricket captain should be enough to win a game of cricket, according to Shai Hope. And he wasn’t talking about himself. “Temba Bavuma – an innings like that deserves to be a victorious innings but it just so happened that we came out on top at the end. I must give him credit for the way he controlled the innings. He played the situation well and he really deserved to win the game but there can only be one winner,” Hope said after West Indies successfully defended 335 runs – their highest score against South Africa – in East London. Bavuma slammed a career-best 144, exactly a week after his Test best of 172 last and less than two months after he hit a series-winning 109 in South Africa’s World Cup Super League victory over England in Bloemfontein. He is a player transformed from the one who struggled to score runs during South Africa’s season-opening white-ball tour of India, where he made 11 runs in four innings, and the leader who oversaw their T20I World Cup campaign, which ended in defeat to the Netherlands. Bavuma attributes the change to the simple truth of having more fun. “I’m enjoying my cricket at this point in time,” Bavuma said. “My mind is just a lot clearer as to what we’re trying to do and how we’re trying to do that; feeding off the confidence that I am getting from the players as well as the new coaches.” After his 172 in the Wanderers Test, Bavuma said he felt more backed by red-ball coach Shukri Conrad than he had since he was under the wing of his domestic coach at the Lions, Enoch Nkwe (who also served as South Africa’s interim coach for a trip to India in 2019) and that’s despite being captain in two formats in the interim. In May 2021, Bavuma was put in charge of South Africa’s white-ball sides, albeit with only six ODI and eight T20I caps to his name. While 50-over cricket is clearly his forte, the shortest format proved to be tricky, particularly from a strike-rate perspective and since being relieved of that role, and put in charge of the Test team while keeping the 50-over gig, Bavuma has flourished. His recent innings have shown us a batter who is strong on the sweep and the slog, who has opened up scoring areas both in front of and behind square and who is able to rotate strike well. While it may look like a revelation to those looking in from the outside, for Bavuma, it’s merely a demonstration of “what was always there,” that is now coming through. “It’s just a confidence thing. Confidence is a big thing for any sportsman,” he said. “I am just trying to carry on the form and the momentum I got in the England series. I am hitting the ball quite nicely. I am managing to find gaps, which is a big thing for me as a stroke player. I can only hope that lasts.” Despite his best efforts on Saturday evening, South Africa fell 48 runs short of beating West Indies, a side who are after a new start of their own. After losing 16 of the 20 ODIs they played last year, West Indies are all-but-certain to miss out on automatic qualification to the 2023 World Cup, and need to start winning. Victory in South Africa – their first on the road against a team other then Netherlands and Ireland since they beat Bangladesh in Mirpur in 2018 – “means a lot,” as Hope put it. “It’s something we speak about in the meetings. We are just trying to win more cricket games. We didn’t have a successful 2022 and we are trying everything to turn it around,” he said. It also marks a successful start for new leadership. Hope is now in charge of the ODI team, with 105 matches under his belt, and a lot on his plate. Though he did not open the batting in this match – as he has done since 2019 – he batted from the 10th over, kept wicket and captained and described the fixture as a “tiring game for me.” So how will he manage the many roles he has to play in what is a big ODI year for West Indies? “I am definitely going to take it on full speed. It’s about giving my all to the team,” Hope said. “I am getting support from all ends. I have got support from guys off the field and on the field. I’ve got to keep embracing the responsibility and when the time comes to shine, I’ll do so.” And he intends to apply that in all formats. As the ODI series opener played out, shortly after West Indies’ batting let them down in the Test series, there was some talk about whether players like Hope and former captain Nicholas Pooran should be considered for the red-ball team as well. On the evidence of the East London ODI, West Indies could do worse, but there’s also some interesting context to Hope’s exclusion. Like his opposite number Bavuma, Hope only has two Test centuries to his name – and they came in the same match. Hope has not played Test cricket since December 2021. Asked if the longest format is something he’d like to get back to, Hope indicated that hope will win out. “Something that I always preach in the camp: control what you can control. I can’t control what the selectors do, I can’t control things behind the scenes, all I can control is the way I prep, the way I play and the performance I put in on the field,” he said. “If the chance and the opportunity arises, I will take it with both hands.”","pubDate":"2023-03-19 23:40:11","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India vs Australia 3rd ODI pitch report: Chennai pitch report Chidambaram Stadium IND vs AUS 3rd ODI","link":"https://thesportsrush.com/cricket-news-india-vs-australia-3rd-odi-pitch-report-chennai-pitch-report-chidambaram-stadium-ind-vs-aus-3rd-odi/","keywords":["Cricket","Australia tour of India 2023","Chennai","MA Chidambaram Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"After registering a resilient victory during the first ODI in Mumbai, team India faced their biggest ever defeat in the format history tonight in Vishakhapatnam, as the Aussie opening pair of Travis Head (51* off 30) and Mitchell Marsh (66* off 36) chased down the target of 118 in mere 11 Overs. The action for… The post India vs Australia 3rd ODI pitch report: Chennai pitch report Chidambaram Stadium IND vs AUS 3rd ODI appeared first on The SportsRush.","content":"After registering a resilient victory during the first ODI in Mumbai, team India faced their biggest ever defeat in the format history tonight in Vishakhapatnam, as the Aussie opening pair of Travis Head (51* off 30) and Mitchell Marsh (66* off 36) chased down the target of 118 in mere 11 Overs. The action for the third and final match of the series will take place at the MA Chidambaram Stadium in Chennai, on March 22 (Wednesday). No points for guessing that the visitors would be really high in confidence comparatively going into the final ODI, but looking at team India’s knack of nailing the the series deciders in the past few White Ball series, one can really expect a neck-to-neck battle on Wednesday. India vs Australia 3rd ODI pitch report The average score across the 21 completed ODIs which have taken place at the MA Chidambaram Stadium in Chennai since 1987, has been 259 runs. The pitch at this venue since the past few years has generally been on the slower side, and the spinners have had much of the say in the match proceedings. Chasing totals at this venue has been a challenging task, with the dry pitch getting slower as match progresses. Batting is expected to be relatively easy during the first innings, when the batters will be able to get on top of the bounce and play shots through the line. This will also be the ripe time for the pacers to get some inroads, who would have to later rely on their variations to have the better of the batters. All in all, expect a much better contest between bat and bowl in Chennai during the third ODI. West Indies humbled India during the last ODI in Chennai The previous ODI at this venue took place in December 2019, when India took on the West Indies. Expecting to post a challenging total with the pitch expected to play slow during the latter half, skipper Virat Kohli was in for a surprise. The pitch in fact, got quicker under the lights and the Windies chased down the target of 288 with eight wickets in hand, and 13 deliveries to spare. The post India vs Australia 3rd ODI pitch report: Chennai pitch report Chidambaram Stadium IND vs AUS 3rd ODI appeared first on The SportsRush.","pubDate":"2023-03-19 17:39:46","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"IND vs AUS: सूर्या को आखिर हुआ क्या, मिचेल स्टार्क ने लगातार दो बार पहली ही गेंद पर कैसे किया आउट, मैच के बाद बताया","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/india-vs-australia-how-mitchell-starc-trapped-suryakumar-yadav-in-consecutive-two-odis/articleshow/98777828.cms","keywords":null,"creator":null,"video_url":null,"description":"Suryakumar yadav vs Mitchell Starc: टी-20 के नंबर-1 बल्लेबाज सूर्यकुमार यादव वनडे फॉर्मेट में लगातार फेल हो रहे हैं। ऑस्ट्रेलिया के खिलाफ शुरुआती दोनों वनडे में वह बिना खाता खोले पहली ही गेंद पर चलने बने।","content":"भारत को ऑस्ट्रेलिया के खिलाफ अपनी सबसे खराब वनडे हार का सामना करना पड़ा, जिसमें मेहमान टीम ने 10 विकेट से जीत दर्ज की और तीन मैचों की श्रृंखला 1-1 से बराबर की। मिचेल स्टार्क ने पावरप्ले में भारत के पूरे टॉप ऑर्डर को ही समेट दिया। बाएं हाथ के इस तेज गेंदबाज ने पावरप्ले में चार विकेट की बदौलत 53 रन देकर पांच विकेट चटकाए। अपने इस चमत्कारिक खेल के बाद मैन ऑफ द मैच चुने गए स्टार्क का मानना है कि शुरुआती विकेट लेने के बाद ही उनके जोड़ीदार भी जोश में आ गए, जिससे भारत को महज 26 ओवर में 117 रन पर समेटने में कामयाबी मिली। मिचेल स्टार्क ने कहा, ‘यह हमारा पूरी तरह से दबदबे वाला गेंदबाजी प्रदर्शन था, बल्कि हमने पावरप्ले में विकेट झटके, जिससे हमें पूरी पारी के दौरान और अधिक आक्रामकता से गेंदबाजी करने में मदद मिली।’ उन्होंने साथ ही कहा कि बल्लेबाजी के दौरान उनकी आक्रामकता का कारण भी भारत को कम स्कोर पर समेटना रहा। उन्होंने कहा, ‘इतने कम स्कोर के लक्ष्य का पीछा करना था, हम पावरप्ले में आक्रामक बल्लेबाजी कर सकते थे। और मिच (मार्श) और ट्राव (ट्रेविस हेड) ने बल्ले से शानदार प्रदर्शन किया।’ यह पूछने पर कि क्या सूर्यकुमार यादव के खिलाफ उन्होंने कोई योजना बनाई थी क्योंकि वह लगातार दूसरी बार इस गेंदबाज की पहली गेंद पर शून्य पर आउट हुए। इस पर स्टार्क ने कहा, ‘मैं नहीं कह सकता हूं कि मैंने इसे तरीके से सोचा था कि कौन बल्लेबाज है। मेरे लिए योजना नहीं बदलती, भले ही वो बाएं हाथ का बल्लेबाज हो या फिर दाएं हाथ का बल्लेबाज। मैं तेज गेंदबाजी के साथ स्विंग और स्टंप हिट करने की कोशिश करता हूं। मेरी योजना में पिछले 13 साल से बदलाव नहीं हुआ है जो स्टंप पर गेंदबाजी करने और स्विंग करने की होती है। मेरी भूमिका पावरप्ले में विकेट चटकाने की कोशिश करने की है।’","pubDate":"2023-03-19 17:25:01","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Shahid Afridi Obliges A Fan With An Autograph On Indian Flag","link":"https://www.thetimesofbengal.com/sports/shahid-afridi-obliges-a-fan-with-an-autograph-on-indian-flag/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Shahid Afridi Obliges A Fan With An Autograph On Indian Flag | Watch Viral Video Shahid Afridi is currently representing Asia Lions in the Legends League Cricket in Doha.\r Shahid Afridi is the captain of Asia Lions in Legends League Cricket. (Image: Twitter) Doha: In a sweet gesture, former Pakistan captain Shahid Afridi […]","content":"Doha: In a sweet gesture, former Pakistan captain Shahid Afridi respectfully gave an autograph to a fan o the Indian flag, the video of which went viral on social media. Afridi is currently playing for Asia Lions in the Legends League Cricket. The incident happened during Asia Lions’ travelling on Saturday after defeating India Maharajas in the LLC Eliminator match in Doha. Afridi had just got on the team bus when a fan came up to him with an Indian flag and asked for an autograph. Afridi oblighed the fan who returned with a smile on his face. Here is the video. Meanwhile, Afridi’s Asia Lions registered a 85-run victory against India Maharajas to make their way into the final. They will be facing World Giants in the summit clash. Talking about the game, Asia Lions posted 191/5 in 20 overs, thanks to Upul Tharanga’s 50 off 31 balls and Mohammad Hafeez’s 38 off 24 balls. In reply, Maharajas were all out for 106 with Sohail Tanvir, Abdur Razzak and Hafeez taking two wickets each. For India Maharajas, captain Gautam Gambhir top-scored with 32 runs off 17 balls. In bowling, Stuart Binny and Pragyan Ojha took two wickets each. Source link","pubDate":"2023-03-19 17:17:54","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Kenneth Waiswa ton inspires Cricket Cranes in Qatar","link":"https://kawowo.com/2023/03/19/kenneth-waiswa-ton-inspires-cricket-cranes-in-qatar/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Match Summary | 3rd ODI Match | Uganda v Qatar Uganda 292/6 50 overs Qatar 154 all out 39/50 overs Henry Ssenyondo 3/37Frank Nsubuga 2/23 Uganda won by 138 runs Kenneth Waiswa struck an unbeaten 101 as the Cricket Cranes raced to their second tour win against the hosts Qatar. Th Cricket Cranes won the […] The post Kenneth Waiswa ton inspires Cricket Cranes in Qatar appeared first on Kawowo Sports.","content":"Uganda 292/6 50 overs Qatar 154 all out 39/50 overs Henry Ssenyondo 3/37 Frank Nsubuga 2/23 Kenneth Waiswa struck an unbeaten 101 as the Cricket Cranes raced to their second tour win against the hosts Qatar. Th Cricket Cranes won the toss and elected to bat and a the decision was vindicated with an opening stand of 99 between Roger Mukasa (57) and Simon Ssesazi (45). Ronak Patel and Ronald Lutaaya fell cheaply but the middle order took over the show led by Kenneth Waiswa (101 not out) who was able to make his start count after falling for 39 yesterday. The Cricket Cranes put on 292 runs in their 50 overs. In response, the chase started well for the hosts but Henry Ssenyondo who is having a great time in the desert pegged back hosts with some tidy bowling. Ssenyondo (3/37) and Frank Nsubuga (2/23) were the stand out players with the bowl and got support from Juma Miyagi and Cosmas Kyewuta. It is second win for the Cricket Cranes as they take a 2-1 lead in the four-match ODI Series. The team will take a break tomorrow (Monday) and play their final ODI match on Tuesday.","pubDate":"2023-03-19 16:45:32","image_url":null,"source_id":"kawowo","category":["sports"],"country":["uganda"],"language":"english"},{"title":"IND vs AUS: हम लेफ्ट आर्म-राइट आर्म नहीं देखते, मिचेल स्टार्क ने किया बर्बाद तो रोहित शर्मा ने ऐसे दी सफाई","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/mitchell-takes-five-wicket-indian-captain-rohit-sharma-makes-important-statement-on-left-arm-pacer/articleshow/98776975.cms","keywords":null,"creator":null,"video_url":null,"description":"Mitchell Starc vs India: एकबार फिर लेफ्ट आर्म पेसर्स के खिलाफ भारतीय बल्लेबाजों की कलई खुल गई। चोट से वापसी करते हुए मिचेल स्टार्क ने लगातार दूसरे मैच में भारतीय टीम को परेशान किया। मुंबई वनडे में तीन विकेट लेने के बाद वाइजैग में उन्होंने पंजा खोला।","content":"लेफ्ट आर्म पेसर मिचेल स्टार्क ने पहले वनडे में तीन विकेट लिए हालांकि टीम को जीत नहीं दिला सके, लेकिन रविवार को दूसरे वनडे में पांच विकेट लेकर ऑस्ट्रेलिया को 10 विकेट से जीत दिलाई। मैच के बाद कप्तान रोहित शर्मा ने ऑस्ट्रेलियाई तेज गेंदबाज मिचेल स्टार्क के खिलाफ भारतीय टॉपऑर्डर की विफलता को ज्यादा तूल नहीं दिया। कप्तान रोहित ने कहा कि टीम मैनेजमेंट को इसे लेकर ज्यादा चिंतित होने की जरूरत नहीं है, क्योंकि बाएं हाथ के पेसर्स ने पहले भी भारतीय बल्लेबाजों को परेशान किया है। उन्होंने कहा, ‘जब विरोधी टीम में शानदार गेंदबाज हैं तो वह विकेट लेगा ही। वह बेस्ट खिलाड़ियों को आउट करने की कोशिश करेगा। दाहिने हाथ का गेंदबाज हो या बाएं हाथ का, वह विकेट लेगा ही। हम दाहिने या बाएं हाथ के बारे में नहीं सोचते, विकेट तो विकेट ही है। विकेट गिरना चिंता की बात है। हम इस पर आत्ममंथन करेंगे।’ ? भारत के पास बल्लेबाजी क्रम में दो खब्बू बल्लेबाज रविंद्र जडेजा और अक्षर पटेल थे, जिन्हें स्टार्क का सामना करने के लिए ऊपर भेजा जा सकता था, लेकिन रोहित ने कहा कि यह दाव उलटा भी पड़ सकता था। उन्होंने कहा, ‘यह कर सकते थे, लेकिन अगर ऊपर आकर वे जल्दी आउट होते तो फिर कुछ और बात कही जाती। ऐसा ही होता है। नाकाम होने पर तरह तरह की बातें होती है। हम सर्वश्रेष्ठ खिलाड़ियों को चुनौती का सामना करने के लिए उतारने की कोशिश करते हैं। आज हम नाकाम रहे लेकिन चेन्नई में शायद ऐसा नहीं होगा।’ वनडे क्रिकेट में लय हासिल करने के लिए जूझ रहे बल्लेबाज सूर्यकुमार यादव को पता है कि उसे अच्छा प्रदर्शन करना होगा और टीम मैनेजमेंट उसे लगातार मौके देगा। सूर्यकुमार ऑस्ट्रेलिया के खिलाफ पहले दोनों वनडे में खाता भी नहीं खोल सके। पिछली 16 वनडे पारियों में वह अर्धशतक भी नहीं बना सके हैं। न्यूजीलैंड के खिलाफ नाबाद 34 रन उनका सर्वोच्च स्कोर है।","pubDate":"2023-03-19 16:25:56","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}