{"newsArray":[{"article_id":"ca4430ad8530f373caf5ffd06c32c867","title":"Kohli hundred gives India fourth straight win","link":"https://www.ft.lk/sports/Kohli-hundred-gives-India-fourth-straight-win/23-754269","keywords":null,"creator":null,"video_url":null,"description":null,"content":"PUNE: Virat Kohli scored his 48th ODI hundred as India coasted to a seven-wicket win over Bangladesh to draw level on points with New Zealand in a Cricket World Cup match played at Maharashtra CA Stadium here Thursday. A target of 257 was going to be a challenging one, but Rohit Sharma put India in control with a 40-ball 48 and Shubman Gill helped himself to a maiden World Cup fifty (53 off 55 balls, 5 fours, 2 sixes), but it was Kohli who dominated the batting from there onwards. Bangladesh was not able to curb the run-flow, even after dismissing Sharma and to an extent, they only had themselves to blame, offering Kohli two free hits to get him underway. The game gradually slipped out of their grasp as Kohli and Lokesh Rahul carried India to victory with an unbroken 83-run stand. It didn’t look as if Kohli could reach his century when India was coasting along with about 25 runs to win, but Kohli took it onto himself to reach three-figures. He refused singles unless it was the last ball of the over, ran hard to convert ones into twos and left Rahul watching, as a mere spectator as he reached his hundred with the winning blow, a six off 97 balls (6 fours, 4 sixes). Bangladesh never really tested this strong Indian batting line-up and they’ve slipped to their third straight loss. India’s only worry would be the injury to all-rounder Hardik Pandya who seemed to twist his ankle while fielding and did not come out to bat. India made a splendid comeback after a shaky start to keep Bangladesh down to 256-8, a total which seemed quite unlikely when Bangladesh raced away to 90-0 after 14 overs. Tanzid Hasan did the bulk of the scoring taking down the Indian bowlers towards the back end of the powerplay to score 51 off 43 balls (5 fours, 3 sixes) and Litton Das kept things ticking, getting to his half-century off 62 balls. As has been the case in the World Cup, India’s spinners stifled the opposition in the middle overs. Kuldeep Yadav got the initial breakthrough, with Ravindra Jadeja then picking up the Bangladesh captain Najmul Hossain Shanto soon after. Jadeja then accounted for Litton for 66 (82 balls, 7 fours) and set in motion a mini-collapse. Mahmudullah salvaged the innings towards the end with 46 off 36 balls (3 fours, 3 sixes) that saw his team past the 250-run mark. – (ST) Scores: Bangladesh 256-8 (50) (Tanzid Hasan 51, Litton Das 66, Mushfiqur Rahim 38, Mahmudullah 46, Jasprit Bumrah 2/46, Mohammad Siraj 2/60, Ravindra Jadeja 2/38) India 261-3 (41.3) (Rohit Sharma 48, Shubman Gill 53, Virat Kohli 103*, Lokesh Rahul 34*, Mehidy Hasan 2/47)","pubDate":"2023-10-19 22:55:20","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"4b3d792a54e709c3020d1835565ddcef","title":"Mathews and Chameera to join Sri Lanka’s injury-hit WC squad","link":"https://www.ft.lk/sports/Mathews-and-Chameera-to-join-Sri-Lanka-s--injury-hit-WC-squad/23-754272","keywords":null,"creator":null,"video_url":null,"description":null,"content":"LUCKNOW: Former captain and experienced all-rounder Angelo Mathews and fast bowler Dushmantha Chameera have been picked as travelling reserves to boost the injury-hit Sri Lanka cricket team currently participating in the 2023 Cricket World Cup in India. The travelling reserves spot became vacant when Chamika Karunaratne who was selected as the only player outside the squad came in as a replacement for Dasun Shanaka when the Sri Lanka captain suffered a leg injury and was ruled out of the tournament. A Sri Lanka Cricket (SLC) media release states: “The Sri Lanka Cricket selectors took this decision in order to ensure that the team has ready replacements in place to face contingencies, such as an injury to an existing squad member. Accordingly, Mathews and Chameera will join the team tomorrow (Friday).” Sri Lanka has been badly missing the services of Chameera with their bowlers - with the exception of Dilshan Madushanka - being carted around in the first three World Cup games for 988 runs at an average of 7.54 runs an over. Chameera failed to make it to the final World Cup squad of 15 as he was feeling discomfort while bowling at the nets while recovering from a torn pectoral muscle of his right bowling arm, which he suffered ahead of the World Cup Qualifier in Zimbabwe. After recovering from that he injured himself again in the Lanka Premier League (LPL) in August which kept him out of the Asia Cup. It’s really good news for Sri Lanka that he is fit, up and running. But for him to be included in the World Cup squad of 15 one of the existing players have to get injured or fall ill for the Event Technical Committee of the ICC Men’s Cricket World Cup to grant approval. It is the same with Mathews. The former skipper should have been picked initially for his experience alone. The present team lacks a proficient batter in the middle as witnessed by the batting collapses experienced in the Asia Cup final, as well as Sri Lanka’s first three matches of the World Cup. Sri Lanka’s World Cup campaign has been derailed by injuries to key bowlers like Chameera and leg-spinning all-rounder Wanindu Hasaranga, that has forced them to take a squad of inexperienced bowlers to the mega event, which has proved quite disastrous so far as Sri Lanka are the only team out of the ten taking part without a single win. Of the present side fast bowler Matheesha Pathirana is recovering from an injury to his right shoulder that saw him miss Sri Lanka’s last game against Australia and most probably Saturday’s match against Netherlands at Lucknow. “Pathirana’s under rehab. We will be checking tomorrow (Friday) whether he is fit to play,” said team manager Mahinda Halangoda.","pubDate":"2023-10-19 22:55:20","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8fcac91a36b9502a417f00d597c47711","title":"Bangladesh Emerging level unofficial ODI series 1-1","link":"https://www.ft.lk/sports/Bangladesh-Emerging-level-unofficial-ODI-series-1-1/23-754268","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Bangladesh Emerging squared the three-match unofficial ODI series one-all against Sri Lanka Emerging when they won the second match by 21 runs on the DLS method after bad weather had interrupted play at the Rangiri Dambulla Cricket Stadium Thursday. Sri Lanka Emerging batting first recovered from losing the first three wickets for 55 to total 297-7 courtesy fifties from captain Ahan Wickramasinghe (77 off 79 balls, 6 fours, 3 sixes) and Sonal Dinusha (62 off 70 balls, 5 fours). Bangladesh Emerging chasing a revised target of 180 off 36 overs reached 200-2 with Prantik Nawrose Nabil (92* off 116 balls, 9 fours, 1 six) and Mahmudul Hasan Joy (57* off 69 balls, 4 fours) sharing an unbroken partnership of 130 for the third wicket. Sri Lanka Emerging won the first unofficial ODI by 99 runs (DLS method) and the third and decisive match will be played at the same venue on Sunday 22 October. Scores: Sri Lanka Emerging 297-7 (50) (Sohan de Livera 23, Navod Paranavithana 37, Ahan Wickramasinghe 77, Sonal Dinusha 62, Vijayakanth Viyaskanth 25, Chamindu Wickramasinghe 28*, Musfik Hasan 3/56, Ahmed Sharif 2/53) Bangladesh Emerging 200-2 (36) (Parvez Hossain Emon 35, Prantik Nawrose Nabil 92*, Mahmudul Hasan Joy 57*)","pubDate":"2023-10-19 22:55:20","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"5d35d06304af0b8a2832fdb6ddcebda5","title":"India Beats Bangladesh: বিরাট ঝড়ে বেসামাল বাংলাদেশ, হারল ৭ উইকেটে","link":"https://bangla.latestly.com/india/news/india-beats-bangladesh-by-7-wickets-at-maharashtra-cricket-association-stadium-in-pune-255248.html","keywords":null,"creator":null,"video_url":null,"description":"প্রথমে ব্যাট করতে নেমে ৫০ ওভারে আট উইকেট হারিয়ে ২৫৬ রান করে বাংলাদেশ। পাল্টা ব্যাট করতে নেমে ৪১ ওভার তিন বলের মধ্যে তিন উইকেট হারিয়ে ২৬১ রান করে ভারত।","content":"পুনে: পুনের (Pune) মহারাষ্ট্র ক্রিকেট অ্যাসোসিয়েশনের (Maharashtra Cricket Association Stadium) মাঠে বিশ্বকাপের ম্যাচ (ICC Men's Cricket world cup 2023) খেলতে নেমে বাংলাদেশকে (Bangladesh) কার্যত উড়িয়ে দিল ভারত (India)। ৮ ওভার তিন বল বাকি থাকতেই ৭ উইকেটে হারিয়ে দিল প্রতিবেশী দেশকে (India beats Bangladesh)। প্রথমে ব্যাট করতে নেমে ৫০ ওভারে আট উইকেট হারিয়ে ২৫৬ রান করে বাংলাদেশ। পাল্টা ব্যাট করতে নেমে ৪১ ওভার তিন বলের মধ্যে তিন উইকেট হারিয়ে ২৬১ রান করে ভারত। সত্যি কথা বলতে আজকে পুনের স্টেডিয়ামে বিরাট কোহলির (Virat Kohli) অপরাজিত ১০৩ রানের দুর্দান্ত ইনিংস ভারতের জয় অনেক সোজা করে দেয়। ফলস্বরূপ ম্যান অফ দ্য ম্যাচের (Player of the Match) পুরস্কারও আসে তাঁর ঝুলিতে। আরও পড়ুন: Neymar Injury Update: ভারত সফরে আসছেন না নেইমার! হাঁটুর লিগামেন্ট ছিঁড়েছেন ব্রাজিল তারকা, সারতে ৯ মাস CWC 2023 | Virat Kohli in action against Bangladesh at Maharashtra Cricket Association Stadium in Pune. India won the match by 7 wickets and Virat Kohli (103*) won the 'Player of the Match' award. (Pic source: ANI Photos) pic.twitter.com/P7ID6ScdF9 — ANI (@ANI) October 19, 2023","pubDate":"2023-10-19 18:23:53","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"f118839e79366ea773b032cfb69a9504","title":"Cricket World Cup 2023: 'The GOAT,' Fans Can't Keep Calm As Virat Kohli Inches Close Sachin Tendulkar's ODI Century Record","link":"https://zeenews.india.com/cricket/cricket-world-cup-2023-the-goat-fans-cant-keep-calm-as-virat-kohli-inches-close-sachin-tendulkars-odi-century-record-2677510.html","keywords":null,"creator":null,"video_url":null,"description":"Cricket World Cup 2023: Virat Kohli became the 'Man of the Match' for his ton.","content":"Star India batter Virat Kohli had a historic outing in the ICC Cricket World Cup match against Bangladesh at Pune on Thursday. In the match, Virat smashed his match-winning century, 48th in ODIs and 78th at international level. He scored 103 runs in 97 balls with six fours and four sixes. His runs came at a strike rate of over 106. With this, he is just one away from levelling Sachin Tendulkar's record of 49 ODI centuries. Also, with his 78th international ton, just 23 centuries are left for him to overtake Sachin's record of 100 international centuries. Virat also brought up his 26,000 international runs, becoming the fastest to do so, in just 567 innings, leaving behind Sachin (600 innings). In 511 matches and 567 innings, Virat has scored 26,026 runs at an average of 53.99 and a strike rate of over 79. He has scored 78 centuries and 134 fifties, with the best score of 254*. (WATCH: Sara Tendulkar Joyfully Claps After Shubman Gill Hits Boundary During IND Vs BAN World Cup Clash, Video Goes Viral) With this, he also overtook Sri Lankan great Mahela Jayawardene (25,957 runs) to become the fourth-leading run-scorer of all time in international cricket. In 30 ICC Cricket World Cup matches, Virat has scored 1,289 runs at an average of 53.70, with three centuries and eight fifties in 30 innings, with the best score of 107. He is the fourth-highest run-scorer in WC history, with Sachin (2,278 runs) at the top. In this World Cup , Virat is the second-highest run-scorer. In four innings, he has scored 259 runs at an average of 129.50, with one century and two fifties, his best score is 103*. His strike rate is around 90. Checkout the fan reactions here: Congratulations to Virat Kohli for 48th Century Sachin Tendulkar - 49 Virat Kohli -48 Just 1 more century for breaking the record of the God Of cricket- Sachin Tendulkar and 2 more century for making record of first batsman who have 50 centuries in ODI https://t.co/bgos1rlkTt — Deep (@deep_kaintura7) October 19, 2023 Some records might never be broken.. 1) Bradman 99.98 avg 2) Sachin International Runs 3) Sachin 100 centuries ( closest is Kohli but still 20+ away) 4) Kohli avg in Chases 5) Rohit no. Of sixes All international.. I cannot see them broken in the next 20 years.. — logical Indian (@ybiyani0712) October 19, 2023 Great 100 by kohli . In ODIs, kohli is easily the greatest of all. Sachin is 2nd. Kohli literally mastered the trick of converting 50’s to 100’s. No one else knows it that well. Tendulkar was dismissed in the 90’s (both tests and ODIs) 28 times That’s also a record ! Or else… — kedar (@kedar9909) October 19, 2023 Who is actual GOAT of Cricket? Virat Kohli Like Sachin Retweets #ViratKohli #ViratKohli #GOAT #indiavsbangladesh #SachinTendulkar #jadeja #Worlds2023 #ODIWorldCup2023 pic.twitter.com/edQl723MEO — humour Buck (@YasirSid6) October 19, 2023 Virat Kohli scores a century and everyone including Sachin FC, Rohit FC and Dhoni FC starts crying. Imagine the scenes when Virat Kohli will actually break Sachin Tendulkar ODI ton record. pic.twitter.com/eZdplr6tKf — Pari (@BluntIndianGal) October 19, 2023 Coming to the match, Bangladesh opted to bat first and there was a 91-run opening stand between Tanzid Hasan (51 in 43 balls with four boundaries and three sixes) and Litton Das (66 in 82 balls, with seven fours). Following that, Bangladesh kept losing wickets at regular intervals, though important knocks came from Mahmudullah (46 in 36 balls, with three fours and three sixes) and wicketkeeper-batter Mushfiqur Rahim (38 in 46 balls, with a four and six) that took Bangladesh to 256/8 in 50 overs. Ravindra Jadeja (2/38) and Jasprit Bumrah (2/41) were the pick of the bowlers for India. Mohammed Siraj took two wickets as well while Kuldeep Yadav and Shardul Thakur got one each. In the chase of 257, skipper Rohit Sharma (48 in 40 balls, with seven fours and two sixes) and Shubman Gill (53 in 55 balls with five fours and two sixes) decided the outcome with their partnership itself. Virat's century and partnership with KL Rahul (34*), which saw some entertaining running between the wickets was an icing on the cake. Mehidy Hasan Miraz took two wickets for Bangladesh. With four wins in four matches, India is in the second spot in the points table with eight points. New Zealand is at the top with a better net-run-rate. Bangladesh is in the seventh spot with one win and three losses. Virat became the 'Man of the Match' for his ton.","pubDate":"2023-10-19 17:20:00","image_url":null,"source_id":"zeenews","source_priority":5319,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"21f6c24e420067e3305cdba41a0dbee8","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.southwalesguardian.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Ben Stokes is set to make an overdue return to the World Cup stage this weekend but he feared his tournament was over before it had even started when he “heard a pop” while training in the gym. Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.southwalesguardian.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"91ae8339a28fefb20e5cd102ee729763","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.northwaleschronicle.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Ben Stokes is set to make an overdue return to the World Cup stage this weekend but he feared his tournament was over before it had even started when he “heard a pop” while training in the gym. Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dcb9e6a5de37f9ef07e11a68ceecc6b9","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.andoveradvertiser.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.andoveradvertiser.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"andoveradvertiser","source_priority":6475270,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"58820ca882059c8ea6018a9f17079b27","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.northwalespioneer.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Ben Stokes is set to make an overdue return to the World Cup stage this weekend but he feared his tournament was over before it had even started when he “heard a pop” while training in the gym. Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.northwalespioneer.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"381196242ad04dceea2664aacf358be5","title":"Cricket World Cup 2023: India thrashes Bangladesh, registers 4th consecutive win; Virat Kohli showes his class","link":"https://organiser.org/2023/10/19/202444/sports/cricket-world-cup-2023-india-thrashes-bangladesg-registers-4th-consecutive-win-virat-kohli-showes-his-class/","keywords":["Cricket","Sports","FEATURED","MAIN","Virat Kohli","ICC Cricket World Cup 2023","Jasprit Bumrah","Cricket World Cup 2023","India Vs Bangladesh","MCA Ground"],"creator":["WEB DESK"],"video_url":null,"description":"Pune: Team India’s remarkable performance in the World Cup 2023 continues as they secured their fourth consecutive win in the tournament. The Indian cricket team defeated Bangladesh by seven wickets in a thrilling match that took place at Pune’s MCA Ground. Virat Kohli played a pivotal role in this victory, showcasing his brilliant form with the bat. Kohli notched up his 48th One Day International (ODI) century, making him the fastest to reach 26,000 international runs. This impressive feat was accomplished in just 567 matches, surpassing the previous record held by cricket legend Sachin Tendulkar, who achieved this milestone in 600 matches. The celebration of King Kohli after the century No 78 🔥 Virat Kohli 🔥#INDvsBAN #indiavsbangladesh#ViratKohli pic.twitter.com/CIASkjBrRd — VINEETH𓃵🦖 (@sololoveee) October 19, 2023 Bangladesh won the toss and elected to bat first at the MCA Ground in Pune. They managed to score 256 runs for the loss of eight wickets in their allotted 50 overs. In pursuit of the target, India’s opening batsmen Rohit Sharma and Shubman Gill established an excellent partnership, adding 88 runs. Rohit Sharma, however, fell just short of his half-century, scoring 48 runs before being caught at the boundary off a delivery from Mehedi Hasan. 2011 WC – Kohli scored the first century against Bangladesh• Result – India Won the world cup 2023 – Kohli scored the first century against Bangladesh• Result – We Are coming for that WC#ViratKohli #WorldCup2023 #INDvsBANpic.twitter.com/VgMGw6wxic — ꜱᴘɪᴅᴇʏ (@AnushSpidey1) October 19, 2023 Shubman Gill, playing in his first World Cup, reached his maiden ODI fifty, scoring 53 runs before being caught by Mahmudullah Miraz off Mehedi Hasan’s bowling. Mahmudullah later held another catch at backward point to dismiss Gill. India achieved the target of 257 runs with 8.3 overs remaining, with Rohit Sharma and Shubman Gill’s contributions being significant. Half-century for Shubman Gill! 👌👌#TeamIndia moving along nicely in the chase at 128/1 Follow the match ▶️ https://t.co/GpxgVtP2fb#CWC23 | #INDvBAN | #MenInBlue pic.twitter.com/iUwxC7LdcL — BCCI (@BCCI) October 19, 2023 In the Bangladesh innings, their openers, Tamim Iqbal and Liton Das, put up a partnership of 93 runs. Tamim Iqbal scored his first World Cup fifty with 51 runs, but he was eventually dismissed. Liton Das also reached his 12th ODI fifty, scoring 66 runs before getting out. Despite the partnership between Mushfiqur Rahim (38 runs) and Mahmudullah (46 runs), Bangladesh couldn’t post a challenging total. India’s bowlers, led by Jasprit Bumrah and Ravindra Jadeja, took crucial wickets to restrict Bangladesh’s progress. During the match, Hardik Pandya suffered an injury, and Virat Kohli took over the bowling responsibilities for the first time in six years. Kohli’s last appearance as a bowler in an ODI was in 2017, against Sri Lanka. KL Rahul, India’s wicketkeeper, displayed his acrobatic skills in the field by taking a stunning diving catch in the 25th over. The catch came off a delivery from Mohammed Siraj, and Mehedi Hasan Miraz was the batsman who was dismissed. India’s win in this match is a testament to their strong form and depth in both batting and bowling, making them one of the top contenders in the World Cup 2023. With this win, India maintains its unbeaten streak in the tournament and further solidifies its position as a frontrunner in the World Cup. Cricket enthusiasts around the world eagerly await their next match to see if Team India can continue their winning streak and bring home the coveted trophy.","content":"Pune: Team India’s remarkable performance in the World Cup 2023 continues as they secured their fourth consecutive win in the tournament. The Indian cricket team defeated Bangladesh by seven wickets in a thrilling match that took place at Pune’s MCA Ground. Virat Kohli played a pivotal role in this victory, showcasing his brilliant form with the bat. Kohli notched up his 48th One Day International (ODI) century, making him the fastest to reach 26,000 international runs. This impressive feat was accomplished in just 567 matches, surpassing the previous record held by cricket legend Sachin Tendulkar, who achieved this milestone in 600 matches. Bangladesh won the toss and elected to bat first at the MCA Ground in Pune. They managed to score 256 runs for the loss of eight wickets in their allotted 50 overs. In pursuit of the target, India’s opening batsmen Rohit Sharma and Shubman Gill established an excellent partnership, adding 88 runs. Rohit Sharma, however, fell just short of his half-century, scoring 48 runs before being caught at the boundary off a delivery from Mehedi Hasan. Shubman Gill, playing in his first World Cup, reached his maiden ODI fifty, scoring 53 runs before being caught by Mahmudullah Miraz off Mehedi Hasan’s bowling. Mahmudullah later held another catch at backward point to dismiss Gill. India achieved the target of 257 runs with 8.3 overs remaining, with Rohit Sharma and Shubman Gill’s contributions being significant. In the Bangladesh innings, their openers, Tamim Iqbal and Liton Das, put up a partnership of 93 runs. Tamim Iqbal scored his first World Cup fifty with 51 runs, but he was eventually dismissed. Liton Das also reached his 12th ODI fifty, scoring 66 runs before getting out. Despite the partnership between Mushfiqur Rahim (38 runs) and Mahmudullah (46 runs), Bangladesh couldn’t post a challenging total. India’s bowlers, led by Jasprit Bumrah and Ravindra Jadeja, took crucial wickets to restrict Bangladesh’s progress. During the match, Hardik Pandya suffered an injury, and Virat Kohli took over the bowling responsibilities for the first time in six years. Kohli’s last appearance as a bowler in an ODI was in 2017, against Sri Lanka. KL Rahul, India’s wicketkeeper, displayed his acrobatic skills in the field by taking a stunning diving catch in the 25th over. The catch came off a delivery from Mohammed Siraj, and Mehedi Hasan Miraz was the batsman who was dismissed. India’s win in this match is a testament to their strong form and depth in both batting and bowling, making them one of the top contenders in the World Cup 2023. With this win, India maintains its unbeaten streak in the tournament and further solidifies its position as a frontrunner in the World Cup. Cricket enthusiasts around the world eagerly await their next match to see if Team India can continue their winning streak and bring home the coveted trophy.","pubDate":"2023-10-19 16:50:23","image_url":null,"source_id":"organiser","source_priority":216805,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"ca4430ad8530f373caf5ffd06c32c867","title":"Kohli hundred gives India fourth straight win","link":"https://www.ft.lk/sports/Kohli-hundred-gives-India-fourth-straight-win/23-754269","keywords":null,"creator":null,"video_url":null,"description":null,"content":"PUNE: Virat Kohli scored his 48th ODI hundred as India coasted to a seven-wicket win over Bangladesh to draw level on points with New Zealand in a Cricket World Cup match played at Maharashtra CA Stadium here Thursday. A target of 257 was going to be a challenging one, but Rohit Sharma put India in control with a 40-ball 48 and Shubman Gill helped himself to a maiden World Cup fifty (53 off 55 balls, 5 fours, 2 sixes), but it was Kohli who dominated the batting from there onwards. Bangladesh was not able to curb the run-flow, even after dismissing Sharma and to an extent, they only had themselves to blame, offering Kohli two free hits to get him underway. The game gradually slipped out of their grasp as Kohli and Lokesh Rahul carried India to victory with an unbroken 83-run stand. It didn’t look as if Kohli could reach his century when India was coasting along with about 25 runs to win, but Kohli took it onto himself to reach three-figures. He refused singles unless it was the last ball of the over, ran hard to convert ones into twos and left Rahul watching, as a mere spectator as he reached his hundred with the winning blow, a six off 97 balls (6 fours, 4 sixes). Bangladesh never really tested this strong Indian batting line-up and they’ve slipped to their third straight loss. India’s only worry would be the injury to all-rounder Hardik Pandya who seemed to twist his ankle while fielding and did not come out to bat. India made a splendid comeback after a shaky start to keep Bangladesh down to 256-8, a total which seemed quite unlikely when Bangladesh raced away to 90-0 after 14 overs. Tanzid Hasan did the bulk of the scoring taking down the Indian bowlers towards the back end of the powerplay to score 51 off 43 balls (5 fours, 3 sixes) and Litton Das kept things ticking, getting to his half-century off 62 balls. As has been the case in the World Cup, India’s spinners stifled the opposition in the middle overs. Kuldeep Yadav got the initial breakthrough, with Ravindra Jadeja then picking up the Bangladesh captain Najmul Hossain Shanto soon after. Jadeja then accounted for Litton for 66 (82 balls, 7 fours) and set in motion a mini-collapse. Mahmudullah salvaged the innings towards the end with 46 off 36 balls (3 fours, 3 sixes) that saw his team past the 250-run mark. – (ST) Scores: Bangladesh 256-8 (50) (Tanzid Hasan 51, Litton Das 66, Mushfiqur Rahim 38, Mahmudullah 46, Jasprit Bumrah 2/46, Mohammad Siraj 2/60, Ravindra Jadeja 2/38) India 261-3 (41.3) (Rohit Sharma 48, Shubman Gill 53, Virat Kohli 103*, Lokesh Rahul 34*, Mehidy Hasan 2/47)","pubDate":"2023-10-19 22:55:20","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"4b3d792a54e709c3020d1835565ddcef","title":"Mathews and Chameera to join Sri Lanka’s injury-hit WC squad","link":"https://www.ft.lk/sports/Mathews-and-Chameera-to-join-Sri-Lanka-s--injury-hit-WC-squad/23-754272","keywords":null,"creator":null,"video_url":null,"description":null,"content":"LUCKNOW: Former captain and experienced all-rounder Angelo Mathews and fast bowler Dushmantha Chameera have been picked as travelling reserves to boost the injury-hit Sri Lanka cricket team currently participating in the 2023 Cricket World Cup in India. The travelling reserves spot became vacant when Chamika Karunaratne who was selected as the only player outside the squad came in as a replacement for Dasun Shanaka when the Sri Lanka captain suffered a leg injury and was ruled out of the tournament. A Sri Lanka Cricket (SLC) media release states: “The Sri Lanka Cricket selectors took this decision in order to ensure that the team has ready replacements in place to face contingencies, such as an injury to an existing squad member. Accordingly, Mathews and Chameera will join the team tomorrow (Friday).” Sri Lanka has been badly missing the services of Chameera with their bowlers - with the exception of Dilshan Madushanka - being carted around in the first three World Cup games for 988 runs at an average of 7.54 runs an over. Chameera failed to make it to the final World Cup squad of 15 as he was feeling discomfort while bowling at the nets while recovering from a torn pectoral muscle of his right bowling arm, which he suffered ahead of the World Cup Qualifier in Zimbabwe. After recovering from that he injured himself again in the Lanka Premier League (LPL) in August which kept him out of the Asia Cup. It’s really good news for Sri Lanka that he is fit, up and running. But for him to be included in the World Cup squad of 15 one of the existing players have to get injured or fall ill for the Event Technical Committee of the ICC Men’s Cricket World Cup to grant approval. It is the same with Mathews. The former skipper should have been picked initially for his experience alone. The present team lacks a proficient batter in the middle as witnessed by the batting collapses experienced in the Asia Cup final, as well as Sri Lanka’s first three matches of the World Cup. Sri Lanka’s World Cup campaign has been derailed by injuries to key bowlers like Chameera and leg-spinning all-rounder Wanindu Hasaranga, that has forced them to take a squad of inexperienced bowlers to the mega event, which has proved quite disastrous so far as Sri Lanka are the only team out of the ten taking part without a single win. Of the present side fast bowler Matheesha Pathirana is recovering from an injury to his right shoulder that saw him miss Sri Lanka’s last game against Australia and most probably Saturday’s match against Netherlands at Lucknow. “Pathirana’s under rehab. We will be checking tomorrow (Friday) whether he is fit to play,” said team manager Mahinda Halangoda.","pubDate":"2023-10-19 22:55:20","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8fcac91a36b9502a417f00d597c47711","title":"Bangladesh Emerging level unofficial ODI series 1-1","link":"https://www.ft.lk/sports/Bangladesh-Emerging-level-unofficial-ODI-series-1-1/23-754268","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Bangladesh Emerging squared the three-match unofficial ODI series one-all against Sri Lanka Emerging when they won the second match by 21 runs on the DLS method after bad weather had interrupted play at the Rangiri Dambulla Cricket Stadium Thursday. Sri Lanka Emerging batting first recovered from losing the first three wickets for 55 to total 297-7 courtesy fifties from captain Ahan Wickramasinghe (77 off 79 balls, 6 fours, 3 sixes) and Sonal Dinusha (62 off 70 balls, 5 fours). Bangladesh Emerging chasing a revised target of 180 off 36 overs reached 200-2 with Prantik Nawrose Nabil (92* off 116 balls, 9 fours, 1 six) and Mahmudul Hasan Joy (57* off 69 balls, 4 fours) sharing an unbroken partnership of 130 for the third wicket. Sri Lanka Emerging won the first unofficial ODI by 99 runs (DLS method) and the third and decisive match will be played at the same venue on Sunday 22 October. Scores: Sri Lanka Emerging 297-7 (50) (Sohan de Livera 23, Navod Paranavithana 37, Ahan Wickramasinghe 77, Sonal Dinusha 62, Vijayakanth Viyaskanth 25, Chamindu Wickramasinghe 28*, Musfik Hasan 3/56, Ahmed Sharif 2/53) Bangladesh Emerging 200-2 (36) (Parvez Hossain Emon 35, Prantik Nawrose Nabil 92*, Mahmudul Hasan Joy 57*)","pubDate":"2023-10-19 22:55:20","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"5d35d06304af0b8a2832fdb6ddcebda5","title":"India Beats Bangladesh: বিরাট ঝড়ে বেসামাল বাংলাদেশ, হারল ৭ উইকেটে","link":"https://bangla.latestly.com/india/news/india-beats-bangladesh-by-7-wickets-at-maharashtra-cricket-association-stadium-in-pune-255248.html","keywords":null,"creator":null,"video_url":null,"description":"প্রথমে ব্যাট করতে নেমে ৫০ ওভারে আট উইকেট হারিয়ে ২৫৬ রান করে বাংলাদেশ। পাল্টা ব্যাট করতে নেমে ৪১ ওভার তিন বলের মধ্যে তিন উইকেট হারিয়ে ২৬১ রান করে ভারত।","content":"পুনে: পুনের (Pune) মহারাষ্ট্র ক্রিকেট অ্যাসোসিয়েশনের (Maharashtra Cricket Association Stadium) মাঠে বিশ্বকাপের ম্যাচ (ICC Men's Cricket world cup 2023) খেলতে নেমে বাংলাদেশকে (Bangladesh) কার্যত উড়িয়ে দিল ভারত (India)। ৮ ওভার তিন বল বাকি থাকতেই ৭ উইকেটে হারিয়ে দিল প্রতিবেশী দেশকে (India beats Bangladesh)। প্রথমে ব্যাট করতে নেমে ৫০ ওভারে আট উইকেট হারিয়ে ২৫৬ রান করে বাংলাদেশ। পাল্টা ব্যাট করতে নেমে ৪১ ওভার তিন বলের মধ্যে তিন উইকেট হারিয়ে ২৬১ রান করে ভারত। সত্যি কথা বলতে আজকে পুনের স্টেডিয়ামে বিরাট কোহলির (Virat Kohli) অপরাজিত ১০৩ রানের দুর্দান্ত ইনিংস ভারতের জয় অনেক সোজা করে দেয়। ফলস্বরূপ ম্যান অফ দ্য ম্যাচের (Player of the Match) পুরস্কারও আসে তাঁর ঝুলিতে। আরও পড়ুন: Neymar Injury Update: ভারত সফরে আসছেন না নেইমার! হাঁটুর লিগামেন্ট ছিঁড়েছেন ব্রাজিল তারকা, সারতে ৯ মাস CWC 2023 | Virat Kohli in action against Bangladesh at Maharashtra Cricket Association Stadium in Pune. India won the match by 7 wickets and Virat Kohli (103*) won the 'Player of the Match' award. (Pic source: ANI Photos) pic.twitter.com/P7ID6ScdF9 — ANI (@ANI) October 19, 2023","pubDate":"2023-10-19 18:23:53","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"f118839e79366ea773b032cfb69a9504","title":"Cricket World Cup 2023: 'The GOAT,' Fans Can't Keep Calm As Virat Kohli Inches Close Sachin Tendulkar's ODI Century Record","link":"https://zeenews.india.com/cricket/cricket-world-cup-2023-the-goat-fans-cant-keep-calm-as-virat-kohli-inches-close-sachin-tendulkars-odi-century-record-2677510.html","keywords":null,"creator":null,"video_url":null,"description":"Cricket World Cup 2023: Virat Kohli became the 'Man of the Match' for his ton.","content":"Star India batter Virat Kohli had a historic outing in the ICC Cricket World Cup match against Bangladesh at Pune on Thursday. In the match, Virat smashed his match-winning century, 48th in ODIs and 78th at international level. He scored 103 runs in 97 balls with six fours and four sixes. His runs came at a strike rate of over 106. With this, he is just one away from levelling Sachin Tendulkar's record of 49 ODI centuries. Also, with his 78th international ton, just 23 centuries are left for him to overtake Sachin's record of 100 international centuries. Virat also brought up his 26,000 international runs, becoming the fastest to do so, in just 567 innings, leaving behind Sachin (600 innings). In 511 matches and 567 innings, Virat has scored 26,026 runs at an average of 53.99 and a strike rate of over 79. He has scored 78 centuries and 134 fifties, with the best score of 254*. (WATCH: Sara Tendulkar Joyfully Claps After Shubman Gill Hits Boundary During IND Vs BAN World Cup Clash, Video Goes Viral) With this, he also overtook Sri Lankan great Mahela Jayawardene (25,957 runs) to become the fourth-leading run-scorer of all time in international cricket. In 30 ICC Cricket World Cup matches, Virat has scored 1,289 runs at an average of 53.70, with three centuries and eight fifties in 30 innings, with the best score of 107. He is the fourth-highest run-scorer in WC history, with Sachin (2,278 runs) at the top. In this World Cup , Virat is the second-highest run-scorer. In four innings, he has scored 259 runs at an average of 129.50, with one century and two fifties, his best score is 103*. His strike rate is around 90. Checkout the fan reactions here: Congratulations to Virat Kohli for 48th Century Sachin Tendulkar - 49 Virat Kohli -48 Just 1 more century for breaking the record of the God Of cricket- Sachin Tendulkar and 2 more century for making record of first batsman who have 50 centuries in ODI https://t.co/bgos1rlkTt — Deep (@deep_kaintura7) October 19, 2023 Some records might never be broken.. 1) Bradman 99.98 avg 2) Sachin International Runs 3) Sachin 100 centuries ( closest is Kohli but still 20+ away) 4) Kohli avg in Chases 5) Rohit no. Of sixes All international.. I cannot see them broken in the next 20 years.. — logical Indian (@ybiyani0712) October 19, 2023 Great 100 by kohli . In ODIs, kohli is easily the greatest of all. Sachin is 2nd. Kohli literally mastered the trick of converting 50’s to 100’s. No one else knows it that well. Tendulkar was dismissed in the 90’s (both tests and ODIs) 28 times That’s also a record ! Or else… — kedar (@kedar9909) October 19, 2023 Who is actual GOAT of Cricket? Virat Kohli Like Sachin Retweets #ViratKohli #ViratKohli #GOAT #indiavsbangladesh #SachinTendulkar #jadeja #Worlds2023 #ODIWorldCup2023 pic.twitter.com/edQl723MEO — humour Buck (@YasirSid6) October 19, 2023 Virat Kohli scores a century and everyone including Sachin FC, Rohit FC and Dhoni FC starts crying. Imagine the scenes when Virat Kohli will actually break Sachin Tendulkar ODI ton record. pic.twitter.com/eZdplr6tKf — Pari (@BluntIndianGal) October 19, 2023 Coming to the match, Bangladesh opted to bat first and there was a 91-run opening stand between Tanzid Hasan (51 in 43 balls with four boundaries and three sixes) and Litton Das (66 in 82 balls, with seven fours). Following that, Bangladesh kept losing wickets at regular intervals, though important knocks came from Mahmudullah (46 in 36 balls, with three fours and three sixes) and wicketkeeper-batter Mushfiqur Rahim (38 in 46 balls, with a four and six) that took Bangladesh to 256/8 in 50 overs. Ravindra Jadeja (2/38) and Jasprit Bumrah (2/41) were the pick of the bowlers for India. Mohammed Siraj took two wickets as well while Kuldeep Yadav and Shardul Thakur got one each. In the chase of 257, skipper Rohit Sharma (48 in 40 balls, with seven fours and two sixes) and Shubman Gill (53 in 55 balls with five fours and two sixes) decided the outcome with their partnership itself. Virat's century and partnership with KL Rahul (34*), which saw some entertaining running between the wickets was an icing on the cake. Mehidy Hasan Miraz took two wickets for Bangladesh. With four wins in four matches, India is in the second spot in the points table with eight points. New Zealand is at the top with a better net-run-rate. Bangladesh is in the seventh spot with one win and three losses. Virat became the 'Man of the Match' for his ton.","pubDate":"2023-10-19 17:20:00","image_url":null,"source_id":"zeenews","source_priority":5319,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"21f6c24e420067e3305cdba41a0dbee8","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.southwalesguardian.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Ben Stokes is set to make an overdue return to the World Cup stage this weekend but he feared his tournament was over before it had even started when he “heard a pop” while training in the gym. Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.southwalesguardian.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"91ae8339a28fefb20e5cd102ee729763","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.northwaleschronicle.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Ben Stokes is set to make an overdue return to the World Cup stage this weekend but he feared his tournament was over before it had even started when he “heard a pop” while training in the gym. Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dcb9e6a5de37f9ef07e11a68ceecc6b9","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.andoveradvertiser.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.andoveradvertiser.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"andoveradvertiser","source_priority":6475270,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"58820ca882059c8ea6018a9f17079b27","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.northwalespioneer.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Ben Stokes is set to make an overdue return to the World Cup stage this weekend but he feared his tournament was over before it had even started when he “heard a pop” while training in the gym. Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.northwalespioneer.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"381196242ad04dceea2664aacf358be5","title":"Cricket World Cup 2023: India thrashes Bangladesh, registers 4th consecutive win; Virat Kohli showes his class","link":"https://organiser.org/2023/10/19/202444/sports/cricket-world-cup-2023-india-thrashes-bangladesg-registers-4th-consecutive-win-virat-kohli-showes-his-class/","keywords":["Cricket","Sports","FEATURED","MAIN","Virat Kohli","ICC Cricket World Cup 2023","Jasprit Bumrah","Cricket World Cup 2023","India Vs Bangladesh","MCA Ground"],"creator":["WEB DESK"],"video_url":null,"description":"Pune: Team India’s remarkable performance in the World Cup 2023 continues as they secured their fourth consecutive win in the tournament. The Indian cricket team defeated Bangladesh by seven wickets in a thrilling match that took place at Pune’s MCA Ground. Virat Kohli played a pivotal role in this victory, showcasing his brilliant form with the bat. Kohli notched up his 48th One Day International (ODI) century, making him the fastest to reach 26,000 international runs. This impressive feat was accomplished in just 567 matches, surpassing the previous record held by cricket legend Sachin Tendulkar, who achieved this milestone in 600 matches. The celebration of King Kohli after the century No 78 🔥 Virat Kohli 🔥#INDvsBAN #indiavsbangladesh#ViratKohli pic.twitter.com/CIASkjBrRd — VINEETH𓃵🦖 (@sololoveee) October 19, 2023 Bangladesh won the toss and elected to bat first at the MCA Ground in Pune. They managed to score 256 runs for the loss of eight wickets in their allotted 50 overs. In pursuit of the target, India’s opening batsmen Rohit Sharma and Shubman Gill established an excellent partnership, adding 88 runs. Rohit Sharma, however, fell just short of his half-century, scoring 48 runs before being caught at the boundary off a delivery from Mehedi Hasan. 2011 WC – Kohli scored the first century against Bangladesh• Result – India Won the world cup 2023 – Kohli scored the first century against Bangladesh• Result – We Are coming for that WC#ViratKohli #WorldCup2023 #INDvsBANpic.twitter.com/VgMGw6wxic — ꜱᴘɪᴅᴇʏ (@AnushSpidey1) October 19, 2023 Shubman Gill, playing in his first World Cup, reached his maiden ODI fifty, scoring 53 runs before being caught by Mahmudullah Miraz off Mehedi Hasan’s bowling. Mahmudullah later held another catch at backward point to dismiss Gill. India achieved the target of 257 runs with 8.3 overs remaining, with Rohit Sharma and Shubman Gill’s contributions being significant. Half-century for Shubman Gill! 👌👌#TeamIndia moving along nicely in the chase at 128/1 Follow the match ▶️ https://t.co/GpxgVtP2fb#CWC23 | #INDvBAN | #MenInBlue pic.twitter.com/iUwxC7LdcL — BCCI (@BCCI) October 19, 2023 In the Bangladesh innings, their openers, Tamim Iqbal and Liton Das, put up a partnership of 93 runs. Tamim Iqbal scored his first World Cup fifty with 51 runs, but he was eventually dismissed. Liton Das also reached his 12th ODI fifty, scoring 66 runs before getting out. Despite the partnership between Mushfiqur Rahim (38 runs) and Mahmudullah (46 runs), Bangladesh couldn’t post a challenging total. India’s bowlers, led by Jasprit Bumrah and Ravindra Jadeja, took crucial wickets to restrict Bangladesh’s progress. During the match, Hardik Pandya suffered an injury, and Virat Kohli took over the bowling responsibilities for the first time in six years. Kohli’s last appearance as a bowler in an ODI was in 2017, against Sri Lanka. KL Rahul, India’s wicketkeeper, displayed his acrobatic skills in the field by taking a stunning diving catch in the 25th over. The catch came off a delivery from Mohammed Siraj, and Mehedi Hasan Miraz was the batsman who was dismissed. India’s win in this match is a testament to their strong form and depth in both batting and bowling, making them one of the top contenders in the World Cup 2023. With this win, India maintains its unbeaten streak in the tournament and further solidifies its position as a frontrunner in the World Cup. Cricket enthusiasts around the world eagerly await their next match to see if Team India can continue their winning streak and bring home the coveted trophy.","content":"Pune: Team India’s remarkable performance in the World Cup 2023 continues as they secured their fourth consecutive win in the tournament. The Indian cricket team defeated Bangladesh by seven wickets in a thrilling match that took place at Pune’s MCA Ground. Virat Kohli played a pivotal role in this victory, showcasing his brilliant form with the bat. Kohli notched up his 48th One Day International (ODI) century, making him the fastest to reach 26,000 international runs. This impressive feat was accomplished in just 567 matches, surpassing the previous record held by cricket legend Sachin Tendulkar, who achieved this milestone in 600 matches. Bangladesh won the toss and elected to bat first at the MCA Ground in Pune. They managed to score 256 runs for the loss of eight wickets in their allotted 50 overs. In pursuit of the target, India’s opening batsmen Rohit Sharma and Shubman Gill established an excellent partnership, adding 88 runs. Rohit Sharma, however, fell just short of his half-century, scoring 48 runs before being caught at the boundary off a delivery from Mehedi Hasan. Shubman Gill, playing in his first World Cup, reached his maiden ODI fifty, scoring 53 runs before being caught by Mahmudullah Miraz off Mehedi Hasan’s bowling. Mahmudullah later held another catch at backward point to dismiss Gill. India achieved the target of 257 runs with 8.3 overs remaining, with Rohit Sharma and Shubman Gill’s contributions being significant. In the Bangladesh innings, their openers, Tamim Iqbal and Liton Das, put up a partnership of 93 runs. Tamim Iqbal scored his first World Cup fifty with 51 runs, but he was eventually dismissed. Liton Das also reached his 12th ODI fifty, scoring 66 runs before getting out. Despite the partnership between Mushfiqur Rahim (38 runs) and Mahmudullah (46 runs), Bangladesh couldn’t post a challenging total. India’s bowlers, led by Jasprit Bumrah and Ravindra Jadeja, took crucial wickets to restrict Bangladesh’s progress. During the match, Hardik Pandya suffered an injury, and Virat Kohli took over the bowling responsibilities for the first time in six years. Kohli’s last appearance as a bowler in an ODI was in 2017, against Sri Lanka. KL Rahul, India’s wicketkeeper, displayed his acrobatic skills in the field by taking a stunning diving catch in the 25th over. The catch came off a delivery from Mohammed Siraj, and Mehedi Hasan Miraz was the batsman who was dismissed. India’s win in this match is a testament to their strong form and depth in both batting and bowling, making them one of the top contenders in the World Cup 2023. With this win, India maintains its unbeaten streak in the tournament and further solidifies its position as a frontrunner in the World Cup. Cricket enthusiasts around the world eagerly await their next match to see if Team India can continue their winning streak and bring home the coveted trophy.","pubDate":"2023-10-19 16:50:23","image_url":null,"source_id":"organiser","source_priority":216805,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"ca4430ad8530f373caf5ffd06c32c867","title":"Kohli hundred gives India fourth straight win","link":"https://www.ft.lk/sports/Kohli-hundred-gives-India-fourth-straight-win/23-754269","keywords":null,"creator":null,"video_url":null,"description":null,"content":"PUNE: Virat Kohli scored his 48th ODI hundred as India coasted to a seven-wicket win over Bangladesh to draw level on points with New Zealand in a Cricket World Cup match played at Maharashtra CA Stadium here Thursday. A target of 257 was going to be a challenging one, but Rohit Sharma put India in control with a 40-ball 48 and Shubman Gill helped himself to a maiden World Cup fifty (53 off 55 balls, 5 fours, 2 sixes), but it was Kohli who dominated the batting from there onwards. Bangladesh was not able to curb the run-flow, even after dismissing Sharma and to an extent, they only had themselves to blame, offering Kohli two free hits to get him underway. The game gradually slipped out of their grasp as Kohli and Lokesh Rahul carried India to victory with an unbroken 83-run stand. It didn’t look as if Kohli could reach his century when India was coasting along with about 25 runs to win, but Kohli took it onto himself to reach three-figures. He refused singles unless it was the last ball of the over, ran hard to convert ones into twos and left Rahul watching, as a mere spectator as he reached his hundred with the winning blow, a six off 97 balls (6 fours, 4 sixes). Bangladesh never really tested this strong Indian batting line-up and they’ve slipped to their third straight loss. India’s only worry would be the injury to all-rounder Hardik Pandya who seemed to twist his ankle while fielding and did not come out to bat. India made a splendid comeback after a shaky start to keep Bangladesh down to 256-8, a total which seemed quite unlikely when Bangladesh raced away to 90-0 after 14 overs. Tanzid Hasan did the bulk of the scoring taking down the Indian bowlers towards the back end of the powerplay to score 51 off 43 balls (5 fours, 3 sixes) and Litton Das kept things ticking, getting to his half-century off 62 balls. As has been the case in the World Cup, India’s spinners stifled the opposition in the middle overs. Kuldeep Yadav got the initial breakthrough, with Ravindra Jadeja then picking up the Bangladesh captain Najmul Hossain Shanto soon after. Jadeja then accounted for Litton for 66 (82 balls, 7 fours) and set in motion a mini-collapse. Mahmudullah salvaged the innings towards the end with 46 off 36 balls (3 fours, 3 sixes) that saw his team past the 250-run mark. – (ST) Scores: Bangladesh 256-8 (50) (Tanzid Hasan 51, Litton Das 66, Mushfiqur Rahim 38, Mahmudullah 46, Jasprit Bumrah 2/46, Mohammad Siraj 2/60, Ravindra Jadeja 2/38) India 261-3 (41.3) (Rohit Sharma 48, Shubman Gill 53, Virat Kohli 103*, Lokesh Rahul 34*, Mehidy Hasan 2/47)","pubDate":"2023-10-19 22:55:20","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"4b3d792a54e709c3020d1835565ddcef","title":"Mathews and Chameera to join Sri Lanka’s injury-hit WC squad","link":"https://www.ft.lk/sports/Mathews-and-Chameera-to-join-Sri-Lanka-s--injury-hit-WC-squad/23-754272","keywords":null,"creator":null,"video_url":null,"description":null,"content":"LUCKNOW: Former captain and experienced all-rounder Angelo Mathews and fast bowler Dushmantha Chameera have been picked as travelling reserves to boost the injury-hit Sri Lanka cricket team currently participating in the 2023 Cricket World Cup in India. The travelling reserves spot became vacant when Chamika Karunaratne who was selected as the only player outside the squad came in as a replacement for Dasun Shanaka when the Sri Lanka captain suffered a leg injury and was ruled out of the tournament. A Sri Lanka Cricket (SLC) media release states: “The Sri Lanka Cricket selectors took this decision in order to ensure that the team has ready replacements in place to face contingencies, such as an injury to an existing squad member. Accordingly, Mathews and Chameera will join the team tomorrow (Friday).” Sri Lanka has been badly missing the services of Chameera with their bowlers - with the exception of Dilshan Madushanka - being carted around in the first three World Cup games for 988 runs at an average of 7.54 runs an over. Chameera failed to make it to the final World Cup squad of 15 as he was feeling discomfort while bowling at the nets while recovering from a torn pectoral muscle of his right bowling arm, which he suffered ahead of the World Cup Qualifier in Zimbabwe. After recovering from that he injured himself again in the Lanka Premier League (LPL) in August which kept him out of the Asia Cup. It’s really good news for Sri Lanka that he is fit, up and running. But for him to be included in the World Cup squad of 15 one of the existing players have to get injured or fall ill for the Event Technical Committee of the ICC Men’s Cricket World Cup to grant approval. It is the same with Mathews. The former skipper should have been picked initially for his experience alone. The present team lacks a proficient batter in the middle as witnessed by the batting collapses experienced in the Asia Cup final, as well as Sri Lanka’s first three matches of the World Cup. Sri Lanka’s World Cup campaign has been derailed by injuries to key bowlers like Chameera and leg-spinning all-rounder Wanindu Hasaranga, that has forced them to take a squad of inexperienced bowlers to the mega event, which has proved quite disastrous so far as Sri Lanka are the only team out of the ten taking part without a single win. Of the present side fast bowler Matheesha Pathirana is recovering from an injury to his right shoulder that saw him miss Sri Lanka’s last game against Australia and most probably Saturday’s match against Netherlands at Lucknow. “Pathirana’s under rehab. We will be checking tomorrow (Friday) whether he is fit to play,” said team manager Mahinda Halangoda.","pubDate":"2023-10-19 22:55:20","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8fcac91a36b9502a417f00d597c47711","title":"Bangladesh Emerging level unofficial ODI series 1-1","link":"https://www.ft.lk/sports/Bangladesh-Emerging-level-unofficial-ODI-series-1-1/23-754268","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Bangladesh Emerging squared the three-match unofficial ODI series one-all against Sri Lanka Emerging when they won the second match by 21 runs on the DLS method after bad weather had interrupted play at the Rangiri Dambulla Cricket Stadium Thursday. Sri Lanka Emerging batting first recovered from losing the first three wickets for 55 to total 297-7 courtesy fifties from captain Ahan Wickramasinghe (77 off 79 balls, 6 fours, 3 sixes) and Sonal Dinusha (62 off 70 balls, 5 fours). Bangladesh Emerging chasing a revised target of 180 off 36 overs reached 200-2 with Prantik Nawrose Nabil (92* off 116 balls, 9 fours, 1 six) and Mahmudul Hasan Joy (57* off 69 balls, 4 fours) sharing an unbroken partnership of 130 for the third wicket. Sri Lanka Emerging won the first unofficial ODI by 99 runs (DLS method) and the third and decisive match will be played at the same venue on Sunday 22 October. Scores: Sri Lanka Emerging 297-7 (50) (Sohan de Livera 23, Navod Paranavithana 37, Ahan Wickramasinghe 77, Sonal Dinusha 62, Vijayakanth Viyaskanth 25, Chamindu Wickramasinghe 28*, Musfik Hasan 3/56, Ahmed Sharif 2/53) Bangladesh Emerging 200-2 (36) (Parvez Hossain Emon 35, Prantik Nawrose Nabil 92*, Mahmudul Hasan Joy 57*)","pubDate":"2023-10-19 22:55:20","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"5d35d06304af0b8a2832fdb6ddcebda5","title":"India Beats Bangladesh: বিরাট ঝড়ে বেসামাল বাংলাদেশ, হারল ৭ উইকেটে","link":"https://bangla.latestly.com/india/news/india-beats-bangladesh-by-7-wickets-at-maharashtra-cricket-association-stadium-in-pune-255248.html","keywords":null,"creator":null,"video_url":null,"description":"প্রথমে ব্যাট করতে নেমে ৫০ ওভারে আট উইকেট হারিয়ে ২৫৬ রান করে বাংলাদেশ। পাল্টা ব্যাট করতে নেমে ৪১ ওভার তিন বলের মধ্যে তিন উইকেট হারিয়ে ২৬১ রান করে ভারত।","content":"পুনে: পুনের (Pune) মহারাষ্ট্র ক্রিকেট অ্যাসোসিয়েশনের (Maharashtra Cricket Association Stadium) মাঠে বিশ্বকাপের ম্যাচ (ICC Men's Cricket world cup 2023) খেলতে নেমে বাংলাদেশকে (Bangladesh) কার্যত উড়িয়ে দিল ভারত (India)। ৮ ওভার তিন বল বাকি থাকতেই ৭ উইকেটে হারিয়ে দিল প্রতিবেশী দেশকে (India beats Bangladesh)। প্রথমে ব্যাট করতে নেমে ৫০ ওভারে আট উইকেট হারিয়ে ২৫৬ রান করে বাংলাদেশ। পাল্টা ব্যাট করতে নেমে ৪১ ওভার তিন বলের মধ্যে তিন উইকেট হারিয়ে ২৬১ রান করে ভারত। সত্যি কথা বলতে আজকে পুনের স্টেডিয়ামে বিরাট কোহলির (Virat Kohli) অপরাজিত ১০৩ রানের দুর্দান্ত ইনিংস ভারতের জয় অনেক সোজা করে দেয়। ফলস্বরূপ ম্যান অফ দ্য ম্যাচের (Player of the Match) পুরস্কারও আসে তাঁর ঝুলিতে। আরও পড়ুন: Neymar Injury Update: ভারত সফরে আসছেন না নেইমার! হাঁটুর লিগামেন্ট ছিঁড়েছেন ব্রাজিল তারকা, সারতে ৯ মাস CWC 2023 | Virat Kohli in action against Bangladesh at Maharashtra Cricket Association Stadium in Pune. India won the match by 7 wickets and Virat Kohli (103*) won the 'Player of the Match' award. (Pic source: ANI Photos) pic.twitter.com/P7ID6ScdF9 — ANI (@ANI) October 19, 2023","pubDate":"2023-10-19 18:23:53","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"f118839e79366ea773b032cfb69a9504","title":"Cricket World Cup 2023: 'The GOAT,' Fans Can't Keep Calm As Virat Kohli Inches Close Sachin Tendulkar's ODI Century Record","link":"https://zeenews.india.com/cricket/cricket-world-cup-2023-the-goat-fans-cant-keep-calm-as-virat-kohli-inches-close-sachin-tendulkars-odi-century-record-2677510.html","keywords":null,"creator":null,"video_url":null,"description":"Cricket World Cup 2023: Virat Kohli became the 'Man of the Match' for his ton.","content":"Star India batter Virat Kohli had a historic outing in the ICC Cricket World Cup match against Bangladesh at Pune on Thursday. In the match, Virat smashed his match-winning century, 48th in ODIs and 78th at international level. He scored 103 runs in 97 balls with six fours and four sixes. His runs came at a strike rate of over 106. With this, he is just one away from levelling Sachin Tendulkar's record of 49 ODI centuries. Also, with his 78th international ton, just 23 centuries are left for him to overtake Sachin's record of 100 international centuries. Virat also brought up his 26,000 international runs, becoming the fastest to do so, in just 567 innings, leaving behind Sachin (600 innings). In 511 matches and 567 innings, Virat has scored 26,026 runs at an average of 53.99 and a strike rate of over 79. He has scored 78 centuries and 134 fifties, with the best score of 254*. (WATCH: Sara Tendulkar Joyfully Claps After Shubman Gill Hits Boundary During IND Vs BAN World Cup Clash, Video Goes Viral) With this, he also overtook Sri Lankan great Mahela Jayawardene (25,957 runs) to become the fourth-leading run-scorer of all time in international cricket. In 30 ICC Cricket World Cup matches, Virat has scored 1,289 runs at an average of 53.70, with three centuries and eight fifties in 30 innings, with the best score of 107. He is the fourth-highest run-scorer in WC history, with Sachin (2,278 runs) at the top. In this World Cup , Virat is the second-highest run-scorer. In four innings, he has scored 259 runs at an average of 129.50, with one century and two fifties, his best score is 103*. His strike rate is around 90. Checkout the fan reactions here: Congratulations to Virat Kohli for 48th Century Sachin Tendulkar - 49 Virat Kohli -48 Just 1 more century for breaking the record of the God Of cricket- Sachin Tendulkar and 2 more century for making record of first batsman who have 50 centuries in ODI https://t.co/bgos1rlkTt — Deep (@deep_kaintura7) October 19, 2023 Some records might never be broken.. 1) Bradman 99.98 avg 2) Sachin International Runs 3) Sachin 100 centuries ( closest is Kohli but still 20+ away) 4) Kohli avg in Chases 5) Rohit no. Of sixes All international.. I cannot see them broken in the next 20 years.. — logical Indian (@ybiyani0712) October 19, 2023 Great 100 by kohli . In ODIs, kohli is easily the greatest of all. Sachin is 2nd. Kohli literally mastered the trick of converting 50’s to 100’s. No one else knows it that well. Tendulkar was dismissed in the 90’s (both tests and ODIs) 28 times That’s also a record ! Or else… — kedar (@kedar9909) October 19, 2023 Who is actual GOAT of Cricket? Virat Kohli Like Sachin Retweets #ViratKohli #ViratKohli #GOAT #indiavsbangladesh #SachinTendulkar #jadeja #Worlds2023 #ODIWorldCup2023 pic.twitter.com/edQl723MEO — humour Buck (@YasirSid6) October 19, 2023 Virat Kohli scores a century and everyone including Sachin FC, Rohit FC and Dhoni FC starts crying. Imagine the scenes when Virat Kohli will actually break Sachin Tendulkar ODI ton record. pic.twitter.com/eZdplr6tKf — Pari (@BluntIndianGal) October 19, 2023 Coming to the match, Bangladesh opted to bat first and there was a 91-run opening stand between Tanzid Hasan (51 in 43 balls with four boundaries and three sixes) and Litton Das (66 in 82 balls, with seven fours). Following that, Bangladesh kept losing wickets at regular intervals, though important knocks came from Mahmudullah (46 in 36 balls, with three fours and three sixes) and wicketkeeper-batter Mushfiqur Rahim (38 in 46 balls, with a four and six) that took Bangladesh to 256/8 in 50 overs. Ravindra Jadeja (2/38) and Jasprit Bumrah (2/41) were the pick of the bowlers for India. Mohammed Siraj took two wickets as well while Kuldeep Yadav and Shardul Thakur got one each. In the chase of 257, skipper Rohit Sharma (48 in 40 balls, with seven fours and two sixes) and Shubman Gill (53 in 55 balls with five fours and two sixes) decided the outcome with their partnership itself. Virat's century and partnership with KL Rahul (34*), which saw some entertaining running between the wickets was an icing on the cake. Mehidy Hasan Miraz took two wickets for Bangladesh. With four wins in four matches, India is in the second spot in the points table with eight points. New Zealand is at the top with a better net-run-rate. Bangladesh is in the seventh spot with one win and three losses. Virat became the 'Man of the Match' for his ton.","pubDate":"2023-10-19 17:20:00","image_url":null,"source_id":"zeenews","source_priority":5319,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"21f6c24e420067e3305cdba41a0dbee8","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.southwalesguardian.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Ben Stokes is set to make an overdue return to the World Cup stage this weekend but he feared his tournament was over before it had even started when he “heard a pop” while training in the gym. Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.southwalesguardian.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"91ae8339a28fefb20e5cd102ee729763","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.northwaleschronicle.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Ben Stokes is set to make an overdue return to the World Cup stage this weekend but he feared his tournament was over before it had even started when he “heard a pop” while training in the gym. Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dcb9e6a5de37f9ef07e11a68ceecc6b9","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.andoveradvertiser.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.andoveradvertiser.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"andoveradvertiser","source_priority":6475270,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"58820ca882059c8ea6018a9f17079b27","title":"Fit-again Ben Stokes feared his World Cup was over before it started","link":"https://www.northwalespioneer.co.uk/sport/national/23867480.fit-again-ben-stokes-feared-world-cup-started/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes “heard a pop” as he trained in the gym in the build-up to the tournament.","content":"Ben Stokes is set to make an overdue return to the World Cup stage this weekend but he feared his tournament was over before it had even started when he “heard a pop” while training in the gym. Stokes has missed all three of England’s games so far, with details sketchy about the nature of the hip problem that occurred during the warm-up week in Guwahati. But the 32-year-old is now primed and ready for a comeback in Saturday’s must-win clash against South Africa in Mumbai and finally free to open up about worries he had sustained a major injury. “I actually ripped the fascia off my muscle. It was a very interesting one, a very rare one to do,” he said. “I did it in the gym…I heard it pop. So did our strength and conditioning coach. When I initially did it I thought I was done, because it’s not good hearing a pop. “I did think I was out but we got the scans back 36hrs, maybe two days, later and thankfully it wasn’t anywhere near as bad as we originally thought. “We got a programme in place straightaway, it went really well, and now I’m here now available for selection. I’ve worked very hard to get to where I am now and I’m pretty confident that everything will be good.” Stokes was put through his paces during a lengthy workout at the Wankhede Stadium on Thursday night, taking part in high-intensity fielding drills and enjoying a long batting stint in the nets. Meanwhile, Jofra Archer was also seen for the first time since joining up with the squad as a reserve, running in the outfield as he continued his recovery from a long stint on the sidelines. It is hard to over-estimate the importance of Stokes’ presence in the side as England look to cast off a modest start to their title defence and rediscover their mojo. Stokes’ presence has loomed large for a long time, be it his match-winning turn in the 2019 final, his clutch performance in the T20 equivalent last year or his remarkable reinvention of the Test team in his role as red-ball captain. Yet he is at pains to avoid being drawn as an incoming saviour, riding to his team-mates’ rescue. “We need to tone it down a bit on me coming back in,” he said. “I’m not the Messiah, I think Woody (Mark Wood) has already said that, which is true. I’m one person in a team sport…I know I’m just a very small part of a bigger entity. “Everyone who walks on to that field for England is a match-winner in their own right. All I can try and do is what I do every single time I wear an England shirt and give my absolute all.” Despite his protestations, Stokes remains much more than a cog in the machine. He was even dubbed the squad’s “spiritual leader” by head coach Matthew Mott after delivering a dressing room speech following their defeat to Afghanistan in Delhi. “That must be because we’re in India!” he said of his new job description. “But I know that people do listen when I talk. I don’t try and speak too much but I try and speak when I feel it’s the right time. “Jos Buttler and Motty have got a lot on their shoulders with it being a World Cup, so I try and help out as much as I can without stepping on their toes. “I find myself just reminding everyone of certain things – reinforcing what they are, who they are, what they’ve achieved in the game, how talented and how good they are at this sport.” And when it comes to Saturday’s high-stakes encounter at the Wankhede Stadium, his mission statement is clear: “If we’re going to go down, let’s go down doing what we’re known for. Defeat in Delhi. | — England Cricket (@englandcricket) “Let’s not be timid or restricted in what we want to do. We want to go out and show the opposition what England is and what we’ve been known for. We are double world champions in T20 and 50-over cricket. “You hear me say it a lot – I don’t care if we lose, I just want us to go out there and play in the way we talk about.” Stokes’ return means difficult decisions will need to be taken over the composition of the XI, with his stand-in Harry Brook having made a strong case for retention. A rebalancing of the side may be necessary, with all-rounders Sam Curran, Liam Livingstone and Chris Woakes proving an unconvincing engine room so far.","pubDate":"2023-10-19 17:12:54","image_url":"https://www.northwalespioneer.co.uk/resources/images/17352056/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"381196242ad04dceea2664aacf358be5","title":"Cricket World Cup 2023: India thrashes Bangladesh, registers 4th consecutive win; Virat Kohli showes his class","link":"https://organiser.org/2023/10/19/202444/sports/cricket-world-cup-2023-india-thrashes-bangladesg-registers-4th-consecutive-win-virat-kohli-showes-his-class/","keywords":["Cricket","Sports","FEATURED","MAIN","Virat Kohli","ICC Cricket World Cup 2023","Jasprit Bumrah","Cricket World Cup 2023","India Vs Bangladesh","MCA Ground"],"creator":["WEB DESK"],"video_url":null,"description":"Pune: Team India’s remarkable performance in the World Cup 2023 continues as they secured their fourth consecutive win in the tournament. The Indian cricket team defeated Bangladesh by seven wickets in a thrilling match that took place at Pune’s MCA Ground. Virat Kohli played a pivotal role in this victory, showcasing his brilliant form with the bat. Kohli notched up his 48th One Day International (ODI) century, making him the fastest to reach 26,000 international runs. This impressive feat was accomplished in just 567 matches, surpassing the previous record held by cricket legend Sachin Tendulkar, who achieved this milestone in 600 matches. The celebration of King Kohli after the century No 78 🔥 Virat Kohli 🔥#INDvsBAN #indiavsbangladesh#ViratKohli pic.twitter.com/CIASkjBrRd — VINEETH𓃵🦖 (@sololoveee) October 19, 2023 Bangladesh won the toss and elected to bat first at the MCA Ground in Pune. They managed to score 256 runs for the loss of eight wickets in their allotted 50 overs. In pursuit of the target, India’s opening batsmen Rohit Sharma and Shubman Gill established an excellent partnership, adding 88 runs. Rohit Sharma, however, fell just short of his half-century, scoring 48 runs before being caught at the boundary off a delivery from Mehedi Hasan. 2011 WC – Kohli scored the first century against Bangladesh• Result – India Won the world cup 2023 – Kohli scored the first century against Bangladesh• Result – We Are coming for that WC#ViratKohli #WorldCup2023 #INDvsBANpic.twitter.com/VgMGw6wxic — ꜱᴘɪᴅᴇʏ (@AnushSpidey1) October 19, 2023 Shubman Gill, playing in his first World Cup, reached his maiden ODI fifty, scoring 53 runs before being caught by Mahmudullah Miraz off Mehedi Hasan’s bowling. Mahmudullah later held another catch at backward point to dismiss Gill. India achieved the target of 257 runs with 8.3 overs remaining, with Rohit Sharma and Shubman Gill’s contributions being significant. Half-century for Shubman Gill! 👌👌#TeamIndia moving along nicely in the chase at 128/1 Follow the match ▶️ https://t.co/GpxgVtP2fb#CWC23 | #INDvBAN | #MenInBlue pic.twitter.com/iUwxC7LdcL — BCCI (@BCCI) October 19, 2023 In the Bangladesh innings, their openers, Tamim Iqbal and Liton Das, put up a partnership of 93 runs. Tamim Iqbal scored his first World Cup fifty with 51 runs, but he was eventually dismissed. Liton Das also reached his 12th ODI fifty, scoring 66 runs before getting out. Despite the partnership between Mushfiqur Rahim (38 runs) and Mahmudullah (46 runs), Bangladesh couldn’t post a challenging total. India’s bowlers, led by Jasprit Bumrah and Ravindra Jadeja, took crucial wickets to restrict Bangladesh’s progress. During the match, Hardik Pandya suffered an injury, and Virat Kohli took over the bowling responsibilities for the first time in six years. Kohli’s last appearance as a bowler in an ODI was in 2017, against Sri Lanka. KL Rahul, India’s wicketkeeper, displayed his acrobatic skills in the field by taking a stunning diving catch in the 25th over. The catch came off a delivery from Mohammed Siraj, and Mehedi Hasan Miraz was the batsman who was dismissed. India’s win in this match is a testament to their strong form and depth in both batting and bowling, making them one of the top contenders in the World Cup 2023. With this win, India maintains its unbeaten streak in the tournament and further solidifies its position as a frontrunner in the World Cup. Cricket enthusiasts around the world eagerly await their next match to see if Team India can continue their winning streak and bring home the coveted trophy.","content":"Pune: Team India’s remarkable performance in the World Cup 2023 continues as they secured their fourth consecutive win in the tournament. The Indian cricket team defeated Bangladesh by seven wickets in a thrilling match that took place at Pune’s MCA Ground. Virat Kohli played a pivotal role in this victory, showcasing his brilliant form with the bat. Kohli notched up his 48th One Day International (ODI) century, making him the fastest to reach 26,000 international runs. This impressive feat was accomplished in just 567 matches, surpassing the previous record held by cricket legend Sachin Tendulkar, who achieved this milestone in 600 matches. Bangladesh won the toss and elected to bat first at the MCA Ground in Pune. They managed to score 256 runs for the loss of eight wickets in their allotted 50 overs. In pursuit of the target, India’s opening batsmen Rohit Sharma and Shubman Gill established an excellent partnership, adding 88 runs. Rohit Sharma, however, fell just short of his half-century, scoring 48 runs before being caught at the boundary off a delivery from Mehedi Hasan. Shubman Gill, playing in his first World Cup, reached his maiden ODI fifty, scoring 53 runs before being caught by Mahmudullah Miraz off Mehedi Hasan’s bowling. Mahmudullah later held another catch at backward point to dismiss Gill. India achieved the target of 257 runs with 8.3 overs remaining, with Rohit Sharma and Shubman Gill’s contributions being significant. In the Bangladesh innings, their openers, Tamim Iqbal and Liton Das, put up a partnership of 93 runs. Tamim Iqbal scored his first World Cup fifty with 51 runs, but he was eventually dismissed. Liton Das also reached his 12th ODI fifty, scoring 66 runs before getting out. Despite the partnership between Mushfiqur Rahim (38 runs) and Mahmudullah (46 runs), Bangladesh couldn’t post a challenging total. India’s bowlers, led by Jasprit Bumrah and Ravindra Jadeja, took crucial wickets to restrict Bangladesh’s progress. During the match, Hardik Pandya suffered an injury, and Virat Kohli took over the bowling responsibilities for the first time in six years. Kohli’s last appearance as a bowler in an ODI was in 2017, against Sri Lanka. KL Rahul, India’s wicketkeeper, displayed his acrobatic skills in the field by taking a stunning diving catch in the 25th over. The catch came off a delivery from Mohammed Siraj, and Mehedi Hasan Miraz was the batsman who was dismissed. India’s win in this match is a testament to their strong form and depth in both batting and bowling, making them one of the top contenders in the World Cup 2023. With this win, India maintains its unbeaten streak in the tournament and further solidifies its position as a frontrunner in the World Cup. Cricket enthusiasts around the world eagerly await their next match to see if Team India can continue their winning streak and bring home the coveted trophy.","pubDate":"2023-10-19 16:50:23","image_url":null,"source_id":"organiser","source_priority":216805,"country":["india"],"category":["sports"],"language":"english"}]}