{"newsArray":[{"title":"Melbourne looks into hosting Pakistan vs India Test","link":"https://kashmirreader.com/2022/12/30/melbourne-looks-into-hosting-pakistan-vs-india-test/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"MELBOURNE: The Melbourne Cricket Club (MCC) is looking into the possibility of hosting a Test match between India and Pakistan, who have not played each other in the longest format of the game since 2007 with bilateral cricket between the neighbours suspended. Since India hosted Pakistan in a bilateral limited-overs series in 2013 the pair […]","content":"MELBOURNE: The Melbourne Cricket Club (MCC) is looking into the possibility of hosting a Test match between India and Pakistan, who have not played each other in the longest format of the game since 2007 with bilateral cricket between the neighbours suspended. Since India hosted Pakistan in a bilateral limited-overs series in 2013 the pair have only competed against each other at 20 and 50-overs World Cups and the Asia Cup. The last time they met was at the Twenty20 World Cup in October, where more than 90,000 fans piled into the Melbourne Cricket Ground to watch India win a last-ball thriller. MCC Chief Executive Stuart Fox said the atmosphere at that match showed there would be no problem filling the venue for a Test series between the two. “The atmosphere for that game, I’ve never felt anything like it,” Fox told radio station SEN. “The noise after every ball was phenomenal. Three (Tests) in a row would be lovely at the MCG, you’d fill it every time. “We’ve taken that up with Cricket Australia. I know the (Victoria) government has as well. It’s enormously complicated from what I can understand, amongst a really busy schedule. So I think that’s probably the greater challenge.” Fox said he hoped Cricket Australia would keep pushing the proposal with the International Cricket Council, the sport’s global governing body. “When you do see some of the stadiums around the world unoccupied, I think it would be much better to have a full house and that atmosphere and celebrating the game with full houses,” Fox added. —Agencies   KR Desk","pubDate":"2022-12-29 19:04:45","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian Cricket in 2022: A saga of forgettable year","link":"https://kashmirreader.com/2022/12/30/indian-cricket-in-2022-a-saga-of-forgettable-year/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Virat Kohli’s artistic sixes against Pakistan united fans from Kashmir to Kanyakumari in an otherwise underwhelming year for Indian cricket, which started with a promise of transformation but ended with the commencement of another difficult transition period. Indian cricket in 2022 was chaotic, to say the least and messy at most of the […]","content":"New Delhi: Virat Kohli’s artistic sixes against Pakistan united fans from Kashmir to Kanyakumari in an otherwise underwhelming year for Indian cricket, which started with a promise of transformation but ended with the commencement of another difficult transition period. Indian cricket in 2022 was chaotic, to say the least and messy at most of the time both on and off the field. The only saving grace was a Rs 48,000 crore IPL media rights deal, an indication of what market forces aspire the cricketing ecosystem to be. But on the field, it was a saga of disappointing results at least for the men. It started with a Test series defeat in South Africa which led to a dejected Virat Kohli stepping down from captaincy in the longest format. His relationship with the BCCI bigwigs was a fractured one after being sacked from ODI captaincy and he wanted to leave on his own terms. It happened in January and as the year comes to an end, Kohli’s illustrious heir Rohit Sharma too finds himself shunted from the national T20 captaincy. In an expected change of guard, Hardik Pandya emerged as a new leader of the national T20 team as Rohit paid the price for another semi-final exit in the T20 World Cup following defeat against England. In fact, it is the England team, which across formats is changing the grammar of cricket with an amazingly aggressive approach known as ‘Bazball’, a name, which is set to attain a cult status in years to come along with the golden generation of English players led by Ben Stokes and Jos Buttler. They played cricket in such an entertaining style that the Indian team’s “ideas cupboard” seemed bare in comparison. The Indian team looked good during bilaterals but came a cropper at the global events. No one knows when the trend will be bucked. Some of the bilateral series lacked context and hence Virat Kohli’s 71st and 72nd international hundreds in dead rubbers versus Afghanistan (T20) and Bangladesh (ODI) didn’t have a lot of currency. While Kohli’s straight six off Haris Rauf and his 82-run knock will forever remain a poetic nostalgia, the archaic approach of India’s senior batters, including that of skipper Rohit and KL Rahul, stuck out like a sore thumb during the T20 World Cup. It also didn’t go unnoticed that head coach Rahul Dravid’s decision-making has left a lot to be desired. From rushing a half-fit Jasprit Bumrah for a T20 series against Australia that aggravated his lower-back stress fracture, to not thinking of using wrist spinner Yuzvendra Chahal at the global event and dropping a performer like left-arm wrist spinner Kuldeep Yadav from a Test after a match-winning show, Dravid could never actually convince anyone that he is a shrewd tactician. In the case of Rohit, his dip in batting form also became an issue although he was the only one among the top three who had tried changing his game as per the needs of modern-day white-ball cricket. KL Rahul was the most disappointing of the lot and by the end of the year, it became clear that the Chetan Sharma-led panel’s wish of seeing a potential national leader in him had crash landed as he lost his T20 vice captaincy to Suryakumar Yadav and ODI deputy’s role to Hardik Pandya. Shreyas Iyer’s consistent run in Tests and ODIs, Rishabh Pant emerging as the current team’s most prolific Test match game changer and Jammu’s tearaway quick Umran Malik entering collective conscience were some of the positive signs. Shubman Gill realising his potential at the highest level and Ishan Kishan giving a glimpse of his phenomenal talent was also a good sign, looking forward. The year also marked the end of international careers of Ishant Sharma and Wriddhiman Saha, two workmanlike players, who had served the national team with distinction before being told that their time is up and Indian cricket is moving past them. PTI   Press Trust of Indiakashmirreader.com","pubDate":"2022-12-29 19:02:37","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Gambhir uncertain if Kohli, Rohit and Rahul slot in 2024 T20 World Cup plans","link":"https://www.thetimesofbengal.com/sports/gambhir-uncertain-if-kohli-rohit-and-rahul-slot-in-2024-t20-world-cup-plans/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"India are attributable to face Sri Lanka in three T20Is beginning January 3. For now, all indications are that Kohli","content":"Read Time:5 Minute, 48 Second India are attributable to face Sri Lanka in three T20Is beginning January 3. For now, all indications are that Kohli and Rahul have been rested for that collection, whereas Rohit is believed to want slightly extra time to totally get well from a finger harm he sustained three weeks in the past in Bangladesh. Senior quick bowler Bhuvneshwar Kumar additionally finds himself out of favour. With so many individuals out, Hardik Pandya, who was broadly tipped to get the job anyway, has been named India’s interim T20 captain with Suryakumar Yadav as his deputy. “There ought to be readability,” Gambhir, the previous India batter, advised ESPNcricinfo throughout an interplay facilitated by Star Sports activities on Thursday. “There ought to be good communication between the selectors and these gamers. If the selectors have determined to look past these guys, so be it. I believe lots of international locations have performed that. “We make an excessive amount of of a hue and cry when the selectors and administration look past sure people. Finally, it is not concerning the people, however the way you wish to go about your plans for the following [T20] World Cup [in 2024], since you wish to go in there and win it. If these guys have not been in a position to obtain that, I believe you by no means know. Individuals like Suryakumar, the youthful technology can go on to attain that dream.” Gambhir burdened the necessity to have clear plans in place for the 2024 T20 World Cup, and proper now, he’s discovering it exhausting to see Rohit, Kohli and Rahul becoming into these plans. “Personally, in the event you ask me, it seems to be robust,” Gambhir mentioned. “Individuals like Suryakumar Yadav, Ishan Kishan ought to all be within the combine. Hardik Pandya is there, I would prefer to attempt to get guys like Prithvi Shaw, Rahul Tripathi and Sanju Samson into the combination. They will play fearless cricket. “We have spoken a lot concerning the template and stuff going into the earlier [T20] World Cup, that we wish to play at a sure template, that we wish to play aggressive cricket, however when it got here to a crunch sport [semi-final against England], all that template went out of the window. “In all probability the brand new technology of cricketers may be capable of obtain that template and play the T20 cricket everybody needs India to play. So I really feel, if these guys proceed to do properly within the alternatives they get, it is going to be troublesome for the remainder of the the blokes who’ve been rested or most likely been dropped.” Gambhir: Pant ought to simply give attention to Take a look at cricket There are additionally some questions round Rishabh Pant, who hasn’t been picked for each the T20Is and ODIs towards Sri Lanka. No motive has been specified for his absence, though it’s believed he wants a while on the Nationwide Cricket Academy to arrange for the four-Take a look at collection towards Australia. For a lot of India’s build-up to the final T20 World Cup, the staff administration had most popular Dinesh Karthik as first-choice wicketkeeper. Pant performed solely two video games within the event, together with the semi-final, scoring 3 and 6. The numbers do not current any higher when taken over an extended time frame both. In all T20Is since 2021, Pant has 577 runs in 31 innings at a mean of 24.04 and strike price of 129.95 with one half-century. Given this, Gambhir feels Pant can be higher off simply specializing in his Take a look at match abilities. “To start with, the selectors have to be very clear if he is been rested or dropped,” Gambhir mentioned. “Based on me, he [must have been] dropped from white-ball cricket. There has by no means been sufficient readability. This phrase referred to as ‘relaxation’ is nice to have; it wasn’t there after we have been taking part in. Both we have been dropped or chosen. “Rishabh had received his alternatives in white-ball cricket and hasn’t been in a position to seize it, and another person like Ishan Kishan has been in a position to seize it. So most likely now he ought to simply give attention to red-ball cricket, and if his flip comes, each time he will get that chance, try to seize it. “I do not see that occuring within the close to future, if Ishan continues to play the way in which he is taking part in. As a result of we maintain speaking about that template, however individuals like Prithvi Shaw, Ishan Kishan, Suryakumar Yadav – that template involves them naturally. “Everybody needs to see Indian cricket extra brave and fearless. These guys can play in a pure method. Rishabh has received that chance, so he cannot blame or complain. He is received the chance to open, bat at 3-4-5-6, the administration has given him each alternative to achieve white-ball cricket, however he hasn’t been in a position to. I believe he can think about red-ball cricket, which isn’t dangerous for Rishabh as a result of a minimum of his complete focus is on his preserving and the way he can bat at No. 5 or 6 in Take a look at cricket.” Sangakkara: Hope India can provide Samson an prolonged run The Sri Lanka T20Is might also give Samson an opportunity to determine himself within the Indian staff. Since his debut in 2015, he is had not more than three video games back-to-back, and in 16 T20Is, he is managed only one half-century, a 42-ball 77 towards Eire in Malahide in June 2022. That is in sharp distinction to the way in which he performs within the IPL, the place he’s the sixth-highest run-getter over the past three years. Kumar Sangakkara, who works intently with Samson at Rajasthan Royals, believes India could also be dropping out on Samson’s finest years, however now is a chance to appropriate that. “He is received nice ability,” Sangakkara mentioned. “The character of choice in worldwide cricket is that you must be able to play out of place. You must be versatile and Sanju has been. What Sanju has to do is management what he does within the center when he will get an opportunity. I’ve had plenty of conversations with him. He takes lots of satisfaction in preparation and to play for India. I simply hope they can provide him a pleasant, prolonged run in order that he can settle in and never have the nagging suspicion that he could also be dropped for the following match or the following collection. That is a tricky place to be in for him or for anybody.” Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 16:50:35","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Inexperienced set to endure surgical procedure, Starc might miss opening Take a look at in opposition to India","link":"https://www.thetimesofbengal.com/sports/inexperienced-set-to-endure-surgical-procedure-starc-might-miss-opening-take-a-look-at-in-opposition-to-india/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Younger Australian all-rounder Cameron Inexperienced would require surgical procedure to restore a fractured proper index finger, although surgeons are hopeful","content":"Read Time:2 Minute, 42 Second Younger Australian all-rounder Cameron Inexperienced would require surgical procedure to restore a fractured proper index finger, although surgeons are hopeful the 23-year-old ought to get better in time to be thought-about for choice for the Border-Gavaskar sequence in India starting on February 9. Nevertheless, tempo spearhead Mitchell Starc faces a probably longer keep on the sidelines and shall be in a race in opposition to time to show his health for the four-Take a look at sequence in India after he too suffered a finger damage whereas fielding throughout the Boxing Day Take a look at in opposition to South Africa. The pair is already out of the third and ultimate Take a look at in opposition to South Africa at Sydney. A report in cricket.com.au stated on Thursday after Australia’s innings and 182-run win in opposition to the Proteas within the second Take a look at that Inexperienced had consulted a specialist, who had really helpful surgical procedure. Inexperienced was hit on the finger by an Anrich Nortje bouncer and was compelled to retire on day two, however he batted by ache on the third day to attain an unbeaten half-century. Starc, although, doesn’t require surgical procedure for the tendon injury to his left center finger, however the 32-year-old fast won’t be accessible for the sequence opener in opposition to India in Nagpur on February 9. “India’s the following huge tour and we’ll see the place the timeframe is with that. It is my bowling hand so I’ve acquired to be fairly cautious and ensure it heals correctly,” Starc was quoted as saying after win in opposition to the Proteas. Australia’s Mitchell Starc. File| Picture Credit score:AP “The irony is (Inexperienced) shall be again earlier than I’m. Bones are a bit faster within the therapeutic course of, the tendon is somewhat bit totally different. I feel we’ll each be seeing the identical specialist. “I nonetheless suppose everybody’s assured it is going to be extra front-end (of India tour). It can clearly depend upon the way it heals and the way rapidly it will probably do what it must do,” added Starc. The left-arm pacer bowled by ache as he despatched down 18 overs within the second innings and took the wicket of Proteas opener Sarel Erwee. “I wasn’t certain what to anticipate. I want the center finger for management greater than something,” stated Starc, who suffered the damage whereas fielding. “I’ve had plenty of painkillers. I might have jabbed it (to numb the finger) however I really feel like I want the sensation of the ball on finger, in any other case I really feel like I might have been spraying it all over the place. “I’ve performed with a damaged foot earlier than… it is Take a look at match cricket. I have been on each side of being injured after which (bowling as a part of an assault) with one man down. Having (Cameron) Greeny with a busted finger as properly most likely helped that call to attempt to push by,” he added. Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 16:26:40","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia hammer South Africa to win second Test and series","link":"https://www.kuwaittimes.com/australia-hammer-south-africa-to-win-second-test-and-series/","keywords":["Cricket","Sports"],"creator":["kuwaittimes"],"video_url":null,"description":"MELBOURNE: South Africa were on the wrong end of a “hammering” against rampant top-ranked Australia on Thursday, losing the second Test by 182 runs and with it the series. The loss capped a dismal first two Tests for the visitors who slumped by six wickets in the opener at Brisbane inside two days, with a … The post Australia hammer South Africa to win second Test and series appeared first on Kuwait Times.","content":"South Africa were on the wrong end of a “hammering” against rampant top-ranked Australia on Thursday, losing the second Test by 182 runs and with it the series. The loss capped a dismal first two Tests for the visitors who slumped by six wickets in the opener at Brisbane inside two days, with a potential face-saving third match at Sydney still to play. “It is not easy at the moment. That was bit of a hammering,” Proteas skipper Dean Elgar said. Australia declared on Wednesday at 575-8 built on the back of man-of-the-match Warner’s 200 and a gutsy 85 from Steve Smith in searing heat, in reply to South Africa’s first innings 189, and then took complete control with the ball. South Africa resumed day four on 15-1 after Elgar went for a duck before rain halted play early on Wednesday. But their resistance didn’t last long with three wickets falling before lunch at the Melbourne Cricket Ground and the rest in the second session as they succumbed for 204. Temba Bavuma top-scored with 65 while Nathan Lyon took 3-58 in a depleted, injury-hit, attack. “The win is right up there. We have had a number of great contests against South Africa over the years. It’s really sweet and something to be proud of,” said Australian skipper Pat Cummins. “I thought how Warner and Smith batted in the heat was pretty gutsy. (Mitchell) Starc and (Cameron) Green as well, put their injuries behind them and turned up.” It leaves South Africa facing a trip to Sydney next week for the final Test with only pride to play for and potentially some changes to a batting line up that has largely failed to fire. “We have got to do a lot of reflection going ahead once again. There are a few positives coming out of this Test but not a lot,” Elgar said. “There’s lot to play for (in Sydney), South Africa are a proud cricketing nation and 2-1 sounds a lot better than 3-0,” he added. Australia will have a new-look team with Green and Starc already ruled out with finger injuries as they race the clock to be ready for a blockbuster series in India in February. Josh Hazlewood is set to return for Starc after recovering from a side strain, with Green’s replacement to be decided. The wickets fell despite the hosts’ attack being depleted, with Green, who took 5-27 in their first innings, not bowling due to a fractured finger. Theunis de Bruyn (28), Sarel Erwee (21) and Khaya Zondo (one) all departed before lunch at the hands of Australia’s high-class pace attack. Then the spin of Nathan Lyon, and two careless run outs, ended any hope they had in the second session. Starc was also nursing a bruised and bloodied finger, but he played through the pain and his sheer pace caused plenty of problems. Erwee, who resumed on seven, hit a superb drive for four off him as his confidence grew, but Starc quickly got his revenge, trapping him lbw with a cracking yorker. De Bruyn began on six and built up to 28, but he soon followed his teammate back to the pavilion. This time Scott Boland did the damage, enticing an edge that was taken by the ever-reliable Smith in the slips for his 150th catch. He is 14th on the all-time list, led by Indian great Rahul Dravid’s 210. South Africa were under the pump and needed to dig in, but Bavuma inexplicably attempted a single from Cummins and Khaya Zondo was easily run out by a Travis Head underarm throw. It left them teetering at 65-4 before Bavuma and Kyle Verreynne knuckled down. But Boland struck again soon after lunch with Verreynne, one of their best batsmen this series, out lbw for 33. Lyon’s spin removed Marco Jansen before another disastrous run out involving Bavuma, with Keshav Maharaj out after a confusing mix-up and Starc made a direct hit. More weak dismissals by Lyon and a rare wicket for Smith ended the match. – AFP","pubDate":"2022-12-29 16:19:28","image_url":null,"source_id":"kuwaittimes","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"Transitions are inevitable however Hardik has substances to achieve success: Sangakkara","link":"https://www.thetimesofbengal.com/sports/transitions-are-inevitable-however-hardik-has-substances-to-achieve-success-sangakkara/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"By PTI NEW DELHI: The transition interval in a world group is all the time “troublesome to deal with” however","content":"Read Time:9 Minute, 36 Second By PTI NEW DELHI: The transition interval in a world group is all the time “troublesome to deal with” however India has ample expertise and a probably good chief in Hardik Pandya to easily see by way of the section in T20 cricket, feels former Sri Lanka captain Kumar Sangakkara. India will play six white-ball matches towards Sri Lanka within the new 12 months with Pandya changing Rohit Sharma as captain for T20Is beginning January 3. The squad additionally would not have KL Rahul and Virat Kohli which is an indicator that Indian cricket will bear a transition from this collection. “Transition is inevitable. It’s important to be all the time prepared for it. However you want supporting gamers to return by way of the system for it to be efficient easily,” Sangakkara advised PTI throughout an interplay organised by Star Sports activities, the official broadcaster of the upcoming Sri Lanka tour of India. “Each aspect goes by way of troublesome transitions and we noticed that in Australia. Noticed that in NZ for a substantial interval a while again, even in England. So you will have all these sides undergo transition and issue is a standard theme,” he cited the widespread phenomenon. For the Lankan legend, it is very important give the recent faces an extended rope. “It’s important to have belief in gamers that you choose, trusting them for lengthy durations, giving them publicity and grounding they require in order that they’ll settle in worldwide cricket and perceive what it’s all about.” For Sri Lanka particularly, the transition has been actually troublesome ever because the likes of Sangakkara and Mahela Jayawardene retired. “India has a throng of younger gamers coming by way of so it’s nearly selecting the right amongst them and giving them an extended run,” Sangakkara noticed. Nevertheless, he waxed eloquently about Pandya having watched his captaincy for Gujarat Titans whereas being a mentor for Rajasthan Royals within the IPL. “There isn’t a doubt that his management is superb and all of us noticed that in IPL. Now he has to soften that with on-field captaincy at a nationwide stage. He has all qualities to be a frontrunner though you do not essentially must be a captain to be a frontrunner.” “However there are features of captaincy that Pandya must be conscious of and Sangakkara handed a guidelines to the Baroda man. “Now captaincy on the sphere is usually a completely different factor. To learn moments, win moments and strategize, you must be sharp, and I believe Hardik has all substances to be a very good captain. “The toughest half is to encourage, speak and handle his gamers in a gaggle collectively to play with a imaginative and prescient and the remaining will include expertise, captaining in shut video games,” he added. So far as new the Indian T20 group is worried, Sangakkara would observe Ruturaj Gaikwad and Sanju Samson. “I really like watching Ruturaj Gaikwad’s batting and he’s one participant who can bat accurately and but have an infinite impression in T20 cricket and naturally Sanju Samson as I wish to see Sanju getting a future on this Indian aspect. As a result of he’s a really particular participant, so they’ve a very good combination of tempo, spin and utility gamers. Will probably be a troublesome problem for Sri Lanka however in T20 they’ve instruments to match them.” The Asian champions on this format are a drive to reckon with. You’ve gotten skipper Dasun Shanaka, Charith Asalanka, Pathum Nissanka, Kusal Mendis. They’ve a high order that may enable SL to set large totals. A powerhouse center and late order with skipper Shanaka, Bhanuka Rajapaksa and Wanindu Hasaranga coming in. SL bat deep and now we have the spin combo of Mahesh Theeksana and Hasaranga, topped up by the uncooked tempo of Lahiru Kumara and Dilshan Madhusanka. Pant must work on his holding Rishabh Pant is not part of white ball video games towards Sri Lanka and Sangakkara believes that greater than the batting, it’s his holding that warrants enchancment. “I believe for one Rishabh Pant can enhance his wicketkeeping fairly a bit. Lots of people solely think about his batting, and it’s a mixture of the 2 that will increase confidence. “I do know it’s onerous and boring however he can actually grow to be good by concentrating on smaller moments and that in flip will assist him in white ball cricket, after which he’ll grow to be the keeper he’s anticipated to grow to be.” With regards to batting, Sangakkara desires him to be even handed in his selection of whom to assault and when to assault. “In his batting, I’ve obtained little doubt that he has obtained all of the pictures, potential and expertise however it’s about understanding the way you construct an innings in T20 cricket, realizing which bowlers to assault and be a little bit sensible.” T20 is not only for younger Is T20 with its calls for more and more turning into a sport the place gamers pushing in the direction of their mid-30s or of their late 30s have gotten much less related? “I by no means thought it’s about age. I simply take a look at the ability and I believe it is a sport for many expert gamers. Cricket is a sport for the highest-skilled gamers and those that are finest among the many highest-skilled will solely survive.” “You bought to be performing. For those who do not, then nothing works. It is a sport for the extremely expert, who’re artistic and drawback solvers in fast time,” he concluded. NEW DELHI: The transition interval in a world group is all the time “troublesome to deal with” however India has ample expertise and a probably good chief in Hardik Pandya to easily see by way of the section in T20 cricket, feels former Sri Lanka captain Kumar Sangakkara. India will play six white-ball matches towards Sri Lanka within the new 12 months with Pandya changing Rohit Sharma as captain for T20Is beginning January 3. The squad additionally would not have KL Rahul and Virat Kohli which is an indicator that Indian cricket will bear a transition from this collection. “Transition is inevitable. It’s important to be all the time prepared for it. However you want supporting gamers to return by way of the system for it to be efficient easily,” Sangakkara advised PTI throughout an interplay organised by Star Sports activities, the official broadcaster of the upcoming Sri Lanka tour of India. “Each aspect goes by way of troublesome transitions and we noticed that in Australia. Noticed that in NZ for a substantial interval a while again, even in England. So you will have all these sides undergo transition and issue is a standard theme,” he cited the widespread phenomenon. For the Lankan legend, it is very important give the recent faces an extended rope. “It’s important to have belief in gamers that you choose, trusting them for lengthy durations, giving them publicity and grounding they require in order that they’ll settle in worldwide cricket and perceive what it’s all about.” For Sri Lanka particularly, the transition has been actually troublesome ever because the likes of Sangakkara and Mahela Jayawardene retired. “India has a throng of younger gamers coming by way of so it’s nearly selecting the right amongst them and giving them an extended run,” Sangakkara noticed. Nevertheless, he waxed eloquently about Pandya having watched his captaincy for Gujarat Titans whereas being a mentor for Rajasthan Royals within the IPL. “There isn’t a doubt that his management is superb and all of us noticed that in IPL. Now he has to soften that with on-field captaincy at a nationwide stage. He has all qualities to be a frontrunner though you do not essentially must be a captain to be a frontrunner.” “However there are features of captaincy that Pandya must be conscious of and Sangakkara handed a guidelines to the Baroda man. “Now captaincy on the sphere is usually a completely different factor. To learn moments, win moments and strategize, you must be sharp, and I believe Hardik has all substances to be a very good captain. “The toughest half is to encourage, speak and handle his gamers in a gaggle collectively to play with a imaginative and prescient and the remaining will include expertise, captaining in shut video games,” he added. So far as new the Indian T20 group is worried, Sangakkara would observe Ruturaj Gaikwad and Sanju Samson. “I really like watching Ruturaj Gaikwad’s batting and he’s one participant who can bat accurately and but have an infinite impression in T20 cricket and naturally Sanju Samson as I wish to see Sanju getting a future on this Indian aspect. As a result of he’s a really particular participant, so they’ve a very good combination of tempo, spin and utility gamers. Will probably be a troublesome problem for Sri Lanka however in T20 they’ve instruments to match them.” The Asian champions on this format are a drive to reckon with. You’ve gotten skipper Dasun Shanaka, Charith Asalanka, Pathum Nissanka, Kusal Mendis. They’ve a high order that may enable SL to set large totals. A powerhouse center and late order with skipper Shanaka, Bhanuka Rajapaksa and Wanindu Hasaranga coming in. SL bat deep and now we have the spin combo of Mahesh Theeksana and Hasaranga, topped up by the uncooked tempo of Lahiru Kumara and Dilshan Madhusanka. Pant must work on his holding Rishabh Pant is not part of white ball video games towards Sri Lanka and Sangakkara believes that greater than the batting, it’s his holding that warrants enchancment. “I believe for one Rishabh Pant can enhance his wicketkeeping fairly a bit. Lots of people solely think about his batting, and it’s a mixture of the 2 that will increase confidence. “I do know it’s onerous and boring however he can actually grow to be good by concentrating on smaller moments and that in flip will assist him in white ball cricket, after which he’ll grow to be the keeper he’s anticipated to grow to be.” With regards to batting, Sangakkara desires him to be even handed in his selection of whom to assault and when to assault. “In his batting, I’ve obtained little doubt that he has obtained all of the pictures, potential and expertise however it’s about understanding the way you construct an innings in T20 cricket, realizing which bowlers to assault and be a little bit sensible.” T20 is not only for younger Is T20 with its calls for more and more turning into a sport the place gamers pushing in the direction of their mid-30s or of their late 30s have gotten much less related? “I by no means thought it’s about age. I simply take a look at the ability and I believe it is a sport for many expert gamers. Cricket is a sport for the highest-skilled gamers and those that are finest among the many highest-skilled will solely survive.” “You bought to be performing. For those who do not, then nothing works. It is a sport for the extremely expert, who’re artistic and drawback solvers in fast time,” he concluded. Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 16:14:36","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"If BCCI Selectors Need To Look Past Virat Kohli, Rohit Sharma, KL Rahul, so be it: Gautam Gambhir | Cricket Information","link":"https://www.thetimesofbengal.com/sports/if-bcci-selectors-need-to-look-past-virat-kohli-rohit-sharma-kl-rahul-so-be-it-gautam-gambhir-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Double world champion Indian opener Gautam Gambhir believes that if the nationwide choice committee believes in trying past seniors like","content":"Read Time:2 Minute, 31 Second Double world champion Indian opener Gautam Gambhir believes that if the nationwide choice committee believes in trying past seniors like Virat Kohli, Rohit Sharma and KL Rahul, then “so be it”. The very best particular person scorer in 2007 and 2011 World Cup triumphs additionally desires extra readability on the subject of the standing of particular person gamers vis-a-vis their place within the crew. The BCCI has not clarified if the trio together with Rishabh Pant has been rested or dropped for white-ball collection in opposition to Sri Lanka beginning January 3. “There ought to be readability. There ought to be good communication between the selectors and these gamers. If the selectors have determined to look past these guys, so be it. I believe a number of nations have finished that,” Gambhir instructed ESPNcricinfo on Thursday. Gambhir did not perceive the fuss about dropping of senior gamers. “We make an excessive amount of of a hue and cry when the selectors and administration look past sure people. “In the end, it is not in regards to the people, however the way you wish to go about your plans for the subsequent (T20) World Cup (in 2024), since you wish to go in there and win it. If these guys have not been capable of obtain that, I believe you by no means know. Individuals like Suryakumar, the youthful technology can go on to attain that dream.” Gambhir felt that the comeback of the trio within the shortest format appears powerful as of now. “Personally, in the event you ask me, it appears powerful,” Gambhir stated. “Individuals like Suryakumar Yadav, Ishan Kishan ought to all be within the combine. Hardik Pandya is there, I would prefer to attempt to get guys like Prithvi Shaw, Rahul Tripathi and Sanju Samson into the combination. They’ll play fearless cricket.” Gambhir did not overlook to take a dig on the “aggressive template” usually spoken in public boards by the present crew administration headed by Rahul Dravid as mere lip service. “We have spoken a lot in regards to the template and stuff going into the earlier (T20) World Cup, that we wish to play at a sure template, that we wish to play aggressive cricket, however when it got here to a crunch recreation (semi-final in opposition to England), all that template went out of the window.” He believes that new crop of gamers can solely obtain this template. “In all probability, the brand new technology of cricketers may be capable to obtain that template and play the T20 cricket everybody desires India to play. So I really feel, if these guys proceed to do properly within the alternatives they get, it will likely be troublesome for the remainder of the the blokes who’ve been rested or in all probability been dropped.” Featured Video Of The Day Video: Messi’s Argentina Arrive Again In Buenos Aires After FIFA WC Triumph Subjects talked about on this article Source link About Post Author admin oi56wtxexqz4@bom1plzcpnl493925.prod.bom1.secureserver.net https://www.thetimesofbengal.com Happy 0 0 % Sad 0 0 % Excited 0 0 % Sleepy 0 0 % Angry 0 0 % Surprise 0 0 %","pubDate":"2022-12-29 15:49:35","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Wolves vs Man Utd PRICE BOOST: Get Rashford to score 1st and United to win 2-0 OR 2-1 at 20/1 with Sky Bet","link":"https://www.thesun.co.uk/sport/20888513/wolves-man-utd-price-boost-rashford-sky-bet/","keywords":["Sport","Football","Premier League"],"creator":["Craig Mahood"],"video_url":null,"description":null,"content":"MANCHESTER UNITED travel to face Wolves this Saturday lunchtime. And Sky Bet are offering new and existing customers a festive treat by boosting the price of Marcus Rashford to score first and United to win either 2-0 OR 2-1 to a cool 20/1! GettySky Bet: Bet £10 Get £30![/caption] Marcus Rashford to score 1st & Utd to win 2-0 OR 2-1 Want more? Go on then… New Sky Bet customers who stake £10 on any sports market, including this weekend’s Premier League action, will be rewarded with £30 in free bets! To access this offer, simply click HERE* and register a new account. Deposit and place a tenner on football, horse racing, tennis or cricket and you’ll have your account credited with 3 x £10 in free bets! You could use that or one of those £10 free bets on Marcus Rashford to score 1st and United to beat Wolves 2-0 or 2-1 at 20/1! Wolves vs Man Utd Sky Bet Marcus Rashford to score 1st & Utd to win 2-0 OR 2-1 Now available at 20/1 after Sky Bet boostClick HERE to claim this price boost SKY BET: GET £30 IN FREE BETS* FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS FOOTBALL OFFERS HUGE DEAL World Cup final offer: Get £40 in FREE BETS when you stake £10 at Sky Bet HUGE DEAL Premier League football: Get £20 in free bets to use with Sporting Index TOP OFFER Premier League sign-up offer: Get £30 in free bets to use TODAY with Bet UK BIG DEALS How to get free bets on football - the best bookies to claim rewards and bonuses Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playingOnly gambles with money they can afford to loseNever chase their lossesDoesn’t gamble if they’re upset, angry or depressedGamcare – www.gamcare.org.ukGamble Aware – www.begambleaware.org For help with a gambling problem, call the National Gambling Helpline on 0808 8020 133 or go to www.gamstop.co.uk to be excluded from all UK-regulated gambling websites. *New customers only, first single & e/w bet only, 5p minimum stake, 3 x £10 bet tokens. Free bet stakes not included in returns. Free bets exclude virtuals. Free bets are non withdrawable. No free bet expiry. Eligibility restrictions and further T&Cs apply. 18+ begambleaware.Org","pubDate":"2022-12-29 14:54:27","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy 2022-23: प्रियांक पांचाल ने खेली धुआंधार कप्तानी पारी, मजबूत स्थिति में गुजरात","link":"https://sports.ndtv.com/hindi/cricket/ranji-trophy-2022-23-priyank-panchal-played-a-blistering-captaincy-innings-gujarat-in-strong-position-3648584#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Ranji Trophy 2022-23: तीसरे दिन का खेल समाप्त होने पर मेजबान टीम ने चंडीगढ (Chandigarh) के दो विकेट 46 रन पर निकाल दिये थे. उसे अभी भी पारी की हार से बचने के लिये 246 रन बनाने हैं.","content":" Ranji Trophy 2022-23: कप्तान प्रियांक पांचाल (Priyank Panchal) के नाबाद 257 रन की मदद से गुजरात (Gujarat) ने चंडीगढ (Chandigarh) के खिलाफ रणजी ट्रॉफी (Ranji Trophy) एलीट ग्रुप डी मैच के तीसरे दिन पहली पारी में 292 रन की बढत ले ली. कल के स्कोर तीन विकेट पर 249 रन से आगे खेलते हुए पांचाल ने दोहरा शतक पूरा किया. उन्होंने पांचवें विकेट की नाबाद साझेदारी में एम ए हिंगराजिया (Hingrajia) के साथ 307 रन जोड़े. हिंगराजिया (Hingrajia) ने 12 चौकों और दो छक्कों की मदद से 151 रन बनाये. तीसरे दिन का खेल समाप्त होने पर मेजबान टीम ने चंडीगढ के दो विकेट 46 रन पर निकाल दिये थे. उसे अभी भी पारी की हार से बचने के लिये 246 रन बनाने हैं. पांचाल ने 353 गेंद की पारी में 22 चौके और दो छक्के लगाये. हिंगराजिया ने उनका बखूबी साथ निभाते हुए चंडीगढ के गेंदबाजों को मैदान के चारों ओर धुना.#PriyankPanchal will keep scoring hundreds in first-class cricket but when it comes to selection for national team, he will always be sidelined in favour of inconsistent #KLRahul, newcomer #ShubhmanGil & Bengal star #AbhimanyuEashwaran. pic.twitter.com/kEP93KUTHD— MrA_tweets?? (@Nagrik_e_Bharat) December 29, 2022नागपुर में बायें हाथ के लेग स्पिनर आबिद मुश्ताक (Abid Mushtaq) के आठ विकेट की मदद से जम्मू कश्मीर ने विदर्भ को 39 रन से हराया. जीत के लिये 141 रन के लक्ष्य का पीछा करते हुए मेजबान टीम 101 रन पर आउट हो गई. एक समय उसका स्कोर दो विकेट पर 40 रन था लेकिन उसके बाद लगातार विकेट गिरते रहे. इंदौर में रेलवे के 274 रन के जवाब में मध्यप्रदेश ने 255 रन बनाये. रेलवे के एस एस जाधव ने 34 रन देकर पांच विकेट लिये. रेलवे ने दूसरी पारी में 195 रन ही बनाये. मेजबान टीम के लिये कार्तिकेय सिंह ने पांच और सारांश जैन ने चार विकेट चटकाये. तीसरे दिन का खेल समाप्त होने पर मध्यप्रदेश ने बिना किसी नुकसान के 36 रन बना लिये थे. अगरतला में पंजाब की टीम के 203 रन के जवाब में त्रिपुरा ने चार विकेट पर 184 रन बना लिये.Priyank Panchal 257(353)* at Day 3 stump.Wow...Well played @PKpanchal9 ??#RanjiTrophy pic.twitter.com/i5K7nuOLgj— Varun Giri (@Varungiri0) December 29, 2022ये भी पढ़े- * सूर्या के फैंस के लिए आई बड़ी खुशखबरी, इस पुरस्कार के लिए स्मृति मंधना भी नामित* IND vs PAK Test: भारत और पाकिस्तान के बीच होगा टेस्ट मुकाबला!, MCC के मुख्य कार्यकारी अधिकारी ने कह दी बड़ी बातस्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2022-12-29 14:32:45","image_url":"https://c.ndtvimg.com/2021-12/982av1t8_priyank-panchal_625x300_14_December_21.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Pakistan vs New Zealand Highlights, 1st Test Day 4 at Karachi: PAK behind by 97 runs in 2nd innings","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-new-zealand-highlights-1st-test-day-4-at-karachi-pak-behind-by-97-runs-in-2nd-innings-11892871.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs New Zealand Highlights, 1st Test Day 4 at Karachi: PAK behind by 97 runs in 2nd innings","content":"Pakistan vs New Zealand 1st Test Day 3 Report: Kane Williamson’s first international century for almost two years put New Zealand on top in the first Test against Pakistan.Williamson, who stepped down from the captaincy in his team’s first Test tour to Pakistan in 20 years, capitalised on two missed stumpings off Nauman Ali to hit an unbeaten 105 as the Black Caps reached 440-6 at stumps on the third day, a lead of two runs.Tom Latham also made his 13th Test century, becoming the first New Zealand opener to achieve the feat, and Devon Conway hit 92 as the visitors dominated the spinners on a slow turning wicket.Mystery spinner Abrar Ahmed picked up 3-143 and left-arm slow bowler Nauman took 2-137 but neither could wrestle control away from the batters.Wicketkeeper Sarfaraz Ahmed, making a Test comeback after four years, fumbled stumping opportunities when Williamson was on 15 and 21, while the former skipper also overturned an lbw ruling against Abrar through a television referral.Williamson raised his first international century since his 238 against Pakistan in Hamilton in January 2021 when he drove Mohammad Wasim to extra cover for a single.(with inputs from AP)Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-29 12:28:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/PAK-vs-NZ-Live-Score.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Hunt for vile man who ‘pooed’ in Azeem Rafiq’s garden in ‘racially motivated attack’ against ex-cricketer","link":"https://www.thesun.co.uk/sport/20885986/hunt-man-pooed-cricketer-garden/","keywords":["Cricket","Sport","Crime","Police"],"creator":["Holly Christodoulou"],"video_url":null,"description":null,"content":"POLICE have launched a hate crime investigation after a man pooed in the garden of cricketer Azeem Rafiq. The ex-bowler was targeted at his home in Barnsley on October 5. PAAzeem gave evidence to MPs as part of a racism probe[/caption] South Yorkshire PolicePolice are hunting for this man[/caption] Police have launched a probe as say they are treating the incident as racially motivated. They have released an image of a man they wish to speak to following the horror. South Yorkshire Police said: “Our Barnsley team is looking to identify the man pictured, in connection with a reported hate crime. “At 6.18pm on 5 October, it’s reported that a man defecated in the front garden of an address. “It is believed that the incident, which is classed as a public order offence, is racially motivated. “We are looking to speak to this man as we believe he could help us progress our enquiries.” Rafiq was at the centre of a racism storm after claiming he was targeted with abuse while playing at Yorkshire County Cricket Club. His dramatic testimony led to a clear-out of the Yorkshire coaching structure and board, with the county now headed by Lord Patel. Anyone with information can contact police on 101 quoting reference number 726 of 12 October 2022. GettyRafiq said he was targeted while at Yorkshire County Cricket Club[/caption]","pubDate":"2022-12-29 12:12:15","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Jasprit Bumrah, Ravindra Jadeja fit but not rushed by selectors for Sri Lanka series","link":"https://www.sentinelassam.com/sports/cricket/jasprit-bumrah-ravindra-jadeja-fit-but-not-rushed-by-selectors-for-sri-lanka-series-630502","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"With India’s home season set to start with a white-ball series against Sri Lanka on January 3 but there were no mentions of Jasprit Bumrah, Ravindra Jadeja and Rishabh Pant in T20I as well as ODI squads.","content":"NEW DELHI: With India's home season set to start with a white-ball series against Sri Lanka on January 3 but there were no mentions of Jasprit Bumrah, Ravindra Jadeja and Rishabh Pant in T20I as well as ODI squads.As per an ESPNCricinfo report, Bumrah and Jadeja were available for selection in the Sri Lanka series, but the selection committee which announced the squad on Tuesday night, decided that the duo, who have been on the sidelines for a long time, will not be rushed back into the national team. \"They want to simulate training for him that replicates the workload of a proper match, and see how he holds up before he is brought back to international cricket,\" said the report on Bumrah, who has been out of action since the back injury reoccurred during T20Is against Australia in September. Jadeja, on the other hand, had been named in the ODI and Test squads for the Bangladesh tour. But was withdrawn from both squads as his recovery from knee injury post surgery in September was still under way. \"The selectors now want to see him in match simulation just to be sure of his match fitness,\" added the report. There is also Pant, whose name was absent from the white-ball squads for the series against Sri Lanka on Tuesday. But the report says that the left-handed wicketkeeper-batter is being sent to the National Cricket Academy (NCA) in Bengaluru for strength and conditioning before the four-match Test series against Australia. \"The team management feels he will have a key role to play in the Tests, and needs this housekeeping break after playing 44 internationals this year,\" further said the report. India has to win three of four Tests against Australia to qualify for the World Test Championship (WTC) final for the second successive time. Regular India skipper Rohit Sharma, who has been out of action since suffering a blow on left thumb while fielding in the second ODI against Bangladesh, has started batting in the nets. He is expected to be fully fit by the end of the first week of January, in time for the ODI series against Sri Lanka, making him unavailable for the T20Is starting January 3. On the other hand, KL Rahul and Virat Kohli have been rested after playing in the full tour of Bangladesh. Though neither of them asked for the break, the selectors felt they needed the rest. Another point of concern for India going into 2023, which is an ODI World Cup year, is the unavailability of Prasidh Krishna. With his height, pace and hard lengths, he was seen as the enforcer for ODIs in India. But Prasidh sustained a back injury on the eve of India A's series against New Zealand in September, and the report said the pacer is yet to recover from it. Prasidh's injury has meant Mohammed Shami is back in ODIs after missing the tour of Bangladesh due to shoulder injury, with Arshdeep Singh and Umran Malik named in the ODI squad as well. IANS Also Read:  Mohammed Shami replaces Jasprit Bumrah in World Cup Squad Also Watch:","pubDate":"2022-12-29 12:03:22","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/29/425773-bumrah.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Taking the mickey’: Starc’s latest Mankad threat to Proteas… and he has his skipper’s approval","link":"https://www.foxsports.com.au/cricket/australia/cricket-australia-vs-south-africa-test-series-2022-mitchell-starc-mankad-warning-to-theunis-de-bruyn-video-pat-cummins-press-conference/news-story/51d1e5dd272ca3a57514ae2c54b36b61","keywords":null,"creator":null,"video_url":null,"description":"Mitchell Starc is just about of warnings for the world’s batters and is prepared to bring the Mankad dismissal back to test cricket after repeated run-ins with South African Theunis de Bruyn which nearly moved him to do it Melbourne.","content":null,"pubDate":"2022-12-29 12:02:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Live sport on TV this weekend","link":"https://www.limerickleader.ie/news/sport/997858/live-sport-on-tv-this-weekend.html","keywords":["Live Sport on TV,TV Sport"],"creator":["Colm Kinsella"],"video_url":null,"description":"THURSDAY, DECEMBER 29 DARTS WORLD CHAMPIONSHIPS SKY SPORTS, 12.30PM, 7PM HORSE RACING LEOPARDSTOWN & LIMERICK RTE 2, 1PM CRICKET PAKISTAN V N ZEALAND SKY SPORTS, 5PM COLLEGE FOOTBALL TEXAS TECH V OLD MISS BT SPORT2, 2AM SOCCER QPR V LUTON TOWN SKY SPORTS, 5.30PM FRIDAY, DECEMBER 30 SOCCER LIVERPOOL","content":"THURSDAY, DECEMBER 29 DARTS WORLD CHAMPIONSHIPS SKY SPORTS, 12.30PM, 7PM HORSE RACING LEOPARDSTOWN & LIMERICK RTE 2, 1PM CRICKET PAKISTAN V N ZEALAND SKY SPORTS, 5PM COLLEGE FOOTBALL TEXAS TECH V OLD MISS BT SPORT2, 2AM SOCCER QPR V LUTON TOWN SKY SPORTS, 5.30PM FRIDAY, DECEMBER 30 SOCCER LIVERPOOL V LEICESTER SKY SPORTS, 8PM DARTS WORLD CHAMPIONSHIPS SKY SPORTS, 12.30PM, 7PM RUGBY EDINBURGH V GLASGOW PREMIER SPORTS, 7.35PM CRICKET PAKISTAN V NEW ZEALAND SKY SPORTS, 5AM NFL COWBOYS @ TITANS SKY SPORTS, 1.15AM SATURDAY, DECEMBER 31 SOCCER BRIGHTON V ARSENAL SKY SPORTS, 5PM SOCCER WOLVES V MAN UTD BT SPORT, 11.30AM RUGBY SHARKS V BULLS TG4, 2.45PM RUGBY ZEBRE V BENETTON PREMIER SPORTS, 12.30PM NBA LAKERS @ HAWKS SKY SPORTS, 12.30AM SUNDAY, JANUARY 1 SOCCER SPURS V ASTON VILLA SKY SPORTS, 2PM SOCCER NOTTS FOREST V CHELSEA SKY SPORTS, 4.30PM RUGBY ULSTER V MUNSTER TG4, PREMIER SPORT, 5.15PM RUGBY LEINSTER V CONNACHT RTE, PREMIER SPORT, 7.35PM HORSE RACING FROM CHELTENHAM ITV 1, 1PM","pubDate":"2022-12-29 12:00:12","image_url":"https://www.limerickleader.ie/resizer/300/200/true/1591870931128_1594804015.jpg--live_sport_on_tv_this_weekend.jpg?1594804015000","source_id":"limerickleader","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Tom Latham, Kane Williamson hit centuries, put New Zealand in lead against Pakistan","link":"https://www.sentinelassam.com/sports/cricket/tom-latham-kane-williamson-hit-centuries-put-new-zealand-in-lead-against-pakistan-630496","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Left-handed opener Tom Latham smashed his 13th Test century while talismanic batter Kane Williamson registered his 25th hundred","content":"KARACHI: Left-handed opener Tom Latham smashed his 13th Test century while talismanic batter Kane Williamson registered his 25th hundred in the format as New Zealand were put in the lead against Pakistan on day three of the first Test at the National Bank Cricket Arena on Wednesday.Resuming from overnight score of 165 for no loss in reply to Pakistan's 438 in the first innings, New Zealand ended the day at 440 for six, leading by two runs with four wickets still in hand, leaving the match in a tantalising position with two days left in the game. Latham had started this morning at 78 and became one of the three Abrar Ahmed's victims after scoring 113, while Williamson was unbeaten on 105 - his first international century in 23 months and fifth against Pakistan in 14 Test appearances, and was accompanied by Ish Sodhi on one not out at stumps. Devon Conway, who began this morning with Latham at 82, missed his fourth century by eight runs after television replays confirmed Noman Ali's delivery would have hit the stumps after the umpire had turned down a confident lbw appeal. Conway's 92 came off 176 balls and included 14 fours. Conway and Latham put on 183 runs for the first wicket, which was New Zealand's new first wicket partnership record against Pakistan. Latham struck 10 fours in his 191-ball innings, also his third century against Pakistan in his 12th Test against them, second of the year in nine Tests and first since he scored a mammoth 252 against Bangladesh in Christchurch in January. Williamson, who stepped down as Test captain before the tour, overturned an lbw decision against Abrar Ahmed and then punished Pakistan for twice letting him off when on 15 and 21 when Sarfaraz Ahmed missed stumping chances. His pristine knock was layered with signature strokes to all parts of the field, and was great with his footwork too. His 105 has come from 222 balls and includes 11 fours. Williamson's first 50 runs came off 100 balls, while his next 50 runs came off 106 deliveries. Williamson added 48 runs for the second wicket with Latham, followed by putting 41 runs for the third wicket with Henry Nicholls (22), 65 runs for the fourth wicket with Daryl Mitchell (42 off 47 balls) and 90 runs for the fifth wicket with Tom Blundell (47 off 116 balls). New Zealand were strongly placed at 427 for four before Pakistan picked up two late wickets in the last 30 minutes to share day three's spoils. Mohammad Wasim Jr. trapped Blundell lbw in front of the wickets, while Michael Bracewell (5) was forced into a false shot by Abrar, who had earlier claimed the scalp of Mitchell. Abrar finished day three with figures of three for 143, while Ali ended with two for 137. Brief Scores: New Zealand 440 for 6 in 136 overs (Tom Latham 113, Kane Williamson 105 not out, Abrar Ahmed 3/143, Noman Ali 2/137) lead Pakistan 438 in 130.5 overs by two runs. IANS Also Read:   Williamson took Blackcaps to unprecedented success in Test: Brendon Mc Cullum Also Watch:","pubDate":"2022-12-29 11:48:11","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/29/425763-kane.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"'Stay in the crease. It's not that hard': Mitchell Starc loses his cool at Theunis de Bruyn; watch video","link":"https://www.firstpost.com/firstcricket/sports-news/australia-vs-south-africa-mitchell-starc-theunis-de-bruyn-watch-video-11893331.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"'Stay in the crease. It's not that hard': Mitchell Starc loses his cool at Theunis de Bruyn; watch video","content":"The Boxing Day Test between Australia and South Africa was one-sided traffic through the course of four days at the Melbourne Cricket Ground. The hosts were dominant from the word go, first dismissing South Africa for 189 runs and then scoring a mammoth 575 runs.On the fourth day of the Test, South Africa once again failed to put up a fight and were dismissed for 204. Australia won the fixture by an innings and 182 runs, taking an unassailable 2-0 lead in the three-Test series.Among many noteworthy moments at the MCG was the spat between Mitchell Starc and Theunis de Bruyn. While running down to bowl, the pacer noticed the Proteas batter backing up at the non-striker’s end. The left-arm seamer warned De Bruyn to stay inside the crease.In the 19th over of South Africa’s second innings, De Bruyn was leaving the non-striker’s end multiple times even before Starc had finished bowling. At first, the Australian pacer did not say anything, even after de Bruyn’s actions made him miss his mark.The batter, who had already left the crease before Starc reached the line, put his bat at the crease to prevent getting run-out.👀👀 #AUSvSA pic.twitter.com/xkb0CRj1T1— 7Cricket (@7Cricket) December 28, 2022Later, after seeing De Bruyn repeat the action, Starc was furious and did not shy away from verbally warning the Proteas batter. Starc can be heard telling De Bruyn, “Stay in the crease. It’s not that hard. It’s there for a reason mate!”“Stay in your crease, it’s not that hard!”Part 2 of Starc v de Bruyn 👀 #AUSvSA pic.twitter.com/I6bPWXAOSX— 7Cricket (@7Cricket) December 29, 2022A post some moments later showed that the Proteas batter seemed to have learnt his lesson.Lesson learned for now 😅 #AUSvSA pic.twitter.com/XgRmO3Tlor— 7Cricket (@7Cricket) December 29, 2022Starc’s words reignited the debate around ‘Mankad’- the practice of running out the batter at the non-striker’s end if the player goes past the crease before the ball leaves the bowler’s hand. The issue had gained traction earlier this year after India’s Deepti Sharma ran England’s Charlotte Dean out at Lord’s using the move.Starc subsequently explained his stand talking to Fox Cricket during drinks break. “He was halfway down Punt Rd, wasn’t he? It’s bad enough in white-ball cricket, I don’t know what the need is in red-ball cricket.“I was just letting him know that if I have to keep my foot behind the line, he can at least keep the bat behind the line.”Coming back to the Boxing Day Test, former Australian cricketers Adam Gilchrist and Mark Taylor, who were present in the commentary box, talked about the issue of Mankad and noted that Starc might have hurt his finger if he had gone for it. The pacer has been suffering from a finger injury since the start of the game.In the end, De Bruyn was dismissed by Scott Boland for 28. South Africa’s batting collapsed, with Temba Bavuma being the only player to breach the 50-run mark. The third and final Test between the sides will be played from 4 January at the Sydney Cricket Ground.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-29 11:39:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Starc-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Renuka Thakur, Bhatia among nominees for ICC Women's Emerging Cricketer of the Year","link":"https://www.sentinelassam.com/sports/cricket/renuka-thakur-bhatia-among-nominees-for-icc-womens-emerging-cricketer-of-the-year-630491","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India duo of right-arm fast-bowler Renuka Thakur and left-handed wicketkeeper-batter Yastika Bhatia were named as nominees for the ICC Women’s Emerging Cricketer of the Year 2022 award.","content":"NEW DELHI: India duo of right-arm fast-bowler Renuka Thakur and left-handed wicketkeeper-batter Yastika Bhatia on Wednesday were named as nominees for the ICC Women's Emerging Cricketer of the Year 2022 award. Apart from the duo, England all-rounder Alice Capsey and Australia tearaway pacer Darcie Brown have been nominated as well.Renuka claimed 40 wickets for her country in 2022 in just 29 matches across the two white-ball formats, filling the void of the legendary pacer Jhulan Goswami. Able to swing the ball or find deviation off the surface, Renuka will likely be one of India's most dependable bowlers in years to come. In the ODIs, Renuka was outstanding, claiming 18 wickets at an average of just 14.88, of which eight came in two appearances against England, and seven in India's series against Sri Lanka. Her best performance came against Australia on cricket's return to Commonwealth Games, taking 4/18 with 16 dot balls, and leaving them at 34/4, thought the eventual champions chased down India's 154. She was a thorn in the Australian line-up in the seven T20I meetings across the year, taking eight wickets, and her performances across the Commonwealth Games and Women's Asia Cup show she is no shrinking violet in tournament action, claiming 17 wickets in 11 matches, at an economy rate of just 5.21. A consistent performer in the 50-over game, Yastika set the platform for India's middle order throughout 2022 with a number of strong performances. She made scores of 41 and 31 in the lead-up to the Cricket World Cup, before strong half-centuries against Australia and Bangladesh in the tournament. Yastika went on to make another fifty in India's away 3-0 ODI series against England at Hove, and will no doubt be a name on India's team sheet for years to come. Her best performance in the year came through a 130-run partnership with Mithali Raj against Australia at Eden Park In that match, she striked six boundaries in a strong rebuild, and was instrumental in taking the team to 158/3 in the 32nd over of play. India went on to post 277, with Yastika only usurped by her captain Mithali as the top-scorer in the innings. Alice made headlines as an England debutant at just 17 years and took to international cricket with aplomb, making 119 runs across her first three T20I outings, at a strike rate well over a run a ball. Two of those knocks came at the beginning of her team's home Commonwealth Games campaign, with a half-century from just 37 balls against South Africa to ensure a strong start. She continued with runs in England's home T20I series with India, before earning an ODI call-up soon after. Her best performance of 2022 was in the Commonwealth Games against South Africa. Coming in at 10/1 following the loss of Sophia Dunkley, Alice, also a handy off-spinner, hit seven fours and a six to ensure momentum swung in the hosts' favour. The ICC Awards 2022 will comprise a total of 13 categories, with awards honouring individuals who shone in specific formats, and also across multiple formats in the overall categories — the coveted Sir Garfield Sobers Trophy for ICC Men's Cricketer of the Year, and the Rachael Heyhoe Flint Trophy for ICC Women's Cricketer of the Year. IANS Also Read:  India clinch Women's Asia Cup title; Spinners, Renuka, Smriti shine, Sri Lanka beaten by 8 wickets Also Watch:","pubDate":"2022-12-29 11:35:25","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/29/425757-renuka.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL changed our lives forever, SA20 league provides timely boost to South African cricket: AB de Villiers","link":"https://indianexpress.com/article/sports/cricket/ipl-changed-our-lives-forever-sa20-league-provides-timely-boost-to-south-african-cricket-ab-de-villiers-8350874/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-12-29 11:29:49","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"MI Emirates sign five promising overseas players for inaugural season of ILT20","link":"https://www.sentinelassam.com/sports/cricket/mi-emirates-sign-five-promising-overseas-players-for-inaugural-season-of-ilt20-630486","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"MI Emirates on Wednesday announced the signing of five dynamic overseas young players","content":"DUBAI: MI Emirates on Wednesday announced the signing of five dynamic overseas young players — Lorcan Tucker of Ireland, McKenny Clarke of West Indies, and England trio of Daniel Mousley, Thomas Lammonby and Craig Overton — ahead of the inaugural ILT20 season starting from January 13.Reinforcing on their parent franchise, five-time IPL winners Mumbai Indians' philosophy of identifying, developing and nurturing young talents to unlock their true potential, MI Emirates will give the five overseas players one of the finest platforms to express and explore their capabilities under the experienced players and also compete against some of the best international players. Tucker, the 26-year-old wicketkeeper batter, has represented Ireland, Ireland A and Ireland U19s. He shot to limelight at the Men's T20 World Cup after making 71 not out against Australia and 45 not out against West Indies. Clarke is a 19-year-old who plays A list cricket and has represented the West Indies U19 squad. Mousley, a batting all-rounder from England who has represented his country in the U19 team, made his first-class debut in July 2019. Lammonby represented England U19 and has played in T20 leagues around the world. Overton, the fast-bowling all-rounder, is one half of the fast-bowling twins who was selected in England's 2017-18 Ashes tour to Australia. He represented England, England U19 and more teams in his career so far. MI Emirates had earlier signed four local UAE players in batter Mohammed Waseem, off-spin all-rounder Basil Hameed, right-arm medium fast-bowler Zahoor Khan and top-order batter Vriitya Aravind for the much-awaited inaugural ILT20 season. The young guns of MI Emirates will play alongside experienced international players like captain Kieron Pollard, Dwayne Bravo, Nicholas Pooran, Imran Tahir and Trent Boult. Furthermore, they will train under tutelage of Shane Bond (head coach), Parthiv Patel (batting coach), R Vinay Kumar (bowling coach) and James Franklin (fielding coach). IANS Also Read:    Indian Premier League: MI Emirates sign up Pollard, Bravo, Pooran, Boult for squad of 14Also Watch:","pubDate":"2022-12-29 11:22:45","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/29/425750-mi-emirates.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy fixtures shifted from Karnail Singh Stadium after pitch trouble","link":"https://www.firstpost.com/firstcricket/sports-news/ranji-trophy-fixtures-shifted-from-karnail-singh-stadium-after-pitch-trouble-11896641.html","keywords":["First Cricket News"],"creator":["Somya Kapoor"],"video_url":null,"description":"Ranji Trophy fixtures shifted from Karnail Singh Stadium after pitch trouble","content":"Karnail Singh Stadium in Delhi will not be hosting its remaining matches of the ongoing Ranji Trophy 2022-23 season as they have been shifted from the venue.“The matches have been shifted from Karnail Singh Stadium,” a source close to the development told News18 CricketNext.The season-opening fixture between Railways and Punjab was suspended and then rescheduled after the track was deemed “dangerous and unfit for play” by the match officials.One of the ground staff member said that the pitch that was used for the Railways vs Punjab match was dangerous. Although, he further added that a couple of new tracks have been prepared and the forthcoming matches can take place at the venue.“The track was looking dangerous,” a ground staff on the condition of anonymity said. “We have prepared a different track and the other rounds can take place at the venue. Let’s see what happens.”A total of five Ranji matches were to be held at Karnail Stadium this season but after the pitch woes of the first round, the BCCI shifted its second-round fixture to Indore and it’s unlikely the venue will host the remaining games.Punjab are facing Tripura in the third round in Agartala and were bundled out for 203 in the first innings while Railways are up against Madhya Pradesh in Indore.The contest between Railways and Madhya Pradesh was originally scheduled to take place at the Karnail Singh Stadium on 27 December but the BCCI shifted it to Indore’s Holkar Stadium.Railways opted to bat first and were bowled out for 274 with their captain Upendra Yadav top-scoring with 61.In reply, MP managed 255 to concede a meagre first-innings lead.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-29 11:13:03","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Karnail-Singh-Stadium.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"ILT20: With crowd-pullers in squad, Gulf Giants hoping to build fan base in UAE, says CP Rizwan","link":"https://www.firstpost.com/firstcricket/sports-news/ilt20-with-crowd-pullers-in-squad-gulf-giants-hoping-to-build-fan-base-in-uae-says-cp-rizwan-11896481.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"ILT20: With crowd-pullers in squad, Gulf Giants hoping to build fan base in UAE, says CP Rizwan","content":"Dubai: The International League T20 (ILT20), the newest franchise cricket league, is set to start on 13 January where the Gulf Giants will be looking to make a big splash.More often than not, the big names from the traditionally strong cricketing countries steal the limelight, however, Gulf Giants are putting their faith and backing in players from the UAE. Picking up the baton first is CP Rizwan, the captain of the UAE cricket team, who is raring to go.“To work with an experienced person like Andy Flower, it is a great honour for us, and in terms of the squad, we have a good combination of dynamic, explosive, experienced and classy players. The likes of Shimron Hetmyer, James Vince and Chris Lynn can all destroy teams single-handedly on their day. We can’t wait to hit the ground and produce the goods,” Rizwan said.When asked about who are the players he is most looking forward to work with in Gulf Giants’ squad, Rizwan said, “James Vince, he has played franchise cricket all over the world, Chris Lynn, a power house in T20 cricket, and Shimron Hetmyer to name a few. Then there is also David Wiese, who is very experienced. This is an exciting squad and working along side them and testing ourselves in tough conditions will help us grow as players.”Our Giant @RizwanCP2 getting into the grind! 🔥Put your 🎧 on to listen to the sweet sound of the bat. ❤#Cricket #ILT20 #ALeagueApart @ILT20Official pic.twitter.com/ieMIkGDxLl— Gulf Giants 🦅 (@GulfGiants) December 27, 2022Among the more popular sports in the Asian continent and across the globe, cricket, according to Rizwan is a big source of joy for everyone in the UAE. “In the UAE, people love cricket a lot, the IPL, the India-Pakistan games, and Gulf Giants have genuine crowd pullers like Lynn, Hetmyer and Vince. And I am sure, together we will provide the people with some great evenings and go on to build a fan base for the Gulf Giants as well.”The ILT20 is the first T20 tournament of the kind in the UAE, and Rizwan is gung-ho about this. “This is an opportunity for us UAE players to showcase our talent, rather than a challenge due to the presence of the international stars. We want to make use of this chance and express ourselves and entertain our fans. This is our chance to say to the world that we belong to the elite level.”Looking ahead to the tournament, Rizwan said, “The Adani franchises are among the best in whatever sport they enter. And here with the Gulf Giants, we want to make a mark and our team’s culture and work ethic will hopefully help us do the best we can. The management wants the best for us and we will work together in one direction.”Gulf Giants squad: James Vince (C), Shimron Hetmyer, Chris Jordan, Chris Lynn, Tom Banton, Dominic Drakes, David Wiese, Liam Dawson, Jamie Overton, Qais Ahmad, Richard Gleeson, Ollie Pope, Rehan Ahmed, CP Rizwan, Aayan Afzal Khan, Sanchit Sharma, and Ashwanth ValthappaRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-29 10:50:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/CP-Rizwan.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'No one is indispensable': Gautam Gambhir speaks on KL Rahul's batting struggles","link":"https://www.firstpost.com/firstcricket/sports-news/kl-rahul-batting-gautam-gambhir-remark-11895551.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"'No one is indispensable': Gautam Gambhir speaks on KL Rahul's batting struggles","content":"Gautam Gambhir has asked struggling KL Rahul to make full use of the upcoming ODIs against Sri Lanka to continue to be part of Team India. Rahul was removed as India’s vice-captain for the ODI series against Sri Lanka after he failed to impress as a batter on the recently-concluded tour of Bangladesh.In fact, 2022 has been a dismal year for the batter. In 10 ODIs in the year, he only managed 251 runs at an average of 28. In T20Is, Rahul got 434 runs in 16 matches at a strike rate of 126.53 and scored just 137 in four Tests at an average of 17.A powerful hitter of the ball, Rahul had a nightmare T20 World Cup as India exited the tournament in the semi-finals. Not surprisingly, the opener has lost his place in the T20I side for the Sri Lanka series.Also Read | Indian men’s cricket team full 2023 scheduleGambhir, who works with Rahul at the IPL franchise Lucknow Super Giants, has asked the Bengaluru batter to not think about failures and instead focus on getting runs in the upcoming three ODIs against Sri Lanka“You can only control what you can control. You can’t control selectors, you can’t control what’s going to happen in the next series. You got three ODIs against Sri Lanka. If you play that, just be in the present. That’s all you can control. The moment you start to think about uncontrollable things, you’re putting undue pressure on yourself,” Gambhir said in Star Sports’ show ‘A Chat with Champions’.The former India opener further added that no one is indispensable in Team India and it’s the runs that will keep Rahul in the side.“If you don’t perform, someone else will take your position. That’s not only with Sanju or KL, it’s with Virat Kohli and Rohit Sharma as well. If they don’t perform, you will start questioning about their positions too. That’s what international cricket is about. No one is indispensable. So you got three ODIs, you bat in the middle-order, try and get those runs, because ultimately it’s the performance that keeps you in the side. Not the name, not your talent,” said Gambhir.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-29 10:20:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/gautam-gambhir-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli will 'constantly face pressure' from others after being excluded from T20 squad: Sanjay Manjrekar","link":"https://www.firstpost.com/firstcricket/sports-news/virat-kohli-will-constantly-face-pressure-from-others-after-being-excluded-from-t20-squad-sanjay-manjrekar-11895601.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Virat Kohli will 'constantly face pressure' from others after being excluded from T20 squad: Sanjay Manjrekar","content":"Former India skipper Virat Kohli was among the senior players to not be included in the Men in Blue’s squad for the upcoming T20 series against Sri Lanka, and Sanjay Manjrekar feels Kohli will ‘face pressure’ from other cricketers who will get opportunities in his place.Manjrekar went on to say that the management might be looking to give Kohli more game time in the one-day format, especially with 2023 being a year of the ODI World Cup.“Virat Kohli had a pretty good World Cup. I would have liked him to play as much international cricket as possible, just to be amongst the runs, hitting the ball virtually every week and be prepared for the match situation is a good thing. The thing is Virat Kohli will now constantly face pressure from others who are getting opportunities in his place,” Manjrekar told ESPNCricinfo.“We have seen what the young players have done like Ishan Kishan and Sanju Samson when they’ve got the opportunity. So, yes, Virat Kohli is still very much in the plans after the World Cup he had and I’m sure he wants to keep being a member in the T20 side,” the 57-year-old added.The former Mumbai batter opined that the one-day format was where Kohli had shown consistency over the years.“Since this is 2023, the World Cup year, I guess India are looking to give him more one-day time and one-day cricket is a great format to get back into form. That is where Virat Kohli has shown he is an all-time great in the way he has played over the years, the consistency, and the match-winning ability.“Test and one-day cricket has been his two greatest formats. So, somewhere, the selectors are looking at Kohli and saying, ‘Let’s get you to play more of 50-overs cricket,” Manjrekar continued.Virat Kohli had earlier in the year ended his long wait for a 71st international century, scoring an unbeaten 122 against Afghanistan in the Asia Cup T20 tournament. He then went onto register four half-centuries in the T20 World Cup in Australia, where he ended up as the tournament’s highest run-getter with 296 runs from six matches.Earlier in December, Kohli scored a century, a knock of 113, in the third ODI against Bangladesh in Chattogram.The likes of Rahul Tripathi and Ruturaj Gaikwad were named in India’s T20I series against Sri Lanka in January, and Kohli, despite not being a part of the T20 series, remains a part of the ODI series to face Lankans at home.The ODI World Cup 2023 will be held during October-November in India.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-29 09:57:46","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Virat-Kohli-looks-on-as-England-inch-closer-to-win-during-India-vs-England-T20-World-Cup-semifinal.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia hammer South Africa to win 2nd Test and series","link":"https://www.capitalfm.co.ke/sports/2022/12/29/australia-hammer-south-africa-to-win-2nd-test-and-series/","keywords":["Cricket","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"MELBOURNE, Australia, Dec 29 – South Africa were on the wrong end of a “hammering” against rampant top-ranked Australia on Thursday, losing the second Test by 182 runs and with it the series. The loss capped a dismal first two Tests for the visitors who slumped by six wickets in the opener at Brisbane inside […] The post Australia hammer South Africa to win 2nd Test and series appeared first on Capital Sports.","content":"The loss capped a dismal first two Tests for the visitors who slumped by six wickets in the opener at Brisbane inside two days, with a potential face-saving third match at Sydney still to play. “It is not easy at the moment. That was bit of a hammering,” Proteas skipper Dean Elgar said. Australia declared on Wednesday at 575-8 built on the back of man-of-the-match Warner’s 200 and a gutsy 85 from Steve Smith in searing heat, in reply to South Africa’s first innings 189, and then took complete control with the ball. South Africa resumed day four on 15-1 after Elgar went for a duck before rain halted play early on Wednesday. But their resistance didn’t last long with three wickets falling before lunch at the Melbourne Cricket Ground and the rest in the second session as they succumbed for 204. Temba Bavuma top-scored with 65 while Nathan Lyon took 3-58 in a depleted, injury-hit, attack. “The win is right up there. We have had a number of great contests against South Africa over the years. It’s really sweet and something to be proud of,” said Australian skipper Pat Cummins. “I thought how Warner and Smith batted in the heat was pretty gutsy. (Mitchell) Starc and (Cameron) Green as well, put their injuries behind them and turned up.” It leaves South Africa facing a trip to Sydney next week for the final Test with only pride to play for and potentially some changes to a batting line up that has largely failed to fire. “We have got to do a lot of reflection going ahead once again. There are a few positives coming out of this Test but not a lot,” Elgar said. “There’s lot to play for (in Sydney), South Africa are a proud cricketing nation and 2-1 sounds a lot better than 3-0,” he added. Australia will have a new-look team with Green and Starc already ruled out with finger injuries as they race the clock to be ready for a blockbuster series in India in February. Josh Hazlewood is set to return for Starc after recovering from a side strain, with Green’s replacement to be decided. The wickets fell despite the hosts’ attack being depleted, with Green, who took 5-27 in their first innings, not bowling due to a fractured finger. Theunis de Bruyn (28), Sarel Erwee (21) and Khaya Zondo (one) all departed before lunch at the hands of Australia’s high-class pace attack. Then the spin of Nathan Lyon, and two careless run outs, ended any hope they had in the second session. Australia’s Steve Smith took his 150th Test catch against South Africa. PHOTO/AFP Starc was also nursing a bruised and bloodied finger, but he played through the pain and his sheer pace caused plenty of problems. Erwee, who resumed on seven, hit a superb drive for four off him as his confidence grew, but Starc quickly got his revenge, trapping him lbw with a cracking yorker. De Bruyn began on six and built up to 28, but he soon followed his teammate back to the pavilion. This time Scott Boland did the damage, enticing an edge that was taken by the ever-reliable Smith in the slips for his 150th catch. He is 14th on the all-time list, led by Indian great Rahul Dravid’s 210. South Africa were under the pump and needed to dig in, but Bavuma inexplicably attempted a single from Cummins and Khaya Zondo was easily run out by a Travis Head underarm throw. It left them teetering at 65-4 before Bavuma and Kyle Verreynne knuckled down. But Boland struck again soon after lunch with Verreynne, one of their best batsmen this series, out lbw for 33. Lyon’s spin removed Marco Jansen before another disastrous run out involving Bavuma, with Keshav Maharaj out after a confusing mix-up and Starc made a direct hit. More weak dismissals by Lyon and a rare wicket for Smith ended the match.","pubDate":"2022-12-29 09:52:01","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Australia beat South Africa by an innings in Melbourne to seal dominant series win","link":"https://www.standard.co.uk/sport/cricket/australia-vs-south-africa-melbourne-cricke-result-2022-b1049805.html","keywords":["Cricket","Sport"],"creator":["Jonathan Gorrie"],"video_url":null,"description":"Australia beat South Africa in a crushing victory to seal a dominant series win at the Melbourne Cricket Ground.","content":null,"pubDate":"2022-12-29 09:41:14","image_url":"https://static.standard.co.uk/2022/12/29/09/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Rabada की राकेट बॉल को झेल नहीं पाया Batter, ऐसे उड़ गयी स्टंपस","link":"https://sports.ndtv.com/hindi/cricket/batter-could-not-handle-rabadas-rocketry-ball-stumps-flew-like-this-3647419#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"साउथ अफ्रीका की टीम भले ही ऑस्ट्रेलिया से टेस्ट सीरीज हार गई हो लेकिन अफ्रीकी टीम के गेंदबाज़ कागीसो रबाड़ा ने दिल जीतने में कोई कसर नहीं छोड़ी.","content":"साउथ अफ्रीका (AUS vs SA) की टीम भले ही ऑस्ट्रेलिया से टेस्ट सीरीज हार गई हो लेकिन अफ्रीकी टीम के गेंदबाज़ कागीसो रबाड़ा (Kagiso Rabada) ने दिल जीतने में कोई कसर नहीं छोड़ी. रबाडा का वीडियो सोशल मीडिया पर अब वायरल हो रहा है जिसमें उन्होंने उस्मान ख्वाजा को 1 रन के निजी स्कोर पर एक रॉकेट से भी तेज डिलीवरी पर बोल्ड कर दिया और ख्वाजा देखते ही रह गए. उन्हें कुछ भी समझ नहीं आया. गेंद इतनी तेज थी कि स्टंप्स भी दूर जाकर गिरी. वहीं विकेट लेने के बाद राबड़ा ने जमकर जश्न मनाया.यहां पर देखें वीडियोKagiso Rabada rocket delivery ?This is really Unplayable ?#INDvPAK #INDvSLpic.twitter.com/QOzLXrdrJk— Cricket Master (@Master__Cricket) December 29, 2022वहीं ऑस्ट्रेलिया ने दूसरे टेस्ट मैच में जीत के साथ ही सीरीज में 2-0 की अजेय बढ़त बना ली है. ऑस्ट्रेलिया ने पहली पारी में 578 रन बनाकर पारी घोषित की थी. जवाब में साउथ अफ्रीका की टीम पहली पारी में 189 रन पर ऑल आउट हो गई. इसके बाद ऑस्ट्रेलिया ने अफ्रीकी टीम को फॉलोऑन खेलने के लिए बुला दिया. जिसके बाद टीम दूसरी पारी में 204 रन पर ढेर हो गई और ये मैच पारी व 182 रन से हार गई.ये भी पढ़ें: ऑस्ट्रेलिया के हाथों साउथ अफ्रीका को मिली करारी हार लेकिन भारत को हो गया बड़ा फायदाIND vs SL: क्या शिखर धवन का करियर खत्म ? श्रीलंका के खिलाफ सीरीज के लिए नहीं मिली टीम इंडिया में जगह'कौन कर रहा कप्तानी..' लाइव मैच में अजब-गजब, रिजवान और सरफऱाज ने एक साथ DRS लेने का किया इशारा- Video","pubDate":"2022-12-29 09:22:07","image_url":"https://c.ndtvimg.com/2022-12/itb87q6_kagiso-rabada-_625x300_29_December_22.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Live मैच में कगिसो रबाडा दर्शकों को कराने लगे एक्सरसाइज, फैंस ने यूं उठाया इसका मज़ा, देखें वीडियो","link":"https://sports.ndtv.com/hindi/cricket/in-the-live-match-rabada-started-exercising-the-audience-fans-enjoyed-it-like-this-watch-video-3646968#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया और साउथ अफ्रीका के बीच खेले गए बॉक्सिंग डे टेस्ट मैच दौरान ही मैदान पर दर्शकों के साथ मस्ती करते हुए कगिसो रबाडा का एक वीडियो वायरल हो रहा है.","content":"ऑस्ट्रेलिया और साउथ अफ्रीका के बीच खेले गए बॉक्सिंग डे टेस्ट मैच में मेज़बान टीम ने साउथ अफ्रीका को पारी और 182 रनों से हरा दिया है और सीरीज़ में 2-0 की अजेय बढ़त बना ली है. इसी मैच के दौरान ही मैदान पर दर्शकों के साथ मस्ती करते हुए एक वीडियो वायरल हो रहा है. जो लोगों को काफी पसंद आ रहा है. दरअसल साउथ अफ्रीका के स्टार गेंदबाज़ रबाड़ा लाइव मैच के दौरान फैंस को एक्सरसाइज़ कराने लगे. फैंस को भी काफी मज़ा आ रहा था. और फैंस भी जैसे जैसे रबाड़ा कर रहे थे उनकी नकल उतारने लगे. वीडियो देखने पर कोई भी अपनी हंसी नहीं रोक पा रहा है. यहां पर देखें वीडियोKagiso Rabada ? - MCG Crowd and Experience of a Test match cricket. This is pure gold. #AUSvsSA @KagisoRabada25pic.twitter.com/adobpNtY1u— Waadaplaya!!! ? (@waadaplaya) December 27, 2022चौथे दिन मैच में जीत के साथ ही ऑस्ट्रेलिया ने सीरीज में 2-0 की अजेय बढ़त बना ली है. इससे पहले, पहले बल्लेबाज़ी करते हुए ऑस्ट्रेलिया ने बॉक्सिंग डे टेस्ट मैच में पहली पारी में 578 रन बनाकर पारी घोषित की थी. जवाब में साउथ अफ्रीका की टीम पहली पारी में 189 रन पर ऑल आउट हो गई. इसके बाद ऑस्ट्रेलिया ने अफ्रीकी टीम को फॉलोऑन खेलने के लिए बुला दिया. जिसके बाद टीम दूसरी पारी में 204 रन पर ढेर हो गई और ये मैच पारी व 182 रन से हार गई.भारत को ऐसे हुआ फायदाविश्व टेस्ट चैंपियनशिप के फाइनल को खेलने के लिहाज़ से ये भारत के लिए काफी फायदेमंद साबित हुआ. दरअसल WTC की पॉइंट्स टेबल में ऑस्ट्रेलिया 78.57 प्रतिशत अंकों के साथ पहले स्थान पर है. वहीं भारत के पास 58. 93 प्रतिशत पॉइंट्स है और टीम इंडिया दूसरे स्थान पर है. बाकी की टीमें पॉइंट्स के लिहाज़ से भारत से काफी पीछे हैं. श्रीलंका तीसरे स्थान पर ही और उसके पास 53. 33 प्रतिशत अंक है. ऐसे में भारतीय टीम को साउथ अफ्रीका की इस हार से काफी फायदा हुआ है. अफ्रीकी टीम 50 अंकों के साथ अब चौथे स्थान पर खिसक गई है.ये भी पढ़ें: ऑस्ट्रेलिया के हाथों साउथ अफ्रीका को मिली करारी हार लेकिन भारत को हो गया बड़ा फायदाIND vs SL: क्या शिखर धवन का करियर खत्म ? श्रीलंका के खिलाफ सीरीज के लिए नहीं मिली टीम इंडिया में जगह'कौन कर रहा कप्तानी..' लाइव मैच में अजब-गजब, रिजवान और सरफऱाज ने एक साथ DRS लेने का किया इशारा- Video","pubDate":"2022-12-29 09:08:32","image_url":"https://c.ndtvimg.com/2022-12/31s2ka1_kagiso-rabada-_625x300_29_December_22.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"India men’s cricket team 2023 schedule: Year starts with Sri Lanka series; Test series vs Australia scheduled","link":"https://www.firstpost.com/firstcricket/sports-news/india-mens-cricket-team-2023-schedule-year-starts-with-sri-lanka-series-test-series-vs-australia-scheduled-11894571.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India men’s cricket team 2023 schedule: Year starts with Sri Lanka series; Test series vs Australia scheduled","content":"Indian cricket team ended its 2022 with a win in the Test series against Bangladesh and earning significant points for qualification in the World Test Championship (WTC) Finals. Indian team is one of the busiest in the international circuit and will not be at rest for a long time. The Men-in-Blue will be seen in action as soon as the time crosses into 2023.India will have the WTC Final and the ODI World Cup on their radar in the upcoming year. India will host the 50-over World Cup, which will make the tournament more significant. On the contrary, India will have to win the Border Gavaskar Series against Australia, to confirm their spot in the WTC Final.WTC: India, Australia favourites, South Africa on fringes for the finalIndia will start 2023 with a T20I series, followed by three ODIs against Sri Lanka. The squad announced on Tuesday made it clear that the BCCI is looking to overhaul the team structure and doing away with some of the senior pros who have been lukewarm with their performances.Thank you all for your love and support #TeamIndia pic.twitter.com/07I2CDVMso— BCCI (@BCCI) December 28, 2022 Here is India men’s team schedule for 2023(Time in IST)Sri Lanka tour of India3 January | 7 PM – First T20I, Wankhede Stadium, Mumbai5 January | 7 PM – Second T20I, MCA Stadium, Pune7 January | 7 PM – Third T20I, SCA Stadium, Rajkot10 January | 1.30 PM – First ODI, Barsapara Cricket Stadium, Guwahati12 January | 1.30 PM – Second ODI, Eden Gardens, Kolkata15 January | 1.30 PM – Three ODIs, Greenfield International Stadium, ThiruvananthapuramIndia vs Sri Lanka squads: Hint of transition, focus on ODIs, Dhawan showed the doorNew Zealand tour of India18 January | 2 PM – First ODI, Rajiv Gandhi International Stadium, Hyderabad21 January | 2 PM – Second ODI, Shaheed Veer Narayan Singh International Stadium, Raipur24 January | 2 PM – Third ODI, Holkar Cricket Stadium, Indore27 January | 7 PM – First T20I, JSCA International Stadium Complex, Ranchi29 January | 7 PM – Second T20I, Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow1 February | 7 PM – Third T20I, Narendra Modi Stadium, AhmedabadAustralia tour of India9 -13 February | 9.30 AM – First Test, VCA Stadium, Nagpur17 – 21 February | 9.30 AM – Second Test, Arun Jaitely Stadium, Delhi1 – 5 March | 9.30 AM – Third Test, HPCA Stadium, Dharamsala9 – 13 March | 9.30 AM – Narendra Modi Stadium, Ahmedabad17 March | 2 PM – Wankhede Stadium, Mumbai19 March | 2 PM – VDCA Cricket Stadium, Vishakhapatnam22 March | 2 PM – MA Chidambaram Stadium, ChennaiIndian Premier League 2023 (break for national side)March to June –Dates yet to be confirmedWorld Test Championship Final (subject to qualification)June – Dates yet to be confirmedIndia tour of West IndiesJuly – August 2023 – Dates yet to be confirmedTwo Tests (WTC 2023-25 cycle)Three ODIsThree T20IsAustralia tour of IndiaSeptember – Dates yet to be confirmedThree ODIsACC Asia Cup 2023September – Dates yet to be confirmed(13 ODIs overall including the final)ICC ODI World Cup 2023October – Dates yet to be confirmed(48 ODIs overall including two semi-finals and one final)Australia tour of IndiaNovember – Dates yet to be confirmedFive T20IsIndia tour of South AfricaDecember 2023 – January 2024 – Dates yet to be confirmedTwo Tests (WTC 2023-25 cycle)Three ODIsThree T20IsRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-29 09:03:31","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/India-schedule-in-2023.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Left-handed batter Alex Carey's maiden ton carries Australia's domination over South Africa","link":"https://www.sentinelassam.com/sports/cricket/left-handed-batter-alex-careys-maiden-ton-carries-australias-domination-over-south-africa-630432","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Taking advantage of that, Anrich Nortje zipped one through half-centurion Travis Head’s defences and knocked him over early on.","content":"MELBOURNE: Left-handed batter Alex Carey slammed his maiden Test century to carry forward Australia domination over South Africa on the third day of the second match at the Melbourne Cricket Ground (MCG), here on Wednesday. When stumps were called early after an hour was lost to persistent light rain, South Africa were struggling at 15-1 having lost skipper Dean Elgar for a third-ball duck and still 371 runs shy of forcing Australia to bat a second time. At the start of the day's play, there was some help for pacers as a slight drizzle seemed to spruce up the pitch. Taking advantage of that, Anrich Nortje zipped one through half-centurion Travis Head's defences and knocked him over early on. Thereafter, double-centurion David Warner walked in to a standing ovation after having retired hurt last evening owing to cramps. However, he went back to the pavilion one ball later as Nortje served him a fast low-full toss that hit the base of the stumps via his pads. When Kagiso Rabada dismissed Pat Cummins, it seemed as if the visitors would put a lid on the Australian first innings rather quickly. But, it wasn't to be as the pair of Carey and Nathan Lyon had an impressive stand. Lyon thrilled the MCG crowd by pulling Rabada for a four and then a six and his 17-ball stay fetched 25 runs for Australia before Lungi Ngidi got rid of him. Australia then sent another retired-hurt batter Cameron Green, despite his fractured finger and it proved to be an ideal foil for Carey, who reached to his half-century in 66 balls and Australia had added 93 runs in the session and their lead ticked towards 300. Post-Lunch, Protes skipper Elgar began the bowling from the spinner Keshav Maharaj from one end while the seamers took turns to try their luck from the other, beginning with Kagiso Rabada. But, Carey, who had accessed the pitch beautifully and had no problems in facing them. The wicket-keeper played reverse-swept, pull, upper-cut and eventually a push drive through extra cover for three took Carey to his maiden Test century. It made him only the second Australian keeper-bat to score a Boxing Day Test hundred after Rod Marsh. He was eventually dismissed for 111 to Marco Jansen. From there on, Green showed his batting skill and hit 170-ball half-century despite being ruled out of the next Test with a finger fracture sustained on Tuesday. No.10 Mitchell Starc pulled a six off Anrich Nortje before wearing another short ball on his helmet, which led to a brief stoppage in play owing to the mandatory concussion test. Australia skipper Pat Cummins thought he had enough runs and declared the first innings at 575/8. He then removed his counterpart Elgar for a duck to leave South Africa hoping for a miracle to salvage the Test. Brief scores: South Africa 189 & 15/1 (Pat Cummins 1-0) trail Australia 575/8 decl (David Warner 200, Alex Carey 111; Anrich Nortje 3-92) by 371 runs. IANS Also Read: Team have no control on weather: Arshdeep SinghAlso Watch:","pubDate":"2022-12-29 08:53:22","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/29/425673-alex-carey.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma shares training photos ahead of India vs Sri Lanka series, Suryakumar Yadav reacts","link":"https://www.firstpost.com/firstcricket/sports-news/rohit-sharma-shares-training-photos-ahead-of-india-vs-sri-lanka-series-suryakumar-yadav-reacts-11894221.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Rohit Sharma shares training photos ahead of India vs Sri Lanka series, Suryakumar Yadav reacts","content":"India skipper Rohit Sharma has been away from cricketing action since he suffered an injury in his left thumb during the India-Bangladesh One Day International series. While KL Rahul assumed the mantle of captaincy in his absence and led India to a thumping 2-0 victory in the Test series against Bangladesh, Sharma seems to be gearing up to get back into the side again.The India opener will return to the Men in Blue setup in the ODI series against Sri Lanka next month. As he prepares for his return to the squad, Rohit shared a photo of himself training.The Indian skipper captioned the post, “Getting there”. In the first photo, Rohit Sharma can be seen jogging. In the second and final picture, he was seen practicing his fielding skills.Check the post here: View this post on Instagram A post shared by Rohit Sharma (@rohitsharma45) The images even got a reaction from Suryakumar Yadav, who responded with a heart-eyed emoticon. Rohit Sharma has played a significant role in Suryakumar Yadav’s development as the two have shared the Mumbai Indians dressing room for quite long and Suryakumar’s heroics in the IPL have propelled him in the international circuit.The pictures were posted after reports surfaced that Rohit Sharma had not yet recovered fully from his thumb injury. The star batter hurt his finger during second India vs Bangladesh ODI at Dhaka and was ruled out of the tournament.He will also not be a part of the Indian T20I squad for the home series against Sri Lanka. Hardik Pandya will assume captaincy of the Men in Blue for the three-game series.The year was not a memorable one for Rohit who struggled in all formats of the game. The opener was unable to perform in the IPL as well, as his team Mumbai Indians ended at the bottom of the points table.In the international arena, Rohit was unable to live up to expectations after assuming captaincy of the side. The opener managed to score only 995 runs in 39 matches, considering all formats of the game. He also failed to score a century throughout the year. The India opener will be hoping for a reversal in his fortunes in the coming year.Under Rohit Sharma’s aegis, India reached the semi-finals of the T20 World Cup in Australia but endured a heart-breaking 10-wicket loss against England. The Men in Blue also failed to do well at the Asia Cup 2022, being knocked out in the second round.Rohit is expected to join the Indian team for the first ODI against Sri Lanka at Guwahati on 10 January. Hardik Pandya will be the vice-captain for the ODIs.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-29 08:47:55","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Rohit-Sharma-net-session.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}