{"newsArray":[{"article_id":"e905841a37a63bbd73e51f74edcdffc9","title":"India thrash Nepal in rain-hit match to enter Asia Cup Super-Fours","link":"https://www.dailymirror.lk/top-story-01/India-thrash-Nepal-in-rain-hit-match-to-enter-Asia-Cup-Super-Fours/316-266629","keywords":null,"creator":null,"video_url":null,"description":"Skipper Rohit Sharma and Shubman Gill remained unbeaten as India hammered cricketing minnows Nepal by 10 wickets in a rain-hit match to enter the Super Four stage of the Asia Cup on Monday.","content":"Skipper Rohit Sharma and Shubman Gill remained unbeaten as India hammered cricketing minnows Nepal by 10 wickets in a rain-hit match to enter the Super Four stage of the Asia Cup on Monday. Chasing a DLS (Duckworth-Lewis-Stern method) revised target of 145 in 23 overs after a rain interruption, India reached home with 17 balls to spare in Pallekele. Rohit, on 74, and Gill, on 67, stood strong. Nepal were bowled out for 230 after Aasif Sheikh top-scored with 58. The 50-over tournament is seen as a tune-up for the upcoming ODI World Cup in India but rain has played spoilsport, forcing organisers to discuss a venue change for upcoming matches in Colombo. India's opening match against Pakistan, who were the first team to move into the next round, was abandoned after just one innings. In their second outing, India were 17-0 in 2.1 overs when heavy rain forced players out of the ground and the field totally covered. Ground staff worked tirelessly to make the ground ready for play again. Rohit and Gill came out roaring and hit a string of boundaries to reach their respective half-centuries and race to the target. Rohit smashed five sixes in his 59-ball knock. Nepal, who are still finding their feet in international cricket and got ODI status in 2018, put up an impressive show after Sheikh's fifty helped the team to a respectable total. Nepal lost their way after a strong start by Sheikh and Kushal Bhurtel (38) but the middle and lower-order fought back. Number eight Sompal Kami smashed 48 before the innings ended in 48.2 overs. Spinner Ravindra Jadeja and fast bowler Mohammed Siraj took three wickets each. Rohit won the toss and elected to field first, but Bhurtel and Sheikh got quick runs with help from the Indian fielders, who dropped three catches in the first five overs. Shreyas Iyer dropped a regulation catch at slip, Virat Kohli spilled a sitter at short cover and wicketkeeper Ishan Kishan let the ball through his gloves. Bhurtel smashed Siraj for four and a huge six on successive balls to keep up the charge and raise the noise among a bunch of Nepal fans at a largely empty ground. He smashed another six off fast bowler Shardul Thakur, but fell caught behind on the next ball. Siraj sent back Sheikh soon after his fifty to dent the Nepal batting further, but after a rain delay Dipendra Singh Airee, who hit 29, and Kami put on 50 runs for the seventh wicket to frustrate the opposition bowlers. Chief scores: Nepal 230 all out in 48.2 overs (K. Bhurtel 38, A. Sheikh 58, G. Jha 23, S. Airee 29, S. Kami 48, M. Siraj 3 for 61, R. Jadeja 3 for 40) India 147 for no loss in 20.1 overs (R. Sharma 74 n.o., S. Gill 67 n.o.)","pubDate":"2023-09-04 21:54:19","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_6a2ee3d3be.jpg","source_id":"dailymirror","source_priority":43341,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"564bcbb4a5d1d766a0da6283d8be5373","title":"Atherton's son De Caires takes career-best figures against Essex","link":"https://www.skysports.com/cricket/news/12040/12955195/county-championship-michael-athertons-son-josh-de-caires-takes-career-best-figures-against-essex","keywords":null,"creator":null,"video_url":null,"description":"Middlesex's Josh De Caires, son of former England captain and Sky Sports pundit Michael Atherton, took career-best figures of 7- 105 as Essex were reduced to 303-9 on day one of their County Championship Division One clash.","content":"Middlesex's Josh De Caires, son of former England captain and Sky Sports pundit Michael Atherton, took career-best figures of 7- 105 as Essex were reduced to 303-9 on day one of their County Championship Division One clash. Nick Browne (59) and Sir Alastair Cook (58) put on a century stand before De Caires took centre stage. The 21-year-old's efforts saw Essex reduced to 169-5 inside 16 overs en route to 303-9 at the close. Surrey are set to extend their lead at the top of Division One after taking 17 wickets on the second day against Warwickshire at the Oval. The hosts were all out for 396 and Warwickshire were subsequently bowled out for 161 thanks to Kemar Roach (4-64) and Dan Worrall (3-34). Surrey then enforced the follow-on and the Bears quickly fell to 35-5 as Worrall and Jordan Clark took three wickets each. Dan Mousley remains at the crease with an unbeaten 60, but Warwickshire closed on 126-7, still trailing by 109. Get Sky Sports Stream the best sport with NOW Cricket news, analysis and features Latest cricket videos and highlights Keith Barker's five-wicket haul saw Hampshire take control as Somerset were all out for 137. Kyle Abbott's dismissal saw Jack Brooks earn his first five-wicket haul of the season as the hosts were all out for 308 in the morning. Barker then got off to a flying start to dismiss Sean Dickson in the third over and Andrew Umeed top-scored for Somerset with 43, leaving Hampshire to resume on day three on 45-0. Josh Bohannon's mammoth knock put Lancashire in the driving seat as they lead Northamptonshire by 160 runs. The 26-year-old batted nearly the entire day to hit 175, his highest score of the season, and shared a partnership of 150 with George Balderson. Alex Lees and Graham Clark both hit centuries as Durham took control against Sussex in Division Two. Lees earned his fifth Championship century of the season with 103, putting on a 146-run partnership with Scott Borthwick, who scored 56. The hosts lead by 158 with five wickets left, Clark (102*) and Bas de Leede (71*) remaining unbeaten at stumps. A good final session saw Leicestershire regain control over Gloucestershire on an eventful day two. From a position of relative comfort overnight, Colin Ackermann's dismissal saw the hosts collapse from 150-3 to 204 all out with top-scorer Rishi Patel making 73. Patel became Luke Charlesworth's maiden first-class victim and the bowler took three wickets in total alongside Zaman Akhter's 4-46. Please use Chrome browser for a more accessible video player Gloucestershire reached 95-3 at tea, but Leicestershire regained the upper hand through Tom Scriven (3-43) as the visitors closed on 179-8, with a lead of 134. Jamie McIlroy's four wickets helped Glamorgan fightback as Worcestershire closed day two on 127-8 in their second innings. Eighteen wickets fell on the second day, including Logan van Beek's four wicket-haul as Glamorgan were reduced to 170 all out, wicketkeeper Chris Cooke top-scoring with 38. Worcestershire still held the advantage with a first-innings lead of 114 but McIlroy returned career-best figures of 4-27. Wayne Madsen missed out on a century in his 200th first-class appearance for Derbyshire as Yorkshire took a 229-run lead at Scarborough. Madsen hit 93 for the visitors while Mitch Wagstaff hit 52, but Derbyshire were soon reduced from 173-3 to 247 all out. Seam duo Matthew Fisher and Jordan Thompson both claimed three wickets each for Yorkshire, who built on their lead in the second innings to finish the day on 179-2. Openers Fin Bean and Adam Lyth put on a century stand before James Wharton and captain Shan Masood scored an unbroken half-century partnership to close.","pubDate":"2023-09-04 19:59:00","image_url":"https://e1.365dm.com/23/09/1920x1080/skysports-cricket-josh-de-caires_6274912.jpg?20230904211812","source_id":"skysports","source_priority":831,"country":["australia","united kingdom","united states of america"],"category":["sports"],"language":"english"},{"article_id":"ad06bb25056edbe431da1506f7c4094f","title":"Cricket World Cup 2023: Kane Williamson to be selected in World Cup squad","link":"https://www.newstalkzb.co.nz/news/sport/cricket-world-cup-2023-kane-williamson-to-be-selected-in-world-cup-squad/","keywords":null,"creator":null,"video_url":null,"description":"Regular Black Caps white ball captain Kane Williamson will be included in the 15-man squad for the Cricket World Cup in India as he continues to recover from knee surgery. After injuring his knee playing in the IPL in March, Williamson has made sufficient progress in his recovery to allow him to be included in the squad for the tournament starting in October. Black Caps coach Gary Stead said while Williamson’s selection doesn’t guarantee he will be available for the first match, he continues to make strong progress in his recovery. “Kane has applied phenomenal dedication to his rehabilitation and has been supported by a strong group of experts around him. He’s left no stone unturned in trying to get back playing cricket at the highest level. We are delighted to be in a place to select him. “At the same time, he’s also kept perspective about his recovery and hasn’t wanted to rush or force his way back too early. As we’ve previously said, it’s great he wants to play cricket for New Zealand in the long term.” Stead noted there wasn’t a specific match timeline on Williamson’s return to play. “As we’ve said throughout this process we want to give Kane every bit of available time to aid his recovery. The World Cup is not a short tournament and we will continue to monitor his progress over the next month ahead of the first tournament match.” Williamson himself said he was delighted to be in a position to take part in what will be his fourth One Day Cricket World Cup. “Through this entire process I have tried to keep an open mind on when I might be able to return to cricket and not get too focused on one date or match. Being selected doesn’t change that and I know there’s still work to do and day-by-day goals to tick off to get back on the field with the team.” The remainder of the Black Caps ICC Cricket World Cup Squad for India will be named on September 11 at an event in Auckland at Papatoetoe High School, Ish Sodhi’s old school.","content":"Regular Black Caps white ball captain Kane Williamson will be included in the 15-man squad for the Cricket World Cup in India as he continues to recover from knee surgery. After injuring his knee playing in the IPL in March , Williamson has made sufficient progress in his recovery to allow him to be included in the squad for the tournament starting in October. Black Caps coach Gary Stead said while Williamson’s selection doesn’t guarantee he will be available for the first match, he continues to make strong progress in his recovery. “Kane has applied phenomenal dedication to his rehabilitation and has been supported by a strong group of experts around him. He’s left no stone unturned in trying to get back playing cricket at the highest level. We are delighted to be in a place to select him. “At the same time, he’s also kept perspective about his recovery and hasn’t wanted to rush or force his way back too early. As we’ve previously said, it’s great he wants to play cricket for New Zealand in the long term.” Stead noted there wasn’t a specific match timeline on Williamson’s return to play. “As we’ve said throughout this process we want to give Kane every bit of available time to aid his recovery. The World Cup is not a short tournament and we will continue to monitor his progress over the next month ahead of the first tournament match.” Williamson himself said he was delighted to be in a position to take part in what will be his fourth One Day Cricket World Cup. “Through this entire process I have tried to keep an open mind on when I might be able to return to cricket and not get too focused on one date or match. Being selected doesn’t change that and I know there’s still work to do and day-by-day goals to tick off to get back on the field with the team.” The remainder of the Black Caps ICC Cricket World Cup Squad for India will be named on September 11 at an event in Auckland at Papatoetoe High School, Ish Sodhi’s old school.","pubDate":"2023-09-04 19:54:18","image_url":"https://www.newstalkzb.co.nz/media/ayafu0a4/kane-williamson-photosport.jpg","source_id":"newstalkzb","source_priority":325733,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"2b1772724a7bed970632c82cb184c8d3","title":"Cricket-India overcome dropped catches to thump Nepal in Asia Cup","link":"https://www.thestar.com.my/sport/cricket/2023/09/05/cricket-india-overcome-dropped-catches-to-thump-nepal-in-asia-cup","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A. Read full story","content":"(Reuters) - India shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A. Chasing a revised target of 145 in 23 overs following a long rain interruption, India romped to a 10-wicket victory under the Duckworth-Lewis method as Skipper Rohit Sharma and fellow opener Shubman Gill got them across the line with 17 balls left. Rohit was not out on 74 after smashing six fours and five sixes, while Gill made an unbeaten 67. India had earlier let Nepal off the hook after opting to bowl as Shreyas Iyer dropped Kushal Bhurtel in the opening over and Virat Kohli made a mess of another chance in the next to hand Aasif Sheikh a lifeline. Bhurtel got another reprieve when wicketkeeper Ishan Kishan put down a simple catch off Mohammed Shami, but fell to Shardul Thakur for 38 while Sheikh scored 58 - his 10th half-century in one-day international cricket. But Ravindra Jadeja (3-40) tore through the middle-order and Mohammed Siraj (3-61) also got in on the act before rain briefly halted play at 178-6. Nepal then rode on Sompal Kami's 48 lower down the order to finish with 230 in 48.2 overs. More rain followed after India began their chase, prompting match officials to revise the target after a lengthy delay. India advance to the next stage of the tournament with three points after their meeting with Pakistan at the same stadium was washed out on Saturday. The south Asian neighbours, who only face off in multi-team tournaments due to soured political relations, are set to clash again in the next stage at the weekend. (Reporting by Shrivathsa Sridhar in Bengaluru; Editing by Nick Macfie)","pubDate":"2023-09-04 18:41:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/09/05/2267839.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"d530fe77afdb672873d93be12d4d771a","title":"India thump Nepal in Asia Cup despite dropped catches","link":"https://www.perthnow.com.au/sport/cricket/india-thump-nepal-in-asia-cup-despite-dropped-catches-c-11803867","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"India have cruised into the Asia Cup Super Four stage after thrashing Nepal by ten wickets in a rain-affected ODI in Sri Lanka.","content":"India have shaken off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele to join arch-rivals Pakistan in the Super Four stage from Group A. Chasing a revised target of 145 in 23 overs i Sri Lanka on Monday, following a long rain interruption, India romped to a 10-wicket victory under the Duckworth-Lewis method with 17 balls left. Skipper Rohit Sharma was not out on 74 (59 balls) after smashing six fours and five sixes, while fellow opener Shubman Gill made an unbeaten 67 off 62 balls. India had earlier let Nepal off the hook after opting to bowl as Shreyas Iyer dropped Kushal Bhurtel in the opening over and Virat Kohli made a mess of another chance in the next to hand Aasif Sheikh a lifeline. Bhurtel got another reprieve when wicketkeeper Ishan Kishan put down a simple catch off Mohammed Shami, but fell to Shardul Thakur for 38 while Sheikh scored 58 - his 10th half-century in one-day international cricket. But Ravindra Jadeja (3-40) tore through the middle-order and Mohammed Siraj (3-61) also got in on the act before rain briefly halted play at 6-178. Nepal then rode on Sompal Kami's 48 lower down the order to finish with 230 in 48.2 overs. More rain followed after India began their chase, prompting match officials to revise the target after a lengthy delay.","pubDate":"2023-09-04 18:36:55","image_url":"https://images.perthnow.com.au/publication/C-11803867/38021b160d91e59e88fd1031853b0311f89e246f-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"17ea109f9ee8fd8aea628dadbacf2157","title":"India overcome dropped catches to thump Nepal in Asia Cup","link":"https://www.straitstimes.com/sport/india-overcome-dropped-catches-to-thump-nepal-in-asia-cup","keywords":null,"creator":null,"video_url":null,"description":"September 05, 2023 2:32 AMIndia shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A.","content":"India shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A. Chasing a revised target of 145 in 23 overs following a long rain interruption, India romped to a 10-wicket victory under the Duckworth-Lewis method as Skipper Rohit Sharma and fellow opener Shubman Gill got them across the line with 17 balls left. Rohit was not out on 74 after smashing six fours and five sixes, while Gill made an unbeaten 67. India had earlier let Nepal off the hook after opting to bowl as Shreyas Iyer dropped Kushal Bhurtel in the opening over and Virat Kohli made a mess of another chance in the next to hand Aasif Sheikh a lifeline. Bhurtel got another reprieve when wicketkeeper Ishan Kishan put down a simple catch off Mohammed Shami, but fell to Shardul Thakur for 38 while Sheikh scored 58 - his 10th half-century in one-day international cricket. But Ravindra Jadeja (3-40) tore through the middle-order and Mohammed Siraj (3-61) also got in on the act before rain briefly halted play at 178-6. Nepal then rode on Sompal Kami's 48 lower down the order to finish with 230 in 48.2 overs. More rain followed after India began their chase, prompting match officials to revise the target after a lengthy delay. India advance to the next stage of the tournament with three points after their meeting with Pakistan at the same stadium was washed out on Saturday. The south Asian neighbours, who only face off in multi-team tournaments due to soured political relations, are set to clash again in the next stage at the weekend. REUTERS","pubDate":"2023-09-04 18:32:19","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"1435524bad33d6caaec123707dd01ed2","title":"Asia Cup Super 4s – Pakistan-India match 'shifted to Hambantota'","link":"https://en.dailypakistan.com.pk/04-Sep-2023/asia-cup-super-4s-pakistan-india-match-shifted-to-hambantota","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"The second match of the Asia Cup Super 4s stage between Pakistan and India has been shifted to the Mahinda Rajapaksa International Cricket Stadium in Hambantota, Geo News quoted sources as saying.","content":"The second match of the Asia Cup Super 4s stage between Pakistan and India has been shifted to the Mahinda Rajapaksa International Cricket Stadium in Hambantota, Geo News quoted sources as saying. The match was scheduled to be played in Colombo but officials, who spoke on the condition of anonymity, said the September 10 match had been shifted to Hambantota due to the rain forecasts. Earlier today it was reported that after rain played a spoilsport during Pakistan vs India match on September 2 in Sri Lanka's Kandy city, the Asian Cricket Council (ACC) was deliberating about shifting the venue of matches owing to the unpredictable weather of Colombo. The development was communicated by the sources after Pakistan Cricket Board (PCB) Management Committee Chairman Zaka Ashraf contacted ACC President Jay Shah regarding the matter in order to save another match between the archrivals in Colombo from being impacted by the weather. Rain played spoilsport on Saturday, dampening the high hopes of fans to see a thriller between Pakistan and India in the much anticipated Asia Cup 2023 match. However, the Green Shirts qualified for the Super 4s — despite not having to bat as their run chase was called off due to persistent showers — after a successful day in the field. Sharing his concerns regarding the unpredictable climate of the tropical island, Ashraf told Shah about the likelihood of more rain in Sri Lanka as well as favourable weather in Pakistan for the tournament to continue without any hindrances. Meanwhile, the Board of Control for Cricket in India is reportedly not satisfied with the hotel provided to team India in Dambulla city. The BCCI has insisted that the hotels in Dambulla are not up to the standard, the sources said, adding that broadcasters, too, have objections to hotel arrangements in Hambantota, the Sri Lankan city where the weather is good. Despite the draw in the September 2 match, Pakistan have qualified for the Super 4s stage as they began their Asia Cup 2023 campaign on a high note with a massive 238-run win over Nepal on Wednesday. Meanwhile, this was India's first match in the tournament making the clash with Nepal a must-win. But considering the format of the Asia Cup it is likely that we may see another between the archrivals on September 10.","pubDate":"2023-09-04 18:29:40","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-09-04/pakistan-india-match-in-asia-cup-super-4s-shifted-to-1693850660-4988.jpg","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"2f0ef853b1ef919452a99e94e52c7c49","title":"IND vs NEP, Asia Cup 2023: India beat Nepal by 10 wickets to reach Super 4 stage, to face Pakistan on Sunday","link":"https://www.dnaindia.com/cricket/report-ind-vs-nep-asia-cup-2023-india-beat-nepal-by-10-wickets-to-reach-super-4-stage-to-face-pakistan-on-sunday-3058905","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Following a rain delay, India was tasked with chasing down 145 runs in 23 overs, a challenge that Sharma and Gill effortlessly conquered.","content":"Rohit Sharma and Shubman Gill showcased their batting prowess by smashing impressive half-centuries, leading India to a resounding 10-wicket victory (DLS method) over Nepal in a rain-affected Asia Cup 2023 clash held in Kandy. Following a rain delay, India was tasked with chasing down 145 runs in 23 overs, a challenge that Sharma and Gill effortlessly conquered. Nepal, after being invited to bat first, displayed commendable determination as they managed to post a competitive total of 230 runs before losing all their wickets. However, India's lackluster fielding performance compounded their woes, with numerous dropped catches allowing Nepal to capitalize on the missed opportunities. Nepal began their innings on a strong note, with openers Kushal Bhurtel and Aasif Sheikh forming a solid partnership of 65 runs for the first wicket. However, Shardul Thakur's dismissal of Bhurtel for a well-played 38 off 25 deliveries shifted the momentum in India's favor. Ravindra Jadeja then joined the fray, spearheading India's fightback with three crucial wickets. Mohammed Siraj also contributed significantly, claiming three wickets of his own. Aasif emerged as the standout batsman for Nepal, etching his name in history as the first player from his country to score a half-century against India. His composed knock of 58 off 97 deliveries finally came to an end in the 30th over, falling victim to Siraj's bowling prowess. Sompal Kami also showcased his intent by adding a valuable 48 runs off 56 balls to Nepal's total before being dismissed by Mohammad Shami in the 47th over. READ| Who is Aasif Sheikh? Nepal's first player to slam fifty against India in ODIs","pubDate":"2023-09-04 18:13:00","image_url":null,"source_id":"dnaindia","source_priority":18388,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7e1ef5ec269de8bf1b3a87215feae8b2","title":"Asia Cup 2023: নেপালকে দশ উইকেটে হারিয়ে সুপার ফোরে ভারত, ওপেনিং জুটিতে অবিচ্ছেদ্য ১৪৭ রান রোহিত-গিলের","link":"https://bangla.latestly.com/sports/team-india-beats-nepal-by-10-wickets-to-through-for-super-4-in-asia-cup-2023-241427.html","keywords":null,"creator":null,"video_url":null,"description":"নেপালকে অনায়াসে হারিয়ে এশিয়া কাপের সুপার ফোরে উঠল ভারত। দফায় দফায় বৃষ্টিতে বিঘ্নিত ম্যাচে নেপালকে ১০ উইকেটে হারাল টিম ইন্ডিয়া।","content":"ক্যান্ডি, ৪ সেপ্টেম্বর: নেপাল (Nepal)কে অনায়াসে হারিয়ে এশিয়া কাপের (Asia Cup Cricket 2023) সুপার ফোরে উঠল ভারত (Team India)। দফায় দফায় বৃষ্টিতে বিঘ্নিত ম্যাচে নেপালকে ১০ উইকেটে হারাল টিম ইন্ডিয়া। আন্তর্জাতিক ক্রিকেটে প্রথমবার সুপার পাওয়ার ভারতের বিরুদ্ধে খেলতে নেমে নেপালের ব্যাটাররা লড়াই করলেও, রোহিত শর্মাদের একটা উইকেটও তুলতে পারলেন না সে দেশের বোলাররা। রোহিত শর্মা ৫৯ বলে ৭৪ রানে, ও শুভমন গিল ৬২ বলে ৬৭ রানে অপরাজিত থাকলেন। ১৭ বল বাকি থাকতে জয়ের জন্য প্রয়োজনীয় রান তুলে নেয় টিম ইন্ডিয়া। নেপাল প্রথমে ব্যাট করে নির্ধারিত ৫০ ওভারে করেছিল ২৩০ রান। এরপর ভারতের ইনিংসের শুরুতে দীর্ঘক্ষণ বৃষ্টি চলায় ম্যাচের ওভার সংখ্যা কমে যায়। ডার্ক ওয়ার্থ লুইস পদ্ধতিতে ভারতকে জিততে হলে ২৩ ওভারে করত হত ১৪৩ রান। নেপালের অনভিজ্ঞ বোলারদের কোনওরকম পাত্তা না দিয়ে টিম ইন্ডিয়ার দুই ওপেনার অধিনায়ক রোহিত শর্মা ও শুভমন গিলকে অনায়াসে দলকে জিতিয়ে আনেন। ওপেনিং জুটিতে ১২১ বলে অবিচ্ছেদ্য ১৪৭ রান করলেন রোহিত-গিল। সুপার ফোর রাউন্ড ভারত এবার খেলবে পাকিস্তানের (১০ সেপ্টেম্বর), বাংলাদেশ (১২ সেপ্টেম্বর), এবং শ্রীলঙ্কা/আফগানিস্তান (১৫ সেপ্টেম্বর)-এর বিরুদ্ধে । আরও পড়ুন-কাল দুপুর দেড়টায় বিশ্বকাপের দল ঘোষণা, মূল জল্পনা যাকে নিয়ে দেখুন টুইট INDIA vs PAKISTAN ON SEPTEMBER 10th. - Time for Round 2 in Asia cup. pic.twitter.com/RPOfGAptDA — Johns. (@CricCrazyJohns) September 4, 2023 হারলেও নেপালের ব্যাটারদের লড়াই বেশ দাগ কাটল। চলতি এশিয়া কাপের প্রথম ম্যাচে পাকিস্তানের ৩৪২ রানের জবাবে নেপাল মাত্র ১০৪ রানে অল আউট হয়ে যায়। সেই তুলনায় টিম ইন্ডিয়ার বিরুদ্ধে বেশ ভাল লড়লেন নেপালের ব্যাটাররা। নেট রান রেটে পাকিস্তানের থেকে পিছিয়ে পড়ে দ্বিতীয় হয়ে সুপার ফোরে উঠল টিম ইন্ডিয়া। নেপালের বিরুদ্ধে পাকিস্তান জেতে ২৩৮ রানে, আর ভারত জিতল ১০ উইকেট। ভারত-পাকিস্তান ম্য়াচ বৃষ্টিতে ভেস্তে যায়। সমসংখ্যাক পয়েন্ট থাকলেও নেট রান রেট তাই পাকিস্তানের দাঁড়ায় ৪.৭৬০, আর টিম ইন্ডিয়ার সেখানে ১.০২৮।","pubDate":"2023-09-04 18:04:34","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"7f9de2dab85ec021ba425fb7560488f9","title":"IND Vs NEP, Match Highlights: রোহিত, শুভমনের দুরন্ত অর্ধশতরান, নেপালকে হারিয়ে এশিয়া কাপের সুপার ফোরে ভারত","link":"https://bengali.abplive.com/sports/cricket/asia-cup-2023-india-won-by-10-wickets-against-nepal-match-5-full-match-highlights-pallekele-stadium-1006517","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"ক্যান্ডি: বৃষ্টিবিঘ্নিত ম্যাচে নেপালের বিরুদ্ধে (IND vs NEP) জয়ের জন্য ভারতীয় দলকে ১৪৩ রান তাড়া করতে হত। ওপেনারদের দাপটেই নেপালকে ১০ উইকেটে হারিয়ে দিল ভারত। শুভমন গিল (Shubman Gill) ও রোহিত শর্মা (Rohit Sharma) উভয়েই অর্ধশতরান হাঁকান। ১৭ বল বাকি থাকতেই জয় সুনিশ্চিত করে ভারত। রোহিত ৭৪ ও শুভমন ৬৭ রানে অপরাজিত থাকেন। এই জয়ের সুবাদেই এশিয়া কাপের (Asia Cup 2023) সুপার ফোরে নিজেদের জায়গা পাকা করে নিল ভারত।  ম্যাচে বল হাতে যেমন ভারতীয় দলের শুরুটা ভাল হয়নি, ব্যাট হাতেও তেমনটা টিম ইন্ডিয়া, বিশেষত অধিনায়ক রোহিত শুরুটা নড়বড়ে করেছিলেন। প্রথম ওভারেই একাধিকবার তাঁর বিরুদ্ধে আউটের আপিল উঠে। তবে সেই চাপ সামলে নেন। ভারতীয় ইনিংসে ১৩ বল হতে না হতেই বৃষ্টির আগমন ঘটে। এই বৃষ্টির জেরেই ভারতের লক্ষ্য ২৩১ রান থেকে কমে ১৪৩ রান দাঁড়ায়। ৫০ ওভারের ম্যাচ দাঁড়ায় ২৩ ওভারের ম্যাচে। বৃষ্টির সঙ্গে সঙ্গে থামলে ভারতীয় দল ব্যাটে নামলে দুরন্ত ছন্দে দেখায় দুই ওপেনারকেই। রোহিত ও শুভমন একের পর এক বল বাউন্ডারির বাইরে পাঠান। ৭.৫ ওভারেই ৫০ রানের গণ্ডি পার করে ফেলে টিম ইন্ডিয়া। রোহিত পাঁচটি চার ও তিনটি ছক্কার সুবাদে মাত্র ৩৯ বলে নিজের অর্ধশতরান পূরণ করেন। গিল ৫০ রানের গণ্ডি পার করতে নেন ৪৭ বল। ১৩.৪ ওভারে ১০০ রান করে ভারত। শতরানের গণ্ডি পার করার পর খানিকটা মন্থর গতিতেই ব্যাটিং করে নির্ধারিত লক্ষ্যে পৌঁছে যায় ভারত। চার মেরে দলের জয় সুনিশ্চিত করেন গিল। ৭৪ রানের ইনিংসের জন্য অধিনায়ক রোহিতকেই ম্যাচের সেরা ঘোষণা করা হয়। ভারতীয় দল এরপর রবিবার, ১০ সেপ্টেম্বর পাকিস্তানের বিরুদ্ধে সুপার ফোরে নিজেদের প্রথম ম্যাচে খেলতে নামবে। সদ্য বাবা হওয়া যশপ্রীত বুমরা এই ম্যাচে না খেললেও, পাকিস্তানের বিরুদ্ধে ম্যাচের আগে দলে ফিরবেন বলেই বিসিসিআই সূত্রে খবর। চোট সারিয়ে কেএল রাহুলও সুপার ফোরের সেই ম্যাচে ভারতীয় একাদশের অংশ হতে পারেন। চিরপ্রতিদ্বন্দ্বীদের গত ম্য়াচ ভেস্তে গিয়েছিল। এবার পরের ম্যাচে কী হয়, সেটাই দেখার বিষয়। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: অপেক্ষার অবসান, মঙ্গলবারই আয়োজিত হবে ভারতের বিশ্বকাপ দল","content":"ক্যান্ডি: বৃষ্টিবিঘ্নিত ম্যাচে নেপালের বিরুদ্ধে (IND vs NEP) জয়ের জন্য ভারতীয় দল কে ১৪৩ রান তাড়া করতে হত। ওপেনারদের দাপটেই নেপালকে ১০ উইকেটে হারিয়ে দিল ভারত। শুভমন গিল (Shubman Gill) ও রোহিত শর্মা (Rohit Sharma) উভয়েই অর্ধশতরান হাঁকান। ১৭ বল বাকি থাকতেই জয় সুনিশ্চিত করে ভারত। রোহিত ৭৪ ও শুভমন ৬৭ রানে অপরাজিত থাকেন। এই জয়ের সুবাদেই এশিয়া কাপ ের (Asia Cup 2023) সুপার ফোরে নিজেদের জায়গা পাকা করে নিল ভারত। ম্যাচে বল হাতে যেমন ভারতীয় দলের শুরুটা ভাল হয়নি, ব্যাট হাতেও তেমনটা টিম ইন্ডিয়া, বিশেষত অধিনায়ক রোহিত শুরুটা নড়বড়ে করেছিলেন। প্রথম ওভারেই একাধিকবার তাঁর বিরুদ্ধে আউটের আপিল উঠে। তবে সেই চাপ সামলে নেন। ভারতীয় ইনিংসে ১৩ বল হতে না হতেই বৃষ্টির আগমন ঘটে। এই বৃষ্টির জেরেই ভারতের লক্ষ্য ২৩১ রান থেকে কমে ১৪৩ রান দাঁড়ায়। ৫০ ওভারের ম্যাচ দাঁড়ায় ২৩ ওভারের ম্যাচে। বৃষ্টির সঙ্গে সঙ্গে থামলে ভারতীয় দল ব্যাটে নামলে দুরন্ত ছন্দে দেখায় দুই ওপেনারকেই। রোহিত ও শুভমন একের পর এক বল বাউন্ডারির বাইরে পাঠান। ৭.৫ ওভারেই ৫০ রানের গণ্ডি পার করে ফেলে টিম ইন্ডিয়া। রোহিত পাঁচটি চার ও তিনটি ছক্কার সুবাদে মাত্র ৩৯ বলে নিজের অর্ধশতরান পূরণ করেন। গিল ৫০ রানের গণ্ডি পার করতে নেন ৪৭ বল। ১৩.৪ ওভারে ১০০ রান করে ভারত। শতরানের গণ্ডি পার করার পর খানিকটা মন্থর গতিতেই ব্যাটিং করে নির্ধারিত লক্ষ্যে পৌঁছে যায় ভারত। চার মেরে দলের জয় সুনিশ্চিত করেন গিল। ৭৪ রানের ইনিংসের জন্য অধিনায়ক রোহিতকেই ম্যাচের সেরা ঘোষণা করা হয়। ভারতীয় দল এরপর রবিবার, ১০ সেপ্টেম্বর পাকিস্তানের বিরুদ্ধে সুপার ফোরে নিজেদের প্রথম ম্যাচে খেলতে নামবে। সদ্য বাবা হওয়া যশপ্রীত বুমরা এই ম্যাচে না খেললেও, পাকিস্তানের বিরুদ্ধে ম্যাচের আগে দলে ফিরবেন বলেই বিসিসিআই সূত্রে খবর। চোট সারিয়ে কেএল রাহুলও সুপার ফোরের সেই ম্যাচে ভারতীয় একাদশের অংশ হতে পারেন। চিরপ্রতিদ্বন্দ্বীদের গত ম্য়াচ ভেস্তে গিয়েছিল। এবার পরের ম্যাচে কী হয়, সেটাই দেখার বিষয়। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: অপেক্ষার অবসান, মঙ্গলবারই আয়োজিত হবে ভারতের বিশ্বকাপ দল var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-04 18:04:05","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/04/5f19eadcf111096df351090b9a9108161693850262337507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"e905841a37a63bbd73e51f74edcdffc9","title":"India thrash Nepal in rain-hit match to enter Asia Cup Super-Fours","link":"https://www.dailymirror.lk/top-story-01/India-thrash-Nepal-in-rain-hit-match-to-enter-Asia-Cup-Super-Fours/316-266629","keywords":null,"creator":null,"video_url":null,"description":"Skipper Rohit Sharma and Shubman Gill remained unbeaten as India hammered cricketing minnows Nepal by 10 wickets in a rain-hit match to enter the Super Four stage of the Asia Cup on Monday.","content":"Skipper Rohit Sharma and Shubman Gill remained unbeaten as India hammered cricketing minnows Nepal by 10 wickets in a rain-hit match to enter the Super Four stage of the Asia Cup on Monday. Chasing a DLS (Duckworth-Lewis-Stern method) revised target of 145 in 23 overs after a rain interruption, India reached home with 17 balls to spare in Pallekele. Rohit, on 74, and Gill, on 67, stood strong. Nepal were bowled out for 230 after Aasif Sheikh top-scored with 58. The 50-over tournament is seen as a tune-up for the upcoming ODI World Cup in India but rain has played spoilsport, forcing organisers to discuss a venue change for upcoming matches in Colombo. India's opening match against Pakistan, who were the first team to move into the next round, was abandoned after just one innings. In their second outing, India were 17-0 in 2.1 overs when heavy rain forced players out of the ground and the field totally covered. Ground staff worked tirelessly to make the ground ready for play again. Rohit and Gill came out roaring and hit a string of boundaries to reach their respective half-centuries and race to the target. Rohit smashed five sixes in his 59-ball knock. Nepal, who are still finding their feet in international cricket and got ODI status in 2018, put up an impressive show after Sheikh's fifty helped the team to a respectable total. Nepal lost their way after a strong start by Sheikh and Kushal Bhurtel (38) but the middle and lower-order fought back. Number eight Sompal Kami smashed 48 before the innings ended in 48.2 overs. Spinner Ravindra Jadeja and fast bowler Mohammed Siraj took three wickets each. Rohit won the toss and elected to field first, but Bhurtel and Sheikh got quick runs with help from the Indian fielders, who dropped three catches in the first five overs. Shreyas Iyer dropped a regulation catch at slip, Virat Kohli spilled a sitter at short cover and wicketkeeper Ishan Kishan let the ball through his gloves. Bhurtel smashed Siraj for four and a huge six on successive balls to keep up the charge and raise the noise among a bunch of Nepal fans at a largely empty ground. He smashed another six off fast bowler Shardul Thakur, but fell caught behind on the next ball. Siraj sent back Sheikh soon after his fifty to dent the Nepal batting further, but after a rain delay Dipendra Singh Airee, who hit 29, and Kami put on 50 runs for the seventh wicket to frustrate the opposition bowlers. Chief scores: Nepal 230 all out in 48.2 overs (K. Bhurtel 38, A. Sheikh 58, G. Jha 23, S. Airee 29, S. Kami 48, M. Siraj 3 for 61, R. Jadeja 3 for 40) India 147 for no loss in 20.1 overs (R. Sharma 74 n.o., S. Gill 67 n.o.)","pubDate":"2023-09-04 21:54:19","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_6a2ee3d3be.jpg","source_id":"dailymirror","source_priority":43341,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"564bcbb4a5d1d766a0da6283d8be5373","title":"Atherton's son De Caires takes career-best figures against Essex","link":"https://www.skysports.com/cricket/news/12040/12955195/county-championship-michael-athertons-son-josh-de-caires-takes-career-best-figures-against-essex","keywords":null,"creator":null,"video_url":null,"description":"Middlesex's Josh De Caires, son of former England captain and Sky Sports pundit Michael Atherton, took career-best figures of 7- 105 as Essex were reduced to 303-9 on day one of their County Championship Division One clash.","content":"Middlesex's Josh De Caires, son of former England captain and Sky Sports pundit Michael Atherton, took career-best figures of 7- 105 as Essex were reduced to 303-9 on day one of their County Championship Division One clash. Nick Browne (59) and Sir Alastair Cook (58) put on a century stand before De Caires took centre stage. The 21-year-old's efforts saw Essex reduced to 169-5 inside 16 overs en route to 303-9 at the close. Surrey are set to extend their lead at the top of Division One after taking 17 wickets on the second day against Warwickshire at the Oval. The hosts were all out for 396 and Warwickshire were subsequently bowled out for 161 thanks to Kemar Roach (4-64) and Dan Worrall (3-34). Surrey then enforced the follow-on and the Bears quickly fell to 35-5 as Worrall and Jordan Clark took three wickets each. Dan Mousley remains at the crease with an unbeaten 60, but Warwickshire closed on 126-7, still trailing by 109. Get Sky Sports Stream the best sport with NOW Cricket news, analysis and features Latest cricket videos and highlights Keith Barker's five-wicket haul saw Hampshire take control as Somerset were all out for 137. Kyle Abbott's dismissal saw Jack Brooks earn his first five-wicket haul of the season as the hosts were all out for 308 in the morning. Barker then got off to a flying start to dismiss Sean Dickson in the third over and Andrew Umeed top-scored for Somerset with 43, leaving Hampshire to resume on day three on 45-0. Josh Bohannon's mammoth knock put Lancashire in the driving seat as they lead Northamptonshire by 160 runs. The 26-year-old batted nearly the entire day to hit 175, his highest score of the season, and shared a partnership of 150 with George Balderson. Alex Lees and Graham Clark both hit centuries as Durham took control against Sussex in Division Two. Lees earned his fifth Championship century of the season with 103, putting on a 146-run partnership with Scott Borthwick, who scored 56. The hosts lead by 158 with five wickets left, Clark (102*) and Bas de Leede (71*) remaining unbeaten at stumps. A good final session saw Leicestershire regain control over Gloucestershire on an eventful day two. From a position of relative comfort overnight, Colin Ackermann's dismissal saw the hosts collapse from 150-3 to 204 all out with top-scorer Rishi Patel making 73. Patel became Luke Charlesworth's maiden first-class victim and the bowler took three wickets in total alongside Zaman Akhter's 4-46. Please use Chrome browser for a more accessible video player Gloucestershire reached 95-3 at tea, but Leicestershire regained the upper hand through Tom Scriven (3-43) as the visitors closed on 179-8, with a lead of 134. Jamie McIlroy's four wickets helped Glamorgan fightback as Worcestershire closed day two on 127-8 in their second innings. Eighteen wickets fell on the second day, including Logan van Beek's four wicket-haul as Glamorgan were reduced to 170 all out, wicketkeeper Chris Cooke top-scoring with 38. Worcestershire still held the advantage with a first-innings lead of 114 but McIlroy returned career-best figures of 4-27. Wayne Madsen missed out on a century in his 200th first-class appearance for Derbyshire as Yorkshire took a 229-run lead at Scarborough. Madsen hit 93 for the visitors while Mitch Wagstaff hit 52, but Derbyshire were soon reduced from 173-3 to 247 all out. Seam duo Matthew Fisher and Jordan Thompson both claimed three wickets each for Yorkshire, who built on their lead in the second innings to finish the day on 179-2. Openers Fin Bean and Adam Lyth put on a century stand before James Wharton and captain Shan Masood scored an unbroken half-century partnership to close.","pubDate":"2023-09-04 19:59:00","image_url":"https://e1.365dm.com/23/09/1920x1080/skysports-cricket-josh-de-caires_6274912.jpg?20230904211812","source_id":"skysports","source_priority":831,"country":["australia","united kingdom","united states of america"],"category":["sports"],"language":"english"},{"article_id":"ad06bb25056edbe431da1506f7c4094f","title":"Cricket World Cup 2023: Kane Williamson to be selected in World Cup squad","link":"https://www.newstalkzb.co.nz/news/sport/cricket-world-cup-2023-kane-williamson-to-be-selected-in-world-cup-squad/","keywords":null,"creator":null,"video_url":null,"description":"Regular Black Caps white ball captain Kane Williamson will be included in the 15-man squad for the Cricket World Cup in India as he continues to recover from knee surgery. After injuring his knee playing in the IPL in March, Williamson has made sufficient progress in his recovery to allow him to be included in the squad for the tournament starting in October. Black Caps coach Gary Stead said while Williamson’s selection doesn’t guarantee he will be available for the first match, he continues to make strong progress in his recovery. “Kane has applied phenomenal dedication to his rehabilitation and has been supported by a strong group of experts around him. He’s left no stone unturned in trying to get back playing cricket at the highest level. We are delighted to be in a place to select him. “At the same time, he’s also kept perspective about his recovery and hasn’t wanted to rush or force his way back too early. As we’ve previously said, it’s great he wants to play cricket for New Zealand in the long term.” Stead noted there wasn’t a specific match timeline on Williamson’s return to play. “As we’ve said throughout this process we want to give Kane every bit of available time to aid his recovery. The World Cup is not a short tournament and we will continue to monitor his progress over the next month ahead of the first tournament match.” Williamson himself said he was delighted to be in a position to take part in what will be his fourth One Day Cricket World Cup. “Through this entire process I have tried to keep an open mind on when I might be able to return to cricket and not get too focused on one date or match. Being selected doesn’t change that and I know there’s still work to do and day-by-day goals to tick off to get back on the field with the team.” The remainder of the Black Caps ICC Cricket World Cup Squad for India will be named on September 11 at an event in Auckland at Papatoetoe High School, Ish Sodhi’s old school.","content":"Regular Black Caps white ball captain Kane Williamson will be included in the 15-man squad for the Cricket World Cup in India as he continues to recover from knee surgery. After injuring his knee playing in the IPL in March , Williamson has made sufficient progress in his recovery to allow him to be included in the squad for the tournament starting in October. Black Caps coach Gary Stead said while Williamson’s selection doesn’t guarantee he will be available for the first match, he continues to make strong progress in his recovery. “Kane has applied phenomenal dedication to his rehabilitation and has been supported by a strong group of experts around him. He’s left no stone unturned in trying to get back playing cricket at the highest level. We are delighted to be in a place to select him. “At the same time, he’s also kept perspective about his recovery and hasn’t wanted to rush or force his way back too early. As we’ve previously said, it’s great he wants to play cricket for New Zealand in the long term.” Stead noted there wasn’t a specific match timeline on Williamson’s return to play. “As we’ve said throughout this process we want to give Kane every bit of available time to aid his recovery. The World Cup is not a short tournament and we will continue to monitor his progress over the next month ahead of the first tournament match.” Williamson himself said he was delighted to be in a position to take part in what will be his fourth One Day Cricket World Cup. “Through this entire process I have tried to keep an open mind on when I might be able to return to cricket and not get too focused on one date or match. Being selected doesn’t change that and I know there’s still work to do and day-by-day goals to tick off to get back on the field with the team.” The remainder of the Black Caps ICC Cricket World Cup Squad for India will be named on September 11 at an event in Auckland at Papatoetoe High School, Ish Sodhi’s old school.","pubDate":"2023-09-04 19:54:18","image_url":"https://www.newstalkzb.co.nz/media/ayafu0a4/kane-williamson-photosport.jpg","source_id":"newstalkzb","source_priority":325733,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"2b1772724a7bed970632c82cb184c8d3","title":"Cricket-India overcome dropped catches to thump Nepal in Asia Cup","link":"https://www.thestar.com.my/sport/cricket/2023/09/05/cricket-india-overcome-dropped-catches-to-thump-nepal-in-asia-cup","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A. Read full story","content":"(Reuters) - India shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A. Chasing a revised target of 145 in 23 overs following a long rain interruption, India romped to a 10-wicket victory under the Duckworth-Lewis method as Skipper Rohit Sharma and fellow opener Shubman Gill got them across the line with 17 balls left. Rohit was not out on 74 after smashing six fours and five sixes, while Gill made an unbeaten 67. India had earlier let Nepal off the hook after opting to bowl as Shreyas Iyer dropped Kushal Bhurtel in the opening over and Virat Kohli made a mess of another chance in the next to hand Aasif Sheikh a lifeline. Bhurtel got another reprieve when wicketkeeper Ishan Kishan put down a simple catch off Mohammed Shami, but fell to Shardul Thakur for 38 while Sheikh scored 58 - his 10th half-century in one-day international cricket. But Ravindra Jadeja (3-40) tore through the middle-order and Mohammed Siraj (3-61) also got in on the act before rain briefly halted play at 178-6. Nepal then rode on Sompal Kami's 48 lower down the order to finish with 230 in 48.2 overs. More rain followed after India began their chase, prompting match officials to revise the target after a lengthy delay. India advance to the next stage of the tournament with three points after their meeting with Pakistan at the same stadium was washed out on Saturday. The south Asian neighbours, who only face off in multi-team tournaments due to soured political relations, are set to clash again in the next stage at the weekend. (Reporting by Shrivathsa Sridhar in Bengaluru; Editing by Nick Macfie)","pubDate":"2023-09-04 18:41:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/09/05/2267839.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"d530fe77afdb672873d93be12d4d771a","title":"India thump Nepal in Asia Cup despite dropped catches","link":"https://www.perthnow.com.au/sport/cricket/india-thump-nepal-in-asia-cup-despite-dropped-catches-c-11803867","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"India have cruised into the Asia Cup Super Four stage after thrashing Nepal by ten wickets in a rain-affected ODI in Sri Lanka.","content":"India have shaken off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele to join arch-rivals Pakistan in the Super Four stage from Group A. Chasing a revised target of 145 in 23 overs i Sri Lanka on Monday, following a long rain interruption, India romped to a 10-wicket victory under the Duckworth-Lewis method with 17 balls left. Skipper Rohit Sharma was not out on 74 (59 balls) after smashing six fours and five sixes, while fellow opener Shubman Gill made an unbeaten 67 off 62 balls. India had earlier let Nepal off the hook after opting to bowl as Shreyas Iyer dropped Kushal Bhurtel in the opening over and Virat Kohli made a mess of another chance in the next to hand Aasif Sheikh a lifeline. Bhurtel got another reprieve when wicketkeeper Ishan Kishan put down a simple catch off Mohammed Shami, but fell to Shardul Thakur for 38 while Sheikh scored 58 - his 10th half-century in one-day international cricket. But Ravindra Jadeja (3-40) tore through the middle-order and Mohammed Siraj (3-61) also got in on the act before rain briefly halted play at 6-178. Nepal then rode on Sompal Kami's 48 lower down the order to finish with 230 in 48.2 overs. More rain followed after India began their chase, prompting match officials to revise the target after a lengthy delay.","pubDate":"2023-09-04 18:36:55","image_url":"https://images.perthnow.com.au/publication/C-11803867/38021b160d91e59e88fd1031853b0311f89e246f-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"17ea109f9ee8fd8aea628dadbacf2157","title":"India overcome dropped catches to thump Nepal in Asia Cup","link":"https://www.straitstimes.com/sport/india-overcome-dropped-catches-to-thump-nepal-in-asia-cup","keywords":null,"creator":null,"video_url":null,"description":"September 05, 2023 2:32 AMIndia shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A.","content":"India shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A. Chasing a revised target of 145 in 23 overs following a long rain interruption, India romped to a 10-wicket victory under the Duckworth-Lewis method as Skipper Rohit Sharma and fellow opener Shubman Gill got them across the line with 17 balls left. Rohit was not out on 74 after smashing six fours and five sixes, while Gill made an unbeaten 67. India had earlier let Nepal off the hook after opting to bowl as Shreyas Iyer dropped Kushal Bhurtel in the opening over and Virat Kohli made a mess of another chance in the next to hand Aasif Sheikh a lifeline. Bhurtel got another reprieve when wicketkeeper Ishan Kishan put down a simple catch off Mohammed Shami, but fell to Shardul Thakur for 38 while Sheikh scored 58 - his 10th half-century in one-day international cricket. But Ravindra Jadeja (3-40) tore through the middle-order and Mohammed Siraj (3-61) also got in on the act before rain briefly halted play at 178-6. Nepal then rode on Sompal Kami's 48 lower down the order to finish with 230 in 48.2 overs. More rain followed after India began their chase, prompting match officials to revise the target after a lengthy delay. India advance to the next stage of the tournament with three points after their meeting with Pakistan at the same stadium was washed out on Saturday. The south Asian neighbours, who only face off in multi-team tournaments due to soured political relations, are set to clash again in the next stage at the weekend. REUTERS","pubDate":"2023-09-04 18:32:19","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"1435524bad33d6caaec123707dd01ed2","title":"Asia Cup Super 4s – Pakistan-India match 'shifted to Hambantota'","link":"https://en.dailypakistan.com.pk/04-Sep-2023/asia-cup-super-4s-pakistan-india-match-shifted-to-hambantota","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"The second match of the Asia Cup Super 4s stage between Pakistan and India has been shifted to the Mahinda Rajapaksa International Cricket Stadium in Hambantota, Geo News quoted sources as saying.","content":"The second match of the Asia Cup Super 4s stage between Pakistan and India has been shifted to the Mahinda Rajapaksa International Cricket Stadium in Hambantota, Geo News quoted sources as saying. The match was scheduled to be played in Colombo but officials, who spoke on the condition of anonymity, said the September 10 match had been shifted to Hambantota due to the rain forecasts. Earlier today it was reported that after rain played a spoilsport during Pakistan vs India match on September 2 in Sri Lanka's Kandy city, the Asian Cricket Council (ACC) was deliberating about shifting the venue of matches owing to the unpredictable weather of Colombo. The development was communicated by the sources after Pakistan Cricket Board (PCB) Management Committee Chairman Zaka Ashraf contacted ACC President Jay Shah regarding the matter in order to save another match between the archrivals in Colombo from being impacted by the weather. Rain played spoilsport on Saturday, dampening the high hopes of fans to see a thriller between Pakistan and India in the much anticipated Asia Cup 2023 match. However, the Green Shirts qualified for the Super 4s — despite not having to bat as their run chase was called off due to persistent showers — after a successful day in the field. Sharing his concerns regarding the unpredictable climate of the tropical island, Ashraf told Shah about the likelihood of more rain in Sri Lanka as well as favourable weather in Pakistan for the tournament to continue without any hindrances. Meanwhile, the Board of Control for Cricket in India is reportedly not satisfied with the hotel provided to team India in Dambulla city. The BCCI has insisted that the hotels in Dambulla are not up to the standard, the sources said, adding that broadcasters, too, have objections to hotel arrangements in Hambantota, the Sri Lankan city where the weather is good. Despite the draw in the September 2 match, Pakistan have qualified for the Super 4s stage as they began their Asia Cup 2023 campaign on a high note with a massive 238-run win over Nepal on Wednesday. Meanwhile, this was India's first match in the tournament making the clash with Nepal a must-win. But considering the format of the Asia Cup it is likely that we may see another between the archrivals on September 10.","pubDate":"2023-09-04 18:29:40","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-09-04/pakistan-india-match-in-asia-cup-super-4s-shifted-to-1693850660-4988.jpg","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"2f0ef853b1ef919452a99e94e52c7c49","title":"IND vs NEP, Asia Cup 2023: India beat Nepal by 10 wickets to reach Super 4 stage, to face Pakistan on Sunday","link":"https://www.dnaindia.com/cricket/report-ind-vs-nep-asia-cup-2023-india-beat-nepal-by-10-wickets-to-reach-super-4-stage-to-face-pakistan-on-sunday-3058905","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Following a rain delay, India was tasked with chasing down 145 runs in 23 overs, a challenge that Sharma and Gill effortlessly conquered.","content":"Rohit Sharma and Shubman Gill showcased their batting prowess by smashing impressive half-centuries, leading India to a resounding 10-wicket victory (DLS method) over Nepal in a rain-affected Asia Cup 2023 clash held in Kandy. Following a rain delay, India was tasked with chasing down 145 runs in 23 overs, a challenge that Sharma and Gill effortlessly conquered. Nepal, after being invited to bat first, displayed commendable determination as they managed to post a competitive total of 230 runs before losing all their wickets. However, India's lackluster fielding performance compounded their woes, with numerous dropped catches allowing Nepal to capitalize on the missed opportunities. Nepal began their innings on a strong note, with openers Kushal Bhurtel and Aasif Sheikh forming a solid partnership of 65 runs for the first wicket. However, Shardul Thakur's dismissal of Bhurtel for a well-played 38 off 25 deliveries shifted the momentum in India's favor. Ravindra Jadeja then joined the fray, spearheading India's fightback with three crucial wickets. Mohammed Siraj also contributed significantly, claiming three wickets of his own. Aasif emerged as the standout batsman for Nepal, etching his name in history as the first player from his country to score a half-century against India. His composed knock of 58 off 97 deliveries finally came to an end in the 30th over, falling victim to Siraj's bowling prowess. Sompal Kami also showcased his intent by adding a valuable 48 runs off 56 balls to Nepal's total before being dismissed by Mohammad Shami in the 47th over. READ| Who is Aasif Sheikh? Nepal's first player to slam fifty against India in ODIs","pubDate":"2023-09-04 18:13:00","image_url":null,"source_id":"dnaindia","source_priority":18388,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7e1ef5ec269de8bf1b3a87215feae8b2","title":"Asia Cup 2023: নেপালকে দশ উইকেটে হারিয়ে সুপার ফোরে ভারত, ওপেনিং জুটিতে অবিচ্ছেদ্য ১৪৭ রান রোহিত-গিলের","link":"https://bangla.latestly.com/sports/team-india-beats-nepal-by-10-wickets-to-through-for-super-4-in-asia-cup-2023-241427.html","keywords":null,"creator":null,"video_url":null,"description":"নেপালকে অনায়াসে হারিয়ে এশিয়া কাপের সুপার ফোরে উঠল ভারত। দফায় দফায় বৃষ্টিতে বিঘ্নিত ম্যাচে নেপালকে ১০ উইকেটে হারাল টিম ইন্ডিয়া।","content":"ক্যান্ডি, ৪ সেপ্টেম্বর: নেপাল (Nepal)কে অনায়াসে হারিয়ে এশিয়া কাপের (Asia Cup Cricket 2023) সুপার ফোরে উঠল ভারত (Team India)। দফায় দফায় বৃষ্টিতে বিঘ্নিত ম্যাচে নেপালকে ১০ উইকেটে হারাল টিম ইন্ডিয়া। আন্তর্জাতিক ক্রিকেটে প্রথমবার সুপার পাওয়ার ভারতের বিরুদ্ধে খেলতে নেমে নেপালের ব্যাটাররা লড়াই করলেও, রোহিত শর্মাদের একটা উইকেটও তুলতে পারলেন না সে দেশের বোলাররা। রোহিত শর্মা ৫৯ বলে ৭৪ রানে, ও শুভমন গিল ৬২ বলে ৬৭ রানে অপরাজিত থাকলেন। ১৭ বল বাকি থাকতে জয়ের জন্য প্রয়োজনীয় রান তুলে নেয় টিম ইন্ডিয়া। নেপাল প্রথমে ব্যাট করে নির্ধারিত ৫০ ওভারে করেছিল ২৩০ রান। এরপর ভারতের ইনিংসের শুরুতে দীর্ঘক্ষণ বৃষ্টি চলায় ম্যাচের ওভার সংখ্যা কমে যায়। ডার্ক ওয়ার্থ লুইস পদ্ধতিতে ভারতকে জিততে হলে ২৩ ওভারে করত হত ১৪৩ রান। নেপালের অনভিজ্ঞ বোলারদের কোনওরকম পাত্তা না দিয়ে টিম ইন্ডিয়ার দুই ওপেনার অধিনায়ক রোহিত শর্মা ও শুভমন গিলকে অনায়াসে দলকে জিতিয়ে আনেন। ওপেনিং জুটিতে ১২১ বলে অবিচ্ছেদ্য ১৪৭ রান করলেন রোহিত-গিল। সুপার ফোর রাউন্ড ভারত এবার খেলবে পাকিস্তানের (১০ সেপ্টেম্বর), বাংলাদেশ (১২ সেপ্টেম্বর), এবং শ্রীলঙ্কা/আফগানিস্তান (১৫ সেপ্টেম্বর)-এর বিরুদ্ধে । আরও পড়ুন-কাল দুপুর দেড়টায় বিশ্বকাপের দল ঘোষণা, মূল জল্পনা যাকে নিয়ে দেখুন টুইট INDIA vs PAKISTAN ON SEPTEMBER 10th. - Time for Round 2 in Asia cup. pic.twitter.com/RPOfGAptDA — Johns. (@CricCrazyJohns) September 4, 2023 হারলেও নেপালের ব্যাটারদের লড়াই বেশ দাগ কাটল। চলতি এশিয়া কাপের প্রথম ম্যাচে পাকিস্তানের ৩৪২ রানের জবাবে নেপাল মাত্র ১০৪ রানে অল আউট হয়ে যায়। সেই তুলনায় টিম ইন্ডিয়ার বিরুদ্ধে বেশ ভাল লড়লেন নেপালের ব্যাটাররা। নেট রান রেটে পাকিস্তানের থেকে পিছিয়ে পড়ে দ্বিতীয় হয়ে সুপার ফোরে উঠল টিম ইন্ডিয়া। নেপালের বিরুদ্ধে পাকিস্তান জেতে ২৩৮ রানে, আর ভারত জিতল ১০ উইকেট। ভারত-পাকিস্তান ম্য়াচ বৃষ্টিতে ভেস্তে যায়। সমসংখ্যাক পয়েন্ট থাকলেও নেট রান রেট তাই পাকিস্তানের দাঁড়ায় ৪.৭৬০, আর টিম ইন্ডিয়ার সেখানে ১.০২৮।","pubDate":"2023-09-04 18:04:34","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"7f9de2dab85ec021ba425fb7560488f9","title":"IND Vs NEP, Match Highlights: রোহিত, শুভমনের দুরন্ত অর্ধশতরান, নেপালকে হারিয়ে এশিয়া কাপের সুপার ফোরে ভারত","link":"https://bengali.abplive.com/sports/cricket/asia-cup-2023-india-won-by-10-wickets-against-nepal-match-5-full-match-highlights-pallekele-stadium-1006517","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"ক্যান্ডি: বৃষ্টিবিঘ্নিত ম্যাচে নেপালের বিরুদ্ধে (IND vs NEP) জয়ের জন্য ভারতীয় দলকে ১৪৩ রান তাড়া করতে হত। ওপেনারদের দাপটেই নেপালকে ১০ উইকেটে হারিয়ে দিল ভারত। শুভমন গিল (Shubman Gill) ও রোহিত শর্মা (Rohit Sharma) উভয়েই অর্ধশতরান হাঁকান। ১৭ বল বাকি থাকতেই জয় সুনিশ্চিত করে ভারত। রোহিত ৭৪ ও শুভমন ৬৭ রানে অপরাজিত থাকেন। এই জয়ের সুবাদেই এশিয়া কাপের (Asia Cup 2023) সুপার ফোরে নিজেদের জায়গা পাকা করে নিল ভারত।  ম্যাচে বল হাতে যেমন ভারতীয় দলের শুরুটা ভাল হয়নি, ব্যাট হাতেও তেমনটা টিম ইন্ডিয়া, বিশেষত অধিনায়ক রোহিত শুরুটা নড়বড়ে করেছিলেন। প্রথম ওভারেই একাধিকবার তাঁর বিরুদ্ধে আউটের আপিল উঠে। তবে সেই চাপ সামলে নেন। ভারতীয় ইনিংসে ১৩ বল হতে না হতেই বৃষ্টির আগমন ঘটে। এই বৃষ্টির জেরেই ভারতের লক্ষ্য ২৩১ রান থেকে কমে ১৪৩ রান দাঁড়ায়। ৫০ ওভারের ম্যাচ দাঁড়ায় ২৩ ওভারের ম্যাচে। বৃষ্টির সঙ্গে সঙ্গে থামলে ভারতীয় দল ব্যাটে নামলে দুরন্ত ছন্দে দেখায় দুই ওপেনারকেই। রোহিত ও শুভমন একের পর এক বল বাউন্ডারির বাইরে পাঠান। ৭.৫ ওভারেই ৫০ রানের গণ্ডি পার করে ফেলে টিম ইন্ডিয়া। রোহিত পাঁচটি চার ও তিনটি ছক্কার সুবাদে মাত্র ৩৯ বলে নিজের অর্ধশতরান পূরণ করেন। গিল ৫০ রানের গণ্ডি পার করতে নেন ৪৭ বল। ১৩.৪ ওভারে ১০০ রান করে ভারত। শতরানের গণ্ডি পার করার পর খানিকটা মন্থর গতিতেই ব্যাটিং করে নির্ধারিত লক্ষ্যে পৌঁছে যায় ভারত। চার মেরে দলের জয় সুনিশ্চিত করেন গিল। ৭৪ রানের ইনিংসের জন্য অধিনায়ক রোহিতকেই ম্যাচের সেরা ঘোষণা করা হয়। ভারতীয় দল এরপর রবিবার, ১০ সেপ্টেম্বর পাকিস্তানের বিরুদ্ধে সুপার ফোরে নিজেদের প্রথম ম্যাচে খেলতে নামবে। সদ্য বাবা হওয়া যশপ্রীত বুমরা এই ম্যাচে না খেললেও, পাকিস্তানের বিরুদ্ধে ম্যাচের আগে দলে ফিরবেন বলেই বিসিসিআই সূত্রে খবর। চোট সারিয়ে কেএল রাহুলও সুপার ফোরের সেই ম্যাচে ভারতীয় একাদশের অংশ হতে পারেন। চিরপ্রতিদ্বন্দ্বীদের গত ম্য়াচ ভেস্তে গিয়েছিল। এবার পরের ম্যাচে কী হয়, সেটাই দেখার বিষয়। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: অপেক্ষার অবসান, মঙ্গলবারই আয়োজিত হবে ভারতের বিশ্বকাপ দল","content":"ক্যান্ডি: বৃষ্টিবিঘ্নিত ম্যাচে নেপালের বিরুদ্ধে (IND vs NEP) জয়ের জন্য ভারতীয় দল কে ১৪৩ রান তাড়া করতে হত। ওপেনারদের দাপটেই নেপালকে ১০ উইকেটে হারিয়ে দিল ভারত। শুভমন গিল (Shubman Gill) ও রোহিত শর্মা (Rohit Sharma) উভয়েই অর্ধশতরান হাঁকান। ১৭ বল বাকি থাকতেই জয় সুনিশ্চিত করে ভারত। রোহিত ৭৪ ও শুভমন ৬৭ রানে অপরাজিত থাকেন। এই জয়ের সুবাদেই এশিয়া কাপ ের (Asia Cup 2023) সুপার ফোরে নিজেদের জায়গা পাকা করে নিল ভারত। ম্যাচে বল হাতে যেমন ভারতীয় দলের শুরুটা ভাল হয়নি, ব্যাট হাতেও তেমনটা টিম ইন্ডিয়া, বিশেষত অধিনায়ক রোহিত শুরুটা নড়বড়ে করেছিলেন। প্রথম ওভারেই একাধিকবার তাঁর বিরুদ্ধে আউটের আপিল উঠে। তবে সেই চাপ সামলে নেন। ভারতীয় ইনিংসে ১৩ বল হতে না হতেই বৃষ্টির আগমন ঘটে। এই বৃষ্টির জেরেই ভারতের লক্ষ্য ২৩১ রান থেকে কমে ১৪৩ রান দাঁড়ায়। ৫০ ওভারের ম্যাচ দাঁড়ায় ২৩ ওভারের ম্যাচে। বৃষ্টির সঙ্গে সঙ্গে থামলে ভারতীয় দল ব্যাটে নামলে দুরন্ত ছন্দে দেখায় দুই ওপেনারকেই। রোহিত ও শুভমন একের পর এক বল বাউন্ডারির বাইরে পাঠান। ৭.৫ ওভারেই ৫০ রানের গণ্ডি পার করে ফেলে টিম ইন্ডিয়া। রোহিত পাঁচটি চার ও তিনটি ছক্কার সুবাদে মাত্র ৩৯ বলে নিজের অর্ধশতরান পূরণ করেন। গিল ৫০ রানের গণ্ডি পার করতে নেন ৪৭ বল। ১৩.৪ ওভারে ১০০ রান করে ভারত। শতরানের গণ্ডি পার করার পর খানিকটা মন্থর গতিতেই ব্যাটিং করে নির্ধারিত লক্ষ্যে পৌঁছে যায় ভারত। চার মেরে দলের জয় সুনিশ্চিত করেন গিল। ৭৪ রানের ইনিংসের জন্য অধিনায়ক রোহিতকেই ম্যাচের সেরা ঘোষণা করা হয়। ভারতীয় দল এরপর রবিবার, ১০ সেপ্টেম্বর পাকিস্তানের বিরুদ্ধে সুপার ফোরে নিজেদের প্রথম ম্যাচে খেলতে নামবে। সদ্য বাবা হওয়া যশপ্রীত বুমরা এই ম্যাচে না খেললেও, পাকিস্তানের বিরুদ্ধে ম্যাচের আগে দলে ফিরবেন বলেই বিসিসিআই সূত্রে খবর। চোট সারিয়ে কেএল রাহুলও সুপার ফোরের সেই ম্যাচে ভারতীয় একাদশের অংশ হতে পারেন। চিরপ্রতিদ্বন্দ্বীদের গত ম্য়াচ ভেস্তে গিয়েছিল। এবার পরের ম্যাচে কী হয়, সেটাই দেখার বিষয়। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: অপেক্ষার অবসান, মঙ্গলবারই আয়োজিত হবে ভারতের বিশ্বকাপ দল var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-04 18:04:05","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/04/5f19eadcf111096df351090b9a9108161693850262337507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"e905841a37a63bbd73e51f74edcdffc9","title":"India thrash Nepal in rain-hit match to enter Asia Cup Super-Fours","link":"https://www.dailymirror.lk/top-story-01/India-thrash-Nepal-in-rain-hit-match-to-enter-Asia-Cup-Super-Fours/316-266629","keywords":null,"creator":null,"video_url":null,"description":"Skipper Rohit Sharma and Shubman Gill remained unbeaten as India hammered cricketing minnows Nepal by 10 wickets in a rain-hit match to enter the Super Four stage of the Asia Cup on Monday.","content":"Skipper Rohit Sharma and Shubman Gill remained unbeaten as India hammered cricketing minnows Nepal by 10 wickets in a rain-hit match to enter the Super Four stage of the Asia Cup on Monday. Chasing a DLS (Duckworth-Lewis-Stern method) revised target of 145 in 23 overs after a rain interruption, India reached home with 17 balls to spare in Pallekele. Rohit, on 74, and Gill, on 67, stood strong. Nepal were bowled out for 230 after Aasif Sheikh top-scored with 58. The 50-over tournament is seen as a tune-up for the upcoming ODI World Cup in India but rain has played spoilsport, forcing organisers to discuss a venue change for upcoming matches in Colombo. India's opening match against Pakistan, who were the first team to move into the next round, was abandoned after just one innings. In their second outing, India were 17-0 in 2.1 overs when heavy rain forced players out of the ground and the field totally covered. Ground staff worked tirelessly to make the ground ready for play again. Rohit and Gill came out roaring and hit a string of boundaries to reach their respective half-centuries and race to the target. Rohit smashed five sixes in his 59-ball knock. Nepal, who are still finding their feet in international cricket and got ODI status in 2018, put up an impressive show after Sheikh's fifty helped the team to a respectable total. Nepal lost their way after a strong start by Sheikh and Kushal Bhurtel (38) but the middle and lower-order fought back. Number eight Sompal Kami smashed 48 before the innings ended in 48.2 overs. Spinner Ravindra Jadeja and fast bowler Mohammed Siraj took three wickets each. Rohit won the toss and elected to field first, but Bhurtel and Sheikh got quick runs with help from the Indian fielders, who dropped three catches in the first five overs. Shreyas Iyer dropped a regulation catch at slip, Virat Kohli spilled a sitter at short cover and wicketkeeper Ishan Kishan let the ball through his gloves. Bhurtel smashed Siraj for four and a huge six on successive balls to keep up the charge and raise the noise among a bunch of Nepal fans at a largely empty ground. He smashed another six off fast bowler Shardul Thakur, but fell caught behind on the next ball. Siraj sent back Sheikh soon after his fifty to dent the Nepal batting further, but after a rain delay Dipendra Singh Airee, who hit 29, and Kami put on 50 runs for the seventh wicket to frustrate the opposition bowlers. Chief scores: Nepal 230 all out in 48.2 overs (K. Bhurtel 38, A. Sheikh 58, G. Jha 23, S. Airee 29, S. Kami 48, M. Siraj 3 for 61, R. Jadeja 3 for 40) India 147 for no loss in 20.1 overs (R. Sharma 74 n.o., S. Gill 67 n.o.)","pubDate":"2023-09-04 21:54:19","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_6a2ee3d3be.jpg","source_id":"dailymirror","source_priority":43341,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"564bcbb4a5d1d766a0da6283d8be5373","title":"Atherton's son De Caires takes career-best figures against Essex","link":"https://www.skysports.com/cricket/news/12040/12955195/county-championship-michael-athertons-son-josh-de-caires-takes-career-best-figures-against-essex","keywords":null,"creator":null,"video_url":null,"description":"Middlesex's Josh De Caires, son of former England captain and Sky Sports pundit Michael Atherton, took career-best figures of 7- 105 as Essex were reduced to 303-9 on day one of their County Championship Division One clash.","content":"Middlesex's Josh De Caires, son of former England captain and Sky Sports pundit Michael Atherton, took career-best figures of 7- 105 as Essex were reduced to 303-9 on day one of their County Championship Division One clash. Nick Browne (59) and Sir Alastair Cook (58) put on a century stand before De Caires took centre stage. The 21-year-old's efforts saw Essex reduced to 169-5 inside 16 overs en route to 303-9 at the close. Surrey are set to extend their lead at the top of Division One after taking 17 wickets on the second day against Warwickshire at the Oval. The hosts were all out for 396 and Warwickshire were subsequently bowled out for 161 thanks to Kemar Roach (4-64) and Dan Worrall (3-34). Surrey then enforced the follow-on and the Bears quickly fell to 35-5 as Worrall and Jordan Clark took three wickets each. Dan Mousley remains at the crease with an unbeaten 60, but Warwickshire closed on 126-7, still trailing by 109. Get Sky Sports Stream the best sport with NOW Cricket news, analysis and features Latest cricket videos and highlights Keith Barker's five-wicket haul saw Hampshire take control as Somerset were all out for 137. Kyle Abbott's dismissal saw Jack Brooks earn his first five-wicket haul of the season as the hosts were all out for 308 in the morning. Barker then got off to a flying start to dismiss Sean Dickson in the third over and Andrew Umeed top-scored for Somerset with 43, leaving Hampshire to resume on day three on 45-0. Josh Bohannon's mammoth knock put Lancashire in the driving seat as they lead Northamptonshire by 160 runs. The 26-year-old batted nearly the entire day to hit 175, his highest score of the season, and shared a partnership of 150 with George Balderson. Alex Lees and Graham Clark both hit centuries as Durham took control against Sussex in Division Two. Lees earned his fifth Championship century of the season with 103, putting on a 146-run partnership with Scott Borthwick, who scored 56. The hosts lead by 158 with five wickets left, Clark (102*) and Bas de Leede (71*) remaining unbeaten at stumps. A good final session saw Leicestershire regain control over Gloucestershire on an eventful day two. From a position of relative comfort overnight, Colin Ackermann's dismissal saw the hosts collapse from 150-3 to 204 all out with top-scorer Rishi Patel making 73. Patel became Luke Charlesworth's maiden first-class victim and the bowler took three wickets in total alongside Zaman Akhter's 4-46. Please use Chrome browser for a more accessible video player Gloucestershire reached 95-3 at tea, but Leicestershire regained the upper hand through Tom Scriven (3-43) as the visitors closed on 179-8, with a lead of 134. Jamie McIlroy's four wickets helped Glamorgan fightback as Worcestershire closed day two on 127-8 in their second innings. Eighteen wickets fell on the second day, including Logan van Beek's four wicket-haul as Glamorgan were reduced to 170 all out, wicketkeeper Chris Cooke top-scoring with 38. Worcestershire still held the advantage with a first-innings lead of 114 but McIlroy returned career-best figures of 4-27. Wayne Madsen missed out on a century in his 200th first-class appearance for Derbyshire as Yorkshire took a 229-run lead at Scarborough. Madsen hit 93 for the visitors while Mitch Wagstaff hit 52, but Derbyshire were soon reduced from 173-3 to 247 all out. Seam duo Matthew Fisher and Jordan Thompson both claimed three wickets each for Yorkshire, who built on their lead in the second innings to finish the day on 179-2. Openers Fin Bean and Adam Lyth put on a century stand before James Wharton and captain Shan Masood scored an unbroken half-century partnership to close.","pubDate":"2023-09-04 19:59:00","image_url":"https://e1.365dm.com/23/09/1920x1080/skysports-cricket-josh-de-caires_6274912.jpg?20230904211812","source_id":"skysports","source_priority":831,"country":["australia","united kingdom","united states of america"],"category":["sports"],"language":"english"},{"article_id":"ad06bb25056edbe431da1506f7c4094f","title":"Cricket World Cup 2023: Kane Williamson to be selected in World Cup squad","link":"https://www.newstalkzb.co.nz/news/sport/cricket-world-cup-2023-kane-williamson-to-be-selected-in-world-cup-squad/","keywords":null,"creator":null,"video_url":null,"description":"Regular Black Caps white ball captain Kane Williamson will be included in the 15-man squad for the Cricket World Cup in India as he continues to recover from knee surgery. After injuring his knee playing in the IPL in March, Williamson has made sufficient progress in his recovery to allow him to be included in the squad for the tournament starting in October. Black Caps coach Gary Stead said while Williamson’s selection doesn’t guarantee he will be available for the first match, he continues to make strong progress in his recovery. “Kane has applied phenomenal dedication to his rehabilitation and has been supported by a strong group of experts around him. He’s left no stone unturned in trying to get back playing cricket at the highest level. We are delighted to be in a place to select him. “At the same time, he’s also kept perspective about his recovery and hasn’t wanted to rush or force his way back too early. As we’ve previously said, it’s great he wants to play cricket for New Zealand in the long term.” Stead noted there wasn’t a specific match timeline on Williamson’s return to play. “As we’ve said throughout this process we want to give Kane every bit of available time to aid his recovery. The World Cup is not a short tournament and we will continue to monitor his progress over the next month ahead of the first tournament match.” Williamson himself said he was delighted to be in a position to take part in what will be his fourth One Day Cricket World Cup. “Through this entire process I have tried to keep an open mind on when I might be able to return to cricket and not get too focused on one date or match. Being selected doesn’t change that and I know there’s still work to do and day-by-day goals to tick off to get back on the field with the team.” The remainder of the Black Caps ICC Cricket World Cup Squad for India will be named on September 11 at an event in Auckland at Papatoetoe High School, Ish Sodhi’s old school.","content":"Regular Black Caps white ball captain Kane Williamson will be included in the 15-man squad for the Cricket World Cup in India as he continues to recover from knee surgery. After injuring his knee playing in the IPL in March , Williamson has made sufficient progress in his recovery to allow him to be included in the squad for the tournament starting in October. Black Caps coach Gary Stead said while Williamson’s selection doesn’t guarantee he will be available for the first match, he continues to make strong progress in his recovery. “Kane has applied phenomenal dedication to his rehabilitation and has been supported by a strong group of experts around him. He’s left no stone unturned in trying to get back playing cricket at the highest level. We are delighted to be in a place to select him. “At the same time, he’s also kept perspective about his recovery and hasn’t wanted to rush or force his way back too early. As we’ve previously said, it’s great he wants to play cricket for New Zealand in the long term.” Stead noted there wasn’t a specific match timeline on Williamson’s return to play. “As we’ve said throughout this process we want to give Kane every bit of available time to aid his recovery. The World Cup is not a short tournament and we will continue to monitor his progress over the next month ahead of the first tournament match.” Williamson himself said he was delighted to be in a position to take part in what will be his fourth One Day Cricket World Cup. “Through this entire process I have tried to keep an open mind on when I might be able to return to cricket and not get too focused on one date or match. Being selected doesn’t change that and I know there’s still work to do and day-by-day goals to tick off to get back on the field with the team.” The remainder of the Black Caps ICC Cricket World Cup Squad for India will be named on September 11 at an event in Auckland at Papatoetoe High School, Ish Sodhi’s old school.","pubDate":"2023-09-04 19:54:18","image_url":"https://www.newstalkzb.co.nz/media/ayafu0a4/kane-williamson-photosport.jpg","source_id":"newstalkzb","source_priority":325733,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"2b1772724a7bed970632c82cb184c8d3","title":"Cricket-India overcome dropped catches to thump Nepal in Asia Cup","link":"https://www.thestar.com.my/sport/cricket/2023/09/05/cricket-india-overcome-dropped-catches-to-thump-nepal-in-asia-cup","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A. Read full story","content":"(Reuters) - India shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A. Chasing a revised target of 145 in 23 overs following a long rain interruption, India romped to a 10-wicket victory under the Duckworth-Lewis method as Skipper Rohit Sharma and fellow opener Shubman Gill got them across the line with 17 balls left. Rohit was not out on 74 after smashing six fours and five sixes, while Gill made an unbeaten 67. India had earlier let Nepal off the hook after opting to bowl as Shreyas Iyer dropped Kushal Bhurtel in the opening over and Virat Kohli made a mess of another chance in the next to hand Aasif Sheikh a lifeline. Bhurtel got another reprieve when wicketkeeper Ishan Kishan put down a simple catch off Mohammed Shami, but fell to Shardul Thakur for 38 while Sheikh scored 58 - his 10th half-century in one-day international cricket. But Ravindra Jadeja (3-40) tore through the middle-order and Mohammed Siraj (3-61) also got in on the act before rain briefly halted play at 178-6. Nepal then rode on Sompal Kami's 48 lower down the order to finish with 230 in 48.2 overs. More rain followed after India began their chase, prompting match officials to revise the target after a lengthy delay. India advance to the next stage of the tournament with three points after their meeting with Pakistan at the same stadium was washed out on Saturday. The south Asian neighbours, who only face off in multi-team tournaments due to soured political relations, are set to clash again in the next stage at the weekend. (Reporting by Shrivathsa Sridhar in Bengaluru; Editing by Nick Macfie)","pubDate":"2023-09-04 18:41:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/09/05/2267839.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"d530fe77afdb672873d93be12d4d771a","title":"India thump Nepal in Asia Cup despite dropped catches","link":"https://www.perthnow.com.au/sport/cricket/india-thump-nepal-in-asia-cup-despite-dropped-catches-c-11803867","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"India have cruised into the Asia Cup Super Four stage after thrashing Nepal by ten wickets in a rain-affected ODI in Sri Lanka.","content":"India have shaken off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele to join arch-rivals Pakistan in the Super Four stage from Group A. Chasing a revised target of 145 in 23 overs i Sri Lanka on Monday, following a long rain interruption, India romped to a 10-wicket victory under the Duckworth-Lewis method with 17 balls left. Skipper Rohit Sharma was not out on 74 (59 balls) after smashing six fours and five sixes, while fellow opener Shubman Gill made an unbeaten 67 off 62 balls. India had earlier let Nepal off the hook after opting to bowl as Shreyas Iyer dropped Kushal Bhurtel in the opening over and Virat Kohli made a mess of another chance in the next to hand Aasif Sheikh a lifeline. Bhurtel got another reprieve when wicketkeeper Ishan Kishan put down a simple catch off Mohammed Shami, but fell to Shardul Thakur for 38 while Sheikh scored 58 - his 10th half-century in one-day international cricket. But Ravindra Jadeja (3-40) tore through the middle-order and Mohammed Siraj (3-61) also got in on the act before rain briefly halted play at 6-178. Nepal then rode on Sompal Kami's 48 lower down the order to finish with 230 in 48.2 overs. More rain followed after India began their chase, prompting match officials to revise the target after a lengthy delay.","pubDate":"2023-09-04 18:36:55","image_url":"https://images.perthnow.com.au/publication/C-11803867/38021b160d91e59e88fd1031853b0311f89e246f-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"17ea109f9ee8fd8aea628dadbacf2157","title":"India overcome dropped catches to thump Nepal in Asia Cup","link":"https://www.straitstimes.com/sport/india-overcome-dropped-catches-to-thump-nepal-in-asia-cup","keywords":null,"creator":null,"video_url":null,"description":"September 05, 2023 2:32 AMIndia shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A.","content":"India shook off some sloppy fielding and fired with the bat to comprehensively beat Nepal in a rain-shortened Asia Cup match in Pallekele on Monday as they joined arch-rivals Pakistan in the Super Four stage from Group A. Chasing a revised target of 145 in 23 overs following a long rain interruption, India romped to a 10-wicket victory under the Duckworth-Lewis method as Skipper Rohit Sharma and fellow opener Shubman Gill got them across the line with 17 balls left. Rohit was not out on 74 after smashing six fours and five sixes, while Gill made an unbeaten 67. India had earlier let Nepal off the hook after opting to bowl as Shreyas Iyer dropped Kushal Bhurtel in the opening over and Virat Kohli made a mess of another chance in the next to hand Aasif Sheikh a lifeline. Bhurtel got another reprieve when wicketkeeper Ishan Kishan put down a simple catch off Mohammed Shami, but fell to Shardul Thakur for 38 while Sheikh scored 58 - his 10th half-century in one-day international cricket. But Ravindra Jadeja (3-40) tore through the middle-order and Mohammed Siraj (3-61) also got in on the act before rain briefly halted play at 178-6. Nepal then rode on Sompal Kami's 48 lower down the order to finish with 230 in 48.2 overs. More rain followed after India began their chase, prompting match officials to revise the target after a lengthy delay. India advance to the next stage of the tournament with three points after their meeting with Pakistan at the same stadium was washed out on Saturday. The south Asian neighbours, who only face off in multi-team tournaments due to soured political relations, are set to clash again in the next stage at the weekend. REUTERS","pubDate":"2023-09-04 18:32:19","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"1435524bad33d6caaec123707dd01ed2","title":"Asia Cup Super 4s – Pakistan-India match 'shifted to Hambantota'","link":"https://en.dailypakistan.com.pk/04-Sep-2023/asia-cup-super-4s-pakistan-india-match-shifted-to-hambantota","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"The second match of the Asia Cup Super 4s stage between Pakistan and India has been shifted to the Mahinda Rajapaksa International Cricket Stadium in Hambantota, Geo News quoted sources as saying.","content":"The second match of the Asia Cup Super 4s stage between Pakistan and India has been shifted to the Mahinda Rajapaksa International Cricket Stadium in Hambantota, Geo News quoted sources as saying. The match was scheduled to be played in Colombo but officials, who spoke on the condition of anonymity, said the September 10 match had been shifted to Hambantota due to the rain forecasts. Earlier today it was reported that after rain played a spoilsport during Pakistan vs India match on September 2 in Sri Lanka's Kandy city, the Asian Cricket Council (ACC) was deliberating about shifting the venue of matches owing to the unpredictable weather of Colombo. The development was communicated by the sources after Pakistan Cricket Board (PCB) Management Committee Chairman Zaka Ashraf contacted ACC President Jay Shah regarding the matter in order to save another match between the archrivals in Colombo from being impacted by the weather. Rain played spoilsport on Saturday, dampening the high hopes of fans to see a thriller between Pakistan and India in the much anticipated Asia Cup 2023 match. However, the Green Shirts qualified for the Super 4s — despite not having to bat as their run chase was called off due to persistent showers — after a successful day in the field. Sharing his concerns regarding the unpredictable climate of the tropical island, Ashraf told Shah about the likelihood of more rain in Sri Lanka as well as favourable weather in Pakistan for the tournament to continue without any hindrances. Meanwhile, the Board of Control for Cricket in India is reportedly not satisfied with the hotel provided to team India in Dambulla city. The BCCI has insisted that the hotels in Dambulla are not up to the standard, the sources said, adding that broadcasters, too, have objections to hotel arrangements in Hambantota, the Sri Lankan city where the weather is good. Despite the draw in the September 2 match, Pakistan have qualified for the Super 4s stage as they began their Asia Cup 2023 campaign on a high note with a massive 238-run win over Nepal on Wednesday. Meanwhile, this was India's first match in the tournament making the clash with Nepal a must-win. But considering the format of the Asia Cup it is likely that we may see another between the archrivals on September 10.","pubDate":"2023-09-04 18:29:40","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-09-04/pakistan-india-match-in-asia-cup-super-4s-shifted-to-1693850660-4988.jpg","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"2f0ef853b1ef919452a99e94e52c7c49","title":"IND vs NEP, Asia Cup 2023: India beat Nepal by 10 wickets to reach Super 4 stage, to face Pakistan on Sunday","link":"https://www.dnaindia.com/cricket/report-ind-vs-nep-asia-cup-2023-india-beat-nepal-by-10-wickets-to-reach-super-4-stage-to-face-pakistan-on-sunday-3058905","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Following a rain delay, India was tasked with chasing down 145 runs in 23 overs, a challenge that Sharma and Gill effortlessly conquered.","content":"Rohit Sharma and Shubman Gill showcased their batting prowess by smashing impressive half-centuries, leading India to a resounding 10-wicket victory (DLS method) over Nepal in a rain-affected Asia Cup 2023 clash held in Kandy. Following a rain delay, India was tasked with chasing down 145 runs in 23 overs, a challenge that Sharma and Gill effortlessly conquered. Nepal, after being invited to bat first, displayed commendable determination as they managed to post a competitive total of 230 runs before losing all their wickets. However, India's lackluster fielding performance compounded their woes, with numerous dropped catches allowing Nepal to capitalize on the missed opportunities. Nepal began their innings on a strong note, with openers Kushal Bhurtel and Aasif Sheikh forming a solid partnership of 65 runs for the first wicket. However, Shardul Thakur's dismissal of Bhurtel for a well-played 38 off 25 deliveries shifted the momentum in India's favor. Ravindra Jadeja then joined the fray, spearheading India's fightback with three crucial wickets. Mohammed Siraj also contributed significantly, claiming three wickets of his own. Aasif emerged as the standout batsman for Nepal, etching his name in history as the first player from his country to score a half-century against India. His composed knock of 58 off 97 deliveries finally came to an end in the 30th over, falling victim to Siraj's bowling prowess. Sompal Kami also showcased his intent by adding a valuable 48 runs off 56 balls to Nepal's total before being dismissed by Mohammad Shami in the 47th over. READ| Who is Aasif Sheikh? Nepal's first player to slam fifty against India in ODIs","pubDate":"2023-09-04 18:13:00","image_url":null,"source_id":"dnaindia","source_priority":18388,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7e1ef5ec269de8bf1b3a87215feae8b2","title":"Asia Cup 2023: নেপালকে দশ উইকেটে হারিয়ে সুপার ফোরে ভারত, ওপেনিং জুটিতে অবিচ্ছেদ্য ১৪৭ রান রোহিত-গিলের","link":"https://bangla.latestly.com/sports/team-india-beats-nepal-by-10-wickets-to-through-for-super-4-in-asia-cup-2023-241427.html","keywords":null,"creator":null,"video_url":null,"description":"নেপালকে অনায়াসে হারিয়ে এশিয়া কাপের সুপার ফোরে উঠল ভারত। দফায় দফায় বৃষ্টিতে বিঘ্নিত ম্যাচে নেপালকে ১০ উইকেটে হারাল টিম ইন্ডিয়া।","content":"ক্যান্ডি, ৪ সেপ্টেম্বর: নেপাল (Nepal)কে অনায়াসে হারিয়ে এশিয়া কাপের (Asia Cup Cricket 2023) সুপার ফোরে উঠল ভারত (Team India)। দফায় দফায় বৃষ্টিতে বিঘ্নিত ম্যাচে নেপালকে ১০ উইকেটে হারাল টিম ইন্ডিয়া। আন্তর্জাতিক ক্রিকেটে প্রথমবার সুপার পাওয়ার ভারতের বিরুদ্ধে খেলতে নেমে নেপালের ব্যাটাররা লড়াই করলেও, রোহিত শর্মাদের একটা উইকেটও তুলতে পারলেন না সে দেশের বোলাররা। রোহিত শর্মা ৫৯ বলে ৭৪ রানে, ও শুভমন গিল ৬২ বলে ৬৭ রানে অপরাজিত থাকলেন। ১৭ বল বাকি থাকতে জয়ের জন্য প্রয়োজনীয় রান তুলে নেয় টিম ইন্ডিয়া। নেপাল প্রথমে ব্যাট করে নির্ধারিত ৫০ ওভারে করেছিল ২৩০ রান। এরপর ভারতের ইনিংসের শুরুতে দীর্ঘক্ষণ বৃষ্টি চলায় ম্যাচের ওভার সংখ্যা কমে যায়। ডার্ক ওয়ার্থ লুইস পদ্ধতিতে ভারতকে জিততে হলে ২৩ ওভারে করত হত ১৪৩ রান। নেপালের অনভিজ্ঞ বোলারদের কোনওরকম পাত্তা না দিয়ে টিম ইন্ডিয়ার দুই ওপেনার অধিনায়ক রোহিত শর্মা ও শুভমন গিলকে অনায়াসে দলকে জিতিয়ে আনেন। ওপেনিং জুটিতে ১২১ বলে অবিচ্ছেদ্য ১৪৭ রান করলেন রোহিত-গিল। সুপার ফোর রাউন্ড ভারত এবার খেলবে পাকিস্তানের (১০ সেপ্টেম্বর), বাংলাদেশ (১২ সেপ্টেম্বর), এবং শ্রীলঙ্কা/আফগানিস্তান (১৫ সেপ্টেম্বর)-এর বিরুদ্ধে । আরও পড়ুন-কাল দুপুর দেড়টায় বিশ্বকাপের দল ঘোষণা, মূল জল্পনা যাকে নিয়ে দেখুন টুইট INDIA vs PAKISTAN ON SEPTEMBER 10th. - Time for Round 2 in Asia cup. pic.twitter.com/RPOfGAptDA — Johns. (@CricCrazyJohns) September 4, 2023 হারলেও নেপালের ব্যাটারদের লড়াই বেশ দাগ কাটল। চলতি এশিয়া কাপের প্রথম ম্যাচে পাকিস্তানের ৩৪২ রানের জবাবে নেপাল মাত্র ১০৪ রানে অল আউট হয়ে যায়। সেই তুলনায় টিম ইন্ডিয়ার বিরুদ্ধে বেশ ভাল লড়লেন নেপালের ব্যাটাররা। নেট রান রেটে পাকিস্তানের থেকে পিছিয়ে পড়ে দ্বিতীয় হয়ে সুপার ফোরে উঠল টিম ইন্ডিয়া। নেপালের বিরুদ্ধে পাকিস্তান জেতে ২৩৮ রানে, আর ভারত জিতল ১০ উইকেট। ভারত-পাকিস্তান ম্য়াচ বৃষ্টিতে ভেস্তে যায়। সমসংখ্যাক পয়েন্ট থাকলেও নেট রান রেট তাই পাকিস্তানের দাঁড়ায় ৪.৭৬০, আর টিম ইন্ডিয়ার সেখানে ১.০২৮।","pubDate":"2023-09-04 18:04:34","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"7f9de2dab85ec021ba425fb7560488f9","title":"IND Vs NEP, Match Highlights: রোহিত, শুভমনের দুরন্ত অর্ধশতরান, নেপালকে হারিয়ে এশিয়া কাপের সুপার ফোরে ভারত","link":"https://bengali.abplive.com/sports/cricket/asia-cup-2023-india-won-by-10-wickets-against-nepal-match-5-full-match-highlights-pallekele-stadium-1006517","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"ক্যান্ডি: বৃষ্টিবিঘ্নিত ম্যাচে নেপালের বিরুদ্ধে (IND vs NEP) জয়ের জন্য ভারতীয় দলকে ১৪৩ রান তাড়া করতে হত। ওপেনারদের দাপটেই নেপালকে ১০ উইকেটে হারিয়ে দিল ভারত। শুভমন গিল (Shubman Gill) ও রোহিত শর্মা (Rohit Sharma) উভয়েই অর্ধশতরান হাঁকান। ১৭ বল বাকি থাকতেই জয় সুনিশ্চিত করে ভারত। রোহিত ৭৪ ও শুভমন ৬৭ রানে অপরাজিত থাকেন। এই জয়ের সুবাদেই এশিয়া কাপের (Asia Cup 2023) সুপার ফোরে নিজেদের জায়গা পাকা করে নিল ভারত।  ম্যাচে বল হাতে যেমন ভারতীয় দলের শুরুটা ভাল হয়নি, ব্যাট হাতেও তেমনটা টিম ইন্ডিয়া, বিশেষত অধিনায়ক রোহিত শুরুটা নড়বড়ে করেছিলেন। প্রথম ওভারেই একাধিকবার তাঁর বিরুদ্ধে আউটের আপিল উঠে। তবে সেই চাপ সামলে নেন। ভারতীয় ইনিংসে ১৩ বল হতে না হতেই বৃষ্টির আগমন ঘটে। এই বৃষ্টির জেরেই ভারতের লক্ষ্য ২৩১ রান থেকে কমে ১৪৩ রান দাঁড়ায়। ৫০ ওভারের ম্যাচ দাঁড়ায় ২৩ ওভারের ম্যাচে। বৃষ্টির সঙ্গে সঙ্গে থামলে ভারতীয় দল ব্যাটে নামলে দুরন্ত ছন্দে দেখায় দুই ওপেনারকেই। রোহিত ও শুভমন একের পর এক বল বাউন্ডারির বাইরে পাঠান। ৭.৫ ওভারেই ৫০ রানের গণ্ডি পার করে ফেলে টিম ইন্ডিয়া। রোহিত পাঁচটি চার ও তিনটি ছক্কার সুবাদে মাত্র ৩৯ বলে নিজের অর্ধশতরান পূরণ করেন। গিল ৫০ রানের গণ্ডি পার করতে নেন ৪৭ বল। ১৩.৪ ওভারে ১০০ রান করে ভারত। শতরানের গণ্ডি পার করার পর খানিকটা মন্থর গতিতেই ব্যাটিং করে নির্ধারিত লক্ষ্যে পৌঁছে যায় ভারত। চার মেরে দলের জয় সুনিশ্চিত করেন গিল। ৭৪ রানের ইনিংসের জন্য অধিনায়ক রোহিতকেই ম্যাচের সেরা ঘোষণা করা হয়। ভারতীয় দল এরপর রবিবার, ১০ সেপ্টেম্বর পাকিস্তানের বিরুদ্ধে সুপার ফোরে নিজেদের প্রথম ম্যাচে খেলতে নামবে। সদ্য বাবা হওয়া যশপ্রীত বুমরা এই ম্যাচে না খেললেও, পাকিস্তানের বিরুদ্ধে ম্যাচের আগে দলে ফিরবেন বলেই বিসিসিআই সূত্রে খবর। চোট সারিয়ে কেএল রাহুলও সুপার ফোরের সেই ম্যাচে ভারতীয় একাদশের অংশ হতে পারেন। চিরপ্রতিদ্বন্দ্বীদের গত ম্য়াচ ভেস্তে গিয়েছিল। এবার পরের ম্যাচে কী হয়, সেটাই দেখার বিষয়। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: অপেক্ষার অবসান, মঙ্গলবারই আয়োজিত হবে ভারতের বিশ্বকাপ দল","content":"ক্যান্ডি: বৃষ্টিবিঘ্নিত ম্যাচে নেপালের বিরুদ্ধে (IND vs NEP) জয়ের জন্য ভারতীয় দল কে ১৪৩ রান তাড়া করতে হত। ওপেনারদের দাপটেই নেপালকে ১০ উইকেটে হারিয়ে দিল ভারত। শুভমন গিল (Shubman Gill) ও রোহিত শর্মা (Rohit Sharma) উভয়েই অর্ধশতরান হাঁকান। ১৭ বল বাকি থাকতেই জয় সুনিশ্চিত করে ভারত। রোহিত ৭৪ ও শুভমন ৬৭ রানে অপরাজিত থাকেন। এই জয়ের সুবাদেই এশিয়া কাপ ের (Asia Cup 2023) সুপার ফোরে নিজেদের জায়গা পাকা করে নিল ভারত। ম্যাচে বল হাতে যেমন ভারতীয় দলের শুরুটা ভাল হয়নি, ব্যাট হাতেও তেমনটা টিম ইন্ডিয়া, বিশেষত অধিনায়ক রোহিত শুরুটা নড়বড়ে করেছিলেন। প্রথম ওভারেই একাধিকবার তাঁর বিরুদ্ধে আউটের আপিল উঠে। তবে সেই চাপ সামলে নেন। ভারতীয় ইনিংসে ১৩ বল হতে না হতেই বৃষ্টির আগমন ঘটে। এই বৃষ্টির জেরেই ভারতের লক্ষ্য ২৩১ রান থেকে কমে ১৪৩ রান দাঁড়ায়। ৫০ ওভারের ম্যাচ দাঁড়ায় ২৩ ওভারের ম্যাচে। বৃষ্টির সঙ্গে সঙ্গে থামলে ভারতীয় দল ব্যাটে নামলে দুরন্ত ছন্দে দেখায় দুই ওপেনারকেই। রোহিত ও শুভমন একের পর এক বল বাউন্ডারির বাইরে পাঠান। ৭.৫ ওভারেই ৫০ রানের গণ্ডি পার করে ফেলে টিম ইন্ডিয়া। রোহিত পাঁচটি চার ও তিনটি ছক্কার সুবাদে মাত্র ৩৯ বলে নিজের অর্ধশতরান পূরণ করেন। গিল ৫০ রানের গণ্ডি পার করতে নেন ৪৭ বল। ১৩.৪ ওভারে ১০০ রান করে ভারত। শতরানের গণ্ডি পার করার পর খানিকটা মন্থর গতিতেই ব্যাটিং করে নির্ধারিত লক্ষ্যে পৌঁছে যায় ভারত। চার মেরে দলের জয় সুনিশ্চিত করেন গিল। ৭৪ রানের ইনিংসের জন্য অধিনায়ক রোহিতকেই ম্যাচের সেরা ঘোষণা করা হয়। ভারতীয় দল এরপর রবিবার, ১০ সেপ্টেম্বর পাকিস্তানের বিরুদ্ধে সুপার ফোরে নিজেদের প্রথম ম্যাচে খেলতে নামবে। সদ্য বাবা হওয়া যশপ্রীত বুমরা এই ম্যাচে না খেললেও, পাকিস্তানের বিরুদ্ধে ম্যাচের আগে দলে ফিরবেন বলেই বিসিসিআই সূত্রে খবর। চোট সারিয়ে কেএল রাহুলও সুপার ফোরের সেই ম্যাচে ভারতীয় একাদশের অংশ হতে পারেন। চিরপ্রতিদ্বন্দ্বীদের গত ম্য়াচ ভেস্তে গিয়েছিল। এবার পরের ম্যাচে কী হয়, সেটাই দেখার বিষয়। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: অপেক্ষার অবসান, মঙ্গলবারই আয়োজিত হবে ভারতের বিশ্বকাপ দল var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-04 18:04:05","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/04/5f19eadcf111096df351090b9a9108161693850262337507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"}]}