{"newsArray":[{"title":"Cricket’s big test? Getting Australians to care about the game","link":"https://www.brisbanetimes.com.au/sport/cricket/cricket-s-big-test-getting-australians-to-care-about-the-game-20221021-p5brod.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Knox"],"video_url":null,"description":"A World Cup is being staged on Australian soil, and so far it has travelled under an assumed name, sneaking through airports without detection.","content":null,"pubDate":"2022-10-21 00:45:00","image_url":null,"source_id":"brisbanetimes","country":["australia"],"category":["sports"],"language":"english"},{"title":"Adam Gilchrist recounts absolutely brutal Waugh brothers sledge","link":"https://www.foxsports.com.au/cricket/australia/adam-gilchrist-recounts-absolutely-brutal-waugh-brothers-sledge/news-story/1887ffe54b19a1b1bfedc748c939a44f","keywords":null,"creator":null,"video_url":null,"description":"Australian sporting icon Adam Gilchrist has revealed the greatest sledge he encountered on the cricket field, which was directed at the brother of his former teammates, Steve and Mark Waugh.","content":null,"pubDate":"2022-10-21 00:14:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Alex Hales vows to give it a Bash during the T20 World Cup","link":"https://metro.co.uk/2022/10/21/alex-hales-confident-past-successes-will-help-him-enjoy-t20-world-cup-17605641/","keywords":["Cricket","Cricket World Cup","England cricket","Metro newspaper"],"creator":["Dave Filmer"],"video_url":null,"description":"'I will play with a smile and hopefully perform as well.’","content":"The success of Hales in the Big Bash is key to his place in England’s World Cup team (Picture: Getty Images) Alex Hales is confident his past success in Australia will help him enjoy the T20 World Cup and make the most of an England chance he never expected to come. His Big Bash League record was a key factor in him being selected ahead of Phil Salt to open the batting alongside Jos Buttler. Hales has amassed 1,857 runs at an average of 33.16 in the competition but it is his strike-rate that truly sets him apart. No one with 1,000 runs or more has a strike-rate better than Hales’ 151.34 for several teams. The 33-year-old hit the ground running in Australia following his recent international recall with 84 off 51 balls in Perth, where England begin their World Cup campaign against Afghanistan tomorrow. While he has had three single-figure scores since, the Nottinghamshire man thinks his history Down Under acts as a safety blanket. ‘It is just nice knowing I have proved myself in these conditions,’ he said. ‘I know if things don’t happen for me straight away I have the game and record to bounce back at any point in the tournament. Sussex bowler Tymal Mills has been moved up to the full squad (Picture: Getty Images) ‘My biggest thing is I just want to enjoy it. It is a chance I didn’t think I would get again. I will play with a smile and hopefully perform as well.’ Hales was referring to his three years in the international wilderness, which ended last month, having been discarded in 2019 on the eve of the 50-over World Cup after failing a second recreational drugs test, with Eoin Morgan’s England side going on to win the tournament. Now led by Buttler, England are bidding to hold both global white-ball trophies but suffered a blow this week with the loss of Reece Topley to a tournament-ending ankle injury. The left-arm seamer has emerged as a key figure for England this year and Hales was full of sympathy for the 6ft 7in bowler. ‘It is very tough,’ he told the BBC. ‘As athletes, dealing with injuries around huge tournaments is a very bitter pill to swallow. I have been there, slightly different circumstances, he will be disappointed but no doubt will bounce back.’ Sussex bowler Tymal Mills has been promoted from travelling reserve to the full squad and Hales said of the paceman: ‘He is an excellent T20 operator. ‘He has very good skills – a very skilful and deceiving slower ball – and can bowl 90mph-plus. He is a huge asset to have in our side.’ Archer targets November comeback Jofra Archer looks set to make a comeback (Picture: Getty Images) Jofra Archer could be back bowling in an England shirt next month, with the possibility of playing some part in an internal Test-match warm-up in Abu Dhabi. Sussex star Archer has not played international cricket for 18 months, suffering with a longstanding elbow injury followed by a stress fracture of the back. But the 27-year-old is making good progress with his rehabilitation and will travel to the UAE in November to continue his training and recovery with the Lions squad alongside fellow seamers Brydon Carse and Saqib Mahmood. ECB performance director Mo Bobat said: ‘He’ll be playing a meaningful part in all our practice and let’s hope he can play some sort of part in the game at the back end of the trip. We’ll have to see where that lands and where he gets to. MORE : England bowler Reece Topley ruled out of T20 World Cup MORE : Kevin Pietersen backs England to win T20 World Cup but rates South Africa as ‘dark horses’ For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2022-10-20 23:01:00","image_url":null,"source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: \"Before him, fitness culture probably wasn't as strong as it is today\" - Ricky Ponting on Virat Kohli's contribution to Indian cricket","link":"https://www.sportskeeda.com/cricket-news/news-t20-world-cup-2022-before-him-fitness-culture-probably-strong-today-ricky-ponting-virat-kohli-s-contribution-indian-cricket?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket News"],"creator":["Aditya Suketu Desai"],"video_url":null,"description":null,"content":null,"pubDate":"2022-10-20 22:58:20","image_url":"https://static.sportskeeda.com/editor/2022/10/52014-16662884333569-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Elephant in room of Australia’s World Cup defence... and the forgotten truth we can’t ignore","link":"https://www.foxsports.com.au/cricket/australia/t20-world-cup-2022-cricket-australia-vs-new-zealand-news-preview-justin-langer-forgotten-in-title-defence/news-story/b9b3922c42d08de4fb121b3b392c85ab","keywords":null,"creator":null,"video_url":null,"description":"The Australian cricket team converged in Sydney this week to put the finishing touches on plans to defend its T20 World Cup crown.","content":"The Australian cricket team converged in Sydney this week to put the finishing touches on plans to defend its T20 World Cup crown. Given the short, 11-month turnaround from when the trophy was won in Dubai, there are many familiar faces, and very few new ones. Tim David is the only addition to the playing squad, while the coaching staff has undergone little change, too, with coach Andrew McDonald an assistant last time around. Catch the T20 World Cup Live on Kayo. Don’t Risk Missing All Your Teams’ Matches. New to Kayo? Start your free trial now > Most of last year’s T20 World Champions will defend their title, with one major exception. Source: Getty Images Being given the chance to defend the T20 World Cup on home soil, having been the first Australian men’s group to ever win it, is just reward for the tight-knit group. Spare a thought for the odd man out, however — the one who oversaw it all but was brutally pushed aside just months later. No, not Mitchell Swepson – the only player from Australia’s 2021 World Cup squad to miss out this time around – but Justin Langer. He’s the only major absentee from that history-making group who were crowned champions amid that Dubai delirium. Strange to think that it’s been less than nine months since the former Australia coach decided to walk having been offered only a six-month contract extension. Stranger still to think that despite his big personality and major influence on Australian cricket for nearly four years, his shadow does not loom large over this playing group. The team has seemingly moved on. READ MORE ‘Thought it was a gimmick’: How cricket’s big joke morphed into shock 20-year revolution Kohli snubbed as Aussies dominate in our predicted team of the T20 World Cup How ‘hated’ star finally won over Australia.. and why it could solve 10-year cricket riddle Justin Langer is the only major absentee from Australia’s T20 World Cup defence. Source: Getty Images That is partly owed to a hectic 2022 schedule in which Australia has played series in Pakistan, Sri Lanka and India, and hosted Zimbabwe, New Zealand, West Indies and England. As such, those nine months might feel like nine years for some. But it’s mainly due to the contentment from the players, who are chuffed with the team environment that’s been developed over the past 12 months. The Australian cricket team has seldom been a happier place — but that is by no means a suggestion that it was Langer’s departure that created the joy. Foxsports.com.au spoke to several senior players before the start of the summer and asked if the team was relaxed and happy now that Langer had departed. The near-unanimous consensus among players was that they were already happy after Langer took on their feedback about his management. It arguably makes Cricket Australia’s decision to push Langer aside seem all the more harsh. “The team’s happy with where they’re at. I think the guys, they were happy anyway when JL was there,” Warner told foxsports.com.au . “It was just what unfolded was way above our heads. Obviously (it was) the board and JL’s management.” Mitchell Starc is of the same opinion, pinpointing last year’s World Cup — nearly four months and 12 matches before Langer’s departure — as the time that the Australian cricket team rediscovered the joy. “I don’t think much in the group has changed since the (last) World Cup,” he said. “Obviously personnel has changed but I think the feeling among the group probably started prior to the World Cup and then obviously throughout the World cup and the Ashes it just continued. “In terms of the vibe and training, it’s been a very enjoyable place and a very close group among formats for six to nine months I guess. I don’t think too much has changed. It’s very relaxed.” David Warner says Australia was already happy before Langer’s departure. Source: Getty Images Meanwhile, Marcus Stoinis went as far to say that the group has never had as much fun playing cricket as they did under a reformed Langer in the UAE last year. “I think to be fair to JL, even at the end of his tenure as the coach, he did implement a lot of changes and the mood in the camp did change a lot through his journey,” Stoinis said. “We had a super successful World Cup campaign where we all had, if you speak to the boys, arguably the most fun we’ve ever had paying cricket. It was great. “Since then it’s just sort of carried on. So there hasn’t been a massive change (since JL left), it’s more the fact that that change that probably happened about then has carried on.” He added: “Winning a big tournament like that I think settles a lot of nerves in the whole room, whether it’s the dressing room or the coaching staff or whether it’s the CA board, I think it settles a lot of things. “That’s been a noticeable carry-on since that World Cup and I think, probably, in the Test team as well, although I’m not around.” ‘ROBUST’ TALKS THAT ENDED LANGER’S REIGN The turning point the players spoke of came after an awkward chapter in mid-2021, when there was an uprising against Langer, whose micromanagement and mood swings were said to have grated on the playing group. The tension reached its peak during tours of the Caribbean and Bangladesh, with the tipping point being Langer’s reported ugly, public confrontation with a Cricket Australia digital staffer. Some players had had enough — and Cricket Australia listened, leading to a crisis meeting between senior figures and Langer. Captains Paine and Aaron Finch, then vice-captain Pat Cummins, Cricket Australia chief Nick Hockley and chair Earl Eddings met for the talks that Paine described as “robust”. There was an uprising against Langer in mid-2021, when Tim Paine led crisis talks with the coach. Source: Getty Images The outcome was that Langer maintained the full support of CA until the end of the 2021-22 Ashes, but he was to take a backwards step and delegate more readily. Langer took the brutal feedback on the chin. It’s widely accepted that he made the changes he was asked of, and the winning results started to flow. The Australian great might’ve been a flawed coach in some of the modern ways, but by traditional metrics — such as winning games of cricket — he was exceptional. In Western Australia, he won three Big Bash League titles with the Perth Scorchers and another One-Day Cup with the state side. After being promoted to the national team in 2018, he became the first Australia coach to retain the Ashes urn in England since 2001. In his final summer, he led Australia to its first men’s T20 World Cup title, and defended the Ashes again 4-0. Yet it still wasn’t enough. It became clear that the end-sequence for Langer’s reign had been irreversibly triggered, and results were going to matter little as his contract winded down. His exit in February caused a mini civil war within Australian cricket that pitted some legends, and friends of Langer, against parts of the current playing group. Aussies collapse in final over! | 01:00 The late great Shane Warne took aim at the “NSW mafia”, claiming that the likes of Cummins and his Blues teammates wanted Langer gone. Langer’s long-time opening partner Matthew Hayden was furious, labelling rebel players as “downright disrespectful” and “facetious”. The narrative began to swing against some of the current playing group, who were being painted as the villains of the piece. But Warner was eager to set the record straight, saying that Paine was a driving force for the changes that were thrust upon Langer, while current Test and ODI captain Cummins was “thrown in the deep end”. “Obviously there was a lot of media attention around all that which was unfortunate,” Warner said. “But that all happened under Painey before Cummo. “So Cummo sort of got thrown in the deep end because Painey was in charge of all that, of all those reviews and stuff. So it was a weird one.” Warner said new Test and ODI captain Pat Cummins was “thrown in the deep end”. Source: Getty Images ‘WE RUN OUR OWN VIBE’ Players might’ve been happy with how things shook out after Langer took a backwards step, but it’s unlikely Paine drove a one-man campaign against the coach. It should be said that two white ball players for Australia chose not to comment when asked by foxsports.com.au about changes in the post-Langer era. Furthermore, Paine was not in that meeting alone, but was also with Cummins and Finch, who still hold captaincy positions. How pleased the players are about Langer’s departure may never be clear. What is, however, is that they happy now and have a team environment they’ve always wanted. “We kind of run our own vibe,” Adam Zampa said. “And we’re all so experienced now that the personnel change, bringing Ronnie (McDonald) in, he’s been with the squad anyway for quite a while now. It’s not like it’s alien to us, nothing major has changed.” Meiyappan MAGIC in first T20 HAT-TRICK! | 01:06 He added: “Just the players are in a good space in terms of knowing what we want out of a coach, how we want our changeroom to feel.” Warner gave further insight into that new changeroom philosophy, revealing the great amount of freedom and trust that is now given to players. “One of our little words that we always say is ‘you own your own space’,” Warner said. “No one questions the way that you prepare or anything like that. For us, everyone’s so aware of all that and everything’s just free flowing. “When it comes down to playing a game, we play it to the best of our ability all the time. There’s no second-guessing our method. “We have our method and that’s what’s going to work, and it’s what has worked for you so stick with it.”","pubDate":"2022-10-20 18:53:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"The radical training techniques behind Aussie revelation","link":"https://www.themercury.com.au/sport/t20-world-cup-australia-hit-with-horror-travel-schedule-compared-to-rivals/news-story/25d6d61eacd417dfb67a868929ec7fbd","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Tim David has been tipped to become the game’s greatest master blaster after bringing golf training techniques into cricket.","content":"Born in Singapore, Australia’s newest superstar is an international man of mystery who after being snubbed by the conventional system, has reinvented the wheel by deliberately dedicating himself to perfecting a niche role in Twenty20 cricket no one else in the country had been able to do.It can be revealed David’s cyclonic batting style started when he downloaded a golf training program at home, and his unique confidence to continue doing it his way has led one of Australia’s greatest ever white ball cricketers, Shane Watson, to declare the ‘Singapore Slugger’ a generational phenomenon.“In the most recent IPL when he played for the Mumbai Indians, he played two games against the Delhi Capitals who I was coaching and some of the shots he hit from ball one, I haven’t seen too many people ever do that,” Watson told News Corp.“He’s as good as I’ve ever seen.“There’s only a couple of people in the world of T20 cricket who have been able to come in and dominate at the back end of an innings – Andre Russell is one in particular – but Tim David is more technically correct than Russell.“His conventional cricket shots go miles and that’s the reason why against all types of bowling I believe he’s going to be consistent, which is the hardest thing to do when you’re a power hitter.“What he has done is something very special. We are very fortunate to have him here in Australia.”David’s unique journey in breaking the mould peaked earlier this year when he actually turned down a debut selection for Australia – unheard of in past generations.But the 26-year-old has had the self-belief and the courage to navigate his own path and isn’t bothered by the fact many Australians will still tune in for Saturday night’s sold out opener against New Zealand asking, ‘Tim who?’“I hadn’t thought about that much to be honest,” David told News Corp.“I’m not that bothered about what the perception is, I’m just happy to do my role in the team. I’ve been made to feel really welcome by everyone in the squad so I couldn’t really ask for much more.Tim David“I’m very excited. We feel really well prepared … we’re ready to go.”David’s low profile isn’t entirely accidental. He turns down a lot of interviews and stays away from social media.Averaging almost 40 at a strike rate of 160, David doesn’t fail often considering the high risk career he leads, but when he does, he reminds himself that if you want to see the rainbow, you’ve got to see some rain.“He’s accepted there will be days that don’t work. But the days that do work are quite spectacular and it’s a genuinely match winning role,” said David’s personal cricket coach, Jim Allenby.“It’s such a fickle sport anyway but his role is extremely fickle. And him having the emotional intelligence to understand it … and sometimes our messages after a game when he’s got one of three balls and skied one is an emoji of a rainbow and rain. He gets over stuff real quick.”Australian legend Ricky Ponting has likened David’s arrival in the T20 side to when the late and great Andrew Symonds burst onto the scene at the 2003 ODI World Cup, and has declared David can deliver his country back-to-back title glory.Allenby – cousin of golfing great Robert Allenby – has opened up about caddying for an unassuming and largely anonymous figure to mainstream Australian fans, who has somehow changed the game with his ability to cannon sixes from ball one.“When he came out of the Australian system (having never played a Sheffield Shield game) it was a pretty natural thing to do to focus his game on T20 skills,” said Allenby.“It became really obvious the role he was going to target because no one was doing it really, really well, consistently in Australian cricket. He was quite clever.“It frustrates me at times when people think hitting is just about clearing your front leg and swinging as hard as you can because there is so much more to it than that.“I liken it to bowling at 150km/h. You need to have a lot of natural attributes, but you also have to have a very sound technique to be able to repeat that.”9000KM IN 13 DAYS: AUSTRALIA’S HORROR WORLD CUP SCHEDULE-Callum DickDespite hosting the T20 World Cup, Australia has been handed the worst travel schedule of all 12 teams competing in the group stages, with the reigning champions set to compile almost 9000km through the air over the next fortnight. Aaron Finch told reporters last week some players within the Australian camp were battling fatigue on the eve of their World Cup title defence and the team would enjoy “a couple of off-days” before the opener against New Zealand this Saturday to “allow guys to get away and recharge”. And an analysis of the group stage fixtures suggests Australia is right to be cautious in its pre-tournament managing of players, with the hosts due to fly 8997km to play their five pool games over a 13-day span.That figure is in stark contrast to some of its key title challengers, most notably Saturday’s opponents New Zealand, who will travel just 3784km over the same period. In fact, Australia will travel more than 1000km further than any other team featuring in its pool.The Group A qualification winner – one of Namibia, Sri Lanka, UAE or the Netherlands – will travel 7807km, while Afghanistan and England total 5706km and 4836km respectively. The major factor is of course the cross-country trips to play in Perth – something New Zealand will avoid doing entirely, with the knockout stages based on the east coast. The Kiwis also play four of their five group games in the east, while England gets an extra day’s rest over its five-game schedule compared to the rest of its pool. England, Afghanistan and the Group B runner-up will all play back-to-back games in Melbourne, limiting their travel requirements.In the other pool, Bangladesh doubles up in Adelaide while Pakistan will play consecutive games in Perth. Australia’s gruelling group stage schedule comes off the back of a jam packed pre-tournament lead-in which included a three-match series in India, before warm-up games against the West Indies and India in Queensland, book-ending a three-game series against England in Perth and Canberra. A number of key players including Pat Cummins, Josh Hazlewood and Mitch Starc did not fly to Perth to face England, with Australia rotating its playing squad heavily during the pre-tournament schedule. Finch cautioned against pessimism after Australia’s winless run of form against England and India, claiming the team’s only interest was to reach its peak playing potential during the World Cup. Some have questioned Australia’s mix-and-match team selection during the pre-tournament process however given the gruelling travel schedule to come, particularly when compared to some of its key title rivals, it could turn out to be the correct call. TEAM TRAVEL SCHEDULES AUSTRALIA (Group 1)Sat Oct 22 v New Zealand (Sydney, SCG) Tue Oct 25 v Group A winner (Perth, Perth Stadium )Fri Oct 28 v England (Melbourne, MCG)Mon Oct 31 v Group B Runner-Up (Brisbane, Gabba)Fri Nov 4 v Afghanistan (Adelaide, Adelaide Oval) TOTAL: 8997km in 13 daysGROUP B WINNER(Group 2)Mon Oct 24 v South Africa (Hobart, Bellerive Oval) Thu Oct 27 v Pakistan (Perth, Perth Stadium) Sun Oct 30 v Bangladesh (Brisbane, Gabba) Wed Nov 2 v Group A Runner-up (Adelaide, Adelaide Oval) Sat Nov 6 v India (Melbourne, MCG) TOTAL: 8898km in 13 daysSOUTH AFRICA (Group 2)Mon Oct 24 v Group B Winner (Hobart, Bellerive Oval) Thu Oct 27 v Bangladesh (Sydney, SCG)Sun Oct 30 v India (Perth, Perth Stadum)Thu Nov 3 v Pakistan (Sydney, SCG)Sun Nov 6 v Group A Runner-up (Adelaide, Adelaide Oval) TOTAL: 8772km in 13 daysGROUP A WINNER (Group 1)Sun Oct 23 v Group B Runner-up (Hobart, Bellerive Oval)Tues Oct 25 v Australia (Perth, Perth Stadium) Sat Oct 29 v New Zealand (Sydney, SCG) Tues Nov 1 v Afghanistan (Brisbane, Gabba) Sat Nov 5 v England (Sydney, SCG) TOTAL: 7807km in 13 daysPAKISTAN (Group 2)Sun Oct 23 v India (Melbourne, MCG)Thu Oct 27 v Group B Winner (Perth, Perth Stadium)Sun Oct 30 v Group A Runner-up (Perth, Perth Stadium) Thu Nov 3 v Pakistan (Sydney, SCG)Sun Nov 6 v Bangladesh (Adelaide, Adelaide Oval) TOTAL: 7157km in 14 daysINDIA (Group 2)Sun Oct 23 v Pakistan (Melbourne, MCG)Thu Oct 27 v Group A Runner-up (Sydney, SCG)Sun Oct 30 v South Africa (Perth, Perth Stadium) Wed Nov 2 v Bangladesh (Adelaide, Adelaide Oval) Sun Nov 6 v Group B Winner (Melbourne, MCG) TOTAL: 6752km in 14 daysGROUP A RUNNER-UP (Group 2)Mon Oct 24 v Bangladesh (Hobart, Bellerive Oval) Thu Oct 27 v India (Sydney, SCG)Sun Oct 30 v Pakistan (Perth, Perth Stadim) Wed Nov 2 v Group B Winner (Adelaide, Adelaide Oval)Sun Nov 6 v South Africa (Adelaide, Adelaide Oval) TOTAL: 6441km in 13 daysAFGHANISTAN(Group 1)Sat Oct 22 v England (Perth, Perth Stadium)Wed Oct 26 v New Zealand (Melbourne, MCG)Fri Oct 28 v Group B Runner-up (Melbourne, MCG)Tue Nov 1 v Group A Winner (Brisbane, Gabba)Fri Nov 4 v Australia (Adelaide, Adelaide Oval) TOTAL: 5706km in 13 daysENGLAND (Group 1)Sat Oct 22 v Afghanistan (Perth, Perth Stadium)Wed Oct 26 v Group B Runner-up (Melbourne, MCG)Fri Oct 28 v Australia (Melbourne, MCG)Tue Nov 1 v New Zealand (Brisbane, Gabba) Sat Nov 5 v Group A Winner (Sydney, SCG)TOTAL: 4836km in 14 daysNEW ZEALAND (Group 1)Sat Oct 22 v Australia (Sydney, SCG)Wed Oct 26 v Afghanistan (Melbourne, MCG) Sat Oct 29 v Group A Winner (Sydney, SCG) Tue Nov 1 v England (Brisbane, Gabba)Fri Nov 4 v Group B Runner-up (Adelaide, Adelaide Oval)TOTAL: 3784km in 13 daysGROUP B RUNNER-UP (Group 1)Sun Oct 23 v Group A Winner (Hobart, Bellerive Oval)Wed Oct 26 v England (Melbourne, MCG) Fri Oct 28 v Afghanistan (Melbourne, MCG) Mon Oct 31 v Australia (Brisbane, Gabba) Fri Nov 4 v New Zealand (Adelaide, Adelaide Oval) TOTAL: 3617km in 12 daysBANGLADESH (Group 2)Mon Oct 24 v Group A Runner-up (Hobart, Bellerive Oval) Thu Oct 27 v South Africa (Sydney, SCG) Sun Oct 30 v Group B Winner (Brisbane, Gabba) Wed Nov 2 v India (Adelaide, Adelaide Oval) Sun Nov 6 v Pakistan (Adelaide, Adelaide Oval) TOTAL: 3409km in 13 days","pubDate":"2022-10-20 18:51:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"“They’re becoming more rounded players”: Ricky Ponting credits IPL for Indian players’ access to quality coaches from around the world","link":"https://thesportsrush.com/cricket-news-theyre-becoming-more-rounded-players-ricky-ponting-credits-ipl-for-indian-players-access-to-quality-coaches-from-around-the-world/","keywords":["Cricket","Indian Premier League","IPL","Ricky Ponting"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ricky Ponting credits IPL for the overall development of Indian Cricketers, who have access to coaches from across cultures and conditions. The success of the Indian Premier League (IPL), which will host its 16th season next year, is there for the entire cricketing fraternity to see. Indian players in particular, have not only experienced growth… The post “They’re becoming more rounded players”: Ricky Ponting credits IPL for Indian players’ access to quality coaches from around the world appeared first on The SportsRush.","content":"The success of the Indian Premier League (IPL), which will host its 16th season next year, is there for the entire cricketing fraternity to see. Indian players in particular, have not only experienced growth financially, but also in terms of their skill-set, so much so that a host of players have been able to make their successful careers in international Cricket owing to impressive performances in the league itself. The biggest beneficiaries of this cash-rich league have been the young domestic Indian players, who get to rub their shoulders alongside some of the top international players for around a couple of months each year. Moreover, their access to world class coaches, which include legendary Cricketers from the past as well, and other top-class coaching staff members from around the world including strength and conditioning coaches, or even nutritionists have acted as a boon for the upcoming generation of talented cricketers. Legendary Australian skipper and also the present head coach of the IPL franchise Delhi Capitals, Ricky Ponting, believes that tournaments like the IPL, have brought in the different Cricketing cultures from around the world at a commonplace, and this crossover of cultures have benefited the players no end. During an interaction with the on the evolution of the game, Ponting further opined that coaches from around the world bring in the coaching methodology specific to their country, which largely benefits players travelling around the world. Coaches in the likes of Gary Kirsten, Dale Steyn, Muttiah Muralitharan, Michael Hussey, Mahela Jayawardena, or even Ponting himself have helped in the development of the emerging crop of Indian players in particular, who have had unprecedented access to quality and experience which could not have been possible without the emergence of a franchise tournament like the IPL. Asserting on the aforementioned point, Point exclaimed, “Competitions like the IPL or a CPL, have played a huge part in crossing over of different cultures and the understanding of different cultures. You’ve also got coaches from different countries, so you always have a crossover of different ideas and cultural coaching methods. Growing up in Australia, or growing up in India, or England, South Africa, the coaches have all coached a certain way in the conditions that they’ve played in. So I think now that the players are playing a lot more around the world, they’re getting exposed to different conditions, to different coaching methods, that they’re becoming more rounded players as a result. I think that’s one area that the Indian Cricket’s has really been out of thrive.”","pubDate":"2022-10-20 18:44:23","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sandeep Patil Loses To Amol Kale In MCA Presidential Election","link":"https://sports.ndtv.com/cricket/sandeep-patil-loses-to-amol-kale-in-mca-presidential-election-3450539","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Patil was earlier director at the National Cricket Academy and also served as chairman of the BCCI selection committee. He represented India in 29 Tests and 45 ODIs.","content":"Former India batter Sandeep Patil on Thursday lost the presidential election of Mumbai Cricket Association to Amol Kale. Kale, who had the backing of BJP MLA and new BCCI treasurer Ashish Shelar, defeated Patil by 25 votes. Kale got 183 votes as compared to Patil's 158. Kale was vice-president in the previous regime. The 66-year-old former cricketer had decided to contest the MCA polls last month. Promoted Patil was earlier director at the National Cricket Academy and also served as chairman of the BCCI selection committee. He represented India in 29 Tests and 45 ODIs. He also has a lot of coaching experience with stints with the Indian, Kenyan and Oman teams.","pubDate":"2022-10-20 18:07:45","image_url":"https://c.ndtvimg.com/2019-08/0hgsaod8_sandeep-patil-pti_625x300_27_August_19.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Reilly opens cricket season with brilliant century to lead Great Boulder to victory","link":"https://thewest.com.au/news/kalgoorlie-miner/reilly-opens-cricket-season-with-brilliant-century-to-lead-great-boulder-to-victory-c-8604014","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Brock Reilly’s 102 led Great Boulder to a decisive B-grade victory over Lake View in the first round of the 2022-23 Eastern Goldfields Cricket Association B-grade competition.","content":"Top-order batter Brock Reilly made his start to the Eastern Goldfields Cricket Association’s B-grade campaign a memorable one after his century underpinned Great Boulder’s emphatic win last Saturday over Lake View. The Two Blues were at 2-56 before Reilly and Ben Sherry put on 77 for the third wicket. Sherry struck six boundaries before departing for 38. Reilly had nine boundaries on the way to an impressive 102 from the number four spot as Great Boulder cruised to 9-277. The total was boosted by a wayward Lake View attack which conceded 49 sundries, including 30 wides. Lake View’s run chase faltered to 7-53 before Matt Ruly dug in for an unbeaten 31 in 38 minutes. Ruly faced 56 balls and struck five fours, but he was the lone resistance as the Viewers were bundled out for 104 in 30 overs. Will Miller led the Two Blues’ attack with 3-31 and Daniel Colling, Jeeman Singh and Jake Basire each grabbed two wickets. Great Boulder A-grade player-coach Dylan Hinchliffe said the performances of Reilly, Colling and Sherry underpinned the healthy competition for spots in the top team. “Each of those blokes played every game of A-grade for us last season,” Hinchliffe said. “To see them all go back to the B-grade with terrific attitudes and perform really well was great. “Everyone understands that they’re all going to be required in A-grade at some stage of the season and it’s good to have the options of bringing guys in who are in form.” In the other B-grade match, North Kalgoorlie’s Leium Bernhardt blasted 40 off just 14 balls in 18 minutes in the side’s big win over Hannans. Bernhardt and Jordan Delbridge (19 not out off 14 balls) steered Norths to 5-95 in 13.3 overs after Hannans were restricted to 92 in 29.4 overs. Hannans’ Vinnie Keynes top-scored with 32 not out off 47 balls in a 66-minute stay that featured six fours. However, any hopes of a big score were dashed when Hannans fell to 5-29 off the back of Callum Ringrose’s 4-14. David Trevaskis took 3-21. Round two will be played on Saturday when Great Boulder meet Norths at Ray Finlayson Sporting Complex and Lake View take on Hannans at Wallace Park. Both matches start at 11am. Sign up for our emails","pubDate":"2022-10-20 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8604014/478b513ddd1039d384c325a58746e5a2bcd34628-16x9-x0y209w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: 12th man standing, cheer for Indian cricket team ahead of Mission Melbourne","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-12th-man-standing-cheer-for-indian-cricket-team-ahead-of-mission-melbourne-ind-vs-pak-weather-update-2022-10-20-817760","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: In a country, where there are plenty of reasons to create hatred and divide in the name of caste, creed, colour, language, and religion, there is this game that unites us like nothing else. It is not just those 11 guys playing on the field that defines the game. It is the people who back them, at the stands, in front of their mobile screens, and in front of their televisions. When those eleven boys, wearing the India blues take the field, they are backed by billions who slip into agony and ecstasy with every ball that is being bowled.","content":null,"pubDate":"2022-10-20 17:34:24","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"'We can't say...': BCCI president Roger Binny reacts to PCB's call to boycott ODI World Cup 2023 in India","link":"https://zeenews.india.com/cricket/we-cant-say-bcci-president-roger-binny-reacts-to-pcbs-call-to-boycott-odi-world-cup-2023-in-india-2524758.html","keywords":null,"creator":null,"video_url":null,"description":"BCCI secretary Jay Shah, who is also the president of the Asian Cricket Council (ACC) recently said that the Indian team will not travel to Pakistan for the Continental championship","content":"The BCCI vs PCB saga continues with newly-appointed BCCI president Roger Binny reacting to Pakistan board's call to boycott tour of India next year to play the ODI World Cup. Binny says that India cannot travel to Pakistan without the Indian government's nod. Earlier, BCCI secretary Jay Shah had told press that India won't be travelling to Pakistan to play in Asia Cup 2023 which is to be hosted by the neighbouring country. \"That is not the BCCI`s call. We can`t say where our team has to go. Whether we leave the country or teams coming into the country, we need clearance. Once we get clearance from the government then we go with it. We can`t make decisions on our own. We have to rely on the government,\" Binny said at an event organised by Karnataka State Cricket Association in Bengaluru. The Asia Cup is scheduled to be played in Pakistan in September next year. However, BCCI secretary Jay Shah, who is also the president of the Asian Cricket Council (ACC) recently said that the Indian team will not travel to Pakistan for the Continental championship and demanded that the event be moved to a neutral venue. Read what Shahid Afridi says on Jay Shah's Asia Cup 2023 venue change remark Shah`s comment ruffled some feathers in Pakistan and the Pakistan Cricket Board (PCB) then requested the Asian Cricket Council to convene an emergency meeting. The PCB in its statement had also mentioned that if India did not travel across the border for the tournament then such a move could jeopardise Pakistan`s participation in the ODI World Cup, which is set to be held in India in 2023. Earlier in the day, Sports Minister Anurag Thakur said the Indian team will need clearance from the Home Ministry to travel to Pakistan. I like @TheRealPCB statement on the Asia Cup. This is how mature, sensible and professional organisations handle sensitive and important matters. https://t.co/4aeh5IIV8e — Shahid Afridi (@SAfridiOfficial) October 19, 2022 Notably, Pakistan and India do not play bilateral cricket and only meet in global tournaments or multi-team events since 2013 due to strained political tensions between the two countries. India`s last trip to Pakistan was for the 2008 Asia Cup, while Pakistan`s last visit to India was for the 2016 ICC T20 World Cup. The two teams last played each other at the 2022 Asia Cup in UAE in August-September this year, and are due to face off in the T20 World Cup in Melbourne on October 23. With IANS inputs","pubDate":"2022-10-20 17:19:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"WI vs IRE Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s WI vs IRE T20 World Cup 2022 match No. 11 in Hobart, 930 AM IST, October 21","link":"https://zeenews.india.com/cricket/wi-vs-ire-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-wi-vs-ire-t20-world-cup-2022-match-no-11-in-hobart-930-am-ist-october-21-2524757.html","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs Ireland Dream11 Team Prediction West Indies vs Ireland T20 World Cup 2022 Match No. 11 Preview - Check My Dream11 Team, Best players list of WI vs IRE, West Indies Dream11 Team Player List, Ireland Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"West Indies will take on Ireland on Friday in a do or die contest. West Indies tasted defeat in their opening match of the tournament as Scotland pulled off an upset to beat them by 42 runs, which is quite a big margin in this format. Although the bowlers did a good job, the batting failed miserably. West Indies' coach Phil Simmons even expressed his disappointment at the performance of their batters in the match. But the Caribbean team made amends soon as they delivered a thoroughly professional performance in the very next match against Zimbabwe, winning it by 31 runs. Johnson Charles, Rovman Powell and Akeal Hossein played good knocks while Alzarri Joseph breathed fire with the ball, registering superb figures of 4/16. They will now be looking to carry the momentum and confidence forward into this match. West Indies had quite a disappointing outing in the last T20 World Cup and they surely can't afford an exit at least before qualifying for the Super 12s this time. Check Live stream details for WI vs Ireland match here Ireland, on the other hand, are also coming into this match on the back of a morale-boosting win against Scotland. They rode on Curtis Campher's superb knock of 72 from 32 deliveries to chase down a challenging total of 177. Not only that, Campher had also registered figures of 2/9 with the ball earlier in the match, which sums up how big an impact he made on Ireland's fortunes in the game. WI vs IRE Dream11 Team Prediction West Indies have lost two wickets but are in control of the chase at the end of the Powerplay! #T20WorldCup | #WIvSCO | _ https://t.co/zYWEnEI17N pic.twitter.com/LZUrHjF4cJ — T20 World Cup (@T20WorldCup) October 17, 2022 Captain: Jason Holder Vice-Captain: Paul Stirling Suggested Playing XI for WI vs IRE Dream11 Fantasy Cricket Wicketkeepers: Nicholas Pooran, Lorcan Tucker Batters: Kyle Mayers, Evin Lewis, Paul Stirling Allrounders: Curtis Campher, Jason Holder, Akeal Hosein Bowlers: Odean Smith, Obed McCoy, Joshua Little West Indies and Ireland Predicted Playing 11s West Indies Predicted XI : Kyle Mayers, Evin Lewis, Brandon King, Nicholas Pooran (c & wk), Shamarh Brooks, Rovman Powell, Jason Holder, Akeal Hosein, Alzarri Joseph, Odean Smith, Obed McCoy Ireland Predicted XI : Andrew Balbirnie (c), Paul Stirling, Lorcan Tucker (wk), Harry Tector, Gareth Delany, Curtis Campher, George Dockrell, Mark Adair, Barry McCarthy, Joshua Little, Stephen Doheny With ICC inputs","pubDate":"2022-10-20 16:59:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Pant and Karthik can be accommodated in playing XI if Hardik is fifth bowler: Gavaskar","link":"https://www.orissapost.com/pant-and-karthik-can-be-accommodated-in-playing-xi-if-hardik-is-fifth-bowler-gavaskar/","keywords":["Sports","Dinesh Karthik","Hardik Pandya","Rishabh Pant","Sunil Gavaskar","T20 World cup"],"creator":["Post News Network"],"video_url":null,"description":"Mumbai: The great Sunil Gavaskar feels India can accommodate both Dinesh Karthik and Rishabh Pant in the playing XI by making Hardik Pandya the fifth bowling option in the upcoming T20 World Cup. The Rohit Sharma-led side, who will open their campaign against Pakistan in Melbourne Sunday, have two wicketkeeper-batter options in Karthik and Pant, […]","content":"Mumbai: The great Sunil Gavaskar feels India can accommodate both Dinesh Karthik and Rishabh Pant in the playing XI by making Hardik Pandya the fifth bowling option in the upcoming T20 World Cup. The Rohit Sharma-led side, who will open their campaign against Pakistan in Melbourne Sunday, have two wicketkeeper-batter options in Karthik and Pant, both of them vying for a spot in the XI. As the India think-tank ponders over its team combination ahead of the Pakistan clash, the legendary 73-year-old feels both could be accommodated. “It’s just that maybe, if they decide to go with six bowlers, with Hardik Pandya being the sixth bowler, then he (Pant) may not be able to find a place,” Gavaskar said on Star Sports show ‘Cricket Live’. “But if they decide to go with Hardik Pandya as a fifth bowler, then Rishabh Pant has an opportunity to bat at number six and Karthik maybe at number seven, followed by the four bowlers. So, that could well happen, we just have to wait and see. “They would certainly want a left hander in the middle, but looking at the top four, who are in such good form, you sometimes say to yourself, ‘How many overs Rishabh Pant is going to get in? “Is he going to get three or four overs? And for three or four overs, is Karthik or Rishabh better?’ So, these are all the situations they will look at and they’ll take a call on this,” he said. Gavaskar also spoke about Pakistan pace gun Shaheen Shah Afridi and said the he looked to have returned to full fitness in the warm-up match against England. Shaheen returned with figures of 2-0-7-0 in his comeback match against England on October 17. “I think that’s what their main concern was, about his fitness and how he will shape up. And certainly, in the two overs that he bowled, he’s shown that he’s back to full fitness. “So, clearly that is one headache gone. I think with their catching, they were much better than what we saw against England. “Their ground fielding was very good. So, these are two aspects that was worrying them and they have shown improvement in those areas. So, I don’t think they’ll have any doubts when they’ll take on India on Sunday,” Gavaskar concluded. PTI","pubDate":"2022-10-20 16:23:13","image_url":"https://www.orissapost.com/wp-content/uploads/2019/11/sunny1-300x205.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"'Rohit Sharma joins Pakistan cricket team': India captain's lookalike in Pakistan team gets viral ahead of IND vs PAK, check pics","link":"https://zeenews.india.com/cricket/t20-world-cup-2022-ahead-of-ind-vs-pak-rohit-sharma-lookalike-spotted-in-pakistan-dressing-room-see-pics-2524728.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs PAK T20 World Cup 2022 News: A Rohit Sharma lookalike spotted in Pakistan cricket team, read full story to know more","content":"Ahead of the all-important India vs Pakistan clash at T20 World Cup 2022 , a Rohit Sharma picture is getting viral on internet. So what's new? Rohit Sharma often gets viral due to his popularity and we all know he makes a great internet content. But here's the twist: Here the fans think that this is Rohit Sharma in a Pakistan cricket team kit. The truth is something else. Pakistan cricket team's digital producer Ibrahim Badees clicked some pictures in the Pakistan kit at the Gabba and posted it on his Twitter account. The pictures went viral instantly and the reason was that he was looking exactly like Rohit. Fans were surprised and shared their thoughts as well. One user said: \"I legit thought it was rohit sharma in Pakistans kit.\" Another took at potshot at Indian captain: \"Rohit Sharma decided to join PCT after great comeback of Shaheen Shah Afridi.\" Check out the pictures here as well as reactions of the India fans: I legit thought it was rohit sharma in Pakistans kit https://t.co/eBwEcPo6FY — Soha (@SoA241) October 19, 2022 Rohit Sharma decided to join PCT after great comeback of Shaheen Shah Afridi __ https://t.co/sBIyWviDzh — Arshad Pahari _ (@was_ooo_ooo) October 19, 2022 Team India are to play Pakistan in the T20 World Cup 2022 on October 23 at the iconic Melbourne Cricket Ground (MCG). The fans are quite excited but their excitement may get a blow on Sunday as rain play spoilsport . As per reports, a whole day of rain has been predicted in the city of Melbourne which could lead to the game getting affected, wholly or partially. If there is no match, the teams will share one point each as ICC has kept no reserve days for the group stage clashes. Not just the India match vs Pakistan but the Australia vs New Zealand opening game of the Super 12 stage wll also be affected due to the same reason. Hobart, Sydney and Melbourne are some cities who have been massively hit by a summer rains.","pubDate":"2022-10-20 16:00:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“Great to be back in Perth”: Liam Livingstone revels in special opportunity of England playing T20 World Cup opener at Perth Scorchers’ home ground","link":"https://thesportsrush.com/cricket-news-great-to-be-back-in-perth-liam-livingstone-revels-in-special-opportunity-of-england-playing-t20-world-cup-opener-at-perth-scorchers-home-ground/","keywords":["Cricket","Afghanistan","England","ICC T20 World Cup 2022","Liam Livingstone","Perth Scorchers"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Liam Livingstone: The English batter will be playing his first international match since July on the day after tomorrow. England batter Liam Livingstone has enjoyed his time in Australia ahead of ICC T20 World Cup 2022 despite recovering from an ankle injury which he had sustained during The Hundred 2022. In their only warm-up match… The post “Great to be back in Perth”: Liam Livingstone revels in special opportunity of England playing T20 World Cup opener at Perth Scorchers’ home ground appeared first on The SportsRush.","content":"England batter Liam Livingstone has enjoyed his time in Australia ahead of ICC T20 World Cup 2022 despite recovering from an ankle injury which he had . In their only warm-up match against Pakistan at the Gabba on Monday, Livingstone contributed across departments to confirm having achieved optimum fitness ahead of a world event. Having dismissed Pakistan opening batter Shan Masood whilst giving only eight runs in his two overs, Livingstone followed it up with scoring 28 (16) at a strike rate of 175 including a four and two sixes. Livingstone, who is always a certainty in England’s T20I Playing XI, is highly likely of playing an international match after almost 12 weeks when England take on Afghanistan in the second Super 12 match on Saturday. Livingstone, 29, will feel at home with the match to be played at the Perth Stadium – home ground to his Big Bash League franchise . “It’s great to be back in Perth. I spent two years here with the Perth Scorchers, and to have the opportunity of playing at the Perth Stadium for our opening World Cup game will be very special,” Livingstone wrote in a piece published on the of ECB (English Cricket Board). In 28 innings for Scorchers, Livingstone has scored 851 runs at an average of 30.39 and a strike rate of 138.15 with the help of seven half-centuries. The right-handed batter acknowledged facing a challenge in the form of Afghanistan later this week but wrote against there being “secrets” with respect to both individual and team tactics. An archetype T20 globetrotter, Livingstone has been part of multiple dressing rooms playing under various team managements to have nothing hidden about his approach towards batting especially in this format.","pubDate":"2022-10-20 15:11:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Skipper Andy Balbirnie says Ireland don’t fear any opponent as cricketers look to seal World Cup Super 12s spot","link":"https://www.independent.ie/sport/other-sports/cricket/skipper-andy-balbirnie-says-ireland-dont-fear-any-opponent-as-cricketers-look-to-seal-world-cup-super-12s-spot-42082800.html","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Look forward to playing England at the iconic Melbourne Cricket Ground on Wednesday, or pack your bags for home, is the choice facing Ireland on Friday morning (5.00am Irish time) as they square up to the West Indies in Hobart in a make-or-break T20 World Cup clash.","content":null,"pubDate":"2022-10-20 14:56:00","image_url":"https://www.independent.ie/sport/other-sports/cricket/3a1b3/42082799.ece/AUTOCROP/w1240h700/17082022HM0110","source_id":"independent","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Skipper Andy Balbirnie says Ireland don’t fear any opponent as they look to seal World Cup Super 12s spot","link":"https://www.independent.ie/sport/other-sports/cricket/skipper-andy-balbirnie-says-ireland-dont-fear-any-opponent-as-they-look-to-seal-world-cup-super-12s-spot-42082800.html","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Look forward to playing England at the iconic Melbourne Cricket Ground on Wednesday, or pack your bags for home, is the choice facing Ireland on Friday morning (5.00am Irish time) as they square up to the West Indies in Hobart in a make-or-break T20 World Cup clash.","content":null,"pubDate":"2022-10-20 14:56:00","image_url":"https://www.independent.ie/sport/other-sports/cricket/ddeff/42082799.ece/AUTOCROP/w1240h700/17082022HM0110","source_id":"independent","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Sisanda Magala fitness controversy part of wider plans by CSA to improve standards of domestic cricket","link":"https://www.iol.co.za/sport/cricket/domestic/sisanda-magala-fitness-controversy-part-of-wider-plans-by-csa-to-improve-standards-of-domestic-cricket-8edbd0fe-5444-4cc6-b1e7-e0ef79bef62b","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Sisanda Magala needs to meet CSA’s fitness requirements in order to play at domestic level, says director of cricket Enoch Nkwe.","content":null,"pubDate":"2022-10-20 14:39:59","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/73963e32-58b4-5275-9057-cd2b4e8aeecf&operation=CROP&offset=0x123&resize=2058x1157","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Watch: Fans Welcome India In Melbourne With Special Cake Ahead Of Pak Game","link":"https://sports.ndtv.com/cricket/fans-welcome-india-in-melbourne-with-special-cake-ahead-of-t20-world-cup-watch-3449811","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Indian cricket team landed in Melbourne on Thursday ahead of their 2022 T20 World Cup opener against Pakistan on Sunday","content":null,"pubDate":"2022-10-20 14:37:05","image_url":"https://c.ndtvimg.com/2022-10/mhioobk_rohit-sharma_120x90_20_October_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Zimbabwe vs Scotland head to head in T20 history: Scotland vs Zimbabwe T20 head to head records and stats","link":"https://thesportsrush.com/cricket-news-zimbabwe-vs-scotland-head-to-head-in-t20-history-scotland-vs-zimbabwe-t20-head-to-head-records-and-stats/","keywords":["Cricket","ICC T20 World Cup 2022","Scotland","Zimbabwe"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Zimbabwe vs Scotland head to head in T20: The SportsRush presents for you the Head to Head statistics for SCO vs ZIM T20 World Cup match. The last First Round match of ICC T20 World Cup 2022 will be played between Scotland and Zimbabwe at the Bellerive Oval tomorrow. Set to face each other in… The post Zimbabwe vs Scotland head to head in T20 history: Scotland vs Zimbabwe T20 head to head records and stats appeared first on The SportsRush.","content":"Zimbabwe vs Scotland head to head in T20: The SportsRush presents for you the Head to Head statistics for SCO vs ZIM T20 World Cup match. The last First Round match of ICC T20 World Cup 2022 will be played between Scotland and Zimbabwe at the Bellerive Oval tomorrow. Set to face each other in this format after 13 months, the match will decide the future of both the teams with respect to this tournament. Currently at the first and second positions on Group B points table respectively, Scotland and Zimbabwe will take part in a knockout match as only one out of these two teams will move to Super 12s starting from the day after tomorrow. With each of the four Group B teams winning and losing one out of their two matches thus far, two winners will qualify to the next round to avoid any complex calculation around NRR (Net Run Rate). Played at the Grange Cricket Club Ground last year, the last Scotland vs Zimbabwe T20I had witnessed Zimbabwe sealing a 178-run chase in the last over on the back of batter Milton Shumba scoring 66* (29) with the help of two fours and six sixes at a strike rate of 227.58. Zimbabwe vs Scotland head to head in T20 history Total number of matches played: 4 Matches won by SCO: 1 Matches won by ZIM: 3 Matches played at neutral venues: 1 (SCO 0, ZIM 1) Matches played in ICC T20 World Cup: 1 (SCO 0, ZIM 1) SCO average score against ZIM: 146 ZIM average score against SCO: 149 Most runs for SCO: 204 (Richie Berrington) Most runs for ZIM: 142 (Sean Williams) Most wickets for SCO: 6 (Safyaan Sharif) Most wickets for ZIM: 7 (Tendai Chatara and Wellington Masakadza) Most catches for SCO: 3 (Michael Leask) Most catches for ZIM: 3 (Ryan Burl and Sean Williams) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post Zimbabwe vs Scotland head to head in T20 history: Scotland vs Zimbabwe T20 head to head records and stats appeared first on The SportsRush.","pubDate":"2022-10-20 14:26:06","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Travelling to Pakistan not BCCI's call, government will decide: Roger Binny","link":"https://www.business-standard.com/article/sports/travelling-to-pakistan-not-bcci-s-call-government-will-decide-roger-binny-122102001118_1.html","keywords":null,"creator":null,"video_url":null,"description":"The BCCI can't take a call on its own on whether the Indian team will travel to Pakistan for the 2023 Asia Cup or not as it relies on the government to make such decisions, new Board president Rogery Binny said on Thursday. Speaking at an event organised by Karnataka State Cricket Association here, Binny said the BCCI has not approached the government yet on travelling to Pakistan next year but eventually the central government will only decide on the matter. \"That is not BCCI's call. We need government's clearance to leave the country. Whether we leave the country or teams coming into the country, we need clearance. \"Once we get clearance from the government then we go with it. We can't make decision on our own. We have to rely on the government. We have not approached them yet,\" said World Cup winner Binny. The Asia Cup is scheduled to be played in Pakistan in September next year, ahead of the ODI World Cup in India. Binny's comments came after BCCI secretary Jay Shah said the","content":"The BCCI can't take a call on its own on whether the Indian team will travel to Pakistan for the 2023 Asia Cup or not as it relies on the government to make such decisions, new Board president Rogery Binny said on Thursday. Speaking at an event organised by Karnataka State Cricket Association here, Binny said the BCCI has not approached the government yet on travelling to Pakistan next year but eventually the central government will only decide on the matter. \"That is not BCCI's call. We need government's clearance to leave the country. Whether we leave the country or teams coming into the country, we need clearance. \"Once we get clearance from the government then we go with it. We can't make decision on our own. We have to rely on the government. We have not approached them yet,\" said World Cup winner Binny. The Asia Cup is scheduled to be played in Pakistan in September next year, ahead of the ODI World Cup in India. Binny's comments came after BCCI secretary Jay Shah said the Indian team will not travel to Pakistan next year for the Asia Cup and will instead like to play the tournament at a neutral venue. Earlier on Thursday, Sports Minister Anurag Thakur said the Indian team will need clearance from the Home Ministry to travel to Pakistan. A 'disappointed' Pakistan Cricket Board (PCB) on Wednesday requested the Asian Cricket Council to convene an emergency meeting. Referring to Shah's comment, the PCB had said that \"such statements can spilt the Asian and international cricket communities\" and impact Pakistan's visit to India for the 2023 World Cup. India haven't travelled to Pakistan since the 2008 Asia Cup, and after the Mumbai terror attack on November 26 that year, the scheduled bilateral series in early 2009 was cancelled. Pakistan did travel to India for a short six-match white-ball series in 2012, but in the last 10 years, there hasn't been any bilateral cricket. The two teams have only played each other at various ICC and ACC events. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-10-20 14:26:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221020/thumb-122102001118.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Whether We Leave The Country...\": BCCI President Roger Binny On Team India's Stand On Travelling To.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L3doZXRoZXItd2UtbGVhdmUtdGhlLWNvdW50cnktYmNjaS1wcmVzaWRlbnQtcm9nZXItYmlubnktb24tdGVhbS1pbmRpYS10cmF2ZWxsaW5nLXRvLXBha2lzdGFuLTM0NDk2MDjSAYoBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vY3JpY2tldC93aGV0aGVyLXdlLWxlYXZlLXRoZS1jb3VudHJ5LWJjY2ktcHJlc2lkZW50LXJvZ2VyLWJpbm55LW9uLXRlYW0taW5kaWEtdHJhdmVsbGluZy10by1wYWtpc3Rhbi0zNDQ5NjA4L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Whether We Leave The Country...\": BCCI President Roger Binny On Team India's Stand On Travelling To..  NDTV Sports'Won't listen to anyone': India hits back at Pak after PCB threatened boycott of 2023 World Cup  Hindustan Times\"India Need Govt Clearance To Travel To Other Countries, Can't Take Decisions On Our Own\"- Roger Binny  Cricket AddictorIndia's Response To Pakistan Cricket Board Threat That It May Not Visit For World Cup  NDTV SportsPakistan can't afford to forgo playing against India; Sports Commentator Karan Ambardar speaks  Republic WorldView Full coverage on Google News","content":null,"pubDate":"2022-10-20 14:14:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"‘India can’t dictate how Pakistan will play cricket’- Former Pak players react to BCCI-PCB controversy","link":"https://indianexpress.com/article/sports/cricket/india-pakistan-cricket-pak-players-react-bcci-pcb-controversy-8221352/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"After ACC president and BCCI secretary, Jay Shah said that India will not travel to Pakistan for the upcoming edition of Asia Cup 2023 while adding that the tournament would be held in a neutral venue, it brought about sharp reactions from quite a few former Pakistan cricketers. The Pakistan Cricket Board (PCB) also issued a strongly-worded statement on the same and threatened to boycott the 2023 ODI World Cup and wrote: “The PCB has noted with surprise and disappointment of yesterday’s comments made by the ACC President Mr Jay Shah with regards to shifting of next year’s Asia Cup to a neutral venue. The comments were made without any discussion or consultation with the Board of the Asian Cricket Council or the Pakistan Cricket Board (event host) and without any thoughts towards their long-term consequences and implications.” “This is contrary to the philosophy and spirit for which the Asian Cricket Council was formed in September 1983 – a united Asian cricket body to safeguard the interests of its Members and organise, develop, and promote the game of cricket in Asia,” PCB said in a letter they posted on social media. Now, former Pakistan captain and fast bowler Waqar Younis slammed the BCCI and accused the Indian board of “damaging” Pakistan cricket. Subscriber Only Stories View All Premium Copybook Communist to crowd-puller, the one of his kind V S Achuthanandan... Premium Big hits alone wouldn’t decide this T20 World Cup; Sachin Tendulkar... Premium Express Investigation: Qatar World Cup kicks off in a month, spare a thou... Premium An Expert Explains: Missed chances on India-China border Diwali Offer | Up to 1 year free “ I don’t think ye cricket board ka faisla hai. Misbah ne kaha tha ki this is not cricket board, this is coming from the top. Unki badi simple policy hai ki Pakistan ke saath nahi khelna, Pakistan ko tour nahi karna, especially kyunki cricket aakhon me aati hai, zyada log pasand kar t e hain . (I don’t think this is the Indian cricket board’s decision. Misbah had said earlier that this was coming from the top. They have a simple policy that they don’t want to play against Pakistan or tour the country, because cricket is watched by many),” Younis said during a discussion on A Sports. “They want to damage Pakistan, as simple as that. Pakistan should take a stand, and I think PCB gave a good statement. We have to take care of Pakistan cricket, and we have to look after our dignity and respect because that is more important than playing cricket with them. We will see what happens over the next few days,” the former Pakistan speedster added. Former Pakistan speedster Wasim Akram said, “India can’t dictate how Pakistan will play cricket. “I am all for political differences and I can’t say what is happening on the political front.” Advertisement “People need to speak to each other. Jay Shah should have convened a meeting where other boards could have shared their views. After all the ACC itself has awarded Pakistan, the rights of the Asia Cup.” Another former Pakistan player, Salman Butt, took on the ICC and questioned its powers on his YouTube channel. “Firstly tell me, does ICC even exist? Is it neutral? Is there no influence there? Is India not the heavyweight there because they bring more financial backup to ICC?,” said Butt. Advertisement “Jab aisa hota hai, tab time to time you see muscle. Jahan se revenue aata hai, Vahan se vo apni chaahat ke hisaab se decisions liye jaate hain. Poori duniya me hota hai ye. It all depends jab ICC me ye meeting hui thi, Jay Shah hi preside kar rahe the, aur ussi me Pakistan ko award hua tha Asia Cup, uss time unhone kya kaha tha, ye wahi jaanta hai jo uss meeting mein thhe. (You see their muscle on things like these. Those who bring revenue have more power. It happens everywhere. When Jay Shah presided the ICC meeting, it was decided that Pakistan will host Asia Cup. What he said then, is something only those who can attend the meeting can tell),” he added. What Jay Shah had said? Shah, who is also the president of the Asian Cricket Council (ACC), in his statement more or less ended any possibility of the tournament being held in Pakistan . “The Asia Cup 2023 will be held at a neutral venue. I am saying this as ACC President. We [India] can’t go there [to Pakistan], they can’t come here. In the past also, the Asia Cup has been played at a neutral venue,” Shah had said after the 91st BCCI annual general meeting in Mumbai , in the presence of new Board president Roger Binny. While speaking to reporters, he stressed that on the issue of playing with Pakistan, there is a policy in place and the BCCI will follow that. BCCI vice-president Rajeev Shukla, seated next to Shah, explained that the Board will need government clearance to play Pakistan. India last travelled to Pakistan for a bilateral series in 2005-06 under the captaincy of current Team India coach Rahul Dravid . However, India did travel to Pakistan in 2008 to compete in the Asia Cup.","pubDate":"2022-10-20 13:57:43","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: From Virat Kohli to Shaheen Afridi, decoding Indian and Pakistan team ahead of mega clash","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-from-virat-kohli-to-shaheen-afridi-decoding-indian-and-pakistan-team-ahead-of-mega-clash-2022-10-20-817712","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: The T20 World Cup has begun with some breathtaking matches and some nail-biting competition between the sides. The T20 festival of the cricket is being played in Australia and the round 1 matches are being held currently. The Super 12 stage begins on October 22 and India will have a crack at Pakistan on October 23. Ahead of the much-awaited high-octane clash between the two giants, let's take a look at the two teams.","content":"The T20 World Cup has begun with some breathtaking matches and some nail-biting competition between the sides. The T20 festival of the cricket is being played in Australia and the round 1 matches are being held currently. The Super 12 stage begins on October 22 and India will have a crack at Pakistan on October 23. Ahead of the much-awaited high-octane clash between the two giants, let's take a look at the two teams. For the Indian cricket team, their batting has been the main strength for the last few times. The likes of Suryakumar Yadav, and are making their bat talk and troubling the opposition. Suryakumar Yadav is the No.2 ranked batter and has been in fabulous touch this year. He has amassed over 800 runs in 2022 and has turned some matches upside down with his aggressive style of batting. Another big boost for the Indian team is the fact that Virat Kohli is back in form. Kohli, who was not amongst runs for a long time has found back his mojo after hitting the 71st ton in the Asia Cup. He also scored a few half-centuries in T20Is in recent times. The former Indian skipper also enjoys batting against Pakistan. In the nine innings that Kohli has appeared in against the arch-rivals in the shortest format, the right-handed batter has scored 406 runs at a brilliant average of 67.66. He also has 4 fifties against them. To add on, the likes of KL Rahul, and have also risen on many occasions in recent times and have helped the team score big. The fact of bowled a brilliant spell against Australia in the warm-up match will help India in the absence of . Other than Shami, Arshdeep Singh and Ravichandran Ashwin have also been crucial for India. For the Pakistan side, it is their opening pair which has been the torchbearer for the boys in green. Mohammad Rizwan is in brilliant touch in the current year. The right-handed batter is currently the No.1 T20I batter in the World and is also the leading run scorer in the shortest format in the World. Rizwan has amassed 821 runs in 18 innings and leads the chart from Suryakumar Yadav. Also, is back among runs after having a quiet team in the Asia Cup 2022. He scored a brilliant ton against England in a home T20I series and has a few more fifties in his name. The fact that Azam and Rizwan took away the match from India in their previous meeting in the T20 World Cup adds to the worries for the Indian team. For Pakistan, Shaheen Shah Afridi has also made a scintillating comeback from an injury break and has shown his best in the warmup game against Afghanistan. The Indian cricket team has not seen great days in the recent past in the bowling department. The Asia Cup 2022 and the recent T20I home series against Australia and South Africa have been the events where the bowling looked a bit flat. They leaked runs in the death overs and a few matches went away from them. Also, India does not have a left-handed batter in the top five. In the previous T20 World Cups, left-handed batters have left an impact on the game and have helped their team win matches. Whether it was Yuvraj Singh for India in 2007 or David Warner and Matthew Wade for Australia in 2021, left-handers have felt their presence in the tournament. is out of the World Cup and Rishabh Pant's place is not settled in the team. This does not give variety to the Indian team to bring a left-right combination and hamper the opposition's plans. The Pakistan team played in the knockouts of the Asia Cup 2022 and T20 World Cup 2021. Their opening batting and fast bowling have been on fire on most occasions. However what trouble the boys in green is their middle-order batting. The openers have scored a major amount of runs while the team has failed to spark when they get out early. The likes of Iftikhar Ahmed and Khushdil Shah have not performed frequently and the big power hitters Asif Ali and Mohammad Nawaz have also not been fired consistently. Also, the boys in green don't boast a strong fielding attack. They have missed chances on a few occasions and the game has turned away from them due to that. When two former winners, when two arch-rivals India and Pakistan will have a go at each other in the marquee tournament, there is nothing less expected than a cricketing blockbuster.","pubDate":"2022-10-20 13:54:57","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Sisanda Magala must shed the fat in order to play, says Enoch Nkwe","link":"https://www.iol.co.za/sport/cricket/domestic/sisanda-magala-must-shed-the-fat-in-order-to-play-says-enoch-nkwe-8edbd0fe-5444-4cc6-b1e7-e0ef79bef62b","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Sisanda Magala needs to lose weight and meet CSA’s fitness requirements in order to play at domestic level, says director of cricket Enoch Nkwe.","content":null,"pubDate":"2022-10-20 13:48:08","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/73963e32-58b4-5275-9057-cd2b4e8aeecf&operation=CROP&offset=0x123&resize=2058x1157","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"ICC poll: Sourav deprived to secure someone else's interests, claims Mamata","link":"https://www.business-standard.com/article/sports/icc-poll-sourav-deprived-to-secure-someone-else-s-interests-claims-mamata-122102000915_1.html","keywords":null,"creator":null,"video_url":null,"description":"West Bengal Chief Minister Mamata Banerjee on Thursday targeted her guns on the BJP-led Central government for allegedly depriving former Indian cricket skipper Sourav Ganguly by not nominating him for the ICC chairman's post, terming it an act of \"shameless political vendetta\". Banerjee, who said she would have spoken out on the issue even if master batsman Sachin Tendulkar was similarly deprived, alleged that Ganguly was deprived of the chance to fight the election to secure someone else's interests. Why was he not sent to ICC? It is to secure someone's interest (in the cricket board). I had spoken to various BJP leaders, but he was not allowed. He has been deprived.... This is a shameful political vendetta,\" she told reporters here. Earlier this week, the TMC boss expressed shock over Ganguly's \"removal\" as BCCI President and sought Prime Minister Narendra Modi's intervention so that he is allowed to contest the elections for International Cricket Council head. Roger Binny, a 19","content":null,"pubDate":"2022-10-20 13:10:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221020/thumb-122102000915.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Crowd numbers a concern for World Cup","link":"https://www.themercury.com.au/sport/crowd-numbers-a-concern-for-t20-world-cup-despite-improved-turnout/news-story/3c84070e8619c207f5b6abad235ab260","keywords":["Sport"],"creator":null,"video_url":null,"description":"ICC officials will be hopeful of a much bigger turnout at Friday’s T20 World Cup games in Hobart after the first two days of play drew in a combined total of just over 5,000 fans.","content":"It was always going to be tough to fill the stands of Bellerive Oval with clashes scheduled during weekdays in the late afternoon and early evening but after drawing just 2,135 people through the gate on Monday, Wednesday saw a slight improvement on the opening day’s numbers.With sunny skies and a top of 21 degrees, combined with Thursday’s public holiday, 2,940 showed out to see Ireland defeat Scotland and the West Indies record their first win of the tournament over Zimbabwe.But with the governing body of cricket going to great lengths to bring the big time to Hobart, including shutting down adjoining streets and quite literally de-branding Blundstone Arena, they would have expected a far greater turnout than what has eventuated.While crowd numbers have been relatively low, plenty of fans have come from far and wide to see the four competing teams in action with one fan travelling all the way from Ireland to follow his beloved Celtic cricketers.“The boss doesn’t know I’m here but I’m having a great time,” he joked.Three days of play remain in Hobart with a double header scheduled for Friday before the Super 12 stage of the tournament kicks off on Sunday with South Africa and Bangladesh set to play their first games of the tournament.NED-7429 Mercury Banner","pubDate":"2022-10-20 13:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"BCCI president Roger Binny addresses India’s stance over travelling to Pakistan - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMisAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pZi13ZS1sZWF2ZS10aGUtY291bnRyeS1iY2NpLXByZXNpZGVudC1yb2dlci1iaW5ueS1hZGRyZXNzZXMtaW5kaWEtcy1zdGFuY2Utb3Zlci10cmF2ZWxsaW5nLXRvLXBha2lzdGFuLWZvci1hc2lhLWN1cC0xMDE2NjYyNjg0ODQ1NDAuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BCCI president Roger Binny addresses India’s stance over travelling to Pakistan  Hindustan TimesIndia's Response To Pakistan Cricket Board Threat That It May Not Visit For World Cup  NDTV SportsPakistan can't afford to forgo playing against India; Sports Commentator Karan Ambardar speaks  Republic WorldIndia vs Pakistan: ‘Bullets fired. Pakistan shouldn’t play vs India in T20 World Cup on October 23'  Hindustan TimesIndia need govt clearance to travel to other countries, can't take decisions on our own: Roger Binny on Asia Cup issue  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-10-20 12:58:50","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: नीदरलैंड ने रचा इतिहास, नामीबिया पर यूएई की जीत से सुपर-12 में पहुंची डच टीम","link":"https://www.abplive.com/sports/cricket/uae-win-over-namibia-moves-netherlands-to-t20-world-cup-2022-super-12-round-here-raed-the-latest-news-2242476","keywords":null,"creator":["अभिनव आज़ाद"],"video_url":null,"description":"T20 World Cup 2022 Super-12 Round: नीदरलैंड क्रिकेट (Netherlands Cricket) के लिए आज का दिन बेहद खास है. दरअसल, नीदरलैंड की टीम T20 वर्ल्ड कप 2022 सुपर-12 राउंड (T20 World Cup 2022 Super-12 Round) में पहुंच गई है. हालांकि, नीदरलैंड को श्रीलंका के खिलाफ मैच में हार का सामना करना पड़ा, लेकिन यूएई की नामीबिया पर जीत से यह टीम T20 वर्ल्ड कप 2022 सुपर-12 राउंड में पहुंच गई. वहीं, यूएई की इस टूर्नामेंट में यह पहली जीत है. इस मैच की बात करें तो यूएई ने नामीबिया को 7 रनों से हराया. यूएई के खिलाड़ी मुहम्मद वसीम को प्लेयर ऑफ द मैच चुना गया. नामीबिया पर यूएई की जीत से सुपर-12 में पहुंची नीदरलैंड पहले बल्लेबाजी करने उतरी यूएई ने 20 ओवर में 3 विकेट पर 148 रन बनाए. इस तरह नामीबिया को मैच जीतने के लिए 149 रन बनाने थे, लेकिन ऑलराउंडर डेविड वीजे की शानदार पारी के बावजूद जीत से 7 रन दूर रह गई. नामीबिया की टीम 20 ओवर में 8 विकेट पर 141 रन बना सकी. यूएई के ओपनर मुहम्मद वसीम ने 41 गेंदों पर 50 रनों की शानदार पारी खेली. उन्होंने अपनी पारी के दौरान 3 छक्के और 1 चौके जड़े. इसके अलावा कप्तान सीपी रिजवान ने 29 गेंदों पर नाबाद 43 रनों का योगदान दिया. कप्तान सीपी रिजवान ने अपनी पारी के दौरान 3 चौके और 1 छक्के जड़े. 'आज का दिन यूएई क्रिकेट के लिए बेहद खास' वहीं, इस मैच में जीत के बाद यूएई के कप्तान सीपी रिजवान ने कहा कि आज का दिन यूएई क्रिकेट के लिए बेहद खास है. मैं अपने कोच के अलावा टीम मैनेजमेंट को धन्यवाद देना चाहता हूं. उन्होंने कहा कि हमारी टीम ने कई मौकों पर टुकड़ों में अच्छा प्रदर्शन किया, लेकिन आज टीम के तौर पर शानदार खेल दिखाया. यूएई के खिलाफ हार से निराश नामीबिया के कप्तान गेरहर्ड एरेसमस्स ने कहा कि जब हमने यूएई को 148 रनों पर रोका, तो ऐसा लगा कि बॉलिंग में हमने अच्छा काम किया, इस टार्गेट को हम चेज कर लेंगे, लेकिन मिडिल ओवर में हमारे बल्लेबाजों ने खराब शॉट खेले, इस वजह से टीम को हार का सामना करना पड़ा. ये भी पढ़ें- IPL 2023: पूर्व ऑस्ट्रेलियाई खिलाड़ी ब्रैड हैडन होंगे पंजाब किंग्स के असिस्टेंट कोच, ऐसा रहा है करियर SMAT 2022: मध्य प्रदेश को लगा बड़ा झटका, वेंकटेश अय्यर सैयद मुश्ताक अली ट्रॉफी 2022 के बाकी बचे मैचों से बाहर","content":"T20 World Cup 2022 Super-12 Round: नीदरलैंड क्रिकेट (Netherlands Cricket) के लिए आज का दिन बेहद खास है. दरअसल, नीदरलैंड की टीम T20 वर्ल्ड कप 2022 सुपर-12 राउंड (T20 World Cup 2022 Super-12 Round) में पहुंच गई है. हालांकि, नीदरलैंड को श्रीलंका के खिलाफ मैच में हार का सामना करना पड़ा, लेकिन यूएई की नामीबिया पर जीत से यह टीम T20 वर्ल्ड कप 2022 सुपर-12 राउंड में पहुंच गई. वहीं, यूएई की इस टूर्नामेंट में यह पहली जीत है. इस मैच की बात करें तो यूएई ने नामीबिया को 7 रनों से हराया. यूएई के खिलाड़ी मुहम्मद वसीम को प्लेयर ऑफ द मैच चुना गया. नामीबिया पर यूएई की जीत से सुपर-12 में पहुंची नीदरलैंड पहले बल्लेबाजी करने उतरी यूएई ने 20 ओवर में 3 विकेट पर 148 रन बनाए. इस तरह नामीबिया को मैच जीतने के लिए 149 रन बनाने थे, लेकिन ऑलराउंडर डेविड वीजे की शानदार पारी के बावजूद जीत से 7 रन दूर रह गई. नामीबिया की टीम 20 ओवर में 8 विकेट पर 141 रन बना सकी. यूएई के ओपनर मुहम्मद वसीम ने 41 गेंदों पर 50 रनों की शानदार पारी खेली. उन्होंने अपनी पारी के दौरान 3 छक्के और 1 चौके जड़े. इसके अलावा कप्तान सीपी रिजवान ने 29 गेंदों पर नाबाद 43 रनों का योगदान दिया. कप्तान सीपी रिजवान ने अपनी पारी के दौरान 3 चौके और 1 छक्के जड़े. 'आज का दिन यूएई क्रिकेट के लिए बेहद खास' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); वहीं, इस मैच में जीत के बाद यूएई के कप्तान सीपी रिजवान ने कहा कि आज का दिन यूएई क्रिकेट के लिए बेहद खास है. मैं अपने कोच के अलावा टीम मैनेजमेंट को धन्यवाद देना चाहता हूं. उन्होंने कहा कि हमारी टीम ने कई मौकों पर टुकड़ों में अच्छा प्रदर्शन किया, लेकिन आज टीम के तौर पर शानदार खेल दिखाया. यूएई के खिलाफ हार से निराश नामीबिया के कप्तान गेरहर्ड एरेसमस्स ने कहा कि जब हमने यूएई को 148 रनों पर रोका, तो ऐसा लगा कि बॉलिंग में हमने अच्छा काम किया, इस टार्गेट को हम चेज कर लेंगे, लेकिन मिडिल ओवर में हमारे बल्लेबाजों ने खराब शॉट खेले, इस वजह से टीम को हार का सामना करना पड़ा. ये भी पढ़ें- IPL 2023: पूर्व ऑस्ट्रेलियाई खिलाड़ी ब्रैड हैडन होंगे पंजाब किंग्स के असिस्टेंट कोच, ऐसा रहा है करियर SMAT 2022: मध्य प्रदेश को लगा बड़ा झटका, वेंकटेश अय्यर सैयद मुश्ताक अली ट्रॉफी 2022 के बाकी बचे मैचों से बाहर","pubDate":"2022-10-20 12:58:44","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"WI vs IRE head to head in T20 history: West Indies vs Ireland head to head T20 records and stats","link":"https://thesportsrush.com/cricket-news-wi-vs-ire-head-to-head-in-t20-history-west-indies-vs-ireland-head-to-head-t20-records-and-stats/","keywords":["Cricket","ICC T20 World Cup 2022","Ireland","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"WI vs IRE head to head in T20: The SportsRush presents for you the Head to Head statistics for WI vs IRE T20 World Cup match. West Indies and Ireland will face each other in the 11th match of the ongoing eighth edition of ICC T20 World Cup in Hobart tomorrow. The all-important contest will… The post WI vs IRE head to head in T20 history: West Indies vs Ireland head to head T20 records and stats appeared first on The SportsRush.","content":"West Indies and Ireland will face each other in the 11th match of the ongoing eighth edition of ICC T20 World Cup in Hobart tomorrow. The all-important contest will witness these two teams facing each other in the shortest format after as many as 22 months. Last of a three-match bilateral series, the last West Indies vs Ireland T20I was played in St Kitts resulting in a drawn series on the back of a 9-wicket West Indian victory at the Warner Park. The dependency of Super 12 qualification is a primary reason why this match holds immense importance for both the teams. With each Group B team winning one and losing one match on the eve of the final day of this round, whoever wins the two matches will qualify for the next round in a clear-cut scenario. West Indies and Ireland, two teams who haven’t played their best cricket in this tournament thus far, will have to do the same on Friday in order to not return back to their respective countries after playing just three matches of a World Cup. Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-10-20 12:55:06","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}