{"newsArray":[{"title":"Cricket-Williamson back for New Zealand&#039;s white ball tour of West Indies","link":"https://www.thestar.com.my/sport/cricket/2022/07/25/cricket-williamson-back-for-new-zealand039s-white-ball-tour-of-west-indies","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - New Zealand captain Kane Williamson has been named in his first white ball squad since the T20 World Cup as the Black Caps ramp up their preparations for the global tournament with their first tour of the Caribbean in eight years. Read full story","content":"(Reuters) - New Zealand captain Kane Williamson has been named in his first white ball squad since the T20 World Cup as the Black Caps ramp up their preparations for the global tournament with their first tour of the Caribbean in eight years. Williamson, who played his last T20 match in the defeat by Australia in the World Cup final last November, will captain identical T20 and one-day squads to play the West Indies in six white ball matches starting in Jamaica on Aug. 10. Williamson will be joined by pace veterans Trent Boult and Tim Southee, and batsman Devon Conway, all of whom were rested following the team's 3-0 whitewash by England in the test series in June. “It’s always exciting to be heading somewhere you’ve not been in a while and I know this group can’t wait for the challenge of taking on the West Indies in the Caribbean,\" coach Gary Stead said in a statement on Monday. \"For Kane, Trent, Tim and Devon, this will be the first time they have played white ball cricket for New Zealand since last year’s T20 World Cup and tour to India - so this trip will be important for them.\" New Zealand wrapped up a 3-0 T20 series defeat of Ireland with a six-wicket win in Belfast last week. A number of players who featured in that series have been omitted for the West Indies tour, including Dane Cleaver, Jacob Duffy and Blair Tickner. Batsmen Finn Allen and Michael Bracewell have broken into New Zealand's best 15 in the lead-up to the T20 World Cup hosted by champions Australia in October-November. Allen made his ODI debut against Ireland this month, while Bracewell made his T20I debut against the Irish last week. New Zealand ODI and T20 squads: Kane Williamson (capt), Finn Allen, Trent Boult, Michael Bracewell, Devon Conway, Lockie Ferguson, Martin Guptill, Matt Henry, Tom Latham, Daryl Mitchell, Jimmy Neesham, Glenn Phillips, Mitchell Santner, Ish Sodhi, Tim Southee (Reporting by Ian Ransom in Melbourne; Editing by Peter Rutherford)","pubDate":"2022-07-25 02:01:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/25/1671435.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"New BD captain pledges 'fearless' cricket","link":"https://www.thenews.com.pk/print/976540-new-bd-captain-pledges-fearless-cricket","keywords":null,"creator":null,"video_url":null,"description":"DHAKA: Bangladesh´s new Twenty20 skipper Nurul Hasan said Sunday he would push his team to play “fearless cricket” to improve its lagging performance in the game´s shortest format.Bangladesh this week appointed Nurul captain for a three-match series against Zimbabwe,...","content":null,"pubDate":"2022-07-25 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"CA sells India broadcast rights to Disney","link":"https://www.thenews.com.pk/print/976546-ca-sells-india-broadcast-rights-to-disney","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY: Australian cricket chiefs said on Sunday they had agreed to sell broadcasting rights in India to Disney Star in a seven-year deal reportedly worth hundreds of millions of dollars.The Walt Disney-owned media group is believed to have forked out more than Aus$300 million for the rights,...","content":null,"pubDate":"2022-07-25 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"India vs West Indies 2nd ODI highlights Hotstar: IND vs WI highlights 2022 ODI yesterday match","link":"https://thesportsrush.com/cricket-news-india-vs-west-indies-2nd-odi-highlights-hotstar-ind-vs-wi-highlights-2022-odi-yesterday-match/","keywords":["Cricket","India","India tour of West Indies 2022","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs West Indies 2nd ODI highlights: India have managed to register a second consecutive tight victory at the Queen’s Park Oval. West Indies and India have successfully put on display two back-to-back riveting ODIs in Port of Spain resulting in the visitors winning on both occasions to gain an unassailable 2-0 lead in a… The post India vs West Indies 2nd ODI highlights Hotstar: IND vs WI highlights 2022 ODI yesterday match appeared first on The SportsRush.","content":"India vs West Indies 2nd ODI highlights: India have managed to register a second consecutive tight victory at the Queen’s Park Oval. West Indies and India have successfully put on display two back-to-back riveting ODIs in Port of Spain resulting in the visitors winning on both occasions to gain an unassailable 2-0 lead in a three-match series. The recently concluded second ODI required India to chase a 312-run target in order to seal a series win. In what ended up becoming the highest ODI run-chase at the Queen’s Park Oval, it also is the third-highest in West Indies. Although half-centuries by vice-captain Shreyas Iyer (63) and wicket-keeper batter Sanju Samson (54) kept India alive in the chase, them losing half their batting unit right before the third powerplay provided the hosts with a massive advantage. Coming in to bat at No. 7 in the 39th over with more than 100 runs remaining to be scored, all-rounder Axar Patel scored a maiden ODI half-century to win a maiden ODI match award in only his second ODI in the last five years. In what is also his highest individual score in international cricket, Patel scored 64* (35) at a strike rate of 182.85 on the back of hitting three fours and five sixes. Patel playing a pivotal role in scoring a combined total of game-changing 29 runs in the 46th and 47th overs propelled India to chase their 18th run-chase of 300 or more runs in ODIs. An almost early morning finish according to the Indian time has it in it for plentiful Indian fans to have missed out on live action. Hence, a natural urge to go through the highlights on a Monday morning won’t be surprising. For starters, highlights of the second West Indies vs India ODI won’t be available on Disney+Hotstar as it isn’t televising or streaming this series. Streaming platform FanCode, only official streaming app of this tour for the Indian audiences, has an option of watching highlights but only for its subscribers . Here’s the match-winning knock from @akshar2026 . His magical batting earned him the Player of the Match title. Watch all the action from the India tour of West Indies LIVE, only on #FanCode 👉 https://t.co/RCdQk1l7GU @BCCI @windiescricket #WIvIND #INDvsWIonFanCode #INDvsWI pic.twitter.com/y8xQeUxtK6 — FanCode (@FanCode) July 24, 2022 However, non-subscribers can watch selected video highlights on the Twitter handle or YouTube channel of FanCode.","pubDate":"2022-07-24 23:41:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"How England’s Lionesses are tantalisingly close to ending 56 years of hurt in epic semi-final clash with Sweden","link":"https://www.thesun.co.uk/sport/19303935/england-lionesses-semi-euros/","keywords":["Football","Sport","Features","Print Features","The Sun Newspaper","Women's Euro 2022"],"creator":["Katy Docherty"],"video_url":null,"description":"ENGLAND’S Lionesses aim to get the nation roaring tomorrow. Striker Fran Kirby said: “Hopefully we are giving the country something to smile about and to be proud of.” Their Euros semi-final against Sweden, being screened on BBC One, is set to be watched by TEN MILLION people as support for the Lionesses reaches fever pitch. […]","content":"ENGLAND’S Lionesses aim to get the nation roaring tomorrow. Striker Fran Kirby said: “Hopefully we are giving the country something to smile about and to be proud of.” GettyEngland’s Lionesses are tantalisingly close to ending 56 years of hurt in epic semi-final clash with Sweden[/caption] Their Euros semi-final against Sweden, being screened on BBC One, is set to be watched by TEN MILLION people as support for the Lionesses reaches fever pitch. It shows how momentum is buiding, as 7.6million watched their thrilling eleventh-hour 2-1 victory over Spain last Wednesday. With the final tantalisingly in sight, this could be England’s chance to ease the pain of last year’s men’s final defeat to Italy on penalties. Fans are getting behind the Lionesses in a major way – 2,000 extra tickets for the clash at Sheffield United’s Bramall Lane sold out in just ten minutes last week. READ MORE ON LIONESSES FRAN MASTERPLAN Kirby insists England ready to end their semis hoodoo by beating Sweden CRAZY WIN 'I went a little crazy' says jubilant Wiegman after England reach Euros semis And we will be sinking 11.2million pints as we cheer them on tomorrow, according to Voucher Codes.co.uk — that’s on top of the 4.7million said to have been guzzled as they powered past Spain. For the first time in women’s football history, up to 5,000 fans will flock to London’s Trafalgar Square to watch the semi-final on big screens. The event is free, with lucky fans able to bag tickets on a first-come-first-served basis at london.gov.uk/womenseuro2022. Announcing the event, Mayor of London Sadiq Khan said: “With Euros fever gripping the country, I am delighted that thousands of Londoners and visitors will be able to come together and cheer the team on to glory.” Most read in Football GONE DELE UP Everton set to AXE Dele Alli just six months after free transfer from Spurs RED LINE Harry Maguire REJECTED Barcelona transfer swap as part of Frenkie de Jong deal GHOSTING IN Nice eye transfer bid for Schmeichel as Leicester risk losing keeper for free GOT THE RON IDEA Ronaldo 'shocked after Man Utd offer LOAN transfer and contract EXTENSION' 'DROUGHT IS OVER' Merciless fans all say the same thing as Tottenham win pre-season trophy MIDO IN THE MIDDLE Middlesbrough cult hero Mido looks almost unrecognisable aged 39 As the excitement builds to fever pitch the team, managed by the Dutchwoman Sarina Wiegman, are keeping their feet on the ground. Some are still smarting after being bumped into fourth place by tomorrow’s opponents in the 2019 World Cup. But a fresh start comes with a new captain — Arsenal defender Leah Williamson, 25. She said: “I set myself a path to play for Arsenal, then England. “Maybe I didn’t know exactly who I was but I knew where I was going.” Manchester City’s Ellen White, 33 — known for her “goggles” goal celebration — is just one strike behind Wayne Rooney’s 53-goal record for his country and will be looking to equal or beat it tomorrow. For some of the Lionesses the semi-final will be a time of divided loyalties. Chelsea’s Millie Bright, 28, will be facing off against her Swedish team-mates, club captain Magdalena Eriksson and potentially keeper Zecira Mušovic. Leah Williamson and Beth Mead, 27 — the top scorer in the tournament so far with five goals – are up against their Arsenal team-mate Stina Blackstenius. Success against the Swedes will be no mean feat. Unlike England, they can boast at least one Euros win, even if it was in 1984. ‘FEVER GRIPPING COUNTRY’ But there are plenty of people who believe our girls can go all the way.. Match Of The Day host and ex-Three Lions ace Gary Linker was among a handful of high-profile names who took to social media to praise England’s comeback against Spain, tweeting: “Wonderful victory for @Lionesses. Well played.” Prince William also congratulated them, writing: “Great performance and comeback @Lionesses, brilliant team effort! On to the #WEURO2020 semis.” And the public are right behind the girls as Lioness fever has taken hold — which has not gone unnoticed by the team. Fran Kirby added: “As the tournament has grown people have been going, ‘Well done, girls — we’re supporting you!’ “If we get the through to the final it will be incredible for people to have something to celebrate and enjoy.” Fingers crossed the team make it to Wembley to face either France or Germany — the latter giving us a prospect as exciting as England’s 1966 World Cup final. Football’s not coming home quite yet, but it’s tantalisingly close. Below, we introduce you to the Lionesses, share pictures of them when they were youngsters dreaming of footie stardom and tell you sun facts about them. Plus The Sun’s Head Of Sport gives his view. LEAH WILLIAMSON Arsenal Centre Back Leah 25, is from Milton Keynes, Bucks She is studying part time to become an accountantRex InstagramLeah was scouted for the top Rushden & Diamonds Centre of Excellence aged just six[/caption] GEORGIA STANWAY Bayern Munich Midfield Now 23, at 16 Georgia moved and from her home town of Barrow-in-Furness, Cumbria, to follow her dreams to become a footballerGetty Georgia’s favourite cake is a Cartmel Sticky Toffee puddingInstagram MARY EARPS Man Utd Goalkeeper Comeback queen Mary returned to the squad last year after being axed by Phil Neville in 2019Getty Mary, from Nottingham, attempted to learn German through podcasts while playing for VfL Wolfsburg MILLIE BRIGHT Chelsea Defender Millie, 28, is one of the toughest players on the pitch but as a kid growing up in Chesterfield, Derbys, she was obsessed with horse ridingGetty InstagramMillie dumped horse riding for footie after being scouted by Sheffield United. As a teen, she idolised Olympic hero Jessica Ennis-Hill[/caption] BETH MEAD Arsenal Forward The Euros’ top scorer so far with five goals, Beth was a sports all-rounder as a child in Hinderwell, YorksGetty Beth 27, excelled at netball, cricket, hockey and cross-country before bopting to pursue football. So she could afford her pairs of boots, she worked at a local pubInstagram LUCY BRONZE Barcelona Fullback Lucy, 30, from Berwick-upon-Tweed, Northumberland, is the team’s most experienced playerGetty Lucy is bilingual thanks to her Portuguese dad. She worked part-time in a pizza shop when she signed for Everton.Instagram RACHEL DALY Houston Dash Forward/Fullback Rachel, 30, is from Harrogate North Yorks. As a child, some mistook her for a boy due to her short hair when she played for a lads’ teamGetty InstagramSt John Ambulance dedicated a staff member every year to count how many yellow cards Rachel got as a teen player and warned her when she was getting close to a suspension[/caption] FRAN KIRBY Chelsea Forward Fran is 29 and from Reading. Her mum once wrote in a birthday card that Fran would play in the World Cup. Tragically she died suddenly when Fran was 14.Getty Instagram / @frankirbyTragically Fran’s mum died suddenly when Fran was 14[/caption] KEIRA WALSH Man City Midfield Seen as one of the world’s most talented midfielders, Keira, 25, from Rochdale, was obsessed with Man City from early onGetty InstagramAs a kid Keira named her goldfish Shaun Goater and Nicolas Anelka after two former club strikers[/caption] LAUREN HEMP Man City Forward Hailing from North Walsham in Norfolk, 21-year-old Lauren’s early passion was dancingGetty TwitterLauren only took up football after watching her older sister play in their garden at home[/caption] ELLEN WHITE Man City Forward GettyLast year Ellen became the women’s top scorer of all time when she slotted home the 55th career goal[/caption] SuppliedNow 33, she was eight and being trained by her dad Jon when she was spotted by an Arsenal scout[/caption] My view By SHAUN CUSTIS Head of Sun Sport THIS Euros has proved that the women’s game can stand on its own two feet. Which is why we should stop comparing it with men’s football. Last week it was being said that if Ellen White nets another two she will go past Wayne Rooney’s England goal-scoring record of 53. No she won’t, she will extend her own incredible record in women’s football. After all if Harry Kane, currently on 50 goals, gets to 55 we wouldn’t say he’s beaten Ellen White, so why do it the other way round? Of course, should The Lionesses win the tournament at Wembley on Sunday, there will be the inevitable digs at the men about the females triumphing where they failed last year. And they will deserve all the plaudits that come their way. But for the women’s game to seriously progress in the years to come it needs to develop in its own space. Hopefully that means this Euros will encourage girls’ football teams in every primary school, rather than the best players being in the boys’ teams. Once that becomes the norm, then women’s football will really be on the march.","pubDate":"2022-07-24 22:17:28","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"LIVE IND vs WI 2nd ODI Cricket Score and Updates: Axar Leads The Way As India On Verge Of Victory - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi6QFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtaW5kLXZzLXdpLTJuZC1vZGktY3JpY2tldC1zY29yZS10cmluaWRhZC1wb3J0LW9mLXNwYWluLW1hdGNoLXVwZGF0ZXMtaW5kaWEtdnMtd2VzdC1pbmRpZXMtbGl2ZS1zdHJlYW0tZGQtZmFuY29kZS1iYWxsLWJ5LWJhbGwtY29tbWVudGFyeS10YXJnZXQtMzEyLWhvb2RhLWF4YXItc2hhcmR1bC1peWVyLXNhbXNvbi1tYXllcnMtaG9wZS01NTMyMjc1L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IND vs WI 2nd ODI Cricket Score and Updates: Axar Leads The Way As India On Verge Of Victory  India.comIndia vs West Indies 2nd ODI LIVE cricket score and ball by ball commentary: India need 8 from the final over  FirstpostIND vs WI 2nd ODI Live Score Updates: Axar stars as India defeat West Indies by 2 wickets, seal series 2-0  The Indian Express'A Little Casual': Former India Cricketer Slams Shubman Gill For Throwing Away His Wicket  News18View Full coverage on Google News","content":null,"pubDate":"2022-07-24 22:11:30","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sanju Samson batting highlights yesterday match: Sanju Samson maiden ODI half-century in Port of Spain ODI","link":"https://thesportsrush.com/cricket-news-sanju-samson-batting-highlights-yesterday-match-sanju-samson-maiden-odi-half-century-in-port-of-spain-odi/","keywords":["Cricket","India","India tour of West Indies 2022","Sanju Samson","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sanju Samson batting highlights: The Indian wicket-keeper batter scored a maiden ODI half-century at the Queen’s Park Oval. During the second ODI of India’s tour of West Indies 2022 in Port of Spain, India wicket-keeper batter Sanju Samson scored a maiden half-century in only his third match. Coming in to bat at No. 5 in… The post Sanju Samson batting highlights yesterday match: Sanju Samson maiden ODI half-century in Port of Spain ODI appeared first on The SportsRush.","content":"Sanju Samson batting highlights: The Indian wicket-keeper batter scored a maiden ODI half-century at the Queen’s Park Oval. During the second ODI of India’s tour of West Indies 2022 in Port of Spain, India wicket-keeper batter Sanju Samson scored a maiden half-century in only his third match. Coming in to bat at No. 5 in the 18th over of a 312-run chase, Samson scored 54 (51) with the help of three fours and sixes each before finding himself on the wrong end of a run-out in order to sneak a run which could’ve been avoided. It was on the first delivery that Samson faced that he hit a boundary off West Indies all-rounder Kyle Mayers. A leg-side delivery was provided with an apt treatment by the right-handed batter. With spinner Hayden Walsh beating him outside the off-stump only a handful of deliveries later, Samson cleared his front leg to hit the leg-spinner for a six over long-off on the following delivery. Walsh got hit for a replica of this shot for the same result later in the same spell. Samson’s third six of the innings came in the 32nd over when he stepped out against spinner Akeal Hosein only to clear the long-off fielder yet again. It was on the second delivery of the 38th over when Samson hit a Jayden Seales full-toss towards the fine-leg region for his third boundary through that area. With India needing close to 10 runs per over right before the third powerplay, the situation was ideal for a well-set Samson to play an archetype match-winning knock but it wasn’t to be in this particular match. An amazing display of class from @IamSanjuSamson ! He showed poise throughout these incredible plays. Watch the India tour of West Indies LIVE, only on #FanCode 👉 https://t.co/RCdQk1l7GU @BCCI @windiescricket #WIvIND #INDvsWIonFanCode #INDvsWI pic.twitter.com/yHVSlYdDPK — FanCode (@FanCode) July 24, 2022 For more cricket-related news, click here .","pubDate":"2022-07-24 21:58:12","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Hope it’s the first of many”: Ian Bishop applauds Sanju Samson for scoring his first ODI half-century vs West Indies in Trinidad","link":"https://thesportsrush.com/cricket-news-hope-its-the-first-of-many-ian-bishop-applauds-sanju-samson-for-scoring-his-first-odi-half-century-vs-west-indies-in-trinidad/","keywords":["Cricket","Ian Bishop","India tour of West Indies 2022","Sanju Samson"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ian Bishop applauds Sanju Samson after latter scores his maiden half-century at the Queen’s Park in Oval versus the West Indies. During the second ODI of the ongoing India’s tour of West Indies at the Queen’s Park Oval in Port of Spain, India’s wicket-keeper batter Sanju Samson smashed a well-paced maiden half-century in what is his… The post “Hope it’s the first of many”: Ian Bishop applauds Sanju Samson for scoring his first ODI half-century vs West Indies in Trinidad appeared first on The SportsRush.","content":"Ian Bishop applauds Sanju Samson after latter scores his maiden half-century at the Queen’s Park in Oval versus the West Indies. During the second ODI of the ongoing India’s tour of West Indies at the Queen’s Park Oval in Port of Spain, India’s wicket-keeper batter Sanju Samson smashed a well-paced maiden half-century in what is his third innings in the 50-Over format. En Route the stiff target of 312 handed by the Windies, team India were in deep trouble having lost three of their top-order batters by the 18th Over, and with only 79 runs posted on the scoreboard. However, the pair of Shreyas Iyer (63 off 71) and Sanju Samson came to the fore when the team needed the most, stitching a 99-run stand off 94 deliveries for the fourth wicket, to find themselves well and alive in the chase. Iyer, not only brought up his 11th ODI half-century, but now has also scored a total of 7 fifties across 8 innings versus the West Indies, including the one during the first ODI of the series a couple of days ago as well. Samson, on the other hand, soaked in all the pressure as well, while also made sure to go for the big hits every now and then, to keep the required run-rate in check. Samson unfortunately had to head back towards the dressing room due to a run-out at the non-striker’s end at a very critical juncture of the game, but can can still be proud of his 51-ball 54, which he scored with the assistance of 3 Fours and as many Sixes. Former West Indian legendary pacer Ian Bishop, who is also one of the commentators in the ongoing series, took to his social media handle to applaud and congratulate Samson for his maiden fifty in ODIs, while also hoped that he plays many more of such innings for the latter’s countless fans. First half century in ODI’s for Sanju Samson. So many of his fans hope it’s the first of many👏🏻👏🏻👏🏻. — Ian Raphael Bishop (@irbishi) July 24, 2022 For more Cricket-related news, click here.","pubDate":"2022-07-24 21:52:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Another trophy for Aussie cricket women","link":"https://www.perthnow.com.au/sport/cricket/another-trophy-for-aussie-cricket-women-c-7631934","keywords":null,"creator":["Ian Chadband"],"video_url":null,"description":"Australia's cricket world champs have won the T20I tri-nations series event in Ireland after the final match of the tournament was washed out.","content":"Australia's all-conquering women cricketers have flown off to England on their Commonwealth Games gold medal quest with another trophy under their belts. Meg Lanning's world champion team didn't even have to hit a ball as they learned on Sunday they'd won their weather-ruined tri-nations series with hosts Ireland and Pakistan. Australia had been left hugely frustrated on Saturday when they were coasting to victory against Pakistan, only to be denied by the rain in Northern Ireland which forced a no result. It was their second match against Pakistan, one of their opponents in the upcoming Games in Birmingham, which had to be abandoned because of the elements. But as they left for England, they weren't to be denied the overall series victory when Pakistan's final match with the hosts also had to be called off even before the toss at Bready because of more rain. Australia, who only completed two games against Ireland and won them both easily, were announced as overall winners in the six-game round-robin event competition. They earned 12 points to Pakistan's 10, with winless Ireland finishing on two points. But it proved a frustrating weekend for both Australia and Pakistan, who'd been hoping to get in some serious work before flying off to England for their Games quest in Birmingham. Australia legspinner Alana King was announced as player of the tournament for her eight wickets in four innings, including a best of 3-8 against Pakistan in the rain-ruined opening encounter. Captain Meg Lanning also had a good tournament, finished as leading run-scorer with 113 in two outings - an unbeaten 39 in the opening match against Ireland followed by a hard-hit 74 in the second. Australia will open up their Games programme on Friday against India, and will play Pakistan the following Wednesday on August 3.","pubDate":"2022-07-24 21:46:34","image_url":"https://images.perthnow.com.au/publication/C-7631934/0be7cce51ab5022a4f281031074c3e304dd2a3a9-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"County Ground Derby pitch report 3rd T20I: England Women vs South Africa Women pitch today match Derby","link":"https://thesportsrush.com/cricket-news-county-ground-derby-pitch-report-3rd-t20i-england-women-vs-south-africa-women-pitch-today-match-derby/","keywords":["Cricket","England W","South Africa W"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"County Ground Derby pitch report 3rd T20I: The SportsRush brings you the pitch report of the 3rd T20I between England W and South Africa W. England Women will take on South Africa Women in the 3rd T20I of the 3-match T20I series at the County Ground in Derby. After clean sweeping the ODIs, the English… The post County Ground Derby pitch report 3rd T20I: England Women vs South Africa Women pitch today match Derby appeared first on The SportsRush.","content":"County Ground Derby pitch report 3rd T20I: The SportsRush brings you the pitch report of the 3rd T20I between England W and South Africa W. England Women will take on South Africa Women in the 3rd T20I of the 3-match T20I series at the County Ground in Derby. After clean sweeping the ODIs, the English team is looking to complete a whitewash in the T20Is as well. They have won all the matches of the limited-overs leg so far. South Africa Women have been struggling to find their groove, and the absence of their star all-rounder Marizanne Kapp has made their job even tougher. The English team is flying high in both batting and bowling departments, and they will again be the favourites to win this match as well. The County Ground in Derby serves as the home ground to the county side Derbyshire, with a capacity of around 9500. So, it is a very small stadium in terms of the crowd capacity. A total of 7 Women’s T20Is have been played at this very ground, where five games have been won by the teams batting first, and the chasing teams have won a couple of games so far. The average 1st innings score has been 133 runs, so defending has been easy so far at the County Ground in Derby. In the form of her life 🔥 🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvSA 🇿🇦 | @natsciver pic.twitter.com/M7zKsnoxAo — England Cricket (@englandcricket) July 23, 2022 166/6 is the highest Women’s T20 score recorded at this stadium, made by England Women, whereas the lowest score has been recorded by the West Indies women. In terms of the Men’s T20 domestic games played at this very ground, this ground has really supported the batters. There is an even bounce on the track, and the batters can play their shots. With the faster outfield conditions and smaller boundaries, the job of the batters becomes even easier. There is a little help for the pacers in the initial overs, but it has been generally a really good batting track.","pubDate":"2022-07-24 21:30:36","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Entire Scotland cricket board resigns after bombshell racism report","link":"https://www.foxsports.com.au/cricket/cricket-2022-board-of-cricket-scotland-resign-after-majid-haq-racism-report-news/news-story/2a2e8fae644693d5768c79f02b202878","keywords":null,"creator":null,"video_url":null,"description":"The board of the Scottish cricket federation resigned en masse on Sunday following accusations of institutional racism in a damning independent review which is due to be published on Monday.","content":"The board of the Scottish cricket federation resigned en masse on Sunday following accusations of institutional racism in a damning independent review which is due to be published on Monday. “The Board of Cricket Scotland has resigned. We will work in partnership with @sportscotland with immediate effect to ensure appropriate governance, leadership & support is in place for sport in the days ahead,” Cricket Scotland tweeted on Sunday. The review was commissioned last year by Sport Scotland, the national funding body, after Scotland’s all-time leading wicket-taker Majid Haq told Sky Sports News that Cricket Scotland was “institutionally racist”. Haq picked up 60 wickets for Scotland in 54 ODI matches and 28 wickets in 21 T20Is, but was exiled after he tweeted “always tougher when you’re in the minority! #colour #race” after not being selected for a 2015 match. Last year, he told Sky Sports “I was treated like a criminal” in the aftermath of that incident. Haq’s former teammate Qasim Sheikh said he had also suffered racist abuse. Watch South Africa’s Tour of England. Every ODI & T20 Live & On-Demand on Kayo. New to Kayo? Start your free trial now > Scotland's Majid Haq (centre) playing in Sydney in 2015. Source: AAP In its resignation letter to the interim chief executive, the Cricket Scotland board said it was “truly sorry” and apologised to “everyone who has experienced racism, or any other form of discrimination” while playing the game in Scotland. “The review has achieved an unparallelled level of engagement and we believe it will be truly transformative, not just for Cricket Scotland and the sport of cricket, but it will provide a watershed moment for Scottish sport and society in general.” The statement added the current board had not seen the contents of the report. However, it added the board had been made aware of “proposed timescales and certain mandated actions” recommended by the review. In the view of the outgoing board, plans to both resolve the racism issues quickly and modernise the running of Cricket Scotland were “unachievable within the timetable proposed and the current governance framework”. “Consequently, we believe we must now step aside to enable the required progress to be made in the coming months,” the statement added. The issue of racism within British cricket as a whole was brought to the fore again two years ago when former spinner Azeem Rafiq said he had been subjected to racial harassment and bullying during his time as a player for leading English county Yorkshire. That prompted the Headingley-based club to commission an investigation into allegations by the 31-year-old Rafiq, who said he was driven to thoughts of suicide by the culture of racism during his time at Yorkshire. Although seven were upheld, Yorkshire concluded last October that no member of staff would face disciplinary action, a decision that prompted uproar among politicians and the wider cricket community. The shocking testimony of former Yorkshire cricketer Azeem Rafiq to British MPs shook the game. Source: AFP That led to a mass clear-out of administrative and coaching staff at Headingley, with new chairman Kamlesh Patel taking over as the face of a fresh Yorkshire regime. New governance procedures proposed by Patel were voted through by the Yorkshire membership and, as a result, the England and Wales Cricket Board did not go through with a threat to strip Headingley of lucrative international games — a potential financial disaster for Yorkshire. Nevertheless, last month the ECB charged Yorkshire and a number of individuals with bringing the sport into disrepute. But former Yorkshire head coach Andrew Gale, who in June won an unfair dismissal claim against the club after being sacked last year, has said he will refuse to co-operate with the ECB disciplinary process.","pubDate":"2022-07-24 20:11:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Highest run chase in ODI: Highest ODI run chase in West Indies","link":"https://thesportsrush.com/cricket-news-highest-run-chase-in-odi-highest-odi-run-chase-in-west-indies/","keywords":["Cricket","India tour of West Indies 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Highest run chase in ODI: The Windies put on a commendable show with the bat yet again, to pose a still target before India in 2nd ODI. During the second ODI of the ongoing India’s tour of West Indies at the Queen’s Park Oval in Port of Spain, the West Indies have impressed with the bat… The post Highest run chase in ODI: Highest ODI run chase in West Indies appeared first on The SportsRush.","content":"Highest run chase in ODI: The Windies put on a commendable show with the bat yet again, to pose a still target before India in 2nd ODI. During the second ODI of the ongoing India’s tour of West Indies at the Queen’s Park Oval in Port of Spain, the West Indies have impressed with the bat for the second consecutive occasion, to hand a decent enough target of 312 before the Indians, who have their eyes on a series victory. A gritty 13th ODI century for Shai Hope (115 off 135) in his 100th ODI appearance, and a scintillating half-century from skipper Nicholas Pooran (74 off 77) were the two instrumental contributions during the West Indian innings. Sound on 🔊 for the @qpcc_the_oval 🇹🇹 crowd as they salute @shaidhope 🔥👏🏿 #WIvIND pic.twitter.com/P7liN6GKqA — Windies Cricket (@windiescricket) July 24, 2022 Hope’s half-century stand with Kyle Mayers (39 off 23) for the first wicket, and then a 117-run stand alongside skipper for the fourth wicket, were the vital partnerships which have given their bowlers a real shot at levelling the three-match ODI series. As for the Indian bowlers, Shardul Thakur, with figures of 7-0-54-3, was the pick of the lot, with Deepak Hooda, Axar Patel, and Yuzvendra Chahal picking up one wicket apiece. The highest successful run-chase in the ODI format was accomplished by South Africa back in the year 2006, during that unforgettable match against Australia in Johannesburg, when the Proteas unbelievably chased down the mammoth total of 434/4 posted by the Ricky Ponting-led side. The highest-run chase in West Indies is also the third-highest all-time successful chases in the ODI format, which was accomplished in the year 2019 by England. During this high-scoring encounter at the Kensington Oval in Bridgetown, Barbados in the year 2019, England chased down the humongous total of 360/8 posted by the Windies batters, with six wickets in hand.","pubDate":"2022-07-24 19:06:09","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India highest run chase in ODI history: Highest run chase in ODI by India full list","link":"https://thesportsrush.com/cricket-news-india-highest-run-chase-in-odi-history-highest-run-chase-in-odi-by-india-full-list/","keywords":["Cricket","India","India tour of West Indies 2022","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India highest run chase in ODI history: India have chased 300 or more runs in an ODI on 17 occasions in the past. Playing his 100th ODI, West Indies wicket-keeper batter Shai Hope brought up his 13th ODI century to become only the 10th batter to score a century in 100th ODI. In what was… The post India highest run chase in ODI history: Highest run chase in ODI by India full list appeared first on The SportsRush.","content":"India highest run chase in ODI history: India have chased 300 or more runs in an ODI on 17 occasions in the past. Playing his 100th ODI, West Indies wicket-keeper batter Shai Hope brought up his 13th ODI century to become only the 10th batter to score a century in 100th ODI . In what was his eighth century as an opening batter, it was Hope’s third ODI century against India and in 2022 and second at home. Hope, who pretty much batted throughout the innings, scored 115 (135) with the help of eight fours and three sixes to emerge as the highest point of the West Indian innings on Sunday. Sound on 🔊 for the @qpcc_the_oval 🇹🇹 crowd as they salute @shaidhope 🔥👏🏿 #WIvIND pic.twitter.com/P7liN6GKqA — Windies Cricket (@windiescricket) July 24, 2022 Winning the toss and electing to bat first, captain Nicholas Pooran backed his decision with a 10th ODI half-century. Pooran, who shared a 117-run fourth-wicket partnership with Hope, hit a four and six sixes in his 74 (77). Pooran’s eighth ODI half-century at No. 5 was also his fourth at home, third against India, second in 2022 and as captain. Hope and Pooran’s efforts played an instrumental role in powering the hosts to 311/6 in 50 overs at the Queen’s Park Oval today. Apart from these two, top-order batters Kyle Mayers (39) and Shamarh Brooks (35) also chipped in with eye-catching knocks. India will have to register their 15th biggest run-chase if they are to win the second ODI of their ongoing tour of West Indies in Port of Spain. Assuming that they do the same, it will be for the 18th time that India would be chasing 300 or more runs in an ODI (first time in West Indies).","pubDate":"2022-07-24 18:40:59","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Formula 2: Jehan Daruvala finishes seventh in feature race of French Grand Prix after second spot in sprint race","link":"https://www.firstpost.com/sports/formula-2-jehan-daruvala-finishes-seventh-in-feature-race-of-french-grand-prix-after-second-spot-in-sprint-race-10951731.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Formula 2: Jehan Daruvala finishes seventh in feature race of French Grand Prix after second spot in sprint race","content":"Sports Formula 2: Jehan Daruvala finishes seventh in feature race of French Grand Prix after second spot in sprint race Jehan started Saturday's 'sprint race' from the pole position and after a lightning start led into the first corner. He comfortably held on to his own at the front when an incident involving three cars brought out the safety car. FP Sports July 24, 2022 23:53:35 IST File photo of Jehan Daruva Photo by James Gasperotti Le Castellet : Indian racer Jehan Daruvala started the 'feature race' from 10th on the grid but fought his way up to the seventh spot in Formula 2 French Grand Prix on Sunday. Earlier on Saturday, Jehan secured his sixth podium of the season, finishing second in the French round of the Formula 2 championship here. It was his fifth second-place finish this season. The 23-year-old, who races for Italian team Prema, was robbed of a potential fourth F2 victory by a post-race penalty in the last round in Austria. \"It's good to be back on the podium what happened in Silverstone and Austria. We were struggling with pace down the straights but had some good battles to finish second,\" Jehan said. \"We would have finished even higher in the feature race with our strategy to run a long first stint but we gambled on a safety car and stayed out a bit longer than ideal. Other than that, it was a solid weekend for us. We still have some areas to work on and I'm confident we'll come back stronger next weekend in Hungary,\" the 23-year-old added. Jehan started Saturday's 'sprint race' from the pole position and after a lightning start led into the first corner. He comfortably held on to his own at the front when an incident involving three cars brought out the safety car. The 23-year-old Mumbai-based driver timed the restart to perfection, that allowed him to open up a small gap with second-placed Liam Lawson but the latter's superior straight-line speed allowed him to close in. Lawson used his car's superior speed down the straights to get past Jehan and the former swept around the outside into turn one. Jehan held his line but the pair touched, which opened up a tear on his front tyre, but he didn't suffer a puncture. A few laps later, Marcus Armstrong attempted to pass Jehan for second at the same corner but on the inside. They made contact but Jehan, forced wide across the chicane, and kept his position. Armstrong was handed a five-second penalty for forcing Jehan off the track. The Red Bull-backed racer, who earlier this week completed a second Formula One test with McLaren, will now go to Hungary. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: July 24, 2022 23:53:35 IST TAGS: Formula 2 Jehan Daruvala","pubDate":"2022-07-24 18:23:35","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/Jehan-Image-credits-to-James-Gasperotti.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies: Shai Hope joins elite list with century in 100th ODI","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-shai-hope-joins-elite-list-with-century-in-100th-odi-10951661.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs West Indies: Shai Hope joins elite list with century in 100th ODI","content":"Cricket India vs West Indies: Shai Hope joins elite list with century in 100th ODI Shai Hope reached the milestone with a six, in the fourth ball of the 45th over bowled by Yuzvendra Chahal. FirstCricket Staff July 24th, 2022 23:11:17 IST West Indies' Shai Hope plays a shot against India during the second ODI cricket match at Queen's Park Oval in Port of Spain, Trinidad and Tobago, Sunday, July 24, 2022. (AP Photo/Ricardo Mazalan) Playing his 100 th ODI for West Indies, opener Shai Hope registered a memorable century as the hosts took on India in the second of three ODIs against India in Port of Spain. The ton against India on Sunday was Hope’s 13 th in the 50-over format for West Indies. Hope reached the milestone with a six, in the fourth ball of the 45 th over bowled by Yuzvendra Chahal. A hundred in his 100th ODI! 💯 Shai Hope completes his 13th ODI hundred in Port of Spain in the second ODI 👌 Watch #WIvIND for FREE on https://t.co/CPDKNxoJ9v (in select regions) 📺 | https://t.co/tCiz5Jjaqf pic.twitter.com/MPRC9vQl4U — ICC (@ICC) July 24, 2022 Hope shimmied down the track off Chahal’s delivery and unleashed it over the bowler’s head to hit the maximum and reach the milestone, much to the home crowd’s enthusiastic joy. His century, that came in 125 balls, came just two days after he was dismissed for just seven in the first ODI. With the century, 28-year-old Hope joined an elite list, becoming the tenth batter to hit a hundred in his 100 th ODI. Gordon Greenidge, Chris Cairns, Mohammad Yousuf, Kumar Sangakkara, Chris Gayle, Marcus Trescothick, Ramnaresh Sarwan, David Warner and Shikhar Dhawan are the other batters to have scored tons in their 100 th ODIs. Hope, who made his ODI debut against Sri Lanka in 2016, has amassed 4193 runs in the 50-over format for the Windies so far. Hope was eventually dismissed by Shardul Thakur for 115 in the 49th over, as the West Indies finished their innings at 311/6 from 50 overs. India, led by Shikhar Dhawan, won the first ODI by three runs on Friday and are currently leading the series 1-0. West Indies would hope to level the series with an inspired performance on Sunday. The third ODI will be played in Port of Spain on Wednesday (27 July). Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: July 24, 2022 23:11:17 IST Tags: India Vs West Indies 2022 Shai Hope Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-07-24 17:41:17","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/Shai-Hope-2nd-ODI-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ricky Ponting wants Australia to include Tim David in their T20 World Cup squad","link":"https://www.thehansindia.com/sports/ricky-ponting-wants-australia-to-include-tim-david-in-their-t20-world-cup-squad-754918","keywords":["Sports"],"creator":["Ishka"],"video_url":null,"description":"Tim David has played 114 T20s since making his debut in 2018David played 14 T20Is for SingaporeBut the all-rounder is now eligible to play for Australia","content":"Ricky Ponting wants Australia to include Tim David in their T20 World Cup squad Former captain Ricky Ponting has backed Singapore-Australian cricketer Tim David to be included in Australia's T20 World Cup squad. David, who has played 114 T20s over the years, has been one of the consistent lower-order batsmen, scoring runs for fun across T20 leagues. He has 2,556 runs at an average of 33.19 and a fine strike rate of 164.79 since making his professional debut in 2018. Out of the 114 games, 14 came for Singapore, where he scored 558 runs at an average of 46.50 and strike rate of 158.52. David's last appearance for Singapore came in March 2020 when his country played against Hong Kong in Bangkok. The 26-year-old David, who was bought by Mumbai Indians (MI) at INR 8.25 crore at the Indian Premier League (IPL) 2022 mega auction, has featured in a number of leagues, including Big Bash League (BBL), Caribbean Premier League (CPL), Pakistan Super League (PSL), T20 Blast, and The Hundred. \"If I was a selector, I would love to have someone like that in my team. If he's playing or not, just to have that sort of striking power ability around, he's an out and out match-winner,\" said Ponting in a recent interview. Comparing David with Andrew Symonds, who played a vital role in Australia's 2003 World Cup triumph, Ponting said that the former was a match winner. \"He's the sort of player that could actually win you a World Cup. He's not just the average run-of-the-mill guy that might just sneak into a squad. I mean, he actually reminds me a bit of someone like an Andrew Symonds back in the 2003 World Cup. You know if you get them in and you give him an opportunity they're a chance of winning a tournament for you. That's how I'd be looking at him right now. I know there are some other great world-quality players in the middle order for Australia. But probably none of them boasts the resume as good as Tim's over the last two years,\" added Ponting. David, who did not play all the games for MI in IPL 2022, was quite impressive at the fag end of the tournament but by that time, the five-time champions had already been eliminated. 🇸🇬 ✈️ ➡️ 🇮🇳 🏚️ Our newest member of the तोडफोड मंडळ, Tim David is home! 💥💙 #OneFamily #MumbaiIndians @timdavid8 MI TV pic.twitter.com/Fo9DygMFgM \"He's been incredible in almost every tournament that he's played around the world, the last 12 or 18 months. He was probably a little bit unlucky not to play more in the IPL this year to be honest, with the way that he started with Mumbai and then didn't come back until right near the end and played some match-winning knocks then.\" \"He's a very, very good, very dangerous T20 player that I'm sure the Australian selectors are thinking long and hard about for the World Cup in a couple of months time,\" Australia's World Cup-winning skipper concluded. The T20 World Cup is scheduled to take place later this year in Australia, who are also the defending champion. Aaron Finch and Co claimed their maiden T20 World Cup trophy last year, where they defeated New Zealand in the final at Dubai International Cricket Stadium.","pubDate":"2022-07-24 17:34:47","image_url":"https://assets.thehansindia.com/h-upload/2022/07/24/500x300_1304539-rik.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"ENG vs SA, 3rd ODI: Quinton de Kock denied a century as rain plays spoilsport","link":"https://www.indiatvnews.com/sports/cricket/eng-vs-sa-3rd-odi-quinton-de-kock-denied-a-century-as-rain-plays-spoilsport-headingley-2022-07-24-794594","keywords":null,"creator":null,"video_url":null,"description":"Headingley| Absolute misfortune is how we can sum up Quinton de Kock's fate in the final One Day Internationals (ODI) that South Africa was playing against England. As the series was leveled with one victory each in England and South Africa's kitty, fans and cricket experts all around the globe had been expecting a cracker of a game to conclude South Africa's ODI campaign on English soil. South Africa had won the toss and had decided to bat first. Before even a ball was bowled, the English weather threatened to play a spoilsport and people just had their fingers crossed in hopes of a complete game.","content":"Headingley| Absolute misfortune is how we can sum up 's fate in the final One Day Internationals (ODI) that South Africa was playing against England. As the series was leveled with one victory each in England and South Africa's kitty, fans and cricket experts all around the globe had been expecting a cracker of a game to conclude South Africa's ODI campaign on English soil. South Africa had won the toss and had decided to bat first. Before even a ball was bowled, the English weather threatened to play a spoilsport and people just had their fingers crossed in hopes of a complete game. After their debacle in the second ODI, the South African batsmen started on a very cautious note and gave ample respect to the English bowlers who were swinging the ball both ways with overcast conditions backing them. Reece Topley, who has been a revelation for English cricket created some initial trouble for the Proteas batsmen but it was David Willey who dismissed Janneman Malan for a meager 11 off 18 deliveries. Quinton de Kock held one end and dealt with the English bowling in his way. Quinton de Kock first stitched a 77 runs partnership along with Rassie van der Dussen and then added more 55 runs along with . The South African cricket team was cruising well with 159/2 on the board and looked all set to put up a challenging total for the English team to chase, but the weather had some other ideas. When de Kock was batting on 92*, rain struck and it just kept on getting heavier. The umpires had decided on a cut-off time for a 20-over game, but the rain just kept on getting heavier with passing time. Seeing no way out, the umpires had to call the game off which denied de Kock a memorable century. Here is how Twitter reacted: England XI: , , Philip Salt, , (w/c), Liam Livingstone, , Sam Curran, David Willey, Adil Rashid, Reece Topley Janneman Malan, Quinton de Kock(w), Rassie van der Dussen, Aiden Markram, , David Miller, Dwaine Pretorius, (c), Anrich Nortje, ,","pubDate":"2022-07-24 17:26:49","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Williamson To Lead New Zealand In Upcoming T20I, ODI Series vs WI","link":"https://sports.ndtv.com/cricket/kane-williamson-to-lead-new-zealand-in-upcoming-t20i-odi-series-vs-west-indies-3189676","keywords":null,"creator":null,"video_url":null,"description":"New Zealand Cricket (NZC) on Sunday confirmed that Kane Williamson will be leading the BlackCaps in the upcoming T20I and ODI series against the West Indies.","content":null,"pubDate":"2022-07-24 17:08:51","image_url":"https://c.ndtvimg.com/2021-11/v2v0f8mg_kane-williamson-afp_625x300_17_November_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket moves to second season to India from Oman","link":"https://www.sentinelassam.com/sports/cricket/legends-league-cricket-moves-to-second-season-to-india-from-oman-604215","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Legends League Cricket, the global T20 league announced the shifting of the second season to India from Oman.","content":"NEW DELHI: The Legends League Cricket, the global T20 league on Saturday announced the shifting of the second season to India from Oman. \"Keeping in mind the huge fan base in India for the legends of the game and the first season's response received from India, LLC has decided to shift the base to India for the upcoming season in September 2022,\" said a statement. During season two, the Legends League Cricket will add more excitement with more than 110 legends from the sport competing in the tournament. The cricket grounds are being decided upon for the league which is starting from September 20, 2022. IANS Also read: Eoin Morgan to play in Legends League Cricket Also Watch:","pubDate":"2022-07-24 17:06:06","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/24/367957-legen.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Shikhar Dhawan, Shubman Gill guide India to 3-run win in first ODI","link":"https://www.sentinelassam.com/sports/cricket/shikhar-dhawan-shubman-gill-guide-india-to-3-run-win-in-first-odi-604213","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India skipper for the ODI series Shikhar Dhawan and young opener Shubman Gill came up with a century partnership","content":"PORT-OF-SPAIN: India skipper for the ODI series Shikhar Dhawan and young opener Shubman Gill came up with a century partnership as the tourists first piled up a massive 308/7 in 50 overs before winning the nerve-wracking opening game of the three-match series by three runs at the Queen's Park Oval on Saturday (IST). While Dhawan missed the century by just three runs, Gill, returning to the playing XI in ODIs for the first time since December 2020, played with a point to prove, scoring a magnificent 64 off just 53 balls. The 22-year-old Gill showed tremendous class as he smashed the West Indies pacers for boundaries inside the powerplay, racing to 41 off 28 balls in the first 10 overs and bringing up his maiden ODI half-century soon off just 36 balls. At the other end, Dhawan played second fiddle but kept scoring at a healthy rate as the duo brought up their 100-run partnership in just 14 overs. The captain too managed to get to his half-century, his 36th in ODI cricket. With both the batters scoring at a fast clip, it needed something special to break the partnership and Nicholas Pooran came up with a brilliant direct hit to dismiss Gill for 64. West Indies managed to slip in a few quiet overs but the pairing of Shikhar Dhawan and Shreyas Iyer batted with composure to ensure the hosts didn't make any more inroads. Iyer faced a few short-pitched deliveries but tore the spinners apart. Dhawan looked set for his 18th career ODI ton but a superb catch by Shamarh Brooks brought his innings to an end just three runs short of a century. Iyer (54) too fell soon after his fifty. With 14 overs to go, India were in complete control at 231/3 and looked on course to posting a massive total. But the West Indies bowlers fought back brilliantly to keep pegging at the wickets and pushing the visitors back. Deepak Hooda and Axar Patel made decent contributions to take India past 300, finishing at 308/7. Despite losing Shai Hope early in the innings, the West Indies chase was off to a great start thanks to a 117-run second-wicket partnership between Kyle Mayers (75) and Shamarh Brooks (46) who set the platform for their teammates. Brandon King (54) anchored the chase well, bringing up his third ODI fifty while constantly losing partners at the other end. West Indies needed only 120 runs in the last 15 overs with seven wickets. They were looking at a historic run chase but the Indian bowlers had other plans. First Mohammed Siraj dismissed the dangerous Nicholas Pooran (25) and Rovman Powell (6) soon followed his captain back to the pavilion as Yuzvendra Chahal bagged the first of his two wickets. Akeal Hosein (32 not out) and Romario Shepherd (39 not out) put a late blitz bringing their side within 38 runs off the target with the last three overs to go. Despite the late onslaught, the India pacers weathered the storm with Siraj successfully defending 15 runs in the final over. Brief scores: India 308/7 in 50 overs (Shikhar Dhawan 97, Shubman Gill 64, Shreyas Iyer 54; Alzarri Joseph 2/61, Gudakesh Motie 2/54) beat West Indies 305/6 in 50 overs (Kyle Mayers 75, Shamarh Brooks 46, Brandon King 54, Akeal Hosein 32 not out, Romario Shepherd 39 not out) by three runs. IANS Also Read: Shikhar Dhawan-led India start as favourites against struggling West Indies Also Watch:","pubDate":"2022-07-24 16:52:17","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/24/367955-shika.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Jonny Bairstow wants to play all formats for 'as long as possible'","link":"https://www.sentinelassam.com/sports/cricket/jonny-bairstow-wants-to-play-all-formats-for-as-long-as-possible-604212","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"England batter Jonny Bairstow said he wants to play all three formats of the game for “as long as possible”","content":"MANCHESTER: England batter Jonny Bairstow said he wants to play all three formats of the game for \"as long as possible\", despite his team-mate, all-rounder Ben Stokes recently retiring from ODI cricket at the age of 31 and Australia batter Usman Khawaja admitting that it is tough playing all formats in international cricket. \"I don't know if it's good or bad that I'm one of the last all-format players. But naturally there are challenges, we've seen that over a period of time now. We only had to look at the Test series this summer when there was the one-day squad in Holland at the same time. \"I think even if you look at the back end of this summer as well, there are the seven T20s in Pakistan that pretty much overlap with the last Test match. And it even goes back to the last World Cup where then you fly straight to the Ashes with a week's preparation after quarantining, then straight into the Test match,\" said Bairstow to Sky Sports Cricket. In the home summer for England this year, Bairstow is one of the very rare all-format players. He played in Tests against New Zealand and India, playing a huge hand in victories. He then played ODIs against India and is featuring in 50-over matches against South Africa. Bairstow will play the T20Is against the Proteas and is scheduled to play three matches in The Hundred before Test series against South Africa comes. \"But you know me well enough now: I'll be trying to play all of them for as long as possible. I'll be going all out for as long as I can. There might come a time when you do have to make a decision for different reasons, but that's part and parcel of life and cricket. \"In the near future I can't see me making a choice because I'm loving being part of all three squads. They're all individual squads and they're great to be a part of. It's exciting. You go into a new one and you've got a freshness and new faces and energy around them, because you're going into a new format,\" added Bairstow. Amidst the talk over future of bilateral series, especially of the 50-over cricket at risk, Bairstow insisted he still loves ODIs and warned young players of the danger in committing only to T20 cricket. \"I think it is a really good format. The journey we have been on as a group to get to (winning) the 2019 World Cup was amazing. \"I also think that 50-over cricket is in some ways a stepping stone into Test cricket. You get worked over for longer, you sometimes have to grind out difficult periods and play good cricket shots. The middle overs, especially are a lot like Test cricket. \"There is the lure of playing in T20 leagues and making a quick buck, let's be honest about that. But, everything comes from your basic technique, which you learn in four-day cricket - and then you expand from that.\" Citing the example of premier England batter Joe Root, Bairstow elaborated, \"Look at (Joe) Root, for instance, his technique is fantastic and then he takes that from Test cricket to 50-over cricket, to T20 cricket... and all he does is expand his game.\" IANS Also Read: \"Jonny Bairstow Going Through Hot Streak Batters Get Once or Twice in Their Career\": Michael Vaughan Also Watch:","pubDate":"2022-07-24 16:47:51","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/24/367954-johh.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes in ODI retirement speech...'Keep pushing yourselves to absolute extremes'","link":"https://www.sentinelassam.com/sports/cricket/ben-stokes-in-odi-retirement-speechkeep-pushing-yourselves-to-absolute-extremes-604211","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"On July 19, all-rounder Ben Stokes retired from ODI cricket after the first match against South Africa at his home ground in Durham.","content":"MANCHESTER: On July 19, all-rounder Ben Stokes retired from ODI cricket after the first match against South Africa at his home ground in Durham. Stokes, who captains England in Test cricket, cited playing three formats in international cricket was \"unsustainable\" in a hectic cricketing schedule. After the match ended in a 62-run defeat, Stokes gave a stirring speech in the dressing room, posted by England on their official Twitter account. In the video, Stokes was seen urging his team-mates to keep pushing themselves to absolute extreme so as to realise their actual capabilities. \"I just want to say for the team going forward, Jos (Buttler) has always mentioned is just keep pushing the boundaries of what we do on that cricket field. Whether it will be with bat, ball or field, take yourselves to the extremes because that's when we are able to go out and do stuff like no one else can do as a team. Not many teams still feel like, I personally was there today and feeling we're still in the game even with four overs left to go. \"Not many teams can feel like that when they are seven or eight down because of what we have got in this dressing room. In the field as well, we've got some unbelievable athletes and just keep pushing ourselves to the absolute extremes to realise what we are all capable of. If you don't do that and you don't test that out when you are training, you are probably never going to know what your limit is,\" said Stokes in the beginning of his speech. Stokes ended his ODI career at 105 matches, making 2924 runs with a batting average of 39 and a strike rate of 95, including three centuries and 21 half-centuries. He also picked 74 wickets at an average of 42.39 and economy rate of 6.05. He had strong words of advice and encouragement for white-ball skipper Jos Buttler, who is in his first month of being the England ODI and T20I captain since international retirement of Eoin Morgan. \"To Jos, never doubt yourself, never doubt any decisions you make, as a leader and as a captain. You are an incredible human being and an incredible player. Whatever you do, for a fact that you are going to have all ten blokes in the field to follow you. You are one of those blokes who ooze class. People want to do things for you because of just the person you are, never mind the cricketer.\" IANS Also Read: Van der Dussen stars as South Africa spoil Stokes' ODI farewell - Onmanorama Also Watch:","pubDate":"2022-07-24 16:44:25","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/24/367953-ben.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Rain washes out ODI to leave series squared","link":"https://www.thestar.com.my/sport/cricket/2022/07/25/cricket-rain-washes-out-odi-to-leave-series-squared","keywords":null,"creator":null,"video_url":null,"description":"LEEDS, England (Reuters) - England’s decisive one-day international against South Africa at Headingley on Sunday was abandoned because of rain, with South African opener Quinton de Kock agonisingly short of a century. Read full story","content":null,"pubDate":"2022-07-24 16:30:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/25/1671305.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"West Indies vs India Live Score Ball by Ball, West Indies vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-live-score-over-2nd-odi-odi-36-40-updates-3189543","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between West Indies vs India from Queen's Park Oval, Port of Spain, Trinidad. Check commentary and full scoreboard of the match.","content":"Follow the West Indies vs India, 2022 live cricket score on Sports.NDTV.com . After 40.1 overs, West Indies are 219/3. Get live score, ball by ball commentary and much more. Keep track of West Indies vs India, 2022 today match between West Indies and India. Everything related to West Indies and India match will be available on Sports.NDTV.com . Stay updated with West Indies vs India live score. Do check for West Indies vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 39.6 overs (0 Run) Back of a length and on off, Nicholas Pooran opens the face of his bat and eases it towards backward point. 39.5 overs (1 Run) Fuller one again, this is pushed towards long on for a single. 39.4 overs (0 Run) Fractionally fuller this time and outside off, Hope takes a step forward and pushes this straight to the cover fielder. 39.3 overs (0 Run) On a length and on middle, this is defended out solidly. 39.2 overs (1 Run) Slightly shorter one, Nicholas Pooran pulls it towards deep square leg for one. 39.1 overs (0 Run) Bowls it outside off, Nicholas Pooran dances down the track and swings his bat but gets a bottom edge as the ball bounces towards the keeper. 38.6 overs (1 Run) 50 up for Nicholas Pooran. A low full toss, Nicholas Pooran pushes it to long off for one. It's been an exceptional knock from him so far, but he will want to go on till the end. 38.5 overs (6 Runs) SIX! Goes wide outside off, Nicholas Pooran steps down the pitch, fetches it from outside off, and smashes it over long off for a biggie again! He moves to 49 now. 38.4 overs (0 Run) Outside off this time, Nicholas Pooran eases it towards the cover fielder. 38.3 overs (6 Runs) SIX! Tossed up on middle, Nicholas Pooran uses his feet and smashes it over long on for a maximum. He moves to 43 now. 38.2 overs (1 Run) On off, this is eases towards covers for one. 38.1 overs (0 Run) Tosses it on middle with a hint of turn, Shai Hope steers it towards point and straight towards the fielder. 37.6 overs (0 Run) Serves a fuller one this time, Nicholas Pooran looks to drive it but misses as the ball goes towards the keeper. 37.5 overs (1 Run) Slightly shorter one, Shai Hope punches it towards point and takes one. 37.4 overs (0 Run) Sticks to his line bowling it outside off, Shai Hope hits it but finds the fielder at point. 37.3 overs (1 Run) Outside off this time, Nicholas Pooran eases it towards backward point for one. 37.2 overs (0 Run) Delivers a shorter one on middle, Nicholas Pooran looks to pull it but misses. 37.2 overs (1 Run) Bowls it outside off again, Nicholas Pooran looks to slap it but misses. Oh, its a no ball. Free Hit coming up! 37.1 overs (1 Run) Starts with a length ball outside off, Shai Hope cuts it towards point for one. Shardul Thakur comes back to bowl. He went for 13 runs in his first over! 36.6 overs (0 Run) On off, defended away. 36.5 overs (0 Run) Fuller one on middle, Nicholas Pooran swings it but doesn't connect well. The ball rolls towards the fielder at mid on. 36.4 overs (1 Run) Good length and on middle, Hope on the back foot tucks it to deep square leg for a single. 36.3 overs (1 Run) Slightly shorter one this time, Nicholas Pooran uses his feet and hits it hard but finds the fielder at long on. Single taken. 36.2 overs (1 Run) On off, Shai Hope hits it towards point where Shardul Thakur stops it diving to his left. They take a single. 36.1 overs (1 Run) Fuller one on off, Nicholas Pooran eases it towards long on for one. 35.6 overs (1 Run) Slightly shorter one on off, Nicholas Pooran looks to block it but gets a thick outside edge as the ball rolls towards the third man. They cross. 35.5 overs (0 Run) Bowls it outside off, Nicholas Pooran looks to play at it but misses. 35.4 overs (1 Run) This one lands down the leg side, Shai Hope flicks it towards short fine leg and rotates the strike. 35.3 overs (1 Run) Flicks a fuller ball towards mid on for a single. 35.2 overs (0 Run) On a length and down the middle, this is defended solidly off the front foot. 35.1 overs (0 Run) Touch fuller and on off, Nicholas Pooran flicks it but finds the fielder at mid on.","pubDate":"2022-07-24 16:19:37","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637942961685211818.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Tim David will be a massive asset if he is in Australia squad for T20 WC: Ricky Ponting","link":"https://www.sentinelassam.com/sports/cricket/tim-david-will-be-a-massive-asset-if-he-is-in-australia-squad-for-t20-wc-ricky-ponting-604206","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former Australia skipper Ricky Ponting believes power-hitter Tim David has all the qualities needed to win the ICC T20 World Cup if he is selected in the national side","content":"HOBART: Former Australia skipper Ricky Ponting believes power-hitter Tim David has all the qualities needed to win the ICC T20 World Cup if he is selected in the national side, adding the 26-year-old reminded him of \"Andrew Symonds back in the 2003 (ODI) World Cup\". Australia are the reigning T20 World Cup champions and will get a chance to defend the title when they host the tournament in October-November this year. Though David has yet to make his Australia debut despite setting the global T20 circuit alight with his finishing flourish over the past few years, he has shown his ability to hit the ball hard in the Indian Premier League. The middle-order power-hitter is currently the format's third-highest run-getter worldwide this year with 1,002 runs at a strike rate of 183.51, according to cricket.com.au. He finished the IPL as the lucrative league's leading striker among batters to have faced more than 25 balls — 186 runs at a strike rate of 216.27 from eight matches. \"If I was a selector, I'd love to have someone like that in my team,\" Ponting was quoted as saying in the report. \"He's an out and out match winner. He's the sort of player that could actually win you a World Cup; he's not just the average run of the mill guy that might just sneak into a squad. \"He actually reminds me a bit of (late) Andrew Symonds back in the 2003 (ODI) World Cup. You know that if you get them in and give them an opportunity that they're a chance of winning a tournament for you. That's how I'd be looking at him right now and I know there's some other quality players in the middle-order for Australia but probably none of them boasts a resume as good as Tim's over the last two years,\" added Ponting. IANS Also Read: If India drop Kohli for T20 World Cup, it will be hard for him to get back in: Ponting Also Watch:","pubDate":"2022-07-24 16:11:26","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/24/367948-tim.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies vs India: West Indies vs India, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-live-score-over-2nd-odi-odi-31-35-updates-3189474","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between West Indies vs India from Queen's Park Oval, Port of Spain, Trinidad. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 35.3 overs, West Indies are 192/3. The live updates of West Indies vs India scorecard is also available. It is the perfect platform to follow your favourite teams in West Indies vs India, 2022. Keep a track on your favourite batsmen and bowlers through West Indies vs India, 2022 today match, ball by ball commentary, West Indies vs India, West Indies vs India live score, West Indies vs India scorecard. Follow the excitement of the West Indies vs India, 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 34.6 overs (1 Run) Slightly shorter one, Nicholas Pooran waits for the ball and punches it towards long on for one. 34.5 overs (2 Runs) Goes fuller again, Nicholas Pooran drives it through covers for a brace. 34.4 overs (0 Run) This one lands fuller and on middle, Nicholas Pooran defends it back towards the bowler. 34.3 overs (0 Run) Length ball and on off, Pooran clears his front leg and chops it towards cover-point region. 34.2 overs (6 Runs) SIX! Goes flatter and on middle, Nicholas Pooran dances down the track and smashes it over long on for a maximum. 34.1 overs (0 Run) Yuzvendra Chahal bowls a flatter one outside leg, Nicholas Pooran looks to sweep it but misses. 33.6 overs (0 Run) A dot to end then! Fuller and on middle, this is jammed out to mid off. 33.5 overs (1 Run) Siraj goes full again and on middle, this is clipped towards mid-wicket for a single. 33.4 overs (1 Run) A single as this is worked down to fine leg. 33.3 overs (1 Run) That was a very risky run! On off, this is pushed to mid on and Pooran takes off. The fielder runs in, picks the ball up and has a shy at the bowler's end but misses. 33.2 overs (0 Run) Good length and on off, this is kept out. 33.1 overs (2 Runs) Two more! On middle, very full, this is worked through mid-wicket for a couple. DRINKS! After losing two quick wickets, West Indies once again have started scoring runs freely. Nicholas Pooran and Shai Hope have put together an unbeaten stand of 47 so far. They will be aiming to go on till the end and help their team to get over the 300-run mark. While India continues to look for wickets. A few quick wickets from here and they can shift the momentum towards them. A crucial passage of play coming up! Also, Mohammed Siraj comes back into the attack. 32.6 overs (0 Run) Close! The slider, on middle, Hope plays a little outside the line, he gets an inside edge onto the pads. 32.5 overs (0 Run) Gives it air and lands it on off, this is pushed to cover. 32.4 overs (1 Run) Playing Chahal watchfully! On middle, this is worked through square leg for one. 32.3 overs (0 Run) Two dots in a row! On middle, this is worked to mid-wicket. 32.2 overs (0 Run) Nicely flighted, lands it on off, kept out. 32.1 overs (1 Run) Tossed up outside off, Hope strokes it through covers for one. Yuzvendra Chahal comes back to bowl! 31.6 overs (1 Run) A biggie and a couple of singles from the over. Decent one despite going for a biggie from Hooda. On middle, this is eased down to long on for one. 31.5 overs (1 Run) Shorter and outside off, this is slapped through covers for one. 31.4 overs (0 Run) Yet another dot! On middle, Pooran plays it back to the bowler. 31.3 overs (0 Run) Hooda now fires this one in on middle, it is played back to the bowler. 31.2 overs (6 Runs) SIX! That is a serious shot! Excellent use of the feet, gets to the pitch of it and creams it over the wide long off fence for a biggie. 31.1 overs (0 Run) Flatter and on middle, defended. 30.6 overs (0 Run) A dot to end a tidy over from Patel! On the stumps, it is pushed to cover. 30.5 overs (0 Run) Fires it on middle, defended. 30.4 overs (1 Run) Slightly shorter, this grips in the surface a touch. Pooran looks to pull, it goes off the underedge down to fine leg for one. 30.3 overs (0 Run) Well bowled! Sees the batter step out and fires it onto the pads. Pooran swings but misses to get hit on the pads. 30.2 overs (0 Run) Flatter and on off, this is pushed to covers. 30.1 overs (1 Run) Shorter and on off, this is pushed through covers for one.","pubDate":"2022-07-24 16:07:27","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637942954376513564.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Highlights, England vs South Africa, 3rd ODI in Leeds, Full cricket score: ENG, SA share series as rain plays spoilsport","link":"https://www.firstpost.com/firstcricket/sports-news/highlights-england-vs-south-africa-3rd-odi-in-leeds-full-cricket-score-eng-sa-share-series-as-rain-plays-spoilsport-10950671.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Highlights, England vs South Africa, 3rd ODI in Leeds, Full cricket score: ENG, SA share series as rain plays spoilsport","content":"Toss report: With the momentum firmly on their side following a commanding 118-run win at Manchester, England take on South Africa in the third and final One-Day International at Leeds on Sunday.South Africa won the toss in the series decider at Headingley and skipper Keshav Maharaj announced the same XI as the second game, as did his English counterpart Jos Buttler.South Africa had begun the series with a 62-run win, spoiling Ben Stokes' ODI farewell at his home ground of Chester-le-Street, Durham. The Proteas posted a challenging 333/5, propelled by Rassie van der Dussen's 134. England, in reply, kept losing wickets at regular intervals and despite Joe Root's 86, were bundled out for 271.The hosts were similarly in trouble in the second game at Old Trafford, which had been reduced to 29-overs-a-side after incessant rains delayed the start of play by more than four hours. England were reduced to 72/5 at one stage before vital contributions from the lower-middle-order propelled them past 200.South Africa were off to a disastrous start, losing four wickets for just six runs as Reece Topley ran through the top order. Though Heinrich Klaasen (33) tried mounting a comeback along with the rest of the middle-order, it was always going to be a Herculean task from thereon, and in the end, South Africa fell 17 short of the hundred mark.Teams:England: Jason Roy, Jonny Bairstow, Phil Salt, Joe Root, Jos Buttler (c/wk), Liam Livingstone, Moeen Ali, Sam Curran, David Willey, Adil Rashid, Reece Topley.South Africa: Janneman Malan, Quinton de Kock (wk), Rassie van der Dussen, Aiden Markram, Heinrich Klaasen, David Miller, Dwayne Pretorius, Keshav Maharaj (c), Anrich Nortje, Lungi Ngidi, Tabraiz Shamsi.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-07-24 16:01:26","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/Quinton-de-Kock-ENG-SA-3rd-ODI-AP-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Team India fined 20 per cent match fee for slow over rate in first ODI vs West Indies","link":"https://www.indiatvnews.com/sports/cricket/shikhar-dhawan-led-team-india-fined-20-per-cent-match-fee-for-slow-over-rate-in-first-odi-vs-west-indies-2022-07-24-794577","keywords":null,"creator":null,"video_url":null,"description":"Shikhar Dhawan-led Indian cricket team have been fined 20 per cent of their match fee owing to a slow over-rate during the first ODI vs West Indies in Trinidad.","content":"-led Indian cricket team have been fined 20 per cent of their match fee owing to a slow over-rate during the first ODI vs West Indies in Trinidad. Match Referee Richie Richardson imposed the sanction after the Shikhar Dhawan-led side was ruled to be one over short of the target after time allowances were taken into consideration. \"In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel, which relates to a minimum over rate offences, players are fined 20 per cent of their match fee for every over their side fails to bowl in the allotted time,\" the ICC stated in a statement on Sunday. Dhawan pleaded guilty to the offence and accepted the proposed sanction, so there was no need for a formal hearing. On-field umpires Joel Wilson and Leslie Reifer, third umpire Gregory Brathwaite and fourth umpire Nigel Duguid levelled the charge. India had pulled off a three-run win over the West Indies in the first ODI. As far as the 2nd ODI is concerned, West Indies won the toss and opted to bat first. I am going to bat first. Anything over 250 will be challenging. We need to build partnerships. One forced change, Motie is out and Hayden Walsh comes in. If Hope scores it's fine, if he doesn't, the other batters can chip in,\" Pooran said at the toss. Dhawan announced that Prasidh Krishna sits the 2nd ODI out, and Avesh Khan replaces him. He also added that they wanted to bat first again. I feel it's a good wicket. After the last game, we wanted to bat first again. We are well prepared and looking forward to a good game. Siraj and Prasidh bowled well. I am sure we are going to do much better today. Prasidh Krishna is out and Avesh Khan comes in,\" said Dhawan. (w), Brandon King, Shamarh Brooks, Kyle Mayers, Nicholas Pooran(c), Rovman Powell, Akeal Hosein, Romario Shepherd, Alzarri Joseph, Jayden Seales, Hayden Walsh Shikhar Dhawan(c), , Shreyas Iyer, Suryakumar Yadav, Sanju Samson(w), Deepak Hooda, Axar Patel, Shardul Thakur, Mohammed Siraj, , Avesh Khan","pubDate":"2022-07-24 16:00:12","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Jonathan Trott to take over as Afghanistan head coach","link":"https://www.sentinelassam.com/sports/cricket/jonathan-trott-to-take-over-as-afghanistan-head-coach-604204","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former England middle-order batter Jonathan Trott will take over as Afghanistan cricket team’s head coach from the tour of Ireland in August","content":"LONDON: Former England middle-order batter Jonathan Trott will take over as Afghanistan cricket team's head coach from the tour of Ireland in August, after the country's board announced the appointment of the 41-year-old on Saturday. Trott , who played over 200 international matches for England including 52 Tests and 68 ODIs, worked as a batting coach for the senior England men's team on their tour of India in 2021. He was also a mentor and batting coach for the under-19 team. He was also a part of the England Lions' coaching contingent, which accompanied the Test side for the Ashes in Australia, serving as their batting consultant. \"I'm honoured and excited to have the opportunity to take one of international cricket's most exciting teams through what is a huge year for their development as a team,\" Trott was quoted as saying by ICC. \"I can't wait to get to work with a group of players who are clearly capable of generating results in a style that will make the people of Afghanistan proud.\" Afghanistan are set to tour Ireland for five T20Is in the second week of August. IANS Also Read: Remain positive, look for runs: Jonathan Trott on England approach Also Watch:","pubDate":"2022-07-24 15:59:43","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/24/367946-jona.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"New Zealand ride on Glenn Phillips, Daryl Mitchell stand to sink Ireland","link":"https://www.sentinelassam.com/sports/cricket/new-zealand-ride-on-glenn-phillips-daryl-mitchell-stand-to-sink-ireland-604202","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Riding on an 82-run partnership between Daryl Mitchell and Glenn Phillips","content":"BELFAST: Riding on an 82-run partnership between Daryl Mitchell and Glenn Phillips, New Zealand made a clean sweep of the three-match T20I series against Ireland, defeating the hosts by six wickets in the third game at the Civil Service Cricket Club here. With this win, the Black Caps have ended their limited-overs series against Ireland with wins in both the T20Is and the three-match ODI series. Electing to bat first, Paul Stirling started off Ireland's innings with a bang, but from 79/2 in 10 overs, the hosts' middle-order misfired to leave them at 108/5 after 16 overs. The innings seemed to be heading towards an ordinary total despite Stirling's promising innings. Harry Tector tried to turn things around with two boundaries off the first two balls of the 17th over, but a big heave next ball saw him holing out to leave Ireland in further trouble. However, Curtis Campher joined hands with Mark Adair and things started looking up for Ireland from thereon. The pair put on a 58-run partnership in 21 balls as Ireland smashed 50 runs in the last three overs. Four fours and four sixes came off the three overs as Ireland posted a competitive 174 on board. Ireland, however, managed to pull things back with the wicket of Guptill. George Dockrell had created chances twice in succession against Glenn Phillips only to see two catches go down. But he found reward at the other end with the big wicket of Guptill the very next ball. After 10 overs, the game was in the balance with New Zealand on 83/3. Phillips and Daryl Mitchell took over from there to build a steady stand. In the first six overs of the partnership, only two boundaries came as New Zealand ambled along to 112/3 in 14 overs. With 63 needed in six overs, Mitchell and Phillips turned the game on its head with a 20-run over against Campher. While Joshua Little had Mitchell out caught and bowled for 48 in 32 balls in the 17th over, the 82-run stand between Phillips and Mitchell had all but sealed the match for New Zealand. Phillips stayed on to complete his half-century and take New Zealand home with six balls to spare and give New Zealand a 3-0 series victory. Brief scores: Ireland 174/6 in 20 overs (Paul Stirling 40, Lorcan Tucker 28, Mark Adair 37 not out) lost to New Zealand 180/4 in 19 overs (Martin Guptill 25, Glenn Phillips 56 not out, Daryl Mitchell 48; Josh Little 2/33) by six wickets. IANS Also Read: New Zealand escape with one-run win against Ireland; Clinch ODI Series 3-0 Also Watch:","pubDate":"2022-07-24 15:49:21","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/24/367944-nz.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"}]}