{"newsArray":[{"title":"Aussie champs hailed for inspiring cricket","link":"https://thewest.com.au/sport/world-cup-soccer/aussie-champs-hailed-for-inspiring-cricket-c-6315993","keywords":null,"creator":["Ian Chadband"],"video_url":null,"description":"Australia's women world champions have been saluted by English cricket for \"setting the standard\" in the modern game.","content":null,"pubDate":"2022-04-03 22:02:27","full_description":"English cricket has hailed the mastery of Australia's all-conquering women's global champions, admitting the rest of the world is playing catch-up. Following their supreme World Cup final triumph over England in Christchurch on Sunday, the Aussie women were saluted by Nasser Hussain for \"setting the standard for world cricket\". And Clare Connor, the managing director of England women's cricket, reckoned the brilliance of one of global sport's finest teams should act as an inspiration for the rest of their pursuers. Former England men's captain Hussain, who watched Australia's win at the Hagley Oval, told Sky Sports: \"Australia have been clinical, but not just here. \"They've won 40 of their last 42 in this World Cup cycle, and they are setting the standard for world cricket. Don't miss the latest sports news! Was $13 now $7 per week for 12 weeks* (Digital + Print) Enjoy unlimited access to thewest.com.au and everyday digital editions on any device. Thursday - Monday papers home delivered with all of the latest footy news! \"They look trim, they look athletic, their skills are perfect and the depth to their cricket is just remarkable. \"Say if Ellyse Perry hadn't played today, (Annabel) Sutherland would have played and they'd have been just as good. \"And that's talking about Perry, one of the great cricketers ever to play the game.\" Connor called the 71-run win a \"remarkable, almost once-in-generation performance\" from the Australians, highlighted by Alyssa Healy's 170, perhaps the all-time greatest World Cup knock. \"The rest of the world is really playing catch-up with the Australians' depth in terms of domestic structures, pathways, investment, the prioritisation that Cricket Australia has given the women's game over a number of years,\" said Connor. \"For all of us, that's inspirational and it gives us even greater motivation to make sure that the women's game says, 'that's the standard we have to meet'. \"But it doesn't happen by magic. It happens over years of investment, focus, dedication, resources and culture. \"And that's what Australian cricket has done brilliantly and what's given this women's team the platform to put in that sort of performance.\" Charlotte Edwards, England's former World Cup-winning captain, was also left in awe of the strength-in-depth of the Australian team. \"Had we have lost Nat Sciver (who scored an unbeaten 148 in a lost cause in England's reply), we wouldn't have been able to replace her,\" said Edwards. \"Ellyse Perry hasn't played some this tournament and Annabel Sutherland has just stepped up. That's the depth Australia have got. \"Australia have been professional for eight years, we've been professional for two years. \"Hopefully we'll learn from what Australia have done over the last eight, nine years, how they've created this depth of talent. \"They've been mightily impressive. They've set the standard in the game now and everyone else has got to catch them. \"But I look forward to our players being able to play with and against them this summer, because that's where you learn most.\"","image_url":"https://images.thewest.com.au/publication/C-6315993/b422fac7354b046f44506d046ee7db10e59c8be8-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie champs hailed for inspiring cricket","link":"https://www.perthnow.com.au/sport/world-cup-soccer/aussie-champs-hailed-for-inspiring-cricket-c-6315991","keywords":null,"creator":["Ian Chadband"],"video_url":null,"description":"Australia's women world champions have been saluted by English cricket for \"setting the standard\" in the modern game.","content":null,"pubDate":"2022-04-03 22:02:27","full_description":"English cricket has hailed the mastery of Australia's all-conquering women's global champions, admitting the rest of the world is playing catch-up. Following their supreme World Cup final triumph over England in Christchurch on Sunday, the Aussie women were saluted by Nasser Hussain for \"setting the standard for world cricket\". And Clare Connor, the managing director of England women's cricket, reckoned the brilliance of one of global sport's finest teams should act as an inspiration for the rest of their pursuers. Former England men's captain Hussain, who watched Australia's win at the Hagley Oval, told Sky Sports: \"Australia have been clinical, but not just here. \"They've won 40 of their last 42 in this World Cup cycle, and they are setting the standard for world cricket. \"They look trim, they look athletic, their skills are perfect and the depth to their cricket is just remarkable. \"Say if Ellyse Perry hadn't played today, (Annabel) Sutherland would have played and they'd have been just as good. \"And that's talking about Perry, one of the great cricketers ever to play the game.\" Connor called the 71-run win a \"remarkable, almost once-in-generation performance\" from the Australians, highlighted by Alyssa Healy's 170, perhaps the all-time greatest World Cup knock. \"The rest of the world is really playing catch-up with the Australians' depth in terms of domestic structures, pathways, investment, the prioritisation that Cricket Australia has given the women's game over a number of years,\" said Connor. \"For all of us, that's inspirational and it gives us even greater motivation to make sure that the women's game says, 'that's the standard we have to meet'. \"But it doesn't happen by magic. It happens over years of investment, focus, dedication, resources and culture. \"And that's what Australian cricket has done brilliantly and what's given this women's team the platform to put in that sort of performance.\" Charlotte Edwards, England's former World Cup-winning captain, was also left in awe of the strength-in-depth of the Australian team. \"Had we have lost Nat Sciver (who scored an unbeaten 148 in a lost cause in England's reply), we wouldn't have been able to replace her,\" said Edwards. \"Ellyse Perry hasn't played some this tournament and Annabel Sutherland has just stepped up. That's the depth Australia have got. \"Australia have been professional for eight years, we've been professional for two years. \"Hopefully we'll learn from what Australia have done over the last eight, nine years, how they've created this depth of talent. \"They've been mightily impressive. They've set the standard in the game now and everyone else has got to catch them. \"But I look forward to our players being able to play with and against them this summer, because that's where you learn most.\"","image_url":"https://images.perthnow.com.au/publication/C-6315991/b422fac7354b046f44506d046ee7db10e59c8be8-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australian women’s cricket team win World Cup 2022: Moment that made Meg Lanning’s team great, Alyssa Healy, Ellyse Perry, video, highlights","link":"https://www.foxsports.com.au/cricket/icc-womens-world-cup/australian-womens-cricket-team-win-world-cup-2022-moment-that-made-meg-lannings-team-great-alyssa-healy-ellyse-perry-video-highlights/news-story/bc4274cb8c21e8aee7cfeceb1d120bb7","keywords":null,"creator":null,"video_url":null,"description":"Five years of pain, frustration and toil was all worth it when Ash Gardner took the final catch off Jess Jonassen to seal Australia’s World Cup triumph in Christchurch on Sunday.","content":null,"pubDate":"2022-04-03 20:00:00","full_description":"Five years of pain, frustration and toil was all worth it when Ash Gardner took the final catch off Jess Jonassen to seal Australia’s World Cup triumph in Christchurch on Sunday. It was in Derby, England, that the inspiration for Australia’s incredible dynasty was formed. Favourites against India, Australia were shocked in the 2017 World Cup semi-finals and were dumped out of the tournament. India made 4-281 and Australia were bowled out for 245 to go down by 36 runs. For the seven players who took the field at Hagley Oval against England, they carried an axe to grind over the next five years. Watch AUS vs ENG in The ICC Women’s Cricket World Cup Final LIVE & FREE on Kayo Freebies this Sunday 3rd April 11AM. Join Kayo Freebies Now > Ellyse Perry reacts after Australia’s 2017 World Cup semi-final loss. Photo: Getty Images Source: Getty Images With Matthew Mott at the helm, he challenged Australia’s players about what kind of team they wanted to become. What style of cricket they wanted to be known for. Between the two campaigns Australia never lost an ODI series to anyone, they won two T20 World Cups and won 26 straight matches, so it wasn’t a surprise that they went through the tournament unbeaten. Cricket Australia also built on their Women’s Big Bash League, providing an opportunity and pathway for people like leg-spinner Alana King to gain experience on the big stage before a seamless transition into international cricket. Australia captain Meg Lanning reacts after crashing out against India in the 2017 World Cup semi-final on July 20, 2017 in Derby. Photo: Getty Images Source: Getty Images Ellyse Perry was one of the seven who lost against India and paid tribute to the mindset change that was the catalyst for their sustained success. “I guess just a shift in attitude and mindset to really take the game on all the time,” Perry said. “And I think in doing that, we’ve put ourselves in lots of different situations and something that really stood out for me is just the way that the group has dealt with pressure along the way. It hasn’t all gone our way at different points in time, we’ve certainly been challenged, but we’ve always found our way through that and I think that’s a huge shift from back in 2017. “Just that mentality and poise under pressure, particularly from our leaders but across the board, it’s just been great.” READ MORE ‘Greatest team ever’: Australia’s five-year plan complete as Lanning’s girls win WC Australian team celebrate their World Cup victory. Photo: AFP Source: AFP Few World Cups are won without first coming out the other end. Both Australia’s men’s campaigns of 1999 and 2003 survived giant scares to win the trophy, while Ricky Ponting’s men that lost the Ashes in 2005 have often said the pain was the driver for their whitewash in the summer of 2006-07. And so it proved to be the case for Meg Lanning’s side, who called upon every player throughout the series. From Beth Mooney’s heroics in the pool stages to Darcie Brown’s speed, King’s fine leg-breaks to Australia’s openers Alyssa Healy and Rachael Haynes who were simply astonishing in setting their two finals matches up. “Obviously that was a crucible moment for our group to finish off 2017 the way it did,” Haynes said. “It didn’t exactly go to plan, but I think a big moment for our team was just understanding how we wanted to play the game and getting really clear in our roles and executing under pressure. “So to be able to build on that and have such a consistent performance and style of play over a long period of time, and then bring that life into this tournament, is really special.” King claims 3 PEACHES to help Aussies! | 01:15 Australia’s team were labelled the “greatest” women’s side to grace the field by Nasser Hussain and Ian Smith. Both men have been involved in cricket and punditry for decades. They were the seventh Australian side to win the women’s World Cup, but what separates Meg Lanning’s side is the bar continues to be raised. Four of the top five run-scorers for the tournament were Australians. Healy’s 170 came off the back of a century in the semi-final, while Lanning scored runs throughout the series and Mooney and Haynes cashed in too. Jonassen and King, who only started her international career at the start of the year, featured in third and fourth spot for the most wickets taken. “I would have told them they’re joking and they’re probably smoking something that they shouldn’t,” King quipped after she was asked what she would have said if someone told her she would have been a World Cup winner. Australia captain Meg Lanning celebrates with teammate Jess Jonassen after the final ball. Photo: Getty Images Source: Getty Images But her seamless transition tells a story about the culture and belief within the squad. “It’s a big family in the Australian camp, that’s for sure,” she said. “The moment I walked in I was welcomed with open arms and felt like I fit in straight away and that’s just a credit to the girls and the culture they’ve built over the past few years. To welcome someone fresh from the WBBL into a national side like they did to me, I couldn’t ask for a better group of girls to be around.” You could not break the smile on Lanning’s face, a captain who rarely breaks from her unrelenting desire for success, such was the relief from winning the World Cup. “I think we’ve been extremely consistent over a long period of time and it’s been a massive build-up to this tournament and a long time coming, we’ve felt like we’ve waited for a long period of time, and to come out and perform so well throughout the whole tournament is pretty amazing,” the victorious captain said. Australia players and coaching staff sit in a circle in the pitch after winning the World Cup. Photo: Getty Images Source: Getty Images Reminded of her decision to make the side watch the semi-final defeat again, Lanning said the integration and injection of youth was crucial in their overall success. “We came over with a squad mentality,” she said. “We knew we needed a number of different people contributing, which we’ve had throughout the tournament, and it’s just been so great to see the team evolve over time. “We’ve had some young players come in and perform really well and make an impact straight away, which has been great for the team and great for the more experienced players to keep pushing them to get better, and off the field we’ve had great support from coaching staff and support staff to get us to this point as well.”","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"CSK vs PBKS 2022 Man of the Match today IPL: Who is the Man of the Match yesterday IPL Chennai vs Punjab?","link":"https://thesportsrush.com/cricket-news-csk-vs-pbks-2022-man-of-the-match-today-ipl-who-is-the-man-of-the-match-yesterday-ipl-chennai-vs-punjab/","keywords":["Cricket","CSK","IPL 2022","Punjab Kings","chennai super kings","csk","Indian Premier League","Liam Livingstone","PBKS"],"creator":["Dixit Bhargav"],"video_url":null,"description":"CSK vs PBKS 2022 Man of the Match: The all-rounder from Punjab Kings won his maiden match award in the IPL tonight. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, Punjab Kings beat Chennai Super Kings by 54… The post CSK vs PBKS 2022 Man of the Match today IPL: Who is the Man of the Match yesterday IPL Chennai vs Punjab? appeared first on The SportsRush.","content":"CSK vs PBKS 2022 Man of the Match: The all-rounder from Punjab Kings won his maiden match award in the IPL tonight. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, Punjab Kings beat Chennai Super Kings by 54 runs to register a thumping victory. Chasing a 181-run target, CSK were bundled out for a substandard 126 in 18 overs. Barring all-rounder Shivam Dube’s fourth T20 half-century where he scored 57 (30) with the help of six fours and three sixes, no other batter from their team managed to find any momentum whatsoever. Having lost half their side by the eighth over, a victory had become a near-impossible task for the Super Kings. Readers must note that this is the first time in the history of IPL when Chennai have lost their first three league stage matches. Kings spinner Rahul Chahar was the pick of their bowlers with bowling figures of 4-0-25-3. However, it was debutant pacer Vaibhav Arora and all-rounder Liam Livingstone’s two wickets each which changed the game for them. While Arora dismissed Robin Uthappa (13) and Moeen Ali (0) with the new ball, Livingstone sent back Dube and Dwayne Bravo (0) on successive deliveries to all but confirm a victory. CSK vs PBKS 2022 Man of the Match Playing his 12th IPL match tonight, Livingstone finally justified his potential by scoring a hard-hitting 60 (32) comprising of five fours and sixes each. Coming in to bat at No. 4 in the second over, Livingstone struck boundaries from the word go including a 108-metre six off CSK pacer Mukesh Choudhary. Punjabiyo chak te phatte @PunjabKingsIPL buraaaahhh #PBKvCSK @IPL well bowled .. vaibhav can swing both ways. Arshdeep, Rabada , Livingston outstanding catching jitesh sharma — Harbhajan Turbanator (@harbhajan_singh) April 3, 2022 In what was his 23rd T20 half-century, Livingstone batted with a strike rate of 187.50 to be a deserving candidate for the ‘Man of the Match’ award at the Cricket Club of India. “The first two games hadn’t gone my way. Good to contribute to a win. Thought the boys did brilliantly. We got to a target which we thought was defendable and our seam bowlers were outstanding in the powerplay. I’ve been swinging hard enough, nice to get a couple off the middle today,” Livingstone told Star Sports during the post-match presentation ceremony. The post CSK vs PBKS 2022 Man of the Match today IPL: Who is the Man of the Match yesterday IPL Chennai vs Punjab? appeared first on The SportsRush.","pubDate":"2022-04-03 18:01:22","full_description":"CSK vs PBKS 2022 Man of the Match: The all-rounder from Punjab Kings won his maiden match award in the IPL tonight. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, Punjab Kings beat Chennai Super Kings by 54 runs to register a thumping victory. Chasing a 181-run target, CSK were bundled out for a substandard 126 in 18 overs. Barring all-rounder Shivam Dube’s fourth T20 half-century where he scored 57 (30) with the help of six fours and three sixes, no other batter from their team managed to find any momentum whatsoever. Having lost half their side by the eighth over , a victory had become a near-impossible task for the Super Kings. Readers must note that this is the first time in the history of IPL when Chennai have lost their first three league stage matches. Kings spinner Rahul Chahar was the pick of their bowlers with bowling figures of 4-0-25-3. However, it was debutant pacer Vaibhav Arora and all-rounder Liam Livingstone’s two wickets each which changed the game for them. While Arora dismissed Robin Uthappa (13) and Moeen Ali (0) with the new ball, Livingstone sent back Dube and Dwayne Bravo (0) on successive deliveries to all but confirm a victory. Playing his 12th IPL match tonight, Livingstone finally justified his potential by scoring a hard-hitting 60 (32) comprising of five fours and sixes each. Coming in to bat at No. 4 in the second over, Livingstone struck boundaries from the word go including a 108-metre six off CSK pacer Mukesh Choudhary. Punjabiyo chak te phatte @PunjabKingsIPL buraaaahhh #PBKvCSK @IPL well bowled .. vaibhav can swing both ways. Arshdeep, Rabada , Livingston 💥 outstanding catching jitesh sharma — Harbhajan Turbanator (@harbhajan_singh) April 3, 2022 In what was his 23rd T20 half-century, Livingstone batted with a strike rate of 187.50 to be a deserving candidate for the ‘Man of the Match’ award at the Cricket Club of India. “The first two games hadn’t gone my way. Good to contribute to a win. Thought the boys did brilliantly. We got to a target which we thought was defendable and our seam bowlers were outstanding in the powerplay. I’ve been swinging hard enough, nice to get a couple off the middle today,” Livingstone told Star Sports during the post-match presentation ceremony.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"What is Dew factor in Cricket: How does dew affect cricket?","link":"https://thesportsrush.com/cricket-news-what-is-dew-factor-in-cricket-how-does-dew-affect-cricket/","keywords":["Cricket","Dew factor"],"creator":["Gurpreet Singh"],"video_url":null,"description":"What is Dew factor in Cricket: The natural dew can have a massive impact on the result during a night fixture in the game of Cricket. The ongoing 15th season of the Indian Premier League (IPL) has completed 10 of the 70 league matches. The one common occurrence before the start of each of these… The post What is Dew factor in Cricket: How does dew affect cricket? appeared first on The SportsRush.","content":"What is Dew factor in Cricket: The natural dew can have a massive impact on the result during a night fixture in the game of Cricket. The ongoing 15th season of the Indian Premier League (IPL) has completed 10 of the 70 league matches. The one common occurrence before the start of each of these ten fixtures is captains of franchises opting to bowl first upon winning the Toss. The reason being a likely appearance of dew as the match progresses, which has significant impact on the ultimate match result. In these ten fixtures so far, teams opting to chase after winning the Toss have won eight matches. To brush it up, Dew refers to the natural occurrence of small droplets of water that usually form overnight on surfaces like blades of grass due to a process known as condensation. The factor, can skew results in the chasing team’s favour during the day/night or night matches. ALSO READ: Black soil and Red soil pitch difference What is Dew factor in Cricket With most of the T20 matches likely to be night games generally due to financial reasons, the dew factor can seem to provide an unfair advantage to teams winning the Toss and deciding to field first. One might have often heard the commentators comparing the Cricket ball to a ‘bar of soap’. Their reference is towards the dew, which makes the ball wet thereby making it challenging for the fielders, and most importantly for the bowlers who go through a hard task of trying to grip the ball. One might have often noticed fielders and bowlers trying to dry the ball after almost every delivery while on the field. It is the dew factor which makes them do so. The wet ball leads the bowlers to err with their line and lengths. While an attempted yorker results in a low full toss or even a waist-height no-ball, a spinner may miss his intended length, thereby making him prone to leaking runs. Be it the second-leg of the IPL in 2021, or the T20 World Cup in UAE last year, the dew provided a massive advantage to the chasing teams right till the end of the tournament. The post What is Dew factor in Cricket: How does dew affect cricket? appeared first on The SportsRush.","pubDate":"2022-04-03 17:48:23","full_description":"What is Dew factor in Cricket: The natural dew can have a massive impact on the result during a night fixture in the game of Cricket. The ongoing 15th season of the Indian Premier League (IPL) has completed 10 of the 70 league matches. The one common occurrence before the start of each of these ten fixtures is captains of franchises opting to bowl first upon winning the Toss. The reason being a likely appearance of dew as the match progresses, which has significant impact on the ultimate match result. In these ten fixtures so far, teams opting to chase after winning the Toss have won eight matches. To brush it up, Dew refers to the natural occurrence of small droplets of water that usually form overnight on surfaces like blades of grass due to a process known as condensation. The factor, can skew results in the chasing team’s favour during the day/night or night matches. ALSO READ : Black soil and Red soil pitch difference With most of the T20 matches likely to be night games generally due to financial reasons, the dew factor can seem to provide an unfair advantage to teams winning the Toss and deciding to field first. One might have often heard the commentators comparing the Cricket ball to a ‘bar of soap’. Their reference is towards the dew, which makes the ball wet thereby making it challenging for the fielders, and most importantly for the bowlers who go through a hard task of trying to grip the ball. One might have often noticed fielders and bowlers trying to dry the ball after almost every delivery while on the field. It is the dew factor which makes them do so. The wet ball leads the bowlers to err with their line and lengths. While an attempted yorker results in a low full toss or even a waist-height no-ball, a spinner may miss his intended length, thereby making him prone to leaking runs. Be it the second-leg of the IPL in 2021, or the T20 World Cup in UAE last year, the dew provided a massive advantage to the chasing teams right till the end of the tournament.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Punjab Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-punjab-kings-live-score-over-match-11-t20-16-20-updates-2860678","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Punjab Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-03 17:33:56","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 18.0 overs, Chennai Super Kings, chasing a target of 181, are 126. The live updates of Chennai Super Kings vs Punjab Kings scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Punjab Kings, Chennai Super Kings vs Punjab Kings live score, Chennai Super Kings vs Punjab Kings scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Time for the presentation. Shikhar Dhawan is down for a chat. He says that it feels great and they made a great comeback. Tells that he was bowling well in the nets and he bowled quite well today and he kept his calm. Adds that he had a good partnership with Livingstone and he played a great knock. Says that they had a good score on the board and 180 on the board, the chasing team still needs to chase it. Adds that they just needed a good start. Ravindra Jadeja, the skipper of Chennai, says that they lost too many wickets in the Powerplay and didn't get any momentum at the start and this needs to be addressed. About Ruturaj's form, Jadeja says that they need to back him up and give him confidence as he is a class player and will come good for them. About being asked about Shivam Dube, he says that it was great to see him perform and hopes he keeps up the good work. Ends by saying that they will work hard and bounce back straonger. Time for some interviews! Chennai did well in the latter half of their bowling innings to restrict Punjab to a chaseable score. However, they had a disastrous start and they never recovered after a bad start as they kept losing wickets at regular intervals. Shivam Dube was the only one who showed some fight with a fine fifty but once he departed, it was too much for other batters and they ended up getting bundled out for just 126. The night surely belonged to the hard-hitting English all-rounder Liam Livingstone. As he smashed a brilliant fifty when his team was under the pump and then delivered a two-wicket over that just sealed the game in Punjab's favour! Punjab got to a decent total with the bat and somehow it seemed below-par to everyone on this pitch mainly due to the dew factor. However, Punjab were in the mood to prove everyone wrong. Rabada got rid of Gaikwad to set the tone but really the star of the show was the debutant, Vaibhav Arora as he bowled a brilliant spell swinging the ball both ways and got rid of in-form Robin Uthappa and Ali inside the Powerplay. Arshdeep Singh and Odean Smith continued the good work and then Livingstone delivered a killer blow to get rid of Dube who was looking good. He got two wickets in that over and in the end, Chahal finished off things with three wickets to take Punjab to a comfortable win here. All the criticism of it is being too easy for chasing teams to win the games with dew playing its part has been answered as we have seen three games on the trot where the team defending the target has won the game. However, this one is the most convincing of them all as Brabourne seems to get more dew than in Pune and Punjab will be pretty pleased with their effort. Coming to the game, they have absolutely thrashed Chennai here and have handed the defending champions their third loss on the trot. 17.6 overs (0 Run) OUT! TAKEN! That's it, Rahul Chahar cleans up the tail and wins the game for Punjab. Shorter in length, around off. Chris Jordan goes deep in his crease and tries to muscle it over the long on fence. Jordan doesn't get much timing on it and hits it straight to Liam Livingstone who takes the catch and ends a stellar individual performance with yet another contribution. Chahar ends with three wickets. PUNJAB WIN BY 54 RUNS! 17.5 overs (1 Run) Googly this time from Rahul Chahar, turning away from the left-hander. Mukesh Choudhary edges it towards point for a single. 17.4 overs (1 Run) Tossed up, on middle. Chris Jordan looks for the big heave leg side but gets a faint inside edge past the leg stump and picks up a single towards short fine leg. 17.3 overs (2 Runs) A bit dragged down, on the pads. Jordan clips it behind square on the leg side for a couple of runs. 17.2 overs (1 Run) On middle, pushed down to long on for a single. Mukesh Choudhary is the last man in. 17.1 overs (0 Run) OUT! TAKEN! What a review from the young Punjab keeper and MS Dhoni has to depart as well! Rahul Chahar spills it down the leg side and Dhoni looks to paddle it away. The umpire signals a wide straightaway. Jitesh Sharma though seems really excited behind the stumps and calls for the review, which is eventually taken. The ball seems close to the bat and the third umpire checks UltraEdge. There is a spike as the ball passes the bat and it's a brilliant take as well from Sharma behind the stumps. The on-field decision is reversed and Chahar picks up the wicket which all but seals it for Punjab. 16.6 overs (2 Runs) Flatter delivery, close to the off pole. Jordan looks to cut close to the body and gets an inside edge past the off stump and picks up a couple of runs. 60 needed now off 18 deliveries. 16.5 overs (1 Run) Shorter in length, on off. Dhoni pulls it down to deep mid-wicket for a run. 16.5 overs (1 Run) WIDE! Livingstone pushes it wide but outside the tramline. Wide called. 16.4 overs (0 Run) On middle, blocked. 16.3 overs (4 Runs) Edged and four! Around off and turning away, MSD looks to cut but ends up slicing it fine and the ball eludes the fielder at short third man to race away to the fence. 16.2 overs (0 Run) Quicker and flatter, around off. This is cut away towards point. 16.1 overs (6 Runs) SIX! MSD had to go sometime and he has put his foot on the accelarator. On off, Dhoni gets low and flat-bats it over the cow corner fence for a maximum. Chennai need many more of these. 15.6 overs (0 Run) NOT OUT! Close shave for Chris Jordan but an excellent review saves him. Flatter delivery, on a shorter length and on off stump. Jordan hops on the back foot and tries to work it leg side but gets caught on the crease. The ball crashes into the top of the pad and Rahul Chahar appeals. The finger is raised but it is eventually reviewed. There is no bat involved and Ball Tracker shows that the ball turned away just a bit and is missing off stump. Chris Jordan is the next man in. 15.5 overs (0 Run) OUT! TAKEN! Dwaine Pretorius is a goner and Rahul Chahar has the last laugh! Pretorius tries to toy with the bowler as he moves in his crease and gets the ball he is looking for it. This is short but is pushed wider. Pretorius looks to drag it over the mid-wicket fence but hits it flat and straight down the throat of Arshdeep Singh over there. Singh makes no mistake and Chennai lose their eight. 15.4 overs (2 Runs) Down the leg side, Dwaine Pretorius rocks back and works it behind square on the leg side for an easy two. 15.3 overs (0 Run) Quicker one, pushed through on off. Pretorius taps it towards extra cover. 15.2 overs (6 Runs) SIX! Well, well! Dwaine Pretorius has tonked it first ball. Tossed up, around off. Pretorius gets low and launches it over the mid-wicket fence for a biggie. 15.1 overs (1 Run) Flatter delivery, around off and turning away. Dhoni works it to deep cover for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637846238282262806.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"CSK troll memes: Twitter reactions and funniest IPL memes on CSK losing four wickets in powerplay vs PBKS 2022 IPL","link":"https://thesportsrush.com/cricket-news-csk-troll-memes-twitter-reactions-and-funniest-ipl-memes-on-csk-losing-four-wickets-in-powerplay-vs-pbks-2022-ipl/","keywords":["Cricket","CSK","IPL 2022","Punjab Kings","chennai super kings","csk","Indian Premier League","PBKS"],"creator":["Dixit Bhargav"],"video_url":null,"description":"CSK troll memes: Chennai Super Kings have registered a batting collapse in a run chase at the Brabourne Stadium tonight. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, defending champions Chennai Super Kings crumbled under pressure in the… The post CSK troll memes: Twitter reactions and funniest IPL memes on CSK losing four wickets in powerplay vs PBKS 2022 IPL appeared first on The SportsRush.","content":"CSK troll memes: Chennai Super Kings have registered a batting collapse in a run chase at the Brabourne Stadium tonight. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, defending champions Chennai Super Kings crumbled under pressure in the second innings. Chasing a 181-run target, Chennai lost their first wicket in the second over when Ruturaj Gaikwad (1) edged a Kagiso Rabada delivery to Shikhar Dhawan at first slip. Gaikwad’s opening partner Robin Uthappa’s (13) attempt of walking down and flicking debutant pacer Vaibhav Arora resulted in him top-edging the ball to Punjab Kings captain Mayank Agarwal. Been trusted by Agarwal for a third over in the powerplay, Arora justified Agarwal’s decision by sending Super Kings all-rounder Moeen Ali (0) back to the pavilion as he played on a delivery on to his stumps. No different than Ali, CSK captain Ravindra Jadeja (0) departed in the same manner although against left-arm pacer Arshdeep Singh. Introduced into the attack in the eighth over, PBKS Odean Smith created instant impact by dismissing Ambati Rayudu (13). Having lost their fifth wicket in the eighth over, Chennai were in deep trouble walking towards their third loss in a row. A 62-run partnership for the sixth wicket between all-rounder Shivam Dube (57) and former captain Mahendra Singh Dhoni did provide some respite but a required run rate in vicinity of 15 called for a near-implausible task. Punjab all-rounder Liam Livingstone, who scored a maiden IPL half-century in the first innings, dismissed Dube and Dwayne Bravo (0) on consecutive deliveries in the 15th over to quash any hopes of a CSK victory. CSK troll memes If #CSK Loses Today Match Me :-#CSKvsPBKS pic.twitter.com/sYnAdp0VK2 — Sam Rajput (@rajputsam01) April 3, 2022 Csk fans watching score of CSK in 2022. #CSK #MSDhoni #IPL2022 #CSKvsPBKS pic.twitter.com/fQDqX1gndM — Dinesh Kumar (@DineshK26726508) April 3, 2022 What’s with #CSK this season.. worse than Pune super giants their first season .. MS the visionary gave up captaincy b4 the start.. he knew ?? — cjaisree (@cjaisree) April 3, 2022 #CSKvsPBKS#Dhoni to #CSK Top Order pic.twitter.com/j2EPwjG2h6 — Baandya (@Bahut_Scope_Hai) April 3, 2022 Reason for csk downfall#CSKvsPBKS pic.twitter.com/KKlmKBpegA — SM (@dickjorsey) April 3, 2022 #Jadeja #CSKvsPBKS #MSDhoni MS Dhoni left captaincy before hand after realising what kind of team CSK built this season: pic.twitter.com/rc09i6cGx5 — Hemant (@Sportscasmm) April 3, 2022 #CSKvsPBKS CSKians right now: pic.twitter.com/C5VhDS7g6C — R A G H A V (@shutupraghuu) April 3, 2022 For more cricket-related news, click here. The post CSK troll memes: Twitter reactions and funniest IPL memes on CSK losing four wickets in powerplay vs PBKS 2022 IPL appeared first on The SportsRush.","pubDate":"2022-04-03 17:33:27","full_description":"CSK troll memes: Chennai Super Kings have registered a batting collapse in a run chase at the Brabourne Stadium tonight. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, defending champions Chennai Super Kings crumbled under pressure in the second innings. Chasing a 181-run target, Chennai lost their first wicket in the second over when Ruturaj Gaikwad (1) edged a Kagiso Rabada delivery to Shikhar Dhawan at first slip. Gaikwad’s opening partner Robin Uthappa’s (13) attempt of walking down and flicking debutant pacer Vaibhav Arora resulted in him top-edging the ball to Punjab Kings captain Mayank Agarwal. Been trusted by Agarwal for a third over in the powerplay, Arora justified Agarwal’s decision by sending Super Kings all-rounder Moeen Ali (0) back to the pavilion as he played on a delivery on to his stumps. No different than Ali, CSK captain Ravindra Jadeja (0) departed in the same manner although against left-arm pacer Arshdeep Singh. Introduced into the attack in the eighth over, PBKS Odean Smith created instant impact by dismissing Ambati Rayudu (13). Having lost their fifth wicket in the eighth over, Chennai were in deep trouble walking towards their third loss in a row. A 62-run partnership for the sixth wicket between all-rounder Shivam Dube (57) and former captain Mahendra Singh Dhoni (23) did provide some respite but a required run rate in vicinity of 15 called for a near-implausible task. Punjab all-rounder Liam Livingstone, who scored a maiden IPL half-century in the first innings, dismissed Dube and Dwayne Bravo (0) on consecutive deliveries in the 15th over to quash any hopes of a CSK victory. If #CSK Loses Today Match Me :- #CSKvsPBKS pic.twitter.com/sYnAdp0VK2 — Sam Rajput (@rajputsam01) April 3, 2022 Csk fans watching score of CSK in 2022. #CSK #MSDhoni #IPL2022 #CSKvsPBKS pic.twitter.com/fQDqX1gndM — Dinesh Kumar (@DineshK26726508) April 3, 2022 What’s with #CSK this season.. worse than Pune super giants their first season .. MS the visionary gave up captaincy b4 the start.. he knew ?? — cjaisree (@cjaisree) April 3, 2022 #CSKvsPBKS #Dhoni to #CSK Top Order pic.twitter.com/j2EPwjG2h6 — Baandya (@Bahut_Scope_Hai) April 3, 2022 Reason for csk downfall #CSKvsPBKS pic.twitter.com/KKlmKBpegA — SM (@dickjorsey) April 3, 2022 #Jadeja #CSKvsPBKS #MSDhoni MS Dhoni left captaincy before hand after realising what kind of team CSK built this season: pic.twitter.com/rc09i6cGx5 — Hemant (@Sportscasmm) April 3, 2022 #CSKvsPBKS CSKians right now: pic.twitter.com/C5VhDS7g6C — R A G H A V ✨ (@shutupraghuu) April 3, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Punjab Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-punjab-kings-live-score-over-match-11-t20-11-15-updates-2860648","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Punjab Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-03 17:07:52","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.1 overs, Chennai Super Kings, chasing a target of 181, are 99/7. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Chennai Super Kings and Punjab Kings. Everything related to Chennai Super Kings and Punjab Kings match will be available on Sports.NDTV.com . Stay updated with Chennai Super Kings vs Punjab Kings live score. Do check for Chennai Super Kings vs Punjab Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (0 Run) OUT! CAUGHT AND BOWLED! What a fantastic catch from Liam Livingstone and it has surely been his night, first with the bat and now with the ball! This is flatter one, on off. Bravo presses forward to defend but the ball goes slightly in the air left of Liam Livingstone. He moves to his left and then dives full stretch to take a superb catch. A moment of brilliance from Liam Livingstone. It seems that he has killed the chase in this over now as still 83 needede from 30 balls! Dwayne Bravo is in next. 14.5 overs (0 Run) OUT! CAUGHT! The Shivam Dube show comes to an end! Liam Livingstone gets the big wicket and now it seems a too bigger task for Chennai to win from here. This is fuller on off. Dube goes for a big heave across the line but ends up getting a thick outside edge. The ball goes towards short third man and Arshdeep Singh there takes an easy catch. 14.4 overs (2 Runs) A flatter delivery on leg. Dube works it to deep square leg for a single. 14.3 overs (1 Run) On the shorter side, on off. Dhoni cuts it to deep cover for a single. 14.2 overs (1 Run) A fuller delivery on off. Dube hits it to long on for a single. 14.1 overs (4 Runs) FOUR! Just beats the fielder and a boundary again! A full on leg. Dube goes for a big heave across the line. He gets the inside half of his blade past short fine leg for a boundary. 13.6 overs (0 Run) A full ball, on off. Dhoni blocks it out. 91 needed from 36 balls! 13.5 overs (1 Run) Much better! A yorker, outside off. Dube reaches for it and hits it to deep backward point for a single. Fifty for Shivam Dube! Brilliant knock by the hard-hitting left-hander. However, Chennai need a lot more from him if they want to cross the line today. 13.4 overs (6 Runs) SIX! Another maximum! In the slot, on off. Dube hammers it straight down the ground for a biggie. 13.3 overs (6 Runs) SIX! This time he connects and this is the power of Dube! A full ball, on off. Dube gets under it and tonks it over long on for a biggie. 13.2 overs (0 Run) Lands on a length, around leg. Dube looks to whip it away but misses. The ball hits his pads and Dube misses out again. 13.2 overs (3 Runs) NO BALL! Rabada oversteps yet again, so this will help Chennai but not much. A fuller delivery on middle. Dube works it to deep square leg for a couple. Free Hit coming up again! 13.1 overs (0 Run) Dot ball! It is too much pressure on Dube! This is very full and outside off. Dube looks to push it towards the off side but misses. 13.1 overs (2 Runs) NO BALL! On a length, on off. Dhoni works it to square leg for a single. Rabada oversteps and a Free Hit now for Dube! 12.6 overs (1 Run) On the shorter side on off. Dhoni goes back and pushes it to long on for a single. Just three from this over! 109 needed from 42 balls! 12.5 overs (0 Run) Another dot and this will not help Chennai! A flatter and quicker one, around off. Dhoni punches it to covers again. 12.4 overs (0 Run) Dot ball! A flatter delivery, outside off. Dhoni cuts it to covers. 12.3 overs (1 Run) On the pads. Dube just tucks it to deep square leg for a single. 12.2 overs (1 Run) On the shorter side, around off. Dhoni skips down the track and works it to deep mid-wicket for a single. 12.1 overs (0 Run) A fuller ball, on off. Dhoni looks to drive it away but gets the inside edge onto his pads. 11.6 overs (4 Runs) FOUR! This time he gets the boundary! He seems to carrying the confidence of the last game! It is full and outside off. Dube gets under it and drills it through covers for a boundary. 112 needed from 48 balls! They need to get going from both ends, the required rate is 14! 11.5 overs (1 Run) Singh bangs it short on middle. Dhoni with the Natraj pull to deep backward square leg for a single. 11.4 overs (1 Run) Great timing but just a single! On a length, on middle. Dube works it to deep square leg. Shahrukh Khan runs to his right and dives to stop it. 11.3 overs (1 Run) On the shorter side on middle. Dhoni pulls it to fine leg for a single. The fielder there runs to his left and stops it. 11.2 overs (0 Run) On a length, on off. Dhoni punches it to covers. 11.1 overs (1 Run) Whipped away but finds the fielder! Lands on a length, on off. Dube whips it to deep backward square leg for a single. 10.6 overs (0 Run) On the shorter side, on off. Dhoni goes back and punches it to covers. 120 needed now from 54 balls! 10.5 overs (1 Run) Goes quicker and flatter on middle. Dube looks to defend it but gets the inside edge onto his pads. The ball brushes his pads and goes towards the leg side for a single. 10.4 overs (4 Runs) FOUR! Dube is looking on great touch here! It is short and outside off. Dube punches it off the back foot through covers for a boundary. 10.3 overs (1 Run) Goes flatter and slightly shorter on middle. Dhoni works it to deep mid-wicket for a single. 10.2 overs (1 Run) A flatter delivery on middle. Dube works it to deep mid-wicket for a single. 10.1 overs (1 Run) A googly on off and it turns into Dhoni. He works it towards long on for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637846222636867337.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, CSK vs PBKS Live Score: Punjab Kings Pacers Shine As Chennai Super Kings Lose 5 In Chase Of 181 - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWNzay12cy1wYmtzLWxpdmUtc2NvcmUtdXBkYXRlcy1wdW5qYWIta2luZ3MtdnMtY2hlbm5haS1zdXBlci1raW5ncy1saXZlLXNjb3JlLTI4NjAyMDXSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, CSK vs PBKS Live Score: Punjab Kings Pacers Shine As Chennai Super Kings Lose 5 In Chase Of 181  NDTV SportsMatch Preview - Punjab Kings vs Super Kings, Indian Premier League 2022, 11th Match  ESPNcricinfoLive Cricket Score: CSK vs PBKS, Match 11, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022, CSK vs PBKS Live Score: Chennai lose 5 wickets in 181 chase  Hindustan TimesLIVE | IPL 2022, Chennai Super Kings vs Punjab Kings Match 11 Score: Dhoni-Dube Steady CSK In 181 Chase  India.comView Full coverage on Google News","content":null,"pubDate":"2022-04-03 16:49:33","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"PBKS owner 2022: Owner of Punjab Kings in 2022 IPL","link":"https://thesportsrush.com/cricket-news-pbks-owner-2022-owner-of-punjab-kings-in-2022-ipl/","keywords":["Cricket","IPL 2022","Punjab Kings","Indian Premier League","IPL","PBKS"],"creator":["Gurpreet Singh"],"video_url":null,"description":"PBKS owner 2022: The Punjab-based franchise in the Indian Premier League (IPL) is owned by four individuals since 2008. Having not won a single Indian Premier League (IPL) title in the fourteen years of the tournament’s existence, the Punjab Kings (PBKS) have arguably, come up with one of the strongest squads on paper, with a… The post PBKS owner 2022: Owner of Punjab Kings in 2022 IPL appeared first on The SportsRush.","content":"PBKS owner 2022: The Punjab-based franchise in the Indian Premier League (IPL) is owned by four individuals since 2008. Having not won a single Indian Premier League (IPL) title in the fourteen years of the tournament’s existence, the Punjab Kings (PBKS) have arguably, come up with one of the strongest squads on paper, with a good mix of flamboyant batters, all-rounders and bowlers suited for different stages of the match. With the likes of power hitters in Liam Livingstone, Odean Smith, Jonny Bairstow (yet to play for the franchise), and Shahrukh Khan to name a few, the Kings did put on display the same during their first game of the season against Royal Challengers Bangalore (RCB), wherein they chased down the target of 205/2 posted by the latter with six deliveries to spare. With the franchise set to give it their all to clinch their maiden IPL title, let’s take a look at the owners of the Punjab-based franchise who have laid the foundation stone with its acquisition in the year 2008. #SherSquad, it’s out! Get ready to cheer for us and tell us which match are you looking forward to the most? #SaddaPunjab #PunjabKings #TATAIPL2022 pic.twitter.com/P0KxebsB5d — Punjab Kings (@PunjabKingsIPL) March 6, 2022 PBKS owner 2022 With a net worth of around INR 359 Crore (as per reports), the Punjab Kings IPL franchise is owned the KPH Dream Cricket Pvt. Ltd, with Mohit Burman, Ness Nusli Wadia, Preity Zinta and Karan Paul as its directors. Mohit Burman, the promoter and director of Dabur India Ltd., holds 46% stakes in the franchise at present. Renowned Bollywood actor Preity Zinta, and Ness Wadia from the Wadia Group hold 23% stakes each in the franchise’ ownership. Karan Paul, the chairperson of Appejay Surrendra Group holds the remaining 8% stakes. The Punjab Kings, previously named Kings XI Punjab, had their best season during the 2014 edition of the league, wherein they made it to the grand finale, but lost to the Kolkata Knight Riders (KKR) by 3 wickets. The post PBKS owner 2022: Owner of Punjab Kings in 2022 IPL appeared first on The SportsRush.","pubDate":"2022-04-03 16:43:27","full_description":"PBKS owner 2022: The Punjab-based franchise in the Indian Premier League (IPL) is owned by four individuals since 2008. Having not won a single Indian Premier League (IPL) title in the fourteen years of the tournament’s existence, the Punjab Kings (PBKS) have arguably, come up with one of the strongest squads on paper, with a good mix of flamboyant batters, all-rounders and bowlers suited for different stages of the match. With the likes of power hitters in Liam Livingstone , Odean Smith , Jonny Bairstow (yet to play for the franchise), and Shahrukh Khan to name a few, the Kings did put on display the same during their first game of the season against Royal Challengers Bangalore (RCB), wherein they chased down the target of 205/2 posted by the latter with six deliveries to spare. With the franchise set to give it their all to clinch their maiden IPL title, let’s take a look at the owners of the Punjab-based franchise who have laid the foundation stone with its acquisition in the year 2008. #SherSquad , it’s out! 📢 Get ready to cheer for us and tell us which match are you looking forward to the most? 😍 #SaddaPunjab #PunjabKings #TATAIPL2022 pic.twitter.com/P0KxebsB5d — Punjab Kings (@PunjabKingsIPL) March 6, 2022 With a net worth of around INR 359 Crore (as per reports), the Punjab Kings IPL franchise is owned the KPH Dream Cricket Pvt. Ltd, with Mohit Burman, Ness Nusli Wadia, Preity Zinta and Karan Paul as its directors. Mohit Burman, the promoter and director of Dabur India Ltd., holds 46% stakes in the franchise at present. Renowned Bollywood actor Preity Zinta, and Ness Wadia from the Wadia Group hold 23% stakes each in the franchise’ ownership. Karan Paul, the chairperson of Appejay Surrendra Group holds the remaining 8% stakes. The Punjab Kings, previously named Kings XI Punjab, had their best season during the 2014 edition of the league, wherein they made it to the grand finale, but lost to the Kolkata Knight Riders (KKR) by 3 wickets.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Punjab Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-punjab-kings-live-score-over-match-11-t20-6-10-updates-2860601","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Punjab Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-03 16:35:59","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.0 overs, Chennai Super Kings, chasing a target of 181, are 53/5. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Chennai Super Kings and Punjab Kings. Everything related to Chennai Super Kings and Punjab Kings match will be available on Sports.NDTV.com . Stay updated with Chennai Super Kings vs Punjab Kings live score. Do check for Chennai Super Kings vs Punjab Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (4 Runs) Four! 9.5 overs (0 Run) Nails the wide yorker does Odean Smith. At 139.9 kpg and hugging the tramline. Dube is well beaten. We will have change of ball here! The umpires select the ball from the bunch of balls available and we are ready to resume. 9.4 overs (6 Runs) SIX! A much-needed boundary for Chennai and Shivam Dube has nailed it. Short again from Smith, around leg stump. Dube swivel-pulls it well over the backward square leg fence for a biggie. 9.3 overs (1 Run) Short of a length this time, pulled away to deep backward square leg for a single. 9.2 overs (0 Run) A bumper now, well outside off. MS Dhoni just lets it through to the keeper. 9.1 overs (1 Run) A length ball, around leg. This is swung away towards deep square leg for one. DRINKS! What a start this has been for Punjab, really a dream one! Five wickets down already and the target that was looking below-par after the first innings because of the dew factor and the nature of the pitch now seems a distant dream for Chennai. They need MS Dhoni and Shivam Dube to build a special partnership from hereon to chase this down and Punjab will be delighted with their bowlers, especially with the performance of the debutant, Vaibhav Arora. They will hope to continue the good work. 8.6 overs (0 Run) Beaten! Lovely delivery from Chahar as he gives it a lot more air and flights it up around off. Dhoni looks to drive but gets beaten in flight and there is a bit of turn as well. 8.5 overs (0 Run) Nicely bowled! MS Dhoni looks to step out and Rahul Chahar pushes it wider. Dhoni adjusts well to block it out. 8.4 overs (1 Run) Tossed up, full and on middle. Dube drives it down to long on for one. 8.3 overs (1 Run) On a length, around off. Dhoni nudges it towards cover-point for a single. 8.2 overs (0 Run) Chahar slows it up a touch and bowls it around off. The ball turns away a bit and Dhoni keeps it out. 8.1 overs (1 Run) Chahar starts off with a flatter ball on middle. Dube flicks it through mid-wicket and rotates the strike. Time for some spin now. Rahul Chahar is into the attack. 7.6 overs (1 Run) On a good length, on off. Dube works it through point for a single. 7.5 overs (0 Run) Length, on off and this is tapped towards short cover. 7.4 overs (1 Run) Short of a length, over off. Dhoni watchfully works it onto the leg side and gets off the mark with a single. MS Dhoni is the next man in. 7.3 overs (0 Run) OUT! TAKEN! Ripper of a delivery from Odean Smith and even a better catch from Jitesh Sharma to get rid of Ambati Rayudu! Smith digs in a short ball at the body and Rayudu is completely taken by surprise. Rayudu tries to get out of the way but the ball comes off the gloves and goes towards first slip. Sharma does well to delay his dive as the ball got slowed down after hitting the gloves and then flies full stretch to his right and pouches it with both hands. Odean Smith is elated and Chennai in a spot of real bother here. 7.2 overs (0 Run) Banged in short, outside off. Ambati Rayudu looks to ramp it over the keeper but doesn't make a connection. 7.1 overs (0 Run) Smith starts off with a yorker-length delivery on off. Rayudu keeps it out. 6.6 overs (0 Run) Beaten! Top delivery from Vaibhav Arora to end his spell. Pitched up, right in that channel around off and this one holds its line. Dube looks to drive but gets beaten past the outside edge. Arora finishes with figures of, 4-0-21-2! 6.5 overs (4 Runs) FOUR! A well-directed short ball but it has cost a boundary. This is around Dube's helmet and he is taken by surprise. Dube just dangles his bat at it and gets a top edge over the keeper's head for a boundary. 6.4 overs (1 Run) On a good length, outside off. Ambati Rayudu steps out and runs it down to third man for a single. 6.3 overs (0 Run) Length again, on off and this is tucked away towards mid-wicket. 6.2 overs (0 Run) Rayudu shuffles a bit and Arora delivers a length ball outside off. Rayudu adjusts well and keeps it out. 6.1 overs (4 Runs) FOUR! Just a bit too straight from Arora and Ambati Rayudu takes full advantage. Fuller and sliding down the leg side, flicked away into the fine leg fence. 5.6 overs (0 Run) Singh hits the length hard and slants it into middle. Dube gets behind the line of the ball to make the block. Miserable Powerplay for Chennai as they are currently 27/4! 5.5 overs (0 Run) Back of a length, around off. Dube keeps it down towards backward point. 5.4 overs (4 Runs) FOUR! Sweet timing from Shivam Dube and he gets off the mark with a boundary. Short of a length, outside off. Dube hangs back and caresses it through cover-point. Shivam Dube walks out to the middle now. 5.3 overs (0 Run) OUT! Chopped on! What is happening out there? Chennai folding like a pack of cards. Arshdeep Singh bowls it around the top of off and this one just nips back a touch off the surface. Ravindra Jadeja is caught in two minds whether to come forward or go back and in the end, he does neither. The ball takes the inside edge and castles into the off stump. Chennai lose their fourth wicket inside the Powerplay and Punjab right on top of proceedings here. 5.2 overs (1 Run) Length again, around off. Ambati Rayudu goes deep in his crease and dabs it down towards point for a quick single. 5.1 overs (0 Run) Around the top of off, Rayudu hangs back and defends it out.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637846203517589731.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Punjab Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-punjab-kings-live-score-over-match-11-t20-1-5-updates-2860559","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Punjab Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-03 16:32:55","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.1 overs, Chennai Super Kings, chasing a target of 181, are 22/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Chennai Super Kings and Punjab Kings. Everything related to Chennai Super Kings and Punjab Kings match will be available on Sports.NDTV.com . Stay updated with Chennai Super Kings vs Punjab Kings live score. Do check for Chennai Super Kings vs Punjab Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (0 Run) End of a brilliant over, a wicket and just a run! On a length, around off. Jadeja punches it to covers. Dot ball. 4.5 overs (0 Run) Lands on a length, on off. Ravindra Jadeja blocks it off the front foot. The skipper, Ravindra Jadeja walks out to bat with his team in a spot of bother. 4.4 overs (0 Run) OUT! BOWLED! What a debut this is turning out be for Vaibhav Arora! Lazy shot though from Moeen Ali and he pays the price! Lands it on a length again, outside off this time. Ali plays away from his body and looks to push it away. The ball catches the inside edge of his blade and shatters the stumps. Big, big wicket this as Moeen Ali is the man who can the game away in flash. Great start for Punjab! 4.3 overs (0 Run) Lands on a length, around off and it comes into the left-hander. Ali leaves it alone. 4.2 overs (1 Run) Ohh...lovely swing again for the young man! It is almost a yorker this time and swinging away. Ambati Rayudu blocks it out towards the off side and takes a single. 4.1 overs (0 Run) Impressive Vaibhav Arora serves a full ball on middle and this one is shaping in. Ambati Rayudu clips it to mid on. 3.6 overs (1 Run) Just 5 runs from this over! Back of a length, outside off. Ambati Rayudu cuts it to deep point for a single. 3.5 overs (0 Run) Bangs it short again, around off. Ambati Rayudu leaves it alone. 3.4 overs (0 Run) On the shorter side, around off. Ambati Rayudu first looks to cut it but then checks his shot a bit. The ball goes in the air but falls short of the cover-point fielder. 3.3 overs (0 Run) A fullish delivery on off. Ambati Rayudu drives it to mid off now. 3.2 overs (4 Runs) FOUR! Sheer timing this time! Back of a length, around off. Ambati Rayudu gets right on the top of the ball and creams it past point for a boundary. 3.1 overs (0 Run) A good-length delivery, outside off. Ambati Rayudu leaves it alone. 2.6 overs (1 Run) Goes fuller on off. Ambati Rayudu drives it to covers. A misfield there allows a single. 2.6 overs (1 Run) WIDE! Now looks for an inswinger but sprays it down the leg side. Ambati Rayudu looks to clip it but misses. 2.5 overs (0 Run) Beaten! This is a fullish delivery, around off and entices Ambati Rayudu to drive it. The ball swings away and beats the outside edge of his blade. 2.4 overs (0 Run) Goes fuller, around off. Bit of late inward movement and Ambati Rayudu lets it go. 2.3 overs (0 Run) Lands on a length, on off. Ambati Rayudu blocks it out. Ambati Rayudu is the next man in. 2.2 overs (0 Run) OUT! CAUGHT! Both the openers are back in the hut now, excellent start for Punjab! Vaibhav Arora gets his maiden Indian T20 League wicket! It is full on middle. Robin Uthappa looks to flick it but gets a leading edge instead. The ball goes high in the air behind the bowler. Mayank Agarwal runs to his right from mid off and takes a good catch. 2.1 overs (4 Runs) FOUR! Good shot! This is fuller on middle. Robin Uthappa works it past square leg for a boundary. Moeen Ali is in at number 3 for Chennai. 1.6 overs (0 Run) OUT! CAUGHT! Ruturaj Gaikwad departs early again, Kagiso Rabada gets his first wicket and just the start Punjab wanted. Lands on a good length, around off. Ruturaj Gaikwad looks to drive it away but gets a thick outside edge. The ball goes to Shikhar Dhawan at first slip and this time at a comfortable height. He takes a fine catch and Chennai lose their first. 1.5 overs (0 Run) Ohh...just short of the fielder again! On a length, outside off. Ruturaj Gaikwad drives it on up and the ball falls short of the cover fielder. 1.4 overs (1 Run) Goes slightly fuller on middle. Robin Uthappa pushes it to mid on for a single. 1.3 overs (4 Runs) FOUR! Nicely timed! On a length, on middle. Robin Uthappa works it through mid-wicket for a boundary. 1.2 overs (0 Run) Slightly on the shorter side again, on middle. Robin Uthappa looks to clip it awqay but misses. The ball hits him high on the pad. 1.1 overs (0 Run) Back of a length, around off. Robin Uthappa looks to defend it but the ball beats the outside edge of his blade. Kagiso Rabada will start from the other end. 0.6 over (0 Run) A good-length delivery, outside off. Ruturaj Gaikwad looks to defend it but the ball catches the outside edge of his blade. It goes towards the first slip fielder and falls just short of Shikhar Dhawan. Good start by Vaibhav Arora! 0.5 over (1 Run) A fuller delivery on middle. Robin Uthappa drives it to mid on for a single. 0.4 over (1 Run) Ruturaj Gaikwad is off the mark, On a length, on middle. Ruturaj Gaikwad works it towards mid on pocket for a single. 0.3 over (1 Run) This one goes away from the batter. It lands on a length, around off and shapes away. Robin Uthappa chases it and the ball goes off the outside edge of his blade to third man. The ball falls short of the fielder and a single is taken. 0.2 over (2 Runs) Robin Uthappa and Chennai are underway! On a length, on middle. Robin Uthappa goes across a bit and works it to deep mid-wicket for a couple. 0.1 over (0 Run) Vaibhav Arora starts with a fullish delivery on off. Bit of inswing there. Robin Uthappa defends it off the front foot.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637846201677621243.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Punjab Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-punjab-kings-live-score-over-match-11-t20-16-20-updates-2860496","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Punjab Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-03 15:39:45","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Punjab Kings are 180/8. The live updates of Chennai Super Kings vs Punjab Kings scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Punjab Kings, Chennai Super Kings vs Punjab Kings live score, Chennai Super Kings vs Punjab Kings scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. An excellent comeback with the ball by Chennai in the second half of the innings and they will be extremely happy with that. 180 runs on the board for Punjab and well that might seem a good total, on a ground where 200 plus is a par score and with more dew coming later in the evening, Punjab are certainly at least 20 runs short. 19.6 overs (1 Run) In the air...safe! Excellent end to the innings from Chennai and Punjab will be a bit disappointed here. This is bowled into the pitch, around off. Vaibhav Arora looks to swat it towards deep mid-wicket but mistimes it completely. The ball goes off the top edge and lands safely around the short cover region. They get a single and Punjab finish with 180/8! 19.5 overs (0 Run) This is short on middle. Vaibhav Arora looks to pull it but misses. 19.4 overs (1 Run) Length this time, around off. Kagiso Rabada pushes it out off the back foot towards covers for a single. 19.3 overs (0 Run) Yorker length, at the stumps. Rabada can't get it past the bowler. 19.2 overs (2 Runs) Full, around off. Kagiso Rabada drills it towards wide long on and races back for the second. 19.1 overs (0 Run) Slower yorker, wide of off stump. Rabada fails to connect. Vaibhav Arora is the new batter and Dwayne Bravo will bowl the final over. 18.6 overs (0 Run) OUT! TAKEN! Straight to Dwayne Bravo yet again and Rahul Chahar's handy little cameo comes to an end. Full and wide, slower again. Chahar goes after it and ends up slicing it towards the man at the long off fence and Bravo takes another simple catch. Dwaine Pretorius gets his man and is elated. 18.5 overs (0 Run) Slower yorker, close to the off stump. Chahar misses the heave leg side. 18.4 overs (6 Runs) SIX! Ruturaj Gaikwad just fails to maintain his balance and Rahul Chahar picks up a maximum. Fullish delivery, outside off. Chahar lifts it high and towards the cover fence. Gaikwad runs back and pouches it but his momentum takes him onto the ropes. 18.3 overs (0 Run) Slower one, outside off. Chahar throws the kitchen sink at it but makes no connection. 18.2 overs (4 Runs) FOUR! A much-needed boundary for Punjab. Full and wide, just misses the yorker Pretorius. Rahul Chahar stays deep in his crease and creams it through covers for a boundary. 18.1 overs (0 Run) Gets the wide yorker in does Dwaine Pretorius and Chahar is well beaten. Who will bowl the penultimate over? It's going to be Dwaine Pretorius. 17.6 overs (1 Run) Very full, hitting the base of middle stump. Chahar squeezes it towards sweeper cover for a single. 17.5 overs (1 Run) Length this time, around off. Rabada hangs deep and taps it towards mid off for a quick single. 17.4 overs (2 Runs) Full and wide, driven towards extra cover where the fielder misfields and Kagiso Rabada will pick up a couple of runs. 17.3 overs (0 Run) Pacy delivery, full and close to the off pole. Rabada looks to drive but gets undone by the pace. 17.2 overs (1 Run) Around middle and leg, pushed gently back past the bowler for a run. Rahul Chahar is in next. 17.1 overs (0 Run) OUT! CAUGHT! Punjab shooting themselves in the foot and Odean Smith has yet another disappointing outing. Full and angled at the toes of the batter, cramps Smith for room. Smith tries to free his arjms and get underneath the ball but only manages to lift it straight towards the man at the long on fence. Dwayne Bravo over there takes the simplest of catches and Chris Jordan has his second wicket. 16.6 overs (0 Run) Excellent end to the over from Pretorius. Slower yorker, just inside the tramline and Rabada is completely beaten by the lack of pace. 16.6 overs (1 Run) WIDE! A third wide in the over! Attempted back of the hand slower ball, spilled way beyond the tramline. 16.5 overs (1 Run) Just a single. Very full and outside off, jammed out to long off by Smith. 16.5 overs (1 Run) WIDE! Seam up this time and pushed beyond the tramline. Smith throws his hands at it but doesn't connect. Wided. 16.4 overs (0 Run) Another dot ball and Dwaine Pretorius is having a ball out there. Perfect yorker, right on the tramline and Odean Smith loses his shape yet again as he cannot get anywhere near the delivery. 16.3 overs (0 Run) Another off-pace delivery, full and wide of off. Smith cannot get underneath it and ends up getting a bottom edge back on the deck. 16.2 overs (1 Run) Slower yorker this time, on off. Rabada digs it out towards mid on for a run. 16.2 overs (1 Run) WIDE! Pretorius sees Rabada making a bit of room and goes for a slower ball. He spills it outside the tramline and a wide is signalled. 16.1 overs (4 Runs) FOUR! Pretorius angles in a low full toss on the pads. Rabada lofts it over wide mid on and the ball runs away into the fence. 15.6 overs (1 Run) Full and wide, driven off the bottom edge towards short third man for a quick single. Punjab need Odean Smith to step up tonight as anything under 200 will be an under-par score. 15.5 overs (0 Run) Full and quick, going across the left-hander. Rabada looks to cover drive but gets beaten. Kagiso Rabada is the new man in for Punjab. 15.4 overs (0 Run) OUT! CAUGHT! Chennai get rid of another dangerous batter! This is a low full toss on middle. Shahrukh Khan looks to whip it off his legs. He fails to get enough distance as the boundary is long on that side. He finds Dwaine Pretorius at deep backward square leg. He takes a good catch and a big wicket for Chennai! 15.3 overs (2 Runs) A fuller delivery on middle. Khan hits it to deep square leg with the inside half of his blade and takes a couple. 15.2 overs (1 Run) A fuller delivery on middle. Smith hits it to long on for a single. 15.1 overs (0 Run) A brilliant yorker on middle and leg. Smith digs it out.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637846169775375567.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Punjab Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-punjab-kings-live-score-over-match-11-t20-11-15-updates-2860453","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Punjab Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-03 15:24:00","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.2 overs, Punjab Kings are 149/5. The live updates of Chennai Super Kings vs Punjab Kings scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Punjab Kings, Chennai Super Kings vs Punjab Kings live score, Chennai Super Kings vs Punjab Kings scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (1 Run) Slower again, pitched up and wide of off stump. Odean Smith drives it towards extra cover and sets off for a quick single. DRINKS! Chennai have done well to pick wickets at regular intervals since the last break. However, Punjab have a lot of firepower in their batting lineup and they are still scoring around 10 runs per over. Shahrukh Khan is still in the crease and he will be joined by Odean Smith now. Both can be quite dangerous if they get going in the last five overs. So expect a great battle out there, as Chennai look to restrict them under 200. 14.5 overs (0 Run) OUT! TAKEN! Jitesh Sharma will look at that shot and feel that it was unecessary. Full and wide, its the slower ball this time. Sharma was playing the orthodox shots so well but decides to be cute and attempts the reverse scoop. Sharma goes hard at it but there's no pace on the ball and he ends up chipping it straight towards Robin Uthappa at short third man and Uthappa isn't going to drop that one. Dwaine Pretorius has provided Chennai with a crucial breakthrough. 14.4 overs (1 Run) Back of a length, outside off. Khan pulls it down to long off for a single. 14.3 overs (1 Run) In the air...but safe! Fullish delivery, around off. Jitesh Sharma goes inside out over extra cover but doesn't get a good connection. The fielder from the cover fence comes in but pulls out to take it on the bounce. Single taken. 14.2 overs (2 Runs) A length ball, outside off. This is slapped away in front of square on the off side and the fielder does well to slide across and keep it down to a couple. 14.1 overs (0 Run) Full and wide, Sharma looks to fetch it and sweep it across but gets a bottom edge back to the keeper. Dwaine Pretorius is back into the attack. He has bowled one over and has given away just 6 runs in it. 13.6 overs (0 Run) On off, pushed to the left of Jadeja who dives down and stops the ball. 13.5 overs (1 Run) On off, Sharma steps out and mistimes the heave towards long off for just a single this time. 13.4 overs (6 Runs) SIX! Geez, Jitesh Sharma has got some power! On a length, quicker and angled into leg stump. Sharma makes room leg side and forces the ball all the way over the long on fence for a biggie. 13.4 overs (1 Run) WIDE! This is angled down the leg side for another wide. 13.3 overs (1 Run) Darted in around off stump. Shahrukh Khan hops back and cuts it to deep point for a run. 13.2 overs (0 Run) This is speared into the pads. Khan pushes it out towards wide mid on. 13.2 overs (1 Run) WIDE! Quicker again, down the leg side and a wide is called. 13.1 overs (1 Run) Quicker and flatter, outside off. This is sweetly punched towards deep cover for a single. Ravindra Jadeja (3-0-23-1) is back on. 12.6 overs (1 Run) In the air...but lands well in front. Full and around off, Sharma jabs it over mid off and collects a single down to long off. The run rate has come down from 12 runs per over to 10 runs per over now and Punjab will be looking to up the ante a bit here. 12.5 overs (0 Run) Choudhary goes back to the hard length and bowls it on off stump. Sharma defends it out. 12.4 overs (6 Runs) SIX! A bit of a top edge but the intent was clear. Banged in halfway down the leg side. Jitesh Sharma takes it on and clears the fine leg fence. 12.3 overs (0 Run) On middle this time and Sharma just pushes it gently back to the bowler. 12.2 overs (0 Run) A length ball, slanting across off. This is dabbed down towards backward point. Sharma looks for a single but is sent back and rightly so. Mukesh Choudhary is back on. He has given away 44 runs so far in his three overs and has taken an important wicket of Mayank Agarwal. 12.1 overs (1 Run) Back of a length, over middle. Khan punches it down to long on for a run. 11.6 overs (1 Run) Shorter this time from Moeen Ali. Shahrukh Khan rocks back and pulls it behind square on the leg side for a single. 11.5 overs (0 Run) Slowed up, on a length and turning into leg stump. Khan tucks it towards square leg. 11.4 overs (1 Run) Full and straight, eased down to long on for a single. 11.3 overs (0 Run) On middle, pushed back towards the bowler. 11.2 overs (6 Runs) SIX! First match for Jitesh Sharma and he smokes his third delivery for a huge hit. Angled into middle and leg, Sharma steps out and lifts it all the way over the mid-wicket fence. Moeen Ali is into the attack now. 11.1 overs (0 Run) Floated up, on the pads. Sharam nudges it towards mid-wicket. 10.6 overs (0 Run) This is darted into off, Khan just blocks it out once again. 10.5 overs (0 Run) Flatter delivery, on off. Khan blocks it out. Shahrukh Khan walks out to bat now. 10.4 overs (0 Run) OUT! CAUGHT! Soft dismissal and its Ambati Rayudu who has his redemption! This is quicker and outside off, there to be hit. Liam Livingstone looks to power it over extra cover but gets a thick outside edge. The ball flies straight down the throat of the fielder at short third man and Rayudu this time doesn't make any mistake. Ravindra Jadeja has done the trick for his team and Livingstone departs after an entertaining innings. Punjab pushed on the back foot once again. 10.3 overs (1 Run) Around off, pushed through covers for a run by Sharma to get off the mark. 10.2 overs (1 Run) Around off, cut away again through the cover region but this time it will only be a single. 10.1 overs (4 Runs) FOUR! Slapped away! Short and wide, a nothing delivery really from Jadeja. Liam Livingstone cuts it powerfully through the cover region for a boundary.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637846160321142141.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's WC: 'I think we deserve the win,' a proud Australia captain Meg Lanning hails her side","link":"https://www.thehansindia.com/sports/cricket/womens-wc-i-think-we-deserve-the-win-a-proud-australia-captain-meg-lanning-hails-her-side-736366","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Australia Women defeated England by 71 runsIt was Meg Lanning and Co’s seventh World Cup titleAlyssa Healy scored a record-breaking 170 in the final","content":"Women’s WC: ‘I think we deserve the win,’ a proud Australia captain Meg Lanning hails her sideWomen’s WC: ‘I think we deserve the win,’ a proud Australia captain Meg Lanning hails her sideMeg Lanning hailed her side, saying \"I think we deserve the win tonight\" after Australia Women defeated England by 71 runs to claim their seventh Cricket World Cup.It was also Australia's third straight ICC trophy after they won the T20 World Cup in 2018 and 2020. A record-breaking 170 from Alyssa Healy helped Australia post 356 for 5 in 50 overs. Lanning and Co dethroned the defending champions England by bowling them out in 43.4 overs. Middle-order batter Natalie Sciver top-scored for the English side with a fighting 148 off 121 deliveries. The next best individual score in the England team was Tammy Beaumont's 27 off 26 balls. This showed how dominating the Aussies were with both bat and ball in the 2022 World Cup final in Christchurch.✅ Player of the Final✅ Player of the Tournament✅ National treasureWith centuries in both finals, Alyssa Healy had herself a tournament to remember #CWC22 pic.twitter.com/Ie2nCjqgpw— Cricket Australia (@CricketAus) April 3, 2022 \"We have been extremely consistent over a long period of time and to come out and perform so well throughout the tournament, I think we deserve the win tonight. We knew we had to have a number of people contributing which we had throughout the tournament, we had some young players come in and make an impact straightaway which is great for the team and great for the more experienced players to keep pushing them to get better.Off the field we had great support from the coaching staff and support staff to get us to this point. It was incredible (Alyssa Healy's knock), to do it in a World Cup final. Some of those shots she was playing were ridiculous and I think she set the base really nicely and it is something we have spoken about a lot as a batting group, being patient upfront and building the platform to explode at the backend and that is what happened today,\" Lanning said at the post-match interview after the final on Sunday. Meg Lanning: Nat Sciver played a 'special innings' Australia captain Lanning also praised England's Sciver, whose century went in vain in England's loss. \"She (Nat Sciver) is an incredible player and played a really special innings, on any other day it would potentially be a match-winning one. We knew England would come hard at us and we expected a contest and we certainly got that,\" added Lanning. Australia's spin duo of Alana King and Jess Jonassen shared six wickets between each other. The 26-year-old bowler spinner Alana, who made her Australia debut earlier this year, played a crucial part in the final as she picked up three wickets and bowled at an economy of 6.40. \"There's some good depth in our squad. We have seen Alana King and Darcie Brown come in and dominate and lift the team, so it is important not to rely on one or two players. We will celebrate this one first, important to make sure to look back at this period and see how successful it's been because there's been a lot of hard work that has gone into it and hasn't been easy. There's been ups and downs through the whole thing, nice to be able to get to the end of this nice little block and be able to say we are World Cup champions.All smiles 🤩#CWC22 | 📸 @CricketAus pic.twitter.com/teVoQrFEAu— ICC (@ICC) April 3, 2022 The 30-year-old Lanning, who is one of the most successful Australian captains in their history, thanked England for the contest on Sunday.\"Thank you to Heather and England for the contest today, thanks to everyone at the ICC, New Zealand Cricket for getting this tournament up, it's been an incredible effort, lots of work going on behind the scenes. I want to thank our coaches and support staff who put so much time and effort behind the scenes to get us up and about to be able to play cricket. Well done to the team and we will certainly enjoy this one,\" added Lanning.","pubDate":"2022-04-03 15:17:43","full_description":"Women’s WC: ‘I think we deserve the win,’ a proud Australia captain Meg Lanning hails her side Meg Lanning hailed her side, saying \"I think we deserve the win tonight\" after Australia Women defeated England by 71 runs to claim their seventh Cricket World Cup. It was also Australia's third straight ICC trophy after they won the T20 World Cup in 2018 and 2020. A record-breaking 170 from Alyssa Healy helped Australia post 356 for 5 in 50 overs. Lanning and Co dethroned the defending champions England by bowling them out in 43.4 overs. Middle-order batter Natalie Sciver top-scored for the English side with a fighting 148 off 121 deliveries. The next best individual score in the England team was Tammy Beaumont's 27 off 26 balls. This showed how dominating the Aussies were with both bat and ball in the 2022 World Cup final in Christchurch. ✅ Player of the Final ✅ Player of the Tournament ✅ National treasure With centuries in both finals, Alyssa Healy had herself a tournament to remember #CWC22 pic.twitter.com/Ie2nCjqgpw \"We have been extremely consistent over a long period of time and to come out and perform so well throughout the tournament, I think we deserve the win tonight. We knew we had to have a number of people contributing which we had throughout the tournament, we had some young players come in and make an impact straightaway which is great for the team and great for the more experienced players to keep pushing them to get better. Off the field we had great support from the coaching staff and support staff to get us to this point. It was incredible (Alyssa Healy's knock), to do it in a World Cup final. Some of those shots she was playing were ridiculous and I think she set the base really nicely and it is something we have spoken about a lot as a batting group, being patient upfront and building the platform to explode at the backend and that is what happened today,\" Lanning said at the post-match interview after the final on Sunday. Meg Lanning: Nat Sciver played a 'special innings' Australia captain Lanning also praised England's Sciver, whose century went in vain in England's loss. \"She (Nat Sciver) is an incredible player and played a really special innings, on any other day it would potentially be a match-winning one. We knew England would come hard at us and we expected a contest and we certainly got that,\" added Lanning. Australia's spin duo of Alana King and Jess Jonassen shared six wickets between each other. The 26-year-old bowler spinner Alana, who made her Australia debut earlier this year, played a crucial part in the final as she picked up three wickets and bowled at an economy of 6.40. \"There's some good depth in our squad. We have seen Alana King and Darcie Brown come in and dominate and lift the team, so it is important not to rely on one or two players. We will celebrate this one first, important to make sure to look back at this period and see how successful it's been because there's been a lot of hard work that has gone into it and hasn't been easy. There's been ups and downs through the whole thing, nice to be able to get to the end of this nice little block and be able to say we are World Cup champions. All smiles 🤩 #CWC22 | 📸 @CricketAus pic.twitter.com/teVoQrFEAu The 30-year-old Lanning, who is one of the most successful Australian captains in their history, thanked England for the contest on Sunday. \"Thank you to Heather and England for the contest today, thanks to everyone at the ICC, New Zealand Cricket for getting this tournament up, it's been an incredible effort, lots of work going on behind the scenes. I want to thank our coaches and support staff who put so much time and effort behind the scenes to get us up and about to be able to play cricket. Well done to the team and we will certainly enjoy this one,\" added Lanning.","image_url":"https://assets.thehansindia.com/h-upload/2022/04/03/500x300_1285038-cwc.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Punjab Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-punjab-kings-live-score-over-match-11-t20-6-10-updates-2860409","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Punjab Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-03 14:55:53","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.2 overs, Punjab Kings are 114/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Chennai Super Kings and Punjab Kings. Everything related to Chennai Super Kings and Punjab Kings match will be available on Sports.NDTV.com . Stay updated with Chennai Super Kings vs Punjab Kings live score. Do check for Chennai Super Kings vs Punjab Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (0 Run) OUT! CAUGHT! End of a handy knock from Shikhar Dhawan! Good slower ball by Bravo! 9.5 overs (1 Run) A fuller delivery on leg. Liam Livingstone works it to deep backward square leg for a single. 9.4 overs (0 Run) Well bowled! Dwayne Bravo with a wide yorker, outside off. Liam Livingstone looks to get a bat on it but misses. 9.3 overs (6 Runs) SIX! Fifty comes up for Liam Livingstone! It has been a brilliant one! Finally he delivers. This ball is short on middle and leg. Liam Livingstone looks to pull but gets a top edge. The ball goes in the air and over the fine leg fence for a maximum. 9.2 overs (1 Run) A very full delivery, outside off. Shikhar Dhawan drives it to covers for a single this time. 9.1 overs (4 Runs) FOUR! With all the attention on Liam Livingstone, it is Shikhar Dhawan who has got regular boundaries in the last few overs! This is fuller outside off. Shikhar Dhawan skips down the track and creams it through covers for a boundary. 100 up for Punjab! 9.1 overs (1 Run) WIDE! Bravo starts another over with a wide! This is full and outside off. Shikhar Dhawan lets it go. 8.6 overs (1 Run) Short on middle now. Shikhar Dhawan rocks back and pulls it to deep mid-wicket for a single. 8.5 overs (4 Runs) FOUR! Lovely shot by the senior pro! This is on middle and leg. Shikhar Dhawan gets a bit across and paddle-sweeps it fine towards the fine leg fence for a boundary. 8.4 overs (1 Run) Fuller on off. Liam Livingstone pushes it to covers for a single. 8.4 overs (1 Run) WIDE! Fires thi bit wider outside off. Liam Livingstone leaves it alone. 8.3 overs (0 Run) This is pushed quicker outside off. Liam Livingstone pushes it to covers. 8.2 overs (0 Run) Short and wide outside off. Liam Livingstone looks to cut but misses. 8.1 overs (0 Run) A flatter and quicker one, outside off. Liam Livingstone cuts it to covers. Drinks! Pheww! Too much happening in the game right now and it's fair to say that everyone deserves a breather. After a sensational start with the ball and in the field by Chennai, a storm by the name of Liam Livingstone has struck the ground and he has turned the game on its head. Livingstone though has got a couple of lives but it is now up to him to make the most of them. Dhawan too has given him ample support and Chennai are desperate for a wicket here, just to slow things down a bit. 7.6 overs (1 Run) Ends the over with a full ball, on middle. Liam Livingstone knocks it down to long on for a single. Good over from Dwaine Pretorius! 7.5 overs (1 Run) A low full toss on off. Shikhar Dhawan skips down the track and pushes it to long off for a single. 7.5 overs (1 Run) WIDE! This is again very full and outside off. Shikhar Dhawan leaves it alone. 7.4 overs (2 Runs) A very full delivery on off again. Shikhar Dhawan slog-sweeps it to deep mid-wicket and the batters run couple. Bravo does well in the deep to stop a boundary there. 7.3 overs (1 Run) A fuller delivery, outside off. Liam Livingstone squeezes it to point for a single. 7.2 overs (0 Run) NOT OUT! Liam Livingstone gets another life! This is full and around leg. Liam Livingstone looks to clip it but gets a faint part of his blade. The ball goes towards left of Dhoni. He dives to his left takes a catch but as he falls the ball just hits the ground. Dhoni is not sure and the umpire takes it upstairs. The replays roll in and they show that the ball has hit the ground. So Liam Livingstone survives. Is that out? MS Dhoni straightaway signals that he isn't sure if the ball hit the ground and the umpires do go upstairs. This is a tough call, Dhoni seems to have taken it clearly as can be seen on the replay but just when he landed the ball seems to have hit the ground. The third umpire has a good look at it and makes his decision. NOT OUT! 7.1 overs (1 Run) Starts with a yorker, outside off. Shikhar Dhawan gets across and looks to sweep but misses. The ball hits his pads and a leg bye is taken towards the off side. Dwaine Pretorius comes into the attack now. 6.6 overs (0 Run) A flatter delivery on off. Liam Livingstone punches it to covers. 6.5 overs (0 Run) Ohhh... Ambati Rayudu, you will not get a more easy catch than this one, he has dropped it! A tossed up delivery, around off. Liam Livingstone skips down the track and looks to go for a big one. The ball catches the outside edge and goes right of short third man. He runs slightly to his right and drops a sitter. Costly miss! 6.4 overs (1 Run) On the shorter side on leg. Dhawan works it to short fine leg for a single. 6.3 overs (2 Runs) A fuller delivery on middle. Shikhar Dhawan skips down the track and works it to deep mid-wicket for a couple. 6.2 overs (1 Run) A flatter and shorter delivery on off. Liam Livingstone rocks back and cuts it to deep point for a single. 6.1 overs (6 Runs) SIX! Liam Livingstone greets the Chennai skipper with a maximum! Jadeja fires this on off. Liam Livingstone dances down the track and tonks it over long off for a biggie. 87 metres hit! The skipper, Ravindra Jadeja brings himself into the attack now. 5.6 overs (4 Runs) FOUR! Another expensive over to end the Powerplay! Lands on a length, around leg. Dhawan clips it past short fine leg for a boundary. After Powerplay, Punjab are 72/2! 5.5 overs (0 Run) A slower full delivery on middle. Shikhar Dhawan skips down the track and takes it on full. He hits it straight to mid on. 5.4 overs (0 Run) Well bowled! Bravo sees Dhawan moving in the crease and serves a slower ball, outside off. Shikhar Dhawan first backs away then gets across towards the off side and leaves it in the end. 5.3 overs (4 Runs) FOUR! Nice timing again! This is full and outside off. Shikhar Dhawan creams a drive through covers for a boundary. 5.2 overs (6 Runs) SIX! Now, Shikhar Dhawan joins the act! Pressure on Dwayne Bravo straightaway! This is fuller on middle. Shikhar Dhawan picks the slower ball and launches it over long on for a maximum. 5.1 overs (0 Run) Back of a length, outside off. Shikhar Dhawan chops it to covers. 5.1 overs (1 Run) WIDE! Bravo starts with a full and wide delivery, outside off. Shikhar Dhawan skips down the track and lets it go as it is too wide.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637846143452018476.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Liam Livingstone longest six IPL 2022: Liam Livingstone smacks Mukesh Choudhary for monster 108-metre six at Brabourne Stadium","link":"https://thesportsrush.com/cricket-news-liam-livingstone-longest-six-ipl-2022-liam-livingstone-smacks-mukesh-choudhary-for-monster-108-metre-six-at-brabourne-stadium/","keywords":["Cricket","CSK","IPL 2022","Punjab Kings","Videos","chennai super kings","Indian Premier League","Liam Livingstone","Mukesh Choudhary","PBKS"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Liam Livingstone longest six IPL 2022: The English batter has finally appeared to find his mojo in the Indian Premier League. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, Punjab Kings batter Liam Livingstone has started to prove… The post Liam Livingstone longest six IPL 2022: Liam Livingstone smacks Mukesh Choudhary for monster 108-metre six at Brabourne Stadium appeared first on The SportsRush.","content":"Liam Livingstone longest six IPL 2022: The English batter has finally appeared to find his mojo in the Indian Premier League. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, Punjab Kings batter Liam Livingstone has started to prove his worth on the back of hitting gargantuan sixes. Coming in to bat at No. 4 in the second over, Livingstone didn’t appear to be thinking much about the fall of two wickets before taking risk with the bat in hand. Three dot deliveries against Chennai Super Kings fast bowler Mukesh Choudhary were perhaps too much for Livingstone to handle as he pulled the fourth delivery for a six in the third over. Livingstone, who also hit a four in the same over, hit as many as three fours and two sixes to smash Choudhary to all parts of the ground tonight. The first six, in particular, was a monster 108-metre six which ended up becoming a source of amazement for one and all as the right-handed batter collected a total of 26 runs from the over. Known for smashing sixes at will, Livingstone has already hit some towering sixes in international cricket against Kagiso Rabada and Haris Rauf. With opening Shikhar Dhawan seeming to agree to play second fiddle to Livingstone, the 28-year old player has provided enough early signs of what could be a mammoth knock on a Sunday night. Readers must note that a drop catch by Ambati Rayudu off Ravindra Jadeja has already given a massive reprieve to Livingstone. Liam Livingstone longest six IPL 2022 Mukesh Choudhary to Livingstone, SIX, masssiveeee!#CricketMasterUpdater pic.twitter.com/GevVxnUnRW — Live Cricket Master Updater (@MohsinM55415496) April 3, 2022 Twitter reactions on Liam Livingstone: LIVINGSTONE ALERT People strolling through Marine Drive, please take shelter! #PunjabKings #SaddaPunjab #IPL2022 #ਸਾਡਾਪੰਜਾਬ #CSKvPBKS @liaml4893 pic.twitter.com/6GTpcBV2be — Punjab Kings (@PunjabKingsIPL) April 3, 2022 Punjab Kings batting approach this IPL #CSKvPBKS #IPL2022 pic.twitter.com/HhIccTzYN5 — Wasim Jaffer (@WasimJaffer14) April 3, 2022 Liam Livingstone what a player #CSKvsPBKS #PunjabKings pic.twitter.com/GXhNBiOmXg — Ashutosh Srivastava (@kingashu1008) April 3, 2022 For more cricket-related news, click here. The post Liam Livingstone longest six IPL 2022: Liam Livingstone smacks Mukesh Choudhary for monster 108-metre six at Brabourne Stadium appeared first on The SportsRush.","pubDate":"2022-04-03 14:49:45","full_description":"Liam Livingstone longest six IPL 2022: The English batter has finally appeared to find his mojo in the Indian Premier League. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, Punjab Kings batter Liam Livingstone has started to prove his worth on the back of hitting gargantuan sixes. Coming in to bat at No. 4 in the second over, Livingstone didn’t appear to be thinking much about the fall of two wickets before taking risk with the bat in hand. Three dot deliveries against Chennai Super Kings fast bowler Mukesh Choudhary were perhaps too much for Livingstone to handle as he pulled the fourth delivery for a six in the third over. Livingstone, who also hit a four in the same over, hit as many as three fours and two sixes to smash Choudhary to all parts of the ground tonight. The first six, in particular, was a monster 108-metre six which ended up becoming a source of amazement for one and all as the right-handed batter collected a total of 26 runs from the over. Known for smashing sixes at will, Livingstone has already hit some towering sixes in international cricket against Kagiso Rabada and Haris Rauf . With opening Shikhar Dhawan seeming to agree to play second fiddle to Livingstone, the 28-year old player has provided enough early signs of what could be a mammoth knock on a Sunday night. Readers must note that a drop catch by Ambati Rayudu off Ravindra Jadeja has already given a massive reprieve to Livingstone. Mukesh Choudhary to Livingstone, SIX, 🎈 masssiveeee! #CricketMasterUpdater pic.twitter.com/GevVxnUnRW — Live Cricket Master Updater (@MohsinM55415496) April 3, 2022 LIVINGSTONE ALERT ⚠️ People strolling through Marine Drive, please take shelter! 😅 #PunjabKings #SaddaPunjab #IPL2022 #ਸਾਡਾਪੰਜਾਬ #CSKvPBKS @liaml4893 pic.twitter.com/6GTpcBV2be — Punjab Kings (@PunjabKingsIPL) April 3, 2022 Punjab Kings batting approach this IPL 👊🏼👊🏼😁 #CSKvPBKS #IPL2022 pic.twitter.com/HhIccTzYN5 — Wasim Jaffer (@WasimJaffer14) April 3, 2022 Liam Livingstone what a player 🔥 #CSKvsPBKS #PunjabKings pic.twitter.com/GXhNBiOmXg — Ashutosh Srivastava (@kingashu1008) April 3, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"What happened to Deepak Chahar: Why Deepak Chahar is not playing IPL 2022?","link":"https://thesportsrush.com/cricket-news-what-happened-to-deepak-chahar-why-deepak-chahar-is-not-playing-ipl-2022/","keywords":["Cricket","CSK","IPL 2022","chennai super kings","csk","deepak chahar","IPL"],"creator":["Gurpreet Singh"],"video_url":null,"description":"What happened to Deepak Chahar: The costliest player for CSK during the mega auction has missed all the initial matches of IPL 2022. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium in Mumbai, CSK’s newly inducted skipper for… The post What happened to Deepak Chahar: Why Deepak Chahar is not playing IPL 2022? appeared first on The SportsRush.","content":"What happened to Deepak Chahar: The costliest player for CSK during the mega auction has missed all the initial matches of IPL 2022. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium in Mumbai, CSK’s newly inducted skipper for the season Ravindra Jadeja has won the Toss and opted to field first. “Ha ha ha! We are bowling. We try to keep things simple, we are an experienced team so they know what to do when we are under the pump. We back each and every player,” exclaimed Jadeja upon winning the Toss for the first time this season. The CSK management have opted to rest their Indian pacer Tushar Deshpande, who makes way for the English fast bowler Chris Jordan. Slide to your unlock your newest in !#CSKvPBKS #Yellove #WhistlePodu pic.twitter.com/6WJCjA0TDi — Chennai Super Kings (@ChennaiIPL) April 3, 2022 On the other hand, PBKS have made a couple of changes by including the fresh Indian talents in Jitesh Sharma and Vaibhav Arora. Couple of changes. Vaibhav comes in place of Harpreet Brar, Jitesh comes in place of Raj Bawa. Vaibhav can swing the ball both ways, so he is someone who we are excited about. Jitesh is a keeper who can tonk the ball in the middle,” said Mayank Agarwal on the inclusion of two new faces in the playing 11 for the day. What happened to Deepak Chahar CSK shelled out INR 14 Crore – the highest bidding amount for any player in their auction history, to rope in the services of their Indian bowling all-rounder in Deepak Chahar during the mega auction in February. However, the 29-year-old, having missed both the ongoing season matches for the franchises, will miss today’s fixture against PBKS as well, as he currently undergoing a rehabilitation at the National Cricket Academy (NCA) in Bengaluru. For those unaware, Chahar had suffered a quadricep tear during the 3-match T20I series against Sri Lanka in February this year, and was subsequently ruled out from the same. As per reports from the CSK management, if everything is fine, he is likely to join the squad by mid-April. ALSO READ: Will Deepak Chahar be paid his IPL salary if he misses IPL 2022? The post What happened to Deepak Chahar: Why Deepak Chahar is not playing IPL 2022? appeared first on The SportsRush.","pubDate":"2022-04-03 14:38:36","full_description":"What happened to Deepak Chahar: The costliest player for CSK during the mega auction has missed all the initial matches of IPL 2022. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium in Mumbai, CSK’s newly inducted skipper for the season Ravindra Jadeja has won the Toss and opted to field first. “Ha ha ha! We are bowling. We try to keep things simple, we are an experienced team so they know what to do when we are under the pump. We back each and every player,” exclaimed Jadeja upon winning the Toss for the first time this season. The CSK management have opted to rest their Indian pacer Tushar Deshpande, who makes way for the English fast bowler Chris Jordan. Slide to your unlock your newest 🦁 in 💛! #CSKvPBKS #Yellove #WhistlePodu 🦁💛 pic.twitter.com/6WJCjA0TDi — Chennai Super Kings (@ChennaiIPL) April 3, 2022 On the other hand, PBKS have made a couple of changes by including the fresh Indian talents in Jitesh Sharma and Vaibhav Arora. Couple of changes. Vaibhav comes in place of Harpreet Brar, Jitesh comes in place of Raj Bawa. Vaibhav can swing the ball both ways, so he is someone who we are excited about. Jitesh is a keeper who can tonk the ball in the middle,” said Mayank Agarwal on the inclusion of two new faces in the playing 11 for the day. CSK shelled out INR 14 Crore – the highest bidding amount for any player in their auction history, to rope in the services of their Indian bowling all-rounder in Deepak Chahar during the mega auction in February. However, the 29-year-old, having missed both the ongoing season matches for the franchises , will miss today’s fixture against PBKS as well, as he currently undergoing a rehabilitation at the National Cricket Academy (NCA) in Bengaluru. For those unaware, Chahar had suffered a quadricep tear during the 3-match T20I series against Sri Lanka in February this year, and was subsequently ruled out from the same. As per reports from the CSK management, if everything is fine, he is likely to join the squad by mid-April. ALSO READ : Will Deepak Chahar be paid his IPL salary if he misses IPL 2022?","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Dhoni age now: MS Dhoni run out to dismiss Bhanuka Rajapaksa in CSK vs PBKS IPL 2022 match impresses one and all","link":"https://thesportsrush.com/cricket-news-dhoni-age-now-ms-dhoni-run-out-to-dismiss-bhanuka-rajapaksa-in-csk-vs-pbks-ipl-2022-match-impresses-one-and-all/","keywords":["Cricket","CSK","IPL 2022","Punjab Kings","Videos","Bhanuka Rajapaksa","chennai super kings","csk","Indian Premier League","MS Dhoni","PBKS"],"creator":["Dixit Bhargav"],"video_url":null,"description":"MS Dhoni run out: The 40-year old cricketer was agile and acrobatic enough to pick a wicket on his own at the Braboune Stadium tonight. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, former Chennai Super Kings captain… The post Dhoni age now: MS Dhoni run out to dismiss Bhanuka Rajapaksa in CSK vs PBKS IPL 2022 match impresses one and all appeared first on The SportsRush.","content":"MS Dhoni run out: The 40-year old cricketer was agile and acrobatic enough to pick a wicket on his own at the Braboune Stadium tonight. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, former Chennai Super Kings captain Mahendra Singh Dhoni put on display his acrobatic skills to run out his Punjab Kings counterpart Bhanuka Rajapaksa. It all happened on the eighth delivery of the match when Rajapaksa played a Chris Jordan delivery towards mid-on to show keen interest in sneaking a run. An initial positive response from non-striker Shikhar Dhawan was followed by a miscommunication between both the players which resulted in Rajapaksa’s dismissal. Bowling from round the wicket, Jordan himself ran to fetch the ball to throw it towards Dhoni. With the 40-year old player running from his position, he was agile enough to dive and throw the ball back to the stumps before colliding with it himself. In what was a clear dismissal, Rajapaksa had started walking back to the pavilion without even waiting for the umpire’s decision. Coming in to bat at No. 3 in the first over itself, Rajapaksa was dismissed for 9 (5) with the help of a six. With PBKS also losing captain Mayank Agarwal (4) on the second ball of the match, they are in a bit of trouble after being reduced to 14/2 in the second over tonight. MS Dhoni run out vs Punjab Kings Legend of the game We are blessed that still watching him ..#CSKvsPBKS #MSDhoni pic.twitter.com/XtZBNRwlW5 — Ranbir Dutta (@Ranbir012) April 3, 2022 Twitter reactions on MS Dhoni: That MS Dhoni run-out man! ooof — Subhayan Chakraborty (@CricSubhayan) April 3, 2022 3×10^8 M/S #CSKvPBKS #WhistlePodu #Yellove pic.twitter.com/AXezXM6w7b — Chennai Super Kings (@ChennaiIPL) April 3, 2022 MS 😀 — KSR (@KShriniwasRao) April 3, 2022 For more cricket-related news, click here. The post Dhoni age now: MS Dhoni run out to dismiss Bhanuka Rajapaksa in CSK vs PBKS IPL 2022 match impresses one and all appeared first on The SportsRush.","pubDate":"2022-04-03 14:28:22","full_description":"MS Dhoni run out: The 40-year old cricketer was agile and acrobatic enough to pick a wicket on his own at the Braboune Stadium tonight. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, former Chennai Super Kings captain Mahendra Singh Dhoni put on display his acrobatic skills to run out his Punjab Kings counterpart Bhanuka Rajapaksa. It all happened on the eighth delivery of the match when Rajapaksa played a Chris Jordan delivery towards mid-on to show keen interest in sneaking a run. An initial positive response from non-striker Shikhar Dhawan was followed by a miscommunication between both the players which resulted in Rajapaksa’s dismissal. Bowling from round the wicket, Jordan himself ran to fetch the ball to throw it towards Dhoni. With the 40-year old player running from his position, he was agile enough to dive and throw the ball back to the stumps before colliding with it himself. In what was a clear dismissal, Rajapaksa had started walking back to the pavilion without even waiting for the umpire’s decision. Coming in to bat at No. 3 in the first over itself, Rajapaksa was dismissed for 9 (5) with the help of a six. With PBKS also losing captain Mayank Agarwal (4) on the second ball of the match, they are in a bit of trouble after being reduced to 14/2 in the second over tonight. Legend of the game We are blessed that still watching him ❤️.. #CSKvsPBKS #MSDhoni pic.twitter.com/XtZBNRwlW5 — Ranbir Dutta🕊️🇮🇳 (@Ranbir012) April 3, 2022 That MS Dhoni run-out man! ooof🔥🔥 — Subhayan Chakraborty (@CricSubhayan) April 3, 2022 3×10^8 M/S ⚡😀 #CSKvPBKS #WhistlePodu #Yellove 🦁 pic.twitter.com/AXezXM6w7b — Chennai Super Kings (@ChennaiIPL) April 3, 2022 MS 😀 — KSR (@KShriniwasRao) April 3, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, CSK vs PBKS Live Score: Liam Livingstone Tees Off After Chennai Super Kings Strike Twice Early - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWNzay12cy1wYmtzLWxpdmUtc2NvcmUtdXBkYXRlcy1wdW5qYWIta2luZ3MtdnMtY2hlbm5haS1zdXBlci1raW5ncy1saXZlLXNjb3JlLTI4NjAyMDXSAYUBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvaXBsLTIwMjItY3NrLXZzLXBia3MtbGl2ZS1zY29yZS11cGRhdGVzLXB1bmphYi1raW5ncy12cy1jaGVubmFpLXN1cGVyLWtpbmdzLWxpdmUtc2NvcmUtMjg2MDIwNS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, CSK vs PBKS Live Score: Liam Livingstone Tees Off After Chennai Super Kings Strike Twice Early  NDTV SportsCSK vs PBKS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorIPL 2022, CSK vs PBKS Live Score: Chennai strike early, Punjab go 2 down  Hindustan TimesLive Cricket Score: CSK vs PBKS, Match 11, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzCSK vs PBKS Prediction- Who Will Win The Match Between Chennai Super Kings and Punjab Kings? IPL 2022, Match 11  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-03 14:27:12","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"C Jordan stats: Why is Jonny Bairstow not playing today’s IPL 2022 match between Chennai Super Kings and Punjab Kings?","link":"https://thesportsrush.com/cricket-news-c-jordan-stats-why-is-jonny-bairstow-not-playing-todays-ipl-2022-match-between-chennai-super-kings-and-punjab-kings/","keywords":["Cricket","CSK","IPL 2022","Punjab Kings","chennai super kings","Chris Jordan","csk","Indian Premier League","Jonny Bairstow","PBKS"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Jonny Bairstow not playing today: Punjab Kings have made a couple of changes to their Playing XI for this match. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, Chennai Super Kings captain Ravindra Jadeja has won the… The post C Jordan stats: Why is Jonny Bairstow not playing today’s IPL 2022 match between Chennai Super Kings and Punjab Kings? appeared first on The SportsRush.","content":"Why Jonny Bairstow not playing today: Punjab Kings have made a couple of changes to their Playing XI for this match. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, Chennai Super Kings captain Ravindra Jadeja has won the toss and chose to bowl. “Ha ha ha! We are bowling. We try to keep things simple, we are an experienced team so they know what to do when we are under the pump. We back each and every player,” Jadeja told Star Sports at the toss expressing happiness as chasing teams have dominated this season thus far. In what is the first instance of Super Kings losing both the first two IPL league matches, Jadeja confirmed a change in the form of England fast bowler Chris Jordan making his debut in place of uncapped Indian fast bowler Tushar Deshpande. Slide to your unlock your newest in !#CSKvPBKS #Yellove #WhistlePodu pic.twitter.com/6WJCjA0TDi — Chennai Super Kings (@ChennaiIPL) April 3, 2022 Jordan, 33, has played for Royal Challengers Bangalore (2016), Sunrisers Hyderabad (2017-18) and Punjab Kings (2020-21) in the past. In his 25-match IPL career, Jordan has picked 25 wickets at an average of 27.92, an economy rate of 9.12 and a strike rate of 18.36. Why is Jonny Bairstow not playing vs Chennai Super Kings today? Punjab, who suffered a major loss against Kolkata Knight Riders after winning their tournament opener against Royal Challengers Bangalore, would be looking to return to winning ways at the Cricket Club of India tonight. ALSO READ: Brabourne Stadium IPL 2022 schedule “Looks like a good surface for batting. So we want to put runs on the board and let that pressure play and defend the total. We haven’t spoken much about the last game. We are going to have off days. We just spoke about it for a few minutes and we are looking forward to today’s game,” Punjab Kings captain Mayank Agarwal told Star Sports at the toss. Readers must note that Kings have made a couple of changes to their Playing XI by bringing a couple of debutants in wicket-keeper batter Jitesh Sharma and fast bowler Vaibhav Arora for all-rounders Raj Bawa and Harpreet Brar. While Bawa failed to get going in his previous two outings, Brar has been benched to play an extra fast bowler in a potential attempt to minimize the “dew factor”. Having said that, the development means that PBKS will be once again without England wicket-keeper batter Jonny Bairstow. With Agarwal not being asked about the same, it seems that Kings don’t want to make desperate changes by providing more chances to their overseas players. The post C Jordan stats: Why is Jonny Bairstow not playing today’s IPL 2022 match between Chennai Super Kings and Punjab Kings? appeared first on The SportsRush.","pubDate":"2022-04-03 13:53:16","full_description":"Why Jonny Bairstow not playing today: Punjab Kings have made a couple of changes to their Playing XI for this match. During the 11th match of the ongoing 15th season of the Indian Premier League between Chennai Super Kings and Punjab Kings at the Brabourne Stadium, Chennai Super Kings captain Ravindra Jadeja has won the toss and chose to bowl. “Ha ha ha! We are bowling. We try to keep things simple, we are an experienced team so they know what to do when we are under the pump. We back each and every player,” Jadeja told Star Sports at the toss expressing happiness as chasing teams have dominated this season thus far. In what is the first instance of Super Kings losing both the first two IPL league matches, Jadeja confirmed a change in the form of England fast bowler Chris Jordan making his debut in place of uncapped Indian fast bowler Tushar Deshpande. Slide to your unlock your newest 🦁 in 💛! #CSKvPBKS #Yellove #WhistlePodu 🦁💛 pic.twitter.com/6WJCjA0TDi — Chennai Super Kings (@ChennaiIPL) April 3, 2022 Jordan, 33, has played for Royal Challengers Bangalore (2016), Sunrisers Hyderabad (2017-18) and Punjab Kings (2020-21) in the past. In his 25-match IPL career, Jordan has picked 25 wickets at an average of 27.92, an economy rate of 9.12 and a strike rate of 18.36. Punjab, who suffered a major loss against Kolkata Knight Riders after winning their tournament opener against Royal Challengers Bangalore, would be looking to return to winning ways at the Cricket Club of India tonight. ALSO READ: Brabourne Stadium IPL 2022 schedule “Looks like a good surface for batting. So we want to put runs on the board and let that pressure play and defend the total. We haven’t spoken much about the last game. We are going to have off days. We just spoke about it for a few minutes and we are looking forward to today’s game,” Punjab Kings captain Mayank Agarwal told Star Sports at the toss. Readers must note that Kings have made a couple of changes to their Playing XI by bringing a couple of debutants in wicket-keeper batter Jitesh Sharma and fast bowler Vaibhav Arora for all-rounders Raj Bawa and Harpreet Brar. While Bawa failed to get going in his previous two outings, Brar has been benched to play an extra fast bowler in a potential attempt to minimize the “dew factor”. Having said that, the development means that PBKS will be once again without England wicket-keeper batter Jonny Bairstow. With Agarwal not being asked about the same, it seems that Kings don’t want to make desperate changes by providing more chances to their overseas players.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Rajat Patidar joins RCB as replacement for Luvnith Sisodia","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/rajat-patidar-joins-rcb-ipl-2022-luvnith-sisodia-replacement/article38467921.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Patidar, who represents Madhya Pradesh in domestic cricket, has played 31 T20s, thus far, and has 861 runs against his name with seven half-centuries.","content":null,"pubDate":"2022-04-03 13:47:53","full_description":"Royal Challengers Bangalore (RCB) has signed Rajat Patidar as a replacement for the injured Luvnith Sisodia for the remainder of IPL 2022, the franchise announced on Sunday. Patidar, who represents Madhya Pradesh in domestic cricket, has played 31 T20s, thus far, and has 861 runs against his name with seven half-centuries. READ | IPL 2022: Need to improve batting in powerplay, says DC coach Ponting The right-handed batter, who has previously represented the franchise on four occasions, has been signed for Rs. 20 lakh. RCB, which has so far played only two matches this season and have won and lost a game each, will take on the Rajasthan Royals on April 5 at the Wankhede Stadium, Mumbai.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Will it be Australia's seventh or England's fifth title?","link":"https://www.sentinelassam.com/sports-news/will-it-be-australias-seventh-or-englands-fifth-title-585859","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"As Australia and England prepare to clash in the ICC Women's Cricket World Cup final at the Hagley Oval on Sunday, it's indeed an irony that despite having won 10","content":"CHRISTCHURCH: As Australia and England prepare to clash in the ICC Women's Cricket World Cup final at the Hagley Oval on Sunday, it's indeed an irony that despite having won 10 of the previous 11 World Cups between them, the two sides will face off in the title round for the first time in 34 years.Australia have won six World Cups, while England have bagged four, and the two teams have a lot at stake, given that the Meg Lanning-led side would be in search of a record-extending seventh title, while England will look to defend their crown they won in 2017 at Lord's, defeating India. Australia have lost only one World Cup final. Back in 2000, at the Bert Sutcliffe Oval in Lincoln, hosts New Zealand defeated Australia by just four runs in one of the closest final encounters the tournament has ever seen. That year, England recorded their worst-ever World Cup finish of fifth before fighting back to take the trophy from Australia in 2009. That same year, England also claimed their first, and only, T20 World Cup as well as an Ashes victory. It is something that Australia are hoping to match 13 years later, as they already hold the T20 trophy having secured that on home soil in 2020 before the Ashes were sealed with two games to spare in February, but the one-day World Cup evades them. Australian vice-captain Rachael Haynes already has a winner's medal from 2013, and she is well on her way to a competition record -- the opening batter sits on 429 runs for the tournament, 27 behind Debbie Hockley of New Zealand's all-time best set in 1997. That is not the only record that could be broken in the final. England cricketer Sophie Ecclestone has the chance to surpass Australian Lyn Fullston, whose haul of 23 wickets in 1982 remains the mark to beat. Ecclestone sits on 20 wickets having taken her maiden international five-wicket haul in the semifinal against South Africa ending on s6/36, the best figures by an England bowler in a World Cup. The left-arm spinner is emblematic of England's journey in the World Cup, where she and her team didn't quite make an impact at the start but have peaked at exactly the right time. The 22-year-old started with her worst-ever figures in ODIs with none for 77 against Australia in the group stage, while England were on the verge of elimination after losing three games. Defeats to Australia, West Indies and South Africa saw England down and out, leaving the defending champions reeling, but wins against India, New Zealand, Pakistan and Bangladesh helped them book their place in the knockouts and set up a rematch of the 2017 semifinal with South Africa. England saw off the Proteas with ease to keep their hopes of a fifth title alive, and Ecclestone praised captain Heather Knight's leadership as she guided her side back from the brink. \"Obviously we didn't start off great, I think the three from three losses wasn't great but to come back the way we have. I think Heather's a big part of this group and what we've achieved, so hopefully we can go out there on Sunday and do it for Heather,\" said Ecclestone. Knight has the chance to make history as the first England captain to guide her side to back-to-back titles, that day at Lord's in 2017 is still fresh in their minds. However, Australia's memories of five years ago are morale shattering. IANS Also Read: Australian captain Meg Lanning hints star all-rounder Ellyse Perry could play finalAlso Watch: Will Smith Stormed up the Stage and struck Chris Rock across the face for joking about his wife.","pubDate":"2022-04-03 13:40:26","full_description":"CHRISTCHURCH: As Australia and England prepare to clash in the ICC Women's Cricket World Cup final at the Hagley Oval on Sunday, it's indeed an irony that despite having won 10 of the previous 11 World Cups between them, the two sides will face off in the title round for the first time in 34 years. Australia have won six World Cups, while England have bagged four, and the two teams have a lot at stake, given that the Meg Lanning-led side would be in search of a record-extending seventh title, while England will look to defend their crown they won in 2017 at Lord's, defeating India. Australia have lost only one World Cup final. Back in 2000, at the Bert Sutcliffe Oval in Lincoln, hosts New Zealand defeated Australia by just four runs in one of the closest final encounters the tournament has ever seen. That year, England recorded their worst-ever World Cup finish of fifth before fighting back to take the trophy from Australia in 2009. That same year, England also claimed their first, and only, T20 World Cup as well as an Ashes victory. It is something that Australia are hoping to match 13 years later, as they already hold the T20 trophy having secured that on home soil in 2020 before the Ashes were sealed with two games to spare in February, but the one-day World Cup evades them. Australian vice-captain Rachael Haynes already has a winner's medal from 2013, and she is well on her way to a competition record -- the opening batter sits on 429 runs for the tournament, 27 behind Debbie Hockley of New Zealand's all-time best set in 1997. That is not the only record that could be broken in the final. England cricketer Sophie Ecclestone has the chance to surpass Australian Lyn Fullston, whose haul of 23 wickets in 1982 remains the mark to beat. Ecclestone sits on 20 wickets having taken her maiden international five-wicket haul in the semifinal against South Africa ending on s6/36, the best figures by an England bowler in a World Cup. The left-arm spinner is emblematic of England's journey in the World Cup, where she and her team didn't quite make an impact at the start but have peaked at exactly the right time. The 22-year-old started with her worst-ever figures in ODIs with none for 77 against Australia in the group stage, while England were on the verge of elimination after losing three games. Defeats to Australia, West Indies and South Africa saw England down and out, leaving the defending champions reeling, but wins against India, New Zealand, Pakistan and Bangladesh helped them book their place in the knockouts and set up a rematch of the 2017 semifinal with South Africa. England saw off the Proteas with ease to keep their hopes of a fifth title alive, and Ecclestone praised captain Heather Knight's leadership as she guided her side back from the brink. \"Obviously we didn't start off great, I think the three from three losses wasn't great but to come back the way we have. I think Heather's a big part of this group and what we've achieved, so hopefully we can go out there on Sunday and do it for Heather,\" said Ecclestone. Knight has the chance to make history as the first England captain to guide her side to back-to-back titles, that day at Lord's in 2017 is still fresh in their minds. However, Australia's memories of five years ago are morale shattering. IANS Also Read: Australian captain Meg Lanning hints star all-rounder Ellyse Perry could play final Also Watch: Will Smith Stormed up the Stage and struck Chris Rock across the face for joking about his wife.","image_url":"https://assets.sentinelassam.com/h-upload/2022/04/03/331920-england.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"I remember the pressure of walking in to bat in 2011 WC final: Virat Kohli talks about that historic night","link":"https://www.sentinelassam.com/sports-news/i-remember-the-pressure-of-walking-in-to-bat-in-2011-wc-final-virat-kohli-talks-about-that-historic-night-585858","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former India skipper Virat Kohli has spoken out about the tremendous pressure he was under when he came out to bat in the 2011 World Cup final against Sri Lanka","content":"MUMBAI: Former India skipper Virat Kohli has spoken out about the tremendous pressure he was under when he came out to bat in the 2011 World Cup final against Sri Lanka at the Wankhede Stadium, with Virender Sehwag and Sachin Tendulkar back in the dressing room after being bowled out cheaply.Chasing Sri Lanka's 274 in the D/N game, Sehwag went for a duck, while Tendulkar could only manage 18 before he was caught by wicketkeeper Kumar Sangakkara off Lasith Malinga. In walked Kohli, steadying the innings along with Gautam Gambhir (97) with 35 off 49 deliveries. Thanks to Mahendra Singh Dhoni's unbeaten 91, Indian scored the required runs for the loss of four wickets with 10 balls to spare to lift the trophy. Exactly 11 years after the historic victory, Kohli narrated the feeling of walking out to bat with India wobbling in the run chase. \"I remember the pressure of walking in to bat. At 2 down for 20, I think it was — Sachin and Sehwag both got out. I was walking in... Sachin Paaji had a brief chat with me when I walked in to say 'Build a partnership'. And we did build a partnership. Me and Gautam (Gambhir) had a 90-run partnership (83)... I got 35, probably the most valuable 35 that I've scored in my cricketing career,\" Kohli told RCB Bold Diaries on Saturday. \"I felt very happy that I was a part of putting the team back on track and contributed in whatever way I could and just the thrill of winning the world cup was something unbelievable. And the whole atmosphere of the crowd singing 'Vande Mataram', and the 'Jo jeeta wohi sikandar' song — it was a surreal moment, that's something that's so fresh in our memories even now,\" added Kohli. Elaborating on the feeling in the team, Kohli said that it wanted to give Tendulkar a befitting farewell for the services he had rendered to Indian cricket. \"He (Tendulkar) has carried the burden of the nation for 21 years, it was time we carried him,\" were Kohli's memorable quotes from the evening. On Saturday, Kohli said he meant every word of it. \"I said what I said. It was true; legacy had to be taken forward. Massive shoes to fill, and I think we all have tried to contribute to Indian cricket close to what we can, but his achievements are so great and so far-fetched and done over such a long period of time that it feels surreal to actually be in that process after 11 years, I stand here. I said what I said back then, but now I understand the weight of those expectations.\" IANS Also Read: Kohli, Pant, Sharma slip further in Test rankings; Ashwin No. 2 among all-roundersAlso Watch: A Man from Tamil Nadu Bought his Dream Bike with Rs. 1 Coins he saved over 3 Years.","pubDate":"2022-04-03 13:38:02","full_description":"MUMBAI: Former India skipper Virat Kohli has spoken out about the tremendous pressure he was under when he came out to bat in the 2011 World Cup final against Sri Lanka at the Wankhede Stadium, with Virender Sehwag and Sachin Tendulkar back in the dressing room after being bowled out cheaply. Chasing Sri Lanka's 274 in the D/N game, Sehwag went for a duck, while Tendulkar could only manage 18 before he was caught by wicketkeeper Kumar Sangakkara off Lasith Malinga. In walked Kohli, steadying the innings along with Gautam Gambhir (97) with 35 off 49 deliveries. Thanks to Mahendra Singh Dhoni's unbeaten 91, Indian scored the required runs for the loss of four wickets with 10 balls to spare to lift the trophy. Exactly 11 years after the historic victory, Kohli narrated the feeling of walking out to bat with India wobbling in the run chase. \"I remember the pressure of walking in to bat. At 2 down for 20, I think it was — Sachin and Sehwag both got out. I was walking in... Sachin Paaji had a brief chat with me when I walked in to say 'Build a partnership'. And we did build a partnership. Me and Gautam (Gambhir) had a 90-run partnership (83)... I got 35, probably the most valuable 35 that I've scored in my cricketing career,\" Kohli told RCB Bold Diaries on Saturday. \"I felt very happy that I was a part of putting the team back on track and contributed in whatever way I could and just the thrill of winning the world cup was something unbelievable. And the whole atmosphere of the crowd singing 'Vande Mataram', and the 'Jo jeeta wohi sikandar' song — it was a surreal moment, that's something that's so fresh in our memories even now,\" added Kohli. Elaborating on the feeling in the team, Kohli said that it wanted to give Tendulkar a befitting farewell for the services he had rendered to Indian cricket. \"He (Tendulkar) has carried the burden of the nation for 21 years, it was time we carried him,\" were Kohli's memorable quotes from the evening. On Saturday, Kohli said he meant every word of it. \"I said what I said. It was true; legacy had to be taken forward. Massive shoes to fill, and I think we all have tried to contribute to Indian cricket close to what we can, but his achievements are so great and so far-fetched and done over such a long period of time that it feels surreal to actually be in that process after 11 years, I stand here. I said what I said back then, but now I understand the weight of those expectations.\" IANS Also Read: Kohli, Pant, Sharma slip further in Test rankings; Ashwin No. 2 among all-rounders Also Watch: A Man from Tamil Nadu Bought his Dream Bike with Rs. 1 Coins he saved over 3 Years.","image_url":"https://assets.sentinelassam.com/h-upload/2022/04/03/331919-virat-kohli.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Punjab Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-punjab-kings-live-score-over-match-11-t20-1-5-updates-2860325","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Punjab Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-03 13:37:44","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 0.0 overs, Punjab Kings are 0/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Chennai Super Kings and Punjab Kings. Everything related to Chennai Super Kings and Punjab Kings match will be available on Sports.NDTV.com . Stay updated with Chennai Super Kings vs Punjab Kings live score. Do check for Chennai Super Kings vs Punjab Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. Punjab have a strong batting lineup but they faltered in the last game when they batted first. Can they put up a better performance in this game? Also, Chennai have boosted their bowling attack as Chris Jordan with all his experience and death bowling skills replaces Tushar Deshpande. It will be an interesting battle, let's see how things pan out. Mayank Agarwal, the skipper of Punjab, says that it looks like a good batting wicket and it will be nice to put runs on the board. Tells that it was an off day in the last game but they did not need to ponder a lot about that. Mentions that they need to learn from that game though. Tells that they have couple of changes as Vaibhav Arora comes in for Harpreet Brar and Jitesh Sharma comes in for Raj Bawa. Ravindra Jadeja, the skipper of Chennai, says that they will bowl first. He adds that they try to keep things very simple and back each and every player. Mentions that they have experienced players who know how to perform when under the pump. Informs that they have one change as Chris Jordan comes in place of Tushar Deshpande. Punjab (Playing XI) - Mayank Agarwal (C), Shikhar Dhawan, Bhanuka Rajapaksa (WK), Liam Livingstone, Shahrukh Khan, Odean Smith, Jitesh Sharma (In place of Raj Bawa), Rahul Chahar, Kagiso Rabada, Arshdeep Singh, Vaibhav Arora (In place of Harpreet Brar). Chennai (Playing XI) - Robin Uthappa, Ruturaj Gaikwad, Moeen Ali, Shivam Dube, Ambati Rayudu, Ravindra Jadeja (C), MS Dhoni (WK), Dwaine Pretorius, Dwayne Bravo, Chris Jordan (In place of Tushar Deshpande), Mukesh Choudhary. TOSS - The coin goes up and lands in favour of Chennai. They have elected to BOWL first. The live pictures show that Vaibhav Arora and Jitesh Sharma are getting their caps in the Punjab huddle. So expect at least two changes in the Punjab lineup today. PITCH REPORT - Matthew Hayden is pitchside. Haydos mentions that there is an anti-dew agent that is being sprayed onto the pitch to counter the dew a bit. He adds that the side towards the ocean is much longer and the boundaries are about 80 meters but the wicket is an absolute cracker. Reckons it will be a batting paradise and the team batting first will have to post a mammoth total. Chennai, on the other hand, put together a strong batting performance in the last game and with Moeen Ali back in the fold, the batting looks quite formidable. MS Dhoni has truly turned back the clock at the start of the tournament and is set to play his 350th T20 match tonight. However, the bowling looks quite inexperienced and that will remain a big concern against a strong batting lineup of Punjab. Except for Dwayne Bravo and Dwaine Pretorius in the last game, everyone else struggled and it remains to be seen how they go about their business tonight. Their skipper, Jadeja surely needs to contribute more than he has done so far. Can they bring their A-game onto the table and register their first win of the season? Or will Punjab overpower them? We shall find out. Toss and team sheets in a while. Punjab have one of the strongest teams on the paper with some tremendous firepower in their batting unit. If they get going with all their might, we might see plenty of big scores from this Punjab batting lineup this season. Their batting will be boosted further tonight with Jonny Bairstow now available for the selection. The bowling is led by Kagiso Rabada and he has some able bowlers to support him like Rahul Chahar, Arshdeep Singh. However, the biggest positive for them is the presence of hard-hitting all-rounders like Odean Smith and Liam Livingstone and we can expect this power-packed lineup to come out all guns blazing tonight. Our daily dose of some mouth-watering T20 action continues as the defending champions, Chennai go head-to-head against Punjab at Brabourne Stadium, Mumbai. Punjab started on a bright note with a win in the first game but failed to deliver the goods in their second game. Chennai, on the other hand, were better in the second game but ended on a losing note yet again, thus failing to open their account in the two games so far. ... MATCH DAY …","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637846096562967602.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans register second win in IPL","link":"https://www.sentinelassam.com/sports-news/gujarat-titans-register-second-win-in-ipl-585856","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Gujarat Titans registered their second win in the IPL 2022 on Saturday night as they defeated Delhi Capitals by 14 runs at the Maharashtra Cricket Association Stadium.","content":"PUNE: Gujarat Titans registered their second win in the IPL 2022 on Saturday night as they defeated Delhi Capitals by 14 runs at the Maharashtra Cricket Association Stadium.Batting first, opener Shubman Gill's fantastic knock (84 off 46) propelled Gujarat Titans to 171-6. In reply, Delhi Capitals could manage 157 in allotted 20 overs losng 9 wickets. Skipper Rishav Pant made 43 off 29 while Lalit Yadav and Rovman Powell added 25 and 20 respectively. New Zealand pacer Lockie Ferguson took 4 wickets for 28 while Mohammed Shami claimed 2 wickets for 30. Earlier, apart from Gill, skipper Hardik Pandya (31 off 27) and David Miller (20 not out off 15) also made valuable contributions with the bat for Gujarat. Invited to bat first, Gujarat Titans didn't have a great start as Mustafizur Raham struck in the first over of the innings to dismiss Matthew Wade for 1. However, the wicket didn't affect Shubman Gill, who played some strokes to score some quick runs for Gujarat. On the other hand, Vijay Shankar, who came to bat at No 3 was struggling to time the ball against the Delhi seamers. Nevertheless, Gill continued his beast mode and took Gujarat to 44/1 after the 6 overs. As soon as powerplay came to an end, skipper Rishabh Pant brought Kuldeep Yadav into the attack and he gave Delhi the breakthrough in the very first ball of the over by removing Vijay Shankar (13). Mustafizur (3/23) was the highest wicket-taker for Delhi Capitals while Khaleel Ahmed (2/34) and Kuldeep Yadav (1/32) also chipped in with wickets. Brief scores: Gujarat Titans -- 171-6 in 20 overs (Shubman Gill 84, Hardik Pandya 31; Mustafizur Rahman (3/23) beat Delhi Capitals 157/9 in 20 overs (Pant 43, Ferguson 4/28). Agencies Also Read: Delhi Capitals Test Awaits Gujarat TitansAlso Watch: Heavy Fog and a Snow Squall created a mass pileup on Monday on a Pennsylvania Highway #shorts","pubDate":"2022-04-03 13:31:30","full_description":"PUNE: Gujarat Titans registered their second win in the IPL 2022 on Saturday night as they defeated Delhi Capitals by 14 runs at the Maharashtra Cricket Association Stadium. Batting first, opener Shubman Gill's fantastic knock (84 off 46) propelled Gujarat Titans to 171-6. In reply, Delhi Capitals could manage 157 in allotted 20 overs losng 9 wickets. Skipper Rishav Pant made 43 off 29 while Lalit Yadav and Rovman Powell added 25 and 20 respectively. New Zealand pacer Lockie Ferguson took 4 wickets for 28 while Mohammed Shami claimed 2 wickets for 30. Earlier, apart from Gill, skipper Hardik Pandya (31 off 27) and David Miller (20 not out off 15) also made valuable contributions with the bat for Gujarat. Invited to bat first, Gujarat Titans didn't have a great start as Mustafizur Raham struck in the first over of the innings to dismiss Matthew Wade for 1. However, the wicket didn't affect Shubman Gill, who played some strokes to score some quick runs for Gujarat. On the other hand, Vijay Shankar, who came to bat at No 3 was struggling to time the ball against the Delhi seamers. Nevertheless, Gill continued his beast mode and took Gujarat to 44/1 after the 6 overs. As soon as powerplay came to an end, skipper Rishabh Pant brought Kuldeep Yadav into the attack and he gave Delhi the breakthrough in the very first ball of the over by removing Vijay Shankar (13). Mustafizur (3/23) was the highest wicket-taker for Delhi Capitals while Khaleel Ahmed (2/34) and Kuldeep Yadav (1/32) also chipped in with wickets. Brief scores: Gujarat Titans -- 171-6 in 20 overs (Shubman Gill 84, Hardik Pandya 31; Mustafizur Rahman (3/23) beat Delhi Capitals 157/9 in 20 overs (Pant 43, Ferguson 4/28). Agencies Also Read: Delhi Capitals Test Awaits Gujarat Titans Also Watch: Heavy Fog and a Snow Squall created a mass pileup on Monday on a Pennsylvania Highway #shorts","image_url":"https://assets.sentinelassam.com/h-upload/2022/04/03/331917-gujarat-titans.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Brabourne Stadium IPL matches 2022: CCI Brabourne Stadium IPL time table 2022","link":"https://thesportsrush.com/cricket-news-brabourne-stadium-ipl-matches-2022-cci-brabourne-stadium-ipl-time-table-2022/","keywords":["Cricket","IPL 2022","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Brabourne Stadium IPL matches 2022 schedule: Brabourne Stadium in Mumbai is hosting T20s after as many as seven years. Been devoid of T20 cricket for almost seven years, the iconic Brabourne Stadium is back in limelight because of the ongoing 15th season of the Indian Premier League. In the past, Brabourne had hosted 11 IPL… The post Brabourne Stadium IPL matches 2022: CCI Brabourne Stadium IPL time table 2022 appeared first on The SportsRush.","content":"Brabourne Stadium IPL matches 2022 schedule: Brabourne Stadium in Mumbai is hosting T20s after as many as seven years. Been devoid of T20 cricket for almost seven years, the iconic Brabourne Stadium is back in limelight because of the ongoing 15th season of the Indian Premier League. In the past, Brabourne had hosted 11 IPL matches across three seasons (2010, 2014 and 2015). A third wave of COVID-19 resulting in IPL 2022 league stage being played in close proximity fetched this stadium as many as 15 matches. One out of the four venues which were shortlisted to host 70 IPL 2022 league matches, Brabourne has already hosted a couple of intriguing matches. With seven out of 10 matches this season won by teams batting second, Brabourne showed no different trend as chases of 178 and 211 were sealed here in the first two matches. While Delhi Capitals had defeated Mumbai Indians on the second day of the tournament, Lucknow Super Giants had trumped defending champions Chennai Super Kings on Thursday. Brabourne Stadium IPL matches 2022 schedule Also known as the CCI (Cricket Club of India), this stadium will be hosting 13 more IPL 2022 league stage matches including a Super Kings vs Punjab Kings contest tonight. Hello, Brabourne! Let’s gooo @ChennaiIPL! #IPL2022 #WhistlePodu #CSKvPBKS pic.twitter.com/wk77w4mT3z — Praveen Thirumurugan (@PraveenTcom) April 3, 2022 Cricket fans in Mumbai, who have the opportunity of watching top-notch cricketers in action multiple times this season, will also see Indians playing two more matches (against two new teams) at the Brabourne Stadium. April 3 – Chennai Super Kings vs Punjab Kings at 19:30 hours (IST) April 8 – Punjab Kings vs Gujarat Titans at 19:30 hours (IST) April 10 – Kolkata Knight Riders vs Delhi Capitals at 15:30 hours (IST) April 15 – Sunrisers Hyderabad vs Kolkata Knight Riders at 19:30 hours (IST) April 16 – Mumbai Indians vs Lucknow Super Giants at 15:30 hours (IST) April 18 – Rajasthan Royals vs Kolkata Knight Riders at 19:30 hours (IST) April 23 – Royal Challengers Bangalore vs Sunrisers Hyderabad at 19:30 hours (IST) April 30 – Gujarat Titans vs Royal Challengers Bangalore at 15:30 hours (IST) May 5 – Delhi Capitals vs Sunrisers Hyderabad at 19:30 hours (IST) May 6 – Gujarat Titans vs Mumbai Indians at 19:30 hours (IST) May 13 – Royal Challengers Bangalore vs Punjab Kings at 19:30 hours (IST) May 15 – Lucknow Super Giants vs Rajasthan Royals at 19:30 hours (IST) May 20 – Rajasthan Royals vs Chennai Super Kings at 19:30 hours (IST) The post Brabourne Stadium IPL matches 2022: CCI Brabourne Stadium IPL time table 2022 appeared first on The SportsRush.","pubDate":"2022-04-03 13:24:50","full_description":"Brabourne Stadium IPL matches 2022 schedule: Brabourne Stadium in Mumbai is hosting T20s after as many as seven years. Been devoid of T20 cricket for almost seven years, the iconic Brabourne Stadium is back in limelight because of the ongoing 15th season of the Indian Premier League. In the past, Brabourne had hosted 11 IPL matches across three seasons (2010, 2014 and 2015). A third wave of COVID-19 resulting in IPL 2022 league stage being played in close proximity fetched this stadium as many as 15 matches. One out of the four venues which were shortlisted to host 70 IPL 2022 league matches, Brabourne has already hosted a couple of intriguing matches. With seven out of 10 matches this season won by teams batting second, Brabourne showed no different trend as chases of 178 and 211 were sealed here in the first two matches. While Delhi Capitals had defeated Mumbai Indians on the second day of the tournament, Lucknow Super Giants had trumped defending champions Chennai Super Kings on Thursday. Also known as the CCI (Cricket Club of India), this stadium will be hosting 13 more IPL 2022 league stage matches including a Super Kings vs Punjab Kings contest tonight. Hello, Brabourne! Let’s gooo @ChennaiIPL ! 😎 #IPL2022 #WhistlePodu #CSKvPBKS pic.twitter.com/wk77w4mT3z — Praveen Thirumurugan (@PraveenTcom) April 3, 2022 Cricket fans in Mumbai, who have the opportunity of watching top-notch cricketers in action multiple times this season, will also see Indians playing two more matches (against two new teams) at the Brabourne Stadium. April 3 – Chennai Super Kings vs Punjab Kings at 19:30 hours (IST) April 8 – Punjab Kings vs Gujarat Titans at 19:30 hours (IST) April 10 – Kolkata Knight Riders vs Delhi Capitals at 15:30 hours (IST) April 15 – Sunrisers Hyderabad vs Kolkata Knight Riders at 19:30 hours (IST) April 16 – Mumbai Indians vs Lucknow Super Giants at 15:30 hours (IST) April 18 – Rajasthan Royals vs Kolkata Knight Riders at 19:30 hours (IST) April 23 – Royal Challengers Bangalore vs Sunrisers Hyderabad at 19:30 hours (IST) April 30 – Gujarat Titans vs Royal Challengers Bangalore at 15:30 hours (IST) May 5 – Delhi Capitals vs Sunrisers Hyderabad at 19:30 hours (IST) May 6 – Gujarat Titans vs Mumbai Indians at 19:30 hours (IST) May 13 – Royal Challengers Bangalore vs Punjab Kings at 19:30 hours (IST) May 15 – Lucknow Super Giants vs Rajasthan Royals at 19:30 hours (IST) May 20 – Rajasthan Royals vs Chennai Super Kings at 19:30 hours (IST)","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"PRS-XI vs BTR Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Vincy Premier League T10, Exhibition Match","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/prs-xi-vs-btr-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-vincy-premier-league-t10-exhibition-match?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-03 13:15:46","full_description":"Presidents-XI will take on Best of the Rest in the Exhibition match of the Vincy Premier League T10 at the Arnos Vale Ground in St Vincent on Sunday. This exhibition match is part of the tradition of the Vincy Premier League and will be held this year as well with some big names involved. Presidents-XI consists of players like Darren Sammy and Miles Bascombe. Best of the Rest, meanwhile, have some exciting players in their lineup and many of them are in their prime. Asif Hooper, Sealroy Williams and Wesrick Strough are the most prominent players for them. PRS-XI XI Romel Currency, Miles Bascombe, Kishore Shallow, Elron Lewis, Roland Wilkinson, Carl Dickson, Daren Sammy, Camillo Gonsalves, Rajiv Roberts, Deighton Butler, Marlon John BTR XI Tilron Harry, Sealroy Williams, Kody Horne, Urnel Thomas, Newton Browne Jr., Asif Hooper, Richie Richards, Wesrick Strough, Sealron Williaams, Luke Wilson, Reynolly Hillocks/Aleon Caesar PRS-XI vs BTR, Vincy Premier League T10, Exhibition Match Date and Time: April 3, 2022, 9:30 PM IST Venue: Arnos Vale Ground, St Vincent Judging by previous games, the track seems to be friendly to the batters. Batters will be expected to play big shots with a sense of freedom in the shortened ten-over format. Pacers might extract some assistance in the latter half of matches. Wicketkeeper R Currency is a great choice for the wicket-keeper role. He can strike the ball clean and hard and will be looking to rediscover his form in this match. Batters M Bascombe has had a great tournament and in nine matches, he has scored 171 runs. Bascombe has a strike rate of 143. S Williams has amassed 110 runs so far in the tournament. His highest score is 31. All-rounders A Hooper is an interesting all-rounder who can prove to be important for his team. He has scored 111 runs and has also picked up five wickets in the competition. He can prove to be a wonderful multiplier choice for your Dream11 fantasy side. Bowlers W Strough is a wonderful bowler who will be looking to strike early for his side. He has picked up two wickets in the last two matches. W Strough (BTR) – 398 points A Hooper (BTR) – 382 points S Williaams (BTR) – 376 points R Richards (BTR) – 332 points M Bascombe (PRS-XI) – 303 points A Hooper: 111 runs and 5 wickets S Williams: 110 runs M Bascombe: 171 runs Fantasy Suggestion #1: R Currency, M Bascombe, S Williams, K Horne, C Dickson, A Hooper, R Richards, D Sammy, W Strough, S Williaams, D Butler Captain: A Hooper, Vice-Captain: M Bascombe Fantasy Suggestion #2: R Currency, M Bascombe, S Williams, K Shallow, C Gonsalves, A Hooper, R Richards, D Sammy, W Strough, S Williaams, D Butler Captain: D Sammy , Vice-Captain: W Strough.","image_url":"https://static.sportskeeda.com/editor/2022/04/a6cbb-16489888536618-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad lodge protest over Kane Williamson's dismissal","link":"https://www.sentinelassam.com/sports-news/sunrisers-hyderabad-lodge-protest-over-kane-williamsons-dismissal-585848","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"2016 IPL champions Sunrisers Hyderabad have lodged a protest over the controversial dismissal of their Kane Williamson in their opening match of 2022 season","content":"MUMBAI: 2016 IPL champions Sunrisers Hyderabad have lodged a protest over the controversial dismissal of their Kane Williamson in their opening match of 2022 season against Rajasthan Royals, says a report by Cricbuzz.The team management of the Hyderabad-based franchise has written to the Indian Premier League (IPL) officials, protesting the third umpire's decision against their skipper's dismissal at the MCA Stadium in Pune on March 29. \"Yes, we've written to the Board of Control for Cricket in India (BCCI). The procedure is that the coach has to write and the process has been followed,\" a franchise official from Hyderabad was quoted as saying in the report. It also said that a spokesman for the team management added their protest was also mentioned in the captain's report which is given to the IPL match referee after each game. In the match, while chasing a mammoth 211 against Rajasthan, Hyderabad were dealt an early blow when Williamson was caught by Devdutt Padikkal at slip for a seven-ball two in the second over. A delivery from pacer Prasidh Krishna squared up the New Zealand skipper, who poked at it and wicketkeeper-captain Sanju Samson tried to catch it. Samson dived and managed to get one hand to the ball. But it popped out of his hand and an alert Padikkal dived forward to catch the ball. After the on-field umpires referred the decision to the third umpire, KN Ananthapadmanabhan ruled that the catch was clean though many felt that the ball had bounced before Padikkal completed the catch. Moreover, after the match ended, Williamson was fined INR 12 lakhs for maintaining a slow over rate. IANS Also Read: SRH fined Rs 12 lakh for slow over rateAlso Watch: Assam, Meghalaya Sign Agreement To Resolve Boundary Dispute","pubDate":"2022-04-03 13:02:49","full_description":"MUMBAI: 2016 IPL champions Sunrisers Hyderabad have lodged a protest over the controversial dismissal of their Kane Williamson in their opening match of 2022 season against Rajasthan Royals, says a report by Cricbuzz. The team management of the Hyderabad-based franchise has written to the Indian Premier League (IPL) officials, protesting the third umpire's decision against their skipper's dismissal at the MCA Stadium in Pune on March 29. \"Yes, we've written to the Board of Control for Cricket in India (BCCI). The procedure is that the coach has to write and the process has been followed,\" a franchise official from Hyderabad was quoted as saying in the report. It also said that a spokesman for the team management added their protest was also mentioned in the captain's report which is given to the IPL match referee after each game. In the match, while chasing a mammoth 211 against Rajasthan, Hyderabad were dealt an early blow when Williamson was caught by Devdutt Padikkal at slip for a seven-ball two in the second over. A delivery from pacer Prasidh Krishna squared up the New Zealand skipper, who poked at it and wicketkeeper-captain Sanju Samson tried to catch it. Samson dived and managed to get one hand to the ball. But it popped out of his hand and an alert Padikkal dived forward to catch the ball. After the on-field umpires referred the decision to the third umpire, KN Ananthapadmanabhan ruled that the catch was clean though many felt that the ball had bounced before Padikkal completed the catch. Moreover, after the match ended, Williamson was fined INR 12 lakhs for maintaining a slow over rate. IANS Also Read: SRH fined Rs 12 lakh for slow over rate Also Watch: Assam, Meghalaya Sign Agreement To Resolve Boundary Dispute","image_url":"https://assets.sentinelassam.com/h-upload/2022/04/03/331910-sunrisers-hyderabad.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, CSK vs PBKS Live Cricket Score Online: Chennai-Punjab lock horns in Kings’ clash","link":"https://indianexpress.com/article/sports/ipl/ipl-2022-csk-vs-pbks-live-cricket-score-online-updates-match-11-chennai-vs-punjab-7850632/","keywords":["IPL 2022","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-04-03 13:00:49","full_description":"Chennai Super Kings have so far looked like anything but IPL’s defending champions and to effect a turnaround, new skipper will seek improvements on multiple fronts against Punjab Kings on Sunday. CSK’s title defense has begun on a disappointing note. After going down to Kolkata Knight Riders in the tournament opener, they lost to new entrants Lucknow Super Giants. While the batting unit failed to fire in the opening game, heavy dew made life difficult for the bowlers as they failed to defend a target in excess of 200 runs. Punjab Kings, on the other hand, have quite a few big hitters in their ranks, but they faltered against Kolkata Knight Riders. In order to win this match, PBKS has to look towards its captain Mayank Agarwal for a big innings. Captain ready to set the tone 👌 👌 | | A special on the cards❓ | | Smarting from a six-wicket defeat against the Kolkata Knight Riders, the Punjab Kings will look to go back to winning ways against an out of form Chennai. Super 🦁s have set off for 💥 Chennai has had a tough time in the IPL lately, losing both teir opening matches to Kolkata and newcomers Lucknow. They will need all their batters to fire tonight if the want to win this clash. Singa nadai into the Sunday evening.! The clash of the Kings awaits… 🥳 💛🦁 In IPL history so far, both teams have played 25 games out of which 15 have been won by the CSK team, while Punjab has won the rest of the 10 matches. Shikhar Dhawan, Mayank Agarwal, Bhanuka Rajapaksa, Liam Livingstone, Shahrukh Khan, Raj Angad Bawa, Odean Smith, Harpreet Brar, Kagiso Rabada, Arshdeep Singh, Sandeep Sharma. Ruturaj Gaikwad, Devon Conway, Robin Uthappa, Ambati Rayudu, Ravindra Jadeja (c), MS Dhoni (wk), Rajvardhan Hangargekar, Dwayne Bravo, Tushar Deshpande, Maheesh Theekshana, Adam Milne. Hello and welcome to our live coverage of the 11 IPL match of the season where Chennai Super Kings take on the Punjab Kings. CSK’s title defense has begun on a disappointing note. After going down to Kolkata Knight Riders in the tournament opener, they lost to new entrants Lucknow Super Giants. While the batting unit failed to fire in the opening game, heavy dew made life difficult for the bowlers as they failed to defend a target in excess of 200 runs. Punjab Kings, on the other hand, have quite a few big hitters in their ranks, but they faltered against Kolkata Knight Riders. Smarting from a six-wicket defeat, they will be eager to return to winning ways and would expect the batters to step up. With Mayank Agarwal, Shikhar Dhawan, Bhanuka Rajapaksa at the top, Punjab can dominate the opposition attack with ease. Hello & welcome from the Brabourne Stadium - CCI for Match 1⃣1⃣ of the 2022 👋 👋 It's the -led who will square off against the , led by . 👍 👍 Which team are you rooting for tonight? 🤔 🤔","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"}]}