{"newsArray":[{"title":"“I was absolutely inconsolable”: Abhinav Mukund recollects dropping Steve Smith in Pune Test after Arshdeep Singh drops Asif Ali in Dubai T20I","link":"https://thesportsrush.com/cricket-news-i-was-absolutely-inconsolable-abhinav-mukund-recollects-dropping-steve-smith-in-pune-test-after-arshdeep-singh-drops-asif-ali-in-dubai-t20i/","keywords":["Cricket","Abhinav Mukund","Arshdeep Singh","asia cup","Asia Cup 2022","Asif Ali","Australia","India","Pakistan","Steven Smith"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Abhinav Mukund recollects dropping Steve Smith: The substitute Indian fielder had dropped the then Australian captain twice. India fast bowler Arshdeep Singh has been at the receiving end of immense support right since dropping Pakistan batter Asif Ali in the recently concluded Asia Cup 2022 Super 4 match at the Dubai International Cricket Stadium. Fielding… The post “I was absolutely inconsolable”: Abhinav Mukund recollects dropping Steve Smith in Pune Test after Arshdeep Singh drops Asif Ali in Dubai T20I appeared first on The SportsRush.","content":"Abhinav Mukund recollects dropping Steve Smith: The substitute Indian fielder had dropped the then Australian captain twice. India fast bowler Arshdeep Singh has been at the receiving end of immense support right since dropping Pakistan batter Asif Ali in the recently concluded Asia Cup 2022 Super 4 match at the Dubai International Cricket Stadium. Fielding at short third man, Arshdeep couldn’t grab what would’ve been an absolute sitter. With the batter top-edging an attempted slog off spinner Ravi Bishnoi, all he had done was lob the ball towards Arshdeep. Perhaps a bit casual due to the extremely easy nature of the catch, Arshdeep ended up committing a schoolboy error. Ali, who was facing just his first delivery, made the most of a reprieve by hitting a six and two fours in the next Bhuvneshwar Kumar over to play a crucial hand in accumulating as many as 19 runs in the penultimate over. Having brought the equation to Pakistan needing only seven runs in the last over, Ali had played a titular role in finishing the match successfully to register their fifth-highest T20I run-chase, fifth-highest run-chase in Dubai T20s and the sixth-highest T20I run-chase against India. Abhinav Mukund recollects dropping Steve Smith in Pune Test after Arshdeep Singh drops Asif Ali in Dubai T20I In spite of his mistake, Arshdeep has been spoken against making the scapegoat for a 5-wicket loss. Arshdeep, 23, who tried his best to take the match to penultimate ball despite having just seven runs to defend, has received backing from his India and Punjab teammates, former cricketers and even celebrities from the showbiz. Veteran India batter Abhinav Mukund recollected a personal experience of being “inconsolable” after dropping a catch at the highest level. Mukund, who played seven Tests for India between 2011-2017, was on the field as a substitute fielder when he dropped the then Australia captain Steven Smith not once but twice at the Maharashtra Cricket Association Stadium half-a-decade ago. Smith, who had scored a memorable second innings century regardless of as many as four chances by Murali Vijay, Mukund and Ajinkya Rahane, had led from the front in a match-winning knock. Mukund, whose fielding had played a part in a lost Test (only one in eight years for India at home) after an embarrassing batting collapse, hoped for “gutted” Arshdeep to not be feeling like he did back in the day. After dropping steve smith in the pune test, i was absolutely inconsolable for hours alone in my room. I really hope @arshdeepsinghh doesnt feel that way. He will be more gutted than anyone else in our country tonight. Lets cut him some slack! #INDvsPAK — Abhinav Mukund (@mukundabhinav) September 4, 2022 India are slated to face Sri Lanka in their next match on Tuesday. The post “I was absolutely inconsolable”: Abhinav Mukund recollects dropping Steve Smith in Pune Test after Arshdeep Singh drops Asif Ali in Dubai T20I appeared first on The SportsRush.","pubDate":"2022-09-05 00:20:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Trent Rockets crowned Hundred champions after beating Manchester Originals in low-scoring thriller","link":"https://metro.co.uk/2022/09/04/cricket-the-hundred-trent-rockets-crowned-champions-lords-thriller-17298198/","keywords":["Cricket","England cricket","The Hundred"],"creator":["Louis Sealey"],"video_url":null,"description":"Captain Lewis Gregory led the Rockets to victory.","content":"Trent Rockets were crowned men’s Hundred champions after beating Manchester Originals in a low-scoring thriller at Lord’s. On a difficult pitch, the Originals posted 120-9 as Sam Cook took 4-18 and Samit Patel claimed 3-23. The Rockets also found batting tricky and still needed 14 to win from eight balls when they slipped to 107-8. Josh Little, Paul Walter, Tom Hartley and Matt Parkinson all took two wickets as Manchester Originals closed in on victory in the Hundred final. But Trent Rockets captain Lewis Gregory fired his side over the line by hitting a brilliant six and another boundary, followed by a single to clinch victory with two balls remaining. ‘What a place to play,’ Gregory said. ‘To win a final here is amazing and the crowd have been fantastic tonight and throughout the whole competition.’ Manchester Originals skipper Laurie Evans added: ‘You’ve got to hand it to the Trent Rockets, they played the better cricket throughout. Oh, what a night ð¥ #LoveLords | #TheHundred pic.twitter.com/B7yvu3qZQZ ‘I think we misread the pitch early on. I think all the way through we lost too many wickets and they bowled well. We just didn’t get over the line today.’ Former England bowler Steven Finn hailed Nottinghamshire all-rounder Gregory following his match-winning cameo, telling BBC Sport: ‘Under pressure that was an outstanding shot. ‘He has hit that so clean. To maintain his focus, hold his shape and time the ball to the boundary was an unbelievable piece of composure.’ Earlier in the day, Oval Invincibles successfully defended their women’s Hundred title with a comfortable victory over Southern Brave . MORE : Jonny Bairstow ruled out of T20 World Cup after ‘freak golf accident’ MORE : County cricket needs to thrive to help Test Match performances For more stories like this, check our sport page . Follow Metro Sport for the latest news on Facebook , Twitter and Instagram .","pubDate":"2022-09-04 22:01:42","image_url":"https://metro.co.uk/wp-content/uploads/2022/09/GettyImages-1420584853.jpg?quality=90&strip=all","source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"“Form is brilliant”: Rohit Sharma compliments Virat Kohli on scoring consecutive half-centuries in Asia Cup 2022","link":"https://thesportsrush.com/cricket-news-form-is-brilliant-rohit-sharma-compliments-virat-kohli-on-scoring-consecutive-half-centuries-in-asia-cup-2022/","keywords":["Cricket","India Cricket Team","asia cup","Asia Cup 2022","India","Pakistan","Rohit Sharma","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma compliments Virat Kohli: The Indian captain sounded satisfied with his predecessor’s batting form. India captain Rohit Sharma admitted to be drained after suffering a 5-wicket defeat against Pakistan in Asia Cup 2022 Match 8 at the Dubai International Cricket Stadium tonight. Pakistan, who sealed a 182-run target with a ball remaining in the… The post “Form is brilliant”: Rohit Sharma compliments Virat Kohli on scoring consecutive half-centuries in Asia Cup 2022 appeared first on The SportsRush.","content":"Rohit Sharma compliments Virat Kohli: The Indian captain sounded satisfied with his predecessor’s batting form. India captain Rohit Sharma admitted to be drained after suffering a 5-wicket defeat against Pakistan in Asia Cup 2022 Match 8 at the Dubai International Cricket Stadium tonight. Pakistan, who sealed a 182-run target with a ball remaining in the match, managed to register their fifth-highest T20I run-chase , fifth-highest run-chase in Dubai T20s and the sixth-highest T20I run-chase against India. While achieving these feats were no mean task for Pakistan, they were assisted by a match-winning 41-ball 73-run third-wicket partnership between wicket-keeper batter Mohammad Rizwan (71) and all-rounder Mohammad Nawaz (42). Absolutely fantastic performance from @iMRizwanPak and M. Nawaz in this brilliant run chase against India. This is a team game for a reason. We win as a team. We lose as a team. In sha Allah, I know my shortcomings in today’s game & will come back stronger. #PakistanZindabad pic.twitter.com/pyKWq5RQv8 — Fakhar Zaman (@FakharZamanLive) September 4, 2022 Winning almost all the challenges put on display by the Indian bowlers and fielders, both Rizwan and Nawaz hit a total of six fours and two sixes at strike rates of 139.21 and 210 respectively. “A game like that can take a lot. We were calm even when there was a partnership between [Mohammad] Rizwan and [Mohammad] Nawaz. But that partnership obviously went a little long and they batted brilliantly,” Sharma told Star Sports during the post-match presentation ceremony. Sharma, however, sounded pleased with his predecessor Virat Kohli scoring consecutive half-centuries to further confirm hints of finding back his lone lost form. Kohli is the second-highest run-scorer in the tournament thus far with his 154 runs coming at an average and strike rate of 77 and 126.22 respectively. Coming in to bat at No. 3 in the sixth over, Kohli scored 60 (44) inclusive of four fours and a six before getting out in the last over of the innings. While Kohli would want to further improve his strike rate, him looking in control of his game is a treat to watch after having seen him struggle across formats for over a year. “The form is brilliant. Needed someone to bat long when the others were getting out. He batted with that tempo as well. Virat [Kohli] getting that score was crucial from the team’s point of view,” Sharma said of Kohli. In what was Kohli’s 32nd T20I half-century , it was his 27th at No. 3, 25th in Asia, ninth at a neutral venue, fourth against Pakistan, third in the UAE, in 2022 and under Sharma.","pubDate":"2022-09-04 20:34:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Arsh is GOLD”: Harbhajan Singh urges fans to stop criticizing Arshdeep Singh for drop catch in Asia Cup 2022 match vs Pakistan in Dubai","link":"https://thesportsrush.com/cricket-news-arsh-is-gold-harbhajan-singh-urges-fans-to-stop-criticizing-arshdeep-singh-for-drop-catch-in-asia-cup-2022-match-vs-pakistan-in-dubai/","keywords":["Cricket","Arshdeep Singh","Asia Cup 2022","Harbhajan Singh","India","Pakistan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Harbhajan Singh urges fans to cut some slack on Arshdeep Singh for a dropped catch at a crucial juncture against Pakistan in Dubai. Despite being only one of the two Indian bowlers to return with economical bowling figures on a day when majority Pakistan batters were at their flawless best, India’s left-arm pacer Arshdeep Singh… The post “Arsh is GOLD”: Harbhajan Singh urges fans to stop criticizing Arshdeep Singh for drop catch in Asia Cup 2022 match vs Pakistan in Dubai appeared first on The SportsRush.","content":"Harbhajan Singh urges fans to cut some slack on Arshdeep Singh for a dropped catch at a crucial juncture against Pakistan in Dubai. Despite being only one of the two Indian bowlers to return with economical bowling figures on a day when majority Pakistan batters were at their flawless best, India’s left-arm pacer Arshdeep Singh has been facing the wrath of the Indian fans, after him dropping the easiest of catches which would have got rid of Asif Ali (16 off 8) during the 18th Over of the chase. With Pakistan requiring another 31 runs off 15 deliveries, Ravi Bishnoi (4-0-26-1) managed to get a leading edge off Ali’s bat, which should have easily settled within the 23-year-old’s palms, but perhaps the Goddess of fortune had some other plan. As a consequence, Asif (16 off 8) then smashed a crucial Six off the penultimate Over bowled by Bhuvneshwar Kumar (4-0-40-1), who leaked 19 runs to bring the equation down to 7 runs required off the final Over. Arshdeep did manage to trap him in front of the stumps during the last Over, but it was all too late, as Pakistan defeated India by 5 wickets, with a ball to spare. A loss against Pakistan unfortunately does bring out the worst of the so-called Indian Cricket fans, who equate the sport with a war-like situation, where players are expected to possess the nerves of steel, with the ability to ace all the pressure moments. The social media was abuzz with scores of low-life trolls who left no stones unturned to deconstructively criticize the young Indian pacer, who was playing only his 9th T20I. Former Indian off-spinner Harbhajan Singh took to his social media handle, to state the quite obvious, that no player drops a catch on purpose, and thereby urged the fans to stop criticizing the seamer for reasons that have no place in sports. Stop criticising young @arshdeepsinghh No one drop the catch purposely..we are proud of our 🇮🇳 boys .. Pakistan played better.. shame on such people who r putting our own guys down by saying cheap things on this platform bout arsh and team.. Arsh is GOLD🇮🇳 — Harbhajan Turbanator (@harbhajan_singh) September 4, 2022 For more Cricket-related news, click here .","pubDate":"2022-09-04 19:21:15","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"KEN vs NEP Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs, Player Stats, Pitch Report for 3rd Unofficial ODI, Match 3","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ken-vs-nep-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-player-stats-pitch-report-3rd-unofficial-odi-match-3?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-04 19:20:37","image_url":"https://static.sportskeeda.com/editor/2022/09/35f9e-16623113652383-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Kohli scores half-century to take India to 181 for 7 vs Pakistan","link":"https://www.thehansindia.com/sports/cricket/kohli-scores-half-century-to-take-india-to-181-for-7-vs-pakistan-760425","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":null,"content":"Dubai: The much-criticised top-order batters finally showed what they are capable of as India put up a stiff 181 for 7 against Pakistan in an Asia Cup Super 4 match here on Sunday.Skipper Rohit Sharma (28) and KL Rahul (28) were outstanding in the Powerplay while Virat Kohli (60) gave glimpses of his vintage self by playing one of his most sublime knocks in recent times to take India to a more than respectable total. What everyone wanted from India's top-order was a change in mindset and the strike rates of 175 (Rohit), 140 (Rahul) and 136 (Kohli) were a testimony to that. Kohli deserves the maximum credit for the total India achieved against Pakistan spinners, especially leg-spinner Shadab Khan (2/31 in 4 overs), who got important wickets of Rahul and Rishabh Pant (14). His innings had four boundaries and a six along with his signature running between the wickets where he effortlessly converted ones into twos. Having been pilloried for their go-slow approach in the Powerplay, skipper Rohit signalled his intentions in the very first over when he gave Naseem Shah the charge and got a one-bounce-four over cover point. It was followed by a signature pull-shot for a six. Rahul, who has been subdued against Hong Kong, beautifully picked up the cue in Naseem's next over when he read the slower one early to deposit it over long-off for a six but the shot of the innings was off the last ball. It was a helicopter shot which was pure reflex action from the India vice-captain. As both settled down nicely, Rohit launched into Haris Rauf as 50 came in the fifth over and India were off the blocks for the first time in last three games against Pakistan at this venue. The grammar of T20 cricket has changed and Rohit's 16-ball 28 and Rahul's 20-ball 28 had the right kind of intent as well as impact which is requisite in high-pressure games. Though Rohit mistimed a slower one from Rauf and Rahul failed to clear the long-on fence off Shadab, they had provided the platform required for Kohli to settle down nicely into a groove before he started playing his shots. Kohli's 50 came off 36 balls when Hasnain was deposited into the mid-wicket stands. Ravi Bishnoi got a couple of lucky boundaries at the fag end when Fakhar Zaman made back-to-back outfield bloopers. (PTI) Brief Scores: India: 181 for 7 in 20 overs (Virat Kohli 60, Shadab Khan 2/31). ","pubDate":"2022-09-04 19:15:52","image_url":"https://assets.thehansindia.com/h-upload/2022/09/04/500x300_1310815-kohli.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"“Drop catch from Arshdeep was too lethargic”: S Badrinath reacts to Arshdeep Singh drop catch in IND vs PAK Asia Cup 2022 match in Dubai","link":"https://thesportsrush.com/cricket-news-drop-catch-from-arshdeep-was-too-lethargic-s-badrinath-reacts-to-arshdeep-singh-drop-catch-in-ind-vs-pak-asia-cup-2022-match-in-dubai/","keywords":["Cricket","Arshdeep Singh","asia cup","Asia Cup 2022","Asif Ali","India","Pakistan","Ravi Bishnoi","Subramaniam Badrinath"],"creator":["Dixit Bhargav"],"video_url":null,"description":"S Badrinath reacts to Arshdeep Singh drop catch: The Indian fast bowler dropped a straightforward chance tonight. During the eighth match of Asia Cup 2022 between India and Pakistan in Dubai, India fast bowler Arshdeep Singh found himself on the wrong side of a mis-field in a crunch situation. It all happened on the third… The post “Drop catch from Arshdeep was too lethargic”: S Badrinath reacts to Arshdeep Singh drop catch in IND vs PAK Asia Cup 2022 match in Dubai appeared first on The SportsRush.","content":"S Badrinath reacts to Arshdeep Singh drop catch: The Indian fast bowler dropped a straightforward chance tonight. During the eighth match of Asia Cup 2022 between India and Pakistan in Dubai, India fast bowler Arshdeep Singh found himself on the wrong side of a mis-field in a crunch situation. It all happened on the third delivery of the 18th over when Pakistan batter Asif Ali (16) top-edged a slog off India spinner Ravi Bishnoi only to end up playing a nothing shot. Fielding at short third man, Arshdeep had to grab one of the most easiest catches of his career to earn an advantage but it wasn’t to be, unfortunately. The 23-year old player made a mess of a straightforward catch to provide a massive reprieve to Ali. Knowing that a wicket could’ve helped India’s cause drastically, captain Rohit Sharma was seen fuming at the very moment at the sight at the sight of seeing an opportunity go waste. S Badrinath reacts to Arshdeep Singh drop catch in Dubai T20I Pakistan, who needed 31 runs off 16 deliveries to register their fifth-highest T20I run-chase at the time, won with a ball to go as Ali changed the game by scoring two fours and a six in the following over bowled by India’s Bhuvneshwar Kumar. Former India batter Subramaniam Badrinath took to social media platform Twitter to point out Arshdeep’s “lethargic” fielding effort at the Dubai International Cricket Stadium. Winning and Losing are a part of the sport, but the drop catch from Arshdeep was too lethargic #INDvPAK — S.Badrinath (@s_badrinath) September 4, 2022 Had Arshdeep grabbed that catch, the outcome of the match could’ve differed as Bhuvneshwar wouldn’t have bowled to Ali in his last over. Arshdeep, who opened the bowling with Bhuvneshwar, returned with bowling figures of 3.5-0-27-1. It was on the penultimate delivery of the match that Arshdeep found Ali wanting in front of the stumps with a yorker. With Pakistan needing two runs in as many balls to win the match, Iftikhar Ahmed (2*) managed to not take the match to the last ball. The post “Drop catch from Arshdeep was too lethargic”: S Badrinath reacts to Arshdeep Singh drop catch in IND vs PAK Asia Cup 2022 match in Dubai appeared first on The SportsRush.","pubDate":"2022-09-04 19:04:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“A big smile for all the Pakistanis”: Saeed Ajmal exults as Pakistan defeat India in a cliffhanger of a match in Asia Cup 2022","link":"https://thesportsrush.com/cricket-news-a-big-smile-for-all-the-pakistanis-saeed-ajmal-exults-as-pakistan-defeat-india-in-a-cliffhanger-of-a-match-in-asia-cup-2022/","keywords":["Cricket","Asia Cup 2022","India","Pakistan","Saeed Ajmal"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Saeed Ajmal exults as Pakistan have their redemption against India in what was yet another nerve-thrilling contest in Asia Cup 2022. Pakistan have defeated arch-rivals India by 5 wickets, in their first match of Asia Cup 2022 ‘Super 4’ stage at the Dubai International Stadium to put one foot forward towards making it towards the… The post “A big smile for all the Pakistanis”: Saeed Ajmal exults as Pakistan defeat India in a cliffhanger of a match in Asia Cup 2022 appeared first on The SportsRush.","content":"Saeed Ajmal exults as Pakistan have their redemption against India in what was yet another nerve-thrilling contest in Asia Cup 2022. Pakistan have defeated arch-rivals India by 5 wickets, in their first match of Asia Cup 2022 ‘Super 4’ stage at the Dubai International Stadium to put one foot forward towards making it towards the grand finale of the continental supremacy title. In what was a see-saw battle of the highest order, Babar Azam’s men ultimately chased down the challenging score of 181/7 posted by India with a ball to spare, and with it registered the second-highest successful run chase in the format in UAE. With 106 runs required off the final ten Overs, Pakistan clinically aced the middle-Overs phase of the chase, courtesy of a 41-ball 73 run partnership for the third wicket between Mohammad Rizwan (71 off 51) and Mohammad Nawaz (42 off 20). However, with Hardik Pandya getting rid of Rizwan during the 17 th Over, and a brilliant 8-run Over to follow from Ravi Bishnoi, the equation boiled down to 26 required off the final 12 deliveries, despite Arshdeep Singh putting down the simplest of catches on the third delivery. But the tables turned, and the dropped catch ultimately did prove to be costly, as Asif Ali (16 off 8) and Khushdil Shah (14 off 11) managed to fetch 19 runs off the penultimate Bhuvaneshwar Kumar Over, to bring the match right in their clutch. Former Pakistan spinner Saeed Ajmal took to his social media handle, to praise team Pakistan on a ‘thrilling victory’ and with it bring smiles on the faces on the whole of Pakistan, as the country is battling through one of the most disastrous floods, which has led to thousands of casualties and left millions homeless. He also hailed the performances put in by Mohammad Rizwan, Mohammad Nawaz, and by Shadab Khan (4-0-31-2) with the ball earlier. Absolutely thrilling victory for Pakistan!! 🇵🇰 A big smile for all the Pakistanis in this crucial situation of the country💚congratulations #Pakistan great performance by @iMRizwanPak @mnawaz94 and @76Shadabkhan Well done Boyss!! #PakistanZindabad #PAKvIND @TheRealPCB pic.twitter.com/cPdmanlBef — Saeed Ajmal (@REALsaeedajmal) September 4, 2022 For more Cricket-related news, click here.","pubDate":"2022-09-04 18:40:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"LIVE: Asia Cup 2022 India vs Pakistan Cricket Score - Rizwan, Nawaz Star as PAK Beat IND in Last-over Thril - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMiuQFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaW5kaWEtdnMtcGFraXN0YW4tbGl2ZS1zY29yZS1jcmlja2V0LXVwZGF0ZXMtc3RyZWFtaW5nLXQyMC1hc2lhLWN1cC0yMDIyLXN1cGVyLWZvdXItaW5kLXZzLXBhay1sYXRlc3Qtc2NvcmVjYXJkLXRvZGF5LWR1YmFpLWxpdmVuZXdzLTU4ODgzMjMuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE: Asia Cup 2022 India vs Pakistan Cricket Score - Rizwan, Nawaz Star as PAK Beat IND in Last-over Thril  News18India vs Pakistan Live Score: PAK beat IND by 5 wickets in thriller for the ages  Hindustan TimesAsia Cup 2022 News Live Updates: Pakistan beat India by five wickets in Super 4 match of Asia Cup in Dubai  Economic TimesIndia vs Pakistan Highlights: Pakistan Hold Nerves To Beat India By 5 Wickets In Thriller  NDTV SportsIndia vs Pakistan, T20 Asia Cup 2022 Super 4 Live Score Updates: PAK beat IND by five wickets  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-09-04 18:23:44","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan highest run chase in T20: Highest run chase in T20 by Pakistan","link":"https://thesportsrush.com/cricket-news-pakistan-highest-run-chase-in-t20-highest-run-chase-in-t20-by-pakistan/","keywords":["Cricket","asia cup","Asia Cup 2022","India","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Pakistan highest run chase in T20: Pakistan have registered their fifth-highest T20I run-chase at the Dubai International Cricket Stadium. During the eighth Asia Cup 2022 match between India and Pakistan in Dubai, Pakistan beat India by 5 wickets to avenge their loss at the same venue last Sunday. Chasing a 182-run target, Pakistan didn’t get… The post Pakistan highest run chase in T20: Highest run chase in T20 by Pakistan appeared first on The SportsRush.","content":"Pakistan highest run chase in T20: Pakistan have registered their fifth-highest T20I run-chase at the Dubai International Cricket Stadium. During the eighth Asia Cup 2022 match between India and Pakistan in Dubai, Pakistan beat India by 5 wickets to avenge their loss at the same venue last Sunday. Chasing a 182-run target, Pakistan didn’t get off to the best of starts. Captain Babar Azam (14) getting out cheaply was a primary reason behind them scoring 44/1 in the powerplay. Batter Fakhar Zaman (14) batting at a strike rate of 83.33 didn’t help their case but promoting all-rounder Mohammad Nawaz to No. 4 turned out to be a game-changing decision by the team management. Batting for the first time at No. 4, Nawaz not only broke the shackles to get their innings going but also put his team ahead in the chase. A brave stroke-filled innings saw the southpaw scoring 42 (20) with the help of six fours and two sixes at a strike rate of 210. A match-winning 41-ball 73-run third-wicket partnership between wicket-keeper batter Mohammad Rizwan (71) and Nawaz made it difficult for India to stage a comeback. Not that India didn’t get an opportunity of dominating again, pacer Arshdeep Singh dropping a simple catch in the 18th over, bowlers bowling too many wides in the death overs and pacer Bhuvneshwar Kumar leaking 19 runs in the 19th over witnessed them handing the advantage back to Pakistan. Arshdeep finding Pakistan batter Asif Ali (16) wanting in front of the stumps in the last over did provide a brief ray of hope but Iftikhar Ahmed (2*) was able to score a couple of runs on the penultimate delivery of the match to seal the run-chase. Pakistan zindabad 🇵🇰 — Sarfaraz Ahmed (@SarfarazA_54) September 4, 2022 Readers must note that Pakistan have registered their fifth-highest T20I run-chase tonight. Four out of their five highest T20I run-chases have come since the start of 2021.","pubDate":"2022-09-04 18:15:13","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mohammad Hafeez Trolled for Calling India “Laadla”","link":"https://www.gudstory.com/mohammad-hafeez-trolled-for-calling-india-laadla/","keywords":["Cricket"],"creator":["Sakshi Singh"],"video_url":null,"description":"India is one of the most powerful cricketing nations in the world. With its players, particularly Virat Kohli, commanding a vast fan base. It also includes the financial rewards that come with it. Not only this makes the Board of Control for Cricket in India (BCCI) a formidable force. It is also one of the […] The post Mohammad Hafeez Trolled for Calling India “Laadla” appeared first on Gud Story.","content":"India is one of the most powerful cricketing nations in the world. With its players, particularly Virat Kohli, commanding a vast fan base. It also includes the financial rewards that come with it. Not only this makes the Board of Control for Cricket in India (BCCI) a formidable force. It is also one of the most powerful athletic organizations in the world. All of this led Mohammad Hafeez- a former Pakistan cricketer, to label the BCCI “pampered”. He further claims that owing to all of the money the sporting body makes. On September 4, India and Pakistan will meet again in the Super4 round of the Asia Cup 2022. India overcame their arch-rivals by five wickets in the inaugural game. It was held on August 28 at the Dubai International Cricket Stadium. India defeated Hong Kong in the second match of the league round. Becoming the first team from Group A to move to the Super4 level. On the other hand, Pakistan advanced to the Super4 round. By defeated Hong Kong by 155 runs in their second game. India is a revenue-generating nation Mohammad Hafeez further adds “I do not know much, but I know that in our society, whoever is the earner is adored by everyone, is the most laadla (pampered), and receives the most kisses from everyone.” He then labeled “Laadla” with a heart-eyes emoji and posted it on Twitter. Pakistan vs India is always a game of intense pressure. Some players take more time to get in & perform up to the expectations @surya_14kumar pic.twitter.com/hVJOIsLq87— Mohammad Hafeez (@MHafeez22) September 4, 2022 He continued to explain despite the rest of the panel starting to chuckle at his comment. “India is a revenue-making country. So even in bilateral series across the world, where they get sponsorship, they get a jackpot, it’s hard to deny these things,” Mohammad Hafeez explained. When asked whether India is a “laadla” because they play so well or because they make more money, Mohammad Hafeez replied that it was the second point. Also read: Australia’s T20 World Cup Team Players Roaster is Out Now The post Mohammad Hafeez Trolled for Calling India “Laadla” appeared first on Gud Story.","pubDate":"2022-09-04 18:12:41","image_url":null,"source_id":"gudstory","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Virat Kohli now has highest fifty-plus scores in T20I history","link":"https://timesofindia.indiatimes.com/sports/cricket/asia-cup/asia-cup-2022-virat-kohli-now-has-highest-fifty-plus-scores-in-t20i-history/articleshow/93989036.cms","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli now has the most fifty-plus scores in the history of T20I cricket. The star Indian batter accomplished this feat during his side's high-octane Super Four clash against Pakistan on Sunday.","content":null,"pubDate":"2022-09-04 17:04:03","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup: Virat Kohli now has highest fifty-plus scores in T20I history","link":"https://www.business-standard.com/article/sports/asia-cup-virat-kohli-now-has-highest-fifty-plus-scores-in-t20i-history-122090400869_1.html","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli now has the most fifty-plus scores in the history of T20I cricket","content":"Virat Kohli now has the most fifty-plus scores in the history of T20I cricket. The star Indian batter accomplished this feat during his side's high-octane Super Four clash against Pakistan on Sunday. Kohli struck a delightful 60 runs off 44 balls. His knock was decorated with four boundaries and a six. This was his 32nd half-century in T20Is. But he was run out on the fourth ball of the final over. Compatriot Rohit Sharma has been knocked down to second number after this superb innings by Virat, as he has 31 fifty-plus scores, including four centuries. He is followed by Babar Azam of Pakistan (27 fifty plus scores including a century), Veteran Australian opener David Warner (23), New Zealand's Martin Guptill (22) and Ireland opener Paul Stirling (21). Now in 102 matches, Kohli has scored 3,462 runs at an average of 50.91. He has scored 32 half-centuries in the format, with 94* being his best score. His strike rate in this format is 137.10. Coming to the match, Pakistan opted to field first after winning the toss. Virat Kohli's blistering 60 and 54-run opening stand between Rohit Sharma and KL Rahul guided India to 181/7 against arch rivals Pakistan in the second match of the Super Four stage of the ongoing Asia Cup 2022 here at the Dubai International Cricket Stadium on Sunday. Virat Kohli was in his best form as he smashed 60 runs in 44 deliveries, while Rohit Sharma and KL Rahul scored 28 runs each setting a solid foundation for the Indian team. For Pakistan Shadab Khan bagged two wickets while Mohammad Nawaz, Haris Rauf and Naseem Shah scalped one wicket each. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-09-04 16:50:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220904/thumb-122090400869.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"'GOAT for a reason', Virat Kohli smashes fifty to go past Rohit Sharma, fans can't keep calm, check reacts","link":"https://zeenews.india.com/cricket/ind-vs-pak-asia-cup-2022-virat-kohli-smashes-fifty-goes-past-rohit-sharma-and-fans-cannot-keep-calm-check-reacts-2505749.html","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket fans could not stop gushing over Kohli and were all praise for him, some saying that Virat of old was back. Others called him 'consistent' Kohli.","content":null,"pubDate":"2022-09-04 16:12:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Records tumble as Virat Kohli hits another fifty vs Pakistan, overtakes Rahul Dravid on THIS list","link":"https://zeenews.india.com/cricket/ind-vs-pak-super-4s-asia-cup-2022-records-tumble-as-virat-kohli-hits-another-fifty-vs-pakistan-overtakes-rahul-dravid-in-this-list-2505758.html","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma and KL Rahul now have the most fifty-plus run stands in T20I cricket history.","content":null,"pubDate":"2022-09-04 16:12:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“Straight helicopter shot”: Amit Mishra describes KL Rahul six off Naseem Shah in Asia Cup Super 4 match at Dubai International Stadium","link":"https://thesportsrush.com/cricket-news-straight-helicopter-shot-amit-mishra-describes-kl-rahul-six-off-naseem-shah-in-asia-cup-super-4-match-at-dubai-international-stadium/","keywords":["Cricket","Amit Mishra","Asia Cup 2022","KL Rahul","Naseem Shah"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Amit Mishra describes KL Rahul six as a straight helicopter shot, as he beautifully times Naseem Shah’s delivery in Asia Cup Super 4 match. During the eighth match of the ongoing Asia Cup 2022 between India and Pakistan at the Dubai International Stadium, team India got off to a blistering start after being invited to… The post “Straight helicopter shot”: Amit Mishra describes KL Rahul six off Naseem Shah in Asia Cup Super 4 match at Dubai International Stadium appeared first on The SportsRush.","content":"Amit Mishra describes KL Rahul six as a straight helicopter shot, as he beautifully times Naseem Shah’s delivery in Asia Cup Super 4 match. During the eighth match of the ongoing Asia Cup 2022 between India and Pakistan at the Dubai International Stadium , team India got off to a blistering start after being invited to bat first by Babar Azam. The intentions were quite clear from the opening batting pair of skipper Rohit Sharma (28 off 16) and KL Rahul (28 off 20), as the former smashed a Four and an unbelievable Six at the mid-wicket region off the very first Over of the match bowled by Naseem Shah. The duo, brushing off all the waters off their backs after being criticized for their performances in the previous two innings, stitched together a 54-run partnership off mere 31 deliveries, to provide the team a perfect foundation towards posting a challenging total. Rahul in particular, after facing the brunt of the fans for his sluggish innings (36 off 39) against Hong Kong the other day, smashed a couple of Sixes and a Four during his 20-ball stay at the crease today, while returning back with a strike rate of 140. KL Rahul, known for his classy strokes and elegance while executing them, smashed an unbelievable six off Naseem Shah during the final delivery of the third Over, to leave the fans slacked-jawed. A full delivery on the stumps, Rahul looked to shuffle across to play the whip, but instead timed it exceptionally well to somehow play what looked like a helicopter shot, although with a straight bat. The ball sailed out of the park to hit the sightscreen, and made everyone reminiscent of the days when Rahul used to score blistering half-centuries, especially during the IPL. Indian leg-spinner Amit Mishra too, taken aback by the quality of the shot, took to his social media handle, to describe the same as a ‘straight heliptor’, while applauding him for the stroke. A new shot? Straight helicopter shot? Bravo KL Rahul.. #IndvsPak pic.twitter.com/Wil3JdouNu — Amit Mishra (@MishiAmit) September 4, 2022 For more Cricket-related news, click here.","pubDate":"2022-09-04 16:10:01","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup: Rohit Sharma-KL Rahul register most 50-plus run stands in T20I","link":"https://www.business-standard.com/article/sports/asia-cup-rohit-sharma-kl-rahul-register-most-50-plus-run-stands-in-t20i-122090400825_1.html","keywords":null,"creator":null,"video_url":null,"description":"Star batters Rohit Sharma and KL Rahul now have the most fifty-plus run stands in T20I cricket history","content":"Star batters Rohit Sharma and KL Rahul now have the most fifty-plus run stands in T20I cricket history. The Indian opening duo accomplished this landmark during the high-octane Super Four clash against Pakistan at the ongoing Asia Cup 2022 on Sunday. The duo added 54-runs in 31 balls before Rohit Sharma was dismissed for 28 off 16 balls by Haris Rauf. Now they have a total of 14 fifty-plus stands in T20I cricket, most in the history of the shortest of format. Nine of these stands are fifty-run stands while five are hundred-run stands. They are followed by the Irish duo of Kevin O'Brien and Paul Stirling, who have a total of 13 such partnerships, with three being 100-run stands and 10 ten being fifty-run stands. New Zealand duo of Martin Guptill and Kane Williamson comes next with 12 fifty-plus stands, with four of them being hundred run stands. The Pakistan duo of Babar Azam and Mohammed Rizwan is at the fourth place with 11 fifty-plus stands, with six of them being hundred run stands. Coming to the match, Pakistan won the toss and elected to bowl first. India's innings is currently in progress. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-09-04 15:58:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220904/thumb-122090400825.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit-Rahul register most fifty-plus run stands in T20Is","link":"https://timesofindia.indiatimes.com/sports/cricket/asia-cup/asia-cup-rohit-sharma-kl-rahul-register-most-fifty-plus-run-stands-in-t20is/articleshow/93988432.cms","keywords":null,"creator":null,"video_url":null,"description":"Star batters Rohit Sharma and KL Rahul now have the most fifty-plus run stands in T20I cricket history. The Indian opening duo accomplished this landmark during the high-octane Super Four clash against Pakistan at the ongoing Asia Cup 2022 on Sunday.","content":null,"pubDate":"2022-09-04 15:57:08","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan Live Score Ball by Ball, Asia Cup, 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-pakistan-live-score-over-super-four-match-2-t20-16-20-updates-3315354","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Pakistan from Dubai International Cricket Stadium, Dubai. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, India are 181/7. The live updates of India vs Pakistan scorecard is also available. It is the perfect platform to follow your favourite teams in Asia Cup, 2022. Keep a track on your favourite batsmen and bowlers through Asia Cup, 2022 today match, ball by ball commentary, India vs Pakistan, India vs Pakistan live score, India vs Pakistan scorecard. Follow the excitement of the Asia Cup, 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. India got off to an absolute flier with both openers taking a liking to the raw pace of the Pakistani bowlers. They managed to score 62 runs inside the Powerplay and having lost just their skipper, they were on course for a big total. KL Rahul got out soon after and after that it was only Virat Kohli who stayed on the crease as the wickets kept tumbling. With the score at 93/2 at the halfway mark, India would have looked to get to the 200-run mark but the middle order failed. Kohli ended up with 60 runs and India somehow managed to scrape over the 180-run mark which is a par score given how the pitch is playing. A brilliant contest between bat and ball in the first half but on the whole, India will be happier of the two sides going into the break as they have the late momentum with those two late boundaries. Pakistan though did really well to restrict India well below 200. 19.6 overs (4 Runs) DROPPED AND FOUR! Two pieces of really poor fielding from Fakhar Zaman has seen India end the innings with a couple of boundaries. A low full toss, wide of the off stump, Ravi Bishnoi slashes it aerially towards deep point. Zaman comes in from the deep and ends up overrunning the ball. Zaman tries to adjust and take the take behind him but the ball goes off the palms and trickles into the fence. A brilliant over by Haris Rauf is ruined and India finish with 181/7! 19.5 overs (4 Runs) FOUR! An attempted yorker from Haris Rauf but ends up bowling a low full toss. Ravi Bishnoi slices it through point. Fakhar Zaman charges it early and misfields it. The ball races away the fence. This might turn out costly for Pakistan. Ravi Bishnoi walks in next. 19.4 overs (1 Run) OUT! RUN OUT! Fuller one on middle, Virat Kohli flicks it to square leg and calls for two. Asif Ali is quick to collect it and makes a direct hit. The decision is taken upstairs. The replay shows that Virat Kohli was just out of his crease and he walks out after a good knock! Is that a run-out? An absolute bullet of a throw from the deep by Asif Ali and he gets in the direct hit at the striker's end. Virat Kohli seems to be struggling here and the umpires go upstairs. The replays show that the dive didn't save Kohli and he has to walk back. 19.3 overs (0 Run) Yorker and on middle, Virat Kohli looks to play at it but doesn't connect well. Another dot. 19.2 overs (0 Run) Slightly shorter and on off, Virat Kohli pulls it. The ball lands short of the fielder at deep mid-wicket. Virat Kohli denies the single. 19.1 overs (0 Run) Fuller one outside off, Virat Kohli looks to loft it but gets an inside edge towards the keeper. Dot. 19.1 overs (1 Run) Wide! This one lands outside leg, Virat Kohli leaves it alone. Haris Rauf to bowl the final over of the innings. 18.6 overs (1 Run) Fuller one on middle, Virat Kohli drills it to long on for one. 18.5 overs (2 Runs) Yorker and on middle, Virat Kohli digs it towards mid-wicket for a brace. Bhuvneshwar Kumar is the next man in. 18.4 overs (0 Run) OUT! CAUGHT! Touch fuller and on middle, slower too, Deepak Hooda lofts it but the ball hits the upper part of his bat. The ball goes high up in the air towards long on. Mohammad Nawaz settles under it and takes a good catch falling behind. Deepak Hooda walks out for 16 and Naseem Shah gets a wicket. 18.3 overs (1 Run) Fuller one this time, on off, Virat Kohli drives it towards deep covers for one. 18.2 overs (2 Runs) Slightly shorter and on middle, Virat Kohli dances down the track and awkwardly pulls it to backward square leg for a brace. Good running! 18.1 overs (1 Run) Shorter one on off, Deepak Hooda looks to slap it but miscues it to third man for one. 17.6 overs (6 Runs) SIX! Take a bow, Virat Kohli. On a length and on off, Virat Kohli uses the bottom hand and whips it over deep mid-wicket for a maximum. Fifty up for Virat Kohli and his good form in this tournament continues. 17.5 overs (0 Run) This one lands outside off, Virat Kohli looks to slap it but misses. 17.4 overs (1 Run) Fuller and on off, Deepak Hooda plays it towards backward point for one. 17.3 overs (4 Runs) FOUR! Excellent shot. A good bouncer, at 146 clicks and over middle, Deepak Hooda bends his back, uses the pace of the ball and helps it over the keeper for a boundary. 17.2 overs (2 Runs) Touch fuller and outside off, Deepak Hooda slices it through backward point for a couple. The fielder makes a good stop at the boundary line. 17.1 overs (2 Runs) On a length again, Deepak Hooda lofts it over the mid off fielder. The fielder chases it down. They collect two. 17.1 overs (1 Run) Wide! Bowls a length ball outside leg, Deepak Hooda looks to flick it but misses. Mohammad Hasnain is back on for his final over. 16.6 overs (2 Runs) Goes fuller, around off, Virat Kohli nudges it to deep mid-wicket for a brace. He moves to 47 now. 16.5 overs (0 Run) Slightly shorter and on middle, Virat Kohli defends it back towards Haris Rauf. 16.4 overs (1 Run) Slightly shorter this time, outside off, Deepak Hooda caresses it to deep point for one. 16.3 overs (4 Runs) FOUR! Fuller and on middle, Deepak Hooda creams it through extra cover for a boundary. A much-needed one for India. 16.2 overs (0 Run) On a length and on middle, Deepak Hooda eases it to the left of mid on. Dot. 16.1 overs (1 Run) Touch fuller and on off, Virat Kohli knocks it to mid off for one. Haris Rauf (2-0-20-1) is back on. 15.6 overs (0 Run) Play and a miss. This one lands outside off, turns in and bounces a bit extra as well. Deepak Hooda looks to play at it but misses. A dot to end with. Good over for Pakistan. 15.5 overs (0 Run) Slightly shorter, Hooda looks to play at it but gets an outside edge towards short third man. Dot. 15.4 overs (1 Run) Fuller and outside off this time, Virat Kohli taps it to point for one again. 15.3 overs (1 Run) Another one down the middle, Hooda flicks it to mid-wicket for one more. 15.2 overs (1 Run) Bowls it on middle, Virat Kohli works it to mid-wicket for one. 15.1 overs (2 Runs) Tossed up, outside off with a hint of turn, Virat Kohli cuts it to deep covers for a brace.","pubDate":"2022-09-04 15:51:54","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637979233059638299.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“I’m afraid Shaheen won’t be available for the World Cup”: Mohammad Hafeez exclaims Shaheen Afridi’s careless handling of injury by PCB might cost him his T20 World Cup 2022 berth","link":"https://thesportsrush.com/cricket-news-im-afraid-shaheen-wont-be-available-for-the-world-cup-mohammad-hafeez-exclaims-shaheen-afridis-careless-handling-of-injury-by-pcb-might-cost-him-his-t20-world-cup-2022-berth/","keywords":["Cricket","ICC T20 World Cup 2022","Mohammad Hafeez","pcb","Shaheen Afridi"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Mohammad Hafeez exclaims Shaheen Afridi might miss the upcoming T20 World Cup in Australia as well due to PCB’s careless approach. Mohammad Hafeez joins the list of former Pakistan cricketers who have lately expressed their displeasure with the way the Pakistan Cricket Board (PCB) have handled the injury of their star fast bowler Shaheen Afridi.… The post “I’m afraid Shaheen won’t be available for the World Cup”: Mohammad Hafeez exclaims Shaheen Afridi’s careless handling of injury by PCB might cost him his T20 World Cup 2022 berth appeared first on The SportsRush.","content":"Mohammad Hafeez exclaims Shaheen Afridi might miss the upcoming T20 World Cup in Australia as well due to PCB’s careless approach. Mohammad Hafeez joins the list of former Pakistan cricketers who have lately expressed their displeasure with the way the Pakistan Cricket Board (PCB) have handled the injury of their star fast bowler Shaheen Afridi. To brush it up, Afridi had picked up a knee injury during Pakistan’s first Test match against Sri Lanka at Galle in July, and was ruled out for the rest of the series. Despite not having fully recovered, he was picked by the management for the three-match ODI series against Netherlands, although under the supervision of a couple of doctors. With the Asia Cup 2022 and the T20 World Cup in view as well, the aforementioned decision taken by the PCB think-tank and by skipper Babar Azam was harshly criticized by the fans, and as it turned out, the 22-year-old was ruled out of the ongoing Asia Cup and also from Pakistan’s seven match home T20I series against England as well. With the PCB medical team advising a four-six weeks rest for the left-arm pacer, fans and experts were left scratching their heads when he also travelled with the Pakistan squad to UAE for the Asia Cup. “Babar wanted him to stay with the team. Management wants to closely monitor his injury rehab. He will be staying in Dubai itself with the team,” a PCB spokesperson had confirmed to the local media in Pakistan. Ahead of Pakistan’s ongoing clash against India in the tournament’s ‘Super 4’ stage, former Pakistan batter Mohammad Hafeez seemed to be pretty unamused by Shaheen’s lack of discipline post injury, and also criticized the PCB with the way they went about with addressing his injury. Hafeez now also fears that the mishandling of the injury and careless approach by the board might cost Shaheen a place in the T20 World Cup squad as well. “Self discipline is your own responsibility, and blaming others is not the correct way forward. Unfortunately, in case of Shaheen, he was not diagnosed properly or the board wasted a lot of time to look after his injury rehab process. The rehab process takes time, and if you are late with the process, the injury takes all the more time to heal properly. Thus, I fear for his on-time recovery which might well mean that he might also be unavailable for the T20 World Cup as well,” remarked Hafeez. Fitness is an individual responsibility with discipline & hard work. My concern on @iShaheenAfridi rehab & his availability in World Cup 2022 in Austrailia pic.twitter.com/5vd0UbjLcw — Mohammad Hafeez (@MHafeez22) September 4, 2022 For more Cricket-related news, click here .","pubDate":"2022-09-04 15:10:27","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Sex and all is great but…”: Rohit Sharma innings vs Pakistan in Asia Cup allures hilarious analogy from YouTuber Tanmay Bhat","link":"https://thesportsrush.com/cricket-news-sex-and-all-is-great-but-rohit-sharma-innings-vs-pakistan-in-asia-cup-allures-hilarious-analogy-from-youtuber-tanmay-bhat/","keywords":["Cricket","asia cup","Asia Cup 2022","India","Pakistan","Rohit Sharma"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma innings vs Pakistan: The Indian captain hit a combined total of five boundaries during his 16-ball stay in the middle. During the eighth match of Asia Cup 2022 between India and Pakistan in Dubai, India captain Rohit Sharma (28) walked the talk to provide his team with a brisk start. Sharma, who had… The post “Sex and all is great but…”: Rohit Sharma innings vs Pakistan in Asia Cup allures hilarious analogy from YouTuber Tanmay Bhat appeared first on The SportsRush.","content":"Rohit Sharma innings vs Pakistan: The Indian captain hit a combined total of five boundaries during his 16-ball stay in the middle. During the eighth match of Asia Cup 2022 between India and Pakistan in Dubai, India captain Rohit Sharma (28) walked the talk to provide his team with a brisk start. Sharma, who had laid emphasis on “ playing freely ” and finding some momentum early on in the innings at the toss, did exactly that hitting three fours and two sixes at a strike rate of 175. Having left the first ball that he faced off Pakistan fast bowler Naseem Shah, Sharma danced down the track on the following delivery to hit Shah for a boundary over cover. On the last delivery of the same over, Sharma played another lofted shot hitting the right-arm bowler over mid-wicket for a massive six. Treating Mohammad Hasnain similarly, Sharma hit his second delivery off him for a lift over mid-off. Sharma then welcomed Haris Rauf with a four and a six in the fourth over of the innings. While a four had come over extra cover, a six had been hit on the leg side. Rauf, however, was able to stage a comeback by dismissing Sharma on the first delivery of his second over. Wanting to make the most of the last powerplay over, Sharma aimed at targeting the straight boundary once again but it wasn’t to be on this particular occasion. With Rauf rolling his fingers over the ball, Sharma couldn’t adjust to the the pace of the ball only to sky it high in the air before getting caught by Khushdil Shah inside the 30-yard circle. Sex and all is great but have you ever seen Rohit Sharma pick the length early? — Tanmay Bhat (@thetanmay) September 4, 2022 High class start 🔥 @klrahul @ImRo45 #INDvsPAK pic.twitter.com/lYKXjlMj9J — Mayank Agarwal (@mayankcricket) September 4, 2022 Rohit Sharma & his impeccable timing though,decent batting track too. — zainab abbas (@ZAbbasOfficial) September 4, 2022 A treat to watch Rohit Sharma and KL Rahul playing at their best. Pakistan’s injury woes will haunt us tonight. #INDvsPAK2022 #AsiaCupT20 — Wajahat Kazmi (@KazmiWajahat) September 4, 2022 No issues with 28 off 16. That’s a strike rate of 175. Super start provided. Yehi toh karna hai bhai T20 cricket mein. Milestone are not important. Maaro. #INDvsPAK #AsiaCup2022 — Jamie Alter 😷 🇮🇳 (@alter_jamie) September 4, 2022 A 31-ball 54-run opening partnership was followed by India losing Sharma and KL Rahul (28) within six deliveries.","pubDate":"2022-09-04 14:53:12","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"When you have tough times, the basics are the most important: Lockie Ferguson","link":"https://www.sentinelassam.com/sports/cricket/when-you-have-tough-times-the-basics-are-the-most-important-lockie-ferguson-611057","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"New Zealand tearaway quick Lockie Ferguson is raring to go for the upcoming Chappell-Hadlee Trophy","content":"CAIRNS: New Zealand tearaway quick Lockie Ferguson is raring to go for the upcoming Chappell-Hadlee Trophy, which begins in Cazalys Stadium, Cairns, in the state of Queensland, from Tuesday after the indifferent performance on the tour of West Indies. In the T20I series, Ferguson took 1/49 in eight overs in New Zealand's 2-1 series victory over the West Indies. But, in the ODI series against New Zealand, which the tourists won 2-1, Ferguson had overall figures of 1/135 in 18 overs, coming off two matches at an economy rate of 7.5. Now, ahead of coming back to the country where he made his ODI debut, during the Chappell-Hadlee Trophy in December 2016, Ferguson is hoping that a return to the basics and a break from the game after being on the road for a long will help him get back to his best self in 50-overs cricket. \"(It was) not the toil I wanted one-day wise in Barbados; disappointing on a few levels. It was nice to take a break and be away from the game having been away (from home) for five months. It's amazing how you come home for 24 hours and you feel a bit more relaxed sleeping in your bed, seeing your loved ones, your girlfriend.\" \"Refreshed having that week at home and now back again. Last week I was working on the basics (of his bowling) and when you have tough times, the basics are the most important. I would be working on similar things in the next few days and certainly fit and raring to go,\" said Ferguson in a video by New Zealand Cricket (NZC) on Saturday. Defending the upcoming Chappell-Hadlee Trophy, which New Zealand won in 2017, will be a motivating factor for the tourists.\"Hopefully, the first game goes better than my debut and I manage to bowl all ten overs. It's a nice memory. I think back to how nervous and excited I was to play against Australia, in the Chappell-Hadlee Trophy. It's another opportunity to try and get the trophy overseas,\" added Ferguson. The three matches in the Chappell-Hadlee Trophy are a part of the ICC Men's Cricket World Cup Super League, in which New Zealand are in fourth place while Australia on the seventh spot. New Zealand had a limited session with heavy rain on Thursday in Cairns meaning grass nets weren't available for Saturday. \"(The weather is) a bit sticky for sure, but I think we are getting quite used to that as a team. There are talks that there may be some dew around at night when the wind sort of dies down. These are indicators we got to build into our plans,\" concluded Ferguson. IANS Also Read: Phillips, Ferguson guide New Zealand to 31-run win against Ireland Also Watch:","pubDate":"2022-09-04 14:30:29","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/04/383260-lock.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Ryan Burl takes five as Zimbabwe record historic ODI win against Australia","link":"https://www.sentinelassam.com/sports/cricket/ryan-burl-takes-five-as-zimbabwe-record-historic-odi-win-against-australia-611053","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Zimbabwe scored a historic three-wicket victory against the Aaron Finch-led Australia","content":"TOWNSVILLE: Zimbabwe scored a historic three-wicket victory against the Aaron Finch-led Australia, with leg-spinner Ryan Burl grabbing five wickets for just 10 runs as he brought the hosts to their knees in the third and final One-day International here on Saturday. Though Australia clinched the series 2-1, it was the manner in which the hosts capitulated which stood out, with nine of their batters scoring in single digit. Opener David Warner, with his patient 96-ball 94, helped the hosts to 141 before they were bundled out in 31 overs. In reply, Zimbabwe notched up the required runs for the loss of seven wickets in 39 overs to record a memorable win. Australia had a forgettable start with the bat, as they were reduced to 72/5 after only 18 overs. Put in to bat first, Zimbabwe made full use of the conditions on offer here. Richard Ngarava and Victor Nyauchi sent Finch and Steve Smith packing for 5 and 1 respectively. Brad Evans then inflicted a double-strike, sending Alex Carey (4) and Marcus Stoinis (3) back into the dressing room. Cameron Green departed soon to Sean Williams for 3 as half the Australian side was back in the hut before the 20th over. David Warner could only watch from the other end, as wickets fell at regular intervals and the Burl show started. Warner brought up his 26th ODI half-century, mixing caution with aggression. But he was hapless as Burl cleaned up the Australia lineup from the other end. Glenn Maxwell (19) and Ashton Agar (0) were his first two victims. Warner finally ran out of patience, as Burl accounted for his wicket after a workman-like 94. Burl then dismissed the remainder of the tail including Mitchell Starc (2) and Josh Hazlewood (0) as Australia were bowled out for 141. Burl ended his spell with figures of 5/10, according to ICC. Zimbabwe had a decent partnership at the top, with Takudzwanashe Kaitano and Tadiwanashe Marumani giving them a 38-run opening stand. But after Kaitano was dismissed on 19 by Hazlewood, the visitors would have to endure some jitters. Hazlewood then sent Wessly Madhevere (2) and Sean Williams packing on back-to-back deliveries to further increase the tension in the Zimbabwe camp. Sikandar Raza (8) also could not contribute much and Marumani's dismissal for 35 by Green had the visitors reeling at 77/5. A vital stand of 38 between skipper Regis Chakabva and Tony Munyonga then calmed some nerves. The duo batted patiently, taking their time, while not taking unnecessary risks. Their stand took Zimbabwe to 115, when left-arm spinner Ashton Agar bowled Munyonga for 17, with the visitors still needing 17 more to win. Chakabva, joined by Burl, then guided Zimbabwe to a famous win. Chakabva played a captain's knock of 37 not out while Burl scored 11. Starc claimed his 200th ODI wicket as he dismissed Burl late in the innings but Zimbabwe held their nerves to win the match by three wickets, with Brad Evans smashing home the winning runs. It was Zimbabwe's third win against Australia in 33 attempts and their first since 2014 in Harare. This was also the first time they have defeated Australia in Australia in ODI cricket. Brief scores: Australia 141 in 31 overs ( David Warner 94; Ryan Burl 5/10) lost to Zimbabwe 142/7 in 39 overs (Tadiwanashe Marumani 35, Regis Chakabva 37 not out; Josh Hazlewood 3/30) by three wickets. IANS Also Read: Ryan Burl stars as Zimbabwe clinch T20I series against Bangladesh Also Watch:","pubDate":"2022-09-04 14:12:43","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/04/383256-ryna.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Why Dinesh Karthik dropped: Why is Jadeja not playing today’s Asia Cup Super 4 match between India and Pakistan in Dubai?","link":"https://thesportsrush.com/cricket-news-why-dinesh-karthik-dropped-why-is-jadeja-not-playing-todays-asia-cup-super-4-match-between-india-and-pakistan-in-dubai/","keywords":["Cricket","asia cup","Asia Cup 2022","dinesh karthik","India","Pakistan","Ravi Bishnoi","Ravindra Jadeja"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Dinesh Karthik dropped: India have made three changes to their Playing XI for this match against Pakistan. During the eighth match of the ongoing 15th edition of the Asia Cup between India and Pakistan in Dubai, Pakistan captain Babar Azam has won the toss and chose to bowl. “We will bowl first. The dew… The post Why Dinesh Karthik dropped: Why is Jadeja not playing today’s Asia Cup Super 4 match between India and Pakistan in Dubai? appeared first on The SportsRush.","content":"Why Dinesh Karthik dropped: India have made three changes to their Playing XI for this match against Pakistan. During the eighth match of the ongoing 15th edition of the Asia Cup between India and Pakistan in Dubai, Pakistan captain Babar Azam has won the toss and chose to bowl. “We will bowl first. The dew could be a factor, that’s the reason we’re bowling first. We had a lot of positives from the last match against India,” Azam told Star Sports at the toss. With Pakistan bringing in pacer Mohammad Hasnain for injured pacer Shahnawaz Dahani, expect the Indian top-order to be tested yet again at the Dubai International Cricket Stadium. Why Dinesh Karthik dropped? Much like his counterpart, India captain Rohit Sharma also wanted to bowl first in this match. Laying emphasis on “playing freely”, Sharma didn’t shy away from hinting that the Indian opening batters will go all guns blazing against Pakistan tonight. “We would have bowled first but now we need to play freely and assess a good score on this pitch. Momentum counts in this format. You’ve to be on the money from the start, not worry about external pressures,” Sharma told Star Sports at the toss. India have made three changes to their Playing XI. Injured all-rounder Ravindra Jadeja (ruled out of Asia Cup), veteran wicket-keeper batter Dinesh Karthik and unwell pacer Avesh Khan have been left out for all-rounders Hardik Pandya and Deepak Hooda and spinner Ravi Bishnoi. Not really a match day if there’s no @imVkohli milestone coming up. #PlayBold #TeamIndia #INDvPAK #AsiaCup2022 pic.twitter.com/3JOOMzXy0M — Royal Challengers Bangalore (@RCBTweets) September 4, 2022 Player of the Match in the last India-Pakistan T20I at this venue, Pandya was always expected to be back for this match. In the absence of a fourth pacer in their 15-member squad, one out of Bishnoi or Ravichandran Ashwin was expected to replace Khan. However, India leaving out Karthik after limited opportunities in two matches is a bit of a surprise after him being preferred over Pant only a week ago. Neither Sharma was asked about the rationale behind this move nor he himself threw light on it. The post Why Dinesh Karthik dropped: Why is Jadeja not playing today’s Asia Cup Super 4 match between India and Pakistan in Dubai? appeared first on The SportsRush.","pubDate":"2022-09-04 13:55:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan Live Score Ball by Ball, Asia Cup, 2022 Live Cricket Score Of Today's Match on NDT.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvaW5kaWEtdnMtcGFraXN0YW4tbGl2ZS1zY29yZS1vdmVyLXN1cGVyLWZvdXItbWF0Y2gtMi10MjAtMS01LXVwZGF0ZXMtMzMxNTA4NNIBeGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvaW5kaWEtdnMtcGFraXN0YW4tbGl2ZS1zY29yZS1vdmVyLXN1cGVyLWZvdXItbWF0Y2gtMi10MjAtMS01LXVwZGF0ZXMtMzMxNTA4NC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Pakistan Live Score Ball by Ball, Asia Cup, 2022 Live Cricket Score Of Today's Match on NDT..  NDTV SportsIndia vs Pakistan, Super Four, Match 2: Preview  CricbuzzA week after their once-in-a-blue-moon face-off, India and Pakistan are back to facing each other in Super  Economic TimesIND vs PAK Live Streaming Details- When And Where To Watch India vs Pakistan Live In Your Country? Asia Cup 2022, Super Four Match 2  Cricket AddictorIndia-Pakistan Playing XI tip-off: Axar Patel for Ravindra Jadeja, Mohammad Hasnain for Shahnawaz Dahani, maybe R Ashwin for Avesh Khan  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-09-04 13:54:51","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia CUP 2022, IND vs PAK: Pakistan wins toss and invites India to bat first","link":"https://www.indiatvnews.com/sports/cricket/asia-cup-2022-ind-vs-pak-pakistan-wins-toss-and-invite-india-to-bat-first-scoreboard-playing-11-2022-09-04-805425","keywords":null,"creator":null,"video_url":null,"description":"IND vs PAK: It feels unreal, absolutely unreal, India taking on Pakistan on two consecutive Sundays, and when something like this happens, we already know that it either is an ICC event or the all-important Asia Cup. With Bangladesh and Hong Kong crashing out, Afghanistan, India, Sri Lanka, and Pakistan have all made it to the super 4 and will have a go at each other. Things have intensified at the Asia Cup with all 4 qualified teams displaying their best brand of cricket but this tournament is certainly a dress rehearsal for the T20I World Cup that is scheduled to be played in Australia later this year. India and Pakistan have qualified from Group A, whereas Sri Lanka and Afghanistan have qualified from Group B. ","content":"It feels unreal, absolutely unreal, India taking on Pakistan on two consecutive Sundays, and when something like this happens, we already know that it either is an ICC event or the all-important Asia Cup. With Bangladesh and Hong Kong crashing out, Afghanistan, India, Sri Lanka, and Pakistan have all made it to the super 4 and will have a go at each other. Things have intensified at the Asia Cup with all 4 qualified teams displaying their best brand of cricket but this tournament is certainly a dress rehearsal for the T20I World Cup that is scheduled to be played in Australia later this year. India and Pakistan have qualified from Group A, whereas Sri Lanka and Afghanistan have qualified from Group B. Earlier in the tournament, India did face Pakistan on August 28, 2022, and defeated them by a margin of 5 wickets. -led Pakistan had inflicted a 10-wicket loss over India in the 2021 T20I World Cup and it was now India's chance to redeem themselves and return the favor. The super 4 match between India and Pakistan is being played today at the Dubai International Stadium. Both the injury-plagued teams have a good headache going into the match. Pakistan has replaced Shahnawaz Dahani with Mohammad Hasnain and India has replaced the injured with Deepak Hooda who might walk ahead of Rishabh Pant. Pakistan has won the toss and has invited the -led team India to bat first. \"We would have bowled first, but now we need to play freely and assess a good score on this pitch. Momentum counts in this format, you've to be on the money from the start, not worry about external pressures. Injury is something we can't control, Jadeja has been ruled out and he's back home. It was a headache to select the playing XI - Hardik comes back. Deepak Hooda gets a game and so does Ravi Bishnoi\", said Rohit Shara ahead of the marquee clash. \"We will bowl first. The dew could be a factor, that's the reason we're bowling first. We had a lot of positives from the last match against India. The message is to play positively - one change for us with Hasnain coming in\", said Babar Azam who will want to settle scores with the Indian cricket team. , Rohit Sharma(c), , Suryakumar Yadav, Rishabh Pant(w), Deepak Hooda, , , Ravi Bishnoi, , Arshdeep Singh Mohammad Rizwan(w), Babar Azam(c), , Khushdil Shah, Iftikhar Ahmed, , Asif Ali, Mohammad Nawaz, Haris Rauf, Mohammad Hasnain, Naseem Shah","pubDate":"2022-09-04 13:47:27","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Mitchell Starc breaks 23-year-old record of Saqlain Mushtaq","link":"https://www.sentinelassam.com/sports/cricket/mitchell-starc-breaks-23-year-old-record-of-saqlain-mushtaq-611050","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"There was something to cheer for Australia amid the gloom of losing the third and final One-day International against Zimbabwe","content":"TOWNSVILLE: There was something to cheer for Australia amid the gloom of losing the third and final One-day International against Zimbabwe here on Saturday, with pace bowler Mitchell Starc claiming his 200th ODI wicket to break a 23-year-old record, and become the fastest ever to reach the milestone. Starc, 32, has become the quickest-ever bowler to 200 ODI wickets, eclipsing the 23-year-old record set by Pakistan off-spinner Saqlain Mushtaq. Playing in his 102nd ODI here, Starc dismissed tail-ender Ryan Burl when the batter spooned a catch to Cameron Green at mid-off. Starc achieved the feat in two fewer matches than the former Pakistani cricketer (104), according to cricket.com.au. Starc has reached a double-century of wicket in fewer matches than the likes of Brett Lee (112 ODIs), the late Shane Warne (125), Mitchell Johnson (129) and Glenn McGrath (133). Starc was also the quickest ever to 100 ODI wickets (after 52 matches) in 2016, though Afghanistan spinner Rashid Khan had improved upon that mark in 2018, reaching the milestone in eight fewer games. IANS Also Read: Will not compromise on my Test chances by playing ODIs with injury: Mitchell Starc Also Watch:","pubDate":"2022-09-04 13:39:56","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/04/383252-mitc.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Pakistan captain Babar Azam wins toss, opts to bowl against arch-rival India in super four match","link":"https://www.tribuneindia.com/news/sports/asia-cup-2022-pakistan-captain-babar-azam-wins-toss-opts-to-bowl-against-arch-rival-india-in-super-four-match-428568","keywords":null,"creator":null,"video_url":null,"description":"Dubai, September 4Pakistan captain Babar Azam won the toss and elected to bowl first against arch-rival India in the second match of the Super Four stage of the ongoing Asia Cup 2022 here at the Dubai International Cricket Stadium on Sunday.Last Sunday, India got the better of Pakistan in the group stage as Hardik Pandya's one-man show got Men in Blue over the line in a thrilling final-over finish.Hasan Ali replaced injured Shahnawaz Dahani for Pakistan. For India Hardik Pandya, Deepak Hooda and Ravi Bishnoi are in Playing eleven.Both the team are playing the match without their star player, India will play without senior all-rounder Ravindra Jadeja, while Pakistan are missing the services of Shahnawaz Dahani. Both the players picked up injuries which ruled them out of the Asia Cup.Despite the two teams clashing just a week before, there is no shortage of excitement amongst the fans to watch the two sides go head to head in an encounter that has become a rarity of late.The arch-rivals have played 15 matches against each other in Asia Cup so far. India have won 9 of them, while Pakistan bagged 5 while one match ended in a no-result.Speaking at the time of toss, Pakistan skipper Babar Azam said, \"We will bowl first. The dew could be a factor, that's the reason we're bowling first. We had a lot of positives from the last match against India. The message is to play positively - one change for us with Hasan Ali coming in.\" Speaking at the time of the toss, India captain Rohit Sharma said, \"We would have bowled first, but now we need to play freely and assess a good score on this pitch. Momentum counts in this format, you've to be on the money from the start, not worry about external pressures. Injury is something we can't control, Jadeja has been ruled out and he's back home. It was a headache to select the playing XI - Hardik comes back. Deepak Hooda gets a game and so does Ravi Bishnoi.\"Pakistan (Playing XI): Mohammad Rizwan(w), Babar Azam(c), Fakhar Zaman, Khushdil Shah, Iftikhar Ahmed, Shadab Khan, Asif Ali, Mohammad Nawaz, Haris Rauf, Mohammad Hasnain and Naseem Shah.India (Playing XI): KL Rahul, Rohit Sharma(c), Virat Kohli, Suryakumar Yadav, Rishabh Pant(w), Deepak Hooda, Hardik Pandya, Bhuvneshwar Kumar, Ravi Bishnoi, Yuzvendra Chahal and Arshdeep Singh.","content":"ANI Dubai, September 4 Pakistan captain Babar Azam won the toss and elected to bowl first against arch-rival India in the second match of the Super Four stage of the ongoing Asia Cup 2022 here at the Dubai International Cricket Stadium on Sunday. Last Sunday, India got the better of Pakistan in the group stage as Hardik Pandya's one-man show got Men in Blue over the line in a thrilling final-over finish. Hasan Ali replaced injured Shahnawaz Dahani for Pakistan. For India Hardik Pandya, Deepak Hooda and Ravi Bishnoi are in Playing eleven. Both the team are playing the match without their star player, India will play without senior all-rounder Ravindra Jadeja, while Pakistan are missing the services of Shahnawaz Dahani. Both the players picked up injuries which ruled them out of the Asia Cup. Despite the two teams clashing just a week before, there is no shortage of excitement amongst the fans to watch the two sides go head to head in an encounter that has become a rarity of late. The arch-rivals have played 15 matches against each other in Asia Cup so far. India have won 9 of them, while Pakistan bagged 5 while one match ended in a no-result. Speaking at the time of toss, Pakistan skipper Babar Azam said, \"We will bowl first. The dew could be a factor, that's the reason we're bowling first. We had a lot of positives from the last match against India. The message is to play positively - one change for us with Hasan Ali coming in.\" Speaking at the time of the toss, India captain Rohit Sharma said, \"We would have bowled first, but now we need to play freely and assess a good score on this pitch. Momentum counts in this format, you've to be on the money from the start, not worry about external pressures. Injury is something we can't control, Jadeja has been ruled out and he's back home. It was a headache to select the playing XI - Hardik comes back. Deepak Hooda gets a game and so does Ravi Bishnoi.\" Pakistan (Playing XI) : Mohammad Rizwan(w), Babar Azam(c), Fakhar Zaman, Khushdil Shah, Iftikhar Ahmed, Shadab Khan, Asif Ali, Mohammad Nawaz, Haris Rauf, Mohammad Hasnain and Naseem Shah. India (Playing XI) : KL Rahul, Rohit Sharma(c), Virat Kohli, Suryakumar Yadav, Rishabh Pant(w), Deepak Hooda, Hardik Pandya, Bhuvneshwar Kumar, Ravi Bishnoi, Yuzvendra Chahal and Arshdeep Singh.","pubDate":"2022-09-04 13:39:48","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1823436460.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India, Pakistan fans shoudn't go overboard, it's just a game of cricket: Wasim Akram","link":"https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-fans-reaction-wasim-akram-ravi-shastri-asia-cup-1996337-2022-09-04?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"India, Pakistan fans shouldn't go overboard after win or loss: Wasim Akram","content":null,"pubDate":"2022-09-04 13:35:58","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan: Asia Cup, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-pakistan-live-score-over-super-four-match-2-t20-1-5-updates-3315084","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Pakistan from Dubai International Cricket Stadium, Dubai. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 3.5 overs, India are 46/0. The live updates of India vs Pakistan scorecard is also available. It is the perfect platform to follow your favourite teams in Asia Cup, 2022. Keep a track on your favourite batsmen and bowlers through Asia Cup, 2022 today match, ball by ball commentary, India vs Pakistan, India vs Pakistan live score, India vs Pakistan scorecard. Follow the excitement of the Asia Cup, 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 3.4 overs (1 Run) 1 run. 3.3 overs (1 Run) Good length this time, angling it into the body. Rohit tucks it leg side and picks up a single. 3.2 overs (6 Runs) SIX! WOW! Rohit Sharma just knew a short ball was coming. It is shorter but at a very good height for the batter, around off and pulled all the way over the mid-wicket fence for a maximum. 3.1 overs (4 Runs) FOUR! No matter who the bowler is, the Indian batters are going after everyone. Rauf starts off with a fullish delivery around off, Rohit Sharma hangs back and just thumps it over wide mid off and picks up a boundary. Haris Rauf comes in as first change. 2.6 overs (6 Runs) SIX! Up and over! Fuller and on middle, KL Rahul lofts it down the ground between long on and long off for a maximum. Fantastic start for India. 2.5 overs (0 Run) Bowls it outside off, KL Rahul defends it to point. Dot. 2.4 overs (1 Run) On a length and outside off, Rohit Sharma looks to block it but gets an outside edge towards third man. The fielder makes a good stop at the boundary line. They collect one. 2.3 overs (0 Run) Fuller and on middle, Rohit Sharma flicks it but finds the fielder at mid-wicket. 2.2 overs (1 Run) On a length and down the middle, KL Rahul gently flicks it to backward square leg for one. 2.1 overs (6 Runs) SIX! KL Rahul joins the party now! This is fuller and on off, slower too, KL Rahul nonchalantly lofts it over the wide long off fence for a maximum. 1.6 overs (1 Run) Fuller one on middle, KL Rahul eases it to mid on for a quick single. The fielder has a shy at the non striker's end but misses. One run. 1.5 overs (2 Runs) Touch fuller and on off, KL Rahul lofts it but doesn't get the power right. It goes over extra cover. The fielder from inside the ring chases it. They collect two. 1.4 overs (1 Run) Hasnain is really steaming in now and bowls this one around 148 clicks! Good length again, Rohit Sharma eases it to mid on for one. 1.3 overs (4 Runs) FOUR! Rohit Sharma has made up his mind here. This is on a length and on off, Rohit Sharma knocks it over mid off for a boundary. 1.2 overs (0 Run) Slightly shorter, at 146 clicks and with some extra bounce as well, Rohit Sharma looks to play at it but misses. Close! 1.1 overs (1 Run) Length ball down the middle, KL Rahul covers his line and guides it to third man. They cross. Mohammad Hasnain to bowl from the opposite end. 0.6 over (6 Runs) SIX! KABOOM! Rohit Sharma gets the first maximum of the match in the very first over. This one lands on a length and on middle, Rohit Sharma heaves it over deep mid-wicket for a biggie. Good start for India. 0.5 over (0 Run) Good length and outside off, Rohit Sharma eases it to mid off. Dot. 0.4 over (4 Runs) FOUR! Up and over. Slightly shorter again, Rohit Sharma dances down the track and lofts it over extra covers for a one bounce boundary! Rohit is off the mark in style. 0.3 over (0 Run) Slightly shorter this time and just outside off, Rohit Sharma makes a tight leave. 0.2 over (1 Run) On a length again, outside off, KL Rahul guides it past backward point and gets off that mark. Single is taken and India are underway! 0.1 over (0 Run) Naseem Shah starts right on the money! It is a length ball outside off, KL Rahul defends it to point. A dot to start with. We are done with the pre-game formalities and it is now time to play! The umpires are out in the middle as the Pakistani players can be seen in a huddle. The Indian opening pair of KL Rahul and Rohit Sharma too make their way out to the middle. Naseem Shah has been handed the new ball and is ready to speed in. Two slips in place as well. Let's play... We are minutes away from the start of play but as is the norm in these multi-nation tournaments, the two sets of players will first lineup for their respective national anthems. It will be Pakistan's national anthem first followed by the national anthem of India. Hardik Pandya is down for a quick chat. He says that he needed a break and had a good rest in the last match. Further says that he has got a good training session for this big game and he feels refreshed. Adds that he loves the crowd around but his wife and his family are not around. Finishes by saying that he is the kind of person that sits in the room and tastes different food items but now he is more focused on the game and needs to be calm and win the game. PITCH REPORT - Sanjay Manjrekar is pitchside. He says that there is an even covering of grass on this one. Wasim Akram joins him and says that it is totally different from Sharjah, it is slightly drier but there will be good carry and the team winning the toss should look to bowl first. Also goes on to add that there hasn't been any dew so it won't matter that much. The Indian skipper, Rohit Sharma says that they would have bowled first as well. Further says that they need to play well and assess a good score. Adds that they have to be good from the start and not worry about external pressure. Says that injury is something that they cannot control and Ravindra Jadeja has been ruled out. Finishes by saying that Hardik Pandya comes back to the team and Deepak Hooda and Ravi Bishnoi will start as well. Babar Azam, the captain of Pakistan says that they will bowl first. Adds that for them it is important to put pressure on India. Further says that they have a lot of takeaways from their previous loss against India. Ends by saying that the message for the boys is to play well and give their best. Says that Mohammad Hasnain comes in for Shahnawaz Dahani. Pakistan (Playing XI) - Mohammad Rizwan (WK), Babar Azam (C), Fakhar Zaman, Khushdil Shah, Iftikhar Ahmed, Shadab Khan, Asif Ali, Mohammad Nawaz, Haris Rauf, Naseem Shah and Mohammad Hasnain (In for Shahnawaz Dahani). India (Playing XI) - KL Rahul, Rohit Sharma (C), Virat Kohli, Suryakumar Yadav, Rishabh Pant (WK), Deepak Hooda (In for Ravindra Jadeja), Hardik Pandya (In for Dinesh Karthik), Bhuvneshwar Kumar, Ravi Bishnoi (In for Avesh Khan), Yuzvendra Chahal and Arshdeep Singh. TOSS - The crowd is electric and the two captains are out in the middle for the toss. Babar Azam calls it correctly and Pakistan will BOWL first.","pubDate":"2022-09-04 13:33:31","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637979150030356821.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}