{"newsArray":[{"title":"Pat Cummins named as Australia's new one-day captain, succeeding Aaron Finch - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC9wYXQtY3VtbWlucy1vbmUtZGF5LWNhcHRhaW4tYXVzdHJhbGlhLXJlcGxhY2VzLWFhcm9uLWZpbmNoL2E4Mjc1NThmLWVlOTAtNGQ0MC04ZDA4LWJkMmFkNGUxOGE4YtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pat Cummins named as Australia's new one-day captain, succeeding Aaron Finch  Wide World of SportsWarner snubbed as new captain announced  news.com.auThe question we need answered before David Warner can captain again  Sydney Morning HeraldPat Cummins named men's ODI cricket captain, replacing Aaron Finch  ABC NewsCricket Australia names new ODI captain  news.com.auView Full coverage on Google News","content":null,"pubDate":"2022-10-18 00:00:58","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Cummins named Australia one-day captain","link":"https://www.thestar.com.my/sport/cricket/2022/10/18/cricket-cummins-named-australia-one-day-captain","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - Test skipper Pat Cummins will also captain Australia in one-day internationals after being named as the replacement for Aaron Finch by Cricket Australia on Tuesday. Read full story","content":null,"pubDate":"2022-10-17 23:35:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/10/18/1780789.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket-Cummins named Australia one-day captain ","link":"https://www.channelnewsasia.com/sport/cricket-cummins-named-australia-one-day-captain-3012361","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-17 23:31:31","image_url":null,"source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Australia names new one-day cricket captain","link":"https://wwos.nine.com.au/cricket/pat-cummins-one-day-captain-australia-replaces-aaron-finch/a827558f-ee90-4d40-8d08-bd2ad4e18a8b","keywords":null,"creator":["wwos"],"video_url":null,"description":"C﻿ricket Australia has confirmed the new skipper of the 50-over side, following Aaron Finch's retirement.","content":"Fast bowler Pat Cummins h﻿as been named as Aaron Finch's successor as captain of Australia's one-day team. Already in charge of the Test side, Cummins will take the reins as the team prepares for the 2023 World Cup in India. It comes after Finch retired from the 50-over format following a lengthy run of outs. \"I have thoroughly enjoyed playing under Finchy and have learnt an enormous amount from his leadership,\" Cummins said. \"They are significant shoes to fill although we are extremely fortunate to have a one-day squad with a huge amount of experience.\" Cricket Australia's high performance boss, Ben Oliver, said: \"We are very fortunate to have a number of high-quality leaders and senior players across all formats. The board and selectors agree Pat is the ideal choice to lead the ODI team through the next period including the 2023 World Cup.\" Selection boss George Bailey added: \"Pat has done an excellent job since taking on the captaincy of the Test side and we look forward to him leading the one-day team to the 2023 World Cup in India.\" MORE TO COME.","pubDate":"2022-10-17 23:04:37","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/10/460673/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ben Stokes and Sam Curran’s qualities go way beyond statistics in the T20 Cricket World Cup","link":"https://metro.co.uk/2022/10/18/t20-world-cup-qualities-stokes-and-curran-provide-go-beyond-stats-17582197/","keywords":["Cricket","Adil Rashid","Ben Stokes","Chris Woakes","England cricket","Eoin Morgan","Indian Premier League","Jonny Bairstow","Jos Buttler","Mark Wood"],"creator":["Derek Pringle"],"video_url":null,"description":"England’s main strength lies with their batting.","content":"Ben Stokes and Sam Curran are England’s ‘big moment’ stars (Pictures: Getty) Algorithms and talismans seem to be England’s way to winning the T20 World Cup, which means following the data but also keeping faith in ‘big moment’ stars like Ben Stokes and Sam Curran. Stokes’ T20 stats do not stand out as they do in other formats yet Jos Buttler, England’s white-ball captain, seems to be forming the team’s challenge around him. In the build-up so far, Stokes has opened the bowling and batted at four, roles he probably wouldn’t have given himself had he been in charge. Sentiment does not tend to feature much in modern sport but part of this may be to give Stokes, one of the country’s most selfless cricketers, a chance of redemption following the 2016 final against the West Indies where he failed to defend 18 when bowling the final over. The rest is general admiration for a man whose belief in the possible is simply greater than everybody else’s. Stokes embraces tough challenges which T20 throws up quicker and more frequently than other formats. So, too, does Sam Curran, another who is yet to stand out, figures-wise, in England’s T20 team. Stokes embraces tough challenges which T20 throws up (Picture: Mark Evans/Getty) What both possess, and this is less measurable than other talents, is an ultra-competitive spirit which makes them more likely than others to deliver under extreme pressure. Which is why Curran appears to have been given the responsibility of bowling the death overs, a role where holding one’s nerve is as important as one’s variations. That Buttler has faith in them and their ability to process pressure, no doubt stems from having seen both of them play regularly in the Indian Premier League. Before he retired as white-ball captain, Eoin Morgan paid extra heed to England players who excelled in IPL, a trend Buttler seems to have continued. One caveat to that IPL grounding will be the conditions in Australia where the tournament is being held. It is early season there and pitches are likely to be very different to those on the sub-continent. Indeed, there have already been a few shock results in the qualifying rounds after Scotland beat West Indies and Namibia defeated Sri Lanka. Australian grounds tend to have big boundaries, which gives spinners, and indeed all bowlers, a better chance of taking wickets with mis-hits. This is an International Cricket Council event, though, and boundaries may remainsmall and standardised, which would be a shame. As one former England spinnerturned-coach lamented recently about bowling under such circumstances: ‘It annoys the hell out of me that I could get it 90 per cent right and the batsmen could get it ten per cent right and the ball still goes for six.’ Jos Buttler seems to be building his side’s challenge around Stokes (Picture: Jason McCawley – CA/Cricket Australia via Getty) Spin is an area of concern for England. Adil Rashid had become the team’s most reliable bowler especially in the middle overs, keeping run-rates steady while posing a wicket-taking threat. But a series of shoulder injuries has seen the 34-year-old’s action lose its snap and batsmen are finding his variations – leg-break,front-of-hand slider and googly – less challenging, which has seen his runs-per-over metric rise accordingly. Moeen Ali and Liam Livingstone are both spinnners although neither tends bowl a full complement of overs like Rashid. Wickets are the best way to quell an opponent’s ardour. With the new ball that could come from unleashing left-arm swingers like Reece Topley and David Willey or the right-arm Chris Woakes, although probably not all three. More: CricketT20 World Cup: Team-by-team guide and predictions as Australia defend trophyMen's T20 World Cup: Start date, fixtures, schedule, hosts and TVAlex Lees dropped as England name 15-man squad for Pakistan Test series If fit, Mark Wood would then hit a hard length in the middle overs alongside Rashid and Stokes with Curran and Topley, 5ft 8in and 6ft 7in respectively, taking care of the death overs. Bowling at the end when batsmen try to hit everything for six used to be Chris Jordan’s speciality, but he played just one of England’s last ten T20 matches before yesterday’s warm-up, which suggests he is no longer first-choice. England’s main strength lies with their batting and, in Buttler, they possess one of the greats of the genre. With no Jonny Bairstow, missing due to his broken leg, Alex Hales has returned to open along side the skipper to reasonable fanfare. After them comes Dawid Malan, Stokes, Harry Brook, Moeen and Curran with Phil Salt and Livingstone in reserve, at least for the moment. England are in Group A which comprises New Zealand and Afghanistan along with hosts and current holders Australia (Photo by Jonathan DiMaggio/Getty for T20 World Cup) England are in Group A which comprises New Zealand and Afghanistan along with hosts and current holders Australia, whom they have just beaten twice in the warm-up games to give them some timely confidence. Group B contains India, Pakistan, South Africa and Bangladesh. Both groups will each be swelled by two teams from the qualifying rounds. England’s first match is against Afghanistan in Perth on Saturday, while their next meeting with Australia is on October 28 at the MCG. Buttler’s team are second favourites to win the tournament after the Aussies, home advantage presumably counting for something. But England have goodvariety in their bowling and real firepower in the batting, so have an excellent chance of adding to the T20 title they won in 2010. As ever, it will come down to one or two crunch points, especially in the knockout stage, which England hope troubleshooters like Stokes and Curran can help them to surmount. Do that and there is no reason the trophy cannot be theirs. For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram. MORE : Why England’s brand of all-or-nothing cricket should breed more success MORE : England’s cricketers belt out historic rendition of God Save the King","pubDate":"2022-10-17 23:01:00","image_url":null,"source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cummins in $40m showdown with CA bosses","link":"https://wwos.nine.com.au/cricket/news-2022-pat-cummins-pressured-cricket-australia-to-drop-sponsor-report/7397d01b-3155-4140-b0c6-865963511e3d","keywords":null,"creator":["wwos"],"video_url":null,"description":"T﻿est captain Pat Cummins has found himself at odds with Cricket Australia, and it has cost the governing body dearly.","content":"Cricket Australia is on the lookout for a new sponsor for the men's team﻿ after chief executive Nick Hockley was confronted by captain Pat Cummins , regarding its contract with energy company Alinta worth almost $40 million. CA agreed to end the deal according to The Age and The Sydney Morning Herald ﻿, which was originally signed for four years and would now only be extended for one more season. READ MORE: 'Excited' Cherry-Evans breaks silence on Hasler﻿ READ MORE﻿: Roos selection battle heats up as Mal reveals changes READ MORE: Breathtaking scenes as Aussie tradie finishes epic run﻿ Alinta's parent company, Pioneer Sail Holdings, has been listed as one of Australia's highest carbon emitters. \"Nick lives just down the road, so I catch up and chat with him quite a bit,\" Cummins said. \"More so than ever before you're seeing players' personalities and interests and passions shine through and have a bit more of a say than maybe in the past. \"I think the most obvious, front-of-mind things you can see is who we partner with. So I hope that when we think of who we want to align with, who we want to invite into being part of cricket, I hope climate is a real priority. \"I've got my own personal views so when it comes to personal sponsorships there are some companies I wouldn't want to align with. When we're getting money, whether it's programs for junior cricket, grassroots, things for fans around Australia, I feel a real responsibility that with that, we're doing on balance what is the right thing.\" Alinta has stuck solid with the Australian men's team through the Newlands scandal, when financial services firm Magellan departed. It's understood player were less than thrilled about fronting ad campaigns for Alinta but felt they had to because the team was under pressure at the time. However in the five years since the cheating scandal, and the improved image of the team under Cummins' captaincy, the skipper felt it was time to intervene. It comes as Diamonds players refused to ﻿to wear uniforms emblazoned with the Hancock Prospecting brand and expressed solidarity with squad member Donnell Wallam, a Noongar woman who has raised concerns about the company's record on indigenous issues. This comes as﻿ the International Cricket Council unveiled a sponsorship deal with the Saudi state oil company Aramco, raising questions among players and spectators at the men's T20 World Cup in Australia. \"There's a lot of good initiatives out there and passionate people, but I'd love for some of that passion to be driven into real action,\" Cummins said. \"I hope that the purpose of the sport is to hopefully be a good thing for society and who we partner with, what decisions we make I hope are in the best interests of not only the sport but our society. \"If the last 12 months are anything to go by, it's becoming ever more relevant, and in somewhere like Australia we've got no excuses. We've got so many resources and opportunities out there. I hope whenever we make decisions and look at what fans want, is it the right thing, is it the best thing for cricket, I hope climate is a big part of that conversation.\" ﻿ For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","pubDate":"2022-10-17 20:48:48","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/10/460692/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Club cricket’s best players from Lord Tav, Premier and women’s","link":"https://www.cairnspost.com.au/sport/cricket/best-of-the-best-from-lord-taverners-bulls-masters-and-tmax-womens-action/news-story/d43d2dcca42dac0a3d41cf27a9426138","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Who were club cricket’s best from the weekend? We name our KFC TMax women’s Teams of the Week and reveal the best from Lord Taverners and Bulls Masters men’s action.","content":null,"pubDate":"2022-10-17 20:01:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"The question we need answered before David Warner can captain again - Sydney Morning Herald","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LnNtaC5jb20uYXUvc3BvcnQvY3JpY2tldC90aGUtcXVlc3Rpb24td2UtbmVlZC1hbnN3ZXJlZC1iZWZvcmUtZGF2aWQtd2FybmVyLWNhbi1jYXB0YWluLWFnYWluLTIwMjIxMDE3LXA1YnFmZy5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"The question we need answered before David Warner can captain again  Sydney Morning HeraldPat Cummins named men's ODI cricket captain, replacing Aaron Finch  ABC NewsCummins named Australia's ODI captain | cricket.com.au  cricket.com.auWarner should have ban lifted but giving him Australian white-ball captaincy would be the wrong call  The RoarWarner snubbed as new captain announced  news.com.auView Full coverage on Google News","content":null,"pubDate":"2022-10-17 18:41:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Zindagi me maine vo shot kabhi miss nahi kiya tha”: Misbah-ul-Haq defends his shot selection which cost Pakistan T20 World Cup 2007 to India","link":"https://thesportsrush.com/cricket-news-zindagi-me-maine-vo-shot-kabhi-miss-nahi-kiya-tha-misbah-ul-haq-defends-his-shot-selection-which-cost-pakistan-t20-world-cup-2007-to-india/","keywords":["Cricket","ICC T20 World Cup 2007","India","Misbah ul Haq","Pakistan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Misbah-ul-Haq defends his shot selection from the 2007 T20 World Cup final in Johannesburg which cost Pakistan the title versus India. With 6 runs needed from the final 4 deliveries in the grand finale of inaugural edition of the 2007 ICC T20 World Cup in Johannesburg, it was Pakistan’s match to lose with their skipper… The post “Zindagi me maine vo shot kabhi miss nahi kiya tha”: Misbah-ul-Haq defends his shot selection which cost Pakistan T20 World Cup 2007 to India appeared first on The SportsRush.","content":"With 6 runs needed from the final 4 deliveries in the grand finale of inaugural edition of the 2007 ICC T20 World Cup in Johannesburg, it was Pakistan’s match to lose with their skipper Misbah-ul-Haq on strike and batting beautifully at the score of 43. However, what happened next will be remembered by the Cricketing fraternity till the sport’s existence, and the fans from India and Pakistan in particular, as one decision made by the former Pakistan skipper back then became the reason for the outpour of extreme/contrasting emotions expressed by people on the two sides of the border. Misbah, decided to sway his upped body away from the line of the delivery bowled by Joginder Sharma, and play the scoop above Sreesanth stationed at short fine-leg. However, with him going way outside the off-stump to execute the shot, the ball did meet his bat, but to only balloon up in the air, and under the throat of Sreesanth, who pouched the catch comfortably. With nine wickets already down, the shot ended Pakistan’s hopes for the title, and it were MS Dhoni’s men who ultimately got their hands at the World Cup, with a 5-run victory. Fifteen years and six more editions of the T20 World Cup later, Misbah-ul-Haq still defends his aforementioned shot selection, while maintaining that the problem was with the execution and not the choice. The now 48-year-old, during an interaction with with his then skipper Shoaib Malik also sitting adjacent to him, remarked that he had practiced that shot many a times, and had executed the same even against the spinners back then. He also added that the chances of getting dismissed to any other shot in front of the wicket with four stationed fielders, were also a possibility, while all this while, maintaining his stance with a disagreeing Shoaib Malik too questioning his shot selection, to a medium pacer Joginder Sharma. “ (People often question me why would I opt for that shot, when you were hitting in front (of the wicket) so well. And I’m like, I had never missed that shot my entire life. If I go for a shot in-front of the wicket, chances of the ball ending in the hands of any of the four fielders in front was also a possibility)”, stated Misbah. Shoaib Malik questioning Misbah’s shot selection to Jogindar Sharma in 2007 WT20 final when he himself scored 8 off 17 as captain with the SR of 47 without any boundary. Lmao what a shameless person. — Hassan Cheema (@Gotoxytop1) For more Cricket-related news, click .","pubDate":"2022-10-17 18:18:57","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Willis, Noble star as Norths cruise past Hannans in EGCA opener","link":"https://thewest.com.au/news/kalgoorlie-miner/willis-noble-star-as-norths-cruise-past-hannans-in-egca-opener-c-8568682","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Nick Willis contributed a half-century and Michael Noble grabbed six wickets in Norths’ big win over Hannans in the first round of the 2022-23 Eastern Goldfields Cricket Association A-grade competition.","content":"Nick Willis and Michael Noble combined on brilliant displays with bat and ball respectively to orchestrate North Kalgoorlie’s big win over defending premiers Hannans on Saturday to open the Eastern Goldfields Cricket Association’s 2022-23 A-grade campaign. Willis, who is back in a familiar role as captain this summer after Trent Mais stood down, led from the front with the bat after Norths won the toss by contributing a half-century. Openers Noble (37) and Mais (36) put on 53 before Willis stamped his authority on the innings by top-scoring with 58. After first drop Sam Garraghan departed for one, Willis knuckled down across 81 balls faced in an 86-minute stay at the crease that featured four boundaries and three sixes. After he became the fifth man out, Glen Gascoyne (35 off 24 balls; three sixes) and Kodee Lowe (27 not out; 22 balls; five fours) turned in valuable knocks that guided Norths to 8-230. Noble followed up with a dynamic spell that restricted Hannans to 179 in 47.2 overs. After Ash Malec (36) and N.o.3 batter Josh Gorman (40) moved Hannans to 3-84, the defending premiers looked in reasonable shape to chase down the target. Noble, however, had other ideas as he went about removing five of the top seven opposition batters. He finished with 6-61 to underpin a brilliant start for Norths, who finished second last summer but bowed out in the elimination final. For Willis, the team’s application in batting was refreshing. “That was pretty much the first time that we’ve batted out our 50 overs in the last couple of years,” he said. “All in all it was a pretty good team effort and certainly nice for the team to get runs. “We were all probably a little bit rusty (because) our preseason wasn’t a huge one numbers-wise, but everyone did their job.” Willis said Noble’s six wickets reflected his hard work. “I didn’t really expect that (because) he was just coming on for a few overs to basically change things up a bit,” Willis said. “But we just kept him rolling and he’d been bowling really well in the nets so it wasn’t a complete surprise.” Sign up for our emails","pubDate":"2022-10-17 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8568682/8de5ad263e552a01e81d9edc050a1ca3dfcb27c2-16x9-x0y209w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricketers maken sprongen op WK in Australië: ’Ik heb nog geen kangoeroe gezien’","link":"https://www.telegraaf.nl/sport/680071955/cricketers-maken-sprongen-op-wk-in-australie-ik-heb-nog-geen-kangoeroe-gezien","keywords":["Sport"],"creator":null,"video_url":null,"description":"Na de knappe winst op de Verenigde Arabische Emiraten in Geelong, wacht Oranje op het WK-cricket de loodzware taak om woensdag (Namibië) of donderdag (Sri Lanka) nog minstens één keer boven zichzelf uit te stijgen. In dat geval is de kans groot dat het Nederlands elftal in Australië de Top 12 bereikt. En waarom niet? Fastbowler Paul van Meekeren: „In het spectaculaire T20-cricket is van alles mogelijk.”","content":null,"pubDate":"2022-10-17 18:00:00","image_url":"https://www.telegraaf.nl/images/1200x630/filters:format(jpeg):quality(80)/cdn-kiosk-api.telegraaf.nl/89dd2636-4e45-11ed-9a89-0218eaf05005.jpg","source_id":"telegraaf","country":["netherland"],"category":["sports"],"language":"dutch"},{"title":"Willis, Noble star as Norths cruise past Hannans in EGCA opener","link":"https://thewest.com.au/news/kalgoorlie-miner/willis-noble-star-as-norths-cruise-past-hannans-in-egca-opener-c-8568682","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Nick Willis contributed a half-century and Michael Noble grabbed six wickets in Norths’ big win over Hannans in the first round of the 2022-23 Eastern Goldfields Cricket Association A-grade competition.","content":"Nick Willis and Michael Noble combined on brilliant displays with bat and ball respectively to orchestrate North Kalgoorlie’s big win over defending premiers Hannans on Saturday to open the Eastern Goldfields Cricket Association’s 2022-23 A-grade campaign. Willis, who is back in a familiar role as captain this summer after Trent Mais stood down, led from the front with the bat after Norths won the toss by contributing a half-century. Openers Noble (37) and Mais (36) put on 53 before Willis stamped his authority on the innings by top-scoring with 58. After first drop Sam Garraghan departed for one, Willis knuckled down across 81 balls faced in an 86-minute stay at the crease that featured four boundaries and three sixes. After he became the fifth man out, Glen Gascoyne (35 off 24 balls; three sixes) and Kodee Lowe (27 not out; 22 balls; five fours) turned in valuable knocks that guided Norths to 8-230. Noble followed up with a dynamic spell that restricted Hannans to 179 in 47.2 overs. After Ash Malec (36) and N.o.3 batter Josh Gorman (40) moved Hannans to 3-84, the defending premiers looked in reasonable shape to chase down the target. Noble, however, had other ideas as he went about removing five of the top seven opposition batters. He finished with 6-61 to underpin a brilliant start for Norths, who finished second last summer but bowed out in the elimination final. For Willis, the team’s application in batting was refreshing. “That was pretty much the first time that we’ve batted out our 50 overs in the last couple of years,” he said. “All in all it was a pretty good team effort and certainly nice for the team to get runs. “We were all probably a little bit rusty (because) our preseason wasn’t a huge one numbers-wise, but everyone did their job.” Willis said Noble’s six wickets reflected his hard work. “I didn’t really expect that (because) he was just coming on for a few overs to basically change things up a bit,” Willis said. “But we just kept him rolling and he’d been bowling really well in the nets so it wasn’t a complete surprise.” Sign up for our emails","pubDate":"2022-10-17 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8568682/8de5ad263e552a01e81d9edc050a1ca3dfcb27c2-16x9-x0y209w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Justin Langer: Pat Cummins has opportunity to leave his mark on Australian cricket culture with ODI captaincy","link":"https://thewest.com.au/sport/cricket/justin-langer-pat-cummins-has-opportunity-to-leave-his-mark-on-australian-cricket-culture-with-odi-captaincy-c-8573997","keywords":null,"creator":["Justin Langer"],"video_url":null,"description":"Pat Cummins has the chance to leave an indelible mark on Australian cricket culture if he were to take up the ODI captaincy, writes Justin Langer.","content":null,"pubDate":"2022-10-17 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8573997/ef97c118aa737dbce75af55c201e1a5d5784afec-16x9-x383y707w1175h661.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Stalwarts flay Viewers attack as Great Boulder cruise to first-up EGCA victory","link":"https://thewest.com.au/news/kalgoorlie-miner/stalwarts-flay-viewers-attack-as-great-boulder-cruise-to-first-up-egca-victory-c-8568684","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Bevan Bennell and Josh Rushmore shared a 143-run partnership for Great Boulder to set up victory against Lake View in round one of the 2022-23 Eastern Goldfields Cricket Association A-grade competition.","content":"Great Boulder issued an ominous warning to Eastern Goldfields Cricket Association rivals on Saturday after top-order stars Bevan Bennell and Josh Rushmore produced decisive knocks in an emphatic first-up A-grade victory over Lake View. Still smarting from last season’s grand final loss to Hannans after dominating the qualifying series, the Two Blues again loom as formidable opposition after Bennell blasted 81 in his return match and Rushmore fell three runs short of an opening-round ton. Bennell celebrated his return from the South West with a punishing 81 off 80 balls from the No.4 spot. It came after the side initially stuttered to 2-29. The right-hander’s runs were compiled in 111 minutes, underpinned by nine fours and three sixes. Bennell and Rushmore put on 143 for the fourth wicket that anchored an imposing 5-263. Rushmore was similarly aggressive, his 97 carved from 88 balls in just 80 minutes and featured six fours and three sixes. Luke Boxhall, recruited to the Viewers from Hannans after being crowned last summer’s O’Shaughnessy medallist, led the attack with 2-34. But Lake View were skittled for 71 in 26 overs on Great Boulder recruit Aaron Charlesworth’s three wickets. Charlesworth grabbed 3-26 off seven overs and Vaibhav Khangaonker and Judd Kelman each took two wickets. Kelman’s one over produced 2-0 with Boxhall’s 14 the top score in a rough season-opener for Lake View under new captain-coach Dave Roberts. Lake View began the run chase at 4-32 and the last six wickets tumbled for 19 runs on Khangaonker’s 2-12. While most attention fell on the sublime batting of Bennell and Rushworth, Great Boulder player-coach Dylan Hinchliffe was excited about what Khangaonker could add to the squad this season. Khangaonker, or Vab to his new temmates, is a student at the WA School of Mines who played in Perth’s first-grade ranks for Gosnells. “I got a phone call about Vab maybe two days after the (2021-22) grand final,” Hinchliffe said. “He had just moved to town and had played some under-15 cricket with (Great Boulder’s) Jace Reilly at South Perth. “When he arrived in Kalgoorlie, he contacted him (Reilly) and here we are. “He’s pretty handy with his right-arm pace but in all seriousness, there were a few fresh faces in the preseason that we were confident would make the grade. “But rather than me booming them up, it’s more a case of these guys letting their cricket do the talking.” Sign up for our emails","pubDate":"2022-10-17 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8568684/1d1f80ffc18cae0be7ceab863b90a13fe6cd5458-16x9-x0y209w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Rohit Sharma explains his stand on Mohammed Shami | READ","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-rohit-sharma-explains-his-stand-on-mohammed-shami-read-2022-10-17-816997","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: Rohit Sharma-led team India looks all ready and raring to go in the ongoing T20I World Cup. The Indian team flew out for Australia on October 6, 2022, and they will now play their first match of the Super 12 stage against arch-rivals Pakistan on October 23, 2022, at the Melbourne Cricket Ground. The Indian contingency lost Jasprit Bumrah to a back injury and that certainly is a huge setback for them ahead of the all-important T20 World Cup.","content":"-led team India looks all ready and raring to go in the ongoing T20I World Cup. The Indian team flew out for Australia on October 6, 2022, and they will now play their first match of the Super 12 stage against arch-rivals Pakistan on October 23, 2022, at the Melbourne Cricket Ground. The Indian contingency lost to a back injury and that certainly is a huge setback for them ahead of the all-important T20 World Cup. On the road to the Super 12 stage of the World Cup, India played against Australia in a warm-up game on October 17, 2022, in Brisbane. India convincingly won the match by 6 runs, but it was who had a point to prove to himself and his selection in the side. In one of its kind of move, skipper Rohit Sharma held Shami back till the last over and when he handed him the ball, the speedster did not disappoint. Shami scalped 3 wickets and conceded 4 runs in his quota of one over. After all the conjecture around Jasprit Bumrah and his fitness, the Indian team management inducted Mohammed Shami in the final squad. Prior to this, the right-arm pacer was a traveling reserve in the World Cup squad. Interestingly Mohammed Shami hasn't played any international T20I for India after the conclusion of the 2021 ICC T20 World Cup. Murmurs were rife that India was considering Mohammed Shami only for the One Day Internationals and the Test format, but injuries to Deepak Chahar and Jasprit Bumrah forced the Indian team management to rope in Shami and throw him in the mix as far as the 2022 edition of the T20 World Cup is considered.","pubDate":"2022-10-17 17:51:01","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Sunil Gavaskar greets Babar Azam, Pakistan Cricket Board shares video | WATCH","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-sunil-gavaskar-greets-babar-azam-pakistan-cricket-board-shares-video-watch-ind-vs-pak-2022-10-17-816980","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: Rohit Sharma-led team India will start their World Cup campaign on October 23, 2022, against Pakistan in Melbourne. Both these teams are in Group 2 with South Africa and Bangladesh. Just before this high-voltage clash takes place, former Indian legend and World Cup winner Sunil Gavaskar met Pakistan skipper Babar Azam and shared a few tips with him regarding the game. The Pakistan team recently defeated Bangladesh and New Zealand in a tri-series and will look to start their campaign on a winning note.","content":"-led team India will start their World Cup campaign on October 23, 2022, against Pakistan in Melbourne. Both these teams are in Group 2 with South Africa and Bangladesh. Just before this high-voltage clash takes place, former Indian legend and World Cup winner Sunil Gavaskar met Pakistan skipper and shared a few tips with him regarding the game. The Pakistan team recently defeated Bangladesh and New Zealand in a tri-series and will look to start their campaign on a winning note. The Pakistan Cricket Board shared the video on their official Twitter account. The video showcases the India legend interacting with Babar Azam and sharing some crucial tips about the game and his batting. The Pakistan skipper interacted with Gavaskar at an unofficial party in Australia. The Indian legend also signed a cap for Babar and gifted it to him. In a sweet gesture, Gavaskar wished Babar a very happy birthday. Former Pakistan legends Saqlain Mushtaq and Mohammad Yousuf were also present where both players interacted. The Pakistan cricket team is currently riding high on the backs of their series win against New Zealand and Bangladesh in a tri-series. The euphoric rise of Pakistan is something that is one for the ages. In the previous edition of the World Cup, Babar Azam's Pakistan defeated India by a margin of 10 wickets. This was the opening game for both India and Pakistan in the UAE edition of the World Cup. The Pakistan selectors were recently criticized for the squad that they selected for the World Cup. Their middle order certainly looks in turmoil and if Babar or Rizwan fail to fire for Pakistan, they certainly will face difficulties as they go deep into the tournament. Pakistan will play against India on October 23, 2022, at the Melbourne Cricket Ground and they will look to repeat their heroics from last year.","pubDate":"2022-10-17 16:48:38","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: 'जब से बॉलिंग स्टार्ट करी है, आपको फॉलो कर रहा हूं', मोहम्मद शमी से बोले शाहीन अफरीदी; वीडियो वायरल","link":"https://www.abplive.com/sports/cricket/pakistan-fast-bowler-shaheen-afridi-heart-warming-chat-with-mohammed-shami-goes-viral-on-social-media-2240185","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Shaheen Afridi & Mohammed Shami Viral Video: सोमवार के दिन भारतीय तेज गेंदबाज मोहम्मद शमी इंटरनेट पर छाए रहे. दरअसल, मोहम्मद शमी ने ऑस्ट्रेलिया के खिलाफ वॉर्म अप मैच में शानदार गेंदबाजी की. इसके अलावा एक वीडियो में पाकिस्तानी तेज गेंदबाज शाहीन अफरीदी को गेंदबाजी टिप्स देते नजर आ रहे हैं. भारतीय तेज गेंदबाज का यह वीडियो सोशल मीडिया पर तेजी से वायरल हो रहा है. ऑस्ट्रेलिया के खिलाफ वार्म अप मैच में मोहम्मद शमी ने महज 1 ओवर गेंदबाजी की, लेकिन 3 खिलाड़ियों को अपना शिकार बनाया. अब पीसीबी ने अपने ऑफिशियल हैंडल से मोहम्मद शमी और शाहीन अफरीदी का वीडियो शेयर किया है. 'शमी भाई कैसे हैं आप...' दरअसल, मोहम्मद शमी गाबा मैदान पर गेंदबाजी का अभ्यास कर रहे थे. वहीं, उस दौरान पाकिस्तान के तेज गेंदबाज शाहीन अफरीदी भी मौजूद थे. मोहम्मद शमी को देखने के बाद शाहीन अफरीदी ने पूछा कि 'शमी भाई कैसे हैं आप'. मोहम्मद शमी की तारीफ करते हुए शाहीन अफरीदी ने कहा कि जबसे मैंने बॉलिंग स्टार्ट करी है, तब से मैं आपको फॉलो कर रहा हूं. आपकी ना रिस्ट पॉजिशन और सीम का जवाब नहीं है. इस दौरान मोहम्मद शमी और शाहीन अफरीदी के बीच गेंदबाजी पर देर तक बातचीत हुई. साथ ही मोहम्मद शमी ने शाहीन अफरीदी से अपने अनुभव साझा किए. The @T20WorldCup meetup: Stars catch up on the sidelines 🤩#WeHaveWeWill | #T20WorldCup pic.twitter.com/J1oKwCDII2 — Pakistan Cricket (@TheRealPCB) October 17, 2022 'अगर रिलीज प्वॉइंट अच्छा हो जाएगा ना सीम भी ठीक हो जाएगा' मोहम्मद शमी ने शाहीन अफरीदी से कहा कि अगर रिलीज प्वॉइंट अच्छा हो जाएगा ना सीम भी ठीक हो जाएगा. पीसीबी ने अपने ऑफिशियल ट्विटर हैंडल से इस वीडियो को शेयर किया है. बहरहाल, दोनों खिलाड़ियों के बीच बातचीत का यह वीडियो सोशल मीडिया पर छाया हुआ है. दोनों देशों के क्रिकेट फैंस को यह वीडियो खूब पसंद आ रहा है. गौरतलब है कि आज टीम इंडिया ने वॉर्म अप मैच में ऑस्ट्रेलिया को 6 रनों से हराया. वहीं, पाकिस्तान टीम को इंग्लैंड के खिलाफ वॉर्म अप मैच में 6 विकेट से हार का सामना करना पड़ा. ये भी पढ़ें- T20 WC 2022: विश्व कप के बाद टी20 फॉर्मेट नहीं खेलेंगे ये 3 भारतीय दिग्गज! देखें लिस्ट में कौन कौन शामिल FIFA U-17 Women's World Cup: भारत और ब्राजील का मैच जारी, हाफ टाइम तक टीम इंडिया 0-2 से पीछे","content":null,"pubDate":"2022-10-17 16:38:09","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"NAM vs NED Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s NAM vs NED T20 World Cup 2022 match No. 5 in Geelong, 930 PM IST, October 18","link":"https://zeenews.india.com/cricket/nam-vs-ned-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-nam-vs-ned-t20-world-cup-2022-match-no-5-in-geelong-930-pm-ist-october-18-2523230.html","keywords":null,"creator":null,"video_url":null,"description":"Namibia vs Netherlands Dream11 Team Prediction Namibia vs Netherlands T20 World Cup 2022 Match No. 5 Preview - Check My Dream11 Team, Best players list of NAM vs NED, Namibia Dream11 Team Player List, Netherland Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"After beating Sri Lanka in the first match of the ICC T20 World Cup 2022, Namibia will look to continue their winning run against the Netherlands in their second game of the mega event at the GMHBA Stadium in Geelong on Tuesday. Netherlands are coming into this game after beating UAE in a thrilling contest while Namibia are high on confidence after winning the game against Asian champions. Also Read: Namibia vs Netherlands T20 World Cup 2022 Match No. 4 Preview, LIVE Streaming details: When and where to watch NAM vs NED match online and on TV? Match Details Namibia vs Netherlands ICC T20 World Cup 2022 October 18, Tuesday GMHBA Stadium in Geelong 9:30 AM IST Here's my Dream11 prediction for Namibia vs Netherlands game Scott Edwards, Jan Nicol Loftie-Eaton, Gerhard Erasmus, Jan Frylinck (c), Bas de Leede (vc), JJ Smit, David Wiese, Ben Shikongo, Fred Klaasen, Tim Pringle. Namibia predicted XI: Gerhard Erasmus(C), Divan la Cock, Stephan Baard, Jonathan Smit, D Wiese, M van Lingen, Jan Nicol Loftie-Eaton, Zane Green, Jan Frylinck, Bernard Scholtz, Ben Shikongo Netherlands predicted XI: Colin Ackermann, TLW Cooper, BFW de Leede, MP O'Dowd, RE van der Merwe, Vikramjit Singh, S Edwards(C), Logan van Beek, Fred Klaassen, PA van Meekeren, Tim Pringle Netherlands Squad: Scott Edwards (c), Colin Ackermann, Shariz Ahmad, Logan van Beek, Tom Cooper, Brandon Glover, Timm van der Gugten, Fred Klaassen, Bas de Leede, Paul van Meekeren, Roelof van der Merwe, Stephan Myburgh, Teja Nidamanuru, Max O’Dowd, Tim Pringle, Vikram Singh. Namibia Squad: Gerhard Erasmus (c), JJ Smit, Divan la Cock, Stephan Baard, Nicol Loftie Eaton, Jan Frylinck, David Wiese, Ruben Trumpelmann, Zane Green, Bernard Scholtz, Tangeni Lungameni, Michael van Lingen, Ben Shikongo, Karl Birkenstock, Lohan Louwrens, Helao Ya France.","pubDate":"2022-10-17 16:28:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: 'Disappointing loss for sure,' says Nicholas Pooran after WI's defeat to Scotland","link":"https://www.thehansindia.com/sports/cricket/t20-world-cup-disappointing-loss-for-sure-says-nicholas-pooran-after-wis-defeat-to-scotland-765778","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Scotland defeated West Indies by 42 runs on MondayWest Indies are two-time T20 World Cup champions George Munsey was MoM for scoring 66","content":"‘Disappointing loss for sure,’ says Nicholas Pooran after WI’s defeat to Scotland West Indies skipper Nicholas Pooran termed his side's 42-run defeat to Scotland in T20 World Cup group game on Monday as \"disappointing.\" Scotland began their T20 World Cup 2022 campaign by inflicting an upset in Hobart. Opening batsman George Munsey scored a 53-ball 66 in his side's total of 160 for 5 in 20 overs. An all-round effort from their bowlers restricted the two-time champions West Indies to 118 in 18.3 overs in the second innings. Munsey, the eventual Player of the Match, struck nine fours in his knock. At the post-match presentation, Pooran, who only managed to score four runs in nine deliveries, slammed Windies' middle-order batting. Jason Holder was the leading run-scorer for West Indies with his 33-ball 38. \"It was a tough loss for us. Disappointing for sure. I guess now we got to do the hard work now and win both games. 160 was a par score. The middle-order batting was disappointing. We have been struggling in the middle order for some time and it continues. Definitely not acceptable (asked about the batting against Scotland's spinners). The ball wasn't spinning much. We got to reflect and get better. The next two games are a must win. I guess when you perform bad as players, you want the next game to come as quickly as possible. I don't think we were complacent. We did get off to a good start, but disappointing after the powerplay,\" added Pooran on Monday. West Indies are scheduled to play against Zimbabwe and Ireland in their remaining Group B games. Later on Sunday, another Sikander Raza show helped Zimbabwe thrash the Irish side by 31 runs. Considering Scotland had played only two T20Is between last year and the ongoing edition of the T20 World Cup, their win over West Indies was \"special\" for them, according to skipper Richie Berrington. \"It's a special win for us. A lot of hard work has been put in for this in the last one year. Extremely proud of the boys. We haven't had as much as T20 cricket as we would have liked (Scotland played only 2 T20Is between World Cups). But we played a lot of 50-over cricket, so it was important we transferred that skill to T20 cricket. We were looking at a few more after the start we got off to. But we knew this was a competitive score. The bowlers were exceptional. Mark Watt was exceptional, in the powerplay and he generally takes big wickets. Leask today was excellent four overs on the trot,\" the Scottish captain added further. Scotland's next game is on Wednesday (Oct. 19) against Ireland at Hobart's Bellerive Oval. Later that day, West Indies also take on Zimbabwe at the same venue.","pubDate":"2022-10-17 16:22:11","image_url":"https://assets.thehansindia.com/h-upload/2022/10/17/500x300_1316748-nicholas-pooran.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: India got enough time to prepare, understand Australian conditions, says Hardik Pandya","link":"https://www.thehansindia.com/sports/cricket/t20-world-cup-india-got-enough-time-to-prepare-understand-australian-conditions-says-hardik-pandya-765776","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India have already played 4 warm-up gamesThey are set to play one more on WednesdayIndia will begin their T20 World Cup campaign on Oct. 23 at MCG","content":"India got enough time to prepare, understand Australian conditions, says Hardik Pandya Hardik Pandya has said the Board of Control for Cricket in India (BCCI) has given the Indian team enough time to prepare for the T20 World Cup 2022 . India flew down to Perth last week and played three warm-up games against Western Australia XI. Team India locked horns against Australia at The Gabba, Brisbane. India won all the said games and are scheduled to play one more practice game, which is against New Zealand, before the Super 12s round goes underway in the underway T20 World Cup Down Under on Oct. 22. Hardik has also stated that the players have been given adequate time to get used to the conditions and weather in Australia. \"I was always excited to come to Australia and get so much time to prepare because I have always felt that as an individual if I get the right situations and conditions to practise, you can't ask for a better scenario for me or the whole team to come here and spend 17 days before the World Cup starts and get used to the conditions, atmosphere, and weather,\" Hardik was quoted as saying in a video uploaded on BCCI on social media. The all-rounder also said that he was happy with his form with the bat as he scored 44 runs against Western Australian XI but managed just two runs against Australia on Monday (Oct. 17). However, Hardik is yet to pick a wicket. \"If you see it on the high-end side, it was a satisfactory day. It's not about the runs I scored, it was about my approach towards the game, and how I adapted to the situation. I played 21 odd balls and I managed to middle almost everything. That was more positive in the practice games,\" the 29-year-old cricketer added further. Hardik, who captained Gujarat Titans (GT) to the Indian Premier League (IPL) title and also led India in Ireland earlier this year, said that if a player finds form early in the tournament, then one has a better chance of exploiting the conditions to one's advantage. \"There was a very good point made by one of the players, that in Australia, it's about one inning. If you can get the inning early in the season, once you get used to the conditions, you can score a lot of runs. And it's the same for a fast bowler,\" Hardik added. Mission #T20WorldCup 🏆All-rounder @hardikpandya7 discusses it all as #TeamIndia gear up for the marquee event👍 👍 - By @RajalArora Full interview 🎥 🔽 https://t.co/Kl71g3ILJ8 pic.twitter.com/rcyNcpL4B4 India's second warm-up match is against Kane Williamson's New Zealand on Wednesday (Oct. 19) at The Gabba, Brisbane. Team India is scheduled to begin their T20 World Cup campaign on Oct. 23 when they take on arch-rivals Pakistan at Melbourne Cricket Ground (MCG).","pubDate":"2022-10-17 15:39:45","image_url":"https://assets.thehansindia.com/h-upload/2022/10/17/500x300_1316738-hardik-pandya.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Roger Binny set to become BCCI president at apex body’s Annual General Meeting","link":"https://sportstar.thehindu.com/cricket/roger-binny-bcci-president-annual-general-meeting/article66022360.ece","keywords":null,"creator":["\n        Amol Karhadkar  \n    "],"video_url":null,"description":"AGM may witness heated discussions while finalising the BCCI’s representative to the International Cricket Council (ICC).","content":null,"pubDate":"2022-10-17 15:02:57","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma: Challenged Shami by giving him the last over, you saw what he did","link":"https://www.thehansindia.com/sports/cricket/rohit-sharma-challenged-shami-by-giving-him-the-last-over-you-saw-what-he-did-765774","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India defeated Australia by 6 runs in a warm-up gameIndia’s next practice game is against New ZealandTeam India will begin their T20 World Cup campaign on Oct. 23","content":"Rohit Sharma: Challenged Shami by giving him the last over, you saw what he didRohit Sharma: Challenged Shami by giving him the last over, you saw what he didIndia captain Rohit Sharma has said he wanted to challenge Mohammed Shami by giving him the final over during India's warm-up game against Australia. Shami picked up two wickets and enforced a run out in the final over on Monday as India defeated Australia by six runs in a close encounter at the Gabba, Brisbane. Australia, who were cruising to a victory in the T20 World Cup 2022 warm-up game, lost Kane Richardson, Ashton Agar, and Pat Cummins in their chase of 187. The Indian pacer last played a T20I last year during the T20 World Cup in the UAE. He had a fine run in the Indian Premier League (IPL) that earned him a place in India's reserves for the T20 World Cup. However, an injury to Jasprit Bumrah saw Shami find a place in India's main squad for the ICC event, which began on Sunday Down Under. \"I thought we batted well, towards the end we could have added 10-15 runs more. We always want a set batter to stay till the end, SKY did it, overall a great batting effort with nice bounce, was a pitch where you can trust your shots. You got to be smart with batting on grounds like these. You can't forget to push the balls into the gaps, scoring 8-9 runs in an over can be quite an effective plan. It was a great practice game for us,\" said Rohit, who only managed 15 runs in the first innings. The Indian skipper went on to add that there was still room for improvement and that he needed more consistency from his bowlers. \"There is room for improvement, but I want more consistency from the bowlers. You need to keep things simple and hit the deck hard. Overall a good game for us, they had a decent partnership and that put us under pressure. He (Shami) is coming back after a long time, so we wanted to give him an over. Wanted to give him a challenge and let him bowl the final over, and you saw what he did,\" added Rohit. T20 World Cup 2022: 'Happy with my form,' says Aaron FinchMeanwhile, Australia captain Aaron Finch singled out Richardson with praise as the fast bowler made four breakthroughs, claiming crucial wickets of Suryakumar Yadav, Hardik Pandya, Dinesh Karthik, and Ravichandran Ashwin. Richardson finished with figures of 4 for 30 in his quota of four overs. \"We learned that we need to be clinical towards the back-end, we didn't capitalize towards the end. We did drag them back after that blistering start from KL, happy with my own form. He's fantastic (on Kane Richardson), every opportunity he gets for Australia, he's there performing, and that shows the depth of our pace bowling unit. 22nd will be a great day, looking to start off on a winning note, playing against New Zealand and at the SCG will be always special,\" said Finch after the game in Brisbane. While Australia were scheduled to play just one warm-up game in the lead-up to the T20 World Cup Super 12s, India are set to play one more game. The Men in Blue will take on New Zealand at The Gabba on Wednesday (Oct. 19). India will begin their T20 World Cup 2022 campaign by facing off against Pakistan on Oct. 23 at Melbourne Cricket Ground (MCG), while Australia will take on the BlackCaps on Oct. 22 at Sydney Cricket Ground (SCG).","pubDate":"2022-10-17 14:52:00","image_url":"https://assets.thehansindia.com/h-upload/2022/10/17/500x300_1316736-rohit-sharma.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch amazing moment blind West Ham fan lands £285,000 winner as he listens to horse triumph at Ascot","link":"https://www.thesun.co.uk/sport/horseracing/20133073/blind-west-ham-fan-huge-win-ascot/","keywords":["Horse Racing","Horse racing","West Ham transfer news"],"creator":["Sam Morgan"],"video_url":null,"description":null,"content":"THIS is the amazing moment a West Ham fan who has been blind since birth lands a £285,000 winner at Ascot. You can sense proud owner Andrew Gemmell living every word as his beloved Trueshan roared home under Hollie Doyle to win the Long Distance Cup on Champions Day. Blind West Ham fan Gemmell listens intently as Trueshan thunders to the finish Unable to see since birth Gemmell, who is in his 60s, celebrates once victory is confirmed AFPTrueshan, in the blue and yellow silks, won an absolute thriller at Ascot[/caption] It was a thrilling finish, with the Alan-King trained stayer bouncing back to form to see off Coltrane by a head. Gemmell, famed for wearing a West Ham scarf as he goes up to collect trophies on racedays, can’t stop the nervous energy as the commentary blares out over the Berkshire track. With his friends cheering the horse on next to him, Gemmell, who is in his 60s, raises his hands in celebration once he realises Trueshan has won. Victory was worth a whopping £285,000, which Gemmell will share with the rest of the Singula Partnership who own the horse. Punters were absolutely loving seeing Gemmell, a huge supporter of the sport, land another memorable win. One said: “Blind since birth – how amazing is this!” Most read in Horse Racing JUST FOUR YOU Cheltenham Festival over four days as controversial plans for fifth scrapped KING'S COIN Charles to sell Queen's beloved horses despite making £50k in a month from them ON A ROL Stunning Carol Vorderman goes wild celebrating £660 winner with Frankie Dettori FIVER FLUTTER This 10-1 shot is weighted to win and can strike in style at Pontefract TEMPLEGATE TIPS My NAP was an eyecatcher in the Cesarewitch and can go in at Pontefract THEY’RE OFF King Charles to sell 12 of the Queen’s favourite top racehorses OFFERS OF THE DAY William Hill: Bet £10 Get £30 in free bets – CLAIM HERE Betfair: Bet £10 Get £30 – CLAIM HERE Paddy Power: Bet £20 and get it back as cash if it loses – CLAIM HERE Sky Bet: Bet £10 on Racing and get £30 in free bets – CLAIM HERE Ladbrokes: Bet £5 Get £20 – CLAIM HERE Coral: Bet £5 Get £20 – CLAIM HERE William Hill: 18+. Play Safe. From 00:01 on 13.04.2022. £30 bonus. New customers only. Minimum £10 stake on odds of 1/2 (1.5) or greater on sportsbook. Further terms apply. Begambleaware.org Betfair – Place a min £10 bet on the Sportsbook on odds of min 1/2 (1.5), get £30 in Free Bets. Rewards valid for 30 days. SMS verification required. Only deposits via cards will qualify. T&Cs apply. Please Gamble Responsibly 18+ begambleaware.org Paddy Power: New customers only. Place your FIRST bet on any market at odds of min 2.0 (EVS) and if it loses we will refund your stake in CASH. Max refund for this offer is £20. Only deposits made using cards will qualify for this promotion. T&Cs apply. 18+ Begambleaware.org Sky Bet: New customers only. First single & e/w bet only odds of 1/1 or greater. 3 x £10 bet tokens. Free bet stakes not included in returns. Free bets only redeemable on horse racing. Free bets are non withdrawable. No free bet expiry. Eligibility restrictions and further t&cs apply. Ladbrokes: 18+ New UK+IRE Customers only. Certain deposit methods & bet types excl. Min first £/€5 bet within 14 days of account reg at min odds 1/2 to get 4x £/€5 free bets. Free bets available to use on selected sportsbook markets only. Free bets valid for 7 days, stake not returned. Restrictions + T&Cs apply. Begambleaware.org Coral: Eligible UK+IRE players. Paypal & some deposit & bet types excl. Min first £5 bet within 14 days of account reg at min odds 1/2 = 4x £5 free bets. Free bets valid for 7 days, stake not returned. No cash-out, restrictions & T&Cs apply. 18+ T&Cs Apply. Begambleaware.org Another commented: “What an amazing man.” One post read: “Makes my heart smile.” Gemmell is perhaps best known for being the owner of Paisley Park. The ten-year-old hurdler, trained by Emma Lavelle, has won more than £600,000 during his career and reached the top when winning the Stayers’ at the 2019 Cheltenham Festival. Asked how celebrated that life-changing win, Gemmell said simply: “Got p***ed.” The owner fell in love with racing after a trip to the Scottish Grand National when he was 12. And his fondness for a punt has always been there too. After a successful career with Westminster Council, Gemmell, who enjoyed a tipple before Hammers games in the same East End pub Bobby Moore drank at, retired aged 42. Although he could not see, Gemmell went to hundreds of gigs – he told the BBC he’s seen The Rolling Stones 50 times. And as a cricket fanatic has gone to Ashes Tests. But it is with the horses he feels most at home – and specifically Paisley Park. Remarking on the incredible bond the pair share, Levelle, who trains near Marlborough in Wiltshire, told The Jockey Club: “He [Gemelle] can get so much out of racing – the commentaries are fantastic, the feel and touch of the horses, being around the horses. “When they are on the gallops you can feel the vibration in the ground as the horses go by. “The horses respond to him. Paisley Park loves him. He will just stand there and let Andrew pat him.” FREE BETS GET OVER £2,000 IN SIGN UP OFFERS HERE Commercial content notice: Taking one of the bookmaker offers featured in this article may result in a payment to The Sun. 18+. T&Cs apply. Begambleaware.org Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playingOnly gambles with money they can afford to loseNever chases their lossesDoesn’t gamble if they’re upset, angry or depressedGamcare – www.gamcare.org.ukGamble Aware – www.begambleaware.org","pubDate":"2022-10-17 14:20:38","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Batting for Sourav, Mamata urges PM for allowing him to contest ICC polls","link":"https://www.business-standard.com/article/sports/batting-for-sourav-mamata-urges-pm-for-allowing-him-to-contest-icc-polls-122101700912_1.html","keywords":null,"creator":null,"video_url":null,"description":"West Bengal Chief Minister Mamata Banerjee on Monday said she was shocked that former India captain Sourav Ganguly was deprived of a second term as the Board of Control for Cricket in India (BCCI) president. Banerjee, while talking to reporters at the Kolkata airport before leaving for a trip to the northern part of the state, also said she would urge Prime Minister Narendra Modi to intervene so that Ganguly is allowed to contest the elections for International Cricket Council (ICC) chief. The issue of ICC chairmanship will be up for discussion when the BCCI holds its Annual General Meeting on Tuesday in Mumbai, where Roger Binny, a member of the 1983 World Cup winning team, will replace Ganguly as the new Board President. Sourav Ganguly is not only the pride of Bengal but also of the entire nation. He has led the cricket team and BCCI with the utmost dedication and responsibility. He has proved himself to be an able administrator and I am shocked by his removal from the BCCI ...","content":null,"pubDate":"2022-10-17 14:15:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221017/thumb-122101700912.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Virat Kohli displays high fitness standards, sets Twitter ablaze","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-virat-kohli-displays-high-fitness-standards-sets-twitter-ablaze-ind-vs-aus-pat-cummins-mohammad-shami-2022-10-17-816943","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: Rohit Sharma-led team India are currently stationed in the Australian continent as they embark on their World Cup journey. The Indian team flew to Australia on October 6, 2022, to prepare for this mega event and played against Western Australia in two practice games. India managed to win only one game and ended up losing the second one. As the Super 12 stage commences on October 22, 2022, team India is gearing up to clash against their arch-rivals Pakistan. The mother of all clashes will be played on October 23, 2022, at the Melbourne Cricket Ground.","content":null,"pubDate":"2022-10-17 13:31:15","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Sikandar Raza leads charge as Zimbabwe beat Ireland by 31 runs","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-sikandar-raza-leads-charge-as-zimbabwe-beat-ireland-by-31-runs-2022-10-17-816926","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: The Zimbabwe cricket team on Monday outclassed the Irish side in the round 1 match at Bellerive Oval, Hobart. Led by Sikandar Raza with the bat, Zimbabwe emerged victorious in the second match of the day by 31 runs. With this win, Zimbabwe have opened their account in the points table of Group B and are in the second spot. ","content":"The Zimbabwe cricket team on Monday outclassed the Irish side in the round 1 match at Bellerive Oval, Hobart. Led by Sikandar Raza with the bat, Zimbabwe emerged victorious in the second match of the day by 31 runs. With this win, Zimbabwe have opened their account in the points table of Group B and are in the second spot. For his brilliant knock and a wicket, Sikandar Raza has been awarded the man of the match award. \"We have not come here because we are happy to represent Zimbabwe. The goal was to get into the Super 12 stage. To have this win is certainly humbling, exciting and happy,\" Raza said after the match. Regis Chakabva (wk), Craig Ervine (c), Wesley Madhevere, Sean Williams, Sikandar Raza, Milton Shumba, Ryan Burl, Luke Jongwe, Tendai Chatara, Richard Ngarava, Blessing Muzarabani Andrew Balbirnie (c), Paul Stirling, Lorcan Tucker (wk), Harry Tector, George Dockrell, Curtis Campher, Gareth Delany, Mark Adair, Simi Singh, Barry McCarthy, Joshua Littl","pubDate":"2022-10-17 12:49:09","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli puts on fielding masterclass as India edges Australia in World Cup tune-up game - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMirAFodHRwczovL3d3b3MubmluZS5jb20uYXUvbnJsL3QyMC13b3JsZC1jdXAtMjAyMi1hdXN0cmFsaWEtdi1pbmRpYS13YXJtLXVwLW1hdGNoLWF1c3RyYWxpYS12LWluZGlhLXZpcmF0LWtvaGxpLWNhdGNoLXJ1bi1vdXQtYWFyb24tZmluY2gvOTJkOGI0ZjItMWI0NS00OWZhLWJmYmYtYzhjMjEzNjNkNDg00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli puts on fielding masterclass as India edges Australia in World Cup tune-up game  Wide World of SportsAussies in massive T20 ‘mess’ as all-time late collapse sparks major WC concern  Fox SportsIndia takes four wickets in final four balls to defeat Australia in T20 warm-up  ABC NewsFinch scores crucial runs as Aussies lose last-over thriller  cricket.com.auAaron Finch finds form but Australia lose T20 World Cup warm-up to India  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-10-17 12:25:45","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Watch: Virat Kohli's Brilliant Throw To Run Out Tim David In Warm-up Game Ahead Of T20 World Cup - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90MjAtd29ybGQtY3VwLTIwMjIvaW5kaWEtdnMtYXVzdHJhbGlhLXdhcm0tdXAtbWF0Y2gtdmlyYXQta29obGlzLWJyaWxsaWFudC10aHJvdy10by1ydW4tb3V0LXRpbS1kYXZpZC13YXRjaC0zNDM5MTA50gGRAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3QyMC13b3JsZC1jdXAtMjAyMi9pbmRpYS12cy1hdXN0cmFsaWEtd2FybS11cC1tYXRjaC12aXJhdC1rb2hsaXMtYnJpbGxpYW50LXRocm93LXRvLXJ1bi1vdXQtdGltLWRhdmlkLXdhdGNoLTM0MzkxMDkvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Virat Kohli's Brilliant Throw To Run Out Tim David In Warm-up Game Ahead Of T20 World Cup  NDTV SportsIndia vs Australia Live Score Warm Up Match ICC Men's T20 World Cup Live Streaming, Live Telecast Channel In India- AUS vs IND Live Score, IND vs AUS Live Score  Cricket AddictorIND vs AUS Highlights, T20 World Cup 2022 Warm-up Match: Mohammad Shami Wins it for India After KL Rahul, S  News18'Wanted to give him a little bit of a challenge' - Rohit on holding Shami back till the last over  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-10-17 12:07:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Haven’t been made aware of what’s going to happen”: Kane Richardson unsure of spot in Australia Playing 11 vs New Zealand at SCG","link":"https://thesportsrush.com/cricket-news-havent-been-made-aware-of-whats-going-to-happen-kane-richardson-unsure-of-spot-in-australia-playing-11-vs-new-zealand-at-scg/","keywords":["Cricket","ICC T20 World Cup 2022","India vs Australia","Kane Richardson"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Kane Richardson bowled a brilliant spell against India, but he is unsure about playing the first Super-12 game against New Zealand. The Australian team is looking to retain its T20 World Cup crown in their home conditions, but they lost their first practice game against India at the Gabba in Brisbane by 6 runs. They… The post “Haven’t been made aware of what’s going to happen”: Kane Richardson unsure of spot in Australia Playing 11 vs New Zealand at SCG appeared first on The SportsRush.","content":"Kane Richardson bowled a brilliant spell against India, but he is unsure about playing the first Super-12 game against New Zealand. The Australian team is looking to retain its T20 World Cup crown in their home conditions, but they lost their first practice game against India at the Gabba in Brisbane by 6 runs. They were in a strong position in between but choked in the last few overs. Australia opted to bowl first, and India posted a brilliant total of 186 runs, where the Aussie pacer Kane Richardson bowled a brilliant spell and took 4 wickets by conceding just 30 runs in 4 overs. In the last over of the Australian innings, Virat Kohli took a stunning catch to deny Australia their victory. Australia decided to rest David Warner, Josh Hazlewood, Adam Zampa and Matthew Wade in this match. All four of them are expected to make Australia’s 11 in the main tournament. Kane Richardson unsure of spot in Australia Playing 11 Kane Richardson has said that he has not played many games since playing in the Hundred in England, and he was not even expecting to play in the first warm-up game as well. He said that it was just being done to keep the body in tune if something happens to someone during the tournament. “I think after the hundred, I’ve played just one game against England the other day, so it’s basically one game in six weeks,” Kane Richardson said to cricket.com.au. “So any time you can come up against good opposition and put it in a game environment, it’s useful. But I was not expecting to play game one, so it’s just about done tuning to be ready in case something happens.” Candid stuff as always from Kane Richardson on his chances of cracking the Aussie XI after starring in today’s warm-up clash against India #T20WorldCup pic.twitter.com/qALPHZRXVu — cricket.com.au (@cricketcomau) October 17, 2022 It is almost confirmed that Pat Cummins, Mitchell Starc and Josh Hazlewood will be leading the pace attack of the side, and Richardson also acknowledged the same fact. He said the situation can only change if any kind of injury happens to anyone, and these things are very common. “I have not been made too aware of what’s going to happen, but I think we all know those these guys are going to start. It’s probably an injury away from changing things,” Kane Richardson added. Richardson is a seasoned T20 player, and he has scalped 199 T20 wickets in 153 maches at an economy of 8.02. It is safe to say that Australia have a brilliant backup bowler in Richardson. The post “Haven’t been made aware of what’s going to happen”: Kane Richardson unsure of spot in Australia Playing 11 vs New Zealand at SCG appeared first on The SportsRush.","pubDate":"2022-10-17 11:59:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Afghanistan to tour Sri Lanka for ODI series in November","link":"https://sportstar.thehindu.com/cricket/afghanistan-tour-of-sri-lanka-odi-series-schedule-matches-world-super-league-2023-world-cup-india/article66021904.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"The three-match series will be played at the Pallekelle International Cricket Stadium in Kandy.","content":null,"pubDate":"2022-10-17 11:53:29","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"}]}