{"newsArray":[{"title":"Cricket: Pakistan name depleted squad for Black Caps tests","link":"https://www.nzherald.co.nz/sport/cricket-pakistan-name-depleted-squad-for-black-caps-tests/7NUWBMWCKFB7NM6KMMERFUP3RQ/","keywords":null,"creator":null,"video_url":null,"description":"Depleted Pakistan recalled fast bowler Hasan Ali for their home test series against NZ.","content":null,"pubDate":"2022-12-22 00:15:32","image_url":"https://www.nzherald.co.nz/resizer/FllFiNG83s6Qq6TVmdCAKJn9Fwk=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/72ARCKF3YXP3KUBY4ZOB7N2UQE.jpg","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"‘Didn’t know’: Aussie star’s hat-trick reaction","link":"https://www.themercury.com.au/sport/cricket/michael-neser-takes-first-hattrick-and-then-loses-the-ball/news-story/867251a2f5336ec4d8f6251f1bcb42b4","keywords":["Big Bash News","Breaking News","Cricket news and galleries","National Breaking News","NewsWire","Sport news and galleries"],"creator":null,"video_url":null,"description":"Michael Neser didn’t even know he’d taken the first hat-trick of his career, at any level, after snagging three wickets across two overs for the Brisbane Heat on Wednesday night.","content":"But the video footage may be the only memorabilia available to the Brisbane Heat quick after the ball he took wicker number three with was dispatched onto the grandstand roof by Renegades slugger Andre Russell in a quick reminder to Neser that you’re only as good as your last ball.Neser destroyed the Renegades’ top order on Wednesday night, reducing them to 4-9 in their run chase, with his fourth wicket the final one of his hat-trick. It was on the second ball of his second over, leading to the confusion over his feat.“Sh*t, that‘s funny,” Neser told reporters post-match when they informed him of the rare feat.“I didn’t realise I took a wicket on that final ball of that over before. It’s kind of cool – first hat-trick I’ve ever taken. “I haven’t even taken one in junior cricket, nothing. Blood was pumping. “To be honest, a lot was going on. The wicket was doing a lot, the ball was swinging, so I was really just focused on bowling a good four-day length.”Returning to the Big Bash after being squeezed out of Australia‘s Test squad, Neser responded in style with four wickets in his first eight deliveries.He finished with career-best T20 figures of 4-32 after copping some stick from Russell, who smashed the final ball of his second over onto the grandstand roof. It was one of three sixes the West Indies power hitter blasted off Neser as the Renegades went on to win by four wickets. “He took me on when the ball was going and it worked in his favour,” Neser said.“I felt like any of those balls could’ve gone up.“He hits the ball real hard and unfortunately for me they went the journey.” The result left the Heat in a 0-2 hole ahead of a clash with the unbeaten Adelaide Strikers (3-0) at the Gabba on Friday, but there’s no panic in the Brisbane camp.“It‘s a long competition. There’s plenty of cricket left, so no need to panic,” Neser said.“We‘re still playing good cricket and we’re contesting with ball and bat.“I feel like we can string a couple of good games together, no doubt.”","pubDate":"2022-12-21 21:44:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Goosebumps’: West Indies star’s monster hit","link":"https://www.themercury.com.au/sport/cricket/andre-russell-could-extend-big-bash-stay-after-stunning-hit/news-story/cce38e4be644e8f59778b0d01acb2b05","keywords":["Big Bash News","Breaking News","Cricket news and galleries","National Breaking News","NewsWire","Sport news and galleries"],"creator":null,"video_url":null,"description":"West Indian powerhouse Andre Russell is determined to fulfil his goal of a contract clean sweep when his Melbourne Renegades take on the Hurricanes in Hobart on Saturday night.","content":"Russell, who signed a four-match deal with the Renegades after being overlooked in the draft, was noncommittal about the possibility of an extension, with Kiwi blaster Martin Guptill set to take his place and veteran Shaun Marsh set to play after overcoming a calf injury. Having already helped the men in red to three wins from their first three games this season – their best start in 10 years – Russell has one more game left in his contract before he links up with the Abu Dhabi Knight Riders next month in the newly formed UAE-based International League T20.“The plan was to actually come here and give the Renegades a good start,” he said after his man-of-the-match 57 against Brisbane on Wednesday night.“When I was talking to my agent about the contract and four games, I was like, ‘OK, it would be amazing to leave with four wins and we are on the right road’.”When asked whether the Renegades had tried to make a last-ditch effort to extend his contract, Russell laughed: “Nothing has been discussed, but at the end of the day, a contract is a contract, so at the end of day I’ll leave that to discuss with my agent ... I’ll see about that, I’ll see about that.”The highlight of Russell’s blistering 42-ball knock against the Heat was a six that went out of the ground, and he admitted the big hit gave him “a little goosebump”.Aaron Finch is also in form with the bat for the Renegades, and after a poor T20 World Cup, he has enjoyed a resurgence in form, playing important roles in Melbourne’s last two wins.Russell said there was no reason why Finch’s new role of coming in at No.4 couldn’t suit him for the remainder of the season.“Every time I see Finchy, I see Finchy as an opener, to take on the first six or the first four overs, just back himself and just go over the top, play shots,” Russell said.“But when you play a lot of T20s and play a lot of international cricket I think, for leagues like this, you can just show how flexible you are.“So Finchy with experience, he can bat wherever, so I’m happy for him.”","pubDate":"2022-12-21 21:28:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shere Bangla National Stadium Dhaka Test records: Dhaka Test match records and highest innings totals","link":"https://thesportsrush.com/cricket-news-shere-bangla-national-stadium-dhaka-test-records-dhaka-test-match-records-and-highest-innings-totals/","keywords":["Cricket","Dhaka","India tour of Bangladesh 2022","Shere Bangla National Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Team India will eye on a clean sweep and maintain their unbeaten record against hosts Bangladesh in the format, as they are set to take them on in the second and last Test match of the series, at the Shere Bangla National Stadium in Dhaka today. However, it seems like the list of Indian players… The post Shere Bangla National Stadium Dhaka Test records: Dhaka Test match records and highest innings totals appeared first on The SportsRush.","content":"Team India will eye on a clean sweep and maintain their unbeaten record against hosts Bangladesh in the format, as they are set to take them on in the second and last Test match of the series, at the Shere Bangla National Stadium in Dhaka today. However, it seems like the list of Indian players getting injured keeps on getting longer with each passing day. After regular skipper Rohit Sharma and pacer Navdeep Saini were ruled out from the imminent second Test due to injuries, stand-in skipper for the series KL Rahul picked up a hand injury during practice. However, batting coach Vikram Rathour has assured that he will be fine before the Test commences. ALSO READ: Dhaka pitch report 2nd Test It will yet again be a must-win game for India, as they compete with around three other teams for the second spot at present in the World Test Championship (WTC) points table 2021-23, in order to play their second-successive final, this time most probably against Australia. Shere Bangla National Stadium Dhaka Test records Hosts Bangladesh do not boast of a good record at the Shere Bangla National Stadium, Dhaka in the Test format. They have managed to win mere 6 of the 23 Tests at this venue, losing 14, while drawing 3 of them. India, on the other hand, have won both the Tests they have played at this venue in the years 2007 and 2010. Highest run-scorers in the Test format at the Shere Bangla National Stadium in Dhaka are Mushfiqur Rahim (1,500 runs), Shakib Al Hasan (1,467 runs), Tamim Iqbal (1,260), Mominul Haque (892 runs), and Mahmudullah (796 runs). The leading wicket-takers at this venue in the Test format are Shakib Al Hasan (68 wickets), Taijul Islam (54 wickets), Mehidy Hasan Miraz (41 wickets), Zaheer Khan (17 wickets), and Shahadat Hossain (16 wickets). Dhaka Cricket Stadium highest innings totals Score Overs Team Opposition Year 730/6d 187.5 Sri Lanka Bangladesh 2014 610/3d 153 India Bangladesh 2007 560/6d 154 Bangladesh Zimbabwe 2020 557/8d 152 Pakistan Bangladesh 2015 556/10 148.3 Bangladesh West Indies 2012   The post Shere Bangla National Stadium Dhaka Test records: Dhaka Test match records and highest innings totals appeared first on The SportsRush.","pubDate":"2022-12-21 20:30:19","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Hardik Pandya as the captain of the Indian cricket team?","link":"https://thenewsglory.com/hardik-pandya-as-the-captain-of-the-indian-cricket-team/","keywords":["Sports","BCCI","Cricket","Hardik Pandya","Indian team","Rohit Sharma","Virat Kohli"],"creator":["The News Glory"],"video_url":null,"description":"The 2023 Cricket World Cup will be held in India. By then BCCI has started actively trying to prepare a stable 12-14 players. As part of this, it has been reported that Hardik Pandya may be appointed as the white ball captain of the Indian team in the future. Reports have been doing the rounds […]","content":"The 2023 Cricket World Cup will be held in India. By then BCCI has started actively trying to prepare a stable 12-14 players. As part of this, it has been reported that Hardik Pandya may be appointed as the white ball captain of the Indian team in the future. Reports have been doing the rounds recently that the Board of Cricket in India (BCCI) is mulling the idea. Reports suggest that BCCI officials have conveyed the idea to Hardik Pandya, but Hardik has asked for a few days to decide. Speaking to India Today, a BCCI official said, “No decision has been taken to replace Rohit Sharma as captain. But BCCI is thinking of handing over the captaincy of the white ball team to Hardik. The idea has also been discussed with Hardik. But he has asked for a few days’ time. A decisive decision will be taken in this matter even after the formation of the new selection committee,” he said. India’s captaincy was stripped from Virat Kohli and handed over to Rohit Sharma due to their first-round exit in the Dubai T20 World Cup. Rohit Sharma led India in this year’s T20 World Cup in Australia. But India lost to England in the semi-final.","pubDate":"2022-12-21 20:28:38","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes battles through BBC Sports Personality of the Year interview as stomach bug leaves him bed-bound in build-up","link":"https://www.thesun.co.uk/sport/20830690/stokes-bbc-sports-personality-of-the-year/","keywords":["Cricket","Sport","BBC"],"creator":["Kealan Hughes"],"video_url":null,"description":null,"content":"BEN STOKES tuned into BBC Sport’s Personality of the Year from home as he was bedbound due to illness. The England cricket captain returned home this morning following the tour of Pakistan. Ben Stokes is absent from the SPOTY ceremony due to a stomach bug PAThe England cricket captain is one of six nominees for the award[/caption] England won the series 3-0 to round off a very successful year for the Test team. Since Stokes took over as captain England have won nine out of ten tests. He was also part of the England team that won the T20 World Cup in November and scored the winning runs in the final. As a result, Stokes has been nominated for BBC Sport’s Personality of the Year. But he was unable to attend the ceremony due to a stomach bug, according to his wife Clare. Stokes was one of six nominees for the award and finished second in the voting to England Women star Beth Mead. Stokes was well enough to speak to presenter Gary Lineker via a video call and he reflected on the past few months and shared how proud he was with the recent wins. Stokes said: “Managed to land back in the country this morning. It’s been an amazing three months to look back on, seeing the lads on stage brought back some great memories. CASINO SPECIAL – BEST NEW CUSTOMER SIGN UP DEALS “Pakistan was another progression for our test team – to be the only team to whitewash them in Pakistan.” Lineker also asked Stokes about the dramatic T20 final win over Pakistan. In response the 31-year-old said of the win: “For some reason those finals always go down to the wire I loved every moment of those five weeks in Australia.”","pubDate":"2022-12-21 19:58:53","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Bangladesh Tests, a good practice for us before Australia series at home: Rathour","link":"https://kashmirreader.com/2022/12/22/bangladesh-tests-a-good-practice-for-us-before-australia-series-at-home-rathour/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Mirpur: The ongoing two-match Test series against Bangladesh is a perfect preparation for the Indian batters before they take on Australia at home on “similar turning tracks” for the high-profile Border-Gavaskar Trophy, batting coach Vikram Rathour said on Wednesday. India thrashed Bangladesh by 188 runs on a difficult track in Chattogram to lead the series […]","content":"Mirpur: The ongoing two-match Test series against Bangladesh is a perfect preparation for the Indian batters before they take on Australia at home on “similar turning tracks” for the high-profile Border-Gavaskar Trophy, batting coach Vikram Rathour said on Wednesday. India thrashed Bangladesh by 188 runs on a difficult track in Chattogram to lead the series 1-0. On second spot in the World Test Championships standings, India will be keen to complete a clean sweep in Bangladesh before they take on table-toppers Australia in the high-profile four-Test series set to begin in Nagpur on February 9. “You expect wickets to turn in the sub-continent, and after this we will be playing an important series against Australia where wickets are expected to turn,” Rathour said on the eve of the second and final Test here. “So it’s good practice for us. It will be good preparation for Indian batters. We are not discussing anything tactically but looking forward to playing good cricket.” The Indian batters came good in the opening Test with young opener Shubman Gill cracking his maiden century in the longest format and veteran Cheteshwar Pujara scoring a 130-ball 102 not out in the second innings, his 19th Test century after almost 4 years. Stand-in skipper KL Rahul, however, found the going tough as he was dismissed for 22 and 23, while Virat Kohli was removed by left-arm spinner Taijul Islam with a beauty in the first innings in Chattogram. The former India captain was unbeaten on 19 in the second essay. Rathour, who had a long session with Rahul and Kohli hoped the two batters will come good in the second Test. Asked what was he discussing with Rahul, the batting coach said: “I’m not going to get into those discussions, these discussions keep happening, a few things he was looking at and there’s nothing to be concerned about. He was just working on something. “We are looking forward to both of them scoring runs. Hoping to see big innings from both of them from this match.” Kohli has recently ended his long wait for an international century, first getting to the mark in the T20Is against Afghanistan and then in the ODIs against Bangladesh. Kohli is now due for a Test century which he last scored against Bangladesh in their first Day/Night Test at Eden Gardens, Kolkata in 2019. KL Rahul suffers hand injury; “not serious”, says coach Rahul got hit on his thumb while taking throwdowns from Rathour but the batting coach said it was not serious and he “seemed fine”. The India opener was seen applying ice-packs. “Doctors are looking after him, he seems to be fine,” Rathour said. ‘Wicket to offer more bounce and turn’ Asked about the wicket, Rathour said: “We’re expecting this one to have a bit more bounce and turn than the previous one. We look to play according to the situation. “We are fine whatever wicket we get. We have absolutely no issues from our side. However it plays, we have to put up as many runs as we can and put up a good score if we bat first.” Rathour said the wicket in Chattogram was tough. “We batted well definitely, but we bowled really well. It was a tough surface to get 20 wickets– slow and low, especially in the second innings.” —PTI Bangladesh Tests, a good practice for us before Australia series at home: Rathour added by Press Trust of India on 12:26 am December 22, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-21 18:56:04","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"It would be great if Rehan is picked in IPL auction: McCullum","link":"https://kashmirreader.com/2022/12/22/it-would-be-great-if-rehan-is-picked-in-ipl-auction-mccullum/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"KARACHI: England red-ball coach Brendon McCullum says it would be “awesome” if leg-spinner Rehan Ahmed bags an IPL deal following his stellar Test debut and he would want the the teenager to play as much franchise cricket as possible. The 18-year-old Ahmed became the youngest to take a five wicket haul on Test debut as […]","content":"KARACHI: England red-ball coach Brendon McCullum says it would be “awesome” if leg-spinner Rehan Ahmed bags an IPL deal following his stellar Test debut and he would want the the teenager to play as much franchise cricket as possible. The 18-year-old Ahmed became the youngest to take a five wicket haul on Test debut as he claimed the impressive figures of (5/48) against Pakistan on day three in the third Test here. Ahmed, who already has a deal to play in the inaugural ILT20 in the UAE in January and February, has entered the IPL auction, to be held in Kochi on Friday, with a base price of Rs 40 lakh. “It would be great if he got picked up at the IPL. It would be awesome if he did,” McCullum told BBC’s Test Match Special on Tuesday. “Why not give him that opportunity to rub shoulders with other players and pick up those experiences? What other 18-year-old is going to get those chances? “He’s a fully fledged international cricketer.” McCullum, who played in the first 11 IPL seasons before coaching Kolkata Knight Riders, said he’ll encourage the youngster to play franchise cricket. “The important thing now is that we continue to look after him,” the former New Zealand skipper said. “I’ll encourage him to play as much franchise cricket and get as many experiences around the globe and play with different players, under different coaches and in different conditions.” —PTI It would be great if Rehan is picked in IPL auction: McCullum added by Press Trust of India on 12:25 am December 22, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-21 18:55:57","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"After a month of football madness, let's return to cricket","link":"https://economictimes.indiatimes.com/news/sports/after-a-month-of-football-madness-lets-return-to-cricket/articleshow/96407366.cms","keywords":null,"creator":null,"video_url":null,"description":"There is a Test starting today, the second of the two-match series between India and Bangladesh, and it’s crucial for India’s chances of qualifying for the World Test Championship final for the second consecutive time. And the next two months are going to be quite busy for the Indian team.","content":"Synopsis There is a Test starting today, the second of the two-match series between India and Bangladesh, and it’s crucial for India’s chances of qualifying for the World Test Championship final for the second consecutive time. And the next two months are going to be quite busy for the Indian team. ET Bureau Attention please! Normal services resume from today. After a month of binge watching football and supporting countries we have no connection with, it’s time to get back to our old lives where cricket dominates the news headlines and rules the office water-cooler conversations. There is a Test starting today, the second of the two-match series between India and Bangladesh , and it’s crucial for India’s chances of qualifying for the World Test Championship final for the second consecutive time. And the next two months are going to be quite busy for the Indian team. Some of you may be feeling a little out of sync at the moment. But don’t worry and read on. Just to give you a little background, since India’s T20 World Cup semi-final exit, a week before the Fifa World Cup started, India have played three T20Is and ODIs each in New Zealand and three ODIs and one Test in Bangladesh. In New Zealand, India won the T20 series 1-0 and lost the ODI series 1-0. In Bangladesh, they lost the ODI series 2-1. India won the first Test against Bangladesh comfortably by 188 runs. They experienced a few hiccups on the way – understandable since it was their first Test match since July – but admirably managed to get the better of their stubborn hosts on the fifth day. Now that you are abreast of what’s been happening with your beloved Men in Blue, let’s take a look at what awaits them immediately after the Bangladesh series. The second Test against Bangladesh is going to be India’s last match this year. The next year, the year of the ODI World Cup , will begin with whiteball series – 3 T20Is and 3 ODIs – against Sri Lanka from Jan 3 to 15. It’ll be followed by another twoformat white-ball series against New Zealand from Jan 18 to Feb 1. Four Tests and three ODIs against Australia from February 9 to March 22 will be India’s last international engagement before they take a break for the Indian Premier League. In the coming months, India’s focus is going to be on the WTC final and the ODI World Cup, to be played at home in October-November. Hope, this helps in recovering from football induced amnesia. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Wednesday, 21 Dec, 2022 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics ET Markets Smart Investing More Country has Set Shining Example with UPI, Aadhaar & India Stack Concerned by some aspects of CCI rulings against Google, says Pichai to ET in an exclusive interview. Tata Moves HC on ₹1,500cr GST Claim The salt-to-software Tata Group has approached the Bombay High Court to contest a ₹1,500-crore goods and services tax (GST) claim pertaining to its 2017 settlement of a dispute with NTT Docomo, sources aware of the development told ET. SpiceJet Looks to Settle Dues of Aircraft Lessors SpiceJet has proposed to settle the dues of aircraft leasing companies by turning them into potential investors from creditors, according to people aware of the discussions. Read More News on bangladesh world test championship fifa world cup wtc odi world cup india new zealand (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Recent hit Deep value investing: How a big basket of low PE stocks can help mitigate risk 6 mins read 3 insights to kick-start your day, featuring government on moonlighting 3 mins read Investing Why China’s index-fund boom has been worrying investors 8 mins read Subscribe to ETPrime","pubDate":"2022-12-21 18:52:55","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-56976,resizemode-4,msid-96407366/after-a-month-of-football-madness-lets-return-to-cricket.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Ramiz Raja Set To Be Removed As Pakistan Cricket Board Chairman: Report","link":"https://sports.ndtv.com/cricket/ramiz-raja-set-to-be-removed-as-pakistan-cricket-board-chairman-report-3627685","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Several media reports also claimed that Ramiz Raja, who became the PCB chairman in September 2021, has either been sacked or will be sacked soon","content":null,"pubDate":"2022-12-21 18:38:07","image_url":"https://c.ndtvimg.com/2022-10/uv68jopo_ramiz-raja_625x300_04_October_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Ramiz Raja removed as Pakistan Cricket Board chairman","link":"https://thenewsmill.com/2022/12/ramiz-raja-removed-as-pakistan-cricket-board-chairman/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Ramiz Raja has been removed from the post of chairman of Pakistan Cricket Board (PCB), reported ESPNCricinfo on Wednesday. The current board has been dissolved. Prime Minister Shehbaz Sharif, who is also the patron of the board has nominated a 13-member committee to take the Pakistan Cricket forward. Former PCB chief Najam Sethi will return as head of a committee that will also include former Pakistan skippers Shahid Afridi and Sana Mir. Pakistan have lost the Test series 0-3 against England. Under his tenure, Pakistan team got two high-profile tours from Australia and England. It reached in semifinal of 2021 T20 World Cup and final of 2022 edition of the tournament. It also reached the final of Asia Cup. (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2022-12-21 18:31:17","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"AJM vs EMB Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats and Pitch Report for Emirates D20 2022, Match 21","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ajm-vs-emb-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-emirates-d20-2022-match-21?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-12-21 18:03:58","image_url":"https://static.sportskeeda.com/editor/2022/12/cd66e-16716260577898-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"The Barmy Army drank the bar dry in 30 minutes: Life on tour in Pakistan - The Telegraph","link":"https://news.google.com/__i/rss/rd/articles/CBMiTmh0dHBzOi8vd3d3LnRlbGVncmFwaC5jby51ay9jcmlja2V0LzIwMjIvMTIvMjEvd2hhdC1yZWFsbHktbGlrZS10b3VyLXBha2lzdGFuL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"The Barmy Army drank the bar dry in 30 minutes: Life on tour in Pakistan  The TelegraphEngland’s bowlers have cast a spell in Pakistan without a magician  The GuardianEngland's vibes of revival land their greatest glory yet  ESPNcricinfo'To get Babar Azam out is a dream come true,' says England's Rehan Ahmed  Geo NewsCan England take their swashbuckling approach to cricket into the Ashes?  Oxford MailView Full coverage on Google News","content":null,"pubDate":"2022-12-21 18:01:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Will Australia come to the Bazball?","link":"https://www.watoday.com.au/sport/cricket/will-australia-come-to-the-bazball-20221221-p5c84i.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Greg Baum"],"video_url":null,"description":"England have startled the sporting world with their cavalier cricket under coach Brendon McCullum and captain Ben Stokes. How will Australia react in next year’s Ashes?","content":"In junk time at the end of net sessions long ago, you could sometimes see right-handed batsmen facing up as lefties and right-arm bowlers competently delivering the other way around. I once saw a renowned Sheffield Shield tailender face up with a stump and middle every ball. Big-time cricketers were like recreational cyclists, with 27 gears at their disposal, but using only six or seven. In first-class cricket, orthodoxy prevailed. At just 18, debutant England spinner Rehan Ahmed takes a wicket in Multan. Credit: Getty Images “V” was the sector of the ground between extra cover and mid-wicket in which batsmen must play, not shorthand for victory that was days away, and improbable anyway. A departure from the textbook that did not work would mean repenting for days, sometimes a lifetime. One-day and T20 cricket changed the risk-reward ratio, but in Test cricket mavericks came along only every decade or so: think Ian Botham, Adam Gilchrist and late-career Brendon McCullum. Now McCullum is coach of England and Ben Stokes is captain, and together they are fomenting a revolution in Test cricket by bringing to it a limited-overs mindset. England are daring to think of what they can do, and not what they daren’t. They’re trying all those unused gears. They’re out to entertain. Draw(er)s are for socks. The results have been startling. The team that was so abject here last summer under Joe Root and lost to the West Indies as recently as March suddenly have won nine of their past 10 Tests. The one defeat, to South Africa, was by an innings; no half-measures here. They promptly redressed it with an innings victory over the same opponent. The architects of Bazball: England captain Ben Stokes and coach Brendan McCullum. Credit: Getty This cavalier England outfit belts along at seven an over in first innings and happily hare after 400 in fourth innings. If anything, they prefer to chase. Alternatively, they set opponents reachable targets, daring them to dare. Instead of a nightwatchman, they have a “nighthawk”, tasked to make as many as he can in as little time as possible. In Pakistan, Root faced up left-handed in one match and a spinner opened the bowling in another. England picked a T20 player, Harry Brook, in the middle order and he promptly made three centuries. They picked an 18-year-old leg-spinner, Rehan Ahmed, and he promptly took seven wickets. On a flat pitch in Rawalpindi, they went with a counterintuitive bumper barrage.","pubDate":"2022-12-21 18:00:00","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"Beth Mead poses with crutches on the red carpet as glamorous athletes arrive for BBC Sports Personality of the Year","link":"https://www.thesun.co.uk/sport/20829421/athletes-red-carpet-bbc-sports-personality-year/","keywords":["Sport","BBC","BBC ONE"],"creator":["Joshua Jones"],"video_url":null,"description":null,"content":"BETH MEAD stunned on the red carpet before being crowned Sports Personality of the Year – despite needing the help of crutches. As the great and the good of the sporting world descended on MediaCity to celebrate Britain’s achievements in 2022, it was pre-vote favourite Mead who rocked a green blazer and trouser combination. ©Karwai TangEngland football hero Beth Mead headed to the awards night on crutches[/caption] GettySnowboard star Aimee Fuller was in attendance at Sports Personality of the Year[/caption] PAAndrea Spendolini-Sirieix – daughter of Fred Sirieix – has made a career of her own in diving[/caption] PASam Curran and partner Isabella Symonds Willmott were in party mood after the T20 World Cup heroics[/caption] PAEngland white-ball captain Jos Buttler arrived with wife Louise[/caption] PADenise Lewis went for a purple outfit on the red carpet[/caption] PA2012 runner-up Jessica Ennis-Hill rocked a light blue dress for SPOTY 2022[/caption] PAGymnast twins Jennifer and Jessica Gadirova arrived together[/caption] GettyAlex Scott was in a joyful mood ahead of her big night of presenting[/caption] PAMMA star Paddy Pimblett was flanked by partner Laura Gregory[/caption] The Arsenal and England ace is currently on crutches after rupturing her ACL last month – just like team-mate and partner Vivianne Miedema. Jill Scott and Ellen White were among the members of the Euros-winning England team in attendance as they supported their pal who came out on top in the public vote. Ahead of the BBC’s showcase celebration, the celebrities strutted their stuff upon arrival. That included the likes of snowboarder Aimee Fuller, Olympic legend Jessica Ennis-Hill, candidate Eve Muirhead and diver Andrea Spendolini-Sirieix – daughter of First Dates legend Fred Sirieix. Fellow nominee Jessica Gadirova was flanked by her twin sister Jennifer. Ricky Hatton, Max Whitlock, Stephen Hendry, Rebecca Adlington and Paddy Pimblett were among the first to arrive. Cricket World Cup winners Sam Curran and skipper Jos Buttler headed along with their partners with Chris Woakes also present. And rounding off the prestigious group of athletes past and present were the Beeb’s four hosts – Alex Scott, Gary Lineker, Gabby Logan and Clare Balding. Six nominees are hoping to land the coveted annual prize, succeeding Emma Raducanu who won the gong 12 months ago. Mead is the odds-on favourite after helping England win the Euros. CASINO SPECIAL – BEST NEW CUSTOMER SIGN UP DEALS The Arsenal forward’s six goals and five assists saw her scoop both the Golden Boot and Player of the Tournament awards. Gymnast Jessica Gadirova, curling’s Muirhead, snooker star Ronnie O’Sullivan, England cricket ace Ben Stokes, and athlete Jake Wightman make up the rest of the elite list. But golfer Matt Fitzpatrick was controversially overlooked, despite his US Open triumph earlier this year. The ceremony was pushed back a few days from its usual slot on the Sunday evening before Christmas by the World Cup final. Fans can watch the 69th year of SPOTY – hosted by Gary Lineker, Clare Balding, Gabby Logan and Alex Scott – on BBC One and BBC iPlayer from 6.45pm. GettyGary Lineker, Gabby Logan, Clare Balding and Scott will host the night[/caption] GettyEllen White retired from football after winning the Euros[/caption] GettyJill Scott did the same and then became Queen of the Jungle[/caption] GettyArsenal striker Vivianne Miedema is also on crutches at the moment[/caption] PAFormer rugby league star Rob Burrows was joined by his family[/caption] Boxer Ricky Hatton popped along to the event in his hometownRex PAEve Muirhead is one of the six nominees after her curling exploits[/caption] PAGymnast Max Whitlock and wife Leah Hickton pose on the red carpet[/caption] PASwimmer Ellie Simmonds opted for a dark green number[/caption] PAChris Hoy won the event in 2008 following his cycling exploits in Beijing[/caption] PAStephen Hendry the former snooker star opted for a more casual look[/caption]","pubDate":"2022-12-21 17:40:49","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"BBC Sports Personality of the Year 2022 nominations revealed including huge clear favourite and bizarre snub","link":"https://www.thesun.co.uk/sport/20810519/sports-personality-of-the-year-2022-nominees-revealed/","keywords":["Sport","BBC","Football"],"creator":["Giacomo Pisa"],"video_url":null,"description":null,"content":"THE shortlist for BBC’s Sports Personality of the Year award has been confirmed. Six nominees have been revealed ahead of the ceremony on Wednesday evening. Lioness Beth Mead is the huge favourite for the awardPA https://www.bbc.co.uk/sport/sports-personality/63887059Mead is one of six nominees up for the prize[/caption] ReutersBen Stokes, who won Sports Personality of the Year in 2019, has been nominated for the award again[/caption] PATeenage gymnast Jessica Gadirova won floor gold at the World Gymnastics Championships[/caption] England women’s footballer Beth Mead is a huge favourite. The other contenders are gymnast Jessica Gadirova, curling’s Eve Muirhead, snooker star Ronnie O’Sullivan, England cricket ace Ben Stokes, and athlete Jake Wightman. Golfer Matt Fitzpatrick has been overlooked, despite his US Open triumph earlier this year. The annual BBC show celebrates the last 12 months of sporting achievements, with the winner to be decided by a public vote. England and Arsenal ace Mead, 27, is a clear frontrunner after helping the Lionesses to Euros glory in the summer. Mead’s six goals and five assists saw her scoop both the Golden Boot and Player of the Tournament awards. Meanwhile Gadirova, 18, won three medals at the World Championships for Team GB, including floor exercise gold. She also won floor gold at the European Championships and is on the shortlist for Young Sports Personality, as well as the main prize. Muirhead, 32, led Team GB’s women’s curlers to gold at the Winter Olympics in Beijing. And cricket ace Stokes, 31, helped England’s men win the T20 World Cup with a sublime knock of 52 not out in the final. The 2019 SPOTY winner was also named Test captain in 2022, and led England to nine wins in their last 10 matches. Snooker legend O’Sullivan, 47, registered his seventh World Championship title back in May, and in doing so became the oldest world champion in Crucible history. He also equalled Stephen Hendry’s modern era record of seven world titles. Finally Wightman, 28, landed 1500m gold at the World Championships. The Scot was called home on the final straight by his commentator dad. He became the first 1500m world champion from the UK since Steve Cram 39 years ago with a stunning last 200m surge. But Fitzpatrick, 28, is not on the shortlist despite his US Open victory at Brookline in June. The Sheffield-born star became the first British winner of a men’s golf major since Danny Willett at the 2016 Masters. PAEve Muirhead helped Team GB’s women’s curlers to Winter Olympics glory[/caption] PAJake Wightman won 1500m gold for Team GB at the World Championships[/caption] PARonnie O’Sullivan won his seventh snooker World Championship in May[/caption] Golfer Matt Fitzpatrick has not been nominated, despite his US Open successGetty","pubDate":"2022-12-21 17:05:00","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"पाकिस्तान क्रिकेट में मचा हाहाकार, रमीज के बाद अब कोच और कप्तान की विदाई भी तय","link":"https://www.indiatv.in/sports/cricket/pakistan-coach-saqlain-mushtaq-and-babar-azam-test-captaincy-in-danger-claims-pcb-sources-2022-12-21-914136","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Cricket: रमीज राजा के पाकिस्तान क्रिकेट टीम के अध्यक्ष पद की कुर्सी से हटने की अटकलों के बीच अब कोच सकलैन मुश्ताक और बाबर की कप्तानी पर भी खतरा।","content":"पाकिस्तान क्रिकेट टीम में आने वाले समय बड़े स्तर पर फेरबदल होने के संकेत मिल रहे है। इंग्लैंड के हाथों टेस्ट सीरीज में क्लीन स्वीप होने और घर में लगातार चार टेस्ट मैच गंवाने के बाद अब पाकिस्तान क्रिकेट टीम और उसके टॉप मैनेजमेंट पर सवाल उठने शुरू हो गए हैं। पाकिस्तान क्रिकेट बोर्ड (पीसीबी) के अध्यक्ष और पूर्व क्रिकेटर रमीज राजा की छुट्टी को लेकर अटकलें तेज हैं तो वहीं अब कोच सकलैन मुश्ताक और कप्तान बाबर आजम की विदाई की चर्चा भी शुरू हो चुकी है। पीसीबी सूत्रों के मुताबिक पाकिस्तान के मुख्य कोच सकलेन मुश्ताक स्वदेश में इंग्लैंड के खिलाफ टेस्ट श्रृंखला में टीम के लचर प्रदर्शन के बाद मुख्य कोच का पद छोड़ सकते हैं, तो वहीं कप्तान बाबर आजम की अगले साल जुलाई में खेल के सबसे लंबे प्रारूप की कप्तानी से छुट्टी हो सकती है। पाकिस्तान क्रिकेट बोर्ड के एक करीबी सूत्र ने बुधवार को समाचार एजेंसी पीटीआई को बताया कि पूर्व ऑफ स्पिनर सकलेन न्यूजीलैंड के खिलाफ कराची में 26 दिसंबर से शुरू हो रही घरेलू टेस्ट श्रृंखला के बाद पद छोड़ सकते हैं। सूत्र ने बताया कि मंगलवार को कराची में तीसरे टेस्ट में हार के तुरंत बाद बाबर और सकलेन लाहौर रवाना हो गए और गद्दाफी स्टेडियम में पीसीबी अध्यक्ष रमीज राजा के कार्यालय में हुई उच्च स्तरीय बैठक में शामिल हुए। इसमें मुख्य चयनकर्ता मोहम्मद वसीम ने भी हिस्सा लिया। इस दौरान बाबर, सकलेन और वसीम ने राजा को बताया कि आखिर क्यों पाकिस्तान ने टेस्ट श्रृंखला 0-3 से गंवाई। सूत्र के मुताबिक लगभग तीन घंटे चली बैठक में टीम, चयन मामलों, कप्तानी और सकलेन की भूमिका के प्रत्येक पहलू पर चर्चा की गई। उन्होंने कहा कि चयनकर्ताओं को मंगलवार को कराची टेस्ट खत्म होने के बाद न्यूजीलैंड के खिलाफ दो टेस्ट की श्रृंखला के लिए टीम की घोषणा करनी थी लेकिन राजा के निर्देश पर घोषणा को बुधवार तक टाल दिया गया। सूत्र ने कहा कि राजा ने बाबर, सकलेन और वसीम को अपना नजरिया बताया और स्पष्ट किया कि वे श्रृंखला के लिए चयन से खुश नहीं थे। बाबर ने अध्यक्ष से कहा कि तीन मुख्य तेज गेंदबाजों शाहीन अफरीदी, हारिस राउफ और नसीम शाह की चोट के कारण उनकी योजनाओं को नुकसान पहुंचा और गेंदबाजी काफी कमजोर हुई जिससे इंग्लैंड के बल्लेबाज आसानी से रन बना पाए। सूत्र ने बताया कि बाबर ने राजा से कहा कि अभी पाकिस्तान के पास ऑस्ट्रेलिया, इंग्लैंड और न्यूजीलैंड जैसी टीमों के खिलाफ खेलने के लिए अनुभवी और स्तरीय खिलाड़ी नहीं हैं। वहीं सकलेन ने राजा को पुष्टि की कि पूर्व के फैसले के अनुसार वह जनवरी में न्यूजीलैंड के खिलाफ श्रृंखला खत्म होने के बाद मुख्य कोच का पद छोड़ देंगे और पीसीबी को नए कोच की तलाश शुरू कर देनी चाहिए। सूत्र ने अनुसार बोर्ड को लगता है कि बाबर को सिर्फ सीमित ओवरों की टीम की कप्तानी करनी चाहिए और टेस्ट प्रारूप की कप्तानी संभवत: शान मसूद या मोहम्मद रिजवान को सौंपी जानी चाहिए। पीसीबी के इस सूत्र की मानें तो सर्वसम्मति से फैसला किया गया कि अब और जुलाई के बीच में बाबर को टेस्ट कप्तानी से हटाना सही नहीं होगा क्योंकि इससे टीम का मनोबल टूटेगा और कप्तान की फॉर्म भी प्रभावित होगी। लेकिन फैसला किया गया कि जुलाई में बाबर को टेस्ट कप्तान के रूप में बदल दिया जाएगा।","pubDate":"2022-12-21 16:06:55","image_url":null,"source_id":"indiatv","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IPL 2023 Auction | Five most in-demand foreign players","link":"https://thenewsglory.com/ipl-2023-auction-five-most-in-demand-foreign-players/","keywords":["Sports","Auction","Cricket","game","India","IPL","ipl 2023","ipl auction","online special"],"creator":["The News Glory"],"video_url":null,"description":"Last Updated : 21 Dec, 2022 08:15 PM Published : 21 Dec 2022 08:15 PM Last Updated : 21 Dec 2022 08:15 PM The mini auction for the upcoming IPL season will be held in Kochi, Kerala on Friday. In this context let’s take a look at the top 5 foreign players who are in […]","content":"Last Updated : 21 Dec, 2022 08:15 PM Published : 21 Dec 2022 08:15 PM Last Updated : 21 Dec 2022 08:15 PM The mini auction for the upcoming IPL season will be held in Kochi, Kerala on Friday. In this context let’s take a look at the top 5 foreign players who are in high demand in this mini auction. In this auction, all 10 IPL teams can use up to Rs 5 crore in addition to their own funds. A maximum of 87 players are likely to be auctioned. There are 407 players in the race for that. However, it seems that the all-rounders will be in high demand among the teams in the auction this time around. The tactical substitutes are going to see the field from the upcoming season. Cameron Green: 23 year old Australian player. His base price in the auction is Rs 2 crore. A quality all-rounder who mixes in both batting and bowling. He played well in the T20 series held in India last September. His strike rate in international T20 cricket is 173.75. Ben Stokes: He needs no introduction. His name is the address. The all-rounder has been leading the England team in Test cricket in an action-packed manner. He plays well in tight matches. For example, the 2019 ODI World Cup and the recent T20 World Cup final. He was a top class performer in both. Has good strike rate and bowling economy. Sam Curran: The left-arm fast bowler is an all-rounder. He mainly played for the Chennai Super Kings team in the IPL arena. He is good at taking the ball outside the boundary line. Amazing bowler. He bowled well in the recent T20 World Cup series. With that, he took a total of 13 wickets. His base price is Rs.2 crore. He has played 32 IPL matches. Harry Brooke: Another player from England. The 23-year-old is in standard form. He scored three centuries in the Test match against Pakistan. His base price is Rs.1.5 crore. He played well in the Pakistan Super League series. He scored a century in 48 balls. A batsman who fits perfectly in the middle order. Shakib Al Hasan: Bangladesh player He has experience of playing IPL cricket. He has played a total of 71 IPL matches. His left-arm spin is a bit difficult to tackle. His base price is Rs.1.5 crore. He played for Kolkata last season. Don’t miss out!","pubDate":"2022-12-21 15:22:41","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Kachchi slams century against Meghalaya in U-16 Vijay Merchant Trophy","link":"https://telanganatoday.com/kachchi-slams-century-against-meghalaya-in-u-16-vijay-merchant-trophy","keywords":["News","Sport","BCCI","Hyderabad","Meghalaya","Vijay Merchant Trophy"],"creator":["Telangana Today"],"video_url":null,"description":"Wafi Kachchi slammed 107 but Daulabiang scalped five wickets for 91 as Hyderabad were all out for 300 runs in 82.2 overs on the opening day of the BCCI Junior Men’s Under-16 Vijay Merchant Trophy","content":"Home | Sport | Kachchi Slams Century Against Meghalaya In U 16 Vijay Merchant Trophy Kachchi slams century against Meghalaya in U-16 Vijay Merchant Trophy Wafi Kachchi slammed 107 but Daulabiang scalped five wickets for 91 as Hyderabad were all out for 300 runs in 82.2 overs on the opening day of the BCCI Junior Men’s Under-16 Vijay Merchant Trophy By Telangana Today Published Date - 08:40 PM, Wed - 21 December 22 Wafi Kachchi slammed 107 but Daulabiang scalped five wickets for 91 as Hyderabad were all out for 300 runs in 82.2 overs on the opening day of the BCCI Junior Men’s Under-16 Vijay Merchant Trophy Hyderabad: Wafi Kachchi slammed 107 but Daulabiang scalped five wickets for 91 as Hyderabad were all out for 300 runs in 82.2 overs on the opening day of the BCCI Junior Men’s Under-16 Vijay Merchant Trophy in Vadodara on Wednesday. In reply, Meghalaya ended the day at 13/1. Also Read Ranji trophy: Mumbai tighten grip over Hyderabad Brief Scores: Hyderabad CA 300 in 82.2 overs (Wafi Kachchhi 107; Daulabiang 5/91, G J Thakuria 3/79) vs Meghalaya CA 13/1 in 5 overs HCA A3 Division One-Day League in Hyderabad: Brief Scores: Cosmos 73 in 21.2 overs (Sohan 3/13) lost to Consult 77/1 in 12.2 overs; Dhruv XI 223/8 in 40 overs (Prudhvishwar 70, Abhinav Goud 69) bt M L Jaisimha 183/8 in 40 overs (Snehodeep 56; Tarun 3/25); Tarakarama 70 in 28.5 overs (Dipak Pathak 4/13) lost to Team Kun 72/2 in 14.3 overs; Redhills 172 in 33 overs (Rangaswamy 3/32) bt Southend Raymonds 128 in 27.2 overs (Kapil Prajapathi 60; Khaleel Khan Ghori 4/15); Raju Cricket Centre 106 in 27.4 overs (Varun Raj 3/25, C G LOkesh Singh 3/23) lost to Roshanara 107/3 in 16.5 overs; All Saints 58 in 21.2 overs (Rajasekhar 5/6) lost to MP Sporting 60/1 in 8.4 overs. Follow Us : Tags BCCI Hyderabad Meghalaya Vijay Merchant Trophy Related News CM KCR attends Christmas celebrations in Hyderabad; asks to spread message of kindness Workshop on ‘Building Child Friendly Cities in Telangana’ organized Sibling entrepreneur duo from Hyderabad launch women-only bike taxi service ‘Dovely’ Ranji trophy: Mumbai tighten grip over Hyderabad Ram Charan, cousin Allu Arjun come together for star-studded Xmas party Four kidney transplants in 24-hours at NIMS","pubDate":"2022-12-21 15:10:12","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"PCB threatens to boycott 50-over World Cup in India to exert pressure","link":"https://www.orissapost.com/pcb-threatened-to-boycott-50-over-world-cup-in-india-to-exert-pressure/","keywords":["Sports","ICC","Pakistan Cricket Board","pcb","world cup"],"creator":["Post News Network"],"video_url":null,"description":"Karachi: Pakistan Cricket Board (PCB) has told the ICC officials that it had threatened to boycott next year’s 50-over World Cup in India to exert pressure on the neighbouring country to send its team for the Asia Cup, according to sources. The hosting rights of the 2023 edition of the 50-over Asia Cup has been […]","content":"PCB threatens to boycott 50-over World Cup in India to exert pressure PTI Updated: December 21st, 2022, 20:38 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Karachi: Pakistan Cricket Board (PCB) has told the ICC officials that it had threatened to boycott next year’s 50-over World Cup in India to exert pressure on the neighbouring country to send its team for the Asia Cup, according to sources. The hosting rights of the 2023 edition of the 50-over Asia Cup has been awarded to Pakistan by the Asian Cricket Council (ACC) as a pre-cursor to the marquee World Cup in India (October-November 2023). In October, ACC president and BCCI secretary Jay Shah had said that India will not travel to Pakistan next year for the 50-over Asia Cup — likely to be held in September 2023 — after which the PCB had threatened to pull out of the World Cup. But, it is learned that the PCB chairman Ramiz Raja has told the International Cricket Council officials that the Board has not made any decision not to send its team to India for the 50-over World Cup. The ICC officials, including chief executive officer Geoff Allardice, were in Pakistan as guests to watch the home Test series against England. “Ramiz assured the ICC officials that PCB had made no decision on not sending its team to India for the World Cup nor was it in favour of boycotting such a mega event but because of the strained cricket relations between the two countries, the PCB had to exert pressure to get the Indian board to send its team for Asia Cup,” a source aware of the development told PTI. The source said the ICC officials conveyed to Ramiz their concerns regarding his statements about Pakistan not playing in next year’s World Cup in India if the Indian team does not participate in the Asia Cup. According to the source, Ramiz also told the ICC officials that the PCB would not accept the 2025 Champions Trophy being moved from the country on the pretext that India may not travel to Pakistan. “Ramiz was very clear that Pakistan will not be receptive to the tournament being moved anywhere else because of India as it had already started heavy investment on building or renovating infrastructure for the ICC event,” the source said. “Ramiz reminded the ICC officials that the executive board which included India had given hosting rights of the Champions Trophy to Pakistan, so there should be no confusion as to where the tournament will be held on schedule.” India hasn’t travelled to Pakistan since the 2008 Asia Cup, and after the Mumbai terrorist attack November 26 that year, the scheduled bilateral series in early 2009 was cancelled. Pakistan did travel to India for a short six-match white-ball series in 2012, but in the last 10 years, there hasn’t been any bilateral cricket. The two teams have only played each other at various ICC and ACC events. Tags: ICC Pakistan Cricket Board pcb world cup Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Babar Azam might lose Test captaincy in July: PCB sources December 21, 2022 Axar Patel surges to career-best ICC Test ranking, Kuldeep jumps 19 spots December 21, 2022 IPL 2023 auction: KKR need some pace support, Shardul, Lockie good options, says Sanjay Manjrekar December 21, 2022 Over 2L litres of fresh drinking water ‘made from air’ will be produced during FIH Odisha Hockey WC December 20, 2022 Rohit Sharma ruled out of second Test against Bangladesh December 20, 2022 England completes memorable 3-0 series sweep in Pakistan December 20, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-12-21 15:08:31","image_url":"https://www.orissapost.com/wp-content/uploads/2020/04/pcb-1-300x181.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji trophy: Mumbai tighten grip over Hyderabad","link":"https://telanganatoday.com/ranji-trophy-mumbai-tighten-grip-over-hyderabad","keywords":["News","Sport","Ajinkya Rahane","Hyderabad","Ranji Trophy"],"creator":["Telangana Today"],"video_url":null,"description":"Rahane slams double ton, Mulani scalps five wickets to put hosts in strong position in Ranji Trophy match","content":"Home | Sport | Ranji Trophy Mumbai Tighten Grip Over Hyderabad Ranji trophy: Mumbai tighten grip over Hyderabad Rahane slams double ton, Mulani scalps five wickets to put hosts in strong position in Ranji Trophy match By Telangana Today Published Date - 08:36 PM, Wed - 21 December 22 Rahane slams double ton, Mulani scalps five wickets to put hosts in strong position in Ranji Trophy match Hyderabad: Overnight batters Ajinkya Rahane and Sarfaraz Khan continued their domination scoring double century and century respectively, while Shams Mulani scalped five wickets to put Mumbai in a strong position on the second day of the Group B Ranji Trophy match at the Sharad Pawar Cricket Academy in Mumbai on Wednesday. Captain Rahane, who resumed the innings at 139, made merry with the listless Hyderabad bowling attack slamming 204 (261 balls; 26×4, 3×6) while Sarfaraz, beginning the day at 40, remained unbeaten on 126 (161 balls; 18×4) as Mumbai declared their innings at 651/6 in 127.2 overs. Mumbai’s left-arm spinner Shams Mulani ran through Hyderabad batting order with 5/76 bowling figures as the visitors ended the day at 173/6, with 478 runs still behind. Earlier in the day, Rahane and Sarfaraz added 196 runs for the fourth wicket before the captain departed after reaching his double century. Tanay Thyagarajan cleaned the Indian cricketer. Kartikiya Kak then accounted for Tardik Tamore and Shams Mulani forcing Rahane to declare their essay. In reply, Hyderabad lost comeback man and former captain P Akshath Reddy (12) in the eighth over. He was trapped in front of the wickets by Mulani. Captain Tanmay and Rohit Rayudu (72 batting) added 51 runs before Tanmay too departed to Mulani. First-match centurion Mickil Jaiswal, T Ravi Teja and Rahul Buddhi and Prateek Reddy, all were back in the pavilion. At stumps, Tanay and Rohit Rayudu were at the crease with a huge deficit. Follow Us : Tags Ajinkya Rahane Hyderabad Ranji Trophy Related News CM KCR attends Christmas celebrations in Hyderabad; asks to spread message of kindness Workshop on ‘Building Child Friendly Cities in Telangana’ organized Sibling entrepreneur duo from Hyderabad launch women-only bike taxi service ‘Dovely’ Kachchi slams century against Meghalaya in U-16 Vijay Merchant Trophy Twitter abuzz as Ajinky Rahane hits double ton in Ranji Trophy match Ram Charan, cousin Allu Arjun come together for star-studded Xmas party","pubDate":"2022-12-21 15:06:33","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Head coach Saqlain could step down; Babar might lose Test captaincy in July: PCB sources","link":"https://economictimes.indiatimes.com/news/sports/head-coach-saqlain-could-step-down-babar-might-lose-test-captaincy-in-july-pcb-sources/articleshow/96404258.cms","keywords":null,"creator":null,"video_url":null,"description":"A source close to the Pakistan Cricket Board (PCB) told PTI on Wednesday that the former off-spinner could leave after the home series against New Zealand, beginning with the Test in Karachi on December 26.","content":"Synopsis A source close to the Pakistan Cricket Board (PCB) told PTI on Wednesday that the former off-spinner could leave after the home series against New Zealand, beginning with the Test in Karachi on December 26. (AP Photo) Pakistan head coach Saqlain Mushtaq could step down following the team's Test debacle against England at home, with sources also saying that Babar Azam might also lose his captaincy in the longest format by July next year. A source close to the Pakistan Cricket Board ( PCB ) told PTI on Wednesday that the former off-spinner could leave after the home series against New Zealand, beginning with the Test in Karachi on December 26. The source said that immediately after the Test ended in Karachi on Tuesday, Babar and Saqlain had flown to Lahore. \"A high-level meeting was held in the office of the PCB chairman Ramiz Raja at the Gaddafi Stadium in which chief selector, Mohammad Wasim also participated,\" the source said. He said Babar, Saqlain and Wasim briefed Raja on why Pakistan had lost the Test series 3-0. \"Every aspect of the team, selection matters, the captaincyand Saqlain's role were discussed threadbare in the nearly three-hour-long meeting,\" the source added. He said the chief selector was supposed to announce the squad for the two Tests against New Zealand after the Karachi Test ended on Tuesday, but the announcement was delayed till Wednesday on Raja's instructions. The source added that Raja had given a piece of his mind to Babar, Saqlain and Wasim and made it clear that he was not happy with the selections made for the series. \"Babar told the chairman that the injury issues with the three main fast bowlers, Shaheen (Afridi), Haris Rauf, and Naseem Shah, had hit their plans hard and weakened the bowling considerably, allowing England batters to score freely,\" the source said. The source added that Babar told Raja that right now Pakistan don't have the experience and quality players required to take on teams like Australia, England and New Zealand. Saqlain confirmed to Raja that, as earlier decided, he will leave his head coach's position after the New Zealand series in January and the PCB should start looking for a new coach. The source also said that the board felt Babar would be better off just captaining the white-ball squads and that the Test captaincy should be given to someone else, preferably Shan Masood or Mohammad Rizwan. \"A lot of discussion has been held on Babar's future as Test captain and it was decided to maintain the status quo for now.\" The source said that a unanimous decision had been taken that it would not be prudent to remove Babar as Test captain between now and July as it would demoralise the team and also affect the captain's form. \"But what is decided is that, in July Babar will be changed as Test captain,\" the source said. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Wednesday, 21 Dec, 2022 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics ET Markets Smart Investing More Country has Set Shining Example with UPI, Aadhaar & India Stack Concerned by some aspects of CCI rulings against Google, says Pichai to ET in an exclusive interview. Tata Moves HC on ₹1,500cr GST Claim The salt-to-software Tata Group has approached the Bombay High Court to contest a ₹1,500-crore goods and services tax (GST) claim pertaining to its 2017 settlement of a dispute with NTT Docomo, sources aware of the development told ET. SpiceJet Looks to Settle Dues of Aircraft Lessors SpiceJet has proposed to settle the dues of aircraft leasing companies by turning them into potential investors from creditors, according to people aware of the discussions. Read More News on pakistan cricket board ramiz raja Saqlain Mushtaq Babar Azam PCB (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Recent hit Deep value investing: How a big basket of low PE stocks can help mitigate risk 6 mins read 3 insights to kick-start your day, featuring government on moonlighting 3 mins read Investing Why China’s index-fund boom has been worrying investors 8 mins read Subscribe to ETPrime","pubDate":"2022-12-21 14:45:48","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-48806,resizemode-4,msid-96404258/head-coach-saqlain-could-step-down-babar-might-lose-test-captaincy-in-july-pcb-sources.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Babar Azam might lose Test captaincy in July: PCB sources","link":"https://www.orissapost.com/babar-azam-might-lose-test-captaincy-in-july-pcb-sources/","keywords":["Sports","Babar Azam","Saqlain Mushtaq","Test Captaincy"],"creator":["Post News Network"],"video_url":null,"description":"Karachi: Pakistan head coach Saqlain Mushtaq could step down following the team’s Test debacle against England at home, with sources also said that Babar Azam might also lose his captaincy in the longest format by July next year. A source close to the Pakistan Cricket Board (PCB) told PTI Wednesday that the former off-spinner could […]","content":"Babar Azam might lose Test captaincy in July: PCB sources PTI Updated: December 21st, 2022, 20:02 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Karachi: Pakistan head coach Saqlain Mushtaq could step down following the team’s Test debacle against England at home, with sources also said that Babar Azam might also lose his captaincy in the longest format by July next year. A source close to the Pakistan Cricket Board (PCB) told PTI Wednesday that the former off-spinner could leave after the home series against New Zealand, beginning with the Test in Karachi December 26. The source said that immediately after the Test ended in Karachi Tuesday, Babar and Saqlain had flown to Lahore. “A high-level meeting was held in the office of the PCB chairman Ramiz Raja at the Gaddafi Stadium in which chief selector, Mohammad Wasim also participated,” the source said. He said Babar, Saqlain and Wasim briefed Raja on why Pakistan had lost the Test series 3-0. “Every aspect of the team, selection matters, the captaincy, and Saqlain’s role were discussed threadbare in the nearly three-hour-long meeting,” the source added. He said the chief selector was supposed to announce the squad for the two Tests against New Zealand after the Karachi Test ended on Tuesday, but the announcement was delayed till Wednesday on Raja’s instructions. The source added that Raja had given a piece of his mind to Babar, Saqlain and Wasim and made it clear that he was not happy with the selections made for the series. “Babar told the chairman that the injury issues with the three main fast bowlers, Shaheen (Afridi), Haris Rauf, and Naseem Shah, had hit their plans hard and weakened the bowling considerably, allowing England batters to score freely,” the source said. The source added that Babar told Raja that right now Pakistan don’t have the experience and quality players required to take on teams like Australia, England and New Zealand. Saqlain confirmed to Raja that, as earlier decided, he will leave his head coach’s position after the New Zealand series in January and the PCB should start looking for a new coach. The source also said that the board felt Babar would be better off just captaining the white-ball squads and that the Test captaincy should be given to someone else, preferably Shan Masood or Mohammad Rizwan. “A lot of discussion has been held on Babar’s future as Test captain and it was decided to maintain status quo for now.” The source said that a unanimous decision had been taken that it would not be prudent to remove Babar as Test captain between now and July as it would demoralise the team and also affect the captain’s form. “But what is decided is that in July Babar will be changed as Test captain,” the source said. Tags: Babar Azam Saqlain Mushtaq Test Captaincy Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts PCB threatens to boycott 50-over World Cup in India to exert pressure December 21, 2022 Axar Patel surges to career-best ICC Test ranking, Kuldeep jumps 19 spots December 21, 2022 IPL 2023 auction: KKR need some pace support, Shardul, Lockie good options, says Sanjay Manjrekar December 21, 2022 Over 2L litres of fresh drinking water ‘made from air’ will be produced during FIH Odisha Hockey WC December 20, 2022 Rohit Sharma ruled out of second Test against Bangladesh December 20, 2022 England completes memorable 3-0 series sweep in Pakistan December 20, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-12-21 14:32:15","image_url":"https://www.orissapost.com/wp-content/uploads/2021/10/Babar-Azam-300x184.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Railways vs Punjab game to start afresh after Karnail Singh pitch is deemed 'dangerous and unfit for play' - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMioAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L3JhbmppLXRyb3BoeS1yYWlsd2F5cy12cy1wdW5qYWItZ2FtZS10by1zdGFydC1hZnJlc2gtYWZ0ZXIta2FybmFpbC1zaW5naC1waXRjaC1pcy1kZWVtZWQtZGFuZ2Vyb3VzLWFuZC11bmZpdC1mb3ItcGxheS0xMzUwNTkx0gGtAWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvcmFuamktdHJvcGh5LXJhaWx3YXlzLXZzLXB1bmphYi1nYW1lLXRvLXN0YXJ0LWFmcmVzaC1hZnRlci1rYXJuYWlsLXNpbmdoLXBpdGNoLWlzLWRlZW1lZC1kYW5nZXJvdXMtYW5kLXVuZml0LWZvci1wbGF5LTEzNTA1OTE_cGxhdGZvcm09YW1w?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Railways vs Punjab game to start afresh after Karnail Singh pitch is deemed 'dangerous and unfit for play'  ESPNcricinfoRanji Trophy match between Punjab-Railways stopped due to dangerous pitch; to resume on fresh track on day 3  Times NowAfter 24 wickets in 4 sessions, Punjab's Ranji Trophy match versus Railways to restart on fresh pitch  India TodayRanji Trophy: Railways vs Punjab game suspended due to “dangerous and unfit” Karnail Singh pitch  SportstarRanji Trophy: Railways vs Punjab To Restart After Karnail Singh Pitch Declared Dangerous And Unfit  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-12-21 12:50:20","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan name squad for New Zealand Tests | Press Release - PCB","link":"https://news.google.com/__i/rss/rd/articles/CBMiWmh0dHBzOi8vd3d3LnBjYi5jb20ucGsvcHJlc3MtcmVsZWFzZS1kZXRhaWwvcGFraXN0YW4tbmFtZS1zcXVhZC1mb3ItbmV3LXplYWxhbmQtdGVzdHMuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan name squad for New Zealand Tests | Press Release  PCBPAK vs NZ Test Series: Pakistan name squad for New Zealand Tests - Check Out  InsideSportPakistan squad against New Zealand is likely to be announced today  Cricket PakistanHasan Ali called in as Pakistan annouce Test squad for New Zealand series  Geo NewsPAK vs NZ: New Zealand share glimpse of their departure from Auckland  Geo SuperView Full coverage on Google News","content":null,"pubDate":"2022-12-21 12:32:11","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"I want to win IPL series for Dhoni and Chennai fans: Rudhuraj","link":"https://thenewsglory.com/i-want-to-win-ipl-series-for-dhoni-and-chennai-fans-rudhuraj/","keywords":["Sports","Cricket","csk","Dhoni","India","Indian","IPL"],"creator":["The News Glory"],"video_url":null,"description":"Chennai: The auction for the IPL 2023 season is scheduled to take place on Friday. In this environment, Ruduraj Gaekwad said that he wants to win the upcoming season for Dhoni and Chennai Super Kings fans. 25-year-old Rudhuraj has been playing for Chennai Super Kings since 2020. So far he has played 36 IPL matches […]","content":"Chennai: The auction for the IPL 2023 season is scheduled to take place on Friday. In this environment, Ruduraj Gaekwad said that he wants to win the upcoming season for Dhoni and Chennai Super Kings fans. 25-year-old Rudhuraj has been playing for Chennai Super Kings since 2020. So far he has played 36 IPL matches and has accumulated 1207 runs. In this last 2021, Asathi scored 635 runs. That time the Chennai team had won the champion title. He continues to perform well in domestic cricket as well. Asati hit 7 sixes in a single over in the Vijay Hazare Trophy series last November. “I want to win this IPL series for Mahendra Singh Dhoni and Chennai fans,” said Rudhuraj. Dhoni had said that there is no spark in the young players during the 2020 season. It is noteworthy that Ruduraj has been showing his excellent performance since then. It has been reported that IPL matches will be held in ten cities including Chennai from the upcoming season.","pubDate":"2022-12-21 12:19:36","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"'Forget You're Sachin's Son': What Yuvraj's Dad Told Arjun Before Training","link":"https://sports.ndtv.com/cricket/forget-you-are-the-son-of-sachin-tendulkar-what-yuvraj-singhs-father-told-arjun-tendulkar-before-training-him-3626477","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Arjun Tendulkar, son of cricket great Sachin Tendulkar, emulated his father as he scored a ton on his Ranji Trophy debut","content":null,"pubDate":"2022-12-21 12:15:11","image_url":"https://c.ndtvimg.com/2022-09/omm8km78_yograj-singh-and-sachin-tendulkars-son-arjun-tendulkar_625x300_27_September_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC CEO pitches for more Test-playing nations to tour Pakistan","link":"https://www.thehindu.com/sport/cricket/icc-ceo-pitches-for-more-test-playing-nations-to-tour-pakistan/article66288478.ece","keywords":null,"creator":["\n         PTI  \n    "],"video_url":null,"description":"ICC CEO Geoff Allardice is optimistic Test cricket will flourish in Pakistan at a time when major Test-playing nations such as Australia and England are seeing a noticeable drop in stadium attendance","content":null,"pubDate":"2022-12-21 12:10:08","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma to complete 2022 without scoring a century","link":"https://thenewsglory.com/rohit-sharma-to-complete-2022-without-scoring-a-century/","keywords":["Sports","Cricket","game","India","online special","Rewind 2022","Rohit Sharma"],"creator":["The News Glory"],"video_url":null,"description":"Chennai: In the current year 2022, Indian team captain Rohit Sharma is completing the year without registering a single century. It is noteworthy that he has now missed the Test series against Bangladesh due to injury. Rohit holds the record as the batsman with the most runs in ODI cricket. Also the batsman who scored […]","content":"Chennai: In the current year 2022, Indian team captain Rohit Sharma is completing the year without registering a single century. It is noteworthy that he has now missed the Test series against Bangladesh due to injury. Rohit holds the record as the batsman with the most runs in ODI cricket. Also the batsman who scored 3 double centuries in ODI cricket. However, for the past two years he has been in and out of the team due to injuries. For example, many series can be mentioned. When he assumed the captaincy, the expectation was high that the Indian team would win the ICC series. But, that too fell into disrepute. At the same time, he has not improved much with the bat this year. For the first time since 2012, he has finished the year without scoring a century. Rohit, fondly known as ‘Hit Man’ by the fans, was disappointed not to register a century. Fans have also expressed their concern on social media. In the current year, he has accumulated a total of 995 runs in 8 ODIs, 2 Tests and 29 T20Is. It includes 6 half-centuries. Let’s hope that Rohit will score a century in the upcoming 2023. The ODI World Cup series will be held next year. In that series the Indian team put on an amazing performance and Rohit scores big runs which is very much needed. Percentages registered patient-year wise: \r 2007 – 0 \r 2008 – 0 \r 2009 – 0 \r 2010 – 2 \r 2011 – 0 \r 2012 – 0 \r 2013 – 4 \r 2014 – 1 \r 2015 – 4 \r 2016 – 2 \r 2017 – 8 \r 2018 – 7 \r 2019 -10 \r 2020 – 1 \r 2021 – 2 \r 2022 – 0 \r","pubDate":"2022-12-21 11:18:38","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Batting coach shares update on KL Rahul's injury - ICC Cricket","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzI5ODk4OTTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Batting coach shares update on KL Rahul's injury  ICC CricketAnother injury blow to Team India vs Bangladesh  Rediff.comRahul picks up hand injury - 'hopefully he'll be okay,' says Rathour  ESPNcricinfoIND vs BAN: Rohit Sharma And Navdeep Saini Ruled Out Of Second Test Against Bangladesh, KL Rahul Will Continue To Lead  Cricket AddictorRohit out, Shubman in? | India's Tour of Bangladesh | Co-Powered by Dafanews | NewsX  NewsXView Full coverage on Google News","content":null,"pubDate":"2022-12-21 10:49:20","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}