{"newsArray":[{"article_id":"b45812096140984fa87914ffd5a97bbe","title":"Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again'","link":"https://www.dailymail.co.uk/sport/cricket/article-12663887/Cricketer-Fawad-Ahmed-announces-four-month-old-son-died-Till-meet-again.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket player Fawad Ahmed has sadly announced the tragic passing of his four-month-old son.","content":"Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' Fawad Ahmed baby son has passed By Ashley Nickel For Daily Mail Australia Published: 23:12, 23 October 2023 | Updated: 23:52, 23 October 2023 e-mail View comments Australian cricket player Fawad Ahmed has sadly announced the tragic death of his four-month-old son following a health battle. Ahmed, 41, and his wife welcomed their second child in June but the baby faced persistent health issues. After spending months in the Royal Children's Hospital in Melbourne trying to find a diagnosis, Ahmed announced on Monday that his son had passed away. Australian cricket player Fawad Ahmed's son (above) has tragically passed away 'Till we meet again my little angel,' he wrote alongside two photos of the tiny boy. 'Unfortunately after a long struggle my little man has lost the painful and tough fight. 'I believe you are in a better place, we will miss you so much. '‎I hope no one ever goes through this pain.' In an earlier interview with Cricket Australia , Ahmed described his son's struggle as 'a tough time'. 'Every day he is growing, and the bones and the joints are getting stiffer and stiffer,' he said. 'We don't know what's going to happen. Neither do the doctors. It's pretty bad. You want to know. 'This is something that is aching the heart.' Two months ago the baby underwent a surgery to bring forward his jaw and tongue to help with breathing after winning a weight struggle and finally reaching 3kg. However, his health problems persisted and his eyesight became a fresh concern. Ahmed said his son had returned a sight result of -13, -15 is considered blind. 'He doesn't look at me, that hurts,' he said. 'But we say, \"All praise to Allah\" that he's got something. I am arranging some glasses for him, but it's going to be a little bit tough because we have tested the smallest size already and it doesn't fit.' Fawad Ahmed (above) previously described his son's struggle as a 'tough time' for the family He described how the constant hospital trips and bad news had worn down his family. 'It's something that's so unexpected,' Ahmed said. 'You're excited, you're happy about the birth of your child, and then suddenly you go to some dark places, and you don't know what's going to happen. 'Our lives have completely changed. Every morning, we just wake up and get ready to go to the hospital. Then in the evening, we come back. That's it, nothing else.' Ahmed became an international cricketer after fleeing his home in Pakistan and settling in Australia as an asylum seeker in 2010 at the age of 28. He made five international appearances for Australia across ODI and T20I matches after being granted citizenship in 2013. Melbourne Share or comment on this article: Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-23 22:18:08","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_154x115px.png","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7080b9e8fb88f49eac25af0ad1c79e4e","title":"NOCSL celebrates Hangzhou heroic accomplishments at Asian Games 2023","link":"https://www.ft.lk/sports/NOCSL-celebrates-Hangzhou-heroic-accomplishments-at-Asian-Games-2023/23-754402","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The National Olympic Committee of Sri Lanka yesterday celebrated and recognised the victorious Lankan athletes who brought honour to the motherland at the 19th Asian Games in Hangzhou. The Lankan athletes ended up in the 26th position out of 45 Asian countries and territories, with a total of five medals; a gold, two silver and two bronze to their credit. The medal winners as follows. 1. Tharushi Karunarathna: Gold Medal-Women’s 800m Final – 2 minutes. 03.20 secs 2. Women’s Relay Team (Nadeesha Ramanayaka, Jayeshi Uththara, Sayuri Mendis and Tharushi Karunarathna): Bronze Medal-Women’s 4*400m Relay Final – 3 minutes. 30.88 secs. 3. Men’s Relay Team (Aruna Dharshana, Kaushika Keshan, Rajitha Rajakaruna and Kalinga Kumarage): Bronze Medal-Men’s 4*400m Relay Final - 3minutes. 02.55secs 4. Nadeesha Dilhani Lekamge: Silver Medal-Women’s Javelin Throw - 61.57m (New Personal Best) 5. Women’s Cricket Team (Captain - Chamari Athapatthu, Vice-Captain - Oshadhi Ranasinghe): Silver Medal-Women’s Cricket Final-SL vs IND - SL lost by 19 runs Speaking at the felicitation ceremony, National Olympic Committee of Sri Lanka Secretary General Maxwell de Silva said, “An Asian medal after 2014 and athletic medals after 2006 augurs a new lease of life to Lankan athletes and its future. We saw this upstage of performances at the humongous stage like the Asian Games and that was a culmination of the Lankan athletic contingent believing in themselves and usurping each other’s strengths to showcase that they too belong to the real big stage. The medal doors were opened by the women’s cricketers who jumped one scale higher and brought home a silver over the bronze that they won in 2014 in Incheon.” The Lankan track took a different turn; the Lankan athletes were upbeat. Then they faced the mixed relay conundrum that turned silver into oblivion, but that setback also gave more strength to change the status quo. This was proved true when Javelin thrower Dilhani Lekamge took the camp by surprise when she completed her personal best with a throw of 61.57m to take the silver. This followed the triple medal day where Tharushi won the women’s 800m gold followed by women’s and men’s relay team winning 400m bronze medals culminating one of the most joyous days in Lankan athletic history. Taking a bow to Chef-de-mission in Hangzhou Nishanthe Piyasena who lead the logistical aspects besides leading the contingent, Professor Chathuranga Ranasinghe who kept the close tab of the medical needs of the athletes, said that they too played a huge role in Lankan team’s impressive accomplishments. De Silva added, “We consider this as just a beginning. Besides the medal winners, there were others who also could have stood on the podium with a stroke of luck or guidance. So, this is the time to look to the future. We have to work hand-in-hand with the Ministry of Sports to seek and set up ways to sustain and nurture the talent in short and long-term programmes and we are already at it.” Pix by Lasantha Kumara","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"0cc780b4cf5ef6a99ca4c2771cc0129a","title":"Pathirana ruled out of World Cup","link":"https://www.ft.lk/sports/Pathirana-ruled-out-of-World-Cup/23-754404","keywords":null,"creator":null,"video_url":null,"description":null,"content":"It has been confirmed that fast bowler Matheesha Pathirana has been ruled out of the ongoing Cricket World Cup and will return home. Pathirana failed to pass a fitness test on his injured bowling arm and will be replaced by one of the three travelling reserves Dushmantha Chameera, Angelo Mathews or Dasun Shanaka. Sri Lanka will take a decision on the replacement for Pathirana before forwarding the player’s name to the Event Technical Committee of the ICC for approval. Meanwhile, Maheesh Theekshana who underwent a scan for a troublesome hamstring is to continue training with the Sri Lanka squad in preparation for their next match against England at Bengaluru on Thursday, while the report is still awaited.","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"6ad974a7188f34d25d290f8217f96386","title":"Afghanistan causes another upset, trounce Pakistan by a convincing 8 wickets","link":"https://www.ft.lk/sports/Afghanistan-causes-another-upset--trounce-Pakistan-by-a-convincing-8-wickets/23-754405","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Afghanistan who outplayed England in the cricket World Cup pulled off a second shock when they defeated Pakistan comprehensively by eight wickets at the MA Chiddambaram Stadium here Monday to record their first win over them in eight ODI contests. It was a creditable win for the Afghans who chased down Pakistan’s total of 282-7, to win two matches in a World Cup for the first time in their history. It was also their highest and successful run chase in an ODI. The stage for this historic win was set by openers Rahmanullah Gurbaz (65 off 53 balls, 9 fours, 1 six) and Ibrahim Zadran (87 off 113 balls, 10 fours) who shared a partnership of 130 off 127 balls. Rahmat Shah (77* off 84 balls, 5 fours, 2 sixes) and skipper Hashmatullah Shahidi (48* off 45 balls, 4 fours) continued the good work to see Afghanistan home with an unbroken stand of 96 off 93 balls as Pakistan’s game simply fell away on the face of Afghanistan’s assault. Babar Azam’s 30th ODI fifty and a big-hitting cameo from Iftikhar Ahmed led Pakistan’s strong batting display and helped them to 282/7 on a bone-dry surface. As many as 38 overs were bowled by the spinners, which is the third-most bowled in a World Cup match. Things looked on the upswing for Pakistan when Abdullah Shafique swung a Naveen-ul-Haq delivery for a maximum in the fifth over. It was the first six hit by a Pakistan batter in the PowerPlay in 2023. Both openers, Imam-ul-Haque and Shafique, looked at ease against the new ball and made use of the best batting conditions on offer to post a 56-run opening stand. Shafique continued his good World Cup form and raised a run-a-ball 50 (5 fours, 2 sixes) his second in the tournament to go along with a hundred. It was Noor Ahmad, in the side for Fazalhaq Farooqi, who broke the 54-run stand with wickets in back-to-back overs. The left-arm leggie first trapped Shafique lbw and then drew a top-edge from Mohammad Rizwan, leaving Pakistan struggling on a tough surface to score. Another 43-run stand between Babar and Saud Shakeel brought in some relief for Pakistan but Mohammad Nabi broke that stand, getting Shakeel caught at mid-on after a flurry of dots. However, it was Noor’s dismissal of Babar for 74 (92 balls, 4 fours, 1 six) in the 42nd over that really threatened to knock the wind out of Pakistan. Luckily for them, Iftikhar (40 off 27 balls, 2 fours, 4 sixes) and Shadab Khan (40 off 38 balls, 1 six, 1 four), back in the side for ill Mohammad Nawaz, together added 73 runs for the sixth wicket. Noor, the youngest player to feature in this World Cup at 18, returned figures of 3 for 49 in his first World Cup match and helped Afghanistan with breakthroughs on a day their lead spinner Rashid Khan went wicketless. Scores: Pakistan 282-7 (50) (Abdullah Shafique 58, Babar Azam 74, Saud Shakeel 25, Shadab Khan 40, Ifthikar Ahmed 40, Naveen-ul-Haq 2/52, Noor Ahmed 3/49) Afghanistan 286-2 (49) (Rahmanullah Gurbaz 65, Ibrahim Zadran 87, Rahmat Shah 77*, Hashmatullah Shahidi 48*)","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"92076af31fc5746239499c08a1a2a5e0","title":"Sri Lanka cricket what it was and what it is today","link":"https://www.ft.lk/sports/Sri-Lanka-cricket-what-it-was-and-what-it-is-today/23-754406","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka’s cricketing standards at international level has dipped so low that it’s a crying shame to see that beating an associate member team like Netherlands can amount to being called an achievement. Past Sri Lankan teams have simply swept away the opposition that a country like Netherlands possess, but today’s side lacks those quality players and the experience that goes with it to make winning look more convincing. No doubt, Netherlands has grown as an international cricket side over the years, but when countries like Pakistan and New Zealand are simply sweeping them aside hardly raising a sweat, that’s where the difference lies between a team like Sri Lanka and the rest of the top ODI sides. Without a win in three matches of the ongoing Cricket World Cup, Sri Lanka were desperate to beat Netherlands and chalk up their first points. They eventually did so, but not with the ease which one would have associated a Sri Lanka side to win, it was one hard struggle to get to the target of 263 that they consumed 48.2 overs. It was tough going no doubt in the middle, with the ball holding up and stroke making not all that easy, but what made it difficult for Sri Lanka to score was the discipline in the lines and lengths maintained by the Dutch bowlers. It is an area where the Lankan bowling unit should learn from. They simply bowled wicket to wicket and made the batsmen play at almost each and every delivery. The other notable aspect was that Netherlands were never afraid to keep their fielders inside the 30-meter circle and attack the batsmen challenging them to go over the top at their own peril. We hardly see Sri Lanka keep so many fielders inside the circle, but always outside it which amounts to a defensive ploy. One could say that the Sri Lanka team is going through a transition period and that the side lacks experience in its bowling unit with so many injuries to its key bowlers who were not available for the World Cup. But the same cannot be said of the batting where the talent is there but the execution and judgement is poor. The batsmen have still not learnt to build an innings. How many times have we seen the batsmen doing all the hard work and then simply throwing away his wicket? This has been Sri Lanka’s achilles heel with this present unit as we have seen in their matches of the World Cup against Pakistan and Australia, matches they could have won had it not been for the batsmen’s indiscretion. This young Sri Lanka unit is extremely talented and has the makings of achieving bigger things if they are kept together for the next 2-3 years without meddling too much with it. Injuries are part and parcel of sport and like the weather you cannot control it. It is just sheer bad luck if you lose your best batsman or best bowler ahead of a major tournament like the World Cup. For a tournament as big as the Cricket World Cup, experience plays a big part because of the pressures the players have to absorb in the middle, the expectations, the spectators, the conditions and to keep the motivation going for the length of the tournament. Sadly, Sri Lanka left their experience at home and are paying a heavy price for it.","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"3594af38508bbcf561078630d623591e","title":"Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table","link":"https://www.dailymail.co.uk/sport/live/article-12661711/Tottenham-vs-Fulham-Premier-League-2023-24-Latest-Result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Read how Mail Sport's live blog covered Tottenham's game with Fulham, with the hosts moving back to the top of the Premier League with a win.","content":"Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table By Samuel Draper For Mailonline Published: 18:45, 23 October 2023 | Updated: 23:32, 23 October 2023 e-mail 9 shares 293 View comments Read how Mail Sport's live blog covered Tottenham 's game with Fulham , with the hosts moving back to the top of the Premier League with a win. This live blog has now closed. 21:34 Thank you for following along tonight Thank you for following along with the blog tonight. An impressive win for Ange Postecoglou's side, and one they will hope to build on as the season progresses. Keep an eye across Mail Sport for the latest reaction to tonight's match, and looking ahead to a bumper week of fixtures too. Have a good night and we'll meet again soon. Goodbye. 21:33 Riath Al-Samarrai's match report Mail Sport's Riath Al-Samarrai was on hand at the Tottenham Hotspur Stadium to give his rundown of the 2-0 win for the hosts that sent them back to the top of the Premier League. Tottenham 2-0 Fulham: Son Heung-min and Maddison fire Spurs back top RIATH AL-SAMARRAI AT THE TOTTENHAM HOTSPUR STADIUM: Back from their break and back in the groove. The hope and possibility will soon throw Spurs into a wall of reality, but not yet. Mail Online 21:05 Son and Maddison hit double top You can tell how much those two enjoyed it, as Spurs went back to the top of the Premier League after a long weekend of action. They started in fourth, but they're first now. And could move five points clear on Friday... Early days, of course, but a statement from Ange Postecoglou's men. 20:57 FULL TIME: Tottenham 2-0 Fulham Tottenham back on top of the Premier League. Son and Maddison giving the three points to the hosts, after a wave of defensive errors from Fulham. 20:54 Tottenham 2-0 Fulham Wilson comes into the box, but Tottenham are able to block the opportunity. Looks like that clean sheet stays intact! 20:54 Tottenham 2-0 Fulham Four minutes into stoppage time, and Fulham are searching in vain for a consolation. Tottenham more than happy to see this one out. 20:49 Tottenham 2-0 Fulham Seven minutes added on 20:49 Tottenham 2-0 Fulham Fulham push but can't find a way to create a clear chance for a goal. Tottenham counter, but it is flagged as offside. 20:47 Tottenham 2-0 Fulham Cairney takes a shot, but Vicario is able to hold it. Nothing going Fulham's way tonight. 20:46 Tottenham 2-0 Fulham Postecoglou heading for eight wins in his first nine PL games, one of the best starts for a manager in the league ever. He won't care about individual stats though - the three points send Spurs top. 20:44 Tottenham 2-0 Fulham - Vicario booked The Tottenham goalkeeper goes into the book for timewasting. 20:44 Tottenham 2-0 Fulham Jiminez shoots straight at the keeper. Fulham needed that to go in! 20:42 Palhinha makes way for Cairney Another change for Fulham too, for the last eight minutes or so. 20:42 Triple change for Spurs including both goalscorers coming off Richarlison and the goalscorers Maddison and Son make way. Johnson, Lo Celso and Veliz come on for the last few minutes. Son looks reluctant to come off, but hands the captain's armband to Romero. 20:39 Tottenham 2-0 Fulham Ten minutes plus stoppages for Fulham to try and rescue something, and for Spurs to hold onto the top spot in the Premier League. 20:39 Tottenham 2-0 Fulham Wilson and Richarlison both go down in a challenge, so the referee brings the game to a halt, but it looked like a rather 50-50 thing, just a basic collision, and both players are able to get back on their feet and keep going. 20:37 Tottenham 2-0 Fulham The game has slowed a little bit in this second half. Spurs know the job is done, unless they let it slip, and Fulham don't quite have the ability to turn this game completely on its head. Tottenham may have one eye on Friday night already... 20:35 Tottenham 2-0 Fulham Bassey loses it again, and Maddison capitalises. He seems to get in Son's way - or maybe it was vice-versa - and the shot isn't as effective as it should have been. A let off for Fulham, and a let off for Bassey, but a lot of the focus will be on his errors in this game that have led to the goals... 20:34 Tottenham 2-0 Fulham Wilson goes down after being caught by a Spurs player's studs on his knee. Innocuous, but probably stung. Luckily, the substitute is back to his feet for the rest of this one. 20:31 Harrison Reed on for Fulham He replaces Sasa Lukic for the last 20 minutes or so 20:30 Tottenham 2-0 Fulham Maddison swings in a free-kick from out wide but it evades everyone and goes out for a Fulham goal-kick. 20:28 Tottenham 2-0 Fulham Porro makes a great pass into the box for Son, but Bassey is just able to take the ball off the Spurs captain. 20:25 Tottenham 2-0 Fulham Fulham have had just one shot on target in this match - which was a superb save - but they're going to have to find a way to make the goalkeeper work, or this is only going to end one way. Alex Iwobi is just offside, as Fulham look to make something happen. 20:24 Fulham substitution Marco Silva makes his third change, De Cordova-Reid making way for Harry Wilson. 20:23 Tottenham changes In the aftermath of the goal, Udogie made way for Emerson. Then Sarr was taken off to be replaced by Oliver Skipp. 20:21 When James Maddison got his first home Spurs goal A moment to celebrate for Maddison, as he finally got a goal at the Tottenham Hotspur Stadium for his new club after the summer move. 20:19 Tottenham 2-0 Fulham Willian passes to Robertson, but his ball across the box is too far and it goes out for a throw-in on the other side. Fulham searching for something... 20:18 Tottenham 2-0 Fulham Fulham have to go for it now, after falling two behind, but they might not find it easy. Then again, Vicario comes out of his box and makes a poor header which is intercepted by Willian. Unfortunately for him, he can't quite run into the box with it, and the Tottenham defender makes a sliding tackle to clear the danger. 20:14 Tottenham 2-0 Fulham - GOAL! Maddison 54' James Maddison gets his first goal for Tottenham at their Stadium. The home crowd have a new hero. Bassey makes a terrible pass, and Son intercepts, before gifting it on a plate to the former Leicester City man. He's able to slide it under Leno, and make it 2-0 to the hosts. Tottenham going top as it stands. 20:12 Tottenham 1-0 Fulham Fulham earn a free-kick about 30 yards out, with Willian standing over the ball. He clips the ball into the box, but Spurs are able to head it out for a throw-in. 20:11 Tottenham 1-0 Fulham Kulusevski bursts forward, who plays it across to Son, who plays it to Richarlison, who enters the box, but sends the ball skyward. It felt like an opportunity for Spurs, but it amounts to nothing. 20:08 Tottenham 1-0 Fulham Taking a little while for this second half to really get going. Tottenham trying to find their way past a stubborn Fulham side. 20:05 2nd half underway: Tottenham 1-0 Fulham 20:04 Fulham make two changes at HT Jiminez and Iwobi on for the second half, Silva choosing to take off Vinicius and Pereira at the half-time interval. 20:02 Tottenham going back top as it stands Can they hold onto the lead? 20:01 Only one booking in that first half Hojbjerg was put into the referee's book, moments before Tottenham took the lead, but he'll have to be cautious in the second half. So far, the referee has not turned to cautions to deal with offences, which I think has helped the game to flow, but some fans will inevitably disagree! 19:58 What changes will the sides make at the break? Fulham did well to contain Spurs, and had their own chances, but nothing really close to delivering a real danger to Ange Postecoglou's side. Can they switch it up? For Tottenham, they must want more of the same, but to get more clinical too, and put away some of their promising attacking spells. 1-0 is never enough. 19:50 Half-time: Tottenham 1-0 Fulham Son Heung-min splits the sides at the break 19:48 Tottenham 1-0 Fulham Bassey seems to catch a Spurs player in the box, and whilst there's calls for a penalty, the man in the middle and the men in the VAR room aren't swayed. 19:47 Tottenham 1-0 Fulham Two minutes of additional time in this first half 19:46 Tottenham 1-0 Fulham Fulham's Willian once again races into the box, but he's caught between a shot or making a pass, and ends up doing neither. Tottenham are also driving forward themselves. The ball seems to get caught in Maddison's feet though... 19:43 Tottenham 1-0 Fulham Willian plays the ball across the box for Fulham, but De Cordova-Reid's header is deflected out for a corner for the visitors. That corner is headed out, and then flagged for offside. 19:42 Tottenham 1-0 Fulham The hosts try to get a second, Kulusevski takes a shot, but it's deflected wide for a corner. Porro takes an ambitious shot from halfway down the half when the corner amounts to nothing, and earns another corner in quick succession. Fulham manage to deal with that one too -but Spurs with all the pressure as they look to double their advantage before the break. 19:39 Tottenham 1-0 Fulham Tottenham keep up their habit of scoring in every game. What can Fulham do now? 19:37 Tottenham 1-0 Fulham - GOAL! Son 36' Fulham lose the ball, and Tottenham take over. Richarlison nudges the ball into Son's path, and the South Korean captain is able to curl a beautiful shot from the edge of the penalty box. Nothing Leno could do about that. The hosts go 1-0 up. 19:37 Tottenham 0-0 Fulham - Hojbjerg goes in the book First booking of the game goes to Hojbjerg 19:35 Tottenham 0-0 Fulham James Maddison tries to make something happen, he is a man who clearly wants the ball at his feet, but he's only able to make a tame shot which is no trouble for the Fulham goalkeeper. 19:34 Tottenham 0-0 Fulham - penalty shout not given Udogie is in the box, trying to play the ball across to a Spurs teammate, but it hits the defender instead. He's adamant it hit a hand, but VAR were quick to check it... and given nothing. 19:32 Tottenham 0-0 Fulham - Richarlison goes just wide Kulusevski made that chance, as Spurs come blistering down the wing, and he cuts into the box, and maybe he could go for the shot, but instead he lays it off to Richarlison, who puts it wide. If the Brazilian had hit the target there, Leno would have had his work cut out... 19:29 Tottenham 0-0 Fulham Straight down the other end, Hojbjerg blasts a shot straight at Leno, which blisters the Fulham keeper's hands, but is easy for him to gather. 19:28 Tottenham 0-0 Fulham Sloppy from Vicario to play the ball straight to Willian, but Fulham aren't able to create enough space to make anything happen. The Spurs goalkeeper lifts his hand up to his teammates to apologise for his miskick,but no damage done. 19:27 Tottenham 0-0 Fulham Twenty-five minutes played, and nothing seperating these sides yet. 19:25 Tottenham 0-0 Fulham Willian makes a brave pass, but it's intercepted. Maddison bursts into the box, but that amounts for nothing. An entertaining exchange, but nothing clear cut to show for it yet. 19:24 Tottenham 0-0 Fulham Palhinha goes in for a tough tackle, and brings down Udogie in the middle of the park. It creates a brief spark, but the referee is able to disperse the tension without resorting to his cards. 19:22 Tottenham 0-0 Fulham Willian tries to cut from inside, but he's not given space, and the promising attack flutters away. Fulham get another corner moments later, but it sails into Vicario's hands. 19:20 Tottenham 0-0 Fulham Willian - who was expected to sign for Spurs once upon a time - was brought down on the left. Fulham try to play the free kick into the middle of the park, but make a mess of it. Somehow, they get the ball into the box, but Carlos Vinicius needed to do something more effective with the header as it softly goes wide. 19:18 Tottenham 0-0 Fulham Spurs looking to stretch Fulham, but not finding the way forward like they did in the early stages. 19:14 Tottenham 0-0 Fulham - Vicario makes superb save! The corner comes across, and there's a fierce goalbound header from Joao Palhinha, which Vicario is able to tip away, and Spurs clear their lines. There's a reason why Vicario has the best save percentage in the Premier League this season! 19:12 Tottenham 0-0 Fulham Just as I post that, the visitors get forward, and it looks promising, but Romero heads it out for a Fulham corner. 19:12 Tottenham 0-0 Fulham The first ten minutes are played, and it's all Tottenham so far. 19:11 Tottenham 0-0 Fulham A third dangerous free-kick for Spurs, with the referee deeming the contact on the edge of the box despite penalty protestations. Kulusevski takes a blistering shot which is deflected and loops up, but it amounts to nothing. 19:10 Tottenham 0-0 Fulham - Spurs make new chance with free-kick Spurs get another free kick on the edge of the box, and they're more ready for it this time. It's lifted over the wall and across the danger zone, but it's knocked over the bar. 19:05 Tottenham 0-0 Fulham The free kick was played wide by Maddison, and it would have been a smart move, but it seemed to catch Udogie unawares, and Fulham clear their lines. 19:04 Tottenham 0-0 Fulham Tottenham's Son has the first good chance, Maddison playing the ball through to him, but he hits it straight against the keeper. The hosts now have a free-kick about 25 yards out. 19:02 Kick-off: Tottenham 0-0 Fulham After the players take the knee, Fulham get things going at the Tottenham Hotspur Stadium. 19:00 Players gather for a moment of silence Both teams gather at the centre circle for a moment of silence to honour the tragic events taking place in Israel and Gaza this month. 18:58 Marco Silva has never beaten Spurs in the Premier League Does that streak end today? 18:57 Can Spurs reclaim top spot? The players walk out onto the pitch for the final Premier League game of the weekend. 18:55 The players are in the tunnel The waiting is almost over. 18:55 Fulham's Marco Silva on tonight's test Fulham boss Marco Silva told Sky Sports: 'It’s a big test for us definitely. But we like this type of challenge. When we test ourselves at this level, we like it. I believe the Premier League is a test. It’s a moment to test ourselves.' 18:52 The warm-ups are done Who will start brightest? Will it take until stoppage time for Spurs to win another home game? 18:48 It's 4th versus 13th Will Spurs win and go top, will Fulham win and move into the top half? We're counting down to the action. 18:45 15 minutes to go What's Fulham's thought process going into this? They're the only team to have defeated Ange Postecoglou's Spurs so far, but can they replicate that magic once again, without the help of a penalty shootout? 15 minutes until the game gets going in North London... 18:40 Spurs have a quick turnaround Spurs play tonight and again on Friday night, as the TV pick once more for their trip to Crystal Palace. Fulham have an extra day and a half to recover for their trip to Brighton, who will be in Europa League action on Thursday. 18:36 Son getting warm in North London 25 minutes or so until things get underway at the Tottenham Hotspur Stadium 18:30 Tottenham three home wins on the bounce Tottenham have three home wins on the bounce so far in the Premier League season. They left it late against Sheffield United, and against Liverpool- you expect Ange Postecoglou would prefer to have this one settled far ahead of stoppage time,. 18:25 Calvin Bassey arrives What difference will he make to Fulham, as they look to build on their win against Sheffield United a couple of weeks ago? 18:15 Ange Postecoglou on Romero's return The Tottenham boss has been talking to Sky Sports about the return of Romero for the game tonight. 'Us playing on Monday night is pretty beneficial for our international boys. And having the extra few days for all of them has been excellent,' the Australian said. 'Romero has been super important to us. We’ve got a new goalkeeper, centre-back and new left back and a right-back who’s adjusting to a new position – having a World Cup winner among them gives a lot of comfort.' 18:12 Last time out was in August These sides met in the second round of the League Cup at the end of August, and Fulham won 5-3 on penalties after a 1-1 draw across the 90 minutes. Micky van de Ven put into his own goal to give Fulham the lead within 20 minutes, but Richarlison equalised for Tottenham just over ten minutes into the second half. Will that result have any bearing on tonight's proceedings? 18:08 Fulham make two changes Calvin Bassey replaces Issa Diop, who misses the trip across London with a foot problem. That's one of two changes for Fulham, the other sees Sasa Lukic stepping into midfield, replacing Alex Iwobi. 18:06 One enforced change for Tottenham Just the one enforced change for Ange Postecoglou tonight. Yves Bissouma is suspended after his red card against Luton, so Pierre-Emile Hojberg comes in. 18:02 Team news is here Romero is fit for Tottenham, so they make just one change. Calvin Bassey makes just his second start for Fulham, coming back into the side, while Carlos Vinicius, ex-Spurs, starts for the visitors. Full team news coming. 18:00 Jamie Carragher on Tottenham Carragher spoke to Sky Sports on Spurs: 'I don’t think they [Spurs supporters] are getting too carried away in terms of thinking about the title. I think you’d be delighted about the Champions League positions. 'But its not just about results here, it’s about the football they’re playing, and the fact that Tottenham supporters are looking going to the game, looking forward to watching their team play – which it has been, maybe not so much under Conte, but maybe under Jose, Nuno – all a certain kind of manager and that’s where the excitement comes from.' 17:58 Fulham hope to climb the table Marco Silva's visitors start in 13th after the rest of the league's action this week, but they'll move into the top half if they get the win at the Tottenham Hotspur Stadium. A draw will leave them behind 10th-placed Chelsea on goal difference, whilst a defeat would leave them behind Crystal Palace and Wolves too. Their next match after tonight is Sunday's trip to Brighton. 17:50 Tottenham's chance to kick on Few clubs would have been as disappointed as Tottenham to herald the start of the last international break. Ange Postecoglou's side have had an unshakeable start to their Premier League season, and after a gritty win at Luton Town, sat top of the table. But the disruption is unlikely to have done too much to dent sky-high aspirations in north London. With tonight's kick-off, the team have had the longest for players to recover after returning from far-flung national team destinations, and Postecoglou was lucky to have avoided any injury to team talismans - although there was likely a sharp intake of breath at the Tottenham Hostpur Stadium when Son Heung-min limped down the tunnel at half-time during a friendly against Vietnam. In fact, the international break may have even boosted confidence in the camp - James Maddison continued his club form in England colours, and Destiny Udogie and Micky van de Ven were both handed senior debuts. 17:44 James Maddison is loving his blossoming bromance with 'nice guy' Son Heung-min... as Tottenham's £45m summer signing hails the impact of Ange Postecoglou's 'alpha male' management And they thought bromance was dead. For so long, there was only one unbreakable Tottenham double act in town. Harry Kane to Son Heung-min , Son Heung-min to Harry Kane. No pairing in Premier League history combined for as many goals as those two Spurs team-mates. Few made that boyish grin spread across Son's face like the England captain. After Kane's move to Bayern Munich , you wondered if anyone would ever be able to again. Step forward, James Maddison . READ MORE BELOW. James Maddison is loving his blossoming bromance with Son Heung-min INTERVIEW BY JAMES SHARPE: Few made that boyish grin spread across Son's face like Kane. After Kane's move to Bayern, you wondered if anyone would be able to again. Step forward, Maddison . Mail Online 17:42 Good evening! Hello and welcome to Mail Sport's live blog of the final Premier League tie of the weekend, with Tottenham inviting Fulham to north London to see if they can extend their unbeaten league run against the Cottagers. Kick-off is at 8pm, but stick around as we bring you all the team news, build-up, and more ahead of the whistle. Key Updates Riath Al-Samarrai's match report View post FULL TIME: Tottenham 2-0 Fulham View post Tottenham 2-0 Fulham - GOAL! Maddison 54' View post Fulham make two changes at HT View post Half-time: Tottenham 1-0 Fulham View post Tottenham 1-0 Fulham - GOAL! Son 36' View post Tottenham 0-0 Fulham - Hojbjerg goes in the book View post Tottenham 0-0 Fulham - penalty shout not given View post Tottenham 0-0 Fulham - Vicario makes superb save! View post Kick-off: Tottenham 0-0 Fulham View post Last time out was in August View post Fulham make two changes View post One enforced change for Tottenham View post Team news is here View post James Maddison is loving his blossoming bromance with 'nice guy' Son Heung-min... as Tottenham's £45m summer signing hails the impact of Ange Postecoglou's 'alpha male' management View post TOP STORIES Legendary commentator Martin Tyler set to return to the gantry four months after leaving Sky Sports to once again call a live Premier League game Tottenham 2-0 Fulham: Son Heung-min and James Maddison fire Spurs back to the top of the Premier League as Ange Postecoglou's side capitalise on defensive errors THE NOTEBOOK: Israel flags are held aloft, Ange Postecoglou makes a mockery of the manager of the month curse and Destiny Udogie epitomises Tottenham's fluidity in win over Fulham Tottenham fans pictured waving Israel flags during their clash against Fulham despite Premier League ban amid Palestine conflict Jamie Carragher argues Spurs fans would be 'delighted' with a place in the Champions League spots on Monday Night Football... and Wolves manager Gary O'Neil praises Ange Postecoglou's outlook Bayern Munich 'could be ready to raid Tottenham AGAIN' in January as Thomas Tuchel 'weighs up reuniting Harry Kane with a forgotten former team-mate' James Maddison is loving his blossoming bromance with 'nice guy' Son Heung-min... as Tottenham's £45m summer signing hails the impact of Ange Postecoglou's 'alpha male' management Jack Grealish meets up with his 'first football hero' at Man City's training ground... but can you recognise the iconic ex-Premier League striker? Harry Kane made his start to life at Bayern look EASY: He's scored for fun, embraced the culture and looks settled... only injury or an almighty collapse will stop him from finally winning trophies this season Jack Grealish has been OVERTAKEN by Jeremy Doku at Man City, claims CHRIS SUTTON as he says the England star will be 'a little bit worried' after the Belgian 'nailed down' his spot under Pep Guardiola on It's All Kicking Off Ange Postecoglou hopes Tottenham can provide 'escapism' to supporters affected by the war between Israel and Hamas as he looks to provide 'solace or comfort' to fans The festive football feast! Premier League clubs are braced for the league to schedule football every day except Christmas Day from December 22 until at least January 2 - with Arsenal v West Ham set to move back two days Harry Maguire has regained Erik ten Hag's trust and will be key as Man United face a derby with City and must-win games in Europe... the defender was written off but his professionalism could teach sulking Jadon Sancho a thing or two Sir Bobby Charlton's last surviving brother, Tommy, 77, makes heartfelt tribute to Man United legend following his death, saying: 'If ever there was a place reserved in heaven, it is for Bob' Pep Guardiola was WRONG to sell Cole Palmer to Chelsea, says Dominic King after the £42.5m winger scored against Arsenal... but Chris Sutton says you can't doubt the City boss' judgement as hosts clash on Mail Sport's It's All Kicking Off Strictly Come Dancing couple Janette Manrara and Alijaz Skorjanec drop surprise hints at baby number two - just three months after welcoming daughter Lyra Rose Man City's fury at fans' sick Sir Bobby Charlton chants: Man United's rivals apologise to football legend's family, as video emerges of chanting at their game shortly after he died aged 86 Former Man United star Andreas Pereira reveals his bizarre pre-match leg-rubbing superstition... and it's all linked to his love for Brazil icon Kaka Both Kalvin Phillips and Manchester City think it's 'very likely' he'll leave the club in January... with the out-of-favour midfielder keen to escape the Etihad in a bid to keep his England place ahead of Euro 2024 Luke Shaw expected to be OUT for another FIVE WEEKS, missing vital games against Man City and Copenhagen in the Champions League - but there's finally good injury news as Aaron Wan-Bissaka nears a return Tottenham issue BAN on national flags for game against Fulham - and tell fans a Premier League match 'is not an appropriate arena to display' them England 15-16 South Africa - Rugby World Cup semi-final RECAP: Agony for England as South Africa steal victory with a late penalty kick after leading for just TWO minutes in the game High-achieving pupil, 17, was stripped of his maths GCSE after exam question he found online during last-minute revision appeared on his exam paper I was once former Manchester United boss Louis van Gaal's favourite player, but now I'm struggling for game time in Poland Micah Richards reveals how he downed TEN drinks from a minibar the night before a Man City game - and tried to talk his way out of playing with Manuel Pellegrini after admitting boozing to the doctor Mauricio Pochettino fires a warning at one of his Chelsea stars - insisting he 'NEEDS to improve' and 'is not at his best' - as he reveals why he took him off during their 2-2 draw with Arsenal EXCLUSIVE INTERVIEW: Andy Carroll speaks on his new life in France's second division, wasting cash on a bengal cat, eating roast beef and Yorkshire pudding on matchdays and buying Sir Rod Stewart's Essex mansion Mauricio Pochettino jokes he would be 'KILLED' if he didn't start £222m stars Enzo Fernandez and Moises Caicedo in Chelsea's draw with Arsenal Man United stars are accused of IGNORING Rasmus Hojlund as Ruud Gullit claims they 'don't look for' the £72m Danish striker after he struggled in the win over Sheffield United Carlton Morris says 'fearless' Luton Town deserve to be in the Premier League as the Hatters star striker says they CAN stay up despite a stuttered start to life in the top flight Sir Bobby Charlton dies RECAP: The world reacts to the death of the World Cup winner and former Man United star at the age of 86 IN THE MONEY: Sir Jim Ratcliffe's Manchester United investment faces yet more delays over Old Trafford improvements... as both Chelsea and Newcastle plot their own ground expansions Raheem Sterling and Cole Palmer tussle over penalty in clash with Arsenal... but it's the former Man City academy startlet who wins the ball to open the scoring at Stamford Bridge Hannah just thought she was being clumsy, but her bruises were a sign she needed to see her doctor William Gallas names FOUR Premier League defenders who are better than William Saliba - including a Chelsea star - before telling fans to 'calm down' about the Gunners ace who is NOT world class East London pie and mash is mocked by foreign foodies who joke Britons 'eat like it's still WW2 and they've got to ration the food' Erik ten Hag bluntly tells Andre Onana to 'step up' and 'give better performances' after £47m goalkeeper's error-strewn start to his Man United career... but backs his ex-Ajax stopper to come good Mohamed Salah IS Liverpool's greatest ever player in the Premier League era - not Steven Gerrard - claims Mail Sport's Chris Sutton on It's All Kicking Off... and believes only one player in the top-flight's history is more ruthless Multiple Palestine flags held up at Anfield during Merseyside derby between Liverpool and Everton, despite the Premier League banning flags from matches this weekend to avoid potential incidents Dave Courtney's best friend reveals ex-gangster's last words before he shot himself with a pistol Tube driver who led chant of 'free, free Palestine' on London Underground train is suspended, TFL says Real Madrid 'eye a surprise move to lure Man City striker away from Pep Guardiola's squad', as Carlo Ancelotti looks to boost Los Blancos despite the lack of a release clause for the hit man US Grand Prix - Race LIVE: Max Verstappen overtakes Lando Norris to grab the lead in Austin, with Lewis Hamilton in second 'Very dirty' portrait of Mary Magdalene which was sold by London gallery to French collector for just £30,000 is actually the work of Italian renaissance master Raphael Could Bournemouth's Andoni Iraola be the first Premier League manager to be sacked? Cherries boss faces scrutiny with no win in his nine games Manchester United legends including Gary Neville and Brian Kidd join current squad and boss Erik ten Hag in signing messages of condolence in memory of Sir Bobby Charlton Barcelona kid Marc Guiu, 17, scores the winner just 30 seconds after coming off the bench for his debut as Xavi unearths another gem to put his side a point behind Real Madrid Why was Lewis Hamilton DISQUALIFIED four hours after coming second at the United States Grand Prix? Max Verstappen's model girlfriend is left SERIOUSLY unimpressed as he's booed after winning the US Grand Prix ahead of disqualified Lewis Hamilton Toto Wolff is backing Mercedes to learn from their mistakes and 'come back stronger' after taking Lewis Hamilton's disqualification from the US Grand Prix 'on the chin' EXCLUSIVE: Jose Antonio Reyes' father says his son and Mikel Arteta were 'like brothers' as his family open their doors to Mail Sport ahead of an emotional night as Arsenal and Sevilla face-off in the Champions League Manchester United confident rival Man City fans will respect minute's applause held for Sir Bobby Charlton ahead of Sunday's derby clash Ange Postecoglou slams his Tottenham side 'for taking liberties in possession' while claiming Spurs had 'the WORST 45 minutes we've had all year' despite now going nine games unbeaten in the Premier League after 2-0 win against Fulham EXCLUSIVE: Taylor Swift and Travis Kelce arrive at the Chiefs star's mansion in his Rolls Royce for party with friends and family catered by Kansas City BBQ joint - after the loved-up pair left win over Chargers together Harry Kane on cloud nine as he sets Bayern Munich club record by scoring ninth goal in opening eight Bundesliga games in 3-1 win over Mainz Was South Africa's 'white ****' slur lost in translation? Springboks fans say Bongi Mbonambi was speaking in Afrikaans - and Google Translate shows they may have a case Lewis Hamilton is DISQUALIFIED from the US Grand Prix nearly four hours after it finished for running an illegal floor - after Brit had finished second having pushed winner Max Verstappen close Taylor Swift: Travis Kelce's girlfriend shakes it off with Brittany Mahomes to celebrate Chiefs' touchdown, while the pop star gazes adoringly at boyfriend Travis Kelce during Chargers game Taylor Swift fans fume that Jackson Mahomes was allowed in the same Chiefs VIP box as pop superstar as he awaits hearing over alleged sexual battery: 'Someone get her out immediately' EXCLUSIVE: Taylor Swift heads to Travis Kelce's house for lunch of turkey omelet and chicken tacos after flying in from LA on her private jet to watch her man play in a fourth Chiefs game Ireland rugby star strips down to her pineapple-print underwear at Rugby World Cup, as she celebrates 'the party' despite her nation's early exit England's Tom Curry accuses South Africa's Bongi Mbonambi of calling him a 'white c***' in the Rugby World Cup semi-final with alleged racist slur picked up by the referee's mic Alan Jones pictured in blackface at Wallaby 'skit night' during famous Bledisloe Cup winning tour of New Zealand EXCLUSIVE: Travis Kelce pumps gas into his Cadillac en route to the Chiefs' team hotel ahead of clash against the Chargers, but will Taylor Swift be reuniting with him at Arrowhead? First images emerge of Travis Kelce's luxury new $6m Kansas mansion - complete with a swimming pool, waterfall and mini golf course - as he hunts for 'more privacy' amid his fledgling romance with Taylor Swift Shock merger between the PGA Tour and LIV Golf is at risk of collapse as Saudi defectors Phil Mickelson and Ian Poulter both warn of another huge exodus of big-name golfers to the breakaway circuit Taylor Swift may have anointed herself queen of Chiefs Kingdom but Kansas City's 31-17 win against Chargers belonged to boyfriend Travis Kelce Taylor Swift shakes it off next to Brittany Mahomes as they show off special handshake while cheering on their NFL men at Chiefs game KSI hires lawyer after controversial defeat to Tommy Fury, turning to a legal team in a bid to overturn the fight result after being more accurate with his punches Travis Kelce hilariously reveals his mom Donna put him on a LEASH as a child: 'She eventually got p****d and sick of us getting lost' What are Jackson Mahomes' alleged crimes and what has he been charged with? All the latest after he was spotted with Taylor Swift to watch Travis Kelce's Chiefs win Arsenal break silence over all-white squad team photo after race row as they accept their women's team 'does not reflect the diversity that exists across the club' World Rugby launch investigation into Tom Curry's allegation he was called a 'white ****' by South African hooker Bongi Mbonambi during England's Rugby World Cup semi-final defeat in Paris Georgetown University women's basketball coach Tasha Butts dead at 41: Tributes pour in for former star player after two-year cancer battle OLIVER HOLT: Never before have so many apologies been owed by so many to so few... ridiculed before the World Cup England came agonisingly close to one of their greatest EVER upsets against South Africa EXCLUSIVE: Ashlyn Harris loads her luggage into a taxi and heads to Newark Airport as she jets out of New York amid Ali Krieger split... after her ex-wife dropped hint she had cheated on her with new lover Sophia Bush Rapper Blueface proposes to his girlfriend in WILD day at the Rams game... after turning his private suite into a STRIP CLUB and offering rival players wads of cash to throw the game Celtic fans hold up Palestine flags during Scottish Premiership match at Hearts despite criticism from their own club over Palestinian support India cricket legend Bishan Singh Bedi dead at 77: Former spin bowler, who was his country's leading wicket taker before retiring in 1979, passes away after prolonged illness Travis Kelce has nervous 'alarms' going off in his head over new 'level of superstardom' from dating Taylor Swift, reveals his brother Jason: 'Man, this is a lot' That's why you don't look back! German triathlon leader falls a metre from the line to finish second - despite having led the full 13-mile running section before losing out at the death England rugby star hospitalised after brain infection which saw him struggle to open and close his eyes BBC axe football show MOTDX on the sly less than a month after Dan Walker became embroiled in fierce Football Focus row with Alex Scott Travis Kelce hilariously celebrates with a fist-pump as fan screams 'Let's go, Taylor's boyfriend' at him... after pop superstar Swift attended a FOURTH Chiefs game to watch him play Man United deny Jadon Sancho is set to return from his exile after fans thought Erik ten Hag said 'Sancho' and not 'Sergio' in his press conference when asked about fitness of left-back Reguilon Wish you were still here? Man United captain Bruno Fernandes meets up with booted-out goalkeeper David de Gea in Manchester amid £47m Andre Onana's struggles, as fans urge the Spaniard to 'come back in January' Travis Kelce: Taylor Swift's new lover arrives at Arrowhead for Chiefs' game against Chargers, before popstar follows after enjoying lunch at her boyfriend's house SIR CLIVE WOODWARD: These stars proved they are right behind Steve Borthwick - this cruel defeat can be a watershed moment Barcelona reveal CGI footage of their 'insane' stadium's renovation plans which includes a complete upper-tier reconstruction and a new roof emblazoned with their Spotify sponsor Andy Carroll lobs the goalkeeper with incredible 40-yard effort to make it back-to-back goals in as many games for Ligue 2 side Amiens SC ENGLAND PLAYER RATINGS: Ben Earl proves he is the breakthrough star of the whole tournament as Steve Borthwick's side say goodbye to some excellent servants Mary Lou Retton has returned HOME after 'scary setback' in her fight against rare form of pneumonia, as family reveal US Olympic legend is in 'recovery mode' after leaving the ICU Taylor Swift: CBS breaks out hilarious graphic showing Travis Kelce performs better with pop star in attendance and even uses her lyrics London Premier League Ange Postecoglou Share or comment on this article: Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table e-mail 9 shares 22 players on the pitch. Only 1 is English. So muc... by Nice1arry 46 Add comment Comments 293 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-23 21:39:50","image_url":"https://i.dailymail.co.uk/1s/2023/10/23/20/76906633-0-image-m-50_1698090748952.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2e99982288c78786a7928ff09b3dc365","title":"Papers: Gerrard under fire at Al Ettifaq","link":"https://www.skysports.com/football/news/20876/12991288/ajax-to-fail-with-mitchell-van-der-gaag-approach-steven-gerrard-under-fire-at-al-ettifaq-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Tuesday's newspapers...","content":"All the top stories and transfer rumours from Tuesday's newspapers... DAILY MAIL Ajax are likely to fail with any approach to lure Manchester United assistant boss Mitchell van der Gaag back to the club. Manchester United academy prospect Tyler Fletcher has switched his international allegiance back to Scotland from England. David De Gea continued to reunite with his old Manchester United team-mates on Monday, as Bruno Fernandes took to social media to share his 'coffee and friends' date with the goalkeeper and a handful of Red Devils stars. West Ham fans travelling to Greece this week will be wrapped in a protective police cocoon after Olympiakos' most recent match was abandoned amid a vitriolic atmosphere at the Karaiskakis Stadium. THE SUN Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Steven Gerrard is already under pressure from fans at Al Ettifaq. Football fans are reportedly set for a huge festive feast of Premier League action that could potentially see Christmas Day as the only day off from action. Galatasaray's goalkeeper Fernando Muslera has been praised for his incredible, injury-saving gesture to Besiktas' Valentin Rosier. England rugby league star Dominic Young was rushed to hospital after contracting a brain infection that left him unable to open his eyes. Francis Ngannou has thanked Cristiano Ronaldo after the football icon gifted the fighter a £110,000 watch. Jake Paul is set to rematch Nate Diaz in a mixed martial arts bout. DAILY MIRROR Erik ten Hag has suggested he may pair Anthony Martial with Rasmus Hojlund in attack for Manchester United. Graeme Souness has not pulled any punches over the state of Manchester United after admitting he's previously warned Sir Jim Ratcliffe not to invest in a football club. Mary Earps hit back at a \"hurtful\" comment from a Manchester United fan who accused the England No 1 of being \"too important\" to engage with supporters post-match. DAILY STAR Sir Alex Ferguson will pen his own personal tribute to Sir Bobby Charlton in the coming days, following the passing of his close friend. Sir Bobby Charlton's brother Tommy knows there is a special place in heaven for the \"loved\" footballing icon. Wrexham's movie star owner Rob McElhenney has roped in Hollywood A-lister Chris Pratt to gift Ryan Reynolds his birthday present. Please use Chrome browser for a more accessible video player THE TIMES Joe Root has said that England are not playing enough one-day international cricket to continue competing at World Cups and suggested that staging more 50-over county matches at the expense of the Vitality Blast could help to develop a new generation of talent. DAILY EXPRESS Erik ten Hag felt that Andre Onana should've focused on laying the early foundations of a successful career at Old Trafford rather than returning to international duty. Arsenal and Brighton are battling it out for the signature of Sunderland academy player Mason Cotcher. Chelsea are reportedly interested in signing Inter Milan star Alessandro Bastoni. Liverpool are reportedly interested in 21-year-old midfielder Ezequiel Fernandez. Red Bull will trim four junior drivers from their ranks in Formula 2 next season with Dennis Hauger, Zane Maloney, Enzo Fittipaldi and Jak Crawford all set to lose their backing from the reigning F1 constructor champions. TELEGRAPH Jonny Bairstow has opened up on Lord's stumping during the Ashes. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-23 21:00:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ee8644f062bc898c9c1a85e2f93a7304","title":"Indian cricket great Bishan Bedi dies at 77","link":"https://www.mercurynews.com/2023/10/23/indian-cricket-great-bishan-bedi-dies-at-77/","keywords":["Latest Headlines","News","Obituaries","Other Sports","Sports","World News","Cricket","Midday Wire","Obituary"],"creator":["The Associated Press"],"video_url":null,"description":"The orthodox spinner took 1,560 first-class wickets — the most by any Indian bowler ever — playing for various teams in India and England.","content":"NEW DELHI — Bishan Bedi, the India cricket great whose dazzling left-arm spin claimed 266 test wickets, has died. He was 77. The death of Bedi, who underwent multiple surgeries over the last two years that included a knee operation a month ago, was confirmed by the Board of Control for Cricket in India on Monday. “The BCCI mourns the sad demise of former India Test Captain and legendary spinner, Bishan Singh Bedi,” the BCCI wrote on X, formerly known as Twitter. “Our thoughts and prayers are with his family and fans in these tough times. May his soul rest in peace.” Born in Amritsar on Sept. 25, 1946, Bedi was part of the famous Indian spin quartet with Bhagwath Chandrasekhar, Erapalli Prasanna and Srinivas Venkataraghavan in the 1970s. Bedi earned his 266 wickets in 67 test matches, at an average of 28.71, with best innings figures of 7-98 and best match figures of 10-194. His last test match was against England at the Oval in 1979. At the time of his retirement, he was India’s leading wicket-taker before being overtaken by Kapil Dev a few years later. He averaged under nine runs in tests as a right-handed batter but had a highest score of 50 not out. He played only 10 ODIs between 1974-79, picking up seven wickets. The orthodox spinner took 1,560 first-class wickets — the most by any Indian bowler ever — playing for various teams including Delhi and Northern Punjab in India and Northamptonshire in England. He is survived by his wife and two children. India Prime Minister Narendra Modi led the tributes, saying on X: “His passion for the sport was unwavering and his exemplary bowling performances led India to numerous memorable victories. “He will continue to inspire future generations of cricketers. Condolences to his family and admirers.” Bedi made his test debut against West Indies on the last day of 1966, and took 21 wickets in a home test series against Australia at the end of 1969. He kept on troubling major test playing nations before eventually succeeding Mansoor Ali Khan as India skipper in 1976. His first win as test captain came at Port-of-Spain when India reached 406-4 in a historic chase. He led India 22 times in total, winning six of them. Geoff Allardice, chief executive of the International Cricket Council, said Bedi was one of the masters of flight and turn. “I would like to extend heartfelt condolences from everyone at the ICC to the family of one of the greats of the game and one whose exploits in test cricket will be remembered for a long time,” Allardice said. “He was the kind of spinner who could excel in different conditions and would have been one of the greats in any era.” Known for wearing colorful patkas and a graceful delivery hiding devastating variety, Bedi was outspoken on the field and often got embroiled in controversies. In 1976 he declared India’s second innings early at Kingston to protest hostile bowling by Caribbean fast bowlers. With three Indian batters already out of the game after being hit by West Indies pacers, Bedi claimed there weren’t enough fit players available to come out and bat. West Indies eventually won the test match by 10 wickets. Bedi also criticized Sri Lanka spin great Muttiah Muralitharan for his bowling action. He refused to compete in Kerry Packer’s lucrative World Series Cricket in 1978 and claimed that he was approached by the rebel cricket league. But his love for the game was clear, even when on the receiving end. Cricinfo.com website said Bedi “often applauded batters when they hit him for six.”","pubDate":"2023-10-23 20:24:00","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/10/SJM-L-OBBEDI-1023.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"5e9d33e1e9edd446757b951d955f33a7","title":"‘The greatest Manchester United player of all time’: British soccer legend Bobby Charlton dies at 86","link":"https://www.mercurynews.com/2023/10/23/the-greatest-manchester-united-player-of-all-time-british-soccer-legend-bobby-charlton-dies-at-86/","keywords":["Latest Headlines","News","Obituaries","Soccer","Sports","Midday Wire","Obituary"],"creator":["The Associated Press"],"video_url":null,"description":"He survived a 1958 plane crash that killed several of his Manchester United teammates, then later became the heart of the England team that won the World Cup in 1966.","content":"MANCHESTER, England— Bobby Charlton, an English soccer icon who survived a plane crash that decimated a Manchester United team destined for greatness to become the heartbeat of his country’s 1966 World Cup triumph, has died. He was 86. The death of Charlton, who is regarded by many as the greatest ever English player, was announced in a statement from his family that was released by United, which said he died Saturday surrounded by his family. No cause of death was disclosed. In November 2020, it was announced that Charlton had been diagnosed with dementia, the same disease that afflicted his brother Jack — who died in 2020 at age 85 — and another World Cup winner, Nobby Stiles. An extravagantly gifted attacking midfielder with a ferocious shot, Charlton was the leading scorer for both United (249 goals) and England (49 goals) for more than 40 years until being overtaken by Wayne Rooney. Charlton was easily recognizable with his comb-over, and known globally for being a gentleman of the beautiful game. “Sir Bobby was a hero to millions, not just in Manchester, or the United Kingdom, but wherever football is played around the world,” United said. “He was admired as much for his sportsmanship and integrity as he was for his outstanding qualities as a footballer; Sir Bobby will always be remembered as a giant of the game.” Alex Ferguson, who managed United from 1986-2013, said before Charlton’s death that he “is the greatest Manchester United player of all time — and that’s saying something.” “Bobby Charlton is absolutely without peer in the history of the English game,” Ferguson said. Charlton was also renowned for his humility and discipline. He was never sent off in 758 appearances for United from 1956-73 or 106 internationals for England from 1958-70. Charlton played with George Best and Denis Law in the so-called “Trinity” that led United to the 1968 European Cup title after surviving the 1958 Munich crash that wiped out the celebrated “Busby Babes” team. He won three English league titles at United, and one FA Cup. “For a footballer, he offered an unparalleled combination of grace, power and precision,” said former United defender Bill Foulkes, another survivor of the Munich air crash. “It added up to a greatness and something more — something I can only call beauty.” FIFA President Gianni Infantino described Charlton as a “football legend whose impact on the game spanned generations.” United great David Beckham said Charlton was “truly a national hero.” British Prime Minister Rishi Sunak called him ”one of the game’s greatest players.” Charlton’s England scoring record stood for 45 years until Rooney scored his 50th goal for the national team in September 2015. Three of his England goals came in the World Cup in 1966, during which Charlton played every minute for the team and stood out especially in the semifinals when he scored twice against Portugal to lead England to a first major final. England beat West Germany 4-2 after extra time in the title match at Wembley Stadium. Although Ryan Giggs beat Charlton’s appearance record for United in 2008, his scoring record for the club lasted another nine years. It was only in 2017 — 44 years after Charlton last wore the famous red jersey of England’s most successful club — that Rooney scored his 250th goal for United. United played a Premier League match against Sheffield United a few hours after Charlton’s death was announced. Man United’s players laid a wreath on the field ahead of the game, which the team won 2-1, and took part in a period of applause while a picture of a young Charlton was displayed on the screens inside the stadium. After retiring in 1973, Charlton went into coaching and founded a youth scheme that included Beckham among its participants. After brief spells in charge of Preston, Wigan and Irish side Waterford, Charlton returned to United in 1984 as a director and persuaded the board in 1986 to appoint Ferguson, who delivered 38 trophies during nearly 27 years in charge. Knighted in 1994 by Queen Elizabeth II, Charlton remains a mainstay at Old Trafford, featuring alongside Best and Law on a statue outside United’s stadium. Charlton avoided the controversies and distractions that damaged the career of Best, with his style and demeanor bringing a popularity that transcended the tribalism of club and international football. “I felt he could be a bit aloof,” the late Best said in a 2001 magazine interview. “We were never at each other’s throats, we simply didn’t go and have a pint together.” Charlton’s death left Geoff Hurst, who scored a hat trick in the 1966 final, as the only surviving member of that England team. “We will never forget him and nor will all of football,” Hurst said of Charlton on X, formerly known as Twitter. “A great colleague and friend, he will be sorely missed by all of the country beyond sport alone.” Robert Charlton was born Oct. 11, 1937, in the coal-mining town of Ashington, northeast England, and his talent was obvious from a young age. “We realized Bobby was going to be a bit special as a player when he was about 5 years old,” said Jack, his older brother. “He was always kicking a football or a tennis ball against a wall and when it bounced back it stuck to him like a magnet.” Charlton wrote in 2007 that his family sometimes relied on illegally caught salmon or rabbit to ward off hunger, while his father — also named Robert — gathered coal washed up on local beaches and sold it to bolster his income. His father’s commitment to his mining colleagues meant that in 1966 he missed Charlton scoring both goals against Portugal in that World Cup semifinal because he didn’t want someone else to have to cover for him in the pit. He was, however, persuaded to attend the final when the Charlton brothers lifted the trophy. Charlton’s playing career began far from home in Manchester after leaving school at 15, making his United debut three years later against Charlton in 1956. Within two years, tragedy struck the tight-knit group of United players whose relationship was forged as trainees in austere conditions. The team was still celebrating winning at Red Star Belgrade to secure a place in the European Cup semifinals when their plane caught fire on its third attempt to take off in heavy snow after a refueling stop in Germany. Charlton miraculously emerged from the smoldering wreckage with only light head injuries and picked his way through the wreckage to help survivors. Spotting manager Matt Busby groaning in agony on the smoke-shrouded runway, Charlton rushed to help the father-figure who had promoted him to the first team. But eight members of the “Busby Babes” team packed with bright prospects were among the 21 fatalities. They included Duncan Edwards, considered one of England’s most talented players at 21. “Sometimes it engulfs me with terrible anger and regret and sadness — and guilt that I walked away and found so much,” Charlton wrote in 2007. Charlton became driven by a lingering obligation to preserve the memories of the Munich dead, returning to action less than four weeks later and helping a hurriedly assembled team of survivors and stand-ins reach that season’s FA Cup final. Busby rebuilt his team around Charlton, adding the 1965 and 1967 English league titles to the championship they won in 1957. “There was always one great hope — the return to greatness of my beloved club,” Charlton said. The biggest prize of his club career arrived in 1968 as United became the first English club to become champion of Europe. Charlton scored twice in a 4-1 extra-time win over a Benfica team containing Portugal great Eusebio. But Charlton is perhaps best known for being part of the England team that won the World Cup. It remains England’s only major title in men’s soccer. Charlton and his brother fell out over Jack’s public assertion that Bobby’s wife caused him to become estranged from his mother. But the pair reconciled and Jack presented Bobby with a lifetime achievement trophy at the 2008 BBC Sports Personality of the Year Award. “We have had our public disputes, proving that in any family discord can sometimes disrupt the force of love and blood, but throughout that time I never lost the sense of wonder and gratitude that we were together in 1966 on such a great day in the history of our nation’s sport,” Bobby Charlton said. Charlton was rarely seen in public in the final years of his life after being diagnosed with dementia. He was never forgotten, though. “This man, from day one, was everything I wanted to be,” United striker Marcus Rashford wrote of Charlton after hearing about the diagnosis. “Kind, professional, caring, talented.” Another former United player, Phil Neville, told NBC that Charlton deserved to stand alongside the likes of Pele, Diego Maradona and Lionel Messi as a soccer great, because of what he achieved and the way he did it. “World champion. Gentleman. Legend. A true great who will be remembered forever,” Prince William, who is also president of England’s Football Association, wrote on X. Charlton is survived by his wife, Norma, whom he married in 1961, and his two daughters.","pubDate":"2023-10-23 19:28:03","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/10/SJM-L-OBCHARLTON-01-1023.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"a75ca9f28d22059ba3e10ec2e9146c6b","title":"Shoaib Akhtar Reacts To Pakistan's Defeat Against Afghanistan Cricket World Cup 2023, 'Most Embarrassing Defeat...'","link":"https://www.newsr.in/n/Sports/1zpnzuuou6/Shoaib-Akhtar-Reacts-To-Pakistan-Defeat-Against.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"In what was a monumental upset, Afghanistan's victory over Pakistan has thrown the points table into disarray, raising questions about Pakistan's prospects in the tournament. Reported by Zee News 1 hour ago.","content":"Monday, 23 October 2023 ( 2 hours ago ) In what was a monumental upset, Afghanistan's victory over Pakistan has thrown the points table into disarray, raising questions about Pakistan's prospects in the tournament. 👓 View full article","pubDate":"2023-10-23 18:37:22","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"b45812096140984fa87914ffd5a97bbe","title":"Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again'","link":"https://www.dailymail.co.uk/sport/cricket/article-12663887/Cricketer-Fawad-Ahmed-announces-four-month-old-son-died-Till-meet-again.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket player Fawad Ahmed has sadly announced the tragic passing of his four-month-old son.","content":"Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' Fawad Ahmed baby son has passed By Ashley Nickel For Daily Mail Australia Published: 23:12, 23 October 2023 | Updated: 23:52, 23 October 2023 e-mail View comments Australian cricket player Fawad Ahmed has sadly announced the tragic death of his four-month-old son following a health battle. Ahmed, 41, and his wife welcomed their second child in June but the baby faced persistent health issues. After spending months in the Royal Children's Hospital in Melbourne trying to find a diagnosis, Ahmed announced on Monday that his son had passed away. Australian cricket player Fawad Ahmed's son (above) has tragically passed away 'Till we meet again my little angel,' he wrote alongside two photos of the tiny boy. 'Unfortunately after a long struggle my little man has lost the painful and tough fight. 'I believe you are in a better place, we will miss you so much. '‎I hope no one ever goes through this pain.' In an earlier interview with Cricket Australia , Ahmed described his son's struggle as 'a tough time'. 'Every day he is growing, and the bones and the joints are getting stiffer and stiffer,' he said. 'We don't know what's going to happen. Neither do the doctors. It's pretty bad. You want to know. 'This is something that is aching the heart.' Two months ago the baby underwent a surgery to bring forward his jaw and tongue to help with breathing after winning a weight struggle and finally reaching 3kg. However, his health problems persisted and his eyesight became a fresh concern. Ahmed said his son had returned a sight result of -13, -15 is considered blind. 'He doesn't look at me, that hurts,' he said. 'But we say, \"All praise to Allah\" that he's got something. I am arranging some glasses for him, but it's going to be a little bit tough because we have tested the smallest size already and it doesn't fit.' Fawad Ahmed (above) previously described his son's struggle as a 'tough time' for the family He described how the constant hospital trips and bad news had worn down his family. 'It's something that's so unexpected,' Ahmed said. 'You're excited, you're happy about the birth of your child, and then suddenly you go to some dark places, and you don't know what's going to happen. 'Our lives have completely changed. Every morning, we just wake up and get ready to go to the hospital. Then in the evening, we come back. That's it, nothing else.' Ahmed became an international cricketer after fleeing his home in Pakistan and settling in Australia as an asylum seeker in 2010 at the age of 28. He made five international appearances for Australia across ODI and T20I matches after being granted citizenship in 2013. Melbourne Share or comment on this article: Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-23 22:18:08","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_154x115px.png","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7080b9e8fb88f49eac25af0ad1c79e4e","title":"NOCSL celebrates Hangzhou heroic accomplishments at Asian Games 2023","link":"https://www.ft.lk/sports/NOCSL-celebrates-Hangzhou-heroic-accomplishments-at-Asian-Games-2023/23-754402","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The National Olympic Committee of Sri Lanka yesterday celebrated and recognised the victorious Lankan athletes who brought honour to the motherland at the 19th Asian Games in Hangzhou. The Lankan athletes ended up in the 26th position out of 45 Asian countries and territories, with a total of five medals; a gold, two silver and two bronze to their credit. The medal winners as follows. 1. Tharushi Karunarathna: Gold Medal-Women’s 800m Final – 2 minutes. 03.20 secs 2. Women’s Relay Team (Nadeesha Ramanayaka, Jayeshi Uththara, Sayuri Mendis and Tharushi Karunarathna): Bronze Medal-Women’s 4*400m Relay Final – 3 minutes. 30.88 secs. 3. Men’s Relay Team (Aruna Dharshana, Kaushika Keshan, Rajitha Rajakaruna and Kalinga Kumarage): Bronze Medal-Men’s 4*400m Relay Final - 3minutes. 02.55secs 4. Nadeesha Dilhani Lekamge: Silver Medal-Women’s Javelin Throw - 61.57m (New Personal Best) 5. Women’s Cricket Team (Captain - Chamari Athapatthu, Vice-Captain - Oshadhi Ranasinghe): Silver Medal-Women’s Cricket Final-SL vs IND - SL lost by 19 runs Speaking at the felicitation ceremony, National Olympic Committee of Sri Lanka Secretary General Maxwell de Silva said, “An Asian medal after 2014 and athletic medals after 2006 augurs a new lease of life to Lankan athletes and its future. We saw this upstage of performances at the humongous stage like the Asian Games and that was a culmination of the Lankan athletic contingent believing in themselves and usurping each other’s strengths to showcase that they too belong to the real big stage. The medal doors were opened by the women’s cricketers who jumped one scale higher and brought home a silver over the bronze that they won in 2014 in Incheon.” The Lankan track took a different turn; the Lankan athletes were upbeat. Then they faced the mixed relay conundrum that turned silver into oblivion, but that setback also gave more strength to change the status quo. This was proved true when Javelin thrower Dilhani Lekamge took the camp by surprise when she completed her personal best with a throw of 61.57m to take the silver. This followed the triple medal day where Tharushi won the women’s 800m gold followed by women’s and men’s relay team winning 400m bronze medals culminating one of the most joyous days in Lankan athletic history. Taking a bow to Chef-de-mission in Hangzhou Nishanthe Piyasena who lead the logistical aspects besides leading the contingent, Professor Chathuranga Ranasinghe who kept the close tab of the medical needs of the athletes, said that they too played a huge role in Lankan team’s impressive accomplishments. De Silva added, “We consider this as just a beginning. Besides the medal winners, there were others who also could have stood on the podium with a stroke of luck or guidance. So, this is the time to look to the future. We have to work hand-in-hand with the Ministry of Sports to seek and set up ways to sustain and nurture the talent in short and long-term programmes and we are already at it.” Pix by Lasantha Kumara","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"0cc780b4cf5ef6a99ca4c2771cc0129a","title":"Pathirana ruled out of World Cup","link":"https://www.ft.lk/sports/Pathirana-ruled-out-of-World-Cup/23-754404","keywords":null,"creator":null,"video_url":null,"description":null,"content":"It has been confirmed that fast bowler Matheesha Pathirana has been ruled out of the ongoing Cricket World Cup and will return home. Pathirana failed to pass a fitness test on his injured bowling arm and will be replaced by one of the three travelling reserves Dushmantha Chameera, Angelo Mathews or Dasun Shanaka. Sri Lanka will take a decision on the replacement for Pathirana before forwarding the player’s name to the Event Technical Committee of the ICC for approval. Meanwhile, Maheesh Theekshana who underwent a scan for a troublesome hamstring is to continue training with the Sri Lanka squad in preparation for their next match against England at Bengaluru on Thursday, while the report is still awaited.","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"6ad974a7188f34d25d290f8217f96386","title":"Afghanistan causes another upset, trounce Pakistan by a convincing 8 wickets","link":"https://www.ft.lk/sports/Afghanistan-causes-another-upset--trounce-Pakistan-by-a-convincing-8-wickets/23-754405","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Afghanistan who outplayed England in the cricket World Cup pulled off a second shock when they defeated Pakistan comprehensively by eight wickets at the MA Chiddambaram Stadium here Monday to record their first win over them in eight ODI contests. It was a creditable win for the Afghans who chased down Pakistan’s total of 282-7, to win two matches in a World Cup for the first time in their history. It was also their highest and successful run chase in an ODI. The stage for this historic win was set by openers Rahmanullah Gurbaz (65 off 53 balls, 9 fours, 1 six) and Ibrahim Zadran (87 off 113 balls, 10 fours) who shared a partnership of 130 off 127 balls. Rahmat Shah (77* off 84 balls, 5 fours, 2 sixes) and skipper Hashmatullah Shahidi (48* off 45 balls, 4 fours) continued the good work to see Afghanistan home with an unbroken stand of 96 off 93 balls as Pakistan’s game simply fell away on the face of Afghanistan’s assault. Babar Azam’s 30th ODI fifty and a big-hitting cameo from Iftikhar Ahmed led Pakistan’s strong batting display and helped them to 282/7 on a bone-dry surface. As many as 38 overs were bowled by the spinners, which is the third-most bowled in a World Cup match. Things looked on the upswing for Pakistan when Abdullah Shafique swung a Naveen-ul-Haq delivery for a maximum in the fifth over. It was the first six hit by a Pakistan batter in the PowerPlay in 2023. Both openers, Imam-ul-Haque and Shafique, looked at ease against the new ball and made use of the best batting conditions on offer to post a 56-run opening stand. Shafique continued his good World Cup form and raised a run-a-ball 50 (5 fours, 2 sixes) his second in the tournament to go along with a hundred. It was Noor Ahmad, in the side for Fazalhaq Farooqi, who broke the 54-run stand with wickets in back-to-back overs. The left-arm leggie first trapped Shafique lbw and then drew a top-edge from Mohammad Rizwan, leaving Pakistan struggling on a tough surface to score. Another 43-run stand between Babar and Saud Shakeel brought in some relief for Pakistan but Mohammad Nabi broke that stand, getting Shakeel caught at mid-on after a flurry of dots. However, it was Noor’s dismissal of Babar for 74 (92 balls, 4 fours, 1 six) in the 42nd over that really threatened to knock the wind out of Pakistan. Luckily for them, Iftikhar (40 off 27 balls, 2 fours, 4 sixes) and Shadab Khan (40 off 38 balls, 1 six, 1 four), back in the side for ill Mohammad Nawaz, together added 73 runs for the sixth wicket. Noor, the youngest player to feature in this World Cup at 18, returned figures of 3 for 49 in his first World Cup match and helped Afghanistan with breakthroughs on a day their lead spinner Rashid Khan went wicketless. Scores: Pakistan 282-7 (50) (Abdullah Shafique 58, Babar Azam 74, Saud Shakeel 25, Shadab Khan 40, Ifthikar Ahmed 40, Naveen-ul-Haq 2/52, Noor Ahmed 3/49) Afghanistan 286-2 (49) (Rahmanullah Gurbaz 65, Ibrahim Zadran 87, Rahmat Shah 77*, Hashmatullah Shahidi 48*)","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"92076af31fc5746239499c08a1a2a5e0","title":"Sri Lanka cricket what it was and what it is today","link":"https://www.ft.lk/sports/Sri-Lanka-cricket-what-it-was-and-what-it-is-today/23-754406","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka’s cricketing standards at international level has dipped so low that it’s a crying shame to see that beating an associate member team like Netherlands can amount to being called an achievement. Past Sri Lankan teams have simply swept away the opposition that a country like Netherlands possess, but today’s side lacks those quality players and the experience that goes with it to make winning look more convincing. No doubt, Netherlands has grown as an international cricket side over the years, but when countries like Pakistan and New Zealand are simply sweeping them aside hardly raising a sweat, that’s where the difference lies between a team like Sri Lanka and the rest of the top ODI sides. Without a win in three matches of the ongoing Cricket World Cup, Sri Lanka were desperate to beat Netherlands and chalk up their first points. They eventually did so, but not with the ease which one would have associated a Sri Lanka side to win, it was one hard struggle to get to the target of 263 that they consumed 48.2 overs. It was tough going no doubt in the middle, with the ball holding up and stroke making not all that easy, but what made it difficult for Sri Lanka to score was the discipline in the lines and lengths maintained by the Dutch bowlers. It is an area where the Lankan bowling unit should learn from. They simply bowled wicket to wicket and made the batsmen play at almost each and every delivery. The other notable aspect was that Netherlands were never afraid to keep their fielders inside the 30-meter circle and attack the batsmen challenging them to go over the top at their own peril. We hardly see Sri Lanka keep so many fielders inside the circle, but always outside it which amounts to a defensive ploy. One could say that the Sri Lanka team is going through a transition period and that the side lacks experience in its bowling unit with so many injuries to its key bowlers who were not available for the World Cup. But the same cannot be said of the batting where the talent is there but the execution and judgement is poor. The batsmen have still not learnt to build an innings. How many times have we seen the batsmen doing all the hard work and then simply throwing away his wicket? This has been Sri Lanka’s achilles heel with this present unit as we have seen in their matches of the World Cup against Pakistan and Australia, matches they could have won had it not been for the batsmen’s indiscretion. This young Sri Lanka unit is extremely talented and has the makings of achieving bigger things if they are kept together for the next 2-3 years without meddling too much with it. Injuries are part and parcel of sport and like the weather you cannot control it. It is just sheer bad luck if you lose your best batsman or best bowler ahead of a major tournament like the World Cup. For a tournament as big as the Cricket World Cup, experience plays a big part because of the pressures the players have to absorb in the middle, the expectations, the spectators, the conditions and to keep the motivation going for the length of the tournament. Sadly, Sri Lanka left their experience at home and are paying a heavy price for it.","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"3594af38508bbcf561078630d623591e","title":"Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table","link":"https://www.dailymail.co.uk/sport/live/article-12661711/Tottenham-vs-Fulham-Premier-League-2023-24-Latest-Result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Read how Mail Sport's live blog covered Tottenham's game with Fulham, with the hosts moving back to the top of the Premier League with a win.","content":"Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table By Samuel Draper For Mailonline Published: 18:45, 23 October 2023 | Updated: 23:32, 23 October 2023 e-mail 9 shares 293 View comments Read how Mail Sport's live blog covered Tottenham 's game with Fulham , with the hosts moving back to the top of the Premier League with a win. This live blog has now closed. 21:34 Thank you for following along tonight Thank you for following along with the blog tonight. An impressive win for Ange Postecoglou's side, and one they will hope to build on as the season progresses. Keep an eye across Mail Sport for the latest reaction to tonight's match, and looking ahead to a bumper week of fixtures too. Have a good night and we'll meet again soon. Goodbye. 21:33 Riath Al-Samarrai's match report Mail Sport's Riath Al-Samarrai was on hand at the Tottenham Hotspur Stadium to give his rundown of the 2-0 win for the hosts that sent them back to the top of the Premier League. Tottenham 2-0 Fulham: Son Heung-min and Maddison fire Spurs back top RIATH AL-SAMARRAI AT THE TOTTENHAM HOTSPUR STADIUM: Back from their break and back in the groove. The hope and possibility will soon throw Spurs into a wall of reality, but not yet. Mail Online 21:05 Son and Maddison hit double top You can tell how much those two enjoyed it, as Spurs went back to the top of the Premier League after a long weekend of action. They started in fourth, but they're first now. And could move five points clear on Friday... Early days, of course, but a statement from Ange Postecoglou's men. 20:57 FULL TIME: Tottenham 2-0 Fulham Tottenham back on top of the Premier League. Son and Maddison giving the three points to the hosts, after a wave of defensive errors from Fulham. 20:54 Tottenham 2-0 Fulham Wilson comes into the box, but Tottenham are able to block the opportunity. Looks like that clean sheet stays intact! 20:54 Tottenham 2-0 Fulham Four minutes into stoppage time, and Fulham are searching in vain for a consolation. Tottenham more than happy to see this one out. 20:49 Tottenham 2-0 Fulham Seven minutes added on 20:49 Tottenham 2-0 Fulham Fulham push but can't find a way to create a clear chance for a goal. Tottenham counter, but it is flagged as offside. 20:47 Tottenham 2-0 Fulham Cairney takes a shot, but Vicario is able to hold it. Nothing going Fulham's way tonight. 20:46 Tottenham 2-0 Fulham Postecoglou heading for eight wins in his first nine PL games, one of the best starts for a manager in the league ever. He won't care about individual stats though - the three points send Spurs top. 20:44 Tottenham 2-0 Fulham - Vicario booked The Tottenham goalkeeper goes into the book for timewasting. 20:44 Tottenham 2-0 Fulham Jiminez shoots straight at the keeper. Fulham needed that to go in! 20:42 Palhinha makes way for Cairney Another change for Fulham too, for the last eight minutes or so. 20:42 Triple change for Spurs including both goalscorers coming off Richarlison and the goalscorers Maddison and Son make way. Johnson, Lo Celso and Veliz come on for the last few minutes. Son looks reluctant to come off, but hands the captain's armband to Romero. 20:39 Tottenham 2-0 Fulham Ten minutes plus stoppages for Fulham to try and rescue something, and for Spurs to hold onto the top spot in the Premier League. 20:39 Tottenham 2-0 Fulham Wilson and Richarlison both go down in a challenge, so the referee brings the game to a halt, but it looked like a rather 50-50 thing, just a basic collision, and both players are able to get back on their feet and keep going. 20:37 Tottenham 2-0 Fulham The game has slowed a little bit in this second half. Spurs know the job is done, unless they let it slip, and Fulham don't quite have the ability to turn this game completely on its head. Tottenham may have one eye on Friday night already... 20:35 Tottenham 2-0 Fulham Bassey loses it again, and Maddison capitalises. He seems to get in Son's way - or maybe it was vice-versa - and the shot isn't as effective as it should have been. A let off for Fulham, and a let off for Bassey, but a lot of the focus will be on his errors in this game that have led to the goals... 20:34 Tottenham 2-0 Fulham Wilson goes down after being caught by a Spurs player's studs on his knee. Innocuous, but probably stung. Luckily, the substitute is back to his feet for the rest of this one. 20:31 Harrison Reed on for Fulham He replaces Sasa Lukic for the last 20 minutes or so 20:30 Tottenham 2-0 Fulham Maddison swings in a free-kick from out wide but it evades everyone and goes out for a Fulham goal-kick. 20:28 Tottenham 2-0 Fulham Porro makes a great pass into the box for Son, but Bassey is just able to take the ball off the Spurs captain. 20:25 Tottenham 2-0 Fulham Fulham have had just one shot on target in this match - which was a superb save - but they're going to have to find a way to make the goalkeeper work, or this is only going to end one way. Alex Iwobi is just offside, as Fulham look to make something happen. 20:24 Fulham substitution Marco Silva makes his third change, De Cordova-Reid making way for Harry Wilson. 20:23 Tottenham changes In the aftermath of the goal, Udogie made way for Emerson. Then Sarr was taken off to be replaced by Oliver Skipp. 20:21 When James Maddison got his first home Spurs goal A moment to celebrate for Maddison, as he finally got a goal at the Tottenham Hotspur Stadium for his new club after the summer move. 20:19 Tottenham 2-0 Fulham Willian passes to Robertson, but his ball across the box is too far and it goes out for a throw-in on the other side. Fulham searching for something... 20:18 Tottenham 2-0 Fulham Fulham have to go for it now, after falling two behind, but they might not find it easy. Then again, Vicario comes out of his box and makes a poor header which is intercepted by Willian. Unfortunately for him, he can't quite run into the box with it, and the Tottenham defender makes a sliding tackle to clear the danger. 20:14 Tottenham 2-0 Fulham - GOAL! Maddison 54' James Maddison gets his first goal for Tottenham at their Stadium. The home crowd have a new hero. Bassey makes a terrible pass, and Son intercepts, before gifting it on a plate to the former Leicester City man. He's able to slide it under Leno, and make it 2-0 to the hosts. Tottenham going top as it stands. 20:12 Tottenham 1-0 Fulham Fulham earn a free-kick about 30 yards out, with Willian standing over the ball. He clips the ball into the box, but Spurs are able to head it out for a throw-in. 20:11 Tottenham 1-0 Fulham Kulusevski bursts forward, who plays it across to Son, who plays it to Richarlison, who enters the box, but sends the ball skyward. It felt like an opportunity for Spurs, but it amounts to nothing. 20:08 Tottenham 1-0 Fulham Taking a little while for this second half to really get going. Tottenham trying to find their way past a stubborn Fulham side. 20:05 2nd half underway: Tottenham 1-0 Fulham 20:04 Fulham make two changes at HT Jiminez and Iwobi on for the second half, Silva choosing to take off Vinicius and Pereira at the half-time interval. 20:02 Tottenham going back top as it stands Can they hold onto the lead? 20:01 Only one booking in that first half Hojbjerg was put into the referee's book, moments before Tottenham took the lead, but he'll have to be cautious in the second half. So far, the referee has not turned to cautions to deal with offences, which I think has helped the game to flow, but some fans will inevitably disagree! 19:58 What changes will the sides make at the break? Fulham did well to contain Spurs, and had their own chances, but nothing really close to delivering a real danger to Ange Postecoglou's side. Can they switch it up? For Tottenham, they must want more of the same, but to get more clinical too, and put away some of their promising attacking spells. 1-0 is never enough. 19:50 Half-time: Tottenham 1-0 Fulham Son Heung-min splits the sides at the break 19:48 Tottenham 1-0 Fulham Bassey seems to catch a Spurs player in the box, and whilst there's calls for a penalty, the man in the middle and the men in the VAR room aren't swayed. 19:47 Tottenham 1-0 Fulham Two minutes of additional time in this first half 19:46 Tottenham 1-0 Fulham Fulham's Willian once again races into the box, but he's caught between a shot or making a pass, and ends up doing neither. Tottenham are also driving forward themselves. The ball seems to get caught in Maddison's feet though... 19:43 Tottenham 1-0 Fulham Willian plays the ball across the box for Fulham, but De Cordova-Reid's header is deflected out for a corner for the visitors. That corner is headed out, and then flagged for offside. 19:42 Tottenham 1-0 Fulham The hosts try to get a second, Kulusevski takes a shot, but it's deflected wide for a corner. Porro takes an ambitious shot from halfway down the half when the corner amounts to nothing, and earns another corner in quick succession. Fulham manage to deal with that one too -but Spurs with all the pressure as they look to double their advantage before the break. 19:39 Tottenham 1-0 Fulham Tottenham keep up their habit of scoring in every game. What can Fulham do now? 19:37 Tottenham 1-0 Fulham - GOAL! Son 36' Fulham lose the ball, and Tottenham take over. Richarlison nudges the ball into Son's path, and the South Korean captain is able to curl a beautiful shot from the edge of the penalty box. Nothing Leno could do about that. The hosts go 1-0 up. 19:37 Tottenham 0-0 Fulham - Hojbjerg goes in the book First booking of the game goes to Hojbjerg 19:35 Tottenham 0-0 Fulham James Maddison tries to make something happen, he is a man who clearly wants the ball at his feet, but he's only able to make a tame shot which is no trouble for the Fulham goalkeeper. 19:34 Tottenham 0-0 Fulham - penalty shout not given Udogie is in the box, trying to play the ball across to a Spurs teammate, but it hits the defender instead. He's adamant it hit a hand, but VAR were quick to check it... and given nothing. 19:32 Tottenham 0-0 Fulham - Richarlison goes just wide Kulusevski made that chance, as Spurs come blistering down the wing, and he cuts into the box, and maybe he could go for the shot, but instead he lays it off to Richarlison, who puts it wide. If the Brazilian had hit the target there, Leno would have had his work cut out... 19:29 Tottenham 0-0 Fulham Straight down the other end, Hojbjerg blasts a shot straight at Leno, which blisters the Fulham keeper's hands, but is easy for him to gather. 19:28 Tottenham 0-0 Fulham Sloppy from Vicario to play the ball straight to Willian, but Fulham aren't able to create enough space to make anything happen. The Spurs goalkeeper lifts his hand up to his teammates to apologise for his miskick,but no damage done. 19:27 Tottenham 0-0 Fulham Twenty-five minutes played, and nothing seperating these sides yet. 19:25 Tottenham 0-0 Fulham Willian makes a brave pass, but it's intercepted. Maddison bursts into the box, but that amounts for nothing. An entertaining exchange, but nothing clear cut to show for it yet. 19:24 Tottenham 0-0 Fulham Palhinha goes in for a tough tackle, and brings down Udogie in the middle of the park. It creates a brief spark, but the referee is able to disperse the tension without resorting to his cards. 19:22 Tottenham 0-0 Fulham Willian tries to cut from inside, but he's not given space, and the promising attack flutters away. Fulham get another corner moments later, but it sails into Vicario's hands. 19:20 Tottenham 0-0 Fulham Willian - who was expected to sign for Spurs once upon a time - was brought down on the left. Fulham try to play the free kick into the middle of the park, but make a mess of it. Somehow, they get the ball into the box, but Carlos Vinicius needed to do something more effective with the header as it softly goes wide. 19:18 Tottenham 0-0 Fulham Spurs looking to stretch Fulham, but not finding the way forward like they did in the early stages. 19:14 Tottenham 0-0 Fulham - Vicario makes superb save! The corner comes across, and there's a fierce goalbound header from Joao Palhinha, which Vicario is able to tip away, and Spurs clear their lines. There's a reason why Vicario has the best save percentage in the Premier League this season! 19:12 Tottenham 0-0 Fulham Just as I post that, the visitors get forward, and it looks promising, but Romero heads it out for a Fulham corner. 19:12 Tottenham 0-0 Fulham The first ten minutes are played, and it's all Tottenham so far. 19:11 Tottenham 0-0 Fulham A third dangerous free-kick for Spurs, with the referee deeming the contact on the edge of the box despite penalty protestations. Kulusevski takes a blistering shot which is deflected and loops up, but it amounts to nothing. 19:10 Tottenham 0-0 Fulham - Spurs make new chance with free-kick Spurs get another free kick on the edge of the box, and they're more ready for it this time. It's lifted over the wall and across the danger zone, but it's knocked over the bar. 19:05 Tottenham 0-0 Fulham The free kick was played wide by Maddison, and it would have been a smart move, but it seemed to catch Udogie unawares, and Fulham clear their lines. 19:04 Tottenham 0-0 Fulham Tottenham's Son has the first good chance, Maddison playing the ball through to him, but he hits it straight against the keeper. The hosts now have a free-kick about 25 yards out. 19:02 Kick-off: Tottenham 0-0 Fulham After the players take the knee, Fulham get things going at the Tottenham Hotspur Stadium. 19:00 Players gather for a moment of silence Both teams gather at the centre circle for a moment of silence to honour the tragic events taking place in Israel and Gaza this month. 18:58 Marco Silva has never beaten Spurs in the Premier League Does that streak end today? 18:57 Can Spurs reclaim top spot? The players walk out onto the pitch for the final Premier League game of the weekend. 18:55 The players are in the tunnel The waiting is almost over. 18:55 Fulham's Marco Silva on tonight's test Fulham boss Marco Silva told Sky Sports: 'It’s a big test for us definitely. But we like this type of challenge. When we test ourselves at this level, we like it. I believe the Premier League is a test. It’s a moment to test ourselves.' 18:52 The warm-ups are done Who will start brightest? Will it take until stoppage time for Spurs to win another home game? 18:48 It's 4th versus 13th Will Spurs win and go top, will Fulham win and move into the top half? We're counting down to the action. 18:45 15 minutes to go What's Fulham's thought process going into this? They're the only team to have defeated Ange Postecoglou's Spurs so far, but can they replicate that magic once again, without the help of a penalty shootout? 15 minutes until the game gets going in North London... 18:40 Spurs have a quick turnaround Spurs play tonight and again on Friday night, as the TV pick once more for their trip to Crystal Palace. Fulham have an extra day and a half to recover for their trip to Brighton, who will be in Europa League action on Thursday. 18:36 Son getting warm in North London 25 minutes or so until things get underway at the Tottenham Hotspur Stadium 18:30 Tottenham three home wins on the bounce Tottenham have three home wins on the bounce so far in the Premier League season. They left it late against Sheffield United, and against Liverpool- you expect Ange Postecoglou would prefer to have this one settled far ahead of stoppage time,. 18:25 Calvin Bassey arrives What difference will he make to Fulham, as they look to build on their win against Sheffield United a couple of weeks ago? 18:15 Ange Postecoglou on Romero's return The Tottenham boss has been talking to Sky Sports about the return of Romero for the game tonight. 'Us playing on Monday night is pretty beneficial for our international boys. And having the extra few days for all of them has been excellent,' the Australian said. 'Romero has been super important to us. We’ve got a new goalkeeper, centre-back and new left back and a right-back who’s adjusting to a new position – having a World Cup winner among them gives a lot of comfort.' 18:12 Last time out was in August These sides met in the second round of the League Cup at the end of August, and Fulham won 5-3 on penalties after a 1-1 draw across the 90 minutes. Micky van de Ven put into his own goal to give Fulham the lead within 20 minutes, but Richarlison equalised for Tottenham just over ten minutes into the second half. Will that result have any bearing on tonight's proceedings? 18:08 Fulham make two changes Calvin Bassey replaces Issa Diop, who misses the trip across London with a foot problem. That's one of two changes for Fulham, the other sees Sasa Lukic stepping into midfield, replacing Alex Iwobi. 18:06 One enforced change for Tottenham Just the one enforced change for Ange Postecoglou tonight. Yves Bissouma is suspended after his red card against Luton, so Pierre-Emile Hojberg comes in. 18:02 Team news is here Romero is fit for Tottenham, so they make just one change. Calvin Bassey makes just his second start for Fulham, coming back into the side, while Carlos Vinicius, ex-Spurs, starts for the visitors. Full team news coming. 18:00 Jamie Carragher on Tottenham Carragher spoke to Sky Sports on Spurs: 'I don’t think they [Spurs supporters] are getting too carried away in terms of thinking about the title. I think you’d be delighted about the Champions League positions. 'But its not just about results here, it’s about the football they’re playing, and the fact that Tottenham supporters are looking going to the game, looking forward to watching their team play – which it has been, maybe not so much under Conte, but maybe under Jose, Nuno – all a certain kind of manager and that’s where the excitement comes from.' 17:58 Fulham hope to climb the table Marco Silva's visitors start in 13th after the rest of the league's action this week, but they'll move into the top half if they get the win at the Tottenham Hotspur Stadium. A draw will leave them behind 10th-placed Chelsea on goal difference, whilst a defeat would leave them behind Crystal Palace and Wolves too. Their next match after tonight is Sunday's trip to Brighton. 17:50 Tottenham's chance to kick on Few clubs would have been as disappointed as Tottenham to herald the start of the last international break. Ange Postecoglou's side have had an unshakeable start to their Premier League season, and after a gritty win at Luton Town, sat top of the table. But the disruption is unlikely to have done too much to dent sky-high aspirations in north London. With tonight's kick-off, the team have had the longest for players to recover after returning from far-flung national team destinations, and Postecoglou was lucky to have avoided any injury to team talismans - although there was likely a sharp intake of breath at the Tottenham Hostpur Stadium when Son Heung-min limped down the tunnel at half-time during a friendly against Vietnam. In fact, the international break may have even boosted confidence in the camp - James Maddison continued his club form in England colours, and Destiny Udogie and Micky van de Ven were both handed senior debuts. 17:44 James Maddison is loving his blossoming bromance with 'nice guy' Son Heung-min... as Tottenham's £45m summer signing hails the impact of Ange Postecoglou's 'alpha male' management And they thought bromance was dead. For so long, there was only one unbreakable Tottenham double act in town. Harry Kane to Son Heung-min , Son Heung-min to Harry Kane. No pairing in Premier League history combined for as many goals as those two Spurs team-mates. Few made that boyish grin spread across Son's face like the England captain. After Kane's move to Bayern Munich , you wondered if anyone would ever be able to again. Step forward, James Maddison . READ MORE BELOW. James Maddison is loving his blossoming bromance with Son Heung-min INTERVIEW BY JAMES SHARPE: Few made that boyish grin spread across Son's face like Kane. After Kane's move to Bayern, you wondered if anyone would be able to again. Step forward, Maddison . Mail Online 17:42 Good evening! Hello and welcome to Mail Sport's live blog of the final Premier League tie of the weekend, with Tottenham inviting Fulham to north London to see if they can extend their unbeaten league run against the Cottagers. Kick-off is at 8pm, but stick around as we bring you all the team news, build-up, and more ahead of the whistle. Key Updates Riath Al-Samarrai's match report View post FULL TIME: Tottenham 2-0 Fulham View post Tottenham 2-0 Fulham - GOAL! Maddison 54' View post Fulham make two changes at HT View post Half-time: Tottenham 1-0 Fulham View post Tottenham 1-0 Fulham - GOAL! Son 36' View post Tottenham 0-0 Fulham - Hojbjerg goes in the book View post Tottenham 0-0 Fulham - penalty shout not given View post Tottenham 0-0 Fulham - Vicario makes superb save! View post Kick-off: Tottenham 0-0 Fulham View post Last time out was in August View post Fulham make two changes View post One enforced change for Tottenham View post Team news is here View post James Maddison is loving his blossoming bromance with 'nice guy' Son Heung-min... as Tottenham's £45m summer signing hails the impact of Ange Postecoglou's 'alpha male' management View post TOP STORIES Legendary commentator Martin Tyler set to return to the gantry four months after leaving Sky Sports to once again call a live Premier League game Tottenham 2-0 Fulham: Son Heung-min and James Maddison fire Spurs back to the top of the Premier League as Ange Postecoglou's side capitalise on defensive errors THE NOTEBOOK: Israel flags are held aloft, Ange Postecoglou makes a mockery of the manager of the month curse and Destiny Udogie epitomises Tottenham's fluidity in win over Fulham Tottenham fans pictured waving Israel flags during their clash against Fulham despite Premier League ban amid Palestine conflict Jamie Carragher argues Spurs fans would be 'delighted' with a place in the Champions League spots on Monday Night Football... and Wolves manager Gary O'Neil praises Ange Postecoglou's outlook Bayern Munich 'could be ready to raid Tottenham AGAIN' in January as Thomas Tuchel 'weighs up reuniting Harry Kane with a forgotten former team-mate' James Maddison is loving his blossoming bromance with 'nice guy' Son Heung-min... as Tottenham's £45m summer signing hails the impact of Ange Postecoglou's 'alpha male' management Jack Grealish meets up with his 'first football hero' at Man City's training ground... but can you recognise the iconic ex-Premier League striker? Harry Kane made his start to life at Bayern look EASY: He's scored for fun, embraced the culture and looks settled... only injury or an almighty collapse will stop him from finally winning trophies this season Jack Grealish has been OVERTAKEN by Jeremy Doku at Man City, claims CHRIS SUTTON as he says the England star will be 'a little bit worried' after the Belgian 'nailed down' his spot under Pep Guardiola on It's All Kicking Off Ange Postecoglou hopes Tottenham can provide 'escapism' to supporters affected by the war between Israel and Hamas as he looks to provide 'solace or comfort' to fans The festive football feast! Premier League clubs are braced for the league to schedule football every day except Christmas Day from December 22 until at least January 2 - with Arsenal v West Ham set to move back two days Harry Maguire has regained Erik ten Hag's trust and will be key as Man United face a derby with City and must-win games in Europe... the defender was written off but his professionalism could teach sulking Jadon Sancho a thing or two Sir Bobby Charlton's last surviving brother, Tommy, 77, makes heartfelt tribute to Man United legend following his death, saying: 'If ever there was a place reserved in heaven, it is for Bob' Pep Guardiola was WRONG to sell Cole Palmer to Chelsea, says Dominic King after the £42.5m winger scored against Arsenal... but Chris Sutton says you can't doubt the City boss' judgement as hosts clash on Mail Sport's It's All Kicking Off Strictly Come Dancing couple Janette Manrara and Alijaz Skorjanec drop surprise hints at baby number two - just three months after welcoming daughter Lyra Rose Man City's fury at fans' sick Sir Bobby Charlton chants: Man United's rivals apologise to football legend's family, as video emerges of chanting at their game shortly after he died aged 86 Former Man United star Andreas Pereira reveals his bizarre pre-match leg-rubbing superstition... and it's all linked to his love for Brazil icon Kaka Both Kalvin Phillips and Manchester City think it's 'very likely' he'll leave the club in January... with the out-of-favour midfielder keen to escape the Etihad in a bid to keep his England place ahead of Euro 2024 Luke Shaw expected to be OUT for another FIVE WEEKS, missing vital games against Man City and Copenhagen in the Champions League - but there's finally good injury news as Aaron Wan-Bissaka nears a return Tottenham issue BAN on national flags for game against Fulham - and tell fans a Premier League match 'is not an appropriate arena to display' them England 15-16 South Africa - Rugby World Cup semi-final RECAP: Agony for England as South Africa steal victory with a late penalty kick after leading for just TWO minutes in the game High-achieving pupil, 17, was stripped of his maths GCSE after exam question he found online during last-minute revision appeared on his exam paper I was once former Manchester United boss Louis van Gaal's favourite player, but now I'm struggling for game time in Poland Micah Richards reveals how he downed TEN drinks from a minibar the night before a Man City game - and tried to talk his way out of playing with Manuel Pellegrini after admitting boozing to the doctor Mauricio Pochettino fires a warning at one of his Chelsea stars - insisting he 'NEEDS to improve' and 'is not at his best' - as he reveals why he took him off during their 2-2 draw with Arsenal EXCLUSIVE INTERVIEW: Andy Carroll speaks on his new life in France's second division, wasting cash on a bengal cat, eating roast beef and Yorkshire pudding on matchdays and buying Sir Rod Stewart's Essex mansion Mauricio Pochettino jokes he would be 'KILLED' if he didn't start £222m stars Enzo Fernandez and Moises Caicedo in Chelsea's draw with Arsenal Man United stars are accused of IGNORING Rasmus Hojlund as Ruud Gullit claims they 'don't look for' the £72m Danish striker after he struggled in the win over Sheffield United Carlton Morris says 'fearless' Luton Town deserve to be in the Premier League as the Hatters star striker says they CAN stay up despite a stuttered start to life in the top flight Sir Bobby Charlton dies RECAP: The world reacts to the death of the World Cup winner and former Man United star at the age of 86 IN THE MONEY: Sir Jim Ratcliffe's Manchester United investment faces yet more delays over Old Trafford improvements... as both Chelsea and Newcastle plot their own ground expansions Raheem Sterling and Cole Palmer tussle over penalty in clash with Arsenal... but it's the former Man City academy startlet who wins the ball to open the scoring at Stamford Bridge Hannah just thought she was being clumsy, but her bruises were a sign she needed to see her doctor William Gallas names FOUR Premier League defenders who are better than William Saliba - including a Chelsea star - before telling fans to 'calm down' about the Gunners ace who is NOT world class East London pie and mash is mocked by foreign foodies who joke Britons 'eat like it's still WW2 and they've got to ration the food' Erik ten Hag bluntly tells Andre Onana to 'step up' and 'give better performances' after £47m goalkeeper's error-strewn start to his Man United career... but backs his ex-Ajax stopper to come good Mohamed Salah IS Liverpool's greatest ever player in the Premier League era - not Steven Gerrard - claims Mail Sport's Chris Sutton on It's All Kicking Off... and believes only one player in the top-flight's history is more ruthless Multiple Palestine flags held up at Anfield during Merseyside derby between Liverpool and Everton, despite the Premier League banning flags from matches this weekend to avoid potential incidents Dave Courtney's best friend reveals ex-gangster's last words before he shot himself with a pistol Tube driver who led chant of 'free, free Palestine' on London Underground train is suspended, TFL says Real Madrid 'eye a surprise move to lure Man City striker away from Pep Guardiola's squad', as Carlo Ancelotti looks to boost Los Blancos despite the lack of a release clause for the hit man US Grand Prix - Race LIVE: Max Verstappen overtakes Lando Norris to grab the lead in Austin, with Lewis Hamilton in second 'Very dirty' portrait of Mary Magdalene which was sold by London gallery to French collector for just £30,000 is actually the work of Italian renaissance master Raphael Could Bournemouth's Andoni Iraola be the first Premier League manager to be sacked? Cherries boss faces scrutiny with no win in his nine games Manchester United legends including Gary Neville and Brian Kidd join current squad and boss Erik ten Hag in signing messages of condolence in memory of Sir Bobby Charlton Barcelona kid Marc Guiu, 17, scores the winner just 30 seconds after coming off the bench for his debut as Xavi unearths another gem to put his side a point behind Real Madrid Why was Lewis Hamilton DISQUALIFIED four hours after coming second at the United States Grand Prix? Max Verstappen's model girlfriend is left SERIOUSLY unimpressed as he's booed after winning the US Grand Prix ahead of disqualified Lewis Hamilton Toto Wolff is backing Mercedes to learn from their mistakes and 'come back stronger' after taking Lewis Hamilton's disqualification from the US Grand Prix 'on the chin' EXCLUSIVE: Jose Antonio Reyes' father says his son and Mikel Arteta were 'like brothers' as his family open their doors to Mail Sport ahead of an emotional night as Arsenal and Sevilla face-off in the Champions League Manchester United confident rival Man City fans will respect minute's applause held for Sir Bobby Charlton ahead of Sunday's derby clash Ange Postecoglou slams his Tottenham side 'for taking liberties in possession' while claiming Spurs had 'the WORST 45 minutes we've had all year' despite now going nine games unbeaten in the Premier League after 2-0 win against Fulham EXCLUSIVE: Taylor Swift and Travis Kelce arrive at the Chiefs star's mansion in his Rolls Royce for party with friends and family catered by Kansas City BBQ joint - after the loved-up pair left win over Chargers together Harry Kane on cloud nine as he sets Bayern Munich club record by scoring ninth goal in opening eight Bundesliga games in 3-1 win over Mainz Was South Africa's 'white ****' slur lost in translation? Springboks fans say Bongi Mbonambi was speaking in Afrikaans - and Google Translate shows they may have a case Lewis Hamilton is DISQUALIFIED from the US Grand Prix nearly four hours after it finished for running an illegal floor - after Brit had finished second having pushed winner Max Verstappen close Taylor Swift: Travis Kelce's girlfriend shakes it off with Brittany Mahomes to celebrate Chiefs' touchdown, while the pop star gazes adoringly at boyfriend Travis Kelce during Chargers game Taylor Swift fans fume that Jackson Mahomes was allowed in the same Chiefs VIP box as pop superstar as he awaits hearing over alleged sexual battery: 'Someone get her out immediately' EXCLUSIVE: Taylor Swift heads to Travis Kelce's house for lunch of turkey omelet and chicken tacos after flying in from LA on her private jet to watch her man play in a fourth Chiefs game Ireland rugby star strips down to her pineapple-print underwear at Rugby World Cup, as she celebrates 'the party' despite her nation's early exit England's Tom Curry accuses South Africa's Bongi Mbonambi of calling him a 'white c***' in the Rugby World Cup semi-final with alleged racist slur picked up by the referee's mic Alan Jones pictured in blackface at Wallaby 'skit night' during famous Bledisloe Cup winning tour of New Zealand EXCLUSIVE: Travis Kelce pumps gas into his Cadillac en route to the Chiefs' team hotel ahead of clash against the Chargers, but will Taylor Swift be reuniting with him at Arrowhead? First images emerge of Travis Kelce's luxury new $6m Kansas mansion - complete with a swimming pool, waterfall and mini golf course - as he hunts for 'more privacy' amid his fledgling romance with Taylor Swift Shock merger between the PGA Tour and LIV Golf is at risk of collapse as Saudi defectors Phil Mickelson and Ian Poulter both warn of another huge exodus of big-name golfers to the breakaway circuit Taylor Swift may have anointed herself queen of Chiefs Kingdom but Kansas City's 31-17 win against Chargers belonged to boyfriend Travis Kelce Taylor Swift shakes it off next to Brittany Mahomes as they show off special handshake while cheering on their NFL men at Chiefs game KSI hires lawyer after controversial defeat to Tommy Fury, turning to a legal team in a bid to overturn the fight result after being more accurate with his punches Travis Kelce hilariously reveals his mom Donna put him on a LEASH as a child: 'She eventually got p****d and sick of us getting lost' What are Jackson Mahomes' alleged crimes and what has he been charged with? All the latest after he was spotted with Taylor Swift to watch Travis Kelce's Chiefs win Arsenal break silence over all-white squad team photo after race row as they accept their women's team 'does not reflect the diversity that exists across the club' World Rugby launch investigation into Tom Curry's allegation he was called a 'white ****' by South African hooker Bongi Mbonambi during England's Rugby World Cup semi-final defeat in Paris Georgetown University women's basketball coach Tasha Butts dead at 41: Tributes pour in for former star player after two-year cancer battle OLIVER HOLT: Never before have so many apologies been owed by so many to so few... ridiculed before the World Cup England came agonisingly close to one of their greatest EVER upsets against South Africa EXCLUSIVE: Ashlyn Harris loads her luggage into a taxi and heads to Newark Airport as she jets out of New York amid Ali Krieger split... after her ex-wife dropped hint she had cheated on her with new lover Sophia Bush Rapper Blueface proposes to his girlfriend in WILD day at the Rams game... after turning his private suite into a STRIP CLUB and offering rival players wads of cash to throw the game Celtic fans hold up Palestine flags during Scottish Premiership match at Hearts despite criticism from their own club over Palestinian support India cricket legend Bishan Singh Bedi dead at 77: Former spin bowler, who was his country's leading wicket taker before retiring in 1979, passes away after prolonged illness Travis Kelce has nervous 'alarms' going off in his head over new 'level of superstardom' from dating Taylor Swift, reveals his brother Jason: 'Man, this is a lot' That's why you don't look back! German triathlon leader falls a metre from the line to finish second - despite having led the full 13-mile running section before losing out at the death England rugby star hospitalised after brain infection which saw him struggle to open and close his eyes BBC axe football show MOTDX on the sly less than a month after Dan Walker became embroiled in fierce Football Focus row with Alex Scott Travis Kelce hilariously celebrates with a fist-pump as fan screams 'Let's go, Taylor's boyfriend' at him... after pop superstar Swift attended a FOURTH Chiefs game to watch him play Man United deny Jadon Sancho is set to return from his exile after fans thought Erik ten Hag said 'Sancho' and not 'Sergio' in his press conference when asked about fitness of left-back Reguilon Wish you were still here? Man United captain Bruno Fernandes meets up with booted-out goalkeeper David de Gea in Manchester amid £47m Andre Onana's struggles, as fans urge the Spaniard to 'come back in January' Travis Kelce: Taylor Swift's new lover arrives at Arrowhead for Chiefs' game against Chargers, before popstar follows after enjoying lunch at her boyfriend's house SIR CLIVE WOODWARD: These stars proved they are right behind Steve Borthwick - this cruel defeat can be a watershed moment Barcelona reveal CGI footage of their 'insane' stadium's renovation plans which includes a complete upper-tier reconstruction and a new roof emblazoned with their Spotify sponsor Andy Carroll lobs the goalkeeper with incredible 40-yard effort to make it back-to-back goals in as many games for Ligue 2 side Amiens SC ENGLAND PLAYER RATINGS: Ben Earl proves he is the breakthrough star of the whole tournament as Steve Borthwick's side say goodbye to some excellent servants Mary Lou Retton has returned HOME after 'scary setback' in her fight against rare form of pneumonia, as family reveal US Olympic legend is in 'recovery mode' after leaving the ICU Taylor Swift: CBS breaks out hilarious graphic showing Travis Kelce performs better with pop star in attendance and even uses her lyrics London Premier League Ange Postecoglou Share or comment on this article: Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table e-mail 9 shares 22 players on the pitch. Only 1 is English. So muc... by Nice1arry 46 Add comment Comments 293 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-23 21:39:50","image_url":"https://i.dailymail.co.uk/1s/2023/10/23/20/76906633-0-image-m-50_1698090748952.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2e99982288c78786a7928ff09b3dc365","title":"Papers: Gerrard under fire at Al Ettifaq","link":"https://www.skysports.com/football/news/20876/12991288/ajax-to-fail-with-mitchell-van-der-gaag-approach-steven-gerrard-under-fire-at-al-ettifaq-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Tuesday's newspapers...","content":"All the top stories and transfer rumours from Tuesday's newspapers... DAILY MAIL Ajax are likely to fail with any approach to lure Manchester United assistant boss Mitchell van der Gaag back to the club. Manchester United academy prospect Tyler Fletcher has switched his international allegiance back to Scotland from England. David De Gea continued to reunite with his old Manchester United team-mates on Monday, as Bruno Fernandes took to social media to share his 'coffee and friends' date with the goalkeeper and a handful of Red Devils stars. West Ham fans travelling to Greece this week will be wrapped in a protective police cocoon after Olympiakos' most recent match was abandoned amid a vitriolic atmosphere at the Karaiskakis Stadium. THE SUN Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Steven Gerrard is already under pressure from fans at Al Ettifaq. Football fans are reportedly set for a huge festive feast of Premier League action that could potentially see Christmas Day as the only day off from action. Galatasaray's goalkeeper Fernando Muslera has been praised for his incredible, injury-saving gesture to Besiktas' Valentin Rosier. England rugby league star Dominic Young was rushed to hospital after contracting a brain infection that left him unable to open his eyes. Francis Ngannou has thanked Cristiano Ronaldo after the football icon gifted the fighter a £110,000 watch. Jake Paul is set to rematch Nate Diaz in a mixed martial arts bout. DAILY MIRROR Erik ten Hag has suggested he may pair Anthony Martial with Rasmus Hojlund in attack for Manchester United. Graeme Souness has not pulled any punches over the state of Manchester United after admitting he's previously warned Sir Jim Ratcliffe not to invest in a football club. Mary Earps hit back at a \"hurtful\" comment from a Manchester United fan who accused the England No 1 of being \"too important\" to engage with supporters post-match. DAILY STAR Sir Alex Ferguson will pen his own personal tribute to Sir Bobby Charlton in the coming days, following the passing of his close friend. Sir Bobby Charlton's brother Tommy knows there is a special place in heaven for the \"loved\" footballing icon. Wrexham's movie star owner Rob McElhenney has roped in Hollywood A-lister Chris Pratt to gift Ryan Reynolds his birthday present. Please use Chrome browser for a more accessible video player THE TIMES Joe Root has said that England are not playing enough one-day international cricket to continue competing at World Cups and suggested that staging more 50-over county matches at the expense of the Vitality Blast could help to develop a new generation of talent. DAILY EXPRESS Erik ten Hag felt that Andre Onana should've focused on laying the early foundations of a successful career at Old Trafford rather than returning to international duty. Arsenal and Brighton are battling it out for the signature of Sunderland academy player Mason Cotcher. Chelsea are reportedly interested in signing Inter Milan star Alessandro Bastoni. Liverpool are reportedly interested in 21-year-old midfielder Ezequiel Fernandez. Red Bull will trim four junior drivers from their ranks in Formula 2 next season with Dennis Hauger, Zane Maloney, Enzo Fittipaldi and Jak Crawford all set to lose their backing from the reigning F1 constructor champions. TELEGRAPH Jonny Bairstow has opened up on Lord's stumping during the Ashes. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-23 21:00:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ee8644f062bc898c9c1a85e2f93a7304","title":"Indian cricket great Bishan Bedi dies at 77","link":"https://www.mercurynews.com/2023/10/23/indian-cricket-great-bishan-bedi-dies-at-77/","keywords":["Latest Headlines","News","Obituaries","Other Sports","Sports","World News","Cricket","Midday Wire","Obituary"],"creator":["The Associated Press"],"video_url":null,"description":"The orthodox spinner took 1,560 first-class wickets — the most by any Indian bowler ever — playing for various teams in India and England.","content":"NEW DELHI — Bishan Bedi, the India cricket great whose dazzling left-arm spin claimed 266 test wickets, has died. He was 77. The death of Bedi, who underwent multiple surgeries over the last two years that included a knee operation a month ago, was confirmed by the Board of Control for Cricket in India on Monday. “The BCCI mourns the sad demise of former India Test Captain and legendary spinner, Bishan Singh Bedi,” the BCCI wrote on X, formerly known as Twitter. “Our thoughts and prayers are with his family and fans in these tough times. May his soul rest in peace.” Born in Amritsar on Sept. 25, 1946, Bedi was part of the famous Indian spin quartet with Bhagwath Chandrasekhar, Erapalli Prasanna and Srinivas Venkataraghavan in the 1970s. Bedi earned his 266 wickets in 67 test matches, at an average of 28.71, with best innings figures of 7-98 and best match figures of 10-194. His last test match was against England at the Oval in 1979. At the time of his retirement, he was India’s leading wicket-taker before being overtaken by Kapil Dev a few years later. He averaged under nine runs in tests as a right-handed batter but had a highest score of 50 not out. He played only 10 ODIs between 1974-79, picking up seven wickets. The orthodox spinner took 1,560 first-class wickets — the most by any Indian bowler ever — playing for various teams including Delhi and Northern Punjab in India and Northamptonshire in England. He is survived by his wife and two children. India Prime Minister Narendra Modi led the tributes, saying on X: “His passion for the sport was unwavering and his exemplary bowling performances led India to numerous memorable victories. “He will continue to inspire future generations of cricketers. Condolences to his family and admirers.” Bedi made his test debut against West Indies on the last day of 1966, and took 21 wickets in a home test series against Australia at the end of 1969. He kept on troubling major test playing nations before eventually succeeding Mansoor Ali Khan as India skipper in 1976. His first win as test captain came at Port-of-Spain when India reached 406-4 in a historic chase. He led India 22 times in total, winning six of them. Geoff Allardice, chief executive of the International Cricket Council, said Bedi was one of the masters of flight and turn. “I would like to extend heartfelt condolences from everyone at the ICC to the family of one of the greats of the game and one whose exploits in test cricket will be remembered for a long time,” Allardice said. “He was the kind of spinner who could excel in different conditions and would have been one of the greats in any era.” Known for wearing colorful patkas and a graceful delivery hiding devastating variety, Bedi was outspoken on the field and often got embroiled in controversies. In 1976 he declared India’s second innings early at Kingston to protest hostile bowling by Caribbean fast bowlers. With three Indian batters already out of the game after being hit by West Indies pacers, Bedi claimed there weren’t enough fit players available to come out and bat. West Indies eventually won the test match by 10 wickets. Bedi also criticized Sri Lanka spin great Muttiah Muralitharan for his bowling action. He refused to compete in Kerry Packer’s lucrative World Series Cricket in 1978 and claimed that he was approached by the rebel cricket league. But his love for the game was clear, even when on the receiving end. Cricinfo.com website said Bedi “often applauded batters when they hit him for six.”","pubDate":"2023-10-23 20:24:00","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/10/SJM-L-OBBEDI-1023.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"5e9d33e1e9edd446757b951d955f33a7","title":"‘The greatest Manchester United player of all time’: British soccer legend Bobby Charlton dies at 86","link":"https://www.mercurynews.com/2023/10/23/the-greatest-manchester-united-player-of-all-time-british-soccer-legend-bobby-charlton-dies-at-86/","keywords":["Latest Headlines","News","Obituaries","Soccer","Sports","Midday Wire","Obituary"],"creator":["The Associated Press"],"video_url":null,"description":"He survived a 1958 plane crash that killed several of his Manchester United teammates, then later became the heart of the England team that won the World Cup in 1966.","content":"MANCHESTER, England— Bobby Charlton, an English soccer icon who survived a plane crash that decimated a Manchester United team destined for greatness to become the heartbeat of his country’s 1966 World Cup triumph, has died. He was 86. The death of Charlton, who is regarded by many as the greatest ever English player, was announced in a statement from his family that was released by United, which said he died Saturday surrounded by his family. No cause of death was disclosed. In November 2020, it was announced that Charlton had been diagnosed with dementia, the same disease that afflicted his brother Jack — who died in 2020 at age 85 — and another World Cup winner, Nobby Stiles. An extravagantly gifted attacking midfielder with a ferocious shot, Charlton was the leading scorer for both United (249 goals) and England (49 goals) for more than 40 years until being overtaken by Wayne Rooney. Charlton was easily recognizable with his comb-over, and known globally for being a gentleman of the beautiful game. “Sir Bobby was a hero to millions, not just in Manchester, or the United Kingdom, but wherever football is played around the world,” United said. “He was admired as much for his sportsmanship and integrity as he was for his outstanding qualities as a footballer; Sir Bobby will always be remembered as a giant of the game.” Alex Ferguson, who managed United from 1986-2013, said before Charlton’s death that he “is the greatest Manchester United player of all time — and that’s saying something.” “Bobby Charlton is absolutely without peer in the history of the English game,” Ferguson said. Charlton was also renowned for his humility and discipline. He was never sent off in 758 appearances for United from 1956-73 or 106 internationals for England from 1958-70. Charlton played with George Best and Denis Law in the so-called “Trinity” that led United to the 1968 European Cup title after surviving the 1958 Munich crash that wiped out the celebrated “Busby Babes” team. He won three English league titles at United, and one FA Cup. “For a footballer, he offered an unparalleled combination of grace, power and precision,” said former United defender Bill Foulkes, another survivor of the Munich air crash. “It added up to a greatness and something more — something I can only call beauty.” FIFA President Gianni Infantino described Charlton as a “football legend whose impact on the game spanned generations.” United great David Beckham said Charlton was “truly a national hero.” British Prime Minister Rishi Sunak called him ”one of the game’s greatest players.” Charlton’s England scoring record stood for 45 years until Rooney scored his 50th goal for the national team in September 2015. Three of his England goals came in the World Cup in 1966, during which Charlton played every minute for the team and stood out especially in the semifinals when he scored twice against Portugal to lead England to a first major final. England beat West Germany 4-2 after extra time in the title match at Wembley Stadium. Although Ryan Giggs beat Charlton’s appearance record for United in 2008, his scoring record for the club lasted another nine years. It was only in 2017 — 44 years after Charlton last wore the famous red jersey of England’s most successful club — that Rooney scored his 250th goal for United. United played a Premier League match against Sheffield United a few hours after Charlton’s death was announced. Man United’s players laid a wreath on the field ahead of the game, which the team won 2-1, and took part in a period of applause while a picture of a young Charlton was displayed on the screens inside the stadium. After retiring in 1973, Charlton went into coaching and founded a youth scheme that included Beckham among its participants. After brief spells in charge of Preston, Wigan and Irish side Waterford, Charlton returned to United in 1984 as a director and persuaded the board in 1986 to appoint Ferguson, who delivered 38 trophies during nearly 27 years in charge. Knighted in 1994 by Queen Elizabeth II, Charlton remains a mainstay at Old Trafford, featuring alongside Best and Law on a statue outside United’s stadium. Charlton avoided the controversies and distractions that damaged the career of Best, with his style and demeanor bringing a popularity that transcended the tribalism of club and international football. “I felt he could be a bit aloof,” the late Best said in a 2001 magazine interview. “We were never at each other’s throats, we simply didn’t go and have a pint together.” Charlton’s death left Geoff Hurst, who scored a hat trick in the 1966 final, as the only surviving member of that England team. “We will never forget him and nor will all of football,” Hurst said of Charlton on X, formerly known as Twitter. “A great colleague and friend, he will be sorely missed by all of the country beyond sport alone.” Robert Charlton was born Oct. 11, 1937, in the coal-mining town of Ashington, northeast England, and his talent was obvious from a young age. “We realized Bobby was going to be a bit special as a player when he was about 5 years old,” said Jack, his older brother. “He was always kicking a football or a tennis ball against a wall and when it bounced back it stuck to him like a magnet.” Charlton wrote in 2007 that his family sometimes relied on illegally caught salmon or rabbit to ward off hunger, while his father — also named Robert — gathered coal washed up on local beaches and sold it to bolster his income. His father’s commitment to his mining colleagues meant that in 1966 he missed Charlton scoring both goals against Portugal in that World Cup semifinal because he didn’t want someone else to have to cover for him in the pit. He was, however, persuaded to attend the final when the Charlton brothers lifted the trophy. Charlton’s playing career began far from home in Manchester after leaving school at 15, making his United debut three years later against Charlton in 1956. Within two years, tragedy struck the tight-knit group of United players whose relationship was forged as trainees in austere conditions. The team was still celebrating winning at Red Star Belgrade to secure a place in the European Cup semifinals when their plane caught fire on its third attempt to take off in heavy snow after a refueling stop in Germany. Charlton miraculously emerged from the smoldering wreckage with only light head injuries and picked his way through the wreckage to help survivors. Spotting manager Matt Busby groaning in agony on the smoke-shrouded runway, Charlton rushed to help the father-figure who had promoted him to the first team. But eight members of the “Busby Babes” team packed with bright prospects were among the 21 fatalities. They included Duncan Edwards, considered one of England’s most talented players at 21. “Sometimes it engulfs me with terrible anger and regret and sadness — and guilt that I walked away and found so much,” Charlton wrote in 2007. Charlton became driven by a lingering obligation to preserve the memories of the Munich dead, returning to action less than four weeks later and helping a hurriedly assembled team of survivors and stand-ins reach that season’s FA Cup final. Busby rebuilt his team around Charlton, adding the 1965 and 1967 English league titles to the championship they won in 1957. “There was always one great hope — the return to greatness of my beloved club,” Charlton said. The biggest prize of his club career arrived in 1968 as United became the first English club to become champion of Europe. Charlton scored twice in a 4-1 extra-time win over a Benfica team containing Portugal great Eusebio. But Charlton is perhaps best known for being part of the England team that won the World Cup. It remains England’s only major title in men’s soccer. Charlton and his brother fell out over Jack’s public assertion that Bobby’s wife caused him to become estranged from his mother. But the pair reconciled and Jack presented Bobby with a lifetime achievement trophy at the 2008 BBC Sports Personality of the Year Award. “We have had our public disputes, proving that in any family discord can sometimes disrupt the force of love and blood, but throughout that time I never lost the sense of wonder and gratitude that we were together in 1966 on such a great day in the history of our nation’s sport,” Bobby Charlton said. Charlton was rarely seen in public in the final years of his life after being diagnosed with dementia. He was never forgotten, though. “This man, from day one, was everything I wanted to be,” United striker Marcus Rashford wrote of Charlton after hearing about the diagnosis. “Kind, professional, caring, talented.” Another former United player, Phil Neville, told NBC that Charlton deserved to stand alongside the likes of Pele, Diego Maradona and Lionel Messi as a soccer great, because of what he achieved and the way he did it. “World champion. Gentleman. Legend. A true great who will be remembered forever,” Prince William, who is also president of England’s Football Association, wrote on X. Charlton is survived by his wife, Norma, whom he married in 1961, and his two daughters.","pubDate":"2023-10-23 19:28:03","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/10/SJM-L-OBCHARLTON-01-1023.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"a75ca9f28d22059ba3e10ec2e9146c6b","title":"Shoaib Akhtar Reacts To Pakistan's Defeat Against Afghanistan Cricket World Cup 2023, 'Most Embarrassing Defeat...'","link":"https://www.newsr.in/n/Sports/1zpnzuuou6/Shoaib-Akhtar-Reacts-To-Pakistan-Defeat-Against.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"In what was a monumental upset, Afghanistan's victory over Pakistan has thrown the points table into disarray, raising questions about Pakistan's prospects in the tournament. Reported by Zee News 1 hour ago.","content":"Monday, 23 October 2023 ( 2 hours ago ) In what was a monumental upset, Afghanistan's victory over Pakistan has thrown the points table into disarray, raising questions about Pakistan's prospects in the tournament. 👓 View full article","pubDate":"2023-10-23 18:37:22","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"b45812096140984fa87914ffd5a97bbe","title":"Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again'","link":"https://www.dailymail.co.uk/sport/cricket/article-12663887/Cricketer-Fawad-Ahmed-announces-four-month-old-son-died-Till-meet-again.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket player Fawad Ahmed has sadly announced the tragic passing of his four-month-old son.","content":"Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' Fawad Ahmed baby son has passed By Ashley Nickel For Daily Mail Australia Published: 23:12, 23 October 2023 | Updated: 23:52, 23 October 2023 e-mail View comments Australian cricket player Fawad Ahmed has sadly announced the tragic death of his four-month-old son following a health battle. Ahmed, 41, and his wife welcomed their second child in June but the baby faced persistent health issues. After spending months in the Royal Children's Hospital in Melbourne trying to find a diagnosis, Ahmed announced on Monday that his son had passed away. Australian cricket player Fawad Ahmed's son (above) has tragically passed away 'Till we meet again my little angel,' he wrote alongside two photos of the tiny boy. 'Unfortunately after a long struggle my little man has lost the painful and tough fight. 'I believe you are in a better place, we will miss you so much. '‎I hope no one ever goes through this pain.' In an earlier interview with Cricket Australia , Ahmed described his son's struggle as 'a tough time'. 'Every day he is growing, and the bones and the joints are getting stiffer and stiffer,' he said. 'We don't know what's going to happen. Neither do the doctors. It's pretty bad. You want to know. 'This is something that is aching the heart.' Two months ago the baby underwent a surgery to bring forward his jaw and tongue to help with breathing after winning a weight struggle and finally reaching 3kg. However, his health problems persisted and his eyesight became a fresh concern. Ahmed said his son had returned a sight result of -13, -15 is considered blind. 'He doesn't look at me, that hurts,' he said. 'But we say, \"All praise to Allah\" that he's got something. I am arranging some glasses for him, but it's going to be a little bit tough because we have tested the smallest size already and it doesn't fit.' Fawad Ahmed (above) previously described his son's struggle as a 'tough time' for the family He described how the constant hospital trips and bad news had worn down his family. 'It's something that's so unexpected,' Ahmed said. 'You're excited, you're happy about the birth of your child, and then suddenly you go to some dark places, and you don't know what's going to happen. 'Our lives have completely changed. Every morning, we just wake up and get ready to go to the hospital. Then in the evening, we come back. That's it, nothing else.' Ahmed became an international cricketer after fleeing his home in Pakistan and settling in Australia as an asylum seeker in 2010 at the age of 28. He made five international appearances for Australia across ODI and T20I matches after being granted citizenship in 2013. Melbourne Share or comment on this article: Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-23 22:18:08","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_154x115px.png","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7080b9e8fb88f49eac25af0ad1c79e4e","title":"NOCSL celebrates Hangzhou heroic accomplishments at Asian Games 2023","link":"https://www.ft.lk/sports/NOCSL-celebrates-Hangzhou-heroic-accomplishments-at-Asian-Games-2023/23-754402","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The National Olympic Committee of Sri Lanka yesterday celebrated and recognised the victorious Lankan athletes who brought honour to the motherland at the 19th Asian Games in Hangzhou. The Lankan athletes ended up in the 26th position out of 45 Asian countries and territories, with a total of five medals; a gold, two silver and two bronze to their credit. The medal winners as follows. 1. Tharushi Karunarathna: Gold Medal-Women’s 800m Final – 2 minutes. 03.20 secs 2. Women’s Relay Team (Nadeesha Ramanayaka, Jayeshi Uththara, Sayuri Mendis and Tharushi Karunarathna): Bronze Medal-Women’s 4*400m Relay Final – 3 minutes. 30.88 secs. 3. Men’s Relay Team (Aruna Dharshana, Kaushika Keshan, Rajitha Rajakaruna and Kalinga Kumarage): Bronze Medal-Men’s 4*400m Relay Final - 3minutes. 02.55secs 4. Nadeesha Dilhani Lekamge: Silver Medal-Women’s Javelin Throw - 61.57m (New Personal Best) 5. Women’s Cricket Team (Captain - Chamari Athapatthu, Vice-Captain - Oshadhi Ranasinghe): Silver Medal-Women’s Cricket Final-SL vs IND - SL lost by 19 runs Speaking at the felicitation ceremony, National Olympic Committee of Sri Lanka Secretary General Maxwell de Silva said, “An Asian medal after 2014 and athletic medals after 2006 augurs a new lease of life to Lankan athletes and its future. We saw this upstage of performances at the humongous stage like the Asian Games and that was a culmination of the Lankan athletic contingent believing in themselves and usurping each other’s strengths to showcase that they too belong to the real big stage. The medal doors were opened by the women’s cricketers who jumped one scale higher and brought home a silver over the bronze that they won in 2014 in Incheon.” The Lankan track took a different turn; the Lankan athletes were upbeat. Then they faced the mixed relay conundrum that turned silver into oblivion, but that setback also gave more strength to change the status quo. This was proved true when Javelin thrower Dilhani Lekamge took the camp by surprise when she completed her personal best with a throw of 61.57m to take the silver. This followed the triple medal day where Tharushi won the women’s 800m gold followed by women’s and men’s relay team winning 400m bronze medals culminating one of the most joyous days in Lankan athletic history. Taking a bow to Chef-de-mission in Hangzhou Nishanthe Piyasena who lead the logistical aspects besides leading the contingent, Professor Chathuranga Ranasinghe who kept the close tab of the medical needs of the athletes, said that they too played a huge role in Lankan team’s impressive accomplishments. De Silva added, “We consider this as just a beginning. Besides the medal winners, there were others who also could have stood on the podium with a stroke of luck or guidance. So, this is the time to look to the future. We have to work hand-in-hand with the Ministry of Sports to seek and set up ways to sustain and nurture the talent in short and long-term programmes and we are already at it.” Pix by Lasantha Kumara","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"0cc780b4cf5ef6a99ca4c2771cc0129a","title":"Pathirana ruled out of World Cup","link":"https://www.ft.lk/sports/Pathirana-ruled-out-of-World-Cup/23-754404","keywords":null,"creator":null,"video_url":null,"description":null,"content":"It has been confirmed that fast bowler Matheesha Pathirana has been ruled out of the ongoing Cricket World Cup and will return home. Pathirana failed to pass a fitness test on his injured bowling arm and will be replaced by one of the three travelling reserves Dushmantha Chameera, Angelo Mathews or Dasun Shanaka. Sri Lanka will take a decision on the replacement for Pathirana before forwarding the player’s name to the Event Technical Committee of the ICC for approval. Meanwhile, Maheesh Theekshana who underwent a scan for a troublesome hamstring is to continue training with the Sri Lanka squad in preparation for their next match against England at Bengaluru on Thursday, while the report is still awaited.","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"6ad974a7188f34d25d290f8217f96386","title":"Afghanistan causes another upset, trounce Pakistan by a convincing 8 wickets","link":"https://www.ft.lk/sports/Afghanistan-causes-another-upset--trounce-Pakistan-by-a-convincing-8-wickets/23-754405","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Afghanistan who outplayed England in the cricket World Cup pulled off a second shock when they defeated Pakistan comprehensively by eight wickets at the MA Chiddambaram Stadium here Monday to record their first win over them in eight ODI contests. It was a creditable win for the Afghans who chased down Pakistan’s total of 282-7, to win two matches in a World Cup for the first time in their history. It was also their highest and successful run chase in an ODI. The stage for this historic win was set by openers Rahmanullah Gurbaz (65 off 53 balls, 9 fours, 1 six) and Ibrahim Zadran (87 off 113 balls, 10 fours) who shared a partnership of 130 off 127 balls. Rahmat Shah (77* off 84 balls, 5 fours, 2 sixes) and skipper Hashmatullah Shahidi (48* off 45 balls, 4 fours) continued the good work to see Afghanistan home with an unbroken stand of 96 off 93 balls as Pakistan’s game simply fell away on the face of Afghanistan’s assault. Babar Azam’s 30th ODI fifty and a big-hitting cameo from Iftikhar Ahmed led Pakistan’s strong batting display and helped them to 282/7 on a bone-dry surface. As many as 38 overs were bowled by the spinners, which is the third-most bowled in a World Cup match. Things looked on the upswing for Pakistan when Abdullah Shafique swung a Naveen-ul-Haq delivery for a maximum in the fifth over. It was the first six hit by a Pakistan batter in the PowerPlay in 2023. Both openers, Imam-ul-Haque and Shafique, looked at ease against the new ball and made use of the best batting conditions on offer to post a 56-run opening stand. Shafique continued his good World Cup form and raised a run-a-ball 50 (5 fours, 2 sixes) his second in the tournament to go along with a hundred. It was Noor Ahmad, in the side for Fazalhaq Farooqi, who broke the 54-run stand with wickets in back-to-back overs. The left-arm leggie first trapped Shafique lbw and then drew a top-edge from Mohammad Rizwan, leaving Pakistan struggling on a tough surface to score. Another 43-run stand between Babar and Saud Shakeel brought in some relief for Pakistan but Mohammad Nabi broke that stand, getting Shakeel caught at mid-on after a flurry of dots. However, it was Noor’s dismissal of Babar for 74 (92 balls, 4 fours, 1 six) in the 42nd over that really threatened to knock the wind out of Pakistan. Luckily for them, Iftikhar (40 off 27 balls, 2 fours, 4 sixes) and Shadab Khan (40 off 38 balls, 1 six, 1 four), back in the side for ill Mohammad Nawaz, together added 73 runs for the sixth wicket. Noor, the youngest player to feature in this World Cup at 18, returned figures of 3 for 49 in his first World Cup match and helped Afghanistan with breakthroughs on a day their lead spinner Rashid Khan went wicketless. Scores: Pakistan 282-7 (50) (Abdullah Shafique 58, Babar Azam 74, Saud Shakeel 25, Shadab Khan 40, Ifthikar Ahmed 40, Naveen-ul-Haq 2/52, Noor Ahmed 3/49) Afghanistan 286-2 (49) (Rahmanullah Gurbaz 65, Ibrahim Zadran 87, Rahmat Shah 77*, Hashmatullah Shahidi 48*)","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"92076af31fc5746239499c08a1a2a5e0","title":"Sri Lanka cricket what it was and what it is today","link":"https://www.ft.lk/sports/Sri-Lanka-cricket-what-it-was-and-what-it-is-today/23-754406","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka’s cricketing standards at international level has dipped so low that it’s a crying shame to see that beating an associate member team like Netherlands can amount to being called an achievement. Past Sri Lankan teams have simply swept away the opposition that a country like Netherlands possess, but today’s side lacks those quality players and the experience that goes with it to make winning look more convincing. No doubt, Netherlands has grown as an international cricket side over the years, but when countries like Pakistan and New Zealand are simply sweeping them aside hardly raising a sweat, that’s where the difference lies between a team like Sri Lanka and the rest of the top ODI sides. Without a win in three matches of the ongoing Cricket World Cup, Sri Lanka were desperate to beat Netherlands and chalk up their first points. They eventually did so, but not with the ease which one would have associated a Sri Lanka side to win, it was one hard struggle to get to the target of 263 that they consumed 48.2 overs. It was tough going no doubt in the middle, with the ball holding up and stroke making not all that easy, but what made it difficult for Sri Lanka to score was the discipline in the lines and lengths maintained by the Dutch bowlers. It is an area where the Lankan bowling unit should learn from. They simply bowled wicket to wicket and made the batsmen play at almost each and every delivery. The other notable aspect was that Netherlands were never afraid to keep their fielders inside the 30-meter circle and attack the batsmen challenging them to go over the top at their own peril. We hardly see Sri Lanka keep so many fielders inside the circle, but always outside it which amounts to a defensive ploy. One could say that the Sri Lanka team is going through a transition period and that the side lacks experience in its bowling unit with so many injuries to its key bowlers who were not available for the World Cup. But the same cannot be said of the batting where the talent is there but the execution and judgement is poor. The batsmen have still not learnt to build an innings. How many times have we seen the batsmen doing all the hard work and then simply throwing away his wicket? This has been Sri Lanka’s achilles heel with this present unit as we have seen in their matches of the World Cup against Pakistan and Australia, matches they could have won had it not been for the batsmen’s indiscretion. This young Sri Lanka unit is extremely talented and has the makings of achieving bigger things if they are kept together for the next 2-3 years without meddling too much with it. Injuries are part and parcel of sport and like the weather you cannot control it. It is just sheer bad luck if you lose your best batsman or best bowler ahead of a major tournament like the World Cup. For a tournament as big as the Cricket World Cup, experience plays a big part because of the pressures the players have to absorb in the middle, the expectations, the spectators, the conditions and to keep the motivation going for the length of the tournament. Sadly, Sri Lanka left their experience at home and are paying a heavy price for it.","pubDate":"2023-10-23 21:53:16","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"3594af38508bbcf561078630d623591e","title":"Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table","link":"https://www.dailymail.co.uk/sport/live/article-12661711/Tottenham-vs-Fulham-Premier-League-2023-24-Latest-Result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Read how Mail Sport's live blog covered Tottenham's game with Fulham, with the hosts moving back to the top of the Premier League with a win.","content":"Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table By Samuel Draper For Mailonline Published: 18:45, 23 October 2023 | Updated: 23:32, 23 October 2023 e-mail 9 shares 293 View comments Read how Mail Sport's live blog covered Tottenham 's game with Fulham , with the hosts moving back to the top of the Premier League with a win. This live blog has now closed. 21:34 Thank you for following along tonight Thank you for following along with the blog tonight. An impressive win for Ange Postecoglou's side, and one they will hope to build on as the season progresses. Keep an eye across Mail Sport for the latest reaction to tonight's match, and looking ahead to a bumper week of fixtures too. Have a good night and we'll meet again soon. Goodbye. 21:33 Riath Al-Samarrai's match report Mail Sport's Riath Al-Samarrai was on hand at the Tottenham Hotspur Stadium to give his rundown of the 2-0 win for the hosts that sent them back to the top of the Premier League. Tottenham 2-0 Fulham: Son Heung-min and Maddison fire Spurs back top RIATH AL-SAMARRAI AT THE TOTTENHAM HOTSPUR STADIUM: Back from their break and back in the groove. The hope and possibility will soon throw Spurs into a wall of reality, but not yet. Mail Online 21:05 Son and Maddison hit double top You can tell how much those two enjoyed it, as Spurs went back to the top of the Premier League after a long weekend of action. They started in fourth, but they're first now. And could move five points clear on Friday... Early days, of course, but a statement from Ange Postecoglou's men. 20:57 FULL TIME: Tottenham 2-0 Fulham Tottenham back on top of the Premier League. Son and Maddison giving the three points to the hosts, after a wave of defensive errors from Fulham. 20:54 Tottenham 2-0 Fulham Wilson comes into the box, but Tottenham are able to block the opportunity. Looks like that clean sheet stays intact! 20:54 Tottenham 2-0 Fulham Four minutes into stoppage time, and Fulham are searching in vain for a consolation. Tottenham more than happy to see this one out. 20:49 Tottenham 2-0 Fulham Seven minutes added on 20:49 Tottenham 2-0 Fulham Fulham push but can't find a way to create a clear chance for a goal. Tottenham counter, but it is flagged as offside. 20:47 Tottenham 2-0 Fulham Cairney takes a shot, but Vicario is able to hold it. Nothing going Fulham's way tonight. 20:46 Tottenham 2-0 Fulham Postecoglou heading for eight wins in his first nine PL games, one of the best starts for a manager in the league ever. He won't care about individual stats though - the three points send Spurs top. 20:44 Tottenham 2-0 Fulham - Vicario booked The Tottenham goalkeeper goes into the book for timewasting. 20:44 Tottenham 2-0 Fulham Jiminez shoots straight at the keeper. Fulham needed that to go in! 20:42 Palhinha makes way for Cairney Another change for Fulham too, for the last eight minutes or so. 20:42 Triple change for Spurs including both goalscorers coming off Richarlison and the goalscorers Maddison and Son make way. Johnson, Lo Celso and Veliz come on for the last few minutes. Son looks reluctant to come off, but hands the captain's armband to Romero. 20:39 Tottenham 2-0 Fulham Ten minutes plus stoppages for Fulham to try and rescue something, and for Spurs to hold onto the top spot in the Premier League. 20:39 Tottenham 2-0 Fulham Wilson and Richarlison both go down in a challenge, so the referee brings the game to a halt, but it looked like a rather 50-50 thing, just a basic collision, and both players are able to get back on their feet and keep going. 20:37 Tottenham 2-0 Fulham The game has slowed a little bit in this second half. Spurs know the job is done, unless they let it slip, and Fulham don't quite have the ability to turn this game completely on its head. Tottenham may have one eye on Friday night already... 20:35 Tottenham 2-0 Fulham Bassey loses it again, and Maddison capitalises. He seems to get in Son's way - or maybe it was vice-versa - and the shot isn't as effective as it should have been. A let off for Fulham, and a let off for Bassey, but a lot of the focus will be on his errors in this game that have led to the goals... 20:34 Tottenham 2-0 Fulham Wilson goes down after being caught by a Spurs player's studs on his knee. Innocuous, but probably stung. Luckily, the substitute is back to his feet for the rest of this one. 20:31 Harrison Reed on for Fulham He replaces Sasa Lukic for the last 20 minutes or so 20:30 Tottenham 2-0 Fulham Maddison swings in a free-kick from out wide but it evades everyone and goes out for a Fulham goal-kick. 20:28 Tottenham 2-0 Fulham Porro makes a great pass into the box for Son, but Bassey is just able to take the ball off the Spurs captain. 20:25 Tottenham 2-0 Fulham Fulham have had just one shot on target in this match - which was a superb save - but they're going to have to find a way to make the goalkeeper work, or this is only going to end one way. Alex Iwobi is just offside, as Fulham look to make something happen. 20:24 Fulham substitution Marco Silva makes his third change, De Cordova-Reid making way for Harry Wilson. 20:23 Tottenham changes In the aftermath of the goal, Udogie made way for Emerson. Then Sarr was taken off to be replaced by Oliver Skipp. 20:21 When James Maddison got his first home Spurs goal A moment to celebrate for Maddison, as he finally got a goal at the Tottenham Hotspur Stadium for his new club after the summer move. 20:19 Tottenham 2-0 Fulham Willian passes to Robertson, but his ball across the box is too far and it goes out for a throw-in on the other side. Fulham searching for something... 20:18 Tottenham 2-0 Fulham Fulham have to go for it now, after falling two behind, but they might not find it easy. Then again, Vicario comes out of his box and makes a poor header which is intercepted by Willian. Unfortunately for him, he can't quite run into the box with it, and the Tottenham defender makes a sliding tackle to clear the danger. 20:14 Tottenham 2-0 Fulham - GOAL! Maddison 54' James Maddison gets his first goal for Tottenham at their Stadium. The home crowd have a new hero. Bassey makes a terrible pass, and Son intercepts, before gifting it on a plate to the former Leicester City man. He's able to slide it under Leno, and make it 2-0 to the hosts. Tottenham going top as it stands. 20:12 Tottenham 1-0 Fulham Fulham earn a free-kick about 30 yards out, with Willian standing over the ball. He clips the ball into the box, but Spurs are able to head it out for a throw-in. 20:11 Tottenham 1-0 Fulham Kulusevski bursts forward, who plays it across to Son, who plays it to Richarlison, who enters the box, but sends the ball skyward. It felt like an opportunity for Spurs, but it amounts to nothing. 20:08 Tottenham 1-0 Fulham Taking a little while for this second half to really get going. Tottenham trying to find their way past a stubborn Fulham side. 20:05 2nd half underway: Tottenham 1-0 Fulham 20:04 Fulham make two changes at HT Jiminez and Iwobi on for the second half, Silva choosing to take off Vinicius and Pereira at the half-time interval. 20:02 Tottenham going back top as it stands Can they hold onto the lead? 20:01 Only one booking in that first half Hojbjerg was put into the referee's book, moments before Tottenham took the lead, but he'll have to be cautious in the second half. So far, the referee has not turned to cautions to deal with offences, which I think has helped the game to flow, but some fans will inevitably disagree! 19:58 What changes will the sides make at the break? Fulham did well to contain Spurs, and had their own chances, but nothing really close to delivering a real danger to Ange Postecoglou's side. Can they switch it up? For Tottenham, they must want more of the same, but to get more clinical too, and put away some of their promising attacking spells. 1-0 is never enough. 19:50 Half-time: Tottenham 1-0 Fulham Son Heung-min splits the sides at the break 19:48 Tottenham 1-0 Fulham Bassey seems to catch a Spurs player in the box, and whilst there's calls for a penalty, the man in the middle and the men in the VAR room aren't swayed. 19:47 Tottenham 1-0 Fulham Two minutes of additional time in this first half 19:46 Tottenham 1-0 Fulham Fulham's Willian once again races into the box, but he's caught between a shot or making a pass, and ends up doing neither. Tottenham are also driving forward themselves. The ball seems to get caught in Maddison's feet though... 19:43 Tottenham 1-0 Fulham Willian plays the ball across the box for Fulham, but De Cordova-Reid's header is deflected out for a corner for the visitors. That corner is headed out, and then flagged for offside. 19:42 Tottenham 1-0 Fulham The hosts try to get a second, Kulusevski takes a shot, but it's deflected wide for a corner. Porro takes an ambitious shot from halfway down the half when the corner amounts to nothing, and earns another corner in quick succession. Fulham manage to deal with that one too -but Spurs with all the pressure as they look to double their advantage before the break. 19:39 Tottenham 1-0 Fulham Tottenham keep up their habit of scoring in every game. What can Fulham do now? 19:37 Tottenham 1-0 Fulham - GOAL! Son 36' Fulham lose the ball, and Tottenham take over. Richarlison nudges the ball into Son's path, and the South Korean captain is able to curl a beautiful shot from the edge of the penalty box. Nothing Leno could do about that. The hosts go 1-0 up. 19:37 Tottenham 0-0 Fulham - Hojbjerg goes in the book First booking of the game goes to Hojbjerg 19:35 Tottenham 0-0 Fulham James Maddison tries to make something happen, he is a man who clearly wants the ball at his feet, but he's only able to make a tame shot which is no trouble for the Fulham goalkeeper. 19:34 Tottenham 0-0 Fulham - penalty shout not given Udogie is in the box, trying to play the ball across to a Spurs teammate, but it hits the defender instead. He's adamant it hit a hand, but VAR were quick to check it... and given nothing. 19:32 Tottenham 0-0 Fulham - Richarlison goes just wide Kulusevski made that chance, as Spurs come blistering down the wing, and he cuts into the box, and maybe he could go for the shot, but instead he lays it off to Richarlison, who puts it wide. If the Brazilian had hit the target there, Leno would have had his work cut out... 19:29 Tottenham 0-0 Fulham Straight down the other end, Hojbjerg blasts a shot straight at Leno, which blisters the Fulham keeper's hands, but is easy for him to gather. 19:28 Tottenham 0-0 Fulham Sloppy from Vicario to play the ball straight to Willian, but Fulham aren't able to create enough space to make anything happen. The Spurs goalkeeper lifts his hand up to his teammates to apologise for his miskick,but no damage done. 19:27 Tottenham 0-0 Fulham Twenty-five minutes played, and nothing seperating these sides yet. 19:25 Tottenham 0-0 Fulham Willian makes a brave pass, but it's intercepted. Maddison bursts into the box, but that amounts for nothing. An entertaining exchange, but nothing clear cut to show for it yet. 19:24 Tottenham 0-0 Fulham Palhinha goes in for a tough tackle, and brings down Udogie in the middle of the park. It creates a brief spark, but the referee is able to disperse the tension without resorting to his cards. 19:22 Tottenham 0-0 Fulham Willian tries to cut from inside, but he's not given space, and the promising attack flutters away. Fulham get another corner moments later, but it sails into Vicario's hands. 19:20 Tottenham 0-0 Fulham Willian - who was expected to sign for Spurs once upon a time - was brought down on the left. Fulham try to play the free kick into the middle of the park, but make a mess of it. Somehow, they get the ball into the box, but Carlos Vinicius needed to do something more effective with the header as it softly goes wide. 19:18 Tottenham 0-0 Fulham Spurs looking to stretch Fulham, but not finding the way forward like they did in the early stages. 19:14 Tottenham 0-0 Fulham - Vicario makes superb save! The corner comes across, and there's a fierce goalbound header from Joao Palhinha, which Vicario is able to tip away, and Spurs clear their lines. There's a reason why Vicario has the best save percentage in the Premier League this season! 19:12 Tottenham 0-0 Fulham Just as I post that, the visitors get forward, and it looks promising, but Romero heads it out for a Fulham corner. 19:12 Tottenham 0-0 Fulham The first ten minutes are played, and it's all Tottenham so far. 19:11 Tottenham 0-0 Fulham A third dangerous free-kick for Spurs, with the referee deeming the contact on the edge of the box despite penalty protestations. Kulusevski takes a blistering shot which is deflected and loops up, but it amounts to nothing. 19:10 Tottenham 0-0 Fulham - Spurs make new chance with free-kick Spurs get another free kick on the edge of the box, and they're more ready for it this time. It's lifted over the wall and across the danger zone, but it's knocked over the bar. 19:05 Tottenham 0-0 Fulham The free kick was played wide by Maddison, and it would have been a smart move, but it seemed to catch Udogie unawares, and Fulham clear their lines. 19:04 Tottenham 0-0 Fulham Tottenham's Son has the first good chance, Maddison playing the ball through to him, but he hits it straight against the keeper. The hosts now have a free-kick about 25 yards out. 19:02 Kick-off: Tottenham 0-0 Fulham After the players take the knee, Fulham get things going at the Tottenham Hotspur Stadium. 19:00 Players gather for a moment of silence Both teams gather at the centre circle for a moment of silence to honour the tragic events taking place in Israel and Gaza this month. 18:58 Marco Silva has never beaten Spurs in the Premier League Does that streak end today? 18:57 Can Spurs reclaim top spot? The players walk out onto the pitch for the final Premier League game of the weekend. 18:55 The players are in the tunnel The waiting is almost over. 18:55 Fulham's Marco Silva on tonight's test Fulham boss Marco Silva told Sky Sports: 'It’s a big test for us definitely. But we like this type of challenge. When we test ourselves at this level, we like it. I believe the Premier League is a test. It’s a moment to test ourselves.' 18:52 The warm-ups are done Who will start brightest? Will it take until stoppage time for Spurs to win another home game? 18:48 It's 4th versus 13th Will Spurs win and go top, will Fulham win and move into the top half? We're counting down to the action. 18:45 15 minutes to go What's Fulham's thought process going into this? They're the only team to have defeated Ange Postecoglou's Spurs so far, but can they replicate that magic once again, without the help of a penalty shootout? 15 minutes until the game gets going in North London... 18:40 Spurs have a quick turnaround Spurs play tonight and again on Friday night, as the TV pick once more for their trip to Crystal Palace. Fulham have an extra day and a half to recover for their trip to Brighton, who will be in Europa League action on Thursday. 18:36 Son getting warm in North London 25 minutes or so until things get underway at the Tottenham Hotspur Stadium 18:30 Tottenham three home wins on the bounce Tottenham have three home wins on the bounce so far in the Premier League season. They left it late against Sheffield United, and against Liverpool- you expect Ange Postecoglou would prefer to have this one settled far ahead of stoppage time,. 18:25 Calvin Bassey arrives What difference will he make to Fulham, as they look to build on their win against Sheffield United a couple of weeks ago? 18:15 Ange Postecoglou on Romero's return The Tottenham boss has been talking to Sky Sports about the return of Romero for the game tonight. 'Us playing on Monday night is pretty beneficial for our international boys. And having the extra few days for all of them has been excellent,' the Australian said. 'Romero has been super important to us. We’ve got a new goalkeeper, centre-back and new left back and a right-back who’s adjusting to a new position – having a World Cup winner among them gives a lot of comfort.' 18:12 Last time out was in August These sides met in the second round of the League Cup at the end of August, and Fulham won 5-3 on penalties after a 1-1 draw across the 90 minutes. Micky van de Ven put into his own goal to give Fulham the lead within 20 minutes, but Richarlison equalised for Tottenham just over ten minutes into the second half. Will that result have any bearing on tonight's proceedings? 18:08 Fulham make two changes Calvin Bassey replaces Issa Diop, who misses the trip across London with a foot problem. That's one of two changes for Fulham, the other sees Sasa Lukic stepping into midfield, replacing Alex Iwobi. 18:06 One enforced change for Tottenham Just the one enforced change for Ange Postecoglou tonight. Yves Bissouma is suspended after his red card against Luton, so Pierre-Emile Hojberg comes in. 18:02 Team news is here Romero is fit for Tottenham, so they make just one change. Calvin Bassey makes just his second start for Fulham, coming back into the side, while Carlos Vinicius, ex-Spurs, starts for the visitors. Full team news coming. 18:00 Jamie Carragher on Tottenham Carragher spoke to Sky Sports on Spurs: 'I don’t think they [Spurs supporters] are getting too carried away in terms of thinking about the title. I think you’d be delighted about the Champions League positions. 'But its not just about results here, it’s about the football they’re playing, and the fact that Tottenham supporters are looking going to the game, looking forward to watching their team play – which it has been, maybe not so much under Conte, but maybe under Jose, Nuno – all a certain kind of manager and that’s where the excitement comes from.' 17:58 Fulham hope to climb the table Marco Silva's visitors start in 13th after the rest of the league's action this week, but they'll move into the top half if they get the win at the Tottenham Hotspur Stadium. A draw will leave them behind 10th-placed Chelsea on goal difference, whilst a defeat would leave them behind Crystal Palace and Wolves too. Their next match after tonight is Sunday's trip to Brighton. 17:50 Tottenham's chance to kick on Few clubs would have been as disappointed as Tottenham to herald the start of the last international break. Ange Postecoglou's side have had an unshakeable start to their Premier League season, and after a gritty win at Luton Town, sat top of the table. But the disruption is unlikely to have done too much to dent sky-high aspirations in north London. With tonight's kick-off, the team have had the longest for players to recover after returning from far-flung national team destinations, and Postecoglou was lucky to have avoided any injury to team talismans - although there was likely a sharp intake of breath at the Tottenham Hostpur Stadium when Son Heung-min limped down the tunnel at half-time during a friendly against Vietnam. In fact, the international break may have even boosted confidence in the camp - James Maddison continued his club form in England colours, and Destiny Udogie and Micky van de Ven were both handed senior debuts. 17:44 James Maddison is loving his blossoming bromance with 'nice guy' Son Heung-min... as Tottenham's £45m summer signing hails the impact of Ange Postecoglou's 'alpha male' management And they thought bromance was dead. For so long, there was only one unbreakable Tottenham double act in town. Harry Kane to Son Heung-min , Son Heung-min to Harry Kane. No pairing in Premier League history combined for as many goals as those two Spurs team-mates. Few made that boyish grin spread across Son's face like the England captain. After Kane's move to Bayern Munich , you wondered if anyone would ever be able to again. Step forward, James Maddison . READ MORE BELOW. James Maddison is loving his blossoming bromance with Son Heung-min INTERVIEW BY JAMES SHARPE: Few made that boyish grin spread across Son's face like Kane. After Kane's move to Bayern, you wondered if anyone would be able to again. Step forward, Maddison . Mail Online 17:42 Good evening! Hello and welcome to Mail Sport's live blog of the final Premier League tie of the weekend, with Tottenham inviting Fulham to north London to see if they can extend their unbeaten league run against the Cottagers. Kick-off is at 8pm, but stick around as we bring you all the team news, build-up, and more ahead of the whistle. Key Updates Riath Al-Samarrai's match report View post FULL TIME: Tottenham 2-0 Fulham View post Tottenham 2-0 Fulham - GOAL! Maddison 54' View post Fulham make two changes at HT View post Half-time: Tottenham 1-0 Fulham View post Tottenham 1-0 Fulham - GOAL! Son 36' View post Tottenham 0-0 Fulham - Hojbjerg goes in the book View post Tottenham 0-0 Fulham - penalty shout not given View post Tottenham 0-0 Fulham - Vicario makes superb save! View post Kick-off: Tottenham 0-0 Fulham View post Last time out was in August View post Fulham make two changes View post One enforced change for Tottenham View post Team news is here View post James Maddison is loving his blossoming bromance with 'nice guy' Son Heung-min... as Tottenham's £45m summer signing hails the impact of Ange Postecoglou's 'alpha male' management View post TOP STORIES Legendary commentator Martin Tyler set to return to the gantry four months after leaving Sky Sports to once again call a live Premier League game Tottenham 2-0 Fulham: Son Heung-min and James Maddison fire Spurs back to the top of the Premier League as Ange Postecoglou's side capitalise on defensive errors THE NOTEBOOK: Israel flags are held aloft, Ange Postecoglou makes a mockery of the manager of the month curse and Destiny Udogie epitomises Tottenham's fluidity in win over Fulham Tottenham fans pictured waving Israel flags during their clash against Fulham despite Premier League ban amid Palestine conflict Jamie Carragher argues Spurs fans would be 'delighted' with a place in the Champions League spots on Monday Night Football... and Wolves manager Gary O'Neil praises Ange Postecoglou's outlook Bayern Munich 'could be ready to raid Tottenham AGAIN' in January as Thomas Tuchel 'weighs up reuniting Harry Kane with a forgotten former team-mate' James Maddison is loving his blossoming bromance with 'nice guy' Son Heung-min... as Tottenham's £45m summer signing hails the impact of Ange Postecoglou's 'alpha male' management Jack Grealish meets up with his 'first football hero' at Man City's training ground... but can you recognise the iconic ex-Premier League striker? Harry Kane made his start to life at Bayern look EASY: He's scored for fun, embraced the culture and looks settled... only injury or an almighty collapse will stop him from finally winning trophies this season Jack Grealish has been OVERTAKEN by Jeremy Doku at Man City, claims CHRIS SUTTON as he says the England star will be 'a little bit worried' after the Belgian 'nailed down' his spot under Pep Guardiola on It's All Kicking Off Ange Postecoglou hopes Tottenham can provide 'escapism' to supporters affected by the war between Israel and Hamas as he looks to provide 'solace or comfort' to fans The festive football feast! Premier League clubs are braced for the league to schedule football every day except Christmas Day from December 22 until at least January 2 - with Arsenal v West Ham set to move back two days Harry Maguire has regained Erik ten Hag's trust and will be key as Man United face a derby with City and must-win games in Europe... the defender was written off but his professionalism could teach sulking Jadon Sancho a thing or two Sir Bobby Charlton's last surviving brother, Tommy, 77, makes heartfelt tribute to Man United legend following his death, saying: 'If ever there was a place reserved in heaven, it is for Bob' Pep Guardiola was WRONG to sell Cole Palmer to Chelsea, says Dominic King after the £42.5m winger scored against Arsenal... but Chris Sutton says you can't doubt the City boss' judgement as hosts clash on Mail Sport's It's All Kicking Off Strictly Come Dancing couple Janette Manrara and Alijaz Skorjanec drop surprise hints at baby number two - just three months after welcoming daughter Lyra Rose Man City's fury at fans' sick Sir Bobby Charlton chants: Man United's rivals apologise to football legend's family, as video emerges of chanting at their game shortly after he died aged 86 Former Man United star Andreas Pereira reveals his bizarre pre-match leg-rubbing superstition... and it's all linked to his love for Brazil icon Kaka Both Kalvin Phillips and Manchester City think it's 'very likely' he'll leave the club in January... with the out-of-favour midfielder keen to escape the Etihad in a bid to keep his England place ahead of Euro 2024 Luke Shaw expected to be OUT for another FIVE WEEKS, missing vital games against Man City and Copenhagen in the Champions League - but there's finally good injury news as Aaron Wan-Bissaka nears a return Tottenham issue BAN on national flags for game against Fulham - and tell fans a Premier League match 'is not an appropriate arena to display' them England 15-16 South Africa - Rugby World Cup semi-final RECAP: Agony for England as South Africa steal victory with a late penalty kick after leading for just TWO minutes in the game High-achieving pupil, 17, was stripped of his maths GCSE after exam question he found online during last-minute revision appeared on his exam paper I was once former Manchester United boss Louis van Gaal's favourite player, but now I'm struggling for game time in Poland Micah Richards reveals how he downed TEN drinks from a minibar the night before a Man City game - and tried to talk his way out of playing with Manuel Pellegrini after admitting boozing to the doctor Mauricio Pochettino fires a warning at one of his Chelsea stars - insisting he 'NEEDS to improve' and 'is not at his best' - as he reveals why he took him off during their 2-2 draw with Arsenal EXCLUSIVE INTERVIEW: Andy Carroll speaks on his new life in France's second division, wasting cash on a bengal cat, eating roast beef and Yorkshire pudding on matchdays and buying Sir Rod Stewart's Essex mansion Mauricio Pochettino jokes he would be 'KILLED' if he didn't start £222m stars Enzo Fernandez and Moises Caicedo in Chelsea's draw with Arsenal Man United stars are accused of IGNORING Rasmus Hojlund as Ruud Gullit claims they 'don't look for' the £72m Danish striker after he struggled in the win over Sheffield United Carlton Morris says 'fearless' Luton Town deserve to be in the Premier League as the Hatters star striker says they CAN stay up despite a stuttered start to life in the top flight Sir Bobby Charlton dies RECAP: The world reacts to the death of the World Cup winner and former Man United star at the age of 86 IN THE MONEY: Sir Jim Ratcliffe's Manchester United investment faces yet more delays over Old Trafford improvements... as both Chelsea and Newcastle plot their own ground expansions Raheem Sterling and Cole Palmer tussle over penalty in clash with Arsenal... but it's the former Man City academy startlet who wins the ball to open the scoring at Stamford Bridge Hannah just thought she was being clumsy, but her bruises were a sign she needed to see her doctor William Gallas names FOUR Premier League defenders who are better than William Saliba - including a Chelsea star - before telling fans to 'calm down' about the Gunners ace who is NOT world class East London pie and mash is mocked by foreign foodies who joke Britons 'eat like it's still WW2 and they've got to ration the food' Erik ten Hag bluntly tells Andre Onana to 'step up' and 'give better performances' after £47m goalkeeper's error-strewn start to his Man United career... but backs his ex-Ajax stopper to come good Mohamed Salah IS Liverpool's greatest ever player in the Premier League era - not Steven Gerrard - claims Mail Sport's Chris Sutton on It's All Kicking Off... and believes only one player in the top-flight's history is more ruthless Multiple Palestine flags held up at Anfield during Merseyside derby between Liverpool and Everton, despite the Premier League banning flags from matches this weekend to avoid potential incidents Dave Courtney's best friend reveals ex-gangster's last words before he shot himself with a pistol Tube driver who led chant of 'free, free Palestine' on London Underground train is suspended, TFL says Real Madrid 'eye a surprise move to lure Man City striker away from Pep Guardiola's squad', as Carlo Ancelotti looks to boost Los Blancos despite the lack of a release clause for the hit man US Grand Prix - Race LIVE: Max Verstappen overtakes Lando Norris to grab the lead in Austin, with Lewis Hamilton in second 'Very dirty' portrait of Mary Magdalene which was sold by London gallery to French collector for just £30,000 is actually the work of Italian renaissance master Raphael Could Bournemouth's Andoni Iraola be the first Premier League manager to be sacked? Cherries boss faces scrutiny with no win in his nine games Manchester United legends including Gary Neville and Brian Kidd join current squad and boss Erik ten Hag in signing messages of condolence in memory of Sir Bobby Charlton Barcelona kid Marc Guiu, 17, scores the winner just 30 seconds after coming off the bench for his debut as Xavi unearths another gem to put his side a point behind Real Madrid Why was Lewis Hamilton DISQUALIFIED four hours after coming second at the United States Grand Prix? Max Verstappen's model girlfriend is left SERIOUSLY unimpressed as he's booed after winning the US Grand Prix ahead of disqualified Lewis Hamilton Toto Wolff is backing Mercedes to learn from their mistakes and 'come back stronger' after taking Lewis Hamilton's disqualification from the US Grand Prix 'on the chin' EXCLUSIVE: Jose Antonio Reyes' father says his son and Mikel Arteta were 'like brothers' as his family open their doors to Mail Sport ahead of an emotional night as Arsenal and Sevilla face-off in the Champions League Manchester United confident rival Man City fans will respect minute's applause held for Sir Bobby Charlton ahead of Sunday's derby clash Ange Postecoglou slams his Tottenham side 'for taking liberties in possession' while claiming Spurs had 'the WORST 45 minutes we've had all year' despite now going nine games unbeaten in the Premier League after 2-0 win against Fulham EXCLUSIVE: Taylor Swift and Travis Kelce arrive at the Chiefs star's mansion in his Rolls Royce for party with friends and family catered by Kansas City BBQ joint - after the loved-up pair left win over Chargers together Harry Kane on cloud nine as he sets Bayern Munich club record by scoring ninth goal in opening eight Bundesliga games in 3-1 win over Mainz Was South Africa's 'white ****' slur lost in translation? Springboks fans say Bongi Mbonambi was speaking in Afrikaans - and Google Translate shows they may have a case Lewis Hamilton is DISQUALIFIED from the US Grand Prix nearly four hours after it finished for running an illegal floor - after Brit had finished second having pushed winner Max Verstappen close Taylor Swift: Travis Kelce's girlfriend shakes it off with Brittany Mahomes to celebrate Chiefs' touchdown, while the pop star gazes adoringly at boyfriend Travis Kelce during Chargers game Taylor Swift fans fume that Jackson Mahomes was allowed in the same Chiefs VIP box as pop superstar as he awaits hearing over alleged sexual battery: 'Someone get her out immediately' EXCLUSIVE: Taylor Swift heads to Travis Kelce's house for lunch of turkey omelet and chicken tacos after flying in from LA on her private jet to watch her man play in a fourth Chiefs game Ireland rugby star strips down to her pineapple-print underwear at Rugby World Cup, as she celebrates 'the party' despite her nation's early exit England's Tom Curry accuses South Africa's Bongi Mbonambi of calling him a 'white c***' in the Rugby World Cup semi-final with alleged racist slur picked up by the referee's mic Alan Jones pictured in blackface at Wallaby 'skit night' during famous Bledisloe Cup winning tour of New Zealand EXCLUSIVE: Travis Kelce pumps gas into his Cadillac en route to the Chiefs' team hotel ahead of clash against the Chargers, but will Taylor Swift be reuniting with him at Arrowhead? First images emerge of Travis Kelce's luxury new $6m Kansas mansion - complete with a swimming pool, waterfall and mini golf course - as he hunts for 'more privacy' amid his fledgling romance with Taylor Swift Shock merger between the PGA Tour and LIV Golf is at risk of collapse as Saudi defectors Phil Mickelson and Ian Poulter both warn of another huge exodus of big-name golfers to the breakaway circuit Taylor Swift may have anointed herself queen of Chiefs Kingdom but Kansas City's 31-17 win against Chargers belonged to boyfriend Travis Kelce Taylor Swift shakes it off next to Brittany Mahomes as they show off special handshake while cheering on their NFL men at Chiefs game KSI hires lawyer after controversial defeat to Tommy Fury, turning to a legal team in a bid to overturn the fight result after being more accurate with his punches Travis Kelce hilariously reveals his mom Donna put him on a LEASH as a child: 'She eventually got p****d and sick of us getting lost' What are Jackson Mahomes' alleged crimes and what has he been charged with? All the latest after he was spotted with Taylor Swift to watch Travis Kelce's Chiefs win Arsenal break silence over all-white squad team photo after race row as they accept their women's team 'does not reflect the diversity that exists across the club' World Rugby launch investigation into Tom Curry's allegation he was called a 'white ****' by South African hooker Bongi Mbonambi during England's Rugby World Cup semi-final defeat in Paris Georgetown University women's basketball coach Tasha Butts dead at 41: Tributes pour in for former star player after two-year cancer battle OLIVER HOLT: Never before have so many apologies been owed by so many to so few... ridiculed before the World Cup England came agonisingly close to one of their greatest EVER upsets against South Africa EXCLUSIVE: Ashlyn Harris loads her luggage into a taxi and heads to Newark Airport as she jets out of New York amid Ali Krieger split... after her ex-wife dropped hint she had cheated on her with new lover Sophia Bush Rapper Blueface proposes to his girlfriend in WILD day at the Rams game... after turning his private suite into a STRIP CLUB and offering rival players wads of cash to throw the game Celtic fans hold up Palestine flags during Scottish Premiership match at Hearts despite criticism from their own club over Palestinian support India cricket legend Bishan Singh Bedi dead at 77: Former spin bowler, who was his country's leading wicket taker before retiring in 1979, passes away after prolonged illness Travis Kelce has nervous 'alarms' going off in his head over new 'level of superstardom' from dating Taylor Swift, reveals his brother Jason: 'Man, this is a lot' That's why you don't look back! German triathlon leader falls a metre from the line to finish second - despite having led the full 13-mile running section before losing out at the death England rugby star hospitalised after brain infection which saw him struggle to open and close his eyes BBC axe football show MOTDX on the sly less than a month after Dan Walker became embroiled in fierce Football Focus row with Alex Scott Travis Kelce hilariously celebrates with a fist-pump as fan screams 'Let's go, Taylor's boyfriend' at him... after pop superstar Swift attended a FOURTH Chiefs game to watch him play Man United deny Jadon Sancho is set to return from his exile after fans thought Erik ten Hag said 'Sancho' and not 'Sergio' in his press conference when asked about fitness of left-back Reguilon Wish you were still here? Man United captain Bruno Fernandes meets up with booted-out goalkeeper David de Gea in Manchester amid £47m Andre Onana's struggles, as fans urge the Spaniard to 'come back in January' Travis Kelce: Taylor Swift's new lover arrives at Arrowhead for Chiefs' game against Chargers, before popstar follows after enjoying lunch at her boyfriend's house SIR CLIVE WOODWARD: These stars proved they are right behind Steve Borthwick - this cruel defeat can be a watershed moment Barcelona reveal CGI footage of their 'insane' stadium's renovation plans which includes a complete upper-tier reconstruction and a new roof emblazoned with their Spotify sponsor Andy Carroll lobs the goalkeeper with incredible 40-yard effort to make it back-to-back goals in as many games for Ligue 2 side Amiens SC ENGLAND PLAYER RATINGS: Ben Earl proves he is the breakthrough star of the whole tournament as Steve Borthwick's side say goodbye to some excellent servants Mary Lou Retton has returned HOME after 'scary setback' in her fight against rare form of pneumonia, as family reveal US Olympic legend is in 'recovery mode' after leaving the ICU Taylor Swift: CBS breaks out hilarious graphic showing Travis Kelce performs better with pop star in attendance and even uses her lyrics London Premier League Ange Postecoglou Share or comment on this article: Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table e-mail 9 shares 22 players on the pitch. Only 1 is English. So muc... by Nice1arry 46 Add comment Comments 293 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-23 21:39:50","image_url":"https://i.dailymail.co.uk/1s/2023/10/23/20/76906633-0-image-m-50_1698090748952.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2e99982288c78786a7928ff09b3dc365","title":"Papers: Gerrard under fire at Al Ettifaq","link":"https://www.skysports.com/football/news/20876/12991288/ajax-to-fail-with-mitchell-van-der-gaag-approach-steven-gerrard-under-fire-at-al-ettifaq-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Tuesday's newspapers...","content":"All the top stories and transfer rumours from Tuesday's newspapers... DAILY MAIL Ajax are likely to fail with any approach to lure Manchester United assistant boss Mitchell van der Gaag back to the club. Manchester United academy prospect Tyler Fletcher has switched his international allegiance back to Scotland from England. David De Gea continued to reunite with his old Manchester United team-mates on Monday, as Bruno Fernandes took to social media to share his 'coffee and friends' date with the goalkeeper and a handful of Red Devils stars. West Ham fans travelling to Greece this week will be wrapped in a protective police cocoon after Olympiakos' most recent match was abandoned amid a vitriolic atmosphere at the Karaiskakis Stadium. THE SUN Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Steven Gerrard is already under pressure from fans at Al Ettifaq. Football fans are reportedly set for a huge festive feast of Premier League action that could potentially see Christmas Day as the only day off from action. Galatasaray's goalkeeper Fernando Muslera has been praised for his incredible, injury-saving gesture to Besiktas' Valentin Rosier. England rugby league star Dominic Young was rushed to hospital after contracting a brain infection that left him unable to open his eyes. Francis Ngannou has thanked Cristiano Ronaldo after the football icon gifted the fighter a £110,000 watch. Jake Paul is set to rematch Nate Diaz in a mixed martial arts bout. DAILY MIRROR Erik ten Hag has suggested he may pair Anthony Martial with Rasmus Hojlund in attack for Manchester United. Graeme Souness has not pulled any punches over the state of Manchester United after admitting he's previously warned Sir Jim Ratcliffe not to invest in a football club. Mary Earps hit back at a \"hurtful\" comment from a Manchester United fan who accused the England No 1 of being \"too important\" to engage with supporters post-match. DAILY STAR Sir Alex Ferguson will pen his own personal tribute to Sir Bobby Charlton in the coming days, following the passing of his close friend. Sir Bobby Charlton's brother Tommy knows there is a special place in heaven for the \"loved\" footballing icon. Wrexham's movie star owner Rob McElhenney has roped in Hollywood A-lister Chris Pratt to gift Ryan Reynolds his birthday present. Please use Chrome browser for a more accessible video player THE TIMES Joe Root has said that England are not playing enough one-day international cricket to continue competing at World Cups and suggested that staging more 50-over county matches at the expense of the Vitality Blast could help to develop a new generation of talent. DAILY EXPRESS Erik ten Hag felt that Andre Onana should've focused on laying the early foundations of a successful career at Old Trafford rather than returning to international duty. Arsenal and Brighton are battling it out for the signature of Sunderland academy player Mason Cotcher. Chelsea are reportedly interested in signing Inter Milan star Alessandro Bastoni. Liverpool are reportedly interested in 21-year-old midfielder Ezequiel Fernandez. Red Bull will trim four junior drivers from their ranks in Formula 2 next season with Dennis Hauger, Zane Maloney, Enzo Fittipaldi and Jak Crawford all set to lose their backing from the reigning F1 constructor champions. TELEGRAPH Jonny Bairstow has opened up on Lord's stumping during the Ashes. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-23 21:00:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ee8644f062bc898c9c1a85e2f93a7304","title":"Indian cricket great Bishan Bedi dies at 77","link":"https://www.mercurynews.com/2023/10/23/indian-cricket-great-bishan-bedi-dies-at-77/","keywords":["Latest Headlines","News","Obituaries","Other Sports","Sports","World News","Cricket","Midday Wire","Obituary"],"creator":["The Associated Press"],"video_url":null,"description":"The orthodox spinner took 1,560 first-class wickets — the most by any Indian bowler ever — playing for various teams in India and England.","content":"NEW DELHI — Bishan Bedi, the India cricket great whose dazzling left-arm spin claimed 266 test wickets, has died. He was 77. The death of Bedi, who underwent multiple surgeries over the last two years that included a knee operation a month ago, was confirmed by the Board of Control for Cricket in India on Monday. “The BCCI mourns the sad demise of former India Test Captain and legendary spinner, Bishan Singh Bedi,” the BCCI wrote on X, formerly known as Twitter. “Our thoughts and prayers are with his family and fans in these tough times. May his soul rest in peace.” Born in Amritsar on Sept. 25, 1946, Bedi was part of the famous Indian spin quartet with Bhagwath Chandrasekhar, Erapalli Prasanna and Srinivas Venkataraghavan in the 1970s. Bedi earned his 266 wickets in 67 test matches, at an average of 28.71, with best innings figures of 7-98 and best match figures of 10-194. His last test match was against England at the Oval in 1979. At the time of his retirement, he was India’s leading wicket-taker before being overtaken by Kapil Dev a few years later. He averaged under nine runs in tests as a right-handed batter but had a highest score of 50 not out. He played only 10 ODIs between 1974-79, picking up seven wickets. The orthodox spinner took 1,560 first-class wickets — the most by any Indian bowler ever — playing for various teams including Delhi and Northern Punjab in India and Northamptonshire in England. He is survived by his wife and two children. India Prime Minister Narendra Modi led the tributes, saying on X: “His passion for the sport was unwavering and his exemplary bowling performances led India to numerous memorable victories. “He will continue to inspire future generations of cricketers. Condolences to his family and admirers.” Bedi made his test debut against West Indies on the last day of 1966, and took 21 wickets in a home test series against Australia at the end of 1969. He kept on troubling major test playing nations before eventually succeeding Mansoor Ali Khan as India skipper in 1976. His first win as test captain came at Port-of-Spain when India reached 406-4 in a historic chase. He led India 22 times in total, winning six of them. Geoff Allardice, chief executive of the International Cricket Council, said Bedi was one of the masters of flight and turn. “I would like to extend heartfelt condolences from everyone at the ICC to the family of one of the greats of the game and one whose exploits in test cricket will be remembered for a long time,” Allardice said. “He was the kind of spinner who could excel in different conditions and would have been one of the greats in any era.” Known for wearing colorful patkas and a graceful delivery hiding devastating variety, Bedi was outspoken on the field and often got embroiled in controversies. In 1976 he declared India’s second innings early at Kingston to protest hostile bowling by Caribbean fast bowlers. With three Indian batters already out of the game after being hit by West Indies pacers, Bedi claimed there weren’t enough fit players available to come out and bat. West Indies eventually won the test match by 10 wickets. Bedi also criticized Sri Lanka spin great Muttiah Muralitharan for his bowling action. He refused to compete in Kerry Packer’s lucrative World Series Cricket in 1978 and claimed that he was approached by the rebel cricket league. But his love for the game was clear, even when on the receiving end. Cricinfo.com website said Bedi “often applauded batters when they hit him for six.”","pubDate":"2023-10-23 20:24:00","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/10/SJM-L-OBBEDI-1023.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"5e9d33e1e9edd446757b951d955f33a7","title":"‘The greatest Manchester United player of all time’: British soccer legend Bobby Charlton dies at 86","link":"https://www.mercurynews.com/2023/10/23/the-greatest-manchester-united-player-of-all-time-british-soccer-legend-bobby-charlton-dies-at-86/","keywords":["Latest Headlines","News","Obituaries","Soccer","Sports","Midday Wire","Obituary"],"creator":["The Associated Press"],"video_url":null,"description":"He survived a 1958 plane crash that killed several of his Manchester United teammates, then later became the heart of the England team that won the World Cup in 1966.","content":"MANCHESTER, England— Bobby Charlton, an English soccer icon who survived a plane crash that decimated a Manchester United team destined for greatness to become the heartbeat of his country’s 1966 World Cup triumph, has died. He was 86. The death of Charlton, who is regarded by many as the greatest ever English player, was announced in a statement from his family that was released by United, which said he died Saturday surrounded by his family. No cause of death was disclosed. In November 2020, it was announced that Charlton had been diagnosed with dementia, the same disease that afflicted his brother Jack — who died in 2020 at age 85 — and another World Cup winner, Nobby Stiles. An extravagantly gifted attacking midfielder with a ferocious shot, Charlton was the leading scorer for both United (249 goals) and England (49 goals) for more than 40 years until being overtaken by Wayne Rooney. Charlton was easily recognizable with his comb-over, and known globally for being a gentleman of the beautiful game. “Sir Bobby was a hero to millions, not just in Manchester, or the United Kingdom, but wherever football is played around the world,” United said. “He was admired as much for his sportsmanship and integrity as he was for his outstanding qualities as a footballer; Sir Bobby will always be remembered as a giant of the game.” Alex Ferguson, who managed United from 1986-2013, said before Charlton’s death that he “is the greatest Manchester United player of all time — and that’s saying something.” “Bobby Charlton is absolutely without peer in the history of the English game,” Ferguson said. Charlton was also renowned for his humility and discipline. He was never sent off in 758 appearances for United from 1956-73 or 106 internationals for England from 1958-70. Charlton played with George Best and Denis Law in the so-called “Trinity” that led United to the 1968 European Cup title after surviving the 1958 Munich crash that wiped out the celebrated “Busby Babes” team. He won three English league titles at United, and one FA Cup. “For a footballer, he offered an unparalleled combination of grace, power and precision,” said former United defender Bill Foulkes, another survivor of the Munich air crash. “It added up to a greatness and something more — something I can only call beauty.” FIFA President Gianni Infantino described Charlton as a “football legend whose impact on the game spanned generations.” United great David Beckham said Charlton was “truly a national hero.” British Prime Minister Rishi Sunak called him ”one of the game’s greatest players.” Charlton’s England scoring record stood for 45 years until Rooney scored his 50th goal for the national team in September 2015. Three of his England goals came in the World Cup in 1966, during which Charlton played every minute for the team and stood out especially in the semifinals when he scored twice against Portugal to lead England to a first major final. England beat West Germany 4-2 after extra time in the title match at Wembley Stadium. Although Ryan Giggs beat Charlton’s appearance record for United in 2008, his scoring record for the club lasted another nine years. It was only in 2017 — 44 years after Charlton last wore the famous red jersey of England’s most successful club — that Rooney scored his 250th goal for United. United played a Premier League match against Sheffield United a few hours after Charlton’s death was announced. Man United’s players laid a wreath on the field ahead of the game, which the team won 2-1, and took part in a period of applause while a picture of a young Charlton was displayed on the screens inside the stadium. After retiring in 1973, Charlton went into coaching and founded a youth scheme that included Beckham among its participants. After brief spells in charge of Preston, Wigan and Irish side Waterford, Charlton returned to United in 1984 as a director and persuaded the board in 1986 to appoint Ferguson, who delivered 38 trophies during nearly 27 years in charge. Knighted in 1994 by Queen Elizabeth II, Charlton remains a mainstay at Old Trafford, featuring alongside Best and Law on a statue outside United’s stadium. Charlton avoided the controversies and distractions that damaged the career of Best, with his style and demeanor bringing a popularity that transcended the tribalism of club and international football. “I felt he could be a bit aloof,” the late Best said in a 2001 magazine interview. “We were never at each other’s throats, we simply didn’t go and have a pint together.” Charlton’s death left Geoff Hurst, who scored a hat trick in the 1966 final, as the only surviving member of that England team. “We will never forget him and nor will all of football,” Hurst said of Charlton on X, formerly known as Twitter. “A great colleague and friend, he will be sorely missed by all of the country beyond sport alone.” Robert Charlton was born Oct. 11, 1937, in the coal-mining town of Ashington, northeast England, and his talent was obvious from a young age. “We realized Bobby was going to be a bit special as a player when he was about 5 years old,” said Jack, his older brother. “He was always kicking a football or a tennis ball against a wall and when it bounced back it stuck to him like a magnet.” Charlton wrote in 2007 that his family sometimes relied on illegally caught salmon or rabbit to ward off hunger, while his father — also named Robert — gathered coal washed up on local beaches and sold it to bolster his income. His father’s commitment to his mining colleagues meant that in 1966 he missed Charlton scoring both goals against Portugal in that World Cup semifinal because he didn’t want someone else to have to cover for him in the pit. He was, however, persuaded to attend the final when the Charlton brothers lifted the trophy. Charlton’s playing career began far from home in Manchester after leaving school at 15, making his United debut three years later against Charlton in 1956. Within two years, tragedy struck the tight-knit group of United players whose relationship was forged as trainees in austere conditions. The team was still celebrating winning at Red Star Belgrade to secure a place in the European Cup semifinals when their plane caught fire on its third attempt to take off in heavy snow after a refueling stop in Germany. Charlton miraculously emerged from the smoldering wreckage with only light head injuries and picked his way through the wreckage to help survivors. Spotting manager Matt Busby groaning in agony on the smoke-shrouded runway, Charlton rushed to help the father-figure who had promoted him to the first team. But eight members of the “Busby Babes” team packed with bright prospects were among the 21 fatalities. They included Duncan Edwards, considered one of England’s most talented players at 21. “Sometimes it engulfs me with terrible anger and regret and sadness — and guilt that I walked away and found so much,” Charlton wrote in 2007. Charlton became driven by a lingering obligation to preserve the memories of the Munich dead, returning to action less than four weeks later and helping a hurriedly assembled team of survivors and stand-ins reach that season’s FA Cup final. Busby rebuilt his team around Charlton, adding the 1965 and 1967 English league titles to the championship they won in 1957. “There was always one great hope — the return to greatness of my beloved club,” Charlton said. The biggest prize of his club career arrived in 1968 as United became the first English club to become champion of Europe. Charlton scored twice in a 4-1 extra-time win over a Benfica team containing Portugal great Eusebio. But Charlton is perhaps best known for being part of the England team that won the World Cup. It remains England’s only major title in men’s soccer. Charlton and his brother fell out over Jack’s public assertion that Bobby’s wife caused him to become estranged from his mother. But the pair reconciled and Jack presented Bobby with a lifetime achievement trophy at the 2008 BBC Sports Personality of the Year Award. “We have had our public disputes, proving that in any family discord can sometimes disrupt the force of love and blood, but throughout that time I never lost the sense of wonder and gratitude that we were together in 1966 on such a great day in the history of our nation’s sport,” Bobby Charlton said. Charlton was rarely seen in public in the final years of his life after being diagnosed with dementia. He was never forgotten, though. “This man, from day one, was everything I wanted to be,” United striker Marcus Rashford wrote of Charlton after hearing about the diagnosis. “Kind, professional, caring, talented.” Another former United player, Phil Neville, told NBC that Charlton deserved to stand alongside the likes of Pele, Diego Maradona and Lionel Messi as a soccer great, because of what he achieved and the way he did it. “World champion. Gentleman. Legend. A true great who will be remembered forever,” Prince William, who is also president of England’s Football Association, wrote on X. Charlton is survived by his wife, Norma, whom he married in 1961, and his two daughters.","pubDate":"2023-10-23 19:28:03","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/10/SJM-L-OBCHARLTON-01-1023.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"a75ca9f28d22059ba3e10ec2e9146c6b","title":"Shoaib Akhtar Reacts To Pakistan's Defeat Against Afghanistan Cricket World Cup 2023, 'Most Embarrassing Defeat...'","link":"https://www.newsr.in/n/Sports/1zpnzuuou6/Shoaib-Akhtar-Reacts-To-Pakistan-Defeat-Against.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"In what was a monumental upset, Afghanistan's victory over Pakistan has thrown the points table into disarray, raising questions about Pakistan's prospects in the tournament. Reported by Zee News 1 hour ago.","content":"Monday, 23 October 2023 ( 2 hours ago ) In what was a monumental upset, Afghanistan's victory over Pakistan has thrown the points table into disarray, raising questions about Pakistan's prospects in the tournament. 👓 View full article","pubDate":"2023-10-23 18:37:22","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"}]}