{"newsArray":[{"title":"Former cricket captain Joe Root gives new-look England a flying start","link":"https://torontosun.com/sports/other-sports/former-cricket-captain-joe-root-gives-new-look-england-a-flying-start","keywords":null,"creator":["Norm Da Costa"],"video_url":null,"description":null,"content":null,"pubDate":"2022-06-07 23:59:15","image_url":null,"source_id":"torontosun","country":["canada"],"category":["sports"],"language":"english"},{"title":"ICC Cricket World Cup League Two: USA vs Oman, Match 1: Probable XIs, Match Prediction, Pitch Report, Weather Forecast and Live Streaming Details","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/icc-cricket-world-cup-league-two-usa-vs-oman-match-1-probable-xis-match-prediction-pitch-report-weather-forecast-live-streaming-details?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sports4All Cricket"],"video_url":null,"description":null,"content":null,"pubDate":"2022-06-07 19:14:59","image_url":"https://static.sportskeeda.com/editor/2022/06/a93de-16546235158740-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"“I’m happy to be a part of Garuda Aerospace”: MS Dhoni becomes brand ambassador and shareholder of this Chennai-based Drone startup","link":"https://thesportsrush.com/cricket-news-im-happy-to-be-a-part-of-garuda-aerospace-ms-dhoni-becomes-brand-ambassador-and-shareholder-of-this-chennai-based-drone-startup/","keywords":["Cricket","Garuda Aerospace","MS Dhoni"],"creator":["Gurpreet Singh"],"video_url":null,"description":"MS Dhoni becomes brand ambassador of the Chennai-based drone startup Garuda Aerospace; CEO terms it as his dream-come-true moment. Former team India captain Mahendra Singh Dhoni on Monday, invested in a Chennai-based drone startup – Garuda Aerospace, and is also set to become its brand ambassador and shareholder. This drone manufacturing company has the primary… The post “I’m happy to be a part of Garuda Aerospace”: MS Dhoni becomes brand ambassador and shareholder of this Chennai-based Drone startup appeared first on The SportsRush.","content":"MS Dhoni becomes brand ambassador of the Chennai-based drone startup Garuda Aerospace; CEO terms it as his dream-come-true moment. Former team India captain Mahendra Singh Dhoni on Monday, invested in a Chennai-based drone startup – Garuda Aerospace, and is also set to become its brand ambassador and shareholder. This drone manufacturing company has the primary role to offer the best possible farming solutions, with a total of about 400 drones and 500 pilots up their sleeve. Agnishwar Jayaprakash, founder CEO of Garuda Aerospace hailed it as his dream-come-true moment, and heartily welcomed him to the Garuda Aerospace family. “Mahi Bhai is the epitome of dedication and I firmly believe that having Captain Cool on our cap table adds tremendous value, which will motivate our team to perform better,” exclaimed Jayaprakash. “I am happy to be a part of Garuda Aerospace and look forward to witness their growth story with the unique drone solutions they have to offer,” said MS Dhoni as quoted in the startup’s statement. As per Jayaprakash, his company is on the path to become India’s first ever drone unicorn startup, whose manufacturing facilities were recently inaugurated by India’s incumbent Prime Minister Narendra Modi. The exact amount invested by the legendary cricketer has however, not been disclosed by either parties. Dhoni recently graced the Cricket field, with him being midway appointed the captaincy of the IPL franchise Chennai Super Kings (CSK) after having decided to hand over the responsibility to the flamboyant Indian all-rounder Ravindra Jadeja, before the commencement of IPL 2022. However, after a spree of losses, Jadeja decided to no longer shoulder the responsibility which was hampering his own performances with both bat and the ball. Another good news for the CSK fans is that their very own ‘Thala’ has also confirmed his availability for next year’s IPL season as well, in the capacity of a player.","pubDate":"2022-06-07 19:13:54","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Australia vs Sri Lanka, 1st T20I Highlights: Australia beat Sri Lanka by 10 wickets","link":"https://www.firstpost.com/firstcricket/sports-news/aus-vs-sl-1st-t20i-live-cricket-score-watch-sri-lanka-tour-of-australia-2022-live-update-highlight-live-streaming-online-10769431.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Australia vs Sri Lanka, 1st T20I Highlights: Australia beat Sri Lanka by 10 wickets","content":"Australia won the toss and elected to field first against Sri Lanka in the first Twenty20 at R. Premadasa Stadium on Tuesday. After bowling out Sri Lanka for 128, Australia wasted very little time and overhauled the target in just 14 overs, with ten wickets in hand.Click here for complete scorecard and commentaryAustralia are the T20 world champion and are the favourites to seal the series against ninth-ranked Sri Lanka. Nine of the Australia starting 11 were in the team which won the T20 World Cup last year. Australia won a series between them in February 4-1.Sri Lanka's biggest draw was legspinner Wanindu Hasaranga, who was the second highest wicket-taker in the recent Indian Premier League, but the leggie had an off day.This is the first time gates have been opened for fans in white-ball cricket in Sri Lanka since 2019 because of the pandemic. The 28,000-capacity stadium is sold out.The second T20 is at the same venue on Wednesday, and the teams move to Kandy for the last game on Saturday.Lineups:Sri Lanka: Pathum Nissanka, Danushka Gunathilaka, Charith Asalanka, Kusal Mendis, Bhanuka Rajapaksa, Dasun Shanaka (Captain), Wanindu Hasaranga, Chamika Karunaratne, Dushmantha Chameera, Maheesh Theekshana and Nuwan Thushara.Australia: Aaron Finch (Captain), David Warner, Mitchell Marsh, Glenn Maxwell, Steve Smith, Marcus Stoinis, Matthew Wade, Ashton Agar, Mitchell Starc, Kane Richardson and Josh Hazlewood.With inputs from AP","pubDate":"2022-06-07 18:22:40","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Steve-Smith-640_AFP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Australia thrash Sri Lanka by 10 wickets in first T20","link":"https://www.thestar.com.my/sport/cricket/2022/06/08/cricket-australia-thrash-sri-lanka-by-10-wickets-in-first-t20","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Reigning Twenty20 world champions Australia sealed a dominant 10-wicket victory over Sri Lanka in the first T20 international in Colombo on Tuesday after fast bowler Josh Hazlewood took four wickets and their openers comfortably chased a modest target. Read full story","content":null,"pubDate":"2022-06-07 17:56:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"PAK vs WI 2022 schedule Pakistan time: PAK vs WI schedule and fixtures","link":"https://thesportsrush.com/cricket-news-pak-vs-wi-2022-schedule-pakistan-time-pak-vs-wi-schedule-and-fixtures/","keywords":["Cricket","Pakistan","West Indies","West Indies tour of Pakistan 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"PAK vs WI 2022 schedule Pakistan time: The West Indies tour to the Asian nation would resume after almost a six-month gap. When the top Test playing nations like New Zealand and then England were criticized by the Pakistan Cricket Board (PCB) and the enthusiastic Pakistan Cricket fans for cancelling their away series against Pakistan,… The post PAK vs WI 2022 schedule Pakistan time: PAK vs WI schedule and fixtures appeared first on The SportsRush.","content":"PAK vs WI 2022 schedule Pakistan time: The West Indies tour to the Asian nation would resume after almost a six-month gap. When the top Test playing nations like New Zealand and then England were criticized by the Pakistan Cricket Board (PCB) and the enthusiastic Pakistan Cricket fans for cancelling their away series against Pakistan, it was the West Indies, who despite having been dented by a few COVID-19 cases in their camp before the start of the limited-Overs series, had decided to compete against the Babar Azam-led side. However, after the COVID-19 cases count went up to nine in squad by the end of the three-match series, there was no other option for both the Cricket boards, but to postpone it to the month of June. Thus, the series which was supposed to end by December 2021, will now resume from June 8 onwards, with a three-match ODI series, in the city of Multan. While West Indies, under their new limited-Overs skipper Nicholas Pooran, are coming on the back of a 3-0 ODI series victory against the Netherlands, Pakistan would play an ODI after almost two months, having last defeated Australia 2-1 during the ODI series in March-April. The final practice before the ODI showdown 🙌 #KhelAbhiBaqiHai | #PAKvWI pic.twitter.com/FYbLRPgduG — Pakistan Cricket (@TheRealPCB) June 7, 2022 With a maximum temperature expected to reach the 45 degrees Celsius mark, the heat would be literally on between the two sides as they square off at the Multan Cricket Stadium. The extreme heat conditions has also meant that the start time for the ODI series has been pushed an hour further to 04:30 pm local time . Interestingly, the last time Pakistan hosted an international match at this time was back in June-July 2008 during the Asia Cup (information source: Cricbuzz ). First ODI – 08/06/2022, at the Multan Cricket Stadium, Multan (04:30 pm onwards) Second ODI – 10/06/2022, at the Multan Cricket Stadium, Multan (04:30 pm onwards) Third ODI – 12/06/2022, at the Multan Cricket Stadium, Multan (04:30 pm onwards).","pubDate":"2022-06-07 17:41:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Adil Rashid hopeful of making comeback to England Test team with new coach Brendon McCullum in charge","link":"https://zeenews.india.com/cricket/adil-rashid-hopeful-of-making-comeback-to-england-test-team-with-new-coach-brendon-mccullum-in-charge-2471374.html","keywords":null,"creator":null,"video_url":null,"description":"Adil Rashid has continued to prosper in limited-overs cricket, winning the World Cup and becoming England's leading T20 wicket-taker","content":"Former New Zealand cricketer, Brendon McCullum became the England Test team' s head coach after Chris Silverwood stepped down from the role following England's horrific 4-0 Ashes defeat against Australia. McCullum as new England coach has given Adil Rashid (34-year-old spinner) hopes of returning to the Test squad after being sidelined for more than three years now. The leg-spinner last played a Test for England against the West Indies at Barbados in January 2019, and feels that with the new setup of coach McCullum and skipper Ben Stokes, it could be \"exciting times\" for the longest form of cricket in the country. Rashid has continued to prosper in limited-overs cricket, winning the World Cup and becoming England's leading T20 wicket-taker, but he continues to be on the fringes of Test cricket, though that could change as he and all-rounder Moeen Ali have been \"tapped up\" by McCullum, according to Daily Mail. \"It's always exciting when something new comes along,\" Rashid was quoted as saying in the report. This will never get old! Happy birthday, Adil Rashid... pic.twitter.com/jC92Sq7DIi — England Cricket (@englandcricket) February 17, 2020 \"Brendon McCullum and Ben Stokes both like to be positive and attacking. That drives me on and it's very exciting. Brendon's reached out to me -- just a text to check how things are. I've not closed the door on Test cricket. I've not retired, or anything like that. It's something that's still there. It's everyone's dream to play Test cricket and I'm no different.\" Recently Moeen Ali, who retired from Test cricket last year to prolong his white-ball career, too had said that he was not averse to coming out of retirement if the new England Test coach so desired. Rashid was dropped from the England side after playing his 19th Test, against the West Indies at Barbados in January 2019, as he returned forgettable figures of none for 117 in the team's loss. Pace bowler Stuart Broad replaced him in Antigua. Rashid then began his preparations for the World Cup at home and the rest is history. But his Test aspirations were ignited when McCullum \"tapped\" Rashid and Moeen after taking over the England job from Chris Silverwood recently. \"He's (Moeen) like a brother to me. It's definitely a conversation we'd have, and that would inspire me. It (Test return) could happen. But for us to get to that point, a lot else has got to happen too,\" added Rashid. \"But things have changed. There are exciting times ahead... For me, the door isn't closed,\" he said. With IANS inputs","pubDate":"2022-06-07 17:03:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“I always placed him above other legends”: Why Hardik Pandya reckons Wasim Jaffer as his favourite cricketer?","link":"https://thesportsrush.com/cricket-news-i-always-placed-him-above-other-legends-why-hardik-pandya-reckons-wasim-jaffer-as-his-favourite-cricketer/","keywords":["Cricket","Hardik Pandya","Wasim Jaffer"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Hardik Pandya reckons Wasim Jaffer as the one cricketer he has always looked up to while growing up ahead of the South Africa series. Out of the on-field action since the 2021 T20 World Cup last year, all-rounder Hardik Pandya announced his arrival in competitive Cricket in some style, as he not only led the… The post “I always placed him above other legends”: Why Hardik Pandya reckons Wasim Jaffer as his favourite cricketer? appeared first on The SportsRush.","content":"Hardik Pandya reckons Wasim Jaffer as the one cricketer he has always looked up to while growing up ahead of the South Africa series. Out of the on-field action since the 2021 T20 World Cup last year, all-rounder Hardik Pandya announced his arrival in competitive Cricket in some style, as he not only led the Gujarat Titans (GT) to their maiden IPL title in their debut season, but also shone with the bat, finishing the dream run as the team’s highest run-getter. His all-round show with both bat and the ball even earned him the ‘Player of the match’ award during the IPL 2022 grand finale against the Rajasthan Royals (RR), making him only the third captain ever to win the award in an IPL final. This one’s ours, Gujarat 🏆❤️ @gujarat_titans pic.twitter.com/Qjr56FsFWs — hardik pandya (@hardikpandya7) May 30, 2022 Moreover, his impressive performance also fittingly earned him a call back in the team India squad for the imminent five-match home T20I series against South Africa. During a recent interaction however, the 28-year-old made an interesting revelation as to which cricketer he always looked up to while growing up. During an interaction with the SG Podcast, the flamboyant all-rounder named former team India opening batter Wasim Jaffer as his favourite cricketer. While Pandya admitted to have likeness for the greats of the game like Sachin Tendulkar, Jacques Kallis, Virat Kohli et al, it is the legendary batter from Mumbai who had caught his attention the most amidst the well-renowned stars. “Like everyone, I had favourite cricketers. I liked Jacques Kallis, Virat, Sachin sir. There are so many greats that you can’t pick. My favourite cricketer was actually Wasim Jaffer. I used to love watching him bat. Someone I always placed him above other legends. Somehow, I used to copy his batting, but I was never able to get his class,” Hardik revealed on the SG podcast . Jaffer is fondly remembered by the ardent Indian Cricket fans, primarily for his double hundreds against West Indies and Pakistan, and his magnificent ton against a top-quality South African bowling line-up in Cape Town (2007). A domestic giant as well, the former classy right-hander had, a couple of years ago, even went on to become the first player in Ranji Trophy history to score 12,000 runs in the competition for Mumbai and Vidarbha.","pubDate":"2022-06-07 16:47:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Lewis Hamilton getting overshadowed by cricket at Silverstone”- How England’s World Cup victory spoiled seven time World Champion’s after race party","link":"https://thesportsrush.com/f1-news-lewis-hamilton-getting-overshadowed-by-cricket-at-silverstone-how-englands-world-cup-victory-spoiled-seven-time-world-champions-after-race-party/","keywords":["F1","British GP","Lewis Hamilton","Mercedes"],"creator":["Somin Bhattacharjee"],"video_url":null,"description":"Lewis Hamilton won the 2019 British Grand Prix in Silverstone but the crowd was more focused elsewhere during the after race celebrations. 14th July 2019 was a historic day for sports in England. We had three major sporting events take place that day in the country. Novak Djokovic took on Roger Federer in the finals… The post “Lewis Hamilton getting overshadowed by cricket at Silverstone”- How England’s World Cup victory spoiled seven time World Champion’s after race party appeared first on The SportsRush.","content":"Lewis Hamilton won the 2019 British Grand Prix in Silverstone but the crowd was more focused elsewhere during the after race celebrations. 14th July 2019 was a historic day for sports in England. We had three major sporting events take place that day in the country. Novak Djokovic took on Roger Federer in the finals of the Wimbledon Championships. It was a match for the ages, that lasted for 4 hours and 57 minutes, and went in Djokovic’s favor. It was also the day one of the greatest Cricket World Cup Finals of all time, took place. New Zealand took on hosts England at Lords, in what was a nail biting finale to the tournament. I’m stressed Cricket World Cup final British Grand Prix Wimbledon Scottish Open I don’t own enough screens! — Thomas Bjørn (@thomasbjorngolf) July 14, 2019 The match was tied after 5o overs for both sides, and went into super over. Even after that their scores were equal, and England only ended up winning by virtue of them scoring more boundaries that day. Meanwhile at Silverstone, hometown hero Lewis Hamilton continued his charge towards a sixth World Title. He won the British Grand Prix, extending his lead at the top to 39 points. However, the local fans in Silverstone seemed more interested in the Cricket World Cup final at Lords! Also read: “First time win for Hamilton in 2010”- Lewis Hamilton’s 2010 Turkish Grand Prix winning McLaren car sold for whopping $6 Million Dollars Fans paid more attention to cricket than to Lewis Hamilton Hamilton is the greatest F1 driver Britain has ever produced. Every single year, over a hundred thousand fans flock to the track to watch and support the Mercedes star, but in 2019 circumstances were slightly different. While fans were happy that Hamilton won the race, they were more interested in the nail biting finish between England and New Zealand’s cricket match. The match was being shown on the big screen until Hamilton arrived on stage for his after race celebrations. After the 37-year old’s arrival, the screen stopped showing the cricket match, much to a large majority’s disappointment. They soon found another screen showing the game, and all the heads turned away from where Hamilton was standing. Even the Mercedes team members along with Hamilton got excited about the finish to the Cricket final, and watched it with the fans for a while. After England won the thriller, the crowd at Silverstone celebrated by singing Queen’s super-hit song, ‘We are the Champions!’ The locals fans could celebrate not one, but two victories that day! Also read: “$2.7 million Mercedes car with F1 engine banned”- Why Mercedes-AMG ONE Formula 1 car has been banned in US   The post “Lewis Hamilton getting overshadowed by cricket at Silverstone”- How England’s World Cup victory spoiled seven time World Champion’s after race party appeared first on The SportsRush.","pubDate":"2022-06-07 16:30:36","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs South Africa | Unrealistic to expect players like Rohit Sharma turn up for every series: Rahul Dravid - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMirQFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L2luZGlhLXZzLXNvdXRoLWFmcmljYS11bnJlYWxpc3RpYy10by1leHBlY3QtcGxheWVycy1saWtlLXJvaGl0LXNoYXJtYS10dXJuLXVwLWZvci1ldmVyeS1zZXJpZXMtcmFodWwtZHJhdmlkLTE5NTk2MDQtMjAyMi0wNi0wN9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa | Unrealistic to expect players like Rohit Sharma turn up for every series: Rahul Dravid  India Today\"Need To Be Realistic...\": Indian Cricket Team Coach Rahul Dravid's Big Statement On Umran Malik  NDTV SportsDravid enthused by Hardik's return to bowling and hints he might play as finisher for India  ESPNcricinfo'That's why he's been picked...': Dravid on Karthik's role in IND vs SA series  Hindustan TimesIndia vs South Africa: Hardik Pandya Part Of Leadership Group? What Rahul Dravid Said  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-06-07 16:19:24","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa: Hardik's leadership in IPL impressive, says Rahul Dravid","link":"https://www.thehansindia.com/sports/cricket/india-vs-south-africa-hardiks-leadership-in-ipl-impressive-says-rahul-dravid-747331","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Hardik Pandya led Gujarat to the IPL title in their maiden seasonHe earned MoM for his all-round show in the finalGujarat defeated Rajasthan by 7 wickets to win IPL 2022","content":"Hardik Pandya led Gujarat to the IPL title in their maiden season India head coach Rahul Dravid has heaped praise on Gujarat Titans (GT) skipper Hardik Pandya 's captaincy, saying there is no need to be a designated leader to be a part of Team India's leadership group. Speaking ahead of India's first T20I against South Africa, Dravid on Tuesday also confirmed that the players, who were part of the Indian Premier League (IPL) 2022 final on May 29, were given an extra day's rest. \"I just met Hardik a couple of hours ago. For the guys who played the final, we gave them an extra day off. But I think his leadership was very impressive right through the IPL. He performed very well. In this sense, you don't have to be designated as a leader to be part of any leadership group. It's not only about Hardik being designated in a position. At this point in time, it's really about its good from our perspective that he has started bowling again. \"We know what that does for us, and what his bowling can add to our depth. It's about ensuring that we can get the best out of him as a cricketer, in terms of bowling, batting, and fielding, and in terms of what happens ahead, it depends on many factors. The selectors will take that decision, in terms of what happens in the future,\" said Dravid in the pre-match conference on Tuesday. Newcomers Gujarat Titans, led by Hardik, defeated Rajasthan Royals to claim the IPL 2022 title. The all-rounder bagged the Player of the Match in the grand finale, especially for his contribution with the ball. Hardik picked up three wickets for just 17 runs in his quota of four overs. During Gujarat's chase of 131, Hardik scored a 30-ball 34. CHAMPIONS 🏆 This is for all the hard work we've put in! Congratulations to all the players, staff, fans ❤️❤️❤️ @gujarat_titans pic.twitter.com/zEeqdygBEy Dravid also acknowledged the fact that other Indian captains did well too in the IPL, such as KL Rahul (Lucknow), Shreyas Iyer (Kolkata), and Sanju Samson (Rajasthan). \"It is great we have got a lot of Indian captains doing well in the IPL. Hardik was one of them, Rahul did very well for LSG, and Sanju captained RR. Shreyas did it at KKR as well. It helps people grow and develop as players. It really helps you grow as a person also, having to make decisions. It is great from our perspective to see that,\" added Dravid in the same conference that took place in Delhi. Meanwhile, the BCCI selectors have also picked up Arshdeep Singh and Umran Malik after their impressive performances in the IPL 2022. Would love to see Umran Malik turn into good red-ball bowler, says Rahul Dravid Sunrisers Hyderabad (SRH) pacer Umran consistently amazed all with his pace that was never seen before in Indian cricket. While that sure has caught Dravid's eye, the head coach expects the Jammu and Kashmir fast bowler to turn into a fine red-ball bowler as well. \"It is exciting. He certainly bowled quick and with pace. Another thing that has been interesting for me watching the IPL from the outside is the number of Indian bowlers bowling fast. And obviously, being the coach of all three formats of the game, I would love to see that translated into the longer formats of the game. But it is brilliant in terms of watching Umran in the nets, you can see that he has got that pace. pic.twitter.com/PxR49tiKSc \"Obviously, he is learning. He is a young boy and he is getting better, and improving. The more he is able to play, the better he is going to get. From our, perspective, very happy to have someone like him in the mix. We have to see how much playing time we can give him, we need to be realistic, we have a large squad, and it is not possible to give everyone playing XI time,\" Dravid explained further. India and South Africa are set to lock horns in a five-match T20I series, starting Thursday (June 9) in Delhi.","pubDate":"2022-06-07 16:16:45","image_url":"https://assets.thehansindia.com/h-upload/2022/06/07/500x300_1296580-bcci.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Dravid enthused by Hardik's return to bowling and hints he might play as finisher for India - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMinAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2luZC12cy1zYS0yMDIyLTFzdC10MjBpLWRyYXZpZC1lbnRodXNlZC1ieS1oYXJkaWstcmV0dXJuLXRvLWJvd2xpbmctYW5kLWhpbnRzLWhlLW1pZ2h0LXBsYXktYXMtZmluaXNoZXItZm9yLWluZGlhLTEzMTg3NDbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Dravid enthused by Hardik's return to bowling and hints he might play as finisher for India  ESPNcricinfo\"Need To Be Realistic...\": Indian Cricket Team Coach Rahul Dravid's Big Statement On Umran Malik  NDTV Sports'That's why he's been picked...': Dravid on Karthik's role in IND vs SA series  Hindustan TimesUmran might have to wait for his debut, hints Dravid  Greater KashmirIndia vs South Africa: Hardik Pandya Part Of Leadership Group? What Rahul Dravid Said  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-06-07 16:13:20","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Experience has helped a more mature David Miller deal with pressure","link":"https://www.iol.co.za/sport/cricket/proteas/experience-has-helped-a-more-mature-david-miller-deal-with-pressure-3d0dfc6e-406e-433d-903f-ccfdd50e9764","keywords":null,"creator":["Zaahier Adams"],"video_url":null,"description":"Since quitting red-ball cricket in 2018, a more mature David Miller has averaged 57.18 in ODIs and 39 at a strike-rate of 143.55 in T20Is.","content":null,"pubDate":"2022-06-07 15:26:26","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/dba57892-1460-5da1-bc0f-ff1c08baf649&operation=CROP&offset=0x49&resize=2430x1367","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"India vs South Africa: Unwise to expect everyone to be available all the time, says Rahul Dravid","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-south-africa-unwise-to-expect-everyone-to-be-available-all-the-time-says-rahul-dravid-10769631.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs South Africa: Unwise to expect everyone to be available all the time, says Rahul Dravid","content":"Team India head coach Rahul Dravid has defended the decision to rest big players like Rohit Sharma, Virat Kohli and Jasprit Bumrah, saying that it would be ‘unwise’ to expect everyone being available all the time.With the Indian Premier League (IPL) having concluded on 29 May, the focus now shifts back to international cricket, with India, led by stand-in skipper KL Rahul, taking on South Africa in a five-match home T20I series. The series will act as a tuneup to the T20 World Cup in Australia later this year but star players like the trio have been rested keeping the workload management in mind.\"Rohit is our all-format player. It would be unwise to expect everyone to be available all the time. We want them to be fit and fresh as well. There would be times where we would have to rest our big players,\" Dravid said at the pre-match press conference in Delhi on Tuesday.All three were part of the IPL 2022, with Rohit's MI, where Bumrah also plays, suffering a league-stage exit. RCB, meanwhile, missed out on the final after going down to RR in Qualifier 2.The first T20I will be played at the Arun Jaitley Stadium in Delhi on Thursday.Dravid urged the Indian top-order to deliver. \"We are looking for good starts. We know our top 3. If it is high scoring games, we would want them to maintain that strike rate throughout but there would be tricky matches too. We have the kind of quality at top 3, who can deliver,\" continued the former India batter.Unlike the Indian team, South Africa have named a star-studded squad with Temba Bavuma leading the side. GT’s IPL 2022 winner David Miller, Kagiso Rabada, Anrich Nortje, Marco Jansen and Quinton de Kock are some of the big names who will take part in the upcoming series.India, meanwhile, will be led by KL Rahul, and SRH’s Umran Malik, who shone with his ball and pace finds place in the squad, so does Arshdeep Singh. Hardik Pandya will be looking to utilise his all-round abilities, while Dinesh Karthik too returns to the T20I side after a prolonged absence.The first T20I will be followed by four more matches on 12, 14, 17 and 19 June.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-07 15:01:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2021/10/Rahul-Dravid-640-1-11.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"SL vs AUS streaming channel in India and UK: Sri Lanka vs Australia T20 2022 live TV channel in USA","link":"https://thesportsrush.com/cricket-news-sl-vs-aus-streaming-channel-in-india-and-uk-sri-lanka-vs-australia-t20-2022-live-tv-channel-in-usa/","keywords":["Cricket","Australia tour of Sri Lanka 2022","Sri Lanka vs Australia T20Is"],"creator":["Gurpreet Singh"],"video_url":null,"description":"SL vs AUS streaming channel in India and UK: Australia commence with their multi-format tour of Sri Lanka with a three-match T20I series. During the first T20I of the ongoing Australia’s tour of Sri Lanka at the R Premadasa Stadium in Colombo, Australia skipper Aaron Finch has won the Toss and elected to bowl first… The post SL vs AUS streaming channel in India and UK: Sri Lanka vs Australia T20 2022 live TV channel in USA appeared first on The SportsRush.","content":"SL vs AUS streaming channel in India and UK: Australia commence with their multi-format tour of Sri Lanka with a three-match T20I series. During the first T20I of the ongoing Australia’s tour of Sri Lanka at the R Premadasa Stadium in Colombo, Australia skipper Aaron Finch has won the Toss and elected to bowl first on what looks like an excellent pitch to bat on. True to the nature of the pitch, the young Sri Lankan side got off to an excellent start with their opening pair of Pathum Nissanka (36 off 31) and Danusha Gunathilaka (26 off 15) racing away with their stand of 39 runs in mere 4.2 Overs. 24-year-old Charith Asalanka then carried on with the fiery start as he alongside Nissanka, took the team total beyond the 100-run mark in only their 12 Over. After 12 overs, Sri Lanka are 100/2. Any prediction for the final score? #SLvAUS #CheerForLions pic.twitter.com/KpguuzIWXo — Sri Lanka Cricket 🇱🇰 (@OfficialSLC) June 7, 2022 Australia’s in-form pacer Josh Hazlewood has been the pick of the Australian bowlers so far, having gotten rid of Gunathilaka, while leaking mere 7 runs in his two Overs thus far. For those unaware, the ongoing three match T20I series would also be followed by a five-match ODI series and a couple of Test matches as well. While Sri Lanka have forged a decent side comprising promising youngsters, world champions Australia have also toured with an almost full strength squad. The ongoing multi-format series between the two sides would be broadcast live on the Sony Sports network in India. Sony Six and Sony Ten 2 are the particular channels which are currently on with the live broadcast of the ongoing first T20I and then the rest of the matches as well. Online users can also watch the match live on the Sony Liv app after paying the subscription fees. As far as the fans in UK are concerned, they can catch-up with the live broadcast on the ‘HUM Masala’ channel. USA viewers can watch the same live on Willow TV (TV and digital).","pubDate":"2022-06-07 14:56:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Joe Root can break Sachin Tendulkar's Test record, says Michael Vaughan","link":"https://www.thehansindia.com/sports/cricket/joe-root-can-break-sachin-tendulkars-test-record-says-michael-vaughan-747322","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Joe Root now has over 10,000 runs to his name in TestsHe reached the 10K milestone during the 1st Test vs NZRoot is also England’s second-leading run-scorer in Tests","content":"Joe Root now has over 10,000 runs to his name in Tests Former England captain Michael Vaughan has said it is highly likely to see Joe Root break legendary Sachin Tendulkar's record of most runs in Test cricket. During England's win over New Zealand in the first Test at Lord's, Root surpassed the 10,000-mark in the longest format. Among the English batters, Root is the second leading run-scorer after Alastair Cook, who ended his career with over 12,000 runs in Tests. Root became the 14th cricketer and the second Englishman after Cook to achieve the record. Courtesy of Root's 115 in the second innings, which was his 26th Test century, England sealed the game by five wickets and went 1-0 up in the three-match Test series. Praising Root, Vaughan called the former England captain the country's \"best ever\" Test batsman. \"Joe Root is England's best ever - now Sachin Tendulkar should watch out. For me, Joe Root stands alongside Graham Gooch as England's greatest batsman, and the way he is going he could surpass Sachin Tendulkar's record for the most Test runs. \"He is still 6000 short of Sachin's total but he is only 31 and if James Anderson can play until he is 40, then I think Joe can too. He loves batting that much. He is driven. He is a cricket badger. You have to have it in you to wake up every morning and think about batting,\" Vaughan wrote in his column for The Telegraph. Joe Root's Test average in each year of his career2012: 932013: 34.482014: 97.122015: 60.212016: 49.232017: 50.842018: 41.212019: 372020: 42.182021: 612022: 44 #ENGvNZ pic.twitter.com/LCFZXOC9i6 Earlier, former Australian batsman Mark Taylor said that if Root continued the same rhythm, he can easily go past the 15,000-mark without breaking much sweat. \"Root has a minimum of five years left in him, so I think Tendulkar's record is very achievable. Root is batting as I have ever seen him bat over the last 18 months to two years. He is in the prime of his career, so there are 15,000 runs-plus for him if he stays healthy,\" Taylor told Sky Sports. Root took 169 days fewer than Tendulkar to reach the 10,000-run landmark. The former Indian batter was 31 years and 326 days when he reached 10,000 Test runs, but went on to play even after his 40th birthday. Tendulkar, who holds the record for most Test runs, finished his career with 15,921 runs in 200 Tests. No other batter has even touched the 14,000-mark to date apart from the Master Blaster. Meanwhile, former England captain Alastair Cook did not get into the debate of whether Root can break Tendulkar's record, but he showed his appreciation of Root's achievements. \"I was so glad I was here to witness that - an unbelievable knock by an unbelievable player. He is the most complete England batsman in all forms,\" said Cook. The second Test between England and New Zealand is due to begin on Friday (June 10) at Trent Bridge, Nottingham.","pubDate":"2022-06-07 14:48:49","image_url":"https://assets.thehansindia.com/h-upload/2022/06/07/500x300_1296571-michael-vaughan.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka cricket coach 2022: Full list of Sri Lanka cricket support staff for Australia series","link":"https://thesportsrush.com/cricket-news-sri-lanka-cricket-coach-2022-full-list-of-sri-lanka-cricket-support-staff-for-australia-series/","keywords":["Cricket","SL vs AUS","SLC","Sri Lanka"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Sri Lanka cricket coach 2022: The SportsRush brings you the list of the support staff of the Sri Lankan national team. Sri Lankan cricket has been through a lot of ups and downs in the last few years with continuous changes in the leadership and coaching unit. The upcoming series against Australia is an important… The post Sri Lanka cricket coach 2022: Full list of Sri Lanka cricket support staff for Australia series appeared first on The SportsRush.","content":"Sri Lanka cricket coach 2022: The SportsRush brings you the list of the support staff of the Sri Lankan national team. Sri Lankan cricket has been through a lot of ups and downs in the last few years with continuous changes in the leadership and coaching unit. The upcoming series against Australia is an important one for Sri Lanka economically as well. Under the coaching of Chris Silverwood, the side would want to do well in the upcoming series. Dasun Shanaka has emerged as an able leader in the last few months, and the arrival of players like Wanindu Hasaranga has made the case of the side strong in the shortest format of the game. Sri Lanka cricket coach 2022 Former English coach Chris Silverwood is the head coach of the side. Silverwood was sacked by the England team after the Ashes 2021-22 disappointment. Former Sri Lankan player Naveed Naweez is the assistant coach of the side, and this is his first stint with the national side. Nawaz played one Test and three ODIs for Sri Lanka between 1998 and 2002 Media Conference with Chris Silverwood – Head Coach/ Naveed Nawaz – Assistant Coach/ Mahinda Halangode – Team Manager held today evening at the RPICS, Colombo. #SLC #lka pic.twitter.com/5rjJopgIlx — Sri Lanka Cricket (@OfficialSLC) May 4, 2022 Ahead of the Australia series, SLC named Lasith Malinga as the ‘bowling strategy coach’ of the side. Malinga was the bowling coach of Rajasthan Royals in IPL 2022, and he also worked with Mumbai Indians in IPL. Earlier this year, SLC appointed Malinga in almost the same kind of role on the Australian tour. “Sri Lanka Cricket wishes to announce the appointment of Lasith Malinga, the Sri Lankan fast bowling legend and former captain of the ODI and T20I team, as the ‘Bowling Strategy Coach’ of the National Team for the white ball segment of the Australia Tour of Sri Lanka,” said the Sri Lanka Cricket Board in a statement. Head Coach: Chris Silverwood Batting Coach: Ruwin Peiris Assistant Coach: Naveed Nawaz Spin Bowling Coach: Piyal Wijetunge Fast Bowling Coach: Lasith Malinga Fielding Coach: Anton Roux Physiotherapist: Brett Harrop The post Sri Lanka cricket coach 2022: Full list of Sri Lanka cricket support staff for Australia series appeared first on The SportsRush.","pubDate":"2022-06-07 14:39:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Why Australian team wearing black armbands today: Why are Australian cricketers wearing black armbands vs Sri Lanka in Colombo T20I?","link":"https://thesportsrush.com/cricket-news-why-australian-team-wearing-black-armbands-today-why-are-australian-cricketers-wearing-black-armbands-vs-sri-lanka-in-colombo-t20i/","keywords":["Cricket","Andrew Symonds","Australia","Australia tour of Sri Lanka 2022","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Australian team wearing black armbands: Australian cricketers are donning black armbands in the ongoing first T20I. During the first T20I of the ongoing Australia’s tour of Sri Lanka in Colombo, Australia speedster Josh Hazlewood put an end to a potentially dangerous 39-run opening partnership between Pathum Nissanka and Danushka Gunathilaka (26) after captain Aaron… The post Why Australian team wearing black armbands today: Why are Australian cricketers wearing black armbands vs Sri Lanka in Colombo T20I? appeared first on The SportsRush.","content":"Why Australian team wearing black armbands: Australian cricketers are donning black armbands in the ongoing first T20I. During the first T20I of the ongoing Australia’s tour of Sri Lanka in Colombo, Australia speedster Josh Hazlewood put an end to a potentially dangerous 39-run opening partnership between Pathum Nissanka and Danushka Gunathilaka (26) after captain Aaron Finch won the toss and chose to field. It all happened on the second delivery of the fifth over when Gunathilaka found a lone boundary rider in Australia all-rounder Mitchell Marsh at deep point. Wanting to hit Hazlewood for a second consecutive boundary, Gunathilaka couldn’t manage to find a gap resulting in his dismissal after hitting three fours and a six at a strike rate of 173.33. The crowd noise in Colombo is phenomenal. It’s been incredibly sad watching the news out of Sri Lanka in recent months, and it’s a small thing in the wider context, but I hope everyone there has a brilliant night full of joy. #SLvAUS — Melinda Farrell (@melindafarrell) June 7, 2022 As most of the fans must have noticed by now, Australian cricketers are wearing black armbands at the R Premdasa Stadium tonight. It is worth mentioning that the same has been done as a mark of respect and tribute towards former Australia all-rounder Andrew Symonds. Symonds, 46, died at the scene after being a lone occupant in a single-vehicle car crash near Townsville last month. Tonight is the first time when Australia are playing international cricket since Symonds’ unfortunate and shocking demise. Symonds, who played 238 matches across formats between 1998-2009 for Australia, will be primarily remembered as a dual World Cup-winner due to his involvement in the 2003 and 2007 Australian squad. An outright entertainer on a cricket ground, Symonds left behind a family of three including wife Laura, son Billy and daughter Chloe. The tragic incident had invited reactions from former cricketer such as Adam Gilchrist , Shane Watson , Brian Lara and many others.","pubDate":"2022-06-07 14:12:26","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Why is Pat Cummins not playing today’s 1st T20I between Sri Lanka and Australia in Colombo?","link":"https://thesportsrush.com/cricket-news-why-is-pat-cummins-not-playing-todays-1st-t20i-between-sri-lanka-and-australia-in-colombo/","keywords":["Cricket","Australia","Australia tour of Sri Lanka 2022","Pat Cummins","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why is Pat Cummins not playing vs Sri Lanka: Australia are playing international cricket in Sri Lanka after six years. During the first T20I of the ongoing Australia’s tour of Sri Lanka in Colombo, Australia captain Aaron Finch has won the toss and chose to field. “We will bowl first, looks like a very good… The post Why is Pat Cummins not playing today’s 1st T20I between Sri Lanka and Australia in Colombo? appeared first on The SportsRush.","content":"Why is Pat Cummins not playing vs Sri Lanka: Australia are playing international cricket in Sri Lanka after six years. During the first T20I of the ongoing Australia’s tour of Sri Lanka in Colombo, Australia captain Aaron Finch has won the toss and chose to field. “We will bowl first, looks like a very good wicket and we back ourselves to chase any score down. A bit dry but should be a good batting surface once the ball goes soft. [Glenn] Maxwell has shown both for Australia and in the IPL [2022] that he can bowl at any time and at any stage of the game, so we are happy to go with just one specialist spinner,” Finch told Dialog TV at the toss. Much like Finch, Sri Lanka captain Dasun Shanaka is also banking on some of his players excelling in the recently concluded 15th season of the Indian Premier League. “The boys have performed well with their respective franchises in the IPL and this is a confident side. We have grown as a team over the past few months. Happy to bat first, looks like a good surface,” Shanaka told Dialog TV at the toss. An almost full-strength T20I Playing XI for the visitors sees them replicating their ICC T20 World Cup 2022-winning squad. Having said that, two players who are missing from that squad are fast bowler Pat Cummins and spinner Adam Zampa. While Cummins has been rested for this three-match T20I series, Zampa is on paternal leave. It was only today that Cummins took to his social media platforms Twitter to share his preparations for travelling to Sri Lanka for the ODIs and Tests that will follow the T20Is. On my way #srilanka pic.twitter.com/YpTfrnWI9O — Pat Cummins (@patcummins30) June 7, 2022 Just as his Test captain, Australia batter Marnus Labuschagne will also arrive soon in Sri Lanka following a County Championship 2022 and Vitality Blast 2022 stint at Glamorgan .","pubDate":"2022-06-07 13:48:06","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs South Africa: Hardik Pandya Part Of Leadership Group? What Rahul Dravid Said - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMizwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1zb3V0aC1hZnJpY2EtMjAyMi9kb250LW5lZWQtdG8tYmUtZGVzaWduYXRlZC1sZWFkZXItdG8tYmUtcGFydC1vZi1sZWFkZXJzaGlwLWdyb3VwLXJhaHVsLWRyYXZpZC1vbi13aGV0aGVyLWhhcmRpay1wYW5keWEtaXMtcGFydC1vZi1sZWFkZXJzaGlwLWdyb3VwLXBvc3QtaXBsLTIwMjItd2luLTMwNDYyMznSAdUBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaW5kaWEtdnMtc291dGgtYWZyaWNhLTIwMjIvZG9udC1uZWVkLXRvLWJlLWRlc2lnbmF0ZWQtbGVhZGVyLXRvLWJlLXBhcnQtb2YtbGVhZGVyc2hpcC1ncm91cC1yYWh1bC1kcmF2aWQtb24td2hldGhlci1oYXJkaWstcGFuZHlhLWlzLXBhcnQtb2YtbGVhZGVyc2hpcC1ncm91cC1wb3N0LWlwbC0yMDIyLXdpbi0zMDQ2MjM5L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa: Hardik Pandya Part Of Leadership Group? What Rahul Dravid Said  NDTV Sports'Dravid would've taken it a step forward': Pathan on coach's clarity with Rahul  Hindustan TimesHIGHLIGHTS | Rahul Dravid Press Conference: 'He Has a Lot to Learn' - IND Coach on Umran Malik  India.com\"Need To Be Realistic...\": Indian Cricket Team Coach Rahul Dravid's Big Statement On Umran Malik  NDTV SportsRahul Dravid explains Rohit Sharma's absence from Indian squad ahead of 1st T20I against South Africa  Times NowView Full coverage on Google News","content":null,"pubDate":"2022-06-07 13:41:04","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy Quarterfinals, Day 2: Gharami and Majumdar's tons help Bengal pile misery on Jharkhand","link":"https://sportstar.thehindu.com/cricket/domestic/ranji-trophy-quarterfinals-day-2-gharami-majumdar-tons-help-bengal-pile-misery-on-jharkhand/article38501147.ece","keywords":null,"creator":["Dhruva Prasad"],"video_url":null,"description":"Bengal continued to pile misery on Jharkhand scoring 577 for five at the second day of the first quarterfinal of the Ranji Trophy at at the Just Cricket Academy Ground here on Tuesday.","content":"Jharkhand’s day was bookended by two spells of synchronised clapping, aimed at boosting the morale of the fielders, but in between Bengal continued to pile misery on its opponent and end day two of the first quarterfinal of the Ranji Trophy at 577 for five at the Just Cricket Academy Ground here on Tuesday. After Shahbaz Ahmed ramped Sushant Mishra (two for 122) for six over the third man following the dismissal of Abhishek Porel (68, 111b, 11x4), who was strangled down leg, the Jharkhand dugout geed up the fielders with a round of applause in the 175th over of the innings. Earlier, a similar spectacle had transpired an hour into the day’s play. Between these bouts of cheers, Bengal ran the bowlers ragged. Porel and Manoj Tiwari (54 n.o., 146b, 3x4, 1x6), pairing for a 109-run stand for the fifth wicket, looked poised for a rousing end to the day with the third new ball yielding 46 runs in 11 overs. Porel, who reached his third fifty in his maiden Ranji Trophy season, cut and drove the pacers and spinners in equal measure. Overcoming his jitters with the short ball, in particular, Tiwari struck his first boundary after facing 95 balls before reaching his fifty with a crisp cover-drive for four. FOLLOW: Ranji Trophy Quarterfinals, Day 2 Highlights: Karnataka slips to 100/8 at Stumps Earlier, Sudip Kumar Gharami 186(380b, 21x4, 1x6) and Anustup Majumdar 117(194b, 15x4) built on the overnight score of 310 for one with their stonewalling, which yielded 99 runs in 35 overs in the first session. Majumdar reached the three-figure mark with a couple of fours after Ashish Kumar troubled him initially by moving the ball both ways. Rahul Shukla, however, was inaccurate from the start, straying on the pads to allow two fours in the second over of the day. After a backbreaking spell, Shahbaz Nadeem finally tasted success, drawing Majumdar’s outside edge by beating him in the air and ending a 243-run stand. Abhishek Raman (61, 109b 8x4, 1x6), who retired hurt on 41 on day one, showed intent from the get-go by stepping out and depositing off-spinner Utkarsh Singh over long-on for six before he was consumed by his aggression, stranded outside his crease by a flighted delivery by Anukul Roy. The day belonged to young Gharami, who shifted gears after an assuring first session. A bottom-handed whip through mid-wicket and a wild slash to the third man boundary betrayed a sense of hurry to complete a double ton. However, he was given out caught behind trying to flick down leg-side – 14 runs short, shock and disbelief writ large and a rousing ovation from his teammates.","pubDate":"2022-06-07 13:38:13","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy 2021-22: Mumbai debutant Suved Parkar joins elite list with double century against Uttarakhand","link":"https://www.firstpost.com/firstcricket/sports-news/ranji-trophy-2021-22-mumbai-debutant-suved-parkar-joins-elite-list-with-double-century-against-uttarakhand-10769321.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Ranji Trophy 2021-22: Mumbai debutant Suved Parkar joins elite list with double century against Uttarakhand","content":"Mumbai's Suved Parkar achieved a memorable feat on Day two of the Ranji Trophy quarter-final against Uttarakhand on Tuesday. Standing in for Ajinkya Rahane, who is injured, Suved registered a double century, becoming just the 12th Indian to do so on First-Class cricket debut.Suved achieved the milestone during the second session on Tuesday, driving spinner Swapnil Singh towards long-off for a single. He hit 17 fours and three sixes.Amol Muzumdar was the only other Mumbaikar to have posted a double century on debut. Parkar began the day on 104 not out and he crossed 150 in the first session. He and Sarfaraz Khan (153) forged a 267-run stand for the fourth wicket. Parkar was out for 252 as Mumbai declared at 647/8. Uttarakhand were 39/2 at stumps on Day 2.According to The Hindu, Parkar is an alum of the Swami Vivekananda International School, the same school that India skipper Rohit Sharma went to. An injury for Rahane paved the way for Parkar to bat at number four.Mumbai are aiming to clinch a record-extending 42nd Ranji Trophy title.ead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-07 13:38:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Suved-Parkar-640_Twitter-@BCCIdomestic.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Mor wants more: Newly-crowned World No. 1 Sarita says 'it's Olympic gold or nothing for me'","link":"https://www.firstpost.com/sports/mor-wants-more-newly-crowned-world-no-1-sarita-says-its-olympic-gold-or-nothing-for-me-10768971.html","keywords":["Sports"],"creator":["Aditya K Halder"],"video_url":null,"description":"Mor wants more: Newly-crowned World No. 1 Sarita says 'it's Olympic gold or nothing for me'","content":"Dropping just two points on way to her first international gold medal of the season in Kazakhstan last week, Sarita Mor seemed determined about her objective at the prestigious Bolat Turlykhanov Cup. This was her first international competition after the 27-year-old wrestler from Delhi conceded her two-time Asian Championship crown for bronze last April.“World No. 2 bane hue the kaafi dino se, acha mauka tha No. 1 banne ka, to jaan laga di (I was World No. 2 for a while, this was my opportunity to become World No. 1 so gave it my all),” says Sarita upon reaching Delhi on Tuesday morning.आज united world wrestling ( uww ) ने मुझे विश्व की नम्बर 1 खिलाड़ी घोषित किया, मैं बहुत खुश हू, नहीं जानती कैसे ब्याँ करूँ ख़ुशी, आप सब के बिना और अपने देश के बिना मैं कुछ भी नहीं, आप सभी देशवासियों का तहें दिल से धन्यवाद और आभार व्यक्त करती हूँ 🇮🇳जय हिंद जय भारत🇮🇳 pic.twitter.com/pxn7EBUgyT— sarita mor 🇮🇳 (@saritamor3) June 5, 2022The World Ranking series didn’t just take her to World No. 1 spot in the 59kg category but also allowed her the opportunity to settle an old score with Mongolian wrestler Shoovdor Batarjav, who handed an opening round-robin defeat to Sarita at the Asian Championship weeks ago. And unlike the narrow 1-2 defeat in Ulaanbaatar, this time Sarita took down her opponent with little discomfort 5-0.The much-needed charge wasn’t a mere coincidence as the wrestler from Delhi’s Rohini explains that she had more than a helping hand in her better half Rahul Mann, who is also her personal coach.“My husband Rahul likes to read all my opponents beforehand for every competition, especially those who defeated me. He studies all their bouts through videos and sends me feedback before the competition. He remembers all my opponents by their name and always has important notes to share,” says Sarita.Rahul himself is no novice to wrestling as the six-time national champion has multiple international medals to his name (including two Asian Championship and three Commonwealth Championship medals).The husband-wife duo, married in 2017, competed together in international and national arena until 2018 when Rahul’s constant struggles with injuries forced him to call time on his career at just 29.“Our elders suggested that it would be better if one of us pursued wrestling with the other being the helping hand,” says Rahul, who reached the airport at 6 AM in the morning to receive her wife. “Since I was 29 back then and Sarita was 23, it seemed logical for me to help her out as she had a long wrestling career in front of her. Today when she has become World No. 1, I couldn’t be more happy and proud. I am living my incomplete dreams to her.”Setting sights on Olympics and WorldsHowever, despite her supremacy, 59kg being a non-Olympic category means there’s only so much she can do beyond a certain level. In fact, the World Championship gold medal would be the apex of her success in the category. Will that be enough?“Ji bilkul nahi (Certainly not)!” says Sarita. “There’s nothing more important than an Olympic gold medal and all this hard work is for that ultimate dream. That’s why this will be the last of me competing in the 59 kg category. I have another World Ranking series to participate in 10-day time in Italy. After that, I will likely solely focus on 57kg category.\"This doesn’t mean I don’t care about World Championship because I still want to be the first Indian woman to win World Championship gold medal but I wish to do so in the 57kg category.”Switching to 57kg comes with a separate set of challenges and the biggest one would be clearing the domestic circuit hurdle as she would have to face the likes of Anshu Malik and Pooja Dhanda. Sarita is familiar with the two competitors as the former also ended her 2022 Commonwealth Games ambition recently. Facing off in the 57kg national trials last month, Anshu got better of Sarita twice to book her Birmingham ticket. But a closer look at the result suggests that Sarita has a case and it is Anshu who will have to worry about her Olympic ambitions.The duo faced each other twice at the trials in Pune with Anshu defeating Sarita by the narrowest of margins on both occasions; 6-5 in round-robin and 2-1 in the final. While the round-robin encounter saw Anshu pull off a four-point move to make her a worthy winner, it was the final encounter that tested the 20-year-old young prodigy's might. Picking two single points within the first half, Anshu dug deep in her defence to battle an aggressive Sarita for the last 3 minutes of the bout (Watch the video of the final bout in the link below). The refereeing decisions that day came under question as Anshu faced no caution for her ultra-defensive approach but Sarita holds no grudge.“Khel me to haar jeet hote rehta hai (One either wins or loses in sports) and Anshu is not the sole competitor in the category. There is Pooja and others as well and I am taking nobody lightly. My objective is very clear, I have to work so hard that any refereeing decision or external factors won’t decide if I am going to win or not. It’s Olympic gold or nothing for me,” concludes Sarita.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-07 13:21:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/sarita-mor.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'That's why he's been picked...': Dravid on Karthik's role in IND vs SA series - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMirAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC90aGF0cy13aHktaGUtcy1iZWVuLXBpY2tlZC1yYWh1bC1kcmF2aWQtaWRlbnRpZmllcy1kaW5lc2gta2FydGhpay1zLXJvbGUtYWhlYWQtb2YtMXN0LWluZGlhLXZzLXNvdXRoLWFmcmljYS10MjBpLTEwMTY1NDYwNjU0ODQ3NS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'That's why he's been picked...': Dravid on Karthik's role in IND vs SA series  Hindustan Times\"Need To Be Realistic...\": Indian Cricket Team Coach Rahul Dravid's Big Statement On Umran Malik  NDTV SportsHIGHLIGHTS | Rahul Dravid Press Conference: 'He Has a Lot to Learn' - IND Coach on Umran Malik  India.comIND vs SA LIVE: Rahul Dravid's 'Special Masterclass' for rookie pacer Umran Malik: Check OUT  InsideSportIndia vs South Africa: Hardik Pandya Part Of Leadership Group? What Rahul Dravid Said  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-06-07 13:06:01","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Need To Be Realistic...\": Indian Cricket Team Coach Rahul Dravid's Big Statement On Umran Malik - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMigQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L25lZWQtdG8tYmUtcmVhbGlzdGljLWluZGlhbi1jcmlja2V0LXRlYW0tY29hY2gtcmFodWwtZHJhdmlkcy1iaWctc3RhdGVtZW50LW9uLXVtcmFuLW1hbGlrLTMwNDYwNTDSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Need To Be Realistic...\": Indian Cricket Team Coach Rahul Dravid's Big Statement On Umran Malik  NDTV SportsHIGHLIGHTS | Rahul Dravid Press Conference: 'He Has a Lot to Learn' - IND Coach on Umran Malik  India.com'Dravid would've taken it a step forward': Pathan on coach's clarity with Rahul  Hindustan TimesUnwise to expect everyone to be available all the time: Rahul Dravid  Times of IndiaIndia vs South Africa: Hardik Pandya's leadership in IPL 2022 impressive, says Rahul Dravid  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-06-07 12:13:56","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Cardiff feels like my second home”: Marnus Labuschagne thanks Glamorgan for another County Championship season","link":"https://thesportsrush.com/cricket-news-cardiff-feels-like-my-second-home-marnus-labuschagne-thanks-glamorgan-for-another-county-championship-season/","keywords":["Cricket","County Championship 2022","Glamorgan","Marnus Labuschagne"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Marnus Labuschagne thanks Glamorgan: The Australian batter will join the national squad for a multi-format Sri Lankan tour. Australia batter Marnus Labuschagne has signed off from his third County Championship season to join the national squad in Sri Lanka for a multi-format tour starting with a three-match T20I series from tonight. Not part of the… The post “Cardiff feels like my second home”: Marnus Labuschagne thanks Glamorgan for another County Championship season appeared first on The SportsRush.","content":"Marnus Labuschagne thanks Glamorgan: The Australian batter will join the national squad for a multi-format Sri Lankan tour. Australia batter Marnus Labuschagne has signed off from his third County Championship season to join the national squad in Sri Lanka for a multi-format tour starting with a three-match T20I series from tonight. Not part of the T20I squad, Labuschagne will take part in a five-match ODI series followed by a two-match Test series scheduled to be played between June 14 – July 12 across Kandy, Pallekele and Galle. Much like Labuschagne, Australia Test captain will also join the squad for the ODIs and Tests after being rested for the T20Is. Labuschagne, 27, took to social media platform Twitter to thank Glamorgan for providing him with an opportunity to ply his trade in both the first-class and T20 format. In five County Championship Division Two 2022 matches, Labuschagne scored 377 runs at an average of 41.88 with the help of a century and two half-centuries. Labuschagne’s 10 wickets in this County season came at an average and strike rate of 28.70 and 47.9 respectively. As far as the ongoing season of Vitality Blast is concerned, Labuschagne scored only 118 runs in five innings at an average and strike rate of 23.60 and 132.58 respectively. Thanks to everyone at @GlamCricket for another season. Cardiff feels like my second home because of all the great people around the club, and I’ve loved playing with this bunch of blokes. pic.twitter.com/W9eYPaJqGJ — Marnus Labuschagne (@marnus3cricket) June 7, 2022 Readers must note that this was the second of a two-season deal for Labuschagne at Glamorgan. Labuschagne, who had made his County debut in 2019 right before Ashes 2019, had missed the subsequent season due to COVID-19. Having said that, the club later signed Labuschagne for two more seasons. Set to play international cricket for the first time in Sri Lanka, Labuschagne had recently hinted at wanting to replicate former England captain Joe Root’s heroics in the island nation.","pubDate":"2022-06-07 11:57:07","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs South Africa: Tabraiz Shamsi shares hilarious update on Delhi weather ahead of 1st T20I","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-south-africa-tabraiz-shamsi-shares-hilarious-update-on-delhi-weather-ahead-of-1st-t20i-10768441.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"India vs South Africa: Tabraiz Shamsi shares hilarious update on Delhi weather ahead of 1st T20I","content":"New Delhi, as well as its surrounding areas, has been reeling under heat waves for the last few weeks. In these scorching conditions, India and South Africa will be locking horns for their first T20 international of the five-match series at the Arun Jaitley Stadium on 9 June at 7:00 pm.As the weather forecast suggests, the temperature on match day can come close to the 40-degree mark even at night, which can be very uncomfortable for the players.South African spinner Tabraiz Shamsi has grabbed the attention of cricket fans for his sarcastic weather update recently. Taking a jab at the scorching summer heat, he wrote, “Just a cool 42 degrees outside. Not hot at all.” Since being shared, the tweet has received more than 2,000 likes. Following the tweet, fans across the world commented with weather updates from their areas. Shamsi also showed concern in the comments section, asking the other users how they were dealing with the soaring mercury levels. He even asked, “How do people survive in this heat?” to a user.To get familiar with the summer heat, players have already been seen warming up at the stadium. India head coach Rahul Dravid has begun the training of most of the Indian cricketers. But players like Hardik Pandya, Yuzvendra Chahal and Harshal Patel were absent in the first optional training session. Pandya and Chahal are two only players in the T20 squad to feature in the IPL final this year. According to the BCCI reports, the players will join the next training session.The initial session saw this year’s IPL sensation, Umran Malik rolling his arm inside the net. The Jammu pacer received his maiden national call-up for his lethal performance in the cash-rich league. Followed by a few deliveries at half run-up, he enjoyed some sessions with Shreyas Iyer, Rishabh Pant and Deepak Hooda.Other young seamers like Avesh Khan and Arshdeep Singh were also seen practicing a simulated yorker training under the Indian bowling coach Paras Mhambrey.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-07 11:32:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2021/06/Shamsi_opt.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Shane Bond turns 47: Wishes pour in for former New Zealand pacer","link":"https://timesofindia.indiatimes.com/sports/cricket/news/shane-bond-turns-47-wishes-pour-in-for-former-new-zealand-pacer/articleshow/92060979.cms","keywords":null,"creator":null,"video_url":null,"description":"The Cricket fraternity poured in wishes for former New Zealand pacer and current Mumbai Indians bowling coach Shane Bond as he turned 47 today.","content":null,"pubDate":"2022-06-07 11:21:36","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"“A very special week for me and my family”: Joe Root thanks everyone for wishes ahead of Trent Bridge Test vs New Zealand","link":"https://thesportsrush.com/cricket-news-a-very-special-week-for-me-and-my-family-joe-root-thanks-everyone-for-wishes-ahead-of-trent-bridge-test-vs-new-zealand/","keywords":["Cricket","England","Joe Root","New Zealand","New Zealand tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Joe Root thanks everyone for wishes: The former English captain achieved a significant personal milestone in his last Test match. Former England captain Joe Root couldn’t have asked for a better way to commence his post-captaincy Test career than scoring a match-winning 26th Test century in the first Test of New Zealand’s tour of England… The post “A very special week for me and my family”: Joe Root thanks everyone for wishes ahead of Trent Bridge Test vs New Zealand appeared first on The SportsRush.","content":"Joe Root thanks everyone for wishes: The former English captain achieved a significant personal milestone in his last Test match. Former England captain Joe Root couldn’t have asked for a better way to commence his post-captaincy Test career than scoring a match-winning 26th Test century in the first Test of New Zealand’s tour of England 2022 at Lord’s on Sunday. Root, 31, became the youngest batter to score 10,000 runs in Test cricket in the process. 14th batter to achieve the milestone in Test cricket, Root was the 10th fastest to score his 10,000th run in the format. Been under the pump primarily due to England’s performance under his leadership in the last year, Root continuing to dominate as a batter has put on display encouraging signs for an otherwise struggling team looking set to benefit from their best batter. Root, who became only the second English cricketer after former captain Sir Alastair Cook to enter this elite list, took to social media platform Twitter to thank everyone for their wishes. Claiming winning a Test for England as the “best feeling”, Root looked forward to the second Test match in Trent Bridge. A very special week for me and my family but the best feeling is winning matches for England. Thanks for all the messages, looking forward to Trent Bridge 🏴󠁧󠁢󠁥󠁮󠁧󠁿🏏 pic.twitter.com/EN0rgUFM5Q — Joe Root (@root66) June 7, 2022 Scheduled to be played from June 10 in Nottingham, the second England vs New Zealand Test will be Root’s seventh at this venue. In his previous six Trent Bridge Tests, Root has scored 607 runs at an average of 67.44 including three centuries and two half-centuries. In what will be his first Test against New Zealand here, it will be his fourth as a specialist batter (first in seven years).","pubDate":"2022-06-07 11:08:43","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“It’s everyone’s dream to play Test cricket”: Adil Rashid confirms he is ready to make his test comeback","link":"https://thesportsrush.com/cricket-news-its-everyones-dream-to-play-test-cricket-adil-rashid-confirms-he-is-ready-to-make-his-test-comeback/","keywords":["Cricket","Adil Rashid","ENG","england cricket"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"English leg-spinner Adil Rashid has confirmed that he is ready to make his return to test comeback under Brendon McCullum and Ben Stokes. England started their test journey under Brendon McCullum and Ben Stokes, where they defeated the current World Test Champions New Zealand by five wickets. The aggressive mindset of the English team was… The post “It’s everyone’s dream to play Test cricket”: Adil Rashid confirms he is ready to make his test comeback appeared first on The SportsRush.","content":"English leg-spinner Adil Rashid has confirmed that he is ready to make his return to test comeback under Brendon McCullum and Ben Stokes. England started their test journey under Brendon McCullum and Ben Stokes, where they defeated the current World Test Champions New Zealand by five wickets. The aggressive mindset of the English team was clearly visible in that match with both bat and the field settings. Brendon McCullum is coaching an international side for the first time, and he earlier said that he is here to do the man-management thing so that the other coaches can work under him. Adil Rashid confirms his intention of test comeback Brendon McCullum earlier confirmed that he is in talks with some white-ball specialist players to feature in the red-ball cricket. Moeen Ali was one of them and even Adil Rashid is also in the consideration. Adil Rashid confirmed that Brendon McCullum contacted him for a test return. The leg-spinner from Yorkshire, who last played a Test in 2019 has said that he has not retired from the longest format of the game and it is his dream as well to play test cricket again. Rashid has not even played a single FC game since 2019. “Brendon’s reached out to me – just a text to check how things are,” Rashid told the Daily Mail. “I’ve not closed the door on Test cricket. I’ve not retired or anything like that. It’s something that’s still there. It’s everyone’s dream to play Test cricket and I’m no different.” #OnThisDay in 2015, Adil Rashid’s Test debut In the first innings, he conceded 0-163, the worst figures by anyone ever in their first Test match. But in the second he ripped through Pakistan with 5-64, almost giving England time to secure a thrilling win. pic.twitter.com/fd5VZHYvQ3 — Wisden (@WisdenCricket) October 13, 2021 Adil Rashid said that Ben Stokes and Brendon McCullum like to be positive and attacking, and he is very excited to play under them. He also confirmed that his shoulder injury is getting fine as well. “It’s always exciting when something new comes along. Brendon McCullum and Ben Stokes both like to be positive and attacking. That drives me on and it’s very exciting,” Adil Rashid said. However, to make his comeback to test cricket, Adil Rashid must play some first-class games with Yorkshire in the upcoming months.   The post “It’s everyone’s dream to play Test cricket”: Adil Rashid confirms he is ready to make his test comeback appeared first on The SportsRush.","pubDate":"2022-06-07 10:57:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}