{"newsArray":[{"title":"While You Were Asleep: Lendl Simmons retires from international cricket, Borussia Dortmund striker Sebastein Haller diagnosed with testicular tumour, Zinchenko set to join Arsenal","link":"https://indianexpress.com/article/sports/sport-others/while-you-were-asleep-lendl-simmons-west-indies-borussia-dortmund-sebastein-haller-testicular-tumour-zinchenko-arsenal-8037929/","keywords":["Sport Others","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-07-19 02:14:21","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Jogo do Manchester United hoje x Crystal Palace ao vivo (19/7)","link":"https://www.dci.com.br/esporte/futebol/jogo-do-manchester-united-hoje-x-crystal-palace-ao-vivo-19-7/265168/","keywords":["Futebol"],"creator":["Beatriz Fabbri"],"video_url":null,"description":"Este conteúdo foi publicado primeiro em https://www.dci.com.br/ Equipes disputam amistoso na manhã de terça-feira, 19 de julho, na pré-temporada do futebol europeu Este conteúdo foi publicado primeiro em https://www.dci.com.br/","content":"Tem Cristiano Ronaldo no jogo do Manchester United hoje? Nesta terça-feira, 19 de julho, a equipe enfrenta o Crystal Palace no East Melbourne Cricket Ground, em Melbourne, a partir das 07h10 (Horário de Brasília), em amistoso internacional da pré-temporada. Confira a seguir onde assistir e todas as informações. Onde assistir o jogo do Manchester United hoje? O jogo do Manchester United hoje vai passar no MUTV , serviço de streaming oficial do clube, a partir da 07h10 (Horário de Brasília), em amistoso nesta terça-feira na pré-temporada. Sem transmissão pela TV, o confronto inglês só será exibido através do canal oficial. Para assistir, o torcedor deve acessar a plataforma (www.manutd.com), procurar por MUTV na barra em vermelho, clicar em “Watch Now” e fazer o cadastro. O site está disponível pelo computador, celular ou tablet, mas não pode ser encontrado pela smart TV. O Manchester United começou muito bem a sua agenda de amistoso na pré-temporada. Primeiro goleou o Liverpool e depois venceu o Melbourne Victory, na Austrália. Agora, diante de um velho conhecido, o técnico do Manchester United, Erik ten Hag, terá o elenco completo com os 31 jogadores convocados. David De Gea e Raphael Varane estão de volta ao grupo. Do outro lado, o Palace empatou com o Accrington Stanley, ganhou do Millwall, perdeu para o Liverpool e ganhou do Ipswich Town pela agenda internacional de amitosos na pré-temporada. Agora, o elenco vai encontrar mais uma vez uma equipe que conhece muito bem. O técnico Vieira não poderé contar com Wilfried Zaha, Eberechi Eze e Marc Guehi Cristiano Ronaldo vai jogar? Não, Cristiano Ronaldo não vai jogar com o Manchester United nesta terça-feira contra o Crystal Palace. O português foi dispensado da pré-temporada pelo clube e por isso não está jogando a agenda de amistosos na Austrália. O futuro de Cristiano ainda é incerto. Enquanto busca outras opções para a carreira, o mercado de transferências não para. As especulações continuam a apontar Cristiano no Atlético de Madrid, PSG, Bayern de Munique, Napoli, Chelsea e até mesmo o Flamengo. Como o time inglês não se classificou para a Champions League, o atacante não quer permanecer no clube. Por isso, procura um novo time para vestir a camisa. A última publicação do Manchester United nas redes sociais foi em 25 de junho. Desde então, nada mais foi dito por nenhuma das partes. Equipe do manchester em 2022. Foto: reprodução / manchester united @manutd + Corinthians e Flamengo na Libertadores 2022: o que esperar do clássico","pubDate":"2022-07-19 01:52:00","image_url":null,"source_id":"dci","country":["brazil"],"category":["sports"],"language":"portuguese"},{"title":"Chappell: Warner’s leadership & Khawaja","link":"https://www.cairnspost.com.au/sport/cricket/chappell-warners-leadership-khawaja/video/2666d256e352e470f7d9db34dcbabde6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Former Australian cricket captain Greg Chappell joined the desk to chat his charity, David Warner's leadership, and Usman Khawaja playing into his 40s.","content":null,"pubDate":"2022-07-19 01:09:25","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Attock crowned champions of CCA Northern leg","link":"https://www.thenews.com.pk/print/974838-attock-crowned-champions-of-cca-northern-leg","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Attock won the Northern leg of the two-day City Cricket Association Tournament 2022-23 after topping the triangular stage with 10 points.Bagh-Hattian ended second with two points and Chakwal finished third with one point. In the first match of the triangular stage, Attock defeated Chakwal...","content":null,"pubDate":"2022-07-19 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Stokes announces shock ODI retirement","link":"https://www.thenews.com.pk/print/974825-stokes-announces-shock-odi-retirement","keywords":null,"creator":null,"video_url":null,"description":"LONDON: England’s Ben Stokes has announced he will retire from one-day international cricket after Tuesday’s match against South Africa on his Durham home ground.The all-rounder, 31, said playing three international formats -- Twenty20, 50-over ODIs and Tests -- was now...","content":"LONDON: England’s Ben Stokes has announced he will retire from one-day international cricket after Tuesday’s match against South Africa on his Durham home ground. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The all-rounder, 31, said playing three international formats -- Twenty20, 50-over ODIs and Tests -- was now “unsustainable”. Stokes, who captain’s the England Test team, will take the field at Chester-le-Street against South Africa in the first of three ODIs. Stokes, who has scored 2,919 runs and taken 74 wickets in the format, said in a social media post it had been an “incredibly tough decision to make”. “As hard as a decision as this was to come to, it’s not as hard dealing with the fact I can’t give my teammates 100 percent of myself in this format anymore,” he said. “The England shirt deserves nothing less from anyone who wears it. “Three formats are just unsustainable for me now. “Not only do I feel that my body is letting me down because of the schedule and what is expected of us, but I also feel that I am taking the place of another player who can give (captain) Jos (Buttler) and the rest of the team their all.” Rob Key, managing director of men’s cricket at the England and Wales Cricket Board, paid tribute to Stokes, saying: “Ben has had an incredible international career in ODI cricket, culminating in his match-winning performance at the 2019 ICC Men’s Cricket World Cup final”.","pubDate":"2022-07-19 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Nawaz relishes 'dream' five-wicket haul","link":"https://www.thenews.com.pk/print/974827-nawaz-relishes-dream-five-wicket-haul","keywords":null,"creator":null,"video_url":null,"description":"GALLE: Pakistan all-rounder Mohammad Nawaz said Monday that his maiden five-wicket haul on return to Test cricket was a “dream” performance he aimed to repeat.The 28-year-old Nawaz, who played just three Tests for Pakistan in 2016, impressed with his left-arm spin to dent the Sri...","content":"GALLE: Pakistan all-rounder Mohammad Nawaz said Monday that his maiden five-wicket haul on return to Test cricket was a “dream” performance he aimed to repeat. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The 28-year-old Nawaz, who played just three Tests for Pakistan in 2016, impressed with his left-arm spin to dent the Sri Lankan top and middle-order in the first match in Galle. He combined with leg-spinner Yasir Shah to reduce Sri Lanka to 267 for eight but the hosts hit back with Dinesh Chandimal’s unbeaten 86 to lead by 333 at the end of the third day’s play. “It’s every bowler’s dream to get a five-for in Test cricket and the same goes for me,” Nawaz told reporters. “I am very happy and I will keep working hard and repeat this kind of performance again.” Nawaz made his debut across formats in 2016 but his five-day career came to a halt after just three Tests against West Indies in the United Arab Emirates. His white-ball reputation has grown, with 19 one-day internationals and 30 Twenty20 matches for the national team, but he insists red-ball cricket is what excites him most. “I kept on playing first-class cricket, obviously played a lot of white-ball international cricket but a Test opportunity didn’t come my way,” Nawaz said of his cricketing journey. “Focus was to play red-ball cricket which makes you grow as a player. My 2022 red-ball season at home was good as I made over 700 runs and took 28-29 wickets. “I’m happy to bowl well on my comeback and hoping to turn up with the bat as well.” Babar Azam’s Pakistan will need to bowl out Sri Lanka, who were 329-9 at stumps, on the fourth day and then chase an already challenging-looking total. But Nawaz remains confident of the Pakistan batting that fought back from 87-5 to just four runs short of Sri Lanka’s 222 in the first innings.","pubDate":"2022-07-19 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"‘Cricket is broken’: Ben Stokes’ shock ODI call exposes ‘complete bull***t’ ruining the game","link":"https://www.foxsports.com.au/cricket/countries/england/cricket-news-2022-ben-stokes-retires-from-one-day-international-cricket-england-vs-south-africa-odi-series-reaction/news-story/fe0617c289283b57a2560e645951ada2","keywords":null,"creator":null,"video_url":null,"description":"“Cricket is broken,” Wisden’s managing editor Ben Gardner declared. It’s the bitter reality facing the game in the wake of Ben Stokes’ retirement from One Day Internationals.","content":"“Cricket is broken,” Wisden’s managing editor Ben Gardner declared. It’s the bitter reality facing the game in the wake of Ben Stokes’ retirement from One Day Internationals. The England star shocked the sport, and even his teammates, when he revealed he would be giving up the 50-over format to focus on his Test captaincy duties as well as T20 cricket. The news is a bitter blow to England’s hopes of next year retaining their 2019 ODI World Cup title, in which Stokes was awarded man of the match in the final. But it is more than that. It is a wake-up call for the game’s administrators around the world. After 50 years, ODI cricket isn’t what it used to be. And it faces the prospect of losing relevance and its best players, squeezed out of a packed schedule by the traditional and the new – Tests and T20s respectively. ‘Can’t give my teammates 100%’: Stokes’ shock retirement call after World Cup heroics The 31-year-old Englishman is one of the finest all-rounders in the game, and ODI cricket has arguably been his best format – he has blasted 29,919 runs in 104 games at the impressive average of 39.44 and with a strike rate of 95.26. His 74 wickets with the ball and his elite fielding made him a centrepiece of England’s team in all three formats – but the constant stress of playing in all three forms of the game has clearly taken its toll. But, he wrote, “Three formats are just unsustainable for me now. “I feel that my body is letting me down because of the schedule and what is expected of us.” In The Telegraph, Nick Hoult said it: “felt like a bombshell but in reality it had a long fuse,” referencing Stokes’ break from the game at the end of July 2021 for mental health reasons. Hoult added: “During his break last year he cut himself off from many of his team-mates and they worried he had fallen out of love with the game. But since taking over from Root as Test captain he has looked like his old self, giving everything to a job he clearly loves.” The long fuse behind this bombshell is less about Stokes than the game itself – and he core problem is not a new one. There is simply too much cricket on the calendar. It is not just unsustainable for Stokes, but for all of cricket. Stokes announcement felt like a carbon copy of Kevin Pietersen’s own international retirement from white-ball cricket, 10 years ago in June 2012. “After a great deal of thought and deliberation, I am announcing my retirement from international one-day cricket.,” Pietersen said. “With the intensity of the international schedule and the increasing demands on my body, approaching 32, I think it is the right time to step aside and let the next generation of players come through.” What was a problem then has devolved into a crisis. In the period June 2022 to March 2023, England is set to play 12 Tests, 18 ODIs, 19 bilateral T20Is and a T20 World Cup – over 100 days of men’s international cricket in all. It is their busiest season ever. And while some of that is due to the inclusion of series that were postponed during the Covid-19 pandemic, it does not change the fundamental problem that faces all three-format players. There is also more domestic T20 cricket than ever, with countries like South Africa debuting a new franchise tournament this summer (so new it doesn’t even have a name yet!), as well as the ever-increasing number of ICC tournaments like World Cups. England’s latest cricketing fad, the even-shorter-format The Hundred competition, only adds to the explosive mix. Matt Roller wrote for ESPN Cricinfo : “In abstract, it should serve as a wake-up call for cricket’s administrators. One of the sport’s most recognisable players making himself unavailable for his team’s defence of their world title in India next year is a damaging moment, one that underlines the extent to which boards have flogged their most valuable assets by cramming series into even the smallest gaps in the schedule.” As Rory Dollard of PA declared even more simply: “Stokes’ ODI retirement – complete with very carefully worded criticism of England’s schedule – has to be the tipping point. The fixture list is complete bullsh*t and it’s wrecking the players and the product. Enough.” Stokes, for context, has already opted out of the Indian Premier League (T20), as well as The Hundred. His decision, therefore, is clearly not about money – though he is in a far more fortunate position in that regard than many players around the world facing the same scheduling crunch. Instead, Stokes made clear his decision was about his love of Test cricket above all. Stokes said: “I will give everything I have to Test cricket, and now, with this decision, I feel I can also give my total commitment to the T20 format.” ODI series against Proteas cancelled | 00:28 Former England captain Nasser Hussain declared the current schedule ‘madness’ and delivered praise for Stokes' decision, saying “I respect him immensely.” “It is disappointing news to say the least but it is a reflection of where the cricketing schedule is at the moment,” Hussain told Sky Sports. “It is madness for players. “Half the reasons [for his retirement] will be physical, and half will be mental, and mental in Ben’s case is the fact he can’t do things at 70, 80%. “He’s not just going to be a bit-part player, he has to do it full on and he’s not willing to do it unless he does it 100%. “In a way, I respect him immensely for making that decision because that’s how you want every England cricketer to turn up, giving it everything every single day. “The issue is not with the ECB as far as Rob Key, the issue is not with Ben Stokes, the issue is with the schedule. “If the ICC just keep putting on ICC events and individual boards just keep filling the gaps with as much cricket as possible, eventually these cricketers will just say I’m done, and Ben Stokes is done with one format aged 31, which can’t be right, really. The schedule needs looking at, it is a bit of a joke at the moment.” 6 WICKETS! Topley topples India in ODI | 01:26 ODI FUTURE UNDER THREAT In recent years, the rise of T20 cricket and the big-money tournaments like the IPL has led to fears that Test cricket would fall by the wayside, with players opting to become white-ball specialists rather than hone their red-ball craft. In that regard, Stokes' decision to prioritise Test cricket is a win for that format – but a major blow to the ODI game. As Former India ODI spinner Pragyan Ojha wrote: “We were worried about TEST cricket’s future but the future of ODI looks uncertain! “In future we may see many cricketers preferring to move away from this format. #SomethingToThinkAbout” It comes after another Indian international and fellow spinner Ravi Ashwin reveals he turns off the television if ODI cricket is on. No ball causes comical end to T20 final | 02:00 Speaking on the ‘Vaughany and Tuffers Cricket Club’ podcast, Ashwin said: “The greatest beauty of one-day cricket is – sorry, was – the ebbs and flows of the game. People used to bide their time and take the game deep. “The one-day format used to be a format where bowlers had a say. Even me, as a cricket badger and a cricket nut, I switch off the TV after a point and that’s frankly very scary for the format of the game. “When those ebbs and flows go missing, it’s not cricket anymore. It’s just an extended form of T20. It’s a question of relevance and I think ODI cricket needs to find its relevance. It needs to find its spot.” Finding a place in the calendar is difficult enough, let alone finding -or re-finding - the identity of the format. For some, it already might be too late. BBL 11 Schedule released | 00:52 Simon Briggs wrote for The Telegraph: “We are witnessing the long, slow death of 50-over cricket … credibility is draining from this once vibrant format with each passing day.” He added: “Like Soda Streams, road atlases and SLR cameras, the traditional one-dayer is now a heritage product of dubious relevance. When the 50-over international turned 50, in January last year, it was the sort of birthday party where everyone crowds around a hospital bed.” Stokes is not the first player forced into a brutally tough decision about his international career, nor will he be the last. But there can be no doubt that change must take placeto protect players and the game itself.","pubDate":"2022-07-19 00:14:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Asian Cricket Council expected to switch Asia Cup venue to Dubai, as civil unrest in Sri Lanka continues","link":"https://www.scmp.com/sport/cricket/article/3185722/asian-cricket-council-expected-switch-asia-cup-venue-dubai-civil?utm_source=rss_feed","keywords":null,"creator":["Josh Ball"],"video_url":null,"description":"Sources say officials have decided to move next month’s tournament because it was no longer appropriate for it to be held in Sri Lanka.","content":null,"pubDate":"2022-07-18 23:30:26","image_url":"https://cdn.i-scmp.com/sites/default/files/styles/1280x720/public/d8/images/canvas/2022/07/18/8cf857ca-1d4a-42bc-9b24-56068880d49f_20932494.jpg?itok=rILXmM13","source_id":"scmp","country":["china"],"category":["sports"],"language":"english"},{"title":"Cricket world reacts to sad Ben Stokes announcement: 'Madness'","link":"https://au.sports.yahoo.com/cricket-2022-world-reacts-stunning-ben-stokes-announcement-222106316.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-07-18 22:21:06","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-07/536922f0-06e5-11ed-bfff-7e29c0317313","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ben Stokes announces sudden retirement","link":"https://www.dailytelegraph.com.au/sport/cricket/england-superstar-ben-stokes-retires-from-oneday-cricket/news-story/44ef4bbe2ffa977b438a541c5316da72","keywords":["Cricket news and galleries","Kayo","Sport news and galleries","Africa","America","brilliant career","comical end","cricket retirement","Durham","England","England superstar","Europe","Getty Images Inc.","International cricket","Jos Buttler","Matthew Mott","North America","North Carolina","Northern America","Northern Europe","shock call","shock retirement decision","South Africa","Southern Africa","United States of America","Watch South Africa","white ball cricket"],"creator":null,"video_url":null,"description":"England Test cricket captain Ben Stokes will retire from one-day international cricket after Tuesday’s match against South Africa in Durham.","content":"The 31-year-old revealed the shock call on social media, but will continue to play Test cricket and T20 cricket.Watch South Africa’s Tour of England. Every ODI & T20 Live & On-Demand on Kayo. New to Kayo? Start your free trial now >Stokes has long been an absolute start of the game in all formats of the game but averages 39.44 in ODIs with the bat, compared with 36.16 in Test cricket.With the ball, he’s less effective in the shorter form, avergaging 41.79 runs per wicket with a strike rate of a wicket every 41.6 balls.But Stokes is a key member of all three formats for England, including his most famous innings where he struck 84 not out to almost single-handedly win the World Cup final for England in controversial 2019 thriller.However, there’ll be no repreat as Stokes revealed via Instagram he was walking away from the 50-over game.“I will play my last game for England in ODI cricket on Tuesday in Durham. I have decided to retire from this format. This has been an incredibly tough decision to make. I have loved every minute of playing with my mates for England. We have had an incredible journey on the way,” Stokes wrote.“As hard as a decision as this was to come to, it’s not as hard dealing with the fact I can’t give my teammates 100% of myself in this format anymore. The England shirt deserves nothing less from anyone who wears it.“Three formats are just unsustainable for me now. Not only do I feel that my body is letting me down because of the schedule and what is expected of us, but I also feel that I am taking the place of another player who can give Jos and the rest of the team their all. It’s time for someone else to progress as a cricketer and make incredible memories like I have over the past 11 years.“I will give everything I have to Test cricket, and now, with this decision, I feel I can also give my total commitment to the T20 format.“I would like to wish Jos Buttler, Matthew Mott, the players and the support staff every success going forward. We have made great strides in white-ball cricket over the past seven years, and the future looks bright.“I have loved all 104 games I have played so far, I’ve got one more, and it feels amazing to be playing my last game at my home ground in Durham.“As always, the England fans have always been there for me and will continue to be there. You’re the best fans in the world. I hope we can win on Tuesday and set the series up nicely against South Africa.”The managing director of England cricket Rob Key paid tribute to the retiring star.“I know this must have been a tough decision, but I completely understand why he has reached this conclusion,” he said.“I’m sure that when we look back on Ben’s career and see this as one of the reasons he will play 120-plus Tests and help England in T20 matches and World Cups for many years to come.“It is a typically selfless decision that will benefit England long-term.”It was just the start of the tributes for Stokes.Indian star Virat Kohli commented: “You’re the most competitive bloke I’ve ever played against. Respect,”Pakistan vice captain Shadab Khan posted: “Congratulations on a wonderful ODI career @benstokes38. Best of luck with your Test career and other commitments. ODI cricket will surely miss you.”Former England spinner Monty Panesar wrote: “Stokes has made a selfless decision for the benefit of the England team.”Stokes became England’s 81st Test captain in April and has already seen some changes.Along with former New Zealand skipper Brendan McCullum as Test coach, England chased down some massive scores, defeating Test World Champions New Zealand 3-0 and the nation’s biggest ever chase against India earlier this month.It comes amongst a discussion in cricket circles about the schedules being too packed with Test, ODI and T20I cricket as well as domestic competitions and countless T20 competitions around the world.","pubDate":"2022-07-18 20:08:00","image_url":null,"source_id":"dailytelegraph","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Ball of the century”: Twitter reactions on Yasir Shah bowling an absolute ripper to dismiss Kusal Mendis during SL vs PAK 1st Test at Galle","link":"https://thesportsrush.com/cricket-news-ball-of-the-century-twitter-reactions-on-yasir-shah-bowling-an-absolute-ripper-to-dismiss-kusal-mendis-during-sl-vs-pak-1st-test-at-galle/","keywords":["Cricket","Galle","Pakistan tour of Sri Lanka 2022","Yasir Shah"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Twitter reactions on Yasir Shah dismissing Kusal Mendis with an absolute peach of a delivery during Sri Lanka’s second innings at Galle. Sri Lanka might well be at the driver’s seat after stumps on Day 3 as far as the match situation of the ongoing first Test at Galle is concerned, but Pakistan leg-spinner Yasir… The post “Ball of the century”: Twitter reactions on Yasir Shah bowling an absolute ripper to dismiss Kusal Mendis during SL vs PAK 1st Test at Galle appeared first on The SportsRush.","content":"Twitter reactions on Yasir Shah dismissing Kusal Mendis with an absolute peach of a delivery during Sri Lanka’s second innings at Galle. Sri Lanka might well be at the driver’s seat after stumps on Day 3 as far as the match situation of the ongoing first Test at Galle is concerned, but Pakistan leg-spinner Yasir Shah was discussed almost the entire day for a particular delivery. On the first delivery of the 56th Over of Sri Lanka’s second innings, Shah pitched the ball outside the leg-stump, managed to purchase significant turn off the pitch as the ball finally ended up hitting the top of off-stump, with a well-set, yet clueless Kusal Mendis (76) getting completely squared-up and watching the jaw-dropping sight. Fans across the world couldn’t help but term it the ‘ball of the century’ already, with majority of them comparing it with the one that the legendary Shane Warne had bowled to Mike Gatting in the year 1993. Yasir Shah, who is making a return back to Test Cricket after a year, has managed to scalp three Sri Lankan wickets in the innings so far, with the home side clearly on the driver’s seat at the moment, with a 333-run lead, on a pitch which has assisted the spinners significantly so far. Ball of the century! YASIR SHAH — Emmad Hameed (@Emmad81) July 18, 2022 Ball of the century nomination please! Yasir Shah, the magician 🎩 #SLvPAK Gif: @taimoorze pic.twitter.com/Z0Yu7uNrZf — Islamabad United (@IsbUnited) July 18, 2022 Yasir Shah would have made ‘Wizard of Oz’ proud with that ripper to Mendis. A dismissal that Yasir can capture in a photo frame and keep it his house. — Bharath Ramaraj (@Fancricket12) July 18, 2022 Ball of the 21st Century – #CricketTwitter #YasirShah #PAKvsSL #BallOfTheCentury #Cricket pic.twitter.com/s0HmYHZs02 — Saqib Ul Islam (@SaqibIslam) July 18, 2022 Ball of the century by Yasir Shah today. pic.twitter.com/Sp4RUgJDew — Mazher Arshad (@MazherArshad) July 18, 2022 Spectacular from Yasir Shah! 💫 #pitchedoutsidelegandhittopofoff https://t.co/TzkNkhtiZW — Mike Haysman (@MikeHaysman) July 18, 2022 Brilliant ball from Yasir Shah earlier today. Brought back memories of the great Shane Warne #Cricket #SLvPAK pic.twitter.com/FVfQv8GQ1x — Saj Sadiq (@SajSadiqCricket) July 18, 2022 Beauty from Yasir Shah like Shane Warne’s Ball to Gatting … pic.twitter.com/EKNgpZqZl6 — Taimoor Zaman (@taimoorze) July 18, 2022 It happened today…Yasir Shah.. shades of the late Shane Warne pic.twitter.com/f6rXeJrnB9 — KC 🇵🇸 (@Waqar92KC) July 18, 2022 For more Cricket-related news, click here.","pubDate":"2022-07-18 19:32:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"West Indies batter Lendl Simmons announces retirement from international cricket","link":"https://www.sportskeeda.com/cricket/news-west-indies-batter-lendl-simmons-announces-retirement-international-cricket?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Ankush Das"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-18 19:20:56","image_url":"https://static.sportskeeda.com/editor/2022/07/8bd37-16581647726020-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes’ ODI retirement should be a wake-up call to cricket’s leaders | Ali Martin","link":"https://www.theguardian.com/sport/blog/2022/jul/18/ben-stokes-odi-retirement-wake-up-call-ecb-icc-cricket","keywords":["Ben Stokes","England cricket team","ECB","International Cricket Council","Cricket","Sport politics","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"From the ECB to ICC, governing bodies need to realise how the packed schedule makes the 50-over game vulnerableIt feels fitting in some ways that during a week that is hotter than Hades – when alarm bells about our direction of travel should be ringing even louder – Ben Stokes has announced his retirement from one-day international cricket.Yep, the champion all-rounder who powered England to World Cup victory by the barest of margins three summers ago, in front of a packed house at Lord’s and with the UK’s largest cricket audience since the heady 2005 Ashes, has decided the 50-over stuff must make way. If not, his schedule as an elite all-format player would become suffocating. The hope now is that this similarly prompts a wake-up call. Continue reading...","content":"I t feels fitting in some ways that during a week that is hotter than Hades – when alarm bells about our direction of travel should be ringing even louder – Ben Stokes has announced his retirement from one-day international cricket. Yep, the champion all-rounder who powered England to World Cup victory by the barest of margins three summers ago, in front of a packed house at Lord’s and with the UK’s largest cricket audience since the heady 2005 Ashes, has decided the 50-over stuff must make way. If not, his schedule as an elite all-format player would become suffocating. The hope now is that this similarly prompts a wake-up call. Ben Stokes to retire from ODI cricket due to ‘unsustainable’ schedule Read more Rather poetically, he will bid farewell to the format after winning his 105th ODI cap at the Riverside in Chester-le-Street, County Durham on Tuesday. It is the ground that Ged and Deborah Stokes used to drive their restless, sports-mad son to from their home in Cockermouth some three times a week, two hours each way, in an act of selfless parenting that lit the fire for a remarkable sporting career. Ben Stokes, England cricketer and totemic Test captain, powers on, of course. In fact more so, in terms of where, aged 31, he wants to direct his energies. Modern all-format stars do not tend to jack it all in at once anyway, rather strip away that which means least to them and design their latter years weighing up health, wealth and happiness. When they do so it says a bit about the player and plenty about the sport. And Stokes could not have been clearer about the bigger picture here, citing an “unsustainable schedule” and his fear of letting down teammates. For a cricketer paid by one of the boards responsible for this, to be so explicit in pushing back is quite the thing. After all, in practical terms Stokes did n0t have to announce this right now, so deep is his line of credit. He averaged 50 with the bat during Eoin Morgan’s five-year World Cup project, is a genuine sixth bowler and fields like a demon. Allied with talismanic dressing-room status and, as England’s highest earner, he could shoulder arms to any series he did not fancy between now and the defence in 2023 and likely still command a spot. Ben Stokes had a disappointing ODI series against India, and has decided the match against South Africa on Tuesday will be his last 50-over game for England. Photograph: Ian Kington/AFP/Getty Images Last week, as well as withdrawing from the upcoming Twenty20 series against South Africa to ready himself for the Test matches that follow, it was announced he would skip the Hundred this summer and his employers simply had to suck it up. No one batted an eyelid, nor would they were his ODIs to become fleeting. But now was the time, like a leader, to take one for the team and give clarity in response to a fixture list that lacks anything of the sort. “I feel that my body is letting me down because of the schedule and what is expected of us,” he said. This announcement, decided last week but coming during a 48-hour turnaround between ODIs, was as sweetly timed as that famous swept six off Trent Boult at Lord’s three years ago. Matt Potts set for ODI debut as Mott pleads for patience with Buttler Read more Stokes knows his mind and body have limits. So much so he wisely took a four-month break last summer when bereavement and injury proved an overwhelming mix. Since returning to mental and physical fitness – both boxes not fully ticked until the tour of the Caribbean in March, even if he still grimaces in the field at times – he has become ever more besotted with Test cricket and taken on tunnel vision with it. “I will give everything I have to Test cricket, and now, with this decision, I feel I can also give my total commitment to the T20 format,” he said in his statement. The latter’s appeal is understandable in the modern economic climate but, having passed up the Indian Premier League this year and hinted he will do so again before next summer’s Ashes assault, it is clear the type of cricket which is calling him. The alliance with the head coach, Brendon McCullum, has also begun in quite astonishing fashion – those four spellbinding run chases in a row – and one could almost sense during these last three ODIs that this goal is now consuming his every cricketing thought. Put simply, the Test team and winning back the urn from Australia have become an obsession and Stokes is a character who is all-in when hooked. The Spin: sign up and get our weekly cricket email. The fear, of course, is that his broader call for a cleaner schedule falls on deaf ears. The ICC (aka the major boards) is working on a schedule that, while pruning back some ODI cricket over the next five years, features a global men’s tournament every 12 months. If the 50-over format is on the way out, no one seems to have told the organisers of the 2023, 2027 and 2031 World Cups, or Champions Trophies in 2025 and 2029. Each of the ICC members will also jostle to promote their domestic leagues – but stop everything for the two and a half months of the IPL to keep their players happy – and somehow attempt to keep touring for their bilateral commitments, too. But on Tuesday, back where it all began for Stokes, it will at least be a chance for the English game to thank the all-rounder for his efforts as a World Cup-winning one-day international star and applaud his burning desire to keep the flame of Test cricket alive.","pubDate":"2022-07-18 19:00:19","image_url":"https://i.guim.co.uk/img/media/9c83f897c7823d99dd884f4ff98caf7f5029468e/137_129_2957_1774/master/2957.jpg?width=460&quality=85&auto=format&fit=max&s=2d50003142e00191f12c4eb5d898d8fc","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Riverside ground chester-le-street pitch report: ENG vs SA 1st ODI 2022 Durham pitch report","link":"https://thesportsrush.com/cricket-news-riverside-ground-chester-le-street-pitch-report-eng-vs-sa-1st-odi-2022-durham-pitch-report/","keywords":["Cricket","Chester-le-street","South Africa tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Riverside ground chester-le-street pitch report: First of the three-match ODI series between England and South Africa to take place tomorrow. After suffering home series defeats in both the White-ball format against India just a couple of days ago, England would now take on the South African challenge right away in the all format series which… The post Riverside ground chester-le-street pitch report: ENG vs SA 1st ODI 2022 Durham pitch report appeared first on The SportsRush.","content":"Riverside ground chester-le-street pitch report: First of the three-match ODI series between England and South Africa to take place tomorrow. After suffering home series defeats in both the White-ball format against India just a couple of days ago, England would now take on the South African challenge right away in the all format series which would begin with the first ODI at the Riverside Ground in Chester-le-Street today. The match is of extra significance, as England’s 2019 World Cup final hero and present Test captain Ben Stokes, just the previous evening came out with a shocking decision to retire from the ODI format with today’s match at his home ground in Durham set to be his 105th and last 50-Over international game. As for South Africa, who will be led by left-arm spinner Keshav Maharaj, the rainbow nation would play an ODI after almost four months, having previously lost to Bangladesh 1-2 in the three match ODI series in March. While England have won eight out of their last nine ODIs at the Riverside ground, South Africa had won the lone ODI they played here against Sri Lanka by 9 wickets, during the 2019 ICC World Cup. We get candid with #Proteas seamer Lungi Ngidi to chat all things England series, and have a bit of fun to see how good his Geordie accent is 🤣 Watch the full hilarious interview right here 🔗 https://t.co/u262b9sC8p #ENGvSA #BePartOfIt pic.twitter.com/HVL2poxeai — Cricket South Africa (@OfficialCSA) July 17, 2022 The average first innings score in the last five ODIs at the Le-Chester-Street is 268, making it a decent surface to bat on. Traditionally, however, the pitch at this venue in Durham has been a good hunting ground for the fast bowlers, with significant amount of lateral movement in store and carry on offer available on the track. All in all, the Riverside ground pitch is expected to be a fairly balanced one today, with advantages for both batters and the bowlers at different points in the match. Batters are likely to score big after negating the pace threat early on.","pubDate":"2022-07-18 18:30:05","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Lendl Simmons retires from international cricket","link":"https://www.indiatvnews.com/sports/cricket/lendl-simmons-retires-from-international-cricket-played-crucial-role-in-wi-vs-ind-semifinal-world-cup-2022-07-18-793145","keywords":null,"creator":null,"video_url":null,"description":"Lendl Simmons announced his retirement from international cricket on Friday by handing over a letter to the West Indies cricket board.","content":"Lendl Simmons announced his retirement from international cricket on Friday by handing over a letter to the West Indies cricket board. The Trinidadian cricketer played 68 ODI and T20 matches. It was in ODI cricket that the world got to see the best of him. He scored 1958 with two centuries and 15 half-centuries against his name and the highest score of 122. In T20 cricket, he amassed 1527 runs with nine fifties and a career strike rate of 120.80. He only played eight Test matches and scored 278 runs in total. Simmons was instrumental for West Indies against India in the semifinals of the 2016 World Cup, scoring an unbeaten 82 off 51 deliveries.Lendl made his T20 debut in 2007 and in 2008, he made his ODI debut vs Pakistan at Faisalabad. He also holds the record of hitting 3rd most sixes in T20 cricket (10) after Gayle and , He also holds the record for most runs in a single edition of CPL. Simmons also played franchise cricket around the world and was pretty successful for teams like Mumbai Indians, Brisbane Heat and Karachi Kings.","pubDate":"2022-07-18 18:10:53","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"England's Ben Stokes announces shock retirement from ODI cricket","link":"https://www.iol.co.za/sport/cricket/international/englands-ben-stokes-announces-shock-retirement-from-odi-cricket-5b9e5755-bd44-4520-adac-cd786e703ece","keywords":null,"creator":["AFP"],"video_url":null,"description":"England's Ben Stokes will retire from one-day international cricket after Tuesday's series opener against South Africa on his Durham home ground.","content":null,"pubDate":"2022-07-18 18:06:59","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/b2e54b6a-ac75-5458-81b8-16d01d33ac3b&operation=CROP&offset=0x157&resize=3000x1687","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"IND vs ENG: बाएं हाथ के तेज गेंदबाजों के सामने फिर फेल हुए भारतीय बल्लेबाज, जानें नासिर हुसैन ने क्या दी प्रतिक्रिया","link":"https://www.abplive.com/sports/cricket/ind-vs-eng-indian-batsman-fail-against-left-hand-bowlers-in-odi-series-says-nasser-hussain-2170940","keywords":null,"creator":["Agencies"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>India vs England:</strong> इंग्लैंड के पूर्व कप्तान नासिर हुसैन ने रविवार को वनडे सीरीज के निर्णायक मैच के बाद कहा कि भारतीय बल्लेबाजों को बाएं हाथ के तेज गेंदबाजों के खिलाफ थोड़ा बेहतर खेलने की जरूरत है. इतिहास आपको बताता है कि शाहीन अफरीदी ने दुबई में, मोहम्मद आमिर ने ओवल में एक फाइनल के दौरान भारतीय टीम को काफी परेशान किया था, वैसे ही इस सीरीज में रीस टॉपली ने उन्हें संघर्ष करने पर मजबूर किया है.</p> <p style=\"text-align: justify;\">हुसैन ने बताया कि भारत के कप्तान रोहित शर्मा, शिखर धवन और विराट कोहली के शीर्ष क्रम के बाद इंग्लैंड में वनडे श्रृंखला के दौरान कई मैचों में बाएं हाथ के तेज गेंदबाजों के हाथों आउट हुए हैं. इसने फिर से यह साबित किया है कि भारत के शीर्ष क्रम के बल्लेबाजों को परेशानी का सामना करना पड़ रहा है और बाएं हाथ के तेज गेंदबाजों से आउट होना एक हमेशा से समस्या रही है.</p> <p style=\"text-align: justify;\">2015 में बांग्लादेश में मुस्तफिजुर रहमान, 2017 में चैंपियंस ट्रॉफी के फाइनल में द ओवल में मोहम्मद आमिर, 2017 में गुवाहाटी में टी20 मैच में जेसन बेहरेनडॉर्फ, 2017 में ट्रेंट बोल्ट, 2019 में वनडे विश्व कप सेमीफाइनल, 2021 टी20 विश्व कप में दुबई में शाहीन शाह अफरीदी ने भारतीय बल्लेबाजी क्रम को नुकसान पहुंचाया था. अब, रीस टॉपली का नाम सफेद गेंद वाले क्रिकेट में भारतीय शीर्ष क्रम को परेशान करने वाले बाएं हाथ के तेज गेंदबाजों की सूची में शामिल हो गया है.</p> <p style=\"text-align: justify;\">लॉर्डस में इंग्लैंड को पिच से कुछ राहत मिलने के साथ, टॉपली ने भारतीय शीर्ष क्रम को उखाड़ कर रख दिया. उन्होंने पिच से काफी मदद के साथ कप्तान रोहित शर्मा को आउट कर दिया.</p> <p style=\"text-align: justify;\">टॉपली की दृढ़ता ने उन्हें एक और विकेट तब दिलाया, जब उन्होंने एक छोटी गेंद पन शिखर धवन को पवेलियन भेजा. दूसरे छोर से, डेविड विली बेहतरीन गेंदबाजी कर रहे थे और उन्हें उसी के लिए ईनाम मिला, जब उन्होंने विराट कोहली को कैच आउट कराया.</p> <p style=\"text-align: justify;\">ओल्ड ट्रैफर्ड में, यह फिर से टॉपली थे, जो भारत के शीर्ष क्रम के लिए समस्याएं पैदा कर रहे थे. उन्होंने धवन, रोहित और कोहली को जल्दी से अपना शिकार बनाया. वनडे में ओवरऑल रिकॉर्ड की बात करें तो भारत के टॉप थ्री का संघर्ष और भी स्पष्ट हो जाता है. वनडे मैचों में, शर्मा को बाएं हाथ के तेज गेंदबाजों ने 28 मौकों पर आउट किया है. धवन 26 बार आउट हो चुके हैं. कोहली को बाएं हाथ के तेज गेंदबाजों ने 30 बार चलता किया है.</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/ind-vs-eng-hardik-pandya-revealed-secret-of-his-success-told-what-was-plan-in-bowling-against-england-2170542\">IND vs ENG: हार्दिक पांड्या ने खोला अपनी सफलता का राज, बताया- इंग्लैंड के खिलाफ गेंदबाजी में क्या था प्लान</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/west-indies-cricketer-lendl-simmons-announced-retirement-from-international-cricket-2170931\"><strong>Lendl Simmons Retirement: वेस्टइंडीज के क्रिकेटर सिमंस ने इंटरनेशनल क्रिकेट से किया संन्यास का ऐलान</strong></a></p>","content":null,"pubDate":"2022-07-18 17:44:12","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"West Indies batter Lendl Simmons announces his retirement from international cricket","link":"https://www.indiatoday.in/sports/cricket/story/west-indies-batter-lendl-simmons-announces-his-retirement-from-international-cricket-1977149-2022-07-18?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Lendl Simmons announces his retirement from international cricket","content":null,"pubDate":"2022-07-18 17:40:35","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"'A bombshell with a long fuse': How Ben Stokes shocked English cricket - and what comes next","link":"https://uk.sports.yahoo.com/news/bombshell-long-fuse-ben-stokes-172450192.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-07-18 17:24:50","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Babar Azam vs Virat Kohli centuries: Virat Kohli and Babar Azam total centuries in international Cricket","link":"https://thesportsrush.com/cricket-news-babar-azam-vs-virat-kohli-centuries-virat-kohli-and-babar-azam-total-centuries-in-international-cricket/","keywords":["Cricket","babar azam","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Babar Azam vs Virat Kohli centuries: The mutual respect between these two cricketers had won fans’ hearts from either side of the border. When team India lost the second of the recently concluded three-match ODI series against England at the Lord’s in London, Virat Kohli was yet again the man and the topic to be… The post Babar Azam vs Virat Kohli centuries: Virat Kohli and Babar Azam total centuries in international Cricket appeared first on The SportsRush.","content":"Babar Azam vs Virat Kohli centuries: The mutual respect between these two cricketers had won fans’ hearts from either side of the border. When team India lost the second of the recently concluded three-match ODI series against England at the Lord’s in London, Virat Kohli was yet again the man and the topic to be discussed and debated, as the 33-year-old headed back towards the dressing room after registering yet another low score in international Cricket, leaving his fans poker-faced with an ever-lasting spell of disappointment. Post midnight, however, Pakistan skipper and one of the best batters across formats at present, Babar Azam, took to his social media handle to lend a shoulder to the champion Indian batter, affirming him that this bad phase would pass soon, while advising him to stay strong. Kohli too, some hours later thanked Babar for his words, while wishing him all the best for his future or perhaps his team’s ongoing away Test series versus Sri Lanka. While Kohli yet again got dismissed on a low score (17) during the third ODI yesterday at Old Trafford, Babar went on to smash his 7th Test century of the highest order, with the rest of the batting line-up falling like a deck of cards in the first innings of the 1st Test against Sri Lanka at Galle. Babar also, in the process, went on to become the fastest Asian to complete 10,000 international runs, surpassing Kohli himself to the landmark. Virat Kohli had raised his standards so high that now even an average of 36.75 is looking bad. It’s not that he is terribly out of form but only failing to convert scores into centuries like he used to do in the past. He still has 9 fifties in last 20 innings in ODIs. #EngvInd pic.twitter.com/TLuJCDbrlR — Mazher Arshad (@MazherArshad) July 17, 2022 Babar Azam vs Virat Kohli centuries Two modern day legends for sure, but there is no comparison between these two batters in terms of the number of respective individual centuries they have hit in their international career so far. While Virat made his international debut in the year 2008, Babar arrived at the international cricketing scene only in 2015. With consistency being the hallmark of both these right-handed batters, while Virat has a total of 70 centuries (27 ODI and 43 Test) across 463 international matches, Babar has 25 tons (17 ODI, 7 Test, and 1 T20I) under his name in 204* international games for his side. While it remains to be seen how close Babar gets to Virat’s century count in the coming years, the cricketing fraternity would also keep a keen eye on how Kohli manages to come out of what is perhaps the lowest point in his career so far with the bat. The post Babar Azam vs Virat Kohli centuries: Virat Kohli and Babar Azam total centuries in international Cricket appeared first on The SportsRush.","pubDate":"2022-07-18 17:10:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ben Stokes quits one-day cricket and hits out at 'unsustainable' England schedule","link":"https://uk.sports.yahoo.com/news/ben-stokes-retire-one-day-113200106.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-07-18 17:08:33","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Lendl Simmons Retirement: वेस्टइंडीज के क्रिकेटर सिमंस ने इंटरनेशनल क्रिकेट से किया संन्यास का ऐलान","link":"https://www.abplive.com/sports/cricket/west-indies-cricketer-lendl-simmons-announced-retirement-from-international-cricket-2170931","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p><strong>Lendl Simmons Retirement: </strong>वेस्टइंडीज के बेहतरीन क्रिकेटर लेंडल सिमंस ने इंटरनेशनल क्रिकेट से संन्यास का ऐलान कर दिया है. वनडे और टी20 क्रिकेट में शानदार प्रदर्शन कर चुके सिमंस का करियर अच्छा रहा. उनके संन्यास की खबर त्रिनबगो नाइट राइडर्स ने अपने ट्विटर हैंडल के जरिए दी. सिमंस वनडे क्रिकेट में 2 शतक और 16 अर्धशतक लगा चुके हैं. उन्होंने टी20 इंटरनेशनल मैचों में भी अच्छा प्रदर्शन किया है.</p> <p>सिमंस ने वेस्टइंडीज के लिए वनडे डेब्यू मैच पाकिस्तान के खिलाफ साल 2006 में खेला था. जबकि उन्होंने टी20 इंटरनेशनल में डेब्यू मैच 2007 में खेला था. सिमंस 68 वनडे मैचों में 1958 रन बना चुके हैं. इस दौरान उन्होंने 2 शतक और 16 अर्धशतक लगाए. सिमंस 68 इंटरनेशनल टी20 मैचों में 1527 रन दिए हैं. इसमें उन्होंने 9 अर्धशतक लगाए हैं. वे 8 टेस्ट मैच भी खेल चुके हैं.</p> <p>कैरिबियाई खिलाड़ी सिमंस इंडियन प्रीमियर लीग में भी खेल चुके हैं. इस लीग में उन्होंने 29 मैच खेले हैं और इस दौरान 1079 रन बनाए हैं. आईपीएल में सिमंस एक शतक और 11 अर्धशतक लगा चुके हैं. इस दौरान उनका सर्वश्रेष्ठ स्कोर 100 रन रहा है.</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Congratulations on a terrific international career, <a href=\"https://twitter.com/54simmo?ref_src=twsrc%5Etfw\">@54simmo</a> 👏👏<br /><br />He retires from <a href=\"https://twitter.com/windiescricket?ref_src=twsrc%5Etfw\">@windiescricket</a> with 3763 runs across all three formats with an ODI highest score of 122 vs Bangladesh. Happy second innings, Simmo ❤️✨ <a href=\"https://twitter.com/hashtag/LendlSimmons?src=hash&amp;ref_src=twsrc%5Etfw\">#LendlSimmons</a> <a href=\"https://twitter.com/hashtag/Cricket?src=hash&amp;ref_src=twsrc%5Etfw\">#Cricket</a> <a href=\"https://twitter.com/hashtag/Retirement?src=hash&amp;ref_src=twsrc%5Etfw\">#Retirement</a> <a href=\"https://t.co/al4FUwY1WY\">pic.twitter.com/al4FUwY1WY</a></p> &mdash; Trinbago Knight Riders (@TKRiders) <a href=\"https://twitter.com/TKRiders/status/1549071912126464000?ref_src=twsrc%5Etfw\">July 18, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/ben-stokes-retirement-virat-kohli-says-you-re-the-most-competitive-bloke-i-ve-ever-played-against-2170913\">Ben Stokes के संन्यास पर Virat Kohli ने दी प्रतिक्रिया, सम्मान में कही यह बड़ी बात</a></strong></p> <p><a href=\"https://www.abplive.com/sports/cricket/ben-stokes-odi-retirement-best-innings-against-australia-century-2170784\"><strong>Ben Stokes ने जब ऑस्ट्रेलिया के खिलाफ बनाया था वनडे करियर का सर्वश्रेष्ठ स्कोर, इंग्लैंड ने दर्ज की थी शानदार जीत</strong></a></p>","content":null,"pubDate":"2022-07-18 17:07:19","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Ben Stokes के संन्यास पर Virat Kohli ने दी प्रतिक्रिया, सम्मान में कही यह बड़ी बात","link":"https://www.abplive.com/sports/cricket/ben-stokes-retirement-virat-kohli-says-you-re-the-most-competitive-bloke-i-ve-ever-played-against-2170913","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Virat Kohli Ben Stokes ODI Retirement:</strong> इंग्लैंड के दिग्गज ऑलराउंडर बेन स्टोक्स ने वनडे क्रिकेट से संन्यास का ऐलान कर दिया है. वे अपना आखिरी वनडे इंटरनेशनल मैच दक्षिण अफ्रीका के खिलाफ खेलेंगे. स्टोक्स के संन्यास को लेकर विराट कोहली ने प्रतिक्रिया दी है. कोहली ने स्टोक्स के सम्मान में बहुत बड़ी बात कह दी है. इस ऑलराउंडर ने अपने इंस्टाग्राम पर दो तस्वीरें शेयर कर संन्यास का ऐलान किया. इस पर कोहली ने कमेंट किया है.</p> <p style=\"text-align: justify;\">स्टोक्स ने इंस्टाग्राम और ट्विटर पर दो तस्वीरें शेयर की हैं. इसमें एक फोटो उनकी है, जबकि दूसरे में उन्होंने एक लेटर लिखा है. इस लेटर में स्टोक्स ने संन्यास का खुलासा किया है. पूर्व भारतीय कप्तान कोहली ने स्टोक्स के इंस्टाग्राम पर कमेंट किया है. उन्होंने लिखा, ''आप सबसे अधिक प्रतिस्पर्धी खिलाड़ी हैं जिनके खिलाफ मैंने कभी खेला है. रेस्पेक्ट.''</p> <blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 540px; min-width: 326px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/CgJuAELj927/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"14\"> <div style=\"padding: 16px;\"> <div style=\"display: flex; flex-direction: row; align-items: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 40px; margin-right: 14px; width: 40px;\">&nbsp;</div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 100px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 60px;\">&nbsp;</div> </div> </div> <div style=\"padding: 19% 0;\">&nbsp;</div> <div style=\"display: block; height: 50px; margin: 0 auto 12px; width: 50px;\">&nbsp;</div> <div style=\"padding-top: 8px;\"> <div style=\"color: #3897f0; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: 550; line-height: 18px;\">View this post on Instagram</div> </div> <div style=\"padding: 12.5% 0;\">&nbsp;</div> <div style=\"display: flex; flex-direction: row; margin-bottom: 14px; align-items: center;\"> <div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(0px) translateY(7px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; height: 12.5px; transform: rotate(-45deg) translateX(3px) translateY(1px); width: 12.5px; flex-grow: 0; margin-right: 14px; margin-left: 2px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(9px) translateY(-18px);\">&nbsp;</div> </div> <div style=\"margin-left: 8px;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 20px; width: 20px;\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 2px solid transparent; border-left: 6px solid #f4f4f4; border-bottom: 2px solid transparent; transform: translateX(16px) translateY(-4px) rotate(30deg);\">&nbsp;</div> </div> <div style=\"margin-left: auto;\"> <div style=\"width: 0px; border-top: 8px solid #F4F4F4; border-right: 8px solid transparent; transform: translateY(16px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; flex-grow: 0; height: 12px; width: 16px; transform: translateY(-4px);\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 8px solid #F4F4F4; border-left: 8px solid transparent; transform: translateY(-4px) translateX(8px);\">&nbsp;</div> </div> </div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center; margin-bottom: 24px;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 224px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 144px;\">&nbsp;</div> </div> <p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\"><a style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none;\" href=\"https://www.instagram.com/p/CgJuAELj927/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\" rel=\"noopener\">A post shared by Ben Stokes (@stokesy)</a></p> </div> </blockquote> <p> <script src=\"//www.instagram.com/embed.js\" async=\"\"></script> </p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/ben-stokes-odi-retirement-best-innings-against-australia-century-2170784\">Ben Stokes ने जब ऑस्ट्रेलिया के खिलाफ बनाया था वनडे करियर का सर्वश्रेष्ठ स्कोर, इंग्लैंड ने दर्ज की थी शानदार जीत</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/india-win-odi-series-in-england-after-8-years-in-rohit-sharma-captaincy-2170650\"><strong>Rohit Sharma की कप्तानी में भारत ने दोहराया 8 साल पुराना रिकॉर्ड, इंग्लैंड में सिर्फ 3 बार हुआ यह कमाल</strong></a></p>","content":null,"pubDate":"2022-07-18 16:54:13","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Team India के पूर्व क्रिकेटर ने वनडे क्रिकेट को लेकर दिया बड़ा बयान, बोले- 'इस फॉर्मेट का भविष्य निश्चित नहीं'","link":"https://www.abplive.com/sports/cricket/pragyan-ojha-says-odi-cricket-future-not-stable-indian-cricket-2170875","keywords":null,"creator":["Agencies"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Pragyan Ojha Team India:</strong> पूर्व भारतीय स्पिनर प्रज्ञान ओझा को लगता है कि वनडे अंतर्राष्ट्रीय क्रिकेट का भविष्य टेस्ट क्रिकेट की तुलना में अनिश्चित है. ओझा की टिप्पणी इंग्लैंड के हरफनमौला बेन स्टोक्स द्वारा वनडे से संन्यास लेने की घोषणा के बाद आई है. इंग्लैंड और दक्षिण अफ्रीका वनडे में आमने-सामने होंगे, जो मंगलवार से शुरू हो रही है. ईसीबी के अनुसार, स्टोक्स ने 104 वनडे मैच खेले हैं और अपने वनडे अंतरराष्ट्रीय करियर को घरेलू मैदान पर समाप्त करने वाले हैं.</p> <p style=\"text-align: justify;\">ओझा ने कहा, हम टेस्ट क्रिकेट के भविष्य को लेकर चिंतित थे, लेकिन वनडे का भविष्य अनिश्चित दिख रहा है. भविष्य में हम कई क्रिकेटरों को इस प्रारूप से संन्यास लेते हुए दिखेंगे.</p> <p style=\"text-align: justify;\">स्टोक्स की बात करें तो, 31 वर्षीय खिलाड़ी के एकदिवसीय करियर को लॉर्डस में 2019 आईसीसी पुरुष क्रिकेट विश्व कप फाइनल में उनके 'प्लेयर ऑफ द मैच' प्रदर्शन को हमेशा याद किया जाएगा.</p> <p style=\"text-align: justify;\">स्टोक्स के नाबाद 84 रन ने मैच को सुपर ओवर में भेजने में मदद की, जिससे इंग्लैंड ने सबसे रोमांचक परिस्थितियों में अपना पहला आईसीसी क्रिकेट विश्व कप खिताब जीता.</p> <p style=\"text-align: justify;\">गौरतलब है कि प्रज्ञान ओझा टीम के लिए 24 टेस्ट मैचों में 113 विकेट ले चुके हैं. जबकि वे 18 वनडे मैचों में 21 विकेट हासिल कर चुके हैं. प्रज्ञान का इंटरनेशनल करियर ज्यादा लंबा नहीं रहा है. उन्होंने 6 इंटरनेशनल टी20 मैच भी खेले हैं. ओझा ने इस फॉर्मेट में 6 विकेट लिए हैं.</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/rishabh-pant-girlfriend-isha-negi-reacts-on-match-winning-century-india-vs-england-2170810\">Rishabh Pant की तूफानी मैच विनिंग पारी पर गर्लफ्रेंड ईशा ने दिया रिएक्शन, ऐसे जाहिर की खुशी</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/ben-stokes-retirement-announcement-odi-cricket-england-all-rounder-2170719\"><strong>Ben Stokes Retirement: इंग्लैंड के दिग्गज खिलाड़ी बेन स्टोक्स ने वनडे फॉर्मेट से संन्यास का किया ऐलान</strong></a></p>","content":null,"pubDate":"2022-07-18 16:18:31","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket SA dismiss reports that Lizelle Lee was blocked from playing in The Hundred","link":"https://www.iol.co.za/sport/cricket/proteas-women/cricket-sa-dismiss-reports-that-lizelle-lee-was-blocked-from-playing-in-the-hundred-796be7d3-91b7-400e-9f16-d16e5910406f","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Cricket South Africa say reports concerning threats it made to Lizelle Lee, regarding her participation in T20 Leagues, are not true.","content":null,"pubDate":"2022-07-18 16:07:41","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/83869801-22a7-5380-ac0e-9554b6a996bf&operation=CROP&offset=0x578&resize=5568x3134","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"England all-rounder Ben Stokes retires from ODI cricket","link":"https://telanganatoday.com/england-all-rounder-ben-stokes-retires-from-odi-cricket","keywords":["News","Sport","Ben Stokes","England","ODI cricket","Word Cup"],"creator":["Telangana Today"],"video_url":null,"description":"London: Star England all-rounder and 2019 Word Cup final hero Ben Stokes on Monday made a surprise announcement to retire from ODI cricket, saying playing three formats has become “unsustainable” for him. The 31-year-old Stokes will play his last ODI against South Africa at his home ground in Durham on Tuesday. Stokes’ ODI career will […]","content":"London: Star England all-rounder and 2019 Word Cup final hero Ben Stokes on Monday made a surprise announcement to retire from ODI cricket, saying playing three formats has become “unsustainable” for him. The 31-year-old Stokes will play his last ODI against South Africa at his home ground in Durham on Tuesday. Stokes’ ODI career will forever be remembered for his Player-of-the-Match performance in the World Cup final against New Zealand at the Lord’s three years ago. His unbeaten 84 helped to send the match into a Super Over as England claimed their first 50-over World Cup title in the most thrilling of circumstances. Stokes, who is England’s Test captain, has scored 2,919 runs in 104 ODIs and taken 74 wickets. “I will play my last game for England in ODI cricket on Tuesday in Durham. I have decided to retire from this format,” he said in an England and Wales Cricket Board (ECB) statement. “This has been an incredibly tough decision to make. I have loved every minute of playing with my mates for England. We have had an incredible journey on the way. “As hard as a decision as this was to come to, it’s not as hard dealing with the fact I can’t give my teammates 100% of myself in this format anymore. The England shirt deserves nothing less from anyone who wears it,” he added.After making his ODI debut against Ireland in 2011, Stokes has emerged as one of England’s top all-rounders, slamming three centuries. Stokes said he was no longer able to give 100 per cent and that playing three formats was “unsustainable” for him now. “Three formats are just unsustainable for me now. Not only do I feel that my body is letting me down because of the schedule and what is expected of us, but I also feel that I am taking the place of another player who can give Jos and the rest of the team their all. “It’s time for someone else to progress as a cricketer and make incredible memories like I have over the past 11 years. “I will give everything I have to Test cricket, and now, with this decision, I feel I can also give my total commitment to the T20 format.” He wished luck to current white-ball captain Jos Buttler and coach Matthew Mott. “I would like to wish Jos Buttler, Matthew Mott, the players and the support staff every success going forward. We have made great strides in white-ball cricket over the past seven years, and the future looks bright. “I have loved all 104 games I have played so far, I’ve got one more, and it feels amazing to be playing my last game at my home ground in Durham.” “As always, the England fans have always been there for me and will continue to be there. You’re the best fans in the world. I hope we can win on Tuesday and set the series up nicely against South Africa,” Stokes said.","pubDate":"2022-07-18 15:51:55","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Nasser Hussain: Ben Stokes' ODI retirement for England a 'massive surprise' - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LnNreXNwb3J0cy5jb20vY3JpY2tldC9uZXdzLzEyMTIzLzEyNjU0NDc2L25hc3Nlci1odXNzYWluLWJlbi1zdG9rZXMtb2RpLXJldGlyZW1lbnQtZm9yLWVuZ2xhbmQtYS1tYXNzaXZlLXN1cnByaXNl0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Nasser Hussain: Ben Stokes' ODI retirement for England a 'massive surprise'  Sky SportsBen Stokes to retire from ODI cricket due to ‘unsustainable’ schedule  The GuardianBen Stokes to retire from ODI cricket after Chester-le-Street farewell  ESPNcricinfoBen Stokes: England all-rounder to retire from one-day internationals after South Africa game  Sky SportsEngland and Wales Cricket Board (ECB) - The Official Website of the ECB  ECB.co.ukView Full coverage on Google News","content":null,"pubDate":"2022-07-18 15:36:08","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Give me 20 minutes with Virat Kohli, I'll help him, says Sunil Gavaskar","link":"https://www.thehansindia.com/sports/cricket/give-me-20-minutes-with-virat-kohli-ill-help-him-says-sunil-gavaskar-754017","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Virat Kohli has scored 70 international centuries for IndiaHowever, he has not scored a ton since November 2019Kohli did not score a single fifty in England","content":"Virat Kohli and Sunil GavaskarVirat Kohli and Sunil GavaskarFormer India captain Sunil Gavaskar has said if he gets \"about 20 minutes\" with Virat Kohli, he'll be able to help the struggling top-order batsman. Kohli, who has scored over 10,000 international runs for India, has not scored a century in nearly three years. In his last six innings for India, Kohli did not even reach the fifty-run mark. Elaborating on Kohli's issues with the bat, Gavaskar said the nagging line outside the off-stump is troubling the Delhi batsman and the \"anxiety\" to return to scoring form is making things worse for him. \"If I had about 20 minutes with him, I would be able to tell him the things he might have to do. It might help him, I am not saying it will help him but it could, particularly with regards to that off-stump line. Having been an opening batter, having been troubled by that line, there are certain things that you try and do. If I get 20 minutes with him, I might be able to tell him,\" Gavaskar told India Today. Kohli looked evidently frustrated with all his dismissals during the recently ended limited-overs series in England. He was not a part of the Indian team that is set to travel to the Caribbean for three ODIs and five T20Is.Perspective pic.twitter.com/yrNZ9NVePf— Virat Kohli (@imVkohli) July 16, 2022 \"It goes back to the fact that his first mistake turns out to be his last. Again, just because he is not amongst the runs, there is this anxiety to play at every delivery because that is what batters feel, they have got to score. You look to play at deliveries that you otherwise won't. But he has gotten out to good deliveries as well on this particular tour. \"I think we just have to wait and see when he comes back, whether it helps or not helps. As I said, he is allowed a few failures, look at his record for India, 70 international hundreds. I mean, he has got runs in all formats of the game, in all conditions,\" Gavaskar added. Kohli has recorded 70 international centuries and is one away from equalling Australia great Ricky Ponting. Specifically in Tests, Kohli (27) is fourth in the list of most centuries for India, after Sachin Tendulkar (51), Rahul Dravid (36), and Sunil Gavaskar (35). \"Let's be patient, let's not rush things. We, somehow in India, hurry once a player reaches 32, 33, we all the time, look to push him out of the team when they have so much more to contribute. Let's be patient with Kohli as well. All these greats who have served Indian cricket are allowed a few failures.\"Thank you. Keep shining and rising. Wish you all the best 👏— Virat Kohli (@imVkohli) July 16, 2022 Kohli is expected to be back for the 2022 Asia Cup tournament, which is scheduled to be played from Aug. 27 to Sept. 11. Originally, Sri Lanka were named hosts of the tournament, which will see the likes of India, Pakistan, Sri Lanka, Bangladesh, and Afghanistan battle out for the trophy. However, due to the economic crisis in Sri Lanka and mass protests across the country, the Secretary of SLC Mohan de Silva earlier stated that the tournament is likely to be hosted in the United Arab Emirates.","pubDate":"2022-07-18 15:31:04","image_url":"https://assets.thehansindia.com/h-upload/2022/07/18/500x300_1303582-virat-kohli.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes IPL record: Ben Stokes best score in IPL","link":"https://thesportsrush.com/cricket-news-ben-stokes-ipl-record-ben-stokes-best-score-in-ipl/","keywords":["Cricket","Ben Stokes","Indian Premier League","IPL"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ben Stokes best score in IPL: Compared to some of his star English peers, the Durham all-rounder is not very rich in experience in the IPL. England’s hero from the ICC 2019 World Cup final at the iconic Lord’s, Ben Stokes, announced his shock retirement from the game’s 50-Over format on Monday evening, just a… The post Ben Stokes IPL record: Ben Stokes best score in IPL appeared first on The SportsRush.","content":"Ben Stokes best score in IPL: Compared to some of his star English peers, the Durham all-rounder is not very rich in experience in the IPL. England’s hero from the ICC 2019 World Cup final at the iconic Lord’s, Ben Stokes, announced his shock retirement from the game’s 50-Over format on Monday evening, just a day after his team’s 1-2 ODI series loss post the final match at the Old Trafford in Manchester. Expressing an inability to give his teammates 100% of himself in the format, coupled with the ever pressing issue of continued sustenance in all the three formats of the game, the 31-year-old announced that England’s first ODI versus South Africa tomorrow (Tuesday), in front of his home crowd in Durham would be the last time he’d represent his country in One-Day internationals. Having missed the entire summer last year while prioritizing his mental health, the Durham all-rounder even decided not to get himself registered for IPL 2022, citing workload management. Having bowled mere three Overs in the three recently concluded ODIs versus India as well, Stokes finally decided to bid adieu to the format, and give it his all in the Tests and the T20Is from here on. pic.twitter.com/xTS5oNfN2j — Ben Stokes (@benstokes38) July 18, 2022 ALSO READ: Virat Kohli reacts after Stokes’ retirement from ODI Cricket Ben Stokes best score in IPL As far as his Indian Premier League experience is concerned, Stokes began playing the lucrative league since its 2017 edition, with his first season for the now-defunct Rising Pune Supergiants (RPS). He then played the next four seasons for the Rajasthan Royals (RR), while deciding to withdraw from the league’s 15th season this year. All in all, Stokes has played a total of 43 IPL matches till date, and has scored 920 runs at an average of 25.55, with the help of two half-centuries and as many centuries. He has also scalped 28 wickets in the league at an average and economy rate of 34.78 and 8.55 respectively. His highest/best score in the IPL came while representing RR in the year 2020, when he played a scintillating knock of 107 off mere 60 deliveries against the Mumbai Indians (MI), to see his side home by 8 wickets, en route the 196-run target. The post Ben Stokes IPL record: Ben Stokes best score in IPL appeared first on The SportsRush.","pubDate":"2022-07-18 15:18:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"West Indies cricketer Denesh Ramdin retires from international cricket","link":"https://www.indiatvnews.com/sports/cricket/denesh-ramdin-announces-retirement-from-international-cricket-west-indies-cricketer-last-played-t20-in-2019-2022-07-18-793103","keywords":null,"creator":null,"video_url":null,"description":"West Indies cricketer Denesh Ramdin has announced his retirement from international cricket in an Instagram post. Ramdin last played for West Indies in a T20I in December 2019. Ramdin played 74 Tests, 139 ODIs and 71 T20Is. He made his debut in 2005 against Sri Lanka in a test match at Colombo.","content":null,"pubDate":"2022-07-18 15:07:22","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"}]}