{"newsArray":[{"title":"Pakistan's team masseur tests positive in Colombo","link":"https://www.thenews.com.pk/print/972343-pakistan-s-team-masseur-tests-positive-in-colombo","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: One of the Pakistan national cricket team support staff member, their masseur, has tested positive for Covid 19 and has been isolated.The team masseur after arriving in Colombo along with the team returned with Covid positive and was separated from the rest of the touring pack, it was...","content":null,"pubDate":"2022-07-08 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Central Punjab Blues take on KP Whites in U19 Cup final today","link":"https://www.thenews.com.pk/print/972335-central-punjab-blues-take-on-kp-whites-in-u19-cup-final-today","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Central Punjab Blues will take on last year’s finalists Khyber Pakhtunkhwa Whites in the final of the National Under-19 Cup at the Rana Naveed Cricket Academy in Sheikhupura on Friday . Both teams topped their pools in the 12-team 50-overs tournament.The winners will receive a purse...","content":null,"pubDate":"2022-07-08 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Maxwell has 2nd test in sight","link":"https://www.couriermail.com.au/sport/cricket/maxwell-has-2nd-test-in-sight/video/d78f4c7b8711c4e2bbdf81a47e30468c","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia have hinted at Glenn Maxwell making a return for the 2nd test against Sri Lanka.","content":"Cricket: Australia have hinted at Glenn Maxwell making a return for the 2nd test against Sri Lanka.","pubDate":"2022-07-07 23:09:20","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Lanning chasing cricket gold at Comm Games","link":"https://www.cairnspost.com.au/sport/cricket/lanning-chasing-cricket-gold-at-comm-games/video/d8045b6c3dc0a09e91011a9cb48cb2cf","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Meg Lanning is hoping to lead Australia to first cricket gold medal at the Commonwealth Games.","content":null,"pubDate":"2022-07-07 22:36:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“There’s no point for Hardik Pandya to play”: Hardik Pandya reveals why he opted to stay away from cricket post back surgery","link":"https://thesportsrush.com/cricket-news-theres-no-point-for-hardik-pandya-to-play-hardik-pandya-reveals-why-he-opted-to-stay-away-from-cricket-post-back-surgery/","keywords":["Cricket","England","Hardik Pandya","India","India tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Hardik Pandya: The Indian all-rounder won a Player of the Match award for the second time in T20I career tonight. India all-rounder Hardik Pandya’s second Player of the Match performance in the shortest format played a key role in powering the team to a 50-run victory over England in Southampton tonight. Pandya, who contributed across… The post “There’s no point for Hardik Pandya to play”: Hardik Pandya reveals why he opted to stay away from cricket post back surgery appeared first on The SportsRush.","content":"Hardik Pandya: The Indian all-rounder won a Player of the Match award for the second time in T20I career tonight. India all-rounder Hardik Pandya’s second Player of the Match performance in the shortest format played a key role in powering the team to a 50-run victory over England in Southampton tonight. Pandya, who contributed across divisions, registered his highest T20I score and picked career-best T20I bowling figures to experience one of the best days of his international career. Coming in to bat at No. 5 in the ninth over, Pandya scored 51 (33) with the help of six fours and a six at a strike rate of 154.54 to propel India to 198/8 in 20 overs. Pandya, 28, followed his maiden T20I half-century with his second four-wicket haul as bowling figures of 4-0-33-4 were instrumental in dismissing England on 148 in 19.3 overs. Also Hardik to Rohit: pic.twitter.com/za9tkzA4Ra — Rajasthan Royals (@rajasthanroyals) July 7, 2022 “Last time, when I played in England, I took a four-for and scored 30-odd [33*] runs. So, I kind of knew I was the first Indian to score fifty and take four wickets. Enjoying my cricket right now,” Pandya told Sky Sports about his awareness regarding achieving a personal milestone. Readers must note that Pandya’s last T20I in England had come exactly four years ago when he had picked figures of 4-0-38-4 and scored 33* (14) chasing a 199-run target in Bristol. The match is fondly remembered for current captain Rohit Sharma’s third T20I century. Hardik Pandya reveals why he opted to stay away from cricket post back surgery Pandya, who has had nothing short of a tremendous time since his return to cricket in Indian Premier League 2022, is a whole different cricketer when available as a bowler. An encouraging sign for both Pandya and the Indian cricket team is the effortless manner in which he has bowled of late. Having said that, the same hasn’t been as smooth as it looks currently. While a back surgery had witnessed Pandya picking and choosing when to play and when to bowl, he has worked extremely hard to stage a proper recovery. “I want success but a lot of time I spend on fitness and my skill sets. Because of the long break that I had, I wanted to get into rhythm. That was a conscious decision when I decided I want some time off from the game. When I know I can’t give my 100%, there’s no point for Hardik Pandya to play,” Pandya revealed why he stayed away from cricket after undergoing a surgery. The post “There’s no point for Hardik Pandya to play”: Hardik Pandya reveals why he opted to stay away from cricket post back surgery appeared first on The SportsRush.","pubDate":"2022-07-07 22:30:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"West Indies vs Bangladesh, 3rd T20I, Bangladesh tour of West Indies, 2022 - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vbS5jcmljYnV6ei5jb20vbGl2ZS1jcmlja2V0LXNjb3Jlcy80Nzg2OS9iYW4tdnMtd2ktM3JkLXQyMGktYmFuZ2xhZGVzaC10b3VyLW9mLXdlc3QtaW5kaWVzLTIwMjLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs Bangladesh, 3rd T20I, Bangladesh tour of West Indies, 2022  CricbuzzLIVE Cricket Score, West Indies vs Bangladesh, 3rd T20I in Guyana - Firstpost  FirstpostWI vs BAN Dream11 Team Prediction: Check Captain, Vice-Captain, and Probable Playing XIs for 3rd T20I match  News18West Indies vs Bangladesh, 2nd T20I: Live score and Updates  India TodayWI vs BAN: Weather Forecast And Pitch Report of Providence Stadium, Guyana- Bangladesh Tour Of West Indies 2022, 3rd T20I  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-07-07 22:13:23","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pandya Stars for Impressive India! | Highlights - England v India | 1st Men's Vitality IT20 2022 - England & Wales Cricket Board","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9TWFJR1dCRGFIb3fSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pandya Stars for Impressive India! | Highlights - England v India | 1st Men's Vitality IT20 2022  England & Wales Cricket Board‘It's like keeping your Ferrari parked in garage’: Ex-BCCI selector on India XI  Hindustan TimesEngland vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match..  NDTV SportsAre India losing their Test plot? | Sledging Room Ep 04  India TodayENG VS IND: It Was Great To Watch Rishabh Pant Bat: Ben Stokes  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-07-07 21:16:16","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs England, 1st T20I: Hardik Pandya stars as India beat England by 50 runs - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMiqwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pbmRpYS1pbi1lbmdsYW5kL2luZGlhLXZzLWVuZ2xhbmQtMXN0LXQyMGktaGFyZGlrLXBhbmR5YS1zdGFycy1hcy1pbmRpYS1iZWF0LWVuZ2xhbmQtYnktNTAtcnVucy9hcnRpY2xlc2hvdy85MjczNDAwNS5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs England, 1st T20I: Hardik Pandya stars as India beat England by 50 runs  Times of IndiaHighlights, India vs England, 1st T20I, Full cricket score: India take 1-0 lead with 50-run win - Firstpost  Firstpost#ENGvIND | Cricbuzz Live: England v India, 1st T20, Post-match show  CricbuzzIndia vs England 1st T20I Highlights: Hardik stars with bat and ball as India thrash England by 50 runs  Times of IndiaGo with Buttler and Suryakumar as your captain and vice-captain  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-07-07 20:54:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Pandya brilliance powers India to win over England in first T20","link":"https://www.thestar.com.my/sport/cricket/2022/07/08/cricket-pandya-brilliance-powers-india-to-win-over-england-in-first-t20","keywords":null,"creator":null,"video_url":null,"description":"SOUTHAMPTON, England (Reuters) - An inspired all-round show from Hardik Pandya fired India to an emphatic 50-run win over England in the first Twenty20 of their three-match series at the Ageas Bowl on Thursday. Read full story","content":null,"pubDate":"2022-07-07 20:48:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/08/1651689.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Ageas Bowl hotel: Hilton Ageas Bowl hotel price in Southampton","link":"https://thesportsrush.com/cricket-news-ageas-bowl-hotel-hilton-ageas-bowl-hotel-price-in-southampton/","keywords":["Cricket","The Ageas Bowl"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ageas Bowl hotel: The Rose Bowl in Southampton is the only Cricket stadium in England that has a hotel inside the venue itself. During the first of the three-match T20I series between England and India at The Rose Bowl in Southampton, team India, courtesy of vital contributions from Deepak Hooda (33 off 17), Suryakumar Yadav (39… The post Ageas Bowl hotel: Hilton Ageas Bowl hotel price in Southampton appeared first on The SportsRush.","content":"Ageas Bowl hotel: The Rose Bowl in Southampton is the only Cricket stadium in England that has a hotel inside the venue itself. During the first of the three-match T20I series between England and India at The Rose Bowl in Southampton, team India, courtesy of vital contributions from Deepak Hooda (33 off 17), Suryakumar Yadav (39 off 19), and Hardik Pandya (51 off 33), who smashed his maiden T20I half-century posted a healthy total of 198/8 in their 20 Overs. As for the English bowling line-up, pacer Chris Jordan (4-0-23-2) and off-spinner Moeen Ali (2-0-26-2) were the only ones who managed to restrict the batters somewhat during the innings. In reply, some fine display of swing bowling from Bhuvneshwar Kumar and debutant Arshdeep Singh with the new ball, and then with Pandya turning up with the ball too, meant that India have had a firm grip in the match, with Jos Buttler’s men requiring another 93 runs off six Overs, with only three wickets in the bank at the time of writing. Very high level of skill in the power play. Impressed with Arshdeep. And look at the difference a fit Hardik makes to the team — Harsha Bhogle (@bhogleharsha) July 7, 2022 Hosting its 10th T20I match, the Rose Bowl or the Ageas Bowl is in fact the only venue in England that has a hotel inside the stadium itself. The Hilton at the Ageas Bowl, is a four-star luxury hotel which boasts of a total of 171 bedrooms, with each of them providing a picturesque view over The Ageas Bowl or the sprawling 18-hole Boundary Lakes Golf Course. Additionally, the hotel also accommodates a large ballroom, eight meeting rooms, multi-purpose suites and a 24-hour connectivity center, world-class spa, and finally some lip-smacking delicacies at BEEFY’S by Sir Ian Botham Restaurant & Bar. As per MakemyTrip, the per night cost of a single bed room is around INR 9,330 (exclusive of taxes and other fee), with a complimentary breakfast. The price per room increase with the addition of meals and other services including free cancellation, or the option of payment at a later date. With a total of 17 different room types, including the Deluxe King, Deluxe Queen, The President’s Suite, One-bedroom King Suite to name a few, the cost per room increases with the facilities they provide.","pubDate":"2022-07-07 20:36:09","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Jos Buttler wicket today: B Kumar castles Jos Buttler with an absolute jaffa in Southampton T20I","link":"https://thesportsrush.com/cricket-news-jos-buttler-wicket-today-b-kumar-castles-jos-buttler-with-an-absolute-jaffa-in-southampton-t20i/","keywords":["Cricket","Videos","Bhuvneshwar Kumar","England","India","India tour of England 2022","Jos Buttler"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Jos Buttler wicket today: The English captain registered a golden duck in his first match as a full-time captain. During the first T20I of the ongoing India’s tour of England in Southampton, England captain Jos Buttler (0) registered a failure in his first match as a full-time captain. Opening the batting with Jason Roy (4),… The post Jos Buttler wicket today: B Kumar castles Jos Buttler with an absolute jaffa in Southampton T20I appeared first on The SportsRush.","content":"Jos Buttler wicket today: The English captain registered a golden duck in his first match as a full-time captain. During the first T20I of the ongoing India’s tour of England in Southampton, England captain Jos Buttler (0) registered a failure in his first match as a full-time captain. Opening the batting with Jason Roy (4), all Buttler could last at The Rose Bowl was a solitary delivery. Facing Bhuvneshwar Kumar, Buttler failed all ends up to read an in-swinging delivery. If truth be told, Kumar set Buttler up even with him being at the non-striker’s end. Having witnessed four consecutive out-swinging balls to Roy, Buttler wasn’t entirely wrong to expect another one to him. Having said that, Kumar played smart by bowling an absolute jaffa of an in-swinging delivery. Late to play a flick, Buttler found himself in no position to either defend the ball or play a scoring shot. With the ball swinging sharply into Buttler, all the right-handed batter could do was watch it hitting the stumps. Opening the batting for the 29th time in this format, Buttler was out without scoring for the fifth time in T20Is (second time as an opening batter). Known for his knack of picking wickets with the new ball, Kumar ensured to convert a solid start into an economical first spell as bowling figures of 3-0-10-1 didn’t allow the hosts to thrive in the powerplay of a 199-run chase. BOWLED! Bhuvneshwar Kumar gets the big wicket, Jos Buttler gone for duck 🙌 #ENGvIND pic.twitter.com/NClQLHXFgp — Doordarshan Sports (@ddsportschannel) July 7, 2022 An absolute peach 😍 @BhuviOfficial | #OrangeArmy #ENGvIND pic.twitter.com/eBV44wmaP7 — SunRisers Hyderabad (@SunRisers) July 7, 2022 Bhuvi 🔥🔥 How good was that delivery to get rid of Jos Buttler!! #ENGvIND pic.twitter.com/uGDo9H2G4N — Prasenjit Dey (@CricPrasen) July 7, 2022 Most wickets in Powerplay: All T20 89 Bhuvneshwar Kumar 87 David Willey 70 Ravi Rampaul T20 Internationals 35 Bhuvneshwar Kumar 33 Samuel Badree 33 Tim Southee — Abhishek Mukherjee (@ovshake42) July 7, 2022 For more cricket-related news, click here .","pubDate":"2022-07-07 20:34:52","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"‘Something special’: The freak rise bringing ‘Aussie Flintoff’ prophecy to life - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiyAFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvYXVzdHJhbGlhL2F1c3RyYWxpYS12cy1zcmktbGFua2Etc2Vjb25kLXRlc3QtY3JpY2tldC1uZXdzLXByZXZpZXctY2FtZXJvbi1ncmVlbi1jb250aW51ZXMtcmlzZS1hc2hlcy0yMDIzLXRvdXItb2YtaW5kaWEvbmV3cy1zdG9yeS83NWE0NWU3ZGQyM2M4YzZlNjk5NDkzNTIyNzM5OTg3NNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Something special’: The freak rise bringing ‘Aussie Flintoff’ prophecy to life  Fox SportsPat Cummins reveals Mitchell Starc could be dropped for surprise second Test selection  Wide World of SportsAustralia mull options as Sri Lanka call in the reinforcements | Qantas Runway Report  cricket.com.au'I'm hopeless': Pat Cummins teases end of Glenn Maxwell Test exile  news.com.auHazlewood is world's best bench warmer  St George & Sutherland Shire LeaderView Full coverage on Google News","content":null,"pubDate":"2022-07-07 20:03:20","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"\"If you stay here you will lose your cricket career\" - Twitterati fume as India leave out Sanju Samson of 1st T20I vs ENG","link":"https://www.sportskeeda.com/cricket/news-if-stay-will-lose-cricket-career-twitterati-fume-india-leave-sanju-samson-1st-t20i-vs-eng?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Ankush Das"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-07 19:08:41","image_url":"https://static.sportskeeda.com/editor/2022/07/25a41-16572143708895-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"JIB vs KIN-XI Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for ECS T10 Brescia 2022, Playoff 1","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/jib-vs-kin-xi-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-ecs-t10-brescia-2022-playoff-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-07 19:08:41","image_url":"https://static.sportskeeda.com/editor/2022/07/0b472-16572147338433-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Deepak Hooda height in feet: Deepak Hooda IPL 2022 record and stats","link":"https://thesportsrush.com/cricket-news-deepak-hooda-height-in-feet-deepak-hooda-ipl-2022-record-and-stats/","keywords":["Cricket","Deepak Hooda","England","India","India tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Deepak Hooda height: The rookie Indian batter batted with a strike rate of 194.11 at The Rose Bowl tonight. India batter Deepak Hooda continues to make a mark at the highest level with another impact-generating knock in the ongoing first T20I against England in Southampton. Coming in to bat at No. 3 in the third… The post Deepak Hooda height in feet: Deepak Hooda IPL 2022 record and stats appeared first on The SportsRush.","content":"Deepak Hooda height: The rookie Indian batter batted with a strike rate of 194.11 at The Rose Bowl tonight. India batter Deepak Hooda continues to make a mark at the highest level with another impact-generating knock in the ongoing first T20I against England in Southampton. Coming in to bat at No. 3 in the third over, Hooda scored a stroke-filled 33 (17) with the help of three fours and two sixes at a strike rate of 194.11. Hooda, who had scored a maiden T20I century in the last match against Ireland last month, took all of a solitary delivery before launching attack against England all-rounder Moeen Ali. It was on the first delivery of the fifth over when Hooda danced down the track to hit Ali for a six over long-on. Not afraid to take a risk on the following delivery as well, a fearless Hooda ended up hitting two consecutive sixes to set the ball rolling at The Rose Bowl on Thursday. Consecutive SIXES for Deepak Hooda 🏏 #ENGvIND pic.twitter.com/Nj6hPfTFVJ — Doordarshan Sports (@ddsportschannel) July 7, 2022 Facing England pacer Reece Topley in the next over, Hooda hit as many as three fours as India scored 66/2 in the powerplay. From playing a well-timed flick to punishing Topley for bowling short and wide, Hooda didn’t let India suffer due to the loss of opening batters Rohit Sharma (24) and Ishan Kishan (8). Hooda, 27, was the 10th highest run-scorer in Indian Premier League 2022. Third-highest run-scorer for Lucknow Super Giants, Hooda’s 451 runs had come at an average and strike rate of 32.21 and 136.66 comprising of four half-centuries . In what was his eighth IPL season after stints with Rajasthan Royals (2015), Sunrisers Hyderabad (2016-2019) and Punjab Kings (2020-2021), Hooda managed to register a career-best season right after representing India at the start of this year. Hooda, who represents Rajasthan in domestic cricket now, is said to be five feet and 10 inches (1.8 meter) tall according to a web portal.","pubDate":"2022-07-07 18:28:07","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Weather in Galle Sri Lanka Day 1: Weather in Galle Cricket Stadium SL vs AUS 2nd Test","link":"https://thesportsrush.com/cricket-news-weather-in-galle-sri-lanka-day-1-weather-in-galle-cricket-stadium-sl-vs-aus-2nd-test/","keywords":["Cricket","Australia tour of Sri Lanka 2022","Galle International stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Weather in Galle Sri Lanka Day 1: Australia eye on a series whitewash as they take on Sri Lanka in the second Test match starting today. With Australia picking up 18 of the 20 Sri Lankan wickets during the first Test at the Galle International Stadium, the visitors prevailed by 10 wickets to dent the… The post Weather in Galle Sri Lanka Day 1: Weather in Galle Cricket Stadium SL vs AUS 2nd Test appeared first on The SportsRush.","content":"Weather in Galle Sri Lanka Day 1: Australia eye on a series whitewash as they take on Sri Lanka in the second Test match starting today. With Australia picking up 18 of the 20 Sri Lankan wickets during the first Test at the Galle International Stadium, the visitors prevailed by 10 wickets to dent the Sri Lankan spirits. With the second and the final Test match of the series set to take place at the same venue today, expect another spin-friendly track to challenge the batters from both the sides, with the hosts now staring at a possible whitewash. With as many as three Sri Lankan players down due to COVID-19 ahead of the second Test, expect a string of changes to their playing XI. Australia, on the other hand would perhaps like to hand a Test match recall for all-rounder Glenn Maxwell. with his handy off-spinners likely to extract purchase from the pitch. Australia are considering a bombshell recall for the second #SLvAUS Test in Galle… 👀 pic.twitter.com/hSnMxtdoMY — cricket.com.au (@cricketcomau) July 7, 2022 The good news for the avid fans is that the rain Gods have not made much of an appearance around the Galle International stadium in the past week or so. Despite not many major showers expected during the entire course of the match, expect a decent cloud cover of more than 90% throughout the first day of the Test. Also, as per Accuweather , there is a spell of rain at around 01:00 pm local time, which is predicted to be the only phase where the match might come to a halt. Apart from that, there is very little forecast of a shower till stumps on Day 1, and the match is likely to not lose any Overs due to the same. The very hot and humid conditions during the entire of Day 1, might well pose a decent enough challenge for the batters and bowlers alike today. ALSO READ : Galle International Cricket Stadium pitch report 2nd Test","pubDate":"2022-07-07 18:20:55","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs England, 1st T20I Live Score: Suryakumar Yadav Falls After Quickfire Knock, India 4 Down - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2VuZ2xhbmQtdnMtaW5kaWEtMjAyMi9pbmRpYS12cy1lbmdsYW5kLTFzdC10MjBpLTIwMjItaW5kLXZzLWVuZy1saXZlLXNjb3JlLXVwZGF0ZXMtMzEzNzU4M9IBeGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2VuZ2xhbmQtdnMtaW5kaWEtMjAyMi9pbmRpYS12cy1lbmdsYW5kLTFzdC10MjBpLTIwMjItaW5kLXZzLWVuZy1saXZlLXNjb3JlLXVwZGF0ZXMtMzEzNzU4My9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs England, 1st T20I Live Score: Suryakumar Yadav Falls After Quickfire Knock, India 4 Down  NDTV SportsThe England litmus test to India's World Cup readiness | Cricbuzz.com - Cricbuzz  CricbuzzLive update India vs England, 1st T20I: India four down after Suryakumar departs - Firstpost  FirstpostGo with Buttler and Suryakumar as your captain and vice-captain  ESPNcricinfoIND vs ENG Live Cricket Score 1st T20I Latest Updates: Pandya, Surya Stand Powers India  News18View Full coverage on Google News","content":null,"pubDate":"2022-07-07 18:13:49","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs India: England vs India, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/england-vs-india-live-score-over-1st-t20i-t20-11-15-updates-3138011","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between England vs India from The Rose Bowl, Southampton. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-07-07 18:13:41","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637928342129656116.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"‘We’re excited to work with Enoch Nkwe,’ says Proteas’ stand-in skipper Keshav Maharaj","link":"https://www.iol.co.za/sport/cricket/proteas/were-excited-to-work-with-enoch-nkwe-says-proteas-stand-in-skipper-keshav-maharaj-75269b47-6dc1-4de6-abbd-3789098be9e7","keywords":null,"creator":["Zaahier Adams"],"video_url":null,"description":"Proteas’ stand-in ODI captain Keshav Maharaj says the team are looking forward to working with CSA’s new director of cricket, Enoch Nkwe.","content":null,"pubDate":"2022-07-07 17:25:47","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/cca9ada7-07f9-594a-adbe-20326ff4a9f2&operation=CROP&offset=0x167&resize=4455x2503","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"IND vs ENG Live Cricket Score 1st T20I Latest Updates: Rohit Sharma Departs After Solid Start - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMixAFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvbGl2ZS1jcmlja2V0LXNjb3JlLWluZGlhLXZzLWVuZ2xhbmQtMXN0LXQyMGktbGF0ZXN0LXVwZGF0ZXMtaW5kLXZzLWVuZy1saXZlLXN0cmVhbWluZy1jb3ZlcmFnZS10b2RheS1tYXRjaC1oaWdobGlnaHRzLWZyb20tc291dGhhbXB0b24tbGl2ZW5ld3MtNTUxMTc2My5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs ENG Live Cricket Score 1st T20I Latest Updates: Rohit Sharma Departs After Solid Start  News18England vs India, T20Is: Preview ft. Zaheer Khan  CricbuzzLive update India vs England, 1st T20I: India lose Rohit Sharma - Firstpost  FirstpostGo with Buttler and Suryakumar as your captain and vice-captain  ESPNcricinfoThe England litmus test to India's World Cup readiness | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-07-07 17:23:19","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"England v India live stream and team news: Jos Buttler’s reign as white-ball captain begins with T20 battle against Rohit Sharma’s visitors – start time and talkSPORT coverage","link":"https://talksport.com/sport/cricket/1145522/england-v-india-live-stream-commentary-start-time-team-news-toss-jos-buttler-eoin-morgan-rohit-sharma-cricket/","keywords":["Cricket","Sport","England Cricket","India Cricket","Rohit Sharma","Virat Kohli"],"creator":["Jack Cunningham"],"video_url":null,"description":"Eoin Morgan’s time as England’s white-ball captain is over and Jos Buttler’s reign will begin today against India. Morgan transformed the way England play limited-overs cricket and had huge success, but with his form declining, he has decided to step down. The ECB have appointed Buttler as the new captain, and along with Matt Mott, […]","content":"Eoin Morgan’s time as England’s white-ball captain is over and Jos Buttler’s reign will begin today against India. Morgan transformed the way England play limited-overs cricket and had huge success, but with his form declining, he has decided to step down. Buttler is one of the best short-form batters in the gameGetty The ECB have appointed Buttler as the new captain, and along with Matt Mott, they will look to continue England’s dominance in white-ball cricket. The first test of this new era will be against India. The tourists are led by Rohit Sharma, a man used to playing T20 in the IPL and churning out big scores. The majority of the India squad play regularly in the IPL, so this series should prove to be a real examination for Buttler’s men. Sharma is very experienced as a captain and as a batter Most read in Cricket epic Root and Bairstow smash hundreds as England break records in victory over India awful Officials to investigate allegations of racist abuse at England vs India Test Crazy Broad lands unwanted record by getting smashed for Test cricket's most expensive over decider England vs India LIVE: Edgbaston ready to host rearranged fifth and final Test Goodbye England's most successful ever white-ball captain Morgan reflects on retirement revealed World Cup winner Jason Roy hit with suspended two-match ban with England England v India first T20: Date and start time The first T20 between England and India will take place today, Thursday, July 7. The action at the Rose Bowl is due to get underway at 6pm UK time. England v India first T20: Live stream and TV channel The first T20 will be broadcast on Sky Sports Main Event and Sky Sports Cricket with coverage starting at 5:30pm. The match will also be available on NowTV through a day pass or a monthly subscription. Updates will also be live on talkSPORT throughout the day. To tune in to talkSPORT or talkSPORT 2 through the website, click HERE for the live stream. You can also listen via the talkSPORT app, on DAB digital radio, through your smart speaker and on 1089 or 1053 AM. Morgan’s brilliant reign is over England v India schedule 1st T20I – July 7 – Rose Bowl, Southampton – 6pm  2nd T2I – July 9 – Edgbaston, Birmingham – 2:30pm  3rd T20I – July 10 – Trent Bridge, Nottingham – 2:30pm  1st ODI – July 12 – Kennington Oval, London – 1pm  2nd ODI – July 14 – Lord’s, London – 11am  3rd ODI – July 17 – Emirates Old Trafford, Manchester – 1pm England v India: Team news England have handed a first call-up to Lancashire seamer Richard Gleeson, who has taken 70 wickets in 64 T20 games. There is no Adil Rashid after the ECB gave him permission to miss the T20 and ODI series to make The Hajj pilgrimage to Mecca. This means Matt Parkinson will get the opportunity to cement his place in the side. Young Yorkshire batter Harry Brook has also been included in the squad after scoring 384 runs in the T20 Blast. Meanwhile, India haven’t selected Virat Kohli, Rishbah Pant, Ravindra Jadeja and Jasprit Bumrah because they participated in the Test earlier this week. But they will be back for the second and third T20 but will miss the first one. England: Jason Roy, Jos Buttler(c)(wk), Dawid Malan, Liam Livingstone, Harry Brook, Moeen Ali, Sam Curran, Chris Jordan, Tymal Mills, Matt Parkinson, Reece Topley India: Rohit Sharma(c), Ishan Kishan, Deepak Hooda, Suryakumar Yadav, Hardik Pandya, Dinesh Karthik(wk), Axar Patel, Harshal Patel, Bhuvneshwar Kumar, Arshdeep Singh, Yuzvendra Chahal Toss: India won the toss and chose to bat. There will be no Kohli todayAFP England v India first T20: What has been said? England white-ball captain Buttler: “What has been spoken about in the last few years is about not setting boundaries, pushing the limits and we’ve got a number of players in there who will keep pushing those boundaries. “There is a very healthy competition for places and trying to name a squad is tough. “Being captain will be a good experience for me, learning if there is anything I need to change. “If you’re asking people to be aggressive and not set limitations, it is important how you play yourself. As long I as continue to play in that fashion, hopefully I can inspire others to play in the same vein.” Offers Of The Day Bet365 – Bet £10, Get £50 In Free Bets* – CLAIM HERE Open account offer. Bet £10 & Get £50 in Free Bets for new customers at bet365. Min deposit requirement. Free Bets are paid as Bet Credits and are available for use upon settlement of qualifying bets. Min odds, bet and payment method exclusions apply. Returns exclude Bet Credits stake. Time limits and T&Cs apply 18+ Begambleaware.org SEE MORE FREE BET OFFERS HERE","pubDate":"2022-07-07 16:58:00","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Why Virat Kohli not playing today: Why is Sanju Samson not playing today’s 1st T20I between England and India in Southampton?","link":"https://thesportsrush.com/cricket-news-why-virat-kohli-not-playing-today-why-is-sanju-samson-not-playing-todays-1st-t20i-between-england-and-india-in-southampton/","keywords":["Cricket","England","India","India tour of England 2022","Rohit Sharma","Sanju Samson","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why is Virat Kohli not playing today: India have made three changes to the Playing XI from their last T20I in Ireland. During the first T20I of the ongoing India’s tour of England in Southampton, India captain Rohit Sharma has won the toss and chose to bat in his first match after recovering from COVID-19.… The post Why Virat Kohli not playing today: Why is Sanju Samson not playing today’s 1st T20I between England and India in Southampton? appeared first on The SportsRush.","content":"Why is Virat Kohli not playing today: India have made three changes to the Playing XI from their last T20I in Ireland. During the first T20I of the ongoing India’s tour of England in Southampton, India captain Rohit Sharma has won the toss and chose to bat in his first match after recovering from COVID-19. “We are gonna bat first. Looks like a good pitch, decent ground to play. Good pitch, sun is out, better thing to bat first. Recovered pretty well, had a couple of hits before getting into this game,” Sharma told Sky Sports at the toss. Having led England 14 times in white-ball cricket in the past, captain Jos Buttler considered it to be a “proud day” for he is leading them for the first time as a full-time captain. “Very proud day, captaining your country. Eoin [Morgan] has left the team in a great place The Test team has been fantastic to watch. Hopefully, we can ride that momentum,” Buttler told Sky Sports at the toss. Why is Virat Kohli not playing vs England today? Coming on the back of a 2-0 series victory in Ireland, India have made three changes to their Playing XI. While Sharma has come in for batter Sanju Samson, spinner Yuzvendra Chahal and debutant fast bowler Arshdeep Singh have replaced spinner Ravi Bishnoi and fast bowler Umran Malik in the XI. Sadda @arshdeepsinghh making his DEBUT today! #SherSquad cheer extra for our tonight! #ENGvIND #SaddaPunjab pic.twitter.com/I8H73r91Yv — Punjab Kings (@PunjabKingsIPL) July 7, 2022 In spite of scoring 77 (42) in the last match against Ireland, Samson was expected to be benched upon Sharma’s return. As far as former captain Virat Kohli is concerned, he isn’t playing this match because of not being part of an 18-member squad for the first T20I. Readers must note that Kohli and four other multi-format players will be available for the remaining T20Is. “We know the scheduling, we got to have the understanding, players will be swapped every now and then. You can create your bench strength as well, a lot of opportunities for guys to come out and play,” Sharma added. England, on the other hand, have left out batter Phil Salt and fast bowlers David Willey and Richard Gleeson from their 14-member squad for the first T20I at The Rose Bowl. The post Why Virat Kohli not playing today: Why is Sanju Samson not playing today’s 1st T20I between England and India in Southampton? appeared first on The SportsRush.","pubDate":"2022-07-07 16:57:41","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/england-vs-india-live-score-over-1st-t20i-t20-1-5-updates-3137763","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between England vs India from The Rose Bowl, Southampton. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-07-07 16:54:00","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637928294242350761.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IND Vs ENG, 1ST T20I: India wins toss, opts to bat first","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-eng-1st-t20i-rohit-sharma-wins-the-toss-opts-to-bat-at-southampton-2022-07-07-790441","keywords":null,"creator":null,"video_url":null,"description":"With almost 3 months left for the T20I World Cup which is scheduled to be played in Australia later this year, India's hunt to put a core group in place will continue during the three T20Is that they are scheduled to play against England. With Eoin Morgan bowing out of international cricket, the leadership duties have now been bestowed upon Jos Buttler and it is expected that the hosts will go out all guns blazing. The visitors have to play out of their skin if they want to clinch the series and emerge victorious against this dominant English side.","content":null,"pubDate":"2022-07-07 16:47:14","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"England v India: first T20 cricket international – live!","link":"https://www.theguardian.com/sport/live/2022/jul/07/england-v-india-first-t20-cricket-international-live","keywords":["Cricket","England cricket team","India cricket team","Sport"],"creator":["Tanya Aldred"],"video_url":null,"description":"Updates from Southampton, starting from 6pm BSTAnd you can contact Tanya by email or on TwitterA debut for left-arm medium-fast bowler Arshdeep Singh.No debuts for England, but when there is an abundance of riches, there is plenty to play for. Continue reading...","content":null,"pubDate":"2022-07-07 16:42:51","image_url":"https://i.guim.co.uk/img/media/8bc2f38ba2cca81799ff7460b7f5891ad79e4cd7/0_0_4125_2475/master/4125.jpg?width=460&quality=85&auto=format&fit=max&s=4de62e09ed6103da2c9671e4ca721da8","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"India vs England all T20 match result: IND vs ENG T20Is all result 2022","link":"https://thesportsrush.com/cricket-news-india-vs-england-all-t20-match-result-ind-vs-eng-t20is-all-result-2022/","keywords":["Cricket","England","India","India tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs England all T20 match result: England and India will be playing their 20th T20I against each other tonight. England and India are about the kick-start a three-match T20I series with the first match to be played in Southampton tonight. Having last faced each other in the shortest format last year, these two A-list… The post India vs England all T20 match result: IND vs ENG T20Is all result 2022 appeared first on The SportsRush.","content":"India vs England all T20 match result: England and India will be playing their 20th T20I against each other tonight. England and India are about the kick-start a three-match T20I series with the first match to be played in Southampton tonight. Having last faced each other in the shortest format last year, these two A-list T20I teams will be locking horns after 15 months. In their decade-and-a-half T20I history against each other, England and India have contested 19 times. While England have won 9 matches, India have won on 10 occasions. As far as bilateral series are concerned, this is going to be the eighth one (fourth in England) between England and India. Readers must note that both these teams have won three series each against one another. We’re getting ready for what should be an absolute belter of a T20 here in Southampton. Hope you all get treated to a clinic by all the players here on @SkyCricket 🥂 pic.twitter.com/PdrwAxb8QP — Kevin Pietersen🦏 (@KP24) July 7, 2022 Fourth one to be played on English soil, India would be keen to improve their T20I record against England on away grounds. In six T20Is against England in England, India have emerged as the victorious side only twice. While the first England vs India T20I will mark a new era for the hosts for Jos Buttler has been named as their regular white-ball captain now, India captain Rohit Sharma will also be leading in and against England for the first time on Thursday.","pubDate":"2022-07-07 16:30:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs England live streaming free on which channel: How to watch Sony LIV for free?","link":"https://thesportsrush.com/cricket-news-india-vs-england-live-streaming-free-on-which-channel-how-to-watch-sony-liv-for-free/","keywords":["Cricket","India tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"India vs England live streaming free on which channel: The first of the three-match T20I series would begin shortly at Southampton. Team India under their all-format skipper Rohit Sharma is all set to take on England in the first of the three-match T20I series at The Rose Bowl in Southampton in about half-an-hour from now.… The post India vs England live streaming free on which channel: How to watch Sony LIV for free? appeared first on The SportsRush.","content":"India vs England live streaming free on which channel: The first of the three-match T20I series would begin shortly at Southampton. Team India under their all-format skipper Rohit Sharma is all set to take on England in the first of the three-match T20I series at The Rose Bowl in Southampton in about half-an-hour from now. The playing XI of both the teams would feature from an entirely different squad than the one which were involved in the recently concluded fifth Test match at Edgbaston which witnessed the Ben Stokes-led side chase down their highest-ever target in Test match history. While Rohit returns back as India skipper after admitting to have found it ‘very hard to watch’ the aforementioned Test from the sidelines, wicket-keeper batter Jos Buttler is set to make his debut as England’s full-time limited Overs skipper today. While England would play their tenth T20I at this venue, India would play their first ever T20I at Southampton today. The good news for the Cricket fans in India is that they can watch the live telecast of the first T20I and the entire limited Overs series for free on ‘Doordarshan Sports’. All set for the 1st T20I between #ENGvIND 🏏 All the #Live action on DD Sports 📺 (DD Free Dish) pic.twitter.com/XsrYpn467G — Doordarshan Sports (@ddsportschannel) July 7, 2022 By paying the subscription fee, the television viewers users can watch the matches live on the Sony Sports network, with Sony Six (English commentary), Sony TEN 3 (Hindi commentary), Sony TEN 4 (Tamil and Telugu commentary) as the designated channels for the same. As for the online users in India, they can live stream the series on Sony’s streaming application named Sony LIV, but again at the cost of a nominal subscription fee. The Jio network mobile users or the Jio WiFi/router users in the country, can live stream the match on their mobiles for free via the Jio TV’ app with the match viewing option present on the home page itself.","pubDate":"2022-07-07 16:24:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"UAE T20 League: R Sridhar takes charge as Sharjah franchise’s director of cricket","link":"https://sportstar.thehindu.com/cricket/r-sridhar-cricket-director-sharjah-franchise-uae-t20-league/article38509432.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"The six-team franchise league, scheduled to begin in January next year, has attracted several big brands - including the Glazers family, Reliance, Adani, Knight Riders and GMR.","content":null,"pubDate":"2022-07-07 15:00:21","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Providence Stadium Guyana T20 records: Guyana cricket stadium highest innings total in T20 international","link":"https://thesportsrush.com/cricket-news-providence-stadium-guyana-t20-records-guyana-cricket-stadium-highest-innings-total-in-t20-international/","keywords":["Cricket","Bangladesh","Bangladesh tour of West Indies 2022","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Providence Stadium Guyana T20 records: Providence Stadium will be hosting an international match after just over 11 months. The third T20I of the ongoing Bangladesh’s tour of West Indies will be played in Guyana tonight. Leading the three-match series 1-0, the hosts would be keen to register another victory in a bid to clinch the… The post Providence Stadium Guyana T20 records: Guyana cricket stadium highest innings total in T20 international appeared first on The SportsRush.","content":"Providence Stadium Guyana T20 records: Providence Stadium will be hosting an international match after just over 11 months. The third T20I of the ongoing Bangladesh’s tour of West Indies will be played in Guyana tonight. Leading the three-match series 1-0, the hosts would be keen to register another victory in a bid to clinch the series. Yet to win a match on this tour, Bangladesh have a lot of areas to improve on ahead of a three-match ODI series. Providence Stadium, whose last two international matches had been a couple of washed out T20Is against Pakistan just over 11 months ago, will be hosting its 11th T20I on Thursday. With three out of 10 Guyana T20Is washed out due to rain, chances are that weather might play spoilsport in this match as well. Doesn’t look promising in Guyana for today’s #WIvBAN T20I. https://t.co/ze3mIGruvh — Mohammad Isam (@Isam84) July 7, 2022 Having played just six out of 10 T20Is here, West Indies have won and lost a couple of matches each. Bangladesh, on the other hand, will be playing their first-ever T20I at this venue. That being said, they have won two and lost one out of their three ODIs at the Providence Stadium in the past. Providence Stadium Guyana T20 records Highest T20I run-scorers in Guyana are Mahela Jayawardene (181), Eoin Morgan (100), Nicholas Pooran (79), Kieron Pollard (79) and Rishabh Pant (65). Aaprt from West Indies captain Pooran, vice-captain Rovman Powell (32) is the only other batter among players taking part in this series to have taken part in a Guyana T20I. Highest T20I wicket-takers at the Providence Stadium are Daren Sammy (5), Dwayne Bravo (5), Scott Styris (4), Jason Holder (4) and Nathan McCullum (4). No other bowler in the current West Indian squad has played a T20I here in the past. Highest innings total at Providence Stadium Guyana Score Overs Team Opposition Year 191/5 20 England West Indies 2010 173/7 20 Sri Lanka Zimbabwe 2010 157/8 20 Pakistan West Indies 2021 150/3 19.1 India West Indies 2019 150/4 20 West Indies Pakistan 2021 The post Providence Stadium Guyana T20 records: Guyana cricket stadium highest innings total in T20 international appeared first on The SportsRush.","pubDate":"2022-07-07 14:51:15","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly's 50th birthday, Sachin Tendulkar and Jay Shah join in celebrations","link":"https://www.indiatvnews.com/sports/cricket/sourav-ganguly-s-50th-birthday-sachin-tendulkar-and-jay-shah-join-in-celebrations-2022-07-07-790413","keywords":null,"creator":null,"video_url":null,"description":"The month of July is extremely special when it comes to Indian cricket and the number of Test players and captains they have produced for the national side. MS Dhoni celebrates his birthday on 7th July, the little master Sunil Gavaskar celebrates his birthday on 10th July, and the former India captain, the God of off-side, and the current BCCI president Sourav Ganguly celebrates his birthday on July 8.","content":null,"pubDate":"2022-07-07 14:42:46","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"}]}