{"newsArray":[{"title":"IPL 2023: Trevor Bayliss appointed head coach of Punjab Kings","link":"https://www.indiatvnews.com/sports/cricket/ipl-2023-trevor-bayliss-appointed-head-coach-of-punjab-kings-anil-kumble-2022-09-16-808808","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: Trevor Bayliss has been appointed as the head coach of Punjab Kings. This devlopment comes in after Anil Kumble was ousted by the franchise after their dismal show in previous two seasons of the Indian Premier League. Bayliss is an Australian cricket coach and former first class cricketer. He played for New South Wales between 1985 and 1997 before becoming a coach.","content":null,"pubDate":"2022-09-16 07:57:29","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Eden Gardens pitch report: Eden Garden Stadium Kolkata pitch report India Majarajas vs World Giants Legends League Cricket match","link":"https://thesportsrush.com/cricket-news-eden-gardens-pitch-report-eden-garden-stadium-kolkata-pitch-report-india-majarajas-vs-world-giants-legends-league-cricket-match/","keywords":["Cricket","Eden Gardens","Legends League Cricket"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Eden Gardens pitch report: The SportsRush brings you the pitch report of the India Majarajas vs World Giants Legends match. India Maharajas will take on World Giants in the opening game of the Legends League Cricket 2022 at the Eden Gardens in Kolkata. This is a brand new league where some of the biggest names… The post Eden Gardens pitch report: Eden Garden Stadium Kolkata pitch report India Majarajas vs World Giants Legends League Cricket match appeared first on The SportsRush.","content":"Eden Gardens pitch report: The SportsRush brings you the pitch report of the India Majarajas vs World Giants Legends match. India Maharajas will take on World Giants in the opening game of the Legends League Cricket 2022 at the Eden Gardens in Kolkata. This is a brand new league where some of the biggest names in cricket will make their presence known. Virender Sehwag will be leading the India Maharajas, and he will have the company of players like Parthiv Patel, Irfan Pathan, Harbhajan Singh, etc. World Giants, on the other hand, will be led by World Cup-winning captain Eoin Morgan, and there are some huge names in this team as well. Eden Gardens pitch report The pitch at the Eden Gardens in Kolkata is one of those tracks in India where the batters always love batting on. Earlier, this pitch used to be a slower one where the spinners dominated, but everything changed after the revamp. A fresh wicket is expected at the venue for this game where there will be an amount of bounce. ALSO READ: Full squads of Legends League Cricket 2022 It has been seen that there is grass on the Eden Gardens’ wicket, so the pacers will definitely enjoy bowling here in the initial overs, and they can move the new ball as well. As the match will progress, the pitch will go easy on the batters, and they will be able to play their shots trusting the wicket. #LLCT20 starting today. Are you ready! @llct20 #llct20 #BossLogonKaGame #LegendsLeagueCricket — parthiv patel (@parthiv9) September 16, 2022 The boundaries of this stadium are very small, and the outfield is lightning quick as well. The presence of practice wickets near one of the boundaries makes the job of the fielders much tougher. Once placed in the gap, it is almost possible for the fielders to stop the ball from reaching the boundary. Eden Gardens hosted a couple of IPL 2022 playoffs earlier this year, where the 1st innings average score was 198 runs, which proves that this ground is a batting beauty. The dew generally plays a big part in Kolkata and both captains would look to chase after winning the toss. The post Eden Gardens pitch report: Eden Garden Stadium Kolkata pitch report India Majarajas vs World Giants Legends League Cricket match appeared first on The SportsRush.","pubDate":"2022-09-16 07:50:43","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket 2022 All Team Squad and Player List: India Maharaja squad 2022","link":"https://thesportsrush.com/cricket-news-legends-league-cricket-2022-all-team-squad-and-player-list-india-maharaja-squad-2022/","keywords":["Cricket","Legends League Cricket","Legends League Cricket squads"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Legends League Cricket 2022 All Team Squad: The SportsRush present before you full squads of teams taking part in Legends League Cricket 2022. Legends League Cricket 2022, the second season of a tournament which began last year, will kick-start in Kolkata tonight. The first match of the tournament will be an exhibition contest between two… The post Legends League Cricket 2022 All Team Squad and Player List: India Maharaja squad 2022 appeared first on The SportsRush.","content":"Legends League Cricket 2022 All Team Squad: The SportsRush present before you full squads of teams taking part in Legends League Cricket 2022. Legends League Cricket 2022, the second season of a tournament which began last year, will kick-start in Kolkata tonight. The first match of the tournament will be an exhibition contest between two teams named India Maharajas and World Giants comprising of shortlisted players from all the four teams. For the unversed, teams have been increased from three to four for this season. The development has come on the back of an overall restructuring with respect to the teams. Contrary to the first season, three region-wise teams (India Maharajas, Asia Lions and World Giants) have been converted into four franchises (India Capitals, Gujarat Giants, Manipal Tigers and Bhilwara Kings) bought by private business entities. The squads have been formed in such a way that former Kolkata Knight Riders pair Gautam Gambhir and Jacques Kallis could be seen batting together for Capitals. Similarly, Virender Sehwag and Chris Gayle could be witnessed opening the batting together for Giants. Bhilwara Kings stars Pathan brothers as a part of their squad. That sound off the bat. 😍 Legend @virendersehwag on display in the nets. 🔥 #GarjegaGujarat #LLCT20 #BossLogonKaGame #LegendsLeagueCricket #Adani @llct20 @AdaniSportsline pic.twitter.com/ZzviEVxUGQ — Gujarat Giants (@GujaratGiants) September 15, 2022 As far as the venues are concerned, the whole of Legends League Cricket 2021 had been played in Oman. LLC 2022, however, will be played entirely in India (six different cities). Gautam Gambhir (c), Ravi Bopara, Pravin Tambe, Denesh Ramdin, Ashgar Afghan, Mitchell Johnson, Liam Plunkett, Rajat Bhatia, Hamilton Masakazda, John Mooney, Prosper Utseya, Ross Taylor, Jacques Kallis, Farveez Maharoof, Pankaj Singh. Virender Sehwag (c), Chris Gayle, Parthiv Patel, Ajantha Mendis, Manvinder Bisla, Lendl Simmons, Mitchell McClenaghan, Stuart Binny, Kevin O’Brien, Daniel Vettori, Ashoke Dinda, Joginder Sharma, Graeme Swann, Richard Levi, Chris Tremlett, Elton Chigumbura. Harbhajan Singh (c), Brett Lee, Muttiah Muralitharan, Phil Mustard, Mohammad Kaif, Ryan Sidebottom, Lance Klusener, Dmitri Mascarenhas, Romesh Kaluwithrana, Reetinder Sodhi, Parvinder Awana, VRV Singh. Irfan Pathan (c), Yusuf Pathan, Monty Panesar, Naman Ojha, William Porterfield, Shane Watson, Samit Patel, Fidel Edwards, Matt Prior, Nick Compton, S Sreesanth, Tim Bresnan, Owais Shah, Tino Best, Sudeep Tyagi. The original LLC 2022 squads had encompassed of former India captain and current BCCI (Board of Control for Cricket in India) President Sourav Ganguly leading India Maharajas but that won’t be the case on Friday as Ganguly has pulled out of the tournament citing personal reasons. Later, it was also known that World Giants would be led by former South Africa all-rounder Jacques Kallis in place of former England captain Eoin Morgan. India Maharajas 2022 Virender Sehwag (c), Mohammad Kaif, Yusuf Pathan, S Badrinath, Irfan Pathan, Parthiv Patel, Stuart Binny, S Sreesanth, Harbhajan Singh, Naman Ojha, Ashoke Dinda, Pragyan Ojha, Ajay Jadeja, RP Singh, Joginder Sharma. World Giants 2022 Eoin Morgan, Lendl Simmons, Herschelle Gibbs, Jacques Kallis (c), Sanath Jayasuriya, Matt Prior, Nathan McCullum, Jonty Rhodes, Muttiah Muralitharan, Dale Steyn, Hamilton Masakadza, Mashrafe Mortaza, Asghar Afghan, Mitchell Johnson, Brett Lee, Kevin O’Brien, Denesh Ramdin.","pubDate":"2022-09-16 07:27:48","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Boucher set to coach Mumbai Indians in IPL","link":"https://www.perthnow.com.au/sport/cricket/boucher-set-to-coach-mumbai-indians-in-ipl-c-8262288","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Mark Boucher will step down from his role with South Africa cricket after the Twenty20 World Cup to coach Indian Premier League side Mumbai Indians.","content":"Mark Boucher will become Mumbai Indians head coach from the 2023 season of the Indian Premier League, with the 45-year-old stepping down from the same role at South Africa after the Twenty20 World Cup. Cricket South Africa said on Monday that Boucher will leave his post after the October 16-November 13 World Cup in Australia to pursue \"other opportunities\". Former wicketkeeper Boucher took over at South Africa in 2019 and led them to 11 Test wins, 12 victories in one-day internationals and 23 in T20 matches. Boucher said it was an \"honour and privilege\" to be appointed head coach of Mumbai Indians. \"Their history and achievements as a franchise clearly put them up there as one of the most successful sporting franchises in all of world sport,\" he said. \"I look forward to the challenge and respect the need for results. It's a strong unit with great leadership and players. I look forward to adding value to this dynamic unit.\" Boucher's appointment comes after Mahela Jayawardene stepped down as head coach to take on a bigger role at the franchise due to its increasing international presence. Former India fast bowler Zaheer has been elevated to global head of cricket development from his previous position as director of cricket operations. Led by India captain Rohit Sharma, Mumbai are one of the most successful teams in the IPL, winning the tournament five times, but they had a disappointing 2022 season where they finished bottom of the table.","pubDate":"2022-09-16 07:19:13","image_url":"https://images.perthnow.com.au/publication/C-8262288/9817661c0515352380c1cb6c1110c1f320250afc-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"IRE-XI vs SPA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for European Cricket Championship 2022, Qualifier 1","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ire-xi-vs-spa-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-european-cricket-championship-2022-qualifier-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-16 07:18:44","image_url":"https://static.sportskeeda.com/editor/2022/09/9fdea-16633080535675-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"INM vs WOG Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for Legends League 2022, Exhibition Match","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/inm-vs-wog-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-legends-league-2022-exhibition-match?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-16 07:18:44","image_url":"https://static.sportskeeda.com/editor/2022/09/aa1c0-16633099748344-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"KHP vs SOP Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for National T20 Cup 2022, Match 28","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/khp-vs-sop-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-national-t20-cup-2022-match-28?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-16 07:18:44","image_url":"https://static.sportskeeda.com/editor/2022/09/563cc-16633080299422-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Head coach of Mumbai Indians new: Mark Boucher stats coaching career and list of teams coached","link":"https://thesportsrush.com/cricket-news-head-coach-of-mumbai-indians-new/","keywords":["Cricket","IPL","Mark Boucher","Mumbai Indians"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Head coach of Mumbai Indians new: Mumbai Indians have named new their head coach for the upcoming IPL season. Mumbai Indians is the most successful IPL franchise, and they are set to have a brand new coaching staff for the upcoming season after elevating Mahela Jayawardene and Zaheer Khan to the global roles. Along with… The post Head coach of Mumbai Indians new: Mark Boucher stats coaching career and list of teams coached appeared first on The SportsRush.","content":"Head coach of Mumbai Indians new: Mumbai Indians have named new their head coach for the upcoming IPL season. Mumbai Indians is the most successful IPL franchise, and they are set to have a brand new coaching staff for the upcoming season after elevating Mahela Jayawardene and Zaheer Khan to the global roles . Along with the IPL, the MI franchise will be seen in ILT20 League and South Africa T20 Leagues as well, and Jayawardene and Zaheer will take care of all of them. Ahead of the IPL 2023, Mumbai Indians have finally revealed their new head coach, who will be replacing Mahela Jayawardene. Jayawardene has been with the Mumbai Indians for six seasons, and they have won the title in three of them. He is the 2nd most successful coach in IPL history. Mumbai Indians have appointed former South Africa wicket-keeper Mark Boucher as their new head coach. Boucher is currently the head coach of South Africa’s national team, but he as announced that he will leave the position after the ICC T20 World Cup in Australia. Boucher has expressed his delight on becoming the new head coach of the franchise. He has called it a privilege and honour to be the head coach of one of the most successful franchises in world cricket. “It is an honor and privilege to be appointed as Head Coach of MI. Their history and achievements as a franchise clearly put them up there as one of the most successful sporting franchises in all of world sport,” Mark Boucher said in the official statement. “I look forward to the challenge and respect the need for results. It’s a strong unit with great leadership and players. I look forward to adding value to this dynamic unit.” Presenting आपले नवीन Head Coach – Paltan, drop a to welcome the legend to our #OneFamily #DilKholKe #MumbaiIndians @markb46 @OfficialCSA pic.twitter.com/S6zarGJmNM — Mumbai Indians (@mipaltan) September 16, 2022 Boucher, who is the current coach of South Africa’s national team has coached South Africa’s domestic side Titans in the past, and he led them to 5 domestic titles. He also worked as the wicket-keeping coach of Kolkata Knight Riders in IPL 2016. He has registered 11 Test, 12 in ODI and 23 T20I wins with South Africa so far.","pubDate":"2022-09-16 07:17:16","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Tickets for Ind vs SA T20 Encounter in Barsapara Goes Live","link":"https://www.sentinelassam.com/sports/cricket/tickets-for-ind-vs-sa-t20-encounter-in-barsapara-goes-live-613225","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Tickets for the much-awaited match are live on the Bookmyshow app; the prices start from 475 and go up to Rs 6000","content":"GUWAHATI: Cricket is not just a sport in India, it is an emotion that binds each and every Indian together. The cricket fans in Assam went home with a heavy heart after rain played spoilsport two years ago in Barsapara when India was to take on Sri Lanka in a T20 encounter on January 5, 2020. This time, the fans in Assam waited with bated breath for the tickets to go on sale after the announcement of an India versus South Africa T20 match in Barsapara Stadium in Guwahati, slated for October 2. South Africa Cricket team will arrive in India for a Bilateral series of three T20 matches between India and South Africa. The first T20 match between the two cricket giants will start on 28th September where both the teams will fight it out in Greenfield International Stadium in Thiruvananthapuram, Kerala. The Second T20 between both the teams for which lakhs of cricket fans in Assam and especially in Guwahati are waiting will be played on 2nd October in Barsapara Stadium in Guwahati. Barsapara Stadium which is also known as Bhupen Hazarika International Cricket Stadium has hosted only five international matches with one being washed out until now and the encounter on 2nd October between India and South Africa will be its 6th International match. The Ticket Prices for the much-awaited match are live now and the prices start from Rs 475 and go up to Rs 6000. The ticket sales will be conducted in two different sessions, one on 16th September where 15000 tickets will be made live for sale and the other on 26th September where another 5000 tickets will be up for grabs. The list of ticket prices is given below: Starting at 11 a.m., spectators can purchase tickets online at Bookmyshow.com or the Bookmyshow app, said Debojit Saikia in a press conference held in Gu wahati. Notably, Barsapara Stadium has a capacity to accommodate 45000 spectators. Also Read: Assam CM reviews preparation for India-South Africa T-20 Match in Guwahati Also Watch:","pubDate":"2022-09-16 06:57:08","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/16/388966-ind-vs-sa-1111.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Mark Boucher named head coach of Mumbai Indians","link":"https://www.tribuneindia.com/news/sports/mark-boucher-named-head-coach-of-mumbai-indians-432342","keywords":null,"creator":null,"video_url":null,"description":"Mumbai, September 16 Former South Africa wicketkeeper-batter Mark Boucher has been appointed Mumbai Indians' head coach for the upcoming IPL season, the franchise announced on Friday. The 45-year-old replaces former Sri Lanka skipper Mahela Jayawardene, who has been elevated to the role of global head of performance by the franchise. Boucher, who is currently the head coach of the South Africa men's national team, had earlier this week announced he will be stepping down from the role after the upcoming T20 World Cup. \"It is an honour and privilege to be appointed as Head Coach of MI. Their history and achievements as a franchise clearly put them up there as one of the most successful sporting franchises in all of world sport,\" Boucher said in a media release. \"I look forward to the challenge and respect the need for results. It's a strong unit with great leadership and players. I look forward to adding value to this dynamic unit,\" he added. Boucher has had a long and illustrious career and holds the record for the most Test dismissals by a wicketkeeper. Post-retirement he took over as coach for Titans, a top-level cricket franchise in South Africa, and led them to five domestic titles. In 2019, he was appointed the head coach of South Africa where he crafted 11 Test wins, 12 in ODIs and 23 T20I victories. \"It's a pleasure to welcome Mark Boucher to Mumbai Indians. With his proven expertise on the field and off it as a coach guiding his team to numerous victories, Mark will add immense value to MI and take forward its legacy,\" Chairman of Reliance Jio Infocomm Akash Ambani said.","content":null,"pubDate":"2022-09-16 06:39:28","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1189795095.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India Bowled Out For 293 Despite Gaikwad's Ton","link":"https://www.sentinelassam.com/sports-news/india-bowled-out-for-293-despite-gaikwads-ton-613191","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Gaikwad picked the lengths early, and played all the shots in the book to record his fifth First-Class century.","content":"BENGALURU: Ruturaj Gaikwad (108, 127b, 12x4, 2x6) held firm even as India 'A' turned in a disappointing show on the first day of its third unofficial 'Test' against New Zealand 'A' here on Thursday. On a M. Chinnaswamy Stadium pitch which held no demons, India 'A' was dismissed for 293. Gaikwad, who had low scores of 21 and 5 in this series, turned the corner with a classy knock. He picked the lengths early, and played all the shots in the book to record his fifth First-Class century. He found able support in Upendra Yadav, who made a 134-ball 76. Gaikwad and Upendra put on 134 runs for the fifth wicket. Loose strokes cost the wickets of Rajat Patidar (30) and Abhimanyu Easwaran (38). Sarfaraz Khan fell for a duck, fending awkward at a rising delivery from pacer Matthew Fisher. Gaikwad, who has made his name as a white-ball batter, spoke about adapting to the long format. \"I feel I was a little rushed in the first two matches, as I was playing red ball cricket after a long time. Mentally and technically, I was not up to the mark in the first two matches. The mindset in this match was to stay at the wicket. I knew that their spinners were not up to the mark, in comparison to our spinners, so the runs would flow,\" Gaikwad said. Agencies Also Read: Bengaluru FC Reach Durand Cup Final Also Watch:","pubDate":"2022-09-16 05:39:51","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/16/388874-ruturaj.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Instagram star, who beat LeBron James to 200M followers, is a closet Michael Jordan fan","link":"https://thesportsrush.com/nba-news-instagram-star-who-beat-lebron-james-to-200-m-followers-is-a-closet-michael-jordan-fan/","keywords":["Basketball","Michael Jordan","NBA","Virat Kohli"],"creator":["Akash Murty"],"video_url":null,"description":"If you are still wondering who is better amongst Michael Jordan and his Bulls or the 2017 Warriors, there’s a super famous international athlete who can help you out. Not quite like the time of the release of The Last Dance, but there’s been a lot of talk about the Chicago Bulls of the 90s… The post Instagram star, who beat LeBron James to 200M followers, is a closet Michael Jordan fan appeared first on The SportsRush.","content":"If you are still wondering who is better amongst Michael Jordan and his Bulls or the 2017 Warriors, there’s a super famous international athlete who can help you out. Not quite like the time of the release of The Last Dance , but there’s been a lot of talk about the Chicago Bulls of the 90s since Stephen Curry ’s Warriors won last year’s NBA championship. Draymond Green thinks the 2017 Warriors would beat the 1998 (or 1996) Chicago Bulls 👀 Do you agree or disagree? 🤔 🏀: https://t.co/6OlD54NbNJ pic.twitter.com/GUBJeyBt7E — Sports Illustrated (@SInow) July 26, 2022 Dubs forward, Draymond Green , came forward and blatantly claimed that their team would beat Michael Jordan and Co. pretty easily and none of his teammates tried humbling him down apart from Andre Iguodala. Almost every big-name reporter and analyst, since then, has clarified it for the 2022 champs that they or any other team for that matter will not have it easy against those Bulls. Also read: Billionaire Michael Jordan surpasses Diego Maradona with ‘Last Dance’ jersey selling for whopping $10.1 million And now, there’s an Indian athlete, arguably the biggest name in the country who has come forward as a 90s Bulls supporter. Cricket fans, around the world, are quite familiar with the name Virat Kohli. The active legendary batsman of the biggest cricket-playing nation might have accomplished countless things on the cricket ground over the last 13 or so years, but it seems he finds time to follow other sports as well, be it football or basketball. Although, he didn’t speak on the subject of Warriors and Bulls he recently updated a picture that can see him wearing a Chicago Bulls cap with a caption , “90s Bulls anyone?” Morning selfie by Virat Kohli. pic.twitter.com/lGzaTCM9HV — Johns. (@CricCrazyJohns) September 16, 2022 The 33-year-old cricketer has a higher number of Instagram followers than LeBron James, who has the highest following among athletes in the United States. In fact, Kohli has the highest following in all of Asia. Also read: Michael Jordan, who earned $500,00+ in 1984, was forced to join the NBA by his head coach Basketball still not being as huge a sport in most of the Asian countries besides China is one of the NBA’s biggest marketing concerns. They have made a lot of progress in the last couple of years, though. And getting one of the greatest Cricketers of all time involved in basketball will surely boost the cause and help them bring in more eyeballs to the sport than ever before.","pubDate":"2022-09-16 05:36:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Huge Victory For Sibsagar In JK Baruah Cricket","link":"https://www.sentinelassam.com/sports-news/huge-victory-for-sibsagar-in-jk-baruah-cricket-613186","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Sibsagar registered huge one innings and 233 runs victory against Majuli in the JK Baruah Cricket at the Nehru Stadium","content":"Sports Reporter GUWAHATI: Sibsagar registered huge one innings and 233 runs victory against Majuli in the JK Baruah Cricket at the Nehru Stadium here today. Nibir Bezbaruah of Sibsagar played a well composed knock of 150 runs. In the other game at Amingaon, Bongaigaon defeated Titabor by 4 wickets. Palla Karunakar (8-12) of Bongaigaon bowled a magnificent spell in the 2nd innings. Brief scores: Nehru Stadium- Majuli first innings 102, Sibsagar 1st innings 388-9 (dec), Nibir Bezbaruah 150, Rahul Tamuli 63, Bibhuti Sharma 4-114, Majuli 2nd innings 53, Bibhuti Sharma 23, Bhuban Chetry 6-17. Amingaon- Titabor 1st innings 120, Bongaigaon 1st innings 112, Titabor 2nd innings 45, Palla Karunakar 8-12, Bongaigaon 2nd innings 54-6, Biswajit Sahu 3-28. Also Read: 'A' Division Match Ends In Draw In Football League 2022-23 Also Watch:","pubDate":"2022-09-16 05:30:17","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/16/388860-istockphoto-1314006834-170667a.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"New Zealand's THIS all-rounder follows Trent Boult's footsteps, denies central contract","link":"https://www.indiatvnews.com/sports/cricket/new-zealand-s-this-all-rounder-follows-trent-boult-s-footsteps-denies-central-contract-jimmy-neesham-2022-09-16-808755","keywords":null,"creator":null,"video_url":null,"description":"Just before the start of the T20 World Cup and the advent of major T20 leagues around the globe, cricketers have started to prioritize the league-based format as compared to their international commitments. With Ben Stokes retiring from ODI cricket earlier this year and New Zealand's Trent Boult declining the central contract, the future of cricket seems to be entering unknown territory. After the success of BBL, PSL, and IPL, now Dubai and South Africa too have announced their leagues that are bound to make the international cricket schedule busier.","content":"Just before the start of the T20 World Cup and the advent of major T20 leagues around the globe, cricketers have started to prioritize the league-based format as compared to their international commitments. With Ben Stokes retiring from ODI cricket earlier this year and New Zealand's declining the central contract, the future of cricket seems to be entering unknown territory. After the success of BBL, PSL, and , now Dubai and South Africa too have announced their leagues that are bound to make the international cricket schedule busier. Following the ongoing trend of opting out of a grueling international schedule, New Zealand's all-rounder Jimmy Neesham has opted out of New Zealand's central contract and is now a free agent. The left-handed batsman has been a crucial part of the Blackcaps and provides a desirable balance to the team. Earlier, speedster Trent Boult had opted out of the central contract to shift his attention towards franchise-based cricket and said that it always has been a matter of great pride to him to play for the Kiwis. The Kiwis are yet to announce their national squad for this year's T20I World Cup and it will be interesting to see if the all-rounder makes it to the squad that will compete in the T20I World Cup that is to be played in Australia in October.","pubDate":"2022-09-16 05:15:18","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan Cricket Board refutes Shahid Afridi's claim of Shaheen bearing cost of his treatment in London","link":"https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-refutes-shahid-afridi-s-claim-of-shaheen-bearing-cost-of-his-treatment-in-london-2000871-2022-09-16?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"PCB refutes Shahid Afridi's claim of Shaheen bearing cost of his treatment in London","content":null,"pubDate":"2022-09-16 05:05:42","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"“I choose to see Mitch Santner’s stupid face everyday”: Jimmy Neesham commits to New Zealand Cricket despite declining central contract","link":"https://thesportsrush.com/cricket-news-i-choose-to-see-mitch-santners-stupid-face-everyday-jimmy-neesham-commits-to-new-zealand-cricket-despite-declining-central-contract/","keywords":["Cricket","Jimmy Neesham"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Kiwi all-rounder Jimmy Neesham has denied the New Zealand central contract in order to play in T20 Leagues around the world. New Zealand cricket is going through a phase where the players are declining the central contracts to play in the T20 Leagues around the world. Trent Boult surprised everyone by declining the central contract… The post “I choose to see Mitch Santner’s stupid face everyday”: Jimmy Neesham commits to New Zealand Cricket despite declining central contract appeared first on The SportsRush.","content":"Kiwi all-rounder Jimmy Neesham has denied the New Zealand central contract in order to play in T20 Leagues around the world. New Zealand cricket is going through a phase where the players are declining the central contracts to play in the T20 Leagues around the world. Trent Boult surprised everyone by declining the central contract to play in the T20 Leagues, and then Colin de Grandhomme also announced his retirement. The Blackcaps announced that Finn Allen and Blair Tickner will replace Trent Boult and Colin de Grandhomme on the central contract list. They also particularly mentioned that the contract was given to all-rounder Jimmy Neesham as well, but he declined the offer. The all-rounder has given his clarification regarding the same. Recently, the Blackcaps announced equal play for both male and female players. In the 2022-23 contracts, the players will get $8,495 for test matches, $3,682 for ODIs and $2,407 for T20Is. Neesham had a central contract of $350,000 last year, where Kane Williamson and Ross Taylor were the highest earners with $400,000. Jimmy Neesham has explained the reason behind declining the central contract offered to him by the Blackcaps. He said that he agreed to sign the contract in July, but he was left out of it. In the due course, he made commitments to the other T20 leagues around the world, and he has decided to honour that commitment. Neesham has cleared that he will be representing New Zealand for the foreseeable future, and he will be playing in the upcoming T20 World Cup as well for New Zealand. “I know the news of my decision to decline a central contract today will be seen as me choosing money over representing my country,” Jimmy Neesham posted in his Instagram story. “I had planned to accept a contract offer in July, however since being left off the list I have committed to other leagues around the world. It was a difficult decision but I have decided to honour those commitments.” “Playing for the @blackcapsnz has been the greatest honour of my career and I remain committed to taking the field with my countrymen for the foreseeable future, especially in pinnacle world events.” “Even though it means I choose to see Mitchell Santner’s stupid face every day.” Jimmy Neesham on turning down an NZC contract pic.twitter.com/I1v6LOQnMn — Guy Heveldt (@GuyHeveldt) September 16, 2022 Neesham has given his name in the auction of the South Africa T20 League, and he will play the tournament in January-February 2023.","pubDate":"2022-09-16 04:48:02","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Tickets For India - South Africa T20I On Sale From Today","link":"https://www.sentinelassam.com/sports-news/tickets-for-india-south-africa-t20i-on-sale-from-today-613163","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"In the first phase 15,000 tickets will be sold through BookMyShow tomorrow from 11 AM, The sale of tickets for the second and final phase will begin on September 26","content":"Sports Reporter GUWAHATI: The tickets for the forthcoming T20I between India and South Africa in Guwahati will go on sale online from tomorrow. The tickets will be available in BookMyShow portal. Addressing the media at the ACA premises today the president of the Assam Cricket Association Romen Dutta said, \"Altogether 20,489 tickets will go on sale for the crowd and it will be done in two phases. In the first phase 15,000 tickets will be sold through BookMyShow which will begin tomorrow from 11 AM. The sale of tickets for the second and final phase will begin on September 26.\" The hard copy of the tickets will be available from September 25 in a special counter which ACA will open at the Nehru Stadium. It may be mentioned here that the capacity of the ACA Stadium , Barsapara is around 37,000. Dutta added: Remaining tickets will go to the different district units of ACA, affiliated units of the BCCI and others. This time the minimum price of the ticket is Rs 1,500 and the highest one will cost Rs 6,000. The prices of other tickets are Rs 475 (student), Rs 2,000, Rs 3,000, Rs 3,500 and Rs 4,000. The media briefing was also attended by the secretary of the Assam Cricket Association Devajit Saikia. Commenting on the preparation of the match, Saikia said, \"Preparation is at the final stage. Adequate arrangements have been made so that the crowd and the players of the participating teams don't face any trouble on the match day. We are even trying to arrange more parking places and waiting for the necessary permission from the concerned department.\" He also said, \"Both the teams are likely to arrive in the city on September 29 to play the match.\" Meanwhile, ACA has selected its squad for the forthcoming Syed Mushtaq Ali Cricket Championship which will be held at Rajkot from October 11. Mrinmoy Dutta was named captain of the team. Before participating in the Mushtaq Ali Cricket Championship Assam team will play several warm up matches against Odisha and Meghalaya. Commenting on the preparatory matches of the Assam team Saikia said, \"State squad will tour Odisha and will play four warm up matches on September 19, 20, 22 and 23. Later the team will return to Guwahati and will play three more games against Meghalaya on October 4, 5 and 7 before their departure to Rajkot.\" Also Read: Umpire Rauf Dies Of Cardiac Arrest at Age 66 Also Watch:","pubDate":"2022-09-16 04:38:44","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/16/388804-whatsapp-image-2022-05-31-at-22437-pm.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Rachael Haynes Retires From International Cricket","link":"https://www.sentinelassam.com/sports-news/rachael-haynes-retires-from-international-cricket-613161","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Haynes confirmed she has also played her last domestic match for New South Wales, while WBBL 08 will be her last for the Sydney Thunder","content":"SYDNEY: Australia vice-captain Rachael Haynes has announced her retirement from international cricket, making it clear that the upcoming eighth edition of the Women's Big Bash League will be her last outing. Haynes confirmed she has also played her last domestic match for New South Wales, while WBBL 08 will be her last for the Sydney Thunder. \"Not only one of the greatest players of her generation, @RachaelHaynes has been an outstanding contributor to the culture of our team. Congrats on an incredible career, Rach. We'll miss you,\" said the official handle of the Australian Women's Cricket Team. In a career spanning more than a decade, Haynes played 84 Twenty20 Internationals, 77 One-Day Internationals and six Tests. A top-order batter, Haynes scored nearly 3,818 international runs across all three formats, including 98 on her Test debut against England in 2009, two ODI centuries and 19 half-centuries. The left-hander also claimed 13 wickets and is also a good fielder. Haynes first captained Australia during her second stint in the side, leading the team at the 2017 ICC Women's World Cup with Meg Lanning battling a shoulder issue, said a report in cricket.com.au. In 2018 Haynes was named Australian vice-captain, playing pivotal roles in Australia 's ICC Women's T20 World Cup victories in 2018 an 2020, Women's World Cup win in 2022 and historic Commonwealth Games gold medal run in July, the report added. Haynes thanked all those who played a role in her success as a cricketer. \"Playing at this level isn't possible without the support of many people. From clubs, states, coaches, family and friends, I'm so grateful to those who helped me along the way. In particular, I want to thank my parents Ian and Jenni, and partner Leah for their unwavering support,\" Haynes said after announcing her decision. \"To all the teammates across my career, you are the reason I've played as long as I have. You've inspired me to be better every day. I've learnt something from all of you, on and off the field. You've challenged me as a player, helped me grow as a person and most importantly, made cricket fun,\" she said. IANS Also Read: Umpire Rauf Dies Of Cardiac Arrest at Age 66 Also Watch:","pubDate":"2022-09-16 04:33:45","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/16/388801-newproject-2022-09-15t122358640-sixteennine.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Umpire Rauf Dies Of Cardiac Arrest at Age 66","link":"https://www.sentinelassam.com/sports-news/umpire-rauf-dies-of-cardiac-arrest-at-age-66-613159","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Asad Rauf, who umpired his first ODI in 2000 and his first Test in 2005, was in 2006, named in ICC's Elite Panel.","content":"LAHORE: Asad Rauf, the former Pakistan umpire who was part of the ICC Elite List for many years, has died after suffering a cardiac arrest, Pakistan Cricket Board (PCB) chief Ramiz Raja confirmed this in a tweet on Thursday. \"Saddened to hear about the passing of Asad Rauf. Not only was he a good umpire but also had a wicked sense of humour. He always put a smile on my face and will continue to do so whenever I think about him. Many sympathies with his family for their loss,\" Ramiz Raja tweeted. Rauf, who umpired his first ODI in 2000 and his first Test in 2005, was in 2006, named in ICC's Elite Panel. He was a part of the Elite Panel till 2013 and officiated 64 Tests, 139 ODIs, 28 T20Is and 11 women's T20Is as either umpire or TV umpire. He also officiated in 40 First Class matches, 26 List A matches and 89 T20s overall, including IPL matches. Rauf had to quit umpiring after being accused of involvement in match-fixing and spot-fixing in 2016. Former Pakistan wicketkeeper Kamran Akmal also expressed his condolences to Rauf's family. \"Sad to know about the news of former ICC umpire Asad Rauf's demise...May Allah grant him magfirat and give his family sabr. Ameen,\" Akmal said in a tweet. Before taking up umpiring, Rauf had a successful domestic career as a middle-order batter. He played 71 First-Class matches, scoring 3423 runs, and appeared in 40 List A matches in which he scored 611 runs. IANS Also Read: Kiplimo To Take Part In Delhi Half Marathon Also Watch:","pubDate":"2022-09-16 04:30:02","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/16/388797-5bfn62voasad-rauf-twitter625x30015september22.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan Name Squad For T20 World Cup, Shaheen Returns; Fakhar Misses Out","link":"https://www.sentinelassam.com/sports-news/pakistan-name-squad-for-t20-world-cup-shaheen-returns-fakhar-misses-out-613157","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Afridi had missed the Asia Cup after being advised a 4-6 weeks rest by the medical team following an injury to the right knee ligament","content":"LAHORE: Pakistan on Thursday named their 15-member squad for the ICC Men's T20 World Cup 2022 in Australia, with pacer Shaheen Shah Afridi set to return from his injury. Afridi had missed the Asia Cup after being advised a 4-6 weeks rest by the medical team following an injury to the right knee ligament. He had copped an injury while fielding during the first Test against Sri Lanka in Galle in July. \"Shaheen, who is undergoing rehabilitation for a knee injury in London and expected to resume bowling early next month,\" the Pakistan Cricket Board (PCB) said in a statement. The squad also featured left-hander Shan Masood, who is yet to play in a T20I, while Haider Ali was recalled to the side after last featuring in the format in December 2021. Masood has been called up to play T20Is for the first time on the back of a good run of form in the T20 Blast in England. He has played for Pakistan in Tests and ODIs, last representing them in the longest format in 2021. T20 World Cup squad: Babar Azam (c), Shadab Khan (vc), Asif Ali, Haider Ali, Haris Rauf, Iftikhar Ahmed, Khushdil Shah, Mohammad Hasnain, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim, Naseem Shah, Shaheen Shah Afridi, Shan Masood, Usman Qadir. IANS Also Read: Afghanistan Bring Back Rasooli In Squad For T20 World Cup Also Watch:","pubDate":"2022-09-16 04:23:47","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/16/388795-pakistan-name-squad.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Afghanistan Bring Back Rasooli In Squad For T20 World Cup","link":"https://www.sentinelassam.com/sports-news/afghanistan-bring-back-rasooli-in-squad-for-t20-world-cup-613155","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The ACB dropped Karim Janat and Noor Ahmad for the T20 World Cup which will be played from October 16 to November 13 at various venues in Australia.","content":"KABUL: Seasoned all-rounder Samiullah Shinwari, Hashmatullah Shahidi, and Afsar Zazai were on Thursday left out as Afghanistan named their 15-member squad for the ICC Men's T20 World Cup 2022 in Australia next month. From the 17 players who were part of the squad for the recently held ACC Men's Asia Cup 2022, the Afghanistan Cricket Board (ACB) also dropped Karim Janat and Noor Ahmad for the T20 World Cup which will be played from October 16 to November 13 at various venues in Australia. \"Middle-order batter Darwish Rasooli, who was out with a finger injury, the leg-spinning all-rounder Qais Ahmad and the right-arm quick Salim Safi have made it to the 15-member cut. In addition, Afsar Zazai, Sharafuddin Ashraf, Rahmat Shah and Gulbadin Naib have been added to the squad as reserves,\" the ACB informed in a release on Thursday. The squad led by Mohammad Nabi includes senior players like spinner Rashid Khan, wicket-keeper Rahmanullah Gurbaz, Ibrahim Zadran, Fazal Haq Farooqi and Mujib ur Rahman. IANS Also Read: Haaland Gives Man City Late Winner; Chelsea Held, Messi, Neymar Score Also Watch:","pubDate":"2022-09-16 04:10:30","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/16/388791-3a226f2533da5cf6061deea4325bfd6c-s82ntu.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Will Continue To Be Responsible For...\": PCB After Afridi's Statement","link":"https://sports.ndtv.com/cricket/will-continue-to-be-responsible-for-arranging-medical-care-pcb-after-shahid-afridis-statement-3349077","keywords":null,"creator":null,"video_url":null,"description":"The Pakistan Cricket Board (PCB) issued a clarification, saying the board will always be responsible for arranging medical care for all their players.","content":"On Thursday, former Pakistan captain Shahid Afridi came out with a statement, saying pacer Shaheen Shah Afridi is paying for his own rehabilitation in England and is staying in the UK on his own money. \"He has flown out to the UK on his own ticket, he is staying there on his own money, I arranged a doctor for him there, he contacted him there, the PCB is not doing anything in all this. As far as I know he is doing everything about staying there and coordination with doctors,\" Afridi told Pakistan's Sama TV. However, late Thursday night, the Pakistan Cricket Board (PCB) issued a clarification, saying the board will always be responsible for arranging medical care for all their players. \"The PCB is also pleased to advise and update that Shaheen Shah Afridi is making excellent progress in his rehabilitation in London and is on track to make a full recovery in time for the ICC Men's T20 World Cup Australia 2022,\" the PCB said in an official statement. \"It goes without saying that the PCB has always been and will continue to be responsible for arranging medical care and rehabilitation of all its players requiring any treatment,\" it added. The board also provided an injury update on Fakhar Zaman , saying the left-handed batter will depart for London on Friday to undergo rehabilitation. \"Fakhar Zaman will depart for London on Friday to undergo rehabilitation. Fakhar had landed awkwardly on his right knee while fielding during the ACC T20 Asia Cup final in Dubai. As per the protocols, the PCB has scheduled his medical appointments with specialists who will be providing the best medical care for his rehabilitation,\" stated the board. \"During his stay in London, the PCB will make all relevant logistical arrangements for Fakhar and he will remain under the supervision of the PCB Advisory Panel, which includes Dr Imtiaz Ahmad and Dr Zafar Iqbal, who are also treating Shaheen Shah Afridi,\" it added. Pakistan on Thursday had named its T20 World Cup squad, and Fakhar was put in the reserves list while Shaan Masood was named in the World Cup-bound squad. Promoted T20 World Cup squad: Babar Azam (c), Shadab Khan (vc), Asif Ali , Haider Ali , Haris Rauf , Iftikhar Ahmed , Khushdil Shah , Mohammad Hasnain , Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim , Naseem Shah , Shaheen Shah Afridi, Shan Masood , Usman Qadir Reserves: Fakhar Zaman, Mohammad Haris , Shahnawaz Dahani","pubDate":"2022-09-16 04:10:17","image_url":"https://c.ndtvimg.com/2020-11/h6i1pnfg_cricket-bat-ball-afp_625x300_20_November_20.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Twitter reacts to Mohammad Amir's jibe at Pakistan selectors | READ","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-former-pakistan-speedster-takes-sly-dig-at-pakistan-selectors-read-mohammad-amir-2022-09-16-808738","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: After losing out on the Asia Cup to Sri Lanka just by a whisker, the PCB (Pakistan Cricket Board) announced their squad for the T20 World Cup which will be played in October later this year. In a surprise move, the Pakistan selectors have not included left-handed batter Fakhar Zaman in the squad and have kept him in the reserves. The squad which was announced on September 15, 2022, has ruffled many feathers but in a very bad way.","content":null,"pubDate":"2022-09-16 04:03:12","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-England players had &#039;no issues&#039; with Hales call-up: Buttler","link":"https://www.thestar.com.my/sport/cricket/2022/09/16/cricket-england-players-had-039no-issues039-with-hales-call-up-buttler","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England's limited-overs captain Jos Buttler said players had no issues with the inclusion of Alex Hales in the Twenty20 World Cup squad after the batsman received his first call-up since being dropped from the squad in 2019. Read full story","content":"(Reuters) - England's limited-overs captain Jos Buttler said players had no issues with the inclusion of Alex Hales in the Twenty20 World Cup squad after the batsman received his first call-up since being dropped from the squad in 2019. Hales, 33, was called up as a replacement for Jonny Bairstow, who was ruled out of the tournament in Australia after suffering a lower limb injury while playing golf. In 2019, Hales was withdrawn from the preliminary squad for the 50-overs World Cup after the Guardian newspaper reported he was serving a three-week ban for recreational drug use. \"I spoke to lots of the senior players to make sure that no one would have any issues with Alex being back in the team if we wanted to select him. No one had any issues,\" Buttler told reporters on Thursday ahead of their T20 series in Pakistan. \"He's obviously been in excellent form. We know what a talented player he is and he's gained a lot of experience as well since the last time he played for England.\" Hales, who is also with the team in Pakistan, has played in the T20 Big Bash League in Australia, registering an average of 33.16 from 60 innings. \"Looking ahead to the World Cup, his Big Bash record is fantastic. Australia is a place that he's done well, and so he seemed the obvious pick,\" Buttler added. England begin their T20 World Cup campaign against Afghanistan on Oct. 22 in Perth. (Reporting by Manasi Pathak in Bengaluru; Editing by Peter Rutherford)","pubDate":"2022-09-16 03:51:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/09/16/1739700.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"India Maharajas vs World Giants Special Match Legends League Cricket 2022 LIVE Stream details: When and where to watch Maharajas vs Giants online and on TV?","link":"https://zeenews.india.com/cricket/india-maharajas-vs-world-giants-special-match-legends-league-cricket-2022-live-stream-details-when-and-where-to-watch-maharajas-vs-giants-online-and-on-tv-2510731.html","keywords":null,"creator":null,"video_url":null,"description":"Here’s all you need to know about India Maharajas vs World Giants Special Match Legends League Cricket 2022 preview: Live stream, TV timing, squads.","content":null,"pubDate":"2022-09-16 03:48:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Duleep Trophy live score, semifinal Day 2: South Zone looks to pile on runs vs North Zone; West Zone eyes 300 vs Central Zone","link":"https://sportstar.thehindu.com/cricket/duleep-trophy-2022-live-score-day-2-updates-north-vs-south-central-vs-west-preview-highlights-streaming-details/article65897861.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Duleep Trophy, Indian domestic cricket: Follow highlights, score, commentary, updates from Day 2 of the Duleep Trophy matches.","content":null,"pubDate":"2022-09-16 03:36:43","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"NZ All-Rounder Jimmy Neesham Declines New Zealand Central Contract","link":"https://sports.ndtv.com/cricket/jimmy-neesham-declines-new-zealand-central-contract-due-to-pre-arranged-agreements-with-domestic-leagues-3348996","keywords":null,"creator":null,"video_url":null,"description":"New Zealand Cricket (NZC) on Friday confirmed that all-rounder Jimmy Neesham has declined a central contract on the \"basis of pre-arranged agreements he had already struck with overseas domestic...","content":null,"pubDate":"2022-09-16 03:25:35","image_url":"https://c.ndtvimg.com/2021-11/ndkjdg34_jimmy-neesham_625x300_12_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Shaheen Paying For Rehabilitation, PCB Hasn't Done Anything\": Afridi","link":"https://sports.ndtv.com/cricket/shaheen-paying-for-rehabilitation-pcb-hasnt-done-anything-shahid-afridi-alleges-3348934","keywords":null,"creator":null,"video_url":null,"description":"Former Pakistan cricket team captain Shahid Afridi has said that the young pacer is paying for his own rehabilitation in England.","content":"The Pakistan Cricket Board (PCB) selectors named a 15-member squad for the 2022 T20 World Cup on Thursday. They included young left-arm pacer Shaheen Shah Afridi, who is currently recovering from injury, in the squad. Shaheen, 22, injured his knee while fielding during the first Test in Sri Lanka in July and missed the Asia Cup earlier this month. The lanky left-arm paceman will also miss the seven-match T20I series against England starting in Karachi from September 20 but chief selector Mohammad Wasim said his injury is being monitored. \"We are assessing Shaheen's injury and hope that he will be fit,\" Wasim said in a press conference in Lahore. However, former Pakistan cricket team captain Shahid Afridi has said that the young pacer is paying for his own rehabilitation in England. \" Shaheen Afridi has gone on his own to England. He has even paid for his own ticket. He is staying in England on his own money. I arranged a doctor for him, and then he contacted the doctor when he landed there. The PCB hasn't done anything,\" Afridi said in a discussion on Samaa TV . \"From the coordination to his accommodation, he is doing everything on his own. Zakir Khan (PCB's director of international cricket) spoke to him just once or twice.\" Pakistan are placed in Group 2 of the Twenty20 World Cup with arch-rivals India, South Africa, Bangladesh, and two qualifier teams who will come from the first round. They play India in a sell-out first match in Melbourne on October 23. Pakistan T20 World Cup and New Zealand tri-series squad: Babar Azam (captain), Shadab Khan , Asif Ali , Haider Ali , Haris Rauf , Iftikhar Ahmed , Khushdil Shah , Mohammad Hasnain , Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim, Naseem Shah , Shaheen Shah Afridi, Shan Masood , Usman Qadir Promoted Travelling reserves: Fakhar Zaman , Mohammad Haris , Shahnawaz Dahani With AFP inputs","pubDate":"2022-09-16 02:01:24","image_url":"https://c.ndtvimg.com/2021-12/57tpcfj_shaheen-afridi-afp_625x300_15_December_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"'The greatest of all time', Virat Kohli reacts to Roger Federer's retirement announcement","link":"https://zeenews.india.com/tennis/roger-federer-retirement-the-greatest-of-all-time-virat-kohli-reacts-to-tennis-legends-retirement-news-2510688.html","keywords":null,"creator":null,"video_url":null,"description":"Former Indian cricket captain and star India batter Virat Kohli was one of those athletes who looked up to Federer for inspiration.","content":"Tennis legend Roger Federer will bring an end to his tennis playing career next week after the conclusion of Laver Cup in London. The 20-time Grand Slam champion announced on Thursday (September 15) that was he was going to retire and the Laver Cup would be his last ATP Tour event. Since the news came out, fans have taken to social media to pour their heart out , writing farewell notes and revisiting memories of Federer's wins. The champion player was not just known for his trophy collection but also the grace with which he carried himself. Former Indian cricket captain and star India batter Virat Kohli was one of those athletes who looked up to Federer for inspiration. He has met him a few times as well and every time he met he looked like a fan boy. Kohli too commented on Roger Federer's Instagram post. He wrote in the comments section: 'The greatest of all time. King Roger'. He also dropped heart emojis to reflect his love and respect for the outgoing tennis legend. Check out his reaction below. One of Federer's longest rival and friend Rafael Nadal too shared his thoughts on his retirement, calling it a sad day for him and for the sports fans globally. This is what Nadal wrote for Federer : Dear Roger, my friend and rival. I wish this day would have never come. It’s a sad day for me personally and for sports around the world. It’s been a pleasure but also an honor and privilege to share all these years with you, living so many amazing moments on and off the court. We will have many more moments to share together in the future, there are still lots of things to do together, we know that.\" For now, I truly wish you all the happiness with your wife, Mirka, your kids, your family and enjoy what’s ahead of you. I’ll see you in London.\"","pubDate":"2022-09-16 01:51:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"\"...Our Cricket Won't Move Forward\": Former Afghan Captain To NDTV","link":"https://sports.ndtv.com/cricket/afghanistan-wont-gain-experience-till-they-play-against-big-teams-consistently-asghar-afghan-to-ndtv-3348905","keywords":null,"creator":null,"video_url":null,"description":"In an interview with NDTV, former Afghanistan captain Asghar Afghan spoke about the performance in the Asia Cup, the intensity of the Pakistan-Afghanistan match, and the importance of...","content":"Afghanistan failed to make it to the final of the recently-concluded Asia Cup but the performance of the Mohammad Nabi -led side impressed one and all. They started off with wins against Sri Lanka and Bangladesh in the group stage, but defeats against Sri Lanka, Pakistan, and India in the Super 4 stage led to their ouster. In an interview with NDTV, former Afghanistan captain Asghar Afghan spoke about how more game time against the top teams will help the side in easing out their nerves in pressure situations. He also spoke about the rivalry that has developed between Pakistan and Afghanistan, how Mujeeb Ur Rahman has managed to cement his place in the side and how Afghanistan needs to learn to take the game deep against big teams. \"No doubt, the performance of Afghanistan in the Asia Cup was very good. The only problem is that we do not play against big teams that often, Afghanistan Cricket Board needs to organise home and away series against big teams. Till the time, we do not play against big teams, we will not gain that experience. After the World Cup last year, we played in the Asia Cup. A long time passed before we played a big tournament. Till the time we do not play more matches, our cricket won't move forward,\" said Afghan, who is currently in India to participate in the upcoming Legends League Cricket. \"Afghanistan would have gained a lot of experience from playing in the Asia Cup. The performance was good, but because of inexperience, we were not able to get over the line. Till the time, we do not play against big teams, we would not have experience in finishing off games. The match against Pakistan was a close one, whenever you play against a big side, you need to take the game deep. Talking about Afghanistan, we want to finish off games in quick succession, but taking the game deep is the need of the hour. We need to play against big teams consistently, if we play 3-5 match series against big teams, there will be a great improvement,\" he added. In the Asia Cup, Mujeeb Ur Rahman returned with seven wickets while seasoned spinner Rashid Khan took six wickets. Afghan, was all praise for Mujeeb, saying the spinner bowls upfront to usually the best batters of opposition and that is a completely different skill set. \"Mujeeb comes onto bowl in the difficult periods. He is usually bowling to the openers or the No.3 batter, and these three are generally the best players of a team. More fielders are inside the circle, so the pressure is more on Mujeeb. There are few spinners who can bowl this well in the powerplay. Mujeeb has always performed, and when Rashid Khan comes onto bowl, there are more fielders outside the 30-yard circle and the ball has gotten old. I have to say that Mujeeb has always performed under tough situations,\" said the 35-year-old. The match between Afghanistan and Pakistan was a thrilling encounter, and in the end, Babar Azam 's side prevailed by one wicket as Naseem Shah hit back-to-back sixes in the final over to seal the contest. However, the match was marred by some unsavoury scenes as Afghanistan fans broke the chairs inside the Sharjah Stadium and even assaulted Pakistan fans. The match also saw Pakistan's Asif Ali clashing with Afghanistan pacer Fareed Malik. \"Our players have played with Pakistan players. When there used to be refugee, our players used to play in Peshawar. When you know the players, there is a sense of competitiveness, and aggression is bound to be there. The fans of both Pakistan and Afghanistan wait for this contest. The players are also aggressive and they give their best to win. The aggression is there on the ground, sometimes it can be a bit too much, but in the end, it is just a sport. These types of incidents can happen,\" said the former Afghanistan captain. Promoted \"But at the end of the day, cricket was the winner. One team has to win, one team has to lose. Even the fans were angry after Afghanistan lost against Pakistan in the Asia Cup. There was a scuffle, this was not right. Sports should be looked at as sports only, these types of incidents should not take the glory away from the sport,\" he added. Lastly, talking about playing in the Legends League Cricket, Afghan said: \"I want to Legends League for creating a platform for the retired players to come and play, it is an incredible platform. We will enjoy it and we are excited to play. There are some big players involved. I am waiting to play at the Eden Gardens, the stadium has been lucky for me too. It is one of the best grounds in India, we are just waiting to go out there and play.\"","pubDate":"2022-09-16 01:30:17","image_url":"https://c.ndtvimg.com/2022-09/cj57d668_asghar-afghan-afp-_625x300_16_September_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}