{"newsArray":[{"title":"India vs Sri Lanka: Shivam Mavi's 4-for leads hosts to win in 1st T20","link":"https://www.firstpost.com/photos/india-vs-sri-lanka-shivam-mavis-4-for-leads-hosts-to-win-in-1st-t20-11923252.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka: Shivam Mavi's 4-for leads hosts to win in 1st T20","content":"Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-03 19:10:47","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Shivam-Mavi-Hardik-Pandya-India-vs-Sri-Lanka-1st-t20-sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka: Hardik Pandya’s captaincy, Shivam Mavi’s dream debut and more talking points","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-sri-lanka-hardik-pandyas-captaincy-shivam-mavis-dream-debut-and-more-talking-points-11923272.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka: Hardik Pandya’s captaincy, Shivam Mavi’s dream debut and more talking points","content":"At a stadium where the bowlers historically do not have much to boast about, the first T20I of 2023 between India and Sri Lanka was a game highlighted by the performance of the bowling units of both sides. A target of 161, which would have been thought of as below par at the Wankhede Stadium was made to look like a mountain of runs by the Indian bowling attack.Not to forget Sri Lanka’s efforts as the bowlers hunted in pack and restricted India for such a total in first place.India held nerves and snatched a two-run win as Sri Lanka lament their loss after coming so close to chasing the target.As cricket resumes in the new year for India, we continue talking about what happened and how it happened.That’s that from the 1st T20I.#TeamIndia win by 2 runs and take a 1-0 lead in the series.Scorecard – https://t.co/uth38CaxaP #INDvSL @mastercardindia pic.twitter.com/BEU4ICTc3Y— BCCI (@BCCI) January 3, 2023 Here are the talking points from India vs Sri Lanka 1st T20I –Shivam Mavi’s dream-like debut spellIndia will be pleased with the performance of one of their two debutants as Shivam Mavi returned with a four-wicket spell and also brought India back in the hunt.In fact, Mavi is only the third Indian bowler to bag four wickets on his T20I debut after Barinder Sran and Pragyan Ojha.For his brilliant bowling figures of 4/22 on his debut game, @ShivamMavi23 is our Top Performer from the second innings.A look at his bowling summary here 👇👇#INDvSL @mastercardindia pic.twitter.com/nkDyHeRLCo— BCCI (@BCCI) January 3, 2023 Mavi gave India the opening breakthrough as his delivery went through the gate between the bat and pad of Pathum Nissanka to dislodge his stumps and also dismissed Dhananjaya de Silva in his second over.Mavi then bagged two wickets in death overs and put pressure on Sri Lanka when they seemed to get better off India’s total.Skipper Hardik Pandya also praised Mavi stating that the youngsters brought them back in the game.Hardik Pandya’s captaincy and new-ball bowlingIt initially seemed like Hardik opened the bowling as he can he do whatever he wants being the captain. But, jokes apart, he was very effective at the start and applied brakes on the Sri Lankan powerplay.He later confirmed at the presentation that he has been practicing in the nets with the new ball and that is why he tried to bowl upfront.It also showed that Pandya is willing to lead from the front and take responsibility upon himself.Hardik’s captaincy once again stood out as his bowling changes and field placements turned out to be fruitful for India.Surprised to see Axar bowling the final over? Here’s Captain @hardikpandya7 revealing the reason behind the move. #INDvSL #TeamIndia @mastercardindia pic.twitter.com/dewHMr93Yi— BCCI (@BCCI) January 3, 2023 The all-rounder also confirmed that he is trying to put the team in troubled waters and make them trained for crucial situations. He is willing to open the experiment lab for this purpose.The fact that he was clear in his thoughts, and denied Harsha Bhogle claiming at the post-match presentation that Axar Patel bowling the last over was a gamble, confirms that he is an able leader.Dasun Shanaka’s inningsSri Lanka would be disappointed with their performance, but take optimism from their skipper Dasun Shanaka’s innings. The all-rounder smashed three maximums and as many boundaries to bring his side closer to victory.Shanaka scored 45 from 27 deliveries and ensured his side remains in the hunt. The game was very much in their control until Umran Malik got his wicket in the 17th over.Deepak Hooda – Axar Patel partnershipThe Sri Lankan bowlers were excellent as they hunted in pack and kept getting wickets at regular intervals. Only two of the top five Indian batters got a brisk start as Suryakumar Yadav, Shubman Gill, and Sanju Samson were dismissed cheaply.Ishan Kishan started with some brisk shots but was forced to slow down as the Lankan bowlers improvised on their lengths.India were strangled at 94/5 in 14.1 overs but Deepak Hooda (41* off 23) and Axar Patel (31* off 20) took control and made sure India reached 160.The duo hit four boundaries and five maximums. Four of those maximums came from Hooda’s blade and he was also adjudged player of the match for an impactful innings.The 68-run partnership also blunted the overriding Sri Lankan attack.Chamika Krunaratne’s cameoThe tail-ender played a significant role at the death as he kept the Sri Lankan hopes alive till the very end. The right-hander scored 23 runs from 16 balls.More importantly, he hit two sixes – one each in the 19th and 20th over – and brought his side closer to the target.However, he couldn’t connect the ball one more time as Sri Lanka fell short by two runs.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-03 19:00:17","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/India-vs-Sri-Lanka-talking-points.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cummins’ selfless six-figure sacrifice revealed","link":"https://www.themercury.com.au/sport/cricket/cricket-2023-all-the-latest-news-and-updates/news-story/c8a54e1893c29fdd0bef52dbc92c8d0d","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Pat Cummins’ might be cricket’s most sought-after marketing magnet, but there was a time when the captain actually handed back money he felt he didn’t deserve.","content":"The Australian captain first signed with athletic giant New Balance immediately off the back of his headline-grabbing Test debut in South Africa when he took the cricket world by storm in a man-of-the-match performance at just 18 years of age.No one could have imagined at that point that it would be another six years until Cummins would play his second Test, as stress fractures and other agonising injury setbacks took hold.As far as most professional athletes are concerned, a contract is a contract.But not for a young P Cummins, who told New Balance he didn’t want to receive the full freight of sponsorship payments until he was back in an Australian shirt giving the shoe and bat company value on the field.The six-figure sacrifice at a time when Cummins was not yet on the big bucks of being a fully-fledged professional cricketer provides a fascinating insight into the principles of the man now captaining the Australian team.“We certainly didn’t pay him the full amount,” New Balance vice president Darren Tucker said.“He signed with us almost straight out of South Africa, his first Test. Obviously the next five years he probably had three stress fractures.“You have these agreements with certain athletes around the world and their contract is their contract and that’s what they do.“But once Pat commits to you he makes himself available and always is trying to give the right thing.“I think Pat does so much without wanting the publicity is the way I look at it.”The loyalty New Balance showed in Cummins through his injury setbacks is being returned now the fast bowler has fulfilled his potential as a giant of the sport.“I don’t know what number contract we’re up to now. We’re probably three or four contracts in,” Tucker said – a former NSW State cricketer and brother of umpire Rod Tucker.“If I said money doesn’t mean anything to (Cummins) I’d be lying, because it always plays a part. But it’s more about fairness and making sure that there’s a bigger picture with what he’s trying to achieve.“He doesn’t want to be defined as a cricketer. He wants to make sure that there’s more to it than just being captain of Australia. That fits pretty much in with our values as well.”Tucker remembers picking Cummins up from a scan for one of his stress fractures and was stunned at his attitude.“His attitude was always, ‘I’ll be fine.’ And, ‘I’ll find a way,’” Tucker said.“You don’t know what he was going through mentally at that stage to get through that. It must have been devastating for a 21 or 22 year old kid, to have so much ability (but be sidelined).“But he always looked on the positive side and that’s where he’s at as a human being with everything he does.”","pubDate":"2023-01-03 19:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ind vs Sl 1st T20I: भारत ने पहला टी20 2 रन से जीता, शिवम मावी ने चटकाए 4 विकेट","link":"https://sports.ndtv.com/hindi/cricket/india-vs-sri-lanka-1st-t20i-match-ind-vs-sl-live-score-updates-3660259#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs SL, 1st T20I: आखिरी गेंद अक्षर ने फ्लैट और तेज फेंकी और जोर लगाने के बावजूद करुणारत्ने गेंद को सीमा के पार नहीं भेज सके. बल्कि दूसरा रन लेने की कोशिश में मधुशंका रन आउट हो गए और भारत ने इसी के साथ ही पहला टी10 मैच 2 रन से जीतकर सीरीज में 1-0 की बढ़त हासिल कर ली.","content":"India vs Sri Lanka, 1st T20I: नए कप्तान हार्दिक पांड्या (Hardik Pandya) की अगुवाई ेमें टीम इंडिया ने मंगलवार को मेहमान श्रीलंका को तीन टी20 मैचों की सीरीज के पहले रोमांचक मुकाबले में मुंबई के वानखेड़े में 2 रन से हराकर सीरीज में 1-0 की बढ़त हासिल कर ली. एक समय मुश्किल में दिख रहे श्रीलंका को पुछल्ले करुणारत्ने ने ऐसी स्थिति में पहुंचा दिया, जहां से मेहमान टीम ोक पारी के आखिरी ओवर में जीत के लिए 13 रन की दरकार थी. यह आखिरी ओवर अक्षर पटेल नें फेंका और जब तीसरी गेंद पर करुणारत्ने ने छक्का जड़ा, तो भारतीय फैंस के चेहरे एक बार को मुरझा गए क्योंकि यहां से लंका को 3 गेंदों पर पांच ही रन बनाने थे और एक शॉट ही मैच का अंतर पैदा कर देता.SCORE BOARDDeepak Hooda is adjudged Player of the Match for his fine innings of 41* off 23 deliveries as #TeamIndia win by 2 runs.Scorecard - https://t.co/uth38CaxaP #INDvSL @mastercardindia pic.twitter.com/0LYRcUFtnC— BCCI (@BCCI) January 3, 2023लेकिन ऐसे समय अक्षर पटेल ने बहुत ही बुद्धिमानी से बॉलिंग की और दिशा और गति में लगातार परिवर्तन करते हुए लंकाई बल्लेबाजों को भ्रमित रखा. चौथी गेंद पर कोई रन नहीं आया. स्कोर दो गेंदों पर पांच रन रन गया. पांचवीं गेंद पर रजिथा रन आउट हो गए और अब श्रीलंका के लिए जीत का स्कोर 1 गेंद पर चौका रह गया. आखिरी गेंद अक्षर ने फ्लैट और तेज फेंकी और जोर लगाने के बावजूद करुणारत्ने गेंद को सीमा के पार नहीं भेज सके. बल्कि दूसरा रन लेने की कोशिश में मधुशंका रन आउट हो गए और भारत ने इसी के साथ ही पहला टी10 मैच 2 रन से जीतकर सीरीज में 1-0 की बढ़त हासिल कर ली. भारतीय बल्लेबाजी में आखिरी में तेज नाबाद 41 रन बनाकर भारत को 162 का स्कोर दिलाने में अहम योगदान देने वाले दीपक हूडा को प्लेयर ऑफ द मैच चुना गया.श्रीलंका की शुरुआत खराब रही थी, जब करियर का पहला मैच खेल रहे शिवम मावी ने दूसरे ही ओवर में पथुन निसानका (1) की गिल्लियां बिखेरर दीं, तो धनंजय डि सिल्वा (8) भी लगातार दो चौके जड़ने के बाद मावी का शिकार हो गए. फिर उमरान आए, तो उन्होंने भी चरिथ (12) को सस्ते में आउट किया, तो हर्षल ने भी भानुपक्षा (10) को जल्द ही चलता कर लंकाइयों को जल्द ही सिमेट कर बड़े अंतर से जीत दर्ज करने का भरोसा कप्तान हार्दिक को दिया. लेकिन यहां से श्रीलंकाई कप्तान दसुन शनाका (45 न, 27 गेंद, 3 चौके, 3 छक्के), हसारंगा (21 रन, 10 गेंद, 1 चौका, 2 छक्के) और फिर नंबर आठ बल्लेबाज चमिका करुणारत्ने (नाबाद 23 रन, 16 गेंद, 2 छक्के) ने प्रचंड  प्रहार लगाते हुए श्रीलंका को लगभग मैच जीता ही दिया. मैच का फैसला आखिरी गेंद पर हुआ. और अगर इस शॉट से चौका भी आ जाता, तो मैच लंका के पाले में होता, लेकिन अक्षर पटेल की चतुराई मेहमान पुछल्ले बल्लेबाजों पर भारी पड़ी.  पहले सेशन में भारत ने पहले बल्लेबाजी करते हुए श्रीलंका के सामने जीत के लिए 163 रनों का लक्ष्य रखा है.श्रीलंका से पहले बैटिंग का न्योता पाने के बाद भारत की शुरुआत अच्छी नहीं रही. और करियर का पहला टी20 मैच खेल रहे शुबमन गिल (7) और आतिशी सूर्यकुमार याद (7) सस्ते में ही पवेलियन लौट गए. संजू सैमसन (5) भी मौके को भुनाने में नाकाम रहे. लेकिन ऐसे समय ईशान किशन (37) और कप्तान हार्दिक पांड्या (29) ने टीम को अच्छा सहारा दिया, लेकिन ये स्कोर को गति प्रदान नहीं कर सके. जब 15वें ओवर में भारत का पांचवां विकेट 94  पर गिरा, तो एक बार को लगा कि भारत मजबूत स्कोर खड़ा नहीं कर पाएगा, लेकिन दीपक हूडा (नाबाद 41 रन, 23 गेंद, 1 चौका, 4 छक्के) और अक्षर पटेल (नाबाद 31 रन, 20 गेंद, 3 चौके, 1 छक्का) ने लंकाइकों की उम्मीदों पर वार करते हुए आखिरी ओवरों में बहुत ही उम्दा बल्लेबाजी करते हुए भारत को कोटे के 20 ओवरों में 5 विकेट पर 162 का लड़ने लायक स्कोर दिला दिया, जिसका श्रीलंकाई पुछल्ले बल्लेबाजों और कप्तान शनाका ने अच्छा मुकाबला किया, लेकिन रोमांचक मैच में मेहमान टीम जीत से 3 रन दूर रह गई.इससे पहले श्रीलंका ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया है. भारत के लिए शुभमन गिल और शिवम मावी अपने टी20 करियर का आगाज करने जा रहे हैं. लेफ्टी पेसर अर्शदीप नहीं खेल रहे हैं,जो पूरी तरह फिट न होने के कारण उपलब्ध नहीं थी, जो मावी के लिए लॉटरी बन गया.  दोनों को वॉर्म-अप सेशन के दौरान कैप दे दी गई है. मैच में खेल रहीं दोनों देशों की वास्तविक इलेवन इस प्रकार हैं:भारत: 1. हार्दिक पांड्या (कप्तान) 2. शुभमन गिल 3. सूर्यकुमार यादव 4. संजू सैमसन 5. दीपक हूडा 6. ईशान किशन 7. अक्षर पटेल 8.  हर्षल पटेल 9. शिवम मावी 10. उमरान मलिक 11.युजवेंद्र चहलश्रीलंका: 1. दसुन शनाका (कप्तान) 2. पथुन निसानका 3. कुसल मेंडिस (विकेटकीपर) 4. धनंजय-डि-सिल्वा 5. चरिथ असालंका 6. भनुका राजपक्षे 7. वैनिंदु हसारंगा 8. चमिका करुणारत्ने 9. महीश थीक्ष्णा 10. कसुन  रजिथा 11.दिलशान मदुशनकाInching closer to the #INDvSL T20I series opener!Follow the match https://t.co/x0tupH98nB#TeamIndia | @mastercardindia pic.twitter.com/FDVy3LrCso— BCCI (@BCCI) January 3, 2023India vs Sri Lanka, 1st T20I - Live Cricket Score, Commentary","pubDate":"2023-01-03 17:42:22","image_url":"https://c.ndtvimg.com/2022-11/h8ei4v2_hardik-pandya_625x300_10_November_22.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket world erupts over controversial act","link":"https://www.themercury.com.au/sport/cricket/big-bash/adam-zampa-responds-as-cricket-world-erupts-over-controversial-act/news-story/82ed1a35bd8ac9c831bbf5f06997ad38","keywords":["Big Bash News","Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Melbourne Stars captain Adam Zampa said he was “well within my right” to attempt to Mankad the Renegades’ Tom Rogers during a fiery local derby at the MCG on Tuesday night.","content":"But despite looking determined to dismiss Rogers if the third umpire adjudged the Renegade to be out, in hindsight Zampa revealed he was not sure if he would’ve followed through with the dismissal.The TV replay showed Zampa’s arm went past the vertical in his bowling action, so Rogers survived. Zampa admitted post-game that he wasn’t aware of the “vertical” aspect of the rule.On the telecast, Zampa’s coach David Hussey said that if Rogers had been given out, the Stars would’ve asked for the decision to be reversed because it’s not the way Hussey wants to play cricket.“Tom Rogers the ball before used running out of the crease before I had bowled it to his advantage,” Zampa said.“I bowled a good ball to Mackenzie Harvey which should’ve been one (run instead of two) if he (Rogers) hadn’t done that.“I thought he’s definitely done something he shouldn’t have.“So I thought that ball if he doesn’t want to be on strike then I’ll make it a bit easier for him.“I think I was well within my right to do it, it’s in the rule book, it’s well within the rules.“I just got my technique wrong, he was almost halfway down the wicket.“Because it went upstairs we had time (to consider withdrawing the appeal).“I’m not sure what decision I would’ve went with once the ruling had been made.“Even if I got my Mankad technique right and (umpire) Gerard (Abood) said that’s probably going to be out, I don’t know what decision I would’ve come to.“I’m a very competitive guy so I guess I saw red a little bit when he (Rogers) used that (stealing ground) to his advantage.”Zampa said if he Mankaded a batsman earlier in the Renegades innings, rather than the third-last ball, he would be happy for it to serve as a warning rather than a dismissal.“If it gets in that situation again I’m not saying I won’t do it, (but) particularly so late in the (Renegades’) innings with like two balls left, I know even if I Mankad someone and run him out, then they’ve still got three wickets in hand and Mackenzie Harvey is on strike anyway so it doesn’t really make that much difference to the game,” Zampa said.Rogers, who’s also a bowler, said that he wouldn’t Mankad a batsman, but also conceded he was “confused” by the rule.“It gets a bit murky doesn’t it? If someone gets halfway down the wicket everyone [sic] is not too happy about it,” he said.Rogers responded to the incident by taking career-best figures of 5-16, and while he admitted the Mankad attempt fired him up “a little bit”, he told reporters post-game that teammate Sam Harper was exaggerating when he told the broadcast that he was “fuming” about the incident.Rogers said he was more psyched up about playing in front of 38,564 fans – the second-biggest crowd of the BBL season so far.“It was just phenomenal … so lucky to play cricket and 40,000 people roll out and watch us, it’s just bloody exciting,” he said.“If you can’t get up and amped for that there’s something wrong with you.”Above all, Zampa hoped the incident would help to further build up the rivalry between the two Melbourne teams.“It always feels like something happens in these games that you can talk about for a little while, this is going to be it now, isn’t it,” he said.“These competitions are built on rivalry and the Melbourne Renegades versus Melbourne Stars one is one of the most important ones in the competition so if it just sparked a little fire under the derby, then so be it.”But he didn’t think it compared to the famous clash between the late great Shane Warne and Marlon Samuels 10 years ago.“It will probably be in the news tomorrow and then everyone will forget about it,” he said.It was all over social media on Tuesday night with some blasting Zampa, others defending him — and even one taking issue with Hussey for not taking his own player’s side.","pubDate":"2023-01-03 17:42:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka, Highlights, 1st T20I in Mumbai: Men in Blue survive late scare to win thriller at Wankhede","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-sri-lanka-live-score-ind-vs-sl-1st-t20-cricket-match-latest-updates-11921532.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka, Highlights, 1st T20I in Mumbai: Men in Blue survive late scare to win thriller at Wankhede","content":"23:07 (IST)That brings us to the end of our coverage of Team India's first game of 2023, with the Men in Blue continuing their unbeaten run under Hardik Pandya's captaincy. This is Amit signing off on behalf of the sports desk at Firstpost, bidding you all good night!23:03 (IST)Hardik Pandya, India skipper: (On fitness issues) It’s just cramps! If I’m smiling, everything is under control. Had a rough night. Probably didn’t drink enough water. (Giving Axar the final over) I want to put this team into difficult situations because it will serve us well down the road. (Chat with Mavi) I’ve seen him bowl really well in the IPL, and just told him to back his strengths.23:00 (IST)Deepak Hooda is the Player of the Match for his unbeaten 41 off 23 balls. Hooda: I keep trying to adapt to every position in the batting order and give my best regardless of the position or situation. I love this game a lot so want to contribute in every way possible.22:59 (IST)Dasun Shanaka, Sri Lanka captain: Really disappointed with the way we finished. I feel we could’ve won the game. I used the matchups really well so that’s the key and the reason why we could restrict India to 162. Hopefully we come up with a better game.22:52 (IST)India certainly do love playing Sri Lanka in the white-ball formatsIndia's most Wins against an OpponentTest vs ENG (31 wins)ODI vs SL (93 wins)T20I vs SL (18 wins)*#INDvSL— Cricbaba (@thecricbaba) January 3, 202322:52 (IST)A major gamble that somehow paid off in the endBowling spinner the last over wasn’t ideal but Ant bhala to Sab bhala. Well done team india. #INDvSL— Irfan Pathan (@IrfanPathan) January 3, 202322:47 (IST)India vs Sri Lanka 2023 Live ScoreAfter 20 overs,Sri Lanka 160/10 ( Chamika Karunaratne 23 , )India win by 2 runs, and go 1-0 up in the three-match series! The Men in Blue have a lucky escape in the end after Chamika Karunaratne's unbeaten 23 takes the first T20I to the very last delivery of the run chase! Needing 4 to win off the last ball, Karunaratne hits the ball towards the fielder at deep midwicket and dejectedly trudges towards the non-striker's end; his partner Dilshan Madushanka has even less interest in completing the single and is run out at the striker's end for a platinum duck.Madushanka run out (Hooda/Kishan) 0(0)22:40 (IST)India vs Sri Lanka 1st T20I Live ScoreOUT! Kasun Rajitha's run-out at the non-striker's end after responding to Chamika Karunaratne's call for a risky second! He falls well short in the end, but the important thing is that Karunaratne will be on strike for the final ball, in which Sri Lanka need four to win! SL 159/9Rajitha run out (Hooda/Axar) 5(4)22:36 (IST)India vs Sri Lanka LIVE Cricket ScoreLeft-arm spinner Axar Patel will be the final over! Interesting decision from skipper Hardik Pandya. Can he defend 13 off 6?22:35 (IST)India vs Sri Lanka LIVE ScoreAfter 19 overs,Sri Lanka 151/8 ( Chamika Karunaratne 15 , Kasun Rajitha 4)SIX! Karunaratne swings his arms and ends up clearing the deep midwicket fence to keep Sri Lanka's hopes hanging by a thread! 12 runs collected so far in the penultimate over of the chase bowled by Harshal Patel! This is right after a misfield by Chahal at short fine that allows Rajitha to grab three! Single off each of the last two balls, with 16 coming off it!Sri Lanka need 13 off the last over! 22:30 (IST)Sri Lanka vs India 2023 LIVE ScoreAfter 18 overs,Sri Lanka 134/8 ( Chamika Karunaratne 5 , Kasun Rajitha 0)OUT! Four-fer for Shivam Mavi on what has turned out to be a dream international debut! Deceives Maheesh Theekshana with the slower ball, the Sri Lankan No 9 holing out to India vice-captain Suryakumar Yadav at long off to depart for 1 as Sri Lanka lose their eighth wicket. Mavi keeps it tidy in the remainder of his final over to sign off with figures of 4/22!Theekshana c Yadav b Mavi 1(4)22:21 (IST)Sri Lanka vs India Live ScoreOUT! Is that the delivery that seals Sri Lanka's fate in this chase! And boy was Umran quick in that delivery, clocking 155 clicks! The bat turns in Shanaka's hands as he attempts to slice the ball over the cover arc, resulting in a simple catch for Chahal inside the circle. Body blow to Sri Lanka's hopes following the departure of their captain, and it's India's game to lose from here. SL 129/7Shanaka c Chahal b Malik 45(27)22:14 (IST)IND vs SL 1st T20I LIVE ScoreAfter 16 overs,Sri Lanka 123/6 ( Dasun Shanaka (C) 39 , Chamika Karunaratne 2)Shivam Mavi strikes right after being brought back into the attack, dismissing Wanindu Hasaranga to break the sixth-wicket partneship worth 40. Skipper Dasun Shanaka, though, shows there still is hope for his team as he collects a six and a four off Harshal Patel in the subsequent over, which costs the hosts 13 runs.Sri Lanka need another 40 to win off the last four overs with four wickets in hand. In other words, Sri Lanka skipper Shanaka stands between India and victory.22:12 (IST)IND vs SL LIVE Cricket ScoreOUT! What an evening this is turning out to be for Shivam Mavi, who grabs his third wicket by removing Wanindu Hasaranga, breaking the dangerous sixth-wicket stand in the process. Hasaranga looks to loft this over mid-off, but doesn't quite time it, offering Pandya a simple catch inside the circle. Third wicket for the debutant! SL 108/6Hasaranga c Pandya b Mavi 21(10)22:07 (IST)A heartwarming gesture at the WankhedeNice gesture from Mumbai crowd for Rishabh Pant. pic.twitter.com/cUN1NrHJvI— Johns. (@CricCrazyJohns) January 3, 202322:02 (IST)IND vs SL 2023 LIVE ScoreAfter 14 overs,Sri Lanka 107/5 ( Dasun Shanaka (C) 25 , Wanindu Hasaranga 21) Sri Lanka are back in the contest and how, with 39 runs coming in the last three overs, including 17 off Yuzvendra Chahal in the 14th. Chahal had conceded nine in his first over and things only get worse for him in his second over, with Wanindu Hasaranga smashing consecutive sixes off the leg-spinner, both sailing towards the deep-midwicket/cow-corner region. Sri Lanka cross the 100-mark following the 17-run over, and need another 56 to win off 36 with five wickets in hand.21:53 (IST)India vs Sri Lanka 2023 Live ScoreAfter 12 overs,Sri Lanka 80/5 ( Dasun Shanaka (C) 18 , Wanindu Hasaranga 1)Harshal bowls an outstanding second over, conceding just two off it while getting rid of Rajapaksa with Sri Lanka losing half their side with less than 70 on board. Axar continues from the other end, with Chahal saving a couple of runs with an athletic dive near fine leg after a lap shot by Shanaka off the first ball. Shanaka then smashes the ball for a straight six three balls later for his first maximum of the innings. 12 off Axar's second over.Sri Lanka need 83 more to win off 48 with five wickets in hand21:49 (IST)India vs Sri Lanka 1st T20I Live ScoreSIX! Shanaka shuffles to his right and smashes the ball straight down the ground, the ball disappearing behind the sight screen. Was an overpitched delivery from Axar, bowled right into the slot for the Sri Lankan skipper to smash it out of the park. SL 78/521:48 (IST)India vs Sri Lanka LIVE Cricket ScoreOUT! Second wicket for Harshal Patel in as many overs as Bhanuka Rajapaksa falls for 10 after chipping the ball towards long off. Skipper Hardik Pandya backpedals from mid off and safely grabs it in the end, though he appears to be suffering from cramps after the catch. SL 68/5Rajapaksa c Pandya b Harshal 10(11)21:42 (IST)India vs Sri Lanka LIVE ScoreAfter 10 overs,Sri Lanka 66/4 ( Bhanuka Rajapaksa 8 , Dasun Shanaka (C) 7)Sri Lanka are in a spot of bother at the halfway stage, and will hope skipper Dasun Shanaka and Bhanuka Rajapaksa are able to steer them towards safety from here with a solid partnership, similar to what Deepak Hooda and Axar Patel produced. Umran Malik and Harshal Patel bring India back in the game after Yuzvendra Chahal's off to an expensive start with a nine-run over, dismissing Charith Asalanka and Kusal Mendis respectively. Left-arm spinner Axar Patel's introduced in the 10th over, and he concedes a single off each of the first five balls before conceding a boundary to Shanaka off the last ball.Sri Lanka need 97 to win off 60 with six wickets in hand21:35 (IST)Sri Lanka vs India 2023 LIVE ScoreOUT! Straight down Sanju Samson's throat at deep point as Harshal Patel removes the set batter Kusal Mendis in his very first over, the dismissal coming as a body blow to Sri Lanka's hopes of going 1-0 up in the series! SL 51/4Mendis c Samson b Harshal 28(25)21:31 (IST)Sri Lanka vs India Live ScoreOUT! What a catch by Ishan Kishan, as Umran Malik strikes! The ball had disappeared in the night sky after a thick top-edge by Asalanka off Malik; Harshal was initially charging towards the ball from fine leg, but Kishan covered a lot of distance and put in a dive, the ball landing safely between his gloves in the end. Skipper Pandya has a look on his face that's a mixture of delight and relief after the grab SL 47/3Asalanka c Kishan b Malik 12(15)21:28 (IST)IND vs SL 1st T20I LIVE ScoreSIX! Not the best of starts for Yuzvendra Chahal, who is introduced right after the powerplay, as Charith Asalanka smokes the ball over his head to collect his first maximum of the innings. SL 42/221:21 (IST)IND vs SL LIVE Cricket ScoreAfter 6 overs,Sri Lanka 35/2 ( Kusal Mendis (W) 20 , Charith Asalanka 4)Mavi strikes for a second time in as many overs, once again getting a wicket after conceding consecutive boundaries, this time getting rid of Dhananjaya de Silva. Hardik Pandya decides to bowl a third over on the trot, once again keeping things tidy in the first five deliveries before conceding a boundary to new batter Charith Asalanka off the last delivery. Umran Malik replaces Mavi in the final over of the powerplay, much to the Wankhede crowd's delight, but starts off with a wide and a four before bowling with a lot more discipline — conceding just one off the next five.Sri Lanka reach 35/2 at the end of the powerplay, six less than what the Men in Blue managed in their innings.21:17 (IST)An Indian bowler touching 90mph... and it's not Umran Malik!Hardik Pandya bowled 144 Kmph in his 3rd over.— Johns. (@CricCrazyJohns) January 3, 202321:16 (IST)A first for Hardik Pandya todayHardik Pandya becomes the first Indian captain to bowl the first over of a men's T20I innings.Kapil Dev, Lala Amarnath, Anil Kumble and Jasprit Bumrah did it in other formats.#INDvSL— Kausthub Gudipati (@kaustats) January 3, 202321:11 (IST)IND vs SL 2023 LIVE ScoreOUT! Mavi strikes for a second time in as many overs, and once again he gets a wicket after getting hit for consecutive boundaries! This time it's Dhananjaya de Silva who departs, chipping the ball towards mid on for a simple catch after collecting consecutive fours off the debutant to depart for 8. And Sanju Samson makes no mistake this time, after spilling a catch in the first over. SL 24/2De Silva c Samson b Mavi 8(6)21:08 (IST)India vs Sri Lanka 2023 Live ScoreAfter 3 overs,Sri Lanka 16/1 ( Kusal Mendis (W) 14 , Dhananjaya de Silva 0)Spirited start from the Indians, with Hardik Pandya and Shivam Mavi bowling testing lines at the start of the Lankan chase — the latter getting rid of Pathum Nissanka after the former nearly got his wicket off the second ball of the innings. Pandya bowls four dot balls in a row in his second over, which are gold dust in this format, before getting hit for a boundary by Mendis.21:02 (IST)India vs Sri Lanka 1st T20I Live ScoreBOWLED! Shivam Mavi gets his maiden international wicket! Relief for Sanju Samson as Pathum Nissanka departs for 1, Mavi breaching his defence with an inswinger and rattling the stumps in the process! SL 12/1Nissanka b Mavi 1(3)20:53 (IST)India vs Sri Lanka LIVE Cricket ScoreDROPPED! Sanju Samson spills a chance at mid off in the second delivery of the chase as Pathum Nissanka is droped on 0 off Hardik Pandya's bowling. Nissanka got a leading edge while looking to play this towards the leg side, chipping it over the bowler's head. Samson ended up covering more ground in his dive than was necessary, collecting the ball close to the body only for it to pop out after his elbows hit the ground. SL 2/020:49 (IST)India vs Sri Lanka LIVE ScorePathum Nissanka and Kusal Mendis make their way to the centre at the start of Sri Lanka's chase of the 163-run target. And it's skipper Hardik Pandya who will open the bowling for the hosts today.20:46 (IST)The Indians will have to bowl out of their skins to defend 162 at a wicket as batting-friendly as WankhedeNot enough runs, especially at the Wankhede. India will have to bowl supremely well to make a game of this.— Harsha Bhogle (@bhogleharsha) January 3, 202320:45 (IST)Hooda will have gained a few more fans after his knock tonightWankhede cheers 'HOODA, HOODA' after he hits a SIX! #INDvSL #CricketTwitter pic.twitter.com/BNaOfqA4DL— Sameer Allana (@HitmanCricket) January 3, 202320:44 (IST)IND vs SL LIVE Cricket ScoreAfter 20 overs,India 162/5 ( Deepak Hooda 41 , Axar Patel 31)Hooda and Axar collect 28 runs in the last two overs, with Kasun Rajitha conceding 13 off the last over to finish wicketless for 47 runs as Team India post 162/5 on the board after being invited to bat by Sri Lanka in the first T20I!Credit to Hooda and Axar for giving the Men in Blue a semblance of hope, smashing 61 runs in the last five overs and stitching an unbroken 68-run stand in the end. Had it not been for those two, the Men in Blue might have found it tough to even cross 140.20:37 (IST)IND vs SL 2023 LIVE ScoreSIX! Was an attempted slower one from Rajitha that Hooda picked perfectly, smashing it over the bowler's head for a straight six in the third delivery of the final over! IND 157/5  20:35 (IST)India vs Sri Lanka 2023 Live ScoreThe fifty partnership comes up between Deepak Hooda and Axar Patel — the first of this game — for the sixth wicket, the latter bringing up the milestone with a brace off Madushanka in the penultimate over. Just 29 balls is all it has taken for this pair to go past 50, giving India a much-needed boost late in the innings. IND 145/520:30 (IST)India vs Sri Lanka LIVE Cricket ScoreAfter 18 overs,India 134/5 ( Deepak Hooda 29 , Axar Patel 16)Hooda collects a third six for himself, once again smashing the ball into the stands beyond the midwicket fence off Hasaranga's final ball of the evening as the leg-spinner finishes with figures of 1/22. Southpaw Axar then launches the ball over Kasun Rajitha's head in the following over, collecting his first boundary in the process. 16 collected off the last two overs, with more to go in the Indian innings. Can the Men in Blue cross 160 from here? Stay tuned to find out.20:23 (IST)India vs Sri Lanka LIVE ScoreAfter 16 overs,India 118/5 ( Deepak Hooda 20 , Axar Patel 9)Deepak Hooda smashes consecutive maximums off Maheesh Theekshana, both landing in the stands beyond the midwicket fence, in the off-spinner's final over to give the Men in Blue a much-needed boost following the procession in the middle overs. Four more overs to go after this, and Hooda and Axar will hope to score at more than 10-an-over to get their side past the 160-mark.20:19 (IST)Sri Lanka vs India 2023 LIVE ScoreOUT! Skipper Hardik Pandya is the latest to fall, getting caught-behind off a well-directed short-of-length delivery from Dilshan Madushanka that is too close to the body for a cut, resulting in a faint nick to the keeper. The Men in Blue have now lost half their side with less than 100 on board and with less than six overs left. IND 94/5Pandya c Mendis b Madushanka 29(27)20:14 (IST)Sri Lanka vs India Live ScoreAfter 14 overs,India 94/4 ( Hardik Pandya (C) 29 , Deepak Hooda 6)Couple of tidy overs from the seamers with Theekshana and Hasaranga not allowing Pandya and Hooda to collect anything more than singles. Eight collected in the last two overs, and India are yet to breach the 100-mark with six oves left in the innings.20:06 (IST)IND vs SL 1st T20I LIVE ScoreAfter 12 overs,India 86/4 ( Hardik Pandya (C) 24 , Deepak Hooda 3)FOUR! Slower ball from Chamika Karunaratne gone wrong, as Hardik Pandya simply waits for the ball to climb before swatting it past the keeper to collect his fourth boundary. Eight off the over. Meanwhile, all-rounder Deepak Hooda joins Pandya at the centre following Kishan's dismissal in the previous over.20:00 (IST)IND vs SL LIVE Cricket ScoreOUT! Huge breakthrough for the Sri Lankans as all-rounder Wanindu Hasaranga gets the key wicket of Ishan Kishan, who had been looking dangerous until now. The southpaw goes for a slog sweep off a wrong 'un from Hasaranga, and doesn't quite get the distance while looking to clear the boundary on the leg side. Dhanajaya de Silva grabs this right in front of the boundary rope. IND 77/4Kishan c de Silva b Hasaranga 37(29)19:56 (IST)IND vs SL 2023 LIVE ScoreAfter 10 overs,India 75/3 ( Ishan Kishan (W) 36 , Hardik Pandya (C) 17)Rajitha returns to the attack in the 10th over, and once again he bleeds runs as Kishan smashes a six and a four off consecutive balls, targetting the off side, giving India a much-needed release after the slowdown that accompanied the fall of three wickets in quick succession.19:47 (IST)India vs Sri Lanka 2023 Live ScoreAfter 8 overs,India 58/3 ( Ishan Kishan (W) 24 , Hardik Pandya (C) 12)Skipper Hardik Pandya wastes little time after arriving at the crease following Samson's departure, smashing consecutive fours at the start of Chamika Karunaratne's second over! 11 off the over.19:44 (IST)India vs Sri Lanka 1st T20I Live ScoreOUT! India have now lost three wickets for just 19 runs as Sanju Samson departs for 5, just two deliveries after getting dropped at deep midwicket. Looks to smash the delivery pitched along the off stump towards the leg side, but ends up getting a thick leading edge, resulting in a simple catch for Dilshan Madushanka at short third man. IND 46/3Samson c Madushanka b De Silva 5(6)19:39 (IST)India vs Sri Lanka LIVE Cricket ScoreAfter 6 overs,India 41/2 ( Ishan Kishan (W) 23 , Sanju Samson 1)End of what turned out to be a mixed powerplay for Team India. After the 17-run first over by Kasun Rajitha, Sri Lanka stage a fightback with Maheesh Theekshana and Chamika Karunaratne dismissing Shubman Gill and Suryakumar Yadav respectively. Karunaratne's introduced in the final over of the powerplay and he's starts off by dismissing vice-captain Surya off his first ball, and conceding just three from the over.19:31 (IST)India vs Sri Lanka LIVE ScoreOUT! SKY departs without making much of an impact in his first outing as the India T20I vice-captain as Chamika Karunaratne strikes off his first ball of the evening! Yadav shuffles to his right, looking to ramp this over fine leg, but ends up miscuing it to get caught by the man stationed at short fine. IND 38/2Yadav c Rajapaksa b Karunaratne 7(10)19:26 (IST)Sri Lanka vs India 2023 LIVE ScoreAfter 4 overs,India 34/1 ( Ishan Kishan (W) 20 , Suryakumar Yadav 5)FOUR! Vice-captain Suryakumar Yadav doesn't take long to collect his first boundary, producing a solid punch that beats the diving extra cover fielder and runs all the way to the fence. Is a tidy second over from Madushanka otherwise, with just one run coming off it besides the boundary.19:22 (IST)Sri Lanka vs India Live ScoreOUT! Maheesh Theekshana breaks the opening stand as Shubman Gill is trapped leg-before for 7 on his T20I debut! It's the carrom ball from Theekshana that does the trick, with Gill missing while attempting a pull and getting hit on the thigh in front of off. Height could've been a factor here, and Gill does go for the review, but the ball is shown to be hitting, and not clipping, between off and middle. IND 27/1Gill LBW Theekshana 7(5)19:17 (IST)IND vs SL 1st T20I LIVE Score FOUR! First runs off Shubman Gill's bat in T20I cricket, as the debutant unleashes a cover drive to get off the mark off Dilshan Madushanka. IND 22/0Preview: Team India will hope to get off to a winning start in 2023 when they take on Sri Lanka in the first of three T20Is at the Wankhede Stadium in Mumbai on Tuesday.For India, it will also mark the beginning of a new era with the BCCI having named all-rounder Hardik Pandya as the captain for the series, ignoring the senior trio of Test and ODI skipper Rohit Sharma, former captain Virat Kohli as well Rohit’s opening partner KL Rahul.India have had a mixed run across formats since their semi-final exit from the T20 World Cup at the hands of eventual champions England, winning the T20I series in New Zealand 1-0 but losing the one-dayers by a similar margin. They would then lose yet another ODI series in Bangladesh after back-to-back defeats in Dhaka, but would end the year on a high with a 2-0 sweep of the Test series against the Tigers.Sri Lanka, on the other hand, have not had much cricketing action in recent months, playing a three-match ODI series against Afghanistan at home besides the Asia Cup and the T20 World Cup with the Dasun Shanaka-led side winning the former after beating Pakistan in the final.Squads:India: Hardik Pandya (c), Suryakumar Yadav (vc), Ishan Kishan (wk), Ruturaj Gaikwad, Shubman Gill, Deepak Hooda, Rahul Tripathi, Sanju Samson, Washington Sundar, Yuzvendra Chahal, Axar Patel, Arshdeep Singh, Harshal Patel, Umran Malik, Shivam Mavi, Mukesh Kumar.Sri Lanka: Dasun Shanaka (c), Wanindu Hasaranga (vc), Pathum Nissanka, Avishka Fernando, Sadeera Samarawickrama, Kusal Mendis, Bhanuka Rajapaksa, Charith Asalanka, Dhananjaya de Silva, Ashen Bandara, Maheesh Theekshana, Chamika Karunaratne, Dilshan Madushanka, Kasun Rajitha, Dunith Wellalage, Pramod Madushan, Lahiru Kumara, Nuwan Thushara.Venue: Wankhede Stadium, Mumbai.Time: 7 pm IST.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-03 17:37:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Hardik-Pandya-Dasun-Shanaka-IND-SL-1st-T20I-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE | Australia v South Africa: Third Test, Day 1 – Wednesday, 4 January 2023","link":"https://www.thesouthafrican.com/sport/cricket/proteas/live-australia-south-africa-third-test-result-day-1-wednesday-4-january-2023-breaking/","keywords":["Proteas","Featured","Important","latest cricket news","Proteas in Australia"],"creator":["Garrin Lambley"],"video_url":null,"description":"Follow the action LIVE from the third and final Test between Australia and South Africa from the Sydney Cricket Ground.","content":"A series touted to be one of the best didn’t take much to fizzle out as Australia outclassed South Africa in Brisbane (six wickets) and Melbourne (innings and 182 runs) to take an unassailable 2-0 lead in the series. ALSO READ | WHEN DOES THE 3RD AUSTRALIA V PROTEAS TEST START? Can the visitors pick things up and show their true colours when the series winds up with the third Test in Sydney starting from Wednesday? The first delivery is due at 01:30 (SA time). So much remains at stake with crucial World Test Championship (WTC) points being on the line. Australia have consolidated their top position (78.57%) and are near-certainties to make the finals, with a win here probably enough to book their place in the final even if they lost 0-4 in their upcoming tour of India. ALSO READ | RUSSELL DOMINGO QUITS AS BANGLADESH COACH Meanwhile, South Africa have seen their position drop from second to fourth (50%) during the series and are now clutching to their chances by the barest of margins. Australia showed no signs of letting the energies dwindle as David Warner celebrated his 100th Test with a phenomenal 200, keeping the South African speedsters as well as the extreme temperatures at bay, whilst there was no let off for the visitors as Alex Carey brought up his maiden Test hundred. The icing of the cake, though, was the way the Aussie bowlers overcame injuries in the second innings as Mitchell Starc and Cameron Green braved extremities to bring up an excellent victory. ALSO READ | FARHAAN BEHARDIEN CALLS STUMPS ON PLAYING CAREER It has come at a cost however, as Green and Starc were ruled out of the Sydney Test with Matt Renshaw and Ashton Agar added to the squad. It would be interesting to see how Australia will balance their playing XI as Green’s multidimensional skills do not have a direct replacement. There could be a case for Renshaw in the middle-order to see if he can find a place on the flight to India. Australia haven’t shown their cards yet and even Lance Morris – arguably the fastest bowler in the country – could play ahead of Josh Hazlewood. WATCH | ANRICH NORTJE RESPONDS TO SPIDERCAM INCIDENT While Australia struggles to balance their riches, South Africa have an uphill battle finding the right men to take them to battle. For a proud nation that has won three successive series victories in Australia, South Africa’s first away head-to-head series loss since 2005/06 left their WTC final hopes crushed. The Proteas will now have to win the final match to stay in contention, but on the evidence of what was seen this summer, that remains a dream! South Africa avoided getting bowled out for under 200 for an eighth successive innings in Melbourne but having batted 48.2, 37.4, 68.4 and 68.5 overs, it may need more than a New Year drink to wash away their batting troubles. ALSO READ | DAVID WARNER’S MANAGER MAKES SHOCK NEW CLAIM ABOUT ‘SANDPAPER-GATE’ Thankfully for Dean Elgar, his bowlers have stepped up. The trio of Kagiso Rabada, Anrich Nortje and Marco Jansen have been more than a handful and deserve a few more runs from their batters. With batter Theunis de Bruyn set to miss this Test to return home for the birth of his first child, there could be a second chance for Rassie van der Dussen at three, or a chance for Heinrich Klaasen to lead their redemption. As is custom with every Test in Sydney, the stands will be pink (to raise millions of dollars for breast cancer research and support) and the skies will at some stage be grey. Showers and storms could mar Wednesday’s opening day and return on Thursday, but the annual ‘Jane McGrath Day’ on day three – and the remainder of the match thereon – is expected to be unaffected by weather. AUSTRALIA V SOUTH AFRICA Players to watch Marnus Labuschagne has failed to cross 14 in three previous innings against South Africa, but has scored at least 59 in four of his last six Test innings at this venue. South Africa’s batting beacon has been Temba Bavuma , who at 40.07 was their only batter to average more than 40 in Tests played during 2022. He had three starts in this series (38, 29 & 65) but will be itching to score something substantial and probably not get involved in run-outs as he did in Melbourne, particularly as one of only two men in history to accumulate at least 20 Test fifties with no more than one career ton. Stat attack The historical average first innings score at this venue is 318 which increases to 424 over the last 10 Tests. Australia haven’t lost a Sydney Test since 2011 (W6, D5 hence) but three of their last four Tests at the SCG have ended in draws.","pubDate":"2023-01-03 17:20:31","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","country":["south africa"],"category":["sports"],"language":"english"},{"title":"BCCI invites tender for right to own teams in Women’s IPL","link":"https://www.orissapost.com/bcci-invites-tender-for-right-to-own-teams-in-womens-ipl/","keywords":["Sports","bcci","Women's IPL"],"creator":["Post News Network"],"video_url":null,"description":"Mumbai: The Board of Control for Cricket in India (BCCI) Tuesday issued a tender inviting interested parties to own and operate teams in the inaugural edition of the Women’s Indian Premier League (WIPL). The inaugural season of the Women’s IPL is likely to be held from March 3 to 26, just before the men’s IPL. […]","content":"Mumbai: The Board of Control for Cricket in India (BCCI) Tuesday issued a tender inviting interested parties to own and operate teams in the inaugural edition of the Women’s Indian Premier League (WIPL). The inaugural season of the Women’s IPL is likely to be held from March 3 to 26, just before the men’s IPL. ”Board of Control for Cricket in India (BCCI) announces release of Invitation to Tender for the right to own and operate a team in Women’s Indian Premier League,” the Indian cricket board said in a statement. ”The Governing Council of the IPL invites bids from reputed entities to acquire the right to own and operate a team in Women’s Indian Premier League, through a tender process,” it added. The ITT will be available for purchase for a non-refundable fee of Rs five lakh till January 21, 2023. ”Any interested party wishing to submit a bid is required to purchase the ITT. However, only those satisfying the eligibility criteria set out in the ITT and subject to the other terms and conditions set out therein shall be eligible to bid. It is clarified that merely purchasing this ITT does not entitle any person to bid,” the statement further said. The BCCI also said that it reserves the right to cancel or amend the bidding process at any stage in any manner at its discretion. However, it did not inform about the bids for how many teams will be entertained. IANS","pubDate":"2023-01-03 16:24:11","image_url":"https://www.orissapost.com/wp-content/uploads/2022/07/BCCI-300x169.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Selectors Shuffle: Is Indian Cricket Ready to Bring in Fresh Energy?","link":"https://www.firstpost.com/firstcricket/sports-news/selectors-shuffle-is-indian-cricket-ready-to-bring-in-fresh-energy-11923022.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"Selectors Shuffle: Is Indian Cricket Ready to Bring in Fresh Energy?","content":"If BCCI’s invitation of applications for men’s senior selectors looked like a step forward after the disappointing show at two T20 World Cups and Asia Cup 2022, the likely decision to retain faces from the old panel is definitely two steps back and begs us to question whether Indian cricket is ready to bring in fresh energy.After the semi-final defeat to England at the 2022 T20 World Cup, heads were expected to roll in the Indian cricket set-up and selectors became the first casualty. A sense of urgency to steer the ship in the right direction ahead of two World Cups – 50-over WC in 2023 and 20-over WC in 2024 – was the need of the hour and strong decisions were needed to restore order. Selection matters, which had coped a lot of flak in the last 24 months, were a concern and needed immediate attention. Attention was paid but the entire exercise now wears a pointless look with Chetan Sharma, chairman of the previous selection panel, and Harvinder Singh set to feature in the new panel.“Not good for Indian cricket,” was the short and strong-worded response from a former Indian cricketer, who had also applied for the selector’s job, to reports of Chetan and Harvinder featuring in the new selection panel.Is the BCCI not ready to inject fresh energy, which is need of the hour, yet? https://t.co/D6JbzU1TU4— Sahil Malhotra (@Sahil_Malhotra1) January 3, 2023 If the top brass was satisfied with the performance of Chetan and Harvinder, why were fresh applications invited in the first place? Or is the Indian cricket board not ready to inject fresh energy, which is the need of the hour, yet?Same old story?In the last 24 months, India have managed to field two sides for different formats parallelly, have dominated bilaterals – home and away – but struggled to put together a winning squad for multi-nation events like the T20 World Cup and Asia Cup. The real Test is yet to happen in the upcoming Border Gavaskar Trophy against Australia as the current regime hasn’t had many challenging away assignments, unlike their predecessors.If the dotted lines are signed on the panel doing rounds, the next 24 months are expected to be no different and we could well have faces who picked 2021, and 2022 WC sides picking the squads for the upcoming 50-over and 2024 World Cup. Very little had changed from the team which played the 2021 World Cup to the one which exited the 2022 World Cup in the semis stage. The safe approach, right from the top three to the composition of the squad, was very much visible and reputation preceded performance.Not to forget the manner in which the Virat Kohli captaincy episode unfolded.If Hardik Pandya is going to lead the T20I side and Rohit Sharma will be in charge of the Test and ODI set-up, why was a similar arrangement shot down when Kohli wanted to continue as ODI and Test captain after giving up T20I captaincy? Yes, it was difficult to ignore Rohit Sharma’s exploits as captain of Mumbai Indians but Kohli giving up Test captaincy was the biggest loss to Indian cricket in the last couple of years. And the BCCI could well find itself in a tough situation when they look for Rohit’s successor in the longest format of the game.The Big PictureIt’s not just the World Cups or the World Test Championship but the direction in which Indian cricket is headed at the moment. Has the Cricket Advisory Committee addressed the big picture? Whether the transition to the next-gen would be seamless with the old faces? Whether the newer faces would be able to address the numerous elephants in the room?The members of the CAC, when reached out, were not willing to comment on the developments till the official announcement is made. When contacted, Jatin Paranjpe, a member of the CAC, said he will not be able to comment on the matter or the interview process.Interview Questions For Selectors: Rohit’s Successor, Pant’s Replacement, ODI WC Team CombinationRemuneration not enough to entice the big names?Over the years, there have been talks of the selectors not having the stature to put up a strong front in front of the team management on selection matters. A top official of the board, however, didn’t agree with the whole stature debate and felt someone like Chetan has played and seen enough cricket.“Chetan Sharma doesn’t have stature? He has played over 20 (23) Tests, 60 (65) ODIs, and over 100 (121) First Class games. He doesn’t have stature?” a top BCCI official said.The board, however, has to fall back on the older generation because of the late retirements announced by many players who haven’t played for India in a long time but announced retirement very recently.“We are helpless there. Someone like RP Singh and Pragyan Ojha last played for India years back but announced their retirement very recently. Even if we want to consider them, we won’t be able to,” the official added.Additionally, many of the established faces are either contracted by IPL teams, who are paying them a handsome salary or are making a lot of money with commentary gigs. So is the BCCI remuneration package enticing enough to have these former cricketers on board?“I have applied but would need to see what they offer if I am interviewed. I am doing a lot of commentary and 2.5-3K USD is the standard market rate per match at the moment. So to let that go for selector job, there has to be enough on the table,” a former India cricketer and now a famous commentator had said.The current IPL set-up too has made life difficult for the Indian cricket board as the teams are ready to shed top dollar for the best available resources. For instance, the talent scouts and coaches are paid sums similar to what an Indian selector would get and the IPL stint allows them to retain their television gigs.“Money is there in the IPL contracts but there is also a sense of flexibility to what we can pursue outside of it,” said a former cricketer.Specialist approach for T20sIt’s going to be the same old story if the T20 format is not treated exclusively, as a different beast.The cricketing ecosystem continues to evolve around the world and the impact of the shortest format is having its say even on the way Test cricket is being played at the moment.There is definitely a need to address the format exclusively, and differently. The state-fed selection panel could continue to meet the demands of 50-over and Test format but T20s need a different approach.Maybe draw a leaf out of IPL’s playbook and how the scout machinery operates for the cash-rich league and continues to unearth talents from the remotest corners of the country.In a format that allows very little recovery or comeback time, coaching is extremely irrelevant. A man-managing approach is what the format demands. Something which the IPL has tabled for the world to see.With so many fixtures happening around the country, the role of data, analytics, and numbers outweighs the traditional mindset and approach.The next 24 months are very important for Indian cricket with a packed calendar, across formats. From captaincy to the selection, clear calls are needed to ensure seamless transition and domination at multi-nation events. The selector shuffle has raised more questions than answers, and the reluctance to inject fresh energy is very much visible.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-03 16:06:09","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/BCCI-top-brass.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI invites bids to own IPL teams","link":"https://economictimes.indiatimes.com/news/sports/bcci-invites-bids-to-own-ipl-teams/articleshow/96717396.cms","keywords":null,"creator":null,"video_url":null,"description":"\"Board of Control for Cricket in India (BCCI) announces release of Invitation to Tender for the right to own and operate a team in Women's Indian Premier League,\" the board said in a statement.","content":null,"pubDate":"2023-01-03 15:24:19","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-11478,resizemode-4,msid-96717396/bcci-invites-bids-to-own-ipl-teams.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Former BCCI president Sourav Ganguly to join Delhi Capitals as Director of Cricket","link":"https://www.thehindu.com/sport/cricket/former-bcci-president-sourav-ganguly-to-join-delhi-capitals-as-director-of-cricket/article66334731.ece","keywords":null,"creator":["\n         PTI  \n    "],"video_url":null,"description":"Ganguly was the mentor of Delhi Capitals during his stint with the franchise in 2019","content":null,"pubDate":"2023-01-03 15:21:17","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI releases invitation to tenders to own and operate women’s IPL franchises","link":"https://www.firstpost.com/firstcricket/sports-news/bcci-releases-invitation-to-tenders-to-own-and-operate-womens-ipl-franchises-11922822.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"BCCI releases invitation to tenders to own and operate women’s IPL franchises","content":"The Governing Council of the Indian Premier League (IPL) invited bids for rights to own and operate a women’s IPL team from reputed entities through a tender process on Thursday.The BCCI had earlier announced that 2023 will have a full-fledged women’s IPL in place with five teams.Read | Women’s IPL to begin on 3 MarchA ₹5 lakh non-refundable fee is required to be paid to access the Invitation to Tender (ITT), which will be available for purchase till 21 January 2023.The BCCI media release mentioned, “the detailed terms and conditions governing the tender process including eligibility requirements, process for submissions of bids, proposed team’s rights and obligations, etc. are contained in the ‘Invitation to Tender’ (“ITT”) which will be made available on receipt of payment of a non-refundable fee of INR 5,00,000 plus any applicable Goods and Services Tax.”The press release also made clear that only eligible entities will be allowed to bid for a franchise.“Any interested party wishing to submit a bid is required to purchase the ITT. However, only those satisfying the eligibility criteria set out in the ITT and subject to the other terms and conditions set out therein shall be eligible to bid. It is clarified that merely purchasing this ITT does not entitle any person to bid.”BCCI Sets The Bar: Base Price For Women’s IPL Franchise Will be Rs 400 CroreAccording to the media release, Indian as well as foreign entities are allowed to purchase the ITT.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-03 14:45:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Womens-IPL.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka: Shivam Mavi and Shubman Gill make T20I debuts as Men-in-Blue field 100th T20I player","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-sri-lanka-shivam-mavi-and-shubman-gill-make-t20i-debuts-as-men-in-blue-field-100th-t20i-player-11922582.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka: Shivam Mavi and Shubman Gill make T20I debuts as Men-in-Blue field 100th T20I player","content":"Shivam Mavi and Shubman Gill were handed their maiden T20 cap on Tuesday as Hardik Pandya played his first game as full-time T20 captain of the India team, facing Sri Lanka in the first T20I in Mumbai. They also became the 100th and 101st cricketer to wear T20I cap for India.While Gill was an obvious choice with Virat Kohli, Rohit Sharma and KL Rahul out of T20 setup, Mavi got his maiden opportunity with pacer Arshdeep Singh yet to be match fit.“Arshdeep Singh wasn’t available for selection for the 1st T20I against Sri Lanka since he has still not fully recovered from his illness,” tweeted the BCCI after the toss.Mavi recently earned his maiden India call-up as BCCI picked him for the T20 series a week after he was sold for Rs 6 crore to Gujarat Titans at the IPL mini-auction in Kochi.Following his selection, Mavi said he knew his time has come when he learned of his selection from his Ranji teammates.“When we play domestic games, we normally hit the bed early to get proper rest,” Mavi told ESPN Cricinfo. “But that day, because I heard the team was about to be announced, I was sitting in Saurabh [left-arm spinner Saurabh Kumar] bhaiyya’s room with Samarth [Singh]. As soon as I learnt of my selection, for a split second, everything came to a standstill. It was an amazing feeling. I was emotional, but I knew my time had come.”Read more: ‘I knew my time had come,’ says Shivam MaviGill, on the other hand, is not a novice to international cricket as he already has 13 Tests and 15 ODIs for India with the 23-year-old opener’s international debut coming back in 2019 against New Zealand in an ODI game away. Gill scored 2 international centuries and eights before earning T20 debut.Teams: India: Ishan Kishan (w), Shubman Gill, Suryakumar Yadav, Sanju Samson, Hardik Pandya(c), Deepak Hooda, Axar Patel, Harshal Patel, Shivam Mavi, Umran Malik, Yuzvendra Chahal.Sri Lanka: Pathum Nissanka, Kusal Mendis(w), Dhananjaya de Silva, Charith Asalanka, Bhanuka Rajapaksa, Dasun Shanaka(c), Wanindu Hasaranga, Chamika Karunaratne, Maheesh Theekshana, Kasun Rajitha, Dilshan Madushanka.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-03 14:22:57","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Shubman-Gill-India-vs-Sri-Lanka-1st-T20.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"No Pakistan T20 selection without a strike rate of 135 at least: Shahid Afridi","link":"https://www.firstpost.com/firstcricket/sports-news/no-pakistan-t20-selection-without-a-strike-rate-of-135-at-least-shahid-afridi-11922172.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"No Pakistan T20 selection without a strike rate of 135 at least: Shahid Afridi","content":"Pakistan cricket team’s interim chief selector Shahid Afridi said that batters with a strike rate lower than 135 won’t be considered as far as T20 selection is concerned.The former all-rounder, who was known for his explosive batting back in his playing days, said domestic batters must score at a strike rate above 135 in order to earn a national team call-up in the shortest format.“No batter in T20 will be selected for Pakistan who will not have a strike rate of more than 135 in domestic cricket,” Afridi told Samaa TV.Also read: PCB chief selector Shahid Afridi adds three bowlers to hosts’ squadThe comment comes at a time when two of Pakistan’s prolific run-scorers in Babar Azam and Mohammad Rizwan are often blamed for scoring runs at a low strike rate.PCB chief Najam Sethi later backed Afridi’s comment saying he can take any bold decision he wants to as a national selctor.“He’s very popular, he’s the sort of person we want in the selection committee who can take bold decisions,” said Sethi.“Afridi was on board, he wanted to make some changes and he wanted the team to play bold and exciting cricket. We are not going to play to win or to lose, but we are now going to play the game in the true spirit.”Afridi earlier was appointed as the interim chairperson of the men’s national selection Committee by The Pakistan Cricket Board (PCB) for the home series against New Zealand.Abdul Razzaq and Rao Iftikhar Anjum will also be part of the panel while Haroon Rashid (member Management Committee) will be the convener.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-03 13:23:34","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Shahid-Afridi.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"चीफ सेलेक्‍टर शाहिद अफरीदी ने अपने दामाद शाहीन पर भी कर दिया तंज..कहा, दोस्‍ती-यारी चल…","link":"https://hindi.news18.com/news/sports/cricket-pakistan-fast-bowlers-shaheen-afridi-and-haris-rauf-started-rehab-5156045.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"पाकिस्‍तान क्रिकेट टीम (Pakistan Cricket Team) का अंतरिम चीफ सेलेक्‍टर बनने के बाद शाहिद अफरीदी (Shahid Afrifdi) फुल फॉर्म में हैं. चंद दिनों में भी उन्‍होंने टेस्‍ट से लेकर वनडे टीम में कई बदलाव कर डाले. टी20 टीम के लिए भी एक फरमान जारी कर दिया.","content":null,"pubDate":"2023-01-03 12:39:09","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/12/Shaheen-afridi-shahid-afridi-16720557533x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Fit-again Jasprit Bumrah added to India squad for ODI series against Sri Lanka","link":"https://www.orissapost.com/fit-again-jasprit-bumrah-added-to-india-squad-for-odi-series-against-sri-lanka/","keywords":["Sports","Top Stories","India","Jasprit Bumrah","KL Rahul","odi","rohit sharma","suryakumar yadav","virat kohli","world cup"],"creator":["Post News Network"],"video_url":null,"description":"Mumbai: Star pacer Jasprit Bumrah was Tuesday added to India’s ODI squad for the three games against Sri Lanka. This decision was taken after the National Cricket Academy (NCA) declared Jasprit Bumrah fit for home series against Sri Lanka beginning January 10. Bumrah last played for India in September and had also missed the T20 […]","content":"Mumbai: Star pacer Jasprit Bumrah was Tuesday added to India’s ODI squad for the three games against Sri Lanka. This decision was taken after the National Cricket Academy (NCA) declared Jasprit Bumrah fit for home series against Sri Lanka beginning January 10. Bumrah last played for India in September and had also missed the T20 World Cup in Australia due to a back injury. “The all-India senior selection committee has included pacer Jasprit Bumrah in India’s ODI squad for the upcoming three-match ODI series against Sri Lanka,” the BCCI said in a release. “The pacer has undergone rehabilitation and has been declared fit by the National Cricket Academy (NCA). He will be joining the Team India ODI squad soon,” the BCCI added. The first ODI will be played January 10 in Guwahati, second in Kolkata January 12 and third in Trivandrum January 15. With the focus on 50-over cricket in an ODI World Cup year, it is unlikely that Bumrah will feature in the shortest format till the ICC event at home in October-November. His IPL workload too would be monitored closely by the NCA, as well as other ‘targetted’ India players for the ODI World Cup. One of the best in the business, Bumrah is vital to India’s chances at the mega event as they look to win the coveted trophy for the second time at home after 2011. Having made his India debut in 2016, the 29-year-old Bumrah has represented India in 30 Tests, 72 ODIs and 60 T20Is. Experts including the great Michael Holding find Bumrah injury-prone as he generates serious pace with a short-run up. “My problem with Bumrah, and I mentioned it to him when last time I saw him in England, is how long that body will hold up with that short run and the amount of effort he has to put into in his bowling, it is a human body. It is not a machine,” Holding had said back in 2020. India’s updated squad for Sri Lanka ODIs: Rohit Sharma (captain), Shubman Gill, Virat Kohli, Suryakumar Yadav, Shreyas Iyer, KL Rahul (wicket-keeper), Ishan Kishan (wicket-keeper), Hardik Pandya, Washington Sundar, Yuzvendra Chahal, Kuldeep Yadav, Axar Patel, Jasprit Bumrah, Mohammad Shami, Mohammad Siraj, Umran Malik and Arshdeep Singh.  ","pubDate":"2023-01-03 12:28:35","image_url":"https://www.orissapost.com/wp-content/uploads/2023/01/Bumrah-300x175.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Zampa’s Mankad fail backfires as coach fumes","link":"https://www.themercury.com.au/sport/cricket/zampas-mankad-attempt-given-notout-by-umpires/news-story/b0cc1a8359a033ee05c78151af13b78e","keywords":["Big Bash News","Cricket news and galleries"],"creator":null,"video_url":null,"description":"Melbourne Stars captain Adam Zampa unsuccessfully attempted to Mankad the Renegades’ Tom Rogers in a heated local derby at the MCG on Tuesday night which the Renegades convincingly won by 33 runs.","content":"With the third-last ball of the Renegades’ final over, as he was coming into bowl, Zampa caught Rogers out of his crease and without hesitation took the bails off.After conferring with the umpire, Zampa was determined to have Rogers dismissed if the third umpire deemed Rogers to be out.But the TV replay showed Zampa’s arm went past the vertical in his bowling action, so Rogers survived before exchanging a few angry words with Zampa.The Renegades fans expressed their displeasure by booing Zampa on multiple occasions, and repeated the dose when he came back out to bat late in the match.Stars coach David Hussey later told Fox Sports that had Rogers been given out, the Stars would’ve asked for the decision to be reversed because it’s not the way he wants to play cricket.The move backfired on Zampa spectacularly because after the Renegades trudged to a modest 7-141, their wicketkeeper Sam Harper told the broadcast that Rogers came into the rooms “fuming” at the Mankad attempt.Rogers then proceeded to take career-best figures of 5-16 from his four overs, which was also the best bowling performance in Renegades history, as the Stars were held to their third-lowest total of 9-108 in front of 38,564 fans - the second-biggest crowd of the BBL season so far.Zampa Mankad pollA fired-up Rogers effectively channelled his anger almost immediately when he bowled Joe Clarke for a golden duck with the second ball of the Stars’ innings.He then sent Beau Webster (eight) and namesake Tom Rogers (one) packing in the third over to rip through the Stars’ top order and by the time Will Sutherland had Marcus Stoinis (six) caught behind, the Stars were floundering at 4-18 in the fifth over.Rogers struck again at the crucial time in the 11th over, just when the Stars looked like mounting a recovery, as he dismissed Hilton Cartwright (20 off 21 balls), after he put on 39 for the fifth wicket with Nick Larkin (48 not out off 40), which proved to be a mortal blow.Mujeeb Ur Rahman also played a key role for the men in red and was basically unplayable, finishing with a magnificent 2-7 from four, including a maiden.","pubDate":"2023-01-03 12:13:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"BBL: Adam Zampa runs out batter at non-striker’s end, third umpire says Not Out","link":"https://www.firstpost.com/firstcricket/sports-news/bbl-adam-zampa-runs-out-batter-at-non-strikers-end-third-umpire-says-not-out-11921232.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"BBL: Adam Zampa runs out batter at non-striker’s end, third umpire says Not Out","content":"Melbourne Stars skipper Adam Zampa ran Melbourne Renegades batter, Tom Rogers, out at the non-striker’s end in the last over of the first innings, but the third umpire made the decision in favour of the batter after checking a key aspect of the rule, at the MCG on Tuesday.The Big Bash League saw yet another dramatic and spicy incident after Michael Nesser’s catch at the long off boundary – still fresh in the memories – led to a serious debate.Zampa was into his bowling action as Mackenzie Harvey was prepared to face him. Zampa rotated his arm, but kept the ball in his hand and did not bowl as he saw Rogers lurking quite far outside the crease.The leg-spinner was quite confident of the run-out, but the on-field umpire went to the third umpire to confirm. The umpire subsequently informed Zampa that he had rolled his arm over before enabling the run-out.“Third umpire to director, we gonna check whether the bowler’s arm passed the vertical, that satisfies the law for run-out at the bowler’s end,” the third umpire was heard on the broadcast.After going through the replays, the TV umpire stated, “Now, his arm has gone past the vertical, therefore, Not Out.”Check the video here:Spicy, spicy scenes at the MCG.Not out is the call…debate away, friends! #BBL12 pic.twitter.com/N6FAjNwDO7— KFC Big Bash League (@BBL) January 3, 2023 Law 38.3.1 for run out at non-striker’s end states, “If the non-striker is out of his/her ground at any time from the moment the ball comes into play until the instant when the bowler would normally have been expected to release the ball, the non-striker is liable to be Run out. In these circumstances, the non-striker will be out Run-out if he/she is out of his/her ground when his/her wicket is put down by the bowler throwing the ball at the stumps or by the bowler’s hand holding the ball, whether or not the ball is subsequently delivered.”Former Australia speedster Brett Lee is not in favour of run-out at the non-striker’s end and made his stand clear on Fox while broadcasting.“If he goes past where he’s meant to let go of the ball there…it’s deemed you can’t actually Mankad the batsman. Listen, I don’t like that rule, I don’t like the Mankad rule whatsoever, I reckon they should take it out of their hands.”🤮🤮 https://t.co/yWCrfTnSpn— Liam Livingstone (@liaml4893) January 3, 2023 He further opined, “The best way to do it is to say to the batsman, if you leave your crease, you get docked five runs. Take it away from the bowler… I just don’t like seeing that in the game of cricket.”Stars head coach David Hussey said that even if it was given out, we would have withdrawn our appeal.“Spoke to Zampa already and he said, had it been given out, we would have withdrawn our appeal. It’s not the right way to play cricket.”“If it had’ve been given out we would’ve withdrawn our appeal.”🤔🤔🤔 #BBL12 pic.twitter.com/hxA1EVGWMO— KFC Big Bash League (@BBL) January 3, 2023The Renegades ended their innings at 141 in 20 overs.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-03 12:12:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Adam-Zampa-runout.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Gades make light work of Stars","link":"https://www.themercury.com.au/sport/cricket/gades-make-light-work-of-stars/video/e26a437407293ab1306fe15d5a2e4dc6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Catch all the action from the Melbourne derby in the BBL as it was an eventful affair at the MCG.","content":"Cricket: Catch all the action from the Melbourne derby in the BBL as it was an eventful affair at the MCG.","pubDate":"2023-01-03 12:00:20","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Jasprit Bumrah to make comeback in ODI series against Sri Lanka, confirms BCCI","link":"https://zeenews.india.com/cricket/breaking-jasprit-bumrah-to-make-comeback-in-odi-series-against-sri-lanka-confirms-bcci-2557216.html","keywords":null,"creator":null,"video_url":null,"description":"The National Cricket Academy has deemed the bowler fit after he underwent rehabilitation (NCA). He will soon be a member of the Team India ODI group.","content":null,"pubDate":"2023-01-03 11:58:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Two Senegal MPs slap female colleague in Parliament; jailed for six months","link":"https://www.firstpost.com/world/watch-two-senegal-mps-slap-female-colleague-in-parliament-jailed-for-six-months-11921332.html","keywords":["Sports"],"creator":["FP Staff"],"video_url":null,"description":"Watch: Two Senegal MPs slap female colleague in Parliament; jailed for six months","content":"Dakar: For physically assaulting a female parliamentary colleague, two opposition Senegalese lawmakers were sentenced to six months in prison on Monday.Amy Ndiaye, a pro-government legislator in Senegal, was slapped and then kicked in the stomach during a chaotic session of the National Assembly, sparking anguished debate about democracy in the country.After a trial that began on December 19, MPs Mamadou Niang and Massata Samb were both sentenced to six months in prison.They were also fined 100,000 CFA francs ($150) each and ordered to pay damages of five million francs. Prosecutors had requested two-year sentences.The brawl occurred on December 1, during a routine vote on the budget of the Justice Ministry.Observations Ndiaye had made about Serigne Moustapha Sy, a powerful Muslim leader who backs the opposition but is not a legislator, served as the catalyst for the brawl.Watch video:The judge also ordered Mamadou Niang and Massata Samb to pay Ms Ndiaye five million CFA francs in compensation.The incident was widely condemned and sparked a debate about women's rights. pic.twitter.com/brZTdbR0N6— Nigeria Info FM 99.3 (@NigeriainfoFM) January 3, 2023Following the restoration of order, Ndiaye fainted and was taken to the hospital; her lawyer, Baboucar Cisse, stated that she was pregnant and feared she would lose her child.She has since been released from the hospital, but she “remains in an extremely difficult situation,” according to Cisse.The incident sparked a heated debate about parliamentary debate and attacks on women. It happened to coincide with a domestic violence awareness campaign.Senegal is widely regarded as a model of stability and democracy in West Africa, a region rife with coups and dictatorships.Legislative elections in July resulted in a virtual tie, forcing President Macky Sall’s party to form a coalition in order to remain in power.Sall was first elected to a seven-year term in 2012 and was re-elected to a five-year term in 2019. He has not revealed his plans for the 2024 presidential election. Niang and Samb, who were detained on December 15, did not appear in court.“They will remain in prison pending an appeal,” Abdy Nar Ndiaye, one of their lawyers, told AFP.Despite video evidence, they denied hitting the legislator.Their lawyers argued that because they were lawmakers, they were immune from prosecution, but the court rejected this.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-03 11:44:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Untitled-design-2023-01-03T171345.778.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"RAGING ROGERS – 5 WICKET HAUL","link":"https://www.cairnspost.com.au/sport/cricket/raging-rogers-5-wicket-haul/video/0dd27585b8ea69f9e65c21d5852df802","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Tom Rogers has returned from an attempted Mankad to take five Melbourne Stars wickets in their Big Bash League clash.","content":null,"pubDate":"2023-01-03 11:27:17","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Australia seals billion-dollar broadcast rights deal","link":"https://www.straitstimes.com/sport/cricket-australia-seals-billion-dollar-broadcast-rights-deal","keywords":null,"creator":null,"video_url":null,"description":"January 03, 2023 7:06 PMSYDNEY - Cricket Australia sealed a record A$1.5 billion (S$1.35 billion) extension of its domestic TV rights deal on Tuesday, calling it an important commercial outcome for the sport.","content":null,"pubDate":"2023-01-03 11:06:56","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"SCG wicket will be kind to spinners","link":"https://www.cairnspost.com.au/sport/cricket/scg-wicket-will-be-kind-to-spinners/video/69394fc594fa20c38d07478ac283b683","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The SCG wicket is expected to offer plenty for spinners in Australia's test with India.","content":null,"pubDate":"2023-01-03 11:00:18","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2023: Sourav Ganguly all set to join Delhi Capitals as Director of Cricket","link":"https://economictimes.indiatimes.com/news/sports/ipl-2023-sourav-ganguly-all-set-to-join-delhi-capitals-as-director-of-cricket/videoshow/96710877.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-01-03 10:50:55","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-34320,resizemode-4,msid-96710877/ipl-2023-sourav-ganguly-all-set-to-join-delhi-capitals-as-director-of-cricket.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka: Jasprit Bumrah included in Rohit Sharma-led ODI squad","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-sri-lanka-jasprit-bumrah-included-in-rohit-sharma-led-odi-squad-11920072.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka: Jasprit Bumrah included in Rohit Sharma-led ODI squad","content":"Jasprit Bumrah could make his international comeback as early as next week with the senior pacer added to the India squad for the three-match ODI series against Sri Lanka.Bumrah’s inclusion was confirmed by the BCCI in an official release, which added that the National Cricket Academy had declared him fit, giving him the green signal to join the Men in Blue.The Mumbai Indians pacer had last featured during India’s T20I series against Australia at home in September, right before the T20 World Cup in Australia. The seamer would get ruled out of the mega-event, in which India got knocked out in the semi-finals following a 10-wicket loss at the hands of eventual champions England.Bumrah had struggled with his fitness for a majority of 2022; after leading India in the rescheduled fifth Test against England in Birmingham, he started complaining of back trouble during the limited-overs fixtures against the Englishmen.Read: Timeline of Jasprit Bumrah’s fitness issuesHe would later fail to regain fitness in time for the Asia Cup that was shifted to the UAE from Sri Lanka, and was sent to the NCA for rehabilitation.Team India are set to play their first match of the new year on Tuesday, taking on Sri Lanka in the first of three T20Is in Mumbai’s Wankhede Stadium. Pune and Rajkot will host the second and third T20Is respectively. Guwahati (10 January), Kolkata (12 January) and Thiruvananthapuram (15 January) are scheduled to host the three one-dayers against Dasun Shanaka’s men.While Rohit Sharma continues in his role as the ODI captain in the Sri Lanka series after receiving the BCCI’s backing for the 50-over and five-day formats, he has been overlooked for the T20Is along with fellow seniors Virat Kohli and KL Rahul.Read: Life beyond Rohit, Test keepers among CAC’s queries for selectorsThe board, instead, has opted to go with all-rounder Hardik Pandya as the skipper for the shortest format with an eye on rebuilding the team for the 2024 T20 World Cup.India’s updated squad for Sri Lanka ODIs: Rohit Sharma (Captain), Shubman Gill, Virat Kohli, Suryakumar Yadav, Shreyas Iyer, KL Rahul (wk), Ishan Kishan (wk), Hardik Pandya (VC), Washington Sundar, Yuzvendra Chahal, Kuldeep Yadav, Axar Patel, Jasprit Bumrah, Mohd. Shami, Mohd. Siraj, Umran Malik, Arshdeep Singh.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-03 10:44:56","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/Jasprit-Bumrah-India-Australia-3rd-T20I-Sportzpics-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Jasprit Bumrah joins India ODI squad for SL series after fitness clearance","link":"https://www.orissapost.com/jasprit-bumrah-joins-india-odi-squad-for-sl-series-after-fitness-clearance/","keywords":["Sports","Fitness clearance","Jasprit Bumrah","ODI squad","Sri Lanka series"],"creator":["Post News Network"],"video_url":null,"description":"Mumbai: Star pacer Jasprit Bumrah was Tuesday added to India’s ODI squad for the three games against Sri Lanka after National Cricket Academy declared him fit for home series beginning January 10. Bumrah last played for India in September and had also missed the T20 World Cup in Australia due to a back injury. “The […]","content":"Mumbai: Star pacer Jasprit Bumrah was Tuesday added to India’s ODI squad for the three games against Sri Lanka after National Cricket Academy declared him fit for home series beginning January 10. Bumrah last played for India in September and had also missed the T20 World Cup in Australia due to a back injury. “The All-India Senior Selection Committee has included pacer Jasprit Bumrah in India’s ODI squad for the upcoming Mastercard 3-match ODI series against Sri Lanka. “The pacer has undergone rehabilitation and has been declared fit by the National Cricket Academy (NCA). He will be joining the Team India ODI squad soon,” said the BCCI in a statement. The first ODI will be played in Guwahati January 10, second in Kolkata January 12 and third in Trivandrum January 15. With the focus on 50-over cricket in an ODI World Cup year, it is unlikely that Bumrah will feature in the shortest format till the ICC event at home in October-November. His IPL workload too would be monitored closely by the NCA, as well as other “targeted” India players for the ODI World Cup. One of the best in the business, Bumrah is vital to India’s chances at the mega event as they look to win the coveted trophy for the second time at home after 2011. Having made his India debut in 2016, the 29-year-old has represented the country in 30 Tests, 72 ODIs and 60 T20Is. Experts including the great Michael Holding find Bumrah injury-prone as he generates serious pace with a short-run up. “My problem with Bumrah, and I mentioned it to him when last time I saw him in England, is how long that body will hold up with that short run and the amount of effort he has to put into in his bowling, it is a human body. It is not a machine,” Holding had said back in 2020. India’s updated squad for Sri Lanka ODIs: Rohit Sharma (c), Shubman Gill, Virat Kohli, Suryakumar Yadav, Shreyas Iyer, KL Rahul (wk), Ishan Kishan (wk), Hardik Pandya (vc), Washington Sundar, Yuzvendra Chahal, Kuldeep Yadav, Axar Patel, Jasprit Bumrah, Mohd. Shami, Mohd. Siraj, Umran Malik, Arshdeep Singh.","pubDate":"2023-01-03 10:44:26","image_url":"https://www.orissapost.com/wp-content/uploads/2022/06/Jasprit-Bumrah-300x200.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian Cricket Team New Coach: राहुल द्रविड़ के बाद वीवीएस लक्ष्मण होंगे टीम इंडिया के नए हेड कोच! सामने आई अहम जानकारी","link":"https://www.abplive.com/sports/cricket/after-rahul-dravid-vvs-laxman-is-the-strongest-contender-to-become-the-new-coach-of-the-indian-cricket-team-2298625","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"VVS Laxman: इस साल भारत वनडे वर्ल्ड कप की मेजबानी करेगा. बहरहाल, बीसीसीआई ने इस टूर्नामेंट के लिए अपनी तैयारियों पर काम करना शुरू कर दिया है. पिछले दिनों इस बाबत बीसीसीआई की रिव्यू मीटिंग हुई. इसके अलावा बीसीसीआई की नजर टीम इंडिया के अगले हेड कोच पर है. दरअसल, भारतीय टीम के मौजूदा हेड कोच राहुल द्रविड़ का कार्यकाल वनडे वर्ल्ड कप तक है. वहीं, इस बात की संभावना बेहद कम है कि राहुल द्रविड़ के कार्यकाल को बढ़ाया जाएगा. फिलहाल, बीसीसीआई राहुल द्रविड़ के विकल्प को तलाश रही है. हेड कोच बनने के रेस में वीवीएस लक्ष्मण सबसे आगे बहरहाल, राहुल द्रविड़ की जगह टीम इंडिया के हेड कोच बनने के रेस में पूर्व भारतीय क्रिकेटर वीवीएस लक्ष्मण सबसे आगे हैं. वीवीएल लक्ष्मण को मजबूत दावेदार माना जा रहा है. वीवीएस लक्ष्मण फिलहाल बैंगलोर स्थित नेशनल क्रिकेट एकेडमी के हेड हैं. इसके अलावा वीवीएस लक्ष्मण टीम इंडिया के हेड कोच राहुल द्रविड़ की गैरमौजूदगी में कोचिंग की जिम्मेदारी संभालते हैं. एशिया कप 2022 के वक्त राहुल द्रविड़ कोरोना वायरल संक्रमित हो गए थे. जिसके बाद वीवीएस लक्ष्मण ने कोच की जिम्मेदारी निभाई थी. नेशनल क्रिकेट एकेडमी के हेड हैं वीवीएस लक्ष्मण गौरतलब है कि वीवीएस लक्ष्मण फिलहाल बैंगलोर स्थित नेशनल क्रिकेट एकेडमी के हेड हैं. जबकि राहुल द्रविड़ भी टीम इंडिया के हेड कोच बनने से पहले  नेशनल क्रिकेट एकेडमी के हेड थे. इससे पहले वीवीएस लक्ष्मण साल 2022 में अंडर-19 वर्ल्ड कप में टीम इंडिया के कोच के तौर पर वेस्टइंडीज गए थे. वीवीएस लक्ष्मण की कोचिंग में भारतीय अंडर-19 टीम ने शानदार खेल का नजारा पेश करते हुए खिताब अपने नाम किया था. वहीं, इसके अलावा ऐसा माना जा रहा है कि हार्दिक पांड्या को भारत के टी20 टीम का नियमित कप्तान बनाया जा सकता है. जबकि अलग-अलग फॉर्मेट में बीसीसीआई अलग-अलग कोचों पर विचार कर सकती है. ये भी पढ़ें- Sania Mirza: सुर्खियों में है सानिया मिर्जा का 'न्यू ईयर पोस्ट', तस्वीर और कैप्शन बयां कर रहे शोएब से खत्म होते रिश्ते की कहानी! IND vs SL: युजवेंद्र चहल के पास सुनहरा मौका, भुवनेश्वर को पछाड़ कर अपने नाम कर सकते हैं यह बड़ा रिकॉर्ड","content":null,"pubDate":"2023-01-03 10:31:31","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/01/03/506151408391998064f3a2389d914c921672741382893428_original.webp","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Sourav Ganguly likely to begin role as ‘Head of All Cricket’ for Delhi Capitals","link":"https://thenewsmill.com/2023/01/sourav-ganguly-likely-to-begin-role-as-head-of-all-cricket-for-delhi-capitals/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-03 10:31:23","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2023: Former BCCI President and ex-India Captain Sourav Ganguly to join Delhi Capitals in THIS position","link":"https://zeenews.india.com/cricket/ipl-2023-former-bcci-president-and-ex-india-captain-sourav-ganguly-to-join-delhi-capitals-in-this-postition-2557221.html","keywords":null,"creator":null,"video_url":null,"description":"Sourav Ganguly, who stepped down from the BCCI president’s post in October last year, will also oversee all the cricket verticals of the franchise along with the ILT20 team Dubai Capitals and the SA T20 league side Pretoria Capitals.","content":null,"pubDate":"2023-01-03 10:16:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"}]}