{"newsArray":[{"title":"Australia beat England by 275 runs to go 2-0 up at Adelaide","link":"https://www.sentinelassam.com/sports-news/australia-beat-england-by-275-runs-to-go-2-0-up-at-adelaide-568878","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Australia were made to work hard by England but the hosts didn’t give up to secure a 275-run win on day five of the second Ashes Test at the Adelaide Oval on Monday.","content":"ADELAIDE: Australia were made to work hard by England but the hosts didn't give up to secure a 275-run win on day five of the second Ashes Test at the Adelaide Oval on Monday.With the win, Australia have now gone 2-0 up in the five-match series despite England wicketkeeper Jos Buttler putting up a defiant stand to show the tourists can put up a fight. Resuming from 82/4 and needing six wickets to win, Australia struck on the 13th ball of the day as Ollie Pope poked at a length ball angled across from Mitchell Starc, getting a thick edge to Steve Smith at second slip. Ben Stokes and Jos Buttler joined forces for a resistance show. But Nathan Lyon got one to slide across and trap Stokes lbw in front of middle and leg-stump. Australia took the DRS and got the on-field decision overturned, resulting in Stokes departing after a resistance of 77 balls. Woakes and Buttler then combined to put up a rearguard act for England. The stand of 61 off 190 balls was brought to an end by the pacer, ending the all-rounder's stubborn stay with a nip-backer sneaking through the gate to hit the top of middle stump. Buttler showed remarkable application, patience and determination in leading the stubborn resistance by England's lower order. He shielded Ollie Robinson from facing the pacers and allowed him to face off-spin of Lyon, a tactic which worked for around 11 overs. Robinson hung around for 39 balls before edging to Smith at first slip off Lyon. Broad was adjudged lbw off Lyon for nought. But he took the review and got to overturn the on-field decision as replays showed a thick inside edge. Post tea, Buttler's 207-ball effort met a disappointing end as he went too deep in the crease while trying to take a single off Richardson and disturbed the stumps with his own foot. Getting out hit-wicket was an upsetting end to the wicketkeeper-batter's resistance in the second innings, where he barely kept a foot wrong until his foot caused his own downfall. Just 3.1 overs later, Richardson completed his return to Test cricket with a maiden five-wicket haul as Anderson tried to fend away and was caught by Cameron Green at gully to help Australia go 2-0 up in the Ashes. Brief scores: Australia 473/9 dec in 150.4 overs and 230/9 dec in 61 overs beat England 236 all out in 84.1 overs and 192 all out in 113.1 overs (Rory Burns 34, Chris Woakes 44; Jhye Richardson 5/42, Mitchell Starc 2/43) by 275 runs. IANS Also Read: Enforcement Directorate Summons Aishwarya Rai Bachchan In Panama Papers Leak CaseAlso Watch:","pubDate":"2021-12-21 03:22:54","full_description":"ADELAIDE: Australia were made to work hard by England but the hosts didn't give up to secure a 275-run win on day five of the second Ashes Test at the Adelaide Oval on Monday. With the win, Australia have now gone 2-0 up in the five-match series despite England wicketkeeper Jos Buttler putting up a defiant stand to show the tourists can put up a fight. Resuming from 82/4 and needing six wickets to win, Australia struck on the 13th ball of the day as Ollie Pope poked at a length ball angled across from Mitchell Starc, getting a thick edge to Steve Smith at second slip. Ben Stokes and Jos Buttler joined forces for a resistance show. But Nathan Lyon got one to slide across and trap Stokes lbw in front of middle and leg-stump. Australia took the DRS and got the on-field decision overturned, resulting in Stokes departing after a resistance of 77 balls. Woakes and Buttler then combined to put up a rearguard act for England. The stand of 61 off 190 balls was brought to an end by the pacer, ending the all-rounder's stubborn stay with a nip-backer sneaking through the gate to hit the top of middle stump. Buttler showed remarkable application, patience and determination in leading the stubborn resistance by England's lower order. He shielded Ollie Robinson from facing the pacers and allowed him to face off-spin of Lyon, a tactic which worked for around 11 overs. Robinson hung around for 39 balls before edging to Smith at first slip off Lyon. Broad was adjudged lbw off Lyon for nought. But he took the review and got to overturn the on-field decision as replays showed a thick inside edge. Post tea, Buttler's 207-ball effort met a disappointing end as he went too deep in the crease while trying to take a single off Richardson and disturbed the stumps with his own foot. Getting out hit-wicket was an upsetting end to the wicketkeeper-batter's resistance in the second innings, where he barely kept a foot wrong until his foot caused his own downfall. Just 3.1 overs later, Richardson completed his return to Test cricket with a maiden five-wicket haul as Anderson tried to fend away and was caught by Cameron Green at gully to help Australia go 2-0 up in the Ashes. Brief scores: Australia 473/9 dec in 150.4 overs and 230/9 dec in 61 overs beat England 236 all out in 84.1 overs and 192 all out in 113.1 overs (Rory Burns 34, Chris Woakes 44; Jhye Richardson 5/42, Mitchell Starc 2/43) by 275 runs. IANS Also Read: Enforcement Directorate Summons Aishwarya Rai Bachchan In Panama Papers Leak Case Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/21/285081-thequint2021-12f7063087-cab9-43ca-a4f8-ae236e3815dd495d74ebdbf672b4b06e4f017917a1ca.jpg","source_id":"sentinel"},{"title":"Cricket-&#039;Why are you captain?&#039; Ponting slams Root comments on England bowlers","link":"https://www.thestar.com.my/sport/cricket/2021/12/21/cricket-039why-are-you-captain039-ponting-slams-root-comments-on-england-bowlers","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Former Australia skipper Ricky Ponting has questioned Joe Root's comments about England's bowlers during the Ashes and said that as captain of the touring side the onus is on him to make changes when needed. Read full story","content":null,"pubDate":"2021-12-21 03:14:00","full_description":"(Reuters) - Former Australia skipper Ricky Ponting has questioned Joe Root's comments about England's bowlers during the Ashes and said that as captain of the touring side the onus is on him to make changes when needed. After a nine-wicket thrashing in the Brisbane opener, England lost the second test in Adelaide by 275 runs on Monday to trail the five-match series 2-0. Root said after the pink ball test that his bowlers needed to bowl fuller and \"be a bit braver\". \"I nearly fell off my seat when I heard that,\" Ponting told a Cricket Australia website. \"Whose job is it then to make them change? Why are you captain then? \"If you can't influence your bowlers on what length to bowl, what are you doing on the field? \"Joe Root can come back and say whatever he likes but if you're captain, you've got to be able to sense when your bowlers aren't bowling where you want them to. That's what captaincy is all about.\" Ponting also suggested that England's bowling attack was at its best when Root left the field due to a groin injury and the captaincy was briefly passed over to Ben Stokes. \"The interesting thing for me is the only time they bowled full in the game was when Joe Root wasn't on the ground,\" Ponting said. \"The start of day four when they had a meeting on the ground before play started, Stokes took over the captaincy, and that was the only time in the game they pitched the ball up.\" The third Ashes test will be played at the Melbourne Cricket Ground from Dec. 26-30. (Reporting by Aadi Nair in Bengaluru; Editing by Peter Rutherford)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/21/1414669.jpg","source_id":"thestar_my"},{"title":"Who will win today Big Bash match: Who is expected to win Sydney Sixers vs Adelaide Strikers BBL 11 match?","link":"https://thesportsrush.com/cricket-news-who-will-win-today-big-bash-match-who-is-expected-to-win-perth-scorchers-vs-adelaide-strikers-bbl-11-match/","keywords":["Cricket","BBL 11","SIX vs STR","Sixers vs Strikers"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Sydney Sixers vs Adelaide Strikers: The SportsRush brings you the analysis and match-prediction of the Big Bash League game. Sydney Sixers will lock horns against Adelaide Strikers in the 16th game of the ongoing BBL11. The match will be played at the Sydney Cricket Ground in Sydney. Defending champions Sydney Sixers have won three of… The post Who will win today Big Bash match: Who is expected to win Sydney Sixers vs Adelaide Strikers BBL 11 match? appeared first on The SportsRush.","content":"Sydney Sixers vs Adelaide Strikers: The SportsRush brings you the analysis and match-prediction of the Big Bash League game. Sydney Sixers will lock horns against Adelaide Strikers in the 16th game of the ongoing BBL11. The match will be played at the Sydney Cricket Ground in Sydney. Defending champions Sydney Sixers have won three of their four games, whereas the Strikers have won one of their three. The game will be live on Sony Six from 1:45 PM IST. Who will win today Big Bash match: Sydney Sixers vs Adelaide Strikers Pitch Report The pitch has been absolutely brilliant for batting this season. Two games have been played here in BBL 11, and the team batting first passed 200 runs on both occasions. Sydney Sixers preview The defending champions Sydney Sixers have won three of their four games, and they defeated Melbourne Stars in the last one. Josh Philippe is the highest run-scorer of the season so far, whereas Moises Henriques is the 2nd highest. The form of James Vince is a concern, but he is a quality player. In bowling, the team will miss the services of Tom Curran and Steve O’Keefe in this game. Ben Dwarshius and Chris Jordan will lead the pace attack, whereas Lloyd Pope will take care of spin. Probable XI: Josh Philippe, James Vince, Moises Henriques, Daniel Hughes, Jordan Silk, Daniel Christian, Sean Abbott, Chris Jordan, Ben Dwarshius, Lloyd Pope, Hayden Kerr. Today’s the day, it’s GAMEDAY #BBL11 pic.twitter.com/5buubnOfv3 — Sydney Sixers (@SixersBBL) December 20, 2021 Adelaide Strikers preview Adelaide Strikers have just won one of their three games, and they are in desperate need of a win. The Strikers are missing the services of their star batters like Travis Head and Alex Carey. Matthew Short has been brilliant for the side, whereas the eyes will be on out of form Jake Weatherald. Rashid Khan will lead the spin-bowling, whereas Garton, Agar, Siddle, and Worrall will take care of pace. The bowling is the strength of this side, whereas the return of Matt Renshaw will boost the batting. Probable XI: Jake Weatherald, Matthew Short, Matt Renshaw, Harry Nielsen, Jon Wells, Daniel Drew, George Garton, Rashid Khan, Daniel Worrall, Peter Siddle, Wes Agar. Match Prediction Sydney Sixers will be the favourites to win this game. The post Who will win today Big Bash match: Who is expected to win Sydney Sixers vs Adelaide Strikers BBL 11 match? appeared first on The SportsRush.","pubDate":"2021-12-21 03:10:52","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"How this summer’s Great English Trainwreck is masking an even greater Aussie truth","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2021-australia-vs-england-cricket-boxing-day-test-news-analysis-joe-roots-team-masking-aussie-improvement/news-story/1c6eb28f4a17c24d154d41ed16e3f6a4","keywords":null,"creator":null,"video_url":null,"description":"As Australian cricket fans, the only thing we enjoy more than the national team winning is an England farce.","content":null,"pubDate":"2021-12-21 02:07:00","full_description":"As Australian cricket fans, the only thing we enjoy more than the national team winning is an England farce. And boy, have there been plenty of those. From not picking its best and most experience seamers on a Gabba green top, to forgetting that the ball spins in Adelaide and failing to pick a specialist tweaker. Throw in three trademark batting collapses in as many innings to start the tour and it’s all looking like a great English trainwreck with ‘whitewash’ written all over it. To the surprise of precisely no one, England is 2-0 down in the Ashes and still looking for its first Test win in Australia in more than a decade. Front and back newspaper pages and websites, both home and abroad, are filled with brutally honest criticism to remind us of that. But it’s worth reminding ourselves on this, another sorry day for English Test cricket, that Joe Root’s side didn’t just lose the first two Tests of the Ashes. Australia won them — resoundingly, too. And it’s about time that the team’s marked improvements from last summer, when it was shocked at home by an alleged Indian C team, are appropriately acknowledged. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . Vaughan slams England's selections | 02:01 Australia’s top-order has at times rode its luck, but has ultimately prospered to put the hosts on the front-foot early. David Warner — who averaged less than 10 in the 2019 Ashes — is averaging 67.33 with two scores in the nineties to his name. Marnus Labuschagne, meanwhile, is leading the way for Australia with 228 runs at 76.00. He’s also soaked up a whopping 518 balls, more than 100 better than second on the series list, Dawid Malan on 413. Steve Smith has been below his best with the bat after two failures, but even then he has a high score of 93 to his name. It’s worth noting that only once has he been sent to the crease before the Australian total was greater than 150 — and that was then the side was already in complete control in the second innings in Adelaide. At No.5, selectors didn’t so much find a long-term solution to the middle-order conundrum, but rather remembered they had one all along in Travis Head. Head has made the decision to drop him against India look foolish, while vindicating the current three-person panel. The 27-year-old was dropped midway through last summer as punishment for his habitual failure to convert starts into big scores. Now back in the team at No.5, he’s proven the value a dashing middle-order batter can bring in Test cricket. READ MORE UK VIEW: Knives out for ‘awful’ Poms as duo face sack over ugly Ashes ‘landslide’ TALKING POINTS: Root’s odd blame game; why Smith defied advice to unleash weapon At the Gabba after the loss of 4-29, Head batted England out of the match with the joint third-fastest Ashes century of all time in just 85 balls. In Adelaide, the left-hander provided a counterpunch once again, with his run-a-ball fifty enabling an earlier declaration for Australia. Given England somehow snuck into the final session of day five with two wickets still in hand, Head’s innings was perhaps more crucial than we give it credit for. Below him at No.6 is Cameron Green, who couldn’t buy a wicket against India from his first 44 overs in Test cricket. He was guilty of bowling too short when a bowler of his height — nearly two metres — doesn’t need to go looking for bounce. Green has learnt that and has pitched the ball up this summer, drawing England — particularly Joe Root — into false shots on the front foot with his height naturally creating the extra bounce needed. The result has been five wickets at the stunning average of 12.40, while only Pat Cummins has a better strike rate than Green’s 40.8. All TEN England wickets | 01:51 His batting has been an issue with a technical flaw rearing its head, although an unbeaten 33 in Australia’s second innings will serve as a handy confidence boost moving forward. Then at No.7 — and with all due respect to Tim Paine — Alex Carey has made him feel like a distant memory. That’s not a knock on the former Test captain — whose average of 32.62 sits only behind Adam Gilchrist and Brad Haddin on the list of Australian Test wicketkeepers — but rather a comment on how seamless the transition has been. With Carey now wearing the gloves and Pat Cummins and Smith leading the side, Australia hasn’t missed a beat, while Paine has surely played his last Test match. Across four innings, Carey is guilty of making only one mistake behind the stumps, which came on day five in Adelaide when he allowed an edge to sail between him and Warner, who was at a slightly wider first slip. Carey took a Test record of eight catches on debut, while he made a maiden half-century in just his third innings. THE BOWLERS Mitchell Starc wore plenty of criticism for Australia’s failed summer against India while many called for him to miss the first Test in place of Jhye Richardson. The left-armer went on to take a wicket with the very first ball of the series, while in Adelaide he was confident and performing like a genuine leader. Having taken just 11 wickets at 40.72 against India, Starc already has nine at 21.33 in two Tests and is bowling with greater consistency and more belief. He also proved in Adelaide that one of the most unheralded aspects of his game is his leadership, having taken it upon himself to lead the charge without Cummins or Hazlewood present. Adam Gilchrist told foxsports.com.au during the Test that a subtle change in attitude has Starc soaring again. “In the little interviews that we’ve had with Mitch and watching him, he hasn’t been so down on himself if a ball hasn’t gone in the right area or if they’ve scored a few runs in a few overs off him,” Gilchrist said. “He hasn’t got down and dropped his body language. “He just seems much more calm and relaxed and enjoying everything. It may not be the case but it’s an observation that I’ve noticed from my point of view.” The other bowler to misfire last summer for Australia was Nathan Lyon, whose career stalled on the precipice of taking 400 Test wickets. Perhaps it was a greater burden than we realised with the off-spinner guilty of bowling too straight, too flat, and with too conservative fields against India as the milestone drew nearer. This summer, however, he’s been regularly hitting better areas, hasn’t been afraid to crouch more fielders around the bat, while he’s been spinning the ball a long way, too. Now not only does he have a 400th Test wicket, but he has 408 and is averaging 25.00 this series. Australia has also uncovered a fast bowling depth on home soil that many suspected it had, but had rarely called upon. Buttler TREADS on his stumps! | 00:45 Selectors have often relied on picking extra quicks for tours abroad, but have largely stuck fat with Cummins, Hazlewood and Starc on home turf. With its hands tied in Adelaide due to injury to Hazlewood and a Covid scare for Cummins, Australia needed two replacements and recalled Richardson for his first Test in nearly three years, and gave a long-awaited debut to veteran Michael Neser. Both performed admirably; Neser did his job with two wickets at 30.50 but will likely struggle to play another match this Ashes. Richardson, meanwhile, snared a five-wicket haul in the second innings and is in line to feature heavily with uncertainty over Hazlewood’s fitness, and Starc potentially being rested for a Test. Either way, Australia won handsomely in Adelaide with its two best bowlers on the sidelines. There’s no longer fear over any of Australia’s first-choice quicks missing a Test. As for Cummins and Hazlewood, their Test rankings of first and fourth in the world respectively speaks for themselves. Meanwhile, Australia has grasped just about every chance — and half chance — that has come its way in the field while England’s butter fingers have proven to be contagious. That leaves opener Marcus Harris as the only obvious Australian weak point this series. He’s averaging 12.66, taking his all-time Ashes average to just 10.66 Even then, should Harris not come good at the MCG on Boxing Day, there’s a confidence that Usman Khawaja will after his sizzling start to the Sheffield Shield season. Khawaja also averages 40 in Test cricket and 96 as an opener — certainly not numbers to scoff at. Australia has looked tactically sounder, too. Both matches Tests were controlled from the onset and throughout, bowling changes have been sharp, and field placings intelligent. It’s a refreshing change from last summer against India when Australia was in Sydney guilty of turning to short ball tactics too soon, and then was too scared to try anything different at all at the Gabba. There is the argument that Australia has been made to look better by England, which has been woefully below par. It’s a fair argument but, as always, the truth likely lies somewhere in the middle. England has been poor, but Australia has shown genuine improvements across the board and likely would have beat India last summer in its current form.","image_url":null,"source_id":"foxsports"},{"title":"Player ratings: How do you score a mixed bag like Buttler’s? - The Advertiser","link":"https://news.google.com/__i/rss/rd/articles/CBMipAFodHRwczovL3d3dy5hZGVsYWlkZW5vdy5jb20uYXUvc3BvcnQvY3JpY2tldC9hc2hlcy0yMDIxMjItYXVzdHJhbGlhLWRlZmVhdHMtZW5nbGFuZC1pbi1zZWNvbmQtdGVzdC1yZXN1bHQtcGxheWVyLXJhdGluZ3MvbmV3cy1zdG9yeS9hOThkMzI3MGMzYzFlNGJhNTcyNzM1OWI2YmU3MDJiNdIBqAFodHRwczovL3d3dy5hZGVsYWlkZW5vdy5jb20uYXUvc3BvcnQvY3JpY2tldC9hc2hlcy0yMDIxMjItYXVzdHJhbGlhLWRlZmVhdHMtZW5nbGFuZC1pbi1zZWNvbmQtdGVzdC1yZXN1bHQtcGxheWVyLXJhdGluZ3MvbmV3cy1zdG9yeS9hOThkMzI3MGMzYzFlNGJhNTcyNzM1OWI2YmU3MDJiNT9hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Player ratings: How do you score a mixed bag like Buttler’s?  The AdvertiserButtler digs in but Jhye five sees Aussies prevail | Men's Ashes 2021-22  cricket.com.au‘Heartbreaking’ end to star’s marathon knock  NEWS.com.auEngland rue Adelaide Oval Ashes mistakes  InDailyButtler dogged but doomed as Australia go 2-0 up – The Final Word podcast  The GuardianView Full coverage on Google News","content":null,"pubDate":"2021-12-21 01:34:01","image_url":null,"source_id":"google"},{"title":"Cricket South Africa confirm Test series against India to be played without spectators due to Omicron COVID-19 scare","link":"https://zeenews.india.com/cricket/cricket-south-africa-confirm-test-series-against-india-to-be-played-without-spectators-due-to-omicron-covid-19-scare-2421146.html","keywords":null,"creator":null,"video_url":null,"description":"South Africa reported a record number of daily COVID-19 cases last week in a fourth wave believed to be largely caused by the Omicron variant.","content":null,"pubDate":"2021-12-21 01:06:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Tubby's surprise take on maligned opener","link":"https://wwos.nine.com.au/cricket/ashes-marcus-harris-opening-batting-australia-v-england-mark-taylor-on-selection/be968932-eb7a-413c-970f-d188742e9a56","keywords":null,"creator":["wwos"],"video_url":null,"description":"Marcus Harris remains under scrutiny after a poor start to the Ashes, as Mark Taylor reveals his thoughts for the Boxing Day Test.","content":"Former Australian Test cricket captain Mark Taylor says he hopes Marcus Harris is handed \"one more go at least\" at opening the batting alongside David Warner.While the Australians are on the verge of Ashes glory leading England 2-0, Harris' return to the Test side hasn't gone to plan.Following scores of 3 and 9 not out at the Gabba, Harris was again dismissed for 3 during the second Test, before managing 23 in Australia's second innings this week.READ MORE: Two years Ashes preparation wasted, says AthertonREAD MORE: Massive blow for Nadal's Australian Open hopesTHE MOLE: Storm winger close to securing new club in SydneyThe 29-year-old's batting average has dropped down to 22.19 from 23 innings across 12 matches.Asked whether Australia should look at other options and if it there was an opportunity for someone like veteran Usman Khawaja to make a return, Taylor said it was crucial for Harris to continue learning from Warner.\"I would still be playing Harris in the next Test match, I would give him one more go at least, particularly now that Australia is 2-0 up,\" he told Wide World of Sports.\"I think you really want to try and bring a younger player on.AS IT HAPPENED: Australia take 2-0 series leadREAD MORE: Australia take giant step towards Ashes glory\"I think if you go back to Usman Khawaja at this stage - and he might play well, but then you've two 35-year-olds opening the batting for Australia.\"What you really want is a younger guy opening with batting with a senior David Warner.\"I would certainly be giving Marcus Harris one more go and hopefully on his home Test match, he comes up good on Boxing Day.\"He certainly hasn't had a lot of luck this series, he got out to two very fine catches and yet other players were some beneficiaries of some poor fielding.\"Taylor added that despite the emergence of young guns Bryce Street and Henry Hunt, it was still too early to look at another option.\"You've got to make sure you've got someone you think is going to be a better option and at the moment it's probably Khawaja, although he hasn't been opening much in Shield cricket,\" he added.\"The other two - Bryce Street and Henry Hunt - they may well be good players but they haven't knocked the door down or demanded selection at this stage.\"You've got to make sure you've got someone who you think can do a better job, but I'm not sure that is the case at the moment.\"I would give Marcus Harris another game.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-21 01:05:25","full_description":"Former Australian Test cricket captain Mark Taylor says he hopes Marcus Harris is handed \"one more go at least\" at opening the batting alongside David Warner. While the Australians are on the verge of Ashes glory leading England 2-0 , Harris' return to the Test side hasn't gone to plan. Following scores of 3 and 9 not out at the Gabba, Harris was again dismissed for 3 during the second Test, before managing 23 in Australia's second innings this week. READ MORE: Two years Ashes preparation wasted, says Atherton READ MORE: Massive blow for Nadal's Australian Open hopes THE MOLE: Storm winger close to securing new club in Sydney The 29-year-old's batting average has dropped down to 22.19 from 23 innings across 12 matches. Asked whether Australia should look at other options and if it there was an opportunity for someone like veteran Usman Khawaja to make a return, Taylor said it was crucial for Harris to continue learning from Warner. \"I would still be playing Harris in the next Test match, I would give him one more go at least, particularly now that Australia is 2-0 up,\" he told Wide World of Sports. \"I think you really want to try and bring a younger player on. AS IT HAPPENED: Australia take 2-0 series lead READ MORE: Australia take giant step towards Ashes glory \"I think if you go back to Usman Khawaja at this stage - and he might play well, but then you've two 35-year-olds opening the batting for Australia. \"What you really want is a younger guy opening with batting with a senior David Warner. \"I would certainly be giving Marcus Harris one more go and hopefully on his home Test match, he comes up good on Boxing Day. \"He certainly hasn't had a lot of luck this series, he got out to two very fine catches and yet other players were some beneficiaries of some poor fielding.\" Taylor added that despite the emergence of young guns Bryce Street and Henry Hunt, it was still too early to look at another option. \"You've got to make sure you've got someone you think is going to be a better option and at the moment it's probably Khawaja, although he hasn't been opening much in Shield cricket,\" he added. \"The other two - Bryce Street and Henry Hunt - they may well be good players but they haven't knocked the door down or demanded selection at this stage. \"You've got to make sure you've got someone who you think can do a better job, but I'm not sure that is the case at the moment. \"I would give Marcus Harris another game.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/399988/pickerimage.jpg","source_id":"nine"},{"title":"Smith and Boucher face hearing on racial discrimination","link":"https://www.thenews.com.pk/print/918416-smith-and-boucher-face-hearing-on-racial-discrimination","keywords":null,"creator":null,"video_url":null,"description":"JOHANNESBURG: Graeme Smith and Mark Boucher, two of South Africa’s most prominent cricket personalities, will face formal hearings into claims of racial discrimination, Cricket South Africa announced on Monday.The announcement came just 6 days before the start of a high-profile Test series...","content":null,"pubDate":"2021-12-21 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"PCB BoG meeting today","link":"https://www.thenews.com.pk/print/918420-pcb-bog-meeting-today","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: The 67th meeting of the Board of Governors of the Pakistan Cricket Board will be held here on Tuesday at 12:30 pm.The PCB chairman Ramiz Raja will chair the meeting. In the meeting various matters will be discussed which also include Chairman, Acting CEO’s and Chief Financial...","content":null,"pubDate":"2021-12-21 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Triple centurion Huraira, Mubasir put Northern in final","link":"https://www.thenews.com.pk/print/918421-triple-centurion-huraira-mubasir-put-northern-in-final","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Promising Mohammad Huraira achieved a big milestone on Monday as he became the second youngest Pakistani to hit a triple century in first-class cricket, enabling Northern to qualify for the Quaid-e-Azam Trophy 2021-2022 final when they bulldozed Balochistan by an innings and 170 runs.At...","content":null,"pubDate":"2021-12-21 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Triple centurion Huraira, Mubasir put Northern in final","link":"https://www.thenews.com.pk/print/918421-triple-centurion-huraira-mubasir-put-northern-in-final","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Promising Mohammad Huraira achieved a big milestone on Monday as he became the second youngest Pakistani to hit a triple century in first-class cricket, enabling Northern to qualify for the Quaid-e-Azam Trophy 2021-2022 final when they bulldozed Balochistan by an innings and 170 runs.At...","content":null,"pubDate":"2021-12-21 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"India-SA series to be held behind closed doors","link":"https://www.tribuneindia.com/news/sports/india-sa-series-to-be-held-behind-closed-doors-352696","keywords":null,"creator":null,"video_url":null,"description":"Johannesburg, December 20 South Africa's upcoming home cricket series against India will be played without spectators due to a wave of Covid-19 infections, Cricket South Africa (CSA) said today. South Africa host India in a three-Test series beginning on Sunday in Centurion. The teams are also scheduled to play three One-day Internationals starting from January 19. The South African board said in a statement that the decision to play behind closed doors had been taken jointly with the Indian cricket board (BCCI). \"This decision was taken in order to avoid any breaches that could compromise the tour from a Covid-risk perspective and to also maintain a hazard-free bubble environment,\" the statement read. The statement added that the decision was made in the best interest of the game as well as the health and safety of players and staff. South Africa reported a record number of daily infections last week in a fourth wave believed to be largely caused by the Omicron variant. The tour itself was earlier in serious doubt because of the prevailing situation but the boards of both the countries agreed to go ahead with it. On Sunday, CSA announced that the remaining round of four-day franchise series, the country's premier domestic competition, has been postponed as a precautionary measure. — Agencies","content":null,"pubDate":"2021-12-21 00:42:20","full_description":"Johannesburg, December 20 South Africa’s upcoming home cricket series against India will be played without spectators due to a wave of Covid-19 infections, Cricket South Africa (CSA) said today. South Africa host India in a three-Test series beginning on Sunday in Centurion. The teams are also scheduled to play three One-day Internationals starting from January 19. The South African board said in a statement that the decision to play behind closed doors had been taken jointly with the Indian cricket board (BCCI). “This decision was taken in order to avoid any breaches that could compromise the tour from a Covid-risk perspective and to also maintain a hazard-free bubble environment,” the statement read. The statement added that the decision was made in the best interest of the game as well as the health and safety of players and staff. South Africa reported a record number of daily infections last week in a fourth wave believed to be largely caused by the Omicron variant. The tour itself was earlier in serious doubt because of the prevailing situation but the boards of both the countries agreed to go ahead with it. On Sunday, CSA announced that the remaining round of four-day franchise series, the country’s premier domestic competition, has been postponed as a precautionary measure. — Agencies","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/12/2021_12$largeimg_874471442.JPG","source_id":"tribuneindia"},{"title":"‘Didn’t have anything on’: Nets regret ‘beggars belief’ as Root opens up on THAT ‘unpleasant’ hit - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiwgFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvdGhlLWFzaGVzL2FzaGVzLTIwMjEtam9lLXJvb3QtaGl0LWluLWdyb2luLXZpZGVvLW5vLWJveC1pbi1uZXRzLXNlc3Npb24tbWl0Y2hlbGwtc3RhcmMtdmlkZW8tYXVzdHJhbGlhLXZzLWVuZ2xhbmQvbmV3cy1zdG9yeS9hZThiMjQyNTU5YjBkZTg4NDYzNjVhNjg1MTliMDM2NdIBwgFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvdGhlLWFzaGVzL2FzaGVzLTIwMjEtam9lLXJvb3QtaGl0LWluLWdyb2luLXZpZGVvLW5vLWJveC1pbi1uZXRzLXNlc3Npb24tbWl0Y2hlbGwtc3RhcmMtdmlkZW8tYXVzdHJhbGlhLXZzLWVuZ2xhbmQvbmV3cy1zdG9yeS9hZThiMjQyNTU5YjBkZTg4NDYzNjVhNjg1MTliMDM2NQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Didn’t have anything on’: Nets regret ‘beggars belief’ as Root opens up on THAT ‘unpleasant’ hit  Fox SportsButtler digs in but Jhye five sees Aussies prevail | Men's Ashes 2021-22  cricket.com.au‘Heartbreaking’ end to star’s marathon knock  NEWS.com.auEngland rue Adelaide Oval Ashes mistakes  InDailyButtler dogged but doomed as Australia go 2-0 up – The Final Word podcast  The GuardianView Full coverage on Google News","content":null,"pubDate":"2021-12-20 23:13:44","image_url":null,"source_id":"google"},{"title":"Go home cricket, you are officially drunk","link":"https://www.news.com.au/sport/cricket/wtf-you-are-kidding-cricket-world-cant-believe-ashes-disgrace/news-story/05f82a14b80f3390bd118282c8d0e968","keywords":null,"creator":null,"video_url":null,"description":"Australia didn’t have much to complain about in Adelaide as it crushed England by 275 runs to take a 2-0 lead in the Ashes but not everything went the hosts’ way.","content":null,"pubDate":"2021-12-20 22:23:00","full_description":"Australia didn’t have much to complain about in Adelaide as it crushed England by 275 runs to take a 2-0 lead in the Ashes but not everything went the hosts’ way. The tourists put up some stern resistance as Jos Buttler soaked up more than 200 deliveries before stepping on his stumps , making Australia toil for longer than many anticipated before taking the necessary 10th wicket of the innings. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. Nathan Lyon was one of the Aussies’ best in the South Australian capital, even though he didn’t pick up a big bag of wickets, and cricket fans thought he was unlucky not to have Stuart Broad’s measure when technology conspired against him. Bowling from around the wicket to the left-hander, Lyon struck Broad’s front pad when the fast bowler shouldered arms and didn’t offer a shot. The Aussies appealed but the umpire kept his finger down, so they reviewed. The Decision Review System (DRS) showed the ball was travelling over the top of the stumps and Broad survived — but plenty of viewers and commentators were stunned at the technology predicting the ball would bounce so high. Even the Aussie players were shocked. “There’s no way that’s going over,” one of them was heard saying, as Marnus Labuschagne and Lyon voiced their disbelief. Shane Warne told Fox Cricket: “Jeez it’s bounced a lot, from that full?” Commentating on Triple M, Gus Worland said “DRS is kidding itself” while Izzy Westbury added: “I think that’s ridiculous, and I’m English!” Former Victorian wicketkeeper Darren Berry was furious, calling it the “Diabolical Review System”. “DRS give me a break what a joke going over is a disgrace,” Berry tweeted. “It’s wrong I’ve said it before & will say it again.” Sports journalist Bernie Coen tweeted: “Bouncing over the stumps WTF!!! U r kidding!! DRS is a farce sometimes. If that was going over the stumps I’m a supermodel.” NSW bowling coach Andre Adams added: “DRS hahahahahahaaaaaaa.” Jake Buckley wrote: “DRS think this pitch is a trampoline or something what the hell is that bounce? That’s plumb.” DRS has been fined 100% of its match fee for this 'over the stumps' decision. #Ashes pic.twitter.com/dxkd4fEZru The Australian Test side is far from perfect, but Justin Langer’s team features the nation’s best batting order since December 2007. Australia has one hand on the Ashes urn and an unsung hero is owed some credit after responding to his critics in the best possible way. England gloveman Jos Buttler was at the crease for more than 200 deliveries before his gritty knock ended in “heartbreaking” fashion.","image_url":null,"source_id":"news"},{"title":"Go home cricket, you are officially drunk","link":"https://www.cairnspost.com.au/sport/cricket/wtf-you-are-kidding-cricket-world-cant-believe-ashes-disgrace/news-story/05f82a14b80f3390bd118282c8d0e968","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australia didn’t have much to complain about in Adelaide as it crushed England by 275 runs to take a 2-0 lead in the Ashes but not everything went the hosts’ way.","content":null,"pubDate":"2021-12-20 22:15:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Cricket tipping: How to win $2000 every Ashes Test","link":"https://www.cairnspost.com.au/sport/cricket/ashes-202122-tip-and-run-the-new-cricket-tipping-competition-win-a-share-of-10000/news-story/545ecdaa80b5cf976cada60fed1fb982","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"The summer of cricket is in full swing as we head to te MCG for the third Test between England and Australia.","content":null,"pubDate":"2021-12-20 22:10:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Ashes report card: Tubby's player ratings","link":"https://wwos.nine.com.au/cricket/ashes-2021-second-test-player-ratings-marnus-labuschagne-mitchell-starc-rate-highest/4a033af2-f6c6-40a7-922f-8a7b1ac346f7","keywords":null,"creator":["wwos"],"video_url":null,"description":"Two players grabbed 9/10s while another looks to be on his last chance. Here's how Mark Taylor graded the Aussies.","content":"Australia are on the verge of retaining the Ashes after taking a 2-0 series lead. Here's how former Australian captain Mark Taylor saw the performances from the Aussie XI.David Warner: Put aside the pain from his rib injury to notch a second consecutive 90, an innings where he had to weather some tricky periods through the middle of the opening day. A terrible mix-up cost him his wicket in the second innings, but by that stage most of the hard work had already been done. 8/10READ MORE: Two years Ashes preparation wasted, says AthertonREAD MORE: Massive blow for Nadal's Australian Open hopesTHE MOLE: Storm winger close to securing new club in SydneyMarcus Harris: when your luck is out in this game, it's really out. Harris fell to two fine catches by Jos Buttler, who then missed a number of easier chances throughout the match, which must have left Marcus cursing to himself in the dressing room. Regardless, runs are the only currency that matters, and Harris must be on very thin ice. 3Marnus Labuschagne: Benefitted from some luck in the first innings as Jos Buttler dropped an absolute sitter, but his first Ashes century continues his remarkable form over the last couple of years. Added another half century in the second innings. 9Steve Smith: Inherited the captaincy just hours before the match started, and barely put a foot wrong during the game. His first-innings 93 contributed to Australia's big first innings total, a position from which they were never likely to be troubled. Missed out in the second innings but captained the side deftly in the field, as you'd expect from a player of his experience. 8Travis Head: Will rue his dismissal in the first innings when he played all over a ball from Joe Root, but scored a breezy 51 in the second innings as Australia batted England out of the match. 7Cameron Green: Took 2-24 off 10 overs in the first innings, claiming the key wickets of Joe Root and Ben Stokes. Steve Smith could not have asked for more from Green, who is showing signs of developing into a world-class all-rounder, one of the toughest roles in Test cricket. An unbeaten 33 in the second innings just relieves the pressure on his batting a touch. 8Alex Carey: another fine first four days with the gloves from Carey, who looks like he's been playing Test cricket for years, not weeks. Made the first real blunder of his career on day five, leaving an edge from Buttler that was clearly the keeper's catch. Regardless, still a solid match from Carey, with his first-innings 51 helping to take Australia's score from 'decent' to 'imposing'. 8Mitchell Starc: Had England on the back foot almost immediately, dismissing Rory Burns in his second over, and rarely took his foot off the visitors' throats, claiming four wickets in the first innings. With hindsight his dismissal of Joe Root on the fourth evening probably cost England any chance of surviving for a draw, while his spell to start day five was top class. Led the attack superbly in the absence of Pat Cummins and Josh Hazlewood. 9Michael Neser: A Test debut he can be proud of, with a wicket from his second ball. Looked comfortable enough on the big stage, contributing runs and wickets. 6Jhye Richardson: Perhaps guilty of trying a little too hard in the first innings as he made his return to Test cricket, going wicketless and conceding more than four runs per over. Looked much better in the second innings, producing an absolute cracker early on to dismiss Haseeb Hameed and finishing with the first five-wicket haul of his Test career. 8Nathan Lyon: Now that the 400th wicket is out of the way Lyon appears to have regained his mojo, troubling all the English batters during this match. His dismissal of Chris Woakes in the first innings was off-spin bowling at its best. 8For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-20 21:54:56","full_description":"Australia are on the verge of retaining the Ashes after taking a 2-0 series lead. Here's how former Australian captain Mark Taylor saw the performances from the Aussie XI. David Warner: Put aside the pain from his rib injury to notch a second consecutive 90, an innings where he had to weather some tricky periods through the middle of the opening day. A terrible mix-up cost him his wicket in the second innings, but by that stage most of the hard work had already been done. 8/10 READ MORE: Two years Ashes preparation wasted, says Atherton READ MORE: Massive blow for Nadal's Australian Open hopes THE MOLE: Storm winger close to securing new club in Sydney Marcus Harris: when your luck is out in this game, it's really out. Harris fell to two fine catches by Jos Buttler, who then missed a number of easier chances throughout the match, which must have left Marcus cursing to himself in the dressing room. Regardless, runs are the only currency that matters, and Harris must be on very thin ice. 3 Marnus Labuschagne: Benefitted from some luck in the first innings as Jos Buttler dropped an absolute sitter, but his first Ashes century continues his remarkable form over the last couple of years. Added another half century in the second innings. 9 Steve Smith: Inherited the captaincy just hours before the match started, and barely put a foot wrong during the game. His first-innings 93 contributed to Australia's big first innings total, a position from which they were never likely to be troubled. Missed out in the second innings but captained the side deftly in the field, as you'd expect from a player of his experience. 8 Travis Head: Will rue his dismissal in the first innings when he played all over a ball from Joe Root, but scored a breezy 51 in the second innings as Australia batted England out of the match. 7 Cameron Green: Took 2-24 off 10 overs in the first innings, claiming the key wickets of Joe Root and Ben Stokes. Steve Smith could not have asked for more from Green, who is showing signs of developing into a world-class all-rounder, one of the toughest roles in Test cricket. An unbeaten 33 in the second innings just relieves the pressure on his batting a touch. 8 Alex Carey: another fine first four days with the gloves from Carey, who looks like he's been playing Test cricket for years, not weeks. Made the first real blunder of his career on day five, leaving an edge from Buttler that was clearly the keeper's catch. Regardless, still a solid match from Carey, with his first-innings 51 helping to take Australia's score from 'decent' to 'imposing'. 8 Mitchell Starc: Had England on the back foot almost immediately, dismissing Rory Burns in his second over, and rarely took his foot off the visitors' throats, claiming four wickets in the first innings. With hindsight his dismissal of Joe Root on the fourth evening probably cost England any chance of surviving for a draw, while his spell to start day five was top class. Led the attack superbly in the absence of Pat Cummins and Josh Hazlewood. 9 Michael Neser: A Test debut he can be proud of, with a wicket from his second ball. Looked comfortable enough on the big stage, contributing runs and wickets. 6 Jhye Richardson: Perhaps guilty of trying a little too hard in the first innings as he made his return to Test cricket, going wicketless and conceding more than four runs per over. Looked much better in the second innings, producing an absolute cracker early on to dismiss Haseeb Hameed and finishing with the first five-wicket haul of his Test career. 8 Nathan Lyon: Now that the 400th wicket is out of the way Lyon appears to have regained his mojo, troubling all the English batters during this match. His dismissal of Chris Woakes in the first innings was off-spin bowling at its best. 8 For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400026/pickerimage.jpg","source_id":"nine"},{"title":"“Kobe Bryant had a legitimate chance to better Wilt Chamberlain’s 100 point game”: On this day in 2005 Lakers legend Kobe Bryant outscored the entire Dallas Mavericks team all by himself","link":"https://thesportsrush.com/nba-news-kobe-bryant-had-a-legitimate-chance-to-better-wilts-100-point-game-on-this-day-in-2005-lakers-legend-kobe-bryant-outscored-the-entire-dallas-mavericks-team-all-by-himself/","keywords":["Basketball","Dallas Mavericks","Dirk Nowitzki","Kobe Bryant","LA Lakers","Wilt Chamberlain"],"creator":["Aman Jain"],"video_url":null,"description":"Kobe Bryant was a scoring machine. 16 years ago, The Black Mamba had the most impressive game of his career. Kobe Bryant is one of the most iconic players in the history of the NBA. He truly mastered the art of scoring. His tenacity and obsession to succeed no matter what set him apart from… The post “Kobe Bryant had a legitimate chance to better Wilt Chamberlain’s 100 point game”: On this day in 2005 Lakers legend Kobe Bryant outscored the entire Dallas Mavericks team all by himself appeared first on The SportsRush.","content":"Kobe Bryant was a scoring machine. 16 years ago, The Black Mamba had the most impressive game of his career. Kobe Bryant is one of the most iconic players in the history of the NBA. He truly mastered the art of scoring. His tenacity and obsession to succeed no matter what set him apart from his peers. There are multiple occasions where Kobe went on an offensive onslaught all by himself. However, the pinnacle of his onslaughts came on 21st December 2005. In a matchup vs the Dirk Nowitzki-led Dallas Mavericks, Kobe Bryant unleashed his full potential. He started the game hot, draining jumper after jumper, and finding his way to the hoop at will. Bean managed to score his then career-high 62 points in just 3 quarters of play. As impressive as this feat is, the legend of the tale lies in the fact that 62 was one more than the entire Dallas Mavericks team. In addition, Bryant had an efficient night, netting 58% of his shots and 40% from beyond the arc. On this day in 2005, the @Lakers Kobe Bryant scored 62 points despite sitting out the fourth quarter of a 112-90 win over the Mavericks. Bryant is the only player in the NBA’s shot-clock era to outscore the entire opposing team through three quarters (62-61). pic.twitter.com/c7oLqqAdP8 — Justin Kubatko (@jkubatko) December 20, 2021 The lesser-known fact is that this was a revenge game from Kobe. The Lakers lost to the Rockets in a low-scoring thriller a couple of days before. “I was very angry, I felt like I wanted to come out and send a message, that we’re going to dominate at home,” he said. “We’re going to hit you, we’re going to bring it to you. I wanted to send that message.” Also Read – “24 years ago today, Kobe Bryant and Michael Jordan had their first real duel!”: Throwback to when Lakers and Bulls legend pulled their weight against each other Kobe Bryant had a real shot at breaking the all-time record for most points scored in a single game. The Lakers led the game at the end of 3 quarters with a scoreline of 95- 61. Then Lakers assistant coach Brian Shaw asked Kobe if he wanted to play the fourth quarter and get 70 points. Even the crowd chimed in, screaming ‘We want Kobe’. However, prime Kobe was not one for chasing records. Bryant replied to his coach – “I’ll do it when we really need it.” The Mamba didn’t just say those words, he meant it. He broke his career-high again in a couple of weeks, scoring 81 points to pull his team through. Then Mavericks coach Avery Johnson had this to say about Kobe’s legendary night – “We tried to double-team him, we tried to zone him, we tried to trap him in the backcourt, and nothing worked. He had his way with us tonight.” Considering Kobe’s willingness to shoot and his team having a healthy lead entering the 4th quarter, he could’ve got to 100 if he put his mind to it. Also Read – “Lebron James has literally spent half of his life in the NBA”: The Lakers superstar joins Kobe Bryant, Dirk Nowitzki on extremely exclusive, elite NBA all-time list Putting the ball in the basket is undeniably the most essential part of the game. Regardless of era, this aspect will always remain immune to change. And Kobe Bryant mastered it. There is no measure to Kobe Bryant’s influence on the basketball community around the globe. Personally, he was the reason I continued playing basketball in a country dominated by cricket. The post “Kobe Bryant had a legitimate chance to better Wilt Chamberlain’s 100 point game”: On this day in 2005 Lakers legend Kobe Bryant outscored the entire Dallas Mavericks team all by himself appeared first on The SportsRush.","pubDate":"2021-12-20 21:32:49","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Vaughan slams England’s selections and tactics","link":"https://www.cairnspost.com.au/sport/cricket/vaughan-slams-englands-selections-and-tactics/video/799efad3eefd693fc13a25339399a3c7","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Former England skipper Michael Vaughan has hit out at countrymen's selection and tactics during the Ashes so far.","content":null,"pubDate":"2021-12-20 21:28:07","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Vaughan slams England’s selections and tactics","link":"https://www.news.com.au/sport/cricket/vaughan-slams-englands-selections-and-tactics/video/799efad3eefd693fc13a25339399a3c7","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Former England skipper Michael Vaughan has hit out at countrymen's selection and tactics during the Ashes so far.","content":null,"pubDate":"2021-12-20 21:28:07","full_description":null,"image_url":null,"source_id":"news"},{"title":"Finch confirms return for Renegades following knee injury","link":"https://www.cairnspost.com.au/sport/cricket/finch-confirms-return-for-renegades-following-knee-injury/video/3041e06d21707502a6579f739c572afd","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australian T20 captain Aaron Finch is set to return for the Melbourne Renegades after recovering from a knee injury.","content":null,"pubDate":"2021-12-20 21:20:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Finch confirms return for Renegades following knee injury","link":"https://www.news.com.au/sport/cricket/finch-confirms-return-for-renegades-following-knee-injury/video/3041e06d21707502a6579f739c572afd","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Australian T20 captain Aaron Finch is set to return for the Melbourne Renegades after recovering from a knee injury.","content":null,"pubDate":"2021-12-20 21:20:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"'That's cruel': Cricket world stunned by 'heartbreaking' Ashes finish","link":"https://au.sports.yahoo.com/ashes-2021-cricket-world-stunned-heartbreaking-finish-203321873.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-20 20:33:21","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2021-12/a27e4260-61d3-11ec-9dee-f51bcdc7e3b5","source_id":"yahoo"},{"title":"Oz wins 2nd Ashes Test by 275 runs to take 2-0 lead","link":"https://www.thehansindia.com/sports/cricket/oz-wins-2nd-ashes-test-by-275-runs-to-take-2-0-lead-720803","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Australia took a 2-0 lead in the five-test Ashes series on Monday by beating England by 275 runs and all but ensured the century-old urn will remain Down Under.","content":"Oz wins 2nd Ashes Test by 275 runs to take 2-0 leadOz wins 2nd Ashes Test by 275 runs to take 2-0 leadAdelaide: Australia took a 2-0 lead in the five-test Ashes series on Monday by beating England by 275 runs and all but ensured the century-old urn will remain Down Under.Set 468 runs to win, England was bowled out for 192 with 21 overs remaining on the final day of play in the day-night test at Adelaide Oval. Jos Buttler (26) faced 207 deliveries for England before treading on his stumps to be out hit wicket in a losing cause. \"That's the attitude we have to harness through the whole game,\" England captain Joe Root said. \"The fight and attitude was great today and we just have to do more of it.\" Australia stand-in captain Steve Smith said England \"showed some really good resistance and fight.\" \"We always felt (it would only take) a couple of balls, there was still plenty of time left. We just tried to stay calm,\" Smith said. Only one team has come from 2-0 down to win an Ashes series: Don Bradman's Australians in 1936-37. As holders of the Ashes, Australia needs only to draw the next match. Paceman Jhye Richardson took five wickets as Australia followed its nine-wicket triumph in the first test in Brisbane with another resounding win, its ninth consecutive win in day-night matches. Meanwhile, Australia has named an unchanged 15-man squad for the remaining three Ashes tests. Josh Hazlewood missed the Adelaide test because of a side strain. Fast bowler and captain Pat Cummins, a late scratch from the second test because he was a close contact of a COVID-19 case, will rejoin the squad on Thursday. Hazlewood will need to prove his fitness in the Melbourne Cricket Ground nets to play the Boxing Day Test starting Dec. 26. The fourth and fifth tests in Sydney and Hobart, respectively, are in January. Under-pressure opener Marcus Harris, who averages 22.19 from 12 tests after scores of three and 23 in Adelaide, is expected to remain at the top of the order. (AP) Brief scores: Australia 473/9 dec in 150.4 overs and 230/9 dec in 61 overs beat England 236 all out in 84.1 overs and 192 all out in 113.1 overs (Rory Burns 34, Chris Woakes 44; Jhye Richardson 5/42, Mitchell Starc 2/43) by 275 runs.","pubDate":"2021-12-20 19:18:14","full_description":"Oz wins 2nd Ashes Test by 275 runs to take 2-0 lead Adelaide: Australia took a 2-0 lead in the five-test Ashes series on Monday by beating England by 275 runs and all but ensured the century-old urn will remain Down Under. Set 468 runs to win, England was bowled out for 192 with 21 overs remaining on the final day of play in the day-night test at Adelaide Oval. Jos Buttler (26) faced 207 deliveries for England before treading on his stumps to be out hit wicket in a losing cause. \"That's the attitude we have to harness through the whole game,\" England captain Joe Root said. \"The fight and attitude was great today and we just have to do more of it.\" Australia stand-in captain Steve Smith said England \"showed some really good resistance and fight.\" \"We always felt (it would only take) a couple of balls, there was still plenty of time left. We just tried to stay calm,\" Smith said. Only one team has come from 2-0 down to win an Ashes series: Don Bradman's Australians in 1936-37. As holders of the Ashes, Australia needs only to draw the next match. Paceman Jhye Richardson took five wickets as Australia followed its nine-wicket triumph in the first test in Brisbane with another resounding win, its ninth consecutive win in day-night matches. Meanwhile, Australia has named an unchanged 15-man squad for the remaining three Ashes tests. Josh Hazlewood missed the Adelaide test because of a side strain. Fast bowler and captain Pat Cummins, a late scratch from the second test because he was a close contact of a COVID-19 case, will rejoin the squad on Thursday. Hazlewood will need to prove his fitness in the Melbourne Cricket Ground nets to play the Boxing Day Test starting Dec. 26. The fourth and fifth tests in Sydney and Hobart, respectively, are in January. Under-pressure opener Marcus Harris, who averages 22.19 from 12 tests after scores of three and 23 in Adelaide, is expected to remain at the top of the order. (AP) Brief scores: Australia 473/9 dec in 150.4 overs and 230/9 dec in 61 overs beat England 236 all out in 84.1 overs and 192 all out in 113.1 overs (Rory Burns 34, Chris Woakes 44; Jhye Richardson 5/42, Mitchell Starc 2/43) by 275 runs.","image_url":"https://assets.thehansindia.com/h-upload/2021/12/20/500x300_1136737-sp.jpg","source_id":"thehansindia"},{"title":"Two years up in smoke, says ex-England skipper","link":"https://wwos.nine.com.au/cricket/ashes-2021-former-captain-mike-atherton-says-brave-england-clearly-second-best/3a23d6e1-5544-4021-89fe-bd03febef996","keywords":null,"creator":["wwos"],"video_url":null,"description":"Former England captain Michael Atherton was scathing in his assessment of his nation's performance in Adelaide.","content":"Former England captain Michael Atherton was scathing in his assessment of his nation's performance in Adelaide, having now fallen into a 0-2 hole in the Ashes series.\"A tour two years in the planning has unravelled in nine days of cricket,\" he wrote in the UK Times.He did praise the grittiness shown by England on the final day, particularly Jos Buttler, whom he compared to the great Geoffrey Boycott.AS IT HAPPENED: Australia take 2-0 series leadREAD MORE: Australia take giant step towards Ashes gloryREAD MORE: Nadal's Aus Open hopes cop cruel blow\"Although a beating competitive heart is the minimum expectation of an international team, England carried the game far, far deeper than many thought,\" he said.\"The margin of defeat was a mighty one, and the fighting spirit on the last afternoon should not camouflage the fact that England, for the second time in as many Tests, have been out-thought and outplayed.\"Once again the batting has been completely underwhelming and they face a returning and refreshed Pat Cummins next as Australia announced an unchanged squad for the Boxing Day Test. Root's Ashes dreams hang by a thread.\"On BT Sport, Matt Prior and Sir Alastair Cook found it hard to find positives in a match that England really targeted as a win.\"They've made too many mistakes in these two games,\" Cook said.\"Fielding isn't as good as Australia's, the decision-making off the field to get to this point hasn't been good enough, and you can't afford on a tour like this to make mistakes.\"Prior said that sloppiness in both the field and with ball in hand was unacceptable at this level.\"Dropping seven catches in two Test matches, that's a huge negative,\" he said.\"Taking wickets with no balls, the amount of no balls that have been bowled by this England team. It's those elements that will be as frustrating as no leaving as well as the Australians, or bowling a bit fuller and everything else.\"\"People talk about one per centres, taking catches? That's a 20 per centre. England aren't at a place where they're focusing on the one per cent here, one per cent there. Get your 20 per cent right first.\"Both slammed the team selection process that saw Jack Leach hung out to dry in tough conditions in Brisbane, while then not picking a spinner at all in Adelaide on a wicket renowned for having a bit of turn.They were also dismissive of the idea of Saqib Mahmood, who is in Australia playing for the Sydney Thunder, earning a call-up to England's Ashes squad ahead of the Boxing Day Test, saying the problems lay elsewhere.\"I find it quite funny that we're talking about shipping bowlers in, when really, we've just spoken about batting - we need to get more runs,\" Prior said.\"Where's the conversation about our batsmen? Where's the top six? Where are runs coming from? I kind of feel like we need a bit more focus on that.\"Former Test mainstay Kevin Pietersen requested that everyone go easy on England - while also slamming them for a \"horrendous\" display.https://twitter.com/KP24/status/1472875336186609670\"PLEASE PLEASE PLEASE just give these England cricketers a bit of slack,\" he wrote.\"An Ashes tour is incredibly tough & these are not normal times right now.\"Their batting is horrendous, I know, but go easy please!\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-20 19:16:50","full_description":"Former England captain Michael Atherton was scathing in his assessment of his nation's performance in Adelaide, having now fallen into a 0-2 hole in the Ashes series. \"A tour two years in the planning has unravelled in nine days of cricket,\" he wrote in the UK Times . He did praise the grittiness shown by England on the final day, particularly Jos Buttler, whom he compared to the great Geoffrey Boycott. AS IT HAPPENED: Australia take 2-0 series lead READ MORE: Australia take giant step towards Ashes glory READ MORE: Nadal's Aus Open hopes cop cruel blow \"Although a beating competitive heart is the minimum expectation of an international team, England carried the game far, far deeper than many thought,\" he said. \"The margin of defeat was a mighty one, and the fighting spirit on the last afternoon should not camouflage the fact that England, for the second time in as many Tests, have been out-thought and outplayed. \"Once again the batting has been completely underwhelming and they face a returning and refreshed Pat Cummins next as Australia announced an unchanged squad for the Boxing Day Test. Root's Ashes dreams hang by a thread.\" On BT Sport, Matt Prior and Sir Alastair Cook found it hard to find positives in a match that England really targeted as a win. \"They've made too many mistakes in these two games,\" Cook said. \"Fielding isn't as good as Australia's, the decision-making off the field to get to this point hasn't been good enough, and you can't afford on a tour like this to make mistakes.\" Prior said that sloppiness in both the field and with ball in hand was unacceptable at this level. \"Dropping seven catches in two Test matches, that's a huge negative,\" he said. \"Taking wickets with no balls, the amount of no balls that have been bowled by this England team. It's those elements that will be as frustrating as no leaving as well as the Australians, or bowling a bit fuller and everything else.\" \"People talk about one per centres, taking catches? That's a 20 per centre. England aren't at a place where they're focusing on the one per cent here, one per cent there. Get your 20 per cent right first.\" Both slammed the team selection process that saw Jack Leach hung out to dry in tough conditions in Brisbane, while then not picking a spinner at all in Adelaide on a wicket renowned for having a bit of turn. They were also dismissive of the idea of Saqib Mahmood, who is in Australia playing for the Sydney Thunder, earning a call-up to England's Ashes squad ahead of the Boxing Day Test, saying the problems lay elsewhere. \"I find it quite funny that we're talking about shipping bowlers in, when really, we've just spoken about batting - we need to get more runs,\" Prior said. \"Where's the conversation about our batsmen? Where's the top six? Where are runs coming from? I kind of feel like we need a bit more focus on that.\" Former Test mainstay Kevin Pietersen requested that everyone go easy on England - while also slamming them for a \"horrendous\" display. \"PLEASE PLEASE PLEASE just give these England cricketers a bit of slack,\" he wrote. \"An Ashes tour is incredibly tough & these are not normal times right now. \"Their batting is horrendous, I know, but go easy please!\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/399988/pickerimage.jpg","source_id":"nine"},{"title":"RUB vs AMB Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for KCA T20 Pink Challenge 2021, Match 9","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/rub-vs-amb-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-kca-t20-pink-challenge-2021-match-9?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-20 19:14:30","full_description":"Team Ruby will take on Team Amber in the ninth match of the T20 Pink Challenge 2021 at the Sanatana Dharma College Ground in Alappuzha on Tuesday. Team Ruby lost their last game against Team Pearl by seven runs. They were bundled out for 94 runs and will be looking for an improved batting performance. Team Ruby have lost all three matches so far and will be eager for a quick turnaround in fortunes. Team Amber also lost their last game by a narrow margin. They’ve won two of their three matches in the competition. RUB XI Akshaya Sadanandan (c), M Abina, Siha Santosh, MP Aleena, Najla Noushad, Jipsa Joseph, C K Maneesha, NR Anjana, Aleena Ann Joy, SR Urvasi, M Aiswarya AMB XI H U Bhoomika, Jincy George, Sabu Malavika, Mrudhula V S, Sourabhya P, Amit Unni Saraswathi, Jayalekshmi Dev, Nithuan K R, Gayathri S, Sandra Suren, M Aswathy RUB vs AMB, KCA T20 Pink Challenge 2021, Match 9 Date and Time: 21st December, 2021, 9:00 AM IST Venue: Sanatana Dharma College Ground, Alappuzha The surface is expected to favor the bowlers who will hope to be in control of the game. The highest score over the last four games has been 128. A score of 120 could prove to be par on this wicket and teams winning the toss should bat first. Wicketkeeper M Abina could prove to be an effective wicket-keeper choice for your Dream11 fantasy side. She will be crucial in the middle-order for her side. Batters G Jincy was in inspired form in the match against Team Emerald. She remained not out on 69 runs and played a key role for her team. S Salilan can play the role of a finisher in her team. In the previous match against Team Sapphire, she remained not out on 24 and led her team to victory All-rounders A Sadanandan has shown her exquisite stroke-making skills as well as her ability to pick up wickets on a regular basis. Sadanandan can fetch a lot of points and could prove to be a wonderful captaincy choice for your RUB vs AMB Dream11 fantasy side. Bowlers N Noushad has been incredibly consistent and competitive with the ball. She has picked up four wickets in three matches so far. A Sadanandan (RUB) – 236 points G Jincy (AMB) – 221 points N Noushad (RUB) – 170 points M Abina (RUB) – 131 points M Aleena (RUB) – 129 points A Sadanandan: 71 runs and 4 wickets G Jincy: 142 runs N Noushad: 4 wickets Fantasy Suggestion #1: M Abina, D Jayalekshmi, G Jincy, H U Bhoomika, S Salilan, A Sadanandan, P Sourabhya, S Sandra, N Noushad, M Aleena, V S Mrudhula Captain: A Sadanandan , Vice-Captain: G Jincy Fantasy Suggestion #2: M Abina, G Jincy, H U Bhoomika, S Siha, A Sadanandan, P Sourabhya, S Sandra, N Noushad, M Aleena, V S Mrudhula, S Malavika Captain: N Noushad , Vice-Captain: P Sourabhya","image_url":"https://static.sportskeeda.com/editor/2021/12/e0892-16400247790465-1920.jpg","source_id":"sportskeeda"},{"title":"40yo Aussie county ace Hogan's last hurrah","link":"https://thewest.com.au/sport/cricket/40yo-aussie-county-ace-hogans-last-hurrah-c-5031231","keywords":null,"creator":["Ian Chadband"],"video_url":null,"description":"Australian paceman Michael Hogan will enjoy one last season as a Glamorgan county cricket hero before calling it quits - at the ripe old age of 41.","content":null,"pubDate":"2021-12-20 19:13:51","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5031231/a2ac65272eecda59132015df6e9c92cb1adc974a-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"40yo Aussie county ace Hogan's last hurrah","link":"https://www.perthnow.com.au/sport/cricket/40yo-aussie-county-ace-hogans-last-hurrah-c-5031232","keywords":null,"creator":["Ian Chadband"],"video_url":null,"description":"Australian paceman Michael Hogan will enjoy one last season as a Glamorgan county cricket hero before calling it quits - at the ripe old age of 41.","content":null,"pubDate":"2021-12-20 19:13:51","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5031232/a2ac65272eecda59132015df6e9c92cb1adc974a-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"India's Tour Of South Africa: All Matches To Take Place Behind Closed Doors, Says Cricket South Afri.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiqAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9pbmRpYXMtdG91ci1vZi1zb3V0aC1hZnJpY2EtYWxsLW1hdGNoZXMtdG8tdGFrZS1wbGFjZS1pbi1mcm9udC1vZi1lbXB0eS1zdGFkaXVtcy1zYXlzLWNyaWNrZXQtc291dGgtYWZyaWNhLTI2NjE3NzfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India's Tour Of South Africa: All Matches To Take Place Behind Closed Doors, Says Cricket South Afri..  NDTV SportsIndia-South Africa series to be played behind closed doors  ESPNcricinfoNo ticket sales for India series caps day of bad news for CSA | Cricbuzz.com  CricbuzzIndia vs South Africa series to be held behind closed doors due to Covid-19  Times of IndiaIND vs SA: A look at luxurious resort where Virat Kohli and Co are staying in strict bio-bubble  DNA IndiaView Full coverage on Google News","content":null,"pubDate":"2021-12-20 18:07:00","image_url":null,"source_id":"google"},{"title":"India's Tour Of South Africa: All Matches To Take Place Behind Closed Doors, Says Cricket South Afri.. - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiqAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9pbmRpYXMtdG91ci1vZi1zb3V0aC1hZnJpY2EtYWxsLW1hdGNoZXMtdG8tdGFrZS1wbGFjZS1pbi1mcm9udC1vZi1lbXB0eS1zdGFkaXVtcy1zYXlzLWNyaWNrZXQtc291dGgtYWZyaWNhLTI2NjE3NzfSAa4BaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vc291dGgtYWZyaWNhLXZzLWluZGlhLTIwMjEtMjIvaW5kaWFzLXRvdXItb2Ytc291dGgtYWZyaWNhLWFsbC1tYXRjaGVzLXRvLXRha2UtcGxhY2UtaW4tZnJvbnQtb2YtZW1wdHktc3RhZGl1bXMtc2F5cy1jcmlja2V0LXNvdXRoLWFmcmljYS0yNjYxNzc3L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India's Tour Of South Africa: All Matches To Take Place Behind Closed Doors, Says Cricket South Afri..  NDTVSports.comIndia-South Africa series to be played behind closed doors  ESPNcricinfoNo ticket sales for India series caps day of bad news for CSA | Cricbuzz.com  CricbuzzBoxing Day Test between India and South Africa to be played without spectators: Report  Times of IndiaCricket: India’s series in South Africa to be played without fans, say CSA  Scroll.inView Full coverage on Google News","content":null,"pubDate":"2021-12-20 18:07:00","image_url":null,"source_id":"google"}]}