{"newsArray":[{"title":"BCCI Contracts: Ravindra Jadeja Promoted To A+ Category With Virat Kohli, Rohit Sharma And Jasprit Bumrah, KL Rahul Demoted","link":"https://zeenews.india.com/cricket/bcci-contracts-ravindra-jadeja-promoted-to-a-category-with-virat-kohli-rohit-sharma-and-jasprit-bumrah-kl-rahul-demoted-2588178.html","keywords":null,"creator":null,"video_url":null,"description":"All-rounder Ravindra Jadeja has been added to the BCCI's 'A+' category in annual contract but KL Rahul has been demoted while Bhuvneshwar Kumar has not been considered for a contract.","content":"Team India and Chennai Super Kings all-rounder Ravindra Jadeja has made a sensational comeback from injury, which forced him to miss the T20 World Cup 2022 in Australia. Jadeja was ‘Player of the Match’ in the first two Tests of the four-match series against Australia and was instrumental in Rohit Sharma’s side clinching the series 2-1 to qualify for the World Test Championships Final. Jadeja has been rewarded for his consistent performances by the Board of Control for Cricket in India (BCCI) in the annual retainership contracts announced on Sunday (March 26) night, elevated to the A+ category – Rs 7 crore contract – which was only occupied by Rohit Sharma, Virat Kohli and Jasprit Bumrah. Another all-rounder Axar Patel was also promoted in the BCCI retainership with Axar Patel moving up to the ‘A’ category – Rs 5 crore contract. Team India opener and Lucknow Super Giants skipper KL Rahul got demoted to Grade ‘B’ – Rs 3 crore contact – after a string of poor performances. Pacer Bhuvneshwar Kumar, Ajinkya Rahane and Ishant Sharma didn’t get a contract as BCCI handed retainership to 26 cricketers in four groups of A plus (Rs 7 crore), A (Rs 5 crore), B (Rs 3 crore) and C (Rs 1 crore). It seems curtains for the experienced trio, who have been dropped from the contract list, signalling that they are no longer in the reckoning for the national team. Delhi Capitals all-rounder Axar had plenty to be happy about as he was promoted to A category, while wicketkeeper batter KS Bharat also landed a maiden central contract after being included in Group ‘C’. Team India wicketkeeper-batter Rishabh Pant, who is recovering after undergoing treatment for his injuries following a horror crash in December last year, remains in ‘A’ category, which also includes Hardik Pandya, Ravichandran Ashwin and Mohammed Shami. There were six cricketers in Group B, including Cheteshwar Pujara, KL Rahul, Shreyas Iyer, Mohammed Siraj, Suryakumar yadav and Shubman Gill. The Group C comprises 11 cricketers – Umesh Yadav, Shikhar Dhawan, Shardul Thakur, Ishan Kishan, Deepak Hooda, Yuzvendra Chahal, Kuldeep Yadav, Washington Sundar, Sanju Samson, Arshdeep Singh, besides Bharat. The elite ‘A plus’ category has players who are a sure shot candidate for all three formats, while ‘A’ comprises cricketers who are certainties for Tests and one-dayers. Players who are considered for limited-over cricket are in Group B, while C group players are generally considered for one of the three formats regularly. NEWS _- BCCI announces annual player retainership 2022-23 - Team India (Senior Men). More details here - https://t.co/kjK4KxoDdK #TeamIndia — BCCI (@BCCI) March 26, 2023 Here are the BCCI Contracts for 2022-23 season… A+ category: Rohit Sharma, Virat Kohli, Jasprit Bumrah and Ravindra Jadeja A category: Hardik Pandya, R Ashwin, Mohammed Shami, Rishabh Pant, Axar Patel B category: Cheteshwar Pujara, KL Rahul, Shreyas Iyer, Mohammed Siraj, Suryakumar Yadav, Shubman Gill C category: Umesh Yadav, Shikhar Dhawan, Shardul Thakur, Ishan Kishan, Deepak Hooda, Yuzvendra Chahal, Kuldeep Yadav, Washington Sundar, Sanju Samson, Arshdeep Singh, KS Bharat","pubDate":"2023-03-27 00:55:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"Williams, fans help Chevrons seal series win","link":"https://www.hmetro.co.zw/williams-fans-help-chevrons-seal-series-win/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Blessing Malinganiza ZIMBABWE put Netherlands in their rightful place with a comfortable seven-wicket win before a capacity crowd to seal a 2-1 series win at Harare Sports Club on Saturday. All-rounder Sean Williams was the star of the show, taking three wickets for 41 runs and later scoring 43 runs off 53 balls. For his […]","content":"H-Metro Blessing Malinganiza ZIMBABWE put Netherlands in their rightful place with a comfortable seven-wicket win before a capacity crowd to seal a 2-1 series win at Harare Sports Club on Saturday. All-rounder Sean Williams was the star of the show, taking three wickets for 41 runs and later scoring 43 runs off 53 balls. For his match-winning performance he was adjudged player of the match and subsequently named player of the tournament for his 120 runs in just two matches and three wickets. Williams was introduced into the fray in the second match after completing his return from injury when Zimbabwe had gone down in the first One Day International to trail 1-0. Although the ICC Men’s Cricket World Cup Super League series had no bearing on both teams’ qualification for India 2023, Williams said winning becomes a habit. And, they need this for their confidence heading into the World Cup Qualifiers scheduled for Zimbabwe in June. The ICC Men’s Cricket World Cup Qualifiers are set to run from June 18 to July 9 across two cities, Harare and Bulawayo. Only two slots are left for the India World Cup. ‘‘It’s huge for us (series victory) as a team and it’s huge for me as a senior player and for the senior players in the team to keep setting standards for the juniors,” Williams said after the match. “You know growing up underneath us and learning, mentoring these boys. “I think that if we carry on along these lines we will start improving and seeing ourselves beating better sides.” Netherlands captain, Scott Edwards said Zimbabwe made good use of their home conditions buoyed by the intimidating crowd. ‘‘Batting still let us out a few times but we have a few takeaways from the series. “Obviously, Zimbabwe utilised the conditions well, credit to them for the victory but we will be back here in a few months and hope we will have a good tournament,” said Edwards. The Dutch drew first blood with a three-wicket in the first ODI on Tuesday to lead the series 1-0 on the backdrop of Teja Nidamanuru’s unbeaten 100. Zimbabwe scrapped through to a one-run win to level the series one-all, thanks to Wessly Madhevere’s hat-trick and Zimbabwe’s only third ODI after Eddo Brandes (1997) and Prosper Utseya in 2014. Madhevere was also in the thick of things contributing a half century (50) together with Gary Balance’s unbeaten on 64. But it was Williams’ all-round display that saw the Chevrons come from a match down to seal a comfortable seven-wicket win and claim the series trophy.","pubDate":"2023-03-26 22:11:54","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"HARARE’S BIGGEST OUTDOOR PARTY","link":"https://www.hmetro.co.zw/harares-biggest-outdoor-party/","keywords":["Headlines","Sport"],"creator":["aurora"],"video_url":null,"description":"H-Metro Reporter THIS was Harare United. The capital hosted its biggest outdoor party this year at the club which carries its name. On Saturday, an estimated 15 000 people converged at Harare Sports Club for the biggest outdoor party held in the capital this year. Organisers believe twice this number could have come if the […]","content":"H-Metro H-Metro Reporter THIS was Harare United. The capital hosted its biggest outdoor party this year at the club which carries its name. On Saturday, an estimated 15 000 people converged at Harare Sports Club for the biggest outdoor party held in the capital this year. Organisers believe twice this number could have come if the venue had the capacity to hold more people. All the races in this country were represented, which made it a truly national event, and thousands of Zimbabwean flags were proudly displayed by the passionate crowd. On a clear summer day, Zimbabweans partied at Harare Sports Club as they cheered their beloved Chevrons to a series-clinching seven-wicket victory over the Netherlands. By early morning, the indications were clear that this would be a special day as hundreds of fans, many of them wearing the Chevrons shirt, poured into Harare Sports Club. By early afternoon, the venue was packed to the rafters as Zimbabweans united for the cause of their national cricket team. “I expected a big crowd but not something like this,” said Max Manda, a city businessman. “I can’t describe myself as a cricket fan but I am someone who rallies behind our national teams be it in soccer, netball, rugby, you name it. “I was surprised but at the same time impressed by the huge turn out today and the joy that was on the faces of the people. “We have some challenges in our country and now and again it’s nice to see the people smiling and enjoying themselves. That’s the power of sport, it makes us forget, for a moment the reality that power has been switched off at home and we just proudly support our representatives because they are wearing our jersey and playing for us. “It’s a pity what is happening in our football which has ensured that we can’t enjoy similar moments at the National Sports Stadium because make no mistake about it, football remains our number one sport.” Nelson Makoni, who described himself as a dealer, said it was the happiest day of his life this year. “Friday was my birthday and I can say this was a perfect birthday present for me,” he said. “I can also say this was the best day for me in a long time because it was an unbelievable atmosphere. “I was so proud to call myself a Zimbabwean today and this showed that if we are united we can achieve a lot as a country. We are very proud of our country, despite all the challenges that we face, and we keep showing the world that we are a unique type of human beings. “This was magical and beautiful and one hell of a good day for us as Zimbabweans. “This was not sport, this was us as a people proudly displaying our colours.”","pubDate":"2023-03-26 22:05:46","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Chevrons bounce back in crucial moment","link":"https://www.chronicle.co.zw/chevrons-bounce-back-in-crucial-moment/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter SINCE Dave Houghton took over the reins as Zimbabwe senior men’s national cricket team, the side has been playing positive cricket and the decider on Saturday against Netherlands was one of their best displays after a poor show at the start of the series. The Chevrons team was plagued by poor performances […]","content":"The Chronicle SINCE Dave Houghton took over the reins as Zimbabwe senior men’s national cricket team, the side has been playing positive cricket and the decider on Saturday against Netherlands was one of their best displays after a poor show at the start of the series. The Chevrons team was plagued by poor performances in the first two matches, with dismal batting, fielding and decision-making hampering their progress despite being a full-strength squad with a lot of talent. However, they gave their all in the decider and sent a strong message. Zimbabwe will be looking to build on the momentum they got on Saturday as their focus shifts to the World Cup Qualifiers which will be hosted in the country in June. If the performance in the three-match series against Netherlands is anything to go by, the team is in the right shape to book their ticket to the World Cup in India later in the year. Clive Madande and Wessly Madhevere were some of the key players in the Chevrons team, putting up brilliant performances. In the first match, it took a special innings from Madande to guide the home side to a competitive total. He scored a brilliant, career-best 74 runs from 98 deliveries, guiding the Chevrons to a respectable total of 249 after they were sent in to bat first. However, Zimbabwe went on to lose by three wickets after a spirited batting performance from the visitors. In the second match, with the pressure on, Madhevere led the charge to become the first Zimbabwean bowler since Prosper Utseya to pick up a hat-trick in ODIs, his sensational bowling giving Zimbabwe a fighting chance having, earlier scored 43 runs. Needing 272 runs to win, Netherlands were bowled out for 270 runs in exactly 50 overs. In that match, Madande continued his form to score yet another brilliant half century before he fell for 52 runs from 57 balls while seasoned campaigner, Sean Williams top scored with 77 runs off 73 balls as Zimbabwe showed glimpse of life. A strong message ahead of the June Qualifiers was sent on Saturday in the decider which Zimbabwe convincingly won by seven wickets. Playing in front of a capacity crowd, Zimbabwe were sent in to bowl first and restricted the Dutch to 231/9 in 50 overs before they went on to put a brilliant effort with the bat, finishing on 235/3 in 41.4 overs to clinch the series 2-1. Williams and Madhevere continued with their brilliant performances and Garry Ballance found his groove again in the most important time. Sikandar Raza came good once again which is a good sign for the team that appeared to have moved on from the two dismal performances when the series got underway. Extending the gap between them and Netherlands in the Super League, the series victory was a morale booster for Houghton’s men and will come in handy in a few months. However, some aspects like death bowling and fielding will have to be worked on. Match winning catches were dropped and runs given away in the last and crucial moments of the games. — @brandon_malvin","pubDate":"2023-03-26 22:04:03","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Wise Owl crowned Petra T20 champs","link":"https://www.chronicle.co.zw/wise-owl-crowned-petra-t20-champs/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter MARONDERA based, Wise Owl High School were crowned champions of the 2023 Petra Twenty20 cricket tournament after a four wicket triumph over Christian Brothers College (CBC) at Petra College Senior on Saturday. Having four national Under-19 players, the eventual champions scored 128/6 in 19.2 overs and went on to bowl out CBC […]","content":"The Chronicle MARONDERA based, Wise Owl High School were crowned champions of the 2023 Petra Twenty20 cricket tournament after a four wicket triumph over Christian Brothers College (CBC) at Petra College Senior on Saturday. Having four national Under-19 players, the eventual champions scored 128/6 in 19.2 overs and went on to bowl out CBC for 125 runs in 18 overs to win the exciting final. Tashinga Makoni was Wise Owl’s leading run scorer with 29 runs off 33 deliveries while Leeroy Chiwaula scored 20 runs off 14 deliveries. Brendon Senzere chipped in with 19 runs off 18 deliveries in the first innings of the match. Travis Pettican was the star with the ball for CBC after he finished with figures 3/24 in his four overs while Rudra Desai took two scalps for 17 runs in his four over spell. In their chase, CBC lost the early wicket of their skipper, Saxon Pettican in the second over for 15 runs which was the team’s third highest score in the match. The high scorer was Zimbabwe Under-19 player, Munashe Chimusoro who scored 35 runs from 23 balls while Justin Steyn remained undefeated on 27 runs from 13 deliveries as they fell short of making sure that the trophy stays in Bulawayo. Tadiwanashe Kurehwatira and Simbarashe Mudzengerere took three wickets each for Wise Owl to guide them to victory. A total of eight teams took part in the tournament with one coming from Botswana. The schools which participated were Petra, Heritage, CBC, Kyle College, Eaglesvale, Wise Owl, Milton Boys High and John McKenzie of Botswana. The eight teams were put into three groups of three teams but Pool A only had two teams, Heritage and Petra where the former proceeded through with two points. In Pool B, CBC topped the standings with four points after two wins followed by Kyle College on two points while Eaglesvale finished at the bottom with zero points. Wise Owl topped Pool C with four points followed by Milton on two points and John McKenzie with none. “Everything went well according to our expectations and I was impressed with the level of cricket that was displayed by all the players who took part. The more we play such tournaments, the more the youngsters will get better and take their cricket to the next level so we are looking forward to hosting bigger and better tournaments next time,” said tournament director, Stanslaus Rukato. Petra College Senior headmaster, Robert Aldrige said they look forward to hosting the tournament again next year as it will help juniors cricket grow and move from strength to strength. He added that exposing players to teams that they don’t often play with is an important way of growing the game. — @brandon_malvin","pubDate":"2023-03-26 22:03:21","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"South Africa ace record run chase to level series","link":"http://island.lk/south-africa-ace-record-run-chase-to-level-series/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"In what was another incredible run fest at Centurion, South Africa brushed aside West Indies by six-wickets with a record-breaking run chase in the second T20I on Sunday (March 26). Set an unrealistic target of 259 on a perfect batting surface with short boundaries, South Africa’s openers made a mockery of the assignment, racking up […]","content":"In what was another incredible run fest at Centurion, South Africa brushed aside West Indies by six-wickets with a record-breaking run chase in the second T20I on Sunday (March 26). Set an unrealistic target of 259 on a perfect batting surface with short boundaries, South Africa’s openers made a mockery of the assignment, racking up a century stand inside the PowerPlay itself. It was the sort of assault that West Indies were least expecting and the the Quinton de Kock-Reeza Hendricks partnership did it with minimum fuss, using the pristine conditions to the fullest. By the time the stand was broken, the chase seemed to be a formality of sorts, considering the hosts’ firepower in the middle order and despite losing a few wickets in the middle overs, skipper Aiden Markram and Heinrich Klaasen got the job done with seven balls to spare. The freak batting show from the Proteas overshadowed West Indies’ unreal batting performance earlier in the game, with the visitors posting their highest-ever total in the shortest format of the game. It was an exhibition of brutal power-hitting, led by Johnson Charles who smashed the joint-second fastest century of all time. He got good support from the others, notably Romario Shepherd and skipper Rovman Powell as the South African bowlers were taken to the cleaners. Only Kagiso Rabada managed to withstand the onslaught to some extent but even he went at over 10 runs-per-over. At the halfway stage, it seemed like West Indies had closed the door on this series but South Africa led by de Kock broke that open with a historic batting effort. A total of 46 boundaries and 35 sixes were hit in this mind-boggling contest. The final game of the series will be played at The Wanderers, Johannesburg on Tuesday (March 26). Brief scores: South Africa 259/4 in 18.5 overs (Qintotn de Kock 100, Reeza Hendricks 68, Aiden Markram 38*) West Indies 258/5 in 20 overs (Charles 118, Mayers 51, Shepherd 41*) six wickets Published on By Mumbai Indians were crowned the inaugural champions of the Women’s Premier League after a tense, low-scoring final at the Cricket Club of India in Mumbai. In a nervy title clash between the two best teams of the competition, it was the experience of Nat Sciver-Brunt that helped Mumbai get across the line, the star all-rounder following up her Eliminator blitz with a more measured knock of 60* off 55 balls. Sciver-Brunt’s half-century and her crucial partnership of 72 with Harmanpreet Kaur (37) came after an excellent bowling performance, particularly from Hayley Matthews and Melie Kerr, that restricted the Delhi Capitals to a modest total of 131. Brief scores: 131/9 in 20 overs (Meg Lanning 35, Radha Yadav 27*; Hayley Matthews 3-5, Issy Wong 3-42, Melie Kerr 2-18) 134/3 in 19.3 overs (Nat Sciver-Brunt 60*, Harmanpreet Kaur 37; Radha Yadav 1-24) Published on By It’s been a while since a mystery Sri Lankan spinner bamboozled the opposition batsmen. Not just batsmen but coaches went on a frenzy decoding these bowlers while Times of India and Daily Telegraph dedicated headlines praising how well Sri Lanka groomed these sensational talents. Ajantha Mendis was the last global sensation with bit of mystery as his carrom ball humbled India’s fabulous batting line-up comprising Sehwag, Dravid, Tendulkar, Laxman and Ganguly. After him T. M. Dilshan opening the batting with field restrictions on came up with a scoop shot over the head of the wicketkeeper that later became popular as Dilscoop. Not exactly mystery but Sri Lanka promoting unorthodox style of play totally contrary to the coaching manual had been appreciated and encouraged. Not just Dilshan and Mendis but Lasith Malinga, Muttiah Muralitharan and Sanath Jayasuriya all broke convention and were extremely successful. Credit to selectors and captains for encouraging these natural talents and more importantly for the coaches, especially at lower levels, for not sidelining them for being different. Mendis and Malinga weren’t hits at school cricket and they were more or less groomed after they left school. But Jayasuriya and Murali were entirely different. Thankfully their early coaches did not tinker too much with their style. Coaches nowadays are too engaged in the sport. They roam around the boundary rope providing ball by ball instructions making the captain redundant. Imagine how much impact they’d be having on players at training and there’s little room for creativity. Cricket Academies are mushrooming as well with little monitoring done and you sense that not many players with unorthodox style are going to be accepted and as a result succeed. There are few rare talents with unorthodox styles. Some bowlers have copied Lasith Malinga and Matheesha Pathirana has earned an IPL deal even before he’s become a permanent fixture in the Sri Lankan side. Paul Adams earned a nickname ‘frog in the blender’ for his action and anyone who sees Sri Lankan spinner Kevin Koththigoda from down south will remember the South African wrist spinner. Funnily Richmond College, Galle seem to be nurturing these special talents and Kamindu Mendis is another player who can make a big impact. He’s nowadays mostly in the Test squad and nearly featured in the second Test in Wellington. He’s there in the team for his batting but he’s ambidextrous and bowls both left-arm spin and off-spin with good accuracy. That makes him an ideal candidate for shorter formats of the game and that’s where he should perhaps focus more at succeeding. Published on By Gateway College emerged Under 18 Netball Champions at the Inter International School tournament organized by Colombo International School (CIS) played at the Sugadadasa Indoor Stadium. Gateway College, led by calm and composed Rithika Srikanth, beat Lyceum Wattala 16 -8 in the final after leading 9 – 6 at the breather. Gateway entered the final by beating their counterpart in Kandy 12 -6. At the Group stages, Gateway beat ILMA 16– 5, Lyceum Nugegoda 12 – 1, CIS Colombo 17 – 0 and the British School in Colombo 18 – 0. Gateway’s young star Shenoshi Abeygunawardena was crowned the Netball Queen and Cloe Thillakaratne was adjudged as the Best Defensive player. Mawrya Liyanage did the vital turnarounds to keep Lyceum Wattala under check and Goal Attack Onadhi Samarakoon was outstanding with her accurate shooting.","pubDate":"2023-03-26 21:44:36","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Spinners, Sciver-Brunt guide Mumbai Indians women to WPL title","link":"http://island.lk/spinners-sciver-brunt-guide-mumbai-indians-women-to-wpl-title/","keywords":["Sports","Featured","WPL2023"],"creator":["Priyan"],"video_url":null,"description":"Mumbai Indians were crowned the inaugural champions of the Women’s Premier League after a tense, low-scoring final at the Cricket Club of India in Mumbai. In a nervy title clash between the two best teams of the competition, it was the experience of Nat Sciver-Brunt that helped Mumbai get across the line, the star all-rounder […]","content":"Mumbai Indians were crowned the inaugural champions of the Women’s Premier League after a tense, low-scoring final at the Cricket Club of India in Mumbai. In a nervy title clash between the two best teams of the competition, it was the experience of Nat Sciver-Brunt that helped Mumbai get across the line, the star all-rounder following up her Eliminator blitz with a more measured knock of 60* off 55 balls. Sciver-Brunt’s half-century and her crucial partnership of 72 with Harmanpreet Kaur (37) came after an excellent bowling performance, particularly from Hayley Matthews and Melie Kerr, that restricted the Delhi Capitals to a modest total of 131. Brief scores: 131/9 in 20 overs (Meg Lanning 35, Radha Yadav 27*; Hayley Matthews 3-5, Issy Wong 3-42, Melie Kerr 2-18) 134/3 in 19.3 overs (Nat Sciver-Brunt 60*, Harmanpreet Kaur 37; Radha Yadav 1-24) Published on By In what was another incredible run fest at Centurion, South Africa brushed aside West Indies by six-wickets with a record-breaking run chase in the second T20I on Sunday (March 26). Set an unrealistic target of 259 on a perfect batting surface with short boundaries, South Africa’s openers made a mockery of the assignment, racking up a century stand inside the PowerPlay itself. It was the sort of assault that West Indies were least expecting and the the Quinton de Kock-Reeza Hendricks partnership did it with minimum fuss, using the pristine conditions to the fullest. By the time the stand was broken, the chase seemed to be a formality of sorts, considering the hosts’ firepower in the middle order and despite losing a few wickets in the middle overs, skipper Aiden Markram and Heinrich Klaasen got the job done with seven balls to spare. The freak batting show from the Proteas overshadowed West Indies’ unreal batting performance earlier in the game, with the visitors posting their highest-ever total in the shortest format of the game. It was an exhibition of brutal power-hitting, led by Johnson Charles who smashed the joint-second fastest century of all time. He got good support from the others, notably Romario Shepherd and skipper Rovman Powell as the South African bowlers were taken to the cleaners. Only Kagiso Rabada managed to withstand the onslaught to some extent but even he went at over 10 runs-per-over. At the halfway stage, it seemed like West Indies had closed the door on this series but South Africa led by de Kock broke that open with a historic batting effort. A total of 46 boundaries and 35 sixes were hit in this mind-boggling contest. The final game of the series will be played at The Wanderers, Johannesburg on Tuesday (March 26). Brief scores: South Africa 259/4 in 18.5 overs (Qintotn de Kock 100, Reeza Hendricks 68, Aiden Markram 38*) West Indies 258/5 in 20 overs (Charles 118, Mayers 51, Shepherd 41*) six wickets Published on By It’s been a while since a mystery Sri Lankan spinner bamboozled the opposition batsmen. Not just batsmen but coaches went on a frenzy decoding these bowlers while Times of India and Daily Telegraph dedicated headlines praising how well Sri Lanka groomed these sensational talents. Ajantha Mendis was the last global sensation with bit of mystery as his carrom ball humbled India’s fabulous batting line-up comprising Sehwag, Dravid, Tendulkar, Laxman and Ganguly. After him T. M. Dilshan opening the batting with field restrictions on came up with a scoop shot over the head of the wicketkeeper that later became popular as Dilscoop. Not exactly mystery but Sri Lanka promoting unorthodox style of play totally contrary to the coaching manual had been appreciated and encouraged. Not just Dilshan and Mendis but Lasith Malinga, Muttiah Muralitharan and Sanath Jayasuriya all broke convention and were extremely successful. Credit to selectors and captains for encouraging these natural talents and more importantly for the coaches, especially at lower levels, for not sidelining them for being different. Mendis and Malinga weren’t hits at school cricket and they were more or less groomed after they left school. But Jayasuriya and Murali were entirely different. Thankfully their early coaches did not tinker too much with their style. Coaches nowadays are too engaged in the sport. They roam around the boundary rope providing ball by ball instructions making the captain redundant. Imagine how much impact they’d be having on players at training and there’s little room for creativity. Cricket Academies are mushrooming as well with little monitoring done and you sense that not many players with unorthodox style are going to be accepted and as a result succeed. There are few rare talents with unorthodox styles. Some bowlers have copied Lasith Malinga and Matheesha Pathirana has earned an IPL deal even before he’s become a permanent fixture in the Sri Lankan side. Paul Adams earned a nickname ‘frog in the blender’ for his action and anyone who sees Sri Lankan spinner Kevin Koththigoda from down south will remember the South African wrist spinner. Funnily Richmond College, Galle seem to be nurturing these special talents and Kamindu Mendis is another player who can make a big impact. He’s nowadays mostly in the Test squad and nearly featured in the second Test in Wellington. He’s there in the team for his batting but he’s ambidextrous and bowls both left-arm spin and off-spin with good accuracy. That makes him an ideal candidate for shorter formats of the game and that’s where he should perhaps focus more at succeeding. Published on By Gateway College emerged Under 18 Netball Champions at the Inter International School tournament organized by Colombo International School (CIS) played at the Sugadadasa Indoor Stadium. Gateway College, led by calm and composed Rithika Srikanth, beat Lyceum Wattala 16 -8 in the final after leading 9 – 6 at the breather. Gateway entered the final by beating their counterpart in Kandy 12 -6. At the Group stages, Gateway beat ILMA 16– 5, Lyceum Nugegoda 12 – 1, CIS Colombo 17 – 0 and the British School in Colombo 18 – 0. Gateway’s young star Shenoshi Abeygunawardena was crowned the Netball Queen and Cloe Thillakaratne was adjudged as the Best Defensive player. Mawrya Liyanage did the vital turnarounds to keep Lyceum Wattala under check and Goal Attack Onadhi Samarakoon was outstanding with her accurate shooting.","pubDate":"2023-03-26 21:28:21","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Afghanistan makes history after beating Pakistan in T20I series","link":"https://www.ariananews.af/afghanistan-makes-history-after-beating-pakistan-in-t20i-series/","keywords":["Featured","Sport","Afghanistan Cricket","AFGvPak","Cricket","Cricket T20I","featured","Mohammad Nabi","Rashid Khan","T20 International"],"creator":["Ariana News"],"video_url":null,"description":"Afghanistan made history on Sunday night when they beat long-time rival Pakistan in their second successive T20I match in Sharjah to win the series. Sunday’s match saw Afghanistan beat Pakistan by 7 wickets with one ball remaining. This is the first time in Afghanistan’s cricketing history that they have beaten Pakistan in an international series […] The post Afghanistan makes history after beating Pakistan in T20I series first appeared on Ariana News.","content":"Sunday’s match saw Afghanistan beat Pakistan by 7 wickets with one ball remaining. This is the first time in Afghanistan’s cricketing history that they have beaten Pakistan in an international series and as fans back home and across the world erupted with joy after a nail-biting last two overs, congratulations started pouring in. Afghanistan Cricket Board said it was a “momentous occasion for Afghanistan cricket!” The board said in a tweet that the team had “created history by securing their first-ever T20I series win over traditional rivals Pakistan. It’s a triumph of grit, courage, and teamwork.” Rashid Khan’s squad did indeed show grit, courage and teamwork and after winning the toss and opting to bat first, Pakistan faced an early blow from Fazalhaq Farooqi who dismissed Saim Ayub for a duck on the second ball of the innings. He then trapped Abdullah Shafique LBW on the very next delivery to take Afghanistan to a dream start. Pakistan kept on losing wickets at regular intervals but Imad Wasim’s 64 not out off 57 and Shadab’s 32 off 25 took them to a respectable total. Chasing a target of 131 runs, Afghanistan were calm and focused throughout the second innings but needing 30 runs off the last three overs, and 22 from the last two overs. However Najibullah Zadran and Mohammad Nabi hit a six each off pace bowler Naseem Shah in the penultimate over to reduce the target to five runs. Zadran then hit the winning boundary off Zaman Khan’s last over to chase down the 131-run target with one ball to spare. This was Afghanistan’s first bilateral T20I series against any of the top six teams — India, England, Pakistan, South Africa, New Zealand and Australia. They have previously won a T20I series each against the West Indies and Bangladesh and five in five against Zimbabwe.","pubDate":"2023-03-26 20:55:41","image_url":null,"source_id":"ariananews","category":["sports"],"country":["Afghanistan"],"language":"english"},{"title":"News24.com | Unbelievable! Proteas shatter record for highest chase in T20I history on famous day for SA cricket","link":"https://www.news24.com/sport/Cricket/Proteas/centurion-hosts-its-own-438-event-as-proteas-make-history-in-astonishing-t20-chase-20230326","keywords":null,"creator":null,"video_url":null,"description":"To sum it up, Aiden Markram and his troops needed to overhaul 258/5 - the tallest chase in the history of T20 internationals - and duly did so, 17 years after Graeme Smith's vintage famously surprised the Australians in a world record 50-over chase.","content":"Strictly speaking, the occasion didn't warrant it - they do have bigger fish to fry against Netherlands next week - but an electric SuperSport Park on Sunday relived a '438' moment of sorts in the Proteas' second T20 against the West Indies. Aiden Markram and his troops needed to overhaul 258/5 - the tallest chase in the history of T20 internationals - and duly did so, 17 years after Graeme Smith's vintage famously surprised the Australians in a world record 50-over chase of 435 at the Wanderers. SCORECARD | Proteas v West Indies - 2nd T20 On that day, not many cricket fans and observers around the world believed a required rate of 8.68 could be sustained, and while the wild evolution of the 20-over format has illustrated to us that a chase of 244 - like Australia managed against New Zealand in 2018 - is possible, 13 an over still would've seen a fair share of Doubting Thomases emerge. Whether it was just the cheery optimism of starting a new white-ball era under Rob Walter or a Jacques Kallis walking into a muted dressing room quipping, 'The bowlers have done their job boys – I reckon they're 10 or 15 short', the South African batting order weren't going to stick to a script asking them to surrender meekly. Instead, Quinton de Kock and Reeza Hendricks crafted one of the most astonishing and memorable opening partnerships in the history of the format to orchestrate this absurdly thrilling, series-levelling victory. By the time the powerplay was done, the Proteas had reached 102 without loss, incidentally eclipsing the world record of 98 their selfsame opponents set against Sri Lanka in 2021. The 150 was reached in 10.2 overs, three balls before De Kock would be dismissed after skying a pull to Nicholas Pooran behind the stumps. The damage, however, was done. The pair could bask in work that was near-perfection. Seldom have two batters complemented each other so well. De Kock felt like the aggressor and he generally was, unleashing his trademark brand of hits all around the wicket, but reserving his best for square of the wicket. He broke his own South African record for the fastest fifty in the format by reaching the landmark in 15 deliveries. His maiden T20I hundred came at a more \"sedate\" 43 balls yet still represents the third quickest by a Protea. De Kock, who would end up hitting nine fours and eight sixes, might've been the dominant partner in terms of runs but, in a testament to the newfound class of Reeza Hendricks, who's rapidly becoming South Africa's most valuable and consistent batter in the format, he was outscored in terms of tempo. The silky right-hander was mesmerising to watch, striking 11 fours and two sixes with the minimum of fuss and fireworks in a 28-ball 68 that, in a parallel universe, might've been more important than De Kock's innings. When he was undone by a Raymon Reifer slower bouncer, the Proteas had whittled down the required rate to a more than manageable 9 and all it required was the finishing touch of Markram's muscular, unbeaten 38 off 21. Depressingly for the chastened Windies, it overshadowed all the noble deeds they had done with the bat. Johnson Charles, unexpectedly but not entirely unwelcomingly for an appreciative crowd, channeled his inner Chris Gayle as he galloped to a sensational first ton himself. It was a brilliant performance from the right-hander, who struck 11 maximums and 10 fours in a 46-ball 118 that broke the record for the islanders' quickest ton in the format (39 deliveries). Charles, a veteran who was part of the Windies' 2012 and 2016 T20 World Cup-winning campaigns, has been a journeyman in the format as his consistency has continually been cited as a blot on his copybook. However, all of those criticisms - like that of the Proteas' patently insipid bowling effort - were forgotten as he conjured up what will probably be a once-in-a-career knock, a stay at the crease where he simply could do no wrong. Typically muscular square of the wicket on both sides, Charles also showed off some brilliant striking straighter. It was a chanceless effort, only ended when a Marco Jansen yorker on leg squeezed past his defence. In fact, had the lanky quick not shown a penchant for taking wickets amidst all the runs he conceded - he ended with 3/52 - South Africa's task might've been more nail-biting. He was matched almost blow-for-blow by Kyle Mayers, whose 24-ball 50 (Charles' milestone came off 23) was equally eye-catching after he'd actually played out Aiden Markram's first five deliveries for no run in the second over. Their second-wicket partnership of 135 off just 58 deliveries, predictably, put the Windies in a prime position for their record-breaking exploits, especially after Romario Shepherd's 18-ball 41 applied the finishing touches. Unfortunately, the Proteas applied that template even better.","pubDate":"2023-03-26 18:21:30","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Player of the Match today DC vs MI Final: Who was Awarded Women’s IPL final Man of the Match 2023?","link":"https://thesportsrush.com/cricket-news-player-of-the-match-today-dc-vs-mi-final-who-was-awarded-womens-ipl-final-man-of-the-match-2023/","keywords":["Cricket","WPL 2023","Delhi Capitals Women","Mumbai Indians Women","Women's Premier League 2023"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Leading by example in Women’s tournament as well, Mumbai Indians have won the inaugural season of the Women’s Premier League after defeating Delhi Capitals by 7 wickets at the Brabourne Stadium tonight. Having gained a substantial advantage in the first innings itself, Indians were expected to win the match without much discomfort but it wasn’t… The post Player of the Match today DC vs MI Final: Who was Awarded Women’s IPL final Man of the Match 2023? appeared first on The SportsRush.","content":"Leading by example in Women’s tournament as well, Mumbai Indians have won the inaugural season of the Women’s Premier League after defeating Delhi Capitals by 7 wickets at the Brabourne Stadium tonight. Having gained a substantial advantage in the first innings itself, Indians were expected to win the match without much discomfort but it wasn’t to be as Capitals made a praiseworthy comeback into the match. Reduced to 79/9 in 16 overs primarily due to Mumbai all-rounder Hayley Matthews’ bowling figures of 4-2-5-3, Delhi posted a competitive 131/9 in 20 overs as pacer Shikha Pandey (27*) and spinner Radha Yadav (27*) put together a fighting unbeaten 24-ball 52-run partnership for the 10th wicket. In addition to Yadav, DC spinner Jess Jonassen also picked a wicket in the powerplay to put MI in some trouble. However, sense prevailed due to the presence of two senior players in all-rounder (60*) and captain (37) as the two joined hands to steer the team to a comparatively safer position. With 21 runs needed in the last two overs, Sciver-Brunt and all-rounder Amelia Kerr (14*) stood tall on their reputations as overseas players to eventually seal the run-chase with three balls left in the match. Coming in to bat at No. 3 in second over, Sciver-Brunt hit seven fours to win the Player of the Match in the night of the final. Having leaked 37 runs in her four-over spell in the first innings, Sciver-Brunt doubtlessly made amends in the second innings. Congrats on winning 🏆 Intense action on the park led by none other than oh balle oh tere skipper 🥳 Well played 🙌🏼 hard luck 👏🏼 will to open up opportunities for women’s cricket! Excited for the future! — Yuvraj Singh (@YUVSTRONG12) “It was very special. Glad I was able to stick it out when the pressure was on. I was trying to get quite tough and Harman [Harmanpreet Kaur] and Melie [Amelia Kerr] took the pressure off me. I knew if I stayed till the end we’d get through. We gave away too many [runs] in the final 3-4 overs, but it made the game interesting,” Sciver-Brunt told host broadcaster during the post-match presentation ceremony.","pubDate":"2023-03-26 18:11:23","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"BCCI Contracts: Ravindra Jadeja Promoted To A+ Category With Virat Kohli, Rohit Sharma And Jasprit Bumrah, KL Rahul Demoted","link":"https://zeenews.india.com/cricket/bcci-contracts-ravindra-jadeja-promoted-to-a-category-with-virat-kohli-rohit-sharma-and-jasprit-bumrah-kl-rahul-demoted-2588178.html","keywords":null,"creator":null,"video_url":null,"description":"All-rounder Ravindra Jadeja has been added to the BCCI's 'A+' category in annual contract but KL Rahul has been demoted while Bhuvneshwar Kumar has not been considered for a contract.","content":"Team India and Chennai Super Kings all-rounder Ravindra Jadeja has made a sensational comeback from injury, which forced him to miss the T20 World Cup 2022 in Australia. Jadeja was ‘Player of the Match’ in the first two Tests of the four-match series against Australia and was instrumental in Rohit Sharma’s side clinching the series 2-1 to qualify for the World Test Championships Final. Jadeja has been rewarded for his consistent performances by the Board of Control for Cricket in India (BCCI) in the annual retainership contracts announced on Sunday (March 26) night, elevated to the A+ category – Rs 7 crore contract – which was only occupied by Rohit Sharma, Virat Kohli and Jasprit Bumrah. Another all-rounder Axar Patel was also promoted in the BCCI retainership with Axar Patel moving up to the ‘A’ category – Rs 5 crore contract. Team India opener and Lucknow Super Giants skipper KL Rahul got demoted to Grade ‘B’ – Rs 3 crore contact – after a string of poor performances. Pacer Bhuvneshwar Kumar, Ajinkya Rahane and Ishant Sharma didn’t get a contract as BCCI handed retainership to 26 cricketers in four groups of A plus (Rs 7 crore), A (Rs 5 crore), B (Rs 3 crore) and C (Rs 1 crore). It seems curtains for the experienced trio, who have been dropped from the contract list, signalling that they are no longer in the reckoning for the national team. Delhi Capitals all-rounder Axar had plenty to be happy about as he was promoted to A category, while wicketkeeper batter KS Bharat also landed a maiden central contract after being included in Group ‘C’. Team India wicketkeeper-batter Rishabh Pant, who is recovering after undergoing treatment for his injuries following a horror crash in December last year, remains in ‘A’ category, which also includes Hardik Pandya, Ravichandran Ashwin and Mohammed Shami. There were six cricketers in Group B, including Cheteshwar Pujara, KL Rahul, Shreyas Iyer, Mohammed Siraj, Suryakumar yadav and Shubman Gill. The Group C comprises 11 cricketers – Umesh Yadav, Shikhar Dhawan, Shardul Thakur, Ishan Kishan, Deepak Hooda, Yuzvendra Chahal, Kuldeep Yadav, Washington Sundar, Sanju Samson, Arshdeep Singh, besides Bharat. The elite ‘A plus’ category has players who are a sure shot candidate for all three formats, while ‘A’ comprises cricketers who are certainties for Tests and one-dayers. Players who are considered for limited-over cricket are in Group B, while C group players are generally considered for one of the three formats regularly. NEWS _- BCCI announces annual player retainership 2022-23 - Team India (Senior Men). More details here - https://t.co/kjK4KxoDdK #TeamIndia — BCCI (@BCCI) March 26, 2023 Here are the BCCI Contracts for 2022-23 season… A+ category: Rohit Sharma, Virat Kohli, Jasprit Bumrah and Ravindra Jadeja A category: Hardik Pandya, R Ashwin, Mohammed Shami, Rishabh Pant, Axar Patel B category: Cheteshwar Pujara, KL Rahul, Shreyas Iyer, Mohammed Siraj, Suryakumar Yadav, Shubman Gill C category: Umesh Yadav, Shikhar Dhawan, Shardul Thakur, Ishan Kishan, Deepak Hooda, Yuzvendra Chahal, Kuldeep Yadav, Washington Sundar, Sanju Samson, Arshdeep Singh, KS Bharat","pubDate":"2023-03-27 00:55:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"Williams, fans help Chevrons seal series win","link":"https://www.hmetro.co.zw/williams-fans-help-chevrons-seal-series-win/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Blessing Malinganiza ZIMBABWE put Netherlands in their rightful place with a comfortable seven-wicket win before a capacity crowd to seal a 2-1 series win at Harare Sports Club on Saturday. All-rounder Sean Williams was the star of the show, taking three wickets for 41 runs and later scoring 43 runs off 53 balls. For his […]","content":"H-Metro Blessing Malinganiza ZIMBABWE put Netherlands in their rightful place with a comfortable seven-wicket win before a capacity crowd to seal a 2-1 series win at Harare Sports Club on Saturday. All-rounder Sean Williams was the star of the show, taking three wickets for 41 runs and later scoring 43 runs off 53 balls. For his match-winning performance he was adjudged player of the match and subsequently named player of the tournament for his 120 runs in just two matches and three wickets. Williams was introduced into the fray in the second match after completing his return from injury when Zimbabwe had gone down in the first One Day International to trail 1-0. Although the ICC Men’s Cricket World Cup Super League series had no bearing on both teams’ qualification for India 2023, Williams said winning becomes a habit. And, they need this for their confidence heading into the World Cup Qualifiers scheduled for Zimbabwe in June. The ICC Men’s Cricket World Cup Qualifiers are set to run from June 18 to July 9 across two cities, Harare and Bulawayo. Only two slots are left for the India World Cup. ‘‘It’s huge for us (series victory) as a team and it’s huge for me as a senior player and for the senior players in the team to keep setting standards for the juniors,” Williams said after the match. “You know growing up underneath us and learning, mentoring these boys. “I think that if we carry on along these lines we will start improving and seeing ourselves beating better sides.” Netherlands captain, Scott Edwards said Zimbabwe made good use of their home conditions buoyed by the intimidating crowd. ‘‘Batting still let us out a few times but we have a few takeaways from the series. “Obviously, Zimbabwe utilised the conditions well, credit to them for the victory but we will be back here in a few months and hope we will have a good tournament,” said Edwards. The Dutch drew first blood with a three-wicket in the first ODI on Tuesday to lead the series 1-0 on the backdrop of Teja Nidamanuru’s unbeaten 100. Zimbabwe scrapped through to a one-run win to level the series one-all, thanks to Wessly Madhevere’s hat-trick and Zimbabwe’s only third ODI after Eddo Brandes (1997) and Prosper Utseya in 2014. Madhevere was also in the thick of things contributing a half century (50) together with Gary Balance’s unbeaten on 64. But it was Williams’ all-round display that saw the Chevrons come from a match down to seal a comfortable seven-wicket win and claim the series trophy.","pubDate":"2023-03-26 22:11:54","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"HARARE’S BIGGEST OUTDOOR PARTY","link":"https://www.hmetro.co.zw/harares-biggest-outdoor-party/","keywords":["Headlines","Sport"],"creator":["aurora"],"video_url":null,"description":"H-Metro Reporter THIS was Harare United. The capital hosted its biggest outdoor party this year at the club which carries its name. On Saturday, an estimated 15 000 people converged at Harare Sports Club for the biggest outdoor party held in the capital this year. Organisers believe twice this number could have come if the […]","content":"H-Metro H-Metro Reporter THIS was Harare United. The capital hosted its biggest outdoor party this year at the club which carries its name. On Saturday, an estimated 15 000 people converged at Harare Sports Club for the biggest outdoor party held in the capital this year. Organisers believe twice this number could have come if the venue had the capacity to hold more people. All the races in this country were represented, which made it a truly national event, and thousands of Zimbabwean flags were proudly displayed by the passionate crowd. On a clear summer day, Zimbabweans partied at Harare Sports Club as they cheered their beloved Chevrons to a series-clinching seven-wicket victory over the Netherlands. By early morning, the indications were clear that this would be a special day as hundreds of fans, many of them wearing the Chevrons shirt, poured into Harare Sports Club. By early afternoon, the venue was packed to the rafters as Zimbabweans united for the cause of their national cricket team. “I expected a big crowd but not something like this,” said Max Manda, a city businessman. “I can’t describe myself as a cricket fan but I am someone who rallies behind our national teams be it in soccer, netball, rugby, you name it. “I was surprised but at the same time impressed by the huge turn out today and the joy that was on the faces of the people. “We have some challenges in our country and now and again it’s nice to see the people smiling and enjoying themselves. That’s the power of sport, it makes us forget, for a moment the reality that power has been switched off at home and we just proudly support our representatives because they are wearing our jersey and playing for us. “It’s a pity what is happening in our football which has ensured that we can’t enjoy similar moments at the National Sports Stadium because make no mistake about it, football remains our number one sport.” Nelson Makoni, who described himself as a dealer, said it was the happiest day of his life this year. “Friday was my birthday and I can say this was a perfect birthday present for me,” he said. “I can also say this was the best day for me in a long time because it was an unbelievable atmosphere. “I was so proud to call myself a Zimbabwean today and this showed that if we are united we can achieve a lot as a country. We are very proud of our country, despite all the challenges that we face, and we keep showing the world that we are a unique type of human beings. “This was magical and beautiful and one hell of a good day for us as Zimbabweans. “This was not sport, this was us as a people proudly displaying our colours.”","pubDate":"2023-03-26 22:05:46","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Chevrons bounce back in crucial moment","link":"https://www.chronicle.co.zw/chevrons-bounce-back-in-crucial-moment/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter SINCE Dave Houghton took over the reins as Zimbabwe senior men’s national cricket team, the side has been playing positive cricket and the decider on Saturday against Netherlands was one of their best displays after a poor show at the start of the series. The Chevrons team was plagued by poor performances […]","content":"The Chronicle SINCE Dave Houghton took over the reins as Zimbabwe senior men’s national cricket team, the side has been playing positive cricket and the decider on Saturday against Netherlands was one of their best displays after a poor show at the start of the series. The Chevrons team was plagued by poor performances in the first two matches, with dismal batting, fielding and decision-making hampering their progress despite being a full-strength squad with a lot of talent. However, they gave their all in the decider and sent a strong message. Zimbabwe will be looking to build on the momentum they got on Saturday as their focus shifts to the World Cup Qualifiers which will be hosted in the country in June. If the performance in the three-match series against Netherlands is anything to go by, the team is in the right shape to book their ticket to the World Cup in India later in the year. Clive Madande and Wessly Madhevere were some of the key players in the Chevrons team, putting up brilliant performances. In the first match, it took a special innings from Madande to guide the home side to a competitive total. He scored a brilliant, career-best 74 runs from 98 deliveries, guiding the Chevrons to a respectable total of 249 after they were sent in to bat first. However, Zimbabwe went on to lose by three wickets after a spirited batting performance from the visitors. In the second match, with the pressure on, Madhevere led the charge to become the first Zimbabwean bowler since Prosper Utseya to pick up a hat-trick in ODIs, his sensational bowling giving Zimbabwe a fighting chance having, earlier scored 43 runs. Needing 272 runs to win, Netherlands were bowled out for 270 runs in exactly 50 overs. In that match, Madande continued his form to score yet another brilliant half century before he fell for 52 runs from 57 balls while seasoned campaigner, Sean Williams top scored with 77 runs off 73 balls as Zimbabwe showed glimpse of life. A strong message ahead of the June Qualifiers was sent on Saturday in the decider which Zimbabwe convincingly won by seven wickets. Playing in front of a capacity crowd, Zimbabwe were sent in to bowl first and restricted the Dutch to 231/9 in 50 overs before they went on to put a brilliant effort with the bat, finishing on 235/3 in 41.4 overs to clinch the series 2-1. Williams and Madhevere continued with their brilliant performances and Garry Ballance found his groove again in the most important time. Sikandar Raza came good once again which is a good sign for the team that appeared to have moved on from the two dismal performances when the series got underway. Extending the gap between them and Netherlands in the Super League, the series victory was a morale booster for Houghton’s men and will come in handy in a few months. However, some aspects like death bowling and fielding will have to be worked on. Match winning catches were dropped and runs given away in the last and crucial moments of the games. — @brandon_malvin","pubDate":"2023-03-26 22:04:03","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Wise Owl crowned Petra T20 champs","link":"https://www.chronicle.co.zw/wise-owl-crowned-petra-t20-champs/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter MARONDERA based, Wise Owl High School were crowned champions of the 2023 Petra Twenty20 cricket tournament after a four wicket triumph over Christian Brothers College (CBC) at Petra College Senior on Saturday. Having four national Under-19 players, the eventual champions scored 128/6 in 19.2 overs and went on to bowl out CBC […]","content":"The Chronicle MARONDERA based, Wise Owl High School were crowned champions of the 2023 Petra Twenty20 cricket tournament after a four wicket triumph over Christian Brothers College (CBC) at Petra College Senior on Saturday. Having four national Under-19 players, the eventual champions scored 128/6 in 19.2 overs and went on to bowl out CBC for 125 runs in 18 overs to win the exciting final. Tashinga Makoni was Wise Owl’s leading run scorer with 29 runs off 33 deliveries while Leeroy Chiwaula scored 20 runs off 14 deliveries. Brendon Senzere chipped in with 19 runs off 18 deliveries in the first innings of the match. Travis Pettican was the star with the ball for CBC after he finished with figures 3/24 in his four overs while Rudra Desai took two scalps for 17 runs in his four over spell. In their chase, CBC lost the early wicket of their skipper, Saxon Pettican in the second over for 15 runs which was the team’s third highest score in the match. The high scorer was Zimbabwe Under-19 player, Munashe Chimusoro who scored 35 runs from 23 balls while Justin Steyn remained undefeated on 27 runs from 13 deliveries as they fell short of making sure that the trophy stays in Bulawayo. Tadiwanashe Kurehwatira and Simbarashe Mudzengerere took three wickets each for Wise Owl to guide them to victory. A total of eight teams took part in the tournament with one coming from Botswana. The schools which participated were Petra, Heritage, CBC, Kyle College, Eaglesvale, Wise Owl, Milton Boys High and John McKenzie of Botswana. The eight teams were put into three groups of three teams but Pool A only had two teams, Heritage and Petra where the former proceeded through with two points. In Pool B, CBC topped the standings with four points after two wins followed by Kyle College on two points while Eaglesvale finished at the bottom with zero points. Wise Owl topped Pool C with four points followed by Milton on two points and John McKenzie with none. “Everything went well according to our expectations and I was impressed with the level of cricket that was displayed by all the players who took part. The more we play such tournaments, the more the youngsters will get better and take their cricket to the next level so we are looking forward to hosting bigger and better tournaments next time,” said tournament director, Stanslaus Rukato. Petra College Senior headmaster, Robert Aldrige said they look forward to hosting the tournament again next year as it will help juniors cricket grow and move from strength to strength. He added that exposing players to teams that they don’t often play with is an important way of growing the game. — @brandon_malvin","pubDate":"2023-03-26 22:03:21","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"South Africa ace record run chase to level series","link":"http://island.lk/south-africa-ace-record-run-chase-to-level-series/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"In what was another incredible run fest at Centurion, South Africa brushed aside West Indies by six-wickets with a record-breaking run chase in the second T20I on Sunday (March 26). Set an unrealistic target of 259 on a perfect batting surface with short boundaries, South Africa’s openers made a mockery of the assignment, racking up […]","content":"In what was another incredible run fest at Centurion, South Africa brushed aside West Indies by six-wickets with a record-breaking run chase in the second T20I on Sunday (March 26). Set an unrealistic target of 259 on a perfect batting surface with short boundaries, South Africa’s openers made a mockery of the assignment, racking up a century stand inside the PowerPlay itself. It was the sort of assault that West Indies were least expecting and the the Quinton de Kock-Reeza Hendricks partnership did it with minimum fuss, using the pristine conditions to the fullest. By the time the stand was broken, the chase seemed to be a formality of sorts, considering the hosts’ firepower in the middle order and despite losing a few wickets in the middle overs, skipper Aiden Markram and Heinrich Klaasen got the job done with seven balls to spare. The freak batting show from the Proteas overshadowed West Indies’ unreal batting performance earlier in the game, with the visitors posting their highest-ever total in the shortest format of the game. It was an exhibition of brutal power-hitting, led by Johnson Charles who smashed the joint-second fastest century of all time. He got good support from the others, notably Romario Shepherd and skipper Rovman Powell as the South African bowlers were taken to the cleaners. Only Kagiso Rabada managed to withstand the onslaught to some extent but even he went at over 10 runs-per-over. At the halfway stage, it seemed like West Indies had closed the door on this series but South Africa led by de Kock broke that open with a historic batting effort. A total of 46 boundaries and 35 sixes were hit in this mind-boggling contest. The final game of the series will be played at The Wanderers, Johannesburg on Tuesday (March 26). Brief scores: South Africa 259/4 in 18.5 overs (Qintotn de Kock 100, Reeza Hendricks 68, Aiden Markram 38*) West Indies 258/5 in 20 overs (Charles 118, Mayers 51, Shepherd 41*) six wickets Published on By Mumbai Indians were crowned the inaugural champions of the Women’s Premier League after a tense, low-scoring final at the Cricket Club of India in Mumbai. In a nervy title clash between the two best teams of the competition, it was the experience of Nat Sciver-Brunt that helped Mumbai get across the line, the star all-rounder following up her Eliminator blitz with a more measured knock of 60* off 55 balls. Sciver-Brunt’s half-century and her crucial partnership of 72 with Harmanpreet Kaur (37) came after an excellent bowling performance, particularly from Hayley Matthews and Melie Kerr, that restricted the Delhi Capitals to a modest total of 131. Brief scores: 131/9 in 20 overs (Meg Lanning 35, Radha Yadav 27*; Hayley Matthews 3-5, Issy Wong 3-42, Melie Kerr 2-18) 134/3 in 19.3 overs (Nat Sciver-Brunt 60*, Harmanpreet Kaur 37; Radha Yadav 1-24) Published on By It’s been a while since a mystery Sri Lankan spinner bamboozled the opposition batsmen. Not just batsmen but coaches went on a frenzy decoding these bowlers while Times of India and Daily Telegraph dedicated headlines praising how well Sri Lanka groomed these sensational talents. Ajantha Mendis was the last global sensation with bit of mystery as his carrom ball humbled India’s fabulous batting line-up comprising Sehwag, Dravid, Tendulkar, Laxman and Ganguly. After him T. M. Dilshan opening the batting with field restrictions on came up with a scoop shot over the head of the wicketkeeper that later became popular as Dilscoop. Not exactly mystery but Sri Lanka promoting unorthodox style of play totally contrary to the coaching manual had been appreciated and encouraged. Not just Dilshan and Mendis but Lasith Malinga, Muttiah Muralitharan and Sanath Jayasuriya all broke convention and were extremely successful. Credit to selectors and captains for encouraging these natural talents and more importantly for the coaches, especially at lower levels, for not sidelining them for being different. Mendis and Malinga weren’t hits at school cricket and they were more or less groomed after they left school. But Jayasuriya and Murali were entirely different. Thankfully their early coaches did not tinker too much with their style. Coaches nowadays are too engaged in the sport. They roam around the boundary rope providing ball by ball instructions making the captain redundant. Imagine how much impact they’d be having on players at training and there’s little room for creativity. Cricket Academies are mushrooming as well with little monitoring done and you sense that not many players with unorthodox style are going to be accepted and as a result succeed. There are few rare talents with unorthodox styles. Some bowlers have copied Lasith Malinga and Matheesha Pathirana has earned an IPL deal even before he’s become a permanent fixture in the Sri Lankan side. Paul Adams earned a nickname ‘frog in the blender’ for his action and anyone who sees Sri Lankan spinner Kevin Koththigoda from down south will remember the South African wrist spinner. Funnily Richmond College, Galle seem to be nurturing these special talents and Kamindu Mendis is another player who can make a big impact. He’s nowadays mostly in the Test squad and nearly featured in the second Test in Wellington. He’s there in the team for his batting but he’s ambidextrous and bowls both left-arm spin and off-spin with good accuracy. That makes him an ideal candidate for shorter formats of the game and that’s where he should perhaps focus more at succeeding. Published on By Gateway College emerged Under 18 Netball Champions at the Inter International School tournament organized by Colombo International School (CIS) played at the Sugadadasa Indoor Stadium. Gateway College, led by calm and composed Rithika Srikanth, beat Lyceum Wattala 16 -8 in the final after leading 9 – 6 at the breather. Gateway entered the final by beating their counterpart in Kandy 12 -6. At the Group stages, Gateway beat ILMA 16– 5, Lyceum Nugegoda 12 – 1, CIS Colombo 17 – 0 and the British School in Colombo 18 – 0. Gateway’s young star Shenoshi Abeygunawardena was crowned the Netball Queen and Cloe Thillakaratne was adjudged as the Best Defensive player. Mawrya Liyanage did the vital turnarounds to keep Lyceum Wattala under check and Goal Attack Onadhi Samarakoon was outstanding with her accurate shooting.","pubDate":"2023-03-26 21:44:36","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Spinners, Sciver-Brunt guide Mumbai Indians women to WPL title","link":"http://island.lk/spinners-sciver-brunt-guide-mumbai-indians-women-to-wpl-title/","keywords":["Sports","Featured","WPL2023"],"creator":["Priyan"],"video_url":null,"description":"Mumbai Indians were crowned the inaugural champions of the Women’s Premier League after a tense, low-scoring final at the Cricket Club of India in Mumbai. In a nervy title clash between the two best teams of the competition, it was the experience of Nat Sciver-Brunt that helped Mumbai get across the line, the star all-rounder […]","content":"Mumbai Indians were crowned the inaugural champions of the Women’s Premier League after a tense, low-scoring final at the Cricket Club of India in Mumbai. In a nervy title clash between the two best teams of the competition, it was the experience of Nat Sciver-Brunt that helped Mumbai get across the line, the star all-rounder following up her Eliminator blitz with a more measured knock of 60* off 55 balls. Sciver-Brunt’s half-century and her crucial partnership of 72 with Harmanpreet Kaur (37) came after an excellent bowling performance, particularly from Hayley Matthews and Melie Kerr, that restricted the Delhi Capitals to a modest total of 131. Brief scores: 131/9 in 20 overs (Meg Lanning 35, Radha Yadav 27*; Hayley Matthews 3-5, Issy Wong 3-42, Melie Kerr 2-18) 134/3 in 19.3 overs (Nat Sciver-Brunt 60*, Harmanpreet Kaur 37; Radha Yadav 1-24) Published on By In what was another incredible run fest at Centurion, South Africa brushed aside West Indies by six-wickets with a record-breaking run chase in the second T20I on Sunday (March 26). Set an unrealistic target of 259 on a perfect batting surface with short boundaries, South Africa’s openers made a mockery of the assignment, racking up a century stand inside the PowerPlay itself. It was the sort of assault that West Indies were least expecting and the the Quinton de Kock-Reeza Hendricks partnership did it with minimum fuss, using the pristine conditions to the fullest. By the time the stand was broken, the chase seemed to be a formality of sorts, considering the hosts’ firepower in the middle order and despite losing a few wickets in the middle overs, skipper Aiden Markram and Heinrich Klaasen got the job done with seven balls to spare. The freak batting show from the Proteas overshadowed West Indies’ unreal batting performance earlier in the game, with the visitors posting their highest-ever total in the shortest format of the game. It was an exhibition of brutal power-hitting, led by Johnson Charles who smashed the joint-second fastest century of all time. He got good support from the others, notably Romario Shepherd and skipper Rovman Powell as the South African bowlers were taken to the cleaners. Only Kagiso Rabada managed to withstand the onslaught to some extent but even he went at over 10 runs-per-over. At the halfway stage, it seemed like West Indies had closed the door on this series but South Africa led by de Kock broke that open with a historic batting effort. A total of 46 boundaries and 35 sixes were hit in this mind-boggling contest. The final game of the series will be played at The Wanderers, Johannesburg on Tuesday (March 26). Brief scores: South Africa 259/4 in 18.5 overs (Qintotn de Kock 100, Reeza Hendricks 68, Aiden Markram 38*) West Indies 258/5 in 20 overs (Charles 118, Mayers 51, Shepherd 41*) six wickets Published on By It’s been a while since a mystery Sri Lankan spinner bamboozled the opposition batsmen. Not just batsmen but coaches went on a frenzy decoding these bowlers while Times of India and Daily Telegraph dedicated headlines praising how well Sri Lanka groomed these sensational talents. Ajantha Mendis was the last global sensation with bit of mystery as his carrom ball humbled India’s fabulous batting line-up comprising Sehwag, Dravid, Tendulkar, Laxman and Ganguly. After him T. M. Dilshan opening the batting with field restrictions on came up with a scoop shot over the head of the wicketkeeper that later became popular as Dilscoop. Not exactly mystery but Sri Lanka promoting unorthodox style of play totally contrary to the coaching manual had been appreciated and encouraged. Not just Dilshan and Mendis but Lasith Malinga, Muttiah Muralitharan and Sanath Jayasuriya all broke convention and were extremely successful. Credit to selectors and captains for encouraging these natural talents and more importantly for the coaches, especially at lower levels, for not sidelining them for being different. Mendis and Malinga weren’t hits at school cricket and they were more or less groomed after they left school. But Jayasuriya and Murali were entirely different. Thankfully their early coaches did not tinker too much with their style. Coaches nowadays are too engaged in the sport. They roam around the boundary rope providing ball by ball instructions making the captain redundant. Imagine how much impact they’d be having on players at training and there’s little room for creativity. Cricket Academies are mushrooming as well with little monitoring done and you sense that not many players with unorthodox style are going to be accepted and as a result succeed. There are few rare talents with unorthodox styles. Some bowlers have copied Lasith Malinga and Matheesha Pathirana has earned an IPL deal even before he’s become a permanent fixture in the Sri Lankan side. Paul Adams earned a nickname ‘frog in the blender’ for his action and anyone who sees Sri Lankan spinner Kevin Koththigoda from down south will remember the South African wrist spinner. Funnily Richmond College, Galle seem to be nurturing these special talents and Kamindu Mendis is another player who can make a big impact. He’s nowadays mostly in the Test squad and nearly featured in the second Test in Wellington. He’s there in the team for his batting but he’s ambidextrous and bowls both left-arm spin and off-spin with good accuracy. That makes him an ideal candidate for shorter formats of the game and that’s where he should perhaps focus more at succeeding. Published on By Gateway College emerged Under 18 Netball Champions at the Inter International School tournament organized by Colombo International School (CIS) played at the Sugadadasa Indoor Stadium. Gateway College, led by calm and composed Rithika Srikanth, beat Lyceum Wattala 16 -8 in the final after leading 9 – 6 at the breather. Gateway entered the final by beating their counterpart in Kandy 12 -6. At the Group stages, Gateway beat ILMA 16– 5, Lyceum Nugegoda 12 – 1, CIS Colombo 17 – 0 and the British School in Colombo 18 – 0. Gateway’s young star Shenoshi Abeygunawardena was crowned the Netball Queen and Cloe Thillakaratne was adjudged as the Best Defensive player. Mawrya Liyanage did the vital turnarounds to keep Lyceum Wattala under check and Goal Attack Onadhi Samarakoon was outstanding with her accurate shooting.","pubDate":"2023-03-26 21:28:21","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Afghanistan makes history after beating Pakistan in T20I series","link":"https://www.ariananews.af/afghanistan-makes-history-after-beating-pakistan-in-t20i-series/","keywords":["Featured","Sport","Afghanistan Cricket","AFGvPak","Cricket","Cricket T20I","featured","Mohammad Nabi","Rashid Khan","T20 International"],"creator":["Ariana News"],"video_url":null,"description":"Afghanistan made history on Sunday night when they beat long-time rival Pakistan in their second successive T20I match in Sharjah to win the series. Sunday’s match saw Afghanistan beat Pakistan by 7 wickets with one ball remaining. This is the first time in Afghanistan’s cricketing history that they have beaten Pakistan in an international series […] The post Afghanistan makes history after beating Pakistan in T20I series first appeared on Ariana News.","content":"Sunday’s match saw Afghanistan beat Pakistan by 7 wickets with one ball remaining. This is the first time in Afghanistan’s cricketing history that they have beaten Pakistan in an international series and as fans back home and across the world erupted with joy after a nail-biting last two overs, congratulations started pouring in. Afghanistan Cricket Board said it was a “momentous occasion for Afghanistan cricket!” The board said in a tweet that the team had “created history by securing their first-ever T20I series win over traditional rivals Pakistan. It’s a triumph of grit, courage, and teamwork.” Rashid Khan’s squad did indeed show grit, courage and teamwork and after winning the toss and opting to bat first, Pakistan faced an early blow from Fazalhaq Farooqi who dismissed Saim Ayub for a duck on the second ball of the innings. He then trapped Abdullah Shafique LBW on the very next delivery to take Afghanistan to a dream start. Pakistan kept on losing wickets at regular intervals but Imad Wasim’s 64 not out off 57 and Shadab’s 32 off 25 took them to a respectable total. Chasing a target of 131 runs, Afghanistan were calm and focused throughout the second innings but needing 30 runs off the last three overs, and 22 from the last two overs. However Najibullah Zadran and Mohammad Nabi hit a six each off pace bowler Naseem Shah in the penultimate over to reduce the target to five runs. Zadran then hit the winning boundary off Zaman Khan’s last over to chase down the 131-run target with one ball to spare. This was Afghanistan’s first bilateral T20I series against any of the top six teams — India, England, Pakistan, South Africa, New Zealand and Australia. They have previously won a T20I series each against the West Indies and Bangladesh and five in five against Zimbabwe.","pubDate":"2023-03-26 20:55:41","image_url":null,"source_id":"ariananews","category":["sports"],"country":["Afghanistan"],"language":"english"},{"title":"News24.com | Unbelievable! Proteas shatter record for highest chase in T20I history on famous day for SA cricket","link":"https://www.news24.com/sport/Cricket/Proteas/centurion-hosts-its-own-438-event-as-proteas-make-history-in-astonishing-t20-chase-20230326","keywords":null,"creator":null,"video_url":null,"description":"To sum it up, Aiden Markram and his troops needed to overhaul 258/5 - the tallest chase in the history of T20 internationals - and duly did so, 17 years after Graeme Smith's vintage famously surprised the Australians in a world record 50-over chase.","content":"Strictly speaking, the occasion didn't warrant it - they do have bigger fish to fry against Netherlands next week - but an electric SuperSport Park on Sunday relived a '438' moment of sorts in the Proteas' second T20 against the West Indies. Aiden Markram and his troops needed to overhaul 258/5 - the tallest chase in the history of T20 internationals - and duly did so, 17 years after Graeme Smith's vintage famously surprised the Australians in a world record 50-over chase of 435 at the Wanderers. SCORECARD | Proteas v West Indies - 2nd T20 On that day, not many cricket fans and observers around the world believed a required rate of 8.68 could be sustained, and while the wild evolution of the 20-over format has illustrated to us that a chase of 244 - like Australia managed against New Zealand in 2018 - is possible, 13 an over still would've seen a fair share of Doubting Thomases emerge. Whether it was just the cheery optimism of starting a new white-ball era under Rob Walter or a Jacques Kallis walking into a muted dressing room quipping, 'The bowlers have done their job boys – I reckon they're 10 or 15 short', the South African batting order weren't going to stick to a script asking them to surrender meekly. Instead, Quinton de Kock and Reeza Hendricks crafted one of the most astonishing and memorable opening partnerships in the history of the format to orchestrate this absurdly thrilling, series-levelling victory. By the time the powerplay was done, the Proteas had reached 102 without loss, incidentally eclipsing the world record of 98 their selfsame opponents set against Sri Lanka in 2021. The 150 was reached in 10.2 overs, three balls before De Kock would be dismissed after skying a pull to Nicholas Pooran behind the stumps. The damage, however, was done. The pair could bask in work that was near-perfection. Seldom have two batters complemented each other so well. De Kock felt like the aggressor and he generally was, unleashing his trademark brand of hits all around the wicket, but reserving his best for square of the wicket. He broke his own South African record for the fastest fifty in the format by reaching the landmark in 15 deliveries. His maiden T20I hundred came at a more \"sedate\" 43 balls yet still represents the third quickest by a Protea. De Kock, who would end up hitting nine fours and eight sixes, might've been the dominant partner in terms of runs but, in a testament to the newfound class of Reeza Hendricks, who's rapidly becoming South Africa's most valuable and consistent batter in the format, he was outscored in terms of tempo. The silky right-hander was mesmerising to watch, striking 11 fours and two sixes with the minimum of fuss and fireworks in a 28-ball 68 that, in a parallel universe, might've been more important than De Kock's innings. When he was undone by a Raymon Reifer slower bouncer, the Proteas had whittled down the required rate to a more than manageable 9 and all it required was the finishing touch of Markram's muscular, unbeaten 38 off 21. Depressingly for the chastened Windies, it overshadowed all the noble deeds they had done with the bat. Johnson Charles, unexpectedly but not entirely unwelcomingly for an appreciative crowd, channeled his inner Chris Gayle as he galloped to a sensational first ton himself. It was a brilliant performance from the right-hander, who struck 11 maximums and 10 fours in a 46-ball 118 that broke the record for the islanders' quickest ton in the format (39 deliveries). Charles, a veteran who was part of the Windies' 2012 and 2016 T20 World Cup-winning campaigns, has been a journeyman in the format as his consistency has continually been cited as a blot on his copybook. However, all of those criticisms - like that of the Proteas' patently insipid bowling effort - were forgotten as he conjured up what will probably be a once-in-a-career knock, a stay at the crease where he simply could do no wrong. Typically muscular square of the wicket on both sides, Charles also showed off some brilliant striking straighter. It was a chanceless effort, only ended when a Marco Jansen yorker on leg squeezed past his defence. In fact, had the lanky quick not shown a penchant for taking wickets amidst all the runs he conceded - he ended with 3/52 - South Africa's task might've been more nail-biting. He was matched almost blow-for-blow by Kyle Mayers, whose 24-ball 50 (Charles' milestone came off 23) was equally eye-catching after he'd actually played out Aiden Markram's first five deliveries for no run in the second over. Their second-wicket partnership of 135 off just 58 deliveries, predictably, put the Windies in a prime position for their record-breaking exploits, especially after Romario Shepherd's 18-ball 41 applied the finishing touches. Unfortunately, the Proteas applied that template even better.","pubDate":"2023-03-26 18:21:30","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Player of the Match today DC vs MI Final: Who was Awarded Women’s IPL final Man of the Match 2023?","link":"https://thesportsrush.com/cricket-news-player-of-the-match-today-dc-vs-mi-final-who-was-awarded-womens-ipl-final-man-of-the-match-2023/","keywords":["Cricket","WPL 2023","Delhi Capitals Women","Mumbai Indians Women","Women's Premier League 2023"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Leading by example in Women’s tournament as well, Mumbai Indians have won the inaugural season of the Women’s Premier League after defeating Delhi Capitals by 7 wickets at the Brabourne Stadium tonight. Having gained a substantial advantage in the first innings itself, Indians were expected to win the match without much discomfort but it wasn’t… The post Player of the Match today DC vs MI Final: Who was Awarded Women’s IPL final Man of the Match 2023? appeared first on The SportsRush.","content":"Leading by example in Women’s tournament as well, Mumbai Indians have won the inaugural season of the Women’s Premier League after defeating Delhi Capitals by 7 wickets at the Brabourne Stadium tonight. Having gained a substantial advantage in the first innings itself, Indians were expected to win the match without much discomfort but it wasn’t to be as Capitals made a praiseworthy comeback into the match. Reduced to 79/9 in 16 overs primarily due to Mumbai all-rounder Hayley Matthews’ bowling figures of 4-2-5-3, Delhi posted a competitive 131/9 in 20 overs as pacer Shikha Pandey (27*) and spinner Radha Yadav (27*) put together a fighting unbeaten 24-ball 52-run partnership for the 10th wicket. In addition to Yadav, DC spinner Jess Jonassen also picked a wicket in the powerplay to put MI in some trouble. However, sense prevailed due to the presence of two senior players in all-rounder (60*) and captain (37) as the two joined hands to steer the team to a comparatively safer position. With 21 runs needed in the last two overs, Sciver-Brunt and all-rounder Amelia Kerr (14*) stood tall on their reputations as overseas players to eventually seal the run-chase with three balls left in the match. Coming in to bat at No. 3 in second over, Sciver-Brunt hit seven fours to win the Player of the Match in the night of the final. Having leaked 37 runs in her four-over spell in the first innings, Sciver-Brunt doubtlessly made amends in the second innings. Congrats on winning 🏆 Intense action on the park led by none other than oh balle oh tere skipper 🥳 Well played 🙌🏼 hard luck 👏🏼 will to open up opportunities for women’s cricket! Excited for the future! — Yuvraj Singh (@YUVSTRONG12) “It was very special. Glad I was able to stick it out when the pressure was on. I was trying to get quite tough and Harman [Harmanpreet Kaur] and Melie [Amelia Kerr] took the pressure off me. I knew if I stayed till the end we’d get through. We gave away too many [runs] in the final 3-4 overs, but it made the game interesting,” Sciver-Brunt told host broadcaster during the post-match presentation ceremony.","pubDate":"2023-03-26 18:11:23","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"BCCI Contracts: Ravindra Jadeja Promoted To A+ Category With Virat Kohli, Rohit Sharma And Jasprit Bumrah, KL Rahul Demoted","link":"https://zeenews.india.com/cricket/bcci-contracts-ravindra-jadeja-promoted-to-a-category-with-virat-kohli-rohit-sharma-and-jasprit-bumrah-kl-rahul-demoted-2588178.html","keywords":null,"creator":null,"video_url":null,"description":"All-rounder Ravindra Jadeja has been added to the BCCI's 'A+' category in annual contract but KL Rahul has been demoted while Bhuvneshwar Kumar has not been considered for a contract.","content":"Team India and Chennai Super Kings all-rounder Ravindra Jadeja has made a sensational comeback from injury, which forced him to miss the T20 World Cup 2022 in Australia. Jadeja was ‘Player of the Match’ in the first two Tests of the four-match series against Australia and was instrumental in Rohit Sharma’s side clinching the series 2-1 to qualify for the World Test Championships Final. Jadeja has been rewarded for his consistent performances by the Board of Control for Cricket in India (BCCI) in the annual retainership contracts announced on Sunday (March 26) night, elevated to the A+ category – Rs 7 crore contract – which was only occupied by Rohit Sharma, Virat Kohli and Jasprit Bumrah. Another all-rounder Axar Patel was also promoted in the BCCI retainership with Axar Patel moving up to the ‘A’ category – Rs 5 crore contract. Team India opener and Lucknow Super Giants skipper KL Rahul got demoted to Grade ‘B’ – Rs 3 crore contact – after a string of poor performances. Pacer Bhuvneshwar Kumar, Ajinkya Rahane and Ishant Sharma didn’t get a contract as BCCI handed retainership to 26 cricketers in four groups of A plus (Rs 7 crore), A (Rs 5 crore), B (Rs 3 crore) and C (Rs 1 crore). It seems curtains for the experienced trio, who have been dropped from the contract list, signalling that they are no longer in the reckoning for the national team. Delhi Capitals all-rounder Axar had plenty to be happy about as he was promoted to A category, while wicketkeeper batter KS Bharat also landed a maiden central contract after being included in Group ‘C’. Team India wicketkeeper-batter Rishabh Pant, who is recovering after undergoing treatment for his injuries following a horror crash in December last year, remains in ‘A’ category, which also includes Hardik Pandya, Ravichandran Ashwin and Mohammed Shami. There were six cricketers in Group B, including Cheteshwar Pujara, KL Rahul, Shreyas Iyer, Mohammed Siraj, Suryakumar yadav and Shubman Gill. The Group C comprises 11 cricketers – Umesh Yadav, Shikhar Dhawan, Shardul Thakur, Ishan Kishan, Deepak Hooda, Yuzvendra Chahal, Kuldeep Yadav, Washington Sundar, Sanju Samson, Arshdeep Singh, besides Bharat. The elite ‘A plus’ category has players who are a sure shot candidate for all three formats, while ‘A’ comprises cricketers who are certainties for Tests and one-dayers. Players who are considered for limited-over cricket are in Group B, while C group players are generally considered for one of the three formats regularly. NEWS _- BCCI announces annual player retainership 2022-23 - Team India (Senior Men). More details here - https://t.co/kjK4KxoDdK #TeamIndia — BCCI (@BCCI) March 26, 2023 Here are the BCCI Contracts for 2022-23 season… A+ category: Rohit Sharma, Virat Kohli, Jasprit Bumrah and Ravindra Jadeja A category: Hardik Pandya, R Ashwin, Mohammed Shami, Rishabh Pant, Axar Patel B category: Cheteshwar Pujara, KL Rahul, Shreyas Iyer, Mohammed Siraj, Suryakumar Yadav, Shubman Gill C category: Umesh Yadav, Shikhar Dhawan, Shardul Thakur, Ishan Kishan, Deepak Hooda, Yuzvendra Chahal, Kuldeep Yadav, Washington Sundar, Sanju Samson, Arshdeep Singh, KS Bharat","pubDate":"2023-03-27 00:55:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"Williams, fans help Chevrons seal series win","link":"https://www.hmetro.co.zw/williams-fans-help-chevrons-seal-series-win/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Blessing Malinganiza ZIMBABWE put Netherlands in their rightful place with a comfortable seven-wicket win before a capacity crowd to seal a 2-1 series win at Harare Sports Club on Saturday. All-rounder Sean Williams was the star of the show, taking three wickets for 41 runs and later scoring 43 runs off 53 balls. For his […]","content":"H-Metro Blessing Malinganiza ZIMBABWE put Netherlands in their rightful place with a comfortable seven-wicket win before a capacity crowd to seal a 2-1 series win at Harare Sports Club on Saturday. All-rounder Sean Williams was the star of the show, taking three wickets for 41 runs and later scoring 43 runs off 53 balls. For his match-winning performance he was adjudged player of the match and subsequently named player of the tournament for his 120 runs in just two matches and three wickets. Williams was introduced into the fray in the second match after completing his return from injury when Zimbabwe had gone down in the first One Day International to trail 1-0. Although the ICC Men’s Cricket World Cup Super League series had no bearing on both teams’ qualification for India 2023, Williams said winning becomes a habit. And, they need this for their confidence heading into the World Cup Qualifiers scheduled for Zimbabwe in June. The ICC Men’s Cricket World Cup Qualifiers are set to run from June 18 to July 9 across two cities, Harare and Bulawayo. Only two slots are left for the India World Cup. ‘‘It’s huge for us (series victory) as a team and it’s huge for me as a senior player and for the senior players in the team to keep setting standards for the juniors,” Williams said after the match. “You know growing up underneath us and learning, mentoring these boys. “I think that if we carry on along these lines we will start improving and seeing ourselves beating better sides.” Netherlands captain, Scott Edwards said Zimbabwe made good use of their home conditions buoyed by the intimidating crowd. ‘‘Batting still let us out a few times but we have a few takeaways from the series. “Obviously, Zimbabwe utilised the conditions well, credit to them for the victory but we will be back here in a few months and hope we will have a good tournament,” said Edwards. The Dutch drew first blood with a three-wicket in the first ODI on Tuesday to lead the series 1-0 on the backdrop of Teja Nidamanuru’s unbeaten 100. Zimbabwe scrapped through to a one-run win to level the series one-all, thanks to Wessly Madhevere’s hat-trick and Zimbabwe’s only third ODI after Eddo Brandes (1997) and Prosper Utseya in 2014. Madhevere was also in the thick of things contributing a half century (50) together with Gary Balance’s unbeaten on 64. But it was Williams’ all-round display that saw the Chevrons come from a match down to seal a comfortable seven-wicket win and claim the series trophy.","pubDate":"2023-03-26 22:11:54","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"HARARE’S BIGGEST OUTDOOR PARTY","link":"https://www.hmetro.co.zw/harares-biggest-outdoor-party/","keywords":["Headlines","Sport"],"creator":["aurora"],"video_url":null,"description":"H-Metro Reporter THIS was Harare United. The capital hosted its biggest outdoor party this year at the club which carries its name. On Saturday, an estimated 15 000 people converged at Harare Sports Club for the biggest outdoor party held in the capital this year. Organisers believe twice this number could have come if the […]","content":"H-Metro H-Metro Reporter THIS was Harare United. The capital hosted its biggest outdoor party this year at the club which carries its name. On Saturday, an estimated 15 000 people converged at Harare Sports Club for the biggest outdoor party held in the capital this year. Organisers believe twice this number could have come if the venue had the capacity to hold more people. All the races in this country were represented, which made it a truly national event, and thousands of Zimbabwean flags were proudly displayed by the passionate crowd. On a clear summer day, Zimbabweans partied at Harare Sports Club as they cheered their beloved Chevrons to a series-clinching seven-wicket victory over the Netherlands. By early morning, the indications were clear that this would be a special day as hundreds of fans, many of them wearing the Chevrons shirt, poured into Harare Sports Club. By early afternoon, the venue was packed to the rafters as Zimbabweans united for the cause of their national cricket team. “I expected a big crowd but not something like this,” said Max Manda, a city businessman. “I can’t describe myself as a cricket fan but I am someone who rallies behind our national teams be it in soccer, netball, rugby, you name it. “I was surprised but at the same time impressed by the huge turn out today and the joy that was on the faces of the people. “We have some challenges in our country and now and again it’s nice to see the people smiling and enjoying themselves. That’s the power of sport, it makes us forget, for a moment the reality that power has been switched off at home and we just proudly support our representatives because they are wearing our jersey and playing for us. “It’s a pity what is happening in our football which has ensured that we can’t enjoy similar moments at the National Sports Stadium because make no mistake about it, football remains our number one sport.” Nelson Makoni, who described himself as a dealer, said it was the happiest day of his life this year. “Friday was my birthday and I can say this was a perfect birthday present for me,” he said. “I can also say this was the best day for me in a long time because it was an unbelievable atmosphere. “I was so proud to call myself a Zimbabwean today and this showed that if we are united we can achieve a lot as a country. We are very proud of our country, despite all the challenges that we face, and we keep showing the world that we are a unique type of human beings. “This was magical and beautiful and one hell of a good day for us as Zimbabweans. “This was not sport, this was us as a people proudly displaying our colours.”","pubDate":"2023-03-26 22:05:46","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Chevrons bounce back in crucial moment","link":"https://www.chronicle.co.zw/chevrons-bounce-back-in-crucial-moment/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter SINCE Dave Houghton took over the reins as Zimbabwe senior men’s national cricket team, the side has been playing positive cricket and the decider on Saturday against Netherlands was one of their best displays after a poor show at the start of the series. The Chevrons team was plagued by poor performances […]","content":"The Chronicle SINCE Dave Houghton took over the reins as Zimbabwe senior men’s national cricket team, the side has been playing positive cricket and the decider on Saturday against Netherlands was one of their best displays after a poor show at the start of the series. The Chevrons team was plagued by poor performances in the first two matches, with dismal batting, fielding and decision-making hampering their progress despite being a full-strength squad with a lot of talent. However, they gave their all in the decider and sent a strong message. Zimbabwe will be looking to build on the momentum they got on Saturday as their focus shifts to the World Cup Qualifiers which will be hosted in the country in June. If the performance in the three-match series against Netherlands is anything to go by, the team is in the right shape to book their ticket to the World Cup in India later in the year. Clive Madande and Wessly Madhevere were some of the key players in the Chevrons team, putting up brilliant performances. In the first match, it took a special innings from Madande to guide the home side to a competitive total. He scored a brilliant, career-best 74 runs from 98 deliveries, guiding the Chevrons to a respectable total of 249 after they were sent in to bat first. However, Zimbabwe went on to lose by three wickets after a spirited batting performance from the visitors. In the second match, with the pressure on, Madhevere led the charge to become the first Zimbabwean bowler since Prosper Utseya to pick up a hat-trick in ODIs, his sensational bowling giving Zimbabwe a fighting chance having, earlier scored 43 runs. Needing 272 runs to win, Netherlands were bowled out for 270 runs in exactly 50 overs. In that match, Madande continued his form to score yet another brilliant half century before he fell for 52 runs from 57 balls while seasoned campaigner, Sean Williams top scored with 77 runs off 73 balls as Zimbabwe showed glimpse of life. A strong message ahead of the June Qualifiers was sent on Saturday in the decider which Zimbabwe convincingly won by seven wickets. Playing in front of a capacity crowd, Zimbabwe were sent in to bowl first and restricted the Dutch to 231/9 in 50 overs before they went on to put a brilliant effort with the bat, finishing on 235/3 in 41.4 overs to clinch the series 2-1. Williams and Madhevere continued with their brilliant performances and Garry Ballance found his groove again in the most important time. Sikandar Raza came good once again which is a good sign for the team that appeared to have moved on from the two dismal performances when the series got underway. Extending the gap between them and Netherlands in the Super League, the series victory was a morale booster for Houghton’s men and will come in handy in a few months. However, some aspects like death bowling and fielding will have to be worked on. Match winning catches were dropped and runs given away in the last and crucial moments of the games. — @brandon_malvin","pubDate":"2023-03-26 22:04:03","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Wise Owl crowned Petra T20 champs","link":"https://www.chronicle.co.zw/wise-owl-crowned-petra-t20-champs/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter MARONDERA based, Wise Owl High School were crowned champions of the 2023 Petra Twenty20 cricket tournament after a four wicket triumph over Christian Brothers College (CBC) at Petra College Senior on Saturday. Having four national Under-19 players, the eventual champions scored 128/6 in 19.2 overs and went on to bowl out CBC […]","content":"The Chronicle MARONDERA based, Wise Owl High School were crowned champions of the 2023 Petra Twenty20 cricket tournament after a four wicket triumph over Christian Brothers College (CBC) at Petra College Senior on Saturday. Having four national Under-19 players, the eventual champions scored 128/6 in 19.2 overs and went on to bowl out CBC for 125 runs in 18 overs to win the exciting final. Tashinga Makoni was Wise Owl’s leading run scorer with 29 runs off 33 deliveries while Leeroy Chiwaula scored 20 runs off 14 deliveries. Brendon Senzere chipped in with 19 runs off 18 deliveries in the first innings of the match. Travis Pettican was the star with the ball for CBC after he finished with figures 3/24 in his four overs while Rudra Desai took two scalps for 17 runs in his four over spell. In their chase, CBC lost the early wicket of their skipper, Saxon Pettican in the second over for 15 runs which was the team’s third highest score in the match. The high scorer was Zimbabwe Under-19 player, Munashe Chimusoro who scored 35 runs from 23 balls while Justin Steyn remained undefeated on 27 runs from 13 deliveries as they fell short of making sure that the trophy stays in Bulawayo. Tadiwanashe Kurehwatira and Simbarashe Mudzengerere took three wickets each for Wise Owl to guide them to victory. A total of eight teams took part in the tournament with one coming from Botswana. The schools which participated were Petra, Heritage, CBC, Kyle College, Eaglesvale, Wise Owl, Milton Boys High and John McKenzie of Botswana. The eight teams were put into three groups of three teams but Pool A only had two teams, Heritage and Petra where the former proceeded through with two points. In Pool B, CBC topped the standings with four points after two wins followed by Kyle College on two points while Eaglesvale finished at the bottom with zero points. Wise Owl topped Pool C with four points followed by Milton on two points and John McKenzie with none. “Everything went well according to our expectations and I was impressed with the level of cricket that was displayed by all the players who took part. The more we play such tournaments, the more the youngsters will get better and take their cricket to the next level so we are looking forward to hosting bigger and better tournaments next time,” said tournament director, Stanslaus Rukato. Petra College Senior headmaster, Robert Aldrige said they look forward to hosting the tournament again next year as it will help juniors cricket grow and move from strength to strength. He added that exposing players to teams that they don’t often play with is an important way of growing the game. — @brandon_malvin","pubDate":"2023-03-26 22:03:21","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"South Africa ace record run chase to level series","link":"http://island.lk/south-africa-ace-record-run-chase-to-level-series/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"In what was another incredible run fest at Centurion, South Africa brushed aside West Indies by six-wickets with a record-breaking run chase in the second T20I on Sunday (March 26). Set an unrealistic target of 259 on a perfect batting surface with short boundaries, South Africa’s openers made a mockery of the assignment, racking up […]","content":"In what was another incredible run fest at Centurion, South Africa brushed aside West Indies by six-wickets with a record-breaking run chase in the second T20I on Sunday (March 26). Set an unrealistic target of 259 on a perfect batting surface with short boundaries, South Africa’s openers made a mockery of the assignment, racking up a century stand inside the PowerPlay itself. It was the sort of assault that West Indies were least expecting and the the Quinton de Kock-Reeza Hendricks partnership did it with minimum fuss, using the pristine conditions to the fullest. By the time the stand was broken, the chase seemed to be a formality of sorts, considering the hosts’ firepower in the middle order and despite losing a few wickets in the middle overs, skipper Aiden Markram and Heinrich Klaasen got the job done with seven balls to spare. The freak batting show from the Proteas overshadowed West Indies’ unreal batting performance earlier in the game, with the visitors posting their highest-ever total in the shortest format of the game. It was an exhibition of brutal power-hitting, led by Johnson Charles who smashed the joint-second fastest century of all time. He got good support from the others, notably Romario Shepherd and skipper Rovman Powell as the South African bowlers were taken to the cleaners. Only Kagiso Rabada managed to withstand the onslaught to some extent but even he went at over 10 runs-per-over. At the halfway stage, it seemed like West Indies had closed the door on this series but South Africa led by de Kock broke that open with a historic batting effort. A total of 46 boundaries and 35 sixes were hit in this mind-boggling contest. The final game of the series will be played at The Wanderers, Johannesburg on Tuesday (March 26). Brief scores: South Africa 259/4 in 18.5 overs (Qintotn de Kock 100, Reeza Hendricks 68, Aiden Markram 38*) West Indies 258/5 in 20 overs (Charles 118, Mayers 51, Shepherd 41*) six wickets Published on By Mumbai Indians were crowned the inaugural champions of the Women’s Premier League after a tense, low-scoring final at the Cricket Club of India in Mumbai. In a nervy title clash between the two best teams of the competition, it was the experience of Nat Sciver-Brunt that helped Mumbai get across the line, the star all-rounder following up her Eliminator blitz with a more measured knock of 60* off 55 balls. Sciver-Brunt’s half-century and her crucial partnership of 72 with Harmanpreet Kaur (37) came after an excellent bowling performance, particularly from Hayley Matthews and Melie Kerr, that restricted the Delhi Capitals to a modest total of 131. Brief scores: 131/9 in 20 overs (Meg Lanning 35, Radha Yadav 27*; Hayley Matthews 3-5, Issy Wong 3-42, Melie Kerr 2-18) 134/3 in 19.3 overs (Nat Sciver-Brunt 60*, Harmanpreet Kaur 37; Radha Yadav 1-24) Published on By It’s been a while since a mystery Sri Lankan spinner bamboozled the opposition batsmen. Not just batsmen but coaches went on a frenzy decoding these bowlers while Times of India and Daily Telegraph dedicated headlines praising how well Sri Lanka groomed these sensational talents. Ajantha Mendis was the last global sensation with bit of mystery as his carrom ball humbled India’s fabulous batting line-up comprising Sehwag, Dravid, Tendulkar, Laxman and Ganguly. After him T. M. Dilshan opening the batting with field restrictions on came up with a scoop shot over the head of the wicketkeeper that later became popular as Dilscoop. Not exactly mystery but Sri Lanka promoting unorthodox style of play totally contrary to the coaching manual had been appreciated and encouraged. Not just Dilshan and Mendis but Lasith Malinga, Muttiah Muralitharan and Sanath Jayasuriya all broke convention and were extremely successful. Credit to selectors and captains for encouraging these natural talents and more importantly for the coaches, especially at lower levels, for not sidelining them for being different. Mendis and Malinga weren’t hits at school cricket and they were more or less groomed after they left school. But Jayasuriya and Murali were entirely different. Thankfully their early coaches did not tinker too much with their style. Coaches nowadays are too engaged in the sport. They roam around the boundary rope providing ball by ball instructions making the captain redundant. Imagine how much impact they’d be having on players at training and there’s little room for creativity. Cricket Academies are mushrooming as well with little monitoring done and you sense that not many players with unorthodox style are going to be accepted and as a result succeed. There are few rare talents with unorthodox styles. Some bowlers have copied Lasith Malinga and Matheesha Pathirana has earned an IPL deal even before he’s become a permanent fixture in the Sri Lankan side. Paul Adams earned a nickname ‘frog in the blender’ for his action and anyone who sees Sri Lankan spinner Kevin Koththigoda from down south will remember the South African wrist spinner. Funnily Richmond College, Galle seem to be nurturing these special talents and Kamindu Mendis is another player who can make a big impact. He’s nowadays mostly in the Test squad and nearly featured in the second Test in Wellington. He’s there in the team for his batting but he’s ambidextrous and bowls both left-arm spin and off-spin with good accuracy. That makes him an ideal candidate for shorter formats of the game and that’s where he should perhaps focus more at succeeding. Published on By Gateway College emerged Under 18 Netball Champions at the Inter International School tournament organized by Colombo International School (CIS) played at the Sugadadasa Indoor Stadium. Gateway College, led by calm and composed Rithika Srikanth, beat Lyceum Wattala 16 -8 in the final after leading 9 – 6 at the breather. Gateway entered the final by beating their counterpart in Kandy 12 -6. At the Group stages, Gateway beat ILMA 16– 5, Lyceum Nugegoda 12 – 1, CIS Colombo 17 – 0 and the British School in Colombo 18 – 0. Gateway’s young star Shenoshi Abeygunawardena was crowned the Netball Queen and Cloe Thillakaratne was adjudged as the Best Defensive player. Mawrya Liyanage did the vital turnarounds to keep Lyceum Wattala under check and Goal Attack Onadhi Samarakoon was outstanding with her accurate shooting.","pubDate":"2023-03-26 21:44:36","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Spinners, Sciver-Brunt guide Mumbai Indians women to WPL title","link":"http://island.lk/spinners-sciver-brunt-guide-mumbai-indians-women-to-wpl-title/","keywords":["Sports","Featured","WPL2023"],"creator":["Priyan"],"video_url":null,"description":"Mumbai Indians were crowned the inaugural champions of the Women’s Premier League after a tense, low-scoring final at the Cricket Club of India in Mumbai. In a nervy title clash between the two best teams of the competition, it was the experience of Nat Sciver-Brunt that helped Mumbai get across the line, the star all-rounder […]","content":"Mumbai Indians were crowned the inaugural champions of the Women’s Premier League after a tense, low-scoring final at the Cricket Club of India in Mumbai. In a nervy title clash between the two best teams of the competition, it was the experience of Nat Sciver-Brunt that helped Mumbai get across the line, the star all-rounder following up her Eliminator blitz with a more measured knock of 60* off 55 balls. Sciver-Brunt’s half-century and her crucial partnership of 72 with Harmanpreet Kaur (37) came after an excellent bowling performance, particularly from Hayley Matthews and Melie Kerr, that restricted the Delhi Capitals to a modest total of 131. Brief scores: 131/9 in 20 overs (Meg Lanning 35, Radha Yadav 27*; Hayley Matthews 3-5, Issy Wong 3-42, Melie Kerr 2-18) 134/3 in 19.3 overs (Nat Sciver-Brunt 60*, Harmanpreet Kaur 37; Radha Yadav 1-24) Published on By In what was another incredible run fest at Centurion, South Africa brushed aside West Indies by six-wickets with a record-breaking run chase in the second T20I on Sunday (March 26). Set an unrealistic target of 259 on a perfect batting surface with short boundaries, South Africa’s openers made a mockery of the assignment, racking up a century stand inside the PowerPlay itself. It was the sort of assault that West Indies were least expecting and the the Quinton de Kock-Reeza Hendricks partnership did it with minimum fuss, using the pristine conditions to the fullest. By the time the stand was broken, the chase seemed to be a formality of sorts, considering the hosts’ firepower in the middle order and despite losing a few wickets in the middle overs, skipper Aiden Markram and Heinrich Klaasen got the job done with seven balls to spare. The freak batting show from the Proteas overshadowed West Indies’ unreal batting performance earlier in the game, with the visitors posting their highest-ever total in the shortest format of the game. It was an exhibition of brutal power-hitting, led by Johnson Charles who smashed the joint-second fastest century of all time. He got good support from the others, notably Romario Shepherd and skipper Rovman Powell as the South African bowlers were taken to the cleaners. Only Kagiso Rabada managed to withstand the onslaught to some extent but even he went at over 10 runs-per-over. At the halfway stage, it seemed like West Indies had closed the door on this series but South Africa led by de Kock broke that open with a historic batting effort. A total of 46 boundaries and 35 sixes were hit in this mind-boggling contest. The final game of the series will be played at The Wanderers, Johannesburg on Tuesday (March 26). Brief scores: South Africa 259/4 in 18.5 overs (Qintotn de Kock 100, Reeza Hendricks 68, Aiden Markram 38*) West Indies 258/5 in 20 overs (Charles 118, Mayers 51, Shepherd 41*) six wickets Published on By It’s been a while since a mystery Sri Lankan spinner bamboozled the opposition batsmen. Not just batsmen but coaches went on a frenzy decoding these bowlers while Times of India and Daily Telegraph dedicated headlines praising how well Sri Lanka groomed these sensational talents. Ajantha Mendis was the last global sensation with bit of mystery as his carrom ball humbled India’s fabulous batting line-up comprising Sehwag, Dravid, Tendulkar, Laxman and Ganguly. After him T. M. Dilshan opening the batting with field restrictions on came up with a scoop shot over the head of the wicketkeeper that later became popular as Dilscoop. Not exactly mystery but Sri Lanka promoting unorthodox style of play totally contrary to the coaching manual had been appreciated and encouraged. Not just Dilshan and Mendis but Lasith Malinga, Muttiah Muralitharan and Sanath Jayasuriya all broke convention and were extremely successful. Credit to selectors and captains for encouraging these natural talents and more importantly for the coaches, especially at lower levels, for not sidelining them for being different. Mendis and Malinga weren’t hits at school cricket and they were more or less groomed after they left school. But Jayasuriya and Murali were entirely different. Thankfully their early coaches did not tinker too much with their style. Coaches nowadays are too engaged in the sport. They roam around the boundary rope providing ball by ball instructions making the captain redundant. Imagine how much impact they’d be having on players at training and there’s little room for creativity. Cricket Academies are mushrooming as well with little monitoring done and you sense that not many players with unorthodox style are going to be accepted and as a result succeed. There are few rare talents with unorthodox styles. Some bowlers have copied Lasith Malinga and Matheesha Pathirana has earned an IPL deal even before he’s become a permanent fixture in the Sri Lankan side. Paul Adams earned a nickname ‘frog in the blender’ for his action and anyone who sees Sri Lankan spinner Kevin Koththigoda from down south will remember the South African wrist spinner. Funnily Richmond College, Galle seem to be nurturing these special talents and Kamindu Mendis is another player who can make a big impact. He’s nowadays mostly in the Test squad and nearly featured in the second Test in Wellington. He’s there in the team for his batting but he’s ambidextrous and bowls both left-arm spin and off-spin with good accuracy. That makes him an ideal candidate for shorter formats of the game and that’s where he should perhaps focus more at succeeding. Published on By Gateway College emerged Under 18 Netball Champions at the Inter International School tournament organized by Colombo International School (CIS) played at the Sugadadasa Indoor Stadium. Gateway College, led by calm and composed Rithika Srikanth, beat Lyceum Wattala 16 -8 in the final after leading 9 – 6 at the breather. Gateway entered the final by beating their counterpart in Kandy 12 -6. At the Group stages, Gateway beat ILMA 16– 5, Lyceum Nugegoda 12 – 1, CIS Colombo 17 – 0 and the British School in Colombo 18 – 0. Gateway’s young star Shenoshi Abeygunawardena was crowned the Netball Queen and Cloe Thillakaratne was adjudged as the Best Defensive player. Mawrya Liyanage did the vital turnarounds to keep Lyceum Wattala under check and Goal Attack Onadhi Samarakoon was outstanding with her accurate shooting.","pubDate":"2023-03-26 21:28:21","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Afghanistan makes history after beating Pakistan in T20I series","link":"https://www.ariananews.af/afghanistan-makes-history-after-beating-pakistan-in-t20i-series/","keywords":["Featured","Sport","Afghanistan Cricket","AFGvPak","Cricket","Cricket T20I","featured","Mohammad Nabi","Rashid Khan","T20 International"],"creator":["Ariana News"],"video_url":null,"description":"Afghanistan made history on Sunday night when they beat long-time rival Pakistan in their second successive T20I match in Sharjah to win the series. Sunday’s match saw Afghanistan beat Pakistan by 7 wickets with one ball remaining. This is the first time in Afghanistan’s cricketing history that they have beaten Pakistan in an international series […] The post Afghanistan makes history after beating Pakistan in T20I series first appeared on Ariana News.","content":"Sunday’s match saw Afghanistan beat Pakistan by 7 wickets with one ball remaining. This is the first time in Afghanistan’s cricketing history that they have beaten Pakistan in an international series and as fans back home and across the world erupted with joy after a nail-biting last two overs, congratulations started pouring in. Afghanistan Cricket Board said it was a “momentous occasion for Afghanistan cricket!” The board said in a tweet that the team had “created history by securing their first-ever T20I series win over traditional rivals Pakistan. It’s a triumph of grit, courage, and teamwork.” Rashid Khan’s squad did indeed show grit, courage and teamwork and after winning the toss and opting to bat first, Pakistan faced an early blow from Fazalhaq Farooqi who dismissed Saim Ayub for a duck on the second ball of the innings. He then trapped Abdullah Shafique LBW on the very next delivery to take Afghanistan to a dream start. Pakistan kept on losing wickets at regular intervals but Imad Wasim’s 64 not out off 57 and Shadab’s 32 off 25 took them to a respectable total. Chasing a target of 131 runs, Afghanistan were calm and focused throughout the second innings but needing 30 runs off the last three overs, and 22 from the last two overs. However Najibullah Zadran and Mohammad Nabi hit a six each off pace bowler Naseem Shah in the penultimate over to reduce the target to five runs. Zadran then hit the winning boundary off Zaman Khan’s last over to chase down the 131-run target with one ball to spare. This was Afghanistan’s first bilateral T20I series against any of the top six teams — India, England, Pakistan, South Africa, New Zealand and Australia. They have previously won a T20I series each against the West Indies and Bangladesh and five in five against Zimbabwe.","pubDate":"2023-03-26 20:55:41","image_url":null,"source_id":"ariananews","category":["sports"],"country":["Afghanistan"],"language":"english"},{"title":"News24.com | Unbelievable! Proteas shatter record for highest chase in T20I history on famous day for SA cricket","link":"https://www.news24.com/sport/Cricket/Proteas/centurion-hosts-its-own-438-event-as-proteas-make-history-in-astonishing-t20-chase-20230326","keywords":null,"creator":null,"video_url":null,"description":"To sum it up, Aiden Markram and his troops needed to overhaul 258/5 - the tallest chase in the history of T20 internationals - and duly did so, 17 years after Graeme Smith's vintage famously surprised the Australians in a world record 50-over chase.","content":"Strictly speaking, the occasion didn't warrant it - they do have bigger fish to fry against Netherlands next week - but an electric SuperSport Park on Sunday relived a '438' moment of sorts in the Proteas' second T20 against the West Indies. Aiden Markram and his troops needed to overhaul 258/5 - the tallest chase in the history of T20 internationals - and duly did so, 17 years after Graeme Smith's vintage famously surprised the Australians in a world record 50-over chase of 435 at the Wanderers. SCORECARD | Proteas v West Indies - 2nd T20 On that day, not many cricket fans and observers around the world believed a required rate of 8.68 could be sustained, and while the wild evolution of the 20-over format has illustrated to us that a chase of 244 - like Australia managed against New Zealand in 2018 - is possible, 13 an over still would've seen a fair share of Doubting Thomases emerge. Whether it was just the cheery optimism of starting a new white-ball era under Rob Walter or a Jacques Kallis walking into a muted dressing room quipping, 'The bowlers have done their job boys – I reckon they're 10 or 15 short', the South African batting order weren't going to stick to a script asking them to surrender meekly. Instead, Quinton de Kock and Reeza Hendricks crafted one of the most astonishing and memorable opening partnerships in the history of the format to orchestrate this absurdly thrilling, series-levelling victory. By the time the powerplay was done, the Proteas had reached 102 without loss, incidentally eclipsing the world record of 98 their selfsame opponents set against Sri Lanka in 2021. The 150 was reached in 10.2 overs, three balls before De Kock would be dismissed after skying a pull to Nicholas Pooran behind the stumps. The damage, however, was done. The pair could bask in work that was near-perfection. Seldom have two batters complemented each other so well. De Kock felt like the aggressor and he generally was, unleashing his trademark brand of hits all around the wicket, but reserving his best for square of the wicket. He broke his own South African record for the fastest fifty in the format by reaching the landmark in 15 deliveries. His maiden T20I hundred came at a more \"sedate\" 43 balls yet still represents the third quickest by a Protea. De Kock, who would end up hitting nine fours and eight sixes, might've been the dominant partner in terms of runs but, in a testament to the newfound class of Reeza Hendricks, who's rapidly becoming South Africa's most valuable and consistent batter in the format, he was outscored in terms of tempo. The silky right-hander was mesmerising to watch, striking 11 fours and two sixes with the minimum of fuss and fireworks in a 28-ball 68 that, in a parallel universe, might've been more important than De Kock's innings. When he was undone by a Raymon Reifer slower bouncer, the Proteas had whittled down the required rate to a more than manageable 9 and all it required was the finishing touch of Markram's muscular, unbeaten 38 off 21. Depressingly for the chastened Windies, it overshadowed all the noble deeds they had done with the bat. Johnson Charles, unexpectedly but not entirely unwelcomingly for an appreciative crowd, channeled his inner Chris Gayle as he galloped to a sensational first ton himself. It was a brilliant performance from the right-hander, who struck 11 maximums and 10 fours in a 46-ball 118 that broke the record for the islanders' quickest ton in the format (39 deliveries). Charles, a veteran who was part of the Windies' 2012 and 2016 T20 World Cup-winning campaigns, has been a journeyman in the format as his consistency has continually been cited as a blot on his copybook. However, all of those criticisms - like that of the Proteas' patently insipid bowling effort - were forgotten as he conjured up what will probably be a once-in-a-career knock, a stay at the crease where he simply could do no wrong. Typically muscular square of the wicket on both sides, Charles also showed off some brilliant striking straighter. It was a chanceless effort, only ended when a Marco Jansen yorker on leg squeezed past his defence. In fact, had the lanky quick not shown a penchant for taking wickets amidst all the runs he conceded - he ended with 3/52 - South Africa's task might've been more nail-biting. He was matched almost blow-for-blow by Kyle Mayers, whose 24-ball 50 (Charles' milestone came off 23) was equally eye-catching after he'd actually played out Aiden Markram's first five deliveries for no run in the second over. Their second-wicket partnership of 135 off just 58 deliveries, predictably, put the Windies in a prime position for their record-breaking exploits, especially after Romario Shepherd's 18-ball 41 applied the finishing touches. Unfortunately, the Proteas applied that template even better.","pubDate":"2023-03-26 18:21:30","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Player of the Match today DC vs MI Final: Who was Awarded Women’s IPL final Man of the Match 2023?","link":"https://thesportsrush.com/cricket-news-player-of-the-match-today-dc-vs-mi-final-who-was-awarded-womens-ipl-final-man-of-the-match-2023/","keywords":["Cricket","WPL 2023","Delhi Capitals Women","Mumbai Indians Women","Women's Premier League 2023"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Leading by example in Women’s tournament as well, Mumbai Indians have won the inaugural season of the Women’s Premier League after defeating Delhi Capitals by 7 wickets at the Brabourne Stadium tonight. Having gained a substantial advantage in the first innings itself, Indians were expected to win the match without much discomfort but it wasn’t… The post Player of the Match today DC vs MI Final: Who was Awarded Women’s IPL final Man of the Match 2023? appeared first on The SportsRush.","content":"Leading by example in Women’s tournament as well, Mumbai Indians have won the inaugural season of the Women’s Premier League after defeating Delhi Capitals by 7 wickets at the Brabourne Stadium tonight. Having gained a substantial advantage in the first innings itself, Indians were expected to win the match without much discomfort but it wasn’t to be as Capitals made a praiseworthy comeback into the match. Reduced to 79/9 in 16 overs primarily due to Mumbai all-rounder Hayley Matthews’ bowling figures of 4-2-5-3, Delhi posted a competitive 131/9 in 20 overs as pacer Shikha Pandey (27*) and spinner Radha Yadav (27*) put together a fighting unbeaten 24-ball 52-run partnership for the 10th wicket. In addition to Yadav, DC spinner Jess Jonassen also picked a wicket in the powerplay to put MI in some trouble. However, sense prevailed due to the presence of two senior players in all-rounder (60*) and captain (37) as the two joined hands to steer the team to a comparatively safer position. With 21 runs needed in the last two overs, Sciver-Brunt and all-rounder Amelia Kerr (14*) stood tall on their reputations as overseas players to eventually seal the run-chase with three balls left in the match. Coming in to bat at No. 3 in second over, Sciver-Brunt hit seven fours to win the Player of the Match in the night of the final. Having leaked 37 runs in her four-over spell in the first innings, Sciver-Brunt doubtlessly made amends in the second innings. Congrats on winning 🏆 Intense action on the park led by none other than oh balle oh tere skipper 🥳 Well played 🙌🏼 hard luck 👏🏼 will to open up opportunities for women’s cricket! Excited for the future! — Yuvraj Singh (@YUVSTRONG12) “It was very special. Glad I was able to stick it out when the pressure was on. I was trying to get quite tough and Harman [Harmanpreet Kaur] and Melie [Amelia Kerr] took the pressure off me. I knew if I stayed till the end we’d get through. We gave away too many [runs] in the final 3-4 overs, but it made the game interesting,” Sciver-Brunt told host broadcaster during the post-match presentation ceremony.","pubDate":"2023-03-26 18:11:23","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"}]}