{"newsArray":[{"title":"Sister’s heartbreaking act at fatal crash site","link":"https://www.cairnspost.com.au/sport/cricket/sister-leaves-heartbreaking-note-at-site-of-andrew-symonds-car-crash/news-story/770d8d1d2cd49e7c4b61c441470fec4a","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Andrew Symonds’ sister penned a heartbreaking note she left at the site of his car accident as the world mourns the loss of the Aussie cricket legend.","content":null,"pubDate":"2022-05-15 23:15:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sister leaves heartbreaking note at site of Andrew Symonds’ car crash","link":"https://www.foxsports.com.au/cricket/sister-leaves-heartbreaking-note-at-site-of-andrew-symonds-car-crash/news-story/643cf38df644da4e85db1df74bdba864","keywords":null,"creator":null,"video_url":null,"description":"Andrew Symonds’ sister penned a heartbreaking note she left at the site of his car accident as the world mourns the loss of the Aussie cricket legend.","content":"Andrew Symonds’ sister penned a heartbreaking note she left at the site of his car accident as the world mourns the loss of the Aussie cricket legend. The 46-year-old was killed on Saturday night when his vehicle veered off the road and rolled over just outside Townsville. Bystanders who heard the crash rushed to help but were unable to save him. Symonds’ sister Louise visited the scene of the tragedy on Sunday, placing a handwritten note expressing her sense of loss. “Gone far too soon!” the note read. “Rest in peace Andrew. “I wish we had one more day, one more phone call. “My heart is broken. I will always love you my brother.” Queensland Police are investigating the crash and will prepare a report for the coroner. Channel 9 reporter Mia Glover told FIVEaa radio on Monday morning she can “see that there’s a lot of brake marks on the road from where his car veered off before it eventually rolled”. “At this stage police still have no idea why he left the road,” she added. “One rumour that’s going around by locals is he may have swerved to miss an animal but everything’s under investigation at the moment.” A witness, who found Symonds in his vehicle after he crashed, told the Courier Mail the cricketer’s two blue heelers refused to leave his side. “One of them was very sensitive and didn’t want to leave him,” she said. “It would just growl at you every time we tried to move him or go near him. “My partner tried to get (Symonds) out of the car, to put him on to his back. “He was unconscious, not responsive and had no pulse.” Waylon Townson tried to help Symonds but there was nothing he could do. “He was stuck in there, so I tried to pull him out,” he told Nine News. “(I) started doing CPR and checked his pulse but I didn’t get much response.” Andrew Symonds was an incredible cricketer. (Photo by Quinn Rooney/Getty Images) crash. Source: Getty Images Symonds’ death is another devastating loss for the Australian cricket community, which had already farewelled fellow champions Shane Warne and Rod Marsh earlier this year. Taking to Instagram, Australian off-spinner Nathan Lyon spoke at his incredible sadness of Symonds’ passing. “I am heartbroken by the news we all woke up too this morning. It was only 2 months ago at Warnie’s memorial service, Roy and I had a good chat and both agreed it was to young to leave us … now this!” Lyon wrote. “RIP mate, a true legend of the game we love and inspiration to so many! My thoughts and prayers go out to his family, kids and friends!” Former teammates also wrote of their grief on social media . Michael Clarke said he was “devastated”, Adam Gilchrist said “this really hurts” while Ricky Ponting remembered Symonds as a fiercely loyal mate. Symonds was a devastating batter who could bowl either medium pace or off-spin, depending on the situation of the game. He was a key member of Australia’s ODI teams that won World Cups in 2003 and 2007, playing 198 times in the 50-over format, scoring 5088 runs and taking 133 wickets. Once pigeonholed as a white-ball specialist, Symonds turned himself into a brilliant Test player where he also built an impressive record. He wore the baggy green 26 times, scoring 1462 runs at an average of 40.61. He was also an exceptional fielder, sensational in both the in-field and patrolling the boundary.","pubDate":"2022-05-15 22:53:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"The Origin hopefuls 'making noise' for Slater","link":"https://wwos.nine.com.au/nrl/billy-slater-maroons-origin-selections-broncos-selwyn-cobbo-patrick-carrigan-tom-flegler/4ee5d0cd-a2a0-48f3-827e-c602fe9d30ed","keywords":null,"creator":["wwos"],"video_url":null,"description":"Billy Slater believes Queensland is in a \"good position now\" with several young stars emerging in the Origin selection frame.","content":"Maroons coach Billy Slater says Queensland is in a \"good position now\" with several young stars emerging in the Origin selection frame. Slater noted the Broncos in particular had thrown up some exciting new options for representative duties. Winger Selwyn Cobbo and forwards Patrick Carrigan and Tom Flegler are all thriving as part of a new-look side that's firming to break its dreaded run of back-to-back seasons without finals football. The Broncos sit in seventh spot with six wins from 10 games. IN PICTURES: The incredible career of Andrew Symonds READ MORE: Eerie link that preceded Warne, Symonds deaths READ MORE: Tubby 'can't quite believe' another cricket great is dead Cobbo, who's just 19 years old, had former Queensland coach Paul Vautin calling for his Origin selection after starring in just his 17th first-grade game on Friday night, scoring a hat-trick as Brisbane thrashed Manly 38-0 . Slater conceded Cobbo, who has never featured in any junior Maroons side, was starting to enter the selection frame. \"He's making some noise and consistent actions,\" Slater told Wide World of Sports' Billy's Breakdown . \"He's starting to put consistent performances together. Only young, but his actions are certainly saying a different story.\" But also keeping Slater's mind open is Cobbo's opposite winger Corey Oates, as well as forwards Carrigan and Flegler. \"I think Corey Oates is having a fantastic season as well on the other wing,\" Slater added. \"Patrick Carrigan and Tom Flegler in that middle of the field - they're combining really well and they're setting the tone along with Payne Haas. \"Their names are certainly being thrown up.\" Host Mat Thompson also queried Slater on several other Queensland forwards, including Gold Coast's Moeaki Fotuaika and North Queensland's Jeremiah Nanai and Reuben Cotter. \"We're in a good position now and it's important that we don't fix ourselves on 17 players,\" Slater responded. \"We've got to look at the whole category, it's going to take more than that. These players put pressure on each other as well. \"[There are] plenty of Queenslanders making noise and telling me that they want to be part of this State of Origin series and play for Queensland, which is good signs for us.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","pubDate":"2022-05-15 22:49:40","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/05/429644/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Loyal to a fault’: What shattered Aussie teammates said about ‘bloody good bloke’ Symonds","link":"https://www.foxsports.com.au/cricket/australia/andrew-symonds-dead-cricket-australia-news-tributes-from-teammates-adam-gilchrist-matthew-hayden-ricky-ponting/news-story/b77195ce73f33dd307791312ba1478ab","keywords":null,"creator":null,"video_url":null,"description":"The cricket world is still coming to terms with the sudden, tragic death of Australian legend Andrew Symonds, who died in a car crash on Saturday night.","content":"The cricket world is still coming to terms with the sudden, tragic death of Australian legend Andrew Symonds , who died in a car crash on Saturday night. Tributes have been flowing for the former all-rounder with his heartbroken teammates, including Matthew Hayden and Adam Gilchrist, leading the way in honouring the great. Scroll down to for a collection of tributes from Symonds’ former Australia teammates. Watch The 2022 Indian Premier League on Kayo. Every Match Live & On-Demand. New to Kayo? Try 14-Days Free Now > MORE ANDREW SYMONDS NEWS Hayden’s three-word tribute as heartbreaking dogs detail emerges from Symonds crash Symonds’ final Insta post is just too heartbreaking Legend devastated as tributes flow after shock death of ‘fearless’ Symonds A larrikin cut from different cloth... cricket wouldn’t be the same without Symonds The forgotten innings that helped Australia win back-to-back World Cups Roy STEAMROLLS streaker at the Gabba | 00:47 ADAM GILCHRIST “Anyone that had anything to do with ‘Symo’ knew exactly what he was like, he was one of the good guys, a real heart and soul type of guy that really made you happy - he just lit up the room wherever he was. “He is just going to be so sorely missed.” “I wouldn’t say so much a practical joker, but he just seemed to find a funny line or a funny comment at any given time. “He was a true work hard and play hard, I think we all saw that. “There was almost a beautiful naivety to a lot of things and innocence. “He was so knowledgeable in the game of cricket, a whole lot more knowledgeable and articulate than what people might give him credit for. “That was starting to shine through in his commentary, his ability to read the game and to know what was going to happen … it was amazing, it was an asset and a skill that Ricky Ponting as captain drew on a lot more than people know. “He was a larrikin, he found the lighter side of most situations. “Anyone that didn’t know him, just think of your closest friend who would do anything for you. “He was loyal to a fault and just so trustworthy and loving.” MATTHEW HAYDEN “We were joined at the hip for 20 years. “When he got his hundred he launched himself into my arms and it crunched my helmet into my head so hard it split my forehead. But there was no happier moment in my career. “What a memory. By that stage we had known each other for 12 or 13 years. We had been through childbirths, (Andrew’s first) marriage breakdown, funerals and an abundance of tremendous fishing trips and countless cold XXXX bitters. “Our families were super close – honestly, that moment was just beautiful. He was a hard man not to love. He had so much charisma and mystery. He had a sharp wit but he would stand up to anyone or anything if he didn’t think something was right. He would dress down the PM if he felt it was fair.’” “Simmo once said to me, ‘If you can’t say it in 3 words Joe it’s not worth listening to’. Well Roy…… ‘Bloody good bloke’ sums you up. Make sure those XXXX bitters cans are nice and cold #Albert for when next we sip.” Remembering Roy's maiden Test ton | 03:44 RICKY PONTING “If Roy shook your hand you had his word, that’s the sort of bloke he was and that’s why I always wanted him on my team. “An extraordinary player and even better human being. Can’t believe he’s gone. “Thoughts are with his family at this time.” BRETT LEE “I knew Roy since the age of 17 from junior cricket. One of the most gifted athletes I’ve ever witnessed. “He didn’t play for money or fame, these things were irrelevant to him. “As long as he could afford to wet a line and have a cold beer, Roy was happy. First picked in any team.” DARREN LEHMANN “Look after yourself up there great man, I am (heartbroken). “Loved him so much and our thoughts are with the family at this time. Hug your loved ones.” Symonds & the streaker that got away | 01:00 JASON GILLESPIE “Horrendous news to wake up to. Utterly devastated. “We are all gonna miss you mate. “Been a pretty ordinary day. We lost an absolute superstar of a person. Have known him since an Australian U19 tour in 1994. “It’s tough to acknowledge that he’s gone to be honest. I know the QLD cricket family are getting around each other today. MICHAEL BEVAN “Heartbreaking. Aussie cricket losing another hero. “Stunned. Co-team members 2003 World Cup. Amazing talent. “RIP SIMMO.”","pubDate":"2022-05-15 21:47:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Queensland Cricket Chairman Chris Simpson pays tribute Andrew Symonds to close mate","link":"https://www.smh.com.au/sport/nrl/queensland-cricket-chairman-chris-simpson-pays-tribute-andrew-symonds-to-close-mate-20220516-p5all9.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Karl Stefanovic, Chris Simpson pay tribute to Andrew Symonds.","content":null,"pubDate":"2022-05-15 21:43:12","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"A flamboyant all-rounder who flourished in ODIs departs","link":"https://www.thehindu.com/sport/a-flamboyant-all-rounder-who-flourished-inodis-departs/article65417817.ece","keywords":null,"creator":["\n        K. C. Vijaya Kumar  \n    "],"video_url":null,"description":"Symonds succumbs to injuries sustained in a car accident; cricket world in shock","content":"Achiever: A proud Symonds poses with the World Cup winner’s trophies of the 1999 and 2003 editions in which he was part of the Australian team. | Photo Credit: Getty Images It was a Sunday dawn marinated in grief for the cricketing world and the news from Down Under was grim. Former Australian all-rounder Andrew Symonds had succumbed to fatal injuries suffered in a car accident near Townsville in Queensland on Saturday night. Just 46, Symonds leaves behind a stunned Australian sporting firmament yet to come to terms with the earlier demise of Rodney Marsh and Shane Warne. With an imposing figure and a larger-than-life outlook, Symonds was much more than numbers in statistical books. He was an impact-player through his towering shots, electric fielding and more than handy bowling be it off-spin or medium-pace. The two-time World Cup winner (2003 and 2007) had the game for limited-overs’ jousts and with dreadlocks, zinc cream on his face and the odd sharp word with rivals, he always drew in the cameras. Having played 26 Tests and 14 T20Is, the ‘Symonds Effect’ was felt more in his 198 ODIs that yielded 5,088 runs at a strike-rate of 92.44 and an average of 39.75. Additionally he grabbed 133 wickets and at one point he was indispensable to the Aussie squad in yellow. Later when his career declined, he found a competitor for his slot in Shane Watson. In an increasingly professional sporting realm, Symonds had the amateur spirit. He preferred his fishing and hiking trips which at times affected his availability to play for his country. The odd team meeting was skipped and he paid a price. Years later he sought companionship with alcohol through nights laced with self-pity and anger, a fall-out of the scars he carried from the Monkeygate controversy during the Sydney Test against India in 2008. The unsavoury episode in which he accused Harbhajan Singh of using a racist term ‘monkey’ against him snowballed into a rift between the cricket boards of India and Australia. An enquiry proved inconclusive with Harbhajan insisting on his innocence and seeking refuge in a Hindi expletive that mimics the word monkey. Symonds felt let down by Cricket Australia and even if a conciliatory photo-opportunity later cropped up as he rubbed shoulders with his then Mumbai Indians’ team-mate Harbhajan, the Aussie was never the same force of nature which he was in his prime. Symonds last played for Australia in 2009 before slipping into the shadows, but in his pomp, he pulled in the crowds, inspired children to copy his swag and was always an electric personality. He leaves behind memories of a splendid player and a fragile human being in equal measure and cricket has lost a unique character in these times of stylised beards, dull words and burnouts. Our code of editorial values Printable version | May 16, 2022 2:12:13 am | https://www.thehindu.com/sport/a-flamboyant-all-rounder-who-flourished-inodis-departs/article65417817.ece © THG PUBLISHING PVT LTD.","pubDate":"2022-05-15 20:41:13","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Thrill-seeker Emma Raducanu takes Porsche out for a spin at Brands Hatch after being romantically linked with MotoGP ace","link":"https://www.thesun.co.uk/sport/18578257/emma-raducanu-porsche-romantic-link-fabio-quartararo/","keywords":["Sport","Tennis"],"creator":["Giacomo Pisa"],"video_url":null,"description":"TENNIS star Emma Raducanu swapped the court for a car as she took a Porsche out for a spin at Brands Hatch. The 19-year-old thrill-seeker was unveiled as the face of Porsche earlier this year. And she got behind the wheel of one of the supercars as she enjoyed a day out at the race […]","content":"TENNIS star Emma Raducanu swapped the court for a car as she took a Porsche out for a spin at Brands Hatch. The 19-year-old thrill-seeker was unveiled as the face of Porsche earlier this year. And she got behind the wheel of one of the supercars as she enjoyed a day out at the race track. Raducanu is an avid petrolhead and has previously shared her love for cars. She couldn't get enough of the noise of the engine too, captioning an Instagram post: \"This rumble just my new ringtone… may let it ring out.\" SunSport exclusively revealed on Sunday that Raducanu has been flirting online with French MotoGP star Fabio Quartararo . Raducanu spotted shots of the 23-year-old MotoGP champion on Instagram and the pair have been exchanging messages. A source said: “They’re both young, attractive and have an interest in motorsports .” Teen star Raducanu's last action on the court came last week in Rome. The US Open winner was forced to withdraw from the Italian Open through injury an hour into her clash against Bianca Andreescu. FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS Raducanu was heard telling the umpire she \"couldn't move\" after suffering from back problems. She had also struggled with problems in that area of her body during the previous tournament in Madrid .","pubDate":"2022-05-15 18:46:15","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IPL 2022, Lucknow Super Giants vs Rajasthan Royals Highlights: All-round RR humble LSG by 24 runs, inch c - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMi1AFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLTIwMjItbHVja25vdy1zdXBlci1naWFudHMtdnMtcmFqYXN0aGFuLXJveWFscy1oaWdobGlnaHRzLWFsbC1yb3VuZC1yci1odW1ibGUtbHNnLWJ5LTI0LXJ1bnMtaW5jaC1jbG9zZXItdG8tcGxheS1vZmZzL2FydGljbGVzaG93LzkxNTgyMDI4LmNtc9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, Lucknow Super Giants vs Rajasthan Royals Highlights: All-round RR humble LSG by 24 runs, inch c  Times of IndiaLive match blog - Royals vs Super Giants 63rd Match 2022 - Cricket Insights  ESPNcricinfoLive Cricket Score: LSG vs RR, Match 63, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022, LSG vs RR | Twitter reacts to Ravichandran Ashwin and Jimmy Neesham's run out controversy  SportsCafeLSG vs RR: KL Rahul disappointed with Lucknow batters after defeat to Rajasthan - We have to go back and get better  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-05-15 18:21:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"On India's first-ever Thomas Cup triumph: It cannot Get Bigger says Gopichand","link":"https://www.thehansindia.com/sports/on-indias-first-ever-thomas-cup-triumph-it-cannot-get-bigger-says-gopichand-742869","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"The Indian men's badminton team on Sunday scripted history by winning the gold medal at the Thomas Cup for the first time.","content":"India's team members pose with their nation flag after winning Thomas Cup title in Bangkok, Thailand, on Sunday New Delhi: The Indian men's badminton team on Sunday scripted history by winning the gold medal at the Thomas Cup for the first time. India beat 14-time champions and holders Indonesia 3-0 in the final, with Lakshya Sen and Satwiksairaj Rankiredd-Chirag Shetty pulling off come-from-behind wins and Kidambi Srikanth sealing the gold medal in style with a straight-games win. Former badminton star Pullela Gopichand, while speaking to NDTV, hailed the win as a \"great moment for India and Indian sports.\" \"I think this a great moment for India and Indian sports. India winning the Thomas Cup is not just big for India but for badminton world,\" Gopichand told NDTV. \"The women have definitely done well for us but for the entire (men's) team coming together to do well and win the Thomas Cup is really wonderful to see,\" he said. Speaking about the magnitude of the win, he said: \"It cannot get bigger than this. For us to have a young team and do well and go out and just win is very, very big.\" \"I think the doubles win was incredible. They had lost to the Indonesian pair several times so to shake that off and win was big. Not to take anything away from Lakshya as he played really well,\" he said when asked which of the three wins on Sunday was the toughest. The depth of the team really helps. Lakshya playing the first singles and losing still allows a chance as the likes of Kidambi and Prannoy were still there,\" he said. \"For us the Asia Games should be the next target. As team India the CWG will be another big target. Hopefully we will be able to achieve a lot of other firsts,\" he said, speaking about what Indian badminton should be aiming for next. Former badminton player Trupti Murgunde, who won the bronze medal for India in the mixed team event at the 2006 Commonwealth Games, hailed the win as \"unbelievable\". \"What a joyous moment. It is unbelievable. Making the final was great and now we have Thomas Cup in our hands,\" she told NDTV. \"Everybody was glued to the TV it was like the final of a World Cup cricket match,\" she exclaimed. \"All three games were close. Lakshya showed great guts because the first match is always important. The doubles team came back after losing the first game and came back from a deficit in the second game and then converted it in the third, that gave a lot of confidence to Kidambi who was playing the third game,\" she said, while speaking about the final. She spoke further about Lakshya Sen, who came back from losing his first game 8-21 to register a crucial win in the opening match for India, helping the team get off to a strong start that they later capitalised on. \"The tactical changes that Lakshya did after losing the first game and the way he made the changes and got his confidence back was great. It is easy to speak for us sitting out but for the player to are the changes at a crucial time is amazing. A lot of credit to him,\" she said Thomas Cup winners (Since 1949 – 2022) 1949 - Malaya beat Denmark 8-1 1952 - Malaya bt USA 7-2 1955 - Malaya bt Denmark 8-1 1958 - Indonesia bt Malaya 6-3 1961 - Indonesia bt Thailand 6-3 1964 - Indonesia bt Denmark 5-4 1967 - Malaysia bt Indonesia 6-3 1970 - Indonesia bt Malaysia 7-2 1973 - Indonesia bt Denmark 8-1 1976 - Indonesia bt Malaysia 9-0 1979 - Indonesia bt Denmark 9-0 1982 - China bt Indonesia 5-4 1984 - Indonesia bt China 3-2 1986 - China bt Indonesia 3-2 1988 - China bt Malaysia 4-1 1990 - China bt Malaysia 4-1 1992 - Malaysia bt Indonesia 3-2 1994 - Indonesia bt Denmark 5-0 1996 - Indonesia bt Malaysia 3-2 1998 - Indonesia bt China 3-0 2000 - Indonesia bt China 3-0 2002 - Indonesia bt Malaysia 3-2 2004 - China bt Denmark 3-0 2006 - China bt Denmark 3-0 2008 - China bt South Korea 3-1 2010 - China bt Indonesia 3-0 2012 - China bt Korea 3-0 2014 - Japan bt Malaysia 3-2 2016 - Denmark bt Indonesia 3-2 2018 - China bt Japan 3-1 2020 - Indonesia bt China 3-0 2022 – India bt Indonesia 3-0 (2024 Thomas Cup to take place in China) Most title winners Indonesia - 14 times (1958, 1961*, 1964, 1970, 1973*, 1976, 1979*, 1984, 1994*, 1996, 1998, 2000, 2002, 2020.) China - 10 times (1982, 1986, 1988, 1990, 2004, 2006, 2008, 2010, 2012, 2018) Malaysia – 5 times (1949, 1952, 1955, 1967, 1992) Japan - 1 time (2014) Denmark – 1 time (2016) India – 1 time (2022)","pubDate":"2022-05-15 18:20:33","image_url":"https://assets.thehansindia.com/h-upload/2022/05/15/500x300_1292360-thomas-cup.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, LSG vs RR LIVE Updates: Rajasthan Royals Close In On Victory, Lucknow Super Giants 7 Down In Chase Of 179 - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1sc2ctdnMtcnItbGl2ZS1jcmlja2V0LXNjb3JlLWx1Y2tub3ctc3VwZXItZ2lhbnRzLXZzLXJhamFzdGhhbi1yb3lhbHMtbGl2ZS1zY29yZWJvYXJkLWFuZC11cGRhdGVzLTI5NzgxOTTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, LSG vs RR LIVE Updates: Rajasthan Royals Close In On Victory, Lucknow Super Giants 7 Down In Chase Of 179  NDTV SportsMatch Preview - Royals vs Super Giants, Indian Premier League 2022, 63rd Match  ESPNcricinfoLSG vs RR Live Score, IPL 2022: Deepak Hooda falls after fifty as Lucknow Super Giants wobble in chase  Times of IndiaIPL 2022, RR vs LSG, Live Cricket Score: Rajasthan Royals on Top, Lucknow Super Giants Reeling  India.com#LSGvRR | Cricbuzz Live: Match 63, Lucknow v Rajasthan, Mid-innings show  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-05-15 17:47:33","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, LSG vs RR Live Score Updates: Deepak Hooda brings up his 50 - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiU2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWxzZy12cy1yci1saXZlLXNjb3JlLTc5MTg0NTgv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, LSG vs RR Live Score Updates: Deepak Hooda brings up his 50  The Indian Express#LSGvRR | Cricbuzz Live: Match 63, Lucknow v Rajasthan, Mid-innings show  CricbuzzMatch Preview - Royals vs Super Giants, Indian Premier League 2022, 63rd Match  ESPNcricinfoLSG vs RR Live Score, IPL 2022: Ravi Ashwin scalps Krunal Pandya; Deepak Hooda key for Lucknow Super Giants  Times of IndiaLive Cricket Score: LSG vs RR, Match 63, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-05-15 17:23:15","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Andrew Symonds: Cricket legend's eerie interview about Queensland traffic before car crash death - Daily Mail","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3d3dy5kYWlseW1haWwuY28udWsvc3BvcnQvY3JpY2tldC9hcnRpY2xlLTEwODE4MTY3L0FuZHJldy1TeW1vbmRzLUNyaWNrZXQtbGVnZW5kcy1lZXJpZS1pbnRlcnZpZXctUXVlZW5zbGFuZC10cmFmZmljLWNhci1jcmFzaC1kZWF0aC5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Andrew Symonds: Cricket legend's eerie interview about Queensland traffic before car crash death  Daily MailAndrew Symonds was an all-rounder who could turn his hand to almost anything  The MirrorAndrew Symonds: Former Australia all-rounder dies aged 46  Sky SportsFormer Kent cricket star dies in crash  Kent OnlineView Full coverage on Google News","content":null,"pubDate":"2022-05-15 16:27:32","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Andrew Symonds RIP: Andrew Symonds death reason","link":"https://thesportsrush.com/cricket-news-andrew-symonds-rip-andrew-symonds-death-reason/","keywords":["Cricket","Andrew Symonds","Symonds Death"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Andrew Symonds RIP: Former Australian all-rounder passed away in Queensland aged just 46 on Saturday night. The whole cricketing world is mourning the loss of former Australian all-rounder Andrew Symonds. These last months have not been great for Australian cricket. Shane Warne passed away earlier this year and now Andrew Symonds lost his life. Andrew… The post Andrew Symonds RIP: Andrew Symonds death reason appeared first on The SportsRush.","content":"Andrew Symonds RIP: Former Australian all-rounder passed away in Queensland aged just 46 on Saturday night. The whole cricketing world is mourning the loss of former Australian all-rounder Andrew Symonds. These last months have not been great for Australian cricket. Shane Warne passed away earlier this year and now Andrew Symonds lost his life. Andrew Symonds was born in the UK and was adopted by a British pair, who bought him to Australia when he was just three months old. Symonds did all his training in Queensland only. Andrew Symonds left behind a family of three, his wife Laura and two children. Symonds had a chance to play for England in international cricket, but he denied the opportunity. Andrew Symonds was one of the most lethal white-ball all-rounders in Australian cricket. He was an exceptional hitter of the ball, whereas his bowling and fielding were incredibly brilliant as well. Symonds won two ICC Cricket World Cups with Australia in 2003 and 2007 respectively. Andrew Symonds RIP Andrew Symonds died in a car accident outside Townsville, Queensland on Saturday night. He was around 50 Kms outside Townsville. He was the single occupant in the car. The news sent shockwaves in the cricketing fraternity all around the world. “Australian cricket has lost another of its very best. Andrew was a generational talent who was instrumental in Australia’s success at World Cups and as part of Queensland’s rich cricket history,” Cricket Australia’s statement read. One minute of Andrew Symonds direct-hit run outs! pic.twitter.com/MHRqNp1w1d — cricket.com.au (@cricketcomau) May 15, 2022 Andrew Symonds was famously called Roy in the cricketing fraternity. Symonds was indulged in quite a few controversies as well, but the record of Andrew Symonds spoke for himself. He scored 5088 ODI runs, courtesy of six centuries and 30 half-centuries, whereas he also scalped 133 wickets in his bowling. The T20 cricket came in the latter part of Symonds’ career, and he could just play 14 T20Is in his career. However, he played for Mumbai Indians and Deccan Chargers in the Indian Premier League. Symonds bagged a contract of USD 1.35 million from the Deccan Chargers. in IPL 2008. The post Andrew Symonds RIP: Andrew Symonds death reason appeared first on The SportsRush.","pubDate":"2022-05-15 16:23:35","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Hope badminton becomes popular like cricket after Thomas Cup win: Vimal Kumar","link":"https://www.indiatvnews.com/sports/other/hope-badminton-becomes-popular-like-cricket-after-thomas-cup-win-vimal-kumar-india-beat-indonesia-3-0-2022-05-15-776792","keywords":null,"creator":null,"video_url":null,"description":"Vimal Kumar, Indian men's badminton coach, hopes that the unprecedented Thomas Cup win should do the same for badminton in the country as the 1983 World Cup win did for cricket.","content":"Vimal Kumar, Indian men's badminton coach, hopes that the unprecedented Thomas Cup win should do the same for badminton in the country as the 1983 World Cup win did for cricket. In beating 14-time winners Indonesia 3-0 in the summit showdown in Bangkok, Lakshya Sen, Kidambi Srikanth and the doubles duo of Chirag Shetty and Satwiksairaj Rankireddy conjured one of the most remarkable feats in the country's sporting history. It was no surprise that Kumar was unable to describe the historic victory. \"I have no words to describe it, we always had hopes but the way the players played, they just put up a performance out of the blue. It was really fantastic. We had such a poor record against Indonesia, and to win 3-0 is incredible,\" Kumar told PTI from Bangkok. The unassuming coach, who goes about his job quietly, added, \"In 1983, when India won the cricket World Cup, the euphoria was something else but cricket was always a very popular sport and I hope with this performance, now badminton can also become so popular.\" \"It has always been about individual achievements but this was a team performance and I hope the popularity of the sports goes up from here on.\" Kumar rated this as Indian badminton's biggest ever achievement. \"I will rate this the biggest ever. Of course, Prakash and Gopi winning All England, Sindhu winning, all great achievements but as a team what we have done, we couldn't deliver as a team (earlier). You call one a badminton nation when you win a team championships, so I will rate it as the best. \"I am happy that I could see this in my life time. It is a dream come true for me.\" India, who has never reached the last-four stage since 1979, ended up getting the better of formidable Malaysia and Denmark en route to the summit clash in this edition of the tournament. Needless to say, the triumph on the day when it mattered the most sparked off wild celebrations in the Indian camp, less than 48 hours after they rejoiced their win over Denmark. \"I have never seen them so enthusiastic, it is a achievement of pure team spirit which I haven't seen in the past. We always had good players but priority was on individual players and tournaments. We have a balanced team and it did the trick. \"In each match what the doubles players have done is amazing, earlier we were dependent on singles but Satwik and Chirag pulled out all the pressure matches, so lot of credit to Lakhsya, Srikanth and HS Prannoy, for they delivered when it mattered. I am fortunate, lucky coach to be here with them,\" Kumar said. \"It is the best achievement of Indian badminton, and I feel so proud to be part of this historic team. It is a fantastic bunch of players.\" Vimal also credited Srikanth and Prannoy for playing an important role in motivating the players. \"I will give a lot of credit to these guys, they would sit down with players, speak to them and motivate each other. \"When the older player takes initiative and motivates the players, their comforting words make a big difference. They firmly believed they will be able to win and that belief turned things for us. It was a fantastic team effort. Coaches worked hard, so overall this is a fantastic effort.\" Asked if Srikanth has regained his mojo after struggling for 3-4 years since his exploits in 2017, Vimal said: \"Yes, I think so, we were seeing glimpses of it in World Championships, he was showing progress but for three years he didn't do well. In 2017 he was awesome, but very happy to see him coming back. He has become a great motivator for the young players.\" After being off-colour against Malaysia and Denmark, Lakshya Sen finally delivered with a three-game win over Anthony Ginting. Vimal said Lakshya had food poisoning after he ate something in Bangalore airport. \"..whole flight he was sick. We forced him to play against Germany and after that he was given rest, but we had to field him so it was tough for him. \"He got better every day, and today against Ginting he had beaten him in Germany but I thought he would lose after he got a bad mauling in the first game but he made a comeback, I am really proud of him for what he did today.\" Vimal said this performance will spur the players to do well in the upcoming major events such as the Commonwealth Games and the Asian Games.","pubDate":"2022-05-15 15:33:21","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Hope Thomas Cup triumph does for badminton what 1983 World Cup win did for cricket: Vimal Kumar","link":"https://www.indiatoday.in/sports/badminton/story/hope-thomas-cup-triumph-does-for-badminton-what-1983-world-cup-win-did-for-cricket-vimal-kumar-1949801-2022-05-15?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Vimal Kumar hopes Thomas Cup triumph makes badminton a popular sport in India","content":null,"pubDate":"2022-05-15 15:28:41","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Beat Them Psychologically\": Akhtar On Pak's Ploy To Beat India In 2004","link":"https://sports.ndtv.com/cricket/beat-them-psychologically-shoaib-akhtar-remembers-pakistans-ploy-to-defeat-india-in-2004-2978647","keywords":null,"creator":null,"video_url":null,"description":"The Indian cricket team toured Pakistan for five ODIs and three Tests in 2004.","content":"The Indian cricket team's 2004 tour of Pakistan was a memorable one. Team India won the five-match ODI series 3-2 while they beat the hosts 2-1 in the three-match Test series. After that, India toured Pakistan only once in 2005-06. The last time the two teams played a bilateral series was back in 2012-13 when Pakistan toured India. Shoaib Akhtar has been part of many such bilateral series and in an interview revealed Pakistan's plans against India for the 2004 tour. \"We wanted to create pacy wickets for Indian batters. Dry but pacy, where scores like 350 would not be made. Our plan was to dominate the first match, then the second and make a pacy one for the third match. 'Psychologically marte hain inko'. But then you caught a brilliant catch and turned the match,\" Akhtar told Mohammad Kaif in a video chat show on Sportskeeda cricket . The catch that Akhtar was referring to was of Inzamam-ul-Haq in the first ODI. India had put on 349 runs in the first innings. Rahul Dravid fell short of his hundred by one run in the match. Kaif made a valuable contribution of 46 runs in the middle-order. During the chase, Inzamam-ul-Haq's century kept Pakistan in the hunt. They needed just 10 runs off the last eight balls when Shoaib Malik skied one towards long on off Zaheer Khan and Kaif ran from long off at full speed, stretched full length and grasped the ball with both hands -- nearly hitting teammate Hemang Badani in the process -- to give India hope. Promoted That proved to be the game-changer as Pakistan crumbled under pressure, unable to score the required 9 runs off the final over. \"We got a lot of love and respect in Pakistan during our tour. Not only me, Sachin, Dravid, Ganguly everyone will say the same about that tour. We had to take permission to go out shopping. But when I went shopping, no one was ready to take money. Everyone used to say - you have come from India to play cricket, you are our guests,\" Kaif said.","pubDate":"2022-05-15 15:21:30","image_url":"https://c.ndtvimg.com/2020-04/noesqvc8_shoaib-akhtar-afp_625x300_22_April_20.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Rajasthan Royals Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-rajasthan-royals-live-score-over-match-63-t20-11-15-updates-2978564","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Rajasthan Royals from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.3 overs, Rajasthan Royals are 135/4. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Rajasthan Royals. Everything related to Lucknow Super Giants and Rajasthan Royals match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Rajasthan Royals live score. Do check for Lucknow Super Giants vs Rajasthan Royals scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (1 Run) 1 run. 14.5 overs (0 Run) A stifled appeal for LBW from Krunal Pandya but the umpire is not interested! Quicker through the air, on a length, around leg. James Neesham misses his sweep and gets hit on his pad. The replays show that the ball was pitched way outside leg. 14.4 overs (0 Run) On a length, just outside off. James Neesham punches it towards covers. 14.3 overs (4 Runs) MISFIELD AND FOUR! Mohsin Khan's tough time in the field continues! This is a full ball, around off. Neesham kneels and brings out the reverse sweep. Mohsin Khan at short third man moves to his left to stop the ball but it goes past him and races away to the fence. 14.2 overs (1 Run) A bit slower through the air, around off. Parag eases it to long off for a single. 14.1 overs (1 Run) A quicker ball, full and around off. James Neesham pushes it wide of the extra cover fielder and gets to the other end. Strategic break. A lovely passage of play for Lucknow as they removed Samson, Jaiswal and Padikkal in quick succession. All the set batters are back in the hut and Lucknow will aim to capitalize on those timely breakthroughs. Rajasthan don't bat too deep and the current pair will have to navigate them to a challenging total. 13.6 overs (1 Run) This is a full ball, outside off. Neesham prods and drives it to long off for an easy single. 13.5 overs (0 Run) Floated, full and around off. James Neesham pushes it back to the bowler. James Neesham is in next. 13.4 overs (0 Run) OUT! CAUGHT! Another set batter holes out and this is a huge moment in this game as Devdutt Padikkal was looking in the mood. Bishnoi serves a googly, full and just outside off. Padikkal kneels and looks for yet another slog-sweep. Although, he mistimes his shot this time and the ball goes to Krunal Pandya at deep mid-wicket who takes a tumbling catch to his right. Lucknow are back in the contest now! 13.3 overs (2 Runs) Short and outside off. Padikkal rocks back and cuts it behind square on the off side for a couple of runs. 13.2 overs (4 Runs) FOUR! SMASHED! Tosses it up, around off. Padikkal gets down and smacks it wide of the long on fielder for yet another boundary. 13.1 overs (0 Run) An overpitched ball, around off. Devdutt Padikkal digs it out towards extra cover. 12.6 overs (0 Run) This is a quicker ball, around leg. Parag misses his flick and gets hit on his pad. Outside the line though! 12.5 overs (1 Run) On a length, around middle. Devdutt Padikkal nudges it through mid-wicket and settles for a single. 12.4 overs (6 Runs) SIX! This is dragged down, on leg. Padikkal rocks back and launches it over the deep mid-wicket fence for a biggie. Padikkal is playing a blinder for his side here. 12.3 overs (1 Run) A quicker ball, going on with the angle, from middle. Parag works it towards deep mid-wicket for a run. 12.2 overs (0 Run) Nicely tossed up, around off. Parag waits for the turn and taps it towards backward point. 12.1 overs (1 Run) This is darted on the pads. Padikkal flicks it to deep mid-wicket and rotates the strike. Bowling change. Here comes Krunal Pandya. He's the 8th bowler to be used by Lucknow. 11.6 overs (2 Runs) Slightly short and outside off. Riyan Parag cuts it past the backward point fielder and comes back for the second run. 6 runs and a wicket off the over. 11.5 overs (2 Runs) Slower through the air, on a length, outside off. Riyan Parag mistimes his heave, wide of the deep mid-wicket fielder for a brace. 11.4 overs (1 Run) Around off. Devdutt Padikkal eases it to long on for a single. 11.3 overs (1 Run) Leg bye! Floated, around leg. Parag misses his flick and gets hit on his pad. The ball rolls to the leg side for a leg bye. Riyan Parag is the new batter. 11.2 overs (0 Run) OUT! CAUGHT AND BOWLED! The ploy to bring on an off-spinner against two left-handed batters has done wonders for Lucknow! Badoni tosses it up, on off. Yashasvi Jaiswal kneels and looks to slog-sweep but the ball goes off the top edge and goes high in the night sky. Ayush Badoni runs to his left, settles under it and takes a really good catch. Rajasthan lose a set batter now and this is a timely wicket for Lucknow. 11.1 overs (0 Run) Tossed up, outside off. Yashasvi Jaiswal drives hard but straight to KL Rahul at extra cover. Ayush Badoni to bowl his offies. 10.6 overs (4 Runs) FOUR! Easy pickings! A length ball, darted on the pads. Devdutt Padikkal stays back and tickles it through to the fine leg region to bag a boundary. 100 comes up for Rajasthan! 10.5 overs (2 Runs) A short ball, around leg. Devdutt Padikkal looks to pull but he gets a bit late on it. The ball hits the top edge and lands just behind the keeper for a brace. 10.4 overs (4 Runs) FOUR! Not where the batter intended it to go but Rajasthan will take that anyway! Chameera serves a length ball, around off. Devdutt Padikkal skips down the track and looks to heave it away through mid-wicket. The ball hits the splice of his bat and goes over the mid off fielder. KL Rahul gives it a chase, puts in a dive in front of the ropes but fails to stop it cleanly. The ball touches the ropes. 10.3 overs (0 Run) Chameera runs in and hits the deck hard, around off. Padikkal sits back and defends it to the off side. 10.2 overs (0 Run) On a length, around off. Padikkal looks to steer it through the third man region but it takes the thick outside edge and lands just in front of Quinton de Kock behind the sticks. 10.1 overs (1 Run) Back of a length, around middle. Yashasvi Jaiswal tucks it to the leg side and takes a single.","pubDate":"2022-05-15 15:13:53","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637882442242850335.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, RR vs LSG, Live Cricket Score: Jaiswal Departs; Parag-Padikkal Key For Rajasthan Royals - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi7QFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtY3JpY2tldC1zY29yZS1sc2ctdnMtcnItaXBsLW1hdGNoLTYyLXVwZGF0ZXMtYnJhYm91cm5lLWx1Y2tub3ctc3VwZXItZ2lhbnRzLXZzLXJhamFzdGhhbi1yb3lhbHMtbGl2ZS1zdHJlYW1pbmctaG90c3Rhci1iYWxsLWJ5LWJhbGwtY29tbWVudGFyeS1wYXJhZy1wYWRpa2thbC1jaGFtZWVyYS1hdmVzaC1ob2xkZXItYmlzaG5vaS1iYWRvbmktNTM5MzMzNS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, RR vs LSG, Live Cricket Score: Jaiswal Departs; Parag-Padikkal Key For Rajasthan Royals  India.comMatch Preview - Royals vs Super Giants, Indian Premier League 2022, 63rd Match  ESPNcricinfoLucknow Super Giants vs Rajasthan Royals Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorIPL 2022, RR vs LSG, Live Cricket Score: Jos Buttler Perishes; Samson-Jaiswal Key For Rajasthan  India.comIPL 2022: Gujarat Titans Have Never Looked Dependent on One or Two Players, Says Rashid Khan  News18View Full coverage on Google News","content":null,"pubDate":"2022-05-15 15:08:22","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Thomas Cup win is Indian badminton's 1983 Cricket World Cup victory moment, says coach Vimal Kumar","link":"https://zeenews.india.com/badminton/thomas-cup-win-is-indian-badmintons-1983-cricket-world-cup-victory-moment-says-coach-vimal-kumar-2463863.html","keywords":null,"creator":null,"video_url":null,"description":"Indian team came out all guns blazing to beat the 14-time winners Indonesia 3-0 in the final in Bangkok courtesy wins from Lakshya Sen, Kidambi Srikanth and the doubles duo of Chirag Shetty and Satwiksairaj Rankireddy.","content":"Indian men's badminton team scripted history on Sunday (May 15) when they defeated Indonesia in the Thomas Cup. Not to forget, India had never won Thomas Cup in its 73-year run and the win is being hailed as one of the glorious moments in the Indian badminton history. If the team coach Vimal Kumar is to be believed, this historic Thomas Cup triumph can do the same to the Indian badminton what the 1983 World Cup win did to cricket. HISTORY SCRIPTED ___ Pure show of grit and determination & India becomes the #ThomasCup champion for the 1__st time in style, beating 14 times champions Indonesia __ 3-0 in the finals _ It's coming home! __ #TUC2022 #ThomasCup2022 #ThomasUberCups #IndiaontheRise #Badminton pic.twitter.com/GQ9pQmsSvP — BAI Media (@BAI_Media) May 15, 2022 Indian team came out all guns blazing to beat the 14-time winners Indonesia 3-0 in the final in Bangkok courtesy wins from Lakshya Sen, Kidambi Srikanth and the doubles duo of Chirag Shetty and Satwiksairaj Rankireddy. In the post-match press conference, Kumar fell short of words to describe his feelings. \"I have no words to describe it, we always had hopes but the way the players played, they just put up a performance out of the blue. It was really fantastic. We had such a poor record against Indonesia and to win 3-0 is incredible,\" Kumar told PTI from Bangkok. Adarniya Pradhan Mantri Shri @narendramodi ji joining the celebrations of a historic win with our players is such a morale boosting gesture. Thank you Sir for speaking to our players soon after their feat. India is proudly rejoicing our victory at the Thomas Cup. https://t.co/fGjvpTRhYo — Himanta Biswa Sarma (@himantabiswa) May 15, 2022 The unassuming coach, who goes about his job quietly, added, \"In 1983, when India won the cricket World Cup, the euphoria was something else but cricket was always a very popular sport and I hope with this performance, now badminton can also become so popular.\" \"It has always been about individual achievements but this was a team performance and I hope the popularity of the sports goes up from here on.\" Kumar went on to say that this is Indian badminton's biggest ever achievement, even better than Prakash Padukone and Pullela Gopichand's All England wins and PV Sindhu's medals in Olympics. \"I will rate this the biggest ever. Of course, Prakash and Gopi winning All England, Sindhu winning, all great achievements but as a team what we have done, we couldn't deliver as a team (earlier). You call one a badminton nation when you win a team championships, so I will rate it as the best. India's historic win was celebrated by even the Prime Minister of Indian Narendra Modi and other athletes like Virat Kohli and Sunil Chhetri.","pubDate":"2022-05-15 14:41:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Why LSG players wearing black armbands: Why Lucknow Super Giants wearing black armbands in today IPL match vs Rajasthan Royals?","link":"https://thesportsrush.com/cricket-news-why-lsg-players-wearing-black-armbands-why-lucknow-super-giants-wearing-black-armbands-in-today-ipl-match-vs-rajasthan-royals/","keywords":["Cricket","IPL 2022","Lucknow Super Giants","LSG vs RR"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Why LSG players wearing black armbands: Lucknow Super Giants players are wearing black armbands in the respect of Andrew Symonds. Lucknow Super Giants are up against Rajasthan Royals in the 63rd league match of the Indian Premier League 2022. The match is being played at the Brabourne Stadium in Mumbai. Rajasthan Royals won the toss… The post Why LSG players wearing black armbands: Why Lucknow Super Giants wearing black armbands in today IPL match vs Rajasthan Royals? appeared first on The SportsRush.","content":"Why LSG players wearing black armbands: Lucknow Super Giants players are wearing black armbands in the respect of Andrew Symonds. Lucknow Super Giants are up against Rajasthan Royals in the 63rd league match of the Indian Premier League 2022. The match is being played at the Brabourne Stadium in Mumbai. Rajasthan Royals won the toss and opted to bat first, and they made two changes in their playing eleven. Jimmy Neesham and Obed McCoy replaced Kuldeep Sen and Rassie van der Dussen in the playing eleven. Ravi Bishnoi replaced Karan Sharma in the Lucknow Super Giants playing eleven. “We want to have a bat. That’s been our strength throughout the tournament, we’d like to stick with that,” Sanju Samson said at the toss. A win in this game will seal the top-2 places for the Lucknow Super Giants, whereas a win for Rajasthan Royals will seal their place in the playoffs. Lucknow Super Giants are wearing black armbands in the match against Rajasthan Royals as a mark of respect for the former Australian all-rounder Andrew Symonds. Australian all-rounder Andrew Symonds passed away last night in a car crash in Queensland. The whole cricketing world is mourning the loss of Andrew Symonds. Symonds was one of the most decorated white-ball players. Famous for his aggressive batting, Symonds was a wicket-taker with the ball, whereas he was brilliant in the field as well. A true legend of the game, who made watching cricket a pleasure. Rest in glory, Andrew 💔 #RIPRoy pic.twitter.com/gRZY0FGnGw — Lucknow Super Giants (@LucknowIPL) May 15, 2022 He was surrounded by a lot of controversies throughout his career, but he had a brilliant career. Symonds won two ICC Cricket World Cups with Australia in 2003 and 2007. He scored 5088 ODI runs, whereas he also scalped 133 wickets in bowling. Symonds just played 14 T20Is for Australia. Also Read: Net Worth of Andrew Symonds The T20 cricket wave came in the latter part of his career, and he played for Deccan Chargers and Mumbai Indians in the Indian Premier League. Ahead of the inaugural edition of Indian Premier League 2022, Symonds bagged a contract of USD 1.35 million from the Deccan Chargers.","pubDate":"2022-05-15 14:23:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Highlights, IPL 2022 CSK vs GT, Full cricket score: Gujarat Titans win by seven wickets - Firstpost - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLWlwbC0yMDIyLWNzay12cy1ndC1mdWxsLWNyaWNrZXQtc2NvcmUtZ3VqYXJhdC10aXRhbnMtd2luLWJ5LXNldmVuLXdpY2tldHMtMTA2NzI3OTEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights, IPL 2022 CSK vs GT, Full cricket score: Gujarat Titans win by seven wickets - Firstpost  FirstpostIPL 2022, CSK vs GT Highlights: Gujarat Titans win the game by 7 wickets  The Indian ExpressLive Cricket Score - CSK vs GT, Match 62, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzCSK vs GT highlights, IPL 2022: Gujarat Titans beat Chennai Super Kings by 7 wickets  Times of IndiaCSK vs GT Dream11 Prediction Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-05-15 14:04:35","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Andrew Symonds – A hard-hitting batsman, great fielder, World Cup winner and controversial figure","link":"https://www.opindia.com/2022/05/andrew-symonds-great-fielder-world-cup-winner-and-controversial-figure/","keywords":["Cricket","News Reports","Opinions","Sports","2003","2007","andrew symonds","Australia","fielder","monkey gate","Symonds","winner","World Cup"],"creator":["Ritesh"],"video_url":null,"description":"Australian cricketer Andrew Symonds passed away at the age of 46 in a car accident on Sunday morning","content":"In less than 3 months, the cricket world is mourning again the death of another Australian cricketer, Andrew Symonds. On Sunday morning he passed away at the age of 46 in a car accident. The aggressive all-rounder played a very important role in Australia’s success in white-ball cricket. Born in Birmingham, England, to Afro-Caribbean and Swedish parents, Symonds was adopted by Ken and Barbara Symonds and moved to Australia with his parents when he was just 3 months old. ‘I’m an adopted child, right, so I don’t actually know my natural parents. I’ve never met them,’ he told this to Brett Lee last month. Symonds was always known for his hard-hitting batting, in 1995 during his knock of 254, Symonds smashed 16 sixes for Gloucestershire in the county match which was a record at that time. The same year he was selected for the England A team for the tour of Pakistan but he refused as he wanted to play for Australia. In 1998, he got the chance to play for Australia when he made his debut in white-ball cricket against Pakistan but didn’t get a chance to bat. He was then dropped and got back into the team after around a gap of 10 months. But after making a comeback Symonds cemented his place in the ODI squad and became an important member of the team. Symonds was not only a hard-hitting batsman but was also a useful part-time bowler and an absolute gun fielder. Many people regard his 143* against Pakistan in the World Cup 2003 as one of the greatest world cup hundred. Symonds scored these runs against the likes of Wasim, Waqar, Shoaib etc when the team was struggling after losing 4 wickets for just 86 runs. In the semi-final of the same World Cup, he smashed 91 against Sri Lanka when no one else could score even 40 from either side. Australia went on to win the World Cup and again in 2007, both Symonds and Hayden were part of these two wins and they are the only two players who never lost a World Cup match, among those who played minimum 5 world cup matches. Symonds has amazing consistency outside Australia. In countries where he played minimum 10 innings, he averaged 60 while in Australia he averaged just 29. Symonds played 198 ODIs for Australia in which he scored 5504 runs and took 133 wickets. 6 feet tall Symonds was considered one of the greatest fielders of the modern era because he was quite an athlete. He could hit the stumps at will and his agile throws saw many batsmen short of the crease. He took 85 catches in white-ball cricket and dismissed many batsmen through runouts. In Tests, Symonds wasn’t as successful as he was in white-ball cricket but one of his test hundred is remembered by many, especially Indians. In the 2007 Sydney Test, Symonds scored 162* against India in the first innings. It was a controversial knock as he nicked the ball when he was on 30 and didn’t walk. Later the monkey-gate episode and dubious decision on the fifth day of the test made it more ugly. Later that year, he was sent to mental rehabilitation by Cricket Australia for missing a mandatory team meeting and falling out with seniors. Just after completing the mental rehabilitation, Symonds was caught in an altercation at a Brisbane pub. Though he was proven innocent Symonds published an apology statement, “I have told my teammates that I am sorry to have put them through this distraction at a time when they are trying to prepare for a Test match. I have been and am still going through a counselling process and I give my teammates, Cricket Australia and Australian cricket fans a commitment that I will continue the counselling work which, as I have already said publicly, is something I want to use to help me understand how and why I behave so I can be a better person. Wearing Baggy Green is an honour and being part of this group is a privilege that is important to me. I have learnt a valuable lesson from this incident and I know that actions speak louder than words and that’s how I will be judged.” Symonds was part of the IPL too. In the second season of IPL, his team Deccan Chargers won the tournament. Later he moved to Mumbai Indians to play alongside Harbhajan Singh who was involved in the monkey-gate episode. He was a controversial figure but he will be remembered as one of the greatest fielders of all time and one of the greatest white-ball cricketers from Australia.","pubDate":"2022-05-15 13:58:26","image_url":null,"source_id":"opindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Rajasthan Royals: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-rajasthan-royals-live-score-over-match-63-t20-1-5-updates-2978342","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Rajasthan Royals from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.1 overs, Rajasthan Royals are 34/1. The live updates of Lucknow Super Giants vs Rajasthan Royals scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Lucknow Super Giants vs Rajasthan Royals, Lucknow Super Giants vs Rajasthan Royals live score, Lucknow Super Giants vs Rajasthan Royals scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (0 Run) Another swing and a miss! Slightly short and outside off. Sanju Samson throws his bat at it but doesn't make any connection. 4.5 overs (0 Run) Play and a miss! Back of a length, well outside off. Sanju Samson looks to cut hard but he fails to get any blade on it. 4.4 overs (1 Run) DROPPED! Hard hands from Mohsin Khan at short fine leg! This is a length ball, around leg. Yashasvi Jaiswal whips it behind square on the leg side. The ball goes to the right of Mohsin Khan at short fine leg, who drops a sitter. The batters sneak in a single. 4.3 overs (4 Runs) FOUR! Yashasvi Jaiswal tries to make room by stepping down the leg side but Avesh Khan follows him with a length delivery. He tries to cramp the batter for room but Yashasvi Jaiswal goes through with his lofted shot and places it behind the bowler to find the fence. 4.2 overs (0 Run) That is a peach of a delivery from Avesh Khan! Good-length ball, around off and shaping away late. Yashasvi Jaiswal looks to defend but the ball whizzes past the outside edge. Excellent bowling. 4.1 overs (0 Run) On a length, around off. Yashasvi Jaiswal hangs back and pushes it towards cover. 3.6 overs (4 Runs) FOUR! CRUNCHED! This is a length ball, outside off. Samson stands tall and bludgeons it through the extra cover region. The ball races away to the fence. 3.5 overs (0 Run) Mohsin changes his angle and comes 'round the wicket. He serves a length ball, around off, cramping the batter for room. Samson only manages to push it to the leg side. 3.4 overs (0 Run) Mohsin hits the deck hard, around off. Samson punches hard but Marcus Stoinis at cover dives and stops the ball. 3.3 overs (0 Run) Good-length delivery, around middle. Samson nudges it towards mid-wicket. 3.3 overs (1 Run) Wide! A short ball, down leg. Samson lets it be. Quinton de Kock behind the sticks dives to his left and does well to stop the ball. Wide called by the umpire. 3.2 overs (0 Run) A bit fuller this time, around middle, Sanju Samson tucks it to mid-wicket. 3.1 overs (4 Runs) EDGED AND FOUR! Back of a length, angling across the batter, from the off pole. Samson hangs back and looks to cut. Although, he only manages a thick outside edge that flies past Jason Holder at first slip for a boundary. Change of ends for Mohsin Khan. 2.6 overs (1 Run) Short of a length, outside off. Samson punches it towards deep cover and takes a run. He will retain the strike. End of a successful over for Lucknow! 2.5 overs (0 Run) A short ball, outside off. Samson sits back and lets it through to the keeper. 2.4 overs (0 Run) A length ball, angling away from outside off. Sanju Samson looks to drive on the up but the ball goes past the outside edge. 2.3 overs (4 Runs) FOUR! GLORIOUS! A full ball, around middle and leg. Samson flicks it through the mid-wicket region and bags a boundary. Who will bat at number 3 today for Rajasthan? It's Sanju Samson. 2.2 overs (0 Run) OUT! TIMBER! You miss, I hit, says Avesh Khan! This is a length ball, around off at 136.8 kph. Buttler shuffles across way too much in order to scoop it over short fine leg. He misses it completely and the ball cannons onto the off pole. Avesh is ecstatic as this is a huge wicket for Lucknow! Rajasthan lose their star batter of the season. 2.1 overs (0 Run) Avesh begins with a full ball, just outside off. Buttler gets forward and mistimes his drive towards mid off. Avesh Khan to bowl the third over, replacing Mohsin Khan at this end. 1.6 overs (1 Run) On a length, around the fifth stump channel. Buttler stands tall and pushes it wide of the mid off fielder. KL Rahul runs to his left and keeps it to just one. A tidy start from Chameera, just 3 runs off the over! 1.5 overs (0 Run) Slightly full this time, outside off. Buttler prods and defends it to the off side. 1.4 overs (0 Run) BEATEN! This is a length ball, jagging back in sharply, from outside off. Buttler looks to drive on the up but the ball sneaks through the gap between his bat and pad. This is excellent bowling from Dushmantha Chameera! 1.3 overs (1 Run) Back of a length, around off and cramping the batter for room. Yashasvi Jaiswal steers it behind square on the off side and rotates the strike. 1.2 overs (0 Run) On a length, around middle. Yashasvi Jaiswal hangs back to block but he gets a thick inside edge onto his pad. Good line and length from the Sri Lankan! The players from both sides are sporting a black armband in memory of Andrew Symonds. 1.1 overs (1 Run) Chameera starts with a length ball, outside off. Buttler looks to drive but the ball jags away late and takes the outside edge of his bat towards third man. Buttler gets off the mark with a run. Dushmantha Chameera to speed in from the other end. 0.6 over (4 Runs) FOUR! A wayward ball, angled on the pads. Yashasvi Jaiswal picks it up and smashes it through the square leg region for another boundary. 8 runs of the first over. 0.5 over (4 Runs) FOUR! Finds the gap this time and Rajasthan are up and running! Good-length ball, around the off pole. Yashasvi Jaiswal sits back and caresses it past the cover fielder for a boundary. Top shot! 0.4 over (0 Run) Make that four in a row! Slightly short and outside off. Yashasvi Jaiswal taps it towards cover-point and looks for a single but is sent back by his partner. 0.3 over (0 Run) Swing and a miss! A length ball, shaping away from outside off. Yashasvi Jaiswal looks to go downtown but he fails to make any connection. Three dots in a row. 0.2 over (0 Run) Another ball that is short of a length, just outside off. Yashasvi Jaiswal hangs back and mistimes his cut shot towards Deepak Hooda at backward point. 0.1 over (0 Run) Cut hard but straight to the fielder! Back of a length, outside off. Yashasvi Jaiswal sits back and cuts but finds the point fielder. Time to play the game! Lucknow are done with the customary huddle and now their players are spreading on the field. Jos Buttler and Yashasvi Jaiswal are the openers for Rajasthan. The former has lost a bit of steam of late but the latter has found some form in the last two games. The Pink team would hope that both click this evening and provide them with a strong start. Mohsin Khan to start proceedings with the new ball. The countdown is over, let's play... KL Rahul, the captain of Lucknow, says that they wanted to bowl first anyway. Adds that the wicket looks a good one to bat on. Tells that they need to turn up every game and need to give more than 100 per cent. Says that they did not bat well in their previous game and they want to correct those mistakes in this game against Rajasthan. Informs that they have made one change to their side - Ravi Bishnoi comes in for Karan Sharma. Sanju Samson, the captain of Rajasthan, says that they want to bat as that has been their strength. Informs that James Neesham and Obed McCoy come in for Rassie van der Dussen and Kuldeep Sen. Tells that they want to keep it very simple, and it's important to maintain a balanced state of mind. Smiles and says that they didn't talk about qualifications in the team meeting. Lucknow (Playing XI) - Quinton de Kock (WK), KL Rahul (C), Deepak Hooda, Krunal Pandya, Ayush Badoni, Marcus Stoinis, Jason Holder, Ravi Bishnoi (In for Karan Sharma), Mohsin Khan, Dushmantha Chameera, Avesh Khan. Rajasthan (Playing XI) - Yashasvi Jaiswal, Jos Buttler, Sanju Samson (C) (WK), Devdutt Padikkal, James Neesham (In for Rassie van der Dussen), Riyan Parag, Ravichandran Ashwin, Trent Boult, Prasidh Krishna, Yuzvendra Chahal, Obed McCoy (In for Kuldeep Sen). TOSS - Rajasthan have won the toss and they have elected to BAT first. Our morning started with the tragic news of Andrew Symonds passing away in a car accident. He was just 46. We were still mourning the demise of the great Shane Warne and yet another superstar of the game left us for his heavenly abode. Symonds was a true character of the game! He was a one of a kind all-rounder, who used to bat with great striking power, and had a bag of tricks when it came to bowling, seam-up, cross-seam, off-spinners and what not! Not many will disagree that he was one of the best fielders during his playing days and his athleticism was second to none. He had the physique of a rugby player, and we all remember how he shoulder-charged a streaker and floored him. Andrew Symonds lived his cricketing life on his terms and was controversy's favourite child but all said and done, he was an icon. We will miss him. Rest in peace, Roy. Update from Match 62 - Gujarat are cruising along nicely against Chennai at the Wankhede Stadium, as they require just 26 runs off 30 balls, with 7 wickets in hand. Rajasthan did start their season well but have been inconsistent in the business end of the tournament. They have managed to win just one of their last four games and badly need a win, if they are to smoothly qualify for the playoffs. Their premier batter, Jos Buttler has failed to fire in the second half of the league, and overall, they have been below-par with the bat, barring the Punjab game. They have some quality bowlers in their ranks and will be keen to put their best foot forward in this all-important clash. Who will come out on top in this mouth-watering fixture? We shall find that soon. Stick around for the toss and team news. Lucknow were on a 4-game winning streak until they met Gujarat in Pune. They were handed a comprehensive defeat at the hands of Gujarat and it were Lucknow's batters who failed to deliver as the KL Rahul-led side was bundled out for 82. Although, they are sitting at the top half of the points table and a win against Rajasthan would ensure that they book a spot in the playoffs and finish in the top two. The race for playoffs spot is heating up in the Indian T20 League and we have another cracker of a game coming our way, folks. It is Lucknow taking on Rajasthan in game number 63 at the Brabourne Stadium. On that note, a very warm welcome to our coverage. ... Match Day ...","pubDate":"2022-05-15 13:53:47","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637882394165049179.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"A free-spirited 90s cricketer, Andrew Symonds felt caged by cricket’s corporatisation - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMijQFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvYS1mcmVlLXNwaXJpdGVkLTkwcy1jcmlja2V0ZXItYW5kcmV3LXN5bW9uZHMtZmVsdC1jYWdlZC1ieS1jcmlja2V0cy1jb3Jwb3JhdGlzYXRpb24tNzkxODM2NS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"A free-spirited 90s cricketer, Andrew Symonds felt caged by cricket’s corporatisation  The Indian ExpressPolice reveal new details of crash that killed Andrew Symonds | 9 News Australia  9 News AustraliaAndrew Symonds dies in a car accident, aged 46 | Cricbuzz.com - Cricbuzz  CricbuzzCSK vs GT: Chennai and Gujarat players wear black armbands to honour Andrew Symonds  India TodayTwo Months Two Legends Gone, Tragic Coincidence  Mirchi9View Full coverage on Google News","content":null,"pubDate":"2022-05-15 13:48:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Eerie link that preceded Warne, Symonds deaths","link":"https://wwos.nine.com.au/cricket/andrew-symonds-death-shane-warne-the-hundred-london-spirit-darren-berry-tweet/ebd7b33a-7819-4cfd-8010-5bbab223a3d3","keywords":null,"creator":["wwos"],"video_url":null,"description":"Darren Berry was supposed to coach with Shane Warne and Andrew Symonds this year. Instead, tragedy struck.","content":"Darren Berry was supposed to coach with Shane Warne and Andrew Symonds in The Hundred this year. Instead, the former Australian first-class cricketer is grieving the deaths of his colleagues and great mates just two months apart. Symonds and Berry were appointed by Warne as assistants for the London Spirit's 100-ball campaign in 2022. But in what must seem like a split second, Berry has lost Warne and Symonds to a heart attack and a car accident respectively. IN PICTURES: The incredible career of Andrew Symonds READ MORE: Tubby 'can't quite believe' another cricket great is dead READ MORE: Why Aussies will remember Symonds for this moment Warne died on March 4 at the age of 52, and Symonds on Saturday at 46. Berry's first-class career saw him play with Warne, for Victoria, and against Symonds, who represented Queensland. The stardom of Ian Healy and Adam Gilchrist prevented Berry, an elite gloveman, from playing international cricket with Warne and Symonds. Several hours after the news of Symonds' death began filtering through on Sunday, Berry made his heartbreak clear in a Twitter post. \"Too much just far too much to bare,\" Berry wrote. \"Seriously WTF we had some fierce battles on the field but enormous respect of (sic) it. Numbness descends as SKW had arranged both Roy & I to be his trusted assistants at the London Unique man with a kind heart taken far too soon - RIP Roy.\" Symonds played 26 Tests, 198 one-dayers and 14 T20s for Australia between 1998 and 2009. The entertaining all-rounder was a member of Australia's triumphant 2003 and 2007 ODI World Cup sides. He plundered 143 runs from 125 balls to lead Australia to victory over Pakistan in the group stage of the 2003 World Cup. The most iconic innings of his Test career was a knock of 156 not out in the 2006 Boxing Day Test. He blasted England's Paul Collingwood for six straight back over his head to reach his maiden Test century and jumped into the arms of great mate Matthew Hayden . Cricket fans fell in love with Symonds' zinced-up lips, dreadlocks, exceptional fielding, enormous hitting power and laidback attitude. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","pubDate":"2022-05-15 13:46:01","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/05/429422/150522symondsdeath.png","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"From Srikant to Rajawat, meet the stars of Thomas Cup triumph","link":"https://www.indiatvnews.com/sports/other/from-srikant-to-rajawat-meet-the-stars-of-thomas-cup-triumph-where-india-beat-indonesia-to-lift-the-thomas-cup-titile-after-73-years-2022-05-15-776775","keywords":null,"creator":null,"video_url":null,"description":"In a win that was 73 years in the making, India beat Indonesia to lift the Thomas Cup title for the first time. If we compare it to cricket, this is even bigger than the 1983 World Cup triumph.","content":"In a win that was 73 years in the making, India beat Indonesia to lift the Thomas Cup title for the first time. If we compare it to cricket, this is even bigger than the 1983 World Cup triumph. After all, it was 43 years back that India reached and lost in the semi-finals of the competition. Fast forward to 2022, the dream has been fulfilled, champions have been made, and careers have been immortalised. These are the players that led India to eternal glory. Battling an ankle injury, and praying that it doesn't get worse, somehow, someway, Prannoy made it through the deciders to take India to the final of the Thomas Cup. The 29-year-old hails from Thiruvananthapuram and won a Silver Medal in the 2010 Summer Youth Olympics. The man who started it all and gave India a lead in the Final vs Indonesia, Sen has been one of the most sought-after players in a recent while. Who can forget the epic duel between Sen and Axelsen at the All England Open 2022? Although Sen failed to win the final, everybody watching from home and in the stands knew that the boy was special. Srikant delivered the ultimate win when he defeated Jonathan Christie at the Thomas Cup. He is one of the top players in the World, and created history last year when he clinched Silver at the World Badminton Championship. Incidentally, that was the best performance by an Indian at the competition. Rajawat is currently ranked 85 in the world and defeated Victor LAI in the Thomas Cup. Last year, Priyanshu won the men's singles title at the Ukraine International in Kharkiv. Although he lost to Julien I in the Orleans Masters 2022, he impressed everyone with his sharp skills. The 24-years-old Chirag, along with 21-years-old Satwiksairaj Rankireddy defeated Mohammad Ahsan and Kevin Sanjaya Sukamuljo in one match, and then Kim Astrup and Mathias in the other on their way to the title. They both are ranked 8th in men's double.","pubDate":"2022-05-15 13:25:43","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"FAL-W vs TOR-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Fairbreak Invitational Women’s T20 2022, Final","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/fal-w-vs-tor-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-fairbreak-invitational-women-s-t20-2022-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":"Falcons (FAL-W) will take on Tornadoes (TOR-W) in the final of the Fairbreak Invitational Women’s T20 2022 at the Dubai International Cricket Stadium in Dubai on Sunday. Having played five matches this season, Falcons bagged three wins to end in third place in the points table. They will be up against Tornadoes who won two of their five games to finish fourth in the standings. Nannapat Koncharoenkai (wk), Theertha Satish, Chamari Atapattu, Suzie Bates (c), Danielle Wyatt, Christina Gough, Gunjan Shukla, Sornnarin Tippoch, Anju Gurung, Jahanara Alam, Marina Lamplough. Katey Martin (wk), Aliya Riaz, Sterre Kalis, Natasha Miles, Staphanie Taylor, Sophie Devine (c), Sune Luus, Winifred Duraisingam, Diana Baig, Chanida Sutthiruang, Sita Rana Magar. Match: FAL-W vs TOR-W, Fairbreak Invitational Women’s T20 2022, Final. Date and Time: May 15, 2022; 9:00 PM IST. Venue: Dubai International Cricket Stadium, Dubai. This ground is expected to be a pretty nice batting surface, and pacers could prove to be key. Spinners could take control of the game in the middle overs. Katey Martin is capable of taking the game to opposition bowlers. She failed to make a mark in her previous game and will look for a big knock here. Chamari Atapattu has been in good form and has been a key player for Falcons. She has collected 264 runs at an average of 73.66 and a strike rate of 149.32. Not only is she the only batter to score a century in the competition, but she has also scalped four wickets. The Sri Lankan is the best captaincy choice in your FAL-W vs TOR-W Dream11 fantasy team. Danni Wyatt, meanwhile, has also been in good form with the bat for Falcons. She has slammed 205 runs so far at an average of 51.25 and a strike rate of 147.48. Sune Luus is a wonderful all-rounder who will back herself to secure a win for her team. She has amassed 145 runs in six innings and has also taken two wickets at an economy rate of 6.47. Sophie Devine, meanwhile, needs little introduction. She has scored 162 runs at a strike rate of over 143. Devine can also contribute handily with the ball. Diana Baig has been bowling well and will lead the charge for Tornadoes. She has picked up five scalps at an economy rate of 7.14. Chamari Atapattu (FAL-W) – 560 points Sune Luus (TOR-W) – 316 points Danni Wyatt (FAL-W) – 291 points Sophie Devine (TOR-W) – 283 points Sterre Kallis (TOR-W) – 256 points. Chamari Atapattu: 264 runs and 4 wickets Sune Luus: 145 runs and 2 wickets Danni Wyatt: 205 runs Sophie Devine: 162 runs. Fantasy Suggestion #1: Katey Martin, Chamari Atapattu, Danni Wyatt, Sterre Kallis, Suzie Bates, Sune Luus, Sophie Devine, Diana Baig, Sita Rana Magar, Anju Gurung, Chanida Sutthiruang. Captain: Chamari Atapattu. Vice-Captain: Danni Wyatt. Fantasy Suggestion #2: Katey Martin, Chamari Atapattu, Danni Wyatt, Suzie Bates, Sune Luus, Sophie Devine, Stephanie Taylor, Diana Baig, Sita Rana Magar, Anju Gurung, Chanida Sutthiruang. Captain: Suzie Bates. Vice-Captain: Sune Luus.","pubDate":"2022-05-15 13:10:03","image_url":"https://static.sportskeeda.com/editor/2022/05/edc8a-16526182511048-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, CSK vs GT Live Score: Wriddhiman Saha Key For Gujarat Titans As CSK Snag Matthew Wade - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWNzay12cy1ndC1saXZlLXNjb3JlLXVwZGF0ZXMtY2hlbm5haS1zdXBlci1raW5ncy12cy1ndWphcmF0LXRpdGFucy1saXZlLXNjb3JlLTI5Nzc0NzfSAYUBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvaXBsLTIwMjItY3NrLXZzLWd0LWxpdmUtc2NvcmUtdXBkYXRlcy1jaGVubmFpLXN1cGVyLWtpbmdzLXZzLWd1amFyYXQtdGl0YW5zLWxpdmUtc2NvcmUtMjk3NzQ3Ny9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, CSK vs GT Live Score: Wriddhiman Saha Key For Gujarat Titans As CSK Snag Matthew Wade  NDTV SportsCSK vs GT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket Addictor#CSKvGT | Cricbuzz Live: Match 62, Chennai v Gujarat, Mid-innings show  CricbuzzIPL 2022: Match 62, CSK vs GT Match Prediction – Who will win today’s IPL match between Chennai and Gujarat?  CricTrackerCSK vs GT Dream11 Prediction Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-05-15 13:02:22","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, CSK vs GT Live Score Updates: Saha – Shubman start the run chase for Gujarat - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiU2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWNzay12cy1ndC1saXZlLXNjb3JlLTc5MTgyNTcv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, CSK vs GT Live Score Updates: Saha – Shubman start the run chase for Gujarat  The Indian ExpressCSK vs GT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket Addictor#CSKvGT | Cricbuzz Comm Box: Match 62, Chennai v Gujarat, 1st innings  CricbuzzIPL 2022: Match 62, CSK vs GT Match Prediction – Who will win today’s IPL match between Chennai and Gujarat?  CricTrackerCSK vs GT Dream11 Prediction Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-05-15 12:11:16","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India's Thomas Cup Gold Like \"Winning Cricket World Cup\": Former Player","link":"https://sports.ndtv.com/badminton/indias-thomas-cup-victory-is-like-winning-the-world-cup-in-cricket-says-dinesh-khanna-only-indian-to-win-asian-badminton-championships-2978126","keywords":null,"creator":null,"video_url":null,"description":"Dinesh Khanna, the only Indian till date to win the Asian Badminton Championships (1965), likened India's Thomas Cup triumph to a World Cup win in cricket","content":"The Indian men's badminton team entered a super-elite club on Sunday as it became only the sixth in the world to win the prestigious tournament, often considered the world team championships of the sport. India defeated 14-time winners Indonesia 3-0 in the final in Bangkok on Sunday to win their first gold medal in the tournament's history. They had defeated 2016 winners Denmark in the semi-finals. In the title clash, World Championships medallists Lakshya Sen and Kidambi Srikanth won their respective singles ties while the doubles team of Chirag Shetty and Satwiksairaj Rankireddy also won their match. Dinesh Khanna, the only Indian till date to win the Asian Badminton Championships (1965), likened the win to a World Cup win in cricket. Khanna, who also won bronze medal in the 1966 Commonwealth Games in Jamaica apart from a bronze medal in 1969 Asian Championships in 1969, played in five Thomas Cup editions for India and led the country in the final rounds of Thomas Cup in 1972 before retiring in 1976. \"Thomas Cup is the biggest team title, it is the world team championship for men, so obviously winning the world team title at a particular game, in a particular sport is the biggest title. It is like winning World Cup in cricket, something similar to that. Because we do not have team championships in Olympics, so outside the Olympics, it is the biggest title which we have managed to win. Earlier our performance, we reached the semi-finals 43 years ago, so it is a huge achievement for the game and the sport. I would say that overall it shows our our dominance and improvement in the game. Doubles has historically been a weak link for us, but doubles was a very criticial point that we scored today,\" Khanna, who became the first Indian to win the Asian Badminton Championships in 1965, told NDTV. The 79-year-old Khanna added that the 3-0 margin of victory in the final against Indonesia showed the temperament of the team. Promoted \"Yes, very huge win but if you see the margin in a sense that, in doubles it was a very close call. It could have gone the either way. It was a convincing victory as far as Kidambi was concerned, but in the other matches we had to really fight it out. Lakshya Sen also kept his cool, he lost his first game but after that, he bounced back really strongly. He showed great nerve and commitment. I must say all our players, singles and doubles, they kept their cool and gave us a thumping victory against 14-time champions Indonesia. So far, only five countries have won the Thomas Cup, India is now the sixth country to win the title,\" he said. \"I think it is absolutely heartening. As we saw in the World Championships that were held last year, we had Srikanth in the finals. He was a silver medallist, we had bronze medallist Lakshya Sen and we had a quarter-finalist in HS Prannoy. You can see that we have a very strong singles trio and ofcourse, there are few players that are in the wings. We have excellent depth in terms of singles. Satwiksairaj and Chirag Shetty have been doing exceedingly well, they have been losing matches in Super Series matches, but in the Thomas Cup they won some very crucial matches for the team.\"","pubDate":"2022-05-15 12:09:27","image_url":"https://c.ndtvimg.com/2022-05/r0ub5gg_india-thomas-cup-afp_625x300_15_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}