{"newsArray":[{"title":"Warne family make funeral decision","link":"https://www.news.com.au/sport/cricket/shane-warnes-family-to-have-private-service-before-state-funeral/news-story/875aead3dfba9ed5381f2d15005410e7","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne’s family will reportedly have a private funeral before the cricket icon is honoured with a public memorial service.","content":null,"pubDate":"2022-03-08 02:37:00","full_description":"Shane Warne’s family will reportedly have a private funeral before the cricket icon is honoured with a public memorial service. Warne’s family accepted an offer of a state funeral , Victorian Premier Daniel Andrews tweeted on Sunday. The event will give fans a chance to pay tribute to the former Australian leg-spinner, who died suddenly in a Thai villa last week. Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > “I’ve spoken with the Warne family again today and they have accepted my offer of a State Funeral to remember Shane,” Mr Andrews wrote. “It will be an opportunity for Victorians to pay tribute to his contribution to his sport, to our state and the country. “Details will be finalised in coming days.” The Warne family on Sunday released personal statements to express their grief and to honour the cricketer’s memory. 23-year-old son Jackson and his sisters Summer and Brooke have been left heartbroken by the sudden tragedy. Warne’s ex-wife Simone Callahan, his brother Jason and his parents Keith and Bridget also released moving tributes to the 52-year-old. The Herald Sun reports that plans are being drawn up for the public memorial at the MCG, where Warne claimed an Ashes hat-trick and his 700th Test wicket. The News Corp report confirmed that Warne’s family will have their own private ceremony before the state service, which is expected to be within two or three weeks. Up to 100,000 people are expected to attend the public memorial. What date is the funeral? The family is flying Warne’s body back to Australia from Thailand and the funeral is expected to take place this week. How to watch? The event is expected to be broadcast live on free-to-air networks as special news bulletins. Where will the funeral be held? The Warne family has not made its plans public about how the funeral will be conducted. There is expected to be an announcement in the days following the private service that a public memorial will be held at the MCG. Who will speak at the funeral? According to The Ag e, Eddie McGuire has been mentioned as a potential master of ceremonies for the public memorial. Melbourne is turning the MCG into a Shane Warne playground A VB beer can, a packet of cigarettes, a meat pie and many flowers were left in front of the Shane Warne statue at the MCG to honour the King of Spin. Victorian Premier Andrews also revealed the Great Southern Stand would be renamed after Warne. “I’ve just informed the Warne family that the government will rename the Great Southern Stand at the MCG — the place he took his hat trick and 700th wicket — to honour Shane and his contribution to the game,” Mr Andrews posted on social media. “The S.K. Warne Stand will be a permanent tribute to an amazing Victorian.” A Thai masseuse says she visited Shane Warne’s hotel room for a scheduled foot massage just before he was found unresponsive, but he didn’t answer. Ricky Ponting has opened up on how raw the loss of Shane Warne still is and the tragic thing he wishes he could tell his great mate. An Indian cricket icon has issued an apology following a backlash towards a “shameful” comment made about Shane Warne.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Warne family make funeral decision","link":"https://www.cairnspost.com.au/sport/cricket/shane-warnes-family-to-have-private-service-before-state-funeral/news-story/875aead3dfba9ed5381f2d15005410e7","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Shane Warne’s family will reportedly have a private funeral before the cricket icon is honoured with a public memorial service.","content":null,"pubDate":"2022-03-08 02:37:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne’s family release statement","link":"https://www.news.com.au/sport/cricket/shane-warnes-family-release-statement/video/6fc27898ae3aaadedbe23029bdf3694b","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Following the shock passing of Australian legend Shane Warne, his family has released a statement expressing their loss.","content":null,"pubDate":"2022-03-08 02:36:20","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne’s family release statement","link":"https://www.cairnspost.com.au/sport/cricket/shane-warnes-family-release-statement/video/6fc27898ae3aaadedbe23029bdf3694b","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Following the shock passing of Australian legend Shane Warne, his family has released a statement expressing their loss.","content":null,"pubDate":"2022-03-08 02:36:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"People do take women with a pinch of salt: Shantha Rangaswamy","link":"https://timesofindia.indiatimes.com/sports/cricket/news/people-do-take-women-with-a-pinch-of-salt-shantha-rangaswamy/articleshow/90065934.cms","keywords":null,"creator":null,"video_url":null,"description":"Shantha Rangaswamy is a pioneer in more ways than one. She is the first captain of the Indian women's Test team, the first Indian woman to score an international century, the first woman captain to win a Test, the first woman recipient of the Arjuna Award and even the first Indian woman to hit a six in international cricket. She is also not one to mince words, as we found out during a freewheeling interaction after she agreed to be TOI's Guest Editor for the day.","content":null,"pubDate":"2022-03-08 02:34:25","full_description":"TOI's Sports Guest Editor Shantha Rangaswamy , former India cricket captain & BCCI Apex Council member, says women are still not accorded equal status except at home... Shantha Rangaswamy is a pioneer in more ways than one. She is the first captain of the Indian women's Test team, the first Indian woman to score an international century, the first woman captain to win a Test, the first woman recipient of the Arjuna Award and even the first Indian woman to hit a six in international cricket. She is also not one to mince words, as we found out during a freewheeling interaction after she agreed to be TOI's Guest Editor for the day. Excerpts... How pleasing was the Indian women's team's win over Pakistan the other day? The win was on expected lines. But then any game against Pakistan, in any sport, can be very tense. I'm glad they held their nerve and carved out a very impressive win, thanks mainly to the partnership between Sneh Rana and Pooja Vastrakar . We mustn't ignore the efforts of the bowlers, Rajeshwari Gayakwad and Rana. Jhulan, of course, we expect to do well. There were many pluses. There could not have been a better start. You are looked at as the 'founding mother' of Indian women's cricket... Yes, but I never earned a single penny throughout my playing days, in a playing career spanning 22 years. But money isn't everything. The passion for the game was what was driving us. The first two-wheeler that I owned was thanks to a prize I got in the Pune Test against New Zealand, when I got a century in 1976. I did not even own a bicycle before that. There have been other struggles... We used to travel unreserved in trains. The national championships were played over a knockout format in those days. If someone lost, they had to leave, so booking tickets in advance was out of the question. We used to be seated near the toilets and some anti-social elements used to try and crash their way in. We dealt with them by pulling the chain and throwing them out. We stayed in dormitories and school rooms. We roughed it out, but it was fun, because for us playing was more important. Everything, my first century, me being the first captain to win a Test, everything gets relegated to the background when I think of the fact that we laid the foundation for the current lot of cricketers. You mention the hundred in Pune vs New Zealand. But it wasn't recognized... We only learnt later that the New Zealand team that played in 1976 in India was not the official team. The team that played here and the team that we faced in Dunedin a bit later had just two different players, but the games here were not official while the games there were. My 527 runs in the series went down the drain. Diana Edulji also took a lot of wickets. BCCI and ICC must look into it and give that benefit to us because those were hard-earned runs and wickets. When did the upward curve start for women's cricket in India? From 1991 onwards. From 1991 to 2002, Anuradha Dutt ran the show and after Shubhangi Kulkarni took over, the game went up a few notches. Most of you may not be aware that in 2005, when we participated in the World Cup con- ducted by the ICC, we did so under the umbrella of Women's Cricket Association of India (WCAI). We were runners-up then. Almost 12 years, later, we were runners-up again, under the wing of the BCCI this time. People like MK Sharma and Chandra Tripathi did a lot for women's cricket in the initial stages. It was because of the efforts of Shubhangi that the then-BCCI president Sharad Pawar took women's cricket under the board's wing. That really helped, as the infrastructure, funding and stuff started to get taken care of. And many girls started taking to the game. I still feel the pinnacle of women's cricket in India was not the Test match that we won but the 2017 runners-up finish in England, as that created awareness. The number of women cricketers increased three folds after that tournament. The electronic media also played its part. How far away are we from the women's IPL? You are in the BCCI too... I got into the BCCI at a very wrong time, because along with me came Covid. In the last two years, everyone's hand was tied and at one stage it seemed the board would go out of pocket too, but then, the IPL, the 'Kamdhenu' of Indian cricket took place and things settled down. They have issued a statement saying it will be held from next year. If it starts, things will be fine. Don't worry about the standards. They won't be any less than the WBBL or the Hundred. As the game gets popular, there will be more attention. Are the players ready for intense scrutiny? Let there be scrutiny. If it helps the game to evolve and there is no adverse publicity, things will be okay. If scrutiny enhances the value of the player and the game, it should be welcome. Do you think women cricketers deserve to get paid on par with the men? When we pose this question, there is a counter-question. Do the women bring in as much money to the coffers of the BCCI as much as the men do? Right now, no. But efforts are there. During last year's IPL, which was in Dubai, the Women's Challenge matches made a profit. It's a good beginning. Sooner than later, if not equal pay, at least the gap will be bridged. From Rs 7 crore (top contract for a men's player) to Rs 50 lakh (top contract for a woman cricketer) it looks too big a gap. But slowly, it will start narrowing within the next 10 years. How do you feel about women administrators in cricket? I don't see that happening soon. They need to get into state associations first. I don't see many women there. Just before I got elected to the BCCI apex council, I contested the KSCA polls and got elected to the managing council. I resigned later to meet the requirement of the conflict-of-interest clause. I saw TNCA had a lady president, but she has quit. So, it's not easy, despite India having a woman Prime Minister way back in 1966. Women do not get as many opportunities as their male counterparts, worldwide. People do take women with a pinch of salt. They are not accorded equal status except at home where they are bosses. It will take time, but I am positive that it will happen in the next 20-25 years. So you expect to see a woman as president of BCCI in future? Undoubtedly. But nothing can happen overnight, unless there is more acceptance of women's position in society. History has many women as heads of states like Indira Gandhi , Sirimavo Bandaranaike , Margaret Thatcher . I feel once many more women get into this, we will see them more in higher positions. Is the BCCI doing enough to spread and popularize the women's game? I remember how competitive the inter-state boy's school cricket used to be and many went on to represent their states and country from there. It's true such a structure doesn't exist in the women's game. But the BCCI alone cannot look into everything. The state units should also take the responsibility. I would only request BCCI to start inter-state school cricket for girls as that is the place to identify raw talent. Shantha Rangaswamy. (TOI Photo) Do you see a healthy supply line to the women's game today? It's much better than what it was 20-25 years back. We need an organized cricket structure for women to encourage them to take up the sport. The visuals of Indian players interacting with Pakistan skipper Bismah Maroof and her six month-old daughter have gone viral. That must have been very heartening to see... A lot of hue and cry is made about the bitterness between India and Pakistan, but it is actually the respective governments that have issues. We could see warmth in the relationship between the players even in the men's T20 World Cup, when the players from both sides took pictures with each other. There is bonhomie between the two teams which only got amplified after the images from the women's game went around the other day. Women's Test matches were not telecast live till 1984... In 1984, we were playing the fourth Test in New Delhi, where we met Mrs Indira Gandhi. We told her that despite having a lady PM, our matches were not telecast live. She just said, \"It must be a matter of just equipment\" and turned to one staff member, saying, \" Suniye (listen). . . \". The next match in Bombay was shown live on TV! It was the first time that a women's Test was telecast live in India. We have a come a long way since then. Can this team do one better than what it did in England in 2017? One good thing that the BCCI did was send this team to New Zealand early, almost a month before, to play the ODI series. Though they lost 1-4, they won the last game and won the warm-up games against West Indies and South Africa before beating Pakistan. The curve is going up. No person in his or her right senses would write this bunch off. If they win, it will do women's cricket in this country a lot of good and make the Indian cricket board stage more tournaments for women.","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Kent Street Senior High School says women’s cricket growth driving state-first girls’ specialist program","link":"https://thewest.com.au/sport/kent-street-senior-high-school-says-womens-cricket-growth-driving-state-first-girls-specialist-program-c-5791940","keywords":null,"creator":["Ben Smith"],"video_url":null,"description":"One of WA’s foremost cricket schools say a surge of interest in the women’s side of the game has helped propel their specialised girls’ program.","content":null,"pubDate":"2022-03-08 02:27:05","full_description":"One of WA’s foremost cricket schools say a surge of interest in the women’s side of the game has helped propel its groundbreaking specialised girls’ program. Kent Street Senior High School is into year two of it girls-only pathway, which runs concurrently with the boys’ program. The school are one of just three in the state to offer a WA Cricket-approved specialist cricket programs, alongside John Forrest Secondary College and Belridge Secondary College. However, the Kensington-based high school is the only one in WA — and it believes the country — to offer its own separate pathway for the next generation of female cricketers. The public school has produced several high-level cricketers, including three Test players in Marcus Harris, Marcus North and Luke Ronchi, as well as current Western Fury players Piepa Cleary and Zoe Britcliffe. Previously, local girls aspiring to emulate Elyse Perry and Alyssa Healy had to join in with the boys’ program at Kent Street, but cricket co-ordinator David Aldridge said they now had the numbers for a girls’ class. “The popularity of the sport (is) just going through the roof, and we noticed Piepa Cleary and her success started to get more girls involved in the game and more girls start to apply for our program,” he said. “The numbers got to a point where we were like, ‘let’s try and get a girls-only group off the ground.’ “We went from having one in the program across six years, to now 33 through the whole program. Next year, that number will jump again.” Aldridge said it was important from a developmental perspective to ensure girls had an environment in which they felt comfortable to work on their skills. “Traditionally, they’d have to go through all the time with the boys and even the talented ones, they stopped batting in Year 10 because the boys get a bit fast. “If we can produce the first female to play for Australia out of Kent Street, that will be amazing.” Like the boys’ program, selected students study the game as if it were another subject, which also frees them to play and train for their club sides outside of school, although Aldridge said schoolwork takes priority and teachers would have to sign off students to allow them to train and play. When she progressed through the ranks at Kent Street, Britcliffe was the only girl in the entire program and while she said playing against the boys helped her improve as a cricketer, the girls-only program was an important step forward “I’ve been back to the school a few times to meet a couple of the girls classes and talk to them and say how lucky they are,” she said. “As fun as it was being in the boys’ team, being around girls all the time, you’re going to learn a lot more about teammates because you’re more likely to play with them outside of school. “It wasn’t until I was out of school and playing Premier Cricket all the time that I got into the girls game a bit more. “So you’ve got that easier transition, but you’ve also got people who understand you a little better and then you can take each other to the next level and be a bit more serious.” Britcliffe said it was vital for budding female cricketers to feel comfortable in their developmental environment. “I know girls out there who don’t play because they can’t play with other girls,” she said. “There were no other girls in my class and the last to graduate any cricket program before me would have been Piepa (Cleary), who was four or five years before me.”","image_url":"https://images.thewest.com.au/publication/C-5791940/43c32d287704aaef9775cd91e7efd803f4cbd0ed-16x9-x0y306w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Untold story behind Warne's breakthrough Test","link":"https://wwos.nine.com.au/cricket/shane-warne-dead-greg-matthews-exclusive-colombo-1992/019bc8df-d75a-43fa-ad8a-72779968025f","keywords":null,"creator":["wwos"],"video_url":null,"description":"EXCLUSIVE: Greg Matthews took Shane Warne under his wing early in his Test career and one suggestion had a big impact.","content":"It was the moment where Shane Warne finally felt he belonged on the international stage, the first of many times where his bowling was pivotal to an Australian Test victory.The Sinhalese Sports Club Ground in Colombo is about as far removed from the MCG as you can possibly imagine, but in August 1992 it was the scene of Warne's breakthrough performance as an Australian cricketer.It was Warne's third Test, and it's fair to say his career up to that point had been less than flattering. Having taken 1-150 on debut in Sydney against India, he followed that up with 0-18 and 0-60 in Adelaide.READ MORE: What Ricky Ponting wishes he told Shane WarneREAD MORE: Judo federation removes titles from Vladimir PutinREAD MORE: Bill Lawry remembers Shane Warne, pays tribute to Rod MarshThe first innings in Colombo had been similarly disappointing, 0-107, leaving the 23-year-old with the miserable Test figures of one wicket for 335.As he wrote in his book, My Spin, he was \"totally disheartened\" thinking that \"maybe cricket isn't my go.\"Sri Lanka held the upper hand on the fourth night, with Australia 7-393 in the second innings, a paltry lead of 102.Greg Matthews was still at the crease, unbeaten on 51, but the all-rounder knew his most important contribution would come the following day with the ball, along with the rookie leg-spinner.\"I remember it vividly,\" Matthews told Wide World of Sports.\"I suggested to Shane that we go out for a meal, I remember telling him that we could win the match the next day.\"He had a ham and pineapple pizza at the Hilton Hotel, then we kicked on to a discothèque and had a dance, he was drinking Midori and Lemonade, and we had a pretty good night together.\"He just needed to relax and unwind and take his mind off what was going to happen the following day.\"It's actually how I gave him his nickname, Suicide. We were dancing to the INXS song Suicide Blonde, and he had the peroxide blonde hair. I just thought that was appropriate. I'll remember that moment for a long time.\"The Australian tail wagged on the fifth morning, including a vital 35 from Warne, leaving Sri Lanka with 181 to win, a target that seemed a formality at 0-76.But the Australian bowlers, led by Matthews, chipped away at the Sri Lankan batting order, when captain Allan Border threw the ball to Warne, who had bowled one over earlier in the innings, which cost 11 runs.\"I recall thinking, 'Geez, that's a gutsy move,\" wrote wicketkeeper Ian Healy in his autobiography.Warne himself was panicked.\"Oh, no, no, no, no, you can't be serious,\" was his reaction, according to No Spin.\"This could be done and dusted in a couple of overs, AB. You can't do this to me, not now, not with so much at stake.\"I could cost us the match.\"Matthews, however, had full confidence in Warne, who proceeded to take the last three wickets without conceding a run, as Australia pulled off a famous victory by 16 runs.\"I just kept saying to AB, 'You've got to bowl the kid. You've got to bowl him when there's a few runs on the board to take the pressure off',\" Matthews said.\"Asanka Gurusinha was still at the crease, he was batting well, but I don't think it's unfair or inaccurate to say their tail wasn't the strongest in world cricket.\"Warney came on, threw the ball up, lots of encouragement from everyone, and got the job done.\"Matthews, who was named man of the match, took the final catch off Warne's bowling.\"I've still got the ball actually. The beginning of a legend,\" he said.Part of the reason Matthews believed in Warne came from a Sheffield Shield match at the SCG in November 1991, two months before the leg-spinner made his Test debut.A full strength New South Wales side played Victoria, with no fewer than 15 current or future Test players in action.\"I got a few in that match,\" Matthews recalled, somewhat modestly, given he top scored for NSW with 139.\"I did the press conference afterwards, where I was asked what I thought of this guy called Shane Warne, who'd taken 0-76, and I said, 'I reckon he'll get 300 Test wickets'.\"The media asked me why I said that, and I remember talking about Bob Holland, who took two 10-fors in Test cricket, and a five-for at Lord's, which Shane never did, and Dutchy was a really high quality bowler, but he didn't have the zip and the flipper that Shane had.\"We all love a good leggie. But I was wrong, I was short by 408 wickets!\"Warne's death came on the same day that Australian cricket lost wicket-keeper Rod Marsh, continuing a horror period for the game.\"I got a phone call at 1am from a mate in London, and I thought it was fake news, it couldn't be real,\" Matthews explained.\"We're all just in shock. We all feel for his family, gosh, it's brutal. Everyone has taken it so hard, it's the shock.\"On top of losing Rod Marsh, Alan Davidson, Ashley Mallett, and on a personal level my mum, it's been a tough few months.\"Just when you feel like you're getting up again, you get knocked down.\"Another former Australian captain, Mark Taylor, said that day in Colombo was a turning point not only for Warne, but skipper Allan Border.\"Yes it lifted Warnie's confidence greatly, but I think it also changed Allan Border, and the way he captained,\" Taylor told Wide World of Sports.\"Allan could see the potential in Warnie, but as a spinner you don't have that intimidation factor.\"Greg bowled a lot more overs than Warnie on that day, but I think AB finally thought that he had to see if Warnie had it or not.\"And he did. He got the final three wickets, and I think that gave both Warnie and AB a lot of confidence going forward.\"According to Warne, Border called it 'The greatest heist since the Great Train Robbery' as Sri Lanka capitulated, losing 8-37 at the end.\"If it had been on TV in Australia it would be remembered as one of the great Test matches,\" Warne wrote.\"I contributed to the win and sensed the relief. It's hard to explain exactly how good it was to feel I belonged; or if not quite belonged, that I didn't let anyone down.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-08 02:03:18","full_description":"It was the moment where Shane Warne finally felt he belonged on the international stage, the first of many times where his bowling was pivotal to an Australian Test victory. The Sinhalese Sports Club Ground in Colombo is about as far removed from the MCG as you can possibly imagine, but in August 1992 it was the scene of Warne's breakthrough performance as an Australian cricketer. It was Warne's third Test, and it's fair to say his career up to that point had been less than flattering. Having taken 1-150 on debut in Sydney against India, he followed that up with 0-18 and 0-60 in Adelaide. READ MORE: What Ricky Ponting wishes he told Shane Warne READ MORE: Judo federation removes titles from Vladimir Putin READ MORE: Bill Lawry remembers Shane Warne, pays tribute to Rod Marsh The first innings in Colombo had been similarly disappointing, 0-107, leaving the 23-year-old with the miserable Test figures of one wicket for 335. As he wrote in his book, My Spin , he was \"totally disheartened\" thinking that \"maybe cricket isn't my go.\" Sri Lanka held the upper hand on the fourth night, with Australia 7-393 in the second innings, a paltry lead of 102. Greg Matthews was still at the crease, unbeaten on 51, but the all-rounder knew his most important contribution would come the following day with the ball, along with the rookie leg-spinner. \"I remember it vividly,\" Matthews told Wide World of Sports. \"I suggested to Shane that we go out for a meal, I remember telling him that we could win the match the next day. \"He had a ham and pineapple pizza at the Hilton Hotel, then we kicked on to a discothèque and had a dance, he was drinking Midori and Lemonade, and we had a pretty good night together. \"He just needed to relax and unwind and take his mind off what was going to happen the following day. \"It's actually how I gave him his nickname, Suicide. We were dancing to the INXS song Suicide Blonde, and he had the peroxide blonde hair. I just thought that was appropriate. I'll remember that moment for a long time.\" The Australian tail wagged on the fifth morning, including a vital 35 from Warne, leaving Sri Lanka with 181 to win, a target that seemed a formality at 0-76. But the Australian bowlers, led by Matthews, chipped away at the Sri Lankan batting order, when captain Allan Border threw the ball to Warne, who had bowled one over earlier in the innings, which cost 11 runs. \"I recall thinking, 'Geez, that's a gutsy move,\" wrote wicketkeeper Ian Healy in his autobiography. Warne himself was panicked. \"Oh, no, no, no, no, you can't be serious,\" was his reaction, according to No Spin . \"This could be done and dusted in a couple of overs, AB. You can't do this to me, not now, not with so much at stake. \"I could cost us the match.\" Matthews, however, had full confidence in Warne, who proceeded to take the last three wickets without conceding a run, as Australia pulled off a famous victory by 16 runs. \"I just kept saying to AB, 'You've got to bowl the kid. You've got to bowl him when there's a few runs on the board to take the pressure off',\" Matthews said. \"Asanka Gurusinha was still at the crease, he was batting well, but I don't think it's unfair or inaccurate to say their tail wasn't the strongest in world cricket. \"Warney came on, threw the ball up, lots of encouragement from everyone, and got the job done.\" Matthews, who was named man of the match, took the final catch off Warne's bowling. \"I've still got the ball actually. The beginning of a legend,\" he said. Part of the reason Matthews believed in Warne came from a Sheffield Shield match at the SCG in November 1991, two months before the leg-spinner made his Test debut. A full strength New South Wales side played Victoria, with no fewer than 15 current or future Test players in action. \"I got a few in that match,\" Matthews recalled, somewhat modestly, given he top scored for NSW with 139. \"I did the press conference afterwards, where I was asked what I thought of this guy called Shane Warne, who'd taken 0-76, and I said, 'I reckon he'll get 300 Test wickets'. \"The media asked me why I said that, and I remember talking about Bob Holland , who took two 10-fors in Test cricket, and a five-for at Lord's, which Shane never did, and Dutchy was a really high quality bowler, but he didn't have the zip and the flipper that Shane had. \"We all love a good leggie. But I was wrong, I was short by 408 wickets!\" Warne's death came on the same day that Australian cricket lost wicket-keeper Rod Marsh, continuing a horror period for the game. \"I got a phone call at 1am from a mate in London, and I thought it was fake news, it couldn't be real,\" Matthews explained. \"We're all just in shock. We all feel for his family, gosh, it's brutal. Everyone has taken it so hard, it's the shock. \"On top of losing Rod Marsh , Alan Davidson , Ashley Mallett , and on a personal level my mum, it's been a tough few months. \"Just when you feel like you're getting up again, you get knocked down.\" Another former Australian captain, Mark Taylor, said that day in Colombo was a turning point not only for Warne, but skipper Allan Border. \"Yes it lifted Warnie's confidence greatly, but I think it also changed Allan Border, and the way he captained,\" Taylor told Wide World of Sports. \"Allan could see the potential in Warnie, but as a spinner you don't have that intimidation factor. \"Greg bowled a lot more overs than Warnie on that day, but I think AB finally thought that he had to see if Warnie had it or not. \"And he did. He got the final three wickets, and I think that gave both Warnie and AB a lot of confidence going forward.\" According to Warne, Border called it 'The greatest heist since the Great Train Robbery' as Sri Lanka capitulated, losing 8-37 at the end. \"If it had been on TV in Australia it would be remembered as one of the great Test matches,\" Warne wrote. \"I contributed to the win and sensed the relief. It's hard to explain exactly how good it was to feel I belonged; or if not quite belonged, that I didn't let anyone down.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/415393/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Emotional Clarke ‘can’t say goodbye’","link":"https://www.cairnspost.com.au/sport/cricket/emotional-clarke-cant-say-goodbye/video/e20d37ba57a7d1511bffe8441a7d378c","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: An emotional Michael Clarke appeared on the Today Show to discuss some of favourite Shane Warne memories, but said he'll never be able to say goodbye.","content":null,"pubDate":"2022-03-08 01:36:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia trail Pakistan by 27 runs in 1st cricket Test","link":"https://www.tribuneindia.com/news/sports/australia-trail-pakistan-by-27-runs-in-1st-cricket-test-376015","keywords":null,"creator":null,"video_url":null,"description":"RawalpindiAustralia's batters flourished on a flat wicket today to cut Pakistan's lead to 27 runs as the first Test heads toward a draw. Australia reached 449/7 at stumps in their first innings on Day 4 on a grassless wicket with Marnus Labuschagne (90) and Steve Smith (78) scoring half-centuries. MargaoISL: Jamshedpur FC lift maiden ISL League ShieldRitwik Das scored a second-half winner to help Jamshedpur FC beat ATK Mohun Bagan 1-0 and bag their maiden League Shield in the Indian Super League here today. BangkokThai autopsy says Warne died of natural causesPolice in Thailand said today that an autopsy conducted on the body of Australian cricket star Shane Warne has concluded that he died of natural causes, ruling out foul play. \"There are no reports of missing items. There were no signs of a struggle,\" said Assistant Police Commissioner General Gen Surachate Hakparn. LondonCity double down on United's anguish for derby gloryA double from Kevin De Bruyne. A double from Riyad Mahrez. The double completed by City over United in this season's Manchester derbies. The 4-1 victory on Sunday restored City's six-point lead over Liverpool in the EPL. Agencies","content":null,"pubDate":"2022-03-08 01:33:48","full_description":"Rawalpindi Australia’s batters flourished on a flat wicket today to cut Pakistan’s lead to 27 runs as the first Test heads toward a draw. Australia reached 449/7 at stumps in their first innings on Day 4 on a grassless wicket with Marnus Labuschagne (90) and Steve Smith (78) scoring half-centuries. Margao ISL: Jamshedpur FC lift maiden ISL League Shield Ritwik Das scored a second-half winner to help Jamshedpur FC beat ATK Mohun Bagan 1-0 and bag their maiden League Shield in the Indian Super League here today. Bangkok Thai autopsy says Warne died of natural causes Police in Thailand said today that an autopsy conducted on the body of Australian cricket star Shane Warne has concluded that he died of natural causes, ruling out foul play. “There are no reports of missing items. There were no signs of a struggle,” said Assistant Police Commissioner General Gen Surachate Hakparn. London City double down on United’s anguish for derby glory A double from Kevin De Bruyne. A double from Riyad Mahrez. The double completed by City over United in this season’s Manchester derbies. The 4-1 victory on Sunday restored City’s six-point lead over Liverpool in the EPL. Agencies","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/3/2022_3$largeimg_336630321.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit looks beyond winning","link":"https://www.tribuneindia.com/news/sports/rohit-looks-beyond-winning-376010","keywords":null,"creator":null,"video_url":null,"description":"MUMBAI, March 7 India's crushing victory over Sri Lanka was an impeccable start to Rohit Sharma's reign as Test captain but the all-format leader says creating a bench strength to secure the team's future will be a bigger challenge to him than winning matches. The Mohali Test was Rohit's first assignment as captain of India's Test side after Virat Kohli stepped down in a surprise move after the team's 2-1 defeat in their last Test series in South Africa. The 34-year-old could not have hoped for a better start after India thrashed Sri Lanka inside three days by an innings and 222 runs. India's Test side, however, were not just transitioning to a new leadership against Sri Lanka but were also playing a match for the first time in over a decade with both Cheteshwar Pujara and Ajinkya Rahane missing from their batting line-up. The duo were dropped after inconsistent performances lately. \"It's not just about 11 players, it's also about the people who are sitting outside wanting to get their chances,\" Rohit told reporters after Sunday's win. \"About creating that bench strength, which will hold the future of Indian cricket. If you create that bench strength and you start thinking from now, Indian cricket will be in good hands. That is one of my challenges and one of the responsibilities I want to take upon me.\" \"We as team management want to create a very healthy and positive atmosphere,\" he added. — Reuters","content":null,"pubDate":"2022-03-08 01:33:11","full_description":"MUMBAI, March 7 India’s crushing victory over Sri Lanka was an impeccable start to Rohit Sharma’s reign as Test captain but the all-format leader says creating a bench strength to secure the team’s future will be a bigger challenge to him than winning matches. The Mohali Test was Rohit’s first assignment as captain of India’s Test side after Virat Kohli stepped down in a surprise move after the team’s 2-1 defeat in their last Test series in South Africa. The 34-year-old could not have hoped for a better start after India thrashed Sri Lanka inside three days by an innings and 222 runs. India’s Test side, however, were not just transitioning to a new leadership against Sri Lanka but were also playing a match for the first time in over a decade with both Cheteshwar Pujara and Ajinkya Rahane missing from their batting line-up. The duo were dropped after inconsistent performances lately. “It’s not just about 11 players, it’s also about the people who are sitting outside wanting to get their chances,” Rohit told reporters after Sunday’s win. “About creating that bench strength, which will hold the future of Indian cricket. If you create that bench strength and you start thinking from now, Indian cricket will be in good hands. That is one of my challenges and one of the responsibilities I want to take upon me.” “We as team management want to create a very healthy and positive atmosphere,” he added. — Reuters","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/3/2022_3$largeimg_1189741347.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Smriti hails Maroof for returning to action 6 mths after child birth","link":"https://www.tribuneindia.com/news/sports/smriti-hails-maroof-for-returning-to-action-6-mths-after-child-birth-376012","keywords":null,"creator":null,"video_url":null,"description":"Mount Maunganui, March 7Star India batter Smriti Mandhana has hailed \"inspirational\" Pakistan captain Bismah Maroof for setting an example for sportswomen across the world by returning to play six months after giving birth to a child.After they beat archrivals Pakistan by 107 runs in the Women's World Cup on Sunday, some Indian players were seen having a good time with Maroof's daughter Fatima, with pictures and videos of them playing with the six-month-old girl going viral.NZ thrash BangladeshDunedin: Hosts New Zealand bounced back from the loss in the tournament opener as they inflicted a nine-wicket defeat on Bangladesh in a rain-curtailed ICC Women's World Cup match here today. New Zealand bowlers first restricted Bangladesh to 140/8 after a long delay before Suzie Bates hit an unbeaten half-century to power the hosts home with 42 balls to spare in the match that was reduced to 27 overs apiece. The win earned New Zealand two points as they rose to the third place, while Bangladesh are seventh. PTIVice-captain Harmanpreet Kaur, Mandhana, Shafali Verma, Renuka Singh Thakur, Meghna Singh and Richa Ghosh were seen making playful gestures at the toddler cradled in Maroof's arms.\"Coming back post pregnancy in 6 months and playing international cricket is so inspiring. @bismahmaroof setting an example for sportswomen across the globe,\" Mandhana wrote in an Instagram post. \"Lots of love to baby Fatima from India and I hope she picks the bat just like you because lefties are special.\"After the match, the ICC tweeted along with a photo: \"Little Fatima's first lesson in the spirit of cricket from India and Pakistan.\"Indian cricket icon Sachin Tendulkar was quick to chip in with his admiring comment. \"What a lovely moment! Cricket has boundaries on the field, but it breaks them all off the field. Sport unites!\" he wrote in a tweet.Even before the game, photographs of Maroof entering the stadium in Mount Maunganui with her daughter — born in August last year — cradled in her arms had become an instant hit on social media.The 30-year-old Maroof was able to travel to New Zealand with her daughter — as well as her mother, Fatima's carer — as Pakistan Cricket Board's maternity rule allows the mother \"to travel with a support person of her choice to assist in caring for her infant child\", with travel and accommodation costs shared equally between the board and the player. —","content":null,"pubDate":"2022-03-08 01:33:11","full_description":"PTI Mount Maunganui, March 7 Star India batter Smriti Mandhana has hailed “inspirational” Pakistan captain Bismah Maroof for setting an example for sportswomen across the world by returning to play six months after giving birth to a child. After they beat archrivals Pakistan by 107 runs in the Women’s World Cup on Sunday, some Indian players were seen having a good time with Maroof’s daughter Fatima, with pictures and videos of them playing with the six-month-old girl going viral. NZ thrash Bangladesh Dunedin: Hosts New Zealand bounced back from the loss in the tournament opener as they inflicted a nine-wicket defeat on Bangladesh in a rain-curtailed ICC Women’s World Cup match here today. New Zealand bowlers first restricted Bangladesh to 140/8 after a long delay before Suzie Bates hit an unbeaten half-century to power the hosts home with 42 balls to spare in the match that was reduced to 27 overs apiece. The win earned New Zealand two points as they rose to the third place, while Bangladesh are seventh. PTI Vice-captain Harmanpreet Kaur, Mandhana, Shafali Verma, Renuka Singh Thakur, Meghna Singh and Richa Ghosh were seen making playful gestures at the toddler cradled in Maroof’s arms. “Coming back post pregnancy in 6 months and playing international cricket is so inspiring. @bismahmaroof setting an example for sportswomen across the globe,” Mandhana wrote in an Instagram post. “Lots of love to baby Fatima from India and I hope she picks the bat just like you because lefties are special.” After the match, the ICC tweeted along with a photo: “Little Fatima’s first lesson in the spirit of cricket from India and Pakistan.” Indian cricket icon Sachin Tendulkar was quick to chip in with his admiring comment. “What a lovely moment! Cricket has boundaries on the field, but it breaks them all off the field. Sport unites!” he wrote in a tweet. Even before the game, photographs of Maroof entering the stadium in Mount Maunganui with her daughter — born in August last year — cradled in her arms had become an instant hit on social media. The 30-year-old Maroof was able to travel to New Zealand with her daughter — as well as her mother, Fatima’s carer — as Pakistan Cricket Board’s maternity rule allows the mother “to travel with a support person of her choice to assist in caring for her infant child”, with travel and accommodation costs shared equally between the board and the player. —","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/3/2022_3$largeimg_1682146266.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Shane Warne: Last picture of cricket legend taken by good mate Tom Hall","link":"https://www.perthnow.com.au/sport/cricket/shane-warne-last-picture-of-cricket-legend-taken-by-good-mate-tom-hall-c-5972679","keywords":null,"creator":["Troy de Ruyter"],"video_url":null,"description":"It shows off the cricket great’s gigawatt smile and is a fitting last snap of his effervescent personality.","content":null,"pubDate":"2022-03-08 01:18:17","full_description":"This is the last picture of loveable larrikin Shane Warne. The photo of the cricket great was taken by close friend Tom Hall after they landed in Koh Samui in Thailand, where Warne died of a heart attack on Friday. It shows off Warne’s gigawatt smile, his pearly whites on full display as he wears a black cap with a heart logo in the centre. Hall, who was on holiday with his great mate, had no idea it would be the last photo ever taken of the legend alive. Hall posted the picture on Instagram on Friday, hours before his great mate’s death. A masseuse had visited Warne on Friday but police were not clear on what time. It is believed she — along with possibly three other masseuses — was the last person to see Warne alive. Hall, who met Warne about 15 years ago at a charity poker tournament, also detailed the last moments they shared together. It included Warne’s last meal of vegemite on toast. “I have dined with Shane in many fine establishments but rather than sample some of the local Thai fare, we tuck into a plate of Vegemite on toast,” Hall wrote on media website The Sporting News, for which he is the chief executive. “Shane chomping away: ‘Geez, you can’t beat Vegemite with some butter, always great wherever you are in the world’. “An Australian through and through — this was to turn out to be his last meal. “Ever the caring father, as I was leaving, he headed up to his bedroom to call his kids.” WA Test great Damien Martyn commented on an Instagram photo showing a jar of vegemite posted by Hall on Monday. “The picture says it all,” Martyn said. “Last meal and true to the end. Hope all okay up there as good as one can be after this happening.” Warne’s body is to be flown back to Australia on Tuesday after Thai police confirmed he died of a suspected heart attack and his family spoke of “a tragedy we will never come to terms with”. Police said there were no suspicious circumstances in the death of the 52-year-old on the Thai resort island of Koh Samui on Friday. Citing autopsy results, Lieutenant-General Surachate Hakparn said that Warne’s death was due to natural causes, with no signs of foul play. Songyot Chayaninporamet, deputy director of Samui Hospital, said the autopsy report showed Warne died of a “congenital disease”. “There is no COVID-19 infection and no sign of assault or murder,” he said. Warne’s body was to be transported to Bangkok on Monday night and flown back to Australia on Tuesday, media reports said. In a statement on Monday night, the Warne family said the night of March 4 was for them the beginning of “a never-ending nightmare” and the cricket icon’s death was “a tragedy we will never come to terms with”. “Looking to a future without Shane is inconceivable, hopefully the mountain of happy memories we all have will help us cope with our ongoing grief,” parents Keith and Brigitte Warne said. Warne’s son Jackson wrote: “To my brother, my best friend, to my Dad, I love you so much. “I don’t think anything is ever going to fill the void you have left in my heart.” Warne’s youngest daughter Summer wrote: “Dad, I miss you so much already. I wish I could’ve hugged you tighter in what I didn’t know were my final moments with you. And your final breaths were only moments away.” Eldest daughter Brooke wrote: “I am lucky and will forever be so proud to call you my Dad forever. I love you to infinity and back and I will miss you forever.”","image_url":"https://images.perthnow.com.au/publication/C-5972679/3ff52cc83e695bc9c2c23599dd67bcf95bf6cf6b-16x9-x1y0w2446h1376.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne: Last picture of cricket legend taken by good mate Tom Hall","link":"https://thewest.com.au/sport/cricket/shane-warne-last-picture-of-cricket-legend-taken-by-good-mate-tom-hall-c-5971849","keywords":null,"creator":["Troy de Ruyter"],"video_url":null,"description":"It shows off the cricket great’s gigawatt smile and is a fitting last snap of his effervescent personality.","content":null,"pubDate":"2022-03-08 01:14:54","full_description":"This is the last picture of loveable larrikin Shane Warne. The photo of the cricket great was taken by close friend Tom Hall after they landed in Koh Samui in Thailand, where Warne died of a heart attack on Friday. It shows off Warne’s gigawatt smile, his pearly whites on full display as he wears a black cap with a heart logo in the centre. Hall, who was on holiday with his great mate, had no idea it would be the last photo ever taken of the legend alive. Hall posted the picture on Instagram on Friday, hours before his great mate’s death. A masseuse had visited Warne on Friday but police were not clear on what time. It is believed she — along with possibly three other masseuses — was the last person to see Warne alive. Hall, who met Warne about 15 years ago at a charity poker tournament, also detailed the last moments they shared together. It included Warne’s last meal of vegemite on toast. “I have dined with Shane in many fine establishments but rather than sample some of the local Thai fare, we tuck into a plate of Vegemite on toast,” Hall wrote on media website The Sporting News, for which he is the chief executive. “Shane chomping away: ‘Geez, you can’t beat Vegemite with some butter, always great wherever you are in the world’. “An Australian through and through — this was to turn out to be his last meal. “Ever the caring father, as I was leaving, he headed up to his bedroom to call his kids.” WA Test great Damien Martyn commented on an Instagram photo showing a jar of vegemite posted by Hall on Monday. “The picture says it all,” Martyn said. “Last meal and true to the end. Hope all okay up there as good as one can be after this happening.” Warne’s body is to be flown back to Australia on Tuesday after Thai police confirmed he died of a suspected heart attack and his family spoke of “a tragedy we will never come to terms with”. Police said there were no suspicious circumstances in the death of the 52-year-old on the Thai resort island of Koh Samui on Friday. Citing autopsy results, Lieutenant-General Surachate Hakparn said that Warne’s death was due to natural causes, with no signs of foul play. Songyot Chayaninporamet, deputy director of Samui Hospital, said the autopsy report showed Warne died of a “congenital disease”. “There is no COVID-19 infection and no sign of assault or murder,” he said. Staff writers Staff writers Warne’s body was to be transported to Bangkok on Monday night and flown back to Australia on Tuesday, media reports said. In a statement on Monday night, the Warne family said the night of March 4 was for them the beginning of “a never-ending nightmare” and the cricket icon’s death was “a tragedy we will never come to terms with”. “Looking to a future without Shane is inconceivable, hopefully the mountain of happy memories we all have will help us cope with our ongoing grief,” parents Keith and Brigitte Warne said. Troy de Ruyter Staff writers Warne’s son Jackson wrote: “To my brother, my best friend, to my Dad, I love you so much. “I don’t think anything is ever going to fill the void you have left in my heart.” Warne’s youngest daughter Summer wrote: “Dad, I miss you so much already. I wish I could’ve hugged you tighter in what I didn’t know were my final moments with you. And your final breaths were only moments away.” Eldest daughter Brooke wrote: “I am lucky and will forever be so proud to call you my Dad forever. I love you to infinity and back and I will miss you forever.”","image_url":"https://images.thewest.com.au/publication/C-5971849/41083bbf918ce0be1a18090d12e8add1efdbd52c-16x9-x1y0w2446h1376.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Punter: I wish I told him I love him","link":"https://www.news.com.au/sport/cricket/punter-i-wish-i-told-him-i-love-him/video/f7efc840a94903bd8f9646073248dcd4","keywords":null,"creator":null,"video_url":null,"description":"Cricket: A clearly shattered Ricky Ponting joined Isa Guha to discuss his great mate Shane Warne, sharing that he wished he had a chance to tell him how much he loved him.","content":null,"pubDate":"2022-03-08 01:00:20","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Nida hopes of Pakistan's revival in World Cup","link":"https://www.thenews.com.pk/print/939629-nida-hopes-of-pakistan-s-revival-in-world-cup","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Pakistan women team vice-captain and all-rounder Nida Dar remains hopeful of her side coming back strong in the tournament despite thier heavy defeat by India in the ICC Women’s Cricket World Cup 2022 opener at Mount Manganui.Nida, who returned two for 45 in 10 overs, believed that...","content":null,"pubDate":"2022-03-08 01:00:00","full_description":"LAHORE: Pakistan women team vice-captain and all-rounder Nida Dar remains hopeful of her side coming back strong in the tournament despite thier heavy defeat by India in the ICC Women’s Cricket World Cup 2022 opener at Mount Manganui. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Nida, who returned two for 45 in 10 overs, believed that pitches in New Zealand are prone to batting. “The wickets here are flat and are batting friendly. They help the batters in scoring quick runs. We should have chased 245 here, considering the experience of our batters and our run in the warm-ups,” she said. Pakistan will take on Australia today at the same venue. For Nida, the key going into that match is to “learn from the mistakes and focus on the next match”, adding that Australia are a strong side and it is important “for us to make a strong comeback in the tournament.” “You do experience tough challenges at a stage like World Cup, but it also gives you an opportunity to stage comebacks,” she concluded.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Shane Warne died of 'natural causes': autopsy","link":"https://www.thenews.com.pk/print/939622-shane-warne-died-of-natural-causes-autopsy","keywords":null,"creator":null,"video_url":null,"description":"KOH SAMUI, Thailand: Cricket superstar Shane Warne died of natural causes, Thai police said Monday, as his family lamented a “tragedy we will never come to terms with”.The legendary Australian leg-spinner died on the Thai holiday island of Koh Samui on Friday after being found...","content":null,"pubDate":"2022-03-08 01:00:00","full_description":"KOH SAMUI, Thailand: Cricket superstar Shane Warne died of natural causes, Thai police said Monday, as his family lamented a “tragedy we will never come to terms with”. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The legendary Australian leg-spinner died on the Thai holiday island of Koh Samui on Friday after being found unresponsive at a luxury villa. Initial reports suggested the 52-year-old suffered a heart attack and autopsy results on Monday confirmed he died of natural causes. “Investigators received an autopsy report today in which a forensic doctor concludes the death was due to natural causes,” Krissana Pattanacharoen, deputy national police spokesman, said in a statement. He said Warne’s family had been informed of the result and accepted it. “Investigators will conclude the autopsy reports and send them to state prosecutor as soon as possible,” Krissana added. Surachate Hakparn, assistant to the national police chief, said investigators had found no signs of violence at the villa where Warne was found. “His father said he (Warne) had been suffering chest pains and was planning to return home for a check-up after this trip,” Surachate told reporters in Koh Samui. Warne’s unexpected death sparked an outpouring of grief from prime ministers, rock stars and fellow athletes. The player — one of the greatest Test cricketers of all time — was found after failing to meet friends. He was taken to the Thai International Hospital Samui but despite medical efforts he could not be revived. Officials said his body will now be transported to Bangkok to be handed over to diplomats for repatriation to Australia, where he is to be honoured with a state funeral. In their first public comments since the death on Friday, Warne’s parents, brother, children and ex-wife expressed deep sorrow, paying tribute to one of the greatest Test cricketers of all time and the man they loved. “To find words to adequately express our sadness is an impossible task for us and looking to a future without Shane is inconceivable,” parents Keith and Brigitte Warne said in a statement. “I miss you so much already,” said daughter Summer Warne. “I wish I could’ve hugged you tighter in what I didn’t know were my final moments with you.” “I wish I could’ve told you that everything was going to be OK and hold your hand.” Son Jackson Warne reminisced about playing golf and poker, and watching Australian rules football while eating pizza with someone he saw as a brother and best friend, as well as a father. “I love you so much. I don’t think anything is ever going to fill the void you have left in my heart,” he said in a statement. “You were truly the best father and mate anyone could’ve asked for. I love you so much Dad, see you soon.” Australian Prime Minister Scott Morrison led tributes to one of the country’s “greatest characters” and announced Warne would receive a full state funeral. Over the weekend fans paid homage to Warne at the Melbourne Cricket Ground — including offerings of cigarettes, beer and meat pies — to remember an extraordinary cricketing talent with a huge appetite for life. Credited with reviving the art of leg-spin, Warne was part of a dominant Australian Test team in the 1990s and 2000s and helped his country win the 1999 limited-overs World Cup.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"NZ bounce back to beat Bangladesh in rain-hit match","link":"https://www.thenews.com.pk/print/939623-nz-bounce-back-to-beat-bangladesh-in-rain-hit-match","keywords":null,"creator":null,"video_url":null,"description":"DUNEDIN: New Zealand cruised to a nine-wicket win over Bangladesh in a rain-affected match on Monday to put their Women’s Cricket World Cup campaign back on track.The New Zealanders, who suffered a shock loss to the West Indies in their opening match, looked totally in control in a fixture...","content":null,"pubDate":"2022-03-08 01:00:00","full_description":"DUNEDIN: New Zealand cruised to a nine-wicket win over Bangladesh in a rain-affected match on Monday to put their Women’s Cricket World Cup campaign back on track. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The New Zealanders, who suffered a shock loss to the West Indies in their opening match, looked totally in control in a fixture where the innings were reduced to 27 overs due to heavy rain. Set a target of 141, they finished on 144-1 with seven overs to spare as Suzie Bates smashed 79 off 69 balls and Amelia Kerr made 47 off 37. Captain Sophie Devine said New Zealand needed to “move on quickly” from the West Indies defeat but admitted she feared the match against Bangladesh would be washed out, in a potentially disastrous blow to their hopes of making the knockouts. “We know that this competition’s going to be tight so we’re certainly happy we managed to get a win,” she said. Bangladesh captain Nigar Sultana said the cold, wet conditions affected her players. “We’ve never played in these conditions because of the rain,” she said. “Our bowlers couldn’t grip the ball properly and we couldn’t see the ball properly on the ground, so it was very tough.” She said the Bangladesh batters struggled to form partnerships but hailed her team’s fighting spirit. New Zealand won the toss and opted to bowl in the first ever ODI meeting between the teams. Bangladesh’s openers made a dynamic start to their 27-over innings, intent on improving the sluggish run rate that cost dearly in a 32-run loss to South Africa in their tournament opener. Shamima Sultana made 33 off 36 balls before departing, then Amy Satterthwaite put the brakes on Bangladesh’s scoring with two wickets in her first over and finished with three for 25. Fargana Haque managed 52 off 63 balls but was run out by Frances Mackay, who performed spectacularly in the field. Devine was dismissed cheaply for 14 but Bates and Kerr combined for a decisive 108-run stand.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"‘I love him’: One thing Ricky Ponting wishes he said to Shane Warne","link":"https://www.foxsports.com.au/cricket/australia/i-love-him-one-thing-ricky-ponting-wishes-he-said-to-shane-warne/news-story/81efac7424cf5c88582f56d531f624a8","keywords":null,"creator":null,"video_url":null,"description":"Former Australian skipper Ricky Ponting has opened up on the death of Shane Warne in an emotional conversation as the cricket superstar continues to be remembered.","content":null,"pubDate":"2022-03-08 00:14:00","full_description":"Former Australian skipper Ricky Ponting has opened up on the death of Shane Warne in an emotional conversation as the cricket superstar continues to be remembered. Tears have flowed as easily as the tributes for Warne , who died aged 52 after he suffered a shock heart attack in Thailand as he began a three-month break from work . Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > It came on the same day former Australian wicketkeeper Rod Marsh died also following a heart attack. Speaking with former England star and Fox Cricket commentator Isa Guha on the ICC Podcast, Ponting said he had to deal with the loss of “two of my closest friends” in Rod Marsh and Warne on Friday and Saturday morning. He said he still can’t believe Warne is gone, saying it’s still so raw in an emotional interview. “I’ve had the television on this morning watching a lot of the tributes to him, but any time I hear his voice, I have to turn it off,” Ponting said as his lip quivered as he fought to keep his emotions in check. But when Guha asked something Ponting wished he could say to Warne right now, he was overcome. “As I’ve said to a lot of the guys I’ve been talking to over the last couple of days, just how much I love him,” Ponting said. “I didn’t say that, but I wish I did.” Ponting is struggling with the loss of his great mate. Photo: ICC Source: Supplied It’s hard right now. Photo: ICC Source: Supplied “I’m sorry for your loss Ricky,” Guha said. “You wouldn’t have needed to say that to him, he would have just known how you felt about him.” Ponting added that while it was hard to listen to his voice right now, he said in the coming days, weeks, months and years the stories would continue to flow. Ponting broke down on 7News on Monday after he was asked about how he will remember Warne. The pair had known each other for 32 years after first crossing paths when Ponting arrived at the national cricket Academy at the age of 15. Warne gave Ponting his “Punter” nickname. He was far from the only one as tributes and tears flowed from across the cricket and sporting world, a sign of just how he touched the sporting consciousness. Ponting said what would shine through was “just how loyal and how good a friend he was to everyone he loved. And everyone loved him.” Ponting was five years younger than Warne and arrived on the Test scene in 1995, three years after Warne, as the pair played 12 years in the Australian side together. Warne and Ponting went through a lot together. Photo by Hamish Blair/Getty Images Source: Getty Images It gave Ponting a first hand view at the phenomenon that was Shane Warne. “When we were travelling the world or when we were travelling around Australia, the Australian cricket team would do coaching clinic’s whenever we could,” Ponting said. “When Shane was there, every kid at that coaching clinic wanted to bowl leg spin. Everyone wanted to be Shane Warne. That wasn’t only in Australia – there would have been boys and girls in England wanting to be Shane Warne as well, and India and places like that. That’s the impact he had on the game. “Just thinking of how big he was in the scheme of world sport, from signing that big Nike contract and going over and hanging out with Michael Jordan, that stuff doesn’t happen in cricket. He was a star, just an absolute superstar. “Forget about what he did on the field the star power that he brought to the game, the game was always better when Warnie was a part of it. And we’re going to notice that pretty soon. People will notice that with his commentary not being there.” Ponting also said Warne didn’t speak to him about potentially coaching England but said “I would have tried to talk him out of it”. Ponting and Warne in 1999. Source: News Limited Former teammate Simon O’Donnell said on SEN that Warne’s death had prompted him to tell those he loves how he feels. “This is the third time I’ve sat here and I’m talking about friends and I’m saying things I should’ve already said to them, it’s now bugging me, it’s going to take time to process this and I’m still not 100% sure where I’m at but I think the first lesson I’m taking is to stop not saying what you need to say, say it because it’s too late when we’re not here,” O’Donnell said on SEN. “Don’t be embarrassed about it, if we need to talk about something – talk about it, I think that’s really important. “I don’t want to feel like this again, I want people to know what I feel about them and for them. “He touched a lot of people but the one thing that is starting to annoy me as a 59-year-old is saying, ‘why haven’t I said what I wanted to say to him before’, we take for granted that we’re all going to be here forever, well we’re not.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"This is the last photo ever taken of Shane Warne","link":"https://wwos.nine.com.au/cricket/shane-warne-death-last-photo-in-thailand-ricky-ponting-tribute/1bce0398-3196-4876-943c-d1c8ac2d99b8","keywords":null,"creator":["wwos"],"video_url":null,"description":"A close friend of Shane Warne has shared what is believed to be the last photo taken of the cricket icon before his death.","content":"A close friend of Shane Warne has shared one of the final moments from the late cricket legend.Warne's life was cut short at just 52 when he was found unresponsive in his Koh Samui villa over the weekend.His friend Thomas Hall, who's also the CEO of The Sporting News, shared a photo to Instagram taken of Warne, thought to be the last photo taken of the cricket legend before his death, with the pair both part of a group holidaying in Thailand.READ MORE: Bill Lawry's tribute to Shane WarneREAD MORE: Sly move lights up first TestREAD MORE: Dragons snub gun pairWarne is seen smiling and enjoying himself in the photo.Warne's friend in a column for Sporting News wrote that \"he was laughing and was himself\".He also revealed how Warne was eager to spend some of his time away in Thailand watching Australia's Test series against Pakistan.\"Cricket, AFL, golf and his family were the main passions in his life and Warney and cricket were never far apart,\" Hall wrote.Earlier today, former Australian captain Ricky Ponting said he wishes he could've told Shane Warne just how much he loved him, while urging the cricket world to carry on the spin legend's legacy.Ponting, who spent much of his playing career alongside Warne, said the tributes to the champion spinner over the past few days have been hard to watch.\"I've had the television on this morning watching a lot of the tributes to him, but any time I hear his voice, I have to turn it off,\" said Ponting as he fought back tears when speaking on an ICC podcast.Asked if there was something he could say to him right now, Ponting replied: \"As I've said to a lot of the guys I've been talking to over the last couple of days, just how much I love him.\"I didn't say that, but I wish I did.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-07 23:57:21","full_description":"A close friend of Shane Warne has shared one of the final moments from the late cricket legend. Warne's life was cut short at just 52 when he was found unresponsive in his Koh Samui villa over the weekend. His friend Thomas Hall, who's also the CEO of The Sporting News, shared a photo to Instagram taken of Warne, thought to be the last photo taken of the cricket legend before his death, with the pair both part of a group holidaying in Thailand. READ MORE: Bill Lawry's tribute to Shane Warne READ MORE: Sly move lights up first Test READ MORE: Dragons snub gun pair Warne is seen smiling and enjoying himself in the photo. Warne's friend in a column for Sporting News wrote that \"he was laughing and was himself\". He also revealed how Warne was eager to spend some of his time away in Thailand watching Australia's Test series against Pakistan. \"Cricket, AFL, golf and his family were the main passions in his life and Warney and cricket were never far apart,\" Hall wrote. Earlier today, former Australian captain Ricky Ponting said he wishes he could've told Shane Warne just how much he loved him , while urging the cricket world to carry on the spin legend's legacy. Ponting, who spent much of his playing career alongside Warne, said the tributes to the champion spinner over the past few days have been hard to watch. \"I've had the television on this morning watching a lot of the tributes to him, but any time I hear his voice, I have to turn it off,\" said Ponting as he fought back tears when speaking on an ICC podcast. Asked if there was something he could say to him right now, Ponting replied: \"As I've said to a lot of the guys I've been talking to over the last couple of days, just how much I love him. \"I didn't say that, but I wish I did.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/415315/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Liverpool vs Inter Milan: TV channel, live stream, kick-off time and team news for Champions League clash","link":"https://www.thesun.co.uk/sport/17866317/liverpool-vs-inter-milan-tv-channel-live-stream-kick-off-time-and-team-news-for-champions-league-clash/","keywords":["Champions League","Football","Sport","Explainers","Match previews"],"creator":["Nyle Smith"],"video_url":null,"description":"LIVERPOOL return to Champions League action where they’ll be hoping to finish off the job against Inter Milan. The Reds are in pole position to progress into the quarter-finals having convincingly beaten Inter Milan 2-0 during their first leg at the San Siro. Also, confidence will be brewing as Jurgen Klopp’s men are going into […]","content":"LIVERPOOL return to Champions League action where they’ll be hoping to finish off the job against Inter Milan. The Reds are in pole position to progress into the quarter-finals having convincingly beaten Inter Milan 2-0 during their first leg at the San Siro. PASadio Mane’s winning goal helped temporarily close the gap on league leader Man City[/caption] Also, confidence will be brewing as Jurgen Klopp’s men are going into this fixture off the back of a marginal 1-0 triumph over West Ham in the league. However, Inter recently ran riot in Serie A – putting FIVE past their opponents Salernitana. And with the away goals rule scrapped, Simone inzaghi’s side are still very much in this tie. What time does Liverpool vs Inter Milan kick off? Liverpool take on Inter Milan on Tuesday 8, March.The match kicks off at 8pm UK time.It takes place at Anfield in Liverpool.Liverpool were triumphant in the first leg winning 2-0 on the night. What TV channel is Liverpool vs Inter Milan on and can I live stream it? Liverpool vs Inter Milan is live on BT Sport 2 and BT Sport 2 HD.The coverage commences at 7:00pm UK time – one hour before kick-off.Subscription members can also stream the game live via the BT Sport website or app. Team news Roberto Firmino and Thiago Alacantara both missed the narrow 1-0 victory over West Ham, however, Klopp confirmed on Monday that the Liverpool duo trained so he’ll wait to see how they react. Joel Matip was also unavailable for selection on the weekend due to an illness, but the defender is expected to feature in the Champions League clash. As for Diogo Jota, the Portuguese star managed to clock up some minutes against the Hammers so he’ll be fit and raring to go. Ivan Perisic is a minor doubt having missed Inter Milan’s 5-0 thrashing over Salernitana with a muscle injury. But the Croatian wing-back has reportedly returned to training so he is expected to get game time at some point in the second leg. Latest odds Liverpool to qualify – 11/20 Draw (after 90 min) – 7/2 Inter Milan to qualify – 9/2 *Odds courtesy of Betfair are correct at time of publication. Most read in Champions League WHAT A BOOB Camilla Cabello accidentally flashes a boob live on The One Show TV LEGEND DEAD Open All Hours and EastEnders star Lynda Baron dies aged 82 SOAP SWAP EastEnders legend joins Hollyoaks as scheming new supervillain 'ONGOING GRIEF' Shane Warne's cause of death revealed as family pay tribute to cricket star BITTER SWEET Jayne Torvill breaks down in tears as Christopher Dean comforts her on DOI Daddy dearest Millie Radford shares first glimpse at baby Chester's dad","pubDate":"2022-03-07 23:55:00","full_description":"LIVERPOOL return to Champions League action where they'll be hoping to finish off the job against Inter Milan. The Reds are in pole position to progress into the quarter-finals having convincingly beaten Inter Milan 2-0 during their first leg at the San Siro. Also, confidence will be brewing as Jurgen Klopp's men are going into this fixture off the back of a marginal 1-0 triumph over West Ham in the league. However, Inter recently ran riot in Serie A - putting FIVE past their opponents Salernitana. And with the away goals rule scrapped, Simone inzaghi's side are still very much in this tie. Roberto Firmino and Thiago Alacantara both missed the narrow 1-0 victory over West Ham, however, Klopp confirmed on Monday that the Liverpool duo trained so he'll wait to see how they react. Joel Matip was also unavailable for selection on the weekend due to an illness, but the defender is expected to feature in the Champions League clash. As for Diogo Jota, the Portuguese star managed to clock up some minutes against the Hammers so he'll be fit and raring to go. Ivan Perisic is a minor doubt having missed Inter Milan's 5-0 thrashing over Salernitana with a muscle injury. But the Croatian wing-back has reportedly returned to training so he is expected to get game time at some point in the second leg. Liverpool to qualify - 11/20 Draw (after 90 min) - 7/2 Inter Milan to qualify - 9/2 *Odds courtesy of Betfair are correct at time of publication.","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Tragic thing Ponting didn’t tell Warne","link":"https://www.news.com.au/sport/cricket/i-love-him-one-thing-ricky-ponting-wishes-he-said-to-shane-warne/news-story/95f30a6997a646346974a0c79b5d34f0","keywords":null,"creator":null,"video_url":null,"description":"Former Australian skipper Ricky Ponting has opened up on the death of Shane Warne and his enormous impact in an emotional conversation as the cricket superstar continues to be remembered.","content":null,"pubDate":"2022-03-07 23:52:00","full_description":"Former Australian skipper Ricky Ponting has opened up on the death of Shane Warne in an emotional conversation as the cricket superstar continues to be remembered. Tears have flowed as easily as the tributes for Warne , who died aged 52 after he suffered a shock heart attack in Thailand as he began a three-month break from work . Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > It came on the same day former Australian wicketkeeper Rod Marsh died also following a heart attack. Speaking with former England star and Fox Cricket commentator Isa Guha on the ICC Podcast, Ponting said he had to deal with the loss of “two of my closest friends” in Rod Marsh and Warne on Friday and Saturday morning. He said he still can’t believe Warne is gone, saying it’s still so raw in an emotional interview. “I’ve had the television on this morning watching a lot of the tributes to him, but any time I hear his voice, I have to turn it off,” Ponting said as his lip quivered as he fought to keep his emotions in check. But when Guha asked something Ponting wished he could say to Warne right now, he was overcome. “As I’ve said to a lot of the guys I’ve been talking to over the last couple of days, just how much I love him,” Ponting said. “I didn’t say that, but I wish I did.” “I’m sorry for your loss Ricky,” Guha said. “You wouldn’t have needed to say that to him, he would have just known how you felt about him.” Ponting added that while it was hard to listen to his voice right now, he said in the coming days, weeks, months and years the stories would continue to flow. Ponting broke down on 7News on Monday after he was asked about how he will remember Warne. The pair had known each other for 32 years after first crossing paths when Ponting arrived at the national cricket Academy at the age of 15. Warne gave Ponting his “Punter” nickname. He was far from the only one as tributes and tears flowed from across the cricket and sporting world, a sign of just how he touched the sporting consciousness. Ponting said what would shine through was “just how loyal and how good a friend he was to everyone he loved. And everyone loved him.” Ponting was five years younger than Warne and arrived on the Test scene in 1995, three years after Warne, as the pair played 12 years in the Australian side together. It gave Ponting a first hand view at the phenomenon that was Shane Warne. “When we were travelling the world or when we were travelling around Australia, the Australian cricket team would do coaching clinic’s whenever we could,” Ponting said. “When Shane was there, every kid at that coaching clinic wanted to bowl leg spin. Everyone wanted to be Shane Warne. That wasn’t only in Australia – there would have been boys and girls in England wanting to be Shane Warne as well, and India and places like that. That’s the impact he had on the game. “Just thinking of how big he was in the scheme of world sport, from signing that big Nike contract and going over and hanging out with Michael Jordan, that stuff doesn’t happen in cricket. He was a star, just an absolute superstar. “Forget about what he did on the field the star power that he brought to the game, the game was always better when Warnie was a part of it. And we’re going to notice that pretty soon. People will notice that with his commentary not being there.” Ponting also said Warne didn’t speak to him about potentially coaching England but said “I would have tried to talk him out of it”. Former teammate Simon O’Donnell said on SEN that Warne’s death had prompted him to tell those he loves how he feels. “This is the third time I’ve sat here and I’m talking about friends and I’m saying things I should’ve already said to them, it’s now bugging me, it’s going to take time to process this and I’m still not 100% sure where I’m at but I think the first lesson I’m taking is to stop not saying what you need to say, say it because it’s too late when we’re not here,” O’Donnell said on SEN. “Don’t be embarrassed about it, if we need to talk about something – talk about it, I think that’s really important. “I don’t want to feel like this again, I want people to know what I feel about them and for them. “He touched a lot of people but the one thing that is starting to annoy me as a 59-year-old is saying, ‘why haven’t I said what I wanted to say to him before’, we take for granted that we’re all going to be here forever, well we’re not. An Indian cricket icon has issued an apology following a backlash towards a “shameful” comment made about Shane Warne. He’s one of Australia’s greatest ever players who tormented the old enemy for decades but he had a bold bid to take Australia down. Former Australian cricket captain Michael Clarke has cried on live television after being asked one question about close friend Shane Warne’s death.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket great forced to apologise for Warne slap","link":"https://www.news.com.au/sport/cricket/indian-cricket-legend-forced-to-apologise-for-warne-slap/news-story/c22a56eeb888d35ff4b860c788dfe446","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket icon Sunil Gavaskar has issued an apology following a backlash towards scandalous comments he made about Shane Warne.","content":null,"pubDate":"2022-03-07 23:51:00","full_description":"Indian cricket icon Sunil Gavaskar has issued an apology following a backlash towards scandalous comments he made about Shane Warne. Gavaskar was slammed for his untimely remarks over Warne’s status in the game following the Australian great’s shock death. Appearing on Indian show India Today , Gavaskar - the former Indian captain and legendary opening batsman - was asked if he believed Warne was cricket’s greatest spin bowler. Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > Gavaskar, who is now a regular pundit, said he believed Test cricket’s greatest wicket-taker and former Sri Lanka bowler Muttiah Muralitharan, as well as India’s litany of spinners, ranked ahead of Warne. However he has now moved to soften the blow. “Last week was a very traumatic time for cricket fraternity as in 24 hours, we lost two of the most iconic cricketers the game has seen - Rodney Marsh and Shane Warne,” he said. “On TV, I was asked by an anchor whether Warne was the greatest spinner and I gave my honest opinion. In hindsight, that question should not have been asked nor should it have been answered as it was not the right time for any comparison or evaluation. “Warne was one of the greatest players to ever grace the game. Rodney Marsh too was one of the greatest wicketkeepers the game has seen. May their souls rest in eternal peace.” He initially said the reason he did not hold Warne in such elite company is that the Australian did not have the same success against India as other Test playing nations. “No, I wouldn’t say that no. For me the Indian spinners and Muttiah Muralitharan were better than Shane Warne,” he told India Today . “Look at Shane Warne’s record against India. It was pretty ordinary. “In India, he got five wickets only once in Nagpur, and that too because Zaheer Khan swung wildly against him to give him a fifer. Because he did not have much success against Indian players who were very good players of spin, I don’t think I would call him the greatest. “Muttiah Muralitharan with a greater success he had against India, I would rank him over Warne in my book.” While Muralitharan (800) finished with more wickets than Warne (708), the Australian, who was voted by Wisden as one of five cricketers of the 20th century, is often regarded as the game’s greatest spinner, according to foxsports.com.au . Interestingly, Warne played just three matches against Bangladesh and Zimbabwe, taking 17 wickets. Against the same opposition, Muralitharan took 176 wickets from 25 matches. India was the only Test nation that Warne averaged more than 30 against with the ball, with the leg-spinner taking just 43 wickets at 47.18 from 14 matches. Muralitharan took 105 wickets at 32.16 - his second worst record behind Australia, whom he took 59 wickets at 36.06 yet Down Under that average ballooned out to 75.41. Fans earlier hit out at Gawvaskar for the harsh valuation of Warne. Sunil Gavaskar uses Shane Warne's death an an opportunity to say that Indian spinners and Muralitharan were better, because of their records against India. Honestly, Sunny, it's not the time.. could have just sidestepped it. The body isn't even cold yet https://t.co/jiTzlCQxAX Shameful interview Sunil Gavaskar and Rajdeep Sardesai. While Sunil G showed utter disrespect towards a great who has just passed away, Rajdeep smiled and grinned throughout Gavaskar needs to be banned from attending interviews and all! That comment on Warne was so disgusting! Really felt bad This is utterly disgusting&classless Mr. #Gavaskar & @sardesairajdeep . Is this the time to ask âDo you think he is best spinner of all time?â& gavaskar is discussing Warne records&stats without dodging itð¤¦ He just passed away.Have some sense. @rohangava9 @IndiaToday #ShaneWarne https://t.co/pcg4tjevKO And just because they donât know them theyâre gonna make it about themselves, as to how much they were fond of them. So, letâs break the trend and let the people who know them dearly talk about them or maybe just not and leave the fucking situation as it is. Ricky Ponting has opened up on how raw the loss of Shane Warne still is and the tragic thing he wishes he could tell his great mate. He’s one of Australia’s greatest ever players who tormented the old enemy for decades but he had a bold bid to take Australia down. Former Australian cricket captain Michael Clarke has cried on live television after being asked one question about close friend Shane Warne’s death.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Bayern Munich vs Salzburg: TV channel, live stream, kick-off time and team news for Champions League clash","link":"https://www.thesun.co.uk/sport/17867830/bayern-munich-vs-rb-salzburg-tv-channel-live-stream-kick-off-time-team-news-champions-league/","keywords":["Champions League","Football","Sport","Explainers","Match previews"],"creator":["Nyle Smith"],"video_url":null,"description":"BAYERN MUNICH look to navigate their way past Salzburg in their Champions League Last 16 second-leg tie. The 30x Bundesliga winners are strong favourites to land a quarter-final spot once Tuesday’s dust has settled. They are also expected to go all the way and reclaim the prize that they won in 2020. And Bayern’s 4-1 […]","content":"BAYERN MUNICH look to navigate their way past Salzburg in their Champions League Last 16 second-leg tie. The 30x Bundesliga winners are strong favourites to land a quarter-final spot once Tuesday’s dust has settled. AFPKingsley Coman rescued Bayern Munich in the first leg with a 90th minute equaliser[/caption] They are also expected to go all the way and reclaim the prize that they won in 2020. And Bayern’s 4-1 win over Furth on the weekend puts them in good spirits ahead of their clash with the reigning Austrian champions. However, Salzburg held Julian Nagelsmann’s side to a 1-1 draw in the first leg so it’s not a foregone conclusion by any stretch of the imagination. What time does Bayern Munich vs Salzburg kick off? Bayern Munich face Salzburg on Tuesday 8, March.It is scheduled to kick-off at 8pm UK time.The match will take place in Munich at the Allianz Arena.Salzburg held Bayern to a 1-1 draw in the first leg. What TV channel is Bayern Munich vs Salzburg on and can I live stream it? Bayern Munich vs Salzburg will be broadcast live on BT Sport 3 and BT Sport 3 HD.The coverage begins at 7:30pm UK time – 30 minutes before kick-off.Subscription members of BT Sport can stream the action from the BT Sport website or app. Team news Julian Naglesmann has a quadruple blow ahead of the clash with RB Salzburg because Manuel Neuer, Corentin Tolisso, Leon Goretzka and Alphonso Davies are all expected to be unavailable. On the flip side, experienced German superstar Thomas Muller is fit and ready to return to action. RB Salzburg have a long list of players in the medical room themselves with Albert Vallci, Sekou Koita, Bryan Okoh, Benjamin Sesko, Noah Okafor, Oumar Solet, Osumane Diakite and Jerome Onguene all being out. Latest odds Bayern Munich to qualify 1/16 Draw (after 90 mins) 2/13 RB Salzburg to qualify 2/15 *Odds courtesy of Betfair are correct at time of publication Most read in Champions League WHAT A BOOB Camilla Cabello accidentally flashes a boob live on The One Show TV LEGEND DEAD Open All Hours and EastEnders star Lynda Baron dies aged 82 SOAP SWAP EastEnders legend joins Hollyoaks as scheming new supervillain 'ONGOING GRIEF' Shane Warne's cause of death revealed as family pay tribute to cricket star BITTER SWEET Jayne Torvill breaks down in tears as Christopher Dean comforts her on DOI Daddy dearest Millie Radford shares first glimpse at baby Chester's dad","pubDate":"2022-03-07 23:50:00","full_description":"BAYERN MUNICH look to navigate their way past Salzburg in their Champions League Last 16 second-leg tie. The 30x Bundesliga winners are strong favourites to land a quarter-final spot once Tuesday's dust has settled. They are also expected to go all the way and reclaim the prize that they won in 2020. And Bayern's 4-1 win over Furth on the weekend puts them in good spirits ahead of their clash with the reigning Austrian champions. However, Salzburg held Julian Nagelsmann's side to a 1-1 draw in the first leg so it's not a foregone conclusion by any stretch of the imagination. Julian Naglesmann has a quadruple blow ahead of the clash with RB Salzburg because Manuel Neuer, Corentin Tolisso , Leon Goretzka and Alphonso Davies are all expected to be unavailable. On the flip side, experienced German superstar Thomas Muller is fit and ready to return to action. RB Salzburg have a long list of players in the medical room themselves with Albert Vallci, Sekou Koita, Bryan Okoh, Benjamin Sesko, Noah Okafor, Oumar Solet, Osumane Diakite and Jerome Onguene all being out. Bayern Munich to qualify 1/16 Draw (after 90 mins) 2/13 RB Salzburg to qualify 2/15 *Odds courtesy of Betfair are correct at time of publication","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"'Not the right time': Cricket legend apologises for Shane Warne comment","link":"https://au.sports.yahoo.com/shane-warne-2022-cricket-legend-apologises-comment-222338510.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-03-07 22:23:38","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-03/d278f9d0-9e62-11ec-bfd3-78f5b1dec036","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘No more crying’: Michael Clarke doesn’t know how he will say goodbye to Shane Warne","link":"https://thewest.com.au/news/no-more-crying-michael-clarke-doesnt-know-how-he-will-say-goodbye-to-shane-warne-c-5971096","keywords":null,"creator":["Lauren Ferri"],"video_url":null,"description":"Former Australian cricket captain Michael Clarke has cried on live television after being asked one question about close friend Shane Warne’s death.","content":null,"pubDate":"2022-03-07 22:12:08","full_description":"Former Australian cricket captain Michael Clarke has broken down on live television over the death of his best mate Shane Warne. Just days after the spin king was found dead of a heart attack at his Koh Samui villa in Thailand, Clarke said he doesn’t know if he could ever say goodbye to his former teammate. When asked how he would confront the moment, Clarke went silent as he fought back tears. “No more crying … my God,” he said on Today. “It will be hard … I’m sure he will get the send off that he deserves but I don’t think I will ever say goodbye.” Like most Australians, Clarke said he was in “absolute shock” when he was given the news early Saturday morning. The pair had even made plans to catch up when Warne returned from his much-needed break. Clarke said he had spoken to Warne about his health just moments before he stepped onto the flight. “I remember when I got a phone call from Helen early in the morning on Saturday, I thought there might have been a bit of confusion, like a journalist might have said Warnie’s name when they really meant Rod Marsh,” Clarke confessed. “It took me some time to believe it was real.” Clarke revealed that he had spoken to Warne about his health just before he stepped on the plane to go to Thailand. “It’s still such a shock, obviously extremely raw,” he said. “I was lucky enough to play cricket alongside my role model, my idol, my inspiration, and then to build a friendship and just go through the highs and lows of life.” The former Australian captain said the statements issued by Warne’s family were “heart-wrenching”. Clarke described his former teammate as a “great dad” who had an “honest and raw” relationship with his children. “Warnie made sure, without fail, to contact his kids and even though he might not have been under the same roof, he was always there for them, he just spent so much time with them,” Clarke said. “He never expected or wanted them to do anything particular, it was more just enjoy life. “He enjoyed the journey.” Thai authorities on Monday confirmed Warne died of natural causes. “Investigators received the autopsy result, in which the medical opinion is that the cause of death is natural,” deputy national police spokesman Kissana Phathanacharoen said, according to Channel News Asia. “Investigators will summarise the autopsy result for prosecutors within the time frame of the law.” Warne died of a suspected heart attack at a luxury resort villa where he was staying with three friends on Friday night. Those that were with him attempted to conduct CPR after finding him unresponsive and called an ambulance. As Australians, and the global cricket community reeled from the shock news of Warne’s death, he was moved on Sunday from Koh Samui hospital to a larger hospital capable of carrying out an autopsy. After reaching the mainland, the ambulance travelled to a hospital in the town of Surat Thani, where doctors conducted the procedure to determine the exact cause of death. His body is set to be sent back to Australia on Tuesday.","image_url":"https://images.thewest.com.au/publication/C-5971096/f7294abdc105823f0ea9f4b95ebed365ab3ce76f-16x9-x0y0w1655h931.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘No more crying’: Michael Clarke doesn’t know how he will say goodbye to Shane Warne","link":"https://www.perthnow.com.au/sport/no-more-crying-michael-clarke-doesnt-know-how-he-will-say-goodbye-to-shane-warne-c-5971094","keywords":null,"creator":["Lauren Ferri"],"video_url":null,"description":"Former Australian cricket captain Michael Clarke has cried on live television after being asked one question about close friend Shane Warne’s death.","content":null,"pubDate":"2022-03-07 22:12:05","full_description":"Former Australian cricket captain Michael Clarke has broken down on live television over the death of his best mate Shane Warne. Just days after the spin king was found dead of a heart attack at his Koh Samui villa in Thailand, Clarke said he doesn’t know if he could ever say goodbye to his former teammate. When asked how he would confront the moment, Clarke went silent as he fought back tears. “No more crying … my God,” he said on Today. “It will be hard … I’m sure he will get the send off that he deserves but I don’t think I will ever say goodbye.” Like most Australians, Clarke said he was in “absolute shock” when he was given the news early Saturday morning. The pair had even made plans to catch up when Warne returned from his much-needed break. Clarke said he had spoken to Warne about his health just moments before he stepped onto the flight. “I remember when I got a phone call from Helen early in the morning on Saturday, I thought there might have been a bit of confusion, like a journalist might have said Warnie’s name when they really meant Rod Marsh,” Clarke confessed. “It took me some time to believe it was real.” Clarke revealed that he had spoken to Warne about his health just before he stepped on the plane to go to Thailand. “It’s still such a shock, obviously extremely raw,” he said. “I was lucky enough to play cricket alongside my role model, my idol, my inspiration, and then to build a friendship and just go through the highs and lows of life.” The former Australian captain said the statements issued by Warne’s family were “heart-wrenching”. Clarke described his former teammate as a “great dad” who had an “honest and raw” relationship with his children. “Warnie made sure, without fail, to contact his kids and even though he might not have been under the same roof, he was always there for them, he just spent so much time with them,” Clarke said. “He never expected or wanted them to do anything particular, it was more just enjoy life. “He enjoyed the journey.” Thai authorities on Monday confirmed Warne died of natural causes. “Investigators received the autopsy result, in which the medical opinion is that the cause of death is natural,” deputy national police spokesman Kissana Phathanacharoen said, according to Channel News Asia. “Investigators will summarise the autopsy result for prosecutors within the time frame of the law.” Warne died of a suspected heart attack at a luxury resort villa where he was staying with three friends on Friday night. Those that were with him attempted to conduct CPR after finding him unresponsive and called an ambulance. As Australians, and the global cricket community reeled from the shock news of Warne’s death, he was moved on Sunday from Koh Samui hospital to a larger hospital capable of carrying out an autopsy. After reaching the mainland, the ambulance travelled to a hospital in the town of Surat Thani, where doctors conducted the procedure to determine the exact cause of death. His body is set to be sent back to Australia on Tuesday.","image_url":"https://images.perthnow.com.au/publication/C-5971094/f7294abdc105823f0ea9f4b95ebed365ab3ce76f-16x9-x0y0w1655h931.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Why Clarke broke down about Warne","link":"https://www.news.com.au/sport/cricket/no-more-crying-michael-clarke-doesnt-know-how-he-will-say-goodbye-to-shane-warne/news-story/52a35c82cac00ebe93fc1e6477d48b58","keywords":null,"creator":null,"video_url":null,"description":"Former Australian cricket captain Michael Clarke has broken down on live television over the death of his best mate Shane Warne.","content":null,"pubDate":"2022-03-07 21:36:00","full_description":"Former Australian cricket captain Michael Clarke has broken down on live television over the death of his best mate Shane Warne. Just days after the spin king was found dead of a heart attack at his Koh Samui villa in Thailand, Clarke said he doesn’t know if he could ever say goodbye to his former teammate. When asked how he would confront the moment, Clarke went silent as he fought back tears. “No more crying … my God,” he said on Today. “It will be hard … I’m sure he will get the send off that he deserves but I don’t think I will ever say goodbye.” Michael Clarke reveals he had spoken to Shane Warne about his health in the days before his passing, shares his favourite Warnie memory, and how he is confronting saying goodbye to his great mate. #9Today pic.twitter.com/BESevWQaRO Like most Australians, Clarke said he was in “absolute shock” when he was given the news early Saturday morning. The pair had even made plans to catch up when Warne returned from his much-needed break. Clarke said he had spoken to Warne about his health just moments before he stepped onto the flight. “I remember when I got a phone call from Helen early in the morning on Saturday, I thought there might have been a bit of confusion, like a journalist might have said Warnie’s name when they really meant Rod Marsh,” Clarke confessed. “It took me some time to believe it was real.” Clarke revealed that he had spoken to Warne about his health just before he stepped on the plane to go to Thailand. “It’s still such a shock, obviously extremely raw,” he said. “I was lucky enough to play cricket alongside my role model, my idol, my inspiration, and then to build a friendship and just go through the highs and lows of life.” The former Australian captain said the statements issued by Warne’s family were “heart-wrenching”. Clarke described his former teammate as a “great dad” who had an “honest and raw” relationship with his children. “Warnie made sure, without fail, to contact his kids and even though he might not have been under the same roof, he was always there for them, he just spent so much time with them,” Clarke said. “He never expected or wanted them to do anything particular, it was more just enjoy life. “He enjoyed the journey.” Thai authorities on Monday confirmed Warne died of natural causes. “Investigators received the autopsy result, in which the medical opinion is that the cause of death is natural,” deputy national police spokesman Kissana Phathanacharoen said, according to Channel News Asia. “Investigators will summarise the autopsy result for prosecutors within the time frame of the law.” Warne died of a suspected heart attack at a luxury resort villa where he was staying with three friends on Friday night. Those that were with him attempted to conduct CPR after finding him unresponsive and called an ambulance. As Australians, and the global cricket community reeled from the shock news of Warne’s death, he was moved on Sunday from Koh Samui hospital to a larger hospital capable of carrying out an autopsy. After reaching the mainland, the ambulance travelled to a hospital in the town of Surat Thani, where doctors conducted the procedure to determine the exact cause of death. His body is set to be sent back to Australia on Tuesday. Originally published as ‘No more crying’: Michael Clarke doesn’t know how he will say goodbye to Shane Warne He’s one of Australia’s greatest ever players who tormented the old enemy for decades but he had a bold bid to take Australia down. A friend has shared the last photo ever taken of Shane Warne while the cricket icon was still alive as more details emerge about his final hours. Many of Shane Warne’s quiet – and prolific – acts of kindness have come to light after his untimely death at the age of 52.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Smith falls late on Day 4 as draw looms","link":"https://www.news.com.au/sport/cricket/smith-falls-late-on-day-4-as-draw-looms/video/d10fc3c9a53b83a4040145a5a1017fc9","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Steve Smith faced the majority of action on Day 4, before he was dismissed for 78 as the Test looks certain to wind up as a draw.","content":null,"pubDate":"2022-03-07 20:45:17","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"This ball prompted Rod Marsh to call Shane Warne","link":"https://wwos.nine.com.au/cricket/shane-warne-death-richie-richardson-flipper-west-indies-1992-rod-marsh/699467cb-e3d3-4824-9743-20ca001b18d5","keywords":null,"creator":["wwos"],"video_url":null,"description":"It's one of Shane Warne's most famous dismissals in Australia, and it prompted a phone call that's eerily spooky 30 years later.","content":"Shane Warne's leg-spinner to remove Mike Gatting at Old Trafford in 1993 may have been the Ball of the Century, but it was a dismissal six months earlier that marked the Victorian as a player to watch.It was Warne's first Boxing Day Test, and his first match for Australia at his beloved MCG.With West Indies 1-143 on the final day of the second Test in 1992-93, the match seemed headed for a draw, before Warne produced one of the most famous balls he bowled on Australian soil, although there's no shortage of competition for that honour.READ MORE: Bill Lawry's tribute to Shane WarneREAD MORE: Sly move lights up first TestREAD MORE: Dragons snub gun pairRichardson played back to a short-pitched ball, and was completely deceived as the ball hurried through and crashed into off-stump.\"I knocked them over with my flipper - the one to Richie Richardson was about the best I ever bowled,\" Warne wrote in his autobiography, No Spin.\"Everything clicked, it felt like magic.\"At the start of that day, Warne's Test career record was an unflattering five wickets at 90.20, but he finished with 7-52, as the West Indies lost 9-76 to crash to defeat by 139 runs.As Warne wrote in his book, the day ended with what is now an eerie co-incidence, when former Australian wicket-keeper Rod Marsh rang to congratulate the 23-year-old.Warne had presented Marsh and Terry Jenner with a bottle of red wine to thank them for their help the previous winter when he'd been preparing for a tour of Sri Lanka, and they'd both promised to open the wine at an appropriate time.Tragically, Warne and Marsh both died on the same day nearly 30 years later.\"Rod rang the MCG dressing room after that victory and said he was at home drinking the red I'd given him,\" Warne wrote.\"It was wonderful of him to call.\"Australia's 12th man for that match, Greg Matthews, went and found Warne's father, Keith, and brought him to the Australian dressing room to celebrate Warne's career-turning haul.\"I thought it was important for his father to be part of it, and to share the moment with his son and enjoy it,\" Matthews told Wide World of Sports.\"Those kind of moments are so rare, people didn't tend to get into the dressing room so much in those days, but I thought it had to be done.\"I went and grabbed him and said, 'Come and have a beer with your boy'.\"Mark Taylor was standing at first slip when Warne dismissed Richardson, and told Wide World of Sports that the dismissal was probably the first time the Australian public had seen something special from the leg-spinner.\"That's a fair call,\" Taylor told Wide World of Sports.\"A few of us had been to Zimbabwe a year earlier, and Warnie's flipper, when we first saw it, was just awesome.\"It actually swung back into the right handers. You'd see it short out of the hand and think it was going to be a long hop.\"It certainly confused and deceived Richie, if you look at his reaction he's thinking, 'What was that?'\"Taylor noted that the Warne flipper of the early 1990s was deadly for those players who hadn't faced him previously.\"It was pickable for sure, but then again I saw a lot of it. But those who hadn't seen him before had no idea,\" he explained.\"It was a lethal delivery, and I don't think world cricket had seen a flipper like that for years. Trevor Hohns bowled one, but I don't think he'll mind me saying that it wasn't as lethal as Warnie's.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-07 20:28:29","full_description":"Shane Warne 's leg-spinner to remove Mike Gatting at Old Trafford in 1993 may have been the Ball of the Century , but it was a dismissal six months earlier that marked the Victorian as a player to watch. It was Warne's first Boxing Day Test, and his first match for Australia at his beloved MCG . With West Indies 1-143 on the final day of the second Test in 1992-93, the match seemed headed for a draw, before Warne produced one of the most famous balls he bowled on Australian soil, although there's no shortage of competition for that honour. READ MORE: Bill Lawry's tribute to Shane Warne READ MORE: Sly move lights up first Test READ MORE: Dragons snub gun pair Richardson played back to a short-pitched ball, and was completely deceived as the ball hurried through and crashed into off-stump. \"I knocked them over with my flipper - the one to Richie Richardson was about the best I ever bowled,\" Warne wrote in his autobiography, No Spin. \"Everything clicked, it felt like magic.\" At the start of that day, Warne's Test career record was an unflattering five wickets at 90.20, but he finished with 7-52, as the West Indies lost 9-76 to crash to defeat by 139 runs. As Warne wrote in his book, the day ended with what is now an eerie co-incidence, when former Australian wicket-keeper Rod Marsh rang to congratulate the 23-year-old. Warne had presented Marsh and Terry Jenner with a bottle of red wine to thank them for their help the previous winter when he'd been preparing for a tour of Sri Lanka, and they'd both promised to open the wine at an appropriate time. Tragically, Warne and Marsh both died on the same day nearly 30 years later. \"Rod rang the MCG dressing room after that victory and said he was at home drinking the red I'd given him,\" Warne wrote. \"It was wonderful of him to call.\" Australia's 12th man for that match, Greg Matthews, went and found Warne's father, Keith, and brought him to the Australian dressing room to celebrate Warne's career-turning haul. \"I thought it was important for his father to be part of it, and to share the moment with his son and enjoy it,\" Matthews told Wide World of Sports. \"Those kind of moments are so rare, people didn't tend to get into the dressing room so much in those days, but I thought it had to be done. \"I went and grabbed him and said, 'Come and have a beer with your boy'.\" Mark Taylor was standing at first slip when Warne dismissed Richardson, and told Wide World of Sports that the dismissal was probably the first time the Australian public had seen something special from the leg-spinner. \"That's a fair call,\" Taylor told Wide World of Sports. \"A few of us had been to Zimbabwe a year earlier, and Warnie's flipper, when we first saw it, was just awesome. \"It actually swung back into the right handers. You'd see it short out of the hand and think it was going to be a long hop. \"It certainly confused and deceived Richie, if you look at his reaction he's thinking, 'What was that?'\" Taylor noted that the Warne flipper of the early 1990s was deadly for those players who hadn't faced him previously. \"It was pickable for sure, but then again I saw a lot of it. But those who hadn't seen him before had no idea,\" he explained. \"It was a lethal delivery, and I don't think world cricket had seen a flipper like that for years. Trevor Hohns bowled one, but I don't think he'll mind me saying that it wasn't as lethal as Warnie's.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/415227/raw-capture-sequence_sub_01.05_01_38_16.still032.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Last photo ever taken of Shane Warne","link":"https://www.news.com.au/sport/cricket/last-photo-ever-taken-of-shane-warne-shared-on-social-media/news-story/ddde2c2a02031c1dda3544bbbb1bc5da","keywords":null,"creator":null,"video_url":null,"description":"A friend has shared the final photo taken of Shane Warne while the cricket legend was still alive.","content":null,"pubDate":"2022-03-07 19:59:00","full_description":"A friend has shared the final photo taken of Shane Warne while the cricket legend was still alive. Warne’s close friend Thomas Hall shared a photo taken of Warne in Koh Samui, Thailand, where he died of a heart attack on Saturday morning (AEDT). The photo of a smiling, effervescent Warne seems a fitting reflection of the national treasure who is being so warmly remembered across the globe. Thai police confirmed on Monday night an autopsy at the Surat Thani Hospital found Warne died of natural causes . The Warne family has reportedly been angered at photos being taken of Warne’s body and a potential security breach which is being investigated by Thai authorities. The ABC reports a German woman was able to enter an ambulance carrying Warne’s body and spend over half a minute alone in the vehicle. The moment was captured on camera. Footage shows the woman carrying a small bunch of flowers and approaching the ambulance which was transporting Warne’s body from Koh Samui where he died, via ferry to the mainland. Details about Warne’s final hours are continuing to emerge. Hall’s photo was posted on Instagram on Friday, hours before Warne’s death. A masseuse had visited Warne on Friday but police were not clear on what time of the day. According to The Daily Mail , four women, identified as masseuses, were the last to see Warne alive. Around 5.15pm he was found face down on his bed after a suspected heart attack by close friend Andrew Neophitou, who was an executive producer on a recently released documentary on Warne’s life. The first day of the Test match between Australian and Pakistan was playing on the television in his room. His friends attempted to perform CPR before an ambulance arrived before he was pronounced dead on arrival at a nearby hospital. Thai Police ruled out foul play and confirmed details about the chest pains Warne experienced prior to his death. Police Colonel Yuthana Sirisombat told reporters on Saturday night his family had informed them of the late cricket legend’s history of heart disease and asthma and their concern about his health before he left Australia last week. The 52-year-old had recently “seen a doctor about his heart”, Sirisombat said. Colonel Sirisombat said it was these family revelations — and a review of CCTV footage — that led police to rule out any foul play in the father-of-three’s death. Hall, meanwhile, also shared details of his getaway with Warne, including the fact the Victorian’s final meal was vegemite on toast. Aussie test great Damien Martyn commented on an Instagram photo showing a jar of vegemite which was posted by Hall on Monday: “The picture says it all. Last meal and true to the end. Hope all okay up there as good as one can be after this happening”. Hall, who met Warne about 15 years ago at a charity poker tournament and remained close ever since, penned an article on The Sporting News — which he is CEO of — paying tribute to the leg-spinner and detailing the last moments they shared together. On Monday evening, members of Warne’s family issued heartfelt tributes honouring the cricket icon after his shock death. Shane’s parents, Keith and Brigitte, his brother Jason, his children, Jackson, Summer and Brooke and his ex-wife, Simone, each released statements on Monday evening. Keith and Brigitte described the past three days as a “never-ending nightmare” for the Warne family, while Jason called it a “truly heartbreaking” ordeal. Jackson vowed to “try and be happy” after his father’s sudden passing, while Summer described Shane as “the best dad someone could ever ask for”. Simone offered the briefest statement, sharing a powerful quote: “Who bring a light so great to the world that even after they have gone the light remains.” Many of Shane Warne’s quiet – and prolific – acts of kindness have come to light after his untimely death at the age of 52. Russell Crowe posted a moving farewell tribute to Shane Warne overnight, revealing one of their last dinners together. Australian vice-captain Steve Smith looked destined for a long-awaited Test century before his bizarre dismissal ended his knock.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"}]}