{"newsArray":[{"title":"The day the Ashes went up in smoke: Boycott can't watch Brook's horror shot, Broad is sent for X-ray","link":"https://www.dailymail.co.uk/sport/cricket/article-12252549/The-day-Ashes-went-smoke-Boycott-watch-Brooks-horror-shot-Broad-sent-X-ray.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"AADAM PATEL AND RICHARD GIBSON AT LORD'S: England's Ashes hopes were hanging by a thread on Friday night after a shocking batting display saw them lose their last six first-innings wickets for 46","content":"The day the Ashes went up in smoke: Boycott can't watch Brook's horror shot, Broad is sent for jaw X-ray and Pope is left 'bewildered' as he is forced to field Harry Brook spliced a short ball from Mitchell Starc straight to Pat Cummins Spin bowling coach Jeetan Patel insisted that his England side had no regrets Re-live the action as England collapse to hand Australia the advantage at Lord's By Aadam Patel and Richard Gibson for the Daily Mail Published: 21:38, 30 June 2023 | Updated: 23:19, 30 June 2023 e-mail 26 View comments England's Ashes hopes were hanging by a thread on Friday night after a shocking batting display saw them lose their last six first-innings wickets for 46 before Australia reached 130 for two, a lead of 221. The mood inside Lord's was summed up by Sir Geoffrey Boycott's reaction to Harry Brook's dismissal as the Yorkshireman spliced a short ball from Mitchell Starc straight to Pat Cummins at cover. To add to their woes, Stuart Broad was sent for an X-ray on his jaw after being hit by a Cameron Green bouncer. The decision was made because of the level of swelling on his jawline. However, England said it was precautionary and they expect the seamer back playing on Saturday. England spin bowling coach Jeetan Patel insisted Ben Stokes' side had no regrets about the way they played and they were confident of chasing whatever was required in the fourth innings to level the series. The era of Bazball began last summer with England becoming the first team to successfully chase 250 or more in four consecutive Tests. Stuart Broad was sent for an X-ray after taking a Cameron Green delivery to his jaw on Friday Geoffrey Boycott was unable to watch as Harry Brook played a horror shot to end his innings 'We've always said we want to play an aggressive brand. It's not always going to come off and that's not a cop-out, that's just reality,' said Patel. 'We've seen some amazing things from this team. It's going to be a different ask against a different attack, but we've seen some crazy things from this line-up. This team is about breaking records. They want to set new standards. They want to sell out grounds and the way to do that is to bowl Australia out tomorrow, set the ground alight and chase whatever it is down.' England's frustrations on a grim day at Lord's were further compounded when vice-captain Ollie Pope, nursing a shoulder injury, was told by the umpires to field if he wanted to carry on batting at No 3 in England's second innings. Pope returned to the field at the start of Australia's second innings but sustained a recurrence of his shoulder injury and came off. The umpires confirmed it was a fresh external injury and he could stay off the field for the remainder of Australia's innings, but still bat in his regular position of 3. Ollie Pope picked up an injury to his shoulder after he was originally forced to field by umpires if he wanted to keep his spot at No 3 in the fourth innings, leaving England coaches furious 'We're a bit bewildered by it all,' said Patel. 'It's a pretty tough situation when you nearly bust your shoulder. But then he goes out and bats the way he did and the officials may have changed their decision on how he affects the game. So he had to go back out there. 'He's so committed to this team he was always going to fall on something and now he's back off the field icing his shoulder. He's probably more angry at the situation than anyone else. 'But he's a good kid and we know he's going to rock up tomorrow with a smile on his face. 'He's never going to turn down batting for England and with an opportunity to win a game, I can't see Ollie saying no to that.' Share or comment on this article: The day the Ashes went up in smoke: Boycott can't watch Brook's horror shot, Broad is sent for X-ray e-mail Add comment Comments 27 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-30 22:19:37","image_url":"https://i.dailymail.co.uk/1s/2023/06/30/22/72731551-0-image-a-95_1688160385580.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Australian cricket legend Border reveals he has Parkinson's","link":"https://www.news24.com/sport/Cricket/australian-cricket-legend-border-reveals-he-has-parkinsons-20230630","keywords":null,"creator":null,"video_url":null,"description":"Former captain Allan Border revealed on Friday he is suffering from Parkinson's disease, the latest blow to befall former Australian cricketing legends in the past three years.","content":"Former captain Allan Border revealed on Friday he is suffering from Parkinson's disease, the latest blow to befall former Australian cricketing legends in the past three years. The 68-year-old has gone public seven years after being diagnosed with the illness and said he and a doctor friend both agreed it would be \"a miracle\" if he makes 80. \"No way am I going to get another 100, that's for sure,\" Border told Newscorp. \"I'll just slip slowly into the west.\" Border had told only one person of his diagnosis: former team-mate Dean Jones, who died of a heart attack in 2020. Jones was the precursor of a terrible time for Australian cricket. Former wicketkeeper Rod Marsh and spin king Shane Warne died within days of each other in March 2022, both from heart attacks. Two months later Andrew Symonds - a member of two World Cup-winning sides - was killed in a car crash. Border, who spoke at Warne's memorial service, said he had been happy to keep the news to himself over the past seven years but a friend had told him last week many of his close associates had noticed his shaking. \"I'm a pretty private person and I didn't want people to feel sorry for me sort of thing,\" he said. \"Whether people care you don't know. But I know there'll come a day when people will notice.\" Border, though, showing the same rugged determination that he had as skipper - yielding the 1987 World Cup and an Ashes series win over England in 1989 - said he was in a better place than many other people. \"I get the feeling I'm a hell of a lot better off than most,\" said Border, who scored 27 centuries and 63 half-centuries in 156 Tests. \"At the moment I'm not scared, not about the immediate future anyway. \"I'm 68. If I make 80, that'll be a miracle. \"I've got a doctor friend and I said if I make 80, that'll be a miracle, and he said, 'That will be a miracle.'\" Australia paceman Mitchell Starc paid tribute to Border after the close of the third day's play in the second Ashes Test at Lord's on Friday. \"It's sad to hear,\" he said. \"He's one of the greats of Australian cricket and certainly a big character in world cricket. \"Our wishes go to AB and his family as well.\"","pubDate":"2023-06-30 21:11:59","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"‘I told you’: Broad fumes at Stokes over DRS bungle as cocky celebrappeal habit backfires","link":"https://www.foxsports.com.au/cricket/the-ashes/you-have-to-actually-ask-the-umpire-stuart-broads-celebrappeal-habit-backfires/news-story/f6ec72dc84a5632a9ace98ffb0146e6e","keywords":null,"creator":null,"video_url":null,"description":"The boy who cried “Howzat” …","content":"The boy who cried “Howzat” … England veteran Stuart Broad was thrice denied a wicket against Marnus Labuschagne on day three of the Lord’s Test against Australia , with his trademark celebrappeal backfiring on Friday afternoon. On the penultimate delivery of the afternoon session in London, Labuschagne flashed at a wide delivery from Broad that sailed through to England wicketkeeper Jonny Bairstow. Broad sprinted towards the slips cordon with a raised finger, high-fiving teammate Joe Root before turning around and realising umpire Chris Gaffaney was unmoved at the non-striker’s end. DAY 3 WRAP: Bazball implodes amid frantic collapse as steady Aussies cash-in on Lord’s shambles TALKING POINTS: Poms shredded for ‘kamikaze cricket’; Aussie duo ‘absolutely bossed it’ Root and Broad pleaded with captain Ben Stokes, begging for him to review the decision — but the England skipper wisely elected not to, with replays showing Labuschagne had hit the ground. The following delivery, Broad hooped an inswinger into Labuschagne’s front pad, and the 37-year-old once again charged down the pitch before spinning around — but Gaffaney was unconvinced. Stokes shook his head when asked about the review, and Hawkeye showed the ball was comfortably missing leg stump. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! Stuart Broad of England reacts after Marnus Labuschagne of Australia is given not out. Photo by Ryan Pierse/Getty Images Source: Getty Images READ MORE ‘F***ING STUPID’: England star torched over horrific dismissal ‘HE COULD JUST TELL’: Aussie legend opens up on Parkinson’s diagnosis After the tea break, Broad once again trapped Labuschagne on the pads with a well-directed inswinger, jogging through to the striker’s end before eventually turning back towards an unimpressed Gaffaney. “It would help from time to time to actually appeal to the umpire,” former England opener Michael Atherton grumbled on Sky Sports commentary. Former England captain Nasser Hussain laughed: “You have to actually ask the umpire, Stuart.” In a moment of deja vu, Stokes refused to signal for a review, believing the delivery was sliding down leg, and a frustrated Broad begrudgingly walked back to the top of his mark. But when the right-armer looked up towards the balcony, England coach Brendon McCullum raised his index finger, indicating red lights had appeared on Hawkeye and the decision would have been overturned if England reviewed. Broad looked dumbfounded, burying his head in his hands before yelling at his captain: “I told you it was out. I told you.” Labuschagne, who was dismissed by Broad twice during the Edgbaston Test, had been gifted a reprieve on 16 but couldn’t make the most of his extra life, falling victim to James Anderson a few overs later for 30.","pubDate":"2023-06-30 21:08:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"OLIVER HOLT: So sad to lose faith in Bazball at the very first signs of adversity as England falter","link":"https://www.dailymail.co.uk/sport/cricket/article-12252615/OLIVER-HOLT-sad-lose-faith-Bazball-signs-adversity-England-falter.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"OLIVER HOLT: As England trudged slowly back to the pavilion, reeling from the events of the morning, the soldiers of the British Army Band Tidworth took up position in front of the Grand Stand","content":"OLIVER HOLT: So sad to lose faith in Bazball at the very first signs of adversity as England falter on day three but there's no going back now England lost their last six wickets for 46 runs in the morning session at Lord's There were undeniably moments when their batters looked like lemmings Re-live a frustrating day three for England after being bowled out for just 325 By Oliver Holt For The Daily Mail Published: 22:05, 30 June 2023 | Updated: 22:30, 30 June 2023 e-mail 4 View comments As England’s players trudged slowly back to the pavilion at lunch , reeling from the events of the morning they had left behind , the soldiers of the British Army Band Tidworth took up position in front of the Grand Stand and raised their instruments to their lips. After a little while, they marched around to the Warner Stand and performed there, too. And then past the pavilion to station themselves in front of the Tavern Stand and the Mound Stand until they arrived beneath the Media Centre, that digital alarm clock in the sky. Gazing down on them, David Lloyd, the former England opener , England coach and commentator beyond compare, neatly articulated the sinking feeling so many of the supporters inside Lord’s were feeling. ‘And the band played on,’ he said. It had been a sobering passage of play that had reduced the Home of Cricket to a sullen silence. England had lost their last six wickets for 46 runs and the manner of some of the dismissals had led to the now familiar chorus of wailing and gnashing of teeth from the keepers of the flame. There were moments, undeniably, when England’s batsmen had looked like lemmings rushing towards a cliff as Australia’s bowlers peppered them with a barrage of short deliveries. They did not shirk the challenge. They swung for the fences and, generally, they missed. Australia picked up England's final six wickets at the cost of just 46 runs on Friday morning England kept to their attacking philosophy by swinging for the fences but generally they missed It would be sad if faith were lost in Brendon McCullum's Bazball now at the very first sign of adversity Exhibit A was Harry Brook stepping away from his stumps and aiming a wild, mistimed, cross-batted slash at a short delivery from Mitchell Starc, watching it loop in a lazy arc softly into the hands of Pat Cummins at extra cover. Jonny Bairstow chipped a tame catch to mid-on. Ollie Robinson charged down the wicket to makeshift spinner Travis Head and edged him into the hands of wicketkeeper Alex Carey and, after that, the end came quickly. England had made 325, 91 short of Australia’s first innings total, when they had started the day aiming for parity at least. By the end of the day, Australia had a lead comfortably north of 200. It felt as if that morning session might have been pivotal in the match and perhaps this Ashes series as a whole. As England struggle to keep pace with this formidable Australian team in a breathless sequence of Tests crammed into June and July, their continued embrace of a more aggressive style of cricket has exposed and exacerbated deep fault-lines and insecurities within the English game and those who love and cherish it. England had a bad session on Friday morning. It happens. After 11 wins in their previous 14 games, they were probably due one. But the alacrity with which the mass of opinion pounced on it, and sought to portray it as an apocalypse for Bazball, hinted at something deeper than disappointment about a few rash shots. It feels as if there is a fear among some cricket fans that Brendon McCullum, the England coach, and skipper Ben Stokes are fifth columnists who are colonising the Test game on behalf of the limited overs format. ‘I’ve enjoyed Bazball as much as the next person,’ a reader called John texted in to the BBC website, ‘but enough. This obsessive, aggressive, kamikaze batting has to be toned down. So disappointing to see England throwing it away.’ In an era of the sport when white-ball cricket is gaining more and more territory and time, and more traction among younger followers, when there is talk of the best limited overs players being contracted all year round by franchises with teams in leagues in India, Saudi Arabia and the USA, the desire to preserve the more measured, cerebral, strategic form of the game, unpolluted by limited overs ideology, feels stronger than ever. England and Yorkshire legend Geoffrey Boycott was unable to watch as Harry Brook played a horror shot Brook aimed a wild slash at a Mitchell Starc ball which looped softly into the hands of Pat Cummins Traditionalists are suspicious of England’s new style of play. They think it is a gimmick and they think it is disrespectful of Test cricket. They think it is naive. They think it rather vulgar. The reality, of course, is that it is a breathtakingly bold version of Test cricket that is the best hope of the game, in this form, surviving. And guess what? England will not excel in every session of every game playing it. Sometimes, like on Friday morning, it will make them look foolish and reckless. Sometimes, horror of horrors, they might even lose a match here and there. But when they get the mix of aggression and caution right, the sport they provide is peerless. So, yes, Brook’s dismissal looked ugly and distinctly ‘village’, but he had scored a half-century playing that way by then. Starc, Cummins and Josh Hazlewood were bowling brilliantly and the ball was moving around under leaden skies, so perhaps Brook figured the risk was worthwhile. Perhaps he decided he would rather lose his wicket trying to take the game to the opponents than trying to lean into a forward defensive prod and edging a delivery behind. In the new puritanical spirit pushing back against Bazball, losing your wicket to a poor defensive shot is far more preferable than losing it trying to attack. Oh for the times when England scored at less than three an over, were paralysed by caution and doubt, had no clear philosophy and looked frightened to play their shots and trust their talent. They went on a run of 17 Test matches where they only won once. Those were the days. There are times, of course, when this England team need to refine their approach. McCullum's approach has already contributed to one of the greatest Tests of all time in the first meeting at Edgbaston Australia's attack featuring Josh Hazlewood and Cummins (pictured) bowled well on Friday They need to choose their moments to go hard, as they did in the Tests of last summer. Australia were always going to present the toughest challenge to England’s new philosophy because they are the best Test team in the world. But it would be sad if faith were lost in Bazball now, at the very first sign of adversity, and we followed the urgings of men like jilted John. This summer, it has already helped to conjure the epic contest at Edgbaston, widely considered to be one of the greatest Test matches of all time. There is no reason to change tack. There is no going back. Share or comment on this article: OLIVER HOLT: So sad to lose faith in Bazball at the very first signs of adversity as England falter e-mail Add comment Comments 4 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-30 21:05:25","image_url":"https://i.dailymail.co.uk/1s/2023/06/30/22/72729879-0-image-a-35_1688159057393.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australians seize control of Ashes Test after near-perfect day three at Lord’s","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2023-cricket-scores-australia-vs-england-second-test-at-lords-day-three-live-updates-news-weather/news-story/f323de9e601114377bd7b7675b76e7e7","keywords":null,"creator":null,"video_url":null,"description":"Australia has seized control of the Lord’s Ashes Test after a frantic England collapse and another disciplined knock from opener Usman Khawaja headlined day three at St John’s Wood.","content":"Australia has seized control of the Lord’s Ashes Test after a frantic England collapse and another disciplined knock from opener Usman Khawaja headlined day three at St John’s Wood. England lost 6-47 during an eventful morning session, bowled out for 325 to give Australia a 91-run first-innings lead. In response, the visitors cruised towards 2-130 before rain forced a premature close to play, with Khawaja (58*) and Steve Smith (6*) unbeaten at stumps. England shot themselves in the foot on Friday afternoon with a dropped catch, which gifted Khawaja an extra life on 19, and an ill-judged non-review that denied Stuart Broad a much-needed wicket. Australia currently leads by 221 runs, and England requires nothing less than a herculean effort in the fourth innings to prevent Pat Cummins’ side from taking a 2-0 lead in the five-match series. TALKING POINTS: Poms shredded for ‘kamikaze cricket’; Aussie duo ‘absolutely bossed it’ ‘YOU HAVE TO ACTUALLY ASK THE UMPIRE’: Broad’s celebrappeal habit backfires MATCH CENTRE: England vs Australia stats, scorecard Earlier, Nathan Lyon arrived at Lord’s on crutches, with Cricket Australia confirming the veteran spinner has suffered a “significant calf strain” , putting his availability for the remainder of the series under severe doubt. After resuming day three at 4-278, England lost their remaining six wickets in less than 90 minutes, with paceman Mitchell Starc and part-time spinner Travis Head each snaring two wickets. Having patiently guided England to stumps the previous evening, Ben Stokes fell for 17 on the second delivery of the day after Starc found the England captain’s leading edge, with Cameron Green taking yet another superb catch at gully. Stokes sent walking from second ball! | 00:28 Harry Brook, who was dropped by Marnus Labuschagne the previous evening, brought up his maiden Ashes half-century in 63 deliveries — but couldn’t convert the start into a substantial score, departing for 50. The 24-year-old backed away and awkwardly swatted at a Starc bouncer, gifting rival captain Pat Cummins a regulation catch at extra cover — it was an ugly dismissal that exposed England’s long tail. Brook gone with VERY questionable shot | 00:32 Immediately after the drinks break, wicketkeeper Jonny Bairstow, England’s last recognised batter, attempted a lofted drive against Josh Hazlewood, instead chipping a chance towards Cummins at mid-on. Soon after, Green delivered a brutal bouncer that struck Broad near the jaw, but thankfully the Englishman avoided serious damage. Ollie Robinson was the next to depart, skipping down the pitch at Head and nicking behind to wicketkeeper Alex Carey, who claimed his umpteenth classy catch of the series. Head struck again later in the same over, trapping a sweeping Broad on the pads for 12 — a desperate review couldn’t save the Nighthawk. Cummins wrapped up the innings with a well-directed bouncer at Josh Tongue, which was fended towards substitute fielder Matthew Renshaw at short leg for 1. After dominating day two, England had slipped from 1-188 to 325 all out, swinging momentum firmly back in Australia’s favour. Travis Head of Australia appeals. Photo by Stu Forster/Getty Images Source: Getty Images Australian openers David Warner and Khawaja survived a nervy 20-minute passage of play before lunch — the floodlights needed to be switched on after dark clouds descended on the iconic venue. James Anderson thought he had unearthed a breakthrough early in the afternoon session, reviewing an LBW decision against Warner — but replays showed a thick inside edge onto the pads. The introduction of Josh Tongue almost did the trick for England, but Khawaja’s pull shot burst through Anderson’s hands at square leg and raced away for a boundary — it was the only chance he offered on day three. After a 63-run opening partnership, Tongue nipped a delivery into Warner’s pads from around the wicket, with the veteran batter wasting a review before trudging back to the sheds for 25. Tongue almost knocked over Marnus Labuschagne in his following over, with umpire Ahsan Raza giving the Australian No. 3 out LBW — only for the decision to be overturned when Hawkeye showed that impact was outside off. Labuschagne survived the final two deliveries before the tea break, with Broad’s back-to-back celebrappeals for caught behind and LBW failing to convince umpire Chris Gaffaney. Stokes wisely elected not to review either decision. It was third time’s the charm for Broad — after the lunch break, the England veteran trapped Labuschagne on the pads, sprinting towards the slips cordon without consulting Gaffaney, who didn’t raise the dreaded finger. Stokes once again denied the review — but on this occasion, Hawkeye suggested the ball would have crashed into leg stump, with Labuschagne surviving on 15. Stuart Broad of England. Photo by Ryan Pierse/Getty Images Source: Getty Images The Queenslander couldn’t make the most of his reprieve, lazily cutting a loose delivery from Anderson towards point and departing for 30. Khawaja reached fifty for the third time in the series with an elegant straight drive down the ground before rain intervened, forcing a premature end to proceedings in London. Despite the weather interruption, it was a near-perfect day for the Australians, who will look to extend their lead before hunting the ten wickets required for victory — albeit without Lyon at their disposal.","pubDate":"2023-06-30 20:59:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"England shredded for ‘kamikaze cricket’; Australian openers ‘absolutely bossed it’ — Lord’s Ashes Test Day 3 Talking Points","link":"https://www.foxsports.com.au/cricket/the-ashes/england-shredded-for-kamikaze-cricket-australian-openers-absolutely-bossed-it-lords-ashes-test-day-3-talking-points/news-story/21e216b5bf9f677b0d1ff856b564e6da","keywords":null,"creator":null,"video_url":null,"description":"Australia has edged ahead in the second Ashes Test after a rain-affected third day at Lord’s, with England needing another fourth-innings miracle to prevent Pat Cummins’ side from taking a 2-0 series lead.","content":"Australia has edged ahead in the second Ashes Test after a rain-affected third day at Lord’s, with England needing another fourth-innings miracle to prevent Pat Cummins’ side from taking a 2-0 series lead. The hosts were bowled out for 325 after a frantic collapse of 6-47 on Friday morning , giving Australia a 91-run first-innings lead in London. In response, the visitors cruised towards 2-130 at stumps, leading by 221 runs, with opener Usman Khawaja (58*) and vice-captain Steve Smith (6*) unbeaten overnight. Australia will look to extend its lead before hunting the ten wickets required for victory — albeit without veteran spinner Nathan Lyon at their disposal . These are the Talking Points from day three at Lord’s. DAY 3 WRAP: Aussies seize control after near-perfect day as blunders shatter England’s hopes ‘YOU HAVE TO ACTUALLY ASK THE UMPIRE’: Broad’s celebrappeal habit backfires ENGLAND SHREDDED FOR ‘KAMIKAZE CRICKET’ ‘Bazball’ isn’t foolproof, and on Friday morning, we saw what happens when England’s attacking approach to Test cricket backfires. The hosts failed to take advantage of the batter-friendly conditions in the first innings of the Lord’s Test, sacrificing a potential lead after collapsing early on day three. It was a bitterly disappointing result for England, who were cruising at 1-188 on Thursday evening when Nathan Lyon left the field with injury. Ben Stokes and his teammates had an opportunity to grind Australia’s quicks into the dirt after the veteran spinner’s setback, but instead threw their wicket away and crumbled in a heap. England’s top-order shot themselves in the foot by repeatedly attacking bouncers despite a cluster of fielders waiting behind square. Harry Brook’s dismissal was particularly reckless — after racing towards 50, he backed away from a Mitchell Starc bouncer and awkwardly spooned it towards rival captain Pat Cummins at extra cover. England legend Geoffrey Boycott shook his head in bemusement from the stands. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! Brook gone with VERY questionable shot | 00:32 “England clearly like losing,” former captain Michael Vaughan said on the BBC Test Match Special . “Seeing a player play a shot like that, it’s just not good enough at this level.” Brook was the fourth England batter to fall into Australia’s short-ball trap, with Ollie Pope, Ben Duckett and Joe Root departing after miscuing pull shots on Thursday evening. “It was kamikaze cricket,” former England batter Kevin Pietersen said on Sky Sports . “It was a bumpathon. England went flapping – and Australia picked up wickets quickly and very cheaply.” The Bazball mentality encourages freedom in the middle and abandoning any fear of failure — but there’s a fine line between fearlessness and carelessness. “England just looked confused with how they wanted to attack the short ball,” former Australian captain Aaron Finch told Channel 9. “You have to be able to adapt your game and adjust slightly. It doesn’t mean you lose the intent to score. I think they were just a little bit reckless in that period.” England’s aggressive batting has been a marvel over the past 12 months, but former Test captain Michael Atherton suggested the hosts lost control of their shot selection in the first innings. “If you go back to last summer, England’s approach is one of calculated aggression. Here, it seems to be all out aggression, no matter what,” Atherton said on Sky Sports. “They were just the wrong side of reckless in that innings, and this morning in particular with the dismissal of Harry Brook. “It has felt England are not in control of what they are doing.” Jonny Bairstow of England. Photo by Ryan Pierse/Getty Images Source: Getty Images AUSSIE OPENERS ‘ABSOLUTELY BOSSED IT’ Ben Stokes’ decision to bowl first after winning the toss on Wednesday proved the correct call, but the hosts haven’t made the most of the advantageous conditions at Lord’s this week. It was overcast and spitting with rain when David Warner and Usman Khawaja walked out to bat on Wednesday, with the Dukes ball hooping early in the morning session. But despite being dealt the toughest conditions for batting in the match, Australia’s openers combined for a 63-run partnership, ensuring the middle-order batters weren’t required until the afternoon session. When the clouds parted after lunch, centurion Steve Smith reaped the benefits of Warner and Khawaja’s discipline. In a frustrating moment of deja vu, the veteran openers were greeted by dark and gloomy conditions when Australia’s second innings got underway on Friday, with floodlights illuminating the hallowed turf. The umpires considered pausing the match due to bad light, but thankfully opted against it. “Great to see the umpires at Lord’s staying on the field with the lights on,” former Australian batter Mark Waugh tweeted. “Too often play is stopped in these circumstances. It proves whilst not perfect conditions are playable.” Usman Khawaja and David Warner. Photo by Ryan Pierse/Getty Images Source: Getty Images Despite the poor visibility, Khawaja and Warner once again survived the nervy passage of play, putting together 63 for the first wicket and setting a platform for Australia’s middle order. The fact that both had dire records in England prior to this series only speaks further to just how mentally tough they have been. “Australia have had the harder of the conditions throughout the match,” former England captain Nasser Hussain told Sky Sports during the tea break. “Lost the toss on a green pitch under cloudy skies. Third day, cloudy skies, lights on, ball moving around — they have battled through again. “To be 172 runs ahead and one wicket down when you have had the worst of the conditions speaks volumes about the skill but also the toughness. “They have absolutely bossed it.” Despite not converting his starts of 66 and 25 into triple figures, Warner has helped put Australia within touching distance of a 2-0 series lead, while Khawaja will be eyeing a 16th Test century on Saturday morning. MARNUS FALLS TO WORST DELIVERY OF THE DAY After surviving three LBW shouts on Friday , Marnus Labuschagne was dismissed by the worst delivery he faced in the second innings. England’s bowlers had been relentlessly targeting the Queenslander’s stumps on day three, with mixed success. Labuschagne occasionally flicked off his pads towards the boundary rope, but he never quite looked comfortable against the swinging Dukes ball. However, after weathering the storm, Labuschagne fell victim to England veteran James Anderson in the evening session for 30 — although perhaps not as he would have expected. Anderson delivered a rank half-tracker outside off stump that Labuschagne looked to carve through point — but instead, the ball ballooned directly towards Harry Brook at point. It was the third dismissal of the series where Labuschagne was guilty of fishing at a wide delivery, with Stuart Broad knocking him over cheaply in both innings at Edgbaston. By his own admission, the twin dismissals in Birmingham were “very uncharacteristic” — Labuschagne is renowned for being a superb judge of when to leave the ball. According to CricViz , nobody has left more deliveries against pace bowlers in Tests than the right-hander since October 2018. “I just made a few poor decisions (against balls) that were really wide. They’d be eighth or ninth stump, some of those deliveries,” Labuschagne told reporters earlier this week. “They were very uncharacteristic dismissals to how I’ve usually played, that’s why I was pretty frustrated with myself to get out that way and asked myself the question, ‘Why did I play at those deliveries?’ “It’s a rarity that I’d play at those balls, so it’s not something I’m going to overthink, but I hold myself to a much higher standard than those dismissals.” Labuschagne, who until last week was the world’s No. 1 Test batter, has reached fifty just once in his 14 most recent knocks, a worrying slump for the talented right-hander. Marnus Labuschagne of Australia. Photo by Ryan Pierse/Getty Images Source: Getty Images ‘THIS LAD IS SPECIAL’: GREEN DOES IT AGAIN Cameron Green can do no wrong at gully. The West Australian added another ripping catch to his career highlights reel on Friday morning, sending rival captain Ben Stokes back to the sheds in the first over of the day. Mitchell Starc found the left-hander’s leading edge, and Green reacted quickly at gully, throwing his arms out and holding onto the fast chance. The 25-year-old has taken five catches since the start of the World Test Championship final against India, at least three of which were absolute screamers. His long limbs and added wingspan allow him to snaffle more chances than the average fielder — and they always seem to stick. As revealed by CricViz , only Indian vice-captain Ajinkya Rahane boasts a higher catch success percentage among outfielders since Green’s Test debut in 2020. Speaking on Sky Sports , former England captain Nasser Hussain claimed that Green was the best fielder he had witnessed since Mark Waugh. “He covers so much ground for a big unit,” Hussain said. “This lad is special. “He doesn’t have a weak side. He is phenomenal in there, he really is.” Stokes sent walking from second ball! | 00:28 ‘HE’S HANDY’: HEAD’S SURPRISE SPIN ROLE Who needs the GOAT? After Nathan Lyon’s devastating injury setback, Travis Head was tasked with stepping in as Australia’s premier spinner on day three of the Lord’s Test — and the South Australian once again proved he’s no part-timer with the ball. Head struck twice in the 76th over of England’s first innings, removing Ollie Robinson and Stuart Broad in quick succession. Robinson charged down the wicket and looked to smack the off-spinner into the stands, instead nicking behind to wicketkeeper Alex Carey — who could have easily completed a stumping if not for the edge. A few deliveries later, Broad was trapped LBW after attempting a misjudged sweep shot, wasting a review before trudging back to the sheds. Head finished the innings with 2-17 from seven overs, with his Test bowling average sinking to 28.77. It comes after he claimed 4-10 in an unforgettable spell against Sri Lanka in Galle last year. “He’s handy,” ABC commentator Jim Maxwell said of Head’s bowling. “He’s more of a chance than Smith these days.” However, Head’s job is far from over — he looms as a crucial figure for Australia in the fourth innings, and England’s top-order will no doubt be looking to target the spinner on day five. Travis Head of Australia. Photo by Stu Forster/Getty Images Source: Getty Images","pubDate":"2023-06-30 20:44:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Ange sends social media wild after cheering on Aussies at Lord’s","link":"https://www.foxsports.com.au/football/premier-league/ashes-2023-second-test-at-lords-ange-postecoglou-watches-australia-vs-england-on-day-three-spurs-tottenham-news/news-story/546eba0f7b5070ac90cdbd9f086ef261","keywords":null,"creator":null,"video_url":null,"description":"Australian manager Ange Postecoglou doesn’t officially start his new role as head coach of Premier League side Tottenham Hotspur until tomorrow – but he’s made himself at home in the English capital, enjoying a day watching the Ashes at Lord’s.","content":"Australian manager Ange Postecoglou doesn’t officially start his new role as head coach of Premier League side Tottenham Hotspur until tomorrow – but he’s made himself at home in the English capital, enjoying a day watching the Ashes at Lord’s. Postecoglou was spotted in the Cricket Australia Suite as Australia took control of the second Test, sending social media wild with jokes about Spurs – a team infamous for their soft underbelly and repeating the same mistakes time and again. That sort of performance was on display from the hosts at Lord’s, as England’s Bazball approach saw batters attack the Australian bouncer barrage – and be cheaply dismissed time and again. READ MORE DAY THREE: Bazball implodes in frantic collapse as steady Aussies cash in on shambles ‘F***ING STUPID’: England star torched over horrific dismissal ‘HE COULD JUST TELL’: Aussie legend opens up on Parkinson’s diagnosis ‘YOU HAVE TO ACTUALLY ASK THE UMPIRE’: Broad’s weird habit backfires One fan wrote on social media: “Watching a very ‘Spursy’ type performance by England.” Another tweeted: “Hope he’s taking notes on how to win from Australia and not England.” But his surprise appearance caught the commentators out, with Nasser Hussain unsure of the Aussie’s name. Postecoglou has been in the headlines in recent days after landing a major signing for Spurs in England midfielder James Maddison. The former Leicester star revealed Postecoglou had a major influence in convincing him to move to North London on a £40 million deal. Maddison revealed: “(Ange) said one thing to me on the call, I hope he won’t mind me saying this, but he said, ‘whether you come or not, you’re going to see a completely different Spurs team under me’, and that kind of stuck with me that he said that.” Postecoglou was spotted with Former Deputy Prime Minister Of Australia, Michael McCormack (Back L), Former Prime Minister of Australia, John Howard and his wife Janette Howard (Back C and R), Chair of Cricket Australia, Mike Baird (Front L). Source: Getty Images Postecoglou is a known cricket fan. In an interview he did with late cricket great Shane Warne while at previous club Celtic, he told Warne: “Pleasure to speak to you too mate, growing up in Melbourne, even though it might be bizarre as an ethnic boy, an immigrant, my first passion was obviously soccer but growing up in Melbourne you had Aussie rules and in the summer it was all cricket. “As kids that is all we did, we just played cricket the whole time.” The Daily Mail even suggested Postecoglou could use his love of cricket to bond with superstar Spurs striker Harry Kane, whose future is in doubt. Kane is a big cricket fan, with plenty of footage of Spurs players playing a bit of backyard cricket in the Tottenham training gym. Richard Gibson wrote in the Daily Mail: “Perhaps Ange Postecoglou can bond with Harry Kane over a love of cricket in his attempts to persuade the England captain to remain with Tottenham this summer.” Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! Brook gone with VERY questionable shot | 00:32","pubDate":"2023-06-30 20:41:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Khawaja adds to England's Ashes agony after Starc strikes in 2nd Test","link":"https://www.news24.com/sport/Cricket/khawaja-adds-to-englands-ashes-agony-after-starc-strikes-in-2nd-test-20230630","keywords":null,"creator":null,"video_url":null,"description":"Australia's Usman Khawaja dug in to put Australia in control against England after the hosts' batting collapse in the second Ashes Test at Lord's on Friday.","content":"Australia's Usman Khawaja dug in to put Australia in control against England after the hosts' batting collapse in the second Ashes Test at Lord's on Friday. STUMPS | England v Australia, 2nd Test - Day 3 Ashes-holders Australia were strongly placed at 130-2 in their second innings, a lead of 221 runs, when rain forced an early close to the third day's play. Conditions for batting, with the floodlights switched on to counter the gloomy skies in London, were challenging. But Khawaja, whose hundred at Edgbaston last week helped Australia take a 1-0 lead in the five-match series, held firm to reach 58 not out at stumps. Steve Smith was unbeaten on six following his 110 in Australia's first-innings 416. Khawaja and fellow left-handed opener David Warner, who made an unusually restrained 25 off 76 balls, were content to defend in traditional Test-match fashion against the moving ball. And when Stuart Broad overpitched, Khawaja stylishly drove him through cover-point for four. Australia's approach was in marked contrast to the aggressive 'Bazball' style that led to several England top-order batsmen throwing away their wickets against the short ball on Thursday. Khawaja was reprieved on 19 when he pulled fast bowler Josh Tongue to James Anderson at forward square only for the ball to go through the hands of the England veteran, who did not appear to pick up the ball early enough. England eventually broke through after repeatedly beating the outside edge when Ashes debutant Tongue nipped one back to have Warner lbw, leaving Australia 63-1. Marnus Labuschagne was given out lbw for just three, only for the decision to be overturned on review. Labuschagne, however, was dismissed for 30 when he steered Anderson to Harry Brook at backward point. But Khawaja, combining attack and defence, completed a 105-ball fifty, with 40 of his runs coming in boundaries. Earlier, Mitchell Starc led the world Test champions' charge as England collapsed to 325 all out in a subdued atmosphere at Lord's. The home side, who had resumed on 278-4, added 47 runs in 15.2 overs as the wickets tumbled, with Australia 91 runs ahead on first innings. Starc, the only change to the Australia XI that enjoyed a thrilling two-wicket win at Edgbaston, took 3-88 in 17 overs. \"It's a shame it finished early today but it was a really positive morning for us to bowl them out and have a bit of a lead,\" Starc told the BBC. \"Our top order capitalised on that early, there was some good bowling, pressure built but our guys got through that.\" Turning to England's slump, he added: \"We knew if we could take a couple (of wickets) early and get some inroads into their tail, things could go the way they did.\" Several England batsmen, including opener Ben Duckett, who was out for 98, fell into a blatant hooking trap late on the second day. England suffered a further setback off just the second ball of Friday's play when captain Ben Stokes fell for his overnight 17. A delivery from left-arm express quick Starc leapt off a length and took the outside edge, with Cameron Green holding a sharp catch at second slip. It was a morale-boosting start to the day for Australia, bidding for a first Ashes series win in England in 22 years, after off-spinner Nathan Lyon was unable to take the field after suffering a calf strain. England rising star Brook, 45 not out overnight, completed a 63-ball fifty but his determination to attack proved his undoing. Brook backed away from a short Starc ball and tried to flat-bat the delivery down the ground, only to slice to extra-cover, where Australia captain Pat Cummins held a simple catch. At 293-6 England were left looking to Jonny Bairstow, the last of their specialist batsmen, to get on level terms. Bairstow, however, had only managed 16 when he chipped fast bowler Josh Hazlewood to Cummins at mid-on in search of quick runs with only the lower order for company. Part-time spinner Travis Head, filling in for Lyon, took two wickets in five balls, a charging Ollie Robinson caught behind, before Broad, previously shaken up a Green bouncer, was lbw.","pubDate":"2023-06-30 19:41:58","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Lethal! Shaheen Afridi Takes Four Wickets in One Over During Nottinghamshire vs Warwickshire VitalityT20 Blast 2023 Match (Watch Video)","link":"https://www.latestly.com/socially/sports/cricket/lethal-shaheen-afridi-takes-four-wickets-in-one-over-during-nottinghamshire-vs-warwickshire-vitalityt20-blast-2023-match-watch-video-5236870.html","keywords":null,"creator":null,"video_url":null,"description":"Alex Davies, Chris Benjamin, Dan Mousley and Ed Barnard were the four wickets of Warwickshire that were picked by Shaheen Shah Afridi in his first over.","content":"Shaheen Shah Afridi continues his first over exploits for Nottinghamshire in the Vitality T20 Blast 2023 as he takes 4 wickets in his first six deliveries against Warwickshire. Shaheen started with five wides only to take two wickets in next two balls and then finish the over again with two consecutive wickets, conceding 7 runs and taking 4 wickets in that over. Shaheen Afridi, you cannot do that!! 💥 — Vitality Blast (@VitalityBlast)","pubDate":"2023-06-30 19:38:14","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"TOP SPIN AT THE TEST: Khawaja leads Root by over 100 runs for the series, Brook notches an eighth 50","link":"https://www.dailymail.co.uk/sport/cricket/article-12252433/TOP-SPIN-TEST-Khawaja-leads-Root-100-runs-series-Brook-notches-eighth-50.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"TOP SPIN AT THE TEST: England's batting collapse continued through from the evening session of day three to finish bowled out for 325 before lunch on Friday morning.","content":"TOP SPIN AT THE TEST: Khawaja leads Root by over 100 runs for the series, Brook notches an eighth 50 in 14 Tests and England's bowlers fail to take a wicket in the opening 20 overs AGAIN Marnus Labuschagne still averages a tick under 55 despite recent poor form Josh Hazlewood took two wickets in England's 325 but conceded 71 runs from 13 Re-live all the action from Lord's as Australia dominate England with 221-run lead By Lawrence Booth for the Daily Mail Published: 20:31, 30 June 2023 | Updated: 20:31, 30 June 2023 e-mail View comments England's batting collapse continued through from the evening session of day three to finish bowled out for 325 before lunch on Friday morning. Ben Stokes went second ball, and was quickly joined by Harry Brook, Jonny Bairstow and the England tail in the pavilion as Australia made short work of ending the first innings. The hosts trailed by 91 runs when the Aussies came back to the crease, but once again the immovable Usman Khawaja proved resolute, although Josh Tongue claimed the scalp of David Warner for the second time in the Test for 25. Marnus Labuschagne survived an un-reviewed lbw scare before departing for 30 off Jimmy Anderson, before Steve Smith joined the Khawaja at the crease to see out the day until stumps was called shortly before 6pm sue to poor weather, with the visitors 221 runs to the good. Here, Mail Sport's LAWRENCE BOOTH shares the key statistics from the third day of the second Ashes Test at Lord's. In both innings England have now failed to pick up a wicket in the opening 20 overs Usman Khawaja's 280 runs for the series so far is more than 100 runs ahead of second-place Joe Root Usman Khawaja has quickly established himself as the batsman of the series. His unbeaten 58 here took his series haul to 280 runs at 93 – more than 100 clear of second-placed Joe Root. In both Australian innings, England failed to take a wicket inside the first 20 overs for the first time in a home Test since Headingley 2012 against South Africa. Since finishing Australia’s home series against South Africa in January with 79 at Sydney, Marnus Labuschagne has now scored one half-century in his last 14 innings. Marnus Labuschagne has now scored only one half-century in his last 14 innings but has an average a tick under 55 Despite that, his Test average remains a tick under 55. Harry Brook’s 50 was the eighth time in his 14 Test innings that he has made at least a half-century. His 946 runs have come at an average of 72 at a strike-rate of 96. Josh Hazlewood took two wickets in England’s 325, but also conceded 71 in 13 overs – at 5.46 an over the most expensive analysis of his 61-Test career. Share or comment on this article: TOP SPIN AT THE TEST: Khawaja leads Root by over 100 runs for the series, Brook notches an eighth 50 e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-30 19:31:12","image_url":"https://i.dailymail.co.uk/1s/2023/06/30/20/72727879-0-image-a-72_1688153461329.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"The day the Ashes went up in smoke: Boycott can't watch Brook's horror shot, Broad is sent for X-ray","link":"https://www.dailymail.co.uk/sport/cricket/article-12252549/The-day-Ashes-went-smoke-Boycott-watch-Brooks-horror-shot-Broad-sent-X-ray.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"AADAM PATEL AND RICHARD GIBSON AT LORD'S: England's Ashes hopes were hanging by a thread on Friday night after a shocking batting display saw them lose their last six first-innings wickets for 46","content":"The day the Ashes went up in smoke: Boycott can't watch Brook's horror shot, Broad is sent for jaw X-ray and Pope is left 'bewildered' as he is forced to field Harry Brook spliced a short ball from Mitchell Starc straight to Pat Cummins Spin bowling coach Jeetan Patel insisted that his England side had no regrets Re-live the action as England collapse to hand Australia the advantage at Lord's By Aadam Patel and Richard Gibson for the Daily Mail Published: 21:38, 30 June 2023 | Updated: 23:19, 30 June 2023 e-mail 26 View comments England's Ashes hopes were hanging by a thread on Friday night after a shocking batting display saw them lose their last six first-innings wickets for 46 before Australia reached 130 for two, a lead of 221. The mood inside Lord's was summed up by Sir Geoffrey Boycott's reaction to Harry Brook's dismissal as the Yorkshireman spliced a short ball from Mitchell Starc straight to Pat Cummins at cover. To add to their woes, Stuart Broad was sent for an X-ray on his jaw after being hit by a Cameron Green bouncer. The decision was made because of the level of swelling on his jawline. However, England said it was precautionary and they expect the seamer back playing on Saturday. England spin bowling coach Jeetan Patel insisted Ben Stokes' side had no regrets about the way they played and they were confident of chasing whatever was required in the fourth innings to level the series. The era of Bazball began last summer with England becoming the first team to successfully chase 250 or more in four consecutive Tests. Stuart Broad was sent for an X-ray after taking a Cameron Green delivery to his jaw on Friday Geoffrey Boycott was unable to watch as Harry Brook played a horror shot to end his innings 'We've always said we want to play an aggressive brand. It's not always going to come off and that's not a cop-out, that's just reality,' said Patel. 'We've seen some amazing things from this team. It's going to be a different ask against a different attack, but we've seen some crazy things from this line-up. This team is about breaking records. They want to set new standards. They want to sell out grounds and the way to do that is to bowl Australia out tomorrow, set the ground alight and chase whatever it is down.' England's frustrations on a grim day at Lord's were further compounded when vice-captain Ollie Pope, nursing a shoulder injury, was told by the umpires to field if he wanted to carry on batting at No 3 in England's second innings. Pope returned to the field at the start of Australia's second innings but sustained a recurrence of his shoulder injury and came off. The umpires confirmed it was a fresh external injury and he could stay off the field for the remainder of Australia's innings, but still bat in his regular position of 3. Ollie Pope picked up an injury to his shoulder after he was originally forced to field by umpires if he wanted to keep his spot at No 3 in the fourth innings, leaving England coaches furious 'We're a bit bewildered by it all,' said Patel. 'It's a pretty tough situation when you nearly bust your shoulder. But then he goes out and bats the way he did and the officials may have changed their decision on how he affects the game. So he had to go back out there. 'He's so committed to this team he was always going to fall on something and now he's back off the field icing his shoulder. He's probably more angry at the situation than anyone else. 'But he's a good kid and we know he's going to rock up tomorrow with a smile on his face. 'He's never going to turn down batting for England and with an opportunity to win a game, I can't see Ollie saying no to that.' Share or comment on this article: The day the Ashes went up in smoke: Boycott can't watch Brook's horror shot, Broad is sent for X-ray e-mail Add comment Comments 27 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-30 22:19:37","image_url":"https://i.dailymail.co.uk/1s/2023/06/30/22/72731551-0-image-a-95_1688160385580.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Australian cricket legend Border reveals he has Parkinson's","link":"https://www.news24.com/sport/Cricket/australian-cricket-legend-border-reveals-he-has-parkinsons-20230630","keywords":null,"creator":null,"video_url":null,"description":"Former captain Allan Border revealed on Friday he is suffering from Parkinson's disease, the latest blow to befall former Australian cricketing legends in the past three years.","content":"Former captain Allan Border revealed on Friday he is suffering from Parkinson's disease, the latest blow to befall former Australian cricketing legends in the past three years. The 68-year-old has gone public seven years after being diagnosed with the illness and said he and a doctor friend both agreed it would be \"a miracle\" if he makes 80. \"No way am I going to get another 100, that's for sure,\" Border told Newscorp. \"I'll just slip slowly into the west.\" Border had told only one person of his diagnosis: former team-mate Dean Jones, who died of a heart attack in 2020. Jones was the precursor of a terrible time for Australian cricket. Former wicketkeeper Rod Marsh and spin king Shane Warne died within days of each other in March 2022, both from heart attacks. Two months later Andrew Symonds - a member of two World Cup-winning sides - was killed in a car crash. Border, who spoke at Warne's memorial service, said he had been happy to keep the news to himself over the past seven years but a friend had told him last week many of his close associates had noticed his shaking. \"I'm a pretty private person and I didn't want people to feel sorry for me sort of thing,\" he said. \"Whether people care you don't know. But I know there'll come a day when people will notice.\" Border, though, showing the same rugged determination that he had as skipper - yielding the 1987 World Cup and an Ashes series win over England in 1989 - said he was in a better place than many other people. \"I get the feeling I'm a hell of a lot better off than most,\" said Border, who scored 27 centuries and 63 half-centuries in 156 Tests. \"At the moment I'm not scared, not about the immediate future anyway. \"I'm 68. If I make 80, that'll be a miracle. \"I've got a doctor friend and I said if I make 80, that'll be a miracle, and he said, 'That will be a miracle.'\" Australia paceman Mitchell Starc paid tribute to Border after the close of the third day's play in the second Ashes Test at Lord's on Friday. \"It's sad to hear,\" he said. \"He's one of the greats of Australian cricket and certainly a big character in world cricket. \"Our wishes go to AB and his family as well.\"","pubDate":"2023-06-30 21:11:59","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"‘I told you’: Broad fumes at Stokes over DRS bungle as cocky celebrappeal habit backfires","link":"https://www.foxsports.com.au/cricket/the-ashes/you-have-to-actually-ask-the-umpire-stuart-broads-celebrappeal-habit-backfires/news-story/f6ec72dc84a5632a9ace98ffb0146e6e","keywords":null,"creator":null,"video_url":null,"description":"The boy who cried “Howzat” …","content":"The boy who cried “Howzat” … England veteran Stuart Broad was thrice denied a wicket against Marnus Labuschagne on day three of the Lord’s Test against Australia , with his trademark celebrappeal backfiring on Friday afternoon. On the penultimate delivery of the afternoon session in London, Labuschagne flashed at a wide delivery from Broad that sailed through to England wicketkeeper Jonny Bairstow. Broad sprinted towards the slips cordon with a raised finger, high-fiving teammate Joe Root before turning around and realising umpire Chris Gaffaney was unmoved at the non-striker’s end. DAY 3 WRAP: Bazball implodes amid frantic collapse as steady Aussies cash-in on Lord’s shambles TALKING POINTS: Poms shredded for ‘kamikaze cricket’; Aussie duo ‘absolutely bossed it’ Root and Broad pleaded with captain Ben Stokes, begging for him to review the decision — but the England skipper wisely elected not to, with replays showing Labuschagne had hit the ground. The following delivery, Broad hooped an inswinger into Labuschagne’s front pad, and the 37-year-old once again charged down the pitch before spinning around — but Gaffaney was unconvinced. Stokes shook his head when asked about the review, and Hawkeye showed the ball was comfortably missing leg stump. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! Stuart Broad of England reacts after Marnus Labuschagne of Australia is given not out. Photo by Ryan Pierse/Getty Images Source: Getty Images READ MORE ‘F***ING STUPID’: England star torched over horrific dismissal ‘HE COULD JUST TELL’: Aussie legend opens up on Parkinson’s diagnosis After the tea break, Broad once again trapped Labuschagne on the pads with a well-directed inswinger, jogging through to the striker’s end before eventually turning back towards an unimpressed Gaffaney. “It would help from time to time to actually appeal to the umpire,” former England opener Michael Atherton grumbled on Sky Sports commentary. Former England captain Nasser Hussain laughed: “You have to actually ask the umpire, Stuart.” In a moment of deja vu, Stokes refused to signal for a review, believing the delivery was sliding down leg, and a frustrated Broad begrudgingly walked back to the top of his mark. But when the right-armer looked up towards the balcony, England coach Brendon McCullum raised his index finger, indicating red lights had appeared on Hawkeye and the decision would have been overturned if England reviewed. Broad looked dumbfounded, burying his head in his hands before yelling at his captain: “I told you it was out. I told you.” Labuschagne, who was dismissed by Broad twice during the Edgbaston Test, had been gifted a reprieve on 16 but couldn’t make the most of his extra life, falling victim to James Anderson a few overs later for 30.","pubDate":"2023-06-30 21:08:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"OLIVER HOLT: So sad to lose faith in Bazball at the very first signs of adversity as England falter","link":"https://www.dailymail.co.uk/sport/cricket/article-12252615/OLIVER-HOLT-sad-lose-faith-Bazball-signs-adversity-England-falter.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"OLIVER HOLT: As England trudged slowly back to the pavilion, reeling from the events of the morning, the soldiers of the British Army Band Tidworth took up position in front of the Grand Stand","content":"OLIVER HOLT: So sad to lose faith in Bazball at the very first signs of adversity as England falter on day three but there's no going back now England lost their last six wickets for 46 runs in the morning session at Lord's There were undeniably moments when their batters looked like lemmings Re-live a frustrating day three for England after being bowled out for just 325 By Oliver Holt For The Daily Mail Published: 22:05, 30 June 2023 | Updated: 22:30, 30 June 2023 e-mail 4 View comments As England’s players trudged slowly back to the pavilion at lunch , reeling from the events of the morning they had left behind , the soldiers of the British Army Band Tidworth took up position in front of the Grand Stand and raised their instruments to their lips. After a little while, they marched around to the Warner Stand and performed there, too. And then past the pavilion to station themselves in front of the Tavern Stand and the Mound Stand until they arrived beneath the Media Centre, that digital alarm clock in the sky. Gazing down on them, David Lloyd, the former England opener , England coach and commentator beyond compare, neatly articulated the sinking feeling so many of the supporters inside Lord’s were feeling. ‘And the band played on,’ he said. It had been a sobering passage of play that had reduced the Home of Cricket to a sullen silence. England had lost their last six wickets for 46 runs and the manner of some of the dismissals had led to the now familiar chorus of wailing and gnashing of teeth from the keepers of the flame. There were moments, undeniably, when England’s batsmen had looked like lemmings rushing towards a cliff as Australia’s bowlers peppered them with a barrage of short deliveries. They did not shirk the challenge. They swung for the fences and, generally, they missed. Australia picked up England's final six wickets at the cost of just 46 runs on Friday morning England kept to their attacking philosophy by swinging for the fences but generally they missed It would be sad if faith were lost in Brendon McCullum's Bazball now at the very first sign of adversity Exhibit A was Harry Brook stepping away from his stumps and aiming a wild, mistimed, cross-batted slash at a short delivery from Mitchell Starc, watching it loop in a lazy arc softly into the hands of Pat Cummins at extra cover. Jonny Bairstow chipped a tame catch to mid-on. Ollie Robinson charged down the wicket to makeshift spinner Travis Head and edged him into the hands of wicketkeeper Alex Carey and, after that, the end came quickly. England had made 325, 91 short of Australia’s first innings total, when they had started the day aiming for parity at least. By the end of the day, Australia had a lead comfortably north of 200. It felt as if that morning session might have been pivotal in the match and perhaps this Ashes series as a whole. As England struggle to keep pace with this formidable Australian team in a breathless sequence of Tests crammed into June and July, their continued embrace of a more aggressive style of cricket has exposed and exacerbated deep fault-lines and insecurities within the English game and those who love and cherish it. England had a bad session on Friday morning. It happens. After 11 wins in their previous 14 games, they were probably due one. But the alacrity with which the mass of opinion pounced on it, and sought to portray it as an apocalypse for Bazball, hinted at something deeper than disappointment about a few rash shots. It feels as if there is a fear among some cricket fans that Brendon McCullum, the England coach, and skipper Ben Stokes are fifth columnists who are colonising the Test game on behalf of the limited overs format. ‘I’ve enjoyed Bazball as much as the next person,’ a reader called John texted in to the BBC website, ‘but enough. This obsessive, aggressive, kamikaze batting has to be toned down. So disappointing to see England throwing it away.’ In an era of the sport when white-ball cricket is gaining more and more territory and time, and more traction among younger followers, when there is talk of the best limited overs players being contracted all year round by franchises with teams in leagues in India, Saudi Arabia and the USA, the desire to preserve the more measured, cerebral, strategic form of the game, unpolluted by limited overs ideology, feels stronger than ever. England and Yorkshire legend Geoffrey Boycott was unable to watch as Harry Brook played a horror shot Brook aimed a wild slash at a Mitchell Starc ball which looped softly into the hands of Pat Cummins Traditionalists are suspicious of England’s new style of play. They think it is a gimmick and they think it is disrespectful of Test cricket. They think it is naive. They think it rather vulgar. The reality, of course, is that it is a breathtakingly bold version of Test cricket that is the best hope of the game, in this form, surviving. And guess what? England will not excel in every session of every game playing it. Sometimes, like on Friday morning, it will make them look foolish and reckless. Sometimes, horror of horrors, they might even lose a match here and there. But when they get the mix of aggression and caution right, the sport they provide is peerless. So, yes, Brook’s dismissal looked ugly and distinctly ‘village’, but he had scored a half-century playing that way by then. Starc, Cummins and Josh Hazlewood were bowling brilliantly and the ball was moving around under leaden skies, so perhaps Brook figured the risk was worthwhile. Perhaps he decided he would rather lose his wicket trying to take the game to the opponents than trying to lean into a forward defensive prod and edging a delivery behind. In the new puritanical spirit pushing back against Bazball, losing your wicket to a poor defensive shot is far more preferable than losing it trying to attack. Oh for the times when England scored at less than three an over, were paralysed by caution and doubt, had no clear philosophy and looked frightened to play their shots and trust their talent. They went on a run of 17 Test matches where they only won once. Those were the days. There are times, of course, when this England team need to refine their approach. McCullum's approach has already contributed to one of the greatest Tests of all time in the first meeting at Edgbaston Australia's attack featuring Josh Hazlewood and Cummins (pictured) bowled well on Friday They need to choose their moments to go hard, as they did in the Tests of last summer. Australia were always going to present the toughest challenge to England’s new philosophy because they are the best Test team in the world. But it would be sad if faith were lost in Bazball now, at the very first sign of adversity, and we followed the urgings of men like jilted John. This summer, it has already helped to conjure the epic contest at Edgbaston, widely considered to be one of the greatest Test matches of all time. There is no reason to change tack. There is no going back. Share or comment on this article: OLIVER HOLT: So sad to lose faith in Bazball at the very first signs of adversity as England falter e-mail Add comment Comments 4 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-30 21:05:25","image_url":"https://i.dailymail.co.uk/1s/2023/06/30/22/72729879-0-image-a-35_1688159057393.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australians seize control of Ashes Test after near-perfect day three at Lord’s","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2023-cricket-scores-australia-vs-england-second-test-at-lords-day-three-live-updates-news-weather/news-story/f323de9e601114377bd7b7675b76e7e7","keywords":null,"creator":null,"video_url":null,"description":"Australia has seized control of the Lord’s Ashes Test after a frantic England collapse and another disciplined knock from opener Usman Khawaja headlined day three at St John’s Wood.","content":"Australia has seized control of the Lord’s Ashes Test after a frantic England collapse and another disciplined knock from opener Usman Khawaja headlined day three at St John’s Wood. England lost 6-47 during an eventful morning session, bowled out for 325 to give Australia a 91-run first-innings lead. In response, the visitors cruised towards 2-130 before rain forced a premature close to play, with Khawaja (58*) and Steve Smith (6*) unbeaten at stumps. England shot themselves in the foot on Friday afternoon with a dropped catch, which gifted Khawaja an extra life on 19, and an ill-judged non-review that denied Stuart Broad a much-needed wicket. Australia currently leads by 221 runs, and England requires nothing less than a herculean effort in the fourth innings to prevent Pat Cummins’ side from taking a 2-0 lead in the five-match series. TALKING POINTS: Poms shredded for ‘kamikaze cricket’; Aussie duo ‘absolutely bossed it’ ‘YOU HAVE TO ACTUALLY ASK THE UMPIRE’: Broad’s celebrappeal habit backfires MATCH CENTRE: England vs Australia stats, scorecard Earlier, Nathan Lyon arrived at Lord’s on crutches, with Cricket Australia confirming the veteran spinner has suffered a “significant calf strain” , putting his availability for the remainder of the series under severe doubt. After resuming day three at 4-278, England lost their remaining six wickets in less than 90 minutes, with paceman Mitchell Starc and part-time spinner Travis Head each snaring two wickets. Having patiently guided England to stumps the previous evening, Ben Stokes fell for 17 on the second delivery of the day after Starc found the England captain’s leading edge, with Cameron Green taking yet another superb catch at gully. Stokes sent walking from second ball! | 00:28 Harry Brook, who was dropped by Marnus Labuschagne the previous evening, brought up his maiden Ashes half-century in 63 deliveries — but couldn’t convert the start into a substantial score, departing for 50. The 24-year-old backed away and awkwardly swatted at a Starc bouncer, gifting rival captain Pat Cummins a regulation catch at extra cover — it was an ugly dismissal that exposed England’s long tail. Brook gone with VERY questionable shot | 00:32 Immediately after the drinks break, wicketkeeper Jonny Bairstow, England’s last recognised batter, attempted a lofted drive against Josh Hazlewood, instead chipping a chance towards Cummins at mid-on. Soon after, Green delivered a brutal bouncer that struck Broad near the jaw, but thankfully the Englishman avoided serious damage. Ollie Robinson was the next to depart, skipping down the pitch at Head and nicking behind to wicketkeeper Alex Carey, who claimed his umpteenth classy catch of the series. Head struck again later in the same over, trapping a sweeping Broad on the pads for 12 — a desperate review couldn’t save the Nighthawk. Cummins wrapped up the innings with a well-directed bouncer at Josh Tongue, which was fended towards substitute fielder Matthew Renshaw at short leg for 1. After dominating day two, England had slipped from 1-188 to 325 all out, swinging momentum firmly back in Australia’s favour. Travis Head of Australia appeals. Photo by Stu Forster/Getty Images Source: Getty Images Australian openers David Warner and Khawaja survived a nervy 20-minute passage of play before lunch — the floodlights needed to be switched on after dark clouds descended on the iconic venue. James Anderson thought he had unearthed a breakthrough early in the afternoon session, reviewing an LBW decision against Warner — but replays showed a thick inside edge onto the pads. The introduction of Josh Tongue almost did the trick for England, but Khawaja’s pull shot burst through Anderson’s hands at square leg and raced away for a boundary — it was the only chance he offered on day three. After a 63-run opening partnership, Tongue nipped a delivery into Warner’s pads from around the wicket, with the veteran batter wasting a review before trudging back to the sheds for 25. Tongue almost knocked over Marnus Labuschagne in his following over, with umpire Ahsan Raza giving the Australian No. 3 out LBW — only for the decision to be overturned when Hawkeye showed that impact was outside off. Labuschagne survived the final two deliveries before the tea break, with Broad’s back-to-back celebrappeals for caught behind and LBW failing to convince umpire Chris Gaffaney. Stokes wisely elected not to review either decision. It was third time’s the charm for Broad — after the lunch break, the England veteran trapped Labuschagne on the pads, sprinting towards the slips cordon without consulting Gaffaney, who didn’t raise the dreaded finger. Stokes once again denied the review — but on this occasion, Hawkeye suggested the ball would have crashed into leg stump, with Labuschagne surviving on 15. Stuart Broad of England. Photo by Ryan Pierse/Getty Images Source: Getty Images The Queenslander couldn’t make the most of his reprieve, lazily cutting a loose delivery from Anderson towards point and departing for 30. Khawaja reached fifty for the third time in the series with an elegant straight drive down the ground before rain intervened, forcing a premature end to proceedings in London. Despite the weather interruption, it was a near-perfect day for the Australians, who will look to extend their lead before hunting the ten wickets required for victory — albeit without Lyon at their disposal.","pubDate":"2023-06-30 20:59:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"England shredded for ‘kamikaze cricket’; Australian openers ‘absolutely bossed it’ — Lord’s Ashes Test Day 3 Talking Points","link":"https://www.foxsports.com.au/cricket/the-ashes/england-shredded-for-kamikaze-cricket-australian-openers-absolutely-bossed-it-lords-ashes-test-day-3-talking-points/news-story/21e216b5bf9f677b0d1ff856b564e6da","keywords":null,"creator":null,"video_url":null,"description":"Australia has edged ahead in the second Ashes Test after a rain-affected third day at Lord’s, with England needing another fourth-innings miracle to prevent Pat Cummins’ side from taking a 2-0 series lead.","content":"Australia has edged ahead in the second Ashes Test after a rain-affected third day at Lord’s, with England needing another fourth-innings miracle to prevent Pat Cummins’ side from taking a 2-0 series lead. The hosts were bowled out for 325 after a frantic collapse of 6-47 on Friday morning , giving Australia a 91-run first-innings lead in London. In response, the visitors cruised towards 2-130 at stumps, leading by 221 runs, with opener Usman Khawaja (58*) and vice-captain Steve Smith (6*) unbeaten overnight. Australia will look to extend its lead before hunting the ten wickets required for victory — albeit without veteran spinner Nathan Lyon at their disposal . These are the Talking Points from day three at Lord’s. DAY 3 WRAP: Aussies seize control after near-perfect day as blunders shatter England’s hopes ‘YOU HAVE TO ACTUALLY ASK THE UMPIRE’: Broad’s celebrappeal habit backfires ENGLAND SHREDDED FOR ‘KAMIKAZE CRICKET’ ‘Bazball’ isn’t foolproof, and on Friday morning, we saw what happens when England’s attacking approach to Test cricket backfires. The hosts failed to take advantage of the batter-friendly conditions in the first innings of the Lord’s Test, sacrificing a potential lead after collapsing early on day three. It was a bitterly disappointing result for England, who were cruising at 1-188 on Thursday evening when Nathan Lyon left the field with injury. Ben Stokes and his teammates had an opportunity to grind Australia’s quicks into the dirt after the veteran spinner’s setback, but instead threw their wicket away and crumbled in a heap. England’s top-order shot themselves in the foot by repeatedly attacking bouncers despite a cluster of fielders waiting behind square. Harry Brook’s dismissal was particularly reckless — after racing towards 50, he backed away from a Mitchell Starc bouncer and awkwardly spooned it towards rival captain Pat Cummins at extra cover. England legend Geoffrey Boycott shook his head in bemusement from the stands. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! Brook gone with VERY questionable shot | 00:32 “England clearly like losing,” former captain Michael Vaughan said on the BBC Test Match Special . “Seeing a player play a shot like that, it’s just not good enough at this level.” Brook was the fourth England batter to fall into Australia’s short-ball trap, with Ollie Pope, Ben Duckett and Joe Root departing after miscuing pull shots on Thursday evening. “It was kamikaze cricket,” former England batter Kevin Pietersen said on Sky Sports . “It was a bumpathon. England went flapping – and Australia picked up wickets quickly and very cheaply.” The Bazball mentality encourages freedom in the middle and abandoning any fear of failure — but there’s a fine line between fearlessness and carelessness. “England just looked confused with how they wanted to attack the short ball,” former Australian captain Aaron Finch told Channel 9. “You have to be able to adapt your game and adjust slightly. It doesn’t mean you lose the intent to score. I think they were just a little bit reckless in that period.” England’s aggressive batting has been a marvel over the past 12 months, but former Test captain Michael Atherton suggested the hosts lost control of their shot selection in the first innings. “If you go back to last summer, England’s approach is one of calculated aggression. Here, it seems to be all out aggression, no matter what,” Atherton said on Sky Sports. “They were just the wrong side of reckless in that innings, and this morning in particular with the dismissal of Harry Brook. “It has felt England are not in control of what they are doing.” Jonny Bairstow of England. Photo by Ryan Pierse/Getty Images Source: Getty Images AUSSIE OPENERS ‘ABSOLUTELY BOSSED IT’ Ben Stokes’ decision to bowl first after winning the toss on Wednesday proved the correct call, but the hosts haven’t made the most of the advantageous conditions at Lord’s this week. It was overcast and spitting with rain when David Warner and Usman Khawaja walked out to bat on Wednesday, with the Dukes ball hooping early in the morning session. But despite being dealt the toughest conditions for batting in the match, Australia’s openers combined for a 63-run partnership, ensuring the middle-order batters weren’t required until the afternoon session. When the clouds parted after lunch, centurion Steve Smith reaped the benefits of Warner and Khawaja’s discipline. In a frustrating moment of deja vu, the veteran openers were greeted by dark and gloomy conditions when Australia’s second innings got underway on Friday, with floodlights illuminating the hallowed turf. The umpires considered pausing the match due to bad light, but thankfully opted against it. “Great to see the umpires at Lord’s staying on the field with the lights on,” former Australian batter Mark Waugh tweeted. “Too often play is stopped in these circumstances. It proves whilst not perfect conditions are playable.” Usman Khawaja and David Warner. Photo by Ryan Pierse/Getty Images Source: Getty Images Despite the poor visibility, Khawaja and Warner once again survived the nervy passage of play, putting together 63 for the first wicket and setting a platform for Australia’s middle order. The fact that both had dire records in England prior to this series only speaks further to just how mentally tough they have been. “Australia have had the harder of the conditions throughout the match,” former England captain Nasser Hussain told Sky Sports during the tea break. “Lost the toss on a green pitch under cloudy skies. Third day, cloudy skies, lights on, ball moving around — they have battled through again. “To be 172 runs ahead and one wicket down when you have had the worst of the conditions speaks volumes about the skill but also the toughness. “They have absolutely bossed it.” Despite not converting his starts of 66 and 25 into triple figures, Warner has helped put Australia within touching distance of a 2-0 series lead, while Khawaja will be eyeing a 16th Test century on Saturday morning. MARNUS FALLS TO WORST DELIVERY OF THE DAY After surviving three LBW shouts on Friday , Marnus Labuschagne was dismissed by the worst delivery he faced in the second innings. England’s bowlers had been relentlessly targeting the Queenslander’s stumps on day three, with mixed success. Labuschagne occasionally flicked off his pads towards the boundary rope, but he never quite looked comfortable against the swinging Dukes ball. However, after weathering the storm, Labuschagne fell victim to England veteran James Anderson in the evening session for 30 — although perhaps not as he would have expected. Anderson delivered a rank half-tracker outside off stump that Labuschagne looked to carve through point — but instead, the ball ballooned directly towards Harry Brook at point. It was the third dismissal of the series where Labuschagne was guilty of fishing at a wide delivery, with Stuart Broad knocking him over cheaply in both innings at Edgbaston. By his own admission, the twin dismissals in Birmingham were “very uncharacteristic” — Labuschagne is renowned for being a superb judge of when to leave the ball. According to CricViz , nobody has left more deliveries against pace bowlers in Tests than the right-hander since October 2018. “I just made a few poor decisions (against balls) that were really wide. They’d be eighth or ninth stump, some of those deliveries,” Labuschagne told reporters earlier this week. “They were very uncharacteristic dismissals to how I’ve usually played, that’s why I was pretty frustrated with myself to get out that way and asked myself the question, ‘Why did I play at those deliveries?’ “It’s a rarity that I’d play at those balls, so it’s not something I’m going to overthink, but I hold myself to a much higher standard than those dismissals.” Labuschagne, who until last week was the world’s No. 1 Test batter, has reached fifty just once in his 14 most recent knocks, a worrying slump for the talented right-hander. Marnus Labuschagne of Australia. Photo by Ryan Pierse/Getty Images Source: Getty Images ‘THIS LAD IS SPECIAL’: GREEN DOES IT AGAIN Cameron Green can do no wrong at gully. The West Australian added another ripping catch to his career highlights reel on Friday morning, sending rival captain Ben Stokes back to the sheds in the first over of the day. Mitchell Starc found the left-hander’s leading edge, and Green reacted quickly at gully, throwing his arms out and holding onto the fast chance. The 25-year-old has taken five catches since the start of the World Test Championship final against India, at least three of which were absolute screamers. His long limbs and added wingspan allow him to snaffle more chances than the average fielder — and they always seem to stick. As revealed by CricViz , only Indian vice-captain Ajinkya Rahane boasts a higher catch success percentage among outfielders since Green’s Test debut in 2020. Speaking on Sky Sports , former England captain Nasser Hussain claimed that Green was the best fielder he had witnessed since Mark Waugh. “He covers so much ground for a big unit,” Hussain said. “This lad is special. “He doesn’t have a weak side. He is phenomenal in there, he really is.” Stokes sent walking from second ball! | 00:28 ‘HE’S HANDY’: HEAD’S SURPRISE SPIN ROLE Who needs the GOAT? After Nathan Lyon’s devastating injury setback, Travis Head was tasked with stepping in as Australia’s premier spinner on day three of the Lord’s Test — and the South Australian once again proved he’s no part-timer with the ball. Head struck twice in the 76th over of England’s first innings, removing Ollie Robinson and Stuart Broad in quick succession. Robinson charged down the wicket and looked to smack the off-spinner into the stands, instead nicking behind to wicketkeeper Alex Carey — who could have easily completed a stumping if not for the edge. A few deliveries later, Broad was trapped LBW after attempting a misjudged sweep shot, wasting a review before trudging back to the sheds. Head finished the innings with 2-17 from seven overs, with his Test bowling average sinking to 28.77. It comes after he claimed 4-10 in an unforgettable spell against Sri Lanka in Galle last year. “He’s handy,” ABC commentator Jim Maxwell said of Head’s bowling. “He’s more of a chance than Smith these days.” However, Head’s job is far from over — he looms as a crucial figure for Australia in the fourth innings, and England’s top-order will no doubt be looking to target the spinner on day five. Travis Head of Australia. Photo by Stu Forster/Getty Images Source: Getty Images","pubDate":"2023-06-30 20:44:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Ange sends social media wild after cheering on Aussies at Lord’s","link":"https://www.foxsports.com.au/football/premier-league/ashes-2023-second-test-at-lords-ange-postecoglou-watches-australia-vs-england-on-day-three-spurs-tottenham-news/news-story/546eba0f7b5070ac90cdbd9f086ef261","keywords":null,"creator":null,"video_url":null,"description":"Australian manager Ange Postecoglou doesn’t officially start his new role as head coach of Premier League side Tottenham Hotspur until tomorrow – but he’s made himself at home in the English capital, enjoying a day watching the Ashes at Lord’s.","content":"Australian manager Ange Postecoglou doesn’t officially start his new role as head coach of Premier League side Tottenham Hotspur until tomorrow – but he’s made himself at home in the English capital, enjoying a day watching the Ashes at Lord’s. Postecoglou was spotted in the Cricket Australia Suite as Australia took control of the second Test, sending social media wild with jokes about Spurs – a team infamous for their soft underbelly and repeating the same mistakes time and again. That sort of performance was on display from the hosts at Lord’s, as England’s Bazball approach saw batters attack the Australian bouncer barrage – and be cheaply dismissed time and again. READ MORE DAY THREE: Bazball implodes in frantic collapse as steady Aussies cash in on shambles ‘F***ING STUPID’: England star torched over horrific dismissal ‘HE COULD JUST TELL’: Aussie legend opens up on Parkinson’s diagnosis ‘YOU HAVE TO ACTUALLY ASK THE UMPIRE’: Broad’s weird habit backfires One fan wrote on social media: “Watching a very ‘Spursy’ type performance by England.” Another tweeted: “Hope he’s taking notes on how to win from Australia and not England.” But his surprise appearance caught the commentators out, with Nasser Hussain unsure of the Aussie’s name. Postecoglou has been in the headlines in recent days after landing a major signing for Spurs in England midfielder James Maddison. The former Leicester star revealed Postecoglou had a major influence in convincing him to move to North London on a £40 million deal. Maddison revealed: “(Ange) said one thing to me on the call, I hope he won’t mind me saying this, but he said, ‘whether you come or not, you’re going to see a completely different Spurs team under me’, and that kind of stuck with me that he said that.” Postecoglou was spotted with Former Deputy Prime Minister Of Australia, Michael McCormack (Back L), Former Prime Minister of Australia, John Howard and his wife Janette Howard (Back C and R), Chair of Cricket Australia, Mike Baird (Front L). Source: Getty Images Postecoglou is a known cricket fan. In an interview he did with late cricket great Shane Warne while at previous club Celtic, he told Warne: “Pleasure to speak to you too mate, growing up in Melbourne, even though it might be bizarre as an ethnic boy, an immigrant, my first passion was obviously soccer but growing up in Melbourne you had Aussie rules and in the summer it was all cricket. “As kids that is all we did, we just played cricket the whole time.” The Daily Mail even suggested Postecoglou could use his love of cricket to bond with superstar Spurs striker Harry Kane, whose future is in doubt. Kane is a big cricket fan, with plenty of footage of Spurs players playing a bit of backyard cricket in the Tottenham training gym. Richard Gibson wrote in the Daily Mail: “Perhaps Ange Postecoglou can bond with Harry Kane over a love of cricket in his attempts to persuade the England captain to remain with Tottenham this summer.” Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! Brook gone with VERY questionable shot | 00:32","pubDate":"2023-06-30 20:41:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Khawaja adds to England's Ashes agony after Starc strikes in 2nd Test","link":"https://www.news24.com/sport/Cricket/khawaja-adds-to-englands-ashes-agony-after-starc-strikes-in-2nd-test-20230630","keywords":null,"creator":null,"video_url":null,"description":"Australia's Usman Khawaja dug in to put Australia in control against England after the hosts' batting collapse in the second Ashes Test at Lord's on Friday.","content":"Australia's Usman Khawaja dug in to put Australia in control against England after the hosts' batting collapse in the second Ashes Test at Lord's on Friday. STUMPS | England v Australia, 2nd Test - Day 3 Ashes-holders Australia were strongly placed at 130-2 in their second innings, a lead of 221 runs, when rain forced an early close to the third day's play. Conditions for batting, with the floodlights switched on to counter the gloomy skies in London, were challenging. But Khawaja, whose hundred at Edgbaston last week helped Australia take a 1-0 lead in the five-match series, held firm to reach 58 not out at stumps. Steve Smith was unbeaten on six following his 110 in Australia's first-innings 416. Khawaja and fellow left-handed opener David Warner, who made an unusually restrained 25 off 76 balls, were content to defend in traditional Test-match fashion against the moving ball. And when Stuart Broad overpitched, Khawaja stylishly drove him through cover-point for four. Australia's approach was in marked contrast to the aggressive 'Bazball' style that led to several England top-order batsmen throwing away their wickets against the short ball on Thursday. Khawaja was reprieved on 19 when he pulled fast bowler Josh Tongue to James Anderson at forward square only for the ball to go through the hands of the England veteran, who did not appear to pick up the ball early enough. England eventually broke through after repeatedly beating the outside edge when Ashes debutant Tongue nipped one back to have Warner lbw, leaving Australia 63-1. Marnus Labuschagne was given out lbw for just three, only for the decision to be overturned on review. Labuschagne, however, was dismissed for 30 when he steered Anderson to Harry Brook at backward point. But Khawaja, combining attack and defence, completed a 105-ball fifty, with 40 of his runs coming in boundaries. Earlier, Mitchell Starc led the world Test champions' charge as England collapsed to 325 all out in a subdued atmosphere at Lord's. The home side, who had resumed on 278-4, added 47 runs in 15.2 overs as the wickets tumbled, with Australia 91 runs ahead on first innings. Starc, the only change to the Australia XI that enjoyed a thrilling two-wicket win at Edgbaston, took 3-88 in 17 overs. \"It's a shame it finished early today but it was a really positive morning for us to bowl them out and have a bit of a lead,\" Starc told the BBC. \"Our top order capitalised on that early, there was some good bowling, pressure built but our guys got through that.\" Turning to England's slump, he added: \"We knew if we could take a couple (of wickets) early and get some inroads into their tail, things could go the way they did.\" Several England batsmen, including opener Ben Duckett, who was out for 98, fell into a blatant hooking trap late on the second day. England suffered a further setback off just the second ball of Friday's play when captain Ben Stokes fell for his overnight 17. A delivery from left-arm express quick Starc leapt off a length and took the outside edge, with Cameron Green holding a sharp catch at second slip. It was a morale-boosting start to the day for Australia, bidding for a first Ashes series win in England in 22 years, after off-spinner Nathan Lyon was unable to take the field after suffering a calf strain. England rising star Brook, 45 not out overnight, completed a 63-ball fifty but his determination to attack proved his undoing. Brook backed away from a short Starc ball and tried to flat-bat the delivery down the ground, only to slice to extra-cover, where Australia captain Pat Cummins held a simple catch. At 293-6 England were left looking to Jonny Bairstow, the last of their specialist batsmen, to get on level terms. Bairstow, however, had only managed 16 when he chipped fast bowler Josh Hazlewood to Cummins at mid-on in search of quick runs with only the lower order for company. Part-time spinner Travis Head, filling in for Lyon, took two wickets in five balls, a charging Ollie Robinson caught behind, before Broad, previously shaken up a Green bouncer, was lbw.","pubDate":"2023-06-30 19:41:58","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Lethal! Shaheen Afridi Takes Four Wickets in One Over During Nottinghamshire vs Warwickshire VitalityT20 Blast 2023 Match (Watch Video)","link":"https://www.latestly.com/socially/sports/cricket/lethal-shaheen-afridi-takes-four-wickets-in-one-over-during-nottinghamshire-vs-warwickshire-vitalityt20-blast-2023-match-watch-video-5236870.html","keywords":null,"creator":null,"video_url":null,"description":"Alex Davies, Chris Benjamin, Dan Mousley and Ed Barnard were the four wickets of Warwickshire that were picked by Shaheen Shah Afridi in his first over.","content":"Shaheen Shah Afridi continues his first over exploits for Nottinghamshire in the Vitality T20 Blast 2023 as he takes 4 wickets in his first six deliveries against Warwickshire. Shaheen started with five wides only to take two wickets in next two balls and then finish the over again with two consecutive wickets, conceding 7 runs and taking 4 wickets in that over. Shaheen Afridi, you cannot do that!! 💥 — Vitality Blast (@VitalityBlast)","pubDate":"2023-06-30 19:38:14","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"TOP SPIN AT THE TEST: Khawaja leads Root by over 100 runs for the series, Brook notches an eighth 50","link":"https://www.dailymail.co.uk/sport/cricket/article-12252433/TOP-SPIN-TEST-Khawaja-leads-Root-100-runs-series-Brook-notches-eighth-50.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"TOP SPIN AT THE TEST: England's batting collapse continued through from the evening session of day three to finish bowled out for 325 before lunch on Friday morning.","content":"TOP SPIN AT THE TEST: Khawaja leads Root by over 100 runs for the series, Brook notches an eighth 50 in 14 Tests and England's bowlers fail to take a wicket in the opening 20 overs AGAIN Marnus Labuschagne still averages a tick under 55 despite recent poor form Josh Hazlewood took two wickets in England's 325 but conceded 71 runs from 13 Re-live all the action from Lord's as Australia dominate England with 221-run lead By Lawrence Booth for the Daily Mail Published: 20:31, 30 June 2023 | Updated: 20:31, 30 June 2023 e-mail View comments England's batting collapse continued through from the evening session of day three to finish bowled out for 325 before lunch on Friday morning. Ben Stokes went second ball, and was quickly joined by Harry Brook, Jonny Bairstow and the England tail in the pavilion as Australia made short work of ending the first innings. The hosts trailed by 91 runs when the Aussies came back to the crease, but once again the immovable Usman Khawaja proved resolute, although Josh Tongue claimed the scalp of David Warner for the second time in the Test for 25. Marnus Labuschagne survived an un-reviewed lbw scare before departing for 30 off Jimmy Anderson, before Steve Smith joined the Khawaja at the crease to see out the day until stumps was called shortly before 6pm sue to poor weather, with the visitors 221 runs to the good. Here, Mail Sport's LAWRENCE BOOTH shares the key statistics from the third day of the second Ashes Test at Lord's. In both innings England have now failed to pick up a wicket in the opening 20 overs Usman Khawaja's 280 runs for the series so far is more than 100 runs ahead of second-place Joe Root Usman Khawaja has quickly established himself as the batsman of the series. His unbeaten 58 here took his series haul to 280 runs at 93 – more than 100 clear of second-placed Joe Root. In both Australian innings, England failed to take a wicket inside the first 20 overs for the first time in a home Test since Headingley 2012 against South Africa. Since finishing Australia’s home series against South Africa in January with 79 at Sydney, Marnus Labuschagne has now scored one half-century in his last 14 innings. Marnus Labuschagne has now scored only one half-century in his last 14 innings but has an average a tick under 55 Despite that, his Test average remains a tick under 55. Harry Brook’s 50 was the eighth time in his 14 Test innings that he has made at least a half-century. His 946 runs have come at an average of 72 at a strike-rate of 96. Josh Hazlewood took two wickets in England’s 325, but also conceded 71 in 13 overs – at 5.46 an over the most expensive analysis of his 61-Test career. Share or comment on this article: TOP SPIN AT THE TEST: Khawaja leads Root by over 100 runs for the series, Brook notches an eighth 50 e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-30 19:31:12","image_url":"https://i.dailymail.co.uk/1s/2023/06/30/20/72727879-0-image-a-72_1688153461329.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"The day the Ashes went up in smoke: Boycott can't watch Brook's horror shot, Broad is sent for X-ray","link":"https://www.dailymail.co.uk/sport/cricket/article-12252549/The-day-Ashes-went-smoke-Boycott-watch-Brooks-horror-shot-Broad-sent-X-ray.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"AADAM PATEL AND RICHARD GIBSON AT LORD'S: England's Ashes hopes were hanging by a thread on Friday night after a shocking batting display saw them lose their last six first-innings wickets for 46","content":"The day the Ashes went up in smoke: Boycott can't watch Brook's horror shot, Broad is sent for jaw X-ray and Pope is left 'bewildered' as he is forced to field Harry Brook spliced a short ball from Mitchell Starc straight to Pat Cummins Spin bowling coach Jeetan Patel insisted that his England side had no regrets Re-live the action as England collapse to hand Australia the advantage at Lord's By Aadam Patel and Richard Gibson for the Daily Mail Published: 21:38, 30 June 2023 | Updated: 23:19, 30 June 2023 e-mail 26 View comments England's Ashes hopes were hanging by a thread on Friday night after a shocking batting display saw them lose their last six first-innings wickets for 46 before Australia reached 130 for two, a lead of 221. The mood inside Lord's was summed up by Sir Geoffrey Boycott's reaction to Harry Brook's dismissal as the Yorkshireman spliced a short ball from Mitchell Starc straight to Pat Cummins at cover. To add to their woes, Stuart Broad was sent for an X-ray on his jaw after being hit by a Cameron Green bouncer. The decision was made because of the level of swelling on his jawline. However, England said it was precautionary and they expect the seamer back playing on Saturday. England spin bowling coach Jeetan Patel insisted Ben Stokes' side had no regrets about the way they played and they were confident of chasing whatever was required in the fourth innings to level the series. The era of Bazball began last summer with England becoming the first team to successfully chase 250 or more in four consecutive Tests. Stuart Broad was sent for an X-ray after taking a Cameron Green delivery to his jaw on Friday Geoffrey Boycott was unable to watch as Harry Brook played a horror shot to end his innings 'We've always said we want to play an aggressive brand. It's not always going to come off and that's not a cop-out, that's just reality,' said Patel. 'We've seen some amazing things from this team. It's going to be a different ask against a different attack, but we've seen some crazy things from this line-up. This team is about breaking records. They want to set new standards. They want to sell out grounds and the way to do that is to bowl Australia out tomorrow, set the ground alight and chase whatever it is down.' England's frustrations on a grim day at Lord's were further compounded when vice-captain Ollie Pope, nursing a shoulder injury, was told by the umpires to field if he wanted to carry on batting at No 3 in England's second innings. Pope returned to the field at the start of Australia's second innings but sustained a recurrence of his shoulder injury and came off. The umpires confirmed it was a fresh external injury and he could stay off the field for the remainder of Australia's innings, but still bat in his regular position of 3. Ollie Pope picked up an injury to his shoulder after he was originally forced to field by umpires if he wanted to keep his spot at No 3 in the fourth innings, leaving England coaches furious 'We're a bit bewildered by it all,' said Patel. 'It's a pretty tough situation when you nearly bust your shoulder. But then he goes out and bats the way he did and the officials may have changed their decision on how he affects the game. So he had to go back out there. 'He's so committed to this team he was always going to fall on something and now he's back off the field icing his shoulder. He's probably more angry at the situation than anyone else. 'But he's a good kid and we know he's going to rock up tomorrow with a smile on his face. 'He's never going to turn down batting for England and with an opportunity to win a game, I can't see Ollie saying no to that.' Share or comment on this article: The day the Ashes went up in smoke: Boycott can't watch Brook's horror shot, Broad is sent for X-ray e-mail Add comment Comments 27 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-30 22:19:37","image_url":"https://i.dailymail.co.uk/1s/2023/06/30/22/72731551-0-image-a-95_1688160385580.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Australian cricket legend Border reveals he has Parkinson's","link":"https://www.news24.com/sport/Cricket/australian-cricket-legend-border-reveals-he-has-parkinsons-20230630","keywords":null,"creator":null,"video_url":null,"description":"Former captain Allan Border revealed on Friday he is suffering from Parkinson's disease, the latest blow to befall former Australian cricketing legends in the past three years.","content":"Former captain Allan Border revealed on Friday he is suffering from Parkinson's disease, the latest blow to befall former Australian cricketing legends in the past three years. The 68-year-old has gone public seven years after being diagnosed with the illness and said he and a doctor friend both agreed it would be \"a miracle\" if he makes 80. \"No way am I going to get another 100, that's for sure,\" Border told Newscorp. \"I'll just slip slowly into the west.\" Border had told only one person of his diagnosis: former team-mate Dean Jones, who died of a heart attack in 2020. Jones was the precursor of a terrible time for Australian cricket. Former wicketkeeper Rod Marsh and spin king Shane Warne died within days of each other in March 2022, both from heart attacks. Two months later Andrew Symonds - a member of two World Cup-winning sides - was killed in a car crash. Border, who spoke at Warne's memorial service, said he had been happy to keep the news to himself over the past seven years but a friend had told him last week many of his close associates had noticed his shaking. \"I'm a pretty private person and I didn't want people to feel sorry for me sort of thing,\" he said. \"Whether people care you don't know. But I know there'll come a day when people will notice.\" Border, though, showing the same rugged determination that he had as skipper - yielding the 1987 World Cup and an Ashes series win over England in 1989 - said he was in a better place than many other people. \"I get the feeling I'm a hell of a lot better off than most,\" said Border, who scored 27 centuries and 63 half-centuries in 156 Tests. \"At the moment I'm not scared, not about the immediate future anyway. \"I'm 68. If I make 80, that'll be a miracle. \"I've got a doctor friend and I said if I make 80, that'll be a miracle, and he said, 'That will be a miracle.'\" Australia paceman Mitchell Starc paid tribute to Border after the close of the third day's play in the second Ashes Test at Lord's on Friday. \"It's sad to hear,\" he said. \"He's one of the greats of Australian cricket and certainly a big character in world cricket. \"Our wishes go to AB and his family as well.\"","pubDate":"2023-06-30 21:11:59","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"‘I told you’: Broad fumes at Stokes over DRS bungle as cocky celebrappeal habit backfires","link":"https://www.foxsports.com.au/cricket/the-ashes/you-have-to-actually-ask-the-umpire-stuart-broads-celebrappeal-habit-backfires/news-story/f6ec72dc84a5632a9ace98ffb0146e6e","keywords":null,"creator":null,"video_url":null,"description":"The boy who cried “Howzat” …","content":"The boy who cried “Howzat” … England veteran Stuart Broad was thrice denied a wicket against Marnus Labuschagne on day three of the Lord’s Test against Australia , with his trademark celebrappeal backfiring on Friday afternoon. On the penultimate delivery of the afternoon session in London, Labuschagne flashed at a wide delivery from Broad that sailed through to England wicketkeeper Jonny Bairstow. Broad sprinted towards the slips cordon with a raised finger, high-fiving teammate Joe Root before turning around and realising umpire Chris Gaffaney was unmoved at the non-striker’s end. DAY 3 WRAP: Bazball implodes amid frantic collapse as steady Aussies cash-in on Lord’s shambles TALKING POINTS: Poms shredded for ‘kamikaze cricket’; Aussie duo ‘absolutely bossed it’ Root and Broad pleaded with captain Ben Stokes, begging for him to review the decision — but the England skipper wisely elected not to, with replays showing Labuschagne had hit the ground. The following delivery, Broad hooped an inswinger into Labuschagne’s front pad, and the 37-year-old once again charged down the pitch before spinning around — but Gaffaney was unconvinced. Stokes shook his head when asked about the review, and Hawkeye showed the ball was comfortably missing leg stump. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! Stuart Broad of England reacts after Marnus Labuschagne of Australia is given not out. Photo by Ryan Pierse/Getty Images Source: Getty Images READ MORE ‘F***ING STUPID’: England star torched over horrific dismissal ‘HE COULD JUST TELL’: Aussie legend opens up on Parkinson’s diagnosis After the tea break, Broad once again trapped Labuschagne on the pads with a well-directed inswinger, jogging through to the striker’s end before eventually turning back towards an unimpressed Gaffaney. “It would help from time to time to actually appeal to the umpire,” former England opener Michael Atherton grumbled on Sky Sports commentary. Former England captain Nasser Hussain laughed: “You have to actually ask the umpire, Stuart.” In a moment of deja vu, Stokes refused to signal for a review, believing the delivery was sliding down leg, and a frustrated Broad begrudgingly walked back to the top of his mark. But when the right-armer looked up towards the balcony, England coach Brendon McCullum raised his index finger, indicating red lights had appeared on Hawkeye and the decision would have been overturned if England reviewed. Broad looked dumbfounded, burying his head in his hands before yelling at his captain: “I told you it was out. I told you.” Labuschagne, who was dismissed by Broad twice during the Edgbaston Test, had been gifted a reprieve on 16 but couldn’t make the most of his extra life, falling victim to James Anderson a few overs later for 30.","pubDate":"2023-06-30 21:08:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"OLIVER HOLT: So sad to lose faith in Bazball at the very first signs of adversity as England falter","link":"https://www.dailymail.co.uk/sport/cricket/article-12252615/OLIVER-HOLT-sad-lose-faith-Bazball-signs-adversity-England-falter.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"OLIVER HOLT: As England trudged slowly back to the pavilion, reeling from the events of the morning, the soldiers of the British Army Band Tidworth took up position in front of the Grand Stand","content":"OLIVER HOLT: So sad to lose faith in Bazball at the very first signs of adversity as England falter on day three but there's no going back now England lost their last six wickets for 46 runs in the morning session at Lord's There were undeniably moments when their batters looked like lemmings Re-live a frustrating day three for England after being bowled out for just 325 By Oliver Holt For The Daily Mail Published: 22:05, 30 June 2023 | Updated: 22:30, 30 June 2023 e-mail 4 View comments As England’s players trudged slowly back to the pavilion at lunch , reeling from the events of the morning they had left behind , the soldiers of the British Army Band Tidworth took up position in front of the Grand Stand and raised their instruments to their lips. After a little while, they marched around to the Warner Stand and performed there, too. And then past the pavilion to station themselves in front of the Tavern Stand and the Mound Stand until they arrived beneath the Media Centre, that digital alarm clock in the sky. Gazing down on them, David Lloyd, the former England opener , England coach and commentator beyond compare, neatly articulated the sinking feeling so many of the supporters inside Lord’s were feeling. ‘And the band played on,’ he said. It had been a sobering passage of play that had reduced the Home of Cricket to a sullen silence. England had lost their last six wickets for 46 runs and the manner of some of the dismissals had led to the now familiar chorus of wailing and gnashing of teeth from the keepers of the flame. There were moments, undeniably, when England’s batsmen had looked like lemmings rushing towards a cliff as Australia’s bowlers peppered them with a barrage of short deliveries. They did not shirk the challenge. They swung for the fences and, generally, they missed. Australia picked up England's final six wickets at the cost of just 46 runs on Friday morning England kept to their attacking philosophy by swinging for the fences but generally they missed It would be sad if faith were lost in Brendon McCullum's Bazball now at the very first sign of adversity Exhibit A was Harry Brook stepping away from his stumps and aiming a wild, mistimed, cross-batted slash at a short delivery from Mitchell Starc, watching it loop in a lazy arc softly into the hands of Pat Cummins at extra cover. Jonny Bairstow chipped a tame catch to mid-on. Ollie Robinson charged down the wicket to makeshift spinner Travis Head and edged him into the hands of wicketkeeper Alex Carey and, after that, the end came quickly. England had made 325, 91 short of Australia’s first innings total, when they had started the day aiming for parity at least. By the end of the day, Australia had a lead comfortably north of 200. It felt as if that morning session might have been pivotal in the match and perhaps this Ashes series as a whole. As England struggle to keep pace with this formidable Australian team in a breathless sequence of Tests crammed into June and July, their continued embrace of a more aggressive style of cricket has exposed and exacerbated deep fault-lines and insecurities within the English game and those who love and cherish it. England had a bad session on Friday morning. It happens. After 11 wins in their previous 14 games, they were probably due one. But the alacrity with which the mass of opinion pounced on it, and sought to portray it as an apocalypse for Bazball, hinted at something deeper than disappointment about a few rash shots. It feels as if there is a fear among some cricket fans that Brendon McCullum, the England coach, and skipper Ben Stokes are fifth columnists who are colonising the Test game on behalf of the limited overs format. ‘I’ve enjoyed Bazball as much as the next person,’ a reader called John texted in to the BBC website, ‘but enough. This obsessive, aggressive, kamikaze batting has to be toned down. So disappointing to see England throwing it away.’ In an era of the sport when white-ball cricket is gaining more and more territory and time, and more traction among younger followers, when there is talk of the best limited overs players being contracted all year round by franchises with teams in leagues in India, Saudi Arabia and the USA, the desire to preserve the more measured, cerebral, strategic form of the game, unpolluted by limited overs ideology, feels stronger than ever. England and Yorkshire legend Geoffrey Boycott was unable to watch as Harry Brook played a horror shot Brook aimed a wild slash at a Mitchell Starc ball which looped softly into the hands of Pat Cummins Traditionalists are suspicious of England’s new style of play. They think it is a gimmick and they think it is disrespectful of Test cricket. They think it is naive. They think it rather vulgar. The reality, of course, is that it is a breathtakingly bold version of Test cricket that is the best hope of the game, in this form, surviving. And guess what? England will not excel in every session of every game playing it. Sometimes, like on Friday morning, it will make them look foolish and reckless. Sometimes, horror of horrors, they might even lose a match here and there. But when they get the mix of aggression and caution right, the sport they provide is peerless. So, yes, Brook’s dismissal looked ugly and distinctly ‘village’, but he had scored a half-century playing that way by then. Starc, Cummins and Josh Hazlewood were bowling brilliantly and the ball was moving around under leaden skies, so perhaps Brook figured the risk was worthwhile. Perhaps he decided he would rather lose his wicket trying to take the game to the opponents than trying to lean into a forward defensive prod and edging a delivery behind. In the new puritanical spirit pushing back against Bazball, losing your wicket to a poor defensive shot is far more preferable than losing it trying to attack. Oh for the times when England scored at less than three an over, were paralysed by caution and doubt, had no clear philosophy and looked frightened to play their shots and trust their talent. They went on a run of 17 Test matches where they only won once. Those were the days. There are times, of course, when this England team need to refine their approach. McCullum's approach has already contributed to one of the greatest Tests of all time in the first meeting at Edgbaston Australia's attack featuring Josh Hazlewood and Cummins (pictured) bowled well on Friday They need to choose their moments to go hard, as they did in the Tests of last summer. Australia were always going to present the toughest challenge to England’s new philosophy because they are the best Test team in the world. But it would be sad if faith were lost in Bazball now, at the very first sign of adversity, and we followed the urgings of men like jilted John. This summer, it has already helped to conjure the epic contest at Edgbaston, widely considered to be one of the greatest Test matches of all time. There is no reason to change tack. There is no going back. Share or comment on this article: OLIVER HOLT: So sad to lose faith in Bazball at the very first signs of adversity as England falter e-mail Add comment Comments 4 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-30 21:05:25","image_url":"https://i.dailymail.co.uk/1s/2023/06/30/22/72729879-0-image-a-35_1688159057393.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australians seize control of Ashes Test after near-perfect day three at Lord’s","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2023-cricket-scores-australia-vs-england-second-test-at-lords-day-three-live-updates-news-weather/news-story/f323de9e601114377bd7b7675b76e7e7","keywords":null,"creator":null,"video_url":null,"description":"Australia has seized control of the Lord’s Ashes Test after a frantic England collapse and another disciplined knock from opener Usman Khawaja headlined day three at St John’s Wood.","content":"Australia has seized control of the Lord’s Ashes Test after a frantic England collapse and another disciplined knock from opener Usman Khawaja headlined day three at St John’s Wood. England lost 6-47 during an eventful morning session, bowled out for 325 to give Australia a 91-run first-innings lead. In response, the visitors cruised towards 2-130 before rain forced a premature close to play, with Khawaja (58*) and Steve Smith (6*) unbeaten at stumps. England shot themselves in the foot on Friday afternoon with a dropped catch, which gifted Khawaja an extra life on 19, and an ill-judged non-review that denied Stuart Broad a much-needed wicket. Australia currently leads by 221 runs, and England requires nothing less than a herculean effort in the fourth innings to prevent Pat Cummins’ side from taking a 2-0 lead in the five-match series. TALKING POINTS: Poms shredded for ‘kamikaze cricket’; Aussie duo ‘absolutely bossed it’ ‘YOU HAVE TO ACTUALLY ASK THE UMPIRE’: Broad’s celebrappeal habit backfires MATCH CENTRE: England vs Australia stats, scorecard Earlier, Nathan Lyon arrived at Lord’s on crutches, with Cricket Australia confirming the veteran spinner has suffered a “significant calf strain” , putting his availability for the remainder of the series under severe doubt. After resuming day three at 4-278, England lost their remaining six wickets in less than 90 minutes, with paceman Mitchell Starc and part-time spinner Travis Head each snaring two wickets. Having patiently guided England to stumps the previous evening, Ben Stokes fell for 17 on the second delivery of the day after Starc found the England captain’s leading edge, with Cameron Green taking yet another superb catch at gully. Stokes sent walking from second ball! | 00:28 Harry Brook, who was dropped by Marnus Labuschagne the previous evening, brought up his maiden Ashes half-century in 63 deliveries — but couldn’t convert the start into a substantial score, departing for 50. The 24-year-old backed away and awkwardly swatted at a Starc bouncer, gifting rival captain Pat Cummins a regulation catch at extra cover — it was an ugly dismissal that exposed England’s long tail. Brook gone with VERY questionable shot | 00:32 Immediately after the drinks break, wicketkeeper Jonny Bairstow, England’s last recognised batter, attempted a lofted drive against Josh Hazlewood, instead chipping a chance towards Cummins at mid-on. Soon after, Green delivered a brutal bouncer that struck Broad near the jaw, but thankfully the Englishman avoided serious damage. Ollie Robinson was the next to depart, skipping down the pitch at Head and nicking behind to wicketkeeper Alex Carey, who claimed his umpteenth classy catch of the series. Head struck again later in the same over, trapping a sweeping Broad on the pads for 12 — a desperate review couldn’t save the Nighthawk. Cummins wrapped up the innings with a well-directed bouncer at Josh Tongue, which was fended towards substitute fielder Matthew Renshaw at short leg for 1. After dominating day two, England had slipped from 1-188 to 325 all out, swinging momentum firmly back in Australia’s favour. Travis Head of Australia appeals. Photo by Stu Forster/Getty Images Source: Getty Images Australian openers David Warner and Khawaja survived a nervy 20-minute passage of play before lunch — the floodlights needed to be switched on after dark clouds descended on the iconic venue. James Anderson thought he had unearthed a breakthrough early in the afternoon session, reviewing an LBW decision against Warner — but replays showed a thick inside edge onto the pads. The introduction of Josh Tongue almost did the trick for England, but Khawaja’s pull shot burst through Anderson’s hands at square leg and raced away for a boundary — it was the only chance he offered on day three. After a 63-run opening partnership, Tongue nipped a delivery into Warner’s pads from around the wicket, with the veteran batter wasting a review before trudging back to the sheds for 25. Tongue almost knocked over Marnus Labuschagne in his following over, with umpire Ahsan Raza giving the Australian No. 3 out LBW — only for the decision to be overturned when Hawkeye showed that impact was outside off. Labuschagne survived the final two deliveries before the tea break, with Broad’s back-to-back celebrappeals for caught behind and LBW failing to convince umpire Chris Gaffaney. Stokes wisely elected not to review either decision. It was third time’s the charm for Broad — after the lunch break, the England veteran trapped Labuschagne on the pads, sprinting towards the slips cordon without consulting Gaffaney, who didn’t raise the dreaded finger. Stokes once again denied the review — but on this occasion, Hawkeye suggested the ball would have crashed into leg stump, with Labuschagne surviving on 15. Stuart Broad of England. Photo by Ryan Pierse/Getty Images Source: Getty Images The Queenslander couldn’t make the most of his reprieve, lazily cutting a loose delivery from Anderson towards point and departing for 30. Khawaja reached fifty for the third time in the series with an elegant straight drive down the ground before rain intervened, forcing a premature end to proceedings in London. Despite the weather interruption, it was a near-perfect day for the Australians, who will look to extend their lead before hunting the ten wickets required for victory — albeit without Lyon at their disposal.","pubDate":"2023-06-30 20:59:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"England shredded for ‘kamikaze cricket’; Australian openers ‘absolutely bossed it’ — Lord’s Ashes Test Day 3 Talking Points","link":"https://www.foxsports.com.au/cricket/the-ashes/england-shredded-for-kamikaze-cricket-australian-openers-absolutely-bossed-it-lords-ashes-test-day-3-talking-points/news-story/21e216b5bf9f677b0d1ff856b564e6da","keywords":null,"creator":null,"video_url":null,"description":"Australia has edged ahead in the second Ashes Test after a rain-affected third day at Lord’s, with England needing another fourth-innings miracle to prevent Pat Cummins’ side from taking a 2-0 series lead.","content":"Australia has edged ahead in the second Ashes Test after a rain-affected third day at Lord’s, with England needing another fourth-innings miracle to prevent Pat Cummins’ side from taking a 2-0 series lead. The hosts were bowled out for 325 after a frantic collapse of 6-47 on Friday morning , giving Australia a 91-run first-innings lead in London. In response, the visitors cruised towards 2-130 at stumps, leading by 221 runs, with opener Usman Khawaja (58*) and vice-captain Steve Smith (6*) unbeaten overnight. Australia will look to extend its lead before hunting the ten wickets required for victory — albeit without veteran spinner Nathan Lyon at their disposal . These are the Talking Points from day three at Lord’s. DAY 3 WRAP: Aussies seize control after near-perfect day as blunders shatter England’s hopes ‘YOU HAVE TO ACTUALLY ASK THE UMPIRE’: Broad’s celebrappeal habit backfires ENGLAND SHREDDED FOR ‘KAMIKAZE CRICKET’ ‘Bazball’ isn’t foolproof, and on Friday morning, we saw what happens when England’s attacking approach to Test cricket backfires. The hosts failed to take advantage of the batter-friendly conditions in the first innings of the Lord’s Test, sacrificing a potential lead after collapsing early on day three. It was a bitterly disappointing result for England, who were cruising at 1-188 on Thursday evening when Nathan Lyon left the field with injury. Ben Stokes and his teammates had an opportunity to grind Australia’s quicks into the dirt after the veteran spinner’s setback, but instead threw their wicket away and crumbled in a heap. England’s top-order shot themselves in the foot by repeatedly attacking bouncers despite a cluster of fielders waiting behind square. Harry Brook’s dismissal was particularly reckless — after racing towards 50, he backed away from a Mitchell Starc bouncer and awkwardly spooned it towards rival captain Pat Cummins at extra cover. England legend Geoffrey Boycott shook his head in bemusement from the stands. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! Brook gone with VERY questionable shot | 00:32 “England clearly like losing,” former captain Michael Vaughan said on the BBC Test Match Special . “Seeing a player play a shot like that, it’s just not good enough at this level.” Brook was the fourth England batter to fall into Australia’s short-ball trap, with Ollie Pope, Ben Duckett and Joe Root departing after miscuing pull shots on Thursday evening. “It was kamikaze cricket,” former England batter Kevin Pietersen said on Sky Sports . “It was a bumpathon. England went flapping – and Australia picked up wickets quickly and very cheaply.” The Bazball mentality encourages freedom in the middle and abandoning any fear of failure — but there’s a fine line between fearlessness and carelessness. “England just looked confused with how they wanted to attack the short ball,” former Australian captain Aaron Finch told Channel 9. “You have to be able to adapt your game and adjust slightly. It doesn’t mean you lose the intent to score. I think they were just a little bit reckless in that period.” England’s aggressive batting has been a marvel over the past 12 months, but former Test captain Michael Atherton suggested the hosts lost control of their shot selection in the first innings. “If you go back to last summer, England’s approach is one of calculated aggression. Here, it seems to be all out aggression, no matter what,” Atherton said on Sky Sports. “They were just the wrong side of reckless in that innings, and this morning in particular with the dismissal of Harry Brook. “It has felt England are not in control of what they are doing.” Jonny Bairstow of England. Photo by Ryan Pierse/Getty Images Source: Getty Images AUSSIE OPENERS ‘ABSOLUTELY BOSSED IT’ Ben Stokes’ decision to bowl first after winning the toss on Wednesday proved the correct call, but the hosts haven’t made the most of the advantageous conditions at Lord’s this week. It was overcast and spitting with rain when David Warner and Usman Khawaja walked out to bat on Wednesday, with the Dukes ball hooping early in the morning session. But despite being dealt the toughest conditions for batting in the match, Australia’s openers combined for a 63-run partnership, ensuring the middle-order batters weren’t required until the afternoon session. When the clouds parted after lunch, centurion Steve Smith reaped the benefits of Warner and Khawaja’s discipline. In a frustrating moment of deja vu, the veteran openers were greeted by dark and gloomy conditions when Australia’s second innings got underway on Friday, with floodlights illuminating the hallowed turf. The umpires considered pausing the match due to bad light, but thankfully opted against it. “Great to see the umpires at Lord’s staying on the field with the lights on,” former Australian batter Mark Waugh tweeted. “Too often play is stopped in these circumstances. It proves whilst not perfect conditions are playable.” Usman Khawaja and David Warner. Photo by Ryan Pierse/Getty Images Source: Getty Images Despite the poor visibility, Khawaja and Warner once again survived the nervy passage of play, putting together 63 for the first wicket and setting a platform for Australia’s middle order. The fact that both had dire records in England prior to this series only speaks further to just how mentally tough they have been. “Australia have had the harder of the conditions throughout the match,” former England captain Nasser Hussain told Sky Sports during the tea break. “Lost the toss on a green pitch under cloudy skies. Third day, cloudy skies, lights on, ball moving around — they have battled through again. “To be 172 runs ahead and one wicket down when you have had the worst of the conditions speaks volumes about the skill but also the toughness. “They have absolutely bossed it.” Despite not converting his starts of 66 and 25 into triple figures, Warner has helped put Australia within touching distance of a 2-0 series lead, while Khawaja will be eyeing a 16th Test century on Saturday morning. MARNUS FALLS TO WORST DELIVERY OF THE DAY After surviving three LBW shouts on Friday , Marnus Labuschagne was dismissed by the worst delivery he faced in the second innings. England’s bowlers had been relentlessly targeting the Queenslander’s stumps on day three, with mixed success. Labuschagne occasionally flicked off his pads towards the boundary rope, but he never quite looked comfortable against the swinging Dukes ball. However, after weathering the storm, Labuschagne fell victim to England veteran James Anderson in the evening session for 30 — although perhaps not as he would have expected. Anderson delivered a rank half-tracker outside off stump that Labuschagne looked to carve through point — but instead, the ball ballooned directly towards Harry Brook at point. It was the third dismissal of the series where Labuschagne was guilty of fishing at a wide delivery, with Stuart Broad knocking him over cheaply in both innings at Edgbaston. By his own admission, the twin dismissals in Birmingham were “very uncharacteristic” — Labuschagne is renowned for being a superb judge of when to leave the ball. According to CricViz , nobody has left more deliveries against pace bowlers in Tests than the right-hander since October 2018. “I just made a few poor decisions (against balls) that were really wide. They’d be eighth or ninth stump, some of those deliveries,” Labuschagne told reporters earlier this week. “They were very uncharacteristic dismissals to how I’ve usually played, that’s why I was pretty frustrated with myself to get out that way and asked myself the question, ‘Why did I play at those deliveries?’ “It’s a rarity that I’d play at those balls, so it’s not something I’m going to overthink, but I hold myself to a much higher standard than those dismissals.” Labuschagne, who until last week was the world’s No. 1 Test batter, has reached fifty just once in his 14 most recent knocks, a worrying slump for the talented right-hander. Marnus Labuschagne of Australia. Photo by Ryan Pierse/Getty Images Source: Getty Images ‘THIS LAD IS SPECIAL’: GREEN DOES IT AGAIN Cameron Green can do no wrong at gully. The West Australian added another ripping catch to his career highlights reel on Friday morning, sending rival captain Ben Stokes back to the sheds in the first over of the day. Mitchell Starc found the left-hander’s leading edge, and Green reacted quickly at gully, throwing his arms out and holding onto the fast chance. The 25-year-old has taken five catches since the start of the World Test Championship final against India, at least three of which were absolute screamers. His long limbs and added wingspan allow him to snaffle more chances than the average fielder — and they always seem to stick. As revealed by CricViz , only Indian vice-captain Ajinkya Rahane boasts a higher catch success percentage among outfielders since Green’s Test debut in 2020. Speaking on Sky Sports , former England captain Nasser Hussain claimed that Green was the best fielder he had witnessed since Mark Waugh. “He covers so much ground for a big unit,” Hussain said. “This lad is special. “He doesn’t have a weak side. He is phenomenal in there, he really is.” Stokes sent walking from second ball! | 00:28 ‘HE’S HANDY’: HEAD’S SURPRISE SPIN ROLE Who needs the GOAT? After Nathan Lyon’s devastating injury setback, Travis Head was tasked with stepping in as Australia’s premier spinner on day three of the Lord’s Test — and the South Australian once again proved he’s no part-timer with the ball. Head struck twice in the 76th over of England’s first innings, removing Ollie Robinson and Stuart Broad in quick succession. Robinson charged down the wicket and looked to smack the off-spinner into the stands, instead nicking behind to wicketkeeper Alex Carey — who could have easily completed a stumping if not for the edge. A few deliveries later, Broad was trapped LBW after attempting a misjudged sweep shot, wasting a review before trudging back to the sheds. Head finished the innings with 2-17 from seven overs, with his Test bowling average sinking to 28.77. It comes after he claimed 4-10 in an unforgettable spell against Sri Lanka in Galle last year. “He’s handy,” ABC commentator Jim Maxwell said of Head’s bowling. “He’s more of a chance than Smith these days.” However, Head’s job is far from over — he looms as a crucial figure for Australia in the fourth innings, and England’s top-order will no doubt be looking to target the spinner on day five. Travis Head of Australia. Photo by Stu Forster/Getty Images Source: Getty Images","pubDate":"2023-06-30 20:44:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Ange sends social media wild after cheering on Aussies at Lord’s","link":"https://www.foxsports.com.au/football/premier-league/ashes-2023-second-test-at-lords-ange-postecoglou-watches-australia-vs-england-on-day-three-spurs-tottenham-news/news-story/546eba0f7b5070ac90cdbd9f086ef261","keywords":null,"creator":null,"video_url":null,"description":"Australian manager Ange Postecoglou doesn’t officially start his new role as head coach of Premier League side Tottenham Hotspur until tomorrow – but he’s made himself at home in the English capital, enjoying a day watching the Ashes at Lord’s.","content":"Australian manager Ange Postecoglou doesn’t officially start his new role as head coach of Premier League side Tottenham Hotspur until tomorrow – but he’s made himself at home in the English capital, enjoying a day watching the Ashes at Lord’s. Postecoglou was spotted in the Cricket Australia Suite as Australia took control of the second Test, sending social media wild with jokes about Spurs – a team infamous for their soft underbelly and repeating the same mistakes time and again. That sort of performance was on display from the hosts at Lord’s, as England’s Bazball approach saw batters attack the Australian bouncer barrage – and be cheaply dismissed time and again. READ MORE DAY THREE: Bazball implodes in frantic collapse as steady Aussies cash in on shambles ‘F***ING STUPID’: England star torched over horrific dismissal ‘HE COULD JUST TELL’: Aussie legend opens up on Parkinson’s diagnosis ‘YOU HAVE TO ACTUALLY ASK THE UMPIRE’: Broad’s weird habit backfires One fan wrote on social media: “Watching a very ‘Spursy’ type performance by England.” Another tweeted: “Hope he’s taking notes on how to win from Australia and not England.” But his surprise appearance caught the commentators out, with Nasser Hussain unsure of the Aussie’s name. Postecoglou has been in the headlines in recent days after landing a major signing for Spurs in England midfielder James Maddison. The former Leicester star revealed Postecoglou had a major influence in convincing him to move to North London on a £40 million deal. Maddison revealed: “(Ange) said one thing to me on the call, I hope he won’t mind me saying this, but he said, ‘whether you come or not, you’re going to see a completely different Spurs team under me’, and that kind of stuck with me that he said that.” Postecoglou was spotted with Former Deputy Prime Minister Of Australia, Michael McCormack (Back L), Former Prime Minister of Australia, John Howard and his wife Janette Howard (Back C and R), Chair of Cricket Australia, Mike Baird (Front L). Source: Getty Images Postecoglou is a known cricket fan. In an interview he did with late cricket great Shane Warne while at previous club Celtic, he told Warne: “Pleasure to speak to you too mate, growing up in Melbourne, even though it might be bizarre as an ethnic boy, an immigrant, my first passion was obviously soccer but growing up in Melbourne you had Aussie rules and in the summer it was all cricket. “As kids that is all we did, we just played cricket the whole time.” The Daily Mail even suggested Postecoglou could use his love of cricket to bond with superstar Spurs striker Harry Kane, whose future is in doubt. Kane is a big cricket fan, with plenty of footage of Spurs players playing a bit of backyard cricket in the Tottenham training gym. Richard Gibson wrote in the Daily Mail: “Perhaps Ange Postecoglou can bond with Harry Kane over a love of cricket in his attempts to persuade the England captain to remain with Tottenham this summer.” Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! Brook gone with VERY questionable shot | 00:32","pubDate":"2023-06-30 20:41:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Khawaja adds to England's Ashes agony after Starc strikes in 2nd Test","link":"https://www.news24.com/sport/Cricket/khawaja-adds-to-englands-ashes-agony-after-starc-strikes-in-2nd-test-20230630","keywords":null,"creator":null,"video_url":null,"description":"Australia's Usman Khawaja dug in to put Australia in control against England after the hosts' batting collapse in the second Ashes Test at Lord's on Friday.","content":"Australia's Usman Khawaja dug in to put Australia in control against England after the hosts' batting collapse in the second Ashes Test at Lord's on Friday. STUMPS | England v Australia, 2nd Test - Day 3 Ashes-holders Australia were strongly placed at 130-2 in their second innings, a lead of 221 runs, when rain forced an early close to the third day's play. Conditions for batting, with the floodlights switched on to counter the gloomy skies in London, were challenging. But Khawaja, whose hundred at Edgbaston last week helped Australia take a 1-0 lead in the five-match series, held firm to reach 58 not out at stumps. Steve Smith was unbeaten on six following his 110 in Australia's first-innings 416. Khawaja and fellow left-handed opener David Warner, who made an unusually restrained 25 off 76 balls, were content to defend in traditional Test-match fashion against the moving ball. And when Stuart Broad overpitched, Khawaja stylishly drove him through cover-point for four. Australia's approach was in marked contrast to the aggressive 'Bazball' style that led to several England top-order batsmen throwing away their wickets against the short ball on Thursday. Khawaja was reprieved on 19 when he pulled fast bowler Josh Tongue to James Anderson at forward square only for the ball to go through the hands of the England veteran, who did not appear to pick up the ball early enough. England eventually broke through after repeatedly beating the outside edge when Ashes debutant Tongue nipped one back to have Warner lbw, leaving Australia 63-1. Marnus Labuschagne was given out lbw for just three, only for the decision to be overturned on review. Labuschagne, however, was dismissed for 30 when he steered Anderson to Harry Brook at backward point. But Khawaja, combining attack and defence, completed a 105-ball fifty, with 40 of his runs coming in boundaries. Earlier, Mitchell Starc led the world Test champions' charge as England collapsed to 325 all out in a subdued atmosphere at Lord's. The home side, who had resumed on 278-4, added 47 runs in 15.2 overs as the wickets tumbled, with Australia 91 runs ahead on first innings. Starc, the only change to the Australia XI that enjoyed a thrilling two-wicket win at Edgbaston, took 3-88 in 17 overs. \"It's a shame it finished early today but it was a really positive morning for us to bowl them out and have a bit of a lead,\" Starc told the BBC. \"Our top order capitalised on that early, there was some good bowling, pressure built but our guys got through that.\" Turning to England's slump, he added: \"We knew if we could take a couple (of wickets) early and get some inroads into their tail, things could go the way they did.\" Several England batsmen, including opener Ben Duckett, who was out for 98, fell into a blatant hooking trap late on the second day. England suffered a further setback off just the second ball of Friday's play when captain Ben Stokes fell for his overnight 17. A delivery from left-arm express quick Starc leapt off a length and took the outside edge, with Cameron Green holding a sharp catch at second slip. It was a morale-boosting start to the day for Australia, bidding for a first Ashes series win in England in 22 years, after off-spinner Nathan Lyon was unable to take the field after suffering a calf strain. England rising star Brook, 45 not out overnight, completed a 63-ball fifty but his determination to attack proved his undoing. Brook backed away from a short Starc ball and tried to flat-bat the delivery down the ground, only to slice to extra-cover, where Australia captain Pat Cummins held a simple catch. At 293-6 England were left looking to Jonny Bairstow, the last of their specialist batsmen, to get on level terms. Bairstow, however, had only managed 16 when he chipped fast bowler Josh Hazlewood to Cummins at mid-on in search of quick runs with only the lower order for company. Part-time spinner Travis Head, filling in for Lyon, took two wickets in five balls, a charging Ollie Robinson caught behind, before Broad, previously shaken up a Green bouncer, was lbw.","pubDate":"2023-06-30 19:41:58","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Lethal! Shaheen Afridi Takes Four Wickets in One Over During Nottinghamshire vs Warwickshire VitalityT20 Blast 2023 Match (Watch Video)","link":"https://www.latestly.com/socially/sports/cricket/lethal-shaheen-afridi-takes-four-wickets-in-one-over-during-nottinghamshire-vs-warwickshire-vitalityt20-blast-2023-match-watch-video-5236870.html","keywords":null,"creator":null,"video_url":null,"description":"Alex Davies, Chris Benjamin, Dan Mousley and Ed Barnard were the four wickets of Warwickshire that were picked by Shaheen Shah Afridi in his first over.","content":"Shaheen Shah Afridi continues his first over exploits for Nottinghamshire in the Vitality T20 Blast 2023 as he takes 4 wickets in his first six deliveries against Warwickshire. Shaheen started with five wides only to take two wickets in next two balls and then finish the over again with two consecutive wickets, conceding 7 runs and taking 4 wickets in that over. Shaheen Afridi, you cannot do that!! 💥 — Vitality Blast (@VitalityBlast)","pubDate":"2023-06-30 19:38:14","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"TOP SPIN AT THE TEST: Khawaja leads Root by over 100 runs for the series, Brook notches an eighth 50","link":"https://www.dailymail.co.uk/sport/cricket/article-12252433/TOP-SPIN-TEST-Khawaja-leads-Root-100-runs-series-Brook-notches-eighth-50.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"TOP SPIN AT THE TEST: England's batting collapse continued through from the evening session of day three to finish bowled out for 325 before lunch on Friday morning.","content":"TOP SPIN AT THE TEST: Khawaja leads Root by over 100 runs for the series, Brook notches an eighth 50 in 14 Tests and England's bowlers fail to take a wicket in the opening 20 overs AGAIN Marnus Labuschagne still averages a tick under 55 despite recent poor form Josh Hazlewood took two wickets in England's 325 but conceded 71 runs from 13 Re-live all the action from Lord's as Australia dominate England with 221-run lead By Lawrence Booth for the Daily Mail Published: 20:31, 30 June 2023 | Updated: 20:31, 30 June 2023 e-mail View comments England's batting collapse continued through from the evening session of day three to finish bowled out for 325 before lunch on Friday morning. Ben Stokes went second ball, and was quickly joined by Harry Brook, Jonny Bairstow and the England tail in the pavilion as Australia made short work of ending the first innings. The hosts trailed by 91 runs when the Aussies came back to the crease, but once again the immovable Usman Khawaja proved resolute, although Josh Tongue claimed the scalp of David Warner for the second time in the Test for 25. Marnus Labuschagne survived an un-reviewed lbw scare before departing for 30 off Jimmy Anderson, before Steve Smith joined the Khawaja at the crease to see out the day until stumps was called shortly before 6pm sue to poor weather, with the visitors 221 runs to the good. Here, Mail Sport's LAWRENCE BOOTH shares the key statistics from the third day of the second Ashes Test at Lord's. In both innings England have now failed to pick up a wicket in the opening 20 overs Usman Khawaja's 280 runs for the series so far is more than 100 runs ahead of second-place Joe Root Usman Khawaja has quickly established himself as the batsman of the series. His unbeaten 58 here took his series haul to 280 runs at 93 – more than 100 clear of second-placed Joe Root. In both Australian innings, England failed to take a wicket inside the first 20 overs for the first time in a home Test since Headingley 2012 against South Africa. Since finishing Australia’s home series against South Africa in January with 79 at Sydney, Marnus Labuschagne has now scored one half-century in his last 14 innings. Marnus Labuschagne has now scored only one half-century in his last 14 innings but has an average a tick under 55 Despite that, his Test average remains a tick under 55. Harry Brook’s 50 was the eighth time in his 14 Test innings that he has made at least a half-century. His 946 runs have come at an average of 72 at a strike-rate of 96. Josh Hazlewood took two wickets in England’s 325, but also conceded 71 in 13 overs – at 5.46 an over the most expensive analysis of his 61-Test career. Share or comment on this article: TOP SPIN AT THE TEST: Khawaja leads Root by over 100 runs for the series, Brook notches an eighth 50 e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-30 19:31:12","image_url":"https://i.dailymail.co.uk/1s/2023/06/30/20/72727879-0-image-a-72_1688153461329.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"}]}