{"newsArray":[{"title":"Chevrons thump Netherlands to clinch series","link":"https://www.sundaynews.co.zw/chevrons-thump-netherlands-to-clinch-series/","keywords":["Sports"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ZIMBABWE sent a strong message to their opponents when they made light work of Netherlands with a brilliant all-round performance to win the One Day International cricket series decider by seven wickets, victory achieved with 50 balls remaining at Harare Sports Club yesterday. Playing in front of a buzzing crowd, Zimbabwe were sent […]","content":"The Sunday News ZIMBABWE sent a strong message to their opponents when they made light work of Netherlands with a brilliant all-round performance to win the One Day International cricket series decider by seven wickets, victory achieved with 50 balls remaining at Harare Sports Club yesterday. Playing in front of a buzzing crowd, Zimbabwe were sent in to bowl first and restricted the Dutch to 231/9 in 50 overs before they went on to put a brilliant effort with the bat, finishing on 235/3 in 41.4 overs to clinch the series 2-1. After two poor performances in the opening matches, the Zimbabwean bowlers got back to their best with the veteran, left arm spinner Sean Williams finishing as the leading wicket taker, taking 3/41 in 10 overs while off spinner Sikandar Raza had 2/55 from the same overs. Tendai Chatara, Richard Ngarava, Wessly Madhevere and Blessing Muzarabani all picked up a wicket each to help the Chevrons keep their opponents to the lowest first innings score of the series. There were no milestones from the Dutch batting order with the top scorer being Max O’Dowd with 38 runs coming from 43 deliveries while the skipper Scott Edwards compiled 34 runs from 41 balls and Musa Ahmed chipped in with a 43-ball 29 runs. Zimbabwean openers, Craig Ervine and Madhevere put up a 96 runs first wicket partnership before the skipper, Ervine fell six runs short of his half century on 44 runs from 55 balls while Madhevere scored his first half century of the series. He fell for 50 runs off 61 balls. Gary Ballance, coming in to bat at number three saw the team through with his first half century of the series as well, remaining undefeated on 64 runs from 72 balls. Williams scored 43 runs off 53 deliveries before he was bowled by Fred Klaasen. Raza’s nine-ball 18 runs saw Zimbabwe convincingly take the series. Ahmad and Klaassen took the only wickets for the Dutch with the former taking two and the latter taking one. This win is a big boost for the Chevrons as they prepare for the International Cricket Council (ICC) 2023 World Cup Qualifiers which will be hosted in Zimbabwe in June. The victory also saw the hosts extend the gap between them and their opponents on the ODI Super League standings. The Super League serves as a pathway for direct qualification to the World Cup in India in October. Both teams however missed out on direct entry and will be hoping to secure the two remaining spots that will be up for grabs in June. Follow on Twitter @brandon_malvin","pubDate":"2023-03-25 22:04:39","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Chevrons seal series in empathic style","link":"https://www.sundaymail.co.zw/chevrons-seal-series-in-empathic-style","keywords":["Sports"],"creator":["tawandamusarurwa"],"video_url":null,"description":"Sports Reporter AN unbeaten half-century by Gary Ballance was but the tip of the iceberg of many talking points of Zimbabwe’s seven-wicket victory over the Netherlands at Harare Sports Club yesterday. The win gave Zimbabwe the three-match series, which they took 2-1. However, with both nations out of the running for the automatic eight top […]","content":"The Sunday Mail AN unbeaten half-century by Gary Ballance was but the tip of the iceberg of many talking points of Zimbabwe’s seven-wicket victory over the Netherlands at Harare Sports Club yesterday. The win gave Zimbabwe the three-match series, which they took 2-1. However, with both nations out of the running for the automatic eight top spots that will qualify for the ICC Men’s Cricket World Cup on the Super League log standing, the series provided both sets of technical teams a chance to experiment and seize up the oppositions. The Netherlands will be back here again for the 2023 ICC Men’s Cricket World Cup Qualifiers, which Zimbabwe is hosting from June 18 to July 9. Two of the major talking points from the series, and more specifically yesterday’s victory, pertain to Zimbabwe’s top order. The Netherlands won the toss and elected to bat, getting off to a blistering start, courtesy of a solid opening stand by Vikramjit Singh and Max O’Dowd. The Dutch pair put up a 67 runs off 82 balls during their opening partnership, with O’Dowd top-scoring for his side with 38 runs off 43 balls. That was before he was caught out by the returning Richard Ngarava off the bowling of Blessing Muzarabani in the 13th over. His partner Singh (27) did not last long after that, falling roughly three overs later when he was caught by Zimbabwe skipper Craig Ervine off the bowling of Sikandar Raza. Raza’s introduction, and that of fellow spinners Wessly Madhevere and Sean Williams, seemed to tilt the game in Zimbabwe’s favour as runs dried up and boundaries were few and far in between. With the exceptions of cameo knocks by Collin Ackerman (37) and Musa Ahmed (29) — who shared a third-wicket stand of 60 runs off 79 balls — the Netherlands never seemed to get back in the game. And 231 runs for nine never seemed like a defendable score. Zimbabwe’s trio of Raza, Madhevere and Williams did most of the damage, taking six wickets between them. The three bowled a collective 30 overs. Williams finished the pick of the Zimbabwean bowlers, taking three wickets for 41 runs, while Raza chipped in two for 55 runs. It was then that Zimbabwe’s top-order one-upped their opposition as Madhevere, Ervine, Ballance and Williams all made match-winning contributions. Zimbabwe’s batting woes have always been a bone of contention as, more often than not, the Chevrons’ top order falls cheaply and burdens their middle order and tail with most of the heavy lifting. In fact, during this just-ended series, Zimbabwe has had to rely on the exploits of Clive Madande and Williams to bring some respectability to their totals. Madande’s 74 runs off 98 balls during the first ODI helped the Chevrons to 249, albeit on a losing note, and Williams’ 77 runs of 73 balls turned out to be match-winning innings in the second. The Chevrons’ top order showed glimpses of what they are capable of doing during yesterday’s win, as Ervine and Madhevere’s 96 runs off 108 balls gave Zimbabwe a solid start to their run chase. Granted, 231 was not much of a target, but the pitch looked to be spin-friendly. A crucial third-wicket partnership between Balance and Williams soon followed, with the pair piling up 96 runs off 113 balls to move the Chevrons to within touching distance of their target. What these two partnerships did was give Raza, another key talking point, the freedom to play to his strengths as he blasted a quickfire 18 runs off nine balls that helped Zimbabwe cross the finishing line. It was a cameo Raza badly needed as he has failed to really affect the game with the bat all series. Ballance and Madhevere were also able to convert their good starts, with the pair making half centuries to the winning cause. Ballance top-scored for the Chevrons with an unbeaten 64 runs off 72 balls, which included eight boundaries, while Madhevere made 50 runs off 61 balls that included seven boundaries. While Williams was named both the Man-of-the-Match and series for his 43 runs and three for 41, there were a couple of other players who put their hands during the series. Madande had a pair of good innings with the bat during the first two games, scoring back-to-back half centuries (74 and 52). Madhevere has future star written all over him. The 22-year-old took his first hattrick during the second ODI, a performance that is sure to give him a lot of confidence going forward. Ballance needs more innings and performances like yesterday’s game, otherwise, in the 33-year-old batter, Zimbabwe could have a vital cog of their top order. There appears to be plenty of fight left in Sean Williams, as the 36-year-old easily returned back into the team with two match-winning cameos of 77 and 43 runs in the second and third ODIs.","pubDate":"2023-03-25 22:02:30","image_url":null,"source_id":"sundaymail","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"\"बाउंड्री की लंबाई हमारे हाथ में नहीं, जिसने की, उनसे पूछो\", सवाल पर नाराज हो गयीं हरमनप्रीत कौर","link":"https://sports.ndtv.com/hindi/cricket/boundry-length-is-not-our-hand-ask-those-how-have-reduced-it-harmanpreet-kaur-become-angry-at-question-3892923#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"DCW vs MIW, Final: देखने वाली बात होगी कि रविवार को खेले जाने वाले फाइनल मुकाबले में बाउंड्री की लंबाई क्या रहती है.","content":"मुंबई इंडियंस की कप्तान हरमनप्रीत कौर भारतीय टीम और मुंबई इंडियंस की कप्तान हरमनप्रीत कौर ने शनिवार को महिला प्रीमियर लीग (WPl 2023) में छोटी ‘बाउंड्री' के मुद्दे पर टिप्पणी करने से इनकार कर दिया और कहा कि इस तरह की सीमाओं पर फैसला करना प्रशासकों का काम है, खिलाड़ियों का नहीं. इस महीने के शुरू में आरंभ हुए शुरूआती डब्ल्यूपीएल में बीसीसीआई (BCCI) के निर्देश पर ‘बाउंड्री' सीमा को पिछले महीने के टी20 विश्व कप से पांच मीटर कम और अधिकतम 60 मीटर तक रखा गया. यह फैसला बड़ा स्कोर बनाने में मदद के लिए किया गया ताकि स्टेडियम और टीवी पर मैच देख रहे दर्शकों का मनोरंजन हो जिन्हें ज्यादा से ज्यादा चौके और छक्के देखने को मिलें. टूर्नामेंट के दोनों स्टेडियम नवी मुंबई में डीवाई पाटिल स्टेडियम और ब्रैबोर्न स्टेडियम में बाउंड्री की सीमा 42-44 मीटर कर दी गयी. रविवार को यहां ब्रैबोर्न स्टेडियम में होने वाले फाइनल से पहले मुंबई इंडियंस की कप्तान से जब इस पर सवाल पूछा गया तो उन्होंने कहा, ‘हम लोगों ने थोड़े ही रस्सी लगायी है, जिन्होंने रस्सी लगायी है, आप उनको ही पूछो. उन्होंने कहा, ‘यह हमारे हाथ में नहीं है. यह अधिकारियों के हाथ में है. आप उनसे बात कर सकते हो.' अब इस सवाल के बाद यह देखने वाली बात होगी कि रविवार को मुंबई और दिल्ली के बीच खेले जाने वाले फाइनल मुकाबले के लिए बाउंड्री की लंबाई कितनी रखी जाएगी. इसमें दो राय नहीं कि खेल के रोमांच का तड़का लागने के लिए पांच-छह मीटर बाउंड्री कम करना एक बार को चलेगा, लेकिन जब बाउंड्री 42-44 मी. की हो जाएगी, तो जाहिर कि सवाल तो उठेंगे ही. पहले साठ से पचपन और फिर बाउंड्री का 42-44 मी. पर सिमटना एक वह बात हो चली है, जिससे बीसीसीआई को गंभीरता से लेना होगा. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-25 18:36:22","image_url":"https://c.ndtvimg.com/2023-02/f03up3jg_harmanpreet-kaur_625x300_24_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“It’s a massive challenge but we are confident”: Meg Lanning ahead of WPL final against Mumbai Indians","link":"https://thenewsmill.com/2023/03/its-a-massive-challenge-but-we-are-confident-meg-lanning-ahead-of-wpl-final-against-mumbai-indians/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Delhi Capitals will square off against Mumbai Indians in the inaugural Women’s Premier League final at Brabourne Stadium on Sunday. With less than 24 hours left into the game, Delhi Capitals skipper Meg Lanning believes that her team is ready to face an irrepressible Mumbai team. “Obviously they have played well last night to get to this point we know how dangerous they can be and how many great players they have got so it’s a massive challenge for Delhi but we are confident as well. We come in having big sort of push in the few games I think which is really important,” Lanning said in pre-match conference. “We haven’t had things go our way. So I feel like this prepares us really nicely for a high-pressure game tomorrow night so we just gotta go out there and play our best cricket what we have done throughout the tournament is play with a smile on our faces and really enjoyed it and that is certainly what I will be encouraging the girls to do tomorrow night enjoy the experience embrace it who knows if we get back here again so we need to make the most of the opportunity and go out there have some fun,” she added. Delhi Capitals success has more or less been defined by their destructive opening pair of Shafali Verma and Meg Lanning. Mumbai Indians skipper Harmanpreet Kaur shed some light on the approach her team will follow to keep the successful duo quiet. “I think in this tournament they have the best opening combination in the tournament and I think they did well against us also in the last game they did really well and other teams also. We know what they can do and how dangerous they are we do have some plans and hopefully, we are able to execute them also,” Harmanpreet said. She further went on to praise the opposition captain for her influential leadership skills throughout the Women’s Premier League. “I think for her (Meg Lanning) it is so easy for her to make changes and come up with a good plan. But it has been a challenge for us. If you look at this WPL you can see it is a balanced side and she is leading from the front. So I think the best thing you can learn from her is that she is not someone who is dependent on the players she is someone who always leads from the front.” “Even in this WPL also she is leading from the front so I think that is something you want from your leader so when a leader comes forward and gives you a response so when your team does well. So I have learned these things from her. Tomorrow’s match will be important and I know she is not someone who will give up easily so we have to fight till the end and our team is ready for that,” Harmanpreet continued. (ANI)","pubDate":"2023-03-25 18:31:24","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"video: रोहित शर्मा ने पत्नी और बेटी के साथ किए डांस से लूट ली महफिल, वीडियो हो रहा वायरल","link":"https://sports.ndtv.com/hindi/cricket/video-rohit-sharma-set-the-stage-on-fire-with-his-dance-moves-with-wife-and-daughter-3893503#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"रोहित शर्मा (Rohit Sharma) हाल ही में साले की शादी में हिस्सा लेने के लिए पहले वनडे से हट गए थे. और उनका यह डांस वीडियो शादी समारोह का है.","content":"रोहित शर्मा का अंदाज-ए-डांस भी बैटिंग की तरह ही स्पेशल है भारतीय कप्तान रोहित शर्मा (Rohit Sharma) सिर्फ मैदान पर बल्ले से ही आग लागना नहीं जानते, बल्कि वह स्टेज पर डांस के मामले में भी ऐसा कर सकते हैं! भले ही रोहित एक पेशेवर डांसर नहीं हैं, लेकिन जाहिर है कि जब रोहित किसी स्टेज पर डांस करेंगे, तो सभी की नजरें बड़े-बड़े डांसरों से हटकर रोहित पर ही टिक जाएंगी. और कुछ ऐसा ही रोहित ने हाल ही में अपने साल की शादी समारोह में किया. अपने शांत मिजाज के लिए मशहूर रोहित शादी के दौरान एक अलग ही अवतार में दिखे और मंच पर पत्नी रितिका और बेटी समाइरा के साथ डांस करके पूरी महफिल लूट ली. रोहित ने शादी से जुड़ा एक वीडियो अपने इंस्टाग्राम पर पोस्ट किया है, जिसमें रोहित के प्रशंसक अपने हीरो को \"डांसताल\" करते हुए देख सकते हैं. मुंबई इंडियंस ने अपने कप्तान के वीडियो पर कमेंट करते हुए लिखा, \"फुल वाइब है, स्किप.\" हाल ही में रोहित साले की शादी में हिस्सा लेने के लिए ऑस्ट्रेलिया के खिलाफ पहले वनडे मुकाबले से हट गए थे. हालांकि, उनके हटने का टीम इंडिया पर असर नहीं पड़ा था. और भारत ने कंगारुओं के खिलाफ पहला वनडे जीत लिया था. लेकिन विडंबना यह रही कि रोहित के वापसी करने के बावजूद भारत 2-1 से सीरीज गंवा बैठा. यह भारत की साल 2019 के बाद घर में किसी वनडे सीरीज में पहली हार रही. बहरहाल, अब रोहित एक बार फिर से शुरू होने जा रही इंडियन प्रीमियर लीग में बल्ले से जलवा बिखरते दिखायी पड़ेंगे. उनके चाहने वाले बेसब्री से अपने हीरो को फिर से धूम-धड़ाका करते देखने के लिए बेकरार हैं. इस साल का संस्करण मार्च 31 से शुरू हो रहा है. पहला मुकाबला गत चैंपियन गुजरात और चेन्नई सुपर किंग्स के बीच खेला जाएगा. रोहित की कप्तानी में मुंबई इंडियंस ने पांच बार खिताब जीता है. और मुंबई एक बार फिर से खिताब पर नजरें गड़ाए हुए है. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-25 18:26:02","image_url":"https://c.ndtvimg.com/2023-03/p0i3sr9_rohit-sharma-dance-806_625x300_25_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"यह बहुत ही शानदार और धोनी का सबसे बेहतरीन छक्का था', दोस्त रैना ने याद किए पुराने पल","link":"https://sports.ndtv.com/hindi/cricket/it-was-such-a-fantastic-and-finest-six-of-ms-dhoni-buddy-raina-recalls-old-memories-3893320#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"जियो सिनेमा पर एक कार्यक्रम में सुरेश रैना ने विस्तार से एमएस धोनी (MS Dhoni) से जुड़े रोमांचक किस्सों को बताया है","content":"टीम इंडिया के पूर्व बल्लेबाज और धोनी के खास दोस्तों में से एक सुरेश रैना अब यह तो करोड़ों क्रिकेटप्रेमी जानते ही हैं कि एमएस धोनी और सुरेश रैना की दोस्ती कैसी रही है. कई साल तक भारत के लिए खेलने के बाद इन दोनों के संबंध चेन्नई सुपर किंग्स के लिए खेलने के दौरान और भी ज्यादा मजबूत हो गए. इसी दौरान धोनी का नाम \"थाला (बड़ा भाई)\" और रैना का नाम \"चिन्ना थाला\" (छोटा भाई) पड़ गया. और अब रैना ने जियो सिनेमा पर प्रसारित हुए हालिया एपिसोड-\"माय टाइम विद धोनी\"- में धोनी से जुड़ी कई बातों को लेकर खुलासा किया. रैना ने उस पल को याद किया, जब उन्होंने पहली बार धोनी और उनके द्वारा लगाए गए बड़े-बड़े छ्क्कों को देखा. यह साल 2004 का समय था, जब धोनी ईस्ट जोन के खिलाफ सेंट्रल जोन के लिए खेल रहे थे. रैना ने उस समय को याद करते हुए कहा कि तब हम झारखंड के उस खिलाड़ी के बारे में बहुत ही जोर-शोर से सुन रहे थे, जो नियमित रूप से स्टेडियम के बाहर छक्के मारने के लिए मशहूर हो चला था. उन्होंने कहा कि एक दिन हम इकट्ठा थे, जबकि धोनी भाई चुपचाप एक कोने में बैठकर रोटी और बटर चिकन खा रहे थे. तब उन्हें ज्ञानू भाई (ज्ञानेंद्र पांडेय) ने देखा और कहा, \"मैं वास्तव में नहीं सोचता कि वह हमारा कोई नुकसान करने जा रहा है. वह अपने खाने का लुत्फ उठा रहा है. उसका इसका मजा लेने दो.\" रैना ने कहा कि जब धोनी बैटिंग के लिए आए, तो कप्तान मोहम्मद कैफ ने उनके खिलाफ आक्रामक फील्डिंग सजा दी, लेकिन एमएस ने शुरुआत से ही लंबे-लंबे छक्के जड़े और ज्ञानू भाई को अपने शब्द वापस लेने को मजबूर होना पड़ा. लेकिन वास्तव में रैना को और अटैकिंग धोनी के छक्कों के दर्शन तब हुए, जब वह उनके साथ आईपीएल में साथ-साथ खेले. रैना ने धोनी के सबसे गगनचुंबी छक्के को याद करते हुए कहा, \"यह समय साल 2010 का था, जब हम धर्मशाला में किंग्स इलेवन पंजाब (अब पंजाब किंग्स) के खिलाफ खेल रहे थे. तब धोनी ने लांग-ऑन के ऊपर से लंबा छक्का जड़ा और इसके बाद उन्होंने अपने हेलमेट पर पंच किया. मैंने इसके बाद कभी भी धोनी को किसी भी हालात में ऐसी प्रतिक्रिया करते हुए नहीं देखा. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-25 18:02:48","image_url":"https://c.ndtvimg.com/2023-03/joijrmqo_suresh-raina_625x300_16_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Will encourage girls to enjoy final: Delhi Capitals’captain Meg Lanning","link":"https://thenewsmill.com/2023/03/will-encourage-girls-to-enjoy-final-delhi-capitalscaptain-meg-lanning/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The Delhi Capitals are all set to take on the Mumbai Indians in the final of the Women’s Premier League at the Brabourne Stadium, Mumbai on Sunday. Speaking ahead of the summit clash, Delhi Capitals’ captain Meg Lanning said, “Mumbai and Delhi have been consistent throughout the tournament. We know how dangerous Mumbai can be and how many great players they have. It’s a massive challenge for us, but our group is confident ahead of the big game.” The Australian legend expressed that she wants her team to enjoy the Final. “We have learned a lot throughout the tournament, which has prepared us for a high-pressure game on Sunday. We’ve just got to go out there and play our best cricket. We’ve played with a smile on our faces throughout this competition and I’ll encourage the girls to enjoy the Final as well,” she added. Heaping praise on her opening partner Shafali Verma, Lanning said, “Shafali and I have a really good combination at the top. We play differently, which works for us. The opening spot is my favourite position and it’s been nice to play there. Shafali has made my job a little bit easier by taking the attack to the opposition. Hopefully, we’ve got one more big partnership in us on Sunday.” On the importance of the Women’s Premier League, the DC Skipper said, “The atmosphere has been amazing throughout the WPL. Young girls can certainly dream of playing in front of crowds and enjoying themselves. It was important to get this message out there for women’s cricket. And this tournament has been incredible for that.” The final clash of the Women’s Premier League 2023 will begin at 7:30 PM IST on Sunday. (ANI)","pubDate":"2023-03-25 17:31:26","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Delhi Capitals Road To WPL Final Inspires And Motivates Mens Team, Says Coach Ricky Ponting","link":"https://www.thetimesofbengal.com/sports/delhi-capitals-road-to-wpl-final-inspires-and-motivates-mens-team-says-coach-ricky-ponting/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Delhi Capitals’ Road To WPL Final Inspires And Motivates Men’s Team, Says Coach Ricky Ponting Delhi Capitals will be playing Mumbai Indians in the Women’s Premier League Final on Sunday. Delhi Capitals players celebrate one of their victories in WPL. (Image: Twitter) New Delhi: Delhi Capitals’ road to maiden Women’s Premier League (WPL) […]","content":"New Delhi: Delhi Capitals’ road to maiden Women’s Premier League (WPL) final is something that will motivate and inspire the men’s team in the upcoming edition of Indin Premier League (IPL) 2023, felt head coach Ricky Ponting. Playing in the inaugural WPL, Delhi Capitals, led by Australia Meg Lanning, entered the final directly after finishing on top of five-team table. The Delhi franchise won six out of eight league games, same as Mumbai Indians but went on to table top due to better net run rate. “It sort of motivates and inspires us as a men’s team as well with what the women have done in the past few weeks and gives us somethking to aspire too. If they go and win it, its acts as a extra motivation for us as well,” Ponting said on Friday during a team event. Delhi started with a two wins before losing to Mumbai Indians in their third game. They revovered with back-to-back two wins before losing to Gujarat Giants. With a top spot at stake, Lanning’s girls won the remaining two league games to make their way into the summit clash. In the final, Delhi Capitals will face Mumbai Indians, who defeated UP Warriorz in the one-off Eliminator. Ponting lavished praise on Lanning and stated the star players did their job to perfection in leading them to the final. “As a men’s team, we will be sending some videos to the women’s team just to wish them all the best. I think it makes us all really proud to see Delhi Capitals team in an WPL final. The level of cricket they have played throughout the tournament is outstanding. “Their star players have really stood up and led the way and Meg Lanning has obviously has done a great job in captaining the team,” added the two-time Australian World Cup-winning skipper. Delhi Capitals begin their IPL 2023 campaign against Lucknow Super Giants on April 1 at the Ekana Stadium. Source link","pubDate":"2023-03-25 17:11:58","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"SA vs WI: बचपन में चराता था बकरी, अब कप्तानी पारी खेल बजाई द.अफ्रीका की बैंड, ऋषभ पंत की टीम होगी खुश","link":"https://hindi.news18.com/news/sports/cricket-rovman-powell-first-match-as-full-time-west-indies-t20i-captain-scored-led-team-to-victory-against-south-africa-5656285.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"SA vs WI 1st T20: वेस्टइंडीज ने दक्षिण अफ्रीका को पहले टी20 में 3 विकेट से हरा दिया. वेस्टइंडीज के लिए कप्तान रोवमैन पॉवेल ने तूफानी पारी. उन्होंने आखिरी ओवर में छक्का उड़ाकर बारिश से बाधित मैच में जीत दिलाई. वेस्टइंडीज को 11 ओवर में 132 रन की दरकार थी. कैरेबियाई टीम ने 3 गेंद रहते लक्ष्य हासिल कर लिया.","content":"रोवमैन पॉवेल की आतिशी पारी से वेस्टइंडीज ने द.अफ्रीका को पहले टी20 में हरा दिया. (west indies cricket twitter) नई दिल्ली. वेस्टइंडीज ने सेंचुरियन में खेले गए पहले टी20 में मेजबान दक्षिण अफ्रीका को 3 विकेट से हरा दिया. वेस्टइंडीज के लिए रोवमैन पॉवेल ने कप्तानी पारी खेली. पॉवेल ने 18 गेंद में 43 रन की नाबाद पारी खेली. रोवमैन पॉवेल ने अपनी इस पारी में 5 छक्के और एक चौका जमाया. बारिश से बाधित मैच में वेस्टइंडीज को 11 ओवर में 132 रन का टारगेट मिला था. कैरेबियाई टीम ने 3 गेंद रहते ही इस लक्ष्य को हासिल कर लिया. ये पॉवेल का वेस्टइंडीज की टी20 टीम का बतौर फुलटाइम कप्तान पहला मैच था और इसमें ही उन्होंने बल्ले से कोहराम मचा दिया. बता दें कि पॉवेल का बचपन बेहद गरीबी में बीता था. उन्हें बचपन में बकरी तक चरानी पड़ी थी. वेस्टइंडीज को आखिरी ओवर में 8 रन चाहिए थे. ये ओवर वेन पार्नेल ने किया. उनकी पहली गेंद डॉट रही. अब 5 गेंद में 8 रन की दरकार थी. पार्नेल ने दूसरी बॉल वाइड फेंकी. अब जीत के लिए 7 रन चाहिए थे. अगली गेंद पार्नेल ने ऑफ स्टम्प के बाह फेंकी. इस पर पॉवेल ने जोर से बल्ला घुमाया और गेंद को सीधा डीप स्क्वेयर लेग बाउंड्री की तरफ छक्के के लिए उड़ा दिया. पॉवेल के इस शॉट के साथ ही स्कोर बराबर हो गए. तीसरी गेंद पर पॉवेल ने 1 रन लेकर वेस्टइंडीज को जीत दिला दी. इस जीत के साथ ही वेस्टइंडीज ने सीरीज में 1-0 की बढ़त ले ली. . #MaroonFans how good was captain @Ravipowell26 today! 🔥 #PowellPower #MenInMaroon #SAvWI pic.twitter.com/gOJYeSD0vy — Windies Cricket (@windiescricket) March 25, 2023 रोवमैन पॉवेल की इस तूफानी बैटिंग से दिल्ली कैपिटल्स काफी खुश होगी. पॉवेल इस टी20 सीरीज के बाद आईपीएल में हिस्सा लेंगे और दिल्ली कैपिटल्स की तरफ से खेलेंगे. लगातार बारिश के कारण मैच 2 घंटे की देरी से शुरू हुआ और फिर इसे घटाकर 11 ओवर प्रति टीम कर दिया गया. वेस्टइंडीज ने टॉस जीता और दक्षिण अफ्रीका को पहले बल्लेबाजी का न्यौता दिया. दक्षिण अफ्रीका को पहली ही गेंद पर झटका लगा. क्विंटन डिकॉक शून्य पर आउट हो गए. इसके बाद रिली रुसो और एडेन मार्करम भी जल्दी आउट हो गए. डेविड मिलर ने 22 गेंद में 48 रन की पारी खेलकर दक्षिण अफ्रीका को 11 ओवर में 131 रन के स्कोर तक पहुंचाया. WPL Final: चाचा हॉन्गकॉन्ग के लिए क्रिकेट खेले, परदादी थी जासूस, अब पोती दिलाएगी MI को खिताब ब्रैंडन किंग ने 8 गेंद में 23 रन की तूफानी पारी खेल वेस्टइंडीज को अच्छी शुरुआत दिलाई. इसके बाद जॉनसन चार्ल्स ने 14 गेंद में 28 रन ठोके. हालांकि, असली रंग तो कप्तान रोवमैन पॉवेल ने दिखाया. वेस्टइंडीज को आखिरी 24 गेंद में 48 रन की दरकार थी. तब पॉवेल ने बोर्न फोर्टूइन के ओक ओवर में 23 रन कूटे. यहीं से खेल पलटा और आखिरी ओवर में छक्का लगाकर पॉवेल को वेस्टइंडीज को जीत दिला दी. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Aiden Markram , David Miller , IPL 2023 , Rovman Powell , South Africa vs West Indies इंजीनियरिंग का करिश्मा है भारतीय रेल का पहला केबल ब्रिज, बड़े विस्फोट को सहने की क्षमता, तस्वीरों में जानें खूबियां फिल्म स्टार्स के हमशक्ल हैं ये 5 एक्टर-एक्ट्रेस, बॉलीवुड में हुई थी धमाकेदार एंट्री, सिर्फ 1 की चमकी किस्मत Realme-Xiaomi की बोलती होगी बंद! 13 हजार से कम में Samsung लाया 5G फोन, फीचर्स जानकर नहीं होगा यकीन!","pubDate":"2023-03-25 17:00:14","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/powell-west-indies-16797635423x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Raina recalls first time he saw Dhoni hit huge sixes","link":"https://thenewsmill.com/2023/03/raina-recalls-first-time-he-saw-dhoni-hit-huge-sixes/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The bromance between Suresh Raina and MS Dhoni is no secret. The partnerships two have forged while wearing the Blues or Yellows is now part of cricketing folklore. Such was the impact of the Raina-Dhoni alliance that Chennai Super Kings fans fondly called Raina ‘Chinna Thala’ after Dhoni became their ‘Thala’. On a new episode of ‘My Time with Dhoni’on JioCinema, Raina recalled the moment he first witnessed Dhoni and his penchant for big-hitting. In 2004, Raina represented Central Zone, and first-hand got a taste of Dhoni’s prowess, who was playing for the East Zone. “We were hearing a lot about a player with long hair from Jharkhand known for hitting it out of the park consistently,” recalled Raina. “This one day, we all were hanging around while Dhoni bhai quietly was eating his roti and butter chicken in a corner. Gyanu bhai saw him and said, ‘I really don’t think he’s going to do us any damage. He’s enjoying his food; let him do that,” Raina remembered. When the action began, Dhoni came out to bat, and Central Zone skipper Mohammed Kaif put an attacking field with slips and a gully. “From the word go, he hit gagan chumbhi (sky-high) sixes, and Gyanu bhai had to eat his words,” said Raina, who then witnessed MSD’s hard-hitting and finishing skills from close quarters while playing for India and CSK. But the most memorable gagan chumbhi six that Raina recalled Dhoni hitting was in 2010 at Dharamshala in a match against Kings XI Punjab. “He clubbed a big one over long-on and then punched his helmet. I have never seen him do this in any match or any situation. Everyone knew him as Captain Cool, but the energy he showed was because of the match situation,” Raina recalled. Dhoni led CSK in a tricky, high-scoring chase in that match that took them to the semifinals, eventually the ultimate prize too. Giving a peek into his off-field passion, Raina reveals Dhoni’s passion for two-wheelers has been extended to four-wheelers too. “We all know how many bikes he has and how he personally fine-tunes them, but he has extended this passion for vintage cars. He has become a collector,” Raina revealed. Mr. IPL also divulged his skipper’s love for gaming. “Whenever we would ask him to go for dinner, he would inevitably play a game and delay our meals by 10-15 mins because he was intensely involved in the game,” Raina said. (ANI)","pubDate":"2023-03-25 16:31:22","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Chevrons thump Netherlands to clinch series","link":"https://www.sundaynews.co.zw/chevrons-thump-netherlands-to-clinch-series/","keywords":["Sports"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ZIMBABWE sent a strong message to their opponents when they made light work of Netherlands with a brilliant all-round performance to win the One Day International cricket series decider by seven wickets, victory achieved with 50 balls remaining at Harare Sports Club yesterday. Playing in front of a buzzing crowd, Zimbabwe were sent […]","content":"The Sunday News ZIMBABWE sent a strong message to their opponents when they made light work of Netherlands with a brilliant all-round performance to win the One Day International cricket series decider by seven wickets, victory achieved with 50 balls remaining at Harare Sports Club yesterday. Playing in front of a buzzing crowd, Zimbabwe were sent in to bowl first and restricted the Dutch to 231/9 in 50 overs before they went on to put a brilliant effort with the bat, finishing on 235/3 in 41.4 overs to clinch the series 2-1. After two poor performances in the opening matches, the Zimbabwean bowlers got back to their best with the veteran, left arm spinner Sean Williams finishing as the leading wicket taker, taking 3/41 in 10 overs while off spinner Sikandar Raza had 2/55 from the same overs. Tendai Chatara, Richard Ngarava, Wessly Madhevere and Blessing Muzarabani all picked up a wicket each to help the Chevrons keep their opponents to the lowest first innings score of the series. There were no milestones from the Dutch batting order with the top scorer being Max O’Dowd with 38 runs coming from 43 deliveries while the skipper Scott Edwards compiled 34 runs from 41 balls and Musa Ahmed chipped in with a 43-ball 29 runs. Zimbabwean openers, Craig Ervine and Madhevere put up a 96 runs first wicket partnership before the skipper, Ervine fell six runs short of his half century on 44 runs from 55 balls while Madhevere scored his first half century of the series. He fell for 50 runs off 61 balls. Gary Ballance, coming in to bat at number three saw the team through with his first half century of the series as well, remaining undefeated on 64 runs from 72 balls. Williams scored 43 runs off 53 deliveries before he was bowled by Fred Klaasen. Raza’s nine-ball 18 runs saw Zimbabwe convincingly take the series. Ahmad and Klaassen took the only wickets for the Dutch with the former taking two and the latter taking one. This win is a big boost for the Chevrons as they prepare for the International Cricket Council (ICC) 2023 World Cup Qualifiers which will be hosted in Zimbabwe in June. The victory also saw the hosts extend the gap between them and their opponents on the ODI Super League standings. The Super League serves as a pathway for direct qualification to the World Cup in India in October. Both teams however missed out on direct entry and will be hoping to secure the two remaining spots that will be up for grabs in June. Follow on Twitter @brandon_malvin","pubDate":"2023-03-25 22:04:39","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Chevrons seal series in empathic style","link":"https://www.sundaymail.co.zw/chevrons-seal-series-in-empathic-style","keywords":["Sports"],"creator":["tawandamusarurwa"],"video_url":null,"description":"Sports Reporter AN unbeaten half-century by Gary Ballance was but the tip of the iceberg of many talking points of Zimbabwe’s seven-wicket victory over the Netherlands at Harare Sports Club yesterday. The win gave Zimbabwe the three-match series, which they took 2-1. However, with both nations out of the running for the automatic eight top […]","content":"The Sunday Mail AN unbeaten half-century by Gary Ballance was but the tip of the iceberg of many talking points of Zimbabwe’s seven-wicket victory over the Netherlands at Harare Sports Club yesterday. The win gave Zimbabwe the three-match series, which they took 2-1. However, with both nations out of the running for the automatic eight top spots that will qualify for the ICC Men’s Cricket World Cup on the Super League log standing, the series provided both sets of technical teams a chance to experiment and seize up the oppositions. The Netherlands will be back here again for the 2023 ICC Men’s Cricket World Cup Qualifiers, which Zimbabwe is hosting from June 18 to July 9. Two of the major talking points from the series, and more specifically yesterday’s victory, pertain to Zimbabwe’s top order. The Netherlands won the toss and elected to bat, getting off to a blistering start, courtesy of a solid opening stand by Vikramjit Singh and Max O’Dowd. The Dutch pair put up a 67 runs off 82 balls during their opening partnership, with O’Dowd top-scoring for his side with 38 runs off 43 balls. That was before he was caught out by the returning Richard Ngarava off the bowling of Blessing Muzarabani in the 13th over. His partner Singh (27) did not last long after that, falling roughly three overs later when he was caught by Zimbabwe skipper Craig Ervine off the bowling of Sikandar Raza. Raza’s introduction, and that of fellow spinners Wessly Madhevere and Sean Williams, seemed to tilt the game in Zimbabwe’s favour as runs dried up and boundaries were few and far in between. With the exceptions of cameo knocks by Collin Ackerman (37) and Musa Ahmed (29) — who shared a third-wicket stand of 60 runs off 79 balls — the Netherlands never seemed to get back in the game. And 231 runs for nine never seemed like a defendable score. Zimbabwe’s trio of Raza, Madhevere and Williams did most of the damage, taking six wickets between them. The three bowled a collective 30 overs. Williams finished the pick of the Zimbabwean bowlers, taking three wickets for 41 runs, while Raza chipped in two for 55 runs. It was then that Zimbabwe’s top-order one-upped their opposition as Madhevere, Ervine, Ballance and Williams all made match-winning contributions. Zimbabwe’s batting woes have always been a bone of contention as, more often than not, the Chevrons’ top order falls cheaply and burdens their middle order and tail with most of the heavy lifting. In fact, during this just-ended series, Zimbabwe has had to rely on the exploits of Clive Madande and Williams to bring some respectability to their totals. Madande’s 74 runs off 98 balls during the first ODI helped the Chevrons to 249, albeit on a losing note, and Williams’ 77 runs of 73 balls turned out to be match-winning innings in the second. The Chevrons’ top order showed glimpses of what they are capable of doing during yesterday’s win, as Ervine and Madhevere’s 96 runs off 108 balls gave Zimbabwe a solid start to their run chase. Granted, 231 was not much of a target, but the pitch looked to be spin-friendly. A crucial third-wicket partnership between Balance and Williams soon followed, with the pair piling up 96 runs off 113 balls to move the Chevrons to within touching distance of their target. What these two partnerships did was give Raza, another key talking point, the freedom to play to his strengths as he blasted a quickfire 18 runs off nine balls that helped Zimbabwe cross the finishing line. It was a cameo Raza badly needed as he has failed to really affect the game with the bat all series. Ballance and Madhevere were also able to convert their good starts, with the pair making half centuries to the winning cause. Ballance top-scored for the Chevrons with an unbeaten 64 runs off 72 balls, which included eight boundaries, while Madhevere made 50 runs off 61 balls that included seven boundaries. While Williams was named both the Man-of-the-Match and series for his 43 runs and three for 41, there were a couple of other players who put their hands during the series. Madande had a pair of good innings with the bat during the first two games, scoring back-to-back half centuries (74 and 52). Madhevere has future star written all over him. The 22-year-old took his first hattrick during the second ODI, a performance that is sure to give him a lot of confidence going forward. Ballance needs more innings and performances like yesterday’s game, otherwise, in the 33-year-old batter, Zimbabwe could have a vital cog of their top order. There appears to be plenty of fight left in Sean Williams, as the 36-year-old easily returned back into the team with two match-winning cameos of 77 and 43 runs in the second and third ODIs.","pubDate":"2023-03-25 22:02:30","image_url":null,"source_id":"sundaymail","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"\"बाउंड्री की लंबाई हमारे हाथ में नहीं, जिसने की, उनसे पूछो\", सवाल पर नाराज हो गयीं हरमनप्रीत कौर","link":"https://sports.ndtv.com/hindi/cricket/boundry-length-is-not-our-hand-ask-those-how-have-reduced-it-harmanpreet-kaur-become-angry-at-question-3892923#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"DCW vs MIW, Final: देखने वाली बात होगी कि रविवार को खेले जाने वाले फाइनल मुकाबले में बाउंड्री की लंबाई क्या रहती है.","content":"मुंबई इंडियंस की कप्तान हरमनप्रीत कौर भारतीय टीम और मुंबई इंडियंस की कप्तान हरमनप्रीत कौर ने शनिवार को महिला प्रीमियर लीग (WPl 2023) में छोटी ‘बाउंड्री' के मुद्दे पर टिप्पणी करने से इनकार कर दिया और कहा कि इस तरह की सीमाओं पर फैसला करना प्रशासकों का काम है, खिलाड़ियों का नहीं. इस महीने के शुरू में आरंभ हुए शुरूआती डब्ल्यूपीएल में बीसीसीआई (BCCI) के निर्देश पर ‘बाउंड्री' सीमा को पिछले महीने के टी20 विश्व कप से पांच मीटर कम और अधिकतम 60 मीटर तक रखा गया. यह फैसला बड़ा स्कोर बनाने में मदद के लिए किया गया ताकि स्टेडियम और टीवी पर मैच देख रहे दर्शकों का मनोरंजन हो जिन्हें ज्यादा से ज्यादा चौके और छक्के देखने को मिलें. टूर्नामेंट के दोनों स्टेडियम नवी मुंबई में डीवाई पाटिल स्टेडियम और ब्रैबोर्न स्टेडियम में बाउंड्री की सीमा 42-44 मीटर कर दी गयी. रविवार को यहां ब्रैबोर्न स्टेडियम में होने वाले फाइनल से पहले मुंबई इंडियंस की कप्तान से जब इस पर सवाल पूछा गया तो उन्होंने कहा, ‘हम लोगों ने थोड़े ही रस्सी लगायी है, जिन्होंने रस्सी लगायी है, आप उनको ही पूछो. उन्होंने कहा, ‘यह हमारे हाथ में नहीं है. यह अधिकारियों के हाथ में है. आप उनसे बात कर सकते हो.' अब इस सवाल के बाद यह देखने वाली बात होगी कि रविवार को मुंबई और दिल्ली के बीच खेले जाने वाले फाइनल मुकाबले के लिए बाउंड्री की लंबाई कितनी रखी जाएगी. इसमें दो राय नहीं कि खेल के रोमांच का तड़का लागने के लिए पांच-छह मीटर बाउंड्री कम करना एक बार को चलेगा, लेकिन जब बाउंड्री 42-44 मी. की हो जाएगी, तो जाहिर कि सवाल तो उठेंगे ही. पहले साठ से पचपन और फिर बाउंड्री का 42-44 मी. पर सिमटना एक वह बात हो चली है, जिससे बीसीसीआई को गंभीरता से लेना होगा. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-25 18:36:22","image_url":"https://c.ndtvimg.com/2023-02/f03up3jg_harmanpreet-kaur_625x300_24_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“It’s a massive challenge but we are confident”: Meg Lanning ahead of WPL final against Mumbai Indians","link":"https://thenewsmill.com/2023/03/its-a-massive-challenge-but-we-are-confident-meg-lanning-ahead-of-wpl-final-against-mumbai-indians/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Delhi Capitals will square off against Mumbai Indians in the inaugural Women’s Premier League final at Brabourne Stadium on Sunday. With less than 24 hours left into the game, Delhi Capitals skipper Meg Lanning believes that her team is ready to face an irrepressible Mumbai team. “Obviously they have played well last night to get to this point we know how dangerous they can be and how many great players they have got so it’s a massive challenge for Delhi but we are confident as well. We come in having big sort of push in the few games I think which is really important,” Lanning said in pre-match conference. “We haven’t had things go our way. So I feel like this prepares us really nicely for a high-pressure game tomorrow night so we just gotta go out there and play our best cricket what we have done throughout the tournament is play with a smile on our faces and really enjoyed it and that is certainly what I will be encouraging the girls to do tomorrow night enjoy the experience embrace it who knows if we get back here again so we need to make the most of the opportunity and go out there have some fun,” she added. Delhi Capitals success has more or less been defined by their destructive opening pair of Shafali Verma and Meg Lanning. Mumbai Indians skipper Harmanpreet Kaur shed some light on the approach her team will follow to keep the successful duo quiet. “I think in this tournament they have the best opening combination in the tournament and I think they did well against us also in the last game they did really well and other teams also. We know what they can do and how dangerous they are we do have some plans and hopefully, we are able to execute them also,” Harmanpreet said. She further went on to praise the opposition captain for her influential leadership skills throughout the Women’s Premier League. “I think for her (Meg Lanning) it is so easy for her to make changes and come up with a good plan. But it has been a challenge for us. If you look at this WPL you can see it is a balanced side and she is leading from the front. So I think the best thing you can learn from her is that she is not someone who is dependent on the players she is someone who always leads from the front.” “Even in this WPL also she is leading from the front so I think that is something you want from your leader so when a leader comes forward and gives you a response so when your team does well. So I have learned these things from her. Tomorrow’s match will be important and I know she is not someone who will give up easily so we have to fight till the end and our team is ready for that,” Harmanpreet continued. (ANI)","pubDate":"2023-03-25 18:31:24","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"video: रोहित शर्मा ने पत्नी और बेटी के साथ किए डांस से लूट ली महफिल, वीडियो हो रहा वायरल","link":"https://sports.ndtv.com/hindi/cricket/video-rohit-sharma-set-the-stage-on-fire-with-his-dance-moves-with-wife-and-daughter-3893503#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"रोहित शर्मा (Rohit Sharma) हाल ही में साले की शादी में हिस्सा लेने के लिए पहले वनडे से हट गए थे. और उनका यह डांस वीडियो शादी समारोह का है.","content":"रोहित शर्मा का अंदाज-ए-डांस भी बैटिंग की तरह ही स्पेशल है भारतीय कप्तान रोहित शर्मा (Rohit Sharma) सिर्फ मैदान पर बल्ले से ही आग लागना नहीं जानते, बल्कि वह स्टेज पर डांस के मामले में भी ऐसा कर सकते हैं! भले ही रोहित एक पेशेवर डांसर नहीं हैं, लेकिन जाहिर है कि जब रोहित किसी स्टेज पर डांस करेंगे, तो सभी की नजरें बड़े-बड़े डांसरों से हटकर रोहित पर ही टिक जाएंगी. और कुछ ऐसा ही रोहित ने हाल ही में अपने साल की शादी समारोह में किया. अपने शांत मिजाज के लिए मशहूर रोहित शादी के दौरान एक अलग ही अवतार में दिखे और मंच पर पत्नी रितिका और बेटी समाइरा के साथ डांस करके पूरी महफिल लूट ली. रोहित ने शादी से जुड़ा एक वीडियो अपने इंस्टाग्राम पर पोस्ट किया है, जिसमें रोहित के प्रशंसक अपने हीरो को \"डांसताल\" करते हुए देख सकते हैं. मुंबई इंडियंस ने अपने कप्तान के वीडियो पर कमेंट करते हुए लिखा, \"फुल वाइब है, स्किप.\" हाल ही में रोहित साले की शादी में हिस्सा लेने के लिए ऑस्ट्रेलिया के खिलाफ पहले वनडे मुकाबले से हट गए थे. हालांकि, उनके हटने का टीम इंडिया पर असर नहीं पड़ा था. और भारत ने कंगारुओं के खिलाफ पहला वनडे जीत लिया था. लेकिन विडंबना यह रही कि रोहित के वापसी करने के बावजूद भारत 2-1 से सीरीज गंवा बैठा. यह भारत की साल 2019 के बाद घर में किसी वनडे सीरीज में पहली हार रही. बहरहाल, अब रोहित एक बार फिर से शुरू होने जा रही इंडियन प्रीमियर लीग में बल्ले से जलवा बिखरते दिखायी पड़ेंगे. उनके चाहने वाले बेसब्री से अपने हीरो को फिर से धूम-धड़ाका करते देखने के लिए बेकरार हैं. इस साल का संस्करण मार्च 31 से शुरू हो रहा है. पहला मुकाबला गत चैंपियन गुजरात और चेन्नई सुपर किंग्स के बीच खेला जाएगा. रोहित की कप्तानी में मुंबई इंडियंस ने पांच बार खिताब जीता है. और मुंबई एक बार फिर से खिताब पर नजरें गड़ाए हुए है. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-25 18:26:02","image_url":"https://c.ndtvimg.com/2023-03/p0i3sr9_rohit-sharma-dance-806_625x300_25_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"यह बहुत ही शानदार और धोनी का सबसे बेहतरीन छक्का था', दोस्त रैना ने याद किए पुराने पल","link":"https://sports.ndtv.com/hindi/cricket/it-was-such-a-fantastic-and-finest-six-of-ms-dhoni-buddy-raina-recalls-old-memories-3893320#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"जियो सिनेमा पर एक कार्यक्रम में सुरेश रैना ने विस्तार से एमएस धोनी (MS Dhoni) से जुड़े रोमांचक किस्सों को बताया है","content":"टीम इंडिया के पूर्व बल्लेबाज और धोनी के खास दोस्तों में से एक सुरेश रैना अब यह तो करोड़ों क्रिकेटप्रेमी जानते ही हैं कि एमएस धोनी और सुरेश रैना की दोस्ती कैसी रही है. कई साल तक भारत के लिए खेलने के बाद इन दोनों के संबंध चेन्नई सुपर किंग्स के लिए खेलने के दौरान और भी ज्यादा मजबूत हो गए. इसी दौरान धोनी का नाम \"थाला (बड़ा भाई)\" और रैना का नाम \"चिन्ना थाला\" (छोटा भाई) पड़ गया. और अब रैना ने जियो सिनेमा पर प्रसारित हुए हालिया एपिसोड-\"माय टाइम विद धोनी\"- में धोनी से जुड़ी कई बातों को लेकर खुलासा किया. रैना ने उस पल को याद किया, जब उन्होंने पहली बार धोनी और उनके द्वारा लगाए गए बड़े-बड़े छ्क्कों को देखा. यह साल 2004 का समय था, जब धोनी ईस्ट जोन के खिलाफ सेंट्रल जोन के लिए खेल रहे थे. रैना ने उस समय को याद करते हुए कहा कि तब हम झारखंड के उस खिलाड़ी के बारे में बहुत ही जोर-शोर से सुन रहे थे, जो नियमित रूप से स्टेडियम के बाहर छक्के मारने के लिए मशहूर हो चला था. उन्होंने कहा कि एक दिन हम इकट्ठा थे, जबकि धोनी भाई चुपचाप एक कोने में बैठकर रोटी और बटर चिकन खा रहे थे. तब उन्हें ज्ञानू भाई (ज्ञानेंद्र पांडेय) ने देखा और कहा, \"मैं वास्तव में नहीं सोचता कि वह हमारा कोई नुकसान करने जा रहा है. वह अपने खाने का लुत्फ उठा रहा है. उसका इसका मजा लेने दो.\" रैना ने कहा कि जब धोनी बैटिंग के लिए आए, तो कप्तान मोहम्मद कैफ ने उनके खिलाफ आक्रामक फील्डिंग सजा दी, लेकिन एमएस ने शुरुआत से ही लंबे-लंबे छक्के जड़े और ज्ञानू भाई को अपने शब्द वापस लेने को मजबूर होना पड़ा. लेकिन वास्तव में रैना को और अटैकिंग धोनी के छक्कों के दर्शन तब हुए, जब वह उनके साथ आईपीएल में साथ-साथ खेले. रैना ने धोनी के सबसे गगनचुंबी छक्के को याद करते हुए कहा, \"यह समय साल 2010 का था, जब हम धर्मशाला में किंग्स इलेवन पंजाब (अब पंजाब किंग्स) के खिलाफ खेल रहे थे. तब धोनी ने लांग-ऑन के ऊपर से लंबा छक्का जड़ा और इसके बाद उन्होंने अपने हेलमेट पर पंच किया. मैंने इसके बाद कभी भी धोनी को किसी भी हालात में ऐसी प्रतिक्रिया करते हुए नहीं देखा. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-25 18:02:48","image_url":"https://c.ndtvimg.com/2023-03/joijrmqo_suresh-raina_625x300_16_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Will encourage girls to enjoy final: Delhi Capitals’captain Meg Lanning","link":"https://thenewsmill.com/2023/03/will-encourage-girls-to-enjoy-final-delhi-capitalscaptain-meg-lanning/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The Delhi Capitals are all set to take on the Mumbai Indians in the final of the Women’s Premier League at the Brabourne Stadium, Mumbai on Sunday. Speaking ahead of the summit clash, Delhi Capitals’ captain Meg Lanning said, “Mumbai and Delhi have been consistent throughout the tournament. We know how dangerous Mumbai can be and how many great players they have. It’s a massive challenge for us, but our group is confident ahead of the big game.” The Australian legend expressed that she wants her team to enjoy the Final. “We have learned a lot throughout the tournament, which has prepared us for a high-pressure game on Sunday. We’ve just got to go out there and play our best cricket. We’ve played with a smile on our faces throughout this competition and I’ll encourage the girls to enjoy the Final as well,” she added. Heaping praise on her opening partner Shafali Verma, Lanning said, “Shafali and I have a really good combination at the top. We play differently, which works for us. The opening spot is my favourite position and it’s been nice to play there. Shafali has made my job a little bit easier by taking the attack to the opposition. Hopefully, we’ve got one more big partnership in us on Sunday.” On the importance of the Women’s Premier League, the DC Skipper said, “The atmosphere has been amazing throughout the WPL. Young girls can certainly dream of playing in front of crowds and enjoying themselves. It was important to get this message out there for women’s cricket. And this tournament has been incredible for that.” The final clash of the Women’s Premier League 2023 will begin at 7:30 PM IST on Sunday. (ANI)","pubDate":"2023-03-25 17:31:26","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Delhi Capitals Road To WPL Final Inspires And Motivates Mens Team, Says Coach Ricky Ponting","link":"https://www.thetimesofbengal.com/sports/delhi-capitals-road-to-wpl-final-inspires-and-motivates-mens-team-says-coach-ricky-ponting/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Delhi Capitals’ Road To WPL Final Inspires And Motivates Men’s Team, Says Coach Ricky Ponting Delhi Capitals will be playing Mumbai Indians in the Women’s Premier League Final on Sunday. Delhi Capitals players celebrate one of their victories in WPL. (Image: Twitter) New Delhi: Delhi Capitals’ road to maiden Women’s Premier League (WPL) […]","content":"New Delhi: Delhi Capitals’ road to maiden Women’s Premier League (WPL) final is something that will motivate and inspire the men’s team in the upcoming edition of Indin Premier League (IPL) 2023, felt head coach Ricky Ponting. Playing in the inaugural WPL, Delhi Capitals, led by Australia Meg Lanning, entered the final directly after finishing on top of five-team table. The Delhi franchise won six out of eight league games, same as Mumbai Indians but went on to table top due to better net run rate. “It sort of motivates and inspires us as a men’s team as well with what the women have done in the past few weeks and gives us somethking to aspire too. If they go and win it, its acts as a extra motivation for us as well,” Ponting said on Friday during a team event. Delhi started with a two wins before losing to Mumbai Indians in their third game. They revovered with back-to-back two wins before losing to Gujarat Giants. With a top spot at stake, Lanning’s girls won the remaining two league games to make their way into the summit clash. In the final, Delhi Capitals will face Mumbai Indians, who defeated UP Warriorz in the one-off Eliminator. Ponting lavished praise on Lanning and stated the star players did their job to perfection in leading them to the final. “As a men’s team, we will be sending some videos to the women’s team just to wish them all the best. I think it makes us all really proud to see Delhi Capitals team in an WPL final. The level of cricket they have played throughout the tournament is outstanding. “Their star players have really stood up and led the way and Meg Lanning has obviously has done a great job in captaining the team,” added the two-time Australian World Cup-winning skipper. Delhi Capitals begin their IPL 2023 campaign against Lucknow Super Giants on April 1 at the Ekana Stadium. Source link","pubDate":"2023-03-25 17:11:58","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"SA vs WI: बचपन में चराता था बकरी, अब कप्तानी पारी खेल बजाई द.अफ्रीका की बैंड, ऋषभ पंत की टीम होगी खुश","link":"https://hindi.news18.com/news/sports/cricket-rovman-powell-first-match-as-full-time-west-indies-t20i-captain-scored-led-team-to-victory-against-south-africa-5656285.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"SA vs WI 1st T20: वेस्टइंडीज ने दक्षिण अफ्रीका को पहले टी20 में 3 विकेट से हरा दिया. वेस्टइंडीज के लिए कप्तान रोवमैन पॉवेल ने तूफानी पारी. उन्होंने आखिरी ओवर में छक्का उड़ाकर बारिश से बाधित मैच में जीत दिलाई. वेस्टइंडीज को 11 ओवर में 132 रन की दरकार थी. कैरेबियाई टीम ने 3 गेंद रहते लक्ष्य हासिल कर लिया.","content":"रोवमैन पॉवेल की आतिशी पारी से वेस्टइंडीज ने द.अफ्रीका को पहले टी20 में हरा दिया. (west indies cricket twitter) नई दिल्ली. वेस्टइंडीज ने सेंचुरियन में खेले गए पहले टी20 में मेजबान दक्षिण अफ्रीका को 3 विकेट से हरा दिया. वेस्टइंडीज के लिए रोवमैन पॉवेल ने कप्तानी पारी खेली. पॉवेल ने 18 गेंद में 43 रन की नाबाद पारी खेली. रोवमैन पॉवेल ने अपनी इस पारी में 5 छक्के और एक चौका जमाया. बारिश से बाधित मैच में वेस्टइंडीज को 11 ओवर में 132 रन का टारगेट मिला था. कैरेबियाई टीम ने 3 गेंद रहते ही इस लक्ष्य को हासिल कर लिया. ये पॉवेल का वेस्टइंडीज की टी20 टीम का बतौर फुलटाइम कप्तान पहला मैच था और इसमें ही उन्होंने बल्ले से कोहराम मचा दिया. बता दें कि पॉवेल का बचपन बेहद गरीबी में बीता था. उन्हें बचपन में बकरी तक चरानी पड़ी थी. वेस्टइंडीज को आखिरी ओवर में 8 रन चाहिए थे. ये ओवर वेन पार्नेल ने किया. उनकी पहली गेंद डॉट रही. अब 5 गेंद में 8 रन की दरकार थी. पार्नेल ने दूसरी बॉल वाइड फेंकी. अब जीत के लिए 7 रन चाहिए थे. अगली गेंद पार्नेल ने ऑफ स्टम्प के बाह फेंकी. इस पर पॉवेल ने जोर से बल्ला घुमाया और गेंद को सीधा डीप स्क्वेयर लेग बाउंड्री की तरफ छक्के के लिए उड़ा दिया. पॉवेल के इस शॉट के साथ ही स्कोर बराबर हो गए. तीसरी गेंद पर पॉवेल ने 1 रन लेकर वेस्टइंडीज को जीत दिला दी. इस जीत के साथ ही वेस्टइंडीज ने सीरीज में 1-0 की बढ़त ले ली. . #MaroonFans how good was captain @Ravipowell26 today! 🔥 #PowellPower #MenInMaroon #SAvWI pic.twitter.com/gOJYeSD0vy — Windies Cricket (@windiescricket) March 25, 2023 रोवमैन पॉवेल की इस तूफानी बैटिंग से दिल्ली कैपिटल्स काफी खुश होगी. पॉवेल इस टी20 सीरीज के बाद आईपीएल में हिस्सा लेंगे और दिल्ली कैपिटल्स की तरफ से खेलेंगे. लगातार बारिश के कारण मैच 2 घंटे की देरी से शुरू हुआ और फिर इसे घटाकर 11 ओवर प्रति टीम कर दिया गया. वेस्टइंडीज ने टॉस जीता और दक्षिण अफ्रीका को पहले बल्लेबाजी का न्यौता दिया. दक्षिण अफ्रीका को पहली ही गेंद पर झटका लगा. क्विंटन डिकॉक शून्य पर आउट हो गए. इसके बाद रिली रुसो और एडेन मार्करम भी जल्दी आउट हो गए. डेविड मिलर ने 22 गेंद में 48 रन की पारी खेलकर दक्षिण अफ्रीका को 11 ओवर में 131 रन के स्कोर तक पहुंचाया. WPL Final: चाचा हॉन्गकॉन्ग के लिए क्रिकेट खेले, परदादी थी जासूस, अब पोती दिलाएगी MI को खिताब ब्रैंडन किंग ने 8 गेंद में 23 रन की तूफानी पारी खेल वेस्टइंडीज को अच्छी शुरुआत दिलाई. इसके बाद जॉनसन चार्ल्स ने 14 गेंद में 28 रन ठोके. हालांकि, असली रंग तो कप्तान रोवमैन पॉवेल ने दिखाया. वेस्टइंडीज को आखिरी 24 गेंद में 48 रन की दरकार थी. तब पॉवेल ने बोर्न फोर्टूइन के ओक ओवर में 23 रन कूटे. यहीं से खेल पलटा और आखिरी ओवर में छक्का लगाकर पॉवेल को वेस्टइंडीज को जीत दिला दी. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Aiden Markram , David Miller , IPL 2023 , Rovman Powell , South Africa vs West Indies इंजीनियरिंग का करिश्मा है भारतीय रेल का पहला केबल ब्रिज, बड़े विस्फोट को सहने की क्षमता, तस्वीरों में जानें खूबियां फिल्म स्टार्स के हमशक्ल हैं ये 5 एक्टर-एक्ट्रेस, बॉलीवुड में हुई थी धमाकेदार एंट्री, सिर्फ 1 की चमकी किस्मत Realme-Xiaomi की बोलती होगी बंद! 13 हजार से कम में Samsung लाया 5G फोन, फीचर्स जानकर नहीं होगा यकीन!","pubDate":"2023-03-25 17:00:14","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/powell-west-indies-16797635423x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Raina recalls first time he saw Dhoni hit huge sixes","link":"https://thenewsmill.com/2023/03/raina-recalls-first-time-he-saw-dhoni-hit-huge-sixes/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The bromance between Suresh Raina and MS Dhoni is no secret. The partnerships two have forged while wearing the Blues or Yellows is now part of cricketing folklore. Such was the impact of the Raina-Dhoni alliance that Chennai Super Kings fans fondly called Raina ‘Chinna Thala’ after Dhoni became their ‘Thala’. On a new episode of ‘My Time with Dhoni’on JioCinema, Raina recalled the moment he first witnessed Dhoni and his penchant for big-hitting. In 2004, Raina represented Central Zone, and first-hand got a taste of Dhoni’s prowess, who was playing for the East Zone. “We were hearing a lot about a player with long hair from Jharkhand known for hitting it out of the park consistently,” recalled Raina. “This one day, we all were hanging around while Dhoni bhai quietly was eating his roti and butter chicken in a corner. Gyanu bhai saw him and said, ‘I really don’t think he’s going to do us any damage. He’s enjoying his food; let him do that,” Raina remembered. When the action began, Dhoni came out to bat, and Central Zone skipper Mohammed Kaif put an attacking field with slips and a gully. “From the word go, he hit gagan chumbhi (sky-high) sixes, and Gyanu bhai had to eat his words,” said Raina, who then witnessed MSD’s hard-hitting and finishing skills from close quarters while playing for India and CSK. But the most memorable gagan chumbhi six that Raina recalled Dhoni hitting was in 2010 at Dharamshala in a match against Kings XI Punjab. “He clubbed a big one over long-on and then punched his helmet. I have never seen him do this in any match or any situation. Everyone knew him as Captain Cool, but the energy he showed was because of the match situation,” Raina recalled. Dhoni led CSK in a tricky, high-scoring chase in that match that took them to the semifinals, eventually the ultimate prize too. Giving a peek into his off-field passion, Raina reveals Dhoni’s passion for two-wheelers has been extended to four-wheelers too. “We all know how many bikes he has and how he personally fine-tunes them, but he has extended this passion for vintage cars. He has become a collector,” Raina revealed. Mr. IPL also divulged his skipper’s love for gaming. “Whenever we would ask him to go for dinner, he would inevitably play a game and delay our meals by 10-15 mins because he was intensely involved in the game,” Raina said. (ANI)","pubDate":"2023-03-25 16:31:22","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Chevrons thump Netherlands to clinch series","link":"https://www.sundaynews.co.zw/chevrons-thump-netherlands-to-clinch-series/","keywords":["Sports"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ZIMBABWE sent a strong message to their opponents when they made light work of Netherlands with a brilliant all-round performance to win the One Day International cricket series decider by seven wickets, victory achieved with 50 balls remaining at Harare Sports Club yesterday. Playing in front of a buzzing crowd, Zimbabwe were sent […]","content":"The Sunday News ZIMBABWE sent a strong message to their opponents when they made light work of Netherlands with a brilliant all-round performance to win the One Day International cricket series decider by seven wickets, victory achieved with 50 balls remaining at Harare Sports Club yesterday. Playing in front of a buzzing crowd, Zimbabwe were sent in to bowl first and restricted the Dutch to 231/9 in 50 overs before they went on to put a brilliant effort with the bat, finishing on 235/3 in 41.4 overs to clinch the series 2-1. After two poor performances in the opening matches, the Zimbabwean bowlers got back to their best with the veteran, left arm spinner Sean Williams finishing as the leading wicket taker, taking 3/41 in 10 overs while off spinner Sikandar Raza had 2/55 from the same overs. Tendai Chatara, Richard Ngarava, Wessly Madhevere and Blessing Muzarabani all picked up a wicket each to help the Chevrons keep their opponents to the lowest first innings score of the series. There were no milestones from the Dutch batting order with the top scorer being Max O’Dowd with 38 runs coming from 43 deliveries while the skipper Scott Edwards compiled 34 runs from 41 balls and Musa Ahmed chipped in with a 43-ball 29 runs. Zimbabwean openers, Craig Ervine and Madhevere put up a 96 runs first wicket partnership before the skipper, Ervine fell six runs short of his half century on 44 runs from 55 balls while Madhevere scored his first half century of the series. He fell for 50 runs off 61 balls. Gary Ballance, coming in to bat at number three saw the team through with his first half century of the series as well, remaining undefeated on 64 runs from 72 balls. Williams scored 43 runs off 53 deliveries before he was bowled by Fred Klaasen. Raza’s nine-ball 18 runs saw Zimbabwe convincingly take the series. Ahmad and Klaassen took the only wickets for the Dutch with the former taking two and the latter taking one. This win is a big boost for the Chevrons as they prepare for the International Cricket Council (ICC) 2023 World Cup Qualifiers which will be hosted in Zimbabwe in June. The victory also saw the hosts extend the gap between them and their opponents on the ODI Super League standings. The Super League serves as a pathway for direct qualification to the World Cup in India in October. Both teams however missed out on direct entry and will be hoping to secure the two remaining spots that will be up for grabs in June. Follow on Twitter @brandon_malvin","pubDate":"2023-03-25 22:04:39","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Chevrons seal series in empathic style","link":"https://www.sundaymail.co.zw/chevrons-seal-series-in-empathic-style","keywords":["Sports"],"creator":["tawandamusarurwa"],"video_url":null,"description":"Sports Reporter AN unbeaten half-century by Gary Ballance was but the tip of the iceberg of many talking points of Zimbabwe’s seven-wicket victory over the Netherlands at Harare Sports Club yesterday. The win gave Zimbabwe the three-match series, which they took 2-1. However, with both nations out of the running for the automatic eight top […]","content":"The Sunday Mail AN unbeaten half-century by Gary Ballance was but the tip of the iceberg of many talking points of Zimbabwe’s seven-wicket victory over the Netherlands at Harare Sports Club yesterday. The win gave Zimbabwe the three-match series, which they took 2-1. However, with both nations out of the running for the automatic eight top spots that will qualify for the ICC Men’s Cricket World Cup on the Super League log standing, the series provided both sets of technical teams a chance to experiment and seize up the oppositions. The Netherlands will be back here again for the 2023 ICC Men’s Cricket World Cup Qualifiers, which Zimbabwe is hosting from June 18 to July 9. Two of the major talking points from the series, and more specifically yesterday’s victory, pertain to Zimbabwe’s top order. The Netherlands won the toss and elected to bat, getting off to a blistering start, courtesy of a solid opening stand by Vikramjit Singh and Max O’Dowd. The Dutch pair put up a 67 runs off 82 balls during their opening partnership, with O’Dowd top-scoring for his side with 38 runs off 43 balls. That was before he was caught out by the returning Richard Ngarava off the bowling of Blessing Muzarabani in the 13th over. His partner Singh (27) did not last long after that, falling roughly three overs later when he was caught by Zimbabwe skipper Craig Ervine off the bowling of Sikandar Raza. Raza’s introduction, and that of fellow spinners Wessly Madhevere and Sean Williams, seemed to tilt the game in Zimbabwe’s favour as runs dried up and boundaries were few and far in between. With the exceptions of cameo knocks by Collin Ackerman (37) and Musa Ahmed (29) — who shared a third-wicket stand of 60 runs off 79 balls — the Netherlands never seemed to get back in the game. And 231 runs for nine never seemed like a defendable score. Zimbabwe’s trio of Raza, Madhevere and Williams did most of the damage, taking six wickets between them. The three bowled a collective 30 overs. Williams finished the pick of the Zimbabwean bowlers, taking three wickets for 41 runs, while Raza chipped in two for 55 runs. It was then that Zimbabwe’s top-order one-upped their opposition as Madhevere, Ervine, Ballance and Williams all made match-winning contributions. Zimbabwe’s batting woes have always been a bone of contention as, more often than not, the Chevrons’ top order falls cheaply and burdens their middle order and tail with most of the heavy lifting. In fact, during this just-ended series, Zimbabwe has had to rely on the exploits of Clive Madande and Williams to bring some respectability to their totals. Madande’s 74 runs off 98 balls during the first ODI helped the Chevrons to 249, albeit on a losing note, and Williams’ 77 runs of 73 balls turned out to be match-winning innings in the second. The Chevrons’ top order showed glimpses of what they are capable of doing during yesterday’s win, as Ervine and Madhevere’s 96 runs off 108 balls gave Zimbabwe a solid start to their run chase. Granted, 231 was not much of a target, but the pitch looked to be spin-friendly. A crucial third-wicket partnership between Balance and Williams soon followed, with the pair piling up 96 runs off 113 balls to move the Chevrons to within touching distance of their target. What these two partnerships did was give Raza, another key talking point, the freedom to play to his strengths as he blasted a quickfire 18 runs off nine balls that helped Zimbabwe cross the finishing line. It was a cameo Raza badly needed as he has failed to really affect the game with the bat all series. Ballance and Madhevere were also able to convert their good starts, with the pair making half centuries to the winning cause. Ballance top-scored for the Chevrons with an unbeaten 64 runs off 72 balls, which included eight boundaries, while Madhevere made 50 runs off 61 balls that included seven boundaries. While Williams was named both the Man-of-the-Match and series for his 43 runs and three for 41, there were a couple of other players who put their hands during the series. Madande had a pair of good innings with the bat during the first two games, scoring back-to-back half centuries (74 and 52). Madhevere has future star written all over him. The 22-year-old took his first hattrick during the second ODI, a performance that is sure to give him a lot of confidence going forward. Ballance needs more innings and performances like yesterday’s game, otherwise, in the 33-year-old batter, Zimbabwe could have a vital cog of their top order. There appears to be plenty of fight left in Sean Williams, as the 36-year-old easily returned back into the team with two match-winning cameos of 77 and 43 runs in the second and third ODIs.","pubDate":"2023-03-25 22:02:30","image_url":null,"source_id":"sundaymail","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"\"बाउंड्री की लंबाई हमारे हाथ में नहीं, जिसने की, उनसे पूछो\", सवाल पर नाराज हो गयीं हरमनप्रीत कौर","link":"https://sports.ndtv.com/hindi/cricket/boundry-length-is-not-our-hand-ask-those-how-have-reduced-it-harmanpreet-kaur-become-angry-at-question-3892923#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"DCW vs MIW, Final: देखने वाली बात होगी कि रविवार को खेले जाने वाले फाइनल मुकाबले में बाउंड्री की लंबाई क्या रहती है.","content":"मुंबई इंडियंस की कप्तान हरमनप्रीत कौर भारतीय टीम और मुंबई इंडियंस की कप्तान हरमनप्रीत कौर ने शनिवार को महिला प्रीमियर लीग (WPl 2023) में छोटी ‘बाउंड्री' के मुद्दे पर टिप्पणी करने से इनकार कर दिया और कहा कि इस तरह की सीमाओं पर फैसला करना प्रशासकों का काम है, खिलाड़ियों का नहीं. इस महीने के शुरू में आरंभ हुए शुरूआती डब्ल्यूपीएल में बीसीसीआई (BCCI) के निर्देश पर ‘बाउंड्री' सीमा को पिछले महीने के टी20 विश्व कप से पांच मीटर कम और अधिकतम 60 मीटर तक रखा गया. यह फैसला बड़ा स्कोर बनाने में मदद के लिए किया गया ताकि स्टेडियम और टीवी पर मैच देख रहे दर्शकों का मनोरंजन हो जिन्हें ज्यादा से ज्यादा चौके और छक्के देखने को मिलें. टूर्नामेंट के दोनों स्टेडियम नवी मुंबई में डीवाई पाटिल स्टेडियम और ब्रैबोर्न स्टेडियम में बाउंड्री की सीमा 42-44 मीटर कर दी गयी. रविवार को यहां ब्रैबोर्न स्टेडियम में होने वाले फाइनल से पहले मुंबई इंडियंस की कप्तान से जब इस पर सवाल पूछा गया तो उन्होंने कहा, ‘हम लोगों ने थोड़े ही रस्सी लगायी है, जिन्होंने रस्सी लगायी है, आप उनको ही पूछो. उन्होंने कहा, ‘यह हमारे हाथ में नहीं है. यह अधिकारियों के हाथ में है. आप उनसे बात कर सकते हो.' अब इस सवाल के बाद यह देखने वाली बात होगी कि रविवार को मुंबई और दिल्ली के बीच खेले जाने वाले फाइनल मुकाबले के लिए बाउंड्री की लंबाई कितनी रखी जाएगी. इसमें दो राय नहीं कि खेल के रोमांच का तड़का लागने के लिए पांच-छह मीटर बाउंड्री कम करना एक बार को चलेगा, लेकिन जब बाउंड्री 42-44 मी. की हो जाएगी, तो जाहिर कि सवाल तो उठेंगे ही. पहले साठ से पचपन और फिर बाउंड्री का 42-44 मी. पर सिमटना एक वह बात हो चली है, जिससे बीसीसीआई को गंभीरता से लेना होगा. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-25 18:36:22","image_url":"https://c.ndtvimg.com/2023-02/f03up3jg_harmanpreet-kaur_625x300_24_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“It’s a massive challenge but we are confident”: Meg Lanning ahead of WPL final against Mumbai Indians","link":"https://thenewsmill.com/2023/03/its-a-massive-challenge-but-we-are-confident-meg-lanning-ahead-of-wpl-final-against-mumbai-indians/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Delhi Capitals will square off against Mumbai Indians in the inaugural Women’s Premier League final at Brabourne Stadium on Sunday. With less than 24 hours left into the game, Delhi Capitals skipper Meg Lanning believes that her team is ready to face an irrepressible Mumbai team. “Obviously they have played well last night to get to this point we know how dangerous they can be and how many great players they have got so it’s a massive challenge for Delhi but we are confident as well. We come in having big sort of push in the few games I think which is really important,” Lanning said in pre-match conference. “We haven’t had things go our way. So I feel like this prepares us really nicely for a high-pressure game tomorrow night so we just gotta go out there and play our best cricket what we have done throughout the tournament is play with a smile on our faces and really enjoyed it and that is certainly what I will be encouraging the girls to do tomorrow night enjoy the experience embrace it who knows if we get back here again so we need to make the most of the opportunity and go out there have some fun,” she added. Delhi Capitals success has more or less been defined by their destructive opening pair of Shafali Verma and Meg Lanning. Mumbai Indians skipper Harmanpreet Kaur shed some light on the approach her team will follow to keep the successful duo quiet. “I think in this tournament they have the best opening combination in the tournament and I think they did well against us also in the last game they did really well and other teams also. We know what they can do and how dangerous they are we do have some plans and hopefully, we are able to execute them also,” Harmanpreet said. She further went on to praise the opposition captain for her influential leadership skills throughout the Women’s Premier League. “I think for her (Meg Lanning) it is so easy for her to make changes and come up with a good plan. But it has been a challenge for us. If you look at this WPL you can see it is a balanced side and she is leading from the front. So I think the best thing you can learn from her is that she is not someone who is dependent on the players she is someone who always leads from the front.” “Even in this WPL also she is leading from the front so I think that is something you want from your leader so when a leader comes forward and gives you a response so when your team does well. So I have learned these things from her. Tomorrow’s match will be important and I know she is not someone who will give up easily so we have to fight till the end and our team is ready for that,” Harmanpreet continued. (ANI)","pubDate":"2023-03-25 18:31:24","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"video: रोहित शर्मा ने पत्नी और बेटी के साथ किए डांस से लूट ली महफिल, वीडियो हो रहा वायरल","link":"https://sports.ndtv.com/hindi/cricket/video-rohit-sharma-set-the-stage-on-fire-with-his-dance-moves-with-wife-and-daughter-3893503#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"रोहित शर्मा (Rohit Sharma) हाल ही में साले की शादी में हिस्सा लेने के लिए पहले वनडे से हट गए थे. और उनका यह डांस वीडियो शादी समारोह का है.","content":"रोहित शर्मा का अंदाज-ए-डांस भी बैटिंग की तरह ही स्पेशल है भारतीय कप्तान रोहित शर्मा (Rohit Sharma) सिर्फ मैदान पर बल्ले से ही आग लागना नहीं जानते, बल्कि वह स्टेज पर डांस के मामले में भी ऐसा कर सकते हैं! भले ही रोहित एक पेशेवर डांसर नहीं हैं, लेकिन जाहिर है कि जब रोहित किसी स्टेज पर डांस करेंगे, तो सभी की नजरें बड़े-बड़े डांसरों से हटकर रोहित पर ही टिक जाएंगी. और कुछ ऐसा ही रोहित ने हाल ही में अपने साल की शादी समारोह में किया. अपने शांत मिजाज के लिए मशहूर रोहित शादी के दौरान एक अलग ही अवतार में दिखे और मंच पर पत्नी रितिका और बेटी समाइरा के साथ डांस करके पूरी महफिल लूट ली. रोहित ने शादी से जुड़ा एक वीडियो अपने इंस्टाग्राम पर पोस्ट किया है, जिसमें रोहित के प्रशंसक अपने हीरो को \"डांसताल\" करते हुए देख सकते हैं. मुंबई इंडियंस ने अपने कप्तान के वीडियो पर कमेंट करते हुए लिखा, \"फुल वाइब है, स्किप.\" हाल ही में रोहित साले की शादी में हिस्सा लेने के लिए ऑस्ट्रेलिया के खिलाफ पहले वनडे मुकाबले से हट गए थे. हालांकि, उनके हटने का टीम इंडिया पर असर नहीं पड़ा था. और भारत ने कंगारुओं के खिलाफ पहला वनडे जीत लिया था. लेकिन विडंबना यह रही कि रोहित के वापसी करने के बावजूद भारत 2-1 से सीरीज गंवा बैठा. यह भारत की साल 2019 के बाद घर में किसी वनडे सीरीज में पहली हार रही. बहरहाल, अब रोहित एक बार फिर से शुरू होने जा रही इंडियन प्रीमियर लीग में बल्ले से जलवा बिखरते दिखायी पड़ेंगे. उनके चाहने वाले बेसब्री से अपने हीरो को फिर से धूम-धड़ाका करते देखने के लिए बेकरार हैं. इस साल का संस्करण मार्च 31 से शुरू हो रहा है. पहला मुकाबला गत चैंपियन गुजरात और चेन्नई सुपर किंग्स के बीच खेला जाएगा. रोहित की कप्तानी में मुंबई इंडियंस ने पांच बार खिताब जीता है. और मुंबई एक बार फिर से खिताब पर नजरें गड़ाए हुए है. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-25 18:26:02","image_url":"https://c.ndtvimg.com/2023-03/p0i3sr9_rohit-sharma-dance-806_625x300_25_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"यह बहुत ही शानदार और धोनी का सबसे बेहतरीन छक्का था', दोस्त रैना ने याद किए पुराने पल","link":"https://sports.ndtv.com/hindi/cricket/it-was-such-a-fantastic-and-finest-six-of-ms-dhoni-buddy-raina-recalls-old-memories-3893320#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"जियो सिनेमा पर एक कार्यक्रम में सुरेश रैना ने विस्तार से एमएस धोनी (MS Dhoni) से जुड़े रोमांचक किस्सों को बताया है","content":"टीम इंडिया के पूर्व बल्लेबाज और धोनी के खास दोस्तों में से एक सुरेश रैना अब यह तो करोड़ों क्रिकेटप्रेमी जानते ही हैं कि एमएस धोनी और सुरेश रैना की दोस्ती कैसी रही है. कई साल तक भारत के लिए खेलने के बाद इन दोनों के संबंध चेन्नई सुपर किंग्स के लिए खेलने के दौरान और भी ज्यादा मजबूत हो गए. इसी दौरान धोनी का नाम \"थाला (बड़ा भाई)\" और रैना का नाम \"चिन्ना थाला\" (छोटा भाई) पड़ गया. और अब रैना ने जियो सिनेमा पर प्रसारित हुए हालिया एपिसोड-\"माय टाइम विद धोनी\"- में धोनी से जुड़ी कई बातों को लेकर खुलासा किया. रैना ने उस पल को याद किया, जब उन्होंने पहली बार धोनी और उनके द्वारा लगाए गए बड़े-बड़े छ्क्कों को देखा. यह साल 2004 का समय था, जब धोनी ईस्ट जोन के खिलाफ सेंट्रल जोन के लिए खेल रहे थे. रैना ने उस समय को याद करते हुए कहा कि तब हम झारखंड के उस खिलाड़ी के बारे में बहुत ही जोर-शोर से सुन रहे थे, जो नियमित रूप से स्टेडियम के बाहर छक्के मारने के लिए मशहूर हो चला था. उन्होंने कहा कि एक दिन हम इकट्ठा थे, जबकि धोनी भाई चुपचाप एक कोने में बैठकर रोटी और बटर चिकन खा रहे थे. तब उन्हें ज्ञानू भाई (ज्ञानेंद्र पांडेय) ने देखा और कहा, \"मैं वास्तव में नहीं सोचता कि वह हमारा कोई नुकसान करने जा रहा है. वह अपने खाने का लुत्फ उठा रहा है. उसका इसका मजा लेने दो.\" रैना ने कहा कि जब धोनी बैटिंग के लिए आए, तो कप्तान मोहम्मद कैफ ने उनके खिलाफ आक्रामक फील्डिंग सजा दी, लेकिन एमएस ने शुरुआत से ही लंबे-लंबे छक्के जड़े और ज्ञानू भाई को अपने शब्द वापस लेने को मजबूर होना पड़ा. लेकिन वास्तव में रैना को और अटैकिंग धोनी के छक्कों के दर्शन तब हुए, जब वह उनके साथ आईपीएल में साथ-साथ खेले. रैना ने धोनी के सबसे गगनचुंबी छक्के को याद करते हुए कहा, \"यह समय साल 2010 का था, जब हम धर्मशाला में किंग्स इलेवन पंजाब (अब पंजाब किंग्स) के खिलाफ खेल रहे थे. तब धोनी ने लांग-ऑन के ऊपर से लंबा छक्का जड़ा और इसके बाद उन्होंने अपने हेलमेट पर पंच किया. मैंने इसके बाद कभी भी धोनी को किसी भी हालात में ऐसी प्रतिक्रिया करते हुए नहीं देखा. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-25 18:02:48","image_url":"https://c.ndtvimg.com/2023-03/joijrmqo_suresh-raina_625x300_16_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Will encourage girls to enjoy final: Delhi Capitals’captain Meg Lanning","link":"https://thenewsmill.com/2023/03/will-encourage-girls-to-enjoy-final-delhi-capitalscaptain-meg-lanning/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The Delhi Capitals are all set to take on the Mumbai Indians in the final of the Women’s Premier League at the Brabourne Stadium, Mumbai on Sunday. Speaking ahead of the summit clash, Delhi Capitals’ captain Meg Lanning said, “Mumbai and Delhi have been consistent throughout the tournament. We know how dangerous Mumbai can be and how many great players they have. It’s a massive challenge for us, but our group is confident ahead of the big game.” The Australian legend expressed that she wants her team to enjoy the Final. “We have learned a lot throughout the tournament, which has prepared us for a high-pressure game on Sunday. We’ve just got to go out there and play our best cricket. We’ve played with a smile on our faces throughout this competition and I’ll encourage the girls to enjoy the Final as well,” she added. Heaping praise on her opening partner Shafali Verma, Lanning said, “Shafali and I have a really good combination at the top. We play differently, which works for us. The opening spot is my favourite position and it’s been nice to play there. Shafali has made my job a little bit easier by taking the attack to the opposition. Hopefully, we’ve got one more big partnership in us on Sunday.” On the importance of the Women’s Premier League, the DC Skipper said, “The atmosphere has been amazing throughout the WPL. Young girls can certainly dream of playing in front of crowds and enjoying themselves. It was important to get this message out there for women’s cricket. And this tournament has been incredible for that.” The final clash of the Women’s Premier League 2023 will begin at 7:30 PM IST on Sunday. (ANI)","pubDate":"2023-03-25 17:31:26","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Delhi Capitals Road To WPL Final Inspires And Motivates Mens Team, Says Coach Ricky Ponting","link":"https://www.thetimesofbengal.com/sports/delhi-capitals-road-to-wpl-final-inspires-and-motivates-mens-team-says-coach-ricky-ponting/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Delhi Capitals’ Road To WPL Final Inspires And Motivates Men’s Team, Says Coach Ricky Ponting Delhi Capitals will be playing Mumbai Indians in the Women’s Premier League Final on Sunday. Delhi Capitals players celebrate one of their victories in WPL. (Image: Twitter) New Delhi: Delhi Capitals’ road to maiden Women’s Premier League (WPL) […]","content":"New Delhi: Delhi Capitals’ road to maiden Women’s Premier League (WPL) final is something that will motivate and inspire the men’s team in the upcoming edition of Indin Premier League (IPL) 2023, felt head coach Ricky Ponting. Playing in the inaugural WPL, Delhi Capitals, led by Australia Meg Lanning, entered the final directly after finishing on top of five-team table. The Delhi franchise won six out of eight league games, same as Mumbai Indians but went on to table top due to better net run rate. “It sort of motivates and inspires us as a men’s team as well with what the women have done in the past few weeks and gives us somethking to aspire too. If they go and win it, its acts as a extra motivation for us as well,” Ponting said on Friday during a team event. Delhi started with a two wins before losing to Mumbai Indians in their third game. They revovered with back-to-back two wins before losing to Gujarat Giants. With a top spot at stake, Lanning’s girls won the remaining two league games to make their way into the summit clash. In the final, Delhi Capitals will face Mumbai Indians, who defeated UP Warriorz in the one-off Eliminator. Ponting lavished praise on Lanning and stated the star players did their job to perfection in leading them to the final. “As a men’s team, we will be sending some videos to the women’s team just to wish them all the best. I think it makes us all really proud to see Delhi Capitals team in an WPL final. The level of cricket they have played throughout the tournament is outstanding. “Their star players have really stood up and led the way and Meg Lanning has obviously has done a great job in captaining the team,” added the two-time Australian World Cup-winning skipper. Delhi Capitals begin their IPL 2023 campaign against Lucknow Super Giants on April 1 at the Ekana Stadium. Source link","pubDate":"2023-03-25 17:11:58","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"SA vs WI: बचपन में चराता था बकरी, अब कप्तानी पारी खेल बजाई द.अफ्रीका की बैंड, ऋषभ पंत की टीम होगी खुश","link":"https://hindi.news18.com/news/sports/cricket-rovman-powell-first-match-as-full-time-west-indies-t20i-captain-scored-led-team-to-victory-against-south-africa-5656285.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"SA vs WI 1st T20: वेस्टइंडीज ने दक्षिण अफ्रीका को पहले टी20 में 3 विकेट से हरा दिया. वेस्टइंडीज के लिए कप्तान रोवमैन पॉवेल ने तूफानी पारी. उन्होंने आखिरी ओवर में छक्का उड़ाकर बारिश से बाधित मैच में जीत दिलाई. वेस्टइंडीज को 11 ओवर में 132 रन की दरकार थी. कैरेबियाई टीम ने 3 गेंद रहते लक्ष्य हासिल कर लिया.","content":"रोवमैन पॉवेल की आतिशी पारी से वेस्टइंडीज ने द.अफ्रीका को पहले टी20 में हरा दिया. (west indies cricket twitter) नई दिल्ली. वेस्टइंडीज ने सेंचुरियन में खेले गए पहले टी20 में मेजबान दक्षिण अफ्रीका को 3 विकेट से हरा दिया. वेस्टइंडीज के लिए रोवमैन पॉवेल ने कप्तानी पारी खेली. पॉवेल ने 18 गेंद में 43 रन की नाबाद पारी खेली. रोवमैन पॉवेल ने अपनी इस पारी में 5 छक्के और एक चौका जमाया. बारिश से बाधित मैच में वेस्टइंडीज को 11 ओवर में 132 रन का टारगेट मिला था. कैरेबियाई टीम ने 3 गेंद रहते ही इस लक्ष्य को हासिल कर लिया. ये पॉवेल का वेस्टइंडीज की टी20 टीम का बतौर फुलटाइम कप्तान पहला मैच था और इसमें ही उन्होंने बल्ले से कोहराम मचा दिया. बता दें कि पॉवेल का बचपन बेहद गरीबी में बीता था. उन्हें बचपन में बकरी तक चरानी पड़ी थी. वेस्टइंडीज को आखिरी ओवर में 8 रन चाहिए थे. ये ओवर वेन पार्नेल ने किया. उनकी पहली गेंद डॉट रही. अब 5 गेंद में 8 रन की दरकार थी. पार्नेल ने दूसरी बॉल वाइड फेंकी. अब जीत के लिए 7 रन चाहिए थे. अगली गेंद पार्नेल ने ऑफ स्टम्प के बाह फेंकी. इस पर पॉवेल ने जोर से बल्ला घुमाया और गेंद को सीधा डीप स्क्वेयर लेग बाउंड्री की तरफ छक्के के लिए उड़ा दिया. पॉवेल के इस शॉट के साथ ही स्कोर बराबर हो गए. तीसरी गेंद पर पॉवेल ने 1 रन लेकर वेस्टइंडीज को जीत दिला दी. इस जीत के साथ ही वेस्टइंडीज ने सीरीज में 1-0 की बढ़त ले ली. . #MaroonFans how good was captain @Ravipowell26 today! 🔥 #PowellPower #MenInMaroon #SAvWI pic.twitter.com/gOJYeSD0vy — Windies Cricket (@windiescricket) March 25, 2023 रोवमैन पॉवेल की इस तूफानी बैटिंग से दिल्ली कैपिटल्स काफी खुश होगी. पॉवेल इस टी20 सीरीज के बाद आईपीएल में हिस्सा लेंगे और दिल्ली कैपिटल्स की तरफ से खेलेंगे. लगातार बारिश के कारण मैच 2 घंटे की देरी से शुरू हुआ और फिर इसे घटाकर 11 ओवर प्रति टीम कर दिया गया. वेस्टइंडीज ने टॉस जीता और दक्षिण अफ्रीका को पहले बल्लेबाजी का न्यौता दिया. दक्षिण अफ्रीका को पहली ही गेंद पर झटका लगा. क्विंटन डिकॉक शून्य पर आउट हो गए. इसके बाद रिली रुसो और एडेन मार्करम भी जल्दी आउट हो गए. डेविड मिलर ने 22 गेंद में 48 रन की पारी खेलकर दक्षिण अफ्रीका को 11 ओवर में 131 रन के स्कोर तक पहुंचाया. WPL Final: चाचा हॉन्गकॉन्ग के लिए क्रिकेट खेले, परदादी थी जासूस, अब पोती दिलाएगी MI को खिताब ब्रैंडन किंग ने 8 गेंद में 23 रन की तूफानी पारी खेल वेस्टइंडीज को अच्छी शुरुआत दिलाई. इसके बाद जॉनसन चार्ल्स ने 14 गेंद में 28 रन ठोके. हालांकि, असली रंग तो कप्तान रोवमैन पॉवेल ने दिखाया. वेस्टइंडीज को आखिरी 24 गेंद में 48 रन की दरकार थी. तब पॉवेल ने बोर्न फोर्टूइन के ओक ओवर में 23 रन कूटे. यहीं से खेल पलटा और आखिरी ओवर में छक्का लगाकर पॉवेल को वेस्टइंडीज को जीत दिला दी. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Aiden Markram , David Miller , IPL 2023 , Rovman Powell , South Africa vs West Indies इंजीनियरिंग का करिश्मा है भारतीय रेल का पहला केबल ब्रिज, बड़े विस्फोट को सहने की क्षमता, तस्वीरों में जानें खूबियां फिल्म स्टार्स के हमशक्ल हैं ये 5 एक्टर-एक्ट्रेस, बॉलीवुड में हुई थी धमाकेदार एंट्री, सिर्फ 1 की चमकी किस्मत Realme-Xiaomi की बोलती होगी बंद! 13 हजार से कम में Samsung लाया 5G फोन, फीचर्स जानकर नहीं होगा यकीन!","pubDate":"2023-03-25 17:00:14","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/powell-west-indies-16797635423x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Raina recalls first time he saw Dhoni hit huge sixes","link":"https://thenewsmill.com/2023/03/raina-recalls-first-time-he-saw-dhoni-hit-huge-sixes/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The bromance between Suresh Raina and MS Dhoni is no secret. The partnerships two have forged while wearing the Blues or Yellows is now part of cricketing folklore. Such was the impact of the Raina-Dhoni alliance that Chennai Super Kings fans fondly called Raina ‘Chinna Thala’ after Dhoni became their ‘Thala’. On a new episode of ‘My Time with Dhoni’on JioCinema, Raina recalled the moment he first witnessed Dhoni and his penchant for big-hitting. In 2004, Raina represented Central Zone, and first-hand got a taste of Dhoni’s prowess, who was playing for the East Zone. “We were hearing a lot about a player with long hair from Jharkhand known for hitting it out of the park consistently,” recalled Raina. “This one day, we all were hanging around while Dhoni bhai quietly was eating his roti and butter chicken in a corner. Gyanu bhai saw him and said, ‘I really don’t think he’s going to do us any damage. He’s enjoying his food; let him do that,” Raina remembered. When the action began, Dhoni came out to bat, and Central Zone skipper Mohammed Kaif put an attacking field with slips and a gully. “From the word go, he hit gagan chumbhi (sky-high) sixes, and Gyanu bhai had to eat his words,” said Raina, who then witnessed MSD’s hard-hitting and finishing skills from close quarters while playing for India and CSK. But the most memorable gagan chumbhi six that Raina recalled Dhoni hitting was in 2010 at Dharamshala in a match against Kings XI Punjab. “He clubbed a big one over long-on and then punched his helmet. I have never seen him do this in any match or any situation. Everyone knew him as Captain Cool, but the energy he showed was because of the match situation,” Raina recalled. Dhoni led CSK in a tricky, high-scoring chase in that match that took them to the semifinals, eventually the ultimate prize too. Giving a peek into his off-field passion, Raina reveals Dhoni’s passion for two-wheelers has been extended to four-wheelers too. “We all know how many bikes he has and how he personally fine-tunes them, but he has extended this passion for vintage cars. He has become a collector,” Raina revealed. Mr. IPL also divulged his skipper’s love for gaming. “Whenever we would ask him to go for dinner, he would inevitably play a game and delay our meals by 10-15 mins because he was intensely involved in the game,” Raina said. (ANI)","pubDate":"2023-03-25 16:31:22","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"}]}