{"newsArray":[{"title":"CA refutes reports but does not quell Langer speculation","link":"https://sportstar.thehindu.com/cricket/cricket-australia-refutes-reports-but-does-not-quell-langer-speculation/article38357266.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Cricket Australia (CA) on Tuesday refuted a media report that national men's team coach Justin Langer had been involved in a \"heated meeting\" in which his future reportedly was discussed.","content":null,"pubDate":"2022-02-01 03:24:50","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Cricket Australia Denies \"Fiery\" Justin Langer Contract Talks","link":"https://sports.ndtv.com/cricket/cricket-australia-denies-fiery-justin-langer-contract-talks-2741171","keywords":null,"creator":null,"video_url":null,"description":"Local media reports said Justin Langer, whose intense management style created dressing room tensions last year, \"went ballistic\" during talks with senior Cricket Australia staff over his future.","content":null,"pubDate":"2022-02-01 03:03:48","full_description":"Cricket Australia has denied reports national coach Justin Langer threw a tantrum at a \"fiery\" meeting after being told he may need to reapply for his job. Langer's four-year contract ends in mid-2022 and there is speculation over his future, despite Australia's recent success in the Ashes series and at the T20 World Cup. Local media reports said Langer, whose intense management style created dressing room tensions last year, \"went ballistic\" during talks with senior Cricket Australia staff over his future. The 51-year-old was reportedly incensed at the prospect of having to reapply for the job he took in 2018, when Australian cricket was mired in the Sandpaper-gate cheating scandal. Cricket Australia confirmed contract discussions with Langer began last Friday but rejected suggestions the meeting turned ugly. \"While we do not comment on confidential conversations, we felt on this occasion it was important to correct the record,\" the governing body said in a statement. \"Among other false claims, we reject outright the assertion that the meeting was fiery or heated and that Justin was asked to reapply for his job.\" The governing body said it would make an announcement when the contract discussions were complete. Former opening batter Langer has restored Australia's cricketing pride after the ball-tampering affair in South Africa revealed the national side was plagued by a toxic win-at-all-costs mentality. But there have long been rumours of discontent over his \"headmaster-like\" leadership style and former captain Tim Paine revealed last August that players had complained to Langer about the issue. Former captain Mark Taylor said he suspected there was a push for change within the Australian camp because Langer had achieved the goal of cleaning up the team culture after the 2018 cheating scandal. Promoted \"(Now) there's a movement –- maybe by the players, maybe by Cricket Australia themselves –- that (the) job has been done, and it might be time for more of a man manager and less of an absolute cricket coach and disciplinarian,\" Taylor told Sydney's 2GB radio. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2021-11/mbkmmj7_justin-langer-afp_625x300_07_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Who will win today Pakistan Super League match: Who is expected to win Islamabad United vs Multan Sultans PSL 2022 match?","link":"https://thesportsrush.com/cricket-news-who-will-win-today-pakistan-super-league-match-who-is-expected-to-win-quetta-gladiators-vs-multan-sultans-psl-2022-match/","keywords":["Cricket","Islamabad vs Multan","PSL 2022","PSL Match Prediction"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Islamabad United vs Multan Sultans: The SportsRush brings you the analysis and match-prediction of the Pakistan Super League game. Islamabad United will lock horns against Multan Sultans in the league game of the PSL 2022. The match will be played at the National Cricket Stadium in Karachi. Islamabad United have won their only game, whereas… The post Who will win today Pakistan Super League match: Who is expected to win Islamabad United vs Multan Sultans PSL 2022 match? appeared first on The SportsRush.","content":"Islamabad United vs Multan Sultans: The SportsRush brings you the analysis and match-prediction of the Pakistan Super League game. Islamabad United will lock horns against Multan Sultans in the league game of the PSL 2022. The match will be played at the National Cricket Stadium in Karachi. Islamabad United have won their only game, whereas the Sultans have won all three of their games. The game will be live on Sony Six from 7.30 PM IST. Who will win today PSL 2022 match: Islamabad United vs Multan Sultans Pitch Report The pitch has been excellent for batting this season. There is an even bounce on the track, whereas the boundaries are small as well. Both teams would want to chase because of the dew factor. Islamabad United preview Islamabad United have started their PSL 2022 campaign with a win. This team looks well balanced on the paper. Alex Hales and Paul Stirling proved their class in the last game, whereas Colin Munro will also be back from this match. Asif Ali proved his class in the T20 World Cup, whereas the addition of Azam Khan is a bonus. Shadab Khan will take care of spin duties, whereas there are pacers like Hasan Ali, Merchant de Lange, Faheem Ashraf, and Mohammad Wasim Jr in the team. Probable XI: Alex Hales, Paul Stirling, Colin Munro, Asif Ali, Mubasir Khan, Azam Khan, Shadab Khan, Mohammad Wasim Jr, Faheem Ashraf, Hasan Ali, Merchant de Lange. Immy’s a mood \\0/ #HBLPSL7 l #LevelHai l #QGvIU pic.twitter.com/axoGPLc9Zv — PakistanSuperLeague (@thePSLt20) January 31, 2022 Multan Sultans preview Multan Sultans are the defending champions, and they have won all three of their games this season. Mohammad Rizwan has scored two half-centuries in two games, whereas Shan Masood has also scored two half-centuries. Sohaib Maqsood had a terrific PSL 2021, whereas Rilee Rossouw, Tim David, and Khushdil Shah are other important batters. Imran Tahir has scalped seven wickets in the tournament, whereas Khushdil and Willey have scalped five and four wickets, respectively. This time is looking in fine form. Probable XI: Mohammad Rizwan, Shan Masood, Sohaib Maqsood, Rilee Rossouw, Khushdil Shah, Tim David, David Willey, Shahnawaz Dahani, Abbas Afridi, Imran Khan Sr., Imran Tahir. Match Prediction Islamabad United are the favourites to win this game. The post Who will win today Pakistan Super League match: Who is expected to win Islamabad United vs Multan Sultans PSL 2022 match? appeared first on The SportsRush.","pubDate":"2022-02-01 02:58:37","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Virat Kohli isn’t at his best at the moment, hope he hits form soon, says Ajit Agarkar","link":"https://zeenews.india.com/cricket/virat-kohli-isn-t-at-his-best-at-the-moment-hopefully-hits-form-soon-says-ajit-agarkar-2432470.html","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli’s last century in international cricket came way back in November 2019 as he scored a ton against Bangladesh in the day-night Test at Eden Gardens, Kolkata.","content":null,"pubDate":"2022-02-01 02:36:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Justin Langer's future as Australian cricket coach remains as complicated as his reign - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMibGh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTAyLTAxL2p1c3Rpbi1sYW5nZXItZnV0dXJlLWFzLWF1c3RyYWxpYS1jb2FjaC1pbi10aGUtYWlyLWNvbnRyYWN0LzEwMDc5NTA5MtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Justin Langer's future as Australian cricket coach remains as complicated as his reign  ABC NewsLanger meltdown appears to spell the end for Australia coach  Sydney Morning HeraldLanger’s future in jeopardy after ‘meltdown’  NEWS.com.auCA deny heated meeting with coach Langer  The Canberra TimesView Full coverage on Google News","content":null,"pubDate":"2022-02-01 02:08:45","image_url":null,"source_id":"google"},{"title":"‘It should’: Strong message for more Tests","link":"https://www.news.com.au/sport/cricket/ashes-rising-star-annabel-sutherland-is-the-future-of-australian-womens-cricket/news-story/f5496ea03d4dd921190e6231aeb55749","keywords":null,"creator":null,"video_url":null,"description":"Annabel Sutherland is one rising star who looms as the future of women’s cricket and that future should include more Test matches.","content":null,"pubDate":"2022-02-01 01:44:00","full_description":"Annabel Sutherland is one rising star who looms as the future of women’s cricket and that future should include more Test matches. The 20-year-old all-rounder bowled her heart out in last Sunday’s thrilling draw with England in Canberra, nearly bowling Australia to a surprise victory, a performance that earnt all manner of praise. Australian captain Meg Lanning said Sutherland, playing just her second Test match after her first late last year against India, was “amazing” as she was preferred above veteran superstar Ellyse Perry to bowl in tandem with first-gamer Alana King to try to seize victory. With Perry, who didn’t bowl in the thrilling final hour of play last Sunday, offering calming advice from mid-off, Sutherland seized three late wickets, all after going for two sixes in her first over, in a six-over spell during which Lanning never wavered from giving her the ball. “I have always wanted to take an opportunity when it’s thrown at me and the nature of this Australian team is it doesn’t happen that often because of the depth we have got,” Sutherland said, reflecting on that final day. “Just being able to take that role, take the ball when Meg threw it at me, I feel like I have been ready to do that for the last year or so and I’ll certainly take a lot of confidence from the role I was able to play. “My first over at the end wasn’t great. I got hit for two sixes. I was a bit surprised to get thrown the ball again after that over but was just happy to play my role. “We’d fought so hard to get back into the game and it was really cool to have Pez (Perry) next to me and she was really good in keeping me calm. “I was pretty pumped. I had a fair bit of adrenaline. It was so much fun, there was no place I’d rather be.” Sutherland said she “always dreamt” of being in a position to win a Test match for Australia, a dream she had every time she headed to the MCG with her father James, the former Cricket Australia chief executive, for a match. While the current calendar has no more Test matches scheduled for Australia for the immediate future, Sutherland said there was little doubt it was a format the players craved and last weekend’s epic finish should set the wheels in motion to make that happen. “It should. When you get a Test match where in that last session on day four you could have any result happen, it’s pretty exciting,” she said. “I dreamt of it. I’ve worked pretty hard to try and go after that. It’s pretty cool to be in that position. “Just from a playing perspective, the more we play, the more we get used to that. We just love being able to put on the baggy green.” Sutherland and the Australians will now reset their focus for the first of three ODIs against England on Thursday that will decide the multi-format series and who wins the Ashes. The Justin Langer contract storm has descended into farce amid claims and now counterclaims from Cricket Australia. The Justin Langer contract situation has descended into farce amid claims and now counterclaims from Cricket Australia. Ashes hero and T20 World Cup champion Mitchell Starc still hasn’t forgotten what Shane Warne said at the start of the summer.","image_url":null,"source_id":"news"},{"title":"‘It should’: Strong message for more Tests","link":"https://www.cairnspost.com.au/sport/cricket/ashes-rising-star-annabel-sutherland-is-the-future-of-australian-womens-cricket/news-story/f5496ea03d4dd921190e6231aeb55749","keywords":["Breaking News","Cricket news and galleries","National Breaking News","Network News","NewsWire","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"Annabel Sutherland is one rising star who looms as the future of women’s cricket and that future should include more Test matches.","content":null,"pubDate":"2022-02-01 01:44:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"COV vs MGD Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BPL 2022 Match No. 15 at Zahur Ahmed Chowdhury Stadium, Chattogram, 12 PM IST February 1","link":"https://zeenews.india.com/cricket/cov-vs-mgd-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-bpl-2022-match-no-15-at-zahur-ahmed-chowdhury-stadium-chattogram-12-pm-ist-february-1-2432461.html","keywords":null,"creator":null,"video_url":null,"description":"Comilla Victorians vs Minister Group Dhaka Dream11 Team Prediction Comilla Victorians vs Minister Group Dhaka Match No. 15 - Check My Dream11 Team, Best players list of COV vs MGD, Minister Group Dhaka Dream11 Team Player List, Comilla Victorians Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Bangaladesh Premier League 2022, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-02-01 01:41:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Seventeen year old stars for Bangladesh","link":"https://www.cairnspost.com.au/sport/cricket/seventeen-year-old-stars-for-bangladesh/video/bfd997f44f4554d582fba76796393c3d","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The under 19's World Cup saw the emergence of a young star playing for Bangladesh.","content":null,"pubDate":"2022-02-01 01:40:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Seventeen year old stars for Bangladesh","link":"https://www.news.com.au/sport/cricket/seventeen-year-old-stars-for-bangladesh/video/bfd997f44f4554d582fba76796393c3d","keywords":null,"creator":null,"video_url":null,"description":"Cricket: The under 19's World Cup saw the emergence of a young star playing for Bangladesh.","content":null,"pubDate":"2022-02-01 01:40:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Ranji Trophy league phase from February 16 to March 5","link":"https://www.tribuneindia.com/news/sports/ranji-trophy-league-phase-from-february-16-to-march-5-366060","keywords":null,"creator":null,"video_url":null,"description":"New Delhi Red-ball domestic cricket in India will make a much-awaited return after two years when the league stage of the Ranji Trophy is held from February 16 to March 5, as per the revised scheduled prepared by the BCCI. Boca Raton (US) Aditi finishes T-13 as Lydia Ko wins title at Gainbridge Indian golfer Aditi Ashok got her 2022 season off to a solid start with a T-13 finish at the Gainbridge LPGA here. Aditi, who shot 66 on the first day, closed the week with three birdies against a lone bogey for 2-under 70 that saw her total 4-under 284. Bengaluru PKL: Gujarat Giants beat Haryana Steelers Raiders Ajay Kumar and Pardeep Kumar helped Gujarat Giants beat Haryana Steelers 32-26 in the Pro Kabaddi League here today. Gujarat dominated right from the first whistle and gave Haryana's defence no chance to stamp their authority. Liverpool Lampard appointed coach by Everton Everton have appointed former Chelsea boss Frank Lampard as their manager on a two-and-a-half-year contract, the Premier League club said today. Everton sacked Rafa Benitez this month after a 2-1 defeat at Norwich City left the Merseyside club six points above the relegation zone. Fatorda Record-breaker Ogbeche helps Hyderabad to 5-0 win Bartholomew Ogbeche scored a brace on either side of halftime to take him top of the charts in the Hero Indian Super League's all-time scorers' list and also ensure Hyderabad FC a 5-0 win over NorthEast United FC here today. London Clamour grows for 5-day women's Tests after thriller Women's Test matches should be played over five days to produce more results, current and former players said after England and Australia battled out a thrilling draw in Canberra on Sunday. Australia's brave declaration set up an intriguing fourth and final day. — Agencies","content":null,"pubDate":"2022-02-01 01:32:58","full_description":"New Delhi Red-ball domestic cricket in India will make a much-awaited return after two years when the league stage of the Ranji Trophy is held from February 16 to March 5, as per the revised scheduled prepared by the BCCI. Boca Raton (US) Aditi finishes T-13 as Lydia Ko wins title at Gainbridge Indian golfer Aditi Ashok got her 2022 season off to a solid start with a T-13 finish at the Gainbridge LPGA here. Aditi, who shot 66 on the first day, closed the week with three birdies against a lone bogey for 2-under 70 that saw her total 4-under 284. Bengaluru PKL: Gujarat Giants beat Haryana Steelers Raiders Ajay Kumar and Pardeep Kumar helped Gujarat Giants beat Haryana Steelers 32-26 in the Pro Kabaddi League here today. Gujarat dominated right from the first whistle and gave Haryana’s defence no chance to stamp their authority. Liverpool Lampard appointed coach by Everton Everton have appointed former Chelsea boss Frank Lampard as their manager on a two-and-a-half-year contract, the Premier League club said today. Everton sacked Rafa Benitez this month after a 2-1 defeat at Norwich City left the Merseyside club six points above the relegation zone. Fatorda Record-breaker Ogbeche helps Hyderabad to 5-0 win Bartholomew Ogbeche scored a brace on either side of halftime to take him top of the charts in the Hero Indian Super League’s all-time scorers’ list and also ensure Hyderabad FC a 5-0 win over NorthEast United FC here today. London Clamour grows for 5-day women’s Tests after thriller Women’s Test matches should be played over five days to produce more results, current and former players said after England and Australia battled out a thrilling draw in Canberra on Sunday. Australia’s brave declaration set up an intriguing fourth and final day. — Agencies","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_1862960579.jpg","source_id":"tribuneindia"},{"title":"U-19 World Cup: Entire India squad fit for semifinal against Australia","link":"https://www.tribuneindia.com/news/sports/u-19-world-cup-entire-india-squad-fit-for-semifinal-against-australia-366059","keywords":null,"creator":null,"video_url":null,"description":"North Sound (Antigua), January 31India U-19 cricketer Nishant Sindhu has recovered from Covid-19 and will be available for selection for the semifinal against Australia in the U-19 World Cup here on Wednesday.The development means that all squad members are available for the crucial game. Sindhu had led the side in two league games in the absence of Yash Dhull who had tested positive along with four team members before the game against Ireland. Sindhu tested positive after the final league game against Uganda.\"All are available for selection for the Australia game. Sindhu has tested negative,\" an ICC source told PTI.Record four-time champions India had beaten Australia in the warm-up game ahead of their tournament opener against South Africa.Afghanistan face EnglandTheir late arrival in the Caribbean had forced the ICC to rework the fixtures of their group matches but Afghanistan, with their magnificent run to the semifinals of the U-19 World Cup, ensured the tweaking by the apex body was worth it, even if it meant rescheduling as many as four matches.Accustomed to dealing with issues far removed from and bigger than cricket, the battle-hardened Afghanistan will chase history tomorrow, in a sport that has often been a soothing balm for the country's many battered souls.Having punched above their weight, they face England in the Super League semifinals at Sir Vivian Richards Stadium, an appropriate setting for those seeking inspiration for doing things in cricket which only the man after whom the venue is named could do in his heyday. —","content":null,"pubDate":"2022-02-01 01:32:08","full_description":"PTI North Sound (Antigua), January 31 India U-19 cricketer Nishant Sindhu has recovered from Covid-19 and will be available for selection for the semifinal against Australia in the U-19 World Cup here on Wednesday. The development means that all squad members are available for the crucial game. Sindhu had led the side in two league games in the absence of Yash Dhull who had tested positive along with four team members before the game against Ireland. Sindhu tested positive after the final league game against Uganda. “All are available for selection for the Australia game. Sindhu has tested negative,” an ICC source told PTI. Record four-time champions India had beaten Australia in the warm-up game ahead of their tournament opener against South Africa. Afghanistan face England Their late arrival in the Caribbean had forced the ICC to rework the fixtures of their group matches but Afghanistan, with their magnificent run to the semifinals of the U-19 World Cup, ensured the tweaking by the apex body was worth it, even if it meant rescheduling as many as four matches. Accustomed to dealing with issues far removed from and bigger than cricket, the battle-hardened Afghanistan will chase history tomorrow, in a sport that has often been a soothing balm for the country’s many battered souls. Having punched above their weight, they face England in the Super League semifinals at Sir Vivian Richards Stadium, an appropriate setting for those seeking inspiration for doing things in cricket which only the man after whom the venue is named could do in his heyday. —","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_1814129630.jpg","source_id":"tribuneindia"},{"title":"Life after captaincy: Virat Kohli counts on gains as a batter","link":"https://www.tribuneindia.com/news/sports/life-after-captaincy-virat-kohli-counts-on-gains-as-a-batter-366052","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, January 31Citing Mahendra Singh Dhoni as an example, Virat Kohli says one doesn't need to be the captain of a team to be a leader and now that he is not the India skipper, he might contribute more as the side's batting mainstay.Kohli shocked the cricketing world earlier this month when he stepped down from Test captaincy following the South Africa debacle. He ended up as India's most successful Test captain.When you think of moving forward and achieving more, you feel like you have done your job. Now as a batsman may be you have more things to contribute. You can make the team win more Virat Kohli His unexpected decision came after he resigned as the T20 team captain before being removed as ODI skipper.During Digit's 'Firseside Chat with VK', Kohli spoke about how one can contribute to the team even when he is not its leader.\"Everything has a tenure and time period. You obviously have to be aware of that. People might say 'what this guy has done' but you know when you think of moving forward and achieving more, you feel like you have done your job. Now as a batsman may be you have more things to contribute to the team. You can make the team win more. So take pride in that. You don't need to be a captain to be a leader. As simple as that,\" he said.Kohli had taken over captaincy from Dhoni, first in Tests and then limited-overs cricket. \"When MS Dhoni was in the team it was not like that he was not a leader. He was still the guy we were going to constantly to get inputs,\" he added. \"...but for him to understand that yes it is natural progression and a natural time for me to take over and take Indian cricket forward to a level that I wanted to and as long as I feel that I have done that job without having materialistic goals, that has a longer lasting effect.\"Kohli also talked about the timing of moving on. Rohit Sharma has taken over from him as the white-ball captain while the board is yet to announce his successor in the five-day format.\"Taking the decision to move on is also part of leadership to understand the right time to do it. To understand that may be the environment needs a different direction,\" Kohli said. \"Obviously same culture but a different set of ideas to boost people in a different way and contribute in a different manner. One has to embrace all kinds of roles and responsibilities. I always thought like a captain even when I was a player,\" he added. — PTIWindies name T20Is squad, Hetmyer outSt John's: The big-hitting Shimron Hetmyer remained unavailable due to fitness issues as West Indies named a 16-member squad for the T20I series against India, keeping faith in the outfit that defeated England in a five-match home contest earlier this month. Eleven players feature in both the limited overs squads — Keiron Pollard, Fabian Allen, Darren Bravo, Jason Holder, Shai Hope, Akeal Hosein, Brandon King, Nicholas Pooran, Romario Shepherd, Odean Smith and Hayden Walsh Jr. Hetmyer was left out on fitness grounds once again.","content":null,"pubDate":"2022-02-01 01:32:02","full_description":"PTI New Delhi, January 31 Citing Mahendra Singh Dhoni as an example, Virat Kohli says one doesn’t need to be the captain of a team to be a leader and now that he is not the India skipper, he might contribute more as the side’s batting mainstay. Kohli shocked the cricketing world earlier this month when he stepped down from Test captaincy following the South Africa debacle. He ended up as India’s most successful Test captain. When you think of moving forward and achieving more, you feel like you have done your job. Now as a batsman may be you have more things to contribute. You can make the team win more Virat Kohli His unexpected decision came after he resigned as the T20 team captain before being removed as ODI skipper. During Digit’s ‘Firseside Chat with VK’, Kohli spoke about how one can contribute to the team even when he is not its leader. “Everything has a tenure and time period. You obviously have to be aware of that. People might say ‘what this guy has done’ but you know when you think of moving forward and achieving more, you feel like you have done your job. Now as a batsman may be you have more things to contribute to the team. You can make the team win more. So take pride in that. You don’t need to be a captain to be a leader. As simple as that,” he said. Kohli had taken over captaincy from Dhoni, first in Tests and then limited-overs cricket. “When MS Dhoni was in the team it was not like that he was not a leader. He was still the guy we were going to constantly to get inputs,” he added. “...but for him to understand that yes it is natural progression and a natural time for me to take over and take Indian cricket forward to a level that I wanted to and as long as I feel that I have done that job without having materialistic goals, that has a longer lasting effect.” Kohli also talked about the timing of moving on. Rohit Sharma has taken over from him as the white-ball captain while the board is yet to announce his successor in the five-day format. “Taking the decision to move on is also part of leadership to understand the right time to do it. To understand that may be the environment needs a different direction,” Kohli said. “Obviously same culture but a different set of ideas to boost people in a different way and contribute in a different manner. One has to embrace all kinds of roles and responsibilities. I always thought like a captain even when I was a player,” he added. — PTI Windies name T20Is squad, Hetmyer out St John’s: The big-hitting Shimron Hetmyer remained unavailable due to fitness issues as West Indies named a 16-member squad for the T20I series against India, keeping faith in the outfit that defeated England in a five-match home contest earlier this month. Eleven players feature in both the limited overs squads — Keiron Pollard, Fabian Allen, Darren Bravo, Jason Holder, Shai Hope, Akeal Hosein, Brandon King, Nicholas Pooran, Romario Shepherd, Odean Smith and Hayden Walsh Jr. Hetmyer was left out on fitness grounds once again.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_1040978447.jpg","source_id":"tribuneindia"},{"title":"Cricket Australia fires up over Langer report","link":"https://wwos.nine.com.au/cricket/justin-langer-coach-contract-cricket-australia-statement-report/ff24c3b9-cbae-4576-a1dc-09a2e094ecb9","keywords":null,"creator":["wwos"],"video_url":null,"description":"Cricket Australia has sensationally fired up over a report which claimed, ironically, to reveal details of a fiery meeting held last week.","content":"Cricket Australia has sensationally fired up over a report which claimed, ironically, to reveal details of a fiery meeting held last week.Fox Sports says Australian men's coach Justin Langer was involved in a heated meeting with CA heavy hitters Nick Hockley and Ben Oliver, regarding the former's contract.Langer is currently contracted to coach the national team until mid-this year, essentially ending after a tour to Pakistan in March and April.READ MORE: Nadal's 'superhuman' moment after five-hour epicREAD MORE: Nadal's sharp response to claiming GOAT statusREAD MORE: Chilling reason Olympic great feared being killedHe's yet to be offered an extension or told he is no longer needed. Interestingly, new Australian captain Pat Cummins has failed to endorse a Langer extension when asked about it publicly.Last year senior players - including Cummins - confronted Langer and after some mediation it was agreed the latter would relinquish some responsibilities to assistant coaches Andrew McDonald and Michael Di Venuto.In the months following that decision the Australian men's team won a Twenty20 World Cup and then an Ashes series convincingly.But after the report about Friday's meeting surfaced on Monday, Cricket Australia came out all guns blazing and fired off a statement to media.\"There were a number of inaccuracies in a story... concerning a meeting between Australian men's team head coach Justin Langer, Cricket Australia CEO Nick Hockley and EGM of high performance and national teams Ben Oliver on Friday,\" the message read.\"While we do not comment on confidential conversations, we felt on this occasion it was important to correct the record.\"Among other false claims, we reject outright the assertion that the meeting was fiery or heated and that Justin was asked to reapply for his job.\"Justin has always been contracted as head coach through to the middle of this year and we have consistently maintained that discussions around the future of the role would commence following the conclusion of the men's Ashes series.\"Friday's meeting was the first time that we had the opportunity to meet together in person, reflect on the team's success and discuss the road ahead.\"We will continue with this process and make an announcement once it is complete.\"While barely any current Test players have publicly endorsed a contract extension for Langer, the coach has received plenty of support from former teammates, and even one-time Ashes rival Michael Vaughan.https://twitter.com/MichaelVaughan/status/1488069983615729666?ref_src=twsrc%5Etfwhttps://twitter.com/damienmartyn/status/1488274172849844224?ref_src=twsrc%5EtfwOn Monday night Langer's former Test captain, Mark Taylor, was baffled by the reports.\"I don't understand that, if that is the case,\" Taylor told 2GB radio.\"He had an issue... where his coaching style was criticised by the current players, and he's seemed to have sorted that out.\"I think the Australian cricket authorities would know the sort of coach they're getting from Justin Langer. It's an evolving coach.\"Obviously he's getting better at it and the side is responding to it. So they know what they're going to get from Langer.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-01 01:15:33","full_description":"Cricket Australia has sensationally fired up over a report which claimed, ironically, to reveal details of a fiery meeting held last week. Fox Sports says Australian men's coach Justin Langer was involved in a heated meeting with CA heavy hitters Nick Hockley and Ben Oliver , regarding the former's contract. Langer is currently contracted to coach the national team until mid-this year, essentially ending after a tour to Pakistan in March and April. READ MORE: Nadal's 'superhuman' moment after five-hour epic READ MORE: Nadal's sharp response to claiming GOAT status READ MORE: Chilling reason Olympic great feared being killed He's yet to be offered an extension or told he is no longer needed. Interestingly, new Australian captain Pat Cummins has failed to endorse a Langer extension when asked about it publicly. Last year senior players - including Cummins - confronted Langer and after some mediation it was agreed the latter would relinquish some responsibilities to assistant coaches Andrew McDonald and Michael Di Venuto. In the months following that decision the Australian men's team won a Twenty20 World Cup and then an Ashes series convincingly. But after the report about Friday's meeting surfaced on Monday, Cricket Australia came out all guns blazing and fired off a statement to media. \"There were a number of inaccuracies in a story... concerning a meeting between Australian men's team head coach Justin Langer, Cricket Australia CEO Nick Hockley and EGM of high performance and national teams Ben Oliver on Friday,\" the message read. \"While we do not comment on confidential conversations, we felt on this occasion it was important to correct the record. \"Among other false claims, we reject outright the assertion that the meeting was fiery or heated and that Justin was asked to reapply for his job. \"Justin has always been contracted as head coach through to the middle of this year and we have consistently maintained that discussions around the future of the role would commence following the conclusion of the men's Ashes series. \"Friday's meeting was the first time that we had the opportunity to meet together in person, reflect on the team's success and discuss the road ahead. \"We will continue with this process and make an announcement once it is complete.\" While barely any current Test players have publicly endorsed a contract extension for Langer, the coach has received plenty of support from former teammates, and even one-time Ashes rival Michael Vaughan. On Monday night Langer's former Test captain, Mark Taylor, was baffled by the reports. \"I don't understand that, if that is the case,\" Taylor told 2GB radio. \"He had an issue... where his coaching style was criticised by the current players, and he's seemed to have sorted that out. \"I think the Australian cricket authorities would know the sort of coach they're getting from Justin Langer. It's an evolving coach. \"Obviously he's getting better at it and the side is responding to it. So they know what they're going to get from Langer.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/01/408713/wwos.png","source_id":"nine"},{"title":"Cricket Australia condemn ‘inaccurate’ report on Justin Langer’s future as Australian cricket coach","link":"https://www.perthnow.com.au/sport/cricket/cricket-australia-condemn-inaccurate-report-on-justin-langers-future-as-australian-cricket-coach--c-5520112","keywords":null,"creator":["Samantha Rogers"],"video_url":null,"description":"Cricket Australia has released a statement following what it called ‘a number of inaccuracies’ in a report over the future of Justin Langer as Australian cricket coach.","content":null,"pubDate":"2022-02-01 01:13:35","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5520112/24e517afbf9558dd7a5ac81a9f3ebe819aa94153-16x9-x418y13w2369h1333.jpg","source_id":"perthnow"},{"title":"Cricket Australia condemn ‘inaccurate’ report on Justin Langer’s future as Australian cricket coach","link":"https://thewest.com.au/sport/cricket/cricket-australia-condemns-inaccurate-report-on-justin-langers-future-as-australian-cricket-coach--c-5519948","keywords":null,"creator":["Samantha Rogers"],"video_url":null,"description":"Cricket Australia has released a statement following what it called ‘a number of inaccuracies’ in a report over the future of Justin Langer as Australian cricket coach.","content":null,"pubDate":"2022-02-01 01:06:45","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5519948/d8f8a24d3d4563765fe7d9cfcdd4100b178c5af3-16x9-x0y570w5472h3078.jpg","source_id":"thewest"},{"title":"KP, Northern, Punjab Whites record wins in U16 cricket","link":"https://www.thenews.com.pk/print/929788-kp-northern-punjab-whites-record-wins-in-u16-cricket","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: KP, Northern and Southern Punjab Whites prevailed over their rivals in the National U16 One-Day Tournament at various venues in Multan on Monday.Southern Punjab Whites, Northern Whites and Khyber Pakhtunkhwa Whites won their games against Sindh Whites, Balochistan Whites and Central...","content":null,"pubDate":"2022-02-01 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"‘Crazy’: Ex-players unload on Langer fiasco","link":"https://www.news.com.au/sport/cricket/former-players-lash-cricket-australia-for-not-resigning-coach-justin-langer/news-story/8a327e9b108bfdb582625f558353893d","keywords":null,"creator":null,"video_url":null,"description":"Furious former teammates of Australian coach Justin Langer have slammed Cricket Australia’s handling of his contract situation, labelling it “crazy” he hasn’t been re-signed.","content":null,"pubDate":"2022-02-01 00:45:00","full_description":"Furious former teammates of Australian coach Justin Langer have slammed Cricket Australia’s handling of his contract situation, labelling it “crazy” he hasn’t been re-signed. Amid reports Langer went “ballistic” in a meeting with CA boss Nick Hockley last week after it was suggested he may have to reapply for his job, former Test star Damien Martyn led the charge in support. But CA hit back on Tuesday morning, declaring there were a “ number of inaccuracies” in the original reporting of the meeting last Friday between Langer, Hockley and national high performance manager Ben Oliver. “While we do not comment on confidential conversations, we felt on this occasion it was important to correct the record,” a statement said. “Among other false claims, we reject outright the assertion that the meeting was fiery or heated and that Justin was asked to reapply for his job. “Justin has always been contracted as head coach through to the middle of this year and we have consistently maintained that discussions around the future of the role would commence following the conclusion of the men’s Ashes series. “Friday’s meeting was the first time that we had the opportunity to meet together in person, reflect on the team’s success and discuss the road ahead. “We will continue with this process and make an announcement once it is complete.” It came after Martyn, a long-time friend and supporter of Langer, even went as far as starting an online poll that overwhelmingly supported Langer’s retention as cricket pundits including former England captain Michael Vaughan reacted to the reports his future could be in doubt despite landing the T20 World Cup and a 4-0 Ashes win. “It’s crazy … Took us from our darkest days to here,” Martyn said referencing Langer’s revival of the Test team after the sandpaper scandal in 2018. Martyn was also scathing of the leaks coming out of CA about Langer. Should JL be re-signed as Australian cricket coach? @cricketcomau #cricket #respect #values #winning #record Itâs crazyâ¦ Took us from our darkest days to here. The question should be who is leaking confidential information to the media? #cricket #loyalty #honour #values #cricketgate https://t.co/mKEgxQxPiB Vaughan, who spent the summer in Australia commentating on the Test series, said Langer’s record should be enough for him to be re-signed. “If it’s true the Coach of Australia has to reapply for his position when he has taken them to No 1 Test team in the World & the T20 World Cup champs in the last few months .. the landscape for success has hugely changed … Isn’t it about Winning ?? !!!,” he posted on Twitter. On Monday Foxsports.com.au reported that Langer reacted angrily when the possibility of him reapplying for the coaching role was raised by Hockley and Oliver during a heated meeting last Friday morning. According to the report, Langer is refusing to accept anything less than a full contract renewal, arguing his record warrants another multi-year deal. Langer was last week inducted into the Australian Cricket Hall of Fame, but a previous breakdown in relationships with senior Australian players is still hanging over his head. If itâs true the Coach of Australia has to reapply for his position when he has taken them to No 1 Test team in the World & the T20 World Cup champs in the last few months .. the landscape for success has hugely changed â¦ Isnât it about Winning ?? !!! #Langer It’s been reported Langer won’t go on the upcoming tour of Pakistan unless his contract situation is sorted. The CA board is reportedly uncertain over Langer’s reappointment. A crisis meeting between CA chiefs and senior players was needed last year to address the issues between players and coach, sparking suggestions Langer was in danger of not having his contract renewed. The former Australian Test opener has since taken a step back and delegated more responsibility to his support staff, which has seemingly helped improve the team’s performance. The Justin Langer contract situation has descended into farce amid claims and now counterclaims from Cricket Australia. Ashes hero and T20 World Cup champion Mitchell Starc still hasn’t forgotten what Shane Warne said at the start of the summer. A host of Big Bash stars are officially out of contract but Glenn Maxwell isn’t and continues to show his big money worth.","image_url":null,"source_id":"news"},{"title":"CA deny heated meeting with coach Langer","link":"https://www.perthnow.com.au/sport/cricket/ca-deny-heated-meeting-with-coach-langer-c-5519502","keywords":null,"creator":["Steve Larkin"],"video_url":null,"description":"Cricket Australia denies a recent meeting with Justin Langer was heated as it considers whether to extend his tenure as the nation's head coach.","content":null,"pubDate":"2022-02-01 00:18:18","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5519502/4b1d8d4d3960f34fb7d9c37078271a339912e540-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"CA deny heated meeting with coach Langer","link":"https://thewest.com.au/sport/cricket/ca-deny-heated-meeting-with-coach-langer-c-5519500","keywords":null,"creator":["Steve Larkin"],"video_url":null,"description":"Cricket Australia denies a recent meeting with Justin Langer was heated as it considers whether to extend his tenure as the nation's head coach.","content":null,"pubDate":"2022-02-01 00:18:18","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5519500/4b1d8d4d3960f34fb7d9c37078271a339912e540-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Justin Langer’s future as Australian coach is hanging by a thread after a fallout over the length of his new deal","link":"https://thewest.com.au/sport/justin-langers-future-as-australian-coach-is-hanging-by-a-thread-after-a-fallout-over-the-length-of-his-new-deal-c-5514814","keywords":null,"creator":["Robert Craddock "],"video_url":null,"description":"Justin Langer’s future as the Australian coach is in danger after Cricket Australia put forward a non-committal offer that has lead to a fallout between parties.","content":null,"pubDate":"2022-01-31 23:16:59","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5514814/24e517afbf9558dd7a5ac81a9f3ebe819aa94153-16x9-x0y0w3000h1688.jpg","source_id":"thewest"},{"title":"Exclusive: The shock proposal that triggered angry JL reaction at top-secret Cricket Australia meeting - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiyAFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvYXVzdHJhbGlhL2F1c3RyYWxpYW4tY3JpY2tldC1uZXdzLTIwMjItanVzdGluLWxhbmdlci1jb2FjaC1jb250cmFjdC11cGRhdGVzLWZpZXJ5LW1lZXRpbmctd2l0aC1jYS1wYXQtY3VtbWlucy1pbmZsdWVuY2UvbmV3cy1zdG9yeS85N2UxZWJhNDJiZDliM2RlM2U0NDgwNWNiYmI4ZTcwM9IByAFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvYXVzdHJhbGlhL2F1c3RyYWxpYW4tY3JpY2tldC1uZXdzLTIwMjItanVzdGluLWxhbmdlci1jb2FjaC1jb250cmFjdC11cGRhdGVzLWZpZXJ5LW1lZXRpbmctd2l0aC1jYS1wYXQtY3VtbWlucy1pbmZsdWVuY2UvbmV3cy1zdG9yeS85N2UxZWJhNDJiZDliM2RlM2U0NDgwNWNiYmI4ZTcwMw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Exclusive: The shock proposal that triggered angry JL reaction at top-secret Cricket Australia meeting  Fox SportsLanger’s future in jeopardy after ‘meltdown’  NEWS.com.auLanger meltdown appears to spell the end for Australia coach  Sydney Morning HeraldCoaching future of Langer in doubt  Fox SportsContract fallout: Langer’s future hanging by a thread  Daily TelegraphView Full coverage on Google News","content":null,"pubDate":"2022-01-31 21:51:03","image_url":null,"source_id":"google"},{"title":"RCB captain 2022: 5 players who can lead Royal Challengers Bangalore in IPL 2022","link":"https://thesportsrush.com/cricket-news-rcb-captain-2022-5-players-who-can-lead-royal-challengers-bangalore-in-ipl-2022/","keywords":["Cricket","IPL 2022","IPL","RCB"],"creator":["Gurpreet Singh"],"video_url":null,"description":"RCB captain 2022: The SportsRush presents a few potential player options for the franchise’s captaincy post ahead of IPL 2022 mega auction. After an action-packed IPL retention event last month, which saw the eight initial franchises brainstorming their way towards deciding upon their retention picks for the new season, a few of them are yet… The post RCB captain 2022: 5 players who can lead Royal Challengers Bangalore in IPL 2022 appeared first on The SportsRush.","content":"RCB captain 2022: The SportsRush presents a few potential player options for the franchise’s captaincy post ahead of IPL 2022 mega auction. After an action-packed IPL retention event last month, which saw the eight initial franchises brainstorming their way towards deciding upon their retention picks for the new season, a few of them are yet to decide upon a potential skipper who they deem to be fit to lead the side. While the Mumbai Indians, Chennai Super Kings, Delhi Capitals, Sunrisers Hyderabad, and the Rajasthan Royals have have already decided upon their respective captains via the retentions, the two new franchises in Ahmedabad and Lucknow Super Giants have also announced their skippers for their debut season. This leaves the likes of Royal Challengers Bangalore, Punjab Kings, and the Kolkata Knight Riders with a good headache to ace with their choice for a fitting skipper. As for the RCB, their longest serving skipper Virat Kohli had decided to step down as their captain after the end of IPL 2021. But, with the franchise deciding to retain Glenn Maxwell, the Aussie T20 star is perhaps the next best suited option to lead the franchise going forward. Having said that, the management might as well not wish to burden him with the extra responsibility and let him play freely as he successfully did under Virat Kohli in the previous season. In such a case, with the franchise yet to win an IPL title in the 14 years of the league’s existence, let’s have a look at the deserving options from the pool of registered players that might turn their fortunes around in the 15th season. RCB captain 2022 Shreyas Iyer The one name that is doing the buzz across the social media platforms pertaining the upcoming mega auction is Mumbai and team India middle-order batter Shreyas Iyer. Iyer is expected to be one of the most expensive buys in the auction given his proven credentials as skipper of the Delhi Capitals during IPL 2019 and 2020. While he led the Capitals into the playoffs in the 2019 season, he backed it up with a maiden IPL final appearance for the franchise a year later. If RCB think-tank are indeed looking for an Indian face to lead their side, there are very few like Iyer amongst the current crop of players. David Warner While Iyer might well be one of most sought Indian players at the auction table, Australia’s opening batter and Sunrisers Hyderabad’s former skipper David Warner will definitely be one of the Overseas faces the 10 franchises would like to have in their squad. RCB would not only be assured of a tried and tested opening batter in the T20 format, but also an experienced campaigner who is more than just capable to lead the team, having already lifted the title once for an IPL franchise before. Moreover, as far as his batting is concerned, the Southpaw is the highest overseas run-scorer in the league’s history and is placed fifth in the all time highest run-getters list. As far as his form in T20 cricket is concerned, the entire world was witness to his batting prowess during the ICC T20 World Cup in UAE last year, where he ended as the second-highest run-scorer in the tournament. Ravichandran Ashwin Having last played a T20I for India in July 2017, Ravichandran Ashwin’s dramatic return to the Indian limited Overs side after four years is a beautiful comeback story in itself. Moreover, with nearly 50 T20Is and 167 IPL matches under his name, coupled with the experience of leading an IPL team (Punjab Kings) before, for a franchise looking for a bankable captaincy option and a maiden photo finish, there wouldn’t be many players akin Ashwin’s caliber available in the Cricketing fraternity presently. Shikhar Dhawan Apart from David Warner, former Delhi Capitals’ opening batter Shikhar Dhawan is yet another player with loads of experience, who can turn the fortunes for RCB in the 15th edition of the league. Dhawan has been one of the consistent performers in the IPL over the years. He scored runs in excess of 500 in each of the previous three seasons he played for the Delhi Capitals. While he ended as the second-highest run scorer in IPL 2020, he ended as Capitals’ highest run-getter during the previous season with 587 runs at an average of 39.13. Partnering alongside Virat Kohli, with whom the Southpaw shares a pretty good rapport with, Dhawan might prove to be a perfect steal for the RCB at the auction table. Gabbar dropping anchor in #IPL2021 meant a win is never too far off Went past the record for most 50+ scores in successful chases in IPL history 7⃣4⃣% of his 5⃣8⃣7⃣ runs came in wins #YehHaiNayiDilli @SDhawan25 pic.twitter.com/bm5nH5Jnz1 — Delhi Capitals (@DelhiCapitals) October 22, 2021 Jason Holder The facet of the game where RCB have struggled over the years is a solid lower-middle order batting option; a player who has the ability to play a cameo to propel the team’s score batting first, or allow the top order batters to play with a bit more freedom whist a chase is on. ALSO READ: Aakash Chopra considers Jason Holder as apt RCB captain for IPL 2022 Jason Holder’s services in this regard not only makes him a permanent player in the eleven, but also a perfect captaincy option who can also bowl well, especially with the new, swinging ball upfront. Talking of experience as skipper, the 30-year-old has captained West Indies in 37 Tests, 86 ODIs and three T20Is, and has also led the Barbados Royals in the Carribean Premier League before. The post RCB captain 2022: 5 players who can lead Royal Challengers Bangalore in IPL 2022 appeared first on The SportsRush.","pubDate":"2022-01-31 21:17:15","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Country week cricket: Blaze Rosinski says B-section title ‘very rewarding’ part of Bunbury’s historic double","link":"https://thewest.com.au/news/south-west/country-week-cricket-blaze-rosinski-says-b-section-title-very-rewarding-part-of-bunburys-historic-double-c-5479487","keywords":null,"creator":["Jackson Barrett"],"video_url":null,"description":"Bunbury’s remarkable 12-month rise from staring down country week relegation to a pair of premierships will mean the association has two sides in the competition’s top tier next year.","content":null,"pubDate":"2022-01-31 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5479487/37089ddabc42cd9c5f6246d68a0cbbab034f96d4-16x9-x0y107w2048h1152.jpg","source_id":"thewest"},{"title":"Basketball, football and cricket in Great Southern to continue without proof of vaccination","link":"https://thewest.com.au/news/albany-advertiser/basketball-football-and-cricket-in-great-southern-to-continue-without-proof-of-vaccination-c-5511468","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"From January 31 there are a host of venues that require proof of double vaccination upon entry, including indoor sports centres, however, community sport remains exempt.","content":null,"pubDate":"2022-01-31 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5511468/fd70c396edb45917c0dda7f60556b9c822362433-16x9-x0y270w5184h2916.jpg","source_id":"thewest"},{"title":"“This is the tournament Khushdil Shah levels up as a player”: Khushdil Shah grabs a stunning catch to dismiss Will Smeed during Quetta Gladiators vs Multan Sultans PSL 2022 match","link":"https://thesportsrush.com/cricket-news-this-is-the-tournament-khushdil-shah-levels-up-as-a-player-khushdil-shah-grabs-a-stunning-catch-to-dismiss-will-smeed-during-quetta-gladiators-vs-multan-sultans-psl-2022-match/","keywords":["Cricket","Khushdil Shah","Multan Sultans","PSL 2022","Quetta Gladiators"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Khushdil Shah grabs a stunning catch during Quetta Gladiators versus Multan Sultans match at the National Stadium in Karachi. During the seventh match of the ongoing seventh season of the Pakistan Super League between Quetta Gladiators and Multan Sultans at the National Stadium in Karachi, Multan’s left-arm spinner Khushdil Shah took a blinder of a… The post “This is the tournament Khushdil Shah levels up as a player”: Khushdil Shah grabs a stunning catch to dismiss Will Smeed during Quetta Gladiators vs Multan Sultans PSL 2022 match appeared first on The SportsRush.","content":"Khushdil Shah grabs a stunning catch during Quetta Gladiators versus Multan Sultans match at the National Stadium in Karachi. During the seventh match of the ongoing seventh season of the Pakistan Super League between Quetta Gladiators and Multan Sultans at the National Stadium in Karachi, Multan’s left-arm spinner Khushdil Shah took a blinder of a catch to dismiss Gladiators’ opening batter Will Smeed. The event happened during the second delivery of the 3rd Over with Quetta chasing the score of 174/3 posted by Multan. Khushdil bowled a short but a quick delivery around the stomach height to right-handed Smeed as his eyes got lit up and mind ready to dismiss the ball from his sight. He went on the back foot alright, but got hurried away courtesy the pacey delivery, and ultimately managed to smack the delivery straight back towards the umpire. Quick to react, Khushdil threw himself to his right and grabbed a two-handed stunner to send Will Smeed packing at the score of 3 (5). On what seems to be a relatively tacky surface, Multan skipper Mohammad Rizwan handed the new ball to Khushdil, and the 26-year-old did oblige by giving away only three runs in the opening Over. Post picking up the first wicket in only his second Over, Khushdil picked up yet another wicket in his 3rd Over to get rid of in-form Ahsan Ali. His bowling figures so far, at the time of writing, read 3-0-7-2. Khushdil Shah grabs a stunning catch to dismiss Will Smeed Khushdil gets him! @will_smeed has an early exit #HBLPSL7 l #LevelHai l #QGvMS pic.twitter.com/JYQv7DaISQ — PakistanSuperLeague (@thePSLt20) January 31, 2022 Twitter reactions on Khushdil Shah catch This is the tournament @KhushdilShah_ levels up as a player. Becoming a proper bowler now too! pic.twitter.com/p1PTliEzHZ — Ali Khan Tareen (@aliktareen) January 31, 2022 What A Catch! @KhushdilShah_ dillon ka badshah . Smeed out caught and bowled. #QGvMS #SultanAaGayya #HBLPSL7 — Multan Sultans (@MultanSultans) January 31, 2022 Mohammad Rizwan Khushdil Shah A captain loves it when a plan comes together! #QGvMS pic.twitter.com/LOHaUgkQe5 — Samaa Sports (@samaasport) January 31, 2022 Khushdil Shah Today…#QGvsMS | #MSvsQG | #PSL2022 pic.twitter.com/Hvt1K3Ew0Y — | KK (@baba56zam) January 31, 2022 Khushdil shah doing the magic….#PSL7 pic.twitter.com/K2wdA4x15A — Saad Sultan Khan (@KhanSaad07) January 31, 2022 Khushdil Shah can bat, can field very well and can pick up wickets. A complete all-rounder. #PSL2022 #HarHaalMainCricket #QGvsMS — Rizwan Ali (@joji_39) January 31, 2022 Khushdil Shah in #PSL2022 so far: Overs: 6⃣ Wickets: 5⃣ To go with his batting heroics against Lahore. #MSvQG — S A A D | LQ (@SaadSays22) January 31, 2022 Khushdil Shah winning it with the bowl — Fakhruu #Qalandars :^) (@BajwaKehtaHaii) January 31, 2022 For more Cricket related news, click here.     The post “This is the tournament Khushdil Shah levels up as a player”: Khushdil Shah grabs a stunning catch to dismiss Will Smeed during Quetta Gladiators vs Multan Sultans PSL 2022 match appeared first on The SportsRush.","pubDate":"2022-01-31 17:22:49","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Kohli returning to form will make things easier for Rohit, says former India pacer Agarkar","link":"https://www.thehansindia.com/sports/kohli-returning-to-form-will-make-things-easier-for-rohit-says-former-india-pacer-agarkar-727182","keywords":["Sports"],"creator":["Ishka"],"video_url":null,"description":"Virat Kohli has not scored a century since November 2019Kohli has 70 international tons to his nameHe will now be action in India vs West Indies series","content":"Kohli returning to form will make things easier for Rohit, says former India pacer AgarkarKohli returning to form will make things easier for Rohit, says former India pacer AgarkarIf Virat Kohli returned to form in time for the upcoming series between India and West Indies, it would only make things easier for captain Rohit Sharma, former pacer Ajit Agarkar has said.Agarkar has termed Kohli's lean patch with the bat as a cause of concern for the Indian team. The former India captain Kohli has not hit an international century since his 136 against Bangladesh at Eden Gardens in the pink ball Test in November 2019. That century marked Kohli's 70th international century. In 2021, Kohli failed to impress with the bat in Tests as he finished with 536 runs in 11 Tests at a poor average of 28.21. While Rohit finished as India's leading run-scorer in the whites last year, Kohli was fourth in the list. Kohli scored some 400-odd runs lesser than opening batsman Rohit, who could soon be named the former's successor as India's new Test captain. While Rohit has been named as India's new limited-overs skipper, the Indian cricket board is yet to name the Test skipper. \"At the end of the day you're only successful as successful your team is and if you don't win, it eventually doesn't matter how great a player you are out on the field, it's not enjoyable playing in the team,\" Agarkar told Star Sports' show 'Game Plan'.💙🏏 pic.twitter.com/tv9GEH7Fk5— Virat Kohli (@imVkohli) January 18, 2022 Now that Kohli is no longer the captain of India in any format, he could focus solely on his batting. Agarkar has said the sooner the former finds his form the better for the team.\"We talk about different combinations before - Virat Kohli would be a key factor because of the kind of player that he is but at the moment he isn't at his best, which is a fact and the quicker he discovers his form it's going to be that much easier for Rohit Sharma to then manage that thing because of what he can do on his own, Virat Kohli. \"Virat Kohli's form is a concern, but we all know what a player he is. So, hopefully, he discovers his form sooner rather than later,\" Agarkar added in the same interview. However, in India's recent tour of South Africa, Kohli did show some signs of good form as he scored two half-centuries in the ODI series. But he failed to capitalise on his starts and convert them into something big. India were handed a 3-0 whitewash in the 50-over series by the Temba Bavuma-led South African side. It was earlier reported on Monday that Team India have reached Ahemdabad ahead of their ODI series. After the ODI series, India and West Indies will head to Kolkata to face off against each other in the three-game T20I series at Eden Gardens. Rohit, who missed the South Africa tour due to a hamstring injury, will lead India against West Indies, which will be his first series as India's full-time captain.","pubDate":"2022-01-31 16:32:50","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/01/31/500x300_1198146-kohli.jpg","source_id":"thehansindia"},{"title":"Cricket Association Of Bengal \"Confident\" To Stage Three T20Is vs WI","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-cricket-association-of-bengal-confident-to-stage-three-t20is-vs-wi-2740762","keywords":null,"creator":null,"video_url":null,"description":"India vs West Indies: The ODI series of this tour will be held in Ahmedabad, followed by the T20I series in Kolkata.","content":null,"pubDate":"2022-01-31 16:25:48","full_description":"Cricket Association of Bengal (CAB) president Avishek Dalmiya said the board is confident in staging the upcoming three T20Is against West Indies in February. Team India are set to play three ODIs at the Narendra Modi Stadium, Ahmedabad from February 6 followed by the T20I series at the Eden Gardens, Kolkata from February 16. \"It may be recalled that CAB had organised a T20 match against New Zealand successfully in November 2021 with players and support staff in bio-secure environment and with seventy per cent cricket lovers in attendance,\" Avishek Dalmiya said in a statement. \"This time too, CAB is confident that it will be able to successfully host the three T20 international matches against West Indies in a similar manner,\" he added. The CAB president also said the board is also looking forward to resuming local cricket tournaments at the earliest following COVID guidelines and protocols. \"In fact, CAB has taken proactive steps to vaccinate all the players above the age of 15 years who would be participating in the CAB Leagues,\" said Avishek Dalmiya Promoted \"In this regard, it may not be out of place to mention that CAB had already organised onsite vaccination camp at Eden Gardens recently where first doses of vaccines were given to players in the age bracket of 15 to 18,\" he added. CAB is set to organise another camp so that such players can avail the second dose as well before the commencement of the league.","image_url":"https://c.ndtvimg.com/2021-11/k76hqj7o_rohit-sharma-afp_625x300_20_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Watch: \"Catch Of The Tournament?\", Fielder's Brilliant Effort In U-19 WC","link":"https://sports.ndtv.com/cricket/icc-u-19-cricket-world-cup-catch-of-the-tournament-south-africas-andile-simelanes-spectacular-effort-vs-sri-lanka-watch-2740668","keywords":null,"creator":null,"video_url":null,"description":"ICC U-19 Cricket World Cup: During South Africa's loss vs Sri Lanka, Andile Simelane put in a brilliant catch to dismiss Sakuna Liyanage.","content":null,"pubDate":"2022-01-31 15:43:05","full_description":"South Africa crashed to a defeat against Sri Lanka in their 5th place playoff fixture of the ongoing ICC U-19 Cricket World Cup in North Sound on Sunday. Despite losing by 65 runs, the Proteas had plenty of positives to look at, especially their fielding. Andile Simelane perfectly showed South Africa's fielding skills with an outstanding catch during the match. During the ninth over of Sri Lanka's innings, Sakuna Liyanage received a short delivery from Matthew Boast which he outside edged to second slip where a jumping Simelane saw the ball bounce on his palm and then he dived backwards to catch it at the rebound. The ICC posted a video of the highlight on Instagram and also captioned it as, \"Andile Simelane - catch of the tournament?\" Here is the video: A post shared by ICC (@icc) Sri Lanka set a target of 233 runs for their opponents after posting 232 for six in 50 overs. Dunith Wellalage was in top form and smashed 113 runs off 130 balls and also smacked nine fours, four sixes. Meanwhile, Ranuda Somarathne also registered an unbeaten half-century. Kwena Maphaka and Boast were in good form for South Africa, bagging three and four wickets respectively. Promoted Chasing a target of 233, the Proteas were bowled out for 167 in 37.3 overs. Gerhardus Maree top-scored for his side with a knock of 44 runs off 43 deliveries. Traveen Mathew, Shevon Daniel and Raveen de Silva took two wickets each for Sri Lanka.","image_url":"https://c.ndtvimg.com/2022-01/puo5n21_andile-simelane-instagram_120x90_31_January_22.jpg","source_id":"ndtv"},{"title":"“Pretty hard to argue after what he has done with his Test Cricket”: Ricky Ponting picks Virat Kohli’s successor for Team India’s next Test captain post","link":"https://thesportsrush.com/cricket-news-pretty-hard-to-argue-after-what-he-has-done-with-his-test-cricket-ricky-ponting-picks-virat-kohlis-successor-for-team-indias-next-test-captain-post/","keywords":["Cricket","Ricky Ponting","Team India","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ricky Ponting picks Virat Kohli’s successor for Team India’s next captain in the Test format after latter’s sudden relinquishment from post. It has been around a couple of weeks since Virat Kohli’s sudden decision to step down as team India’s Test captain. While the fans took some time to come to terms with the shocking… The post “Pretty hard to argue after what he has done with his Test Cricket”: Ricky Ponting picks Virat Kohli’s successor for Team India’s next Test captain post appeared first on The SportsRush.","content":"Ricky Ponting picks Virat Kohli’s successor for Team India’s next captain in the Test format after latter’s sudden relinquishment from post. It has been around a couple of weeks since Virat Kohli’s sudden decision to step down as team India’s Test captain. While the fans took some time to come to terms with the shocking decision, and with change being the only constant with the BCCI having not named the team’s next skipper as yet, the focus quickly shifted towards deliberations upon who is the most suited now to take up the vacant spot. The experts and former cricketers have ever since come up with their preferred choice. While the legendary Sunil Gavaskar would like Rishabh Pant to take up the responsibility, the likes of Shane Warne and Kevin Pietersen too have come up with their suggestions on the same. Former decorated Australian skipper Ricky Ponting too, has now had a say on the same during the first episode of the ICC review. Ricky Ponting picks Virat Kohli’s successor In conversation with former cricketer Isa Guha on the first episode of The ICC Review, Ponting has named India’s current White-ball format captain Rohit Sharma as the best suited man to take the team forward in Tests as well. Ponting was of the view that Rohit had it in him ever since he took over as Mumbai Indians’ skipper after replacing him in 2013. “I was at Mumbai Indians when Rohit Sharma took over the captaincy there,” said Ponting. “I was bought in the auction to be their captain and unfortunately, I wasn’t playing well enough after the first few games to keep myself in the team, so I had to make room for another international player to come into the side. “The owners and the team management wanted to know who I thought would be the appropriate person to take over the leadership at the Mumbai Indians. There were a few names thrown around between owners and the other coaches but it was really clear to me that there was only one guy that can lead the team – he was a young guy and his name happened to be Rohit Sharma. “I think the proof is in the pudding with what he has done at the Mumbai Indians since that moment on. He has been a very successful leader there and has been when he has led India on a few occasions as well,” remarked Ricky Ponting. Although Rohit hasn’t led Team India in Tests as yet, he has captained in 22 ODIs before and has prevailed in 18 of them. In the T20Is, the 34-year-old has won 8 out of 10 games as Team India captain. Virat Kohli Rohit Sharma Beginning of a new era for India men’s limited-overs cricket. pic.twitter.com/5yo9Jdj4U2 — ICC (@ICC) December 8, 2021 Rohit’s rise in Test Cricket off-late as a batter also, as per Ponting, makes a case for his eligibility for the post. “If I go back to what I said at the start about being on top of your game when you take over a captaincy role, then it is pretty hard to argue after what he has done with his Test cricket in the last 2-3 years. He has played as well as anybody in the world through that period of time, and we know how good he is as a white-ball player. “They (BCCI) will have a decision to make what they want to do with their roles as well, whether they split roles or they want to keep the same captain for all formats, Ponting further added. The post “Pretty hard to argue after what he has done with his Test Cricket”: Ricky Ponting picks Virat Kohli’s successor for Team India’s next Test captain post appeared first on The SportsRush.","pubDate":"2022-01-31 15:06:23","full_description":null,"image_url":null,"source_id":"thesportsrush"}]}