{"newsArray":[{"title":"‘I‘d like to apologise’: Radio host’s all-time Ashes jinx","link":"https://www.foxsports.com.au/cricket/the-ashes/fool-radio-commentator-told-to-leave-after-steve-smith-jinx/news-story/86ce2a35f8f8bd395593121863f095a0","keywords":null,"creator":null,"video_url":null,"description":"Popular cricket commentator Gus Worland has made a “formal” apology to Australia after he put the mocker on Australian captain Steve Smith.","content":null,"pubDate":"2021-12-17 22:10:00","full_description":"Popular cricket commentator Gus Worland has made a “formal” apology to Australia after he put the mocker on Australian captain Steve Smith. Smith was dismissed on 93 when James Anderson trapped him in front LBW. His dismissal came after Worland committed the cardinal sin of declaring Smith was certain to go on and reach the century. Worland was immediately called out for his faux pas when he made his remarks on Triple M radio. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. “Dan Ginnane’s gonna call Steve Smith’s century in the next 20 minutes,” Worland said of his Triple M colleague. His comments prompted a bitter response from Ginnane, who was inside the commentary box, but was not even near a microphone. “Oh, don’t jinx it,” he could be heard saying. You’re better than that Gus. Source: News Corp Australia Steve Smith’s luck ran out on 93. Photo by Quinn Rooney/Getty Images. Source: Getty Images Worland responded: “I’m not going to jinx it. Steve Smith is going to get his hundred and you’re going to call it”. He turned out to be very wrong. “If this is out put Worland on the first plane back to Sydney,” Ginnane said as Smith was removed. Later in the day, Worland made a grovelling return to the microphone. “I’d like to apologise formally on national radio,” he said. “I apologise for getting Steve Smith out. I’m a fool. I’m an idiot. And please forgive me Australia.”","image_url":null,"source_id":"foxsports"},{"title":"England great cries foul over Ashes 'nonsense'","link":"https://wwos.nine.com.au/cricket/ashes-2021-kevin-pietersen-criticises-australian-conditions-as-england-fall-further-behind-in-second-test/b6a0180c-3a1f-412b-81b5-c7cfa103fe36","keywords":null,"creator":["wwos"],"video_url":null,"description":"Kevin Pietersen was quick to criticise the conditions in Australia as his old side slumped their way to a sorry end on day two.","content":"Former England batter Kevin Pietersen was quick to criticise the conditions in Australia as his old side slumped their way a sorry end on day two at the Adelaide Oval.As the weather forced players from the field, England were looking down the barrel of another huge task, ending the day 2-17 after Australia declared on 473.The oft-opinionated Pietersen was quick to blame factors beyond the quality of play.AS IT HAPPENED: Australia stamp authority on day twoREAD MORE: Weather gives England reprieve after horror dayREAD MORE: Chappelli blasts English selectors after tough day\"Foolish to even think England were going to properly compete in this Ashes with everything else that's happening off the field,\" he said on Twitter, presumably referencing the quarantine measures that he'd previously criticised.\"Much easier for Aus at HOME! \"Way harder for ENG with all the nonsense that's happening here!\"https://twitter.com/KP24/status/1471791942488965123The claim seems particularly disputable when you consider that it was Australia who were without their captain, Pat Cummins, due to being a close contact of someone in a restaurant who tested positive for COVID-19.On BT Sport's Ashes coverage, Matt Prior and Sir Alastair Cook broke down how different batters use different mental milestones to dig in and get through long days out in the middle — a mindset England could sorely do with right now.\"The England cricket team tomorrow won't turn up and go 'right, we've got to bat 130 overs.' It's about how you break that down into session-by-session,\" Prior said.He spoke about checking off getting through the first few overs, then setting the next point at drinks, and so on.\"When I batted with Ian Bell, we always worked in five overs. So you'd come up and let's say there's 25 overs bowled or 75 overs bowled it's 'right, let's get to 80. We've got to get to 80 overs'.\"\"And when you get to 80 overs, start again, let's get to 85. And that's how you sort of break down these big targets that look a bit daunting at times, make them really small and achievable.\"Cook said that his old batting partner Andrew Strauss was all about tackling things in five-run blocks. But whatever the technique, struggling opener Rory Burns probably needs a new one.Burns was once again dismissed cheaply, Mitchell Starc getting him in the third over of the innings.On BT's daily Ashes podcast, Burns found a rare defender in England international Kate Cross.\"What's brilliant about a five-Test series, you've got the opportunity to try and get people out, and work them out and rough batters up, but you've also got the batters trying to counter that,\" she said.\"Burns' character will come from how he plays the next couple of games and innings.\"If he can come back and get through that first ball period and start scoring some runs then suddenly it could look completely different for England.\"In his column in The Times, former captain Mike Atherton said there was an air of inevitability about the dismissal.\"Standing at the non-striker's end for the first ball of the match, to delay his date with Mitchell Starc, Rory Burns pinged his second ball from the left-armer to the square-leg fence, but edged his third to slip, having been squared up on the back foot,\" he wrote.\"It was a good ball to get early in an innings, but Burns has suffered a torrid start against Starc and is facing a long tour.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-17 20:01:44","full_description":"Former England batter Kevin Pietersen was quick to criticise the conditions in Australia as his old side slumped their way a sorry end on day two at the Adelaide Oval. As the weather forced players from the field, England were looking down the barrel of another huge task, ending the day 2-17 after Australia declared on 473. The oft-opinionated Pietersen was quick to blame factors beyond the quality of play. AS IT HAPPENED: Australia stamp authority on day two READ MORE: Weather gives England reprieve after horror day READ MORE: Chappelli blasts English selectors after tough day \"Foolish to even think England were going to properly compete in this Ashes with everything else that's happening off the field,\" he said on Twitter, presumably referencing the quarantine measures that he'd previously criticised . \"Much easier for Aus at HOME! \"Way harder for ENG with all the nonsense that's happening here!\" The claim seems particularly disputable when you consider that it was Australia who were without their captain, Pat Cummins, due to being a close contact of someone in a restaurant who tested positive for COVID-19 . On BT Sport's Ashes coverage, Matt Prior and Sir Alastair Cook broke down how different batters use different mental milestones to dig in and get through long days out in the middle — a mindset England could sorely do with right now. \"The England cricket team tomorrow won't turn up and go 'right, we've got to bat 130 overs.' It's about how you break that down into session-by-session,\" Prior said. He spoke about checking off getting through the first few overs, then setting the next point at drinks, and so on. \"When I batted with Ian Bell, we always worked in five overs. So you'd come up and let's say there's 25 overs bowled or 75 overs bowled it's 'right, let's get to 80. We've got to get to 80 overs'.\" \"And when you get to 80 overs, start again, let's get to 85. And that's how you sort of break down these big targets that look a bit daunting at times, make them really small and achievable.\" Cook said that his old batting partner Andrew Strauss was all about tackling things in five-run blocks. But whatever the technique, struggling opener Rory Burns probably needs a new one. Burns was once again dismissed cheaply, Mitchell Starc getting him in the third over of the innings. On BT's daily Ashes podcast, Burns found a rare defender in England international Kate Cross. \"What's brilliant about a five-Test series, you've got the opportunity to try and get people out, and work them out and rough batters up, but you've also got the batters trying to counter that,\" she said. \"Burns' character will come from how he plays the next couple of games and innings. \"If he can come back and get through that first ball period and start scoring some runs then suddenly it could look completely different for England.\" In his column in The Times , former captain Mike Atherton said there was an air of inevitability about the dismissal. \"Standing at the non-striker's end for the first ball of the match, to delay his date with Mitchell Starc, Rory Burns pinged his second ball from the left-armer to the square-leg fence, but edged his third to slip, having been squared up on the back foot,\" he wrote. \"It was a good ball to get early in an innings, but Burns has suffered a torrid start against Starc and is facing a long tour.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/399646/pickerimage.jpg","source_id":"nine"},{"title":"CH-W vs OS-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Hallyburton Johnstone Shield, Match 8","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ch-w-vs-os-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-hallyburton-johnstone-shield-match-8?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-17 19:26:23","full_description":"Central Hinds Women will be up against Otago Sparks Women in the eighth match of the Women’s Super Smash T20 2021-22 on December 18 at McLean Park in Napier. Central Hinds Women haven't lived up to their potential and are currently fifth with three defeats in as many games. They went down against Canterbury Magicians in their previous match and will now look to make a strong comeback. The Otago Sparks, on the other hand, are looking great this season and have topped the Women’s Super Smash T20 points table with three wins from as many games. They come into this match on the back of a victory over the Northern Braves and will now aim to maintain their winning momentum. Central Hinds Women Natalie Dodd (WK), Emily Cunningham (C), Jess Watkins (C), Ocean Bartlett, Kerry-Anne Tomlinson, Rosemary Mair, Mikaela Greig, Georgia Atkinson, Melissa Hansen, Hannah Rowe, Claudia Green Otago Sparks Women Emma Black, Caitlin Blakely, Eden Carson, Suzie Bates (C), Katey Martin (WK), Molly Loe, Polly Inglis, Bella James, Marina Lamplough, Sophie Oldershaw, Kate Ebrahim Match : Central Hinds Women vs Otago Sparks Women, Women’s Super Smash T20 Date and Time: 18th December, 03.40 AM IST Venue : McLean Park, Napier The surface at McLean Park is kind of a balanced one. Pacers should try to capitalize on the initial movement whereas the batters would find it easy to score as the game progresses. A total of around 160 could prove to be challenging at this venue. Wicketkeeper Natalie Dodd: Natalie has scored 85 runs with a decent average of 28.33 in three games. She will be a safe option for the wicket-keeper position. Batters Suzie Bates: Suzie is one of the finest T20 batters. She has scored 156 runs in the last three games and is currently the top-scorer of the tournament. Mikaela Greig: Mikaela has been a reliable batter for the Hinds and has the ability to give a quick start to her side. All-rounders Kate Ebrahim: Kate has been a standout performer for the Sparks this season. She has scored 54 runs with the bat and also has three wickets to her name which makes her a top-pick for today’s game. Jess Watkin: Jess has made significant contributions to both aspects of the game, scoring 41 runs and also chipping in with three wickets in this tournament. Bowlers Sophie Oldershaw: Sophie has been the leading wicket-taking bowler for the Sparks Women. She has grabbed five wickets in three games and is expected to add more to her kitty. Claudia Green: Claudia would be a wise option for today’s match. She has scalped three wickets so far in this league and will be aiming to pick up a few more today. Suzie Bates: 227 points Sophie Oldershaw: 179 points Kate Ebrahim: 175 points Jess Watkin: 161 points Natalie Dodd: 127 points Suzie Bates: 3 matches, 155 runs Sophie Oldershaw: 3 matches, 5 wickets Kate Ebrahim: 3 matches, 54 runs, 3 wickets Jess Watkin: 3 matches, 41 runs, 3 wickets Emma Black: 3 matches, 3 wickets Fantasy Suggestion #1 : Katey Martin, Natalie Dodd, Polly Inglis, Suzie Bates, Mikaela Greig, Georgia Atkinson, Kate Ebrahim, Jess Watkin, Rosemary Mair, Claudia Green, Sophie Oldershaw Captain: Kate Ebrahim Vice-Captain: Natalie Dodd Fantasy Suggestion #2 : Katey Martin, Natalie Dodd, Suzie Bates, Caitlin Blakely, Mikaela Greig, Eden Carson, Kate Ebrahim, Jess Watkin, Emma Black, Claudia Green, Sophie Oldershaw Captain: Jess Watkin Vice-Captain: Suzie Bates","image_url":"https://static.sportskeeda.com/editor/2021/12/72d0b-16397669279429-1920.jpg","source_id":"sportskeeda"},{"title":"Ashes 2021: Australia vs England: Second Test updates, stats, stream, start time, how to watch, Live cricket scores, Joe Root, Steve Smith","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2021-australia-vs-england-second-test-updates-stats-stream-start-time-how-to-watch-live-cricket-scores-joe-root-steve-smith/news-story/0404ab53073a6a9a1397e9aaec2a1b1d","keywords":null,"creator":null,"video_url":null,"description":"England will resume their first innings on day three of the Adelaide Test 456 runs behind Australia with Joe Root needing a huge score to keep the Ashes series alive.","content":null,"pubDate":"2021-12-17 19:00:00","full_description":"England will resume their first innings on day three of the Adelaide Test 456 runs behind Australia with Joe Root needing a huge score to keep the Ashes series alive. The tourists will resume on 2-17 on day three at the Adelaide Oval, with Root (5*) and Dawid Malan (1*) at the crease with 8.4 overs bowled in their first dig. The pair will need a repeat of their partnership in Brisbane and then some if England are to dig themselves out of an almighty hole after Australia declared their first innings at 9-473. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . Ashes legend Michael Vaughan blasted England for failing to get anything right so far on what is fast becoming a nightmare tour down under for the ages. “12 for 2 and the skipper has to walk out again far too early. Pretty much every aspect of this Test team isn’t working so far on this tour, but let’s be honest it’s been the same story for a long time against the better teams,” Vaughan tweeted. England could have been in even more trouble heading into day three with wild weather causing play to be abandoned early. MORE CRICKET NEWS TALKING POINTS: Ashes rests on captain’s bat after England pushed to boiling point LIGHTNING STRIKES: Wild storm saves Poms from total implosion on horror day as Aussie stuns on debut WEAKNESS: England just exposed a flaw in Aussie cricket’s golden boy... and it’s left Marsh ‘lurking’ ‘CAN’T MAKE IT UP’: Marnus ‘madness’ as Aussie star’s absolute ‘stinker’ ignites bonkers Day 2 Another 90! Smith falls short of 100 | 02:28 Debutant Michael Neser and recalled paceman Jhye Richardson were starting to get some real movement late on day two and will back themselves to pick up where they left off. So too will the leader of the attack Mitchell Starc, who had his bunny Rory Burns caught in the slips late in the final session of the second day. NEW FOLLOW ON PODCAST - Crash Craddock: Brisbane fallout, Adelaide preview. LISTEN ON SPOTIFY OR SUBSCRIBE IN ITUNES Neser picked up his first Test scalp when Haseeb Hameed chipped one to Starc at short mid-on. Kerry O’Keeffe believes it is up to Joe Root and Dawid Malan to save England’s chances of making this Ashes series competitive when they resume on a crucial day for the tourists. “The Ashes is at stake tomorrow guys, and it’s on the bat of Root and Malan,” O’Keeffe said on Fox Cricket. “The fighters. Can they ton up? They have to.” Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now!!! Marnus' INSANE run of luck finally ends | 01:22 TEAMS Australia XI: David Warner, Marcus Harris, Marnus Labuschagne, Steve Smith (c), Travis Head, Cameron Green, Alex Carey, Michael Neser, Mitchell Starc, Nathan Lyon, Jhye Richardson England XI: Haseeb Hameed, Rory Burns, Dawid Malan, Joe Root (c), Ben Stokes, Ollie Pope, Jos Buttler, Chris Woakes, Ollie Robinson, Stuart Broad, James Anderson FOLLOW THE ACTION IN OUR LIVE BLOG BELOW. CAN’T SEE IT? CLICK HERE .","image_url":null,"source_id":"foxsports"},{"title":"Former South Africa captain Smith rejects charges of racism","link":"https://sportstar.thehindu.com/cricket/graeme-smith-rejects-racism-charges-cricket-south-africa-csa/article37981460.ece","keywords":null,"creator":["AFP"],"video_url":null,"description":"Graeme Smith, South Africa's director of cricket and former Test captain, has hit back through his lawyer at accusations of racial prejudice contained in a report by an ombudsman.","content":null,"pubDate":"2021-12-17 18:36:22","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Steve Smith’s latest knock a reminder of what could have been for Australia | Geoff Lemon","link":"https://www.theguardian.com/sport/2021/dec/17/cricket-ashes-steve-smith-australia-potential","keywords":["Ashes 2021-22","The Ashes","Australia cricket team","Australia sport","Cricket","England cricket team","Sport","Steve Smith"],"creator":["Geoff Lemon at Adelaide Oval"],"video_url":null,"description":"Thanks to a combination of scandal, the pandemic and a reduced touring programme, Smith has an aura of lost potentialIn 2017, Steve Smith began what can now be mapped as his highest batting peak. Three centuries in four Tests while leading a tour of India, a feat no visiting captain has bettered, while holding his team in the series until a final defeat 2-1. Then home for an Ashes series that he opened with a match-winning hundred at Brisbane, followed with a double in Perth, and sealed with a hundred in Sydney, winning 4-0 with 687 runs at an average of over 137. Three months later came the Cape Town sandpaper affair, and his year-long ban ended up being an absence from Test cricket of 16 months.What has happened since has been the waste of Smith, the squandering by Cricket Australia of their most extraordinary batting talent since Don Bradman. Continue reading...","content":null,"pubDate":"2021-12-17 16:57:10","full_description":"I n 2017, Steve Smith began what can now be mapped as his highest batting peak. Three centuries in four Tests while leading a tour of India, a feat no visiting captain has bettered, while holding his team in the series until a final defeat 2-1. Then home for an Ashes series that he opened with a match-winning hundred at Brisbane, followed with a double in Perth, and sealed with a hundred in Sydney, winning 4-0 with 687 runs at an average of over 137. Three months later came the Cape Town sandpaper affair , and his year-long ban ended up being an absence from Test cricket of 16 months. What has happened since has been the waste of Smith, the squandering by Cricket Australia of their most extraordinary batting talent since Don Bradman. On his return from the ban in 2019 , he managed four Tests in England for the Ashes and five in the home summer. Then the world galloped into the pandemic era, and cricket in some countries shut down. Smith had a break of nearly a year – the same stretch as the ban that had once seemed so onerous – before CA deigned to host India for four Tests in 2020-21. Then another year of waiting before this home season began. The pandemic itself is a smokescreen here. Australia cancelled two Test tours in that time: two matches in Bangladesh and three in South Africa. This was already baked into the proposed touring programme by an administration that wanted to reduce the Test footprint, pulling back home seasons to five matches instead of six, and keeping overseas trips minimal. While England had plans to play 12, 15, even 17 Tests in a year, Australia’s schedule was for seven or eight. It was and remains an astounding approach to the game for an administration that already knew it had one of the game’s greats in its ranks. From his breakthrough Ashes in 2013, four and a bit years at the crease brought Smith 57 matches and 23 Test centuries. From his ban in 2018 until the start of the current Ashes, nearly four years has meant 13 matches and four centuries. Four years ago, Smith looked a certainty to surge past Ricky Ponting’s 41 centuries at the top of the Australian tree. Now, he remains on 27, exceptional but still short of what his talent could have achieved. For a while on the second day of the Adelaide Test, Smith was back exactly where he should be. In the middle of a Test match on a baking hot day, fighting for ascendancy in a match where his performance would be central to Australia’s hopes. It was a situation favouring Australia, with Smith resuming on 18 with the score at 221 for two. But the work still had to be done, and after a morning session in which England finally held catches, bowled legal deliveries, and took three for 90, the work fell to Smith. In contrast to Marnus Labuschagne’s 103, which got more scrappy as it went on, and which ended soon after the start of play after a series of reprieves, Smith’s 93 did not offer a chance until his dismissal. The closest England came were a couple of edges that were bounced into the slip cordon from soft hands. Through the rest of 200 deliveries until Jimmy Anderson trapped him leg before, Smith was in total control. The most prominent part of his game was his leaving, knowing that the thermometer was past 37 degrees and that England’s bowlers were suffering through every over. Anything that Smith did not like was ignored, as he stepped across his stumps to inspect balls travelling by to the wicketkeeper. Anything that looked useful he would knock into a gap of his choosing. Occasionally, when he did fancy something more than most others, he would play a shot that was audacious either for its conventionality or the absence of it. Stuart Broad was pulled, Anderson was cut, Joe Root was driven through the covers, as precisely as you like. But equally, when Smith was so minded, he might flap a delivery over slip. With a leg-theory field, he hooked Ben Stokes over the wicketkeeper. One entirely respectable length ball from Chris Woakes was swivel-pulled into the seats of the Max Basheer stand. By the time Smith was done, just before the end of the second session, Australia had 385 on the board, England had bowled 139 overs, and the five hottest sessions of the match had been played out. All that was left was for Australia’s bowlers to bash a few runs, then put England in and take a couple of wickets. The script was duly followed. At the centre of it, as so often in the past, was Steve Smith . The question of whether he should be allowed to captain Australia again remains live, and the doubts on that score have merit. As a pure player though, he was exactly where he should have been, so much more often, through years that have now been lost.","image_url":"https://i.guim.co.uk/img/media/e4344f76532cec1bf29bbe250fbc509f92b6515b/0_185_4522_2714/master/4522.jpg?width=460&quality=85&auto=format&fit=max&s=b8d940856578a2082b384a1b42a43591","source_id":"theguardian"},{"title":"Support for Virat Kohli floods Twitter after Sourav Ganguly’s ‘leave it to BCCI’ statement - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3RyZW5kaW5nLW5ld3Mvc3Rvcnkvc3VwcG9ydC1mb3ItdmlyYXQta29obGktZmxvb2RzLXR3aXR0ZXItYWZ0ZXItc291cmF2LWdhbmd1bHktcy1sZWF2ZS1pdC10by1iY2NpLXN0YXRlbWVudC0xODg5MTUwLTIwMjEtMTItMTfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Support for Virat Kohli floods Twitter after Sourav Ganguly’s ‘leave it to BCCI’ statement  India TodayBCCI Vs Virat Kohli | Whoever wins, Indian cricket will be the loser  Moneycontrol.comVirat vs BCCI: We'll deal with it, says Ganguly  Times of IndiaShame that even Ganguly cannot change BCCI's ways  Deccan HeraldIt`s absolutely ridiculous! When Virat Kohli rubbished rumours of rift between him and Rohit Sharma  WIONView Full coverage on Google News","content":null,"pubDate":"2021-12-17 16:29:35","image_url":null,"source_id":"google"},{"title":"Rohit Sharma speaks to India U-19 team, BCCI chief selector Chetan Sharma reacts","link":"https://zeenews.india.com/cricket/rohit-sharma-speaks-to-india-u-19-team-bcci-chief-selector-chetan-sharma-reacts-2420330.html","keywords":null,"creator":null,"video_url":null,"description":"Team India white-ball captain Rohit Sharma on Friday addressed India`s U-19 team during their preparatory camp at the National Cricket Academy (NCA) in Bengaluru.","content":null,"pubDate":"2021-12-17 15:52:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Ex-South Africa Captain Graeme Smith Rejects Charges Of Racism","link":"https://sports.ndtv.com/cricket/ex-south-africa-captain-graeme-smith-rejects-charges-of-racism-2657435","keywords":null,"creator":null,"video_url":null,"description":"Graeme Smith, South Africa's director of cricket and former Test captain, has hit back through his lawyer at accusations of racial prejudice contained in a report by an ombudsman.","content":null,"pubDate":"2021-12-17 15:44:15","full_description":"Graeme Smith , South Africa's director of cricket and former Test captain, has hit back through his lawyer at accusations of racial prejudice contained in a report by an ombudsman. David Becker, former I nternational Cricket Council head of legal and Smith's personal lawyer, issued a statement on Friday in which he disputed findings by Advocate Dumisa Ntsebeza, who headed a Social Justice and Nation Building Commission (SJN) to investigate allegations of racial discrimination in South African cricket. In a report issued on Wednesday, Ntsebeza found that Smith \"failed to rebut the presumption of unfair discrimination\" in appointing former Test wicketkeeper and long-time team-mate Boucher as head coach of the national team ahead of Enoch Nkwe, a black coach who served briefly as national team director. \"Some of the findings are entirely questionable and without any basis,\" said Becker, who claimed that lawyers for \"various respondents\" had raised \"material concerns\" about the integrity of the SJN process. \"Important parts of the evidence are simply not dealt with in the report,\" said Becker. \"For example, the ombudsman states that Smith did not explain why he appointed Boucher in his evidence. However, the reasons are clearly addressed by Smith and (former CSA president) Mr (Chris) Nenzani in their affidavits submitted to the SJN.\" Ntsebeza also found that Smith's appointment was irregular and that a refusal to report to then chief executive Thabang Moroe, who was later dismissed for misconduct, was evidence of \"racial bias against black leadership\". Becker pointed out that Smith did not appoint himself and that his appointment was approved by the national selectors, the entire board of CSA and senior executives of the organisation. He had worked happily with Moroe's acting successor, who was black, and three black presidents. Becker did not directly address an accusation of racial bias in the decision when Smith was captain to use star batsman AB de Villiers as wicketkeeper in a Test series in England in 2012, ahead of black reserve wicketkeeper Thami Tsolekile. But Becker said CSA would have to consider \"a number of fundamental flaws\" in the process of the hearings. \"For instance, how do you make far-reaching and public findings of racial prejudice against certain people and in the same breath say that they are 'tentative', as the ombudsman has done? Promoted \"How is CSA expected to implement those findings when the ombudsman has said, by his own admission, that he 'cannot make definitive findings in an instance where the evidence of both the so-called victims and the alleged perpetrators was not tested'? \"Why wasn't the evidence properly tested? The ombudsman had the opportunity to cross examine the witnesses under the terms of reference and didn't take that opportunity,\" said Becker.","image_url":"https://c.ndtvimg.com/2021-01/1vt1u3mo_graeme-smith-twitter_625x300_23_January_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"World Test Championship points table: What is England team position in World Test Championship points table 2021-2023; how many points has England lost till now?","link":"https://thesportsrush.com/cricket-news-world-test-championship-points-table-what-is-england-team-position-in-world-test-championship-points-table-2021-2023-how-many-points-has-england-lost-till-now/","keywords":["Cricket","Ashes 2021-22","England vs Australia","World Test Championship 2021-23"],"creator":["Gurpreet Singh"],"video_url":null,"description":"What is England team position in World Test Championship points table 2021-2023 after being fined for slow over rate in first Ashes Test? The Australian Cricket team is marching forward handsomely and has dominated the Ashes 2021-22 series so far with the second Test underway at The Adelaide Oval. England, on the contrary, after being… The post World Test Championship points table: What is England team position in World Test Championship points table 2021-2023; how many points has England lost till now? appeared first on The SportsRush.","content":"What is England team position in World Test Championship points table 2021-2023 after being fined for slow over rate in first Ashes Test? The Australian Cricket team is marching forward handsomely and has dominated the Ashes 2021-22 series so far with the second Test underway at The Adelaide Oval. England, on the contrary, after being handed a heavy drubbing by the Aussies in the first Test at The Gabba, Brisbane within four days, are yet again forced to play the catch-up game after the Aussies posted 473/9 d in their first innings. With plenty to ponder upon in the ongoing Test already, bruise from The Gabba Test has surfaced yet again. England had not only lost The Gabba Test by 9 wickets, but were also docked with 5 World Test Championship (WTC) points for maintaining a slow Over-rate during the course of the Test. To add to their already existing green woes, the ICC have now stated that England were actually 8 Overs short (instead of 5 Overs initially) and hence would be fined with 3 more WTC points to further slip down on the WTC points table for the 2021-23 cycle. What is England team position in World Test Championship points table 2021-2023? For those unaware, as per the ICC release post the first Ashes Test in Brisbane, a team is fined one point each for an Over short. “As per Article 16.11.2 of the ICC World Test Championship playing conditions, a team is docked one point for each over short,” the ICC release read. The England players were also fined with 100 per cent of their match fees post the slow Over-rate offence. Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel charges players 20% of their match fee for every over the team falls short on. “England were eight overs short (not five overs short as previously announced) but were only fined 100 per cent of their match fee due to the limit. However, the points deduction for penalty overs is not capped and must reflect the actual number of penalty overs a team is short of the minimum requirement as per Clause 16.1.2 of the ICC Playing Conditions, hence they have been penalised one point for each over they were short”, the ICC release read. Thus England, who had slipped down to the 6th position after being docked 5 points initially in the WTC points table, have further slipped one more position down to 7th after losing a total of 10 WTC points for slow Over-rate offence. England and India were docked two points each for the same reason after the first Test at Nottingham during India’s tour to England in August. Things not getting any better for England#AUSvENG #Ashes pic.twitter.com/bUdpY3VmOa — Andrew McGlashan (@andymcg_cricket) December 17, 2021 With one win, three losses and a total of 15 percentage points, England are currently placed at the second-last spot, just above Bangladesh at 8th.       The post World Test Championship points table: What is England team position in World Test Championship points table 2021-2023; how many points has England lost till now? appeared first on The SportsRush.","pubDate":"2021-12-17 15:10:48","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Sachin Tendulkar thanks a traffic cop in a special message, here's WHY","link":"https://zeenews.india.com/cricket/sachin-tendulkar-thanks-a-traffic-cop-in-a-special-message-heres-why-2420313.html","keywords":null,"creator":null,"video_url":null,"description":"Cricket icon Sachin Tendulkar once again showed his human side as he met a traffic cop, who saved his friend after he had met with an accident and also thanked the entire community for going beyond their call of duty.","content":null,"pubDate":"2021-12-17 14:27:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Stokes: England not out of second Test","link":"https://www.skysports.com/cricket/news/12040/12498253/the-ashes-ben-stokes-maintains-belief-that-england-can-come-back-in-second-test-after-dismal-day-two","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes refused to accept England were down and out after a dispiriting day of Ashes cricket in Adelaide.","content":null,"pubDate":"2021-12-17 14:20:00","full_description":"Last Updated: 17/12/21 2:28pm Ben Stokes refused to accept England were down and out after a dispiriting day of Ashes cricket in Adelaide. Stokes' never-say-die attitude and ability to imagine the impossible has served England well over the years, with his Headingley heist against the Australians the most remarkable example. Back then England had plumbed the depths of 67 all out before his unforgettable day-four chase, when he finished 135 not out and put on 76 with No 11 Jack Leach. A turnaround of similar proportions could be required to prevent England going 2-0 down in the coming days, with Australia taking control of the day-night second Test with bat and ball. A century from Marnus Labuschagne, 93 from Steve Smith and some late punishment from the tail saw them declare on 473 for nine, with openers Rory Burns and Haseeb Hameed knocked over under lights. Lightning and rain spared England any further losses but at 17-2 the road back in a long one. \"If you don't believe you're already beaten,\" said the all-rounder, whose words appeared to be aimed as much at fans back home as they were to team-mates in the dressing room. Please use Chrome browser for a more accessible video player \"We've seen a lot of the support we've been getting on social media from everyone back in England and the guys who have been supporting us here in Australia have been absolutely phenomenal. \"It's incredible wherever we go. You hear them even though they're outnumbered and there are people are staying up through the middle of the night to watch us from afar in the bars and stuff. \"That's incredible to see. Obviously the first Test didn't go well and Australia are ahead at the moment but we know back home we'll be getting as much support as we always do and for us it's about letting them know we really appreciate it.\" December 19, 2021, 8:00am Live on Just a few months ago Stokes was not expected to be anywhere near this series, but came back from a mental health break to take his place in the touring party. Asked if it had been a worthwhile decision after six largely punishing days and some long, lean spells in the field he was emphatic. \"Yes. I've loved every minute of it,\" he said. \"If you don't feel sore getting up in the morning, you've probably not done what's required of you. You've just got to love the dirt when you get that deep in the game and understand what you're playing for.\" While player safety protocols dictated the game should end when the lightning bolts started appearing a little too close for comfort, Labuschagne was only thinking about forcing home the Australian advantage. \"I saw a big lightning bolt, almost like a big camera flashing, but I was just hoping we could stay on the field so we could get some more wickets,\" he said. Australia had already guaranteed another difficult day for Burns, who nicked a fine delivery from Mitchell Starc to take his record on tour to 17 runs in three innings, with a grand total of 31 balls faced. \"Starcy is doing a beautiful job of getting Rory out at the minute, it seems that way,\" added Labuschagne. \"We all know Starcy has bowled some really good balls at him and we want to make sure we keep driving forward and putting England under pressure.\"","image_url":"https://e2.365dm.com/21/12/1920x1080/skysports-ap-newsroom-ben-stokes_5618322.jpg?20211217141140","source_id":"skysports"},{"title":"Ashes Stats: Smith's first five; Neser's record debut","link":"https://www.skysports.com/cricket/news/12040/12498080/ashes-stats-steve-smith-makes-first-five-of-his-test-career-to-help-australia-build-big-lead","keywords":null,"creator":null,"video_url":null,"description":"After Australia took control of the second Ashes Test, Sky Cricket number-cruncher Benedict Bermange has all the key stats from day two in Adelaide.","content":null,"pubDate":"2021-12-17 14:11:00","full_description":"Cricket Statistician Last Updated: 17/12/21 2:19pm After Australia took control of the second Ashes Test, Sky Cricket number-cruncher Benedict Bermange has all the key stats from day two in Adelaide. Marnus Labuschagne reached his first Ashes century from 287 balls, the slowest Test century for Australia since Jason Gillespie took 296 balls to get there on his way to his unbeaten 201 against Bangladesh at Chittagong in April 2006. Steve Smith scored his first \"five\" off the 13,893th ball of his Test career. Hashim Amla and Younis Khan each scored six \"fives\" in their Test careers - more than anyone else. Please use Chrome browser for a more accessible video player The last time two Australians made scores in the 90s in the same Test innings was against India at Mohali in March 2013. On that occasion, the two batters were Smith (92) and Mitchell Starc (99). The only previous occasion it had occurred in Ashes cricket was at Brisbane in 2006 when Paul Collingwood made 96 and Kevin Pietersen 92. Michael Neser's strike rate in his innings of 35 was the highest by anyone in the first innings of their Test debut facing at least 20 deliveries. Joe Root took his 12th Test wicket of the year. No-one has ever scored more runs and taken more wickets in the same calendar year than Root's current tallies of 1,544 and 12 respectively. Root's closest rival is Virender Sehwag, who scored 1,462 runs and took 15 wickets in 14 Tests for India in 2008. Only two other players have scored at least 1,000 runs and taken at least 10 wickets while captaining their sides in a calendar year in Test cricket: Bobby Simpson of Australia in 1964 and Angelo Mathews of Sri Lanka in 2014.","image_url":"https://e2.365dm.com/21/12/1920x1080/skysports-steve-smith-cricket_5618296.jpg?20211217135551","source_id":"skysports"},{"title":"Tendulkar thanks traffic cop for going beyond duty and saving his friend","link":"https://www.indiatvnews.com/sports/cricket/tendulkar-thanks-traffic-cop-for-going-beyond-duty-and-saving-his-friend-750081","keywords":null,"creator":null,"video_url":null,"description":"Cricket icon Sachin Tendulkar once again showed his human side as he met a traffic cop, who saved his friend after he had met with an accident and also thanked the entire community for going beyond their call of duty.","content":null,"pubDate":"2021-12-17 14:10:20","full_description":"Cricket icon once again showed his human side as he met a traffic cop, who saved his friend after he had met with an accident and also thanked the entire community for going beyond their call of duty. The legendary right-handed batsman took to Twitter to laud the traffic cops and shared an elaborate note titled \"The world is a beautiful place because of such people...\". \"Few days ago, a close friend met with a serious accident. By God's grace, she is better now. However, it was the timely help from a traffic cop, which made the difference,\" Tendulkar wrote in the note. \"He immediately took her in an auto to a hospital and applied real presence of mind – ensuring her severely damaged spine had minimal movement while travelling,\" added the legendary cricketer, who has numerous world records to his name. Tendulkar said he met the cop, who went beyond his duty and thanked him for his help. \"I met him and thanked him for his help. There are several people like him all around us – who go beyond the call of duty. The world is a beautiful place because of such people. When you see such people, especially those who serve the public, take a moment to thank them. We may not know it, but in their own way, they strive to make a difference in peoples lives. Silently,\" said Tendulkar. The former India opener also lauded the traffic police in general for their efforts and appealed to the public to obey traffic rules. \"To traffic police across India, thank you for your efforts towards ensuring people's safety. To all of us: Let's respect the traffic rules and not take shortcuts. It is not worth saving yourself some time, at the cost of putting someone else's life at risk,\" the master blaster signed off.","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket-Labuschagne plays down batting milestone","link":"https://www.thestar.com.my/sport/cricket/2021/12/17/cricket-labuschagne-plays-down-batting-milestone","keywords":null,"creator":null,"video_url":null,"description":"ADELAIDE (Reuters) - Australia run-machine Marnus Labuschagne enjoys winning games for his team more than any personal milestone, the 27-year-old said after his sixth test century consolidated their position in the second Ashes test against England on Friday. Read full story","content":null,"pubDate":"2021-12-17 13:37:00","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/17/1410767.jpg","source_id":"thestar_my"},{"title":"Rohit gives pep talk to India U-19 squad as he undergoes rehab at NCA","link":"https://www.indiatvnews.com/sports/cricket/rohit-gives-pep-talk-to-india-u-19-squad-as-he-undergoes-rehab-at-nca-750077","keywords":null,"creator":null,"video_url":null,"description":"The India U-19 squad on Friday got some \"priceless lessons\" from Rohit Sharma at the National Cricket Academy where the senior team's white-ball skipper is undergoing injury rehabilitation alongside teammate Ravindra Jadeja.","content":null,"pubDate":"2021-12-17 13:32:40","full_description":"The India U-19 squad on Friday got some \"priceless lessons\" from at the National Cricket Academy where the senior team's white-ball skipper is undergoing injury rehabilitation alongside teammate . Rohit, who has been ruled out of the upcoming Test series in South Africa due to a hamstring injury, gave a pep talk to the U-19 boys ahead of the Asian Cup beginning December 23 in the UAE. Rohit and Jadeja were seen at the NCA with India U-19 captain Yash Dhull in his social media posts. The BCCI also tweeted pictures of Rohit's session with the squad. Rohit himself played at U-19 level back in 2006. \"TeamIndia white-ball captain @ImRo45 made most of his rehab time as he addressed India’s U19 team during their preparatory camp at the NCA in Bengaluru,\" wrote BCCI. Rohit, who was named ODI captain last week replacing , was to travel to South Africa as vice-captain of the Test team for the series starting on December 26 before the injury ruled him out of the red ball leg of the tour. His expected recovery time is between three to four weeks. India 'A' captain Priyank Panchal was named in place of Rohit in the Test squad, which reached South Africa on Thursday for the series. The senior opener, who took charge as T20I captain against New Zealand last month, is expected to be available to lead the team for the ODI leg of the South Africa tour, which is to take place in January. Jadeja has been ruled out of the South Africa tour due to a knee injury which he sustained during the home New Zealand Test series last month. He may take a longer time to recover from his injury.","image_url":null,"source_id":"indiatvnews"},{"title":"Rohit Sharma Gives \"Priceless Lessons\" To India U19 Cricketers. See Pics","link":"https://sports.ndtv.com/cricket/rohit-sharma-gives-priceless-lessons-to-india-u19-cricketers-at-the-nca-in-bengaluru-see-pics-2657061","keywords":null,"creator":null,"video_url":null,"description":"Taking to their Twitter, the Board of Control for Cricket in India (BCCI) shared some pictures from the NCA with Rohit Sharma interacting with India U19 players.","content":null,"pubDate":"2021-12-17 13:14:48","full_description":"Newly-appointed India ODI and T20I captain Rohit Sharma spent some quality time with India's U19 cricketers at the National Cricket Academy in Bengaluru. The opening batter who is currently undergoing a rehab at the NCA for a hamstring injury, addressed India's junior cricketers, who are attending a preparatory camp at the academy. Taking to their Twitter, the Board of Control for Cricket in India (BCCI) shared some pictures from the NCA with Rohit interacting with the young players. \"Priceless lessons #TeamIndia white-ball captain @ImRo45, made most of his rehab time as he addressed India's U19 team during their preparatory camp at the NCA in Bengaluru,\" tweeted BCCI. Priceless lessons 👍 👍 📸 📸 #TeamIndia white-ball captain @ImRo45 made most of his rehab time as he addressed India's U19 team during their preparatory camp at the NCA in Bengaluru. pic.twitter.com/TGfVVPeOli India U19 cricketer Yash Dhull had earlier shared a photograph with Rohit. Rohit was ruled out of the three-match Test series in South Africa with a hamstring injury. He was replaced in the squad by Priyank Panchal, who was already in South Africa as part of the India A squad. Rohit has been appointed as India's full-time white-ball captain. On the other hand, Virat Kohli-led Indian red-ball squad is in Johannesburg, South Africa to lock horns with Proteas in the three-match Test series. Promoted India and South Africa will lock horns in the Test series which gets underway from December 26. (With ANI inputs)","image_url":"https://c.ndtvimg.com/2021-12/m0ie0e8o_rohit-u19_120x90_17_December_21.jpg","source_id":"ndtv"},{"title":"Rohit masterclass for India’s U-19 cricketers ahead of Asia Cup","link":"https://sportstar.thehindu.com/cricket/rohit-sharma-india-u-19-team-under-19-asia-cup-indian-cricket-team-south-africa-bcci/article37978776.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Rohit Sharma, who is currently undergoing a rehab programme at the National Cricket Academy, had a session with India's Asia Cup-bound U-19 players.","content":null,"pubDate":"2021-12-17 13:05:53","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Vinod Kambli Shares Throwback Photo Featuring Sachin Tendulkar. See Pic","link":"https://sports.ndtv.com/cricket/vinod-kambli-shares-throwback-photo-featuring-sachin-tendulkar-see-pic-2657039","keywords":null,"creator":null,"video_url":null,"description":"Former India cricketer Vinod Kambli on Friday took to social media platform Koo to share an old picture featuring his close friend, cricket great Sachin Tendulkar.","content":null,"pubDate":"2021-12-17 13:03:04","full_description":"Former India cricketer Vinod Kambli on Friday took to social media platform Koo to share an old picture featuring his close friend, cricket great Sachin Tendulkar . The picture also features two other cricketers. \"Bane chahe dushman zamana hamara salamat rahe dostana hamara (even if the world becomes our enemy, may our friendship remain intact),\" Kambli wrote in the text accompanying the picture on Koo. Kambli and Tendulkar are childhood friends and were teammates in their school, state as well as the Indian national team. The duo had shot to fame as students after an astonishing 664-run unbroken partnership in a school cricket game in 1998. Kambli scored 349 not out while Tendulkar made 326 not out in a Harris Shield semi-final match. While Tendulkar went on to become one of the greatest cricketers of all time, Kambli's international career never quite took off despite a blistering start. The cricketer from Mumbai played 17 Tests and 104 Tests for India and scored over 3500 runs across both formats. In Tests, Kambli would finish with an incredible average of 54.20 despite not featuring in the team after his 17th appearance. Meanwhile, a recent survey conducted by YouGov, an internet-based market research and data analytics firm, adjudged Tendulkar as the 12th \"Most Admired Man\". This year's study surveyed more than 42,000 people in 38 countries and territories to compile the list. Among sporting heroes, Tendulkar is third in the list behind Lionel Messi and Cristiano Ronaldo. Promoted In the list, the iconic batter is ahead of former US president Donald Trump, Bollywood superstars Shah Rukh Khan, Amitabh Bachchan and also present India captain Virat Kohli. (With PTI inputs)","image_url":"https://c.ndtvimg.com/2021-12/u5fdc0o_vinod-kambli-sachin-tendulkar-afp_625x300_17_December_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"'I never really felt in' despite century: Marnus | Men's Ashes 2021-22 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9WHJxQ04tckZxeFnSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'I never really felt in' despite century: Marnus | Men's Ashes 2021-22  cricket.com.au‘No obvious weakness’: Mindblowing stats prove Australia has its ‘perfect No.3’  Fox SportsMarnus Labuschagne betters Don Bradman in historic Test cricket feat  Yahoo Sport AustraliaThe Ashes 2021: Marnus Labuschagne's rollercoaster, charmed innings finally ends on 103  Wide World of SportsExtraordinary stats that rank insatiable century-maker Marnus among best of all time  The RoarView Full coverage on Google News","content":null,"pubDate":"2021-12-17 12:36:29","image_url":null,"source_id":"google"},{"title":"“Incredibly excited”: Andy Flower expresses excitement on becoming Lucknow IPL team head coach for IPL 2022","link":"https://thesportsrush.com/cricket-news-incredibly-excited-andy-flower-expresses-excitement-on-becoming-lucknow-ipl-team-head-coach-for-ipl-2022/","keywords":["Cricket","IPL 2022","Andy Flower","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Andy Flower: The former Zimbabwean captain will be playing the role of a head coach for the first time in the Indian Premier League. Former Zimbabwe captain Andy Flower has been appointed as the head coach of Lucknow’s untitled Indian Premier League franchise for the 15th season of the biggest T20 tournament. Readers must note… The post “Incredibly excited”: Andy Flower expresses excitement on becoming Lucknow IPL team head coach for IPL 2022 appeared first on The SportsRush.","content":"Andy Flower: The former Zimbabwean captain will be playing the role of a head coach for the first time in the Indian Premier League. Former Zimbabwe captain Andy Flower has been appointed as the head coach of Lucknow’s untitled Indian Premier League franchise for the 15th season of the biggest T20 tournament. Readers must note that Indian business conglomerate RPSG (RP Sanjiv Goenka Group) had acquired the rights of the Lucknow franchise for a whopping INR 7,090 crore earlier this year. While RPSG Group took to social media platform Twitter to confirm Flower’s appointment, the same had been doing the rounds in the Indian media for a couple of weeks now. Flower, whose biggest flex in a coaching capacity doubtlessly comes on the back of more than a decade-long association with England men’s cricket team, has most recently coached Multan Sultans (title victory) and St Lucia Kings (runners-up) in Pakistan Super League and Caribbean Premier League respectively. Punjab Kings, who have the same owners as St Lucia Kings in the CPL, had hired Flower for a couple of seasons; although as an assistant coach. If reports are to be believed, Lucknow are also highly likely to rope in India wicket-keeper batter Lokesh Rahul as their captain for IPL 2022. With Rahul and Flower having already worked together at Punjab, the same might not be a bad idea for a new IPL franchise. Andy Flower expresses excitement on becoming Lucknow IPL team head coach for IPL 2022 “As a player and a coach, Andy has left an indelible mark in the history of cricket. We respect his professionalism and hope he will work with out vision and add value to our team,” RPSG chairman Dr. Sanjiv Goenka said in an official statement. ALSO READ: Will Ravi Shastri be the head coach of Ahmedabad team in IPL 2022? “I am incredible excited to be joining the new IPL franchise and I am very grateful for the opportunity. The passion for cricket in India is unrivaled and it is a real privilege to lead an IPL franchise and I am looking forward with working closely with Dr. Goenka and the Lucknow team,” Flower said in an official statement. Former Zimbabwe captain and wicketkeeper Andy Flower will coach IPL’s Lucknow franchise. Dr Sanjiv Goenka, Owner, Lucknow IPL team welcomed Andy to the RPSG family.#IndianPremierLeague #LucknowIPL #LucknowIPLTeam #Cricket #AndyFlower @IPL pic.twitter.com/RwTeony9ym — RP Sanjiv Goenka Group (@rpsggroup) December 17, 2021 Flower, 53, is the highest run-scorer for Zimbabwe amassing 11,580 runs with the help of 16 centuries and 82 half-centuries in 276 matches across formats between 1992-2003. The post “Incredibly excited”: Andy Flower expresses excitement on becoming Lucknow IPL team head coach for IPL 2022 appeared first on The SportsRush.","pubDate":"2021-12-17 12:04:29","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Yes Nes! Cricket world loses it as debutant delivers ‘feel-good moment of the summer’ - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMitwFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvdGhlLWFzaGVzL2FzaGVzLTIwMjEtbWljaGFlbC1uZXNlci1maXJzdC10ZXN0LXdpY2tldC12aWRlby1hdXN0cmFsaWEtdnMtZW5nbGFuZC1hZGVsYWlkZS1zdGF0cy10d2l0dGVyL25ld3Mtc3RvcnkvOGM5OWU1Zjc1MjI3Njk1ZDUxMWY1MzQzNDM0MmFhOTLSAbcBaHR0cHM6Ly93d3cuZm94c3BvcnRzLmNvbS5hdS9jcmlja2V0L3RoZS1hc2hlcy9hc2hlcy0yMDIxLW1pY2hhZWwtbmVzZXItZmlyc3QtdGVzdC13aWNrZXQtdmlkZW8tYXVzdHJhbGlhLXZzLWVuZ2xhbmQtYWRlbGFpZGUtc3RhdHMtdHdpdHRlci9uZXdzLXN0b3J5LzhjOTllNWY3NTIyNzY5NWQ1MTFmNTM0MzQzNDJhYTky?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Yes Nes! Cricket world loses it as debutant delivers ‘feel-good moment of the summer’  Fox Sports\"Blewy's Out the Door!\" | Andy Lee Names His Commentator's XI  Triple MNeser's debut a peak 2021 Baggy Green  7NEWSNeser bags FIRST wicket with 2nd ball!  Fox SportsOur Call Of Michael Neser's First Test Wicket  Triple MView Full coverage on Google News","content":null,"pubDate":"2021-12-17 11:44:00","image_url":null,"source_id":"google"},{"title":"Yes Nes! Cricket world loses it as debutant delivers ‘feel-good moment of the summer’","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2021-michael-neser-first-test-wicket-video-australia-vs-england-adelaide-stats-twitter/news-story/8c99e5f75227695d511f53434342aa92","keywords":null,"creator":null,"video_url":null,"description":"Michael Neser took just two balls to claim his first Test wicket amid wild scenes at Adelaide Oval on Friday.","content":null,"pubDate":"2021-12-17 11:44:00","full_description":"Michael Neser took just two balls to claim his first Test wicket amid wild scenes at Adelaide Oval on Friday. The 31-year-old – who has been 12th man several times in his career – was called up to Australia’s XI for the second Ashes Test at the last minute after Pat Cummins was deemed a close contact of a Covid case. In keeping with his career to date, Neser was forced to wait some more as Australia batted for more than 150 overs having won the toss. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. Even when Neser was tossed the ball for the seventh over of England’s innings, he was made to wait again with England’s Haseeb Hameed backing away at the last moment. Eventually, Neser bowled his first ball in Test cricket – reward for his persistence and years of hard graft in the Sheffield Shield. The next ball, he had the ultimate reward. Hameed chipped straight to the fielder at mid-on – and the sense of occasion wasn’t lost on Neser’s teammates who celebrated wildly with the seamer. “What a brilliant moment. Even the water boys are embracing him. That was a special time for Slick Mick,” Kerry O’Keeffe said in commentary. Michael Neser of Australia celebrates with teammates. Picture: Daniel Kalisz Source: Getty Images “When you do your time as Neser has done, and you wait for your chance, it’s a dream to get it in your first over and that was the exaltation that everyone shared with him. “He had done the yards, been 12th man, by chance the captain was at a restaurant where there was a Covid positive. (Jhye) Richardson was promoted ahead of him. Everything said he’s not going to play, and suddenly he struck in his first over.” After his over, Michael Neser copped a hero’s welcome from The Ritchies. Picture: Quinn Rooney Source: Getty Images Teammate Marnus Labuschagne was thrilled for Neser. “I think Mitchell Swepson got to the huddle before some of the people on the field,” Labuschagne joked after play. “We were all so happy for him. What he’s done in the past four years in Shield cricket, he’s just worked hard – obviously I’ve spent a lot of time with him. “We’re, very, very good mates and it’s just so exciting to see him take that first one, which can be the toughest one.”","image_url":null,"source_id":"foxsports"},{"title":"Lightning strikes give England Ashes respite as Australia take control again","link":"https://www.theguardian.com/sport/2021/dec/17/lightning-strikes-england-australia-ashes-control-adelaide-day-two","keywords":["Ashes 2021-22","The Ashes","England cricket team","Australia cricket team","Cricket","Sport","Australia sport"],"creator":["PA Media"],"video_url":null,"description":"Day two: Australia 473-9 dec; England 17-2Play abandoned due to storm after England lose early wicketsEngland endured a torrid second day in Adelaide as Australia bullied their bowlers and feasted on their openers to put themselves firmly on course for a 2-0 Ashes lead. If the opening day of this day/night second Test was chastening, with England scraping together only two wickets in three full sessions, then what followed here was even worse. There were bruising moments individually and collectively and the nagging sense that after only six days of cricket, this could be a tour that slides off the rails.Australia declared on 473 for nine as England’s one-paced bowling attacked creaked through 150.4 overs, including a late flurry from the tail that damaged their pride even more than their prospects. Continue reading...","content":null,"pubDate":"2021-12-17 11:43:25","full_description":"England endured a torrid second day in Adelaide as Australia bullied their bowlers and feasted on their openers to put themselves firmly on course for a 2-0 Ashes lead. If the opening day of this day/night second Test was chastening, with England scraping together only two wickets in three full sessions, then what followed here was even worse. There were bruising moments individually and collectively and the nagging sense that after only six days of cricket, this could be a tour that slides off the rails. Australia declared on 473 for nine as England’s one-paced bowling attacked creaked through 150.4 overs, including a late flurry from the tail that damaged their pride even more than their prospects. Gleefully taking the chance to put the tourists in under the lights, when the pink Kookaburra usually does its worst, they then wiped out the struggling Rory Burns and Haseeb Hameed for single-figure scores. Several bolts of lightning lit up the night sky and sent the teams scurrying for the pavilion with England in trouble at 17 for two, a mercifully early end to a painful passage of play. England were already in a hole at the start of the day, with Australia 221 for two and their two most durable batters – Marnus Labuschagne and Steve Smith – at the crease. Conditions were stiflingly hot but the early omens were reasonably promising, with a much-improved showing of three for 81 in the first couple of hours. Labuschagne resumed on 95, twice reprieved by the wicketkeeper Jos Buttler on day one, and soon had his sixth Test hundred courtesy of a thick edge to third man. Three of those have come in day/night matches, a format in which he is an early master. Ollie Robinson should have had him for 102 but saw the breakthrough chalked off for a front-foot no-ball – an error in any circumstances but a particularly egregious one given Ben Stokes made exactly the same mistake to reprieve David Warner in Brisbane. Robinson could have been rattled – particularly when he failed to take a half-chance off Stuart Broad at square leg – but a few minutes and one run later had Labuschagne lbw offering no stroke. Smith held his end up with predictable confidence, but England chipped away his next couple of partners with minimal damage. Travis Head, fresh from a match-winning 152 at The Gabba, got his footwork in a tangle and was bowled by Root for 18 and Stokes briefly abandoned his bouncer policy to clean bowl his fellow all-rounder Cameron Green for two. From 302 for five there was a slim chance of a fightback but England’s day was about to nosedive. Smith had ticked along to 56 by the break and when Alex Carey offered him a fluent foil from No 7, the pair dragged the game away with a partnership of 91. England’s bowlers were flagging with every over, with discipline draining by the minute. Smith sensed weakness and kicked things up a notch, lining up Chris Woakes for a steepling six over long leg. A couple of edges died in front of the cordon and then the cracks really showed, the substitute fielder Zak Crawley coughing up a freebie with a wild throw and Burns turning a Smith single into a five as he hurled the ball over the ropes. Anderson dismissed both batters before the interval, sparing English fans the sight of a 12th Ashes hundred for Smith when he pinned him lbw for 93 and then persuading Carey to chip to cover. The muted celebrations said it all, though. England’s attack was running on empty and the humiliation was about to come. The first 10 overs of the night-time session was a debacle, with the Australian tail piling on another 83 runs. Mitchell Starc crashed 39 not out at a run a ball, Michael Neser treated Woakes like a net bowler as he flogged him over point for six and both Ollie Pope and Stokes added to England’s growing tally of drops, albeit from tough chances. At one stage England posted eight fielders on the ropes and still failed to stem the flow of boundaries. Woakes looked visibly demoralised as he served up a steady diet of “gimme” deliveries, ended only when Jyhe Richardson followed a monstrous six by holing out and hastening the declaration. He is unlikely to be seen again for the Boxing Day Test, a fate that Burns may also suffer. Following a nightmare first Test he needed a show of resilience but was treated as easy pickings by his tormentor, Starc. Feeling for contact off his third ball he sent a chunky edge straight to Smith at second slip to exit the stage for four. He may have just one more innings to save his skin. Hameed fared little better, handing debutant Neser a first wicket with a soft-handed scoop to mid-on with only six to his name. It was an improbably meek departure and exposed the captain, Joe Root, early. He edged his second ball just in front of the slips as Neser roared in but the weather spared any further drama. Ali Martin’s report from Adelaide to follow","image_url":"https://i.guim.co.uk/img/media/79437f3b04c09a5d225dd3b134569cf929576eff/220_146_3280_1969/master/3280.jpg?width=460&quality=85&auto=format&fit=max&s=59c0f42be2fab05c0d072f7adf801fcd","source_id":"theguardian"},{"title":"England endure torrid day as Australia turn screw in second Ashes Test - The Independent","link":"https://news.google.com/__i/rss/rd/articles/CBMiXmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3Nwb3J0L2NyaWNrZXQvZW5nbGFuZC1hdXN0cmFsaWEtYXNoZXMtc2NvcmUtcmVwb3J0LWIxOTc4MDA2Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England endure torrid day as Australia turn screw in second Ashes Test  The IndependentAshes 2021-22: second Test, day two – as it happened!  The GuardianThe Ashes 2nd Test, Day 2: Is Rory Burns good enough?! | Australia vs England | #PoliteEnquiries  ESPN UKCrash: Cricket nuffy Marnus gets off on fruitless bodyline tactics  The AdvertiserAshes: Steve Smith resumed his love affair with England's bowlers after Brisbane failure  Daily MailView Full coverage on Google News","content":null,"pubDate":"2021-12-17 11:40:12","image_url":null,"source_id":"google"},{"title":"Kohli vs Ganguly: “I have nothing to speak,” says Sourav Ganguly on Virat Kohli captaincy controversy","link":"https://thesportsrush.com/cricket-news-kohli-vs-ganguly-i-have-nothing-to-speak-says-sourav-ganguly-on-virat-kohli-captaincy-controversy/","keywords":["Cricket","India","India tour of South Africa 2021-22","Rohit Sharma","Sourav Ganguly","South Africa","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sourav Ganguly on Virat Kohli: The President of the BCCI appears to have adopted silence over a latest controversy. India captain Virat Kohli was hailed by a large chunk of followers of the Indian cricket team after his pre-departure press conference in Mumbai ahead of India’s tour of South Africa 2021-22. Addressing the reporters in… The post Kohli vs Ganguly: “I have nothing to speak,” says Sourav Ganguly on Virat Kohli captaincy controversy appeared first on The SportsRush.","content":"Sourav Ganguly on Virat Kohli: The President of the BCCI appears to have adopted silence over a latest controversy. India captain Virat Kohli was hailed by a large chunk of followers of the Indian cricket team after his pre-departure press conference in Mumbai ahead of India’s tour of South Africa 2021-22. Addressing the reporters in a virtual conference, Kohli had confirmed his availability for the ODI series in South Africa, opened up on conversation with chief selector Chetan Sharma regarding his demotion in the ODI squad, cleared the air around rift with Rohit Sharma among touching up on other subjects. However, it was his side of explanation around being removed as ODI captain of the Indian team which created a massive uproar among fans and experts. What Kohli’s explanation ended up doing was raising questions of former India captain and current BCCI (Board of Control for Cricket in India) President Sourav Ganguly for he had earlier provided a totally different reason leading up to Kohli’s relegation. Removing Kohli as India’s white-ball captain is debatable but acceptable. It is BCCI’s clumsy manner with respect to dealing with the situation which has converted it into an unacceptable and problematic fiasco. Sourav Ganguly on Virat Kohli Not known for keeping quite or not putting forward his side of things, Ganguly has since behaved in a contrasting manner by keeping mum on the situation. It is twice in a row now that Ganguly has impeded himself from responding to Kohli’s explanation. “Let’s not take this further. I have nothing to speak. This is a BCCI matter and it will deal with it,” Ganguly was quoted as saying by ANI in Kolkata on Friday. Former India captain Sunil Gavaskar is among the many former cricketers who have sought an answer from Ganguly. Let’s not take this further. I have nothing to speak. This is a BCCI matter and it will deal with it: BCCI President Sourav Ganguly in Kolkata on #ViratKohli pic.twitter.com/UtkBkBjpRW — ANI (@ANI) December 17, 2021 Meanwhile, a 20-member Indian Test squad has already reached South Africa for a three-match Test series which will commence from December 26 in Centurion. The post Kohli vs Ganguly: “I have nothing to speak,” says Sourav Ganguly on Virat Kohli captaincy controversy appeared first on The SportsRush.","pubDate":"2021-12-17 11:37:08","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Ashes 2021, Australia vs England 2nd Test, Day 2 Highlights: ENG struggle at 17/2 as bad weather ends play - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMijQFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvYXNoZXMtMjAyMS1hdXN0cmFsaWEtdnMtZW5nbGFuZC0ybmQtdGVzdC1kYXktMi1hdXMtdnMtZW5nLWxpdmUtc2NvcmUtb25saW5lLXVwZGF0ZXMtNzY3NjQ2OC_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2021, Australia vs England 2nd Test, Day 2 Highlights: ENG struggle at 17/2 as bad weather ends play  The Indian ExpressLabuschagne and Warner put Australia in driver's seat | Men's Ashes 2021-22  cricket.com.auLabuschagne, Warner underline unrewarding day of toil for England in Adelaide Test | Cricbuzz.com - Cricbuzz  CricbuzzAustralia's Cummins allowed to fly home after missing Adelaide Test  SportstarBreaking News: Australia captain Pat Cummins ruled out of second Ashes Test | 16th December 2021  Geo NewsView Full coverage on Google News","content":null,"pubDate":"2021-12-17 11:33:55","image_url":null,"source_id":"google"},{"title":"Andy Flower appointed head coach of IPL's Lucknow franchise","link":"https://www.business-standard.com/article/sports/andy-flower-appointed-head-coach-of-ipl-s-lucknow-franchise-121121700785_1.html","keywords":null,"creator":null,"video_url":null,"description":"Former Zimbabwe captain Andy Flower was on Friday appointed as the head coach of the yet-to-be-named Lucknow franchise, which will make its debut in the 2022 Indian Premier League. Flower was working with Punjab Kings as assistant coach for the past two seasons. KL Rahul, who was Punjab's skipper for the last two seasons, is also expected to move to the Sanjiv Goenka-owned franchise. \"I am incredibly excited to be joining the new Lucknow franchise and I am very grateful for the opportunity. Since my very first tour to India in 1993, I have always loved touring, playing and coaching in India,\" said Flower in a statement. \"The passion for cricket in India is unrivalled and it is a real privilege to lead an IPL franchise and I am looking forward to working closely with Dr Goenka and the Lucknow team. \"I will relish the challenge to build something meaningful and successful with the Lucknow franchise, I am looking forward to meeting the management and staff when I visit Uttar Pradesh","content":null,"pubDate":"2021-12-17 11:21:00","full_description":"Former Zimbabwe captain Andy Flower was on Friday appointed as the head coach of the yet-to-be-named Lucknow franchise, which will make its debut in the 2022 Indian Premier League. Flower was working with Punjab Kings as assistant coach for the past two seasons. KL Rahul, who was Punjab's skipper for the last two seasons, is also expected to move to the Sanjiv Goenka-owned franchise. \"I am incredibly excited to be joining the new Lucknow franchise and I am very grateful for the opportunity. Since my very first tour to India in 1993, I have always loved touring, playing and coaching in India,\" said Flower in a statement. \"The passion for cricket in India is unrivalled and it is a real privilege to lead an IPL franchise and I am looking forward to working closely with Dr Goenka and the Lucknow team. \"I will relish the challenge to build something meaningful and successful with the Lucknow franchise, I am looking forward to meeting the management and staff when I visit Uttar Pradesh in the new year.\" Goenka added: \"As a player and a Coach Andy has left an indelible mark in the history of cricket . We respect his professionalism and hope he will work with our vision and add value to our team.\" The Zimbabwean great, who coached England to the T20 World Cup title in 2010 and also the number one spot in Test rankings, is at the helm of Punjab Kings owned franchise in the Caribbean Premier League -- Saint Lucia Kings. The Goenka-led RP-SG Group had shelled out Rs 7090 crore to own the Lucknow franchise. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211217/thumb-121121700785.jpg","source_id":"business-standard"},{"title":"IND vs SA: Off-field issues bring stern challenge for 'crisis man' Dravid","link":"https://www.business-standard.com/article/sports/ind-vs-sa-off-field-issues-bring-stern-challenge-for-crisis-man-dravid-121121700729_1.html","keywords":null,"creator":null,"video_url":null,"description":"Egos, ambitions, power struggle, startling revelations -- Indian cricket has seen it all in the last few months and the mess has created a tricky situation for eternal 'crisis man', Rahul Dravid","content":null,"pubDate":"2021-12-17 11:07:00","full_description":"Egos, ambitions, power struggle, startling revelations -- Indian cricket has seen it all in the last few months and the mess has created a tricky situation for eternal 'crisis man', Rahul Dravid who is in South Africa with the \"Men in Blue\" for his first overseas assignment as head coach. During his pre-departure press conference ahead of the tour of South Africa, Virat Kohli on Wednesday revealed that he was never asked to stay on as T20 skipper when he informed the board about his decision to relinquish the post, contradicting Sourav Ganguly's statement which suggested that the star batter was asked to reconsider his decision. Notably, the former India captain had said that he personally spoke to Kohli when he was deciding to step down as the T20I captain and urged him to carry on with the job but the star batter decided to quit the position. A day after India Test captain Kohli's startling revelations on the T20I captaincy saga, BCCI president Sourav Ganguly on Thursday said that he won't make any additional comments and the matter will be dealt with by the board. \"I have got nothing to say. We will deal with it appropriately, leave it to the BCCI,\" Ganguly told media persons in Kolkata. Nevertheless, the whole captaincy issue has sparked a controversy between the BCCI president and India's Test skipper and it's far from being over as people are much divided, especially on social media. The hashtag \"ViratVsBCCI\" has been trending on social media for the last two days. Before that press conference, the controversy revolved around the relationship between Virat and Rohit Sharma and now it has become Kohli versus Ganguly. And amid this chaos, cricket has taken a back seat even if the Indian team has reached South Africa for the much-awaited series. After all the drama that has unfolded in the past week, Indian cricket fans have found themselves feeling sorry for Rahul Dravid. But, the politics of Indian cricket isn't new for him. Infact, Dravid was one of the central figures during the whole Ganguly-Greg Chappell infamous episode. And now, the batting legend has the big responsibility on his shoulders to bail Team India out from all the off-field controversies and motivate boys to perform well on the field against the Proteas. Virat Kohli-led India had terrible outings in the first two matches of the 2021 T20 World Cup and they failed to qualify for the next round of the mega-event. Many cricket experts and 'pundits' believe that an insecure dressing room environment was one of the key factors for India's debacle in that tournament. According to them, once Kohli decided to relinquish his T20 captaincy before the start of the event, players somehow were not able to concentrate on their job; instead were thinking about the next skipper and their places in the side. But Dravid, who always believed in work ethics and was a team man to the core during his playing days, will want his boys to concentrate on the job at hand, rather than focusing on other issues. Whether it was playing as an opener in Test, donning the wicket-keeping gloves in order to give a better balance to the team, leading the side during the turmoil -- the Karnataka-born cricketer did everything for the team whenever it was required. And he will want his boys to be ready for all sorts of challenges and opportunities during the South Africa tour. However, it won't be an easy task for 'Mr Dependable', considering the unavailability of key players due to injuries, selection issues and fragile batting line-up and the tough playing conditions and COVID-19 scare in South Africa. In India's glorious cricketing history, South Africa remains the only top cricketing nation where the 'Men in Blue' are yet to win a Test series. Yes, the current Proteas cricket team is sort of inexperienced but they will be tough contenders on their home soil. Virat Kohli, Cheteshwar Pujara and Ajinkya Rahane -- the pillars of Indian batting in Test cricket, haven't been at their best in the last two years and the likes of Kagiso Rabada and Anrich Nortje will test the skill and temperament of these seasoned pros. It will also be interesting to see whether the duo of Kohli and Dravid include struggling Rahane and Pujara in the Playing XI especially when Shreyas Iyer and Hanuma Vihari have done well whenever they have got opportunities. India will also miss the services of Rohit Sharma, Shubman Gill and Ravindra Jadeja, who have been ruled out of the Test series due to injuries. And it won't be easy to fill the shoes in their absence. But, the 48-years old's biggest challenge will be to resolve the conflicts internally. His man management skills will be tested because to win in the Rainbow nation, he needs a happy captain and positive environment in the team. Dravid -- 'The Wall of Indian Team' -- will have a herculean task to get the best out of his players in 'final frontier' South Africa amid all the uncertainties and controversies. And the fans, the biggest stakeholders in cricket, have belief in him. --IANS avn/akm (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211217/thumb-121121700729.jpg","source_id":"business-standard"},{"title":"Virat Kohli teases Ishant Sharma, reveals what's inside his bag, pacer gets irritated - WATCH","link":"https://zeenews.india.com/cricket/virat-kohli-teases-ishant-sharma-reveals-whats-inside-his-bag-pacer-gets-irritated-watch-2420244.html","keywords":null,"creator":null,"video_url":null,"description":"Indian men's cricket team took landed in Johannesburg on Thursday. The BCCI posted a video of the team's journey from Mumbai to the national capital of South Africa, where India are scheduled to play 3 Tests and 3 ODIs each.","content":null,"pubDate":"2021-12-17 11:06:00","full_description":null,"image_url":null,"source_id":"zeenews"}]}