{"newsArray":[{"title":"Sri Lanka surprise Proteas at Women's T20 World Cup","link":"https://www.perthnow.com.au/sport/cricket/sri-lanka-surprise-proteas-at-womens-t20-world-cup-c-9722118","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Sri Lanka have pulled off a shock upset in the opening match of the Women's T20 World Cup with a three-run victory over hosts South Africa in Cape Town.","content":"Sri Lanka have caused a major surprise in the opening game of the Women's Twenty20 World Cup, holding their nerve in the field in a frantic finish to beat hosts South Africa by three runs. Sri Lanka captain Chamari Athapaththu hit 68 from 50 balls to set up a total of 4-129 after her team was sent in to bat. Sri Lanka's bowling and fielding carried their home, with spinners Inoka Ranaweera, Oshadi Ranasinghe and Sugandika Kumari accounting for seven of the wickets as South Africa finished on 9-126. Sri Lanka also pulled off two important run outs in the last two overs to cut short late counterattacks by South African tailenders Sinalo Jafta and Shabnim Ismail. Last batter Nonkululeko Mlaba lofted a drive over mid-off for four off the last ball of the game for South Africa but it didn't matter as the hosts needed eight off that delivery to win. Sri Lanka's players celebrated their famous win energetically at Newlands in Cape Town and all ended up in a huddle on the field doing a team chant. Athapaththu was a crucial leader with her performance with the bat but also for marshalling her bowlers and fielders in the tense final overs. \"I always try and lead from the front,\" Athapaththu said. \"I try and be a role model for the team. We played good cricket today.\" Athapaththu hit 12 fours in her half-century and put on a partnership of 82 off 62 balls with 17-year-old Vishmi Gunaratne, who made 35 off 34 batting at No.3 and promises to be the next star of Sri Lankan women's cricket after Athapaththu. The defeat for South Africa was a bitter blow and came after a tumultuous buildup to the tournament when captain and allrounder Dane van Niekerk, one of the world's top players, was left out of the squad for the tournament for failing a fitness and conditioning test. The decision to drop Van Niekerk because she missed the cutoff time for a two-kilometre run by 18 seconds has stoked hot debate in South Africa. Coach Hilton Moreeng said the team's fitness requirements were \"non-negotiable\" and Van Niekerk ended up working as a TV commentator at the tournament-opener as her team lost. \"One game doesn't define a team and the World Cup still has a long way to go,\" new South Africa captain Sune Luus said. Defending champions Australia, who have won five of the seven T20 World Cups played, start their campaign against New Zealand in a night game in Paarl on Saturday. England play the West Indies earlier. The Australians are favoured to retain their title at the World Cup despite a surprise loss to Ireland in a warmup game this week, their first T20 defeat in nearly two years. \"We come into this World Cup on level pegging with everybody else and we're coming here to win and we know how difficult that is,\" said Australia captain Meg Lanning, who has led her country to three of those World Cup titles.","pubDate":"2023-02-10 21:33:58","image_url":"https://images.perthnow.com.au/publication/C-9722118/435b6f295550868deadabe8a21441df4bac10c19-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Rohit ton, Jadeja & Patel fifties put India on top","link":"https://www.thehansindia.com/sports/cricket/rohit-ton-jadeja-patel-fifties-put-india-on-top-782322","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Skipper Rohit Sharma conjured up one his most impressive Test hundreds under pressure against a quality Australian attack as India vaulted to a crucial 144-run lead in the series-opener after ending the day two at 321 for 7, here Friday.","content":"Rohit Sharma Nagpur: Skipper Rohit Sharma conjured up one his most impressive Test hundreds under pressure against a quality Australian attack as India vaulted to a crucial 144-run lead in the series-opener after ending the day two at 321 for 7, here Friday. Rohit (120) displayed class and composure of the highest order and in the process became the first Indian captain to have scored a century in all three formats. While Rohit's ninth Test hundred is worth its weight in gold, Ravindra Jadeja's (66 not out) 18th half-century is also priceless. The all-rounder's knock will be equally important in the context of the game. Jadeja once again showed his true worth by adding 61 runs for the sixth wicket with Rohit and another 81 runs for the unconquered eighth-wicket with Axar Patel (52 batting), who is also playing a fine hand. It was a battle of attrition for Indian batters, especially Rohit and Jadeja with the home team putting on board 244 runs on the second day. On a slow track where other batters found the run-scoring extremely difficult, the Indian captain was concentration-personified. It had the same class as the 161 he scored in against England in 2021 in the Chennai Test. The opener put his best food forward against an attack, led by spinners Nathan Lyon (1/98) and Todd Murphy (5/82), who got a five-for on Test debut. In fact, both the off-break bowlers came round the wicket against right-handers to stem the flow of runs and succeeded partially. It took Rohit 171 balls to reach his hundred. He hit 15 boundaries and two sixes in a knock that spanned more than four and half hours. But the hallmark of his innings was the rotation of strike and how he traded risk for caution. Having read the nature of the pitch perfectly, Rohit curbed his natural flair and channelised his \"inner Cheteshwar Pujara\" and testimony to that was 62 completely out of character runs that he scored across two sessions on the day. He had scored 56 runs in half-a-session on Thursday evening. Pull has been Rohit's go-to shot in every form of cricket he didn't take his opposite number Pat Cummins' (1/74) bait, save one time when he hit him for a maximum behind square. He didn't try to get to his hundred in a hurry, playing out maidens and taking singles before whipping Cummins to square leg for a boundary that took his score in the 90s. It was an inside-out lofted drive over extra cover off Murphy that brought up his hundred, and once again reiterated the theory that in adverse situations, individuals with the highest degree of skill prevail. There wasn't any over-the-top celebrations, no cuss words used or the customary ritual of removing the helmet. He just looked towards the dressing room in acknowledgement. Once second new ball was taken, Cummins dismissed Rohit with an unplayable delivery that was fast and also moved away late after pitching. However Jadeja stood firm and got good support from fellow all-rounder Axar to further consolidate India's position in the game. Virat Kohli (12) along with debutants Suryakumar Yadav (8) and Kona Bharat (8) would be disappointed that they didn't score big. In the case of Kohli, bespectacled Murphy bowled a similar delivery to the former India skipper that had earlier accounted for Cheteshwar Pujara. Brief scores: Australia 177 v India 321/7 in 114 overs (Rohit Sharma 120, Ravindra Jadeja batting 66, Axar Patel batting 52; Todd Murphy 5-82). India lead by 144 runs.","pubDate":"2023-02-10 21:18:24","image_url":"https://assets.thehansindia.com/h-upload/2023/02/10/500x300_1335322-ro.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Athapaththu half-century sinks South Africa in T20 World Cup opener","link":"https://www.thehindu.com/sport/cricket/womens-t20-world-cup-sri-lanka-vs-south-africa-february-10-2023/article66495192.ece","keywords":null,"creator":["\n         AFP  \n    "],"video_url":null,"description":"Athapaththu’s 68 enabled Sri Lanka to make 129 for four after they were sent in to bat by South Africa","content":"Sri Lankan captain Chamari Athapaththu made a classy half-century to lead her team to an upset three-run win against hosts South Africa in the opening match of the Women’s T20 World Cup at Newlands in Cape Town on Friday. Athapaththu’s 68 off 50 balls enabled Sri Lanka to make 129 for four after they were sent in to bat by the host nation. Sri Lanka restricted South Africa to 126 for nine with accurate slow bowling backed by good fielding. Left-arm spin bowler Inoka Ranaweera took three key wickets and conceded only 18 runs, while fellow left-armer Sugandika Kumari and off-spinner Oshadhi Ranasinghe took two wickets apiece as South Africa were unable to put together any substantial partnerships. Captain Sune Luus was the top-scorer with 28. The left-handed Athapaththu hit 12 fours and shared a second-wicket partnership of 86 with 17-year-old Vishmi Gunarathne, who made 35. Both batters fell to good fielding off successive balls in the 18th over, preventing a late burst of scoring. Gunarathne was run out by a direct hit by Tazmin Brits and Athapaththu fell to a diving catch in the deep by Nadine de Klerk off Marizanne Kapp. South Africa made a brisk start but Ranaweera bowled accurately and had leading batters Kapp and Laura Wolvaardt caught in her first two overs. When Kumari had the big-hitting Chloe Tryon caught in the deep and bowled Anneke Bosch two balls later South Africa were in deep trouble at 72 for five. Nilakshi Silva held three catches in the deep as the Sri Lankan fielders backed up their bowlers superbly. Luus was stumped off Ranaweera with 17 runs needed off the last nine balls and two run-outs sealed South Africa’s fate. Sri Lanka 129-4 in 20 overs (C Athapaththu 68, V Gunarathne 35) South Africa 126-9 in 20 overs (S. Kumari 2-28, O. Ranasinghe 2-20, I. Ranaweera 3-18) Result: Sri Lanka won by 3 runs Toss: South Africa","pubDate":"2023-02-10 21:05:58","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"‘It’s a really timely reminder’: Australia not panicking after shock loss ahead of World Cup defence","link":"https://www.perthnow.com.au/news/its-a-really-timely-reminder-australia-not-panicking-after-shock-loss-ahead-of-world-cup-defence-c-9721948","keywords":null,"creator":["Martin Gabor"],"video_url":null,"description":"As the first game of Australia’s T20 World Cup defence draws near the new coach has laid down where her team stands.","content":"Coach Shelley Nitschke isn’t pressing the panic button after Australia’s shock loss to Ireland but she says it’s a “timely reminder” how fickle T20 cricket can be just days out from the side’s opening game of the World Cup. The Aussies go into the tournament as the raging favourites as they look to defend the title they won on home soil three years ago when they beat India in front of a record crowd at the MCG. Australia actually lost to India in the opening game of that World Cup and it seemed to shock them into action as the women bounced back to lift the trophy in front of more than 80,000 fans. The loss to Ireland isn’t as catastrophic as it sounds given it was only a warm-up game where gun batters Alyssa Healy and Tahlia McGrath both retired when they could have plundered plenty more runs. With the loss out of their system, Australia now knows the rest of the world is coming ahead of their first match against New Zealand on Sunday morning (AEST). “I think there are a lot of things to take out of the warm-up,” Nitschke said. “We went down in the game, so there are going to be some learnings to come out of that. I think it’s a really timely reminder of T20 cricket. If you’re not quite on, the game can get quite big on you.” One of the positives to come out of the game was the stunning return to form of Healy who smashed an unbeaten 62 off 40 deliveries after coming back from a calf injury that saw her miss the recent series at home against Pakistan. “It was fantastic,” Nitschke said. “It’s been a tough seven weeks for Alyssa. She’s had that calf injury, but to see her back out there keeping wickets, batting, making runs and hitting the ball as well as I’ve seen for a while is exciting for her and it’s exciting for our team.” Healy is one of the many Australian stars who have nominated for next Monday’s Women’s Premier League auction, with the wicketkeeper expected to go for mega bucks in the newly-formed tournament. The anticipation is palpable given how much money is on offer, but Nitschke is worried that the timing could be a distraction during the World Cup. “It’s probably not ideal in a World Cup scenario, but that is what it is and it’s something that we’ve spoken about – rather than ignore it, everyone knows it’s coming and the players have nominated,” she said. “We’ve actually spoken about it as a group and how players may manage the ups and downs that the auction will bring. We’re making sure that we’re still focused on the World Cup because that’s what we’re here to do. “(We also) have to understand that with that auction could come a range of emotions, so we have to make sure that we’re switched on for the game after that.”","pubDate":"2023-02-10 21:02:17","image_url":"https://images.perthnow.com.au/publication/C-9721948/b7522efe375b2d87f050f3fe771baa8de5788f03-16x9-x0y96w1024h576.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Lyndon Dykes ruled out for 'foreseeable future' in Scotland blow","link":"https://www.heraldscotland.com/sport/23314606.lyndon-dykes-ruled-foreseeable-future-scotland-blow/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The QPR striker was admitted to hospital last month amid health concerns and a bout of pneumonia.","content":"Lyndon Dykes is a major doubt for Scotland's Euro 2024 qualifiers next month. The QPR striker was admitted to hospital last month amid health concerns and a bout of pneumonia. The 27-year-old has since been released and returned home to his family. However, his boss at Loftus Road has refused to put a timeframe on the forward's return to the pitch. Scotland play Cyprus and Spain at Hampden as the qualification campaign for the next European Championships gets underway. However, Steve Clarke looks set to be without Dykes. Neil Critchley insists he won't be rushed back. He said: “We don’t want to put a timeframe on Lyndon’s return. What he needs to do is be patient, as we do we and give him our support. READ MORE: Andy Robertson's John Rankin quote that point to success at Hamilton “Any footballer is desperate to come back and I know that is the case with Lyndon. When you speak to him he puts a brave face in it and says he feels better. “But his health is more important than football, so we say take your time, he’ll be back when he is ready. He is getting brilliantly looked after by our medical team and the specialist. “Because he is out for the foreseeable that left us short in numbers and quality at the top end of the pitch. So Chris Martin is a fantastic addition to the squad. “He has already proved his quality in training this week, and I think he will play a big part for us between now and the end of the season. “Lyndon is not back at the club – he is at home resting with his family and seeing how goes on a daily basis at the moment.\" At The Herald and Times we know the importance of reaching you where it's convenient, which is why we've engaged top sportswriter James Morgan to bring you an irreverent daily update on what's happening in the world of sport. Be it football, golf, rugby, cricket or something more exotic, James will tread where the best stories take him. To get this bespoke piece sent directly to your email inbox for free every day at 5pm, simply take 5 seconds to type in your email here . It's that simple!","pubDate":"2023-02-10 19:14:50","image_url":"https://www.heraldscotland.com/resources/images/16447235/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | These old dogs still have the biggest bite: SA20 finalists hail evergreen Ford and Birrell","link":"https://www.news24.com/sport/Cricket/SA20/these-old-dogs-still-have-the-biggest-bite-sa20-finalists-hail-evergreen-ford-and-birrell-20230210","keywords":null,"creator":null,"video_url":null,"description":"The proverbial old dogs among the SA20 head coaches still have the biggest bite as it's Graham Ford and Adi Birrell, both 62, whose respective franchises have reached the final.","content":"Old dogs might not readily learn new tricks, but they invariably still possess a nasty bite. One of the interesting features of Pretoria Capitals and Sunrisers Eastern Cape's respective marches to Saturday's SA20 final at the Wanderers is that the franchises are mentored by the two oldest coaches in the tournament, 62-year-olds Graham Ford and Adi Birrell. The most obvious thing to point out in this regard is the two men's longevity and adaptability in a cricketing landscape that is increasingly data-driven and demanding of innovation. Perhaps more frustratingly for the South African cricketing fraternity, it's a teasing glimpse into the intellectual capital that the local game can boast. Indeed, Ford and Birrell head a group of coaches that also includes Lance Klusener, JP Duminy, Jacques Kallis, Dale Benkenstein, Hashim Amla, Morne Morkel and Dale Steyn, among others. The only problem is that South African cricket - with the exception of Duminy - currently only have these men in the system for the duration of the SA20. When the dust settles, they're scattered all over again. It's true that South African cricket needs to grow its new generation of coaches, but it feels wasteful when a guy like Ford - who's coached the Proteas, Sri Lanka, Ireland, Kent and Surrey - or Birrell - Proteas assistant, Hampshire, Ireland, Boland - aren't more regularly around. Pretoria's team management is particularly star-studded, with former Proteas Dale Benkenstein and Jacques Kallis both being assistants to Ford. According to Capitals skipper Wayne Parnell, calmness and clarity have characterised the table-toppers campaign. \"Fordie is vastly experienced. He's coached all around the world, and he's just really such a calm, easy-going type of coach,\" he said. \"It's similar to Benky. The two men think very similarly. It sounds strange, they have different ideas, but in the end, they're very much the same. It's actually been refreshing. I played alongside Jacques in the Proteas side, and he's never been a guy of many words. He's definitely not outspoken. \"But behind the scenes, he gives nuggets of wisdom, and his pedigree is just something the players latch onto.\" Importantly, Ford's wisdom also translated into him maintaining a balance between imposing ideas and promoting \"freedom of expression\", so to speak. \"As a leadership group, we've generally been on the same page with the coaches from the outset,\" said Parnell. \"It's refreshing and important because sometimes you find that people try to force their ideas and agenda on you as a player. But we've definitely found a nice blend.\" Down in Gqeberha, Birrell has flourished at his old stomping ground. Far from being rigid, Sunrisers captain Aiden Markram has enjoyed his franchise coach's focus on traditional virtues. \"I get on really well with Adi. I spent a little time with him on my first Test trip to England when he was still national assistant. I also had half-a-season with him at Hampshire too. So, we go quite a good way back,\" said the Proteas stroke-maker. \"I just love his simplicity about the way he goes about his coaching. He has a sharp sense of humour, [and is] never short of a funny comment. He has this nice, old-school approach where everything is always very clear. Even at his 'young age', he's still extremely passionate. \"It rubs off on the guys, that enthusiasm and calmness. He's seen it all, he's been around for many years now. His experience helps us a lot.\" First ball in the final will be bowled at 16:30.","pubDate":"2023-02-10 18:54:09","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Early morning? Check. Bad behaviour? Check. Beer? Check. Cops? Check. It must be NRL season","link":"https://www.theage.com.au/sport/early-morning-check-bad-behaviour-check-beer-check-cops-check-it-must-be-nrl-season-20230209-p5cjcx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport"],"creator":["Peter FitzSimons"],"video_url":null,"description":"It was little more than your usual rugby league fracas, but the Latrell Mitchell-Jack Wighton ruckus means that time of year is upon us again.","content":"The Latrell Mitchell-Jack Wighton ruckus? The old rule for footballers used to be, “Nothing good happens after midnight”. But after 3.30 am? In the public domain? Far from being “not good”, it tends to be catastrophic. Happily, this time it was little more than your usual rugby league fracas: two famous players. Cops. Cells. Headlines. Insistence that it wasn’t true, the police over-reacted. Apologies nevertheless , and resolve to do better. No penalties, as yet. I think all it means is the NRL season must be close, yes? After the 10-year anniversary this month of the Essendon-Sharks supplements saga, I am reminded of the words of James Hird at the time: “People say things and they’re untrue. And [when] you know you’ve got truth on your side, you go hard. And when you get your opportunity, you tell the whole truth. James Hird, chatting with Giants captain Stephen Coniglio, was back in the AFL fold last season. Credit: AFL Photos “And when the truth comes out, I think I’ll be in a very, very good position, and so will this football club.” A decade on, I am not sure we ever did get to the bottom of the whole thing, are you? Sorry, what? Look, I get that there’s a state election on, and that the Perrottet government is desperate to hold on to the Penrith electorate held by former Sports Minister Stuart Ayres, the sine qua non of survival. But at a certain point, surely, the showering of largesse on the area gets out of hand? This column has noted many times the sheer ludicrousness of the state government promising $300 million of our money to build a new football stadium for the Penrith Panthers, when: I’ve also noted my colleague Nigel Gladstone’s story on how $12 million of community sports grants “ended up building an underground carpark [for the Panthers].” And now the latest news. That is, another “new multi-sports indoor stadium for Penrith residents worth $106.7million” is to be built. This kind of splurge isn’t in the same ballpark as the federal government dropping tens of millions of dollars on already obscenely rich private schools which allows them to build Olympic pools and concert halls, while public schools are sometimes sharing textbooks. It’s just that Penrith is already promised so much in the realms of taxpayer sports funding, surely other electorates are more deserving, even those not with a wafer-thin majority for the Libs? This is not to say there is no need for such a multi-sports stadium. But given how much money the Penny Panthers have taken from both the taxpayer in general and the Penrith community specifically, how ’bout they foot the bill this time? The Perrottet government was meant to be a break from the naked and unashamed pork-barrelling of the Berejiklian government. This doesn’t look like that. Yonks back in this space, TFF gratuitously asked whether, besides Princess Mary and Prince Whatsit, and Roger Federer and his wife Mirka, did any other happy couples first meet at the Sydney Olympics? The answer came back that in early 2000 a bloke by the name of Anthony Meaker, just back from backpacking for two years, scored a management job with the Sydney Organising Committee for the Olympic Games, and was soon crunching out 20-hour days. It was all made more than tolerable, however, through dealing professionally, and soon personally, with a journalist by the name of Michelle O’Rourke. They were married within a year and went on to live happily ever after, with four kids. As it happens, their third child, Claudia Meaker, aged just 15 years, recently became the youngest Australian to compete in the World Cross Country Trials, where she finished sixth. At 15! She will next compete at the World Cross Country Championships in Bathurst on February 18. No pressure – honest – but there would be a certain symmetry if she went on to represent Australia as an Olympian, and I am reliably informed that is one of her ambitions! Gotta love this city. The week’s major global sporting news, of course, was the Lakers’ LeBron James finally beating the NBA scoring record of Kareem Abdul-Jabbar that has stood for just over 38 years, by scoring his 38,338th point at the age of 38, in a match where he scored 38 points overall! LeBron James and Josh Giddey. Credit: Getty On court for the occasion was Australia’s Josh Giddey, playing for the Oklahoma Thunder. Giddey shook James’ hand at the end of the match, which was won by the Thunder, seeing as you ask. But ain’t sport grand, when it provides such intersections? When LeBron started his career, Giddey was nowt but a newborn baby. In this match, Giddey, at the age of 20, was good if not great, scoring a useful 20 points. The young Australian has been selected to play in the Rising Stars tournament at the All-Star weekend next week, meaning he’s been selected in his opening two NBA seasons. LeBron will be an All Star for the 19th time, which equals Abdul-Jabbar. Giddey earns about $US7 million ($10.1 million) a year, while LeBron pockets a lazy $US44.5 million with the Lakers. Giddey has the look of one who will go on to be a great himself, but I suspect one of his boasts will be he was actually on the court when LeBron got the record! As if you didn’t know, it’s the 15th edition of the Malabar Magic Ocean Swim next Sunday at Malabar Beach. It will raise funds for the Rainbow Club, which provides specialised swimming lessons to children with a disability. It is the most inclusive swim on the circuit, with heaps of Rainbow Club kids participating alongside the likes of aspiring and past Olympians such as Daniel Kowalski. You can participate or donate to the cause at www.malabarmagicoceanswim.com.au . Latrell Mitchell. “Anybody who knows me knows who Latrell Mitchell is. That’s all that matters.” Exactly! ACT Police statement: “About 3.45am today (Sunday, 5 February 2023), ACT Policing responded to reports of a disturbance near a nightclub on Bunda Street in the city.” Joint statement by Latrell Mitchell and Jack Wighton : “We wanted to express remorse for putting ourselves in the position to embarrass our clubs and the NRL over the weekend.” Sir Nick Faldo after St Andrews made some tweaks to the famous Swilcan Bridge: “If you’ve travelled halfway around the world for your bucket list round at St Andrews, would you rather leave with a bit of historic dirt on your shoes or a few cement mix scraps?” Fair enough. But I still prefer his most famous quote of all, after winning the British Open in 1992: “I’d like to thank the press from the heart of my bottom.” Liam Neeson not a fan of UFC: “UFC, I can’t stand. That to me is like a bar fight. I know the practitioners are like, ‘No, you’re wrong – the months of training we do . . .’ Why don’t you just grab a beer bottle and hit the other guy over the head? That’s the next stage of the UFC. I hate it. That little leprechaun Conor McGregor, he gives Ireland a bad name.” WACA’s Avril Fahey doesn’t want to host the West Indies next summer: “Pakistan’s coming with the West Indies again, so I’m pretty hopeful we don’t get the West Indies.” Former Wallaby Jack Dempsey on being picked for Scotland: “I played four Tests in autumn, and made my debut against Australia. When the team got named this week, and I was lucky enough to be in it, you just pinch yourself thinking, ‘How is this Sydney boy, who was lucky enough to live his dream of playing for his state and the Wallabies, then a few years later get to play in the bloody Six Nations’.” Snooker player Ali Carter on what inspired him to win the German Masters: “The journey of getting through the day, all you can see is getting to 10 [frames] seeming like an absolute mile away. I heard Step by Step by Whitney Houston and it was quite a memorable song, and I just thought ‘Yeah, step by step, day by day,’ and I’ve got there.” Manchester City in response to being charged with more than 100 breaches of the EPL financial rules: “Manchester City is surprised by the issuing of these alleged breaches of the Premier League Rules, particularly given the extensive engagement and vast amount of detailed materials that the EPL has been provided with. The club welcomes the review of this matter by an independent commission, to impartially consider the comprehensive body of irrefutable evidence that exists in support of its position.” New England rugby coach Steve Borthwick throwing Eddie Jones under the bus after the loss to Scotland: “I’ve been frank from day one in saying there’s a lot of work to do. When I looked at the team in the autumn, when I measured the team and got all the data for the team, we weren’t good at anything. It was as frank as that.” Ian Chappell , being very Ian-Chappell-esque on Australia’s selectors playing ducks and drakes before the first Test: “This bullshit about, ‘Oh, we’ve got to pick a right-arm and a left-arm spin bowler’ – it’s crap. You pick your best bowlers.” Email from RLPA executive Deidre Anderson to Peter V’landys after a meeting between NRL CEO Andrew Abdo, RLPA CEO Clint Newton and a group of players: “What then followed is nothing short of illegal which, on its face, seriously calls into question the integrity of the NRL, its executive and its culture. I am instructed that a player (who I will not name), raised concerns with RLPA staff that (the employee) was covertly recording the session on [their] phone. The player raised the concern based on their understanding that attendees were not permitted to record these discussions.” Parramatta Eel Mitchell Moses capturing Gen Z speech: “Me and Brooksy speak a lot, we’re best mates. We speak all the time about everything. We’ve had a few conversations, me and Brooksy.” Moses: “Having Hodgo there is massive with his experience and leadership, he’s been big for my game as well.” Danielle Scott. The Australian aerial skier claimed her second World Cup win of the season and is the overall leader with two rounds to go. Kansas City Chiefs and Philadelphia Eagles . Contesting the Super Bowl on Monday morning (AEDT). Perth Wildcats. Scraped into the play-offs by the narrowest of margins. Who knew the NBL play-offs were about to happen? Lauren Jackson. Her WNBL season – and career? – is over after she tore her Achilles. Australian women’s cricket team. The T20 team, which is looking to make it three World Cups on the trot and five of the past six, plays its opening match early on Sunday morning (AEDT) against New Zealand in South Africa. Chloe Covell. Won silver at the skateboarding world championships, and just turned 13. Todd Murphy. Australia’s 465th Test cricketer when he made his debut against India Twitter: @Peter_Fitz Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-02-10 18:48:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Calm, confident Todd Murphy justifies quick climb into Australia Test side","link":"https://www.theguardian.com/sport/2023/feb/10/todd-murphy-justifies-his-rapid-ascent-into-australia-test-side","keywords":["Australia cricket team","India cricket team","Australia sport","Cricket","Sport"],"creator":["Geoff Lemon in Nagpur"],"video_url":null,"description":"The spinner picks up five debut wickets in India’s first innings in Nagpur, including KL Rahul, Cheteshwar Pujara and Virat KohliFor a visiting slow bowler, India can be a trap. It is the spiritual home of spin, the still centre of the universe of revolutions, the place where you might find the most dramatic turner since Tina. It is the place tilted drastically to your advantage, like doing high jump on the moon. But if you’re not steeped in how to use the advantage, if you don’t hit the right lengths, if you don’t know how to bowl to players who know how to face you, then the place chews you up and spits you out, as ragged as the cricket ball after 80 overs on those rough pitches.From his first encounter, Todd Murphy has emerged intact. Innings figures of five for 82 could become more flattering or less when India continue their first innings on the third day with three wickets in hand. But whatever the final analysis, the quiet off-spinner from country Victoria has shown that he is up to the task. KL Rahul, Cheteshwar Pujara and Virat Kohli have 53 Test centuries between them and nearly 18,000 runs. Murphy put them all in his pocket. Continue reading...","content":"F or a visiting slow bowler, India can be a trap. It is the spiritual home of spin, the still centre of the universe of revolutions, the place where you might find the most dramatic turner since Tina. It is the place tilted drastically to your advantage, like doing high jump on the moon. But if you’re not steeped in how to use the advantage, if you don’t hit the right lengths, if you don’t know how to bowl to players who know how to face you, then the place chews you up and spits you out, as ragged as the cricket ball after 80 overs on those rough pitches. From his first encounter, Todd Murphy has emerged intact. Innings figures of five for 82 could become more flattering or less when India continue their first innings on the third day with three wickets in hand. But whatever the final analysis, the quiet off-spinner from country Victoria has shown that he is up to the task. KL Rahul, Cheteshwar Pujara and Virat Kohli have 53 Test centuries between them and nearly 18,000 runs. Murphy put them all in his pocket. Australia’s Todd Murphy takes five-for on debut but India in command Read more It has been a rapid emergence, after five Sheffield Shield matches for Victoria over three seasons. Selectors had an eye on him regardless, picking him in 2022 for an Australia A tour of Sri Lanka and the Prime Minister’s XI against the touring West Indies. But those sort of fixtures don’t usually mean that elevation is imminent, just that somebody warrants a closer look. Those in charge liked what they saw. His short entree got him to India, and his work in the pre-series camp in Bangalore was enough to jump him into the team ahead of Mitchell Swepson and Ashton Agar. The evidence so far backs the call. Several things have stood out with Murphy. There has been the immaculate wrist position, shifting his release point to keep changing the challenge to the batter, but always sending down the ball with a crisp seam. There has been the intensity of the revolutions on it, his gather and release reminiscent of Graeme Swann’s and allowing similar amounts of work on the ball. Those revolutions created the dip that coaxed a return catch from Rahul, and the drift across right-handers from the line around the wicket that he bowled for much of the day. If the ball landed on the leather it would skid on, if it hit the seam it might grip and turn. Predicting either was fraught. Such were the deliveries that trapped all-rounder Ravichandran Ashwin and debuting wicketkeeper KS Bharat. Todd Murphy after picking up his fifth wicket. Photograph: Robert Cianflone/Getty Images Both wickets came from Australia reviewing not-out decisions, where Murphy had the accuracy to pitch in line from around the wicket and the judgment to feel confident that he had. His consistency was underlined by the way that he would occasionally switch over the wicket for a delivery or two and land them without problem. Later in the day his overspinning deliveries started to kick from the surface. “He’s got a lot of confidence in his game,” the Australian bowling coach Daniel Vettori told ABC radio at stumps. “He hasn’t been bowling spin for that long, but he understands the many different styles of bowling. Particularly it’s his ability to bowl a lot of different kinds of balls. You would think that in this situation he would feel under pressure by the batsmen, but that hasn’t been the case at all.” skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion That composure is the other thing that stands out. At 22 years old, Murphy celebrated his wickets but otherwise seemed extremely level in temperament, whether doing media or in the middle. During the Bangalore camp Marnus Labuschagne was asking him for batting feedback in the nets like a senior colleague. His captain Patrick Cummins threw him the second new ball on day two ahead of 100-Test teammate Nathan Lyon. Former Australian fast bowler and India expert Michael Kasprowicz was impressed. “He comes across as a wise old head. And it’s not the glasses. Playing in India, you learn by doing. One thing I’ve learned about young talent is that there can be a lot of overthinking that goes into selections. There was no big boom and flash, he did his job. It’s exciting that he wasn’t exciting.” A good debut doesn’t mean that a career to match will follow. Ask Jason Krejza, who at the same ground in 2008 took eight wickets in his first innings and 12 for the match. He played one more Test and took one more wicket. Right now, though, Murphy has joined Krejza on the list of 35 Australian men with a five-wicket haul on Test debut. If the match pans out as looks likely, with India an imposing 144 runs ahead and counting, this feat should at least give Australia some cheer. If his teammates produce a mighty effort second time with the bat, Murphy is still a chance to join Clarrie Grimmett and Bob Massie as the only ones on that list to do it twice.","pubDate":"2023-02-10 18:22:47","image_url":"https://i.guim.co.uk/img/media/18202302f5893a6a4ebceaeb8b9e87b6fe58ad47/0_155_2739_1643/master/2739.jpg?width=460&quality=85&auto=format&fit=max&s=c0ad4ce47a2f1badea883afca1a14c61","source_id":"theguardian","category":["sports"],"country":["australia"],"language":"english"},{"title":"“There was a furore in the dressing room”: How a harmless push to Sunil Gavaskar handed English pacer John Snow one-match ban in 1971","link":"https://thesportsrush.com/cricket-news-there-was-a-furore-in-the-dressing-room-how-a-harmless-push-to-sunil-gavaskar-handed-english-pacer-john-snow-one-match-ban-in-1971/","keywords":["Cricket","John Snow","Sunil gavaskar"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Around 50 years ago at the home of Cricket – the iconic Lord’s Cricket Ground in the year 1971, a seemingly harmless push in a bid to run a batter Out handed the bowler one-match suspension, taking the ‘Gentlemen’s game’ adage way too seriously. Under skipper Ajit Wadekar, the legendary batter Sunil Gavaskar, who was… The post “There was a furore in the dressing room”: How a harmless push to Sunil Gavaskar handed English pacer John Snow one-match ban in 1971 appeared first on The SportsRush.","content":"Around 50 years ago at the home of Cricket – the iconic Lord’s Cricket Ground in the year 1971, a seemingly harmless push in a bid to run a batter Out handed the bowler one-match suspension, taking the ‘Gentlemen’s game’ adage way too seriously. Under skipper Ajit Wadekar, the legendary batter Sunil Gavaskar, who was just five Test matches old back then was involved in an incident which as per today’s standards would have been termed as a healthy brand of aggressive Cricket. : It was the final Day of the match with India needing 183 runs to win their first-ever Test on English soil. Before the Lunch Break, with the scorecard reading 47/2, Farokh Engineer bat-paded a pacey delivery bowled by English pacer John Snow towards the forward Short Leg region. Engineer and Gavaskar (at the other end) communicated via their eyes and set off for a risky single. With Gavaskar desperately setting off for the single, and Snow eager to get hold of the ball before the former makes his ground, the duo barged into each other. The replay suggested that Snow did push Gavaskar, enough for him to fall over due to his momentum while losing the bat in hand as well in the process. Snow then sort of flung the bat towards him after he made his to the crease, instead of expressing his concern regarding his well being. The entire incident invited harshest of criticisms from the English purists. While Snow agreed to apologize to Gavaskar straightaway post the Lunch Break, a couple of people from the authority entered the dressing room with their criticisms, angering Snow and the England skipper as well. A livid Snow then decided against apologizing to Gavaskar, thereby further aggravating the matter. Resultantly, he was handed a one-match ban, and had to miss the following Test match at Manchester. “I was just trying to pick up the ball to run him out. I apologized to Sunil, but there was a furore in the dressing room because I did not go down to the Indian dressing room to apologize which I told Alec Bedser [chairman of selectors] I would do. We [Gavaskar and him] were over with it but on a public basis, it was not desirable to cricket,” John Snow would later remark during an interaction with , in 2001. For more Cricket-related news, click .","pubDate":"2023-02-10 18:07:20","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Canadian cricketers prepare for next step on journey to return to ICC World Cup","link":"https://www.nsnews.com/national-sports/canadian-cricketers-prepare-for-next-step-on-journey-to-return-to-icc-world-cup-6522979","keywords":null,"creator":["Neil Davidson"," The Canadian Press"],"video_url":null,"description":"Saad Bin Zafar will captain Canada on a tour of Sri Lanka next month as the Canadian men continue their quest to return to the ICC World Cup.","content":"Saad Bin Zafar will captain Canada on a tour of Sri Lanka next month as the Canadian men continue their quest to return to the ICC World Cup. The Canadians will play four 50-over matches against a Sri Lanka development team on the 19-day tour that starts March 3. The Sri Lanka trip is to prepare for the ICC 2023 World Cup Qualifier Playoff that starts March 24 in Namibia. Selectors have named a 16-man squad for the Sri Lanka tour from which 14 will be chosen to go on to Namibia. The Namibia tournament serves as the penultimate stage of the qualification process for the 2023 World Cup. The top two teams will progress to the final qualifying tournament in Zimbabwe in June that will determine the last two participants in the 10-team World Cup in India in October. The Canadian men last played at the World Cup in 2011, missing out in 2015 and '19. Canada has taken part in four of the previous 12 World Cups, never making it out of the first round. The World Cup is the international championship of one-day cricket, with teams playing 50-over matches. Canada worked hard to get to this stage, advancing to the Namibia event by finishing atop League A in the six-country World Cup Challenge League with a 13-1-0 record with one no-result. Zafar entered the record books in November 2021 when he became the first bowler to bowl four overs without conceding a run in an international T20 match as Canada beat Panama at the ICC Men's T20 World Cup Americas Qualifier in Antigua and Barbuda. Bowlers are restricted to four overs in T20 cricket, meaning Zafar had a perfect day — with four maiden overs. T20 is a swashbuckling shortened form of cricket, with teams each playing innings of 20 overs (with six balls per over). Batsmen are always on the attack, looking to score runs quickly. Australia, for example, averaged 9.18 runs per over in defeating New Zealand to win the 2021 ICC Men's T20 World Cup in Dubai. The Aussies reached the victory target of 173 in the 19th over to win by eight wickets. On the same day some 11,725 kilometres away, Zafar blanked Panama for four overs — delivering 24 balls without cost and taking two wickets in the process. Zafar, who came to Canada from Pakistan at 17, has a background in business administration/finance and used to be a procurement analyst for Aviva Canada, an insurance company. But the 36-year-old from Brampton, Ont., quit, electing to work part-time in auto sales to make more time for his sport while helping pay the bills. He was named man of the match in the final of the inaugural Global T20 Canada tournament in 2018, helping a star-studded Vancouver Knights side to a seven-wicket victory over the West Indies B team in King City, Ont. Zafar took two wickets and scored 79 not out, slamming eight fours and three sixes in a 48-ball innings, in the championship game. He was the Knights' leading wicket-taker in the 2019 tournament in Brampton, where Vancouver finished runner-up to the Winnipeg Hawks. Zafar also earned man of the match honours in a playoff win over the Brampton Wolves that year. Zafar made his Canadian debut in 2008 and has been a regular since 2015. Canada does not have test status so is restricted to T20 and one-day internationals (50 overs). Canada Sri Lanka Tour Squad Saad Bin Zafar (capt.), Navneet Dhaliwal, Nikhil Dutta, Jeremy Gordon, Dillon Heyliger, Aaron Johnson, Ammar Khalid, Nicholas Kirton, Parveen Kumar, Shreyas Movva, Kaleem Sana, Pargat Singh, Ravinderpal Singh, Matthew Spoors, Harsh Thaker, Srimantha Wijeyeratne. Head Coach: Pubudu Dassanayake. Assistant Coach: Abhishek Sharma. Manager: Alphonso Franco Trainer: Ankur Sharma. --- Follow @NeilMDavidson on Twitter This report by The Canadian Press was first published Feb. 10, 2022 Neil Davidson, The Canadian Press","pubDate":"2023-02-10 17:30:49","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/02/2023021009020-62cd3693da84afb4156d5dd0c957e786759345bf70e254d1c724999524bd7a62.jpg;w=960","source_id":"nsnews","category":["sports"],"country":["canada"],"language":"english"},{"title":"Sri Lanka surprise Proteas at Women's T20 World Cup","link":"https://www.perthnow.com.au/sport/cricket/sri-lanka-surprise-proteas-at-womens-t20-world-cup-c-9722118","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Sri Lanka have pulled off a shock upset in the opening match of the Women's T20 World Cup with a three-run victory over hosts South Africa in Cape Town.","content":"Sri Lanka have caused a major surprise in the opening game of the Women's Twenty20 World Cup, holding their nerve in the field in a frantic finish to beat hosts South Africa by three runs. Sri Lanka captain Chamari Athapaththu hit 68 from 50 balls to set up a total of 4-129 after her team was sent in to bat. Sri Lanka's bowling and fielding carried their home, with spinners Inoka Ranaweera, Oshadi Ranasinghe and Sugandika Kumari accounting for seven of the wickets as South Africa finished on 9-126. Sri Lanka also pulled off two important run outs in the last two overs to cut short late counterattacks by South African tailenders Sinalo Jafta and Shabnim Ismail. Last batter Nonkululeko Mlaba lofted a drive over mid-off for four off the last ball of the game for South Africa but it didn't matter as the hosts needed eight off that delivery to win. Sri Lanka's players celebrated their famous win energetically at Newlands in Cape Town and all ended up in a huddle on the field doing a team chant. Athapaththu was a crucial leader with her performance with the bat but also for marshalling her bowlers and fielders in the tense final overs. \"I always try and lead from the front,\" Athapaththu said. \"I try and be a role model for the team. We played good cricket today.\" Athapaththu hit 12 fours in her half-century and put on a partnership of 82 off 62 balls with 17-year-old Vishmi Gunaratne, who made 35 off 34 batting at No.3 and promises to be the next star of Sri Lankan women's cricket after Athapaththu. The defeat for South Africa was a bitter blow and came after a tumultuous buildup to the tournament when captain and allrounder Dane van Niekerk, one of the world's top players, was left out of the squad for the tournament for failing a fitness and conditioning test. The decision to drop Van Niekerk because she missed the cutoff time for a two-kilometre run by 18 seconds has stoked hot debate in South Africa. Coach Hilton Moreeng said the team's fitness requirements were \"non-negotiable\" and Van Niekerk ended up working as a TV commentator at the tournament-opener as her team lost. \"One game doesn't define a team and the World Cup still has a long way to go,\" new South Africa captain Sune Luus said. Defending champions Australia, who have won five of the seven T20 World Cups played, start their campaign against New Zealand in a night game in Paarl on Saturday. England play the West Indies earlier. The Australians are favoured to retain their title at the World Cup despite a surprise loss to Ireland in a warmup game this week, their first T20 defeat in nearly two years. \"We come into this World Cup on level pegging with everybody else and we're coming here to win and we know how difficult that is,\" said Australia captain Meg Lanning, who has led her country to three of those World Cup titles.","pubDate":"2023-02-10 21:33:58","image_url":"https://images.perthnow.com.au/publication/C-9722118/435b6f295550868deadabe8a21441df4bac10c19-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Rohit ton, Jadeja & Patel fifties put India on top","link":"https://www.thehansindia.com/sports/cricket/rohit-ton-jadeja-patel-fifties-put-india-on-top-782322","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Skipper Rohit Sharma conjured up one his most impressive Test hundreds under pressure against a quality Australian attack as India vaulted to a crucial 144-run lead in the series-opener after ending the day two at 321 for 7, here Friday.","content":"Rohit Sharma Nagpur: Skipper Rohit Sharma conjured up one his most impressive Test hundreds under pressure against a quality Australian attack as India vaulted to a crucial 144-run lead in the series-opener after ending the day two at 321 for 7, here Friday. Rohit (120) displayed class and composure of the highest order and in the process became the first Indian captain to have scored a century in all three formats. While Rohit's ninth Test hundred is worth its weight in gold, Ravindra Jadeja's (66 not out) 18th half-century is also priceless. The all-rounder's knock will be equally important in the context of the game. Jadeja once again showed his true worth by adding 61 runs for the sixth wicket with Rohit and another 81 runs for the unconquered eighth-wicket with Axar Patel (52 batting), who is also playing a fine hand. It was a battle of attrition for Indian batters, especially Rohit and Jadeja with the home team putting on board 244 runs on the second day. On a slow track where other batters found the run-scoring extremely difficult, the Indian captain was concentration-personified. It had the same class as the 161 he scored in against England in 2021 in the Chennai Test. The opener put his best food forward against an attack, led by spinners Nathan Lyon (1/98) and Todd Murphy (5/82), who got a five-for on Test debut. In fact, both the off-break bowlers came round the wicket against right-handers to stem the flow of runs and succeeded partially. It took Rohit 171 balls to reach his hundred. He hit 15 boundaries and two sixes in a knock that spanned more than four and half hours. But the hallmark of his innings was the rotation of strike and how he traded risk for caution. Having read the nature of the pitch perfectly, Rohit curbed his natural flair and channelised his \"inner Cheteshwar Pujara\" and testimony to that was 62 completely out of character runs that he scored across two sessions on the day. He had scored 56 runs in half-a-session on Thursday evening. Pull has been Rohit's go-to shot in every form of cricket he didn't take his opposite number Pat Cummins' (1/74) bait, save one time when he hit him for a maximum behind square. He didn't try to get to his hundred in a hurry, playing out maidens and taking singles before whipping Cummins to square leg for a boundary that took his score in the 90s. It was an inside-out lofted drive over extra cover off Murphy that brought up his hundred, and once again reiterated the theory that in adverse situations, individuals with the highest degree of skill prevail. There wasn't any over-the-top celebrations, no cuss words used or the customary ritual of removing the helmet. He just looked towards the dressing room in acknowledgement. Once second new ball was taken, Cummins dismissed Rohit with an unplayable delivery that was fast and also moved away late after pitching. However Jadeja stood firm and got good support from fellow all-rounder Axar to further consolidate India's position in the game. Virat Kohli (12) along with debutants Suryakumar Yadav (8) and Kona Bharat (8) would be disappointed that they didn't score big. In the case of Kohli, bespectacled Murphy bowled a similar delivery to the former India skipper that had earlier accounted for Cheteshwar Pujara. Brief scores: Australia 177 v India 321/7 in 114 overs (Rohit Sharma 120, Ravindra Jadeja batting 66, Axar Patel batting 52; Todd Murphy 5-82). India lead by 144 runs.","pubDate":"2023-02-10 21:18:24","image_url":"https://assets.thehansindia.com/h-upload/2023/02/10/500x300_1335322-ro.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Athapaththu half-century sinks South Africa in T20 World Cup opener","link":"https://www.thehindu.com/sport/cricket/womens-t20-world-cup-sri-lanka-vs-south-africa-february-10-2023/article66495192.ece","keywords":null,"creator":["\n         AFP  \n    "],"video_url":null,"description":"Athapaththu’s 68 enabled Sri Lanka to make 129 for four after they were sent in to bat by South Africa","content":"Sri Lankan captain Chamari Athapaththu made a classy half-century to lead her team to an upset three-run win against hosts South Africa in the opening match of the Women’s T20 World Cup at Newlands in Cape Town on Friday. Athapaththu’s 68 off 50 balls enabled Sri Lanka to make 129 for four after they were sent in to bat by the host nation. Sri Lanka restricted South Africa to 126 for nine with accurate slow bowling backed by good fielding. Left-arm spin bowler Inoka Ranaweera took three key wickets and conceded only 18 runs, while fellow left-armer Sugandika Kumari and off-spinner Oshadhi Ranasinghe took two wickets apiece as South Africa were unable to put together any substantial partnerships. Captain Sune Luus was the top-scorer with 28. The left-handed Athapaththu hit 12 fours and shared a second-wicket partnership of 86 with 17-year-old Vishmi Gunarathne, who made 35. Both batters fell to good fielding off successive balls in the 18th over, preventing a late burst of scoring. Gunarathne was run out by a direct hit by Tazmin Brits and Athapaththu fell to a diving catch in the deep by Nadine de Klerk off Marizanne Kapp. South Africa made a brisk start but Ranaweera bowled accurately and had leading batters Kapp and Laura Wolvaardt caught in her first two overs. When Kumari had the big-hitting Chloe Tryon caught in the deep and bowled Anneke Bosch two balls later South Africa were in deep trouble at 72 for five. Nilakshi Silva held three catches in the deep as the Sri Lankan fielders backed up their bowlers superbly. Luus was stumped off Ranaweera with 17 runs needed off the last nine balls and two run-outs sealed South Africa’s fate. Sri Lanka 129-4 in 20 overs (C Athapaththu 68, V Gunarathne 35) South Africa 126-9 in 20 overs (S. Kumari 2-28, O. Ranasinghe 2-20, I. Ranaweera 3-18) Result: Sri Lanka won by 3 runs Toss: South Africa","pubDate":"2023-02-10 21:05:58","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"‘It’s a really timely reminder’: Australia not panicking after shock loss ahead of World Cup defence","link":"https://www.perthnow.com.au/news/its-a-really-timely-reminder-australia-not-panicking-after-shock-loss-ahead-of-world-cup-defence-c-9721948","keywords":null,"creator":["Martin Gabor"],"video_url":null,"description":"As the first game of Australia’s T20 World Cup defence draws near the new coach has laid down where her team stands.","content":"Coach Shelley Nitschke isn’t pressing the panic button after Australia’s shock loss to Ireland but she says it’s a “timely reminder” how fickle T20 cricket can be just days out from the side’s opening game of the World Cup. The Aussies go into the tournament as the raging favourites as they look to defend the title they won on home soil three years ago when they beat India in front of a record crowd at the MCG. Australia actually lost to India in the opening game of that World Cup and it seemed to shock them into action as the women bounced back to lift the trophy in front of more than 80,000 fans. The loss to Ireland isn’t as catastrophic as it sounds given it was only a warm-up game where gun batters Alyssa Healy and Tahlia McGrath both retired when they could have plundered plenty more runs. With the loss out of their system, Australia now knows the rest of the world is coming ahead of their first match against New Zealand on Sunday morning (AEST). “I think there are a lot of things to take out of the warm-up,” Nitschke said. “We went down in the game, so there are going to be some learnings to come out of that. I think it’s a really timely reminder of T20 cricket. If you’re not quite on, the game can get quite big on you.” One of the positives to come out of the game was the stunning return to form of Healy who smashed an unbeaten 62 off 40 deliveries after coming back from a calf injury that saw her miss the recent series at home against Pakistan. “It was fantastic,” Nitschke said. “It’s been a tough seven weeks for Alyssa. She’s had that calf injury, but to see her back out there keeping wickets, batting, making runs and hitting the ball as well as I’ve seen for a while is exciting for her and it’s exciting for our team.” Healy is one of the many Australian stars who have nominated for next Monday’s Women’s Premier League auction, with the wicketkeeper expected to go for mega bucks in the newly-formed tournament. The anticipation is palpable given how much money is on offer, but Nitschke is worried that the timing could be a distraction during the World Cup. “It’s probably not ideal in a World Cup scenario, but that is what it is and it’s something that we’ve spoken about – rather than ignore it, everyone knows it’s coming and the players have nominated,” she said. “We’ve actually spoken about it as a group and how players may manage the ups and downs that the auction will bring. We’re making sure that we’re still focused on the World Cup because that’s what we’re here to do. “(We also) have to understand that with that auction could come a range of emotions, so we have to make sure that we’re switched on for the game after that.”","pubDate":"2023-02-10 21:02:17","image_url":"https://images.perthnow.com.au/publication/C-9721948/b7522efe375b2d87f050f3fe771baa8de5788f03-16x9-x0y96w1024h576.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Lyndon Dykes ruled out for 'foreseeable future' in Scotland blow","link":"https://www.heraldscotland.com/sport/23314606.lyndon-dykes-ruled-foreseeable-future-scotland-blow/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The QPR striker was admitted to hospital last month amid health concerns and a bout of pneumonia.","content":"Lyndon Dykes is a major doubt for Scotland's Euro 2024 qualifiers next month. The QPR striker was admitted to hospital last month amid health concerns and a bout of pneumonia. The 27-year-old has since been released and returned home to his family. However, his boss at Loftus Road has refused to put a timeframe on the forward's return to the pitch. Scotland play Cyprus and Spain at Hampden as the qualification campaign for the next European Championships gets underway. However, Steve Clarke looks set to be without Dykes. Neil Critchley insists he won't be rushed back. He said: “We don’t want to put a timeframe on Lyndon’s return. What he needs to do is be patient, as we do we and give him our support. READ MORE: Andy Robertson's John Rankin quote that point to success at Hamilton “Any footballer is desperate to come back and I know that is the case with Lyndon. When you speak to him he puts a brave face in it and says he feels better. “But his health is more important than football, so we say take your time, he’ll be back when he is ready. He is getting brilliantly looked after by our medical team and the specialist. “Because he is out for the foreseeable that left us short in numbers and quality at the top end of the pitch. So Chris Martin is a fantastic addition to the squad. “He has already proved his quality in training this week, and I think he will play a big part for us between now and the end of the season. “Lyndon is not back at the club – he is at home resting with his family and seeing how goes on a daily basis at the moment.\" At The Herald and Times we know the importance of reaching you where it's convenient, which is why we've engaged top sportswriter James Morgan to bring you an irreverent daily update on what's happening in the world of sport. Be it football, golf, rugby, cricket or something more exotic, James will tread where the best stories take him. To get this bespoke piece sent directly to your email inbox for free every day at 5pm, simply take 5 seconds to type in your email here . It's that simple!","pubDate":"2023-02-10 19:14:50","image_url":"https://www.heraldscotland.com/resources/images/16447235/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | These old dogs still have the biggest bite: SA20 finalists hail evergreen Ford and Birrell","link":"https://www.news24.com/sport/Cricket/SA20/these-old-dogs-still-have-the-biggest-bite-sa20-finalists-hail-evergreen-ford-and-birrell-20230210","keywords":null,"creator":null,"video_url":null,"description":"The proverbial old dogs among the SA20 head coaches still have the biggest bite as it's Graham Ford and Adi Birrell, both 62, whose respective franchises have reached the final.","content":"Old dogs might not readily learn new tricks, but they invariably still possess a nasty bite. One of the interesting features of Pretoria Capitals and Sunrisers Eastern Cape's respective marches to Saturday's SA20 final at the Wanderers is that the franchises are mentored by the two oldest coaches in the tournament, 62-year-olds Graham Ford and Adi Birrell. The most obvious thing to point out in this regard is the two men's longevity and adaptability in a cricketing landscape that is increasingly data-driven and demanding of innovation. Perhaps more frustratingly for the South African cricketing fraternity, it's a teasing glimpse into the intellectual capital that the local game can boast. Indeed, Ford and Birrell head a group of coaches that also includes Lance Klusener, JP Duminy, Jacques Kallis, Dale Benkenstein, Hashim Amla, Morne Morkel and Dale Steyn, among others. The only problem is that South African cricket - with the exception of Duminy - currently only have these men in the system for the duration of the SA20. When the dust settles, they're scattered all over again. It's true that South African cricket needs to grow its new generation of coaches, but it feels wasteful when a guy like Ford - who's coached the Proteas, Sri Lanka, Ireland, Kent and Surrey - or Birrell - Proteas assistant, Hampshire, Ireland, Boland - aren't more regularly around. Pretoria's team management is particularly star-studded, with former Proteas Dale Benkenstein and Jacques Kallis both being assistants to Ford. According to Capitals skipper Wayne Parnell, calmness and clarity have characterised the table-toppers campaign. \"Fordie is vastly experienced. He's coached all around the world, and he's just really such a calm, easy-going type of coach,\" he said. \"It's similar to Benky. The two men think very similarly. It sounds strange, they have different ideas, but in the end, they're very much the same. It's actually been refreshing. I played alongside Jacques in the Proteas side, and he's never been a guy of many words. He's definitely not outspoken. \"But behind the scenes, he gives nuggets of wisdom, and his pedigree is just something the players latch onto.\" Importantly, Ford's wisdom also translated into him maintaining a balance between imposing ideas and promoting \"freedom of expression\", so to speak. \"As a leadership group, we've generally been on the same page with the coaches from the outset,\" said Parnell. \"It's refreshing and important because sometimes you find that people try to force their ideas and agenda on you as a player. But we've definitely found a nice blend.\" Down in Gqeberha, Birrell has flourished at his old stomping ground. Far from being rigid, Sunrisers captain Aiden Markram has enjoyed his franchise coach's focus on traditional virtues. \"I get on really well with Adi. I spent a little time with him on my first Test trip to England when he was still national assistant. I also had half-a-season with him at Hampshire too. So, we go quite a good way back,\" said the Proteas stroke-maker. \"I just love his simplicity about the way he goes about his coaching. He has a sharp sense of humour, [and is] never short of a funny comment. He has this nice, old-school approach where everything is always very clear. Even at his 'young age', he's still extremely passionate. \"It rubs off on the guys, that enthusiasm and calmness. He's seen it all, he's been around for many years now. His experience helps us a lot.\" First ball in the final will be bowled at 16:30.","pubDate":"2023-02-10 18:54:09","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Early morning? Check. Bad behaviour? Check. Beer? Check. Cops? Check. It must be NRL season","link":"https://www.theage.com.au/sport/early-morning-check-bad-behaviour-check-beer-check-cops-check-it-must-be-nrl-season-20230209-p5cjcx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport"],"creator":["Peter FitzSimons"],"video_url":null,"description":"It was little more than your usual rugby league fracas, but the Latrell Mitchell-Jack Wighton ruckus means that time of year is upon us again.","content":"The Latrell Mitchell-Jack Wighton ruckus? The old rule for footballers used to be, “Nothing good happens after midnight”. But after 3.30 am? In the public domain? Far from being “not good”, it tends to be catastrophic. Happily, this time it was little more than your usual rugby league fracas: two famous players. Cops. Cells. Headlines. Insistence that it wasn’t true, the police over-reacted. Apologies nevertheless , and resolve to do better. No penalties, as yet. I think all it means is the NRL season must be close, yes? After the 10-year anniversary this month of the Essendon-Sharks supplements saga, I am reminded of the words of James Hird at the time: “People say things and they’re untrue. And [when] you know you’ve got truth on your side, you go hard. And when you get your opportunity, you tell the whole truth. James Hird, chatting with Giants captain Stephen Coniglio, was back in the AFL fold last season. Credit: AFL Photos “And when the truth comes out, I think I’ll be in a very, very good position, and so will this football club.” A decade on, I am not sure we ever did get to the bottom of the whole thing, are you? Sorry, what? Look, I get that there’s a state election on, and that the Perrottet government is desperate to hold on to the Penrith electorate held by former Sports Minister Stuart Ayres, the sine qua non of survival. But at a certain point, surely, the showering of largesse on the area gets out of hand? This column has noted many times the sheer ludicrousness of the state government promising $300 million of our money to build a new football stadium for the Penrith Panthers, when: I’ve also noted my colleague Nigel Gladstone’s story on how $12 million of community sports grants “ended up building an underground carpark [for the Panthers].” And now the latest news. That is, another “new multi-sports indoor stadium for Penrith residents worth $106.7million” is to be built. This kind of splurge isn’t in the same ballpark as the federal government dropping tens of millions of dollars on already obscenely rich private schools which allows them to build Olympic pools and concert halls, while public schools are sometimes sharing textbooks. It’s just that Penrith is already promised so much in the realms of taxpayer sports funding, surely other electorates are more deserving, even those not with a wafer-thin majority for the Libs? This is not to say there is no need for such a multi-sports stadium. But given how much money the Penny Panthers have taken from both the taxpayer in general and the Penrith community specifically, how ’bout they foot the bill this time? The Perrottet government was meant to be a break from the naked and unashamed pork-barrelling of the Berejiklian government. This doesn’t look like that. Yonks back in this space, TFF gratuitously asked whether, besides Princess Mary and Prince Whatsit, and Roger Federer and his wife Mirka, did any other happy couples first meet at the Sydney Olympics? The answer came back that in early 2000 a bloke by the name of Anthony Meaker, just back from backpacking for two years, scored a management job with the Sydney Organising Committee for the Olympic Games, and was soon crunching out 20-hour days. It was all made more than tolerable, however, through dealing professionally, and soon personally, with a journalist by the name of Michelle O’Rourke. They were married within a year and went on to live happily ever after, with four kids. As it happens, their third child, Claudia Meaker, aged just 15 years, recently became the youngest Australian to compete in the World Cross Country Trials, where she finished sixth. At 15! She will next compete at the World Cross Country Championships in Bathurst on February 18. No pressure – honest – but there would be a certain symmetry if she went on to represent Australia as an Olympian, and I am reliably informed that is one of her ambitions! Gotta love this city. The week’s major global sporting news, of course, was the Lakers’ LeBron James finally beating the NBA scoring record of Kareem Abdul-Jabbar that has stood for just over 38 years, by scoring his 38,338th point at the age of 38, in a match where he scored 38 points overall! LeBron James and Josh Giddey. Credit: Getty On court for the occasion was Australia’s Josh Giddey, playing for the Oklahoma Thunder. Giddey shook James’ hand at the end of the match, which was won by the Thunder, seeing as you ask. But ain’t sport grand, when it provides such intersections? When LeBron started his career, Giddey was nowt but a newborn baby. In this match, Giddey, at the age of 20, was good if not great, scoring a useful 20 points. The young Australian has been selected to play in the Rising Stars tournament at the All-Star weekend next week, meaning he’s been selected in his opening two NBA seasons. LeBron will be an All Star for the 19th time, which equals Abdul-Jabbar. Giddey earns about $US7 million ($10.1 million) a year, while LeBron pockets a lazy $US44.5 million with the Lakers. Giddey has the look of one who will go on to be a great himself, but I suspect one of his boasts will be he was actually on the court when LeBron got the record! As if you didn’t know, it’s the 15th edition of the Malabar Magic Ocean Swim next Sunday at Malabar Beach. It will raise funds for the Rainbow Club, which provides specialised swimming lessons to children with a disability. It is the most inclusive swim on the circuit, with heaps of Rainbow Club kids participating alongside the likes of aspiring and past Olympians such as Daniel Kowalski. You can participate or donate to the cause at www.malabarmagicoceanswim.com.au . Latrell Mitchell. “Anybody who knows me knows who Latrell Mitchell is. That’s all that matters.” Exactly! ACT Police statement: “About 3.45am today (Sunday, 5 February 2023), ACT Policing responded to reports of a disturbance near a nightclub on Bunda Street in the city.” Joint statement by Latrell Mitchell and Jack Wighton : “We wanted to express remorse for putting ourselves in the position to embarrass our clubs and the NRL over the weekend.” Sir Nick Faldo after St Andrews made some tweaks to the famous Swilcan Bridge: “If you’ve travelled halfway around the world for your bucket list round at St Andrews, would you rather leave with a bit of historic dirt on your shoes or a few cement mix scraps?” Fair enough. But I still prefer his most famous quote of all, after winning the British Open in 1992: “I’d like to thank the press from the heart of my bottom.” Liam Neeson not a fan of UFC: “UFC, I can’t stand. That to me is like a bar fight. I know the practitioners are like, ‘No, you’re wrong – the months of training we do . . .’ Why don’t you just grab a beer bottle and hit the other guy over the head? That’s the next stage of the UFC. I hate it. That little leprechaun Conor McGregor, he gives Ireland a bad name.” WACA’s Avril Fahey doesn’t want to host the West Indies next summer: “Pakistan’s coming with the West Indies again, so I’m pretty hopeful we don’t get the West Indies.” Former Wallaby Jack Dempsey on being picked for Scotland: “I played four Tests in autumn, and made my debut against Australia. When the team got named this week, and I was lucky enough to be in it, you just pinch yourself thinking, ‘How is this Sydney boy, who was lucky enough to live his dream of playing for his state and the Wallabies, then a few years later get to play in the bloody Six Nations’.” Snooker player Ali Carter on what inspired him to win the German Masters: “The journey of getting through the day, all you can see is getting to 10 [frames] seeming like an absolute mile away. I heard Step by Step by Whitney Houston and it was quite a memorable song, and I just thought ‘Yeah, step by step, day by day,’ and I’ve got there.” Manchester City in response to being charged with more than 100 breaches of the EPL financial rules: “Manchester City is surprised by the issuing of these alleged breaches of the Premier League Rules, particularly given the extensive engagement and vast amount of detailed materials that the EPL has been provided with. The club welcomes the review of this matter by an independent commission, to impartially consider the comprehensive body of irrefutable evidence that exists in support of its position.” New England rugby coach Steve Borthwick throwing Eddie Jones under the bus after the loss to Scotland: “I’ve been frank from day one in saying there’s a lot of work to do. When I looked at the team in the autumn, when I measured the team and got all the data for the team, we weren’t good at anything. It was as frank as that.” Ian Chappell , being very Ian-Chappell-esque on Australia’s selectors playing ducks and drakes before the first Test: “This bullshit about, ‘Oh, we’ve got to pick a right-arm and a left-arm spin bowler’ – it’s crap. You pick your best bowlers.” Email from RLPA executive Deidre Anderson to Peter V’landys after a meeting between NRL CEO Andrew Abdo, RLPA CEO Clint Newton and a group of players: “What then followed is nothing short of illegal which, on its face, seriously calls into question the integrity of the NRL, its executive and its culture. I am instructed that a player (who I will not name), raised concerns with RLPA staff that (the employee) was covertly recording the session on [their] phone. The player raised the concern based on their understanding that attendees were not permitted to record these discussions.” Parramatta Eel Mitchell Moses capturing Gen Z speech: “Me and Brooksy speak a lot, we’re best mates. We speak all the time about everything. We’ve had a few conversations, me and Brooksy.” Moses: “Having Hodgo there is massive with his experience and leadership, he’s been big for my game as well.” Danielle Scott. The Australian aerial skier claimed her second World Cup win of the season and is the overall leader with two rounds to go. Kansas City Chiefs and Philadelphia Eagles . Contesting the Super Bowl on Monday morning (AEDT). Perth Wildcats. Scraped into the play-offs by the narrowest of margins. Who knew the NBL play-offs were about to happen? Lauren Jackson. Her WNBL season – and career? – is over after she tore her Achilles. Australian women’s cricket team. The T20 team, which is looking to make it three World Cups on the trot and five of the past six, plays its opening match early on Sunday morning (AEDT) against New Zealand in South Africa. Chloe Covell. Won silver at the skateboarding world championships, and just turned 13. Todd Murphy. Australia’s 465th Test cricketer when he made his debut against India Twitter: @Peter_Fitz Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-02-10 18:48:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Calm, confident Todd Murphy justifies quick climb into Australia Test side","link":"https://www.theguardian.com/sport/2023/feb/10/todd-murphy-justifies-his-rapid-ascent-into-australia-test-side","keywords":["Australia cricket team","India cricket team","Australia sport","Cricket","Sport"],"creator":["Geoff Lemon in Nagpur"],"video_url":null,"description":"The spinner picks up five debut wickets in India’s first innings in Nagpur, including KL Rahul, Cheteshwar Pujara and Virat KohliFor a visiting slow bowler, India can be a trap. It is the spiritual home of spin, the still centre of the universe of revolutions, the place where you might find the most dramatic turner since Tina. It is the place tilted drastically to your advantage, like doing high jump on the moon. But if you’re not steeped in how to use the advantage, if you don’t hit the right lengths, if you don’t know how to bowl to players who know how to face you, then the place chews you up and spits you out, as ragged as the cricket ball after 80 overs on those rough pitches.From his first encounter, Todd Murphy has emerged intact. Innings figures of five for 82 could become more flattering or less when India continue their first innings on the third day with three wickets in hand. But whatever the final analysis, the quiet off-spinner from country Victoria has shown that he is up to the task. KL Rahul, Cheteshwar Pujara and Virat Kohli have 53 Test centuries between them and nearly 18,000 runs. Murphy put them all in his pocket. Continue reading...","content":"F or a visiting slow bowler, India can be a trap. It is the spiritual home of spin, the still centre of the universe of revolutions, the place where you might find the most dramatic turner since Tina. It is the place tilted drastically to your advantage, like doing high jump on the moon. But if you’re not steeped in how to use the advantage, if you don’t hit the right lengths, if you don’t know how to bowl to players who know how to face you, then the place chews you up and spits you out, as ragged as the cricket ball after 80 overs on those rough pitches. From his first encounter, Todd Murphy has emerged intact. Innings figures of five for 82 could become more flattering or less when India continue their first innings on the third day with three wickets in hand. But whatever the final analysis, the quiet off-spinner from country Victoria has shown that he is up to the task. KL Rahul, Cheteshwar Pujara and Virat Kohli have 53 Test centuries between them and nearly 18,000 runs. Murphy put them all in his pocket. Australia’s Todd Murphy takes five-for on debut but India in command Read more It has been a rapid emergence, after five Sheffield Shield matches for Victoria over three seasons. Selectors had an eye on him regardless, picking him in 2022 for an Australia A tour of Sri Lanka and the Prime Minister’s XI against the touring West Indies. But those sort of fixtures don’t usually mean that elevation is imminent, just that somebody warrants a closer look. Those in charge liked what they saw. His short entree got him to India, and his work in the pre-series camp in Bangalore was enough to jump him into the team ahead of Mitchell Swepson and Ashton Agar. The evidence so far backs the call. Several things have stood out with Murphy. There has been the immaculate wrist position, shifting his release point to keep changing the challenge to the batter, but always sending down the ball with a crisp seam. There has been the intensity of the revolutions on it, his gather and release reminiscent of Graeme Swann’s and allowing similar amounts of work on the ball. Those revolutions created the dip that coaxed a return catch from Rahul, and the drift across right-handers from the line around the wicket that he bowled for much of the day. If the ball landed on the leather it would skid on, if it hit the seam it might grip and turn. Predicting either was fraught. Such were the deliveries that trapped all-rounder Ravichandran Ashwin and debuting wicketkeeper KS Bharat. Todd Murphy after picking up his fifth wicket. Photograph: Robert Cianflone/Getty Images Both wickets came from Australia reviewing not-out decisions, where Murphy had the accuracy to pitch in line from around the wicket and the judgment to feel confident that he had. His consistency was underlined by the way that he would occasionally switch over the wicket for a delivery or two and land them without problem. Later in the day his overspinning deliveries started to kick from the surface. “He’s got a lot of confidence in his game,” the Australian bowling coach Daniel Vettori told ABC radio at stumps. “He hasn’t been bowling spin for that long, but he understands the many different styles of bowling. Particularly it’s his ability to bowl a lot of different kinds of balls. You would think that in this situation he would feel under pressure by the batsmen, but that hasn’t been the case at all.” skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion That composure is the other thing that stands out. At 22 years old, Murphy celebrated his wickets but otherwise seemed extremely level in temperament, whether doing media or in the middle. During the Bangalore camp Marnus Labuschagne was asking him for batting feedback in the nets like a senior colleague. His captain Patrick Cummins threw him the second new ball on day two ahead of 100-Test teammate Nathan Lyon. Former Australian fast bowler and India expert Michael Kasprowicz was impressed. “He comes across as a wise old head. And it’s not the glasses. Playing in India, you learn by doing. One thing I’ve learned about young talent is that there can be a lot of overthinking that goes into selections. There was no big boom and flash, he did his job. It’s exciting that he wasn’t exciting.” A good debut doesn’t mean that a career to match will follow. Ask Jason Krejza, who at the same ground in 2008 took eight wickets in his first innings and 12 for the match. He played one more Test and took one more wicket. Right now, though, Murphy has joined Krejza on the list of 35 Australian men with a five-wicket haul on Test debut. If the match pans out as looks likely, with India an imposing 144 runs ahead and counting, this feat should at least give Australia some cheer. If his teammates produce a mighty effort second time with the bat, Murphy is still a chance to join Clarrie Grimmett and Bob Massie as the only ones on that list to do it twice.","pubDate":"2023-02-10 18:22:47","image_url":"https://i.guim.co.uk/img/media/18202302f5893a6a4ebceaeb8b9e87b6fe58ad47/0_155_2739_1643/master/2739.jpg?width=460&quality=85&auto=format&fit=max&s=c0ad4ce47a2f1badea883afca1a14c61","source_id":"theguardian","category":["sports"],"country":["australia"],"language":"english"},{"title":"“There was a furore in the dressing room”: How a harmless push to Sunil Gavaskar handed English pacer John Snow one-match ban in 1971","link":"https://thesportsrush.com/cricket-news-there-was-a-furore-in-the-dressing-room-how-a-harmless-push-to-sunil-gavaskar-handed-english-pacer-john-snow-one-match-ban-in-1971/","keywords":["Cricket","John Snow","Sunil gavaskar"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Around 50 years ago at the home of Cricket – the iconic Lord’s Cricket Ground in the year 1971, a seemingly harmless push in a bid to run a batter Out handed the bowler one-match suspension, taking the ‘Gentlemen’s game’ adage way too seriously. Under skipper Ajit Wadekar, the legendary batter Sunil Gavaskar, who was… The post “There was a furore in the dressing room”: How a harmless push to Sunil Gavaskar handed English pacer John Snow one-match ban in 1971 appeared first on The SportsRush.","content":"Around 50 years ago at the home of Cricket – the iconic Lord’s Cricket Ground in the year 1971, a seemingly harmless push in a bid to run a batter Out handed the bowler one-match suspension, taking the ‘Gentlemen’s game’ adage way too seriously. Under skipper Ajit Wadekar, the legendary batter Sunil Gavaskar, who was just five Test matches old back then was involved in an incident which as per today’s standards would have been termed as a healthy brand of aggressive Cricket. : It was the final Day of the match with India needing 183 runs to win their first-ever Test on English soil. Before the Lunch Break, with the scorecard reading 47/2, Farokh Engineer bat-paded a pacey delivery bowled by English pacer John Snow towards the forward Short Leg region. Engineer and Gavaskar (at the other end) communicated via their eyes and set off for a risky single. With Gavaskar desperately setting off for the single, and Snow eager to get hold of the ball before the former makes his ground, the duo barged into each other. The replay suggested that Snow did push Gavaskar, enough for him to fall over due to his momentum while losing the bat in hand as well in the process. Snow then sort of flung the bat towards him after he made his to the crease, instead of expressing his concern regarding his well being. The entire incident invited harshest of criticisms from the English purists. While Snow agreed to apologize to Gavaskar straightaway post the Lunch Break, a couple of people from the authority entered the dressing room with their criticisms, angering Snow and the England skipper as well. A livid Snow then decided against apologizing to Gavaskar, thereby further aggravating the matter. Resultantly, he was handed a one-match ban, and had to miss the following Test match at Manchester. “I was just trying to pick up the ball to run him out. I apologized to Sunil, but there was a furore in the dressing room because I did not go down to the Indian dressing room to apologize which I told Alec Bedser [chairman of selectors] I would do. We [Gavaskar and him] were over with it but on a public basis, it was not desirable to cricket,” John Snow would later remark during an interaction with , in 2001. For more Cricket-related news, click .","pubDate":"2023-02-10 18:07:20","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Canadian cricketers prepare for next step on journey to return to ICC World Cup","link":"https://www.nsnews.com/national-sports/canadian-cricketers-prepare-for-next-step-on-journey-to-return-to-icc-world-cup-6522979","keywords":null,"creator":["Neil Davidson"," The Canadian Press"],"video_url":null,"description":"Saad Bin Zafar will captain Canada on a tour of Sri Lanka next month as the Canadian men continue their quest to return to the ICC World Cup.","content":"Saad Bin Zafar will captain Canada on a tour of Sri Lanka next month as the Canadian men continue their quest to return to the ICC World Cup. The Canadians will play four 50-over matches against a Sri Lanka development team on the 19-day tour that starts March 3. The Sri Lanka trip is to prepare for the ICC 2023 World Cup Qualifier Playoff that starts March 24 in Namibia. Selectors have named a 16-man squad for the Sri Lanka tour from which 14 will be chosen to go on to Namibia. The Namibia tournament serves as the penultimate stage of the qualification process for the 2023 World Cup. The top two teams will progress to the final qualifying tournament in Zimbabwe in June that will determine the last two participants in the 10-team World Cup in India in October. The Canadian men last played at the World Cup in 2011, missing out in 2015 and '19. Canada has taken part in four of the previous 12 World Cups, never making it out of the first round. The World Cup is the international championship of one-day cricket, with teams playing 50-over matches. Canada worked hard to get to this stage, advancing to the Namibia event by finishing atop League A in the six-country World Cup Challenge League with a 13-1-0 record with one no-result. Zafar entered the record books in November 2021 when he became the first bowler to bowl four overs without conceding a run in an international T20 match as Canada beat Panama at the ICC Men's T20 World Cup Americas Qualifier in Antigua and Barbuda. Bowlers are restricted to four overs in T20 cricket, meaning Zafar had a perfect day — with four maiden overs. T20 is a swashbuckling shortened form of cricket, with teams each playing innings of 20 overs (with six balls per over). Batsmen are always on the attack, looking to score runs quickly. Australia, for example, averaged 9.18 runs per over in defeating New Zealand to win the 2021 ICC Men's T20 World Cup in Dubai. The Aussies reached the victory target of 173 in the 19th over to win by eight wickets. On the same day some 11,725 kilometres away, Zafar blanked Panama for four overs — delivering 24 balls without cost and taking two wickets in the process. Zafar, who came to Canada from Pakistan at 17, has a background in business administration/finance and used to be a procurement analyst for Aviva Canada, an insurance company. But the 36-year-old from Brampton, Ont., quit, electing to work part-time in auto sales to make more time for his sport while helping pay the bills. He was named man of the match in the final of the inaugural Global T20 Canada tournament in 2018, helping a star-studded Vancouver Knights side to a seven-wicket victory over the West Indies B team in King City, Ont. Zafar took two wickets and scored 79 not out, slamming eight fours and three sixes in a 48-ball innings, in the championship game. He was the Knights' leading wicket-taker in the 2019 tournament in Brampton, where Vancouver finished runner-up to the Winnipeg Hawks. Zafar also earned man of the match honours in a playoff win over the Brampton Wolves that year. Zafar made his Canadian debut in 2008 and has been a regular since 2015. Canada does not have test status so is restricted to T20 and one-day internationals (50 overs). Canada Sri Lanka Tour Squad Saad Bin Zafar (capt.), Navneet Dhaliwal, Nikhil Dutta, Jeremy Gordon, Dillon Heyliger, Aaron Johnson, Ammar Khalid, Nicholas Kirton, Parveen Kumar, Shreyas Movva, Kaleem Sana, Pargat Singh, Ravinderpal Singh, Matthew Spoors, Harsh Thaker, Srimantha Wijeyeratne. Head Coach: Pubudu Dassanayake. Assistant Coach: Abhishek Sharma. Manager: Alphonso Franco Trainer: Ankur Sharma. --- Follow @NeilMDavidson on Twitter This report by The Canadian Press was first published Feb. 10, 2022 Neil Davidson, The Canadian Press","pubDate":"2023-02-10 17:30:49","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/02/2023021009020-62cd3693da84afb4156d5dd0c957e786759345bf70e254d1c724999524bd7a62.jpg;w=960","source_id":"nsnews","category":["sports"],"country":["canada"],"language":"english"},{"title":"Sri Lanka surprise Proteas at Women's T20 World Cup","link":"https://www.perthnow.com.au/sport/cricket/sri-lanka-surprise-proteas-at-womens-t20-world-cup-c-9722118","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Sri Lanka have pulled off a shock upset in the opening match of the Women's T20 World Cup with a three-run victory over hosts South Africa in Cape Town.","content":"Sri Lanka have caused a major surprise in the opening game of the Women's Twenty20 World Cup, holding their nerve in the field in a frantic finish to beat hosts South Africa by three runs. Sri Lanka captain Chamari Athapaththu hit 68 from 50 balls to set up a total of 4-129 after her team was sent in to bat. Sri Lanka's bowling and fielding carried their home, with spinners Inoka Ranaweera, Oshadi Ranasinghe and Sugandika Kumari accounting for seven of the wickets as South Africa finished on 9-126. Sri Lanka also pulled off two important run outs in the last two overs to cut short late counterattacks by South African tailenders Sinalo Jafta and Shabnim Ismail. Last batter Nonkululeko Mlaba lofted a drive over mid-off for four off the last ball of the game for South Africa but it didn't matter as the hosts needed eight off that delivery to win. Sri Lanka's players celebrated their famous win energetically at Newlands in Cape Town and all ended up in a huddle on the field doing a team chant. Athapaththu was a crucial leader with her performance with the bat but also for marshalling her bowlers and fielders in the tense final overs. \"I always try and lead from the front,\" Athapaththu said. \"I try and be a role model for the team. We played good cricket today.\" Athapaththu hit 12 fours in her half-century and put on a partnership of 82 off 62 balls with 17-year-old Vishmi Gunaratne, who made 35 off 34 batting at No.3 and promises to be the next star of Sri Lankan women's cricket after Athapaththu. The defeat for South Africa was a bitter blow and came after a tumultuous buildup to the tournament when captain and allrounder Dane van Niekerk, one of the world's top players, was left out of the squad for the tournament for failing a fitness and conditioning test. The decision to drop Van Niekerk because she missed the cutoff time for a two-kilometre run by 18 seconds has stoked hot debate in South Africa. Coach Hilton Moreeng said the team's fitness requirements were \"non-negotiable\" and Van Niekerk ended up working as a TV commentator at the tournament-opener as her team lost. \"One game doesn't define a team and the World Cup still has a long way to go,\" new South Africa captain Sune Luus said. Defending champions Australia, who have won five of the seven T20 World Cups played, start their campaign against New Zealand in a night game in Paarl on Saturday. England play the West Indies earlier. The Australians are favoured to retain their title at the World Cup despite a surprise loss to Ireland in a warmup game this week, their first T20 defeat in nearly two years. \"We come into this World Cup on level pegging with everybody else and we're coming here to win and we know how difficult that is,\" said Australia captain Meg Lanning, who has led her country to three of those World Cup titles.","pubDate":"2023-02-10 21:33:58","image_url":"https://images.perthnow.com.au/publication/C-9722118/435b6f295550868deadabe8a21441df4bac10c19-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Rohit ton, Jadeja & Patel fifties put India on top","link":"https://www.thehansindia.com/sports/cricket/rohit-ton-jadeja-patel-fifties-put-india-on-top-782322","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Skipper Rohit Sharma conjured up one his most impressive Test hundreds under pressure against a quality Australian attack as India vaulted to a crucial 144-run lead in the series-opener after ending the day two at 321 for 7, here Friday.","content":"Rohit Sharma Nagpur: Skipper Rohit Sharma conjured up one his most impressive Test hundreds under pressure against a quality Australian attack as India vaulted to a crucial 144-run lead in the series-opener after ending the day two at 321 for 7, here Friday. Rohit (120) displayed class and composure of the highest order and in the process became the first Indian captain to have scored a century in all three formats. While Rohit's ninth Test hundred is worth its weight in gold, Ravindra Jadeja's (66 not out) 18th half-century is also priceless. The all-rounder's knock will be equally important in the context of the game. Jadeja once again showed his true worth by adding 61 runs for the sixth wicket with Rohit and another 81 runs for the unconquered eighth-wicket with Axar Patel (52 batting), who is also playing a fine hand. It was a battle of attrition for Indian batters, especially Rohit and Jadeja with the home team putting on board 244 runs on the second day. On a slow track where other batters found the run-scoring extremely difficult, the Indian captain was concentration-personified. It had the same class as the 161 he scored in against England in 2021 in the Chennai Test. The opener put his best food forward against an attack, led by spinners Nathan Lyon (1/98) and Todd Murphy (5/82), who got a five-for on Test debut. In fact, both the off-break bowlers came round the wicket against right-handers to stem the flow of runs and succeeded partially. It took Rohit 171 balls to reach his hundred. He hit 15 boundaries and two sixes in a knock that spanned more than four and half hours. But the hallmark of his innings was the rotation of strike and how he traded risk for caution. Having read the nature of the pitch perfectly, Rohit curbed his natural flair and channelised his \"inner Cheteshwar Pujara\" and testimony to that was 62 completely out of character runs that he scored across two sessions on the day. He had scored 56 runs in half-a-session on Thursday evening. Pull has been Rohit's go-to shot in every form of cricket he didn't take his opposite number Pat Cummins' (1/74) bait, save one time when he hit him for a maximum behind square. He didn't try to get to his hundred in a hurry, playing out maidens and taking singles before whipping Cummins to square leg for a boundary that took his score in the 90s. It was an inside-out lofted drive over extra cover off Murphy that brought up his hundred, and once again reiterated the theory that in adverse situations, individuals with the highest degree of skill prevail. There wasn't any over-the-top celebrations, no cuss words used or the customary ritual of removing the helmet. He just looked towards the dressing room in acknowledgement. Once second new ball was taken, Cummins dismissed Rohit with an unplayable delivery that was fast and also moved away late after pitching. However Jadeja stood firm and got good support from fellow all-rounder Axar to further consolidate India's position in the game. Virat Kohli (12) along with debutants Suryakumar Yadav (8) and Kona Bharat (8) would be disappointed that they didn't score big. In the case of Kohli, bespectacled Murphy bowled a similar delivery to the former India skipper that had earlier accounted for Cheteshwar Pujara. Brief scores: Australia 177 v India 321/7 in 114 overs (Rohit Sharma 120, Ravindra Jadeja batting 66, Axar Patel batting 52; Todd Murphy 5-82). India lead by 144 runs.","pubDate":"2023-02-10 21:18:24","image_url":"https://assets.thehansindia.com/h-upload/2023/02/10/500x300_1335322-ro.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Athapaththu half-century sinks South Africa in T20 World Cup opener","link":"https://www.thehindu.com/sport/cricket/womens-t20-world-cup-sri-lanka-vs-south-africa-february-10-2023/article66495192.ece","keywords":null,"creator":["\n         AFP  \n    "],"video_url":null,"description":"Athapaththu’s 68 enabled Sri Lanka to make 129 for four after they were sent in to bat by South Africa","content":"Sri Lankan captain Chamari Athapaththu made a classy half-century to lead her team to an upset three-run win against hosts South Africa in the opening match of the Women’s T20 World Cup at Newlands in Cape Town on Friday. Athapaththu’s 68 off 50 balls enabled Sri Lanka to make 129 for four after they were sent in to bat by the host nation. Sri Lanka restricted South Africa to 126 for nine with accurate slow bowling backed by good fielding. Left-arm spin bowler Inoka Ranaweera took three key wickets and conceded only 18 runs, while fellow left-armer Sugandika Kumari and off-spinner Oshadhi Ranasinghe took two wickets apiece as South Africa were unable to put together any substantial partnerships. Captain Sune Luus was the top-scorer with 28. The left-handed Athapaththu hit 12 fours and shared a second-wicket partnership of 86 with 17-year-old Vishmi Gunarathne, who made 35. Both batters fell to good fielding off successive balls in the 18th over, preventing a late burst of scoring. Gunarathne was run out by a direct hit by Tazmin Brits and Athapaththu fell to a diving catch in the deep by Nadine de Klerk off Marizanne Kapp. South Africa made a brisk start but Ranaweera bowled accurately and had leading batters Kapp and Laura Wolvaardt caught in her first two overs. When Kumari had the big-hitting Chloe Tryon caught in the deep and bowled Anneke Bosch two balls later South Africa were in deep trouble at 72 for five. Nilakshi Silva held three catches in the deep as the Sri Lankan fielders backed up their bowlers superbly. Luus was stumped off Ranaweera with 17 runs needed off the last nine balls and two run-outs sealed South Africa’s fate. Sri Lanka 129-4 in 20 overs (C Athapaththu 68, V Gunarathne 35) South Africa 126-9 in 20 overs (S. Kumari 2-28, O. Ranasinghe 2-20, I. Ranaweera 3-18) Result: Sri Lanka won by 3 runs Toss: South Africa","pubDate":"2023-02-10 21:05:58","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"‘It’s a really timely reminder’: Australia not panicking after shock loss ahead of World Cup defence","link":"https://www.perthnow.com.au/news/its-a-really-timely-reminder-australia-not-panicking-after-shock-loss-ahead-of-world-cup-defence-c-9721948","keywords":null,"creator":["Martin Gabor"],"video_url":null,"description":"As the first game of Australia’s T20 World Cup defence draws near the new coach has laid down where her team stands.","content":"Coach Shelley Nitschke isn’t pressing the panic button after Australia’s shock loss to Ireland but she says it’s a “timely reminder” how fickle T20 cricket can be just days out from the side’s opening game of the World Cup. The Aussies go into the tournament as the raging favourites as they look to defend the title they won on home soil three years ago when they beat India in front of a record crowd at the MCG. Australia actually lost to India in the opening game of that World Cup and it seemed to shock them into action as the women bounced back to lift the trophy in front of more than 80,000 fans. The loss to Ireland isn’t as catastrophic as it sounds given it was only a warm-up game where gun batters Alyssa Healy and Tahlia McGrath both retired when they could have plundered plenty more runs. With the loss out of their system, Australia now knows the rest of the world is coming ahead of their first match against New Zealand on Sunday morning (AEST). “I think there are a lot of things to take out of the warm-up,” Nitschke said. “We went down in the game, so there are going to be some learnings to come out of that. I think it’s a really timely reminder of T20 cricket. If you’re not quite on, the game can get quite big on you.” One of the positives to come out of the game was the stunning return to form of Healy who smashed an unbeaten 62 off 40 deliveries after coming back from a calf injury that saw her miss the recent series at home against Pakistan. “It was fantastic,” Nitschke said. “It’s been a tough seven weeks for Alyssa. She’s had that calf injury, but to see her back out there keeping wickets, batting, making runs and hitting the ball as well as I’ve seen for a while is exciting for her and it’s exciting for our team.” Healy is one of the many Australian stars who have nominated for next Monday’s Women’s Premier League auction, with the wicketkeeper expected to go for mega bucks in the newly-formed tournament. The anticipation is palpable given how much money is on offer, but Nitschke is worried that the timing could be a distraction during the World Cup. “It’s probably not ideal in a World Cup scenario, but that is what it is and it’s something that we’ve spoken about – rather than ignore it, everyone knows it’s coming and the players have nominated,” she said. “We’ve actually spoken about it as a group and how players may manage the ups and downs that the auction will bring. We’re making sure that we’re still focused on the World Cup because that’s what we’re here to do. “(We also) have to understand that with that auction could come a range of emotions, so we have to make sure that we’re switched on for the game after that.”","pubDate":"2023-02-10 21:02:17","image_url":"https://images.perthnow.com.au/publication/C-9721948/b7522efe375b2d87f050f3fe771baa8de5788f03-16x9-x0y96w1024h576.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Lyndon Dykes ruled out for 'foreseeable future' in Scotland blow","link":"https://www.heraldscotland.com/sport/23314606.lyndon-dykes-ruled-foreseeable-future-scotland-blow/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The QPR striker was admitted to hospital last month amid health concerns and a bout of pneumonia.","content":"Lyndon Dykes is a major doubt for Scotland's Euro 2024 qualifiers next month. The QPR striker was admitted to hospital last month amid health concerns and a bout of pneumonia. The 27-year-old has since been released and returned home to his family. However, his boss at Loftus Road has refused to put a timeframe on the forward's return to the pitch. Scotland play Cyprus and Spain at Hampden as the qualification campaign for the next European Championships gets underway. However, Steve Clarke looks set to be without Dykes. Neil Critchley insists he won't be rushed back. He said: “We don’t want to put a timeframe on Lyndon’s return. What he needs to do is be patient, as we do we and give him our support. READ MORE: Andy Robertson's John Rankin quote that point to success at Hamilton “Any footballer is desperate to come back and I know that is the case with Lyndon. When you speak to him he puts a brave face in it and says he feels better. “But his health is more important than football, so we say take your time, he’ll be back when he is ready. He is getting brilliantly looked after by our medical team and the specialist. “Because he is out for the foreseeable that left us short in numbers and quality at the top end of the pitch. So Chris Martin is a fantastic addition to the squad. “He has already proved his quality in training this week, and I think he will play a big part for us between now and the end of the season. “Lyndon is not back at the club – he is at home resting with his family and seeing how goes on a daily basis at the moment.\" At The Herald and Times we know the importance of reaching you where it's convenient, which is why we've engaged top sportswriter James Morgan to bring you an irreverent daily update on what's happening in the world of sport. Be it football, golf, rugby, cricket or something more exotic, James will tread where the best stories take him. To get this bespoke piece sent directly to your email inbox for free every day at 5pm, simply take 5 seconds to type in your email here . It's that simple!","pubDate":"2023-02-10 19:14:50","image_url":"https://www.heraldscotland.com/resources/images/16447235/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | These old dogs still have the biggest bite: SA20 finalists hail evergreen Ford and Birrell","link":"https://www.news24.com/sport/Cricket/SA20/these-old-dogs-still-have-the-biggest-bite-sa20-finalists-hail-evergreen-ford-and-birrell-20230210","keywords":null,"creator":null,"video_url":null,"description":"The proverbial old dogs among the SA20 head coaches still have the biggest bite as it's Graham Ford and Adi Birrell, both 62, whose respective franchises have reached the final.","content":"Old dogs might not readily learn new tricks, but they invariably still possess a nasty bite. One of the interesting features of Pretoria Capitals and Sunrisers Eastern Cape's respective marches to Saturday's SA20 final at the Wanderers is that the franchises are mentored by the two oldest coaches in the tournament, 62-year-olds Graham Ford and Adi Birrell. The most obvious thing to point out in this regard is the two men's longevity and adaptability in a cricketing landscape that is increasingly data-driven and demanding of innovation. Perhaps more frustratingly for the South African cricketing fraternity, it's a teasing glimpse into the intellectual capital that the local game can boast. Indeed, Ford and Birrell head a group of coaches that also includes Lance Klusener, JP Duminy, Jacques Kallis, Dale Benkenstein, Hashim Amla, Morne Morkel and Dale Steyn, among others. The only problem is that South African cricket - with the exception of Duminy - currently only have these men in the system for the duration of the SA20. When the dust settles, they're scattered all over again. It's true that South African cricket needs to grow its new generation of coaches, but it feels wasteful when a guy like Ford - who's coached the Proteas, Sri Lanka, Ireland, Kent and Surrey - or Birrell - Proteas assistant, Hampshire, Ireland, Boland - aren't more regularly around. Pretoria's team management is particularly star-studded, with former Proteas Dale Benkenstein and Jacques Kallis both being assistants to Ford. According to Capitals skipper Wayne Parnell, calmness and clarity have characterised the table-toppers campaign. \"Fordie is vastly experienced. He's coached all around the world, and he's just really such a calm, easy-going type of coach,\" he said. \"It's similar to Benky. The two men think very similarly. It sounds strange, they have different ideas, but in the end, they're very much the same. It's actually been refreshing. I played alongside Jacques in the Proteas side, and he's never been a guy of many words. He's definitely not outspoken. \"But behind the scenes, he gives nuggets of wisdom, and his pedigree is just something the players latch onto.\" Importantly, Ford's wisdom also translated into him maintaining a balance between imposing ideas and promoting \"freedom of expression\", so to speak. \"As a leadership group, we've generally been on the same page with the coaches from the outset,\" said Parnell. \"It's refreshing and important because sometimes you find that people try to force their ideas and agenda on you as a player. But we've definitely found a nice blend.\" Down in Gqeberha, Birrell has flourished at his old stomping ground. Far from being rigid, Sunrisers captain Aiden Markram has enjoyed his franchise coach's focus on traditional virtues. \"I get on really well with Adi. I spent a little time with him on my first Test trip to England when he was still national assistant. I also had half-a-season with him at Hampshire too. So, we go quite a good way back,\" said the Proteas stroke-maker. \"I just love his simplicity about the way he goes about his coaching. He has a sharp sense of humour, [and is] never short of a funny comment. He has this nice, old-school approach where everything is always very clear. Even at his 'young age', he's still extremely passionate. \"It rubs off on the guys, that enthusiasm and calmness. He's seen it all, he's been around for many years now. His experience helps us a lot.\" First ball in the final will be bowled at 16:30.","pubDate":"2023-02-10 18:54:09","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Early morning? Check. Bad behaviour? Check. Beer? Check. Cops? Check. It must be NRL season","link":"https://www.theage.com.au/sport/early-morning-check-bad-behaviour-check-beer-check-cops-check-it-must-be-nrl-season-20230209-p5cjcx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport"],"creator":["Peter FitzSimons"],"video_url":null,"description":"It was little more than your usual rugby league fracas, but the Latrell Mitchell-Jack Wighton ruckus means that time of year is upon us again.","content":"The Latrell Mitchell-Jack Wighton ruckus? The old rule for footballers used to be, “Nothing good happens after midnight”. But after 3.30 am? In the public domain? Far from being “not good”, it tends to be catastrophic. Happily, this time it was little more than your usual rugby league fracas: two famous players. Cops. Cells. Headlines. Insistence that it wasn’t true, the police over-reacted. Apologies nevertheless , and resolve to do better. No penalties, as yet. I think all it means is the NRL season must be close, yes? After the 10-year anniversary this month of the Essendon-Sharks supplements saga, I am reminded of the words of James Hird at the time: “People say things and they’re untrue. And [when] you know you’ve got truth on your side, you go hard. And when you get your opportunity, you tell the whole truth. James Hird, chatting with Giants captain Stephen Coniglio, was back in the AFL fold last season. Credit: AFL Photos “And when the truth comes out, I think I’ll be in a very, very good position, and so will this football club.” A decade on, I am not sure we ever did get to the bottom of the whole thing, are you? Sorry, what? Look, I get that there’s a state election on, and that the Perrottet government is desperate to hold on to the Penrith electorate held by former Sports Minister Stuart Ayres, the sine qua non of survival. But at a certain point, surely, the showering of largesse on the area gets out of hand? This column has noted many times the sheer ludicrousness of the state government promising $300 million of our money to build a new football stadium for the Penrith Panthers, when: I’ve also noted my colleague Nigel Gladstone’s story on how $12 million of community sports grants “ended up building an underground carpark [for the Panthers].” And now the latest news. That is, another “new multi-sports indoor stadium for Penrith residents worth $106.7million” is to be built. This kind of splurge isn’t in the same ballpark as the federal government dropping tens of millions of dollars on already obscenely rich private schools which allows them to build Olympic pools and concert halls, while public schools are sometimes sharing textbooks. It’s just that Penrith is already promised so much in the realms of taxpayer sports funding, surely other electorates are more deserving, even those not with a wafer-thin majority for the Libs? This is not to say there is no need for such a multi-sports stadium. But given how much money the Penny Panthers have taken from both the taxpayer in general and the Penrith community specifically, how ’bout they foot the bill this time? The Perrottet government was meant to be a break from the naked and unashamed pork-barrelling of the Berejiklian government. This doesn’t look like that. Yonks back in this space, TFF gratuitously asked whether, besides Princess Mary and Prince Whatsit, and Roger Federer and his wife Mirka, did any other happy couples first meet at the Sydney Olympics? The answer came back that in early 2000 a bloke by the name of Anthony Meaker, just back from backpacking for two years, scored a management job with the Sydney Organising Committee for the Olympic Games, and was soon crunching out 20-hour days. It was all made more than tolerable, however, through dealing professionally, and soon personally, with a journalist by the name of Michelle O’Rourke. They were married within a year and went on to live happily ever after, with four kids. As it happens, their third child, Claudia Meaker, aged just 15 years, recently became the youngest Australian to compete in the World Cross Country Trials, where she finished sixth. At 15! She will next compete at the World Cross Country Championships in Bathurst on February 18. No pressure – honest – but there would be a certain symmetry if she went on to represent Australia as an Olympian, and I am reliably informed that is one of her ambitions! Gotta love this city. The week’s major global sporting news, of course, was the Lakers’ LeBron James finally beating the NBA scoring record of Kareem Abdul-Jabbar that has stood for just over 38 years, by scoring his 38,338th point at the age of 38, in a match where he scored 38 points overall! LeBron James and Josh Giddey. Credit: Getty On court for the occasion was Australia’s Josh Giddey, playing for the Oklahoma Thunder. Giddey shook James’ hand at the end of the match, which was won by the Thunder, seeing as you ask. But ain’t sport grand, when it provides such intersections? When LeBron started his career, Giddey was nowt but a newborn baby. In this match, Giddey, at the age of 20, was good if not great, scoring a useful 20 points. The young Australian has been selected to play in the Rising Stars tournament at the All-Star weekend next week, meaning he’s been selected in his opening two NBA seasons. LeBron will be an All Star for the 19th time, which equals Abdul-Jabbar. Giddey earns about $US7 million ($10.1 million) a year, while LeBron pockets a lazy $US44.5 million with the Lakers. Giddey has the look of one who will go on to be a great himself, but I suspect one of his boasts will be he was actually on the court when LeBron got the record! As if you didn’t know, it’s the 15th edition of the Malabar Magic Ocean Swim next Sunday at Malabar Beach. It will raise funds for the Rainbow Club, which provides specialised swimming lessons to children with a disability. It is the most inclusive swim on the circuit, with heaps of Rainbow Club kids participating alongside the likes of aspiring and past Olympians such as Daniel Kowalski. You can participate or donate to the cause at www.malabarmagicoceanswim.com.au . Latrell Mitchell. “Anybody who knows me knows who Latrell Mitchell is. That’s all that matters.” Exactly! ACT Police statement: “About 3.45am today (Sunday, 5 February 2023), ACT Policing responded to reports of a disturbance near a nightclub on Bunda Street in the city.” Joint statement by Latrell Mitchell and Jack Wighton : “We wanted to express remorse for putting ourselves in the position to embarrass our clubs and the NRL over the weekend.” Sir Nick Faldo after St Andrews made some tweaks to the famous Swilcan Bridge: “If you’ve travelled halfway around the world for your bucket list round at St Andrews, would you rather leave with a bit of historic dirt on your shoes or a few cement mix scraps?” Fair enough. But I still prefer his most famous quote of all, after winning the British Open in 1992: “I’d like to thank the press from the heart of my bottom.” Liam Neeson not a fan of UFC: “UFC, I can’t stand. That to me is like a bar fight. I know the practitioners are like, ‘No, you’re wrong – the months of training we do . . .’ Why don’t you just grab a beer bottle and hit the other guy over the head? That’s the next stage of the UFC. I hate it. That little leprechaun Conor McGregor, he gives Ireland a bad name.” WACA’s Avril Fahey doesn’t want to host the West Indies next summer: “Pakistan’s coming with the West Indies again, so I’m pretty hopeful we don’t get the West Indies.” Former Wallaby Jack Dempsey on being picked for Scotland: “I played four Tests in autumn, and made my debut against Australia. When the team got named this week, and I was lucky enough to be in it, you just pinch yourself thinking, ‘How is this Sydney boy, who was lucky enough to live his dream of playing for his state and the Wallabies, then a few years later get to play in the bloody Six Nations’.” Snooker player Ali Carter on what inspired him to win the German Masters: “The journey of getting through the day, all you can see is getting to 10 [frames] seeming like an absolute mile away. I heard Step by Step by Whitney Houston and it was quite a memorable song, and I just thought ‘Yeah, step by step, day by day,’ and I’ve got there.” Manchester City in response to being charged with more than 100 breaches of the EPL financial rules: “Manchester City is surprised by the issuing of these alleged breaches of the Premier League Rules, particularly given the extensive engagement and vast amount of detailed materials that the EPL has been provided with. The club welcomes the review of this matter by an independent commission, to impartially consider the comprehensive body of irrefutable evidence that exists in support of its position.” New England rugby coach Steve Borthwick throwing Eddie Jones under the bus after the loss to Scotland: “I’ve been frank from day one in saying there’s a lot of work to do. When I looked at the team in the autumn, when I measured the team and got all the data for the team, we weren’t good at anything. It was as frank as that.” Ian Chappell , being very Ian-Chappell-esque on Australia’s selectors playing ducks and drakes before the first Test: “This bullshit about, ‘Oh, we’ve got to pick a right-arm and a left-arm spin bowler’ – it’s crap. You pick your best bowlers.” Email from RLPA executive Deidre Anderson to Peter V’landys after a meeting between NRL CEO Andrew Abdo, RLPA CEO Clint Newton and a group of players: “What then followed is nothing short of illegal which, on its face, seriously calls into question the integrity of the NRL, its executive and its culture. I am instructed that a player (who I will not name), raised concerns with RLPA staff that (the employee) was covertly recording the session on [their] phone. The player raised the concern based on their understanding that attendees were not permitted to record these discussions.” Parramatta Eel Mitchell Moses capturing Gen Z speech: “Me and Brooksy speak a lot, we’re best mates. We speak all the time about everything. We’ve had a few conversations, me and Brooksy.” Moses: “Having Hodgo there is massive with his experience and leadership, he’s been big for my game as well.” Danielle Scott. The Australian aerial skier claimed her second World Cup win of the season and is the overall leader with two rounds to go. Kansas City Chiefs and Philadelphia Eagles . Contesting the Super Bowl on Monday morning (AEDT). Perth Wildcats. Scraped into the play-offs by the narrowest of margins. Who knew the NBL play-offs were about to happen? Lauren Jackson. Her WNBL season – and career? – is over after she tore her Achilles. Australian women’s cricket team. The T20 team, which is looking to make it three World Cups on the trot and five of the past six, plays its opening match early on Sunday morning (AEDT) against New Zealand in South Africa. Chloe Covell. Won silver at the skateboarding world championships, and just turned 13. Todd Murphy. Australia’s 465th Test cricketer when he made his debut against India Twitter: @Peter_Fitz Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-02-10 18:48:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Calm, confident Todd Murphy justifies quick climb into Australia Test side","link":"https://www.theguardian.com/sport/2023/feb/10/todd-murphy-justifies-his-rapid-ascent-into-australia-test-side","keywords":["Australia cricket team","India cricket team","Australia sport","Cricket","Sport"],"creator":["Geoff Lemon in Nagpur"],"video_url":null,"description":"The spinner picks up five debut wickets in India’s first innings in Nagpur, including KL Rahul, Cheteshwar Pujara and Virat KohliFor a visiting slow bowler, India can be a trap. It is the spiritual home of spin, the still centre of the universe of revolutions, the place where you might find the most dramatic turner since Tina. It is the place tilted drastically to your advantage, like doing high jump on the moon. But if you’re not steeped in how to use the advantage, if you don’t hit the right lengths, if you don’t know how to bowl to players who know how to face you, then the place chews you up and spits you out, as ragged as the cricket ball after 80 overs on those rough pitches.From his first encounter, Todd Murphy has emerged intact. Innings figures of five for 82 could become more flattering or less when India continue their first innings on the third day with three wickets in hand. But whatever the final analysis, the quiet off-spinner from country Victoria has shown that he is up to the task. KL Rahul, Cheteshwar Pujara and Virat Kohli have 53 Test centuries between them and nearly 18,000 runs. Murphy put them all in his pocket. Continue reading...","content":"F or a visiting slow bowler, India can be a trap. It is the spiritual home of spin, the still centre of the universe of revolutions, the place where you might find the most dramatic turner since Tina. It is the place tilted drastically to your advantage, like doing high jump on the moon. But if you’re not steeped in how to use the advantage, if you don’t hit the right lengths, if you don’t know how to bowl to players who know how to face you, then the place chews you up and spits you out, as ragged as the cricket ball after 80 overs on those rough pitches. From his first encounter, Todd Murphy has emerged intact. Innings figures of five for 82 could become more flattering or less when India continue their first innings on the third day with three wickets in hand. But whatever the final analysis, the quiet off-spinner from country Victoria has shown that he is up to the task. KL Rahul, Cheteshwar Pujara and Virat Kohli have 53 Test centuries between them and nearly 18,000 runs. Murphy put them all in his pocket. Australia’s Todd Murphy takes five-for on debut but India in command Read more It has been a rapid emergence, after five Sheffield Shield matches for Victoria over three seasons. Selectors had an eye on him regardless, picking him in 2022 for an Australia A tour of Sri Lanka and the Prime Minister’s XI against the touring West Indies. But those sort of fixtures don’t usually mean that elevation is imminent, just that somebody warrants a closer look. Those in charge liked what they saw. His short entree got him to India, and his work in the pre-series camp in Bangalore was enough to jump him into the team ahead of Mitchell Swepson and Ashton Agar. The evidence so far backs the call. Several things have stood out with Murphy. There has been the immaculate wrist position, shifting his release point to keep changing the challenge to the batter, but always sending down the ball with a crisp seam. There has been the intensity of the revolutions on it, his gather and release reminiscent of Graeme Swann’s and allowing similar amounts of work on the ball. Those revolutions created the dip that coaxed a return catch from Rahul, and the drift across right-handers from the line around the wicket that he bowled for much of the day. If the ball landed on the leather it would skid on, if it hit the seam it might grip and turn. Predicting either was fraught. Such were the deliveries that trapped all-rounder Ravichandran Ashwin and debuting wicketkeeper KS Bharat. Todd Murphy after picking up his fifth wicket. Photograph: Robert Cianflone/Getty Images Both wickets came from Australia reviewing not-out decisions, where Murphy had the accuracy to pitch in line from around the wicket and the judgment to feel confident that he had. His consistency was underlined by the way that he would occasionally switch over the wicket for a delivery or two and land them without problem. Later in the day his overspinning deliveries started to kick from the surface. “He’s got a lot of confidence in his game,” the Australian bowling coach Daniel Vettori told ABC radio at stumps. “He hasn’t been bowling spin for that long, but he understands the many different styles of bowling. Particularly it’s his ability to bowl a lot of different kinds of balls. You would think that in this situation he would feel under pressure by the batsmen, but that hasn’t been the case at all.” skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion That composure is the other thing that stands out. At 22 years old, Murphy celebrated his wickets but otherwise seemed extremely level in temperament, whether doing media or in the middle. During the Bangalore camp Marnus Labuschagne was asking him for batting feedback in the nets like a senior colleague. His captain Patrick Cummins threw him the second new ball on day two ahead of 100-Test teammate Nathan Lyon. Former Australian fast bowler and India expert Michael Kasprowicz was impressed. “He comes across as a wise old head. And it’s not the glasses. Playing in India, you learn by doing. One thing I’ve learned about young talent is that there can be a lot of overthinking that goes into selections. There was no big boom and flash, he did his job. It’s exciting that he wasn’t exciting.” A good debut doesn’t mean that a career to match will follow. Ask Jason Krejza, who at the same ground in 2008 took eight wickets in his first innings and 12 for the match. He played one more Test and took one more wicket. Right now, though, Murphy has joined Krejza on the list of 35 Australian men with a five-wicket haul on Test debut. If the match pans out as looks likely, with India an imposing 144 runs ahead and counting, this feat should at least give Australia some cheer. If his teammates produce a mighty effort second time with the bat, Murphy is still a chance to join Clarrie Grimmett and Bob Massie as the only ones on that list to do it twice.","pubDate":"2023-02-10 18:22:47","image_url":"https://i.guim.co.uk/img/media/18202302f5893a6a4ebceaeb8b9e87b6fe58ad47/0_155_2739_1643/master/2739.jpg?width=460&quality=85&auto=format&fit=max&s=c0ad4ce47a2f1badea883afca1a14c61","source_id":"theguardian","category":["sports"],"country":["australia"],"language":"english"},{"title":"“There was a furore in the dressing room”: How a harmless push to Sunil Gavaskar handed English pacer John Snow one-match ban in 1971","link":"https://thesportsrush.com/cricket-news-there-was-a-furore-in-the-dressing-room-how-a-harmless-push-to-sunil-gavaskar-handed-english-pacer-john-snow-one-match-ban-in-1971/","keywords":["Cricket","John Snow","Sunil gavaskar"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Around 50 years ago at the home of Cricket – the iconic Lord’s Cricket Ground in the year 1971, a seemingly harmless push in a bid to run a batter Out handed the bowler one-match suspension, taking the ‘Gentlemen’s game’ adage way too seriously. Under skipper Ajit Wadekar, the legendary batter Sunil Gavaskar, who was… The post “There was a furore in the dressing room”: How a harmless push to Sunil Gavaskar handed English pacer John Snow one-match ban in 1971 appeared first on The SportsRush.","content":"Around 50 years ago at the home of Cricket – the iconic Lord’s Cricket Ground in the year 1971, a seemingly harmless push in a bid to run a batter Out handed the bowler one-match suspension, taking the ‘Gentlemen’s game’ adage way too seriously. Under skipper Ajit Wadekar, the legendary batter Sunil Gavaskar, who was just five Test matches old back then was involved in an incident which as per today’s standards would have been termed as a healthy brand of aggressive Cricket. : It was the final Day of the match with India needing 183 runs to win their first-ever Test on English soil. Before the Lunch Break, with the scorecard reading 47/2, Farokh Engineer bat-paded a pacey delivery bowled by English pacer John Snow towards the forward Short Leg region. Engineer and Gavaskar (at the other end) communicated via their eyes and set off for a risky single. With Gavaskar desperately setting off for the single, and Snow eager to get hold of the ball before the former makes his ground, the duo barged into each other. The replay suggested that Snow did push Gavaskar, enough for him to fall over due to his momentum while losing the bat in hand as well in the process. Snow then sort of flung the bat towards him after he made his to the crease, instead of expressing his concern regarding his well being. The entire incident invited harshest of criticisms from the English purists. While Snow agreed to apologize to Gavaskar straightaway post the Lunch Break, a couple of people from the authority entered the dressing room with their criticisms, angering Snow and the England skipper as well. A livid Snow then decided against apologizing to Gavaskar, thereby further aggravating the matter. Resultantly, he was handed a one-match ban, and had to miss the following Test match at Manchester. “I was just trying to pick up the ball to run him out. I apologized to Sunil, but there was a furore in the dressing room because I did not go down to the Indian dressing room to apologize which I told Alec Bedser [chairman of selectors] I would do. We [Gavaskar and him] were over with it but on a public basis, it was not desirable to cricket,” John Snow would later remark during an interaction with , in 2001. For more Cricket-related news, click .","pubDate":"2023-02-10 18:07:20","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Canadian cricketers prepare for next step on journey to return to ICC World Cup","link":"https://www.nsnews.com/national-sports/canadian-cricketers-prepare-for-next-step-on-journey-to-return-to-icc-world-cup-6522979","keywords":null,"creator":["Neil Davidson"," The Canadian Press"],"video_url":null,"description":"Saad Bin Zafar will captain Canada on a tour of Sri Lanka next month as the Canadian men continue their quest to return to the ICC World Cup.","content":"Saad Bin Zafar will captain Canada on a tour of Sri Lanka next month as the Canadian men continue their quest to return to the ICC World Cup. The Canadians will play four 50-over matches against a Sri Lanka development team on the 19-day tour that starts March 3. The Sri Lanka trip is to prepare for the ICC 2023 World Cup Qualifier Playoff that starts March 24 in Namibia. Selectors have named a 16-man squad for the Sri Lanka tour from which 14 will be chosen to go on to Namibia. The Namibia tournament serves as the penultimate stage of the qualification process for the 2023 World Cup. The top two teams will progress to the final qualifying tournament in Zimbabwe in June that will determine the last two participants in the 10-team World Cup in India in October. The Canadian men last played at the World Cup in 2011, missing out in 2015 and '19. Canada has taken part in four of the previous 12 World Cups, never making it out of the first round. The World Cup is the international championship of one-day cricket, with teams playing 50-over matches. Canada worked hard to get to this stage, advancing to the Namibia event by finishing atop League A in the six-country World Cup Challenge League with a 13-1-0 record with one no-result. Zafar entered the record books in November 2021 when he became the first bowler to bowl four overs without conceding a run in an international T20 match as Canada beat Panama at the ICC Men's T20 World Cup Americas Qualifier in Antigua and Barbuda. Bowlers are restricted to four overs in T20 cricket, meaning Zafar had a perfect day — with four maiden overs. T20 is a swashbuckling shortened form of cricket, with teams each playing innings of 20 overs (with six balls per over). Batsmen are always on the attack, looking to score runs quickly. Australia, for example, averaged 9.18 runs per over in defeating New Zealand to win the 2021 ICC Men's T20 World Cup in Dubai. The Aussies reached the victory target of 173 in the 19th over to win by eight wickets. On the same day some 11,725 kilometres away, Zafar blanked Panama for four overs — delivering 24 balls without cost and taking two wickets in the process. Zafar, who came to Canada from Pakistan at 17, has a background in business administration/finance and used to be a procurement analyst for Aviva Canada, an insurance company. But the 36-year-old from Brampton, Ont., quit, electing to work part-time in auto sales to make more time for his sport while helping pay the bills. He was named man of the match in the final of the inaugural Global T20 Canada tournament in 2018, helping a star-studded Vancouver Knights side to a seven-wicket victory over the West Indies B team in King City, Ont. Zafar took two wickets and scored 79 not out, slamming eight fours and three sixes in a 48-ball innings, in the championship game. He was the Knights' leading wicket-taker in the 2019 tournament in Brampton, where Vancouver finished runner-up to the Winnipeg Hawks. Zafar also earned man of the match honours in a playoff win over the Brampton Wolves that year. Zafar made his Canadian debut in 2008 and has been a regular since 2015. Canada does not have test status so is restricted to T20 and one-day internationals (50 overs). Canada Sri Lanka Tour Squad Saad Bin Zafar (capt.), Navneet Dhaliwal, Nikhil Dutta, Jeremy Gordon, Dillon Heyliger, Aaron Johnson, Ammar Khalid, Nicholas Kirton, Parveen Kumar, Shreyas Movva, Kaleem Sana, Pargat Singh, Ravinderpal Singh, Matthew Spoors, Harsh Thaker, Srimantha Wijeyeratne. Head Coach: Pubudu Dassanayake. Assistant Coach: Abhishek Sharma. Manager: Alphonso Franco Trainer: Ankur Sharma. --- Follow @NeilMDavidson on Twitter This report by The Canadian Press was first published Feb. 10, 2022 Neil Davidson, The Canadian Press","pubDate":"2023-02-10 17:30:49","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/02/2023021009020-62cd3693da84afb4156d5dd0c957e786759345bf70e254d1c724999524bd7a62.jpg;w=960","source_id":"nsnews","category":["sports"],"country":["canada"],"language":"english"}]}