{"newsArray":[{"title":"PAK vs NZ: Babar stars as Pakistan thump New Zealand to top rankings","link":"https://a-sports.tv/pak-vs-nz-babar-stars-as-pakistan-thump-new-zealand-to-top-rankings/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks","Babar Azam"],"creator":["A Sports"],"video_url":null,"description":"KARACHI: Pakistan’s all-format captain Babar Azam’s magnificent century bolstered the home side to breeze past New Zealand in the fourth PAK vs NZ ODI and claimed the top spot in the ICC ODI Team Rankings. Watch PAK vs NZ Live Match in HD Streaming The fourth PAK vs NZ ODI of the five-match series was played […] The post PAK vs NZ: Babar stars as Pakistan thump New Zealand to top rankings appeared first on ASports.tv.","content":"The fourth PAK vs NZ ODI of the five-match series was played here at the National Bank Cricket Arena here on Friday. New Zealand captain Tom Latham opted to bowl first after the coin flipped in his favour. Pakistan, in response, piled up a massive total on the scoreboard on the back of a brilliant century by their captain . Babar smashed 10 boundaries on his way to top score for Pakistan with a 117-ball 107. Besides him, Salman Ali Agha was the other notable run-getter for the hosts as he smashed his second half-century in the format. Agha played a brisk 58-run knock in just 46 deliveries with the help of four boundaries and two sixes. The target set by the green shirts turned out to be too much for as they succumbed to their fourth straight defeat in the ongoing five-match series despite a brilliant half-century by their skipper Latham. Latham remained the top scorer for the touring side with a 76-ball 60, which featured five boundaries.","pubDate":"2023-05-05 18:01:51","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"अब बाबर ने इस मामले में कोहली को पीछे छोड़ा, वेरी-वेरी स्पेशल बन कर दिया \"विराट चैलेंज\"","link":"https://sports.ndtv.com/hindi/cricket/now-babar-azam-left-behind-virat-kohli-in-this-case-included-himself-in-very-special-category-4009678#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ, 4th ODI: बाबर आजम (Babar Azam) ने शुक्रवार को न्यूजीलैंड के खिलाफ 117 गेंदों पर 107 रन की पारी खेलते हुए करियर का 18वां शतक जड़ा.","content":"बाबर और विराट के बीच चैलेंज की एक रेस चल पड़ी है पाकिस्तान के कप्तान बाबर आजम (Babar Azam's mega record) ने शुक्रवार को कराची में न्यूजीलैंड के खिलाफ चौथे वनडे मुकाबले में बाबर आजम ने \"डबल धमाका\" करते हुए न केवल करियर का 18वां शतक जडा, बल्कि वह वनडे इतिहास में हाशिम अमला को पीछे छोड़कर सबसे तेज पांच हजार रन बनाने वाले बल्लेबाज भी बन गए. इसके अलावा उन्होंने एक खास मामले में विराट कोहली (babar left behind virat) को भी पीछे छोड़ दिया. अब यह तो आप जानते ही हैं कि दोनों के चाहने वाले इन दोनों की तुलना एक-दूसरे से करते रहते हैं. हालांकि, यह एकदम साफ है कि कोहली बाबर से रिकॉर्डों के मामले में बाबर से मीलों आगे हैं और पाकिस्तान कप्तान को अभी उनके आस-पास भी पहुंचने के लिए लंबा सफर तय करना होगा, लेकिन शुक्रवार को एक खास पहलू से उन्होंने जरूर विराट को पीछे छोड़ दिया. दरअसल करियर में जड़े 18वें शतक के बाद बाबर आजम वनडे में औसत के मामले में कोहली से आगे निकल गए हैं. अब जहां 274 वनडे मैचों के बाद कोहली का औसत 57.32 का है, तो 98 मैचों की समाप्ति के बाद बाबर आजम का औसत 59.29 का हो चला है, लेकिन खास पहलू कुछ और ही है. और यह पहलू यह है कि अगर कम से कम 40 पारियों को आधार बनाया जाए, तो बाबर वनडे इतिहास में सबसे ज्यादा औसत बनाने वाले बल्लेबाज बन गए हैं. वैसे सर्वश्रेष्ठ औसत के आधार के लिए 40 पारियों का आधार अपने आप में छोटा नहीं है! इस पैमाने के आधार पर अब विराट कोहली दूसरे नंबर पर चले गए हैं. वहीं, 40 पारियों की संख्या के आधार पर ऑस्ट्रेलिया के पूर्व दिग्गज लेफ्टी माइकल बेवेन 53.55 के औसत के साथ तीसरे और दक्षिण अफ्रीका के एबीडि विलियर्स 53.50 के औसत के साथ चौथे नंबर पर हैं. निश्चित तौर पर यह बाबर के बड़ी उपलब्धि हैं, तो कोहली के लिए औसत को खींचना एक बड़ा चैलेंज भी है. कारण यह है कि विराट का वनडे करियर लगभग आखिरी दौर में है, तो वहीं बाबर के पास अभी कई साल बाकी बचे हैं. ऐसे में अभी से ही सबसे कम पारियों में पांच हजार रन और 40 पारियों के आधार पर सर्वश्रेष्ठ औसत एक वह बात है, जो अपने आप में बहुत ही शानदार है. निश्चित तौर पर बाबर ने कोहली के सामने एक विराट चैलेंज रख दिया है. और सवाल यह है कि बचे हुए बाकी करियर में विराट क्या बाबर के वर्तमान औसत को पछाड़ते हुए बाबर के सामने ऐसा औसत रूपी चैलेंज रख पाएंगे, जिसे पार करना पाकिस्तान कप्तान के लिए हमेशा एक बड़ी चुनौती बनी रहे. * * पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-05 17:33:57","image_url":"https://c.ndtvimg.com/2023-05/pl5u625g_babar_625x300_05_May_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023 Points table, Orange and Purple Cap list after Gujarat Titans thrash Rajasthan Royals by 9 wickets","link":"https://www.dnaindia.com/cricket/report-ipl-2023-points-table-orange-and-purple-cap-list-after-gujarat-titans-thrash-rajasthan-royals-by-9-wickets-3040544","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Wriddhiman Saha played a crucial role in the Titans' victory, smashing an unbeaten knock of 41 runs off 34 balls.","content":"In a thrilling encounter at the Sawai Mansingh Stadium in Jaipur on Friday, Gujarat Titans emerged victorious over Rajasthan Royals by nine wickets in Match 48 of IPL 2023. The Titans chased down a target of 119 runs with ease, reaching 119/1 in just 13.5 overs. Wriddhiman Saha played a crucial role in the Titans' victory, smashing an unbeaten knock of 41 runs off 34 balls. Hardik Pandya also contributed significantly, playing a quickfire unbeaten knock of 39 off just 15 deliveries. Yuzvendra Chahal managed to take a wicket for the Royals' bowling department, but it was not enough to stop the Titans from clinching the win. On the other hand, Rajasthan Royals struggled to make an impact with the bat, as they were bowled out for 118 in 17.5 overs. Sanju Samson was the only player who managed to make a significant contribution, registering 30 runs off 20 balls, packed with three fours and a six. Rashid Khan was in hot form for the Titans, taking three wickets, while Noor Ahmad scalped two dismissals. Overall, it was a dominant performance by the Gujarat Titans, who showcased their batting prowess and bowling prowess to secure a convincing victory over the Rajasthan Royals. IPL 2023 Points Table after GT win 1. Gujarat Titans (PTS 14, NRR +0.752) 2. Lucknow Super Giants (PTS 11, NRR +0.639) 3. Chennai Super Kings (PTS 11, NRR +0.329) 4. Rajasthan Royals (PTS 10, NRR +0.448) 5. Royal Challengers Bangalore (PTS 10, NRR -0.030) 6. Mumbai Indians (PTS 10, NRR -0.373) 7. Punjab Kings (PTS 10, NRR -0.472) 8. Kolkata Knight Riders (PTS 8, NRR -0.103) 9. Sunrisers Hyderabad (PTS 6, NRR -0.540) 10. Delhi Capitals (PTS 6, NRR -0.768) IPL 2023 Orange Cap List 1. Faf du Plessis - 466 runs 2. Yashasvi Jaiswal - 442 runs 3. Devon Conway - 414 runs 4. Shubman Gill - 375 runs 5. Ruturaj Gaikwad - 354 runs IPL 2023 Purple Cap List 1. Mohammed Shami - 17 wickets 2. Tushar Deshpande - 17 wickets 3. Arshdeep Singh - 16 wickets 4. Piyush Chawla - 15 wickets 5. Mohammed Siraj - 15 wickets READ| IPL 2023: Rashid Khan’s fiery spell, Hardik Pandya's batting help Gujarat Titans defeat Rajasthan Royals","pubDate":"2023-05-05 17:32:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Rashid Khan's fiery spell, Hardik Pandya's batting help Gujarat Titans defeat Rajasthan Royals","link":"https://www.dnaindia.com/cricket/report-ipl-2023-rashid-khan-fiery-spell-hardik-pandya-batting-help-gujarat-titans-defeat-rajasthan-royals-3040542","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Gujarat Titans delivered a clinical performance, bouncing back from their recent loss to Delhi Capitals.","content":"Gujarat Titans secured a crucial victory against Rajasthan Royals at the Sawai Mansingh Stadium in Jaipur, consolidating their position at the top of the IPL 2023 points table and moving closer to the playoffs. The defending champions chased down a modest total of 119 to take their tally to 14 points from 10 matches. Gujarat Titans delivered a clinical performance, bouncing back from their recent loss to Delhi Capitals. Despite falling short by just 5 runs in that match, the Titans were determined to come out on top against Rajasthan Royals. Mohammed Shami, who was named man-of-the-match for his four-wicket haul against DC, had previously expressed concern that the team had become too relaxed. However, against the Royals, the Titans were ruthless. That was some performance by @gujarat_titans #GT win the match by 9 wickets and add another 2 points to their tally Scorecard https://t.co/54xkkylMlx #TATAIPL | #RRvGT pic.twitter.com/fJKu9gmvLW — IndianPremierLeague (@IPL) May 5, 2023 Rashid Khan and Noor Ahmad spun a web around the RR batters, taking three and two wickets respectively. Shubman Gill and Wriddhiman Saha then added 71 for the first wicket, leaving little for the Royals to defend after a strong opening partnership. Yuzvendra Chahal dismissed Gill for 36, but it was too little too late for the Royals. Hardik Pandya, who had regretted not finishing off the chase against Delhi Capitals, was determined to make amends. He hit Adam Zampa for 23 runs off just five balls, helping the Titans edge closer to a comprehensive victory. Overall, it was an impressive performance by Gujarat Titans, who demonstrated their ability to bounce back from a defeat and deliver a dominant performance. With their eyes firmly set on the playoffs, the Titans will be looking to maintain their momentum in the coming matches. READ| 'He will not do anything in our favour': Shahid Afridi on PM Modi","pubDate":"2023-05-05 17:08:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 GT Vs RR: Royals succumb to Afghan spinners, bundled out to 118 against Titans","link":"https://www.livemint.com/sports/cricket-news/ipl-2023-gt-vs-rr-royals-succumb-to-afghan-spinners-bundled-out-to-118-against-titans-11683305997689.html","keywords":null,"creator":null,"video_url":null,"description":"RR's batting unit collapsed as no batter stepped up to fight against GT's firing bowling attack.","content":null,"pubDate":"2023-05-05 17:04:07","image_url":"https://www.livemint.com/lm-img/img/2023/05/05/1600x900/Noor_Ahmad_1683306203329_1683306203448.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"KL Rahul ruled out of IPL 2023, WTC final","link":"https://www.thehansindia.com/sports/cricket/kl-rahul-ruled-out-of-ipl-2023-wtc-final-796094","keywords":["Sports,Cricket"],"creator":["Sakshi Gupta"],"video_url":null,"description":"KL Rahul picked up an injury during a game against RCBHe has left the LSG camp and is in Mumbai now Rahul scored 274 runs in 9 matches in IPL 2023","content":"KL Rahul ruled out of IPL 2023, WTC finalKL Rahul ruled out of IPL 2023, WTC finalLucknow Super Giants (LSG) captain KL Rahul has been ruled out of the Indian Premier League (IPL) 2023, the Indian batsmen announced on Friday. Rahul took to Instagram to reveal that he will be undergoing surgery on his thigh. He has left the LSG camp and is in Mumbai now as the Board of Control for Cricket in India (BCCI) has taken over his case. Rahul wrote on an Instagram post: “After careful consideration and consultation with the medical team, it's been concluded that I'll be undergoing a surgery on my thigh shortly. My focus will be on my rehabilitation and recovery in the coming weeks. It's a tough call to make, but I know it's the right one to ensure a full recovery.” Continuing further, Rahul said as a team captain, “it pains me deeply not to be able to be there during this crucial period. But, I'm confident that the boys will rise to the occasion and give their best performance as always. I'll be cheering for them from the sidelines with all of you, watching every game.” LSG have four group games left in the IPL 2023. At present, they are placed second in the table with 11 points after 10 matches. The LSG captain suffered an injury during a game against Royal Challengers Bangalore (RCB) earlier in the IPL 2023. While fielding in the first innings, the 31-year-old tore a tendon in his right leg while fielding against RCB earlier this week. Although he did return to bat at No.11 later in the game, Rahul was in visible discomfort and could not run between the wickets. A surgery in the coming days mean, the wicketkeeper-batsman has also been ruled out of India’s World Test Championship (WTC) against Australia, which will be played from June 7 at The Oval, London. “Absolutely gutted that I won't be at the Oval next month with Team India. I'll do everything I can to get back in blue and help my country. That has always been my focus and priority,” added Rahul. “I want to express gratitude to each one of you - my fans, that gave me the strength to get back up, the LSG management and the BCCI for their promptness, and my teammates for their unwavering support during this difficult time. “Your encouragement and messages mean a lot to me and motivate me to come back stronger and fitter than ever before,” concluded Rahul. Rahul had undergone hernia surgery just around 10 months ago in Germany, and it is understood that all factors are being taken into consideration. The India batter Rahul accumulated 274 runs in nine innings at an average of 34.25 in IPL 2023, while the LSG management has not taken a call if it will seek a replacement for him. ","pubDate":"2023-05-05 16:15:01","image_url":"https://assets.thehansindia.com/h-upload/2023/05/05/500x300_1350007-kl-rahul.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Rajasthan Royals win toss, opt to bat against Gujarat Titans","link":"https://thenewsmill.com/2023/05/ipl-2023-rajasthan-royals-win-toss-opt-to-bat-against-gujarat-titans/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Rajasthan Royals captain Sanju Samson won the toss and opted to bat against Gujarat Titans here at the IPL match at Sawai Mansingh Stadium in Jaipur on Friday. Sanju Samson-led RR currently are at the fourth spot in the IPL 2023 points table with 10 points in nine matches they played. Hardik Pandya’s Gujarat Titans hold the top position in the points table with 12 points in 9 matches. “We would like to bat first. It’s a bit hard to read this pitch. Let’s bat a few overs and figure it out later. The standard of cricket we are playing is really good. We were expecting something like this from Jaiswal with the prep he had been putting in. Adam Zampa comes in place of Jason Holder,” Rajasthan Royals captain Sanju Samson said at the time of toss. Gujarat Titans captain Hardik Pandya said there is no change in the side. ” We were going to bat first as well. If the home captain does not know to what to choose, I thought might as well bowl and see what happens. They are a strong, consistent side. We have to be at our best. I don’t think so (smiles, when asked about changes to his side),” he said. Rajasthan Royals (Playing XI): Yashasvi Jaiswal, Jos Buttler, Sanju Samson(w/c), Devdutt Padikkal, Shimron Hetmyer, Dhruv Jurel, Ravichandran Ashwin, Trent Boult, Adam Zampa, Sandeep Sharma and Yuzvendra Chahal. Rajasthan Royals Subs: Murugan Ashwin, Joe Root, Riyan Parag, Kuldip Yadav and KM Asif. Gujarat Titans (Playing XI): Wriddhiman Saha(w), Hardik Pandya(c), Vijay Shankar, David Miller, Abhinav Manohar, Rahul Tewatia, Rashid Khan, Mohit Sharma, Noor Ahmad, Mohammed Shami and Joshua Little. Gujarat Titans Subs: Shubman Gill, Sai Sudharsan, Srikar Bharat, Shivam Mavi and Ravisrinivasan Sai Kishore. (ANI)","pubDate":"2023-05-05 14:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Watch: Rishabh Pant throws crutches, walks on his own","link":"https://www.livemint.com/sports/cricket-news/watch-rishabh-pant-throws-crutches-walks-on-his-own-11683295979274.html","keywords":null,"creator":null,"video_url":null,"description":"On 5 May too, Pant updated the fans with a major breakthrough in his recovery and was seen walking without support.","content":null,"pubDate":"2023-05-05 14:16:03","image_url":"https://www.livemint.com/lm-img/img/2023/05/05/1600x900/Rishabh_Pant_1683296062301_1683296062589.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC Final से पहले चेतेश्‍वर पुजारा की कप्‍तानी में खेले स्‍टीव स्मिथ, बनाई 59 रन की साझेदारी, कौन किसपर भारी?","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-cheteshwar-pujara-steve-smith-play-together-for-sussex-county-club-ahead-of-india-vs-australia-test-championship-clash-6104035.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"स्‍टीव स्मिथ और चेतेश्‍वर पुजारा ससेक्‍स काउंटी क्‍लब का हिस्‍सा हैं. पुजारा इस टीम की कप्‍तानी भी कर रहे हैं. दोनों एक साथ बैटिंग करते हुए नजर आए. एक महीने बाद भारत और ऑस्‍ट्रेलिया के बीच होने वाले वर्ल्‍ड टेस्‍ट चैंपियनशिप के फाइनल में दोनों एक दूसरे के खिलाफ मैदान में उतरेंगे.","content":null,"pubDate":"2023-05-05 13:51:34","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Cheteshwar-Pujara-Steve-Smith-Partnership-16832945843x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RR vs GT Live Score: राजस्थान को लगा पहला झटका, जोस बटलर हुए आउट","link":"https://hindi.news18.com/news/sports/cricket-rr-vs-gt-live-score-ipl-2023-rajasthan-royals-vs-gujarat-titans-scorecard-sanju-samson-vs-hardik-pandya-6103701.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"RR vs GT Live Score: आईपीएल के इतिहास में राजस्थान रॉयल्स और गुजरात टाइटंस की टीम अबतक चार बार आमने-सामने हुई है. इस दौरान राजस्थान के खिलाफ गुजरात का पलड़ा भारी रहा है. गुजरात को जहां राजस्थान के खिलाफ तीन मुकाबलों में जीत मिली है. वहीं राजस्थान की टीम गुजरात के खिलाफ महज एक मैच में सफलता हासिल कर सकी है.","content":null,"pubDate":"2023-05-05 13:31:28","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/GT-vs-RR-LIVE_05_05-16832933433x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"PAK vs NZ: Babar stars as Pakistan thump New Zealand to top rankings","link":"https://a-sports.tv/pak-vs-nz-babar-stars-as-pakistan-thump-new-zealand-to-top-rankings/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks","Babar Azam"],"creator":["A Sports"],"video_url":null,"description":"KARACHI: Pakistan’s all-format captain Babar Azam’s magnificent century bolstered the home side to breeze past New Zealand in the fourth PAK vs NZ ODI and claimed the top spot in the ICC ODI Team Rankings. Watch PAK vs NZ Live Match in HD Streaming The fourth PAK vs NZ ODI of the five-match series was played […] The post PAK vs NZ: Babar stars as Pakistan thump New Zealand to top rankings appeared first on ASports.tv.","content":"The fourth PAK vs NZ ODI of the five-match series was played here at the National Bank Cricket Arena here on Friday. New Zealand captain Tom Latham opted to bowl first after the coin flipped in his favour. Pakistan, in response, piled up a massive total on the scoreboard on the back of a brilliant century by their captain . Babar smashed 10 boundaries on his way to top score for Pakistan with a 117-ball 107. Besides him, Salman Ali Agha was the other notable run-getter for the hosts as he smashed his second half-century in the format. Agha played a brisk 58-run knock in just 46 deliveries with the help of four boundaries and two sixes. The target set by the green shirts turned out to be too much for as they succumbed to their fourth straight defeat in the ongoing five-match series despite a brilliant half-century by their skipper Latham. Latham remained the top scorer for the touring side with a 76-ball 60, which featured five boundaries.","pubDate":"2023-05-05 18:01:51","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"अब बाबर ने इस मामले में कोहली को पीछे छोड़ा, वेरी-वेरी स्पेशल बन कर दिया \"विराट चैलेंज\"","link":"https://sports.ndtv.com/hindi/cricket/now-babar-azam-left-behind-virat-kohli-in-this-case-included-himself-in-very-special-category-4009678#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ, 4th ODI: बाबर आजम (Babar Azam) ने शुक्रवार को न्यूजीलैंड के खिलाफ 117 गेंदों पर 107 रन की पारी खेलते हुए करियर का 18वां शतक जड़ा.","content":"बाबर और विराट के बीच चैलेंज की एक रेस चल पड़ी है पाकिस्तान के कप्तान बाबर आजम (Babar Azam's mega record) ने शुक्रवार को कराची में न्यूजीलैंड के खिलाफ चौथे वनडे मुकाबले में बाबर आजम ने \"डबल धमाका\" करते हुए न केवल करियर का 18वां शतक जडा, बल्कि वह वनडे इतिहास में हाशिम अमला को पीछे छोड़कर सबसे तेज पांच हजार रन बनाने वाले बल्लेबाज भी बन गए. इसके अलावा उन्होंने एक खास मामले में विराट कोहली (babar left behind virat) को भी पीछे छोड़ दिया. अब यह तो आप जानते ही हैं कि दोनों के चाहने वाले इन दोनों की तुलना एक-दूसरे से करते रहते हैं. हालांकि, यह एकदम साफ है कि कोहली बाबर से रिकॉर्डों के मामले में बाबर से मीलों आगे हैं और पाकिस्तान कप्तान को अभी उनके आस-पास भी पहुंचने के लिए लंबा सफर तय करना होगा, लेकिन शुक्रवार को एक खास पहलू से उन्होंने जरूर विराट को पीछे छोड़ दिया. दरअसल करियर में जड़े 18वें शतक के बाद बाबर आजम वनडे में औसत के मामले में कोहली से आगे निकल गए हैं. अब जहां 274 वनडे मैचों के बाद कोहली का औसत 57.32 का है, तो 98 मैचों की समाप्ति के बाद बाबर आजम का औसत 59.29 का हो चला है, लेकिन खास पहलू कुछ और ही है. और यह पहलू यह है कि अगर कम से कम 40 पारियों को आधार बनाया जाए, तो बाबर वनडे इतिहास में सबसे ज्यादा औसत बनाने वाले बल्लेबाज बन गए हैं. वैसे सर्वश्रेष्ठ औसत के आधार के लिए 40 पारियों का आधार अपने आप में छोटा नहीं है! इस पैमाने के आधार पर अब विराट कोहली दूसरे नंबर पर चले गए हैं. वहीं, 40 पारियों की संख्या के आधार पर ऑस्ट्रेलिया के पूर्व दिग्गज लेफ्टी माइकल बेवेन 53.55 के औसत के साथ तीसरे और दक्षिण अफ्रीका के एबीडि विलियर्स 53.50 के औसत के साथ चौथे नंबर पर हैं. निश्चित तौर पर यह बाबर के बड़ी उपलब्धि हैं, तो कोहली के लिए औसत को खींचना एक बड़ा चैलेंज भी है. कारण यह है कि विराट का वनडे करियर लगभग आखिरी दौर में है, तो वहीं बाबर के पास अभी कई साल बाकी बचे हैं. ऐसे में अभी से ही सबसे कम पारियों में पांच हजार रन और 40 पारियों के आधार पर सर्वश्रेष्ठ औसत एक वह बात है, जो अपने आप में बहुत ही शानदार है. निश्चित तौर पर बाबर ने कोहली के सामने एक विराट चैलेंज रख दिया है. और सवाल यह है कि बचे हुए बाकी करियर में विराट क्या बाबर के वर्तमान औसत को पछाड़ते हुए बाबर के सामने ऐसा औसत रूपी चैलेंज रख पाएंगे, जिसे पार करना पाकिस्तान कप्तान के लिए हमेशा एक बड़ी चुनौती बनी रहे. * * पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-05 17:33:57","image_url":"https://c.ndtvimg.com/2023-05/pl5u625g_babar_625x300_05_May_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023 Points table, Orange and Purple Cap list after Gujarat Titans thrash Rajasthan Royals by 9 wickets","link":"https://www.dnaindia.com/cricket/report-ipl-2023-points-table-orange-and-purple-cap-list-after-gujarat-titans-thrash-rajasthan-royals-by-9-wickets-3040544","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Wriddhiman Saha played a crucial role in the Titans' victory, smashing an unbeaten knock of 41 runs off 34 balls.","content":"In a thrilling encounter at the Sawai Mansingh Stadium in Jaipur on Friday, Gujarat Titans emerged victorious over Rajasthan Royals by nine wickets in Match 48 of IPL 2023. The Titans chased down a target of 119 runs with ease, reaching 119/1 in just 13.5 overs. Wriddhiman Saha played a crucial role in the Titans' victory, smashing an unbeaten knock of 41 runs off 34 balls. Hardik Pandya also contributed significantly, playing a quickfire unbeaten knock of 39 off just 15 deliveries. Yuzvendra Chahal managed to take a wicket for the Royals' bowling department, but it was not enough to stop the Titans from clinching the win. On the other hand, Rajasthan Royals struggled to make an impact with the bat, as they were bowled out for 118 in 17.5 overs. Sanju Samson was the only player who managed to make a significant contribution, registering 30 runs off 20 balls, packed with three fours and a six. Rashid Khan was in hot form for the Titans, taking three wickets, while Noor Ahmad scalped two dismissals. Overall, it was a dominant performance by the Gujarat Titans, who showcased their batting prowess and bowling prowess to secure a convincing victory over the Rajasthan Royals. IPL 2023 Points Table after GT win 1. Gujarat Titans (PTS 14, NRR +0.752) 2. Lucknow Super Giants (PTS 11, NRR +0.639) 3. Chennai Super Kings (PTS 11, NRR +0.329) 4. Rajasthan Royals (PTS 10, NRR +0.448) 5. Royal Challengers Bangalore (PTS 10, NRR -0.030) 6. Mumbai Indians (PTS 10, NRR -0.373) 7. Punjab Kings (PTS 10, NRR -0.472) 8. Kolkata Knight Riders (PTS 8, NRR -0.103) 9. Sunrisers Hyderabad (PTS 6, NRR -0.540) 10. Delhi Capitals (PTS 6, NRR -0.768) IPL 2023 Orange Cap List 1. Faf du Plessis - 466 runs 2. Yashasvi Jaiswal - 442 runs 3. Devon Conway - 414 runs 4. Shubman Gill - 375 runs 5. Ruturaj Gaikwad - 354 runs IPL 2023 Purple Cap List 1. Mohammed Shami - 17 wickets 2. Tushar Deshpande - 17 wickets 3. Arshdeep Singh - 16 wickets 4. Piyush Chawla - 15 wickets 5. Mohammed Siraj - 15 wickets READ| IPL 2023: Rashid Khan’s fiery spell, Hardik Pandya's batting help Gujarat Titans defeat Rajasthan Royals","pubDate":"2023-05-05 17:32:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Rashid Khan's fiery spell, Hardik Pandya's batting help Gujarat Titans defeat Rajasthan Royals","link":"https://www.dnaindia.com/cricket/report-ipl-2023-rashid-khan-fiery-spell-hardik-pandya-batting-help-gujarat-titans-defeat-rajasthan-royals-3040542","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Gujarat Titans delivered a clinical performance, bouncing back from their recent loss to Delhi Capitals.","content":"Gujarat Titans secured a crucial victory against Rajasthan Royals at the Sawai Mansingh Stadium in Jaipur, consolidating their position at the top of the IPL 2023 points table and moving closer to the playoffs. The defending champions chased down a modest total of 119 to take their tally to 14 points from 10 matches. Gujarat Titans delivered a clinical performance, bouncing back from their recent loss to Delhi Capitals. Despite falling short by just 5 runs in that match, the Titans were determined to come out on top against Rajasthan Royals. Mohammed Shami, who was named man-of-the-match for his four-wicket haul against DC, had previously expressed concern that the team had become too relaxed. However, against the Royals, the Titans were ruthless. That was some performance by @gujarat_titans #GT win the match by 9 wickets and add another 2 points to their tally Scorecard https://t.co/54xkkylMlx #TATAIPL | #RRvGT pic.twitter.com/fJKu9gmvLW — IndianPremierLeague (@IPL) May 5, 2023 Rashid Khan and Noor Ahmad spun a web around the RR batters, taking three and two wickets respectively. Shubman Gill and Wriddhiman Saha then added 71 for the first wicket, leaving little for the Royals to defend after a strong opening partnership. Yuzvendra Chahal dismissed Gill for 36, but it was too little too late for the Royals. Hardik Pandya, who had regretted not finishing off the chase against Delhi Capitals, was determined to make amends. He hit Adam Zampa for 23 runs off just five balls, helping the Titans edge closer to a comprehensive victory. Overall, it was an impressive performance by Gujarat Titans, who demonstrated their ability to bounce back from a defeat and deliver a dominant performance. With their eyes firmly set on the playoffs, the Titans will be looking to maintain their momentum in the coming matches. READ| 'He will not do anything in our favour': Shahid Afridi on PM Modi","pubDate":"2023-05-05 17:08:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 GT Vs RR: Royals succumb to Afghan spinners, bundled out to 118 against Titans","link":"https://www.livemint.com/sports/cricket-news/ipl-2023-gt-vs-rr-royals-succumb-to-afghan-spinners-bundled-out-to-118-against-titans-11683305997689.html","keywords":null,"creator":null,"video_url":null,"description":"RR's batting unit collapsed as no batter stepped up to fight against GT's firing bowling attack.","content":null,"pubDate":"2023-05-05 17:04:07","image_url":"https://www.livemint.com/lm-img/img/2023/05/05/1600x900/Noor_Ahmad_1683306203329_1683306203448.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"KL Rahul ruled out of IPL 2023, WTC final","link":"https://www.thehansindia.com/sports/cricket/kl-rahul-ruled-out-of-ipl-2023-wtc-final-796094","keywords":["Sports,Cricket"],"creator":["Sakshi Gupta"],"video_url":null,"description":"KL Rahul picked up an injury during a game against RCBHe has left the LSG camp and is in Mumbai now Rahul scored 274 runs in 9 matches in IPL 2023","content":"KL Rahul ruled out of IPL 2023, WTC finalKL Rahul ruled out of IPL 2023, WTC finalLucknow Super Giants (LSG) captain KL Rahul has been ruled out of the Indian Premier League (IPL) 2023, the Indian batsmen announced on Friday. Rahul took to Instagram to reveal that he will be undergoing surgery on his thigh. He has left the LSG camp and is in Mumbai now as the Board of Control for Cricket in India (BCCI) has taken over his case. Rahul wrote on an Instagram post: “After careful consideration and consultation with the medical team, it's been concluded that I'll be undergoing a surgery on my thigh shortly. My focus will be on my rehabilitation and recovery in the coming weeks. It's a tough call to make, but I know it's the right one to ensure a full recovery.” Continuing further, Rahul said as a team captain, “it pains me deeply not to be able to be there during this crucial period. But, I'm confident that the boys will rise to the occasion and give their best performance as always. I'll be cheering for them from the sidelines with all of you, watching every game.” LSG have four group games left in the IPL 2023. At present, they are placed second in the table with 11 points after 10 matches. The LSG captain suffered an injury during a game against Royal Challengers Bangalore (RCB) earlier in the IPL 2023. While fielding in the first innings, the 31-year-old tore a tendon in his right leg while fielding against RCB earlier this week. Although he did return to bat at No.11 later in the game, Rahul was in visible discomfort and could not run between the wickets. A surgery in the coming days mean, the wicketkeeper-batsman has also been ruled out of India’s World Test Championship (WTC) against Australia, which will be played from June 7 at The Oval, London. “Absolutely gutted that I won't be at the Oval next month with Team India. I'll do everything I can to get back in blue and help my country. That has always been my focus and priority,” added Rahul. “I want to express gratitude to each one of you - my fans, that gave me the strength to get back up, the LSG management and the BCCI for their promptness, and my teammates for their unwavering support during this difficult time. “Your encouragement and messages mean a lot to me and motivate me to come back stronger and fitter than ever before,” concluded Rahul. Rahul had undergone hernia surgery just around 10 months ago in Germany, and it is understood that all factors are being taken into consideration. The India batter Rahul accumulated 274 runs in nine innings at an average of 34.25 in IPL 2023, while the LSG management has not taken a call if it will seek a replacement for him. ","pubDate":"2023-05-05 16:15:01","image_url":"https://assets.thehansindia.com/h-upload/2023/05/05/500x300_1350007-kl-rahul.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Rajasthan Royals win toss, opt to bat against Gujarat Titans","link":"https://thenewsmill.com/2023/05/ipl-2023-rajasthan-royals-win-toss-opt-to-bat-against-gujarat-titans/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Rajasthan Royals captain Sanju Samson won the toss and opted to bat against Gujarat Titans here at the IPL match at Sawai Mansingh Stadium in Jaipur on Friday. Sanju Samson-led RR currently are at the fourth spot in the IPL 2023 points table with 10 points in nine matches they played. Hardik Pandya’s Gujarat Titans hold the top position in the points table with 12 points in 9 matches. “We would like to bat first. It’s a bit hard to read this pitch. Let’s bat a few overs and figure it out later. The standard of cricket we are playing is really good. We were expecting something like this from Jaiswal with the prep he had been putting in. Adam Zampa comes in place of Jason Holder,” Rajasthan Royals captain Sanju Samson said at the time of toss. Gujarat Titans captain Hardik Pandya said there is no change in the side. ” We were going to bat first as well. If the home captain does not know to what to choose, I thought might as well bowl and see what happens. They are a strong, consistent side. We have to be at our best. I don’t think so (smiles, when asked about changes to his side),” he said. Rajasthan Royals (Playing XI): Yashasvi Jaiswal, Jos Buttler, Sanju Samson(w/c), Devdutt Padikkal, Shimron Hetmyer, Dhruv Jurel, Ravichandran Ashwin, Trent Boult, Adam Zampa, Sandeep Sharma and Yuzvendra Chahal. Rajasthan Royals Subs: Murugan Ashwin, Joe Root, Riyan Parag, Kuldip Yadav and KM Asif. Gujarat Titans (Playing XI): Wriddhiman Saha(w), Hardik Pandya(c), Vijay Shankar, David Miller, Abhinav Manohar, Rahul Tewatia, Rashid Khan, Mohit Sharma, Noor Ahmad, Mohammed Shami and Joshua Little. Gujarat Titans Subs: Shubman Gill, Sai Sudharsan, Srikar Bharat, Shivam Mavi and Ravisrinivasan Sai Kishore. (ANI)","pubDate":"2023-05-05 14:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Watch: Rishabh Pant throws crutches, walks on his own","link":"https://www.livemint.com/sports/cricket-news/watch-rishabh-pant-throws-crutches-walks-on-his-own-11683295979274.html","keywords":null,"creator":null,"video_url":null,"description":"On 5 May too, Pant updated the fans with a major breakthrough in his recovery and was seen walking without support.","content":null,"pubDate":"2023-05-05 14:16:03","image_url":"https://www.livemint.com/lm-img/img/2023/05/05/1600x900/Rishabh_Pant_1683296062301_1683296062589.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC Final से पहले चेतेश्‍वर पुजारा की कप्‍तानी में खेले स्‍टीव स्मिथ, बनाई 59 रन की साझेदारी, कौन किसपर भारी?","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-cheteshwar-pujara-steve-smith-play-together-for-sussex-county-club-ahead-of-india-vs-australia-test-championship-clash-6104035.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"स्‍टीव स्मिथ और चेतेश्‍वर पुजारा ससेक्‍स काउंटी क्‍लब का हिस्‍सा हैं. पुजारा इस टीम की कप्‍तानी भी कर रहे हैं. दोनों एक साथ बैटिंग करते हुए नजर आए. एक महीने बाद भारत और ऑस्‍ट्रेलिया के बीच होने वाले वर्ल्‍ड टेस्‍ट चैंपियनशिप के फाइनल में दोनों एक दूसरे के खिलाफ मैदान में उतरेंगे.","content":null,"pubDate":"2023-05-05 13:51:34","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Cheteshwar-Pujara-Steve-Smith-Partnership-16832945843x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RR vs GT Live Score: राजस्थान को लगा पहला झटका, जोस बटलर हुए आउट","link":"https://hindi.news18.com/news/sports/cricket-rr-vs-gt-live-score-ipl-2023-rajasthan-royals-vs-gujarat-titans-scorecard-sanju-samson-vs-hardik-pandya-6103701.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"RR vs GT Live Score: आईपीएल के इतिहास में राजस्थान रॉयल्स और गुजरात टाइटंस की टीम अबतक चार बार आमने-सामने हुई है. इस दौरान राजस्थान के खिलाफ गुजरात का पलड़ा भारी रहा है. गुजरात को जहां राजस्थान के खिलाफ तीन मुकाबलों में जीत मिली है. वहीं राजस्थान की टीम गुजरात के खिलाफ महज एक मैच में सफलता हासिल कर सकी है.","content":null,"pubDate":"2023-05-05 13:31:28","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/GT-vs-RR-LIVE_05_05-16832933433x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"PAK vs NZ: Babar stars as Pakistan thump New Zealand to top rankings","link":"https://a-sports.tv/pak-vs-nz-babar-stars-as-pakistan-thump-new-zealand-to-top-rankings/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks","Babar Azam"],"creator":["A Sports"],"video_url":null,"description":"KARACHI: Pakistan’s all-format captain Babar Azam’s magnificent century bolstered the home side to breeze past New Zealand in the fourth PAK vs NZ ODI and claimed the top spot in the ICC ODI Team Rankings. Watch PAK vs NZ Live Match in HD Streaming The fourth PAK vs NZ ODI of the five-match series was played […] The post PAK vs NZ: Babar stars as Pakistan thump New Zealand to top rankings appeared first on ASports.tv.","content":"The fourth PAK vs NZ ODI of the five-match series was played here at the National Bank Cricket Arena here on Friday. New Zealand captain Tom Latham opted to bowl first after the coin flipped in his favour. Pakistan, in response, piled up a massive total on the scoreboard on the back of a brilliant century by their captain . Babar smashed 10 boundaries on his way to top score for Pakistan with a 117-ball 107. Besides him, Salman Ali Agha was the other notable run-getter for the hosts as he smashed his second half-century in the format. Agha played a brisk 58-run knock in just 46 deliveries with the help of four boundaries and two sixes. The target set by the green shirts turned out to be too much for as they succumbed to their fourth straight defeat in the ongoing five-match series despite a brilliant half-century by their skipper Latham. Latham remained the top scorer for the touring side with a 76-ball 60, which featured five boundaries.","pubDate":"2023-05-05 18:01:51","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"अब बाबर ने इस मामले में कोहली को पीछे छोड़ा, वेरी-वेरी स्पेशल बन कर दिया \"विराट चैलेंज\"","link":"https://sports.ndtv.com/hindi/cricket/now-babar-azam-left-behind-virat-kohli-in-this-case-included-himself-in-very-special-category-4009678#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ, 4th ODI: बाबर आजम (Babar Azam) ने शुक्रवार को न्यूजीलैंड के खिलाफ 117 गेंदों पर 107 रन की पारी खेलते हुए करियर का 18वां शतक जड़ा.","content":"बाबर और विराट के बीच चैलेंज की एक रेस चल पड़ी है पाकिस्तान के कप्तान बाबर आजम (Babar Azam's mega record) ने शुक्रवार को कराची में न्यूजीलैंड के खिलाफ चौथे वनडे मुकाबले में बाबर आजम ने \"डबल धमाका\" करते हुए न केवल करियर का 18वां शतक जडा, बल्कि वह वनडे इतिहास में हाशिम अमला को पीछे छोड़कर सबसे तेज पांच हजार रन बनाने वाले बल्लेबाज भी बन गए. इसके अलावा उन्होंने एक खास मामले में विराट कोहली (babar left behind virat) को भी पीछे छोड़ दिया. अब यह तो आप जानते ही हैं कि दोनों के चाहने वाले इन दोनों की तुलना एक-दूसरे से करते रहते हैं. हालांकि, यह एकदम साफ है कि कोहली बाबर से रिकॉर्डों के मामले में बाबर से मीलों आगे हैं और पाकिस्तान कप्तान को अभी उनके आस-पास भी पहुंचने के लिए लंबा सफर तय करना होगा, लेकिन शुक्रवार को एक खास पहलू से उन्होंने जरूर विराट को पीछे छोड़ दिया. दरअसल करियर में जड़े 18वें शतक के बाद बाबर आजम वनडे में औसत के मामले में कोहली से आगे निकल गए हैं. अब जहां 274 वनडे मैचों के बाद कोहली का औसत 57.32 का है, तो 98 मैचों की समाप्ति के बाद बाबर आजम का औसत 59.29 का हो चला है, लेकिन खास पहलू कुछ और ही है. और यह पहलू यह है कि अगर कम से कम 40 पारियों को आधार बनाया जाए, तो बाबर वनडे इतिहास में सबसे ज्यादा औसत बनाने वाले बल्लेबाज बन गए हैं. वैसे सर्वश्रेष्ठ औसत के आधार के लिए 40 पारियों का आधार अपने आप में छोटा नहीं है! इस पैमाने के आधार पर अब विराट कोहली दूसरे नंबर पर चले गए हैं. वहीं, 40 पारियों की संख्या के आधार पर ऑस्ट्रेलिया के पूर्व दिग्गज लेफ्टी माइकल बेवेन 53.55 के औसत के साथ तीसरे और दक्षिण अफ्रीका के एबीडि विलियर्स 53.50 के औसत के साथ चौथे नंबर पर हैं. निश्चित तौर पर यह बाबर के बड़ी उपलब्धि हैं, तो कोहली के लिए औसत को खींचना एक बड़ा चैलेंज भी है. कारण यह है कि विराट का वनडे करियर लगभग आखिरी दौर में है, तो वहीं बाबर के पास अभी कई साल बाकी बचे हैं. ऐसे में अभी से ही सबसे कम पारियों में पांच हजार रन और 40 पारियों के आधार पर सर्वश्रेष्ठ औसत एक वह बात है, जो अपने आप में बहुत ही शानदार है. निश्चित तौर पर बाबर ने कोहली के सामने एक विराट चैलेंज रख दिया है. और सवाल यह है कि बचे हुए बाकी करियर में विराट क्या बाबर के वर्तमान औसत को पछाड़ते हुए बाबर के सामने ऐसा औसत रूपी चैलेंज रख पाएंगे, जिसे पार करना पाकिस्तान कप्तान के लिए हमेशा एक बड़ी चुनौती बनी रहे. * * पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-05 17:33:57","image_url":"https://c.ndtvimg.com/2023-05/pl5u625g_babar_625x300_05_May_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023 Points table, Orange and Purple Cap list after Gujarat Titans thrash Rajasthan Royals by 9 wickets","link":"https://www.dnaindia.com/cricket/report-ipl-2023-points-table-orange-and-purple-cap-list-after-gujarat-titans-thrash-rajasthan-royals-by-9-wickets-3040544","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Wriddhiman Saha played a crucial role in the Titans' victory, smashing an unbeaten knock of 41 runs off 34 balls.","content":"In a thrilling encounter at the Sawai Mansingh Stadium in Jaipur on Friday, Gujarat Titans emerged victorious over Rajasthan Royals by nine wickets in Match 48 of IPL 2023. The Titans chased down a target of 119 runs with ease, reaching 119/1 in just 13.5 overs. Wriddhiman Saha played a crucial role in the Titans' victory, smashing an unbeaten knock of 41 runs off 34 balls. Hardik Pandya also contributed significantly, playing a quickfire unbeaten knock of 39 off just 15 deliveries. Yuzvendra Chahal managed to take a wicket for the Royals' bowling department, but it was not enough to stop the Titans from clinching the win. On the other hand, Rajasthan Royals struggled to make an impact with the bat, as they were bowled out for 118 in 17.5 overs. Sanju Samson was the only player who managed to make a significant contribution, registering 30 runs off 20 balls, packed with three fours and a six. Rashid Khan was in hot form for the Titans, taking three wickets, while Noor Ahmad scalped two dismissals. Overall, it was a dominant performance by the Gujarat Titans, who showcased their batting prowess and bowling prowess to secure a convincing victory over the Rajasthan Royals. IPL 2023 Points Table after GT win 1. Gujarat Titans (PTS 14, NRR +0.752) 2. Lucknow Super Giants (PTS 11, NRR +0.639) 3. Chennai Super Kings (PTS 11, NRR +0.329) 4. Rajasthan Royals (PTS 10, NRR +0.448) 5. Royal Challengers Bangalore (PTS 10, NRR -0.030) 6. Mumbai Indians (PTS 10, NRR -0.373) 7. Punjab Kings (PTS 10, NRR -0.472) 8. Kolkata Knight Riders (PTS 8, NRR -0.103) 9. Sunrisers Hyderabad (PTS 6, NRR -0.540) 10. Delhi Capitals (PTS 6, NRR -0.768) IPL 2023 Orange Cap List 1. Faf du Plessis - 466 runs 2. Yashasvi Jaiswal - 442 runs 3. Devon Conway - 414 runs 4. Shubman Gill - 375 runs 5. Ruturaj Gaikwad - 354 runs IPL 2023 Purple Cap List 1. Mohammed Shami - 17 wickets 2. Tushar Deshpande - 17 wickets 3. Arshdeep Singh - 16 wickets 4. Piyush Chawla - 15 wickets 5. Mohammed Siraj - 15 wickets READ| IPL 2023: Rashid Khan’s fiery spell, Hardik Pandya's batting help Gujarat Titans defeat Rajasthan Royals","pubDate":"2023-05-05 17:32:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Rashid Khan's fiery spell, Hardik Pandya's batting help Gujarat Titans defeat Rajasthan Royals","link":"https://www.dnaindia.com/cricket/report-ipl-2023-rashid-khan-fiery-spell-hardik-pandya-batting-help-gujarat-titans-defeat-rajasthan-royals-3040542","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Gujarat Titans delivered a clinical performance, bouncing back from their recent loss to Delhi Capitals.","content":"Gujarat Titans secured a crucial victory against Rajasthan Royals at the Sawai Mansingh Stadium in Jaipur, consolidating their position at the top of the IPL 2023 points table and moving closer to the playoffs. The defending champions chased down a modest total of 119 to take their tally to 14 points from 10 matches. Gujarat Titans delivered a clinical performance, bouncing back from their recent loss to Delhi Capitals. Despite falling short by just 5 runs in that match, the Titans were determined to come out on top against Rajasthan Royals. Mohammed Shami, who was named man-of-the-match for his four-wicket haul against DC, had previously expressed concern that the team had become too relaxed. However, against the Royals, the Titans were ruthless. That was some performance by @gujarat_titans #GT win the match by 9 wickets and add another 2 points to their tally Scorecard https://t.co/54xkkylMlx #TATAIPL | #RRvGT pic.twitter.com/fJKu9gmvLW — IndianPremierLeague (@IPL) May 5, 2023 Rashid Khan and Noor Ahmad spun a web around the RR batters, taking three and two wickets respectively. Shubman Gill and Wriddhiman Saha then added 71 for the first wicket, leaving little for the Royals to defend after a strong opening partnership. Yuzvendra Chahal dismissed Gill for 36, but it was too little too late for the Royals. Hardik Pandya, who had regretted not finishing off the chase against Delhi Capitals, was determined to make amends. He hit Adam Zampa for 23 runs off just five balls, helping the Titans edge closer to a comprehensive victory. Overall, it was an impressive performance by Gujarat Titans, who demonstrated their ability to bounce back from a defeat and deliver a dominant performance. With their eyes firmly set on the playoffs, the Titans will be looking to maintain their momentum in the coming matches. READ| 'He will not do anything in our favour': Shahid Afridi on PM Modi","pubDate":"2023-05-05 17:08:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 GT Vs RR: Royals succumb to Afghan spinners, bundled out to 118 against Titans","link":"https://www.livemint.com/sports/cricket-news/ipl-2023-gt-vs-rr-royals-succumb-to-afghan-spinners-bundled-out-to-118-against-titans-11683305997689.html","keywords":null,"creator":null,"video_url":null,"description":"RR's batting unit collapsed as no batter stepped up to fight against GT's firing bowling attack.","content":null,"pubDate":"2023-05-05 17:04:07","image_url":"https://www.livemint.com/lm-img/img/2023/05/05/1600x900/Noor_Ahmad_1683306203329_1683306203448.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"KL Rahul ruled out of IPL 2023, WTC final","link":"https://www.thehansindia.com/sports/cricket/kl-rahul-ruled-out-of-ipl-2023-wtc-final-796094","keywords":["Sports,Cricket"],"creator":["Sakshi Gupta"],"video_url":null,"description":"KL Rahul picked up an injury during a game against RCBHe has left the LSG camp and is in Mumbai now Rahul scored 274 runs in 9 matches in IPL 2023","content":"KL Rahul ruled out of IPL 2023, WTC finalKL Rahul ruled out of IPL 2023, WTC finalLucknow Super Giants (LSG) captain KL Rahul has been ruled out of the Indian Premier League (IPL) 2023, the Indian batsmen announced on Friday. Rahul took to Instagram to reveal that he will be undergoing surgery on his thigh. He has left the LSG camp and is in Mumbai now as the Board of Control for Cricket in India (BCCI) has taken over his case. Rahul wrote on an Instagram post: “After careful consideration and consultation with the medical team, it's been concluded that I'll be undergoing a surgery on my thigh shortly. My focus will be on my rehabilitation and recovery in the coming weeks. It's a tough call to make, but I know it's the right one to ensure a full recovery.” Continuing further, Rahul said as a team captain, “it pains me deeply not to be able to be there during this crucial period. But, I'm confident that the boys will rise to the occasion and give their best performance as always. I'll be cheering for them from the sidelines with all of you, watching every game.” LSG have four group games left in the IPL 2023. At present, they are placed second in the table with 11 points after 10 matches. The LSG captain suffered an injury during a game against Royal Challengers Bangalore (RCB) earlier in the IPL 2023. While fielding in the first innings, the 31-year-old tore a tendon in his right leg while fielding against RCB earlier this week. Although he did return to bat at No.11 later in the game, Rahul was in visible discomfort and could not run between the wickets. A surgery in the coming days mean, the wicketkeeper-batsman has also been ruled out of India’s World Test Championship (WTC) against Australia, which will be played from June 7 at The Oval, London. “Absolutely gutted that I won't be at the Oval next month with Team India. I'll do everything I can to get back in blue and help my country. That has always been my focus and priority,” added Rahul. “I want to express gratitude to each one of you - my fans, that gave me the strength to get back up, the LSG management and the BCCI for their promptness, and my teammates for their unwavering support during this difficult time. “Your encouragement and messages mean a lot to me and motivate me to come back stronger and fitter than ever before,” concluded Rahul. Rahul had undergone hernia surgery just around 10 months ago in Germany, and it is understood that all factors are being taken into consideration. The India batter Rahul accumulated 274 runs in nine innings at an average of 34.25 in IPL 2023, while the LSG management has not taken a call if it will seek a replacement for him. ","pubDate":"2023-05-05 16:15:01","image_url":"https://assets.thehansindia.com/h-upload/2023/05/05/500x300_1350007-kl-rahul.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Rajasthan Royals win toss, opt to bat against Gujarat Titans","link":"https://thenewsmill.com/2023/05/ipl-2023-rajasthan-royals-win-toss-opt-to-bat-against-gujarat-titans/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Rajasthan Royals captain Sanju Samson won the toss and opted to bat against Gujarat Titans here at the IPL match at Sawai Mansingh Stadium in Jaipur on Friday. Sanju Samson-led RR currently are at the fourth spot in the IPL 2023 points table with 10 points in nine matches they played. Hardik Pandya’s Gujarat Titans hold the top position in the points table with 12 points in 9 matches. “We would like to bat first. It’s a bit hard to read this pitch. Let’s bat a few overs and figure it out later. The standard of cricket we are playing is really good. We were expecting something like this from Jaiswal with the prep he had been putting in. Adam Zampa comes in place of Jason Holder,” Rajasthan Royals captain Sanju Samson said at the time of toss. Gujarat Titans captain Hardik Pandya said there is no change in the side. ” We were going to bat first as well. If the home captain does not know to what to choose, I thought might as well bowl and see what happens. They are a strong, consistent side. We have to be at our best. I don’t think so (smiles, when asked about changes to his side),” he said. Rajasthan Royals (Playing XI): Yashasvi Jaiswal, Jos Buttler, Sanju Samson(w/c), Devdutt Padikkal, Shimron Hetmyer, Dhruv Jurel, Ravichandran Ashwin, Trent Boult, Adam Zampa, Sandeep Sharma and Yuzvendra Chahal. Rajasthan Royals Subs: Murugan Ashwin, Joe Root, Riyan Parag, Kuldip Yadav and KM Asif. Gujarat Titans (Playing XI): Wriddhiman Saha(w), Hardik Pandya(c), Vijay Shankar, David Miller, Abhinav Manohar, Rahul Tewatia, Rashid Khan, Mohit Sharma, Noor Ahmad, Mohammed Shami and Joshua Little. Gujarat Titans Subs: Shubman Gill, Sai Sudharsan, Srikar Bharat, Shivam Mavi and Ravisrinivasan Sai Kishore. (ANI)","pubDate":"2023-05-05 14:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Watch: Rishabh Pant throws crutches, walks on his own","link":"https://www.livemint.com/sports/cricket-news/watch-rishabh-pant-throws-crutches-walks-on-his-own-11683295979274.html","keywords":null,"creator":null,"video_url":null,"description":"On 5 May too, Pant updated the fans with a major breakthrough in his recovery and was seen walking without support.","content":null,"pubDate":"2023-05-05 14:16:03","image_url":"https://www.livemint.com/lm-img/img/2023/05/05/1600x900/Rishabh_Pant_1683296062301_1683296062589.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC Final से पहले चेतेश्‍वर पुजारा की कप्‍तानी में खेले स्‍टीव स्मिथ, बनाई 59 रन की साझेदारी, कौन किसपर भारी?","link":"https://hindi.news18.com/news/sports/cricket-wtc-final-cheteshwar-pujara-steve-smith-play-together-for-sussex-county-club-ahead-of-india-vs-australia-test-championship-clash-6104035.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"स्‍टीव स्मिथ और चेतेश्‍वर पुजारा ससेक्‍स काउंटी क्‍लब का हिस्‍सा हैं. पुजारा इस टीम की कप्‍तानी भी कर रहे हैं. दोनों एक साथ बैटिंग करते हुए नजर आए. एक महीने बाद भारत और ऑस्‍ट्रेलिया के बीच होने वाले वर्ल्‍ड टेस्‍ट चैंपियनशिप के फाइनल में दोनों एक दूसरे के खिलाफ मैदान में उतरेंगे.","content":null,"pubDate":"2023-05-05 13:51:34","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Cheteshwar-Pujara-Steve-Smith-Partnership-16832945843x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RR vs GT Live Score: राजस्थान को लगा पहला झटका, जोस बटलर हुए आउट","link":"https://hindi.news18.com/news/sports/cricket-rr-vs-gt-live-score-ipl-2023-rajasthan-royals-vs-gujarat-titans-scorecard-sanju-samson-vs-hardik-pandya-6103701.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"RR vs GT Live Score: आईपीएल के इतिहास में राजस्थान रॉयल्स और गुजरात टाइटंस की टीम अबतक चार बार आमने-सामने हुई है. इस दौरान राजस्थान के खिलाफ गुजरात का पलड़ा भारी रहा है. गुजरात को जहां राजस्थान के खिलाफ तीन मुकाबलों में जीत मिली है. वहीं राजस्थान की टीम गुजरात के खिलाफ महज एक मैच में सफलता हासिल कर सकी है.","content":null,"pubDate":"2023-05-05 13:31:28","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/GT-vs-RR-LIVE_05_05-16832933433x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"}]}