{"newsArray":[{"title":"Lanka Premier League 2023: 30 जुलाई से शुरू हो रहा है लंका प्रीमियर लीग का चौथे संस्करण, यहां जानें एलपीएल की स्क्वाड, शेड्यूल और स्ट्रीमिंग समेत सारे डिटेल्स","link":"https://hindi.latestly.com/sports/cricket/the-fourth-edition-of-sri-lankas-t20-tournament-spl-is-starting-from-july-30-know-here-all-the-details-including-its-team-schedule-and-streaming-1881000.html","keywords":null,"creator":null,"video_url":null,"description":"30 जुलाई से शुरू होने वाले ग्रुप-स्टेज गेम्स में राउंड-रॉबिन लीग प्रारूप में टीमें दो बार एक-दूसरे का सामना करेंगी. अंक तालिका में शीर्ष चार टीमें प्लेऑफ के लिए क्वालीफाई करेंगी जो 17 अगस्त से शुरू होगी और 20 अगस्त को फाइनल खेला जाएगा तथा 21 अगस्त को वर्षा रिजर्व डे के रूप में रखा गया.","content":"Lanka Premier League 2023: 30 जुलाई से 21 अगस्त, 2023 तक लंका प्रीमियर लीग (एलपीएल) का आयोजन होने वाली है. यह बहुप्रतीक्षित लीग का चौथा संस्करण होगा जिसमें वैश्विक क्रिकेट के कुछ शीर्ष सितारे प्रतिष्ठित खिताब के लिए लड़ेंगे. एलपीएल की एक प्रेस विज्ञप्ति के अनुसार, 2023 संस्करण के लिए मैच दो स्थानों कोलंबो और कैंडी में आयोजित किए जाएंगे. 30 जुलाई से शुरू होने वाले ग्रुप-स्टेज गेम्स में राउंड-रॉबिन लीग प्रारूप में टीमें दो बार एक-दूसरे का सामना करेंगी. अंक तालिका में शीर्ष चार टीमें प्लेऑफ के लिए क्वालीफाई करेंगी जो 17 अगस्त से शुरू होगी और 20 अगस्त को फाइनल खेला जाएगा तथा 21 अगस्त को वर्षा रिजर्व डे के रूप में रखा गया. यह भी पढ़ें: लंका प्रीमियर लीग के नीलामी से पहले जानें भाग लेने वाली टीमें, सेलेक्टेड खिलाड़ी समेत स्ट्रीमिंग से संबंधित सारे डिटेल्स सीज़न में पांच टीमें भाग लेंगी - निरोशन डिकवेला की कप्तानी वाली कोलंबो स्ट्राइकर्स, कुसल मेंडिस की कप्तानी वाली दांबुला ऑरा, दासुन शनाका की कप्तानी वाली गॉल टाइटंस, वानिंदु हसरंगा की कप्तानी वाली बी-लव कैंडी और मौजूदा चैंपियन जाफना किंग्स की कप्तानी अनुभवी खिलाड़ी श्रीलंकाई ऑलराउंडर थिसारा परेरा करेंगे. चौथे संस्करण में डेविड मिलर, बाबर आजम, क्रिस लिन और शाकिब अल हसन जैसे शीर्ष अंतर्राष्ट्रीय सितारे भी शामिल होंगे जो लीग में महेश थीक्षाना, भानुका राजपक्षे और एंजेलो मैथ्यूज जैसे शीर्ष श्रेणी के श्रीलंकाई खिलाड़ियों के साथ प्रशंसकों का मनोरंजन करेंगे. लंका प्रीमियर लीग 2023 का स्ट्रीमिंग और टेलीकास्ट कब और कहां देखें? लंका प्रीमियर लीग 2023 का सीधा प्रसारण स्टार स्पोर्ट्स नेटवर्क पर किया जाएगा, जबकि लाइव स्ट्रीम फैनकोड ऐप पर उपलब्ध होगी. लंका प्रीमियर लीग 2023 का स्क्वाड: कोलंबो स्ट्राइकर्स की स्क्वाड: बाबर आजम, मथीशा पथिराना, नसीम शाह, चमिका करुणारत्ने, पथुम निसांका, अहान विक्रमसिंघे, धनंजय लक्षण, निरोशन डिकवेला, वहाब रियाज, लक्षण संदाकन, निपुण धनंजय, मोविन सुबासिंघे, लाहिरू उदारा, जेफरी वांडरसे, ईशान मलिंगा, शशिका दुलशन, नुवानीदु फर्नांडो , इफ्तिखार अहमद, लोर्कन टकर, कविशका अंजुला, रमेश मेंडिस, मोहम्मद नवाज, यशोदा लंका, एंजेलो परेरा दांबुला आभा की स्क्वाड: मैथ्यू वेड, कुसल मेंडिस, हसन अली, अविष्का फर्नांडो, धनंजय डी सिल्वा, कुसल परेरा, हेडन केर, सदीरा समरविक्रमा, बिनुरा फर्नांडो, नूर अहमद, सचिथा जयतिलके, जेनिथ लियानाज, दुशान हेमंथा, प्रमोद मदुशन, ट्रेवीन मैथ्यूज, शाहनवाज दहानी, लक्षण एदिरिसिंघे, जेहान डेनियल, वानुजा सहान, कविन्दु पथिरत्ने, रविन्दु फर्नांडो, एलेक्स रॉस, मनेलकर डी सिल्वा, प्रवीण जयविक्रमा गैल टाइटन्स की स्क्वाड: शाकिब अल हसन, दासुन शनाका, तबरेज़ शम्सी, भानुका राजपक्षे, सीकुगे प्रसन्ना, लाहिरू कुमारा, शेवोन डैनियल, लसिथ क्रूसपुले, सोहन डी लिवरा, अशान प्रियंजन, बेन कटिंग, मोहम्मद मिथुन, मिनोद भानुका, पसिंदु सोरियाबंदरा, अविष्का परेरा, मोहम्मद शिराज, लाहिरू समराकून, कासुन राजिथा, अकिला धनंजय, चाड बोवेस, टिम सीफर्ट, सोनल दिनुशा, विश्वा फर्नांडो, अनुक फर्नांडो जाफना किंग्स की स्क्वाड: डेविड मिलर, महेश थीक्षाना, रहमानुल्लाह गुरबाज़, थिसारा परेरा, चैरिथ असलांका, डुनिथ वेलालेज, शोएब मलिक, पथुम कुमारा, विजयकांत व्यासकांत, थेसन विथुशन, असंका मनोज, निशान मदुश्का, असिथा फर्नांडो, हार्डस विलोजेन, नुवान तुषारा, दिलशान मदुशंका, ज़मान खान , आशान रंदिका, रत्नाराजा थानुरादान, क्रिस लिन, असेला गुणरत्ने बी-लव कैंडी की स्क्वाड: मुजीब उर रहमान, वानिंदु हसरंगा, फखर जमान, एंजेलो मैथ्यूज, इसुरु उदाना, दिनेश चंडीमल, मोहम्मद हसनैन, दुशमंथा चमीरा, सहान अराचिगे, एशेन बंडारा, मोहम्मद हारिस, नवोद परानाविथाना, आसिफ अली, कामिंडु मेंडिस, नुवान प्रदीप, चतुरंगा डी सिल्वा, लाहिरू मदुशंका, आमेर जमाल, मालशा थारुपथी, थानुका डाबारे, लसिथ अबेरत्ने, अविष्का थारिन्दु टूर्नामेंट का शेड्यूल: 30 जुलाई, रविवार: शाम 7 बजे: जाफना किंग्स बनाम कोलंबो स्ट्राइकर्स - कोलंबो 31 जुलाई, सोमवार: दोपहर 3 बजे: गॉल टाइटंस बनाम दांबुला ऑरा - कोलंबो l शाम 7 बजे: बी लव कैंडी बनाम कोलंबो स्ट्राइकर्स - कोलंबो 1 अगस्त, मंगलवार: दोपहर 3 बजे: दांबुला ऑरा बनाम जाफना किंग्स - कोलंबो l शाम 7 बजे: गॉल टाइटंस बनाम बी लव कैंडी - कोलंबो 2 अगस्त, बुधवार: रेस्ट डे 3 अगस्त, गुरुवार: रेस्ट डे 4 अगस्त, शुक्रवार: दोपहर 3 बजे: बी लव कैंडी बनाम दांबुला ऑरा - कैंडी एल शाम 7 बजे: गॉल टाइटंस बनाम जाफना किंग्स - कैंडी 5 अगस्त, शनिवार: दोपहर 3 बजे: कोलंबो स्ट्राइकर्स बनाम दांबुला ऑरा - कैंडी l शाम 7 बजे: बी लव कैंडी बनाम जाफना किंग्स - कैंडी 6 अगस्त, रविवार: रेस्ट डे 7 अगस्त, सोमवार: दोपहर 3 बजे: कोलंबो स्ट्राइकर्स बनाम गॉल टाइटंस - कैंडी l शाम 7 बजे: दांबुला ऑरा बनाम जाफना किंग्स - कैंडी 8 अगस्त, मंगलवार: दोपहर 3 बजे: गॉल टाइटंस बनाम बी लव कैंडी - कैंडी, शाम 7 बजे: जाफना किंग्स बनाम कोलंबो स्ट्राइकर्स - कैंडी 9 अगस्त, बुधवार: रेस्ट डे 10 अगस्त, गुरुवार: रेस्ट डे 11 अगस्त, शुक्रवार: शाम 7 बजे: दांबुला ऑरा बनाम गॉल टाइटंस - कोलंबो 12 अगस्त, शनिवार: दोपहर 3 बजे: जाफना किंग्स बनाम बी लव कैंडी - कोलंबो l शाम 7 बजे: दांबुला ऑरा बनाम कोलंबो स्ट्राइकर्स - कोलंबो 13 अगस्त, रविवार: दोपहर 3 बजे: जाफना किंग्स बनाम गॉल टाइटंस - कोलंबो l शाम 7 बजे: कोलंबो स्ट्राइकर्स बनाम बी लव कैंडी - कोलंबो 14 अगस्त, सोमवार: शाम 7 बजे: बी लव कैंडी बनाम दांबुला ऑरा - कोलंबो 15 अगस्त, मंगलवार: शाम 7 बजे: कोलंबो स्ट्राइकर्स बनाम गॉल टाइटंस - कोलंबो 16 अगस्त, बुधवार: रेस्ट डे 17 अगस्त, गुरुवार: दोपहर 3 बजे: क्वालीफायर 1 (1 बनाम 2) - कोलंबो l शाम 7 बजे: एलिमिनेटर (3 बनाम 4) - कोलंबो 18 अगस्त, शुक्रवार: रेस्ट डे 19 अगस्त, शनिवार: शाम 7 बजे: क्वालीफायर 2 (हारे हुए क्यूएफ 1 बनाम विजेता एलिमिनेटर) - कोलंबो 20 अगस्त, रविवार: शाम 7 बजे: फाइनल - कोलंबो 21 अगस्त, सोमवार: रेन रिजर्व डे","pubDate":"2023-07-30 08:22:52","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Yuvraj Singh’s historic six sixes molded me into the competitor I am today: Stuart Broad","link":"https://kalingatv.com/sports/yuvraj-singhs-historic-six-sixes-molded-me-into-the-competitor-i-am-today-stuart-broad/","keywords":["Sports","Cricket","Yuvraj Singh"],"creator":["Deepa Sharma"],"video_url":null,"description":"England’s veteran pacer, Stuart Broad, looked back on a defining moment in his cricketing career, attributing his transformation into a formidable competitor to Yuvraj Singh’s iconic six sixes during the 2007 T20 World Cup clash between India and England in Durban. In a press conference, Broad acknowledged that the unforgettable encounter, was instrumental in shaping […] The post Yuvraj Singh’s historic six sixes molded me into the competitor I am today: Stuart Broad appeared first on KalingaTV.","content":"England’s veteran pacer, Stuart Broad, looked back on a defining moment in his cricketing career, attributing his transformation into a formidable competitor to Yuvraj Singh’s iconic six sixes during the 2007 T20 World Cup clash between India and England in Durban. In a press conference, Broad acknowledged that the unforgettable encounter, was instrumental in shaping his mental approach to the game. The momentous match on September 19, 2007, saw Yuvraj Singh, in a sensational display of power-hitting, become the first batsman to dispatch six consecutive sixes in an over during a T20 International. The 22-year-old Broad found himself on the receiving end of Yuvraj’s ferocious assault, as the Indian batsman sent the ball soaring into all corners of the stadium, propelling India’s total beyond the formidable 200-run mark. Reflecting on that day, Broad admitted, “Yeah, it was obviously a pretty tough day. What would I have been: 21, 22? [22] I learned loads. I pretty much based a whole mental routine through that experience, knowing that I was left very short as an international performer in that moment. I’d rushed my preparation. I didn’t have any sort of pre-ball routine. I didn’t have any focus, particularly, and I started building my ‘warrior mode’ that I call it after that experience.” “You obviously go through massive peaks and troughs, and when you look at someone like Stokesy’s career, he’s done that sort of thing as well. Most players have. But ultimately I think it’s that bounce-back ability and that ability to be able to put poor days behind you because certainly one thing over the past whatever – 15, 16 years – you have a lot more bad days than good days in cricket so you have to be able to deal with them to make sure your good days can flourish,” Broad concluded. Prev News Next News","pubDate":"2023-07-30 08:06:01","image_url":null,"source_id":"kalingatv","category":["sports"],"country":["india"],"language":"english"},{"title":"How to Watch North Zone vs West Zone, Deodhar Trophy 2023 Live Streaming Online? Get Free Live Telecast of NZ vs WZ Cricket Match With Time in IST","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-north-zone-vs-west-zone-deodhar-trophy-2023-live-streaming-online-get-free-live-telecast-of-nz-vs-wz-cricket-match-with-time-in-ist-5303497.html","keywords":null,"creator":null,"video_url":null,"description":"While West Zone would be confident of their win against Central Zone in the last match, North Zone would want to bounce back hard from a loss to East Zone in their previous encounter. Scroll down to get live streaming and telecast details of this match,","content":"North Zone will face West Zone in the Deodhar Trophy 2023 on Sunday, July 30. The fixture is set to feature some exciting names in the competition and it would be played at the Cricket Association Puducherry Siechem Ground, starting at 1:30 pm IST (Indian Standard Time). The live telecast of this match will not be available as there is no official broadcast partner, with BCCI's media rights yet to be sold. But fans can watch live streaming online of this match on the BCCI.TV and BCCI app and website. Deodhar Trophy 2023: West Zone Win Thriller Over Central Zone by 1 Wicket. Deodhar Trophy Live Streaming Just 1️⃣ Day to go for the #DeodharTrophy to begin 🏆 Catch all the LIVE action on https://t.co/pQRlXkCguc and the official BCCI APP 📱 pic.twitter.com/RSfbNlZFnK — BCCI Domestic (@BCCIdomestic) July 23, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-30 07:57:02","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"7 Sixes In 1 Over: काबुल प्रीमियर लीग में आमिर ज़ज़ई ने बनाया अनचाहा रिकॉर्ड, 1 ओवर में दिए 7 छक्कों समेत 48 रन","link":"https://hindi.latestly.com/socially/sports/cricket/aamir-zazai-creates-unwanted-record-in-kabul-premier-league-48-runs-including-7-sixes-in-1-over-1880988.html","keywords":null,"creator":null,"video_url":null,"description":"न्यूजीलैंड के गेंदबाज जेम्स फुलर ने पहले यह रिकॉर्ड अपने नाम किया था, उन्होंने ग्लॉस्टरशायर और ससेक्स के बीच टी20 ब्लास्ट मैच में एक ओवर में 38 रन दिए थे. स्कॉट स्टायरिस ने फुलर के खिलाफ बल्ले से 34 रन बनाए, जबकि ग्लॉस्टरशायर के गेंदबाज ने अतिरिक्त के रूप में चार रन दिए.","content":"Kabul Premier League 2023: शनिवार को अफगानिस्तान के अनकैप्ड स्पिनर आमिर ज़ज़ई ने रिकॉर्ड बुक में जगह बनाई, लेकिन उस तरह से नहीं जिस पर उन्हें गर्व हो. उन्होंने काबुल प्रीमियर लीग मैच के एक ओवर में 48 रन दिए, जिससे टी20 मैच के एक ओवर में किसी गेंदबाज द्वारा दिए गए सर्वाधिक रन का नया विश्व रिकॉर्ड बन गया. न्यूजीलैंड के गेंदबाज जेम्स फुलर ने पहले यह रिकॉर्ड अपने नाम किया था, उन्होंने ग्लॉस्टरशायर और ससेक्स के बीच टी20 ब्लास्ट मैच में एक ओवर में 38 रन दिए थे. स्कॉट स्टायरिस ने फुलर के खिलाफ बल्ले से 34 रन बनाए, जबकि ग्लॉस्टरशायर के गेंदबाज ने अतिरिक्त के रूप में चार रन दिए. वीडियो देखें: 48 runs from 1 over. @Sediq_Atal26 is now in the cricketing history books. Equalled Rituraj Gaikwad's 7 sixes in an over. Poor Amir Zazai, almost escaped a heartache. This 💯 must open the doors of international cricket & leagues for Atal. 🇦🇫 #FutureStar #WorldRecord #SevenSixes pic.twitter.com/Ntt0lkZVUm — Cricket Afghanistan (@AFG_Sports) July 29, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-30 07:36:33","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Un centro de cricket dentro del 'Sky Stadium', el estadio donde jugará España","link":"https://www.marca.com/futbol/futbol-femenino/seleccion/2023/07/30/64c5d22aca474117568b4594.html","keywords":["Selección Femenina Fútbol España","Fútbol Femenino","Mundial femenino de fútbol"],"creator":["Pablo Parra"],"video_url":null,"description":null,"content":"a selección española jugará su tercer partido en el Sky Stadium, Estadio regional de Wellington, para la FIFA. Se trata de un ciertamente incómodo para los medios de comunicación y que el máximo organismo del fútbol mundial ha tenido que adaptar para el campeonato del mundo. . Habitualmente es un estadio de rugby, donde juegan los Wellington Lions y los Wellington Hurricanes. Es también el hogar del equipo de fútbol Wellington Phoenix, de la A-League. A ello hay que sumar que dentro del estadio, lo que en este Mundial está siendo el centro de trabajo de los medios de comunicación, . Concretamente es la Escuela de Wellington de Cricket, dirigida por la Asociación de Cricket de Wellington.. De hecho, el techo conserva las redes y las mallas necesarias en dicho deporte. En una de las paredes, aparecen nombres históricos del cricket de la ciudad. Por otro lado, el recorrido que existe entre la tribuna habilitada para los medios de comunicación es tan largo que para poder facilitar el trabajo al término de los encuentros. . Aquí debutó contra Costa Rica con una victoria contundente por 3-0 gracias a los goles de la selección 'tica' en propia puerta, Esther González y Aitana Bonmatí, con lo cual ya sabe lo que es lograr una victoria en este especial enclave a las afueras de la ciudad en el que, además, se nota el paso de los trenes por las vías aledañas al terreno de juego.","pubDate":"2023-07-30 07:34:18","image_url":"https://phantom-marca.unidadeditorial.es/07c687b17b0dd30220174a13768dc04e/crop/0x168/2047x1533/resize/2047/assets/multimedia/imagenes/2023/07/30/16907021574049.jpg","source_id":"marca","category":["sports"],"country":["colombia"],"language":"spanish"},{"title":"‘To Take 600 Wickets and…’ Team India Head Coach Rahul Dravid Praises 'Special Cricketer' Stuart Broad With England Pacer Set to Retire After Ashes 2023","link":"https://www.latestly.com/agency-news/sports-news-retiring-broad-is-a-special-cricketer-dravid-5303330.html","keywords":null,"creator":null,"video_url":null,"description":"India head coach Rahul Dravid has described the retiring England fast bowler Stuart Broad as a \"special cricketer\", whose great partnership with James Anderson will be remembered for ages.","content":"Bridgetown, July 30 : India head coach Rahul Dravid has described the retiring England fast bowler Stuart Broad as a \"special cricketer\", whose great partnership with James Anderson will be remembered for ages. The 37-year-old Broad on Saturday announced that he will retire from international cricket after the conclusion of the ongoing final Ashes Test against Australia at The Kia Oval in London. IND vs WI 2nd ODI 2023: Bowlers, Shai Hope Help West Indies Level Series . \"He (Broad) has been a terrific bowler, he has been a great. His partnership with Jimmy Anderson will always be remembered,\" Dravid said after India lost to West Indies by six wickets in the second ODI here. \"Anderson and Broad the whole decade they played for England, they have really put in some fantastic performances,\" said the batting legend and former India captain. \"To take 600 wickets and to play the number of Test matches he has takes a special kind of cricketer,\" he added. Broad has been a key member of the England Test side since making his debut against Sri Lanka in December 2007. He will retire with 167 caps, and is the second highest Test wicket-taker after Anderson among pacers. He had taken 600 wickets before the ongoing final Ashes Test. The right-arm seamer, who made his first-class debut for Leicestershire in 2005 and later moved to Nottinghamshire, has played 121 ODIs and 56 T20 Internationals, picking up 178 and 65 wickets respectively. Dravid congratulated Broad on a wonderful career. \"My best wishes to him and congratulations on a fantastic career. I hope he gets to finish it off in the best possible way he wants to,\" he said.","pubDate":"2023-07-30 07:31:53","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Lanka Premier League 2023: All You Need to Know About Fourth Edition of Sri Lanka's T20 Tournament","link":"https://www.latestly.com/agency-news/sports-news-lanka-premier-league-all-you-need-to-know-about-fourth-edition-of-tournament-5302111.html","keywords":null,"creator":null,"video_url":null,"description":"The season will see the participation of five teams - Colombo Strikers captained by Niroshan Dickwella, Dambulla Aura captained by Kusal Mendis, Galle Titans led by Dasun Shanaka, B-Love Kandy captained by Wanindu Hasaranga and the defending champions Jaffna Kings will be led by veteran Srilankan allrounder Thisara Perera.","content":"Colombo [Sri Lanka], July 29 : The Lanka Premier League (LPL) is scheduled to take place from July 30 to August 21, 2023. This will be the fourth edition of the highly anticipated league which will feature some top stars from global cricket fighting for the coveted title. As per a press release from LPL, the matches will be held across two venues Colombo and Kandy for the 2023 edition. ‘Playing Virat and Rohit Would Not Have Given Us...’ Head Coach Rahul Dravid Explains Why Virat Kohli, Rohit Sharma Did Not Play IND vs WI 2nd ODI 2023 (Watch Video) The season will see the participation of five teams - Colombo Strikers captained by Niroshan Dickwella, Dambulla Aura captained by Kusal Mendis, Galle Titans led by Dasun Shanaka, B-Love Kandy captained by Wanindu Hasaranga and the defending champions Jaffna Kings will be led by veteran Srilankan allrounder Thisara Perera. The fourth edition will also feature top International stars like David Miller, Babar Azam, Chris Lynn and Shakib Al Hasan who will be entertaining the fans in the league along with top-class Sri Lankan players like Mahesh Theekshana, Bhanuka Rajapaksa and Angelo Mathews. Ashes 2023: Ricky Ponting Keen To See England's Batting Approach in Second Innings of ENG vs AUS 5th Test. The teams will be facing each other twice in a round-robin league format in group-stage games starting from July 30. The top four teams on the points table will qualify for the playoffs which will begin on August 17 and the final will be played on August 20 with August 21 kept as a rain reserve day. *Team Captains -Colombo Strikers: Niroshan Dickwella-Dambulla Aura: Kusal Mendis-Galle Titans: Dasun Shanaka-Jaffna Kings: Thisara Perera-B-Love Kandy: Wanindu Hasaranga *Squads -Colombo Strikers Babar Azam, Matheesha Pathirana, Naseem Shah, Chamika Karunaratne, Pathum Nissanka, Ahan Wickramasinghe, Dhananjaya Lakshan, Niroshan Dickwella, Wahab Riaz, Lakshan Sandakan, Nipun Dananjaya, Movin Subasinghe, Lahiru Udara, Jeffrey Vandersay, Eshan Malinga, Shashika Dulshan, Nuwanidu Fernando, Iftikhar Ahmed, Lorcan Tucker, Kavishka Anjula, Ramesh Mendis, Mohammad Nawaz, Yashodha Lanka, Angelo Perera -Dambulla Aura Matthew Wade, Kusal Mendis, Hassan Ali, Avishka Fernando, Dhananjaya de Silva, Kusal Perera, Hayden Kerr, Sadeera Samarawickrama, Binura Fernando, Noor Ahmad, Sachitha Jayatilake, Janith Liyanage, Dushan Hemantha, Pramod Madushan, Treveen Mathews, Shahnawaz Dahani, Lakshan Edirisinghe, Jehan Daniel, Wanuja Sahan, Kavindu Pathirathne, Ravindu Fernando, Alex Ross, Manelker de Silva, Praveen Jayawickrama -Galle Titans Shakib Al Hasan, Dasun Shanaka, Tabraiz Shamsi, Bhanuka Rajapaksa, Seekkuge Prasanna, Lahiru Kumara, Shevon Daniel, Lasith Croospulle, Sohan de Livera, Ashan Priyanjan, Ben Cutting, Mohammad Mithun, Minod Bhanuka, Pasindu Sooriyabandara, Avishka Perera, Mohamed Shiraz, Lahiru Samarakoon, Kasun Rajitha, Akila Dananjaya, Chad Bowes, Tim Seifert, Sonal Dinusha, Vishwa Fernando, Anuk Fernando -Jaffna Kings David Miller, Maheesh Theekshana, Rahmanullah Gurbaz, Thisara Perera, Charith Asalanka, Dunith Wellalage, Shoaib Malik, Pathum Kumara, Vijayakanth Viyaskanth, Theesan Vithushan, Asanka Manoj, Nishan Madushka, Asitha Fernando, Hardus Viljoen, Nuwan Thushara, Dilshan Madushanka, Zaman Khan, Ashan Randika, Rathnaraja Thanuradan, Chris Lynn, Asela Gunaratne -B-Love Kandy Mujeeb Ur Rahman, Wanindu Hasaranga, Fakhar Zaman, Angelo Mathews, Isuru Udana, Dinesh Chandimal, Mohammad Hasnain, Dushmantha Chameera, Sahan Arachchige, Ashen Bandara, Mohammad Haris, Navod Paranavithana, Asif Ali, Kamindu Mendis, Nuwan Pradeep, Chathuranga de Silva, Lahiru Madushanka, Aamer Jamal, Malsha Tharupathi, Thanuka Dabare, Lasith Abeyratne, Avishka Tharindu Fixtures: July 30, Sunday: 7 PM: Jaffna Kings vs Colombo Strikers - Colombo July 31, Monday : 3 PM: Galle Titans vs Dambulla Aura - Colombo l 7 PM: B Love Kandy vs Colombo Strikers - Colombo August 1, Tuesday : 3 PM: Dambulla Aura vs Jaffna Kings - Colombo l 7 PM: Galle Titans vs B Love Kandy - Colombo August 2, Wednesday: Rest Day August 3, Thursday: Rest Day August 4, Friday: 3 PM: B Love Kandy vs Dambulla Aura - Kandy l 7 PM: Galle Titans vs Jaffna Kings - Kandy August 5, Saturday : 3 PM: Colombo Strikers vs Dambulla Aura - Kandy l 7 PM: B Love Kandy vs Jaffna Kings - Kandy August 6, Sunday: Rest day August 7, Monday : 3 PM: Colombo Strikers vs Galle Titans - Kandy l 7 PM: Dambulla Aura vs Jaffna Kings - Kandy August 8, Tuesday : 3 PM: Galle Titans vs B Love Kandy - Kandy l 7 PM: Jaffna Kings vs Colombo Strikers - Kandy August 9, Wednesday: Rest day August 10, Thursday: Rest day August 11, Friday: 7 PM: Dambulla Aura vs Galle Titans - Colombo August 12, Saturday : 3 PM: Jaffna Kings vs B Love Kandy - Colombo l 7 PM: Dambulla Aura vs Colombo Strikers - Colombo August 13, Sunday : 3 PM: Jaffna Kings vs Galle Titans - Colombo l 7 PM: Colombo Strikers vs B Love Kandy - Colombo August 14 , Monday: 7 PM: B Love Kandy vs Dambulla Aura - Colombo August 15, Tuesday: 7 PM: Colombo Strikers vs Galle Titans - Colombo August 16, Wednesday: Rest Day August 17 , Thursday : 3 PM: Qualifier 1 ( 1 vs 2 ) - Colombo l 7 PM: Eliminator ( 3 vs 4) – Colombo August 18, Friday: Rest day August 19, Saturday: 7 PM: Qualifier 2 ( looser QF 1 vs Winner Eliminator ) - Colombo August 20, Sunday: 7 PM : Final - Colombo August 21, Monday: Rain Reserve Day. The Lanka Premier League 2023 will be telecasted live on Star Sports network, and the Live stream will be available on the Fancode app.","pubDate":"2023-07-30 07:27:56","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"'It's Magic', संजू सैमसन खड़े-खड़े हो गए आउट, पिच पर गजब अंदाज में 90 डिग्री के कोण से घूमी गेंद, Video","link":"https://sports.ndtv.com/hindi/cricket/sanju-samson-wicket-video-viral-2nd-odi-ind-vs-wi-yannic-cariah-bowling-4252685#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Sanju Samson wicket video viral 2nd ODI, दूसरे वनडे में संजू सैमसन का बल्ला खामोश रहा और केवल 9 रन ही बना सके, सैमसन जिस अंदाज में आउट हुए वह गेंद यकीनन चौकेने वाली थी.","content":"संजू सैमसन का नहीं चला बल्ला वेस्टइंडीज के खिलाफ दूसरे वनडे मैच (WI vs IND 2nd ODI) में भारत को हार का सामना करना पड़ा. वेस्टइंडीज ने भारत को 6 विकेट से हारकर वनडे सीरीज को बराबरी कर लाकर खड़ा कर दिया. बता दें कि दूसरे वनडे में भारतीय बल्लेबाज पूरी तरह से फ्लॉप रहे, यही कारण रहा कि बारिश से प्रभावित मैच में भारतीय पारी केवल 181 रन ही बना सकी. जिसके बाद 4 विकेट खोकर वेस्टइंडीज ने लक्ष्य को 37वें ओवर में हासिल कर लिया. बता दें कि दूसरे वनडे में जहां कोहली और रोहित (Kohli-Rohit) को आराम दिया गया तो वहीं दूसरी ओर संजू सैमसन (Sanju Samson Wicket) को मौका मिला. लेकिन एक बार फिर सैमसन उम्मीद पर खड़े नहीं उतर पाए और केवल 9 रन बनाकर स्पिनर यानिक कारिया (Yannic Cariah) की गेंद पर स्लिप में कैच कर लिए गए. सैमसन ने 19 गेंद का सामना किया लेकिन अपनी पारी में वो खुलकर नहीं खेल पाए. बता दें कि यानिक कारिया ने अपनी करिश्माई गेंद पर सैमसन को फंसाया जिसका वीडियो अब सोशल मीडिया पर वायरल हो रहा है. दरअसल, सैमसन खड़े रह गए और गेंद उनके बल्ले से लगकर स्लिप में गई. यानिक कारिया की यह गेंद इतनी कमाल की थी कि बल्लेबाज को यकीन ही नहीं हुआ कि वो इस तरह से कैच आउट हो सकते हैं. Sanju Samson had a short stay in the middle. . . हुआ ये कि गेंद लेग स्टंप की लाइन पर टप्पा खाने के बाद उल्टी दिशा में तेजी से घूमती है, और पलक झपकते ही गेंद बल्ले से लगकर स्लिप में चली जाती है. बल्लेबाज सैमसन को अपना बल्ला हटाने का समय ही नहीं मिल पाता है और कैच आउट हो जाते हैं. आउट होने के बाद सैमसन पिच पर खड़े-खड़े सोचने लग जाते हैं और आखिर में निराश मन के साथ पवेलियन लौट पड़ते हैं. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-07-30 06:35:55","image_url":"https://c.ndtvimg.com/2023-07/hdo3s3og_samson_625x300_30_July_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Dravid on Virat-Rohit's Rest, IND vs WI: বিরাট-রোহিতকে ছাড়া লজ্জার হার ভারতের, বিশ্রামের কারণ কি বললেন কোচ দ্রাবিড়?","link":"https://bangla.latestly.com/sports/cricket/dravid-on-virat-rohits-rest-ind-vs-wi-indias-embarrassing-defeat-without-virat-rohit-what-is-the-reason-for-rest-coach-dravid-said-230868.html","keywords":null,"creator":null,"video_url":null,"description":"তিনি বলেন, 'এই ধরনের সিরিজে যখন মাত্র দুই বা তিনটি ম্যাচ বাকি রয়েছে, রোহিত ও বিরাটকে খেলালে আমরা খুব বেশি উত্তর দিতাম না। এনসিএতে আমাদের কিছু খেলোয়াড়দের চোট এবং তাদের ঘিরে কিছু অনিশ্চয়তার কারণে, আমরা অন্য কিছু খেলোয়াড়দের সুযোগ দিতে চেয়েছিলাম যাতে প্রয়োজনে তারা খেলতে পারে","content":"শনিবার বার্বাডোসে ওয়েস্ট ইন্ডিজের কাছে দ্বিতীয় ওয়ানডেতে হেরে যাওয়া দলের দুই গুরুত্বপূর্ণ খেলোয়াড়কে বাদ দেওয়ার সিদ্ধান্তকে সমর্থন করেছেন ভারতীয় কোচ রাহুল দ্রাবিড়। ৫০ ওভারের ম্যাচে অধিনায়ক রোহিত শর্মা এবং অভিজ্ঞ ব্যাটসম্যান বিরাট কোহলিকে বিশ্রামে রাখে ভারত এবং এই পদক্ষেপের ফলে ক্যারিবিয়ানরা ছয় উইকেটে ম্যাচ জিতে নেয় এবং সিরিজ নির্ণায়ক ম্যাচের আগে ব্যবধানে ১-১ করে দেয়। দ্রাবিড় বলেন, আসন্ন এশিয়া কাপ ও আইসিসি পুরুষ ক্রিকেট বিশ্বকাপের আগে সঞ্জু স্যামসন, ইশান কিষাণ এবং সূর্যকুমার যাদবের মতো খেলোয়াড়দের দিকে নজর দেওয়া তাঁর পক্ষে গুরুত্বপূর্ণ ছিল। IND vs WI 2nd ODI Results: মহাতারকাদের অবাক বিশ্রামে মহালজ্জার হারে মাথাহেঁট, টিম ইন্ডিয়াকে হারিয়ে ক্যারিবিয়ান কামব্যাকের ক্যালিপসো দ্রাবিড় বলেন, 'এটাই ছিল আমাদের শেষ সুযোগ ছিল আমাদের কিছু খেলোয়াড়কে পরীক্ষা করার। আমরা আমাদের কয়েকজন খেলোয়াড়কে পেয়েছি যারা চোটের কারণে এনসিএতে আছে। এশিয়া কাপের আর এক মাস বাকি থাকতেই আমাদের অনেক দিক থেকে সময় ফুরিয়ে যাচ্ছে। আমরা আশাবাদী যে তাদের (চোটে থাকা খেলোয়াড়) কেউ কেউ এশিয়া কাপ ও বিশ্বকাপের জন্য ফিট হয়ে যাবে, কিন্তু আমরা সেই কারণে চান্স নিতে পারব না। আমাদের অন্যদের নিয়ে চেষ্টা করতে হবে এবং অন্যদের সুযোগ দিতে হবে যাতে সবচেয়ে খারাপ পরিস্থিতিতে কমপক্ষে তাদের পিছনে খেলার সময় থাকে এবং এটি আমাদের খেলোয়াড়দের সম্পর্কে কিছু সিদ্ধান্ত নেওয়ার সুযোগ দেয়।' Head Coach Rahul Dravid explains #TeamIndia 's selection in the second #WIvIND ODI 🔽 pic.twitter.com/65rZUtuIaV — BCCI (@BCCI) July 29, 2023 তিনি আরও যোগ করে বলেন, 'এই ধরনের সিরিজে যখন মাত্র দুই বা তিনটি ম্যাচ বাকি রয়েছে, রোহিত ও বিরাটকে খেলালে আমরা খুব বেশি উত্তর দিতাম না। এনসিএতে আমাদের কিছু খেলোয়াড়দের চোট এবং তাদের ঘিরে কিছু অনিশ্চয়তার কারণে, আমরা অন্য কিছু খেলোয়াড়দের সুযোগ দিতে চেয়েছিলাম যাতে প্রয়োজনে তারা খেলতে পারে।' এছাড়া তিনি বলেন, এশিয়া কাপ ও বিশ্বকাপ সামনে আসার চক্রের এই পর্যায়ে চোটের কারণে ভবিষ্যৎ-এর (Bigger Picture) দিকে তাকাতে হবে। আমরা প্রতিটি ম্যাচ এবং প্রতিটি সিরিজ নিয়ে উদ্বিগ্ন হতে পারি না এবং যদি আমরা এটি করি তবে আমি মনে করি এটি একটি ভুল হবে।","pubDate":"2023-07-30 06:24:45","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Watch: Virat makes young fan's day by wearing bracelet she made for him","link":"https://timesofindia.indiatimes.com/sports/cricket/india-in-west-indies/watch-virat-kohli-makes-a-young-fans-day-by-accepting-a-bracelet-she-made-for-him/articleshow/102246003.cms","keywords":null,"creator":null,"video_url":null,"description":"A young girl in Barbados had a dream-come-true moment on Saturday when Virat Kohli came all the way to her in the stands and not just accepted the bracelet she had made for him but also wore it.","content":"2nd ODI: West Indies beat India to level series Top-5: Bowlers who have taken most 'bowled' wickets Top-5: Best bowling spell by Asian bowlers in ODI World Cup Top-5: Most Test runs by a visiting batter at the Oval Broad first England bowler to claim 150 Ashes wickets 5th Ashes Test, Day 2: Australia take lead against England 2nd ODI: India eye series win against West Indies Stars who will not be playing the 2023 ODI World Cup Most runs scored in the league stage of MLC 2023 Most sixes by a batter in the league stage of MLC 2023","pubDate":"2023-07-30 06:23:43","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Lanka Premier League 2023: 30 जुलाई से शुरू हो रहा है लंका प्रीमियर लीग का चौथे संस्करण, यहां जानें एलपीएल की स्क्वाड, शेड्यूल और स्ट्रीमिंग समेत सारे डिटेल्स","link":"https://hindi.latestly.com/sports/cricket/the-fourth-edition-of-sri-lankas-t20-tournament-spl-is-starting-from-july-30-know-here-all-the-details-including-its-team-schedule-and-streaming-1881000.html","keywords":null,"creator":null,"video_url":null,"description":"30 जुलाई से शुरू होने वाले ग्रुप-स्टेज गेम्स में राउंड-रॉबिन लीग प्रारूप में टीमें दो बार एक-दूसरे का सामना करेंगी. अंक तालिका में शीर्ष चार टीमें प्लेऑफ के लिए क्वालीफाई करेंगी जो 17 अगस्त से शुरू होगी और 20 अगस्त को फाइनल खेला जाएगा तथा 21 अगस्त को वर्षा रिजर्व डे के रूप में रखा गया.","content":"Lanka Premier League 2023: 30 जुलाई से 21 अगस्त, 2023 तक लंका प्रीमियर लीग (एलपीएल) का आयोजन होने वाली है. यह बहुप्रतीक्षित लीग का चौथा संस्करण होगा जिसमें वैश्विक क्रिकेट के कुछ शीर्ष सितारे प्रतिष्ठित खिताब के लिए लड़ेंगे. एलपीएल की एक प्रेस विज्ञप्ति के अनुसार, 2023 संस्करण के लिए मैच दो स्थानों कोलंबो और कैंडी में आयोजित किए जाएंगे. 30 जुलाई से शुरू होने वाले ग्रुप-स्टेज गेम्स में राउंड-रॉबिन लीग प्रारूप में टीमें दो बार एक-दूसरे का सामना करेंगी. अंक तालिका में शीर्ष चार टीमें प्लेऑफ के लिए क्वालीफाई करेंगी जो 17 अगस्त से शुरू होगी और 20 अगस्त को फाइनल खेला जाएगा तथा 21 अगस्त को वर्षा रिजर्व डे के रूप में रखा गया. यह भी पढ़ें: लंका प्रीमियर लीग के नीलामी से पहले जानें भाग लेने वाली टीमें, सेलेक्टेड खिलाड़ी समेत स्ट्रीमिंग से संबंधित सारे डिटेल्स सीज़न में पांच टीमें भाग लेंगी - निरोशन डिकवेला की कप्तानी वाली कोलंबो स्ट्राइकर्स, कुसल मेंडिस की कप्तानी वाली दांबुला ऑरा, दासुन शनाका की कप्तानी वाली गॉल टाइटंस, वानिंदु हसरंगा की कप्तानी वाली बी-लव कैंडी और मौजूदा चैंपियन जाफना किंग्स की कप्तानी अनुभवी खिलाड़ी श्रीलंकाई ऑलराउंडर थिसारा परेरा करेंगे. चौथे संस्करण में डेविड मिलर, बाबर आजम, क्रिस लिन और शाकिब अल हसन जैसे शीर्ष अंतर्राष्ट्रीय सितारे भी शामिल होंगे जो लीग में महेश थीक्षाना, भानुका राजपक्षे और एंजेलो मैथ्यूज जैसे शीर्ष श्रेणी के श्रीलंकाई खिलाड़ियों के साथ प्रशंसकों का मनोरंजन करेंगे. लंका प्रीमियर लीग 2023 का स्ट्रीमिंग और टेलीकास्ट कब और कहां देखें? लंका प्रीमियर लीग 2023 का सीधा प्रसारण स्टार स्पोर्ट्स नेटवर्क पर किया जाएगा, जबकि लाइव स्ट्रीम फैनकोड ऐप पर उपलब्ध होगी. लंका प्रीमियर लीग 2023 का स्क्वाड: कोलंबो स्ट्राइकर्स की स्क्वाड: बाबर आजम, मथीशा पथिराना, नसीम शाह, चमिका करुणारत्ने, पथुम निसांका, अहान विक्रमसिंघे, धनंजय लक्षण, निरोशन डिकवेला, वहाब रियाज, लक्षण संदाकन, निपुण धनंजय, मोविन सुबासिंघे, लाहिरू उदारा, जेफरी वांडरसे, ईशान मलिंगा, शशिका दुलशन, नुवानीदु फर्नांडो , इफ्तिखार अहमद, लोर्कन टकर, कविशका अंजुला, रमेश मेंडिस, मोहम्मद नवाज, यशोदा लंका, एंजेलो परेरा दांबुला आभा की स्क्वाड: मैथ्यू वेड, कुसल मेंडिस, हसन अली, अविष्का फर्नांडो, धनंजय डी सिल्वा, कुसल परेरा, हेडन केर, सदीरा समरविक्रमा, बिनुरा फर्नांडो, नूर अहमद, सचिथा जयतिलके, जेनिथ लियानाज, दुशान हेमंथा, प्रमोद मदुशन, ट्रेवीन मैथ्यूज, शाहनवाज दहानी, लक्षण एदिरिसिंघे, जेहान डेनियल, वानुजा सहान, कविन्दु पथिरत्ने, रविन्दु फर्नांडो, एलेक्स रॉस, मनेलकर डी सिल्वा, प्रवीण जयविक्रमा गैल टाइटन्स की स्क्वाड: शाकिब अल हसन, दासुन शनाका, तबरेज़ शम्सी, भानुका राजपक्षे, सीकुगे प्रसन्ना, लाहिरू कुमारा, शेवोन डैनियल, लसिथ क्रूसपुले, सोहन डी लिवरा, अशान प्रियंजन, बेन कटिंग, मोहम्मद मिथुन, मिनोद भानुका, पसिंदु सोरियाबंदरा, अविष्का परेरा, मोहम्मद शिराज, लाहिरू समराकून, कासुन राजिथा, अकिला धनंजय, चाड बोवेस, टिम सीफर्ट, सोनल दिनुशा, विश्वा फर्नांडो, अनुक फर्नांडो जाफना किंग्स की स्क्वाड: डेविड मिलर, महेश थीक्षाना, रहमानुल्लाह गुरबाज़, थिसारा परेरा, चैरिथ असलांका, डुनिथ वेलालेज, शोएब मलिक, पथुम कुमारा, विजयकांत व्यासकांत, थेसन विथुशन, असंका मनोज, निशान मदुश्का, असिथा फर्नांडो, हार्डस विलोजेन, नुवान तुषारा, दिलशान मदुशंका, ज़मान खान , आशान रंदिका, रत्नाराजा थानुरादान, क्रिस लिन, असेला गुणरत्ने बी-लव कैंडी की स्क्वाड: मुजीब उर रहमान, वानिंदु हसरंगा, फखर जमान, एंजेलो मैथ्यूज, इसुरु उदाना, दिनेश चंडीमल, मोहम्मद हसनैन, दुशमंथा चमीरा, सहान अराचिगे, एशेन बंडारा, मोहम्मद हारिस, नवोद परानाविथाना, आसिफ अली, कामिंडु मेंडिस, नुवान प्रदीप, चतुरंगा डी सिल्वा, लाहिरू मदुशंका, आमेर जमाल, मालशा थारुपथी, थानुका डाबारे, लसिथ अबेरत्ने, अविष्का थारिन्दु टूर्नामेंट का शेड्यूल: 30 जुलाई, रविवार: शाम 7 बजे: जाफना किंग्स बनाम कोलंबो स्ट्राइकर्स - कोलंबो 31 जुलाई, सोमवार: दोपहर 3 बजे: गॉल टाइटंस बनाम दांबुला ऑरा - कोलंबो l शाम 7 बजे: बी लव कैंडी बनाम कोलंबो स्ट्राइकर्स - कोलंबो 1 अगस्त, मंगलवार: दोपहर 3 बजे: दांबुला ऑरा बनाम जाफना किंग्स - कोलंबो l शाम 7 बजे: गॉल टाइटंस बनाम बी लव कैंडी - कोलंबो 2 अगस्त, बुधवार: रेस्ट डे 3 अगस्त, गुरुवार: रेस्ट डे 4 अगस्त, शुक्रवार: दोपहर 3 बजे: बी लव कैंडी बनाम दांबुला ऑरा - कैंडी एल शाम 7 बजे: गॉल टाइटंस बनाम जाफना किंग्स - कैंडी 5 अगस्त, शनिवार: दोपहर 3 बजे: कोलंबो स्ट्राइकर्स बनाम दांबुला ऑरा - कैंडी l शाम 7 बजे: बी लव कैंडी बनाम जाफना किंग्स - कैंडी 6 अगस्त, रविवार: रेस्ट डे 7 अगस्त, सोमवार: दोपहर 3 बजे: कोलंबो स्ट्राइकर्स बनाम गॉल टाइटंस - कैंडी l शाम 7 बजे: दांबुला ऑरा बनाम जाफना किंग्स - कैंडी 8 अगस्त, मंगलवार: दोपहर 3 बजे: गॉल टाइटंस बनाम बी लव कैंडी - कैंडी, शाम 7 बजे: जाफना किंग्स बनाम कोलंबो स्ट्राइकर्स - कैंडी 9 अगस्त, बुधवार: रेस्ट डे 10 अगस्त, गुरुवार: रेस्ट डे 11 अगस्त, शुक्रवार: शाम 7 बजे: दांबुला ऑरा बनाम गॉल टाइटंस - कोलंबो 12 अगस्त, शनिवार: दोपहर 3 बजे: जाफना किंग्स बनाम बी लव कैंडी - कोलंबो l शाम 7 बजे: दांबुला ऑरा बनाम कोलंबो स्ट्राइकर्स - कोलंबो 13 अगस्त, रविवार: दोपहर 3 बजे: जाफना किंग्स बनाम गॉल टाइटंस - कोलंबो l शाम 7 बजे: कोलंबो स्ट्राइकर्स बनाम बी लव कैंडी - कोलंबो 14 अगस्त, सोमवार: शाम 7 बजे: बी लव कैंडी बनाम दांबुला ऑरा - कोलंबो 15 अगस्त, मंगलवार: शाम 7 बजे: कोलंबो स्ट्राइकर्स बनाम गॉल टाइटंस - कोलंबो 16 अगस्त, बुधवार: रेस्ट डे 17 अगस्त, गुरुवार: दोपहर 3 बजे: क्वालीफायर 1 (1 बनाम 2) - कोलंबो l शाम 7 बजे: एलिमिनेटर (3 बनाम 4) - कोलंबो 18 अगस्त, शुक्रवार: रेस्ट डे 19 अगस्त, शनिवार: शाम 7 बजे: क्वालीफायर 2 (हारे हुए क्यूएफ 1 बनाम विजेता एलिमिनेटर) - कोलंबो 20 अगस्त, रविवार: शाम 7 बजे: फाइनल - कोलंबो 21 अगस्त, सोमवार: रेन रिजर्व डे","pubDate":"2023-07-30 08:22:52","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Yuvraj Singh’s historic six sixes molded me into the competitor I am today: Stuart Broad","link":"https://kalingatv.com/sports/yuvraj-singhs-historic-six-sixes-molded-me-into-the-competitor-i-am-today-stuart-broad/","keywords":["Sports","Cricket","Yuvraj Singh"],"creator":["Deepa Sharma"],"video_url":null,"description":"England’s veteran pacer, Stuart Broad, looked back on a defining moment in his cricketing career, attributing his transformation into a formidable competitor to Yuvraj Singh’s iconic six sixes during the 2007 T20 World Cup clash between India and England in Durban. In a press conference, Broad acknowledged that the unforgettable encounter, was instrumental in shaping […] The post Yuvraj Singh’s historic six sixes molded me into the competitor I am today: Stuart Broad appeared first on KalingaTV.","content":"England’s veteran pacer, Stuart Broad, looked back on a defining moment in his cricketing career, attributing his transformation into a formidable competitor to Yuvraj Singh’s iconic six sixes during the 2007 T20 World Cup clash between India and England in Durban. In a press conference, Broad acknowledged that the unforgettable encounter, was instrumental in shaping his mental approach to the game. The momentous match on September 19, 2007, saw Yuvraj Singh, in a sensational display of power-hitting, become the first batsman to dispatch six consecutive sixes in an over during a T20 International. The 22-year-old Broad found himself on the receiving end of Yuvraj’s ferocious assault, as the Indian batsman sent the ball soaring into all corners of the stadium, propelling India’s total beyond the formidable 200-run mark. Reflecting on that day, Broad admitted, “Yeah, it was obviously a pretty tough day. What would I have been: 21, 22? [22] I learned loads. I pretty much based a whole mental routine through that experience, knowing that I was left very short as an international performer in that moment. I’d rushed my preparation. I didn’t have any sort of pre-ball routine. I didn’t have any focus, particularly, and I started building my ‘warrior mode’ that I call it after that experience.” “You obviously go through massive peaks and troughs, and when you look at someone like Stokesy’s career, he’s done that sort of thing as well. Most players have. But ultimately I think it’s that bounce-back ability and that ability to be able to put poor days behind you because certainly one thing over the past whatever – 15, 16 years – you have a lot more bad days than good days in cricket so you have to be able to deal with them to make sure your good days can flourish,” Broad concluded. Prev News Next News","pubDate":"2023-07-30 08:06:01","image_url":null,"source_id":"kalingatv","category":["sports"],"country":["india"],"language":"english"},{"title":"How to Watch North Zone vs West Zone, Deodhar Trophy 2023 Live Streaming Online? Get Free Live Telecast of NZ vs WZ Cricket Match With Time in IST","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-north-zone-vs-west-zone-deodhar-trophy-2023-live-streaming-online-get-free-live-telecast-of-nz-vs-wz-cricket-match-with-time-in-ist-5303497.html","keywords":null,"creator":null,"video_url":null,"description":"While West Zone would be confident of their win against Central Zone in the last match, North Zone would want to bounce back hard from a loss to East Zone in their previous encounter. Scroll down to get live streaming and telecast details of this match,","content":"North Zone will face West Zone in the Deodhar Trophy 2023 on Sunday, July 30. The fixture is set to feature some exciting names in the competition and it would be played at the Cricket Association Puducherry Siechem Ground, starting at 1:30 pm IST (Indian Standard Time). The live telecast of this match will not be available as there is no official broadcast partner, with BCCI's media rights yet to be sold. But fans can watch live streaming online of this match on the BCCI.TV and BCCI app and website. Deodhar Trophy 2023: West Zone Win Thriller Over Central Zone by 1 Wicket. Deodhar Trophy Live Streaming Just 1️⃣ Day to go for the #DeodharTrophy to begin 🏆 Catch all the LIVE action on https://t.co/pQRlXkCguc and the official BCCI APP 📱 pic.twitter.com/RSfbNlZFnK — BCCI Domestic (@BCCIdomestic) July 23, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-30 07:57:02","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"7 Sixes In 1 Over: काबुल प्रीमियर लीग में आमिर ज़ज़ई ने बनाया अनचाहा रिकॉर्ड, 1 ओवर में दिए 7 छक्कों समेत 48 रन","link":"https://hindi.latestly.com/socially/sports/cricket/aamir-zazai-creates-unwanted-record-in-kabul-premier-league-48-runs-including-7-sixes-in-1-over-1880988.html","keywords":null,"creator":null,"video_url":null,"description":"न्यूजीलैंड के गेंदबाज जेम्स फुलर ने पहले यह रिकॉर्ड अपने नाम किया था, उन्होंने ग्लॉस्टरशायर और ससेक्स के बीच टी20 ब्लास्ट मैच में एक ओवर में 38 रन दिए थे. स्कॉट स्टायरिस ने फुलर के खिलाफ बल्ले से 34 रन बनाए, जबकि ग्लॉस्टरशायर के गेंदबाज ने अतिरिक्त के रूप में चार रन दिए.","content":"Kabul Premier League 2023: शनिवार को अफगानिस्तान के अनकैप्ड स्पिनर आमिर ज़ज़ई ने रिकॉर्ड बुक में जगह बनाई, लेकिन उस तरह से नहीं जिस पर उन्हें गर्व हो. उन्होंने काबुल प्रीमियर लीग मैच के एक ओवर में 48 रन दिए, जिससे टी20 मैच के एक ओवर में किसी गेंदबाज द्वारा दिए गए सर्वाधिक रन का नया विश्व रिकॉर्ड बन गया. न्यूजीलैंड के गेंदबाज जेम्स फुलर ने पहले यह रिकॉर्ड अपने नाम किया था, उन्होंने ग्लॉस्टरशायर और ससेक्स के बीच टी20 ब्लास्ट मैच में एक ओवर में 38 रन दिए थे. स्कॉट स्टायरिस ने फुलर के खिलाफ बल्ले से 34 रन बनाए, जबकि ग्लॉस्टरशायर के गेंदबाज ने अतिरिक्त के रूप में चार रन दिए. वीडियो देखें: 48 runs from 1 over. @Sediq_Atal26 is now in the cricketing history books. Equalled Rituraj Gaikwad's 7 sixes in an over. Poor Amir Zazai, almost escaped a heartache. This 💯 must open the doors of international cricket & leagues for Atal. 🇦🇫 #FutureStar #WorldRecord #SevenSixes pic.twitter.com/Ntt0lkZVUm — Cricket Afghanistan (@AFG_Sports) July 29, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-30 07:36:33","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Un centro de cricket dentro del 'Sky Stadium', el estadio donde jugará España","link":"https://www.marca.com/futbol/futbol-femenino/seleccion/2023/07/30/64c5d22aca474117568b4594.html","keywords":["Selección Femenina Fútbol España","Fútbol Femenino","Mundial femenino de fútbol"],"creator":["Pablo Parra"],"video_url":null,"description":null,"content":"a selección española jugará su tercer partido en el Sky Stadium, Estadio regional de Wellington, para la FIFA. Se trata de un ciertamente incómodo para los medios de comunicación y que el máximo organismo del fútbol mundial ha tenido que adaptar para el campeonato del mundo. . Habitualmente es un estadio de rugby, donde juegan los Wellington Lions y los Wellington Hurricanes. Es también el hogar del equipo de fútbol Wellington Phoenix, de la A-League. A ello hay que sumar que dentro del estadio, lo que en este Mundial está siendo el centro de trabajo de los medios de comunicación, . Concretamente es la Escuela de Wellington de Cricket, dirigida por la Asociación de Cricket de Wellington.. De hecho, el techo conserva las redes y las mallas necesarias en dicho deporte. En una de las paredes, aparecen nombres históricos del cricket de la ciudad. Por otro lado, el recorrido que existe entre la tribuna habilitada para los medios de comunicación es tan largo que para poder facilitar el trabajo al término de los encuentros. . Aquí debutó contra Costa Rica con una victoria contundente por 3-0 gracias a los goles de la selección 'tica' en propia puerta, Esther González y Aitana Bonmatí, con lo cual ya sabe lo que es lograr una victoria en este especial enclave a las afueras de la ciudad en el que, además, se nota el paso de los trenes por las vías aledañas al terreno de juego.","pubDate":"2023-07-30 07:34:18","image_url":"https://phantom-marca.unidadeditorial.es/07c687b17b0dd30220174a13768dc04e/crop/0x168/2047x1533/resize/2047/assets/multimedia/imagenes/2023/07/30/16907021574049.jpg","source_id":"marca","category":["sports"],"country":["colombia"],"language":"spanish"},{"title":"‘To Take 600 Wickets and…’ Team India Head Coach Rahul Dravid Praises 'Special Cricketer' Stuart Broad With England Pacer Set to Retire After Ashes 2023","link":"https://www.latestly.com/agency-news/sports-news-retiring-broad-is-a-special-cricketer-dravid-5303330.html","keywords":null,"creator":null,"video_url":null,"description":"India head coach Rahul Dravid has described the retiring England fast bowler Stuart Broad as a \"special cricketer\", whose great partnership with James Anderson will be remembered for ages.","content":"Bridgetown, July 30 : India head coach Rahul Dravid has described the retiring England fast bowler Stuart Broad as a \"special cricketer\", whose great partnership with James Anderson will be remembered for ages. The 37-year-old Broad on Saturday announced that he will retire from international cricket after the conclusion of the ongoing final Ashes Test against Australia at The Kia Oval in London. IND vs WI 2nd ODI 2023: Bowlers, Shai Hope Help West Indies Level Series . \"He (Broad) has been a terrific bowler, he has been a great. His partnership with Jimmy Anderson will always be remembered,\" Dravid said after India lost to West Indies by six wickets in the second ODI here. \"Anderson and Broad the whole decade they played for England, they have really put in some fantastic performances,\" said the batting legend and former India captain. \"To take 600 wickets and to play the number of Test matches he has takes a special kind of cricketer,\" he added. Broad has been a key member of the England Test side since making his debut against Sri Lanka in December 2007. He will retire with 167 caps, and is the second highest Test wicket-taker after Anderson among pacers. He had taken 600 wickets before the ongoing final Ashes Test. The right-arm seamer, who made his first-class debut for Leicestershire in 2005 and later moved to Nottinghamshire, has played 121 ODIs and 56 T20 Internationals, picking up 178 and 65 wickets respectively. Dravid congratulated Broad on a wonderful career. \"My best wishes to him and congratulations on a fantastic career. I hope he gets to finish it off in the best possible way he wants to,\" he said.","pubDate":"2023-07-30 07:31:53","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Lanka Premier League 2023: All You Need to Know About Fourth Edition of Sri Lanka's T20 Tournament","link":"https://www.latestly.com/agency-news/sports-news-lanka-premier-league-all-you-need-to-know-about-fourth-edition-of-tournament-5302111.html","keywords":null,"creator":null,"video_url":null,"description":"The season will see the participation of five teams - Colombo Strikers captained by Niroshan Dickwella, Dambulla Aura captained by Kusal Mendis, Galle Titans led by Dasun Shanaka, B-Love Kandy captained by Wanindu Hasaranga and the defending champions Jaffna Kings will be led by veteran Srilankan allrounder Thisara Perera.","content":"Colombo [Sri Lanka], July 29 : The Lanka Premier League (LPL) is scheduled to take place from July 30 to August 21, 2023. This will be the fourth edition of the highly anticipated league which will feature some top stars from global cricket fighting for the coveted title. As per a press release from LPL, the matches will be held across two venues Colombo and Kandy for the 2023 edition. ‘Playing Virat and Rohit Would Not Have Given Us...’ Head Coach Rahul Dravid Explains Why Virat Kohli, Rohit Sharma Did Not Play IND vs WI 2nd ODI 2023 (Watch Video) The season will see the participation of five teams - Colombo Strikers captained by Niroshan Dickwella, Dambulla Aura captained by Kusal Mendis, Galle Titans led by Dasun Shanaka, B-Love Kandy captained by Wanindu Hasaranga and the defending champions Jaffna Kings will be led by veteran Srilankan allrounder Thisara Perera. The fourth edition will also feature top International stars like David Miller, Babar Azam, Chris Lynn and Shakib Al Hasan who will be entertaining the fans in the league along with top-class Sri Lankan players like Mahesh Theekshana, Bhanuka Rajapaksa and Angelo Mathews. Ashes 2023: Ricky Ponting Keen To See England's Batting Approach in Second Innings of ENG vs AUS 5th Test. The teams will be facing each other twice in a round-robin league format in group-stage games starting from July 30. The top four teams on the points table will qualify for the playoffs which will begin on August 17 and the final will be played on August 20 with August 21 kept as a rain reserve day. *Team Captains -Colombo Strikers: Niroshan Dickwella-Dambulla Aura: Kusal Mendis-Galle Titans: Dasun Shanaka-Jaffna Kings: Thisara Perera-B-Love Kandy: Wanindu Hasaranga *Squads -Colombo Strikers Babar Azam, Matheesha Pathirana, Naseem Shah, Chamika Karunaratne, Pathum Nissanka, Ahan Wickramasinghe, Dhananjaya Lakshan, Niroshan Dickwella, Wahab Riaz, Lakshan Sandakan, Nipun Dananjaya, Movin Subasinghe, Lahiru Udara, Jeffrey Vandersay, Eshan Malinga, Shashika Dulshan, Nuwanidu Fernando, Iftikhar Ahmed, Lorcan Tucker, Kavishka Anjula, Ramesh Mendis, Mohammad Nawaz, Yashodha Lanka, Angelo Perera -Dambulla Aura Matthew Wade, Kusal Mendis, Hassan Ali, Avishka Fernando, Dhananjaya de Silva, Kusal Perera, Hayden Kerr, Sadeera Samarawickrama, Binura Fernando, Noor Ahmad, Sachitha Jayatilake, Janith Liyanage, Dushan Hemantha, Pramod Madushan, Treveen Mathews, Shahnawaz Dahani, Lakshan Edirisinghe, Jehan Daniel, Wanuja Sahan, Kavindu Pathirathne, Ravindu Fernando, Alex Ross, Manelker de Silva, Praveen Jayawickrama -Galle Titans Shakib Al Hasan, Dasun Shanaka, Tabraiz Shamsi, Bhanuka Rajapaksa, Seekkuge Prasanna, Lahiru Kumara, Shevon Daniel, Lasith Croospulle, Sohan de Livera, Ashan Priyanjan, Ben Cutting, Mohammad Mithun, Minod Bhanuka, Pasindu Sooriyabandara, Avishka Perera, Mohamed Shiraz, Lahiru Samarakoon, Kasun Rajitha, Akila Dananjaya, Chad Bowes, Tim Seifert, Sonal Dinusha, Vishwa Fernando, Anuk Fernando -Jaffna Kings David Miller, Maheesh Theekshana, Rahmanullah Gurbaz, Thisara Perera, Charith Asalanka, Dunith Wellalage, Shoaib Malik, Pathum Kumara, Vijayakanth Viyaskanth, Theesan Vithushan, Asanka Manoj, Nishan Madushka, Asitha Fernando, Hardus Viljoen, Nuwan Thushara, Dilshan Madushanka, Zaman Khan, Ashan Randika, Rathnaraja Thanuradan, Chris Lynn, Asela Gunaratne -B-Love Kandy Mujeeb Ur Rahman, Wanindu Hasaranga, Fakhar Zaman, Angelo Mathews, Isuru Udana, Dinesh Chandimal, Mohammad Hasnain, Dushmantha Chameera, Sahan Arachchige, Ashen Bandara, Mohammad Haris, Navod Paranavithana, Asif Ali, Kamindu Mendis, Nuwan Pradeep, Chathuranga de Silva, Lahiru Madushanka, Aamer Jamal, Malsha Tharupathi, Thanuka Dabare, Lasith Abeyratne, Avishka Tharindu Fixtures: July 30, Sunday: 7 PM: Jaffna Kings vs Colombo Strikers - Colombo July 31, Monday : 3 PM: Galle Titans vs Dambulla Aura - Colombo l 7 PM: B Love Kandy vs Colombo Strikers - Colombo August 1, Tuesday : 3 PM: Dambulla Aura vs Jaffna Kings - Colombo l 7 PM: Galle Titans vs B Love Kandy - Colombo August 2, Wednesday: Rest Day August 3, Thursday: Rest Day August 4, Friday: 3 PM: B Love Kandy vs Dambulla Aura - Kandy l 7 PM: Galle Titans vs Jaffna Kings - Kandy August 5, Saturday : 3 PM: Colombo Strikers vs Dambulla Aura - Kandy l 7 PM: B Love Kandy vs Jaffna Kings - Kandy August 6, Sunday: Rest day August 7, Monday : 3 PM: Colombo Strikers vs Galle Titans - Kandy l 7 PM: Dambulla Aura vs Jaffna Kings - Kandy August 8, Tuesday : 3 PM: Galle Titans vs B Love Kandy - Kandy l 7 PM: Jaffna Kings vs Colombo Strikers - Kandy August 9, Wednesday: Rest day August 10, Thursday: Rest day August 11, Friday: 7 PM: Dambulla Aura vs Galle Titans - Colombo August 12, Saturday : 3 PM: Jaffna Kings vs B Love Kandy - Colombo l 7 PM: Dambulla Aura vs Colombo Strikers - Colombo August 13, Sunday : 3 PM: Jaffna Kings vs Galle Titans - Colombo l 7 PM: Colombo Strikers vs B Love Kandy - Colombo August 14 , Monday: 7 PM: B Love Kandy vs Dambulla Aura - Colombo August 15, Tuesday: 7 PM: Colombo Strikers vs Galle Titans - Colombo August 16, Wednesday: Rest Day August 17 , Thursday : 3 PM: Qualifier 1 ( 1 vs 2 ) - Colombo l 7 PM: Eliminator ( 3 vs 4) – Colombo August 18, Friday: Rest day August 19, Saturday: 7 PM: Qualifier 2 ( looser QF 1 vs Winner Eliminator ) - Colombo August 20, Sunday: 7 PM : Final - Colombo August 21, Monday: Rain Reserve Day. The Lanka Premier League 2023 will be telecasted live on Star Sports network, and the Live stream will be available on the Fancode app.","pubDate":"2023-07-30 07:27:56","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"'It's Magic', संजू सैमसन खड़े-खड़े हो गए आउट, पिच पर गजब अंदाज में 90 डिग्री के कोण से घूमी गेंद, Video","link":"https://sports.ndtv.com/hindi/cricket/sanju-samson-wicket-video-viral-2nd-odi-ind-vs-wi-yannic-cariah-bowling-4252685#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Sanju Samson wicket video viral 2nd ODI, दूसरे वनडे में संजू सैमसन का बल्ला खामोश रहा और केवल 9 रन ही बना सके, सैमसन जिस अंदाज में आउट हुए वह गेंद यकीनन चौकेने वाली थी.","content":"संजू सैमसन का नहीं चला बल्ला वेस्टइंडीज के खिलाफ दूसरे वनडे मैच (WI vs IND 2nd ODI) में भारत को हार का सामना करना पड़ा. वेस्टइंडीज ने भारत को 6 विकेट से हारकर वनडे सीरीज को बराबरी कर लाकर खड़ा कर दिया. बता दें कि दूसरे वनडे में भारतीय बल्लेबाज पूरी तरह से फ्लॉप रहे, यही कारण रहा कि बारिश से प्रभावित मैच में भारतीय पारी केवल 181 रन ही बना सकी. जिसके बाद 4 विकेट खोकर वेस्टइंडीज ने लक्ष्य को 37वें ओवर में हासिल कर लिया. बता दें कि दूसरे वनडे में जहां कोहली और रोहित (Kohli-Rohit) को आराम दिया गया तो वहीं दूसरी ओर संजू सैमसन (Sanju Samson Wicket) को मौका मिला. लेकिन एक बार फिर सैमसन उम्मीद पर खड़े नहीं उतर पाए और केवल 9 रन बनाकर स्पिनर यानिक कारिया (Yannic Cariah) की गेंद पर स्लिप में कैच कर लिए गए. सैमसन ने 19 गेंद का सामना किया लेकिन अपनी पारी में वो खुलकर नहीं खेल पाए. बता दें कि यानिक कारिया ने अपनी करिश्माई गेंद पर सैमसन को फंसाया जिसका वीडियो अब सोशल मीडिया पर वायरल हो रहा है. दरअसल, सैमसन खड़े रह गए और गेंद उनके बल्ले से लगकर स्लिप में गई. यानिक कारिया की यह गेंद इतनी कमाल की थी कि बल्लेबाज को यकीन ही नहीं हुआ कि वो इस तरह से कैच आउट हो सकते हैं. Sanju Samson had a short stay in the middle. . . हुआ ये कि गेंद लेग स्टंप की लाइन पर टप्पा खाने के बाद उल्टी दिशा में तेजी से घूमती है, और पलक झपकते ही गेंद बल्ले से लगकर स्लिप में चली जाती है. बल्लेबाज सैमसन को अपना बल्ला हटाने का समय ही नहीं मिल पाता है और कैच आउट हो जाते हैं. आउट होने के बाद सैमसन पिच पर खड़े-खड़े सोचने लग जाते हैं और आखिर में निराश मन के साथ पवेलियन लौट पड़ते हैं. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-07-30 06:35:55","image_url":"https://c.ndtvimg.com/2023-07/hdo3s3og_samson_625x300_30_July_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Dravid on Virat-Rohit's Rest, IND vs WI: বিরাট-রোহিতকে ছাড়া লজ্জার হার ভারতের, বিশ্রামের কারণ কি বললেন কোচ দ্রাবিড়?","link":"https://bangla.latestly.com/sports/cricket/dravid-on-virat-rohits-rest-ind-vs-wi-indias-embarrassing-defeat-without-virat-rohit-what-is-the-reason-for-rest-coach-dravid-said-230868.html","keywords":null,"creator":null,"video_url":null,"description":"তিনি বলেন, 'এই ধরনের সিরিজে যখন মাত্র দুই বা তিনটি ম্যাচ বাকি রয়েছে, রোহিত ও বিরাটকে খেলালে আমরা খুব বেশি উত্তর দিতাম না। এনসিএতে আমাদের কিছু খেলোয়াড়দের চোট এবং তাদের ঘিরে কিছু অনিশ্চয়তার কারণে, আমরা অন্য কিছু খেলোয়াড়দের সুযোগ দিতে চেয়েছিলাম যাতে প্রয়োজনে তারা খেলতে পারে","content":"শনিবার বার্বাডোসে ওয়েস্ট ইন্ডিজের কাছে দ্বিতীয় ওয়ানডেতে হেরে যাওয়া দলের দুই গুরুত্বপূর্ণ খেলোয়াড়কে বাদ দেওয়ার সিদ্ধান্তকে সমর্থন করেছেন ভারতীয় কোচ রাহুল দ্রাবিড়। ৫০ ওভারের ম্যাচে অধিনায়ক রোহিত শর্মা এবং অভিজ্ঞ ব্যাটসম্যান বিরাট কোহলিকে বিশ্রামে রাখে ভারত এবং এই পদক্ষেপের ফলে ক্যারিবিয়ানরা ছয় উইকেটে ম্যাচ জিতে নেয় এবং সিরিজ নির্ণায়ক ম্যাচের আগে ব্যবধানে ১-১ করে দেয়। দ্রাবিড় বলেন, আসন্ন এশিয়া কাপ ও আইসিসি পুরুষ ক্রিকেট বিশ্বকাপের আগে সঞ্জু স্যামসন, ইশান কিষাণ এবং সূর্যকুমার যাদবের মতো খেলোয়াড়দের দিকে নজর দেওয়া তাঁর পক্ষে গুরুত্বপূর্ণ ছিল। IND vs WI 2nd ODI Results: মহাতারকাদের অবাক বিশ্রামে মহালজ্জার হারে মাথাহেঁট, টিম ইন্ডিয়াকে হারিয়ে ক্যারিবিয়ান কামব্যাকের ক্যালিপসো দ্রাবিড় বলেন, 'এটাই ছিল আমাদের শেষ সুযোগ ছিল আমাদের কিছু খেলোয়াড়কে পরীক্ষা করার। আমরা আমাদের কয়েকজন খেলোয়াড়কে পেয়েছি যারা চোটের কারণে এনসিএতে আছে। এশিয়া কাপের আর এক মাস বাকি থাকতেই আমাদের অনেক দিক থেকে সময় ফুরিয়ে যাচ্ছে। আমরা আশাবাদী যে তাদের (চোটে থাকা খেলোয়াড়) কেউ কেউ এশিয়া কাপ ও বিশ্বকাপের জন্য ফিট হয়ে যাবে, কিন্তু আমরা সেই কারণে চান্স নিতে পারব না। আমাদের অন্যদের নিয়ে চেষ্টা করতে হবে এবং অন্যদের সুযোগ দিতে হবে যাতে সবচেয়ে খারাপ পরিস্থিতিতে কমপক্ষে তাদের পিছনে খেলার সময় থাকে এবং এটি আমাদের খেলোয়াড়দের সম্পর্কে কিছু সিদ্ধান্ত নেওয়ার সুযোগ দেয়।' Head Coach Rahul Dravid explains #TeamIndia 's selection in the second #WIvIND ODI 🔽 pic.twitter.com/65rZUtuIaV — BCCI (@BCCI) July 29, 2023 তিনি আরও যোগ করে বলেন, 'এই ধরনের সিরিজে যখন মাত্র দুই বা তিনটি ম্যাচ বাকি রয়েছে, রোহিত ও বিরাটকে খেলালে আমরা খুব বেশি উত্তর দিতাম না। এনসিএতে আমাদের কিছু খেলোয়াড়দের চোট এবং তাদের ঘিরে কিছু অনিশ্চয়তার কারণে, আমরা অন্য কিছু খেলোয়াড়দের সুযোগ দিতে চেয়েছিলাম যাতে প্রয়োজনে তারা খেলতে পারে।' এছাড়া তিনি বলেন, এশিয়া কাপ ও বিশ্বকাপ সামনে আসার চক্রের এই পর্যায়ে চোটের কারণে ভবিষ্যৎ-এর (Bigger Picture) দিকে তাকাতে হবে। আমরা প্রতিটি ম্যাচ এবং প্রতিটি সিরিজ নিয়ে উদ্বিগ্ন হতে পারি না এবং যদি আমরা এটি করি তবে আমি মনে করি এটি একটি ভুল হবে।","pubDate":"2023-07-30 06:24:45","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Watch: Virat makes young fan's day by wearing bracelet she made for him","link":"https://timesofindia.indiatimes.com/sports/cricket/india-in-west-indies/watch-virat-kohli-makes-a-young-fans-day-by-accepting-a-bracelet-she-made-for-him/articleshow/102246003.cms","keywords":null,"creator":null,"video_url":null,"description":"A young girl in Barbados had a dream-come-true moment on Saturday when Virat Kohli came all the way to her in the stands and not just accepted the bracelet she had made for him but also wore it.","content":"2nd ODI: West Indies beat India to level series Top-5: Bowlers who have taken most 'bowled' wickets Top-5: Best bowling spell by Asian bowlers in ODI World Cup Top-5: Most Test runs by a visiting batter at the Oval Broad first England bowler to claim 150 Ashes wickets 5th Ashes Test, Day 2: Australia take lead against England 2nd ODI: India eye series win against West Indies Stars who will not be playing the 2023 ODI World Cup Most runs scored in the league stage of MLC 2023 Most sixes by a batter in the league stage of MLC 2023","pubDate":"2023-07-30 06:23:43","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Lanka Premier League 2023: 30 जुलाई से शुरू हो रहा है लंका प्रीमियर लीग का चौथे संस्करण, यहां जानें एलपीएल की स्क्वाड, शेड्यूल और स्ट्रीमिंग समेत सारे डिटेल्स","link":"https://hindi.latestly.com/sports/cricket/the-fourth-edition-of-sri-lankas-t20-tournament-spl-is-starting-from-july-30-know-here-all-the-details-including-its-team-schedule-and-streaming-1881000.html","keywords":null,"creator":null,"video_url":null,"description":"30 जुलाई से शुरू होने वाले ग्रुप-स्टेज गेम्स में राउंड-रॉबिन लीग प्रारूप में टीमें दो बार एक-दूसरे का सामना करेंगी. अंक तालिका में शीर्ष चार टीमें प्लेऑफ के लिए क्वालीफाई करेंगी जो 17 अगस्त से शुरू होगी और 20 अगस्त को फाइनल खेला जाएगा तथा 21 अगस्त को वर्षा रिजर्व डे के रूप में रखा गया.","content":"Lanka Premier League 2023: 30 जुलाई से 21 अगस्त, 2023 तक लंका प्रीमियर लीग (एलपीएल) का आयोजन होने वाली है. यह बहुप्रतीक्षित लीग का चौथा संस्करण होगा जिसमें वैश्विक क्रिकेट के कुछ शीर्ष सितारे प्रतिष्ठित खिताब के लिए लड़ेंगे. एलपीएल की एक प्रेस विज्ञप्ति के अनुसार, 2023 संस्करण के लिए मैच दो स्थानों कोलंबो और कैंडी में आयोजित किए जाएंगे. 30 जुलाई से शुरू होने वाले ग्रुप-स्टेज गेम्स में राउंड-रॉबिन लीग प्रारूप में टीमें दो बार एक-दूसरे का सामना करेंगी. अंक तालिका में शीर्ष चार टीमें प्लेऑफ के लिए क्वालीफाई करेंगी जो 17 अगस्त से शुरू होगी और 20 अगस्त को फाइनल खेला जाएगा तथा 21 अगस्त को वर्षा रिजर्व डे के रूप में रखा गया. यह भी पढ़ें: लंका प्रीमियर लीग के नीलामी से पहले जानें भाग लेने वाली टीमें, सेलेक्टेड खिलाड़ी समेत स्ट्रीमिंग से संबंधित सारे डिटेल्स सीज़न में पांच टीमें भाग लेंगी - निरोशन डिकवेला की कप्तानी वाली कोलंबो स्ट्राइकर्स, कुसल मेंडिस की कप्तानी वाली दांबुला ऑरा, दासुन शनाका की कप्तानी वाली गॉल टाइटंस, वानिंदु हसरंगा की कप्तानी वाली बी-लव कैंडी और मौजूदा चैंपियन जाफना किंग्स की कप्तानी अनुभवी खिलाड़ी श्रीलंकाई ऑलराउंडर थिसारा परेरा करेंगे. चौथे संस्करण में डेविड मिलर, बाबर आजम, क्रिस लिन और शाकिब अल हसन जैसे शीर्ष अंतर्राष्ट्रीय सितारे भी शामिल होंगे जो लीग में महेश थीक्षाना, भानुका राजपक्षे और एंजेलो मैथ्यूज जैसे शीर्ष श्रेणी के श्रीलंकाई खिलाड़ियों के साथ प्रशंसकों का मनोरंजन करेंगे. लंका प्रीमियर लीग 2023 का स्ट्रीमिंग और टेलीकास्ट कब और कहां देखें? लंका प्रीमियर लीग 2023 का सीधा प्रसारण स्टार स्पोर्ट्स नेटवर्क पर किया जाएगा, जबकि लाइव स्ट्रीम फैनकोड ऐप पर उपलब्ध होगी. लंका प्रीमियर लीग 2023 का स्क्वाड: कोलंबो स्ट्राइकर्स की स्क्वाड: बाबर आजम, मथीशा पथिराना, नसीम शाह, चमिका करुणारत्ने, पथुम निसांका, अहान विक्रमसिंघे, धनंजय लक्षण, निरोशन डिकवेला, वहाब रियाज, लक्षण संदाकन, निपुण धनंजय, मोविन सुबासिंघे, लाहिरू उदारा, जेफरी वांडरसे, ईशान मलिंगा, शशिका दुलशन, नुवानीदु फर्नांडो , इफ्तिखार अहमद, लोर्कन टकर, कविशका अंजुला, रमेश मेंडिस, मोहम्मद नवाज, यशोदा लंका, एंजेलो परेरा दांबुला आभा की स्क्वाड: मैथ्यू वेड, कुसल मेंडिस, हसन अली, अविष्का फर्नांडो, धनंजय डी सिल्वा, कुसल परेरा, हेडन केर, सदीरा समरविक्रमा, बिनुरा फर्नांडो, नूर अहमद, सचिथा जयतिलके, जेनिथ लियानाज, दुशान हेमंथा, प्रमोद मदुशन, ट्रेवीन मैथ्यूज, शाहनवाज दहानी, लक्षण एदिरिसिंघे, जेहान डेनियल, वानुजा सहान, कविन्दु पथिरत्ने, रविन्दु फर्नांडो, एलेक्स रॉस, मनेलकर डी सिल्वा, प्रवीण जयविक्रमा गैल टाइटन्स की स्क्वाड: शाकिब अल हसन, दासुन शनाका, तबरेज़ शम्सी, भानुका राजपक्षे, सीकुगे प्रसन्ना, लाहिरू कुमारा, शेवोन डैनियल, लसिथ क्रूसपुले, सोहन डी लिवरा, अशान प्रियंजन, बेन कटिंग, मोहम्मद मिथुन, मिनोद भानुका, पसिंदु सोरियाबंदरा, अविष्का परेरा, मोहम्मद शिराज, लाहिरू समराकून, कासुन राजिथा, अकिला धनंजय, चाड बोवेस, टिम सीफर्ट, सोनल दिनुशा, विश्वा फर्नांडो, अनुक फर्नांडो जाफना किंग्स की स्क्वाड: डेविड मिलर, महेश थीक्षाना, रहमानुल्लाह गुरबाज़, थिसारा परेरा, चैरिथ असलांका, डुनिथ वेलालेज, शोएब मलिक, पथुम कुमारा, विजयकांत व्यासकांत, थेसन विथुशन, असंका मनोज, निशान मदुश्का, असिथा फर्नांडो, हार्डस विलोजेन, नुवान तुषारा, दिलशान मदुशंका, ज़मान खान , आशान रंदिका, रत्नाराजा थानुरादान, क्रिस लिन, असेला गुणरत्ने बी-लव कैंडी की स्क्वाड: मुजीब उर रहमान, वानिंदु हसरंगा, फखर जमान, एंजेलो मैथ्यूज, इसुरु उदाना, दिनेश चंडीमल, मोहम्मद हसनैन, दुशमंथा चमीरा, सहान अराचिगे, एशेन बंडारा, मोहम्मद हारिस, नवोद परानाविथाना, आसिफ अली, कामिंडु मेंडिस, नुवान प्रदीप, चतुरंगा डी सिल्वा, लाहिरू मदुशंका, आमेर जमाल, मालशा थारुपथी, थानुका डाबारे, लसिथ अबेरत्ने, अविष्का थारिन्दु टूर्नामेंट का शेड्यूल: 30 जुलाई, रविवार: शाम 7 बजे: जाफना किंग्स बनाम कोलंबो स्ट्राइकर्स - कोलंबो 31 जुलाई, सोमवार: दोपहर 3 बजे: गॉल टाइटंस बनाम दांबुला ऑरा - कोलंबो l शाम 7 बजे: बी लव कैंडी बनाम कोलंबो स्ट्राइकर्स - कोलंबो 1 अगस्त, मंगलवार: दोपहर 3 बजे: दांबुला ऑरा बनाम जाफना किंग्स - कोलंबो l शाम 7 बजे: गॉल टाइटंस बनाम बी लव कैंडी - कोलंबो 2 अगस्त, बुधवार: रेस्ट डे 3 अगस्त, गुरुवार: रेस्ट डे 4 अगस्त, शुक्रवार: दोपहर 3 बजे: बी लव कैंडी बनाम दांबुला ऑरा - कैंडी एल शाम 7 बजे: गॉल टाइटंस बनाम जाफना किंग्स - कैंडी 5 अगस्त, शनिवार: दोपहर 3 बजे: कोलंबो स्ट्राइकर्स बनाम दांबुला ऑरा - कैंडी l शाम 7 बजे: बी लव कैंडी बनाम जाफना किंग्स - कैंडी 6 अगस्त, रविवार: रेस्ट डे 7 अगस्त, सोमवार: दोपहर 3 बजे: कोलंबो स्ट्राइकर्स बनाम गॉल टाइटंस - कैंडी l शाम 7 बजे: दांबुला ऑरा बनाम जाफना किंग्स - कैंडी 8 अगस्त, मंगलवार: दोपहर 3 बजे: गॉल टाइटंस बनाम बी लव कैंडी - कैंडी, शाम 7 बजे: जाफना किंग्स बनाम कोलंबो स्ट्राइकर्स - कैंडी 9 अगस्त, बुधवार: रेस्ट डे 10 अगस्त, गुरुवार: रेस्ट डे 11 अगस्त, शुक्रवार: शाम 7 बजे: दांबुला ऑरा बनाम गॉल टाइटंस - कोलंबो 12 अगस्त, शनिवार: दोपहर 3 बजे: जाफना किंग्स बनाम बी लव कैंडी - कोलंबो l शाम 7 बजे: दांबुला ऑरा बनाम कोलंबो स्ट्राइकर्स - कोलंबो 13 अगस्त, रविवार: दोपहर 3 बजे: जाफना किंग्स बनाम गॉल टाइटंस - कोलंबो l शाम 7 बजे: कोलंबो स्ट्राइकर्स बनाम बी लव कैंडी - कोलंबो 14 अगस्त, सोमवार: शाम 7 बजे: बी लव कैंडी बनाम दांबुला ऑरा - कोलंबो 15 अगस्त, मंगलवार: शाम 7 बजे: कोलंबो स्ट्राइकर्स बनाम गॉल टाइटंस - कोलंबो 16 अगस्त, बुधवार: रेस्ट डे 17 अगस्त, गुरुवार: दोपहर 3 बजे: क्वालीफायर 1 (1 बनाम 2) - कोलंबो l शाम 7 बजे: एलिमिनेटर (3 बनाम 4) - कोलंबो 18 अगस्त, शुक्रवार: रेस्ट डे 19 अगस्त, शनिवार: शाम 7 बजे: क्वालीफायर 2 (हारे हुए क्यूएफ 1 बनाम विजेता एलिमिनेटर) - कोलंबो 20 अगस्त, रविवार: शाम 7 बजे: फाइनल - कोलंबो 21 अगस्त, सोमवार: रेन रिजर्व डे","pubDate":"2023-07-30 08:22:52","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Yuvraj Singh’s historic six sixes molded me into the competitor I am today: Stuart Broad","link":"https://kalingatv.com/sports/yuvraj-singhs-historic-six-sixes-molded-me-into-the-competitor-i-am-today-stuart-broad/","keywords":["Sports","Cricket","Yuvraj Singh"],"creator":["Deepa Sharma"],"video_url":null,"description":"England’s veteran pacer, Stuart Broad, looked back on a defining moment in his cricketing career, attributing his transformation into a formidable competitor to Yuvraj Singh’s iconic six sixes during the 2007 T20 World Cup clash between India and England in Durban. In a press conference, Broad acknowledged that the unforgettable encounter, was instrumental in shaping […] The post Yuvraj Singh’s historic six sixes molded me into the competitor I am today: Stuart Broad appeared first on KalingaTV.","content":"England’s veteran pacer, Stuart Broad, looked back on a defining moment in his cricketing career, attributing his transformation into a formidable competitor to Yuvraj Singh’s iconic six sixes during the 2007 T20 World Cup clash between India and England in Durban. In a press conference, Broad acknowledged that the unforgettable encounter, was instrumental in shaping his mental approach to the game. The momentous match on September 19, 2007, saw Yuvraj Singh, in a sensational display of power-hitting, become the first batsman to dispatch six consecutive sixes in an over during a T20 International. The 22-year-old Broad found himself on the receiving end of Yuvraj’s ferocious assault, as the Indian batsman sent the ball soaring into all corners of the stadium, propelling India’s total beyond the formidable 200-run mark. Reflecting on that day, Broad admitted, “Yeah, it was obviously a pretty tough day. What would I have been: 21, 22? [22] I learned loads. I pretty much based a whole mental routine through that experience, knowing that I was left very short as an international performer in that moment. I’d rushed my preparation. I didn’t have any sort of pre-ball routine. I didn’t have any focus, particularly, and I started building my ‘warrior mode’ that I call it after that experience.” “You obviously go through massive peaks and troughs, and when you look at someone like Stokesy’s career, he’s done that sort of thing as well. Most players have. But ultimately I think it’s that bounce-back ability and that ability to be able to put poor days behind you because certainly one thing over the past whatever – 15, 16 years – you have a lot more bad days than good days in cricket so you have to be able to deal with them to make sure your good days can flourish,” Broad concluded. Prev News Next News","pubDate":"2023-07-30 08:06:01","image_url":null,"source_id":"kalingatv","category":["sports"],"country":["india"],"language":"english"},{"title":"How to Watch North Zone vs West Zone, Deodhar Trophy 2023 Live Streaming Online? Get Free Live Telecast of NZ vs WZ Cricket Match With Time in IST","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-north-zone-vs-west-zone-deodhar-trophy-2023-live-streaming-online-get-free-live-telecast-of-nz-vs-wz-cricket-match-with-time-in-ist-5303497.html","keywords":null,"creator":null,"video_url":null,"description":"While West Zone would be confident of their win against Central Zone in the last match, North Zone would want to bounce back hard from a loss to East Zone in their previous encounter. Scroll down to get live streaming and telecast details of this match,","content":"North Zone will face West Zone in the Deodhar Trophy 2023 on Sunday, July 30. The fixture is set to feature some exciting names in the competition and it would be played at the Cricket Association Puducherry Siechem Ground, starting at 1:30 pm IST (Indian Standard Time). The live telecast of this match will not be available as there is no official broadcast partner, with BCCI's media rights yet to be sold. But fans can watch live streaming online of this match on the BCCI.TV and BCCI app and website. Deodhar Trophy 2023: West Zone Win Thriller Over Central Zone by 1 Wicket. Deodhar Trophy Live Streaming Just 1️⃣ Day to go for the #DeodharTrophy to begin 🏆 Catch all the LIVE action on https://t.co/pQRlXkCguc and the official BCCI APP 📱 pic.twitter.com/RSfbNlZFnK — BCCI Domestic (@BCCIdomestic) July 23, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-30 07:57:02","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"7 Sixes In 1 Over: काबुल प्रीमियर लीग में आमिर ज़ज़ई ने बनाया अनचाहा रिकॉर्ड, 1 ओवर में दिए 7 छक्कों समेत 48 रन","link":"https://hindi.latestly.com/socially/sports/cricket/aamir-zazai-creates-unwanted-record-in-kabul-premier-league-48-runs-including-7-sixes-in-1-over-1880988.html","keywords":null,"creator":null,"video_url":null,"description":"न्यूजीलैंड के गेंदबाज जेम्स फुलर ने पहले यह रिकॉर्ड अपने नाम किया था, उन्होंने ग्लॉस्टरशायर और ससेक्स के बीच टी20 ब्लास्ट मैच में एक ओवर में 38 रन दिए थे. स्कॉट स्टायरिस ने फुलर के खिलाफ बल्ले से 34 रन बनाए, जबकि ग्लॉस्टरशायर के गेंदबाज ने अतिरिक्त के रूप में चार रन दिए.","content":"Kabul Premier League 2023: शनिवार को अफगानिस्तान के अनकैप्ड स्पिनर आमिर ज़ज़ई ने रिकॉर्ड बुक में जगह बनाई, लेकिन उस तरह से नहीं जिस पर उन्हें गर्व हो. उन्होंने काबुल प्रीमियर लीग मैच के एक ओवर में 48 रन दिए, जिससे टी20 मैच के एक ओवर में किसी गेंदबाज द्वारा दिए गए सर्वाधिक रन का नया विश्व रिकॉर्ड बन गया. न्यूजीलैंड के गेंदबाज जेम्स फुलर ने पहले यह रिकॉर्ड अपने नाम किया था, उन्होंने ग्लॉस्टरशायर और ससेक्स के बीच टी20 ब्लास्ट मैच में एक ओवर में 38 रन दिए थे. स्कॉट स्टायरिस ने फुलर के खिलाफ बल्ले से 34 रन बनाए, जबकि ग्लॉस्टरशायर के गेंदबाज ने अतिरिक्त के रूप में चार रन दिए. वीडियो देखें: 48 runs from 1 over. @Sediq_Atal26 is now in the cricketing history books. Equalled Rituraj Gaikwad's 7 sixes in an over. Poor Amir Zazai, almost escaped a heartache. This 💯 must open the doors of international cricket & leagues for Atal. 🇦🇫 #FutureStar #WorldRecord #SevenSixes pic.twitter.com/Ntt0lkZVUm — Cricket Afghanistan (@AFG_Sports) July 29, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-30 07:36:33","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Un centro de cricket dentro del 'Sky Stadium', el estadio donde jugará España","link":"https://www.marca.com/futbol/futbol-femenino/seleccion/2023/07/30/64c5d22aca474117568b4594.html","keywords":["Selección Femenina Fútbol España","Fútbol Femenino","Mundial femenino de fútbol"],"creator":["Pablo Parra"],"video_url":null,"description":null,"content":"a selección española jugará su tercer partido en el Sky Stadium, Estadio regional de Wellington, para la FIFA. Se trata de un ciertamente incómodo para los medios de comunicación y que el máximo organismo del fútbol mundial ha tenido que adaptar para el campeonato del mundo. . Habitualmente es un estadio de rugby, donde juegan los Wellington Lions y los Wellington Hurricanes. Es también el hogar del equipo de fútbol Wellington Phoenix, de la A-League. A ello hay que sumar que dentro del estadio, lo que en este Mundial está siendo el centro de trabajo de los medios de comunicación, . Concretamente es la Escuela de Wellington de Cricket, dirigida por la Asociación de Cricket de Wellington.. De hecho, el techo conserva las redes y las mallas necesarias en dicho deporte. En una de las paredes, aparecen nombres históricos del cricket de la ciudad. Por otro lado, el recorrido que existe entre la tribuna habilitada para los medios de comunicación es tan largo que para poder facilitar el trabajo al término de los encuentros. . Aquí debutó contra Costa Rica con una victoria contundente por 3-0 gracias a los goles de la selección 'tica' en propia puerta, Esther González y Aitana Bonmatí, con lo cual ya sabe lo que es lograr una victoria en este especial enclave a las afueras de la ciudad en el que, además, se nota el paso de los trenes por las vías aledañas al terreno de juego.","pubDate":"2023-07-30 07:34:18","image_url":"https://phantom-marca.unidadeditorial.es/07c687b17b0dd30220174a13768dc04e/crop/0x168/2047x1533/resize/2047/assets/multimedia/imagenes/2023/07/30/16907021574049.jpg","source_id":"marca","category":["sports"],"country":["colombia"],"language":"spanish"},{"title":"‘To Take 600 Wickets and…’ Team India Head Coach Rahul Dravid Praises 'Special Cricketer' Stuart Broad With England Pacer Set to Retire After Ashes 2023","link":"https://www.latestly.com/agency-news/sports-news-retiring-broad-is-a-special-cricketer-dravid-5303330.html","keywords":null,"creator":null,"video_url":null,"description":"India head coach Rahul Dravid has described the retiring England fast bowler Stuart Broad as a \"special cricketer\", whose great partnership with James Anderson will be remembered for ages.","content":"Bridgetown, July 30 : India head coach Rahul Dravid has described the retiring England fast bowler Stuart Broad as a \"special cricketer\", whose great partnership with James Anderson will be remembered for ages. The 37-year-old Broad on Saturday announced that he will retire from international cricket after the conclusion of the ongoing final Ashes Test against Australia at The Kia Oval in London. IND vs WI 2nd ODI 2023: Bowlers, Shai Hope Help West Indies Level Series . \"He (Broad) has been a terrific bowler, he has been a great. His partnership with Jimmy Anderson will always be remembered,\" Dravid said after India lost to West Indies by six wickets in the second ODI here. \"Anderson and Broad the whole decade they played for England, they have really put in some fantastic performances,\" said the batting legend and former India captain. \"To take 600 wickets and to play the number of Test matches he has takes a special kind of cricketer,\" he added. Broad has been a key member of the England Test side since making his debut against Sri Lanka in December 2007. He will retire with 167 caps, and is the second highest Test wicket-taker after Anderson among pacers. He had taken 600 wickets before the ongoing final Ashes Test. The right-arm seamer, who made his first-class debut for Leicestershire in 2005 and later moved to Nottinghamshire, has played 121 ODIs and 56 T20 Internationals, picking up 178 and 65 wickets respectively. Dravid congratulated Broad on a wonderful career. \"My best wishes to him and congratulations on a fantastic career. I hope he gets to finish it off in the best possible way he wants to,\" he said.","pubDate":"2023-07-30 07:31:53","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Lanka Premier League 2023: All You Need to Know About Fourth Edition of Sri Lanka's T20 Tournament","link":"https://www.latestly.com/agency-news/sports-news-lanka-premier-league-all-you-need-to-know-about-fourth-edition-of-tournament-5302111.html","keywords":null,"creator":null,"video_url":null,"description":"The season will see the participation of five teams - Colombo Strikers captained by Niroshan Dickwella, Dambulla Aura captained by Kusal Mendis, Galle Titans led by Dasun Shanaka, B-Love Kandy captained by Wanindu Hasaranga and the defending champions Jaffna Kings will be led by veteran Srilankan allrounder Thisara Perera.","content":"Colombo [Sri Lanka], July 29 : The Lanka Premier League (LPL) is scheduled to take place from July 30 to August 21, 2023. This will be the fourth edition of the highly anticipated league which will feature some top stars from global cricket fighting for the coveted title. As per a press release from LPL, the matches will be held across two venues Colombo and Kandy for the 2023 edition. ‘Playing Virat and Rohit Would Not Have Given Us...’ Head Coach Rahul Dravid Explains Why Virat Kohli, Rohit Sharma Did Not Play IND vs WI 2nd ODI 2023 (Watch Video) The season will see the participation of five teams - Colombo Strikers captained by Niroshan Dickwella, Dambulla Aura captained by Kusal Mendis, Galle Titans led by Dasun Shanaka, B-Love Kandy captained by Wanindu Hasaranga and the defending champions Jaffna Kings will be led by veteran Srilankan allrounder Thisara Perera. The fourth edition will also feature top International stars like David Miller, Babar Azam, Chris Lynn and Shakib Al Hasan who will be entertaining the fans in the league along with top-class Sri Lankan players like Mahesh Theekshana, Bhanuka Rajapaksa and Angelo Mathews. Ashes 2023: Ricky Ponting Keen To See England's Batting Approach in Second Innings of ENG vs AUS 5th Test. The teams will be facing each other twice in a round-robin league format in group-stage games starting from July 30. The top four teams on the points table will qualify for the playoffs which will begin on August 17 and the final will be played on August 20 with August 21 kept as a rain reserve day. *Team Captains -Colombo Strikers: Niroshan Dickwella-Dambulla Aura: Kusal Mendis-Galle Titans: Dasun Shanaka-Jaffna Kings: Thisara Perera-B-Love Kandy: Wanindu Hasaranga *Squads -Colombo Strikers Babar Azam, Matheesha Pathirana, Naseem Shah, Chamika Karunaratne, Pathum Nissanka, Ahan Wickramasinghe, Dhananjaya Lakshan, Niroshan Dickwella, Wahab Riaz, Lakshan Sandakan, Nipun Dananjaya, Movin Subasinghe, Lahiru Udara, Jeffrey Vandersay, Eshan Malinga, Shashika Dulshan, Nuwanidu Fernando, Iftikhar Ahmed, Lorcan Tucker, Kavishka Anjula, Ramesh Mendis, Mohammad Nawaz, Yashodha Lanka, Angelo Perera -Dambulla Aura Matthew Wade, Kusal Mendis, Hassan Ali, Avishka Fernando, Dhananjaya de Silva, Kusal Perera, Hayden Kerr, Sadeera Samarawickrama, Binura Fernando, Noor Ahmad, Sachitha Jayatilake, Janith Liyanage, Dushan Hemantha, Pramod Madushan, Treveen Mathews, Shahnawaz Dahani, Lakshan Edirisinghe, Jehan Daniel, Wanuja Sahan, Kavindu Pathirathne, Ravindu Fernando, Alex Ross, Manelker de Silva, Praveen Jayawickrama -Galle Titans Shakib Al Hasan, Dasun Shanaka, Tabraiz Shamsi, Bhanuka Rajapaksa, Seekkuge Prasanna, Lahiru Kumara, Shevon Daniel, Lasith Croospulle, Sohan de Livera, Ashan Priyanjan, Ben Cutting, Mohammad Mithun, Minod Bhanuka, Pasindu Sooriyabandara, Avishka Perera, Mohamed Shiraz, Lahiru Samarakoon, Kasun Rajitha, Akila Dananjaya, Chad Bowes, Tim Seifert, Sonal Dinusha, Vishwa Fernando, Anuk Fernando -Jaffna Kings David Miller, Maheesh Theekshana, Rahmanullah Gurbaz, Thisara Perera, Charith Asalanka, Dunith Wellalage, Shoaib Malik, Pathum Kumara, Vijayakanth Viyaskanth, Theesan Vithushan, Asanka Manoj, Nishan Madushka, Asitha Fernando, Hardus Viljoen, Nuwan Thushara, Dilshan Madushanka, Zaman Khan, Ashan Randika, Rathnaraja Thanuradan, Chris Lynn, Asela Gunaratne -B-Love Kandy Mujeeb Ur Rahman, Wanindu Hasaranga, Fakhar Zaman, Angelo Mathews, Isuru Udana, Dinesh Chandimal, Mohammad Hasnain, Dushmantha Chameera, Sahan Arachchige, Ashen Bandara, Mohammad Haris, Navod Paranavithana, Asif Ali, Kamindu Mendis, Nuwan Pradeep, Chathuranga de Silva, Lahiru Madushanka, Aamer Jamal, Malsha Tharupathi, Thanuka Dabare, Lasith Abeyratne, Avishka Tharindu Fixtures: July 30, Sunday: 7 PM: Jaffna Kings vs Colombo Strikers - Colombo July 31, Monday : 3 PM: Galle Titans vs Dambulla Aura - Colombo l 7 PM: B Love Kandy vs Colombo Strikers - Colombo August 1, Tuesday : 3 PM: Dambulla Aura vs Jaffna Kings - Colombo l 7 PM: Galle Titans vs B Love Kandy - Colombo August 2, Wednesday: Rest Day August 3, Thursday: Rest Day August 4, Friday: 3 PM: B Love Kandy vs Dambulla Aura - Kandy l 7 PM: Galle Titans vs Jaffna Kings - Kandy August 5, Saturday : 3 PM: Colombo Strikers vs Dambulla Aura - Kandy l 7 PM: B Love Kandy vs Jaffna Kings - Kandy August 6, Sunday: Rest day August 7, Monday : 3 PM: Colombo Strikers vs Galle Titans - Kandy l 7 PM: Dambulla Aura vs Jaffna Kings - Kandy August 8, Tuesday : 3 PM: Galle Titans vs B Love Kandy - Kandy l 7 PM: Jaffna Kings vs Colombo Strikers - Kandy August 9, Wednesday: Rest day August 10, Thursday: Rest day August 11, Friday: 7 PM: Dambulla Aura vs Galle Titans - Colombo August 12, Saturday : 3 PM: Jaffna Kings vs B Love Kandy - Colombo l 7 PM: Dambulla Aura vs Colombo Strikers - Colombo August 13, Sunday : 3 PM: Jaffna Kings vs Galle Titans - Colombo l 7 PM: Colombo Strikers vs B Love Kandy - Colombo August 14 , Monday: 7 PM: B Love Kandy vs Dambulla Aura - Colombo August 15, Tuesday: 7 PM: Colombo Strikers vs Galle Titans - Colombo August 16, Wednesday: Rest Day August 17 , Thursday : 3 PM: Qualifier 1 ( 1 vs 2 ) - Colombo l 7 PM: Eliminator ( 3 vs 4) – Colombo August 18, Friday: Rest day August 19, Saturday: 7 PM: Qualifier 2 ( looser QF 1 vs Winner Eliminator ) - Colombo August 20, Sunday: 7 PM : Final - Colombo August 21, Monday: Rain Reserve Day. The Lanka Premier League 2023 will be telecasted live on Star Sports network, and the Live stream will be available on the Fancode app.","pubDate":"2023-07-30 07:27:56","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"'It's Magic', संजू सैमसन खड़े-खड़े हो गए आउट, पिच पर गजब अंदाज में 90 डिग्री के कोण से घूमी गेंद, Video","link":"https://sports.ndtv.com/hindi/cricket/sanju-samson-wicket-video-viral-2nd-odi-ind-vs-wi-yannic-cariah-bowling-4252685#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Sanju Samson wicket video viral 2nd ODI, दूसरे वनडे में संजू सैमसन का बल्ला खामोश रहा और केवल 9 रन ही बना सके, सैमसन जिस अंदाज में आउट हुए वह गेंद यकीनन चौकेने वाली थी.","content":"संजू सैमसन का नहीं चला बल्ला वेस्टइंडीज के खिलाफ दूसरे वनडे मैच (WI vs IND 2nd ODI) में भारत को हार का सामना करना पड़ा. वेस्टइंडीज ने भारत को 6 विकेट से हारकर वनडे सीरीज को बराबरी कर लाकर खड़ा कर दिया. बता दें कि दूसरे वनडे में भारतीय बल्लेबाज पूरी तरह से फ्लॉप रहे, यही कारण रहा कि बारिश से प्रभावित मैच में भारतीय पारी केवल 181 रन ही बना सकी. जिसके बाद 4 विकेट खोकर वेस्टइंडीज ने लक्ष्य को 37वें ओवर में हासिल कर लिया. बता दें कि दूसरे वनडे में जहां कोहली और रोहित (Kohli-Rohit) को आराम दिया गया तो वहीं दूसरी ओर संजू सैमसन (Sanju Samson Wicket) को मौका मिला. लेकिन एक बार फिर सैमसन उम्मीद पर खड़े नहीं उतर पाए और केवल 9 रन बनाकर स्पिनर यानिक कारिया (Yannic Cariah) की गेंद पर स्लिप में कैच कर लिए गए. सैमसन ने 19 गेंद का सामना किया लेकिन अपनी पारी में वो खुलकर नहीं खेल पाए. बता दें कि यानिक कारिया ने अपनी करिश्माई गेंद पर सैमसन को फंसाया जिसका वीडियो अब सोशल मीडिया पर वायरल हो रहा है. दरअसल, सैमसन खड़े रह गए और गेंद उनके बल्ले से लगकर स्लिप में गई. यानिक कारिया की यह गेंद इतनी कमाल की थी कि बल्लेबाज को यकीन ही नहीं हुआ कि वो इस तरह से कैच आउट हो सकते हैं. Sanju Samson had a short stay in the middle. . . हुआ ये कि गेंद लेग स्टंप की लाइन पर टप्पा खाने के बाद उल्टी दिशा में तेजी से घूमती है, और पलक झपकते ही गेंद बल्ले से लगकर स्लिप में चली जाती है. बल्लेबाज सैमसन को अपना बल्ला हटाने का समय ही नहीं मिल पाता है और कैच आउट हो जाते हैं. आउट होने के बाद सैमसन पिच पर खड़े-खड़े सोचने लग जाते हैं और आखिर में निराश मन के साथ पवेलियन लौट पड़ते हैं. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-07-30 06:35:55","image_url":"https://c.ndtvimg.com/2023-07/hdo3s3og_samson_625x300_30_July_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Dravid on Virat-Rohit's Rest, IND vs WI: বিরাট-রোহিতকে ছাড়া লজ্জার হার ভারতের, বিশ্রামের কারণ কি বললেন কোচ দ্রাবিড়?","link":"https://bangla.latestly.com/sports/cricket/dravid-on-virat-rohits-rest-ind-vs-wi-indias-embarrassing-defeat-without-virat-rohit-what-is-the-reason-for-rest-coach-dravid-said-230868.html","keywords":null,"creator":null,"video_url":null,"description":"তিনি বলেন, 'এই ধরনের সিরিজে যখন মাত্র দুই বা তিনটি ম্যাচ বাকি রয়েছে, রোহিত ও বিরাটকে খেলালে আমরা খুব বেশি উত্তর দিতাম না। এনসিএতে আমাদের কিছু খেলোয়াড়দের চোট এবং তাদের ঘিরে কিছু অনিশ্চয়তার কারণে, আমরা অন্য কিছু খেলোয়াড়দের সুযোগ দিতে চেয়েছিলাম যাতে প্রয়োজনে তারা খেলতে পারে","content":"শনিবার বার্বাডোসে ওয়েস্ট ইন্ডিজের কাছে দ্বিতীয় ওয়ানডেতে হেরে যাওয়া দলের দুই গুরুত্বপূর্ণ খেলোয়াড়কে বাদ দেওয়ার সিদ্ধান্তকে সমর্থন করেছেন ভারতীয় কোচ রাহুল দ্রাবিড়। ৫০ ওভারের ম্যাচে অধিনায়ক রোহিত শর্মা এবং অভিজ্ঞ ব্যাটসম্যান বিরাট কোহলিকে বিশ্রামে রাখে ভারত এবং এই পদক্ষেপের ফলে ক্যারিবিয়ানরা ছয় উইকেটে ম্যাচ জিতে নেয় এবং সিরিজ নির্ণায়ক ম্যাচের আগে ব্যবধানে ১-১ করে দেয়। দ্রাবিড় বলেন, আসন্ন এশিয়া কাপ ও আইসিসি পুরুষ ক্রিকেট বিশ্বকাপের আগে সঞ্জু স্যামসন, ইশান কিষাণ এবং সূর্যকুমার যাদবের মতো খেলোয়াড়দের দিকে নজর দেওয়া তাঁর পক্ষে গুরুত্বপূর্ণ ছিল। IND vs WI 2nd ODI Results: মহাতারকাদের অবাক বিশ্রামে মহালজ্জার হারে মাথাহেঁট, টিম ইন্ডিয়াকে হারিয়ে ক্যারিবিয়ান কামব্যাকের ক্যালিপসো দ্রাবিড় বলেন, 'এটাই ছিল আমাদের শেষ সুযোগ ছিল আমাদের কিছু খেলোয়াড়কে পরীক্ষা করার। আমরা আমাদের কয়েকজন খেলোয়াড়কে পেয়েছি যারা চোটের কারণে এনসিএতে আছে। এশিয়া কাপের আর এক মাস বাকি থাকতেই আমাদের অনেক দিক থেকে সময় ফুরিয়ে যাচ্ছে। আমরা আশাবাদী যে তাদের (চোটে থাকা খেলোয়াড়) কেউ কেউ এশিয়া কাপ ও বিশ্বকাপের জন্য ফিট হয়ে যাবে, কিন্তু আমরা সেই কারণে চান্স নিতে পারব না। আমাদের অন্যদের নিয়ে চেষ্টা করতে হবে এবং অন্যদের সুযোগ দিতে হবে যাতে সবচেয়ে খারাপ পরিস্থিতিতে কমপক্ষে তাদের পিছনে খেলার সময় থাকে এবং এটি আমাদের খেলোয়াড়দের সম্পর্কে কিছু সিদ্ধান্ত নেওয়ার সুযোগ দেয়।' Head Coach Rahul Dravid explains #TeamIndia 's selection in the second #WIvIND ODI 🔽 pic.twitter.com/65rZUtuIaV — BCCI (@BCCI) July 29, 2023 তিনি আরও যোগ করে বলেন, 'এই ধরনের সিরিজে যখন মাত্র দুই বা তিনটি ম্যাচ বাকি রয়েছে, রোহিত ও বিরাটকে খেলালে আমরা খুব বেশি উত্তর দিতাম না। এনসিএতে আমাদের কিছু খেলোয়াড়দের চোট এবং তাদের ঘিরে কিছু অনিশ্চয়তার কারণে, আমরা অন্য কিছু খেলোয়াড়দের সুযোগ দিতে চেয়েছিলাম যাতে প্রয়োজনে তারা খেলতে পারে।' এছাড়া তিনি বলেন, এশিয়া কাপ ও বিশ্বকাপ সামনে আসার চক্রের এই পর্যায়ে চোটের কারণে ভবিষ্যৎ-এর (Bigger Picture) দিকে তাকাতে হবে। আমরা প্রতিটি ম্যাচ এবং প্রতিটি সিরিজ নিয়ে উদ্বিগ্ন হতে পারি না এবং যদি আমরা এটি করি তবে আমি মনে করি এটি একটি ভুল হবে।","pubDate":"2023-07-30 06:24:45","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Watch: Virat makes young fan's day by wearing bracelet she made for him","link":"https://timesofindia.indiatimes.com/sports/cricket/india-in-west-indies/watch-virat-kohli-makes-a-young-fans-day-by-accepting-a-bracelet-she-made-for-him/articleshow/102246003.cms","keywords":null,"creator":null,"video_url":null,"description":"A young girl in Barbados had a dream-come-true moment on Saturday when Virat Kohli came all the way to her in the stands and not just accepted the bracelet she had made for him but also wore it.","content":"2nd ODI: West Indies beat India to level series Top-5: Bowlers who have taken most 'bowled' wickets Top-5: Best bowling spell by Asian bowlers in ODI World Cup Top-5: Most Test runs by a visiting batter at the Oval Broad first England bowler to claim 150 Ashes wickets 5th Ashes Test, Day 2: Australia take lead against England 2nd ODI: India eye series win against West Indies Stars who will not be playing the 2023 ODI World Cup Most runs scored in the league stage of MLC 2023 Most sixes by a batter in the league stage of MLC 2023","pubDate":"2023-07-30 06:23:43","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"}]}