{"newsArray":[{"article_id":"614d5475db1a0a84473944abd7ed7a24","title":"Nat Sciver-Brunt thrilled to proceed Ashes ODI kind with record-breaking ton","link":"https://www.businesslend.com/sports/nat-sciver-brunt-thrilled-to-continue-ashes-odi-form-with-record-breaking-ton/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport publication for all the most recent information on every part from biking to boxing Sign as much as our free sport e mail for all the most recent information Nat Sciver-Brunt mirrored with delight on her record-breaking century as England introduced the curtain down on their summer time [...] The post Nat Sciver-Brunt thrilled to proceed Ashes ODI kind with record-breaking ton appeared first on BusinessLend.","content":"Nat Sciver-Brunt mirrored with delight on her record-breaking century as England introduced the curtain down on their summer time in barnstorming trend by thrashing Sri Lanka. On her one hundredth ODI and captaining the aspect within the absence of the unwell Heather Knight, Sciver-Brunt demonstrated a masterclass in managed aggression to peel off a surprising 66-ball hundred. It was the quickest ton in a ladies’s ODI by an England batter – eclipsing Charlotte Edwards’ 70-ball effort from March 2012 – because the hosts prevailed by a whopping 161 runs to seal a 2-0 collection win. Sciver-Brunt holed out for 120 off 74 balls, her third three-figure rating in her final 4 ODI innings, having helped England draw a gripping multi-format Ashes collection with back-to-back a whole bunch in July. “I’m really happy to bat the way I did and continue with what I was doing against Australia as well,” Sciver-Brunt stated on the post-match presentation ceremony. Sciver-Brunt was rested from the previous three T20s between the groups, the place England suffered a shock defeat, however the 31-year-old has felt the advantage of some downtime in a busy summer time programme. She has been managing a knee downside for a number of months and performed on this collection as a specialist batter however anticipates returning to all-rounder duties on England’s tour of India earlier than Christmas. “The decision not to bowl post-Ashes was more to give the body a bit of a rest,” she stated. “I’m looking forward to picking up the ball again. I want to influence games as much as I can. https://x.com/englandcricket/status/1702347907511222634?s=20 “That’s the best part of being an all-rounder and fielding for 50 overs and not really being able to influence with the ball was a little bit frustrating but I was happy to have the body break for that. Access unlimited streaming of movies and TV shows with Amazon Prime Video Sign up now for a 30-day free trial Sign up Access unlimited streaming of movies and TV shows with Amazon Prime Video Sign up now for a 30-day free trial Sign up “When we play so much cricket through the summer, we probably don’t need to train too many things, just be right in the mind and body and hopefully continue that mindset that I had (in the Ashes).” England have been slowed down by Sri Lanka’s spinners within the T20s when batting first and will have feared the worst when Tammy Beaumont and Alice Capsey have been dismissed early in a match decreased to 31 overs per aspect at Grace Road due to rain that led to the beginning time being pushed again by greater than three hours. But Sciver-Brunt exhibited why she is so instrumental, taking over the coterie of off-spinners and sluggish left-armers, punching with aplomb off the again foot and displaying her full vary with fluid drives, pulls, sweeps and one scoop for 18 fours and a single six. Maia Bouchier, that includes in simply her third ODI and in her second innings within the format, supplied ample help with 95 off solely 65 balls. The 24-year-old opener crashed a dozen fours and two sixes in a 193-run stand from simply 121 deliveries with Sciver-Brunt. “She’s a fantastic player,” England head coach Jon Lewis stated of his stand-in captain. “It’s the calmness she brings – and I thought we saw that in abundance here. The calmness she brought to Maia in a situation when we were 18 for two, she’s come out with an authority.” Sciver-Brunt was the primary to 3 figures however Bouchier might have made certain her team-mate’s document lasted just some minutes had she dispatched her sixty fifth ball for six, solely to be trapped lbw. “I was absolutely gutted for her that she didn’t score a hundred because I know that when she does score a hundred, she’ll score a lot of hundreds,” Lewis added. “She’s incredibly talented.” Sciver-Brunt and Bouchier underpinned a mammoth 273 for eight, a complete which might have stretched Sri Lanka in a regulation 50-over recreation and the vacationers have been by no means in competition within the chase. They capitulated to 112 all out in 24.5 overs, as Charlie Dean claimed 5 for 31, her maiden five-wicket haul for England which the off-spinner recognised was constructed on Sciver-Brunt’s beautiful knock. “She’s the best all-rounder in the world, the best batter,” Dean stated. “She brings a lot to the team, she definitely elevates us with her standards alone. “I guess she goes under the radar with her leadership – she’s so calm. We have so many players that can do similar but there’s only one Nat Sciver-Brunt.” France given large Rugby World Cup scare by minnows Uruguay","pubDate":"2023-09-14 21:07:59","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0eb6c47e6c85ee9af5f6fa07b3020d38","title":"Nat Sciver-Brunt thrilled to continue Ashes ODI form with record-breaking ton","link":"https://www.times-series.co.uk/sport/national/23790768.nat-sciver-brunt-thrilled-continue-ashes-odi-form-record-breaking-ton/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The stand-in England captain scored a record-breaking century in her 100th ODI.","content":"On her 100th ODI and captaining the side in the absence of the unwell Heather Knight, Sciver-Brunt demonstrated a masterclass in controlled aggression to peel off a stunning 66-ball hundred. It was the fastest ton in a women’s ODI by an England batter – eclipsing Charlotte Edwards’ 70-ball effort from March 2012 – as the hosts prevailed by a whopping 161 runs to seal a 2-0 series win. Sciver-Brunt holed out for 120 off 74 balls, her third three-figure score in her last four ODI innings, having helped England draw a gripping multi-format Ashes series with back-to-back hundreds in July. “I’m really happy to bat the way I did and continue with what I was doing against Australia as well,” Sciver-Brunt said at the post-match presentation ceremony. Sciver-Brunt was rested from the preceding three T20s between the teams, where England suffered a shock defeat, but the 31-year-old has felt the benefit of some downtime in a hectic summer programme. She has been managing a knee problem for several months and played in this series as a specialist batter but anticipates returning to all-rounder duties on England’s tour of India before Christmas. “The decision not to bowl post-Ashes was more to give the body a bit of a rest,” she said. “I’m looking forward to picking up the ball again. I want to influence games as much as I can. “That’s the best part of being an all-rounder and fielding for 50 overs and not really being able to influence with the ball was a little bit frustrating but I was happy to have the body break for that. “When we play so much cricket through the summer, we probably don’t need to train too many things, just be right in the mind and body and hopefully continue that mindset that I had (in the Ashes).” England were bogged down by Sri Lanka’s spinners in the T20s when batting first and may have feared the worst when Tammy Beaumont and Alice Capsey were dismissed early in a match reduced to 31 overs per side at Grace Road because of rain that led to the start time being pushed back by more than three hours. But Sciver-Brunt exhibited why she is so instrumental, taking on the coterie of off-spinners and slow left-armers, punching with aplomb off the back foot and displaying her full range with fluid drives, pulls, sweeps and one scoop for 18 fours and a single six. Maia Bouchier, featuring in just her third ODI and in her second innings in the format, provided ample support with 95 off only 65 balls. The 24-year-old opener crashed a dozen fours and two sixes in a 193-run stand from just 121 deliveries with Sciver-Brunt. “She’s a fantastic player,” England head coach Jon Lewis said of his stand-in captain. “It’s the calmness she brings – and I thought we saw that in abundance here. The calmness she brought to Maia in a situation when we were 18 for two, she’s come out with an authority.” Sciver-Brunt was the first to three figures but Bouchier could have made sure her team-mate’s record lasted just a few minutes had she dispatched her 65th ball for six, only to be trapped lbw. “I was absolutely gutted for her that she didn’t score a hundred because I know that when she does score a hundred, she’ll score a lot of hundreds,” Lewis added. “She’s incredibly talented.” Sciver-Brunt and Bouchier underpinned a mammoth 273 for eight, a total which would have stretched Sri Lanka in a regulation 50-over game and the tourists were never in contention in the chase. They capitulated to 112 all out in 24.5 overs, as Charlie Dean claimed five for 31, her maiden five-wicket haul for England which the off-spinner recognised was built on Sciver-Brunt’s stunning knock. “She’s the best all-rounder in the world, the best batter,” Dean said. “She brings a lot to the team, she definitely elevates us with her standards alone. “I guess she goes under the radar with her leadership – she’s so calm. We have so many players that can do similar but there’s only one Nat Sciver-Brunt.”","pubDate":"2023-09-14 21:01:21","image_url":"https://www.times-series.co.uk/resources/images/17228972/?type=app&htype=0","source_id":"time_series","source_priority":668753,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"85d9730fe825fa85ea1f4d4e3769bfc7","title":"Nat Sciver-Brunt thrilled to continue Ashes ODI form with record-breaking ton","link":"https://www.echo-news.co.uk/sport/national/23790768.nat-sciver-brunt-thrilled-continue-ashes-odi-form-record-breaking-ton/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The stand-in England captain scored a record-breaking century in her 100th ODI.","content":"On her 100th ODI and captaining the side in the absence of the unwell Heather Knight, Sciver-Brunt demonstrated a masterclass in controlled aggression to peel off a stunning 66-ball hundred. It was the fastest ton in a women’s ODI by an England batter – eclipsing Charlotte Edwards’ 70-ball effort from March 2012 – as the hosts prevailed by a whopping 161 runs to seal a 2-0 series win. Sciver-Brunt holed out for 120 off 74 balls, her third three-figure score in her last four ODI innings, having helped England draw a gripping multi-format Ashes series with back-to-back hundreds in July. “I’m really happy to bat the way I did and continue with what I was doing against Australia as well,” Sciver-Brunt said at the post-match presentation ceremony. Sciver-Brunt was rested from the preceding three T20s between the teams, where England suffered a shock defeat, but the 31-year-old has felt the benefit of some downtime in a hectic summer programme. She has been managing a knee problem for several months and played in this series as a specialist batter but anticipates returning to all-rounder duties on England’s tour of India before Christmas. “The decision not to bowl post-Ashes was more to give the body a bit of a rest,” she said. “I’m looking forward to picking up the ball again. I want to influence games as much as I can. 100th ODI, and playing it in style 🤩 Nat is unstoppable 👏 — England Cricket (@englandcricket) “That’s the best part of being an all-rounder and fielding for 50 overs and not really being able to influence with the ball was a little bit frustrating but I was happy to have the body break for that. “When we play so much cricket through the summer, we probably don’t need to train too many things, just be right in the mind and body and hopefully continue that mindset that I had (in the Ashes).” England were bogged down by Sri Lanka’s spinners in the T20s when batting first and may have feared the worst when Tammy Beaumont and Alice Capsey were dismissed early in a match reduced to 31 overs per side at Grace Road because of rain that led to the start time being pushed back by more than three hours. But Sciver-Brunt exhibited why she is so instrumental, taking on the coterie of off-spinners and slow left-armers, punching with aplomb off the back foot and displaying her full range with fluid drives, pulls, sweeps and one scoop for 18 fours and a single six. Maia Bouchier, featuring in just her third ODI and in her second innings in the format, provided ample support with 95 off only 65 balls. The 24-year-old opener crashed a dozen fours and two sixes in a 193-run stand from just 121 deliveries with Sciver-Brunt. “She’s a fantastic player,” England head coach Jon Lewis said of his stand-in captain. “It’s the calmness she brings – and I thought we saw that in abundance here. The calmness she brought to Maia in a situation when we were 18 for two, she’s come out with an authority.” Sciver-Brunt was the first to three figures but Bouchier could have made sure her team-mate’s record lasted just a few minutes had she dispatched her 65th ball for six, only to be trapped lbw. “I was absolutely gutted for her that she didn’t score a hundred because I know that when she does score a hundred, she’ll score a lot of hundreds,” Lewis added. “She’s incredibly talented.” Sciver-Brunt and Bouchier underpinned a mammoth 273 for eight, a total which would have stretched Sri Lanka in a regulation 50-over game and the tourists were never in contention in the chase. They capitulated to 112 all out in 24.5 overs, as Charlie Dean claimed five for 31, her maiden five-wicket haul for England which the off-spinner recognised was built on Sciver-Brunt’s stunning knock. “She’s the best all-rounder in the world, the best batter,” Dean said. “She brings a lot to the team, she definitely elevates us with her standards alone. “I guess she goes under the radar with her leadership – she’s so calm. We have so many players that can do similar but there’s only one Nat Sciver-Brunt.”","pubDate":"2023-09-14 21:01:21","image_url":"https://www.echo-news.co.uk/resources/images/17228972/?type=app&htype=0","source_id":"echo_uk","source_priority":159993,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"97fc46b48dae60a8c3ad557da209c7d0","title":"England women's cricket: Five things we learned after Ashes success and Sri Lanka disappointment","link":"https://www.newsr.in/n/Sports/1zpnjb1dp4/England-women-cricket-Five-things-we-learned.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"BBC Sport looks at what can be learned from England women's summer. Reported by BBC Sport 13 minutes ago.","content":"Thursday, 14 September 2023 ( 1 hour ago ) BBC Sport looks at what can be learned from England women's summer. 👓 View full article","pubDate":"2023-09-14 20:41:54","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4526349ec8378ef7189f292e1add3993","title":"PAK vs SL, Match Highlights: রুদ্ধশ্বাস ম্যাচে ২ উইকেটে পাকিস্তানকে হারিয়ে এশিয়া কাপের ফাইনালে শ্রীলঙ্কা","link":"https://bengali.abplive.com/sports/cricket/asia-cup-2023-sri-lanka-beat-pakistan-by-2-wickets-against-super-4-full-match-highlights-qualified-for-final-1009093","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: জয়ের জন্য ৪২ ওভারে শ্রীলঙ্কার টার্গেট ছিল ২৫২ রান। ১১ নম্বর বার এশিয়া কাপের ফাইনালে পৌঁছনোর হাতছানি ছিল তাঁদের সামনে। অপরদিকে, পাকিস্তানের সামনে সুযোগ ছিল শ্রীলঙ্কাকে হারিয়ে প্রথমবার ভারত-পাকিস্তান এশিয়া কাপ ফাইনালের। ম্যাচের শেষ বল পর্যন্ত চলে হাড্ডাহাড্ডি লড়াই। তবে শেষমেশ দুই উইকেটে ম্যাচের শেষ বলে রুদ্ধশ্বাস জয় পেল শ্রীলঙ্কা। চরিথ আসালঙ্কা অপরাজিত ৪৯ রানে শ্রীলঙ্কাকে ফাইনালে পৌঁছে দেন। কুশল মেন্ডিস দ্বীপরাষ্ট্রের হয়ে অপরাজিত ৯১ রানের ইনিংস খেলেন।","content":"কলম্বো: জয়ের জন্য ৪২ ওভারে পাকিস্তানের বিরুদ্ধে (PAK vs SL) শ্রীলঙ্কার টার্গেট ছিল ২৫২ রান। ১১ নম্বর বার এশিয়া কাপের (Asia Cup 2023) ফাইনালে পৌঁছনোর হাতছানি ছিল তাঁদের সামনে। অপরদিকে, পাকিস্তানের সামনে সুযোগ ছিল শ্রীলঙ্কাকে হারিয়ে প্রথমবার ভারত-পাকিস্তান এশিয়া কাপ ফাইনালের। ম্যাচের শেষ বল পর্যন্ত চলে হাড্ডাহাড্ডি লড়াই। তবে শেষমেশ দুই উইকেটে ম্যাচের শেষ বলে রুদ্ধশ্বাস জয় পেল শ্রীলঙ্কা। চরিথ আসালঙ্কা (Charith Asalanka) অপরাজিত ৪৯ রানে শ্রীলঙ্কাকে ফাইনালে পৌঁছে দেন। বড় রানের লক্ষ্য তাড়া করতে নেমে এদিন কুশল পেরিরা শ্রীলঙ্কার হয়ে শুরুটা দুরন্তভাবে করেন। তবে শাদাব খানের দুরন্ত ডাইরেক্ট হিটে আট বলে ১৭ রান করেই ফিরতে হয় তাঁকে। ২০ রানে প্রথম উইকেট হারালেও দ্বিতীয় উইকেটে পাথুম নিসাঙ্কা ও কুশল মেন্ডিস (Kusal Mendis) ৫৭ রানের পার্টনারশিপে শ্রীলঙ্কান ইনিংসকে স্থিরতা প্রদান করেন। নিসাঙ্কা ২০ রানে আউট হওয়ার পর সাদিরা সামারাবিক্রমার সঙ্গে মিলে দ্বীপরাষ্ট্রের ইনিংসকে এগিয়ে নিয়ে যান মেন্ডিস। তৃতীয় উইকেটে দুইজনে শতরানের পার্টনারশিপ গড়েন। তবে অর্ধশতরানের দোরগোড়ায় সামারাবিক্রমাকে ফেরান ইফতিকার। শ্রীলঙ্কান মিডল অর্ডার ব্যাটার ৪৮ রানে আউট হন। মেন্ডিস নিজের শতরানের দিকে অগ্রসর হচ্ছিলেন। তবে ৯১ রানে তাঁকেও সাজঘরের রাস্তা দেখান ইফতিকারই। শ্রীলঙ্কার মিডল অর্ডােরে ব্যাটিং ধস নামান ইফতিকার ও শাহিন শাহ আফ্রিদি। দাসুন শানাকা (২), ধনঞ্জয় ডি সিলভা (৫), দুনিথ ওয়ালালাগে (০), প্রমোদ মধুশান (১) সকলেই ব্যাট হাতে ব্যর্থ হন। একে একে ফেরেন সাজঘরে। তবে অপরপ্রান্তে উইকেট পড়লেও, আসালঙ্কা কিন্তু মাথা ঠান্ডা রেখে নিজের কাজটি করে যান। ইনিংসের শেষ বল অবধি ক্রিজে টিকে থাকেন লঙ্কান মিডল অর্ডার ব্যাটার। রুদ্ধশ্বাস ম্যাচের শেষ ওভারের শেষ বলে দলকে কাঙ্খিত জয় এনে দেন তিনি। ঘরের মাঠে রবিবাসরীয় ফাইনালে নিজেদের খেতাব নিজেদেরই দখলে রাখার সুযোগ রয়েছে শ্রীলঙ্কার কাছে। তারা নাগাড়ে দুইবার এশিয়া কাপ জিততে পারে কি না, এবার সেটাই দেখার। তিন উইকেট ও ব্যাট হাতে ৪৭ রান করেও দলকে জেতাতে পারলেন না ইফতিকার। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); হয়ে অপরাজিত ৯১ রানের ইনিংস খেলেন। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে ভারতীয় একাদশে শামির সুযোগ না পাওয়ার আসল কারণ জানালেন বোলিং কোচ মামব্রে var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-14 19:38:44","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/15/0bbe324ef2238873391ef7afdc13b5511694720288975507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"41869efb34619472b8ae27fe2b45a3f0","title":"Woakes hails Stokes as 'superhuman' after record knock","link":"https://thewest.com.au/sport/cricket/woakes-hails-stokes-as-superhuman-after-record-knock-c-11908029","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Teammate Chris Woakes, awed by Ben Stokes' latest record-breaking knock against New Zealand, says the England great has \"superhuman\" skills.","content":"Chris Woakes says Ben Stokes' record-breaking 182 has given England a timely reminder of what they can achieve with his \"superhuman\" skills. Stokes was in rampant form against New Zealand on Wednesday, making the country's highest-ever ODI score in just his third innings since reversing his year-long retirement from the format. With England's World Cup defence less than three weeks away, it was a perfect way for the man who carried them to victory in the 2019 final to prove his sense of occasion once again. Stokes has nothing left to prove on the big stage but watching him bully England's first World Cup opponents with nine sixes and 15 fours sent a wave of energy through the dressing room. England went on to wrap up victory by a huge margin of 181 runs, another reminder that when he is in the side, the whole team walks a little taller. \"We obviously see Ben as this superhuman that can do incredible things. We know he can,\" said Woakes, who picked up the baton with three early wickets in the field. \"It was great for the group and brilliant for Ben too. He's an unbelievable cricketer but coming back into the team having retired, it will do his confidence a world of good. \"We always have doubts and performance anxieties at the best of times, so it's great for his confidence and great for the team's confidence and belief that we can post huge scores. \"It was amazing to be here and play in the game because that was an incredible knock. \"He struck it cleaner than anyone else out there. It just shows how good a player he is.\" Since walking away from 50-over cricket last summer citing workload issues, Stokes has poured his energies into his role as Test captain. Working closely with head coach Brendon McCullum, he has revitalised the red-ball set-up, flipping their fortunes in dramatic fashion and playing out a thrilling drawn Ashes series that gripped the nation. Woakes feels that stepping back into the ranks under Jos Buttler's leadership, and operating as a specialist batter rather than all-action all-rounder, is a good thing for Stokes. \"I think him coming back into this team is probably a refreshing feeling for him, without the captaincy on his shoulders. To run the England Test team is a tough job,\" he said. \"He's probably seen this as a breath of fresh air, to play his natural game and be his natural person, which he always does.\" Sign up for our emails","pubDate":"2023-09-14 18:49:26","image_url":"https://images.thewest.com.au/publication/C-11908029/10bab135c50933cb41f1adfd0efd1ff85524e08c-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"47a089bfaa1c9bee772ab40932fa6702","title":"Problem of plenty is good: Paras Mhambrey","link":"https://economictimes.indiatimes.com/news/sports/problem-of-plenty-is-good-paras-mhambrey/articleshow/103672315.cms","keywords":null,"creator":null,"video_url":null,"description":"\"A problem of plenty is always good, we have four quality bowlers out there, we have great options,\" bowling coach Mhambrey said Thursday of a pace attack led by Jasprit Bumrah and also boasting Mohammed Shami, Mohammed Siraj and Shardul Thakur. There is also all-rounder Hardik Pandya. Ravindra Jadeja, Axar Patel and Kuldeep Yadav hold the spin force.","content":"Synopsis \"A problem of plenty is always good, we have four quality bowlers out there, we have great options,\" bowling coach Mhambrey said Thursday of a pace attack led by Jasprit Bumrah and also boasting Mohammed Shami, Mohammed Siraj and Shardul Thakur. There is also all-rounder Hardik Pandya. Ravindra Jadeja, Axar Patel and Kuldeep Yadav hold the spin force. Paras Mhambrey India face a \"problem of plenty\" in their bowling stocks ahead of Sunday's Asia Cup final and the ODI World Cup starting next month, coach Paras Mhambrey said. \"A problem of plenty is always good, we have four quality bowlers out there, we have great options,\" bowling coach Mhambrey said Thursday of a pace attack led by Jasprit Bumrah and also boasting Mohammed Shami, Mohammed Siraj and Shardul Thakur . There is also all-rounder Hardik Pandya. Ravindra Jadeja, Axar Patel and Kuldeep Yadav hold the spin force. \"The option of choosing the right combination will depend on what surface we are playing and what opponents we are playing,\" he added. Indian players including up-and-coming batsman Tilak Varma and T20 star Suryakumar Yadav trained in the nets on the eve of the team's last Super Four match, against Bangladesh in Colombo on Friday. Mhambrey gave little away about the line-up. \"We haven't decided on what we will do, but obviously there is an opportunity to give a game to other players since we have qualified for the final,\" said the former medium-pace bowler. Bangladesh have won just one match at the Asia Cup, but Mhambrey said: \"Bangladesh is a good team and we will have to play our best cricket.\" Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Print Edition Thursday, 14 Sep, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies ET Markets Learn more about our print edition More Records Tumble as Bulls Lead in Mkt Relief Rally Indian equities touched record levels on Wednesday, with the Nifty ending above 20,000 for the first time, led by gains in bank shares. Small- and micro-cap stocks rebounded from the previous day’s brutal sell-off, as investors temporarily brushed aside concerns over pricey valuations. OfBusiness Shows it Means Business Business-to-business (B2B) ecommerce firm OfBusiness bagged top honours at the ninth edition of India’s most prestigious awards for entrepreneurship — The Economic Times Startup Awards 2023. Apple to Manufacture iPhone 15 Plus in India from Next Quarter Apple will locally produce the iPhone 15 Plus in the next quarter, having successfully started production in India of the lower-priced base model of the series. Read More News on tilak varma suryakumar yadav shardul thakur mohammed siraj jasprit bumrah Paras Mhambrey (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Lesson from Franklin Templeton fiasco: Investors lap up AIFs to mitigate credit risk 8 mins read Green tech A SEED to decarbonise, ESG-linked KRAs: JSW Steel charts a net-zero journey without a target year 9 mins read Under the lens The duping of a Kerala senior citizen could be India’s first deepfake con – the crime of the future 10 mins read Subscribe to ETPrime","pubDate":"2023-09-14 18:15:54","image_url":null,"source_id":"economictimes_indiatimes","source_priority":376,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c96b3d4e161bed1bcea7c24fcf2abb72","title":"Woakes hails ‘superhuman’ Stokes after England star’s record run spree","link":"https://sportstar.thehindu.com/football/international-football/ben-stokes-odi-century-woakes-england-icc-odi-world-cup-2023/article67308947.ece","keywords":null,"creator":null,"video_url":null,"description":"Stokes smashed England’s highest-ever one-day international score on Wednesday in just his third innings since ending his year-long retirement from the format.","content":"Chris Woakes hailed Ben Stokes as “superhuman” after the England batsman’s record-breaking 182 against New Zealand sent out a warning to its title rivals ahead of the World Cup. Stokes smashed England’s highest-ever one-day international score on Wednesday in just his third innings since ending his year-long retirement from the format. With England’s 50-over World Cup defence starting in less than three weeks, it was a perfect way for the man who carried them to victory in the 2019 final to show he remains a match-winning force in the white-ball game. England’s Test captain demolished New Zealand with nine sixes and 15 fours to inspire an 181-run victory ahead of Friday’s series finale at Lord’s. “We obviously see Ben as this superhuman that can do incredible things. We know he can,” Woakes said. “It was great for the group and brilliant for Ben too. He’s an unbelievable cricketer but coming back into the team having retired, it will do his confidence a world of good. “We always have doubts and performance anxieties at the best of times, so it’s great for his confidence and great for the team’s confidence and belief that we can post huge scores. “It was amazing to be here and play in the game because that was an incredible knock. “He struck it cleaner than anyone else out there. It just shows how good a player he is.” Since walking away from 50-over cricket last year citing workload issues, Stokes has revitalised England’s Test team alongside coach Brendon McCullum. The dramatic fightback to draw the Ashes series against Australia earlier this year provided another showcase for his qualities as an inspirational leader. But Woakes feels that stepping back into the ranks under Jos Buttler’s ODI captaincy and operating as a specialist batter rather than an all-action all-rounder, is a good thing for Stokes. “I think him coming back into this team is probably a refreshing feeling for him, without the captaincy on his shoulders. To run the England Test team is a tough job,” he said. “He’s probably seen this as a breath of fresh air, to play his natural game and be his natural person, which he always does. “This group of players who have been around this team for a long time, always feel comfortable when we come back together.” Comments Related Topics","pubDate":"2023-09-14 18:02:03","image_url":null,"source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"8cc1dcd49e0af02ee17836498c605cae","title":"Ashwin praises KL Rahul's remarkable comeback and middle-order mastery in Asia Cup 2023","link":"https://www.newsr.in/n/Sports/1zpnjb1b4u/Ashwin-praises-KL-Rahul-remarkable-comeback-and.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"In a stunning return to international cricket, KL Rahul showcased his immense talent during the Asia Cup Reported by DNA 37 minutes ago.","content":"Thursday, 14 September 2023 ( 1 hour ago ) In a stunning return to international cricket, KL Rahul showcased his immense talent during the Asia Cup 👓 View full article","pubDate":"2023-09-14 17:48:44","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1d46aeaee96cd02cd6dc27fdc1945700","title":"Asia Cup ground staff have the most thankless job. Here's why","link":"https://economictimes.indiatimes.com/news/sports/asia-cup-ground-staff-have-the-most-thankless-job-heres-why/articleshow/103672016.cms","keywords":null,"creator":null,"video_url":null,"description":"For a day's labour, groundskeepers are paid 2,000 Sri Lankan rupees (LKR), which is about 550 Indian rupees.","content":"Synopsis For a day's labour, groundskeepers are paid 2,000 Sri Lankan rupees (LKR), which is about 550 Indian rupees. There is a popular meme that has been doing the rounds of the Internet lately. It features an image of a man sitting in a chair, shoulders sagging, head in his hands. As per the meme, he has the most redundant job in the world: that of a lifeguard at a swimming event at the Olympics. That may well be the most pointless if indeed it exists, but the most thankless job in the world is certainly being a groundskeeper in Sri Lanka . The orange brigade , as they have been nicknamed at the R Premadasa Stadium in Colombo , after the bright tee-shirts they wear, have been rock stars. Around 100 are in deployment at each of the Asia Cup matches, and they have been stretched to breaking point. Playing cricket in Sri Lanka in September is never a great idea, especially if you're hosting matches in Colombo. Hambantota is the driest at this time of the year, but a lack of infrastructure close to the venue - the nearest hotels are approximately 45 minutes away from the ground - ruled that out as an option for this tournament. Dambulla is the next best bet, but the ground was not ready to host international cricket, with some repairs and maintenance being done on the lights. So, Colombo it was, and predictably rain has affected virtually all matches in the Super4 stage. On Thursday, when Sri Lanka took on Pakistan, the rain came just as the toss was about to take place. But, the ground staff were alert and managed to get the entire ground covered in a matter of minutes. The downpour that followed was of Biblical proportions. At one point you could barely see the grandstand at the far end of the ground. At almost no other ground in the world would any cricket have been possible given the ferocity and duration of the precipitation and the volume of water that had fallen. Yet, only five overs a side was lost when play began at 5.15pm. This was possible because the ground staff had covered every square foot of the ground in their inimitable style. Approximately 15 giant rubberised canvas sheets, imported from India, are used at each ground. The staff first protect the pitch. Following this they bring covers to the square and then the outfield. After each set of covers is laid down, the edge is peeled back so the next round fits snugly under, making it impossible for water to seep through. This entire exercise is done like a synchronised dance and each person must know his exact role and perform it without deviation or hesitation. Only after this temporary waterproof seal is in place, the ground staff wait for the rain to stop. Once this happens, they reverse the earlier process, starting from the square, or the 30-yard-circle, pulling the covers towards the ropes so that the water that has pooled is driven out of the ground, where it quickly drains down into underground tanks to be stored for later use. The most incredible thing about the entire ground staff operation is how poorly they are treated. For a day's labour, they are paid 2,000 Sri Lankan rupees (LKR), which is about 550 Indian rupees. For every hour of overtime, they get LKR 200, and this is capped at a maximum of five hours per day. In addition, they get three meals and tea and a snack twice a day. When you consider the fact that the Asia Cup nets each participating nation approximately Rs 120 crore, it's staggering that the men who play such a critical role in ensuring that games are played in the first place and are the best at their profession globally, are paid so little. Fortunately, the Indian team is aware of this situation - as are some other teams - and is likely to make a \"goodwill gesture\" in the form of a one-off financial contribution, at the end of the tournament. That will certainly help the staff, some of whom are only contracted for this tournament and have other jobs, driving a rickshaw, working in a shop or waiting tables at small restaurants, but it does not provide a permanent solution. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Print Edition Thursday, 14 Sep, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies ET Markets Learn more about our print edition More Records Tumble as Bulls Lead in Mkt Relief Rally Indian equities touched record levels on Wednesday, with the Nifty ending above 20,000 for the first time, led by gains in bank shares. Small- and micro-cap stocks rebounded from the previous day’s brutal sell-off, as investors temporarily brushed aside concerns over pricey valuations. OfBusiness Shows it Means Business Business-to-business (B2B) ecommerce firm OfBusiness bagged top honours at the ninth edition of India’s most prestigious awards for entrepreneurship — The Economic Times Startup Awards 2023. Apple to Manufacture iPhone 15 Plus in India from Next Quarter Apple will locally produce the iPhone 15 Plus in the next quarter, having successfully started production in India of the lower-priced base model of the series. Read More News on orange brigade Cricket Ground asia cup sri lanka colombo ground staff (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Lesson from Franklin Templeton fiasco: Investors lap up AIFs to mitigate credit risk 8 mins read Green tech A SEED to decarbonise, ESG-linked KRAs: JSW Steel charts a net-zero journey without a target year 9 mins read Under the lens The duping of a Kerala senior citizen could be India’s first deepfake con – the crime of the future 10 mins read Subscribe to ETPrime","pubDate":"2023-09-14 17:48:42","image_url":null,"source_id":"economictimes_indiatimes","source_priority":376,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"614d5475db1a0a84473944abd7ed7a24","title":"Nat Sciver-Brunt thrilled to proceed Ashes ODI kind with record-breaking ton","link":"https://www.businesslend.com/sports/nat-sciver-brunt-thrilled-to-continue-ashes-odi-form-with-record-breaking-ton/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport publication for all the most recent information on every part from biking to boxing Sign as much as our free sport e mail for all the most recent information Nat Sciver-Brunt mirrored with delight on her record-breaking century as England introduced the curtain down on their summer time [...] The post Nat Sciver-Brunt thrilled to proceed Ashes ODI kind with record-breaking ton appeared first on BusinessLend.","content":"Nat Sciver-Brunt mirrored with delight on her record-breaking century as England introduced the curtain down on their summer time in barnstorming trend by thrashing Sri Lanka. On her one hundredth ODI and captaining the aspect within the absence of the unwell Heather Knight, Sciver-Brunt demonstrated a masterclass in managed aggression to peel off a surprising 66-ball hundred. It was the quickest ton in a ladies’s ODI by an England batter – eclipsing Charlotte Edwards’ 70-ball effort from March 2012 – because the hosts prevailed by a whopping 161 runs to seal a 2-0 collection win. Sciver-Brunt holed out for 120 off 74 balls, her third three-figure rating in her final 4 ODI innings, having helped England draw a gripping multi-format Ashes collection with back-to-back a whole bunch in July. “I’m really happy to bat the way I did and continue with what I was doing against Australia as well,” Sciver-Brunt stated on the post-match presentation ceremony. Sciver-Brunt was rested from the previous three T20s between the groups, the place England suffered a shock defeat, however the 31-year-old has felt the advantage of some downtime in a busy summer time programme. She has been managing a knee downside for a number of months and performed on this collection as a specialist batter however anticipates returning to all-rounder duties on England’s tour of India earlier than Christmas. “The decision not to bowl post-Ashes was more to give the body a bit of a rest,” she stated. “I’m looking forward to picking up the ball again. I want to influence games as much as I can. https://x.com/englandcricket/status/1702347907511222634?s=20 “That’s the best part of being an all-rounder and fielding for 50 overs and not really being able to influence with the ball was a little bit frustrating but I was happy to have the body break for that. Access unlimited streaming of movies and TV shows with Amazon Prime Video Sign up now for a 30-day free trial Sign up Access unlimited streaming of movies and TV shows with Amazon Prime Video Sign up now for a 30-day free trial Sign up “When we play so much cricket through the summer, we probably don’t need to train too many things, just be right in the mind and body and hopefully continue that mindset that I had (in the Ashes).” England have been slowed down by Sri Lanka’s spinners within the T20s when batting first and will have feared the worst when Tammy Beaumont and Alice Capsey have been dismissed early in a match decreased to 31 overs per aspect at Grace Road due to rain that led to the beginning time being pushed again by greater than three hours. But Sciver-Brunt exhibited why she is so instrumental, taking over the coterie of off-spinners and sluggish left-armers, punching with aplomb off the again foot and displaying her full vary with fluid drives, pulls, sweeps and one scoop for 18 fours and a single six. Maia Bouchier, that includes in simply her third ODI and in her second innings within the format, supplied ample help with 95 off solely 65 balls. The 24-year-old opener crashed a dozen fours and two sixes in a 193-run stand from simply 121 deliveries with Sciver-Brunt. “She’s a fantastic player,” England head coach Jon Lewis stated of his stand-in captain. “It’s the calmness she brings – and I thought we saw that in abundance here. The calmness she brought to Maia in a situation when we were 18 for two, she’s come out with an authority.” Sciver-Brunt was the primary to 3 figures however Bouchier might have made certain her team-mate’s document lasted just some minutes had she dispatched her sixty fifth ball for six, solely to be trapped lbw. “I was absolutely gutted for her that she didn’t score a hundred because I know that when she does score a hundred, she’ll score a lot of hundreds,” Lewis added. “She’s incredibly talented.” Sciver-Brunt and Bouchier underpinned a mammoth 273 for eight, a complete which might have stretched Sri Lanka in a regulation 50-over recreation and the vacationers have been by no means in competition within the chase. They capitulated to 112 all out in 24.5 overs, as Charlie Dean claimed 5 for 31, her maiden five-wicket haul for England which the off-spinner recognised was constructed on Sciver-Brunt’s beautiful knock. “She’s the best all-rounder in the world, the best batter,” Dean stated. “She brings a lot to the team, she definitely elevates us with her standards alone. “I guess she goes under the radar with her leadership – she’s so calm. We have so many players that can do similar but there’s only one Nat Sciver-Brunt.” France given large Rugby World Cup scare by minnows Uruguay","pubDate":"2023-09-14 21:07:59","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0eb6c47e6c85ee9af5f6fa07b3020d38","title":"Nat Sciver-Brunt thrilled to continue Ashes ODI form with record-breaking ton","link":"https://www.times-series.co.uk/sport/national/23790768.nat-sciver-brunt-thrilled-continue-ashes-odi-form-record-breaking-ton/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The stand-in England captain scored a record-breaking century in her 100th ODI.","content":"On her 100th ODI and captaining the side in the absence of the unwell Heather Knight, Sciver-Brunt demonstrated a masterclass in controlled aggression to peel off a stunning 66-ball hundred. It was the fastest ton in a women’s ODI by an England batter – eclipsing Charlotte Edwards’ 70-ball effort from March 2012 – as the hosts prevailed by a whopping 161 runs to seal a 2-0 series win. Sciver-Brunt holed out for 120 off 74 balls, her third three-figure score in her last four ODI innings, having helped England draw a gripping multi-format Ashes series with back-to-back hundreds in July. “I’m really happy to bat the way I did and continue with what I was doing against Australia as well,” Sciver-Brunt said at the post-match presentation ceremony. Sciver-Brunt was rested from the preceding three T20s between the teams, where England suffered a shock defeat, but the 31-year-old has felt the benefit of some downtime in a hectic summer programme. She has been managing a knee problem for several months and played in this series as a specialist batter but anticipates returning to all-rounder duties on England’s tour of India before Christmas. “The decision not to bowl post-Ashes was more to give the body a bit of a rest,” she said. “I’m looking forward to picking up the ball again. I want to influence games as much as I can. “That’s the best part of being an all-rounder and fielding for 50 overs and not really being able to influence with the ball was a little bit frustrating but I was happy to have the body break for that. “When we play so much cricket through the summer, we probably don’t need to train too many things, just be right in the mind and body and hopefully continue that mindset that I had (in the Ashes).” England were bogged down by Sri Lanka’s spinners in the T20s when batting first and may have feared the worst when Tammy Beaumont and Alice Capsey were dismissed early in a match reduced to 31 overs per side at Grace Road because of rain that led to the start time being pushed back by more than three hours. But Sciver-Brunt exhibited why she is so instrumental, taking on the coterie of off-spinners and slow left-armers, punching with aplomb off the back foot and displaying her full range with fluid drives, pulls, sweeps and one scoop for 18 fours and a single six. Maia Bouchier, featuring in just her third ODI and in her second innings in the format, provided ample support with 95 off only 65 balls. The 24-year-old opener crashed a dozen fours and two sixes in a 193-run stand from just 121 deliveries with Sciver-Brunt. “She’s a fantastic player,” England head coach Jon Lewis said of his stand-in captain. “It’s the calmness she brings – and I thought we saw that in abundance here. The calmness she brought to Maia in a situation when we were 18 for two, she’s come out with an authority.” Sciver-Brunt was the first to three figures but Bouchier could have made sure her team-mate’s record lasted just a few minutes had she dispatched her 65th ball for six, only to be trapped lbw. “I was absolutely gutted for her that she didn’t score a hundred because I know that when she does score a hundred, she’ll score a lot of hundreds,” Lewis added. “She’s incredibly talented.” Sciver-Brunt and Bouchier underpinned a mammoth 273 for eight, a total which would have stretched Sri Lanka in a regulation 50-over game and the tourists were never in contention in the chase. They capitulated to 112 all out in 24.5 overs, as Charlie Dean claimed five for 31, her maiden five-wicket haul for England which the off-spinner recognised was built on Sciver-Brunt’s stunning knock. “She’s the best all-rounder in the world, the best batter,” Dean said. “She brings a lot to the team, she definitely elevates us with her standards alone. “I guess she goes under the radar with her leadership – she’s so calm. We have so many players that can do similar but there’s only one Nat Sciver-Brunt.”","pubDate":"2023-09-14 21:01:21","image_url":"https://www.times-series.co.uk/resources/images/17228972/?type=app&htype=0","source_id":"time_series","source_priority":668753,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"85d9730fe825fa85ea1f4d4e3769bfc7","title":"Nat Sciver-Brunt thrilled to continue Ashes ODI form with record-breaking ton","link":"https://www.echo-news.co.uk/sport/national/23790768.nat-sciver-brunt-thrilled-continue-ashes-odi-form-record-breaking-ton/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The stand-in England captain scored a record-breaking century in her 100th ODI.","content":"On her 100th ODI and captaining the side in the absence of the unwell Heather Knight, Sciver-Brunt demonstrated a masterclass in controlled aggression to peel off a stunning 66-ball hundred. It was the fastest ton in a women’s ODI by an England batter – eclipsing Charlotte Edwards’ 70-ball effort from March 2012 – as the hosts prevailed by a whopping 161 runs to seal a 2-0 series win. Sciver-Brunt holed out for 120 off 74 balls, her third three-figure score in her last four ODI innings, having helped England draw a gripping multi-format Ashes series with back-to-back hundreds in July. “I’m really happy to bat the way I did and continue with what I was doing against Australia as well,” Sciver-Brunt said at the post-match presentation ceremony. Sciver-Brunt was rested from the preceding three T20s between the teams, where England suffered a shock defeat, but the 31-year-old has felt the benefit of some downtime in a hectic summer programme. She has been managing a knee problem for several months and played in this series as a specialist batter but anticipates returning to all-rounder duties on England’s tour of India before Christmas. “The decision not to bowl post-Ashes was more to give the body a bit of a rest,” she said. “I’m looking forward to picking up the ball again. I want to influence games as much as I can. 100th ODI, and playing it in style 🤩 Nat is unstoppable 👏 — England Cricket (@englandcricket) “That’s the best part of being an all-rounder and fielding for 50 overs and not really being able to influence with the ball was a little bit frustrating but I was happy to have the body break for that. “When we play so much cricket through the summer, we probably don’t need to train too many things, just be right in the mind and body and hopefully continue that mindset that I had (in the Ashes).” England were bogged down by Sri Lanka’s spinners in the T20s when batting first and may have feared the worst when Tammy Beaumont and Alice Capsey were dismissed early in a match reduced to 31 overs per side at Grace Road because of rain that led to the start time being pushed back by more than three hours. But Sciver-Brunt exhibited why she is so instrumental, taking on the coterie of off-spinners and slow left-armers, punching with aplomb off the back foot and displaying her full range with fluid drives, pulls, sweeps and one scoop for 18 fours and a single six. Maia Bouchier, featuring in just her third ODI and in her second innings in the format, provided ample support with 95 off only 65 balls. The 24-year-old opener crashed a dozen fours and two sixes in a 193-run stand from just 121 deliveries with Sciver-Brunt. “She’s a fantastic player,” England head coach Jon Lewis said of his stand-in captain. “It’s the calmness she brings – and I thought we saw that in abundance here. The calmness she brought to Maia in a situation when we were 18 for two, she’s come out with an authority.” Sciver-Brunt was the first to three figures but Bouchier could have made sure her team-mate’s record lasted just a few minutes had she dispatched her 65th ball for six, only to be trapped lbw. “I was absolutely gutted for her that she didn’t score a hundred because I know that when she does score a hundred, she’ll score a lot of hundreds,” Lewis added. “She’s incredibly talented.” Sciver-Brunt and Bouchier underpinned a mammoth 273 for eight, a total which would have stretched Sri Lanka in a regulation 50-over game and the tourists were never in contention in the chase. They capitulated to 112 all out in 24.5 overs, as Charlie Dean claimed five for 31, her maiden five-wicket haul for England which the off-spinner recognised was built on Sciver-Brunt’s stunning knock. “She’s the best all-rounder in the world, the best batter,” Dean said. “She brings a lot to the team, she definitely elevates us with her standards alone. “I guess she goes under the radar with her leadership – she’s so calm. We have so many players that can do similar but there’s only one Nat Sciver-Brunt.”","pubDate":"2023-09-14 21:01:21","image_url":"https://www.echo-news.co.uk/resources/images/17228972/?type=app&htype=0","source_id":"echo_uk","source_priority":159993,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"97fc46b48dae60a8c3ad557da209c7d0","title":"England women's cricket: Five things we learned after Ashes success and Sri Lanka disappointment","link":"https://www.newsr.in/n/Sports/1zpnjb1dp4/England-women-cricket-Five-things-we-learned.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"BBC Sport looks at what can be learned from England women's summer. Reported by BBC Sport 13 minutes ago.","content":"Thursday, 14 September 2023 ( 1 hour ago ) BBC Sport looks at what can be learned from England women's summer. 👓 View full article","pubDate":"2023-09-14 20:41:54","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4526349ec8378ef7189f292e1add3993","title":"PAK vs SL, Match Highlights: রুদ্ধশ্বাস ম্যাচে ২ উইকেটে পাকিস্তানকে হারিয়ে এশিয়া কাপের ফাইনালে শ্রীলঙ্কা","link":"https://bengali.abplive.com/sports/cricket/asia-cup-2023-sri-lanka-beat-pakistan-by-2-wickets-against-super-4-full-match-highlights-qualified-for-final-1009093","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: জয়ের জন্য ৪২ ওভারে শ্রীলঙ্কার টার্গেট ছিল ২৫২ রান। ১১ নম্বর বার এশিয়া কাপের ফাইনালে পৌঁছনোর হাতছানি ছিল তাঁদের সামনে। অপরদিকে, পাকিস্তানের সামনে সুযোগ ছিল শ্রীলঙ্কাকে হারিয়ে প্রথমবার ভারত-পাকিস্তান এশিয়া কাপ ফাইনালের। ম্যাচের শেষ বল পর্যন্ত চলে হাড্ডাহাড্ডি লড়াই। তবে শেষমেশ দুই উইকেটে ম্যাচের শেষ বলে রুদ্ধশ্বাস জয় পেল শ্রীলঙ্কা। চরিথ আসালঙ্কা অপরাজিত ৪৯ রানে শ্রীলঙ্কাকে ফাইনালে পৌঁছে দেন। কুশল মেন্ডিস দ্বীপরাষ্ট্রের হয়ে অপরাজিত ৯১ রানের ইনিংস খেলেন।","content":"কলম্বো: জয়ের জন্য ৪২ ওভারে পাকিস্তানের বিরুদ্ধে (PAK vs SL) শ্রীলঙ্কার টার্গেট ছিল ২৫২ রান। ১১ নম্বর বার এশিয়া কাপের (Asia Cup 2023) ফাইনালে পৌঁছনোর হাতছানি ছিল তাঁদের সামনে। অপরদিকে, পাকিস্তানের সামনে সুযোগ ছিল শ্রীলঙ্কাকে হারিয়ে প্রথমবার ভারত-পাকিস্তান এশিয়া কাপ ফাইনালের। ম্যাচের শেষ বল পর্যন্ত চলে হাড্ডাহাড্ডি লড়াই। তবে শেষমেশ দুই উইকেটে ম্যাচের শেষ বলে রুদ্ধশ্বাস জয় পেল শ্রীলঙ্কা। চরিথ আসালঙ্কা (Charith Asalanka) অপরাজিত ৪৯ রানে শ্রীলঙ্কাকে ফাইনালে পৌঁছে দেন। বড় রানের লক্ষ্য তাড়া করতে নেমে এদিন কুশল পেরিরা শ্রীলঙ্কার হয়ে শুরুটা দুরন্তভাবে করেন। তবে শাদাব খানের দুরন্ত ডাইরেক্ট হিটে আট বলে ১৭ রান করেই ফিরতে হয় তাঁকে। ২০ রানে প্রথম উইকেট হারালেও দ্বিতীয় উইকেটে পাথুম নিসাঙ্কা ও কুশল মেন্ডিস (Kusal Mendis) ৫৭ রানের পার্টনারশিপে শ্রীলঙ্কান ইনিংসকে স্থিরতা প্রদান করেন। নিসাঙ্কা ২০ রানে আউট হওয়ার পর সাদিরা সামারাবিক্রমার সঙ্গে মিলে দ্বীপরাষ্ট্রের ইনিংসকে এগিয়ে নিয়ে যান মেন্ডিস। তৃতীয় উইকেটে দুইজনে শতরানের পার্টনারশিপ গড়েন। তবে অর্ধশতরানের দোরগোড়ায় সামারাবিক্রমাকে ফেরান ইফতিকার। শ্রীলঙ্কান মিডল অর্ডার ব্যাটার ৪৮ রানে আউট হন। মেন্ডিস নিজের শতরানের দিকে অগ্রসর হচ্ছিলেন। তবে ৯১ রানে তাঁকেও সাজঘরের রাস্তা দেখান ইফতিকারই। শ্রীলঙ্কার মিডল অর্ডােরে ব্যাটিং ধস নামান ইফতিকার ও শাহিন শাহ আফ্রিদি। দাসুন শানাকা (২), ধনঞ্জয় ডি সিলভা (৫), দুনিথ ওয়ালালাগে (০), প্রমোদ মধুশান (১) সকলেই ব্যাট হাতে ব্যর্থ হন। একে একে ফেরেন সাজঘরে। তবে অপরপ্রান্তে উইকেট পড়লেও, আসালঙ্কা কিন্তু মাথা ঠান্ডা রেখে নিজের কাজটি করে যান। ইনিংসের শেষ বল অবধি ক্রিজে টিকে থাকেন লঙ্কান মিডল অর্ডার ব্যাটার। রুদ্ধশ্বাস ম্যাচের শেষ ওভারের শেষ বলে দলকে কাঙ্খিত জয় এনে দেন তিনি। ঘরের মাঠে রবিবাসরীয় ফাইনালে নিজেদের খেতাব নিজেদেরই দখলে রাখার সুযোগ রয়েছে শ্রীলঙ্কার কাছে। তারা নাগাড়ে দুইবার এশিয়া কাপ জিততে পারে কি না, এবার সেটাই দেখার। তিন উইকেট ও ব্যাট হাতে ৪৭ রান করেও দলকে জেতাতে পারলেন না ইফতিকার। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); হয়ে অপরাজিত ৯১ রানের ইনিংস খেলেন। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে ভারতীয় একাদশে শামির সুযোগ না পাওয়ার আসল কারণ জানালেন বোলিং কোচ মামব্রে var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-14 19:38:44","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/15/0bbe324ef2238873391ef7afdc13b5511694720288975507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"41869efb34619472b8ae27fe2b45a3f0","title":"Woakes hails Stokes as 'superhuman' after record knock","link":"https://thewest.com.au/sport/cricket/woakes-hails-stokes-as-superhuman-after-record-knock-c-11908029","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Teammate Chris Woakes, awed by Ben Stokes' latest record-breaking knock against New Zealand, says the England great has \"superhuman\" skills.","content":"Chris Woakes says Ben Stokes' record-breaking 182 has given England a timely reminder of what they can achieve with his \"superhuman\" skills. Stokes was in rampant form against New Zealand on Wednesday, making the country's highest-ever ODI score in just his third innings since reversing his year-long retirement from the format. With England's World Cup defence less than three weeks away, it was a perfect way for the man who carried them to victory in the 2019 final to prove his sense of occasion once again. Stokes has nothing left to prove on the big stage but watching him bully England's first World Cup opponents with nine sixes and 15 fours sent a wave of energy through the dressing room. England went on to wrap up victory by a huge margin of 181 runs, another reminder that when he is in the side, the whole team walks a little taller. \"We obviously see Ben as this superhuman that can do incredible things. We know he can,\" said Woakes, who picked up the baton with three early wickets in the field. \"It was great for the group and brilliant for Ben too. He's an unbelievable cricketer but coming back into the team having retired, it will do his confidence a world of good. \"We always have doubts and performance anxieties at the best of times, so it's great for his confidence and great for the team's confidence and belief that we can post huge scores. \"It was amazing to be here and play in the game because that was an incredible knock. \"He struck it cleaner than anyone else out there. It just shows how good a player he is.\" Since walking away from 50-over cricket last summer citing workload issues, Stokes has poured his energies into his role as Test captain. Working closely with head coach Brendon McCullum, he has revitalised the red-ball set-up, flipping their fortunes in dramatic fashion and playing out a thrilling drawn Ashes series that gripped the nation. Woakes feels that stepping back into the ranks under Jos Buttler's leadership, and operating as a specialist batter rather than all-action all-rounder, is a good thing for Stokes. \"I think him coming back into this team is probably a refreshing feeling for him, without the captaincy on his shoulders. To run the England Test team is a tough job,\" he said. \"He's probably seen this as a breath of fresh air, to play his natural game and be his natural person, which he always does.\" Sign up for our emails","pubDate":"2023-09-14 18:49:26","image_url":"https://images.thewest.com.au/publication/C-11908029/10bab135c50933cb41f1adfd0efd1ff85524e08c-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"47a089bfaa1c9bee772ab40932fa6702","title":"Problem of plenty is good: Paras Mhambrey","link":"https://economictimes.indiatimes.com/news/sports/problem-of-plenty-is-good-paras-mhambrey/articleshow/103672315.cms","keywords":null,"creator":null,"video_url":null,"description":"\"A problem of plenty is always good, we have four quality bowlers out there, we have great options,\" bowling coach Mhambrey said Thursday of a pace attack led by Jasprit Bumrah and also boasting Mohammed Shami, Mohammed Siraj and Shardul Thakur. There is also all-rounder Hardik Pandya. Ravindra Jadeja, Axar Patel and Kuldeep Yadav hold the spin force.","content":"Synopsis \"A problem of plenty is always good, we have four quality bowlers out there, we have great options,\" bowling coach Mhambrey said Thursday of a pace attack led by Jasprit Bumrah and also boasting Mohammed Shami, Mohammed Siraj and Shardul Thakur. There is also all-rounder Hardik Pandya. Ravindra Jadeja, Axar Patel and Kuldeep Yadav hold the spin force. Paras Mhambrey India face a \"problem of plenty\" in their bowling stocks ahead of Sunday's Asia Cup final and the ODI World Cup starting next month, coach Paras Mhambrey said. \"A problem of plenty is always good, we have four quality bowlers out there, we have great options,\" bowling coach Mhambrey said Thursday of a pace attack led by Jasprit Bumrah and also boasting Mohammed Shami, Mohammed Siraj and Shardul Thakur . There is also all-rounder Hardik Pandya. Ravindra Jadeja, Axar Patel and Kuldeep Yadav hold the spin force. \"The option of choosing the right combination will depend on what surface we are playing and what opponents we are playing,\" he added. Indian players including up-and-coming batsman Tilak Varma and T20 star Suryakumar Yadav trained in the nets on the eve of the team's last Super Four match, against Bangladesh in Colombo on Friday. Mhambrey gave little away about the line-up. \"We haven't decided on what we will do, but obviously there is an opportunity to give a game to other players since we have qualified for the final,\" said the former medium-pace bowler. Bangladesh have won just one match at the Asia Cup, but Mhambrey said: \"Bangladesh is a good team and we will have to play our best cricket.\" Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Print Edition Thursday, 14 Sep, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies ET Markets Learn more about our print edition More Records Tumble as Bulls Lead in Mkt Relief Rally Indian equities touched record levels on Wednesday, with the Nifty ending above 20,000 for the first time, led by gains in bank shares. Small- and micro-cap stocks rebounded from the previous day’s brutal sell-off, as investors temporarily brushed aside concerns over pricey valuations. OfBusiness Shows it Means Business Business-to-business (B2B) ecommerce firm OfBusiness bagged top honours at the ninth edition of India’s most prestigious awards for entrepreneurship — The Economic Times Startup Awards 2023. Apple to Manufacture iPhone 15 Plus in India from Next Quarter Apple will locally produce the iPhone 15 Plus in the next quarter, having successfully started production in India of the lower-priced base model of the series. Read More News on tilak varma suryakumar yadav shardul thakur mohammed siraj jasprit bumrah Paras Mhambrey (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Lesson from Franklin Templeton fiasco: Investors lap up AIFs to mitigate credit risk 8 mins read Green tech A SEED to decarbonise, ESG-linked KRAs: JSW Steel charts a net-zero journey without a target year 9 mins read Under the lens The duping of a Kerala senior citizen could be India’s first deepfake con – the crime of the future 10 mins read Subscribe to ETPrime","pubDate":"2023-09-14 18:15:54","image_url":null,"source_id":"economictimes_indiatimes","source_priority":376,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c96b3d4e161bed1bcea7c24fcf2abb72","title":"Woakes hails ‘superhuman’ Stokes after England star’s record run spree","link":"https://sportstar.thehindu.com/football/international-football/ben-stokes-odi-century-woakes-england-icc-odi-world-cup-2023/article67308947.ece","keywords":null,"creator":null,"video_url":null,"description":"Stokes smashed England’s highest-ever one-day international score on Wednesday in just his third innings since ending his year-long retirement from the format.","content":"Chris Woakes hailed Ben Stokes as “superhuman” after the England batsman’s record-breaking 182 against New Zealand sent out a warning to its title rivals ahead of the World Cup. Stokes smashed England’s highest-ever one-day international score on Wednesday in just his third innings since ending his year-long retirement from the format. With England’s 50-over World Cup defence starting in less than three weeks, it was a perfect way for the man who carried them to victory in the 2019 final to show he remains a match-winning force in the white-ball game. England’s Test captain demolished New Zealand with nine sixes and 15 fours to inspire an 181-run victory ahead of Friday’s series finale at Lord’s. “We obviously see Ben as this superhuman that can do incredible things. We know he can,” Woakes said. “It was great for the group and brilliant for Ben too. He’s an unbelievable cricketer but coming back into the team having retired, it will do his confidence a world of good. “We always have doubts and performance anxieties at the best of times, so it’s great for his confidence and great for the team’s confidence and belief that we can post huge scores. “It was amazing to be here and play in the game because that was an incredible knock. “He struck it cleaner than anyone else out there. It just shows how good a player he is.” Since walking away from 50-over cricket last year citing workload issues, Stokes has revitalised England’s Test team alongside coach Brendon McCullum. The dramatic fightback to draw the Ashes series against Australia earlier this year provided another showcase for his qualities as an inspirational leader. But Woakes feels that stepping back into the ranks under Jos Buttler’s ODI captaincy and operating as a specialist batter rather than an all-action all-rounder, is a good thing for Stokes. “I think him coming back into this team is probably a refreshing feeling for him, without the captaincy on his shoulders. To run the England Test team is a tough job,” he said. “He’s probably seen this as a breath of fresh air, to play his natural game and be his natural person, which he always does. “This group of players who have been around this team for a long time, always feel comfortable when we come back together.” Comments Related Topics","pubDate":"2023-09-14 18:02:03","image_url":null,"source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"8cc1dcd49e0af02ee17836498c605cae","title":"Ashwin praises KL Rahul's remarkable comeback and middle-order mastery in Asia Cup 2023","link":"https://www.newsr.in/n/Sports/1zpnjb1b4u/Ashwin-praises-KL-Rahul-remarkable-comeback-and.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"In a stunning return to international cricket, KL Rahul showcased his immense talent during the Asia Cup Reported by DNA 37 minutes ago.","content":"Thursday, 14 September 2023 ( 1 hour ago ) In a stunning return to international cricket, KL Rahul showcased his immense talent during the Asia Cup 👓 View full article","pubDate":"2023-09-14 17:48:44","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1d46aeaee96cd02cd6dc27fdc1945700","title":"Asia Cup ground staff have the most thankless job. Here's why","link":"https://economictimes.indiatimes.com/news/sports/asia-cup-ground-staff-have-the-most-thankless-job-heres-why/articleshow/103672016.cms","keywords":null,"creator":null,"video_url":null,"description":"For a day's labour, groundskeepers are paid 2,000 Sri Lankan rupees (LKR), which is about 550 Indian rupees.","content":"Synopsis For a day's labour, groundskeepers are paid 2,000 Sri Lankan rupees (LKR), which is about 550 Indian rupees. There is a popular meme that has been doing the rounds of the Internet lately. It features an image of a man sitting in a chair, shoulders sagging, head in his hands. As per the meme, he has the most redundant job in the world: that of a lifeguard at a swimming event at the Olympics. That may well be the most pointless if indeed it exists, but the most thankless job in the world is certainly being a groundskeeper in Sri Lanka . The orange brigade , as they have been nicknamed at the R Premadasa Stadium in Colombo , after the bright tee-shirts they wear, have been rock stars. Around 100 are in deployment at each of the Asia Cup matches, and they have been stretched to breaking point. Playing cricket in Sri Lanka in September is never a great idea, especially if you're hosting matches in Colombo. Hambantota is the driest at this time of the year, but a lack of infrastructure close to the venue - the nearest hotels are approximately 45 minutes away from the ground - ruled that out as an option for this tournament. Dambulla is the next best bet, but the ground was not ready to host international cricket, with some repairs and maintenance being done on the lights. So, Colombo it was, and predictably rain has affected virtually all matches in the Super4 stage. On Thursday, when Sri Lanka took on Pakistan, the rain came just as the toss was about to take place. But, the ground staff were alert and managed to get the entire ground covered in a matter of minutes. The downpour that followed was of Biblical proportions. At one point you could barely see the grandstand at the far end of the ground. At almost no other ground in the world would any cricket have been possible given the ferocity and duration of the precipitation and the volume of water that had fallen. Yet, only five overs a side was lost when play began at 5.15pm. This was possible because the ground staff had covered every square foot of the ground in their inimitable style. Approximately 15 giant rubberised canvas sheets, imported from India, are used at each ground. The staff first protect the pitch. Following this they bring covers to the square and then the outfield. After each set of covers is laid down, the edge is peeled back so the next round fits snugly under, making it impossible for water to seep through. This entire exercise is done like a synchronised dance and each person must know his exact role and perform it without deviation or hesitation. Only after this temporary waterproof seal is in place, the ground staff wait for the rain to stop. Once this happens, they reverse the earlier process, starting from the square, or the 30-yard-circle, pulling the covers towards the ropes so that the water that has pooled is driven out of the ground, where it quickly drains down into underground tanks to be stored for later use. The most incredible thing about the entire ground staff operation is how poorly they are treated. For a day's labour, they are paid 2,000 Sri Lankan rupees (LKR), which is about 550 Indian rupees. For every hour of overtime, they get LKR 200, and this is capped at a maximum of five hours per day. In addition, they get three meals and tea and a snack twice a day. When you consider the fact that the Asia Cup nets each participating nation approximately Rs 120 crore, it's staggering that the men who play such a critical role in ensuring that games are played in the first place and are the best at their profession globally, are paid so little. Fortunately, the Indian team is aware of this situation - as are some other teams - and is likely to make a \"goodwill gesture\" in the form of a one-off financial contribution, at the end of the tournament. That will certainly help the staff, some of whom are only contracted for this tournament and have other jobs, driving a rickshaw, working in a shop or waiting tables at small restaurants, but it does not provide a permanent solution. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Print Edition Thursday, 14 Sep, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies ET Markets Learn more about our print edition More Records Tumble as Bulls Lead in Mkt Relief Rally Indian equities touched record levels on Wednesday, with the Nifty ending above 20,000 for the first time, led by gains in bank shares. Small- and micro-cap stocks rebounded from the previous day’s brutal sell-off, as investors temporarily brushed aside concerns over pricey valuations. OfBusiness Shows it Means Business Business-to-business (B2B) ecommerce firm OfBusiness bagged top honours at the ninth edition of India’s most prestigious awards for entrepreneurship — The Economic Times Startup Awards 2023. Apple to Manufacture iPhone 15 Plus in India from Next Quarter Apple will locally produce the iPhone 15 Plus in the next quarter, having successfully started production in India of the lower-priced base model of the series. Read More News on orange brigade Cricket Ground asia cup sri lanka colombo ground staff (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Lesson from Franklin Templeton fiasco: Investors lap up AIFs to mitigate credit risk 8 mins read Green tech A SEED to decarbonise, ESG-linked KRAs: JSW Steel charts a net-zero journey without a target year 9 mins read Under the lens The duping of a Kerala senior citizen could be India’s first deepfake con – the crime of the future 10 mins read Subscribe to ETPrime","pubDate":"2023-09-14 17:48:42","image_url":null,"source_id":"economictimes_indiatimes","source_priority":376,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"614d5475db1a0a84473944abd7ed7a24","title":"Nat Sciver-Brunt thrilled to proceed Ashes ODI kind with record-breaking ton","link":"https://www.businesslend.com/sports/nat-sciver-brunt-thrilled-to-continue-ashes-odi-form-with-record-breaking-ton/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport publication for all the most recent information on every part from biking to boxing Sign as much as our free sport e mail for all the most recent information Nat Sciver-Brunt mirrored with delight on her record-breaking century as England introduced the curtain down on their summer time [...] The post Nat Sciver-Brunt thrilled to proceed Ashes ODI kind with record-breaking ton appeared first on BusinessLend.","content":"Nat Sciver-Brunt mirrored with delight on her record-breaking century as England introduced the curtain down on their summer time in barnstorming trend by thrashing Sri Lanka. On her one hundredth ODI and captaining the aspect within the absence of the unwell Heather Knight, Sciver-Brunt demonstrated a masterclass in managed aggression to peel off a surprising 66-ball hundred. It was the quickest ton in a ladies’s ODI by an England batter – eclipsing Charlotte Edwards’ 70-ball effort from March 2012 – because the hosts prevailed by a whopping 161 runs to seal a 2-0 collection win. Sciver-Brunt holed out for 120 off 74 balls, her third three-figure rating in her final 4 ODI innings, having helped England draw a gripping multi-format Ashes collection with back-to-back a whole bunch in July. “I’m really happy to bat the way I did and continue with what I was doing against Australia as well,” Sciver-Brunt stated on the post-match presentation ceremony. Sciver-Brunt was rested from the previous three T20s between the groups, the place England suffered a shock defeat, however the 31-year-old has felt the advantage of some downtime in a busy summer time programme. She has been managing a knee downside for a number of months and performed on this collection as a specialist batter however anticipates returning to all-rounder duties on England’s tour of India earlier than Christmas. “The decision not to bowl post-Ashes was more to give the body a bit of a rest,” she stated. “I’m looking forward to picking up the ball again. I want to influence games as much as I can. https://x.com/englandcricket/status/1702347907511222634?s=20 “That’s the best part of being an all-rounder and fielding for 50 overs and not really being able to influence with the ball was a little bit frustrating but I was happy to have the body break for that. Access unlimited streaming of movies and TV shows with Amazon Prime Video Sign up now for a 30-day free trial Sign up Access unlimited streaming of movies and TV shows with Amazon Prime Video Sign up now for a 30-day free trial Sign up “When we play so much cricket through the summer, we probably don’t need to train too many things, just be right in the mind and body and hopefully continue that mindset that I had (in the Ashes).” England have been slowed down by Sri Lanka’s spinners within the T20s when batting first and will have feared the worst when Tammy Beaumont and Alice Capsey have been dismissed early in a match decreased to 31 overs per aspect at Grace Road due to rain that led to the beginning time being pushed again by greater than three hours. But Sciver-Brunt exhibited why she is so instrumental, taking over the coterie of off-spinners and sluggish left-armers, punching with aplomb off the again foot and displaying her full vary with fluid drives, pulls, sweeps and one scoop for 18 fours and a single six. Maia Bouchier, that includes in simply her third ODI and in her second innings within the format, supplied ample help with 95 off solely 65 balls. The 24-year-old opener crashed a dozen fours and two sixes in a 193-run stand from simply 121 deliveries with Sciver-Brunt. “She’s a fantastic player,” England head coach Jon Lewis stated of his stand-in captain. “It’s the calmness she brings – and I thought we saw that in abundance here. The calmness she brought to Maia in a situation when we were 18 for two, she’s come out with an authority.” Sciver-Brunt was the primary to 3 figures however Bouchier might have made certain her team-mate’s document lasted just some minutes had she dispatched her sixty fifth ball for six, solely to be trapped lbw. “I was absolutely gutted for her that she didn’t score a hundred because I know that when she does score a hundred, she’ll score a lot of hundreds,” Lewis added. “She’s incredibly talented.” Sciver-Brunt and Bouchier underpinned a mammoth 273 for eight, a complete which might have stretched Sri Lanka in a regulation 50-over recreation and the vacationers have been by no means in competition within the chase. They capitulated to 112 all out in 24.5 overs, as Charlie Dean claimed 5 for 31, her maiden five-wicket haul for England which the off-spinner recognised was constructed on Sciver-Brunt’s beautiful knock. “She’s the best all-rounder in the world, the best batter,” Dean stated. “She brings a lot to the team, she definitely elevates us with her standards alone. “I guess she goes under the radar with her leadership – she’s so calm. We have so many players that can do similar but there’s only one Nat Sciver-Brunt.” France given large Rugby World Cup scare by minnows Uruguay","pubDate":"2023-09-14 21:07:59","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0eb6c47e6c85ee9af5f6fa07b3020d38","title":"Nat Sciver-Brunt thrilled to continue Ashes ODI form with record-breaking ton","link":"https://www.times-series.co.uk/sport/national/23790768.nat-sciver-brunt-thrilled-continue-ashes-odi-form-record-breaking-ton/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The stand-in England captain scored a record-breaking century in her 100th ODI.","content":"On her 100th ODI and captaining the side in the absence of the unwell Heather Knight, Sciver-Brunt demonstrated a masterclass in controlled aggression to peel off a stunning 66-ball hundred. It was the fastest ton in a women’s ODI by an England batter – eclipsing Charlotte Edwards’ 70-ball effort from March 2012 – as the hosts prevailed by a whopping 161 runs to seal a 2-0 series win. Sciver-Brunt holed out for 120 off 74 balls, her third three-figure score in her last four ODI innings, having helped England draw a gripping multi-format Ashes series with back-to-back hundreds in July. “I’m really happy to bat the way I did and continue with what I was doing against Australia as well,” Sciver-Brunt said at the post-match presentation ceremony. Sciver-Brunt was rested from the preceding three T20s between the teams, where England suffered a shock defeat, but the 31-year-old has felt the benefit of some downtime in a hectic summer programme. She has been managing a knee problem for several months and played in this series as a specialist batter but anticipates returning to all-rounder duties on England’s tour of India before Christmas. “The decision not to bowl post-Ashes was more to give the body a bit of a rest,” she said. “I’m looking forward to picking up the ball again. I want to influence games as much as I can. “That’s the best part of being an all-rounder and fielding for 50 overs and not really being able to influence with the ball was a little bit frustrating but I was happy to have the body break for that. “When we play so much cricket through the summer, we probably don’t need to train too many things, just be right in the mind and body and hopefully continue that mindset that I had (in the Ashes).” England were bogged down by Sri Lanka’s spinners in the T20s when batting first and may have feared the worst when Tammy Beaumont and Alice Capsey were dismissed early in a match reduced to 31 overs per side at Grace Road because of rain that led to the start time being pushed back by more than three hours. But Sciver-Brunt exhibited why she is so instrumental, taking on the coterie of off-spinners and slow left-armers, punching with aplomb off the back foot and displaying her full range with fluid drives, pulls, sweeps and one scoop for 18 fours and a single six. Maia Bouchier, featuring in just her third ODI and in her second innings in the format, provided ample support with 95 off only 65 balls. The 24-year-old opener crashed a dozen fours and two sixes in a 193-run stand from just 121 deliveries with Sciver-Brunt. “She’s a fantastic player,” England head coach Jon Lewis said of his stand-in captain. “It’s the calmness she brings – and I thought we saw that in abundance here. The calmness she brought to Maia in a situation when we were 18 for two, she’s come out with an authority.” Sciver-Brunt was the first to three figures but Bouchier could have made sure her team-mate’s record lasted just a few minutes had she dispatched her 65th ball for six, only to be trapped lbw. “I was absolutely gutted for her that she didn’t score a hundred because I know that when she does score a hundred, she’ll score a lot of hundreds,” Lewis added. “She’s incredibly talented.” Sciver-Brunt and Bouchier underpinned a mammoth 273 for eight, a total which would have stretched Sri Lanka in a regulation 50-over game and the tourists were never in contention in the chase. They capitulated to 112 all out in 24.5 overs, as Charlie Dean claimed five for 31, her maiden five-wicket haul for England which the off-spinner recognised was built on Sciver-Brunt’s stunning knock. “She’s the best all-rounder in the world, the best batter,” Dean said. “She brings a lot to the team, she definitely elevates us with her standards alone. “I guess she goes under the radar with her leadership – she’s so calm. We have so many players that can do similar but there’s only one Nat Sciver-Brunt.”","pubDate":"2023-09-14 21:01:21","image_url":"https://www.times-series.co.uk/resources/images/17228972/?type=app&htype=0","source_id":"time_series","source_priority":668753,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"85d9730fe825fa85ea1f4d4e3769bfc7","title":"Nat Sciver-Brunt thrilled to continue Ashes ODI form with record-breaking ton","link":"https://www.echo-news.co.uk/sport/national/23790768.nat-sciver-brunt-thrilled-continue-ashes-odi-form-record-breaking-ton/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The stand-in England captain scored a record-breaking century in her 100th ODI.","content":"On her 100th ODI and captaining the side in the absence of the unwell Heather Knight, Sciver-Brunt demonstrated a masterclass in controlled aggression to peel off a stunning 66-ball hundred. It was the fastest ton in a women’s ODI by an England batter – eclipsing Charlotte Edwards’ 70-ball effort from March 2012 – as the hosts prevailed by a whopping 161 runs to seal a 2-0 series win. Sciver-Brunt holed out for 120 off 74 balls, her third three-figure score in her last four ODI innings, having helped England draw a gripping multi-format Ashes series with back-to-back hundreds in July. “I’m really happy to bat the way I did and continue with what I was doing against Australia as well,” Sciver-Brunt said at the post-match presentation ceremony. Sciver-Brunt was rested from the preceding three T20s between the teams, where England suffered a shock defeat, but the 31-year-old has felt the benefit of some downtime in a hectic summer programme. She has been managing a knee problem for several months and played in this series as a specialist batter but anticipates returning to all-rounder duties on England’s tour of India before Christmas. “The decision not to bowl post-Ashes was more to give the body a bit of a rest,” she said. “I’m looking forward to picking up the ball again. I want to influence games as much as I can. 100th ODI, and playing it in style 🤩 Nat is unstoppable 👏 — England Cricket (@englandcricket) “That’s the best part of being an all-rounder and fielding for 50 overs and not really being able to influence with the ball was a little bit frustrating but I was happy to have the body break for that. “When we play so much cricket through the summer, we probably don’t need to train too many things, just be right in the mind and body and hopefully continue that mindset that I had (in the Ashes).” England were bogged down by Sri Lanka’s spinners in the T20s when batting first and may have feared the worst when Tammy Beaumont and Alice Capsey were dismissed early in a match reduced to 31 overs per side at Grace Road because of rain that led to the start time being pushed back by more than three hours. But Sciver-Brunt exhibited why she is so instrumental, taking on the coterie of off-spinners and slow left-armers, punching with aplomb off the back foot and displaying her full range with fluid drives, pulls, sweeps and one scoop for 18 fours and a single six. Maia Bouchier, featuring in just her third ODI and in her second innings in the format, provided ample support with 95 off only 65 balls. The 24-year-old opener crashed a dozen fours and two sixes in a 193-run stand from just 121 deliveries with Sciver-Brunt. “She’s a fantastic player,” England head coach Jon Lewis said of his stand-in captain. “It’s the calmness she brings – and I thought we saw that in abundance here. The calmness she brought to Maia in a situation when we were 18 for two, she’s come out with an authority.” Sciver-Brunt was the first to three figures but Bouchier could have made sure her team-mate’s record lasted just a few minutes had she dispatched her 65th ball for six, only to be trapped lbw. “I was absolutely gutted for her that she didn’t score a hundred because I know that when she does score a hundred, she’ll score a lot of hundreds,” Lewis added. “She’s incredibly talented.” Sciver-Brunt and Bouchier underpinned a mammoth 273 for eight, a total which would have stretched Sri Lanka in a regulation 50-over game and the tourists were never in contention in the chase. They capitulated to 112 all out in 24.5 overs, as Charlie Dean claimed five for 31, her maiden five-wicket haul for England which the off-spinner recognised was built on Sciver-Brunt’s stunning knock. “She’s the best all-rounder in the world, the best batter,” Dean said. “She brings a lot to the team, she definitely elevates us with her standards alone. “I guess she goes under the radar with her leadership – she’s so calm. We have so many players that can do similar but there’s only one Nat Sciver-Brunt.”","pubDate":"2023-09-14 21:01:21","image_url":"https://www.echo-news.co.uk/resources/images/17228972/?type=app&htype=0","source_id":"echo_uk","source_priority":159993,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"97fc46b48dae60a8c3ad557da209c7d0","title":"England women's cricket: Five things we learned after Ashes success and Sri Lanka disappointment","link":"https://www.newsr.in/n/Sports/1zpnjb1dp4/England-women-cricket-Five-things-we-learned.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"BBC Sport looks at what can be learned from England women's summer. Reported by BBC Sport 13 minutes ago.","content":"Thursday, 14 September 2023 ( 1 hour ago ) BBC Sport looks at what can be learned from England women's summer. 👓 View full article","pubDate":"2023-09-14 20:41:54","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4526349ec8378ef7189f292e1add3993","title":"PAK vs SL, Match Highlights: রুদ্ধশ্বাস ম্যাচে ২ উইকেটে পাকিস্তানকে হারিয়ে এশিয়া কাপের ফাইনালে শ্রীলঙ্কা","link":"https://bengali.abplive.com/sports/cricket/asia-cup-2023-sri-lanka-beat-pakistan-by-2-wickets-against-super-4-full-match-highlights-qualified-for-final-1009093","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: জয়ের জন্য ৪২ ওভারে শ্রীলঙ্কার টার্গেট ছিল ২৫২ রান। ১১ নম্বর বার এশিয়া কাপের ফাইনালে পৌঁছনোর হাতছানি ছিল তাঁদের সামনে। অপরদিকে, পাকিস্তানের সামনে সুযোগ ছিল শ্রীলঙ্কাকে হারিয়ে প্রথমবার ভারত-পাকিস্তান এশিয়া কাপ ফাইনালের। ম্যাচের শেষ বল পর্যন্ত চলে হাড্ডাহাড্ডি লড়াই। তবে শেষমেশ দুই উইকেটে ম্যাচের শেষ বলে রুদ্ধশ্বাস জয় পেল শ্রীলঙ্কা। চরিথ আসালঙ্কা অপরাজিত ৪৯ রানে শ্রীলঙ্কাকে ফাইনালে পৌঁছে দেন। কুশল মেন্ডিস দ্বীপরাষ্ট্রের হয়ে অপরাজিত ৯১ রানের ইনিংস খেলেন।","content":"কলম্বো: জয়ের জন্য ৪২ ওভারে পাকিস্তানের বিরুদ্ধে (PAK vs SL) শ্রীলঙ্কার টার্গেট ছিল ২৫২ রান। ১১ নম্বর বার এশিয়া কাপের (Asia Cup 2023) ফাইনালে পৌঁছনোর হাতছানি ছিল তাঁদের সামনে। অপরদিকে, পাকিস্তানের সামনে সুযোগ ছিল শ্রীলঙ্কাকে হারিয়ে প্রথমবার ভারত-পাকিস্তান এশিয়া কাপ ফাইনালের। ম্যাচের শেষ বল পর্যন্ত চলে হাড্ডাহাড্ডি লড়াই। তবে শেষমেশ দুই উইকেটে ম্যাচের শেষ বলে রুদ্ধশ্বাস জয় পেল শ্রীলঙ্কা। চরিথ আসালঙ্কা (Charith Asalanka) অপরাজিত ৪৯ রানে শ্রীলঙ্কাকে ফাইনালে পৌঁছে দেন। বড় রানের লক্ষ্য তাড়া করতে নেমে এদিন কুশল পেরিরা শ্রীলঙ্কার হয়ে শুরুটা দুরন্তভাবে করেন। তবে শাদাব খানের দুরন্ত ডাইরেক্ট হিটে আট বলে ১৭ রান করেই ফিরতে হয় তাঁকে। ২০ রানে প্রথম উইকেট হারালেও দ্বিতীয় উইকেটে পাথুম নিসাঙ্কা ও কুশল মেন্ডিস (Kusal Mendis) ৫৭ রানের পার্টনারশিপে শ্রীলঙ্কান ইনিংসকে স্থিরতা প্রদান করেন। নিসাঙ্কা ২০ রানে আউট হওয়ার পর সাদিরা সামারাবিক্রমার সঙ্গে মিলে দ্বীপরাষ্ট্রের ইনিংসকে এগিয়ে নিয়ে যান মেন্ডিস। তৃতীয় উইকেটে দুইজনে শতরানের পার্টনারশিপ গড়েন। তবে অর্ধশতরানের দোরগোড়ায় সামারাবিক্রমাকে ফেরান ইফতিকার। শ্রীলঙ্কান মিডল অর্ডার ব্যাটার ৪৮ রানে আউট হন। মেন্ডিস নিজের শতরানের দিকে অগ্রসর হচ্ছিলেন। তবে ৯১ রানে তাঁকেও সাজঘরের রাস্তা দেখান ইফতিকারই। শ্রীলঙ্কার মিডল অর্ডােরে ব্যাটিং ধস নামান ইফতিকার ও শাহিন শাহ আফ্রিদি। দাসুন শানাকা (২), ধনঞ্জয় ডি সিলভা (৫), দুনিথ ওয়ালালাগে (০), প্রমোদ মধুশান (১) সকলেই ব্যাট হাতে ব্যর্থ হন। একে একে ফেরেন সাজঘরে। তবে অপরপ্রান্তে উইকেট পড়লেও, আসালঙ্কা কিন্তু মাথা ঠান্ডা রেখে নিজের কাজটি করে যান। ইনিংসের শেষ বল অবধি ক্রিজে টিকে থাকেন লঙ্কান মিডল অর্ডার ব্যাটার। রুদ্ধশ্বাস ম্যাচের শেষ ওভারের শেষ বলে দলকে কাঙ্খিত জয় এনে দেন তিনি। ঘরের মাঠে রবিবাসরীয় ফাইনালে নিজেদের খেতাব নিজেদেরই দখলে রাখার সুযোগ রয়েছে শ্রীলঙ্কার কাছে। তারা নাগাড়ে দুইবার এশিয়া কাপ জিততে পারে কি না, এবার সেটাই দেখার। তিন উইকেট ও ব্যাট হাতে ৪৭ রান করেও দলকে জেতাতে পারলেন না ইফতিকার। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); হয়ে অপরাজিত ৯১ রানের ইনিংস খেলেন। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে ভারতীয় একাদশে শামির সুযোগ না পাওয়ার আসল কারণ জানালেন বোলিং কোচ মামব্রে var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-14 19:38:44","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/15/0bbe324ef2238873391ef7afdc13b5511694720288975507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"41869efb34619472b8ae27fe2b45a3f0","title":"Woakes hails Stokes as 'superhuman' after record knock","link":"https://thewest.com.au/sport/cricket/woakes-hails-stokes-as-superhuman-after-record-knock-c-11908029","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Teammate Chris Woakes, awed by Ben Stokes' latest record-breaking knock against New Zealand, says the England great has \"superhuman\" skills.","content":"Chris Woakes says Ben Stokes' record-breaking 182 has given England a timely reminder of what they can achieve with his \"superhuman\" skills. Stokes was in rampant form against New Zealand on Wednesday, making the country's highest-ever ODI score in just his third innings since reversing his year-long retirement from the format. With England's World Cup defence less than three weeks away, it was a perfect way for the man who carried them to victory in the 2019 final to prove his sense of occasion once again. Stokes has nothing left to prove on the big stage but watching him bully England's first World Cup opponents with nine sixes and 15 fours sent a wave of energy through the dressing room. England went on to wrap up victory by a huge margin of 181 runs, another reminder that when he is in the side, the whole team walks a little taller. \"We obviously see Ben as this superhuman that can do incredible things. We know he can,\" said Woakes, who picked up the baton with three early wickets in the field. \"It was great for the group and brilliant for Ben too. He's an unbelievable cricketer but coming back into the team having retired, it will do his confidence a world of good. \"We always have doubts and performance anxieties at the best of times, so it's great for his confidence and great for the team's confidence and belief that we can post huge scores. \"It was amazing to be here and play in the game because that was an incredible knock. \"He struck it cleaner than anyone else out there. It just shows how good a player he is.\" Since walking away from 50-over cricket last summer citing workload issues, Stokes has poured his energies into his role as Test captain. Working closely with head coach Brendon McCullum, he has revitalised the red-ball set-up, flipping their fortunes in dramatic fashion and playing out a thrilling drawn Ashes series that gripped the nation. Woakes feels that stepping back into the ranks under Jos Buttler's leadership, and operating as a specialist batter rather than all-action all-rounder, is a good thing for Stokes. \"I think him coming back into this team is probably a refreshing feeling for him, without the captaincy on his shoulders. To run the England Test team is a tough job,\" he said. \"He's probably seen this as a breath of fresh air, to play his natural game and be his natural person, which he always does.\" Sign up for our emails","pubDate":"2023-09-14 18:49:26","image_url":"https://images.thewest.com.au/publication/C-11908029/10bab135c50933cb41f1adfd0efd1ff85524e08c-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"47a089bfaa1c9bee772ab40932fa6702","title":"Problem of plenty is good: Paras Mhambrey","link":"https://economictimes.indiatimes.com/news/sports/problem-of-plenty-is-good-paras-mhambrey/articleshow/103672315.cms","keywords":null,"creator":null,"video_url":null,"description":"\"A problem of plenty is always good, we have four quality bowlers out there, we have great options,\" bowling coach Mhambrey said Thursday of a pace attack led by Jasprit Bumrah and also boasting Mohammed Shami, Mohammed Siraj and Shardul Thakur. There is also all-rounder Hardik Pandya. Ravindra Jadeja, Axar Patel and Kuldeep Yadav hold the spin force.","content":"Synopsis \"A problem of plenty is always good, we have four quality bowlers out there, we have great options,\" bowling coach Mhambrey said Thursday of a pace attack led by Jasprit Bumrah and also boasting Mohammed Shami, Mohammed Siraj and Shardul Thakur. There is also all-rounder Hardik Pandya. Ravindra Jadeja, Axar Patel and Kuldeep Yadav hold the spin force. Paras Mhambrey India face a \"problem of plenty\" in their bowling stocks ahead of Sunday's Asia Cup final and the ODI World Cup starting next month, coach Paras Mhambrey said. \"A problem of plenty is always good, we have four quality bowlers out there, we have great options,\" bowling coach Mhambrey said Thursday of a pace attack led by Jasprit Bumrah and also boasting Mohammed Shami, Mohammed Siraj and Shardul Thakur . There is also all-rounder Hardik Pandya. Ravindra Jadeja, Axar Patel and Kuldeep Yadav hold the spin force. \"The option of choosing the right combination will depend on what surface we are playing and what opponents we are playing,\" he added. Indian players including up-and-coming batsman Tilak Varma and T20 star Suryakumar Yadav trained in the nets on the eve of the team's last Super Four match, against Bangladesh in Colombo on Friday. Mhambrey gave little away about the line-up. \"We haven't decided on what we will do, but obviously there is an opportunity to give a game to other players since we have qualified for the final,\" said the former medium-pace bowler. Bangladesh have won just one match at the Asia Cup, but Mhambrey said: \"Bangladesh is a good team and we will have to play our best cricket.\" Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Print Edition Thursday, 14 Sep, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies ET Markets Learn more about our print edition More Records Tumble as Bulls Lead in Mkt Relief Rally Indian equities touched record levels on Wednesday, with the Nifty ending above 20,000 for the first time, led by gains in bank shares. Small- and micro-cap stocks rebounded from the previous day’s brutal sell-off, as investors temporarily brushed aside concerns over pricey valuations. OfBusiness Shows it Means Business Business-to-business (B2B) ecommerce firm OfBusiness bagged top honours at the ninth edition of India’s most prestigious awards for entrepreneurship — The Economic Times Startup Awards 2023. Apple to Manufacture iPhone 15 Plus in India from Next Quarter Apple will locally produce the iPhone 15 Plus in the next quarter, having successfully started production in India of the lower-priced base model of the series. Read More News on tilak varma suryakumar yadav shardul thakur mohammed siraj jasprit bumrah Paras Mhambrey (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Lesson from Franklin Templeton fiasco: Investors lap up AIFs to mitigate credit risk 8 mins read Green tech A SEED to decarbonise, ESG-linked KRAs: JSW Steel charts a net-zero journey without a target year 9 mins read Under the lens The duping of a Kerala senior citizen could be India’s first deepfake con – the crime of the future 10 mins read Subscribe to ETPrime","pubDate":"2023-09-14 18:15:54","image_url":null,"source_id":"economictimes_indiatimes","source_priority":376,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c96b3d4e161bed1bcea7c24fcf2abb72","title":"Woakes hails ‘superhuman’ Stokes after England star’s record run spree","link":"https://sportstar.thehindu.com/football/international-football/ben-stokes-odi-century-woakes-england-icc-odi-world-cup-2023/article67308947.ece","keywords":null,"creator":null,"video_url":null,"description":"Stokes smashed England’s highest-ever one-day international score on Wednesday in just his third innings since ending his year-long retirement from the format.","content":"Chris Woakes hailed Ben Stokes as “superhuman” after the England batsman’s record-breaking 182 against New Zealand sent out a warning to its title rivals ahead of the World Cup. Stokes smashed England’s highest-ever one-day international score on Wednesday in just his third innings since ending his year-long retirement from the format. With England’s 50-over World Cup defence starting in less than three weeks, it was a perfect way for the man who carried them to victory in the 2019 final to show he remains a match-winning force in the white-ball game. England’s Test captain demolished New Zealand with nine sixes and 15 fours to inspire an 181-run victory ahead of Friday’s series finale at Lord’s. “We obviously see Ben as this superhuman that can do incredible things. We know he can,” Woakes said. “It was great for the group and brilliant for Ben too. He’s an unbelievable cricketer but coming back into the team having retired, it will do his confidence a world of good. “We always have doubts and performance anxieties at the best of times, so it’s great for his confidence and great for the team’s confidence and belief that we can post huge scores. “It was amazing to be here and play in the game because that was an incredible knock. “He struck it cleaner than anyone else out there. It just shows how good a player he is.” Since walking away from 50-over cricket last year citing workload issues, Stokes has revitalised England’s Test team alongside coach Brendon McCullum. The dramatic fightback to draw the Ashes series against Australia earlier this year provided another showcase for his qualities as an inspirational leader. But Woakes feels that stepping back into the ranks under Jos Buttler’s ODI captaincy and operating as a specialist batter rather than an all-action all-rounder, is a good thing for Stokes. “I think him coming back into this team is probably a refreshing feeling for him, without the captaincy on his shoulders. To run the England Test team is a tough job,” he said. “He’s probably seen this as a breath of fresh air, to play his natural game and be his natural person, which he always does. “This group of players who have been around this team for a long time, always feel comfortable when we come back together.” Comments Related Topics","pubDate":"2023-09-14 18:02:03","image_url":null,"source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"8cc1dcd49e0af02ee17836498c605cae","title":"Ashwin praises KL Rahul's remarkable comeback and middle-order mastery in Asia Cup 2023","link":"https://www.newsr.in/n/Sports/1zpnjb1b4u/Ashwin-praises-KL-Rahul-remarkable-comeback-and.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"In a stunning return to international cricket, KL Rahul showcased his immense talent during the Asia Cup Reported by DNA 37 minutes ago.","content":"Thursday, 14 September 2023 ( 1 hour ago ) In a stunning return to international cricket, KL Rahul showcased his immense talent during the Asia Cup 👓 View full article","pubDate":"2023-09-14 17:48:44","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1d46aeaee96cd02cd6dc27fdc1945700","title":"Asia Cup ground staff have the most thankless job. Here's why","link":"https://economictimes.indiatimes.com/news/sports/asia-cup-ground-staff-have-the-most-thankless-job-heres-why/articleshow/103672016.cms","keywords":null,"creator":null,"video_url":null,"description":"For a day's labour, groundskeepers are paid 2,000 Sri Lankan rupees (LKR), which is about 550 Indian rupees.","content":"Synopsis For a day's labour, groundskeepers are paid 2,000 Sri Lankan rupees (LKR), which is about 550 Indian rupees. There is a popular meme that has been doing the rounds of the Internet lately. It features an image of a man sitting in a chair, shoulders sagging, head in his hands. As per the meme, he has the most redundant job in the world: that of a lifeguard at a swimming event at the Olympics. That may well be the most pointless if indeed it exists, but the most thankless job in the world is certainly being a groundskeeper in Sri Lanka . The orange brigade , as they have been nicknamed at the R Premadasa Stadium in Colombo , after the bright tee-shirts they wear, have been rock stars. Around 100 are in deployment at each of the Asia Cup matches, and they have been stretched to breaking point. Playing cricket in Sri Lanka in September is never a great idea, especially if you're hosting matches in Colombo. Hambantota is the driest at this time of the year, but a lack of infrastructure close to the venue - the nearest hotels are approximately 45 minutes away from the ground - ruled that out as an option for this tournament. Dambulla is the next best bet, but the ground was not ready to host international cricket, with some repairs and maintenance being done on the lights. So, Colombo it was, and predictably rain has affected virtually all matches in the Super4 stage. On Thursday, when Sri Lanka took on Pakistan, the rain came just as the toss was about to take place. But, the ground staff were alert and managed to get the entire ground covered in a matter of minutes. The downpour that followed was of Biblical proportions. At one point you could barely see the grandstand at the far end of the ground. At almost no other ground in the world would any cricket have been possible given the ferocity and duration of the precipitation and the volume of water that had fallen. Yet, only five overs a side was lost when play began at 5.15pm. This was possible because the ground staff had covered every square foot of the ground in their inimitable style. Approximately 15 giant rubberised canvas sheets, imported from India, are used at each ground. The staff first protect the pitch. Following this they bring covers to the square and then the outfield. After each set of covers is laid down, the edge is peeled back so the next round fits snugly under, making it impossible for water to seep through. This entire exercise is done like a synchronised dance and each person must know his exact role and perform it without deviation or hesitation. Only after this temporary waterproof seal is in place, the ground staff wait for the rain to stop. Once this happens, they reverse the earlier process, starting from the square, or the 30-yard-circle, pulling the covers towards the ropes so that the water that has pooled is driven out of the ground, where it quickly drains down into underground tanks to be stored for later use. The most incredible thing about the entire ground staff operation is how poorly they are treated. For a day's labour, they are paid 2,000 Sri Lankan rupees (LKR), which is about 550 Indian rupees. For every hour of overtime, they get LKR 200, and this is capped at a maximum of five hours per day. In addition, they get three meals and tea and a snack twice a day. When you consider the fact that the Asia Cup nets each participating nation approximately Rs 120 crore, it's staggering that the men who play such a critical role in ensuring that games are played in the first place and are the best at their profession globally, are paid so little. Fortunately, the Indian team is aware of this situation - as are some other teams - and is likely to make a \"goodwill gesture\" in the form of a one-off financial contribution, at the end of the tournament. That will certainly help the staff, some of whom are only contracted for this tournament and have other jobs, driving a rickshaw, working in a shop or waiting tables at small restaurants, but it does not provide a permanent solution. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Print Edition Thursday, 14 Sep, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies ET Markets Learn more about our print edition More Records Tumble as Bulls Lead in Mkt Relief Rally Indian equities touched record levels on Wednesday, with the Nifty ending above 20,000 for the first time, led by gains in bank shares. Small- and micro-cap stocks rebounded from the previous day’s brutal sell-off, as investors temporarily brushed aside concerns over pricey valuations. OfBusiness Shows it Means Business Business-to-business (B2B) ecommerce firm OfBusiness bagged top honours at the ninth edition of India’s most prestigious awards for entrepreneurship — The Economic Times Startup Awards 2023. Apple to Manufacture iPhone 15 Plus in India from Next Quarter Apple will locally produce the iPhone 15 Plus in the next quarter, having successfully started production in India of the lower-priced base model of the series. Read More News on orange brigade Cricket Ground asia cup sri lanka colombo ground staff (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Lesson from Franklin Templeton fiasco: Investors lap up AIFs to mitigate credit risk 8 mins read Green tech A SEED to decarbonise, ESG-linked KRAs: JSW Steel charts a net-zero journey without a target year 9 mins read Under the lens The duping of a Kerala senior citizen could be India’s first deepfake con – the crime of the future 10 mins read Subscribe to ETPrime","pubDate":"2023-09-14 17:48:42","image_url":null,"source_id":"economictimes_indiatimes","source_priority":376,"country":["india"],"category":["sports"],"language":"english"}]}