{"newsArray":[{"article_id":"a8ecfdcd8df6ca73126ad952c7f4d9aa","title":"Gus Atkinson has enjoyed a rapid rise to England call-up after changing his run-up and increasing his pace to 95mph... now fast bowler is confident he can deliver at the World Cup","link":"https://www.dailymail.co.uk/sport/cricket/article-12474087/Gus-Atkinson-enjoyed-rapid-rise-England-call-changing-run-increasing-pace-95mph-fast-bowler-confident-deliver-World-Cup.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Figures of four for 20 at Old Trafford were the best figures ever by an England bowler on T20 debut and helped England to a 2-0 series lead against New Zealand,","content":"Gus Atkinson has enjoyed a rapid rise to England call-up after changing his run-up and increasing his pace to 95mph... now fast bowler is confident he can deliver at the World Cup Gus Atkinson enjoyed a dream England debut against New Zealand He recorded the best figures ever by an England bowler on T20 debut His second delivery, bowled at 92mph, beat Devon Conway for pace By Aadam Patel For The Mail On Sunday Updated: 20:40 BST, 2 September 2023 e-mail 1 View comments As far as debuts go, Gus Atkinson’s first England appearance could hardly have gone any better. Figures of four for 20 at Old Trafford were the best figures ever by an England bowler on T20 debut and helped England to a 2-0 series lead against New Zealand, ahead of the third T20 at Edgbaston on Sunday. ‘Yeah, that was perfect,’ the 25-year-old said. ‘I can’t ask for much more than that. I’m very happy.’ His Surrey bowling coach, Azhar Mahmood, says he knew once Atkinson broke into the Surrey team as a regular, he was ready to play for England across formats. Injuries plagued Atkinson since signing as a professional in 2017 but last year, with a changed run-up and increased pace, everything clicked. Gus Atkinson enjoyed a dream England T20 debut by taking four for 20 at Old Trafford ‘When we saw him last year, it was clear Gus had the ability to make it for England across all formats. It was then a case of consistency and fitness. We picked him in the ILT20 and the PSL and worked with him throughout the year,’ says Mahmood. At the toss on Friday, Jos Buttler said Atkinson had ‘pace to burn’. He knew first-hand after facing him for the first time in The Hundred, when he clocked 95mph against Buttler. Atkinson had made his statement. Post-match, Buttler had a conversation with Mahmood. A week later, Atkinson was named in England’s World Cup squad, as revealed by Mail Sport. He was already on England’s radar but perhaps that evening in south London was confirmation. ‘Jos asked about Gus. He was really impressed that night. It was a conversation about how Gus had developed his abilities,’ says Mahmood. Those who know Atkinson speak of an introvert but someone who knows that he possesses a special talent. His second delivery against New Zealand, bowled at 92mph, beat Devon Conway for pace. Two balls later, he had his maiden wicket removing Conway with a 90mph delivery but there were no ecstatic celebrations. Just a little smile. ‘One of my friends said: ‘You never know, we might get a smile out of you when you get your first (England) wicket.’ So I was thinking about that when I got my wicket but I was very happy inside,’ revealed Atkinson after. Though outwardly reserved, the inner confidence has always been there. In an Instagram video on the Oval Invincibles channel, the dressing room were asked what they would be if they weren’t cricketers, Atkinson’s responded that he would ‘probably be a model’. The rise to an England call-up has come quick but it is no surprise for him. His second delivery against New Zealand, bowled at 92mph, beat Devon Conway for pace ‘I knew that once I got going, it could happen quick,’ said Atkinson. ‘I’ve always known my ability and what I can do and I knew once I had the chance with games… The Hundred’s a big opportunity. I knew if I could perform in that, then it would happen quickly.’ His smooth action has seen him earn comparisons to Jofra Archer and his England teammate Jonny Bairstow sang Atkinson’s praises. ‘You look at when Jofra came on the scene and how quickly he was elevated through…we know that pace is the one thing that's a rare commodity and can be devastating when you get it right. I think that's going to be the first cap of a few, definitely in this format and I'm sure in a few others as well,’ said Bairstow. On the basis of his debut, it will be a case of no Jofra, no problem for England in India. In Atkinson, alongside Mark Wood, England will truly have pace to burn during their World Cup defence. Share or comment on this article: Gus Atkinson has enjoyed a rapid rise to England call-up after changing his run-up and increasing his pace to 95mph... now fast bowler is confident he can deliver at the World Cup e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-02 19:40:42","image_url":"https://i.dailymail.co.uk/1s/2023/09/02/20/74996475-0-image-m-17_1693682533256.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d50a4614955dd5a80642768df44a73cd","title":"Finals form guide: Will Collingwood stand up when it matters most?","link":"https://www.brisbanetimes.com.au/sport/afl/finals-form-guide-will-collingwood-stand-up-when-it-matters-most-20230828-p5dzvq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Marc McGowan, Jon Pierik and Andrew Wu"],"video_url":null,"description":"It’s the business end of the season with eight clubs fighting for glory. Our reporters analyse each club’s chances and delve into the stats where they rule and where they can improve. Which players will light up September?","content":"It’s the business end of the season. Eight teams remain in the hunt for AFL premiership glory. We analyse their flag chances, dig into the stats of where each club rules on the field and where they can improve, and nominate the players who are set to light up September. 1. Collingwood Injury list: Darcy Moore (hamstring) and Nathan Murphy (back/glute/hip) are expected to return for the Pies’ qualifying final clash with Melbourne, but Nick Daicos (knee) will almost certainly need at least one more week’s recovery. Skippr Darcy Moore leads the Magpies up the race at the MCG. Credit: AFL Photos Room for improvement: It’s all about Collingwood’s defence. They strangled the life out of a horribly out-of-sorts Essendon , but before that, conceded 124 points, 101, 105 and 93 – three of those four games resulting in defeats. No other club conceded more in that period, so Craig McRae will need his troops to revert to their stingy ways from the rest of the season. Moore and Murphy returning is a great start, but it won’t solve everything. Watch out for: Nick Daicos’ incredible season has, at times, meant Jordan De Goey somehow goes under the radar, but he put together a stellar campaign, too – and is every bit as important to Collingwood’s success. De Goey is a genuine match winner, averaging career highs in disposals (23.9), inside 50s (5.1) and clearances (5.4), as well as being close in a number of other metrics. Flag chances: The Magpies proved last year their game style holds up in big finals, and they almost made it to the grand final. They have been better again in 2023, and not much should be read into their late-season form. That said, the qualifying final result will be significant either way for their premiership hopes. - Marc McGowan 2. Brisbane Lions Injury list: Jack Gunston (knee) hopes to return later in September; Daniel Rich (hamstring) may miss the qualifying final; and Lincoln McCarthy (calf) should be fit. Trademark celebration: Charlie Cameron hopes to rev his motorbike engine in a deep September run. Credit: Getty Images/Stphen Kiprillis Room for improvement: Chris Fagan insists his team is as well-prepared as ever to enjoy September glory, and it’s hard to argue against that given they are stocked with talent across the three spheres of the field. However, while they may have two finals at home, their 1-14 recent record at the MCG is a concern. They should have finished off the Demons at the ’G last month. However, in September, there won’t be a second chance. Loading Watch out for: Charlie Cameron. The dynamic mid-sized forward is the Lions’ leading goal-kicker, and has created havoc in recent finals, booting seven goals in three games last season, and eight goals in two in 2021. This campaign is unlikely to be any different. That key talls Joe Daniher and Eric Hipwood have been in good touch could help Cameron find even more space. Flag chances: As is the case for the Power, the time is nigh for this group to deliver. Fagan has rebuilt this side over seven seasons, and it should be emboldened having endured September heartache for four seasons. The likes of Lachie Neale, Josh Dunkley, Harris Andrews, Daniher et al. are at the peak of their powers. - Jon Pierik 3. Port Adelaide Injury list: Charlie Dixon (foot) and Trent McKenzie (knee) are both a good chance to be available for the qualifying final, while coach Ken Hinkley confirmed Todd Marshall (hip) would be fine after being a late withdrawal last Sunday. Ruckman Scott Lycett (knee) returned in the SANFL at the weekend. Room for improvement: The Power have succeeded despite being beaten – sometimes badly – in contested possession in six of the past seven rounds. The great Richmond sides under Damien Hardwick were similar in the home-and-away season, but improved in that area in the finals. Port’s finals fate might rest on the same. Zak Butters is the only Power player in the top 50 for contested possessions per game in 2023. Zak Butters was named the AFLCA’s Champion Player of the Year in a standout home and away season for the Power. Credit: AFL Photos Watch out for: Butters, Connor Rozee and Ollie Wines will have huge roles to play in September, but Dixon might be the difference-maker. The 32-year-old power forward took six contested marks in his most recent match in round 20 before missing the past month with injury. A fit-and-firing Dixon gives Port Adelaide a more menacing look in attack, and his presence means Marshall, Jeremy Finlayson and potentially Ollie Lord (if he keeps his spot) can deal with lesser defenders, too. Flag chances: So much depends on whether the Power can become the first team this season to beat the Lions at the Gabba. If they can, Port will earn a home preliminary final and be favoured to make the grand final. They have a star-studded midfield group and dangerous (and tall) forward line. - Marc McGowan 4. Melbourne Injury list: The Demons have lost Jake Melksham (ACL), but Bayley Fritsch (sore foot) is expected to play. Michael Hibberd (concussion protocols) will need to prove his fitness. Room for improvement: The Demons have won seven of their past eight games, and head into September well-placed. They boast and elite midfield and defence, but the major question revolves around who replaces mid-sized forward Melksham. He has been a key figure over the past two months. Will there be a temptation to go tall and recall Brodie Grundy? The premiership is this way: Christian Petracca will have a major role in the Demons’ September quest. Credit: AFL Photos Watch out for: It’s hard to go past the bull that is Christian Petracca. Yes, Clayton Oliver, Max Gawn and Jack Viney are gold-plated stars, but Petracca has the ability to turn a contest in the blink of an eye on the ball, and when drifting forward. Remember, he was the 2021 Norm Smith medallist. Flag chances: The Magpies finished on top of the ladder, but the Demons are legitimate premiership aspirants. They have all bases covered, particularly since adopting a more attacking style. It will be no shock if they reprise their King’s Birthday upset and edge the Magpies on Thursday night. - Jon Pierik 5. Carlton Injury list: Patrick Cripps and Sam Docherty are both available after missing the final round with soreness. Blake Acres has been cleared of a broken collarbone but must pass a fitness test next week. Jack Silvagni (knee) won’t be ready. Matt Kennedy will struggle to break into the 22 after a long lay-off. Room for improvement: Miserly for much of their nine-game winning streak, the Blues’ defence broke down for long stretches in the final fortnight. Two of their four highest scores conceded this year have come in that time. It was alarming how often the Giants were able to break through their grid. The system worked well for months, and the personnel remains the same, so perhaps it’s just a matter of attention to detail. The clearance game has also dropped off, though a refreshed Patrick Cripps and the returns of Adam Cerra and Sam Walsh, both with a game under their belt, will provide a lift. Charlie Curnow is now a two-time Coleman medallist. Credit: Getty Images Watch out for: Charlie Curnow was born for the big stage. In his eighth season, he belatedly gets his chance. No player lifts the energy of his team, and their fans, more than the back-to-back Coleman Medal winner. A generational talent, Curnow is ready to take over from Lance Franklin as the game’s great entertainer. A big September might take the Blues deep – and get him close to the ton. Flag chances: Anything is possible if Curnow, Cripps, Walsh and co all have the month of their lives, but it’s difficult to see the Blues winning four finals on the bounce in their first September campaign in 10 years. Teams will not relish facing the Blues, provided they get past perennial finalists Sydney in week one. Whatever they achieve will be a stepping stone for the years to come. - Andrew Wu 6. St Kilda Injury list: Veteran midfielder Seb Ross (hamstring) is on track to play in the Saints’ elimination final against GWS, according to assistant coach Lenny Hayes. Josh Battle and Anthony Caminiti (both concussion) are also set to be available, but Dougal Howard (wrist) appears unlikely. Room for improvement: St Kilda are the league’s stingiest defence under Ross Lyon, but they have struggled to score from clearances (ranked 17th) and inside 50s (18th). The extended injury absences of forwards Max King and Tim Membrey offer a genuine excuse for those offensive woes. Both will play in September, so the Saints should be more potent. Max King looms as a potential finals match-winner for the Saints. Credit: AFL Photos Watch out for: King is the biggest star at St Kilda and the player most capable of ripping a match apart. The 202-centimetre target needs supply, but he transforms the Saints’ attack when he is there, and will be cherry ripe after sitting out the final round. King might not even have to worry about All-Australian defender Sam Taylor, who is racing the clock to be fit. Flag chances: The Saints will need to head interstate in the second week of the finals to face the loser of the clash between Brisbane and Port Adelaide, if they survive the in-form Giants. Winning four matches in September is brutally tough, but others have proven it is not impossible. - Marc McGowan 7. Greater Western Sydney Injury list: Sam Taylor (hamstring) was a titanic pre-game loss before last Sunday’s win over Carlton, and coach Adam Kingsley tipped he would be “touch and go” for their elimination final against St Kilda – and a match-up with Max King. Finn Callaghan (Achilles) and Xavier O’Halloran (thumb) have been out for weeks but could be in the selection mix for the Saints clash. Room for improvement: The Giants are moving the ball well, typically still strong in the contest and mostly out-tackling their opposition, but only one team is worse than them for conceding points from centre clearances. That would be an area of concern for Kingsley entering the finals, especially knowing games can be won or lost in a scoring binge while one side has momentum. A structural or positional tweak might be necessary to stem the bleeding. Former Giants skipper Stephen Coniglio is back to his brilliant best. Credit: AFL Photos Watch out for: Stephen Coniglio is all the way back to his brilliant best – a revival that started last year and is now complete, including 28 disposals and 2.2 in his 200th game last weekend. Injuries and potentially the weight of the captaincy wore Coniglio down, but free of both, his experience, class and dash will all be vital to the Giants’ September chances. Flag chances: If Carlton’s second-half resurgence makes them one of the finals dark horses, then GWS must be considered in a similar bracket. They have stars on every line, are hunting in numbers, and are irrepressible when they are up and going, like the second half on Sunday. - Marc McGowan 8. Sydney Injury list: Tom Papley was at 90 per cent with his hamstring last week, so with the additional 12 days, he should be ready. Wingman Justin McInerney (calf) will also be some chance to return. Room for improvement: It will be an early exit if they cannot lift their clearance game. Ranked 15th for scores from clearances, the Swans face the competition’s best at scoring from this source. They can struggle against big-bodied midfielders but were every bit as good as Melbourne in this area for three quarters in a strong finals dress rehearsal. Watch out for: Once the Robin to Lance Franklin’s Batman, Isaac Heeney now has the path cleared for him to be the Swans’ superhero. Though down on his All-Australian 2022, Heeney’s second half of the season has been much better with 20 goals from his past 10 games. As a senior player in a young forward line, Heeney must step up and lead the way. Flag chances: If John Longmire’s men can win four finals on the road, this will be a premiership for the ages – but it won’t happen. They are strong enough to win a final or two if Luke Parker, Callum Mills and Chad Warner can muscle up in the middle to provide an extra layer of protection for their undermanned defence, and Papley and Heeney can get active forward. - Andrew Wu Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Carlton Blues Collingwood Magpies Melbourne Demons Brisbane Lions St Kilda Saints More… Marc McGowan is a sports reporter for The Age Connect via Twitter . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-02 19:30:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"b081b02d08d843a2619ff1b6cf0493d5","title":"He kicked 640 goals but his retirement might be greater: Entertainers and activists among these AFL influencers","link":"https://www.brisbanetimes.com.au/sport/afl/he-kicked-640-goals-but-his-retirement-might-be-greater-entertainers-and-activists-among-these-afl-influencers-20230831-p5e0ya.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Chloe Saltau"],"video_url":null,"description":"Leading into AFL finals and the start of the AFLW season, we have chosen the top 50 people who will influence footy over the next decade. Here are numbers 20-11.","content":"Footy is changing. League supremo Gillon McLachlan will ride into the sunset the day after the AFL grand final. The men’s finals series will feature a galaxy of emerging stars. The AFLW season will showcase a generation of women who are shaking up the footy landscape. Behind the scenes, there is a new establishment making decisions, making their voices heard and influencing what the game will look like, on and off the field, towards 2030. It’s a good time to ask, who are the people who will shape the game over the next decade? We asked a panel of experts from The Age , Nine’s Wide World of Sports and the Sydney Morning Herald to answer this question to come up with the top 50 AFL influencers. The criteria: The panel of 10 judges was asked to select people who influence how the AFL and AFLW are played, watched, understood, coached and commercialised. These are people who are either making a difference now, or who will change football in a meaningful way over the next decade. They could be players, coaches, administrators, commissioners, agents, club bosses, politicians, businesspeople, lawyers, or media people (the judges were not permitted to select themselves or other journalists). Who has the power to bring about change? Who is doing the big commercial deals? Who has a booming profile among younger fans? Who is making a difference to the way Indigenous people in footy are treated? Is there a line coach who is changing an aspect of the game? An AFLW figure changing the way women’s footy is played, perceived or run? Unashamedly, we were striving for diversity in our list. Our top 50 will no doubt provoke arguments. You can have your say on contentious inclusions or omissions, or ask our chief football writer Jake Niall a question about the selections by leaving a comment on this article. How the judging worked: Each judge picked their own top 20, with votes apportioned in reverse order. So, No.20 was given one vote and No.19 two votes, and so on. From there, we compiled the top 50 based on total votes. We’re publishing 10 names every day, culminating with the top 10 on Monday, September 4. In her short time as North Melbourne president Sonja Hood has already enhanced her reputation as a respected businesswoman. The signing of four-time premiership coach Alastair Clarkson was seen as a huge coup for the club. The next step will be to guide the club through a successful on-field period. Hood has worked on her performance in the media and is active on social media. She is a strong advocate for women in the industry having hired the league’s second ever club CEO in Jen Watt. Her battle with breast cancer, and her willingness to speak publicly about it, has helped to inspire other females. - Nat Yoannidis Alastair Clarkson with North Melbourne president Sonja Hood. Credit: Getty Images The CEO of Foxtel secured a landmark broadcast and streaming deal with the AFL until the end of 2031. From 2025, Fox Footy will produce and broadcast all nine games using their talent and are no longer required to use the Channel Seven feed for some of the games. Additionally, Fox Footy will shape the broadcast experience for the fans watching at home or online by adding panel and debate shows around the games. - Kane Cornes The Bulldogs youngster has endured a tough few years since being selected as the overall No.1 draft pick, but made his biggest impact on the competition this year, both with a breakout season as a key forward, and when he spoke out against racial abuse. Ugle-Hagan ensured that he would be remembered for years to come when he emulated Nicky Winmar’s iconic anti-racism stance from 1993 after being attacked in the opening rounds of the season. He handled the entire saga with brilliant poise and spoke eloquently, and is likely to be one of the more prominent Indigenous voices in the game over the next decade. - Chris De Silva Jamarra Ugle-Hagan took a stand against racist abuse. Credit: Getty Images Concussion could be the single biggest issue facing the league over the next decade. As general counsel, Stephen Meade will help determine how the organisation navigates the legal ramifications associated with head knocks. The number of confirmed cases of CTE has already meant protecting the head is a high priority. This will amplify over the next 10 years as former players come forward with lawsuits against the league and its clubs. While Meade’s role is strictly behind the scenes, his leadership and advice will shape the laws of the game as the AFL moves to protect its players and image. - Nat Yoannidis Michael Christian has been the match review officer since 2018, and so long as he remains in that position he will continue to help shape the game. As concern surrounding head knocks and concussion grows, the role of the MRO in stamping out unwanted actions will evolve. The rules of the game often come down to individual interpretation and his decisions help shape our understanding of them. The former Collingwood star and media personality will continue to play an important role in determining what is within the rules of the game and what isn’t. - Nat Yoannidis SEN boss Hutchison is already one of the most recognisable media moguls in the game. His role in the media gives him a voice, while his 24-7 sports radio network contributes to the saturation coverage of football. Hutchison’s bold move to poach Gerard Whateley from the ABC took the veteran broadcaster to a different audience. His company, which has a voracious appetite for sporting rights, also owns the AFL Record, and he has helped commercialise the burgeoning player movement space through SEN’s trade radio. What sets the SEN brand apart is the move into sport ownership. The company owns NBL side the Perth Wildcats and Super Netball’s newest franchise. Hutchison also hosts the popular Sounding Board podcast with fellow journalist Damien Barrett. - Nat Yoannidis Craig Hutchison on Nine’s Footy Classified with Matthew Lloyd. Credit: Nine Eddie was one of footy’s greatest entertainers and now, as one of only a few Indigenous voices in the mainstream media, his voice is strong. Having a platform on Fox Footy gives him the opportunity to speak on Indigenous issue across the game through his life experience when they arise. With racial comments directed at players weekly through social media, it’s important to hear from Indigenous voices on how to combat this but also how to stand up and be proud. He is one of the greats of our game, but it’s the impact in retirement that will bring meaningful change. - Mathew Stokes Eddie Betts is one of the great entertainers. Credit: Getty Images McRae is often credited with reshaping Collingwood into a belief-driven side with a “winners-only” mentality after helping them charge up the ladder in his first year at the helm – a rise which has continued this season. As one of the largest and oldest clubs in the league, this is impactful in itself but also has ripple effects. Other clubs are watching closely and taking note. He’s brought a new-found positivity to the craft of coaching, allowing and encouraging his players to be themselves, and presenting an honest version of himself to the media. McRae, part of the great Brisbane Lions dynasty of the early 2000s, is also a big advocate for the so-called theatre of football – and that significantly impacts how fans engage with the sport. - Marnie Vinall Craig McRae with Jordan De Goey. Credit: Getty Images The AFL is surely as big as it’s ever going to be in the “heartland” states, so the league’s growth over the next decade is going to come from the north – and there is no state with more room to grow than NSW . Swans boss Tom Harley. Credit: AFL Media / Getty Images Tom Harley is a Sydney transplant but has been leading the Swans for so long – and so well – that it feels as if he’s part of the furniture. Whether he will continue to lead the AFL’s flagship club in Australia’s biggest city, or whether he moves to headquarters for an even bigger role, having previously been interviewed as a candidate to replace Gillon McLachlan and mentioned as a potential head of football, there is little doubt that, at 45, Harley’s prime years as an administrator are ahead of him. - Vince Rugari Tanya Hosch is the first Indigenous person and the second woman appointed to an executive position in the AFL. Inclusion, acceptance and racism are key issues in the AFL and Hosch is the ideal person to hold the role. With her long and distinguished history in Aboriginal and Torres Strait Islander policy, she is working to rid the game of racism and make it an inclusive and safe environment for players, officials and supporters. But influence transcends footy. As an advocate of an Indigenous Voice to parliament, Hosch gave a deeply personal speech in which she revealed she had recently had part of her lower leg amputated because of a condition related to type 2 diabetes. While not without privilege, she said she was a human example of the system that let First Nations people down. - Anna Pavlou Tanya Hosch rises from her wheelchair to speak. Credit: Sarah Reed Come back on Monday to find out who made the top 10. Click here for 50-41 Click here for 40-31 Click here for 30-21. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers Gillon McLachlan Alastair Clarkson Chloe Saltau is Sports Editor of The Age and a former chief cricket writer Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-02 19:00:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"05b82742c5e38c275d5cdf56ceed8ba7","title":"Virat Kohli’s Picture With Babar Azam, Shadab Khan and Other Pakistan Players Goes Viral After Rain Washes Out IND vs PAK Asia Cup 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/virat-kohlis-picture-with-babar-azam-shadab-khan-and-other-pakistan-players-goes-viral-after-rain-washes-out-ind-vs-pak-asia-cup-2023-match-5384026.html","keywords":null,"creator":null,"video_url":null,"description":"The star Indian cricketer was seen with the Pakistan cricketers after the match as they all shared a laugh together at the end of the match, which was called off due to rain. Pakistan qualified for the Super Four stage after this contest while India need a win over Nepal to make it through to the next round.","content":"Virat Kohli shared a laugh with the Pakistan players after the India vs Pakistan match in Asia Cup 2023 was washed out by rain in Kandy on September 2. The star player was seen catching up with Babar Azam, Shadab Khan, Haris Rauf and other Pakistan cricketers after the match was called off at the Pallekele International Cricket Stadium and this picture has gone viral on social media. India scored 266 runs in the first innings, with Hardik Pandya and Ishan Kishan scoring 87 and 82 runs respectively. No play was possible in the second innings. When is India vs Pakistan Next Match in Asia Cup 2023? Check Date, Time and Venue of Possible IND vs PAK Cricket Match. See Viral Pic Here: Picture of the day from Pallekele. - Virat Kohli is the favorite for everyone. pic.twitter.com/hbfDXuMcnK — Johns. (@CricCrazyJohns) September 2, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-09-02 18:48:42","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6c984aae3e844201abf451e72d7664c8","title":"Asia Cup 2023: How can India still qualify for Super Fours after Ind vs Pak match wash out?","link":"https://www.dnaindia.com/cricket/report-asia-cup-2023-how-can-india-qualify-for-super-fours-after-ind-vs-pak-match-wash-out-3058576","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"India will play their second match in the group round against Nepal on Monday, September 4.","content":"Asia Cup 2023: The Asia Cup match between India and Pakistan in Sri Lanka on Saturday was called off due to persistent rain. India earned one point from their first match in the tournament against Pakistan in the group stage. The team are placed second in Group A. The men in blue will play their second match in the group round against Nepal on Monday, September 4. Now the question is how can Team India qualify for Super Fours after IND vs PAK match is washed out? The Rohit Sharma-led squad cannot afford to lose their second game against Nepal. The duo will clash in international cricket for the first time. A win for either side can take them to the Asia Cup Super 4s round. If India win by a big margin, they can even finish first in the Group A points table. If the India vs Nepal match in Asia Cup 2023 is abandoned due to rain, then India will qualify for the Super 4s. They will finish the group stage with two points while Nepal will only have one point to their name. Three scenarios for Team India to qualify for the Super Four in the Asia Cup Scenario 1: If India beat Nepal, then it will definitely qualify for the Super Four. India will then be level on three points with Pakistan and the two teams will progress to the next round. Scenario 2: If India lose to Nepal, then the latter will qualify for the Super Four. Scenario 3: If India vs Nepal is washed out, then India will still qualify for the Super Four. India will have two points in that case. READ | Asia Cup 2023: IND vs PAK match called off after rain plays spoilsport, Pakistan reach Super 4 stage In the India vs Pakistan match on Saturday, no play was possible after India made 266 in 48.5 overs. Ishan Kishan (82) and Hardik Pandya (87) revived India's innings with a 138-run stand off 141 balls after losing the first four wickets for 66 runs. Shaheen Afridi was the stand-out bowler for Pakistan, ending with figures of four for 35 in 10 overs. India posted 266 all out in 48.5 overs in the first innings.","pubDate":"2023-09-02 18:41:00","image_url":null,"source_id":"dnaindia","source_priority":18388,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d00238dfd10dfd6d0580fa13066e15ee","title":"WATCH: 'Ram Siya Ram' song plays during India-Pakistan Asia Cup clash in Kandy, video goes viral","link":"https://www.indiatvnews.com/sports/cricket/watch-ram-siya-ram-song-plays-during-india-pakistan-asia-cup-clash-in-kandy-video-goes-viral-2023-09-03-890472","keywords":null,"creator":null,"video_url":null,"description":"It was a disappointing affair at Pallekele International Cricket Stadium in Kandy as incessant rain relented, to deny a result in the highly-anticipated clash between India and Pakistan on Saturday, September 2. The match was setting up to be a thriller with 267 probably going to be a tricky chase given the overcast conditions, however, it wasn't to be as the heavens opened up for the fourth time in the game after the 9 PM local time inspection and this time rather decisively.","content":"It was a disappointing affair at Pallekele International Cricket Stadium in Kandy as incessant rain relented, to deny a result in the highly-anticipated clash between India and Pakistan on Saturday, September 2. The match was setting up to be a thriller with 267 probably going to be a tricky chase given the overcast conditions, however, it wasn't to be as the heavens opened up for the fourth time in the game after the 9 PM local time inspection and this time rather decisively. The viewers and the local crowd didn't get to watch the full game, however, they did see some exciting cricket in the first innings with the Indian batters and Pakistani bowlers both having their moment. Earlier, the Pakistani pacers dominated the first part of the Indian innings reducing the Men in Blue to 66/4. None of the top-order batters had answers to Shaheen Afridi's swing and Haris Rauf played his part well with the wickets of Shreyas Iyer and later on. Ishan Kishan playing at No. 5 for the first time and , who likes batting against Pakistan performed the rescue job for their side to the T. Both balanced caution with aggression as they didn't let any loose balls go and played the ball to merit without curbing their natural instincts. The partnership had just completed a century during the 33rd over when an unusual sighting happened during the game. A song from the Bollywood film 'Adipurush', 'Ram Siya Ram' was played by the DJ in Kandy and the Indian fans couldn't believe that it actually happened. Pakistan have confirmed their spot in the Super Fours and hence will be travelling back to Lahore for their final game, which will be in the next round on September 6. For India, they have to beat Nepal to confirm their spot, who are coming off a loss against Pakistan in the tournament opener.","pubDate":"2023-09-02 18:37:21","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1efddc103ae1681a4127550c5a750ad0","title":"'Bahot Saare Padosiyon Ke TV Bach Gaye Aaj’ Irfan Pathan Shares Sarcastic Tweet As Rain Washes Out IND vs PAK Asia Cup 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/bahot-saare-padosiyon-ke-tv-bach-gaye-aaj-irfan-pathan-shares-sarcastic-tweet-as-rain-washes-out-ind-vs-pak-asia-cup-2023-match-5383977.html","keywords":null,"creator":null,"video_url":null,"description":"The India vs Pakistan match in Asia Cup 2023 had an unfortunate end with rain eventually washing out the contest and both teams sharing points. India had scored 266 after choosing to bat at the Pallekele International Cricket Stadium.","content":"Irfan Pathan took to social media to share a sarcastic reaction as rain washed out the India vs Pakistan match in Kandy on Saturday, September 2. The match could only have its first innings with India scoring 266, riding on impressive performances from Ishan Kishan and Hardik Pandya. But there was no play possible in the second innings at all with the downpour lashing the stadium, which was under covers for a good period of time before the match was called off. Irfan, alluding to the fact that India could have won the match had the second innings taken place, wrote this on X, formerly Twitter. \"Bahot saare Padosiyon ke TV bach gaye aaj;)\" For the uninitiated, the former India fast bowler alluded to the previous reports of Pakistan fans breaking their TV sets after they were beaten by India in cricket matches. Ex-PCB Chief Najam Sethi Slams Asian Cricket Council Over Selection of Sri Lanka As Asia Cup 2023 Venue As IND vs PAK Match Is Called Off Due to Rain in Kandy. See Irfan Pathan's Tweet Bahot saare Padosiyon ke TV bach gaye aaj;) — Irfan Pathan (@IrfanPathan) September 2, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-09-02 18:32:44","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"445c48d72c62fa7d72e5c5ea3dffeb98","title":"India vs Nepal Asia Cup 2023 Weather Forecast: Latest update on Pallekele weather on Monday","link":"https://www.indiatvnews.com/sports/cricket/india-vs-nepal-asia-cup-2023-weather-forecast-latest-update-on-pallekele-kandy-weather-on-monday-weather-report-2023-09-03-890464","keywords":null,"creator":null,"video_url":null,"description":"India had to settle for a point after their opening Asia Cup 2023 game against Pakistan at Pallekele International Cricket Stadium was washed away due to rain on Saturday, September 2. India next face Nepal and need to avoid a defeat to qualify for the Super 4 round. But once again, rain is threatening India's game as the latest weather forecast for the Nepal game suggests considerable chances of precipitation.","content":"India had to settle for a point after their opening Asia Cup 2023 game against Pakistan at Pallekele International Cricket Stadium was washed away due to rain on Saturday, September 2. India next face Nepal and need to avoid a defeat to qualify for the Super 4 round. But once again, rain is threatening India's game as the latest weather forecast for the Nepal game suggests considerable chances of precipitation. Rain has been threatening matches in Sri Lanka and it is playing a big spoilsport for the hopeful fans. The first game at Pallekele also witnessed rain interruption and rain in the India vs Pakistan game suggests a similar weather forecast for the India vs Nepal game. The current Palleke weather (On Sunday) suggests an almost 60% chance of rain on Monday morning, so fans can witness a wet outfield. However, the chances of rain at the time of the toss (2:30 PM IST) are 22% and will remain the same till 6 PM. The chances of rain increase up to 66% in the second half of the game, suggesting another half-game for India, However, if rain washes out India's next game against Nepal, the -led side will automatically qualify for the Super 4 round with two points from the Group A fixtures. Rohit Sharma (c), , , Shreyas Iyer, Ishan Kishan (wk), , , Shardul Thakur, , , , Mohammed Siraj, Axar Patel, Suryakumar Yadav, Prasidh Krishna, Tilak Varma, (Ruled out due to injury) Kushal Bhurtel, Aasif Sheikh (wk), Bhim Sharki, Rohit Paudel (c), Kushal Malla, Dipendra Singh Airee, Gulsan Jha, Sompal Kami, Karan KC, Sandeep Lamichhane, Lalit Rajbanshi, Sundeep Jora, Pratis GC, Arjun Saud, Mousom Dhakal, Kishore Mahato, Aarif Sheikh","pubDate":"2023-09-02 18:31:02","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a8a3e6cc302bc0d8660c1c3eae523fe5","title":"“Way he controlled his pace, length was outstanding”: England’s Gus Atkinson wins acclaim for four-fer on T20I debut","link":"https://thenewsmill.com/2023/09/way-he-controlled-his-pace-length-was-outstanding-englands-gus-atkinson-wins-acclaim-for-four-fer-on-t20i-debut/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"England pacer Gus Atkinson, who took a four-wicket haul on debut during the second T20I against New Zealand, has received praise from pundits for his remarkable performance on debut. Half-centuries from Jonny Bairstow and Harry Brook and a four-fer by Atkinson helped England go up 2-0 in the four-match series after a 95-run win. Atkinson’s figures of 4/20 are the best-ever figures by an England men’s player on his T20I debut. Sky Sports experts Simon Doull and legendary Sri Lankan Kumar Sangakkara were full of praise for the bowler. Sangakkara lauded him for controlling his pace and length well. “It was incredible the way he went about his work. Sometimes you can get carried away with just the new-ball performance but it was an all-round performance. The way he controlled his length and pace was outstanding,” said the legendary cricketer according to Sky Sports. Doull also lauded the bowler for cleaning up the tail, something which he felt is important in T20 cricket. “He cleaned up the tail, which is so vital in T20 cricket. He found a nice line and length early on, did not get too full.” “He did not try and swing the ball, he just wanted a little bit cross-seam and control. The odd one nipped around but he did not want to get too carried away,” he added. Ahead of the match, legendary cricketer Michael Atherton had said that he is similar to England’s senior pace spearhead Jofra Archer. “Atkinson has eye-catching pace. He bowled an unbelievably fast spell against Buttler in The Hundred [for Oval Invincibles against Manchester Originals],” said Atherton. “I think his game has gone up a level this year. He feels confident in his body at last having gone through many injuries as a young player and is bowling quicker than before.” “I think there are similarities with Archer. A beautiful wrist action and in tight to the stumps,” he concluded. After the match, Jonny Bairstow, the ‘Player of the Match’ who scored 86 off just 60 balls and stayed unbeaten to guide England to 198/4, lauded the pacer and said that his performance will serve as a huge confidence boost for him. “We know the raw pace he has got, which is scary for any opposition. For him to take four wickets on debut will be a huge confidence boost. There is pressure on when you debut but you could see from his face how he handled that, he took everything in his stride,” said Bairstow. “We have no doubts it will be the first of many caps, in many other formats, too,” he added. England skipper Jos Buttler said that the bowler has been on an upward curve very quickly. “He has been on an upward curve very quickly. To get him in and around international cricket, in the dressing room, making friendships, getting used to the guys and the coaching staff takes time, so you need to accelerate that. He has settled in brilliantly,” he said. Coming to the match, electing to bat first, England posted 198/4 in their 20 overs. After Will Jacks (19) and Dawid Malan (0) lost their wickets early, leaving England at 43/2, a 131-run partnership between Jonny Bairstow (86 in 60 balls, eight fours and four sixes) and Harry Brook (67 in 36 balls with five fours and five sixes) helped England come back in the match and post a big total. Ish Sodhi (2/44) was the pick of the bowlers for NZ. Mitchell Santner and Tim Southee took a wicket each. Chasing 199, NZ lost wickets at regular intervals. Tim Seifert (39 in 31 balls, four boundaries), Glenn Phillips (22 in 17 balls, with three balls) and Mark Chapman (15 in eight balls, with one four and six) were the only ones to touch two figures. Atkinson (4/20) was the pick of the bowlers for England. Adil Rashid took two wickets for 18 balls. Sam Curran, Brydon Carse, Liam Livingstone and Will Jacks took a wicket each. (ANI)","pubDate":"2023-09-02 18:30:18","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f9f172fb70881792d7963ded76075bce","title":"IND vs PAK: Gautam Gambhir Slams Virat Kohli After Shaheen Afridi Dismissal, Calls Him 'Casual'","link":"https://zeenews.india.com/cricket/ind-vs-pak-asia-cup-2023-gautam-gambhir-slams-virat-kohli-after-shaheen-afridi-dismissal-calls-him-casual-2657043.html","keywords":null,"creator":null,"video_url":null,"description":"Partnership between Ishan Kishan (82 in 81 balls, with nine fours and two sixes) and Hardik Pandya (87 in 90 balls with seven fours and a six) helped India cross 200 runs.","content":"Former India cricketer Gautam Gambhir slammed star batter Virat Kohli for his shot selection during the India vs Pakistan clash in the ongoing Asia Cup clash at Kandy in Sri Lanka. He called Kohli 'casual' for his performance against Pakistan and Shaheen Afridi. In the match against Pakistan at Kandy, Virat started off with his signature cover drive and it looked like he would play another brilliant knock against the arch-rivals. But he was soon dismissed by Shaheen Shah Afridi, whose delivery hit the stumps after an inside edge from Kohli's willow. Virat was out for just four runs in seven balls. Gambhir did not mince his words in his criticism of Virat, saying that the shot played by him was a \"nothing shot\". (Watch: 'Ram Siya Ram' Song Played During India vs Pakistan Clash In Kandy, Video Goes Viral) \"That was a nothing shot, neither forward, neither back. I think was a bit casual. That is what you get when you play someone like Shaheen Afridi. You do not know whether to go forward or back,\" Gambhir said in commentary on Star Sports. Pakistan's legendary bowler Waqr Younis however felt Virat was unlucky. \"Kohli was a touch unlucky. Inside edge, the ball did not come on to the bat and maybe even kept a bit low. But credit to Shaheen Shah Afridi for altering his length,\" he said. Matthew Hayden, the legendary Australian opener seemed to agree with Hayden. \"Yeah, inside edge onto the stumps, could have got anywhere,\" he said. The group stage match between India and Pakistan has been called off due to rain, with both teams sharing one point each. With this, Pakistan has secured a total of three points in two matches. They had got two points previously after winning their first match against Nepal. They have qualified for the Super Four stage. India has one point now and they must beat Nepal in their next match on September 4 to move to the Super Four stage. Coming to the match, India elected to bat first and posted 266/10 in 48.5 overs. India struggled to take on the pace duo of Shaheen and Haris Rauf, with Shaheen getting skipper Rohit Sharma (11) and Virat Kohli (4) and Haris getting Shreyas Iyer (14) and Shubman Gill (10). India was reduced to 66/4. Then a 138-run partnership between Ishan Kishan (82 in 81 balls, with nine fours and two sixes) and Hardik Pandya (87 in 90 balls with seven fours and a six) helped India cross 200 runs. Then, contributions from Ravindra Jadeja (14) and Jasprit Bumrah (16) helped India cross the 250-run mark. Shaheen (4/35) was the pick of the bowlers for Pakistan. Naseem Shah (3/36) and Haris Rauf (3/58) also bowled well for Pakistan. (With ANI inputs)","pubDate":"2023-09-02 18:24:00","image_url":null,"source_id":"zeenews","source_priority":5319,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a8ecfdcd8df6ca73126ad952c7f4d9aa","title":"Gus Atkinson has enjoyed a rapid rise to England call-up after changing his run-up and increasing his pace to 95mph... now fast bowler is confident he can deliver at the World Cup","link":"https://www.dailymail.co.uk/sport/cricket/article-12474087/Gus-Atkinson-enjoyed-rapid-rise-England-call-changing-run-increasing-pace-95mph-fast-bowler-confident-deliver-World-Cup.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Figures of four for 20 at Old Trafford were the best figures ever by an England bowler on T20 debut and helped England to a 2-0 series lead against New Zealand,","content":"Gus Atkinson has enjoyed a rapid rise to England call-up after changing his run-up and increasing his pace to 95mph... now fast bowler is confident he can deliver at the World Cup Gus Atkinson enjoyed a dream England debut against New Zealand He recorded the best figures ever by an England bowler on T20 debut His second delivery, bowled at 92mph, beat Devon Conway for pace By Aadam Patel For The Mail On Sunday Updated: 20:40 BST, 2 September 2023 e-mail 1 View comments As far as debuts go, Gus Atkinson’s first England appearance could hardly have gone any better. Figures of four for 20 at Old Trafford were the best figures ever by an England bowler on T20 debut and helped England to a 2-0 series lead against New Zealand, ahead of the third T20 at Edgbaston on Sunday. ‘Yeah, that was perfect,’ the 25-year-old said. ‘I can’t ask for much more than that. I’m very happy.’ His Surrey bowling coach, Azhar Mahmood, says he knew once Atkinson broke into the Surrey team as a regular, he was ready to play for England across formats. Injuries plagued Atkinson since signing as a professional in 2017 but last year, with a changed run-up and increased pace, everything clicked. Gus Atkinson enjoyed a dream England T20 debut by taking four for 20 at Old Trafford ‘When we saw him last year, it was clear Gus had the ability to make it for England across all formats. It was then a case of consistency and fitness. We picked him in the ILT20 and the PSL and worked with him throughout the year,’ says Mahmood. At the toss on Friday, Jos Buttler said Atkinson had ‘pace to burn’. He knew first-hand after facing him for the first time in The Hundred, when he clocked 95mph against Buttler. Atkinson had made his statement. Post-match, Buttler had a conversation with Mahmood. A week later, Atkinson was named in England’s World Cup squad, as revealed by Mail Sport. He was already on England’s radar but perhaps that evening in south London was confirmation. ‘Jos asked about Gus. He was really impressed that night. It was a conversation about how Gus had developed his abilities,’ says Mahmood. Those who know Atkinson speak of an introvert but someone who knows that he possesses a special talent. His second delivery against New Zealand, bowled at 92mph, beat Devon Conway for pace. Two balls later, he had his maiden wicket removing Conway with a 90mph delivery but there were no ecstatic celebrations. Just a little smile. ‘One of my friends said: ‘You never know, we might get a smile out of you when you get your first (England) wicket.’ So I was thinking about that when I got my wicket but I was very happy inside,’ revealed Atkinson after. Though outwardly reserved, the inner confidence has always been there. In an Instagram video on the Oval Invincibles channel, the dressing room were asked what they would be if they weren’t cricketers, Atkinson’s responded that he would ‘probably be a model’. The rise to an England call-up has come quick but it is no surprise for him. His second delivery against New Zealand, bowled at 92mph, beat Devon Conway for pace ‘I knew that once I got going, it could happen quick,’ said Atkinson. ‘I’ve always known my ability and what I can do and I knew once I had the chance with games… The Hundred’s a big opportunity. I knew if I could perform in that, then it would happen quickly.’ His smooth action has seen him earn comparisons to Jofra Archer and his England teammate Jonny Bairstow sang Atkinson’s praises. ‘You look at when Jofra came on the scene and how quickly he was elevated through…we know that pace is the one thing that's a rare commodity and can be devastating when you get it right. I think that's going to be the first cap of a few, definitely in this format and I'm sure in a few others as well,’ said Bairstow. On the basis of his debut, it will be a case of no Jofra, no problem for England in India. In Atkinson, alongside Mark Wood, England will truly have pace to burn during their World Cup defence. Share or comment on this article: Gus Atkinson has enjoyed a rapid rise to England call-up after changing his run-up and increasing his pace to 95mph... now fast bowler is confident he can deliver at the World Cup e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-02 19:40:42","image_url":"https://i.dailymail.co.uk/1s/2023/09/02/20/74996475-0-image-m-17_1693682533256.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d50a4614955dd5a80642768df44a73cd","title":"Finals form guide: Will Collingwood stand up when it matters most?","link":"https://www.brisbanetimes.com.au/sport/afl/finals-form-guide-will-collingwood-stand-up-when-it-matters-most-20230828-p5dzvq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Marc McGowan, Jon Pierik and Andrew Wu"],"video_url":null,"description":"It’s the business end of the season with eight clubs fighting for glory. Our reporters analyse each club’s chances and delve into the stats where they rule and where they can improve. Which players will light up September?","content":"It’s the business end of the season. Eight teams remain in the hunt for AFL premiership glory. We analyse their flag chances, dig into the stats of where each club rules on the field and where they can improve, and nominate the players who are set to light up September. 1. Collingwood Injury list: Darcy Moore (hamstring) and Nathan Murphy (back/glute/hip) are expected to return for the Pies’ qualifying final clash with Melbourne, but Nick Daicos (knee) will almost certainly need at least one more week’s recovery. Skippr Darcy Moore leads the Magpies up the race at the MCG. Credit: AFL Photos Room for improvement: It’s all about Collingwood’s defence. They strangled the life out of a horribly out-of-sorts Essendon , but before that, conceded 124 points, 101, 105 and 93 – three of those four games resulting in defeats. No other club conceded more in that period, so Craig McRae will need his troops to revert to their stingy ways from the rest of the season. Moore and Murphy returning is a great start, but it won’t solve everything. Watch out for: Nick Daicos’ incredible season has, at times, meant Jordan De Goey somehow goes under the radar, but he put together a stellar campaign, too – and is every bit as important to Collingwood’s success. De Goey is a genuine match winner, averaging career highs in disposals (23.9), inside 50s (5.1) and clearances (5.4), as well as being close in a number of other metrics. Flag chances: The Magpies proved last year their game style holds up in big finals, and they almost made it to the grand final. They have been better again in 2023, and not much should be read into their late-season form. That said, the qualifying final result will be significant either way for their premiership hopes. - Marc McGowan 2. Brisbane Lions Injury list: Jack Gunston (knee) hopes to return later in September; Daniel Rich (hamstring) may miss the qualifying final; and Lincoln McCarthy (calf) should be fit. Trademark celebration: Charlie Cameron hopes to rev his motorbike engine in a deep September run. Credit: Getty Images/Stphen Kiprillis Room for improvement: Chris Fagan insists his team is as well-prepared as ever to enjoy September glory, and it’s hard to argue against that given they are stocked with talent across the three spheres of the field. However, while they may have two finals at home, their 1-14 recent record at the MCG is a concern. They should have finished off the Demons at the ’G last month. However, in September, there won’t be a second chance. Loading Watch out for: Charlie Cameron. The dynamic mid-sized forward is the Lions’ leading goal-kicker, and has created havoc in recent finals, booting seven goals in three games last season, and eight goals in two in 2021. This campaign is unlikely to be any different. That key talls Joe Daniher and Eric Hipwood have been in good touch could help Cameron find even more space. Flag chances: As is the case for the Power, the time is nigh for this group to deliver. Fagan has rebuilt this side over seven seasons, and it should be emboldened having endured September heartache for four seasons. The likes of Lachie Neale, Josh Dunkley, Harris Andrews, Daniher et al. are at the peak of their powers. - Jon Pierik 3. Port Adelaide Injury list: Charlie Dixon (foot) and Trent McKenzie (knee) are both a good chance to be available for the qualifying final, while coach Ken Hinkley confirmed Todd Marshall (hip) would be fine after being a late withdrawal last Sunday. Ruckman Scott Lycett (knee) returned in the SANFL at the weekend. Room for improvement: The Power have succeeded despite being beaten – sometimes badly – in contested possession in six of the past seven rounds. The great Richmond sides under Damien Hardwick were similar in the home-and-away season, but improved in that area in the finals. Port’s finals fate might rest on the same. Zak Butters is the only Power player in the top 50 for contested possessions per game in 2023. Zak Butters was named the AFLCA’s Champion Player of the Year in a standout home and away season for the Power. Credit: AFL Photos Watch out for: Butters, Connor Rozee and Ollie Wines will have huge roles to play in September, but Dixon might be the difference-maker. The 32-year-old power forward took six contested marks in his most recent match in round 20 before missing the past month with injury. A fit-and-firing Dixon gives Port Adelaide a more menacing look in attack, and his presence means Marshall, Jeremy Finlayson and potentially Ollie Lord (if he keeps his spot) can deal with lesser defenders, too. Flag chances: So much depends on whether the Power can become the first team this season to beat the Lions at the Gabba. If they can, Port will earn a home preliminary final and be favoured to make the grand final. They have a star-studded midfield group and dangerous (and tall) forward line. - Marc McGowan 4. Melbourne Injury list: The Demons have lost Jake Melksham (ACL), but Bayley Fritsch (sore foot) is expected to play. Michael Hibberd (concussion protocols) will need to prove his fitness. Room for improvement: The Demons have won seven of their past eight games, and head into September well-placed. They boast and elite midfield and defence, but the major question revolves around who replaces mid-sized forward Melksham. He has been a key figure over the past two months. Will there be a temptation to go tall and recall Brodie Grundy? The premiership is this way: Christian Petracca will have a major role in the Demons’ September quest. Credit: AFL Photos Watch out for: It’s hard to go past the bull that is Christian Petracca. Yes, Clayton Oliver, Max Gawn and Jack Viney are gold-plated stars, but Petracca has the ability to turn a contest in the blink of an eye on the ball, and when drifting forward. Remember, he was the 2021 Norm Smith medallist. Flag chances: The Magpies finished on top of the ladder, but the Demons are legitimate premiership aspirants. They have all bases covered, particularly since adopting a more attacking style. It will be no shock if they reprise their King’s Birthday upset and edge the Magpies on Thursday night. - Jon Pierik 5. Carlton Injury list: Patrick Cripps and Sam Docherty are both available after missing the final round with soreness. Blake Acres has been cleared of a broken collarbone but must pass a fitness test next week. Jack Silvagni (knee) won’t be ready. Matt Kennedy will struggle to break into the 22 after a long lay-off. Room for improvement: Miserly for much of their nine-game winning streak, the Blues’ defence broke down for long stretches in the final fortnight. Two of their four highest scores conceded this year have come in that time. It was alarming how often the Giants were able to break through their grid. The system worked well for months, and the personnel remains the same, so perhaps it’s just a matter of attention to detail. The clearance game has also dropped off, though a refreshed Patrick Cripps and the returns of Adam Cerra and Sam Walsh, both with a game under their belt, will provide a lift. Charlie Curnow is now a two-time Coleman medallist. Credit: Getty Images Watch out for: Charlie Curnow was born for the big stage. In his eighth season, he belatedly gets his chance. No player lifts the energy of his team, and their fans, more than the back-to-back Coleman Medal winner. A generational talent, Curnow is ready to take over from Lance Franklin as the game’s great entertainer. A big September might take the Blues deep – and get him close to the ton. Flag chances: Anything is possible if Curnow, Cripps, Walsh and co all have the month of their lives, but it’s difficult to see the Blues winning four finals on the bounce in their first September campaign in 10 years. Teams will not relish facing the Blues, provided they get past perennial finalists Sydney in week one. Whatever they achieve will be a stepping stone for the years to come. - Andrew Wu 6. St Kilda Injury list: Veteran midfielder Seb Ross (hamstring) is on track to play in the Saints’ elimination final against GWS, according to assistant coach Lenny Hayes. Josh Battle and Anthony Caminiti (both concussion) are also set to be available, but Dougal Howard (wrist) appears unlikely. Room for improvement: St Kilda are the league’s stingiest defence under Ross Lyon, but they have struggled to score from clearances (ranked 17th) and inside 50s (18th). The extended injury absences of forwards Max King and Tim Membrey offer a genuine excuse for those offensive woes. Both will play in September, so the Saints should be more potent. Max King looms as a potential finals match-winner for the Saints. Credit: AFL Photos Watch out for: King is the biggest star at St Kilda and the player most capable of ripping a match apart. The 202-centimetre target needs supply, but he transforms the Saints’ attack when he is there, and will be cherry ripe after sitting out the final round. King might not even have to worry about All-Australian defender Sam Taylor, who is racing the clock to be fit. Flag chances: The Saints will need to head interstate in the second week of the finals to face the loser of the clash between Brisbane and Port Adelaide, if they survive the in-form Giants. Winning four matches in September is brutally tough, but others have proven it is not impossible. - Marc McGowan 7. Greater Western Sydney Injury list: Sam Taylor (hamstring) was a titanic pre-game loss before last Sunday’s win over Carlton, and coach Adam Kingsley tipped he would be “touch and go” for their elimination final against St Kilda – and a match-up with Max King. Finn Callaghan (Achilles) and Xavier O’Halloran (thumb) have been out for weeks but could be in the selection mix for the Saints clash. Room for improvement: The Giants are moving the ball well, typically still strong in the contest and mostly out-tackling their opposition, but only one team is worse than them for conceding points from centre clearances. That would be an area of concern for Kingsley entering the finals, especially knowing games can be won or lost in a scoring binge while one side has momentum. A structural or positional tweak might be necessary to stem the bleeding. Former Giants skipper Stephen Coniglio is back to his brilliant best. Credit: AFL Photos Watch out for: Stephen Coniglio is all the way back to his brilliant best – a revival that started last year and is now complete, including 28 disposals and 2.2 in his 200th game last weekend. Injuries and potentially the weight of the captaincy wore Coniglio down, but free of both, his experience, class and dash will all be vital to the Giants’ September chances. Flag chances: If Carlton’s second-half resurgence makes them one of the finals dark horses, then GWS must be considered in a similar bracket. They have stars on every line, are hunting in numbers, and are irrepressible when they are up and going, like the second half on Sunday. - Marc McGowan 8. Sydney Injury list: Tom Papley was at 90 per cent with his hamstring last week, so with the additional 12 days, he should be ready. Wingman Justin McInerney (calf) will also be some chance to return. Room for improvement: It will be an early exit if they cannot lift their clearance game. Ranked 15th for scores from clearances, the Swans face the competition’s best at scoring from this source. They can struggle against big-bodied midfielders but were every bit as good as Melbourne in this area for three quarters in a strong finals dress rehearsal. Watch out for: Once the Robin to Lance Franklin’s Batman, Isaac Heeney now has the path cleared for him to be the Swans’ superhero. Though down on his All-Australian 2022, Heeney’s second half of the season has been much better with 20 goals from his past 10 games. As a senior player in a young forward line, Heeney must step up and lead the way. Flag chances: If John Longmire’s men can win four finals on the road, this will be a premiership for the ages – but it won’t happen. They are strong enough to win a final or two if Luke Parker, Callum Mills and Chad Warner can muscle up in the middle to provide an extra layer of protection for their undermanned defence, and Papley and Heeney can get active forward. - Andrew Wu Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Carlton Blues Collingwood Magpies Melbourne Demons Brisbane Lions St Kilda Saints More… Marc McGowan is a sports reporter for The Age Connect via Twitter . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-02 19:30:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"b081b02d08d843a2619ff1b6cf0493d5","title":"He kicked 640 goals but his retirement might be greater: Entertainers and activists among these AFL influencers","link":"https://www.brisbanetimes.com.au/sport/afl/he-kicked-640-goals-but-his-retirement-might-be-greater-entertainers-and-activists-among-these-afl-influencers-20230831-p5e0ya.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Chloe Saltau"],"video_url":null,"description":"Leading into AFL finals and the start of the AFLW season, we have chosen the top 50 people who will influence footy over the next decade. Here are numbers 20-11.","content":"Footy is changing. League supremo Gillon McLachlan will ride into the sunset the day after the AFL grand final. The men’s finals series will feature a galaxy of emerging stars. The AFLW season will showcase a generation of women who are shaking up the footy landscape. Behind the scenes, there is a new establishment making decisions, making their voices heard and influencing what the game will look like, on and off the field, towards 2030. It’s a good time to ask, who are the people who will shape the game over the next decade? We asked a panel of experts from The Age , Nine’s Wide World of Sports and the Sydney Morning Herald to answer this question to come up with the top 50 AFL influencers. The criteria: The panel of 10 judges was asked to select people who influence how the AFL and AFLW are played, watched, understood, coached and commercialised. These are people who are either making a difference now, or who will change football in a meaningful way over the next decade. They could be players, coaches, administrators, commissioners, agents, club bosses, politicians, businesspeople, lawyers, or media people (the judges were not permitted to select themselves or other journalists). Who has the power to bring about change? Who is doing the big commercial deals? Who has a booming profile among younger fans? Who is making a difference to the way Indigenous people in footy are treated? Is there a line coach who is changing an aspect of the game? An AFLW figure changing the way women’s footy is played, perceived or run? Unashamedly, we were striving for diversity in our list. Our top 50 will no doubt provoke arguments. You can have your say on contentious inclusions or omissions, or ask our chief football writer Jake Niall a question about the selections by leaving a comment on this article. How the judging worked: Each judge picked their own top 20, with votes apportioned in reverse order. So, No.20 was given one vote and No.19 two votes, and so on. From there, we compiled the top 50 based on total votes. We’re publishing 10 names every day, culminating with the top 10 on Monday, September 4. In her short time as North Melbourne president Sonja Hood has already enhanced her reputation as a respected businesswoman. The signing of four-time premiership coach Alastair Clarkson was seen as a huge coup for the club. The next step will be to guide the club through a successful on-field period. Hood has worked on her performance in the media and is active on social media. She is a strong advocate for women in the industry having hired the league’s second ever club CEO in Jen Watt. Her battle with breast cancer, and her willingness to speak publicly about it, has helped to inspire other females. - Nat Yoannidis Alastair Clarkson with North Melbourne president Sonja Hood. Credit: Getty Images The CEO of Foxtel secured a landmark broadcast and streaming deal with the AFL until the end of 2031. From 2025, Fox Footy will produce and broadcast all nine games using their talent and are no longer required to use the Channel Seven feed for some of the games. Additionally, Fox Footy will shape the broadcast experience for the fans watching at home or online by adding panel and debate shows around the games. - Kane Cornes The Bulldogs youngster has endured a tough few years since being selected as the overall No.1 draft pick, but made his biggest impact on the competition this year, both with a breakout season as a key forward, and when he spoke out against racial abuse. Ugle-Hagan ensured that he would be remembered for years to come when he emulated Nicky Winmar’s iconic anti-racism stance from 1993 after being attacked in the opening rounds of the season. He handled the entire saga with brilliant poise and spoke eloquently, and is likely to be one of the more prominent Indigenous voices in the game over the next decade. - Chris De Silva Jamarra Ugle-Hagan took a stand against racist abuse. Credit: Getty Images Concussion could be the single biggest issue facing the league over the next decade. As general counsel, Stephen Meade will help determine how the organisation navigates the legal ramifications associated with head knocks. The number of confirmed cases of CTE has already meant protecting the head is a high priority. This will amplify over the next 10 years as former players come forward with lawsuits against the league and its clubs. While Meade’s role is strictly behind the scenes, his leadership and advice will shape the laws of the game as the AFL moves to protect its players and image. - Nat Yoannidis Michael Christian has been the match review officer since 2018, and so long as he remains in that position he will continue to help shape the game. As concern surrounding head knocks and concussion grows, the role of the MRO in stamping out unwanted actions will evolve. The rules of the game often come down to individual interpretation and his decisions help shape our understanding of them. The former Collingwood star and media personality will continue to play an important role in determining what is within the rules of the game and what isn’t. - Nat Yoannidis SEN boss Hutchison is already one of the most recognisable media moguls in the game. His role in the media gives him a voice, while his 24-7 sports radio network contributes to the saturation coverage of football. Hutchison’s bold move to poach Gerard Whateley from the ABC took the veteran broadcaster to a different audience. His company, which has a voracious appetite for sporting rights, also owns the AFL Record, and he has helped commercialise the burgeoning player movement space through SEN’s trade radio. What sets the SEN brand apart is the move into sport ownership. The company owns NBL side the Perth Wildcats and Super Netball’s newest franchise. Hutchison also hosts the popular Sounding Board podcast with fellow journalist Damien Barrett. - Nat Yoannidis Craig Hutchison on Nine’s Footy Classified with Matthew Lloyd. Credit: Nine Eddie was one of footy’s greatest entertainers and now, as one of only a few Indigenous voices in the mainstream media, his voice is strong. Having a platform on Fox Footy gives him the opportunity to speak on Indigenous issue across the game through his life experience when they arise. With racial comments directed at players weekly through social media, it’s important to hear from Indigenous voices on how to combat this but also how to stand up and be proud. He is one of the greats of our game, but it’s the impact in retirement that will bring meaningful change. - Mathew Stokes Eddie Betts is one of the great entertainers. Credit: Getty Images McRae is often credited with reshaping Collingwood into a belief-driven side with a “winners-only” mentality after helping them charge up the ladder in his first year at the helm – a rise which has continued this season. As one of the largest and oldest clubs in the league, this is impactful in itself but also has ripple effects. Other clubs are watching closely and taking note. He’s brought a new-found positivity to the craft of coaching, allowing and encouraging his players to be themselves, and presenting an honest version of himself to the media. McRae, part of the great Brisbane Lions dynasty of the early 2000s, is also a big advocate for the so-called theatre of football – and that significantly impacts how fans engage with the sport. - Marnie Vinall Craig McRae with Jordan De Goey. Credit: Getty Images The AFL is surely as big as it’s ever going to be in the “heartland” states, so the league’s growth over the next decade is going to come from the north – and there is no state with more room to grow than NSW . Swans boss Tom Harley. Credit: AFL Media / Getty Images Tom Harley is a Sydney transplant but has been leading the Swans for so long – and so well – that it feels as if he’s part of the furniture. Whether he will continue to lead the AFL’s flagship club in Australia’s biggest city, or whether he moves to headquarters for an even bigger role, having previously been interviewed as a candidate to replace Gillon McLachlan and mentioned as a potential head of football, there is little doubt that, at 45, Harley’s prime years as an administrator are ahead of him. - Vince Rugari Tanya Hosch is the first Indigenous person and the second woman appointed to an executive position in the AFL. Inclusion, acceptance and racism are key issues in the AFL and Hosch is the ideal person to hold the role. With her long and distinguished history in Aboriginal and Torres Strait Islander policy, she is working to rid the game of racism and make it an inclusive and safe environment for players, officials and supporters. But influence transcends footy. As an advocate of an Indigenous Voice to parliament, Hosch gave a deeply personal speech in which she revealed she had recently had part of her lower leg amputated because of a condition related to type 2 diabetes. While not without privilege, she said she was a human example of the system that let First Nations people down. - Anna Pavlou Tanya Hosch rises from her wheelchair to speak. Credit: Sarah Reed Come back on Monday to find out who made the top 10. Click here for 50-41 Click here for 40-31 Click here for 30-21. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers Gillon McLachlan Alastair Clarkson Chloe Saltau is Sports Editor of The Age and a former chief cricket writer Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-02 19:00:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"05b82742c5e38c275d5cdf56ceed8ba7","title":"Virat Kohli’s Picture With Babar Azam, Shadab Khan and Other Pakistan Players Goes Viral After Rain Washes Out IND vs PAK Asia Cup 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/virat-kohlis-picture-with-babar-azam-shadab-khan-and-other-pakistan-players-goes-viral-after-rain-washes-out-ind-vs-pak-asia-cup-2023-match-5384026.html","keywords":null,"creator":null,"video_url":null,"description":"The star Indian cricketer was seen with the Pakistan cricketers after the match as they all shared a laugh together at the end of the match, which was called off due to rain. Pakistan qualified for the Super Four stage after this contest while India need a win over Nepal to make it through to the next round.","content":"Virat Kohli shared a laugh with the Pakistan players after the India vs Pakistan match in Asia Cup 2023 was washed out by rain in Kandy on September 2. The star player was seen catching up with Babar Azam, Shadab Khan, Haris Rauf and other Pakistan cricketers after the match was called off at the Pallekele International Cricket Stadium and this picture has gone viral on social media. India scored 266 runs in the first innings, with Hardik Pandya and Ishan Kishan scoring 87 and 82 runs respectively. No play was possible in the second innings. When is India vs Pakistan Next Match in Asia Cup 2023? Check Date, Time and Venue of Possible IND vs PAK Cricket Match. See Viral Pic Here: Picture of the day from Pallekele. - Virat Kohli is the favorite for everyone. pic.twitter.com/hbfDXuMcnK — Johns. (@CricCrazyJohns) September 2, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-09-02 18:48:42","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6c984aae3e844201abf451e72d7664c8","title":"Asia Cup 2023: How can India still qualify for Super Fours after Ind vs Pak match wash out?","link":"https://www.dnaindia.com/cricket/report-asia-cup-2023-how-can-india-qualify-for-super-fours-after-ind-vs-pak-match-wash-out-3058576","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"India will play their second match in the group round against Nepal on Monday, September 4.","content":"Asia Cup 2023: The Asia Cup match between India and Pakistan in Sri Lanka on Saturday was called off due to persistent rain. India earned one point from their first match in the tournament against Pakistan in the group stage. The team are placed second in Group A. The men in blue will play their second match in the group round against Nepal on Monday, September 4. Now the question is how can Team India qualify for Super Fours after IND vs PAK match is washed out? The Rohit Sharma-led squad cannot afford to lose their second game against Nepal. The duo will clash in international cricket for the first time. A win for either side can take them to the Asia Cup Super 4s round. If India win by a big margin, they can even finish first in the Group A points table. If the India vs Nepal match in Asia Cup 2023 is abandoned due to rain, then India will qualify for the Super 4s. They will finish the group stage with two points while Nepal will only have one point to their name. Three scenarios for Team India to qualify for the Super Four in the Asia Cup Scenario 1: If India beat Nepal, then it will definitely qualify for the Super Four. India will then be level on three points with Pakistan and the two teams will progress to the next round. Scenario 2: If India lose to Nepal, then the latter will qualify for the Super Four. Scenario 3: If India vs Nepal is washed out, then India will still qualify for the Super Four. India will have two points in that case. READ | Asia Cup 2023: IND vs PAK match called off after rain plays spoilsport, Pakistan reach Super 4 stage In the India vs Pakistan match on Saturday, no play was possible after India made 266 in 48.5 overs. Ishan Kishan (82) and Hardik Pandya (87) revived India's innings with a 138-run stand off 141 balls after losing the first four wickets for 66 runs. Shaheen Afridi was the stand-out bowler for Pakistan, ending with figures of four for 35 in 10 overs. India posted 266 all out in 48.5 overs in the first innings.","pubDate":"2023-09-02 18:41:00","image_url":null,"source_id":"dnaindia","source_priority":18388,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d00238dfd10dfd6d0580fa13066e15ee","title":"WATCH: 'Ram Siya Ram' song plays during India-Pakistan Asia Cup clash in Kandy, video goes viral","link":"https://www.indiatvnews.com/sports/cricket/watch-ram-siya-ram-song-plays-during-india-pakistan-asia-cup-clash-in-kandy-video-goes-viral-2023-09-03-890472","keywords":null,"creator":null,"video_url":null,"description":"It was a disappointing affair at Pallekele International Cricket Stadium in Kandy as incessant rain relented, to deny a result in the highly-anticipated clash between India and Pakistan on Saturday, September 2. The match was setting up to be a thriller with 267 probably going to be a tricky chase given the overcast conditions, however, it wasn't to be as the heavens opened up for the fourth time in the game after the 9 PM local time inspection and this time rather decisively.","content":"It was a disappointing affair at Pallekele International Cricket Stadium in Kandy as incessant rain relented, to deny a result in the highly-anticipated clash between India and Pakistan on Saturday, September 2. The match was setting up to be a thriller with 267 probably going to be a tricky chase given the overcast conditions, however, it wasn't to be as the heavens opened up for the fourth time in the game after the 9 PM local time inspection and this time rather decisively. The viewers and the local crowd didn't get to watch the full game, however, they did see some exciting cricket in the first innings with the Indian batters and Pakistani bowlers both having their moment. Earlier, the Pakistani pacers dominated the first part of the Indian innings reducing the Men in Blue to 66/4. None of the top-order batters had answers to Shaheen Afridi's swing and Haris Rauf played his part well with the wickets of Shreyas Iyer and later on. Ishan Kishan playing at No. 5 for the first time and , who likes batting against Pakistan performed the rescue job for their side to the T. Both balanced caution with aggression as they didn't let any loose balls go and played the ball to merit without curbing their natural instincts. The partnership had just completed a century during the 33rd over when an unusual sighting happened during the game. A song from the Bollywood film 'Adipurush', 'Ram Siya Ram' was played by the DJ in Kandy and the Indian fans couldn't believe that it actually happened. Pakistan have confirmed their spot in the Super Fours and hence will be travelling back to Lahore for their final game, which will be in the next round on September 6. For India, they have to beat Nepal to confirm their spot, who are coming off a loss against Pakistan in the tournament opener.","pubDate":"2023-09-02 18:37:21","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1efddc103ae1681a4127550c5a750ad0","title":"'Bahot Saare Padosiyon Ke TV Bach Gaye Aaj’ Irfan Pathan Shares Sarcastic Tweet As Rain Washes Out IND vs PAK Asia Cup 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/bahot-saare-padosiyon-ke-tv-bach-gaye-aaj-irfan-pathan-shares-sarcastic-tweet-as-rain-washes-out-ind-vs-pak-asia-cup-2023-match-5383977.html","keywords":null,"creator":null,"video_url":null,"description":"The India vs Pakistan match in Asia Cup 2023 had an unfortunate end with rain eventually washing out the contest and both teams sharing points. India had scored 266 after choosing to bat at the Pallekele International Cricket Stadium.","content":"Irfan Pathan took to social media to share a sarcastic reaction as rain washed out the India vs Pakistan match in Kandy on Saturday, September 2. The match could only have its first innings with India scoring 266, riding on impressive performances from Ishan Kishan and Hardik Pandya. But there was no play possible in the second innings at all with the downpour lashing the stadium, which was under covers for a good period of time before the match was called off. Irfan, alluding to the fact that India could have won the match had the second innings taken place, wrote this on X, formerly Twitter. \"Bahot saare Padosiyon ke TV bach gaye aaj;)\" For the uninitiated, the former India fast bowler alluded to the previous reports of Pakistan fans breaking their TV sets after they were beaten by India in cricket matches. Ex-PCB Chief Najam Sethi Slams Asian Cricket Council Over Selection of Sri Lanka As Asia Cup 2023 Venue As IND vs PAK Match Is Called Off Due to Rain in Kandy. See Irfan Pathan's Tweet Bahot saare Padosiyon ke TV bach gaye aaj;) — Irfan Pathan (@IrfanPathan) September 2, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-09-02 18:32:44","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"445c48d72c62fa7d72e5c5ea3dffeb98","title":"India vs Nepal Asia Cup 2023 Weather Forecast: Latest update on Pallekele weather on Monday","link":"https://www.indiatvnews.com/sports/cricket/india-vs-nepal-asia-cup-2023-weather-forecast-latest-update-on-pallekele-kandy-weather-on-monday-weather-report-2023-09-03-890464","keywords":null,"creator":null,"video_url":null,"description":"India had to settle for a point after their opening Asia Cup 2023 game against Pakistan at Pallekele International Cricket Stadium was washed away due to rain on Saturday, September 2. India next face Nepal and need to avoid a defeat to qualify for the Super 4 round. But once again, rain is threatening India's game as the latest weather forecast for the Nepal game suggests considerable chances of precipitation.","content":"India had to settle for a point after their opening Asia Cup 2023 game against Pakistan at Pallekele International Cricket Stadium was washed away due to rain on Saturday, September 2. India next face Nepal and need to avoid a defeat to qualify for the Super 4 round. But once again, rain is threatening India's game as the latest weather forecast for the Nepal game suggests considerable chances of precipitation. Rain has been threatening matches in Sri Lanka and it is playing a big spoilsport for the hopeful fans. The first game at Pallekele also witnessed rain interruption and rain in the India vs Pakistan game suggests a similar weather forecast for the India vs Nepal game. The current Palleke weather (On Sunday) suggests an almost 60% chance of rain on Monday morning, so fans can witness a wet outfield. However, the chances of rain at the time of the toss (2:30 PM IST) are 22% and will remain the same till 6 PM. The chances of rain increase up to 66% in the second half of the game, suggesting another half-game for India, However, if rain washes out India's next game against Nepal, the -led side will automatically qualify for the Super 4 round with two points from the Group A fixtures. Rohit Sharma (c), , , Shreyas Iyer, Ishan Kishan (wk), , , Shardul Thakur, , , , Mohammed Siraj, Axar Patel, Suryakumar Yadav, Prasidh Krishna, Tilak Varma, (Ruled out due to injury) Kushal Bhurtel, Aasif Sheikh (wk), Bhim Sharki, Rohit Paudel (c), Kushal Malla, Dipendra Singh Airee, Gulsan Jha, Sompal Kami, Karan KC, Sandeep Lamichhane, Lalit Rajbanshi, Sundeep Jora, Pratis GC, Arjun Saud, Mousom Dhakal, Kishore Mahato, Aarif Sheikh","pubDate":"2023-09-02 18:31:02","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a8a3e6cc302bc0d8660c1c3eae523fe5","title":"“Way he controlled his pace, length was outstanding”: England’s Gus Atkinson wins acclaim for four-fer on T20I debut","link":"https://thenewsmill.com/2023/09/way-he-controlled-his-pace-length-was-outstanding-englands-gus-atkinson-wins-acclaim-for-four-fer-on-t20i-debut/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"England pacer Gus Atkinson, who took a four-wicket haul on debut during the second T20I against New Zealand, has received praise from pundits for his remarkable performance on debut. Half-centuries from Jonny Bairstow and Harry Brook and a four-fer by Atkinson helped England go up 2-0 in the four-match series after a 95-run win. Atkinson’s figures of 4/20 are the best-ever figures by an England men’s player on his T20I debut. Sky Sports experts Simon Doull and legendary Sri Lankan Kumar Sangakkara were full of praise for the bowler. Sangakkara lauded him for controlling his pace and length well. “It was incredible the way he went about his work. Sometimes you can get carried away with just the new-ball performance but it was an all-round performance. The way he controlled his length and pace was outstanding,” said the legendary cricketer according to Sky Sports. Doull also lauded the bowler for cleaning up the tail, something which he felt is important in T20 cricket. “He cleaned up the tail, which is so vital in T20 cricket. He found a nice line and length early on, did not get too full.” “He did not try and swing the ball, he just wanted a little bit cross-seam and control. The odd one nipped around but he did not want to get too carried away,” he added. Ahead of the match, legendary cricketer Michael Atherton had said that he is similar to England’s senior pace spearhead Jofra Archer. “Atkinson has eye-catching pace. He bowled an unbelievably fast spell against Buttler in The Hundred [for Oval Invincibles against Manchester Originals],” said Atherton. “I think his game has gone up a level this year. He feels confident in his body at last having gone through many injuries as a young player and is bowling quicker than before.” “I think there are similarities with Archer. A beautiful wrist action and in tight to the stumps,” he concluded. After the match, Jonny Bairstow, the ‘Player of the Match’ who scored 86 off just 60 balls and stayed unbeaten to guide England to 198/4, lauded the pacer and said that his performance will serve as a huge confidence boost for him. “We know the raw pace he has got, which is scary for any opposition. For him to take four wickets on debut will be a huge confidence boost. There is pressure on when you debut but you could see from his face how he handled that, he took everything in his stride,” said Bairstow. “We have no doubts it will be the first of many caps, in many other formats, too,” he added. England skipper Jos Buttler said that the bowler has been on an upward curve very quickly. “He has been on an upward curve very quickly. To get him in and around international cricket, in the dressing room, making friendships, getting used to the guys and the coaching staff takes time, so you need to accelerate that. He has settled in brilliantly,” he said. Coming to the match, electing to bat first, England posted 198/4 in their 20 overs. After Will Jacks (19) and Dawid Malan (0) lost their wickets early, leaving England at 43/2, a 131-run partnership between Jonny Bairstow (86 in 60 balls, eight fours and four sixes) and Harry Brook (67 in 36 balls with five fours and five sixes) helped England come back in the match and post a big total. Ish Sodhi (2/44) was the pick of the bowlers for NZ. Mitchell Santner and Tim Southee took a wicket each. Chasing 199, NZ lost wickets at regular intervals. Tim Seifert (39 in 31 balls, four boundaries), Glenn Phillips (22 in 17 balls, with three balls) and Mark Chapman (15 in eight balls, with one four and six) were the only ones to touch two figures. Atkinson (4/20) was the pick of the bowlers for England. Adil Rashid took two wickets for 18 balls. Sam Curran, Brydon Carse, Liam Livingstone and Will Jacks took a wicket each. (ANI)","pubDate":"2023-09-02 18:30:18","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f9f172fb70881792d7963ded76075bce","title":"IND vs PAK: Gautam Gambhir Slams Virat Kohli After Shaheen Afridi Dismissal, Calls Him 'Casual'","link":"https://zeenews.india.com/cricket/ind-vs-pak-asia-cup-2023-gautam-gambhir-slams-virat-kohli-after-shaheen-afridi-dismissal-calls-him-casual-2657043.html","keywords":null,"creator":null,"video_url":null,"description":"Partnership between Ishan Kishan (82 in 81 balls, with nine fours and two sixes) and Hardik Pandya (87 in 90 balls with seven fours and a six) helped India cross 200 runs.","content":"Former India cricketer Gautam Gambhir slammed star batter Virat Kohli for his shot selection during the India vs Pakistan clash in the ongoing Asia Cup clash at Kandy in Sri Lanka. He called Kohli 'casual' for his performance against Pakistan and Shaheen Afridi. In the match against Pakistan at Kandy, Virat started off with his signature cover drive and it looked like he would play another brilliant knock against the arch-rivals. But he was soon dismissed by Shaheen Shah Afridi, whose delivery hit the stumps after an inside edge from Kohli's willow. Virat was out for just four runs in seven balls. Gambhir did not mince his words in his criticism of Virat, saying that the shot played by him was a \"nothing shot\". (Watch: 'Ram Siya Ram' Song Played During India vs Pakistan Clash In Kandy, Video Goes Viral) \"That was a nothing shot, neither forward, neither back. I think was a bit casual. That is what you get when you play someone like Shaheen Afridi. You do not know whether to go forward or back,\" Gambhir said in commentary on Star Sports. Pakistan's legendary bowler Waqr Younis however felt Virat was unlucky. \"Kohli was a touch unlucky. Inside edge, the ball did not come on to the bat and maybe even kept a bit low. But credit to Shaheen Shah Afridi for altering his length,\" he said. Matthew Hayden, the legendary Australian opener seemed to agree with Hayden. \"Yeah, inside edge onto the stumps, could have got anywhere,\" he said. The group stage match between India and Pakistan has been called off due to rain, with both teams sharing one point each. With this, Pakistan has secured a total of three points in two matches. They had got two points previously after winning their first match against Nepal. They have qualified for the Super Four stage. India has one point now and they must beat Nepal in their next match on September 4 to move to the Super Four stage. Coming to the match, India elected to bat first and posted 266/10 in 48.5 overs. India struggled to take on the pace duo of Shaheen and Haris Rauf, with Shaheen getting skipper Rohit Sharma (11) and Virat Kohli (4) and Haris getting Shreyas Iyer (14) and Shubman Gill (10). India was reduced to 66/4. Then a 138-run partnership between Ishan Kishan (82 in 81 balls, with nine fours and two sixes) and Hardik Pandya (87 in 90 balls with seven fours and a six) helped India cross 200 runs. Then, contributions from Ravindra Jadeja (14) and Jasprit Bumrah (16) helped India cross the 250-run mark. Shaheen (4/35) was the pick of the bowlers for Pakistan. Naseem Shah (3/36) and Haris Rauf (3/58) also bowled well for Pakistan. (With ANI inputs)","pubDate":"2023-09-02 18:24:00","image_url":null,"source_id":"zeenews","source_priority":5319,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a8ecfdcd8df6ca73126ad952c7f4d9aa","title":"Gus Atkinson has enjoyed a rapid rise to England call-up after changing his run-up and increasing his pace to 95mph... now fast bowler is confident he can deliver at the World Cup","link":"https://www.dailymail.co.uk/sport/cricket/article-12474087/Gus-Atkinson-enjoyed-rapid-rise-England-call-changing-run-increasing-pace-95mph-fast-bowler-confident-deliver-World-Cup.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Figures of four for 20 at Old Trafford were the best figures ever by an England bowler on T20 debut and helped England to a 2-0 series lead against New Zealand,","content":"Gus Atkinson has enjoyed a rapid rise to England call-up after changing his run-up and increasing his pace to 95mph... now fast bowler is confident he can deliver at the World Cup Gus Atkinson enjoyed a dream England debut against New Zealand He recorded the best figures ever by an England bowler on T20 debut His second delivery, bowled at 92mph, beat Devon Conway for pace By Aadam Patel For The Mail On Sunday Updated: 20:40 BST, 2 September 2023 e-mail 1 View comments As far as debuts go, Gus Atkinson’s first England appearance could hardly have gone any better. Figures of four for 20 at Old Trafford were the best figures ever by an England bowler on T20 debut and helped England to a 2-0 series lead against New Zealand, ahead of the third T20 at Edgbaston on Sunday. ‘Yeah, that was perfect,’ the 25-year-old said. ‘I can’t ask for much more than that. I’m very happy.’ His Surrey bowling coach, Azhar Mahmood, says he knew once Atkinson broke into the Surrey team as a regular, he was ready to play for England across formats. Injuries plagued Atkinson since signing as a professional in 2017 but last year, with a changed run-up and increased pace, everything clicked. Gus Atkinson enjoyed a dream England T20 debut by taking four for 20 at Old Trafford ‘When we saw him last year, it was clear Gus had the ability to make it for England across all formats. It was then a case of consistency and fitness. We picked him in the ILT20 and the PSL and worked with him throughout the year,’ says Mahmood. At the toss on Friday, Jos Buttler said Atkinson had ‘pace to burn’. He knew first-hand after facing him for the first time in The Hundred, when he clocked 95mph against Buttler. Atkinson had made his statement. Post-match, Buttler had a conversation with Mahmood. A week later, Atkinson was named in England’s World Cup squad, as revealed by Mail Sport. He was already on England’s radar but perhaps that evening in south London was confirmation. ‘Jos asked about Gus. He was really impressed that night. It was a conversation about how Gus had developed his abilities,’ says Mahmood. Those who know Atkinson speak of an introvert but someone who knows that he possesses a special talent. His second delivery against New Zealand, bowled at 92mph, beat Devon Conway for pace. Two balls later, he had his maiden wicket removing Conway with a 90mph delivery but there were no ecstatic celebrations. Just a little smile. ‘One of my friends said: ‘You never know, we might get a smile out of you when you get your first (England) wicket.’ So I was thinking about that when I got my wicket but I was very happy inside,’ revealed Atkinson after. Though outwardly reserved, the inner confidence has always been there. In an Instagram video on the Oval Invincibles channel, the dressing room were asked what they would be if they weren’t cricketers, Atkinson’s responded that he would ‘probably be a model’. The rise to an England call-up has come quick but it is no surprise for him. His second delivery against New Zealand, bowled at 92mph, beat Devon Conway for pace ‘I knew that once I got going, it could happen quick,’ said Atkinson. ‘I’ve always known my ability and what I can do and I knew once I had the chance with games… The Hundred’s a big opportunity. I knew if I could perform in that, then it would happen quickly.’ His smooth action has seen him earn comparisons to Jofra Archer and his England teammate Jonny Bairstow sang Atkinson’s praises. ‘You look at when Jofra came on the scene and how quickly he was elevated through…we know that pace is the one thing that's a rare commodity and can be devastating when you get it right. I think that's going to be the first cap of a few, definitely in this format and I'm sure in a few others as well,’ said Bairstow. On the basis of his debut, it will be a case of no Jofra, no problem for England in India. In Atkinson, alongside Mark Wood, England will truly have pace to burn during their World Cup defence. Share or comment on this article: Gus Atkinson has enjoyed a rapid rise to England call-up after changing his run-up and increasing his pace to 95mph... now fast bowler is confident he can deliver at the World Cup e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-02 19:40:42","image_url":"https://i.dailymail.co.uk/1s/2023/09/02/20/74996475-0-image-m-17_1693682533256.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d50a4614955dd5a80642768df44a73cd","title":"Finals form guide: Will Collingwood stand up when it matters most?","link":"https://www.brisbanetimes.com.au/sport/afl/finals-form-guide-will-collingwood-stand-up-when-it-matters-most-20230828-p5dzvq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Marc McGowan, Jon Pierik and Andrew Wu"],"video_url":null,"description":"It’s the business end of the season with eight clubs fighting for glory. Our reporters analyse each club’s chances and delve into the stats where they rule and where they can improve. Which players will light up September?","content":"It’s the business end of the season. Eight teams remain in the hunt for AFL premiership glory. We analyse their flag chances, dig into the stats of where each club rules on the field and where they can improve, and nominate the players who are set to light up September. 1. Collingwood Injury list: Darcy Moore (hamstring) and Nathan Murphy (back/glute/hip) are expected to return for the Pies’ qualifying final clash with Melbourne, but Nick Daicos (knee) will almost certainly need at least one more week’s recovery. Skippr Darcy Moore leads the Magpies up the race at the MCG. Credit: AFL Photos Room for improvement: It’s all about Collingwood’s defence. They strangled the life out of a horribly out-of-sorts Essendon , but before that, conceded 124 points, 101, 105 and 93 – three of those four games resulting in defeats. No other club conceded more in that period, so Craig McRae will need his troops to revert to their stingy ways from the rest of the season. Moore and Murphy returning is a great start, but it won’t solve everything. Watch out for: Nick Daicos’ incredible season has, at times, meant Jordan De Goey somehow goes under the radar, but he put together a stellar campaign, too – and is every bit as important to Collingwood’s success. De Goey is a genuine match winner, averaging career highs in disposals (23.9), inside 50s (5.1) and clearances (5.4), as well as being close in a number of other metrics. Flag chances: The Magpies proved last year their game style holds up in big finals, and they almost made it to the grand final. They have been better again in 2023, and not much should be read into their late-season form. That said, the qualifying final result will be significant either way for their premiership hopes. - Marc McGowan 2. Brisbane Lions Injury list: Jack Gunston (knee) hopes to return later in September; Daniel Rich (hamstring) may miss the qualifying final; and Lincoln McCarthy (calf) should be fit. Trademark celebration: Charlie Cameron hopes to rev his motorbike engine in a deep September run. Credit: Getty Images/Stphen Kiprillis Room for improvement: Chris Fagan insists his team is as well-prepared as ever to enjoy September glory, and it’s hard to argue against that given they are stocked with talent across the three spheres of the field. However, while they may have two finals at home, their 1-14 recent record at the MCG is a concern. They should have finished off the Demons at the ’G last month. However, in September, there won’t be a second chance. Loading Watch out for: Charlie Cameron. The dynamic mid-sized forward is the Lions’ leading goal-kicker, and has created havoc in recent finals, booting seven goals in three games last season, and eight goals in two in 2021. This campaign is unlikely to be any different. That key talls Joe Daniher and Eric Hipwood have been in good touch could help Cameron find even more space. Flag chances: As is the case for the Power, the time is nigh for this group to deliver. Fagan has rebuilt this side over seven seasons, and it should be emboldened having endured September heartache for four seasons. The likes of Lachie Neale, Josh Dunkley, Harris Andrews, Daniher et al. are at the peak of their powers. - Jon Pierik 3. Port Adelaide Injury list: Charlie Dixon (foot) and Trent McKenzie (knee) are both a good chance to be available for the qualifying final, while coach Ken Hinkley confirmed Todd Marshall (hip) would be fine after being a late withdrawal last Sunday. Ruckman Scott Lycett (knee) returned in the SANFL at the weekend. Room for improvement: The Power have succeeded despite being beaten – sometimes badly – in contested possession in six of the past seven rounds. The great Richmond sides under Damien Hardwick were similar in the home-and-away season, but improved in that area in the finals. Port’s finals fate might rest on the same. Zak Butters is the only Power player in the top 50 for contested possessions per game in 2023. Zak Butters was named the AFLCA’s Champion Player of the Year in a standout home and away season for the Power. Credit: AFL Photos Watch out for: Butters, Connor Rozee and Ollie Wines will have huge roles to play in September, but Dixon might be the difference-maker. The 32-year-old power forward took six contested marks in his most recent match in round 20 before missing the past month with injury. A fit-and-firing Dixon gives Port Adelaide a more menacing look in attack, and his presence means Marshall, Jeremy Finlayson and potentially Ollie Lord (if he keeps his spot) can deal with lesser defenders, too. Flag chances: So much depends on whether the Power can become the first team this season to beat the Lions at the Gabba. If they can, Port will earn a home preliminary final and be favoured to make the grand final. They have a star-studded midfield group and dangerous (and tall) forward line. - Marc McGowan 4. Melbourne Injury list: The Demons have lost Jake Melksham (ACL), but Bayley Fritsch (sore foot) is expected to play. Michael Hibberd (concussion protocols) will need to prove his fitness. Room for improvement: The Demons have won seven of their past eight games, and head into September well-placed. They boast and elite midfield and defence, but the major question revolves around who replaces mid-sized forward Melksham. He has been a key figure over the past two months. Will there be a temptation to go tall and recall Brodie Grundy? The premiership is this way: Christian Petracca will have a major role in the Demons’ September quest. Credit: AFL Photos Watch out for: It’s hard to go past the bull that is Christian Petracca. Yes, Clayton Oliver, Max Gawn and Jack Viney are gold-plated stars, but Petracca has the ability to turn a contest in the blink of an eye on the ball, and when drifting forward. Remember, he was the 2021 Norm Smith medallist. Flag chances: The Magpies finished on top of the ladder, but the Demons are legitimate premiership aspirants. They have all bases covered, particularly since adopting a more attacking style. It will be no shock if they reprise their King’s Birthday upset and edge the Magpies on Thursday night. - Jon Pierik 5. Carlton Injury list: Patrick Cripps and Sam Docherty are both available after missing the final round with soreness. Blake Acres has been cleared of a broken collarbone but must pass a fitness test next week. Jack Silvagni (knee) won’t be ready. Matt Kennedy will struggle to break into the 22 after a long lay-off. Room for improvement: Miserly for much of their nine-game winning streak, the Blues’ defence broke down for long stretches in the final fortnight. Two of their four highest scores conceded this year have come in that time. It was alarming how often the Giants were able to break through their grid. The system worked well for months, and the personnel remains the same, so perhaps it’s just a matter of attention to detail. The clearance game has also dropped off, though a refreshed Patrick Cripps and the returns of Adam Cerra and Sam Walsh, both with a game under their belt, will provide a lift. Charlie Curnow is now a two-time Coleman medallist. Credit: Getty Images Watch out for: Charlie Curnow was born for the big stage. In his eighth season, he belatedly gets his chance. No player lifts the energy of his team, and their fans, more than the back-to-back Coleman Medal winner. A generational talent, Curnow is ready to take over from Lance Franklin as the game’s great entertainer. A big September might take the Blues deep – and get him close to the ton. Flag chances: Anything is possible if Curnow, Cripps, Walsh and co all have the month of their lives, but it’s difficult to see the Blues winning four finals on the bounce in their first September campaign in 10 years. Teams will not relish facing the Blues, provided they get past perennial finalists Sydney in week one. Whatever they achieve will be a stepping stone for the years to come. - Andrew Wu 6. St Kilda Injury list: Veteran midfielder Seb Ross (hamstring) is on track to play in the Saints’ elimination final against GWS, according to assistant coach Lenny Hayes. Josh Battle and Anthony Caminiti (both concussion) are also set to be available, but Dougal Howard (wrist) appears unlikely. Room for improvement: St Kilda are the league’s stingiest defence under Ross Lyon, but they have struggled to score from clearances (ranked 17th) and inside 50s (18th). The extended injury absences of forwards Max King and Tim Membrey offer a genuine excuse for those offensive woes. Both will play in September, so the Saints should be more potent. Max King looms as a potential finals match-winner for the Saints. Credit: AFL Photos Watch out for: King is the biggest star at St Kilda and the player most capable of ripping a match apart. The 202-centimetre target needs supply, but he transforms the Saints’ attack when he is there, and will be cherry ripe after sitting out the final round. King might not even have to worry about All-Australian defender Sam Taylor, who is racing the clock to be fit. Flag chances: The Saints will need to head interstate in the second week of the finals to face the loser of the clash between Brisbane and Port Adelaide, if they survive the in-form Giants. Winning four matches in September is brutally tough, but others have proven it is not impossible. - Marc McGowan 7. Greater Western Sydney Injury list: Sam Taylor (hamstring) was a titanic pre-game loss before last Sunday’s win over Carlton, and coach Adam Kingsley tipped he would be “touch and go” for their elimination final against St Kilda – and a match-up with Max King. Finn Callaghan (Achilles) and Xavier O’Halloran (thumb) have been out for weeks but could be in the selection mix for the Saints clash. Room for improvement: The Giants are moving the ball well, typically still strong in the contest and mostly out-tackling their opposition, but only one team is worse than them for conceding points from centre clearances. That would be an area of concern for Kingsley entering the finals, especially knowing games can be won or lost in a scoring binge while one side has momentum. A structural or positional tweak might be necessary to stem the bleeding. Former Giants skipper Stephen Coniglio is back to his brilliant best. Credit: AFL Photos Watch out for: Stephen Coniglio is all the way back to his brilliant best – a revival that started last year and is now complete, including 28 disposals and 2.2 in his 200th game last weekend. Injuries and potentially the weight of the captaincy wore Coniglio down, but free of both, his experience, class and dash will all be vital to the Giants’ September chances. Flag chances: If Carlton’s second-half resurgence makes them one of the finals dark horses, then GWS must be considered in a similar bracket. They have stars on every line, are hunting in numbers, and are irrepressible when they are up and going, like the second half on Sunday. - Marc McGowan 8. Sydney Injury list: Tom Papley was at 90 per cent with his hamstring last week, so with the additional 12 days, he should be ready. Wingman Justin McInerney (calf) will also be some chance to return. Room for improvement: It will be an early exit if they cannot lift their clearance game. Ranked 15th for scores from clearances, the Swans face the competition’s best at scoring from this source. They can struggle against big-bodied midfielders but were every bit as good as Melbourne in this area for three quarters in a strong finals dress rehearsal. Watch out for: Once the Robin to Lance Franklin’s Batman, Isaac Heeney now has the path cleared for him to be the Swans’ superhero. Though down on his All-Australian 2022, Heeney’s second half of the season has been much better with 20 goals from his past 10 games. As a senior player in a young forward line, Heeney must step up and lead the way. Flag chances: If John Longmire’s men can win four finals on the road, this will be a premiership for the ages – but it won’t happen. They are strong enough to win a final or two if Luke Parker, Callum Mills and Chad Warner can muscle up in the middle to provide an extra layer of protection for their undermanned defence, and Papley and Heeney can get active forward. - Andrew Wu Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Carlton Blues Collingwood Magpies Melbourne Demons Brisbane Lions St Kilda Saints More… Marc McGowan is a sports reporter for The Age Connect via Twitter . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-02 19:30:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"b081b02d08d843a2619ff1b6cf0493d5","title":"He kicked 640 goals but his retirement might be greater: Entertainers and activists among these AFL influencers","link":"https://www.brisbanetimes.com.au/sport/afl/he-kicked-640-goals-but-his-retirement-might-be-greater-entertainers-and-activists-among-these-afl-influencers-20230831-p5e0ya.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Chloe Saltau"],"video_url":null,"description":"Leading into AFL finals and the start of the AFLW season, we have chosen the top 50 people who will influence footy over the next decade. Here are numbers 20-11.","content":"Footy is changing. League supremo Gillon McLachlan will ride into the sunset the day after the AFL grand final. The men’s finals series will feature a galaxy of emerging stars. The AFLW season will showcase a generation of women who are shaking up the footy landscape. Behind the scenes, there is a new establishment making decisions, making their voices heard and influencing what the game will look like, on and off the field, towards 2030. It’s a good time to ask, who are the people who will shape the game over the next decade? We asked a panel of experts from The Age , Nine’s Wide World of Sports and the Sydney Morning Herald to answer this question to come up with the top 50 AFL influencers. The criteria: The panel of 10 judges was asked to select people who influence how the AFL and AFLW are played, watched, understood, coached and commercialised. These are people who are either making a difference now, or who will change football in a meaningful way over the next decade. They could be players, coaches, administrators, commissioners, agents, club bosses, politicians, businesspeople, lawyers, or media people (the judges were not permitted to select themselves or other journalists). Who has the power to bring about change? Who is doing the big commercial deals? Who has a booming profile among younger fans? Who is making a difference to the way Indigenous people in footy are treated? Is there a line coach who is changing an aspect of the game? An AFLW figure changing the way women’s footy is played, perceived or run? Unashamedly, we were striving for diversity in our list. Our top 50 will no doubt provoke arguments. You can have your say on contentious inclusions or omissions, or ask our chief football writer Jake Niall a question about the selections by leaving a comment on this article. How the judging worked: Each judge picked their own top 20, with votes apportioned in reverse order. So, No.20 was given one vote and No.19 two votes, and so on. From there, we compiled the top 50 based on total votes. We’re publishing 10 names every day, culminating with the top 10 on Monday, September 4. In her short time as North Melbourne president Sonja Hood has already enhanced her reputation as a respected businesswoman. The signing of four-time premiership coach Alastair Clarkson was seen as a huge coup for the club. The next step will be to guide the club through a successful on-field period. Hood has worked on her performance in the media and is active on social media. She is a strong advocate for women in the industry having hired the league’s second ever club CEO in Jen Watt. Her battle with breast cancer, and her willingness to speak publicly about it, has helped to inspire other females. - Nat Yoannidis Alastair Clarkson with North Melbourne president Sonja Hood. Credit: Getty Images The CEO of Foxtel secured a landmark broadcast and streaming deal with the AFL until the end of 2031. From 2025, Fox Footy will produce and broadcast all nine games using their talent and are no longer required to use the Channel Seven feed for some of the games. Additionally, Fox Footy will shape the broadcast experience for the fans watching at home or online by adding panel and debate shows around the games. - Kane Cornes The Bulldogs youngster has endured a tough few years since being selected as the overall No.1 draft pick, but made his biggest impact on the competition this year, both with a breakout season as a key forward, and when he spoke out against racial abuse. Ugle-Hagan ensured that he would be remembered for years to come when he emulated Nicky Winmar’s iconic anti-racism stance from 1993 after being attacked in the opening rounds of the season. He handled the entire saga with brilliant poise and spoke eloquently, and is likely to be one of the more prominent Indigenous voices in the game over the next decade. - Chris De Silva Jamarra Ugle-Hagan took a stand against racist abuse. Credit: Getty Images Concussion could be the single biggest issue facing the league over the next decade. As general counsel, Stephen Meade will help determine how the organisation navigates the legal ramifications associated with head knocks. The number of confirmed cases of CTE has already meant protecting the head is a high priority. This will amplify over the next 10 years as former players come forward with lawsuits against the league and its clubs. While Meade’s role is strictly behind the scenes, his leadership and advice will shape the laws of the game as the AFL moves to protect its players and image. - Nat Yoannidis Michael Christian has been the match review officer since 2018, and so long as he remains in that position he will continue to help shape the game. As concern surrounding head knocks and concussion grows, the role of the MRO in stamping out unwanted actions will evolve. The rules of the game often come down to individual interpretation and his decisions help shape our understanding of them. The former Collingwood star and media personality will continue to play an important role in determining what is within the rules of the game and what isn’t. - Nat Yoannidis SEN boss Hutchison is already one of the most recognisable media moguls in the game. His role in the media gives him a voice, while his 24-7 sports radio network contributes to the saturation coverage of football. Hutchison’s bold move to poach Gerard Whateley from the ABC took the veteran broadcaster to a different audience. His company, which has a voracious appetite for sporting rights, also owns the AFL Record, and he has helped commercialise the burgeoning player movement space through SEN’s trade radio. What sets the SEN brand apart is the move into sport ownership. The company owns NBL side the Perth Wildcats and Super Netball’s newest franchise. Hutchison also hosts the popular Sounding Board podcast with fellow journalist Damien Barrett. - Nat Yoannidis Craig Hutchison on Nine’s Footy Classified with Matthew Lloyd. Credit: Nine Eddie was one of footy’s greatest entertainers and now, as one of only a few Indigenous voices in the mainstream media, his voice is strong. Having a platform on Fox Footy gives him the opportunity to speak on Indigenous issue across the game through his life experience when they arise. With racial comments directed at players weekly through social media, it’s important to hear from Indigenous voices on how to combat this but also how to stand up and be proud. He is one of the greats of our game, but it’s the impact in retirement that will bring meaningful change. - Mathew Stokes Eddie Betts is one of the great entertainers. Credit: Getty Images McRae is often credited with reshaping Collingwood into a belief-driven side with a “winners-only” mentality after helping them charge up the ladder in his first year at the helm – a rise which has continued this season. As one of the largest and oldest clubs in the league, this is impactful in itself but also has ripple effects. Other clubs are watching closely and taking note. He’s brought a new-found positivity to the craft of coaching, allowing and encouraging his players to be themselves, and presenting an honest version of himself to the media. McRae, part of the great Brisbane Lions dynasty of the early 2000s, is also a big advocate for the so-called theatre of football – and that significantly impacts how fans engage with the sport. - Marnie Vinall Craig McRae with Jordan De Goey. Credit: Getty Images The AFL is surely as big as it’s ever going to be in the “heartland” states, so the league’s growth over the next decade is going to come from the north – and there is no state with more room to grow than NSW . Swans boss Tom Harley. Credit: AFL Media / Getty Images Tom Harley is a Sydney transplant but has been leading the Swans for so long – and so well – that it feels as if he’s part of the furniture. Whether he will continue to lead the AFL’s flagship club in Australia’s biggest city, or whether he moves to headquarters for an even bigger role, having previously been interviewed as a candidate to replace Gillon McLachlan and mentioned as a potential head of football, there is little doubt that, at 45, Harley’s prime years as an administrator are ahead of him. - Vince Rugari Tanya Hosch is the first Indigenous person and the second woman appointed to an executive position in the AFL. Inclusion, acceptance and racism are key issues in the AFL and Hosch is the ideal person to hold the role. With her long and distinguished history in Aboriginal and Torres Strait Islander policy, she is working to rid the game of racism and make it an inclusive and safe environment for players, officials and supporters. But influence transcends footy. As an advocate of an Indigenous Voice to parliament, Hosch gave a deeply personal speech in which she revealed she had recently had part of her lower leg amputated because of a condition related to type 2 diabetes. While not without privilege, she said she was a human example of the system that let First Nations people down. - Anna Pavlou Tanya Hosch rises from her wheelchair to speak. Credit: Sarah Reed Come back on Monday to find out who made the top 10. Click here for 50-41 Click here for 40-31 Click here for 30-21. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers Gillon McLachlan Alastair Clarkson Chloe Saltau is Sports Editor of The Age and a former chief cricket writer Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-02 19:00:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"05b82742c5e38c275d5cdf56ceed8ba7","title":"Virat Kohli’s Picture With Babar Azam, Shadab Khan and Other Pakistan Players Goes Viral After Rain Washes Out IND vs PAK Asia Cup 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/virat-kohlis-picture-with-babar-azam-shadab-khan-and-other-pakistan-players-goes-viral-after-rain-washes-out-ind-vs-pak-asia-cup-2023-match-5384026.html","keywords":null,"creator":null,"video_url":null,"description":"The star Indian cricketer was seen with the Pakistan cricketers after the match as they all shared a laugh together at the end of the match, which was called off due to rain. Pakistan qualified for the Super Four stage after this contest while India need a win over Nepal to make it through to the next round.","content":"Virat Kohli shared a laugh with the Pakistan players after the India vs Pakistan match in Asia Cup 2023 was washed out by rain in Kandy on September 2. The star player was seen catching up with Babar Azam, Shadab Khan, Haris Rauf and other Pakistan cricketers after the match was called off at the Pallekele International Cricket Stadium and this picture has gone viral on social media. India scored 266 runs in the first innings, with Hardik Pandya and Ishan Kishan scoring 87 and 82 runs respectively. No play was possible in the second innings. When is India vs Pakistan Next Match in Asia Cup 2023? Check Date, Time and Venue of Possible IND vs PAK Cricket Match. See Viral Pic Here: Picture of the day from Pallekele. - Virat Kohli is the favorite for everyone. pic.twitter.com/hbfDXuMcnK — Johns. (@CricCrazyJohns) September 2, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-09-02 18:48:42","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6c984aae3e844201abf451e72d7664c8","title":"Asia Cup 2023: How can India still qualify for Super Fours after Ind vs Pak match wash out?","link":"https://www.dnaindia.com/cricket/report-asia-cup-2023-how-can-india-qualify-for-super-fours-after-ind-vs-pak-match-wash-out-3058576","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"India will play their second match in the group round against Nepal on Monday, September 4.","content":"Asia Cup 2023: The Asia Cup match between India and Pakistan in Sri Lanka on Saturday was called off due to persistent rain. India earned one point from their first match in the tournament against Pakistan in the group stage. The team are placed second in Group A. The men in blue will play their second match in the group round against Nepal on Monday, September 4. Now the question is how can Team India qualify for Super Fours after IND vs PAK match is washed out? The Rohit Sharma-led squad cannot afford to lose their second game against Nepal. The duo will clash in international cricket for the first time. A win for either side can take them to the Asia Cup Super 4s round. If India win by a big margin, they can even finish first in the Group A points table. If the India vs Nepal match in Asia Cup 2023 is abandoned due to rain, then India will qualify for the Super 4s. They will finish the group stage with two points while Nepal will only have one point to their name. Three scenarios for Team India to qualify for the Super Four in the Asia Cup Scenario 1: If India beat Nepal, then it will definitely qualify for the Super Four. India will then be level on three points with Pakistan and the two teams will progress to the next round. Scenario 2: If India lose to Nepal, then the latter will qualify for the Super Four. Scenario 3: If India vs Nepal is washed out, then India will still qualify for the Super Four. India will have two points in that case. READ | Asia Cup 2023: IND vs PAK match called off after rain plays spoilsport, Pakistan reach Super 4 stage In the India vs Pakistan match on Saturday, no play was possible after India made 266 in 48.5 overs. Ishan Kishan (82) and Hardik Pandya (87) revived India's innings with a 138-run stand off 141 balls after losing the first four wickets for 66 runs. Shaheen Afridi was the stand-out bowler for Pakistan, ending with figures of four for 35 in 10 overs. India posted 266 all out in 48.5 overs in the first innings.","pubDate":"2023-09-02 18:41:00","image_url":null,"source_id":"dnaindia","source_priority":18388,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d00238dfd10dfd6d0580fa13066e15ee","title":"WATCH: 'Ram Siya Ram' song plays during India-Pakistan Asia Cup clash in Kandy, video goes viral","link":"https://www.indiatvnews.com/sports/cricket/watch-ram-siya-ram-song-plays-during-india-pakistan-asia-cup-clash-in-kandy-video-goes-viral-2023-09-03-890472","keywords":null,"creator":null,"video_url":null,"description":"It was a disappointing affair at Pallekele International Cricket Stadium in Kandy as incessant rain relented, to deny a result in the highly-anticipated clash between India and Pakistan on Saturday, September 2. The match was setting up to be a thriller with 267 probably going to be a tricky chase given the overcast conditions, however, it wasn't to be as the heavens opened up for the fourth time in the game after the 9 PM local time inspection and this time rather decisively.","content":"It was a disappointing affair at Pallekele International Cricket Stadium in Kandy as incessant rain relented, to deny a result in the highly-anticipated clash between India and Pakistan on Saturday, September 2. The match was setting up to be a thriller with 267 probably going to be a tricky chase given the overcast conditions, however, it wasn't to be as the heavens opened up for the fourth time in the game after the 9 PM local time inspection and this time rather decisively. The viewers and the local crowd didn't get to watch the full game, however, they did see some exciting cricket in the first innings with the Indian batters and Pakistani bowlers both having their moment. Earlier, the Pakistani pacers dominated the first part of the Indian innings reducing the Men in Blue to 66/4. None of the top-order batters had answers to Shaheen Afridi's swing and Haris Rauf played his part well with the wickets of Shreyas Iyer and later on. Ishan Kishan playing at No. 5 for the first time and , who likes batting against Pakistan performed the rescue job for their side to the T. Both balanced caution with aggression as they didn't let any loose balls go and played the ball to merit without curbing their natural instincts. The partnership had just completed a century during the 33rd over when an unusual sighting happened during the game. A song from the Bollywood film 'Adipurush', 'Ram Siya Ram' was played by the DJ in Kandy and the Indian fans couldn't believe that it actually happened. Pakistan have confirmed their spot in the Super Fours and hence will be travelling back to Lahore for their final game, which will be in the next round on September 6. For India, they have to beat Nepal to confirm their spot, who are coming off a loss against Pakistan in the tournament opener.","pubDate":"2023-09-02 18:37:21","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1efddc103ae1681a4127550c5a750ad0","title":"'Bahot Saare Padosiyon Ke TV Bach Gaye Aaj’ Irfan Pathan Shares Sarcastic Tweet As Rain Washes Out IND vs PAK Asia Cup 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/bahot-saare-padosiyon-ke-tv-bach-gaye-aaj-irfan-pathan-shares-sarcastic-tweet-as-rain-washes-out-ind-vs-pak-asia-cup-2023-match-5383977.html","keywords":null,"creator":null,"video_url":null,"description":"The India vs Pakistan match in Asia Cup 2023 had an unfortunate end with rain eventually washing out the contest and both teams sharing points. India had scored 266 after choosing to bat at the Pallekele International Cricket Stadium.","content":"Irfan Pathan took to social media to share a sarcastic reaction as rain washed out the India vs Pakistan match in Kandy on Saturday, September 2. The match could only have its first innings with India scoring 266, riding on impressive performances from Ishan Kishan and Hardik Pandya. But there was no play possible in the second innings at all with the downpour lashing the stadium, which was under covers for a good period of time before the match was called off. Irfan, alluding to the fact that India could have won the match had the second innings taken place, wrote this on X, formerly Twitter. \"Bahot saare Padosiyon ke TV bach gaye aaj;)\" For the uninitiated, the former India fast bowler alluded to the previous reports of Pakistan fans breaking their TV sets after they were beaten by India in cricket matches. Ex-PCB Chief Najam Sethi Slams Asian Cricket Council Over Selection of Sri Lanka As Asia Cup 2023 Venue As IND vs PAK Match Is Called Off Due to Rain in Kandy. See Irfan Pathan's Tweet Bahot saare Padosiyon ke TV bach gaye aaj;) — Irfan Pathan (@IrfanPathan) September 2, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-09-02 18:32:44","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"445c48d72c62fa7d72e5c5ea3dffeb98","title":"India vs Nepal Asia Cup 2023 Weather Forecast: Latest update on Pallekele weather on Monday","link":"https://www.indiatvnews.com/sports/cricket/india-vs-nepal-asia-cup-2023-weather-forecast-latest-update-on-pallekele-kandy-weather-on-monday-weather-report-2023-09-03-890464","keywords":null,"creator":null,"video_url":null,"description":"India had to settle for a point after their opening Asia Cup 2023 game against Pakistan at Pallekele International Cricket Stadium was washed away due to rain on Saturday, September 2. India next face Nepal and need to avoid a defeat to qualify for the Super 4 round. But once again, rain is threatening India's game as the latest weather forecast for the Nepal game suggests considerable chances of precipitation.","content":"India had to settle for a point after their opening Asia Cup 2023 game against Pakistan at Pallekele International Cricket Stadium was washed away due to rain on Saturday, September 2. India next face Nepal and need to avoid a defeat to qualify for the Super 4 round. But once again, rain is threatening India's game as the latest weather forecast for the Nepal game suggests considerable chances of precipitation. Rain has been threatening matches in Sri Lanka and it is playing a big spoilsport for the hopeful fans. The first game at Pallekele also witnessed rain interruption and rain in the India vs Pakistan game suggests a similar weather forecast for the India vs Nepal game. The current Palleke weather (On Sunday) suggests an almost 60% chance of rain on Monday morning, so fans can witness a wet outfield. However, the chances of rain at the time of the toss (2:30 PM IST) are 22% and will remain the same till 6 PM. The chances of rain increase up to 66% in the second half of the game, suggesting another half-game for India, However, if rain washes out India's next game against Nepal, the -led side will automatically qualify for the Super 4 round with two points from the Group A fixtures. Rohit Sharma (c), , , Shreyas Iyer, Ishan Kishan (wk), , , Shardul Thakur, , , , Mohammed Siraj, Axar Patel, Suryakumar Yadav, Prasidh Krishna, Tilak Varma, (Ruled out due to injury) Kushal Bhurtel, Aasif Sheikh (wk), Bhim Sharki, Rohit Paudel (c), Kushal Malla, Dipendra Singh Airee, Gulsan Jha, Sompal Kami, Karan KC, Sandeep Lamichhane, Lalit Rajbanshi, Sundeep Jora, Pratis GC, Arjun Saud, Mousom Dhakal, Kishore Mahato, Aarif Sheikh","pubDate":"2023-09-02 18:31:02","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a8a3e6cc302bc0d8660c1c3eae523fe5","title":"“Way he controlled his pace, length was outstanding”: England’s Gus Atkinson wins acclaim for four-fer on T20I debut","link":"https://thenewsmill.com/2023/09/way-he-controlled-his-pace-length-was-outstanding-englands-gus-atkinson-wins-acclaim-for-four-fer-on-t20i-debut/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"England pacer Gus Atkinson, who took a four-wicket haul on debut during the second T20I against New Zealand, has received praise from pundits for his remarkable performance on debut. Half-centuries from Jonny Bairstow and Harry Brook and a four-fer by Atkinson helped England go up 2-0 in the four-match series after a 95-run win. Atkinson’s figures of 4/20 are the best-ever figures by an England men’s player on his T20I debut. Sky Sports experts Simon Doull and legendary Sri Lankan Kumar Sangakkara were full of praise for the bowler. Sangakkara lauded him for controlling his pace and length well. “It was incredible the way he went about his work. Sometimes you can get carried away with just the new-ball performance but it was an all-round performance. The way he controlled his length and pace was outstanding,” said the legendary cricketer according to Sky Sports. Doull also lauded the bowler for cleaning up the tail, something which he felt is important in T20 cricket. “He cleaned up the tail, which is so vital in T20 cricket. He found a nice line and length early on, did not get too full.” “He did not try and swing the ball, he just wanted a little bit cross-seam and control. The odd one nipped around but he did not want to get too carried away,” he added. Ahead of the match, legendary cricketer Michael Atherton had said that he is similar to England’s senior pace spearhead Jofra Archer. “Atkinson has eye-catching pace. He bowled an unbelievably fast spell against Buttler in The Hundred [for Oval Invincibles against Manchester Originals],” said Atherton. “I think his game has gone up a level this year. He feels confident in his body at last having gone through many injuries as a young player and is bowling quicker than before.” “I think there are similarities with Archer. A beautiful wrist action and in tight to the stumps,” he concluded. After the match, Jonny Bairstow, the ‘Player of the Match’ who scored 86 off just 60 balls and stayed unbeaten to guide England to 198/4, lauded the pacer and said that his performance will serve as a huge confidence boost for him. “We know the raw pace he has got, which is scary for any opposition. For him to take four wickets on debut will be a huge confidence boost. There is pressure on when you debut but you could see from his face how he handled that, he took everything in his stride,” said Bairstow. “We have no doubts it will be the first of many caps, in many other formats, too,” he added. England skipper Jos Buttler said that the bowler has been on an upward curve very quickly. “He has been on an upward curve very quickly. To get him in and around international cricket, in the dressing room, making friendships, getting used to the guys and the coaching staff takes time, so you need to accelerate that. He has settled in brilliantly,” he said. Coming to the match, electing to bat first, England posted 198/4 in their 20 overs. After Will Jacks (19) and Dawid Malan (0) lost their wickets early, leaving England at 43/2, a 131-run partnership between Jonny Bairstow (86 in 60 balls, eight fours and four sixes) and Harry Brook (67 in 36 balls with five fours and five sixes) helped England come back in the match and post a big total. Ish Sodhi (2/44) was the pick of the bowlers for NZ. Mitchell Santner and Tim Southee took a wicket each. Chasing 199, NZ lost wickets at regular intervals. Tim Seifert (39 in 31 balls, four boundaries), Glenn Phillips (22 in 17 balls, with three balls) and Mark Chapman (15 in eight balls, with one four and six) were the only ones to touch two figures. Atkinson (4/20) was the pick of the bowlers for England. Adil Rashid took two wickets for 18 balls. Sam Curran, Brydon Carse, Liam Livingstone and Will Jacks took a wicket each. (ANI)","pubDate":"2023-09-02 18:30:18","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f9f172fb70881792d7963ded76075bce","title":"IND vs PAK: Gautam Gambhir Slams Virat Kohli After Shaheen Afridi Dismissal, Calls Him 'Casual'","link":"https://zeenews.india.com/cricket/ind-vs-pak-asia-cup-2023-gautam-gambhir-slams-virat-kohli-after-shaheen-afridi-dismissal-calls-him-casual-2657043.html","keywords":null,"creator":null,"video_url":null,"description":"Partnership between Ishan Kishan (82 in 81 balls, with nine fours and two sixes) and Hardik Pandya (87 in 90 balls with seven fours and a six) helped India cross 200 runs.","content":"Former India cricketer Gautam Gambhir slammed star batter Virat Kohli for his shot selection during the India vs Pakistan clash in the ongoing Asia Cup clash at Kandy in Sri Lanka. He called Kohli 'casual' for his performance against Pakistan and Shaheen Afridi. In the match against Pakistan at Kandy, Virat started off with his signature cover drive and it looked like he would play another brilliant knock against the arch-rivals. But he was soon dismissed by Shaheen Shah Afridi, whose delivery hit the stumps after an inside edge from Kohli's willow. Virat was out for just four runs in seven balls. Gambhir did not mince his words in his criticism of Virat, saying that the shot played by him was a \"nothing shot\". (Watch: 'Ram Siya Ram' Song Played During India vs Pakistan Clash In Kandy, Video Goes Viral) \"That was a nothing shot, neither forward, neither back. I think was a bit casual. That is what you get when you play someone like Shaheen Afridi. You do not know whether to go forward or back,\" Gambhir said in commentary on Star Sports. Pakistan's legendary bowler Waqr Younis however felt Virat was unlucky. \"Kohli was a touch unlucky. Inside edge, the ball did not come on to the bat and maybe even kept a bit low. But credit to Shaheen Shah Afridi for altering his length,\" he said. Matthew Hayden, the legendary Australian opener seemed to agree with Hayden. \"Yeah, inside edge onto the stumps, could have got anywhere,\" he said. The group stage match between India and Pakistan has been called off due to rain, with both teams sharing one point each. With this, Pakistan has secured a total of three points in two matches. They had got two points previously after winning their first match against Nepal. They have qualified for the Super Four stage. India has one point now and they must beat Nepal in their next match on September 4 to move to the Super Four stage. Coming to the match, India elected to bat first and posted 266/10 in 48.5 overs. India struggled to take on the pace duo of Shaheen and Haris Rauf, with Shaheen getting skipper Rohit Sharma (11) and Virat Kohli (4) and Haris getting Shreyas Iyer (14) and Shubman Gill (10). India was reduced to 66/4. Then a 138-run partnership between Ishan Kishan (82 in 81 balls, with nine fours and two sixes) and Hardik Pandya (87 in 90 balls with seven fours and a six) helped India cross 200 runs. Then, contributions from Ravindra Jadeja (14) and Jasprit Bumrah (16) helped India cross the 250-run mark. Shaheen (4/35) was the pick of the bowlers for Pakistan. Naseem Shah (3/36) and Haris Rauf (3/58) also bowled well for Pakistan. (With ANI inputs)","pubDate":"2023-09-02 18:24:00","image_url":null,"source_id":"zeenews","source_priority":5319,"country":["india"],"category":["sports"],"language":"english"}]}