{"newsArray":[{"title":"Challengers to take on Dynamites in final today","link":"https://www.nation.com.pk/04-Jun-2023/challengers-to-take-on-dynamites-in-final-today","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The stage is set for an exciting finale as Sidra Amin-led Dynamites take on Omaima Sohail-led Challengers in the 45-over final of the Pakistan Cup Women’s Cricket Tournament 2022-23 that will be played at the State Bank Stadium, Karachi.","content":"LAHORE-The stage is set for an exciting finale as Sidra Amin-led Dynamites take on Omaima Sohail-led Challengers in the 45-over final of the Pakistan Cup Women’s Cricket Tournament 2022-23 that will be played at the State Bank Stadium, Karachi. The toss will take place at 0830 PKT, while the first ball will be bowled at 0900 PKT. Both sides met in the final of the one-day tournament before on 20 February 2018, when Dynamites overcame Challengers by 190 runs at the Multan Cricket Stadium. The victors of the final this year will pocket PKR1million along with the silverware. The losing team will end up taking PKR500,000. The player of the match will earn PKR20,000 and the player of the tournament will get PKR50,000. Before Sunday’s final, both sides had met each other twice in the one-day phase of the tournament. Omaima Sohail, captain of Challengers, said: “We had a thrilling victory over Dynamites in a close match earlier, but we know that the final is a different ball game altogether. We can’t rely on past results alone. It’s a new challenge, and we are fully prepared to handle the pressure and give our best performance. “The final presents us with a fantastic opportunity to showcase our skills and claim the trophy. We have the talent and determination within our team, and we’ll look to carry forward the momentum against Dynamites in this crucial match.” Sidra Amin, captain of Dynamites, said: “In the final, it all comes down to executing the basics and playing smart cricket. We need to stay calm, make wise decisions, and support each other as a team. “Although we’ll miss the presence of Bismah Maroof, but it’s an opportunity for the other players to step up and shoulder the responsibility. We have a talented squad, and I believe in their abilities to deliver on the big stage. “The two teams have faced each other twice in this one-day phase, and the results have been evenly split with one win apiece. It just goes to show that it’s going to be a tightly contested final, and we are fully prepared for the challenge.”","pubDate":"2023-06-03 21:49:32","image_url":"https://www.nation.com.pk/print_images/large/2023-06-04/challengers-to-take-on-dynamites-in-final-today-1685828965-8170.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ireland star protects teammate in show of selflessness during humbling England defeat","link":"https://www.mirror.co.uk/sport/cricket/ireland-england-andy-mcbrine-mccollum-30149437","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"Andy McBrine missed out on a hundred in Ireland's Test match against England after urging opener James McCollum not to try and bat again after severely injuring his ankle","content":"Ireland all-rounder Andy McBrine was left stranded just 14 runs short of a Test match century against England at Lord's when number 11 Graham Hume was bowled by Stuart Broad . And he sacrificed the opportunity to reach the landmark by urging opener James McCollum, who had been forced to retire hurt after suffering a severe ankle injury, not to try and bat again for the sake of his health. England won the Test, which is a precursor to their highly-anticipated Ashes clash against Australia , by 10 wickets after bowling Ireland out for just 172 in their first innings and then declaring on 524-4 after Ben Duckett smashed 182 and Ollie Pope scored 205. However, Ireland showed great fight and determination in their second innings to force England to bat again, with Harry Tector, Mark Adair and McBrine all scoring half-centuries. McBrine and Adair shared an excellent 163-run partnership, but both missed out on getting their names on the honours board. England squad confirmed for first two Ashes Tests after Ben Stokes injury concern ECB chief rejects Hundred criticism and insists it's going to be made \"bigger and better\" Adair was caught behind of Matthew Potts for 88, while McBrine was left stranded on 86 after insisting McCollum did not risk making his injury worse by trying to help him reach his hundred. Speaking after the game, captain Andy Balbirnie revealed the only way McCollum would have attempted to bat again was if McBrine was \"one hit away\" from scoring Ireland's fifth Test century. \"He had the pads on, he had the boot on, it was all a bit chaotic in there,\" Balbirnie said. \"Andy actually came in at tea and said he doesn't want him to bat. They're good mates and he [McCollum] is really sore. \"He really didn't want him to hobble out on the boot, but it was eventually agreed that if it was one hit away, that he would go out, and just hold up an end. And so it was chaos. He came out on the balcony with the crutches at tea-time and a couple of members looked over and couldn't really believe what they were seeing. Ireland opener James McCollum suffered a severe ankle injury while batting ( Image: Gareth Copley/Getty Images) \"It was quite entertaining. If the shoe was on the other foot, if you'll pardon the pun, I think Andy would have gone out for Prince [McCollum]. But it wasn't to be. In the end it didn't really matter, but it was fairly chaotic at tea.\" After Broad claimed the final Ireland wicket, England needed just four balls to wrap up victory with Zak Crawley smashing Adair for three boundaries. And England skipper Ben Stokes felt the game was a valuable learning experience for his side ahead of the Ashes. \"I think it gives us a good insight into the conditions and what we might get against Australia,\" he told BBC Test Match Special. \"It was pretty evident that even as we got so far ahead in the game, we then saw the pitch really flatten out and it became harder to create chances, so the way we pressed the game forward by scoring quickly bought us some more time.\" Read More Stuart Broad sends timely Ashes message with vintage England performance Read More Josh Tongue family friend nets £50k from England debut after unlikely bet 14 years ago Read More England cricketers held up by Just Stop Oil protest on way to Lord's for Ireland Test Read More Ben Stokes copies John Terry as he vows \"anything is possible\" ahead of Ashes battle Read More England captain Ben Stokes issues Ashes warning to Australia with 2019 reminder","pubDate":"2023-06-03 21:18:49","image_url":"https://i2-prod.mirror.co.uk/incoming/article30149452.ece/ALTERNATES/s615/0_jpg.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England down gutsy Ireland as debutant Josh Tongue takes five-wicket haul on Test debut","link":"https://www.foxsports.com.au/cricket/england-down-gutsy-ireland-as-debutant-josh-tongue-takes-fivewicket-haul-on-test-debut/news-story/01a442f9fee4f13ae4f64f73b7c347af","keywords":null,"creator":null,"video_url":null,"description":"Debutant fast bowler Josh Tongue marked his call-up into the Ashes squad with a five-wicket haul as England beat Ireland by ten wickets inside three days at Lord’s but only after a record partnership of 163 between tailenders Mark Adair and Andy McBrine.","content":"Debutant fast bowler Josh Tongue marked his call-up into the Ashes squad with a five-wicket haul as England beat Ireland by ten wickets inside three days at Lord’s but only after a record partnership of 163 between tailenders Mark Adair and Andy McBrine. England were well-placed for an innings win when Ireland started the day needing 255 more runs to make Ben Stokes’ men bat again. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! But Ireland, handicapped by the absence of injured opener James McCollum, kept England at bay while Harry Tector (51) and Lorcan Tucker helped add 118 runs in the morning session for the loss of just three wickets. Ireland, yet to win any of their seven Tests, then ran riot during a record Ireland stand between the seventh-wicket duo of McBrine (86 not out) and Adair (88). Fast bowler Adair, whose previous highest Test score was 32 against Bangladesh in Mirpur in April, went to fifty with a four off Stuart Broad. Left-hander McBrine’s fifty included 10 boundaries, with Broad and Leach taking the brunt of the assault. But number nine Adair was eventually bounced out by Matthew Potts for a 76-ball 88 that included 12 fours and two sixes. Ireland were effectively nine wickets down when Fionn Hand became Tongue’s fifth victim and his exit meant England were able to extend the afternoon session by 30 minutes in a bid to force victory before tea. England were denied an innings win, however, when tailender Graham Hume hit two fours off successive deliveries from part-time off-spinner Joe Root – shots greeted by huge cheers from a sun-drenched crowd. Josh Tongue of England. Photo by Gareth Copley/Getty Images Source: Getty Images With McBrine 85 not out at tea, the question was whether Hume could help get his partner to a hundred and a coveted place on the Lord’s honours board. But McBrine was left stranded when Hume was bowled by Broad, leading the attack in the absence of the rested James Anderson and Ollie Robinson. Zak Crawley then made short work of a victory target of 11 with three fours in four balls from Adair. “I thought Ireland came out and showed grit and determination,” said England captain Stokes at the presentation ceremony. “It (the pitch) got flatter as it went on. Trying to take the game on in our own way allowed us to potentially bowl them out without batting again.” Ireland skipper Andrew Balbirnie praised a side with minimal first-class experience for the resilience they showed Saturday. “The character is not in doubt, we’ve got a tough group,” he said. “Test cricket is very raw to us, yesterday was a tough day but to come back and make England bat again was a small win.” He added: “We’re learning on the job and we’ve got to learn quickly. Hopefully next time we’ll show the benefit.” Warner announces retirement plans | 00:34 Victory meant England had now won 11 of their 13 Tests under Stokes – who didn’t bat or bowl in this match – and coach Brendon McCullum. England want to protect the all-rounder’s fitness ahead of the Ashes opener at Edgbaston on June 16, while still benefiting from his leadership skills. But there was a worrying moment when Stokes, battling a longstanding knee injury, appeared to jar his leg when catching Curtis Campher on Saturday. “I just landed on it quite awkwardly,” Stokes told the BBC. He added: “I wouldn’t have bowled in this match anyway, unless everyone else went down. “I’m happy with it, so I’ll just keep building it up now before Edgbaston. I am definitely on course to bowl in the first Test.” England’s win was built on an imposing first-innings total of 4-524 declared featuring player of the match Ollie Pope’s 205 and Ben Duckett’s 182. “Batting at three is a big role in the team but I feel good about my game and nothing needs to change because it’s an Ashes series,” said player-of-the-match Pope.","pubDate":"2023-06-03 21:03:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jack Redshaw stars as visitors Scarborough CC 1sts edge thriller at Stamford Bridge​","link":"https://www.thescarboroughnews.co.uk/sport/cricket/jack-redshaw-stars-as-visitors-scarborough-cc-1sts-edge-thriller-at-stamford-bridge-4168703","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"​Scarborough CC 1sts edged to a sensational two-wicket victory on the road at Stamford Bridge in the Yorkshire Premier League North Premier on Saturday.","content":"Aminda Weerasooriya bowled beautifully to claim 4-40 in Scarborough CC 2nds win at home to Hornsea. PHOTOS BY SIMON DOBSON The hosts won the toss and elected to bat but found all-rounder Jack Redshaw in scintillating form, writes Simon Dobson . The youngster, who has shown immense promise during the early part of the campaign, ran riot through the Bridge batting line-up, claiming 4-8 in his opening seven-over spell, despite 31 from Martyn Woodliffe. Advertisement Hide Ad Advertisement Hide Ad Dom Rhodes (28) and Denson Narayan, who hit a rapid 56 (39 balls), led the counter attack, but Redshaw returned to claim remarkable figures of 6-13 from 9.2 overs. Zain Maqsood made an early breakthrough and took two catches. Most Popular 1 Jack Redshaw stars as visitors Scarborough CC 1sts edge thriller at Stamford Bridge​ 2 ​Scarborough Paragon Cycling Club celebrate reaching 70-year landmark Tristan Van Schalkwyk also pocketed 2-33 as the home side were dismissed for 168. Rob Pinder (22) and Redshaw opened the response with an opening stand of 77. Prince Bedi was promoted to number three and started well, but Redshaw fell for a superb 61 (68 balls). The hosts weren’t finished and came back to put the game in the balance with the dismissal of Bedi, stumped for 34 from 63 balls and left Boro on 128-5. Dave Chaplin was the main threat as he claimed 4-34. Wicketkeeper Dan Artley sparkled with the bat, hitting a superb 95. Advertisement Hide Ad Advertisement Hide Ad Clarke Doughney and Tom Bussey added vital runs, but the visitors still required 13 to win with just 2 wickets remaining. Skipper Ben Gill had remained steadfast as he was joined by number 10 Corey Hart. But this new look Scarborough side is starting to show resolve, following in their captain's image. Hart took strike in the 44th over and proceeded to hit three boundaries to secure the win to finish unbeaten on 12, with Gill remaining 7 not out from 27 balls. Charlie Hopper took three wickets in the home win for the 2nds. Advertisement Hide Ad Advertisement Hide Ad Scarborough remain in eleventh place, but two wins from their last three matches highlights the progress and development of this new team. Result : Scarborough 169-8 (Jack Redshaw 61, Prince Bedi 34, Rob Pinder 22, Dave Chaplin 4-34, Denson Narayan 2=50, Kevin Murphy 2-53) beat * Stamford Bridge 168 all out (Denson Narayan 56, Martyn Woodliffe 31, Dom Rhodes 28, Jack Redshaw 6-13, Tristan Van Schalkwyk 2-33) by 2 wkts. Scarborough 2nds produced an outstanding performance as they overcame bottom of the table Hornsea in YPLN Division One East at a sun drenched North Marine Road. Despite losing two early wickets, the visitors were aggressive in their response and Paul Clappison latched on to anything short as he raced to 49 (50 balls) before Ben Crick dismissed the opener, caught by James Denton at deep mid off. Scarborough CC 2nds surround skipper Charlie Hopper as he claims an early wicket Advertisement Hide Ad Advertisement Hide Ad Mark Battye (39) and Daniel Dales (30) continued in similar form, but the introduction of Aminda Weerasooriya proved decisive. The young leg spinner continued his recent good form by claiming a superb 4-40 from 12 overs to put Hornsea on the back foot. Charlie Hopper (3-31) returned to the attack to mop up the tail with the away side all out for 159. Crick (16) and Dan Artley put 65 on for the first wicket to provide a good foundation for the reply, with the keeper-batter racing to an entertaining 35 ball half century. Advertisement Hide Ad Advertisement Hide Ad He and Brad Milburn added 92 for the second wicket before Artley fell for a thrilling 95 (71 balls) with 12 fours and 2 sixes. Milburn finished unbeaten on 34 as the hosts secured the eight-wicket win in 22.3 overs. Result : *Scarborough 2nds 160-2 (Dan Artley 95, Brad Milburn 34*) beat Hornsea 159 all out (Paul Clappison 46, Mark Battye 39, Daniel Dales 30, Aminda Weerasooriya 4-40, Charlie Hopper 3-31) by 8 wkts. Related topics: Ben Crick Stamford Bridge","pubDate":"2023-06-03 20:26:04","image_url":"https://www.thescarboroughnews.co.uk/webimg/b25lY21zOjczMGRlNjJiLWIzYjUtNGUyNC05ZDEyLTE5OWVkZDNlMDgyMzoyNjViMjU3NS00OGNiLTQwODUtOWEyMy0xYTZjZGViYmYzODQ=.jpg?width=1200&auto=webp","source_id":"thescarboroughnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Elliot Hatton hits superb ton as Flixton seal win at Patrington","link":"https://www.thescarboroughnews.co.uk/sport/cricket/elliot-hatton-hits-superb-ton-as-flixton-seal-win-at-patrington-4168700","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"​Flixton got the better of hosts Patrington in a high-scoring match in the Yorkshire Premier League North Championship East on Saturday.","content":"Top Flixton batter Elliot Hatton Photo by Richard Ponter The home side won the toss and chose to bat first, writes John Boddy . Captain Ashley McKinley led the way with a highly positive 136 backed up by Ben Butler (23) and a late order 38no. by Grant Van Es leaving Patrington on a more than useful 277 all out from 50 overs. Advertisement Hide Ad Advertisement Hide Ad Pick of the Flixton bowlers were Rehaan Shyamsundar with 4 for 42 and Charlie Colley 3 for 49. The Flixton reply began steadily until Harry Walmsley (27) and Cameron Anderson (51) picked up the pace. Most Popular 1 Jack Redshaw stars as visitors Scarborough CC 1sts edge thriller at Stamford Bridge​ 2 ​Scarborough Paragon Cycling Club celebrate reaching 70-year landmark Elliot Hatton continued his fine run of form, steering the visitors home with an outstanding 107no with four overs to spare, finishing on 281 for 6. Next Saturday Flixton are at home to Woodhouse Grange 2nds. ​ Related topics: Flixton Patrington","pubDate":"2023-06-03 20:15:29","image_url":"https://www.thescarboroughnews.co.uk/webimg/b25lY21zOmFiYjBhNzQwLWFkNjktNDMxZS1hNzJiLWU0NGM2OWE4NGM4Zjo4YTMzMTJmNS03OGQxLTRjMzQtOGYxMi1jNWQyZmVkZDFhNDc=.jpg?width=1200&auto=webp","source_id":"thescarboroughnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"ऑस्ट्रेलियाई खिलाड़ी डेविड वॉर्नर को एक शब्द में बयां करते हैं","link":"https://jantaserishta.com/sports/australian-players-describe-david-warner-in-one-word-2414622","keywords":["खेल"],"creator":["Rani Sahu"],"video_url":null,"description":null,"content":"लंदन (एएनआई): ऑस्ट्रेलियाई टीम को भारत के खिलाफ विश्व टेस्ट चैम्पियनशिप (डब्ल्यूटीसी) फाइनल से पहले अपने विस्फोटक बल्लेबाज डेविड वार्नर को एक शब्द में परिभाषित करने के लिए कहा गया था। ICC ने ऑस्ट्रेलियाई खिलाड़ियों का एक वीडियो पोस्ट किया, जिसमें वार्नर को एक शब्द का जवाब दिया गया। उन्होंने इसे कैप्शन दिया \"डेविड वार्नर #Cricket #CricketReels के बारे में टीम के साथियों ने अपनी बात रखी\" मार्नस लाबुस्चगने ने वॉर्नर की तारीफ करते हुए कहा, \"उनकी सबसे पसंदीदा चीजों में से एक विकेटों के बीच दौड़ना है, मैं सिर्फ उस तीव्रता से प्यार करता हूं जो वह क्रीज पर लाते हैं।\" स्टीव स्मिथ उन्हें 'टफ' कहते हैं जबकि मिशेल स्टार्क \"प्रतिस्पर्धी\" मानते हैं। ऑस्ट्रेलियाई कप्तान पैट कमिंस को लगता है कि उनके पास \"उच्च ऊर्जा\" है। 36 वर्षीय ने 2019 के एशेज दौरे के दौरान 9.5 पर पांच टेस्ट मैचों में सिर्फ 95 रन बनाए और पिछले दो वर्षों में कई बार संघर्ष किया, केवल एक शतक दर्ज किया – पिछली गर्मियों में बॉक्सिंग डे पर उनका महाकाव्य 200 – और 15 के 18 स्कोर या 32 पारियों में कम। डब्ल्यूटीसी फाइनल के लिए भारत की टीम: रोहित शर्मा (कप्तान), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, केएस भरत (विकेटकीपर), रविचंद्रन अश्विन, रवींद्र जडेजा, अक्षर पटेल, शार्दुल ठाकुर, मो. शमी, मो. सिराज, उमेश यादव, जयदेव उनादकट, इशान किशन (wk)। ऑस्ट्रेलिया टीम: पैट कमिंस (c), स्कॉट बोलैंड, एलेक्स केरी (wk), कैमरन ग्रीन, मार्कस हैरिस, जोश हेज़लवुड, ट्रैविस हेड, जोश इंगलिस (wk), उस्मान ख्वाजा, मारनस लाबुस्चगने, नाथन लियोन, मिच मार्श, टॉड मर्फी , मैथ्यू रेनशॉ, स्टीव स्मिथ (वीसी), मिशेल स्टार्क, डेविड वार्नर। (एएनआई)","pubDate":"2023-06-03 18:25:27","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शादी के बंधन में बंधे CSK के ओपनर रुतुराज गायकवाड़, क्रिकेटर उत्कर्षा को बनाया हमसफर, देखें फोटो","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ruturaj-gaikwad-utkarsha-pawar-wedding-photos/articleshow/100732868.cms","keywords":null,"creator":null,"video_url":null,"description":"चेन्नई सुपर किंग्स (CSK) के युवा सलामी बल्लेबाज रुतुराज गायकवाड़ (Ruturaj Gaikwad) ने शादी कर ली है। 26 साल के इस खिलाड़ी ने इंस्टाग्राम पर अपने खास दिन की पहली तस्वीरें साझा की हैं। शादी की फोटो काफी तेजी से वायरल हो रही है। दाएं हाथ के बल्लेबाज रुतुराज भारतीय टीम का प्रतिनिधित्व कर चुके हैं।","content":"चेन्नई सुपर किंग्स (CSK) के युवा सलामी बल्लेबाज रुतुराज गायकवाड़ (Ruturaj Gaikwad) ने शादी कर ली है। 26 साल के इस खिलाड़ी ने इंस्टाग्राम पर अपने खास दिन की पहली तस्वीरें साझा की हैं। शादी की फोटो काफी तेजी से वायरल हो रही है। दाएं हाथ के बल्लेबाज रुतुराज भारतीय टीम का प्रतिनिधित्व कर चुके हैं।","pubDate":"2023-06-03 18:21:31","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Five-star Josh Tongue Strikes As England Down Ireland In One-Off Test","link":"https://sports.ndtv.com/cricket/five-star-josh-tongue-strikes-as-england-down-ireland-in-one-off-test-4092223","keywords":null,"creator":null,"video_url":null,"description":"Victory meant England had now won 11 of their 13 Tests under Ben Stokes -- who didn't bat or bowl in this match -- and coach Brendon McCullum.","content":"Debutant fast bowler Josh Tongue marked his call-up into the Ashes squad with a five-wicket haul as England beat Ireland by 10 wickets inside three days at Lord's but only after a record partnership of 163 between tailenders Mark Adair and Andy McBrine . England were well-placed for an innings win when Ireland started the day needing 255 more runs to make Ben Stokes 's men bat again. But Ireland, handicapped by the absence of injured opener James McCollum kept England at bay while Harry Tector (51) and Lorcan Tucker helped add 118 runs in the morning session for the loss of just three wickets. Ireland yet to win any of their seven Tests then ran riot during a record Ireland stand between the seventh-wicket duo of McBrine (86 not out) and Adair (88). Fast bowler Adair, whose previous highest Test score was 32 against Bangladesh in Mirpur in April, went to fifty with a four off Stuart Broad . Left-hander McBrine's fifty included 10 boundaries, with Broad and Leach taking the brunt of the assault. But number nine Adair was eventually bounced out by Matthew Potts for a 76-ball 88 that included 12 fours and two sixes. Ireland were effectively nine wickets down when Fionn Hand became Tongue's fifth victim and his exit meant England were able to extend the afternoon session by 30 minutes in a bid to force victory before tea. England were denied an innings win, however, when tailender Graham Hume hit two fours off successive deliveries from part-time off-spinner Joe Root -- shots greeted by huge cheers from a sun-drenched crowd. With McBrine 85 not out at tea, the question was whether Hume could help get his partner to a hundred and a coveted place on the Lord's honours board. But McBrine was left stranded when Hume was bowled by Broad, leading the attack in the absence of the rested James Anderson and Ollie Robinson . Advertisement Zak Crawley then made short work of a victory target of 11 with three fours in four balls from Adair. \"I thought Ireland came out and showed grit and determination,\" said England captain Stokes at the presentation ceremony. \"It (the pitch) got flatter as it went on. Trying to take the game on in our own way allowed us to potentially bowl them out without batting again.\" Ireland skipper Andrew Balbirnie praised a side with minimal first-class experience for the resilience they showed Saturday. \"The character is not in doubt, we've got a tough group,\" he said. \"Test cricket is very raw to us, yesterday was a tough day but to come back and make England bat again was a small win.\" He added: \"We're learning on the job and we've got to learn quickly. Hopefully next time we'll show the benefit.\" Victory meant England had now won 11 of their 13 Tests under Stokes -- who didn't bat or bowl in this match -- and coach Brendon McCullum . Stokes, battling a longstanding knee injury, neither batted nor bowled against Ireland. England want to protect the all-rounder's fitness ahead of the Ashes opener at Edgbaston on June 16, while still benefitting from his leadership skills. But there was a worrying moment when he appeared to jar his leg when catching Curtis Campher on Saturday. \"I just landed on it quite awkwardly,\" Stokes told the BBC. He added: \"I wouldn't have bowled in this match anyway, unless everyone else went down. \"I'm happy with it, so I'll just keep building it up now before Edgbaston. I am definitely on course to bowl in the first Test.\" England's win was built on an imposing first-innings total of 524-4 declared featuring player of the match Ollie Pope's 205 and Ben Duckett 's 182. \"Batting at three is a big role in the team but I feel good about my game and nothing needs to change because it's an Ashes series,\" said player-of-the-match Pope. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-03 18:03:37","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Three decades on, Warne's Gatting ball is still the one","link":"https://www.perthnow.com.au/sport/cricket/three-decades-on-warnes-gatting-ball-is-still-the-one-c-10866667","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Shane Warne's ball to dismiss Mike Gatting may not have been the finest the legspinner ever bowled, but 30 years on it remains the most influential.","content":"Has one ball ever changed the course of sporting history as much as Shane Warne's to Mike Gatting? A ball that drifted, dipped, turned, took the top of Gatting's off stump and landed the late legspinner a place in cricketing lore. Sunday marks 30 years since the game's most famous delivery. The ball of the century, as it was labelled by Sunday Times journalist Robin Marlar at the time, and has since become enshrined. Warne's ball to Gatting at Old Trafford wasn't the best of his storied 15-year Test career. It perhaps wasn't even the best ball he had bowled to that point, with his flipper to Richie Richardson at the MCG in 1992 a serious contender. But no other ball had the impact of Warne's to Gatting. In the space of an eight-step walk in and one second of drift and spin the dying art of leg spin had been revived. A generation of Australian kids wanted to bleach their hair and become slow bowlers, while an era of English batsmen were left in a decade of daze. \"A cult had appeared from nothing in the UK and I was it,\" Warne wrote in his 2018 autobiography No Spin. \"I was 23 years old and wherever I went it suddenly felt like there was a kid with ice cream on his nose, trying to bowl legspin.\" Warne himself is the first to admit the title of ball of the century was questionable. \"It was as if it was an all-time classic song: y'know, Honky Tonk Women' or 'Bohemian Rhapsody',\" Warne penned. Hit around in his first tour match in England, Warne subsequently admitted he had began to doubt himself ahead of the first Test. But as was the case so often throughout the remainder of his soap opera career, the showman knew when to best choose his moment. And no moment could be as fitting as his first ball in Test cricket in England. \"I remember letting go of the ball and it felt great. It couldn't have come out any better,\" Warne wrote. \"It happens in half a second but seems to take forever. It floats and swerves and dips. I like it, really like it. \"It pitches outside leg-stump and spins. Boy, does it spin! I like it more. \"Gatt plays half-forward, down the line of leg-stump, and misses. The ball hits the top of off. \"Momentarily the world stood still. Everyone, it seemed, was frozen in shock.\" In that moment, Warne's career had been changed forever. One of Wisden's five greatest cricketers of the 20th century was on an unstoppable path to stardom, beginning with eight wickets for the match in Manchester and 34 for the series. And in Gatting's bemused look as he trounced off the ground, a 14-year magic spell had been cast England and batters worldwide. Whether it was actually the best ball of the 20th century remains debatable. But the undeniable fact is, it didn't need to be.","pubDate":"2023-06-03 17:44:03","image_url":"https://images.perthnow.com.au/publication/C-10866667/e9c74982bd34c33456034fb05edeccfb7d01381e-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Warner unveils Sydney swansong plan","link":"https://www.news24.com/sport/Cricket/warner-unveils-sydney-swansong-plan-20230603","keywords":null,"creator":null,"video_url":null,"description":"Under-pressure Australia batsman David Warner said he wanted to finish his Test career next year with a farewell match in his hometown of Sydney.","content":"Warner was speaking in Beckenham, near London, where Australia are preparing ahead of next week's World Test Championship final against India, when he unveiled his plan to bow out of Test cricket against Pakistan at the Sydney Cricket Ground in January. Warner, 36, added he still hoped to keep playing white-ball cricket for Australia until the 2024 T20 World Cup in the West Indies and the United States. \"You've got to score runs. I've always said the (2024) World Cup would probably be my final game,\" Warner told reporters. \"I probably owe it to myself and my family - if I can score runs here and continue to play back in Australia...If I can get through this (WTC final and subsequent five-Test Ashes campaign in England) and make the Pakistan series I will definitely finish up then.\" Warner added he had suffered no major damage after being stuck in the practice nets on the same left elbow he fractured during Australia's tour of India earlier this year, an injury that meant he missed the final Two Tests. He underwent treatment by a physiotherapist on Thursday but expects to be fit for Wednesday's start of the WTC final at the Oval. \"It was sore, it got me right on the same point but from a different angle,\" said Warner. \"It went numb and I had to get it strapped, but it's fine now - a little bit sore, but lucky it didn't hit me on top.\" Warner has been a mainstay of the Australia team since making his debut against New Zealand in 2011. But the left-handed opener approaches the WTC final and ensuing Ashes with one century in his past 32 innings and a mediocre record in England. During the 2-2 drawn Ashes series in England, he averaged under 10 and seven times fell victim to paceman Stuart Broad.","pubDate":"2023-06-03 17:37:05","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Challengers to take on Dynamites in final today","link":"https://www.nation.com.pk/04-Jun-2023/challengers-to-take-on-dynamites-in-final-today","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The stage is set for an exciting finale as Sidra Amin-led Dynamites take on Omaima Sohail-led Challengers in the 45-over final of the Pakistan Cup Women’s Cricket Tournament 2022-23 that will be played at the State Bank Stadium, Karachi.","content":"LAHORE-The stage is set for an exciting finale as Sidra Amin-led Dynamites take on Omaima Sohail-led Challengers in the 45-over final of the Pakistan Cup Women’s Cricket Tournament 2022-23 that will be played at the State Bank Stadium, Karachi. The toss will take place at 0830 PKT, while the first ball will be bowled at 0900 PKT. Both sides met in the final of the one-day tournament before on 20 February 2018, when Dynamites overcame Challengers by 190 runs at the Multan Cricket Stadium. The victors of the final this year will pocket PKR1million along with the silverware. The losing team will end up taking PKR500,000. The player of the match will earn PKR20,000 and the player of the tournament will get PKR50,000. Before Sunday’s final, both sides had met each other twice in the one-day phase of the tournament. Omaima Sohail, captain of Challengers, said: “We had a thrilling victory over Dynamites in a close match earlier, but we know that the final is a different ball game altogether. We can’t rely on past results alone. It’s a new challenge, and we are fully prepared to handle the pressure and give our best performance. “The final presents us with a fantastic opportunity to showcase our skills and claim the trophy. We have the talent and determination within our team, and we’ll look to carry forward the momentum against Dynamites in this crucial match.” Sidra Amin, captain of Dynamites, said: “In the final, it all comes down to executing the basics and playing smart cricket. We need to stay calm, make wise decisions, and support each other as a team. “Although we’ll miss the presence of Bismah Maroof, but it’s an opportunity for the other players to step up and shoulder the responsibility. We have a talented squad, and I believe in their abilities to deliver on the big stage. “The two teams have faced each other twice in this one-day phase, and the results have been evenly split with one win apiece. It just goes to show that it’s going to be a tightly contested final, and we are fully prepared for the challenge.”","pubDate":"2023-06-03 21:49:32","image_url":"https://www.nation.com.pk/print_images/large/2023-06-04/challengers-to-take-on-dynamites-in-final-today-1685828965-8170.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ireland star protects teammate in show of selflessness during humbling England defeat","link":"https://www.mirror.co.uk/sport/cricket/ireland-england-andy-mcbrine-mccollum-30149437","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"Andy McBrine missed out on a hundred in Ireland's Test match against England after urging opener James McCollum not to try and bat again after severely injuring his ankle","content":"Ireland all-rounder Andy McBrine was left stranded just 14 runs short of a Test match century against England at Lord's when number 11 Graham Hume was bowled by Stuart Broad . And he sacrificed the opportunity to reach the landmark by urging opener James McCollum, who had been forced to retire hurt after suffering a severe ankle injury, not to try and bat again for the sake of his health. England won the Test, which is a precursor to their highly-anticipated Ashes clash against Australia , by 10 wickets after bowling Ireland out for just 172 in their first innings and then declaring on 524-4 after Ben Duckett smashed 182 and Ollie Pope scored 205. However, Ireland showed great fight and determination in their second innings to force England to bat again, with Harry Tector, Mark Adair and McBrine all scoring half-centuries. McBrine and Adair shared an excellent 163-run partnership, but both missed out on getting their names on the honours board. England squad confirmed for first two Ashes Tests after Ben Stokes injury concern ECB chief rejects Hundred criticism and insists it's going to be made \"bigger and better\" Adair was caught behind of Matthew Potts for 88, while McBrine was left stranded on 86 after insisting McCollum did not risk making his injury worse by trying to help him reach his hundred. Speaking after the game, captain Andy Balbirnie revealed the only way McCollum would have attempted to bat again was if McBrine was \"one hit away\" from scoring Ireland's fifth Test century. \"He had the pads on, he had the boot on, it was all a bit chaotic in there,\" Balbirnie said. \"Andy actually came in at tea and said he doesn't want him to bat. They're good mates and he [McCollum] is really sore. \"He really didn't want him to hobble out on the boot, but it was eventually agreed that if it was one hit away, that he would go out, and just hold up an end. And so it was chaos. He came out on the balcony with the crutches at tea-time and a couple of members looked over and couldn't really believe what they were seeing. Ireland opener James McCollum suffered a severe ankle injury while batting ( Image: Gareth Copley/Getty Images) \"It was quite entertaining. If the shoe was on the other foot, if you'll pardon the pun, I think Andy would have gone out for Prince [McCollum]. But it wasn't to be. In the end it didn't really matter, but it was fairly chaotic at tea.\" After Broad claimed the final Ireland wicket, England needed just four balls to wrap up victory with Zak Crawley smashing Adair for three boundaries. And England skipper Ben Stokes felt the game was a valuable learning experience for his side ahead of the Ashes. \"I think it gives us a good insight into the conditions and what we might get against Australia,\" he told BBC Test Match Special. \"It was pretty evident that even as we got so far ahead in the game, we then saw the pitch really flatten out and it became harder to create chances, so the way we pressed the game forward by scoring quickly bought us some more time.\" Read More Stuart Broad sends timely Ashes message with vintage England performance Read More Josh Tongue family friend nets £50k from England debut after unlikely bet 14 years ago Read More England cricketers held up by Just Stop Oil protest on way to Lord's for Ireland Test Read More Ben Stokes copies John Terry as he vows \"anything is possible\" ahead of Ashes battle Read More England captain Ben Stokes issues Ashes warning to Australia with 2019 reminder","pubDate":"2023-06-03 21:18:49","image_url":"https://i2-prod.mirror.co.uk/incoming/article30149452.ece/ALTERNATES/s615/0_jpg.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England down gutsy Ireland as debutant Josh Tongue takes five-wicket haul on Test debut","link":"https://www.foxsports.com.au/cricket/england-down-gutsy-ireland-as-debutant-josh-tongue-takes-fivewicket-haul-on-test-debut/news-story/01a442f9fee4f13ae4f64f73b7c347af","keywords":null,"creator":null,"video_url":null,"description":"Debutant fast bowler Josh Tongue marked his call-up into the Ashes squad with a five-wicket haul as England beat Ireland by ten wickets inside three days at Lord’s but only after a record partnership of 163 between tailenders Mark Adair and Andy McBrine.","content":"Debutant fast bowler Josh Tongue marked his call-up into the Ashes squad with a five-wicket haul as England beat Ireland by ten wickets inside three days at Lord’s but only after a record partnership of 163 between tailenders Mark Adair and Andy McBrine. England were well-placed for an innings win when Ireland started the day needing 255 more runs to make Ben Stokes’ men bat again. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! But Ireland, handicapped by the absence of injured opener James McCollum, kept England at bay while Harry Tector (51) and Lorcan Tucker helped add 118 runs in the morning session for the loss of just three wickets. Ireland, yet to win any of their seven Tests, then ran riot during a record Ireland stand between the seventh-wicket duo of McBrine (86 not out) and Adair (88). Fast bowler Adair, whose previous highest Test score was 32 against Bangladesh in Mirpur in April, went to fifty with a four off Stuart Broad. Left-hander McBrine’s fifty included 10 boundaries, with Broad and Leach taking the brunt of the assault. But number nine Adair was eventually bounced out by Matthew Potts for a 76-ball 88 that included 12 fours and two sixes. Ireland were effectively nine wickets down when Fionn Hand became Tongue’s fifth victim and his exit meant England were able to extend the afternoon session by 30 minutes in a bid to force victory before tea. England were denied an innings win, however, when tailender Graham Hume hit two fours off successive deliveries from part-time off-spinner Joe Root – shots greeted by huge cheers from a sun-drenched crowd. Josh Tongue of England. Photo by Gareth Copley/Getty Images Source: Getty Images With McBrine 85 not out at tea, the question was whether Hume could help get his partner to a hundred and a coveted place on the Lord’s honours board. But McBrine was left stranded when Hume was bowled by Broad, leading the attack in the absence of the rested James Anderson and Ollie Robinson. Zak Crawley then made short work of a victory target of 11 with three fours in four balls from Adair. “I thought Ireland came out and showed grit and determination,” said England captain Stokes at the presentation ceremony. “It (the pitch) got flatter as it went on. Trying to take the game on in our own way allowed us to potentially bowl them out without batting again.” Ireland skipper Andrew Balbirnie praised a side with minimal first-class experience for the resilience they showed Saturday. “The character is not in doubt, we’ve got a tough group,” he said. “Test cricket is very raw to us, yesterday was a tough day but to come back and make England bat again was a small win.” He added: “We’re learning on the job and we’ve got to learn quickly. Hopefully next time we’ll show the benefit.” Warner announces retirement plans | 00:34 Victory meant England had now won 11 of their 13 Tests under Stokes – who didn’t bat or bowl in this match – and coach Brendon McCullum. England want to protect the all-rounder’s fitness ahead of the Ashes opener at Edgbaston on June 16, while still benefiting from his leadership skills. But there was a worrying moment when Stokes, battling a longstanding knee injury, appeared to jar his leg when catching Curtis Campher on Saturday. “I just landed on it quite awkwardly,” Stokes told the BBC. He added: “I wouldn’t have bowled in this match anyway, unless everyone else went down. “I’m happy with it, so I’ll just keep building it up now before Edgbaston. I am definitely on course to bowl in the first Test.” England’s win was built on an imposing first-innings total of 4-524 declared featuring player of the match Ollie Pope’s 205 and Ben Duckett’s 182. “Batting at three is a big role in the team but I feel good about my game and nothing needs to change because it’s an Ashes series,” said player-of-the-match Pope.","pubDate":"2023-06-03 21:03:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jack Redshaw stars as visitors Scarborough CC 1sts edge thriller at Stamford Bridge​","link":"https://www.thescarboroughnews.co.uk/sport/cricket/jack-redshaw-stars-as-visitors-scarborough-cc-1sts-edge-thriller-at-stamford-bridge-4168703","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"​Scarborough CC 1sts edged to a sensational two-wicket victory on the road at Stamford Bridge in the Yorkshire Premier League North Premier on Saturday.","content":"Aminda Weerasooriya bowled beautifully to claim 4-40 in Scarborough CC 2nds win at home to Hornsea. PHOTOS BY SIMON DOBSON The hosts won the toss and elected to bat but found all-rounder Jack Redshaw in scintillating form, writes Simon Dobson . The youngster, who has shown immense promise during the early part of the campaign, ran riot through the Bridge batting line-up, claiming 4-8 in his opening seven-over spell, despite 31 from Martyn Woodliffe. Advertisement Hide Ad Advertisement Hide Ad Dom Rhodes (28) and Denson Narayan, who hit a rapid 56 (39 balls), led the counter attack, but Redshaw returned to claim remarkable figures of 6-13 from 9.2 overs. Zain Maqsood made an early breakthrough and took two catches. Most Popular 1 Jack Redshaw stars as visitors Scarborough CC 1sts edge thriller at Stamford Bridge​ 2 ​Scarborough Paragon Cycling Club celebrate reaching 70-year landmark Tristan Van Schalkwyk also pocketed 2-33 as the home side were dismissed for 168. Rob Pinder (22) and Redshaw opened the response with an opening stand of 77. Prince Bedi was promoted to number three and started well, but Redshaw fell for a superb 61 (68 balls). The hosts weren’t finished and came back to put the game in the balance with the dismissal of Bedi, stumped for 34 from 63 balls and left Boro on 128-5. Dave Chaplin was the main threat as he claimed 4-34. Wicketkeeper Dan Artley sparkled with the bat, hitting a superb 95. Advertisement Hide Ad Advertisement Hide Ad Clarke Doughney and Tom Bussey added vital runs, but the visitors still required 13 to win with just 2 wickets remaining. Skipper Ben Gill had remained steadfast as he was joined by number 10 Corey Hart. But this new look Scarborough side is starting to show resolve, following in their captain's image. Hart took strike in the 44th over and proceeded to hit three boundaries to secure the win to finish unbeaten on 12, with Gill remaining 7 not out from 27 balls. Charlie Hopper took three wickets in the home win for the 2nds. Advertisement Hide Ad Advertisement Hide Ad Scarborough remain in eleventh place, but two wins from their last three matches highlights the progress and development of this new team. Result : Scarborough 169-8 (Jack Redshaw 61, Prince Bedi 34, Rob Pinder 22, Dave Chaplin 4-34, Denson Narayan 2=50, Kevin Murphy 2-53) beat * Stamford Bridge 168 all out (Denson Narayan 56, Martyn Woodliffe 31, Dom Rhodes 28, Jack Redshaw 6-13, Tristan Van Schalkwyk 2-33) by 2 wkts. Scarborough 2nds produced an outstanding performance as they overcame bottom of the table Hornsea in YPLN Division One East at a sun drenched North Marine Road. Despite losing two early wickets, the visitors were aggressive in their response and Paul Clappison latched on to anything short as he raced to 49 (50 balls) before Ben Crick dismissed the opener, caught by James Denton at deep mid off. Scarborough CC 2nds surround skipper Charlie Hopper as he claims an early wicket Advertisement Hide Ad Advertisement Hide Ad Mark Battye (39) and Daniel Dales (30) continued in similar form, but the introduction of Aminda Weerasooriya proved decisive. The young leg spinner continued his recent good form by claiming a superb 4-40 from 12 overs to put Hornsea on the back foot. Charlie Hopper (3-31) returned to the attack to mop up the tail with the away side all out for 159. Crick (16) and Dan Artley put 65 on for the first wicket to provide a good foundation for the reply, with the keeper-batter racing to an entertaining 35 ball half century. Advertisement Hide Ad Advertisement Hide Ad He and Brad Milburn added 92 for the second wicket before Artley fell for a thrilling 95 (71 balls) with 12 fours and 2 sixes. Milburn finished unbeaten on 34 as the hosts secured the eight-wicket win in 22.3 overs. Result : *Scarborough 2nds 160-2 (Dan Artley 95, Brad Milburn 34*) beat Hornsea 159 all out (Paul Clappison 46, Mark Battye 39, Daniel Dales 30, Aminda Weerasooriya 4-40, Charlie Hopper 3-31) by 8 wkts. Related topics: Ben Crick Stamford Bridge","pubDate":"2023-06-03 20:26:04","image_url":"https://www.thescarboroughnews.co.uk/webimg/b25lY21zOjczMGRlNjJiLWIzYjUtNGUyNC05ZDEyLTE5OWVkZDNlMDgyMzoyNjViMjU3NS00OGNiLTQwODUtOWEyMy0xYTZjZGViYmYzODQ=.jpg?width=1200&auto=webp","source_id":"thescarboroughnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Elliot Hatton hits superb ton as Flixton seal win at Patrington","link":"https://www.thescarboroughnews.co.uk/sport/cricket/elliot-hatton-hits-superb-ton-as-flixton-seal-win-at-patrington-4168700","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"​Flixton got the better of hosts Patrington in a high-scoring match in the Yorkshire Premier League North Championship East on Saturday.","content":"Top Flixton batter Elliot Hatton Photo by Richard Ponter The home side won the toss and chose to bat first, writes John Boddy . Captain Ashley McKinley led the way with a highly positive 136 backed up by Ben Butler (23) and a late order 38no. by Grant Van Es leaving Patrington on a more than useful 277 all out from 50 overs. Advertisement Hide Ad Advertisement Hide Ad Pick of the Flixton bowlers were Rehaan Shyamsundar with 4 for 42 and Charlie Colley 3 for 49. The Flixton reply began steadily until Harry Walmsley (27) and Cameron Anderson (51) picked up the pace. Most Popular 1 Jack Redshaw stars as visitors Scarborough CC 1sts edge thriller at Stamford Bridge​ 2 ​Scarborough Paragon Cycling Club celebrate reaching 70-year landmark Elliot Hatton continued his fine run of form, steering the visitors home with an outstanding 107no with four overs to spare, finishing on 281 for 6. Next Saturday Flixton are at home to Woodhouse Grange 2nds. ​ Related topics: Flixton Patrington","pubDate":"2023-06-03 20:15:29","image_url":"https://www.thescarboroughnews.co.uk/webimg/b25lY21zOmFiYjBhNzQwLWFkNjktNDMxZS1hNzJiLWU0NGM2OWE4NGM4Zjo4YTMzMTJmNS03OGQxLTRjMzQtOGYxMi1jNWQyZmVkZDFhNDc=.jpg?width=1200&auto=webp","source_id":"thescarboroughnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"ऑस्ट्रेलियाई खिलाड़ी डेविड वॉर्नर को एक शब्द में बयां करते हैं","link":"https://jantaserishta.com/sports/australian-players-describe-david-warner-in-one-word-2414622","keywords":["खेल"],"creator":["Rani Sahu"],"video_url":null,"description":null,"content":"लंदन (एएनआई): ऑस्ट्रेलियाई टीम को भारत के खिलाफ विश्व टेस्ट चैम्पियनशिप (डब्ल्यूटीसी) फाइनल से पहले अपने विस्फोटक बल्लेबाज डेविड वार्नर को एक शब्द में परिभाषित करने के लिए कहा गया था। ICC ने ऑस्ट्रेलियाई खिलाड़ियों का एक वीडियो पोस्ट किया, जिसमें वार्नर को एक शब्द का जवाब दिया गया। उन्होंने इसे कैप्शन दिया \"डेविड वार्नर #Cricket #CricketReels के बारे में टीम के साथियों ने अपनी बात रखी\" मार्नस लाबुस्चगने ने वॉर्नर की तारीफ करते हुए कहा, \"उनकी सबसे पसंदीदा चीजों में से एक विकेटों के बीच दौड़ना है, मैं सिर्फ उस तीव्रता से प्यार करता हूं जो वह क्रीज पर लाते हैं।\" स्टीव स्मिथ उन्हें 'टफ' कहते हैं जबकि मिशेल स्टार्क \"प्रतिस्पर्धी\" मानते हैं। ऑस्ट्रेलियाई कप्तान पैट कमिंस को लगता है कि उनके पास \"उच्च ऊर्जा\" है। 36 वर्षीय ने 2019 के एशेज दौरे के दौरान 9.5 पर पांच टेस्ट मैचों में सिर्फ 95 रन बनाए और पिछले दो वर्षों में कई बार संघर्ष किया, केवल एक शतक दर्ज किया – पिछली गर्मियों में बॉक्सिंग डे पर उनका महाकाव्य 200 – और 15 के 18 स्कोर या 32 पारियों में कम। डब्ल्यूटीसी फाइनल के लिए भारत की टीम: रोहित शर्मा (कप्तान), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, केएस भरत (विकेटकीपर), रविचंद्रन अश्विन, रवींद्र जडेजा, अक्षर पटेल, शार्दुल ठाकुर, मो. शमी, मो. सिराज, उमेश यादव, जयदेव उनादकट, इशान किशन (wk)। ऑस्ट्रेलिया टीम: पैट कमिंस (c), स्कॉट बोलैंड, एलेक्स केरी (wk), कैमरन ग्रीन, मार्कस हैरिस, जोश हेज़लवुड, ट्रैविस हेड, जोश इंगलिस (wk), उस्मान ख्वाजा, मारनस लाबुस्चगने, नाथन लियोन, मिच मार्श, टॉड मर्फी , मैथ्यू रेनशॉ, स्टीव स्मिथ (वीसी), मिशेल स्टार्क, डेविड वार्नर। (एएनआई)","pubDate":"2023-06-03 18:25:27","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शादी के बंधन में बंधे CSK के ओपनर रुतुराज गायकवाड़, क्रिकेटर उत्कर्षा को बनाया हमसफर, देखें फोटो","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ruturaj-gaikwad-utkarsha-pawar-wedding-photos/articleshow/100732868.cms","keywords":null,"creator":null,"video_url":null,"description":"चेन्नई सुपर किंग्स (CSK) के युवा सलामी बल्लेबाज रुतुराज गायकवाड़ (Ruturaj Gaikwad) ने शादी कर ली है। 26 साल के इस खिलाड़ी ने इंस्टाग्राम पर अपने खास दिन की पहली तस्वीरें साझा की हैं। शादी की फोटो काफी तेजी से वायरल हो रही है। दाएं हाथ के बल्लेबाज रुतुराज भारतीय टीम का प्रतिनिधित्व कर चुके हैं।","content":"चेन्नई सुपर किंग्स (CSK) के युवा सलामी बल्लेबाज रुतुराज गायकवाड़ (Ruturaj Gaikwad) ने शादी कर ली है। 26 साल के इस खिलाड़ी ने इंस्टाग्राम पर अपने खास दिन की पहली तस्वीरें साझा की हैं। शादी की फोटो काफी तेजी से वायरल हो रही है। दाएं हाथ के बल्लेबाज रुतुराज भारतीय टीम का प्रतिनिधित्व कर चुके हैं।","pubDate":"2023-06-03 18:21:31","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Five-star Josh Tongue Strikes As England Down Ireland In One-Off Test","link":"https://sports.ndtv.com/cricket/five-star-josh-tongue-strikes-as-england-down-ireland-in-one-off-test-4092223","keywords":null,"creator":null,"video_url":null,"description":"Victory meant England had now won 11 of their 13 Tests under Ben Stokes -- who didn't bat or bowl in this match -- and coach Brendon McCullum.","content":"Debutant fast bowler Josh Tongue marked his call-up into the Ashes squad with a five-wicket haul as England beat Ireland by 10 wickets inside three days at Lord's but only after a record partnership of 163 between tailenders Mark Adair and Andy McBrine . England were well-placed for an innings win when Ireland started the day needing 255 more runs to make Ben Stokes 's men bat again. But Ireland, handicapped by the absence of injured opener James McCollum kept England at bay while Harry Tector (51) and Lorcan Tucker helped add 118 runs in the morning session for the loss of just three wickets. Ireland yet to win any of their seven Tests then ran riot during a record Ireland stand between the seventh-wicket duo of McBrine (86 not out) and Adair (88). Fast bowler Adair, whose previous highest Test score was 32 against Bangladesh in Mirpur in April, went to fifty with a four off Stuart Broad . Left-hander McBrine's fifty included 10 boundaries, with Broad and Leach taking the brunt of the assault. But number nine Adair was eventually bounced out by Matthew Potts for a 76-ball 88 that included 12 fours and two sixes. Ireland were effectively nine wickets down when Fionn Hand became Tongue's fifth victim and his exit meant England were able to extend the afternoon session by 30 minutes in a bid to force victory before tea. England were denied an innings win, however, when tailender Graham Hume hit two fours off successive deliveries from part-time off-spinner Joe Root -- shots greeted by huge cheers from a sun-drenched crowd. With McBrine 85 not out at tea, the question was whether Hume could help get his partner to a hundred and a coveted place on the Lord's honours board. But McBrine was left stranded when Hume was bowled by Broad, leading the attack in the absence of the rested James Anderson and Ollie Robinson . Advertisement Zak Crawley then made short work of a victory target of 11 with three fours in four balls from Adair. \"I thought Ireland came out and showed grit and determination,\" said England captain Stokes at the presentation ceremony. \"It (the pitch) got flatter as it went on. Trying to take the game on in our own way allowed us to potentially bowl them out without batting again.\" Ireland skipper Andrew Balbirnie praised a side with minimal first-class experience for the resilience they showed Saturday. \"The character is not in doubt, we've got a tough group,\" he said. \"Test cricket is very raw to us, yesterday was a tough day but to come back and make England bat again was a small win.\" He added: \"We're learning on the job and we've got to learn quickly. Hopefully next time we'll show the benefit.\" Victory meant England had now won 11 of their 13 Tests under Stokes -- who didn't bat or bowl in this match -- and coach Brendon McCullum . Stokes, battling a longstanding knee injury, neither batted nor bowled against Ireland. England want to protect the all-rounder's fitness ahead of the Ashes opener at Edgbaston on June 16, while still benefitting from his leadership skills. But there was a worrying moment when he appeared to jar his leg when catching Curtis Campher on Saturday. \"I just landed on it quite awkwardly,\" Stokes told the BBC. He added: \"I wouldn't have bowled in this match anyway, unless everyone else went down. \"I'm happy with it, so I'll just keep building it up now before Edgbaston. I am definitely on course to bowl in the first Test.\" England's win was built on an imposing first-innings total of 524-4 declared featuring player of the match Ollie Pope's 205 and Ben Duckett 's 182. \"Batting at three is a big role in the team but I feel good about my game and nothing needs to change because it's an Ashes series,\" said player-of-the-match Pope. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-03 18:03:37","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Three decades on, Warne's Gatting ball is still the one","link":"https://www.perthnow.com.au/sport/cricket/three-decades-on-warnes-gatting-ball-is-still-the-one-c-10866667","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Shane Warne's ball to dismiss Mike Gatting may not have been the finest the legspinner ever bowled, but 30 years on it remains the most influential.","content":"Has one ball ever changed the course of sporting history as much as Shane Warne's to Mike Gatting? A ball that drifted, dipped, turned, took the top of Gatting's off stump and landed the late legspinner a place in cricketing lore. Sunday marks 30 years since the game's most famous delivery. The ball of the century, as it was labelled by Sunday Times journalist Robin Marlar at the time, and has since become enshrined. Warne's ball to Gatting at Old Trafford wasn't the best of his storied 15-year Test career. It perhaps wasn't even the best ball he had bowled to that point, with his flipper to Richie Richardson at the MCG in 1992 a serious contender. But no other ball had the impact of Warne's to Gatting. In the space of an eight-step walk in and one second of drift and spin the dying art of leg spin had been revived. A generation of Australian kids wanted to bleach their hair and become slow bowlers, while an era of English batsmen were left in a decade of daze. \"A cult had appeared from nothing in the UK and I was it,\" Warne wrote in his 2018 autobiography No Spin. \"I was 23 years old and wherever I went it suddenly felt like there was a kid with ice cream on his nose, trying to bowl legspin.\" Warne himself is the first to admit the title of ball of the century was questionable. \"It was as if it was an all-time classic song: y'know, Honky Tonk Women' or 'Bohemian Rhapsody',\" Warne penned. Hit around in his first tour match in England, Warne subsequently admitted he had began to doubt himself ahead of the first Test. But as was the case so often throughout the remainder of his soap opera career, the showman knew when to best choose his moment. And no moment could be as fitting as his first ball in Test cricket in England. \"I remember letting go of the ball and it felt great. It couldn't have come out any better,\" Warne wrote. \"It happens in half a second but seems to take forever. It floats and swerves and dips. I like it, really like it. \"It pitches outside leg-stump and spins. Boy, does it spin! I like it more. \"Gatt plays half-forward, down the line of leg-stump, and misses. The ball hits the top of off. \"Momentarily the world stood still. Everyone, it seemed, was frozen in shock.\" In that moment, Warne's career had been changed forever. One of Wisden's five greatest cricketers of the 20th century was on an unstoppable path to stardom, beginning with eight wickets for the match in Manchester and 34 for the series. And in Gatting's bemused look as he trounced off the ground, a 14-year magic spell had been cast England and batters worldwide. Whether it was actually the best ball of the 20th century remains debatable. But the undeniable fact is, it didn't need to be.","pubDate":"2023-06-03 17:44:03","image_url":"https://images.perthnow.com.au/publication/C-10866667/e9c74982bd34c33456034fb05edeccfb7d01381e-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Warner unveils Sydney swansong plan","link":"https://www.news24.com/sport/Cricket/warner-unveils-sydney-swansong-plan-20230603","keywords":null,"creator":null,"video_url":null,"description":"Under-pressure Australia batsman David Warner said he wanted to finish his Test career next year with a farewell match in his hometown of Sydney.","content":"Warner was speaking in Beckenham, near London, where Australia are preparing ahead of next week's World Test Championship final against India, when he unveiled his plan to bow out of Test cricket against Pakistan at the Sydney Cricket Ground in January. Warner, 36, added he still hoped to keep playing white-ball cricket for Australia until the 2024 T20 World Cup in the West Indies and the United States. \"You've got to score runs. I've always said the (2024) World Cup would probably be my final game,\" Warner told reporters. \"I probably owe it to myself and my family - if I can score runs here and continue to play back in Australia...If I can get through this (WTC final and subsequent five-Test Ashes campaign in England) and make the Pakistan series I will definitely finish up then.\" Warner added he had suffered no major damage after being stuck in the practice nets on the same left elbow he fractured during Australia's tour of India earlier this year, an injury that meant he missed the final Two Tests. He underwent treatment by a physiotherapist on Thursday but expects to be fit for Wednesday's start of the WTC final at the Oval. \"It was sore, it got me right on the same point but from a different angle,\" said Warner. \"It went numb and I had to get it strapped, but it's fine now - a little bit sore, but lucky it didn't hit me on top.\" Warner has been a mainstay of the Australia team since making his debut against New Zealand in 2011. But the left-handed opener approaches the WTC final and ensuing Ashes with one century in his past 32 innings and a mediocre record in England. During the 2-2 drawn Ashes series in England, he averaged under 10 and seven times fell victim to paceman Stuart Broad.","pubDate":"2023-06-03 17:37:05","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Challengers to take on Dynamites in final today","link":"https://www.nation.com.pk/04-Jun-2023/challengers-to-take-on-dynamites-in-final-today","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-The stage is set for an exciting finale as Sidra Amin-led Dynamites take on Omaima Sohail-led Challengers in the 45-over final of the Pakistan Cup Women’s Cricket Tournament 2022-23 that will be played at the State Bank Stadium, Karachi.","content":"LAHORE-The stage is set for an exciting finale as Sidra Amin-led Dynamites take on Omaima Sohail-led Challengers in the 45-over final of the Pakistan Cup Women’s Cricket Tournament 2022-23 that will be played at the State Bank Stadium, Karachi. The toss will take place at 0830 PKT, while the first ball will be bowled at 0900 PKT. Both sides met in the final of the one-day tournament before on 20 February 2018, when Dynamites overcame Challengers by 190 runs at the Multan Cricket Stadium. The victors of the final this year will pocket PKR1million along with the silverware. The losing team will end up taking PKR500,000. The player of the match will earn PKR20,000 and the player of the tournament will get PKR50,000. Before Sunday’s final, both sides had met each other twice in the one-day phase of the tournament. Omaima Sohail, captain of Challengers, said: “We had a thrilling victory over Dynamites in a close match earlier, but we know that the final is a different ball game altogether. We can’t rely on past results alone. It’s a new challenge, and we are fully prepared to handle the pressure and give our best performance. “The final presents us with a fantastic opportunity to showcase our skills and claim the trophy. We have the talent and determination within our team, and we’ll look to carry forward the momentum against Dynamites in this crucial match.” Sidra Amin, captain of Dynamites, said: “In the final, it all comes down to executing the basics and playing smart cricket. We need to stay calm, make wise decisions, and support each other as a team. “Although we’ll miss the presence of Bismah Maroof, but it’s an opportunity for the other players to step up and shoulder the responsibility. We have a talented squad, and I believe in their abilities to deliver on the big stage. “The two teams have faced each other twice in this one-day phase, and the results have been evenly split with one win apiece. It just goes to show that it’s going to be a tightly contested final, and we are fully prepared for the challenge.”","pubDate":"2023-06-03 21:49:32","image_url":"https://www.nation.com.pk/print_images/large/2023-06-04/challengers-to-take-on-dynamites-in-final-today-1685828965-8170.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ireland star protects teammate in show of selflessness during humbling England defeat","link":"https://www.mirror.co.uk/sport/cricket/ireland-england-andy-mcbrine-mccollum-30149437","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"Andy McBrine missed out on a hundred in Ireland's Test match against England after urging opener James McCollum not to try and bat again after severely injuring his ankle","content":"Ireland all-rounder Andy McBrine was left stranded just 14 runs short of a Test match century against England at Lord's when number 11 Graham Hume was bowled by Stuart Broad . And he sacrificed the opportunity to reach the landmark by urging opener James McCollum, who had been forced to retire hurt after suffering a severe ankle injury, not to try and bat again for the sake of his health. England won the Test, which is a precursor to their highly-anticipated Ashes clash against Australia , by 10 wickets after bowling Ireland out for just 172 in their first innings and then declaring on 524-4 after Ben Duckett smashed 182 and Ollie Pope scored 205. However, Ireland showed great fight and determination in their second innings to force England to bat again, with Harry Tector, Mark Adair and McBrine all scoring half-centuries. McBrine and Adair shared an excellent 163-run partnership, but both missed out on getting their names on the honours board. England squad confirmed for first two Ashes Tests after Ben Stokes injury concern ECB chief rejects Hundred criticism and insists it's going to be made \"bigger and better\" Adair was caught behind of Matthew Potts for 88, while McBrine was left stranded on 86 after insisting McCollum did not risk making his injury worse by trying to help him reach his hundred. Speaking after the game, captain Andy Balbirnie revealed the only way McCollum would have attempted to bat again was if McBrine was \"one hit away\" from scoring Ireland's fifth Test century. \"He had the pads on, he had the boot on, it was all a bit chaotic in there,\" Balbirnie said. \"Andy actually came in at tea and said he doesn't want him to bat. They're good mates and he [McCollum] is really sore. \"He really didn't want him to hobble out on the boot, but it was eventually agreed that if it was one hit away, that he would go out, and just hold up an end. And so it was chaos. He came out on the balcony with the crutches at tea-time and a couple of members looked over and couldn't really believe what they were seeing. Ireland opener James McCollum suffered a severe ankle injury while batting ( Image: Gareth Copley/Getty Images) \"It was quite entertaining. If the shoe was on the other foot, if you'll pardon the pun, I think Andy would have gone out for Prince [McCollum]. But it wasn't to be. In the end it didn't really matter, but it was fairly chaotic at tea.\" After Broad claimed the final Ireland wicket, England needed just four balls to wrap up victory with Zak Crawley smashing Adair for three boundaries. And England skipper Ben Stokes felt the game was a valuable learning experience for his side ahead of the Ashes. \"I think it gives us a good insight into the conditions and what we might get against Australia,\" he told BBC Test Match Special. \"It was pretty evident that even as we got so far ahead in the game, we then saw the pitch really flatten out and it became harder to create chances, so the way we pressed the game forward by scoring quickly bought us some more time.\" Read More Stuart Broad sends timely Ashes message with vintage England performance Read More Josh Tongue family friend nets £50k from England debut after unlikely bet 14 years ago Read More England cricketers held up by Just Stop Oil protest on way to Lord's for Ireland Test Read More Ben Stokes copies John Terry as he vows \"anything is possible\" ahead of Ashes battle Read More England captain Ben Stokes issues Ashes warning to Australia with 2019 reminder","pubDate":"2023-06-03 21:18:49","image_url":"https://i2-prod.mirror.co.uk/incoming/article30149452.ece/ALTERNATES/s615/0_jpg.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England down gutsy Ireland as debutant Josh Tongue takes five-wicket haul on Test debut","link":"https://www.foxsports.com.au/cricket/england-down-gutsy-ireland-as-debutant-josh-tongue-takes-fivewicket-haul-on-test-debut/news-story/01a442f9fee4f13ae4f64f73b7c347af","keywords":null,"creator":null,"video_url":null,"description":"Debutant fast bowler Josh Tongue marked his call-up into the Ashes squad with a five-wicket haul as England beat Ireland by ten wickets inside three days at Lord’s but only after a record partnership of 163 between tailenders Mark Adair and Andy McBrine.","content":"Debutant fast bowler Josh Tongue marked his call-up into the Ashes squad with a five-wicket haul as England beat Ireland by ten wickets inside three days at Lord’s but only after a record partnership of 163 between tailenders Mark Adair and Andy McBrine. England were well-placed for an innings win when Ireland started the day needing 255 more runs to make Ben Stokes’ men bat again. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! But Ireland, handicapped by the absence of injured opener James McCollum, kept England at bay while Harry Tector (51) and Lorcan Tucker helped add 118 runs in the morning session for the loss of just three wickets. Ireland, yet to win any of their seven Tests, then ran riot during a record Ireland stand between the seventh-wicket duo of McBrine (86 not out) and Adair (88). Fast bowler Adair, whose previous highest Test score was 32 against Bangladesh in Mirpur in April, went to fifty with a four off Stuart Broad. Left-hander McBrine’s fifty included 10 boundaries, with Broad and Leach taking the brunt of the assault. But number nine Adair was eventually bounced out by Matthew Potts for a 76-ball 88 that included 12 fours and two sixes. Ireland were effectively nine wickets down when Fionn Hand became Tongue’s fifth victim and his exit meant England were able to extend the afternoon session by 30 minutes in a bid to force victory before tea. England were denied an innings win, however, when tailender Graham Hume hit two fours off successive deliveries from part-time off-spinner Joe Root – shots greeted by huge cheers from a sun-drenched crowd. Josh Tongue of England. Photo by Gareth Copley/Getty Images Source: Getty Images With McBrine 85 not out at tea, the question was whether Hume could help get his partner to a hundred and a coveted place on the Lord’s honours board. But McBrine was left stranded when Hume was bowled by Broad, leading the attack in the absence of the rested James Anderson and Ollie Robinson. Zak Crawley then made short work of a victory target of 11 with three fours in four balls from Adair. “I thought Ireland came out and showed grit and determination,” said England captain Stokes at the presentation ceremony. “It (the pitch) got flatter as it went on. Trying to take the game on in our own way allowed us to potentially bowl them out without batting again.” Ireland skipper Andrew Balbirnie praised a side with minimal first-class experience for the resilience they showed Saturday. “The character is not in doubt, we’ve got a tough group,” he said. “Test cricket is very raw to us, yesterday was a tough day but to come back and make England bat again was a small win.” He added: “We’re learning on the job and we’ve got to learn quickly. Hopefully next time we’ll show the benefit.” Warner announces retirement plans | 00:34 Victory meant England had now won 11 of their 13 Tests under Stokes – who didn’t bat or bowl in this match – and coach Brendon McCullum. England want to protect the all-rounder’s fitness ahead of the Ashes opener at Edgbaston on June 16, while still benefiting from his leadership skills. But there was a worrying moment when Stokes, battling a longstanding knee injury, appeared to jar his leg when catching Curtis Campher on Saturday. “I just landed on it quite awkwardly,” Stokes told the BBC. He added: “I wouldn’t have bowled in this match anyway, unless everyone else went down. “I’m happy with it, so I’ll just keep building it up now before Edgbaston. I am definitely on course to bowl in the first Test.” England’s win was built on an imposing first-innings total of 4-524 declared featuring player of the match Ollie Pope’s 205 and Ben Duckett’s 182. “Batting at three is a big role in the team but I feel good about my game and nothing needs to change because it’s an Ashes series,” said player-of-the-match Pope.","pubDate":"2023-06-03 21:03:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jack Redshaw stars as visitors Scarborough CC 1sts edge thriller at Stamford Bridge​","link":"https://www.thescarboroughnews.co.uk/sport/cricket/jack-redshaw-stars-as-visitors-scarborough-cc-1sts-edge-thriller-at-stamford-bridge-4168703","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"​Scarborough CC 1sts edged to a sensational two-wicket victory on the road at Stamford Bridge in the Yorkshire Premier League North Premier on Saturday.","content":"Aminda Weerasooriya bowled beautifully to claim 4-40 in Scarborough CC 2nds win at home to Hornsea. PHOTOS BY SIMON DOBSON The hosts won the toss and elected to bat but found all-rounder Jack Redshaw in scintillating form, writes Simon Dobson . The youngster, who has shown immense promise during the early part of the campaign, ran riot through the Bridge batting line-up, claiming 4-8 in his opening seven-over spell, despite 31 from Martyn Woodliffe. Advertisement Hide Ad Advertisement Hide Ad Dom Rhodes (28) and Denson Narayan, who hit a rapid 56 (39 balls), led the counter attack, but Redshaw returned to claim remarkable figures of 6-13 from 9.2 overs. Zain Maqsood made an early breakthrough and took two catches. Most Popular 1 Jack Redshaw stars as visitors Scarborough CC 1sts edge thriller at Stamford Bridge​ 2 ​Scarborough Paragon Cycling Club celebrate reaching 70-year landmark Tristan Van Schalkwyk also pocketed 2-33 as the home side were dismissed for 168. Rob Pinder (22) and Redshaw opened the response with an opening stand of 77. Prince Bedi was promoted to number three and started well, but Redshaw fell for a superb 61 (68 balls). The hosts weren’t finished and came back to put the game in the balance with the dismissal of Bedi, stumped for 34 from 63 balls and left Boro on 128-5. Dave Chaplin was the main threat as he claimed 4-34. Wicketkeeper Dan Artley sparkled with the bat, hitting a superb 95. Advertisement Hide Ad Advertisement Hide Ad Clarke Doughney and Tom Bussey added vital runs, but the visitors still required 13 to win with just 2 wickets remaining. Skipper Ben Gill had remained steadfast as he was joined by number 10 Corey Hart. But this new look Scarborough side is starting to show resolve, following in their captain's image. Hart took strike in the 44th over and proceeded to hit three boundaries to secure the win to finish unbeaten on 12, with Gill remaining 7 not out from 27 balls. Charlie Hopper took three wickets in the home win for the 2nds. Advertisement Hide Ad Advertisement Hide Ad Scarborough remain in eleventh place, but two wins from their last three matches highlights the progress and development of this new team. Result : Scarborough 169-8 (Jack Redshaw 61, Prince Bedi 34, Rob Pinder 22, Dave Chaplin 4-34, Denson Narayan 2=50, Kevin Murphy 2-53) beat * Stamford Bridge 168 all out (Denson Narayan 56, Martyn Woodliffe 31, Dom Rhodes 28, Jack Redshaw 6-13, Tristan Van Schalkwyk 2-33) by 2 wkts. Scarborough 2nds produced an outstanding performance as they overcame bottom of the table Hornsea in YPLN Division One East at a sun drenched North Marine Road. Despite losing two early wickets, the visitors were aggressive in their response and Paul Clappison latched on to anything short as he raced to 49 (50 balls) before Ben Crick dismissed the opener, caught by James Denton at deep mid off. Scarborough CC 2nds surround skipper Charlie Hopper as he claims an early wicket Advertisement Hide Ad Advertisement Hide Ad Mark Battye (39) and Daniel Dales (30) continued in similar form, but the introduction of Aminda Weerasooriya proved decisive. The young leg spinner continued his recent good form by claiming a superb 4-40 from 12 overs to put Hornsea on the back foot. Charlie Hopper (3-31) returned to the attack to mop up the tail with the away side all out for 159. Crick (16) and Dan Artley put 65 on for the first wicket to provide a good foundation for the reply, with the keeper-batter racing to an entertaining 35 ball half century. Advertisement Hide Ad Advertisement Hide Ad He and Brad Milburn added 92 for the second wicket before Artley fell for a thrilling 95 (71 balls) with 12 fours and 2 sixes. Milburn finished unbeaten on 34 as the hosts secured the eight-wicket win in 22.3 overs. Result : *Scarborough 2nds 160-2 (Dan Artley 95, Brad Milburn 34*) beat Hornsea 159 all out (Paul Clappison 46, Mark Battye 39, Daniel Dales 30, Aminda Weerasooriya 4-40, Charlie Hopper 3-31) by 8 wkts. Related topics: Ben Crick Stamford Bridge","pubDate":"2023-06-03 20:26:04","image_url":"https://www.thescarboroughnews.co.uk/webimg/b25lY21zOjczMGRlNjJiLWIzYjUtNGUyNC05ZDEyLTE5OWVkZDNlMDgyMzoyNjViMjU3NS00OGNiLTQwODUtOWEyMy0xYTZjZGViYmYzODQ=.jpg?width=1200&auto=webp","source_id":"thescarboroughnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Elliot Hatton hits superb ton as Flixton seal win at Patrington","link":"https://www.thescarboroughnews.co.uk/sport/cricket/elliot-hatton-hits-superb-ton-as-flixton-seal-win-at-patrington-4168700","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"​Flixton got the better of hosts Patrington in a high-scoring match in the Yorkshire Premier League North Championship East on Saturday.","content":"Top Flixton batter Elliot Hatton Photo by Richard Ponter The home side won the toss and chose to bat first, writes John Boddy . Captain Ashley McKinley led the way with a highly positive 136 backed up by Ben Butler (23) and a late order 38no. by Grant Van Es leaving Patrington on a more than useful 277 all out from 50 overs. Advertisement Hide Ad Advertisement Hide Ad Pick of the Flixton bowlers were Rehaan Shyamsundar with 4 for 42 and Charlie Colley 3 for 49. The Flixton reply began steadily until Harry Walmsley (27) and Cameron Anderson (51) picked up the pace. Most Popular 1 Jack Redshaw stars as visitors Scarborough CC 1sts edge thriller at Stamford Bridge​ 2 ​Scarborough Paragon Cycling Club celebrate reaching 70-year landmark Elliot Hatton continued his fine run of form, steering the visitors home with an outstanding 107no with four overs to spare, finishing on 281 for 6. Next Saturday Flixton are at home to Woodhouse Grange 2nds. ​ Related topics: Flixton Patrington","pubDate":"2023-06-03 20:15:29","image_url":"https://www.thescarboroughnews.co.uk/webimg/b25lY21zOmFiYjBhNzQwLWFkNjktNDMxZS1hNzJiLWU0NGM2OWE4NGM4Zjo4YTMzMTJmNS03OGQxLTRjMzQtOGYxMi1jNWQyZmVkZDFhNDc=.jpg?width=1200&auto=webp","source_id":"thescarboroughnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"ऑस्ट्रेलियाई खिलाड़ी डेविड वॉर्नर को एक शब्द में बयां करते हैं","link":"https://jantaserishta.com/sports/australian-players-describe-david-warner-in-one-word-2414622","keywords":["खेल"],"creator":["Rani Sahu"],"video_url":null,"description":null,"content":"लंदन (एएनआई): ऑस्ट्रेलियाई टीम को भारत के खिलाफ विश्व टेस्ट चैम्पियनशिप (डब्ल्यूटीसी) फाइनल से पहले अपने विस्फोटक बल्लेबाज डेविड वार्नर को एक शब्द में परिभाषित करने के लिए कहा गया था। ICC ने ऑस्ट्रेलियाई खिलाड़ियों का एक वीडियो पोस्ट किया, जिसमें वार्नर को एक शब्द का जवाब दिया गया। उन्होंने इसे कैप्शन दिया \"डेविड वार्नर #Cricket #CricketReels के बारे में टीम के साथियों ने अपनी बात रखी\" मार्नस लाबुस्चगने ने वॉर्नर की तारीफ करते हुए कहा, \"उनकी सबसे पसंदीदा चीजों में से एक विकेटों के बीच दौड़ना है, मैं सिर्फ उस तीव्रता से प्यार करता हूं जो वह क्रीज पर लाते हैं।\" स्टीव स्मिथ उन्हें 'टफ' कहते हैं जबकि मिशेल स्टार्क \"प्रतिस्पर्धी\" मानते हैं। ऑस्ट्रेलियाई कप्तान पैट कमिंस को लगता है कि उनके पास \"उच्च ऊर्जा\" है। 36 वर्षीय ने 2019 के एशेज दौरे के दौरान 9.5 पर पांच टेस्ट मैचों में सिर्फ 95 रन बनाए और पिछले दो वर्षों में कई बार संघर्ष किया, केवल एक शतक दर्ज किया – पिछली गर्मियों में बॉक्सिंग डे पर उनका महाकाव्य 200 – और 15 के 18 स्कोर या 32 पारियों में कम। डब्ल्यूटीसी फाइनल के लिए भारत की टीम: रोहित शर्मा (कप्तान), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, केएस भरत (विकेटकीपर), रविचंद्रन अश्विन, रवींद्र जडेजा, अक्षर पटेल, शार्दुल ठाकुर, मो. शमी, मो. सिराज, उमेश यादव, जयदेव उनादकट, इशान किशन (wk)। ऑस्ट्रेलिया टीम: पैट कमिंस (c), स्कॉट बोलैंड, एलेक्स केरी (wk), कैमरन ग्रीन, मार्कस हैरिस, जोश हेज़लवुड, ट्रैविस हेड, जोश इंगलिस (wk), उस्मान ख्वाजा, मारनस लाबुस्चगने, नाथन लियोन, मिच मार्श, टॉड मर्फी , मैथ्यू रेनशॉ, स्टीव स्मिथ (वीसी), मिशेल स्टार्क, डेविड वार्नर। (एएनआई)","pubDate":"2023-06-03 18:25:27","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शादी के बंधन में बंधे CSK के ओपनर रुतुराज गायकवाड़, क्रिकेटर उत्कर्षा को बनाया हमसफर, देखें फोटो","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ruturaj-gaikwad-utkarsha-pawar-wedding-photos/articleshow/100732868.cms","keywords":null,"creator":null,"video_url":null,"description":"चेन्नई सुपर किंग्स (CSK) के युवा सलामी बल्लेबाज रुतुराज गायकवाड़ (Ruturaj Gaikwad) ने शादी कर ली है। 26 साल के इस खिलाड़ी ने इंस्टाग्राम पर अपने खास दिन की पहली तस्वीरें साझा की हैं। शादी की फोटो काफी तेजी से वायरल हो रही है। दाएं हाथ के बल्लेबाज रुतुराज भारतीय टीम का प्रतिनिधित्व कर चुके हैं।","content":"चेन्नई सुपर किंग्स (CSK) के युवा सलामी बल्लेबाज रुतुराज गायकवाड़ (Ruturaj Gaikwad) ने शादी कर ली है। 26 साल के इस खिलाड़ी ने इंस्टाग्राम पर अपने खास दिन की पहली तस्वीरें साझा की हैं। शादी की फोटो काफी तेजी से वायरल हो रही है। दाएं हाथ के बल्लेबाज रुतुराज भारतीय टीम का प्रतिनिधित्व कर चुके हैं।","pubDate":"2023-06-03 18:21:31","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Five-star Josh Tongue Strikes As England Down Ireland In One-Off Test","link":"https://sports.ndtv.com/cricket/five-star-josh-tongue-strikes-as-england-down-ireland-in-one-off-test-4092223","keywords":null,"creator":null,"video_url":null,"description":"Victory meant England had now won 11 of their 13 Tests under Ben Stokes -- who didn't bat or bowl in this match -- and coach Brendon McCullum.","content":"Debutant fast bowler Josh Tongue marked his call-up into the Ashes squad with a five-wicket haul as England beat Ireland by 10 wickets inside three days at Lord's but only after a record partnership of 163 between tailenders Mark Adair and Andy McBrine . England were well-placed for an innings win when Ireland started the day needing 255 more runs to make Ben Stokes 's men bat again. But Ireland, handicapped by the absence of injured opener James McCollum kept England at bay while Harry Tector (51) and Lorcan Tucker helped add 118 runs in the morning session for the loss of just three wickets. Ireland yet to win any of their seven Tests then ran riot during a record Ireland stand between the seventh-wicket duo of McBrine (86 not out) and Adair (88). Fast bowler Adair, whose previous highest Test score was 32 against Bangladesh in Mirpur in April, went to fifty with a four off Stuart Broad . Left-hander McBrine's fifty included 10 boundaries, with Broad and Leach taking the brunt of the assault. But number nine Adair was eventually bounced out by Matthew Potts for a 76-ball 88 that included 12 fours and two sixes. Ireland were effectively nine wickets down when Fionn Hand became Tongue's fifth victim and his exit meant England were able to extend the afternoon session by 30 minutes in a bid to force victory before tea. England were denied an innings win, however, when tailender Graham Hume hit two fours off successive deliveries from part-time off-spinner Joe Root -- shots greeted by huge cheers from a sun-drenched crowd. With McBrine 85 not out at tea, the question was whether Hume could help get his partner to a hundred and a coveted place on the Lord's honours board. But McBrine was left stranded when Hume was bowled by Broad, leading the attack in the absence of the rested James Anderson and Ollie Robinson . Advertisement Zak Crawley then made short work of a victory target of 11 with three fours in four balls from Adair. \"I thought Ireland came out and showed grit and determination,\" said England captain Stokes at the presentation ceremony. \"It (the pitch) got flatter as it went on. Trying to take the game on in our own way allowed us to potentially bowl them out without batting again.\" Ireland skipper Andrew Balbirnie praised a side with minimal first-class experience for the resilience they showed Saturday. \"The character is not in doubt, we've got a tough group,\" he said. \"Test cricket is very raw to us, yesterday was a tough day but to come back and make England bat again was a small win.\" He added: \"We're learning on the job and we've got to learn quickly. Hopefully next time we'll show the benefit.\" Victory meant England had now won 11 of their 13 Tests under Stokes -- who didn't bat or bowl in this match -- and coach Brendon McCullum . Stokes, battling a longstanding knee injury, neither batted nor bowled against Ireland. England want to protect the all-rounder's fitness ahead of the Ashes opener at Edgbaston on June 16, while still benefitting from his leadership skills. But there was a worrying moment when he appeared to jar his leg when catching Curtis Campher on Saturday. \"I just landed on it quite awkwardly,\" Stokes told the BBC. He added: \"I wouldn't have bowled in this match anyway, unless everyone else went down. \"I'm happy with it, so I'll just keep building it up now before Edgbaston. I am definitely on course to bowl in the first Test.\" England's win was built on an imposing first-innings total of 524-4 declared featuring player of the match Ollie Pope's 205 and Ben Duckett 's 182. \"Batting at three is a big role in the team but I feel good about my game and nothing needs to change because it's an Ashes series,\" said player-of-the-match Pope. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-03 18:03:37","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Three decades on, Warne's Gatting ball is still the one","link":"https://www.perthnow.com.au/sport/cricket/three-decades-on-warnes-gatting-ball-is-still-the-one-c-10866667","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Shane Warne's ball to dismiss Mike Gatting may not have been the finest the legspinner ever bowled, but 30 years on it remains the most influential.","content":"Has one ball ever changed the course of sporting history as much as Shane Warne's to Mike Gatting? A ball that drifted, dipped, turned, took the top of Gatting's off stump and landed the late legspinner a place in cricketing lore. Sunday marks 30 years since the game's most famous delivery. The ball of the century, as it was labelled by Sunday Times journalist Robin Marlar at the time, and has since become enshrined. Warne's ball to Gatting at Old Trafford wasn't the best of his storied 15-year Test career. It perhaps wasn't even the best ball he had bowled to that point, with his flipper to Richie Richardson at the MCG in 1992 a serious contender. But no other ball had the impact of Warne's to Gatting. In the space of an eight-step walk in and one second of drift and spin the dying art of leg spin had been revived. A generation of Australian kids wanted to bleach their hair and become slow bowlers, while an era of English batsmen were left in a decade of daze. \"A cult had appeared from nothing in the UK and I was it,\" Warne wrote in his 2018 autobiography No Spin. \"I was 23 years old and wherever I went it suddenly felt like there was a kid with ice cream on his nose, trying to bowl legspin.\" Warne himself is the first to admit the title of ball of the century was questionable. \"It was as if it was an all-time classic song: y'know, Honky Tonk Women' or 'Bohemian Rhapsody',\" Warne penned. Hit around in his first tour match in England, Warne subsequently admitted he had began to doubt himself ahead of the first Test. But as was the case so often throughout the remainder of his soap opera career, the showman knew when to best choose his moment. And no moment could be as fitting as his first ball in Test cricket in England. \"I remember letting go of the ball and it felt great. It couldn't have come out any better,\" Warne wrote. \"It happens in half a second but seems to take forever. It floats and swerves and dips. I like it, really like it. \"It pitches outside leg-stump and spins. Boy, does it spin! I like it more. \"Gatt plays half-forward, down the line of leg-stump, and misses. The ball hits the top of off. \"Momentarily the world stood still. Everyone, it seemed, was frozen in shock.\" In that moment, Warne's career had been changed forever. One of Wisden's five greatest cricketers of the 20th century was on an unstoppable path to stardom, beginning with eight wickets for the match in Manchester and 34 for the series. And in Gatting's bemused look as he trounced off the ground, a 14-year magic spell had been cast England and batters worldwide. Whether it was actually the best ball of the 20th century remains debatable. But the undeniable fact is, it didn't need to be.","pubDate":"2023-06-03 17:44:03","image_url":"https://images.perthnow.com.au/publication/C-10866667/e9c74982bd34c33456034fb05edeccfb7d01381e-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Warner unveils Sydney swansong plan","link":"https://www.news24.com/sport/Cricket/warner-unveils-sydney-swansong-plan-20230603","keywords":null,"creator":null,"video_url":null,"description":"Under-pressure Australia batsman David Warner said he wanted to finish his Test career next year with a farewell match in his hometown of Sydney.","content":"Warner was speaking in Beckenham, near London, where Australia are preparing ahead of next week's World Test Championship final against India, when he unveiled his plan to bow out of Test cricket against Pakistan at the Sydney Cricket Ground in January. Warner, 36, added he still hoped to keep playing white-ball cricket for Australia until the 2024 T20 World Cup in the West Indies and the United States. \"You've got to score runs. I've always said the (2024) World Cup would probably be my final game,\" Warner told reporters. \"I probably owe it to myself and my family - if I can score runs here and continue to play back in Australia...If I can get through this (WTC final and subsequent five-Test Ashes campaign in England) and make the Pakistan series I will definitely finish up then.\" Warner added he had suffered no major damage after being stuck in the practice nets on the same left elbow he fractured during Australia's tour of India earlier this year, an injury that meant he missed the final Two Tests. He underwent treatment by a physiotherapist on Thursday but expects to be fit for Wednesday's start of the WTC final at the Oval. \"It was sore, it got me right on the same point but from a different angle,\" said Warner. \"It went numb and I had to get it strapped, but it's fine now - a little bit sore, but lucky it didn't hit me on top.\" Warner has been a mainstay of the Australia team since making his debut against New Zealand in 2011. But the left-handed opener approaches the WTC final and ensuing Ashes with one century in his past 32 innings and a mediocre record in England. During the 2-2 drawn Ashes series in England, he averaged under 10 and seven times fell victim to paceman Stuart Broad.","pubDate":"2023-06-03 17:37:05","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"}]}