{"newsArray":[{"title":"DA COSTA: All eyes on Bengaluru for IPL auction of cricket players","link":"https://torontosun.com/sports/other-sports/da-costa-all-eyes-on-bengaluru-for-ipl-auction-of-cricket-players","keywords":null,"creator":["Norm Da Costa"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-01 23:05:18","full_description":"The world’s greatest cricketers will have their eyes focused on the Indian city of Bengaluru on Feb. 12 and 13. That’s where some 592 of them will go under the hammer at the mega auction for the upcoming India Premier League, and you can bet that several of them will be laughing all the way to the bank. Valentine’s Day will come a day early for many. One of the world’s top leagues with an estimated brand value of $6.8 billion (all figures US) that has consistently drawn huge crowds and record television and digital viewership has churned out several millionaires during its 14 years in existence. And this cash cow has made the Indian Cricket Board the richest and most powerful cricket organization in the world. This year’s T20 that runs from April 2 to June 3 will expand from eight teams to 10 with Lucknow and Ahmedabad paying a total of $1.69 billion (US) to join the big boys. Lucknow bolstered its lineup by installing India opening batsman KL Rahul as its captain and making him the joint-highest paid player in the IPL with a $2.28 million pay package for the season. Rahul joins former India captain Virat Kohli of the Royal Challengers Bangalore as the No.1 money-earners for the tournament, which lasts a mere six weeks. Lucknow also signed Australia all-rounder Marcus Stoinis for $1.24 million and India leg-spinner Ravi Bishnoi for $500,000. Not to be outdone, Ahmedabad confirmed hard-hitting India all-rounder Hardik Pandya will lead the team by dishing out $2.2 million for his services. It also secured the services of ace Afghanistan leg-spinner Rashid Khan for the same figure and added India opening batsman Shubman Gill for $1.07 million. That leaves both teams with approximately $7 million each to sign the rest of the squad next weekend. Following hard on the heels of Kohli and Rahul on the salary list is Chris Morris, the South African all-rounder, who was crowned the highest-paid foreign player in 2021 when Rajasthan Royals forked out $2.2 million for him. Others in the top 10 and assured of their seven-figure salaries in 2022 are Australian captain Pat Cummins (Kolkata Knight Riders, $2.1 million), Mahendra Singh Dhoni (Chennai Super Kings $2.06M), Rohit Sharma (Mumbai Indians $2.06M), Rishabh Pant (Delhi Capitals, $2.06M), New Zealand’s Kyle Jamieson (Royal Challengers Bangalore $2.06M). Bringing up the elite group are Australians Glenn Maxwell (Royal Challengers Bangalore $1.96M), Jhye Richardson (Punjab Kings $1.92M) and David Warner (Sunrisers Hyderabad $1.72M). There are several marquee players in the auction who could attract more than Morris and among them are his South African teammate Quinton de Kock, Australian all-rounder Mitchell Marsh and New Zealand’s Devon Conway. De Kock had a superb season against India two weeks ago and Marsh was an integral part of Australia’s first Twenty20 World Cup victory last year. Conway enjoyed a charmed season with the bat with a double century on his Test debut and followed that up with a staggering 75.00 average in three ODIs that included a century and a 50. Others on the wish list of the teams will be South African pacer Kagiso Rabada and his teammate Rassie van der Dussen; England’s destructive batsmen Liam Livingstone, Jason Roy, Jonny Bairstow and Test captain Joe Root. New Zealand’s new ball bowler Trent Boult and West Indian Jason Holder are also expected to add zeroes to their paycheques. One batsman who has made a late charge and stands to trigger a bidding war is West Indian Rovman Powell. The 28-year-old Jamaican right-hander smashed 10 sixes in a blistering 107 from just 53 balls in the third T20 international against visiting England last week. He became the third West Indian after the legendary Chris Gayle and Evin Lewis to score a T20 international century. Among the Indian players fighting for top bucks next weekend will be exciting and hard-hitting opening batsman Ishan Kishan, who was let go by Mumbai Indians. Other stars in the mix who should pad their wallets are Shreyas Iyer, Ravichandran Ashwin, Mohammed Shami, Shikhar Dhawan, Ajinkya Rahane and star all-rounder Shardul Thakur. HOLDER STUNNER Holder, a 6-foot-7 Barbadian, used his height to good advantage to capture four wickets in the final four balls to give West Indies victory in the deciding Twenty20 international against visiting England in Barbados. The win by 17 runs guided the West Indies to a 3-2 series victory. The Windies piled on 179 for four with Kieron Pollard making 41 and then dismissed England for 162 with Holder returning the impressive figures of five for 27. England went into the final over needing 20 runs for a win but Holder ended their hopes by first getting Sam Billings, Chris Jordan, Adil Rashid and then bowling Saqib Mahmood. TAYLOR BANNED Former Zimbabwe batsman Brendan Taylor has been banned from the game for 3½ years after admitting he had received $15,000 to carry out spot-fixing in 2019. The 35-year-old Taylor received the money from an Indian businessman.","image_url":null,"source_id":"torontosun"},{"title":"England survive late meltdown against Afghanistan","link":"https://www.cairnspost.com.au/sport/cricket/england-survive-late-meltdown-against-afghanistan/video/f7ac0b034618e8750cb0f31388d6e6f4","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: England have survived a mini meltdown to advance to the final of the U-19 Cricket World Cup after scraping past Afghanistan.","content":null,"pubDate":"2022-02-01 22:44:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"‘Heartbreak beyond cricketing belief’: Poms survive ‘astonishing’ meltdown in WC thriller","link":"https://www.foxsports.com.au/cricket/cricket-scores-2022-under-19-world-cup-icc-england-vs-afghanistan-result-final-australia-vs-india-wickets-report/news-story/0acc0f40686ba384653acd1d0ac75bd4","keywords":null,"creator":null,"video_url":null,"description":"England is into the final of the Under-19 Cricket World Cup after surviving an extraordinary meltdown against Afghanistan that put it on the brink of a shock elimination.","content":null,"pubDate":"2022-02-01 21:58:00","full_description":"England is into the final of the Under-19 Cricket World Cup after surviving an extraordinary meltdown against Afghanistan that put it on the brink of a shock elimination. England was closing in on victory in the semi-final in Antigua, with Afghanistan still needing 43 runs from the innings’ final 24 balls to reach the DLS-adjusted target of 231. That’s when chaos erupted over the course of the seesawing final four overs. Watch the CommBank Women’s Ashes Series on Kayo. Every Test, T20 & ODI Live & On-Demand. New to Kayo? Start your free trial now > Noor Ahmad skied the first ball of the over for a simple catch, only for the umpire to rule a front-foot no ball on James Sales. While England was busy celebrating, Afghanistan smartly ran two runs. The following ball — a free hit — was nothing short of a disaster as Sales lost control and bowled over chest height outside off stump. The wicketkeeper couldn’t stop the delivery racing away for four, meaning England had just conceded eight runs without another valid ball being bowled. NEW FOLLOW ON PODCAST - Justin Langer: The truth about his heated meeting with CA ﻿. LISTEN ON SPOTIFY OR SUBSCRIBE IN ITUNES Adding to the drama was that it was Sales’ second no ball over chest height for the innings, meaning he had to be taken out of the attack. In extraordinary scenes, Sales was eventually allowed to continue bowling because the ball was so wide it wasn’t deemed to be dangerous. “This is an astonishing set of circumstances, it really is,” the commentator said at the time. Abdul Hadi hit a six later in the over that eventually cost England 20 runs. Suddenly, Afghanistan needed just 23 runs from the final 18 overs. Then it was Afghanistan’s turn to go into meltdown. Aussie one win away from retaining Ashes | 02:16 A brilliant four-run over from Joshua Boyden turned the tide back into England’s favour — and the pressure swiftly told on Afghanistan. The penultimate over, bowled by Rehan Ahmed, saw Afghanistan’s batters swiftly lose their composure and swing for the stands unsuccessfully. Afghanistan went from 6-212, to losing 3-1 to leave it chasing 18 runs off the final over with just one wicket in hand. Among the three wickets was a stunning diving outfield catch James Rew, and a moment of redemption on the rope by Sales. The final over started with three-consecutive dot balls, while Afghanistan made just two off the last three to lose by 15 runs. The loss for Afghanistan was described by Times of India journalist Arani Basu as “heartbreak beyond the eleven boys ... it’s beyond cricketing rationale.” Meanwhile, Sales will be breathing a sigh of relief. England will now play the winner of Thursday morning’s semi final between Australia and India.","image_url":null,"source_id":"foxsports"},{"title":"Former players lash Cricket Australia for not re-signing coach Justin Langer","link":"https://www.foxsports.com.au/cricket/australia/former-players-lash-cricket-australia-for-not-resigning-coach-justin-langer/news-story/ab192ae318e869dc4fd62f5637fcb16a","keywords":null,"creator":null,"video_url":null,"description":"Furious former teammates of Australian coach Justin Langer have slammed Cricket Australia’s handling of his contract situation, labelling it “crazy” he hasn’t been re-signed.","content":null,"pubDate":"2022-02-01 20:38:00","full_description":"Furious former teammates of Australian coach Justin Langer have slammed Cricket Australia’s handling of his contract situation, labelling it “crazy” he hasn’t been re-signed. Foxsports.com.au exclussively reported that Langer went reacted angrily in a meeting with CA boss Nick Hockley last week after it was suggested he may have to reapply for his job, former Test star Damien Martyn led the charge in support. But CA released an extraordinary statement Tuesday morning, declaring there were a “ number of inaccuracies” in the original reporting of the meeting last Friday between Langer, Hockley and national high performance manager Ben Oliver. “While we do not comment on confidential conversations, we felt on this occasion it was important to correct the record,” a statement said. “Among other false claims, we reject outright the assertion that the meeting was fiery or heated and that Justin was asked to reapply for his job. “Justin has always been contracted as head coach through to the middle of this year and we have consistently maintained that discussions around the future of the role would commence following the conclusion of the men’s Ashes series. “Friday’s meeting was the first time that we had the opportunity to meet together in person, reflect on the team’s success and discuss the road ahead. “We will continue with this process and make an announcement once it is complete.” Foxsports.com.au never reported that Langer was asked to reapply, rather that it was floated as a possibility. Further, mutliple sources and other media outlets have since confirmed the heated nature of the meeting. The response from Cricket Australia came after Martyn, a long-time friend and supporter of Langer, even went as far as starting an online poll that overwhelmingly supported Langer’s retention as cricket pundits including former England captain Michael Vaughan reacted to the reports his future could be in doubt despite landing the T20 World Cup and a 4-0 Ashes win. “It’s crazy … Took us from our darkest days to here,” Martyn said referencing Langer’s revival of the Test team after the sandpaper scandal in 2018. Martyn was also scathing of the leaks coming out of CA about Langer. Vaughan, who spent the summer in Australia commentating on the Test series, said Langer’s record should be enough for him to be re-signed. “If it’s true the Coach of Australia has to reapply for his position when he has taken them to No 1 Test team in the World & the T20 World Cup champs in the last few months .. the landscape for success has hugely changed … Isn’t it about Winning ?? !!!,” he posted on Twitter. On Monday Foxsports.com.au reported that Langer reacted angrily when the possibility of him reapplying for the coaching role was raised by Hockley and Oliver during a heated meeting last Friday morning. According to the report, Langer is refusing to accept anything less than a full contract renewal, arguing his record warrants another multi-year deal. Langer was last week inducted into the Australian Cricket Hall of Fame, but a previous breakdown in relationships with senior Australian players is still hanging over his head. It’s been reported Langer won’t go on the upcoming tour of Pakistan unless his contract situation is sorted. The CA board is reportedly uncertain over Langer’s reappointment. A crisis meeting between CA chiefs and senior players was needed last year to address the issues between players and coach, sparking suggestions Langer was in danger of not having his contract renewed. The former Australian Test opener has since taken a step back and delegated more responsibility to his support staff, which has seemingly helped improve the team’s performance.","image_url":null,"source_id":"foxsports"},{"title":"IND U19 vs AUS U19 Live Telecast Channel in India and Australia: When and where to watch India U19 vs Australia U19 World Cup match?","link":"https://thesportsrush.com/cricket-news-ind-u19-vs-aus-u19-live-telecast-channel-in-india-and-australia-when-and-where-to-watch-india-u19-vs-australia-u19-world-cup-match/","keywords":["Cricket","Australia","ICC U19 World Cup 2022","India"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND U19 vs AUS U19 Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of ICC U-19 World Cup. The second semi-final of the ongoing ICC U-19 World Cup 2022 will be played between Australia U-19 and India U-19 in Antigua tomorrow. The winner of the match will face one… The post IND U19 vs AUS U19 Live Telecast Channel in India and Australia: When and where to watch India U19 vs Australia U19 World Cup match? appeared first on The SportsRush.","content":"IND U19 vs AUS U19 Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of ICC U-19 World Cup. The second semi-final of the ongoing ICC U-19 World Cup 2022 will be played between Australia U-19 and India U-19 in Antigua tomorrow. The winner of the match will face one out of England U-19 or Afghanistan U-19 in the final on Saturday. Out of the four matches that they’ve played so far in the tournament, Australia have won three and lost one to emerge as one of the strongest teams. India, on the other hand, have won all their four matches to grab more points on the basis of current form. The Indian team managing to stay away from a defeat despite losing multiple players to COVID-19 speaks highly of the overall talent of their squad. Furthermore, India will also be wanting to take confidence from the fact that they have won their last four completed matches against Australia albeit with different squads on each occasion. Out of the 36 matches which both the teams have played against each other, India have won 22 times as compared to Australia’s 14 victories. India U19 captain Yash Dhull highlights how motivating it is to have the legendary @VVSLaxman281 with the squad at the #U19CWC 2022. #BoysInBlue #INDvAUS pic.twitter.com/REkcKwOGiE — BCCI (@BCCI) February 1, 2022 IND U19 vs AUS U19 Live Telecast Channel in India and Australia Star Sports Network are broadcasting the live streaming of ICC U19 World Cup 2022 in India. As has been the case with broadcasting international cricket in India in the past, Star have arranged extensive coverage for this showpiece event as well. The Antigua YODI between India and Australia will be televised on Star Sports 1/1 HD and Star Sports Select 2/2 HD. Online users can stream the match on Star’s streaming application named Disney+Hotstar. It is worth mentioning that the match won’t be available on any other streaming platform in India. Fans in Australia will have to switch to a reliable option in Fox Cricket to watch this knockout matches. Australian fans must note that the match will commence on February 3 for them due to the time difference. Date – 02/02/2022 (Wednesday) and 03/02/ 2022 (Thursday). Match start Time – 06:30 PM (India) and 00:00 AM (Australia). TV Channel – Star Sports 1/1 HD and Star Sports Select 2/2 HD (India) and Fox Cricket (Australia). Online platform – Disney+Hotstar (India) and Kayo app (Australia). The post IND U19 vs AUS U19 Live Telecast Channel in India and Australia: When and where to watch India U19 vs Australia U19 World Cup match? appeared first on The SportsRush.","pubDate":"2022-02-01 20:32:40","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"AU-A-W vs ENG-A-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for 3rd Unofficial ODI","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/au-a-w-vs-eng-a-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-3rd-unofficial-odi?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-01 19:24:31","full_description":"Australia A Women will take on England A Women in the third Unofficial ODI of England A Women’s tour of Australia on Wednesday, 2nd February 2022 at Phillip Oval, Canberra. Australia A Women have been exceptional in the three-match series. After a 42-run win in their first game, they notched a comprehensive win by eight wickets in the second match to seal the series 2-0. Meanwhile, England A Women have performed terribly, especially in the previous game. They were bundled out for 132 runs to give away an easy win for the hosts. Australia A Women Georgia Redmayne (C/WK), Katie Mack, Elyse Villani, Georgia Voll, Erin Burns, Grace Harris, Hannah Darlington, Heather Graham, Molly Strano, Amanda-Jade Wellington, Maitlan Brown England A Women Evelyn Jones (C), Emma Lamb, Bryony Smith, Alice Capsey, Georgia Elwiss, Alice Davidson-Richards, Mady Villiers, Eleanor Threlkeld (WK), Sarah Glenn, Emily Arlott, Tash Farrant, Freya Davies Match: Australia A Women vs England A Women, 3rd Unofficial ODI Date and Time: 2nd February, 4:30 AM IST Venue: Phillip Oval, Canberra. The pitch at Phillip Oval has been a balanced one so far this series. We can expect some movement in the initial stages. However, the batters will find it easy to score as the pitch wears off. Wicketkeeper Georgia Redmayne: Aussie captain Redmayne hasn’t been at her best with the bat but has contributed immensely behind the stumps. She has been involved in five dismissals in two matches. Batters Elysse Villani: Villani played a fine 48-run knock in the previous game. She has 68 runs to her name in two matches. Grace Harris: Harris has been decent with the bat in both games. She has scored 65 runs in two games so far at a strike rate of 84.41. All-rounders Alice Richards: Richards has made vital contributions in both aspects of the game. She has scored 73 runs as well as grabbed two wickets. Heather Graham: Graham is another top pick from the all-rounder’s department. She has scored 38 runs and has picked up four wickets in two games at an economy of 2.54. Bowlers Amanda Wellington: Wellington has been exceptional with the ball. She has managed to grab five wickets in two games at an economy of 3.83. Molly Strano: Strano has made contributions in both departments of the game. She has scalped three wickets at an economy of 2.56 and has scored 39 runs. Amanda Wellington: 177 points Heather Graham: 173 points Molly Strano: 149 points Alice Richards: 149 points Grace Harris: 103 points Amanda Wellington: Two matches, five wickets Heather Graham: Two matches, 38 runs, four wickets Molly Strano: Two matches, 39 runs, three wickets Alice Richards: Two matches, 73 runs, two wickets Grace Harris: Two matches, 65 runs Fantasy Suggestion #1: Georgia Redmayne, Grace Harris, Elysse Villani, Heather Graham, Alice Richards, Molly Strano, Amanda Wellington, Katie Mack, Emma Lamb, Sarah Glenn, Tash Farrant Captain: Alice Richards Vice-Captain: Amanda Wellington Fantasy Suggestion #2: Georgia Redmayne, Grace Harris, Elysse Villani, Heather Graham, Alice Richards, Molly Strano, Amanda Wellington, Evelyn Jones, Alice Capsey, Georgia Elwiss, Maitlan Brown Captain: Molly Strano Vice-Captain: Heather Graham","image_url":"https://static.sportskeeda.com/editor/2022/02/70b31-16437376700823-1920.jpg","source_id":"sportskeeda"},{"title":"Highest run chase in PSL: What is the highest successful run-chase in Pakistan Super League","link":"https://thesportsrush.com/cricket-news-highest-run-chase-in-psl-what-is-the-highest-successful-run-chase-in-pakistan-super-league/","keywords":["Cricket","Islamabad United","Multan Sultans","Pakistan Super League","PSL 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Highest run chase in PSL: Islamabad United fell short of what could have been the highest successful run-chase in PSL history. During the eighth match of the ongoing seventh season of the Pakistan Super League between Islamabad United and Multan Sultans, a valiant effort from Islamabad skipper Shadab Khan with the bat was just not enough… The post Highest run chase in PSL: What is the highest successful run-chase in Pakistan Super League appeared first on The SportsRush.","content":"Highest run chase in PSL: Islamabad United fell short of what could have been the highest successful run-chase in PSL history. During the eighth match of the ongoing seventh season of the Pakistan Super League between Islamabad United and Multan Sultans, a valiant effort from Islamabad skipper Shadab Khan with the bat was just not enough for them as they were handed a 20-run defeat by Multan, thereby losing the first game of the season. On the other hand, yet another win for Mohammad Rizwan’s men meant that Multan have now won 4 matches on the trot, to sit handsomely at the top of the table with 8 points. Post losing the Toss, Multan posted 217/5 on the scoreboard- the highest total in PSL 7 so far, courtesy a 100 run-stand in mere 45 deliveries between Tim David (71 off 29) and Rilee Rossouw (67* off 35) for the 4th wicket. In reply the United batters got off to a flier, posting 69 runs in the Powerplay, but losing both their in form openers Alex Hales (23 off 14) and Paul Stirling (19 off 10) in the process. Thereafter, it was all about the United skipper Shadab Khan going hammer and tongs at the Sultans bowlers, but with him losing partners on a consistent basis at the other end, Islamabad lost the first game of the ongoing season, falling short by 20 runs of the target. Shadab’s innings of 91 off 42 deliveries was laden with 5 Fours and 9 massive Sixes, with the task just too much for it to be accomplished with only a lone batter’s contribution. The next top-scorer for Islamabad was Alex Hales with his 23 runs. Highest run chase in PSL Had Islamabad managed to chase the total down, it would have been the highest-successful run-chase in the tournament history. It would have thus broken the record accomplished by Multan Sultans during the 3rd match of the ongoing season against the Lahore Qalandars, wherein they had chased down the total of 206 with 2 deliveries and 5 wickets to spare. Year Team Opposition Won by Target 2022 Multan Sultans Lahore Qalandars 5 wickets 207 2016 Quetta Gladiators Lahore Qalandars 2 wickets 202 2019 Lahore Qalandars Multan Sultans 6 wickets 201 2017 Quetta Gladiators Lahore Qalandars 5 wickets 201 2021 Peshawar Zalmi Quetta Gladiators 3 wickets 199 2021 Islamabad United Karachi Kings 5 wickets 197 2021 Karachi Kings Multan Sultans 7 wickets 196 2021 Peshawar Zalmi Multan Sultans 6 wickets 194 2021 Islamabad United Karachi Kings 8 wickets 191 2020 Lahore Qalandars Multan Sultans 9 wickets 187 For more Cricket-related news, click here. The post Highest run chase in PSL: What is the highest successful run-chase in Pakistan Super League appeared first on The SportsRush.","pubDate":"2022-02-01 19:19:13","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Who won PSL match yesterday: Multan vs Islamabad match result yesterday","link":"https://thesportsrush.com/cricket-news-who-won-psl-match-yesterday-multan-vs-islamabad-match-result-yesterday/","keywords":["Cricket","Islamabad United","Multan Sultans","Pakistan Super League","PSL 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Who won PSL match yesterday: Islamabad skipper Shadab Khan played a blinder of an innings at the National Stadium in Karachi yesterday. During the eighth match of the ongoing seventh season of the Pakistan Super League between Islamabad United and Multan Sultan, Islamabad skipper Shadab won the Toss and following the trend of the season… The post Who won PSL match yesterday: Multan vs Islamabad match result yesterday appeared first on The SportsRush.","content":"Who won PSL match yesterday: Islamabad skipper Shadab Khan played a blinder of an innings at the National Stadium in Karachi yesterday. During the eighth match of the ongoing seventh season of the Pakistan Super League between Islamabad United and Multan Sultan, Islamabad skipper Shadab won the Toss and following the trend of the season so far, elected to field first. On what was a batting paradise at the National Stadium in Karachi, the Sultans lost their skipper Mohammad Rizwan (12 off 11) cheaply yet again off a Run Out in the 5th Over. His fellow in-form partner Shan Masood played with the same template as in his previous match the day before, but couldn’t carry on for long as he was adjudged LBW off Merchant de Lange at the individual score of 43 off 31 deliveries in the 9th Over. With the scorecard reading 73/2 after 10 Overs, the Sultans needed to up the ante to post somewhere near the 170-run mark. It is at after this point in the game that Tim David (71 off 29) and Rilee Rossouw (67* off 35) put together a 100 run-stand in mere 45 deliveries to thrash the Islamabad bowlers black and blue. By the time Tim David was dismissed, Multan had already posted 188 runs in 18.4 Overs. A 21-run Over in the end off Hasan Ali meant that the Multan Sultans posted a humongous 217/5 on the scoreboard off their 20 Overs. Who won PSL match yesterday In reply the United batters got off to a flier, posting 69 runs in the Powerplay, but losing both their in form openers Alex Hales (23 off 14) and Paul Stirling (19 off 10) in the process. Thereafter, it was all about the United skipper Shadab Khan going hammer and tongs at the Sultans’ bowlers, but with him losing partners on a consistent basis at the other end, the United lost the first game of the ongoing season, falling short by 20 runs of the target. Shadab’s innings of 91 off 42 deliveries was laden with 5 Fours and 9 massive Sixes, with the task just too much for it to be accomplished with only a lone batter’s contribution. The next top-scorer for Islamabad was Alex Hales with his 23 runs. Khushdil Shah was the pick of the bowlers for Multan, returning with figures of 4-0-35-4. Tim David was adjudged the ‘Player of the Match’ for his stellar knock. With this win, Multan have now won 4 matches on the trot in as many matches, to sit comfortably at the top of the Points Table with 8 points. Multan took it away in the end. Class innings by @76Shadabkhan and @KhushdilShah_’s over were the highlights of this high-energy game. #HBLPSL7 l #LevelHai l #IUvMS pic.twitter.com/L3s6euwwOM — PakistanSuperLeague (@thePSLt20) February 1, 2022 For more Cricket related news, click here. The post Who won PSL match yesterday: Multan vs Islamabad match result yesterday appeared first on The SportsRush.","pubDate":"2022-02-01 18:39:51","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"‘Offensive’ Langer insult is just not cricket","link":"https://www.news.com.au/sport/cricket/justin-langer-hung-out-to-dry-by-cricket-australia-amid-coaching-contract-saga/news-story/69be99c204a82f3350ccecca6b8dd3f1","keywords":null,"creator":null,"video_url":null,"description":"Cricket Australia has been accused of hanging Justin Langer out to dry following a successful home Ashes campaign, with the coach’s contract saga showing no signs of slowing down.","content":null,"pubDate":"2022-02-01 18:25:00","full_description":"Cricket Australia has been accused of hanging Justin Langer out to dry following a successful home Ashes campaign, with the coach’s contract saga showing no signs of slowing down. Langer’s four-year coaching contract expires in June, and there is mounting speculation as to whether the 51-year-old will be granted another multi-year deal. On Monday, foxsports.com.au reported that Langer reacted angrily when the possibility of him reapplying for the coaching role was raised by CA chief executive Nick Hockley and high performance manager Ben Oliver during a “heated” meeting last Friday morning. Watch the CommBank Women‘s Ashes Series on Kayo. Every Test, T20 & ODI Live & On-Demand. New to Kayo? Start your free trial now > According to the report, Langer is refusing to accept anything less than a full contract renewal, arguing his record warrants another multi-year deal. But CA returned serve on Tuesday morning, declaring there were a “number of inaccuracies” in the reporting of the meeting between Langer, Hockley and Oliver. “While we do not comment on confidential conversations, we felt on this occasion it was important to correct the record,” a CA statement said. “Among other false claims, we reject outright the assertion that the meeting was fiery or heated and that Justin was asked to reapply for his job. “Justin has always been contracted as head coach through to the middle of this year and we have consistently maintained that discussions around the future of the role would commence following the conclusion of the men’s Ashes series. “Friday’s meeting was the first time that we had the opportunity to meet together in person, reflect on the team’s success and discuss the road ahead. “We will continue with this process and make an announcement once it is complete.” The CA board is reportedly still uncertain over Langer’s reappointment, despite Oliver claiming a decision on the West Australian’s future would be made after the Ashes series, which concluded more than two weeks ago. Speaking on Fox Cricket’s The Follow-On podcast, News Corp reporter Robert Craddock suggested Langer had been “hung out to dry” by CA’s indecision. “I felt it was offensive and poor,” he said. “Think of the choreography around that day. Three hours after the meeting, Cricket Australia released a statement inducting Langer into the Hall of Fame. “On a day you’re admitting a guy into the Hall of Fame, you’re mentioning the prospect of him reapplying? “Langer’s got his shortfalls, and his volatility is on display at this meeting. “But to be asked to reapply? Nup, I didn’t rate that at all. You either hire him or you fire him ... you don’t say, ‘Hey, show us your credentials’. “I don’t like the way he’s been hung out to dry. This should have been sorted the day after the last day of the Ashes. Just get it done with. “This should have been addressed long before now; don’t like it at all.” Cricket writer Malcolm Conn echoed Craddock’s remarks on 6PR Mornings, saying it was “ridiculous” for CA to even consider asking Langer to reapply. “I think Cricket Australia’s handling of this has been appalling,” he said on Tuesday. “I think Cricket Australia should be ashamed of themselves for having an icon of the game dragged out like this. “They said the decision would be made after the Ashes, and the decision should have been made after the Ashes one way or the other.” Langer was inducted into the Australian Cricket Hall of Fame last week, but a previous breakdown in relationships with senior players is still hanging over his head. A crisis meeting between CA chiefs and senior players last year was needed to address the issues between players and coach, sparking suggestions Langer was in danger of not having his contract renewed. The former Australian Test opener has since taken a step back and delegated more responsibility to his support staff, which has seemingly helped improve the team’s performance. Australia won its maiden T20 World Cup title in November before retaining the Ashes with a comprehensive 4-0 series victory over England. Several high-profile former cricketers have jumped to Langer’s defence , including long-time friend and West Australian teammate Damien Martyn. “It’s crazy … Took us from our darkest days to here,” Martyn tweeted, referencing Langer’s revival of the Test team following the infamous ball-tampering in 2018. Former England captain Michael Vaughan, who spent the summer in Australia commentating on the Ashes series, said Langer’s record should be enough for him to be re-signed. “If it’s true the coach of Australia has to reapply for his position when he has taken them to No. 1 Test team in the World & the T20 World Cup champs in the last few months. The landscape for success has hugely changed … Isn’t it about winning?” he posted on Twitter. It’s been reported Langer won’t go on the upcoming tour of Pakistan unless his contract situation is sorted. The Australian’s Peter Lalor has reported Langer’s fate would be decided at a CA board meeting on Friday. With NCA NewsWire A rising Aussie star bowled her heart out for Australia in last weekend’s thrilling draw and wants to do the same more and more. The Justin Langer contract storm has descended into farce amid claims and now counterclaims from Cricket Australia. The Justin Langer contract situation has descended into farce amid claims and now counterclaims from Cricket Australia.","image_url":null,"source_id":"news"},{"title":"‘Offensive’ Langer insult is just not cricket","link":"https://www.cairnspost.com.au/sport/cricket/justin-langer-hung-out-to-dry-by-cricket-australia-amid-coaching-contract-saga/news-story/69be99c204a82f3350ccecca6b8dd3f1","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Cricket Australia has been accused of hanging Justin Langer out to dry following a successful home Ashes campaign, with the coach’s contract saga showing no signs of slowing down.","content":null,"pubDate":"2022-02-01 18:25:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"To progress from U-19 to first-class level, we need to put in double effort, says India captain Yash Dhull","link":"https://www.indiatvnews.com/sports/cricket/to-progress-from-u-19-to-first-class-level-we-need-to-put-in-double-effort-says-india-captain-yash-dhull-2022-02-01-757523","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli rose through the ranks and successfully led the Indian team while while Unmukt Chand failed to place his foot in the Indian cricket even after clinching the Under-19 World Cup for the Boys in Blue. Even after stellar stints as the Indian skipper in the prestigious U19 tournament, cricketers have to put in hard yards in the domestic cricket and prove their mettle.","content":null,"pubDate":"2022-02-01 16:47:09","full_description":"rose through the ranks and successfully led the Indian team while while Unmukt Chand failed to place his foot in the Indian cricket even after clinching the Under-19 World Cup for the Boys in Blue. Even after stellar stints as the Indian skipper in the prestigious U19 tournament, cricketers have to put in hard yards in the domestic cricket and prove their mettle. The story of star junior cricketers of their times, all hailing from India's capital city, unfolded very differently and Yash Dhull is completely aware about the assortment of examples that's there in-front of him. Before his team's ICC U-19 World Cup semi-final against Australia on Wednesday, skipper Dhull made no bones about the fact that the actual fight will start after the mega event. \"We will need to work doubly harder after this level and need to improve even more. We need to be consistent and perform regularly so that the transition from U-19 to first-class level is quick enough and in turn, we get picked quickly. So we need to concentrate on our game and work hard,\" Dhull said on the eve of the match. He and some of his U-19 colleagues are part of auctions which will certainly be at the back of their minds as they focus on the big semi-final. \"IPL auction is there and I am trying to focus on the present, whatever has to happen will happen and if I keep my focus on the game and do well, it will only be beneficial for me going forward,\" he said. The head of National Cricket Academy VVS Laxman is in the West Indies guiding the boys and it has been a dream come true for them to get advice from the maestro. \"Laxman sir, he shares his experiences, which will help us in coming games, mindset, preparation. When I was in isolation, he called up regularly and had video calls where he motivated me and told me to remain positive and in good frame for coming games,\" Dhull said. The soft-spoken Dhull has a quiet confidence about him. When asked what will be the strategy considering that the strip at the Coolidge ground hasn't exactly been a batter's paradise, he spoke like a 'pro'. \"We will assess the match situation and decide on what will be our approach. Unless we play on the track, it's difficult to say,\" Dhull said. India have had a slight collapse in the Bangladesh game but Dhull isn't overawed by the Australian bowling attack. \"It's a normal attack. We have played for so many years and prepared for this level,\" he answered calmly. \"We will focus on partnerships and will try to capitalise at end overs.\"","image_url":null,"source_id":"indiatvnews"},{"title":"“Not far off the IPL”: Michael Vaughan hails Pakistan Super League as second-best T20 tournament in the world","link":"https://thesportsrush.com/cricket-news-not-far-off-the-ipl-michael-vaughan-hails-pakistan-super-league-as-second-best-t20-tournament-in-the-world/","keywords":["Cricket","Michael vaughan","Pakistan Super League","PSL","PSL 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Michael Vaughan hails Pakistan Super League and its standard of quality of Cricket as second best in the world at the moment. The seventh season of the Pakistan Super League (PSL) is up and running with the 8th match of the marquee tournament currently undergoing between Multan Sultans and Islamabad United at the National Stadium… The post “Not far off the IPL”: Michael Vaughan hails Pakistan Super League as second-best T20 tournament in the world appeared first on The SportsRush.","content":"Michael Vaughan hails Pakistan Super League and its standard of quality of Cricket as second best in the world at the moment. The seventh season of the Pakistan Super League (PSL) is up and running with the 8th match of the marquee tournament currently undergoing between Multan Sultans and Islamabad United at the National Stadium in Karachi. The tournament will comprise of a total of 34 matches, with Karachi hosting a total of 15 of them and Lahore in-charge of the business end. The PSL, with its inception in the year 2016, has unarguably helped Pakistan Cricket Board (PCB) massively in bringing International Cricket back to the country. With the participation of Overseas players increasing with each edition of the league, Pakistan’s premier T20 tournament is right up there in terms of quality when compared with other T20 leagues in the world. Michael Vaughan hails Pakistan Super League Former England batter and skipper Michael Vaughan, on Tuesday took to his social media handle to speak highly of the T20 league. The 47-year-old even went on to remark that it is the second best T20 tournament of world, and is not far off from the IPL either in terms of quality of Cricket. Pakistan Super league is the 2nd best T20 Tournament in the World .. it’s not far off the IPL either .. Outstanding standard of cricket .. #Pakistan #PSL — Michael Vaughan (@MichaelVaughan) February 1, 2022 Vaughan’s statement comes at a time when as many as 22 players from England are currently partaking in the league. The likes of Alex Hales, Chris Jordan, Samit Patel, Joe Clark, Lewis Gregory, David Willey, Ben Duckett, Tom Kohler-Cadmore and Ben Dunk are some of the English T20 stars who have already played a game or two for their respective franchises in the ongoing season. England’s cricket board had faced quite some flak from fans and former cricketers after a controversial cancellation of their tour of both the men’s and the women’s side to Pakistan in September last year. Following the criticism, the ECB have made amends with a renegotiation with the PCB. The England men’s side are now scheduled to tour Pakistan twice later this year. The post “Not far off the IPL”: Michael Vaughan hails Pakistan Super League as second-best T20 tournament in the world appeared first on The SportsRush.","pubDate":"2022-02-01 16:44:00","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Sreesanth IPL teams: When was the last time Sreesanth played in IPL?","link":"https://thesportsrush.com/cricket-news-sreesanth-ipl-teams-when-was-the-last-time-sreesanth-played-in-ipl/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL","IPL 2022 mega auction","S Sreesanth"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sreesanth IPL teams: S Sreesanth is part of the 590 shortlisted players who would go under the hammer in the upcoming mega auction. The Indian and Keralite right-arm pacer S Sreesanth is amongst the 590 players that the IPL governing council sent out on Tuesday, in what is the final auction list the 10 franchises… The post Sreesanth IPL teams: When was the last time Sreesanth played in IPL? appeared first on The SportsRush.","content":"Sreesanth IPL teams: S Sreesanth is part of the 590 shortlisted players who would go under the hammer in the upcoming mega auction. The Indian and Keralite right-arm pacer S Sreesanth is amongst the 590 players that the IPL governing council sent out on Tuesday, in what is the final auction list the 10 franchises have agreed upon. With a total of 1,214 players having registered themselves the past week, the final list now has been trimmed down to less than half the original number, which also includes 44 new names upon the request of the franchises. Of the 590 players, 228 are capped players, 355 are uncapped players and seven belong to Associate Nations. S Sreesanth makes it to the list of these 228 capped players, and the Kerala-born pacer has registered himself in the base price bracket of INR 50 Lakh. Sreesanth IPL teams Upon finding his name in the final auction list, an elated Sreesanth took to his social media handle to express his happiness, while thanking all his fans for supporting him throughout. Love u all..can’t thank u all enough..lots of gratitude Thnks a lot..#grateful and alwys will be grateful to each and every try one of u..plss do keep me in ur prayers for final auction too..”om Nama Shivaya..” pic.twitter.com/XAyBGx9IVU — Sreesanth (@sreesanth36) February 1, 2022 It is worth of a mention that the 38-year-old last played for the Rajasthan Royals (RR) in IPL 2013, and had also registered his name during the previous mini auction in 2021 for a base price of INR 75 Lakh, but unfortunately couldn’t make it to the final list of players the eight franchises were interested in. The right-arm pacer has played a total of 44 IPL matches for three franchises in Rajasthan Royals, Kochi Tuskers Kerala, and Kings XI Punjab, and has picked up a total of 44 wickets till date. He recently played in the Vijay Hazare Trophy during the 2020/21 season where he picked up a total of 13 wickets in 6 innings at an average of 24.38 for Kerala. The right-handed pacer was banned for life by the BCCI in September 2013 while playing for the Rajasthan Royals, after his alleged involvement in the spot-fixing scandal came to light. The ban was reduced to seven years by a BCCI Ombudsman in 2019, and he was cleared to return to professional Cricket by September 2020. Prior to that, he had played a total of 10 T20Is for team India and picked up a total of 7 wickets at an average of 41.14 and at an economy rate of 8.47. The post Sreesanth IPL teams: When was the last time Sreesanth played in IPL? appeared first on The SportsRush.","pubDate":"2022-02-01 15:34:56","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Marquee player meaning in cricket: What is Marquee player in IPL auction?","link":"https://thesportsrush.com/cricket-news-marquee-player-meaning-in-cricket-what-is-marquee-player-in-ipl-auction/","keywords":["Cricket","IPL 2022","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Marquee player: A total of 10 players have been listed in the Marquee set ahead of Indian Premier League 2022 auction. A total of 10 cricketers comprising of four batters, four fast bowlers, one wicket-keeper batter and a spinner will go under the hammer on priority basis in the mega auction for the upcoming 15th… The post Marquee player meaning in cricket: What is Marquee player in IPL auction? appeared first on The SportsRush.","content":"Marquee player: A total of 10 players have been listed in the Marquee set ahead of Indian Premier League 2022 auction. A total of 10 cricketers comprising of four batters, four fast bowlers, one wicket-keeper batter and a spinner will go under the hammer on priority basis in the mega auction for the upcoming 15th season of the Indian Premier League. In the general run of things, an IPL auction sees players getting sold in order of their primary skill, i.e., batter, wicket-keeper batter, all-rounder and bowler. What is Marquee player in IPL auction? A marquee set, on the other hand, is an elite category of leading players whose turn to go under the hammer comes in the first set itself. It is after these 10 players’ chance of alluring a bid comes an opportunity for other players who are sold on the basis of their primary skill (as mentioned above). India batters Shikhar Dhawan (Delhi Capitals in IPL 2021) and Shreyas Iyer (Capitals), Australia batter David Warner (Sunrisers Hyderabad), former South Africa captain Faf du Plessis (Chennai Super Kings), India fast bowler Mohammed Shami (Punjab Kings), Australia Test captain Pat Cummins (Kolkata Knight Riders), New Zealand fast bowler Trent Boult (Mumbai Indians), South Africa fast bowler Kagiso Rabada (Capitals), South Africa wicket-keeper batter Quinton de Kock (Indians) and India spinner Ravichandran Ashwin (Capitals) are the 10 players whose names will kick-start the mega auction. As far as IPL 2021 squads are concerned, Capitals have as many as four nominations in the marquee set for IPL 2022 auction. Indians, most successful IPL franchise ever, have a couple of players from their IPL 2021 squad. While Sunrisers, Super Kings, Kings and Knight Riders have a player each, Rajasthan Royals is the only team to not have an IPL 2021 player in the marquee set. Which 7⃣ players from around the should join @AnrichNortje02 Make your suggestions #YehHaiNayiDilli #DilliKyaChahtaHai #IPLAuction #IPL2022 pic.twitter.com/OctZtJnQFr — Delhi Capitals (@DelhiCapitals) February 1, 2022 There is no hiding to the fact that these aforementioned players are highly likely to earn opulent amounts individually in IPL 2022 auction. Some high-profile names to have missed out on the marquee set are Ishan Kishan, Yuzvendra Chahal, Shardul Thakur, Deepak Chahar, Dinesh Karthik, Jason Holder, Jonny Bairstow, Mitchell Marsh etc. The post Marquee player meaning in cricket: What is Marquee player in IPL auction? appeared first on The SportsRush.","pubDate":"2022-02-01 15:12:58","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"IPL 2022: Hardik Pandya says he is `excited` to play for Ahmedabad but will `miss` Mumbai Indians - Zee News","link":"https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3plZW5ld3MuaW5kaWEuY29tL2NyaWNrZXQvaXBsLTIwMjItaGFyZGlrLXBhbmR5YS1zYXlzLWhlLWlzLWV4Y2l0ZWQtdG8tcGxheS1mb3ItYWhtZWRhYmFkLWJ1dC13aWxsLW1pc3MtbXVtYmFpLWluZGlhbnMtMjQzMjc4Mi5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Hardik Pandya says he is `excited` to play for Ahmedabad but will `miss` Mumbai Indians  Zee NewsIt's a surprise for everyone: Hardik on whether he'll bowl in IPL 2022 | Cricbuzz.com - Cricbuzz  Cricbuzz'Hardik Pandya with bat and ball sounds better than just a batter'  ESPNcricinfoTaking time off from sport was to prepare for T20 World Cup 2022: Hardik Pandya | Cricket News  Times of India'When someone is having bad day...': Hardik takes a leaf out of Dhoni's book, reveals 'philosophy' as Ahmedabad captain  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-02-01 14:44:20","image_url":null,"source_id":"google"},{"title":"IPL 2022 Auctions: Full List of Players with INR 50 Lakh Base Price – From Cheteshwar Pujara, S Sreesanth, - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMizwFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaXBsLTIwMjItYXVjdGlvbnMtZnVsbC1saXN0LW9mLXBsYXllcnMtd2l0aC1pbnItNTAtbGFraC1iYXNlLXByaWNlLWZyb20tY2hldGVzaHdhci1wdWphcmEtcy1zcmVlc2FudGgtc2hpdmFtLWR1YmUtdG8tbWFyY28tamFuc2VuLWZpZGVsLWVkd2FyZHMtcWFpcy1haG1lZC00NzIzMjcxLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 Auctions: Full List of Players with INR 50 Lakh Base Price – From Cheteshwar Pujara, S Sreesanth,  News18Archer back in IPL auction, to be available from 2023 season | Cricbuzz.com - Cricbuzz  CricbuzzIyer, Warner, Ashwin, Rabada and Shami among marquee set at IPL 2022 auction  ESPNcricinfoIPL 2022 Auction: Probable List Of Players Sunrisers Hyderabad (SRH) Might Target As Per Available Slots  Cricket AddictorIPL 2022 Auction: Top All-rounders ft. DJ Bravo & Washington Sundar  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-02-01 13:29:07","image_url":null,"source_id":"google"},{"title":"CWG 2022: Final list for cricket at Birmingham 2022 confirmed as Sri Lanka become 8th side to qualify for the T20 tournament","link":"https://www.sportskeeda.com/cricket/cwg-2022-final-list-cricket-birmingham-2022-confirmed-sri-lanka-become-8th-side-qualify-t20-tournament?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Yash Mittal"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-01 13:22:50","full_description":"Cricket has become the first sport to complete its line-up for the upcoming Commonwealth Games which are set to take place in Birmingham later this year. On Monday, Sri Lanka was confirmed as the eighth side to participate in the Women's T20 tournament during a joint announcement by the International Cricket Council (ICC) and Commonwealth Games Federation (CGT). The announcement came after the island nation won the Commonwealth Games Qualifier in Kuala Lumpur last week. Their participation was subsequently ratified by the CGF. Speaking to the media during the joint announcement, ICC Chief Executive Geoff Allardice said: The upcoming edition of the Commonwealth Games will see as many as 4500 athletes from 72 nations compete for glory in Birmingham between July 28 and August 8. The 2022 edition of CWG will be a historic event for the game as it will be the first time since 1998 that the sport will make its presence at the coveted games. It was last part of the Commonwealth Games in Kuala Lumpur 1998 where Shaun Pollock's South Africa defeated Steve Waugh's Australian team to claim the gold medal. Sri Lanka has joined the likes of Australia, England, India, New Zealand, South Africa, Pakistan and Barbados as the 8th team gunning for glory this July. Dame Louise Martin, president of the CFG, said: The eight teams will be divided in two groups during the league stage with Australia, India, Barbados and Pakistan forming group A and New Zealand, South Africa, Sri Lanka and hosts England being in the other. The T20 tournament will get underway on July 29 with a battle between the 2020 T20 World Cup finalists Australia and India. The bronze and gold medal matches are scheduled to take place on August 07.","image_url":"https://static.sportskeeda.com/editor/2022/02/d74ad-16437171989183-1920.jpg","source_id":"sportskeeda"},{"title":"2022 Commonwealth Games: India to face Australia in opening match as cricket makes historic comeback","link":"https://www.indiatoday.in/sports/cricket/story/2022-commonwealth-games-india-to-face-australia-in-opening-match-as-cricket-makes-historic-comeback-1907355-2022-02-01?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"2022 CWG: India to face Australia in opening match as cricket makes historic comeback","content":null,"pubDate":"2022-02-01 12:48:41","full_description":"Cricket will mark its return to the Commonwealth Games after a gap of 24 years with India taking on Australia on July 29 in the 2022 Birmingham edition. The league-cum-knockout women's tournament kicks off with a match between women's 2020 T20 World Cup finalists Australia and India on July 29, with the bronze and gold medal matches scheduled for August 7. Cricket is the first discipline to announce its complete line-up for the Birmingham 2022 Commonwealth Games after Sri Lanka was confirmed as the eighth team in the women's T20 tournament, the ICC said on Tuesday. The announcement was made jointly by the International Cricket Council and the Commonwealth Games Federation (CGF) following Sri Lanka's victory in the Commonwealth Games Qualifier in Kuala Lumpur last week and the subsequent CGF ratification of the island nation's entry. Australia, Barbados, England, India, New Zealand, South Africa and Pakistan have already qualified as women's cricket makes its first entry into the Commonwealth Games. It will only be the second time that cricket features in the multi-discipline event after a men's competition was part of the Games in Kuala Lumpur in 1998 and is considered a massive opportunity to bring the game to new audiences. A Shaun Pollock-led South Africa had won the gold on that occasion, beating Steve Waugh's Australian side by four wickets in the final. ICC Hall of Famers Sachin Tendulkar of India, Jacques Kallis of South Africa and Mahela Jayawardene of Sri Lanka were among the many stars featuring in the 1998 Games. Barbados and Pakistan are in Group A along with Australia and India while England, New Zealand, South Africa and Sri Lanka form Group B. The ICC, CGF and Commonwealth Games Sri Lanka congratulated Sri Lanka for their qualification and looked forward to an exciting tournament. ICC Chief Executive Geoff Allardice said: \"It's good to have finalised the identity of the teams participating in the Commonwealth Games. We will have eight of the best teams competing for the gold and I am sure we will get to watch a highly competitive tournament. \"The Commonwealth Games are an important part of the women's cricket calendar over the next year. It is a huge opportunity for us to take cricket beyond the traditional strongholds and give more people around the world the chance to enjoy the game.\" CGF President Dame Louise Martin said: \"Cricket is a sport synonymous with the Commonwealth. We are so excited to have it back in the Games for the first time since the men's 50 over competition at Kuala Lumpur in 1998. \"The debut of women's T20 cricket will be a historic moment and a wonderful showcase of women's sport across the world.\" The Birmingham Commonwealth Games, being held from July 28 to August 8, will see 4,500 athletes from 72 nations and territories compete across 11 days. Birmingham 2022 will be the first major multi-sport event in history to award more medals to women than men.","image_url":null,"source_id":"indiatoday"},{"title":"England U19 vs Afghanistan U19 Live Cricket Score, ENG-U19 vs AFG-U19 Live Score Updates from Antigua","link":"https://www.indiatvnews.com/sports/cricket/england-vs-afghanistan-live-cricket-score-icc-u19-world-cup-2022-semifinal-engu19-vs-afgu19-match-latest-updates-from-antigua-2022-02-01-757481","keywords":null,"creator":null,"video_url":null,"description":"England U19 vs Afghanistan U19 Live Cricket Score, ENG-U19 vs AFG-U19 Live Score Updates from Antigua","content":null,"pubDate":"2022-02-01 12:31:26","full_description":"Bilal Sayedi, Nangeyalia kharote, Allah Noor, Suliman Safi(c), Ijaz Ahmad Ahmadzai, Abdul Hadi, Mohammad Ishaq(w), Noor Ahmad, Izharulhaq Naveed, Bilal Sami, Naveed Zadran, Ijaz Ahmad Azad, Suliman Arabzai, Bilal Ahmad, Khaiber Wali, Nangyalai Khan, Faisal Khan Ahmadzai, Khalel Ahmad, Mohammadullah Najibullah, Shahidullah Hasani George Thomas, Jacob Bethell, Tom Prest(c), James Rew, William Luxton, George Bell, Rehan Ahmed, Alex Horton(w), James Sales, Thomas Aspinwall, Joshua Boyden, Nathan Barnwell, Benjamin Cliff, Fateh Singh, James Coles","image_url":null,"source_id":"indiatvnews"},{"title":"BCCI Confirms IPL 2022 Auction Dates, Final List Pruned To 590 Players","link":"https://www.sentinelassam.com/sports/cricket/bcci-confirms-ipl-2022-auction-dates-final-list-pruned-to-590-players-575927","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The auction for 2022 edition of the cash rich Indian Premier League (IPL) will feature a total of 370 Indian players and 220 foreign players.","content":"New Delhi: The Board of Control for Cricket in India (BCCI), through a press release, has confirmed that the auction for IPL 2022 will be held on February 12 and 13 in Bengaluru.The final list of the players that will go under the hammer at the IPL 2022 Auction has been finalized with a total of 590 players making it to the final list from the original tally of 1214.As per the wishlist of the 10 participating franchises, 44 new names have also been added to this list.The auction will get underway with the marquee set comprising ten star players including Ravichandran Ashwin, Trent Boult, Pat Cummins, Quinton de Kock, Shikhar Dhawan, Faf du Plessis, Shreyas Iyer, Kagiso Rabada, Mohammed Shami and David Warner.The highest reserve price is INR 2 crore with 48 players opting to place themselves under this bracket. 20 players in the auction list have a reserve price of INR 1.5 crore while 34 players are in the list of cricketers with a reserve price of INR 1 crore.India's Under 19 stars which includes the likes of Yash Dhull, Vicky Oswal, Rajvardhan Hangargekar along with some of the already established Indian cricketers such as Devdutt Padikkal, Harshal Patel, Krunal Pandya, Avesh Khan, Deepak Hooda, etc will be looking to cash in and make their mark during the action and then, in the competition.The auction for 2022 edition of the cash rich Indian Premier League (IPL) will feature a total of 370 Indian players and 220 foreign players.English fast bowling sensation Jofra Archer, who played for the Rajasthan Royals in the previous editions, has also registered for the auction but he is most likely to miss out on this year's edition due to an injury.The number of participating teams in the IPL have been increased to 10 from the earlier 8. Two new franchises, Lucknow and Ahmedabad, have been added to the competition.Chennai Super Kings are the defending champions of the IPL, having lifted the trophy for the fourth time during last year's edition.Also read: When I heard it, I was really surprised: Ponting on Kohli quitting Test captaincyAlso watch: ","pubDate":"2022-02-01 11:02:36","full_description":"New Delhi: The Board of Control for Cricket in India (BCCI), through a press release, has confirmed that the auction for IPL 2022 will be held on February 12 and 13 in Bengaluru. The final list of the players that will go under the hammer at the IPL 2022 Auction has been finalized with a total of 590 players making it to the final list from the original tally of 1214. As per the wishlist of the 10 participating franchises, 44 new names have also been added to this list. The auction will get underway with the marquee set comprising ten star players including Ravichandran Ashwin, Trent Boult, Pat Cummins, Quinton de Kock, Shikhar Dhawan, Faf du Plessis, Shreyas Iyer, Kagiso Rabada, Mohammed Shami and David Warner . The highest reserve price is INR 2 crore with 48 players opting to place themselves under this bracket. 20 players in the auction list have a reserve price of INR 1.5 crore while 34 players are in the list of cricketers with a reserve price of INR 1 crore. India's Under 19 stars which includes the likes of Yash Dhull, Vicky Oswal, Rajvardhan Hangargekar along with some of the already established Indian cricketers such as Devdutt Padikkal, Harshal Patel, Krunal Pandya, Avesh Khan, Deepak Hooda, etc will be looking to cash in and make their mark during the action and then, in the competition. The auction for 2022 edition of the cash rich Indian Premier League (IPL) will feature a total of 370 Indian players and 220 foreign players. English fast bowling sensation Jofra Archer, who played for the Rajasthan Royals in the previous editions, has also registered for the auction but he is most likely to miss out on this year's edition due to an injury. The number of participating teams in the IPL have been increased to 10 from the earlier 8. Two new franchises, Lucknow and Ahmedabad, have been added to the competition. Chennai Super Kings are the defending champions of the IPL, having lifted the trophy for the fourth time during last year's edition. Also read: When I heard it, I was really surprised: Ponting on Kohli quitting Test captaincy Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/01/306166-1600x9601195187-ipl.jpg","source_id":"sentinel"},{"title":"It's a surprise for everyone: Hardik on whether he'll bowl in IPL 2022 | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vd3d3LmNyaWNidXp6LmNvbS9jcmlja2V0LW5ld3MvMTIwOTA2L2l0cy1hLXN1cnByaXNlLWZvci1ldmVyeW9uZS1oYXJkaWstb24td2hldGhlci1oZWxsLWJvd2wtaW4taXBsLTIwMjItY3JpY2J1enpjb23SAX1odHRwOi8vbS5jcmljYnV6ei5jb20vYW1wL2NyaWNrZXQtbmV3cy8xMjA5MDYvaXRzLWEtc3VycHJpc2UtZm9yLWV2ZXJ5b25lLWhhcmRpay1vbi13aGV0aGVyLWhlbGwtYm93bC1pbi1pcGwtMjAyMi1jcmljYnV6emNvbQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"It's a surprise for everyone: Hardik on whether he'll bowl in IPL 2022 | Cricbuzz.com - Cricbuzz  Cricbuzz'Felt everything was thrown at me’: Hardik reveals he bowled in T20 WC despite being unable to; ‘Was in team as batsman’  Hindustan TimesTaking time off from sport was to prepare for T20 World Cup 2022: Hardik Pandya | Cricket News  Times of IndiaIt's a surprise for everyone: Hardik on whether he'll bowl in IPL 2022 | Cricbuzz.com  Cricbuzz'Won't be surprised as he didn't perform well': Ex-India cricketer predicts huge demotion of Hardik in central contracts  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-02-01 11:00:36","image_url":null,"source_id":"google"},{"title":"India, Australia to open cricket competition in Birmingham CWG","link":"https://www.indiatvnews.com/sports/cricket/cricket-becomes-first-discipline-to-confirm-lineup-for-birmingham-commonwealth-games-2022-02-01-757454","keywords":null,"creator":null,"video_url":null,"description":"Cricket will mark its return to the Commonwealth Games after a gap of 24 years with India taking on Australia on July 29 in the 2022 Birmingham edition.","content":null,"pubDate":"2022-02-01 10:25:12","full_description":"Cricket will mark its return to the Commonwealth Games after a gap of 24 years with India taking on Australia on July 29 in the 2022 Birmingham edition. The league-cum-knockout women's tournament kicks off with a match between women's 2020 T20 World Cup finalists Australia and India on July 29, with the bronze and gold medal matches scheduled for August 7. Cricket is the first discipline to announce its complete line-up for the Birmingham 2022 Commonwealth Games after Sri Lanka was confirmed as the eighth team in the women's T20 tournament, the ICC said on Tuesday. The announcement was made jointly by the International Cricket Council and the Commonwealth Games Federation (CGF) following Sri Lanka's victory in the Commonwealth Games Qualifier in Kuala Lumpur last week and the subsequent CGF ratification of the island nation's entry. Australia, Barbados, England, India, New Zealand, South Africa and Pakistan have already qualified as women's cricket makes its first entry into the Commonwealth Games. It will only be the second time that cricket features in the multi-discipline event after a men's competition was part of the Games in Kuala Lumpur in 1998 and is considered a massive opportunity to bring the game to new audiences. A Shaun Pollock-led South Africa had won the gold on that occasion, beating Steve Waugh's Australian side by four wickets in the final. ICC Hall of Famers of India, Jacques Kallis of South Africa and Mahela Jayawardene of Sri Lanka were among the many stars featuring in the 1998 Games. Barbados and Pakistan are in Group A along with Australia and India while England, New Zealand, South Africa and Sri Lanka form Group B. The ICC, CGF and Commonwealth Games Sri Lanka congratulated Sri Lanka for their qualification and looked forward to an exciting tournament. ICC Chief Executive Geoff Allardice said: \"It's good to have finalised the identity of the teams participating in the Commonwealth Games. We will have eight of the best teams competing for the gold and I am sure we will get to watch a highly competitive tournament. \"The Commonwealth Games are an important part of the women's cricket calendar over the next year. It is a huge opportunity for us to take cricket beyond the traditional strongholds and give more people around the world the chance to enjoy the game.\" CGF President Dame Louise Martin said: \"Cricket is a sport synonymous with the Commonwealth. We are so excited to have it back in the Games for the first time since the men's 50 over competition at Kuala Lumpur in 1998. \"The debut of women's T20 cricket will be a historic moment and a wonderful showcase of women's sport across the world.\" The Birmingham Commonwealth Games, being held from July 28 to August 8, will see 4,500 athletes from 72 nations and territories compete across 11 days. Birmingham 2022 will be the first major multi-sport event in history to award more medals to women than men.","image_url":null,"source_id":"indiatvnews"},{"title":"IPL 2022 Auction: Full list of players with base price of Rs 1.5 crore","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-auction/ipl-2022-mega-auction-players-full-list-base-price-15-crore-pool/article38358325.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"IPL 2022 Auction Players' List: This will be the 15th season of the IPL and some of the biggest stars of world cricket will be coming together to light up the prestigious tournament.","content":null,"pubDate":"2022-02-01 10:13:20","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"IPL Auction: Dhawan, Shreyas, Ashwin in top bracket along with Cummins, Rabada, Marsh, Smith - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMisgFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLWF1Y3Rpb24tZGhhd2FuLXNocmV5YXMtYXNod2luLWluLXRvcC1icmFja2V0LWFsb25nLXdpdGgtY3VtbWlucy1yYWJhZGEtbWFyc2gtc21pdGgvYXJ0aWNsZXNob3cvODkyNzIzNDEuY21z0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL Auction: Dhawan, Shreyas, Ashwin in top bracket along with Cummins, Rabada, Marsh, Smith  Times of IndiaArcher back in IPL auction, to be available from 2023 season | Cricbuzz.com - Cricbuzz  CricbuzzIyer, Warner, Ashwin, Rabada and Shami among marquee set at IPL 2022 auction  ESPNcricinfoIPL 2022 Auction: Probable List Of Players Sunrisers Hyderabad (SRH) Might Target As Per Available Slots  Cricket AddictorIPL 2022 Auction: Top overseas bowlers ft. Trent Boult & Pat Cummins  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-02-01 09:56:00","image_url":null,"source_id":"google"},{"title":"India-West Indies ODI series to be played behind closed doors, says GCA","link":"https://www.indiatvnews.com/sports/cricket/india-west-indies-odi-series-to-be-played-behind-closed-doors-says-gujarat-cricket-association-2022-02-01-757446","keywords":null,"creator":null,"video_url":null,"description":"No in-stadium spectators will be allowed during the three-match ODI series between India and West Indies, the Gujarat Cricket Association (GCA) said on Tuesday. All the fixtures will be played behind closed doors owing to the COVID-19 pandemic. Rohit Sharma's India will take Kieron Pollard's side in the 50-over game format from February 6 to 11.","content":null,"pubDate":"2022-02-01 09:55:52","full_description":"No in-stadium spectators will be allowed during the three-match ODI series between India and West Indies, the Gujarat Cricket Association (GCA) said on Tuesday. All the fixtures will be played behind closed doors owing to the COVID-19 pandemic. 's India will take Kieron Pollard's side in the 50-over game format from February 6 to 11. The matches will be played at the Narendra Modi Stadium. \"We are all set to host West Indies Tour of India ODI Series 2022. 1st ODI on 6th of Feb will be a very special and historic match as India will be playing it's 1000th ODI. Indian team will be the first cricket team in the world to achieve this feat. @BCCI #INDvsWI #teamindia,\" the GCA tweeted. \"Considering the current situation, all the matches will be played behind the closed doors,\" the state cricket body said in another tweet. After the ODIs, the two teams are scheduled to play a three-match T20 International series in Kolkata, for which the West Bengal government has allowed 75 percent crowd attendance.","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket becomes first discipline to confirm lineup for Birmingham Commonwealth Games","link":"https://indianexpress.com/article/sports/cricket/cricket-becomes-first-discipline-to-confirm-lineup-for-birmingham-commonwealth-games-7751396/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-01 09:52:43","full_description":"Cricket is the first discipline to announce its complete line-up for the Birmingham 2022 Commonwealth Games after Sri Lanka was confirmed as the eighth team in the women’s T20 tournament, the ICC said on Tuesday. The announcement was made jointly by the International Cricket Council and the Commonwealth Games Federation (CGF) following Sri Lanka’s victory in the Commonwealth Games Qualifier in Kuala Lumpur last week and the subsequent CGF ratification of the island nation’s entry. Australia, Barbados, England , India, New Zealand, South Africa and Pakistan have already qualified as women’s cricket makes its first entry into the Commonwealth Games. It will only be the second time that cricket features in the multi-discipline event after a men’s competition was part of the Games in Kuala Lumpur in 1998 and is considered a massive opportunity to bring the game to new audiences. A Shaun Pollock-led South Africa had won the gold on that occasion, beating Steve Waugh’s Australian side by four wickets in the final. ICC Hall of Famers Sachin Tendulkar of India, Jacques Kallis of South Africa and Mahela Jayawardene of Sri Lanka were among the many stars featuring in the Games then. The league-cum-knockout tournament this time kicks off with a match between women’s 2020 T20 World Cup finalists Australia and India on July 29, with the bronze and gold medal matches scheduled for August 7. Top Sports News Now When Nadal’s Plan A didn’t work, he had Plan B, C, D… Why Medvedev says he would prefer playing in Russia over Wimbledon, French Open The loneliest mountaineer on Everest Click here for more Barbados and Pakistan are in Group A along with Australia and India while England, New Zealand, South Africa and Sri Lanka form Group B. The ICC, CGF and Commonwealth Games Sri Lanka congratulated Sri Lanka for their qualification and looked forward to an exciting tournament. ICC Chief Executive Geoff Allardice said: “It’s good to have finalised the identity of the teams participating in the Commonwealth Games. We will have eight of the best teams competing for the gold and I am sure we will get to watch a highly competitive tournament. “The Commonwealth Games are an important part of the women’s cricket calendar over the next year. It is a huge opportunity for us to take cricket beyond the traditional strongholds and give more people around the world the chance to enjoy the game.” CGF President Dame Louise Martin said: “Cricket is a sport synonymous with the Commonwealth. We are so excited to have it back in the Games for the first time since the men’s 50 over competition at Kuala Lumpur in 1998. “The debut of women’s T20 cricket will be a historic moment and a wonderful showcase of women’s sport across the world.” The Birmingham Commonwealth Games, being held from July 28 to August 8, will see 4,500 athletes from 72 nations and territories compete across 11 days. Birmingham 2022 will be the first major multi-sport event in history to award more medals to women than men.","image_url":null,"source_id":"indianexpress"},{"title":"India, Australia To Open Cricket Competition In Birmingham CWG","link":"https://sports.ndtv.com/cricket/india-australia-to-open-cricket-competition-in-birmingham-commonwealth-games-2742271","keywords":null,"creator":null,"video_url":null,"description":"Cricket will mark its return to the Commonwealth Games after a gap of 24 years with India taking on Australia on July 29 in the 2022 Birmingham edition.","content":null,"pubDate":"2022-02-01 09:39:16","full_description":"Cricket will mark its return to the Commonwealth Games after a gap of 24 years with India taking on Australia on July 29 in the 2022 Birmingham edition. The league-cum-knockout women's tournament kicks off with a match between women's 2020 T20 World Cup finalists Australia and India on July 29, with the bronze and gold medal matches scheduled for August 7. Cricket is the first discipline to announce its complete line-up for the Birmingham 2022 Commonwealth Games after Sri Lanka was confirmed as the eighth team in the women's T20 tournament, the ICC said on Tuesday. The announcement was made jointly by the International Cricket Council and the Commonwealth Games Federation (CGF) following Sri Lanka's victory in the Commonwealth Games Qualifier in Kuala Lumpur last week and the subsequent CGF ratification of the island nation's entry. Australia, Barbados, England, India, New Zealand, South Africa and Pakistan have already qualified as women's cricket makes its first entry into the Commonwealth Games. It will only be the second time that cricket features in the multi-discipline event after a men's competition was part of the Games in Kuala Lumpur in 1998 and is considered a massive opportunity to bring the game to new audiences. A Shaun Pollock-led South Africa had won the gold on that occasion, beating Steve Waugh's Australian side by four wickets in the final. ICC Hall of Famers Sachin Tendulkar of India, Jacques Kallis of South Africa and Mahela Jayawardene of Sri Lanka were among the many stars featuring in the 1998 Games. Barbados and Pakistan are in Group A along with Australia and India while England, New Zealand, South Africa and Sri Lanka form Group B. The ICC, CGF and Commonwealth Games Sri Lanka congratulated Sri Lanka for their qualification and looked forward to an exciting tournament. ICC Chief Executive Geoff Allardice said: \"It's good to have finalised the identity of the teams participating in the Commonwealth Games. We will have eight of the best teams competing for the gold and I am sure we will get to watch a highly competitive tournament. \"The Commonwealth Games are an important part of the women's cricket calendar over the next year. It is a huge opportunity for us to take cricket beyond the traditional strongholds and give more people around the world the chance to enjoy the game.\" CGF President Dame Louise Martin said: \"Cricket is a sport synonymous with the Commonwealth. We are so excited to have it back in the Games for the first time since the men's 50 over competition at Kuala Lumpur in 1998. Promoted \"The debut of women's T20 cricket will be a historic moment and a wonderful showcase of women's sport across the world.\" The Birmingham Commonwealth Games, being held from July 28 to August 8, will see 4,500 athletes from 72 nations and territories compete across 11 days. Birmingham 2022 will be the first major multi-sport event in history to award more medals to women than men.","image_url":"https://c.ndtvimg.com/2021-10/cjdlns8g_india-women-cricket-team-twitter_120x90_06_October_21.jpg","source_id":"ndtv"},{"title":"Indian Premier League 2022: Player Auction list announced","link":"https://www.business-standard.com/article/sports/indian-premier-league-2022-player-auction-list-announced-122020101105_1.html","keywords":null,"creator":null,"video_url":null,"description":"This will be the 15th season of the IPL and some of the biggest stars of world cricket will be coming together to light up the prestigious tournament","content":null,"pubDate":"2022-02-01 09:39:00","full_description":"The Indian Premier League (IPL) 2022 Player Auction list is out with a total of 590 cricketers set to go under the hammer during the two-day mega auction, which will take place in Bengaluru on February 12 and 13. This will be the 15th season of the IPL and some of the biggest stars of world cricket will be coming together to light up the prestigious tournament. Amongst 590 players who have registered for the auction, 228 are capped players, 355 are uncapped players and seven belong to Associate Nations. A fierce battle to acquire the services of some of the finest Indian cricketing talent is on the cards when the likes of Shreyas Iyer, Shikhar Dhawan, R Ashwin, Mohammad Shami, Ishan Kishan, Ajinkya Rahane, Suresh Raina, Yuzvendra Chahal, Washington Sundar, Shardul Thakur, Deepak Chahar, Ishant Sharma, Umesh Yadav go under the hammer. \"The 10 IPL franchisees -- Chennai Super Kings, Delhi Capitals, Kolkata Knight Riders, Lucknow Super Giants, Mumbai Indians, Punjab Kings, Rajasthan Royals, Royal Challengers Bangalore, Sunrisers Hyderabad and Team Ahmedabad -- will also be bidding to have some of the biggest cricketing names such as Faf du Plessis, David Warner, Pat Cummins, Kagiso Rabada, Trent Boult, Quinton de Kock, Jonny Bairstow, Jason Holder, Dwayne Bravo, Shakib Al Hasan, Wanindu Hasaranga among others in their squad. \"Rs 2 crore is the highest reserve price and as many as 48 players have chosen to place themselves in this bracket,\" the BCCI said in a statement. There are 20 players in the auction list with a reserve price of Rs 1.5 crore while 34 players are in the list of cricketers with a reserve price of Rs one crore. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220201/thumb-122020101105.jpg","source_id":"business-standard"},{"title":"England U19 vs Afghanistan U19 Live Streaming And Live Telecast Details- When and Where To Watch ENG U19 vs AFG U19 Live In Your Country? ICC U19 World Cup 2022 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiyAFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vY3JpY2tldC1uZXdzL2VuZ2xhbmQtdTE5LXZzLWFmZ2hhbmlzdGFuLXUxOS1saXZlLXN0cmVhbWluZy1hbmQtbGl2ZS10ZWxlY2FzdC1kZXRhaWxzLXdoZW4tYW5kLXdoZXJlLXRvLXdhdGNoLWVuZy11MTktdnMtYWZnLXUxOS1saXZlLWluLXlvdXItY291bnRyeS1pY2MtdTE5LXdvcmxkLWN1cC0yMDIyL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England U19 vs Afghanistan U19 Live Streaming And Live Telecast Details- When and Where To Watch ENG U19 vs AFG U19 Live In Your Country? ICC U19 World Cup 2022  Cricket AddictorMatch Preview - England U19 vs Afghan U19, ICC Under-19 World Cup 2021/22, 1st Semi-Final  ESPNcricinfoWatch: \"Catch Of The Tournament?\", South Africa's Andile Simelane's Spectacular Effort vs Sri Lanka ..  NDTV SportsICC U19 World Cup 2022, England vs Afghanistan Super League Semi Final 1 Live Score: AFG Seek History Again  News18Dunith Wellalage century takes Sri Lanka to fifth-place playoffs  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-02-01 09:34:59","image_url":null,"source_id":"google"},{"title":"IPL Player Auction List 2022: Full list of players in IPL auction 2022","link":"https://thesportsrush.com/cricket-news-ipl-player-auction-list-2022-full-list-of-players-in-ipl-auction-2022/","keywords":["Cricket","IPL 2022","Auction","Indian Premier League","IPL 2022 Auction","IPL 2022 mega auction"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IPL Player Auction List 2022: Indian Premier League has released a final list of players who will be taking part in Mega Auction 2022. A grand total of 590 players will enter the Indian Premier League 2022 mega auction on February 12 and 13 in Bengaluru. The shortlisted players have been trimmed from an original… The post IPL Player Auction List 2022: Full list of players in IPL auction 2022 appeared first on The SportsRush.","content":"IPL Player Auction List 2022: Indian Premier League has released a final list of players who will be taking part in Mega Auction 2022. A grand total of 590 players will enter the Indian Premier League 2022 mega auction on February 12 and 13 in Bengaluru. The shortlisted players have been trimmed from an original list comprising of 1,214 players. Set to be a mega auction after four years (and reportedly the last at least for some years from now), IPL 2022 auction will witness some proper high-profile names to go under the hammer to promote bidding wars among 10 franchises. Some of the players taking part in the auction are Shreyas Iyer, Shikhar Dhawan, Ravichandran Ashwin, Ishan Kishan, Shardul Thakur, Deepak Chahar, David Warner, Faf du Plessis, Pat Cummins, Trent Boult, Kagiso Rabada, Quinton de Kock, Jonny Bairstow, Jason Holder etc. Full list of players in IPL auction 2022 Out of these 590 players, 228 are capped players, 355 are uncapped players and seven belong to Associate Nations. Talking about overseas countries, the most players taking part in IPL 15 auction will be from Australia (47), West Indies (34) and South Africa (33). Seven Associate players are from Namibia (3), Scotland (2), Nepal (1) and USA (1). Readers must note that a total of 217 slots (including 70 overseas players) are available across 10 teams for IPL 2022. Teams will have a combined amount of as high as INR 561.5 crore to spend across two days in this mega auction. Click here for full IPL Player Auction List 2022. Twitter reactions on IPL Player Auction List 2022: IPL 2022 MEGA AUCTION The DC family for #IPL2022 and beyond will be built on the 12th and 13th of February in Bengaluru Who’d you like to see in the DC Blue? #YehHaiNayiDilli #IPLAuction pic.twitter.com/pk1jelAyad — Delhi Capitals (@DelhiCapitals) February 1, 2022 The dates are out, the stage is set! IPL 2022 Auction will be held on February 1⃣2⃣ & 1⃣3⃣ in Bengaluru. Paltan, how excited are you for this Mega Auction#OneFamily #MumbaiIndians #AalaRe #IPLAuction pic.twitter.com/w46kn9F6RM — Mumbai Indians (@mipaltan) February 1, 2022 Let the begin – 5⃣9⃣0⃣ names to pick from if you can’t wait to see the #GalaxyOfKnights forming! #KKR #AmiKKR #IPL2022 #MegaAuction2022 #IPLAuction pic.twitter.com/H1p1e4APca — KolkataKnightRiders (@KKRiders) February 1, 2022 Think David Wiese could become a multi millionaire at the auction — Sreshth Shah (@sreshthx) February 1, 2022 For more cricket-related news, click here. The post IPL Player Auction List 2022: Full list of players in IPL auction 2022 appeared first on The SportsRush.","pubDate":"2022-02-01 09:32:07","full_description":null,"image_url":null,"source_id":"thesportsrush"}]}