{"newsArray":[{"title":"Pat Cummins delivers perfect two-word response after losing Ashes Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12284817/Pat-Cummins-delivers-perfect-two-word-response-losing-Ashes-Test.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"After enduring his first defeat in the 2023 Ashes series, Aussie skipper Pat Cummins has shut down an English reporter with a perfectly blunt two-word reply and a deadpan smirk.","content":"Pat Cummins delivers perfect two-word response after being asked if Australia are 'rattled' after losing Ashes Test - and refuses to rule out dropping David Warner Cummins gives blunt reply to reporter's question Skipper is not worried momentum may have shifted Warner is no guarantee to be selected for fourth Test By James Cooney For Daily Mail Australia and Scott Bailey For Australian Associated Press Updated: 01:07, 11 July 2023 e-mail 7 View comments After enduring his first defeat in the 2023 Ashes series, Aussie skipper Pat Cummins has shut down an English reporter with a perfectly blunt two-word reply. Australia lost the third Ashes Test at Headingley by three wickets, but still lead the series 2-1 with two Tests remaining. England have kept the battle for the urn alive, but the Aussies need to win just one of the two remaining matches to clinch their first Ashes win in England in more than two decades. When asked post-match by a reporter if he feared momentum had now shifted in favour of England, Cummins said 'not really'. The reporter pressed Cummins to explain, asking, 'Why not?' Cummins with the mic drop moment ¿ #Ashes | #AUSvENG pic.twitter.com/Abyui4KljJ — ESPNcricinfo (@ESPNcricinfo) July 10, 2023 The Aussies need to win just one of the two remaining matches to clinch their first Ashes win in England in more than two decade To which Cummins replied bluntly with a smirk: 'Two-one'. Cummins has also admitted David Warner is no guarantee to be selected for the fourth Ashes Test, conceding that Mitch Marsh will be incredibly hard to leave out at Old Trafford. Warner's spot at the top of Australia's order is again under the microscope after he was dismissed twice by Stuart Broad in seven balls in Australia's three-wicket loss at Headingley on Sunday. Warner has made several starts in the past month and put up one half-century, but is yet to make the kind of big score that would secure his spot through to a planned January retirement. The other factor in Warner's selection is the looming squeeze on Marsh upon fellow all-rounder Cameron Green's return. Green is expected to be fit to be available for the next Test on July 19 after missing Headingley with a hamstring strain. Playing in his first Test in almost four years in place of Green, Marsh scored 118 in a crucial day-one knock and was then reliable with the ball. It means Australia's selectors will have to make the tough call to pick between Marsh and Green for the next Test, unless Warner is displaced and one of the pair opened. Cummins says David Warner (pictured) is no guarantee to be selected for the fourth Ashes Test Warner has yet to make a big score during the Ashes to secure his spot in the side Asked if it was possible Marsh could be retained for Old Trafford in place of Warner, Cummins said it was not out of the question. 'You keep all options open,' Cummins said. 'We've got nine or 10 days now, so we'll take a deep breath. We'll go away for a few days. 'But everyone comes back into it. Greeny should be fit for Manchester. Josh (Hazlewood) will be back in there as well. 'So we should have a full roster and we'll have a look at the wicket and have a chat and work out the best XI.' Then asked if it was even possible to leave Marsh out at Manchester after his performances in Leeds, Cummins indicated it would be incredibly difficult. 'Yeah, it's possible but, I mean, it was a pretty impressive week, wasn't it?' Cummins said. Two more opportunities remain for Australia in a series that already sits as one of the best of the modern era Warner's scores of four and one at Headingley took his series average to 23.5, while he has now been dismissed by Broad 17 times in Test cricket. Despite that, Marsh conceded on Sunday he did not see how he and Green could fit into the same team. 'I don't think there is. That's alright.' Marsh told cricket.com.au. 'I don't want to comment on it too much. Ultimately, that stuff is out of my control. I've got a very, very close relationship with Greeny. 'It's important for him to be in our side. We've seen how important he is for our side over the last couple of years.' Green edged closer to full fitness on Sunday, bowling for close to 20 minutes in the morning before acting as a substitute fielder in the first session and having another light bowl at lunch. Share or comment on this article: Pat Cummins delivers perfect two-word response after losing Ashes Test e-mail Add comment Comments 7 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-11 00:07:39","image_url":"https://i.dailymail.co.uk/1s/2023/07/11/00/73064241-0-image-a-6_1689031483552.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gary Stead to remain NZ men's cricket coach until 2025","link":"https://www.perthnow.com.au/sport/cricket/gary-stead-to-remain-nz-mens-cricket-coach-until-2025-c-11240843","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Gary Stead has been re-appointed as the Black Caps head coach until mid-2025, NZ Cricket deciding against appointing different coaches in different formats.","content":"Gary Stead will continue as coach of New Zealand in all three formats for two more years after New Zealand Cricket (NZC) ruled out any move to appoint different coaches in different formats. NZC general manager of high performance Bryan Stronach said a split coaching model was considered and rejected, though flexibility remained to co-opt additional coaching staff if necessary. Stead was first appointed in 2018 and this is his second contract extension. His current contract was due to expire after the upcoming men's Cricket World Cup in India. He will stay on until the end of the current World Test Championship cycle in 2025. \"The support for Gary was overwhelmingly positive from the players, the Black Caps support staff, major association coaches and support staff as well as the New Zealand Cricket Players Association and NZC High Performance Unit staff,\" Stronach said. \"Gary's results have been very impressive and we're confident that he still has a lot to offer the team. Of course, a big part of this decision came down to whether Gary wanted to continue and he made it clear his appetite to take this team forward was as keen as ever.\" Stead has led New Zealand to the first World Test Championship title and to the finals of the 50-overs and Twenty20 World Cups. Black Caps captain Tim Southee said the players were eager for Stead to continue. \"Gary's had great success leading us into finals in all three formats and, of course, that World Test Championship win,\" Southee said. \"It's been great the way that he's come in and built on what was previously achieved.\"","pubDate":"2023-07-10 23:15:37","image_url":"https://images.perthnow.com.au/publication/C-11240843/77e0873a061527f30cf98a76ce73ebb5e36b25d4-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"England are using some unique methods to keep Ben Stokes fighting fit for Old Trafford Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12284643/England-using-unique-methods-Ben-Stokes-fighting-fit-Old-Trafford-Test.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"RICHARD GIBSON: It had been a week in which abnormal levels of emotional energy had been spent. His team reckoned there were more expletives in Stokes's pre-match talk, than any other.","content":"Russian Twists, R.I.C.E and fasting: The secrets Superman Ben Stokes is using to ensure he'll be flying again at Old Trafford for England England have been using some unique tricks to keep Ben Stokes fit in the Ashes He has sustained several tough injuries, but has battled through them this series Follow Mail Sport on Threads here: https://www.threads.net/@mailsport By Richard Gibson for the Daily Mail Updated: 17:54 EDT, 10 July 2023 e-mail View comments After a round of hugs for his Headingley heroes , Ben Stokes took a moment in the England dressing room and admitted he felt more drained mentally than physically by the three-wicket win over Australia . It had certainly been a week in which abnormal levels of emotional energy had been spent. Team-mates reckoned there were more expletives in Stokes’s passionate pre-match speech, driven by the events of the second Test at Lord’s, than any of his previous 15 addresses as England captain . And so, he heads back to the North East for a few days with his family — son Layton and daughter Libby were in Leeds for Sunday’s dramatic finale — to recharge his batteries before reporting to Manchester on Sunday as England attempt to make this an epic Ashes summer. Thousands of supporters will, of course, be concerned by the impact on Stokes’s body of playing nine days of Test cricket in 12. Him, not so much. Yes, he has hobbled, limped, grimaced and groaned through it all, producing two more unforgettable innings of 155 and 80 along the way. England are going to some unique measures to ensure Ben Stokes remains fighting fit for the next Ashes Test at Old Trafford England clinched a thrilling three-wicket win against Australia at the weekend with Mark Wood (left) and Chris Woakes (right) helping them to the victory Stokes (left) has been suffering with pain in his left knee throughout the series thanks to a tendonitis issue As Oliver Holt brilliantly put it in these pages, Stokes has become England’s version of the black knight from Monty Python and the Holy Grail. ‘I’ve had worse,’ he appears to say, every time the bout of tendonitis in his left knee slows him or a Mitchell Starc-induced blow to the midriff knocks him off his feet. But those close to him say he has come to accept this is the way it will be for him now in Test cricket. He must manage the pain. There is no miracle cure for patellar tendonitis. Just plenty of RICE between matches (rest, ice, compression, elevation). This week he will stick with that and maintain the abdominal exercises such as Russian twists, planks and crunches while moving into a time-restricted diet. When at home with the family, he fasts with wife Clare outside of strict eating hours, a discipline that coincides with a more relaxed training schedule. Like the rest of England’s bowlers, he will also use the portable Game Ready compression therapy system that helps joints recover from strains post-Test, and will receive massage therapy at home club Durham to further ease aches and pains. The glute twinge incurred while over-stretching for a stroke in the first innings at Leeds is not thought to be anything serious, and what role he is able to play in the penultimate match against Australia will be judged once the teams arrive at Old Trafford. He also suffered a bruising blow on Sunday, after Scott Boland hit him with the ball Stokes (bottom left) has been plagued with the knee injury since 2012, and felt it get worse during a Test at Headingley back in 2016 Follow Mail Sport on Threads here: https://www.threads.net/@mailsport Yet patellar tendonitis is only part of the problem in his knee, the battleground of Stokes’s body since 2012. He was just 20 when issues first flared: a partial tear of the cartilage persuading the ECB to pull him out of an England Lions fixture against West Indies in Northampton and book him in for surgery. When he got to the Fortius Clinic in London, Andy Williams, the consultant, advised that an operation was not preferable, explaining that while the tear had created a flap of cartilage which would irritate from time to time, it was manageable. But he has suffered plenty of other issues to boot, including toe and glute injuries this year, broken fingers a broken collar bone and a broken hand It was not until four years later, in 2016 — after he felt the knee lock as he threw the ball from slip to mid-off during a Steven Finn over of the Headingley Test against Sri Lanka — that he went under the knife. Typically of Stokes, when doctors told him he would be out for eight weeks, he set a goal of seven, using ice and compression machines while sleeping in a bid to make the Lord’s Test that opened the home series against Pakistan. He made the deadline, of course. But the selectors erred on the side of caution, holding him back until the second Test in Manchester. Seven years on, the after-affects linger as the removal of articular cartilage causes bone to grind on bone, and those who have endured even the most basic knee repairs know of the random discomforts that follow. Part of Stokes’s pain management earlier this year was to receive a cortisone injection before heading to the Indian Premier League. And it was during his spell at the IPL that Stokes got himself into prime condition for this international summer. With Chennai Super Kings unwilling to select him as a specialist batter, he used an extended period on the sidelines to throw himself into a fitness regime of ‘prehab’ work, making his body as robust as possible. It focused on the hamstrings as they secure the knees and support the back when bowling. He had shown a similar dedication, albeit with an aerobic focus, in the build-up to the World Cup-winning summer of 2019 when he and Jos Buttler were the fastest in the extra-curricular 2km runs. Stokes received a cortisone injection before the Indian Premier League season commenced and it was here that he got himself in prime condition for the Ashes Between matches, the England captain (right) will rest, use ice, put compression on his injuries and elevate them too He has also been fasting while completing a rigourous series of core exercises including Russian Twists and crunches As someone not particularly keen on Indian food, he also asked the franchise’s chef to change his diet plan, focusing on lean meats, vegetables, and protein shakes. When in full training mode like that, he is likely to cheat with treats like Yorkie raisin and biscuit, Revels and Haribo Tangfastic sweets. England’s selection for Headingley was influenced by the fact Stokes is no longer able to contribute in all-rounder capacity in back-to-back matches. He sent down a 12-over spell at Lord’s, and it will be a suck-it-and-see approach used in the nets in Manchester as to whether he will return to bowling. One thing is certain. If it is even remotely possible and his team need him, he will do it. Follow Mail Sport on Threads here: https://www.threads.net/@mailsport Share or comment on this article: England are using some unique methods to keep Ben Stokes fighting fit for Old Trafford Test e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-10 21:54:46","image_url":"https://i.dailymail.co.uk/1s/2023/07/10/22/73061507-0-image-a-123_1689024731075.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Dave Kidd: England youth teams have now won FIVE major trophies in six years… but when will these kids be Prem regulars?","link":"https://www.thescottishsun.co.uk/sport/football/10938685/england-ashley-cole-premier-league/","keywords":["Football","Premier League","World Cup Columnists"],"creator":["Dave Kidd"],"video_url":null,"description":null,"content":"ENGLISH football has come on leaps and bounds in the last dozen years. Take, for example, Ashley Cole — a man who once injured an aspiring youngster with an air rifle but is now credited with a key mentoring role as England won the European Under-21 Championships for the first time since 1984. 5 Ashley Cole helped guide England's Under-21s to Euro glory in Georgia Credit: Getty 5 But many of the Young Lions will struggle for Premier League game time next season Credit: Getty Cole was the world-class left-back of the Golden Generation who accidentally shot a work experience kid at Chelsea’s training ground in 2011. Now he is an influential member of the coaching staff of U21s boss Lee Carsley, a supposedly underwhelming appointment who has proved an inspired choice. Carsley has been flexible in terms of tactics and manpower and his England side were the most attractive and effective team at the tournament they won in Saturday’s final — which saw Cole sent off after a row with the Spanish bench. It was England’s fifth major trophy in six years at age-group levels from U17s to 21s. That is a ringing endorsement at the overhaul of youth football instigated by Gareth Southgate in a former role as the FA’s head of elite development. This began with small-sided games on smaller pitches for primary-school kids, a vast expansion of the number of badged-up coaches, an increased focus on technical ball skills and footballing intelligence, as well as an imposition of a clear pass-and-move playing style. This ended up with England’s U21s scoring some outstanding team goals out in Georgia and winning the tournament without conceding. Spain and Germany were both consistently successful at age-group levels before their senior sides won World Cups and a similar pathway was demanded for England. Most read in Football MISSING IN ACTION Dujon Sterling NOT on Gers' pre-season trip as absence explained SNACK IS BACK McVities is bringing back a discontinued favourite after almost 20 years JAILED Youth football coach who worked for Celtic jailed for sexually abusing young boys MCCOURT SHAME Ex-Celtic star Paddy McCourt sentenced for indecent assault of woman CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 So Southgate and the FA, neither of whom receive enough credit, have done all they can. The problem, though, is obvious. Will many of Carsley’s team be playing regular Premier League football next season? Southgate knows he sounds like a stuck record when he continually points out that the number of English Premier League starters remains around 32 per cent. But that problem isn’t going away, as the wealth of England’s top flight increases and the life-expectancy of managerial tenures shrink. After England’s quarter-final exit at last year’s World Cup, there appeared to be no native players tearing it up in the Premier League and demanding the opportunity to freshen up Southgate’s senior squad. The evidence from Georgia suggests England do have several players who are good enough, yet not experienced enough. The key Manchester City trio of keeper James Trafford, skipper Taylor Harwood-Bellis and attacking midfielder Cole Palmer will not be playing for Pep Guardiola’s Treble winners. 5 Arsenal's Emile Smith Rowe is one of few squad members with significant Prem experience - unlike Everton's James Garner (right) Credit: Getty 5 Ben Johnson (left) is a squad player at West Ham, Tottenham's Oliver Skipp is far from first choice in midfield and Max Aarons will play Championship football again with Norwich Credit: Getty Trafford, the injury-time penalty-saving hero of Saturday’s final triumph against Spain, has the brilliance and supreme self-confidence to be an absolute star. All the more remarkable given that he has not played club football any higher than League One, where he spent the last 18 months on loan at Bolton. Trafford is now poised to move to Burnley, which may ease his path into Southgate’s squad. Harwood-Bellis, who has never played in the Prem but was loaned to Turf Moor last season, is highly rated for his leadership qualities as well as his defensive abilities and is a target for Fulham and West Ham . Palmer has been on the fringes of Guardiola’s team for some time but is desperate for a high-level loan move. Borussia Dortmund and Brighton are among his admirers. Levi Colwill, surely the left-footed centre-half Southgate craves, spent last season at the Amex but his game time was limited. He returns to Chelsea hoping Mauricio Pochettino’s reputation for nurturing young English players will survive the Stamford Bridge madhouse. Noni Madueke, a talented winger in need of greater end- product, is also at Chelsea, where players have to compete for space in the training-ground dressing room, let alone a first-team starting place. Emile Smith Rowe, the only member of Carsley’s squad with a senior cap, has gone backwards at Arsenal after injury and may need a move, either temporary or permanent. Anthony Gordon, the player of the tournament in Georgia, is yet to nail down a regular place at Newcastle, who will continue to spend. 5 Goalkeeping hero James Trafford (left) has just sealed a move to Prem new boys Burnley and Cole Palmer is trying to break into Treble-winning Manchester City's team Credit: Getty Curtis Jones, reckoned by Carsley to be the best of his bunch, has flitted in and out of Liverpool’s starting XI, even before a major midfield overhaul at Anfield this summer. Angel Gomes has thrived in a deeper midfield role since switching from Manchester United to Lille but Southgate is, perhaps rightly, sniffy about the quality of the football in other major European leagues. Morgan Gibbs-White, one of the first names on the Nottingham Forest team-sheet, has the clearest run at a breakthrough into Southgate’s squad. All in all, though, there are far too many of Carsley’s players who have returned home desperate for transfers, or for assurances of regular football at their current clubs. Because there has never been a better time to learn your football as a young English player, yet there has never been a worse time to play that football at the highest level. TRANSFER NEWS LIVE: All the latest news, rumours and confirmed switches from the world of football BAZ IT ALL UP SITTING among the great and good of English cricket in media centres during The Ashes gives you some fascinating off-the-record insights and opinions. Some well-informed ex-players believe that Bazball is like a brainwashing New Age religious cult, where players and coaches have lost all reason. Others believe it is a work of genius, transforming the attitudes of players and attracting new fans to Test cricket. If England win The Ashes, Bazball will be hailed as the greatest philosophy in sporting history. If they don’t, it will be condemned as happy-clappy claptrap. The truth probably lies somewhere in between. MUZZ BE BACK IT’S 4½ years since the Australian Open organisers screened an emotional ‘retirement’ video for Andy Murray. Yet the three-time Grand Slam winner is still going. The Scot, 36, has hinted that his second-round defeat by Stefanos Tsitsipas may have been his Wimbledon farewell — but don’t bet on it. Murray is the stubborn old GOAT of British tennis and he will surely be back. THOSE who hate FFP rules argue they are solely designed to hinder clubs with ‘new money’ while allowing the old elite an unfair advantage. Yet Manchester United face a tough summer window — because, after years of spending badly, they can’t sell on too many players signed for too much money on inflated wages. Exactly the sort of thing FFP was designed to punish. Read more on the Scottish Sun DAY-FLIGHT ROBBERY Inside Scots city plagued by aggressive seagulls that attack shoppers HANDY HACK Drivers are only just realising you can remove car scratches with a £1 item GREAT to see Steven Gerrard return to management and proudly waving the scarf of Saudi club Al-Ettifaq, who will pay him £8million a year. As they like to say on Merseyside: “This Means More.”","pubDate":"2023-07-10 21:36:13","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australia won't go without spin even with lack of overs","link":"https://www.perthnow.com.au/sport/cricket/australia-wont-go-without-spin-even-with-lack-of-overs-c-11240120","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia barely bowled Todd Murphy in the fourth innings at Headingley, but say they will not go into a Test match in this Ashes series without a spinner.","content":"Australia won't abandon Todd Murphy after one Test, determined to stick with playing a spinner for the rest of the Ashes instead of opting for an extra quick. Murphy was only handed the ball for two overs as England chased down 251 in the at Headingley on Sunday, after taking 1-36 from 7.3 overs in the first innings. That lack of involvement marked the least use of spin by Australia in an innings of 50 overs or more since Nathan Lyon was left out of the Perth Test against India in 2012. Australia say part of that was conditions-based on a Headingley wicket that did not turn, as well as the fact England did not bat 60 overs in either innings. But the reality is England have rarely batted any longer through the series, with the hosts' innings lasting an average of 67.3 overs. That had prompted the thought Australia could potentially leave Murphy out of one of the final two Tests, providing an easy answer for the Cameron Green and Mitch Marsh dilemma. But coach Andrew McDonald said that was extremely unlikely to come at the expense of Murphy, with the 22-year-old stepping up for the injured Lyon. \"We like a spinner,\" McDonald said. \"We like to have a balanced attack and it gives you options, you can take pace out of the game and you become one dimensional ... without the ability to turn to a spinner. \"We'll have to assess that, but as it sits at the moment we do like to have the spinner in the team.\" One change to the bowling attack is likely for Old Trafford, with Josh Hazlewood expected to return after being put on ice at Headingley. Scott Boland would be the man most likely to drop out after he went wicketless in the loss, despite McDonald believing he had bowled well without luck. McDonald also said Australia would closely examine the constant use of the short ball to England's lower order during their chase, after the hosts bowled considerably fuller in Leeds. \"If it works you say that it's right, and if it doesn't then you're probably on the opposite side,\" McDonald said. \"It's a combination, it's always somewhere in the middle of that. \"Day one, Mark Wood had ball speed and the ball was shifting, the overheads were pretty thick and you tend to pitch the ball up a lot more in those conditions. \"And when the sun comes out and the ball's not shifting as much, you've probably got less options on the fuller side. \"We critique ourselves pretty harshly so we'll be looking into that no doubt.\"","pubDate":"2023-07-10 21:02:02","image_url":"https://images.perthnow.com.au/publication/C-11240120/cf040b9311fce30aee1649a1305d0fa067b12175-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"TNPL 2023: Nellai Royal Kings enters the final after a last-ball win against Dindigul Dragons","link":"https://www.thehindu.com/sport/cricket/tnpl-2023-qualifier-2-nellai-royal-kings-vs-dindigul-dragons/article67065506.ece","keywords":null,"creator":null,"video_url":null,"description":"Ajitesh and Rithik’s 62-run partnership in just 3.3 overs takes their team past the finish line in a last-ball thriller; Shivam’s half-century goes in vain for the Dragons","content":"Nellai Royal Kings was in a spot of bother with 57 needed off 21 balls to qualify for the final. Nidhish Rajagopal was struggling to find the boundaries, scoring 26 off 27, even as G. Ajitesh (73 n.o., 44b, 5x4, 5x6) single-handedly kept the side in the game with another swashbuckling innings. It took a brave call by the Royal Kings management to retire Nidhish and get Rithik Easwaran (39 n.o., 11b, 6x6) in. Under tremendous pressure, The young left-handerr showed a calm head and used his beautiful bat swing to do the talking with telling effect as Royal Kings beat Dindigul Dragons by seven wickets in a nail-biting thrilling Qualifier-2 of the TNPL here at the ICL ground on Monday. With 37 needed off the last two overs, Rithik flayed G. Kishoor for three sixes down the ground off the first three balls of the 19th over. Ajitesh hit the fifth ball for a six before Kishoor delivered a no ball off the last delivery, allowing Rithik to scoop the final legal delivery over fine-leg as 33 came off that over. However, Dragons did not go down without a fight as Subodh Bhati did his best to defend four runs in the 20th over, bringing the equation to one off the last ball. But Rithik finished the chase in style by depositing a low full toss over square-leg to ensure that Nellai will meet Lyca Kovai Kings in the final on Wednesday. The chase though was set up by Ajitesh who continued to impress with his attacking backfoot play and ensured the Nellai side kept up with the asking rate. The diminutive right-hander cut loose in the 15th over, hitting Kishoor for consecutive sixes by charging down the wicket, the second of which got him to his third consecutive half-century of the tournament. Earlier, Shivam Singh continued his fine form in the tournament slamming 76 (46b, 4x4, 6x6) to ensure Dragons ended up 185 for five after being asked to bat. Shivam and the left-handed M. Boopathi Vaishnav Kumar (41, 27b, 4x4, 1x6) added 81 for the second wicket to help Dragons set up a competitive total. The scores: Dindigul Dragons 185/5 in 20 overs (Shivam Singh 76, M. Boopathi Vaishnav Kumar 41, Sonu Yadav 2/31) lost to Nellai Royal Kings 191/3 in 20 overs (K.B. Arun Karthick 26, G. Ajitesh 73 n.o., Nidhish Rajagopal 26 rtd, Rithik Easwaran 39 n.o.).","pubDate":"2023-07-10 19:29:54","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | Three talking points after England's Ashes win over Australia","link":"https://www.news24.com/sport/Cricket/three-talking-points-after-englands-ashes-win-over-australia-20230710","keywords":null,"creator":null,"video_url":null,"description":"England's thrilling three-wicket win in the third Test at Headingley on Sunday kept the Ashes alive, with Ben Stokes's men now just 2-1 behind with two Tests to play.","content":"England's thrilling three-wicket win in the third Test at Headingley on Sunday kept the Ashes alive, with Ben Stokes's men now just 2-1 behind with two Tests to play. But both England and Australia face selection dilemmas heading into next week's fourth Test at Old Trafford, with history against the hosts in their bid to regain the Ashes. AFP Sport looks at some of the major issues at this stage of a fascinating series: Bairstow struggling behind the stumps England dropped Ben Foakes ahead of the Ashes, despite having previously insisted the Surrey man was the world's best wicketkeeper, in order to accommodate the returning Jonny Bairstow. Bairstow was the standout performer at the start of England's 'Bazball' era, scoring over 1,000 runs, including six hundreds, in 10 Tests last year. His movement behind the stumps in the Ashes, however, appears to have been affected by the broken leg that sidelined him for nine months, with Bairstow dropping seven catches and missing a stumping in a series where he is also averaging a modest 23.50 with the bat. But England coach Brendon McCullum and captain Ben Stokes have made few selection errors since joining forces last year and they may well keep faith with Bairstow. England must also decide whether to recall James Anderson on his Old Trafford home ground after the veteran paceman, 41 later this month, was rested at Headingley after taking just three wickets, at more than 75 apiece, across the opening two matches. Chris Woakes, his stand-in at Leeds, took six wickets and also made a priceless 32 not out that helped seal England's victory. Anderson's 688 wickets are the most by any fast bowler in Test history and he could come straight back into the side if seamer Ollie Robinson, reduced to a bit-part role at Headingley by a back spasm, is deemed unfit. Warner worry for Australia Australia opener David Warner has signalled his intention to retire from Test cricket against Pakistan on his Sydney home ground next year. But the 36-year-old left-hander may not bow out on his own terms after another double failure against his England nemesis Stuart Broad at Headingley. Warner scored just four and one at Leeds, falling to Broad on both occasions, with the paceman now having dismissed him 17 times in Tests. Marcus Harris is the reserve batsman in the squad, but Australia could also drop Warner and rejig their batting line-up by retaining Mitchell Marsh and recalling Cameron Green. Marsh scored a fine 118 at Headingley in his first Test since 2019 after being called up as injury cover for Green. England aim to emulate Bradman's men England are trying to equal a record that has stood for 86 years by becoming just the second team to win an Ashes from 2-0 down. Australia were 2-0 behind in the 1936/37 Ashes, but in the New Year's Test at Melbourne, home captain Don Bradman found his form with an innings of 270 as the hosts won by 365 runs. He then made 212 and 169 as Australia triumphed by 148 runs and an innings and 200 runs at Adelaide and Melbourne -- which staged two Tests in the series -- respectively to complete their comeback. Bradman's career Test batting average of 99.94 remains one of sport's great unassailable landmarks, with no one coming close to that imposing figure since his retirement in 1948.","pubDate":"2023-07-10 19:29:50","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"MS Dhoni, Sakshi Singh Launch Debut Production Venture, Lets Get Married (LGM) Trailer in Chennai","link":"https://www.thetimesofbengal.com/sports/ms-dhoni-sakshi-singh-launch-debut-production-venture-lets-get-married-lgm-trailer-in-chennai/?utm_source=rss&utm_medium=rss&utm_campaign=ms-dhoni-sakshi-singh-launch-debut-production-venture-lets-get-married-lgm-trailer-in-chennai","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports MS Dhoni, Sakshi Singh Launch Debut Production Venture, Let’s Get Married (LGM) Trailer in Chennai Let’s Get Married, which will release later in 2023 or early 2024 features Harish Kalyan and Ivana in lead roles MS Dhoni, Sakshi Singh Launch Debut Production Venture, Let’s Get Married (LGM) Trailer in Chennai. (Image: Twitter) Chennai: MS […] The post MS Dhoni, Sakshi Singh Launch Debut Production Venture, Lets Get Married (LGM) Trailer in Chennai first appeared on The Times of Bengal.","content":"Chennai: MS Dhoni, captain of Chennai Super Kings and former India captain made his debut as a producer along with wife Sakshi Singh as the couple launched the trailer and audio of Let’s Get Married (LGM) on Monday in Chennai. The couple arrived in Chennai on July 9 and received a thunderous reception at the Chennai Airport. Fans flocked in huge numbers to catch a glimpse of their beloved Thala. Let’s Get Married , which will release later in 2023 or early 2024 features Harish Kalyan and Ivana in lead roles. The upcoming family entertainer is directed by Ramesh Thamilmani, who is also the composer of the film. LGM will also see notable stars in Nadiya, Yogi Babu and Mirchi Vijay. Amid speculations of Dhoni’s retirement, the 42-year old led Chennai to their 5th IPL title in May, beating defending champions Gujarat Titans at their own backyard. The wicket-keeper batter was also struggling with a knee injury and recently went under the knife. He is currently in recovering phase. After winning the title with Chennai, Dhoni made it clear that he still has time to think about his retirement and he will give one more season to the fans. Three days before, Thala celebrated his 42nd birthday with his family at his Ranchi farmhouse. Dhoni has been one of the successful cricketers in his game and now we have to wait and see how he and his wife fairs out as a film producer. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-07-10 19:21:50","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Horse Between Two GOATS’ रवींद्र जडेजा ने इंस्टाग्राम स्टोरी पर राहुल द्रविड़ और रवि अश्विन के साथ अपनी तस्वीर की शेयर, कैप्शन के साथ देखें Photo","link":"https://hindi.latestly.com/socially/sports/cricket/ravindra-jadeja-shared-his-picture-with-rahul-dravid-and-ravi-ashwin-on-instagram-story-see-photo-with-caption-1860433.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट टीम के भरोसेमंद ऑलराउंडर रवींद्र जड़ेजा ने इंस्टाग्राम पर 'दो बकरियों के बीच घोड़ा' कैप्शन के साथ एक स्टोरी शेयर की है. तस्वीर में उन्हें कोच राहुल द्रविड़ और मुख्य स्पिनर रविचंद्रन अश्विन के बीच खड़े देखा गया और इसलिए यह कैप्शन आया.","content":"IND vs WI Series 2023: भारतीय क्रिकेट टीम इस समय वेस्टइंडीज के डोमिनिका में कैरेबियाई टीम के खिलाफ अपना पहला टेस्ट मैच खेलने की तैयारी कर रही है. इससे पहले भारतीय क्रिकेट टीम के भरोसेमंद ऑलराउंडर रवींद्र जड़ेजा ने इंस्टाग्राम पर 'दो बकरियों के बीच घोड़ा' कैप्शन के साथ एक स्टोरी शेयर की है. तस्वीर में उन्हें कोच राहुल द्रविड़ और मुख्य स्पिनर रविचंद्रन अश्विन के बीच खड़े देखा गया और इसलिए यह कैप्शन आया. ट्वीट देखें: Instagram story of Ravindra Jadeja. Horse in between two GOAT's. pic.twitter.com/3F8hkzFKDL — Johns. (@CricCrazyJohns) July 10, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-10 18:36:09","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ARY acquires media rights for Major League Cricket","link":"https://a-sports.tv/ary-digital-network-acquires-media-rights-major-league-cricket/","keywords":["Cricket","Sports","Top News","Top Picks","ARY acquires media rights for MLC","Major League Cricket"],"creator":["A Sports"],"video_url":null,"description":"ARY Digital Network has secured media rights in Pakistan for the first-ever season of Major League Cricket (MLC), the transformative T20 competition bringing the world’s best players to the United States this July. The six-team competition starting on 14 July in the USA will be broadcast on A Sports, one of Pakistan’s leading sports TV […] The post ARY acquires media rights for Major League Cricket appeared first on ASports.tv.","content":"ARY Digital Network has secured media rights in Pakistan for the first-ever season of Major League Cricket (MLC), the transformative T20 competition bringing the world’s best players to the United States this July. The six-team competition starting on 14 July in the USA will be broadcast on A Sports, one of Pakistan’s leading sports TV channels, and live-streamed on the ARY Zap mobile app and website. The first season of MLC is set to feature world-class international players across the six participating teams – Los Angeles Knight Riders, MI New York, San Francisco Unicorns, Seattle Orcas, Texas Super Kings and Washington Freedom. The inaugural season will be played in a round-robin format with the four best-performing teams competing in a multi-game playoff and final round to decide a champion, to be crowned on July 30. The star-studded MLC player roster includes Pakistan’s Shadab Khan, Haris Rauf, and Imad Wasim. Former Pakistani players Sami Aslam, Nauman Anwar, Hammad Azam, Ehsan Adil, and Mukhtar Ahmed are also featuring in MLC this season. International cricket stars Kieron Pollard, Rashid Khan, Jason Roy, Kagiso Rabada, Andre Russell, Sunil Narine, and Marcus Stoinis are some of the other leading players taking part in the first edition of MLC, to be played in Texas and North Carolina. “The launch of a ground-breaking professional cricket tournament in the USA is an exciting development and I am glad that ARY is part of this new venture as the MLC’s official broadcast partner in Pakistan,” said Salman Iqbal, ARY Digital Founder and CEO. “Cricket is making a grand entry into a market that holds huge potential and we hope that the audiences in Pakistan will enjoy our coverage of these matches.” “We are thrilled to partner with ARY and deliver the adrenaline-packed T20 action Major League Cricket will feature to viewers across Pakistan,” said Tom Dunmore, Vice-president of Marketing, Major League Cricket. “We know how passionate fans in Pakistan are about cricket, and we’re excited that they will have the chance to see their favourite stars like Shadab Khan, Haris Rauf, and Imad Wasim compete on an exciting new stage in the United States.” The partnership between ARY and MLC will ensure the continuation of an exciting cricket season on A Sports and ARY Zap with this year’s historic ICC Men’s Cricket World Cup Qualifiers having ended this past Sunday. ARY’s impressive list of sports content includes the Pakistan Super League, bilateral matches organised by the Pakistan Cricket Board, ICC Men’s and Women’s T20 World Cups, the FIFA World Cup Qatar 2022 , SA20, FairBreak Invitational T20, Formula 1, and La Liga .","pubDate":"2023-07-10 18:35:46","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Pat Cummins delivers perfect two-word response after losing Ashes Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12284817/Pat-Cummins-delivers-perfect-two-word-response-losing-Ashes-Test.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"After enduring his first defeat in the 2023 Ashes series, Aussie skipper Pat Cummins has shut down an English reporter with a perfectly blunt two-word reply and a deadpan smirk.","content":"Pat Cummins delivers perfect two-word response after being asked if Australia are 'rattled' after losing Ashes Test - and refuses to rule out dropping David Warner Cummins gives blunt reply to reporter's question Skipper is not worried momentum may have shifted Warner is no guarantee to be selected for fourth Test By James Cooney For Daily Mail Australia and Scott Bailey For Australian Associated Press Updated: 01:07, 11 July 2023 e-mail 7 View comments After enduring his first defeat in the 2023 Ashes series, Aussie skipper Pat Cummins has shut down an English reporter with a perfectly blunt two-word reply. Australia lost the third Ashes Test at Headingley by three wickets, but still lead the series 2-1 with two Tests remaining. England have kept the battle for the urn alive, but the Aussies need to win just one of the two remaining matches to clinch their first Ashes win in England in more than two decades. When asked post-match by a reporter if he feared momentum had now shifted in favour of England, Cummins said 'not really'. The reporter pressed Cummins to explain, asking, 'Why not?' Cummins with the mic drop moment ¿ #Ashes | #AUSvENG pic.twitter.com/Abyui4KljJ — ESPNcricinfo (@ESPNcricinfo) July 10, 2023 The Aussies need to win just one of the two remaining matches to clinch their first Ashes win in England in more than two decade To which Cummins replied bluntly with a smirk: 'Two-one'. Cummins has also admitted David Warner is no guarantee to be selected for the fourth Ashes Test, conceding that Mitch Marsh will be incredibly hard to leave out at Old Trafford. Warner's spot at the top of Australia's order is again under the microscope after he was dismissed twice by Stuart Broad in seven balls in Australia's three-wicket loss at Headingley on Sunday. Warner has made several starts in the past month and put up one half-century, but is yet to make the kind of big score that would secure his spot through to a planned January retirement. The other factor in Warner's selection is the looming squeeze on Marsh upon fellow all-rounder Cameron Green's return. Green is expected to be fit to be available for the next Test on July 19 after missing Headingley with a hamstring strain. Playing in his first Test in almost four years in place of Green, Marsh scored 118 in a crucial day-one knock and was then reliable with the ball. It means Australia's selectors will have to make the tough call to pick between Marsh and Green for the next Test, unless Warner is displaced and one of the pair opened. Cummins says David Warner (pictured) is no guarantee to be selected for the fourth Ashes Test Warner has yet to make a big score during the Ashes to secure his spot in the side Asked if it was possible Marsh could be retained for Old Trafford in place of Warner, Cummins said it was not out of the question. 'You keep all options open,' Cummins said. 'We've got nine or 10 days now, so we'll take a deep breath. We'll go away for a few days. 'But everyone comes back into it. Greeny should be fit for Manchester. Josh (Hazlewood) will be back in there as well. 'So we should have a full roster and we'll have a look at the wicket and have a chat and work out the best XI.' Then asked if it was even possible to leave Marsh out at Manchester after his performances in Leeds, Cummins indicated it would be incredibly difficult. 'Yeah, it's possible but, I mean, it was a pretty impressive week, wasn't it?' Cummins said. Two more opportunities remain for Australia in a series that already sits as one of the best of the modern era Warner's scores of four and one at Headingley took his series average to 23.5, while he has now been dismissed by Broad 17 times in Test cricket. Despite that, Marsh conceded on Sunday he did not see how he and Green could fit into the same team. 'I don't think there is. That's alright.' Marsh told cricket.com.au. 'I don't want to comment on it too much. Ultimately, that stuff is out of my control. I've got a very, very close relationship with Greeny. 'It's important for him to be in our side. We've seen how important he is for our side over the last couple of years.' Green edged closer to full fitness on Sunday, bowling for close to 20 minutes in the morning before acting as a substitute fielder in the first session and having another light bowl at lunch. Share or comment on this article: Pat Cummins delivers perfect two-word response after losing Ashes Test e-mail Add comment Comments 7 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-11 00:07:39","image_url":"https://i.dailymail.co.uk/1s/2023/07/11/00/73064241-0-image-a-6_1689031483552.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gary Stead to remain NZ men's cricket coach until 2025","link":"https://www.perthnow.com.au/sport/cricket/gary-stead-to-remain-nz-mens-cricket-coach-until-2025-c-11240843","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Gary Stead has been re-appointed as the Black Caps head coach until mid-2025, NZ Cricket deciding against appointing different coaches in different formats.","content":"Gary Stead will continue as coach of New Zealand in all three formats for two more years after New Zealand Cricket (NZC) ruled out any move to appoint different coaches in different formats. NZC general manager of high performance Bryan Stronach said a split coaching model was considered and rejected, though flexibility remained to co-opt additional coaching staff if necessary. Stead was first appointed in 2018 and this is his second contract extension. His current contract was due to expire after the upcoming men's Cricket World Cup in India. He will stay on until the end of the current World Test Championship cycle in 2025. \"The support for Gary was overwhelmingly positive from the players, the Black Caps support staff, major association coaches and support staff as well as the New Zealand Cricket Players Association and NZC High Performance Unit staff,\" Stronach said. \"Gary's results have been very impressive and we're confident that he still has a lot to offer the team. Of course, a big part of this decision came down to whether Gary wanted to continue and he made it clear his appetite to take this team forward was as keen as ever.\" Stead has led New Zealand to the first World Test Championship title and to the finals of the 50-overs and Twenty20 World Cups. Black Caps captain Tim Southee said the players were eager for Stead to continue. \"Gary's had great success leading us into finals in all three formats and, of course, that World Test Championship win,\" Southee said. \"It's been great the way that he's come in and built on what was previously achieved.\"","pubDate":"2023-07-10 23:15:37","image_url":"https://images.perthnow.com.au/publication/C-11240843/77e0873a061527f30cf98a76ce73ebb5e36b25d4-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"England are using some unique methods to keep Ben Stokes fighting fit for Old Trafford Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12284643/England-using-unique-methods-Ben-Stokes-fighting-fit-Old-Trafford-Test.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"RICHARD GIBSON: It had been a week in which abnormal levels of emotional energy had been spent. His team reckoned there were more expletives in Stokes's pre-match talk, than any other.","content":"Russian Twists, R.I.C.E and fasting: The secrets Superman Ben Stokes is using to ensure he'll be flying again at Old Trafford for England England have been using some unique tricks to keep Ben Stokes fit in the Ashes He has sustained several tough injuries, but has battled through them this series Follow Mail Sport on Threads here: https://www.threads.net/@mailsport By Richard Gibson for the Daily Mail Updated: 17:54 EDT, 10 July 2023 e-mail View comments After a round of hugs for his Headingley heroes , Ben Stokes took a moment in the England dressing room and admitted he felt more drained mentally than physically by the three-wicket win over Australia . It had certainly been a week in which abnormal levels of emotional energy had been spent. Team-mates reckoned there were more expletives in Stokes’s passionate pre-match speech, driven by the events of the second Test at Lord’s, than any of his previous 15 addresses as England captain . And so, he heads back to the North East for a few days with his family — son Layton and daughter Libby were in Leeds for Sunday’s dramatic finale — to recharge his batteries before reporting to Manchester on Sunday as England attempt to make this an epic Ashes summer. Thousands of supporters will, of course, be concerned by the impact on Stokes’s body of playing nine days of Test cricket in 12. Him, not so much. Yes, he has hobbled, limped, grimaced and groaned through it all, producing two more unforgettable innings of 155 and 80 along the way. England are going to some unique measures to ensure Ben Stokes remains fighting fit for the next Ashes Test at Old Trafford England clinched a thrilling three-wicket win against Australia at the weekend with Mark Wood (left) and Chris Woakes (right) helping them to the victory Stokes (left) has been suffering with pain in his left knee throughout the series thanks to a tendonitis issue As Oliver Holt brilliantly put it in these pages, Stokes has become England’s version of the black knight from Monty Python and the Holy Grail. ‘I’ve had worse,’ he appears to say, every time the bout of tendonitis in his left knee slows him or a Mitchell Starc-induced blow to the midriff knocks him off his feet. But those close to him say he has come to accept this is the way it will be for him now in Test cricket. He must manage the pain. There is no miracle cure for patellar tendonitis. Just plenty of RICE between matches (rest, ice, compression, elevation). This week he will stick with that and maintain the abdominal exercises such as Russian twists, planks and crunches while moving into a time-restricted diet. When at home with the family, he fasts with wife Clare outside of strict eating hours, a discipline that coincides with a more relaxed training schedule. Like the rest of England’s bowlers, he will also use the portable Game Ready compression therapy system that helps joints recover from strains post-Test, and will receive massage therapy at home club Durham to further ease aches and pains. The glute twinge incurred while over-stretching for a stroke in the first innings at Leeds is not thought to be anything serious, and what role he is able to play in the penultimate match against Australia will be judged once the teams arrive at Old Trafford. He also suffered a bruising blow on Sunday, after Scott Boland hit him with the ball Stokes (bottom left) has been plagued with the knee injury since 2012, and felt it get worse during a Test at Headingley back in 2016 Follow Mail Sport on Threads here: https://www.threads.net/@mailsport Yet patellar tendonitis is only part of the problem in his knee, the battleground of Stokes’s body since 2012. He was just 20 when issues first flared: a partial tear of the cartilage persuading the ECB to pull him out of an England Lions fixture against West Indies in Northampton and book him in for surgery. When he got to the Fortius Clinic in London, Andy Williams, the consultant, advised that an operation was not preferable, explaining that while the tear had created a flap of cartilage which would irritate from time to time, it was manageable. But he has suffered plenty of other issues to boot, including toe and glute injuries this year, broken fingers a broken collar bone and a broken hand It was not until four years later, in 2016 — after he felt the knee lock as he threw the ball from slip to mid-off during a Steven Finn over of the Headingley Test against Sri Lanka — that he went under the knife. Typically of Stokes, when doctors told him he would be out for eight weeks, he set a goal of seven, using ice and compression machines while sleeping in a bid to make the Lord’s Test that opened the home series against Pakistan. He made the deadline, of course. But the selectors erred on the side of caution, holding him back until the second Test in Manchester. Seven years on, the after-affects linger as the removal of articular cartilage causes bone to grind on bone, and those who have endured even the most basic knee repairs know of the random discomforts that follow. Part of Stokes’s pain management earlier this year was to receive a cortisone injection before heading to the Indian Premier League. And it was during his spell at the IPL that Stokes got himself into prime condition for this international summer. With Chennai Super Kings unwilling to select him as a specialist batter, he used an extended period on the sidelines to throw himself into a fitness regime of ‘prehab’ work, making his body as robust as possible. It focused on the hamstrings as they secure the knees and support the back when bowling. He had shown a similar dedication, albeit with an aerobic focus, in the build-up to the World Cup-winning summer of 2019 when he and Jos Buttler were the fastest in the extra-curricular 2km runs. Stokes received a cortisone injection before the Indian Premier League season commenced and it was here that he got himself in prime condition for the Ashes Between matches, the England captain (right) will rest, use ice, put compression on his injuries and elevate them too He has also been fasting while completing a rigourous series of core exercises including Russian Twists and crunches As someone not particularly keen on Indian food, he also asked the franchise’s chef to change his diet plan, focusing on lean meats, vegetables, and protein shakes. When in full training mode like that, he is likely to cheat with treats like Yorkie raisin and biscuit, Revels and Haribo Tangfastic sweets. England’s selection for Headingley was influenced by the fact Stokes is no longer able to contribute in all-rounder capacity in back-to-back matches. He sent down a 12-over spell at Lord’s, and it will be a suck-it-and-see approach used in the nets in Manchester as to whether he will return to bowling. One thing is certain. If it is even remotely possible and his team need him, he will do it. Follow Mail Sport on Threads here: https://www.threads.net/@mailsport Share or comment on this article: England are using some unique methods to keep Ben Stokes fighting fit for Old Trafford Test e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-10 21:54:46","image_url":"https://i.dailymail.co.uk/1s/2023/07/10/22/73061507-0-image-a-123_1689024731075.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Dave Kidd: England youth teams have now won FIVE major trophies in six years… but when will these kids be Prem regulars?","link":"https://www.thescottishsun.co.uk/sport/football/10938685/england-ashley-cole-premier-league/","keywords":["Football","Premier League","World Cup Columnists"],"creator":["Dave Kidd"],"video_url":null,"description":null,"content":"ENGLISH football has come on leaps and bounds in the last dozen years. Take, for example, Ashley Cole — a man who once injured an aspiring youngster with an air rifle but is now credited with a key mentoring role as England won the European Under-21 Championships for the first time since 1984. 5 Ashley Cole helped guide England's Under-21s to Euro glory in Georgia Credit: Getty 5 But many of the Young Lions will struggle for Premier League game time next season Credit: Getty Cole was the world-class left-back of the Golden Generation who accidentally shot a work experience kid at Chelsea’s training ground in 2011. Now he is an influential member of the coaching staff of U21s boss Lee Carsley, a supposedly underwhelming appointment who has proved an inspired choice. Carsley has been flexible in terms of tactics and manpower and his England side were the most attractive and effective team at the tournament they won in Saturday’s final — which saw Cole sent off after a row with the Spanish bench. It was England’s fifth major trophy in six years at age-group levels from U17s to 21s. That is a ringing endorsement at the overhaul of youth football instigated by Gareth Southgate in a former role as the FA’s head of elite development. This began with small-sided games on smaller pitches for primary-school kids, a vast expansion of the number of badged-up coaches, an increased focus on technical ball skills and footballing intelligence, as well as an imposition of a clear pass-and-move playing style. This ended up with England’s U21s scoring some outstanding team goals out in Georgia and winning the tournament without conceding. Spain and Germany were both consistently successful at age-group levels before their senior sides won World Cups and a similar pathway was demanded for England. Most read in Football MISSING IN ACTION Dujon Sterling NOT on Gers' pre-season trip as absence explained SNACK IS BACK McVities is bringing back a discontinued favourite after almost 20 years JAILED Youth football coach who worked for Celtic jailed for sexually abusing young boys MCCOURT SHAME Ex-Celtic star Paddy McCourt sentenced for indecent assault of woman CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 So Southgate and the FA, neither of whom receive enough credit, have done all they can. The problem, though, is obvious. Will many of Carsley’s team be playing regular Premier League football next season? Southgate knows he sounds like a stuck record when he continually points out that the number of English Premier League starters remains around 32 per cent. But that problem isn’t going away, as the wealth of England’s top flight increases and the life-expectancy of managerial tenures shrink. After England’s quarter-final exit at last year’s World Cup, there appeared to be no native players tearing it up in the Premier League and demanding the opportunity to freshen up Southgate’s senior squad. The evidence from Georgia suggests England do have several players who are good enough, yet not experienced enough. The key Manchester City trio of keeper James Trafford, skipper Taylor Harwood-Bellis and attacking midfielder Cole Palmer will not be playing for Pep Guardiola’s Treble winners. 5 Arsenal's Emile Smith Rowe is one of few squad members with significant Prem experience - unlike Everton's James Garner (right) Credit: Getty 5 Ben Johnson (left) is a squad player at West Ham, Tottenham's Oliver Skipp is far from first choice in midfield and Max Aarons will play Championship football again with Norwich Credit: Getty Trafford, the injury-time penalty-saving hero of Saturday’s final triumph against Spain, has the brilliance and supreme self-confidence to be an absolute star. All the more remarkable given that he has not played club football any higher than League One, where he spent the last 18 months on loan at Bolton. Trafford is now poised to move to Burnley, which may ease his path into Southgate’s squad. Harwood-Bellis, who has never played in the Prem but was loaned to Turf Moor last season, is highly rated for his leadership qualities as well as his defensive abilities and is a target for Fulham and West Ham . Palmer has been on the fringes of Guardiola’s team for some time but is desperate for a high-level loan move. Borussia Dortmund and Brighton are among his admirers. Levi Colwill, surely the left-footed centre-half Southgate craves, spent last season at the Amex but his game time was limited. He returns to Chelsea hoping Mauricio Pochettino’s reputation for nurturing young English players will survive the Stamford Bridge madhouse. Noni Madueke, a talented winger in need of greater end- product, is also at Chelsea, where players have to compete for space in the training-ground dressing room, let alone a first-team starting place. Emile Smith Rowe, the only member of Carsley’s squad with a senior cap, has gone backwards at Arsenal after injury and may need a move, either temporary or permanent. Anthony Gordon, the player of the tournament in Georgia, is yet to nail down a regular place at Newcastle, who will continue to spend. 5 Goalkeeping hero James Trafford (left) has just sealed a move to Prem new boys Burnley and Cole Palmer is trying to break into Treble-winning Manchester City's team Credit: Getty Curtis Jones, reckoned by Carsley to be the best of his bunch, has flitted in and out of Liverpool’s starting XI, even before a major midfield overhaul at Anfield this summer. Angel Gomes has thrived in a deeper midfield role since switching from Manchester United to Lille but Southgate is, perhaps rightly, sniffy about the quality of the football in other major European leagues. Morgan Gibbs-White, one of the first names on the Nottingham Forest team-sheet, has the clearest run at a breakthrough into Southgate’s squad. All in all, though, there are far too many of Carsley’s players who have returned home desperate for transfers, or for assurances of regular football at their current clubs. Because there has never been a better time to learn your football as a young English player, yet there has never been a worse time to play that football at the highest level. TRANSFER NEWS LIVE: All the latest news, rumours and confirmed switches from the world of football BAZ IT ALL UP SITTING among the great and good of English cricket in media centres during The Ashes gives you some fascinating off-the-record insights and opinions. Some well-informed ex-players believe that Bazball is like a brainwashing New Age religious cult, where players and coaches have lost all reason. Others believe it is a work of genius, transforming the attitudes of players and attracting new fans to Test cricket. If England win The Ashes, Bazball will be hailed as the greatest philosophy in sporting history. If they don’t, it will be condemned as happy-clappy claptrap. The truth probably lies somewhere in between. MUZZ BE BACK IT’S 4½ years since the Australian Open organisers screened an emotional ‘retirement’ video for Andy Murray. Yet the three-time Grand Slam winner is still going. The Scot, 36, has hinted that his second-round defeat by Stefanos Tsitsipas may have been his Wimbledon farewell — but don’t bet on it. Murray is the stubborn old GOAT of British tennis and he will surely be back. THOSE who hate FFP rules argue they are solely designed to hinder clubs with ‘new money’ while allowing the old elite an unfair advantage. Yet Manchester United face a tough summer window — because, after years of spending badly, they can’t sell on too many players signed for too much money on inflated wages. Exactly the sort of thing FFP was designed to punish. Read more on the Scottish Sun DAY-FLIGHT ROBBERY Inside Scots city plagued by aggressive seagulls that attack shoppers HANDY HACK Drivers are only just realising you can remove car scratches with a £1 item GREAT to see Steven Gerrard return to management and proudly waving the scarf of Saudi club Al-Ettifaq, who will pay him £8million a year. As they like to say on Merseyside: “This Means More.”","pubDate":"2023-07-10 21:36:13","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australia won't go without spin even with lack of overs","link":"https://www.perthnow.com.au/sport/cricket/australia-wont-go-without-spin-even-with-lack-of-overs-c-11240120","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia barely bowled Todd Murphy in the fourth innings at Headingley, but say they will not go into a Test match in this Ashes series without a spinner.","content":"Australia won't abandon Todd Murphy after one Test, determined to stick with playing a spinner for the rest of the Ashes instead of opting for an extra quick. Murphy was only handed the ball for two overs as England chased down 251 in the at Headingley on Sunday, after taking 1-36 from 7.3 overs in the first innings. That lack of involvement marked the least use of spin by Australia in an innings of 50 overs or more since Nathan Lyon was left out of the Perth Test against India in 2012. Australia say part of that was conditions-based on a Headingley wicket that did not turn, as well as the fact England did not bat 60 overs in either innings. But the reality is England have rarely batted any longer through the series, with the hosts' innings lasting an average of 67.3 overs. That had prompted the thought Australia could potentially leave Murphy out of one of the final two Tests, providing an easy answer for the Cameron Green and Mitch Marsh dilemma. But coach Andrew McDonald said that was extremely unlikely to come at the expense of Murphy, with the 22-year-old stepping up for the injured Lyon. \"We like a spinner,\" McDonald said. \"We like to have a balanced attack and it gives you options, you can take pace out of the game and you become one dimensional ... without the ability to turn to a spinner. \"We'll have to assess that, but as it sits at the moment we do like to have the spinner in the team.\" One change to the bowling attack is likely for Old Trafford, with Josh Hazlewood expected to return after being put on ice at Headingley. Scott Boland would be the man most likely to drop out after he went wicketless in the loss, despite McDonald believing he had bowled well without luck. McDonald also said Australia would closely examine the constant use of the short ball to England's lower order during their chase, after the hosts bowled considerably fuller in Leeds. \"If it works you say that it's right, and if it doesn't then you're probably on the opposite side,\" McDonald said. \"It's a combination, it's always somewhere in the middle of that. \"Day one, Mark Wood had ball speed and the ball was shifting, the overheads were pretty thick and you tend to pitch the ball up a lot more in those conditions. \"And when the sun comes out and the ball's not shifting as much, you've probably got less options on the fuller side. \"We critique ourselves pretty harshly so we'll be looking into that no doubt.\"","pubDate":"2023-07-10 21:02:02","image_url":"https://images.perthnow.com.au/publication/C-11240120/cf040b9311fce30aee1649a1305d0fa067b12175-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"TNPL 2023: Nellai Royal Kings enters the final after a last-ball win against Dindigul Dragons","link":"https://www.thehindu.com/sport/cricket/tnpl-2023-qualifier-2-nellai-royal-kings-vs-dindigul-dragons/article67065506.ece","keywords":null,"creator":null,"video_url":null,"description":"Ajitesh and Rithik’s 62-run partnership in just 3.3 overs takes their team past the finish line in a last-ball thriller; Shivam’s half-century goes in vain for the Dragons","content":"Nellai Royal Kings was in a spot of bother with 57 needed off 21 balls to qualify for the final. Nidhish Rajagopal was struggling to find the boundaries, scoring 26 off 27, even as G. Ajitesh (73 n.o., 44b, 5x4, 5x6) single-handedly kept the side in the game with another swashbuckling innings. It took a brave call by the Royal Kings management to retire Nidhish and get Rithik Easwaran (39 n.o., 11b, 6x6) in. Under tremendous pressure, The young left-handerr showed a calm head and used his beautiful bat swing to do the talking with telling effect as Royal Kings beat Dindigul Dragons by seven wickets in a nail-biting thrilling Qualifier-2 of the TNPL here at the ICL ground on Monday. With 37 needed off the last two overs, Rithik flayed G. Kishoor for three sixes down the ground off the first three balls of the 19th over. Ajitesh hit the fifth ball for a six before Kishoor delivered a no ball off the last delivery, allowing Rithik to scoop the final legal delivery over fine-leg as 33 came off that over. However, Dragons did not go down without a fight as Subodh Bhati did his best to defend four runs in the 20th over, bringing the equation to one off the last ball. But Rithik finished the chase in style by depositing a low full toss over square-leg to ensure that Nellai will meet Lyca Kovai Kings in the final on Wednesday. The chase though was set up by Ajitesh who continued to impress with his attacking backfoot play and ensured the Nellai side kept up with the asking rate. The diminutive right-hander cut loose in the 15th over, hitting Kishoor for consecutive sixes by charging down the wicket, the second of which got him to his third consecutive half-century of the tournament. Earlier, Shivam Singh continued his fine form in the tournament slamming 76 (46b, 4x4, 6x6) to ensure Dragons ended up 185 for five after being asked to bat. Shivam and the left-handed M. Boopathi Vaishnav Kumar (41, 27b, 4x4, 1x6) added 81 for the second wicket to help Dragons set up a competitive total. The scores: Dindigul Dragons 185/5 in 20 overs (Shivam Singh 76, M. Boopathi Vaishnav Kumar 41, Sonu Yadav 2/31) lost to Nellai Royal Kings 191/3 in 20 overs (K.B. Arun Karthick 26, G. Ajitesh 73 n.o., Nidhish Rajagopal 26 rtd, Rithik Easwaran 39 n.o.).","pubDate":"2023-07-10 19:29:54","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | Three talking points after England's Ashes win over Australia","link":"https://www.news24.com/sport/Cricket/three-talking-points-after-englands-ashes-win-over-australia-20230710","keywords":null,"creator":null,"video_url":null,"description":"England's thrilling three-wicket win in the third Test at Headingley on Sunday kept the Ashes alive, with Ben Stokes's men now just 2-1 behind with two Tests to play.","content":"England's thrilling three-wicket win in the third Test at Headingley on Sunday kept the Ashes alive, with Ben Stokes's men now just 2-1 behind with two Tests to play. But both England and Australia face selection dilemmas heading into next week's fourth Test at Old Trafford, with history against the hosts in their bid to regain the Ashes. AFP Sport looks at some of the major issues at this stage of a fascinating series: Bairstow struggling behind the stumps England dropped Ben Foakes ahead of the Ashes, despite having previously insisted the Surrey man was the world's best wicketkeeper, in order to accommodate the returning Jonny Bairstow. Bairstow was the standout performer at the start of England's 'Bazball' era, scoring over 1,000 runs, including six hundreds, in 10 Tests last year. His movement behind the stumps in the Ashes, however, appears to have been affected by the broken leg that sidelined him for nine months, with Bairstow dropping seven catches and missing a stumping in a series where he is also averaging a modest 23.50 with the bat. But England coach Brendon McCullum and captain Ben Stokes have made few selection errors since joining forces last year and they may well keep faith with Bairstow. England must also decide whether to recall James Anderson on his Old Trafford home ground after the veteran paceman, 41 later this month, was rested at Headingley after taking just three wickets, at more than 75 apiece, across the opening two matches. Chris Woakes, his stand-in at Leeds, took six wickets and also made a priceless 32 not out that helped seal England's victory. Anderson's 688 wickets are the most by any fast bowler in Test history and he could come straight back into the side if seamer Ollie Robinson, reduced to a bit-part role at Headingley by a back spasm, is deemed unfit. Warner worry for Australia Australia opener David Warner has signalled his intention to retire from Test cricket against Pakistan on his Sydney home ground next year. But the 36-year-old left-hander may not bow out on his own terms after another double failure against his England nemesis Stuart Broad at Headingley. Warner scored just four and one at Leeds, falling to Broad on both occasions, with the paceman now having dismissed him 17 times in Tests. Marcus Harris is the reserve batsman in the squad, but Australia could also drop Warner and rejig their batting line-up by retaining Mitchell Marsh and recalling Cameron Green. Marsh scored a fine 118 at Headingley in his first Test since 2019 after being called up as injury cover for Green. England aim to emulate Bradman's men England are trying to equal a record that has stood for 86 years by becoming just the second team to win an Ashes from 2-0 down. Australia were 2-0 behind in the 1936/37 Ashes, but in the New Year's Test at Melbourne, home captain Don Bradman found his form with an innings of 270 as the hosts won by 365 runs. He then made 212 and 169 as Australia triumphed by 148 runs and an innings and 200 runs at Adelaide and Melbourne -- which staged two Tests in the series -- respectively to complete their comeback. Bradman's career Test batting average of 99.94 remains one of sport's great unassailable landmarks, with no one coming close to that imposing figure since his retirement in 1948.","pubDate":"2023-07-10 19:29:50","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"MS Dhoni, Sakshi Singh Launch Debut Production Venture, Lets Get Married (LGM) Trailer in Chennai","link":"https://www.thetimesofbengal.com/sports/ms-dhoni-sakshi-singh-launch-debut-production-venture-lets-get-married-lgm-trailer-in-chennai/?utm_source=rss&utm_medium=rss&utm_campaign=ms-dhoni-sakshi-singh-launch-debut-production-venture-lets-get-married-lgm-trailer-in-chennai","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports MS Dhoni, Sakshi Singh Launch Debut Production Venture, Let’s Get Married (LGM) Trailer in Chennai Let’s Get Married, which will release later in 2023 or early 2024 features Harish Kalyan and Ivana in lead roles MS Dhoni, Sakshi Singh Launch Debut Production Venture, Let’s Get Married (LGM) Trailer in Chennai. (Image: Twitter) Chennai: MS […] The post MS Dhoni, Sakshi Singh Launch Debut Production Venture, Lets Get Married (LGM) Trailer in Chennai first appeared on The Times of Bengal.","content":"Chennai: MS Dhoni, captain of Chennai Super Kings and former India captain made his debut as a producer along with wife Sakshi Singh as the couple launched the trailer and audio of Let’s Get Married (LGM) on Monday in Chennai. The couple arrived in Chennai on July 9 and received a thunderous reception at the Chennai Airport. Fans flocked in huge numbers to catch a glimpse of their beloved Thala. Let’s Get Married , which will release later in 2023 or early 2024 features Harish Kalyan and Ivana in lead roles. The upcoming family entertainer is directed by Ramesh Thamilmani, who is also the composer of the film. LGM will also see notable stars in Nadiya, Yogi Babu and Mirchi Vijay. Amid speculations of Dhoni’s retirement, the 42-year old led Chennai to their 5th IPL title in May, beating defending champions Gujarat Titans at their own backyard. The wicket-keeper batter was also struggling with a knee injury and recently went under the knife. He is currently in recovering phase. After winning the title with Chennai, Dhoni made it clear that he still has time to think about his retirement and he will give one more season to the fans. Three days before, Thala celebrated his 42nd birthday with his family at his Ranchi farmhouse. Dhoni has been one of the successful cricketers in his game and now we have to wait and see how he and his wife fairs out as a film producer. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-07-10 19:21:50","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Horse Between Two GOATS’ रवींद्र जडेजा ने इंस्टाग्राम स्टोरी पर राहुल द्रविड़ और रवि अश्विन के साथ अपनी तस्वीर की शेयर, कैप्शन के साथ देखें Photo","link":"https://hindi.latestly.com/socially/sports/cricket/ravindra-jadeja-shared-his-picture-with-rahul-dravid-and-ravi-ashwin-on-instagram-story-see-photo-with-caption-1860433.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट टीम के भरोसेमंद ऑलराउंडर रवींद्र जड़ेजा ने इंस्टाग्राम पर 'दो बकरियों के बीच घोड़ा' कैप्शन के साथ एक स्टोरी शेयर की है. तस्वीर में उन्हें कोच राहुल द्रविड़ और मुख्य स्पिनर रविचंद्रन अश्विन के बीच खड़े देखा गया और इसलिए यह कैप्शन आया.","content":"IND vs WI Series 2023: भारतीय क्रिकेट टीम इस समय वेस्टइंडीज के डोमिनिका में कैरेबियाई टीम के खिलाफ अपना पहला टेस्ट मैच खेलने की तैयारी कर रही है. इससे पहले भारतीय क्रिकेट टीम के भरोसेमंद ऑलराउंडर रवींद्र जड़ेजा ने इंस्टाग्राम पर 'दो बकरियों के बीच घोड़ा' कैप्शन के साथ एक स्टोरी शेयर की है. तस्वीर में उन्हें कोच राहुल द्रविड़ और मुख्य स्पिनर रविचंद्रन अश्विन के बीच खड़े देखा गया और इसलिए यह कैप्शन आया. ट्वीट देखें: Instagram story of Ravindra Jadeja. Horse in between two GOAT's. pic.twitter.com/3F8hkzFKDL — Johns. (@CricCrazyJohns) July 10, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-10 18:36:09","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ARY acquires media rights for Major League Cricket","link":"https://a-sports.tv/ary-digital-network-acquires-media-rights-major-league-cricket/","keywords":["Cricket","Sports","Top News","Top Picks","ARY acquires media rights for MLC","Major League Cricket"],"creator":["A Sports"],"video_url":null,"description":"ARY Digital Network has secured media rights in Pakistan for the first-ever season of Major League Cricket (MLC), the transformative T20 competition bringing the world’s best players to the United States this July. The six-team competition starting on 14 July in the USA will be broadcast on A Sports, one of Pakistan’s leading sports TV […] The post ARY acquires media rights for Major League Cricket appeared first on ASports.tv.","content":"ARY Digital Network has secured media rights in Pakistan for the first-ever season of Major League Cricket (MLC), the transformative T20 competition bringing the world’s best players to the United States this July. The six-team competition starting on 14 July in the USA will be broadcast on A Sports, one of Pakistan’s leading sports TV channels, and live-streamed on the ARY Zap mobile app and website. The first season of MLC is set to feature world-class international players across the six participating teams – Los Angeles Knight Riders, MI New York, San Francisco Unicorns, Seattle Orcas, Texas Super Kings and Washington Freedom. The inaugural season will be played in a round-robin format with the four best-performing teams competing in a multi-game playoff and final round to decide a champion, to be crowned on July 30. The star-studded MLC player roster includes Pakistan’s Shadab Khan, Haris Rauf, and Imad Wasim. Former Pakistani players Sami Aslam, Nauman Anwar, Hammad Azam, Ehsan Adil, and Mukhtar Ahmed are also featuring in MLC this season. International cricket stars Kieron Pollard, Rashid Khan, Jason Roy, Kagiso Rabada, Andre Russell, Sunil Narine, and Marcus Stoinis are some of the other leading players taking part in the first edition of MLC, to be played in Texas and North Carolina. “The launch of a ground-breaking professional cricket tournament in the USA is an exciting development and I am glad that ARY is part of this new venture as the MLC’s official broadcast partner in Pakistan,” said Salman Iqbal, ARY Digital Founder and CEO. “Cricket is making a grand entry into a market that holds huge potential and we hope that the audiences in Pakistan will enjoy our coverage of these matches.” “We are thrilled to partner with ARY and deliver the adrenaline-packed T20 action Major League Cricket will feature to viewers across Pakistan,” said Tom Dunmore, Vice-president of Marketing, Major League Cricket. “We know how passionate fans in Pakistan are about cricket, and we’re excited that they will have the chance to see their favourite stars like Shadab Khan, Haris Rauf, and Imad Wasim compete on an exciting new stage in the United States.” The partnership between ARY and MLC will ensure the continuation of an exciting cricket season on A Sports and ARY Zap with this year’s historic ICC Men’s Cricket World Cup Qualifiers having ended this past Sunday. ARY’s impressive list of sports content includes the Pakistan Super League, bilateral matches organised by the Pakistan Cricket Board, ICC Men’s and Women’s T20 World Cups, the FIFA World Cup Qatar 2022 , SA20, FairBreak Invitational T20, Formula 1, and La Liga .","pubDate":"2023-07-10 18:35:46","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Pat Cummins delivers perfect two-word response after losing Ashes Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12284817/Pat-Cummins-delivers-perfect-two-word-response-losing-Ashes-Test.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"After enduring his first defeat in the 2023 Ashes series, Aussie skipper Pat Cummins has shut down an English reporter with a perfectly blunt two-word reply and a deadpan smirk.","content":"Pat Cummins delivers perfect two-word response after being asked if Australia are 'rattled' after losing Ashes Test - and refuses to rule out dropping David Warner Cummins gives blunt reply to reporter's question Skipper is not worried momentum may have shifted Warner is no guarantee to be selected for fourth Test By James Cooney For Daily Mail Australia and Scott Bailey For Australian Associated Press Updated: 01:07, 11 July 2023 e-mail 7 View comments After enduring his first defeat in the 2023 Ashes series, Aussie skipper Pat Cummins has shut down an English reporter with a perfectly blunt two-word reply. Australia lost the third Ashes Test at Headingley by three wickets, but still lead the series 2-1 with two Tests remaining. England have kept the battle for the urn alive, but the Aussies need to win just one of the two remaining matches to clinch their first Ashes win in England in more than two decades. When asked post-match by a reporter if he feared momentum had now shifted in favour of England, Cummins said 'not really'. The reporter pressed Cummins to explain, asking, 'Why not?' Cummins with the mic drop moment ¿ #Ashes | #AUSvENG pic.twitter.com/Abyui4KljJ — ESPNcricinfo (@ESPNcricinfo) July 10, 2023 The Aussies need to win just one of the two remaining matches to clinch their first Ashes win in England in more than two decade To which Cummins replied bluntly with a smirk: 'Two-one'. Cummins has also admitted David Warner is no guarantee to be selected for the fourth Ashes Test, conceding that Mitch Marsh will be incredibly hard to leave out at Old Trafford. Warner's spot at the top of Australia's order is again under the microscope after he was dismissed twice by Stuart Broad in seven balls in Australia's three-wicket loss at Headingley on Sunday. Warner has made several starts in the past month and put up one half-century, but is yet to make the kind of big score that would secure his spot through to a planned January retirement. The other factor in Warner's selection is the looming squeeze on Marsh upon fellow all-rounder Cameron Green's return. Green is expected to be fit to be available for the next Test on July 19 after missing Headingley with a hamstring strain. Playing in his first Test in almost four years in place of Green, Marsh scored 118 in a crucial day-one knock and was then reliable with the ball. It means Australia's selectors will have to make the tough call to pick between Marsh and Green for the next Test, unless Warner is displaced and one of the pair opened. Cummins says David Warner (pictured) is no guarantee to be selected for the fourth Ashes Test Warner has yet to make a big score during the Ashes to secure his spot in the side Asked if it was possible Marsh could be retained for Old Trafford in place of Warner, Cummins said it was not out of the question. 'You keep all options open,' Cummins said. 'We've got nine or 10 days now, so we'll take a deep breath. We'll go away for a few days. 'But everyone comes back into it. Greeny should be fit for Manchester. Josh (Hazlewood) will be back in there as well. 'So we should have a full roster and we'll have a look at the wicket and have a chat and work out the best XI.' Then asked if it was even possible to leave Marsh out at Manchester after his performances in Leeds, Cummins indicated it would be incredibly difficult. 'Yeah, it's possible but, I mean, it was a pretty impressive week, wasn't it?' Cummins said. Two more opportunities remain for Australia in a series that already sits as one of the best of the modern era Warner's scores of four and one at Headingley took his series average to 23.5, while he has now been dismissed by Broad 17 times in Test cricket. Despite that, Marsh conceded on Sunday he did not see how he and Green could fit into the same team. 'I don't think there is. That's alright.' Marsh told cricket.com.au. 'I don't want to comment on it too much. Ultimately, that stuff is out of my control. I've got a very, very close relationship with Greeny. 'It's important for him to be in our side. We've seen how important he is for our side over the last couple of years.' Green edged closer to full fitness on Sunday, bowling for close to 20 minutes in the morning before acting as a substitute fielder in the first session and having another light bowl at lunch. Share or comment on this article: Pat Cummins delivers perfect two-word response after losing Ashes Test e-mail Add comment Comments 7 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-11 00:07:39","image_url":"https://i.dailymail.co.uk/1s/2023/07/11/00/73064241-0-image-a-6_1689031483552.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gary Stead to remain NZ men's cricket coach until 2025","link":"https://www.perthnow.com.au/sport/cricket/gary-stead-to-remain-nz-mens-cricket-coach-until-2025-c-11240843","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Gary Stead has been re-appointed as the Black Caps head coach until mid-2025, NZ Cricket deciding against appointing different coaches in different formats.","content":"Gary Stead will continue as coach of New Zealand in all three formats for two more years after New Zealand Cricket (NZC) ruled out any move to appoint different coaches in different formats. NZC general manager of high performance Bryan Stronach said a split coaching model was considered and rejected, though flexibility remained to co-opt additional coaching staff if necessary. Stead was first appointed in 2018 and this is his second contract extension. His current contract was due to expire after the upcoming men's Cricket World Cup in India. He will stay on until the end of the current World Test Championship cycle in 2025. \"The support for Gary was overwhelmingly positive from the players, the Black Caps support staff, major association coaches and support staff as well as the New Zealand Cricket Players Association and NZC High Performance Unit staff,\" Stronach said. \"Gary's results have been very impressive and we're confident that he still has a lot to offer the team. Of course, a big part of this decision came down to whether Gary wanted to continue and he made it clear his appetite to take this team forward was as keen as ever.\" Stead has led New Zealand to the first World Test Championship title and to the finals of the 50-overs and Twenty20 World Cups. Black Caps captain Tim Southee said the players were eager for Stead to continue. \"Gary's had great success leading us into finals in all three formats and, of course, that World Test Championship win,\" Southee said. \"It's been great the way that he's come in and built on what was previously achieved.\"","pubDate":"2023-07-10 23:15:37","image_url":"https://images.perthnow.com.au/publication/C-11240843/77e0873a061527f30cf98a76ce73ebb5e36b25d4-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"England are using some unique methods to keep Ben Stokes fighting fit for Old Trafford Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12284643/England-using-unique-methods-Ben-Stokes-fighting-fit-Old-Trafford-Test.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"RICHARD GIBSON: It had been a week in which abnormal levels of emotional energy had been spent. His team reckoned there were more expletives in Stokes's pre-match talk, than any other.","content":"Russian Twists, R.I.C.E and fasting: The secrets Superman Ben Stokes is using to ensure he'll be flying again at Old Trafford for England England have been using some unique tricks to keep Ben Stokes fit in the Ashes He has sustained several tough injuries, but has battled through them this series Follow Mail Sport on Threads here: https://www.threads.net/@mailsport By Richard Gibson for the Daily Mail Updated: 17:54 EDT, 10 July 2023 e-mail View comments After a round of hugs for his Headingley heroes , Ben Stokes took a moment in the England dressing room and admitted he felt more drained mentally than physically by the three-wicket win over Australia . It had certainly been a week in which abnormal levels of emotional energy had been spent. Team-mates reckoned there were more expletives in Stokes’s passionate pre-match speech, driven by the events of the second Test at Lord’s, than any of his previous 15 addresses as England captain . And so, he heads back to the North East for a few days with his family — son Layton and daughter Libby were in Leeds for Sunday’s dramatic finale — to recharge his batteries before reporting to Manchester on Sunday as England attempt to make this an epic Ashes summer. Thousands of supporters will, of course, be concerned by the impact on Stokes’s body of playing nine days of Test cricket in 12. Him, not so much. Yes, he has hobbled, limped, grimaced and groaned through it all, producing two more unforgettable innings of 155 and 80 along the way. England are going to some unique measures to ensure Ben Stokes remains fighting fit for the next Ashes Test at Old Trafford England clinched a thrilling three-wicket win against Australia at the weekend with Mark Wood (left) and Chris Woakes (right) helping them to the victory Stokes (left) has been suffering with pain in his left knee throughout the series thanks to a tendonitis issue As Oliver Holt brilliantly put it in these pages, Stokes has become England’s version of the black knight from Monty Python and the Holy Grail. ‘I’ve had worse,’ he appears to say, every time the bout of tendonitis in his left knee slows him or a Mitchell Starc-induced blow to the midriff knocks him off his feet. But those close to him say he has come to accept this is the way it will be for him now in Test cricket. He must manage the pain. There is no miracle cure for patellar tendonitis. Just plenty of RICE between matches (rest, ice, compression, elevation). This week he will stick with that and maintain the abdominal exercises such as Russian twists, planks and crunches while moving into a time-restricted diet. When at home with the family, he fasts with wife Clare outside of strict eating hours, a discipline that coincides with a more relaxed training schedule. Like the rest of England’s bowlers, he will also use the portable Game Ready compression therapy system that helps joints recover from strains post-Test, and will receive massage therapy at home club Durham to further ease aches and pains. The glute twinge incurred while over-stretching for a stroke in the first innings at Leeds is not thought to be anything serious, and what role he is able to play in the penultimate match against Australia will be judged once the teams arrive at Old Trafford. He also suffered a bruising blow on Sunday, after Scott Boland hit him with the ball Stokes (bottom left) has been plagued with the knee injury since 2012, and felt it get worse during a Test at Headingley back in 2016 Follow Mail Sport on Threads here: https://www.threads.net/@mailsport Yet patellar tendonitis is only part of the problem in his knee, the battleground of Stokes’s body since 2012. He was just 20 when issues first flared: a partial tear of the cartilage persuading the ECB to pull him out of an England Lions fixture against West Indies in Northampton and book him in for surgery. When he got to the Fortius Clinic in London, Andy Williams, the consultant, advised that an operation was not preferable, explaining that while the tear had created a flap of cartilage which would irritate from time to time, it was manageable. But he has suffered plenty of other issues to boot, including toe and glute injuries this year, broken fingers a broken collar bone and a broken hand It was not until four years later, in 2016 — after he felt the knee lock as he threw the ball from slip to mid-off during a Steven Finn over of the Headingley Test against Sri Lanka — that he went under the knife. Typically of Stokes, when doctors told him he would be out for eight weeks, he set a goal of seven, using ice and compression machines while sleeping in a bid to make the Lord’s Test that opened the home series against Pakistan. He made the deadline, of course. But the selectors erred on the side of caution, holding him back until the second Test in Manchester. Seven years on, the after-affects linger as the removal of articular cartilage causes bone to grind on bone, and those who have endured even the most basic knee repairs know of the random discomforts that follow. Part of Stokes’s pain management earlier this year was to receive a cortisone injection before heading to the Indian Premier League. And it was during his spell at the IPL that Stokes got himself into prime condition for this international summer. With Chennai Super Kings unwilling to select him as a specialist batter, he used an extended period on the sidelines to throw himself into a fitness regime of ‘prehab’ work, making his body as robust as possible. It focused on the hamstrings as they secure the knees and support the back when bowling. He had shown a similar dedication, albeit with an aerobic focus, in the build-up to the World Cup-winning summer of 2019 when he and Jos Buttler were the fastest in the extra-curricular 2km runs. Stokes received a cortisone injection before the Indian Premier League season commenced and it was here that he got himself in prime condition for the Ashes Between matches, the England captain (right) will rest, use ice, put compression on his injuries and elevate them too He has also been fasting while completing a rigourous series of core exercises including Russian Twists and crunches As someone not particularly keen on Indian food, he also asked the franchise’s chef to change his diet plan, focusing on lean meats, vegetables, and protein shakes. When in full training mode like that, he is likely to cheat with treats like Yorkie raisin and biscuit, Revels and Haribo Tangfastic sweets. England’s selection for Headingley was influenced by the fact Stokes is no longer able to contribute in all-rounder capacity in back-to-back matches. He sent down a 12-over spell at Lord’s, and it will be a suck-it-and-see approach used in the nets in Manchester as to whether he will return to bowling. One thing is certain. If it is even remotely possible and his team need him, he will do it. Follow Mail Sport on Threads here: https://www.threads.net/@mailsport Share or comment on this article: England are using some unique methods to keep Ben Stokes fighting fit for Old Trafford Test e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-10 21:54:46","image_url":"https://i.dailymail.co.uk/1s/2023/07/10/22/73061507-0-image-a-123_1689024731075.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Dave Kidd: England youth teams have now won FIVE major trophies in six years… but when will these kids be Prem regulars?","link":"https://www.thescottishsun.co.uk/sport/football/10938685/england-ashley-cole-premier-league/","keywords":["Football","Premier League","World Cup Columnists"],"creator":["Dave Kidd"],"video_url":null,"description":null,"content":"ENGLISH football has come on leaps and bounds in the last dozen years. Take, for example, Ashley Cole — a man who once injured an aspiring youngster with an air rifle but is now credited with a key mentoring role as England won the European Under-21 Championships for the first time since 1984. 5 Ashley Cole helped guide England's Under-21s to Euro glory in Georgia Credit: Getty 5 But many of the Young Lions will struggle for Premier League game time next season Credit: Getty Cole was the world-class left-back of the Golden Generation who accidentally shot a work experience kid at Chelsea’s training ground in 2011. Now he is an influential member of the coaching staff of U21s boss Lee Carsley, a supposedly underwhelming appointment who has proved an inspired choice. Carsley has been flexible in terms of tactics and manpower and his England side were the most attractive and effective team at the tournament they won in Saturday’s final — which saw Cole sent off after a row with the Spanish bench. It was England’s fifth major trophy in six years at age-group levels from U17s to 21s. That is a ringing endorsement at the overhaul of youth football instigated by Gareth Southgate in a former role as the FA’s head of elite development. This began with small-sided games on smaller pitches for primary-school kids, a vast expansion of the number of badged-up coaches, an increased focus on technical ball skills and footballing intelligence, as well as an imposition of a clear pass-and-move playing style. This ended up with England’s U21s scoring some outstanding team goals out in Georgia and winning the tournament without conceding. Spain and Germany were both consistently successful at age-group levels before their senior sides won World Cups and a similar pathway was demanded for England. Most read in Football MISSING IN ACTION Dujon Sterling NOT on Gers' pre-season trip as absence explained SNACK IS BACK McVities is bringing back a discontinued favourite after almost 20 years JAILED Youth football coach who worked for Celtic jailed for sexually abusing young boys MCCOURT SHAME Ex-Celtic star Paddy McCourt sentenced for indecent assault of woman CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 So Southgate and the FA, neither of whom receive enough credit, have done all they can. The problem, though, is obvious. Will many of Carsley’s team be playing regular Premier League football next season? Southgate knows he sounds like a stuck record when he continually points out that the number of English Premier League starters remains around 32 per cent. But that problem isn’t going away, as the wealth of England’s top flight increases and the life-expectancy of managerial tenures shrink. After England’s quarter-final exit at last year’s World Cup, there appeared to be no native players tearing it up in the Premier League and demanding the opportunity to freshen up Southgate’s senior squad. The evidence from Georgia suggests England do have several players who are good enough, yet not experienced enough. The key Manchester City trio of keeper James Trafford, skipper Taylor Harwood-Bellis and attacking midfielder Cole Palmer will not be playing for Pep Guardiola’s Treble winners. 5 Arsenal's Emile Smith Rowe is one of few squad members with significant Prem experience - unlike Everton's James Garner (right) Credit: Getty 5 Ben Johnson (left) is a squad player at West Ham, Tottenham's Oliver Skipp is far from first choice in midfield and Max Aarons will play Championship football again with Norwich Credit: Getty Trafford, the injury-time penalty-saving hero of Saturday’s final triumph against Spain, has the brilliance and supreme self-confidence to be an absolute star. All the more remarkable given that he has not played club football any higher than League One, where he spent the last 18 months on loan at Bolton. Trafford is now poised to move to Burnley, which may ease his path into Southgate’s squad. Harwood-Bellis, who has never played in the Prem but was loaned to Turf Moor last season, is highly rated for his leadership qualities as well as his defensive abilities and is a target for Fulham and West Ham . Palmer has been on the fringes of Guardiola’s team for some time but is desperate for a high-level loan move. Borussia Dortmund and Brighton are among his admirers. Levi Colwill, surely the left-footed centre-half Southgate craves, spent last season at the Amex but his game time was limited. He returns to Chelsea hoping Mauricio Pochettino’s reputation for nurturing young English players will survive the Stamford Bridge madhouse. Noni Madueke, a talented winger in need of greater end- product, is also at Chelsea, where players have to compete for space in the training-ground dressing room, let alone a first-team starting place. Emile Smith Rowe, the only member of Carsley’s squad with a senior cap, has gone backwards at Arsenal after injury and may need a move, either temporary or permanent. Anthony Gordon, the player of the tournament in Georgia, is yet to nail down a regular place at Newcastle, who will continue to spend. 5 Goalkeeping hero James Trafford (left) has just sealed a move to Prem new boys Burnley and Cole Palmer is trying to break into Treble-winning Manchester City's team Credit: Getty Curtis Jones, reckoned by Carsley to be the best of his bunch, has flitted in and out of Liverpool’s starting XI, even before a major midfield overhaul at Anfield this summer. Angel Gomes has thrived in a deeper midfield role since switching from Manchester United to Lille but Southgate is, perhaps rightly, sniffy about the quality of the football in other major European leagues. Morgan Gibbs-White, one of the first names on the Nottingham Forest team-sheet, has the clearest run at a breakthrough into Southgate’s squad. All in all, though, there are far too many of Carsley’s players who have returned home desperate for transfers, or for assurances of regular football at their current clubs. Because there has never been a better time to learn your football as a young English player, yet there has never been a worse time to play that football at the highest level. TRANSFER NEWS LIVE: All the latest news, rumours and confirmed switches from the world of football BAZ IT ALL UP SITTING among the great and good of English cricket in media centres during The Ashes gives you some fascinating off-the-record insights and opinions. Some well-informed ex-players believe that Bazball is like a brainwashing New Age religious cult, where players and coaches have lost all reason. Others believe it is a work of genius, transforming the attitudes of players and attracting new fans to Test cricket. If England win The Ashes, Bazball will be hailed as the greatest philosophy in sporting history. If they don’t, it will be condemned as happy-clappy claptrap. The truth probably lies somewhere in between. MUZZ BE BACK IT’S 4½ years since the Australian Open organisers screened an emotional ‘retirement’ video for Andy Murray. Yet the three-time Grand Slam winner is still going. The Scot, 36, has hinted that his second-round defeat by Stefanos Tsitsipas may have been his Wimbledon farewell — but don’t bet on it. Murray is the stubborn old GOAT of British tennis and he will surely be back. THOSE who hate FFP rules argue they are solely designed to hinder clubs with ‘new money’ while allowing the old elite an unfair advantage. Yet Manchester United face a tough summer window — because, after years of spending badly, they can’t sell on too many players signed for too much money on inflated wages. Exactly the sort of thing FFP was designed to punish. Read more on the Scottish Sun DAY-FLIGHT ROBBERY Inside Scots city plagued by aggressive seagulls that attack shoppers HANDY HACK Drivers are only just realising you can remove car scratches with a £1 item GREAT to see Steven Gerrard return to management and proudly waving the scarf of Saudi club Al-Ettifaq, who will pay him £8million a year. As they like to say on Merseyside: “This Means More.”","pubDate":"2023-07-10 21:36:13","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australia won't go without spin even with lack of overs","link":"https://www.perthnow.com.au/sport/cricket/australia-wont-go-without-spin-even-with-lack-of-overs-c-11240120","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia barely bowled Todd Murphy in the fourth innings at Headingley, but say they will not go into a Test match in this Ashes series without a spinner.","content":"Australia won't abandon Todd Murphy after one Test, determined to stick with playing a spinner for the rest of the Ashes instead of opting for an extra quick. Murphy was only handed the ball for two overs as England chased down 251 in the at Headingley on Sunday, after taking 1-36 from 7.3 overs in the first innings. That lack of involvement marked the least use of spin by Australia in an innings of 50 overs or more since Nathan Lyon was left out of the Perth Test against India in 2012. Australia say part of that was conditions-based on a Headingley wicket that did not turn, as well as the fact England did not bat 60 overs in either innings. But the reality is England have rarely batted any longer through the series, with the hosts' innings lasting an average of 67.3 overs. That had prompted the thought Australia could potentially leave Murphy out of one of the final two Tests, providing an easy answer for the Cameron Green and Mitch Marsh dilemma. But coach Andrew McDonald said that was extremely unlikely to come at the expense of Murphy, with the 22-year-old stepping up for the injured Lyon. \"We like a spinner,\" McDonald said. \"We like to have a balanced attack and it gives you options, you can take pace out of the game and you become one dimensional ... without the ability to turn to a spinner. \"We'll have to assess that, but as it sits at the moment we do like to have the spinner in the team.\" One change to the bowling attack is likely for Old Trafford, with Josh Hazlewood expected to return after being put on ice at Headingley. Scott Boland would be the man most likely to drop out after he went wicketless in the loss, despite McDonald believing he had bowled well without luck. McDonald also said Australia would closely examine the constant use of the short ball to England's lower order during their chase, after the hosts bowled considerably fuller in Leeds. \"If it works you say that it's right, and if it doesn't then you're probably on the opposite side,\" McDonald said. \"It's a combination, it's always somewhere in the middle of that. \"Day one, Mark Wood had ball speed and the ball was shifting, the overheads were pretty thick and you tend to pitch the ball up a lot more in those conditions. \"And when the sun comes out and the ball's not shifting as much, you've probably got less options on the fuller side. \"We critique ourselves pretty harshly so we'll be looking into that no doubt.\"","pubDate":"2023-07-10 21:02:02","image_url":"https://images.perthnow.com.au/publication/C-11240120/cf040b9311fce30aee1649a1305d0fa067b12175-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"TNPL 2023: Nellai Royal Kings enters the final after a last-ball win against Dindigul Dragons","link":"https://www.thehindu.com/sport/cricket/tnpl-2023-qualifier-2-nellai-royal-kings-vs-dindigul-dragons/article67065506.ece","keywords":null,"creator":null,"video_url":null,"description":"Ajitesh and Rithik’s 62-run partnership in just 3.3 overs takes their team past the finish line in a last-ball thriller; Shivam’s half-century goes in vain for the Dragons","content":"Nellai Royal Kings was in a spot of bother with 57 needed off 21 balls to qualify for the final. Nidhish Rajagopal was struggling to find the boundaries, scoring 26 off 27, even as G. Ajitesh (73 n.o., 44b, 5x4, 5x6) single-handedly kept the side in the game with another swashbuckling innings. It took a brave call by the Royal Kings management to retire Nidhish and get Rithik Easwaran (39 n.o., 11b, 6x6) in. Under tremendous pressure, The young left-handerr showed a calm head and used his beautiful bat swing to do the talking with telling effect as Royal Kings beat Dindigul Dragons by seven wickets in a nail-biting thrilling Qualifier-2 of the TNPL here at the ICL ground on Monday. With 37 needed off the last two overs, Rithik flayed G. Kishoor for three sixes down the ground off the first three balls of the 19th over. Ajitesh hit the fifth ball for a six before Kishoor delivered a no ball off the last delivery, allowing Rithik to scoop the final legal delivery over fine-leg as 33 came off that over. However, Dragons did not go down without a fight as Subodh Bhati did his best to defend four runs in the 20th over, bringing the equation to one off the last ball. But Rithik finished the chase in style by depositing a low full toss over square-leg to ensure that Nellai will meet Lyca Kovai Kings in the final on Wednesday. The chase though was set up by Ajitesh who continued to impress with his attacking backfoot play and ensured the Nellai side kept up with the asking rate. The diminutive right-hander cut loose in the 15th over, hitting Kishoor for consecutive sixes by charging down the wicket, the second of which got him to his third consecutive half-century of the tournament. Earlier, Shivam Singh continued his fine form in the tournament slamming 76 (46b, 4x4, 6x6) to ensure Dragons ended up 185 for five after being asked to bat. Shivam and the left-handed M. Boopathi Vaishnav Kumar (41, 27b, 4x4, 1x6) added 81 for the second wicket to help Dragons set up a competitive total. The scores: Dindigul Dragons 185/5 in 20 overs (Shivam Singh 76, M. Boopathi Vaishnav Kumar 41, Sonu Yadav 2/31) lost to Nellai Royal Kings 191/3 in 20 overs (K.B. Arun Karthick 26, G. Ajitesh 73 n.o., Nidhish Rajagopal 26 rtd, Rithik Easwaran 39 n.o.).","pubDate":"2023-07-10 19:29:54","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | Three talking points after England's Ashes win over Australia","link":"https://www.news24.com/sport/Cricket/three-talking-points-after-englands-ashes-win-over-australia-20230710","keywords":null,"creator":null,"video_url":null,"description":"England's thrilling three-wicket win in the third Test at Headingley on Sunday kept the Ashes alive, with Ben Stokes's men now just 2-1 behind with two Tests to play.","content":"England's thrilling three-wicket win in the third Test at Headingley on Sunday kept the Ashes alive, with Ben Stokes's men now just 2-1 behind with two Tests to play. But both England and Australia face selection dilemmas heading into next week's fourth Test at Old Trafford, with history against the hosts in their bid to regain the Ashes. AFP Sport looks at some of the major issues at this stage of a fascinating series: Bairstow struggling behind the stumps England dropped Ben Foakes ahead of the Ashes, despite having previously insisted the Surrey man was the world's best wicketkeeper, in order to accommodate the returning Jonny Bairstow. Bairstow was the standout performer at the start of England's 'Bazball' era, scoring over 1,000 runs, including six hundreds, in 10 Tests last year. His movement behind the stumps in the Ashes, however, appears to have been affected by the broken leg that sidelined him for nine months, with Bairstow dropping seven catches and missing a stumping in a series where he is also averaging a modest 23.50 with the bat. But England coach Brendon McCullum and captain Ben Stokes have made few selection errors since joining forces last year and they may well keep faith with Bairstow. England must also decide whether to recall James Anderson on his Old Trafford home ground after the veteran paceman, 41 later this month, was rested at Headingley after taking just three wickets, at more than 75 apiece, across the opening two matches. Chris Woakes, his stand-in at Leeds, took six wickets and also made a priceless 32 not out that helped seal England's victory. Anderson's 688 wickets are the most by any fast bowler in Test history and he could come straight back into the side if seamer Ollie Robinson, reduced to a bit-part role at Headingley by a back spasm, is deemed unfit. Warner worry for Australia Australia opener David Warner has signalled his intention to retire from Test cricket against Pakistan on his Sydney home ground next year. But the 36-year-old left-hander may not bow out on his own terms after another double failure against his England nemesis Stuart Broad at Headingley. Warner scored just four and one at Leeds, falling to Broad on both occasions, with the paceman now having dismissed him 17 times in Tests. Marcus Harris is the reserve batsman in the squad, but Australia could also drop Warner and rejig their batting line-up by retaining Mitchell Marsh and recalling Cameron Green. Marsh scored a fine 118 at Headingley in his first Test since 2019 after being called up as injury cover for Green. England aim to emulate Bradman's men England are trying to equal a record that has stood for 86 years by becoming just the second team to win an Ashes from 2-0 down. Australia were 2-0 behind in the 1936/37 Ashes, but in the New Year's Test at Melbourne, home captain Don Bradman found his form with an innings of 270 as the hosts won by 365 runs. He then made 212 and 169 as Australia triumphed by 148 runs and an innings and 200 runs at Adelaide and Melbourne -- which staged two Tests in the series -- respectively to complete their comeback. Bradman's career Test batting average of 99.94 remains one of sport's great unassailable landmarks, with no one coming close to that imposing figure since his retirement in 1948.","pubDate":"2023-07-10 19:29:50","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"MS Dhoni, Sakshi Singh Launch Debut Production Venture, Lets Get Married (LGM) Trailer in Chennai","link":"https://www.thetimesofbengal.com/sports/ms-dhoni-sakshi-singh-launch-debut-production-venture-lets-get-married-lgm-trailer-in-chennai/?utm_source=rss&utm_medium=rss&utm_campaign=ms-dhoni-sakshi-singh-launch-debut-production-venture-lets-get-married-lgm-trailer-in-chennai","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports MS Dhoni, Sakshi Singh Launch Debut Production Venture, Let’s Get Married (LGM) Trailer in Chennai Let’s Get Married, which will release later in 2023 or early 2024 features Harish Kalyan and Ivana in lead roles MS Dhoni, Sakshi Singh Launch Debut Production Venture, Let’s Get Married (LGM) Trailer in Chennai. (Image: Twitter) Chennai: MS […] The post MS Dhoni, Sakshi Singh Launch Debut Production Venture, Lets Get Married (LGM) Trailer in Chennai first appeared on The Times of Bengal.","content":"Chennai: MS Dhoni, captain of Chennai Super Kings and former India captain made his debut as a producer along with wife Sakshi Singh as the couple launched the trailer and audio of Let’s Get Married (LGM) on Monday in Chennai. The couple arrived in Chennai on July 9 and received a thunderous reception at the Chennai Airport. Fans flocked in huge numbers to catch a glimpse of their beloved Thala. Let’s Get Married , which will release later in 2023 or early 2024 features Harish Kalyan and Ivana in lead roles. The upcoming family entertainer is directed by Ramesh Thamilmani, who is also the composer of the film. LGM will also see notable stars in Nadiya, Yogi Babu and Mirchi Vijay. Amid speculations of Dhoni’s retirement, the 42-year old led Chennai to their 5th IPL title in May, beating defending champions Gujarat Titans at their own backyard. The wicket-keeper batter was also struggling with a knee injury and recently went under the knife. He is currently in recovering phase. After winning the title with Chennai, Dhoni made it clear that he still has time to think about his retirement and he will give one more season to the fans. Three days before, Thala celebrated his 42nd birthday with his family at his Ranchi farmhouse. Dhoni has been one of the successful cricketers in his game and now we have to wait and see how he and his wife fairs out as a film producer. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-07-10 19:21:50","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Horse Between Two GOATS’ रवींद्र जडेजा ने इंस्टाग्राम स्टोरी पर राहुल द्रविड़ और रवि अश्विन के साथ अपनी तस्वीर की शेयर, कैप्शन के साथ देखें Photo","link":"https://hindi.latestly.com/socially/sports/cricket/ravindra-jadeja-shared-his-picture-with-rahul-dravid-and-ravi-ashwin-on-instagram-story-see-photo-with-caption-1860433.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट टीम के भरोसेमंद ऑलराउंडर रवींद्र जड़ेजा ने इंस्टाग्राम पर 'दो बकरियों के बीच घोड़ा' कैप्शन के साथ एक स्टोरी शेयर की है. तस्वीर में उन्हें कोच राहुल द्रविड़ और मुख्य स्पिनर रविचंद्रन अश्विन के बीच खड़े देखा गया और इसलिए यह कैप्शन आया.","content":"IND vs WI Series 2023: भारतीय क्रिकेट टीम इस समय वेस्टइंडीज के डोमिनिका में कैरेबियाई टीम के खिलाफ अपना पहला टेस्ट मैच खेलने की तैयारी कर रही है. इससे पहले भारतीय क्रिकेट टीम के भरोसेमंद ऑलराउंडर रवींद्र जड़ेजा ने इंस्टाग्राम पर 'दो बकरियों के बीच घोड़ा' कैप्शन के साथ एक स्टोरी शेयर की है. तस्वीर में उन्हें कोच राहुल द्रविड़ और मुख्य स्पिनर रविचंद्रन अश्विन के बीच खड़े देखा गया और इसलिए यह कैप्शन आया. ट्वीट देखें: Instagram story of Ravindra Jadeja. Horse in between two GOAT's. pic.twitter.com/3F8hkzFKDL — Johns. (@CricCrazyJohns) July 10, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-10 18:36:09","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ARY acquires media rights for Major League Cricket","link":"https://a-sports.tv/ary-digital-network-acquires-media-rights-major-league-cricket/","keywords":["Cricket","Sports","Top News","Top Picks","ARY acquires media rights for MLC","Major League Cricket"],"creator":["A Sports"],"video_url":null,"description":"ARY Digital Network has secured media rights in Pakistan for the first-ever season of Major League Cricket (MLC), the transformative T20 competition bringing the world’s best players to the United States this July. The six-team competition starting on 14 July in the USA will be broadcast on A Sports, one of Pakistan’s leading sports TV […] The post ARY acquires media rights for Major League Cricket appeared first on ASports.tv.","content":"ARY Digital Network has secured media rights in Pakistan for the first-ever season of Major League Cricket (MLC), the transformative T20 competition bringing the world’s best players to the United States this July. The six-team competition starting on 14 July in the USA will be broadcast on A Sports, one of Pakistan’s leading sports TV channels, and live-streamed on the ARY Zap mobile app and website. The first season of MLC is set to feature world-class international players across the six participating teams – Los Angeles Knight Riders, MI New York, San Francisco Unicorns, Seattle Orcas, Texas Super Kings and Washington Freedom. The inaugural season will be played in a round-robin format with the four best-performing teams competing in a multi-game playoff and final round to decide a champion, to be crowned on July 30. The star-studded MLC player roster includes Pakistan’s Shadab Khan, Haris Rauf, and Imad Wasim. Former Pakistani players Sami Aslam, Nauman Anwar, Hammad Azam, Ehsan Adil, and Mukhtar Ahmed are also featuring in MLC this season. International cricket stars Kieron Pollard, Rashid Khan, Jason Roy, Kagiso Rabada, Andre Russell, Sunil Narine, and Marcus Stoinis are some of the other leading players taking part in the first edition of MLC, to be played in Texas and North Carolina. “The launch of a ground-breaking professional cricket tournament in the USA is an exciting development and I am glad that ARY is part of this new venture as the MLC’s official broadcast partner in Pakistan,” said Salman Iqbal, ARY Digital Founder and CEO. “Cricket is making a grand entry into a market that holds huge potential and we hope that the audiences in Pakistan will enjoy our coverage of these matches.” “We are thrilled to partner with ARY and deliver the adrenaline-packed T20 action Major League Cricket will feature to viewers across Pakistan,” said Tom Dunmore, Vice-president of Marketing, Major League Cricket. “We know how passionate fans in Pakistan are about cricket, and we’re excited that they will have the chance to see their favourite stars like Shadab Khan, Haris Rauf, and Imad Wasim compete on an exciting new stage in the United States.” The partnership between ARY and MLC will ensure the continuation of an exciting cricket season on A Sports and ARY Zap with this year’s historic ICC Men’s Cricket World Cup Qualifiers having ended this past Sunday. ARY’s impressive list of sports content includes the Pakistan Super League, bilateral matches organised by the Pakistan Cricket Board, ICC Men’s and Women’s T20 World Cups, the FIFA World Cup Qatar 2022 , SA20, FairBreak Invitational T20, Formula 1, and La Liga .","pubDate":"2023-07-10 18:35:46","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"}]}