{"newsArray":[{"title":"Djokovic suffers final Australian Open blow","link":"https://wwos.nine.com.au/tennis/djokovic-to-be-replaced-at-no-1-by-medvedev-after-dubai-loss/134cf6c6-74dc-4384-a04b-a05de58f7903","keywords":null,"creator":["wwos"],"video_url":null,"description":"The Serbian star lost to Czech qualifier Jiri Vesely in the quarterfinals of the Dubai Championships, losing his grip on the top ranking.","content":"Novak Djokovic will fall from No. 1 in the ATP rankings and be replaced by Daniil Medvedev after losing 6-4, 7-6 (4) to Czech qualifier Jiri Vesely in the quarterfinals of the Dubai Championships on Thursday.Djokovic’s latest stay atop the rankings began on February 3, 2020, and his total of 361 weeks there are the most for any man since the tour’s computerised rankings began in 1973.READ MORE: Cricket legend rushed to hospital after heart attackREAD MORE: Warne's staggering England job applicationREAD MORE: Quade Cooper granted citizenship after 75 TestsOn Monday, Medvedev will move up from No. 2 for the first time and become the 27th man to reach No. 1. He won the U.S. Open last September and was the Australian Open runner-up each of the past two years.Medvedev is the first man other than Djokovic, Roger Federer, Rafael Nadal or Andy Murray to be No. 1 since February 1, 2004.“It's great for tennis, I think, to have somebody new at world No. 1 again,” Vesely said in his on-court interview. “Tennis needs, of course, new No. 1s. A new generation is coming up. I think it's just great.”It was the 34-year-old Djokovic's first tournament since being deported from Australia last month for not being vaccinated against the coronavirus, preventing him from being able to defend his Australian Open title.Medvedev is currently playing at the Mexican Open, winning in the second round on Wednesday.After beating Pablo Andujar, Medvedev said of getting to No. 1: “If I do it it’s going to mean a lot.\"Vesely, who is ranked No. 123, completed a second career victory over Djokovic in just under two hours to end the Serb's hopes of winning the Dubai title for a sixth time. He beat Djokovic in 2016 in Monte Carlo the only other time they faced each other.“I never expected to win again,” Vesely said. “He’s such a champion.”Vesely served for the match at 5-4 in the second set but was broken by Djokovic, who was always chasing in the tiebreaker.Vesely clinched the win on his first match point.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-24 20:23:10","full_description":"Novak Djokovic will fall from No. 1 in the ATP rankings and be replaced by Daniil Medvedev after losing 6-4, 7-6 (4) to Czech qualifier Jiri Vesely in the quarterfinals of the Dubai Championships on Thursday. Djokovic’s latest stay atop the rankings began on February 3, 2020, and his total of 361 weeks there are the most for any man since the tour’s computerised rankings began in 1973. READ MORE: Cricket legend rushed to hospital after heart attack READ MORE: Warne's staggering England job application READ MORE: Quade Cooper granted citizenship after 75 Tests On Monday, Medvedev will move up from No. 2 for the first time and become the 27th man to reach No. 1. He won the U.S. Open last September and was the Australian Open runner-up each of the past two years. Medvedev is the first man other than Djokovic, Roger Federer, Rafael Nadal or Andy Murray to be No. 1 since February 1, 2004. “It's great for tennis, I think, to have somebody new at world No. 1 again,” Vesely said in his on-court interview. “Tennis needs, of course, new No. 1s. A new generation is coming up. I think it's just great.” It was the 34-year-old Djokovic's first tournament since being deported from Australia last month for not being vaccinated against the coronavirus, preventing him from being able to defend his Australian Open title. Medvedev is currently playing at the Mexican Open, winning in the second round on Wednesday. After beating Pablo Andujar, Medvedev said of getting to No. 1: “If I do it it’s going to mean a lot.\" Vesely, who is ranked No. 123, completed a second career victory over Djokovic in just under two hours to end the Serb's hopes of winning the Dubai title for a sixth time. He beat Djokovic in 2016 in Monte Carlo the only other time they faced each other. “I never expected to win again,” Vesely said. “He’s such a champion.” Vesely served for the match at 5-4 in the second set but was broken by Djokovic, who was always chasing in the tiebreaker. Vesely clinched the win on his first match point. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/411376/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Banished golf star 'deserves a second chance'","link":"https://wwos.nine.com.au/golf/golf-news-phil-mickelson-second-chance-golfers-respond/4a0b961e-a90c-4150-8856-cd8635e10531","keywords":null,"creator":["wwos"],"video_url":null,"description":"Phil Mickelson's comments about the rebel Saudi backed golf league have upset many at the PGA Tour.","content":"PGA Tour golfers, including Brooks Koepka and Daniel Berger, have been discussing Phil Mickelson's recent comments on the reported Saudi-backed breakaway golf tour, the Super Golf League.On Tuesday, six-time major winner Mickelson said comments he made regarding the reported tour were off the record -- a claim the reporter who interviewed him has denied -- and said they were shared out of context and without his consent.READ MORE: Cricket legend rushed to hospital after heart attackREAD MORE: Warne's staggering England job applicationREAD MORE: Quade Cooper granted citizenship after 75 TestsThe Super League is reportedly a Saudi-backed venture that is attempting to attract golfers away from golf's main tours, the PGA Tour and the DP World Tour, with offers of big money.Last week, Mickelson was quoted from a 2021 interview with author Alan Shipnuck for his upcoming book, \"Phil: The Rip-Roaring (and Unauthorised!) Biography of Golf's Most Colorful Superstar,\" as saying that he would consider joining the proposed Super League because it is a \"once-in-a-lifetime opportunity to reshape how the PGA Tour operates.\"Shipnuck quoted Mickelson as saying disparaging things about Saudi Arabia's human rights record and asserting that the kingdom killed journalist Jamal Khashoggi.Four-time PGA Tour winner Daniel Berger says Mickelson \"deserves a second chance\" if he is remorseful about his comments.\"I don't know much about the whole Phil, Saudi thing. I try not to pay attention it,\" he said.\"I just think it's kind of like noise, but my experience with Phil in the past has been good experiences and I think everyone deserves a second chance, so if he sincerely is sorry for what he said, then I think he deserves a second chance.\"Since Mickelson's comments, several leading golf stars -- including Rory McIlroy, Dustin Johnson and Bryson DeChambeau -- have reiterated their commitment to the PGA Tour, with Berger now also following suit.\"I've always been behind the Tour. I think Commissioner [Jay] Monahan is the right guy for the job,\" he said. \"I think he's done an amazing job through COVID, something that people didn't give him enough credit for, what he was able to do in such challenging times.\"There's no one I would trust more to guide the Tour through all of these difficult times and I think he's done a great job. I like where the Tour is headed. I like the new initiatives that have been brought out.\"Four-time major winner Brooks Koepka says he \"skimmed over\" Mickelson's comments and remains \"happy with the PGA Tour,\" but doesn't think this is the last players and fans will hear of a breakaway tour.\"I think everyone out here is happy,\" he said. \"He [Mickelson] can think whatever he wants to think, man, he can do whatever he wants to do. So I think everybody out here is happy and I think a lot of people out here have the same opinion.\"I don't [think talk of the breakaway league is over]. Everyone talks about money,\" he added. \"They've [Saudi Arabia] got enough of it. I don't see it backing down; they can just double up and they'll figure it out. They'll get their guys. Somebody will sell out and go to it.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-24 19:27:43","full_description":"PGA Tour golfers, including Brooks Koepka and Daniel Berger, have been discussing Phil Mickelson's recent comments on the reported Saudi-backed breakaway golf tour, the Super Golf League. On Tuesday, six-time major winner Mickelson said comments he made regarding the reported tour were off the record -- a claim the reporter who interviewed him has denied -- and said they were shared out of context and without his consent. READ MORE: Cricket legend rushed to hospital after heart attack READ MORE: Warne's staggering England job application READ MORE: Quade Cooper granted citizenship after 75 Tests The Super League is reportedly a Saudi-backed venture that is attempting to attract golfers away from golf's main tours, the PGA Tour and the DP World Tour, with offers of big money. Last week, Mickelson was quoted from a 2021 interview with author Alan Shipnuck for his upcoming book, \"Phil: The Rip-Roaring (and Unauthorised!) Biography of Golf's Most Colorful Superstar,\" as saying that he would consider joining the proposed Super League because it is a \"once-in-a-lifetime opportunity to reshape how the PGA Tour operates.\" Shipnuck quoted Mickelson as saying disparaging things about Saudi Arabia's human rights record and asserting that the kingdom killed journalist Jamal Khashoggi. Four-time PGA Tour winner Daniel Berger says Mickelson \"deserves a second chance\" if he is remorseful about his comments. \"I don't know much about the whole Phil, Saudi thing. I try not to pay attention it,\" he said. \"I just think it's kind of like noise, but my experience with Phil in the past has been good experiences and I think everyone deserves a second chance, so if he sincerely is sorry for what he said, then I think he deserves a second chance.\" Since Mickelson's comments, several leading golf stars -- including Rory McIlroy, Dustin Johnson and Bryson DeChambeau -- have reiterated their commitment to the PGA Tour, with Berger now also following suit. \"I've always been behind the Tour. I think Commissioner [Jay] Monahan is the right guy for the job,\" he said. \"I think he's done an amazing job through COVID, something that people didn't give him enough credit for, what he was able to do in such challenging times. \"There's no one I would trust more to guide the Tour through all of these difficult times and I think he's done a great job. I like where the Tour is headed. I like the new initiatives that have been brought out.\" Four-time major winner Brooks Koepka says he \"skimmed over\" Mickelson's comments and remains \"happy with the PGA Tour,\" but doesn't think this is the last players and fans will hear of a breakaway tour. \"I think everyone out here is happy,\" he said. \"He [Mickelson] can think whatever he wants to think, man, he can do whatever he wants to do. So I think everybody out here is happy and I think a lot of people out here have the same opinion. \"I don't [think talk of the breakaway league is over]. Everyone talks about money,\" he added. \"They've [Saudi Arabia] got enough of it. I don't see it backing down; they can just double up and they'll figure it out. They'll get their guys. Somebody will sell out and go to it.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/05/359729/pickerImage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"New Zealand vs South Africa, 2nd Test, Day 1: Live Cricket Score, Updates","link":"https://sports.ndtv.com/cricket/new-zealand-vs-south-africa-2022-2nd-test-day-1-live-cricket-score-and-updates-2788045","keywords":null,"creator":null,"video_url":null,"description":"New Zealand vs South Africa, 2nd Test, Day 1, live cricket score and updates: New Zealand go into the second Test against South Africa on Friday on the cusp of clinching the series and reclaiming the...","content":null,"pubDate":"2022-02-24 18:26:37","full_description":"New Zealand vs South Africa, 2nd Test, Day 1, live cricket score and updates: New Zealand go into the second Test against South Africa on Friday on the cusp of clinching the series and reclaiming the mantle of number one in the world. A draw in Christchurch would give New Zealand a historic first series win against South Africa in 17 attempts, while victory would not only complete a 2-0 series sweep but it would see them dislodge Australia at the top of the world rankings. The notorious bowl-first green wicket at Hagley Oval has been a happy hunting ground for New Zealand with eight wins from 10 Tests. ( LIVE SCORECARD ) It is time for the second Test match between New Zealand and South Africa. The Kiwis have never won a Test series against South Africa and this time they have an advantage heading into this second game with a 1-nil lead. The hosts managed to win the first Test match in just 7 sessions. Since December 2018, New Zealand have won their last five Tests played at Hagley Oval and they would be oozing with confidence coming into this game. Even though after missing the services of Ross Taylor, Kane Williamson and Trent Boult the hosts were still able to dictate terms and would hope to continue on their merry way. A win in this game will help the Kiwi move up in the World Test Championship points table. South Africa, on the other hand, are a side who perform well with their back against the wall. They did it with India at home, but this time will they be able to do in foreign conditions? South Africa do need to have a look at their batting combinations, and we might see some changes in the batting line-up. This is the second and the final Test match of the series. South Africa need to get back to their potential and come out victorious if they are to keep their record intact against the Kiwis. The Proteas are surely missing Keegan Petersen’s resistance at number 3. They need their batters to pull their socks up and apply themselves in the middle. The second Test should be nothing less than the first one. We will surely be in for a treat. Will the hosts continue their domination at Hagley Oval? Or will South Africa be able to maintain their unbeaten run against the Kiwis? We shall find out together.","image_url":"https://c.ndtvimg.com/2022-02/jmal18ug_new-zealand-south-africa-afp_625x300_24_February_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia legend Marsh suffers heart attack","link":"https://www.thehansindia.com/sports/australia-legend-marsh-suffers-heart-attack-730748","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"Australian cricket legend Rod Marsh has been admitted to a hospital in Queensland after suffering a serious heart attack.","content":"Australian cricket legend Rod MarshAustralian cricket legend Rod MarshSydney: Australian cricket legend Rod Marsh has been admitted to a hospital in Queensland after suffering a serious heart attack.The former wicketkeeper was in Bundaberg to attend an event for the Bulls Masters charity group. Marsh was reportedly rushed to the hospital by the organisers as he suffered a heart attack soon after reaching Bundaberg. Cricket Australia CEO Nick Hockley said: \"We are very concerned to hear the news about Rod and send him all our best wishes.\" \"Our thoughts are with him, his wife Ros and their family and many friends at this difficult time. Rod is one of the most iconic and popular figures in the game and we thank and acknowledge those who are looking after him,\" Hockley was quoted as saying by the media in Australia. Marsh played 97 first-class games for Western Australia with WA Cricket CEO Christina Matthews also wishing him a \"full and speedy recovery\". \"We're deeply concerned to hear of Rod Marsh's medical emergency after suffering a major heart attack,\" she said.","pubDate":"2022-02-24 18:18:51","full_description":"Australian cricket legend Rod Marsh Sydney: Australian cricket legend Rod Marsh has been admitted to a hospital in Queensland after suffering a serious heart attack. The former wicketkeeper was in Bundaberg to attend an event for the Bulls Masters charity group. Marsh was reportedly rushed to the hospital by the organisers as he suffered a heart attack soon after reaching Bundaberg. Cricket Australia CEO Nick Hockley said: \"We are very concerned to hear the news about Rod and send him all our best wishes.\" \"Our thoughts are with him, his wife Ros and their family and many friends at this difficult time. Rod is one of the most iconic and popular figures in the game and we thank and acknowledge those who are looking after him,\" Hockley was quoted as saying by the media in Australia. Marsh played 97 first-class games for Western Australia with WA Cricket CEO Christina Matthews also wishing him a \"full and speedy recovery\". \"We're deeply concerned to hear of Rod Marsh's medical emergency after suffering a major heart attack,\" she said.","image_url":"https://assets.thehansindia.com/h-upload/2022/02/24/500x300_1278615-rod-marsh.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Matthew Hayden believes Australian cricket culture at a crossroads over white ball and IPL stance","link":"https://thewest.com.au/sport/cricket/matthew-hayden-believes-australian-cricket-culture-at-a-crossroads-over-white-ball-and-ipl-stance--c-5824001","keywords":null,"creator":["Robert Craddock"],"video_url":null,"description":"Matthew Hayden believes Australia’s cricket culture will be torn apart if it continues to let players ‘cherry pick’ when they want to play white ball games for their country.","content":null,"pubDate":"2022-02-24 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5824001/371a05084884bf71097833f9c76fa30fd49b15e9-16x9-x1y0w2446h1376.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Man of the Match today: Who was awarded Man of the Match in IND vs SL 1st T20I in Lucknow?","link":"https://thesportsrush.com/cricket-news-india-vs-sri-lanka-man-of-the-match-today-who-won-awarded-man-of-the-match-in-ind-vs-sl-1st-t20i-in-lucknow/","keywords":["Cricket","india vs sri lanka","Sri Lanka tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"India vs Sri Lanka Man of the Match today: His 111-run partnership alongside Rohit Sharma earned the Southpaw the ‘Man of the match’ award. During the first T20I of the ongoing Sri Lanka’s tour of India in Lucknow, team India registered a thumping 62-run victory against their Asian rivals, to go 1-0 up in the three-match… The post India vs Sri Lanka Man of the Match today: Who was awarded Man of the Match in IND vs SL 1st T20I in Lucknow? appeared first on The SportsRush.","content":"India vs Sri Lanka Man of the Match today: His 111-run partnership alongside Rohit Sharma earned the Southpaw the ‘Man of the match’ award. During the first T20I of the ongoing Sri Lanka’s tour of India in Lucknow, team India registered a thumping 62-run victory against their Asian rivals, to go 1-0 up in the three-match T20I series. Chasing a mammoth score of 199/2 after their skipper Dasun Shanaka opted to field first, Sri Lanka got off to a poor start after India’s experienced pacer Bhuvneshwar Kumar struck twice in his first two Overs to send both the openers- in form Pathum Nissanka (o off 1) and Kamil Mishara (13 off 12) back in the pavilion. In no time, with the Indian bowlers cutting off the boundaries, Sri Lanka were reduced to 57/4 at the 10-Over mark to find themselves staring at a comprehensive loss with the required run-rate skyrocketing with every passing Over. Bowling all-rounder Charith Asalanka was the lone sparkling light in the batting order, but all his 47-ball 53 could do was delay the time and margin of his team’s loss. India vs Sri Lanka Man of the Match today Earlier, unlike the Sri Lankan innings, the Indian opening batting pair of skipper Rohit Sharma (44 off 32) and Southpaw Ishan Kishan laid the perfect foundation for a massive total, with a blistering 111-run partnership upfront. Ishan Kishan, after a humbling series against West Indies, was back with his usual free-flowing style of batting as he smashed his half-century in mere 30 deliveries. His innings finally ended at the score of 89 off 56 deliveries, but not before he had struck 10 Fours and 3 Sixes to puncture the spirits of the Sri Lankan bowlers. Kishan was ultimately adjudged the ‘Player of the Match’ for his match-winning knock. “I got to learn a lot from the last few matches. My intent wasn’t great but here I tried to keep it simple. I think pull is my favourite shot and I was actually waiting for the ball to play that shot. Bigger boundaries is good thing as we get lots of gaps. My plan was to middle the ball towards midwicket and it went my way”, exclaimed Ishan Kishan post winning the award. A match defining knock of 8⃣9⃣ (56) makes @ishankishan51 tonight’s Player of the Match! We are still drooling over this gem of an innings! #OneFamily #MumbaiIndians #INDvSL @BCCI pic.twitter.com/yhcpieP8t1 — Mumbai Indians (@mipaltan) February 24, 2022 For more Cricket-related news, click here. The post India vs Sri Lanka Man of the Match today: Who was awarded Man of the Match in IND vs SL 1st T20I in Lucknow? appeared first on The SportsRush.","pubDate":"2022-02-24 17:28:43","full_description":"India vs Sri Lanka Man of the Match today: His 111-run partnership alongside Rohit Sharma earned the Southpaw the ‘Man of the match’ award. During the first T20I of the ongoing Sri Lanka’s tour of India in Lucknow , team India registered a thumping 62-run victory against their Asian rivals, to go 1-0 up in the three-match T20I series. Chasing a mammoth score of 199/2 after their skipper Dasun Shanaka opted to field first, Sri Lanka got off to a poor start after India’s experienced pacer Bhuvneshwar Kumar struck twice in his first two Overs to send both the openers- in form Pathum Nissanka (o off 1) and Kamil Mishara (13 off 12) back in the pavilion. In no time, with the Indian bowlers cutting off the boundaries, Sri Lanka were reduced to 57/4 at the 10-Over mark to find themselves staring at a comprehensive loss with the required run-rate skyrocketing with every passing Over. Bowling all-rounder Charith Asalanka was the lone sparkling light in the batting order, but all his 47-ball 53 could do was delay the time and margin of his team’s loss. Earlier, unlike the Sri Lankan innings, the Indian opening batting pair of skipper Rohit Sharma (44 off 32) and Southpaw Ishan Kishan laid the perfect foundation for a massive total, with a blistering 111-run partnership upfront. Ishan Kishan, after a humbling series against West Indies, was back with his usual free-flowing style of batting as he smashed his half-century in mere 30 deliveries. His innings finally ended at the score of 89 off 56 deliveries, but not before he had struck 10 Fours and 3 Sixes to puncture the spirits of the Sri Lankan bowlers. Kishan was ultimately adjudged the ‘Player of the Match’ for his match-winning knock. “I got to learn a lot from the last few matches. My intent wasn’t great but here I tried to keep it simple. I think pull is my favourite shot and I was actually waiting for the ball to play that shot. Bigger boundaries is good thing as we get lots of gaps. My plan was to middle the ball towards midwicket and it went my way”, exclaimed Ishan Kishan post winning the award. A match defining knock of 8⃣9⃣ (56) makes @ishankishan51 tonight’s Player of the Match! 👏 We are still drooling over this gem of an innings! 💙 #OneFamily #MumbaiIndians #INDvSL @BCCI pic.twitter.com/yhcpieP8t1 — Mumbai Indians (@mipaltan) February 24, 2022 For more Cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka 1st T20I: Ishan Kishan, Shreyas Iyer sizzle in India's crushing 62-run win over Sri La - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMirQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9zcmktbGFua2EtaW4taW5kaWEvaW5kaWEtdnMtc3JpLWxhbmthLWlzaGFuLWtpc2hhbnMtODktaGVscHMtaW5kaWEtdGhyYXNoLXNyaS1sYW5rYS1pbi1maXJzdC10MjBpL2FydGljbGVzaG93Lzg5ODA5MTU4LmNtc9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka 1st T20I: Ishan Kishan, Shreyas Iyer sizzle in India's crushing 62-run win over Sri La  Times of IndiaRecent Match Report - India vs Sri Lanka 1st T20I 2021/22  ESPNcricinfoHighlights, India vs Sri Lanka 1st T20I Full Cricket Score: India win by 62 runs, take 1-0 lead  FirstpostLive Blog Cricket Score - India vs Sri Lanka, 1st T20I | Cricbuzz.com - Cricbuzz  CricbuzzMatch Preview - India vs Sri Lanka, Sri Lanka in India 2021/22, 1st T20I  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-02-24 17:18:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SL: All-round India thrash Sri Lankans in 1st T20 to go 1-0 up in series","link":"https://zeenews.india.com/cricket/ind-vs-sl-all-round-india-thrash-sri-lankans-in-1st-t20-to-go-1-0-up-in-series-2439582.html","keywords":null,"creator":null,"video_url":null,"description":"Ishan Kishan and Shreyas Iyer hit fifties before a combined bowling performance helped India thrash Sri Lanka in the first T20I here at the Atal Bihari Vajpayee Ekana Cricket Stadium here on Thursday.","content":null,"pubDate":"2022-02-24 17:14:00","full_description":"Lucknow: Ishan Kishan and Shreyas Iyer hit fifties before a combined bowling performance helped India thrash Sri Lanka in the first T20I here at the Atal Bihari Vajpayee Ekana Cricket Stadium here on Thursday. With this 62-run win over Sri Lanka, India took a 1-0 lead in the three-match T20I series. Both teams will now lock horns in the second T20I on Saturday.Chasing 200, Sri Lanka got off to the worst possible start as the side two wickets inside three overs. Bhuvneshwar removed both openers Pathum Nissanka and Kamil Mishara as Sri Lanka struggled in the chase. Sri Lanka reached the 50-run mark in the tenth over but lost two more wickets. Charith Asalanka did hit a fifty for the visitors but the asking rate was too much to ask for as Sri Lanka lost momentum.Sri Lanka needed 102 runs in the last four overs and the visitors were completely outplayed in the first T20I as they lost the match by a considerable margin. That's that from the 1st T20I. #TeamIndia win by 62 runs and go 1-0 up in the three-match series. Scorecard - https://t.co/RpSRuIlfLe #INDvSL @Paytm pic.twitter.com/S2EoR9yesm — BCCI (@BCCI) February 24, 2022 Earlier, put in to bat first, India got off to a firing start as Ishan`s flurry of boundaries helped the hosts reach 47 in the five overs.It was a solid start from India as Rohit Sharma and Ishan scored 58 in the powerplay. The duo continued firing before Lahiru Kumara removed Rohit in the 12th over as India reached 111/1.Meanwhile, Ishan continued slogging and took India`s score over the 150-run mark, however, Shanaka dismissed him in the 17th over.In the end, Shreyas and Ravindra Jadeja stitched an unbeaten 44-run stand to help India post a mammoth total of 199/2.","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"MCA to felicitate Rohit Sharma for becoming all-format India skipper","link":"https://www.indiatvnews.com/sports/cricket/mca-to-felicitate-rohit-sharma-for-becoming-all-format-india-skipper-2022-02-24-761422","keywords":null,"creator":null,"video_url":null,"description":"The Mumbai Cricket Association (MCA) will felicitate Rohit Sharma for becoming Indian cricket team captain in all the three formats of the game.","content":null,"pubDate":"2022-02-24 17:04:10","full_description":"The Mumbai Cricket Association (MCA) will felicitate for becoming Indian cricket team captain in all the three formats of the game. After the T20I and ODI captaincy, Rohit, a Mumbaikar, was appointed Test captain by the Chetan Sharma-led selection panel ahead of the series against Sri Lanka. The decision to felicitate Rohit was taken during the MCA Apex Council meeting held here on Thursday. \"In today’s Apex Council Meeting decision passed Rohit Sharma will be felicitated for becoming captain of all three formats,\" a MCA Apex Council member told PTI. \"Angkrish Raghuvanshi will be felicitated by MCA with a cash prize of Rs one lakh and momento,\" the member added. According to the MCA functionary, India players including Suryakumar Yadav, all-rounder Shardul Thakur, opener and middle order batter Shreyas Iyer will also be felicitated. He also said that young batter Sarfaraz Khan, who is among runs in red-ball cricket, will also be felicitated for representing India A and that the function will be held before the Indian Premier League begins.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Ishan Kishan, Shreyas Iyer And Bowlers Star As India Thrash Sri Lanka In 1st T20I - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiiAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1zcmktbGFua2EtMjAyMi9pc2hhbi1raXNoYW4tc2hyZXlhcy1peWVyLWFuZC1ib3dsZXJzLXN0YXItYXMtaW5kaWEtdGhyYXNoLXNyaS1sYW5rYS1pbi0xc3QtdDIwaS0yNzg3ODk00gGOAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2luZGlhLXZzLXNyaS1sYW5rYS0yMDIyL2lzaGFuLWtpc2hhbi1zaHJleWFzLWl5ZXItYW5kLWJvd2xlcnMtc3Rhci1hcy1pbmRpYS10aHJhc2gtc3JpLWxhbmthLWluLTFzdC10MjBpLTI3ODc4OTQvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ishan Kishan, Shreyas Iyer And Bowlers Star As India Thrash Sri Lanka In 1st T20I  NDTVSports.comRecent Match Report - India vs Sri Lanka 1st T20I 2021/22  ESPNcricinfoIndia vs Sri Lanka 1st T20I Highlights, Score Updates: India crush Sri Lanka by 62 runs to take 1-0 series lead  Times of IndiaHighlights, India vs Sri Lanka 1st T20I Full Cricket Score: India win by 62 runs, take 1-0 lead  FirstpostMatch Preview - India vs Sri Lanka, Sri Lanka in India 2021/22, 1st T20I  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-02-24 17:02:35","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Live Score Ball by Ball, India vs Sri Lanka 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-sri-lanka-live-score-over-1st-t20i-t20-16-20-updates-2787827","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Sri Lanka from Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-24 16:29:51","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Sri Lanka, chasing a target of 200, are 137/6. The live updates of India vs Sri Lanka scorecard is also available. It is the perfect platform to follow your favourite teams in India vs Sri Lanka 2022. Keep a track on your favourite batsmen and bowlers through India vs Sri Lanka 2022 today match, ball by ball commentary, India vs Sri Lanka, India vs Sri Lanka live score, India vs Sri Lanka scorecard. Follow the excitement of the India vs Sri Lanka 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 19.6 overs (2 Runs) 2 runs. 19.5 overs (1 Run) A low full toss on off. Charith Asalanka plays it left of the bowler. Patel half-stops it as a single is taken towards long on. 19.4 overs (0 Run) A yorker this time outside off. Charith Asalanka skips down the track and looks to hit it away but misses. 19.3 overs (1 Run) Another length delivery outside off. Dushmantha Chameera slams it to long on for a single. 19.2 overs (1 Run) A slower length delivery around leg. Charith Asalanka works it towards short fine leg for a single. 19.1 overs (1 Run) A length delivery on off. Dushmantha Chameera heaves it to deep mid-wicket for a single. 18.6 overs (1 Run) A yorker on off. Dushmantha Chameera digs it out towards long off for a single. 18.5 overs (1 Run) A fuller delivery on middle. Chamika Karunaratne works it to deep mid-wicket for a single. 18.4 overs (2 Runs) A fuller delivery on middle. Charith Asalanka works it to deep mid-wicket for a couple. Fifty for Charith Asalanka. He has been a lone wolf today. Dushmantha Chameera was struggling at the bowler's end as they went for the second run but Bumrah fails to collect the throw cleanly. 18.3 overs (0 Run) Nails a yorker this time outside off. Charith Asalanka looks to dig it out but misses. 18.2 overs (1 Run) A length delivery on off. Dushmantha Chameera pulls it to deep square leg for a single. 18.1 overs (1 Run) A low full toss outside off. Charith Asalanka drills it to long off for a single. 17.6 overs (4 Runs) FOUR! 21 runs from the over! Almost a yorker this time around off. Dushmantha Chameera gets deep in his crease and steers it towards third man for a boundary. Good over for Lanka but too late now. 75 needed from 12 balls! 17.5 overs (4 Runs) FOUR! Another boundary, so Venkatesh Iyer is going for some runs in his third over! A low full toss around leg. Dushmantha Chameera flicks it towards backward square leg for a boundary. 17.5 overs (1 Run) WIDE! Full and a bit too wide outside off. Dushmantha Chameera lets it go. 17.4 overs (6 Runs) SIX! This time a biggie from Dushmantha Chameera! A slower length ball, on off. Dushmantha Chameera gets low and slog-sweeeps it over deep mid-wicket for a biggie. 17.3 overs (1 Run) Shorter and outside off. Charith Asalanka cuts it to sweeper cover for a single. 17.2 overs (4 Runs) FOUR! Charith Asalanka is playing some classy shots, every now and then! A fuller delivery outside off. Charith Asalanka lifts this towards deep extra-cover for a boundary. 17.1 overs (1 Run) Iyer serves this on a length and slower in pace around off. Dushmantha Chameera steers it to short third man for a single. 16.6 overs (1 Run) A single to end as this is worked through mid-wicket. 16.5 overs (0 Run) On middle, defended. 16.4 overs (1 Run) Shorter and on the body, this is pulled through mid-wicket for one. 16.3 overs (2 Runs) Two more! The sweep is out, it is hit through mid-wicket for two. 16.2 overs (1 Run) A single as this is worked through mid-wicket. 16.1 overs (0 Run) On off, blocked 16.1 overs (1 Run) WIDE! That spins big! Lands outside off and turns back in. It ends up going down the leg side. Wided. 15.6 overs (0 Run) Outside off, on a length. Charith looks to push at it but misses. 15.5 overs (1 Run) Outside off. This is cut over point for one. Dushmantha Chameera is the next man in. 15.4 overs (0 Run) OUT! CAUGHT BEHIND! So after playing few good shots, Chamika Karunaratne has to walk back. A length delivery wide outside off. Chamika Karunaratne goes chasing for it but gets an outside edge. The ball goes to the keeper and Ishan Kishan takes an easy catch. So the match is almost gone for Lanka now and it is the matter of if they can play out 20 overs. 15.3 overs (6 Runs) SIX! Bang? That goes all the way! Chamika comes down the track and gets to the pitch of it. He whips it over mid-wicket for a biggie. 15.2 overs (1 Run) Shorter and on the body, Asalanka pulls, it goes off the glove but lands of short of short fine leg. One taken. 15.1 overs (0 Run) Outside off, Asalanka looks to go over it, he gets an underedge back to the bowler.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637813367807035665.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Live Score Ball by Ball, India vs Sri Lanka 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-sri-lanka-live-score-over-1st-t20i-t20-11-15-updates-2787761","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Sri Lanka from Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-24 16:27:51","full_description":"Follow the India vs Sri Lanka 2022 live cricket score on Sports.NDTV.com . After 15.2 overs, Sri Lanka, chasing a target of 200, are 91/5. Get live score, ball by ball commentary and much more. Keep track of India vs Sri Lanka 2022 today match between India and Sri Lanka. Everything related to India and Sri Lanka match will be available on Sports.NDTV.com . Stay updated with India vs Sri Lanka live score. Do check for India vs Sri Lanka scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (2 Runs) Two more! On middle, this is worked through mid-wicket for two. 14.5 overs (1 Run) Shorter and on off, this is slapped down to long off for one. 14.4 overs (4 Runs) FOUR! Up and over! Lovely shot. Tossed up on off, Asalanka lifts it over covers for a boundary. 14.3 overs (1 Run) On middle, this is worked through mid-widket for one. 14.2 overs (6 Runs) SIX! He has hit that beautifully! Lanka need a it to rain boundaries if they are to get close to the Indian total. On middle, fuller, this is lofted over the long on fence for a biggie. 14.1 overs (0 Run) On middle, this is pushed back to the bowler. 13.6 overs (1 Run) A single to end! On middle, this is hit down to long on for one. 13.5 overs (1 Run) A single to follow the boundary as this is worked towards mid-wicket. 13.4 overs (4 Runs) FOUR! That is hit pretty well! This is on middle and the reverse sweep comes out. Samson at deep point runs to his right and dives but it goes well away from him. 13.3 overs (2 Runs) Two more then! On the pads, this is worked with soft hands on the leg side for two. 13.2 overs (1 Run) On off, this is pushed through covers for one. 13.1 overs (0 Run) Flattee and on middle, defended. 12.6 overs (0 Run) That one stays low! Outside off, Charith looks to sweep. This one does not bounce a lot and sneaks under the bat. 12.5 overs (0 Run) Flatter and on off, this is one stays a touch low. Asalanka manages to push it to cover. 12.4 overs (1 Run) Flatter and on middle, this is pushed down to long on for one. 12.3 overs (2 Runs) Two! On middle, this is worked through mid-wicket, it is in the gap, two taken. 12.2 overs (1 Run) Outside off, this is slapped through covers for one. 12.1 overs (0 Run) Shorter and outside off, Asalanka looks to cut but gets an underedge on the off side. 11.6 overs (0 Run) A slightly shorter length delivery on off. Chamika Karunaratne pushes it back to the bowler. 11.5 overs (1 Run) NOT OUT! A fuller delivery on leg. Charith Asalanka looks to sweep but gets the inside edge onto his pads and the ball rolls towards short fine leg. Rohit Sharma there charges in and fires a direct hit at the batter's end. Chamika Karunaratne who is running at the danger end as they try to steal a single. The umpire refers it upstairs and the replays show that he has just made it. So a single in the end. Is this a run out? The replays roll in and it looks quite tight. Chamika Karunaratne survives as the replays find him just inside the crease. 11.4 overs (0 Run) A quicker delivery on middle. Charith Asalanka blocks it out. 11.3 overs (1 Run) A flatter delivery on middle. Chamika Karunaratne works it towards short fine leg and takes a single. 11.2 overs (1 Run) Shorter and outside off. Charith Asalanka cuts it to sweeper cover for a single. 11.1 overs (0 Run) A flatter delivery on off. Charith Asalanka pushes it to covers. 10.6 overs (0 Run) A fuller delivery on off. Chamika Karunaratne drives it to mid off now. 10.5 overs (0 Run) OUT! CAUGHT! The Sri Lankan skipper departs now! Sri Lanka have completely lost their way here. A fuller delivery on middle. Dasun Shanaka goes for the reverse-sweep again. This time he connects but hits it straigtht to Bhuvneshwar Kumar at point. He takes an easy catch and half of the side is back to the hut now. Chamika Karunaratne is the next man in. 10.4 overs (2 Runs) A fuller delivery on middle. Dasun Shanaka sweeps it to deep square leg for a couple. 10.3 overs (0 Run) A fuller delivery on off. Pushed towards covers. 10.2 overs (0 Run) A fuller delivery around leg. Dasun Shanaka looks to reverse sweep it but gets hit on the body. 10.1 overs (1 Run) Googly outside off this time. Charith Asalanka pushes it to long off for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637813366609477810.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Live Score Ball by Ball, India vs Sri Lanka 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-sri-lanka-live-score-over-1st-t20i-t20-6-10-updates-2787689","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Sri Lanka from Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-24 16:05:48","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.4 overs, Sri Lanka, chasing a target of 200, are 60/4. The live updates of India vs Sri Lanka scorecard is also available. It is the perfect platform to follow your favourite teams in India vs Sri Lanka 2022. Keep a track on your favourite batsmen and bowlers through India vs Sri Lanka 2022 today match, ball by ball commentary, India vs Sri Lanka, India vs Sri Lanka live score, India vs Sri Lanka scorecard. Follow the excitement of the India vs Sri Lanka 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (0 Run) No run. 9.5 overs (1 Run) A fuller delivery on middle. Charith Asalanka pushes it to long on for a single. 9.4 overs (4 Runs) FOUR! Nicely played this time! A flatter delivery on off. Charith Asalanka waits for it and late-cuts it towards the third man region for a boundary. 9.3 overs (1 Run) A slower delivery that is pused hard on length by Jadeja. Shanaka tries to work it towards the leg side but gets a leading edge and the ball goes in the air but just away from Jadeja. A single taken. Dasun Shanaka is the next man in. 9.2 overs (0 Run) OUT! STUMPED! Another one bites the dust and this time Ravindra Jadeja foxes the batter and Dinesh Chandimal has to walk back. Dinesh Chandimal skips down the track a tad early there and Jadeja pulls his length back and bowls this on middle. Dinesh Chandimal tries to work it towards the leg side but the ball turns away and beats him. Kishan collects the ball,behind the stumps and whips the bails off in the flash as Dinesh Chandimal is out of his crease. 9.1 overs (1 Run) A shorter delivery on off. Charith Asalanka pulls it to deep mid-wicket for a single. 8.6 overs (1 Run) Shorter and outside off. Charith Asalanka cuts it to sweeper cover for a single. 8.5 overs (1 Run) A fuller delivery on middle. Dinesh Chandimal knocks it down to long on for a single. 8.4 overs (1 Run) A flighted delivery on middle. Charith Asalanka defends this off the inside half of his blade to backward square leg for a single. 8.3 overs (1 Run) A flatter delivery on off. Pushed towards covers for a single. 8.2 overs (0 Run) Tossed up delivery on middle. Dinesh Chandimal works it towards the leg side. 8.1 overs (1 Run) A shorter delivery outside off. Charith Asalanka cuts it to sweeper cover for a single. 7.6 overs (0 Run) A fuller delivery around off. Dinesh Chandimal looks to drive it away but misses. 155 needed now from 72 balls! 7.5 overs (0 Run) A flatter delivery on off. Dinesh Chandimal blocks it out. 7.4 overs (6 Runs) SIX! This is a good shot and much-needed one for Lanka! A tossed up delivery on middle. Dinesh Chandimal gets low and slog-sweeps it over deep mid-wicket for a biggie. 7.3 overs (2 Runs) Slightly shorter in length, on middle. Dinesh Chandimal works it to deep backward square leg for a couple. 7.2 overs (0 Run) A flatter delivery on off. Dinesh Chandimal blocks it out. 7.1 overs (1 Run) A flatter delivery around leg. Charith Asalanka works it to mid-wicket for a single. Dinesh Chandimal is the next man in. 6.6 overs (0 Run) OUT! CAUGHT! Venkatesh Iyer gets the wicket now and Sri Lanka sink further! A slower short ball, outside off. Janith Liyanage strangely tries to pull it from way outside off and ends up getting a top edge. The ball loops up in the air towards backward point and Samson there takes an easy catch. 6.5 overs (2 Runs) Short and wide outside off. Janith Liyanage cuts it to deep point for a couple. 6.4 overs (1 Run) Short and wide outside off. Charith Asalanka cuts it to sweeper cover for a single. 6.3 overs (2 Runs) Back of a length, around off. Charith Asalanka punches this off the backfoot to deep cover for a couple. 6.2 overs (1 Run) Shorter length and around off. Janith Liyanage steers it to third man for a single. 6.1 overs (1 Run) Back of a length, around off. Charith Asalanka dabs it to backward point for a single. 5.6 overs (0 Run) A fuller delivery on leg. Janith Liyanage works it to mid-wicket. 5.5 overs (1 Run) A fuller delivery on off. Charith Asalanka pushes it to backward point for a single. 5.4 overs (0 Run) NOT OUT! Charith Asalanka survives again! This time a good review by him! A tossed up delivery on middle. Charith Asalanka looks to sweep but gets the thin part of his blade onto his pads. There is an huge appeal for LBW and the umpire raises his finger. However, Charith Asalanka reviews it and the replays show a spike off the UltraEdge. So he survives. 5.3 overs (1 Run) A fuller delivery on middle. Janith Liyanage pushes it to long on for a single. 5.2 overs (1 Run) This time Shreyas Iyer drops it! A tossed up delivery on middle. Charith Asalanka slog-sweeps it towards deep square leg but is goes straight to Shreyas Iyer there. He fails to pouch it and this is poor effort by Shreyas Iyer. A single taken. 5.1 overs (0 Run) A fuller delivery down the leg side. Charith Asalanka sweeps it to backward square leg.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637813353382244773.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka: India vs Sri Lanka 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-sri-lanka-live-score-over-1st-t20i-t20-1-5-updates-2787636","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Sri Lanka from Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-24 15:35:41","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.2 overs, Sri Lanka, chasing a target of 200, are 27/2. The live updates of India vs Sri Lanka scorecard is also available. It is the perfect platform to follow your favourite teams in India vs Sri Lanka 2022. Keep a track on your favourite batsmen and bowlers through India vs Sri Lanka 2022 today match, ball by ball commentary, India vs Sri Lanka, India vs Sri Lanka live score, India vs Sri Lanka scorecard. Follow the excitement of the India vs Sri Lanka 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (2 Runs) 2 runs. 4.5 overs (0 Run) A fuller delivery outside off. Janith Liyanage drives it to cover-point this time. 4.4 overs (1 Run) A slower length delivery around leg. Charith Asalanka works it fine towards short fine leg for a single. 4.3 overs (0 Run) On a length, on middle. Charith Asalanka works it to mid-wicket now. 4.2 overs (1 Run) On a length, around off. Janith Liyanage pushes it to covers for a single. 4.1 overs (0 Run) A length delivery around off. Janith Liyanage skips down the track and looks to heave this across the line but misses. 3.6 overs (4 Runs) FOUR! Nicely played this one! Shorter and outside off. Charith Asalanka waits for it and just upper cuts it over short third man for a boundary. 3.5 overs (0 Run) This is slower and outside off. Charith Asalanka looks to work it towards the off side but misses. 3.4 overs (1 Run) A length delivery around off. Janith Liyanage steers it to third man for a single. 3.3 overs (0 Run) A length delivery on off. Janith Liyanage blocks this off the front foot. 3.2 overs (1 Run) A yorker on middle this time. Charith Asalanka digs it out behind square on the leg side for a single. 3.1 overs (1 Run) A length delivery around off. Janith Liyanage steers it to third man for a single. Charith Asalanka is the next man in. 2.6 overs (0 Run) OUT! CAUGHT! This time he is gone and Rohit Sharma makes no mistake! A length delivery on off. Kamil Mishara heaves this one hard but straight to Rohit Sharma at mid-wicket. He takes a good catch and second wicket for Bhuvneshwar Kumar now. 2.5 overs (0 Run) A full toss on off. Kamil Mishara drives it to covers now. 2.4 overs (2 Runs) Dropped by Venkatesh Iyer! A length delivery around off. Kamil Mishara looks to hit it across the line but gets a huge top edge. The ball goes in the air towards point and Venkatesh Iyer there settles under it but fails to pouch it. Two runs taken. 2.3 overs (0 Run) A length delivery on off. Kamil Mishara looks to heave it but gets the inside edge onto the pads. 2.2 overs (1 Run) A length delivery around off. Janith Liyanage steers it to third man for a single. 2.1 overs (0 Run) A good-length delivery around off. This one seams away again. Janith Liyanage looks to push at it but gets beaten off the outside edge. Good bounce there too. 1.6 overs (2 Runs) Two more! Shorter and on middle, this is pulled through mid-wicket for two. 1.5 overs (0 Run) Swing and a miss! Outside off, Mishara slashes but misses. 1.4 overs (0 Run) A yorker outside off. Mishara fails to jam it out. 1.3 overs (0 Run) Shorter and angling away. Mishara looks to defend but is beaten. 1.2 overs (4 Runs) FOUR! Lovely timing! Length and on off, this is driven on the up through covers and for a boundary. 1.1 overs (0 Run) On middle, this is worked to mid-wicket. Jasprit Bumrah will share the new ball with Bhuvneshwar Kumar. 0.6 over (0 Run) Beaten! Length and on off, this lands and moves away. Janith is beaten as he tries to defend. 0.5 over (0 Run) Another one on a length and on off, blocked. 0.4 over (1 Run) A quick run! On off, this is played on the off side for one. 0.3 over (4 Runs) FOUR! Up and over! Outside off, fuller, this is lofted over point for a boundary. 0.2 over (1 Run) On off, this is pushed to covers for one. Janith Liyanage walks in at number 3. 0.1 over (0 Run) OUT! TIMBER! That is the worst possible start for Lanka chasing such a big total. Their best player against Australia walks back for a first-baller. Unfortunate for Nissanka though. This is on a length and around off, this lands and then stays low. Nissanka looks to defend, it hits the bottom edge and then rolls behind onto the stump. Kumar has been really good since the last series and has began this well too.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637813335308192126.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka 1st T20I LIVE Score: Ishan Kishan, Shreyas Iyer take India to 199/2 - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmRpYS12cy1zcmktbGFua2EtaW5kLXZzLXNsLTFzdC10MjAtMjAyMi1saXZlLXNjb3JlLXVwZGF0ZXMtNzc4OTI3My_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka 1st T20I LIVE Score: Ishan Kishan, Shreyas Iyer take India to 199/2  The Indian ExpressIndia vs Sri Lanka 2022: India's Predicted Playing XI For First T20I  Cricket AddictorMatch Preview - India vs Sri Lanka, Sri Lanka in India 2021/22, 1st T20I  ESPNcricinfoIndia vs Sri Lanka 1st T20I Live Score Updates: Ishan Kishan, Shreyas Iyer power India to 199/2  Times of IndiaIndia vs Sri Lanka 1st T20 Live Score: Ishan Kishan, Shreyas Iyer dictate show, India pile 199/2 in 20 overs  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-02-24 15:12:33","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Live Score Ball by Ball, India vs Sri Lanka 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-sri-lanka-live-score-over-1st-t20i-t20-16-20-updates-2787550","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Sri Lanka from Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-24 15:05:38","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, India are 199/2. The live updates of India vs Sri Lanka scorecard is also available. It is the perfect platform to follow your favourite teams in India vs Sri Lanka 2022. Keep a track on your favourite batsmen and bowlers through India vs Sri Lanka 2022 today match, ball by ball commentary, India vs Sri Lanka, India vs Sri Lanka live score, India vs Sri Lanka scorecard. Follow the excitement of the India vs Sri Lanka 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. ...THE RUN CHASE… Sri Lanka, after electing to bowl, will be disappointed. They did not begin well and leaked runs in the Powerplay. They did manage to pull things back in the middle overs courtesy Lahiru Kumara, Jeffrey Vandersay and Shanaka but all the good work was given away as the death bowling was not at all good. In the end, they now face a stiff task ahead and will have to bat out of their skins if they are to chase this down. They need good start to get anywhere close to this target. Stay tuned as for an entertaining second-half of this game. It all began with the openers who put up a 100-run stand. Kishan was the aggressor and Rohit played second fiddle. Once Rohit fell, there was a quiet period for India where Kishan and Iyer were finding it difficult to maintain the same tempo. Kishan fell 12 short of his ton trying to up the ante but then Iyer exploded. He found the boundaries at ease and gave India a solid finish to get them close to 200. What a performance with the bat by India. Scoring 199 on this big ground on a wicket which hasn't looked the easiest, is a tremendous effort. They will be very pleased with their outing. 19.6 overs (1 Run) So a single to end the innings! A low full toss outside off. Jadeja pulls this hard but it goes towards long on for a single. This has been a superb batting performance by India. India finish with 199/2 after 20 overs! 19.5 overs (1 Run) Just a single this time! A fuller delivery on middle. Iyer flicks it to deep mid-wicket for a single. 19.4 overs (2 Runs) A fuller delivery outside off. Iyer drills it to deep extra-cover for a couple. 19.3 overs (4 Runs) FOUR! Another boundary, fine leg is inside the circle and Dushmantha Chameera bowls this on leg. Iyer just flicks it past short fine leg for a boundary. 19.2 overs (2 Runs) Fifty for Iyer! He has paced this innings superbly! A fuller delivery on middle. Iyer flicks it to deep square leg for a couple. 19.1 overs (6 Runs) SIX! Another monstorous hit! A slower length delivery around off, in the slot. Iyer tonks it over long on for a biggie. 18.6 overs (1 Run) A full delivery on off. Iyer drills it to long off for a single. 18.5 overs (4 Runs) FOUR! Nice shot again by Iyer! A full delivery and wider outside off. Iyer opens the face of his blade and gets this in the gap through the third man region for a boundary. 18.4 overs (1 Run) A shorter length delivery on off now. Jadeja pulls it to deep square leg for a single. 18.3 overs (1 Run) A full delivery on off. Iyer drills it to long off for a single. 18.3 overs (1 Run) WIDE! A full delivery and way outside off. Iyer leaves it alone. 18.2 overs (4 Runs) FOUR! Poor bowling this! A low full toss outside off. Iyer just slices it to deep backward point for a boundary. 18.1 overs (6 Runs) SIX! BANG! Iyer is in his groove now! A length delivery on off. Iyer gets under it and launches it over long on for a biggie. 17.6 overs (0 Run) A fuller delivery outside off. Jadeja goes for the sccop as he gets across but misses. 17.5 overs (1 Run) A fuller delivery on off. Iyer pushes it to long off for a single. 17.4 overs (2 Runs) DROPPED!! A fuller delivery on off. Iyer looks to work it towards the leg side but gets a huge leadinng edge towards deep extra-cover. The fielder runs back from the ring to catch it and gets a hand on it but fails to pouch it. Two runs taken. 17.3 overs (4 Runs) FOUR! A short ball and punished. Chameera goes short on off. Iyer pulls it to deep square leg for a boundary. Good shot. 17.2 overs (2 Runs) A length delivery around off. Iyer dabs it to backward point and sets off for a single. There is a shy at the bowler's end but there is no one backing up and the batters take an extra run off an overthrow. 17.1 overs (1 Run) A fuller delivery outside off. Jadeja drills it to deep cover for a single. Ravindra Jadeja is the next man in. 16.6 overs (0 Run) OUT! TAKEN! Ishan Kishan misses out on the hundred but it has been a brilliant knck by the youngster! Shanaka bangs this short on middle. Kishan looks to pull but gets a huge top edge this time. The ball goes high in the air towards deep square leg and Janith Liyanage there takes a good catch. So the Sri Lankan skipper provides the breakthrough. 16.5 overs (1 Run) A fuller delivery on off. Iyer mistimes his slog to long on for a single. 16.4 overs (4 Runs) FOUR! Ohh..great shot and great understanding of the field there by Iyer! A fuller delivery on off. Iyer gets across and flicks it to deep square leg for a boundary. 16.3 overs (0 Run) Another good delivery ! A very full delivery, wide outside off. Iyer goes chasing for it but misses. 16.2 overs (1 Run) Shorter length delivery on off. Kishan pulls it to deep mid-wicket for a single. 16.2 overs (1 Run) WIDE! A slower short ball and a bit too high this. Kishan leaves it alone. 16.1 overs (1 Run) A brilliant yorker outside off. Iyer digs it out to short third man for a single. Dasun Shanaka is back on. He went for 11 runs in his first over. 15.6 overs (1 Run) A Slower short delivery on off. Iyer pulls it to long on and gets a single. 17 runs from the over. 15.5 overs (1 Run) A wide yorker this time, outside off. Kishan digs it out to sweeper cover for a single. 15.4 overs (4 Runs) FOUR! Oh...this is fabulous batting from Kishan! A low full toss outside off. Kishan gets across and sweeps it to deep mid-wicket for another boundary. 15.3 overs (4 Runs) FOUR! A boundary again! A wide fullis delivery outside off over 140 clicks! Kishan just guides this past short third man for a boundary. 15.2 overs (6 Runs) SIX! This time he connects it quite well and gets the maximum! A slower full ball, on middle. Kishyan gets under it and tonks it over long on for a maximum. 15.1 overs (1 Run) Iyer backs away and Kumara follows him. Serves this on his leg. Iyer flicks it to deep square leg for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637813317282603881.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IND VS SL: Rohit-Dravid are taking India in a fabulous direction, says Dinesh Karthik","link":"https://www.thehansindia.com/sports/cricket/ind-vs-sl-rohit-dravid-are-taking-india-in-a-fabulous-direction-says-dinesh-karthik-730727","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Dinesh Karthik has hailed Rohit-Dravid’s managementEarlier this month, India defeated WI 3-0 in T20IsAs a result, India climbed to No. 1 place in the T20I rankings","content":"Rohit-Dravid are taking India in a fabulous direction, says Dinesh KarthikRohit-Dravid are taking India in a fabulous direction, says Dinesh KarthikIndia's new captain Rohit Sharma and head coach Rahul Dravid are taking the team \"in a fabulous direction\", according to Dinesh Karthik. Rohit, who was appointed India's new limited-overs skipper after Virat Kohli stepped down as the T20I captain and was sacked as the ODI captain, was recently named India's Test captain as well. The Mumbaikar is set to lead India in the two-match Test series against Sri Lanka next month. The three-match T20I series is currently underway. Under Rohit's captaincy, Team India recently clean swept West Indies 6-0 in the white-ball series, including three ODIs and as many T20Is. \"What I enjoyed most was Rohit's captaincy. I thought he led the team beautifully. Tactically very, very sound, and I thoroughly enjoyed the way the team played in the last couple of series against West Indies,\" Karthik said on 'The ICC Review'. 𝗡𝗘𝗫𝗧 𝗨𝗣 ➡️ 🇱🇰 pic.twitter.com/LLtviy3wxE— Rohit Sharma (@ImRo45) February 22, 2022 The wicketkeeper-batsman went on to hail the duo of Rohit and Dravid for taking India to the No. 1 rank in the latest ICC T20I rankings. Following India's 3-0 victory over West Indies, the Men in Blue edged past England to the top rank in the shortest format. \"The new captain and there's a new coach, I think they are taking the team in a fabulous direction. They've plugged small holes, which were probably there previously, and that has been the beautiful part about it. And along the way, in the journey, they've managed to become No.1. Who doesn't want to be world No.1 even if it is for some period of time? Because other teams will play matches and then India plays more matches post the IPL so that could change. But for the moment, knowing that Team India is the No.1 T20 team in the world is I think a very, very good feeling,\" the TN batsman added further. The last time Karthik played for India was back in 2019. India's semi-final loss to New Zealand in Manchester during the Cricket World Cup was Karthik's last appearance in the ODIs. Earlier that year when India hosted Australia in a T20I series, the match in Bengaluru was his last T20I game.","pubDate":"2022-02-24 15:03:14","full_description":"Rohit-Dravid are taking India in a fabulous direction, says Dinesh Karthik India's new captain Rohit Sharma and head coach Rahul Dravid are taking the team \"in a fabulous direction\", according to Dinesh Karthik. Rohit, who was appointed India's new limited-overs skipper after Virat Kohli stepped down as the T20I captain and was sacked as the ODI captain, was recently named India's Test captain as well. The Mumbaikar is set to lead India in the two-match Test series against Sri Lanka next month. The three-match T20I series is currently underway. Under Rohit's captaincy, Team India recently clean swept West Indies 6-0 in the white-ball series, including three ODIs and as many T20Is. \"What I enjoyed most was Rohit's captaincy. I thought he led the team beautifully. Tactically very, very sound, and I thoroughly enjoyed the way the team played in the last couple of series against West Indies,\" Karthik said on 'The ICC Review'. 𝗡𝗘𝗫𝗧 𝗨𝗣 ➡️ 🇱🇰 pic.twitter.com/LLtviy3wxE The wicketkeeper-batsman went on to hail the duo of Rohit and Dravid for taking India to the No. 1 rank in the latest ICC T20I rankings. Following India's 3-0 victory over West Indies, the Men in Blue edged past England to the top rank in the shortest format. \"The new captain and there's a new coach, I think they are taking the team in a fabulous direction. They've plugged small holes, which were probably there previously, and that has been the beautiful part about it. And along the way, in the journey, they've managed to become No.1. Who doesn't want to be world No.1 even if it is for some period of time? Because other teams will play matches and then India plays more matches post the IPL so that could change. But for the moment, knowing that Team India is the No.1 T20 team in the world is I think a very, very good feeling,\" the TN batsman added further. The last time Karthik played for India was back in 2019. India's semi-final loss to New Zealand in Manchester during the Cricket World Cup was Karthik's last appearance in the ODIs. Earlier that year when India hosted Australia in a T20I series, the match in Bengaluru was his last T20I game.","image_url":"https://assets.thehansindia.com/h-upload/2022/02/24/500x300_1278589-dinesh-karthik.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Women#39;s Cricket World Cup | Teams allowed to play with 9 members only if squad is affected by COVID-19","link":"https://www.moneycontrol.com/news/sports/women39s-cricket-world-cup-|-teams-allowed-to-play9-members-only-if-squad-is-affected-by-covid-19_16145201.html","keywords":null,"creator":null,"video_url":null,"description":"The Women#39;s World Cup will be played from March 4-April 3 in New Zealand. The organization has taken other measures as well to ensure the tournament can continue as normally as possible.","content":null,"pubDate":"2022-02-24 14:31:48","full_description":"Teams at this year's ICC Women’s Cricket World Cup 2022 (WCWC) will be allowed to play with as less as 9 members if their squad is affected by the COVID-19, the International Cricket Council (ICC) announced on February 24. \"If it becomes necessary, we would allow a team to field nine players as an exception for this environment and if they had female substitutes from within their management team, we would enable two substitutes to play, non-batting, non-bowling, but to enable a game to take place\", said ICC Head of Events Chris Tetley at a media interaction in Christchurch. The Women's World Cup will be played between March 4 and April 3 in New Zealand. The organization has taken other measures as well to ensure the tournament can continue as normally as possible. Teams are allowed to bring additional travelling reserves so that players can be replaced on a temporary basis if the need arises due to any player contracting COVID-19. \"We'll be as flexible as possible if the need arises to ultimately fulfill our objective which is to get the games on, get a credible World Cup played and a world champion at the end of it all\", Tetley said. Tetley also mentioned that this season would see unlimited super overs to decided tied matches. With regards to fans attending the matches, as New Zealand is currently under red restrictions, WCWC CEO Andrea Nelson said that they are operating in pods of 100 and taking it week-by-week, with the ticketing system. \"Unfortunately, at some venues, we will have to cancel existing ticket holders and obviously, that's not something we want to do and we're working really hard to see how many people we can get into the stadium and maximise interest in the World Cup\", said Nelson Strict measures like isolating before interacting with any team have also been put in place to avoid the spread of the virus.","image_url":null,"source_id":"moneycontrol","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: Goa in driver's seat against Mumbai after Lakshay, Amit show","link":"https://sportstar.thehindu.com/cricket/domestic/ranji-trophy-2021-22-lakshay-garg-amit-yadav-goa-vs-mumbai-ajinkya-rahane-domestic-cricket/article38437753.ece","keywords":null,"creator":["Amol Karhadkar"],"video_url":null,"description":"Goa had one of the most memorable days in its cricket history, having put powerhouse Mumbai under pressure on the opening day of its league game.","content":null,"pubDate":"2022-02-24 14:26:59","full_description":"Riding on heroics by Lakshay Garg (6/46) and Amit Yadav (4/47), Goa had one of the most memorable days in its cricket history, having put powerhouse Mumbai under pressure on the opening day of its league game. Thanks to the right-arm pacer Garg and experienced offspinner Yadav’s heroics, Mumbai was bundled out for 163 after electing to bat at the Narendra Modi Stadium main ground. Opener Amogh Desai’s unbeaten fifty (51*, 106b, 7x4) then ensured that Goa sailed within touching distance of Mumbai’s total, ending the day at 114 for two. While Yadav played a perfect support cast to an on-song Garg, Mumbai couldn’t withstand the accurate bowling attack. No doubt the 41-times champion will feel hard done by with a couple of iffy umpiring decisions, including that of Ajinkya Rahane. Still, the fact that five Mumbai batters were dismissed for a duck is a testimony to their lack of application and Goa’s accurate bowling. Barring Sarfaraz Khan (63, 110b, 9x4), who was livid with himself after perishing while attempting a scoop while running out of partners - none of Mumbai’s specialist batters could convert their starts. Captain Prithvi Shaw was the first to perish, nicking Garg to Darshan Misal in the slip cordon in the fourth over. Aakarshit Gomel, who was yet again preferred over Yashasvi Jaiswal, and southpaw Sachin Yadav survived for the next 45 minutes until Gomel was dismissed, thanks to wicketkeeper Eknath Kerkar’s lunging catch off Garg. Three balls later, Rahane shouldered arms off one that slightly came in and umpire Kamlesh Sharma upheld the appeal despite the ball kissing the thigh-pad of Rahane’s right leg. Sarfaraz then staged the recovery with Yadav looking steady at the other end. Garg, having hurt his ankle after tumbling in his follow-through in his seventh over, returned to bowl after lunch. But it was Yadav who broke the 75-run partnership, trapping his surname-sake lbw. Since then, Mumbai lost five wickets for 18 runs in 40 balls as it slipped to 123 for eight. Had it not been for Tanush Kotian’s blows off slower bowlers, with Garg having done his hip in this time around, Mumbai would have struggled to cross the 150-run mark. But with Goa batters adopting an aggressive approach, it looks like Mumbai’s bowlers will have to repeat their Goa counterparts’ heroics early on Day 2 to get itself back in the game.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka: India vs Sri Lanka 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-sri-lanka-live-score-over-1st-t20i-t20-11-15-updates-2787474","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Sri Lanka from Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-24 14:23:35","full_description":"Follow the India vs Sri Lanka 2022 live cricket score on Sports.NDTV.com . After 15.2 overs, India are 137/1. Get live score, ball by ball commentary and much more. Keep track of India vs Sri Lanka 2022 today match between India and Sri Lanka. Everything related to India and Sri Lanka match will be available on Sports.NDTV.com . Stay updated with India vs Sri Lanka live score. Do check for India vs Sri Lanka scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (0 Run) Shorter and around off this time. Kishan looks to cut but misses. 14.5 overs (1 Run) A tossed up delivery outside off. Iyer lifts this towards deep extra cover for a single. 14.5 overs (2 Runs) Two wides! A fuller delivery down the leg side. Kishan looks to sweeps it but misses. The keeper fails to collect it cleanly too and the batters run a bye. 14.4 overs (0 Run) NOT OUT! Tossed up around off. Googly again. Kishan makes room and looks to hit it towards the off side but misses. There is an appeal for stumping. The leg umpire takes it upstairs. The replays roll in and the UltraEdge shows no bat involved and his leg is also inside the crease as the bails are whipped off. So he will continue. 14.3 overs (1 Run) Nicely tossed up outside off at 82.5 kph. Iyer drives it to long off for a single. 14.2 overs (1 Run) A low full toss around leg. Kishan flicks it to deep mid-wicket for a single. 14.1 overs (0 Run) Shorter and outside off this time. Kishan looks to heave it across the line but misses. 13.6 overs (1 Run) A slower full delivery on off. Kishan drills it to long on for a single. Good over by Chamika Karunaratne. 13.5 overs (0 Run) Again hit hard but no run! Back of a length, on off. Kishan hits this hard back to the bowler this time. 13.4 overs (0 Run) A slower length delivery on middle. Kishan looks to pull but mistimes it towards the leg side. 13.3 overs (0 Run) Hit hard but straight to the fielder at the covers in the ring! A length delivery on off. Kishan dances down the track and smahes it to covers. 13.2 overs (1 Run) Slightly fuller this time on middle. Iyer flicks it to deep square leg for a single this time. 13.1 overs (2 Runs) On a length, on middle. Iyer flicks it to deep mid-wicket for a couple. 12.6 overs (0 Run) Dot to end! Looks to okay the reverse sweep but this is bowled full and down the leg side. Kishan swings but misses. 12.5 overs (4 Runs) UNDEREDGE AND FOUR! Kishan steps out, this one stays low, Kishan looks to heave it but it goes off the underedge down to the third man fence. 12.4 overs (2 Runs) Two more! On middle, this is worked through mid-wicket for two. 12.3 overs (1 Run) A single as this is worked through mid-wicket. 12.2 overs (0 Run) Flatter and on off, Iyer guides it to point. 12.1 overs (2 Runs) Two more! On middle, this is worked wide of mid-wicket. 11.6 overs (1 Run) Iyer is off the mark! Shorter and on off, this is played to point. The fielder dives and stops it. Shreyas Iyer walks in at number 3. 11.5 overs (0 Run) OUT! TIMBER! Stop the press, Sri Lanka have managed to break the opening stand. It has done its job though but they can surely pull things back a little now. This one has stayed very low. On off, no bounce at all. Rohit looks to go over mid off but it sneaks under the bat and hits the off pole. 11.4 overs (1 Run) Just the one! Fuller and on off, Kishan hits it hard to mid off for one. 11.3 overs (1 Run) Just the one again! Shorter and outside off, Sharma was aiming for the leg side but this is short and outside off, he guides it down to third man for one. 11.2 overs (1 Run) Shorter and outside off, Kishan pushes it through covers for one more. 11.1 overs (2 Runs) Two more! Fuller and outside off, this is timed beautifully through covers. The fielder in the deep does well in the deep. Two taken. 10.6 overs (1 Run) Kishan skips down the track tad early this time. The bowler follows him and darts this on leg. Kishan works it to deep square leg for a single. 10.5 overs (1 Run) A fuller delivery on off. Sharma drives it to sweeper cover for a single. Ishan Kishan seems to be in some pain here! He is getting some tretament on his left leg now as the physio is out. He looks fine now and is ready to resume. 10.4 overs (1 Run) A flatter delivery on middle. Kishan works it to deep square leg and looks for the second run but has to settle for a single. 10.3 overs (2 Runs) Tossed up on middle. Kishan makes room and drives it inside out towards deep extra-cover. The long off fielder runs to his right and puts in a great dive and saves two runs for his team. 10.2 overs (2 Runs) Great effort in the deep by Charith Asalanka! 100 up for India! A fuller delivery around leg. Kishan sweeps it to deep backward square and gets a couple as the fielder does well to stop it. 10.1 overs (1 Run) A flatter delivery on middle. Sharma works it to deep mid-wicket for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637813292053781403.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Live Score Ball by Ball, India vs Sri Lanka 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-sri-lanka-live-score-over-1st-t20i-t20-6-10-updates-2787403","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Sri Lanka from Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-24 14:22:23","full_description":"Follow the India vs Sri Lanka 2022 live cricket score on Sports.NDTV.com . After 10.3 overs, India are 103/0. Get live score, ball by ball commentary and much more. Keep track of India vs Sri Lanka 2022 today match between India and Sri Lanka. Everything related to India and Sri Lanka match will be available on Sports.NDTV.com . Stay updated with India vs Sri Lanka live score. Do check for India vs Sri Lanka scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (4 Runs) FOUR! That has been hit with some power and it races away. On middle, Kishan whips it through mid-widket. No chance for the fielder in the deep. 9.5 overs (1 Run) On middle, this is nudged through square leg for one. 9.4 overs (2 Runs) Two! On middle, Rohit works it through mid-widket, in the gap and a big ground and hence, a boundary. 9.3 overs (1 Run) This one stays low too! On middle, Kishan works it towards mid-wicket for one. 9.2 overs (2 Runs) Fifty for Kishan! A superb innings from him, yes he did get a life but has played brilliantly. Also, a much-needed one for him as he has been short of runs. He gets a short ball outside off which he slaps it through covers for two. Has a chance now to make this a big score. 9.1 overs (1 Run) On a length, on off. Sharma looks to work it towards the leg side but gets a leading edge towards the off side for a single. 8.6 overs (1 Run) Tossed up outside off. Sharma creams it to deep cover for just a single now. 8.5 overs (0 Run) Tossed up outside off. Sharma thinks of chasing it but leaves it alone. 8.4 overs (6 Runs) SIX! Another good shot from Sharma! Tossed up delivery on off and it's a googly this time. Sharma gets low and slog-sweeps it over deep mid-wicket for a biggie. 8.3 overs (1 Run) A tossed up delivery on middle. Kishan lifts this aerially to long on for a single. 8.2 overs (0 Run) A fuller delivery around leg. Kishan looks to sweep but misses and the ball hits his pads. It is going down leg. 8.1 overs (3 Runs) Just over! Outside off, this one turns away a little. Sharma looks to go over covers, he ends up squirting it over point for three. 7.6 overs (1 Run) A single to end as this is guided down to third man. 7.5 overs (4 Runs) FOUR! That is brilliantly played! Shorter and on the body, this is pulled behind square on the leg side. Races away. 7.4 overs (1 Run) Shorter and on middle, this is pulled through mid-wicket for one. 7.3 overs (0 Run) A dot! On off, this is pushed to covers. 7.2 overs (1 Run) A single! On middle, this is worked through mid-wicket for one. 7.1 overs (2 Runs) Two! Good fielding! Fuller and on off, this is driven through covers. The fielder in the deep, runs to his right and dives, keeps it down to two. Chamika Karunaratne is back on. He went for 15 runs in his first over. 6.6 overs (1 Run) Another single as this is eased to long off. A wicket could have been taken in this over but instead it goes for runs. 6.5 overs (1 Run) On middle, this is worked down to long on for one. 6.4 overs (2 Runs) PUT DOWN! That is well bowled! Slows it up and bowls it outside off, Kishan drags it towards deep mid-wicket. Janith Liyanage runs in, makes a lot of ground and slides to take it but spills it. Should have hung on in the end. This could prove very costly. 6.3 overs (4 Runs) FOUR! That is a hit-me ball. Shorter and wider outside off, it is slapped through covers for a boundary. 6.2 overs (1 Run) On middle, this is worked to mid-wicket for one. 6.1 overs (0 Run) On off, this is pushed to covers. 5.6 overs (2 Runs) TWO MORE! A low full toss, this is timed down the ground. The fielder at mid off dives but he has no chance. The fielder at long on runs after it and stops it. 5.5 overs (0 Run) Good reply! Length and on off, Kishan plays it back to mid off. 5.4 overs (6 Runs) SIX! All the way. Kishan is in his element now. Fifty up for India. Short and on the body. This is pulled over the square leg fence for a biggie 5.3 overs (0 Run) Well bowled! A yorker outside off, Kishan looks to jam it out but misses. 5.2 overs (1 Run) Outside off, Rohit takes one as he guides it through point. 5.1 overs (2 Runs) IN THE AIR BUT SAFE! On middle, this is flicked up in the air but it clears mid on. Two taken.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637813291278428239.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka 1st T20I Live Score: Ishan Kishan Hits 50 As India Dominate Proceedings vs Sri Lanka - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2luZGlhLXZzLXNyaS1sYW5rYS0yMDIyL2luZGlhLXZzLXNyaS1sYW5rYS0yMDIyLTFzdC10MjBpLWluZC12cy1zbC10MjBpLWxpdmUtc2NvcmUtdXBkYXRlcy0yNzg3MDgy0gGAAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2luZGlhLXZzLXNyaS1sYW5rYS0yMDIyL2luZGlhLXZzLXNyaS1sYW5rYS0yMDIyLTFzdC10MjBpLWluZC12cy1zbC10MjBpLWxpdmUtc2NvcmUtdXBkYXRlcy0yNzg3MDgyL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka 1st T20I Live Score: Ishan Kishan Hits 50 As India Dominate Proceedings vs Sri Lanka  NDTVSports.comIndia vs Sri Lanka 2022: India's Predicted Playing XI For First T20I  Cricket AddictorMatch Preview - India vs Sri Lanka, Sri Lanka in India 2021/22, 1st T20I  ESPNcricinfoIndia vs Sri Lanka Live Score, 1st T20I at Lucknow: Ishan Kishan fifty gets India off to solid start - Firstcricket News  FirstpostIndia vs Sri Lanka 1st T20I Live Score Updates: Ishan Kishan, Rohit Sharma lead India run charge  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-02-24 14:22:07","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SL: Rohit creates world record in T20Is, betters Guptill, Kohli to top elusive batting list - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMirwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbmQtdnMtc2wtcm9oaXQtc2hhcm1hLWNyZWF0ZXMtd29ybGQtcmVjb3JkLWluLXQyMGlzLWJldHRlcnMtbWFydGluLWd1cHRpbGwtdmlyYXQta29obGktdG8tdG9wLWVsdXNpdmUtYmF0dGluZy1saXN0LTEwMTY0NTcxMTYzMTc1Mi5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SL: Rohit creates world record in T20Is, betters Guptill, Kohli to top elusive batting list  Hindustan TimesIND vs SL: Watch - Rohit Sharma Gets Castled By Lahiru Kumara's Slower Delivery In First T20I  Cricket Addictor\"He Didn't Have A Great Series...\": Wasim Jaffer Picks Team India Openers For T20Is vs Sri Lanka  NDTV SportsRohit Sharma Ready to Back Vihari, Shreyas And Gill; Tells Others to Score And Wait  News18'He does not have much time...': Former national selector identifies Rohit Sharma's 'biggest targets'  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-02-24 14:13:57","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka 1st T20 Live Score: Ishan Kishan, Rohit Sharma kick-off proceedings - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiuAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbmRpYS12cy1zcmktbGFua2EtMXN0LXQyMC1saXZlLXNjb3JlLWluZC12cy1zbC0yMDIyLWNyaWNrZXQtbWF0Y2gtdG9kYXktbGF0ZXN0LW5ld3MtZnVsbC1zY29yZWNhcmQtYW5kLWJhbGwtYnktYmFsbC11cGRhdGVzLTEwMTY0NTcwMTgwMjE2OS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka 1st T20 Live Score: Ishan Kishan, Rohit Sharma kick-off proceedings  Hindustan TimesIndia vs Sri Lanka 2022: India's Predicted Playing XI For First T20I  Cricket AddictorMatch Preview - India vs Sri Lanka, Sri Lanka in India 2021/22, 1st T20I  ESPNcricinfoIndia vs Sri Lanka 1st T20I Live Score Updates: Sri Lanka opt to bowl against India; Hooda makes T20I debut  Times of IndiaIND vs SL LIVE Score: Sri Lanka opt to bowl, India to bat first, Sanju Samson IN  InsideSportView Full coverage on Google News","content":null,"pubDate":"2022-02-24 13:57:09","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Why is Suryakumar Yadav not playing today’s 1st T20I between India and Sri Lanka in Lucknow?","link":"https://thesportsrush.com/cricket-news-why-is-suryakumar-yadav-not-playing-todays-1st-t20i-between-india-and-sri-lanka-in-lucknow/","keywords":["Cricket","India","Sri Lanka","Sri Lanka tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Suryakumar Yadav not playing: India have had to make six changes to their Playing XI from their last T20I on Sunday. During the first T20I of the ongoing Sri Lanka’s tour of India in Lucknow, Sri Lanka captain Dasun Shanaka has won the toss and chose to field. “We’ll bowl. It’s a very good pitch,… The post Why is Suryakumar Yadav not playing today’s 1st T20I between India and Sri Lanka in Lucknow? appeared first on The SportsRush.","content":"Suryakumar Yadav not playing: India have had to make six changes to their Playing XI from their last T20I on Sunday. During the first T20I of the ongoing Sri Lanka’s tour of India in Lucknow, Sri Lanka captain Dasun Shanaka has won the toss and chose to field. “We’ll bowl. It’s a very good pitch, we have been bowling well in the last few games, so backing our strengths. Have had a couple of days to recover,” Shanaka told Star Sports at the toss. Shanaka further confirmed the absence of a couple of doubtful starters who are unavailable due to respective injuries. “We have a couple of injuries – [Dinesh] Chandimal and [Jeffrey] Vandersay are in, they replace [Maheesh] Theekshana and Kusal Mendis,” Shanaka said. Why is Suryakumar Yadav not playing vs Sri Lanka? Much like Shanaka, India captain Rohit Sharma was also keen to field first at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium tonight. “We were looking to chase as well, not sure how the pitches in India plays. But we now know we need to bat well, the last time we played here, about 4 years back, the pitch played well. Nothing changes as far as the goals of the team are concerned, need to do the right things as a team, need to keep ticking all the right boxes,” Sharma told Star Sports at the toss. With India resting key players namely Virat Kohli and Rishabh Pant and Suryakumar Yadav and Deepak Chahar getting ruled out of the series due to respective injuries, the hosts have had to make as many as six changes from the Playing XI which took the field against West Indies in Kolkata on Sunday. Batter Ruturaj Gaikwad complaining of wrist pain further increased India’s selection woes. Welcome back @imjadeja, it’s been a while. Big assignment for @IamSanjuSamson too. #Rohit had mentioned Samson having the game to fare well on Aussie pitches where T20 World Cup will be played. But he needs to score consistently to find a place in the WC squad — Cricketwallah (@cricketwallah) February 24, 2022 “Ruturaj [Gaikwad] was supposed to play, but he has a wrist injury and will not play today,” Sharma said. Meanwhile, wicket-keeper batter Sanju Samson, all-rounders Deepak Hooda (debut) and Ravindra Jadeja, fast bowlers Bhuvneshwar Kumar and Jasprit Bumrah and spinner Yuzvendra Chahal have been included into the Playing XI. The post Why is Suryakumar Yadav not playing today’s 1st T20I between India and Sri Lanka in Lucknow? appeared first on The SportsRush.","pubDate":"2022-02-24 13:41:51","full_description":"Suryakumar Yadav not playing: India have had to make six changes to their Playing XI from their last T20I on Sunday. During the first T20I of the ongoing Sri Lanka’s tour of India in Lucknow, Sri Lanka captain Dasun Shanaka has won the toss and chose to field. “We’ll bowl. It’s a very good pitch, we have been bowling well in the last few games, so backing our strengths. Have had a couple of days to recover,” Shanaka told Star Sports at the toss. Shanaka further confirmed the absence of a couple of doubtful starters who are unavailable due to respective injuries. “We have a couple of injuries – [Dinesh] Chandimal and [Jeffrey] Vandersay are in, they replace [Maheesh] Theekshana and Kusal Mendis,” Shanaka said. Much like Shanaka, India captain Rohit Sharma was also keen to field first at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium tonight. “We were looking to chase as well, not sure how the pitches in India plays. But we now know we need to bat well, the last time we played here, about 4 years back, the pitch played well. Nothing changes as far as the goals of the team are concerned, need to do the right things as a team, need to keep ticking all the right boxes,” Sharma told Star Sports at the toss. With India resting key players namely Virat Kohli and Rishabh Pant and Suryakumar Yadav and Deepak Chahar getting ruled out of the series due to respective injuries, the hosts have had to make as many as six changes from the Playing XI which took the field against West Indies in Kolkata on Sunday. Batter Ruturaj Gaikwad complaining of wrist pain further increased India’s selection woes. Welcome back @imjadeja , it’s been a while. Big assignment for @IamSanjuSamson too. #Rohit had mentioned Samson having the game to fare well on Aussie pitches where T20 World Cup will be played. But he needs to score consistently to find a place in the WC squad — Cricketwallah (@cricketwallah) February 24, 2022 “Ruturaj [Gaikwad] was supposed to play, but he has a wrist injury and will not play today,” Sharma said. Meanwhile, wicket-keeper batter Sanju Samson, all-rounders Deepak Hooda (debut) and Ravindra Jadeja, fast bowlers Bhuvneshwar Kumar and Jasprit Bumrah and spinner Yuzvendra Chahal have been included into the Playing XI.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka: India vs Sri Lanka 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-sri-lanka-live-score-over-1st-t20i-t20-1-5-updates-2787262","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Sri Lanka from Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-24 13:31:55","full_description":"Follow the India vs Sri Lanka 2022 live cricket score on Sports.NDTV.com . After 4.2 overs, India are 42/0. Get live score, ball by ball commentary and much more. Keep track of India vs Sri Lanka 2022 today match between India and Sri Lanka. Everything related to India and Sri Lanka match will be available on Sports.NDTV.com . Stay updated with India vs Sri Lanka live score. Do check for India vs Sri Lanka scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.1 overs (1 Run) 1 run. 3.6 overs (4 Runs) Four! 3.5 overs (6 Runs) SIX! BANG! A short delivery on middle this time. Kishan rocks back and pulls it over deep square leg for a biggie. 3.4 overs (1 Run) A slower length delivery on middle. Sharma works it to square leg for a single. 3.4 overs (1 Run) WIDE! A slower fuller delivery down the leg side. Sharma looks to flick it but misses. 3.3 overs (1 Run) A fuller delivery on off at 147.4 kph. Kishan drives it to mid off and takes a single. There is a direct hit at the bowler's end but Kishan is well inside his crease. 3.2 overs (0 Run) A length delivery around off at 147.8 kph. Kishan looks to punch it away but gets beaten off the inside edge. 3.1 overs (1 Run) A length delivery on middle. Sharma flicks it to mid-wicket for a single. Lahiru Kumara will continue. 2.6 overs (1 Run) A fuller delivery on off. Sharma looks to work it towards the leg side but gets the inside edge onto his pads. A run taken towards the off side. 15 runs from the over! 2.5 overs (1 Run) On a length, around off again. Kishan steers it to backward point for a single now. 2.4 overs (4 Runs) FOUR! Three in a row now! Ishan Kishan will be feeling much better now! A length delivery outside off. Kishan throws his bat at it and gets this in the gap between backward point and short third man for a boundary. 2.3 overs (4 Runs) FOUR! Another boundary now! Chamika Karunaratne pulls his length back and provides some width there. Kishan cuts it through covers for a boundary. 2.2 overs (4 Runs) FOUR! Finally Kishan finds the gap and gets his first boundary! A low full toss outside off. Kishan leans foward and creams it through covers for a lovely boundary. 2.1 overs (0 Run) A fullish delivery this time on off. Slower in pace at 114.7 kph. Kishan drives it to covers now. 2.1 overs (1 Run) WIDE! Chamika Karunaratne starts with a shorter delivery down the leg side. Kishan looks to pull but misses. 1.6 overs (0 Run) Back of a length, outside off. Sharma cuts it to point this time. He looks disappointed with his shot there. 1.5 overs (1 Run) Another delivery that is on a shorter side at 143.2 kph. Kishan pulls it to deep square leg this time for a single. 1.4 overs (0 Run) A short ball this time on off. Kishan pulls it without much timing to mid on. 1.3 overs (0 Run) Beaten this time! A good-length delivery outside off. Kishan looks to cut it but misses. 1.2 overs (1 Run) Back of a length, on middle. Sharma pulls it to deep square leg for a single. 1.1 overs (4 Runs) FOUR! First boundary of the game and Hitman flicks this beautifully! A fuller delivery on middle. Sharma flicks it towards deep backward square leg. The fielder in the deep runs to his right and puts in a dive but fails to stop it. Lahiru Kumara will share the new ball with Dushmantha Chameera. 0.6 over (0 Run) A fuller delivery on middle. Kishan drives it to mid on this time. Decent start by Dushmantha Chameera. 0.5 over (3 Runs) This time he hits this over the infield! A fuller deivery on off. Sharma drives it uppishly over cover-point and gets three runs. The boundaries are long here and we will see many of these three's today. 0.4 over (1 Run) Kishan is off the mark straightaway! A fuller delivery on off. Kishan blocks it out towards the leg side for a single. 0.3 over (1 Run) Rohit Sharma and India are underway! A fuller delivery on off. Sharma drives it left of mid off and takes a single. Shanaka there fumbles a little and a single is taken after initial mix-up between the batters. 0.2 over (0 Run) On a length, this time on off. Sharma blocks it out to mid off. Not much swing in the first couple of balls. 0.1 over (0 Run) Dushmantha Chameera starts with a fullish delivery on middle. Sharma leans forward and drives it towards the off side. So we are done with national anthems and the action is all set to begin at Lucknow! Sri Lankan players make their way out to the middle. Rohit Sharma and Ishan Kishan are the openers for India. Sunil Gavaskar rings the bell as a symbol for play to start. Dushmantha Chameera will start with the ball for Sri Lanka. Here we go... The two teams are now assembling for their respective national anthems. It will be Sri Lanka's national anthem first up, followed by the Indian national anthem. Shreyas Iyer is down for the chat. He says that he is comfortable in the number 3 position and this position gives more time to settle and then launch. He mentions that he was quite flamboyant at the start of his career but he is now more calm in his approach. He mentions that in this format it is important to not think too much and just react to the situation. He says he enjoys playing leg spinners but tells that it depends on the situation but he prefers a leg spinner anyday and likes going after them. Rohit Sharma, the Indian skipper, says that he was looking to chase. He says that he was not sure about the pitch and he says that the last time they played here the pitch was good. He mentions that nothing changes for them and he adds that it is important they stay in the radar and they want to keep ticking the boxes. He mentions that this is a good opportunity for younger guys. He informs that they have made six changes from the last game and Ruturaj Gaikwad was about to play but has injured his wrist before the game. Dasun Shanaka, the Sri Lankan skipper, says that they will bowl first. He says that they are bowling well in the last few games and they are confident. He adds that Australia was a tough tour and they could have won more games there. He informs that they have few changes from the last time they played. India (Playing XI) - Rohit Sharma (C), Ishan Kishan (WK), Shreyas Iyer, Sanju Samson, Venkatesh Iyer, Deepak Hooda, Ravindra Jadeja, Harshal Patel, Bhuvneshwar Kumar, Jasprit Bumrah, Yuzvendra Chahal. Sri Lanka (Playing XI) - Pathum Nissanka, Kamil Mishara, Charith Asalanka, Janith Liyanage, Dinesh Chandimal (WK), Chamika Karunaratne, Dasun Shanaka (C), Jeffrey Vandersay, Praveen Jayawickrama, Lahiru Kumara, Dushmantha Chameera. TOSS - The coin goes up and lands in favour of Sri Lanka. They have elected to FIELD first. PITCH REPORT - Deep Dasgupta is down for the pitch report. He says the match is on the black soil pitch. He says that the right boundary is short and the left is long. He mentions that the straight at Lucknow is the longest in the country. Russel Arnold joins him and he says that the conditions are good and there will not be much dew. He informs that the pitch is hard and there will be a nice pace and bounce. He recokns that 180 is a par score today. Sri Lanka, on the other hand, will head into this game with some confidence. They beat Australia in their last game and in conditions which are kind of familiar to home, they would feel they could do better here. They too will take this series as one to prepare for the upcoming T20 World Cup. Toss and teams in a bit. With a few big names missing, India will yet again look to test their bench strength. Saying that, the likes of Bumrah is back yet again to lead the bowling attack. However, Samson returns into the line-up and will probably be picked in the XI. This is a good chance for him to make a statement before the grandest stage. India's preparation for the upcoming T20 World Cup continues. It was West Indies who visited a little while ago and now it is their neighbours Sri Lanka who head here to play 3 T20Is and two Tests. On that note, hello and a warm welcome to the coverage of the first T20I between India and Sri Lanka. ... MATCH DAY …","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637813261025715580.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Assam Cricket Association Bans NFR U-19 Team, Captain And Coach For Alleged Match-Fixing","link":"https://www.sentinelassam.com/north-east-india-news/assam-news/assam-cricket-association-bans-nfr-u-19-team-captain-and-coach-for-alleged-match-fixing-579946","keywords":["Breaking News,NE News,Sports,Assam News,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The team of NFR U-19 was involved in match-fixing with Jorhat U-19 in the JK Baruah Inter district tournament held in Assam's Golaghat district on 16 February.","content":"GUWAHATI: On a dark day of Assam Cricket on 16 February 2022, the NFR (North Frontier Railway) team had intentionally underperformed to knock-out team Silchar from the JK Baruah Inter district match held in Assam's Golaghat district.Several investigations were conducted over the matter by a committed after receiving allegations regarding match-fixing in the JK Brauah tournament between the under-19 Railway team and the Jorhat team. In taking action against the alleged match-fixing the ACA has announced its decision today by putting bans on the cricket career of all the people related to the illegal sports activity. On Thursday 24 February the ACA (Assam Cricket Association) has banned the NFR under-19 cricket team and its captain Ronit Akhtar from any cricket activities under the association for 3 years. Moreover, the ACA also banned the manager cum coach of the North Frontier Railway team named Satyabrata Chakraborty. He is banned for the entire lifetime from any activities related to cricket under the state cricket association. The secretary of ACA, Devajit Saikia while addressing the media said that the decision of exemplary action against NFR u-19 has been taken by the association after an interrogation with concerned officials and other related members because the team, its coach and captain have dishonored the spirit of the game and brought shame to the entire cricket association. He further stated that it is very unfortunate though ACA is not happy to announce bans on cricketers but such actions are needed to prevent such incidents from happening in the future. The match-fixing on 16 February has brought massive controversy as it was clear to see that team Jorhat has almost lost the game but emerged to be the winner. The game was ended with the Jorhat team being practically impossible to win but the match was resumed after the skipper had a discussion with umpires and Jorhat topped the table. Following the conspiracy, the Silchar under-19 team which was at the tabletop filed a complaint with ACA and alleged the NFR-Jorhat match was a fixed one.Also read: IPL 2022: Maharashtra To Host 70 Matches Across Four Venues, Says ReportAlso watch: ","pubDate":"2022-02-24 12:46:14","full_description":"GUWAHATI: On a dark day of Assam Cricket on 16 February 2022, the NFR (North Frontier Railway) team had intentionally underperformed to knock-out team Silchar from the JK Baruah Inter district match held in Assam's Golaghat district. Several investigations were conducted over the matter by a committed after receiving allegations regarding match-fixing in the JK Brauah tournament between the under-19 Railway team and the Jorhat team. In taking action against the alleged match-fixing the ACA has announced its decision today by putting bans on the cricket career of all the people related to the illegal sports activity. On Thursday 24 February the ACA (Assam Cricket Association) has banned the NFR under-19 cricket team and its captain Ronit Akhtar from any cricket activities under the association for 3 years. Moreover, the ACA also banned the manager cum coach of the North Frontier Railway team named Satyabrata Chakraborty. He is banned for the entire lifetime from any activities related to cricket under the state cricket association. The secretary of ACA, Devajit Saikia while addressing the media said that the decision of exemplary action against NFR u-19 has been taken by the association after an interrogation with concerned officials and other related members because the team, its coach and captain have dishonored the spirit of the game and brought shame to the entire cricket association. He further stated that it is very unfortunate though ACA is not happy to announce bans on cricketers but such actions are needed to prevent such incidents from happening in the future. The match-fixing on 16 February has brought massive controversy as it was clear to see that team Jorhat has almost lost the game but emerged to be the winner. The game was ended with the Jorhat team being practically impossible to win but the match was resumed after the skipper had a discussion with umpires and Jorhat topped the table. Following the conspiracy, the Silchar under-19 team which was at the tabletop filed a complaint with ACA and alleged the NFR-Jorhat match was a fixed one. Also read: IPL 2022: Maharashtra To Host 70 Matches Across Four Venues, Says Report Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/24/316844-story-13-3.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"WAFC CEO Michael Roberts embroiled in Renee Ferguson’s sexual harassment claim against Cricket Tasmania","link":"https://thewest.com.au/sport/cricket/wafc-ceo-michael-roberts-embroiled-in-renee-fergusons-sexual-harassment-claim-against-cricket-tasmania-c-5828504","keywords":null,"creator":["Eliza Reilly"],"video_url":null,"description":"WAFC CEO Michael Roberts has been embroiled in Cricket Tasmania’s sexual harassment scandal over allegations he told the woman at the centre of the Tim Paine sexting saga to ignore earlier complaints.","content":null,"pubDate":"2022-02-24 12:32:12","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5828504/07593701f13f65ef6a2c841959b50597db7f6632-16x9-x0y14w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"LIVE India vs Sri Lanka 1st T20I Live Cricket Score Updates from Lucknow, Feb 24 2022, Sri Lanka tour of India","link":"https://www.indiatvnews.com/sports/cricket/india-vs-sri-lanka-1st-t20-live-score-ind-vs-sl-2022-feb-24-cricket-match-latest-updates-commentary-live-news-full-scorecard-live-streaming-2022-02-24-761393","keywords":null,"creator":null,"video_url":null,"description":"LIVE Score India vs Sri Lanka 1st T20 Live Cricket Score Latest Updates: Toss at 6:30 PM","content":null,"pubDate":"2022-02-24 12:29:18","full_description":null,"image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Honest Coach Always\": Irfan Pathan Backs Dravid Amid Wriddhiman Episode","link":"https://sports.ndtv.com/cricket/irfan-pathan-backs-india-head-coach-rahul-dravid-amid-wriddhiman-saha-episode-2787100","keywords":null,"creator":null,"video_url":null,"description":"Former India all-rounder Irfan Pathan offered his backing to Indian cricket team head coach Rahul Dravid, without naming the latter, in a recent tweet amid the ongoing saga over wicketkeeper-batter...","content":null,"pubDate":"2022-02-24 12:14:29","full_description":"Former India all-rounder Irfan Pathan offered his backing to Indian cricket team head coach Rahul Dravid , without naming the latter, in a recent tweet amid the ongoing saga over wicketkeeper-batter Wriddhiman Saha being dropped from the Test side. In a tweet posted on the micro-blogging plaform on Sunday, Pathan gave his backing to Dravid without naming him. \"An honest coach Or someone just gives hope even after knowing that a player doesn't fit in the scheme of things? Your opinion????? For me an honest coach ALWAYS!\" wrote Pathan on Twitter. The tweet appeared to be a direct reference to the episode involving Dravid and Saha. An honest coach Or someone just gives hope even after knowing that a player doesn't fit in the scheme of things? Your opinion????? For me an honest coach ALWAYS! Speaking to reporters in Kolkata on Saturday, Saha had said that he had been told by the Indian team management that he would no longer be considered for a place in the Test side. \"The team management had told me that I would not be considered henceforth. I could not tell this so long as I was part of the India team setup,\" Saha said. \"Even coach Rahul Dravid suggested that I think about taking retirement,\" he added. A day later, after India's victory over West Indies in the third T20I, Dravid addressed the post-match press conference and took questions on Saha's comments. \"I'm actually not hurt at all. I have deep respect for Wriddhi and his achievements and his contribution to Indian cricket. My conversation came from that place. I think he deserved honesty and clarity,\" Dravid said when asked whether he was hurt by Saha's remarks. Promoted \"It's about conversations I constantly have with players. I don't expect players to always agree with everything I say about them. That's not how it works. You can have difficult conversations with the players, but that doesn't mean you brush it under the carpet and don't have the conversations,\" said the former India captain. \"I always believe in having those conversations before every playing XI is picked and be open to questions such as why they are not playing. It's natural for players to get upset and feel hurt,\" Dravid added.","image_url":"https://c.ndtvimg.com/2022-02/tbe7s108_irfan-pathan-rahul-dravid-afp_625x300_24_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}