{"newsArray":[{"title":"Lucknow Super Giants outwit Rajasthan Royals in low-scoring contest","link":"http://island.lk/lucknow-super-giants-outwit-rajasthan-royals-in-low-scoring-contest-2/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an […]","content":"Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle. Published on By The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya.","pubDate":"2023-04-21 00:01:53","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Rafael Nadal does not know when he will return from injury","link":"http://island.lk/rafael-nadal-does-not-know-when-he-will-return-from-injury/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, […]","content":"Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle. Published on By The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya.","pubDate":"2023-04-20 23:40:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Jayasuriya makes impressive strides in ICC Rankings","link":"http://island.lk/jayasuriya-makes-impressive-strides-in-icc-rankings/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will […]","content":"Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya.","pubDate":"2023-04-20 23:40:46","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"The 63rd ‘Battle of Mangosteens’ commences at Surrey Village today","link":"http://island.lk/the-63rd-battle-of-mangosteens-commences-at-surrey-village-today/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this […]","content":"The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle.","pubDate":"2023-04-20 23:40:15","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Fourth T20I called off due to hailstorm in Rawalpindi","link":"http://island.lk/fourth-t20i-called-off-due-to-hailstorm-in-rawalpindi/","keywords":["Sports","hailstorm","New Zealand","New Zealand in Pakistan","Pakistan","Rawalpindi","T20I"],"creator":["Priyan"],"video_url":null,"description":"A hailstorm in April, of all things, resulted in the fourth T20I between Pakistan and New Zealand being abandoned towards the tail-end of the first innings Mark Chapman’s unbeaten 42-ball 71 had spearheaded New Zealand’s innings after an early triple-strike from Imad Wasim put the visitors on the backfoot. The recovery had seen them post […]","content":"A hailstorm in April, of all things, resulted in the fourth T20I between Pakistan and New Zealand being abandoned towards the tail-end of the first innings Mark Chapman’s unbeaten 42-ball 71 had spearheaded New Zealand’s innings after an early triple-strike from Imad Wasim put the visitors on the backfoot. The recovery had seen them post their highest total of the series with seven balls still to go, as New Zealand were 164 for 5 when the weather intervened. Brief scores: New Zealand Pakistan Match abandoned Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle.","pubDate":"2023-04-20 22:21:01","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Delhi Capitals clinch thriller to end three-week wait for first points","link":"http://island.lk/delhi-capitals-clinch-thriller-to-end-three-week-wait-for-first-points/","keywords":["Sports","Arun Jaitley Stadium","Cricket","DC","Delhi Capitals","IPL2023","KKR","Kolkota Knight Riders"],"creator":["Priyan"],"video_url":null,"description":"The Delhi Capitals finally got on the board after a three-week, sixth match wait, in front of their home crowd at the Arun Jaitley Stadium. After a spirited bowling performance from the home team, the batting got off to a flying start, with a flurry of boundaries from David Warner to set the tone, despite […]","content":"The Delhi Capitals finally got on the board after a three-week, sixth match wait, in front of their home crowd at the Arun Jaitley Stadium. After a spirited bowling performance from the home team, the batting got off to a flying start, with a flurry of boundaries from David Warner to set the tone, despite the regular fall of wickets at the other end. The wicket of Warner caused a panic, but eventually, the Capitals stumbled home and heaved a sigh of relief, earning themselves a long-awaited win. Brief Scores: Kolkata Knight Riders 127 all-out in 20 overs (Jason Roy 43, Andre Russell 38*, Axar Patel 2-13, Kuldeep Yadav 2-15) Delhi Capitals 128-6 (David Warner 57, Varun Chakravarthy 2-16, Nitish Rana 2-17, Anukul Roy 2-19) by 4 wickets. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle.","pubDate":"2023-04-20 22:07:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"IPL 2023: Apple CEO Tim Cook Spotted At Delhi Capitals Vs Kolkata Knight Riders Clash With Sonam Kapoor, See Pics Here","link":"https://zeenews.india.com/cricket/ipl-2023-apple-ceo-tim-cook-spotted-at-delhi-capitals-vs-kolkata-knight-riders-clash-with-sonam-kapoor-see-pics-here-2597248.html","keywords":null,"creator":null,"video_url":null,"description":"Tim Cook was in attendance at the Arun Jaitley Stadium in Delhi during the game between Delhi Capitals and Kolkata Knight Riders.","content":null,"pubDate":"2023-04-20 17:42:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"Faf, Siraj shine as Royal Challengers Bangalore down Punjab Kings","link":"http://island.lk/faf-siraj-shine-as-royal-challengers-bangalore-down-punjab-kings/","keywords":["Latest News","Sports","Faf du Plesis","IPL2023","Mohammad Siraj","PBKS","Punjab Kings","RCB","Royal Challengers Bangalore","Virat Kohli"],"creator":["Priyan"],"video_url":null,"description":"Fifties from Faf du Plessis and Virat Kohli, along with a career-best performance from Mohammad Siraj, propelled Royal Challengers Bangalore to a 24-run win over Punjab Kings in Match 27 of the 2023 Indian Premier League on Thursday (April 20). Having posted a competitive total of 174, largely on the basis of fifties from Faf […]","content":"Fifties from Faf du Plessis and Virat Kohli, along with a career-best performance from Mohammad Siraj, propelled Royal Challengers Bangalore to a 24-run win over Punjab Kings in Match 27 of the 2023 Indian Premier League on Thursday (April 20). Having posted a competitive total of 174, largely on the basis of fifties from Faf and Kohli, Bangalore withstood a freakish run chase from Punjab to come out on top in Mohali. Brief scores : 174/4 in 20 overs (Faf du Plessis 84, Virat Kohli 59, Harpreet Brar 2-31) in 18.4 overs (Prabhsimran Singh 46, Jitesh Sharma 41, Mohammed Siraj 4-21) by 24 runs Published on By The Indonesian Naval Ship KRI Bima Suci arrived at the port of Colombo on an official visit on Thursday (20th April 2023). The visiting ship was welcomed by the Sri Lanka Navy (SLN) in compliance with naval tradition. KRI Bima Suci is a 112.2m long platform manned by a crew of 95 and she is commanded by Commander M. Sati Lubis The ship is scheduled to depart the island on 22nd April and on her departure she will host a training visit for two SLN Officer Under Trainees. Published on By BBC reported that a lion has been spotted in Chad’s Sena Oura National Park, where the big cats have not been seen since 2004 and were believed to be extinct until now. A photo of a lioness was released by a team of conservationists from the Chad government and the New-York based Wildlife Conservation Society (WCS). “The photo shows a prime, very healthy adult lioness, around five years old,” WCS Big Cat Programme executive director Luke Hunter told the BBC. “I am sure she is not alone,” he said. The image – taken by a remote camera in the protected area back in February – was released on Thursday. “This is hugely encouraging because prime females are the foundation of any lion population, and they are not big wanderers and inhabit areas that have prey and are safe to raise their cubs in,” said Dr Hunter. He added that her presence was an early sign of lions recovering in an adjacent national park in Cameroon. In 2014, the authoritative International Union for Conservation of Nature’s (IUCN) Red List of Threatened Species concluded that lions were extinct in Sena Oura. The WCS says that the region “saw a period of ruthless, organized poaching more than a decade ago, but has since benefited from a very strong commitment to conservation by the governments of both Cameroon and Chad”. “This has produced better protection of the national parks and wildlife populations are now starting to recover,” the organization adds. Dr Hunter says that , the vast majority of which are classified as the southern lion sub-species native to east and southern Africa. There are fewer than 1,000 northern lions in west and central Africa, and they are “especially endangered and precious”, he adds. Published on By BBC reported that a n Indian court has rejected opposition leader Rahul Gandhi’s appeal seeking a stay on his conviction in a criminal defamation case. The decision extends the uncertainty over whether he can contest in national elections due next year. Rahul Gandhi has been sentenced to two years in jail for 2019 comments about Prime Minister Narendra Modi’s surname at an election rally. He won’t be arrested until he has exhausted all legal appeals. Gandhi’s lawyer, Kirit Panwala, told the BBC that they will challenge the decision in the Gujarat high court. Gandhi lost his seat in parliament a day after his conviction on 23 March due to a Supreme Court order which says that a lawmaker convicted in a crime and sentenced to two or more years in jail is disqualified with immediate effect. The Congress has criticised Gandhi’s conviction and accused the governing Bharatiya Janata Party (BJP) of political vendetta. The BJP has denied this, saying that due judicial process was followed in the case. Earlier this month, Gandhi had filed appeals to suspend his sentence, or secure bail, and to suspend his conviction in a court in Surat. The court had granted Gandhi bail to appeal against his conviction, but it’s the stay or suspension of his conviction that’s crucial to reinstating him as an MP. The defamation case against Rahul Gandhi, brought by BJP lawmaker Purnesh Modi, revolved around comments Gandhi made in Karnataka state in 2019 during an election rally: he said. Nirav Modi is a fugitive Indian diamond tycoon while Lalit Modi is a former chief of the Indian Premier League who has been banned for life by the country’s cricket board. Purnesh Modi in his complaint alleged that the comments had defamed the entire Modi community. However, Gandhi said that he made the comment to highlight corruption and it was not directed against any community.","pubDate":"2023-04-20 16:42:03","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"DC vs KKR Live Score: केकेआर ने गंवाया नौंवा विकेट, दिल्ली फ्रंटफुट पर","link":"https://sports.ndtv.com/hindi/cricket/dc-vs-kkr-live-score-ipl-2023-today-28th-match-delhi-capitals-vs-kolkata-knight-riders-live-score-updates-3965233#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Delhi Capitals vs Kolkata Knight Riders 28th Match Live: इंडियन प्रीमियर लीग (IPL 2023) में दिन का दूसरा मुकाबला दिल्ली के अरुण जेटली स्टेडियम में दिल्ली और केकेआर के बीच खेला जा रहा है. जिसमें केकेआर की टीम टॉस हारकर पहले बल्लेबाज़ी कर रही है.","content":"Delhi Capitals vs Kolkata Knight Riders 28th Match Live: इंडियन प्रीमियर लीग (IPL 2023) में दिन का दूसरा मुकाबला दिल्ली के अरुण जेटली स्टेडियम में दिल्ली और केकेआर के बीच खेला जा रहा है. जिसमें दिल्ली कैपिटल्स ने टॉस जीतकर पहले गेंदबाज़ी का फैसला किया है. केकेआर ने पहले बल्लेबाज़ी करते हुए 9 विकेट गंवा दिए हैं. DC vs KKR लाइव स्कोरबोर्डदिल्ली कैपिटल्स ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया. मैच में खेल रहीं दोनों टीमों की फाइनल इलेवन इस प्रकार हैं:मैच में खेल रहीं दोनों टीमों की फाइनल इलेवन इस प्रकार हैं: केकेआर: 1. नितीश राणा (कप्तान) 2. जेसन रॉय 3. लिटन दास 4. वेंकटेश अय्यर 5. मनदीप सिंह 6. आंद्रे रसेल 7. रिंकू सिंह 8. सुनील नरेन 9. कुलवंत खेजरोलिया 10. उमेश यादव 11. वरुण चक्रवर्तीदिल्ली:  1. डेविड वॉर्नर  2. फिलिप सॉल्ट (विकेटकीपर) 3. मिशेल मार्श 4. मनीष पांडेय 5. अक्षर पटेल 6. अमन हाकिम खान  7. ललित यादव 8. कुलदीप यादव 9. एनरिच नॉर्किया 10. ईशांत शर्मा 11. मुकेश कुमारDelhi Capitals vs Kolkata Knight Riders, 28th Match Live Cricket Score","pubDate":"2023-04-20 16:36:31","image_url":"https://c.ndtvimg.com/2023-04/0h1f1qv8_dc-vs-kkr_625x300_20_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"PBKS vs RCB: मोहम्मद सिराज ने किया खुलासा, इस पहलू ने की टॉप फॉर्म हासिल करने में मदद","link":"https://sports.ndtv.com/hindi/cricket/pbks-vs-rcb-player-of-the-match-mohammed-siraj-reveals-what-made-him-to-achieve-top-form-3965871#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Punjab Kings vs Royal Challengers Bangalore: मैच में आरसीबी की कप्तानी करने वाले विराट कोहली ने कहा कि पीसीए आईएस बिंद्रा स्टेडियम की पिच पर बल्लेबाजी करना चुनौतीपूर्ण था. कोहली ने कहा, ‘यह (जीत) हमें एक अजेय टीम नहीं बनाती है या आज से पहले लीग की स्थिति हमें एक बुरी टीम नहीं बनाती है","content":"भारत और रॉयल चैलेंजर्स बैंगलोर (RCB) के तेज गेंदबाज मोहम्मद सिराज (Mohammed Siraj) ने अपनी सफलता का श्रेय कोविड के कारण लागू लॉकडाउन के दौरान की गई कड़ी मेहनत को दिया है. सिराज ने गुरुवार को पंजाब किंग्स के खिलाफ चार विकेट चटकाए जिससे आरसीबी ने 24 रन से जीत दर्ज की. भारत के लिए सिराज सभी प्रारूपों में अंतरराष्ट्रीय क्रिकेट में सबसे प्रभावशाली गेंदबाजों में से एक के रूप में उभरे हैं और उन्होंने जसप्रीत बुमराह की गैरमौजूदगी में जिम्मेदारी अच्छी तरह निभाई है. वह इस साल की शुरुआत में लगभग दो महीने के लिए नंबर एक एकदिनी गेंदबाज भी बने थे.SPECIAL STORIES:\"एटिट्यूड कोहली जैसा, लेकिन टैलेंट रियान पराग का\", फैंस राजस्थानी खिलाड़ी को बख्शने को तैयार नहींबेहतरीन \"गुलाटी कैच\" से आउट हुए विराट कोहली, लेकिन फैस ने दी यह नसीहतसिराज ने मैच के बाद कहा, ‘लॉकडाउन मेरे लिए बहुत महत्वपूर्ण था. मैं इससे पहले काफी निराश था क्योंकि मैं काफी महंगा साबित होता था. मैंने अपने जिम प्रशिक्षण,अपनी गेंदबाजी पर ध्यान केंद्रित किया और मैं अच्छा प्रदर्शन करना चाहता था.'  उन्होंने कहा, ‘‘एकदिनी मैचों में भी मेरी लय अच्छी थी. मेरा आत्मविश्वास ऊंचा था और मैं इसे आईपीएल के इस सत्र में लेकर आया. मैं एक अच्छा क्षेत्ररक्षक हूं. मैं कभी-कभी कुछ गलतियां करता हूं (मुस्कुराते हुए). मैं हमेशा हर पहलू में सुधार करने कोशिश करता हूं, जिससे कि मैं टीम का हिस्सा बना रह सकूं.'मैच में आरसीबी की कप्तानी करने वाले विराट कोहली ने कहा कि पीसीए आईएस बिंद्रा स्टेडियम की पिच पर बल्लेबाजी करना चुनौतीपूर्ण था. कोहली ने कहा, ‘यह (जीत) हमें एक अजेय टीम नहीं बनाती है या आज से पहले लीग की स्थिति हमें एक बुरी टीम नहीं बनाती है. तालिका आपके मूड को परिभाषित नहीं कर सकती है जबकि आपने सिर्फ पांच या छह मैच खेले हैं. हम अपनी प्रक्रिया को जारी रखेंगे. पहले हाफ में परिस्थितियों में काफी बदलाव आया. फैफ (डुप्लेसी) ने शानदार बल्लेबाजी की'उन्होंने कहा, ‘‘हमने अपनी साझेदारी को जितना संभव हो उतना लंबा करने के बारे में सोचा जिससे कि हम अतिरिक्त 20 रन बना सकें. सात या आठ ओवर के बाद गेंद थोड़ी नरम हो गई थी और हमें अपनी रणनीति बदलनी पड़ी. अगर हम टिके रहते तो 190 से 200 रन बना सकते थे. हमें लगा कि इस पिच पर 175 एक अच्छा स्कोर है. मैंने उनसे (टीम के साथियों) कहा कि यह पर्याप्त रन हैं.'नियमित कप्तान शिखर धवन के चोटिल होने के कारण पंजाब किंग्स की अगुआई कर रहे सैम कुरेन ने कोहली और डुप्लेसी की सराहना की जिन्होंने पहले विकेट के लिए 137 रन जोड़े. कुरेन ने कहा, ‘मुझे लगता है कि एक समूह के रूप में हमने वास्तव में अच्छी गेंदबाजी की. फैफ और कोहली जिस तरह से खेले वह अच्छा था. मुझे नहीं लगता था कि वे मुकाबले को हमारे से काफी दूर ले गए. अंत में, हमने बस अच्छी बल्लेबाजी नहीं की. उन्होंने काफी अच्छी गेंदबाजी भी की लेकिन हमने विकेट गंवाए। परिस्थितियां भी काफी अजीब थीं। हमें एक समय लगा कि बारिश होगी.'--- ये भी पढ़ें ---* क्रिकेट ऑस्ट्रेलिया ने किया 'WTC टीम ऑफ द टूर्नामेंट' का ऐलान, कोहली-रोहित को जगह नहीं, लेकिन बाबर आजम टीम में शामिल * श्रीलंका के जादुई स्पिनर 'जयसूर्या' ने टेस्ट क्रिकेट में मचाई खलबली, केवल 6 टेस्ट खेलकर दोहरा दिया ऐतिहासिक कारनामा स्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-04-20 16:35:17","image_url":"https://c.ndtvimg.com/2023-04/jfst86gg_mohammed-siraj_625x300_03_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Lucknow Super Giants outwit Rajasthan Royals in low-scoring contest","link":"http://island.lk/lucknow-super-giants-outwit-rajasthan-royals-in-low-scoring-contest-2/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an […]","content":"Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle. Published on By The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya.","pubDate":"2023-04-21 00:01:53","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Rafael Nadal does not know when he will return from injury","link":"http://island.lk/rafael-nadal-does-not-know-when-he-will-return-from-injury/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, […]","content":"Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle. Published on By The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya.","pubDate":"2023-04-20 23:40:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Jayasuriya makes impressive strides in ICC Rankings","link":"http://island.lk/jayasuriya-makes-impressive-strides-in-icc-rankings/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will […]","content":"Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya.","pubDate":"2023-04-20 23:40:46","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"The 63rd ‘Battle of Mangosteens’ commences at Surrey Village today","link":"http://island.lk/the-63rd-battle-of-mangosteens-commences-at-surrey-village-today/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this […]","content":"The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle.","pubDate":"2023-04-20 23:40:15","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Fourth T20I called off due to hailstorm in Rawalpindi","link":"http://island.lk/fourth-t20i-called-off-due-to-hailstorm-in-rawalpindi/","keywords":["Sports","hailstorm","New Zealand","New Zealand in Pakistan","Pakistan","Rawalpindi","T20I"],"creator":["Priyan"],"video_url":null,"description":"A hailstorm in April, of all things, resulted in the fourth T20I between Pakistan and New Zealand being abandoned towards the tail-end of the first innings Mark Chapman’s unbeaten 42-ball 71 had spearheaded New Zealand’s innings after an early triple-strike from Imad Wasim put the visitors on the backfoot. The recovery had seen them post […]","content":"A hailstorm in April, of all things, resulted in the fourth T20I between Pakistan and New Zealand being abandoned towards the tail-end of the first innings Mark Chapman’s unbeaten 42-ball 71 had spearheaded New Zealand’s innings after an early triple-strike from Imad Wasim put the visitors on the backfoot. The recovery had seen them post their highest total of the series with seven balls still to go, as New Zealand were 164 for 5 when the weather intervened. Brief scores: New Zealand Pakistan Match abandoned Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle.","pubDate":"2023-04-20 22:21:01","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Delhi Capitals clinch thriller to end three-week wait for first points","link":"http://island.lk/delhi-capitals-clinch-thriller-to-end-three-week-wait-for-first-points/","keywords":["Sports","Arun Jaitley Stadium","Cricket","DC","Delhi Capitals","IPL2023","KKR","Kolkota Knight Riders"],"creator":["Priyan"],"video_url":null,"description":"The Delhi Capitals finally got on the board after a three-week, sixth match wait, in front of their home crowd at the Arun Jaitley Stadium. After a spirited bowling performance from the home team, the batting got off to a flying start, with a flurry of boundaries from David Warner to set the tone, despite […]","content":"The Delhi Capitals finally got on the board after a three-week, sixth match wait, in front of their home crowd at the Arun Jaitley Stadium. After a spirited bowling performance from the home team, the batting got off to a flying start, with a flurry of boundaries from David Warner to set the tone, despite the regular fall of wickets at the other end. The wicket of Warner caused a panic, but eventually, the Capitals stumbled home and heaved a sigh of relief, earning themselves a long-awaited win. Brief Scores: Kolkata Knight Riders 127 all-out in 20 overs (Jason Roy 43, Andre Russell 38*, Axar Patel 2-13, Kuldeep Yadav 2-15) Delhi Capitals 128-6 (David Warner 57, Varun Chakravarthy 2-16, Nitish Rana 2-17, Anukul Roy 2-19) by 4 wickets. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle.","pubDate":"2023-04-20 22:07:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"IPL 2023: Apple CEO Tim Cook Spotted At Delhi Capitals Vs Kolkata Knight Riders Clash With Sonam Kapoor, See Pics Here","link":"https://zeenews.india.com/cricket/ipl-2023-apple-ceo-tim-cook-spotted-at-delhi-capitals-vs-kolkata-knight-riders-clash-with-sonam-kapoor-see-pics-here-2597248.html","keywords":null,"creator":null,"video_url":null,"description":"Tim Cook was in attendance at the Arun Jaitley Stadium in Delhi during the game between Delhi Capitals and Kolkata Knight Riders.","content":null,"pubDate":"2023-04-20 17:42:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"Faf, Siraj shine as Royal Challengers Bangalore down Punjab Kings","link":"http://island.lk/faf-siraj-shine-as-royal-challengers-bangalore-down-punjab-kings/","keywords":["Latest News","Sports","Faf du Plesis","IPL2023","Mohammad Siraj","PBKS","Punjab Kings","RCB","Royal Challengers Bangalore","Virat Kohli"],"creator":["Priyan"],"video_url":null,"description":"Fifties from Faf du Plessis and Virat Kohli, along with a career-best performance from Mohammad Siraj, propelled Royal Challengers Bangalore to a 24-run win over Punjab Kings in Match 27 of the 2023 Indian Premier League on Thursday (April 20). Having posted a competitive total of 174, largely on the basis of fifties from Faf […]","content":"Fifties from Faf du Plessis and Virat Kohli, along with a career-best performance from Mohammad Siraj, propelled Royal Challengers Bangalore to a 24-run win over Punjab Kings in Match 27 of the 2023 Indian Premier League on Thursday (April 20). Having posted a competitive total of 174, largely on the basis of fifties from Faf and Kohli, Bangalore withstood a freakish run chase from Punjab to come out on top in Mohali. Brief scores : 174/4 in 20 overs (Faf du Plessis 84, Virat Kohli 59, Harpreet Brar 2-31) in 18.4 overs (Prabhsimran Singh 46, Jitesh Sharma 41, Mohammed Siraj 4-21) by 24 runs Published on By The Indonesian Naval Ship KRI Bima Suci arrived at the port of Colombo on an official visit on Thursday (20th April 2023). The visiting ship was welcomed by the Sri Lanka Navy (SLN) in compliance with naval tradition. KRI Bima Suci is a 112.2m long platform manned by a crew of 95 and she is commanded by Commander M. Sati Lubis The ship is scheduled to depart the island on 22nd April and on her departure she will host a training visit for two SLN Officer Under Trainees. Published on By BBC reported that a lion has been spotted in Chad’s Sena Oura National Park, where the big cats have not been seen since 2004 and were believed to be extinct until now. A photo of a lioness was released by a team of conservationists from the Chad government and the New-York based Wildlife Conservation Society (WCS). “The photo shows a prime, very healthy adult lioness, around five years old,” WCS Big Cat Programme executive director Luke Hunter told the BBC. “I am sure she is not alone,” he said. The image – taken by a remote camera in the protected area back in February – was released on Thursday. “This is hugely encouraging because prime females are the foundation of any lion population, and they are not big wanderers and inhabit areas that have prey and are safe to raise their cubs in,” said Dr Hunter. He added that her presence was an early sign of lions recovering in an adjacent national park in Cameroon. In 2014, the authoritative International Union for Conservation of Nature’s (IUCN) Red List of Threatened Species concluded that lions were extinct in Sena Oura. The WCS says that the region “saw a period of ruthless, organized poaching more than a decade ago, but has since benefited from a very strong commitment to conservation by the governments of both Cameroon and Chad”. “This has produced better protection of the national parks and wildlife populations are now starting to recover,” the organization adds. Dr Hunter says that , the vast majority of which are classified as the southern lion sub-species native to east and southern Africa. There are fewer than 1,000 northern lions in west and central Africa, and they are “especially endangered and precious”, he adds. Published on By BBC reported that a n Indian court has rejected opposition leader Rahul Gandhi’s appeal seeking a stay on his conviction in a criminal defamation case. The decision extends the uncertainty over whether he can contest in national elections due next year. Rahul Gandhi has been sentenced to two years in jail for 2019 comments about Prime Minister Narendra Modi’s surname at an election rally. He won’t be arrested until he has exhausted all legal appeals. Gandhi’s lawyer, Kirit Panwala, told the BBC that they will challenge the decision in the Gujarat high court. Gandhi lost his seat in parliament a day after his conviction on 23 March due to a Supreme Court order which says that a lawmaker convicted in a crime and sentenced to two or more years in jail is disqualified with immediate effect. The Congress has criticised Gandhi’s conviction and accused the governing Bharatiya Janata Party (BJP) of political vendetta. The BJP has denied this, saying that due judicial process was followed in the case. Earlier this month, Gandhi had filed appeals to suspend his sentence, or secure bail, and to suspend his conviction in a court in Surat. The court had granted Gandhi bail to appeal against his conviction, but it’s the stay or suspension of his conviction that’s crucial to reinstating him as an MP. The defamation case against Rahul Gandhi, brought by BJP lawmaker Purnesh Modi, revolved around comments Gandhi made in Karnataka state in 2019 during an election rally: he said. Nirav Modi is a fugitive Indian diamond tycoon while Lalit Modi is a former chief of the Indian Premier League who has been banned for life by the country’s cricket board. Purnesh Modi in his complaint alleged that the comments had defamed the entire Modi community. However, Gandhi said that he made the comment to highlight corruption and it was not directed against any community.","pubDate":"2023-04-20 16:42:03","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"DC vs KKR Live Score: केकेआर ने गंवाया नौंवा विकेट, दिल्ली फ्रंटफुट पर","link":"https://sports.ndtv.com/hindi/cricket/dc-vs-kkr-live-score-ipl-2023-today-28th-match-delhi-capitals-vs-kolkata-knight-riders-live-score-updates-3965233#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Delhi Capitals vs Kolkata Knight Riders 28th Match Live: इंडियन प्रीमियर लीग (IPL 2023) में दिन का दूसरा मुकाबला दिल्ली के अरुण जेटली स्टेडियम में दिल्ली और केकेआर के बीच खेला जा रहा है. जिसमें केकेआर की टीम टॉस हारकर पहले बल्लेबाज़ी कर रही है.","content":"Delhi Capitals vs Kolkata Knight Riders 28th Match Live: इंडियन प्रीमियर लीग (IPL 2023) में दिन का दूसरा मुकाबला दिल्ली के अरुण जेटली स्टेडियम में दिल्ली और केकेआर के बीच खेला जा रहा है. जिसमें दिल्ली कैपिटल्स ने टॉस जीतकर पहले गेंदबाज़ी का फैसला किया है. केकेआर ने पहले बल्लेबाज़ी करते हुए 9 विकेट गंवा दिए हैं. DC vs KKR लाइव स्कोरबोर्डदिल्ली कैपिटल्स ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया. मैच में खेल रहीं दोनों टीमों की फाइनल इलेवन इस प्रकार हैं:मैच में खेल रहीं दोनों टीमों की फाइनल इलेवन इस प्रकार हैं: केकेआर: 1. नितीश राणा (कप्तान) 2. जेसन रॉय 3. लिटन दास 4. वेंकटेश अय्यर 5. मनदीप सिंह 6. आंद्रे रसेल 7. रिंकू सिंह 8. सुनील नरेन 9. कुलवंत खेजरोलिया 10. उमेश यादव 11. वरुण चक्रवर्तीदिल्ली:  1. डेविड वॉर्नर  2. फिलिप सॉल्ट (विकेटकीपर) 3. मिशेल मार्श 4. मनीष पांडेय 5. अक्षर पटेल 6. अमन हाकिम खान  7. ललित यादव 8. कुलदीप यादव 9. एनरिच नॉर्किया 10. ईशांत शर्मा 11. मुकेश कुमारDelhi Capitals vs Kolkata Knight Riders, 28th Match Live Cricket Score","pubDate":"2023-04-20 16:36:31","image_url":"https://c.ndtvimg.com/2023-04/0h1f1qv8_dc-vs-kkr_625x300_20_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"PBKS vs RCB: मोहम्मद सिराज ने किया खुलासा, इस पहलू ने की टॉप फॉर्म हासिल करने में मदद","link":"https://sports.ndtv.com/hindi/cricket/pbks-vs-rcb-player-of-the-match-mohammed-siraj-reveals-what-made-him-to-achieve-top-form-3965871#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Punjab Kings vs Royal Challengers Bangalore: मैच में आरसीबी की कप्तानी करने वाले विराट कोहली ने कहा कि पीसीए आईएस बिंद्रा स्टेडियम की पिच पर बल्लेबाजी करना चुनौतीपूर्ण था. कोहली ने कहा, ‘यह (जीत) हमें एक अजेय टीम नहीं बनाती है या आज से पहले लीग की स्थिति हमें एक बुरी टीम नहीं बनाती है","content":"भारत और रॉयल चैलेंजर्स बैंगलोर (RCB) के तेज गेंदबाज मोहम्मद सिराज (Mohammed Siraj) ने अपनी सफलता का श्रेय कोविड के कारण लागू लॉकडाउन के दौरान की गई कड़ी मेहनत को दिया है. सिराज ने गुरुवार को पंजाब किंग्स के खिलाफ चार विकेट चटकाए जिससे आरसीबी ने 24 रन से जीत दर्ज की. भारत के लिए सिराज सभी प्रारूपों में अंतरराष्ट्रीय क्रिकेट में सबसे प्रभावशाली गेंदबाजों में से एक के रूप में उभरे हैं और उन्होंने जसप्रीत बुमराह की गैरमौजूदगी में जिम्मेदारी अच्छी तरह निभाई है. वह इस साल की शुरुआत में लगभग दो महीने के लिए नंबर एक एकदिनी गेंदबाज भी बने थे.SPECIAL STORIES:\"एटिट्यूड कोहली जैसा, लेकिन टैलेंट रियान पराग का\", फैंस राजस्थानी खिलाड़ी को बख्शने को तैयार नहींबेहतरीन \"गुलाटी कैच\" से आउट हुए विराट कोहली, लेकिन फैस ने दी यह नसीहतसिराज ने मैच के बाद कहा, ‘लॉकडाउन मेरे लिए बहुत महत्वपूर्ण था. मैं इससे पहले काफी निराश था क्योंकि मैं काफी महंगा साबित होता था. मैंने अपने जिम प्रशिक्षण,अपनी गेंदबाजी पर ध्यान केंद्रित किया और मैं अच्छा प्रदर्शन करना चाहता था.'  उन्होंने कहा, ‘‘एकदिनी मैचों में भी मेरी लय अच्छी थी. मेरा आत्मविश्वास ऊंचा था और मैं इसे आईपीएल के इस सत्र में लेकर आया. मैं एक अच्छा क्षेत्ररक्षक हूं. मैं कभी-कभी कुछ गलतियां करता हूं (मुस्कुराते हुए). मैं हमेशा हर पहलू में सुधार करने कोशिश करता हूं, जिससे कि मैं टीम का हिस्सा बना रह सकूं.'मैच में आरसीबी की कप्तानी करने वाले विराट कोहली ने कहा कि पीसीए आईएस बिंद्रा स्टेडियम की पिच पर बल्लेबाजी करना चुनौतीपूर्ण था. कोहली ने कहा, ‘यह (जीत) हमें एक अजेय टीम नहीं बनाती है या आज से पहले लीग की स्थिति हमें एक बुरी टीम नहीं बनाती है. तालिका आपके मूड को परिभाषित नहीं कर सकती है जबकि आपने सिर्फ पांच या छह मैच खेले हैं. हम अपनी प्रक्रिया को जारी रखेंगे. पहले हाफ में परिस्थितियों में काफी बदलाव आया. फैफ (डुप्लेसी) ने शानदार बल्लेबाजी की'उन्होंने कहा, ‘‘हमने अपनी साझेदारी को जितना संभव हो उतना लंबा करने के बारे में सोचा जिससे कि हम अतिरिक्त 20 रन बना सकें. सात या आठ ओवर के बाद गेंद थोड़ी नरम हो गई थी और हमें अपनी रणनीति बदलनी पड़ी. अगर हम टिके रहते तो 190 से 200 रन बना सकते थे. हमें लगा कि इस पिच पर 175 एक अच्छा स्कोर है. मैंने उनसे (टीम के साथियों) कहा कि यह पर्याप्त रन हैं.'नियमित कप्तान शिखर धवन के चोटिल होने के कारण पंजाब किंग्स की अगुआई कर रहे सैम कुरेन ने कोहली और डुप्लेसी की सराहना की जिन्होंने पहले विकेट के लिए 137 रन जोड़े. कुरेन ने कहा, ‘मुझे लगता है कि एक समूह के रूप में हमने वास्तव में अच्छी गेंदबाजी की. फैफ और कोहली जिस तरह से खेले वह अच्छा था. मुझे नहीं लगता था कि वे मुकाबले को हमारे से काफी दूर ले गए. अंत में, हमने बस अच्छी बल्लेबाजी नहीं की. उन्होंने काफी अच्छी गेंदबाजी भी की लेकिन हमने विकेट गंवाए। परिस्थितियां भी काफी अजीब थीं। हमें एक समय लगा कि बारिश होगी.'--- ये भी पढ़ें ---* क्रिकेट ऑस्ट्रेलिया ने किया 'WTC टीम ऑफ द टूर्नामेंट' का ऐलान, कोहली-रोहित को जगह नहीं, लेकिन बाबर आजम टीम में शामिल * श्रीलंका के जादुई स्पिनर 'जयसूर्या' ने टेस्ट क्रिकेट में मचाई खलबली, केवल 6 टेस्ट खेलकर दोहरा दिया ऐतिहासिक कारनामा स्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-04-20 16:35:17","image_url":"https://c.ndtvimg.com/2023-04/jfst86gg_mohammed-siraj_625x300_03_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Lucknow Super Giants outwit Rajasthan Royals in low-scoring contest","link":"http://island.lk/lucknow-super-giants-outwit-rajasthan-royals-in-low-scoring-contest-2/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an […]","content":"Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle. Published on By The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya.","pubDate":"2023-04-21 00:01:53","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Rafael Nadal does not know when he will return from injury","link":"http://island.lk/rafael-nadal-does-not-know-when-he-will-return-from-injury/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, […]","content":"Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle. Published on By The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya.","pubDate":"2023-04-20 23:40:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Jayasuriya makes impressive strides in ICC Rankings","link":"http://island.lk/jayasuriya-makes-impressive-strides-in-icc-rankings/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will […]","content":"Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya.","pubDate":"2023-04-20 23:40:46","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"The 63rd ‘Battle of Mangosteens’ commences at Surrey Village today","link":"http://island.lk/the-63rd-battle-of-mangosteens-commences-at-surrey-village-today/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this […]","content":"The oldest cricket rivals of Kalutara, namely Tissa Central and Kalutara Vidyalaya will meet in the 63rd edition of the Battle of Mangosteens Big Match today and tomorrow at Surrey Village ground. The two schools are among the leading Division II cricket playing schools in Kalutara District. After having fared well in the Under 19 tournament proper this season, victory in the Big Match will be the ultimate goal of the two schools. Of the two teams, Kalutara Vidyalaya, captained by Dinuka Thathsara reached the quarter-finals of the Division II two-day tournament this season. Thathsara will bank on Theekshana Tharaka and Udan Thejaka who have shared closer to 90 wickets between them for success in the bowling department. Thathsara too has captured over 60 wickets this season. Uditha Dilruk ( scored 144 runs against Royal, Panadura) and Hansaka Anupama (105 runs against Revatha, Balapitiya and 109 against Galahitiyawa Central) are the players to watch in the batting department. Unlike their arch rivals, Tissa Central could not reach the knockout stage of the tournament this season. The team captained by Shareen Dhananjaya finished fourth in their group in the first round. Dhananjaya who has scored over 400 runs, Thenuka Ashen Nanayakkara (has accumulated 701 runs, with a century) and deputy skipper Hirusha Nethsara are the key players to watch in the batting department of Tissa Central, while Nadun Asela spearhead their bowling attack. Tissa Central are coached by Rishan Sajith this season, while Pathmanath Perera is the coach of Kalutara Vidyalaya. The Bag Match tally stands 23-7 in favour of Kalutara Vidyalaya. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle.","pubDate":"2023-04-20 23:40:15","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Fourth T20I called off due to hailstorm in Rawalpindi","link":"http://island.lk/fourth-t20i-called-off-due-to-hailstorm-in-rawalpindi/","keywords":["Sports","hailstorm","New Zealand","New Zealand in Pakistan","Pakistan","Rawalpindi","T20I"],"creator":["Priyan"],"video_url":null,"description":"A hailstorm in April, of all things, resulted in the fourth T20I between Pakistan and New Zealand being abandoned towards the tail-end of the first innings Mark Chapman’s unbeaten 42-ball 71 had spearheaded New Zealand’s innings after an early triple-strike from Imad Wasim put the visitors on the backfoot. The recovery had seen them post […]","content":"A hailstorm in April, of all things, resulted in the fourth T20I between Pakistan and New Zealand being abandoned towards the tail-end of the first innings Mark Chapman’s unbeaten 42-ball 71 had spearheaded New Zealand’s innings after an early triple-strike from Imad Wasim put the visitors on the backfoot. The recovery had seen them post their highest total of the series with seven balls still to go, as New Zealand were 164 for 5 when the weather intervened. Brief scores: New Zealand Pakistan Match abandoned Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle.","pubDate":"2023-04-20 22:21:01","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Delhi Capitals clinch thriller to end three-week wait for first points","link":"http://island.lk/delhi-capitals-clinch-thriller-to-end-three-week-wait-for-first-points/","keywords":["Sports","Arun Jaitley Stadium","Cricket","DC","Delhi Capitals","IPL2023","KKR","Kolkota Knight Riders"],"creator":["Priyan"],"video_url":null,"description":"The Delhi Capitals finally got on the board after a three-week, sixth match wait, in front of their home crowd at the Arun Jaitley Stadium. After a spirited bowling performance from the home team, the batting got off to a flying start, with a flurry of boundaries from David Warner to set the tone, despite […]","content":"The Delhi Capitals finally got on the board after a three-week, sixth match wait, in front of their home crowd at the Arun Jaitley Stadium. After a spirited bowling performance from the home team, the batting got off to a flying start, with a flurry of boundaries from David Warner to set the tone, despite the regular fall of wickets at the other end. The wicket of Warner caused a panic, but eventually, the Capitals stumbled home and heaved a sigh of relief, earning themselves a long-awaited win. Brief Scores: Kolkata Knight Riders 127 all-out in 20 overs (Jason Roy 43, Andre Russell 38*, Axar Patel 2-13, Kuldeep Yadav 2-15) Delhi Capitals 128-6 (David Warner 57, Varun Chakravarthy 2-16, Nitish Rana 2-17, Anukul Roy 2-19) by 4 wickets. Published on By Marcus Stonis’s all-round efforts (a 16-ball 21 & 2-28) helped Lucknow Super Giants secure a 10-run win over Rajasthan Royals, in Jaipur, to retain the second spot on the points table. After posting 154 for 7, courtesy Kyle Mayers’ half-century and Nicholas Pooran’s late blitz, the visitors restricted Royals to 144 for 6, despite an 87-run opening stand by Jos Buttler and Yashasvi Jaiswal. Lucknow Super Giants’ start was extremely slow. Trent Boult’s tight lines notwithstanding, KL Rahul and Kyle Mayers didn’t attempt too many attacking strokes. The left-arm pacer bowled 11 dot balls in his first two overs. The openers managed only 37 runs in the powerplay, with the former going at run-a-ball 17 and the latter even slower – 18-ball 16. It was the lowest score registered in the powerplay without the loss of a wicket in IPL 2023. On a pitch that stayed low despite being hard on the surface, shot-making was difficult. The duo brought up their half-century stand in 46 balls, but then broke free for a few overs. Mayers flatbatted Jason Holder for a six over the long off boundary and followed it up by off-driving Chahal for another maximum in the next over. KL Rahul also joined his opening partner in the attack, by hitting a boundary and a six in those two overs. By the time the duo was separated – when Rahul holed out to Buttler at long on, after being put down twice earlier in the innings (on 6 and 12) – LSG had picked up pace, at 82 for 1 in 10.4 overs. In a space of 20 balls, Rajasthan Royals struck four times. Following Rahul’s dismissal, Boult returned to bowl his final over and cleaned up Ayush Badoni, who missed out on a lap shot. Ashwin then struck twice in an over, having Deepak Hooda caught at deep midwicket and cleaning up Mayers, reducing LSG to 104 for 4 in 14 overs. Boult, who had finished his spell by then, returned figures of 1 for 16. While most batters struggled to get going early on, Stonis got off the mark by reverse-sweeping Ashwin for a boundary. The hard-hitting Australian was able to rotate the strike easily but Nicholas Pooran, his partner at the other end, struggled for the majority of his stay. However, Pooran turned it around in the penultimate over when he took down Jason Holder, hammering his fellow West Indian for two boundaries and a six in a 17-run over. With what seemed like a below-par total, Jos Buttler and Yashasvi Jaiswal were content in going slow early on. While Jaiswal managed only 1 run in his first five balls, Buttler was pacing at 5 runs in 14 balls before cracking his first boundary. While both the batters took some risks, and even managed 47 runs in the powerplay, they seemed in little difficulty. Barring one thick edge off Jaiswal that was dropped by Naveen ul haq at short third while he was batting on 22, in the sixth over, there wasn’t much threat from the bowlers on a slowish wicket. The duo went on to add 87 runs for the opening wicket before the southpaw was eventually dismissed in the 12th over, cutting to Avesh at short third. Even at that point, Buttler was comfortably cruising at run-a-ball 35. The stutter started with the fall of Sanju Samson, who was short of his crease while attempting a quick single amidst some miscommunication over the run with his partner, Buttler. The opener followed soon after, getting caught at deep midwicket. Hard lengths with slower balls worked well on the surface that was playing slow and low, not allowing the batters to time their shots well, especially with one end of the boundary being extremely long. Stoinis used that to good effect, and bagged the wickets of the LSG openers. The tactic allowed LSG to strangle RR’s scoring and even paved the way for the wickets of batters who went early in their shots, like Shimron Hetmyer a couple of overs later, when he top-edged an Avesh delivery to Rahul at long on. LSG also slipped to a similar position – 104 for 4 – but in 15.1 overs. Devdutt Padikkal, who was brought in as an Impact Substitute, smashed Stonis for three boundaries in this final over, but Riyan Parag’s struggles from the other end didn’t help. The required rate kept climbing quickly, and despite three boundaries off Stoinis’s last over, RR were left needing 19 runs in the final over. With an additional fielder inside the 30-yard circle due to LSG’s slow over rate, Avesh Khan was up against a nervy challenge which he aced despite getting hit for a boundary off the first ball. He had Padikkal caught behind and Dhruv Jorel caught at long on to end RR’s hopes. Rajasthan Royals Published on By Rafael Nadal says he is in a “difficult” situation as he does not know when he will return from his injury lay-off.He was initially ruled out for six to eight weeks with a hip injury but has now not played since 18 January.Nadal confirmed he will miss the Madrid Open, which starts on 25 April, and there is doubt over his participation at the French Open in May. “The injury still hasn’t healed,” the 36-year-old Spaniard said. “I can’t work out what I need to compete. I was training, but now a few days ago we decided to change course a bit, do another treatment and see if things improve to try to get to what comes next,” he explained in a video posted on his social media channels. “I can’t give deadlines because if I knew I would tell you but I don’t know. This is how things are now.” Nadal, who won his 14th French Open title last year, was diagnosed with a tear in his left psoas muscle after losing in the second round of the Australian Open in January.The 22-time Grand Slam winner added: “I have no choice but to try to have the right attitude throughout this time, try to give myself the opportunity to compete in one of the tournaments that remains of the clay season and I have no choice but to work and be with the right mentality.” The French Open starts on 28 May.Meanwhile, Olympic champion Belinda Bencic says she will miss both Madrid and Rome’s clay tournaments because of “discomfort” in her hip. The Swiss said she was struggling with the injury throughout the WTA Tour’s United States swing, despite still making the Charleston Open final.Bencic said she has taken the decision to help her be 100% fit for Roland Garros. Published on By Time was when Sri Lanka had world’s top ranked batsman and bowler in Test match cricket. While Muttiah Muralitharan dominated the bowling charts for years, Kumar Sangakkara reigned as world’s top batter rubbing shoulders with contemporaries like Brian Lara, Rahul Dravid, Ricky Ponting, Sachin Tendulkar and Jacques Kallis. It seems that soon Sri Lanka will have at least a bowler dominating the charts with left-arm spinner Prabath Jayasuriya making impressive strides in his brief Test career. Jayasuriya, a late bloomer having made his Test debut last year past his 30th birthday is currently ranked 19th, having leaped 13 slots following his match bag of ten wickets having guided Sri Lanka to an innings and 280 run win over Ireland in Galle this week. Jayasuriya has featured in only six Tests so far and already has 43 victims to his name including five five wicket hauls. He is in line to become the fastest Sri Lankan to reach 50 Test wickets. The record is currently held by off-spinners Dilruwan Perera and Ramesh Mendis, who both reached the milestone in their 11th Tests. Jayasuriya could own the Sri Lankan record in his seventh Test itself, narrowly missing the World Record for the landmark. Almost 140 years ago, Australian quick Charlie Turner achieved the milestone in his sixth Test match. Englishman Tom Richardson and Vernon Philander got there in seven Tests and along with them Jayasuriya is set to become joint second fastest bowler to the record. Jayasuriya was ranked 32nd prior to the Ireland Test but made rapid strides as he claimed career best seven for 52 in the first innings and followed it up with three scalps in the second essay. Apart from Muttiah Muralitharan, the only other Sri Lankan to be ranked top bowler in the world was Rangana Herath. Another rich haul in the second Test could see Jayasuriya finishing among the top ten bowlers. Sanga was the only Sri Lankan batter to be ranked number one. Jayasuriya has earned plaudits of his captain Dimuth Karunaratne for the progress he has made in Test cricket in such a short span. Karunaratne who smashed 179 advanced to the ninth spot in the rankings making him the only Sri Lankan in top ten. Dinesh Chandimal, who posted a hundred, is currently ranked 14th while Kusal Mendis is in 42nd position. The second Test between the teams begins next week in Galle.","pubDate":"2023-04-20 22:07:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"IPL 2023: Apple CEO Tim Cook Spotted At Delhi Capitals Vs Kolkata Knight Riders Clash With Sonam Kapoor, See Pics Here","link":"https://zeenews.india.com/cricket/ipl-2023-apple-ceo-tim-cook-spotted-at-delhi-capitals-vs-kolkata-knight-riders-clash-with-sonam-kapoor-see-pics-here-2597248.html","keywords":null,"creator":null,"video_url":null,"description":"Tim Cook was in attendance at the Arun Jaitley Stadium in Delhi during the game between Delhi Capitals and Kolkata Knight Riders.","content":null,"pubDate":"2023-04-20 17:42:00","image_url":null,"source_id":"zeenews","category":["sports"],"country":["india"],"language":"english"},{"title":"Faf, Siraj shine as Royal Challengers Bangalore down Punjab Kings","link":"http://island.lk/faf-siraj-shine-as-royal-challengers-bangalore-down-punjab-kings/","keywords":["Latest News","Sports","Faf du Plesis","IPL2023","Mohammad Siraj","PBKS","Punjab Kings","RCB","Royal Challengers Bangalore","Virat Kohli"],"creator":["Priyan"],"video_url":null,"description":"Fifties from Faf du Plessis and Virat Kohli, along with a career-best performance from Mohammad Siraj, propelled Royal Challengers Bangalore to a 24-run win over Punjab Kings in Match 27 of the 2023 Indian Premier League on Thursday (April 20). Having posted a competitive total of 174, largely on the basis of fifties from Faf […]","content":"Fifties from Faf du Plessis and Virat Kohli, along with a career-best performance from Mohammad Siraj, propelled Royal Challengers Bangalore to a 24-run win over Punjab Kings in Match 27 of the 2023 Indian Premier League on Thursday (April 20). Having posted a competitive total of 174, largely on the basis of fifties from Faf and Kohli, Bangalore withstood a freakish run chase from Punjab to come out on top in Mohali. Brief scores : 174/4 in 20 overs (Faf du Plessis 84, Virat Kohli 59, Harpreet Brar 2-31) in 18.4 overs (Prabhsimran Singh 46, Jitesh Sharma 41, Mohammed Siraj 4-21) by 24 runs Published on By The Indonesian Naval Ship KRI Bima Suci arrived at the port of Colombo on an official visit on Thursday (20th April 2023). The visiting ship was welcomed by the Sri Lanka Navy (SLN) in compliance with naval tradition. KRI Bima Suci is a 112.2m long platform manned by a crew of 95 and she is commanded by Commander M. Sati Lubis The ship is scheduled to depart the island on 22nd April and on her departure she will host a training visit for two SLN Officer Under Trainees. Published on By BBC reported that a lion has been spotted in Chad’s Sena Oura National Park, where the big cats have not been seen since 2004 and were believed to be extinct until now. A photo of a lioness was released by a team of conservationists from the Chad government and the New-York based Wildlife Conservation Society (WCS). “The photo shows a prime, very healthy adult lioness, around five years old,” WCS Big Cat Programme executive director Luke Hunter told the BBC. “I am sure she is not alone,” he said. The image – taken by a remote camera in the protected area back in February – was released on Thursday. “This is hugely encouraging because prime females are the foundation of any lion population, and they are not big wanderers and inhabit areas that have prey and are safe to raise their cubs in,” said Dr Hunter. He added that her presence was an early sign of lions recovering in an adjacent national park in Cameroon. In 2014, the authoritative International Union for Conservation of Nature’s (IUCN) Red List of Threatened Species concluded that lions were extinct in Sena Oura. The WCS says that the region “saw a period of ruthless, organized poaching more than a decade ago, but has since benefited from a very strong commitment to conservation by the governments of both Cameroon and Chad”. “This has produced better protection of the national parks and wildlife populations are now starting to recover,” the organization adds. Dr Hunter says that , the vast majority of which are classified as the southern lion sub-species native to east and southern Africa. There are fewer than 1,000 northern lions in west and central Africa, and they are “especially endangered and precious”, he adds. Published on By BBC reported that a n Indian court has rejected opposition leader Rahul Gandhi’s appeal seeking a stay on his conviction in a criminal defamation case. The decision extends the uncertainty over whether he can contest in national elections due next year. Rahul Gandhi has been sentenced to two years in jail for 2019 comments about Prime Minister Narendra Modi’s surname at an election rally. He won’t be arrested until he has exhausted all legal appeals. Gandhi’s lawyer, Kirit Panwala, told the BBC that they will challenge the decision in the Gujarat high court. Gandhi lost his seat in parliament a day after his conviction on 23 March due to a Supreme Court order which says that a lawmaker convicted in a crime and sentenced to two or more years in jail is disqualified with immediate effect. The Congress has criticised Gandhi’s conviction and accused the governing Bharatiya Janata Party (BJP) of political vendetta. The BJP has denied this, saying that due judicial process was followed in the case. Earlier this month, Gandhi had filed appeals to suspend his sentence, or secure bail, and to suspend his conviction in a court in Surat. The court had granted Gandhi bail to appeal against his conviction, but it’s the stay or suspension of his conviction that’s crucial to reinstating him as an MP. The defamation case against Rahul Gandhi, brought by BJP lawmaker Purnesh Modi, revolved around comments Gandhi made in Karnataka state in 2019 during an election rally: he said. Nirav Modi is a fugitive Indian diamond tycoon while Lalit Modi is a former chief of the Indian Premier League who has been banned for life by the country’s cricket board. Purnesh Modi in his complaint alleged that the comments had defamed the entire Modi community. However, Gandhi said that he made the comment to highlight corruption and it was not directed against any community.","pubDate":"2023-04-20 16:42:03","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"DC vs KKR Live Score: केकेआर ने गंवाया नौंवा विकेट, दिल्ली फ्रंटफुट पर","link":"https://sports.ndtv.com/hindi/cricket/dc-vs-kkr-live-score-ipl-2023-today-28th-match-delhi-capitals-vs-kolkata-knight-riders-live-score-updates-3965233#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Delhi Capitals vs Kolkata Knight Riders 28th Match Live: इंडियन प्रीमियर लीग (IPL 2023) में दिन का दूसरा मुकाबला दिल्ली के अरुण जेटली स्टेडियम में दिल्ली और केकेआर के बीच खेला जा रहा है. जिसमें केकेआर की टीम टॉस हारकर पहले बल्लेबाज़ी कर रही है.","content":"Delhi Capitals vs Kolkata Knight Riders 28th Match Live: इंडियन प्रीमियर लीग (IPL 2023) में दिन का दूसरा मुकाबला दिल्ली के अरुण जेटली स्टेडियम में दिल्ली और केकेआर के बीच खेला जा रहा है. जिसमें दिल्ली कैपिटल्स ने टॉस जीतकर पहले गेंदबाज़ी का फैसला किया है. केकेआर ने पहले बल्लेबाज़ी करते हुए 9 विकेट गंवा दिए हैं. DC vs KKR लाइव स्कोरबोर्डदिल्ली कैपिटल्स ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया. मैच में खेल रहीं दोनों टीमों की फाइनल इलेवन इस प्रकार हैं:मैच में खेल रहीं दोनों टीमों की फाइनल इलेवन इस प्रकार हैं: केकेआर: 1. नितीश राणा (कप्तान) 2. जेसन रॉय 3. लिटन दास 4. वेंकटेश अय्यर 5. मनदीप सिंह 6. आंद्रे रसेल 7. रिंकू सिंह 8. सुनील नरेन 9. कुलवंत खेजरोलिया 10. उमेश यादव 11. वरुण चक्रवर्तीदिल्ली:  1. डेविड वॉर्नर  2. फिलिप सॉल्ट (विकेटकीपर) 3. मिशेल मार्श 4. मनीष पांडेय 5. अक्षर पटेल 6. अमन हाकिम खान  7. ललित यादव 8. कुलदीप यादव 9. एनरिच नॉर्किया 10. ईशांत शर्मा 11. मुकेश कुमारDelhi Capitals vs Kolkata Knight Riders, 28th Match Live Cricket Score","pubDate":"2023-04-20 16:36:31","image_url":"https://c.ndtvimg.com/2023-04/0h1f1qv8_dc-vs-kkr_625x300_20_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"PBKS vs RCB: मोहम्मद सिराज ने किया खुलासा, इस पहलू ने की टॉप फॉर्म हासिल करने में मदद","link":"https://sports.ndtv.com/hindi/cricket/pbks-vs-rcb-player-of-the-match-mohammed-siraj-reveals-what-made-him-to-achieve-top-form-3965871#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Punjab Kings vs Royal Challengers Bangalore: मैच में आरसीबी की कप्तानी करने वाले विराट कोहली ने कहा कि पीसीए आईएस बिंद्रा स्टेडियम की पिच पर बल्लेबाजी करना चुनौतीपूर्ण था. कोहली ने कहा, ‘यह (जीत) हमें एक अजेय टीम नहीं बनाती है या आज से पहले लीग की स्थिति हमें एक बुरी टीम नहीं बनाती है","content":"भारत और रॉयल चैलेंजर्स बैंगलोर (RCB) के तेज गेंदबाज मोहम्मद सिराज (Mohammed Siraj) ने अपनी सफलता का श्रेय कोविड के कारण लागू लॉकडाउन के दौरान की गई कड़ी मेहनत को दिया है. सिराज ने गुरुवार को पंजाब किंग्स के खिलाफ चार विकेट चटकाए जिससे आरसीबी ने 24 रन से जीत दर्ज की. भारत के लिए सिराज सभी प्रारूपों में अंतरराष्ट्रीय क्रिकेट में सबसे प्रभावशाली गेंदबाजों में से एक के रूप में उभरे हैं और उन्होंने जसप्रीत बुमराह की गैरमौजूदगी में जिम्मेदारी अच्छी तरह निभाई है. वह इस साल की शुरुआत में लगभग दो महीने के लिए नंबर एक एकदिनी गेंदबाज भी बने थे.SPECIAL STORIES:\"एटिट्यूड कोहली जैसा, लेकिन टैलेंट रियान पराग का\", फैंस राजस्थानी खिलाड़ी को बख्शने को तैयार नहींबेहतरीन \"गुलाटी कैच\" से आउट हुए विराट कोहली, लेकिन फैस ने दी यह नसीहतसिराज ने मैच के बाद कहा, ‘लॉकडाउन मेरे लिए बहुत महत्वपूर्ण था. मैं इससे पहले काफी निराश था क्योंकि मैं काफी महंगा साबित होता था. मैंने अपने जिम प्रशिक्षण,अपनी गेंदबाजी पर ध्यान केंद्रित किया और मैं अच्छा प्रदर्शन करना चाहता था.'  उन्होंने कहा, ‘‘एकदिनी मैचों में भी मेरी लय अच्छी थी. मेरा आत्मविश्वास ऊंचा था और मैं इसे आईपीएल के इस सत्र में लेकर आया. मैं एक अच्छा क्षेत्ररक्षक हूं. मैं कभी-कभी कुछ गलतियां करता हूं (मुस्कुराते हुए). मैं हमेशा हर पहलू में सुधार करने कोशिश करता हूं, जिससे कि मैं टीम का हिस्सा बना रह सकूं.'मैच में आरसीबी की कप्तानी करने वाले विराट कोहली ने कहा कि पीसीए आईएस बिंद्रा स्टेडियम की पिच पर बल्लेबाजी करना चुनौतीपूर्ण था. कोहली ने कहा, ‘यह (जीत) हमें एक अजेय टीम नहीं बनाती है या आज से पहले लीग की स्थिति हमें एक बुरी टीम नहीं बनाती है. तालिका आपके मूड को परिभाषित नहीं कर सकती है जबकि आपने सिर्फ पांच या छह मैच खेले हैं. हम अपनी प्रक्रिया को जारी रखेंगे. पहले हाफ में परिस्थितियों में काफी बदलाव आया. फैफ (डुप्लेसी) ने शानदार बल्लेबाजी की'उन्होंने कहा, ‘‘हमने अपनी साझेदारी को जितना संभव हो उतना लंबा करने के बारे में सोचा जिससे कि हम अतिरिक्त 20 रन बना सकें. सात या आठ ओवर के बाद गेंद थोड़ी नरम हो गई थी और हमें अपनी रणनीति बदलनी पड़ी. अगर हम टिके रहते तो 190 से 200 रन बना सकते थे. हमें लगा कि इस पिच पर 175 एक अच्छा स्कोर है. मैंने उनसे (टीम के साथियों) कहा कि यह पर्याप्त रन हैं.'नियमित कप्तान शिखर धवन के चोटिल होने के कारण पंजाब किंग्स की अगुआई कर रहे सैम कुरेन ने कोहली और डुप्लेसी की सराहना की जिन्होंने पहले विकेट के लिए 137 रन जोड़े. कुरेन ने कहा, ‘मुझे लगता है कि एक समूह के रूप में हमने वास्तव में अच्छी गेंदबाजी की. फैफ और कोहली जिस तरह से खेले वह अच्छा था. मुझे नहीं लगता था कि वे मुकाबले को हमारे से काफी दूर ले गए. अंत में, हमने बस अच्छी बल्लेबाजी नहीं की. उन्होंने काफी अच्छी गेंदबाजी भी की लेकिन हमने विकेट गंवाए। परिस्थितियां भी काफी अजीब थीं। हमें एक समय लगा कि बारिश होगी.'--- ये भी पढ़ें ---* क्रिकेट ऑस्ट्रेलिया ने किया 'WTC टीम ऑफ द टूर्नामेंट' का ऐलान, कोहली-रोहित को जगह नहीं, लेकिन बाबर आजम टीम में शामिल * श्रीलंका के जादुई स्पिनर 'जयसूर्या' ने टेस्ट क्रिकेट में मचाई खलबली, केवल 6 टेस्ट खेलकर दोहरा दिया ऐतिहासिक कारनामा स्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-04-20 16:35:17","image_url":"https://c.ndtvimg.com/2023-04/jfst86gg_mohammed-siraj_625x300_03_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"}]}