{"newsArray":[{"title":"Abdullah shines as warm-up match in SL ends in draw","link":"https://www.thenews.com.pk/print/973429-abdullah-shines-as-warm-up-match-in-sl-ends-in-draw","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Opener Abdullah Shafique scored 63 off 111 balls on the last day of the three-day warm-up match between Pakistan and Sri Lanka Cricket XI at the Colts Cricket Club Ground here in Colombo.Pakistan, in their second innings, were 178 for two on stumps.Abdullah and Imam added 61 runs for the...","content":null,"pubDate":"2022-07-14 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"South Africa's 2022 ODI series in Australia cancelled","link":"https://www.thenews.com.pk/print/973424-south-africa-s-2022-odi-series-in-australia-cancelled","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY: South Africa have cancelled their men’s one-day international series scheduled for Australia in January, it was confirmed Wednesday.Matches on January 12, 14 and 17 in Hobart, Sydney and Perth have been scrapped said Cricket Australia, after South Africa’s request for new dates...","content":null,"pubDate":"2022-07-14 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Team to complete Sri Lanka tour: PCB","link":"https://www.thenews.com.pk/print/973426-team-to-complete-sri-lanka-tour-pcb","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: As a state of emergency was declared amid growing countrywide protests in Sri Lanka, Pakistan Cricket Board has ruled out any extreme decision, saying that it is in touch with the host nation's cricket board and Pakistan High Commission about the safety and security of the...","content":null,"pubDate":"2022-07-14 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Cancelled tour delivers star power to BBL","link":"https://www.cairnspost.com.au/sport/cricket/big-bash/bbl-202223-australian-stars-to-be-available-after-south-africa-series-canned/news-story/794b5ab7fc8c14266887f9a2e2916547","keywords":["Big Bash News","Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Channel 7 may be at war with Cricket Australia but it is said to be “overall really happy” with a Big Bash schedule which could now see more Test players featuring.","content":null,"pubDate":"2022-07-13 23:35:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Banana bill of Rs 35L, ‘death threats’: Uttarakhand cricket under cloud","link":"https://indianexpress.com/article/sports/cricket/banana-bill-of-rs-35l-death-threats-uttarakhand-cricket-under-cloud-8027735/","keywords":["Cricket","Sports"],"creator":["Pratyush Raj"],"video_url":null,"description":null,"content":"OVER Rs 1.74 CRORE for food and catering, including Rs 35 lakh for bananas; Rs 49.5 lakh in daily allowances; Rs 11 crore spent during the Covid lockdown; non-payment of players’ dues; dodgy selection policies. And then, extortion and death threats. The Cricket Association of Uttarakhand (CAU) is in the middle of a storm of allegations, ranging from financial impropriety to intimidation of players. So much so that CAU secretary Mahim Verma, the team’s head coach Manish Jha and the association spokesperson Sanjay Gusain were questioned by the Uttarakhand Police after they were named in an FIR by the father of a former India Under-19 cricketer for alleged extortion and death threats. “For the past three days, we have called Mahim Verma, Manish Jha and Sanjay Gusain separately. We have interrogated them. We have taken their statements,” Janmejaya Khanduri, SSP Dehradun, told The Indian Express . “If needed, it will be done again.” Subscriber Only Stories View All Premium The true meaning of Tantra Premium Uber obtained Delhi rape victim’s medical records ‘illegally’, prompting ... Premium Roe vs Wade: Myth of the ideologically neutral judge Premium On Gujarat 2002, the wheel has come full circle Subscribe Now to get 66% OFF Top Sports News Now Virat Kohli rested but selectors keep World T20 door open Shami the forgotten white-ball virtuoso returns to ODIs after 591-day gap, scripts new record Cricket taking football route: Bilaterals to be friendly, World Cups real deal Click here for more The FIR, registered at Vasant Vihar police station in Dehradun, has been filed under IPC sections for criminal conspiracy (120B), voluntarily causing hurt (323), extortion (384), intentional insult (504) and criminal intimidation (506). The complainant Virendra Sethi, who is the father of former Under-19 player Arya Sethi, has alleged that his son was given death threats by Jha, team manager Navneet Mishra and video analyst Piyush Raghuvanshi during the Vijay Hazare tournament last year. According to records reviewed by The Indian Express and interviews with players, this is just the latest chapter in Uttarakhand cricket’s troubled innings. The players point to non-payment or under-payment of dues (Rs 100 paid as DA when the mandated amount is Rs 1,500) and not being provided food during tournaments and training camps — the association’s books list expenses totalling several lakhs of rupees on items such as bananas and water bottles, even during the pandemic. More From Political Pulse Opp flounders, Sena’s move ensures Murmu walkover In Sena's decision to support Murmu, an open door and a signal from Uddhav to BJP Mahua Moitra: I will not tiptoe around religion just because everyone is scared to take on the BJP’s narrative of a homogenous faith Click here for more The CAU’s audit report of March 31, 2020, has listed Rs 1,74,07,346 for food and catering and Rs 49,58,750 for daily allowances. This includes Rs 35 lakh for bananas and Rs 22 lakh for water bottles. Robin Bisht, an outstation professional for the Uttarakhand team, corroborated Sethi’s allegations, and recalled an incident before the recent Ranji Trophy quarterfinal against Mumbai. “We returned to the team hotel and, after our recovery session in the pool, went for lunch. The hotel staff said they were told not to serve us food. When we called the team manager, he replied: ‘Order something from Swiggy or Zomato or stay hungry. Ek din khana nahi khaoge toh mar nahi jaoge (If you don’t eat for a day, you won’t die)’,” said Bisht. Uttarakhand lost the match to Mumbai by 725 runs — a world record victory margin in cricket. “Next day, we had a flight to Delhi. After exiting the airport, we again called up our team manager to say that we needed to go to Dehradun. ‘Where is our bus?’ The reply came, ‘book a cab, bus or train. Our job was to get you guys to Delhi, not your homes’,” said Bisht. Allegations of corruption have also been levelled against CAU by Independent MLA Umesh Kumar in the Uttarakhand Legislative Assembly. “During Covid, CAU distributed Rs 6.5 crore as professional fees. I want to know to whom they paid this money? Before March 2020, the professional fees were around Rs 2.75 crore. During Covid, who had lunch and dinner of Rs 1.27 crore? How did they hire cricketing coaches? I raised this in Uttarakhand Sadan too. I think the BCCI should intervene; there is very big corruption going on here,” Kumar told The Indian Express. Buy Now | Our best subscription plan now has a special price “During lockdown when everything was shut, they invested Rs 11 crore, and under full operation, you are investing Rs 12 crore,” Kumar said. The players, meanwhile, complained of being paid much lower than what the BCCI regulations stipulate. “Our official DA is Rs 1,500, we were getting Rs 100 per day. We got Rs 2,700 for 27 days; an unskilled labourer earned more than us,” said Bisht. MLA Kumar said he has brought the matter to the state government’s notice. “Me and 12 other MLAs have written to the Chief Minister, and if need be, we will go to the Supreme Court. The Lodha Committee was appointed by the Supreme Court, and ‘Mr Verma and Company’ are not following the court’s regulations,” Kumar said. In his police complaint, Sethi alleged that Verma demanded Rs 10 lakh for including his son in the state team. These allegations come after former India opener Wasim Jaffer had to leave his post as head coach after allegations of “communalising” the dressing room — charges that Jaffer strongly denied. CAU secretary Mahim Verma and president Jot Singh Gansola also face a complaint from their own association’s vice-president Sanjay Rawat and joint secretary Avnish Verma before the state cricket body’s Ombudsman and Ethics Officer, alleging financial irregularities. “We have sent a letter to the BCCI as well. The Ethics officer has told Mahim Verma and Jot Singh Gansola to submit their response by Thursday,” said Rawat. Speaking to The Indian Express, a top BCCI official said: “Right now, it is a matter related to a state association. In case it is raised at the BCCI’s apex council meeting on July 21, we will look into it.” Mahim Verma and head coach Manish Jha did not respond to calls from The Indian Express seeking comment on the allegations against them. UPSC Key | The Indian Express helps you prepare for the Civil Services and other competitive exams with cues on how to read and understand content. Read here","pubDate":"2022-07-13 22:25:48","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Psychologist sessions helped propel Billy Vunipola back into England fold","link":"https://uk.sports.yahoo.com/news/psychologist-sessions-helped-propel-billy-210042519.html?src=rss","keywords":["Sports"],"creator":["PA Media: Sport"],"video_url":null,"description":"Vunipola will start Saturday’s series decider against Australia at Sydney Cricket Ground.","content":"Vunipola will start Saturday’s series decider against Australia at Sydney Cricket Ground.","pubDate":"2022-07-13 21:00:42","image_url":null,"source_id":"yahoo_hk","country":["hong kong"],"category":["sports"],"language":"chinese"},{"title":"You don’t take rest during IPL: Gavaskar slams seniors for frequent breaks","link":"https://kashmirreader.com/2022/07/14/you-dont-take-rest-during-ipl-gavaskar-slams-seniors-for-frequent-breaks/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"NEW DELHI: Batting great Sunil Gavaskar has questioned the commitment of the senior India players, saying he “doesn’t agree” with cricketers skipping international series but playing the IPL without a break. Gavaskar’s remarks came after senior players Virat Kohli, Rohit Sharma, Jasprit Bumrah, Hardik Pandya and Rishabh Pant were rested for the upcoming ODI series […]","content":"NEW DELHI: Batting great Sunil Gavaskar has questioned the commitment of the senior India players, saying he “doesn’t agree” with cricketers skipping international series but playing the IPL without a break. Gavaskar’s remarks came after senior players Virat Kohli, Rohit Sharma, Jasprit Bumrah, Hardik Pandya and Rishabh Pant were rested for the upcoming ODI series against the West Indies. “See, I do not agree with this concept of players resting. Not at all. You don’t take rest during IPL, then why ask for it while playing for India? I don’t agree with it. You will have to play for India. Don’t talk about rest,” Gavaskar said. “There are only 20 overs in an innings in T20. That does not take any toll on your body. In Test matches, the mind and the body take a toll, I get that. But I don’t think there is many problems in T20 cricket,” he added. The former captain said the BCCI will be better off intervening in this “rest policy”. “I honestly feel that the BCCI needs to look into this concept of rest. All the Grade A cricketers have received very good contracts. They receive payment for every match. Tell me if there is any company whose CEO, or MDs get so much time off? “I feel that if Indian cricket is to become more professional, a line needs to be drawn. If you want to be rested, you need to reduce your guarantees. Then you take rest, because you don’t want to play. But how can anyone say that I don’t want to play for the Indian team. Which is why I do not agree to the concept,” Gavaskar said. Shikhar Dhawan was named captain for the three ODIs against the West Indies in the absence of regular skipper Rohit. The games in the West Indies are the only ODIs India will play before the T20 World Cup in Australia. After the ODIs, India will play five T20Is against the West Indies in the Caribbean and the United States. —PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-07-13 19:12:33","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Exciting to get seam swing in white-ball cricket’: Bumrah after England win","link":"https://kashmirreader.com/2022/07/14/exciting-to-get-seam-swing-in-white-ball-cricket-bumrah-after-england-win/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"LONDON: Star India pacer Jasprit Bumrah said swing from ball one made his job easier and more exciting as he ended with a career-best six-wicket haul in the first ODI against England here on Tuesday. Swing and seam in white-ball cricket is a rare sight but it has been a stand-out feature in England, including […]","content":"LONDON: Star India pacer Jasprit Bumrah said swing from ball one made his job easier and more exciting as he ended with a career-best six-wicket haul in the first ODI against England here on Tuesday. Swing and seam in white-ball cricket is a rare sight but it has been a stand-out feature in England, including the three T20s. Bumrah’s devastating spell set up India’s massive 10-wicket win at The Oval. “When there’s swing and seam movement, it is very exciting in white-ball cricket to get that opportunity because you have to be defensive with the kind of pitches we usually get. “When I bowled the first ball, I found some swing and we tried to exploit that. When it doesn’t swing, I have to pull my lengths back. When the ball is doing something you don’t have to try a lot. When the wicket is flat your accuracy is tested. It is a good place to be when the ball is swinging,” he said at the post-match presentation ceremony. India mauled England by 10 wickets in the first ODI of the three-match series to take a 1-0 lead. With the ball moving in the air, the Indian pacers decided to bowl fuller. “As soon as Shami bowled the first over, we had a conversation to go fuller. Very happy for him, he gets a lot of wickets. I told him when he beats the bat, that there would be days when he’d run through the side,” Bumrah said referring to Mohammed Shami’s three-wicket haul. Skipper Rohit Sharma and Shikhar Dhawan shared a century stand for the 18th time to complete India’s emphatic win. The pull shot was the hallmark of Rohit’s classy 76 off 58 balls. “Shikhar and me understand each other quite well, except for the first ball where there was that misjudgement. He is playing ODIs after a long time. We know what he brings to the table for us,” Rohit said. “Experienced player and he has done well for us in the past in these conditions. The hook is a high-risk shot, I understand that, but as long as it comes out right, I am happy,” he said. England skipper Jos Buttler was surprised by the movement on offer. “Very tough day to take, but we’ve got to dust ourselves down quickly. Little surprised by the movement, bit muggy. India exposed the conditions superbly. They have bowled really well in the powerplay,” he said. “It is something we need to discuss and work out. We have some guys in the form of their lives in Tests coming here and getting nicked off. Jasprit is a great bowler to come up against. He has bowled fantastically well today and deserves these figures,” said Buttler. —PTI   Press Trust of Indiakashmirreader.com","pubDate":"2022-07-13 19:12:25","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma ODI centuries against all teams: Rohit Sharma total ODI centuries list","link":"https://thesportsrush.com/cricket-news-rohit-sharma-odi-centuries-against-all-teams-rohit-sharma-total-odi-centuries-list/","keywords":["Cricket","India","Rohit Sharma"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma ODI centuries against all teams: The Indian captain has 29 centuries to his name in ODI cricket. It doesn’t seem like for some reason but India captain Rohit Sharma hasn’t scored an ODI century for almost two and a half years now. Interestingly, Sharma has only played seven out of India’s 22 ODIs… The post Rohit Sharma ODI centuries against all teams: Rohit Sharma total ODI centuries list appeared first on The SportsRush.","content":"Rohit Sharma ODI centuries against all teams: The Indian captain has 29 centuries to his name in ODI cricket. It doesn’t seem like for some reason but India captain Rohit Sharma hasn’t scored an ODI century for almost two and a half years now. Interestingly, Sharma has only played seven out of India’s 22 ODIs since his last ODI century against Australia in Bengaluru. Sharma, who has scored 244 runs in these seven innings at an average and strike rate of 40.66 and 103.38 respectively including a couple of half-centuries, returned to the format after 17 months in the first England vs India ODI at The Oval yesterday. Sharma, who scored 76* (58) with the help of seven fours and five sixes in a winning cause, registered his 45th ODI half-century, 33rd as an opener, 16th away from home, seventh in England, fourth as captain and third against England on Tuesday. Having made his ODI debut in 2007, it wasn’t until 2010 when Sharma had reached the three-figure mark for the first time. Sharma, who took 42 ODIs before scoring his maiden century, ensured to score two in a row during a triangular series against Zimbabwe and Sri Lanka. Sharma, who didn’t score another century for the next 59 matches, scored one against Australia in Jaipur in 2013. Having already opened the batting in close to 20 ODIs by this time that year, there was no looking back for the right-hand batter. Rohit Sharma ODI centuries against all teams Arguably the biggest turnarounds with respect to an ODI career in cricket, Sharma has scored a total of 29 centuries in the format till date. Fourth on the list of most ODI centuries, Sharma needs another century to equal former Australia captain Ricky Ponting (30). In what remains the best year of his ODI career, Sharma had scored as many as seven ODI centuries in 2019. While Sharma has three ODI centuries in Birmingham, he has a couple of them in Bulawayo, Melbourne and Kanpur each. Rohit Sharma total ODI centuries list S. No. Runs Balls 4s 6s Opposition Ground Year 1 114 119 6 4 Zimbabwe Bulawayo 2010 2 101* 100 6 2 Sri Lanka Bulawayo 2010 3 141* 123 17 4 Australia Jaipur 2013 4 209 158 12 16 Australia Bengaluru 2013 5 264 225 33 9 Sri Lanka Kolkata 2014 6 138 139 9 4 Australia Melbourne 2015 7 137 126 14 3 Bangladesh Melbourne 2015 8 150 133 13 6 South Africa Kanpur 2015 9 171* 163 13 7 Australia Perth 2016 10 124 127 11 3 Australia Brisbane 2016 11 123* 129 15 1 Bangladesh Birmingham 2017 12 124* 145 16 2 Sri Lanka Pallekele 2017 13 104 88 11 3 Sri Lanka Colombo 2018 14 125 109 11 5 Australia Nagpur 2017 15 147 138 18 2 New Zealand Kanpur 2017 16 208* 153 13 12 Sri Lanka Mohali 2017 17 115 126 11 4 South Africa Gqeberha 2018 18 137* 114 15 4 England Nottingham 2018 19 111* 119 7 4 Pakistan Dubai 2018 20 152* 117 15 8 West Indies Guwahati 2018 21 162 137 20 4 West Indies Mumbai (BS) 2018 22 133 129 10 6 Australia Sydney 2019 23 122* 144 13 2 South Africa Southampton 2019 24 140 113 14 3 Pakistan Manchester 2019 25 102 109 15 0 England Birmingham 2019 26 104 92 7 5 Bangladesh Birmingham 2019 27 103 94 14 2 Sri Lanka Leeds 2019 28 159 138 17 5 West Indies Visakhapatnam 2019 29 119 128 8 6 Australia Bengaluru 2020 The post Rohit Sharma ODI centuries against all teams: Rohit Sharma total ODI centuries list appeared first on The SportsRush.","pubDate":"2022-07-13 17:45:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs ENG 2nd ODI live streaming: When and where to watch India vs England in London","link":"https://www.dnaindia.com/cricket/report-ind-vs-eng-2nd-odi-live-streaming-when-and-where-to-watch-india-vs-england-in-london-2968419","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Know all the details about the upcoming 2nd ODI match between India vs England which will be played in Lord's Cricket Stadium, London.","content":null,"pubDate":"2022-07-13 17:07:05","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/07/13/2522224-fotojet-9.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Ravichandran Ashwin opens up on why LBW should come into play when a batter attempts to switch hit","link":"https://www.indiatvnews.com/sports/cricket/ravichandran-ashwin-opens-up-on-why-lbw-should-come-into-play-when-a-batter-attempts-to-switch-hit-2022-07-13-791868","keywords":null,"creator":null,"video_url":null,"description":"Be it any player, be it an umpire or any cricket expert, everybody accepts the fact that Ravichandran Ashwin is one of the smartest thinkers in the game. Many times Ravichandran Ashwin has spoken about the spirit of the game and has been very vocal about how he plans and sets a batsman up. Recently, he opened up on how he had planned against Steven Smith, arguably one of the greatest Test batsmen of all time when India toured Australia for the 2020-21 Border Gavaskar Trophy. The mankading incident that sparked controversy in the 2019 IPL had Ashwin into all sorts of problems, but he later explained why it was both within the laws and the spirit of the game.","content":"Be it any player, be it an umpire or any cricket expert, everybody accepts the fact that Ravichandran Ashwin is one of the smartest thinkers in the game. Many times Ravichandran Ashwin has spoken about the spirit of the game and has been very vocal about how he plans and sets a batsman up. Recently, he opened up on how he had planned against Steven Smith, arguably one of the greatest Test batsmen of all time when India toured Australia for the 2020-21 Border Gavaskar Trophy. The mankading incident that sparked controversy in the 2019 had Ashwin into all sorts of problems, but he later explained why it was both within the laws and the spirit of the game. Ashwin who mostly features for India in the Test matches has now opened up on why LBWs should be inflicted on the batsman when he attempts a switch hit. Ashwin who has taken 442 wickets in 86 matches does not mince his words when it comes to the technicalities of the gentleman's game. When England had toured India in 2021 and experts from all corners were targeting Indian curators, Ashwin was the first one to come out and defend the Indian turfs and questioned their views about the game. \"My question is not whether the batsman can reverse sweep or not, whether it falls under the genre of negative bowling strategy or not (bowling outside leg stump), my point is about inflicting LBW on the batsman who is trying to outplay the bowler by trying the switch hit. It's unfair that it's not ruled LBW. There is no issue if the batters play the switch hit, but the bowlers should be given LBW when the batter misses. You can't say that it is not LBW when the batter turns. Once you start giving that out in all formats of the game, some parity could be retained between bowling and batting\", said Ashwin.","pubDate":"2022-07-13 16:47:59","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Moeen Ali looks at India series as a learning curve for Buttler and co.","link":"https://www.indiatvnews.com/sports/cricket/moeen-ali-looks-at-india-series-as-a-learning-curve-for-buttler-and-co-2nd-odi-lords-jos-buttler-2022-07-13-791863","keywords":null,"creator":null,"video_url":null,"description":"India has been on a rampant run in their current white-ball series against England. When England defeated India in the one-off Test match and chased down a historic 378 runs, it was perceived that they will continue their dominant run in the white-ball tour too, but India had some other ideas in mind. The men in blue under the leadership of Rohit Sharma broke the shackles of the traditional method of playing cricket and took an aggressive approach. India's gameplay decimated England as they lost the T20I series by 2-1.","content":"India has been on a rampant run in their current white-ball series against England. When England defeated India in the one-off Test match and chased down a historic 378 runs, it was perceived that they will continue their dominant run in the white-ball tour too, but India had some other ideas in mind. The men in blue under the leadership of broke the shackles of the traditional method of playing cricket and took an aggressive approach. India's gameplay decimated England as they lost the T20I series by 2-1. Later on, India took the field against England at the Oval without the batting prowess of and . The entire competition was built around India's bowling and England's batting. brought his A-game to the table as he claimed his career-best six wickets for nineteen runs. He was joined in by who did not let the English batsmen take off and scalped three English wickets. The English team was bundled out for 110 runs with top-scoring with 30 runs. Meanwhile, English and Chennai Super Kings (CSK) all-rounder has opened up on the recent happenings of the India series. Ali stressed the fact that the England team isn't panicking at the moment and the team is more than capable to make an astonishing comeback. Moeen further said that the entire English team wants to get back on track and start winning games before they head into the T20I World Cup that is scheduled to be played in Australia later this year. With a new captain in Jos Buttler and a new white-ball coach Matthew Motts, the English outfit has a lot of planning to do and they will want to identify their mistakes and work towards them before they take the field against India for the second ODI which is to be played at Lord's, a match that is crucial for the English team, a match that will determine the result of the series.","pubDate":"2022-07-13 16:17:26","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma record at Lords London: Rohit Sharma Lord’s innings list in ODI history","link":"https://thesportsrush.com/cricket-news-rohit-sharma-record-at-lords-london-rohit-sharma-lords-innings-list-in-odi-history/","keywords":["Cricket","England","India","India tour of England 2022","Rohit Sharma"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma record at Lords: The Indian captain would be hoping to bank on a fluent half-century in the first ODI yesterday. India captain Rohit Sharma scoring a half-century in the first ODI against England at The Oval yesterday wasn’t a massive relief just because he played a fluent knock in a winning cause. It… The post Rohit Sharma record at Lords London: Rohit Sharma Lord’s innings list in ODI history appeared first on The SportsRush.","content":"Rohit Sharma record at Lords: The Indian captain would be hoping to bank on a fluent half-century in the first ODI yesterday. India captain Rohit Sharma scoring a half-century in the first ODI against England at The Oval yesterday wasn’t a massive relief just because he played a fluent knock in a winning cause. It was a massive relief because he managed to cross the 50-run mark for the first time in the last five months. Sharma, whose last half-century in competitive cricket had come in a home ODI against West Indies in February, scored 290 runs in 14 innings across international formats at an average of 20.71 in this period. Sharma’s run-drought also comprised of 14 Indian Premier League 2022 innings. In what was Sharma’s worst IPL season , it was only the second time when he failed to cross the 300-run mark in an IPL season. ALSO READ: Lord’s ODI records and highest innings total For a batter of his class to not score a half-century for a combined total of 28 innings had it in it to become a cause of concern for his fans. With the right-hand batter hitting seven fours and five sixes at a strike rate of 131.03 on Tuesday, Sharma would be wanting to build on this start in an ICC T20 World Cup year. Set to play the second ODI against England at Lord’s tomorrow, Sharma will return to the iconic venue after less than a year. In what will be Sharma’s sixth international appearance at this venue, he has scored 133 runs in five innings across formats at the highest level over the years. Final touches 👌 #LoveLords | #ENGvIND pic.twitter.com/r9h9XXSxap — Lord’s Cricket Ground (@HomeOfCricket) July 13, 2022 Sharma’s solitary half-century at Lord’s had come in a Test match last year when he had returned with a 83 (145) in a 126-opening partnership alongside KL Rahul. Sharma’s only Lord’s ODI had come exactly four years ago from tomorrow. Opening the batting with Shikhar Dhawan in an unsuccessful 323-run chase, Sharma had scored 15 (26) comprising of two fours before being dismissed by Mark Wood.","pubDate":"2022-07-13 15:51:55","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Valley investment firm plans Arizona's first cricket stadium in the West Valley","link":"https://www.abc15.com/news/business/valley-investment-firm-plans-arizonas-first-cricket-stadium-in-the-west-valley","keywords":null,"creator":null,"video_url":null,"description":"The Phoenix metro could soon be home to the one of the largest cricket stadiums in the country as the sport continues rising in popularity across the U.S.","content":"BUCKEYE, AZ — The Phoenix metro could soon be home to the one of the largest cricket stadiums in the country as the sport continues rising in popularity across the U.S. Glendale-based Mangat Group , a real estate investment and development company, plans to build a $50 million facility, called MG Cricket Stadium in Buckeye, one of the fastest-growing communities in the state and the country. The facility will comprise a 20,000-seat stadium to serve the international cricket community and be the first cricket stadium built in the state, the company said. It will also feature a state-of-the-art soccer field, 20 practice batting cages, two pickleball courts and a 20,000-square-foot clubhouse. The overall facility will be developed on about 30 acres north of Interstate 10 and Miller Road. Construction is expected to start in the first quarter of 2023, while the facility is expected to be completed by early 2024, said Mangat Group, which is also building a large sports complex in Glendale . Read more of this story from the Business Journal.","pubDate":"2022-07-13 15:40:20","image_url":null,"source_id":"abc15","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"KL Rahul on his road to recovery; takes first net session at National Cricket Academy","link":"https://www.indiatvnews.com/sports/cricket/kl-rahul-on-his-road-to-recovery-takes-first-net-session-at-national-cricket-academy-nca-2022-07-13-791856","keywords":null,"creator":null,"video_url":null,"description":"There is some good news coming out from the National Cricket Academy (NCA) as team India batsman KL Rahul has been training in the nets and it seems possible that he will regain full fitness by the time the Indian team has completed their Caribbean tour and head into the Asia Cup in late August. KL Rahul was expected to lead India against South Africa in the five-match T20I series played on the home turf but had to miss out owing to a groin injury after IPL 2022.","content":"There is some good news coming out from the National Cricket Academy (NCA) as team India batsman has been training in the nets and it seems possible that he will regain full fitness by the time the Indian team has completed their Caribbean tour and head into the Asia Cup in late August. KL Rahul was expected to lead India against South Africa in the five-match T20I series played on the home turf but had to miss out owing to a groin injury after 2022. The Indian batsman had to head to Germany last month to get his hernia surgery done. As per reports Rahul had sustained the injury on the eve of the first T20I match that India was to play against South Africa in Delhi. What was considered a mild strain initially soon aggravated into a serious injury and Rahul had to miss the entire English tour as he had surgery to be done. Since he is still recovering from the injury, he will not be a part of the Indian outfit when they travel to the West Indies for 3 ODIs and 5 T20Is. When BCCI announced the ODI team for the Caribbean tour, Rahul's name was not on the list and it is now being speculated that the Indian vice-captain will now wear the national colors straightaway in Asia Cup. Few pictures came out of the National Cricket Academy (NCA) where KL Rahul was seen batting. Rahul was seen defending the ball in what looked like a light net session. The Indian vice-captain was spotted wearing only one pad to avoid any kind of further stress to his body. He was mostly taking short strides and used his wrists to work the ball around. KL Rahul, the 30-year-old Indian batsman has played 42 Tests, 42 ODIs, and 56 T20Is for India in the last eight years.","pubDate":"2022-07-13 15:38:01","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket taking football route: Bilaterals to be friendly, World Cups real deal","link":"https://indianexpress.com/article/sports/cricket/cricket-taking-football-route-bilaterals-to-be-friendly-world-cups-real-deal-8027487/","keywords":["Cricket","Sports"],"creator":["Rahul Pandey"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-13 15:26:07","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Joe Root record at Lords London: Joe Root Lord’s innings list in ODI history","link":"https://thesportsrush.com/cricket-news-joe-root-record-at-lords-london-joe-root-lords-innings-list-in-odi-history/","keywords":["Cricket","England","India","India tour of England 2022","Joe Root"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Joe Root record at Lords: The English batter will be playing his 26th international match at Lord’s tomorrow. Playing an ODI after more than a year, all that England batter Joe Root could last was for a couple of deliveries in the first ODI against India at The Oval yesterday. Part of a batting collapse… The post Joe Root record at Lords London: Joe Root Lord’s innings list in ODI history appeared first on The SportsRush.","content":"Joe Root record at Lords: The English batter will be playing his 26th international match at Lord’s tomorrow. Playing an ODI after more than a year, all that England batter Joe Root could last was for a couple of deliveries in the first ODI against India at The Oval yesterday. Part of a batting collapse in front of India fast bowler Jasprit Bumrah, Root failed to adjust to extra bounce ending up edging the ball to Rishabh Pant behind the wickets. Joe Root record at Lords London Root, who has batted only thrice in white-ball cricket since the start of 2021, would be keen to bring his stellar Test form to this format in the second ODI at Lord’s tomorrow. With England trailing by 0-1 in the series, the home team would be expecting one of their premium batters to contribute in order to not lose the series with a match to be played on Sunday. Root, who averages in excess of 50 in both Tests and ODIs at this venue, wouldn’t have received a better ground to find white-ball rhythm. In 40 international innings across formats at Lord’s, Root’s 1,975 runs have come at an average of 54.86 comprising of six half-centuries and seven half-centuries. Speaking particularly about his eight ODIs here, Root has scored 365 runs at an average and strike rate of 52.14 and 81.29 respectively. Where in the world will you be following #ENGvIND at Lord’s on Thursday? #LoveLords | @oriswatches pic.twitter.com/ZTYdAWjCz8 — Lord’s Cricket Ground (@HomeOfCricket) July 13, 2022 While Root’s last ODI at Lord’s remains the final of ICC Cricket World Cup 2019, his last ODI against India at this venue was a witness to him scoring a match-winning 113* (116) with the help of eight fours and a six. Joe Root Lord’s innings list in ODI history Runs Balls 4s 6s Opposition Year 30 40 1 0 New Zealand 2013 43 68 1 0 Sri Lanka 2014 89 108 5 0 Pakistan 2016 73 73 8 0 Ireland 2017 2 5 0 0 South Africa 2017 113* 116 8 1 India 2018 8 9 2 0 Australia 2019 7 30 0 0 New Zealand 2019 The post Joe Root record at Lords London: Joe Root Lord’s innings list in ODI history appeared first on The SportsRush.","pubDate":"2022-07-13 15:25:19","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Is Man Utd vs Melbourne Victory on TV? Channel, live stream, kick-off time and team news for pre-season friendly","link":"https://www.thesun.ie/sport/football/9094437/man-utd-vs-melbourne-victory-tv-channel-live-stream-kick-off-time-team-news-friendly/","keywords":["Football","Sport","Explainers","Match previews","Premier League"],"creator":["Sam Street"],"video_url":null,"description":"ERIK TEN HAG is in full charge at Man Utd and fans will be desperate for the next game to arrive. The Red Devils secured a thrilling 4-0 win over rivals Liverpool in the Dutchman’s first match in Bangkok. And now they head to Australia to take on Melbourne Victory. What time does Man Utd […]","content":"ERIK TEN HAG is in full charge at Man Utd and fans will be desperate for the next game to arrive. The Red Devils secured a thrilling 4-0 win over rivals Liverpool in the Dutchman’s first match in Bangkok. AFPMan Utd hammered Liverpool 4-0 in Erik ten Hag’s opening game[/caption] Ex-Man Utd star Nani has just joined Melbourne VictoryGetty And now they head to Australia to take on Melbourne Victory. What time does Man Utd vs Melbourne Victory kick off? Man Utd take on Melbourne Victory on Friday, July 15.The match kicks off at 11.05am UK time – 8.05pm local time.It will be held at the Melbourne Cricket Ground. Is Man Utd vs Melbourne Victory on TV and can I live stream it? Man Utd vs Melbourne Victory is live on MUTV for UK viewers.A subscription to the channel costs £7.99/month or £29.99/year.This will also allow you to stream games online. Team news Man Utd could come up against a former favourite with 35-year-old winger Nani racing to be fit for Melbourne Victory. Captain Harry Maguire did not feature for United against Liverpool but is expected to return to the starting line-up for this match. New signing Tyrell Malacia could earn himself a first start along with Donny van de Beek and Anthony Elanga. David de Gea may have to be replaced in goal by Tom Heaton after going off with a knock against Liverpool. Most read in Football GUNN SHOW Arsenal announce 33-man squad to travel on US pre-season tour AXEL OUT Axel Tuanzebe forced to quit Man Utd pre-season tour with 'personal issue' A WORLD AWAY Wayne & Coleen are 'oceans apart' after he jets to US for DC United job WAYNE PAIN Rooney spoke to Coleen before DC United job and says she will NOT join him in US WATCHING ROO Coleen wants her brother to chaperone Wayne on US trip after boozy incidents De Danger De Gea hands Man Utd injury scare as he walks straight down tunnel vs Liverpool","pubDate":"2022-07-13 15:23:52","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Lancashire v Somerset, Yorkshire v Surrey and more: county cricket – live!","link":"https://www.theguardian.com/sport/live/2022/jul/13/cricket-county-championship-lancashire-somerset-yorkshire-surrey-live-updates","keywords":["County Championship","Cricket","Sport"],"creator":["Tanya Aldred"],"video_url":null,"description":"Latest updates from day three around the groundsDay two roundup: Cook and Harmer deliver for EssexAnd email Tanya, tweet @tjaldred or comment belowLloyd and Byrom making it look easy at Sophia Gardens, Glam 112-0; while Rushworth has picked up a third, and Salisbury a first, at Chester le Street. Derby 44-4.Just browsing all the enjoyable chat BTL, wasn’t expecting six degrees of separation between CCLive and Rishi Sunak - who I learnt today is the same height as Tendulkar. Continue reading...","content":null,"pubDate":"2022-07-13 15:08:33","image_url":"https://i.guim.co.uk/img/media/196480033010fa7491a396e274e8860f3402d877/423_671_4091_2456/master/4091.jpg?width=460&quality=85&auto=format&fit=max&s=9117bb49d8147be76a864e19412080cd","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Mohammed Shami returns to One Day International Cricket after 3 years, claims 150 wickets","link":"https://www.indiatvnews.com/sports/cricket/mohammed-shami-returns-to-one-day-international-cricket-after-3-years-claims-150-wickets-2022-07-13-791845","keywords":null,"creator":null,"video_url":null,"description":"The Mohammed Shami story is something that is truly inspirational and has many facets of determination and how it propels an individual to break the barriers of personal trauma and give his very best for the nation whenever asked. When Virat Kohli took over the captaincy from MS Dhoni, the Indian Test team was in all kinds of trouble and was placed seventh in the ICC Test rankings. With Virat Kohli at the helm of Indian cricket, he completely transformed how Test cricket was being played. According to Mohammed Shami, the former Indian skipper had made it very clear that he needs the fast bowlers to take twenty wickets and contribute to a winning cause much more than the batsmen.","content":"The story is something that is truly inspirational and has many facets of determination and how it propels an individual to break the barriers of personal trauma and give his very best for the nation whenever asked. When took over the captaincy from , the Indian Test team was in all kinds of trouble and was placed seventh in the ICC Test rankings. With Virat Kohli at the helm of Indian cricket, he completely transformed how Test cricket was being played. According to Mohammed Shami, the former Indian skipper had made it very clear that he needs the fast bowlers to take twenty wickets and contribute to a winning cause much more than the batsmen. Virat's process saw the rise of one of the fierce India pace batteries which include the likes of Japrit Bumrah, Md. Siraj, Bhuvaneshwar Siraj, and Mohammed Shami. The change in the attitude of the fast bowlers carried over to the ODIs from the Test matches and to this date, they are dominating world cricket. India decimated England in the first ODI and bundled them out for 110. claimed a total of six wickets and joining him in his exploits was Mohammed Shami who claimed a total of three wickets. Mohammed Shami made his comeback in ODI cricket after a long layoff that spanned three years, but with his very first over he showed everybody including the opposition that why he is hailed as one of the greatest fast bowlers India has ever produced. When asked about the mindset that he had, Mohammed Shami was very quick to respond and said that he entered the field with a clear approach and knew exactly what to do on the cricket field. \"It was a break of three years and by any means, it wasn't a small one. When I was preparing for the series, I had no thoughts about the gap. I am extremely comfortable with the team as it has been more than a decade now that I have been traveling with them. After playing so much international cricket, everybody is clear about their role\", said Shami who picked 150 ODI wickets at the Oval while playing against England.","pubDate":"2022-07-13 14:29:39","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"India's Ravichandran Ashwin admits concerns over relevance of ODI cricket: It is just an extended form of T20","link":"https://www.indiatoday.in/sports/cricket/story/india-s-ravichandran-ashwin-admits-concerns-over-relevance-of-odi-cricket-it-is-just-an-extended-form-of-t20-1975242-2022-07-13?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Indian off-spinner Ravichandran Ashwin admits concerns over relevance of ODI cricket","content":null,"pubDate":"2022-07-13 14:12:22","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"“It is quite scary”: R Ashwin expresses concerns around Bazball affecting future of Test cricket","link":"https://thesportsrush.com/it-is-quite-scary-r-ashwin-expresses-concerns-around-bazball-affecting-future-of-test-cricket/","keywords":["Cricket","Bazball","Brendon McCullum","R Ashwin"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Indian spinner R Ashwin has expressed his concern about the way the English team is approaching the game known as Bazball. The fortunes of the English test team changed after the appointment of Brendon McCullum as the head coach of the side. England sacked Chris Silverwood after a disappointing Ashes, and Joe Root also stepped… The post “It is quite scary”: R Ashwin expresses concerns around Bazball affecting future of Test cricket appeared first on The SportsRush.","content":"Indian spinner R Ashwin has expressed his concern about the way the English team is approaching the game known as Bazball. The fortunes of the English test team changed after the appointment of Brendon McCullum as the head coach of the side. England sacked Chris Silverwood after a disappointing Ashes, and Joe Root also stepped down as the captain of the side. Brendon McCullum’s first assignment was against the World Test Championship’s winners New Zealand, and they completed a whitewash. The way England approached the game was praised all around the world, and especially the Trent Bridge game was applauded by all. England then played against India in Birmingham, where they chased the record test target in England and won the match convincingly in the end. The way England is playing the game is now being called “BazBall” on the nickname of Brendon McCullum, Baz. R Ashwin expresses concerns on Bazball Indian off-spinner R Ashwin featured in the Vaughany and Tuffers Cricket Club podcast, where he talked about the impact of “Bazball” on test cricket. Ashwin said that watching “Bazball” as a bowler is quite scary, but he is unsure about its sustainability. He said that the pitches and balls have played an important part in the process. “It was amazing to watch, but as a bowler it is quite scary to think where the game is headed,” R Ashwin said. “I definitely think the ball and the pitches have a role to play in how England are playing, permitting a certain brand of cricket.” “I think we need to be careful about this brand of cricket being the way forward. Test cricket has been the same for hundreds of years and there will be games and series that are played like that. Whether it’s the same brand of cricket you play all along is very debatable.” Bazball triumphing over Dravid, first edition. pic.twitter.com/zrtjYsSH0O — Abhishek Mukherjee (@ovshake42) July 5, 2022 Ashwin was dropped from the recent test against England at Birmingham, and some experts questioned India’s decision of dropping him. He has scalped 442 test wickets, and he is India’s best off-spinner in history.   The post “It is quite scary”: R Ashwin expresses concerns around Bazball affecting future of Test cricket appeared first on The SportsRush.","pubDate":"2022-07-13 14:04:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Hyderabad cricketer Pranavi set to play for Ealing Cricket Club in Middlesex League","link":"https://telanganatoday.com/hyderabad-cricketer-pranavi-set-to-play-for-ealing-cricket-club-in-middlesex-league","keywords":["Cricket","Hyderabad","News","Sport","Arjun Tendulkar","Ealing Cricket Club","Middlesex league","V Pranavi Chandra"],"creator":["Telangana Today"],"video_url":null,"description":"Hyderabad: Hyderabad woman cricketer V Pranavi Chandra set to play for the Ealing Cricket Club in the Middlesex League where Sachin Tendulkar’s son Arjun Tendulkar also plays for the men’s side. The 20-year-old started playing cricket in 2018 and made her debut in 2019 as a captain for the Hyderabad U-19 team. In the same […]","content":"Hyderabad: Hyderabad woman cricketer V Pranavi Chandra set to play for the Ealing Cricket Club in the Middlesex League where Sachin Tendulkar’s son Arjun Tendulkar also plays for the men’s side. The 20-year-old started playing cricket in 2018 and made her debut in 2019 as a captain for the Hyderabad U-19 team. In the same year, she got selected for the U-23 Hyderabad team where she was made the vice-captain. Pranavi recently played for the team Velocity in the Women’s Challenger T20 in Pune. Earlier, she also played for the same Ealing Cricket Club in Middlesex league and has a best score of an unbeaten 75 and a four-wicket haul.","pubDate":"2022-07-13 13:54:30","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricketer Shikhar Dhawan collaborates with Web3 startups, Bliv. Club and WIOM to launch the first sports city in the metaverse","link":"https://www.thehindubusinessline.com/news/sports/cricketer-shikhar-dhawan-collaborates-with-web3-startups-bliv-club-and-wiom-to-launch-the-first-sports-city-in-the-metaverse/article65635032.ece","keywords":null,"creator":["\n        Isha Rautela  \n    "],"video_url":null,"description":"The sports city in the metaverse will be home to cricket stadiums, a sportsplex, sports cafe, gym, e-sports zone, cottages, running tracks, 3D immersive sports museum and sports library","content":null,"pubDate":"2022-07-13 13:52:46","image_url":null,"source_id":"thehindubusinessline","country":["india"],"category":["sports"],"language":"english"},{"title":"Aakash Chopra claims India's pace sensation Umran Malik isn't ready for international cricket at the moment","link":"https://www.indiatoday.in/sports/cricket/story/aakash-chopra-claims-india-s-pace-sensation-umran-malik-isn-t-ready-for-international-cricket-at-the-moment-1975237-2022-07-13?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Umran Malik is not ready for international cricket as of now: Aakash Chopra","content":null,"pubDate":"2022-07-13 13:44:03","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"ODI cricket needs to find its relevance, says Ravichandran Ashwin while talking about the 50 over format","link":"https://www.dnaindia.com/cricket/report-odi-cricket-needs-to-find-its-relevance-says-ravichandran-ashwin-while-talking-about-the-50-over-format-2968348","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Ravichandran Ashwin said that the ODI format has to find its relevance and admitted to switching off the television when an ODI match is on.","content":null,"pubDate":"2022-07-13 12:14:51","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/07/13/2522147-2519947-r-ashwin-twitter.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"“It’s extremely important to come with a clear mind”: Mohammed Shami talks about his succesful ODI comeback after two years","link":"https://thesportsrush.com/cricket-news-its-extremely-important-to-come-with-a-clear-mind-mohammed-shami-talks-about-his-succesful-odi-comeback-after-two-years/","keywords":["Cricket","England","India","India tour of England 2022","Mohammed Shami"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Mohammed Shami made his ODI comeback and bowled a fine spell against England to complete the milestone of 150 ODI wickets. Team India defeated England by a huge margin of 10 wickets at the Kennington Oval. The pacers of the Indian team were at their very best in the match, and they bowled out England… The post “It’s extremely important to come with a clear mind”: Mohammed Shami talks about his succesful ODI comeback after two years appeared first on The SportsRush.","content":"Mohammed Shami made his ODI comeback and bowled a fine spell against England to complete the milestone of 150 ODI wickets. Team India defeated England by a huge margin of 10 wickets at the Kennington Oval. The pacers of the Indian team were at their very best in the match, and they bowled out England for just 110 runs. Jasprit Bumrah was the pick of the bowlers, where he scalped six wickets and bowled the third-best ODI spell in Indian cricket history. Shami also bowled a fine spell, where he scalped three wickets and completed the milestone of 150 ODI wickets. Mohammed Shami became the fastest Indian to reach 150 ODI wickets during his spell at the Kennington Oval. After the match, Shami gave an interview to Indian bowling coach Paras Mhambrey, where he said that it’s important to come with a clear mindset on the pitch. He said that he exactly knew what to do in the match, and the conditions were also favouring the pace bowling. Shami insists that being courageous from the heart is quite important to get set in any format of the game. “It’s extremely important to come with a clear mind as you already know what you need to do, where you need to pitch the ball, the variations in white-ball and everyone knows these basics. But you need to be courageous from the heart and if you are that, then you can get set in any format at any given moment,” Shami said on the video uploaded by BCCI. Picking his 1⃣5⃣0⃣th ODI wicket 👏 Bowling in tandem with @Jaspritbumrah93 🤝 @MdShami11 discusses it all with Bowling Coach Paras Mhambrey after #TeamIndia ‘s comprehensive win in the first #ENGvIND ODI. 👍 👍 – By @RajalArora Full interview 🎥 🔽 https://t.co/OX5XkQT9cW pic.twitter.com/8YoEFmpZGj — BCCI (@BCCI) July 13, 2022 Shami was playing his first ODI after a spell of almost 19 months, he played his last ODI in November 2020 against Australia at the SCG. He said that it was not a small break, but he has become very comfortable with the team as they have travelled a lot together, and there were no question marks in his head. “It was not a small break but of three years [19 months],” Shami said on the video uploaded by BCCI. “Nothing was going on in my head regarding the (long) gap. I’ve become very comfortable with the team; we travel together and have been playing together for like a decade now.”","pubDate":"2022-07-13 12:13:20","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Wasn't thinking about break from ODI, already knew what I had to do: Shami","link":"https://timesofindia.indiatimes.com/sports/cricket/india-in-england/wasnt-thinking-about-break-from-odi-already-knew-what-i-had-to-do-says-mohammed-shami/articleshow/92854348.cms","keywords":null,"creator":null,"video_url":null,"description":"Seasoned India pacer Mohammed Shami said he wasn't thinking about his long lay off from ODI cricket and approached his comeback game with a clear mind as he is well-versed with the white-ball behaviour. The first ODI against England on Monday was Shami's first appearance in the format after almost a gap of two years. He last played in India's 51-run loss to Australia in November 2020.","content":"LONDON: Seasoned India pacer Mohammed Shami said he wasn't thinking about his long lay off from ODI cricket and approached his comeback game with a clear mind as he is well-versed with the white-ball behaviour. The first ODI against England on Monday was Shami's first appearance in the format after almost a gap of two years. He last played in India's 51-run loss to Australia in November 2020. \"It wasn't a small break but of three years,\" Shami, who claimed 3 for 31 at the Oval on Tuesday, said during a chat with bowling coach Paras Mhambrey on BCCI.tv. \"Nothing was going on in my head regarding the gap. I've become very comfortable with the team. We travel together and have been playing together for like a decade now. Picking his 1⃣5⃣0⃣th ODI wicket 👏Bowling in tandem with @Jaspritbumrah93 🤝@MdShami11 discusses it all with Bowli… https://t.co/TFCATJwDwm — BCCI (@BCCI) 1657692463000 \"Everyone knows their job and after playing so much of cricket, if you come with a question mark in your mind, then I believe it's not good.\" It was also a milestone match for Shami who became the fastest Indian and third fastest bowler overall to take 150 scalps in ODI cricket. \"It's extremely important to come with a clear mind as you already know what you need to do, where you need to pitch the ball, the variations in white-ball and everyone knows these basics. Read Also 'Still raw': Has Umran Malik been fast-tracked into the Indian team too soon? Umran Malik's ability to conjure raw pace made many say that he needs to be fast-tracked into the Indian senior team. Others however were sceptical about rushing this process. There's no doubt that Umran is a very special talent. Bowling at the kind of speeds he generates is something that is a \"But you need to be courageous from heart and if you are that, then you can get set in any format at any given moment.\" While Shami claimed three wickets, fellow pacer Jasprit Bumrah finished with a career-best 6 for 19 to blow away hosts England in the first ODI. \"As soon as we started, the ball was stopping and seaming, it became important for us to pick our areas and keep line and length in control. \"We played our best performance (in the first ODI); like, the way a series has to be started, it set an example.\" Read Also Jasprit Bumrah back to No.1 in ICC ODI Player Rankings Fast bowler Jasprit Bumrah has regained the top spot in the ICC men's ODI Player Rankings after fashioning India's 10-wicket win over England with a career-best haul of six for 19 in the first game at The Oval. Shami said the key was to keep things simple and put pressure on the batters from both ends. \"The only thing to be kept in mind was if the area will be great on a pitch where it swings and seams, you bowl with great pace from both ends and makes life difficult for (batting teams) on a wicket like this. \"We kept things simple, got to fetch wickets quickly and the result is there for all to see.\" Shami feels not much needs to be changed if the conditions remain the same in the next two games. \"Personally speaking, reverting back to keeping it simple theory will be the best. If the wicket behaves a little differently, then you need to think a bit more,\" he said. \"If you take the confidence from here to rest of matches, then the chances are there for being more successful. \"But if the wicket is dry or slow, then the plans can be changed. But to carry confidence from here is very important.\" India lead the three-match series 1-0.","pubDate":"2022-07-13 12:11:42","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Ravichandran Ashwin stresses on ODI cricket and how it needs to find relevance","link":"https://www.indiatvnews.com/sports/cricket/ravichandran-ashwin-stresses-on-odi-cricket-and-how-it-needs-to-find-relevance-2022-07-13-791816","keywords":null,"creator":null,"video_url":null,"description":"With the T20 World Cup fast approaching, all the major international teams have been playing loads of T20 cricket along with Test matches. One Day Internationals had taken a backseat for some time, but it seems that the teams have one eye set on the ODI World Cup that is to be played in India next year.","content":null,"pubDate":"2022-07-13 12:08:41","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Ganton CC set to defend Hospital Bowl in final against Wykeham CC","link":"https://www.thescarboroughnews.co.uk/sport/cricket/ganton-cc-set-to-defend-hospital-bowl-in-final-against-wykeham-cc-3766611","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"The 2022 Scarborough Hospital Bowl final takes place on Monday, July 18, at the historic North Marine Road, home of Scarborough Cricket Club with a 6pm start.","content":null,"pubDate":"2022-07-13 11:10:58","image_url":"https://www.thescarboroughnews.co.uk/webimg/QVNIMTI2Mzc2MTI2.jpg?width=1200&auto=webp","source_id":"thescarboroughnews","country":["united kingdom"],"category":["sports"],"language":"english"}]}