{"newsArray":[{"title":"How footy helped return Vakarewa to WBBL","link":"https://thewest.com.au/sport/cricket/how-footy-helped-return-vakarewa-to-wbbl-c-8640307","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Former Australia fast bowler Belinda Vakarewa has revealed how a season of country rugby league and feeling at home in Sydney helped bring her back to cricket.","content":null,"pubDate":"2022-10-23 23:45:38","image_url":"https://images.thewest.com.au/publication/C-8640307/b9a65d82a66a11b3eca72a8466617fe9cc7c6ebc-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Not cricket’: India star Ashwin accused of ‘cheating’ with sneaky attempted fib vs Pakistan","link":"https://www.foxsports.com.au/cricket/t20-world-cup-2021/t20-world-cup-2022-india-vs-pakistan-ravichandran-ashwin-claims-catch-cheating-shan-masood-mohammed-shami-video-latest-news/news-story/e2b433d5718f87cc138d2bb859d2cbf9","keywords":null,"creator":null,"video_url":null,"description":"Indian veteran Ravichandran Ashwin has been accused of an unsportsmanlike act after trying to claim a catch that hit the ground against Pakistan.","content":"Indian veteran Ravichandran Ashwin has been accused of an unsportsmanlike act after trying to claim a catch that hit the ground against Pakistan. After a strong start India looked to have claimed another wicket when Shan Masood top-edged a pull shot off the bowling of Mohammed Shami and it flew to fine leg. Ashwin had a slow reaction and just failed to get to the ball on time as it hit the ground just before his hands got under it. Catch the T20 World Cup Live on Kayo. Don’t Risk Missing All Your Teams’ Matches. New to Kayo? Start your free trial now > However he rose to his feet claiming the catch and it had to be checked by the third umpire. It was clearly seen on the replay the ball had hit the MCG turf. Ashwin was heavily criticised for the act on social media given the heated nature of this rivalry. He has previously been criticised for Mankad incidents. India put in perfect start v Pakistan | 00:43","pubDate":"2022-10-23 19:41:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Refs need to stop the clock on VAR checks or our game will become a shambles, reckons Bill Leckie","link":"https://www.thescottishsun.co.uk/sport/football/9652401/refs-stop-clock-var-game-shambles-leckie/","keywords":["Football","Scottish Premiership","Refereeing","VAR"],"creator":["Graeme Macpherson"],"video_url":null,"description":null,"content":"EIGHT minutes and 18 seconds. That’s how much time VAR drained out of Hearts against Celtic on Saturday. Kenny RamsayNick Walsh consulting with VAR again[/caption] One minute and 45 seconds to disallow a goal that was never going to stand in the first place. Two minutes and 44 to award as stonewall a penalty as you’ll ever see. One minute and 13 from a second penalty being awarded to it being taken. Two minutes and 36 from the rebound being tucked away after the keeper saves the kick to it being retaken because the guy who scored had encroached into the box. Read More on VAR 'ABSOLUTE STONEWALLER' Chris Sutton in VAR blast as Celtic hero slams Hearts penalty snub HEARTS 3 CELTIC 4 Hoops take all three points from Tynecastle epic despite VAR controversy Think about that. Close on ten per cent of the 90 minutes lost to dithering and second-guessing. A huge chunk of play we were never getting back. It was a nonsense that robbed the supporters of entertainment, which left players standing around cold and confused and which rendered on-field ref Nick Walsh almost an irrelevance. As the SPFL’s new toy made its live TV debut, I’m afraid to say it was — quite literally — a waste of time. Most read in Football JER FOR GERS? Rangers in transfer battle with Premier League duo for striker Jerry Yates 'WHAT'S GOING ON?' Inside Postecoglou's Celtic appointment as he lifts lid on Desmond talks PArty games Lana Wolf speechless after receiving rude gift poking fun at ex-Celtic captain BENCHED Scotland hero John McGinn dramatically DROPPED by Aston Villa KAT CALL Ex-Rangers boss Steven Gerrard sends message to Ibrox hero Nikola Katic BIG CALLS Referee Bobby Madden delivers VAR verdict as he has say on Hearts v Celtic drama And for me, there’s only one way to learn and grow from that public shambles. Stop the clock while the whistler in the studio does his stuff. It won’t happen, of course, because it’s far too sensible. But if we don’t do it, then either be prepared for games going on till bedtime or punters staying away from matches that are shrinking before our eyes. That game at Tynecastle lasted a boot in the shins off two hours, including four minutes added at the end of the first half and five at the end of the second. Given there were eight substitutions, seven goals to celebrate and all the usual injuries and stuff, those nine minutes clearly didn’t include any VAR delays. So where did that time go? Do we just ignore it? Because if so, then the average football match, where the ball is already only in play for around 50 minutes, just became even worse value for money. I said after Friday’s new-tech curtain-raiser between Hibs and St Johnstone that we’d all soon get sick to the back teeth of every goal being followed by pointless video trawls to try and find reasons to chalk them off. My hope with the second helping was the guy in the studio would make it slick and quick and accurate. Some chance. If you take the moment Celtic thought they’d gone 2-0 up in the first half, Walsh had blown for a foul before Anthony Ralston headed in, which means that even if VAR decided he’d got it wrong the goal couldn’t have stood. So why should it take one minute and 45 seconds before the game can carry on? What’s to debate? BETTING SPECIAL – BEST NEW CUSTOMER OFFERS AND FREE BETS A question yelled into the wind, this, seeing as the SPFL haven’t a mechanism to tell us what the video dude is checking for. Then look at the first Hearts penalty, when Celtic’s Cameron Carter-Vickers takes Cammy Devlin out so clearly that even my 60-year-old, scarred and blurry eyes can see it from half a pitch-length away. The fact that Walsh doesn’t see it despite being perfectly positioned is one for him to explain. But what matters much more is why, once he gets the message that he might have blundered, it takes two minutes and 44 seconds to put things right. The poor guy’s standing there, finger in his ear and palm outstretched like a cross between a folk singer and a traffic cop, listening for instructions. Surely the only correct course of action was for him to sprint to the screen and see for himself. I knew it was a penalty. Carter-Vickers and Devlin knew it was a penalty. Lawrence Shankland said afterwards he’d already decided where he was putting the penalty. A single Sky Sports replay was enough to convince anyone who hadn’t been concentrating in real time that it was a penalty. Yet on and on it dragged, until Walsh finally made that wee rectangle sign. The second Hearts penalty, to make it 3-3, was equally clear-cut, Moritz Jenz as guilty as a pup sitting next to a pile of poo as he hung a leg out to catch Devlin. Yet somehow it still needed 73 seconds of faffing from on high before Shankland was allowed to take it. That was followed by just over two and a half minutes more to get him back on the spot after team-mate Josh Ginnelly was pulled up for encroaching before the original kick was taken. Again, a replay confirmed Ginnelly’s offence, so why leave everyone guessing what the hell was going on? Little wonder, in the midst of all this, SFA rising star Walsh pretty much forgot to referee the most exciting game of the season so far. That’s not a criticism of him, just a fact. Look at the incident right on half-time when James Forrest tries to flick the ball around Michael Smith and the full-back instinctively sticks out his left hand to bat it away. It was as clear an offence as you’ll see, yet despite being right there, it not only seemed to pass Walsh by, but VAR blanked it as well. That was probably the one that got me most — this abdication of responsibility on the part of the actual ref and the virtual one. But we’d better prepare for more of the same. The more whistlers in the studio try to take over as much as Steven McLean did at Hearts v Celtic, the less the guy on the pitch will be prepared to hang himself out to dry. Put it this way. If Walsh had the chance to re-ref the Ralston goal-that-wasn’t, my bet is he’d let the foul go, let the ball hit the net and let the VAR make the call. And if that’s progress, I’m happy to be a Neanderthal. GIO VAN BRONCKHORST is talking the language of a beaten man. We’re not good enough to compete. The fans are right to boo us. The players still believe in me. I’m trying my best. That last one, that’s the kicker. Once a manager has to rely on effort as his reason to stay in a job, I’m afraid he’s as good as gone. In fact, there’s probably only one factor saving the Dutchman right now — and it’s the same one that will save plenty more under-fire gaffers for a little while longer. The fact that the World Cup starts next month and affords directors five weeks to hire a new guy. Whether this is a good or a bad thing for Van Bronckhorst remains to be seen. On one hand, he might just use the six games before the break to turn Gers around and get himself back in the good books. Yet on the other, if they go to Naples on Wednesday and take another tonking . . . Well, that month ahead might just feel like years. PS . . . as someone married into a Neapolitan family and who loves the city to bits, part of me envies anyone who gets the chance to go there this week. But please, please heed these words. It’s not a place to swagger into like you own it, not a place to march in a crowd singing your party tunes. So while I get that fans who bought packages before Uefa took away their tickets might still want to make the trip, it’s one to enjoy with the neck wound well in. WE love to kid ourselves the Old Firm have the hottest rivalry on earth. But compared to what unfolded on Sunday morning, that pair get together for tickling contests. India against Pakistan at cricket? That’s real needle. Never mind a wee bit of blood on the streets, if that one goes wrong there might not be any streets. There were close on 91,000 in the neutral venue of Melbourne to see them lock horns in the group stages of the World T20. The tussle went right down to the last ball amidst off-the-scale emotions before the Indians won. Then? Two teams hugged, shook hands, congratulated and commiserated. And that, my friends, is the REAL definition of rivalry. Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2022-10-23 19:36:57","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"BAN vs NED Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BAN vs NED T20 World Cup 2022 Super 12 in Hobart, 930 AM IST, October 24","link":"https://zeenews.india.com/cricket/ban-vs-ned-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ban-vs-ned-t20-world-cup-2022-super-12-in-hobart-930-am-ist-october-24-2525993.html","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs Netherlands Dream11 Team Prediction Bangladesh vs Netherlands T20 World Cup 2022 Super 12 Preview - Check My Dream11 Team, Best players list of BAN vs NED, Bangladesh Dream11 Team Player List, Netherlands Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"T20 World Cup 2022 : The action now moves onto the next day after a stellar Sunday show as Netherlands are set to lock horns with Bangladesh at the Bellerive Oval, Hobart on Monday (October 24). Netherlands have their lost previous fixture against Sri Lanka but UAE's win over Namibia got the Dutch qualified for the next round. On the other hand, Bangladesh are also coming into this fixture with a defeat in their warm-up fixture against Asian rivals Afghanistan. Shakib al Hassan and co will eye to start their T20 World Cup 2022 campaign on a positive note. Match Details Bangladesh vs Netherlands T20 World Cup 2022 Super 12 Match No. 17 Venue: Bellerive Oval, Hobart Date & Time: October 24 at 9:30 AM IST Live Streaming and TV details: Star Sports Network and Disney+ Hotstar website and app BAN vs NED T20 World Cup 2022 Super 12 Match No. 17 Dream11 Prediction Captain - Liton Das Vice-Captain - Colin Ackermann Wicketkeepers : Scott Edwards, Liton Das Batters: Max O’Dowd, Afif Hossain, Najmul Hossain All-rounders: Colin Ackermann, Shakib Al Hasan, Bas de Leede Bowlers: Fred Klaassen, Paul van Meekeren, Hasan Mahmud Sikandar Raza in his last 5 T20I inns: 82 (48) vs Ireland in 0 (1) vs Bangladesh 62 (53) vs Bangladesh 65* (26) vs Bangladesh 19 (14) vs Netherlands #ZIMvIRE pic.twitter.com/Y3ZL3uQqPl — Cricbelter (@cricbelter) October 18, 2022 Bangladesh vs Netherlands T20 World Cup 2022 Super 12 Match No. 16 Predicted 11 Bangladesh: Najmul Hossain Shanto, Soumya Sarkar, Litton Das (wk), Shakib Al Hasan (c), Mosaddek Hossain, Mehidy Hasan Miraz, Nurul Hasan, Taskin Ahmed, Mustafizur Rahman, Ebadot Hossain, Shoriful Islam/Nasum Ahmed Netherlands: Max O'Dowd, Vikramjit Singh, Bas de Leede, Tom Cooper, Colin Ackermann, Scott Edwards (c & wk), Tim Pringle, Roelof van der Merwe/Logan van Beek, Timm van der Gugten, Fred Klaassen, Paul van Meekeren","pubDate":"2022-10-23 18:53:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli after helping India beat Pakistan: 'My best innings till date'","link":"https://www.thehansindia.com/sports/cricket/virat-kohli-after-helping-india-beat-pakistan-my-best-innings-till-date-766545","keywords":["Sports,Top Stories,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Kohli scored an unbeaten 82 off 53 balls at MCGHe helped India defeat Pakistan by 4 wicketsIt was Kohli’s 34th half-century in T20Is","content":"Virat Kohli Virat Kohli has said he rates his knock of 82 off 53 balls against Pakistan in the T20 World Cup 2022 as his T20I career's best innings. Kohli's 34th T20I half-century on Sunday helped India defeat Pakistan by four wickets in their Super 12 clash at Melbourne Cricket Ground (MCG). During India's chase of 160, the Men in Blue had a poor start, losing four wickets for just 30 runs. The last time India played Pakistan in the T20 World Cup, which was last year in Dubai, the Indians ended up in the losing side, which was their first-ever defeat to these opponents in a World Cup game. Therefore, there was a sigh of relief on Kohli and Co's faces on Sunday when Ravichandran Ashwin hit the winning runs. \"It's a surreal atmosphere, I have no words, no idea how that happened. I am really lost for words. Hardik believed we can do it, if we stayed till the end. When Shaheen bowled from the pavilion end, that's when we decided to take him down. Haris is their prime bowler, and I hit those two sixes. The calculation was simple. Nawaz had one over to bowl, so if I could take Haris down, they would panic,\" said Kohli after he received the Player of the Match award. At a loss for words… Wouldn't have preferred anyone else with me out there @imVkohli 👑🫡 One of the best games of my life 🇮🇳 pic.twitter.com/jWge1qy5lj Kohli also mentioned that Hardik, with whom he put up 113 runs for the fifth wicket, kept pushing him. It was the highest partnership for India against Pakistan for any wicket in T20Is. \"From 28 in 8, it came down to 16 to 6. I tried to stick to my instincts. The first one was the back of a hand slower ball (the one over long-on). Standing here I just feel like it was meant to be. Till today Mohali was my best innings against Australia. Today I will count this one higher. Hardik kept pushing me. The crowd has been phenomenal. You guys (fans) kept backing me and I am grateful for your support,\" added Kohli. Meanwhile, with his latest knock, Kohli also surpassed Rohit Sharma in the list of most runs in T20Is. Kohli is the leading run-scorer in the shortest format on the international level with 3,794 runs in 110 games at a strike rate of 138.41 and an average of 51.97. Kohli has hit 34 fifties and a century, which came earlier this year in the Asia Cup. Rohit, who managed just four off eight balls, has scored 3,741 runs in 143 games, including four centuries and 28 fifties.","pubDate":"2022-10-23 17:31:34","image_url":"https://assets.thehansindia.com/h-upload/2022/10/23/500x300_1317607-kohli-ji.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Kohli played his 'best innings for India,' says Rohit after 4-wicket win over Pakistan","link":"https://www.thehansindia.com/sports/cricket/kohli-played-his-best-innings-for-india-says-rohit-after-4-wicket-win-over-pakistan-766544","keywords":["Sports,Top Stories,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Virat Kohli scored an unbeaten 82He put up 113 runs with Hardik for the fifth wicketIndia’s next game is on Oct. 27 against Netherlands","content":"India captain Rohit Sharma heaped praise on Virat Kohli, saying he played \"his best innings\" for India after their four-wicket win over Pakistan on Sunday. Kohli, the Player of the Match, remained unbeaten on 82 off 53 balls, where he struck four sixes and six fours He put up 113 runs with Hardik Pandya for the fifth wicket, which was the highest partnership for any wicket for India against Pakistan in T20Is. Hardik scored a 37-ball 40 before getting out on the first ball of the last over when India needed 16. After Ravichandran Ashwin hit the winning runs, the Indian dugout came running to Kohli in the Melbourne Cricket Ground (MCG) field, including Rohit who lifted the former captain in air and twirled him like a child. \"I was in the dressing room. I don't have any words left. You got to expect something like this in a game like this. We wanted to stay in the game for as long as possible. That crucial partnership was the game-changing moment for us. The pitch had something in it. There was nice carry. Some swing and seam. Good to see from the bowling perspective. They had a good partnership (Iftikhar and Masood) after that. They batted well towards the end as well,\" Rohit said after India's win. Adding further, Rohit said that Kohli and Hardik are experienced and they stayed calm till the end and helped India cross the line. \"But we knew we had to bat out of our skin to chase this. Those two guys (Kohli and Pandya) are experienced. Staying calm and taking the game deep was very critical. Good for our confidence. Always crucial to get off the mark like this. We were in no position to win this. The way we won that's more pleasing for us. Hats off to Virat for the way he batted, has to be the best innings he has played for India. I would like to thank everyone, it's wonderful to see. Their support for us is very, very crucial wherever we go,\" added Rohit. https://twitter.com/imVkohli/status/1584170142254084098 Even Pakistan skipper Babar Azam hailed Kohli. \"Our bowlers bowled really well. All credit to Kohli and Pandya. It wasn't easy with the new ball. We had partnerships after 10 overs. We had a chance. We tried to stick to our plans. But credit to Virat Kohli. In the middle we decided we wanted a wicket and held the spinner back. We had a lot of positives. The way Iftikhar played and the way Shan played,\" said Babar. India's next game is on Thursday (Oct. 27) against Netherlands at Sydney Cricket Ground (SCG). On the same day, Pakistan are also in action as they are scheduled to lock horns with Zimbabwe at Perth Stadium.","pubDate":"2022-10-23 17:27:07","image_url":"https://assets.thehansindia.com/h-upload/2022/10/23/500x300_1317604-kohli.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Gould out to 'reset' English cricket after taking top ECB job","link":"https://ca.sports.yahoo.com/news/gould-reset-english-cricket-taking-171624511.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-23 17:16:24","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Of extras, wickets, six and India beating Pakistan in dramatic last over","link":"https://www.business-standard.com/article/sports/of-extras-wickets-six-and-india-beating-pakistan-in-dramatic-last-over-122102300808_1.html","keywords":null,"creator":null,"video_url":null,"description":"Two wickets, two extras, Virat Kohli getting bowled off a free hit and a cool finish by Ravichandran Ashwin, the blockbuster T20 World Cup contest between India and Pakistan climaxed with a dramatic last over. While the match itself was a classic, the nine-ball last over truly lived up to the expectations and hype generated in the run-up to Sunday's big-ticket game, which was played in front of a packed Melbourne Cricket Ground. Having completed his half century, Kohli had just turned the game on its head by hitting their most impactful bowler Haris Rauf for two breathtaking sixes -- one a lofted backfoot drive over long-on and another a flick over square leg. Needing 31 for 12 balls, it all boiled down to 16 from the last over with Kohli in his element and Hardik Pandya looking to explode. With the Pakistani pace troika of Shaheen Shah Afridi, Naseem Shah and Haris Rauf having finished their respective quotas, all eyes were on Mohammad Nawaz who had leaked 29 runs from his earlier","content":null,"pubDate":"2022-10-23 16:55:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221023/thumb-122102300808.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"No ball in today match: Did Mohammad Nawaz bowl a no ball to Virat Kohli in Melbourne World Cup 2022 T20I?","link":"https://thesportsrush.com/cricket-news-no-ball-in-today-match-did-mohammad-nawaz-bowl-a-no-ball-to-virat-kohli-in-melbourne-world-cup-2022-t20i/","keywords":["Cricket","ICC T20 World Cup 2022","India","MCG","Melbourne Cricket Ground","Mohammad Nawaz","Pakistan","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"No ball in today match: Mohammad Nawaz made a costly error under pressure at a point when Pakistan had all but sealed today’s contest. Nothing but absolute agony was in store for the Pakistan Cricket team and its passionate fans, after they turned out to be on the wrong side of the result at the… The post No ball in today match: Did Mohammad Nawaz bowl a no ball to Virat Kohli in Melbourne World Cup 2022 T20I? appeared first on The SportsRush.","content":"No ball in today match: Mohammad Nawaz made a costly error under pressure at a point when Pakistan had all but sealed today’s contest. Nothing but absolute agony was in store for the Pakistan Cricket team and its passionate fans, after they turned out to be on the wrong side of the result at the Melbourne Cricket Ground (MCG) during a humdinger of the first ‘Super 12 Group 2’ match of the ongoing T20 World Cup 2022 on Sunday. With team India requiring 28 runs off the final 8 deliveries, it looked like Pakistan would ultimately have it in their bag, until Virat Kohli (82* off 53) then activated his beast mode on, smashing three Sixes post that, and riding on some luck as well, to ultimately see India through with a 4-wicket victory, and get on up and running with the World Cup campaign. The last Over bowled by Mohammad Nawaz however, was nothing short of a well-scripted drama loaded with breathtaking stuff and entertainment value, with India requiring another 16 runs off it. No ball in today match After getting the much-needed breakthrough by dismissing Hardik Pandya (40 off 37) on the first delivery, Nawaz conceded mere 3 runs off the next two balls, to bring the equation to 13 runs required off the final 3 deliveries. With the situation now titled in Pakistan’s favour, the left-arm spinner then bowled an above waist-height Full Toss, which Kohli just managed to send it past the deep square leg fielder for a Six. Leg umpire Marais Erasmus, who was initially seen looking at the ball with Kohli pleading for a waist-height No-Ball as soon as he hit the delivery, was on the same page as Kohli a few moments later while adjudging it a No-Ball indeed and above the waist at the point of impact. Pakistan skipper Babar Azam then seemed to have a heated discussion with the umpire post the verdict, but finally had to give in with the explanation the latter had come up with. Did Mohammad Nawaz bowl a no ball to Virat Kohli in Melbourne World Cup 2022 T20I? The replays were suggestive of the fact that it was indeed a waist-height No-Ball bowled by Nawaz, although it being a tight call made by the umpire. At the point of impact of the bat and the ball, the trajectory showed the delivery to be played above the waist of Kohli, enough to be called a No-Ball. There was further drama in store, as Kohli was then clean bowled by Nawaz off the Free Hit, but much to his delight, the ball managed to ricochet off the stump towards the third man fence, with three runs in the form of Byes being awarded to team India. With 2 runs required off the last two balls, Dinesh Karthik (1 off 2) then played all over the leg-stump delivery to ultimately get out stumped, courtesy of some smart glove work by wicket-keeper Mohammad Rizwan. Under pressure, Nawaz fired a Wide down the leg-side to R Ashwin in next, with the latter hitting the winning runs then off the final delivery with one run required off it. The post No ball in today match: Did Mohammad Nawaz bowl a no ball to Virat Kohli in Melbourne World Cup 2022 T20I? appeared first on The SportsRush.","pubDate":"2022-10-23 16:36:09","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“One of the best games of my life”: Hardik Pandya cherishes his memorable partnership alongside Virat Kohli as India defeat Pakistan in the T20 World Cup 2022 match at MCG","link":"https://thesportsrush.com/cricket-news-one-of-the-best-games-of-my-life-hardik-pandya-cherishes-his-memorable-partnership-alongside-virat-kohli-as-india-defeat-pakistan-in-the-t20-world-cup-2022-match-at-mcg/","keywords":["Cricket","Hardik Pandya","ICC T20 World Cup 2022","India","MCG","Pakistan","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Hardik Pandya cherishes his memorable partnership alongside Virat Kohli as the duo register a win to be remembered for the ages. Team India have managed to pull out a miracle out of thin air at the Melbourne Cricket Ground (MCG) today, as they defeat Pakistan by 4 wickets on the final delivery, of their first… The post “One of the best games of my life”: Hardik Pandya cherishes his memorable partnership alongside Virat Kohli as India defeat Pakistan in the T20 World Cup 2022 match at MCG appeared first on The SportsRush.","content":"Team India have managed to pull out a miracle out of thin air at the , as they defeat Pakistan by 4 wickets on the final delivery, of their first T20 World Cup 2022 match against Pakistan, which turned out to be a cliffhanger of the highest order. En route the target of 160 runs, team India were yet again rattled by Pakistani pacers upfront, on a pitch that still provided enough seam movement and bounce into the second innings. With Rohit Sharma (4 off 7), KL Rahul (4 off 8), and Suryakumar Yadav (15 off 10) falling cheaply, and with Axar Patel (2 off 3) next getting run-out, things seemed like having already gone South, with the scorecard reading 31/4 at one point, and the Pakistan pacers breathing fire. However, the duo of and Hardik Pandya (40 off 37) stitched together a partnership worth remembering for the ages, comprising 113 runs off 78 deliveries for the fifth wicket, which also happened to be the highest-ever stand for any wicket for India against Pakistan in T20Is. The partnership carried on till the first delivery of the 20th Over, when Pandya unfortunately got dismissed, with 16 required off the final 6 deliveries. However, Kohli, who previously had a 100% success rate to pull of a victory whenever he has stayed Not Out during run-chases for India in T20Is, was in no mood to not let this surreal record of his intact, as he smashed a Six off a No-Ball bowled by Mohammad Nawaz, to bring the equation down to 6 runs required off the final 3 balls. Courtesy of a bit of luck, and a couple of Wides bowled by Nawaz during the Over, India managed to open their account in the T20 World Cup 2022. Post the win, an ecstatic Hardik Pandya, took to his social media handle, to express his ‘loss of words’ after everything that transpired today at the MCG, while also terming today’s humdinger of an India-Pakistan contest as one of the best he’s been part of. Pandya also exclaimed that he would not have preferred any other batting partner but Kohli at the other end, during the nearly improbable run-chase on the Sunday night at Melbourne. At a loss for words… Wouldn’t have preferred anyone else with me out there 👑🫡 One of the best games of my life 🇮🇳 — hardik pandya (@hardikpandya7) For more-Cricket-related news, click .","pubDate":"2022-10-23 15:42:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 WC: Virat Kohli becomes leading run-scorer in shortest format","link":"https://www.business-standard.com/article/sports/t20-wc-virat-kohli-becomes-leading-run-scorer-in-shortest-format-122102300709_1.html","keywords":null,"creator":null,"video_url":null,"description":"Star Indian batter Virat Kohli on Sunday became the highest run-scorer in T20I cricket history","content":null,"pubDate":"2022-10-23 15:18:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221023/thumb-122102300709.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan match attendance today: Today match crowd attendance at Melbourne Cricket Ground","link":"https://thesportsrush.com/cricket-news-india-vs-pakistan-match-attendance-today-today-match-crowd-attendance-at-melbourne-cricket-ground/","keywords":["Cricket","ICC T20 World Cup 2022","India","MCG","Melbourne Cricket Ground","Pakistan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"India vs Pakistan match attendance today: Crowd at the MCG turned out as expected, as India and Pakistan played out a game for the ages. There are folklores, and then there are Cricketing scripts like the one which played out at the Melbourne Cricket Ground (MCG) today. If only the words ‘agony’ and ‘ecstasy’ had… The post India vs Pakistan match attendance today: Today match crowd attendance at Melbourne Cricket Ground appeared first on The SportsRush.","content":"There are folklores, and then there are Cricketing scripts like the one which played out at the Melbourne Cricket Ground (MCG) today. If only the words ‘agony’ and ‘ecstasy’ had better superlatives, the ones on display at the match venue on October 24, 2022 should be fittingly patented as a priceless memory for the upcoming generation of Cricket lovers. It was India up against Pakistan on Sunday night in the city of Melbourne, in the first ‘Super 12 Group 2’ match of the ongoing ICC T20 World Cup 2022, and the one that of each of the spectators witnessing the encounter. : Team India looked down and out with the scorecard reading 31/4 at one point, en route the decent enough target of 160 runs handed by Pakistan after they were invited to bat first. Post this stage, the fans were in for some magic which steadily started to build-up, akin the partnership between India’s undisputed star of the day , and the maverick allrounder Hardik Pandya (40 off 37), who made way for a run-chase which will be arguably remembered till this sport exists . The duo stitched together a 113-run partnership off 78 deliveries for the fifth wicket under immense pressure to say the least, which lasted right till the beginning of the ultimate Over of the match. The stand is also the highest-ever for India versus Pakistan in a T20I . Despite it all, team India still required 54 runs off the final four Overs, and then 28 off 8 deliveries at one stage. It was at this juncture that Kohli unleashed his clinical potential best by smashing back-to-back Sixes off Pakistan’s best pacer on the day, Haris Rauf, to bring the equation down to 16 required off the last Over. Amidst all the drama that unfolded during the final Over, it was Ravichandran Ashwin who hit the winning runs with one run required off the final delivery. The fans started to pour in numbers at least a couple of hours ahead of the clash, in what was a sold out Cricket match at the Melbourne Cricket Ground (MCG) today. As per the official figures, the total attendance during the India-Pakistan World Cup clash today was No points for guessing that it was more than worth the four-hour period spent by each of these spectators at the match venue. More than 90,000 in attendance during match at the Melbourne Cricket Ground in Australia. PC: — Geo English (@geonews_english) An awesome atmosphere right now outside the for the match. Thousands of & fans in attendance. Who you got for the win? 🏏 — Melbourne, Australia (@Melbourne) And Yes that’s the way we celebrate … crazy atmosphere in Melbourne — 🇮🇳 Sanjit 🇦🇺 (@jsigns4u) For more Cricket-related news, click .","pubDate":"2022-10-23 15:01:33","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly Backs Out Of Cricket Association Of Bengal Polls","link":"https://sports.ndtv.com/cricket/sourav-ganguly-backs-out-of-cricket-association-of-bengal-polls-3457514","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Sourav Ganguly, whose tenure as BCCI president came to an end recently, had been the CAB president for four years between 2015 to 2019 before coming to the apex body.","content":"Former BCCI president Sourav Ganguly , who had earlier announced that he will be contesting the Cricket Association of Bengal (CAB) polls, has now decided to not contest the polls for the CAB president's post. Instead, Sourav's elder brother Snehasish is set to be the new CAB president. Ganguly, whose tenure as BCCI president came to an end recently, had been the CAB president for four years between 2015 to 2019 before coming to the apex body. \"I had said that I would contest only if there's election. There's not going to be any election, so it will be uncontested,\" Ganguly told reporters at Eden Gardens after he chose not to file his papers for the president's post on the last date of nomination. \"Had I been there, it would have meant two or more people would not get any posts. So, I've moved aside. I would have been elected uncontested, but I don't think it's right. Others would not have got the opportunity to work for this association. They will be working for these three years now and we will see after that.\" Asked about his next innings, he said: \"Let's see. I'm free of responsibilities for some time now and I'm happy about it. I've no rival in CAB, everyone is my friend here. There are new and experienced people here to run the show. I'll also be around and they will get me at times,\" he added before leaving the Eden. Ganguly was expected to file his nomination on Saturday but he told reporters the situation would be clear by Sunday. When asked about when he would file his nomination, he said, \"Let's wait till tomorrow, everything will be clear.\" When the deadline for nominations passed today, it became clear he was not contesting. Promoted There was expectation that Sourav might go to the International Cricket Council (ICC) after his BCCI tenure ended, but he was not picked for that role. With PTI inputs","pubDate":"2022-10-23 14:51:01","image_url":"https://c.ndtvimg.com/2022-10/gq2i3o7o_sourav-ganguly-twitter-_625x300_18_October_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan: Babar Azam ‘bowled over’ by Kohli’s class","link":"https://www.tribuneindia.com/news/sports/india-vs-pakistan-babar-azam-bowled-over-by-kohlis-class-444075","keywords":null,"creator":null,"video_url":null,"description":"Melbourne, October 23Often Babar Azam has been compared with Virat Kohli. Without an iota of doubt, the two are world cricket's premier batters.But on Sunday, even the Pakistan skipper was in awe of Kohli, who fashioned India's memorable win in the T20 World Cup at the MCG.Kohli's inspirational batting was the difference between the two sides.\"Our bowlers were outstanding in first 10 overs. Credit to Virat and Hardik, for the manner, in which, they finished the game,\" said Babar after the demoralising defeat.But when the discussion veered towards Kohli, Babar was effusive in his praise.\"Virat Kohli just showed his class today. It was a close game and people enjoyed it.\" Winning a pressure game will boost Kohli's morale after a lean patch of three years, Babar agreed.\"Pakistan vs India are always extra pressure games and the more quickly you can overcome it, the better. That's why he is a big player, there was pressure on him and he overcame it and then build his innings. The way they built partnership was turning point,\" the Pakistan skipper said.\"This innings must have given him a lot of confidence and when you win these kind of games, you mentally feel good,\" he added.The question that was inevitable was why left-arm spinner Mohammed Nawaz was brought in the 20th over and pacers' quota of overs was exhausted before.\"When the partnership (Kohli-Pandya) was building, we needed to get wickets and I thought of bringing my main bowler and build pressure.\"But the plan didn't work out as I would have thought. He (Nawaz) will learn from this and when next time he faces this kind of a situation, he will realise what he needs to do.\"We need to get over disappointment quickly Babar was very clear his mind that they can't keep on lamenting this defeat as the tournament has just started.\"We will remain confident. We will learn from this defeat. Some good things happened and some mistakes happened. We will deliberate and it's just start of the tournament and we have lot of games left.\"The quicker we get over it better it is. We have back-to-back matches and we need to focus on that.\"","content":"PTI Melbourne, October 23 Often Babar Azam has been compared with Virat Kohli. Without an iota of doubt, the two are world cricket’s premier batters. But on Sunday, even the Pakistan skipper was in awe of Kohli, who fashioned India’s memorable win in the T20 World Cup at the MCG. Kohli’s inspirational batting was the difference between the two sides. “Our bowlers were outstanding in first 10 overs. Credit to Virat and Hardik, for the manner, in which, they finished the game,” said Babar after the demoralising defeat. But when the discussion veered towards Kohli, Babar was effusive in his praise. “Virat Kohli just showed his class today. It was a close game and people enjoyed it.” Winning a pressure game will boost Kohli’s morale after a lean patch of three years, Babar agreed. “Pakistan vs India are always extra pressure games and the more quickly you can overcome it, the better. That’s why he is a big player, there was pressure on him and he overcame it and then build his innings. The way they built partnership was turning point,” the Pakistan skipper said. “This innings must have given him a lot of confidence and when you win these kind of games, you mentally feel good,” he added. The question that was inevitable was why left-arm spinner Mohammed Nawaz was brought in the 20th over and pacers’ quota of overs was exhausted before. “When the partnership (Kohli-Pandya) was building, we needed to get wickets and I thought of bringing my main bowler and build pressure. “But the plan didn’t work out as I would have thought. He (Nawaz) will learn from this and when next time he faces this kind of a situation, he will realise what he needs to do.” We need to get over disappointment quickly Babar was very clear his mind that they can’t keep on lamenting this defeat as the tournament has just started. “We will remain confident. We will learn from this defeat. Some good things happened and some mistakes happened. We will deliberate and it’s just start of the tournament and we have lot of games left. “The quicker we get over it better it is. We have back-to-back matches and we need to focus on that.” #Cricket #Pakistan #Virat Kohli","pubDate":"2022-10-23 14:40:57","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1941058557.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly backs out, elder brother Snehasish set to lead Cricket Association of Bengal","link":"https://www.tribuneindia.com/news/sports/sourav-ganguly-backs-out-elder-brother-snehasish-set-to-lead-cricket-association-of-bengal-444073","keywords":null,"creator":null,"video_url":null,"description":"Kolkata, October 23Former BCCI president Sourav Ganguly on Sunday pulled out of the race to become the Cricket Association of Bengal's next chief, paving the way for his elder brother Snehasish to be elected uncontested at its upcoming AGM on October 31.\"I had said that I would contest only if there's election. There's not going to be any election, so it will be uncontested,\" Ganguly told reporters at Eden Gardens after he chose not to file his papers for the president's post on the last date of nomination.Denied a second term at the Indian cricket board, the former BCCI president only a week back had announced that he's all set to contest elections to return as the CAB chief.\"Had I been there, it would have meant two or more people would not get any posts. So, I've moved aside,\" Ganguly said.\"I would have been elected uncontested, but I don't think it's right. Others would not have got the opportunity to work for this association. They will be working for these three years now and we will see after that.\" Asked about his next innings, he said: \"Let's see. I'm free of responsibilities for some time now and I'm happy about it.\" \"I've no rival in CAB, everyone is my friend here. There are new and experienced people here to run the show. I'll also be around and they will get me at times,\" he added before leaving the Eden.The elder Ganguly, who was the secretary under Avishek Dalmiya, will now run the show, while Amalendu Biswas, who is the father of Students Federation of India (SFI) leader Mayukh, will be appointed as the vice-president.Naresh Ojha will occupy the secretary's chair, while Prabir Chakraborty and Debabrata Das will continue their second term as the treasurer and the joint-secretary respectively.","content":"PTI Kolkata, October 23 Former BCCI president Sourav Ganguly on Sunday pulled out of the race to become the Cricket Association of Bengal’s next chief, paving the way for his elder brother Snehasish to be elected uncontested at its upcoming AGM on October 31. “I had said that I would contest only if there’s election. There’s not going to be any election, so it will be uncontested,” Ganguly told reporters at Eden Gardens after he chose not to file his papers for the president’s post on the last date of nomination. Denied a second term at the Indian cricket board, the former BCCI president only a week back had announced that he’s all set to contest elections to return as the CAB chief. “Had I been there, it would have meant two or more people would not get any posts. So, I’ve moved aside,” Ganguly said. “I would have been elected uncontested, but I don’t think it’s right. Others would not have got the opportunity to work for this association. They will be working for these three years now and we will see after that.” Asked about his next innings, he said: “Let’s see. I’m free of responsibilities for some time now and I’m happy about it.” “I’ve no rival in CAB, everyone is my friend here. There are new and experienced people here to run the show. I’ll also be around and they will get me at times,” he added before leaving the Eden. The elder Ganguly, who was the secretary under Avishek Dalmiya, will now run the show, while Amalendu Biswas, who is the father of Students Federation of India (SFI) leader Mayukh, will be appointed as the vice-president. Naresh Ojha will occupy the secretary’s chair, while Prabir Chakraborty and Debabrata Das will continue their second term as the treasurer and the joint-secretary respectively.","pubDate":"2022-10-23 14:40:48","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_566848788.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly backs out, elder brother Snehasish set to lead CAB","link":"https://www.business-standard.com/article/sports/sourav-ganguly-backs-out-elder-brother-snehasish-set-to-lead-cab-122102300677_1.html","keywords":null,"creator":null,"video_url":null,"description":"Former BCCI president Sourav Ganguly on Sunday pulled out of the race to become the Cricket Association of Bengal's next chief, paving the way for his elder brother Snehasish to be elected uncontested at its upcoming AGM on October 31. \"I had said that I would contest only if there's election. There's not going to be any election, so it will be uncontested,\" Ganguly told reporters at Eden Gardens after he chose not to file his papers for the president's post on the last date of nomination. Denied a second term at the Indian cricket board, the former BCCI president only a week back had announced that he's all set to contest elections to return as the CAB chief. \"Had I been there, it would have meant two or more people would not get any posts. So, I've moved aside,\" Ganguly said. \"I would have been elected uncontested, but I don't think it's right. Others would not have got the opportunity to work for this association. They will be working for these three years now and we will see af","content":"Former BCCI president Sourav Ganguly on Sunday pulled out of the race to become the Cricket Association of Bengal's next chief, paving the way for his elder brother Snehasish to be elected uncontested at its upcoming AGM on October 31. \"I had said that I would contest only if there's election. There's not going to be any election, so it will be uncontested,\" Ganguly told reporters at Eden Gardens after he chose not to file his papers for the president's post on the last date of nomination. Denied a second term at the Indian cricket board, the former BCCI president only a week back had announced that he's all set to contest elections to return as the CAB chief. \"Had I been there, it would have meant two or more people would not get any posts. So, I've moved aside,\" Ganguly said. \"I would have been elected uncontested, but I don't think it's right. Others would not have got the opportunity to work for this association. They will be working for these three years now and we will see after that.\" Asked about his next innings, he said: \"Let's see. I'm free of responsibilities for some time now and I'm happy about it.\" \"I've no rival in CAB, everyone is my friend here. There are new and experienced people here to run the show. I'll also be around and they will get me at times,\" he added before leaving the Eden. The elder Ganguly, who was the secretary under Avishek Dalmiya, will now run the show, while Amalendu Biswas, who is the father of Students Federation of India (SFI) leader Mayukh, will be appointed as the vice-president. Naresh Ojha will occupy the secretary's chair, while Prabir Chakraborty and Debabrata Das will continue their second term as the treasurer and the joint-secretary respectively. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-10-23 14:39:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221023/thumb-122102300677.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Diwali Begins\": Amit Shah, Other Leaders After India Beat Pak in T20 - NDTV","link":"https://news.google.com/__i/rss/rd/articles/CBMic2h0dHBzOi8vd3d3Lm5kdHYuY29tL2luZGlhLW5ld3MvZGl3YWxpLWJlZ2lucy1hbWl0LXNoYWgtb3RoZXItbGVhZGVycy1hZnRlci1pbmRpYS1iZWF0LXBhay1pbi10MjAtd29ybGQtY3VwLTM0NTczMzXSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Diwali Begins\": Amit Shah, Other Leaders After India Beat Pak in T20  NDTVLive match blog - Pakistan vs India 16th Match, Group 2 2022/23 - Cricket Insights  ESPNcricinfoReactions to Virat Kohli’s 82* against Pakistan at MCG – ‘Undoubtedly the best innings of your life’  Scroll.inIndia vs Pakistan Live Cricket Score, T20 World Cup 2022: India beat Pakistan by four wickets, Kohli scores 82*  The Indian ExpressAbhishek Bachchan, Javed Akhtar rave about King Kohli: ‘Tumko 7 khoon maaf’  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-10-23 14:37:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"TNCA XI to play three first-class, two one-dayers against Bangladesh Cricket Board","link":"https://sportstar.thehindu.com/cricket/tamil-nadu-cricket-association-vs-bangladesh-board-indrajith/article66049890.ece","keywords":null,"creator":["\n        S. Dipak Ragav  \n    "],"video_url":null,"description":"B. Indrajith and Mohammad Mithun will lead Tamil Nadu and Bangladesh Cricket Board XI respectively in the opening First-Class match.","content":"B. Indrajith and Mohammad Mithun will lead Tamil Nadu and Bangladesh Cricket Board XI respectively in the opening First-Class match to be played from Tuesday at the M.A. Chidambaram Stadium. The BCB XI squad will play TN in two First-Class matches followed by three one-dayers. Apart from the skipper, the visitors have a strong squad that features some prominent names like Mahmudul Hasan Joy, Mominul Haque who have played international cricket for Bangladesh. Initially the tour was supposed to start from October 12 but a delay in getting the necessary clearance meant the tour had to be moved by nearly two weeks. The TN squad features quite a few under-25 players and will give the selectors a chance to evaluate some regular Ranji Trophy regulars as well. Squads: Tamil Nadu: B. Indrajith (Captain), N. Sunil Krishna, K. Gowtham Thamarai Kannan, Pradosh Ranjan Paul, R.S. Jaganath Sinivas, S. Ajith Ram, R. Kavin, V. Ganga Sridhar Raju, N.S. Chaturved, M. Kaushik Gandhi, L. Suryapprakash, L. Vignesh, Adithya Ganesh, A. Aswin Crist, M. Affan Khader, Bangladesh: Mominul Haque Showrab, Mohammad Saif Hasan, Mahmudul Hasan Joy Anamul Haque Bijoy, Mohammad Mithun (Captain), Md. Tawhid Hiridoy, Jaker Ali Anik, Md. Shadman Islam, Md Taijul Islam, Syed Khaled Ahmed, Nayeem Islam, Md. Anamul Haque Jr., Rejaur Rahman Raja, Mukidul Islam Mugdho Read more stories on Cricket.","pubDate":"2022-10-23 14:33:16","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Kohli heroics lead India to famous win","link":"https://www.cairnspost.com.au/sport/cricket/t20-world-cup-kohli-heroics-lead-india-to-famous-win/video/f3600690eda0cd1bcbc39a0172b433d9","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Virat Kohli has produced a vintage performance to lead India to an unlikely win over arch-rivals Pakistan in front of a packed Melbourne Cricket Ground in the T20 World Cup.","content":"Virat Kohli has produced a vintage performance to lead India to an unlikely win over arch-rivals Pakistan in front of a packed Melbourne Cricket Ground in the T20 World Cup.","pubDate":"2022-10-23 14:24:31","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“A match for the ages”: Jasprit Bumrah elated after India win historic match vs Pakistan at the MCG","link":"https://thesportsrush.com/cricket-news-a-match-for-the-ages-jasprit-bumrah-elated-after-india-win-historic-match-vs-pakistan-at-the-mcg/","keywords":["Cricket","ICC T20 World Cup 2022","India","Jasprit Bumrah","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Jasprit Bumrah elated: The Indian fast bowler enjoyed an emphatic Indian victory at the Melbourne Cricket Ground today. The biggest setback for India before the start of ICC T20 World Cup 2022 was fast bowler Jasprit Bumrah getting ruled out of the tournament due to a back injury. Bumrah, who was himself gutted at not… The post “A match for the ages”: Jasprit Bumrah elated after India win historic match vs Pakistan at the MCG appeared first on The SportsRush.","content":"Jasprit Bumrah elated: The Indian fast bowler enjoyed an emphatic Indian victory at the Melbourne Cricket Ground today. The biggest setback for India before the start of ICC T20 World Cup 2022 was fast bowler Jasprit Bumrah getting ruled out of the tournament due to a back injury. Bumrah, who was himself gutted at not being able to lead India’s bowling attack during a world event, appears to have find some solace in the form of a 4-wicket Indian victory against Pakistan in Melbourne tonight. The 28-year old player took to social media platform Twitter to express delight at the sight of one of the most dramatic Indian victories. Although any Indian win against Pakistan is cherished by their fans, this one coming in a tournament opener and in the manner that it came will be remembered for ages according to Bumrah. Jasprit Bumrah elated after India win historic match vs Pakistan at the MCG A match for the ages! A match that’ll go down in the history books. Well done India Well done @imVkohli pic.twitter.com/Fs5bDFe2jW — Jasprit Bumrah (@Jaspritbumrah93) October 23, 2022 With their current batting unit, India would back themselves to chase a 160-run target more often than not irrespective of the opposition or conditions. However, the third Super 12 match of this World Cup presented a different kind of challenge in front of Rohit Sharma and his men. Reduced to 31/4 right after the powerplay, India needed 115 runs in the second half of their innings. In what was a monumental challenge in spite of former captain Virat Kohli and all-rounder Hardik Pandya giving early impressions of a rescue act, the equation further worsened to them needing 60 runs in the last five overs. With Pakistan fast bowlers Naseem Shah and Haris Rauf not conceding any boundary in their two overs, India were left with requiring 48 runs in three overs. It was at this point in time that Kohli hit three fours and sixes each to take absolute control of the chase and the Player of the Match award. The post “A match for the ages”: Jasprit Bumrah elated after India win historic match vs Pakistan at the MCG appeared first on The SportsRush.","pubDate":"2022-10-23 14:19:27","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"‘Best game of cricket EVER’ – India beat rivals Pakistan on final ball in World Cup classic leaving viewers stunned","link":"https://www.thesun.co.uk/sport/20198629/best-cricket-india-pakistan-world-cup-kohli/","keywords":["Cricket","Sport"],"creator":["Alex Smith"],"video_url":null,"description":null,"content":"INDIA defeated rivals Pakistan thanks to a Virat Kohli masterclass in a T20 World Cup classic. In an unbelievable end to the game, India chased 160 runs and took 16 from their final over with four wickets to spare. Virat Kohli inspired India to victoryGetty GettyIndia face the Netherlands next[/caption] A 90,293 crowd watched on at Melbourne Cricket Ground as India found themselves in a tough situation needing 13 from their final three balls. But Pakistan capitulated and India secured an incredible comeback victory that was inspired by Kohli. The 33-year-old hit a number of boundaries cutting the requirements before teammate Hardik Pandya fell. Kohli sensationally responded hitting a six off a no ball and then he was bowled but India managed to get a three of a free hit via a deflection of the stumps. READ MORE IN CRICKET SMASHING SAM Curran gets England's first T20 5-wicket haul in World Cup win vs Afghanistan PARTY STARTER PartyCasino offer: How to claim an incredible 120 FREE SPINS on Starburst There was more twists as Dinesh Karthik was then stumped only and hope seemed to be lost. But for Pakistan’s Mohammad Nawaz bowled yet another wide to new batter Ravichandran Ashwin. He needed just one off the final ball to win which he got sparking jubilant celebrations that saw Kohli fall to his knees. India’s batter Kohli said after the game: “I have no words, no idea how that happened. I just kept believing and staying there until the end. Most read in Cricket SMASHING SAM Curran gets England's first T20 5-wicket haul in World Cup win vs Afghanistan EYES ON THE PRIZE ICC T20 World Cup prize money 2022: How much do the winners get GET YOUR FIX All England's fixtures for the ICC T20 World Cup 2022 CRICKET CRAZY Latest updates on the ICC T20 World Cup including confirmed teams NO JONNY NO Bairstow shares gruesome pics of broken leg after freak accident playing golf RIP RAUF Tributes paid as legendary cricket umpire dies after suffering cardiac arrest JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) “I just feel like this was meant to be. It was a special moment. Was it my best T20 innings? “Until today I said at Mohali versus Australia was my best innings but today was one higher, given the magnitude of the game. It seemed impossible.” Pakistan’s captain Babar Azam said post-match: “Our bowlers bowled really well. “We had a chance, we asked the boys to believe in themselves and execute their plans, but credit to Kohli.” Fans could not believe what they witnessed and the performance by Kohli. He has been praised by cricket legend Sachin Tendaulker who said it was a “treat to watch you play.” Most read in Cricket SMASHING SAM Curran gets England's first T20 5-wicket haul in World Cup win vs Afghanistan EYES ON THE PRIZE ICC T20 World Cup prize money 2022: How much do the winners get GET YOUR FIX All England's fixtures for the ICC T20 World Cup 2022 CRICKET CRAZY Latest updates on the ICC T20 World Cup including confirmed teams NO JONNY NO Bairstow shares gruesome pics of broken leg after freak accident playing golf RIP RAUF Tributes paid as legendary cricket umpire dies after suffering cardiac arrest More supporters reacted online: “They call him King Kohli for a reason.” Another said: “Take a bow King Kohli.” The match has been dubbed the “best match ever” by some cricket fans online. One responded saying: “This is the best match I have ever seen in my life.” AFPThe crowd was raucous in Melbourne[/caption]","pubDate":"2022-10-23 14:14:56","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket world erupts after MCG miracle","link":"https://www.cairnspost.com.au/sport/cricket/virat-kohli-pulls-of-mcg-miracle-as-india-clinches-famous-t20-world-cup-victory-over-pakistan/news-story/33f96ad14169598f91796c1b0e5b5b1d","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Virat Kohli has pulled off a miracle in Melbourne.","content":"Cricket Don't miss out on the headlines from Cricket. Followed categories will be added to My News. Virat Kohli has pulled off a miracle in Melbourne. There were 90,293 exultant spectators at the MCG on Sunday evening, but hundreds of millions around the world witnessed the cricket phenom guide India to a thrilling final-ball victory over Pakistan in their T20 World Cup opener. The Pakistanis were seemingly cruising towards victory before Kohli flicked a switch in the 11th over of the run chase, scoring 70 runs from his final 32 deliveries to help India chase the 160-run target in dramatic scenes. Catch the T20 World Cup Live on Kayo. Don‘t Risk Missing All Your Teams’ Matches. New to Kayo? Start your free trial now > India needed 16 balls from the last over, with spinner Ravichandran Ashwin nonchalantly punching the final delivery over mid-off to secure the unforgettable win. The sold-out contest was touted as the tournament’s marquee fixture, but will be remembered as one of the biggest sporting events of the year. “I honestly have no words,” Player of the Match Kohli said in the post-match presentation. “I have no idea how that happened. “I just feel like this was meant to be. This was a very special moment.” Virat Kohli of India. Photo by Quinn Rooney/Getty Images The final over, delivered by Pakistani tweaker Mohammad Nawaz, could only be described as pure chaos. After dismissing Indian all-rounder Hardik Pandya, Nawaz conceded three runs from his next two deliveries to make the scenario 13 runs required from three balls, with Kohli on strike. But Nawaz tossed up a waist-high full toss, which Kohli promptly smacked over the square leg boundary for a six, his fourth of the evening. Controversially, umpires Rod Tucker and Marias Erasmus deemed the delivery to be a no-ball, meaning India suddenly needed seven runs from three deliveries with a free hit to come. Pakistan captain Babar Azam argued profusely with the umpires to no avail. Nawaz followed up with a wide and a well-directed yorker that crashed into Kohli’s stumps and ricocheted towards deep third man. But because the delivery was a free hit, Kohli wasn’t out, and the batters quickly scampered through for three precious byes. Two runs were then required off two balls. Indian wicketkeeper Dinesh Karthik was stumped the following delivery, bringing Ashwin to the crease with two runs needed off the final ball. And in yet another twist, Nawaz’s next delivery slid down the leg side for an agonising wide, tying the scores. Ashwin then kept his composure to score the winning runs with a classy off-drive. Pure ecstasy for India, utter heartbreak for Pakistan. Pakistan captain Babar Azam complains with the umpires. Photo by Quinn Rooney/Getty Images The MCG erupted in rapturous cheers, with countless Indian flags flying over a sea of blue as an emotional Kohli embraced his stunned teammates. Chants of “Kohli” echoed around the iconic venue as the 33-year-old exited the field following arguably the best innings of his international career. “Until today I’ve always said Mohali was always my best innings, against Australia,” Kohli said after the four-wicket victory. “I think today I will count this one higher because of the magnitude of the game and what the situation was. It seemed impossible, but Hardik kept pushing me in that partnership and we just went deep and it just happened.” Pakistan, who registered 8/159 in the first innings, should have won the match. The Indians at one stage required 48 runs from the last three overs, at which point the fielding side were firm favourites, but some ill-disciplined bowling at the death and a vintage Kohli masterclass flipped the script. Earlier, Shan Masood and Iftikhar Ahmed combined for a 76-run partnership for the third wicket, each scoring half-centuries as Pakistan posted a defendable total in the Victorian capital. Indian seamer Arshdeep Singh dismissed batting superstar Azam with his first delivery of the tournament, trapping the rival skipper on the pads for a golden duck. Singh finished with 3/32 from his four overs, while Pandya also contributed three wickets. There were 90,293 spectators at the MCG. Photo by Quinn Rooney/Getty Images India’s run chase started poorly, with captain Rohit Sharma and opening partner KR Rahul both dismissed for 4 during the Powerplay. Soon after, Suryakumar Yadav and Axar Patel fell in quick succession to leave India reeling at 4/31 in the seventh over. But Kohli and Pandya combined for a game-changing 113-run partnership for the fifth wicket, reviving India’s innings and setting up an epic finale. Cricket fans took to the streets in Sydney to celebrate the remarkable triumph, while Flinders Station in Melbourne was flooded with dancing and singing Indian supporters. No doubt there were similar scenes back in the sub-continent. Cricket world reacts to instant classic Sharma, playing in his eighth T20 World Cup tournament, labelled Kohli’s innings one of the best for India in cricket history. “He used his experience more than anything else, staying calm under pressure, and we know how good he is when the score is in front of him,” the Indian captain said. “Definitely his best for sure, but I think from the situation we were in and to come out with victory, I think it has to be one of India’s best knocks, not just his best. “We were so behind in the game and the required rate was just climbing up and up, but to chase that score was an extremely brilliant effort from Virat.” Veteran broadcaster Harsha Bhogle said on commentary: “You look at all the great wins over the years and I think you’ll find very, very few to compare with this one. “This game was gone, Virat Kohli pulled it back. What a champion, what an absolute champion he is. “This must be heartbreaking for Pakistan. “I think I’m spotting a tear in Virat Kohli’s eyes. I’ve seen Virat Kohli play for so many years, I’ve seen some of his best innings but I’ve not seen a tear in his eye and I think I spotted a tear.” . @imVkohli , it was undoubtedly the best innings of your life. It was a treat to watch you play, the six off the back foot in the 19th over against Rauf over long on was spectacular! ð® Keep it going. ð #INDvPAK #T20WorldCup pic.twitter.com/FakWPrStMg — Sachin Tendulkar (@sachin_rt) October 23, 2022 At a loss for wordsâ¦ Wouldnât have preferred anyone else with me out there @imVkohli ðð«¡ One of the best games of my life ð®ð³ pic.twitter.com/jWge1qy5lj — hardik pandya (@hardikpandya7) October 23, 2022 What an emotional game tonight. The pride we play for. A stunner of a performance by Virat kohli. We march on together ð®ð³ð§¿ pic.twitter.com/H5UIf3YwX3 — Yuzvendra Chahal (@yuzi_chahal) October 23, 2022 A match for the ages! A match thatâll go down in the history books. Well done India ð®ð³ Well done @imVkohli ð pic.twitter.com/Fs5bDFe2jW — Jasprit Bumrah (@Jaspritbumrah93) October 23, 2022 Wow this game is unbelievable!!! ð¤¯ð¤¯ #INDvsPAK — Marnus Labuschagne (@marnus3cricket) October 23, 2022 This game is ridiculous!!!! — Dale Steyn (@DaleSteyn62) October 23, 2022 Pakistan and India thank you for not letting the hype before the game turn into a fizzle. Another great match between you both, need more of it. Fans of both teams be proud of all players. #INDvPAK #T20worldcup22 — Brad Hogg (@Brad_Hogg) October 23, 2022 Kept his cool @ashwinravi99 leaving that ball for a wide !!! What a game unbelievable!!â #indiavspak is always more than a game â itâs an emotion !!! ð®ð³ greatness personified @imVkohli ð — Yuvraj Singh (@YUVSTRONG12) October 23, 2022 Oh my gosh. What a game #ICCT20WorldCup That was wild!!!! — Ian Raphael Bishop (@irbishi) October 23, 2022 I have seen Virat for so many years. I have never seen a tear in his eyes. I saw it today. This was unforgettable — Harsha Bhogle (@bhogleharsha) October 23, 2022 Love a cracking game of cricket #INDvPAK #T20WC2022 — Graeme Smith (@GraemeSmith49) October 23, 2022 As good a game as I can remember seeing in T20 cricket .. Both teams bring so much .. 90 thousand at the G .. UNBELIEVABLE .. #INDvPAK #Virat ð¥ — Michael Vaughan (@MichaelVaughan) October 23, 2022 Geeze I donât think I can ever recall a better game of T20 cricket than what weâve just seen at the MCG. Amazing stuff from both teams. Viratâs dig one of a kind.ðð — Mark Waugh (@juniorwaugh349) October 23, 2022 Originally published as Virat Kohli pulls of MCG miracle as India clinches famous T20 World Cup victory over Pakistan More related stories Cricket ‘The best’: Unbelievable MCG scenes as India triumph The MCG and Australian sport had never seen anything like the T20 World Cup clash between India and Pakistan. Read more Cricket Kohli’s ‘best ever innings’ as cheating row erupts This game is already being dubbed the best in T20 World Cup history – featuring a Virat Kohli masterclass, absurd twists and turns, and a cheating furore. Read more","pubDate":"2022-10-23 14:10:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Over 90,000 fans witnessed India vs Pakistan match from Melbourne Cricket Ground - Check Photos","link":"https://zeenews.india.com/cricket/ind-vs-pak-t20-world-cup-2022-over-90000-fans-witnessed-india-vs-pakistan-match-from-melbourne-cricket-ground-check-photos-2525921.html","keywords":null,"creator":null,"video_url":null,"description":"India defeated Pakistan in a last-ball thrillier to claim their first win of the ICC T20 World Cup 2022.","content":"If one has heard the ‘Jana Gana Mana’ at Johannesburg, Mirpur, Colombo, Kolkata, Birmingham, Adelaide, London and Manchester during an India-Pakistan game, he would vouch that Sunday was different at the Melbourne Cricket Ground. Among the 90,293 people present at the ground, at least 60,000 were Indians and the ‘Jaya He’ chorus created an atmosphere like never before. Also Read: Virat Kohli gets emotional, Rohit Sharma lifts 'KING' after 'Incredible' innings vs Pakistan - WATCH Anyone got a decibel meter at the @MCG ? This is just next level. #INDvPAK #T20WorldCup https://t.co/ShSclG2rRi — Mel Jones (@meljones_33) October 23, 2022 #IndVsPak #T20WorldCup Theatre of Dreams. @MCG pic.twitter.com/IxQxSjttte — KaamKiBaat (@KaamkiiBaat) October 23, 2022 90,293 fans in the house! What a way to start our @T20WorldCup matches! #t20worldcup #INDvPAK Photo: Darrian Traynor - ICC/ICC via Getty Images https://t.co/uc2wuuUa3b pic.twitter.com/HG65LbE86Q — Melbourne Cricket Ground (@MCG) October 23, 2022 The G! ___ @MCG pic.twitter.com/Zivcf5nkH4 — Crickdom (@Crickdom7) October 23, 2022 An awesome atmosphere right now outside the @MCG for the @ICC @T20WorldCup #INDvPAK match. Thousands of @BCCI & @TheRealPCB fans in attendance. Who you got for the win? _ #T20WorldCup #MelbourneMoments pic.twitter.com/qMDvDWtdr8 — Melbourne, Australia (@Melbourne) October 23, 2022 The fans are here, the sun is shining. __ Let's play some cricket! _ One hour until game time! pic.twitter.com/ZrZPNea5KJ — Melbourne Cricket Ground (@MCG) October 23, 2022 It's massive match India v Pakistan at mighty @MCG Awesome pre match function with fans with @Uz_Khawaja @MervHughes332 and Robin Uthappa _ #ICCT20WorldCup _ pic.twitter.com/Qj3u4FcbOB — Damien Fleming (@bowlologist) October 23, 2022 _______ ______ _ The sun's out at the @MCG _ #PAKvIND #Pakistan #India #T20WorldCup #CricketTwitter pic.twitter.com/fCJTMZtR9P — CricWick (@CricWick) October 23, 2022 It was even humbling for Indian team skipper Rohit Sharma, who looked a touch emotional as he looked heavenwards, trying hard to keep his emotions under check. “I am opening my first restaurant in Bangkok and there is a lot of pressure due to logistical issues. My visa got cancelled once and I had to reapply and got it on second go. “I bought air ticket worth Rs 1 lakh one way to reach on the day of the match,” Kolkata- based Samiran Chowdhury couldn’t stop grinning ear to ear as he proudly flaunted his match ticket. There wasn’t any such tension for his friend Dipanjan Ghosh, a software professional, who has made Melbourne his home for the last 12 years. “I have never missed any of India’s matches across formats at the MCG. I have watched Ashes, too, but nothing beats this atmosphere,” he said. Two Pakistani supporters, Abbas and Azaan, had come from Sydney and are planning to follow the team to every city. From the morning itself, Melbourne’s bustling CBD (Central Business District) was literally under Indo-Pak siege. At the famous Federation square, India and Pakistan fans danced together and yelled their guts out, easily crossing the permissible decibel limit. But who cares when emotions run high. The most hilarious scene at the Federation Square was when Pakistani fans outnumbered the Indians at a certain time, and even as chants of ‘Bharat Mata Ki Jai’ and ‘Vande Mataram’ made an impact, the pitch of ‘Pakistan Zindabad’ and ‘Jeeve Jeeve Pakistan’ was slightly higher. One Sardarji took it upon himself and shouted ‘Ganpati Bappa Maurya’ and, in unison, the entire Indian lot joined. Parity was restored. There was a group of people who had come from the UK and were dressed like saints. One enthusiastic Indian reporter (don’t know whether from a channel or an YouTuber) asked the elderly gentleman “Baba ji, kya aap Indian team ko Ashirwad denge”. But the most remarkable aspect was the bonhomie. There was no malice, no aggression as they enjoyed each and every moment together. A lot of them, in fact, know each other, having lived in the same localities or worked in the same organization in Australia, and this match was like one big party for them. The MCG at night looked splendid and even more spectacular, when the floodlights were switched off for a couple minutes, and the entire crowd switched on their cell-phone lights. An Indian intruder wanted to shake hands with Bhuvneshwar Kumar but was apprehended quickly. He will pay a fine of AUD 9313.20. A few brought loudspeakers and 50-odd joined immediately to groove to “Amritsari Chudiyaa”. It was very difficult to control the urge of not grooving while forgetting professional duties. The ICC must have realized that systematic cricket tourism in coming years could turn into a commercial behemoth. The economic potential is mind numbing. Sport does indeed bring people together. The supporters from the two nations, who share a common border, also share their common love for the game. On Sunday, they celebrated their love for the game and left everyone yearning for more. -With Inputs From PTI","pubDate":"2022-10-23 14:08:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs PAK, T20 World Cup 2022: Fans hail the 'King' as India thump Pakistan in thriller","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-pak-t20-world-cup-2022-fans-hail-the-king-as-india-thump-pakistan-in-thriller-melbourne-cricket-ground-2022-10-23-818429","keywords":null,"creator":null,"video_url":null,"description":"IND vs PAK, T20 World Cup 2022: Some stories are made in this beautiful game and there are historic feats that unfold on the field. This game was something and we will carry it to our graves and we will not forget it till the end of our lives. When things looked bleak and all hopes were gone, one member wearing the blues with the number 18 etched on it burdened the hopes of millions and led them through a phase of turmoil. With the Melbourne Cricket Ground (MCG) rising Kohli was painted in blue as R. Ashwin hit the winning runs.","content":null,"pubDate":"2022-10-23 14:03:37","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"India edge Pakistan in WCup thriller","link":"https://www.arabtimesonline.com/news/india-edge-pakistan-in-wcup-thriller/","keywords":["Sports","India Vs Pakistan"],"creator":["Arab Times"],"video_url":null,"description":"Sri Lanka crush Ireland in Super 12 opener MELBOURNE, Australia, Oct 23, (AP): Virat Kohli produced an astonishing performance to lead India to a stunning final-ball triumph over arch-rivals Pakistan in a dramatic Twenty20 World Cup opener on Sunday. Arriving at the crease with India under pressure, Kohli delivered one of the finest innings played … The post India edge Pakistan in WCup thriller appeared first on ARAB TIMES - KUWAIT NEWS.","content":"Sri Lanka crush Ireland in Super 12 opener MELBOURNE, Australia, Oct 23, (AP): Virat Kohli produced an astonishing performance to lead India to a stunning final-ball triumph over arch-rivals Pakistan in a dramatic Twenty20 World Cup opener on Sunday. Arriving at the crease with India under pressure, Kohli delivered one of the finest innings played at the MCG to steer India to a fourwicket victory in the Group 2 Super 12 opener. India’s Virat Kohli hits a six during the T20 World Cup cricket match between India and Pakistan in Melbourne, Australia The thriller played in front of 90,293 fans was stark in contrast to a Group 1 match played earlier on Sunday in Hobart where Sri Lanka coasted to a ninewicket win over Ireland. Kohli set the tempo of his innings perfectly, batting conservatively early in partnership with Hardik Pandya before stepping up late as India reeled in Pakistan’s tally of 159-8. Describing it as the finest T20 innings of his career, the India legend finished unbeaten on 82 from 53 balls but was stuck at the non-striker’s end in a surreal finish to the match. When Mohammad Nawaz removed Pandya for 40 off 37 balls with the first ball of the final over, India still needed 16 runs for victory. But the Pakistan spinner then lost his nerve. Kohli struck a six from a no-ball on the fourth ball of the over and Nawaz then bowled a wide. He then bowled Kohli, who had the benefit of a free hit courtesy of the wide. Alert to the ball ricocheting from the stumps, the Indian batters ran three byes to reduce the target to two runs off two balls. But that left Kohli off strike. Nawaz had Dinesh Karthik stumped with the second last ball, but then bowled another wide, leaving Ravichandran Ashwin needing only a single to secure victory for India. “It’s a surreal atmosphere. I honestly have no words. I have no idea how that happened,” Kohli said. After sending their rivals in, India placed Pakistan under significant pressure when removing star batter Mohammad Rizwan and captain Babar Azam in the first four overs. Pakistan struggled to find rhythm in overcast conditions until a surge from Iftikhar Ahmed midway through their innings helped them to a competitive tally. Ahmed made 51 from 34 balls, at one stage striking four sixes in six balls, with three of them coming from off-spinner Axar Patel. He was well supported by Shan Masood, who finished unbeaten on 52 from 42 balls. India faltered early in their chase courtesy of a combination of brilliant bowling, poor shots and misjudged running. After India fell to 31-4 when Axar Patel was judged run out in a contentious decision, Kohli and Pandya set about resurrecting their nation’s hopes. The pair, who combined for a partnership of 113, worked the ball around the spacious MCG and brought up India’s 100 with five overs remaining. This left India requiring 60 from 30 balls. India’s captain Rohit Sharma said that after losing early wickets, the key was trying to stay in the match for as long as possible. With Kohli at the crease, he still had belief. “From the situation we were in, it has to be one of India’s best knocks, not just his best knock,” he said. His Pakistan counterpart Azam was stunned after the loss but paid tribute to Kohli, the man of the match. Earlier, Sri Lanka secured victory with five overs to spare against Ireland in both teams’ Twenty20 World Cup Super 12 opener. After Ireland had won the toss and chose to bat first in overcast and wintry conditions at Bellerive Oval, Sri Lanka’s bowlers made regular breakthroughs to restrict the Irish to 128-8 after its 20 overs. Chasing 129 for victory never proved a difficult challenge for Sri Lanka, which chased down the belowpar target with ease. Kusal Mendis top scored with 68 off 43 balls, with five boundaries and three sixes, including hitting a six to win the match off the final ball of the 15th over. Sri Lanka raced to 50 without loss at the end of their 6-over power play with Mendis and Dhananjaya de Silva removing any nervousness Sri Lanka may have had chasing a low target. Spinner Gareth Delaney had Dhananjaya caught behind for 31 in the ninth over. But that was a brief respite as Charith Asalanka made a brisk 31 off 22 balls as part of a 70-run partnership with Mendis to close-out an impressive victory for Sri Lanka. Paul Stirling (34 ) and Harry Tector (45) top scored for Ireland and were the only two batters to get some momentum in their innings as too many of their teammates played poor shots and gave their wickets away cheaply to prevent a more competitive total being reached. Captain Andrew Balbirnie (one) and Locran Tucker (10), two of Ireland’s heroes in a famous win against twotime champions the West Indies on Friday to qualify for the Super 12 stage, were both bowled around their legs shuffl ing across the crease. Ireland’s innings never really recovered from that slow start as spinners Maheesh Theekshana (2-19 from four overs) and Wanindu Hasaranga (2- 25 from four overs) took two wickets apiece to keep Sri Lanka in control. Theekshana bowled Lorcan Tucker inside the powerplay overs before returning late to remove George Dockrell and break a 47-run partnership between Dockrell and Harry Tector, who top scored with 45 from 42. Both teams qualified for the Super 12 stage through a dramatic qualifying round that was played over six days. Ireland crushed two-time defending champions the West Indies by nine wickets on Friday to clinch their spot in Group 1 of the second stage behind Zimbabwe. Sri Lanka, which won their maiden Twenty20 World Cup in 2014, had a poor start to their qualifying round losing to Namibia, but responded with victories over the United Arab Emirates and the Netherlands to stay alive in the tournament. The post India edge Pakistan in WCup thriller appeared first on ARAB TIMES - KUWAIT NEWS.","pubDate":"2022-10-23 14:00:00","image_url":null,"source_id":"arabtimesonline","country":["Kuwait"],"category":["sports"],"language":"arabic"},{"title":"5 Netflix Bollywood movies to celebrate Diwali","link":"https://www.deseret.com/2022/10/23/23391818/best-bollywood-movies-netflix","keywords":null,"creator":["Gitanjali Poonia"],"video_url":null,"description":null,"content":"The season’s first snow in Utah coincides with Diwali, the Hindu festival of lights, this year. Rainchecks will be in order as winter storms rage on the day of the festival, Oct. 24. But there may be a silver lining — delicious takeout and a Bollywood movie marathon. Although, it’s worth mentioning that these films can sometimes cross the three-hour threshold. The Hindu holiday celebrates the victory of light over darkness and gives family and friends the opportunity to gather together. There’s the food, the traditional outfits — whether that’s a saree or a salwar-kameez — and the sense of community. Here are my top five film recommendations — from comedy to drama — to bring a little color to your life this Diwali weekend. Synopsis: Starting with a classic right off the bat, this movie starring Aamir Khan is a sports drama film set in India under British rule, according to IMDb . One village is under threat of a tax hike but the mighty farmers decide to oppose the oppressive decision, challenging the British to a game of cricket. The first cut of this Oscar-winning movie was nearly seven hours long, but the filmmakers brought it down to 3.7 hours. Where to watch: Netflix. Rating: PG. Synopsis: This story brings forbidden love, as seen in “Romeo and Juliet,” in addition to family drama full of secrets and deception. “After marrying a poor woman, rich Rahul is disowned by his father and moves to London to build a new life. Years later, his now-grown younger brother Rohan embarks on a mission to bring Rahul back home and reunite the family,” according to IMDb . This film features an iconic Diwali scene. Where to watch: Netflix. Rating: PG. Synopsis: This film revolves around a group of students who are participating in a documentary project about freedom fighters during the colonial rule. But the chain of events take a turn when political injustices in their own lives become obvious. This tear-jerker stars Aamir Khan and Soha Ali Khan. Where to watch: Netflix. Rating: PG. Synopsis: This romantic comedy follows a depressed and wealthy businessman whose life changes when he meets a carefree girl. They meet on a train and she decides to tag along with him to get home. She is set to marry someone else but, of course, things don’t go according to plan. Where to watch: Netflix. Rating: PG. Synopsis: On a lighter note, this movie — the title translates to “You Only Live Once” — brings three friends together as they go on an adventurous vacation to Europe after one of them gets engaged. While there are plenty of humorous moments, the narrated poetry supplies deeper meaning. Where to watch: Netflix. Rating: PG.","pubDate":"2022-10-23 14:00:00","image_url":null,"source_id":"deseret","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"IND vs PAK: WATCH I Rohit Sharma erupts in joy; lifts Virat Kohli after win for the ages","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-pak-watch-i-rohit-sharma-erupts-in-joy-lifts-virat-kohli-after-win-for-the-ages-india-beat-pakistan-in-super-12-match-of-t20-world-cup-2022-2022-10-23-818423","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: The Indian cricket team defeated Pakistan in one of the most mind-blowing matches in the history of Cricket. Led by former Indian skipper Virat Kohli, the men in blue snatched the victory from the jaws of defeat against Babar Azam's troops in a thrilling match. Kohli masterminded the chase while Hardik Pandya's contribution supported the former. In the end, the match came down to the wire and displayed out to be one of the best that these two nations have ever played.","content":": The Indian cricket team defeated Pakistan in one of the most mind-blowing matches in the history of Cricket. Led by former Indian skipper , the men in blue snatched the victory from the jaws of defeat against 's troops in a thrilling match. Kohli masterminded the chase while 's contribution supported the former. In the end, the match came down to the wire and displayed out to be one of the best that these two nations have ever played. Just when Ravichandran Ashwin and Virat Kohli completed the winning run, the whole of the Indian team erupted in joy. The Indian skipper was quick to show his emotions onto the ground as he lifted Virat Kohli up in his arms to twirl him around. After the match, Virat Kohli was hugged and appreciated by all his team mates as well. ICC shared the video titling it as, \"Everybody is a Virat Kohli fan.\" The Indian team was in a big hole when they were four down 6.1 overs with just 31 on board. With not much batting to come and the run rate getting bigger, it seemed all over. But Virat Kohli's knock, partnered by Hardik Pandya's contribution, took India out of the hole to snatch the victory out of nowhere. In the end, India emerged victorious by 4 wickets. The Indian cricket team is currently in the top spot in the points table of Group 2. Rohit Sharma's men will next face the Netherlands on October 27. Rohit Sharma (c), , Virat Kohli, Suryakumar Yadav, Hardik Pandya, (wk), Axar Patel, Ravichandran Ashwin, , , Arshdeep Singh Babar Azam (c), Mohammad Rizwan (wk), Shan Masood, , Haider Ali, Iftikhar Ahmed, Mohammad Nawaz, Asif Ali, Shaheen Afridi, Naseem Shah, Haris Rauf","pubDate":"2022-10-23 13:45:40","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"One day Vamika will understand that her dad played his best innings that night and her mother was dancing around wildly: Anushka on Virat’s knock","link":"https://www.tribuneindia.com/news/sports/one-day-vamika-will-understand-that-her-dad-played-his-best-innings-that-night-and-her-mother-was-dancing-around-wildly-anushka-on-virats-knock-444072","keywords":null,"creator":null,"video_url":null,"description":"Mumbai, October 23Bollywood star Anuska Sharma on Sunday praised her husband and cricketer Virat Kohli for his \"grit and determination\" as he powered India to a magical four-wicket over Pakistan in a thrilling T20 World Cup game on Sunday at the Melbourne Cricket Ground.Anushka, who often accompanies Virat to his games, watched the nailbiter of a match on TV like several other cricket fans. She is currently shooting for \"Chakda Xpress\", a film based on cricketer Jhulan Goswami's life, in Kolkata.The actor said their 21-month-old daughter Vamika will one day understand why her mother was \"dancing around and screaming wildly\" in the room.\"... One day she will understand that her dad played his best innings that night which followed after a phase that was tough on him but he came out of it stronger and wiser than ever before! \"So proud of you !! Your strength is contagious and you my love, are LIMITLESS!! Love you forever and through thick and thin,\" the actor-producer wrote in a note on her official Instagram account.In his own words, Virat had no idea how he had engineered India's epic win over arch-rivals Pakistan in their blockbuster T20 World Cup face-off after \"struggling\" with his form in these last months.\"Well, it's a surreal atmosphere. I honestly have no words. I have no idea how that happened. Till today I said Mohali was my best T20 innings. Then I got 82 off 52, today I got 82 off 53. Both are just as special.\"I will count this one higher because of the magnitude of the occasion and the situation we were in. All these months when I was struggling, you guys (the crowd) kept me going. Thank you so much,\" said Virat after his incredible knock in the team's big-ticket tournament opener.Terming the game the \"best match\" of her life, Anushka said her husband had brought joy in people's lives on Diwali eve.\"You beauty!! You freaking beauty!! You have brought sooooo much joy in peoples lives tonight and that too on the eve of Diwali! You are a wonderful wonderful man my love.\"Your grit, determination and belief is mind boggling!! I have just watched the best match of my life I can say (sic),\" she wrote alongside a series of pictures of her watching the match.Many fans took to Twitter to \"thank\" Anushka after Virat scored a phenomenal unbeaten 82-run knock to anchor a chase of 160 which felt like a lost cause after the Men in Blue were scrambling to find a foothold at 31 runs for the loss of 4 wickets.Even before they got married, the actor has often been subjected to trolling and abuse on social media whenever the right-hand batter failed to put up an impressive number on the board.\"The wife #AnushkaSharma. After everything you guys said about her she is here standing besides her husband,\" wrote a user.\"Everyone say thank you to Anushka Sharma and Vamika Kohli,\" said another.In January 2022, Anushka had penned a heartfelt note for Virat Kohli when he stepped down as the Test captain of the Indian men's cricket team, following the 2ndash;1 test series defeat against South Africa during the tour of South Africa. The cricketer quit as India's T20 captain last September and was later replaced by current skipper Rohit Sharma as ODI captain by the BCCI in December.","content":"PTI Mumbai, October 23 Bollywood star Anuska Sharma on Sunday praised her husband and cricketer Virat Kohli for his “grit and determination” as he powered India to a magical four-wicket over Pakistan in a thrilling T20 World Cup game on Sunday at the Melbourne Cricket Ground. Anushka, who often accompanies Virat to his games, watched the nailbiter of a match on TV like several other cricket fans. She is currently shooting for “Chakda Xpress”, a film based on cricketer Jhulan Goswami’s life, in Kolkata. The actor said their 21-month-old daughter Vamika will one day understand why her mother was “dancing around and screaming wildly” in the room. “... One day she will understand that her dad played his best innings that night which followed after a phase that was tough on him but he came out of it stronger and wiser than ever before! “So proud of you !! Your strength is contagious and you my love, are LIMITLESS!! Love you forever and through thick and thin,” the actor-producer wrote in a note on her official Instagram account. In his own words, Virat had no idea how he had engineered India’s epic win over arch-rivals Pakistan in their blockbuster T20 World Cup face-off after “struggling” with his form in these last months. “Well, it’s a surreal atmosphere. I honestly have no words. I have no idea how that happened. Till today I said Mohali was my best T20 innings. Then I got 82 off 52, today I got 82 off 53. Both are just as special. “I will count this one higher because of the magnitude of the occasion and the situation we were in. All these months when I was struggling, you guys (the crowd) kept me going. Thank you so much,” said Virat after his incredible knock in the team’s big-ticket tournament opener. Terming the game the “best match” of her life, Anushka said her husband had brought joy in people’s lives on Diwali eve. “You beauty!! You freaking beauty!! You have brought sooooo much joy in peoples lives tonight and that too on the eve of Diwali! You are a wonderful wonderful man my love. “Your grit, determination and belief is mind boggling!! I have just watched the best match of my life I can say (sic),” she wrote alongside a series of pictures of her watching the match. Many fans took to Twitter to “thank” Anushka after Virat scored a phenomenal unbeaten 82-run knock to anchor a chase of 160 which felt like a lost cause after the Men in Blue were scrambling to find a foothold at 31 runs for the loss of 4 wickets. Even before they got married, the actor has often been subjected to trolling and abuse on social media whenever the right-hand batter failed to put up an impressive number on the board. “The wife #AnushkaSharma. After everything you guys said about her she is here standing besides her husband,” wrote a user. “Everyone say thank you to Anushka Sharma and Vamika Kohli,” said another. In January 2022, Anushka had penned a heartfelt note for Virat Kohli when he stepped down as the Test captain of the Indian men’s cricket team, following the 2–1 test series defeat against South Africa during the tour of South Africa. The cricketer quit as India’s T20 captain last September and was later replaced by current skipper Rohit Sharma as ODI captain by the BCCI in December.","pubDate":"2022-10-23 13:40:00","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1158783450.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs PAK, T20 World Cup: Virat Kohli guides India to victory with Midas touch; Sachin shares heartfelt post","link":"https://www.indiatvnews.com/sports/cricket/virat-kohli-guides-india-to-victory-with-midas-touch-twitter-reacts-sachin-tendulkar-ind-vs-pak-t20-world-cup-2022-10-23-818420","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli owned the grand stage at the Melbourne Cricket Stadium with a knock to remember for the ages as he guided India to an epic four-wicket over Pakistan on Sunday.","content":"owned the grand stage at the Melbourne Cricket Stadium with a knock to remember for the ages as he guided India to an epic four-wicket over Pakistan on Sunday. In the thrilling T20 World Cup game that was witnessed by 90,000 boisterous fans, Kohli managed to turn the tables in India's favour with his brilliant batting. King Kohli played a magical and memorable 83-run knock to anchor a chase of 160 which became tricky after India were left in tatters at 31/4. Kohli smashed 82 runs off 53 deliveries including six boundaries and four sixes. shared a heartfelt message, Kohli's amazing innings made fans jump with excitement. Fans shared their love and wishes in form of posts on their social media handles. India Playing XI: , , Virat Kohli, Suryakumar Yadav, , , Axar Patel, Ravichandran Ashwin, , , Arshdeep Singh Pakistan Playing XI: , Shaheen Afridi, Mohammad Rizwan, Shan Masood, Haider Ali, Iftikhar Ahmed, , Mohammad Nawaz, Asif Ali, Naseem Shah, Haris Rauf","pubDate":"2022-10-23 13:35:31","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket world erupts after MCG miracle - news.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMirwFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L3ZpcmF0LWtvaGxpLXB1bGxzLW9mLW1jZy1taXJhY2xlLWFzLWluZGlhLWNsaW5jaGVzLWZhbW91cy10MjAtd29ybGQtY3VwLXZpY3Rvcnktb3Zlci1wYWtpc3Rhbi9uZXdzLXN0b3J5LzMzZjk2YWQxNDE2OTU5OGY5MTc5NmMxYjBlNWI1YjFk0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Cricket world erupts after MCG miracle  news.com.auIndia beat Pakistan in classic Men's T20 World Cup contest at the MCG  ABC NewsA rivalry bigger than cricket: India and Pakistan fans rejoice in an MCG encounter  Sydney Morning HeraldVirat Kohli moved to tears after remarkable World Cup rescue act against Pakistan  Wide World of SportsView Full coverage on Google News","content":null,"pubDate":"2022-10-23 13:33:30","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"}]}