{"newsArray":[{"title":"IPL 2023: LSG vs MI | I played for my father, he was in ICU for last 10 days, says Mohsin Khan","link":"https://www.thehindu.com/sport/cricket/ipl-2023-lsg-vs-mi-i-played-for-my-father-he-was-in-icu-for-last-10-days-says-mohsin-khan/article66858991.ece","keywords":null,"creator":null,"video_url":null,"description":"The 24-year-old had a sensational season last year but he missed whole of domestic season and most part of the IPL this year due to a left shoulder injury.","content":"Architect of Lucknow Super Giants' thrilling five-run win over Mumbai Indians, left-arm pacer Mohin Khan on May 16 dedicated his performance to his ailing father, who was discharged from the hospital after spending 10 days in the ICU. The 24-year-old from Uttar Pradesh had a sensational season last year but he missed whole of domestic season and most part of the IPL this year due to a left shoulder injury. Playing only his second match in 2023 IPL, Khan defended 11 runs off the final over against the destructive Tim David as Lucknow Super Giants inched closer to the IPL playoffs with a five-run win over Mumbai Indians. “It’s been a tough time as I was injured, playing after a year. My father got discharged from the ICU yesterday and he was in the hospital for the last 10 days and I did it for him, he would have been watching,” he said at the presentation. “I’m grateful to the team and the support staff, Gautam (Gambhir) sir, Vijay (Dahiya) sir for playing me this game even though I did not do well in the last game.” Talking about his plan in the final over, Khan said: “The plan was to execute what I did in practice. Even Krunal was talking to me and I told him the same. “The run-up is the same, did not change it in the last over. I was trying to calm myself down, not look at the scoreboard and bowl the 6 balls well. “Since the wicket was gripping, I tried the slower ball, but I bowled two of those and then changed to the yorker and it was reversing as well.” Mumbai Indians skipper Rohit Sharma said his team couldn’t win the little moments and lost its way in the second half of the chase. “We didn’t play well enough to win the game. There were little moments in the game that we didn’t win unfortunately. “We assessed the pitch really well and it was a good pitch to bat on and that score was definitely chaseable and we lost our way in the second half of the innings.” With Marcus Stoinis (89 off 47 balls) on song, Mumbai leaked 54 runs in the last three overs. “We gave too many runs at the back end and the last three overs went for a few. But the way we started with the bat we were in a good position to chase, but like I said we lost our way in the second half. “He (Stoinis) played really well, kept hitting straight which is what you need to do on a pitch like this. It was a brilliant knock from him.”","pubDate":"2023-05-16 19:37:43","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"India deserve the money, but the ICC needs to work out a better system","link":"https://www.thehindu.com/sport/cricket/india-deserve-the-money-but-the-icc-needs-to-work-out-a-better-system/article66857664.ece","keywords":null,"creator":null,"video_url":null,"description":null,"content":"In the days when there was no money in cricket, England, part of a colonial power, and Australia, a largely white colony, ruled the game. As the two original members of the ICC (International Cricket Council now), they had the power of veto. It was a skewed system. Still, England saw it as a moral responsibility to take the game to the colonies. Perhaps they needed teams they thought they could beat; perhaps it was a way of inculcating certain values in the locals. Perhaps was to emphasise Englishness through sport. Whatever it was, and despite the obvious condescension involved, the game spread. India, the West Indies, New Zealand were all playing Test cricket by the 1930s; South Africa played their first Test in 1889, and played a ‘World Cup’ with the other two ICC members of the time, England and Australia in 1912. That triangular series flopped badly. Perhaps the realisation dawned then that the cozy club was too cozy. There needed to be greater variety, a better range of styles, more diversity. Now, over a century later, history (and geography) has been replaced by money as the basis of the cozy club. England have some, Australia have a bit, and India have lots. In 2014, these three countries decided to hijack the sport by proposing a share of the ICC’s financial pie that gave them the biggest portions and left the crumbs for the rest. India were already the richest and most influential cricketing nation. I wrote in these columns then that the problem with a unipolar world is that the greatest good for the greatest number is replaced by the greatest good for number one. The administration of cricket has always been guided by self-interest. As Osman Samiuddin wrote in Wisden India Almanack, “decision-making (was) about bigger self-interests leaning down heavily on smaller self-interests until an overlap was found — or the right bargain struck.” Self-interest is not such a bad thing if it coincides with universal interest, but it seldom does. Nearly a decade after the Big Three’s hijack bid, the ICC has proposed a similar surplus revenue-sharing model. In the cycle, 2024-27, the ICC proposes that of its $600 million annual surplus India take home $231 million or 38.5%. England get the next highest share of $41.33 million (6.89%), followed by Australia ($ 37.53 or 6.25 percent) down to Afghanistan ($16.82 million or 2.8 percent). The proposal will be discussed at the ICC meeting next month. How did the ICC arrive at these figures? Each full member (there are 12 Test-playing countries) starts level. Then such things as cricket history, performance at ICC events, progress of women’s cricket and commercial contribution to the kitty are considered. There is a vagueness about some of these factors (how do you put a number to cricket history?), and the marking will necessarily be arbitrary. India’s commercial value, however, cannot be doubted. For so long after their debut in 1932 were India in the second tier of international cricket, with few victories, less money and fewer chances of getting to the high table that the table-turning provoked feelings of unbridled nationalism. Through all those decades, India had one strength above all others — its population. We were people then, we are a market now. Television and digital media are willing to pay mind-boggling sums of money to capture this market. India have reached a situation where they don’t need the ICC money. The Big Three apart, most countries are dependent on ICC handouts and cannot afford to displease India whose tours fill their coffers. India demanding their pound of flesh as the country that contributes the greatest amount of money to the cricket economy is understandable. Self-interest rules. But shouldn’t the ICC look beyond that and towards the growth of the game? Sure, in the short term the ICC cannot do without India. But India cannot do without the ICC either, or they will be reduced to playing a couple of countries over and over again till television loses interest. India’s argument that a lot of the money goes to corrupt national boards that do nothing for cricket is a valid one. The ICC must put in place systems to check this. It cannot be the ICC’s sole policy to keep India happy and let the rest take care of itself. Governing bodies have greater responsibilities than national ones. There is money in cricket, as ICC’s $600 million surplus shows. But not all of it is going towards development of the game. The countries that need it most are getting the least amount, and that cannot be good for the game.","pubDate":"2023-05-16 19:00:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Pakistan unhappy with new ICC revenue model, demands clarity","link":"https://www.samaaenglish.tv/news/40035393/sports-pakistan-unhappy-with-new-icc-revenue-model-demands-clarity","keywords":["Sports"],"creator":null,"video_url":null,"description":"The Pakistan Cricket Board (PCB) is unhappy with the proposed new revenue distribution model for international cricket although it accepts that India, the game’s financial engine, should get the biggest share, chairman Najam Sethi told Reuters. The International Cricket Council (ICC), the game’s global governing body, has proposed a new revenue sharing model for the 2024-27 cycle to be voted on at its next board meeting in June. According to figures leaked to Cricinfo, India would claim 38.5%, while England and Australia would pocket 6.89% and 6.25% respectively. Pakistan stands to earn 5.75% of the ICC’s projected earnings, primarily from its media rights sale. The 12 full members of the ICC would collectively get 88.81%, while the rest would be distributed among its 96 associate members. “We are insisting that the ICC should tell us how these figures were arrived at,” Sethi told Reuters from London. “We are not happy with the situation as it stands. “Come June, when the board is expected to approve the financial model, unless these details are provided to us, we are not going to approve it.” India generates an estimated 80% of ICC revenue and Disney Star shelled out $3 billion last year to acquire the 2024-27 media rights for the Indian market. Sethi said the PCB had already asked the ICC to explain how its finance and commercial affairs committee, headed by Indian cricket board secretary Jay Shah, determined the share. Despite the fact that all nations will get more money, Sethi said at least two other test playing nations were not happy with the model and had sought more details. The ICC, which considered factors such as the performance of a country’s men’s and women’s teams and their contribution to the ICC’s commercial revenue, was not immediately available to comment.","content":"The International Cricket Council (ICC), the game’s global governing body, has proposed a new revenue sharing model for the 2024-27 cycle to be voted on at its next board meeting in June. According to figures leaked to Cricinfo, India would claim 38.5%, while England and Australia would pocket 6.89% and 6.25% respectively. Pakistan stands to earn 5.75% of the ICC’s projected earnings, primarily from its media rights sale. The 12 full members of the ICC would collectively get 88.81%, while the rest would be distributed among its 96 associate members. “We are insisting that the ICC should tell us how these figures were arrived at,” Sethi told Reuters from London. “We are not happy with the situation as it stands. “Come June, when the board is expected to approve the financial model, unless these details are provided to us, we are not going to approve it.” India generates an estimated 80% of ICC revenue and Disney Star shelled out $3 billion last year to acquire the 2024-27 media rights for the Indian market. Sethi said the PCB had already asked the ICC to explain how its finance and commercial affairs committee, headed by Indian cricket board secretary Jay Shah, determined the share. Despite the fact that all nations will get more money, Sethi said at least two other test playing nations were not happy with the model and had sought more details. The ICC, which considered factors such as the performance of a country’s men’s and women’s teams and their contribution to the ICC’s commercial revenue, was not immediately available to comment.","pubDate":"2023-05-16 16:50:10","image_url":"https://i.samaaenglish.tv/large/2023/05/16214938836e2ea.jpg?r=215010","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Elite athletes dodge cricket balls, walkers, picnic parties, food karts while warming up","link":"https://indianexpress.com/article/sports/sport-others/elite-athletes-dodge-cricket-balls-walkers-picnic-parties-food-karts-while-warming-up-8613195/","keywords":["Sport Others","Sports"],"creator":["Andrew Amsan"],"video_url":null,"description":null,"content":null,"pubDate":"2023-05-16 16:36:28","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Aussie star Scott Boland backs Ash Gardner's call on Australia Day celebrations","link":"https://www.dailymail.co.uk/sport/afl/article-12089257/Aussie-star-Scott-Boland-backs-Ash-Gardners-call-Australia-Day-celebrations.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Scott Boland has voiced his support for Ashleigh Gardner's suggestion Australia Day should be celebrated on a different day, but stopped short of saying cricket should not be played on the day.","content":null,"pubDate":"2023-05-16 15:15:57","image_url":"https://i.dailymail.co.uk/1s/2023/05/16/16/71051213-0-image-a-2_1684250127275.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Steve Smith delivers brutal response after Jofra Archer was ruled out of England's Ashes squad","link":"https://www.dailymail.co.uk/sport/cricket/article-12090297/Steve-Smith-delivers-brutal-response-Jofra-Archer-ruled-Englands-Ashes-squad.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Steve Smith has fired back against claims he will be relieved to avoid Jofra Archer in the upcoming Ashes series after being struck twice by the England quick four years ago.","content":null,"pubDate":"2023-05-16 15:11:28","image_url":"https://i.dailymail.co.uk/1s/2023/05/16/16/71050523-0-image-a-15_1684249847774.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gujarat mein hoon, mera khana nahi milega na: Mohammed Shami’s cracks up Ravi Shastri with post-match comments","link":"https://indianexpress.com/article/sports/cricket/mohammed-shami-gujarat-food-ravi-shastri-ipl-2023-titans-8613082/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-16 15:06:38","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Punjab Kings ready for final Playoffs push as IPL returns to Dharamshala after 10 years","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/pbks-vs-dc-ipl-2023-dharamshala-playoffs-qualification-scenario-punjab-kings-delhi-capitals/article66858228.ece","keywords":null,"creator":null,"video_url":null,"description":"PBKS registered four consecutive totals in excess of 200 but its bowlers let it down in two of those games.","content":null,"pubDate":"2023-05-16 14:48:15","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"The chargers: Why Tendulkar’s rush down the track to pacers is superior to versions of Rohit and Kohli","link":"https://indianexpress.com/article/sports/cricket/the-chargers-sachin-tendulkar-rush-down-the-track-pacers-rohit-sharma-and-virat-kohli-8613029/","keywords":["Cricket","Sports"],"creator":["Sriram Veera"],"video_url":null,"description":null,"content":null,"pubDate":"2023-05-16 14:23:07","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: LSG vs MI | Mumbai opts to bowl against Lucknow","link":"https://www.thehindu.com/sport/cricket/indian-premier-league-2023-lucknow-super-giants-vs-mumbai-indians-in-lucknow/article66857992.ece","keywords":null,"creator":null,"video_url":null,"description":"While Mumbai went in with four seamers; Lucknow made three changes to its side.","content":null,"pubDate":"2023-05-16 14:03:31","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: LSG vs MI | I played for my father, he was in ICU for last 10 days, says Mohsin Khan","link":"https://www.thehindu.com/sport/cricket/ipl-2023-lsg-vs-mi-i-played-for-my-father-he-was-in-icu-for-last-10-days-says-mohsin-khan/article66858991.ece","keywords":null,"creator":null,"video_url":null,"description":"The 24-year-old had a sensational season last year but he missed whole of domestic season and most part of the IPL this year due to a left shoulder injury.","content":"Architect of Lucknow Super Giants' thrilling five-run win over Mumbai Indians, left-arm pacer Mohin Khan on May 16 dedicated his performance to his ailing father, who was discharged from the hospital after spending 10 days in the ICU. The 24-year-old from Uttar Pradesh had a sensational season last year but he missed whole of domestic season and most part of the IPL this year due to a left shoulder injury. Playing only his second match in 2023 IPL, Khan defended 11 runs off the final over against the destructive Tim David as Lucknow Super Giants inched closer to the IPL playoffs with a five-run win over Mumbai Indians. “It’s been a tough time as I was injured, playing after a year. My father got discharged from the ICU yesterday and he was in the hospital for the last 10 days and I did it for him, he would have been watching,” he said at the presentation. “I’m grateful to the team and the support staff, Gautam (Gambhir) sir, Vijay (Dahiya) sir for playing me this game even though I did not do well in the last game.” Talking about his plan in the final over, Khan said: “The plan was to execute what I did in practice. Even Krunal was talking to me and I told him the same. “The run-up is the same, did not change it in the last over. I was trying to calm myself down, not look at the scoreboard and bowl the 6 balls well. “Since the wicket was gripping, I tried the slower ball, but I bowled two of those and then changed to the yorker and it was reversing as well.” Mumbai Indians skipper Rohit Sharma said his team couldn’t win the little moments and lost its way in the second half of the chase. “We didn’t play well enough to win the game. There were little moments in the game that we didn’t win unfortunately. “We assessed the pitch really well and it was a good pitch to bat on and that score was definitely chaseable and we lost our way in the second half of the innings.” With Marcus Stoinis (89 off 47 balls) on song, Mumbai leaked 54 runs in the last three overs. “We gave too many runs at the back end and the last three overs went for a few. But the way we started with the bat we were in a good position to chase, but like I said we lost our way in the second half. “He (Stoinis) played really well, kept hitting straight which is what you need to do on a pitch like this. It was a brilliant knock from him.”","pubDate":"2023-05-16 19:37:43","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"India deserve the money, but the ICC needs to work out a better system","link":"https://www.thehindu.com/sport/cricket/india-deserve-the-money-but-the-icc-needs-to-work-out-a-better-system/article66857664.ece","keywords":null,"creator":null,"video_url":null,"description":null,"content":"In the days when there was no money in cricket, England, part of a colonial power, and Australia, a largely white colony, ruled the game. As the two original members of the ICC (International Cricket Council now), they had the power of veto. It was a skewed system. Still, England saw it as a moral responsibility to take the game to the colonies. Perhaps they needed teams they thought they could beat; perhaps it was a way of inculcating certain values in the locals. Perhaps was to emphasise Englishness through sport. Whatever it was, and despite the obvious condescension involved, the game spread. India, the West Indies, New Zealand were all playing Test cricket by the 1930s; South Africa played their first Test in 1889, and played a ‘World Cup’ with the other two ICC members of the time, England and Australia in 1912. That triangular series flopped badly. Perhaps the realisation dawned then that the cozy club was too cozy. There needed to be greater variety, a better range of styles, more diversity. Now, over a century later, history (and geography) has been replaced by money as the basis of the cozy club. England have some, Australia have a bit, and India have lots. In 2014, these three countries decided to hijack the sport by proposing a share of the ICC’s financial pie that gave them the biggest portions and left the crumbs for the rest. India were already the richest and most influential cricketing nation. I wrote in these columns then that the problem with a unipolar world is that the greatest good for the greatest number is replaced by the greatest good for number one. The administration of cricket has always been guided by self-interest. As Osman Samiuddin wrote in Wisden India Almanack, “decision-making (was) about bigger self-interests leaning down heavily on smaller self-interests until an overlap was found — or the right bargain struck.” Self-interest is not such a bad thing if it coincides with universal interest, but it seldom does. Nearly a decade after the Big Three’s hijack bid, the ICC has proposed a similar surplus revenue-sharing model. In the cycle, 2024-27, the ICC proposes that of its $600 million annual surplus India take home $231 million or 38.5%. England get the next highest share of $41.33 million (6.89%), followed by Australia ($ 37.53 or 6.25 percent) down to Afghanistan ($16.82 million or 2.8 percent). The proposal will be discussed at the ICC meeting next month. How did the ICC arrive at these figures? Each full member (there are 12 Test-playing countries) starts level. Then such things as cricket history, performance at ICC events, progress of women’s cricket and commercial contribution to the kitty are considered. There is a vagueness about some of these factors (how do you put a number to cricket history?), and the marking will necessarily be arbitrary. India’s commercial value, however, cannot be doubted. For so long after their debut in 1932 were India in the second tier of international cricket, with few victories, less money and fewer chances of getting to the high table that the table-turning provoked feelings of unbridled nationalism. Through all those decades, India had one strength above all others — its population. We were people then, we are a market now. Television and digital media are willing to pay mind-boggling sums of money to capture this market. India have reached a situation where they don’t need the ICC money. The Big Three apart, most countries are dependent on ICC handouts and cannot afford to displease India whose tours fill their coffers. India demanding their pound of flesh as the country that contributes the greatest amount of money to the cricket economy is understandable. Self-interest rules. But shouldn’t the ICC look beyond that and towards the growth of the game? Sure, in the short term the ICC cannot do without India. But India cannot do without the ICC either, or they will be reduced to playing a couple of countries over and over again till television loses interest. India’s argument that a lot of the money goes to corrupt national boards that do nothing for cricket is a valid one. The ICC must put in place systems to check this. It cannot be the ICC’s sole policy to keep India happy and let the rest take care of itself. Governing bodies have greater responsibilities than national ones. There is money in cricket, as ICC’s $600 million surplus shows. But not all of it is going towards development of the game. The countries that need it most are getting the least amount, and that cannot be good for the game.","pubDate":"2023-05-16 19:00:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Pakistan unhappy with new ICC revenue model, demands clarity","link":"https://www.samaaenglish.tv/news/40035393/sports-pakistan-unhappy-with-new-icc-revenue-model-demands-clarity","keywords":["Sports"],"creator":null,"video_url":null,"description":"The Pakistan Cricket Board (PCB) is unhappy with the proposed new revenue distribution model for international cricket although it accepts that India, the game’s financial engine, should get the biggest share, chairman Najam Sethi told Reuters. The International Cricket Council (ICC), the game’s global governing body, has proposed a new revenue sharing model for the 2024-27 cycle to be voted on at its next board meeting in June. According to figures leaked to Cricinfo, India would claim 38.5%, while England and Australia would pocket 6.89% and 6.25% respectively. Pakistan stands to earn 5.75% of the ICC’s projected earnings, primarily from its media rights sale. The 12 full members of the ICC would collectively get 88.81%, while the rest would be distributed among its 96 associate members. “We are insisting that the ICC should tell us how these figures were arrived at,” Sethi told Reuters from London. “We are not happy with the situation as it stands. “Come June, when the board is expected to approve the financial model, unless these details are provided to us, we are not going to approve it.” India generates an estimated 80% of ICC revenue and Disney Star shelled out $3 billion last year to acquire the 2024-27 media rights for the Indian market. Sethi said the PCB had already asked the ICC to explain how its finance and commercial affairs committee, headed by Indian cricket board secretary Jay Shah, determined the share. Despite the fact that all nations will get more money, Sethi said at least two other test playing nations were not happy with the model and had sought more details. The ICC, which considered factors such as the performance of a country’s men’s and women’s teams and their contribution to the ICC’s commercial revenue, was not immediately available to comment.","content":"The International Cricket Council (ICC), the game’s global governing body, has proposed a new revenue sharing model for the 2024-27 cycle to be voted on at its next board meeting in June. According to figures leaked to Cricinfo, India would claim 38.5%, while England and Australia would pocket 6.89% and 6.25% respectively. Pakistan stands to earn 5.75% of the ICC’s projected earnings, primarily from its media rights sale. The 12 full members of the ICC would collectively get 88.81%, while the rest would be distributed among its 96 associate members. “We are insisting that the ICC should tell us how these figures were arrived at,” Sethi told Reuters from London. “We are not happy with the situation as it stands. “Come June, when the board is expected to approve the financial model, unless these details are provided to us, we are not going to approve it.” India generates an estimated 80% of ICC revenue and Disney Star shelled out $3 billion last year to acquire the 2024-27 media rights for the Indian market. Sethi said the PCB had already asked the ICC to explain how its finance and commercial affairs committee, headed by Indian cricket board secretary Jay Shah, determined the share. Despite the fact that all nations will get more money, Sethi said at least two other test playing nations were not happy with the model and had sought more details. The ICC, which considered factors such as the performance of a country’s men’s and women’s teams and their contribution to the ICC’s commercial revenue, was not immediately available to comment.","pubDate":"2023-05-16 16:50:10","image_url":"https://i.samaaenglish.tv/large/2023/05/16214938836e2ea.jpg?r=215010","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Elite athletes dodge cricket balls, walkers, picnic parties, food karts while warming up","link":"https://indianexpress.com/article/sports/sport-others/elite-athletes-dodge-cricket-balls-walkers-picnic-parties-food-karts-while-warming-up-8613195/","keywords":["Sport Others","Sports"],"creator":["Andrew Amsan"],"video_url":null,"description":null,"content":null,"pubDate":"2023-05-16 16:36:28","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Aussie star Scott Boland backs Ash Gardner's call on Australia Day celebrations","link":"https://www.dailymail.co.uk/sport/afl/article-12089257/Aussie-star-Scott-Boland-backs-Ash-Gardners-call-Australia-Day-celebrations.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Scott Boland has voiced his support for Ashleigh Gardner's suggestion Australia Day should be celebrated on a different day, but stopped short of saying cricket should not be played on the day.","content":null,"pubDate":"2023-05-16 15:15:57","image_url":"https://i.dailymail.co.uk/1s/2023/05/16/16/71051213-0-image-a-2_1684250127275.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Steve Smith delivers brutal response after Jofra Archer was ruled out of England's Ashes squad","link":"https://www.dailymail.co.uk/sport/cricket/article-12090297/Steve-Smith-delivers-brutal-response-Jofra-Archer-ruled-Englands-Ashes-squad.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Steve Smith has fired back against claims he will be relieved to avoid Jofra Archer in the upcoming Ashes series after being struck twice by the England quick four years ago.","content":null,"pubDate":"2023-05-16 15:11:28","image_url":"https://i.dailymail.co.uk/1s/2023/05/16/16/71050523-0-image-a-15_1684249847774.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gujarat mein hoon, mera khana nahi milega na: Mohammed Shami’s cracks up Ravi Shastri with post-match comments","link":"https://indianexpress.com/article/sports/cricket/mohammed-shami-gujarat-food-ravi-shastri-ipl-2023-titans-8613082/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-16 15:06:38","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Punjab Kings ready for final Playoffs push as IPL returns to Dharamshala after 10 years","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/pbks-vs-dc-ipl-2023-dharamshala-playoffs-qualification-scenario-punjab-kings-delhi-capitals/article66858228.ece","keywords":null,"creator":null,"video_url":null,"description":"PBKS registered four consecutive totals in excess of 200 but its bowlers let it down in two of those games.","content":null,"pubDate":"2023-05-16 14:48:15","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"The chargers: Why Tendulkar’s rush down the track to pacers is superior to versions of Rohit and Kohli","link":"https://indianexpress.com/article/sports/cricket/the-chargers-sachin-tendulkar-rush-down-the-track-pacers-rohit-sharma-and-virat-kohli-8613029/","keywords":["Cricket","Sports"],"creator":["Sriram Veera"],"video_url":null,"description":null,"content":null,"pubDate":"2023-05-16 14:23:07","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: LSG vs MI | Mumbai opts to bowl against Lucknow","link":"https://www.thehindu.com/sport/cricket/indian-premier-league-2023-lucknow-super-giants-vs-mumbai-indians-in-lucknow/article66857992.ece","keywords":null,"creator":null,"video_url":null,"description":"While Mumbai went in with four seamers; Lucknow made three changes to its side.","content":null,"pubDate":"2023-05-16 14:03:31","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: LSG vs MI | I played for my father, he was in ICU for last 10 days, says Mohsin Khan","link":"https://www.thehindu.com/sport/cricket/ipl-2023-lsg-vs-mi-i-played-for-my-father-he-was-in-icu-for-last-10-days-says-mohsin-khan/article66858991.ece","keywords":null,"creator":null,"video_url":null,"description":"The 24-year-old had a sensational season last year but he missed whole of domestic season and most part of the IPL this year due to a left shoulder injury.","content":"Architect of Lucknow Super Giants' thrilling five-run win over Mumbai Indians, left-arm pacer Mohin Khan on May 16 dedicated his performance to his ailing father, who was discharged from the hospital after spending 10 days in the ICU. The 24-year-old from Uttar Pradesh had a sensational season last year but he missed whole of domestic season and most part of the IPL this year due to a left shoulder injury. Playing only his second match in 2023 IPL, Khan defended 11 runs off the final over against the destructive Tim David as Lucknow Super Giants inched closer to the IPL playoffs with a five-run win over Mumbai Indians. “It’s been a tough time as I was injured, playing after a year. My father got discharged from the ICU yesterday and he was in the hospital for the last 10 days and I did it for him, he would have been watching,” he said at the presentation. “I’m grateful to the team and the support staff, Gautam (Gambhir) sir, Vijay (Dahiya) sir for playing me this game even though I did not do well in the last game.” Talking about his plan in the final over, Khan said: “The plan was to execute what I did in practice. Even Krunal was talking to me and I told him the same. “The run-up is the same, did not change it in the last over. I was trying to calm myself down, not look at the scoreboard and bowl the 6 balls well. “Since the wicket was gripping, I tried the slower ball, but I bowled two of those and then changed to the yorker and it was reversing as well.” Mumbai Indians skipper Rohit Sharma said his team couldn’t win the little moments and lost its way in the second half of the chase. “We didn’t play well enough to win the game. There were little moments in the game that we didn’t win unfortunately. “We assessed the pitch really well and it was a good pitch to bat on and that score was definitely chaseable and we lost our way in the second half of the innings.” With Marcus Stoinis (89 off 47 balls) on song, Mumbai leaked 54 runs in the last three overs. “We gave too many runs at the back end and the last three overs went for a few. But the way we started with the bat we were in a good position to chase, but like I said we lost our way in the second half. “He (Stoinis) played really well, kept hitting straight which is what you need to do on a pitch like this. It was a brilliant knock from him.”","pubDate":"2023-05-16 19:37:43","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"India deserve the money, but the ICC needs to work out a better system","link":"https://www.thehindu.com/sport/cricket/india-deserve-the-money-but-the-icc-needs-to-work-out-a-better-system/article66857664.ece","keywords":null,"creator":null,"video_url":null,"description":null,"content":"In the days when there was no money in cricket, England, part of a colonial power, and Australia, a largely white colony, ruled the game. As the two original members of the ICC (International Cricket Council now), they had the power of veto. It was a skewed system. Still, England saw it as a moral responsibility to take the game to the colonies. Perhaps they needed teams they thought they could beat; perhaps it was a way of inculcating certain values in the locals. Perhaps was to emphasise Englishness through sport. Whatever it was, and despite the obvious condescension involved, the game spread. India, the West Indies, New Zealand were all playing Test cricket by the 1930s; South Africa played their first Test in 1889, and played a ‘World Cup’ with the other two ICC members of the time, England and Australia in 1912. That triangular series flopped badly. Perhaps the realisation dawned then that the cozy club was too cozy. There needed to be greater variety, a better range of styles, more diversity. Now, over a century later, history (and geography) has been replaced by money as the basis of the cozy club. England have some, Australia have a bit, and India have lots. In 2014, these three countries decided to hijack the sport by proposing a share of the ICC’s financial pie that gave them the biggest portions and left the crumbs for the rest. India were already the richest and most influential cricketing nation. I wrote in these columns then that the problem with a unipolar world is that the greatest good for the greatest number is replaced by the greatest good for number one. The administration of cricket has always been guided by self-interest. As Osman Samiuddin wrote in Wisden India Almanack, “decision-making (was) about bigger self-interests leaning down heavily on smaller self-interests until an overlap was found — or the right bargain struck.” Self-interest is not such a bad thing if it coincides with universal interest, but it seldom does. Nearly a decade after the Big Three’s hijack bid, the ICC has proposed a similar surplus revenue-sharing model. In the cycle, 2024-27, the ICC proposes that of its $600 million annual surplus India take home $231 million or 38.5%. England get the next highest share of $41.33 million (6.89%), followed by Australia ($ 37.53 or 6.25 percent) down to Afghanistan ($16.82 million or 2.8 percent). The proposal will be discussed at the ICC meeting next month. How did the ICC arrive at these figures? Each full member (there are 12 Test-playing countries) starts level. Then such things as cricket history, performance at ICC events, progress of women’s cricket and commercial contribution to the kitty are considered. There is a vagueness about some of these factors (how do you put a number to cricket history?), and the marking will necessarily be arbitrary. India’s commercial value, however, cannot be doubted. For so long after their debut in 1932 were India in the second tier of international cricket, with few victories, less money and fewer chances of getting to the high table that the table-turning provoked feelings of unbridled nationalism. Through all those decades, India had one strength above all others — its population. We were people then, we are a market now. Television and digital media are willing to pay mind-boggling sums of money to capture this market. India have reached a situation where they don’t need the ICC money. The Big Three apart, most countries are dependent on ICC handouts and cannot afford to displease India whose tours fill their coffers. India demanding their pound of flesh as the country that contributes the greatest amount of money to the cricket economy is understandable. Self-interest rules. But shouldn’t the ICC look beyond that and towards the growth of the game? Sure, in the short term the ICC cannot do without India. But India cannot do without the ICC either, or they will be reduced to playing a couple of countries over and over again till television loses interest. India’s argument that a lot of the money goes to corrupt national boards that do nothing for cricket is a valid one. The ICC must put in place systems to check this. It cannot be the ICC’s sole policy to keep India happy and let the rest take care of itself. Governing bodies have greater responsibilities than national ones. There is money in cricket, as ICC’s $600 million surplus shows. But not all of it is going towards development of the game. The countries that need it most are getting the least amount, and that cannot be good for the game.","pubDate":"2023-05-16 19:00:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Pakistan unhappy with new ICC revenue model, demands clarity","link":"https://www.samaaenglish.tv/news/40035393/sports-pakistan-unhappy-with-new-icc-revenue-model-demands-clarity","keywords":["Sports"],"creator":null,"video_url":null,"description":"The Pakistan Cricket Board (PCB) is unhappy with the proposed new revenue distribution model for international cricket although it accepts that India, the game’s financial engine, should get the biggest share, chairman Najam Sethi told Reuters. The International Cricket Council (ICC), the game’s global governing body, has proposed a new revenue sharing model for the 2024-27 cycle to be voted on at its next board meeting in June. According to figures leaked to Cricinfo, India would claim 38.5%, while England and Australia would pocket 6.89% and 6.25% respectively. Pakistan stands to earn 5.75% of the ICC’s projected earnings, primarily from its media rights sale. The 12 full members of the ICC would collectively get 88.81%, while the rest would be distributed among its 96 associate members. “We are insisting that the ICC should tell us how these figures were arrived at,” Sethi told Reuters from London. “We are not happy with the situation as it stands. “Come June, when the board is expected to approve the financial model, unless these details are provided to us, we are not going to approve it.” India generates an estimated 80% of ICC revenue and Disney Star shelled out $3 billion last year to acquire the 2024-27 media rights for the Indian market. Sethi said the PCB had already asked the ICC to explain how its finance and commercial affairs committee, headed by Indian cricket board secretary Jay Shah, determined the share. Despite the fact that all nations will get more money, Sethi said at least two other test playing nations were not happy with the model and had sought more details. The ICC, which considered factors such as the performance of a country’s men’s and women’s teams and their contribution to the ICC’s commercial revenue, was not immediately available to comment.","content":"The International Cricket Council (ICC), the game’s global governing body, has proposed a new revenue sharing model for the 2024-27 cycle to be voted on at its next board meeting in June. According to figures leaked to Cricinfo, India would claim 38.5%, while England and Australia would pocket 6.89% and 6.25% respectively. Pakistan stands to earn 5.75% of the ICC’s projected earnings, primarily from its media rights sale. The 12 full members of the ICC would collectively get 88.81%, while the rest would be distributed among its 96 associate members. “We are insisting that the ICC should tell us how these figures were arrived at,” Sethi told Reuters from London. “We are not happy with the situation as it stands. “Come June, when the board is expected to approve the financial model, unless these details are provided to us, we are not going to approve it.” India generates an estimated 80% of ICC revenue and Disney Star shelled out $3 billion last year to acquire the 2024-27 media rights for the Indian market. Sethi said the PCB had already asked the ICC to explain how its finance and commercial affairs committee, headed by Indian cricket board secretary Jay Shah, determined the share. Despite the fact that all nations will get more money, Sethi said at least two other test playing nations were not happy with the model and had sought more details. The ICC, which considered factors such as the performance of a country’s men’s and women’s teams and their contribution to the ICC’s commercial revenue, was not immediately available to comment.","pubDate":"2023-05-16 16:50:10","image_url":"https://i.samaaenglish.tv/large/2023/05/16214938836e2ea.jpg?r=215010","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Elite athletes dodge cricket balls, walkers, picnic parties, food karts while warming up","link":"https://indianexpress.com/article/sports/sport-others/elite-athletes-dodge-cricket-balls-walkers-picnic-parties-food-karts-while-warming-up-8613195/","keywords":["Sport Others","Sports"],"creator":["Andrew Amsan"],"video_url":null,"description":null,"content":null,"pubDate":"2023-05-16 16:36:28","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Aussie star Scott Boland backs Ash Gardner's call on Australia Day celebrations","link":"https://www.dailymail.co.uk/sport/afl/article-12089257/Aussie-star-Scott-Boland-backs-Ash-Gardners-call-Australia-Day-celebrations.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Scott Boland has voiced his support for Ashleigh Gardner's suggestion Australia Day should be celebrated on a different day, but stopped short of saying cricket should not be played on the day.","content":null,"pubDate":"2023-05-16 15:15:57","image_url":"https://i.dailymail.co.uk/1s/2023/05/16/16/71051213-0-image-a-2_1684250127275.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Steve Smith delivers brutal response after Jofra Archer was ruled out of England's Ashes squad","link":"https://www.dailymail.co.uk/sport/cricket/article-12090297/Steve-Smith-delivers-brutal-response-Jofra-Archer-ruled-Englands-Ashes-squad.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Steve Smith has fired back against claims he will be relieved to avoid Jofra Archer in the upcoming Ashes series after being struck twice by the England quick four years ago.","content":null,"pubDate":"2023-05-16 15:11:28","image_url":"https://i.dailymail.co.uk/1s/2023/05/16/16/71050523-0-image-a-15_1684249847774.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gujarat mein hoon, mera khana nahi milega na: Mohammed Shami’s cracks up Ravi Shastri with post-match comments","link":"https://indianexpress.com/article/sports/cricket/mohammed-shami-gujarat-food-ravi-shastri-ipl-2023-titans-8613082/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-16 15:06:38","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Punjab Kings ready for final Playoffs push as IPL returns to Dharamshala after 10 years","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/pbks-vs-dc-ipl-2023-dharamshala-playoffs-qualification-scenario-punjab-kings-delhi-capitals/article66858228.ece","keywords":null,"creator":null,"video_url":null,"description":"PBKS registered four consecutive totals in excess of 200 but its bowlers let it down in two of those games.","content":null,"pubDate":"2023-05-16 14:48:15","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"The chargers: Why Tendulkar’s rush down the track to pacers is superior to versions of Rohit and Kohli","link":"https://indianexpress.com/article/sports/cricket/the-chargers-sachin-tendulkar-rush-down-the-track-pacers-rohit-sharma-and-virat-kohli-8613029/","keywords":["Cricket","Sports"],"creator":["Sriram Veera"],"video_url":null,"description":null,"content":null,"pubDate":"2023-05-16 14:23:07","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: LSG vs MI | Mumbai opts to bowl against Lucknow","link":"https://www.thehindu.com/sport/cricket/indian-premier-league-2023-lucknow-super-giants-vs-mumbai-indians-in-lucknow/article66857992.ece","keywords":null,"creator":null,"video_url":null,"description":"While Mumbai went in with four seamers; Lucknow made three changes to its side.","content":null,"pubDate":"2023-05-16 14:03:31","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"}]}