{"newsArray":[{"title":"Michael Clarke’s hall of fame limbo underlines his complicated legacy","link":"https://www.watoday.com.au/sport/cricket/michael-clarke-s-hall-of-fame-limbo-underlines-his-complicated-legacy-20230202-p5chbo.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Michael Clarke has a hall of fame record. Exclusion from the company of other greats underlines his complicated legacy.","content":"Michael Clarke has a hall of fame record for Australia. Exclusion from the company of other greats of the game underlines his complicated legacy. Ian Redpath’s induction this week, alongside Margaret Jennings , was in recognition of not only one of the nation’s flintiest Test match openers but also an admired team man and contributor to the game in retirement. Michael Clarke celebrates his triple century at the SCG in 2012. Credit: Getty Images In addition to allowing for one of the more entertaining induction speeches of recent times, the decision to add Redpath to a select group of the cream of Australian cricket had another less intentional effect - highlighting the absence of Clarke. In 2020, Clarke reached five years since his international retirement at the end of the 2015 Ashes series, making him eligible for inclusion. Based purely on his numbers with the bat, and his win/loss record as a captain at home in particular, Clarke would have been a candidate for immediate elevation to the group. Moreover, in a career that took place entirely after the Allan Border Medal was first awarded in 2000, Clarke’s trio of medals and quartet of Shane Warne Test player of the year trophies make him comfortably the most decorated player of his generation. But if there is hesitance to induct Clarke, it comes from a combination of reservations about some elements of his story, and also a wider reckoning with an era of Australian cricket that elevated the value of winning while achieving less than the era before it. Leaving high school in Year 11 to become a professional cricketer, after growing up with parents who owned an indoor cricket centre, Clarke’s focus on becoming the best he could possibly be was never in doubt. But there was a certain narrowness to him and others who followed in the men’s game, increasingly flushed as it became with money and commercial opportunity. As an example, take Clarke’s comments a year ago complaining about the Allan Border Medal itself.","pubDate":"2023-02-02 00:31:15","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Central Stags, Hinds named for Hamilton - Central Districts Cricket","link":"http://www.voxy.co.nz/sport/5/412500","keywords":["Sport"],"creator":null,"video_url":null,"description":"Ross Taylor and Doug Bracewell have returned for the Central Stags’ must-win Dream11 Super Smash clash with Northern Brave tomorrow evening, while young ManawatÅ« talent Sam Mackinder is celebrating selection in the Central Hinds squad for the first time.","content":"Ross Taylor and Doug Bracewell have returned for the Central Stags’ must-win Dream11 Super Smash clash with Northern Brave tomorrow evening, while young ManawatÅ« talent Sam Mackinder is celebrating selection in the Central Hinds squad for the first time. Taylor returns from a groin injury that saw him miss the last two away games, while allrounder Bracewell returns from the BLACKCAPS squad. Making way for the experienced pair in an expanded squad of 13 is wicketkeeper Bayley Wiggins, Ma’ara Ave set to take the gloves for the team in the big last round of the regular season. A New Zealand MÄori Schoolgirls representative in recent seasons, Mackinder comes into the Central Hinds squad alongside fellow ManawatÅ« rep Ashtuti Kumar and Taranaki’s Emily Cunningham, with the experienced trio of Mikaela Greig, Melissa Hansen and Kerry Tomlinson unavailable for the Friday afternoon match with personal commitments. The Stags will head into their game on equal points with Northern Brave men, with Brave holding the third spot on the table and the Stags in fourth spot by dint of net run rate. That means to lock in Finals qualification (only the top three teams progress), the Stags need to win against the defending men’s champion. Tom Bruce (79 not out off 45 balls) and Will Young (53 off 33) are both coming off explosive half centuries in Dunedin where a stunning knock by young Volt Ben Lockrose snatched the match away at the death. Bruce's ballistic 79 not out is one of the highest scores this season nationally, while Young has now scored two half tons from just four knocks. One of two top-class left-arm spinners in the Stags alongside Ajaz Patel, Jayden Lennox is meanwhile the league's top wicket-taker, his career-best 4-28 in Dunedin propelling him to 15 victims from eight games at a 15.33 average. Young Hawke’s Bay allrounder Flora Devonshire impressed for the Hinds in all facets of the game in Dunedin, the left-hander top-scoring with 39 off 27 balls, tidy with the ball and taking a great field catch. The Hinds pushed the Sparks to the last over in a six-wicket win for their hosts that leaves the Hinds looking to get their elusive first win in tomorrow's last round, which will be the team's last T20 of the season. Captain Natalie Dodd remains the leading run-scorer nationally in the women’s Dream11 Super Smash with 324 runs from nine innings, including four fifties - the most by any player in either the men’s or women’s league this summer. Young right-hander Mackinder has impressed for ManawatÅ« in The Mike Shrimpton Trophy and scored a half century in Hamilton against Northern Districts A for Central Districts A earlier this season, in a match-winning century stand with Emma McLeod who is just back from the ICC Under 19 World Cup in South Africa. The Hinds will remain in Hamilton to play Round Six of the national 50-over Hallyburton Johnstone Shield on Saturday, with the one-day squad to be announced tomorrow. The Central Stags will also be back in one-day mode over the Waitangi long weekend with a free admission Ford Trophy match against Northern Districts at Napier's McLean Park from 11am on Waitangi Day, Monday 6 February. The Stags remain top of the Ford Trophy table, and will be back again at McLean Park for the final regular season round on Tuesday, 14 February, against Canterbury, both Ford Trophy matches with a free livestream. Both the Central Stags and Hinds T20s tomorrow are live and on demand at Spark Sport as well as live on free to air TVNZ Duke, with livescoring at www.cdcricket.co.nz. The Hallyburton Johnstone Shield and Ford Trophy are free livestream games at www.cdcricket.co.nz. DREAM11 SUPER SMASH ROUND 10 SEDDON PARK Friday, 3 Febuary 3PM - Central Hinds v Northern Brave women 6.50PM - Central Stags v Northern Brave men Both matches live on Spark Sport and TVNZ Duke CENTRAL HINDS Natalie Dodd - captain, wicketkeeper, Taranaki Jess Watkin - vice-captain, ManawatÅ« Georgia Atkinson - ManawatÅ« Ocean Bartlett - Wairarapa Priyanaz Chatterji - Overseas player Emily Cunningham - Taranaki Flora Devonshire - Hawke’s Bay Kate Gaging - Nelson Claudia Green - Nelson Ashtuti Kumar - ManawatÅ« Sam Mackinder - uncapped, ManawatÅ« Rosemary Mair - Hawke’s Bay COACH - Jamie Watkins CENTRAL STAGS Tom Bruce - captain, Taranaki Ma’ara Ave - wicketkeeper, ManawatÅ« Doug Bracewell - Hawke’s Bay Will Clark - Hawke’s Bay Josh Clarkson - Nelson Jayden Lennox - Hawke’s Bay Ajaz Patel - Hawke’s Bay Brett Randell Bevan Small - ManawatÅ« Ben Smith - Whanganui Ross Taylor - ManawatÅ« /Wairarapa Ray Toole - ManawatÅ« Will Young - Taranaki COACH - Rob Walter Unavailable contracted players Dane Cleaver (BLACKCAPS in India) Blair Tickner (BLACKCAPS in India) Hannah Rowe (WHITE FERNS in South Africa) Joey Field (shoulder injury) Seth Rance (shoulder injury) Liam Dudding (forearm injury) Mikaela Greig (personal commitments) Melissa Hansen (personal commitments) Kerry Tomlinson (personal commitments)","pubDate":"2023-02-01 23:07:05","image_url":null,"source_id":"voxy","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"सचिन तेंदुलकर ने शानदार स्पीच देकर महिला अंडर-19 विश्व कप विजेता भारतीय टीम का किया ज़ोरदार स्वागत","link":"https://sports.ndtv.com/hindi/cricket/sachin-tendulkar-welcomed-the-u-19-world-cup-winning-indian-team-by-giving-a-speech-3744148#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत की अंडर-19 महिला क्रिकेट टीम (U19 Women's World Cup Final) के विश्व कप जीत कर घर लौटने पर महान क्रिकेटर सचिन तेंदुलकर ज़ोरदार स्पीच देकर स्वागत किया है.","content":"सचिन तेंदुलकर ने जूनियर महिला टीम का किया ज़ोरदार स्वागत भारत की अंडर-19 महिला क्रिकेट टीम के विश्व कप जीत कर घर लौटने पर महान क्रिकेटर सचिन तेंदुलकर ज़ोरदार स्पीच देकर स्वागत किया है. भारत और न्यूज़ीलैंड के बीच अहमदाबाद टी20 मैच से पहले शेफाली वर्मा की अगुवाई वाली भारतीय टीम का स्वागत किया गया है. बता दें कि बीसीसीआई ने विश्व चैंपियन जूनियर भारतीय टीम को 5 करोड़ की इनामी राशि से नवाज़ा है. \"The entire nation will celebrate and cherish your victory\" Master Blaster delivers a speech at the Narendra Modi Stadium, Ahmedabad as the BCCI felicitates the victorious U19 Women's Team at the Listen in here👇👇 Sachin Tendulkar addresses the U19 T20 World Cup winning Indian women's team in Ahmedabad, Shafali Verma and Co pose with the cheque for Rs 5 crore that has been mentioned already as the reward for the team and staff. बीसीसीआई सचिव जय शाह ने इसकी जानकारी दी है. उन्होंने ट्वीट करते हुए लिखा कि \" हमें इस बात की बेहद खुशी है कि भारत रत्न श्री सचिन तेंदुलकर और बीसीसीआई के अन्य पदाधिकारी महिला अंडर-19 टीम को 1 फरवरी को नरेंद्र मोदी क्रिकेट स्टेडियम अहमदाबाद में शाम 6:30 बजे सम्मानित करेंगे. भारत की इन युवा प्रतिभाओ ने देश को गौरवान्वित किया है और हम उनकी इस उपलब्धि पर उनका सम्मान करेंगे.\" It is with great delight I share that Bharat Ratna Shri and Office Bearers will felicitate the victorious India U19 team on Feb 1st in Narendra Modi Stadium at 6:30 PM IST. The young cricketers have made India proud and we will honour their achievements. दक्षिण अफ्रीका की मेज़बानी में पहली बार आयोजित हुए महिला अंडर-19 विश्व कप का फाइनल भारत और इंग्लैंड के बीच खेला गया. जिसमें टीम इंडिया ने 7 विकेट से जीत दर्ज करते हुए एक नए अध्याय की शुरुआत कर दी. फाइनल मुकाबले में भारत की कप्तान शैफाली वर्मा ने टॉस जीतकर पहले गेंदबाज़ी करने का फैसला लिया और इंग्लैंड की टीम को मात्र 68 रन के स्कोर पर ऑलआउट कर दिया. वहीं इस लक्ष्य को भारतीय टीम ने 3 विकेट खोकर हासिल कर लिया. भारतीय जूनियर टीम के चैंपियन बनते ही भारतीय क्रिकेट कंट्रोल बोर्ड ने 5 करोड़ की इनामी राशि का एलान कर दिया. बता दें कि टीम की इस जीत में महत्वपूर्ण रोल अदा करने वाले कोचिंग और स्पोर्ट स्टाफ में इस राशि को बांटा जाएगा. * * पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:09:31","image_url":"https://c.ndtvimg.com/2023-02/2dbu6b7g_sachin-tendulkar_625x300_01_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"तीसरे टी20 में भी पृथ्वी शॉ को नहीं मिली जगह, ट्विटर पर फैंस ने निकाली भड़ास","link":"https://sports.ndtv.com/hindi/cricket/prithvi-shaw-did-not-get-a-place-in-the-third-t20-as-well-fans-expressed-their-anger-on-twitter-3744472#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में तीसरा टी20 मैच खेला जा रहा है. जिसमें भारतीय टीम की प्लेइंग इलेवन को लेकर लोग ट्विटर पर सवाल उठा रहे हैं.","content":"पृथ्वी शॉ को नहीं मिली भारतीय इलेवन में जगह भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में तीसरा टी20 मैच खेला जा रहा है. जिसमें भारतीय टीम की प्लेइंग इलेवन को लेकर लोग ट्विटर पर सवाल उठा रहे हैं. दरअसल घरेलू क्रिकेट में लगातार शानदार प्रदर्शन कर रहे पृथ्वी शॉ को टीम में तो शामिल कर लिया गया, लेकिन तीनों ही टी20 मैचों की प्लेइंग इलेवन में उन्हें जगह नहीं मिल पाई. जिसे लेकर फैंस काफी निराश नज़र आ रहे हैं. पृथ्वी शॉ के चाहने वाले अब ट्विटर पर लगातार भड़ास निकाल रहे हैं. Ruturaj and prithvi shaw to shubman and ishan 🙂 Prithvi Shaw will be benched again in the 3rd T20 match against New Zealand! If Prithvi Shaw doesn't play for India, its India's loss. Not his loss 🤙 Prithvi Shaw in dressing room. Heartbreaking wait continues for Prithvi Shaw 💔💔 What are you doing BCCI Management & Hardik Pandya Just destroy talented cricketers.. Need to take care of them. Abomination Nonsense 😡 Hardik should apologise to Prithvi Shaw for including him in the squad but not even giving 1 match to play. If Rahul Tripathi can be given 3 matches, why not Prithvi? This really shows how scared Hardik is to not let him show his skills. Ishan Kishan's record of last 10 t20 matches is not good but he gets a place in the team so why not give Prithvi Shaw a chance today?? * * पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:08:35","image_url":"https://c.ndtvimg.com/2023-01/jjs37348_prithvi-shaw-806_625x300_27_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शुभमन गिल ने करियर का पहला टी20 शतक जड़कर बनाया बड़ा रिकॉर्ड, विराट कोहली को छोड़ा पीछे","link":"https://sports.ndtv.com/hindi/cricket/shubman-gill-made-a-big-record-by-scoring-the-first-t20-century-of-his-career-left-virat-kohli-behind-3744578#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में खेले जा रहे तीसरे टी20 मैच में शुभमन गिल ने शानदार शतक जड़ा है. ये उनके टी20 करियर का पहला शतक है","content":"शुभमन गिल ने लगाया शानदार शतक भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में खेले जा रहे तीसरे टी20 मैच में शुभमन गिल ने शानदार शतक जड़ा है. ये उनके टी20 करियर का पहला शतक है वहीं इस शतकीय पारी के साथ ही वे भारत की तरफ से तीनों फॉर्मेट में शतक लगाने वाले पांचवें बल्लेबाज़ बन गए हैं. इसके अलावा टी20 क्रिकेट में भारत की तरफ वे व्यक्तिगत तौर पर हाईएस्ट स्कोरर भी बन गए हैं. उन्होंने इस मैच में 63 गेंद में 126 रन बनाए हैं. Stat Alert 🚨- Shubman Gill now has the highest individual score by an Indian in T20Is 💪👏 What a knock by Shubman Gill, 126* runs from just 63 balls, the future has started for India. Take a bow, Prince. भारत की तरफ से टी20 क्रिकेट में हाईएस्ट व्यक्तिगत स्कोर का रिकॉर्ड भी उन्होंने अपने नाम कर लिया है. गिल ने इस मैच में 123 रन बनाए हैं और विराट कोहली को पीछे छोड़ दिया है. विराट को हली के नाम इनसे पहले भारत की तरफ से हाईएस्ट टी20 स्कोर दर्ज था. 1.शुभमन गिल - 126 (63 गेंद) 2.विराट कोहली - 122(61 गेंद) 3.रोहित शर्मा - 118 (43 गेंद) भारत ने इस मैच में टॉस जीतकर पहले बल्लेबाज़ी करते हुए 4 विकेट के नुकसान पर 234 रन बनाए हैं. पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:07:40","image_url":"https://c.ndtvimg.com/2023-02/f3lhdpjo_shubman-gill_625x300_01_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"भारत ने टी20 क्रिकेट में दर्ज की अब तक की सबसे बड़ी जीत, न्यूज़ीलैंड को 168 रन से दी मात","link":"https://sports.ndtv.com/hindi/cricket/india-registered-its-biggest-ever-win-in-t20-cricket-beating-new-zealand-by-168-runs-3744947#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत ने तीसरे टी20 मैच में न्यूज़ीलैंड को 168 रनों से हराकर रनों के लिहाज़ से टी20 क्रिकेट में अब तक की अपनी सबसे बड़ी जीत दर्ज की है.","content":"भारत ने तीसरे टी20 मैच में न्यूज़ीलैंड को 168 रनों से हराकर टी20 क्रिकेट में रनों के लिहाज़ से अब तक की अपनी सबसे बड़ी जीत दर्ज की है. कीवी टीम भारत के दिए 235 रनों के लक्ष्य का पीछा करते हुए मात्र 66 रन के स्कोर पर ऑलआउट हो गई. इससे पहले भारत के कप्तान हार्दिक पांड्या ने टॉस जीतकर पहले बल्लेबाज़ी करने का फैसला किया और भारत ने 235 रनों का पहाड़ जैसा स्कोर न्यूज़ीलैंड के सामने खड़ा कर दिया. जवाब में मेज़बान टीम इस लक्ष्य का पीछा करते हुए बौनी नज़र आई. बता दें कि भारत की तरफ से सबसे ज्यादा 4 विकेट कप्तान हार्दिक पांड्या ने चटकाए. 𝐀 𝐰𝐢𝐧 𝐭𝐨 𝐫𝐞𝐦𝐞𝐦𝐛𝐞𝐫 😃 Congratulations to who register their biggest T20I victory by margin of runs 👏👏 | शुभमन गिल ने इस मैच में शानदार शतक जड़ा. खास बात ये रही है कि ये उनके टी20 करियर का पहला शतक भी रहा वहीं इस शतकीय पारी के साथ ही वे भारत की तरफ से तीनों फॉर्मेट में शतक लगाने वाले पांचवें बल्लेबाज़ बने. इसके अलावा टी20 क्रिकेट में भारत की तरफ वे व्यक्तिगत तौर पर हाईएस्ट स्कोरर भी बन गए हैं. उन्होंने इस मैच में 63 गेंद में 126 रन बनाए हैं. 1.शुभमन गिल - 126 (63 गेंद) 2.विराट कोहली - 122(61 गेंद) 3.रोहित शर्मा - 118 (43 गेंद) स्कोर - भारत - 234/4 (20 ओवर) न्यूज़ीलैंड - 66/10 ( 12.1 ओवर) शुभमन गिल हार्दिक पांड्या पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:06:33","image_url":"https://c.ndtvimg.com/2023-02/lvadkp3o_team-india-_625x300_01_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jofra Archer bags six wickets as sensational England comeback continues to end sequence of one-day international defeats","link":"https://www.thesun.co.uk/sport/21244642/archer-england-buttler-cricket/","keywords":["Cricket","Sport","England cricket team"],"creator":["John Etheridge"],"video_url":null,"description":null,"content":"JOFRA ARCHER seized SIX wickets in his second comeback match as England ended their sequence of one-day international defeats. Archer’s mega-haul came after Jos Buttler and Dawid Malan inspired a remarkable recovery with a record-breaking partnership of 232 from 211 balls. APJofra Archer was all smiles after his six wicket haul[/caption] GettyDawid Malan and Jos Buttler produced a record-breaking partnership of 232[/caption] GettyButtler’s side picked up their first win in six matches[/caption] England were 14-3 but Buttler and Malan each scored centuries and made sure they soared to a huge total of 346-7. England won by 59 runs but South Africa triumphed 2-1 in the series. Archer regularly reached 90mph and showed that his two elbow operations and stress fracture of the back are becoming distant memories. Archer has been out of international cricket since March 2021 and his performance will provide a surge of optimism at the start of a year that includes the Ashes and a 50-over World Cup. He took 1-81 in the first match of the series and didn’t play in the second game. But his pace, rhythm and confidence were top-notch in Kimberley yesterday. Archer removed Rassie van der Dussen in his first spell and then Aiden Markram and David Miller when Buttler wanted his quickest bowler to snare a wicket or two and subdue South Africa’s dangerous-looking chase of 347. Archer returned for a third spell that contained three wickets – including the powerful Heinrich Klaasen, who was caught at deep square leg for 80 – and finished off the Proteas’ innings. He finished with the stunning figures of 6-40 in a high-scoring match and could not stop grinning and he walked off holding a match ball. CASINO SPECIAL – BEST NEW CUSTOMER SIGN UP DEALS Player of the Match Buttler said: “Jofra’s performance was fantastic and he was probably deserving of the Player of the Match award, rather than me. “To come back and take those two wickets in the middle overs when the game was in the balance really broke things open for us.” Buttler’s team might have lost the series but at least their victory halted a run of five 50-over losses. A sixth defeat would have meant their worst sequence for 14 years. But little looked less likely half an hour into the match. Jason Roy, Ben Duckett and Harry Brook all perished cheaply and opener Malan and captain Buttler were forced to rebuild slowly. Buttler was scoreless from his first 14 deliveries. England made just 20 runs in their first ten overs and were 73-3 after 20 overs. They had managed only 129-3 by the end of the 30th over. But Malan and Buttler pressed the accelerator so hard that 217 runs were plundered from the final 20 overs. Their stand was England’s highest for the fourth wicket in one-day cricket, beating the 226 put on by Andrew Strauss and Andrew Flintoff against West Indies in 2004. Moeen Ali contributed 41 from 23 balls and England struck 19 sixes in total. Malan admitted: “I couldn’t get the ball off the square for my first 40 and 50 balls! I felt so far behind the game that I chanced my arm and got a bit of momentum. “And when Jos starts going, it’s impossible to stop him. So we dovetailed very well.” South Africa were a long way ahead of England’s comparative score throughout their innings but lost too many wickets – due mainly to Archer. Wrist-spinner Adil Rashid took three wickets and the Proteas were bowled out with almost seven of their overs unused.","pubDate":"2023-02-01 20:33:44","image_url":null,"source_id":"thesun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Akram advises PCB to refrain from removing Babar as captain in any format","link":"https://kashmirreader.com/2023/02/02/akram-advises-pcb-to-refrain-from-removing-babar-as-captain-in-any-format/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Says never considered coaching Pakistan team because of hate and abuse Karachi: Former Pakistan captain Wasim Akram has advised Pakistan Cricket Board (PCB) to refrain from removing Babar Azam as captain in any format of the game. “I think it will be a mistake. Because even if you change him as captain in any format […]","content":"Says never considered coaching Pakistan team because of hate and abuse Karachi: Former Pakistan captain Wasim Akram has advised Pakistan Cricket Board (PCB) to refrain from removing Babar Azam as captain in any format of the game. “I think it will be a mistake. Because even if you change him as captain in any format it is not going to make any difference. What are the options. (It’s) best if he is supported by all of us, including the board. He is young and he will get better as captain. My thinking is that no one is born a natural captain and leader, these things come with time and experience.” Akram added he had always supported Babar as captain because he had a lot of cricket ahead of him and also because he was an automatic selection in the team. “As a nation, I think for once we need to be positive and back Babar. Let’s do it and see what happens. I am confident he will become a good captain.” Akram said he was embarrassed at the way pressure had been built around Babar in recent days. “People in other countries laugh at our cricket culture. We need to start being more positive. Win and loss is part of the game.” He pointed out that Babar had led the team to the T20 Asia Cup final and the ICC T20 World Cup in Australia, which is a big achievement for any captain. Akram also said he has never considered coaching the national team because of the criticism, abuse and hate that are directed at coaches and captains in the country. “I can accept criticism if the team is not doing well. But in Pakistan cricket, it is intolerable the way the captain and coaches are not only criticised but also abused by everyone,” Akram said in an interview. “The abuse and at times hate which the captain and coach have to bear, I don’t think I am up to it. I don’t have that tolerance level, especially when it comes to the use of social media. They are some people who I think only sit on twitter day and night to send out negative comments.” Akram added he didn’t want the extra baggage of stress that comes with coaching the national side. “League cricket is different, the pressure and expectation levels are different, which is why I am involved with the Karachi Kings side in the PSL.” The pace-bowling legend said that as coach of the Karachi side, some players routinely approach him and discuss cricket and he is always there to help and guide them. “I am always willing to be of service to Pakistan cricket but not at the cost of having to bear unnecessary criticism and abuse from anyone out there.” Akram also refused to dwell on Ramiz Raja’s performance when he was the PCB chairman. “I don’t want to talk about him. There is a misconception that only a former cricketer should head the board… I don’t buy that because this is a job which requires a lot of administrative skills and the ability to have good communication with other boards etc,” said Akram. — PTI Akram advises PCB to refrain from removing Babar as captain in any format added by Press Trust of India on 12:59 am February 2, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-01 19:29:30","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Suryakumar remains at top of ICC rankings","link":"https://kashmirreader.com/2023/02/02/suryakumar-remains-at-top-of-icc-rankings/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dubai: Swashbuckling Indian batter Suryakumar Yadav continued his stay at the top in the ICC rankings released on Wednesday. Suryakumar reached the rating of 910 points after he stroked a quick-fire innings of 47 during the first match of India’s ongoing series against New Zealand in Ranchi as the exciting right-hander maintained his healthy lead […]","content":"Dubai: Swashbuckling Indian batter Suryakumar Yadav continued his stay at the top in the ICC rankings released on Wednesday. Suryakumar reached the rating of 910 points after he stroked a quick-fire innings of 47 during the first match of India’s ongoing series against New Zealand in Ranchi as the exciting right-hander maintained his healthy lead at the top of the T20I rankings for batters. While Suryakumar played a more composed knock of 26 not out in the second match of the series, the 32-year-old dropped back to a total of 908 rating points as a result. It also means Suryakumar remains within striking distance of England batter Dawid Malan in the race to hold the highest rating of all time for men’s T20I batters. Malan achieved a rating of 915 points in Cape Town back in 2020, but Suryakumar now holds the second highest rating of all time for T20I batters following his recent heroics with the willow. He claimed the top ranking for current batters while scoring a total of 239 runs from six matches at last year’s T20 World Cup and only last month was deservedly named the ICC T20 Cricketer of the Year. No other Indian featured in the top 10 of the batters or bowlers list while Hardik Pandya remained third among all-rounders. India’s Mohammed Siraj contines to be the top-ranked bowler in the ODI rankings. Shubman Gill (sixth), Virat Kohli(seventh) and Rohit Sharma (ninth) remain static in the batters’ list. PTI Suryakumar remains at top of ICC rankings added by Press Trust of India on 12:58 am February 2, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-01 19:28:34","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"England beat South Africa to avoid whitewash one-day international series defeat","link":"https://www.sportsmole.co.uk/cricket/england/news/england-beat-south-africa-to-avoid-whitewash-odi-series-defeat_505619.html","keywords":["Cricket","England","South Africa","Dawid Malan","Jos Buttler","Jofra Archer","Lungi Ngidi","Jason Roy","Ben Duckett","Harry Brook","Moeen Ali","Temba Bavuma","Reeza Hendricks","Aiden Markram","Heinrich Klaasen","505619"],"creator":null,"video_url":null,"description":"England end a five-match winless streak in one-day internationals by beating South Africa by 59 runs in Kimberley.","content":"In the first two encounters, the added desire of South Africa, fuelled by needing three successive triumphs to boost their hopes of earning automatic qualification for the World Cup, proved decisive in overcoming the 20-over and 50-over world champions. However, England's motivation to get back on track and the growing expectation on South Africa arguably combined to make the difference on Wednesday. England somehow managed to prevail in a fixture where they lost the toss and were reduced to 14-3, significantly boosted by a 232-run fourth-wicket partnership between Dawid Malan and Jos Buttler . Jofra Archer then proceeded to mark his return to international cricket with the best ODI figures of his career, recording 6-40 off 9.1 overs. Lungi Ngidi had threatened to steal the show with the ball in the early stages of the game, taking the wickets of Jason Roy (1), Ben Duckett (0) and Harry Brook (6). \"That is POWERFUL from Dawid Malan\" 💥 What a six! 👏 pic.twitter.com/5BUNxMgmkH England were very much in a position where they could have folded, only for Malan and Buttler to rebuild with discipline before putting their feet on the accelerator to put England in a commanding position. Their barrage of runs came off just 35 overs, Malan falling for 118 off 114 balls before Buttler combined with Moeen Ali (41) to take England to 313-5. Buttler, the captain, was eventually dismissed for 131 off 127 deliveries, a knock which included seven sixes, and England made 346-7 off their 50 overs. While South Africa were always in the run chase, they lost wickets at regular intervals, with innings from Temba Bavuma (35), Reeza Hendricks (52) and Aiden Markram (39) doing no more than keep the Proteas competitive. A seventh-wicket partnership of 85 took South Africa to 278, left requiring 69 off 62 balls, but Heinrich Klaasen 's departure for 80 took the momentum out of their innings. Archer returned to the action to conclude the match, South Africa's tail-enders failing to deal with his pace much like those from third and lower in the batting order, and England's future remains bright if they can keep the fast bowler free from injury during 2023.","pubDate":"2023-02-01 18:58:36","image_url":"https://sm.imgix.net/23/04/jos-buttler.JPG","source_id":"sportsmole","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Michael Clarke’s hall of fame limbo underlines his complicated legacy","link":"https://www.watoday.com.au/sport/cricket/michael-clarke-s-hall-of-fame-limbo-underlines-his-complicated-legacy-20230202-p5chbo.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Michael Clarke has a hall of fame record. Exclusion from the company of other greats underlines his complicated legacy.","content":"Michael Clarke has a hall of fame record for Australia. Exclusion from the company of other greats of the game underlines his complicated legacy. Ian Redpath’s induction this week, alongside Margaret Jennings , was in recognition of not only one of the nation’s flintiest Test match openers but also an admired team man and contributor to the game in retirement. Michael Clarke celebrates his triple century at the SCG in 2012. Credit: Getty Images In addition to allowing for one of the more entertaining induction speeches of recent times, the decision to add Redpath to a select group of the cream of Australian cricket had another less intentional effect - highlighting the absence of Clarke. In 2020, Clarke reached five years since his international retirement at the end of the 2015 Ashes series, making him eligible for inclusion. Based purely on his numbers with the bat, and his win/loss record as a captain at home in particular, Clarke would have been a candidate for immediate elevation to the group. Moreover, in a career that took place entirely after the Allan Border Medal was first awarded in 2000, Clarke’s trio of medals and quartet of Shane Warne Test player of the year trophies make him comfortably the most decorated player of his generation. But if there is hesitance to induct Clarke, it comes from a combination of reservations about some elements of his story, and also a wider reckoning with an era of Australian cricket that elevated the value of winning while achieving less than the era before it. Leaving high school in Year 11 to become a professional cricketer, after growing up with parents who owned an indoor cricket centre, Clarke’s focus on becoming the best he could possibly be was never in doubt. But there was a certain narrowness to him and others who followed in the men’s game, increasingly flushed as it became with money and commercial opportunity. As an example, take Clarke’s comments a year ago complaining about the Allan Border Medal itself.","pubDate":"2023-02-02 00:31:15","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Central Stags, Hinds named for Hamilton - Central Districts Cricket","link":"http://www.voxy.co.nz/sport/5/412500","keywords":["Sport"],"creator":null,"video_url":null,"description":"Ross Taylor and Doug Bracewell have returned for the Central Stags’ must-win Dream11 Super Smash clash with Northern Brave tomorrow evening, while young ManawatÅ« talent Sam Mackinder is celebrating selection in the Central Hinds squad for the first time.","content":"Ross Taylor and Doug Bracewell have returned for the Central Stags’ must-win Dream11 Super Smash clash with Northern Brave tomorrow evening, while young ManawatÅ« talent Sam Mackinder is celebrating selection in the Central Hinds squad for the first time. Taylor returns from a groin injury that saw him miss the last two away games, while allrounder Bracewell returns from the BLACKCAPS squad. Making way for the experienced pair in an expanded squad of 13 is wicketkeeper Bayley Wiggins, Ma’ara Ave set to take the gloves for the team in the big last round of the regular season. A New Zealand MÄori Schoolgirls representative in recent seasons, Mackinder comes into the Central Hinds squad alongside fellow ManawatÅ« rep Ashtuti Kumar and Taranaki’s Emily Cunningham, with the experienced trio of Mikaela Greig, Melissa Hansen and Kerry Tomlinson unavailable for the Friday afternoon match with personal commitments. The Stags will head into their game on equal points with Northern Brave men, with Brave holding the third spot on the table and the Stags in fourth spot by dint of net run rate. That means to lock in Finals qualification (only the top three teams progress), the Stags need to win against the defending men’s champion. Tom Bruce (79 not out off 45 balls) and Will Young (53 off 33) are both coming off explosive half centuries in Dunedin where a stunning knock by young Volt Ben Lockrose snatched the match away at the death. Bruce's ballistic 79 not out is one of the highest scores this season nationally, while Young has now scored two half tons from just four knocks. One of two top-class left-arm spinners in the Stags alongside Ajaz Patel, Jayden Lennox is meanwhile the league's top wicket-taker, his career-best 4-28 in Dunedin propelling him to 15 victims from eight games at a 15.33 average. Young Hawke’s Bay allrounder Flora Devonshire impressed for the Hinds in all facets of the game in Dunedin, the left-hander top-scoring with 39 off 27 balls, tidy with the ball and taking a great field catch. The Hinds pushed the Sparks to the last over in a six-wicket win for their hosts that leaves the Hinds looking to get their elusive first win in tomorrow's last round, which will be the team's last T20 of the season. Captain Natalie Dodd remains the leading run-scorer nationally in the women’s Dream11 Super Smash with 324 runs from nine innings, including four fifties - the most by any player in either the men’s or women’s league this summer. Young right-hander Mackinder has impressed for ManawatÅ« in The Mike Shrimpton Trophy and scored a half century in Hamilton against Northern Districts A for Central Districts A earlier this season, in a match-winning century stand with Emma McLeod who is just back from the ICC Under 19 World Cup in South Africa. The Hinds will remain in Hamilton to play Round Six of the national 50-over Hallyburton Johnstone Shield on Saturday, with the one-day squad to be announced tomorrow. The Central Stags will also be back in one-day mode over the Waitangi long weekend with a free admission Ford Trophy match against Northern Districts at Napier's McLean Park from 11am on Waitangi Day, Monday 6 February. The Stags remain top of the Ford Trophy table, and will be back again at McLean Park for the final regular season round on Tuesday, 14 February, against Canterbury, both Ford Trophy matches with a free livestream. Both the Central Stags and Hinds T20s tomorrow are live and on demand at Spark Sport as well as live on free to air TVNZ Duke, with livescoring at www.cdcricket.co.nz. The Hallyburton Johnstone Shield and Ford Trophy are free livestream games at www.cdcricket.co.nz. DREAM11 SUPER SMASH ROUND 10 SEDDON PARK Friday, 3 Febuary 3PM - Central Hinds v Northern Brave women 6.50PM - Central Stags v Northern Brave men Both matches live on Spark Sport and TVNZ Duke CENTRAL HINDS Natalie Dodd - captain, wicketkeeper, Taranaki Jess Watkin - vice-captain, ManawatÅ« Georgia Atkinson - ManawatÅ« Ocean Bartlett - Wairarapa Priyanaz Chatterji - Overseas player Emily Cunningham - Taranaki Flora Devonshire - Hawke’s Bay Kate Gaging - Nelson Claudia Green - Nelson Ashtuti Kumar - ManawatÅ« Sam Mackinder - uncapped, ManawatÅ« Rosemary Mair - Hawke’s Bay COACH - Jamie Watkins CENTRAL STAGS Tom Bruce - captain, Taranaki Ma’ara Ave - wicketkeeper, ManawatÅ« Doug Bracewell - Hawke’s Bay Will Clark - Hawke’s Bay Josh Clarkson - Nelson Jayden Lennox - Hawke’s Bay Ajaz Patel - Hawke’s Bay Brett Randell Bevan Small - ManawatÅ« Ben Smith - Whanganui Ross Taylor - ManawatÅ« /Wairarapa Ray Toole - ManawatÅ« Will Young - Taranaki COACH - Rob Walter Unavailable contracted players Dane Cleaver (BLACKCAPS in India) Blair Tickner (BLACKCAPS in India) Hannah Rowe (WHITE FERNS in South Africa) Joey Field (shoulder injury) Seth Rance (shoulder injury) Liam Dudding (forearm injury) Mikaela Greig (personal commitments) Melissa Hansen (personal commitments) Kerry Tomlinson (personal commitments)","pubDate":"2023-02-01 23:07:05","image_url":null,"source_id":"voxy","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"सचिन तेंदुलकर ने शानदार स्पीच देकर महिला अंडर-19 विश्व कप विजेता भारतीय टीम का किया ज़ोरदार स्वागत","link":"https://sports.ndtv.com/hindi/cricket/sachin-tendulkar-welcomed-the-u-19-world-cup-winning-indian-team-by-giving-a-speech-3744148#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत की अंडर-19 महिला क्रिकेट टीम (U19 Women's World Cup Final) के विश्व कप जीत कर घर लौटने पर महान क्रिकेटर सचिन तेंदुलकर ज़ोरदार स्पीच देकर स्वागत किया है.","content":"सचिन तेंदुलकर ने जूनियर महिला टीम का किया ज़ोरदार स्वागत भारत की अंडर-19 महिला क्रिकेट टीम के विश्व कप जीत कर घर लौटने पर महान क्रिकेटर सचिन तेंदुलकर ज़ोरदार स्पीच देकर स्वागत किया है. भारत और न्यूज़ीलैंड के बीच अहमदाबाद टी20 मैच से पहले शेफाली वर्मा की अगुवाई वाली भारतीय टीम का स्वागत किया गया है. बता दें कि बीसीसीआई ने विश्व चैंपियन जूनियर भारतीय टीम को 5 करोड़ की इनामी राशि से नवाज़ा है. \"The entire nation will celebrate and cherish your victory\" Master Blaster delivers a speech at the Narendra Modi Stadium, Ahmedabad as the BCCI felicitates the victorious U19 Women's Team at the Listen in here👇👇 Sachin Tendulkar addresses the U19 T20 World Cup winning Indian women's team in Ahmedabad, Shafali Verma and Co pose with the cheque for Rs 5 crore that has been mentioned already as the reward for the team and staff. बीसीसीआई सचिव जय शाह ने इसकी जानकारी दी है. उन्होंने ट्वीट करते हुए लिखा कि \" हमें इस बात की बेहद खुशी है कि भारत रत्न श्री सचिन तेंदुलकर और बीसीसीआई के अन्य पदाधिकारी महिला अंडर-19 टीम को 1 फरवरी को नरेंद्र मोदी क्रिकेट स्टेडियम अहमदाबाद में शाम 6:30 बजे सम्मानित करेंगे. भारत की इन युवा प्रतिभाओ ने देश को गौरवान्वित किया है और हम उनकी इस उपलब्धि पर उनका सम्मान करेंगे.\" It is with great delight I share that Bharat Ratna Shri and Office Bearers will felicitate the victorious India U19 team on Feb 1st in Narendra Modi Stadium at 6:30 PM IST. The young cricketers have made India proud and we will honour their achievements. दक्षिण अफ्रीका की मेज़बानी में पहली बार आयोजित हुए महिला अंडर-19 विश्व कप का फाइनल भारत और इंग्लैंड के बीच खेला गया. जिसमें टीम इंडिया ने 7 विकेट से जीत दर्ज करते हुए एक नए अध्याय की शुरुआत कर दी. फाइनल मुकाबले में भारत की कप्तान शैफाली वर्मा ने टॉस जीतकर पहले गेंदबाज़ी करने का फैसला लिया और इंग्लैंड की टीम को मात्र 68 रन के स्कोर पर ऑलआउट कर दिया. वहीं इस लक्ष्य को भारतीय टीम ने 3 विकेट खोकर हासिल कर लिया. भारतीय जूनियर टीम के चैंपियन बनते ही भारतीय क्रिकेट कंट्रोल बोर्ड ने 5 करोड़ की इनामी राशि का एलान कर दिया. बता दें कि टीम की इस जीत में महत्वपूर्ण रोल अदा करने वाले कोचिंग और स्पोर्ट स्टाफ में इस राशि को बांटा जाएगा. * * पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:09:31","image_url":"https://c.ndtvimg.com/2023-02/2dbu6b7g_sachin-tendulkar_625x300_01_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"तीसरे टी20 में भी पृथ्वी शॉ को नहीं मिली जगह, ट्विटर पर फैंस ने निकाली भड़ास","link":"https://sports.ndtv.com/hindi/cricket/prithvi-shaw-did-not-get-a-place-in-the-third-t20-as-well-fans-expressed-their-anger-on-twitter-3744472#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में तीसरा टी20 मैच खेला जा रहा है. जिसमें भारतीय टीम की प्लेइंग इलेवन को लेकर लोग ट्विटर पर सवाल उठा रहे हैं.","content":"पृथ्वी शॉ को नहीं मिली भारतीय इलेवन में जगह भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में तीसरा टी20 मैच खेला जा रहा है. जिसमें भारतीय टीम की प्लेइंग इलेवन को लेकर लोग ट्विटर पर सवाल उठा रहे हैं. दरअसल घरेलू क्रिकेट में लगातार शानदार प्रदर्शन कर रहे पृथ्वी शॉ को टीम में तो शामिल कर लिया गया, लेकिन तीनों ही टी20 मैचों की प्लेइंग इलेवन में उन्हें जगह नहीं मिल पाई. जिसे लेकर फैंस काफी निराश नज़र आ रहे हैं. पृथ्वी शॉ के चाहने वाले अब ट्विटर पर लगातार भड़ास निकाल रहे हैं. Ruturaj and prithvi shaw to shubman and ishan 🙂 Prithvi Shaw will be benched again in the 3rd T20 match against New Zealand! If Prithvi Shaw doesn't play for India, its India's loss. Not his loss 🤙 Prithvi Shaw in dressing room. Heartbreaking wait continues for Prithvi Shaw 💔💔 What are you doing BCCI Management & Hardik Pandya Just destroy talented cricketers.. Need to take care of them. Abomination Nonsense 😡 Hardik should apologise to Prithvi Shaw for including him in the squad but not even giving 1 match to play. If Rahul Tripathi can be given 3 matches, why not Prithvi? This really shows how scared Hardik is to not let him show his skills. Ishan Kishan's record of last 10 t20 matches is not good but he gets a place in the team so why not give Prithvi Shaw a chance today?? * * पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:08:35","image_url":"https://c.ndtvimg.com/2023-01/jjs37348_prithvi-shaw-806_625x300_27_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शुभमन गिल ने करियर का पहला टी20 शतक जड़कर बनाया बड़ा रिकॉर्ड, विराट कोहली को छोड़ा पीछे","link":"https://sports.ndtv.com/hindi/cricket/shubman-gill-made-a-big-record-by-scoring-the-first-t20-century-of-his-career-left-virat-kohli-behind-3744578#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में खेले जा रहे तीसरे टी20 मैच में शुभमन गिल ने शानदार शतक जड़ा है. ये उनके टी20 करियर का पहला शतक है","content":"शुभमन गिल ने लगाया शानदार शतक भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में खेले जा रहे तीसरे टी20 मैच में शुभमन गिल ने शानदार शतक जड़ा है. ये उनके टी20 करियर का पहला शतक है वहीं इस शतकीय पारी के साथ ही वे भारत की तरफ से तीनों फॉर्मेट में शतक लगाने वाले पांचवें बल्लेबाज़ बन गए हैं. इसके अलावा टी20 क्रिकेट में भारत की तरफ वे व्यक्तिगत तौर पर हाईएस्ट स्कोरर भी बन गए हैं. उन्होंने इस मैच में 63 गेंद में 126 रन बनाए हैं. Stat Alert 🚨- Shubman Gill now has the highest individual score by an Indian in T20Is 💪👏 What a knock by Shubman Gill, 126* runs from just 63 balls, the future has started for India. Take a bow, Prince. भारत की तरफ से टी20 क्रिकेट में हाईएस्ट व्यक्तिगत स्कोर का रिकॉर्ड भी उन्होंने अपने नाम कर लिया है. गिल ने इस मैच में 123 रन बनाए हैं और विराट कोहली को पीछे छोड़ दिया है. विराट को हली के नाम इनसे पहले भारत की तरफ से हाईएस्ट टी20 स्कोर दर्ज था. 1.शुभमन गिल - 126 (63 गेंद) 2.विराट कोहली - 122(61 गेंद) 3.रोहित शर्मा - 118 (43 गेंद) भारत ने इस मैच में टॉस जीतकर पहले बल्लेबाज़ी करते हुए 4 विकेट के नुकसान पर 234 रन बनाए हैं. पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:07:40","image_url":"https://c.ndtvimg.com/2023-02/f3lhdpjo_shubman-gill_625x300_01_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"भारत ने टी20 क्रिकेट में दर्ज की अब तक की सबसे बड़ी जीत, न्यूज़ीलैंड को 168 रन से दी मात","link":"https://sports.ndtv.com/hindi/cricket/india-registered-its-biggest-ever-win-in-t20-cricket-beating-new-zealand-by-168-runs-3744947#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत ने तीसरे टी20 मैच में न्यूज़ीलैंड को 168 रनों से हराकर रनों के लिहाज़ से टी20 क्रिकेट में अब तक की अपनी सबसे बड़ी जीत दर्ज की है.","content":"भारत ने तीसरे टी20 मैच में न्यूज़ीलैंड को 168 रनों से हराकर टी20 क्रिकेट में रनों के लिहाज़ से अब तक की अपनी सबसे बड़ी जीत दर्ज की है. कीवी टीम भारत के दिए 235 रनों के लक्ष्य का पीछा करते हुए मात्र 66 रन के स्कोर पर ऑलआउट हो गई. इससे पहले भारत के कप्तान हार्दिक पांड्या ने टॉस जीतकर पहले बल्लेबाज़ी करने का फैसला किया और भारत ने 235 रनों का पहाड़ जैसा स्कोर न्यूज़ीलैंड के सामने खड़ा कर दिया. जवाब में मेज़बान टीम इस लक्ष्य का पीछा करते हुए बौनी नज़र आई. बता दें कि भारत की तरफ से सबसे ज्यादा 4 विकेट कप्तान हार्दिक पांड्या ने चटकाए. 𝐀 𝐰𝐢𝐧 𝐭𝐨 𝐫𝐞𝐦𝐞𝐦𝐛𝐞𝐫 😃 Congratulations to who register their biggest T20I victory by margin of runs 👏👏 | शुभमन गिल ने इस मैच में शानदार शतक जड़ा. खास बात ये रही है कि ये उनके टी20 करियर का पहला शतक भी रहा वहीं इस शतकीय पारी के साथ ही वे भारत की तरफ से तीनों फॉर्मेट में शतक लगाने वाले पांचवें बल्लेबाज़ बने. इसके अलावा टी20 क्रिकेट में भारत की तरफ वे व्यक्तिगत तौर पर हाईएस्ट स्कोरर भी बन गए हैं. उन्होंने इस मैच में 63 गेंद में 126 रन बनाए हैं. 1.शुभमन गिल - 126 (63 गेंद) 2.विराट कोहली - 122(61 गेंद) 3.रोहित शर्मा - 118 (43 गेंद) स्कोर - भारत - 234/4 (20 ओवर) न्यूज़ीलैंड - 66/10 ( 12.1 ओवर) शुभमन गिल हार्दिक पांड्या पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:06:33","image_url":"https://c.ndtvimg.com/2023-02/lvadkp3o_team-india-_625x300_01_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jofra Archer bags six wickets as sensational England comeback continues to end sequence of one-day international defeats","link":"https://www.thesun.co.uk/sport/21244642/archer-england-buttler-cricket/","keywords":["Cricket","Sport","England cricket team"],"creator":["John Etheridge"],"video_url":null,"description":null,"content":"JOFRA ARCHER seized SIX wickets in his second comeback match as England ended their sequence of one-day international defeats. Archer’s mega-haul came after Jos Buttler and Dawid Malan inspired a remarkable recovery with a record-breaking partnership of 232 from 211 balls. APJofra Archer was all smiles after his six wicket haul[/caption] GettyDawid Malan and Jos Buttler produced a record-breaking partnership of 232[/caption] GettyButtler’s side picked up their first win in six matches[/caption] England were 14-3 but Buttler and Malan each scored centuries and made sure they soared to a huge total of 346-7. England won by 59 runs but South Africa triumphed 2-1 in the series. Archer regularly reached 90mph and showed that his two elbow operations and stress fracture of the back are becoming distant memories. Archer has been out of international cricket since March 2021 and his performance will provide a surge of optimism at the start of a year that includes the Ashes and a 50-over World Cup. He took 1-81 in the first match of the series and didn’t play in the second game. But his pace, rhythm and confidence were top-notch in Kimberley yesterday. Archer removed Rassie van der Dussen in his first spell and then Aiden Markram and David Miller when Buttler wanted his quickest bowler to snare a wicket or two and subdue South Africa’s dangerous-looking chase of 347. Archer returned for a third spell that contained three wickets – including the powerful Heinrich Klaasen, who was caught at deep square leg for 80 – and finished off the Proteas’ innings. He finished with the stunning figures of 6-40 in a high-scoring match and could not stop grinning and he walked off holding a match ball. CASINO SPECIAL – BEST NEW CUSTOMER SIGN UP DEALS Player of the Match Buttler said: “Jofra’s performance was fantastic and he was probably deserving of the Player of the Match award, rather than me. “To come back and take those two wickets in the middle overs when the game was in the balance really broke things open for us.” Buttler’s team might have lost the series but at least their victory halted a run of five 50-over losses. A sixth defeat would have meant their worst sequence for 14 years. But little looked less likely half an hour into the match. Jason Roy, Ben Duckett and Harry Brook all perished cheaply and opener Malan and captain Buttler were forced to rebuild slowly. Buttler was scoreless from his first 14 deliveries. England made just 20 runs in their first ten overs and were 73-3 after 20 overs. They had managed only 129-3 by the end of the 30th over. But Malan and Buttler pressed the accelerator so hard that 217 runs were plundered from the final 20 overs. Their stand was England’s highest for the fourth wicket in one-day cricket, beating the 226 put on by Andrew Strauss and Andrew Flintoff against West Indies in 2004. Moeen Ali contributed 41 from 23 balls and England struck 19 sixes in total. Malan admitted: “I couldn’t get the ball off the square for my first 40 and 50 balls! I felt so far behind the game that I chanced my arm and got a bit of momentum. “And when Jos starts going, it’s impossible to stop him. So we dovetailed very well.” South Africa were a long way ahead of England’s comparative score throughout their innings but lost too many wickets – due mainly to Archer. Wrist-spinner Adil Rashid took three wickets and the Proteas were bowled out with almost seven of their overs unused.","pubDate":"2023-02-01 20:33:44","image_url":null,"source_id":"thesun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Akram advises PCB to refrain from removing Babar as captain in any format","link":"https://kashmirreader.com/2023/02/02/akram-advises-pcb-to-refrain-from-removing-babar-as-captain-in-any-format/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Says never considered coaching Pakistan team because of hate and abuse Karachi: Former Pakistan captain Wasim Akram has advised Pakistan Cricket Board (PCB) to refrain from removing Babar Azam as captain in any format of the game. “I think it will be a mistake. Because even if you change him as captain in any format […]","content":"Says never considered coaching Pakistan team because of hate and abuse Karachi: Former Pakistan captain Wasim Akram has advised Pakistan Cricket Board (PCB) to refrain from removing Babar Azam as captain in any format of the game. “I think it will be a mistake. Because even if you change him as captain in any format it is not going to make any difference. What are the options. (It’s) best if he is supported by all of us, including the board. He is young and he will get better as captain. My thinking is that no one is born a natural captain and leader, these things come with time and experience.” Akram added he had always supported Babar as captain because he had a lot of cricket ahead of him and also because he was an automatic selection in the team. “As a nation, I think for once we need to be positive and back Babar. Let’s do it and see what happens. I am confident he will become a good captain.” Akram said he was embarrassed at the way pressure had been built around Babar in recent days. “People in other countries laugh at our cricket culture. We need to start being more positive. Win and loss is part of the game.” He pointed out that Babar had led the team to the T20 Asia Cup final and the ICC T20 World Cup in Australia, which is a big achievement for any captain. Akram also said he has never considered coaching the national team because of the criticism, abuse and hate that are directed at coaches and captains in the country. “I can accept criticism if the team is not doing well. But in Pakistan cricket, it is intolerable the way the captain and coaches are not only criticised but also abused by everyone,” Akram said in an interview. “The abuse and at times hate which the captain and coach have to bear, I don’t think I am up to it. I don’t have that tolerance level, especially when it comes to the use of social media. They are some people who I think only sit on twitter day and night to send out negative comments.” Akram added he didn’t want the extra baggage of stress that comes with coaching the national side. “League cricket is different, the pressure and expectation levels are different, which is why I am involved with the Karachi Kings side in the PSL.” The pace-bowling legend said that as coach of the Karachi side, some players routinely approach him and discuss cricket and he is always there to help and guide them. “I am always willing to be of service to Pakistan cricket but not at the cost of having to bear unnecessary criticism and abuse from anyone out there.” Akram also refused to dwell on Ramiz Raja’s performance when he was the PCB chairman. “I don’t want to talk about him. There is a misconception that only a former cricketer should head the board… I don’t buy that because this is a job which requires a lot of administrative skills and the ability to have good communication with other boards etc,” said Akram. — PTI Akram advises PCB to refrain from removing Babar as captain in any format added by Press Trust of India on 12:59 am February 2, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-01 19:29:30","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Suryakumar remains at top of ICC rankings","link":"https://kashmirreader.com/2023/02/02/suryakumar-remains-at-top-of-icc-rankings/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dubai: Swashbuckling Indian batter Suryakumar Yadav continued his stay at the top in the ICC rankings released on Wednesday. Suryakumar reached the rating of 910 points after he stroked a quick-fire innings of 47 during the first match of India’s ongoing series against New Zealand in Ranchi as the exciting right-hander maintained his healthy lead […]","content":"Dubai: Swashbuckling Indian batter Suryakumar Yadav continued his stay at the top in the ICC rankings released on Wednesday. Suryakumar reached the rating of 910 points after he stroked a quick-fire innings of 47 during the first match of India’s ongoing series against New Zealand in Ranchi as the exciting right-hander maintained his healthy lead at the top of the T20I rankings for batters. While Suryakumar played a more composed knock of 26 not out in the second match of the series, the 32-year-old dropped back to a total of 908 rating points as a result. It also means Suryakumar remains within striking distance of England batter Dawid Malan in the race to hold the highest rating of all time for men’s T20I batters. Malan achieved a rating of 915 points in Cape Town back in 2020, but Suryakumar now holds the second highest rating of all time for T20I batters following his recent heroics with the willow. He claimed the top ranking for current batters while scoring a total of 239 runs from six matches at last year’s T20 World Cup and only last month was deservedly named the ICC T20 Cricketer of the Year. No other Indian featured in the top 10 of the batters or bowlers list while Hardik Pandya remained third among all-rounders. India’s Mohammed Siraj contines to be the top-ranked bowler in the ODI rankings. Shubman Gill (sixth), Virat Kohli(seventh) and Rohit Sharma (ninth) remain static in the batters’ list. PTI Suryakumar remains at top of ICC rankings added by Press Trust of India on 12:58 am February 2, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-01 19:28:34","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"England beat South Africa to avoid whitewash one-day international series defeat","link":"https://www.sportsmole.co.uk/cricket/england/news/england-beat-south-africa-to-avoid-whitewash-odi-series-defeat_505619.html","keywords":["Cricket","England","South Africa","Dawid Malan","Jos Buttler","Jofra Archer","Lungi Ngidi","Jason Roy","Ben Duckett","Harry Brook","Moeen Ali","Temba Bavuma","Reeza Hendricks","Aiden Markram","Heinrich Klaasen","505619"],"creator":null,"video_url":null,"description":"England end a five-match winless streak in one-day internationals by beating South Africa by 59 runs in Kimberley.","content":"In the first two encounters, the added desire of South Africa, fuelled by needing three successive triumphs to boost their hopes of earning automatic qualification for the World Cup, proved decisive in overcoming the 20-over and 50-over world champions. However, England's motivation to get back on track and the growing expectation on South Africa arguably combined to make the difference on Wednesday. England somehow managed to prevail in a fixture where they lost the toss and were reduced to 14-3, significantly boosted by a 232-run fourth-wicket partnership between Dawid Malan and Jos Buttler . Jofra Archer then proceeded to mark his return to international cricket with the best ODI figures of his career, recording 6-40 off 9.1 overs. Lungi Ngidi had threatened to steal the show with the ball in the early stages of the game, taking the wickets of Jason Roy (1), Ben Duckett (0) and Harry Brook (6). \"That is POWERFUL from Dawid Malan\" 💥 What a six! 👏 pic.twitter.com/5BUNxMgmkH England were very much in a position where they could have folded, only for Malan and Buttler to rebuild with discipline before putting their feet on the accelerator to put England in a commanding position. Their barrage of runs came off just 35 overs, Malan falling for 118 off 114 balls before Buttler combined with Moeen Ali (41) to take England to 313-5. Buttler, the captain, was eventually dismissed for 131 off 127 deliveries, a knock which included seven sixes, and England made 346-7 off their 50 overs. While South Africa were always in the run chase, they lost wickets at regular intervals, with innings from Temba Bavuma (35), Reeza Hendricks (52) and Aiden Markram (39) doing no more than keep the Proteas competitive. A seventh-wicket partnership of 85 took South Africa to 278, left requiring 69 off 62 balls, but Heinrich Klaasen 's departure for 80 took the momentum out of their innings. Archer returned to the action to conclude the match, South Africa's tail-enders failing to deal with his pace much like those from third and lower in the batting order, and England's future remains bright if they can keep the fast bowler free from injury during 2023.","pubDate":"2023-02-01 18:58:36","image_url":"https://sm.imgix.net/23/04/jos-buttler.JPG","source_id":"sportsmole","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Michael Clarke’s hall of fame limbo underlines his complicated legacy","link":"https://www.watoday.com.au/sport/cricket/michael-clarke-s-hall-of-fame-limbo-underlines-his-complicated-legacy-20230202-p5chbo.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Michael Clarke has a hall of fame record. Exclusion from the company of other greats underlines his complicated legacy.","content":"Michael Clarke has a hall of fame record for Australia. Exclusion from the company of other greats of the game underlines his complicated legacy. Ian Redpath’s induction this week, alongside Margaret Jennings , was in recognition of not only one of the nation’s flintiest Test match openers but also an admired team man and contributor to the game in retirement. Michael Clarke celebrates his triple century at the SCG in 2012. Credit: Getty Images In addition to allowing for one of the more entertaining induction speeches of recent times, the decision to add Redpath to a select group of the cream of Australian cricket had another less intentional effect - highlighting the absence of Clarke. In 2020, Clarke reached five years since his international retirement at the end of the 2015 Ashes series, making him eligible for inclusion. Based purely on his numbers with the bat, and his win/loss record as a captain at home in particular, Clarke would have been a candidate for immediate elevation to the group. Moreover, in a career that took place entirely after the Allan Border Medal was first awarded in 2000, Clarke’s trio of medals and quartet of Shane Warne Test player of the year trophies make him comfortably the most decorated player of his generation. But if there is hesitance to induct Clarke, it comes from a combination of reservations about some elements of his story, and also a wider reckoning with an era of Australian cricket that elevated the value of winning while achieving less than the era before it. Leaving high school in Year 11 to become a professional cricketer, after growing up with parents who owned an indoor cricket centre, Clarke’s focus on becoming the best he could possibly be was never in doubt. But there was a certain narrowness to him and others who followed in the men’s game, increasingly flushed as it became with money and commercial opportunity. As an example, take Clarke’s comments a year ago complaining about the Allan Border Medal itself.","pubDate":"2023-02-02 00:31:15","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Central Stags, Hinds named for Hamilton - Central Districts Cricket","link":"http://www.voxy.co.nz/sport/5/412500","keywords":["Sport"],"creator":null,"video_url":null,"description":"Ross Taylor and Doug Bracewell have returned for the Central Stags’ must-win Dream11 Super Smash clash with Northern Brave tomorrow evening, while young ManawatÅ« talent Sam Mackinder is celebrating selection in the Central Hinds squad for the first time.","content":"Ross Taylor and Doug Bracewell have returned for the Central Stags’ must-win Dream11 Super Smash clash with Northern Brave tomorrow evening, while young ManawatÅ« talent Sam Mackinder is celebrating selection in the Central Hinds squad for the first time. Taylor returns from a groin injury that saw him miss the last two away games, while allrounder Bracewell returns from the BLACKCAPS squad. Making way for the experienced pair in an expanded squad of 13 is wicketkeeper Bayley Wiggins, Ma’ara Ave set to take the gloves for the team in the big last round of the regular season. A New Zealand MÄori Schoolgirls representative in recent seasons, Mackinder comes into the Central Hinds squad alongside fellow ManawatÅ« rep Ashtuti Kumar and Taranaki’s Emily Cunningham, with the experienced trio of Mikaela Greig, Melissa Hansen and Kerry Tomlinson unavailable for the Friday afternoon match with personal commitments. The Stags will head into their game on equal points with Northern Brave men, with Brave holding the third spot on the table and the Stags in fourth spot by dint of net run rate. That means to lock in Finals qualification (only the top three teams progress), the Stags need to win against the defending men’s champion. Tom Bruce (79 not out off 45 balls) and Will Young (53 off 33) are both coming off explosive half centuries in Dunedin where a stunning knock by young Volt Ben Lockrose snatched the match away at the death. Bruce's ballistic 79 not out is one of the highest scores this season nationally, while Young has now scored two half tons from just four knocks. One of two top-class left-arm spinners in the Stags alongside Ajaz Patel, Jayden Lennox is meanwhile the league's top wicket-taker, his career-best 4-28 in Dunedin propelling him to 15 victims from eight games at a 15.33 average. Young Hawke’s Bay allrounder Flora Devonshire impressed for the Hinds in all facets of the game in Dunedin, the left-hander top-scoring with 39 off 27 balls, tidy with the ball and taking a great field catch. The Hinds pushed the Sparks to the last over in a six-wicket win for their hosts that leaves the Hinds looking to get their elusive first win in tomorrow's last round, which will be the team's last T20 of the season. Captain Natalie Dodd remains the leading run-scorer nationally in the women’s Dream11 Super Smash with 324 runs from nine innings, including four fifties - the most by any player in either the men’s or women’s league this summer. Young right-hander Mackinder has impressed for ManawatÅ« in The Mike Shrimpton Trophy and scored a half century in Hamilton against Northern Districts A for Central Districts A earlier this season, in a match-winning century stand with Emma McLeod who is just back from the ICC Under 19 World Cup in South Africa. The Hinds will remain in Hamilton to play Round Six of the national 50-over Hallyburton Johnstone Shield on Saturday, with the one-day squad to be announced tomorrow. The Central Stags will also be back in one-day mode over the Waitangi long weekend with a free admission Ford Trophy match against Northern Districts at Napier's McLean Park from 11am on Waitangi Day, Monday 6 February. The Stags remain top of the Ford Trophy table, and will be back again at McLean Park for the final regular season round on Tuesday, 14 February, against Canterbury, both Ford Trophy matches with a free livestream. Both the Central Stags and Hinds T20s tomorrow are live and on demand at Spark Sport as well as live on free to air TVNZ Duke, with livescoring at www.cdcricket.co.nz. The Hallyburton Johnstone Shield and Ford Trophy are free livestream games at www.cdcricket.co.nz. DREAM11 SUPER SMASH ROUND 10 SEDDON PARK Friday, 3 Febuary 3PM - Central Hinds v Northern Brave women 6.50PM - Central Stags v Northern Brave men Both matches live on Spark Sport and TVNZ Duke CENTRAL HINDS Natalie Dodd - captain, wicketkeeper, Taranaki Jess Watkin - vice-captain, ManawatÅ« Georgia Atkinson - ManawatÅ« Ocean Bartlett - Wairarapa Priyanaz Chatterji - Overseas player Emily Cunningham - Taranaki Flora Devonshire - Hawke’s Bay Kate Gaging - Nelson Claudia Green - Nelson Ashtuti Kumar - ManawatÅ« Sam Mackinder - uncapped, ManawatÅ« Rosemary Mair - Hawke’s Bay COACH - Jamie Watkins CENTRAL STAGS Tom Bruce - captain, Taranaki Ma’ara Ave - wicketkeeper, ManawatÅ« Doug Bracewell - Hawke’s Bay Will Clark - Hawke’s Bay Josh Clarkson - Nelson Jayden Lennox - Hawke’s Bay Ajaz Patel - Hawke’s Bay Brett Randell Bevan Small - ManawatÅ« Ben Smith - Whanganui Ross Taylor - ManawatÅ« /Wairarapa Ray Toole - ManawatÅ« Will Young - Taranaki COACH - Rob Walter Unavailable contracted players Dane Cleaver (BLACKCAPS in India) Blair Tickner (BLACKCAPS in India) Hannah Rowe (WHITE FERNS in South Africa) Joey Field (shoulder injury) Seth Rance (shoulder injury) Liam Dudding (forearm injury) Mikaela Greig (personal commitments) Melissa Hansen (personal commitments) Kerry Tomlinson (personal commitments)","pubDate":"2023-02-01 23:07:05","image_url":null,"source_id":"voxy","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"सचिन तेंदुलकर ने शानदार स्पीच देकर महिला अंडर-19 विश्व कप विजेता भारतीय टीम का किया ज़ोरदार स्वागत","link":"https://sports.ndtv.com/hindi/cricket/sachin-tendulkar-welcomed-the-u-19-world-cup-winning-indian-team-by-giving-a-speech-3744148#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत की अंडर-19 महिला क्रिकेट टीम (U19 Women's World Cup Final) के विश्व कप जीत कर घर लौटने पर महान क्रिकेटर सचिन तेंदुलकर ज़ोरदार स्पीच देकर स्वागत किया है.","content":"सचिन तेंदुलकर ने जूनियर महिला टीम का किया ज़ोरदार स्वागत भारत की अंडर-19 महिला क्रिकेट टीम के विश्व कप जीत कर घर लौटने पर महान क्रिकेटर सचिन तेंदुलकर ज़ोरदार स्पीच देकर स्वागत किया है. भारत और न्यूज़ीलैंड के बीच अहमदाबाद टी20 मैच से पहले शेफाली वर्मा की अगुवाई वाली भारतीय टीम का स्वागत किया गया है. बता दें कि बीसीसीआई ने विश्व चैंपियन जूनियर भारतीय टीम को 5 करोड़ की इनामी राशि से नवाज़ा है. \"The entire nation will celebrate and cherish your victory\" Master Blaster delivers a speech at the Narendra Modi Stadium, Ahmedabad as the BCCI felicitates the victorious U19 Women's Team at the Listen in here👇👇 Sachin Tendulkar addresses the U19 T20 World Cup winning Indian women's team in Ahmedabad, Shafali Verma and Co pose with the cheque for Rs 5 crore that has been mentioned already as the reward for the team and staff. बीसीसीआई सचिव जय शाह ने इसकी जानकारी दी है. उन्होंने ट्वीट करते हुए लिखा कि \" हमें इस बात की बेहद खुशी है कि भारत रत्न श्री सचिन तेंदुलकर और बीसीसीआई के अन्य पदाधिकारी महिला अंडर-19 टीम को 1 फरवरी को नरेंद्र मोदी क्रिकेट स्टेडियम अहमदाबाद में शाम 6:30 बजे सम्मानित करेंगे. भारत की इन युवा प्रतिभाओ ने देश को गौरवान्वित किया है और हम उनकी इस उपलब्धि पर उनका सम्मान करेंगे.\" It is with great delight I share that Bharat Ratna Shri and Office Bearers will felicitate the victorious India U19 team on Feb 1st in Narendra Modi Stadium at 6:30 PM IST. The young cricketers have made India proud and we will honour their achievements. दक्षिण अफ्रीका की मेज़बानी में पहली बार आयोजित हुए महिला अंडर-19 विश्व कप का फाइनल भारत और इंग्लैंड के बीच खेला गया. जिसमें टीम इंडिया ने 7 विकेट से जीत दर्ज करते हुए एक नए अध्याय की शुरुआत कर दी. फाइनल मुकाबले में भारत की कप्तान शैफाली वर्मा ने टॉस जीतकर पहले गेंदबाज़ी करने का फैसला लिया और इंग्लैंड की टीम को मात्र 68 रन के स्कोर पर ऑलआउट कर दिया. वहीं इस लक्ष्य को भारतीय टीम ने 3 विकेट खोकर हासिल कर लिया. भारतीय जूनियर टीम के चैंपियन बनते ही भारतीय क्रिकेट कंट्रोल बोर्ड ने 5 करोड़ की इनामी राशि का एलान कर दिया. बता दें कि टीम की इस जीत में महत्वपूर्ण रोल अदा करने वाले कोचिंग और स्पोर्ट स्टाफ में इस राशि को बांटा जाएगा. * * पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:09:31","image_url":"https://c.ndtvimg.com/2023-02/2dbu6b7g_sachin-tendulkar_625x300_01_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"तीसरे टी20 में भी पृथ्वी शॉ को नहीं मिली जगह, ट्विटर पर फैंस ने निकाली भड़ास","link":"https://sports.ndtv.com/hindi/cricket/prithvi-shaw-did-not-get-a-place-in-the-third-t20-as-well-fans-expressed-their-anger-on-twitter-3744472#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में तीसरा टी20 मैच खेला जा रहा है. जिसमें भारतीय टीम की प्लेइंग इलेवन को लेकर लोग ट्विटर पर सवाल उठा रहे हैं.","content":"पृथ्वी शॉ को नहीं मिली भारतीय इलेवन में जगह भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में तीसरा टी20 मैच खेला जा रहा है. जिसमें भारतीय टीम की प्लेइंग इलेवन को लेकर लोग ट्विटर पर सवाल उठा रहे हैं. दरअसल घरेलू क्रिकेट में लगातार शानदार प्रदर्शन कर रहे पृथ्वी शॉ को टीम में तो शामिल कर लिया गया, लेकिन तीनों ही टी20 मैचों की प्लेइंग इलेवन में उन्हें जगह नहीं मिल पाई. जिसे लेकर फैंस काफी निराश नज़र आ रहे हैं. पृथ्वी शॉ के चाहने वाले अब ट्विटर पर लगातार भड़ास निकाल रहे हैं. Ruturaj and prithvi shaw to shubman and ishan 🙂 Prithvi Shaw will be benched again in the 3rd T20 match against New Zealand! If Prithvi Shaw doesn't play for India, its India's loss. Not his loss 🤙 Prithvi Shaw in dressing room. Heartbreaking wait continues for Prithvi Shaw 💔💔 What are you doing BCCI Management & Hardik Pandya Just destroy talented cricketers.. Need to take care of them. Abomination Nonsense 😡 Hardik should apologise to Prithvi Shaw for including him in the squad but not even giving 1 match to play. If Rahul Tripathi can be given 3 matches, why not Prithvi? This really shows how scared Hardik is to not let him show his skills. Ishan Kishan's record of last 10 t20 matches is not good but he gets a place in the team so why not give Prithvi Shaw a chance today?? * * पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:08:35","image_url":"https://c.ndtvimg.com/2023-01/jjs37348_prithvi-shaw-806_625x300_27_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शुभमन गिल ने करियर का पहला टी20 शतक जड़कर बनाया बड़ा रिकॉर्ड, विराट कोहली को छोड़ा पीछे","link":"https://sports.ndtv.com/hindi/cricket/shubman-gill-made-a-big-record-by-scoring-the-first-t20-century-of-his-career-left-virat-kohli-behind-3744578#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में खेले जा रहे तीसरे टी20 मैच में शुभमन गिल ने शानदार शतक जड़ा है. ये उनके टी20 करियर का पहला शतक है","content":"शुभमन गिल ने लगाया शानदार शतक भारत और न्यूज़ीलैंड के बीच अहमदाबाद के नरेंद्र मोदी क्रिकेट स्टेडियम में खेले जा रहे तीसरे टी20 मैच में शुभमन गिल ने शानदार शतक जड़ा है. ये उनके टी20 करियर का पहला शतक है वहीं इस शतकीय पारी के साथ ही वे भारत की तरफ से तीनों फॉर्मेट में शतक लगाने वाले पांचवें बल्लेबाज़ बन गए हैं. इसके अलावा टी20 क्रिकेट में भारत की तरफ वे व्यक्तिगत तौर पर हाईएस्ट स्कोरर भी बन गए हैं. उन्होंने इस मैच में 63 गेंद में 126 रन बनाए हैं. Stat Alert 🚨- Shubman Gill now has the highest individual score by an Indian in T20Is 💪👏 What a knock by Shubman Gill, 126* runs from just 63 balls, the future has started for India. Take a bow, Prince. भारत की तरफ से टी20 क्रिकेट में हाईएस्ट व्यक्तिगत स्कोर का रिकॉर्ड भी उन्होंने अपने नाम कर लिया है. गिल ने इस मैच में 123 रन बनाए हैं और विराट कोहली को पीछे छोड़ दिया है. विराट को हली के नाम इनसे पहले भारत की तरफ से हाईएस्ट टी20 स्कोर दर्ज था. 1.शुभमन गिल - 126 (63 गेंद) 2.विराट कोहली - 122(61 गेंद) 3.रोहित शर्मा - 118 (43 गेंद) भारत ने इस मैच में टॉस जीतकर पहले बल्लेबाज़ी करते हुए 4 विकेट के नुकसान पर 234 रन बनाए हैं. पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:07:40","image_url":"https://c.ndtvimg.com/2023-02/f3lhdpjo_shubman-gill_625x300_01_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"भारत ने टी20 क्रिकेट में दर्ज की अब तक की सबसे बड़ी जीत, न्यूज़ीलैंड को 168 रन से दी मात","link":"https://sports.ndtv.com/hindi/cricket/india-registered-its-biggest-ever-win-in-t20-cricket-beating-new-zealand-by-168-runs-3744947#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"भारत ने तीसरे टी20 मैच में न्यूज़ीलैंड को 168 रनों से हराकर रनों के लिहाज़ से टी20 क्रिकेट में अब तक की अपनी सबसे बड़ी जीत दर्ज की है.","content":"भारत ने तीसरे टी20 मैच में न्यूज़ीलैंड को 168 रनों से हराकर टी20 क्रिकेट में रनों के लिहाज़ से अब तक की अपनी सबसे बड़ी जीत दर्ज की है. कीवी टीम भारत के दिए 235 रनों के लक्ष्य का पीछा करते हुए मात्र 66 रन के स्कोर पर ऑलआउट हो गई. इससे पहले भारत के कप्तान हार्दिक पांड्या ने टॉस जीतकर पहले बल्लेबाज़ी करने का फैसला किया और भारत ने 235 रनों का पहाड़ जैसा स्कोर न्यूज़ीलैंड के सामने खड़ा कर दिया. जवाब में मेज़बान टीम इस लक्ष्य का पीछा करते हुए बौनी नज़र आई. बता दें कि भारत की तरफ से सबसे ज्यादा 4 विकेट कप्तान हार्दिक पांड्या ने चटकाए. 𝐀 𝐰𝐢𝐧 𝐭𝐨 𝐫𝐞𝐦𝐞𝐦𝐛𝐞𝐫 😃 Congratulations to who register their biggest T20I victory by margin of runs 👏👏 | शुभमन गिल ने इस मैच में शानदार शतक जड़ा. खास बात ये रही है कि ये उनके टी20 करियर का पहला शतक भी रहा वहीं इस शतकीय पारी के साथ ही वे भारत की तरफ से तीनों फॉर्मेट में शतक लगाने वाले पांचवें बल्लेबाज़ बने. इसके अलावा टी20 क्रिकेट में भारत की तरफ वे व्यक्तिगत तौर पर हाईएस्ट स्कोरर भी बन गए हैं. उन्होंने इस मैच में 63 गेंद में 126 रन बनाए हैं. 1.शुभमन गिल - 126 (63 गेंद) 2.विराट कोहली - 122(61 गेंद) 3.रोहित शर्मा - 118 (43 गेंद) स्कोर - भारत - 234/4 (20 ओवर) न्यूज़ीलैंड - 66/10 ( 12.1 ओवर) शुभमन गिल हार्दिक पांड्या पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 21:06:33","image_url":"https://c.ndtvimg.com/2023-02/lvadkp3o_team-india-_625x300_01_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jofra Archer bags six wickets as sensational England comeback continues to end sequence of one-day international defeats","link":"https://www.thesun.co.uk/sport/21244642/archer-england-buttler-cricket/","keywords":["Cricket","Sport","England cricket team"],"creator":["John Etheridge"],"video_url":null,"description":null,"content":"JOFRA ARCHER seized SIX wickets in his second comeback match as England ended their sequence of one-day international defeats. Archer’s mega-haul came after Jos Buttler and Dawid Malan inspired a remarkable recovery with a record-breaking partnership of 232 from 211 balls. APJofra Archer was all smiles after his six wicket haul[/caption] GettyDawid Malan and Jos Buttler produced a record-breaking partnership of 232[/caption] GettyButtler’s side picked up their first win in six matches[/caption] England were 14-3 but Buttler and Malan each scored centuries and made sure they soared to a huge total of 346-7. England won by 59 runs but South Africa triumphed 2-1 in the series. Archer regularly reached 90mph and showed that his two elbow operations and stress fracture of the back are becoming distant memories. Archer has been out of international cricket since March 2021 and his performance will provide a surge of optimism at the start of a year that includes the Ashes and a 50-over World Cup. He took 1-81 in the first match of the series and didn’t play in the second game. But his pace, rhythm and confidence were top-notch in Kimberley yesterday. Archer removed Rassie van der Dussen in his first spell and then Aiden Markram and David Miller when Buttler wanted his quickest bowler to snare a wicket or two and subdue South Africa’s dangerous-looking chase of 347. Archer returned for a third spell that contained three wickets – including the powerful Heinrich Klaasen, who was caught at deep square leg for 80 – and finished off the Proteas’ innings. He finished with the stunning figures of 6-40 in a high-scoring match and could not stop grinning and he walked off holding a match ball. CASINO SPECIAL – BEST NEW CUSTOMER SIGN UP DEALS Player of the Match Buttler said: “Jofra’s performance was fantastic and he was probably deserving of the Player of the Match award, rather than me. “To come back and take those two wickets in the middle overs when the game was in the balance really broke things open for us.” Buttler’s team might have lost the series but at least their victory halted a run of five 50-over losses. A sixth defeat would have meant their worst sequence for 14 years. But little looked less likely half an hour into the match. Jason Roy, Ben Duckett and Harry Brook all perished cheaply and opener Malan and captain Buttler were forced to rebuild slowly. Buttler was scoreless from his first 14 deliveries. England made just 20 runs in their first ten overs and were 73-3 after 20 overs. They had managed only 129-3 by the end of the 30th over. But Malan and Buttler pressed the accelerator so hard that 217 runs were plundered from the final 20 overs. Their stand was England’s highest for the fourth wicket in one-day cricket, beating the 226 put on by Andrew Strauss and Andrew Flintoff against West Indies in 2004. Moeen Ali contributed 41 from 23 balls and England struck 19 sixes in total. Malan admitted: “I couldn’t get the ball off the square for my first 40 and 50 balls! I felt so far behind the game that I chanced my arm and got a bit of momentum. “And when Jos starts going, it’s impossible to stop him. So we dovetailed very well.” South Africa were a long way ahead of England’s comparative score throughout their innings but lost too many wickets – due mainly to Archer. Wrist-spinner Adil Rashid took three wickets and the Proteas were bowled out with almost seven of their overs unused.","pubDate":"2023-02-01 20:33:44","image_url":null,"source_id":"thesun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Akram advises PCB to refrain from removing Babar as captain in any format","link":"https://kashmirreader.com/2023/02/02/akram-advises-pcb-to-refrain-from-removing-babar-as-captain-in-any-format/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Says never considered coaching Pakistan team because of hate and abuse Karachi: Former Pakistan captain Wasim Akram has advised Pakistan Cricket Board (PCB) to refrain from removing Babar Azam as captain in any format of the game. “I think it will be a mistake. Because even if you change him as captain in any format […]","content":"Says never considered coaching Pakistan team because of hate and abuse Karachi: Former Pakistan captain Wasim Akram has advised Pakistan Cricket Board (PCB) to refrain from removing Babar Azam as captain in any format of the game. “I think it will be a mistake. Because even if you change him as captain in any format it is not going to make any difference. What are the options. (It’s) best if he is supported by all of us, including the board. He is young and he will get better as captain. My thinking is that no one is born a natural captain and leader, these things come with time and experience.” Akram added he had always supported Babar as captain because he had a lot of cricket ahead of him and also because he was an automatic selection in the team. “As a nation, I think for once we need to be positive and back Babar. Let’s do it and see what happens. I am confident he will become a good captain.” Akram said he was embarrassed at the way pressure had been built around Babar in recent days. “People in other countries laugh at our cricket culture. We need to start being more positive. Win and loss is part of the game.” He pointed out that Babar had led the team to the T20 Asia Cup final and the ICC T20 World Cup in Australia, which is a big achievement for any captain. Akram also said he has never considered coaching the national team because of the criticism, abuse and hate that are directed at coaches and captains in the country. “I can accept criticism if the team is not doing well. But in Pakistan cricket, it is intolerable the way the captain and coaches are not only criticised but also abused by everyone,” Akram said in an interview. “The abuse and at times hate which the captain and coach have to bear, I don’t think I am up to it. I don’t have that tolerance level, especially when it comes to the use of social media. They are some people who I think only sit on twitter day and night to send out negative comments.” Akram added he didn’t want the extra baggage of stress that comes with coaching the national side. “League cricket is different, the pressure and expectation levels are different, which is why I am involved with the Karachi Kings side in the PSL.” The pace-bowling legend said that as coach of the Karachi side, some players routinely approach him and discuss cricket and he is always there to help and guide them. “I am always willing to be of service to Pakistan cricket but not at the cost of having to bear unnecessary criticism and abuse from anyone out there.” Akram also refused to dwell on Ramiz Raja’s performance when he was the PCB chairman. “I don’t want to talk about him. There is a misconception that only a former cricketer should head the board… I don’t buy that because this is a job which requires a lot of administrative skills and the ability to have good communication with other boards etc,” said Akram. — PTI Akram advises PCB to refrain from removing Babar as captain in any format added by Press Trust of India on 12:59 am February 2, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-01 19:29:30","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Suryakumar remains at top of ICC rankings","link":"https://kashmirreader.com/2023/02/02/suryakumar-remains-at-top-of-icc-rankings/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dubai: Swashbuckling Indian batter Suryakumar Yadav continued his stay at the top in the ICC rankings released on Wednesday. Suryakumar reached the rating of 910 points after he stroked a quick-fire innings of 47 during the first match of India’s ongoing series against New Zealand in Ranchi as the exciting right-hander maintained his healthy lead […]","content":"Dubai: Swashbuckling Indian batter Suryakumar Yadav continued his stay at the top in the ICC rankings released on Wednesday. Suryakumar reached the rating of 910 points after he stroked a quick-fire innings of 47 during the first match of India’s ongoing series against New Zealand in Ranchi as the exciting right-hander maintained his healthy lead at the top of the T20I rankings for batters. While Suryakumar played a more composed knock of 26 not out in the second match of the series, the 32-year-old dropped back to a total of 908 rating points as a result. It also means Suryakumar remains within striking distance of England batter Dawid Malan in the race to hold the highest rating of all time for men’s T20I batters. Malan achieved a rating of 915 points in Cape Town back in 2020, but Suryakumar now holds the second highest rating of all time for T20I batters following his recent heroics with the willow. He claimed the top ranking for current batters while scoring a total of 239 runs from six matches at last year’s T20 World Cup and only last month was deservedly named the ICC T20 Cricketer of the Year. No other Indian featured in the top 10 of the batters or bowlers list while Hardik Pandya remained third among all-rounders. India’s Mohammed Siraj contines to be the top-ranked bowler in the ODI rankings. Shubman Gill (sixth), Virat Kohli(seventh) and Rohit Sharma (ninth) remain static in the batters’ list. PTI Suryakumar remains at top of ICC rankings added by Press Trust of India on 12:58 am February 2, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-01 19:28:34","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"England beat South Africa to avoid whitewash one-day international series defeat","link":"https://www.sportsmole.co.uk/cricket/england/news/england-beat-south-africa-to-avoid-whitewash-odi-series-defeat_505619.html","keywords":["Cricket","England","South Africa","Dawid Malan","Jos Buttler","Jofra Archer","Lungi Ngidi","Jason Roy","Ben Duckett","Harry Brook","Moeen Ali","Temba Bavuma","Reeza Hendricks","Aiden Markram","Heinrich Klaasen","505619"],"creator":null,"video_url":null,"description":"England end a five-match winless streak in one-day internationals by beating South Africa by 59 runs in Kimberley.","content":"In the first two encounters, the added desire of South Africa, fuelled by needing three successive triumphs to boost their hopes of earning automatic qualification for the World Cup, proved decisive in overcoming the 20-over and 50-over world champions. However, England's motivation to get back on track and the growing expectation on South Africa arguably combined to make the difference on Wednesday. England somehow managed to prevail in a fixture where they lost the toss and were reduced to 14-3, significantly boosted by a 232-run fourth-wicket partnership between Dawid Malan and Jos Buttler . Jofra Archer then proceeded to mark his return to international cricket with the best ODI figures of his career, recording 6-40 off 9.1 overs. Lungi Ngidi had threatened to steal the show with the ball in the early stages of the game, taking the wickets of Jason Roy (1), Ben Duckett (0) and Harry Brook (6). \"That is POWERFUL from Dawid Malan\" 💥 What a six! 👏 pic.twitter.com/5BUNxMgmkH England were very much in a position where they could have folded, only for Malan and Buttler to rebuild with discipline before putting their feet on the accelerator to put England in a commanding position. Their barrage of runs came off just 35 overs, Malan falling for 118 off 114 balls before Buttler combined with Moeen Ali (41) to take England to 313-5. Buttler, the captain, was eventually dismissed for 131 off 127 deliveries, a knock which included seven sixes, and England made 346-7 off their 50 overs. While South Africa were always in the run chase, they lost wickets at regular intervals, with innings from Temba Bavuma (35), Reeza Hendricks (52) and Aiden Markram (39) doing no more than keep the Proteas competitive. A seventh-wicket partnership of 85 took South Africa to 278, left requiring 69 off 62 balls, but Heinrich Klaasen 's departure for 80 took the momentum out of their innings. Archer returned to the action to conclude the match, South Africa's tail-enders failing to deal with his pace much like those from third and lower in the batting order, and England's future remains bright if they can keep the fast bowler free from injury during 2023.","pubDate":"2023-02-01 18:58:36","image_url":"https://sm.imgix.net/23/04/jos-buttler.JPG","source_id":"sportsmole","category":["sports"],"country":["united kingdom"],"language":"english"}]}