{"newsArray":[{"title":"Injury cloud still surrounds Cummins","link":"https://www.themercury.com.au/sport/cricket/injury-cloud-still-surrounds-cummins/video/3e8f72ad0c3d0ad0cf2f751a1183b912","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Pat Cummins is still dealing with a quad injury and it is unknown if he will be healthy in time to play the second Test against the West Indies.","content":"Cricket: Pat Cummins is still dealing with a quad injury and it is unknown if he will be healthy in time to play the second Test against the West Indies.","pubDate":"2022-12-05 23:27:16","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Lord’s Taverners cricket Team of the Year","link":"https://www.couriermail.com.au/questnews/sport/we-name-our-lords-taverners-cricket-team-of-the-year/news-story/2ea3c3d77ec3762a703021cbe07f57dc","keywords":["GPS","Local Sport","More Sports","QN All local sport and galleries","QN City sport","QN Moreton sport","QN North sport","QN South East sport","QN South West sport","QN West sport","Sport"],"creator":null,"video_url":null,"description":"As Wests celebrate their cherished Lord’s Taverners premiership, which they secured with a victory over Valley on Sunday, we take the chance to name our Team of the Season.","content":"The Wests boys lasted tasted victory in the Tavs’ competition in 2012-13, as such we have three of them featured in our XI.It had been an evenly matched cricket season with Valley breaking free late in the piece. But, rivals Wests were too strong in the Grand Final, taking them down by 107 runs.Such is the depth of this side, we weren’t able to find a place in the starting XI for consistent performers who could well and truly mix it with the best.Sandgate-Redcliffe’s Kane Neilsen was brilliant with the bat, averaging 32.55, while Valleys’ Saxon Jeh, Ipswich’s Kori Ramsden, Toombul’s Eshwin Kapoor and Sunshine Coast’s Talon Reichert all had incredible campaigns.Jeh took 23 wickets, two coming in the Grand Final and Kapoor 19. Ramsden showcased his ability to make an impact with both bat and ball, the all rounder a top 10 wicket taker and an excellent bat with an average of 24. Reichert was also the seventh leading wicket taker.UQ’s Jamie Alexander was a class allrounder, playing just 11 games, taking 17 wickets and scoring just shy of 250 runs.But here were our heavy hitters of season 2022.TEAM OF THE YEARDaniel Skipwith Club: Western SuburbsSkipwith strikes it well, quickly and never wavers in the face of a swinging new ball. He averaged 32 this season and is an easy selection to open the batting given the start he can get a team off to.Harry Frost and Luke WardClub: ValleyThere’s little wonder why Valley made it so far, when they have the best opening batsmen in the competition. They come as a packaged deal these two and their heroics throughout the season will be called upon come Grand Final Day.Frost scored a century, two fifties and 491 runs on his way to a brilliant batting average of 35. Ward wasn’t far behind with an average of 31 and three fifties.Alexander ProcopisClub: Northern SuburbsThe powerful Procopis had himself a summer of dreams. He was the best batsmen in Tavs’ this season, a class above whose wicket was celebrated with the utmost joy.In his 12 innings, he racked up 545 runs, five fifties and a century at an average of 45.42.And don’t forget he struck it at over a run-a-ball.Jack Sonter Club: Western SuburbsAll season Sonter featured in our Team of the Week. He was close to a century in what was a brilliant campaign for the first drop batsmen.He averaged 32 but his value in the top order can’t be put down to just numbers. When Wests lost one, he was there to steady the ship and get the scoreboard ticking over.Steven Hogan and Carter SimpsonClub: Sandgate-RedcliffeHogan had his way all season and so did Simpson for that matter. It doesn’t matter where Hogan bats in the order, he will get you 30 or more runs. His average was just shy of 56. Out of his 11 times at the crease, he was unbeaten three times. That really says it all about the calibre of player he is.It was a similar story for his partner in crime, Simpson averaging 38.22 when opening the batting. As such, he was rewarded with selection in the Queensland Under-17 team.Jackson SteinhardtClub: Wynnum ManlyThis spot was destined for Steinhardt and no one came close. Indeed he is a masterful all rounder, a Do It All who would have taken the Most Valuable Player (MVP) award for his side.He was lethal with ball in hand, tying second with Fergus McFadyen for the most wickets taken—23. Oh, and he averaged 40 with the bat as well.Griffith WilliamsClub: Gold CoastWilliams was an excellent bowler for the Gold Coast, but sometimes it didn’t show on the stat sheet.He took 19 wickets in 12 games, but a few went begging. The Queensland Under-17 team member completes this team’s bowling lineup, but depending on what you’re after, Ipswich’s Kori Ramsden or Toombul’s leg spin king Eshwin Kapoor could’ve snuck their way in given their magnificent seasons.Amitoj SidhuClub: ToombulToombul talent Amitoj Sidhu erased six batsmen in one innings this season and that alone is enough to earn him a spot in this team. Valleys’ Saxon Jeh challenged, as did Sunshine Coast’s Talon Reichert, but we couldn’t go past the Queensland Under-17 select.Fergus McFadyenClub: Northern SuburbsAnother Queensland Under-17 reserve squad member, McFadyen strengthened his case for a spot in the starting XI with not only his bowling but his fielding also.To go along with the fierce attack he posed which amounted to 23 wickets, you’d trust him over anyone to catch your phone over a high rise balcony. It’s hard to leave out the competition’s second leading wicket taker.Kye Martin Club: Western SuburbsMr Consistent. Kye Martin was a maiden specialist, who bowled in the right areas, kept it tight, never letting the dam fall to allow runs to leak.He took 21 poles at an average of 14 and should give himself a pat on the back after his efforts this season.Brayden Meegama Club: UQMasterful is the word that comes to mind. This young spinner had batsmen back in their crease playing every ball with extra care. He took 31 wickets in 11 games, bowled 15 maidens and got fifer at an out of this world average of 7.26He is a reserve squad member for the Queensland Under-17 team.12th MenThey may be the 12th men, but they could easily be in the starting XI. Jacob Bath (Gold Coast) and Jamie Diggles (Sunshine Coast) both averaged almost 30. Bath had a sensational 111 run knock which made his inclusion in the squad a no-brainer.Ramsden is also an easy selection if both batting and bowling prowess is required. We knew how deadly he could be with the bat, but in just nine matches with ball in hand he took 19 wickets. Meegama was the lone bowler in the competition averaging better than Ramsden’s 10.53, with 7.26.Footnote: High praise to Sunshine Coast’s Chace Oates, who played just six matches due to his Queensland Reds Under-16 commitments in the National Championships.Oates was rewarded with selection in the first installment of the U16s Australian Development Squad.Check out the 2022-23 Queensland Under-17 Squad here.","pubDate":"2022-12-05 22:00:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Adelaide Oval set to attract record crowd after Perth ‘flop’","link":"https://www.couriermail.com.au/news/south-australia/saca-expecting-strong-crowds-for-adelaide-oval-test-match-between-australia-and-the-west-indies/news-story/f00ccc93b6c1f0568c411af9ddc3b474","keywords":["Cricket news and galleries","News","State News - SA"],"creator":null,"video_url":null,"description":"The South Australian Cricket Association is expecting “strong’’ crowds for this week’s Adelaide Oval Test match between Australia and the West Indies, despite the opening Test of the summer in Perth being an attendance flop.","content":"Only 41,918 spectators attended Perth’s first red-ball international since Covid-19, an average of just over 8000 a day for the five-day match, prompting former Australia captain Kim Hughes to label the turnout as “woeful”.While Cricket Australia has refused to disclose ticket sales for the day-night, pink-ball Adelaide Test, which starts on Thursday, SACA is expecting crowds of between 20,000 and 25,000 for the first few days, which would easily eclipse Perth’s total.A total of 105,415 fans attended the five days of last year’s Adelaide Oval Ashes Test between Australia and England.New SACA chief executive Charlie Hodgson described the annual Adelaide Test, where play will begin at 2.30pm each day, as “one of the marquee events of the Australian summer’’.The association believes more people will flock through the gates for this year’s Test than when the West Indies last played Tests at the ground in 2005 (69,342) and 2009 (65,610).Hodgson said member support was strong and that a new “twilight ticket’’ this year would allow fans to purchase tickets for the second and third sessions each day at a discounted rate.“And we are delighted to welcome the West Indies for the first time since 2009,’’ he said.“This year we are celebrating 30 years since the famous Test between the two nations at Adelaide Oval that ended with a margin of just a single run while this match will also mark the maiden time the West Indies have played a day-night Test at the iconic venue.‘The SACA membership is in the strongest position it has ever been due to the loyalty of our members over the past two years and the strongest waitlist growth in a generation.“We know the Village Green will again be a popular location throughout the Test and we look forward to sharing the occasion with our wonderful members and passionate supporters of cricket from across South Australia and beyond.’’A crowd of 15,428 attended last month’s 50-over One-Day International between Australia and England at Adelaide Oval but international crowds have been well down in Australia this season.While Perth’s 60,000-seat Optus Stadium was close to 80 per cent empty on each day of the opening Test, only 10,406 rocked up for the final ODI clash at the MCG.That was the lowest crowd for an ODI involving Australia at the famous ground.The uninspiring three-match series was played after Australia hosted the men’s Twenty20 World Cup.Meanwhile, UK megastar Robbie Williams has been announced as the headline act for next year’s Adelaide 500 after the roaring success of the revived race.Less than 24 hours after 260,000 people flocked to the city circuit, Premier Peter Malinauskas announced on Monday that Williams would take the stage on November 26, 2023.","pubDate":"2022-12-05 21:45:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"World goes mad over ‘greatest win in history’","link":"https://www.themercury.com.au/sport/cricket/england-claim-greatest-win-in-test-history-as-aggressive-tactics-pay-off-against-pakistan/news-story/10674a386ddbd363f32f12e93f587d47","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"England has claimed one of their greatest Test victories of all time with their aggressive tactics paying off in spades against Pakistan.","content":"Fast bowlers Ollie Robinson and James Anderson took four wickets apiece as England pulled off an anthralling 74-run win over Pakistan on Monday night (AEDT) in the first Test in Rawalpindi.Anderson took 4-36 and Robinson 4-50 on a placid Rawalpindi Stadium pitch to dismiss Pakistan for 268, with the stadium floodlights glowing as daylight faded.Pakistan’s last pair of Naseem Shah (six) and Mohammad Ali (nought) defied England for 35 minutes and 8.5 overs before spinner Jack Leach trapped Naseem leg-before, leaving England players ecstatic.Watch Australia v West Indies. Every test match live and ad-break in play on Kayo. New to Kayo? Start your free trial now >“That is one of the greatest Test match victories you will ever see,” commentator Nasser Hussain declared.Meanwhile, English media figure Piers Morgan branded it the “greatest win in Test history” as the cricket world went wild over the incredible result.The win -- giving England a 1-0 lead in the three-Test series -- embellished England’s newly adopted “Bazball” cricket, an aggressive style taken from the nickname of head coach Brendon McCullum.Skipper Ben Stokes was also active throughout the day, keeping unrelenting pressure on the Pakistan batters with close-set fields and intelligent bowling changes.He hailed the win as “special”, figuring they had less than 10 minutes to seal victory before bad light would have been called.“I think it’s maybe up there with one of England’s greatest away wins,” said Stokes.“We’ve done something very special this week.”The win is England’s seventh in eight Tests under the new management of McCullum and Stokes, installed in May this year.It was achieved after dangling the carrot-like target of 343 runs for Pakistan to win in a possible 130 overs.For a while, Pakistan had their chance.At tea, Pakistan were 257-5 -- needing 86 runs to win in an intriguing last session.England needed five wickets, and Robinson struck in the fourth over after the break, trapping Agha Salman leg-before for 30.In his next over he claimed Azhar Ali for 40 to bring England close to victory. At the other end, Anderson removed Zahid Mahmood (one) and Haris Rauf (nought) in the same over as four wickets fell for just seven runs.Then it was down to nail biting before Leach removed Naseem. “We are disappointed as a team,” Pakistan skipper Babar Azam said afterwards. “At lunch we were confident that we could win, but credit to England on their brilliant effort.” A total of 1,236 runs were scored by the two teams in their first innings -- England 657 and Pakistan 579 -- before the visitors set the Test alight by declaring their second innings at 264-7 on Sunday.Pakistan batted with caution in the first session as they progressed from an overnight total of 80-2 to 169-3, losing opener Imam-ul-Haq for 48 to pacer Anderson.Mohammad Rizwan was one of two wickets to fall in the second session for 46, putting on a fighting 87-run stand for the fourth wicket with Saud Shakeel, who scored 76.In the fourth over after lunch, Anderson had Rizwan caught behind while Robinson dismissed Shakeel to an excellent catch by substitute Keaton Jennings at short cover.England are on their first Test tour of Pakistan since 2005, having declined to visit in the interim years on security grounds.The second Test is in Multan from December 9 to 13, and the third in Karachi from December 17 to 21.- With AFP","pubDate":"2022-12-05 19:56:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ist Test, Day-5: Aggressive England beats Pakistan by 74 runs in 1st test","link":"https://kashmirreader.com/2022/12/06/ist-test-day-5-aggressive-england-beats-pakistan-by-74-runs-in-1st-test/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Rawalpindi: England showcased its masterful approach of aggression in test cricket with a superb 74-run victory over Pakistan in the final session of the first test on Sunday. Needing 263 runs with eight wickets in hand on Day 5, Pakistan was dismissed for 268 against the reverse swing of James Anderson (4-36) and Ollie Robinson […]","content":"Rawalpindi: England showcased its masterful approach of aggression in test cricket with a superb 74-run victory over Pakistan in the final session of the first test on Sunday. Needing 263 runs with eight wickets in hand on Day 5, Pakistan was dismissed for 268 against the reverse swing of James Anderson (4-36) and Ollie Robinson (4-50) — losing its last five wickets for just 11 runs after tea. Jack Leach had the last wicket of Naseem Shah, trapped leg before wicket, after England delayed the second new ball for well over an hour with Anderson and Robinson doing the damage with the old ball. Pakistan succumbed to the relentless attacking field settings of England captain Ben Stokes before Robinson and veteran Anderson sliced through the lower order after Pakistan was placed at 257-5 going into the final session. Robinson had earlier ended the nearly four-hour defiance of one of the four Pakistan debutants Saud Shakeel in the second session to a brilliant diving catch by Keaton Jennings as the lefthander top-scored with 76. England had posted an electrifying 657 and Pakistan responded with 579 to concede a 78-run lead on a grass-less wicket where seven batters from both sides scored centuries. England made a bold declaration with another rapid 264-7 in just 35.5 overs on Day 4 and set Pakistan a challenging target of 343 in four sessions. England leads its first test series in Pakistan in 17 years 1-0 with Multan and Karachi scheduled to host the remaining two games. —PTI Ist Test, Day-5: Aggressive England beats Pakistan by 74 runs in 1st test added by Press Trust of India on 12:42 am December 6, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-05 19:12:49","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Specialist players and split coaching make lot of sense for bigger international teams: Andy Flower","link":"https://kashmirreader.com/2022/12/06/specialist-players-and-split-coaching-make-lot-of-sense-for-bigger-international-teams-andy-flower/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: One of the shrewdest minds in world cricket, Andy Flower, feels having different coaches and specialist players for red and white-ball cricket make a “lot of sense” for bigger teams like India, England and Australia amid a punishing international calendar. Reigning T20 and ODI World Cup champions England are the only major side […]","content":"New Delhi: One of the shrewdest minds in world cricket, Andy Flower, feels having different coaches and specialist players for red and white-ball cricket make a “lot of sense” for bigger teams like India, England and Australia amid a punishing international calendar. Reigning T20 and ODI World Cup champions England are the only major side to adopt the split coaching formula and have a totally different set-up for the five-day and shorter formats. Flower, who now coaches T20 franchises around the world after spending 12 years in English cricket set-up, feels the mental health of players and coaches is bound to be affected with so much cricket going on. “For some countries it is not needed. For bigger countries who are playing tons of cricket, players specialising makes sense. It would also make sense from a coaching point of view and a lifestyle and health point of view. “Being on the road, living in hotels for two or three quarters in a year, that is not a healthy thing for families and relationships,” the former Zimbabwe captain told PTI on the sidelines of Abu Dhabi T10 League. Commenting on the roaring success of England in the shorter formats, Flower said a lot of credit must go to former captain Eoin Morgan and coach Trevor Bayliss, who engineered the side’s remarkable transformation after a dismal 2015 World Cup. “The biggest catalyst of change was Eoin Morgan and Trevor Bayliss. They encouraged an uber attacking style of play and they had freedom to do this as they had a poor World Cup in 2015,” said the 54-year-old. Flower coaches the Lucknow franchise in the IPL and has coached in T20 leagues around the word since 2019. He was with Delhi Bulls for the T10 League in Abu Dhabi. His captain at Lucknow, K L Rahul, has copped a fait bit of criticism of late for his strike rate. Asked to comment on his recent performances, Flower said: “I don’t agree with you that he has not been able to deliver. “He has proved time and time again that he is able to deliver. He is an amazing cricketer and so beautiful to watch but also he has got an amazing record, especially in the IPL, and a ridiculously good average. I rate him very highly.” Talking about the T10 format, Flower said the 10-over a side game is an ideal pitch for cricket’s entry into the Olympics. “T10 is an excellent format. It is very exciting to be part of. It is a very aggressive form of the game. Because it has a shorter time span, it makes it very attractive for tournament play, you can play three day games in a day on the same pitch. For me this would be a perfect format for cricket’s entry into the olympics. “At the moment the most popular form of cricket is T20 and that format, too, is growing. I would be surprised if T10 did not grow in popularity,” he added. PTI Specialist players and split coaching make lot of sense for bigger international teams: Andy Flower added by Press Trust of India on 12:39 am December 6, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-05 19:09:11","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"OPEN LETTER: C’mon Albo, join our team","link":"https://www.couriermail.com.au/news/tasmania/open-letter-to-anthony-albanese-on-the-hobart-stadium/news-story/f837b1251d5e56bc568ccad61e5eca9e","keywords":["Sport news and galleries","Tasmania News and Galleries"],"creator":null,"video_url":null,"description":"To:Mr Anthony Albanese","content":"Prime Minister of AustraliaParliament House CanberraDear Albo,This letter is for the kids and footy fans of Tasmania. The boys and girls who dream of playing footy at the highest level, at any level, with their mates and “besties”, against neighbouring schools and towns. Kids who just want to wear a pair of footy boots and some who will aspire for the ultimate dream of AFL and AFLW.It is from Tassie’s former footy stars, its current footy stars, its future stars, its wannabes and could-have-beens, the mums and dads who drive kids to footy fields on frosty mornings, who cut the oranges and bring the sandwiches and juice, who wipe beaming faces and bleeding knees.It is from the invisible volunteers who work in the shadows so their clubs can thrive and survive, and especially those who wash those muddy jumpers on days when nothing will dry. They need an AFL team. Tasmania needs an AFL team. The AFL needs Tassie. That team needs a stadium. That stadium needs you.From the footy fans of Tasmania, the kids, the mums and dads, the schools, health and fitness campaigners, the hotels, restaurants, cafes, tourism businesses, Tasmania needs the Albanese government to back our team and help fund our field of dreams.Macquarie Point has been selected as the perfect site for the people’s stadium – it would be the most accessible venue in the AFL relative to a capital city’s CBD.The stadium design looks amazing and the state government has already committed $375m.Time for you to tip in for the other half of the build.It is not just football that will benefit from a legacy venue. Cricket plans Big Bash games there, one-day internationals and the ultimate red-ball dream, a Test match, maybe even the Ashes.There would be concerts and conferences, and in the surrounding cultural and arts precinct, festivals would flourish. None more so than Tasmania’s favourite winter celebration, Dark Mofo.The build alone would create 4200 jobs during construction and maintain 950 jobs a year during operation. During construction it would generate $300m in additional economic activity and then $85m each year after it is built as well as $162m each year in consumption, because of an expected spike in the visitor economy.AFL boss Gill McLachlan says a Macquarie Point stadium would deliver a $2bn cash injection into the state’s economy in its first 20 years. Those numbers can’t be ignored.Tasmania is blessed with great natural wonders, incredible people and a football culture that started in a sheep paddock at Richmond when the Gold Coast was a swamp.We belong in the big league and a stadium is essential to Tasmania securing its place in the national competition. With a funding commitment from your government, you can make that happen.And when it does, generations of true believers will see their dream come true. And it will be future generations of Tasmanians to reap the benefits.The game is incomplete without Tassie: The ONLY state without a team in Australia’s biggest sport.It’s not truly a national game until this is fixed. The MercuryNED-7429 Mercury Banner","pubDate":"2022-12-05 19:00:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussies pass pub test: Test players shock fans for a coldie","link":"https://www.couriermail.com.au/sport/cricket/cricket-news-fans-stunned-as-test-players-join-them-for-a-beer/news-story/cac988dea561828c8b18e3d3607a5334","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"There’s no better way to break down barriers with your fans than to go out and have a drink with them — and that’s what Australia did after their first Test win in Perth.","content":"The sight of players casually mixing with supporters at The Camfield pub immediately adjacent to Optus Stadium just an hour or two after their victory over the West Indies was a rare but welcomed sight.Punters in supporters’ gear enjoying a post day five coldie at the pub just a stone’s throw from the stadium gates would have got a shock when players casually walked in like one of them for a Sunday afternoon refreshment in the afternoon sun.In the past, players would celebrate well away from fans.The microscope is on the image of the team at the moment after lacklustre crowds to start the summer, but the subtle act of players leaving the dressing room to have a quiet drink at the same watering hole as their fans will do more to endear themselves to the public than any forced attempts to win back favour ever could.The public will again get an insight into the team on January 13 when Amazon Prime Video releases The Test Season Two, a fly-on-the-wall look at last year’s tumultuous period. The behind-the-scenes doco which might help players win the PR battle after Justin Langer’s exit, but that perspective will come too late to save attendances for this summer’s Test matches.CHECK IT OUT: THE TEST SEASON TWOAttendance for the second Test in Adelaide will serve as the most accurate barometer so far for whether there is a major disconnect between Australian cricket and the fans, because Adelaide is Australia’s No. 1 cricket city.Ticket sale forecasts for Test starting on Thursday are said to be ahead of Perth, where paltry crowds turned up for each of the five days — a turnout described by WA’s only Test captain Kim Hughes as “woeful”.The South Australian Cricket Association are expecting more than 15,000 members through the gates on day one and two which means Cricket Australia should be safely guaranteed a decent crowd in excess of 20,000 for the match starting on Thursday.Only 18,000 turned up to Australia’s do-or-die Friday night World Cup match in Adelaide and only 15,420 to the ODI against England last month, so Thursday’s day one attendance will be waited on with interest.Claims that the Australian team are on the nose have been fuelled by an assertion they are million dollar superstars fans can’t relate to.But there were other examples during the Perth Test of the human side of players coming to the fore.The WACA posted a video of Nathan Lyon taking one of Australia’s intellectual disability cricketers Boyd Duffield into the dressing rooms after play where he cops some gentle banter over his support of the Canberra NRL team by Newcastle Knights fan Josh Hazlewood before he finds a Raiders ally in Usman Khawaja, and meets his idol Steve Smith.That video has been viewed nearly a million times on social media.Marnus Labuschagne and his wife Bek meanwhile has taken it upon themselves to raise money for Compassion Australia, with his 300 runs in Perth feeding 300 hungry Australian families and raising over $6500.Pictures of teammates’ David Warner, Khawaja and Smith holding Labuschagne’s new born baby, Hallie, were also sweet insights into what happens behind closed doors.The first documentary series featuring Justin Langer and Tim Paine gave the team a major PR boost, and the release of the sequel could be a timely way for the Australian team to engage fans on a deeper level again after the controversial departures of their former coach and captain.Co-directors Sheldon Wynn and Adrian Brown say the purpose of season two is to show fans who the players really are.“While season one focused on the rebuilding of the Australian men’s team in the eyes of the Australian public, this series takes viewers closer to the player experience and into their lives off the pitch,” said Wynn.“Whether it be Pat Cummins talking us through the challenges of juggling his Test captaincy with his new fatherhood, or Usman Khawaja speaking at an Islamic college about his challenges growing up, the stories of the players are rare, and sometimes profound, insights into this new generation of cricketers.“We feel audiences are going to get to know the Australian men’s Test team in a way they never have before.”","pubDate":"2022-12-05 19:00:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 LIVE Score: Neymar returns to starting XI as Brazil face South Korea in round of 16 clash","link":"https://www.firstpost.com/sports/brazil-vs-south-korea-live-score-fifa-world-cup-2022-round-of-16-football-match-today-latest-updates-qatar-11757471.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"FIFA World Cup 2022 LIVE Score: Neymar returns to starting XI as Brazil face South Korea in round of 16 clash","content":"FIFA World Cup 2022 LIVE Score: Neymar scores on return to take Brazil 2-0 up against South Korea FIFA World Cup 2022 LIVE: Hello and welcome to our LIVE coverage of the FIFA World Cup 2022 round of 16 match between five-time champions Brazil and South Korea. The winners of this contest in Doha will face Croatia in the quarter-final. FP Sports December 05, 2022 23:52:15 IST Auto refresh feeds Brazil's Neymar in action during the FIFA World Cup in Qatar. AP Highlights LIVE NEWS and UPDATES Dec 06, 2022 - 00:46 (IST) 13' Brazil 1-0 South Korea GOAAAL! Neymar converts a penalty to score in his return from injury! Not even quarter of a game has been completed by Brazil find themselves 2-0 up against South Korea. Brazil had won the penalty after Richarlison was brought down inside the box. Dec 06, 2022 - 00:40 (IST) 7' Brazil 1-0 South Korea GOAAAAL!! Vinicius Junior gves Brazil the lead against Korea Republic early on in this round of 16 contest in Doha. Dec 06, 2022 - 00:31 (IST) 1' Brazil 0-0 South Korea And we're underway in Doha! Korea Republic in their red and black outfit gets the match underway, against Brazil who are donning their traditional yellow outfit. Dec 06, 2022 - 00:28 (IST) Right. National anthems of both Brazil and South Korea are complete. Time for LIVE action. Remember, winners of this contest will face Croatia in the quarter-finals. Dec 05, 2022 - 23:54 (IST) FIFA World Cup 2022 LIVE updates Brazil vs South Korea starting XIs Brazil : Alisson, Eder Militao, Marquinhos, Thiago Silva, Danilo, Casemiro, Lucas Paqueta, Raphinha, Neymar, Vinicius Junior, Richarlison. South Korea: Seung-Gyu Kim, Moon-Hwan Kim, Min-Jae Kim, Young-Gwon Kim, Jin-Su Kim, In-Beom Hwang, Jung, Hee-Chan Hwang, Jae-Sung Lee, Heung-Min Son, Gue-Sung Cho. Dec 05, 2022 - 23:38 (IST) Hello and welcome to our LIVE coverage of the FIFA World Cup 2022 round of 16 match between five-time champions Brazil and South Korea. The winners of this contest in Doha will face Croatia in the quarter-finals, who beat Japan on penalties in an earlier match today. Stay tuned for updates. Preview: Neymar appeared to have fully recovered from his ankle injury and was expected to return to Brazil’s starting lineup against South Korea in the round of 16 at the World Cup on Monday. A smiling Neymar trained with teammates on Sunday in a practice session that was partially open to media. He appeared to no longer be bothered by the injury that kept him out of Brazil’s previous two matches. Coach Tite had said earlier in the day that Neymar would play if all went well in the team’s final training session before the match against South Korea. The Brazil forward missed two group matches after injuring his right ankle in the team’s opening win over Serbia. He was back training for the first time on Saturday. Tite said he planned to use Neymar from the opening whistle instead of as a substitute if he’s healthy enough to play. “I prefer to use my best player from the start,” Tite said. “It’s the coach who has to make that decision and take on that responsibility.” Tite said left back Alex Sandro is out because of a hip injury, but right back Danilo will be available after recovering from a right ankle injury. Brazil struggled without the playmaker but still won its group despite a loss to Cameroon in the last match. This will be the first time Brazil and South Korea meet in an official match, with the Brazilians winning six of their seven friendlies, including 5-1 in June. South Korea’s only win came in 1999. South Korea advanced in Qatar thanks to a dramatic stoppage-time goal by Hwang Hee-chan in a 2-1 victory over Portugal. The team had drawn with Uruguay in its opener and then lost to Ghana. With inputs from AP Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 06, 2022 00:43:54 IST TAGS: Brazil Vs South Korea Fifa World Cup 2022 Kickingaround","pubDate":"2022-12-05 18:22:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Neymar-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Gob-smacking Bazball proving as successful as it is seductive as England stun Pakistan","link":"https://metro.co.uk/2022/12/05/cricket-pakistan-england-gob-smacking-bazball-proving-successful-seductive-17882873/","keywords":["Cricket","Sport","Ben Stokes","Brendon McCullum","England cricket","Pakistan Cricket"],"creator":["Derek Pringle"],"video_url":null,"description":"'This was the greatest expression yet of Bazball.'","content":"Ben Stokes and Brendon McCullum celebrate England’s remarkable win (Picture: Getty) Forget whether this was one of England’s greatest ever Test wins, which it was, and realise instead that it was the greatest expression yet of Bazball – which is remarkable given the extraordinary results that phenomenon has yielded in its spirited dismantling of Test match orthodoxy. To win in Pakistan as a visiting team is fiendishly difficult, the ultra-benign pitches and an opponent who knows how to use them make it so. In 61 years, England have won just three Tests there, including today’s victory by 74 runs in Rawalpindi. Unsurprisingly, something that scarce is rightfully prized, hence the superlatives emanating from every quarter.  What made this triumph stand prouder is that its conception and execution were more audacious than anything attempted by an England team previously. From the galloping scoring-rate; to the attacking bowling and field settings; to the bold declaration which gave Pakistan (who’d made little running in the match) the chance of snatching a win; the intention was to bat for two days and field for three. It was the ultimate expression of risk and reward and for that Ben Stokes, the captain, must take the bulk of the plaudits. Indeed, Nasser Hussain, who captained England from 1999-2003, went as far as to say it was ‘the greatest bit of England captaincy he’d ever seen’. It was certainly daring. Although risking defeat to win was commonplace in county cricket during the three-day era 25-plus years ago (there being no points for draws), few Test captains ever contemplate declaring except from an impregnable position. It is rare and in 145 years only 13 have done so and lost, one of them Hansie Cronje after he’d been nobbled by match-fixers. Stokes set Pakistan 342 to get in the final four sessions of play, which may not seem overly generous until you factor in that the pitch was wearing better than a marble floor and 1,500 runs had already been scored in 292.2 overs (a collective run-rate of 5.1 runs an over). Offering Pakistan the genuine chance of an undeserved win was the tempter needed if the match was not to end as a draw, a result this England team holds in contempt. Judging the declaration wasn’t Stokes’s only masterstroke. From his bowling changes and funky field settings to his choice not to take the second new ball at the start of the final session (the old ball was offering reverse swing), his decisions had a Midas touch about them. England are 1-0 up in the three-match series (Picture: Getty) England’s bowling does not possess the same verve as its batting to expedite Bazball, so taking those ten second-innings wickets was always going to be tough on such a docile pitch. It was why Ollie Robinson, who took four of them, was made player of the match when seven batters made hundreds. Robinson’s three-wicket strike either side of tea, including the well-established Saud Shakeel and Azhar Ali, brought England belief. A tall bowler whose strengths are accuracy and seam movement, Robinson had to move away from all that and work wickets in unfamiliar ways. So we had Azhar caught at leg-slip and Shakeel falling to a brilliant catch by Keaton Jennings at silly mid-on, a position I doubt Robinson has utilised since his schooldays. Brilliantly supported by Stokes and James Anderson, who both put in stoic efforts on an unyielding surface, they made for an odd trio comprising a 40-year old, an all-rounder with a chronic knee problem, and someone deemed unfit for purpose just seven months ago. With a great deal of skill and grit they got the job done taking nine of the wickets to fall, left-arm spinner Jack Leach weighing in with the tenth. People may be surprised that spin didn’t play more of a role, it being Asia where the ball usually turns and the match going the distance. But drill down into the data and you’ll discover that Pakistan is the least helpful of all countries to spinners in the fourth innings of Tests, their average runs per wicket being higher there than anywhere else. The intense drama of the final day, especially the last session where light was closing in as Leach took the last wicket (there was probably 15 minutes of play left), was everything that Stokes and Brendon McCullum, the team’s head coach, are trying to achieve with Bazball. To them, enthralling a crowd, whether live or on TV, is what sport is all about. Not that any of it would have happened had England’s batters not scored so quickly and so heavily earlier in the match. They made 921 runs across two innings at a run-rate of almost seven runs an over, which is gob-smacking. Yes the pitch was flat and yes the outfield was quick but even so, that is batting on steroids in 50-over cricket let alone Tests. Harry Brook stood out for the tourists (Picture: Getty) Amid the carnage Harry Brook, in only his second Test, stood out after making 153 in the first innings and 87 in the second, both at a strike-rate around 132. He played a few hacks in that second innings when England were looking to declare, but otherwise he dealt mostly in proper shots, cleanly struck. If he can adjust his game when the ball is nipping around, and as a Yorkshireman used to Headingley he should be able to, he could have a long and storied career. With seven wins from eight Tests Bazball is proving as successful as it is seductive. Their commitment to the cause is likely to be tested when there is a chance of England qualifying for the World Test Championship (WTC) final. Although that cannot happen this cycle, a bigger prize will hove into view. Then, some caginess, even a draw or two, may be required. So far Stokes has been unrepentant about compromising the brand but he is a pragmatist, as he has shown when guiding England to various white ball trophies. So while Bazball is here to stay, I’ll be surprised if it doesn’t get tweaked to achieve yet greater glories than this most daring win in Pakistan. MORE : ‘Emotional’ Ben Stokes pays tribute to England after famous Pakistan victory MORE : Former Australia captain Ricky Ponting opens up on ‘scary’ health scare For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2022-12-05 18:15:55","image_url":null,"source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Pakistan vs England: ‘I've got no interest in trying to play for a draw,’ Ben Stokes shares team’s motto","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-england-ive-got-no-interest-in-trying-to-play-for-a-draw-ben-stokes-shares-teams-motto-11757441.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs England: ‘I've got no interest in trying to play for a draw,’ Ben Stokes shares team’s motto","content":"Cricket Pakistan vs England: ‘I've got no interest in trying to play for a draw,’ Ben Stokes shares team’s motto Ben Stokes said that the victory in Rawalpindi is one of the greatest away wins in the history of England’s Test Cricket. FirstCricket Staff December 5th, 2022 23:31:45 IST Ben Stokes has led the side exceptionally well and has a stellar record in a short timeline of 7 wins in 8 Tests. AP England skipper Ben Stokes who is already a sort of legend for English cricket was ecstatic after his side beat Pakistan by 74 runs in the first Test in Rawalpindi moments before the end of Day 5’s play. While Stokes praised his players, he also said that the stomach bug that hit the squad before the start of the game seems a long time ago, and rightly so after the manner in which they dominated the Test for the most part of five days. “Some of the things we can’t plan for is what happened to the squad before the Test. Seems a long time ago when we were running around to find players for the Test. Will Jacks getting the message three minutes before the toss, and Pope getting the gloves,” Stokes said at the post-match presentation. Watch: England fielders surround Naseem Shah for final wicket The skipper also said that he along with Coach Brendon McCullum tries to focus on themselves and not much on the opposition. “We’ve played eight-nine matches with myself and Brendon in charge. One thing we try to do is focus on ourselves and not the opposition. We know we’re a very exciting team. Was a great batting surface, so it was an opportunity for our batting group. “Having the lads tuck in like they did today was amazing. Really special group of players.” Boss. 🇵🇰 #PAKvENG 🏴󠁧󠁢󠁥󠁮󠁧󠁿 pic.twitter.com/xhmMcGVd2l — England Cricket (@englandcricket) December 5, 2022 Talking about the manner in which the team functions, he also said that they are not interested in playing out a draw. “We wanted to come here to Pakistan and carry on with our mantra of exciting cricket. I’ve got no interest in trying to play for a draw, the dressing room has no interest in playing for a draw. “Felt on this kind of wicket, almost had to entice the batsmen to play an attacking shot. Today we were fortunate to get the ball reverse-swinging.” The all-rounder was also vocal about the manner in which the English quicks bowled. “James Anderson and Ollie Robinson were fantastic today. We won probably about eight minutes before we would’ve come off. This is probably up there as one of England’s greatest away wins,” Stokes concluded. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 05, 2022 23:31:45 IST Tags: Ben Stokes Cricket Pakistan Vs England Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-05 18:01:45","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Ben-Stokes.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ticket prices under microscope in bid to bring crowds back to cricket","link":"https://www.watoday.com.au/sport/cricket/ticket-prices-under-microscope-in-bid-to-bring-crowds-back-to-cricket-20221205-p5c3uc.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"One suggestion discussed in recent years was a radical proposal to make Test match public entry free after day one, on the basis that the extra spectators would spend more money on food and drinks, while also making the game look more attractive for broadcasters.","content":"A major cut in international match ticket prices outside school holidays to bring them closer to Big Bash levels is a lever Cricket Australia may consider pulling as a way of helping to bring crowds back after COVID-19. Numerous past and present decision-makers spoken to by The Age and The Sydney Morning Herald on Monday agreed that pricing and incentives for spectators needed to be looked at for future summers, irrespective of crowds for the remainder of the season. While the Adelaide Test’s enduring appeal as a destination event is expected to attract around 20,000 spectators to each of the first three days of the second Test against the West Indies from Thursday , Perth’s slim attendance following a trio of similarly paltry crowds for an ODI series against England has caused administrators to dust off past research on ticket sales. Marnus Labuschagne’s double century and century in the same Test was made in front of slim crowds. Credit: AP There are plenty of these in the bottom drawers of CA executives and board directors, including a study conducted personally by current chief executive Nick Hockley that led to the introduction of extra categories and a lower, $30 entry point for seats. One suggestion discussed internally the CA board table in recent years was a radical proposition of making Test match public entry free after day one, on the basis that the extra spectators attracted by the offer would then spend more money on food and drinks, while also making the game look more attractive for broadcasters. Another piece of research, conducted by the marketing firm Forethought in 2013, found that the single biggest factor in cricket attendance was cost, and that among other factors including transport, food and beverage prices, the cost of the tickets themselves was the stand-out determining factor. Australian summer Test match attendances Year Opposition Days Total Ave 2022-23 WI 5 42,723 8544 2021-22 Eng 20 488,004 24,400* 2020-21 Ind 17 228,003 13,412* 2019-20 Pak/NZ 20 520,950 26,048 2018-19 Ind/SL 26 564,886 21,726 * COVID crowd restrictions Those findings contributed to advertising campaigns for the BBL that stressed the cheap cost of a family ticket - just $42 - to the exclusion of almost everything else. That simple message was at the centre of BBL advertising for six years, before the tournament began to creak under the weight of a rapid increase to 14 games per team. Many a debate has taken place within CA about the appropriate balance between accessible ticket prices and the money to be gleaned from sales, especially against the backdrop of broadcasters wanting full stadiums for the matches they air.","pubDate":"2022-12-05 18:00:00","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"Stokes: England wants to entertain in Tests to draw fans","link":"https://sportstar.thehindu.com/cricket/ben-stokes-england-wants-to-entertain-fans-test-cricket-eng-vs-pak-rawalpindi-test/article66227975.ece","keywords":null,"creator":["\n         AP  \n    "],"video_url":null,"description":"The intent to play five-day cricket with a fearless attitude has reaped England seven wins in its last eight Tests since last summer when Brendon McCullum took over as coach and Stokes as captain.","content":null,"pubDate":"2022-12-05 17:35:03","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"India's World Test Championship final qualification chances increase after Pakistan lose to England","link":"https://www.firstpost.com/firstcricket/sports-news/indias-world-test-championship-final-qualification-chances-increase-after-pakistan-lose-to-england-11757201.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India's World Test Championship final qualification chances increase after Pakistan lose to England","content":"Cricket India's World Test Championship final qualification chances increase after Pakistan lose to England Pakistan suffered a 74-run defeat to England in the first Test in Rawalpindi. FirstCricket Staff December 5th, 2022 21:57:02 IST India are slated to play six more Test matches in the ongoing World Test Championship cycle. AFP Ben Stokes-led England romped to a 74-run win over Pakistan in the first Test in Rawalpindi on Monday, scripting the win in sensational fashion. Pakistan managed to post 579 on board in reply to England’s total of 657, and in the second innings, England declared at 264/7 with four sessions to go in the Test match. That meant Pakistan needed 343 runs to win the Test and take a series lead. But that was not meant to happen. At the end of Day 4, Pakistan were 80/2 in their run-chase. The hosts still needed 263 runs to win, with eight wickets remaining and three sessions to spare. On the final Day of the Test, Imam ul Haq and Saud Shakeel forged a 61-run stand for the fourth wicket, and that was followed by Shakeel forging an 87-run partnership with Mohammad Rizwan for the fifth, but none of those partnerships seemed to work for Pakistan with the English bowlers striking at regular intervals. The hosts were eventually bowled out for 268, with veteran James Anderson and Ollie Robinson taking four wickets each. Pakistan were in fifth place in the ICC World Test Championships (WTC) before this series, and an opening defeat meant that Babar Azam and Co remained static at fifth. Updated World Test Championships standings. Image: Screenshot from ICC website Pakistan have been considered as one of the contenders to book a spot in the WTC Final in 2023, but the defeat means their hopes have taken a hit. Pakistan are slated to play two more Tests against England, and another two against New Zealand at home, but it remains to be seen how much Pakistan could stake their claim for a WTC Final spot. While Pakistan’s loss to England in the first Test would be heartbreaking for fans and players alike, their defeat has, in fact, boosted India’s chances to qualify for the World Test Championship final. How has Pakistan’s loss boosted India’s chances? If the World Test Championships standings are to go by, it may seem as though Australia and South Africa may meet in the final at The Oval next summer. It’s fair to even note that the Aussies are slated to host the Proteas for three Tests later in December. Australia are currently playing a home Test series against West Indies, and won the first Test convincingly by 164 runs, and should they complete the clean sweep in the second Test, and win at least two out of the three Tests against South Africa, the Aussies would stand a chance to make the final. India, meanwhile, have six matches still left to play in the current WTC cycle. They play two Tests against Bangladesh away, and host Australia for four Tests early next year. India are placed fourth in the standings with a win percentage of 52.08, while Sri Lanka on third are above them with a win percentage of 53.33. In order to have any hopes of qualifying for the final, India will have to clean sweep Bangladesh in the upcoming two-Test series, and can afford to lose only one match against Australia at home next year, meaning Rohit Sharma’s men have to win three of the four Tests against Aussies to keep their chances of a final in the WTC alive. India were runners-up in the 2019-21 cycle of the World Test Championship, having lost to New Zealand by eight wickets at Southampton’s Rose Bowl last year. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 05, 2022 21:57:02 IST Tags: Pakistan Vs England Team India World Test Championship Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-05 16:27:02","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/India-file-640_AFP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"ENG vs PAK | Prediction Shattered – England beat Pakistan by 74 runs in first Test","link":"https://thenewsglory.com/eng-vs-pak-prediction-shattered-england-beat-pakistan-by-74-runs-in-first-test/","keywords":["Sports","Cricket","England","India","Pakistan"],"creator":["The News Glory"],"video_url":null,"description":"Rawalpindi: The England cricket team defeated Pakistan by 74 runs in the Test cricket match held at the cricket ground in the city of Rawalpindi, Pakistan. The team has made this victory possible on a pitch that was predicted to have no chance of winning. The Ben Stokes-led England cricket team is touring Pakistan for […]","content":"Rawalpindi: The England cricket team defeated Pakistan by 74 runs in the Test cricket match held at the cricket ground in the city of Rawalpindi, Pakistan. The team has made this victory possible on a pitch that was predicted to have no chance of winning. The Ben Stokes-led England cricket team is touring Pakistan for a three-match Test series. The first match of this series started on 1st.","pubDate":"2022-12-05 16:03:12","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan’s failure on home soil continues as England win by 74 runs, Twitter reacts","link":"https://www.firstpost.com/firstcricket/sports-news/pakistans-failure-on-home-soil-continues-as-england-win-by-74-runs-twitter-reacts-11756061.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Pakistan’s failure on home soil continues as England win by 74 runs, Twitter reacts","content":"Cricket Pakistan’s failure on home soil continues as England win by 74 runs, Twitter reacts Even after travelling to Pakistan after a gap of 17 years, England seemed well-adjusted to the conditions and recorded a famous 74-run win on a poor pitch in Rawalpindi. FP Trending December 5th, 2022 21:05:24 IST England's players walk off the field after winning the first test against Pakistan. AP England have started off their historic tour to Pakistan on a dominant note. The Three Lions took a 1-0 lead in the three-Test series, crushing the hosts by 74 runs in the opening Test today at the Pindi Cricket Stadium. The Ben Stokes-led brigade outclassed Pakistan in every department following an explosive show by their batters in the first innings. Though Pakistan managed to recover from the early setback, an exceptional performance by the English bowling unit, led by James Anderson, ultimately snatched the game away on the final day. Batting first, England took full advantage of Rawalpindi’s batting-friendly surface, producing a mammoth 657 runs in the first innings. As many as four batters- Zack Crawley (122), Ben Duckett (107), Ollie Pope (108), and Harry Brook (153) registered a century. In reply, Pakistan came out all guns blazing with skipper Babar Azam leading from the front. Apart from Azam (136), Abdullah Shafique (114) and Imam-ul-Haq (121) notched up hundred-plus scores while Agha Salman (53) slammed a crucial half-century. With a 74-run lead, England came in to bat in the third innings with a more aggressive approach. Even after losing a few early wickets, the Ben Stokes-led side put up 264 runs on the board, riding on contributions from Joe Root (73) and Brook (87), setting Pakistan a target of 343 runs. Pakistan batters could not pull off a good start to the chase as they lost three wickets at just 89 runs. However, Saud Shakeel’s 76 and Mohammad Rizwan’s 46 brought Pakistan back into the encounter till the end of the second session on Day 5, with the game heading to a draw. After the tea break, a fiery pace attack from Anderson and Ollie Robinson did not permit the remaining batters to stay long on the pitch. Both the bowlers completed their fourth-innings spells with four wickets each. England’s victory in the first game of the historic series has already earned many plaudits from all corners of the globe. Even after 17 years since their last fixture in Pakistan, the Englishmen seemed well-adjusted to the conditions and recorded a big win. A user lauded the captaincy of Ben Stokes and stated, “Ben Stokes is special. What a Comeback after the 2016 T20 WC. Gave Pakistan the equal chance to win the match today and it was the battle between the Brave and the Defence. Not a tough task to guess who was going to win.” #BenStokes is a special! What a Comeback after 2016 T20 WC. Gave Pakistan the equal chance to win the match today and it was the battle between the Brave vs Defence. Not a tough task to guess who was going to win. #PAKvENG #PAKvsENG #ENGvPAK #ENGvsPAK #Pakistan #Eng #England pic.twitter.com/2NQiFzXRT2 — Rohail Ramzan Ali | (@RohailRamzanAli) December 5, 2022 A cricket enthusiast shared an interesting fact, “Pakistani captains to lose a Test match in Pakistan against both Australia and England: Imtiaz Ahmed in 1959 & 1961, Babar Azam in 2022. Babar Azam becomes the first Pakistani captain to lose a Test in Pakistan vs both Australia and England in 61 years.” Pakistani captains to lose a Test match in Pakistan against both Australia and England Imtiaz Ahmed in 1959 & 1961 Babar Azam in 2022 Babar Azam becomes first Pakistani captain to lose a Test in Pakistan vs both Australia and England in 61 years pic.twitter.com/83WCk1VfFN — Arnav Singh (@Arnavv43) December 5, 2022 Referring to the nail-biting affair, a user said, “England vs Pakistan always produces one of the most interesting matches.” England vs Pakistan always produces one of the most interesting matches — (@MalikAyAhm99) December 5, 2022 Hailing England’s “Bazball” cricket, a person explained that McCullum and Stokes seem to have instilled not only an attacking approach in Test cricket but also a winning mentality. McCullum and Stokes seems to have instilled not just attacking approach in the Test cricket but a winning mentality ever since the coach-captain duo took over reins of the #England Test team. A fantastic win for Eng vs #Pakistan . Delivered their best on horrible pitch. #ENGvPAK — Hrishikesh Damodar (@HrishiDamodar) December 5, 2022 A disheartened Pakistani fan wrote that PCB made a dead pitch due to the fear of defeat, but English pacers blew 9 wickets and won the match. PCB made a dead pitch due to the fear of defeat English pacers blew 9 wickets and won the match, the same thing happened in series vs Australia, England made a bold declaration, they could have lost, but they did not fear. Fearlessness victory,this defeat of Pakistan is shameful pic.twitter.com/HwIArNLiWO — Muhammad Sadiq (@Khan7567) December 5, 2022 Here are some other reactions: What a great advert this England side is for test cricket, they are redefining ways of winning in this format, chased 378 vs India in the summer, defended 343 vs Pakistan on a lifeless wicket by controlling the game with their tactics, brilliant captaincy by @benstokes38 — zainab abbas (@ZAbbasOfficial) December 5, 2022 Not only have England won by scoring 74 more runs than Pakistan, but they did it in 136 overs Vs Pakistan’s 252. #BbcCricket — Tom Rendle (@TERendle) December 5, 2022 https://twitter.com/Spenses01/status/1599735922291277825 First Test vs Australia – Draw Second Test vs Australia – Draw Third Test vs Australia – Loss First Test vs England – Loss Pakistan are yet to win a Test match at their home in 2022. #PAKvENG — ︎︎™ ❤️ (@MSDianMrigu) December 5, 2022 England win by 74 runs in Rawalpindi to go 1-0 up in three-match series vs Pakistan. They won in the gloom, literally!, with bad light minutes away from ending the game. Beating Pak in Pak is something! English Cricket is on a roll. #ENGvPAK — Ved Nayak (@catcheronthesly) December 5, 2022 Pakistan will aim to turn the table around when they square off against England for the second Test beginning on 9 December at the Multan Cricket Stadium. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 05, 2022 21:05:24 IST Tags: Ben Stokes Cricket Pakistan Vs England Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-05 15:35:24","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Pakistan-vs-England.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Records tumble in first Pakistan vs England first Test","link":"https://sportstar.thehindu.com/cricket/eng-vs-pak-test-full-list-of-records-broken-england-vs-pakistan-rawalpindi/article66227299.ece","keywords":null,"creator":["\n         AFP  \n    "],"video_url":null,"description":"Here is a summary of all the records that were broken during the first Test between England and Pakistan at Rawalpindi Cricket Stadium.","content":null,"pubDate":"2022-12-05 15:34:21","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Stokes’ great captaincy… England on a new track… How did Pakistan beat Pakistan even on a ‘dead’ pitch? – An analysis","link":"https://thenewsglory.com/stokes-great-captaincy-england-on-a-new-track-how-did-pakistan-beat-pakistan-even-on-a-dead-pitch-an-analysis/","keywords":["Sports","Cricket","England","India","online special","Pakistan","Stokes"],"creator":["The News Glory"],"video_url":null,"description":"The England team has achieved a wonderful and rare victory in the Rawalpindi Test match. This victory is the result of the great success of the team on the field. This gives England a 1-0 lead in the 3-Test series against Pakistan. It must be said that Ben Stokes’ captaincy quality has risen to the […]","content":"The England team has achieved a wonderful and rare victory in the Rawalpindi Test match. This victory is the result of the great success of the team on the field. This gives England a 1-0 lead in the 3-Test series against Pakistan. It must be said that Ben Stokes’ captaincy quality has risen to the next level in this Test match. In other words, players, ex-players and media of England will lament that test cricket will die and sub-continental cricket will not be formed. But Ben Stokes has proved to at least former England players, today’s players and the media that this Rawalpindi can win on a dead pitch with his amazing captaincy. This is the new way of England!! Dead pitch means no more crying. Even more aggressive, victory! Stokes warns other teams. When Brendon McCullum took over as head coach and Ben Stokes took over the Test captaincy, England’s game took a new aggressive direction. First, New Zealand were whitewashed 3-0 by their aggressive batting. Then in the remaining 5th Test match against India, they chased down the target of 378 runs in the 4th innings in less overs and leveled the series. Then McCullum’s style of action against South Africa was met with a Test flop to cause some backlash. But in the next Test, England beat South Africa by an innings and 85 runs and then again won the 3rd Test to take the series 2-1. In all of these Tests, Brendon McCullum’s strategy was turned into England’s victory by Ben Stokes with his imaginative captaincy. In this case, England’s ‘Bazball’ action team traveled to Pakistan after many years. If there is one player from that old tour who is still playing for England in Pakistan, it is James Anderson. The Rawalpindi pitch is also known as the ‘dead’ pitch, or the property pitch. In this the ball will not be anything, both spin and fastball will be smashed. England batted first and scored 500 runs on the first day, setting a world record for scoring more than 500 runs on the first day in a Test. On the first day England’s Crawley, Ben Duckett, Ally Pope, Harry Brook etc. saw action centuries. England scored 657 runs in 100 overs and finished with an innings run rate of 6.57, an all-time high in Test cricket. Pakistan is also unrelenting. Abdullah Shafiq, Imam-ul-Haq and Captain Babar Azam of the team scored centuries on the dead pitch, but even though they could not play as aggressively as England, Pakistan responded appropriately and scored 579 runs in 155 overs to decide that this Test was a draw. England’s Wild Durbar, Ben Stokes’ Action Declare and Brilliant Captaincy: With a lead of 78 runs, how will England play on the 4th day? Either for a draw or a score on this dead pitch to set Pakistan a target. I don’t know what England’s strategy will be, whether to let the team taste victory and make them lose. But the way England played in the second innings was its latest form of action. Jack Crawley hit a 48-ball half-century while Joe Root alternated between right- and left-handers to score 73 off 69 balls. England’s new star Harry Brook followed up his first innings impressive score of 153 by scoring 87 off 65 balls with 11 fours and 3 sixes in the 2nd innings. Ben Stokes declared when the team’s score reached 264 runs. It is true that that timing is going to become the talking point of this Test victory!! A target of 343 runs means nothing on an unbroken, unbroken Rawalpindi pitch. I doubt Stokes would have declared if it was India. But in the first innings of the Pakistan team, 3 players have scored centuries. But either we have to win or Pakistan has to win, Stokes’ decision that the Test match should not end as a run machine test is a precedent for the captains of other teams in the world. When Pakistan came down against the target of 343 runs, even on this pitch, Stokes planned that the Pakistani players would be stuck in short pitch bowling and bouncers. Yes it really worked out. Abdullah Shafiq, who scored a century in the first innings, was caught short-pitched at deep square leg in the second innings. The tragedy of the 4th day was that Pakistan captain Babar Azam also fell to the bouncer for 4 runs. The former is a bouncer from Ally Robinson and the latter is a bouncer from Stokes. The captain took the captain’s wicket. From the position of 2 wickets for 25 runs, the Pakistan team ended with 2 wickets for 80 runs on the 4th day yesterday. Pakistan need 263 runs on the last day of the 5th match today. England need 8 wickets. Stokes adopted a new strategy of having more fielders close to the in-swinger leg direction as the ball seemed to reverse-swing slightly and to set the field first Imam-ul-Haq (48 runs) touched the inswinger towards Anderson’s leg-stump and wicket-keeper Ally Bob took a catch. But then Saud Shakeel (76) and Mohammad Rizwan (46) put on a scintillating partnership to take the score to 176 runs. Then Yumvan Anderson bowled a brilliant out-swinger that drew Rizwan’s bat. It was caught on the edge. South Shakeel’s next delivery from Ali Robinson was caught at cover with a slightly higher rise. Pakistan lost 5 wickets for 198 runs. After that another partnership was formed between Azhar Ali (40) and Agha Salman (30). Both of them played till the tea break with a score of 257 without any further damage to give Pakistan a chance to win. But, that all changed after the tea break. Under Stokes’ captaincy, England’s bowling and fielding strategy became more aggressive. Ally Robinson bowled a superb late swinger to get Salman out in LP fashion. Immediately after his dismissal, Joe Root was brought out at leg slip in a brilliant fielding move by Stokes. The batsman touched it lightly to reverse a ball from Ally Robinson. It was caught at leg slip. With 7 wickets for 260 runs, the match was now going towards England’s victory. But the 40-year-old James Anderson left no room for any counter-attacks as he bowled Zaqid Mahmoud and Haris Raouf in reverse swing. Jaqith Mahamood fell to a leg side drop in this. Harris Rauf became LP in reverse swing. Only Naseem Shah played persistently at one end and took 6 runs off 46 balls with good tackling. But he dropped two catches. At last, when darkness comes, they believed that if they drive a little, the darkness will save them. But when the new ball was picked up and given to spinner Jack Leach, he bowled a ball to Naseem Shah through leg and middle which ‘skid’ and was out to hit the leg. Pakistan were bowled out for 268 runs and England won by a landslide. Anderson 4 wickets, man of the match Ally Robinson 4 wickets. That means that both the teams can reach a big score of 657 and 579 in the first innings respectively and can bring a result in the Test match, which is the new hope of England captain Stokes. England usually doesn’t think like this. They became a kind of ‘elite’ and did not care much about losing in Pakistan, India and Sri Lanka. From that team came a ‘white supremacy’ view where winning and not winning were the same thing. But, Stokes has broken all that and made a great achievement as a captain and it is no exaggeration to say that he has brought about a paradigm shift in the attitude of English cricket.","pubDate":"2022-12-05 15:02:17","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"AFL great Mal Michael slams Australia’s ‘woke’ cricket team for taking a knee before Windies Test","link":"https://247newsaroundtheworld.com/sports/afl-great-mal-michael-slams-australias-woke-cricket-team-for-taking-a-knee-before-windies-test/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World AFL great Mal Michael slams Australia’s ‘woke’ cricket team for driving fans… The post AFL great Mal Michael slams Australia’s ‘woke’ cricket team for taking a knee before Windies Test appeared first on 247 News Around The World.","content":"AFL great Mal Michael slams Australia’s ‘woke’ cricket team for driving fans away by taking a knee before Windies Test: ‘Just play cricket, lads. Leave politics out of sport’ By Dan Cancian For Daily Mail Australia Published: 09:33 EST, 5 December 2022 | Updated: 09:33 EST, 5 December 2022 AFL great has told Australia’s cricket team to ‘leave politics out of sport’, suggesting their stance on social issues were behind the poor attendances for the first Test in Perth. Pat Cummins’ team kicked off its summer in winning fashion with a 164-run win over the West Indies in front a largely deserted Optus Stadium. A combined crowd of just over 42,500 passed through the turnstiles at the 60,000-capacity venue during the five days of play. A combined crowd of just over 42,000 attended the five days of Test cricket in Perth And Michael, a three-time premiership winner with the Brisbane Lions, claimed the lack of interest was down to the team’s focus on social issues. ‘Just play cricket lads. Leave politics out of sport,’ the 45-year-old tweeted, along with pictures of an Australian batter taking the knee and players from both teams sat in a circle on the ground. A third picture featuring a sparsely populated Optus Stadium was preceded by a ‘=’ sign, implying crowds had been turned away by Australian’s stance. Australia’s test team has taken a knee for the first time ever ahead of the first ball in the series opener against the West Indies last week. Former AFL player Mal Michael claimed the poor attendances were due to the Australian players’ stance on social justice The gesture made worldwide headlines when NFL quarterback Colin Kaepernick opted to kneel rather the stand during the national anthem before a pre-season game in 2016. Kaepernick said at the time that taking the knee was a silent protest against police brutality and racial injustice. His example was subsequently followed by several teams across different sports – including England and the West Indies Test cricket teams, Premier League players and the England national football team. Several West Indian players raised their fists in a ‘black power’ salute as they took the knee – with the clinched-fist salute featuring on their collars along with the words ‘Black Lives Matter’. David Warner and his teammates took the knee for the first time before a Test match West Indies players also took a knee, with some doing the Black Power salute The movement rose to prominence in the US in 2020, in the wake of social protests following the death of George Floyd in Minneapolis. Former police officer Derek Chauvin knelt on Floyd’s neck for several minutes as he arrested him, despite Floyd complaining he couldn’t breathe. Australia’s white-ball teams have taken the knee before when an opponent has done it and Cummins said the decision to join in was ‘in support of equality’. ‘We’ve consulted with the West Indies team, who confirmed they will be taking a knee,’ a Cricket Australia spokesperson told The Age earlier this week. A total of 10,929 fans attended day one, followed by crowds of 8,695 and 11,272 ‘As we’ve done in the West Indies and during the recent warm-up games we will support the West Indies team and take a knee alongside them.’ The gesture drew a mixed response from fans, while Cricket Australia have been heavily criticised for scheduling the start of the Perth Test on a Wednesday. The start date was caused by the tight scheduling window following the Twenty20 World Cup and three-match ODI series against England, the latter of which was also poorly attended. Advertisement Share or comment on this article: Post source: Daily mail","pubDate":"2022-12-05 14:37:12","image_url":null,"source_id":"247newsaroundtheworld","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"\"Besser als in Saudi-Arabien\": Jubel trotz Ausbeutung: Wie Katars Gastarbeiter die WM in ihren \"Fan-Zones\" verfolgen","link":"https://www.stern.de/sport/fussball/wm-2022/katar--gastarbeiter-duerfen-wm-verfolgen---allerdings-nicht-in-doha-32977192.html?utm_campaign=sport&utm_medium=rss-feed&utm_source=standard","keywords":["Katar","Gastarbeiter","Doha","Migranten","FIFA","Saudi-Arabien","Fußballfans"],"creator":null,"video_url":null,"description":"Die ausländischen Gastarbeiter haben die WM in Katar erst möglich gemacht. Viele mussten dafür teuer bezahlen. Wer noch vor Ort ist, darf die WM mitverfolgen – allerdings aus dem Abseits.","content":"Die ausländischen Gastarbeiter haben die WM in Katar erst möglich gemacht. Viele mussten dafür teuer bezahlen. Wer noch vor Ort ist, darf die WM mitverfolgen – allerdings aus dem Abseits.In diesem Stadion wird nicht ein einziges WM-Spiel ausgetragen und trotzdem sind die Tribünen jeden Abend voll. Wer rechtzeitig gekommen ist, hat noch einen Platz gefunden. Andere hocken unten auf dem vergilbten Rasen, den Blick gebannt auf die Großbildleinwand gerichtet. Brasilien spielt an diesem Abend, und wann immer sich die Seleção dem Tor nähert, johlt und raunt die Menge. Das brasilianische Team mit seinen Stars – das ist für viele Fußballfans hier eine große Liebe. Es sind vor allem junge Männer aus Bangladesch, Nepal und anderen ärmeren Ländern Asiens, die sich auf den Weg in dieses Stadion gemacht haben. Sonst kämpfen im \"Asian Town Cricket Stadium\" Teams einer anderen Sportart um Punkte. Doch für die WM haben die Gastgeber hier eine von mehreren Fanzonen errichtet, die sich von den anderen Event-Orten des Turniers in vielem unterscheidet.PAID Nancy Faeser in Doha KatarDie \"Fan-Zone Industrial Area\", wie sie offiziell heißt, liegt am Rand der Hauptstadt Doha, mit dem Taxi rund eine dreiviertel Stunde vom Zentrum entfernt, weit weg von allem schillernden Glitzer und polierten Glanz dieses reichen Emirats. Katarer verirren sich nur selten in diese Gegend, WM-Gäste aus dem Ausland noch seltener. Die Sammelunterkünfte für die ausländischen Arbeiter sind in wenigen Gehminuten zu erreichen. Wer in die \"Industrial Area\" fährt, betritt eine Parallelwelt der Migranten.Niemand spricht über ToteKatar und seine Gastarbeiter, das ist eines der großen Themen dieser WM. Diejenigen von ihnen, die mit langen Arbeitszeiten und bei großer Hitze auf dem Bau schuften, haben den Preis dafür gezahlt, dass der Weltverband FIFA 2010 sein wichtigstes Turnier an ein Land vergab, in dem die Stadien und die Infrastruktur dafür größtenteils erst gebaut werden mussten.Die britische Zeitung \"The Guardian\" recherchierte im vergangenen Jahr die Zahl von mehr als 6500 Gastarbeitern alleine aus Indien, Pakistan, Nepal, Bangladesch und Sri Lanka, die seit der WM-Vergabe in Katar ums Leben kamen. Die FIFA sprach von drei Toten auf den Stadion- und anderen offiziellen WM-Baustellen, der Chef des WM-Organisationskomitees zuletzt von 414 in den Jahren 2014 bis 2020. Allein dass vor dem wichtigsten Sportereignis der Welt niemand sagen kann oder will, wie viele Menschen genau dafür ihr Leben ließen, sagt viel über diese WM aus.Menschenrechtler: Fifa mitverantwortlich für Ausbeutung 16.19In Katar wird schnell klar: Den klassischen Gastarbeiter gibt es hier nicht. Dafür sind es zu viele. Gastarbeiter halten dieses Land am Laufen, weil sie fast alle Tätigkeiten im Alltag verrichten, vor allem die schlecht bezahlten: der Arbeiter auf der Baustelle, die Reinigungskraft auf der Toilette, die Kassiererin im Supermarkt, der Fahrer im Bus oder Taxi. Es gibt aber auch ausländische Polizisten, Ärzte, Restaurant-Besitzer, Falkner.Ohne Migranten wäre das Emirat trotz all seines Reichtums verloren. Rund drei Millionen Menschen leben in dem Golfstaat – nur knapp jeder Zehnte hat einen katarischen Pass. Die Menschen, die man in Katar am seltensten trifft, sind die Kataris.Trotz Ausbeutung Freude an der WMRahman, ein junger Mann aus Bangladesch, der eigentlich anders heißt, lebt seit sieben Jahren in Katar. Er trägt im Cricket-Stadion einen Brasilien-Schal und tanzt einige Schritte, als die Seleção ein Tor erzielt. Aus 6000 Kilometern Entfernung in Deutschland mag das vielleicht widersprüchlich klingen: Für die WM ausgebeutet zu werden und sich trotzdem auf die WM-Spiele zu freuen. Aber auch Rahman sagt, dass diese Fanzone, die Spiele am Großbildschirm, die Idole aus Brasilien auch eine Abwechslung in ihrem eintönigen, arbeits- und entbehrungsreichen Leben fernab der Heimat sind. Zum Feiern kommen sie sonst nur selten.Rahman verdient sein Geld als Taxifahrer, was für ihn heißt: sechs Tage die Woche am Steuer sitzen, bis zu zwölf Stunden am Tag, manchmal weniger. Er arbeite auf eigene Rechnung und mache rund 5000 katarische Riyal im Monat (etwa 1300 Euro), sagt er. Andere verdienen aber auch noch mit. Die Firma, die die Taxilizenz besitzt, lässt sich bezahlen. Und oft auch einheimische Sponsoren, ohne die kein Ausländer im Land bleiben darf.Zu den Ambivalenzen in Katar gehört: Das Land am Golf hat in den vergangenen Jahren Reformen beschlossen, die die Lage der Arbeitsmigranten – zumindest auf dem Papier – verbessert haben. Sie können jetzt etwa den Job wechseln oder das Land verlassen, ohne dass der Sponsor seine Zustimmung geben muss.Rahman erzählt, er könne in die Heimat reisen, wann und so lange er wolle. Auch Abdur, ein Kollege von ihm aus Pakistan, lebt seit elf Jahren in Katar und möchte nach dieser WM als Busfahrer nach Polen ziehen. \"Mit dem neuen Gesetz\", sagt er, \"ist das möglich. Mit dem alten ging das nicht.\"Westem wird Katar als Handelspartner nicht weiter diskreditierenDoch die Realität im täglichen Leben ist häufig immer noch eine andere. Menschenrechtler weisen unermüdlich darauf hin, dass die Gesetzänderungen zwar Schritte in die richtige Richtung seien, aber bei Weitem nicht ausreichten. \"Die Reformen haben sich beim Schutz der Arbeitnehmerrechte als völlig unzureichend erwiesen und werden nur unzureichend durchgesetzt\", bemängelt etwa Human Rights Watch.heute wichtig Montag 6.15Dieses \"Aber\" zieht sich durch alle Themen. Ja, die WM und die dadurch auf das Land gerichteten Scheinwerfer haben die Arbeitnehmerrechte in Katar gestärkt. Aber den Toten auf den Stadionbaustellen hilft das nicht mehr, und die Frage ist auch: Was passiert, wenn diese internationale Aufmerksamkeit nicht mehr da ist?\"Ich glaube nicht, dass diese Gesetze nach der WM wieder zurückgenommen werden\", sagte der Golfstaaten-Experte Nicolas Fromm von der Helmut-Schmidt-Universität in Hamburg. \"Aber ich glaube nicht, dass der Effekt dadurch so groß ist, dass es das gesamte Problem Katars im Umgang mit Arbeitsmigranten lösen wird. Denn wenn Katar auf Jahre oder Jahrzehnte ein sehr gefragter Gaslieferant bleiben wird, dann glaube ich nicht, dass im Westen starke Versuche unternommen werden, diesen Handelspartner zu diskreditieren.\"\"In Katar ist es besser als in Saudi-Arabien oder in den Emiraten\"Rahman und Hassan, seit fünf Jahren im Emirat, sprechen ganz nüchtern über Katar. Aus ihren Worten ist weder Groll noch Zuneigung herauszuhören. \"Das hier ist ein Land im Nahen Osten. Du kannst es nicht mit Europa vergleichen\", sagt Hassan. Und er fügt noch etwas hinzu, das viele Arbeitsmigranten hier sagen: \"In Katar ist es besser als in Saudi-Arabien oder in den Emiraten.\" Gerade in Saudi-Arabien, dem möglichen Gastgeber der WM 2030, \"sind die Regeln viel strikter.\" Dort gilt zum Beispiel immer noch das in Katar offiziell abgeschaffte Kafala-System, das Migranten an einen einheimischen Sponsor bindet.Rahman reist demnächst nach Hause, um zu heiraten. Er wird zurückkommen nach Katar, weil er hier weiter Geld verdienen will. Für immer bleiben aber möchte er nicht. \"Ich habe einen Traum\", sagt er. Und der heißt Europa, am liebsten Portugal: \"Die vergeben Staatsbürgerschaften.\" Eine katarische wird er nie bekommen.","pubDate":"2022-12-05 14:17:00","image_url":"https://image.stern.de/32977260/t/M7/v2/w1440/r1.7778/-/arbeiter-katar.jpg","source_id":"stern","country":["germany"],"category":["sports"],"language":"german"},{"title":"India batter Rishabh Pant ruled out from ODI squad","link":"https://www.sentinelassam.com/sports/cricket/india-batter-rishabh-pant-ruled-out-from-odi-squad-626687","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Pant has been released from the ODI squad after the meeting with BCCI medical team, he will return in the Test series","content":"DHAKA: India batter Rishabh Pant has been released from the ODI squad after the meeting with BCCI medical team, he will return in the Test series. The Board of Control for Cricket in India (BCCI) said that Rishabh Pant has been released from the squad and will join the team for the Tests. (IANS)Also Read: Late burst gives England a sniff after Babar tonAlso Watch: ","pubDate":"2022-12-05 14:03:16","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/05/418632-thequint2019-12996881fa-fbcc-48da-8cf2-f853e57d7aadap19349408658279.avif","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 LIVE: Japan lock horns with Croatia in Round of 16 match","link":"https://www.firstpost.com/sports/fifa-world-cup-2022-live-japan-lock-horns-with-croatia-in-round-of-16-match-11756711.html","keywords":["Sports"],"creator":["Rachit Kanaujia"],"video_url":null,"description":"FIFA World Cup 2022 LIVE: Japan lock horns with Croatia in Round of 16 match","content":"After beating Germany and Spain to top Group E, Japan now take on 2018 finalists Croatia on Monday at the Al Janoub Stadium, Qatar to try to reach the quarterfinals of the FIFA World Cup for the first time. Notably, Japan topped Group E with 6 points, while Croatia finished second in Group F courtesy of a win and two goalless draws.Japan, who defeated both Germany and Spain 2-1 — two former world champions — but also suffered a 1-0 loss against Costa Rica in the group stage, are appearing in the knockout stage for the fourth time and are searching for their first win as they suffered defeat in 2002, 2010 and 2018.However, given their current impressive form, not many will be surprised if Japan beat Croatia to make it to the quarterfinals.Croatia, on the other hand, aim to follow their footsteps of four years ago, when they reached the final of the 2018 World Cup before eventually losing to France.Croatia, who are 12 places higher than Japan in the FIFA world rankings, are undefeated in nine of their last 10 World Cup matches. Their last defeat in World Cup came in Russia four years ago when a Kylian Mbappé-inspired France secured a 4-2 win in the final.Talking about their head-to-head record, Japan and Croatia have faced each other thrice so far and both teams won a game each, while the remaining one ended in a draw.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-05 13:56:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/FIFA-Day12-Wrap-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs England: Visitors shine in fading light; Watch winning moments","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-england-visitors-shine-in-fading-light-watch-winning-moments-11756571.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs England: Visitors shine in fading light; Watch winning moments","content":"England defeated Pakistan in their own backyard after almost 20 years, making it a memorable overseas win for the Three Lions.The win — giving England a 1-0 lead in the three-Test series — embellished England’s newly adopted “Bazball” cricket, an aggressive style taken from the nickname of head coach Brendon McCullum.Fast bowlers Ollie Robinson and James Anderson took four wickets apiece as England pulled off an exciting 74-run win over Pakistan Monday in the first Test in Rawalpindi.Anderson took 4-36 and Robinson 4-50 on a placid Rawalpindi Stadium pitch to dismiss Pakistan for 268, with the stadium floodlights glowing as daylight faded.Pakistan’s last pair of Naseem Shah (six) and Mohammad Ali (nought) defied England for 35 minutes and 8.5 overs before spinner Jack Leach trapped Naseem leg-before, leaving England players ecstatic.Watch the winning moments here –The final wicket to fall. Well played, @englandcricket#PAKvENG | #UKSePK pic.twitter.com/Rq3zFvPJSp— Pakistan Cricket (@TheRealPCB) December 5, 2022 Skipper Ben Stokes was also active throughout the day, keeping unrelenting pressure on the Pakistan batters with close-set fields and intelligent bowling changes.The win is England’s seventh in eight Tests under the new management of McCullum and Stokes, installed in May this year.It was achieved after dangling the carrot-like target of 343 runs for Pakistan to win in a possible 130 overs. For a while, they had their chance. But England bowlers ensured to make regular inroads and choke the Pakistan batting lineup.England are on their first Test tour of Pakistan since 2005, having declined to visit in the interim years on security grounds.With inputs from AFPRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-05 13:31:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Eng-vs-Pak.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Mehidy, Mustafizur stun India with unbeaten last-wicket stand in ODI series","link":"https://www.sentinelassam.com/sports/cricket/mehidy-mustafizur-stun-india-with-unbeaten-last-wicket-stand-in-odi-series-626671","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"In a match that ebbed and flowed, Bangladesh seemed to be on their way to chasing 187 after Shakib's 5-36 and Ebadot Hossain's 4-47 bowled India for a paltry 186 in 41.2 overs.","content":"DHAKA: Shakib Al Hasan starred with a sensational fifer while Mehidy Hasan Miraz held his nerve to slam an unbeaten cameo and guide Bangladesh to a famous one-wicket victory over India in a low-scoring thriller of the ODI series opener at the Sher-e-Bangla National Cricket Stadium (SBNCS) in Mirpur on Sunday.In a match that ebbed and flowed, Bangladesh seemed to be on their way to chasing 187 after Shakib's 5-36 and Ebadot Hossain's 4-47 bowled India for a paltry 186 in 41.2 overs. But the Indian bowlers, led by Mohammed Siraj and Washington Sundar, triggered a Bangladesh collapse from 128/4 to 136/9 in a span of 26 balls. With the hosts looking down and out, the result seemed like a foregone conclusion. But Mehidy, mostly farming the strike, had other ideas -- slicing short balls from debutant Kuldeep Sen over the third man for a brace of sixes in the 41st over. He had luck on his side in the next over as wicketkeeper K.L Rahul dropped his catch at 15 off Shardul Thakur and Sundar did not go for a catch at third man on the very next ball. Mustafizur, who began the partnership with a nice punch to give Bangladesh a boundary after 105 balls, glanced Thakur through fine leg for four as the equation for the win came down to 10. Mehidy took Bangladesh to striking distance of a victory by slicing a short ball from Chahar in the 46th over past third man. A no-ball added with a single and a tight run later, Mehidy finished off the chase with a punch through cover to give Bangladesh an unforgettable come-from-behind win with four overs to spare. He was unbeaten at 38, with Mustafizur being 10 not out as India wilted under pressure in the last six overs. In the first innings, Shakib varied his pace, and lengths and used the crease well to spin a web around the Indian batters while Ebadot was superb in his short balls. For India, Rahul made a fine 73 off 70 balls but did not get any support from the rest of the batters. Brief scores: India 186 all out in 41.2 overs (K.L Rahul 73, Rohit Sharma 27; Shakib Al Hasan 5-36, Ebadot Hossain 4-47) lost to Bangladesh 187/9 in 46 overs (Litton Das 41, Mehidy Hasan Miraz 38 not out; Mohammed Siraj 3-32, Washington Sundar 2-17) by one wicket.Also Read: FIFA World Cup: Knockout rounds start with Argentina, Netherlands facing different tasksAlso Watch: ","pubDate":"2022-12-05 13:20:59","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/05/418613-mehidy-hasan-miraz-784x441.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"KL Rahul seals middle-order role, probably after forgoing his personal desires","link":"https://www.firstpost.com/firstcricket/sports-news/kl-rahul-seals-middle-order-role-probably-after-forgoing-his-personal-desires-11755991.html","keywords":["First Cricket News"],"creator":["Bansal Shah"],"video_url":null,"description":"KL Rahul seals middle-order role, probably after forgoing his personal desires","content":"Cricket KL Rahul seals middle-order role, probably after forgoing his personal desires KL Rahul averages 53.29 with 746 runs batting at number four–six in ODIs and has probably sealed the middle order position over other contenders. Bansal Shah December 5th, 2022 18:45:42 IST K L Rahul scored a hard-fought 73 against Bangladesh in tricky conditions. AP Since the start of this century, the talk of the town has been to let people do what they want to do. Parents have been constantly asked to let children decide their career path and future. However, what happens when you decide the course for yourself, but do not get the role you desire to play? KL Rahul might be in a better position to answer this question. Rahul has been vocal about his parents’ wish for him to get a job with the Reserve Bank of India. “The happiest they have been is when I got an RBI job. I had played four years for India already. But that didn’t make them happy. This was like – YES,” he had said in Breakfast with Champions . Talking about his role in the Indian team, it cannot be said with certainty what his favourite batting position is, considering the manner in which he has batted in different positions. What can be said with certainty is that the middle-order role was not his priority. “But this is a role that the team’s always asked me to be ready for in white-ball cricket, and I’ve done it before, and whenever the team wants me to play this role, I play this role,” Rahul explained at the post-match press conference after the first ODI against Bangladesh on Sunday. The role he has been asked to perform is similar to the one erstwhile Rahul – now the head coach was once asked to takeover by then-captain Sourav Ganguly. Probably, it is better to adjust to the path that you like to follow, rather than choose a different path. Maninder Singh: KL Rahul should come out of shell and bat fearlessly While he confirmed that he didn’t mind playing the role of a middle-order batter and wicketkeeper, he also said that he was timing the ball better than others. “It was just one of those days where out of everybody else, I looked like I was timing the ball better and the shots that I picked, fortunately for me, went to the boundary, or every option that I took went my way.” Those criticizing KL Rahul do not understand cricket combinatios much. KL is multi-dimensional player. The problem is BCCI not utilising him properly. If he isn’t in form at top, let him bat in middle order. Even play him as WK. Such players are always assets, never liability. — Himanshu Pareek (@Sports_Himanshu) December 2, 2022 Indeed Rahul looked like he was timing the ball well on a pitch that was slow, tricky, and allowing an uneven bounce. He ended up as the highest run-getter in the match, scoring 73 from 70 deliveries. On a day when the top order failed to put up anything significant, Rahul gave the innings stability that was required. This was not the first time he played a pivotal role batting in the middle-order. Out of 44 innings he has batted in ODIs, he has batted 18 times in the middle-order (four to six position). He averages 53.29 (746 runs) in that position, as compared to 43.57 (915 runs) in the opening slot. Two of his five centuries have also come while he batted in the middle-order. The question that arises is if he has sealed the number five position in ODIs. If so, will he also be the designated first-choice wicketkeeper? Rishabh Pant was released from the ODI squad without a proper explanation. Neither Sanju Samson nor Suryakumar Yadav were called in. KL Rahul taking the middle-order slot has quite a significant impact on the playing XI and team combinations. The opening position to start with, it indicates that the team management is willing to have Shikhar Dhawan in the mix of things at least until the World Cup. , @klrahul | #BANvIND | #TeamIndia pic.twitter.com/uDzMGIc64h — Lucknow Super Giants (@LucknowIPL) December 5, 2022 Secondly, India might have the comfort to play an additional all-rounder or a bowler, considering the furore about the fact that none of the top-order batters are able to bowl a few overs. India’s pace bowling has also seemed weaker in the absence of Jasprit Bumrah and Mohammed Shami. On the other hand, the likes of Pant, Samson, and Suryakumar might miss out on a place in the playing XI and would only travel with the squad as replacement options. While Pant, Samson, or Suryakumar might be capable of adding runs at a better strike rate, KL Rahul will give additional security in the middle order with his calm demeanor as compared to the other contenders. It will be worthwhile to see if this is just another experiment in Rohit Sharma’s laboratory or if Rahul will be persisted in the position till the 2023 World Cup. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 05, 2022 18:45:42 IST Tags: Cricket India Vs Bangladesh Kl Rahul Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-05 13:15:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/KL-Rahul-2.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Kylian Mbappe's brace helps France trounce Poland 3-1 to reach FIFA World Cup QFs","link":"https://www.sentinelassam.com/sports/football/kylian-mbappes-brace-helps-france-trounce-poland-3-1-to-reach-fifa-world-cup-qfs-626667","keywords":["Sports,Football"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Mbappe extended France's lead with a strong strike before adding a second with an incredible curling finish into the far top-right corner, his fifth of the competition.","content":"AL THUMAMA: Defending champions France stormed into the quarterfinals of the FIFA World Cup as star forwards Kylian Mbappe and Olivier Giroud scored to beat Poland 3-1 at the Al Thumama stadium in the round of 16 match on Sunday. Just before halftime, Giroud handed France the lead, becoming their men's all-time leading scorer. Mbappe then dominated the second half with a magnificent brace, beating Szczesny with two ferocious shots. In extra time, Lewandowski added a late consolation goal by converting a penalty after his initial attempt, which Lloris saved, had to be retaken. Early on, Giroud appeared destined to score first as he approached a back post cross from Ousmane Dembele into an open goal, but he was unable to make it in time. Giroud, however, would not be deterred, putting France in front after 44 minutes with a brilliant turn and strike. It was his 52nd goal for Les Bleus and gave him the opportunity to surpass Thierry Henry as the nation's all-time leading scorer for men. In the 75th minute, Mbappe extended France's lead with a strong strike before adding a second with an incredible curling finish into the far top-right corner, his fifth of the competition. With as many goals as Lionel Messi of Argentina, Mbappe became the first player to score nine World Cup goals before turning 24. Dayot Upamecano's handball gave Lewandowski a chance to score a consolation goal with a penalty, which Lloris initially saved before being retaken and scored because the keeper did not have his feet on the line. Lewandowski's penalty gave Poland a late consolation goal. Lewandowski scored after Poland's striker missed his first effort after referee Jesus Valenzuela demanded a second attempt. Giroud scored his 52nd goal for France passing Thierry Henry to become the nation's all-time leading scorer among men. In the 44th minute, Giroud received a pass from Kylian Mbappe and sent a low effort with his left foot past Wojciech Szczesny, his old teammate at Arsenal. Earlier in the competition, in France's 4-1 victory over Australia in their opening World Cup Group D encounter, the AC Milan striker equaled Henry's record of 51 goals for the country. Olivier Giroud's goal gave defending champions France a 1-0 lead going into half-time against Poland here at Al Thumama Stadium in the round of 16 match. The French team started off aggressively when Antoine Griezmann came with a cross following a corner which helped Raphael Varane take a header from very close range but it went high and wide to the right. The World Champion finally took the lead in the 44th minute when Kylian Mbappe's through ball was converted by Olivier Giroud left footed shot from the centre of the box to the bottom right corner. (ANI)Also Read: Assam Cricket Association (ACA) hands over cash awards to Vijay Hazare teamAlso Watch: ","pubDate":"2022-12-05 13:12:48","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/05/418605-16661022230197.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian cricket team’s worst defeats in 2022 – a quick list","link":"https://thenewsglory.com/indian-cricket-teams-worst-defeats-in-2022-a-quick-list/","keywords":["Sports","Cricket","India","ODI","one day","T20","T20I","test"],"creator":["The News Glory"],"video_url":null,"description":"Last Updated : 05 Dec, 2022 05:28 PM Published : 05 Dec 2022 05:28 PM Last Updated : 05 Dec 2022 05:28 PM Indian team players file Let’s look at the defeats the Indian cricket team has faced in the neighboring soil in the current year 2022 only. Indian cricket team lost the first ODI […]","content":"Last Updated : 05 Dec, 2022 05:28 PM Published : 05 Dec 2022 05:28 PM Last Updated : 05 Dec 2022 05:28 PM Indian team players file Let’s look at the defeats the Indian cricket team has faced in the neighboring soil in the current year 2022 only. Indian cricket team lost the first ODI match against Bangladesh yesterday. Bangladesh won the match by just one wicket. This poor performance of the Indian team has angered the cricket fans. Fans expressed their concern about it on social media. In this context, here are the defeats of the Indian team only on neighboring soil in the current year.. 1-2 loss in Test series held in South Africa. 0-3 loss in ODI series on South African soil. Defeated in the 5th Test in England. This match is the last match of the 5-match Test series that was left in 2021. Failed to qualify for the finals of the Asian Cup held in the United Arab Emirates. A crushing defeat against England in the semi-final of the T20 World Cup in Australia. Defeated in the first ODI against Bangladesh yesterday. Don’t miss out!","pubDate":"2022-12-05 12:58:10","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Geeta Phogat says 'government is doing a lot for sports'","link":"https://www.tribuneindia.com/news/sports/geeta-phogat-says-government-is-doing-a-lot-for-sports-458020","keywords":null,"creator":null,"video_url":null,"description":"Chandigarh, December 5 Freestyle wrestler and Gold medalist Geeta Phogat is all praise for the goverment for the efforts it is doing to promote sports. She said, \"Our government is doing a lot for sports; programmes like Khelo India have started for the youth; we didn't have these facilities in our time, but now there are many tournaments for the age group of 10 to 19 years; many tournaments are being organised so that more competitive sports can be played; this will bring about positive change in sports; the coming years will be bring a golden phase for Indian sports.\" Cricketer-actor Irfan Pathan, who was also the chief guest at the event spoke about his childhood days. Irfan said,\"My brother and I joined MES high school in Baroda after 8th class as they had a good sports programme there were also fees constraints, but our school encouraged us to play sports.\" He further added, \"Students should put as much effort in their academics as they do in their sports because if they focus on one thing, their options are constrained. If school children have a strong academic foundation, they can succeed in life, but there will be times when they will feel stressed, at which point it is the responsibility of their parents and teachers to keep the child's stress levels in check and provide guidance.\" Geeta and Irfan were at the Elpro Sports Fest, a 10-day-long event that was organised by Elpro International School. They met several sports enthusiasts of all ages at the event. The two also interacted with students and their parents. Irfan also played a round of cricket with the cricket team of the school, hit shots and left students cheering for all in the competitive spirit. Irfan Pathan at the Elpro Sports Fest, Pune. The sports festival that started from 23rd November, saw thousands of participants indulging and competing in games like Cricket, Football, Basketball, Throwball, Volleyball, Archery, Chess, Carrom, Table Tennis, Kho-Kho, Tug of war and Long Jump.","content":null,"pubDate":"2022-12-05 12:42:12","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_802393588.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Women’s IPL will bridge gap between international and domestic cricket: Harmanpreet Kaur","link":"https://sportstar.thehindu.com/cricket/womens-ipl-benefits-indian-cricket-opportunities-handling-pressure-women-game-india-harmanpreet-smriti-mandhana-jemimah-rodrigues/article66226350.ece","keywords":null,"creator":["\n         PTI  \n    "],"video_url":null,"description":"Smriti Mandhana, Jemimah Rodrigues and Harmanpreet Kaur hoped the upcoming inaugural season of the Women’s IPL will sort out many evolutionary issues facing the women’s game in the country.","content":null,"pubDate":"2022-12-05 12:32:42","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Mark Boucher: Don’t think three formats in international cricket are sustainable","link":"https://sportstar.thehindu.com/cricket/mark-boucher-dont-think-three-formats-in-international-cricket-are-sustainable-ipl-2023-mumbai-indians/article66225355.ece","keywords":null,"creator":["\n         Shayan Acharya  \n    "],"video_url":null,"description":"It’s been a month-and-a-half since Boucher moved on from the South Africa job and is currently gearing up for an Indian Premier League (IPL) head coach role with the Mumbai Indians.","content":null,"pubDate":"2022-12-05 12:20:12","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"}]}