{"newsArray":[{"title":"12 words come back to haunt Jonny Bairstow as old interview shuts down England argument","link":"https://www.foxsports.com.au/cricket/the-ashes/jonny-bairstow-footage-all-but-silences-englands-spirit-of-the-game-debate/news-story/3650c1597dd821d71866319c5b71c50a","keywords":null,"creator":null,"video_url":null,"description":"Just when you think England’s hypocrisy can’t sink any lower, more footage comes to light and leaves them with even more egg on their faces.","content":"Just when you think England’s hypocrisy can’t sink any lower, more footage comes to light and leaves them with even more egg on their faces. Australia claimed a second straight Test win in controversial fashion when England wicketkeeper Jonny Bairstow was stumped at the hands of Alex Carey. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > Bairstow went walk about a split second after ducking under a bouncer and Carey, having spotted him doing the same throughout his innings, launched the ball towards the stumps and sent the bails flying. England weren’t happy, despite the dismissal being well within the rules of the game, and quickly invoked the spirit of the game debate. Murphy ready for the \"bazball\" treatment | 01:01 Attempting to play that card and call out Australia for being “cheats” and not playing sportsmanlike cricket, England have found themselves buried under a mountain of moments that exposed them as hypocrites . First it was England coach Brendon McCullum - who was exposed after his post-game comments took aim at the Aussies despite him doing exactly the same countless times throughout his career. Now it’s Bairstow’s turn. The English keeper wasn’t happy with his dismissal and delivered a colder than the flip side of the pillow handshake during post-game proceedings. But thanks to the magical work of social media sleuths, he can sit alongside his fellow teammates in the hypocrite stands. Cripes, I’ve been found out. (Photo by Gareth Copley/Getty Images) Source: Getty Images Vision surfaced of Bairstow committing a contentious stumping in a county cricket game, using the rules to his advantage. The video shows Samit Patel leaving a delivery for Nottinghamshire and Bairstow waiting with his gloves next to the stumps, before whipping off the bails as Patel raised his foot off the ground after a delay. But it’s his gloating comments after the match that have now come back to haunt him and leave him with no leg to stand on. “I saw him lift his foot and I took the bails off, luckily it was one of those that kind of went for us there,” Bairstow said. “I saw Matt Prior do it against South Africa at Lord’s and it’s just something that’s luck of the draw. You can’t really practice, it’s just one that goes your way.” But it’s his final 12-word remark that really puts the nail in the coffin and shuts down any argument England have attempted to make since the loss. “It’s within the rules of the game and that’s how it is,” he said. Another angle that deserves to be highlighted from those remarks is the Prior stumping that occured at Lord’s. In the wake of Carey’s dismissal of Bairstow, the Lord’s crowd turned as feral as fans jostling in the Ticketek lounge hoping to nab Taylor Swift tickets. But would you believe that when an England player successfully pulled off the reportedly contentious dismissal, that same crowd was delighted. Instead of cheating chants breaking out, the English faithful and players revelled in delight as South Africa's Morne Morkel was sent on his way. The first two Tests have been remarkably tight affairs and we should be talking about just how good this series has been. Unfortunately England are intent on shining a light on anything but the results, as they look to be the first squad since Don Bradman to come back and win from 2-0 down. The third Test gets underway on Thursday with Australia able to capture the Ashes urn with a victory. Even a draw would see the Aussies retain the urn. England have their backs firmly against the wall, but if you were to believe them … they’re winning the Ashes on moral grounds.","pubDate":"2023-07-04 23:06:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"India appoint former fast bowler as Men’s Selection Committee Chairman","link":"https://www.dailymirror.lk/cricket/India-appoint-former-fast-bowler-as-Men’s-Selection-Committee-Chairman/315-262406","keywords":null,"creator":null,"video_url":null,"description":"India have named former fast bowling all-rounder Ajit Agarkar as the Chairman of the Senior Men’s Selection Committee.","content":"India have named former fast bowling all-rounder Ajit Agarkar as the Chairman of the Senior Men’s Selection Committee. Agarkar, who played 26 Tests, 191 ODIs, and four T20Is, was recently among the coaching staff for Indian Premier League franchise Delhi Capitals and has also served as the selector for Mumbai between 2017 and 2019. BCCI had re-appointed Chetan Sharma as the chairman of selectors earlier this year before he was removed from the role. With the team in a transition phase and the ICC Men's Cricket World Cup closing in, Agarkar's task will be huge. Shiv Sundar Das, Subroto Banerjee, Salil Ankola and Sridharan Sharath are the others on the men's selection committee. Agarkar will be the senior-most in the panel and takes over the chairman post that has been vacant since February. His first task would be to pick India's squad for the five T20Is against West Indies which begins next month. India have already named the squad for the Tests and ODIs on the tour of the Caribbean Islands. (ICC)","pubDate":"2023-07-04 22:58:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_ddcf18f713.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"If you thought Lord’s was bad, wait until you see Leeds united against Australia","link":"https://www.brisbanetimes.com.au/sport/cricket/if-you-thought-lord-s-was-bad-wait-until-you-see-leeds-united-against-australia-20230704-p5dloy.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Emma Kemp"],"video_url":null,"description":"A few expletives from the toffs in the Long Room will seem relatively sedate compared to the Western Terrace when the Yorkshire crowd is 10 pints deep.","content":"No sooner had Mitchell Starc hit Josh Tongue’s leg stump at Lord’s than the term “Western Terrace” had begun trending on Twitter. Stay in your crease and prepare for police, for the third Ashes Test at Headingley starts on Thursday and everybody is getting a little bit emotional. Ben Stokes, captain of an England team now 2-0 down in the series, predicts proceedings will get “ramped up”. The visitors certainly agree — requesting extra security for the match after the ugly scenes at Lord’s. The British press is running “Pariah Carey” headlines. The UK Prime Minister says the spirit of cricket has been contravened . As theatre, the whole thing constitutes a thoroughly enjoyable meltdown. That is, aside from the abuse hurled at Australia’s players in the second Test during the final day of their victory in London, which prompted the Marylebone Cricket Club to suspend three members . There will be no Long Room in Leeds, but if you think some expletives from the toffs is raucous just wait until 3pm at Headingley when the Yorkshire crowd is 10 pints deep. The Australian reported the request for extra security came after Steve Smith’s mother left early on day five at Lord’s to escape the taunts of fans, for whom her accent — rather than her connection to the star batsman — was provocation enough. The 11-year-old son of one staff member was also reduced to tears after what had begun as a family occasion at the home of cricket. The contrast in atmosphere at these two locations could not be more stark. One enforces a dress code of cravats and tailored coats; the other opens its doors to Shrek costumes and ancient Roman togas. The “spirit of cricket” – that great ethical adjudicator – will be floating somewhere over the Western Terrace, where unruly cup collectors dressed as lobsters and seagulls and Boris Johnson lurk ominously, readying to build their outlawed beer snakes as forlorn stewards give chase. Much of it is pantomime but this time the stage is set for something a little more gruesome. Maybe Shrek will kill the Romans. Boris Johnson might eat a lobster. Whatever happens, wicketkeeper Alex Carey, whose stumping of Bairstow at Lord’s triggered the chaos , will almost certainly be booed. The Headingley crowd during an Ashes clash in 2019. Credit: Getty Any on-field flashpoint – an overturned dismissal, a catch that touches the ground, heaven forbid a Mankad – could escalate the vitriol at the 18,350-capacity venue. Last June, during an England Test against New Zealand, a brawl broke out in the Western Terrace . Punches were thrown by a man wearing a replica of former England footballer Paul Gascoigne’s famous Euro 1996 No.8 shirt. The incident came four months after the England and Wales Cricket Board overturned a ban it had placed on Yorkshire cricket club from hosting international matches following allegations of institutionalised racism at the club by former player Azeem Rafiq. Police intervened in that melee, and are on standby to do so again amid reports that the dramatic scenes at Lord’s have formed part of the authorities’ plans to increase security at the venue. That includes a team of “sprinter stewards” to intercept any protesters or disgruntled spectators. An extensive plan had already been in place to prevent potential pitch-invading protesters with the environmental activist group Just Stop Oil, after two managed to get onto the pitch during the first day at Lord’s. But the prospects of a backlash against Australian players, and in particular Carey, is viewed as more likely in Bairstow’s home county – the wicketkeeper-batter was born 45 minutes’ drive down the road in Bradford and is a beloved local in those parts. Australian captain Pat Cummins looks on as fans have their say at Lord’s. Credit: Getty “The wellbeing of players, officials and spectators is paramount, and we are implementing appropriate measures to do everything within our control to keep everyone safe,” a spokesperson for the county told Press Association. “Clearly, some incidents at Lord’s have heightened the interest and exposure of the third Test. We will continue to work closely with both the England and Wales Cricket Board and West Yorkshire Police to ensure our safety measures are proportionate for this fixture.” Captain Pat Cummins, meanwhile, said he would keep watch over Carey, who was told by Stuart Broad “you’ll forever be remembered” for his Bairstow dismissal, but also intimated a siege mentality could galvanise the tourists to retain the urn by the end of the week. Loading “There’s nothing like loud crowds that bring a team together,” Cummins said before his squad departed London for Leeds. “He’s one of the guys we’ll get around. But these kinds of moments can really strengthen a side.” As British newspaper iNews printed on its back page on Tuesday: “The gloves are off.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article The Ashes Opinion Australian cricket Test cricket England Emma Kemp is a senior sports reporter. Most Viewed in Sport Loading","pubDate":"2023-07-04 22:30:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Babar Azam refuses to sport betting firm’s logo on jersey","link":"https://www.dailymirror.lk/breaking_news/Babar-Azam-refuses-to-sport-betting-firm’s-logo-on-jersey/108-262405","keywords":null,"creator":null,"video_url":null,"description":"Pakistan’s star cricketer Babar Azam has categorically refused to wear the logos of betting companies on his jersey.","content":"Pakistan’s star cricketer Babar Azam has categorically refused to wear the logos of betting companies on his jersey. The fourth edition of the LPL will take place from July 30 to August 22. The Colombo Strikers have signed Babar Azam, who will also serve as the team’s captain during the tournament. The Strikers have signed an agreement with a betting company, but the Pakistani star, who has just returned from Hajj, has refused to wear the company’s logo because betting is forbidden in Islam. According to reports, the condition was included in the agreement, and the franchise also honored Babar Azam’s decision. Mr Azam and his opening partner Mohammad Rizwan have returned to Pakistan after performing Hajj. Both will join the training camp in Karachi before the national squad leaves for Sri Lankan for two-match Test series.","pubDate":"2023-07-04 22:29:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_8b2154a1a5.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Australia legend RICKY PONTING talks to our man NASSER HUSSAIN about Bazball & Bairstow's dismissal","link":"https://www.dailymail.co.uk/sport/cricket/article-12264295/Australia-legend-RICKY-PONTING-talks-man-NASSER-HUSSAIN-Bazball-Bairstows-dismissal.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"As the Ashes heads to Headingley for the third Test of what has been a thrilling Ashes series so far, Mail Sport's NASSER HUSSAIN sits down with former Australia captain RICKY PONTING.","content":"Australian legend RICKY PONTING talks to our man NASSER HUSSAIN about Bazball and Bairstow's dismissal... and reveals why he didn't take the England job last year Ponting has sat down with Mailsport's Hussain to discuss all things the Ashes Bairstow was controversially stumped during the 2nd Test, causing outrage Ponting has also opened up on England coach Brendon McCullum By Nasser Hussain For The Daily Mail Published: 22:30 BST, 4 July 2023 | Updated: 22:56 BST, 4 July 2023 e-mail 1 View comments As the Ashes heads to Headingley for the third Test of what has been a thrilling series so far, Mail Sport's Nasser Hussain sits down with former Australia captain Ricky Ponting to discuss Bazball, Jonny Bairstow's controversial dismissal at Lord's and why he turned down the England job. Nasser Hussain : There had been a lot of talk before this Ashes about England’s style and their transformation under Ben Stokes and Brendon McCullum. But Australia are 2-0 up. Did you expect that before this series? Ricky Ponting : I knew Australia would come here well prepared for what England have been doing. We were all a bit surprised at how Australia started tactically at Edgbaston but they won so it’s hard to be critical. I was always a bit unsure whether England’s style of play would cope with the pressure put on it by Australia. Hussain : With bat or ball? Ponting : Well, everyone talks about Bazball as the batting side of things but all the batters are trying to do is give their bowlers more time to take wickets. And it’s an England attack that needs time to take wickets, we’ve seen that in these first two Tests. I was more concerned with how the England batting would cope with the skill and experience of the Australian bowling. Nasser Hussain (left) and Ricky Ponting (right) sit down to discuss the Ashes 2023 Jonny Bairstow was controversially stumped out by Australian keeper Alex Carey Australia have taken a 2-0 lead at the Ashes, winning the 2nd Test Hussain : Have you been looking at England and the way they’ve been playing in admiration or thinking, ‘Wait until you come up against this Aussie line-up’. Ponting : A bit of both, actually. Sitting back, there has been admiration — particularly about what they did in Pakistan — but in the back of my mind I have been thinking, ‘OK, let’s see how it does stand up’. Remember, it’s Australia and Ashes cricket. Players are never put under more pressure than in an Ashes Test and we’ve seen at times England getting a bit carried away with their style of play. They haven’t been able to adapt and adjust quickly enough to give themselves their best chance of winning games. Hussain : Let’s go back just over a year. I know Rob Key spoke to you about the England coaching job before he gave it to McCullum and I said in Mail Sport a Stokes-Ponting partnership would be my choice because I’m a big fan of your cricket brain. You’ve said you weren’t overly interested. Is that for family reasons or because you could never be on England’s side? Ponting : I probably wouldn’t do the England job anyway but even if it was the Australia job I would not take it. Where I am in my life right now, I’m not ready to be a full-time international coach. I’ve got my IPL commitments that I love. I’ve got Channel Seven at home which I love and I love being here with Sky. Don’t get me wrong, I love coaching and I would love to be Australia head coach but I just haven’t got that time in my life. Just having enough work to keep me close to the game is what I’m after. Hussain : Has anything surprised you about England so far? Ponting : Brendon has been this sort of coach and captain wherever he’s been. He led New Zealand this way in one-day cricket and it got them to a World Cup final. I’ve seen him coach Big Bash teams when it’s been all-out attack, every ball. So I’ve not been surprised and I’m not surprised at the players England have picked as a result. When I watched England in Australia last time I didn’t like what I saw, especially at the top of the order. They were sitting ducks against that attack. So I believe what Brendon has tried to achieve over the last 12 months has been trialling a style of play he thought was the best way to beat Australia. I don’t think it had anything to do with those other series. It was finding an exciting, bold style of play that was good enough to beat Australia in an Ashes. Ponting has praised England coach Brendon McCullum for his exciting style of play Hussain : They are two down now. If it continues to go that way and Australia win the series comfortably, does it mean Brendon has got it wrong? Or has it been worth the risk? Ponting : It’ll be interesting how it will be received if it doesn’t go well for the rest of the series. I was sitting at the breakfast table before the fourth day at Lord’s and I had ex-England greats coming up and saying to me, ‘We’re wasting our talent’. But all we’re hearing from inside the dressing room is how they’re bringing on all the talent. Already it’s started, and if this Ashes gets worse for England the noise will become significant. Hussain : You mentioned you coach in the IPL. But I know how much you love Test cricket. Where are you with Tests? Can all formats live together happily? Ponting : There’s no doubt in my mind where Test cricket sits. It’s the ultimate, the pinnacle. I work in and call a lot of T20 but I love watching Test cricket because it’s still the greatest examination of a player. I’m more worried than ever about Test cricket’s future, there’s no doubt about that. I’m sure you would say the same. There are more and more concerns for Test cricket, more franchise leagues popping up, and the US league is starting later this month. I’m sure if that goes well it will be the next one to really take off… Hussain : You were a great player and great Australian captain. What do you make of Stokes the player and captain? Ponting has praised England captain Ben Stokes (left) for changing the way England play Ponting : I often get asked who’s the best captain I played against but unless you’re in the tent you don’t know. What I have liked is Ben and Brendon changing the way England have played and are thinking about their cricket. Whether that brings them an Ashes win remains to be seen, but I wouldn’t mind having Stokes in my team, I know that. Hussain : How about that last day we just witnessed at Lord’s? Ponting : It was enthralling. Amazing. I don’t think we ever saw Lord’s the way it was on Sunday. For good and bad reasons. But, again with Ben, it was a case of cometh the hour, cometh the man. He was forced to play that way again but he is able to do it. That was another amazing Ashes Test hundred but unfortunately for him and his side it wasn’t quite enough. Hussain : These had been the friendly Ashes — at least before Sunday. Players talking and laughing with each other a lot. Are you happy with that and will it all change now? Ponting : I wasn’t happy with them being friendly when I played! When I was captain I felt I was a custodian of Australian cricket and, if you like, protecting the mystique of the Australian cricket team. Perhaps these guys are realising now that we’re all the same. You’re even talking to me now in the commentary box when you probably wouldn’t have done 10 years ago! Franchise cricket has changed a lot of the atmosphere between the teams because these guys have played in the same sides around the world. Since Pat Cummins has been the captain there’s maybe been more awareness about what everyone thinks about the way Australia play their cricket and there had to be. Wind the clock back to Cape Town (Sandpapergate) and the Australian public didn’t want anything to do with their team. I’d like to think when I played we were pretty hard but fair, too. Whether these guys will have a beer at the end of each day’s play now, I’m not so sure. Bairstow's stumping caused controversy at Lord's as the crowd turned on Australia Hussain : And what did you think of that controversial Bairstow dismissal? You said off-air when it happened that Pat Cummins might have to re-think his appeal... Ponting : I just thought it would be a test for Pat. I didn’t think he had to withdraw the appeal, that’s for sure. The more clarification we’ve had about the decision, the more we know the correct call was made. It has gone down as a stumping, not a run-out. That’s all you need to know. Jonny did the wrong thing and he’s paid for it by losing his wicket in an Ashes Test. It’s as simple as that. What I would say is Alex Carey is a keeper and his job is to take catches and make stumpings. The funny thing is, if you watch the replay, Jonny is still in his crease when Carey throws the ball so Australia must have been expecting it. Hussain : Steve Smith will play his 100th Test at Headingley. Where would you rank him among Australian greats? Ponting : If it all ended tomorrow he’d be the second-greatest batsman Australia have produced after Don Bradman. Statistically, you cannot argue with that. He’s achieving things so quickly. Even at Lord’s, he became the second-fastest in history to reach 9,000 Test runs. Quickest to 32 Test hundreds, innings-wise. It doesn’t look as though he’s slowing down. He has been a bit guarded about how long he will go on for, which is a bit strange to me. He jokes about not being able to sleep. With the amount of hundreds he scores he should be able to sleep pretty easily, I reckon. Hussain : We’re going back to Headingley. We were both on commentary at the end of that remarkable day there four years ago. Ben almost did it again at Lord’s on Sunday. I’m sure we will be re-running those moments from last time on Sky, your mate Justin Langer kicking the bin… Ponting : I think Nathan Lyon took it harder than Justin to be honest with the mistake he made at the end of that game. But we had the pleasure of calling it on TV together and I don’t think I’ve ever seen a better moment in Test cricket. To see what Ben was able to do, nine down, having to hit sixes and then to pull it off… he’s done it a few times since and he almost did it to Australia again here at Lord’s. He’s such a winner. You have to do a lot right to beat him and he’s won some Tests for England that most others wouldn’t have. Hussain : I think you said, ‘Wow-ee Nasser’ on commentary at Leeds…. Ponting : I wish I could take that back actually… Share or comment on this article: Australia legend RICKY PONTING talks to our man NASSER HUSSAIN about Bazball & Bairstow's dismissal e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 21:37:47","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/22/72851005-0-image-a-43_1688504856778.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Heartbreak AGAIN as Scotland knock out Zimbabwe from Cricket World Cup","link":"https://nehandaradio.com/2023/07/04/heartbreak-again-as-scotland-knock-out-zimbabwe-from-cricket-world-cup/","keywords":["Cricket","Featured","News","Sports","ICC World Cup Qualifier","Super Six","Zimbabwe vs Scotland"],"creator":["Nehanda Radio"],"video_url":null,"description":"Scotland beat Zimbabwe by 31 runs to end the hosts' hopes of qualifying for the World Cup and move to within one game of the finals. The post Heartbreak AGAIN as Scotland knock out Zimbabwe from Cricket World Cup appeared first on Nehanda Radio.","content":"In what was a must-win game for both sides, Scotland set a total of 234-8 after being put into bat first. Zimbabwe lost four wickets for 37 runs early into their innings. And, although Ryan Burl hit an impressive 83 to put the game in the balance, Tendai Chatara was bowled by Safyaan Sharif as the hosts fell short. Sharif became the first Scot to take 100 international wickets, but it was three early wickets from man of the match Chris Sole that proved crucial. Scotland will reach the World Cup for a fourth time should they defeat Netherlands on Thursday – and could even qualify with a narrow defeat – while Zimbabwe miss out for the second finals in a row. Doug Watson’s side had finished second in the first round of qualifying behind Sri Lanka for the Super Six series and are now in pole position to progress along with them again with only two teams progressing to the finals. Scotland started impressively, with Matthew Cross, Brandon McMullen and George Munsey all breaching 30, but a mid-order collapse looked to have handed the momentum to Zimbabwe. In the end, Mark Watt’s tail-end 21 not out off the closing balls proved crucial in setting up a half-decent but reachable target for the hosts. Sole’s early wickets put Zimbabwe under increased pressure, only for home fans to sense the tide had turned as Sikandar Raza, who hit 34, and Burl piled on the runs. However, after the latter’s dismissal, it seemed only a matter of time before Scotland claimed a famous victory. Scotland captain Richie Berrington told Sky Sports: “Incredibly proud of the lads – to show the fight that we did. We knew early wickets would be key – our bowlers have been fantastic throughout this tournament. “Chris Sole has bowled a couple of fantastic spells in this tournament – it was great to see again today. “We knew there were going to be tough games and I think we can take confidence from these last two wins, but we need to be stronger again against the Netherlands. “Thursday will be another great occasion and another great event. The support from back home has been fantastic and there’s a real good unity in this group.” Zimbabwe captain Craig Ervine told Sky Sports: “We did well to restrict them to 230. Unfortunately, that opening spell from Chris Sole put us on the back foot and it was extremely tough to come back from that position. “At the end of the day, we fell short. Everybody’s really gutted. It would have been nice to put those demons from 2018 to bed, but unfortunately we didn’t. It’s a moment we’ll live with for a long time. “I’m proud of the way we played our cricket and there’s a lot of positives we can take from this tournament.”","pubDate":"2023-07-04 21:11:06","image_url":null,"source_id":"nehandaradio","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Back on the Kabaddi mat, Pawan Sehrawat determined to ‘bring home the gold India lost’","link":"https://www.thehindu.com/sport/other-sports/pawan-sehrawat-pkl-pro-kabaddi-knee-injury-rehab-asian-games-india/article67043090.ece","keywords":null,"creator":null,"video_url":null,"description":"The most expensive player in PKL history, bought by Tamil Thalaivas for ₹2.26 crore, was thrown out of action after sustaining an ACL injury during the opener of Pro Kabaddi League season 9","content":"If you go back and watch India’s matches from the recent Asian Kabaddi Championships, you’ll notice Pawan Sehrawat everywhere. He was raiding, lining up in a chain defence, attempting super tackles, giving raiders instructions before they crossed into opponent territory and more. It is hard to imagine how someone so involved in a 40-minute kabaddi encounter spent an entire season off the mat after sustaining an injury inside the first 10 minutes of the opening fixture of Pro Kabaddi League season 9. Pawan missed out on galvanising a new team (Tamil Thalaivas), and a slew of records. All that FOMO (fear of missing out) was channelled in his performances in Busan, South Korea. Pawan was crucial to India winning the gold medal, registering two Super 10s in the tournament while acting as a pivot in attack and defence. However, a few months back, he underwent a right knee operation after sustaining an ACL injury during the PKL season opener against Gujarat Giants. “I am an athlete, so I had to balance both the itches — of wanting to recover carefully and properly and battling the urge to get onto the mat,” Pawan tells The Hindu. “My injury had changed the course of results a bit. I felt I had to find a way to play. I wanted to put on a band-aid and go and play. But it was not to be.” Pawan was inspired by javelin Olympic champion Neeraj Chopra’s recovery from a potentially career-ending elbow injury and decided to approach the people who had helped the fellow Haryana athlete. “I mailed JSW from my end. The team here sorted my own personal support staff — with a physio, a trainer and a nutritionist whose backup continued even after I came home. They have a huge hand in my return to the mat,” Pawan explains. The 26-year-old is snapping at the heels of superstar raiders like Pardeep Narwal, Maninder Singh, Deepak Niwas Hooda and Rahul Chaudhari in how he hoards points game after game. Pawan is currently fifth in the all-time raiding points standings with 987 to his credit in 105 PKL games. “At the Inspire Institute of Sports in Bellary, I was assigned to Dinesh and Manish — my trainer and physio. The priorities for my time there were two-fold — one to get me back to my old fitness levels and, the other, to take that fitness a notch higher,” Pawan says. When The Hindu caught up with Pawan before PKL 7 in Chennai, he told us just how much he hated working out in the gym. “Mujhe gym pasand nahin hai — the idea of exercising on the treadmill or working with the dumbbell in a small area. I like the outdoors better. If I get a park or an open space, I will spend my time running there instead.” Today, Pawan is easily in the best shape of his life because of a curated rehab and exercise regimen which includes barbell squats and deadlifts in the gym and sprints on the track. “I have never done weight training as part of my routine before,” Pawan explains. “When I asked them about the benefits, they would say, “Pawan bhai, aapko iska benefit mat pe dikhega (you’ll see the benefits on the mat, brother).” “We worked on my core and found that parts like my shoulders were weak. So, we picked them out and worked on them specifically. I understood how important strengthening my core was to my jump,” Pawan, who is called the hi-flyer for his evasive frog jumps, says. “I jump quite well anyway but imagine, I manage that with a weak core. Working on my core made these jumps easier. Manish worked on my speed — to match the speed of my feet and footwork with my mind.” Pawan has made a few friends during his time at IIS — with triple jumper Praveen Chithravel and boxer Sachin Siwach. The banter extends to their workouts, with Praveen often calling Pawan for a round of jumps. “I have not tried the triple jump yet (laughs),” Pawan says sheepishly. “Our bonding has been fantastic — among Praveen, Sachin and me. Praveen looks lightweight but he lifts a lot more than I do. He is a great guy, very punctual about his routine. So, there is a plan to do this (a triple jump challenge) when the Bengaluru camp begins. Either he comes over or I will head to Bellary, and we will collaborate on something fun,” he adds. One consistent pain point for Pawan before a PKL season or tournament was making weight. “The limit is 85kg and I was always around the 86 to 88kg mark. I used to run and starve to reduce weight, but I now have a nutritionist to help me sort that part out. I was in touch with her until just before the Asian Championships,” Pawan explains. “The boys around me would wonder who I was constantly messaging and sending photos of every meal to, but it helped. She would ask me for a plan and ensure I stuck to it. This tournament was the first time I made weight without starving myself and losing energy,” he adds. The camp in Patna before heading to South Korea helped Pawan to shake off the cobwebs. “The challenge for me was the return to training and workouts as a team. I was working out and doing physical work before but when you are doing that individually, you can take rests according to your pace, but not when you’re in a team set up. This was a fresh experience after the six to seven-month gap due to injury and the subsequent rehab. That was a win I savoured for a while,” Pawan explains. India put on an aggressive show in Busan, taking massive leads against weaker opponents and even keeping the likes of Iran at bay with leads of over five to 10 points. Back in his Bengaluru Bulls days, erstwhile captain Rohit Kumar, in addition to rallying his forces on the mat, also had the responsibility of keeping Pawan calm in pressure situations. In a ‘how life comes full circle’ situation, Pawan took on that role for the juniors in the team during the Asian Championships. In India’s matches against Iran, he was constantly speaking to Aslam Inamdar, who tends to get a little antsy in do-or-die raids. This element of patience aside, Pawan also showed his aggressive side in Busan, taking on the Iranians when they misjudged their lines or asked for points that he felt weren’t there, enough to draw comparisons with former India cricket team captain Virat Kohli. “I don’t mean to draw that comparison). If something is wrong and I see it happening on the field, I will speak up. If someone is coming for my team, I will react. Saamne wale ko chodunga nahin (I won’t let the person before me get away). Pawan does love his cricket heroes though, and emphasises his adoration for Kohli’s friend and former teammate A.B. De Villiers. “Mr. 360,” is the first thing he says when ABD’s name comes up. “He is able to hit shots all around the park. I want that in my kabaddi. There shouldn’t be an element of the game I can’t do,” he says. Another emotion that binds this Indian squad together is disappointment. The wounds from the defeat at the 2018 Asian Games semifinals to Iran are still raw. While Pawan insists that India is not focusing on any one team, every statement of intent from the raider is about ‘bringing the gold medal back.’ “I was in the Bengaluru Bulls camp in 2018 when India lost that final. Watching those men break down and cry was a horrible memory that is etched in my mind to this day. I don’t know if they’ve ever sobbed like that again, but that shouldn’t have happened,” he remembers. “It is not only about Iran. We won’t take it easy with any team. We need to make a statement that we are better prepared than before and we’re out to regain that medal we lost in 2018. The 12, whoever it may be, will give our 200 percent at the Asian Games,” he says. “The message from my circle is simple — go play your game calmly and bring back the gold medal we lost,” Pawan says.","pubDate":"2023-07-04 19:17:26","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Assam’s Uma Chetry’s journey from humble beginnings to India colours","link":"https://www.thehindu.com/sport/cricket/assam-cricketer-uma-chetry-in-indias-tour-of-bangladesh/article67043079.ece","keywords":null,"creator":null,"video_url":null,"description":"Uma made it to the India senior women’s squad for its tour of Bangladesh","content":"Uma Chetry was barely a couple of years old when she started playing cricket at her residence in Bokakhat in Assam’s Golaghat district. While her elder siblings would play the sport on the kutcha roads of the village, she would emulate them indoors. Using a stick as a makeshift bat, Uma would send big round potatoes whizzing past unsuspecting family members as she hit fours and sixes at will. When she turned three, her mother Dipa bought her a plastic bat and a ball, and Uma made it a point to practice everyday. “We soon realised that she is fond of cricket. She would play with the local boys of her age and often discuss a thing or two with her elder brothers,” Dipa tells Sportstar. Back then, Dipa of course did not imagine that someday Uma would pursue the sport seriously and make it to India’s national squad. On Sunday evening, as Uma made it to the India senior women’s squad for its tour of Bangladesh, hard work and determination paid off for the Chetrys. “It’s an incredible feeling to see your daughter making the State proud. Things were not easy for her, but with sheer determination, she continued chasing her dreams,” Dipa says. Dipa played a significant role in her daughter’s journey too. With Uma’s father Lok Bahadur being a small-time farmer, there would be times when the family - Uma and her four brothers - would struggle to make ends meet. But that wasn’t a deterrent for the youngster. Even though not many in the village took her decision of playing with boys in the right spirit, Dipa encouraged her daughter to follow her passion. I did not want her to stop playing just because she was a girl,” Dipa says. Soon, Uma started training under local coaches - Raja Rahman and Mehboob Alam - and would travel far to train regularly. “I also told her that she should not take her studies for granted,” the mother adds. So, in the mornings, Uma would train for a while and then travel to Bokakhat Hindi High School, and again play once the school was over. Around 2011, she caught the eye of Ajoy Sarma, the treasurer of Golaghat District Sports Association. “We saw her play with boys, who were slightly older than her. But she looked quite determined and was very competitive on the field. We were quite impressed with her, and eventually, we provided her with all the support,” Sarma says. Sarma pushed her case and soon, Uma was on Assam Cricket Association’s radar. By 2017, she was part of the Assam state team. and went on to make every opportunity count. In the last domestic season, she scored 194 runs in six one-dayers, at an average of 32.33, whereas in five T20 innings, she scored 120 at a strike rate of 88.88. Her determined show earned Uma a spot in the India team for the Emerging Asia Cup in Hong Kong as well. Uma’s journey has just begun and she hopes to make every opportunity count. Onwards and upwards!","pubDate":"2023-07-04 19:02:25","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"The spirit of the game has to be taken in the right spirit","link":"https://www.thehindu.com/sport/the-spirit-of-the-game-has-to-be-taken-in-the-right-spirit/article67041358.ece","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Jonny Bairstow went for a walk with the ball still in play, and was stumped. The laws of the game say he was out. The spirit of the game suggested (not demanded, for you cannot impose the spirit on anybody) that he ought to have been recalled by Australian captain Pat Cummins. But the spirit has to be a two-way street – we shall come to that in a moment. First, let’s enjoy some of the reactions. British Prime Minister Rishi Sunak, whose rise to the top job had something to do with him stumping his predecessor, thought Australia had contravened the spirit of cricket. Australian Prime Minister Anthony Albanese said he was proud of the winning Australian men’s and women’s teams and that his country was right behind Pat Cummins and Alyssa Healy (the captain of the women’s team). It was unclear whether he (as opposed to his country) thought it was right or wrong to stump Bairstow. Former cricketers have been more forthright. Brendon McCullum, England’s coach says he will not be having a beer with the opposition any time soon. My heart bleeds for the opposition. Australia should issue a public apology, says Geoff Boycott. They doubtless will, as soon as Britain apologises to Australia for the genocide and dispossession of their indigenous peoples that came with British invasion and occupation. Were there vestiges of colonial arrogance in what England did? Are they telling Australia that fair play is what they decide it is? Is Bazball the only way to play the game? England controlled the cricketing narrative for decades till other nations – former colonies – caught up and then overtook them. And now with Bazball are they attempting to control the narrative again? If all that sounds faintly ridiculous, that’s because it probably is. A dozy batsman was stumped at a crucial point in a Test and it becomes a battle between the stiff upper lip and the suntanned limb. In identical circumstances, England would have done the identical thing. Had the ball missed the stumps, wouldn’t Bairstow have attempted a single? Sadly, the ‘spirit’ usually comes accompanied by hypocrisy, which is why there is a cry for removing the grey areas in the laws. Cricket is unique in that it gives individuals and teams a chance to make moral choices that are in areas beyond the laws. Making the laws water tight is not a solution, for the ambiguity between what is legal and what is sportsmanlike is what reveals character. And cricket is about revealing character; players must be given an opportunity to choose. Despite the change in emphasis in the law on running out a non-striker backing up, some bowlers will still not do it. Bairstow wasn’t attempting a single, but he is an experienced international batsman who ought to have known better. Would he have gone for a walk had a spinner been bowling and Alex Carey had been standing up to the wicket? It is surprising how international players are ignorant (or affect to be) of the laws of the game. Australia were upset when the catch Mitchell Starc took was disallowed because he dragged the ball on the ground. Either they don’t know the law or feel it has to be ‘My country right or wrong’, a dangerous attitude on a sports field. Which brings us to the spirit being a two-way street. It might have been good PR for Cummins to recall Bairstow, and let us assume he did, in the interests of the ‘spirit’ (a good thing to have in the game, but now being increasingly ridiculed). What ought to be Bairstow’s response then? For the spirit to work as it should, Bairstow would then have to throw his wicket away next ball. He was out legally, then given a reprieve by the ‘spirit’, and now he ought to return ‘spirit’ with ‘spirit’. You can argue this will be against the interests of his team, but then so was setting out for a walk with the ball still in play. Did no one in the team — captain, players, coaching staff — notice that Bairstow had done it before and ought to be told? Another problem with the spirit is that it often takes focus away from the performances — in this case Australia’s all-round superiority, and Ben Stokes’s stunning century. Controversy never hurt the gates, though.","pubDate":"2023-07-04 19:00:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"A wicketkeeper’s take on stump-gate and the spirit of cricket","link":"https://www.brisbanetimes.com.au/sport/cricket/a-wicketkeeper-s-take-on-stump-gate-and-the-spirit-of-cricket-20230704-p5dlny.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Darren Berry"],"video_url":null,"description":"I’ve been asked several times in the past few days if I ever did such a thing. I have, and I would do it again, writes Darren Berry.","content":"Plenty has been said and written in the past 48 hours after tensions boiled over between Australia and England at Lord’s on Sunday evening. In short, Australian wicketkeeper Alex Carey completed a clever piece of work to stump English counterpart Jonny Bairstow off the bowling of Cameron Green. Was it within the rules and laws of the game? A hundred per cent it was. Sadly, the incident of brilliance by Carey sparked a firestorm that will be forever remembered in Ashes folklore, just as Stuart Broad will always be remembered for refusing to walk when he edged to first slip off Ashton Agar at Trent Bridge a decade ago. Although it appears Broad himself may have forgotten that incident, given how he behaved in the aftermath of Bairstow’s dismissal, which he described as “literally the worst thing I’ve ever seen in cricket, that”. I’d suggest move on, big boy, unless you really want to talk about the grey area that is the spirit of cricket. Not walking off after smashing the ball to slip was deplorable. Carey’s act of astute game awareness was not only within the laws but also within the spirit of the game. It appears the new governor of the spirit of cricket (whatever that is) English coach Brendon McCullum, who is a fine man, also took umbrage at the incident and was reported to have said he wouldn’t be having a beer any time soon with the Australians. Brendon, it appears you, too, have a short memory. You say you have grown up since those dark days when you did exactly the same thing to stump England batter Paul Collingwood , who is now your assistant coach. I hesitate to mention the run out of Muttiah Muralitharan when he was simply going to congratulate Kumar Sangakkara on a fine century. I’ve been asked several times in the past few days if I ever did such a thing. I have, and I would do it again. As long as it’s within the laws of the game it’s fair game. Carey did not pause and wait for Bairstow to leave his crease. He simply anticipated and executed a beautiful throw from a distance with his gloves on, a delicate skill in itself. He had been watching the dozy Bairstow and was ready to swoop just as any sharp-minded ’keeper should. The ball is alive until the umpire calls the end of the over or the ball has been registered as dead ball. The ball was live, but Bairstow wasn’t. How ironic that Bairstow tried the same thing on day three in an attempt to stump Marnus Labuschagne when he stood back to Jimmy Anderson. If he had executed that skill, rather than missed the stumps, would the righteous Ben Stokes have upheld the appeal? He said post-match he wouldn’t but who knows if we ever will find out the true answer to that question. What actually is the spirit of the game? Maybe we should ask those fine gentleman, the members of the Marylebone Cricket Club at Lord’s. I’m sure they are aware of how to uphold the spirit of the game and behave accordingly in all situations. I’ve been privileged and honoured to be at Lord’s on several occasions both as a player and coach and the walk through the Long Room is a beautiful tradition of the game. It’s unique and I would hate for that to ever change. Again, the minority spoil it for the majority. ‘I’d suggest move on, big boy, unless you really want to talk about the grey area that is the spirit of cricket. Not walking off after smashing the ball to slip was deplorable.’ Darren Berry Carey has been outstanding at his wicketkeeping craft in this series standing back to the fast men and even more impressive over the stumps. His leg-side stumping of Zak Crawley at Lord’s was a thing of beauty that brought a smile to the ’keeping brethren. Bairstow has been a liability to the English team and the sooner they reinstate the best keeper in England, Ben Foakes, the better off they will be. No doubt Bairstow is a fine batsman, a game changer. His position in the team is not in question but his role in it certainly is. His footwork to the fast bowlers has been non-existent, his diving as result disjointed and awkward. His work up to the stumps has many club cricketers scratching their heads in bewilderment. Loading It’s been hard to watch, to be brutally honest. This Ashes series so far has been enthralling. It came to life perhaps for the wrong reasons at Lord’s, but it has lit a wildfire for the next encounter at Headingley, where Stokes ripped our hearts out a few years ago. He almost did it again at Lord’s on Sunday. He is an inspirational leader and an amazing cricketer. Darren Berry is a former Victorian captain and wicketkeeper who played 153 first class matches and was reserve wicketkeeper for the 1997 Ashes tour. Save Log in , register or subscribe to save articles for later. License this article The Ashes Australian cricket England Test cricket Opinion Darren Berry is a columnist. Most Viewed in Sport Loading","pubDate":"2023-07-04 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"12 words come back to haunt Jonny Bairstow as old interview shuts down England argument","link":"https://www.foxsports.com.au/cricket/the-ashes/jonny-bairstow-footage-all-but-silences-englands-spirit-of-the-game-debate/news-story/3650c1597dd821d71866319c5b71c50a","keywords":null,"creator":null,"video_url":null,"description":"Just when you think England’s hypocrisy can’t sink any lower, more footage comes to light and leaves them with even more egg on their faces.","content":"Just when you think England’s hypocrisy can’t sink any lower, more footage comes to light and leaves them with even more egg on their faces. Australia claimed a second straight Test win in controversial fashion when England wicketkeeper Jonny Bairstow was stumped at the hands of Alex Carey. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > Bairstow went walk about a split second after ducking under a bouncer and Carey, having spotted him doing the same throughout his innings, launched the ball towards the stumps and sent the bails flying. England weren’t happy, despite the dismissal being well within the rules of the game, and quickly invoked the spirit of the game debate. Murphy ready for the \"bazball\" treatment | 01:01 Attempting to play that card and call out Australia for being “cheats” and not playing sportsmanlike cricket, England have found themselves buried under a mountain of moments that exposed them as hypocrites . First it was England coach Brendon McCullum - who was exposed after his post-game comments took aim at the Aussies despite him doing exactly the same countless times throughout his career. Now it’s Bairstow’s turn. The English keeper wasn’t happy with his dismissal and delivered a colder than the flip side of the pillow handshake during post-game proceedings. But thanks to the magical work of social media sleuths, he can sit alongside his fellow teammates in the hypocrite stands. Cripes, I’ve been found out. (Photo by Gareth Copley/Getty Images) Source: Getty Images Vision surfaced of Bairstow committing a contentious stumping in a county cricket game, using the rules to his advantage. The video shows Samit Patel leaving a delivery for Nottinghamshire and Bairstow waiting with his gloves next to the stumps, before whipping off the bails as Patel raised his foot off the ground after a delay. But it’s his gloating comments after the match that have now come back to haunt him and leave him with no leg to stand on. “I saw him lift his foot and I took the bails off, luckily it was one of those that kind of went for us there,” Bairstow said. “I saw Matt Prior do it against South Africa at Lord’s and it’s just something that’s luck of the draw. You can’t really practice, it’s just one that goes your way.” But it’s his final 12-word remark that really puts the nail in the coffin and shuts down any argument England have attempted to make since the loss. “It’s within the rules of the game and that’s how it is,” he said. Another angle that deserves to be highlighted from those remarks is the Prior stumping that occured at Lord’s. In the wake of Carey’s dismissal of Bairstow, the Lord’s crowd turned as feral as fans jostling in the Ticketek lounge hoping to nab Taylor Swift tickets. But would you believe that when an England player successfully pulled off the reportedly contentious dismissal, that same crowd was delighted. Instead of cheating chants breaking out, the English faithful and players revelled in delight as South Africa's Morne Morkel was sent on his way. The first two Tests have been remarkably tight affairs and we should be talking about just how good this series has been. Unfortunately England are intent on shining a light on anything but the results, as they look to be the first squad since Don Bradman to come back and win from 2-0 down. The third Test gets underway on Thursday with Australia able to capture the Ashes urn with a victory. Even a draw would see the Aussies retain the urn. England have their backs firmly against the wall, but if you were to believe them … they’re winning the Ashes on moral grounds.","pubDate":"2023-07-04 23:06:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"India appoint former fast bowler as Men’s Selection Committee Chairman","link":"https://www.dailymirror.lk/cricket/India-appoint-former-fast-bowler-as-Men’s-Selection-Committee-Chairman/315-262406","keywords":null,"creator":null,"video_url":null,"description":"India have named former fast bowling all-rounder Ajit Agarkar as the Chairman of the Senior Men’s Selection Committee.","content":"India have named former fast bowling all-rounder Ajit Agarkar as the Chairman of the Senior Men’s Selection Committee. Agarkar, who played 26 Tests, 191 ODIs, and four T20Is, was recently among the coaching staff for Indian Premier League franchise Delhi Capitals and has also served as the selector for Mumbai between 2017 and 2019. BCCI had re-appointed Chetan Sharma as the chairman of selectors earlier this year before he was removed from the role. With the team in a transition phase and the ICC Men's Cricket World Cup closing in, Agarkar's task will be huge. Shiv Sundar Das, Subroto Banerjee, Salil Ankola and Sridharan Sharath are the others on the men's selection committee. Agarkar will be the senior-most in the panel and takes over the chairman post that has been vacant since February. His first task would be to pick India's squad for the five T20Is against West Indies which begins next month. India have already named the squad for the Tests and ODIs on the tour of the Caribbean Islands. (ICC)","pubDate":"2023-07-04 22:58:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_ddcf18f713.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"If you thought Lord’s was bad, wait until you see Leeds united against Australia","link":"https://www.brisbanetimes.com.au/sport/cricket/if-you-thought-lord-s-was-bad-wait-until-you-see-leeds-united-against-australia-20230704-p5dloy.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Emma Kemp"],"video_url":null,"description":"A few expletives from the toffs in the Long Room will seem relatively sedate compared to the Western Terrace when the Yorkshire crowd is 10 pints deep.","content":"No sooner had Mitchell Starc hit Josh Tongue’s leg stump at Lord’s than the term “Western Terrace” had begun trending on Twitter. Stay in your crease and prepare for police, for the third Ashes Test at Headingley starts on Thursday and everybody is getting a little bit emotional. Ben Stokes, captain of an England team now 2-0 down in the series, predicts proceedings will get “ramped up”. The visitors certainly agree — requesting extra security for the match after the ugly scenes at Lord’s. The British press is running “Pariah Carey” headlines. The UK Prime Minister says the spirit of cricket has been contravened . As theatre, the whole thing constitutes a thoroughly enjoyable meltdown. That is, aside from the abuse hurled at Australia’s players in the second Test during the final day of their victory in London, which prompted the Marylebone Cricket Club to suspend three members . There will be no Long Room in Leeds, but if you think some expletives from the toffs is raucous just wait until 3pm at Headingley when the Yorkshire crowd is 10 pints deep. The Australian reported the request for extra security came after Steve Smith’s mother left early on day five at Lord’s to escape the taunts of fans, for whom her accent — rather than her connection to the star batsman — was provocation enough. The 11-year-old son of one staff member was also reduced to tears after what had begun as a family occasion at the home of cricket. The contrast in atmosphere at these two locations could not be more stark. One enforces a dress code of cravats and tailored coats; the other opens its doors to Shrek costumes and ancient Roman togas. The “spirit of cricket” – that great ethical adjudicator – will be floating somewhere over the Western Terrace, where unruly cup collectors dressed as lobsters and seagulls and Boris Johnson lurk ominously, readying to build their outlawed beer snakes as forlorn stewards give chase. Much of it is pantomime but this time the stage is set for something a little more gruesome. Maybe Shrek will kill the Romans. Boris Johnson might eat a lobster. Whatever happens, wicketkeeper Alex Carey, whose stumping of Bairstow at Lord’s triggered the chaos , will almost certainly be booed. The Headingley crowd during an Ashes clash in 2019. Credit: Getty Any on-field flashpoint – an overturned dismissal, a catch that touches the ground, heaven forbid a Mankad – could escalate the vitriol at the 18,350-capacity venue. Last June, during an England Test against New Zealand, a brawl broke out in the Western Terrace . Punches were thrown by a man wearing a replica of former England footballer Paul Gascoigne’s famous Euro 1996 No.8 shirt. The incident came four months after the England and Wales Cricket Board overturned a ban it had placed on Yorkshire cricket club from hosting international matches following allegations of institutionalised racism at the club by former player Azeem Rafiq. Police intervened in that melee, and are on standby to do so again amid reports that the dramatic scenes at Lord’s have formed part of the authorities’ plans to increase security at the venue. That includes a team of “sprinter stewards” to intercept any protesters or disgruntled spectators. An extensive plan had already been in place to prevent potential pitch-invading protesters with the environmental activist group Just Stop Oil, after two managed to get onto the pitch during the first day at Lord’s. But the prospects of a backlash against Australian players, and in particular Carey, is viewed as more likely in Bairstow’s home county – the wicketkeeper-batter was born 45 minutes’ drive down the road in Bradford and is a beloved local in those parts. Australian captain Pat Cummins looks on as fans have their say at Lord’s. Credit: Getty “The wellbeing of players, officials and spectators is paramount, and we are implementing appropriate measures to do everything within our control to keep everyone safe,” a spokesperson for the county told Press Association. “Clearly, some incidents at Lord’s have heightened the interest and exposure of the third Test. We will continue to work closely with both the England and Wales Cricket Board and West Yorkshire Police to ensure our safety measures are proportionate for this fixture.” Captain Pat Cummins, meanwhile, said he would keep watch over Carey, who was told by Stuart Broad “you’ll forever be remembered” for his Bairstow dismissal, but also intimated a siege mentality could galvanise the tourists to retain the urn by the end of the week. Loading “There’s nothing like loud crowds that bring a team together,” Cummins said before his squad departed London for Leeds. “He’s one of the guys we’ll get around. But these kinds of moments can really strengthen a side.” As British newspaper iNews printed on its back page on Tuesday: “The gloves are off.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article The Ashes Opinion Australian cricket Test cricket England Emma Kemp is a senior sports reporter. Most Viewed in Sport Loading","pubDate":"2023-07-04 22:30:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Babar Azam refuses to sport betting firm’s logo on jersey","link":"https://www.dailymirror.lk/breaking_news/Babar-Azam-refuses-to-sport-betting-firm’s-logo-on-jersey/108-262405","keywords":null,"creator":null,"video_url":null,"description":"Pakistan’s star cricketer Babar Azam has categorically refused to wear the logos of betting companies on his jersey.","content":"Pakistan’s star cricketer Babar Azam has categorically refused to wear the logos of betting companies on his jersey. The fourth edition of the LPL will take place from July 30 to August 22. The Colombo Strikers have signed Babar Azam, who will also serve as the team’s captain during the tournament. The Strikers have signed an agreement with a betting company, but the Pakistani star, who has just returned from Hajj, has refused to wear the company’s logo because betting is forbidden in Islam. According to reports, the condition was included in the agreement, and the franchise also honored Babar Azam’s decision. Mr Azam and his opening partner Mohammad Rizwan have returned to Pakistan after performing Hajj. Both will join the training camp in Karachi before the national squad leaves for Sri Lankan for two-match Test series.","pubDate":"2023-07-04 22:29:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_8b2154a1a5.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Australia legend RICKY PONTING talks to our man NASSER HUSSAIN about Bazball & Bairstow's dismissal","link":"https://www.dailymail.co.uk/sport/cricket/article-12264295/Australia-legend-RICKY-PONTING-talks-man-NASSER-HUSSAIN-Bazball-Bairstows-dismissal.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"As the Ashes heads to Headingley for the third Test of what has been a thrilling Ashes series so far, Mail Sport's NASSER HUSSAIN sits down with former Australia captain RICKY PONTING.","content":"Australian legend RICKY PONTING talks to our man NASSER HUSSAIN about Bazball and Bairstow's dismissal... and reveals why he didn't take the England job last year Ponting has sat down with Mailsport's Hussain to discuss all things the Ashes Bairstow was controversially stumped during the 2nd Test, causing outrage Ponting has also opened up on England coach Brendon McCullum By Nasser Hussain For The Daily Mail Published: 22:30 BST, 4 July 2023 | Updated: 22:56 BST, 4 July 2023 e-mail 1 View comments As the Ashes heads to Headingley for the third Test of what has been a thrilling series so far, Mail Sport's Nasser Hussain sits down with former Australia captain Ricky Ponting to discuss Bazball, Jonny Bairstow's controversial dismissal at Lord's and why he turned down the England job. Nasser Hussain : There had been a lot of talk before this Ashes about England’s style and their transformation under Ben Stokes and Brendon McCullum. But Australia are 2-0 up. Did you expect that before this series? Ricky Ponting : I knew Australia would come here well prepared for what England have been doing. We were all a bit surprised at how Australia started tactically at Edgbaston but they won so it’s hard to be critical. I was always a bit unsure whether England’s style of play would cope with the pressure put on it by Australia. Hussain : With bat or ball? Ponting : Well, everyone talks about Bazball as the batting side of things but all the batters are trying to do is give their bowlers more time to take wickets. And it’s an England attack that needs time to take wickets, we’ve seen that in these first two Tests. I was more concerned with how the England batting would cope with the skill and experience of the Australian bowling. Nasser Hussain (left) and Ricky Ponting (right) sit down to discuss the Ashes 2023 Jonny Bairstow was controversially stumped out by Australian keeper Alex Carey Australia have taken a 2-0 lead at the Ashes, winning the 2nd Test Hussain : Have you been looking at England and the way they’ve been playing in admiration or thinking, ‘Wait until you come up against this Aussie line-up’. Ponting : A bit of both, actually. Sitting back, there has been admiration — particularly about what they did in Pakistan — but in the back of my mind I have been thinking, ‘OK, let’s see how it does stand up’. Remember, it’s Australia and Ashes cricket. Players are never put under more pressure than in an Ashes Test and we’ve seen at times England getting a bit carried away with their style of play. They haven’t been able to adapt and adjust quickly enough to give themselves their best chance of winning games. Hussain : Let’s go back just over a year. I know Rob Key spoke to you about the England coaching job before he gave it to McCullum and I said in Mail Sport a Stokes-Ponting partnership would be my choice because I’m a big fan of your cricket brain. You’ve said you weren’t overly interested. Is that for family reasons or because you could never be on England’s side? Ponting : I probably wouldn’t do the England job anyway but even if it was the Australia job I would not take it. Where I am in my life right now, I’m not ready to be a full-time international coach. I’ve got my IPL commitments that I love. I’ve got Channel Seven at home which I love and I love being here with Sky. Don’t get me wrong, I love coaching and I would love to be Australia head coach but I just haven’t got that time in my life. Just having enough work to keep me close to the game is what I’m after. Hussain : Has anything surprised you about England so far? Ponting : Brendon has been this sort of coach and captain wherever he’s been. He led New Zealand this way in one-day cricket and it got them to a World Cup final. I’ve seen him coach Big Bash teams when it’s been all-out attack, every ball. So I’ve not been surprised and I’m not surprised at the players England have picked as a result. When I watched England in Australia last time I didn’t like what I saw, especially at the top of the order. They were sitting ducks against that attack. So I believe what Brendon has tried to achieve over the last 12 months has been trialling a style of play he thought was the best way to beat Australia. I don’t think it had anything to do with those other series. It was finding an exciting, bold style of play that was good enough to beat Australia in an Ashes. Ponting has praised England coach Brendon McCullum for his exciting style of play Hussain : They are two down now. If it continues to go that way and Australia win the series comfortably, does it mean Brendon has got it wrong? Or has it been worth the risk? Ponting : It’ll be interesting how it will be received if it doesn’t go well for the rest of the series. I was sitting at the breakfast table before the fourth day at Lord’s and I had ex-England greats coming up and saying to me, ‘We’re wasting our talent’. But all we’re hearing from inside the dressing room is how they’re bringing on all the talent. Already it’s started, and if this Ashes gets worse for England the noise will become significant. Hussain : You mentioned you coach in the IPL. But I know how much you love Test cricket. Where are you with Tests? Can all formats live together happily? Ponting : There’s no doubt in my mind where Test cricket sits. It’s the ultimate, the pinnacle. I work in and call a lot of T20 but I love watching Test cricket because it’s still the greatest examination of a player. I’m more worried than ever about Test cricket’s future, there’s no doubt about that. I’m sure you would say the same. There are more and more concerns for Test cricket, more franchise leagues popping up, and the US league is starting later this month. I’m sure if that goes well it will be the next one to really take off… Hussain : You were a great player and great Australian captain. What do you make of Stokes the player and captain? Ponting has praised England captain Ben Stokes (left) for changing the way England play Ponting : I often get asked who’s the best captain I played against but unless you’re in the tent you don’t know. What I have liked is Ben and Brendon changing the way England have played and are thinking about their cricket. Whether that brings them an Ashes win remains to be seen, but I wouldn’t mind having Stokes in my team, I know that. Hussain : How about that last day we just witnessed at Lord’s? Ponting : It was enthralling. Amazing. I don’t think we ever saw Lord’s the way it was on Sunday. For good and bad reasons. But, again with Ben, it was a case of cometh the hour, cometh the man. He was forced to play that way again but he is able to do it. That was another amazing Ashes Test hundred but unfortunately for him and his side it wasn’t quite enough. Hussain : These had been the friendly Ashes — at least before Sunday. Players talking and laughing with each other a lot. Are you happy with that and will it all change now? Ponting : I wasn’t happy with them being friendly when I played! When I was captain I felt I was a custodian of Australian cricket and, if you like, protecting the mystique of the Australian cricket team. Perhaps these guys are realising now that we’re all the same. You’re even talking to me now in the commentary box when you probably wouldn’t have done 10 years ago! Franchise cricket has changed a lot of the atmosphere between the teams because these guys have played in the same sides around the world. Since Pat Cummins has been the captain there’s maybe been more awareness about what everyone thinks about the way Australia play their cricket and there had to be. Wind the clock back to Cape Town (Sandpapergate) and the Australian public didn’t want anything to do with their team. I’d like to think when I played we were pretty hard but fair, too. Whether these guys will have a beer at the end of each day’s play now, I’m not so sure. Bairstow's stumping caused controversy at Lord's as the crowd turned on Australia Hussain : And what did you think of that controversial Bairstow dismissal? You said off-air when it happened that Pat Cummins might have to re-think his appeal... Ponting : I just thought it would be a test for Pat. I didn’t think he had to withdraw the appeal, that’s for sure. The more clarification we’ve had about the decision, the more we know the correct call was made. It has gone down as a stumping, not a run-out. That’s all you need to know. Jonny did the wrong thing and he’s paid for it by losing his wicket in an Ashes Test. It’s as simple as that. What I would say is Alex Carey is a keeper and his job is to take catches and make stumpings. The funny thing is, if you watch the replay, Jonny is still in his crease when Carey throws the ball so Australia must have been expecting it. Hussain : Steve Smith will play his 100th Test at Headingley. Where would you rank him among Australian greats? Ponting : If it all ended tomorrow he’d be the second-greatest batsman Australia have produced after Don Bradman. Statistically, you cannot argue with that. He’s achieving things so quickly. Even at Lord’s, he became the second-fastest in history to reach 9,000 Test runs. Quickest to 32 Test hundreds, innings-wise. It doesn’t look as though he’s slowing down. He has been a bit guarded about how long he will go on for, which is a bit strange to me. He jokes about not being able to sleep. With the amount of hundreds he scores he should be able to sleep pretty easily, I reckon. Hussain : We’re going back to Headingley. We were both on commentary at the end of that remarkable day there four years ago. Ben almost did it again at Lord’s on Sunday. I’m sure we will be re-running those moments from last time on Sky, your mate Justin Langer kicking the bin… Ponting : I think Nathan Lyon took it harder than Justin to be honest with the mistake he made at the end of that game. But we had the pleasure of calling it on TV together and I don’t think I’ve ever seen a better moment in Test cricket. To see what Ben was able to do, nine down, having to hit sixes and then to pull it off… he’s done it a few times since and he almost did it to Australia again here at Lord’s. He’s such a winner. You have to do a lot right to beat him and he’s won some Tests for England that most others wouldn’t have. Hussain : I think you said, ‘Wow-ee Nasser’ on commentary at Leeds…. Ponting : I wish I could take that back actually… Share or comment on this article: Australia legend RICKY PONTING talks to our man NASSER HUSSAIN about Bazball & Bairstow's dismissal e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 21:37:47","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/22/72851005-0-image-a-43_1688504856778.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Heartbreak AGAIN as Scotland knock out Zimbabwe from Cricket World Cup","link":"https://nehandaradio.com/2023/07/04/heartbreak-again-as-scotland-knock-out-zimbabwe-from-cricket-world-cup/","keywords":["Cricket","Featured","News","Sports","ICC World Cup Qualifier","Super Six","Zimbabwe vs Scotland"],"creator":["Nehanda Radio"],"video_url":null,"description":"Scotland beat Zimbabwe by 31 runs to end the hosts' hopes of qualifying for the World Cup and move to within one game of the finals. The post Heartbreak AGAIN as Scotland knock out Zimbabwe from Cricket World Cup appeared first on Nehanda Radio.","content":"In what was a must-win game for both sides, Scotland set a total of 234-8 after being put into bat first. Zimbabwe lost four wickets for 37 runs early into their innings. And, although Ryan Burl hit an impressive 83 to put the game in the balance, Tendai Chatara was bowled by Safyaan Sharif as the hosts fell short. Sharif became the first Scot to take 100 international wickets, but it was three early wickets from man of the match Chris Sole that proved crucial. Scotland will reach the World Cup for a fourth time should they defeat Netherlands on Thursday – and could even qualify with a narrow defeat – while Zimbabwe miss out for the second finals in a row. Doug Watson’s side had finished second in the first round of qualifying behind Sri Lanka for the Super Six series and are now in pole position to progress along with them again with only two teams progressing to the finals. Scotland started impressively, with Matthew Cross, Brandon McMullen and George Munsey all breaching 30, but a mid-order collapse looked to have handed the momentum to Zimbabwe. In the end, Mark Watt’s tail-end 21 not out off the closing balls proved crucial in setting up a half-decent but reachable target for the hosts. Sole’s early wickets put Zimbabwe under increased pressure, only for home fans to sense the tide had turned as Sikandar Raza, who hit 34, and Burl piled on the runs. However, after the latter’s dismissal, it seemed only a matter of time before Scotland claimed a famous victory. Scotland captain Richie Berrington told Sky Sports: “Incredibly proud of the lads – to show the fight that we did. We knew early wickets would be key – our bowlers have been fantastic throughout this tournament. “Chris Sole has bowled a couple of fantastic spells in this tournament – it was great to see again today. “We knew there were going to be tough games and I think we can take confidence from these last two wins, but we need to be stronger again against the Netherlands. “Thursday will be another great occasion and another great event. The support from back home has been fantastic and there’s a real good unity in this group.” Zimbabwe captain Craig Ervine told Sky Sports: “We did well to restrict them to 230. Unfortunately, that opening spell from Chris Sole put us on the back foot and it was extremely tough to come back from that position. “At the end of the day, we fell short. Everybody’s really gutted. It would have been nice to put those demons from 2018 to bed, but unfortunately we didn’t. It’s a moment we’ll live with for a long time. “I’m proud of the way we played our cricket and there’s a lot of positives we can take from this tournament.”","pubDate":"2023-07-04 21:11:06","image_url":null,"source_id":"nehandaradio","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Back on the Kabaddi mat, Pawan Sehrawat determined to ‘bring home the gold India lost’","link":"https://www.thehindu.com/sport/other-sports/pawan-sehrawat-pkl-pro-kabaddi-knee-injury-rehab-asian-games-india/article67043090.ece","keywords":null,"creator":null,"video_url":null,"description":"The most expensive player in PKL history, bought by Tamil Thalaivas for ₹2.26 crore, was thrown out of action after sustaining an ACL injury during the opener of Pro Kabaddi League season 9","content":"If you go back and watch India’s matches from the recent Asian Kabaddi Championships, you’ll notice Pawan Sehrawat everywhere. He was raiding, lining up in a chain defence, attempting super tackles, giving raiders instructions before they crossed into opponent territory and more. It is hard to imagine how someone so involved in a 40-minute kabaddi encounter spent an entire season off the mat after sustaining an injury inside the first 10 minutes of the opening fixture of Pro Kabaddi League season 9. Pawan missed out on galvanising a new team (Tamil Thalaivas), and a slew of records. All that FOMO (fear of missing out) was channelled in his performances in Busan, South Korea. Pawan was crucial to India winning the gold medal, registering two Super 10s in the tournament while acting as a pivot in attack and defence. However, a few months back, he underwent a right knee operation after sustaining an ACL injury during the PKL season opener against Gujarat Giants. “I am an athlete, so I had to balance both the itches — of wanting to recover carefully and properly and battling the urge to get onto the mat,” Pawan tells The Hindu. “My injury had changed the course of results a bit. I felt I had to find a way to play. I wanted to put on a band-aid and go and play. But it was not to be.” Pawan was inspired by javelin Olympic champion Neeraj Chopra’s recovery from a potentially career-ending elbow injury and decided to approach the people who had helped the fellow Haryana athlete. “I mailed JSW from my end. The team here sorted my own personal support staff — with a physio, a trainer and a nutritionist whose backup continued even after I came home. They have a huge hand in my return to the mat,” Pawan explains. The 26-year-old is snapping at the heels of superstar raiders like Pardeep Narwal, Maninder Singh, Deepak Niwas Hooda and Rahul Chaudhari in how he hoards points game after game. Pawan is currently fifth in the all-time raiding points standings with 987 to his credit in 105 PKL games. “At the Inspire Institute of Sports in Bellary, I was assigned to Dinesh and Manish — my trainer and physio. The priorities for my time there were two-fold — one to get me back to my old fitness levels and, the other, to take that fitness a notch higher,” Pawan says. When The Hindu caught up with Pawan before PKL 7 in Chennai, he told us just how much he hated working out in the gym. “Mujhe gym pasand nahin hai — the idea of exercising on the treadmill or working with the dumbbell in a small area. I like the outdoors better. If I get a park or an open space, I will spend my time running there instead.” Today, Pawan is easily in the best shape of his life because of a curated rehab and exercise regimen which includes barbell squats and deadlifts in the gym and sprints on the track. “I have never done weight training as part of my routine before,” Pawan explains. “When I asked them about the benefits, they would say, “Pawan bhai, aapko iska benefit mat pe dikhega (you’ll see the benefits on the mat, brother).” “We worked on my core and found that parts like my shoulders were weak. So, we picked them out and worked on them specifically. I understood how important strengthening my core was to my jump,” Pawan, who is called the hi-flyer for his evasive frog jumps, says. “I jump quite well anyway but imagine, I manage that with a weak core. Working on my core made these jumps easier. Manish worked on my speed — to match the speed of my feet and footwork with my mind.” Pawan has made a few friends during his time at IIS — with triple jumper Praveen Chithravel and boxer Sachin Siwach. The banter extends to their workouts, with Praveen often calling Pawan for a round of jumps. “I have not tried the triple jump yet (laughs),” Pawan says sheepishly. “Our bonding has been fantastic — among Praveen, Sachin and me. Praveen looks lightweight but he lifts a lot more than I do. He is a great guy, very punctual about his routine. So, there is a plan to do this (a triple jump challenge) when the Bengaluru camp begins. Either he comes over or I will head to Bellary, and we will collaborate on something fun,” he adds. One consistent pain point for Pawan before a PKL season or tournament was making weight. “The limit is 85kg and I was always around the 86 to 88kg mark. I used to run and starve to reduce weight, but I now have a nutritionist to help me sort that part out. I was in touch with her until just before the Asian Championships,” Pawan explains. “The boys around me would wonder who I was constantly messaging and sending photos of every meal to, but it helped. She would ask me for a plan and ensure I stuck to it. This tournament was the first time I made weight without starving myself and losing energy,” he adds. The camp in Patna before heading to South Korea helped Pawan to shake off the cobwebs. “The challenge for me was the return to training and workouts as a team. I was working out and doing physical work before but when you are doing that individually, you can take rests according to your pace, but not when you’re in a team set up. This was a fresh experience after the six to seven-month gap due to injury and the subsequent rehab. That was a win I savoured for a while,” Pawan explains. India put on an aggressive show in Busan, taking massive leads against weaker opponents and even keeping the likes of Iran at bay with leads of over five to 10 points. Back in his Bengaluru Bulls days, erstwhile captain Rohit Kumar, in addition to rallying his forces on the mat, also had the responsibility of keeping Pawan calm in pressure situations. In a ‘how life comes full circle’ situation, Pawan took on that role for the juniors in the team during the Asian Championships. In India’s matches against Iran, he was constantly speaking to Aslam Inamdar, who tends to get a little antsy in do-or-die raids. This element of patience aside, Pawan also showed his aggressive side in Busan, taking on the Iranians when they misjudged their lines or asked for points that he felt weren’t there, enough to draw comparisons with former India cricket team captain Virat Kohli. “I don’t mean to draw that comparison). If something is wrong and I see it happening on the field, I will speak up. If someone is coming for my team, I will react. Saamne wale ko chodunga nahin (I won’t let the person before me get away). Pawan does love his cricket heroes though, and emphasises his adoration for Kohli’s friend and former teammate A.B. De Villiers. “Mr. 360,” is the first thing he says when ABD’s name comes up. “He is able to hit shots all around the park. I want that in my kabaddi. There shouldn’t be an element of the game I can’t do,” he says. Another emotion that binds this Indian squad together is disappointment. The wounds from the defeat at the 2018 Asian Games semifinals to Iran are still raw. While Pawan insists that India is not focusing on any one team, every statement of intent from the raider is about ‘bringing the gold medal back.’ “I was in the Bengaluru Bulls camp in 2018 when India lost that final. Watching those men break down and cry was a horrible memory that is etched in my mind to this day. I don’t know if they’ve ever sobbed like that again, but that shouldn’t have happened,” he remembers. “It is not only about Iran. We won’t take it easy with any team. We need to make a statement that we are better prepared than before and we’re out to regain that medal we lost in 2018. The 12, whoever it may be, will give our 200 percent at the Asian Games,” he says. “The message from my circle is simple — go play your game calmly and bring back the gold medal we lost,” Pawan says.","pubDate":"2023-07-04 19:17:26","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Assam’s Uma Chetry’s journey from humble beginnings to India colours","link":"https://www.thehindu.com/sport/cricket/assam-cricketer-uma-chetry-in-indias-tour-of-bangladesh/article67043079.ece","keywords":null,"creator":null,"video_url":null,"description":"Uma made it to the India senior women’s squad for its tour of Bangladesh","content":"Uma Chetry was barely a couple of years old when she started playing cricket at her residence in Bokakhat in Assam’s Golaghat district. While her elder siblings would play the sport on the kutcha roads of the village, she would emulate them indoors. Using a stick as a makeshift bat, Uma would send big round potatoes whizzing past unsuspecting family members as she hit fours and sixes at will. When she turned three, her mother Dipa bought her a plastic bat and a ball, and Uma made it a point to practice everyday. “We soon realised that she is fond of cricket. She would play with the local boys of her age and often discuss a thing or two with her elder brothers,” Dipa tells Sportstar. Back then, Dipa of course did not imagine that someday Uma would pursue the sport seriously and make it to India’s national squad. On Sunday evening, as Uma made it to the India senior women’s squad for its tour of Bangladesh, hard work and determination paid off for the Chetrys. “It’s an incredible feeling to see your daughter making the State proud. Things were not easy for her, but with sheer determination, she continued chasing her dreams,” Dipa says. Dipa played a significant role in her daughter’s journey too. With Uma’s father Lok Bahadur being a small-time farmer, there would be times when the family - Uma and her four brothers - would struggle to make ends meet. But that wasn’t a deterrent for the youngster. Even though not many in the village took her decision of playing with boys in the right spirit, Dipa encouraged her daughter to follow her passion. I did not want her to stop playing just because she was a girl,” Dipa says. Soon, Uma started training under local coaches - Raja Rahman and Mehboob Alam - and would travel far to train regularly. “I also told her that she should not take her studies for granted,” the mother adds. So, in the mornings, Uma would train for a while and then travel to Bokakhat Hindi High School, and again play once the school was over. Around 2011, she caught the eye of Ajoy Sarma, the treasurer of Golaghat District Sports Association. “We saw her play with boys, who were slightly older than her. But she looked quite determined and was very competitive on the field. We were quite impressed with her, and eventually, we provided her with all the support,” Sarma says. Sarma pushed her case and soon, Uma was on Assam Cricket Association’s radar. By 2017, she was part of the Assam state team. and went on to make every opportunity count. In the last domestic season, she scored 194 runs in six one-dayers, at an average of 32.33, whereas in five T20 innings, she scored 120 at a strike rate of 88.88. Her determined show earned Uma a spot in the India team for the Emerging Asia Cup in Hong Kong as well. Uma’s journey has just begun and she hopes to make every opportunity count. Onwards and upwards!","pubDate":"2023-07-04 19:02:25","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"The spirit of the game has to be taken in the right spirit","link":"https://www.thehindu.com/sport/the-spirit-of-the-game-has-to-be-taken-in-the-right-spirit/article67041358.ece","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Jonny Bairstow went for a walk with the ball still in play, and was stumped. The laws of the game say he was out. The spirit of the game suggested (not demanded, for you cannot impose the spirit on anybody) that he ought to have been recalled by Australian captain Pat Cummins. But the spirit has to be a two-way street – we shall come to that in a moment. First, let’s enjoy some of the reactions. British Prime Minister Rishi Sunak, whose rise to the top job had something to do with him stumping his predecessor, thought Australia had contravened the spirit of cricket. Australian Prime Minister Anthony Albanese said he was proud of the winning Australian men’s and women’s teams and that his country was right behind Pat Cummins and Alyssa Healy (the captain of the women’s team). It was unclear whether he (as opposed to his country) thought it was right or wrong to stump Bairstow. Former cricketers have been more forthright. Brendon McCullum, England’s coach says he will not be having a beer with the opposition any time soon. My heart bleeds for the opposition. Australia should issue a public apology, says Geoff Boycott. They doubtless will, as soon as Britain apologises to Australia for the genocide and dispossession of their indigenous peoples that came with British invasion and occupation. Were there vestiges of colonial arrogance in what England did? Are they telling Australia that fair play is what they decide it is? Is Bazball the only way to play the game? England controlled the cricketing narrative for decades till other nations – former colonies – caught up and then overtook them. And now with Bazball are they attempting to control the narrative again? If all that sounds faintly ridiculous, that’s because it probably is. A dozy batsman was stumped at a crucial point in a Test and it becomes a battle between the stiff upper lip and the suntanned limb. In identical circumstances, England would have done the identical thing. Had the ball missed the stumps, wouldn’t Bairstow have attempted a single? Sadly, the ‘spirit’ usually comes accompanied by hypocrisy, which is why there is a cry for removing the grey areas in the laws. Cricket is unique in that it gives individuals and teams a chance to make moral choices that are in areas beyond the laws. Making the laws water tight is not a solution, for the ambiguity between what is legal and what is sportsmanlike is what reveals character. And cricket is about revealing character; players must be given an opportunity to choose. Despite the change in emphasis in the law on running out a non-striker backing up, some bowlers will still not do it. Bairstow wasn’t attempting a single, but he is an experienced international batsman who ought to have known better. Would he have gone for a walk had a spinner been bowling and Alex Carey had been standing up to the wicket? It is surprising how international players are ignorant (or affect to be) of the laws of the game. Australia were upset when the catch Mitchell Starc took was disallowed because he dragged the ball on the ground. Either they don’t know the law or feel it has to be ‘My country right or wrong’, a dangerous attitude on a sports field. Which brings us to the spirit being a two-way street. It might have been good PR for Cummins to recall Bairstow, and let us assume he did, in the interests of the ‘spirit’ (a good thing to have in the game, but now being increasingly ridiculed). What ought to be Bairstow’s response then? For the spirit to work as it should, Bairstow would then have to throw his wicket away next ball. He was out legally, then given a reprieve by the ‘spirit’, and now he ought to return ‘spirit’ with ‘spirit’. You can argue this will be against the interests of his team, but then so was setting out for a walk with the ball still in play. Did no one in the team — captain, players, coaching staff — notice that Bairstow had done it before and ought to be told? Another problem with the spirit is that it often takes focus away from the performances — in this case Australia’s all-round superiority, and Ben Stokes’s stunning century. Controversy never hurt the gates, though.","pubDate":"2023-07-04 19:00:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"A wicketkeeper’s take on stump-gate and the spirit of cricket","link":"https://www.brisbanetimes.com.au/sport/cricket/a-wicketkeeper-s-take-on-stump-gate-and-the-spirit-of-cricket-20230704-p5dlny.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Darren Berry"],"video_url":null,"description":"I’ve been asked several times in the past few days if I ever did such a thing. I have, and I would do it again, writes Darren Berry.","content":"Plenty has been said and written in the past 48 hours after tensions boiled over between Australia and England at Lord’s on Sunday evening. In short, Australian wicketkeeper Alex Carey completed a clever piece of work to stump English counterpart Jonny Bairstow off the bowling of Cameron Green. Was it within the rules and laws of the game? A hundred per cent it was. Sadly, the incident of brilliance by Carey sparked a firestorm that will be forever remembered in Ashes folklore, just as Stuart Broad will always be remembered for refusing to walk when he edged to first slip off Ashton Agar at Trent Bridge a decade ago. Although it appears Broad himself may have forgotten that incident, given how he behaved in the aftermath of Bairstow’s dismissal, which he described as “literally the worst thing I’ve ever seen in cricket, that”. I’d suggest move on, big boy, unless you really want to talk about the grey area that is the spirit of cricket. Not walking off after smashing the ball to slip was deplorable. Carey’s act of astute game awareness was not only within the laws but also within the spirit of the game. It appears the new governor of the spirit of cricket (whatever that is) English coach Brendon McCullum, who is a fine man, also took umbrage at the incident and was reported to have said he wouldn’t be having a beer any time soon with the Australians. Brendon, it appears you, too, have a short memory. You say you have grown up since those dark days when you did exactly the same thing to stump England batter Paul Collingwood , who is now your assistant coach. I hesitate to mention the run out of Muttiah Muralitharan when he was simply going to congratulate Kumar Sangakkara on a fine century. I’ve been asked several times in the past few days if I ever did such a thing. I have, and I would do it again. As long as it’s within the laws of the game it’s fair game. Carey did not pause and wait for Bairstow to leave his crease. He simply anticipated and executed a beautiful throw from a distance with his gloves on, a delicate skill in itself. He had been watching the dozy Bairstow and was ready to swoop just as any sharp-minded ’keeper should. The ball is alive until the umpire calls the end of the over or the ball has been registered as dead ball. The ball was live, but Bairstow wasn’t. How ironic that Bairstow tried the same thing on day three in an attempt to stump Marnus Labuschagne when he stood back to Jimmy Anderson. If he had executed that skill, rather than missed the stumps, would the righteous Ben Stokes have upheld the appeal? He said post-match he wouldn’t but who knows if we ever will find out the true answer to that question. What actually is the spirit of the game? Maybe we should ask those fine gentleman, the members of the Marylebone Cricket Club at Lord’s. I’m sure they are aware of how to uphold the spirit of the game and behave accordingly in all situations. I’ve been privileged and honoured to be at Lord’s on several occasions both as a player and coach and the walk through the Long Room is a beautiful tradition of the game. It’s unique and I would hate for that to ever change. Again, the minority spoil it for the majority. ‘I’d suggest move on, big boy, unless you really want to talk about the grey area that is the spirit of cricket. Not walking off after smashing the ball to slip was deplorable.’ Darren Berry Carey has been outstanding at his wicketkeeping craft in this series standing back to the fast men and even more impressive over the stumps. His leg-side stumping of Zak Crawley at Lord’s was a thing of beauty that brought a smile to the ’keeping brethren. Bairstow has been a liability to the English team and the sooner they reinstate the best keeper in England, Ben Foakes, the better off they will be. No doubt Bairstow is a fine batsman, a game changer. His position in the team is not in question but his role in it certainly is. His footwork to the fast bowlers has been non-existent, his diving as result disjointed and awkward. His work up to the stumps has many club cricketers scratching their heads in bewilderment. Loading It’s been hard to watch, to be brutally honest. This Ashes series so far has been enthralling. It came to life perhaps for the wrong reasons at Lord’s, but it has lit a wildfire for the next encounter at Headingley, where Stokes ripped our hearts out a few years ago. He almost did it again at Lord’s on Sunday. He is an inspirational leader and an amazing cricketer. Darren Berry is a former Victorian captain and wicketkeeper who played 153 first class matches and was reserve wicketkeeper for the 1997 Ashes tour. Save Log in , register or subscribe to save articles for later. License this article The Ashes Australian cricket England Test cricket Opinion Darren Berry is a columnist. Most Viewed in Sport Loading","pubDate":"2023-07-04 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"12 words come back to haunt Jonny Bairstow as old interview shuts down England argument","link":"https://www.foxsports.com.au/cricket/the-ashes/jonny-bairstow-footage-all-but-silences-englands-spirit-of-the-game-debate/news-story/3650c1597dd821d71866319c5b71c50a","keywords":null,"creator":null,"video_url":null,"description":"Just when you think England’s hypocrisy can’t sink any lower, more footage comes to light and leaves them with even more egg on their faces.","content":"Just when you think England’s hypocrisy can’t sink any lower, more footage comes to light and leaves them with even more egg on their faces. Australia claimed a second straight Test win in controversial fashion when England wicketkeeper Jonny Bairstow was stumped at the hands of Alex Carey. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > Bairstow went walk about a split second after ducking under a bouncer and Carey, having spotted him doing the same throughout his innings, launched the ball towards the stumps and sent the bails flying. England weren’t happy, despite the dismissal being well within the rules of the game, and quickly invoked the spirit of the game debate. Murphy ready for the \"bazball\" treatment | 01:01 Attempting to play that card and call out Australia for being “cheats” and not playing sportsmanlike cricket, England have found themselves buried under a mountain of moments that exposed them as hypocrites . First it was England coach Brendon McCullum - who was exposed after his post-game comments took aim at the Aussies despite him doing exactly the same countless times throughout his career. Now it’s Bairstow’s turn. The English keeper wasn’t happy with his dismissal and delivered a colder than the flip side of the pillow handshake during post-game proceedings. But thanks to the magical work of social media sleuths, he can sit alongside his fellow teammates in the hypocrite stands. Cripes, I’ve been found out. (Photo by Gareth Copley/Getty Images) Source: Getty Images Vision surfaced of Bairstow committing a contentious stumping in a county cricket game, using the rules to his advantage. The video shows Samit Patel leaving a delivery for Nottinghamshire and Bairstow waiting with his gloves next to the stumps, before whipping off the bails as Patel raised his foot off the ground after a delay. But it’s his gloating comments after the match that have now come back to haunt him and leave him with no leg to stand on. “I saw him lift his foot and I took the bails off, luckily it was one of those that kind of went for us there,” Bairstow said. “I saw Matt Prior do it against South Africa at Lord’s and it’s just something that’s luck of the draw. You can’t really practice, it’s just one that goes your way.” But it’s his final 12-word remark that really puts the nail in the coffin and shuts down any argument England have attempted to make since the loss. “It’s within the rules of the game and that’s how it is,” he said. Another angle that deserves to be highlighted from those remarks is the Prior stumping that occured at Lord’s. In the wake of Carey’s dismissal of Bairstow, the Lord’s crowd turned as feral as fans jostling in the Ticketek lounge hoping to nab Taylor Swift tickets. But would you believe that when an England player successfully pulled off the reportedly contentious dismissal, that same crowd was delighted. Instead of cheating chants breaking out, the English faithful and players revelled in delight as South Africa's Morne Morkel was sent on his way. The first two Tests have been remarkably tight affairs and we should be talking about just how good this series has been. Unfortunately England are intent on shining a light on anything but the results, as they look to be the first squad since Don Bradman to come back and win from 2-0 down. The third Test gets underway on Thursday with Australia able to capture the Ashes urn with a victory. Even a draw would see the Aussies retain the urn. England have their backs firmly against the wall, but if you were to believe them … they’re winning the Ashes on moral grounds.","pubDate":"2023-07-04 23:06:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"India appoint former fast bowler as Men’s Selection Committee Chairman","link":"https://www.dailymirror.lk/cricket/India-appoint-former-fast-bowler-as-Men’s-Selection-Committee-Chairman/315-262406","keywords":null,"creator":null,"video_url":null,"description":"India have named former fast bowling all-rounder Ajit Agarkar as the Chairman of the Senior Men’s Selection Committee.","content":"India have named former fast bowling all-rounder Ajit Agarkar as the Chairman of the Senior Men’s Selection Committee. Agarkar, who played 26 Tests, 191 ODIs, and four T20Is, was recently among the coaching staff for Indian Premier League franchise Delhi Capitals and has also served as the selector for Mumbai between 2017 and 2019. BCCI had re-appointed Chetan Sharma as the chairman of selectors earlier this year before he was removed from the role. With the team in a transition phase and the ICC Men's Cricket World Cup closing in, Agarkar's task will be huge. Shiv Sundar Das, Subroto Banerjee, Salil Ankola and Sridharan Sharath are the others on the men's selection committee. Agarkar will be the senior-most in the panel and takes over the chairman post that has been vacant since February. His first task would be to pick India's squad for the five T20Is against West Indies which begins next month. India have already named the squad for the Tests and ODIs on the tour of the Caribbean Islands. (ICC)","pubDate":"2023-07-04 22:58:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_ddcf18f713.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"If you thought Lord’s was bad, wait until you see Leeds united against Australia","link":"https://www.brisbanetimes.com.au/sport/cricket/if-you-thought-lord-s-was-bad-wait-until-you-see-leeds-united-against-australia-20230704-p5dloy.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Emma Kemp"],"video_url":null,"description":"A few expletives from the toffs in the Long Room will seem relatively sedate compared to the Western Terrace when the Yorkshire crowd is 10 pints deep.","content":"No sooner had Mitchell Starc hit Josh Tongue’s leg stump at Lord’s than the term “Western Terrace” had begun trending on Twitter. Stay in your crease and prepare for police, for the third Ashes Test at Headingley starts on Thursday and everybody is getting a little bit emotional. Ben Stokes, captain of an England team now 2-0 down in the series, predicts proceedings will get “ramped up”. The visitors certainly agree — requesting extra security for the match after the ugly scenes at Lord’s. The British press is running “Pariah Carey” headlines. The UK Prime Minister says the spirit of cricket has been contravened . As theatre, the whole thing constitutes a thoroughly enjoyable meltdown. That is, aside from the abuse hurled at Australia’s players in the second Test during the final day of their victory in London, which prompted the Marylebone Cricket Club to suspend three members . There will be no Long Room in Leeds, but if you think some expletives from the toffs is raucous just wait until 3pm at Headingley when the Yorkshire crowd is 10 pints deep. The Australian reported the request for extra security came after Steve Smith’s mother left early on day five at Lord’s to escape the taunts of fans, for whom her accent — rather than her connection to the star batsman — was provocation enough. The 11-year-old son of one staff member was also reduced to tears after what had begun as a family occasion at the home of cricket. The contrast in atmosphere at these two locations could not be more stark. One enforces a dress code of cravats and tailored coats; the other opens its doors to Shrek costumes and ancient Roman togas. The “spirit of cricket” – that great ethical adjudicator – will be floating somewhere over the Western Terrace, where unruly cup collectors dressed as lobsters and seagulls and Boris Johnson lurk ominously, readying to build their outlawed beer snakes as forlorn stewards give chase. Much of it is pantomime but this time the stage is set for something a little more gruesome. Maybe Shrek will kill the Romans. Boris Johnson might eat a lobster. Whatever happens, wicketkeeper Alex Carey, whose stumping of Bairstow at Lord’s triggered the chaos , will almost certainly be booed. The Headingley crowd during an Ashes clash in 2019. Credit: Getty Any on-field flashpoint – an overturned dismissal, a catch that touches the ground, heaven forbid a Mankad – could escalate the vitriol at the 18,350-capacity venue. Last June, during an England Test against New Zealand, a brawl broke out in the Western Terrace . Punches were thrown by a man wearing a replica of former England footballer Paul Gascoigne’s famous Euro 1996 No.8 shirt. The incident came four months after the England and Wales Cricket Board overturned a ban it had placed on Yorkshire cricket club from hosting international matches following allegations of institutionalised racism at the club by former player Azeem Rafiq. Police intervened in that melee, and are on standby to do so again amid reports that the dramatic scenes at Lord’s have formed part of the authorities’ plans to increase security at the venue. That includes a team of “sprinter stewards” to intercept any protesters or disgruntled spectators. An extensive plan had already been in place to prevent potential pitch-invading protesters with the environmental activist group Just Stop Oil, after two managed to get onto the pitch during the first day at Lord’s. But the prospects of a backlash against Australian players, and in particular Carey, is viewed as more likely in Bairstow’s home county – the wicketkeeper-batter was born 45 minutes’ drive down the road in Bradford and is a beloved local in those parts. Australian captain Pat Cummins looks on as fans have their say at Lord’s. Credit: Getty “The wellbeing of players, officials and spectators is paramount, and we are implementing appropriate measures to do everything within our control to keep everyone safe,” a spokesperson for the county told Press Association. “Clearly, some incidents at Lord’s have heightened the interest and exposure of the third Test. We will continue to work closely with both the England and Wales Cricket Board and West Yorkshire Police to ensure our safety measures are proportionate for this fixture.” Captain Pat Cummins, meanwhile, said he would keep watch over Carey, who was told by Stuart Broad “you’ll forever be remembered” for his Bairstow dismissal, but also intimated a siege mentality could galvanise the tourists to retain the urn by the end of the week. Loading “There’s nothing like loud crowds that bring a team together,” Cummins said before his squad departed London for Leeds. “He’s one of the guys we’ll get around. But these kinds of moments can really strengthen a side.” As British newspaper iNews printed on its back page on Tuesday: “The gloves are off.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article The Ashes Opinion Australian cricket Test cricket England Emma Kemp is a senior sports reporter. Most Viewed in Sport Loading","pubDate":"2023-07-04 22:30:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Babar Azam refuses to sport betting firm’s logo on jersey","link":"https://www.dailymirror.lk/breaking_news/Babar-Azam-refuses-to-sport-betting-firm’s-logo-on-jersey/108-262405","keywords":null,"creator":null,"video_url":null,"description":"Pakistan’s star cricketer Babar Azam has categorically refused to wear the logos of betting companies on his jersey.","content":"Pakistan’s star cricketer Babar Azam has categorically refused to wear the logos of betting companies on his jersey. The fourth edition of the LPL will take place from July 30 to August 22. The Colombo Strikers have signed Babar Azam, who will also serve as the team’s captain during the tournament. The Strikers have signed an agreement with a betting company, but the Pakistani star, who has just returned from Hajj, has refused to wear the company’s logo because betting is forbidden in Islam. According to reports, the condition was included in the agreement, and the franchise also honored Babar Azam’s decision. Mr Azam and his opening partner Mohammad Rizwan have returned to Pakistan after performing Hajj. Both will join the training camp in Karachi before the national squad leaves for Sri Lankan for two-match Test series.","pubDate":"2023-07-04 22:29:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_8b2154a1a5.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Australia legend RICKY PONTING talks to our man NASSER HUSSAIN about Bazball & Bairstow's dismissal","link":"https://www.dailymail.co.uk/sport/cricket/article-12264295/Australia-legend-RICKY-PONTING-talks-man-NASSER-HUSSAIN-Bazball-Bairstows-dismissal.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"As the Ashes heads to Headingley for the third Test of what has been a thrilling Ashes series so far, Mail Sport's NASSER HUSSAIN sits down with former Australia captain RICKY PONTING.","content":"Australian legend RICKY PONTING talks to our man NASSER HUSSAIN about Bazball and Bairstow's dismissal... and reveals why he didn't take the England job last year Ponting has sat down with Mailsport's Hussain to discuss all things the Ashes Bairstow was controversially stumped during the 2nd Test, causing outrage Ponting has also opened up on England coach Brendon McCullum By Nasser Hussain For The Daily Mail Published: 22:30 BST, 4 July 2023 | Updated: 22:56 BST, 4 July 2023 e-mail 1 View comments As the Ashes heads to Headingley for the third Test of what has been a thrilling series so far, Mail Sport's Nasser Hussain sits down with former Australia captain Ricky Ponting to discuss Bazball, Jonny Bairstow's controversial dismissal at Lord's and why he turned down the England job. Nasser Hussain : There had been a lot of talk before this Ashes about England’s style and their transformation under Ben Stokes and Brendon McCullum. But Australia are 2-0 up. Did you expect that before this series? Ricky Ponting : I knew Australia would come here well prepared for what England have been doing. We were all a bit surprised at how Australia started tactically at Edgbaston but they won so it’s hard to be critical. I was always a bit unsure whether England’s style of play would cope with the pressure put on it by Australia. Hussain : With bat or ball? Ponting : Well, everyone talks about Bazball as the batting side of things but all the batters are trying to do is give their bowlers more time to take wickets. And it’s an England attack that needs time to take wickets, we’ve seen that in these first two Tests. I was more concerned with how the England batting would cope with the skill and experience of the Australian bowling. Nasser Hussain (left) and Ricky Ponting (right) sit down to discuss the Ashes 2023 Jonny Bairstow was controversially stumped out by Australian keeper Alex Carey Australia have taken a 2-0 lead at the Ashes, winning the 2nd Test Hussain : Have you been looking at England and the way they’ve been playing in admiration or thinking, ‘Wait until you come up against this Aussie line-up’. Ponting : A bit of both, actually. Sitting back, there has been admiration — particularly about what they did in Pakistan — but in the back of my mind I have been thinking, ‘OK, let’s see how it does stand up’. Remember, it’s Australia and Ashes cricket. Players are never put under more pressure than in an Ashes Test and we’ve seen at times England getting a bit carried away with their style of play. They haven’t been able to adapt and adjust quickly enough to give themselves their best chance of winning games. Hussain : Let’s go back just over a year. I know Rob Key spoke to you about the England coaching job before he gave it to McCullum and I said in Mail Sport a Stokes-Ponting partnership would be my choice because I’m a big fan of your cricket brain. You’ve said you weren’t overly interested. Is that for family reasons or because you could never be on England’s side? Ponting : I probably wouldn’t do the England job anyway but even if it was the Australia job I would not take it. Where I am in my life right now, I’m not ready to be a full-time international coach. I’ve got my IPL commitments that I love. I’ve got Channel Seven at home which I love and I love being here with Sky. Don’t get me wrong, I love coaching and I would love to be Australia head coach but I just haven’t got that time in my life. Just having enough work to keep me close to the game is what I’m after. Hussain : Has anything surprised you about England so far? Ponting : Brendon has been this sort of coach and captain wherever he’s been. He led New Zealand this way in one-day cricket and it got them to a World Cup final. I’ve seen him coach Big Bash teams when it’s been all-out attack, every ball. So I’ve not been surprised and I’m not surprised at the players England have picked as a result. When I watched England in Australia last time I didn’t like what I saw, especially at the top of the order. They were sitting ducks against that attack. So I believe what Brendon has tried to achieve over the last 12 months has been trialling a style of play he thought was the best way to beat Australia. I don’t think it had anything to do with those other series. It was finding an exciting, bold style of play that was good enough to beat Australia in an Ashes. Ponting has praised England coach Brendon McCullum for his exciting style of play Hussain : They are two down now. If it continues to go that way and Australia win the series comfortably, does it mean Brendon has got it wrong? Or has it been worth the risk? Ponting : It’ll be interesting how it will be received if it doesn’t go well for the rest of the series. I was sitting at the breakfast table before the fourth day at Lord’s and I had ex-England greats coming up and saying to me, ‘We’re wasting our talent’. But all we’re hearing from inside the dressing room is how they’re bringing on all the talent. Already it’s started, and if this Ashes gets worse for England the noise will become significant. Hussain : You mentioned you coach in the IPL. But I know how much you love Test cricket. Where are you with Tests? Can all formats live together happily? Ponting : There’s no doubt in my mind where Test cricket sits. It’s the ultimate, the pinnacle. I work in and call a lot of T20 but I love watching Test cricket because it’s still the greatest examination of a player. I’m more worried than ever about Test cricket’s future, there’s no doubt about that. I’m sure you would say the same. There are more and more concerns for Test cricket, more franchise leagues popping up, and the US league is starting later this month. I’m sure if that goes well it will be the next one to really take off… Hussain : You were a great player and great Australian captain. What do you make of Stokes the player and captain? Ponting has praised England captain Ben Stokes (left) for changing the way England play Ponting : I often get asked who’s the best captain I played against but unless you’re in the tent you don’t know. What I have liked is Ben and Brendon changing the way England have played and are thinking about their cricket. Whether that brings them an Ashes win remains to be seen, but I wouldn’t mind having Stokes in my team, I know that. Hussain : How about that last day we just witnessed at Lord’s? Ponting : It was enthralling. Amazing. I don’t think we ever saw Lord’s the way it was on Sunday. For good and bad reasons. But, again with Ben, it was a case of cometh the hour, cometh the man. He was forced to play that way again but he is able to do it. That was another amazing Ashes Test hundred but unfortunately for him and his side it wasn’t quite enough. Hussain : These had been the friendly Ashes — at least before Sunday. Players talking and laughing with each other a lot. Are you happy with that and will it all change now? Ponting : I wasn’t happy with them being friendly when I played! When I was captain I felt I was a custodian of Australian cricket and, if you like, protecting the mystique of the Australian cricket team. Perhaps these guys are realising now that we’re all the same. You’re even talking to me now in the commentary box when you probably wouldn’t have done 10 years ago! Franchise cricket has changed a lot of the atmosphere between the teams because these guys have played in the same sides around the world. Since Pat Cummins has been the captain there’s maybe been more awareness about what everyone thinks about the way Australia play their cricket and there had to be. Wind the clock back to Cape Town (Sandpapergate) and the Australian public didn’t want anything to do with their team. I’d like to think when I played we were pretty hard but fair, too. Whether these guys will have a beer at the end of each day’s play now, I’m not so sure. Bairstow's stumping caused controversy at Lord's as the crowd turned on Australia Hussain : And what did you think of that controversial Bairstow dismissal? You said off-air when it happened that Pat Cummins might have to re-think his appeal... Ponting : I just thought it would be a test for Pat. I didn’t think he had to withdraw the appeal, that’s for sure. The more clarification we’ve had about the decision, the more we know the correct call was made. It has gone down as a stumping, not a run-out. That’s all you need to know. Jonny did the wrong thing and he’s paid for it by losing his wicket in an Ashes Test. It’s as simple as that. What I would say is Alex Carey is a keeper and his job is to take catches and make stumpings. The funny thing is, if you watch the replay, Jonny is still in his crease when Carey throws the ball so Australia must have been expecting it. Hussain : Steve Smith will play his 100th Test at Headingley. Where would you rank him among Australian greats? Ponting : If it all ended tomorrow he’d be the second-greatest batsman Australia have produced after Don Bradman. Statistically, you cannot argue with that. He’s achieving things so quickly. Even at Lord’s, he became the second-fastest in history to reach 9,000 Test runs. Quickest to 32 Test hundreds, innings-wise. It doesn’t look as though he’s slowing down. He has been a bit guarded about how long he will go on for, which is a bit strange to me. He jokes about not being able to sleep. With the amount of hundreds he scores he should be able to sleep pretty easily, I reckon. Hussain : We’re going back to Headingley. We were both on commentary at the end of that remarkable day there four years ago. Ben almost did it again at Lord’s on Sunday. I’m sure we will be re-running those moments from last time on Sky, your mate Justin Langer kicking the bin… Ponting : I think Nathan Lyon took it harder than Justin to be honest with the mistake he made at the end of that game. But we had the pleasure of calling it on TV together and I don’t think I’ve ever seen a better moment in Test cricket. To see what Ben was able to do, nine down, having to hit sixes and then to pull it off… he’s done it a few times since and he almost did it to Australia again here at Lord’s. He’s such a winner. You have to do a lot right to beat him and he’s won some Tests for England that most others wouldn’t have. Hussain : I think you said, ‘Wow-ee Nasser’ on commentary at Leeds…. Ponting : I wish I could take that back actually… Share or comment on this article: Australia legend RICKY PONTING talks to our man NASSER HUSSAIN about Bazball & Bairstow's dismissal e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 21:37:47","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/22/72851005-0-image-a-43_1688504856778.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Heartbreak AGAIN as Scotland knock out Zimbabwe from Cricket World Cup","link":"https://nehandaradio.com/2023/07/04/heartbreak-again-as-scotland-knock-out-zimbabwe-from-cricket-world-cup/","keywords":["Cricket","Featured","News","Sports","ICC World Cup Qualifier","Super Six","Zimbabwe vs Scotland"],"creator":["Nehanda Radio"],"video_url":null,"description":"Scotland beat Zimbabwe by 31 runs to end the hosts' hopes of qualifying for the World Cup and move to within one game of the finals. The post Heartbreak AGAIN as Scotland knock out Zimbabwe from Cricket World Cup appeared first on Nehanda Radio.","content":"In what was a must-win game for both sides, Scotland set a total of 234-8 after being put into bat first. Zimbabwe lost four wickets for 37 runs early into their innings. And, although Ryan Burl hit an impressive 83 to put the game in the balance, Tendai Chatara was bowled by Safyaan Sharif as the hosts fell short. Sharif became the first Scot to take 100 international wickets, but it was three early wickets from man of the match Chris Sole that proved crucial. Scotland will reach the World Cup for a fourth time should they defeat Netherlands on Thursday – and could even qualify with a narrow defeat – while Zimbabwe miss out for the second finals in a row. Doug Watson’s side had finished second in the first round of qualifying behind Sri Lanka for the Super Six series and are now in pole position to progress along with them again with only two teams progressing to the finals. Scotland started impressively, with Matthew Cross, Brandon McMullen and George Munsey all breaching 30, but a mid-order collapse looked to have handed the momentum to Zimbabwe. In the end, Mark Watt’s tail-end 21 not out off the closing balls proved crucial in setting up a half-decent but reachable target for the hosts. Sole’s early wickets put Zimbabwe under increased pressure, only for home fans to sense the tide had turned as Sikandar Raza, who hit 34, and Burl piled on the runs. However, after the latter’s dismissal, it seemed only a matter of time before Scotland claimed a famous victory. Scotland captain Richie Berrington told Sky Sports: “Incredibly proud of the lads – to show the fight that we did. We knew early wickets would be key – our bowlers have been fantastic throughout this tournament. “Chris Sole has bowled a couple of fantastic spells in this tournament – it was great to see again today. “We knew there were going to be tough games and I think we can take confidence from these last two wins, but we need to be stronger again against the Netherlands. “Thursday will be another great occasion and another great event. The support from back home has been fantastic and there’s a real good unity in this group.” Zimbabwe captain Craig Ervine told Sky Sports: “We did well to restrict them to 230. Unfortunately, that opening spell from Chris Sole put us on the back foot and it was extremely tough to come back from that position. “At the end of the day, we fell short. Everybody’s really gutted. It would have been nice to put those demons from 2018 to bed, but unfortunately we didn’t. It’s a moment we’ll live with for a long time. “I’m proud of the way we played our cricket and there’s a lot of positives we can take from this tournament.”","pubDate":"2023-07-04 21:11:06","image_url":null,"source_id":"nehandaradio","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Back on the Kabaddi mat, Pawan Sehrawat determined to ‘bring home the gold India lost’","link":"https://www.thehindu.com/sport/other-sports/pawan-sehrawat-pkl-pro-kabaddi-knee-injury-rehab-asian-games-india/article67043090.ece","keywords":null,"creator":null,"video_url":null,"description":"The most expensive player in PKL history, bought by Tamil Thalaivas for ₹2.26 crore, was thrown out of action after sustaining an ACL injury during the opener of Pro Kabaddi League season 9","content":"If you go back and watch India’s matches from the recent Asian Kabaddi Championships, you’ll notice Pawan Sehrawat everywhere. He was raiding, lining up in a chain defence, attempting super tackles, giving raiders instructions before they crossed into opponent territory and more. It is hard to imagine how someone so involved in a 40-minute kabaddi encounter spent an entire season off the mat after sustaining an injury inside the first 10 minutes of the opening fixture of Pro Kabaddi League season 9. Pawan missed out on galvanising a new team (Tamil Thalaivas), and a slew of records. All that FOMO (fear of missing out) was channelled in his performances in Busan, South Korea. Pawan was crucial to India winning the gold medal, registering two Super 10s in the tournament while acting as a pivot in attack and defence. However, a few months back, he underwent a right knee operation after sustaining an ACL injury during the PKL season opener against Gujarat Giants. “I am an athlete, so I had to balance both the itches — of wanting to recover carefully and properly and battling the urge to get onto the mat,” Pawan tells The Hindu. “My injury had changed the course of results a bit. I felt I had to find a way to play. I wanted to put on a band-aid and go and play. But it was not to be.” Pawan was inspired by javelin Olympic champion Neeraj Chopra’s recovery from a potentially career-ending elbow injury and decided to approach the people who had helped the fellow Haryana athlete. “I mailed JSW from my end. The team here sorted my own personal support staff — with a physio, a trainer and a nutritionist whose backup continued even after I came home. They have a huge hand in my return to the mat,” Pawan explains. The 26-year-old is snapping at the heels of superstar raiders like Pardeep Narwal, Maninder Singh, Deepak Niwas Hooda and Rahul Chaudhari in how he hoards points game after game. Pawan is currently fifth in the all-time raiding points standings with 987 to his credit in 105 PKL games. “At the Inspire Institute of Sports in Bellary, I was assigned to Dinesh and Manish — my trainer and physio. The priorities for my time there were two-fold — one to get me back to my old fitness levels and, the other, to take that fitness a notch higher,” Pawan says. When The Hindu caught up with Pawan before PKL 7 in Chennai, he told us just how much he hated working out in the gym. “Mujhe gym pasand nahin hai — the idea of exercising on the treadmill or working with the dumbbell in a small area. I like the outdoors better. If I get a park or an open space, I will spend my time running there instead.” Today, Pawan is easily in the best shape of his life because of a curated rehab and exercise regimen which includes barbell squats and deadlifts in the gym and sprints on the track. “I have never done weight training as part of my routine before,” Pawan explains. “When I asked them about the benefits, they would say, “Pawan bhai, aapko iska benefit mat pe dikhega (you’ll see the benefits on the mat, brother).” “We worked on my core and found that parts like my shoulders were weak. So, we picked them out and worked on them specifically. I understood how important strengthening my core was to my jump,” Pawan, who is called the hi-flyer for his evasive frog jumps, says. “I jump quite well anyway but imagine, I manage that with a weak core. Working on my core made these jumps easier. Manish worked on my speed — to match the speed of my feet and footwork with my mind.” Pawan has made a few friends during his time at IIS — with triple jumper Praveen Chithravel and boxer Sachin Siwach. The banter extends to their workouts, with Praveen often calling Pawan for a round of jumps. “I have not tried the triple jump yet (laughs),” Pawan says sheepishly. “Our bonding has been fantastic — among Praveen, Sachin and me. Praveen looks lightweight but he lifts a lot more than I do. He is a great guy, very punctual about his routine. So, there is a plan to do this (a triple jump challenge) when the Bengaluru camp begins. Either he comes over or I will head to Bellary, and we will collaborate on something fun,” he adds. One consistent pain point for Pawan before a PKL season or tournament was making weight. “The limit is 85kg and I was always around the 86 to 88kg mark. I used to run and starve to reduce weight, but I now have a nutritionist to help me sort that part out. I was in touch with her until just before the Asian Championships,” Pawan explains. “The boys around me would wonder who I was constantly messaging and sending photos of every meal to, but it helped. She would ask me for a plan and ensure I stuck to it. This tournament was the first time I made weight without starving myself and losing energy,” he adds. The camp in Patna before heading to South Korea helped Pawan to shake off the cobwebs. “The challenge for me was the return to training and workouts as a team. I was working out and doing physical work before but when you are doing that individually, you can take rests according to your pace, but not when you’re in a team set up. This was a fresh experience after the six to seven-month gap due to injury and the subsequent rehab. That was a win I savoured for a while,” Pawan explains. India put on an aggressive show in Busan, taking massive leads against weaker opponents and even keeping the likes of Iran at bay with leads of over five to 10 points. Back in his Bengaluru Bulls days, erstwhile captain Rohit Kumar, in addition to rallying his forces on the mat, also had the responsibility of keeping Pawan calm in pressure situations. In a ‘how life comes full circle’ situation, Pawan took on that role for the juniors in the team during the Asian Championships. In India’s matches against Iran, he was constantly speaking to Aslam Inamdar, who tends to get a little antsy in do-or-die raids. This element of patience aside, Pawan also showed his aggressive side in Busan, taking on the Iranians when they misjudged their lines or asked for points that he felt weren’t there, enough to draw comparisons with former India cricket team captain Virat Kohli. “I don’t mean to draw that comparison). If something is wrong and I see it happening on the field, I will speak up. If someone is coming for my team, I will react. Saamne wale ko chodunga nahin (I won’t let the person before me get away). Pawan does love his cricket heroes though, and emphasises his adoration for Kohli’s friend and former teammate A.B. De Villiers. “Mr. 360,” is the first thing he says when ABD’s name comes up. “He is able to hit shots all around the park. I want that in my kabaddi. There shouldn’t be an element of the game I can’t do,” he says. Another emotion that binds this Indian squad together is disappointment. The wounds from the defeat at the 2018 Asian Games semifinals to Iran are still raw. While Pawan insists that India is not focusing on any one team, every statement of intent from the raider is about ‘bringing the gold medal back.’ “I was in the Bengaluru Bulls camp in 2018 when India lost that final. Watching those men break down and cry was a horrible memory that is etched in my mind to this day. I don’t know if they’ve ever sobbed like that again, but that shouldn’t have happened,” he remembers. “It is not only about Iran. We won’t take it easy with any team. We need to make a statement that we are better prepared than before and we’re out to regain that medal we lost in 2018. The 12, whoever it may be, will give our 200 percent at the Asian Games,” he says. “The message from my circle is simple — go play your game calmly and bring back the gold medal we lost,” Pawan says.","pubDate":"2023-07-04 19:17:26","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Assam’s Uma Chetry’s journey from humble beginnings to India colours","link":"https://www.thehindu.com/sport/cricket/assam-cricketer-uma-chetry-in-indias-tour-of-bangladesh/article67043079.ece","keywords":null,"creator":null,"video_url":null,"description":"Uma made it to the India senior women’s squad for its tour of Bangladesh","content":"Uma Chetry was barely a couple of years old when she started playing cricket at her residence in Bokakhat in Assam’s Golaghat district. While her elder siblings would play the sport on the kutcha roads of the village, she would emulate them indoors. Using a stick as a makeshift bat, Uma would send big round potatoes whizzing past unsuspecting family members as she hit fours and sixes at will. When she turned three, her mother Dipa bought her a plastic bat and a ball, and Uma made it a point to practice everyday. “We soon realised that she is fond of cricket. She would play with the local boys of her age and often discuss a thing or two with her elder brothers,” Dipa tells Sportstar. Back then, Dipa of course did not imagine that someday Uma would pursue the sport seriously and make it to India’s national squad. On Sunday evening, as Uma made it to the India senior women’s squad for its tour of Bangladesh, hard work and determination paid off for the Chetrys. “It’s an incredible feeling to see your daughter making the State proud. Things were not easy for her, but with sheer determination, she continued chasing her dreams,” Dipa says. Dipa played a significant role in her daughter’s journey too. With Uma’s father Lok Bahadur being a small-time farmer, there would be times when the family - Uma and her four brothers - would struggle to make ends meet. But that wasn’t a deterrent for the youngster. Even though not many in the village took her decision of playing with boys in the right spirit, Dipa encouraged her daughter to follow her passion. I did not want her to stop playing just because she was a girl,” Dipa says. Soon, Uma started training under local coaches - Raja Rahman and Mehboob Alam - and would travel far to train regularly. “I also told her that she should not take her studies for granted,” the mother adds. So, in the mornings, Uma would train for a while and then travel to Bokakhat Hindi High School, and again play once the school was over. Around 2011, she caught the eye of Ajoy Sarma, the treasurer of Golaghat District Sports Association. “We saw her play with boys, who were slightly older than her. But she looked quite determined and was very competitive on the field. We were quite impressed with her, and eventually, we provided her with all the support,” Sarma says. Sarma pushed her case and soon, Uma was on Assam Cricket Association’s radar. By 2017, she was part of the Assam state team. and went on to make every opportunity count. In the last domestic season, she scored 194 runs in six one-dayers, at an average of 32.33, whereas in five T20 innings, she scored 120 at a strike rate of 88.88. Her determined show earned Uma a spot in the India team for the Emerging Asia Cup in Hong Kong as well. Uma’s journey has just begun and she hopes to make every opportunity count. Onwards and upwards!","pubDate":"2023-07-04 19:02:25","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"The spirit of the game has to be taken in the right spirit","link":"https://www.thehindu.com/sport/the-spirit-of-the-game-has-to-be-taken-in-the-right-spirit/article67041358.ece","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Jonny Bairstow went for a walk with the ball still in play, and was stumped. The laws of the game say he was out. The spirit of the game suggested (not demanded, for you cannot impose the spirit on anybody) that he ought to have been recalled by Australian captain Pat Cummins. But the spirit has to be a two-way street – we shall come to that in a moment. First, let’s enjoy some of the reactions. British Prime Minister Rishi Sunak, whose rise to the top job had something to do with him stumping his predecessor, thought Australia had contravened the spirit of cricket. Australian Prime Minister Anthony Albanese said he was proud of the winning Australian men’s and women’s teams and that his country was right behind Pat Cummins and Alyssa Healy (the captain of the women’s team). It was unclear whether he (as opposed to his country) thought it was right or wrong to stump Bairstow. Former cricketers have been more forthright. Brendon McCullum, England’s coach says he will not be having a beer with the opposition any time soon. My heart bleeds for the opposition. Australia should issue a public apology, says Geoff Boycott. They doubtless will, as soon as Britain apologises to Australia for the genocide and dispossession of their indigenous peoples that came with British invasion and occupation. Were there vestiges of colonial arrogance in what England did? Are they telling Australia that fair play is what they decide it is? Is Bazball the only way to play the game? England controlled the cricketing narrative for decades till other nations – former colonies – caught up and then overtook them. And now with Bazball are they attempting to control the narrative again? If all that sounds faintly ridiculous, that’s because it probably is. A dozy batsman was stumped at a crucial point in a Test and it becomes a battle between the stiff upper lip and the suntanned limb. In identical circumstances, England would have done the identical thing. Had the ball missed the stumps, wouldn’t Bairstow have attempted a single? Sadly, the ‘spirit’ usually comes accompanied by hypocrisy, which is why there is a cry for removing the grey areas in the laws. Cricket is unique in that it gives individuals and teams a chance to make moral choices that are in areas beyond the laws. Making the laws water tight is not a solution, for the ambiguity between what is legal and what is sportsmanlike is what reveals character. And cricket is about revealing character; players must be given an opportunity to choose. Despite the change in emphasis in the law on running out a non-striker backing up, some bowlers will still not do it. Bairstow wasn’t attempting a single, but he is an experienced international batsman who ought to have known better. Would he have gone for a walk had a spinner been bowling and Alex Carey had been standing up to the wicket? It is surprising how international players are ignorant (or affect to be) of the laws of the game. Australia were upset when the catch Mitchell Starc took was disallowed because he dragged the ball on the ground. Either they don’t know the law or feel it has to be ‘My country right or wrong’, a dangerous attitude on a sports field. Which brings us to the spirit being a two-way street. It might have been good PR for Cummins to recall Bairstow, and let us assume he did, in the interests of the ‘spirit’ (a good thing to have in the game, but now being increasingly ridiculed). What ought to be Bairstow’s response then? For the spirit to work as it should, Bairstow would then have to throw his wicket away next ball. He was out legally, then given a reprieve by the ‘spirit’, and now he ought to return ‘spirit’ with ‘spirit’. You can argue this will be against the interests of his team, but then so was setting out for a walk with the ball still in play. Did no one in the team — captain, players, coaching staff — notice that Bairstow had done it before and ought to be told? Another problem with the spirit is that it often takes focus away from the performances — in this case Australia’s all-round superiority, and Ben Stokes’s stunning century. Controversy never hurt the gates, though.","pubDate":"2023-07-04 19:00:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"A wicketkeeper’s take on stump-gate and the spirit of cricket","link":"https://www.brisbanetimes.com.au/sport/cricket/a-wicketkeeper-s-take-on-stump-gate-and-the-spirit-of-cricket-20230704-p5dlny.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Darren Berry"],"video_url":null,"description":"I’ve been asked several times in the past few days if I ever did such a thing. I have, and I would do it again, writes Darren Berry.","content":"Plenty has been said and written in the past 48 hours after tensions boiled over between Australia and England at Lord’s on Sunday evening. In short, Australian wicketkeeper Alex Carey completed a clever piece of work to stump English counterpart Jonny Bairstow off the bowling of Cameron Green. Was it within the rules and laws of the game? A hundred per cent it was. Sadly, the incident of brilliance by Carey sparked a firestorm that will be forever remembered in Ashes folklore, just as Stuart Broad will always be remembered for refusing to walk when he edged to first slip off Ashton Agar at Trent Bridge a decade ago. Although it appears Broad himself may have forgotten that incident, given how he behaved in the aftermath of Bairstow’s dismissal, which he described as “literally the worst thing I’ve ever seen in cricket, that”. I’d suggest move on, big boy, unless you really want to talk about the grey area that is the spirit of cricket. Not walking off after smashing the ball to slip was deplorable. Carey’s act of astute game awareness was not only within the laws but also within the spirit of the game. It appears the new governor of the spirit of cricket (whatever that is) English coach Brendon McCullum, who is a fine man, also took umbrage at the incident and was reported to have said he wouldn’t be having a beer any time soon with the Australians. Brendon, it appears you, too, have a short memory. You say you have grown up since those dark days when you did exactly the same thing to stump England batter Paul Collingwood , who is now your assistant coach. I hesitate to mention the run out of Muttiah Muralitharan when he was simply going to congratulate Kumar Sangakkara on a fine century. I’ve been asked several times in the past few days if I ever did such a thing. I have, and I would do it again. As long as it’s within the laws of the game it’s fair game. Carey did not pause and wait for Bairstow to leave his crease. He simply anticipated and executed a beautiful throw from a distance with his gloves on, a delicate skill in itself. He had been watching the dozy Bairstow and was ready to swoop just as any sharp-minded ’keeper should. The ball is alive until the umpire calls the end of the over or the ball has been registered as dead ball. The ball was live, but Bairstow wasn’t. How ironic that Bairstow tried the same thing on day three in an attempt to stump Marnus Labuschagne when he stood back to Jimmy Anderson. If he had executed that skill, rather than missed the stumps, would the righteous Ben Stokes have upheld the appeal? He said post-match he wouldn’t but who knows if we ever will find out the true answer to that question. What actually is the spirit of the game? Maybe we should ask those fine gentleman, the members of the Marylebone Cricket Club at Lord’s. I’m sure they are aware of how to uphold the spirit of the game and behave accordingly in all situations. I’ve been privileged and honoured to be at Lord’s on several occasions both as a player and coach and the walk through the Long Room is a beautiful tradition of the game. It’s unique and I would hate for that to ever change. Again, the minority spoil it for the majority. ‘I’d suggest move on, big boy, unless you really want to talk about the grey area that is the spirit of cricket. Not walking off after smashing the ball to slip was deplorable.’ Darren Berry Carey has been outstanding at his wicketkeeping craft in this series standing back to the fast men and even more impressive over the stumps. His leg-side stumping of Zak Crawley at Lord’s was a thing of beauty that brought a smile to the ’keeping brethren. Bairstow has been a liability to the English team and the sooner they reinstate the best keeper in England, Ben Foakes, the better off they will be. No doubt Bairstow is a fine batsman, a game changer. His position in the team is not in question but his role in it certainly is. His footwork to the fast bowlers has been non-existent, his diving as result disjointed and awkward. His work up to the stumps has many club cricketers scratching their heads in bewilderment. Loading It’s been hard to watch, to be brutally honest. This Ashes series so far has been enthralling. It came to life perhaps for the wrong reasons at Lord’s, but it has lit a wildfire for the next encounter at Headingley, where Stokes ripped our hearts out a few years ago. He almost did it again at Lord’s on Sunday. He is an inspirational leader and an amazing cricketer. Darren Berry is a former Victorian captain and wicketkeeper who played 153 first class matches and was reserve wicketkeeper for the 1997 Ashes tour. Save Log in , register or subscribe to save articles for later. License this article The Ashes Australian cricket England Test cricket Opinion Darren Berry is a columnist. Most Viewed in Sport Loading","pubDate":"2023-07-04 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"}]}