{"newsArray":[{"title":"Supplementary panel Â­match officials to get retainers: PCB","link":"https://www.thenews.com.pk/print/994646-supplementary-panel-match-officials-to-get-retainers-pcb","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: The Pakistan Cricket Board on Sunday confirmed that it has introduced retainers for its Supplementary Panel match officials.\"As such, all 23 match officials, including 15 umpires and eight match referees, in the panel will receive a monthly retainer of Rs25,000 during the 2022-23...","content":null,"pubDate":"2022-09-26 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Pak middle order inconsistent, concedes Nadeem","link":"https://www.thenews.com.pk/print/994640-pak-middle-order-inconsistent-concedes-nadeem","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: The Pakistan Cricket Board Director High Performance and former international cricketer Nadeem Khan on Sunday conceded that there is no “consistency” in the middle order of Pakistan cricket team and said the Board was working to create better options through domestic...","content":null,"pubDate":"2022-09-26 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Pakistan first team to play 200 T20 Internationals","link":"https://www.thenews.com.pk/print/994643-pakistan-first-team-to-play-200-t20-internationals","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Pakistan’s batting coach Mohammad Yousuf has said if T20 cricket is played “properly” and with techniques then good performances can be created.“I think T20 is being promoted vigorously and my point of view is if this format is played properly then performances...","content":null,"pubDate":"2022-09-26 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"PCB confirms hiring six foreign coaches","link":"https://www.thenews.com.pk/print/994642-pcb-confirms-hiring-six-foreign-coaches","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: The Pakistan Cricket Board on Sunday confirmed that six foreign coaches, including two former international players from England, have been roped in to work with the domestic teams during the forthcoming domestic season which will begin with the Quaid-e-Azam Trophy this...","content":null,"pubDate":"2022-09-26 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"PCB BoG endorses PJL","link":"https://www.thenews.com.pk/print/994644-pcb-bog-endorses-pjl","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: The Board of Governors of the Pakistan Cricket Board has endorsed the complete ownership of the inaugural edition of the Pakistan Junior League by the PCB.The BoG supported the concept of the league which revolves around creating an opportunity for future generation of cricketers,...","content":null,"pubDate":"2022-09-26 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"DHA Dabangs win KTPL 2","link":"https://www.thenews.com.pk/print/994650-dha-dabangs-win-ktpl-2","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: DHA Dabangs won the season 2 of Karachi Tapeball Premier Cricket League by defeating favourites Clifton Ghazis by 35 runs in the final on Sunday.Former Pakistan captain Younis Khan was the chief guest at the final who distributed prizes. Taimur Mirza of Gulshan Gohar was adjudged the man...","content":null,"pubDate":"2022-09-26 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"PCB signs deal with Faysal Bank","link":"https://www.thenews.com.pk/print/994652-pcb-signs-deal-with-faysal-bank","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: The Pakistan Cricket Board has entered into a strategic partnership with Faysal Bank in a bid to continue to strengthen the cricketing foundations in the country.Through this partnership, Faysal Bank will support the PCB Grassroots Cricket Development Programme. This programme will...","content":null,"pubDate":"2022-09-26 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Green makes mockery of baffling World Cup snub","link":"https://wwos.nine.com.au/cricket/australia-vs-india-3rd-t20-cameron-green-world-cup-snub-questioned-after-starring-role/3c0cda95-299c-4e95-b6b1-2caafe0c9a92","keywords":null,"creator":["wwos"],"video_url":null,"description":"An \"astonishing\" knock from Cameron Green has once again raised questions over his bizarre omission from the T20 World Cup.","content":"Cameron Green 's starring role against India has once again raised questions over his omission from Australia's squad in the upcoming T20 World Cup .﻿ While Indian star Suryakumar Yadav’s rapid half-century led India to a six-wicket win in the series decider , Green once again impressed at the top of Australia's order. The 23-year-old ﻿joined David Warner and Glenn Maxwell as the only Australians to reach a half-century in under 20 deliveries, reaching the milestone in just 19 balls before he was dismissed for 52 off just 23 balls. READ MORE: Rabbitohs star confronts Panthers trainer in fiery scenes﻿ READ MORE: Suaalii's 'huge' World Cup decision praised﻿ READ MORE: Brisbane Lions' emphatic stance behind under-fire coach﻿ Green's half-century was his second in the three-match series, and prompted questions about why he was left out of Australia's 15-man squad﻿ for the home World Cup which begins next month. \"It's a proper conundrum,\" former Australian star Brad Hodge told ESPN cricinfo of Green's World Cup snub. \"﻿This is an exciting talent, no doubt about it. He will probably go on to be one of the best players Australia has ever produced. He's shown what he's got in his kit bag, not only in Test cricket, but in T20 cricket as well. \"There will be a few IPL teams that have seen something they might like in the future as well. \"Having not been selected in the initial squad with how he's playing, it's a challenge for Australia. \"His aggression at the top was impressive and his bowling and fielding was also impressive. \"If it's possible, I'm sure the Australian unit will have to look at Cameron Green (for the World Cup). He's in form, he's hitting the ball well, and there's not too many players in the world at the moment that can take down the likes of (Jasprit) Bumrah, Axar Patel, and Bhuvneshwar Kumar.\" Yadav smacked 69 off 36 balls and put on 104 runs with Virat Kohli (63 off 48) off 62 deliveries as India chased down the target of 187 with one ball to spare. Earlier at the Rajiv Gandhi International Stadium, India won the toss and asked Australia to bat first in the third T20. Australia scored 7-186 thanks to quick-fire half-centuries from Green and Tim David (54). Australia won the first T20 in Mohali by four wickets and the hosts had won the curtailed second game in Nagpur by six wickets. A capacity crowd watched the game as international cricket returned to the venue for the first time since February 2019. Chasing a competitive 187, India lost both openers early. KL Rahul (1) and captain Rohit Sharma (17) were out with the score at 2-30 in 3.4 overs. Kohli then anchored the Indian innings with a relatively sedate half-century. He hit three fours as well as four sixes. But the impetus came from Yadav, who stunned the Australian bowling with five sixes and another five fours. Yadav got to his half-century off 29 balls as the duo brought up 50 in 32 balls. Yadav scored 115 runs in the series and was named man of the match. “I am liking batting at No.4. There will be tough challenges but I am willing to express myself and be smart about my shot selection,\" Yadav said. \"In that situation, I feel I can take my chances.” Josh Hazlewood (1-40) got the breakthrough to leave India at 3-134 and needing 53 off the last six overs. It only managed 21 runs in the 18 balls after Yadav was caught by Australia captain Aaron Finch. Kohli and Hardik Pandya (25 not out) combined for a crucial 48 runs with Kohli out in the final over, caught by Finch off Daniel Sams (2-33). It was India’s 21st win in 29 T20s in 2022, the most victories in the format by any team in a calendar year. Pakistan held the previous record with 20 wins in 29 matches in 2021. “We needed wickets. We cannot beat India by containing their batting. It was a really good series against a world-class side before the T20 World Cup,\" Australian skipper Aaron Finch said. \"It was great for a young player like Cameron Green to have such an impact with his ultra-aggressive approach.” Before heading to the T20 World Cup, India will host South Africa in a three-match series starting September 28. Australia will head home to play West Indies and England in five T20s before the World Cup gets underway in Australia on October 16. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","pubDate":"2022-09-25 22:38:38","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/09/456666/sportcricket.png","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND vs AUS 2022: Record Alert! Virat Kohli eclipses Rahul Dravid to become the second-highest run scorer for India in international cricket","link":"https://www.sportskeeda.com/cricket-news/news-ind-vs-aus-2022-virat-kohli-breaks-rahul-dravid-s-record?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket News"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-25 21:28:32","image_url":"https://static.sportskeeda.com/editor/2022/09/6d5d4-16641283621303-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"“What a game of cricket this is”: £1.125M Liam Livingstone rejoices despite England losing 4th Karachi T20I vs Pakistan","link":"https://thesportsrush.com/cricket-news-what-a-game-of-cricket-this-is-1-125m-liam-livingstone-rejoices-despite-england-losing-4th-karachi-t20i-vs-pakistan/","keywords":["Cricket","England","England tour of Pakistan 2022","Liam Livingstone","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Liam Livingstone rejoices: The English batter appears to have enjoyed a fascinating match of cricket involving his team. Pakistan have somehow managed to not let England build on their lead in the ongoing seven-match T20I series. Having won the recently concluded fourth T20I in Karachi by a narrow margin of 3 runs, Pakistan have leveled… The post “What a game of cricket this is”: £1.125M Liam Livingstone rejoices despite England losing 4th Karachi T20I vs Pakistan appeared first on The SportsRush.","content":"Liam Livingstone rejoices: The English batter appears to have enjoyed a fascinating match of cricket involving his team. Pakistan have somehow managed to not let England build on their lead in the ongoing seven-match T20I series. Having won the recently concluded fourth T20I in Karachi by a narrow margin of 3 runs, Pakistan have leveled the series 2-2 with three more matches to be played in Lahore. An enthralling match of cricket comprised of multiple ebbs and flows before the hosts registered a victory with four balls to spare. With bowling figures of 4-0-32-3, Pakistan fast bowler Haris Rauf was not only the pick of their bowlers but also bagged his second T20I match award. While all-rounder Mohammad Nawaz dismissed three batters to aid Rauf, the pair was also helped by other fast bowlers in Mohammad Hasnain and Mohammad Wasim picking two and one wicket respectively. An all-round bowling performance was just what the doctor had ordered for Pakistan while defending a 167-run target. It was due to a collective bowling effort that Pakistan were able to bundle out England for 163 in 19.2 overs. Liam Livingstone rejoices despite England losing 4th Karachi T20I vs Pakistan England batter Liam Livingstone, who isn’t part of the current squad due to an ankle injury, took to social media platform Twitter to share his feelings about the match. It was evident from Livingstone’s short and crisp tweet that the 29-year old player enjoyed a fascinating contest without being affected by his team losing at the National Stadium tonight. What a game of cricket this is #PAKvsENG — Liam Livingstone (@liaml4893) September 25, 2022 Pakistan vs England third T20I was indeed a belter which required England to score 45 runs in four overs to win the match. In spite of the situation getting reduced to them requiring only nine runs in two overs to gain a 3-1 lead, England ended up on the losing side losing all-rounder Liam Dawson (34) and pacers Olly Stone (0) and Reece Topley (0) withing six deliveries. Dawson, in particular, single-handedly turned the tables on the back of hitting five fours and a six at a strike rate of 200 after coming in to bat at No. 8 in the 15th over. The 32-year old player was visibly disappointed for failing to secure a victory even after doing all the hard work. Will Liam Livingstone take part in ICC T20 World Cup 2022? Yes. Readers must note that Livingstone is a part of England’s World Cup squad and that he will board the plane to Australia. Livingstone, whose last competitive match was played during The Hundred 2022 a month ago, had registered a breakout Indian Premier League season with Punjab Kings earlier this year. ALSO READ: Is Liam Livingstone married? Livingstone, who was bought by Kings for INR 11.50 crore (£1.125M) to be among the most costliest players of IPL 2022 auction, had scored 437 runs (11th highest IPL 2022 run-scorer) in 14 IPL 2022 innings at an average of 36.41 and a strike rate of 182.08 with the help of four half-centuries. The post “What a game of cricket this is”: £1.125M Liam Livingstone rejoices despite England losing 4th Karachi T20I vs Pakistan appeared first on The SportsRush.","pubDate":"2022-09-25 20:16:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Suryakumar Yadav & Virat Kohli feast on Aussie bowling unit","link":"https://www.cairnspost.com.au/sport/cricket/suryakumar-yadav-virat-kohli-feast-on-aussie-bowling-unit/video/e0bf16a3316910f5e0a91bcffc63af19","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Suryakumar Yadav and Virat Kohli were at their best as they led India to a 6-wicket win against Australia in the 3rd T20I.","content":null,"pubDate":"2022-09-25 19:36:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Bond between these two is beyond perfection”: Amit Mishra takes pleasure in Virat Kohli and Rohit Sharma hugging each other post Hyderabad win vs Australia","link":"https://thesportsrush.com/cricket-news-bond-between-these-two-is-beyond-perfection-amit-mishra-takes-pleasure-in-virat-kohli-and-rohit-sharma-hugging-each-other-post-hyderabad-win-vs-australia/","keywords":["Cricket","Amit Mishra","Australia tour of India 2022","Rohit Sharma","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Amit Mishra takes pleasure in Virat Kohli and Rohit Sharma as the duo was all pumped up after Hardik Pandya hit the series winning boundary. Team India has defeated Australia by 6 wickets in the third and final T20I in Hyderabad, to win the three-match series 2-1, as they continue with their stellar record while… The post “Bond between these two is beyond perfection”: Amit Mishra takes pleasure in Virat Kohli and Rohit Sharma hugging each other post Hyderabad win vs Australia appeared first on The SportsRush.","content":"Team India has defeated Australia by 6 wickets in the third and final T20I in Hyderabad, to win the three-match series 2-1, as they continue with their stellar record while chasing in the format, especially in the past couple of years. En route a stiff target of 187 runs, a match-winning century stand – 104 runs off 62 deliveries, for the third wicket between Virat Kohli (63 off 48) and Suryakumar Yadav (69 off 36), helped India register their fourth-highest successful run-chase in the format against the Aussies. Suryakumar’s innings in particular, was instrumental in bringing the required run rate significantly down, as India struggled a bit post his dismissal, while chasing the total down only on the penultimate delivery. : Ultimately, the 32-ball 48-run stand for the next wicket between Kohli and Hardik Pandya (25* off 16), saw them over the line, with the latter hitting the winning boundary. With 11 required off the final Over, Kohli hit a stunning Six off Daniel Sams, but perished on the very next delivery. Post his dismissal, he was seen sitting on the staircase which perhaps led towards the dressing room, alongside skipper Rohit Sharma, and Harshal Patel (behind the duo). The moment after Pandya hit the winning runs on the penultimate delivery, a pumped-up Kohli was seen patting Rohit multiple times on his right thigh in sheer joy, as the two then hugged each other, while celebrating yet another home series victory. Former India leg-spinner Amit Mishra took to his social media handle, to post the video clip of the aforementioned moments between the star India batters, while urging the fans to perhaps stop believing in the myriad sorts of reports which have claimed of having rifts between the two not so long ago. The bond between these two is beyond perfection. Fans should understand this. — Amit Mishra (@MishiAmit) For more Cricket-related news, click","pubDate":"2022-09-25 19:20:48","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Australia: Rohit backs Bumrah, Harshal, says 'they'll take some time to return to their best'","link":"https://www.thehansindia.com/sports/cricket/india-vs-australia-rohit-backs-bumrah-harshal-says-theyll-take-some-time-to-return-to-their-best-763123","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India defeated Australia by six wickets in the third T20IRohit Sharma and Co sealed the series 2-1Axar Patel was Player of the Series for finishing with 8 wickets","content":"India captain Rohit Sharma has backed Harshal Patel and Jasprit Bumrah, saying the pacers will \"take some time\" to return to their best. Harshal and Bumrah, who are returning from injury, recently missed India's Asia Cup campaign because of injury. Bumrah featured only in the second and third T20Is against Australia, where he managed just one wicket. Harshal, who played all the three T20Is, also bagged just one scalp. Thanks to Suryakumar Yadav and Virat Kohli's third-wicket partnership of 104 runs, India successfully chased down Australia's target of 187 in the third T20I on Sunday in Hyderabad. With that, Rohit and Co sealed the three-match T20I series 2-1. Rohit, who struck a six and two fours in his knock of 14-ball 17, called Hyderabad a \"special place.\" \"It's a special place. We have had great memories playing for India and when I played for Deccan Chargers as well. The biggest positive was different individuals stepping up and delivering. You feel good about it as management,\" said Rohit. The Indian skipper also pointed out that the margin of error in T20 cricket is small but his side was brave enough to take their chances against world champions Australia in the third T20I. \"Margin of error in T20s is small. We took our chances, we were brave as well. Sometime it doesn't come off. There are areas to improve as well. Not easy coming back after a break against a tough team. They (Bumrah and Harshal) will take some time. Hopefully they can get back into their groove in the next series,\" the Indian skipper added further. Axar Patel, who has been selected for the T20 World Cup in place of Ravindra Jadeja, had a fantastic series against Australia. He was named the Player of the Series for finishing the series with eight wickets in three games. The next best bowler was Australia's Nathan Ellis with three wickets. \"When you do well and the team wins the series, it feels great. I try to back myself with the line and lengths I bowl and even if the batter takes me on I back myself,\" said Axar after receiving the PoS award on Sunday. Kohli and Surya scored a half-century each and played vital roles in India's win on Sunday. India vs Australia: My mindset is clear, loving at No. 4, says Suryakumar Yadav But it was the Mumbai batsman who stole the show yet again with his strike rate of close to 200 as he struck five sixes and five fours in his 36-ball 69. Kohli, meanwhile, scored a 48-ball 63. Surya was named the Player of the Match for his half-century, which was his seventh fifty in the T20Is for India. \"In that situation, I thought let me take my chance. I had two-three shots in mind but I tried to hit over mid-off only. My mindset is pretty clear. Loving it at No. 4. There will be a tough challenge but you got to express yourself and be a little smart as well,\" said Surya. CHAMPIONS 🇮🇳💙 pic.twitter.com/GkbichKpDa Surya also received praises from Kohli, who said the No. 4 batsman has \"got the gift of timing.\" \"He [Surya] has the game to bat under any sort of situation and any condition. He has shown that already. He got a hundred in England, he batted beautifully in the Asia Cup. Here, he's striking the ball as well as I have seen him strike. For the past six months, he's been outstanding. It's the array of shots and to play those shots at the right time is such a tremendous skill. He's a guy who knows his game inside out. He's got the gift of timing and I was in awe watching him play his shots,\" Kohli said of Surya on Sunday. Meanwhile, Australia captain Aaron Finch admitted that his side was \"sloppy\" with bat and ball at times. \"It was a really good series. The way we fought back was fantastic. Really with a young player like Green have such an impact. We had to get wickets, can't beat India by containing. At times we were sloppy with bat and ball, but playing a tight series like this against a World Class side is going to keep the guys in good stead. I loved the way he took the game on with his ultra-aggressive approach,\" said Finch after the game in Hyderabad.","pubDate":"2022-09-25 19:16:36","image_url":"https://assets.thehansindia.com/h-upload/2022/09/25/500x300_1313849-cric.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"3rd T20I: Crowd swells to 45,354 as India vs OZ match goes off without any incident","link":"https://www.thehansindia.com/sports/3rd-t20i-crowd-swells-to-45354-as-india-vs-oz-match-goes-off-without-any-incident-763112","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":"Watching cricket matches in India is a nightmare for fans as the stadiums lack adequate facilities and the stands are jam-packed and uncomfortable.","content":"Hyderabad: Watching cricket matches in India is a nightmare for fans as the stadiums lack adequate facilities and the stands are jam-packed and uncomfortable. Their troubles start from the time of procuring the tickets and continue even after the match is over as they have to negotiate through heavy traffic late in the night to reach home. But most of the time, the fans once they manage to get into the stadium, enjoy their time and also make it a memorable experience for the players by making a lot of noise, cheering for their teams, and also appreciating good efforts by the opponent team and sporting gestures. The series-deciding 3rd T20I of the 2022 Series between India and Australia at Hyderabad is a case in point as the fans troubles started at the time of buying tickets when they caused a stampede at the Gymkhana Grounds in the city on Thursday in which seven persons were injured. Only a handful of fans got tickets, which were earlier sold online and were said to be sold out in 20 minutes. The Hyderabad Cricket Association (HCA), under pressure from various quarters as the clamour for tickets grew into a gigantic crescendo, made a few thousand tickets available offline. They mishandled things as thousands of fans gathered hoping to purchase tickets for the first international match in the City since 2019. A stampede ensued and the police had to resort to lathi-charge to control the mob. Seven persons were injured in the incident. The incidents on Thursday had raised concerns over Sunday's match and the police had made stringent security arrangements for Sunday's match at the Rajiv Gandhi Stadium here. But the match went off without any major incident as fans had a gala time, despite the hassles they faced due to the heightened security. When the first ball was bowled, there were 32,459 people inside the stadium and as the Australian innings progressed, the numbers swelled to 45,004 towards the midway. At the start of the Indian innings around 9.30 pm, the organisers announced that there were 45,354 fans inside the stadium, filling it to the rafters. Overall, the crowd was well behaved and enjoyed the match without any incidents, cheering the interesting game of cricket.","pubDate":"2022-09-25 18:58:17","image_url":"https://assets.thehansindia.com/h-upload/2022/09/25/500x300_1313841-stadium.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"End of an era, BCCI says after Jhulan Goswami’s retirement","link":"https://kashmirreader.com/2022/09/26/end-of-an-era-bcci-says-after-jhulan-goswamis-retirement/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"NEW DELHI: The BCCI has described Jhulan Goswami’s two decade-long international career as “monumental”, saying an era has come to an end with the retirement of one of women’s cricket’s greatest players. The 39-year-old Jhulan retired from international cricket following the conclusion of the ODI series in England, in which the visitors secured a first-ever […]","content":"NEW DELHI: The BCCI has described Jhulan Goswami’s two decade-long international career as “monumental”, saying an era has come to an end with the retirement of one of women’s cricket’s greatest players. The 39-year-old Jhulan retired from international cricket following the conclusion of the ODI series in England, in which the visitors secured a first-ever clean sweep to give the legendary seamer a fitting farewell. In an international career spanning over two decades – the second longest in women’s international cricket – Jhulan, who made her debut in 2002, represented India in 12 Tests, 204 ODIs and 68 T20Is, picking 355 wickets across formats. “With Jhulan announcing her retirement from international cricket, an era has come to an end. She took immense pride in representing India and always put her best foot forward as she served Indian cricket with distinction,” BCCI president Sourav Ganguly said in a press release. “She was the leader of India’s bowling attack and her feats will continue to inspire the present and budding cricketers. Her contribution to the game has been monumental. “While her inspiring presence on the field will be missed, her achievements will continue to motivate the upcoming cricketers,” Ganguly added. Jhulan, who went on to play five ODI World Cups — 2005, 2009, 2013, 2017 and 2022 — remains the leading wicket-taker in the history of the Women’s World Cups. She also remains the only pacer in women’s cricket to have 250-plus wickets in ODIs. BCCI secretary Jay Shah said: “Jhulan Goswami is one of the greatest to have ever graced the game. She, with her exceptional bowling skills, led India’s bowling attack with élan for numerous years and will remain a benchmark for the young cricketers who wish to represent the country at the highest level. “As she embarks on a new journey and starts a new inning, I wish her all the very best.” In her farewell game, Jhulan finished with excellent figures of 2/30 in her full quota of 10 overs, including three maiden overs. The competitive Indian has seen the game evolve during her long journey that was marked with some unforgettable moments and few unpleasant days, something that the board’s treasurer Arun Singh Dhumal also observed. “As women’s cricket continued to grow in the country, Jhulan Goswami, along with Mithali Raj, remained at the forefront. Jhulan never shied away from going that extra mile, be it with her performances on the field or be it for the preparations to seek excellence,” said Dhumal. “Her stellar achievements and tremendous work ethics were there for everyone to see and her outstanding contributions towards our game will continue to inspire her teammates and budding cricketers.” PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-09-25 18:51:14","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Late drama as Pakistan level T20 series against England","link":"https://www.thestar.com.my/sport/cricket/2022/09/26/cricket-late-drama-as-pakistan-level-t20-series-against-england","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Mohammad Rizwan scored a fluent 88 and Haris Rauf and Mohammed Nawaz took three wickets each as Pakistan edged England by three runs in a rollercoaster finish to the fourth Twenty20 in Karachi on Sunday to square the seven-match series at 2-2. Read full story","content":"(Reuters) - Mohammad Rizwan scored a fluent 88 and Haris Rauf and Mohammed Nawaz took three wickets each as Pakistan edged England by three runs in a rollercoaster finish to the fourth Twenty20 in Karachi on Sunday to square the seven-match series at 2-2. In a topsy-turvy contest, Liam Dawson threatened to snatch victory from Pakistan when he took 24 runs over off Muhammad Hasnain in the 18th over, but the hosts held their nerve with a gritty bowling display at the death. Rauf (3-32) removed Dawson (34) and Olly Stone off successive deliveries in the penultimate over before Pakistan ran out Reece Topley to claim an unlikely win, triggering euphoric scenes at the National Stadium. Earlier, Rizwan lived up to his billing as the world's top-ranked T20 batsman, hitting nine fours and a six in his 67-ball knock as he shared a 97-run stand for the opening wicket with captain Babar Azam and put his side on track for a big total. The Pakistan middle-order, however, faltered again with Shan Masood (21) and Khushdil Shah (2) falling cheaply as England restricted the hosts to 166-4 despite a late flurry from Asif Ali (13 not out). England got off to a horror start when they lost their first three wickets in the first two overs - two of them going to Hasnain (2-40) - before the in-form pair of Ben Duckett and Harry Brook set about to revive the chase. Duckett perished for a well-struck 33, but Brook (34) and skipper Moeen Ali (29) kept England in the hunt before Nawaz (3-35) and Mohammad Wasim (1-30) delivered a double blow to put Pakistan in command. The teams now head to Lahore for the fifth game on Wednesday. (Reporting by Dhruv Munjal in Bengaluru; Editing by Hugh Lawson)","pubDate":"2022-09-25 18:49:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/09/26/1751616.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"‘Jhulan will remain a benchmark for young cricketers’","link":"https://www.thenorthlines.com/jhulan-will-remain-a-benchmark-for-young-cricketers/","keywords":["Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies The BCCI has described Jhulan Goswami’s two decade-long international career as “monumental”, saying an era has come to an end with the retirement of one of women’s cricket’s greatest players. The 39-year-old Jhulan retired from international cricket following the conclusion of the three-match ODI series in England, in whichIndia secured a first-ever clean sweep […] The post ‘Jhulan will remain a benchmark for young cricketers’ appeared first on Northlines.","content":"Agencies The BCCI has described Jhulan Goswami’s two decade-long international career as “monumental”, saying an era has come to an end with the retirement of one of women’s cricket’s greatest players. The 39-year-old Jhulan retired from international cricket following the conclusion of the three-match ODI series in England, in whichIndia secured a first-ever clean sweep to give the legendary seamer a fitting farewell. In an international career spanning over two decades – the second longest in women’s international cricket – Jhulan, who made her debut in 2002, represented India in 12 Tests, 204 ODIs and 68 T20Is, picking 355 wickets across formats. “With Jhulan announcing her retirement from international cricket, an era has come to an end. She took immense pride in representing India and always put her best foot forward as she served Indian cricket with distinction,” BCCI president Sourav Ganguly said in a press release. “She was the leader of India’s bowling attack and her feats will continue to inspire the present and budding cricketers. Her contribution to the game has been monumental. “While her inspiring presence on the field will be missed, her achievements will continue to motivate the upcoming cricketers,” Ganguly added. Jhulan, who went on to play five ODI World Cups — 2005, 2009, 2013, 2017 and 2022 — remains the leading wicket-taker in the history of the Women’s World Cups. She also remains the only pacer in women’s cricket to have 250-plus wickets in ODIs. BCCI secretary Jay Shah said: “Jhulan Goswami is one of the greatest to have ever graced the game. She, with her exceptional bowling skills, led India’s bowling attack with elan for numerous years and will remain a benchmark for the young cricketers who wish to represent the country at the highest level. “As she embarks on a new journey and starts a new inning, I wish her all the very best.” In her farewell game, Jhulan finished with excellent figures of 2/30 in her full quota of 10 overs, including three maiden overs as India whitewashed England 3-0 in the ODI series.The post ‘Jhulan will remain a benchmark for young cricketers’ appeared first on Northlines.","pubDate":"2022-09-25 18:37:14","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Clutch India hold their nerve in decider against Aussies","link":"https://www.cairnspost.com.au/sport/cricket/clutch-india-hold-their-nerve-in-decider-against-aussies/video/1dd794971edae299ab01420421924933","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Led by Virat Kohli and Hardik Pandya, India have held their nerve to win the third T20I and the series against Australia.","content":null,"pubDate":"2022-09-25 18:36:21","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"RC Migrants, DYSS organising historic sports event in migrant institutions","link":"https://www.thenorthlines.com/rc-migrants-dyss-organising-historic-sports-event-in-migrant-institutions/","keywords":["Jammu","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL CorrespondentJammu, Sept 24: Relief Commissioner (RC) Migrants and the Department of Youth Services and Sports (DYSS) is jointly organising first of its kind rather historic sports event in various sports disciplines in the migrant schools from September 28 to October 2, 2022. This sporting extravaganza is being held in five disciplines of sports including […] The post RC Migrants, DYSS organising historic sports event in migrant institutions appeared first on Northlines.","content":"NL Correspondent Jammu, Sept 24: Relief Commissioner (RC) Migrants and the Department of Youth Services and Sports (DYSS) is jointly organising first of its kind rather historic sports event in various sports disciplines in the migrant schools from September 28 to October 2, 2022. This sporting extravaganza is being held in five disciplines of sports including Cricket, Chess, Tug of War, Yoga and Ludo to be played at different venues. As per the circulars issued by the Joint Director Youth Services and Sports Jammu, Atul Kumar (JKAS) and District Youth Services and Sports Officer Jammu, Sukhdev Raj Sharma, the venues include Sports Stadium Jagti (Cricket and Tug of War), GHSS Camp Roopnagar Muthi (Chess), GHSS Camp Purkhoo (Ludo) and Muthi Camp, Purkhoo Camp & Community Hall L. No-14 Jagti (Yoga). “Cricket for open category boys will be held from September 28 to October 1, while Tug of War, Ludo and Chess will be held on September 28, 29 and 30 respectively and Yoga will be performed on September 30, October 1 and October 2,” informed Atul Kumar. He said DYSSO Jammu has framed various committees to hold the event in a befitting manner, adding the committees include Organising Committee, Technical Committee, Registration Committee, Medical Committee, Equipment Committee and Publicity Committee. It is pertinent to mention here that this sporting event is a brainchild of Relief Commissioner Migrants, KK Sidha being executed by Joint Director Sports (J), to serve a twin purpose of celebrating Navratra Festival in unique fashion and involving migrant youth in sporting activities to not to fall prey to drugs and other allied social evils and not to derail from the mainstream. Joint Director Youth Services and Sports (J) is the Chairman of the event, while DYSSO Jammu is the Secretary and Zonal Physical Education Officer (ZPEO) Dansal, Veena Tickoo is the Organising Secretary. Meanwhile, reviewing the arrangements Atul Kumar has served strict instructions to the Organising Secretary, besides Conveners and Co-Conveners with regard to holding the event in a professional manner.The post RC Migrants, DYSS organising historic sports event in migrant institutions appeared first on Northlines.","pubDate":"2022-09-25 18:33:23","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Yadav, Kohli power India to T20 series win over Australia","link":"https://www.thestar.com.my/sport/cricket/2022/09/26/cricket-yadav-kohli-power-india-to-t20-series-win-over-australia","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Suryakumar Yadav and Virat Kohli struck half centuries as India beat Australia by six wickets in their third and final Twenty20 International in Hyderabad on Sunday to claim a 2-1 series win. Read full story","content":null,"pubDate":"2022-09-25 18:00:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/09/26/1751611.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"India vs Australia 3rd T20I Match Highlights","link":"https://www.cairnspost.com.au/sport/cricket/india-vs-australia-3rd-t20i-match-highlights/video/84afd3728112dbd9104097e528c69c41","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Watch the match highlights from the series deciding 3rd T20I between India and Australia.","content":null,"pubDate":"2022-09-25 17:54:17","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"West Zone move closer to Duleep Trophy 2022 title","link":"https://www.sentinelassam.com/sports/cricket/west-zone-move-closer-to-duleep-trophy-2022-title-614862","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"West Zone moved closer to the Duleep Trophy 2022 title after they reduced South Zone to 154/6 at stumps in a chase of 529 on the penultimate day of final at SNR College Cricket Ground","content":"COIMBATORE: West Zone moved closer to the Duleep Trophy 2022 title after they reduced South Zone to 154/6 at stumps in a chase of 529 on the penultimate day of final at SNR College Cricket Ground, here on Saturday. Pacers Jaydev Unadkat and Atit Sheth, and left-arm spinner Shams Mulai bagged two wickets each as West Zone practically finished the Day 4 with one hand on the trophy. Continuing their domination, West Zone decided to declare after posting a mammoth second-innings total of 585/4. Yashasi Jaiswal, who smashed a double-ton on Day 3, stretched his unbroken partnership with Sarfaraz Khan overnight to 164 before South Zone managed to take breakthroughs. Jaiswal was stumped on 265 off just 323, having hit 30 boundaries and four sixes in his epic knock. On the other hand, Sarfaraz finished unbeaten on 127, adding another century stand with Het Patel, who himself got to a fifty post which West Zone skipper Ajinkya Rahane declared. Still 375 away from the target, South need a miracle to save the game while West are just four lower-order wickets away from lifting the title. Brief scores: South Zone 327 & 154/6 (Rohan Kunnummal 93, Atit Sheth 2-29, Shams Mulani 2-24, Jaydev Unadkat 2-26) need 375 more to win against West Zone 270 & 585/4 decl (Yashasvi Jaiswal 265, Sarfraz Khan 127 not out; K Gowtham 2-157). IANS Also read: India Aim To Give A Winning Send-Off To Legendary Pacer Goswami At Lord's Also Watch:","pubDate":"2022-09-25 17:53:29","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/25/393722-duleep.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Legendary fast bowler Jhulan Goswami gets guard of honour","link":"https://www.sentinelassam.com/sports/cricket/legendary-fast-bowler-jhulan-goswami-gets-guard-of-honour-614860","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Legendary fast bowler Jhulan Goswami received a guard of honour from the players while walking out to bat for the final time in international cricket during India's third ODI against England at Lord's","content":"LONDON: Legendary fast bowler Jhulan Goswami on Saturday received a guard of honour from the players while walking out to bat for the final time in international cricket during India's third ODI against England at Lord's on Saturday.Stepping on the field for her last international game, Jhulan had the honour of doing the toss for India against England and also gave a speech in the team huddle. Captain Harmanpreet Kaur, who had debuted under Jhulan's captaincy in 2009, broke down in tears when Jhulan addressed the side. She was even provided with a memento before the start of the match at Lord's. England head coach Lisa Keightley, whose term ends after Saturday's match, presented Goswami with a shirt signed by the England players along with interim ECB CEO Clare Connor. Jhulan walked in to bat at number nine for India after an ordinary batting display from the visitors in the 39th over, and received a heartfelt guard of honor on the field as she made her way out one final time in international cricket. Playing in her 204th ODI, Jhulan was unfortunately dismissed for a golden duck in her final international innings as young left-arm pacer Freya Kemp castled her. IANS Also read:    India Aim To Give A Winning Send-Off To Legendary Pacer Goswami At Lord'sAlso Watch:","pubDate":"2022-09-25 17:44:22","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/25/393720-jhulan.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs ENG: 'Will put national duty with England above franchise cricket,' says Mark Wood","link":"https://www.thehansindia.com/sports/cricket/pak-vs-eng-will-put-national-duty-with-england-above-franchise-cricket-says-mark-wood-763067","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Mark Wood returned to action after 6 monthsWood claimed 3 wickets in England's 63-run win on FridayEngland are 2-1 up in the T20I series in Pakistan","content":"Mark Wood England fast bowler Mark Wood has vowed to put national duty above franchise cricket as he returns from injury. After a six-month injury lay-off, Wood returned to action on Friday during England's third T20I against Pakistan in Karachi. He made his presence felt in his comeback as he clocked bowling at 97mph and helped England seal the game by 63 runs. Wood, who made his England debut in 2015, has been an injury-prone player and has missed many series because of the same. The 32-year-old pacer has now insisted that he is \"all in with England\" at the moment and is looking forward to playing Tests in Pakistan in the winter. \"One day we will have a conversation (about franchise cricket) but at the moment, I'm all in with England. For me, England will always come first and if I can fit anything else in, then great, but from an injury point of view, I think it's more a case of where I can get things in and where it makes sense. If they want me (for the Tests against Pakistan), I'll be ready to go,\" said Wood. Wood finished with figures of 3 for 25 in his quota of four overs as England went 2-1 up in the T20I series. The fast bowler also said he grew up watching Pakistan legends Waqar Younis and Wasim Akram, and values their opinion. \"They are guys I grew up watching. I look up to them a bit, so if they give you any praise, you know you must be doing something right. I value their opinion,\" Wood added. The English fast bowler also credited Pakistan's ability to produce top international pacers, saying Pakistani pacers have a mystery about them that makes them deadly. \"It seems like this country produces a lot of fast bowlers and when you look at the pitches, their skill level has to be really high to get wickets and they've got that deadly pace as well. They have a mystery about them that makes them deadly,\" said Wood. England are currently in Pakistan for the seven-match T20I series as a part of their preparation for the T20 World Cup, which is due to begin Down Under on Oct. 16. The final T20I is on Oct. 7 and after which, they'll fly directly to Australia for the marquee tournament. Last year, England and Pakistan were among the semi-finalists in the T20 World Cup, but they ended up losing to New Zealand and Australia respectively. After the T20 World Cup, England's Test side will fly down to Pakistan for a three-match Test series, starting from Dec. 1. The Tests will be played in Rawalpindi, Multan, and Karachi.","pubDate":"2022-09-25 17:43:40","image_url":"https://assets.thehansindia.com/h-upload/2022/09/25/500x300_1313797-marl.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Ind vs Aus: Kohli, Surya lead India to series victory against Australia","link":"https://telanganatoday.com/ind-vs-aus-kohli-surya-lead-india-to-series-victory-against-australia","keywords":["News","Sport","Top Section","Australia","India","Rajiv Gandhi International Cricket Stadium"],"creator":["Shiva Krishna Gundra"],"video_url":null,"description":"The full capacity crowd at the Rajiv Gandhi International Cricket Stadium in Hyderabad was treated to Suryakumar Yadav’s explosive batting and Virat Kohli’s measured innings","content":"Hyderabad: The full capacity crowd at the Rajiv Gandhi International Cricket Stadium in Hyderabad was treated to Suryakumar Yadav’s explosive batting and Virat Kohli’s measured innings that saw India clinch the three-match T20 series 2-1 with a six-wicket victory over Australia at the Rajiv Gandhi International Cricket Stadium in Hyderabad on Sunday. Chasing Australia’s 187-run target, thanks to half-centuries from Cameron Green (52 off 21; 7×4, 3×6) and Tim David (54 off 27; 2×4, 4×6), India rode on Suryakumar’s 36-ball 69 (5×4, 5×6) and Kohli’s 48-ball 63 (3×4, 4×6) knocks to reach the target with a ball to spare. Both added 104 runs for the third wicket that paved the way for the comfortable victory. With 11 required off the final over, Kohli hit Daniel Sams to a six off the first ball to settle the nerves. Though he was caught off the next ball, Pandya hit a boundary off the fifth ball to seal the deal. Chasing the target, India didn’t have the best of starts as they lost KL Rahul (1) in the very first over when he top-edged Sams to wicketkeeper Matthew Wade. Captain Rohit Sharma (17 from 14; 2×4, 1×6) looked good with a six and hit a couple of boundaries before he perished to his favourite pull shot off Pat Cummins which reduced India to 30/2. But Kohli looked in his vintage best when he smacked Hazlewood into deep mid-wicket for a six and lofted him over covers for a boundary to take India to 50/2 in the powerplay. Kohli got a reprieve when he was dropped by Adam Zampa when on 24. Suryakumar Yadav, who joined Kohli at the other end, hit Maxwell for consecutive boundaries. Surya’s range of strokes were on display as he overtook his senior partner and whacked Zampa for consecutive sixes to reach his half-century. He then hit six and four off Hazlewood but he fell in the same over after he was caught at the long on. Kohli then took control of the chase. He reached his fifty in 37 balls. With Pandya, he took India to the touching distance before falling in the final over with Indian needing four runs for victory. Earlier, asked to bat first, Australia were off to a flyer with Green smashing a scintillating half-century. Green spared no Indian bowler in the powerplay. Green took Jasprit Bumrah to the liking hitting a four and two sixes in the innings’ third over. In-form Axar Patel broke the opening stand when he dismissed Aaron Finch (7 from 6; 1×4) who went for an expensive shot only to give a simple catch to Hardik Pandya at mid-wicket. However, Green hit three consecutive fours on the next three deliveries to take his team to 50 in the fourth over. He reached his half-century in just 19 deliveries in the innings’ fifth over. But he top-edged Bhuvneshwar Kumar to point three balls later as the visitors reached 66/2 in powerplay with Glenn Maxwell managing just a boundary in the sixth over. Glenn Maxwell’s (6 from 11) bizarre run out by Axar Patel and Steve Smith’s dismissals – stumping off Yuzvendra Chahal – saw Australia reduced from a commanding 66/2 to 86/4 in 10 overs. Axar further pushed the visitors on the backfoot when he dismissed Inglis (24 off 22; 3×4) and in-form Matthew Wade with a caught and bowled in his final over as Australia were reduced to 117/6 in 14 overs. However, Tim David took the fight to the opposition camp. Bhuvi conceded 21 runs in the 18th while Bumrah leaked 18 in the 19th to let Australia off the hook. David reached his fifty with a six off Harshal Patel in the 20th over but perished when he was caught by Rohit in the final over.","pubDate":"2022-09-25 17:43:09","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"'Hope I've inspired the next generation of girls to play the beautiful game,' says Jhulan Goswami","link":"https://www.thehansindia.com/sports/cricket/hope-ive-inspired-the-next-generation-of-girls-to-play-the-beautiful-game-says-jhulan-goswami-763066","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Jhulan Goswami played her final match for India Women on SaturdayIt was a fairy tale ending for Goswami as India won by 16 runs at Lord’sGoswami played over 200 ODIs for India","content":"Jhulan Goswami Jhulan Goswami, who brought curtains down to her decorated career on Saturday, hopes that she had been successful in inspiring the next generation of players in India and the world to play the \"beautiful game\". India Women's team gave Goswami a fairy tale ending to her two-decade-long career by beating England 16 runs in the third and final ODI at the Lord's. By doing so, India Women recorded their first-ever white-wash on the English soil. \"I have always been honest as a cricketer and hope, I have been able to contribute to the growth of women's cricket in India and the world. I hope I have been successful in inspiring the next generation of girls to play this beautiful game,\" Goswami wrote on a farewell note posted on her social media handle. \"To my cricket family and beyond. So, the day has finally arrived! Like every journey has an end, my cricket journey of over 20 years ends today as I announce my retirement from all forms of cricket,\" the 39-year-old bowled added. One of the greatest pacers to have graced the sport of cricket, Goswami has left the women's game as the highest wicket-taker, having kickstarted her journey back in 2002. She finished with 44 wickets in 12 Tests, 255 wickets in 204 ODIs, and 56 wickets in 68 T20Is. \"As Ernest Hemingway said, 'it's good to have an end to journey towards, but it is the journey that matters in the end'. For me, this journey has been the most satisfying. It has been exhilarating, thrilling to say the least, and adventurous. \"I have had the honour of donning the India jersey for over two decades and serving my country at the best of my abilities. There is a sense of pride every time I hear the National Anthem before a match,\" Goswami wrote. \"I have cherished every moment of the last 20 years of my life as an international cricketer with my teammates on and off the field. I have always loved you cricket and even as I retire as a professional player, I will never be too far away from you,\" the veteran cricketer wrote further. Goswami was a part of as many as five ICC Women's World Cups, including in 2005 and 2017 when India made the finals. \"Ever since watching the Women's World Cup final at Eden Gardens back in 1997, it was my dream to play for India, and I am thankful to the BCCI, CAB, WCAI, and Air India officials for reposing faith in me and giving me the opportunity to fulfill my dream,\" she wrote. Thank you everyone! 🙏🏾 @BCCI @BCCIWomen pic.twitter.com/8TWq8SfxDj \"I want to thank NCA for taking care of my injuries and keeping me fit as a fiddle over the years. I am grateful to all the coaches, trainers, physios, and ground staff who have been an integral part of this journey. A huge shout out to all the captains I have played under. Their faith in my abilities helped build my confidence. \"I want to take a moment to thank my family (my parents, siblings) who stood by me in every situation. Not to forget my friends, who have been my best critics and biggest supporters. Last but not the least, I want to thank my childhood coach for having backed me in my endeavour,\" concluded Goswami.","pubDate":"2022-09-25 17:39:55","image_url":"https://assets.thehansindia.com/h-upload/2022/09/25/500x300_1313795-o.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Duleep Trophy Final: Ajinkya Rahane explains why he asked Yashasvi Jaiswal to leave the field [Watch]","link":"https://www.thehansindia.com/sports/cricket/duleep-trophy-final-ajinkya-rahane-explains-why-he-asked-yashasvi-jaiswal-to-leave-the-field-watch-763065","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Ajinkya Rahane was the captain of West Zone in the Duleep Trophy 2022Yashasvi Jaiswal scored a double hundred in the finalWest Zone defeated South Zone by 294 runs to clinch the final","content":"India batsman Ajinkya Rahane has explained why he asked teammate Yashasvi Jaiswal to leave the field during the Duleep Trophy final on Sunday. Rahane has defended his decision, saying believes in respecting the game and opponents. Rahane, who was leading West Zone against South Zone in the Duleep trophy final in Coimbatore, asked Jaiswal to leave the field after the young cricketer was constantly sledging batsman Ravi Teja. The South Zone batter had complained about Jaiswan's verbal volleys to both the on-field umpires and West Zone skipper Rahane on Day 5 morning on Sunday. pic.twitter.com/qylJUJGT32 Rahane was seen having a chat with Jaiswal and after which, the play continued. However, Teja was left irked when Jaiswal continued to sledge him. The on-field umpire then complained about Jaiswal's behaviour. Following this, in the 57th over of the innings on Day 5, Rahane ordered Jaiswal to walk off the field. Rahane has asked Jaiswal to leave the field after few discipline issues with the South Zone batter in Duleep Trophy final. (Jaiswal was warned earlier as well) pic.twitter.com/qftypyPyVv Jaiswal, who was the eventual Player of the Match for scoring a double century, looked animated before he left the field. \"You have to follow rules and respect the game, your opponents, and the umpires. That's the way I have always played my cricket and I will continue to do so. There are certain things you must follow on the field, if you don't, you get off the field. This is my mantra. I believe in always respecting your opponents, umpires, and match officials. So you have to handle certain incidents in a certain manner,\" Rahane said. Jaiswal, who finished with 497 runs at an incredible average of 99.40 in the domestic tournament, was away from the field for seven overs before he re-joined the proceedings. Apart from the controversial incident on the final day, Jaiswal had a memorable final. His double hundred in the second innings helped West Zone to seal the game by 294 runs despite conceding a first-innings lead. Jaiswal said he was \"happy\" with his performances in the Duleep Trophy final and that sharing the dressing room with seniors helped him realise the importance of staying hungry for more success. \"I'm happy but I think I need to keep going ahead. I just think about the way I'm applying myself and going through the processes. I keep talking to the seniors - Ajinkya and Shreyas (Iyer), and take their advice seriously to try and improve,\" Jaiswal was quoted as saying after the final on Sunday.","pubDate":"2022-09-25 17:38:36","image_url":"https://assets.thehansindia.com/h-upload/2022/09/25/500x300_1313796-cricket.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Ind-Aus: Cricket fans soak in T20 action at Uppal stadium","link":"https://telanganatoday.com/ind-aus-cricket-fans-soak-in-t20-action-at-uppal-stadium","keywords":["News","Sport","Top Section","Rajiv Gandhi International Cricket Stadium","Rohit Sharma","Team India"],"creator":["Shiva Krishna Gundra"],"video_url":null,"description":"The fans started entering the stadium as early as 4 pm for the third T20 match at the Uppal stadium. The long queues from the gate stretched onto the main road.","content":"Hyderabad: Cricket fans, who turned up to witness the first international cricket match in three years at the Rajiv Gandhi International Cricket Stadium, turned the atmosphere electrifying, cheering every moment of their favourite cricketers. The fans started entering the stadium as early as 4 pm for the third and series-deciding T20 match at the Uppal stadium. The long queues from the gate stretched onto the main road. The lucky ones who managed to get hold of the tickets were eager to get a glimpse of their favourite cricket stars. The cheers at the stadium began from the time Team India entered the field for a warm-up session. The stars like Virat Kohli, captain Rohit Sharma duly acknowledged the crowd prompting cheers from them. The first loud cheer came at 6.30 at the toss when Rohit Sharma called it right and chose to bowl. Rohit, who had to shout literally to speak to match official Ravi Shastri at the toss, acknowledged the cheering crowd, saying, “Lot of noise, and good to be back here. It has been three-four years,” he said at the toss. Every time a cricketer entered the ground from the dugout, the fans were cheering their names to grab their attention. Bhuvneshwar Kumar, who plays for Hyderabad franchise Sunrisers Hyderabad, also got a loud cheer during the warm-up session. Cutting across the age group, the galleries were filled with people from all walks of life. While the stadium inside was full, there were still long queues outside the venue. Australian cricketer Tim David’s parents were also in the gallery. Tim’s father, Rod David, said that they were delighted to be in Hyderabad to witness their son in action. “We have been to the previous two matches as well. Yes, one match was good but the other not so good,” said Rod David.","pubDate":"2022-09-25 17:33:10","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs AUS 3rd T20 Live Score Updates: Kohli, SKY star as India defeat Australia by 6 wickets, clinch series - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmQtdnMtYXVzLTNyZC10MjAtbGl2ZS1zY29yZS11cGRhdGVzLTgxNzIyNTYv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS 3rd T20 Live Score Updates: Kohli, SKY star as India defeat Australia by 6 wickets, clinch series  The Indian ExpressIndia vs Australia, 3rd T20I Live Cricket Score: Kohli, Suryakumar Fifties Help India Win by 6 Wickets and  News18India vs Australia Live 3rd T20I: IND win thriller by six wickets  Hindustan TimesIndia vs Australia LIVE : After a thrilling 8 over contest, can the Men in Blue seal the series?  NEWS9 liveLive Cricket Score - India vs Australia, 3rd T20I, Hyderabad | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-09-25 17:25:45","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Tim David bludgeons his way to a maiden T20I half century","link":"https://www.cairnspost.com.au/sport/cricket/tim-david-bludgeons-his-way-to-a-maiden-t20i-half-century/video/d989c71603a0bfd4d432f037740b2b18","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Tim David has shown his class after smashing his maiden T20I half century against India in the 3rd T20I .","content":null,"pubDate":"2022-09-25 16:45:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"}]}