{"newsArray":[{"title":"Saudi Arabia enters race for Manchester United: Report","link":"https://www.livemint.com/sports/football-news/saudi-arabia-enters-race-for-manchester-united-report-11676574091906.html","keywords":null,"creator":null,"video_url":null,"description":"Saudi Arabia has submitted a bid for British soccer club Manchester United","content":"Saudi Arabia has submitted a bid for British soccer club Manchester United PLC ahead of Friday's deadline, the Telegraph reported on Thursday. Multiple private groups in Riyadh have made formal inquiries, the report added. TRENDING STORIES See All Premium World Bank may loosen loan ratio to free up $4 billion ... Premium Visa CFO Vasant Prabhu set to retire as firm gets new l ... Premium Senior citizens in US are richer than thought, Census B ... Premium Russia launches 36 missiles across Ukraine today British billionaire Jim Ratcliffe, a life-long supporter of the club and founder of chemicals firm INEOS, is a likely bidder, along with U.S. private equity firms and possibly Qatari investors, sources told Reuters. A deal for the record 13-times English Premier League winners will likely exceed the biggest sports deal so far, the $5.2 billion - including debt and investments - paid for Chelsea, the sources added. Manchester United is the fourth richest soccer club in the world, according to analysis by Deloitte. A small portion of Manchester United shares is listed in the United States with a market capitalization of more than $4 billion, as of Wednesday's close. MORE FROM THIS SECTION See All Premium Premium India can have its matches in UAE: Pakistan Cricket Boa ... Premium Premium Sania Mirza to mentor Women’s Premier League team RCB Premium Premium Women's Premier League 2023 match schedule: Finals on 2 ... Premium Premium Saudi Arabia selected as Club World Cup 2023 hosts The club declined to comment on the matter. Catch all the Sports News and Updates on Live Mint. Download The Mint News App to get Daily Market Updates & Live Business News . More Less OPEN IN APP","pubDate":"2023-02-16 20:28:14","image_url":"https://images.livemint.com/img/2023/02/16/1600x900/MANCHESTER-UNITED_1676579230059_1676579230390_1676579230390.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"Team India change hotel in Delhi; Kohli not with squad","link":"https://thenorthlines.com/team-india-change-hotel-in-delhi-kohli-not-with-squad/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   A dearth of five-star hotel rooms due to the G20 Summit and wedding season has forced Team India to abruptly move from their regular hotel in Delhi ahead of the second Test against Australia. The second match of the Border-Gavaskar Trophy series begins at Delhi’s Arun Jaitley Stadium on Friday. Delhi is hosting […] The post Team India change hotel in Delhi; Kohli not with squad appeared first on Northlines.","content":"Agencies A dearth of five-star hotel rooms due to the G20 Summit and wedding season has forced Team India to abruptly move from their regular hotel in Delhi ahead of the second Test against Australia. The second match of the Border-Gavaskar Trophy series begins at Delhi’s Arun Jaitley Stadium on Friday. Delhi is hosting its first Test since December 2017. The Indian cricket team usually stays at Taj Palace or ITC Maurya in Delhi, but this time they are put up at Hotel Leela in Karkarduma, according to sources. “This time team is staying in a different hotel which is in another part of Delhi; the hotel is in Karkarduma as we didn’t get a stay in ITC Maurya or Taj. This happened because of the heavy wedding season and G20,” a source told ANI. Virat Kohli isn’t staying with the team. The former India captain, whose family resides in Delhi, decided to spend some quality time with his folks for a few days at his house in Gurugram. While India posted 400 runs in the first innings of the opening Test against Australia, Kohli struggled with the bat, scoring just 12 runs off off 26 balls. Merely two sessions of play were needed to achieve a result on the third day of the Test as India took a 1-0 lead in Nagpur. After stretching their lead to over 200 runs, India bowled out Australia for 91 in about a session to win the Test by innings and 132 runs. Ravindra Jadeja was the ‘Player of the Match’ after bowling figures of 7-81 and 70 runs with the willow. Teams: Australia: Pat Cummins (Captain), Ashton Agar, Scott Boland, Alex Carey, Cameron Green, Peter Handscomb, Josh Hazlewood, Travis Head, Usman Khawaja, Matt Kuhnemann, Marnus Labuschagne, Nathan Lyon, Lance Morris, Todd Murphy, Matthew Renshaw, Steve Smith (vice-captain), Mitchell Starc, Mitchell Swepson and David Warner. India: (for the first two Tests) Rohit Sharma (Captain), KL Rahul (vice-captain), Shubman Gill, Cheteshwar Pujara, Virat Kohli, Shreyas Iyer, KS Bharat, Ishan Kishan, Ravichandran Ashwin, Axar Patel, Kuldeep Yadav, Ravindra Jadeja, Mohammed Shami, Mohammed Siraj, Umesh Yadav and Suryakumar Yadav.","pubDate":"2023-02-16 19:06:17","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC apologises for ranking glitch which showed India as No.1 Test side","link":"https://thenorthlines.com/icc-apologises-for-ranking-glitch-which-showed-india-as-no-1-test-side/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"The International Cricket Council (ICC) has apologised for the technical glitch, which saw India displace Australia to attain the No.1 spot in the men’s Test team rankings on Wednesday. Hours after India had ‘topped’ the Test ranking, the ICC issued another updated list that showed Rohit Sharma’s side back at No.2. It gave the impression […] The post ICC apologises for ranking glitch which showed India as No.1 Test side appeared first on Northlines.","content":"The International Cricket Council (ICC) has apologised for the technical glitch, which saw India displace Australia to attain the No.1 spot in the men’s Test team rankings on Wednesday. Hours after India had ‘topped’ the Test ranking, the ICC issued another updated list that showed Rohit Sharma’s side back at No.2. It gave the impression that Rohit’s team had briefly claimed the top spot following its innings and 132-run win over the Pat Cummins-led Australia in Nagpur. On Thursday, the game’s global body admitted the error and said in a statement that the “ICC acknowledges, for a short period of time on February 15, 2023 that, due to a technical error, India were erroneously displayed as the No.1 Test team on the ICC website. “We apologise for any inconvenience caused.” “Australia remain on top of the ICC Test Team Rankings after the latest update following the conclusion of Zimbabwe’s two-match series against West Indies.” “Australia will head into the second Test against India in Delhi, starting on Friday, January 17, as the No.1-ranked team with 126 rating points, 11 above India’s 115,” the ICC statement added.","pubDate":"2023-02-16 19:02:45","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Steve Smith’s New York cricket dream a giant leap closer","link":"https://www.watoday.com.au/sport/cricket/steve-smith-s-new-york-cricket-dream-a-giant-leap-closer-20230216-p5cl63.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Cricket NSW has signed an agreement with America’s Major League Cricket that will open the door for players to head stateside for the inaugural competition in July.","content":"Two of Steve Smith’s great loves, cricket and New York , are on course to collide after Cricket NSW sealed a deal with America’s Major League Cricket to provide opportunities for exchange and development for players and staff. While Smith will be unavailable for the inaugural MLC competition in July because of the Ashes, Cricket NSW CEO Lee Germon hopes a number of NSW players will have the chance to join the six franchises competing in the three-week Twenty20 tournament. “I think the opportunities for all of our players are going to be brilliant,” Germon said before Friday’s official announcement. “Steve absolutely has made no secret that he loves New York, but there are also two or three other players I’ve spoken to who would love to be able to play cricket in the United States. “We’re looking at every opportunity we can to grow the game, develop the game and promote the game and I think we saw with Steve this year coming back to play with the Sixers and the BBL , the impact he had. “So absolutely we’ll look to utilise the players within the New South Wales ecosystem to not only highlight the T20 competition and Major League Cricket, but also the development of cricket in that country as well.” Steve Smith was in exceptional form for the Sixers, including back-to-back centuries ahead of the India tour. Credit: Getty Smith told the Herald and The Age in September that it would be “cool” to play cricket in New York. “I mean, yeah, there’s obviously [T20] leagues popping up everywhere around the world now, and I think you’ll probably see more players in the back end of their career going down that route, so it’s potentially something I’ll look at in the future,” Smith said. “There’s no reason why cricket can’t work [in the US], I wouldn’t think.","pubDate":"2023-02-16 19:00:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"My Son Is 15 Years Old And Already Working Hard To Get Chance To Play In IPL: Sehwag","link":"https://www.thetimesofbengal.com/sports/my-son-is-15-years-old-and-already-working-hard-to-get-chance-to-play-in-ipl-sehwag/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports My Son Is 15 Years Old And Already Working Hard To Get Chance To Play In IPL: Sehwag Virender Sehwag talked about how performance in the T20 franchise tournament has become a crucial parameter for foreign players. Published: February 16, 2023 10:55 PM IST By IANS Sehwag said the competitiveness of IPL has […]","content":"Mumbai: Fifteen years ago, the seeds of a cricket revolution were planted when the Indian Premier League was formed. The IPL has become an emotion that has resonated widely among fans with every season guaranteeing exceptional performances and the birth of a new generation of heroes. The ‘Incredible’ Premier League has grown significantly over the past years, with an additional two teams joining the fray, making it one of the most competitive cricket leagues in the world. Celebrating the success of IPL, Star Sports organised a show – ‘The Incredible Awards’, in the presence of IPL stars and legends of Indian cricket – Harbhajan Singh, Virender Sehwag and Irfan Pathan. Speaking at a press conference organized by Star Sports to celebrate 15 years of the IPL, former Team India opener Virender Sehwag talked about how performance in the T20 franchise tournament has become a crucial parameter for foreign players. “I think the competitiveness of IPL has increased to such a level, that all the players from different countries want to play IPL. The performance they give in IPL are counted and evaluated in their own countries. For example, David Warner performed so well in IPL and after that he got to play in the Australian international team and there also he performed well. In addition, the main advantage of the IPL is that we got young players from small cities, who have emerged and performed well by giving their best with the highest level of competitiveness, Sehwag said. “The IPL has benefited young talent the most. Earlier, nobody got noticed from Ranji Trophy performances and hence couldn’t make it to the Indian team. But now, if you perform well in the IPL and you showcase your talent, then immediately, you get an opportunity to play for the Indian team. Because of the IPL, so many children from smaller states of the country have started taking cricket seriously and try their best to participate in the IPL and strive hard for it. For example, my son is 15 years old and is already working hard to get a chance to play in the IPL.” Former Team India spinner Harbhajan Singh also talked about how the T20 tournament has made uncapped Indian players household names. “The number of youngsters who have got an opportunity would have never thought they would get to share the dressing room with Sachin Tendulkar, Pollock, Shane Warne. When a young cricketer’s family watches him on TV playing alongside a Shane Warne, Virender Sehwag, Sachin Tendulkar, Yuvraj Singh, Dhoni, then there is this feeling of satisfaction among the family as well that the youngster’s hard work has been fruitful. “This was possible only because there was a broadcaster like Star Sports. If there was no television, nobody would have been able to put a face on a player from any team. Today, we know every IPL player’s name and face because of television.” Cricket lovers can watch ‘The Incredible Awards’ on the Star Sports Network at 10PM IST on February 20. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-16 18:48:01","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Do Justin Langer’s cheerleaders really think he was the difference in first Test?","link":"https://www.watoday.com.au/sport/cricket/do-justin-langer-s-cheerleaders-really-think-he-was-the-difference-in-first-test-20230216-p5ckwx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Webster"],"video_url":null,"description":"Too many overstated Langer’s importance when he was coach. Too many have overstated it since his departure.","content":"Of all the reasons tossed up for Australia’s self-immolation in the first Test against India, the dumbest must be that Justin Langer is no longer coach. What, pray tell, could Langer have done? Gathered the troops in a huddle and barked at them for playing off their back foot well within their crease? Produced 11 tiny mirrors and told them to take a long, hard look at themselves? Shown videos from his glory days? Presumably, it would be different to the rev-ups he gave during the two series losses to India in Australia on his watch. His cheerleaders have forgotten that stat. They forget many things. Too many people, especially his former teammates, overstated Langer’s importance during his time as coach. Too many have overstated it since his departure. While he was a critical addition to the Australian set-up following the Newlands ball-tampering scandal, his time was up and showed as much in an interview with Perth radio last year when speculation about his future had reached its peak. “Imagine if a Wallabies coach won the Bledisloe Cup and then the World Cup in six months,” he told 6PR. Former Australia coach Justin Langer in happier times. Credit: Getty Talk about overstating one’s importance. Coaching the Australian cricket team has never been remotely like coaching the Wallabies. The captain is the figurehead, not the coach. The team is now indisputably that of Pat Cummins so, with that in mind, he must wear much of the responsibility over what happened in Nagpur, along with the selectors.","pubDate":"2023-02-16 18:42:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"PSL: \"जब भी वो मिलते हैं...\", पाकिस्तानी स्टार ने मोहम्मद आमिर और बाबर आजम के बीच हुई गहमागहमी पर किया रिएक्ट","link":"https://sports.ndtv.com/hindi/cricket/shoaib-malik-reacts-to-mohammad-amir-vs-babar-azam-face-off-in-a-psl-match-ndtv-india-ndtv-hindi-3789581#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"इस घटना पर प्रतिक्रिया व्यक्त करते हुए शोएब मलिक (Shoaib Malik), जो PSL में कराची किंग्स के लिए खेलते हैं, ने कहा कि खिलाड़ियों को एक-दूसरे का सम्मान करना चाहिए.","content":"Mohammad Amir पाकिस्तान के पूर्व कप्तान शोएब मलिक (Shoaib Malik) ने पाकिस्तान सुपर लीग के दूसरे मैच में मोहम्मद आमिर (Mohammad Amir) और बाबर आजम ( ) के बीच हुई गहमागहमी पर अपनी राय दी है. मंगलवार को हुए मैच (Karachi Kings vs Peshawar Zalmi) में कराची किंग्स के तेज गेंदबाज आमिर को पेशावर जाल्मी के कप्तान बाबर ने छठवें ओवर की पांचवीं गेंद पर चौका लगाया. इसके बाद बाएं हाथ के इस तेज गेंदबाज ने उन्हें एक डॉट गेंद फेंकी और फॉलो थ्रू पर गेंद पकड़ लिया. गेंद हाथ में आने के तुरंत बाद, आमिर ने गुस्से में गेंद फेंक कर अपनी हताशा को गुस्से से दिखाया. Mohammad Amir vs Babar Azam💥 इस घटना पर प्रतिक्रिया व्यक्त करते हुए मलिक, जो आमिर (Mohammad Amir) की ही PSL टीम के लिए खेलते हैं, ने कहा कि खिलाड़ियों को एक-दूसरे का सम्मान करना चाहिए. इसके साथ ही उन्होंने माना कि मैचों के दौरान खिलाड़ियों द्वारा बेहतर प्रदर्शन करने के लिए टकराव (Mohammad Amir vs Babar Azam) या किसी अन्य प्रेरक हरकत का इस्तेमाल किया जाता है. मलिक ने मैच के बाद प्रेस कांफ्रेंस में कहा, \"आपस में सम्मान की कमी नहीं होनी चाहिए. मैंने आमिर, इमाद, बाबर को देखा है... जब भी वो मिलते हैं, वो एक-दूसरे का सम्मान करते हैं.\" उन्होंने आगे कहा, \"इस कमरे में, आप सभी के साथ समान रूप से संगत नहीं होंगे. कुछ अच्छी तरह से मिलेंगे, आप कुछ को पसंद करेंगे और आप कुछ को पसंद नहीं कर सकते हैं. लेकिन यह केवल पेशेवर आधार पर होना चाहिए. मुझे यकीन है सभी एक दूसरे का सम्मान करते हैं.\" मलिक ने कहा, \"यह लीग के लिए अच्छा है. लीग में प्रवेश करने के बाद आपको इस बात पर ध्यान देने की जरूरत है कि आपको अपना सर्वश्रेष्ठ देने के लिए क्या प्रोत्साहित करता है. लेकिन हम जानते हैं कि कोई भी सीमा पार नहीं कर सकता है.\" मैच की बात करें तो पाकिस्तान सुपर लीग (PSL) के दूसरे मैच में पेशावर जाल्मी ने कराची किंग्स को दो रन के करीबी अंतर से हरा दिया. यह बल्लेबाजों के लिए एक शानदार मैच था. कराची के नेशनल क्रिकेट स्टेडियम में इस मैच की दो पारियों में कुल 396 रन बने. * * * पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-16 18:39:19","image_url":"https://c.ndtvimg.com/2023-02/mkkkg35o_mohammad-amir-twitter_625x300_15_February_23.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"UAE May Host Few Matches, India Can Play All Its Matches In Middle-East, Says PCB","link":"https://www.thetimesofbengal.com/sports/uae-may-host-few-matches-india-can-play-all-its-matches-in-middle-east-says-pcb/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Asia Cup 2023: UAE May Host Few Matches, India Can Play All It’s Matches In Middle-East, Says PCB Pakistan were declared hosts of Asia Cup 2023. However, BCCI said India won’t be travelling to Pakistan to play the tournament. India may play its Asia Cup 2023 matches in UAE. (Image: Twitter) Karachi: In […]","content":"Karachi: In a possible solution to the Asia Cup logjam, Pakistan may remain the host and India could be offered to play its matches in the UAE where some games will be held, according to sources in the Board (PCB). In such a scenario, the UAE will also host the final if India qualifies for it, according to a Pakistan Cricket Board (PCB) source. An emergent meeting of the Asian Cricket Council (ACC) was held in Bahrain on February 4 at the behest of PCB chief Najam Sethi after the continental body released its itinerary and Pakistan wasn’t named the hosts of the tournament. Addressing the media here on Thursday, Sethi said more discussions on the hosting of Asia Cup ODI tournament will be held next month on the sidelines of an ICC meeting as the matter “remained unresolved”. “What can I say about what happened in the Asian Cricket Council board meeting. There was no resolution,” Sethi told reporters when asked if Pakistan will host the tournament in September. However, reliable sources aware of the developments, said the most likely solution to the problem appears to be that Pakistan will remain host of the Asia Cup but some matches will also be held in the UAE where India may play all its games, including the final if necessary (if India qualifies for the final). “Sethi made it clear at the ACC meeting that PCB wants to host the event and some of the matches at home,” the source said. The Asia Cup was initially allotted to Pakistan and was scheduled in September this year but BCCI Secretary Jay Shah, who is also the ACC chairman, had announced last October that India will not travel to Pakistan. PTI had reported earlier this month that UAE with three venues — Dubai, Abu Dhabi and Sharjah — are the favourites to host the tournament but a decision has been withheld for the time being. “A shift of venue has been postponed till March. But be rest assured that with India not going to Pakistan, the tournament will have to be shifted,” a senior BCCI official privy to the development had told PTI. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-16 18:38:53","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia rout Sri Lanka by 10 wickets at Women's T20 World Cup","link":"https://www.iol.co.za/sport/cricket/international/australia-rout-sri-lanka-by-10-wickets-at-womens-t20-world-cup-6430e2ca-2eab-4ac0-bac3-886c601f0fc0","keywords":null,"creator":["AFP"],"video_url":null,"description":"Australia’s run of form continued when they hammered Sri Lanka in their T20 World Cup clash at St Georges Park in Gqeberha on Thursday.","content":"Gqeberha — Australian opening batter Alyssa Healy said Australia had adapted well to \"low and slow\" conditions after they scored a commanding 10-wicket win over previously unbeaten Sri Lanka in their Women's T20 World Cup match at St George's Park in Gqeberha on Thursday. The win virtually assured Australia of a place in the semi-finals with three wins out of three, but there's still a possibility of a three-way tie in Group One. Australia's last group match is against South Africa at the same ground on Saturday night. Healy said conditions on Saturday could be very different as she believed a fast, grassy pitch was being prepared to suit South Africa's fast bowlers. \"We just try to adapt to the conditions we get,\" she said. \"We've seen that green seamer lingering out there for Saturday night so it should be a good showdown for the quicks.\" If South Africa win their last two matches and Sri Lanka recover from Thursday's mauling to defeat New Zealand in their final game three teams would have the same number of points. Defending champions Australia, though, have an advantage on net run rate. Sri Lanka were restricted to 112/8 on Thursday after being sent in to bat in overcast conditions. It never looked nearly enough as Healy (54 not out) and Beth Mooney (56 not out) scored freely from the start of the Australian innings. Grace Harris and Megan Schutt were mainly responsible for Sri Lanka's moderate batting performance, although all Australia's bowlers were economical on a slow pitch. Harris ran from mid-on and took a diving catch off Ellyse Perry to end an aggressive innings by Sri Lanka captain Chamari Athapaththu (16) to effect Australia's first breakthrough with the total on 30. Sri Lanka scored 50 in the first seven overs but became becalmed against Australia's slow bowlers. Harris took two wickets in an over with her off-spinners to reduce Sri Lanka to 69/3 as they added only another 19 runs in the seven overs. Schutt took four wickets in her last two overs, while wicketkeeper Healy made three stumpings. Healy and Mooney were seldom troubled as they scored at well above the required run rate. Healy frequently used her feet to Sri Lanka's assortment of spin bowlers and hit six fours and a six off 43 balls, while the left-handed Mooney ended a poor start to her tournament with good timing and placement in striking seven boundaries off 53 deliveries. Mooney was out for nought in a warm-up match against Ireland and made nought and two in her first two innings in the tournament. Athapaththu said Sri Lanka were not disheartened by the result. \"They (Australia) are a world-class team and world champions. We are a young team. If we play our best cricket we can beat New Zealand and play in the semi-finals,\" she insisted. If Australia beat South Africa, a win against New Zealand on Sunday would guarantee a semi-final place for Sri Lanka. Scorecard Sri Lanka 112/8 in 20 overs (H Samarawickrama 34; M Schutt 4/24, G Harris 2-7) Australia 113/0 in 15.5 overs (B Mooney 56 not out, A Healy 54 not out) Australia won by 10 wickets AFP Share","pubDate":"2023-02-16 18:21:22","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/c3ef9051-84c3-58cb-873f-e5f24357b6ca&operation=CROP&offset=0x101&resize=4746x2666","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"More corporates encouraged to invest in women sport","link":"https://sundayworld.co.za/news/sport/other-sports/more-corporates-encouraged-to-invest-in-women-sport/","keywords":["Other Sports"],"creator":["Siyasanga Monoalibe"],"video_url":null,"description":"The year 2023 has since been regarded as the “year for women”, with South African female national teams taking part in some of the biggest global tournaments. At the back of the announcement by Discovery of a three-year sponsorship deal with Netball SA as the official wellness partner to the Spar Proteas, and Vitality as […]","content":"The year 2023 has since been regarded as the “year for women”, with South African female national teams taking part in some of the biggest global tournaments. At the back of the announcement by Discovery of a three-year sponsorship deal with Netball SA as the official wellness partner to the Spar Proteas, and Vitality as the title partner of the Netball World Cup last week Thursday, tournament director Priscilla Masisi said that corporates coming on board will not only empower young girls but go as far as benefiting the nation. “I think it will go a very long way, because if you empower a girl child, you are empowering the nation,” said Masisi. “And you get your girl children in the right direction, our society will improve because women have that strength of direction and focus their energy on the right direction and instilling positive attitudes. “So, I think if you empower a girl child, you are basically empowering the nation. So, it will be very important if our sponsors, partners, and businesses can come on and support sports in this country. Masisi went on to emphasise the importance of development in schools, saying that a lot more still needs to be done at grassroot level. “I think we still have a long way to go, remember school sport is the bedrock,” Masisi said. “So, I think we need to get to a point whereby we go back to those days where we have sports days on Wednesdays and run interschool competitions, those things are very important, we need to go back to those grassroot developments, grassroots are also about school sport. We need to go back to those basics.” Currently, the Momentum Proteas are battling it out in the ICC T20 World Cup held in SA, while the U-19 cricket squad participated in the Cricket World Cup earlier this year. Banyana Banyana, the reigning Women’s Africa Cup of Nations champions, will be tested at the biggest stage when they challenge for the Fifa Women’s World Cup in Australia and New Zealand from July 20, which will be followed by the Vitality Netball World Cup in July 28, where the Spar Proteas will be expected to deliver on home soil. For the latest sport news from Sunday World, click here. Follow @SundayWorldZA on Twitter and @sundayworldza on Instagram, or like our Facebook Page, Sunday World, by clicking here for the latest breaking news in South Africa. To Subscribe to Sunday World, click here","pubDate":"2023-02-16 18:16:45","image_url":"https://sundayworld.co.za/wp-content/uploads/2023/02/P22-netbal.jpg","source_id":"sundayworld","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Saudi Arabia enters race for Manchester United: Report","link":"https://www.livemint.com/sports/football-news/saudi-arabia-enters-race-for-manchester-united-report-11676574091906.html","keywords":null,"creator":null,"video_url":null,"description":"Saudi Arabia has submitted a bid for British soccer club Manchester United","content":"Saudi Arabia has submitted a bid for British soccer club Manchester United PLC ahead of Friday's deadline, the Telegraph reported on Thursday. Multiple private groups in Riyadh have made formal inquiries, the report added. TRENDING STORIES See All Premium World Bank may loosen loan ratio to free up $4 billion ... Premium Visa CFO Vasant Prabhu set to retire as firm gets new l ... Premium Senior citizens in US are richer than thought, Census B ... Premium Russia launches 36 missiles across Ukraine today British billionaire Jim Ratcliffe, a life-long supporter of the club and founder of chemicals firm INEOS, is a likely bidder, along with U.S. private equity firms and possibly Qatari investors, sources told Reuters. A deal for the record 13-times English Premier League winners will likely exceed the biggest sports deal so far, the $5.2 billion - including debt and investments - paid for Chelsea, the sources added. Manchester United is the fourth richest soccer club in the world, according to analysis by Deloitte. A small portion of Manchester United shares is listed in the United States with a market capitalization of more than $4 billion, as of Wednesday's close. MORE FROM THIS SECTION See All Premium Premium India can have its matches in UAE: Pakistan Cricket Boa ... Premium Premium Sania Mirza to mentor Women’s Premier League team RCB Premium Premium Women's Premier League 2023 match schedule: Finals on 2 ... Premium Premium Saudi Arabia selected as Club World Cup 2023 hosts The club declined to comment on the matter. Catch all the Sports News and Updates on Live Mint. Download The Mint News App to get Daily Market Updates & Live Business News . More Less OPEN IN APP","pubDate":"2023-02-16 20:28:14","image_url":"https://images.livemint.com/img/2023/02/16/1600x900/MANCHESTER-UNITED_1676579230059_1676579230390_1676579230390.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"Team India change hotel in Delhi; Kohli not with squad","link":"https://thenorthlines.com/team-india-change-hotel-in-delhi-kohli-not-with-squad/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   A dearth of five-star hotel rooms due to the G20 Summit and wedding season has forced Team India to abruptly move from their regular hotel in Delhi ahead of the second Test against Australia. The second match of the Border-Gavaskar Trophy series begins at Delhi’s Arun Jaitley Stadium on Friday. Delhi is hosting […] The post Team India change hotel in Delhi; Kohli not with squad appeared first on Northlines.","content":"Agencies A dearth of five-star hotel rooms due to the G20 Summit and wedding season has forced Team India to abruptly move from their regular hotel in Delhi ahead of the second Test against Australia. The second match of the Border-Gavaskar Trophy series begins at Delhi’s Arun Jaitley Stadium on Friday. Delhi is hosting its first Test since December 2017. The Indian cricket team usually stays at Taj Palace or ITC Maurya in Delhi, but this time they are put up at Hotel Leela in Karkarduma, according to sources. “This time team is staying in a different hotel which is in another part of Delhi; the hotel is in Karkarduma as we didn’t get a stay in ITC Maurya or Taj. This happened because of the heavy wedding season and G20,” a source told ANI. Virat Kohli isn’t staying with the team. The former India captain, whose family resides in Delhi, decided to spend some quality time with his folks for a few days at his house in Gurugram. While India posted 400 runs in the first innings of the opening Test against Australia, Kohli struggled with the bat, scoring just 12 runs off off 26 balls. Merely two sessions of play were needed to achieve a result on the third day of the Test as India took a 1-0 lead in Nagpur. After stretching their lead to over 200 runs, India bowled out Australia for 91 in about a session to win the Test by innings and 132 runs. Ravindra Jadeja was the ‘Player of the Match’ after bowling figures of 7-81 and 70 runs with the willow. Teams: Australia: Pat Cummins (Captain), Ashton Agar, Scott Boland, Alex Carey, Cameron Green, Peter Handscomb, Josh Hazlewood, Travis Head, Usman Khawaja, Matt Kuhnemann, Marnus Labuschagne, Nathan Lyon, Lance Morris, Todd Murphy, Matthew Renshaw, Steve Smith (vice-captain), Mitchell Starc, Mitchell Swepson and David Warner. India: (for the first two Tests) Rohit Sharma (Captain), KL Rahul (vice-captain), Shubman Gill, Cheteshwar Pujara, Virat Kohli, Shreyas Iyer, KS Bharat, Ishan Kishan, Ravichandran Ashwin, Axar Patel, Kuldeep Yadav, Ravindra Jadeja, Mohammed Shami, Mohammed Siraj, Umesh Yadav and Suryakumar Yadav.","pubDate":"2023-02-16 19:06:17","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC apologises for ranking glitch which showed India as No.1 Test side","link":"https://thenorthlines.com/icc-apologises-for-ranking-glitch-which-showed-india-as-no-1-test-side/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"The International Cricket Council (ICC) has apologised for the technical glitch, which saw India displace Australia to attain the No.1 spot in the men’s Test team rankings on Wednesday. Hours after India had ‘topped’ the Test ranking, the ICC issued another updated list that showed Rohit Sharma’s side back at No.2. It gave the impression […] The post ICC apologises for ranking glitch which showed India as No.1 Test side appeared first on Northlines.","content":"The International Cricket Council (ICC) has apologised for the technical glitch, which saw India displace Australia to attain the No.1 spot in the men’s Test team rankings on Wednesday. Hours after India had ‘topped’ the Test ranking, the ICC issued another updated list that showed Rohit Sharma’s side back at No.2. It gave the impression that Rohit’s team had briefly claimed the top spot following its innings and 132-run win over the Pat Cummins-led Australia in Nagpur. On Thursday, the game’s global body admitted the error and said in a statement that the “ICC acknowledges, for a short period of time on February 15, 2023 that, due to a technical error, India were erroneously displayed as the No.1 Test team on the ICC website. “We apologise for any inconvenience caused.” “Australia remain on top of the ICC Test Team Rankings after the latest update following the conclusion of Zimbabwe’s two-match series against West Indies.” “Australia will head into the second Test against India in Delhi, starting on Friday, January 17, as the No.1-ranked team with 126 rating points, 11 above India’s 115,” the ICC statement added.","pubDate":"2023-02-16 19:02:45","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Steve Smith’s New York cricket dream a giant leap closer","link":"https://www.watoday.com.au/sport/cricket/steve-smith-s-new-york-cricket-dream-a-giant-leap-closer-20230216-p5cl63.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Cricket NSW has signed an agreement with America’s Major League Cricket that will open the door for players to head stateside for the inaugural competition in July.","content":"Two of Steve Smith’s great loves, cricket and New York , are on course to collide after Cricket NSW sealed a deal with America’s Major League Cricket to provide opportunities for exchange and development for players and staff. While Smith will be unavailable for the inaugural MLC competition in July because of the Ashes, Cricket NSW CEO Lee Germon hopes a number of NSW players will have the chance to join the six franchises competing in the three-week Twenty20 tournament. “I think the opportunities for all of our players are going to be brilliant,” Germon said before Friday’s official announcement. “Steve absolutely has made no secret that he loves New York, but there are also two or three other players I’ve spoken to who would love to be able to play cricket in the United States. “We’re looking at every opportunity we can to grow the game, develop the game and promote the game and I think we saw with Steve this year coming back to play with the Sixers and the BBL , the impact he had. “So absolutely we’ll look to utilise the players within the New South Wales ecosystem to not only highlight the T20 competition and Major League Cricket, but also the development of cricket in that country as well.” Steve Smith was in exceptional form for the Sixers, including back-to-back centuries ahead of the India tour. Credit: Getty Smith told the Herald and The Age in September that it would be “cool” to play cricket in New York. “I mean, yeah, there’s obviously [T20] leagues popping up everywhere around the world now, and I think you’ll probably see more players in the back end of their career going down that route, so it’s potentially something I’ll look at in the future,” Smith said. “There’s no reason why cricket can’t work [in the US], I wouldn’t think.","pubDate":"2023-02-16 19:00:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"My Son Is 15 Years Old And Already Working Hard To Get Chance To Play In IPL: Sehwag","link":"https://www.thetimesofbengal.com/sports/my-son-is-15-years-old-and-already-working-hard-to-get-chance-to-play-in-ipl-sehwag/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports My Son Is 15 Years Old And Already Working Hard To Get Chance To Play In IPL: Sehwag Virender Sehwag talked about how performance in the T20 franchise tournament has become a crucial parameter for foreign players. Published: February 16, 2023 10:55 PM IST By IANS Sehwag said the competitiveness of IPL has […]","content":"Mumbai: Fifteen years ago, the seeds of a cricket revolution were planted when the Indian Premier League was formed. The IPL has become an emotion that has resonated widely among fans with every season guaranteeing exceptional performances and the birth of a new generation of heroes. The ‘Incredible’ Premier League has grown significantly over the past years, with an additional two teams joining the fray, making it one of the most competitive cricket leagues in the world. Celebrating the success of IPL, Star Sports organised a show – ‘The Incredible Awards’, in the presence of IPL stars and legends of Indian cricket – Harbhajan Singh, Virender Sehwag and Irfan Pathan. Speaking at a press conference organized by Star Sports to celebrate 15 years of the IPL, former Team India opener Virender Sehwag talked about how performance in the T20 franchise tournament has become a crucial parameter for foreign players. “I think the competitiveness of IPL has increased to such a level, that all the players from different countries want to play IPL. The performance they give in IPL are counted and evaluated in their own countries. For example, David Warner performed so well in IPL and after that he got to play in the Australian international team and there also he performed well. In addition, the main advantage of the IPL is that we got young players from small cities, who have emerged and performed well by giving their best with the highest level of competitiveness, Sehwag said. “The IPL has benefited young talent the most. Earlier, nobody got noticed from Ranji Trophy performances and hence couldn’t make it to the Indian team. But now, if you perform well in the IPL and you showcase your talent, then immediately, you get an opportunity to play for the Indian team. Because of the IPL, so many children from smaller states of the country have started taking cricket seriously and try their best to participate in the IPL and strive hard for it. For example, my son is 15 years old and is already working hard to get a chance to play in the IPL.” Former Team India spinner Harbhajan Singh also talked about how the T20 tournament has made uncapped Indian players household names. “The number of youngsters who have got an opportunity would have never thought they would get to share the dressing room with Sachin Tendulkar, Pollock, Shane Warne. When a young cricketer’s family watches him on TV playing alongside a Shane Warne, Virender Sehwag, Sachin Tendulkar, Yuvraj Singh, Dhoni, then there is this feeling of satisfaction among the family as well that the youngster’s hard work has been fruitful. “This was possible only because there was a broadcaster like Star Sports. If there was no television, nobody would have been able to put a face on a player from any team. Today, we know every IPL player’s name and face because of television.” Cricket lovers can watch ‘The Incredible Awards’ on the Star Sports Network at 10PM IST on February 20. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-16 18:48:01","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Do Justin Langer’s cheerleaders really think he was the difference in first Test?","link":"https://www.watoday.com.au/sport/cricket/do-justin-langer-s-cheerleaders-really-think-he-was-the-difference-in-first-test-20230216-p5ckwx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Webster"],"video_url":null,"description":"Too many overstated Langer’s importance when he was coach. Too many have overstated it since his departure.","content":"Of all the reasons tossed up for Australia’s self-immolation in the first Test against India, the dumbest must be that Justin Langer is no longer coach. What, pray tell, could Langer have done? Gathered the troops in a huddle and barked at them for playing off their back foot well within their crease? Produced 11 tiny mirrors and told them to take a long, hard look at themselves? Shown videos from his glory days? Presumably, it would be different to the rev-ups he gave during the two series losses to India in Australia on his watch. His cheerleaders have forgotten that stat. They forget many things. Too many people, especially his former teammates, overstated Langer’s importance during his time as coach. Too many have overstated it since his departure. While he was a critical addition to the Australian set-up following the Newlands ball-tampering scandal, his time was up and showed as much in an interview with Perth radio last year when speculation about his future had reached its peak. “Imagine if a Wallabies coach won the Bledisloe Cup and then the World Cup in six months,” he told 6PR. Former Australia coach Justin Langer in happier times. Credit: Getty Talk about overstating one’s importance. Coaching the Australian cricket team has never been remotely like coaching the Wallabies. The captain is the figurehead, not the coach. The team is now indisputably that of Pat Cummins so, with that in mind, he must wear much of the responsibility over what happened in Nagpur, along with the selectors.","pubDate":"2023-02-16 18:42:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"PSL: \"जब भी वो मिलते हैं...\", पाकिस्तानी स्टार ने मोहम्मद आमिर और बाबर आजम के बीच हुई गहमागहमी पर किया रिएक्ट","link":"https://sports.ndtv.com/hindi/cricket/shoaib-malik-reacts-to-mohammad-amir-vs-babar-azam-face-off-in-a-psl-match-ndtv-india-ndtv-hindi-3789581#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"इस घटना पर प्रतिक्रिया व्यक्त करते हुए शोएब मलिक (Shoaib Malik), जो PSL में कराची किंग्स के लिए खेलते हैं, ने कहा कि खिलाड़ियों को एक-दूसरे का सम्मान करना चाहिए.","content":"Mohammad Amir पाकिस्तान के पूर्व कप्तान शोएब मलिक (Shoaib Malik) ने पाकिस्तान सुपर लीग के दूसरे मैच में मोहम्मद आमिर (Mohammad Amir) और बाबर आजम ( ) के बीच हुई गहमागहमी पर अपनी राय दी है. मंगलवार को हुए मैच (Karachi Kings vs Peshawar Zalmi) में कराची किंग्स के तेज गेंदबाज आमिर को पेशावर जाल्मी के कप्तान बाबर ने छठवें ओवर की पांचवीं गेंद पर चौका लगाया. इसके बाद बाएं हाथ के इस तेज गेंदबाज ने उन्हें एक डॉट गेंद फेंकी और फॉलो थ्रू पर गेंद पकड़ लिया. गेंद हाथ में आने के तुरंत बाद, आमिर ने गुस्से में गेंद फेंक कर अपनी हताशा को गुस्से से दिखाया. Mohammad Amir vs Babar Azam💥 इस घटना पर प्रतिक्रिया व्यक्त करते हुए मलिक, जो आमिर (Mohammad Amir) की ही PSL टीम के लिए खेलते हैं, ने कहा कि खिलाड़ियों को एक-दूसरे का सम्मान करना चाहिए. इसके साथ ही उन्होंने माना कि मैचों के दौरान खिलाड़ियों द्वारा बेहतर प्रदर्शन करने के लिए टकराव (Mohammad Amir vs Babar Azam) या किसी अन्य प्रेरक हरकत का इस्तेमाल किया जाता है. मलिक ने मैच के बाद प्रेस कांफ्रेंस में कहा, \"आपस में सम्मान की कमी नहीं होनी चाहिए. मैंने आमिर, इमाद, बाबर को देखा है... जब भी वो मिलते हैं, वो एक-दूसरे का सम्मान करते हैं.\" उन्होंने आगे कहा, \"इस कमरे में, आप सभी के साथ समान रूप से संगत नहीं होंगे. कुछ अच्छी तरह से मिलेंगे, आप कुछ को पसंद करेंगे और आप कुछ को पसंद नहीं कर सकते हैं. लेकिन यह केवल पेशेवर आधार पर होना चाहिए. मुझे यकीन है सभी एक दूसरे का सम्मान करते हैं.\" मलिक ने कहा, \"यह लीग के लिए अच्छा है. लीग में प्रवेश करने के बाद आपको इस बात पर ध्यान देने की जरूरत है कि आपको अपना सर्वश्रेष्ठ देने के लिए क्या प्रोत्साहित करता है. लेकिन हम जानते हैं कि कोई भी सीमा पार नहीं कर सकता है.\" मैच की बात करें तो पाकिस्तान सुपर लीग (PSL) के दूसरे मैच में पेशावर जाल्मी ने कराची किंग्स को दो रन के करीबी अंतर से हरा दिया. यह बल्लेबाजों के लिए एक शानदार मैच था. कराची के नेशनल क्रिकेट स्टेडियम में इस मैच की दो पारियों में कुल 396 रन बने. * * * पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-16 18:39:19","image_url":"https://c.ndtvimg.com/2023-02/mkkkg35o_mohammad-amir-twitter_625x300_15_February_23.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"UAE May Host Few Matches, India Can Play All Its Matches In Middle-East, Says PCB","link":"https://www.thetimesofbengal.com/sports/uae-may-host-few-matches-india-can-play-all-its-matches-in-middle-east-says-pcb/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Asia Cup 2023: UAE May Host Few Matches, India Can Play All It’s Matches In Middle-East, Says PCB Pakistan were declared hosts of Asia Cup 2023. However, BCCI said India won’t be travelling to Pakistan to play the tournament. India may play its Asia Cup 2023 matches in UAE. (Image: Twitter) Karachi: In […]","content":"Karachi: In a possible solution to the Asia Cup logjam, Pakistan may remain the host and India could be offered to play its matches in the UAE where some games will be held, according to sources in the Board (PCB). In such a scenario, the UAE will also host the final if India qualifies for it, according to a Pakistan Cricket Board (PCB) source. An emergent meeting of the Asian Cricket Council (ACC) was held in Bahrain on February 4 at the behest of PCB chief Najam Sethi after the continental body released its itinerary and Pakistan wasn’t named the hosts of the tournament. Addressing the media here on Thursday, Sethi said more discussions on the hosting of Asia Cup ODI tournament will be held next month on the sidelines of an ICC meeting as the matter “remained unresolved”. “What can I say about what happened in the Asian Cricket Council board meeting. There was no resolution,” Sethi told reporters when asked if Pakistan will host the tournament in September. However, reliable sources aware of the developments, said the most likely solution to the problem appears to be that Pakistan will remain host of the Asia Cup but some matches will also be held in the UAE where India may play all its games, including the final if necessary (if India qualifies for the final). “Sethi made it clear at the ACC meeting that PCB wants to host the event and some of the matches at home,” the source said. The Asia Cup was initially allotted to Pakistan and was scheduled in September this year but BCCI Secretary Jay Shah, who is also the ACC chairman, had announced last October that India will not travel to Pakistan. PTI had reported earlier this month that UAE with three venues — Dubai, Abu Dhabi and Sharjah — are the favourites to host the tournament but a decision has been withheld for the time being. “A shift of venue has been postponed till March. But be rest assured that with India not going to Pakistan, the tournament will have to be shifted,” a senior BCCI official privy to the development had told PTI. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-16 18:38:53","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia rout Sri Lanka by 10 wickets at Women's T20 World Cup","link":"https://www.iol.co.za/sport/cricket/international/australia-rout-sri-lanka-by-10-wickets-at-womens-t20-world-cup-6430e2ca-2eab-4ac0-bac3-886c601f0fc0","keywords":null,"creator":["AFP"],"video_url":null,"description":"Australia’s run of form continued when they hammered Sri Lanka in their T20 World Cup clash at St Georges Park in Gqeberha on Thursday.","content":"Gqeberha — Australian opening batter Alyssa Healy said Australia had adapted well to \"low and slow\" conditions after they scored a commanding 10-wicket win over previously unbeaten Sri Lanka in their Women's T20 World Cup match at St George's Park in Gqeberha on Thursday. The win virtually assured Australia of a place in the semi-finals with three wins out of three, but there's still a possibility of a three-way tie in Group One. Australia's last group match is against South Africa at the same ground on Saturday night. Healy said conditions on Saturday could be very different as she believed a fast, grassy pitch was being prepared to suit South Africa's fast bowlers. \"We just try to adapt to the conditions we get,\" she said. \"We've seen that green seamer lingering out there for Saturday night so it should be a good showdown for the quicks.\" If South Africa win their last two matches and Sri Lanka recover from Thursday's mauling to defeat New Zealand in their final game three teams would have the same number of points. Defending champions Australia, though, have an advantage on net run rate. Sri Lanka were restricted to 112/8 on Thursday after being sent in to bat in overcast conditions. It never looked nearly enough as Healy (54 not out) and Beth Mooney (56 not out) scored freely from the start of the Australian innings. Grace Harris and Megan Schutt were mainly responsible for Sri Lanka's moderate batting performance, although all Australia's bowlers were economical on a slow pitch. Harris ran from mid-on and took a diving catch off Ellyse Perry to end an aggressive innings by Sri Lanka captain Chamari Athapaththu (16) to effect Australia's first breakthrough with the total on 30. Sri Lanka scored 50 in the first seven overs but became becalmed against Australia's slow bowlers. Harris took two wickets in an over with her off-spinners to reduce Sri Lanka to 69/3 as they added only another 19 runs in the seven overs. Schutt took four wickets in her last two overs, while wicketkeeper Healy made three stumpings. Healy and Mooney were seldom troubled as they scored at well above the required run rate. Healy frequently used her feet to Sri Lanka's assortment of spin bowlers and hit six fours and a six off 43 balls, while the left-handed Mooney ended a poor start to her tournament with good timing and placement in striking seven boundaries off 53 deliveries. Mooney was out for nought in a warm-up match against Ireland and made nought and two in her first two innings in the tournament. Athapaththu said Sri Lanka were not disheartened by the result. \"They (Australia) are a world-class team and world champions. We are a young team. If we play our best cricket we can beat New Zealand and play in the semi-finals,\" she insisted. If Australia beat South Africa, a win against New Zealand on Sunday would guarantee a semi-final place for Sri Lanka. Scorecard Sri Lanka 112/8 in 20 overs (H Samarawickrama 34; M Schutt 4/24, G Harris 2-7) Australia 113/0 in 15.5 overs (B Mooney 56 not out, A Healy 54 not out) Australia won by 10 wickets AFP Share","pubDate":"2023-02-16 18:21:22","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/c3ef9051-84c3-58cb-873f-e5f24357b6ca&operation=CROP&offset=0x101&resize=4746x2666","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"More corporates encouraged to invest in women sport","link":"https://sundayworld.co.za/news/sport/other-sports/more-corporates-encouraged-to-invest-in-women-sport/","keywords":["Other Sports"],"creator":["Siyasanga Monoalibe"],"video_url":null,"description":"The year 2023 has since been regarded as the “year for women”, with South African female national teams taking part in some of the biggest global tournaments. At the back of the announcement by Discovery of a three-year sponsorship deal with Netball SA as the official wellness partner to the Spar Proteas, and Vitality as […]","content":"The year 2023 has since been regarded as the “year for women”, with South African female national teams taking part in some of the biggest global tournaments. At the back of the announcement by Discovery of a three-year sponsorship deal with Netball SA as the official wellness partner to the Spar Proteas, and Vitality as the title partner of the Netball World Cup last week Thursday, tournament director Priscilla Masisi said that corporates coming on board will not only empower young girls but go as far as benefiting the nation. “I think it will go a very long way, because if you empower a girl child, you are empowering the nation,” said Masisi. “And you get your girl children in the right direction, our society will improve because women have that strength of direction and focus their energy on the right direction and instilling positive attitudes. “So, I think if you empower a girl child, you are basically empowering the nation. So, it will be very important if our sponsors, partners, and businesses can come on and support sports in this country. Masisi went on to emphasise the importance of development in schools, saying that a lot more still needs to be done at grassroot level. “I think we still have a long way to go, remember school sport is the bedrock,” Masisi said. “So, I think we need to get to a point whereby we go back to those days where we have sports days on Wednesdays and run interschool competitions, those things are very important, we need to go back to those grassroot developments, grassroots are also about school sport. We need to go back to those basics.” Currently, the Momentum Proteas are battling it out in the ICC T20 World Cup held in SA, while the U-19 cricket squad participated in the Cricket World Cup earlier this year. Banyana Banyana, the reigning Women’s Africa Cup of Nations champions, will be tested at the biggest stage when they challenge for the Fifa Women’s World Cup in Australia and New Zealand from July 20, which will be followed by the Vitality Netball World Cup in July 28, where the Spar Proteas will be expected to deliver on home soil. For the latest sport news from Sunday World, click here. Follow @SundayWorldZA on Twitter and @sundayworldza on Instagram, or like our Facebook Page, Sunday World, by clicking here for the latest breaking news in South Africa. To Subscribe to Sunday World, click here","pubDate":"2023-02-16 18:16:45","image_url":"https://sundayworld.co.za/wp-content/uploads/2023/02/P22-netbal.jpg","source_id":"sundayworld","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Saudi Arabia enters race for Manchester United: Report","link":"https://www.livemint.com/sports/football-news/saudi-arabia-enters-race-for-manchester-united-report-11676574091906.html","keywords":null,"creator":null,"video_url":null,"description":"Saudi Arabia has submitted a bid for British soccer club Manchester United","content":"Saudi Arabia has submitted a bid for British soccer club Manchester United PLC ahead of Friday's deadline, the Telegraph reported on Thursday. Multiple private groups in Riyadh have made formal inquiries, the report added. TRENDING STORIES See All Premium World Bank may loosen loan ratio to free up $4 billion ... Premium Visa CFO Vasant Prabhu set to retire as firm gets new l ... Premium Senior citizens in US are richer than thought, Census B ... Premium Russia launches 36 missiles across Ukraine today British billionaire Jim Ratcliffe, a life-long supporter of the club and founder of chemicals firm INEOS, is a likely bidder, along with U.S. private equity firms and possibly Qatari investors, sources told Reuters. A deal for the record 13-times English Premier League winners will likely exceed the biggest sports deal so far, the $5.2 billion - including debt and investments - paid for Chelsea, the sources added. Manchester United is the fourth richest soccer club in the world, according to analysis by Deloitte. A small portion of Manchester United shares is listed in the United States with a market capitalization of more than $4 billion, as of Wednesday's close. MORE FROM THIS SECTION See All Premium Premium India can have its matches in UAE: Pakistan Cricket Boa ... Premium Premium Sania Mirza to mentor Women’s Premier League team RCB Premium Premium Women's Premier League 2023 match schedule: Finals on 2 ... Premium Premium Saudi Arabia selected as Club World Cup 2023 hosts The club declined to comment on the matter. Catch all the Sports News and Updates on Live Mint. Download The Mint News App to get Daily Market Updates & Live Business News . More Less OPEN IN APP","pubDate":"2023-02-16 20:28:14","image_url":"https://images.livemint.com/img/2023/02/16/1600x900/MANCHESTER-UNITED_1676579230059_1676579230390_1676579230390.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"Team India change hotel in Delhi; Kohli not with squad","link":"https://thenorthlines.com/team-india-change-hotel-in-delhi-kohli-not-with-squad/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   A dearth of five-star hotel rooms due to the G20 Summit and wedding season has forced Team India to abruptly move from their regular hotel in Delhi ahead of the second Test against Australia. The second match of the Border-Gavaskar Trophy series begins at Delhi’s Arun Jaitley Stadium on Friday. Delhi is hosting […] The post Team India change hotel in Delhi; Kohli not with squad appeared first on Northlines.","content":"Agencies A dearth of five-star hotel rooms due to the G20 Summit and wedding season has forced Team India to abruptly move from their regular hotel in Delhi ahead of the second Test against Australia. The second match of the Border-Gavaskar Trophy series begins at Delhi’s Arun Jaitley Stadium on Friday. Delhi is hosting its first Test since December 2017. The Indian cricket team usually stays at Taj Palace or ITC Maurya in Delhi, but this time they are put up at Hotel Leela in Karkarduma, according to sources. “This time team is staying in a different hotel which is in another part of Delhi; the hotel is in Karkarduma as we didn’t get a stay in ITC Maurya or Taj. This happened because of the heavy wedding season and G20,” a source told ANI. Virat Kohli isn’t staying with the team. The former India captain, whose family resides in Delhi, decided to spend some quality time with his folks for a few days at his house in Gurugram. While India posted 400 runs in the first innings of the opening Test against Australia, Kohli struggled with the bat, scoring just 12 runs off off 26 balls. Merely two sessions of play were needed to achieve a result on the third day of the Test as India took a 1-0 lead in Nagpur. After stretching their lead to over 200 runs, India bowled out Australia for 91 in about a session to win the Test by innings and 132 runs. Ravindra Jadeja was the ‘Player of the Match’ after bowling figures of 7-81 and 70 runs with the willow. Teams: Australia: Pat Cummins (Captain), Ashton Agar, Scott Boland, Alex Carey, Cameron Green, Peter Handscomb, Josh Hazlewood, Travis Head, Usman Khawaja, Matt Kuhnemann, Marnus Labuschagne, Nathan Lyon, Lance Morris, Todd Murphy, Matthew Renshaw, Steve Smith (vice-captain), Mitchell Starc, Mitchell Swepson and David Warner. India: (for the first two Tests) Rohit Sharma (Captain), KL Rahul (vice-captain), Shubman Gill, Cheteshwar Pujara, Virat Kohli, Shreyas Iyer, KS Bharat, Ishan Kishan, Ravichandran Ashwin, Axar Patel, Kuldeep Yadav, Ravindra Jadeja, Mohammed Shami, Mohammed Siraj, Umesh Yadav and Suryakumar Yadav.","pubDate":"2023-02-16 19:06:17","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC apologises for ranking glitch which showed India as No.1 Test side","link":"https://thenorthlines.com/icc-apologises-for-ranking-glitch-which-showed-india-as-no-1-test-side/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"The International Cricket Council (ICC) has apologised for the technical glitch, which saw India displace Australia to attain the No.1 spot in the men’s Test team rankings on Wednesday. Hours after India had ‘topped’ the Test ranking, the ICC issued another updated list that showed Rohit Sharma’s side back at No.2. It gave the impression […] The post ICC apologises for ranking glitch which showed India as No.1 Test side appeared first on Northlines.","content":"The International Cricket Council (ICC) has apologised for the technical glitch, which saw India displace Australia to attain the No.1 spot in the men’s Test team rankings on Wednesday. Hours after India had ‘topped’ the Test ranking, the ICC issued another updated list that showed Rohit Sharma’s side back at No.2. It gave the impression that Rohit’s team had briefly claimed the top spot following its innings and 132-run win over the Pat Cummins-led Australia in Nagpur. On Thursday, the game’s global body admitted the error and said in a statement that the “ICC acknowledges, for a short period of time on February 15, 2023 that, due to a technical error, India were erroneously displayed as the No.1 Test team on the ICC website. “We apologise for any inconvenience caused.” “Australia remain on top of the ICC Test Team Rankings after the latest update following the conclusion of Zimbabwe’s two-match series against West Indies.” “Australia will head into the second Test against India in Delhi, starting on Friday, January 17, as the No.1-ranked team with 126 rating points, 11 above India’s 115,” the ICC statement added.","pubDate":"2023-02-16 19:02:45","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Steve Smith’s New York cricket dream a giant leap closer","link":"https://www.watoday.com.au/sport/cricket/steve-smith-s-new-york-cricket-dream-a-giant-leap-closer-20230216-p5cl63.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Cricket NSW has signed an agreement with America’s Major League Cricket that will open the door for players to head stateside for the inaugural competition in July.","content":"Two of Steve Smith’s great loves, cricket and New York , are on course to collide after Cricket NSW sealed a deal with America’s Major League Cricket to provide opportunities for exchange and development for players and staff. While Smith will be unavailable for the inaugural MLC competition in July because of the Ashes, Cricket NSW CEO Lee Germon hopes a number of NSW players will have the chance to join the six franchises competing in the three-week Twenty20 tournament. “I think the opportunities for all of our players are going to be brilliant,” Germon said before Friday’s official announcement. “Steve absolutely has made no secret that he loves New York, but there are also two or three other players I’ve spoken to who would love to be able to play cricket in the United States. “We’re looking at every opportunity we can to grow the game, develop the game and promote the game and I think we saw with Steve this year coming back to play with the Sixers and the BBL , the impact he had. “So absolutely we’ll look to utilise the players within the New South Wales ecosystem to not only highlight the T20 competition and Major League Cricket, but also the development of cricket in that country as well.” Steve Smith was in exceptional form for the Sixers, including back-to-back centuries ahead of the India tour. Credit: Getty Smith told the Herald and The Age in September that it would be “cool” to play cricket in New York. “I mean, yeah, there’s obviously [T20] leagues popping up everywhere around the world now, and I think you’ll probably see more players in the back end of their career going down that route, so it’s potentially something I’ll look at in the future,” Smith said. “There’s no reason why cricket can’t work [in the US], I wouldn’t think.","pubDate":"2023-02-16 19:00:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"My Son Is 15 Years Old And Already Working Hard To Get Chance To Play In IPL: Sehwag","link":"https://www.thetimesofbengal.com/sports/my-son-is-15-years-old-and-already-working-hard-to-get-chance-to-play-in-ipl-sehwag/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports My Son Is 15 Years Old And Already Working Hard To Get Chance To Play In IPL: Sehwag Virender Sehwag talked about how performance in the T20 franchise tournament has become a crucial parameter for foreign players. Published: February 16, 2023 10:55 PM IST By IANS Sehwag said the competitiveness of IPL has […]","content":"Mumbai: Fifteen years ago, the seeds of a cricket revolution were planted when the Indian Premier League was formed. The IPL has become an emotion that has resonated widely among fans with every season guaranteeing exceptional performances and the birth of a new generation of heroes. The ‘Incredible’ Premier League has grown significantly over the past years, with an additional two teams joining the fray, making it one of the most competitive cricket leagues in the world. Celebrating the success of IPL, Star Sports organised a show – ‘The Incredible Awards’, in the presence of IPL stars and legends of Indian cricket – Harbhajan Singh, Virender Sehwag and Irfan Pathan. Speaking at a press conference organized by Star Sports to celebrate 15 years of the IPL, former Team India opener Virender Sehwag talked about how performance in the T20 franchise tournament has become a crucial parameter for foreign players. “I think the competitiveness of IPL has increased to such a level, that all the players from different countries want to play IPL. The performance they give in IPL are counted and evaluated in their own countries. For example, David Warner performed so well in IPL and after that he got to play in the Australian international team and there also he performed well. In addition, the main advantage of the IPL is that we got young players from small cities, who have emerged and performed well by giving their best with the highest level of competitiveness, Sehwag said. “The IPL has benefited young talent the most. Earlier, nobody got noticed from Ranji Trophy performances and hence couldn’t make it to the Indian team. But now, if you perform well in the IPL and you showcase your talent, then immediately, you get an opportunity to play for the Indian team. Because of the IPL, so many children from smaller states of the country have started taking cricket seriously and try their best to participate in the IPL and strive hard for it. For example, my son is 15 years old and is already working hard to get a chance to play in the IPL.” Former Team India spinner Harbhajan Singh also talked about how the T20 tournament has made uncapped Indian players household names. “The number of youngsters who have got an opportunity would have never thought they would get to share the dressing room with Sachin Tendulkar, Pollock, Shane Warne. When a young cricketer’s family watches him on TV playing alongside a Shane Warne, Virender Sehwag, Sachin Tendulkar, Yuvraj Singh, Dhoni, then there is this feeling of satisfaction among the family as well that the youngster’s hard work has been fruitful. “This was possible only because there was a broadcaster like Star Sports. If there was no television, nobody would have been able to put a face on a player from any team. Today, we know every IPL player’s name and face because of television.” Cricket lovers can watch ‘The Incredible Awards’ on the Star Sports Network at 10PM IST on February 20. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-16 18:48:01","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Do Justin Langer’s cheerleaders really think he was the difference in first Test?","link":"https://www.watoday.com.au/sport/cricket/do-justin-langer-s-cheerleaders-really-think-he-was-the-difference-in-first-test-20230216-p5ckwx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Webster"],"video_url":null,"description":"Too many overstated Langer’s importance when he was coach. Too many have overstated it since his departure.","content":"Of all the reasons tossed up for Australia’s self-immolation in the first Test against India, the dumbest must be that Justin Langer is no longer coach. What, pray tell, could Langer have done? Gathered the troops in a huddle and barked at them for playing off their back foot well within their crease? Produced 11 tiny mirrors and told them to take a long, hard look at themselves? Shown videos from his glory days? Presumably, it would be different to the rev-ups he gave during the two series losses to India in Australia on his watch. His cheerleaders have forgotten that stat. They forget many things. Too many people, especially his former teammates, overstated Langer’s importance during his time as coach. Too many have overstated it since his departure. While he was a critical addition to the Australian set-up following the Newlands ball-tampering scandal, his time was up and showed as much in an interview with Perth radio last year when speculation about his future had reached its peak. “Imagine if a Wallabies coach won the Bledisloe Cup and then the World Cup in six months,” he told 6PR. Former Australia coach Justin Langer in happier times. Credit: Getty Talk about overstating one’s importance. Coaching the Australian cricket team has never been remotely like coaching the Wallabies. The captain is the figurehead, not the coach. The team is now indisputably that of Pat Cummins so, with that in mind, he must wear much of the responsibility over what happened in Nagpur, along with the selectors.","pubDate":"2023-02-16 18:42:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"PSL: \"जब भी वो मिलते हैं...\", पाकिस्तानी स्टार ने मोहम्मद आमिर और बाबर आजम के बीच हुई गहमागहमी पर किया रिएक्ट","link":"https://sports.ndtv.com/hindi/cricket/shoaib-malik-reacts-to-mohammad-amir-vs-babar-azam-face-off-in-a-psl-match-ndtv-india-ndtv-hindi-3789581#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"इस घटना पर प्रतिक्रिया व्यक्त करते हुए शोएब मलिक (Shoaib Malik), जो PSL में कराची किंग्स के लिए खेलते हैं, ने कहा कि खिलाड़ियों को एक-दूसरे का सम्मान करना चाहिए.","content":"Mohammad Amir पाकिस्तान के पूर्व कप्तान शोएब मलिक (Shoaib Malik) ने पाकिस्तान सुपर लीग के दूसरे मैच में मोहम्मद आमिर (Mohammad Amir) और बाबर आजम ( ) के बीच हुई गहमागहमी पर अपनी राय दी है. मंगलवार को हुए मैच (Karachi Kings vs Peshawar Zalmi) में कराची किंग्स के तेज गेंदबाज आमिर को पेशावर जाल्मी के कप्तान बाबर ने छठवें ओवर की पांचवीं गेंद पर चौका लगाया. इसके बाद बाएं हाथ के इस तेज गेंदबाज ने उन्हें एक डॉट गेंद फेंकी और फॉलो थ्रू पर गेंद पकड़ लिया. गेंद हाथ में आने के तुरंत बाद, आमिर ने गुस्से में गेंद फेंक कर अपनी हताशा को गुस्से से दिखाया. Mohammad Amir vs Babar Azam💥 इस घटना पर प्रतिक्रिया व्यक्त करते हुए मलिक, जो आमिर (Mohammad Amir) की ही PSL टीम के लिए खेलते हैं, ने कहा कि खिलाड़ियों को एक-दूसरे का सम्मान करना चाहिए. इसके साथ ही उन्होंने माना कि मैचों के दौरान खिलाड़ियों द्वारा बेहतर प्रदर्शन करने के लिए टकराव (Mohammad Amir vs Babar Azam) या किसी अन्य प्रेरक हरकत का इस्तेमाल किया जाता है. मलिक ने मैच के बाद प्रेस कांफ्रेंस में कहा, \"आपस में सम्मान की कमी नहीं होनी चाहिए. मैंने आमिर, इमाद, बाबर को देखा है... जब भी वो मिलते हैं, वो एक-दूसरे का सम्मान करते हैं.\" उन्होंने आगे कहा, \"इस कमरे में, आप सभी के साथ समान रूप से संगत नहीं होंगे. कुछ अच्छी तरह से मिलेंगे, आप कुछ को पसंद करेंगे और आप कुछ को पसंद नहीं कर सकते हैं. लेकिन यह केवल पेशेवर आधार पर होना चाहिए. मुझे यकीन है सभी एक दूसरे का सम्मान करते हैं.\" मलिक ने कहा, \"यह लीग के लिए अच्छा है. लीग में प्रवेश करने के बाद आपको इस बात पर ध्यान देने की जरूरत है कि आपको अपना सर्वश्रेष्ठ देने के लिए क्या प्रोत्साहित करता है. लेकिन हम जानते हैं कि कोई भी सीमा पार नहीं कर सकता है.\" मैच की बात करें तो पाकिस्तान सुपर लीग (PSL) के दूसरे मैच में पेशावर जाल्मी ने कराची किंग्स को दो रन के करीबी अंतर से हरा दिया. यह बल्लेबाजों के लिए एक शानदार मैच था. कराची के नेशनल क्रिकेट स्टेडियम में इस मैच की दो पारियों में कुल 396 रन बने. * * * पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-16 18:39:19","image_url":"https://c.ndtvimg.com/2023-02/mkkkg35o_mohammad-amir-twitter_625x300_15_February_23.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"UAE May Host Few Matches, India Can Play All Its Matches In Middle-East, Says PCB","link":"https://www.thetimesofbengal.com/sports/uae-may-host-few-matches-india-can-play-all-its-matches-in-middle-east-says-pcb/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports Asia Cup 2023: UAE May Host Few Matches, India Can Play All It’s Matches In Middle-East, Says PCB Pakistan were declared hosts of Asia Cup 2023. However, BCCI said India won’t be travelling to Pakistan to play the tournament. India may play its Asia Cup 2023 matches in UAE. (Image: Twitter) Karachi: In […]","content":"Karachi: In a possible solution to the Asia Cup logjam, Pakistan may remain the host and India could be offered to play its matches in the UAE where some games will be held, according to sources in the Board (PCB). In such a scenario, the UAE will also host the final if India qualifies for it, according to a Pakistan Cricket Board (PCB) source. An emergent meeting of the Asian Cricket Council (ACC) was held in Bahrain on February 4 at the behest of PCB chief Najam Sethi after the continental body released its itinerary and Pakistan wasn’t named the hosts of the tournament. Addressing the media here on Thursday, Sethi said more discussions on the hosting of Asia Cup ODI tournament will be held next month on the sidelines of an ICC meeting as the matter “remained unresolved”. “What can I say about what happened in the Asian Cricket Council board meeting. There was no resolution,” Sethi told reporters when asked if Pakistan will host the tournament in September. However, reliable sources aware of the developments, said the most likely solution to the problem appears to be that Pakistan will remain host of the Asia Cup but some matches will also be held in the UAE where India may play all its games, including the final if necessary (if India qualifies for the final). “Sethi made it clear at the ACC meeting that PCB wants to host the event and some of the matches at home,” the source said. The Asia Cup was initially allotted to Pakistan and was scheduled in September this year but BCCI Secretary Jay Shah, who is also the ACC chairman, had announced last October that India will not travel to Pakistan. PTI had reported earlier this month that UAE with three venues — Dubai, Abu Dhabi and Sharjah — are the favourites to host the tournament but a decision has been withheld for the time being. “A shift of venue has been postponed till March. But be rest assured that with India not going to Pakistan, the tournament will have to be shifted,” a senior BCCI official privy to the development had told PTI. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-02-16 18:38:53","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia rout Sri Lanka by 10 wickets at Women's T20 World Cup","link":"https://www.iol.co.za/sport/cricket/international/australia-rout-sri-lanka-by-10-wickets-at-womens-t20-world-cup-6430e2ca-2eab-4ac0-bac3-886c601f0fc0","keywords":null,"creator":["AFP"],"video_url":null,"description":"Australia’s run of form continued when they hammered Sri Lanka in their T20 World Cup clash at St Georges Park in Gqeberha on Thursday.","content":"Gqeberha — Australian opening batter Alyssa Healy said Australia had adapted well to \"low and slow\" conditions after they scored a commanding 10-wicket win over previously unbeaten Sri Lanka in their Women's T20 World Cup match at St George's Park in Gqeberha on Thursday. The win virtually assured Australia of a place in the semi-finals with three wins out of three, but there's still a possibility of a three-way tie in Group One. Australia's last group match is against South Africa at the same ground on Saturday night. Healy said conditions on Saturday could be very different as she believed a fast, grassy pitch was being prepared to suit South Africa's fast bowlers. \"We just try to adapt to the conditions we get,\" she said. \"We've seen that green seamer lingering out there for Saturday night so it should be a good showdown for the quicks.\" If South Africa win their last two matches and Sri Lanka recover from Thursday's mauling to defeat New Zealand in their final game three teams would have the same number of points. Defending champions Australia, though, have an advantage on net run rate. Sri Lanka were restricted to 112/8 on Thursday after being sent in to bat in overcast conditions. It never looked nearly enough as Healy (54 not out) and Beth Mooney (56 not out) scored freely from the start of the Australian innings. Grace Harris and Megan Schutt were mainly responsible for Sri Lanka's moderate batting performance, although all Australia's bowlers were economical on a slow pitch. Harris ran from mid-on and took a diving catch off Ellyse Perry to end an aggressive innings by Sri Lanka captain Chamari Athapaththu (16) to effect Australia's first breakthrough with the total on 30. Sri Lanka scored 50 in the first seven overs but became becalmed against Australia's slow bowlers. Harris took two wickets in an over with her off-spinners to reduce Sri Lanka to 69/3 as they added only another 19 runs in the seven overs. Schutt took four wickets in her last two overs, while wicketkeeper Healy made three stumpings. Healy and Mooney were seldom troubled as they scored at well above the required run rate. Healy frequently used her feet to Sri Lanka's assortment of spin bowlers and hit six fours and a six off 43 balls, while the left-handed Mooney ended a poor start to her tournament with good timing and placement in striking seven boundaries off 53 deliveries. Mooney was out for nought in a warm-up match against Ireland and made nought and two in her first two innings in the tournament. Athapaththu said Sri Lanka were not disheartened by the result. \"They (Australia) are a world-class team and world champions. We are a young team. If we play our best cricket we can beat New Zealand and play in the semi-finals,\" she insisted. If Australia beat South Africa, a win against New Zealand on Sunday would guarantee a semi-final place for Sri Lanka. Scorecard Sri Lanka 112/8 in 20 overs (H Samarawickrama 34; M Schutt 4/24, G Harris 2-7) Australia 113/0 in 15.5 overs (B Mooney 56 not out, A Healy 54 not out) Australia won by 10 wickets AFP Share","pubDate":"2023-02-16 18:21:22","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/c3ef9051-84c3-58cb-873f-e5f24357b6ca&operation=CROP&offset=0x101&resize=4746x2666","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"More corporates encouraged to invest in women sport","link":"https://sundayworld.co.za/news/sport/other-sports/more-corporates-encouraged-to-invest-in-women-sport/","keywords":["Other Sports"],"creator":["Siyasanga Monoalibe"],"video_url":null,"description":"The year 2023 has since been regarded as the “year for women”, with South African female national teams taking part in some of the biggest global tournaments. At the back of the announcement by Discovery of a three-year sponsorship deal with Netball SA as the official wellness partner to the Spar Proteas, and Vitality as […]","content":"The year 2023 has since been regarded as the “year for women”, with South African female national teams taking part in some of the biggest global tournaments. At the back of the announcement by Discovery of a three-year sponsorship deal with Netball SA as the official wellness partner to the Spar Proteas, and Vitality as the title partner of the Netball World Cup last week Thursday, tournament director Priscilla Masisi said that corporates coming on board will not only empower young girls but go as far as benefiting the nation. “I think it will go a very long way, because if you empower a girl child, you are empowering the nation,” said Masisi. “And you get your girl children in the right direction, our society will improve because women have that strength of direction and focus their energy on the right direction and instilling positive attitudes. “So, I think if you empower a girl child, you are basically empowering the nation. So, it will be very important if our sponsors, partners, and businesses can come on and support sports in this country. Masisi went on to emphasise the importance of development in schools, saying that a lot more still needs to be done at grassroot level. “I think we still have a long way to go, remember school sport is the bedrock,” Masisi said. “So, I think we need to get to a point whereby we go back to those days where we have sports days on Wednesdays and run interschool competitions, those things are very important, we need to go back to those grassroot developments, grassroots are also about school sport. We need to go back to those basics.” Currently, the Momentum Proteas are battling it out in the ICC T20 World Cup held in SA, while the U-19 cricket squad participated in the Cricket World Cup earlier this year. Banyana Banyana, the reigning Women’s Africa Cup of Nations champions, will be tested at the biggest stage when they challenge for the Fifa Women’s World Cup in Australia and New Zealand from July 20, which will be followed by the Vitality Netball World Cup in July 28, where the Spar Proteas will be expected to deliver on home soil. For the latest sport news from Sunday World, click here. Follow @SundayWorldZA on Twitter and @sundayworldza on Instagram, or like our Facebook Page, Sunday World, by clicking here for the latest breaking news in South Africa. To Subscribe to Sunday World, click here","pubDate":"2023-02-16 18:16:45","image_url":"https://sundayworld.co.za/wp-content/uploads/2023/02/P22-netbal.jpg","source_id":"sundayworld","category":["sports"],"country":["south africa"],"language":"english"}]}