{"newsArray":[{"article_id":"889d5a887db75437e5c4215bf5f84cc8","title":"Wrist injection has Steve Smith primed for World Cup","link":"https://www.brisbanetimes.com.au/sport/cricket/wrist-injection-has-steve-smith-primed-for-world-cup-20230914-p5e4n7.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"The Australian batsman revealed he needed a cortisone injection for a niggling wrist problem ahead of his departure for the World Cup in India.","content":"Steve Smith is off to India on Monday in pursuit of Australia’s’ sixth ODI World Cup, but has revealed he needed a cortisone injection for a niggling left wrist problem before he could get back in the nets. The wrist trouble, which began when he injured it in the field on the final day of the Lord’s Ashes Test, affected Smith during the final three matches and lingered at home even after he spent two weeks in a brace to limit movement and promote healing. Steve Smith launched the New Balance store in Bondi Junction last week. Credit: Dion Georgopoulos Having already been ruled out of the white-ball tour of South Africa and with time ticking down to the trip to India and pursuit of the ODI World Cup, 34-year-old Smith’s medical advisors resorted to cortisone, which eradicated lingering pain in time to allow him to return to training last week , before his departure for India on Monday. “I was in a brace for a couple of weeks, just trying to limit the movement, which once I got that off it hadn’t really made a big difference to be honest,” Smith told this masthead at the opening of the New Balance store in Bondi Junction. “Then I got a cortisone in it last Thursday, and that has made a big difference. So I’ve had a couple of sessions back batting now and it feels pretty normal. Loading “Hopefully, I don’t need another one and it just settles it down. But the part of the wrist it is, they’ve said that if I do need another one, then that’ll be no stress as well. Fingers crossed that it just heals up and it’s fine, but [it is] feeling good at the moment.” While Smith fought through the pain barrier in England, freedom and confidence in his wrist will be hugely important in white ball matches in India, where he will need to be able to push the scoring rate and clear the boundary at times. “Initially in the nets, a couple of balls I faced where I got inside edges to them and your bat turns sharply, I was a bit wary of that to begin with because that’s what was actually one of the things causing my pain,” he said. “I inside-edged a couple of balls in the nets the other day and my bat turned sharp, and I was like ‘oh, that was hurting before’ and it wasn’t hurting anymore. So that’s a real positive, and I feel as though I can play all my shots and there’s no pain at all.” With Australia’s World Cup squad of 15 to be finalised on September 28, Marnus Labuschagne is now in line to squeeze into the group after Travis Head suffered a fractured hand in South Africa. Smith may now find himself at No. 3 in the batting order if heavy-hitting Mitchell Marsh partners David Warner in Head’s place. “I think I average 55 at three, or something like that, so it’s definitely my preferred spot. But I’ll do whatever the team needs,” Smith said. “White-ball cricket, you’d love to bat as high as you can, so we’ll see what they want to do. “When you look at World Cups as opposed to the standard bilateral series, I reckon the scores naturally come down a little bit anyway, with the extra pressure of big games and things like that. Then you throw in the mix that wickets are going to be wearing and turning. “You want to be hitting your straps in the big tournaments; that’s what everyone wants to win. It’s not like I’m saying every game isn’t important, but big tournaments are the ones you want to win. We did that in 2015 and that was really special.” Loading In his net sessions in India, Smith will have to get used to wearing a neck guard after Cricket Australia made the extra protection mandatory following nearly a decade of research and consideration. “It’s not my ideal choice, but it’s come in, so I’m going to have to run with it,” Smith said, after having to wear one in county cricket earlier this year where neck guards were made compulsory in 2022. “I didn’t know the rules and the umpires said I needed to get a neck guard. I got one on and it was kind of just normal. It feels a little bit odd at the start and after a session or two you get used to it and forget it’s there. “My collar that I usually like to wear up, that just hits against it, so I’ll have to wear my collar down and that was the thing that was annoying me the most. Easy adjustment.” After protracted negotiations with Cricket Australia lasting two seasons, Smith overturned perceptions of his waning worth as a Twenty20 batter with a series of startling displays for the Sydney Sixers in last season’s Big Bash League. Steve Smith will nominate for the Indian Premier League auction for 2024. Credit: Dion Georgopoulos As a consequence, he was pencilled in to open the batting in the T20 series in South Africa before the wrist injury got in the way, and is optimistic about his chances of being picked up by a team at the next Indian Premier League auction. The 2024 tournament is proving increasingly attractive to Australian cricketers due to their lighter touring schedule in 2024. “I’ll be throwing my hat in the ring for sure,” Smith said. Loading “It’s a tournament I loved playing in the past, it’s a great challenge. All the best players from around the world are there. “I feel like I’m learning all the time and my game’s progressing, so I think I showed what I’m capable of up the top of the order in the Big Bash in the few games that I played, and the amount of sixes I hit as well.” News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Steve Smith Cricket Australia Cricket World Cup Daniel Brettig is The Age's chief cricket writer and the author of several books on cricket. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-09-17 03:38:03","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"cc5e79f3e1118da360e7ae9cbe6147d7","title":"Asia Cup 2023 Final: फाइनल से पहले कप्तान दासुन शनाका के बयान ने मचाई खलबली, \"बेशक, हम फाइनल...\"","link":"https://sports.ndtv.com/hindi/cricket/dasun-shanaka-praise-his-team-player-after-defeat-pakistan-and-also-talk-about-india-vs-sri-lanka-asia-cup-2023-final-4397049#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Dasun Shanaka on Asia Cup 2023 Final: गत चैंपियन श्रीलंका रविवार को कोलंबो के आर प्रेमदासा स्टेडियम में एशिया कप 2023 के फाइनल में भारत से भिड़ेगी.","content":"Asia Cup 2023 Final IND vs SL पाकिस्तान को हराकर लगातार दूसरी बार एशिया कप के फाइनल में पहुंचने के बाद श्रीलंकाई कप्तान शनाका (Dasun Shanaka on SL vs PAK) ने पाकिस्तान के खिलाफ जीत को याद करते हुए हुए खिलाड़ियों का हौसला बढ़ाया. शनाका ने इस बात पर ज्यादा जोड़ दिया की उनकी टीम को बस भारत के हाथों हार का सामना करना पड़ा है. ऑलराउंडर ने भारत के खिलाफ मैच में लड़ने की भावना के लिए टीम को श्रेय दिया, जहां डुनिथ वेलालेज (Dunith Wellalage Five Wicket Hall) के पांच विकेट और चैरिथ असलांका के चार विकेट ने उन्हें मेहमान टीम को 213 रन पर समेटने में मदद की. यंगस्टर वेललेज ने एक उल्लेखनीय उपलब्धि हासिल की और उन्होंने अपना स्थान सुरक्षित कर लिया. उन्होनें पहली बार 5 विकेट लेने का कारनामा किया और अकेले दम पर मजबूत भारतीय बल्लेबाजी लाइनअप को ध्वस्त करना और रोहित शर्मा, शुबमन गिल, विराट कोहली, केएल राहुल और हार्दिक पंड्या जैसे शीर्ष बल्लेबाजों का विकेट हासिल किया. “हाँ, श्रीलंका सही समय पर शिखर पर है. आप जानते हैं कि लड़के जानबूझकर देश के लिए अच्छा प्रदर्शन करना चाहते हैं. एक टीम के रूप में हम कमज़ोर रहे हैं, इसलिए हर कोई बड़े मंच पर प्रदर्शन करना चाहता है. इन युवाओं को दुनिया को दिखाना होगा कि वे क्या करने में सक्षम हैं. यह इस युवा टीम का रहस्य है, \"दसुना (Dasun Shanaka on Asia Cup FInal) ने शनिवार को श्रीलंका क्रिकेट बोर्ड के यूट्यूब चैनल के हवाले से प्री-मैच प्रेस कॉन्फ्रेंस में कहा. असालंका ने भी भारत को काफी परेशान किया और 18 रन देकर 4 विकेट लिए, जबकि धनंजय डी सिल्वा ने एक छोर से चीजों को शांत रखा, जबकि अन्य गेंदबाजों ने विपरीत छोर से विकेट लिए. “भारत के खेल में, आपने देखा कि हमने गेंदबाजी में पहले 10 ओवरों के बाद किस तरह संघर्ष किया. वो (प्रशंसक) इन खिलाडि़यों (डुनिथ वेलालेज, मथीशा पथिराना और चैरिथ असलांका और पथुम निसांका) जैसे युवा बल्लेबाजों को यह देखना पसंद करते हैं कि वे इस खेल में कैसे कमाल करते हैं. सदीरा समरविक्रमा को भी नहीं भूलना चाहिए,'' दासुन शनाका ने कहा. शनाका (Dasun Shanaka on IND vs SL Asia Cup Final) ने कहा कि अगर उन्हें एशिया कप जीतने का मौका चाहिए तो उन्हें भारत के खिलाफ अपने सुपर 4 प्रदर्शन को दोहराना होगा. “बेशक, हम एशिया कप 2023 फाइनल के लिए तैयार हैं. देखिए, यह पूरी तरह से पिच पर निर्भर करता है. इस टूर्नामेंट में पिचें अहम भूमिका निभा रही हैं. पिच आंकड़ों के अनुसार, हम एक अच्छी टीम चुन रहे हैं, खासकर भारत के खिलाफ गेंदबाजी करते हुए, हमें पहले से अधिक विकेट लेने की जरूरत है. इससे हमारे लिए खेल खुल जाता है.\" उन्होंने कहा. श्रीलंका के कप्तान दासुन शनाका ने रविवार को कोलंबो के आर प्रेमदासा स्टेडियम में खेले जाने वाले एशिया कप 2023 के फाइनल में पहुंचने के लिए अपनी टीम की प्रशंसा की. गत चैंपियन श्रीलंका रविवार को कोलंबो के आर प्रेमदासा स्टेडियम में एशिया कप 2023 के फाइनल में भारत से भिड़ेगी. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-09-17 01:52:13","image_url":"https://c.ndtvimg.com/2023-09/lcf8jj7_dasun-shanaka-afp_625x300_16_September_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"f19b0cfd82e3dab01e3c1431510a8d79","title":"St Kilda lose a premiership hero: ‘Cowboy’ Neale dies at 78","link":"https://www.brisbanetimes.com.au/sport/afl/st-kilda-lose-a-premiership-hero-cowboy-neale-dies-at-78-20230917-p5e5af.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Claire Siracusa and Jon Pierik"],"video_url":null,"description":"St Kilda premiership hero Kevin “Cowboy” Neale has passed away overnight at the age of 78.","content":"St Kilda premiership hero Kevin “Cowboy” Neale has died at the age of 78. Neale, who was diagnosed with Alzheimer’s disease in 2018, passed away overnight on Saturday. “His health struggles in recent times were well-publicised, and his teammates regularly visited him in Albury as a group. Through the difficult times, his wife Georgina was a constant pillar of strength and the club extends its deepest sympathies to her and the Neale family,” the club said in a statement on Sunday. Kevin ‘Cowboy’ Neale. Credit: St Kilda Football Club/Supplied “Cowboy was truly a beloved figure at the Saints, not only among his teammates and fans, but by those who worked alongside him at the club long after his playing days.” Neale, renowned for his strength and able to play as a key defender or forward, was recruited from South Warrnambool in 1965, and set a then Saints’ club record of 256 games. This included playing in the club’s sole premiership in 1966, when he booted five of the Saints’ 10 goals in a one-point win over Collingwood. Loading “The thing that really stuck with me – and I still remember it to this day – is the number of people, a lot of them were older … who were sitting there still in their seats just crying because they’d been following St Kilda for 60 or 70 years,” Neale said in an interview with the AFL Players Association in 2013. “It struck me then, how much does it mean to these people? To look at it and now; 140 years we’ve been going, and we’ve still only won one.” Neale won St Kilda’s best and fairest in 1973 and was later named in the club’s team of the century and hall of fame. After his VFL career, he captain-coached Canberra club Ainslie to four premierships in the ACT and also led the ACT to a famous victory over a Victorian team in a precursor to State of Origin. He then coached Central District in the SANFL. Returning to the Saints in later years, he worked in the marketing department and was president of the Past Players Association. While Neale played in St Kilda’s only premiership, he also played in two losing grand finals, against Essendon in ’65, and Hawthorn in ’71. “In 1971 we were 20 points up at three-quarter time and then got rolled by Hawthorn. And that hurt. I must say, the disappointment out of that never goes away,” Neale said in 2013. Kevin “Cowboy” Neale was much-loved by the St Kilda faithful. Credit: Aaron Sawall Neale said the significance of playing in the ’65 grand final may have been lost on him at the time. “I’d played in grand finals for about nine years in a row [before playing for St Kilda] so I thought it was just normal. But then we missed out after ’66 through to ’71. The longer you play the game, the more you realise just how hard it is to win a premiership,” Neale said. While he was a supporter of the modern game, Neale questioned why there was so much importance on handballing. “I know I’m old-fashioned and all that, but I just cannot believe the number of handballs we have today,” he said. “I looked at the stats the other day for the grand final in ’66 when we won it and I think we had a total of 31 handballs. They have a minimum of about 250 now.” Loading But he then added: “The work-rate now, and the fitness, is just superb. That would be the thing that would make it hard for the majority of blokes in my day.” However, he said the likes of Darrel Baldock, Ian Stewart, Ted Whitten and Bobby Skilton would have handled the modern game “without any problems at all.” Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 St Kilda Saints Claire Siracusa is a desk editor in The Age sport department. Connect via email . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-17 01:38:05","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2797901d1eeb39902cef408ad5d49606","title":"‘He was a god to us’: AFL great Ron Barassi dies","link":"https://www.brisbanetimes.com.au/sport/afl/ron-barassi-dies-20230916-p5e56w.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu, Scott Spits and Jon Pierik"],"video_url":null,"description":"AFL Legend, coaching great and champion player Ron Barassi has been remembered as the game’s most important post-war figure, as his family is offered a state funeral for the football titan.","content":"AFL Legend, coaching great and champion player Ron Barassi has been remembered as the game’s most important post-war figure after his death at the age of 87. The family confirmed his passing on Saturday in a statement, a day after the two clubs he is best associated with — Melbourne and Carlton — played their first final against each other in 23 years at the MCG. Football legend Ron Barassi. Credit: John Donegan “After a full and extraordinary life, Ronald Dale Barassi, aged 87, left us today due to complications from a fall,” the family said. “He died peacefully, surrounded by loving family. We ask for privacy at this time.” Prime Minister Anthony Albanese was among many to pay tribute to Barassi, one of the most revered and respected identities in the game, who spent more than half his life dedicated to the sport he loved either as a coach, player or media identity. Victorian Premier Daniel Andrews confirmed the Barassi family will be offered a state funeral to honour the Australian sporting icon. “The word legend is used a lot. But nobody deserves it quite like Ron Barassi,” Andrews said in a social media post. “He didn’t just play the game – he reshaped it. “And how fitting that (Friday) night’s game was a cliffhanger between the Dees and the Blues. Loading “The government will offer Ron’s family a state funeral to remember him – and I hope they accept.” Players and fans gave Barassi a standing ovation at Adelaide Oval and there was a short period of silence before Saturday night’s Port Adelaide-GWS semi-final. Barassi, along with the great Norm Smith, featured in an equal record 10 premierships as a player or coach. This feat was recognised in the number 17410, which accompanied his autograph, acknowledging the 17 grand finals he was in for 10 flags. Fans paid their respects to Barassi with a minute’s silence at Adelaide Oval before Saturday night’s semi-final between Port Adelaide and Greater Western Sydney. Carlton champion Robert Walls, who played under Barassi at the Blues, said: “He was a god to us.” AFL Commission chairman Richard Goyder lauded Barassi as “the most important figure in Australian football of the last 70 years since the Second World War”, and a visionary for nationalising the sport. “When our game was largely based in the south and west of Australia and revolved around the state leagues, Ron Barassi was constantly ahead of his time pushing for national development and a national league,” Goyder said. “A champion of Victoria who relished the battles against SA, WA and Tasmania at state level, Barassi saw the potential ahead if the game could unlock interest in New South Wales and Queensland and constantly pushed the game’s administrators to dream big, plan bigger and be prepared to risk dramatic steps into the unknown. Loading “He revolutionised the game as a player – created the position of ruck rover – built premiership success at clubs as a coach and then was our first great evangelist to take the game north and grow it to become what we have today. “He was known all across Australia when football wasn’t always known.” Albanese said Barassi was a legend who will forever be remembered by the game. “There is no more famous name in football than Ron Barassi and there is no one who gave more to the game that millions love,” Albanese said in a tribute on X, the social media platform formerly known as Twitter. “Ron Barassi was a legend in every sense of the word. A fearless player and leader, a visionary coach and a tireless champion for the growth and success of Australian rules football. AFL coaching colossus Ron Barassi in Sydney. Credit: Stuart Hannagan “Ron’s name and his legacy will be remembered as long as footy is played. “May he rest in peace.” Barassi, inducted as an AFL Legend in 1996, was a champion player for his beloved Melbourne, playing in all six of the club’s premierships during their dynasty in the 1950s and ’60s under Smith. Loading The Demons said they were deeply saddened by the loss of one of their favourite sons. “Everyone at the Melbourne Football Club is extremely saddened to hear of Ron’s passing. We send our sympathies and condolences to Ron’s family and friends at this incredibly sad time,” Demons chief Gary Pert said. “Ron was a much-loved character and friend to so many of us around the club which is why he will be so deeply missed. “Ron was more than a player and coach. He was an icon of the game, and a true Melbourne person. His legacy will forever be etched in the history of the game. “The entire football community has lost a giant, but Ron’s spirit and impact will live on through the game that he loved so dearly.” Barassi’s shock defection to Carlton for the 1965 season stunned the football world but his success continued, this time as a coach, guiding the Blues to premierships in 1968 and 1970. He delivered North Melbourne their first flag in 1975, and another in the 1977 grand final replay after a heart-stopping draw during his reign at Arden Street from 1973-80. But he was unable to lift Melbourne’s fortunes during his five seasons back at his spiritual home. He answered an SOS call from AFL and Sydney to come out of retirement and coach the relocated Swans, who were on their knees in 1993 but made a grand final three years later, largely due to the hope generated by Barassi. Loading Champions Tony Lockett and Paul Roos headed north in 1995 to play in the red and the white, their first season in Sydney also Barassi’s last in the coaches box. Blues president Luke Sayers paid tribute to Barassi, whose direction to his players to handball at all costs led to the club turning around a 44-point deficit at half-time to win by 10 points. It is one of the competition’s most fabled flags. “Arguably our game’s greatest name, a giant of Australian football, who left a legacy at every club whose doors he walked through, none more so than our own,” Sayers said. Ron Barassi the Blue with former prime minister Sir Robert Menzies in 1967. Credit: Bob Buchanan “It was late 1964 that Ron donned the navy blue, and for the proceeding decades, the Carlton Football Club never looked back. “The captain-coach of our drought-breaking flag in ’68, followed by what is considered the greatest victory of them all, the 1970 grand final comeback over Collingwood. “Ron transformed the game and indeed the clubs who were privileged to be graced with his presence. “How fitting that just last night, the two clubs in which he left such an impact, should play out a final that typified the toughness, ferocious competitiveness and passion that symbolised so much that was great about Ron. “On behalf of the entire Carlton Football Club, our most heartfelt condolences go out to the Barassi family and we thank them deeply for allowing us and our game, the honour of having the great Ron Barassi as forever part of it.” The Kangaroos, who held their best-and-fairest awards on Saturday night, said the club carried heavy hearts after the death of their first premiership coach. “Ron was a giant of the game and for a time he was ours,” North president Dr Sonja Hood said. “He famously guided us to our first-ever VFL/AFL premiership with a win over Hawthorn in 1975 and he backed that up with another flag in 1977, this time with a win over Collingwood. “But he was much more than a coach – he was a man of the game and the game will forever owe him an enormous debt of gratitude. “He gave his all for every club he represented – first Melbourne, then Carlton, North Melbourne and finally at Sydney. “For us, Ron will always be our first premiership coach and he’ll always be a North Melbourne legend. “Vale Ronald Dale Barassi.” His death comes nearly two years to the day since the Demons broke one of the biggest premiership droughts in VFL/AFL, winning the 2021 flag, their first triumph since 1964 after decades of hardship. That premiership was won at Perth’s Optus Stadium, and not in front of an MCG crowd, in a season impacted by the COVID-19 pandemic. Barassi, though, took part in unfurling the Demons’ 13th flag at a pre-game ceremony in round one last year. Age sports writer Greg Baum spoke to Barassi in the countdown to that flag triumph. “I feel very nervous. Nervous and excited,” Barassi said in the interview. “As long as they play their best. If their best is beaten, you’ve got to cop that. But if you play your best, you generally win.” Two years ago the Melbourne Football Club sent Barassi a gift pack with a scarf and T-shirt, and president Kate Roffey sent him a personalised video message, standing in front of the recently rediscovered 1964 premiership pennant. “The ’64 grand final was Barassi’s last game for Melbourne, that flag the last of six for him as a player,” Baum wrote . “He said later he felt oddly wrung out and played poorly in the first half, better in the second in a four-point win. Reminded that he had 17 touches, he says: ’Seventeen! That’s not much. Not happy!“ Loading Barassi, a member of Melbourne’s 1955, 1956, 1957, 1959, 1960 and 1964 premiership teams, is fondly remembered. Barassi (a record 10 premierships as a player or coach) shares that record with Melbourne coaching icon Norm Smith, ahead of Collingwood coaching great Jock McHale (nine) and Leigh Matthews (eight), widely regarded as the best player of the 20th century. Picked in the AFL Team of the Century when the league celebrated its anniversary in 1996, he was immediately awarded Legend status. Barassi’s playing career spanned two decades - the 1950s and 1960s - at Melbourne and Carlton. His transfer from the Demons to the Blues in ahead of the 1965 season was one of the most notable player moves in football history. He coached the Demons, Carlton, North Melbourne and Sydney Swans in 515 matches. His move to coach the Swans in 1993 came in a low period for the club a decade after they moved north to Sydney from South Melbourne. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article Vale Melbourne Demons Carlton Blues AFL 2023 North Melbourne Kangaroos Sydney Swans Collingwood Magpies Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Scott Spits is a sports reporter for The Age Connect via Twitter or email . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-16 23:18:38","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f63038bb7bb4b3295abb9bd75f1b3ba3","title":"Mtshingwe dominate Old Mutual Academy Cricket tournaments","link":"https://www.sundaynews.co.zw/mtshingwe-dominate-old-mutual-academy-cricket-tournaments/","keywords":["Sports"],"creator":["vusumuzi"],"video_url":null,"description":"Brandon Moyo, Sports Reporter EMAKHANDENI based Mtshingwe Primary School were the biggest winners of the two grassroots cricket tournaments that came to an end at the Old Mutual Academy of Cricket Excellence (former Heath Streak Academy) yesterday. The Tyson Meki-coached Mtshingwe Primary School won the Old Mutual Colts Cricket Cup and the CABS Under-13 Cricket […]","content":"The Sunday News EMAKHANDENI based Mtshingwe Primary School were the biggest winners of the two grassroots cricket tournaments that came to an end at the Old Mutual Academy of Cricket Excellence (former Heath Streak Academy) yesterday. The Tyson Meki-coached Mtshingwe Primary School won the Old Mutual Colts Cricket Cup and the CABS Under-13 Cricket Cup to make it a memorable event for the school. In the Colts Cricket Cup, Mtshingwe recorded a 38 runs win over Old Mutual Academy Colts before the Emakhandeni based side went on to record a close four runs win over Old Mutual Academy as well in the Under-13s event. The Mtshingwe Colts, batting first in the final, scored 66/1 in their innings before going on to restrict their opponents to 28/6 to claim the top honours. In the Under-13s final, the eventual champions, Mtshingwe restricted the Academy side to 39/2 while they had finished on 43/4 earlier on to help complete the double for their school. In the Under-13s semi-final, the dominant Mtshingwe thumped Khumalo Primary School by 55 runs. Mtshingwe scored 67/1 in their innings before they went on to restrict their opponents to just 12/7. The tournament featured 16 schools and 32 teams as part of the Old Mutual Academy of Cricket Excellence Trust’s commemoration of 10 years of existence. The Trust’s president and board chairperson, Joseph Rego was impressed with the way things went throughout the duration of the tournament. CABS, who are partners, through their managing director, Mehluli Mpofu said such a tournament was crucial to the growth of cricket in the country and it’s important to them as an organisation. He added that they will continue supporting the growth of cricket in the country and other sports. “It’s been a decade of supporting cricket. In this case, we are supporting the young, so it’s very developmental which obviously supports the growth of cricket in the country and particularly when you deal with disadvantaged people and give them an opportunity to actually grow in the sport. “It becomes very important to us as a business because ultimately what we always say to ourselves is we ought to be supportive of the community that we operate in and that is one way of doing so. “It’s important that we resume and as you can see here, there is lots of support from the schools. There are 16 schools with 32 teams and it’s important we give them a lot of support, cover as best as we can. “The commitment that we are giving as CABS and Old Mutual Group is that we will continue to support cricket and we will continue to look for other opportunities to support grassroots cricket and in other sports we need to look at how we can play a part as well,” said Mpofu. The tournament was also attended by Zanu-PF Politiburo member, Elifasi Mashaba, who is also the Trust’s vice-president and one of the founding fathers of the Academy in 2013. Mashaba said the tournament was a step in the right direction in helping to grow the game of cricket. As a token of appreciation for their participation at the event, all the schools got two cricket balls. Yesterday was not just a cricket event at the Old Mutual Academy of Cricket Excellence as they also organised a “Spring Fare and Fun Day” featuring different stalls, jumping castles and water slides for children, face painting, balloon making and many other activities for children and families. – Follow on Twitter @brandon_malvin.","pubDate":"2023-09-16 22:03:30","image_url":null,"source_id":"sundaynews","source_priority":2207190,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"36cc1a12a7aa725df517daf24b844f29","title":"Chiwanza walks away on his own terms","link":"https://www.sundaymail.co.zw/chiwanza-walks-away-on-his-own-terms","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"Tinashe Kusema Deputy Sports Editor THE day will come when Kudakwashe Chiwanza decides to open up on how he fell in and out of love with rugby. Maybe, he will do it through a tell-all biography or interview. However, for now, we have to make do with a cryptic but loaded reason behind what many […]","content":"The Sunday Mail THE day will come when Kudakwashe Chiwanza decides to open up on how he fell in and out of love with rugby. Maybe, he will do it through a tell-all biography or interview. However, for now, we have to make do with a cryptic but loaded reason behind what many are calling an “unfortunate” and “untimely” retirement from the game. “A lot happened to me this year, rugby-wise, and I wasn’t enjoying it anymore,” said the former Zimbabwe Sables and Cheetahs player. “I felt I was giving my all, but it just wasn’t the same . . .” The 32-year-old former Zimbabwe international broke the news on Facebook. He indicated that the recent Zambezi Challenge was to be his last outing. “It has been such a wonderful 13 years, and none of it would have been possible without the love and support from all of you.” One of the reasons Chiwanza’s retirement appears bizarre is its announcement on the eve of the Sevens’ Africa Cup presently underway at Harare Sports Club’s Machinery Exchange Stadium. The tournament, which ends today, attracted some of the continent’s Sevens heavyweights such as South Africa’s Bliztboks and Kenya — two teams that play in the HSBC World Rugby Sevens Series. Uganda are an emerging threat, while Zambia, Madagascar, Tunisia, Burkina Faso, Namibia, Algeria, Nigeria, Cote d’Ivoire and hosts Zimbabwe all took part. With an automatic ticket to next year’s Paris Olympic Games guaranteed for today’s winner, it seems the Africa Cup would have provided the perfect stage for a final bow for Chiwanza. However, he seems to have made up his mind a long time ago. “It’s something I had been thinking about since last year, and the Zambezi Challenge Cup just felt like the right time for me to call time on my 13-year international rugby career. “I have no regrets at all,” he said. The ex-Falcon College learner found his footing pretty early in his career, as he joined Old Georgians Rugby Club soon after school in 2011. Chiwanza was named rookie of the year in his debut season. Call-ups to the Sables and Cheetahs, his preferred format, soon followed, after which he became a semi-permanent member of the latter. The 2014 and 2015 seasons are arguably his greatest years, as he was amongst the top try-scorers for both. He also won the title with Old Georgians. Prior to this, he tried out sports that include football, basketball and hockey. “Rugby wasn’t my first choice in sports. Most people would be surprised to know that cricket was my first love,” he was once quoted saying. “I made the Manicaland provisional side and even had a short stint with Strugglers Cricket Club.” He only started playing rugby when he enrolled at Mvurachena Primary School in Chipinge, Manicaland, where he was forced to partake every sport, as the institution did not have that many learners. “It was at Mvurachena, when I was in Grade Six, that I started playing for Eastern District Rugby,” he said. His numerous accolades on the rugby front include making the Matabeleland Under-18 team for three straight years and then the Zimbabwe Under-20 Junior World Trophy in 2011. Chiwanza played for Old Georgians (2011-2023), had a couple of stints in varsity rugby and made the Sharks Academy tour team. He would get his Sables and Cheetahs debuts in 2011. He was also part of the World Cup Sevens team and Africa Cup teams in 2018. With the Sables, he won the Victoria Cup in 2011 and 2019, and participated in the SuperSport Rugby Challenge in 2019. Chiwanza believes his debut for the Sables was a special moment in his career, as his mother, Judith, was present to watch him play. Sadly, she later passed away following a bout of pneumonia. Other notable rugby moments, Chiwanza said, included “playing Spain in Hong Kong in 2016 and Africa Cup 2018”. “I also had the pleasure of meeting the likes of Jonah Lomu, Sonny Bill Williams (New Zealand), Bryan Habana (South Africa), Brian O’Driscoll (Ireland) and Dan Norton (Great Britain), who are some top Sevens players. “Monaco and Hong Kong were among my favourite venues and tournaments,” he said. As he rides off into the sunset, Chiwanza even had some wise words for his former teammates, friends and, most importantly, fans. “Never give up on your dreams, but just keep working hard and your time will come. “Everyone should aim for the highest cloud so that if you miss it, you will hit a lofty mountain.” ■","pubDate":"2023-09-16 22:02:35","image_url":null,"source_id":"sundaymail","source_priority":1245383,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"5fc31bc2570b9705e19b6f9a6d83db0c","title":"Could Hamid be the next Raza?","link":"https://www.sundaymail.co.zw/could-hamid-be-the-next-raza","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"Sports Reporter ALI-AKBAR KHAN HAMID is one of those cricketers who are hard to put in a box. A clean hitter of the ball, the Takashinga Patriots II batter is every coach’s dream. He is comfortable batting anywhere between the top and middle order. In fact, by his own admission, Hamid is comfortable batting in […]","content":"The Sunday Mail ALI-AKBAR KHAN HAMID is one of those cricketers who are hard to put in a box. A clean hitter of the ball, the Takashinga Patriots II batter is every coach’s dream. He is comfortable batting anywhere between the top and middle order. In fact, by his own admission, Hamid is comfortable batting in the top order in limited-overs cricket. But he prefers the middle order in the longer version of the game. Together with Spencer Magodo and Tinashe Chiorah, the 23-year-old is one of three figures currently making waves in local cricket. Some have even predicted the trio could form the core of the Chevrons team once Sikandar Raza, skipper Craig Ervine and Sean Williams — who are all approaching the twilight of their international careers — leave the stage. However, what sets Hamid apart from his peers is the constant comparisons to talisman Raza. While he does idolise the Zimbabwe all-rounder, he chooses to ignore the hype. “Sikandar (Raza) is like an elder brother to me, but I would like to build my own name and achieve my own goals. “He (Raza) is definitely an inspiration to me, though,” he said. Sikandar and Hamid are both of Pakistani descent. However, unlike Raza, Ali-Akbar comes from a strong cricket family. His father, Abid, is a former manager of Zimbabwe A and liaison officer for visiting Asian teams. “I started cricket at a very young age, as I was brought up in a household where my father, Abid Hamid, was involved with Zimbabwe cricket and Old Hararians Club, and my brother, Saad Khan, is a cricketer,” he said. “My father had a couple of roles in Zimbabwe cricket, with some of the notable ones being manager for Zimbabwe A side and liaison officer for a number of overseas teams that came to Zimbabwe. “Most of these teams were from Asia. “I would like to say my inspiration for the game was my brother (Saad Khan). Seeing him dominate the local game, scoring hundreds every other weekend, gave me inspiration to play and dream of representing Zimbabwe one day.” That was years ago. The Takashinga Patriots II player is now in his third year in the National Premier League, the country’s top club competition. The 2023 edition could very well end up being his breakthrough season. He is presently part of the leading pack of top batters with 355 runs from eight innings. His rates average and strike rates stand at 71.0 and 78.0, respectively. “This NPL, so far, has been a good journey as we approach the halfway mark. “It has been good so far. All praise to Allah for giving me this opportunity to score some runs in the National Premier League. “I have enjoyed my time with Takashinga,” he said. Hamid dreams of one day playing for the Chevrons. He has vowed to put in the work and often seeks advice from the likes of Raza, Faraz Akram and Elton Chigumbura. “As an upcoming cricketer, I look forward to just keep getting better every day; controlling what I can by working hard on my game. “Chigumbura is one of my mentors, who always pushes me to get better, while Akram helps me out with the mental aspect of the game. “They always give me advice, like elder brothers, and are usually a call away when I need help. “Like I said, Raza has been an inspiration to me. “The way he has worked hard for all his achievements, talking to him is a privilege that I have, and I try to listen to him carefully.”","pubDate":"2023-09-16 22:02:27","image_url":null,"source_id":"sundaymail","source_priority":1245383,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"448df85c68c4e455294bec79bd2540b6","title":"Cricketer’s World Cup availability in doubt","link":"https://www.sundaymail.co.zw/cricketers-world-cup-availability-in-doubt","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"Australia opener Travis Head has a confirmed fracture in his left hand that puts his availability for the early part of the World Cup in jeopardy after he was struck by a Gerald Coetzee short delivery in the fourth One-Day International against South Africa at SuperSport Park on Friday. Head was on nine, facing his […]","content":"The Sunday Mail Australia opener Travis Head has a confirmed fracture in his left hand that puts his availability for the early part of the World Cup in jeopardy after he was struck by a Gerald Coetzee short delivery in the fourth One-Day International against South Africa at SuperSport Park on Friday. Head was on nine, facing his eighth delivery, when he was struck on the left glove attempting a pull off Coetzee. He received treatment onfield from the Australian medical staff before continuing to bat, but only faced three more deliveries before retiring hurt in clear discomfort. He was sent to hospital for an x-ray and Australia coach Andrew McDonald confirmed after the match that it had shown a fracture. He will have further scans with more information on the severity of his injury and a timeline for his recovery to be determined. Head did return to the ground at the end of the match, but had his left hand in a splint. “At this stage, it’s a confirmed fracture. “How long that timeframe is, we are yet to determine that. “Fingers crossed with the World Cup fast approaching,” McDonald said post-match. Australia’s chase of 417 suffered early dents when they were reduced to 22 for two, but Head made a strong start. After he was struck, he whipped Marco Jansen over deep backward square for six but then toe-ended the next ball just short of Kagiso Rabada at mid-off, taking the injured hand off the bat while playing the stroke. He immediately removed his glove at the non-striker’s end. The next ball he faced he made room to cut but Coetzee followed him and cramped him as he tried to flay it through the offside. He immediately winced in severe pain after playing the stroke and walked straight to the dressing room, informing stand-in South Africa captain Aiden Markram and the umpires that he could not continue as he walked off. Australia were 53 for two in the ninth over at the time and ended up being bowled out for 252 with Head not returning to bat when the ninth wicket fell. The injury will increase speculation that Marnus Labuschagne, who was not part of Australia’s initial World Cup squad, could force his way into the final playing group. Labuschagne came on as a concussion substitute in the first ODI and scored an unbeaten 80 in a match-winning cause, and followed that up with 124 in the second game. Head’s injury adds to Australia’s long list of concerns heading to the World Cup. Pat Cummins (wrist fracture), Steven Smith (wrist tendon), Mitchell Starc (groin), Glenn Maxwell (leg) are all coming off lay-offs, and hoping to be fit for the three-match ODI series against India that starts on September 22 in the lead-up to the World Cup. Ashton Agar also only played one game in South Africa, coming off a calf strain, before heading home to Perth for the birth of his first child. He was supposed to play at least two but he was unavailable due to soreness before flying home and he is unlikely to return to the squad until after the India ODI series. Cameron Green is coming off a concussion in the opening match of the South Africa series, but McDonald was hopeful he would be available for final game of the series today after serving his mandatory eight-day rest period. “He’s been cleared by the medical team,” McDonald said. “He is just working away getting prepared. Hopefully, he’s available for game five,” he said. — Cricinfo.","pubDate":"2023-09-16 22:02:24","image_url":null,"source_id":"sundaymail","source_priority":1245383,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"63de8a2a7c3346e7295fdeb14175609d","title":"Asia Cup final: Sri Lanka will look to defend crown against most successful team in event, India","link":"https://thenewsmill.com/2023/09/asia-cup-final-sri-lanka-will-look-to-defend-crown-against-most-successful-team-in-event-india/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Two cricketing giants from the sub-continent will lock horns on a blockbuster Sunday in the battle to crown Asia’s best. The final of the ongoing Asia Cup between the hosts Sri Lanka and India promises a thrill-a-minute ride, with both teams recording impressive wins on the road to the final. While the Lankans will go into the final as the defending champions, Team India, led by in-form Rohit Sharma, will be desperate to lift the trophy that they haven’t won since 2018. Having secured qualification for the showpiece event, overcoming myriad challenges and close contests in the ICC World Cup Qualifiers, the Lankans would be keen not to cede the mantle of Asia’s best to their sub-continental neighbours. A win in the all-important final on Sunday will certainly make them a dark horse in the World Cup, where the matches will be played on familiar sub-continental surfaces. Sri Lanka came close to handing India their first defeat of the Asia Cup 2023 in the Super Four stage but the visitors’ bowling attack came to the party to eke out a hard-fought win. On a surface known to offer plenty of purchase for the spinners, the Lankan Lions will miss their bowling trump card — mystery spinner Maheesh Theekshana. The tweaker, who has been among the wickets in the tournament, was ruled out of the final after sustaining an injury in his right hamstring during their nerve-jangling Super Four clash against Pakistan. In a tournament where Pakistan’s pace trio of Haris Rauf, Shaheen Shah Afridi and Nasim Shah has dominated the wicket-takers list, Theekshana made his mark by claiming 9 wickets in 5 matches at an economy of 5.15. Barring a narrow defeat in an inconsequential Super Four clash against Bangladesh on Friday, India have been on song in the tournament. However, the visitors suffered a setback going into the final, with all-rounder Axar Patel ruled out because of a left quadriceps strain that he sustained during the Super Four clash with Bangladesh on Friday. In his place, Washington Sundar was called in ahead of the final and will have an opportunity to put himself in contention for the World Cup squad, should he make the playing eleven on Sunday. All-rounder Shardul, while going cold with the willow so far in the tournament, has been in good wicket-taking form as he ended up with figures of 3-65 against Bangladesh. Shakib Al Hasan, Anamul Haque and Tanzid Hasan were his victims on the evening. But India could be tempted to play Sundar in place of Shardul in the final, as offers a similar set of skills with the bat while adding more variety with his left-handed batting style in a line-up that majorly comprises right-handers. Ahead of the clash of the Asian giants, Sri Lanka skipper Dasun Shanaka declared that his team was ready for the final. “Of course, we are ready [for the Asia Cup 2023 final]. See, it totally depends on the pitch. The pitches have been playing a part in this tournament. According to the pitch stats, we are picking a good side, especially bowling against India, we need to take more wickets upfront. That opens the game for us. That’s a key area in the game,” Shanaka said in a pree-match press conference on Saturday. Shubman Gill, who struck a century albeit in a losing cause against Bangladesh, stressed the importance of lifting the Asia Cup trophy ahead of the World Cup. “Winning the [Asia Cup] final is very important for us because we need to create a winning habit. Peaking at the right time and gaining momentum at the right time is important,” Gill said. (ANI)","pubDate":"2023-09-16 21:30:14","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c2642d630393e762a10435f8c9998b50","title":"Tamim Iqbal, Soumya Sarkar recalled for Bangladesh’s first two ODIs against New Zealand","link":"https://thenewsmill.com/2023/09/tamim-iqbal-soumya-sarkar-recalled-for-bangladeshs-first-two-odis-against-new-zealand/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Bangladesh recalled Tamim Iqbal, Mahmudullah Riyad, Soumya Sarkar, and Quazi Nurul Hasan Sohan for the first two of the three upcoming ODIs against New Zealand in Dhaka next week. “The Bangladesh Cricket Board (BCB) has announced the squad for the first and second ODIs of this month’s three-match series against New Zealand in Dhaka,” BCB said in a statement. Wary of managing the workloads of several key players ahead of the ICC ODI World Cup, which will get underway in India next month, Bangladesh have decided them in the first two ODIs against New Zealand. Swashbuckling keeper-batsman Litton Das will lead the side in the absence of regular captain Shakib Al Hasan, who has been rested. Among the other key players rested are Mushfiqur Rahim, all-rounder Mehidy Hasan Miraz and the pace battery of Taskin Ahmed, Hasan Mahmud and Shoriful Islam. Despite several key names missing, Bangladesh will not go into the series short on experience as the likes of Tamim Iqbal, Mahmudullah, Soumya Sarkar and Nurul Hasan Sohan will mark their return to the limited-overs setup. The Tigers have called up three uncapped players — southpaw Zakir Hasan, pacer Khaled Ahmed and leg-spinner Rishad Hossain. They could all be in line for debuts during the ODI series. Naim Sheikh, Afif Hossain and Shamim Hossain were players from the Asia Cup squad to have missed out. “The decision to rest players was taken in consideration of the World Cup in India which will be a long tournament where ensuring the mental and physical fitness of the cricketers will be very important. The series against New Zealand provides us an opportunity to take a look at some other players as well ahead of this major event,” the chairman of Bangladesh’s National Selection Panel, Minhajul Abedin, said in a statement. “The squad is a blend of experience and youth and only Zakir, Khaled and Rishad have not featured in ODIs yet. Zakir was very close to playing against Ireland in March before he suffered an unfortunate injury. Khaled has done well in his list A career and Rishad offers a different dimension to our bowling attack,” he added. Squad (for the first two ODIs): Litton Das (captain), Tamim Iqbal, Soumya Sarkar, Anamul Haque, Tawhid Hridoy, Mahmud Ullah, Nurul Hasan Sohan, Mahedi Hasan, Nasum Ahmed, Mustafizur Rahman, Tanzim Hasan, Tanzid Hasan, Zakir Hasan, Rishad Hossain and Khaled Ahmed. (ANI)","pubDate":"2023-09-16 20:30:11","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"889d5a887db75437e5c4215bf5f84cc8","title":"Wrist injection has Steve Smith primed for World Cup","link":"https://www.brisbanetimes.com.au/sport/cricket/wrist-injection-has-steve-smith-primed-for-world-cup-20230914-p5e4n7.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"The Australian batsman revealed he needed a cortisone injection for a niggling wrist problem ahead of his departure for the World Cup in India.","content":"Steve Smith is off to India on Monday in pursuit of Australia’s’ sixth ODI World Cup, but has revealed he needed a cortisone injection for a niggling left wrist problem before he could get back in the nets. The wrist trouble, which began when he injured it in the field on the final day of the Lord’s Ashes Test, affected Smith during the final three matches and lingered at home even after he spent two weeks in a brace to limit movement and promote healing. Steve Smith launched the New Balance store in Bondi Junction last week. Credit: Dion Georgopoulos Having already been ruled out of the white-ball tour of South Africa and with time ticking down to the trip to India and pursuit of the ODI World Cup, 34-year-old Smith’s medical advisors resorted to cortisone, which eradicated lingering pain in time to allow him to return to training last week , before his departure for India on Monday. “I was in a brace for a couple of weeks, just trying to limit the movement, which once I got that off it hadn’t really made a big difference to be honest,” Smith told this masthead at the opening of the New Balance store in Bondi Junction. “Then I got a cortisone in it last Thursday, and that has made a big difference. So I’ve had a couple of sessions back batting now and it feels pretty normal. Loading “Hopefully, I don’t need another one and it just settles it down. But the part of the wrist it is, they’ve said that if I do need another one, then that’ll be no stress as well. Fingers crossed that it just heals up and it’s fine, but [it is] feeling good at the moment.” While Smith fought through the pain barrier in England, freedom and confidence in his wrist will be hugely important in white ball matches in India, where he will need to be able to push the scoring rate and clear the boundary at times. “Initially in the nets, a couple of balls I faced where I got inside edges to them and your bat turns sharply, I was a bit wary of that to begin with because that’s what was actually one of the things causing my pain,” he said. “I inside-edged a couple of balls in the nets the other day and my bat turned sharp, and I was like ‘oh, that was hurting before’ and it wasn’t hurting anymore. So that’s a real positive, and I feel as though I can play all my shots and there’s no pain at all.” With Australia’s World Cup squad of 15 to be finalised on September 28, Marnus Labuschagne is now in line to squeeze into the group after Travis Head suffered a fractured hand in South Africa. Smith may now find himself at No. 3 in the batting order if heavy-hitting Mitchell Marsh partners David Warner in Head’s place. “I think I average 55 at three, or something like that, so it’s definitely my preferred spot. But I’ll do whatever the team needs,” Smith said. “White-ball cricket, you’d love to bat as high as you can, so we’ll see what they want to do. “When you look at World Cups as opposed to the standard bilateral series, I reckon the scores naturally come down a little bit anyway, with the extra pressure of big games and things like that. Then you throw in the mix that wickets are going to be wearing and turning. “You want to be hitting your straps in the big tournaments; that’s what everyone wants to win. It’s not like I’m saying every game isn’t important, but big tournaments are the ones you want to win. We did that in 2015 and that was really special.” Loading In his net sessions in India, Smith will have to get used to wearing a neck guard after Cricket Australia made the extra protection mandatory following nearly a decade of research and consideration. “It’s not my ideal choice, but it’s come in, so I’m going to have to run with it,” Smith said, after having to wear one in county cricket earlier this year where neck guards were made compulsory in 2022. “I didn’t know the rules and the umpires said I needed to get a neck guard. I got one on and it was kind of just normal. It feels a little bit odd at the start and after a session or two you get used to it and forget it’s there. “My collar that I usually like to wear up, that just hits against it, so I’ll have to wear my collar down and that was the thing that was annoying me the most. Easy adjustment.” After protracted negotiations with Cricket Australia lasting two seasons, Smith overturned perceptions of his waning worth as a Twenty20 batter with a series of startling displays for the Sydney Sixers in last season’s Big Bash League. Steve Smith will nominate for the Indian Premier League auction for 2024. Credit: Dion Georgopoulos As a consequence, he was pencilled in to open the batting in the T20 series in South Africa before the wrist injury got in the way, and is optimistic about his chances of being picked up by a team at the next Indian Premier League auction. The 2024 tournament is proving increasingly attractive to Australian cricketers due to their lighter touring schedule in 2024. “I’ll be throwing my hat in the ring for sure,” Smith said. Loading “It’s a tournament I loved playing in the past, it’s a great challenge. All the best players from around the world are there. “I feel like I’m learning all the time and my game’s progressing, so I think I showed what I’m capable of up the top of the order in the Big Bash in the few games that I played, and the amount of sixes I hit as well.” News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Steve Smith Cricket Australia Cricket World Cup Daniel Brettig is The Age's chief cricket writer and the author of several books on cricket. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-09-17 03:38:03","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"cc5e79f3e1118da360e7ae9cbe6147d7","title":"Asia Cup 2023 Final: फाइनल से पहले कप्तान दासुन शनाका के बयान ने मचाई खलबली, \"बेशक, हम फाइनल...\"","link":"https://sports.ndtv.com/hindi/cricket/dasun-shanaka-praise-his-team-player-after-defeat-pakistan-and-also-talk-about-india-vs-sri-lanka-asia-cup-2023-final-4397049#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Dasun Shanaka on Asia Cup 2023 Final: गत चैंपियन श्रीलंका रविवार को कोलंबो के आर प्रेमदासा स्टेडियम में एशिया कप 2023 के फाइनल में भारत से भिड़ेगी.","content":"Asia Cup 2023 Final IND vs SL पाकिस्तान को हराकर लगातार दूसरी बार एशिया कप के फाइनल में पहुंचने के बाद श्रीलंकाई कप्तान शनाका (Dasun Shanaka on SL vs PAK) ने पाकिस्तान के खिलाफ जीत को याद करते हुए हुए खिलाड़ियों का हौसला बढ़ाया. शनाका ने इस बात पर ज्यादा जोड़ दिया की उनकी टीम को बस भारत के हाथों हार का सामना करना पड़ा है. ऑलराउंडर ने भारत के खिलाफ मैच में लड़ने की भावना के लिए टीम को श्रेय दिया, जहां डुनिथ वेलालेज (Dunith Wellalage Five Wicket Hall) के पांच विकेट और चैरिथ असलांका के चार विकेट ने उन्हें मेहमान टीम को 213 रन पर समेटने में मदद की. यंगस्टर वेललेज ने एक उल्लेखनीय उपलब्धि हासिल की और उन्होंने अपना स्थान सुरक्षित कर लिया. उन्होनें पहली बार 5 विकेट लेने का कारनामा किया और अकेले दम पर मजबूत भारतीय बल्लेबाजी लाइनअप को ध्वस्त करना और रोहित शर्मा, शुबमन गिल, विराट कोहली, केएल राहुल और हार्दिक पंड्या जैसे शीर्ष बल्लेबाजों का विकेट हासिल किया. “हाँ, श्रीलंका सही समय पर शिखर पर है. आप जानते हैं कि लड़के जानबूझकर देश के लिए अच्छा प्रदर्शन करना चाहते हैं. एक टीम के रूप में हम कमज़ोर रहे हैं, इसलिए हर कोई बड़े मंच पर प्रदर्शन करना चाहता है. इन युवाओं को दुनिया को दिखाना होगा कि वे क्या करने में सक्षम हैं. यह इस युवा टीम का रहस्य है, \"दसुना (Dasun Shanaka on Asia Cup FInal) ने शनिवार को श्रीलंका क्रिकेट बोर्ड के यूट्यूब चैनल के हवाले से प्री-मैच प्रेस कॉन्फ्रेंस में कहा. असालंका ने भी भारत को काफी परेशान किया और 18 रन देकर 4 विकेट लिए, जबकि धनंजय डी सिल्वा ने एक छोर से चीजों को शांत रखा, जबकि अन्य गेंदबाजों ने विपरीत छोर से विकेट लिए. “भारत के खेल में, आपने देखा कि हमने गेंदबाजी में पहले 10 ओवरों के बाद किस तरह संघर्ष किया. वो (प्रशंसक) इन खिलाडि़यों (डुनिथ वेलालेज, मथीशा पथिराना और चैरिथ असलांका और पथुम निसांका) जैसे युवा बल्लेबाजों को यह देखना पसंद करते हैं कि वे इस खेल में कैसे कमाल करते हैं. सदीरा समरविक्रमा को भी नहीं भूलना चाहिए,'' दासुन शनाका ने कहा. शनाका (Dasun Shanaka on IND vs SL Asia Cup Final) ने कहा कि अगर उन्हें एशिया कप जीतने का मौका चाहिए तो उन्हें भारत के खिलाफ अपने सुपर 4 प्रदर्शन को दोहराना होगा. “बेशक, हम एशिया कप 2023 फाइनल के लिए तैयार हैं. देखिए, यह पूरी तरह से पिच पर निर्भर करता है. इस टूर्नामेंट में पिचें अहम भूमिका निभा रही हैं. पिच आंकड़ों के अनुसार, हम एक अच्छी टीम चुन रहे हैं, खासकर भारत के खिलाफ गेंदबाजी करते हुए, हमें पहले से अधिक विकेट लेने की जरूरत है. इससे हमारे लिए खेल खुल जाता है.\" उन्होंने कहा. श्रीलंका के कप्तान दासुन शनाका ने रविवार को कोलंबो के आर प्रेमदासा स्टेडियम में खेले जाने वाले एशिया कप 2023 के फाइनल में पहुंचने के लिए अपनी टीम की प्रशंसा की. गत चैंपियन श्रीलंका रविवार को कोलंबो के आर प्रेमदासा स्टेडियम में एशिया कप 2023 के फाइनल में भारत से भिड़ेगी. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-09-17 01:52:13","image_url":"https://c.ndtvimg.com/2023-09/lcf8jj7_dasun-shanaka-afp_625x300_16_September_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"f19b0cfd82e3dab01e3c1431510a8d79","title":"St Kilda lose a premiership hero: ‘Cowboy’ Neale dies at 78","link":"https://www.brisbanetimes.com.au/sport/afl/st-kilda-lose-a-premiership-hero-cowboy-neale-dies-at-78-20230917-p5e5af.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Claire Siracusa and Jon Pierik"],"video_url":null,"description":"St Kilda premiership hero Kevin “Cowboy” Neale has passed away overnight at the age of 78.","content":"St Kilda premiership hero Kevin “Cowboy” Neale has died at the age of 78. Neale, who was diagnosed with Alzheimer’s disease in 2018, passed away overnight on Saturday. “His health struggles in recent times were well-publicised, and his teammates regularly visited him in Albury as a group. Through the difficult times, his wife Georgina was a constant pillar of strength and the club extends its deepest sympathies to her and the Neale family,” the club said in a statement on Sunday. Kevin ‘Cowboy’ Neale. Credit: St Kilda Football Club/Supplied “Cowboy was truly a beloved figure at the Saints, not only among his teammates and fans, but by those who worked alongside him at the club long after his playing days.” Neale, renowned for his strength and able to play as a key defender or forward, was recruited from South Warrnambool in 1965, and set a then Saints’ club record of 256 games. This included playing in the club’s sole premiership in 1966, when he booted five of the Saints’ 10 goals in a one-point win over Collingwood. Loading “The thing that really stuck with me – and I still remember it to this day – is the number of people, a lot of them were older … who were sitting there still in their seats just crying because they’d been following St Kilda for 60 or 70 years,” Neale said in an interview with the AFL Players Association in 2013. “It struck me then, how much does it mean to these people? To look at it and now; 140 years we’ve been going, and we’ve still only won one.” Neale won St Kilda’s best and fairest in 1973 and was later named in the club’s team of the century and hall of fame. After his VFL career, he captain-coached Canberra club Ainslie to four premierships in the ACT and also led the ACT to a famous victory over a Victorian team in a precursor to State of Origin. He then coached Central District in the SANFL. Returning to the Saints in later years, he worked in the marketing department and was president of the Past Players Association. While Neale played in St Kilda’s only premiership, he also played in two losing grand finals, against Essendon in ’65, and Hawthorn in ’71. “In 1971 we were 20 points up at three-quarter time and then got rolled by Hawthorn. And that hurt. I must say, the disappointment out of that never goes away,” Neale said in 2013. Kevin “Cowboy” Neale was much-loved by the St Kilda faithful. Credit: Aaron Sawall Neale said the significance of playing in the ’65 grand final may have been lost on him at the time. “I’d played in grand finals for about nine years in a row [before playing for St Kilda] so I thought it was just normal. But then we missed out after ’66 through to ’71. The longer you play the game, the more you realise just how hard it is to win a premiership,” Neale said. While he was a supporter of the modern game, Neale questioned why there was so much importance on handballing. “I know I’m old-fashioned and all that, but I just cannot believe the number of handballs we have today,” he said. “I looked at the stats the other day for the grand final in ’66 when we won it and I think we had a total of 31 handballs. They have a minimum of about 250 now.” Loading But he then added: “The work-rate now, and the fitness, is just superb. That would be the thing that would make it hard for the majority of blokes in my day.” However, he said the likes of Darrel Baldock, Ian Stewart, Ted Whitten and Bobby Skilton would have handled the modern game “without any problems at all.” Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 St Kilda Saints Claire Siracusa is a desk editor in The Age sport department. Connect via email . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-17 01:38:05","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2797901d1eeb39902cef408ad5d49606","title":"‘He was a god to us’: AFL great Ron Barassi dies","link":"https://www.brisbanetimes.com.au/sport/afl/ron-barassi-dies-20230916-p5e56w.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu, Scott Spits and Jon Pierik"],"video_url":null,"description":"AFL Legend, coaching great and champion player Ron Barassi has been remembered as the game’s most important post-war figure, as his family is offered a state funeral for the football titan.","content":"AFL Legend, coaching great and champion player Ron Barassi has been remembered as the game’s most important post-war figure after his death at the age of 87. The family confirmed his passing on Saturday in a statement, a day after the two clubs he is best associated with — Melbourne and Carlton — played their first final against each other in 23 years at the MCG. Football legend Ron Barassi. Credit: John Donegan “After a full and extraordinary life, Ronald Dale Barassi, aged 87, left us today due to complications from a fall,” the family said. “He died peacefully, surrounded by loving family. We ask for privacy at this time.” Prime Minister Anthony Albanese was among many to pay tribute to Barassi, one of the most revered and respected identities in the game, who spent more than half his life dedicated to the sport he loved either as a coach, player or media identity. Victorian Premier Daniel Andrews confirmed the Barassi family will be offered a state funeral to honour the Australian sporting icon. “The word legend is used a lot. But nobody deserves it quite like Ron Barassi,” Andrews said in a social media post. “He didn’t just play the game – he reshaped it. “And how fitting that (Friday) night’s game was a cliffhanger between the Dees and the Blues. Loading “The government will offer Ron’s family a state funeral to remember him – and I hope they accept.” Players and fans gave Barassi a standing ovation at Adelaide Oval and there was a short period of silence before Saturday night’s Port Adelaide-GWS semi-final. Barassi, along with the great Norm Smith, featured in an equal record 10 premierships as a player or coach. This feat was recognised in the number 17410, which accompanied his autograph, acknowledging the 17 grand finals he was in for 10 flags. Fans paid their respects to Barassi with a minute’s silence at Adelaide Oval before Saturday night’s semi-final between Port Adelaide and Greater Western Sydney. Carlton champion Robert Walls, who played under Barassi at the Blues, said: “He was a god to us.” AFL Commission chairman Richard Goyder lauded Barassi as “the most important figure in Australian football of the last 70 years since the Second World War”, and a visionary for nationalising the sport. “When our game was largely based in the south and west of Australia and revolved around the state leagues, Ron Barassi was constantly ahead of his time pushing for national development and a national league,” Goyder said. “A champion of Victoria who relished the battles against SA, WA and Tasmania at state level, Barassi saw the potential ahead if the game could unlock interest in New South Wales and Queensland and constantly pushed the game’s administrators to dream big, plan bigger and be prepared to risk dramatic steps into the unknown. Loading “He revolutionised the game as a player – created the position of ruck rover – built premiership success at clubs as a coach and then was our first great evangelist to take the game north and grow it to become what we have today. “He was known all across Australia when football wasn’t always known.” Albanese said Barassi was a legend who will forever be remembered by the game. “There is no more famous name in football than Ron Barassi and there is no one who gave more to the game that millions love,” Albanese said in a tribute on X, the social media platform formerly known as Twitter. “Ron Barassi was a legend in every sense of the word. A fearless player and leader, a visionary coach and a tireless champion for the growth and success of Australian rules football. AFL coaching colossus Ron Barassi in Sydney. Credit: Stuart Hannagan “Ron’s name and his legacy will be remembered as long as footy is played. “May he rest in peace.” Barassi, inducted as an AFL Legend in 1996, was a champion player for his beloved Melbourne, playing in all six of the club’s premierships during their dynasty in the 1950s and ’60s under Smith. Loading The Demons said they were deeply saddened by the loss of one of their favourite sons. “Everyone at the Melbourne Football Club is extremely saddened to hear of Ron’s passing. We send our sympathies and condolences to Ron’s family and friends at this incredibly sad time,” Demons chief Gary Pert said. “Ron was a much-loved character and friend to so many of us around the club which is why he will be so deeply missed. “Ron was more than a player and coach. He was an icon of the game, and a true Melbourne person. His legacy will forever be etched in the history of the game. “The entire football community has lost a giant, but Ron’s spirit and impact will live on through the game that he loved so dearly.” Barassi’s shock defection to Carlton for the 1965 season stunned the football world but his success continued, this time as a coach, guiding the Blues to premierships in 1968 and 1970. He delivered North Melbourne their first flag in 1975, and another in the 1977 grand final replay after a heart-stopping draw during his reign at Arden Street from 1973-80. But he was unable to lift Melbourne’s fortunes during his five seasons back at his spiritual home. He answered an SOS call from AFL and Sydney to come out of retirement and coach the relocated Swans, who were on their knees in 1993 but made a grand final three years later, largely due to the hope generated by Barassi. Loading Champions Tony Lockett and Paul Roos headed north in 1995 to play in the red and the white, their first season in Sydney also Barassi’s last in the coaches box. Blues president Luke Sayers paid tribute to Barassi, whose direction to his players to handball at all costs led to the club turning around a 44-point deficit at half-time to win by 10 points. It is one of the competition’s most fabled flags. “Arguably our game’s greatest name, a giant of Australian football, who left a legacy at every club whose doors he walked through, none more so than our own,” Sayers said. Ron Barassi the Blue with former prime minister Sir Robert Menzies in 1967. Credit: Bob Buchanan “It was late 1964 that Ron donned the navy blue, and for the proceeding decades, the Carlton Football Club never looked back. “The captain-coach of our drought-breaking flag in ’68, followed by what is considered the greatest victory of them all, the 1970 grand final comeback over Collingwood. “Ron transformed the game and indeed the clubs who were privileged to be graced with his presence. “How fitting that just last night, the two clubs in which he left such an impact, should play out a final that typified the toughness, ferocious competitiveness and passion that symbolised so much that was great about Ron. “On behalf of the entire Carlton Football Club, our most heartfelt condolences go out to the Barassi family and we thank them deeply for allowing us and our game, the honour of having the great Ron Barassi as forever part of it.” The Kangaroos, who held their best-and-fairest awards on Saturday night, said the club carried heavy hearts after the death of their first premiership coach. “Ron was a giant of the game and for a time he was ours,” North president Dr Sonja Hood said. “He famously guided us to our first-ever VFL/AFL premiership with a win over Hawthorn in 1975 and he backed that up with another flag in 1977, this time with a win over Collingwood. “But he was much more than a coach – he was a man of the game and the game will forever owe him an enormous debt of gratitude. “He gave his all for every club he represented – first Melbourne, then Carlton, North Melbourne and finally at Sydney. “For us, Ron will always be our first premiership coach and he’ll always be a North Melbourne legend. “Vale Ronald Dale Barassi.” His death comes nearly two years to the day since the Demons broke one of the biggest premiership droughts in VFL/AFL, winning the 2021 flag, their first triumph since 1964 after decades of hardship. That premiership was won at Perth’s Optus Stadium, and not in front of an MCG crowd, in a season impacted by the COVID-19 pandemic. Barassi, though, took part in unfurling the Demons’ 13th flag at a pre-game ceremony in round one last year. Age sports writer Greg Baum spoke to Barassi in the countdown to that flag triumph. “I feel very nervous. Nervous and excited,” Barassi said in the interview. “As long as they play their best. If their best is beaten, you’ve got to cop that. But if you play your best, you generally win.” Two years ago the Melbourne Football Club sent Barassi a gift pack with a scarf and T-shirt, and president Kate Roffey sent him a personalised video message, standing in front of the recently rediscovered 1964 premiership pennant. “The ’64 grand final was Barassi’s last game for Melbourne, that flag the last of six for him as a player,” Baum wrote . “He said later he felt oddly wrung out and played poorly in the first half, better in the second in a four-point win. Reminded that he had 17 touches, he says: ’Seventeen! That’s not much. Not happy!“ Loading Barassi, a member of Melbourne’s 1955, 1956, 1957, 1959, 1960 and 1964 premiership teams, is fondly remembered. Barassi (a record 10 premierships as a player or coach) shares that record with Melbourne coaching icon Norm Smith, ahead of Collingwood coaching great Jock McHale (nine) and Leigh Matthews (eight), widely regarded as the best player of the 20th century. Picked in the AFL Team of the Century when the league celebrated its anniversary in 1996, he was immediately awarded Legend status. Barassi’s playing career spanned two decades - the 1950s and 1960s - at Melbourne and Carlton. His transfer from the Demons to the Blues in ahead of the 1965 season was one of the most notable player moves in football history. He coached the Demons, Carlton, North Melbourne and Sydney Swans in 515 matches. His move to coach the Swans in 1993 came in a low period for the club a decade after they moved north to Sydney from South Melbourne. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article Vale Melbourne Demons Carlton Blues AFL 2023 North Melbourne Kangaroos Sydney Swans Collingwood Magpies Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Scott Spits is a sports reporter for The Age Connect via Twitter or email . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-16 23:18:38","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f63038bb7bb4b3295abb9bd75f1b3ba3","title":"Mtshingwe dominate Old Mutual Academy Cricket tournaments","link":"https://www.sundaynews.co.zw/mtshingwe-dominate-old-mutual-academy-cricket-tournaments/","keywords":["Sports"],"creator":["vusumuzi"],"video_url":null,"description":"Brandon Moyo, Sports Reporter EMAKHANDENI based Mtshingwe Primary School were the biggest winners of the two grassroots cricket tournaments that came to an end at the Old Mutual Academy of Cricket Excellence (former Heath Streak Academy) yesterday. The Tyson Meki-coached Mtshingwe Primary School won the Old Mutual Colts Cricket Cup and the CABS Under-13 Cricket […]","content":"The Sunday News EMAKHANDENI based Mtshingwe Primary School were the biggest winners of the two grassroots cricket tournaments that came to an end at the Old Mutual Academy of Cricket Excellence (former Heath Streak Academy) yesterday. The Tyson Meki-coached Mtshingwe Primary School won the Old Mutual Colts Cricket Cup and the CABS Under-13 Cricket Cup to make it a memorable event for the school. In the Colts Cricket Cup, Mtshingwe recorded a 38 runs win over Old Mutual Academy Colts before the Emakhandeni based side went on to record a close four runs win over Old Mutual Academy as well in the Under-13s event. The Mtshingwe Colts, batting first in the final, scored 66/1 in their innings before going on to restrict their opponents to 28/6 to claim the top honours. In the Under-13s final, the eventual champions, Mtshingwe restricted the Academy side to 39/2 while they had finished on 43/4 earlier on to help complete the double for their school. In the Under-13s semi-final, the dominant Mtshingwe thumped Khumalo Primary School by 55 runs. Mtshingwe scored 67/1 in their innings before they went on to restrict their opponents to just 12/7. The tournament featured 16 schools and 32 teams as part of the Old Mutual Academy of Cricket Excellence Trust’s commemoration of 10 years of existence. The Trust’s president and board chairperson, Joseph Rego was impressed with the way things went throughout the duration of the tournament. CABS, who are partners, through their managing director, Mehluli Mpofu said such a tournament was crucial to the growth of cricket in the country and it’s important to them as an organisation. He added that they will continue supporting the growth of cricket in the country and other sports. “It’s been a decade of supporting cricket. In this case, we are supporting the young, so it’s very developmental which obviously supports the growth of cricket in the country and particularly when you deal with disadvantaged people and give them an opportunity to actually grow in the sport. “It becomes very important to us as a business because ultimately what we always say to ourselves is we ought to be supportive of the community that we operate in and that is one way of doing so. “It’s important that we resume and as you can see here, there is lots of support from the schools. There are 16 schools with 32 teams and it’s important we give them a lot of support, cover as best as we can. “The commitment that we are giving as CABS and Old Mutual Group is that we will continue to support cricket and we will continue to look for other opportunities to support grassroots cricket and in other sports we need to look at how we can play a part as well,” said Mpofu. The tournament was also attended by Zanu-PF Politiburo member, Elifasi Mashaba, who is also the Trust’s vice-president and one of the founding fathers of the Academy in 2013. Mashaba said the tournament was a step in the right direction in helping to grow the game of cricket. As a token of appreciation for their participation at the event, all the schools got two cricket balls. Yesterday was not just a cricket event at the Old Mutual Academy of Cricket Excellence as they also organised a “Spring Fare and Fun Day” featuring different stalls, jumping castles and water slides for children, face painting, balloon making and many other activities for children and families. – Follow on Twitter @brandon_malvin.","pubDate":"2023-09-16 22:03:30","image_url":null,"source_id":"sundaynews","source_priority":2207190,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"36cc1a12a7aa725df517daf24b844f29","title":"Chiwanza walks away on his own terms","link":"https://www.sundaymail.co.zw/chiwanza-walks-away-on-his-own-terms","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"Tinashe Kusema Deputy Sports Editor THE day will come when Kudakwashe Chiwanza decides to open up on how he fell in and out of love with rugby. Maybe, he will do it through a tell-all biography or interview. However, for now, we have to make do with a cryptic but loaded reason behind what many […]","content":"The Sunday Mail THE day will come when Kudakwashe Chiwanza decides to open up on how he fell in and out of love with rugby. Maybe, he will do it through a tell-all biography or interview. However, for now, we have to make do with a cryptic but loaded reason behind what many are calling an “unfortunate” and “untimely” retirement from the game. “A lot happened to me this year, rugby-wise, and I wasn’t enjoying it anymore,” said the former Zimbabwe Sables and Cheetahs player. “I felt I was giving my all, but it just wasn’t the same . . .” The 32-year-old former Zimbabwe international broke the news on Facebook. He indicated that the recent Zambezi Challenge was to be his last outing. “It has been such a wonderful 13 years, and none of it would have been possible without the love and support from all of you.” One of the reasons Chiwanza’s retirement appears bizarre is its announcement on the eve of the Sevens’ Africa Cup presently underway at Harare Sports Club’s Machinery Exchange Stadium. The tournament, which ends today, attracted some of the continent’s Sevens heavyweights such as South Africa’s Bliztboks and Kenya — two teams that play in the HSBC World Rugby Sevens Series. Uganda are an emerging threat, while Zambia, Madagascar, Tunisia, Burkina Faso, Namibia, Algeria, Nigeria, Cote d’Ivoire and hosts Zimbabwe all took part. With an automatic ticket to next year’s Paris Olympic Games guaranteed for today’s winner, it seems the Africa Cup would have provided the perfect stage for a final bow for Chiwanza. However, he seems to have made up his mind a long time ago. “It’s something I had been thinking about since last year, and the Zambezi Challenge Cup just felt like the right time for me to call time on my 13-year international rugby career. “I have no regrets at all,” he said. The ex-Falcon College learner found his footing pretty early in his career, as he joined Old Georgians Rugby Club soon after school in 2011. Chiwanza was named rookie of the year in his debut season. Call-ups to the Sables and Cheetahs, his preferred format, soon followed, after which he became a semi-permanent member of the latter. The 2014 and 2015 seasons are arguably his greatest years, as he was amongst the top try-scorers for both. He also won the title with Old Georgians. Prior to this, he tried out sports that include football, basketball and hockey. “Rugby wasn’t my first choice in sports. Most people would be surprised to know that cricket was my first love,” he was once quoted saying. “I made the Manicaland provisional side and even had a short stint with Strugglers Cricket Club.” He only started playing rugby when he enrolled at Mvurachena Primary School in Chipinge, Manicaland, where he was forced to partake every sport, as the institution did not have that many learners. “It was at Mvurachena, when I was in Grade Six, that I started playing for Eastern District Rugby,” he said. His numerous accolades on the rugby front include making the Matabeleland Under-18 team for three straight years and then the Zimbabwe Under-20 Junior World Trophy in 2011. Chiwanza played for Old Georgians (2011-2023), had a couple of stints in varsity rugby and made the Sharks Academy tour team. He would get his Sables and Cheetahs debuts in 2011. He was also part of the World Cup Sevens team and Africa Cup teams in 2018. With the Sables, he won the Victoria Cup in 2011 and 2019, and participated in the SuperSport Rugby Challenge in 2019. Chiwanza believes his debut for the Sables was a special moment in his career, as his mother, Judith, was present to watch him play. Sadly, she later passed away following a bout of pneumonia. Other notable rugby moments, Chiwanza said, included “playing Spain in Hong Kong in 2016 and Africa Cup 2018”. “I also had the pleasure of meeting the likes of Jonah Lomu, Sonny Bill Williams (New Zealand), Bryan Habana (South Africa), Brian O’Driscoll (Ireland) and Dan Norton (Great Britain), who are some top Sevens players. “Monaco and Hong Kong were among my favourite venues and tournaments,” he said. As he rides off into the sunset, Chiwanza even had some wise words for his former teammates, friends and, most importantly, fans. “Never give up on your dreams, but just keep working hard and your time will come. “Everyone should aim for the highest cloud so that if you miss it, you will hit a lofty mountain.” ■","pubDate":"2023-09-16 22:02:35","image_url":null,"source_id":"sundaymail","source_priority":1245383,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"5fc31bc2570b9705e19b6f9a6d83db0c","title":"Could Hamid be the next Raza?","link":"https://www.sundaymail.co.zw/could-hamid-be-the-next-raza","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"Sports Reporter ALI-AKBAR KHAN HAMID is one of those cricketers who are hard to put in a box. A clean hitter of the ball, the Takashinga Patriots II batter is every coach’s dream. He is comfortable batting anywhere between the top and middle order. In fact, by his own admission, Hamid is comfortable batting in […]","content":"The Sunday Mail ALI-AKBAR KHAN HAMID is one of those cricketers who are hard to put in a box. A clean hitter of the ball, the Takashinga Patriots II batter is every coach’s dream. He is comfortable batting anywhere between the top and middle order. In fact, by his own admission, Hamid is comfortable batting in the top order in limited-overs cricket. But he prefers the middle order in the longer version of the game. Together with Spencer Magodo and Tinashe Chiorah, the 23-year-old is one of three figures currently making waves in local cricket. Some have even predicted the trio could form the core of the Chevrons team once Sikandar Raza, skipper Craig Ervine and Sean Williams — who are all approaching the twilight of their international careers — leave the stage. However, what sets Hamid apart from his peers is the constant comparisons to talisman Raza. While he does idolise the Zimbabwe all-rounder, he chooses to ignore the hype. “Sikandar (Raza) is like an elder brother to me, but I would like to build my own name and achieve my own goals. “He (Raza) is definitely an inspiration to me, though,” he said. Sikandar and Hamid are both of Pakistani descent. However, unlike Raza, Ali-Akbar comes from a strong cricket family. His father, Abid, is a former manager of Zimbabwe A and liaison officer for visiting Asian teams. “I started cricket at a very young age, as I was brought up in a household where my father, Abid Hamid, was involved with Zimbabwe cricket and Old Hararians Club, and my brother, Saad Khan, is a cricketer,” he said. “My father had a couple of roles in Zimbabwe cricket, with some of the notable ones being manager for Zimbabwe A side and liaison officer for a number of overseas teams that came to Zimbabwe. “Most of these teams were from Asia. “I would like to say my inspiration for the game was my brother (Saad Khan). Seeing him dominate the local game, scoring hundreds every other weekend, gave me inspiration to play and dream of representing Zimbabwe one day.” That was years ago. The Takashinga Patriots II player is now in his third year in the National Premier League, the country’s top club competition. The 2023 edition could very well end up being his breakthrough season. He is presently part of the leading pack of top batters with 355 runs from eight innings. His rates average and strike rates stand at 71.0 and 78.0, respectively. “This NPL, so far, has been a good journey as we approach the halfway mark. “It has been good so far. All praise to Allah for giving me this opportunity to score some runs in the National Premier League. “I have enjoyed my time with Takashinga,” he said. Hamid dreams of one day playing for the Chevrons. He has vowed to put in the work and often seeks advice from the likes of Raza, Faraz Akram and Elton Chigumbura. “As an upcoming cricketer, I look forward to just keep getting better every day; controlling what I can by working hard on my game. “Chigumbura is one of my mentors, who always pushes me to get better, while Akram helps me out with the mental aspect of the game. “They always give me advice, like elder brothers, and are usually a call away when I need help. “Like I said, Raza has been an inspiration to me. “The way he has worked hard for all his achievements, talking to him is a privilege that I have, and I try to listen to him carefully.”","pubDate":"2023-09-16 22:02:27","image_url":null,"source_id":"sundaymail","source_priority":1245383,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"448df85c68c4e455294bec79bd2540b6","title":"Cricketer’s World Cup availability in doubt","link":"https://www.sundaymail.co.zw/cricketers-world-cup-availability-in-doubt","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"Australia opener Travis Head has a confirmed fracture in his left hand that puts his availability for the early part of the World Cup in jeopardy after he was struck by a Gerald Coetzee short delivery in the fourth One-Day International against South Africa at SuperSport Park on Friday. Head was on nine, facing his […]","content":"The Sunday Mail Australia opener Travis Head has a confirmed fracture in his left hand that puts his availability for the early part of the World Cup in jeopardy after he was struck by a Gerald Coetzee short delivery in the fourth One-Day International against South Africa at SuperSport Park on Friday. Head was on nine, facing his eighth delivery, when he was struck on the left glove attempting a pull off Coetzee. He received treatment onfield from the Australian medical staff before continuing to bat, but only faced three more deliveries before retiring hurt in clear discomfort. He was sent to hospital for an x-ray and Australia coach Andrew McDonald confirmed after the match that it had shown a fracture. He will have further scans with more information on the severity of his injury and a timeline for his recovery to be determined. Head did return to the ground at the end of the match, but had his left hand in a splint. “At this stage, it’s a confirmed fracture. “How long that timeframe is, we are yet to determine that. “Fingers crossed with the World Cup fast approaching,” McDonald said post-match. Australia’s chase of 417 suffered early dents when they were reduced to 22 for two, but Head made a strong start. After he was struck, he whipped Marco Jansen over deep backward square for six but then toe-ended the next ball just short of Kagiso Rabada at mid-off, taking the injured hand off the bat while playing the stroke. He immediately removed his glove at the non-striker’s end. The next ball he faced he made room to cut but Coetzee followed him and cramped him as he tried to flay it through the offside. He immediately winced in severe pain after playing the stroke and walked straight to the dressing room, informing stand-in South Africa captain Aiden Markram and the umpires that he could not continue as he walked off. Australia were 53 for two in the ninth over at the time and ended up being bowled out for 252 with Head not returning to bat when the ninth wicket fell. The injury will increase speculation that Marnus Labuschagne, who was not part of Australia’s initial World Cup squad, could force his way into the final playing group. Labuschagne came on as a concussion substitute in the first ODI and scored an unbeaten 80 in a match-winning cause, and followed that up with 124 in the second game. Head’s injury adds to Australia’s long list of concerns heading to the World Cup. Pat Cummins (wrist fracture), Steven Smith (wrist tendon), Mitchell Starc (groin), Glenn Maxwell (leg) are all coming off lay-offs, and hoping to be fit for the three-match ODI series against India that starts on September 22 in the lead-up to the World Cup. Ashton Agar also only played one game in South Africa, coming off a calf strain, before heading home to Perth for the birth of his first child. He was supposed to play at least two but he was unavailable due to soreness before flying home and he is unlikely to return to the squad until after the India ODI series. Cameron Green is coming off a concussion in the opening match of the South Africa series, but McDonald was hopeful he would be available for final game of the series today after serving his mandatory eight-day rest period. “He’s been cleared by the medical team,” McDonald said. “He is just working away getting prepared. Hopefully, he’s available for game five,” he said. — Cricinfo.","pubDate":"2023-09-16 22:02:24","image_url":null,"source_id":"sundaymail","source_priority":1245383,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"63de8a2a7c3346e7295fdeb14175609d","title":"Asia Cup final: Sri Lanka will look to defend crown against most successful team in event, India","link":"https://thenewsmill.com/2023/09/asia-cup-final-sri-lanka-will-look-to-defend-crown-against-most-successful-team-in-event-india/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Two cricketing giants from the sub-continent will lock horns on a blockbuster Sunday in the battle to crown Asia’s best. The final of the ongoing Asia Cup between the hosts Sri Lanka and India promises a thrill-a-minute ride, with both teams recording impressive wins on the road to the final. While the Lankans will go into the final as the defending champions, Team India, led by in-form Rohit Sharma, will be desperate to lift the trophy that they haven’t won since 2018. Having secured qualification for the showpiece event, overcoming myriad challenges and close contests in the ICC World Cup Qualifiers, the Lankans would be keen not to cede the mantle of Asia’s best to their sub-continental neighbours. A win in the all-important final on Sunday will certainly make them a dark horse in the World Cup, where the matches will be played on familiar sub-continental surfaces. Sri Lanka came close to handing India their first defeat of the Asia Cup 2023 in the Super Four stage but the visitors’ bowling attack came to the party to eke out a hard-fought win. On a surface known to offer plenty of purchase for the spinners, the Lankan Lions will miss their bowling trump card — mystery spinner Maheesh Theekshana. The tweaker, who has been among the wickets in the tournament, was ruled out of the final after sustaining an injury in his right hamstring during their nerve-jangling Super Four clash against Pakistan. In a tournament where Pakistan’s pace trio of Haris Rauf, Shaheen Shah Afridi and Nasim Shah has dominated the wicket-takers list, Theekshana made his mark by claiming 9 wickets in 5 matches at an economy of 5.15. Barring a narrow defeat in an inconsequential Super Four clash against Bangladesh on Friday, India have been on song in the tournament. However, the visitors suffered a setback going into the final, with all-rounder Axar Patel ruled out because of a left quadriceps strain that he sustained during the Super Four clash with Bangladesh on Friday. In his place, Washington Sundar was called in ahead of the final and will have an opportunity to put himself in contention for the World Cup squad, should he make the playing eleven on Sunday. All-rounder Shardul, while going cold with the willow so far in the tournament, has been in good wicket-taking form as he ended up with figures of 3-65 against Bangladesh. Shakib Al Hasan, Anamul Haque and Tanzid Hasan were his victims on the evening. But India could be tempted to play Sundar in place of Shardul in the final, as offers a similar set of skills with the bat while adding more variety with his left-handed batting style in a line-up that majorly comprises right-handers. Ahead of the clash of the Asian giants, Sri Lanka skipper Dasun Shanaka declared that his team was ready for the final. “Of course, we are ready [for the Asia Cup 2023 final]. See, it totally depends on the pitch. The pitches have been playing a part in this tournament. According to the pitch stats, we are picking a good side, especially bowling against India, we need to take more wickets upfront. That opens the game for us. That’s a key area in the game,” Shanaka said in a pree-match press conference on Saturday. Shubman Gill, who struck a century albeit in a losing cause against Bangladesh, stressed the importance of lifting the Asia Cup trophy ahead of the World Cup. “Winning the [Asia Cup] final is very important for us because we need to create a winning habit. Peaking at the right time and gaining momentum at the right time is important,” Gill said. (ANI)","pubDate":"2023-09-16 21:30:14","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c2642d630393e762a10435f8c9998b50","title":"Tamim Iqbal, Soumya Sarkar recalled for Bangladesh’s first two ODIs against New Zealand","link":"https://thenewsmill.com/2023/09/tamim-iqbal-soumya-sarkar-recalled-for-bangladeshs-first-two-odis-against-new-zealand/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Bangladesh recalled Tamim Iqbal, Mahmudullah Riyad, Soumya Sarkar, and Quazi Nurul Hasan Sohan for the first two of the three upcoming ODIs against New Zealand in Dhaka next week. “The Bangladesh Cricket Board (BCB) has announced the squad for the first and second ODIs of this month’s three-match series against New Zealand in Dhaka,” BCB said in a statement. Wary of managing the workloads of several key players ahead of the ICC ODI World Cup, which will get underway in India next month, Bangladesh have decided them in the first two ODIs against New Zealand. Swashbuckling keeper-batsman Litton Das will lead the side in the absence of regular captain Shakib Al Hasan, who has been rested. Among the other key players rested are Mushfiqur Rahim, all-rounder Mehidy Hasan Miraz and the pace battery of Taskin Ahmed, Hasan Mahmud and Shoriful Islam. Despite several key names missing, Bangladesh will not go into the series short on experience as the likes of Tamim Iqbal, Mahmudullah, Soumya Sarkar and Nurul Hasan Sohan will mark their return to the limited-overs setup. The Tigers have called up three uncapped players — southpaw Zakir Hasan, pacer Khaled Ahmed and leg-spinner Rishad Hossain. They could all be in line for debuts during the ODI series. Naim Sheikh, Afif Hossain and Shamim Hossain were players from the Asia Cup squad to have missed out. “The decision to rest players was taken in consideration of the World Cup in India which will be a long tournament where ensuring the mental and physical fitness of the cricketers will be very important. The series against New Zealand provides us an opportunity to take a look at some other players as well ahead of this major event,” the chairman of Bangladesh’s National Selection Panel, Minhajul Abedin, said in a statement. “The squad is a blend of experience and youth and only Zakir, Khaled and Rishad have not featured in ODIs yet. Zakir was very close to playing against Ireland in March before he suffered an unfortunate injury. Khaled has done well in his list A career and Rishad offers a different dimension to our bowling attack,” he added. Squad (for the first two ODIs): Litton Das (captain), Tamim Iqbal, Soumya Sarkar, Anamul Haque, Tawhid Hridoy, Mahmud Ullah, Nurul Hasan Sohan, Mahedi Hasan, Nasum Ahmed, Mustafizur Rahman, Tanzim Hasan, Tanzid Hasan, Zakir Hasan, Rishad Hossain and Khaled Ahmed. (ANI)","pubDate":"2023-09-16 20:30:11","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"889d5a887db75437e5c4215bf5f84cc8","title":"Wrist injection has Steve Smith primed for World Cup","link":"https://www.brisbanetimes.com.au/sport/cricket/wrist-injection-has-steve-smith-primed-for-world-cup-20230914-p5e4n7.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"The Australian batsman revealed he needed a cortisone injection for a niggling wrist problem ahead of his departure for the World Cup in India.","content":"Steve Smith is off to India on Monday in pursuit of Australia’s’ sixth ODI World Cup, but has revealed he needed a cortisone injection for a niggling left wrist problem before he could get back in the nets. The wrist trouble, which began when he injured it in the field on the final day of the Lord’s Ashes Test, affected Smith during the final three matches and lingered at home even after he spent two weeks in a brace to limit movement and promote healing. Steve Smith launched the New Balance store in Bondi Junction last week. Credit: Dion Georgopoulos Having already been ruled out of the white-ball tour of South Africa and with time ticking down to the trip to India and pursuit of the ODI World Cup, 34-year-old Smith’s medical advisors resorted to cortisone, which eradicated lingering pain in time to allow him to return to training last week , before his departure for India on Monday. “I was in a brace for a couple of weeks, just trying to limit the movement, which once I got that off it hadn’t really made a big difference to be honest,” Smith told this masthead at the opening of the New Balance store in Bondi Junction. “Then I got a cortisone in it last Thursday, and that has made a big difference. So I’ve had a couple of sessions back batting now and it feels pretty normal. Loading “Hopefully, I don’t need another one and it just settles it down. But the part of the wrist it is, they’ve said that if I do need another one, then that’ll be no stress as well. Fingers crossed that it just heals up and it’s fine, but [it is] feeling good at the moment.” While Smith fought through the pain barrier in England, freedom and confidence in his wrist will be hugely important in white ball matches in India, where he will need to be able to push the scoring rate and clear the boundary at times. “Initially in the nets, a couple of balls I faced where I got inside edges to them and your bat turns sharply, I was a bit wary of that to begin with because that’s what was actually one of the things causing my pain,” he said. “I inside-edged a couple of balls in the nets the other day and my bat turned sharp, and I was like ‘oh, that was hurting before’ and it wasn’t hurting anymore. So that’s a real positive, and I feel as though I can play all my shots and there’s no pain at all.” With Australia’s World Cup squad of 15 to be finalised on September 28, Marnus Labuschagne is now in line to squeeze into the group after Travis Head suffered a fractured hand in South Africa. Smith may now find himself at No. 3 in the batting order if heavy-hitting Mitchell Marsh partners David Warner in Head’s place. “I think I average 55 at three, or something like that, so it’s definitely my preferred spot. But I’ll do whatever the team needs,” Smith said. “White-ball cricket, you’d love to bat as high as you can, so we’ll see what they want to do. “When you look at World Cups as opposed to the standard bilateral series, I reckon the scores naturally come down a little bit anyway, with the extra pressure of big games and things like that. Then you throw in the mix that wickets are going to be wearing and turning. “You want to be hitting your straps in the big tournaments; that’s what everyone wants to win. It’s not like I’m saying every game isn’t important, but big tournaments are the ones you want to win. We did that in 2015 and that was really special.” Loading In his net sessions in India, Smith will have to get used to wearing a neck guard after Cricket Australia made the extra protection mandatory following nearly a decade of research and consideration. “It’s not my ideal choice, but it’s come in, so I’m going to have to run with it,” Smith said, after having to wear one in county cricket earlier this year where neck guards were made compulsory in 2022. “I didn’t know the rules and the umpires said I needed to get a neck guard. I got one on and it was kind of just normal. It feels a little bit odd at the start and after a session or two you get used to it and forget it’s there. “My collar that I usually like to wear up, that just hits against it, so I’ll have to wear my collar down and that was the thing that was annoying me the most. Easy adjustment.” After protracted negotiations with Cricket Australia lasting two seasons, Smith overturned perceptions of his waning worth as a Twenty20 batter with a series of startling displays for the Sydney Sixers in last season’s Big Bash League. Steve Smith will nominate for the Indian Premier League auction for 2024. Credit: Dion Georgopoulos As a consequence, he was pencilled in to open the batting in the T20 series in South Africa before the wrist injury got in the way, and is optimistic about his chances of being picked up by a team at the next Indian Premier League auction. The 2024 tournament is proving increasingly attractive to Australian cricketers due to their lighter touring schedule in 2024. “I’ll be throwing my hat in the ring for sure,” Smith said. Loading “It’s a tournament I loved playing in the past, it’s a great challenge. All the best players from around the world are there. “I feel like I’m learning all the time and my game’s progressing, so I think I showed what I’m capable of up the top of the order in the Big Bash in the few games that I played, and the amount of sixes I hit as well.” News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Steve Smith Cricket Australia Cricket World Cup Daniel Brettig is The Age's chief cricket writer and the author of several books on cricket. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-09-17 03:38:03","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"cc5e79f3e1118da360e7ae9cbe6147d7","title":"Asia Cup 2023 Final: फाइनल से पहले कप्तान दासुन शनाका के बयान ने मचाई खलबली, \"बेशक, हम फाइनल...\"","link":"https://sports.ndtv.com/hindi/cricket/dasun-shanaka-praise-his-team-player-after-defeat-pakistan-and-also-talk-about-india-vs-sri-lanka-asia-cup-2023-final-4397049#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Dasun Shanaka on Asia Cup 2023 Final: गत चैंपियन श्रीलंका रविवार को कोलंबो के आर प्रेमदासा स्टेडियम में एशिया कप 2023 के फाइनल में भारत से भिड़ेगी.","content":"Asia Cup 2023 Final IND vs SL पाकिस्तान को हराकर लगातार दूसरी बार एशिया कप के फाइनल में पहुंचने के बाद श्रीलंकाई कप्तान शनाका (Dasun Shanaka on SL vs PAK) ने पाकिस्तान के खिलाफ जीत को याद करते हुए हुए खिलाड़ियों का हौसला बढ़ाया. शनाका ने इस बात पर ज्यादा जोड़ दिया की उनकी टीम को बस भारत के हाथों हार का सामना करना पड़ा है. ऑलराउंडर ने भारत के खिलाफ मैच में लड़ने की भावना के लिए टीम को श्रेय दिया, जहां डुनिथ वेलालेज (Dunith Wellalage Five Wicket Hall) के पांच विकेट और चैरिथ असलांका के चार विकेट ने उन्हें मेहमान टीम को 213 रन पर समेटने में मदद की. यंगस्टर वेललेज ने एक उल्लेखनीय उपलब्धि हासिल की और उन्होंने अपना स्थान सुरक्षित कर लिया. उन्होनें पहली बार 5 विकेट लेने का कारनामा किया और अकेले दम पर मजबूत भारतीय बल्लेबाजी लाइनअप को ध्वस्त करना और रोहित शर्मा, शुबमन गिल, विराट कोहली, केएल राहुल और हार्दिक पंड्या जैसे शीर्ष बल्लेबाजों का विकेट हासिल किया. “हाँ, श्रीलंका सही समय पर शिखर पर है. आप जानते हैं कि लड़के जानबूझकर देश के लिए अच्छा प्रदर्शन करना चाहते हैं. एक टीम के रूप में हम कमज़ोर रहे हैं, इसलिए हर कोई बड़े मंच पर प्रदर्शन करना चाहता है. इन युवाओं को दुनिया को दिखाना होगा कि वे क्या करने में सक्षम हैं. यह इस युवा टीम का रहस्य है, \"दसुना (Dasun Shanaka on Asia Cup FInal) ने शनिवार को श्रीलंका क्रिकेट बोर्ड के यूट्यूब चैनल के हवाले से प्री-मैच प्रेस कॉन्फ्रेंस में कहा. असालंका ने भी भारत को काफी परेशान किया और 18 रन देकर 4 विकेट लिए, जबकि धनंजय डी सिल्वा ने एक छोर से चीजों को शांत रखा, जबकि अन्य गेंदबाजों ने विपरीत छोर से विकेट लिए. “भारत के खेल में, आपने देखा कि हमने गेंदबाजी में पहले 10 ओवरों के बाद किस तरह संघर्ष किया. वो (प्रशंसक) इन खिलाडि़यों (डुनिथ वेलालेज, मथीशा पथिराना और चैरिथ असलांका और पथुम निसांका) जैसे युवा बल्लेबाजों को यह देखना पसंद करते हैं कि वे इस खेल में कैसे कमाल करते हैं. सदीरा समरविक्रमा को भी नहीं भूलना चाहिए,'' दासुन शनाका ने कहा. शनाका (Dasun Shanaka on IND vs SL Asia Cup Final) ने कहा कि अगर उन्हें एशिया कप जीतने का मौका चाहिए तो उन्हें भारत के खिलाफ अपने सुपर 4 प्रदर्शन को दोहराना होगा. “बेशक, हम एशिया कप 2023 फाइनल के लिए तैयार हैं. देखिए, यह पूरी तरह से पिच पर निर्भर करता है. इस टूर्नामेंट में पिचें अहम भूमिका निभा रही हैं. पिच आंकड़ों के अनुसार, हम एक अच्छी टीम चुन रहे हैं, खासकर भारत के खिलाफ गेंदबाजी करते हुए, हमें पहले से अधिक विकेट लेने की जरूरत है. इससे हमारे लिए खेल खुल जाता है.\" उन्होंने कहा. श्रीलंका के कप्तान दासुन शनाका ने रविवार को कोलंबो के आर प्रेमदासा स्टेडियम में खेले जाने वाले एशिया कप 2023 के फाइनल में पहुंचने के लिए अपनी टीम की प्रशंसा की. गत चैंपियन श्रीलंका रविवार को कोलंबो के आर प्रेमदासा स्टेडियम में एशिया कप 2023 के फाइनल में भारत से भिड़ेगी. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-09-17 01:52:13","image_url":"https://c.ndtvimg.com/2023-09/lcf8jj7_dasun-shanaka-afp_625x300_16_September_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"f19b0cfd82e3dab01e3c1431510a8d79","title":"St Kilda lose a premiership hero: ‘Cowboy’ Neale dies at 78","link":"https://www.brisbanetimes.com.au/sport/afl/st-kilda-lose-a-premiership-hero-cowboy-neale-dies-at-78-20230917-p5e5af.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Claire Siracusa and Jon Pierik"],"video_url":null,"description":"St Kilda premiership hero Kevin “Cowboy” Neale has passed away overnight at the age of 78.","content":"St Kilda premiership hero Kevin “Cowboy” Neale has died at the age of 78. Neale, who was diagnosed with Alzheimer’s disease in 2018, passed away overnight on Saturday. “His health struggles in recent times were well-publicised, and his teammates regularly visited him in Albury as a group. Through the difficult times, his wife Georgina was a constant pillar of strength and the club extends its deepest sympathies to her and the Neale family,” the club said in a statement on Sunday. Kevin ‘Cowboy’ Neale. Credit: St Kilda Football Club/Supplied “Cowboy was truly a beloved figure at the Saints, not only among his teammates and fans, but by those who worked alongside him at the club long after his playing days.” Neale, renowned for his strength and able to play as a key defender or forward, was recruited from South Warrnambool in 1965, and set a then Saints’ club record of 256 games. This included playing in the club’s sole premiership in 1966, when he booted five of the Saints’ 10 goals in a one-point win over Collingwood. Loading “The thing that really stuck with me – and I still remember it to this day – is the number of people, a lot of them were older … who were sitting there still in their seats just crying because they’d been following St Kilda for 60 or 70 years,” Neale said in an interview with the AFL Players Association in 2013. “It struck me then, how much does it mean to these people? To look at it and now; 140 years we’ve been going, and we’ve still only won one.” Neale won St Kilda’s best and fairest in 1973 and was later named in the club’s team of the century and hall of fame. After his VFL career, he captain-coached Canberra club Ainslie to four premierships in the ACT and also led the ACT to a famous victory over a Victorian team in a precursor to State of Origin. He then coached Central District in the SANFL. Returning to the Saints in later years, he worked in the marketing department and was president of the Past Players Association. While Neale played in St Kilda’s only premiership, he also played in two losing grand finals, against Essendon in ’65, and Hawthorn in ’71. “In 1971 we were 20 points up at three-quarter time and then got rolled by Hawthorn. And that hurt. I must say, the disappointment out of that never goes away,” Neale said in 2013. Kevin “Cowboy” Neale was much-loved by the St Kilda faithful. Credit: Aaron Sawall Neale said the significance of playing in the ’65 grand final may have been lost on him at the time. “I’d played in grand finals for about nine years in a row [before playing for St Kilda] so I thought it was just normal. But then we missed out after ’66 through to ’71. The longer you play the game, the more you realise just how hard it is to win a premiership,” Neale said. While he was a supporter of the modern game, Neale questioned why there was so much importance on handballing. “I know I’m old-fashioned and all that, but I just cannot believe the number of handballs we have today,” he said. “I looked at the stats the other day for the grand final in ’66 when we won it and I think we had a total of 31 handballs. They have a minimum of about 250 now.” Loading But he then added: “The work-rate now, and the fitness, is just superb. That would be the thing that would make it hard for the majority of blokes in my day.” However, he said the likes of Darrel Baldock, Ian Stewart, Ted Whitten and Bobby Skilton would have handled the modern game “without any problems at all.” Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 St Kilda Saints Claire Siracusa is a desk editor in The Age sport department. Connect via email . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-17 01:38:05","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2797901d1eeb39902cef408ad5d49606","title":"‘He was a god to us’: AFL great Ron Barassi dies","link":"https://www.brisbanetimes.com.au/sport/afl/ron-barassi-dies-20230916-p5e56w.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu, Scott Spits and Jon Pierik"],"video_url":null,"description":"AFL Legend, coaching great and champion player Ron Barassi has been remembered as the game’s most important post-war figure, as his family is offered a state funeral for the football titan.","content":"AFL Legend, coaching great and champion player Ron Barassi has been remembered as the game’s most important post-war figure after his death at the age of 87. The family confirmed his passing on Saturday in a statement, a day after the two clubs he is best associated with — Melbourne and Carlton — played their first final against each other in 23 years at the MCG. Football legend Ron Barassi. Credit: John Donegan “After a full and extraordinary life, Ronald Dale Barassi, aged 87, left us today due to complications from a fall,” the family said. “He died peacefully, surrounded by loving family. We ask for privacy at this time.” Prime Minister Anthony Albanese was among many to pay tribute to Barassi, one of the most revered and respected identities in the game, who spent more than half his life dedicated to the sport he loved either as a coach, player or media identity. Victorian Premier Daniel Andrews confirmed the Barassi family will be offered a state funeral to honour the Australian sporting icon. “The word legend is used a lot. But nobody deserves it quite like Ron Barassi,” Andrews said in a social media post. “He didn’t just play the game – he reshaped it. “And how fitting that (Friday) night’s game was a cliffhanger between the Dees and the Blues. Loading “The government will offer Ron’s family a state funeral to remember him – and I hope they accept.” Players and fans gave Barassi a standing ovation at Adelaide Oval and there was a short period of silence before Saturday night’s Port Adelaide-GWS semi-final. Barassi, along with the great Norm Smith, featured in an equal record 10 premierships as a player or coach. This feat was recognised in the number 17410, which accompanied his autograph, acknowledging the 17 grand finals he was in for 10 flags. Fans paid their respects to Barassi with a minute’s silence at Adelaide Oval before Saturday night’s semi-final between Port Adelaide and Greater Western Sydney. Carlton champion Robert Walls, who played under Barassi at the Blues, said: “He was a god to us.” AFL Commission chairman Richard Goyder lauded Barassi as “the most important figure in Australian football of the last 70 years since the Second World War”, and a visionary for nationalising the sport. “When our game was largely based in the south and west of Australia and revolved around the state leagues, Ron Barassi was constantly ahead of his time pushing for national development and a national league,” Goyder said. “A champion of Victoria who relished the battles against SA, WA and Tasmania at state level, Barassi saw the potential ahead if the game could unlock interest in New South Wales and Queensland and constantly pushed the game’s administrators to dream big, plan bigger and be prepared to risk dramatic steps into the unknown. Loading “He revolutionised the game as a player – created the position of ruck rover – built premiership success at clubs as a coach and then was our first great evangelist to take the game north and grow it to become what we have today. “He was known all across Australia when football wasn’t always known.” Albanese said Barassi was a legend who will forever be remembered by the game. “There is no more famous name in football than Ron Barassi and there is no one who gave more to the game that millions love,” Albanese said in a tribute on X, the social media platform formerly known as Twitter. “Ron Barassi was a legend in every sense of the word. A fearless player and leader, a visionary coach and a tireless champion for the growth and success of Australian rules football. AFL coaching colossus Ron Barassi in Sydney. Credit: Stuart Hannagan “Ron’s name and his legacy will be remembered as long as footy is played. “May he rest in peace.” Barassi, inducted as an AFL Legend in 1996, was a champion player for his beloved Melbourne, playing in all six of the club’s premierships during their dynasty in the 1950s and ’60s under Smith. Loading The Demons said they were deeply saddened by the loss of one of their favourite sons. “Everyone at the Melbourne Football Club is extremely saddened to hear of Ron’s passing. We send our sympathies and condolences to Ron’s family and friends at this incredibly sad time,” Demons chief Gary Pert said. “Ron was a much-loved character and friend to so many of us around the club which is why he will be so deeply missed. “Ron was more than a player and coach. He was an icon of the game, and a true Melbourne person. His legacy will forever be etched in the history of the game. “The entire football community has lost a giant, but Ron’s spirit and impact will live on through the game that he loved so dearly.” Barassi’s shock defection to Carlton for the 1965 season stunned the football world but his success continued, this time as a coach, guiding the Blues to premierships in 1968 and 1970. He delivered North Melbourne their first flag in 1975, and another in the 1977 grand final replay after a heart-stopping draw during his reign at Arden Street from 1973-80. But he was unable to lift Melbourne’s fortunes during his five seasons back at his spiritual home. He answered an SOS call from AFL and Sydney to come out of retirement and coach the relocated Swans, who were on their knees in 1993 but made a grand final three years later, largely due to the hope generated by Barassi. Loading Champions Tony Lockett and Paul Roos headed north in 1995 to play in the red and the white, their first season in Sydney also Barassi’s last in the coaches box. Blues president Luke Sayers paid tribute to Barassi, whose direction to his players to handball at all costs led to the club turning around a 44-point deficit at half-time to win by 10 points. It is one of the competition’s most fabled flags. “Arguably our game’s greatest name, a giant of Australian football, who left a legacy at every club whose doors he walked through, none more so than our own,” Sayers said. Ron Barassi the Blue with former prime minister Sir Robert Menzies in 1967. Credit: Bob Buchanan “It was late 1964 that Ron donned the navy blue, and for the proceeding decades, the Carlton Football Club never looked back. “The captain-coach of our drought-breaking flag in ’68, followed by what is considered the greatest victory of them all, the 1970 grand final comeback over Collingwood. “Ron transformed the game and indeed the clubs who were privileged to be graced with his presence. “How fitting that just last night, the two clubs in which he left such an impact, should play out a final that typified the toughness, ferocious competitiveness and passion that symbolised so much that was great about Ron. “On behalf of the entire Carlton Football Club, our most heartfelt condolences go out to the Barassi family and we thank them deeply for allowing us and our game, the honour of having the great Ron Barassi as forever part of it.” The Kangaroos, who held their best-and-fairest awards on Saturday night, said the club carried heavy hearts after the death of their first premiership coach. “Ron was a giant of the game and for a time he was ours,” North president Dr Sonja Hood said. “He famously guided us to our first-ever VFL/AFL premiership with a win over Hawthorn in 1975 and he backed that up with another flag in 1977, this time with a win over Collingwood. “But he was much more than a coach – he was a man of the game and the game will forever owe him an enormous debt of gratitude. “He gave his all for every club he represented – first Melbourne, then Carlton, North Melbourne and finally at Sydney. “For us, Ron will always be our first premiership coach and he’ll always be a North Melbourne legend. “Vale Ronald Dale Barassi.” His death comes nearly two years to the day since the Demons broke one of the biggest premiership droughts in VFL/AFL, winning the 2021 flag, their first triumph since 1964 after decades of hardship. That premiership was won at Perth’s Optus Stadium, and not in front of an MCG crowd, in a season impacted by the COVID-19 pandemic. Barassi, though, took part in unfurling the Demons’ 13th flag at a pre-game ceremony in round one last year. Age sports writer Greg Baum spoke to Barassi in the countdown to that flag triumph. “I feel very nervous. Nervous and excited,” Barassi said in the interview. “As long as they play their best. If their best is beaten, you’ve got to cop that. But if you play your best, you generally win.” Two years ago the Melbourne Football Club sent Barassi a gift pack with a scarf and T-shirt, and president Kate Roffey sent him a personalised video message, standing in front of the recently rediscovered 1964 premiership pennant. “The ’64 grand final was Barassi’s last game for Melbourne, that flag the last of six for him as a player,” Baum wrote . “He said later he felt oddly wrung out and played poorly in the first half, better in the second in a four-point win. Reminded that he had 17 touches, he says: ’Seventeen! That’s not much. Not happy!“ Loading Barassi, a member of Melbourne’s 1955, 1956, 1957, 1959, 1960 and 1964 premiership teams, is fondly remembered. Barassi (a record 10 premierships as a player or coach) shares that record with Melbourne coaching icon Norm Smith, ahead of Collingwood coaching great Jock McHale (nine) and Leigh Matthews (eight), widely regarded as the best player of the 20th century. Picked in the AFL Team of the Century when the league celebrated its anniversary in 1996, he was immediately awarded Legend status. Barassi’s playing career spanned two decades - the 1950s and 1960s - at Melbourne and Carlton. His transfer from the Demons to the Blues in ahead of the 1965 season was one of the most notable player moves in football history. He coached the Demons, Carlton, North Melbourne and Sydney Swans in 515 matches. His move to coach the Swans in 1993 came in a low period for the club a decade after they moved north to Sydney from South Melbourne. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article Vale Melbourne Demons Carlton Blues AFL 2023 North Melbourne Kangaroos Sydney Swans Collingwood Magpies Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Scott Spits is a sports reporter for The Age Connect via Twitter or email . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-16 23:18:38","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f63038bb7bb4b3295abb9bd75f1b3ba3","title":"Mtshingwe dominate Old Mutual Academy Cricket tournaments","link":"https://www.sundaynews.co.zw/mtshingwe-dominate-old-mutual-academy-cricket-tournaments/","keywords":["Sports"],"creator":["vusumuzi"],"video_url":null,"description":"Brandon Moyo, Sports Reporter EMAKHANDENI based Mtshingwe Primary School were the biggest winners of the two grassroots cricket tournaments that came to an end at the Old Mutual Academy of Cricket Excellence (former Heath Streak Academy) yesterday. The Tyson Meki-coached Mtshingwe Primary School won the Old Mutual Colts Cricket Cup and the CABS Under-13 Cricket […]","content":"The Sunday News EMAKHANDENI based Mtshingwe Primary School were the biggest winners of the two grassroots cricket tournaments that came to an end at the Old Mutual Academy of Cricket Excellence (former Heath Streak Academy) yesterday. The Tyson Meki-coached Mtshingwe Primary School won the Old Mutual Colts Cricket Cup and the CABS Under-13 Cricket Cup to make it a memorable event for the school. In the Colts Cricket Cup, Mtshingwe recorded a 38 runs win over Old Mutual Academy Colts before the Emakhandeni based side went on to record a close four runs win over Old Mutual Academy as well in the Under-13s event. The Mtshingwe Colts, batting first in the final, scored 66/1 in their innings before going on to restrict their opponents to 28/6 to claim the top honours. In the Under-13s final, the eventual champions, Mtshingwe restricted the Academy side to 39/2 while they had finished on 43/4 earlier on to help complete the double for their school. In the Under-13s semi-final, the dominant Mtshingwe thumped Khumalo Primary School by 55 runs. Mtshingwe scored 67/1 in their innings before they went on to restrict their opponents to just 12/7. The tournament featured 16 schools and 32 teams as part of the Old Mutual Academy of Cricket Excellence Trust’s commemoration of 10 years of existence. The Trust’s president and board chairperson, Joseph Rego was impressed with the way things went throughout the duration of the tournament. CABS, who are partners, through their managing director, Mehluli Mpofu said such a tournament was crucial to the growth of cricket in the country and it’s important to them as an organisation. He added that they will continue supporting the growth of cricket in the country and other sports. “It’s been a decade of supporting cricket. In this case, we are supporting the young, so it’s very developmental which obviously supports the growth of cricket in the country and particularly when you deal with disadvantaged people and give them an opportunity to actually grow in the sport. “It becomes very important to us as a business because ultimately what we always say to ourselves is we ought to be supportive of the community that we operate in and that is one way of doing so. “It’s important that we resume and as you can see here, there is lots of support from the schools. There are 16 schools with 32 teams and it’s important we give them a lot of support, cover as best as we can. “The commitment that we are giving as CABS and Old Mutual Group is that we will continue to support cricket and we will continue to look for other opportunities to support grassroots cricket and in other sports we need to look at how we can play a part as well,” said Mpofu. The tournament was also attended by Zanu-PF Politiburo member, Elifasi Mashaba, who is also the Trust’s vice-president and one of the founding fathers of the Academy in 2013. Mashaba said the tournament was a step in the right direction in helping to grow the game of cricket. As a token of appreciation for their participation at the event, all the schools got two cricket balls. Yesterday was not just a cricket event at the Old Mutual Academy of Cricket Excellence as they also organised a “Spring Fare and Fun Day” featuring different stalls, jumping castles and water slides for children, face painting, balloon making and many other activities for children and families. – Follow on Twitter @brandon_malvin.","pubDate":"2023-09-16 22:03:30","image_url":null,"source_id":"sundaynews","source_priority":2207190,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"36cc1a12a7aa725df517daf24b844f29","title":"Chiwanza walks away on his own terms","link":"https://www.sundaymail.co.zw/chiwanza-walks-away-on-his-own-terms","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"Tinashe Kusema Deputy Sports Editor THE day will come when Kudakwashe Chiwanza decides to open up on how he fell in and out of love with rugby. Maybe, he will do it through a tell-all biography or interview. However, for now, we have to make do with a cryptic but loaded reason behind what many […]","content":"The Sunday Mail THE day will come when Kudakwashe Chiwanza decides to open up on how he fell in and out of love with rugby. Maybe, he will do it through a tell-all biography or interview. However, for now, we have to make do with a cryptic but loaded reason behind what many are calling an “unfortunate” and “untimely” retirement from the game. “A lot happened to me this year, rugby-wise, and I wasn’t enjoying it anymore,” said the former Zimbabwe Sables and Cheetahs player. “I felt I was giving my all, but it just wasn’t the same . . .” The 32-year-old former Zimbabwe international broke the news on Facebook. He indicated that the recent Zambezi Challenge was to be his last outing. “It has been such a wonderful 13 years, and none of it would have been possible without the love and support from all of you.” One of the reasons Chiwanza’s retirement appears bizarre is its announcement on the eve of the Sevens’ Africa Cup presently underway at Harare Sports Club’s Machinery Exchange Stadium. The tournament, which ends today, attracted some of the continent’s Sevens heavyweights such as South Africa’s Bliztboks and Kenya — two teams that play in the HSBC World Rugby Sevens Series. Uganda are an emerging threat, while Zambia, Madagascar, Tunisia, Burkina Faso, Namibia, Algeria, Nigeria, Cote d’Ivoire and hosts Zimbabwe all took part. With an automatic ticket to next year’s Paris Olympic Games guaranteed for today’s winner, it seems the Africa Cup would have provided the perfect stage for a final bow for Chiwanza. However, he seems to have made up his mind a long time ago. “It’s something I had been thinking about since last year, and the Zambezi Challenge Cup just felt like the right time for me to call time on my 13-year international rugby career. “I have no regrets at all,” he said. The ex-Falcon College learner found his footing pretty early in his career, as he joined Old Georgians Rugby Club soon after school in 2011. Chiwanza was named rookie of the year in his debut season. Call-ups to the Sables and Cheetahs, his preferred format, soon followed, after which he became a semi-permanent member of the latter. The 2014 and 2015 seasons are arguably his greatest years, as he was amongst the top try-scorers for both. He also won the title with Old Georgians. Prior to this, he tried out sports that include football, basketball and hockey. “Rugby wasn’t my first choice in sports. Most people would be surprised to know that cricket was my first love,” he was once quoted saying. “I made the Manicaland provisional side and even had a short stint with Strugglers Cricket Club.” He only started playing rugby when he enrolled at Mvurachena Primary School in Chipinge, Manicaland, where he was forced to partake every sport, as the institution did not have that many learners. “It was at Mvurachena, when I was in Grade Six, that I started playing for Eastern District Rugby,” he said. His numerous accolades on the rugby front include making the Matabeleland Under-18 team for three straight years and then the Zimbabwe Under-20 Junior World Trophy in 2011. Chiwanza played for Old Georgians (2011-2023), had a couple of stints in varsity rugby and made the Sharks Academy tour team. He would get his Sables and Cheetahs debuts in 2011. He was also part of the World Cup Sevens team and Africa Cup teams in 2018. With the Sables, he won the Victoria Cup in 2011 and 2019, and participated in the SuperSport Rugby Challenge in 2019. Chiwanza believes his debut for the Sables was a special moment in his career, as his mother, Judith, was present to watch him play. Sadly, she later passed away following a bout of pneumonia. Other notable rugby moments, Chiwanza said, included “playing Spain in Hong Kong in 2016 and Africa Cup 2018”. “I also had the pleasure of meeting the likes of Jonah Lomu, Sonny Bill Williams (New Zealand), Bryan Habana (South Africa), Brian O’Driscoll (Ireland) and Dan Norton (Great Britain), who are some top Sevens players. “Monaco and Hong Kong were among my favourite venues and tournaments,” he said. As he rides off into the sunset, Chiwanza even had some wise words for his former teammates, friends and, most importantly, fans. “Never give up on your dreams, but just keep working hard and your time will come. “Everyone should aim for the highest cloud so that if you miss it, you will hit a lofty mountain.” ■","pubDate":"2023-09-16 22:02:35","image_url":null,"source_id":"sundaymail","source_priority":1245383,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"5fc31bc2570b9705e19b6f9a6d83db0c","title":"Could Hamid be the next Raza?","link":"https://www.sundaymail.co.zw/could-hamid-be-the-next-raza","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"Sports Reporter ALI-AKBAR KHAN HAMID is one of those cricketers who are hard to put in a box. A clean hitter of the ball, the Takashinga Patriots II batter is every coach’s dream. He is comfortable batting anywhere between the top and middle order. In fact, by his own admission, Hamid is comfortable batting in […]","content":"The Sunday Mail ALI-AKBAR KHAN HAMID is one of those cricketers who are hard to put in a box. A clean hitter of the ball, the Takashinga Patriots II batter is every coach’s dream. He is comfortable batting anywhere between the top and middle order. In fact, by his own admission, Hamid is comfortable batting in the top order in limited-overs cricket. But he prefers the middle order in the longer version of the game. Together with Spencer Magodo and Tinashe Chiorah, the 23-year-old is one of three figures currently making waves in local cricket. Some have even predicted the trio could form the core of the Chevrons team once Sikandar Raza, skipper Craig Ervine and Sean Williams — who are all approaching the twilight of their international careers — leave the stage. However, what sets Hamid apart from his peers is the constant comparisons to talisman Raza. While he does idolise the Zimbabwe all-rounder, he chooses to ignore the hype. “Sikandar (Raza) is like an elder brother to me, but I would like to build my own name and achieve my own goals. “He (Raza) is definitely an inspiration to me, though,” he said. Sikandar and Hamid are both of Pakistani descent. However, unlike Raza, Ali-Akbar comes from a strong cricket family. His father, Abid, is a former manager of Zimbabwe A and liaison officer for visiting Asian teams. “I started cricket at a very young age, as I was brought up in a household where my father, Abid Hamid, was involved with Zimbabwe cricket and Old Hararians Club, and my brother, Saad Khan, is a cricketer,” he said. “My father had a couple of roles in Zimbabwe cricket, with some of the notable ones being manager for Zimbabwe A side and liaison officer for a number of overseas teams that came to Zimbabwe. “Most of these teams were from Asia. “I would like to say my inspiration for the game was my brother (Saad Khan). Seeing him dominate the local game, scoring hundreds every other weekend, gave me inspiration to play and dream of representing Zimbabwe one day.” That was years ago. The Takashinga Patriots II player is now in his third year in the National Premier League, the country’s top club competition. The 2023 edition could very well end up being his breakthrough season. He is presently part of the leading pack of top batters with 355 runs from eight innings. His rates average and strike rates stand at 71.0 and 78.0, respectively. “This NPL, so far, has been a good journey as we approach the halfway mark. “It has been good so far. All praise to Allah for giving me this opportunity to score some runs in the National Premier League. “I have enjoyed my time with Takashinga,” he said. Hamid dreams of one day playing for the Chevrons. He has vowed to put in the work and often seeks advice from the likes of Raza, Faraz Akram and Elton Chigumbura. “As an upcoming cricketer, I look forward to just keep getting better every day; controlling what I can by working hard on my game. “Chigumbura is one of my mentors, who always pushes me to get better, while Akram helps me out with the mental aspect of the game. “They always give me advice, like elder brothers, and are usually a call away when I need help. “Like I said, Raza has been an inspiration to me. “The way he has worked hard for all his achievements, talking to him is a privilege that I have, and I try to listen to him carefully.”","pubDate":"2023-09-16 22:02:27","image_url":null,"source_id":"sundaymail","source_priority":1245383,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"448df85c68c4e455294bec79bd2540b6","title":"Cricketer’s World Cup availability in doubt","link":"https://www.sundaymail.co.zw/cricketers-world-cup-availability-in-doubt","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"Australia opener Travis Head has a confirmed fracture in his left hand that puts his availability for the early part of the World Cup in jeopardy after he was struck by a Gerald Coetzee short delivery in the fourth One-Day International against South Africa at SuperSport Park on Friday. Head was on nine, facing his […]","content":"The Sunday Mail Australia opener Travis Head has a confirmed fracture in his left hand that puts his availability for the early part of the World Cup in jeopardy after he was struck by a Gerald Coetzee short delivery in the fourth One-Day International against South Africa at SuperSport Park on Friday. Head was on nine, facing his eighth delivery, when he was struck on the left glove attempting a pull off Coetzee. He received treatment onfield from the Australian medical staff before continuing to bat, but only faced three more deliveries before retiring hurt in clear discomfort. He was sent to hospital for an x-ray and Australia coach Andrew McDonald confirmed after the match that it had shown a fracture. He will have further scans with more information on the severity of his injury and a timeline for his recovery to be determined. Head did return to the ground at the end of the match, but had his left hand in a splint. “At this stage, it’s a confirmed fracture. “How long that timeframe is, we are yet to determine that. “Fingers crossed with the World Cup fast approaching,” McDonald said post-match. Australia’s chase of 417 suffered early dents when they were reduced to 22 for two, but Head made a strong start. After he was struck, he whipped Marco Jansen over deep backward square for six but then toe-ended the next ball just short of Kagiso Rabada at mid-off, taking the injured hand off the bat while playing the stroke. He immediately removed his glove at the non-striker’s end. The next ball he faced he made room to cut but Coetzee followed him and cramped him as he tried to flay it through the offside. He immediately winced in severe pain after playing the stroke and walked straight to the dressing room, informing stand-in South Africa captain Aiden Markram and the umpires that he could not continue as he walked off. Australia were 53 for two in the ninth over at the time and ended up being bowled out for 252 with Head not returning to bat when the ninth wicket fell. The injury will increase speculation that Marnus Labuschagne, who was not part of Australia’s initial World Cup squad, could force his way into the final playing group. Labuschagne came on as a concussion substitute in the first ODI and scored an unbeaten 80 in a match-winning cause, and followed that up with 124 in the second game. Head’s injury adds to Australia’s long list of concerns heading to the World Cup. Pat Cummins (wrist fracture), Steven Smith (wrist tendon), Mitchell Starc (groin), Glenn Maxwell (leg) are all coming off lay-offs, and hoping to be fit for the three-match ODI series against India that starts on September 22 in the lead-up to the World Cup. Ashton Agar also only played one game in South Africa, coming off a calf strain, before heading home to Perth for the birth of his first child. He was supposed to play at least two but he was unavailable due to soreness before flying home and he is unlikely to return to the squad until after the India ODI series. Cameron Green is coming off a concussion in the opening match of the South Africa series, but McDonald was hopeful he would be available for final game of the series today after serving his mandatory eight-day rest period. “He’s been cleared by the medical team,” McDonald said. “He is just working away getting prepared. Hopefully, he’s available for game five,” he said. — Cricinfo.","pubDate":"2023-09-16 22:02:24","image_url":null,"source_id":"sundaymail","source_priority":1245383,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"63de8a2a7c3346e7295fdeb14175609d","title":"Asia Cup final: Sri Lanka will look to defend crown against most successful team in event, India","link":"https://thenewsmill.com/2023/09/asia-cup-final-sri-lanka-will-look-to-defend-crown-against-most-successful-team-in-event-india/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Two cricketing giants from the sub-continent will lock horns on a blockbuster Sunday in the battle to crown Asia’s best. The final of the ongoing Asia Cup between the hosts Sri Lanka and India promises a thrill-a-minute ride, with both teams recording impressive wins on the road to the final. While the Lankans will go into the final as the defending champions, Team India, led by in-form Rohit Sharma, will be desperate to lift the trophy that they haven’t won since 2018. Having secured qualification for the showpiece event, overcoming myriad challenges and close contests in the ICC World Cup Qualifiers, the Lankans would be keen not to cede the mantle of Asia’s best to their sub-continental neighbours. A win in the all-important final on Sunday will certainly make them a dark horse in the World Cup, where the matches will be played on familiar sub-continental surfaces. Sri Lanka came close to handing India their first defeat of the Asia Cup 2023 in the Super Four stage but the visitors’ bowling attack came to the party to eke out a hard-fought win. On a surface known to offer plenty of purchase for the spinners, the Lankan Lions will miss their bowling trump card — mystery spinner Maheesh Theekshana. The tweaker, who has been among the wickets in the tournament, was ruled out of the final after sustaining an injury in his right hamstring during their nerve-jangling Super Four clash against Pakistan. In a tournament where Pakistan’s pace trio of Haris Rauf, Shaheen Shah Afridi and Nasim Shah has dominated the wicket-takers list, Theekshana made his mark by claiming 9 wickets in 5 matches at an economy of 5.15. Barring a narrow defeat in an inconsequential Super Four clash against Bangladesh on Friday, India have been on song in the tournament. However, the visitors suffered a setback going into the final, with all-rounder Axar Patel ruled out because of a left quadriceps strain that he sustained during the Super Four clash with Bangladesh on Friday. In his place, Washington Sundar was called in ahead of the final and will have an opportunity to put himself in contention for the World Cup squad, should he make the playing eleven on Sunday. All-rounder Shardul, while going cold with the willow so far in the tournament, has been in good wicket-taking form as he ended up with figures of 3-65 against Bangladesh. Shakib Al Hasan, Anamul Haque and Tanzid Hasan were his victims on the evening. But India could be tempted to play Sundar in place of Shardul in the final, as offers a similar set of skills with the bat while adding more variety with his left-handed batting style in a line-up that majorly comprises right-handers. Ahead of the clash of the Asian giants, Sri Lanka skipper Dasun Shanaka declared that his team was ready for the final. “Of course, we are ready [for the Asia Cup 2023 final]. See, it totally depends on the pitch. The pitches have been playing a part in this tournament. According to the pitch stats, we are picking a good side, especially bowling against India, we need to take more wickets upfront. That opens the game for us. That’s a key area in the game,” Shanaka said in a pree-match press conference on Saturday. Shubman Gill, who struck a century albeit in a losing cause against Bangladesh, stressed the importance of lifting the Asia Cup trophy ahead of the World Cup. “Winning the [Asia Cup] final is very important for us because we need to create a winning habit. Peaking at the right time and gaining momentum at the right time is important,” Gill said. (ANI)","pubDate":"2023-09-16 21:30:14","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c2642d630393e762a10435f8c9998b50","title":"Tamim Iqbal, Soumya Sarkar recalled for Bangladesh’s first two ODIs against New Zealand","link":"https://thenewsmill.com/2023/09/tamim-iqbal-soumya-sarkar-recalled-for-bangladeshs-first-two-odis-against-new-zealand/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Bangladesh recalled Tamim Iqbal, Mahmudullah Riyad, Soumya Sarkar, and Quazi Nurul Hasan Sohan for the first two of the three upcoming ODIs against New Zealand in Dhaka next week. “The Bangladesh Cricket Board (BCB) has announced the squad for the first and second ODIs of this month’s three-match series against New Zealand in Dhaka,” BCB said in a statement. Wary of managing the workloads of several key players ahead of the ICC ODI World Cup, which will get underway in India next month, Bangladesh have decided them in the first two ODIs against New Zealand. Swashbuckling keeper-batsman Litton Das will lead the side in the absence of regular captain Shakib Al Hasan, who has been rested. Among the other key players rested are Mushfiqur Rahim, all-rounder Mehidy Hasan Miraz and the pace battery of Taskin Ahmed, Hasan Mahmud and Shoriful Islam. Despite several key names missing, Bangladesh will not go into the series short on experience as the likes of Tamim Iqbal, Mahmudullah, Soumya Sarkar and Nurul Hasan Sohan will mark their return to the limited-overs setup. The Tigers have called up three uncapped players — southpaw Zakir Hasan, pacer Khaled Ahmed and leg-spinner Rishad Hossain. They could all be in line for debuts during the ODI series. Naim Sheikh, Afif Hossain and Shamim Hossain were players from the Asia Cup squad to have missed out. “The decision to rest players was taken in consideration of the World Cup in India which will be a long tournament where ensuring the mental and physical fitness of the cricketers will be very important. The series against New Zealand provides us an opportunity to take a look at some other players as well ahead of this major event,” the chairman of Bangladesh’s National Selection Panel, Minhajul Abedin, said in a statement. “The squad is a blend of experience and youth and only Zakir, Khaled and Rishad have not featured in ODIs yet. Zakir was very close to playing against Ireland in March before he suffered an unfortunate injury. Khaled has done well in his list A career and Rishad offers a different dimension to our bowling attack,” he added. Squad (for the first two ODIs): Litton Das (captain), Tamim Iqbal, Soumya Sarkar, Anamul Haque, Tawhid Hridoy, Mahmud Ullah, Nurul Hasan Sohan, Mahedi Hasan, Nasum Ahmed, Mustafizur Rahman, Tanzim Hasan, Tanzid Hasan, Zakir Hasan, Rishad Hossain and Khaled Ahmed. (ANI)","pubDate":"2023-09-16 20:30:11","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"}]}