{"newsArray":[{"title":"Jockey's tribute as Warne's horse secures win","link":"https://wwos.nine.com.au/horse-racing/jockeys-tribute-as-shane-warne-owned-horse-claims-maiden-win/fb552a41-8bc1-4e94-b6b9-f593a914477f","keywords":null,"creator":["wwos"],"video_url":null,"description":"As Shane Warne's horse, Sacred Oath, crossed the finish line, jockey Noel Callow paid tribute to the late cricket icon.","content":"A jockey has paid tribute to Shane Warne after riding the late cricket icon's part-owned horse, Sacred Oath, to its maiden win.Sacred Oath broke through in dominant fashion on the Gold Coast, winning the 1200m race in its third start, and its first since a fall in Ipswich last month.As the horse crossed the finish line, jockey Noel Callow paid tribute to Warne, rolling his right arm over in a leg-spinning motion to celebrate the historic triumph.READ MORE: Keeper's brain-fade costs Man City FA Cup spotREAD MORE: Ronaldo silences United fans minutes after brutal chantREAD MORE: Cronulla rocked by 'significant' injuries in lossThe heartfelt tribute to Warne, who was farewelled in a state funeral last month after his tragic death in Thailand, was not lost on fans, including ex-AFL star Campbell Brown.\"Very sentimental win that,\" Brown tweeted.\"Well done David (trainer David Vandyke) to get the horse back in such good order after last starts incident.\"Great ride king and lovely delivery. Hope [you] enjoyed that SK.\"\"Sacred Oath, part-owned by the late Shane Warne, wins on the Gold Coast,\" racing reporter, Tim Yeatman, tweeted.\"Hope the king enjoyed that one upstairs\".For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-04-16 23:29:10","full_description":"A jockey has paid tribute to Shane Warne after riding the late cricket icon's part-owned horse, Sacred Oath, to its maiden win. Sacred Oath broke through in dominant fashion on the Gold Coast, winning the 1200m race in its third start, and its first since a fall in Ipswich last month . As the horse crossed the finish line, jockey Noel Callow paid tribute to Warne, rolling his right arm over in a leg-spinning motion to celebrate the historic triumph. READ MORE: Keeper's brain-fade costs Man City FA Cup spot READ MORE: Ronaldo silences United fans minutes after brutal chant READ MORE: Cronulla rocked by 'significant' injuries in loss The heartfelt tribute to Warne, who was farewelled in a state funeral last month after his tragic death in Thailand , was not lost on fans, including ex-AFL star Campbell Brown. \"Very sentimental win that,\" Brown tweeted. \"Well done David (trainer David Vandyke) to get the horse back in such good order after last starts incident. \"Great ride king and lovely delivery. Hope [you] enjoyed that SK.\" \"Sacred Oath, part-owned by the late Shane Warne, wins on the Gold Coast,\" racing reporter, Tim Yeatman, tweeted. \"Hope the king enjoyed that one upstairs\". For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/04/423788/raw-capture-sequence.00_04_10_11.still161.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket Australia’s desperate plan to rescue Big Bash","link":"https://www.cairnspost.com.au/sport/cricket/cricket-australias-bold-plan-to-rescue-big-bash-league-before-next-tv-rights-deal/news-story/36e147f429b3eb503b3ea7082ae87c78","keywords":["Big Bash News","Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Cricket Australia is set to permanently jettison white-ball internationals out of January in a desperate attempt to save the dying Big Bash League.","content":null,"pubDate":"2022-04-16 20:00:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, DC vs RCB Report: Dinesh Karthik, Glenn Maxwell Blitz Power Royal Challengers Bangalore To.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMitAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pbmRpYW4tcHJlbWllci1sZWFndWUtZGMtdnMtcmNiLXJlcG9ydC1kaW5lc2gta2FydGhpay1nbGVubi1tYXh3ZWxsLWJsaXR6LXBvd2VyLXJveWFsLWNoYWxsZW5nZXJzLWJhbmdhbG9yZS10by0xNi1ydW4td2luLXZzLWRlbGhpLWNhcGl0YWxzLTI4OTQzNDDSAboBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvaW5kaWFuLXByZW1pZXItbGVhZ3VlLWRjLXZzLXJjYi1yZXBvcnQtZGluZXNoLWthcnRoaWstZ2xlbm4tbWF4d2VsbC1ibGl0ei1wb3dlci1yb3lhbC1jaGFsbGVuZ2Vycy1iYW5nYWxvcmUtdG8tMTYtcnVuLXdpbi12cy1kZWxoaS1jYXBpdGFscy0yODk0MzQwL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, DC vs RCB Report: Dinesh Karthik, Glenn Maxwell Blitz Power Royal Challengers Bangalore To..  NDTV SportsLive match blog - RCB vs Capitals 27th Match 2022 - Cricket Insights  ESPNcricinfoLive Cricket Score: Delhi Capitals vs Royal Challengers Bangalore, Match 27, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzDC v RCB, Preview: Game Day | IPL 2022  Royal Challengers BangaloreIPL 2022, DC vs RCB Highlights: Dinesh Karthik, Glenn Maxwell And Josh Hazlewood Star As RCB Down Delhi Capitals  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-04-16 18:30:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Royal Challengers Bangalore Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-royal-challengers-bangalore-live-score-over-match-27-t20-16-20-updates-2894217","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Royal Challengers Bangalore from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 17:43:44","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 18.5 overs, Delhi Capitals, chasing a target of 190, are 163/7. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Delhi Capitals and Royal Challengers Bangalore. Everything related to Delhi Capitals and Royal Challengers Bangalore match will be available on Sports.NDTV.com . Stay updated with Delhi Capitals vs Royal Challengers Bangalore live score. Do check for Delhi Capitals vs Royal Challengers Bangalore scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 18.4 overs (4 Runs) Four! 18.3 overs (1 Run) A direct hit at the bowler's end and that could have been curtains for Kuldeep Yadav. A length ball, around off. Kuldeep taps it to cover and looks for a quick run. Wanindu Hasaranga collects the ball at covers and has a shy at the bowler's end but he misses. 18.2 overs (0 Run) A slower ball, on a length, outside off. Kuldeep Yadav swings hard but fails to make any connection. Who will bat next? It's Kuldeep Yadav. 18.1 overs (0 Run) OUT! TAKEN! Josh Hazlewood bags his third wicket and it is the dangerous Shardul Thakur who takes the long walk back to the pavilion. Josh runs in and hits the deck hard, around off, cramping Thakur for room. Shardul looks to pull hard but he gets a top edge which goes high in the night sky towards the point region. Dinesh Karthik calls it from behind the sticks, runs forward, settles nicely under it and takes a good catch. Josh Hazlewood to bowl the 19th over. 17.6 overs (1 Run) A slower ball, on a length, outside off. Shardul Thakur drags it towards Virat Kohli at deep mid-wicket and manages only a run. 34 runs needed from 12 balls. 17.5 overs (6 Runs) SIX! UP AND OVER! Patel looks for a yorker but ends up serving a low full toss, around off. Shardul Thakur smashes it over the deep mid-wicket fence for a biggie. Is there a twist in the tale? 17.4 overs (0 Run) Play and a miss! A slower ball, on a length, outside off. Shardul Thakur has a wild swing at it but fails to make any connection. 17.3 overs (1 Run) A low full toss, outside off. Axar drills it to long off for one run. 17.2 overs (1 Run) Falls short of the fielder yet again! A very full ball, outside off. Shardul Thakur looks to go over long off. It goes off the toe-end of the bat, in the air towards long off. Maxwell runs in from the deep but the ball lands in front of him. A single taken. 17.2 overs (1 Run) Wide! A full ball, well outside off. Shardul Thakur lets it through to the keeper. Wided! 17.1 overs (1 Run) On a length, around middle. Axar Patel nudges it around the corner and takes a single. Change in bowling. Harshal Patel is back into the attack. 16.6 overs (2 Runs) Aerial...but safe! A short ball, outside off. Shardul Thakur looks to whack it over deep mid-wicket. He only manages a top edge which falls well in front of Glenn Maxwell who runs in from long on. Two runs are taken! 16.5 overs (0 Run) A slower ball, into the deck, around off. Shardul looks to pull but he gets early into his shot and gets hit high on his body. 16.4 overs (1 Run) A yorker, on middle. Axar Patel digs it out to the leg side and takes a run. Axar Patel is the new batter. 16.3 overs (0 Run) OUT! CAUGHT! That is a spectacular catch from Virat Kohli at extra cover and that could be it for Delhi. Siraj bowls it wider, outside off. It is a full toss, Pant reaches out and looks to go over extra cover. He gets it from the toe-end of his bat towards Kohli at extra cover. Kohli hops and takes a one-handed stunner. The crowd erupts yet again. Bangalore are well and truly on top now! 16.2 overs (6 Runs) SIX! WHACKED! Siraj serves a slower ball, into the wicket, around off. Pant stands tall and hoicks it over the deep mid-wicket fence for a biggie. 16.1 overs (2 Runs) A low full toss, outside off. Rishabh Pant drags it towards Glenn Maxwell at mid off, who dives to his right and half-stops it. The ball goes past him and the batters collect two runs. Mohammed Siraj (3-0-20-1) returns to the attack. 15.6 overs (1 Run) Short and around off. Pant rocks back and cuts it hard towards the cover fielder. The fielder there fumbles and concedes a single. Pant will retain the strike. 15.5 overs (6 Runs) SIX! Not from the middle of the bat but he gets the desired result! Flighted ball, outside off. Pant skips down the track and mistimes his big shot, just over the long off fence for a maximum. 19 from the over, 56 needed off 24 balls. 15.4 overs (4 Runs) FOUR! Innovative from Pant! That is probably the fourth time that Pant has played that shot! Floated, down leg. Pant gets low, loses his balance but still manages to help it on its way through the fine leg region for a boundary. 15.3 overs (1 Run) Flatter and quicker, on a length, on middle. Shardul Thakur looks to block but it goes off a thick inside edge, past the sticks for a run. 15.2 overs (6 Runs) SIX! BOOM! This is tossed up, on off. Thakur tonks it way over the long on fence for a maximum. 15.1 overs (1 Run) Leg bye! A length ball, darted on the pads. Pant tries to paddle it through fine leg but he misses and gets hit on his pad. The ball rolls away to the leg side for a leg bye.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857476161611323.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"GG vs SS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Spice Isle T10 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMipgFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vY3JpY2tldC1uZXdzL2dnLXZzLXNzLWRyZWFtMTEtcHJlZGljdGlvbi1mYW50YXN5LWNyaWNrZXQtdGlwcy1kcmVhbTExLXRlYW0tcGxheWluZy14aS1waXRjaC1yZXBvcnQtaW5qdXJ5LXVwZGF0ZS1kcmVhbTExLXNwaWNlLWlzbGUtdDEwLTIv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"GG vs SS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Spice Isle T10  Cricket AddictorGG vs SS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Spice Isle T10 League 2022, Eliminator 1  SportskeedaGG vs SS Dream11 Prediction: Check Team Captain, Vice-Captain And Probable XIs, Spice Isle T10 2022, April  News18GG vs SS 11Wickets Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Update for Match Eliminator 1 of Spice Isle T10 Cricket  CricTrackerCricket Betting Tips and Fantasy Match Predictions: Dream11 Spice Isle T10 2022 - Nutmeg Warriors vs Bay Leaf Blasters, Qualifier 1 - 16th April  Cricket WorldView Full coverage on Google News","content":null,"pubDate":"2022-04-16 17:22:12","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Best 5 crores RCB has ever spent”: Veda Krishnamurthy lauds Dinesh Karthik’s signing as the best 5 crores RCB ever spent in the auction","link":"https://thesportsrush.com/cricket-news-best-5-crores-rcb-has-ever-spent-veda-krishnamurthy-________/","keywords":["Cricket","IPL 2022","RCB","dinesh karthik"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Dinesh Karthik has been absolutely brilliant in the IPL 2022 and Indian Women’s cricketer Veda Krishnamurthy has a lot of praise for him. In the IPL 2022 game against Delhi Capitals, Dinesh Karthik again proved his class with the bat. Royal Challengers Bangalore were asked to bat first after winning the toss, and Dinesh Karthik… The post “Best 5 crores RCB has ever spent”: Veda Krishnamurthy lauds Dinesh Karthik’s signing as the best 5 crores RCB ever spent in the auction appeared first on The SportsRush.","content":"Dinesh Karthik has been absolutely brilliant in the IPL 2022 and Indian Women’s cricketer Veda Krishnamurthy has a lot of praise for him. In the IPL 2022 game against Delhi Capitals, Dinesh Karthik again proved his class with the bat. Royal Challengers Bangalore were asked to bat first after winning the toss, and Dinesh Karthik again showed why he is still one of the bests in the finishing business. At the end of 13 overs, Royal Challengers Bangalore were 110-5, and they were clearly struggling. But then came, Dinesh Karthik’s masterclass with the bat. Karthik smashed 28 runs in the 18th over of the game against Mustafizur Rahman. The team ended at 189-5, where Karthik scored 66 runs in just 34 balls at a strike rate of 194.12. The 6th wicket partnership of 97* runs between Dinesh Karthik and Shahbaz Ahmed is the 3rd best in the history of IPL. Apart from Dinesh Karthik, Shahbaz Ahmed scored 32 runs in 21 balls, whereas Glenn Maxwell also scored a brilliant half-century. The duo of Faf du Plessis and Virat Kohli failed again. Veda Krishnamurthy lauds Dinesh Karthik’s signing by RCB Indian women’s team’s batter Veda Krishnamurthy also commented on the same. She called Dinesh Karthik’s selection the best 5 crores RCB ever spent in the auction. RCB bought Dinesh Karthik for a price of INR 5.50 crores in the IPL 2022 mega auction. Karthik used to play for Kolkata Knight Riders before. The best 5crs @RCBTweets has ever spent !! @DineshKarthik — Veda Krishnamurthy (@vedakmurthy08) April 16, 2022 Veda Krishnamurthy is a part of the Kannada commentary team for IPL 2022. She has scored 875 T20I runs and 829 ODI runs for the Indian Women’s cricket team. She also has three ODI wickets under her belt. Dinesh Karthik has been absolutely outstanding for Royal Challengers Bangalore this season. Karthik has scored 197 IPL 2022 runs at 197.00, whereas his strike rate has been 209.57. Royal Challengers Bangalore have won their game against Rajasthan Royals and Kolkata Knight Riders due to Karthik’s finishing only. The post “Best 5 crores RCB has ever spent”: Veda Krishnamurthy lauds Dinesh Karthik’s signing as the best 5 crores RCB ever spent in the auction appeared first on The SportsRush.","pubDate":"2022-04-16 17:18:22","full_description":"Dinesh Karthik has been absolutely brilliant in the IPL 2022 and Indian Women’s cricketer Veda Krishnamurthy has a lot of praise for him. In the IPL 2022 game against Delhi Capitals, Dinesh Karthik again proved his class with the bat. Royal Challengers Bangalore were asked to bat first after winning the toss, and Dinesh Karthik again showed why he is still one of the bests in the finishing business. At the end of 13 overs, Royal Challengers Bangalore were 110-5, and they were clearly struggling. But then came, Dinesh Karthik’s masterclass with the bat. Karthik smashed 28 runs in the 18th over of the game against Mustafizur Rahman. The team ended at 189-5, where Karthik scored 66 runs in just 34 balls at a strike rate of 194.12. The 6th wicket partnership of 97* runs between Dinesh Karthik and Shahbaz Ahmed is the 3rd best in the history of IPL. Apart from Dinesh Karthik, Shahbaz Ahmed scored 32 runs in 21 balls, whereas Glenn Maxwell also scored a brilliant half-century. The duo of Faf du Plessis and Virat Kohli failed again. Indian women’s team’s batter Veda Krishnamurthy also commented on the same. She called Dinesh Karthik’s selection the best 5 crores RCB ever spent in the auction. RCB bought Dinesh Karthik for a price of INR 5.50 crores in the IPL 2022 mega auction. Karthik used to play for Kolkata Knight Riders before. The best 5crs @RCBTweets has ever spent !! @DineshKarthik 🔥🔥 — Veda Krishnamurthy (@vedakmurthy08) April 16, 2022 Veda Krishnamurthy is a part of the Kannada commentary team for IPL 2022 . She has scored 875 T20I runs and 829 ODI runs for the Indian Women’s cricket team. She also has three ODI wickets under her belt. Dinesh Karthik has been absolutely outstanding for Royal Challengers Bangalore this season. Karthik has scored 197 IPL 2022 runs at 197.00, whereas his strike rate has been 209.57. Royal Challengers Bangalore have won their game against Rajasthan Royals and Kolkata Knight Riders due to Karthik’s finishing only.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Dinesh Karthik deserves to play for India again: Fans demand comeback for DK after blistering IPL 2022 fifty vs DC","link":"https://zeenews.india.com/cricket/dinesh-karthik-deserves-to-play-for-india-again-fans-demand-comeback-for-dk-after-blistering-ipl-2022-fifty-vs-dc-2454514.html","keywords":null,"creator":null,"video_url":null,"description":"RCB batter Dinesh Karthik slammed a quickfire fifty vs Delhi Capitals on Saturday (April 16) and his knock escalated the demand of his comeback to the Indian cricket team's T20 side.","content":null,"pubDate":"2022-04-16 17:16:00","full_description":"RCB batter Dinesh Karthik slammed a quickfire fifty vs Delhi Capitals on Saturday (April 16) and his knock escalated the demand of his comeback to the Indian cricket team's T20 side. Not to forget, since the ICC ODI World Cup 2019, Dinesh has failed to make the cut to the national side. But he has consistently done well for Tamil Nadu in the domestic season. When he was with KKR as captain, he experienced mental pressure and eventually stepped down as captain. However, DK playing for RCB this season has looked a different beast altogether. Karthik himself mentioned a few days back that he feels he is not done yet in cricket. \"I made a conscious effort to do justice to myself. Felt I could have done better in the last few years. The way I’ve trained has been different. I was telling myself I’m not done yet. I have a goal and I want to achieve something,\" said the 36-year-old. As soon as he hit the fifty vs DC, Twitter started demanding his comeback to the Indian team again. That knock was brilliant, it included five fours and five sixes. In the end, he finished with 66 off 34 balls. Here's how Twitter reacted: If DK isn't picked for the international team even now... — Flighted Leggie _ (@flighted_leggie) April 16, 2022 4,4,4,6,6,4 by Dinesh Karthik and completed fifty from just 26 balls - What a knock, DK. — Johns. (@CricCrazyJohns) April 16, 2022 From 2018 to 2019, Dinesh Karthik played 13 innings for India from No.6 or lower in T20Is. His returns? 56.5 Avg/161.4 SR No one in the world in those two years had a better strike-rate while scoring as many runs as he did. He never played T20Is again. #DCvRCB — Rohit Sankar (@imRohit_SN) April 16, 2022 Hi experts how is my worldcup Eleven,pls give your opinion 1.Rohit sharma 2.Ishan kishan 3.KL Rahul 4.Virat kohli 5.Hrithik Pandiya 6.Rishabh pant 7.Dinesh karthik 8.Ravindra Jadeja 9.Ravi Ashwin 10.mohd Sami 11.Jasprit bumrah #staraikelungal — Thirunavukarasu. Somu (@kidari93mat60) April 16, 2022 Never say never. #dineshkarthik https://t.co/RvgX6F4abA — Arjun Gupta (@arjungupta1991) April 16, 2022 A T20 Special with all the requisites. It's when FIZZ goes FLAT in a spit. DK take a bow. @DineshKarthik @RCBTweets #RCB pic.twitter.com/pHmrI82jvW — Ravi Shastri (@RaviShastriOfc) April 16, 2022","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Royal Challengers Bangalore Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-royal-challengers-bangalore-live-score-over-match-27-t20-11-15-updates-2894131","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Royal Challengers Bangalore from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 17:15:34","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.0 overs, Delhi Capitals, chasing a target of 190, are 115/5. The live updates of Delhi Capitals vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Delhi Capitals vs Royal Challengers Bangalore, Delhi Capitals vs Royal Challengers Bangalore live score, Delhi Capitals vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (0 Run) OUT! c Suyash Prabhudessai b Josh Hazlewood. 14.6 overs (1 Run) Wide! Slips a length ball down the leg side, Yadav tries to flick but misses. 14.5 overs (1 Run) Short and outside off, at 117.5 kph, Pant punches it to deep cover for only a run. 14.4 overs (1 Run) Short and on off at 136 kph, Yadav pulls it to deep mid-wicket for a run. 14.3 overs (0 Run) Josh Hazlewood goes short and around off, at 136 kph, Lalit Yadav steps back to cut but misses. 14.2 overs (0 Run) Play and a miss! Identical to the last delivery, but the pace is up by 10 kph, Lalit also pushes inside the line but he misses. Lalit Yadav walks out to bat. 14.1 overs (0 Run) OUT! CAUGHT BEHIND! The chase is falling flat on its face for Delhi. Josh Hazlewood hurls across a cross-seam delivery, on a length outside off at 125.3 kph. Rovman Powell gets forward to push inside the line but only manages to edge it to the keeper. Dinesh Karthik makes no mistake and Delhi lose yet another power-hitter cheaply. Strategic break! Well, the wicket of Mitchell Marsh could prove to be a blessing in disguise for Delhi as he was eating up a lot of deliveries and the asking rate was creeping up. The skipper, Rishabh Pant will be keen to take the game deep and take his side over the line. They still have some power-hitters to come and the equation of 78 runs off 36 balls might be in Delhi's reach if they bat smartly going ahead. Josh Hazlewood comes into the attack. 13.6 overs (0 Run) OUT! RUN OUT! That's an unfortunate way to get out but it ends the misery for Mitchell Marsh. This wicket could be a blessing in disguise for Delhi as the Aussie was struggling big time. Fuller and around middle, Pant drills his drive straight back and Wanindu Hasaranga gets some touch on the ball as it goes on to collide with the stumps at the bowler's end. Mitchell Marsh has ventured out as he was backing up and will have to go. Bangalore are on top at the moment, 78 needed off 36 balls. 13.5 overs (4 Runs) FOUR! Once again well played by Rishabh Pant. Floated one, landing full around leg, Pant gets down and paddles it behind short fine leg for a boundary. 13.4 overs (1 Run) Flighted and full, around off, Marsh slogs it to deep mid-wicket, without much timing, for a single. 13.3 overs (1 Run) Sliding down the leg side, Pant sweeps it towards short fine leg for one. 13.2 overs (2 Runs) Floated and full, around leg, Pant sweeps it firmly to deep mid-wicket and Josh Hazlewood makes a sliding stop near the fence. Two runs taken. 13.1 overs (4 Runs) FOUR! Clever shot! Tossed up around leg, landing full, Rishabh Pant goes down and scoops it behind, wide of short fine leg, for a boundary. 12.6 overs (0 Run) Another swing and a miss and Marsh continues to struggle. Short and outside off, Marsh tries to pull but it bounces over his blade. 90 needed off 42 balls. 12.5 overs (0 Run) Swing and a miss! Short and outside off, Marsh tries to pull but misses. 12.4 overs (1 Run) PUT DOWN! Could be a costly miss. Short in length and wide outside off, Pant throws his bat at it and mistimes his shot aerially over point. Wanindu Hasaranga comes rushing forward from the deep, catches the ball as well but then fails to hang on as he goes down. Maybe, he got there too soon and didn't realize it. A single taken. 100 up! 12.3 overs (1 Run) Very full and around off, Marsh forces it down to wide long on and calls for two. Gets only a run. 12.2 overs (2 Runs) Back of a length, around off, Marsh rocks back and pulls it to deep square leg for a couple. 12.1 overs (1 Run) Fuller in length and outside off, Pant drives it towards extra cover for a single. Mohammed Siraj (2-0-15-1) is back on. 11.6 overs (0 Run) Short and wide outside off, Marsh cuts but finds the point fielder. What an over, 2 runs and a big wicket of Warner in it. 11.5 overs (1 Run) Flatter and shorter around leg, Pant moves back and cuts it through point for a single. 11.4 overs (0 Run) Tossed up on middle, Pant goes down to sweep but mistimes it on the leg side. Rishabh Pant walks out to bat. 11.3 overs (0 Run) OUT! LBW! Wanindu Hasaranga has done it. Tossed up, landing full around middle, Warner attempts for the 'switch hit' but fails to connect cleanly. It thuds him on the back leg, they appeal but the finger stays down. Karthik is convinced, Faf du Plessis agrees and they take the DRS. The UltraEdge detects no wood and the Ball Tracking shows three reds. The crowd roars. It's a massive breakthrough for Bangalore. 96 needed off 51 balls and now Delhi will have a new batter alongside a rusty Mitchell Marsh. Review! Bangalore have opted for a review for LBW. Warner tried to play a switch hit and he might be in trouble. The Ball Tracking rolls in and it shows that the ball would have crashed into the off pole. 11.2 overs (1 Run) Flighted and full around off, Marsh drags his slog-sweep to deep mid-wicket for a run. 11.1 overs (0 Run) Flatter and shorter on off, Marsh gets back to pull but mistimes it back to the bowler. Wanindu Hasaranga comes back into the attack. 8 runs came off his first over. 10.6 overs (4 Runs) FOUR! Calmly done! Short in length and outside off, Warner sits quietly on the back foot and decides to loft it over backward point for a boundary. No power, all timing. 14 from the over, 97 needed off 54 balls. 10.5 overs (1 Run) Marsh continues with his rusty batting show! Short in length and outside off, slower in pace, Marsh inside-edges his attempted pull shot towards short fine leg. They cross. 10.4 overs (1 Run) Yorker around leg, Warner digs it out down towards long on for a brisk single. 10.3 overs (6 Runs) SIX! That's a mighty blow! Slower one from Patel, full and on middle, Warner clears his front leg, picks it up and dumps it over mid-wicket for a biggie. 10.2 overs (1 Run) Fuller and on off, Marsh forces it down to long on for a single. 10.1 overs (1 Run) Patel comes from 'round the wicket and delivers it from wide of the crease. It's short and on off, Warner moves back and guides it wide of backward point for a run.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857459261435114.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Stopgap captain could be perfect for England after Joe Root’s overdue exit | Vic Marks","link":"https://www.theguardian.com/sport/blog/2022/apr/16/stopgap-captain-could-be-perfect-for-england-after-joe-roots-overdue-exit","keywords":["England cricket team","Joe Root","ECB","Cricket","Sport"],"creator":["Vic Marks"],"video_url":null,"description":"The ECB shouldn’t be afraid of appointing a short-term skipper who can steer the side through a challenging summerOn Friday Joe Root resigned as England captain and this was one of the better recent days for the England and Wales Cricket Board. It was, at least, one clarification amid a fog of uncertainty. There is no chairman at the ECB, no cricket director (though the expectation is that Rob Key will be appointed after the Easter bank holiday), no coach and now no Test captain. Not much room for complacency here. England have not been so rudderless since 1988, the summer of four Test captains.The assumption is that Root jumped rather than being pushed since there is no one around at the ECB to push him. Key, as a Sky pundit, has been critical of his captaincy but I doubt that was decisive. Root has had time since the Caribbean tour to think and sit down with his nearest and dearest, and he has reached a logical conclusion. Continue reading...","content":null,"pubDate":"2022-04-16 17:00:05","full_description":"O n Friday Joe Root resigned as England captain and this was one of the better recent days for the England and Wales Cricket Board. It was, at least, one clarification amid a fog of uncertainty. There is no chairman at the ECB, no cricket director (though the expectation is that Rob Key will be appointed after the Easter bank holiday), no coach and now no Test captain. Not much room for complacency here. England have not been so rudderless since 1988, the summer of four Test captains. The assumption is that Root jumped rather than being pushed since there is no one around at the ECB to push him. Key, as a Sky pundit, has been critical of his captaincy but I doubt that was decisive. Root has had time since the Caribbean tour to think and sit down with his nearest and dearest, and he has reached a logical conclusion. I’m happy to join the chorus about Root: that despite limitations he has been a captain utterly devoted to the job, to the game and to his players, and that he should be applauded for his time in charge. England have had many worse captains. But there is no divine right to remain in charge. It was time for a change; in fact change was overdue but, after the Ashes, the paucity of options dictated that Root should continue in the Caribbean. Now for his own sake and that of the team it is time to try someone else. He should depart with his head held high. To general relief but no surprise he has reaffirmed his dedication to playing Test cricket. Now, when the gulf between England’s best player (Root) and the rest has never been greater, they desperately need his runs. His departure spares Key, if he is to be the new director, a tricky conversation. Key’s probable appointment has raised a few eyebrows. One oddity is that the list of those who have declared they are not interested in the job seems much longer that those fancying the position, which does not reflect well on the ECB. To be employed by England is no longer regarded as a plum posting; it is far more desirable to get an IPL gig for eight weeks or even a jolly month in charge of one of the Hundred teams. The same might apply to the position of head coach, to which Key has presumably already given much thought. If Key is appointed in the week ahead he may be the beneficiary of the paucity of candidates but he has obvious attributes. He is an independent, coherent thinker, unafraid to challenge some of the accepted orthodoxies. Moreover he is prepared to pop his head above the parapet. The pattern in England is that the heavyweights (I’m the rule-proving exception here) head to the commentary box for a much cosier life, pontificating without responsibility. For example, the media commitments of Mike Atherton, Nasser Hussain and Michael Vaughan, all well-qualified to plot the path ahead, debar them from having significant positions within English cricket. It is easier to pin down the candidates to be the next England captain than the next coach. England’s best coaches – Duncan Fletcher, Andy Flower and Trevor Bayliss – have come from overseas but increasingly the big names are drawn to India. Key might have to be at his most persuasive to net one of them. However it is almost unprecedented for anyone to turn down the England captaincy. When contemplating his choice Key must surely avoid looking too far ahead. It is lovely to announce “a five-year plan”, which is often just a cunning ruse to explain away the latest debacle and as meaningless as a “red-ball reset”, but the goal must be to get through the 2022 season without too many calamities rather than planning for 2024. In consultation with the new coach the ECB may have to go for a stopgap captain to take charge for the first four Tests of the summer (three against New Zealand, one against India) before reassessing. Sometimes the stopgap can surprise, the best example being Ray Illingworth in 1969. He was drafted in as the perfect dispensable stopgap after Colin Cowdrey’s achilles tendon had snapped: he was 37 and had been no more than a sporadic England player; he could hold the fort until Cowdrey’s return. Illingworth ended up doing the job for four years and winning the Ashes in Australia. An enforced change can pay dividends. In 2022 it is highly unlikely that England will pluck someone from the county circuit. The new captain will surely be familiar with the international setup. There are three serious candidates, all with shortcomings. The frontrunner is Ben Stokes. Does he want the job? I doubt he could turn it down. But should we consider the experiences of the charismatic cricketers of the past when appointed captain, such as Ian Botham, Andrew Flintoff and Kevin Pietersen? Yes, we should, which enhances the idea of a short- term appointment. The England captaincy does not have to be a four-year presidential term. Stuart Broad was the captain of two unsuccessful T20 World Cup campaigns in 2012 and 2014 but that should not be held against him. At 35 he might struggle to be ever-present, which should not debar him either. The third option, Jos Buttler, was also absent in the Caribbean. He was legitimately dropped after the Ashes but he has a sharp brain, the experience of 57 Tests, the respect of Root and Stokes, and a Test batting average higher than that of Rory Burns. So the pundits can speculate gleefully while Key becomes increasingly aware that there are no perfect solutions.","image_url":"https://i.guim.co.uk/img/media/fdb8be425c48034616be73dbe8d25eaba14efea1/0_0_5000_3001/master/5000.jpg?width=460&quality=85&auto=format&fit=max&s=b925d1136dcfcc069f642509badbc160","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Royal Challengers Bangalore Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-royal-challengers-bangalore-live-score-over-match-27-t20-6-10-updates-2894087","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Royal Challengers Bangalore from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 16:49:44","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Delhi Capitals, chasing a target of 190, are 80/1. The live updates of Delhi Capitals vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Delhi Capitals vs Royal Challengers Bangalore, Delhi Capitals vs Royal Challengers Bangalore live score, Delhi Capitals vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (0 Run) Marsh is clearly struggling with his timing out there in the middle! 9.5 overs (1 Run) A yorker-length ball, outside off. Warner squeezes it out behind square on the off side. The batters cross ends. 9.4 overs (1 Run) Floated, full and around off. Mitchell Marsh looks to sweep but it goes off the inner half of the bat, behind square on the leg side for a run. 9.3 overs (1 Run) Aerial...but safe! Warner backs away so Shahbaz Ahmed follows him with a loopy ball. Warner looks to heave it away but he gets a top edge, which falls short of the long on fielder. A single taken! 9.2 overs (1 Run) Slightly short and outside off. Marsh looks to cut but he gets an under-edge past the keeper and gets a single in the end. 9.1 overs (0 Run) Flatter ball, outside off. Marsh slaps hard but finds the cover fielder. No run there. Strategic break! Bangalore have fared well after the Powerplay and dried out the runs slightly. David Warner though is set and has Mitchell Marsh for company who has the ability to shift gears at any point in time. 115 needed off 66 balls and this game is hanging in the balance at the moment. Shahbaz Ahmed to bowl after the break... 8.6 overs (2 Runs) An overthrow and they get the second run in the end! Sloppy from Bangalore here! This is tossed up, outside off. Warner reaches out and drives it wide of Suyash Prabhudessai at long off. Suyash gets to the ball quickly but hurls a wayward throw at the bowler's end. Glenn fails to grab the ball and it goes past him. The fielder backing up runs in from the deep to collect the ball but he fumbles and the batters take another run. Maxwell is absolutely furious with that fielding effort. 8.5 overs (0 Run) An arm ball from Maxwell, that goes on with the angle from outside off. David Warner stays back to cut but he misses. 8.4 overs (1 Run) Short and outside off. Mitchell Marsh cuts it hard through the cover region and takes a run. 8.3 overs (0 Run) A quicker ball, short and outside off. Mitchell Marsh punches hard but straight to the cover fielder. 8.2 overs (1 Run) FIFTY FOR WARNER! Off just 29 balls and this has been a terrific inning from the Australian. Flatter ball, on off. David Warner taps it to the off side and gets to the other end. This is his 52nd fifty in the Indian T20 League - the most by any. 8.1 overs (1 Run) Maxwell comes 'round the wicket and serves a flatter ball, outside off. Mitchell Marsh cuts it to deep cover and settles for a single. Glenn Maxwell is back on. 7.6 overs (0 Run) This is a quicker ball, on a length, around off. Warner keeps it out watchfully. Good comeback from Wanindu Hasaranga after conceding a six on the fourth ball. 7.5 overs (0 Run) On a length, outside off. David Warner pushes it towards the cover fielder, on the bounce. 7.4 overs (6 Runs) SIX! Warner breaks the shackles! Full and on middle. Warner kneels and slog-sweeps it in front of square on the leg side. The ball hits the boundary cushions on the full and the umpire signals a maximum after consulting with the third umpire. 7.3 overs (1 Run) Flatter and quicker, outside off. Mitchell Marsh punches it through covers and bags a run. 7.2 overs (0 Run) Tossed up, on middle. Marsh sets himself up for a heave over deep mid-wicket. However, he gets an inside edge onto his pad. 7.1 overs (1 Run) Hasaranga starts with a flatter ball, on middle. David Warner tucks it to the leg side and settles for a single. Change in bowling. It's time for Wanindu Hasaranga to roll his arm... 6.6 overs (1 Run) An off-pace delivery, into the deck, on middle. Warner pulls it in front of square on the leg side. The fielder in the deep cuts it off and keeps it to just one. 5 runs off Harshal Patel's first over! 6.5 overs (1 Run) Another slower ball that is full and around middle, Marsh strokes it to long on and gives the strike back to Warner. 6.4 overs (0 Run) A slower ball, full and outside off, Mitchell Marsh drives but finds his fellow Australian, Glenn Maxwell at extra cover. 6.3 overs (1 Run) On a length, around off. David Warner works it to long on and takes a single. 6.2 overs (0 Run) Warner shimmies down the track so Patel drags his length back and bowls it into the surface, around off. Warner blocks it out. 6.1 overs (2 Runs) Excellent effort from Suyash Prabhudessai. This is a full ball, on middle. Warner drives it back past the bowler. Suyash runs across to his right from long on, puts in a dive and saves a couple of runs for his side. Bowling change. Here comes Harshal Patel... 5.6 overs (1 Run) Slightly short and outside off. David Warner cuts it through the cover region and collects a run. At the end of the Powerplay, Delhi are 57/1. 5.5 overs (0 Run) Warner makes room on the off side and Josh Hazlewood follows him cleverly with a slower ball, on a length. Warners fails to work it through the leg side and gets hit on his thigh pad. 5.4 overs (1 Run) Short of a length, outside off. Marsh steers it towards third man and settles for a single. 5.3 overs (1 Run) On a length, just outside off. Warner pushes it wide of the mid off fielder and rotates the strike. 5.2 overs (4 Runs) FOUR! SMASHED! Warner makes room on the off side and slaps this back-of-a-length ball through the point region for a boundary. 5.1 overs (0 Run) Josh comes 'round the wicket and serves a good-length ball, nipping back in late from middle and off. David Warner gets cramped for room as he tries to work it on the leg side. He gets hit high on his body.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857443766421673.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-royal-challengers-bangalore-live-score-over-match-27-t20-1-5-updates-2894030","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Royal Challengers Bangalore from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 16:15:54","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.1 overs, Delhi Capitals, chasing a target of 190, are 50/1. The live updates of Delhi Capitals vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Delhi Capitals vs Royal Challengers Bangalore, Delhi Capitals vs Royal Challengers Bangalore live score, Delhi Capitals vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (0 Run) Slower one, short and around off, Marsh is early into his pull shot and misses. He takes a blow on his body. Fine comeback over by Siraj, 5 runs and a wicket from it. 4.5 overs (0 Run) Siraj goes very full and arrows it around off, Marsh tries to flick but gets an inside edge onto the pads. A stifled appeal from Siraj quickly dies down. Mitchell Marsh walks in at number 3 to join his countryman. 4.4 overs (0 Run) OUT! Shaw holes out! Smart bowling from Siraj. He follows the batter down the leg side with a short ball and Prithvi Shaw decides to take on the bowler with his pull shot. It's a slower one, holding onto the surface a bit and that has brought the false shot. It flies off the top edge and Anuj Rawat takes a simple catch at deep mid-wicket. 140 needed off 92 balls. 4.3 overs (1 Run) Shortish and on middle and off, Warner taps it down through point for a single. 50 up! 4.2 overs (0 Run) Brilliant stop at point! Angling away from the batter, outside off, Warner slaps it in front of square on the off side and Kohli makes a diving stop to prevent the boundary. Harsha Bhogle (on air) confirms that all the technology is back running! 4.1 overs (4 Runs) FOUR! Shot! Fuller delivery, around off and angling away, David Warner drills it down the ground and it reaches the long off fence in a flash. Mohammed Siraj comes back to bowl. 10 runs came off his first over. 3.6 overs (1 Run) 15 from the over! Quicker one, around off, David Warner walks across and works it behind square leg for one. 3.6 overs (1 Run) Wide! Fires a full ball down the leg side, Warner leaves. 3.5 overs (6 Runs) SIX! High and handsome! Shahbaz Ahmed drags his length short and serves it around off, David Warner uses the depth of his crease and muscles it over long on. 3.5 overs (1 Run) Wide! Turning down the leg side, Warner lets it be. Simon Doull, the on-air commentator, informs that UltraEdge and Ball Tracking are down at the moment and the same has been conveyed to Faf du Plessis. 3.4 overs (1 Run) Goes down and sweeps a full ball to deep mid-wicket for a run. 3.3 overs (0 Run) Flatter and on off, punched off the back foot to covers. 3.2 overs (1 Run) Fuller and around leg, Warner flicks it to deep square leg for a single. 155 needed off 100 balls. 3.1 overs (4 Runs) FOUR! Smart batting! Floated and full, around off, Warner goes down and across before powering it behind square leg. Once again the first ball has fetched Delhi a boundary. Shahbaz Ahmed comes to bowl now. 2.6 overs (0 Run) Width outside off, short in length, Shaw plays it straight towards short third man. A dot ball to end an 11-run over. 2.5 overs (4 Runs) EDGY FOUR! Not where Shaw intended but it's a boundary nonetheless. Short and around off, Prithvi Shaw stands back to pull but it takes the top edge and flies behind short third man for a boundary. 2.4 overs (0 Run) Slightly short and on off, Shaw tries to pull from the back foot but fails to middle his shot cleanly. 2.3 overs (1 Run) Around middle, on a length, Warner drops it with gentle hands to covers and pinches a quick run. 2.2 overs (0 Run) Back of a length, around middle, Warner hangs on the back foot and hits it across the line. Finds mid-wicket. 2.1 overs (6 Runs) SIX! Warner greets another Aussie into the attack with a biggie. Hazlewood serves it short and around leg, Warner swivels on the back foot and pulls it easily over long leg for a biggie. Josh Hazlewood comes into the attack. 1.6 overs (0 Run) Short and outside off, Shaw plays late and tries to beat point but fails in his attempt. A dot ball to end the over, 10 off it. 1.5 overs (6 Runs) SIX! Tremendous! That's a shot of a man in form. Siraj delivers it on a length around off, Shaw picks it up and dispatches it over cow corner for a biggie. Effortless. 1.4 overs (1 Run) Back of a length, around leg, Warner lifts his front leg and glances it to deep square leg for a single. 1.3 overs (1 Run) The length is again on the shorter side, outside off, Shaw stays put inside the crease and guides it through cover-point for one. 1.2 overs (2 Runs) What a shot! Siraj serves it on a good length around off, Shaw punches it sweetly to deep cover and collects a couple. 1.1 overs (0 Run) Siraj begins with a shortish delivery outside off, Prithvi Shaw stays back and plays it down to point. Who will operate from the other end? It is Mohammed Siraj. 0.6 over (1 Run) Shortish and around leg, Shaw works it to the left side of the short fine leg fielder for a run. 9 from the first over! 0.5 over (1 Run) EDGY! That missed the leg stump by a whisker. Fuller and on off, Warner tries to slog-sweep again but it takes the inside part of the bottom edge and runs past the stumps. The short fine leg fielder makes a sliding stop and they cross for a run. 0.4 over (0 Run) Slightly short and on off, Warner goes back and pulls but mistimes it towards mid-wicket. 0.3 over (0 Run) Slower through the air, full and on middle, Warner drives it back to the bowler. 0.2 over (6 Runs) SIX! Warner opens his account in a grand fashion. Floated and full, landing close to off, Warner goes down on one knee and smokes it over mid-wicket for a maximum. Shows no respect for his countryman. 0.1 over (1 Run) Flatter and on the pads, Shaw flicks it to deep mid-wicket and takes a run. The chase is underway for Delhi.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857423469196736.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“DK he is in form of his life”: R Vinay Kumar claps for Dinesh Karthik half-century vs Delhi Capitals at Wankhede Stadium","link":"https://thesportsrush.com/cricket-news-dk-he-is-in-form-of-his-life-r-vinay-kumar-claps-for-dinesh-karthik-half-century-vs-delhi-capitals-at-wankhede-stadium/","keywords":["Cricket","Delhi Capitals","IPL 2022","RCB","DC","dinesh karthik","Indian Premier League","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Dinesh Karthik half-century: The veteran wicket-keeper batter from Royal Challengers Bangalore has played a game-changing innings. During the 27th match of the ongoing 15th season of the Indian Premier League between Delhi Capitals and Royal Challengers Bangalore at the Wankhede Stadium, veteran Royal Challengers Bangalore wicket-keeper batter Dinesh Karthik has scored his 31st T20 half-century.… The post “DK he is in form of his life”: R Vinay Kumar claps for Dinesh Karthik half-century vs Delhi Capitals at Wankhede Stadium appeared first on The SportsRush.","content":"Dinesh Karthik half-century: The veteran wicket-keeper batter from Royal Challengers Bangalore has played a game-changing innings. During the 27th match of the ongoing 15th season of the Indian Premier League between Delhi Capitals and Royal Challengers Bangalore at the Wankhede Stadium, veteran Royal Challengers Bangalore wicket-keeper batter Dinesh Karthik has scored his 31st T20 half-century. Coming in to bat at No. 7 in the 12th over, Karthik hadn’t even scored a boundary when Delhi Capitals captain Rishabh Pant dropped a catch off spinner Kuldeep Yadav to hand a massive reprieve to an in-form batter. Highest IPL 2022 run-scorer for Royal Challengers now, Karthik made the most of another opportunity scoring 66* (34) with the help of five fours and sixes each in an unbeaten 97-run partnership alongside Shahbaz Ahmed (32*). Karthik, who had scored 7 (13) before hitting first boundary, scored as many as 59 runs on the next 21 deliveries. While his first two sixes had come against Khaleel Ahmed in the 15th and 17th over, it was in the following Mustafizur Rahman over that Karthik hit four fours and two sixes to up the ante in real sense. In what is Karthik’s first half-century of this season, it is also his first for Royal Challengers and 19th in the IPL overall. RCB, who seemed to be struggling to put together a competitive total at one point in time, ended up with a potentially match-winning 189/5 in 20 overs. Twitter reactions on Dinesh Karthik half-century vs Delhi Capitals DK he is in form of his life. Playing regularly in domestic cricket helping him to maintain his class and fitness in IPL #DineshKarthik #DCvRCB #IPL2022 — Vinay Kumar R (@Vinay_Kumar_R) April 16, 2022 I stand corrected: Karthik for World Cup… Please suggest which of the batsmen should be left behind? — Vikrant Gupta (@vikrantgupta73) April 16, 2022 That was some finish! Shahbaz and the DK again. Been such a joy watching DK bat! — Harsha Bhogle (@bhogleharsha) April 16, 2022 Dinesh Karthik is a story of Grit and determination! — Irfan Pathan (@IrfanPathan) April 16, 2022 For more cricket-related news, click here. The post “DK he is in form of his life”: R Vinay Kumar claps for Dinesh Karthik half-century vs Delhi Capitals at Wankhede Stadium appeared first on The SportsRush.","pubDate":"2022-04-16 16:09:18","full_description":"Dinesh Karthik half-century: The veteran wicket-keeper batter from Royal Challengers Bangalore has played a game-changing innings. During the 27th match of the ongoing 15th season of the Indian Premier League between Delhi Capitals and Royal Challengers Bangalore at the Wankhede Stadium, veteran Royal Challengers Bangalore wicket-keeper batter Dinesh Karthik has scored his 31st T20 half-century. Coming in to bat at No. 7 in the 12th over, Karthik hadn’t even scored a boundary when Delhi Capitals captain Rishabh Pant dropped a catch off spinner Kuldeep Yadav to hand a massive reprieve to an in-form batter. Highest IPL 2022 run-scorer for Royal Challengers now, Karthik made the most of another opportunity scoring 66* (34) with the help of five fours and sixes each in an unbeaten 97-run partnership alongside Shahbaz Ahmed (32*). Karthik, who had scored 7 (13) before hitting first boundary, scored as many as 59 runs on the next 21 deliveries. While his first two sixes had come against Khaleel Ahmed in the 15th and 17th over, it was in the following Mustafizur Rahman over that Karthik hit four fours and two sixes to up the ante in real sense. In what is Karthik’s first half-century of this season, it is also his first for Royal Challengers and 19th in the IPL overall. RCB, who seemed to be struggling to put together a competitive total at one point in time, ended up with a potentially match-winning 189/5 in 20 overs. DK he is in form of his life. Playing regularly in domestic cricket helping him to maintain his class and fitness in IPL 👏👏 #DineshKarthik #DCvRCB #IPL2022 — Vinay Kumar R (@Vinay_Kumar_R) April 16, 2022 I stand corrected: Karthik for World Cup… Please suggest which of the batsmen should be left behind? — Vikrant Gupta (@vikrantgupta73) April 16, 2022 That was some finish! Shahbaz and the DK again. Been such a joy watching DK bat! — Harsha Bhogle (@bhogleharsha) April 16, 2022 Dinesh Karthik is a story of Grit and determination! — Irfan Pathan (@IrfanPathan) April 16, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Essex scramble to wild one-wicket win over Somerset: county cricket – live!","link":"https://www.theguardian.com/sport/live/2022/apr/16/gloucestershire-v-yorkshire-somerset-v-essex-county-cricket-live","keywords":["County Championship","Cricket","County Championship Division One","County Championship Division Two","Sport"],"creator":["Tanya Aldred at Bristol"],"video_url":null,"description":"Updates from across the country, play from 11am BSTBarney Ronay: ECB’s spin hides the fact Root was sunkGet in touch! Email Tanya, tweet @TJAldred or post BTLGames moving on swiftly: Glamorgan all out 379, a led of 62. Matthew Potts takes his third wicket in his third over, Leicestershire have lost three for 12 this morning in a north-east wobble. If you’re in Taunton this morning, admission is free - Essex have crept up to 17-4, 67 needed. Continue reading...","content":null,"pubDate":"2022-04-16 16:05:39","full_description":"In Division One: Hampshire are having a shocker, three wickets away from an innings defeat at The Oval. Jamie Overton just the eight wickets in the match. As for Kent , best to put this game quietly and neatly in the bin. Currently 48-4 following-on against Lancs . Compton , having carried his bat for 104, still there, 12 not out. A wicket apiece for Balderson, Lamb, Bailey and Parkinson. And here at Bristol, Bracey calmly approaches his century, Gloucestershire lead by 47. Time to write up, Before I write up, a last glance around the second-division grounds, where Sussex have burst into spring-like bloom. Tom Haines has made his second century of the season, 127 not out, following-on against Derbyshire . His companion at the crease is Cheteshwar Pujara, 36 not out. Sussex still 113 behind, but will at least fight into the final day. Durham are batting again, rapid half centuries for the openers Jones and Dickson, the lead 274 over Leicestershire . And it is all bubbling up at Trent Bridge, Notts 163-5, a lead of 87. Duckett falls,in anguish, for 95, following his century in the first innings. DIVISION ONE Bristol : Gloucestershire 227 and 162-5v Yorkshire 376 all out Canterbury: Kent 260 and 28-2 v Lancashire 506 all out Taunton: Somerset 109 and 154 v Essex 180 and 84-9. Essex win by one wicket. The Oval: Surrey 467 all out v Hampshire 223 and 186-5 DIVISION TWO Derby: Derbyshire 505-8dec (Masood 239) v Sussex 174 and 190-2 Chester-le-Street: Durham 428 all out (Bedingham 191) and 82-0 v Leicestershire 273 all out Trent Bridge: Nottinghamshire 302 and 158-4 v Glamorgan 379 Sitting side on, you are suddenly hit by the full speed of Haris Rauf. He bangs Bracey on the helmet and, after a long wait to do some running repairs and ask the right concussion questions, bounces him next ball. At the other end, Dom Bess runs through his idiosyncratic two-speed run-up. Tea here, and around the grounds, Gloucestershire have a 39 run lead, five wickets in hand. As Bracey walks off for tea, he stops, bends and signs autographs for some kids. I’m going to grab a coffee to help my afternoon eye droop and sit outside for 15 mins to watch properly, back shortly. In the meantime: Apologies if this is wide of the mark, but this very clear piece by Mark Nicholas for @ESPNcricinfo reads an awful lot like his own pitch to be chair of the ECB! (They could do worse, and they haven't done much at all yet, but I guess he's too crickety) https://t.co/woPXKWLbNv Balderson grabs a third wicket, and Compton makes a hundred for the second match in a row. County Cricket - piece of cake. Leicestershire 273 all out at The Riverside, Matthew Potts 6-58. The deficit 155. Ben Duckett is holding Notts together again, 52 not out after a hundred in the first innings. Notts 86-3, Joe Clarke caught off Neser for 30. Notts lead by a nervous nine. Did I mention Hampshire were following on? Holland and Gubbins fell cheaply, but Weatherley (83) and Vince (33) have put on 96. The other following-oners, Sussex are still battling: 136-1, still nearly 200 behind Derbyshire. Tom Haines 89 not out. A brave quote from Somerset head coach Jason Kerr: “We were anticipating a truer surface. The ball did more than we expected and that made batting a challenge. That doesn’t take away from the fact that we are under-performing with the bat and there is work to be done.” What are Kent up to? Kent are are in a fix: 254-9, still 252 behind the Lancashire’s big boys monster total. Two for Balderson, two for Hassan; while Parky has picked up another to add to last night’s tally. (4-60). But hang on - Compton is close to carrying his bat , not out 99... Gloucestershire slip-sliding as Miles Hammond gently gives Adam Lyth some catching practise. Gloucestershire three down, still trail Yorkshire by 65. James Bracey on a sensible 37 not out. A good-natured stag do in cricket whites, and a duck costume, settle down in a Nevil Road stand. Haris Rauf takes a breather. A delighted Haris Rauf takes off, as if at a puppeteer’s whim, throws his legs around and punches the air after plucking out Graeme van Buuren’s leg stump. Someone points out that Rauf holds the ball like Wasim Akram in his run-up, and now its all I can see. Gloucestershire 76-3. Hope you’ve displace that tension with a nice lunch. Gorgeous vegetarian Thai at Bristol. A lovely piece to calm you down by David Hopps on Harry Brook. Includes some honest self-reflection by Brook - he was too distracted by thoughts of the Big Bash to take full advantage of his England Lions opportunity in the winter. Also, that he regards Test cricket as the pinnacle. Harry Brook, the young pretender, cheers Yorkshire as Root concedes it’s time to go https://t.co/XJkqvFIS3x look DIVISION ONE Bristol : Gloucestershire 227 and 56-2 v Yorkshire 376 all out Canterbury: Kent 204-6 v Lancashire 506 all out Taunton: Somerset 109 and 154 v Essex 180 and 84-9. Essex win by one wicket. The Oval: Surrey 467 all out v Hampshire 223 and 46-2 DIVISION TWO Derby: Derbyshire 505-8dec (Masood 239) v Sussex 174 and 90-0 Chester-le-Street: Durham 428 all out (Bedingham 191) v Leicestershire 232-7 Trent Bridge: Nottinghamshire 302 and 45-2 v Glamorgan 379 ’Tis over. With five leg byes. Overton falls to his knees. Handshakes all round. Overton 6-30, 13-87 in the match. Taunton: Somerset 109 and 154 v Essex 180 and 84-9 Essex 19 points, Somerset 3 Oh my days. No. 11 Steketee to face Craig Overton. Scores level, a Siddle maiden, Rossington wafts dangerously. Can Overton walk on water Overton pitches up and Snater slams him straight for four. Essex need two to win. Nine needed . I suggest Rossington doesn’t take a quick single. Gloucestershire , incidentally, have suffered a major blow, losing first-innings centurion Marcus Harris to Steve Patterson, pouched by Harry Brook. 48-2 as a substantial deficit weighs down their shoulders. Harmer. Gone. Siddle. 19 needed. Eight down. And as I press enter, Overton is wheeling around Taunton, Wheater lbw for 17. Essex 57-7, 27 needed.... Up with the Lindor eggs in Division One, Essex are creeping closer, with less than 30 needed. The bleached haired Siddle running in against his old team, three slips with expectant hands. But Rossington and Wheater have done this before. Hassan Ali has his first wicket for Lancashire, Tom Bailey another, as they continue Parky’s work from last night. Kent 192-5. Ben Compton, whose having a fantastic 2022, 84 not out. Let’s take an Easter wander through the mini-eggs: Tim Van der Gugten’s 62 put Glamorgan in the driving seat, and then Has (I’m afraid so) punted the ball to gully for a duck, closely followed by Slater. Two for Hogan. Notts 10-2. At Chester-le-Street ; Ackermann falls for 81, Leicestershire 217-6, trail by 211. And more runs for the admirable Tom Haines, 50 not out, in Sussex’s 74-0. Angled in, through the gate, stumps akimbo. Charlesworth plods off. Gloucestershire not off to a dream start. At least it wasn’t Harris. Fisher grabs his first. Now Tom Westley can’t resist the Overton behemoth. Essex 28-6. Overton!!! Essex 28-5; Critchley bowled for 15. Overton 10 wickets in the match, but he’s bowled (nearly) eight overs; he’ll need a rest soon. How soon? And here at Bristol, the roller is out, Yorkshire all out 376, a lead of 149. Ajeet Singh Dale 4-72. Gloucestershire need to bat out today and most of tomorrow. If you need help setting up friendly cricket, this is your go-to place. A fantastic project ⬇️ https://t.co/sylK4IxyzY At Taunton, Craig Overton has taken the 12.2-over old ball to the umpire - no luck old son. It feels like the panic is subsiding, Essex 23-4, 61 needed. This looks like progress, though I don’t fancy that sky much... Pleased for Nasa Hussain and the team at Bradford Park Avenue after they hosted their first four-day county 2s match as Yorkshire welcomed Northants recently. 👍 pic.twitter.com/MQWAiXw0TC Games moving on swiftly: Glamorgan all out 379, a led of 62. Matthew Potts takes his third wicket in his third over, Leicestershire have lost three for 12 this morning in a north-east wobble. If you’re in Taunton this morning, admission is free - Essex have crept up to 17-4, 67 needed. The Sussex start is comparatively luxurious: 12-0. Hampshire too holding on in the first 20 mins: Barker and Fuller employing doughty defence 176-7. But Azad has gone at Chester-le-Street, closely followed by Kimber for 4. Both to Potts. Leicestershire 174-4. Top trolling by the Gloucestershire scoreboard operator : who puts the Essex score up on the scoreboard. Make that 4-4: Scorecard reads 1, 3, 0, 0 not out, o, o not out. Essex 4-3! Both Cooks gone, one to Siddle, one to Overton. Game suddenly very much on. Blunt early Saturday words from Graeme Fowler: As a functioning governing body. The Ecb doesn’t function nor has any foresight for the English game and its place in world cricket. I for one have no confidence in their ability to further the game. #shambles . #oustthelot In case anyone missed this: Matt Parkinson bamboozling Zak Crawley 🌪️ #CountyCricket2022 pic.twitter.com/2kkr47CHNd DIVISION ONE Bristol : Gloucestershire 227 all out v Yorkshire 334-8 Canterbury: Kent 133-3 v Lancashire 506 all out Taunton: Somerset 109 and 154 v Essex 180 and 3-1 The Oval: Surrey 467 all out v Hampshire 152-7 DIVISION TWO Derby: Derbyshire 505-8dec (Masood 239) v Sussex 174 Chester-le-Street: Durham 428 all out (Bedingham 191) v Leicestershire 159-2 Trent Bridge: Nottinghamshire 302 v Glamorgan 354-9 Past the bust of WG Grace, and up into the press box for day three of this fascinating game between Gloucestershire and Yorkshire. Yesterday’s innings by Harry Brook firmly stacked Yorkshire on top, and tipped his hat in the ring for a Test place in new look England part XCVICIVCIX. Around the grounds, the end is almost nigh for Somerset , unless Coverton can repeat his first innings magic; some late afternoon Parky magic has got Kent wobbling; and Hampshire are also in a surprisingly large hole. In Division Two, Sussex will be following on; Hassan Azad doing his thing at Leicestershire and Glamorgan are holding off Notts.","image_url":"https://i.guim.co.uk/img/media/8e74683ed63ce8b5a1237e7b6fecae58c9fe2fb7/0_193_3498_2101/master/3498.jpg?width=460&quality=85&auto=format&fit=max&s=cc5dc8bf038e2f3eb19ba7d03e68e0ec","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Royal Challengers Bangalore Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-royal-challengers-bangalore-live-score-over-match-27-t20-16-20-updates-2893915","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Royal Challengers Bangalore from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 15:34:00","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 19.5 overs, Royal Challengers Bangalore are 186/5. The live updates of Delhi Capitals vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Delhi Capitals vs Royal Challengers Bangalore, Delhi Capitals vs Royal Challengers Bangalore live score, Delhi Capitals vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 19.5 overs (1 Run) Wide! 19.4 overs (1 Run) Flighted around off, a full toss, DK slogs it over mid-wicket for just a single. 19.3 overs (4 Runs) FOUR! Floated delivery, a touch short and on middle, Karthik tries to reverse-heave it from the crease but gets a little under edge past the keeper for a boundary at third man. 19.2 overs (2 Runs) Very full and around middle, Karthik goes down for the slog-sweep but scuffs it off the bottom half. It goes to deep mid-wicket and he scampers back for the second run to keep strike. 19.1 overs (0 Run) Dot ball. A full toss around leg, over 100 kph, DK sweeps but finds short fine leg. He loses his balance as well. Who will bowl the last over of the innings? Kuldeep Yadav it is. 18.6 overs (4 Runs) FOUR! Shahbaz Ahmed marks his presence now. Short and around leg, Ahmed stands back with an open stance, clears his front leg and smashes it to the deep square leg fence. 12 from the over. Can Bangalore touch 200? 18.5 overs (1 Run) Too full and on middle, whipped to deep mid-wicket for a run. 18.4 overs (0 Run) Play and a miss! Very full in length and wide outside off, Karthik pushes at it and misses. Before this ball, Rishabh Pant had asked his bowler to slow down, breathe, take his time and deliver. The result is a dot ball. Excellent from the captain. 18.3 overs (6 Runs) SIX! Powerful! Short in length and outside off, Dinesh Karthik stands back, fetches it from there and hammer-pulls it over deep mid-wicket for a maximum. 18.2 overs (0 Run) Given LBW and Dinesh Karthik takes the review straightaway. There is some involvement of the bat and the decision is reversed much to the delight of the crowd. Coming to the delivery, a near-yorker on middle, Karthik brings his bat down and then we see it getting deflected to square leg. The bowler appeal and gets the umpire to agree but DK uses the DRS to overturn the decision. 18.1 overs (1 Run) Fuller in length and down the leg side, Ahmed tries to heave but misses. It goes off his pads to square leg and they get a leg bye. DK is back on strike. Shardul Thakur (3-0-16-1) is back on. 17.6 overs (4 Runs) FOUR! This is outstanding batting from Karthik, he gets to his FIFTY off just 26 balls. Mustafizur Rahman speeds in from 'round the wicket and tries to follow the batter down the leg side with a low full toss. Karthik shows it the full face of his bat and smacks it over mid off. 28 from the over! 17.5 overs (6 Runs) SIX! Karthik is doing it yet again for Bangalore. The 'finisher' is finishing the innings on a high. Fuller this time, around off, Karthik stays inside the crease, gets the chance to get under the delivery and launches it over long off. 17.4 overs (6 Runs) SIX! Muscular! Mustafizur Rahman is clueless at the moment. Delivers it on a length around off, angling away, DK camps on the back foot and hammers it over the bowler's head for a maximum. 150 comes up! 17.3 overs (4 Runs) FOUR! DK is motoring now and the crowd is loving it! He is in stupendous form this season. A conventional shot from him this time as he rocks back to a length ball outside off and rifles it through extra cover. 17.2 overs (4 Runs) FOUR! Wow, that's an exceptional shot! Short in length and outside off, slower in pace, Dinesh Karthik brings out the reverse-batted shot again, nails it from the middle of the bat this time and it finds the fence at third man. 17.1 overs (4 Runs) FOUR! Looking London Talking Tokyo. A length ball outside off, angling away, Karthik walks across the stumps to scoop it past short fine leg but it takes the outside edge and screams past short third man. The end result is what he desired, a boundary. Mustafizur Rahman to bowl out. 16.6 overs (2 Runs) Full and on middle, Shahbaz Ahmed clips it to deep mid-wicket and calls for two. Easy two in the end. 12 from the over! 16.5 overs (1 Run) Too full in length and wide outside off, Karthik goes for the reverse-batted shot and it comes off from the bottom part of his blade. It runs through point and they cross. 16.4 overs (0 Run) Fullish and wide outside off, Karthik chases and throws his bat at it. It takes a bit of the bottom edge and rolls to the keeper. Pant fumbles but no run is conceded. 16.3 overs (6 Runs) SIX! Bang! DK targets the shorter side of the ground and sends it flying over the fence. Shortish and around off, angling away, Dinesh Karthik powers it over mid-wicket for a biggie. 16.2 overs (2 Runs) Short in length and outside off, Karthik rocks back and cuts it late. He beats backward point and collects a couple as the sweeper cover fielder cuts it off near the fence. 16.1 overs (1 Run) Slower one, it's served on a shortish length around off, Shahbaz Ahmed steps back and taps it down to point for a run. 15.6 overs (1 Run) Delivers it from wide of the crease and keeps his line outside off, Ahmed drives the full ball to sweeper cover for a run. 5 singles from the over, a good one by Mustafizur Rahman. 15.5 overs (0 Run) Misses out! A full toss outside off, Shahbaz flashes his bat at it but fails to make any connection. 15.4 overs (1 Run) Fractionally short and around middle, Karthik turns and pulls it behind square leg. It's stopped near the fence and they cross for one. 15.3 overs (1 Run) Fuller in length and outside off, it's driven firmly to deep cover for only a single. A good over thus far from the Fizz! 15.2 overs (1 Run) Rahman comes from 'round the wicket and delivers it on a length around off, Karthik plays it down to point for a run. 15.1 overs (1 Run) Back of a length, around off, Shahbaz Ahmed punches it square of the wicket on the off side for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857398321661159.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-royal-challengers-bangalore-live-score-over-match-27-t20-11-15-updates-2893819","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Royal Challengers Bangalore from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 15:23:40","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.1 overs, Royal Challengers Bangalore are 116/5. The live updates of Delhi Capitals vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Delhi Capitals vs Royal Challengers Bangalore, Delhi Capitals vs Royal Challengers Bangalore live score, Delhi Capitals vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (6 Runs) SIX! KABOOM! DK gets into the act and sends it sailing way over the square leg fence. Khaleel hits the deck hard, around middle. Karthik sits back in his crease and bludgeons it over the square leg fence for a maximum. 13 runs off the over! 14.5 overs (1 Run) Slightly shorter in length, outside off. Shahbaz Ahmed cuts it but there is a fielder stationed at deep backward point. The ball goes straight to him and they take only a run despite a bit of fumble. 14.4 overs (1 Run) Back of a length, on middle and cramping the batter for room. Dinesh Karthik mistimes his pull towards the deep mid-wicket fielder. The batters manage only a single. 14.3 overs (1 Run) A slower ball, into the wicket, just outside off. Shahbaz Ahmed punches it through the cover-point region and takes a single. 14.2 overs (4 Runs) FOUR! Slapped away! Short and wide, outside off and Shahbaz Ahmed latches onto it in a flash! He cuts it hard through the point region and bags a boundary. 14.1 overs (0 Run) Swing and a miss! Back of a length, well outside off. Shahbaz Ahmed hops in his crease and looks to cut hard but he fails to get any blade on it. Khaleel Ahmed is back into the attack. 1 for 11 in his 2 overs so far. 13.6 overs (1 Run) On a length, around middle. Shahbaz Ahmed sits back and nudges it through mid-wicket for a single. 13.5 overs (1 Run) Tossed up, outside off. Dinesh Karthik gets forward and drives it towards deep cover for a single. 13.4 overs (0 Run) Tossed up, on middle. Dinesh Karthik whips it back to the bowler who collects it to his right. 13.3 overs (0 Run) That missed the off pole by a whisker! Flatter and quicker, on a length, just outside off. Dinesh Karthik stays back and looks to whack it across the line but he misses and the ball evades the off stump. Pant fumbles while collecting the ball. The replays, later on, detect an inside edge. So a chance has gone begging. 13.2 overs (0 Run) Kuldeep drags his length back, around off. DK rocks back and cuts it to the cover fielder. 13.1 overs (0 Run) Nicely tossed up, on off. Dinesh Karthik defends it off the front foot. 12.6 overs (1 Run) Edged but safe! An arm ball, on a length and around middle. Dinesh Karthik looks to work it across the line. The ball takes a thick leading edge and goes towards the short third man region for a single. 100 up for Bangalore! 4-0-29-1, Axar is done with his spell now. 12.5 overs (0 Run) Slightly short and outside off. DK stays back and punches it towards the extra cover fielder. 12.4 overs (1 Run) On a length, around middle, Shahbaz Ahmed works it to long on and takes yet another run. 12.3 overs (1 Run) Aerial but safe! This is tossed up, outside off. DK kneels and looks to sweep. The ball takes the top edge of the bat and flies towards the deep square leg fielder. It falls just short of the fielder there and the batters take a run. 12.2 overs (1 Run) Flatter and quicker, on off. Shahbaz Ahmed eases it to long on and rotates the strike. 12.1 overs (1 Run) This is a flatter ball, on the pads. DK stays back and tucks it around the corner for a single. Axar Patel to bowl his final over. 11.6 overs (1 Run) An overpitched ball, on middle. Dinesh Karthik whips it off his pads towards deep mid-wicket. A single to end the over. 11.5 overs (1 Run) Floated, just outside off. Shahbaz Ahmed defends it to the off side and gets to the other end. A quick single. 11.4 overs (1 Run) In the air...but it lands safely! Dragged down, around middle. Dinesh Karthik rocks back and mistimes his pull shot just wide of the long on fielder, for a single. 11.3 overs (0 Run) Tossed up, on middle and turning in late. DK keeps it out. Dinesh Karthik walks in next. 11.2 overs (0 Run) OUT! CAUGHT! Kuldeep Yadav has his revenge and this is a huge moment in this game as Glenn Maxwell walks back to the hut. Kuldeep tosses it up and lands it full around middle and leg. Maxwell's eyes lit up and he looks to go downtown. The ball though takes the bottom half of the bat and he ends up chipping it straight to Lalit Yadav at long on who takes a sitter. Kuldeep roars in delight and Bangalore have now lost half their side. 11.1 overs (1 Run) Flatter and quicker, outside off. Shahbaz Ahmed cuts it through cover and hands the strike back to Glenn. Change in bowling. Kuldeep Yadav is back on. He went for 23 runs in his first over but has a change of ends now. 10.6 overs (2 Runs) Good effort in the deep from Rovman Powell! A full ball, on middle. Glenn whips it wide of the long on fielder. Powell moves across to his right, bends down in time and saves a couple of runs for his side. 10.5 overs (0 Run) Fuller in length, outside off. Glenn Maxwell gets low and drives hard. He finds the mid off fielder though. 10.4 overs (0 Run) On a length, around off. Glenn drags it back to the bowler. 10.3 overs (4 Runs) FOUR! FIFTY FOR MAXWELL! A low full toss, around leg. Glenn just helps it on its way past the fielder at short fine leg for a boundary. He raises his bat towards the dugout and takes all the well-deserved applause. The Aussie has arrived this season and would be aiming for a big finish. 10.3 overs (1 Run) Wide! A slower bumper, well outside off and above the batter's head. Glenn lets it be. The umpire signals for a wide. 10.2 overs (0 Run) Full and outside off. Glenn Maxwell drives but finds the cover fielder. 10.1 overs (2 Runs) TWO LEG BYES! Excellent running between the wickets! A length ball, jagging back in sharply, from middle, Glenn misses his nudge on the leg side and gets hit high on his pad. The ball rolls to the vacant mid-wicket region and the batters collect two byes.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857392119250819.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, DC vs RCB Live Score: Dinesh Karthik, Shahbaz Ahmed Look To Salvage RCB Innings vs Delhi Capitals - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiTmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWRjLXZzLXJjYi1saXZlLXNjb3JlLXVwZGF0ZXMtMjg5MzQ4MNIBVGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWRjLXZzLXJjYi1saXZlLXNjb3JlLXVwZGF0ZXMtMjg5MzQ4MC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, DC vs RCB Live Score: Dinesh Karthik, Shahbaz Ahmed Look To Salvage RCB Innings vs Delhi Capitals  NDTV SportsDC v RCB, Preview: Game Day | IPL 2022  Royal Challengers BangaloreDelhi Capitals vs Royal Challengers Bangalore Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - RCB vs Capitals, Indian Premier League 2022, 27th Match  ESPNcricinfoCountdown to DC vs RCB - A message from Virat Kohli, Glenn Maxwell & Faf du Plessis  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-04-16 15:23:06","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-royal-challengers-bangalore-live-score-over-match-27-t20-6-10-updates-2893744","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Royal Challengers Bangalore from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 14:35:49","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 9.5 overs, Royal Challengers Bangalore are 79/4. The live updates of Delhi Capitals vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Delhi Capitals vs Royal Challengers Bangalore, Delhi Capitals vs Royal Challengers Bangalore live score, Delhi Capitals vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Shahbaz Ahmed is the new batter in for Bangalore. 9.3 overs (0 Run) OUT! CAUGHT! The young man gets carried away and throws his wicket. With Glenn Maxwell going great guns at the other end, this shot should have been avoided. 9.2 overs (4 Runs) FOUR! Nicely played! Quicker one, full and on middle, Suyash Prabhudessai dances down the track and whips it in the gap at wide long on for a boundary. 9.1 overs (1 Run) Flatter and fuller around off, Maxwell pushes it to deep cover for an easy run. Strategic break! Bangalore have come storming back into this contest, thanks to Glenn Maxwell who seems to have got in the groove and he is taking the attack to Delhi's bowlers now. Delhi have managed to dismantle Bangalore's top order but they will need to keep picking up wickets as Bangalore bat pretty deep. Glenn Maxwell holds the key for the batting side going ahead in this game. 8.6 overs (1 Run) Smart batting. A quiet nudge in the gap at mid-wicket and Glenn Maxwell keeps the strike with a single. 23 from the over. 8.5 overs (6 Runs) SIX! 22 from the over so far, Kuldeep is under immense pressure here. Fuller and around leg, Maxwell bends his back knee a bit and smokes it over mid-wicket for a maximum. 8.4 overs (4 Runs) FOUR! Maxwell is on fire and stealing the momentum away from Delhi. Too full on this occasion from Kuldeep, wide outside off, Glenn Maxwell bludgeons his drive through extra cover. 8.3 overs (6 Runs) SIX! Maxwell is on the attack! He doesn't want Kuldeep to settle here. Another long hop, around middle, Glenn rocks back and rockets his pull shot over mid-wicket. It's hit towards the shorter side of the ground and sails into the crowd. 8.2 overs (2 Runs) Again the length is short and on middle, Maxwell pulls it towards wide long on and scampers back for the second run. 8.1 overs (4 Runs) FOUR! Bang! Kuldeep drags his length short, around off, Maxwell camps back and smacks it wide of long on for a powerful boundary. Kuldeep Yadav comes into the attack now. 7.6 overs (1 Run) Flatter arm ball around leg, Glenn Maxwell moves back to work it on the leg side but it takes the inner edge and rolls to short fine leg. They cross for a quick run. Another tidy over by Axar Patel. 7.5 overs (0 Run) Flying stop by Shaw! Floated and full, around off, Glenn Maxwell drives it firmly to covers where Prithvi Shaw dives across to his right to stop the racing ball. 7.4 overs (1 Run) Quicker one, wide outside off, Suyash Prabhudessai steps back to make room but only manages to drag it back past the bowler to long on. They cross. 7.3 overs (1 Run) Skidding down the leg side, it's worked to deep square leg for a single. 7.2 overs (0 Run) Flatter and on off, defended back to the bowler. 7.1 overs (2 Runs) Risky! Arm ball on middle, a bit short, Maxwell goes back and tickles it to deep square leg. They call for a risky second run and complete it safely in the end. A better throw from the deep by Kamlesh Nagarkoti (sub) could have made things interesting. Axar Patel comes back to bowl. 7 runs came off his first over. 6.6 overs (0 Run) Digs it in short, around off at 133.3 kph, Suyash Prabhudessai drops his wrists and sways away. 6.5 overs (1 Run) Full in length and around off, Maxwell drives it to wide mid off and pinches a quick run. The fielder misses his shy at the bowler's end. 6.4 overs (0 Run) Short in length and outside off, Glenn cuts but finds the point fielder. 6.3 overs (1 Run) Outside off, guided down to third man for a single. Suyash Prabhudessai walks out to bat. 6.2 overs (0 Run) OUT! KOHLI IS RUN OUT! A magical piece of fielding by Lalit Yadav and his direct hit has helped Delhi net the big fish. A swinging delivery, on a length around off, Kohli plays it down to point and looks for a run. Glenn Maxwell responds initially but then stops. He sends Kohli back who turns and tries to rush back but Lalit Yadav collects the ball and scores a direct hit at the same time towards the striker's end. They appeal, the third umpire comes into play and the replays show that Kohli is inches short of the crease. Big blow to Bangalore. Is that a run out? A direct hit at the striker's end and Virat Kohli might be in trouble here. Excellent fielding from Lalit Yadav at backward point. He got rid of the ball quickly and scored a direct at Kohli's end. The replays suggest that Kohli was just short of his crease. 6.1 overs (0 Run) On a good length and close to off, Kohli walks forward and pushes it to covers. Shardul Thakur (1-0-7-1) is back on. 5.6 overs (4 Runs) FOUR! Lovely shot! Mustafizur Rahman errs in line and delivers a length ball around leg, Glenn Maxwell walks across the stumps and nudges it down to fine leg for a boundary. 10 from the over, Bangalore are 40/2 after the Powerplay! 5.5 overs (1 Run) Back of a length, on off, dabbed down to cover-point for a run. 5.4 overs (0 Run) Mustafizur Rahman speeds in from 'round the wicket and angles in a length ball on middle, Kohli defends it to the leg side. 5.3 overs (1 Run) Pace off again, the length goes a bit short, around off, Glenn taps it down to short third man for one. 5.2 overs (4 Runs) FOUR! Fine shot! Slower one from Mustafizur Rahman but it's a little too full and around off, Maxwell drills his drive through covers and finds the fence. 5.1 overs (0 Run) Play and a miss! A touch short in length and outside off, angling away, Glenn Maxwell flashes his bat at it but fails to connect.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857363409431651.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, DC vs RCB Live Score Updates: Bangalore lose two quick wickets - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiW2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWRjLXZzLXJjYi1saXZlLXNjb3JlLXVwZGF0ZXMtNzg3MjEyMC_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, DC vs RCB Live Score Updates: Bangalore lose two quick wickets  The Indian ExpressDC v RCB, Preview: Game Day | IPL 2022  Royal Challengers BangaloreDelhi Capitals vs Royal Challengers Bangalore Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - RCB vs Capitals, Indian Premier League 2022, 27th Match  ESPNcricinfoCountdown to DC vs RCB - A message from Virat Kohli, Glenn Maxwell & Faf du Plessis  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-04-16 14:13:50","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"MI vs LSG Highlights, IPL 2022: Lucknow beat Mumbai by 18 runs - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9taS12cy1sc2ctbGl2ZS1zY29yZS1pcGwtMjAyMi10MjAtbXVtYmFpLWluZGlhbnMtdnMtbHVja25vdy1zdXBlci1naWFudHMtbWF0Y2gtMjYtbGl2ZS11cGRhdGVzLTEwMTY1MDA5MDAwMzcxOS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"MI vs LSG Highlights, IPL 2022: Lucknow beat Mumbai by 18 runs  Hindustan TimesReport Mumbai Indians vs Lucknow Super Giants IPL 2022 KL Rahul Dewald Brevis | Cricbuzz.com - Cricbuzz  CricbuzzMI vs LSG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorHighlights, Tata IPL 2022 MI vs LSG Full Cricket Score: Lucknow win by 18 runs; Mumbai suffer sixth straight loss - Firstcricket News  FirstpostThe Punjab Press  CricVizView Full coverage on Google News","content":null,"pubDate":"2022-04-16 14:02:38","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-royal-challengers-bangalore-live-score-over-match-27-t20-1-5-updates-2893592","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Royal Challengers Bangalore from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 13:45:40","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.2 overs, Royal Challengers Bangalore are 34/2. The live updates of Delhi Capitals vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Delhi Capitals vs Royal Challengers Bangalore, Delhi Capitals vs Royal Challengers Bangalore live score, Delhi Capitals vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (0 Run) A yorker-length delivery, around off. Kohli shimmies down a bit and digs it out. 4.5 overs (4 Runs) FOUR! Nicely done! Fuller in length, outside off. Kohli gets to the pitch of the ball and drives it through mid off. David Warner there, dives to his right in order to stop the ball. However, the ball evades him and races away for a boundary. 4.4 overs (0 Run) BEATEN! This is a good-length ball, around the corridor of uncertainty. Kohli gets forward to defend but the ball goes past the outside edge. Excellent bowling! 4.3 overs (0 Run) Good-length delivery, just outside off. Kohli taps it towards cover and looks to sneak in a quick run. Maxwell though sends him back in time. 4.2 overs (1 Run) In the air...but safe! A length ball, around middle. Glenn Maxwell looks to flick it away but he gets it away off the toe end. The ball lobs up and falls in the vacant mid-wicket region. A single taken! 4.1 overs (1 Run) Back of a length, around off. Kohli taps it towards backward point and rotates the strike. 3.6 overs (0 Run) Big swing and a miss! Tossed up, outside off. Glenn Maxwell gets forward and looks to heave it away but he fails to make any connection. 3.5 overs (4 Runs) FOUR! Nails his cut shot this time! This is flatter and quicker, outside off. Maxwell rocks back and cuts it past the backward point fielder to bag a boundary. 3.4 overs (0 Run) Too close to cut! Slightly short and around off, cramping the batter for room. Maxwell stays back to cut but he gets an under-edge onto the deck. 3.3 overs (1 Run) Floated, full and well outside off. Kohli prods and bunts it towards long off for one run. 3.2 overs (1 Run) Tosses it up, outside off. Maxwell drives it towards long off and takes a single. 3.1 overs (1 Run) Flatter and quicker, outside off. Kohli rocks back and eases it to long on. The batters cross ends. Axar Patel to deliver the fourth over. 2.6 overs (4 Runs) FOUR! Deft touch! A length ball, just outside off. Glenn Maxwell stays back, opens the face of his bat and steers it past the diving fielder at short third man for a boundary. He gets off the mark with that shot. 2.5 overs (0 Run) Back of a length, nipping back in slightly. Glenn Maxwell blocks it awkwardly back to the bowler. 2.4 overs (0 Run) Good-length ball, around middle. Glenn Maxwell defends it back to the bowler. Glenn Maxwell is the new batter at number 4. 2.3 overs (0 Run) OUT! CAUGHT! Excellent field placement from Rishabh Pant and Khaleel Ahmed gets the big fish! Bangalore lose their skipper and are in a spot of bother early on in the innings. Faf du Plessis skips down the track, so Khaleel Ahmed serves it wider, shorter and outside off. Faf looks to smack it over the extra cover fence. Although, the ball goes off the outer half of the blade, towards the deep point region. Axar Patel is stationed there quite square and he takes a simple catch moving to his right. 2.2 overs (0 Run) On a length, outside off. Faf du Plessis stays back and punches it to the cover fielder. 2.1 overs (1 Run) Khaleel starts with a full ball, outside off. Kohli reaches out and looks to drive it through covers. It goes off the inner half of the blade towards mid off, for a run. Khaleel Ahmed to bowl the third over. 1.6 overs (0 Run) Good change of pace from Thakur! A slower ball, into the surface, around middle. Faf du Plessis looks to pull but gets early into his shot and misses. He gets hit high on his body. End of a successful over for Delhi - 7 runs and a wicket off it! 1.5 overs (0 Run) Play and a miss! A length ball, angling in late from outside off. Faf du Plessis looks to cut it away from his body but the ball sneaks past the inside edge. 1.4 overs (4 Runs) FOUR! Pierces the gap to perfection! Good-length ball, outside off. Faf du Plessis gets forward and drives it on the up through the mid off region. David Warner there dives to his left but the ball goes past him and races away to the fence. 1.3 overs (1 Run) Slightly short and outside off. Kohli hangs back and mistimes his cut shot towards deep backward point for a single. 1.2 overs (2 Runs) This is a full ball, outside off. Virat Kohli gets forward and drives it through the cover region for a brace. The fielder in the deep cuts it off. Kohli is off the mark with a couple of runs. A huge roar from the crowd as Virat Kohli walks in next. 1.1 overs (0 Run) OUT! PLUMB LBW! Shardul Thakur strikes straightaway! A dream start for him and Delhi get the breakthrough! This is a full ball, nipping back in late from middle and off. Anuj Rawat misses his flick and gets pinged on his front pad. Thakur appeals and the umpire agrees. Rawat has a word with the skipper but they don't opt for the review. Anuj Rawat departs for a golden duck. 0.6 over (0 Run) Excellent delivery to end the over! A length ball, angling in late from middle. Faf du Plessis prods and manages to defend it back to the bowler. 5 runs off the first over. Who will operate from the other end? 0.6 over (1 Run) Wide! A leg-cutter from Mustafizur Rahman but he errs in line. This is a loopy ball, well outside off. Faf du Plessis lets it be. Wide called by the umpire. 0.5 over (0 Run) Another ball that is on a length, around off. Faf du Plessis sits back in his crease and defends it to the off side. 0.4 over (0 Run) Short of a length, outside off. Faf du Plessis reaches out and drags it to the fielder at covers. 0.3 over (4 Runs) FOUR! Too straight from Mustafizur Rahman this time! He serves it on the pads. Faf du Plessis just tickles it through the fine leg region for a boundary. Bangalore are up and running! 0.2 over (0 Run) An appeal for LBW but that was surely heading down leg! This was a full ball, nipping back in sharply, from middle. Faf du Plessis misses his flick and gets hit low on his pad. Some movement early on for Mustafizur Rahman! Pant went against reviewing the decision, a good call in the end. The replays later showed that there was a hint of an inside edge too. 0.1 over (0 Run) Rahman starts with a back-of-a-length ball, around middle. Faf du Plessis stays back and dabs it onto the deck. The thriller at the Brabourne Stadium is over and Lucknow survived a late scare. Let's switch our focus to Wankhede now where we are minutes away from the first ball. Faf du Plessis and Anuj Rawat are the openers for Bangalore. Mustafizur Rahman to start proceedings. One slip in place. Here we go... Faf du Plessis, the skipper of Bangalore, says that the pitch looks a bit drier than anticipated. Tells that they had a lot of discussion regarding the combination of the bowlers. Adds that breaking up the overs in the middle is something that they have spoken about as well. Informs that Harshal Patel replaces Akash Deep in this game. Rishabh Pant, the captain of Delhi, says that the wicket is looking on the drier side so they want to make use of that. Adds that they have one change - Mitchell Marsh comes in for Sarfaraz Khan. Further tells that to keep believing in the process is the message to the team and he hopes that his team will utilize the shorter side of the ground. Bangalore (Playing XI) - Faf du Plessis (C), Anuj Rawat, Virat Kohli, Glenn Maxwell, Dinesh Karthik (WK), Shahbaz Ahmed, Suyash Prabhudessai, Wanindu Hasaranga, Harshal Patel (In for Akash Deep), Mohammed Siraj, Josh Hazlewood. Delhi (Playing XI) - Prithvi Shaw, David Warner, Mitchell Marsh (In for Sarfaraz Khan), Rishabh Pant (C/WK), Rovman Powell, Lalit Yadav, Axar Patel, Shardul Thakur, Kuldeep Yadav, Mustafizur Rahman, Khaleel Ahmed. TOSS - Delhi have won the toss and they have elected to BOWL first. Debut for Mitchell Marsh! The Australia all-rounder receives his cap for Delhi from Rishabh Pant. He will add an all-round dimension to Delhi's strength. Update - The game between Mumbai and Lucknow is going on at the Brabourne Stadium, and it's tightly poised at the moment. Chasing a target of 200, Mumbai need 84 off 42 balls with Tilak Varma and Suryakumar Yadav in the middle. With Kieron Pollard and Fabian Allen waiting in the wings, this promises to be a thriller. While we wait for the toss here, you can keep shuffling the tabs and follow that match as well. Bangalore, on the flip side, were handed a defeat in their previous game after winning three games on the trot and they will be itching to get back to winning ways. They did miss the services of Harshal Patel in the last game, as their bowlers were taken to the cleaners and the batters failed to chase down a huge total. Although, Harshal Patel will be making his comeback in this game and it would surely bolster their line-up. In the last edition, Bangalore won both the fixtures which included a game that they won by one run. Will Delhi take revenge in this clash? We shall find that out soon. Stick around for toss and further updates. Delhi are coming at the back of a comprehensive win in their previous game against Kolkata and they will be now looking to build on that. It was a complete team performance from them and they seem to be a very formidable unit. It is heard that the Australian all-rounder, Mitchell Marsh, who is now fit, might be drafted into the XI straightaway. This Rishabh Pant-led side will be confident of their chances heading into this clash. Hello and a very warm welcome to the coverage of game number 27 of the Indian T20 League where Delhi will lock horns with Bangalore at the iconic Wankhede Stadium. Both these sides have fared reasonably well so far but we are yet to witness their best in this tournament. This surely promises to be a cracker of a game as two star-studded line-ups clash. Stay tuned for more... ... Match Day ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857333339170285.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians vs Lucknow Super Giants: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/mumbai-indians-vs-lucknow-super-giants-live-score-over-match-26-t20-16-20-updates-2893585","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Mumbai Indians vs Lucknow Super Giants from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 13:45:33","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Mumbai Indians, chasing a target of 200, are 181/9. The live updates of Mumbai Indians vs Lucknow Super Giants scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Mumbai Indians vs Lucknow Super Giants, Mumbai Indians vs Lucknow Super Giants live score, Mumbai Indians vs Lucknow Super Giants scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. That is all we have from this game. The second match of the Super Saturday between Delhi and Bangalore have already started. So, you can switch the tabs and join us there. From here, it is goodbye! KL Rahul is the Player of the Match for his brilliant century. Marcus Stoinis is up for a chat. He says that it was a great evening. Tells that there were a lot of twists and turns and such things happen as this is a great competition. Tells that de Kock got them to a flier and Rahul played amazingly well. Mentions that everyone knew what they had to do. Tells that he had a different role compared to the last game but it paid off and is happy. Rohit Sharma, the skipper of Mumbai says that it is hard to put it in words. Mentions that 199 on this pitch was chaseable and they needed partnerships but lacked that. Adds that Lucknow bat quite deep so they wanted their key bowlers at the backend but it didn't work out. Tells that Bumrah bowled very well but others need to pull up their socks. Says that every game they play, they try to find the best 11 and unless they win games, they can't get the right 11. Further adds that Rahul batted brilliantly and till the end and that is something which is missing in their top order. Ends by saying that he tries to prepare just like any other game but it is not coming off but he backs himself and just enjoys out there. Tells that it is not the end of the world, they have come back from a similar situation before and they will try to come back again. The match was won in the fielding department. Mumbai made too many mistakes but Lucknow were on top of their game today. The players backed the bowlers who were outstanding throughout the game. It was a good batting pitch but Lucknow made sure to take wickets at regular intervals. The skipper, KL Rahul's ton did not go in vain as Lucknow bowled really well. Avesh Khan was the pick of the bowlers who took three wickets while others kept the pressure from the other end as well. With this win, Lucknow move to second position with 8 points. Two newcomers on top of the point tables right now. Mumbai were in trouble at the start by losing Rohit for yet another low score but it was Brevis's innings of 31 off 13 deliveries that helped them end the Powerplay on a high. He fell later and Mumbai were 3 down and looked upon Yadav once again to save them. SKY and Varma kept the scoreboard ticking and took the game deep. Few hopes were dead when Suryakumar Yadav perished but it was the big man, Pollard who kept the faith alive. A substantial innings was needed from him and something spectacular was required but the chase was just too big for the big man. Jaydev Unadkat and Murugan Ashwin tried hard but a lot was left at the end for them to chase. When it rains it pours and it is pouring heavily right now on Mumbai. It is now 6 games without a win and Mumbai continue to be the prime holder of the wooden spoon. Credit to Lucknow who kept it simple and kept their nerve till the end. 19.6 overs (0 Run) Fuller in length, outside off. Tymal Mills reaches out for it but misses. Dushmantha Chameera defends 25 runs off the final over. Mumbai lose their sixth match on the trot now. Lucknow win by18 runs! Tymal Mills is the last man in. 19.5 overs (0 Run) OUT! CAUGHT! Pollard holes out! Dushmantha Chameera goes full and outside off, Kieron Pollard swings his bat hard across the line to deep mid-wicket. Didn't get the elevation there and Marcus Stoinis charges forward to take a good sharp catch. That should be the game for Mumbai! 19.4 overs (0 Run) That should be that! A low full toss, on off. Kieron Pollard slams it to deep mid-wicket. Jasprit Bumrah walks out now. 19.3 overs (0 Run) OUT! RUN OUT! Full and outside off, Murugan Ashwin throws the kitchen sink at it but misses. Kieron Pollard had to get back on strike so he starts running. Quinton de Kock throws the ball aiming for the stumps at the striker's end but misses. However, the ball goes into the hands of Dushmantha Chameera and he underarms it at the bowler's end. Murugan Ashwin is caught well short. 19 needed off 3 now. 19.2 overs (6 Runs) SIX! WOW! Where did that come from? Murugan Ashwin you beauty! Length ball, on off. Murugan Ashwin stays deep in the crease and dipatches the ball over long on for a maximum. Murugan Ashwin walks out. He will be on the strike. 19.1 overs (1 Run) OUT! RUN OUT! A miscommunication between the batters and Jaydev Unadkat has been run out. Full and on middle and leg, Kieron Pollard whips it to deep mid-wicket. The batters take one and Pollard was a bit late to respond for the second run. Marcus Stoinis in the deep quickly throws the ball to Quinton de Kock and both the batters are stranded in the middle but Jaydev Unadkat sacrifices his life so that Kieron Pollard still stays out in the middle. 26 runs needed of the last over. Kieron Pollard on the strike. Can Dushmantha Chameera defend it? 18.6 overs (0 Run) A low full toss, outside off. Jaydev Unadkat whacks it to long off but Kieron Pollard denies the single. 26 needed off the final over. 18.5 overs (4 Runs) FOUR LEG BYES! No matter how the runs come for Mumbai now! The dream is still alive for them. Fuller in length, angling in on leg. Jaydev Unadkat misses his slog and the ball goes off the pads past Quinton de Kock to fine leg for a boundary. Quinton de Kock dived to his left but the ball was just out of his reach. Little bit of luck going in Mumbai's way. 18.4 overs (4 Runs) FOUR! This is superb batting! Full and on middle, Jaydev Unadkat hammers it straight down the ground for a boundary. Mumbai crowd is enjoying this! 18.3 overs (6 Runs) SIX! BANG! Jaydev Unadkat is still giving Mumbai some hopes! Back of a length, outside off. Jaydev Unadkat goes down on one knee and pummels it over long on for a maximum. 18.2 overs (1 Run) Brilliant bowling from Holder! A yorker, on leg. Kieron Pollard looks to flick but gets an edge to short third man and the batters take a single. 40 needed off 10 balls. Kieron Pollard is off strike. Advantage Lucknow! 18.1 overs (2 Runs) Fuller in length, outside off. Kieron Pollard gets behind the line and drives it to deep extra cover. He is desperate to come back for the second run and gets it easily at the end. 43 runs needed in 12 balls. Kieron Pollard changes his gloves and he will now face his fellow West Indian, Jason Holder. 17.6 overs (0 Run) A full toss, on off. Jaydev Unadkat swings his bat but mistimes it this time to cover. Brabourne Stadium has turned to silence but Kieron Pollard is still out there. Can he pull off a heist? 17.5 overs (4 Runs) FOUR! Finds the gap, finds the boundary! A low dipping full toss, outside off, Jaydev Unadkat makes room and drives it through covers for a boundary. Jaydev Unadkat walks out. 17.4 overs (0 Run) OUT! TAKEN! Excellent catch from Dushmantha Chameera and Avesh Khan bags his third wicket. Length ball, outside off. Fabian Allen goes for a big hit on the leg side but ends up slicing the ball to short third man. The ball was travelling quickly but Dushmantha Chameera takes a sharo catch right in front of his head. A crucial wicket for Lucknow. 47 needed off 14 balls now! 17.3 overs (1 Run) Excellent bowling under pressure! A low full toss, outside off. Kieron Pollard could only work it down to deep mid-wicket for a run. 17.2 overs (0 Run) A crucial dot! Full and outside off, Kieron Pollard goes for a big heave but this time gets an inside edge onto the pads. 17.1 overs (4 Runs) FOUR! Pollard starts the over with a boundary! A perfect start for Mumbai! Length ball, touch fuller, outside off. Kieron Pollard tonks it to deep mid-wicket for a boundary. Avesh Khan is back on. 16.6 overs (2 Runs) Length ball, outside off. Fabian Allen thrashes it to mid off. Jason Holder there does very well to stop the ball from racing away. Saves two runs for his side. 52 needed off 18! 16.5 overs (0 Run) Better from Chameera! Brave delivery this! Full and angling away outside off, Fabian Allen has a big hoick at it but misses. 16.4 overs (1 Run) Dushmantha Chameera comes 'round the wicket and bowls it full, outside off. Kieron Pollard smacks it hard to long on but there is a fielder there and will only get a single. 16.3 overs (6 Runs) SIX! BOOM! Kieron Pollard has arrived and Mumbai are still in this game. Short ball from Dushmantha Chameera, on leg. Kieron Pollard pulls it over long on for another killer blow. Two in two for the big guy. 16.2 overs (6 Runs) SIX! Much-needed for Mumbai! Right in the slot, outside off. Kieron Pollard stands tall and hammers it all the way over long on for a biggie. Mumbai fans are loving this. If anyone can win this game here for Mumbai, it is Pollard! 16.1 overs (1 Run) Fuller in length, on off. Fabian Allen sits back and slams it hard to long off but only for a single. 15.6 overs (1 Run) A low full toss, outside off. Fabian Allen pushes it to deep cover for a run. 68 needed off 24 balls! 15.5 overs (0 Run) Flatter and quicker, outside off. Fabian Allen lets it be. 15.4 overs (4 Runs) FOUR! Off the mark in style! Full and outside off, Fabian Allen reaches out for it and slaps it through covers for a boundary. Fabian Allen comes in. 15.3 overs (0 Run) OUT! TAKEN! A lot of Mumbai's hopes were on Suryakumar Yadav and he has holded out. The required rate was creeping up and Suryakumar Yadav had to go for a big shot. Short ball from Ravi Bishnoi on middle and leg, Suryakumar Yadav hangs back and swivel-pulls it to deep square leg. It's a long side of the boundary and SKY doesn't quite get the distance. Krishnappa Gowtham, the substitute fielder, settles under the ball and takes the catch easily. 15.2 overs (1 Run) Loopy ball, on off. Kieron Pollard mistimes it to deep mid-wicket as his bottom hand comes off. Only a single. 15.1 overs (1 Run) Drops it short and quick, on off. Suryakumar Yadav pulls it to deep mid-wicket for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857333244770016.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Small AB de Villiers Dewald Brevis IPL Price: Is Dewald Brevis son of ABD? What is Dewald Brevis and ABD relation?","link":"https://thesportsrush.com/cricket-news-small-ab-de-villiers-dewald-brevis-ipl-price-is-dewald-brevis-son-of-abd-what-is-dewald-brevis-and-abd-relation/","keywords":["Cricket","IPL 2022","Mumbai Indians","Dewald Brevis"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Small AB de Villiers Dewald Brevis IPL Price: South African Dewald Brevis is playing for Mumbai Indians in IPL 2022. South African U-19 sensation Dewald Brevis proved his class to the world in the ICC U-19 World Cup. South Africa could not perform that well, but they gave a future superstar to cricket in Dewald… The post Small AB de Villiers Dewald Brevis IPL Price: Is Dewald Brevis son of ABD? What is Dewald Brevis and ABD relation? appeared first on The SportsRush.","content":"Small AB de Villiers Dewald Brevis IPL Price: South African Dewald Brevis is playing for Mumbai Indians in IPL 2022. South African U-19 sensation Dewald Brevis proved his class to the world in the ICC U-19 World Cup. South Africa could not perform that well, but they gave a future superstar to cricket in Dewald Brevis. Brevis finished as the highest run-scorer with 506 runs at 84.33, whereas the 2nd highest run-scorer finished with 380 runs. Apart from batting, Brevis also took seven wickets with his leg break bowling. Dewald Brevis proved his class in the IPL 2022 by smashing Rahul Chahar for four consecutive sixes in the game between Mumbai Indians and Punjab Kings. In the game against Lucknow Super Giants, Brevis scored 31 runs in just 13 balls at a strike rate of 238.46. Dewald Brevis smashes 4️⃣6️⃣6️⃣6️⃣6️⃣ pic.twitter.com/5PS9TqAbyB — SA Cricket magazine (@SACricketmag) April 14, 2022 Small AB de Villiers Dewald Brevis IPL Price Dewald Brevis kept his base price at just INR 20 Lacs in the IPL 2022 auction. Chennai Super Kings took no time to begin the proceedings and Punjab Kings also joined them quickly. In no time, the bid reached crores. Mumbai Indians entered late, and they bought Dewald Brevis for INR 3 crores in the auction. Dewald Brevis is an uncapped player and has just played in the U-19 World Cup for South Africa. The bidding war proved that everyone saw something special in the all-rounder from South Africa. Is Dewald Brevis son of ABD? Dewald Brevis is not at all related to AB de Villiers. He is called Baby AB because of the similarity in their gameplay and shot-making. In an interview earlier this year, Dewald said that he is not even close to AB de Villiers. “To be called Baby AB…I don’t even know what to say,” Brevis said. “I am nowhere near what AB de Villiers was. He is a guy I grew up idolising, he was my role model from the first time I watched cricket. But I love being called that, it’s a real honour and surreal.” The post Small AB de Villiers Dewald Brevis IPL Price: Is Dewald Brevis son of ABD? What is Dewald Brevis and ABD relation? appeared first on The SportsRush.","pubDate":"2022-04-16 13:37:03","full_description":"Small AB de Villiers Dewald Brevis IPL Price: South African Dewald Brevis is playing for Mumbai Indians in IPL 2022. South African U-19 sensation Dewald Brevis proved his class to the world in the ICC U-19 World Cup. South Africa could not perform that well, but they gave a future superstar to cricket in Dewald Brevis. Brevis finished as the highest run-scorer with 506 runs at 84.33, whereas the 2nd highest run-scorer finished with 380 runs. Apart from batting, Brevis also took seven wickets with his leg break bowling. Dewald Brevis proved his class in the IPL 2022 by smashing Rahul Chahar for four consecutive sixes in the game between Mumbai Indians and Punjab Kings. In the game against Lucknow Super Giants, Brevis scored 31 runs in just 13 balls at a strike rate of 238.46. Dewald Brevis smashes 4️⃣6️⃣6️⃣6️⃣6️⃣ pic.twitter.com/5PS9TqAbyB — SA Cricket magazine (@SACricketmag) April 14, 2022 Dewald Brevis kept his base price at just INR 20 Lacs in the IPL 2022 auction. Chennai Super Kings took no time to begin the proceedings and Punjab Kings also joined them quickly. In no time, the bid reached crores. Mumbai Indians entered late, and they bought Dewald Brevis for INR 3 crores in the auction. Dewald Brevis is an uncapped player and has just played in the U-19 World Cup for South Africa. The bidding war proved that everyone saw something special in the all-rounder from South Africa. Dewald Brevis is not at all related to AB de Villiers. He is called Baby AB because of the similarity in their gameplay and shot-making. In an interview earlier this year, Dewald said that he is not even close to AB de Villiers. “To be called Baby AB…I don’t even know what to say,” Brevis said. “I am nowhere near what AB de Villiers was. He is a guy I grew up idolising, he was my role model from the first time I watched cricket. But I love being called that, it’s a real honour and surreal.”","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians vs Lucknow Super Giants Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/mumbai-indians-vs-lucknow-super-giants-live-score-over-match-26-t20-11-15-updates-2893509","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Mumbai Indians vs Lucknow Super Giants from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 13:13:55","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.1 overs, Mumbai Indians, chasing a target of 200, are 126/4. The live updates of Mumbai Indians vs Lucknow Super Giants scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Mumbai Indians vs Lucknow Super Giants, Mumbai Indians vs Lucknow Super Giants live score, Mumbai Indians vs Lucknow Super Giants scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (1 Run) A length ball, around off. Yadav goes back and turns it to long on for a run. 75 runs needed from the last five overs. 14.5 overs (1 Run) A short ball, on middle. Pollard uses his feet and pulls it in front of square on the leg side for a single. 14.4 overs (1 Run) Length ball, slower and outside off. Yadav steps down and across to paddle it to deep square leg for a single. 14.3 overs (1 Run) Full ball, on middle. Pollard steps forward and pushes it to long on. One run. The new batter in is Kieron Pollard. 14.2 overs (0 Run) OUT! BOWLED 'EM! Brilliant yorker from Jason Holder and Lucknow break the partnership just when Mumbai were looking to up the ante. A yorker, on middle from 'round the wicket. Varma rocks back and looks to dig it out but is late to get his bat down and the ball ends up shattering the stumps. 14.1 overs (1 Run) A yorker, slanting on middle. Yadav clears his front leg and flicks it behind square on the leg side for a single. 13.6 overs (0 Run) A low full toss, around off. Varma shuffles in his crease and ends up pushing it back to Khan. Just 4 off the over. 13.5 overs (2 Runs) Full and angling from wide of the crease and on the pads. Varma whips it to deep backward square leg for a couple of runs. 13.4 overs (0 Run) Bangs a bouncer now, on middle. Tilak gets low and tries to upper-cut it but misses. 13.3 overs (1 Run) Leg bye! A full toss angling around middle and leg. Yadav looks to flick it but misses and gets hit on the pads. A huge appeal for LBW but nothing given. Might be drifting down. 13.2 overs (1 Run) A low full toss, on off, driven to long on for a single. 13.1 overs (0 Run) Pitches it up and outside off. Varma guides it straight to point. Drinks! Suryakumar Yadav and Tilak Varma have started to shift gears at about right time and the momentum is back with Mumbai. The required rate is still 12 but if these two get going, things can quickly get out of Lucknow's grasp so they will look to break this stand as soon as possible and get the momentum back. Avesh Khan (2-0-18-2) comes back into the attack. 12.6 overs (1 Run) Tossed up, on off, this is hit to deep point for a single. 84 runs needed in 42 balls. 12.5 overs (4 Runs) FOUR! Pierces the gap! Second boundary of the over! Shorter and around off. Varma steps across and punches it hard through extra covers for a boundary. 12.4 overs (1 Run) A single as Yadav works this full ball to deep mid-wicket. 12.3 overs (1 Run) Very full and on leg. Varma tucks it to deep mid-wicket for a single. 12.2 overs (1 Run) A loopy ball, outside off. Yadav drives it to long off for one more. 12.1 overs (4 Runs) FOUR! Mumbai changing the gears now! Beautiful shot this! Tossed up, outside off. Yadav leans and caresses it through covers for a boundary. The stand crosses the 50-run mark now. 11.6 overs (4 Runs) FOUR! 11 runs off the over then! Floated, on middle. Varam looks to reverse sweep it, does not time it well but hits it in the vacant square region on the off side for a boundary. 11.5 overs (1 Run) Drops the pace there and serves it on middle, it is drilled down to long on for one. 100 up as well! 11.4 overs (4 Runs) FOUR! Welcome boundary! Too full and on middle. Yadav heaves it in the gap, between long on and deep mid-wicket for a boundary. 11.3 overs (1 Run) A full toss, from around the wicket, on middle. Varma whips it to deep square leg for a single. 11.2 overs (0 Run) Flighted in the air, on a length and straying outside off. Varma looks to cut but misses. 11.1 overs (1 Run) Flatter and around off. Yadav hangs back and slaps it to deep cover for a single. 10.6 overs (1 Run) Quicker one, sliding around leg. Yadav turns it to deep mid-wicket for one more. 10.5 overs (1 Run) Short, outside off, was the googly. Varma cuts it to deep point for a single. 10.4 overs (1 Run) Tossed up, outside off. Yadav pushes it to long off for a single. 10.3 overs (1 Run) On the pads, flicked to deep mid-wicket for a single. 10.2 overs (2 Runs) Shorter and outside off. Varma looks to cut but bottom edges it to third man. The fielder gives a chase and does well to keep it down to two. 10.1 overs (1 Run) Full and outside off. Yadav going inside-out over covers for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857314264901826.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, MI vs LSG Live Score: IPL 2022 Live: Avesh Khan Ends Dewald Brevis Blitz, Mumbai Indians 2 Down Chasing 200 - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiTmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLW1pLXZzLWxzZy1saXZlLXNjb3JlLXVwZGF0ZXMtMjg5MjgwONIBVGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLW1pLXZzLWxzZy1saXZlLXNjb3JlLXVwZGF0ZXMtMjg5MjgwOC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, MI vs LSG Live Score: IPL 2022 Live: Avesh Khan Ends Dewald Brevis Blitz, Mumbai Indians 2 Down Chasing 200  NDTV SportsMI vs LSG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMI vs LSG Live Score, IPL 2022: Mumbai lose Rohit Sharma early in 200 chase  Hindustan TimesTata IPL 2022 MI vs LSG Live Cricket Score and Update: Brevis attacks after Rohits dismissal  FirstpostThe Punjab Press  CricVizView Full coverage on Google News","content":null,"pubDate":"2022-04-16 12:35:50","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians vs Lucknow Super Giants Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/mumbai-indians-vs-lucknow-super-giants-live-score-over-match-26-t20-6-10-updates-2893406","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Mumbai Indians vs Lucknow Super Giants from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 12:34:07","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 7.5 overs, Mumbai Indians, chasing a target of 200, are 70/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Mumbai Indians and Lucknow Super Giants. Everything related to Mumbai Indians and Lucknow Super Giants match will be available on Sports.NDTV.com . Stay updated with Mumbai Indians vs Lucknow Super Giants live score. Do check for Mumbai Indians vs Lucknow Super Giants scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 7.5 overs (2 Runs) 2 runs. 7.4 overs (2 Runs) 2 runs. 7.4 overs (1 Run) WIDE! Short ball down leg, Suryakumar Yadav leaves it alone. Wided. 7.3 overs (2 Runs) Too full, outside off. Suryakumar Yadav drives it to sweeper cover for a run. The throw is a bit wayward from the deep as the ball goes over Quinton de Kock and the batters take a run off overthrows. 7.2 overs (1 Run) Back of a length, on middle. Tilak Varma looks to nudge but gets a leading edge to backward point. Suryakumar Yadav calls for a single and is halfway down but Tilak Varma is still searching for the ball. He starts his run late but gets to the other end easily. 7.1 overs (0 Run) On a good length, outside off. Tilak Varma cuts it to backward point. Manish Pandey there dives to his left and stops the ball. Excellent fielding from Pandey! Jason Holder is back into the attack. 6.6 overs (2 Runs) Back of a length, down leg. Suryakumar Yadav clips it to fine leg. There is a collision between Krunal Pandya and Ayush Badoni but the good thing is they both are okay. The batters take advantage of this and grab two. 6.5 overs (1 Run) On middle and leg, Tilak Varma tucks it to deep square leg and crosses ends. 6.4 overs (0 Run) Back of a length, on top of off. Tilak Varma gets behind the line and keeps it out. 6.3 overs (2 Runs) On the pads, Tilak Varma clips it off the back foot to deep square leg for a brace. Tilak Varma walks out to the middle. 6.2 overs (0 Run) OUT! TIMBER! Marcus Stoinis strikes in his first over and Lucknow are right on top at the moment. Mumbai's top order has been sent back to the pavilion and it is once again upto the middle order now to bat well. Back-of-a-length ball from Stoinis, outside off. Ishan Kishan hops and looks to work it on the leg side but gets an inside edge and the ball goes on to disturb the stumps. Ishan Kishan is livid with himself as he walks back. Third wicket down for Mumbai! 6.1 overs (0 Run) Back of a length, on middle. Ishan Kishan pats it back to the bowler. Drinks! Lucknow have got rid of Dewald Brevis who was creating some havoc and will now look to just slow things down. Mumbai are off to a good start and now they will once again rely on Yadav to take this game deep. Marcus Stoinis is into the attack. 5.6 overs (0 Run) Length ball, outside off. Suryakumar Yadav slashes it towards covers. End of the Powerplay, Mumbai are 57/2. 5.5 overs (0 Run) OUT! CAUGHT! Avesh Khan gets another wicket and it's of the dangerous Dewald Brevis. He was looking to hit boundary every ball and was looking so dangerous but holes out this time. Avesh Khan bowls a full toss, on leg. Dewald Brevis makes room and sits down on one knee. He looks to smash this one over covers but hits it straight to Deepak Hooda at extra cover who takes a fine catch as the ball was travelling quickly. Lucknow are pumped up and a short but fiery innings from Brevis comes to an end. Suryakumar Yadav is the new batsman in. 5.4 overs (0 Run) Short of a length, outside off, at 137.2 kph. Dewald Brevis looks to pull but misses out on this one. 5.3 overs (4 Runs) FOUR! Another one! He moves into the 30s off just 11 deliveries. Back of a length, outside off. Dewald Brevis stands tall and slaps it past the umpire for a boundary. That went like a bullet. Brevis is turning up the heat here. This is batting of the highest quality. 5.2 overs (4 Runs) FOUR! Dewald Brevis means business! He is only dealing in boundaries. Touch fuller, on off. Dewald Brevis smacks it to deep mid-wicket for a cracking boundary. 5.1 overs (1 Run) On a good length, on off. Ishan Kishan pushes it towards covers for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857290387151616.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians vs Lucknow Super Giants Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/mumbai-indians-vs-lucknow-super-giants-live-score-over-match-26-t20-1-5-updates-2893346","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Mumbai Indians vs Lucknow Super Giants from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 12:31:44","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.2 overs, Mumbai Indians, chasing a target of 200, are 53/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Mumbai Indians and Lucknow Super Giants. Everything related to Mumbai Indians and Lucknow Super Giants match will be available on Sports.NDTV.com . Stay updated with Mumbai Indians vs Lucknow Super Giants live score. Do check for Mumbai Indians vs Lucknow Super Giants scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (4 Runs) FOUR! Brilliant over for Mumbai, 20 runs off the over. Touch fuller and outside off. Brevis charges down the track and slashes it over mid off for yet another boundary. 4.5 overs (4 Runs) FOUR! Superb shot! A length ball, outside off, no pace there. Brevis waits a bit more before punching it through cover-point, through the gap and into the fence. 4.5 overs (5 Runs) FIVE WIDES! Bonus runs! A pacy short ball, on middle. Brevis misses his pull. The keeper leaps but to no avail as it rolls over him and into the fence. 4.4 overs (6 Runs) SIX! Brevis loves to go down the ground! Length and around off. Brevis hangs back, stands tall and thumps it over long on for a biggie. He does not even look at the ball after hitting. 4.3 overs (0 Run) Beauty! A length ball, around off, extra pace there. Brevis looks to defend but misses. The ball bounces over the top of off pole. 4.2 overs (1 Run) A full toss, on middle. Kishan hammers it to deep mid-wicket and will only get a single. 4.1 overs (0 Run) Length ball, on the pads. Kishan pulls it but straight to short fine leg. Change of ends for Dushmantha Chameera. Went for 5 runs in his first over. 3.6 overs (1 Run) This is full and on off, Kishan hits it to long on for a single. 3.5 overs (0 Run) Full and slanting outside off. Ishan drives but finds the cover fielder. 3.4 overs (1 Run) Short again but quicker and on off. Brevis works it to long on for a single. 3.3 overs (0 Run) Length and on off, pushed back to Bishnoi. 3.3 overs (1 Run) Wide! Short and drifting down the leg side. Brevis misses his pull shot. 3.2 overs (4 Runs) FOUR! Edgy runs! Might be the googly, around off. Brevis looks to punch but gets a thick outside edge, wide of first slip and to third man for a boundary. 3.1 overs (1 Run) Tossed up, full and outside off. Kishan leans and pushes it wide of mid off for a run. Ravi Bishnoi is brought into the attack now. He replaces Dushmantha Chameera. 2.6 overs (0 Run) On middle. Brevis pushes it straight to mid on. 2.5 overs (4 Runs) FOUR! Off the mark! A length ball, outside off. Brevis punches it with exclusive timing, through covers for a boundary. Dewald Brevis walks out to bat at No.3. 2.4 overs (0 Run) OUT! CAUGHT BEHIND! A string of low scores continues for Rohit Sharma! This is on a length and outside off. Khan keeps bowling in the same channel and Sharma tries to open the face of the bat and tries to guide it down but gets a faint inside edge to the keeper, Quinton de Kock who takes it low. Avesh Khan gets the breakthrough and Lucknow will look to generate some more pressure. 2.3 overs (0 Run) Around off. Defended to covers. 2.2 overs (4 Runs) FOUR! Lovely shot! A length ball, around off. Rohit Sharma stands on one leg and whips it across to mid-wicket for a boundary. 2.1 overs (0 Run) A good length ball, outside off. Rohit looks to push inside the line but gets beaten on the outside edge. 2.1 overs (1 Run) Wide! A length ball, down the leg side. Sharma misses his flick. Avesh Khan is introduced into the attack. He replaces Jason Holder. 1.6 overs (0 Run) Short of a length and angling on the hips. Kishan looks to pull but misses. 1.5 overs (4 Runs) FOUR! Enough of defense, says Kishan! A length ball, on off. Kishan hits it through the line and past the bowler for a boundary. 1.4 overs (0 Run) Length ball, outside off, good shape there. Kishan tries to ride it behind but misses. 1.3 overs (0 Run) Fuller ball, around off. A flick of wrists from Kishan as he hits it aerially and to mid on. 1.2 overs (1 Run) Pitches it up, on middle. Sharma steps across and pushes it to mid on for a sharp single. 1.1 overs (0 Run) A length ball, just outside off. Sharma covers his stumps and lets it through to the keeper. Dushmantha Chameera to operate from the other end. 0.6 over (0 Run) Short of a length, slower and around off. Kishan hops and drops it to the gully region. No run there. 0.5 over (1 Run) Full, slanting around middle. Sharma bunts it to deep square leg to get off the mark with a single. 0.4 over (1 Run) On the pads, it is tucked to mid-wicket for a single. 0.3 over (0 Run) Length and outside off. Kishan is a touch early as he punches it to covers. 0.2 over (0 Run) Full ball, around off. Kishan leans and pushes it to mid off. 0.1 over (4 Runs) FOUR! Perfect start for Mumbai! On a length and angling on the pads. Kishan looks to defend but it takes the inside edge and beats the diving short fine leg for a boundary.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857288954758062.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"DC vs RCB Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L2RjLXZzLXJjYi1kcmVhbTExLXByZWRpY3Rpb24tZmFudGFzeS1jcmlja2V0LXRpcHMtZHJlYW0xMS10ZWFtLXBsYXlpbmcteGktcGl0Y2gtcmVwb3J0LWluanVyeS11cGRhdGUtdGF0YS1pcGwtMjAyMi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"DC vs RCB Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorDC v RCB, Preview: Game Day | IPL 2022  Royal Challengers Bangalore'It's dangerous. No one will be spared, not even Virat': Akhtar on Kohli's form  Hindustan TimesDelhi Capitals vs Royal Challengers Bangalore Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorCountdown to DC vs RCB - A message from Virat Kohli, Glenn Maxwell & Faf du Plessis  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-04-16 12:01:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians vs Lucknow Super Giants, 26th Match, Indian Premier League 2022 - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vbS5jcmljYnV6ei5jb20vY3JpY2tldC1jb21tZW50YXJ5LzQ2MDExL2xzZy12cy1taS0yNnRoLW1hdGNoLWluZGlhbi1wcmVtaWVyLWxlYWd1ZS0yMDIy0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Mumbai Indians vs Lucknow Super Giants, 26th Match, Indian Premier League 2022  CricbuzzLive match blog - Super Giants vs Mumbai 26th Match 2022 - Cricket Insights  ESPNcricinfo\"Mumbai don't get up from sleep until they lose 5-6 games\"- Shoaib Akhtar predicts MI to bounce back against LSG in IPL 2022  Sportskeeda#MIvLSG, Match 26: Preview  CricbuzzMI vs LSG: \"Mumbai Doesn't Wake Up Until They've Lost 5-6 Games,\" Shoaib Akhtar Anticipates A Comeback For Mumbai Indians  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-16 11:25:43","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Shastri backs RCB to make playoffs","link":"https://www.indiatvnews.com/sports/cricket/shastri-backs-rcb-to-make-playoffs-2022-04-16-770160","keywords":null,"creator":null,"video_url":null,"description":"Former India coach Ravi Shastri is backing Royal Challengers Bangalore to make the playoffs of the ongoing IPL, having played some good cricket under new skipper Faf du Plessis.","content":null,"pubDate":"2022-04-16 11:18:13","full_description":"Former India coach Ravi Shastri is backing Royal Challengers Bangalore to make the playoffs of the ongoing , having played some good cricket under new skipper . After kicking off their campaign with a loss to Punjab Kings, three-time runners-up RCB bounced back to defeat Mumbai Indians, Kolkata Knight Riders and Rajasthan Royals. \"I believe we will see a new champion this season. Royal Challengers Bangalore are on a roll in this IPL and they are definitely going to make it to the playoffs,\" Shastri said. \"They are getting hotter and hotter as the tournament is progressing. They are looking in a good space. They are getting better and better with every game.\" Shastri further added the team's new captain Du Plessis, former skipper and all-rounder are going to play an important role this season. \"Virat has been doing well, Glenn Maxwell is back with the side, and we all know how destructive he can be with the bat. He's capable of taking the spinners to the cleaners and will be important from RCB's perspective as the tournament progresses. And then, Faf being their leader is a big bonus for them.\" RCB's three-match winning streak, though, was halted by Chennai Super Kings in the last game.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians vs Lucknow Super Giants Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/mumbai-indians-vs-lucknow-super-giants-live-score-over-match-26-t20-16-20-updates-2893223","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Mumbai Indians vs Lucknow Super Giants from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-16 11:16:05","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Lucknow Super Giants are 199/4. The live updates of Mumbai Indians vs Lucknow Super Giants scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Mumbai Indians vs Lucknow Super Giants, Mumbai Indians vs Lucknow Super Giants live score, Mumbai Indians vs Lucknow Super Giants scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 19.6 overs (0 Run) Yes he does, excellent finish from Jaydev Unadkat! 19.5 overs (1 Run) A low full toss, on middle. Pandya mistimes his heave to deep mid-wicket for a single. Rahul will be on the strike now and will face the final delivery of Lucknow's innings. Krunal Pandya walks out to bat. 19.4 overs (0 Run) OUT! CAUGHT BEHIND! It's been a good over for Mumbai so far! Short ball, on middle. Hooda tries to ramp it over the keeper but is late to his shot. The ball takes the toe end of his bat and goes to Kishan who pouches it comfortably. 19.3 overs (1 Run) Full and targeting the stumps. Rahul jams it out to long on for one more. 19.2 overs (1 Run) Another yorker, on leg. Hooda digs it out to long on for a single. Another misfield there but does not steal a run. 19.1 overs (1 Run) A yorker to start with, on leg, flicked to mid-wicket for a single. Jaydev Unadkat to bowl the final over. 18.6 overs (1 Run) Leg bye! Slants it on the pads. Rahul fails to flick it and the ball rolls to square leg for a leg bye. 18.5 overs (4 Runs) FOUR! CENTURY FOR KL RAHUL! He loves to play against Mumbai and he shows his KLass once again. 100 in his 100th Indian T20 League game. A length ball, outside off. Rahul cuts it past point for a boundary. A marvelous innings from the skipper and will look to end on a high now. Removes the helmet and takes all the applause from his teammates. 18.5 overs (2 Runs) Two wides! A length ball, angling down the leg side. Hooda misses his pull. The keeper does really well to get a hand on it. A single taken. 18.4 overs (4 Runs) FOUR! Fullish delivery, outside off. Hooda looks to drive hard but slices it over point and the ball races away into the fence. 18.3 overs (6 Runs) SIX! MUSCLED! A length ball, on off. Hooda stands tall and powers it over long on for a maximum. Lucknow surely will target this over and milk from it. 18.2 overs (1 Run) Full ball with lack of pace there. Rahul waits and hits it to long on for a single. 18.1 overs (4 Runs) FOUR! Mills continues to leak runs! Short of a length and outside off. Rahul hangs back and cuts it hard to backward point for a boundary. Tymal Mills (2-0-33-0) comes back on. 17.6 overs (1 Run) Angles a low full toss, on middle, KL pushes it to long on and will keep the strike. 17.5 overs (2 Runs) Full ball, outside off. Rahul smashes it hard to covers where the fielder makes a good stop as that was traveling to the ropes. Two runs taken. 17.5 overs (1 Run) Wide! Outside off. Rahul swings hard but misses. A wide called. 17.4 overs (1 Run) Full and on leg, drilled to long on for a single. 17.3 overs (1 Run) A single as this full ball is hit to long off. 17.3 overs (1 Run) Wide! Full ball, outside off, just near the tramline, Rahul leaves it. A wide given, was a very close call. 17.2 overs (1 Run) Length ball, around off. Hooda miscues his push on the leg side and will only get a single. 17.1 overs (1 Run) Too full and on off, Rahul works it to long on for a single. 16.6 overs (1 Run) Full and on the pads. Rahul whacks it but straight to deep square leg. Times it well but gets only a single. 16.5 overs (1 Run) Slower one, on a length and on leg. Rahul makes room and tucks it behind square on the leg side for a single. 16.4 overs (1 Run) Length and outside off, cut to point for a sharp single. 16.3 overs (4 Runs) FOUR! A full toss, outside off. Rahul smashes it to deep point. Allen at sweeper cover, runs and slides but fumbles to hold onto it. Another misfield from Mumbai. 16.3 overs (1 Run) Wide! Full ball, slanting way outside off. Left alone for a wide. 16.2 overs (1 Run) A length ball from over the wicket and outside off, pushed to long off for a single. Deepak Hooda walks out to bat. 16.1 overs (0 Run) OUT! IN THE AIR AND TAKEN! Just what Mumbai needed! A full ball, angling across, outside off. Stoinis looks to go downtown but toe ends his shot, in the air and to covers where Rohit Sharma takes a sharp catch. Drinks! KL Rahul is batting superbly and Marcus Stoinis will also now look to shift gears in these final four overs. Lucknow are in a good position to get over 200 and anything under that might be disappointing. Mumbai have found it tough so far to contain runs but they need their bowlers to do well at the backend and restrict Lucknow to anything below 200. 15.6 overs (2 Runs) Bumrah misses his line and serves a friendly full toss, it is pushed to long on for a couple of runs. 15.5 overs (1 Run) A quick single! Length ball, outside off. Stoinis punches it to the cover fielder and scampers across for a quick single 15.4 overs (1 Run) A yorker now, on middle. Rahul squeezes it out to mid on for a run. 15.3 overs (1 Run) Length ball, at 126 clicks, outside off. Stoinis looks to push but gets an inside edge to fine leg for a single. 15.2 overs (0 Run) Length ball, slower and on off. Stoinis defends it to mid-wicket. 15.1 overs (0 Run) A full toss, on middle. Stoinis drives it back on the other side of the stumps. Rahul was out of his crease but Bumrah didn't touch the ball.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637857243590016475.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}