{"newsArray":[{"title":"South Africa ignite Women’s T20 World Cup beating New Zealand","link":"https://www.thesouthafrican.com/sport/cricket/south-africa-strike-at-womens-t20-world-cup-beating-new-zealand-13-february-2023/","keywords":["Cricket","Sport","Featured","ICC Women’s T20 World Cup","Important","New Zealand","Proteas"],"creator":["Zareena Gaibee"],"video_url":null,"description":"South Africa bowled New Zealand over and out in Paarl to keep their Women's T20 World Cup dream alive, winning by 65 runs.","content":"South Africa bowled New Zealand over and out in Paarl to keep their Women’s T20 World Cup dream alive, winning by 65 runs. South Africa won the toss and opted to bat first continuing to break the trend of winning the toss and losing the game. ALSO READ: Sri Lanka beat Bangladesh to top pool at Women’s T20 World Cup South Africa set 132/6 South Africa struggled upfront losing wickets early but Chloe Tryon dropped anchor and steadied the ship. She made 40 off 34 and built a substantial partnership with Nadine de Klerk who finished with an unbeaten 28 off 26 deliveries. South Africa ended their innings with 132/6 in this Women’s T20 World Cup. Eden Carson took 2 for 23 runs for New Zealand. Lea Tahuhu picked up 2/27 and Hayley Jensen got 1/13. The fielders also got into the action dislodging the bails with a runout. ALSO READ: Women’s T20 World Cup: Watch from the grass or couch New Zealand getting its ducks in a row For the second game in a row, New Zealand’s openers have gone for ducks. Sophie Devine, traditionally an opener came in lower down the order and top-scored with 16 off 26. Jess Kerr with 11 from 13 balls and Amelia Kerr with 10 off 12 deliveries were the only other players to crack double figures. New Zealand was 67 all out. South Africa’s bowlers came out firing. Wickets and records falling. Nonkululeko Mlaba set the tone with 3/10 . Player of the Match, Chloe Tryon followed up her batting with 2/12 with the ball. Marizanne Kapp took 2/13 and Ayabonga Khaka got 1/9 and a wonderful runout. Shabnim Ismail, who has consistently been the second fastest female bowler in the world, bowled her record-breaking seventh maiden over in Women’s T20 World Cups and ended the innings with 1/7. ALSO READ: New Zealand bowled over by Australia in Women’s T20 World Cup What next? New Zealand travels to Cape Town to take on Bangladesh on Friday, 17 November at 15:00. The hosts, South Africa move to Gqeberha to face current title holders, Australia on Saturday, 18 February at 19:00. CLICK HERE TO READ MORE ARTICLES BY ZAREENA GAIBEE","pubDate":"2023-02-13 20:26:04","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Eoin Morgan tributes and Super Bowl celebrations – Monday’s sporting social","link":"https://www.independent.co.uk/sport/eoin-morgan-england-henry-winkler-cbe-barmy-army-b2281545.html","keywords":["Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Former England captain Morgan announced his retirement from all forms of cricket on Monday.","content":"Sports stars and clubs across the world continue to provide an insight into their lives on social media. Here, the PA news agency looks at some of the best examples from February 13. Eoin Morgan hung up his boots. Stuart Broad got wet. Mark Boucher? Nathan Tella had a weekend to remember. Joey Barton had his say. Borussia Dortmund were looking forward to Chelsea. Not a bad view of the new AlphaTauri. The Kansas City Chiefs celebrated. Eyyyy. Mixed feelings for Donna Kelce and sons.","pubDate":"2023-02-13 20:20:26","image_url":"https://static.independent.co.uk/2023/02/13/20/a30985eaaff9bbe29f1a0321a850e884Y29udGVudHNlYXJjaGFwaSwxNjc2NDA1OTM0-2.70980110.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Heather Knight says unsold England stars remain ‘very valuable’ despite WPL snub","link":"https://www.independent.co.uk/sport/cricket/nat-sciverbrunt-heather-knight-england-challenger-mumbai-indians-b2281515.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"Nat Sciver-Brunt fetched the joint-highest price for an overseas player after being sold for 3.2 crore (about £320,000) to Mumbai Indians.","content":"Heather Knight insists everyone in England’s T20 World Cup squad remains “very valuable”, irrespective of whether they landed a money-spinning deal in the inaugural Women’s Premier League auction. Nat Sciver-Brunt fetched the joint-highest price for an overseas player after being sold for 3.2 crore (about £320,000) to Mumbai Indians , instantly making her one of Britain’s highest-paid sportswomen. Sophie Ecclestone was also the recipient of a six-figure contract, joining England head coach Jon Lewis at Up Warriorz, who bought the world’s top-ranked T20 bowler for 1.8 crore (around £180,000). Knight, Sophia Dunkley, Alice Capsey, Lauren Bell and Issy Wong were picked up too as seven of the 27 English entrants were signed, but the experienced trio of Katherine Sciver-Brunt, Amy Jones and Danni Wyatt were among those unsold. Knight revealed England would rally round anyone who needed support after being overlooked but was adamant their worth in the squad was unaffected as their mission for a T20 World Cup title continued in South Africa on Monday. “I think the whole team will make sure individuals are looked after, that’s really important and what we’re about as a side,” the England captain said after a four-wicket win over Ireland in Paarl. “The value of players to the England team doesn’t change because they haven’t been picked up, they’re still very valuable, everyone in the squad is hugely valuable to us trying to win a World Cup. “They’ll certainly be looked after and given space if needed to obviously deal with anything and try and refocus and get back on it.” Capsey was snapped up by Delhi Capitals for roughly £75,000, Dunkley got a £60,000 payday from Gujarat Giants while Bell and Wong will earn £30,000 apiece for UP Warriorz and Mumbai Indians respectively. Knight initially went unsold but Royal Challengers Bangalore paid her base price of £40,000 – still higher than the top band of contracts in The Hundred women’s competition of £31,250 last year. It was another landmark day for women’s cricket ahead of a tournament that is scheduled to run from March 4-26, with 22 matches in total in a five-team league. “I’m really excited, I think being involved in the inaugural one will be really special,” Knight added. “It’ll be very new, very different. “Any time you get to play overseas in a franchise competition, you get to work with different coaches, play with different players, play in different conditions. “That’s a huge way to learn and to grow your game. I think it’s a huge positive and I’m looking forward to it.” Overseas spots were at a premium but Australia’s Ashleigh Gardner was bought by Gujarat Giants for the same price as Nat Sciver-Brunt, with teams having a budget of £1.2million to spend on a squad of between 15 and 18 players. But New Zealand’s Suzie Bates and Chamari Athapaththu and Sune Luus, captains of Sri Lanka and South Africa respectively, went unsold. India’s Smriti Mandhana was the first to go under the hammer and attracted the most expensive buy, with Royal Challengers Bangalore paying around £340,000 for her services.","pubDate":"2023-02-13 19:34:55","image_url":"https://static.independent.co.uk/2023/02/13/19/caf9b13a4a6cf588f3fbfe2908da269fY29udGVudHNlYXJjaGFwaSwxNjc2NDAxNTEx-2.62565065.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Women Premier League auction | Smriti shines brightest on a watershed day for women cricketers","link":"https://www.thehindu.com/sport/cricket/women-premier-league-auction-mandhana-steals-thunder-as-10-indian-women-get-crore-plus-deals/article66505803.ece","keywords":null,"creator":["\n        P.K. Ajith Kumar  \n    "],"video_url":null,"description":"The five potential captains are Mandhana (RCB), Harmanpreet (MI), Lanning (DC), Beth Mooney (Gujarat Giants) and Deepti Sharma (UP Warriorz).","content":"Up went the paddle from a smiling Nita Ambani’s right hand. The player under the hammer was Smriti Mandhana. The price was ₹50 lakh. The auction for the inaugural Women’s Premier League was underway at the Jio World Convention Centre here on a hot Monday afternoon. Delhi Capitals made a bid for Smriti at ₹55 lakh. But it soon became an intense battle between Ms. Ambani’s Mumbai Indians and Royal Challengers Bangalore. It ended with RCB winning Smirti for a whopping ₹3.4 crore. When you consider the purse available to a franchise, that amount looks even bigger. What the RCB paid for ensuring those elegant drives on the off-side of Smriti was more than a quarter of the ₹12 core purse. The stylish left-handed Indian opener thus ensured that the WPL’s maiden auction got off to a right start — brisk, frenzied. If her high price wasn’t much of a surprise — she is the poster girl of Indian women’s cricket, has a big fan-following and is very much marketable. Australia’s Ashleigh Gardner getting richer by ₹3.2 crore may have surprised some. The all-rounder had only the other day said after taking five for 12 against New Zealand at the on-going World Cup in South Africa that she had dreamt about the WPL auction. She has now got a dream paycheck, too, from Gujarat Giants. England all-rounder Nat Sciver-Brunt was the only other player to go past the ₹3 crore mark. She was bagged by Mumbai Indians for ₹3.2 crore. Four players went for ₹ 2 crore or more – all-rounder Deepti Sharma (₹ 2.6 crore, UP Warriorz), batter Jemimah Rodrigues (₹ 2.2 crore, Delhi Capitals), Australian wicketkeeper-batter Beth Mooney (₹ 2 crore, Gujarat Giants) and opener Shafali Verma (₹ 2 crore, Delhi Capitals). Among the night’s other big Indian winners were pace-bowling all-rounder Pooja Vastrakar (₹1.9 crore, Mumbai Indians), wicketkeeper-batters Richa Ghosh (₹1.9 crore, RCB) and Yastika Bhatia (₹1.5 crore, Mumbai Indians), captain Harmanpreet Kaur (₹1.8 crore, Mumbai Indians) and seamer Renuka Singh (₹1.5 crore, RCB). Leg-spinning all-rounder Devika Vaidya, who recently made a comeback to the Indian team after a long break, turned heads when she was bought by UP Warriorz for ₹1.4 crore. Not surprisingly, the young Indian players from the Under-19 World Cup winning team attracted quite a bit of interest. India’s biggest star in that tournament in South Africa, Shweta Sehrawat, who was the leading scorer, was bought by UP Warriorz for ₹ 40 lakh, against a base price of ₹ 10 lakh. Seamer Titas Sadhu was bagged by Delhi Capitals for ₹ 25 lakh. Senior Indian seamer Meghna Singh was in for a disappointment. Her base price was ₹ 50 lakh and she went unsold. On the same boat were some big stars from overseas. There were no takers for the England trio of Dani Wyatt, Katherine Sciver-Brunt and Amy Jones, Australia’s Alana King and New Zealand’s Suzie Bates, South Africa’s Sune Luus and Sri Lankan Chamari Athapaththu. Of the 449 players that went under the hammer, 87 players were bought, including 30 overseas.","pubDate":"2023-02-13 19:10:01","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL Auction में छाई ये दिग्गज क्रिकेटर्स , इन 5 खिलाड़ियों पर लगी सबसे महंगी बोली","link":"https://sports.ndtv.com/hindi/cricket/domination-of-these-players-in-wpl-auction-know-who-were-the-5-most-expensive-players-3779373#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WPL Auction में उम्मीद के मुताबिक भारत की स्टार महिला क्रिकेटर्स पर जमकर धन वर्षा हुई. लेकिन कुछ विदेशी सितारों पर बड़ी बोलियां लगी.","content":"WPL Auction में ये रहीं 5 सबसे महंगी खिलाड़ी WPL Auction में उम्मीद के मुताबिक भारत की स्टार महिला क्रिकेटर्स पर जमकर धन वर्षा हुई. लेकिन कुछ विदेशी सितारों पर बड़ी बोलियां लगी. स्मृति मंधाना को लेकर पहले से ही जोर-शोर से चर्चा चल रही थी, लेकिन किसी ने भी नहीं सोचा था कि मंधाना पचास लाख के बेस प्राइस से 3.40 करोड़ रुपये तक पहुंचने में कामयाब रहेंगी. बहरहाल, स्मृति पर पैसा छप्पर फाड़कर बरसा भारत की स्टार बैटर और नेशनल क्रश के नाम से मशहूर स्मृति मंधाना WPL की सबसे महंगी खिलाड़ी रही, जिन्हें रॉयल चैलेंजर्स बेंगलुरु ने 3.4 करोड़ की राशि देकर अपने साथ जोड़ा है. बता दें भारत के पूर्व कप्तान और ग्लोबल स्टार विराट कोहली भी आईपीएल के पहले एडिशन से ही आरसीबी का हिस्सा हैं. अब स्मृति मंधाना भी हमें रॉयल चैलेंजर्स बेंगलुरु से खेलती हुई नज़र आएंगी. ऑस्ट्रेलिया की एश्ले गार्डनर WPL ऑक्शन की दूसरी सबसे महंगी खिलाड़ी रहीं. जिन्हें गुजरात जायंट्स ने 3.2 करोड़ में टीम का हिस्सा बनाया है. इंग्लैड की स्टार खिलाड़ी नेट सीवर को 3.2 करोड़ में मुंबई ने अपनी टीम में शामिल किया है और वे इस ऑक्शन की तीसरी सबसे महंगी खिलाड़ी रही. भारत की दिग्गज ऑलराउंडर दीप्ति शर्मा WPL ऑक्शन की चौथी सबसे महंगी खिलाड़ी रहीं. जिन्हें यूपी वॉरियर्स ने 2.6 करोड़ में टीम के साथ जोड़ा है. वहीं ऐतिहासिक WPL ऑक्शन में जेमिमाह रोड्रिग्स को दिल्ली कैपिटल ने 2.2 करोड़ में टीम में शामिल किया है और वे WPL ऑक्शन की पांचवी सबसे महंगी खिलाड़ी रहीं. पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-13 18:51:05","image_url":"https://c.ndtvimg.com/2023-02/99tljgto_wpl-auction-_625x300_13_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"जसिया जैसी कोई.....\" अब दिल्ली की टीम से खेलेगी कश्मीरी की ये जांबाज़ महिला क्रिकेटर","link":"https://sports.ndtv.com/hindi/cricket/someone-like-jasia-now-this-brave-kashmiri-cricketer-will-play-in-the-delhi-team-3779881#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"विमेंस प्रीमियर लीग का सफल ऑक्शन मुंबई में समाप्त हो चुका है. जहां पर 5 टीमों ने कुल 86 खिलाड़ियों को अपनी-अपनी टीम का हिस्सा बनाया. कश्मीर से लेकर कन्याकुमारी तक फैले विशाल भारत देश की जांबाज़ महिला क्रिकेटर्स के अलावा विदेशी खिलाड़ियों पर भी जमकर पैसा बरसा.","content":"बनेंगी WPL में भाग लेने वाली पहली कश्मीरी क्रिकेटर विमेंस प्रीमियर लीग का सफल ऑक्शन मुंबई में समाप्त हो चुका है. जहां पर 5 टीमों ने कुल 86 खिलाड़ियों को अपनी-अपनी टीम का हिस्सा बनाया. कश्मीर से लेकर कन्याकुमारी तक फैले विशाल भारत देश की जांबाज़ महिला क्रिकेटर्स के अलावा विदेशी खिलाड़ियों पर भी जमकर पैसा बरसा. इंडियन कैप्ड प्लेयर्स और स्टार विदेशी प्लेयर्स तो इस ऑक्शन में चर्चा का विषय रहे ही साथ ही साथ कुछ अंडर 19 प्लेयर्स ने भी सुर्खियां बटोरी. वहीं कश्मीर की एक क्रिकेटर जसिया अख्तर भी इस दौरान सभी का ध्यान अपनी ओर खींच रही हैं. कौन हैं जसिया अख्तर और WPL ऑक्शन में उन्हें किस टीम ने कितने रूपये देकर खरीदा है. आइए विस्तार से आपको बताते हैं ये तमाम जानकारियां जसिया अख्तर दरअसल कश्मीर के शोपियां ज़िले के बारीपोरा गांव की रहने वाली हैं. घरेलू क्रिकेट में वे पंजाब क्रिकेट एसोसिएशन से खेल चुकी हैं. वहीं पिछले दो साल से वे राजस्थान से घरेलू क्रिकेट खेल रही हैं. इसके अलावा जसिया विमेंन टी20 चैलेंज की टीम ट्रेलब्लेजर्स और इंडिया रेड के लिए भी खेल चुकी हैं. जसिया दांए हाथ की आक्रामक बल्लेबाज़ हैं और ज़बरदस्त पावर हिटिंग करने में माहिर हैं. इसी को ध्यान में रखते हुए दिल्ली के थिंक टैंक ने उन्हें 10 लाख की राशि खर्च कर टीम के साथ जोड़ा है और सोशल मीडिया पर पोस्ट करते हुए लिखा है कि \" जसिया जैसा कोई नहीं\". Jasia jaisi koi nahi 😁 The is stoked to have you! कश्मीर की रहने वाली इस महिला क्रिकेटर को साल 2017 में इंडिया कैंप के लिए भी बुलावा आया था. हालांकि वे तब भारतीय टीम में जगह नहीं बना पाई थीं. इसके अलावा जसिया भारत की पूर्व कप्तान मिताली राज, मौजूदा कप्तान हरमनप्रीत कौर व दिग्गज गेंदबाज़ झूलन गोस्वामी के साथ भी खेल चुकी हैं. जसिया के अलावा दिल्ली कैपिटल्स ने मेग लेनिंग, जेमिमाह रोड्रग्स और शेफाली वर्मा को भी टीम का हिस्सा बनाया है. महिला प्रीमियर लीग का पहला सीज़न 4 मार्च से 24 मार्च तक मुंबई में खेला जाएगा. पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-13 18:50:36","image_url":"https://c.ndtvimg.com/2023-02/m8qnnir_jasia-akhtar-_625x300_13_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Virat Kohli: तीन साल से बेहद खराब है विराट कोहली का फॉर्म, सिर्फ 26 के औसत से बना रहे हैं रन","link":"https://www.abplive.com/sports/cricket/5-batsmen-with-lowest-test-average-since-2020-including-virat-kohli-just-before-delhi-test-of-border-gavaskar-trophy-2023-2333697","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Virat Kohli Test Average: विराट कोहली की फॉर्म भारतीय क्रिकेट टीम के लिए काफी मायने रखती है, फिर चाहे वो वनडे हो, टी-20 हो या फिर टेस्ट फॉर्मेट ही क्यों न हो. विराट का फॉर्म पिछले कुछ सालों से किसी भी फॉर्मेट में ठीक नहीं चल रहा था. अब वनडे और टी-20 फॉर्मेट में तो उनकी फॉर्म वापस आ गई है, लेकिन टेस्ट क्रिकेट में अभी भी उन्हें एक अच्छे फॉर्म की तलाश है.  भारत ने हाल ही में हुए नागपुर टेस्ट में ऑस्ट्रेलिया को पारी और 132 रनों से हराया था. उस मैच में भारत के लिए कई खिलाड़ियों ने अच्छा प्रदर्शन किया है, लेकिन विराट कोहली का बल्ला नहीं चल पाया. विराट ने बॉर्डर-गावस्कर ट्रॉफी 2023 के पहले मैच में 26 गेंदों में सिर्फ 12 रनों की पारी खेली.  टेस्ट में बहुत कम हुआ विराट का औसत टेस्ट फॉर्मेट में विराट कोहली कितने बुरे फॉर्म से गुजर रहे हैं, इसका एक आंकड़ा हम आपको बताते हैं. हम आपको उन टॉप 5 खिलाड़ियों के बारे में बताते हैं, जिसने 2020 से अब तक में सबसे कम औसत से रन बनाए हैं. इन आंकड़ों में हमने उन बल्लेबाजों को शामिल किया है, जिन्होंने टॉप-7 में बल्लेबाजी करते हुए कम से कम 25 पारियां खेली हैं.  सबसे कम टेस्ट औसत वाले 5 खिलाड़ी इस लिस्ट में सबसे ऊपर वेस्टइंडीज के जेसन होल्डर का नाम है. उन्होंने टेस्ट फॉर्मेट में 2020 से अब तक में सिर्फ 22.83 की औसत से रन बनाए हैं. इस लिस्ट में दूसरे नंबर पर अंजिक्य रहाणे हैं, जिन्होंने 2020 से अब तक में 24.08 की औसत से रन बनाए हैं.  इस लिस्ट में तीसरे नंबर पर वेस्टइंडीज के जॉन कैंपबेल हैं. उन्होंने इस अंतराल में 24.58 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में चौथे नंबर पर विराट कोहली का नाम आता है. विराट ने 2020 से अब तक में सिर्फ 25.80 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में पांचवे नंबर पर इंग्लैंड के रॉरी बर्न्स का नाम है. उन्होंने 2020 से अब तक टेस्ट फॉर्मेट में 27 की औसत से रन बनाए हैं. क्या दिल्ली टेस्ट में वापसी करेंगे विराट? विराट कोहली का औसत तीनों फॉर्मेट में 50 से ऊपर का हुआ करता था, लेकिन अब पहली बार उनका ओवरऑल टेस्ट औसत 48.68 पर आ गया है. इसका कारण 2020 से उनका 25.80 की औसत से रन बनाना ही है. अब देखना होगा कि विराट कोहली ऑस्ट्रेलिया के खिलाफ चल रही मौजूदा बॉर्डर-गावस्कर ट्रॉफी के दूसरे यानी दिल्ली टेस्ट मैच में अपने टेस्ट औसत को सुधार पाते हैं या नहीं. यह भी पढ़ें: IND vs AUS: दिल्ली में पिछले 3 टेस्ट में विराट कोहली के आंकड़े ऑस्ट्रेलिया को देंगे टेंशन, आप भी देखकर हो जाएंगे हैरान","content":"Virat Kohli Test Average: विराट कोहली की फॉर्म भारतीय क्रिकेट टीम के लिए काफी मायने रखती है, फिर चाहे वो वनडे हो, टी-20 हो या फिर टेस्ट फॉर्मेट ही क्यों न हो. विराट का फॉर्म पिछले कुछ सालों से किसी भी फॉर्मेट में ठीक नहीं चल रहा था. अब वनडे और टी-20 फॉर्मेट में तो उनकी फॉर्म वापस आ गई है, लेकिन टेस्ट क्रिकेट में अभी भी उन्हें एक अच्छे फॉर्म की तलाश है. भारत ने हाल ही में हुए नागपुर टेस्ट में ऑस्ट्रेलिया को पारी और 132 रनों से हराया था. उस मैच में भारत के लिए कई खिलाड़ियों ने अच्छा प्रदर्शन किया है, लेकिन विराट कोहली का बल्ला नहीं चल पाया. विराट ने बॉर्डर-गावस्कर ट्रॉफी 2023 के पहले मैच में 26 गेंदों में सिर्फ 12 रनों की पारी खेली. टेस्ट में बहुत कम हुआ विराट का औसत टेस्ट फॉर्मेट में विराट कोहली कितने बुरे फॉर्म से गुजर रहे हैं, इसका एक आंकड़ा हम आपको बताते हैं. हम आपको उन टॉप 5 खिलाड़ियों के बारे में बताते हैं, जिसने 2020 से अब तक में सबसे कम औसत से रन बनाए हैं. इन आंकड़ों में हमने उन बल्लेबाजों को शामिल किया है, जिन्होंने टॉप-7 में बल्लेबाजी करते हुए कम से कम 25 पारियां खेली हैं. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); सबसे कम टेस्ट औसत वाले 5 खिलाड़ी इस लिस्ट में सबसे ऊपर वेस्टइंडीज के जेसन होल्डर का नाम है. उन्होंने टेस्ट फॉर्मेट में 2020 से अब तक में सिर्फ 22.83 की औसत से रन बनाए हैं. इस लिस्ट में दूसरे नंबर पर अंजिक्य रहाणे हैं, जिन्होंने 2020 से अब तक में 24.08 की औसत से रन बनाए हैं. इस लिस्ट में तीसरे नंबर पर वेस्टइंडीज के जॉन कैंपबेल हैं. उन्होंने इस अंतराल में 24.58 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में चौथे नंबर पर विराट कोहली का नाम आता है. विराट ने 2020 से अब तक में सिर्फ 25.80 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में पांचवे नंबर पर इंग्लैंड के रॉरी बर्न्स का नाम है. उन्होंने 2020 से अब तक टेस्ट फॉर्मेट में 27 की औसत से रन बनाए हैं. क्या दिल्ली टेस्ट में वापसी करेंगे विराट? विराट कोहली का औसत तीनों फॉर्मेट में 50 से ऊपर का हुआ करता था, लेकिन अब पहली बार उनका ओवरऑल टेस्ट औसत 48.68 पर आ गया है. इसका कारण 2020 से उनका 25.80 की औसत से रन बनाना ही है. अब देखना होगा कि विराट कोहली ऑस्ट्रेलिया के खिलाफ चल रही मौजूदा बॉर्डर-गावस्कर ट्रॉफी के दूसरे यानी दिल्ली टेस्ट मैच में अपने टेस्ट औसत को सुधार पाते हैं या नहीं. यह भी पढ़ें: IND vs AUS: दिल्ली में पिछले 3 टेस्ट में विराट कोहली के आंकड़े ऑस्ट्रेलिया को देंगे टेंशन, आप भी देखकर हो जाएंगे हैरान","pubDate":"2023-02-13 18:49:58","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/13/1e0ecacc67644405327bdd962c67e3ef1676312967288428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Nitschke: WPL takes whole game forward","link":"https://www.perthnow.com.au/sport/cricket/nitschke-wpl-takes-whole-game-forward-c-9748170","keywords":null,"creator":["Annesha Ghosh"],"video_url":null,"description":"Head coach Shelley Nitschke is convinced the new WPL will only enhance standards among Australia's top players.","content":"Can the WPL further enhance the professionalism in women's cricket in Australia that has been the bedrock to the national team's success? That was the question posed to head coach Shelley Nitschke, who said: \"Look, I think it does. It takes the whole game forward, and we're just a small part of that. \"But it's going to be really exciting to see all the players back playing in India together in another franchise. And WPL is going to take the game to a different level, I think. \"So it's exciting for Australian cricket as it is for cricket all over the world. I think our girls are excited about it, but focused on the job at hand while we're here in South Africa as well.\"","pubDate":"2023-02-13 18:36:09","image_url":"https://images.perthnow.com.au/publication/C-9748170/7160c5d38e2fdbec6c51e17f74dd0945553b1ae4-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"WPL 2023 auction: Gardner, Mooney, Rana make up Gujarat Giants’ strong squad","link":"https://thenewsmill.com/2023/02/wpl-2023-auction-gardner-mooney-rana-make-up-gujarat-giants-strong-squad/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"As the Women’s Premier League gears up for a grand beginning, all the five cricket franchises have finalised their teams at the first-ever player auction, which took place on 13 February in Mumbai. Gujarat Giants owned by Adani Sportsline has signed up an exciting line-up including the likes of Ashleigh Gardner (Rs 3.2 crore), Beth Mooney (Rs 2 crore), Sneh Rana (Rs 75 lakh) and Harleen Deol (Rs 40 lakh). After a heated bidding war, the Gujarat Giants opened their account with the pick of Australian all-rounder Ashleigh Gardner for INR 3.2 crore, the joint second-highest at the Auction. The three-time World Champion has been one of the pillars of strength for Australia and opened her 2023 T20 World Cup with a 5/12 against New Zealand. “This marks a new beginning for all of us associated with the Adani Sportsline-owned Gujarat Giants. My team and I are thrilled to leave the table feeling delighted with the squad we have put together. With all our bases covered, from here onwards we begin our preparation for the upcoming tournament,” said Mithali Raj, mentor, and advisor for Gujarat Giants. Australian Beth Mooney came in for INR 2 crore for the Giants next. The 2-time T20 World Cup winner, Mooney has scored two centuries and 17 fifties in T20Is and has been one of the stars in the Women’s BBL, helping the Brisbane Heat to back-to-back titles in 2018 and 2019, before moving to Perth Scorchers, where she helped them win their first title in 2021-22. The Giants’ first Indian pick was Harleen Deol, whose famous catch at the boundary against England took the cricketing world by storm, is also a solid batter and quite useful with her spin bowling too. She was also part of the Indian team that won Silver at the 2022 Commonwealth Games. “The Gujarat Giants’ squad looks solid for the inaugural edition of the Women’s Premier League. We have an eclectic mix of Indian and international players, all of whom can turn a game on its head single-handedly. As a coach, I will always cherish this auction experience,” said the team’s head coach, Rachael Haynes. The Giants added a plethora of experience when they opened the doors for the West Indies all-rounder Deandra Dottin. The 31-year-old, with more than 100 caps for WI, has played franchise cricket in the UK, Australia and the Caribbean, apart from having turned for the Trailblazers and Supernovas in the Women’s T20 Challenge. Dottin also boasts of best figures of 5/5 and two centuries in T20Is and is one of the stalwarts in the modern game and has played in every edition of the T20 World Cup from 2009 to 2020. The Adani Sportsline Owned Gujarat Giants squad has also brought in some very talented Indian players like Mansi Joshi, Dayalan Hemalatha, Sushma Verma and Tanuja Kanwer of whom have had significant performances in domestic cricket. Meanwhile, the squad also features the exciting 16-year-old all-rounder Hurley Gala, who was coached by Jemimah Rodrigues’ father in Mumbai and was also part of the Indian U-19 side that won the T20 World Cup in 2023 January in South Africa. “The Gujarat Giants’ squad is quite a well-balanced one and we have a strong set of young Indian players, who are waiting to write their names in the history books of the sport in this country. The youngsters will definitely benefit a lot from being around some of the best international cricketers, and we hope this process helps us unearth legends of the future,” said Nooshin Al Khadeer, Bowling Coach of the Gujarat Giants team. The Gujarat Giants team ended the evening having assembled a strong and well-balanced squad of 18 players with 12 Indian and six overseas players. The team has four Australian players, one from England and another from West Indies. “As our first foray into the Women’s Premier League, the Gujarat Giants’ squad has the potential to leave an indelible mark on the matches ahead. The Giants have some of the finest coaches and mentors on board to ensure that the team carves a niche for themselves. As the eventful auction has come to an end, I’m really looking forward to the games,” said Satyam Trivedi, Head, Adani Sportsline. The Gujarat Giants team is mentored by legendary cricketer Mithali Raj and has six-time world champion Rachael Haynes as the head coach. Nooshin Al Khadeer, coach of the Indian U-19 women’s team that won the 2023 U-19 World Cup, is the bowling coach while all-rounder Tushar Arothe as their batting coach and Gavan Twining will be the fielding coach. The inaugural edition of the Women’s Premier League will commence in Mumbai from March 4 – March 26, 2023. A total of 22 matches will be played at the Brabourne Stadium and at the D.Y. Patil Stadium. Gujarat Giants Squad: Ashleigh Gardner (3.2 Cr), Beth Mooney (2 Cr), Sophia Dunkley (60 Lakhs), Annabel Sutherland (70 Lakhs), Harleen Deol (40 Lakhs), Deandra Dottin (60 Lakhs), Sneh Rana (75 Lakh), S Meghana (30 Lakhs), Georgia Wareham (75 Lakhs), Mansi Joshi (30 Lakhs), Dayalan Hemalatha (30 lakhs), Monica Patel (30 lakhs), Tanuja Kanwer (50 lakhs), Sushma Verma (60 Lakhs), Hurley Gala (10 Lakhs), Ashwani Kumari (35 Lakhs), Parunika Sisodia (10 Lakhs), Shabnam Shakil (10 Lakhs). (ANI)","pubDate":"2023-02-13 18:31:17","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL Auction 2023: 4, 4, 4.. तीन लगातार चौके, और ऋचा घोष के दाम छू गए आसमान, जमकर बरसा पैसा","link":"https://sports.ndtv.com/hindi/cricket/wpl-auction-2023-4-4-4-three-consecutive-fours-and-richa-ghosh-price-got-too-high-in-auction-3779096#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WPL Auction 2023: पाकिस्तान के खिलाफ रविवार को ऋचा घोष (Richa Ghosh) ने ऐसा प्रदर्शन किया, जो नीलामी में उनका भला करा गया.","content":"WPL Auction 2023: ऋचा घोष WPL की आकर्षक खिलाड़ियों में से एक होने जा रही हैं कभी-कभी कुछ बातों की टाइमिंग इतनी सधी हुयी होती कि मानो उससे अच्छा कुछ हो नहीं सकता था. और कुछ ऐसा ही भारतीय टी20 विश्व कप टीम (Women T20 World Cup) टीम की विकेटकीपर ऋचा घोष (Richa Ghosh) के साथ सोमवार को वीमेंस प्रीमियर लीग (WPL 2023) में हुआ. इसमें कोई दो राय नहीं कि ऋचा घोष टीम इंडिया की आतिशी बल्लेबाजों में शुमार हो चली हैं, लेकिन विश्व में पाकिस्तान के खिलाफ यादगार जीत में उनके बल्ले से निकला यादगार प्रदर्शन नीलामी के ठीक एक दिन पहले निकला, तो ऑक्शन में उनके प्राइस की टीआरपी भी बहुत ऊंची चली गयी. हालांकि, पाकिस्तान के खिलाफ 20 गेंदों पर नाबाद 31 रन की पारी के बाद पंडित उम्मीद कर रहे थे कि ऋचा की कीमत तीन करोड़ के पार भी जा सकती है. बहरहाल, यह पाकिस्तान के खिलाफ 18वां शुरू होने से पहले मैच की कहानी कुछ और थी. यहां से भारत को 18 गेंदों पर जीत के लिए 28 रन की दरकार थी. 18वां ओवर लेकर आयी आइमन अमीन और पहली ही गेंद पर जेमिमा ने एक रन लिया, लेकिन अगली तीन गेंदों पर रचा घोष पाकिस्तानी गेंदबाज पर बुरी तरह से टूट पड़ीं. दो कट ऐसे लगाए कि मानो कुल्हाड़ी से कोई पेड़ काट रही हों! और इन तीन लगातार चौकों का असर यह रहा कि भारत के सिर पर मंडरा रहे दबाव रूपी बादल एकदम से गायब हो गए. आगे का काम जेमिना ने अगले ही ओवर में कर दिया, लेकिन इन तीन चौकों का असर वीमेन आईपीएल नीलामी में सोमवार को देखने को साफ मिला. ऋचा घोष के लिए फ्रेंचाइजी टीमों के बीच जमकर रेस चली. आखिर में बाजी हाथ लगी आरसीबी ने और इसके लिए ऋचा को सालाना 1.90 करोड़ रुपये मिलेंगे. वास्तव में अगर नीलामी में ऋचा का नाम शुरुआती राउंड में आता, तो निश्चित तौर पर उन्हें और ज्यादा पैसे मिलते, लेकिन वह मर्की खिलाड़ियों में शामिल नहीं थी. कुल मिलाकर पाकिस्तान के खिलाफ मिली बेहतरीन जीत में 50 लाख के बेस प्राइस वाली ऋचा के लगातार तीन चौकों ने नीलामी में पूरा रंग दिखाया और वह करोड़पति खिलाड़ियों में शामिल हो गयीं. VIDEO: बाकी वीडियो देखने के लिए हमारा चैनल करें पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-13 18:21:20","image_url":"https://c.ndtvimg.com/2020-03/bb7ejauo_richa-ghosh_625x300_30_March_20.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"South Africa ignite Women’s T20 World Cup beating New Zealand","link":"https://www.thesouthafrican.com/sport/cricket/south-africa-strike-at-womens-t20-world-cup-beating-new-zealand-13-february-2023/","keywords":["Cricket","Sport","Featured","ICC Women’s T20 World Cup","Important","New Zealand","Proteas"],"creator":["Zareena Gaibee"],"video_url":null,"description":"South Africa bowled New Zealand over and out in Paarl to keep their Women's T20 World Cup dream alive, winning by 65 runs.","content":"South Africa bowled New Zealand over and out in Paarl to keep their Women’s T20 World Cup dream alive, winning by 65 runs. South Africa won the toss and opted to bat first continuing to break the trend of winning the toss and losing the game. ALSO READ: Sri Lanka beat Bangladesh to top pool at Women’s T20 World Cup South Africa set 132/6 South Africa struggled upfront losing wickets early but Chloe Tryon dropped anchor and steadied the ship. She made 40 off 34 and built a substantial partnership with Nadine de Klerk who finished with an unbeaten 28 off 26 deliveries. South Africa ended their innings with 132/6 in this Women’s T20 World Cup. Eden Carson took 2 for 23 runs for New Zealand. Lea Tahuhu picked up 2/27 and Hayley Jensen got 1/13. The fielders also got into the action dislodging the bails with a runout. ALSO READ: Women’s T20 World Cup: Watch from the grass or couch New Zealand getting its ducks in a row For the second game in a row, New Zealand’s openers have gone for ducks. Sophie Devine, traditionally an opener came in lower down the order and top-scored with 16 off 26. Jess Kerr with 11 from 13 balls and Amelia Kerr with 10 off 12 deliveries were the only other players to crack double figures. New Zealand was 67 all out. South Africa’s bowlers came out firing. Wickets and records falling. Nonkululeko Mlaba set the tone with 3/10 . Player of the Match, Chloe Tryon followed up her batting with 2/12 with the ball. Marizanne Kapp took 2/13 and Ayabonga Khaka got 1/9 and a wonderful runout. Shabnim Ismail, who has consistently been the second fastest female bowler in the world, bowled her record-breaking seventh maiden over in Women’s T20 World Cups and ended the innings with 1/7. ALSO READ: New Zealand bowled over by Australia in Women’s T20 World Cup What next? New Zealand travels to Cape Town to take on Bangladesh on Friday, 17 November at 15:00. The hosts, South Africa move to Gqeberha to face current title holders, Australia on Saturday, 18 February at 19:00. CLICK HERE TO READ MORE ARTICLES BY ZAREENA GAIBEE","pubDate":"2023-02-13 20:26:04","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Eoin Morgan tributes and Super Bowl celebrations – Monday’s sporting social","link":"https://www.independent.co.uk/sport/eoin-morgan-england-henry-winkler-cbe-barmy-army-b2281545.html","keywords":["Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Former England captain Morgan announced his retirement from all forms of cricket on Monday.","content":"Sports stars and clubs across the world continue to provide an insight into their lives on social media. Here, the PA news agency looks at some of the best examples from February 13. Eoin Morgan hung up his boots. Stuart Broad got wet. Mark Boucher? Nathan Tella had a weekend to remember. Joey Barton had his say. Borussia Dortmund were looking forward to Chelsea. Not a bad view of the new AlphaTauri. The Kansas City Chiefs celebrated. Eyyyy. Mixed feelings for Donna Kelce and sons.","pubDate":"2023-02-13 20:20:26","image_url":"https://static.independent.co.uk/2023/02/13/20/a30985eaaff9bbe29f1a0321a850e884Y29udGVudHNlYXJjaGFwaSwxNjc2NDA1OTM0-2.70980110.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Heather Knight says unsold England stars remain ‘very valuable’ despite WPL snub","link":"https://www.independent.co.uk/sport/cricket/nat-sciverbrunt-heather-knight-england-challenger-mumbai-indians-b2281515.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"Nat Sciver-Brunt fetched the joint-highest price for an overseas player after being sold for 3.2 crore (about £320,000) to Mumbai Indians.","content":"Heather Knight insists everyone in England’s T20 World Cup squad remains “very valuable”, irrespective of whether they landed a money-spinning deal in the inaugural Women’s Premier League auction. Nat Sciver-Brunt fetched the joint-highest price for an overseas player after being sold for 3.2 crore (about £320,000) to Mumbai Indians , instantly making her one of Britain’s highest-paid sportswomen. Sophie Ecclestone was also the recipient of a six-figure contract, joining England head coach Jon Lewis at Up Warriorz, who bought the world’s top-ranked T20 bowler for 1.8 crore (around £180,000). Knight, Sophia Dunkley, Alice Capsey, Lauren Bell and Issy Wong were picked up too as seven of the 27 English entrants were signed, but the experienced trio of Katherine Sciver-Brunt, Amy Jones and Danni Wyatt were among those unsold. Knight revealed England would rally round anyone who needed support after being overlooked but was adamant their worth in the squad was unaffected as their mission for a T20 World Cup title continued in South Africa on Monday. “I think the whole team will make sure individuals are looked after, that’s really important and what we’re about as a side,” the England captain said after a four-wicket win over Ireland in Paarl. “The value of players to the England team doesn’t change because they haven’t been picked up, they’re still very valuable, everyone in the squad is hugely valuable to us trying to win a World Cup. “They’ll certainly be looked after and given space if needed to obviously deal with anything and try and refocus and get back on it.” Capsey was snapped up by Delhi Capitals for roughly £75,000, Dunkley got a £60,000 payday from Gujarat Giants while Bell and Wong will earn £30,000 apiece for UP Warriorz and Mumbai Indians respectively. Knight initially went unsold but Royal Challengers Bangalore paid her base price of £40,000 – still higher than the top band of contracts in The Hundred women’s competition of £31,250 last year. It was another landmark day for women’s cricket ahead of a tournament that is scheduled to run from March 4-26, with 22 matches in total in a five-team league. “I’m really excited, I think being involved in the inaugural one will be really special,” Knight added. “It’ll be very new, very different. “Any time you get to play overseas in a franchise competition, you get to work with different coaches, play with different players, play in different conditions. “That’s a huge way to learn and to grow your game. I think it’s a huge positive and I’m looking forward to it.” Overseas spots were at a premium but Australia’s Ashleigh Gardner was bought by Gujarat Giants for the same price as Nat Sciver-Brunt, with teams having a budget of £1.2million to spend on a squad of between 15 and 18 players. But New Zealand’s Suzie Bates and Chamari Athapaththu and Sune Luus, captains of Sri Lanka and South Africa respectively, went unsold. India’s Smriti Mandhana was the first to go under the hammer and attracted the most expensive buy, with Royal Challengers Bangalore paying around £340,000 for her services.","pubDate":"2023-02-13 19:34:55","image_url":"https://static.independent.co.uk/2023/02/13/19/caf9b13a4a6cf588f3fbfe2908da269fY29udGVudHNlYXJjaGFwaSwxNjc2NDAxNTEx-2.62565065.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Women Premier League auction | Smriti shines brightest on a watershed day for women cricketers","link":"https://www.thehindu.com/sport/cricket/women-premier-league-auction-mandhana-steals-thunder-as-10-indian-women-get-crore-plus-deals/article66505803.ece","keywords":null,"creator":["\n        P.K. Ajith Kumar  \n    "],"video_url":null,"description":"The five potential captains are Mandhana (RCB), Harmanpreet (MI), Lanning (DC), Beth Mooney (Gujarat Giants) and Deepti Sharma (UP Warriorz).","content":"Up went the paddle from a smiling Nita Ambani’s right hand. The player under the hammer was Smriti Mandhana. The price was ₹50 lakh. The auction for the inaugural Women’s Premier League was underway at the Jio World Convention Centre here on a hot Monday afternoon. Delhi Capitals made a bid for Smriti at ₹55 lakh. But it soon became an intense battle between Ms. Ambani’s Mumbai Indians and Royal Challengers Bangalore. It ended with RCB winning Smirti for a whopping ₹3.4 crore. When you consider the purse available to a franchise, that amount looks even bigger. What the RCB paid for ensuring those elegant drives on the off-side of Smriti was more than a quarter of the ₹12 core purse. The stylish left-handed Indian opener thus ensured that the WPL’s maiden auction got off to a right start — brisk, frenzied. If her high price wasn’t much of a surprise — she is the poster girl of Indian women’s cricket, has a big fan-following and is very much marketable. Australia’s Ashleigh Gardner getting richer by ₹3.2 crore may have surprised some. The all-rounder had only the other day said after taking five for 12 against New Zealand at the on-going World Cup in South Africa that she had dreamt about the WPL auction. She has now got a dream paycheck, too, from Gujarat Giants. England all-rounder Nat Sciver-Brunt was the only other player to go past the ₹3 crore mark. She was bagged by Mumbai Indians for ₹3.2 crore. Four players went for ₹ 2 crore or more – all-rounder Deepti Sharma (₹ 2.6 crore, UP Warriorz), batter Jemimah Rodrigues (₹ 2.2 crore, Delhi Capitals), Australian wicketkeeper-batter Beth Mooney (₹ 2 crore, Gujarat Giants) and opener Shafali Verma (₹ 2 crore, Delhi Capitals). Among the night’s other big Indian winners were pace-bowling all-rounder Pooja Vastrakar (₹1.9 crore, Mumbai Indians), wicketkeeper-batters Richa Ghosh (₹1.9 crore, RCB) and Yastika Bhatia (₹1.5 crore, Mumbai Indians), captain Harmanpreet Kaur (₹1.8 crore, Mumbai Indians) and seamer Renuka Singh (₹1.5 crore, RCB). Leg-spinning all-rounder Devika Vaidya, who recently made a comeback to the Indian team after a long break, turned heads when she was bought by UP Warriorz for ₹1.4 crore. Not surprisingly, the young Indian players from the Under-19 World Cup winning team attracted quite a bit of interest. India’s biggest star in that tournament in South Africa, Shweta Sehrawat, who was the leading scorer, was bought by UP Warriorz for ₹ 40 lakh, against a base price of ₹ 10 lakh. Seamer Titas Sadhu was bagged by Delhi Capitals for ₹ 25 lakh. Senior Indian seamer Meghna Singh was in for a disappointment. Her base price was ₹ 50 lakh and she went unsold. On the same boat were some big stars from overseas. There were no takers for the England trio of Dani Wyatt, Katherine Sciver-Brunt and Amy Jones, Australia’s Alana King and New Zealand’s Suzie Bates, South Africa’s Sune Luus and Sri Lankan Chamari Athapaththu. Of the 449 players that went under the hammer, 87 players were bought, including 30 overseas.","pubDate":"2023-02-13 19:10:01","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL Auction में छाई ये दिग्गज क्रिकेटर्स , इन 5 खिलाड़ियों पर लगी सबसे महंगी बोली","link":"https://sports.ndtv.com/hindi/cricket/domination-of-these-players-in-wpl-auction-know-who-were-the-5-most-expensive-players-3779373#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WPL Auction में उम्मीद के मुताबिक भारत की स्टार महिला क्रिकेटर्स पर जमकर धन वर्षा हुई. लेकिन कुछ विदेशी सितारों पर बड़ी बोलियां लगी.","content":"WPL Auction में ये रहीं 5 सबसे महंगी खिलाड़ी WPL Auction में उम्मीद के मुताबिक भारत की स्टार महिला क्रिकेटर्स पर जमकर धन वर्षा हुई. लेकिन कुछ विदेशी सितारों पर बड़ी बोलियां लगी. स्मृति मंधाना को लेकर पहले से ही जोर-शोर से चर्चा चल रही थी, लेकिन किसी ने भी नहीं सोचा था कि मंधाना पचास लाख के बेस प्राइस से 3.40 करोड़ रुपये तक पहुंचने में कामयाब रहेंगी. बहरहाल, स्मृति पर पैसा छप्पर फाड़कर बरसा भारत की स्टार बैटर और नेशनल क्रश के नाम से मशहूर स्मृति मंधाना WPL की सबसे महंगी खिलाड़ी रही, जिन्हें रॉयल चैलेंजर्स बेंगलुरु ने 3.4 करोड़ की राशि देकर अपने साथ जोड़ा है. बता दें भारत के पूर्व कप्तान और ग्लोबल स्टार विराट कोहली भी आईपीएल के पहले एडिशन से ही आरसीबी का हिस्सा हैं. अब स्मृति मंधाना भी हमें रॉयल चैलेंजर्स बेंगलुरु से खेलती हुई नज़र आएंगी. ऑस्ट्रेलिया की एश्ले गार्डनर WPL ऑक्शन की दूसरी सबसे महंगी खिलाड़ी रहीं. जिन्हें गुजरात जायंट्स ने 3.2 करोड़ में टीम का हिस्सा बनाया है. इंग्लैड की स्टार खिलाड़ी नेट सीवर को 3.2 करोड़ में मुंबई ने अपनी टीम में शामिल किया है और वे इस ऑक्शन की तीसरी सबसे महंगी खिलाड़ी रही. भारत की दिग्गज ऑलराउंडर दीप्ति शर्मा WPL ऑक्शन की चौथी सबसे महंगी खिलाड़ी रहीं. जिन्हें यूपी वॉरियर्स ने 2.6 करोड़ में टीम के साथ जोड़ा है. वहीं ऐतिहासिक WPL ऑक्शन में जेमिमाह रोड्रिग्स को दिल्ली कैपिटल ने 2.2 करोड़ में टीम में शामिल किया है और वे WPL ऑक्शन की पांचवी सबसे महंगी खिलाड़ी रहीं. पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-13 18:51:05","image_url":"https://c.ndtvimg.com/2023-02/99tljgto_wpl-auction-_625x300_13_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"जसिया जैसी कोई.....\" अब दिल्ली की टीम से खेलेगी कश्मीरी की ये जांबाज़ महिला क्रिकेटर","link":"https://sports.ndtv.com/hindi/cricket/someone-like-jasia-now-this-brave-kashmiri-cricketer-will-play-in-the-delhi-team-3779881#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"विमेंस प्रीमियर लीग का सफल ऑक्शन मुंबई में समाप्त हो चुका है. जहां पर 5 टीमों ने कुल 86 खिलाड़ियों को अपनी-अपनी टीम का हिस्सा बनाया. कश्मीर से लेकर कन्याकुमारी तक फैले विशाल भारत देश की जांबाज़ महिला क्रिकेटर्स के अलावा विदेशी खिलाड़ियों पर भी जमकर पैसा बरसा.","content":"बनेंगी WPL में भाग लेने वाली पहली कश्मीरी क्रिकेटर विमेंस प्रीमियर लीग का सफल ऑक्शन मुंबई में समाप्त हो चुका है. जहां पर 5 टीमों ने कुल 86 खिलाड़ियों को अपनी-अपनी टीम का हिस्सा बनाया. कश्मीर से लेकर कन्याकुमारी तक फैले विशाल भारत देश की जांबाज़ महिला क्रिकेटर्स के अलावा विदेशी खिलाड़ियों पर भी जमकर पैसा बरसा. इंडियन कैप्ड प्लेयर्स और स्टार विदेशी प्लेयर्स तो इस ऑक्शन में चर्चा का विषय रहे ही साथ ही साथ कुछ अंडर 19 प्लेयर्स ने भी सुर्खियां बटोरी. वहीं कश्मीर की एक क्रिकेटर जसिया अख्तर भी इस दौरान सभी का ध्यान अपनी ओर खींच रही हैं. कौन हैं जसिया अख्तर और WPL ऑक्शन में उन्हें किस टीम ने कितने रूपये देकर खरीदा है. आइए विस्तार से आपको बताते हैं ये तमाम जानकारियां जसिया अख्तर दरअसल कश्मीर के शोपियां ज़िले के बारीपोरा गांव की रहने वाली हैं. घरेलू क्रिकेट में वे पंजाब क्रिकेट एसोसिएशन से खेल चुकी हैं. वहीं पिछले दो साल से वे राजस्थान से घरेलू क्रिकेट खेल रही हैं. इसके अलावा जसिया विमेंन टी20 चैलेंज की टीम ट्रेलब्लेजर्स और इंडिया रेड के लिए भी खेल चुकी हैं. जसिया दांए हाथ की आक्रामक बल्लेबाज़ हैं और ज़बरदस्त पावर हिटिंग करने में माहिर हैं. इसी को ध्यान में रखते हुए दिल्ली के थिंक टैंक ने उन्हें 10 लाख की राशि खर्च कर टीम के साथ जोड़ा है और सोशल मीडिया पर पोस्ट करते हुए लिखा है कि \" जसिया जैसा कोई नहीं\". Jasia jaisi koi nahi 😁 The is stoked to have you! कश्मीर की रहने वाली इस महिला क्रिकेटर को साल 2017 में इंडिया कैंप के लिए भी बुलावा आया था. हालांकि वे तब भारतीय टीम में जगह नहीं बना पाई थीं. इसके अलावा जसिया भारत की पूर्व कप्तान मिताली राज, मौजूदा कप्तान हरमनप्रीत कौर व दिग्गज गेंदबाज़ झूलन गोस्वामी के साथ भी खेल चुकी हैं. जसिया के अलावा दिल्ली कैपिटल्स ने मेग लेनिंग, जेमिमाह रोड्रग्स और शेफाली वर्मा को भी टीम का हिस्सा बनाया है. महिला प्रीमियर लीग का पहला सीज़न 4 मार्च से 24 मार्च तक मुंबई में खेला जाएगा. पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-13 18:50:36","image_url":"https://c.ndtvimg.com/2023-02/m8qnnir_jasia-akhtar-_625x300_13_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Virat Kohli: तीन साल से बेहद खराब है विराट कोहली का फॉर्म, सिर्फ 26 के औसत से बना रहे हैं रन","link":"https://www.abplive.com/sports/cricket/5-batsmen-with-lowest-test-average-since-2020-including-virat-kohli-just-before-delhi-test-of-border-gavaskar-trophy-2023-2333697","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Virat Kohli Test Average: विराट कोहली की फॉर्म भारतीय क्रिकेट टीम के लिए काफी मायने रखती है, फिर चाहे वो वनडे हो, टी-20 हो या फिर टेस्ट फॉर्मेट ही क्यों न हो. विराट का फॉर्म पिछले कुछ सालों से किसी भी फॉर्मेट में ठीक नहीं चल रहा था. अब वनडे और टी-20 फॉर्मेट में तो उनकी फॉर्म वापस आ गई है, लेकिन टेस्ट क्रिकेट में अभी भी उन्हें एक अच्छे फॉर्म की तलाश है.  भारत ने हाल ही में हुए नागपुर टेस्ट में ऑस्ट्रेलिया को पारी और 132 रनों से हराया था. उस मैच में भारत के लिए कई खिलाड़ियों ने अच्छा प्रदर्शन किया है, लेकिन विराट कोहली का बल्ला नहीं चल पाया. विराट ने बॉर्डर-गावस्कर ट्रॉफी 2023 के पहले मैच में 26 गेंदों में सिर्फ 12 रनों की पारी खेली.  टेस्ट में बहुत कम हुआ विराट का औसत टेस्ट फॉर्मेट में विराट कोहली कितने बुरे फॉर्म से गुजर रहे हैं, इसका एक आंकड़ा हम आपको बताते हैं. हम आपको उन टॉप 5 खिलाड़ियों के बारे में बताते हैं, जिसने 2020 से अब तक में सबसे कम औसत से रन बनाए हैं. इन आंकड़ों में हमने उन बल्लेबाजों को शामिल किया है, जिन्होंने टॉप-7 में बल्लेबाजी करते हुए कम से कम 25 पारियां खेली हैं.  सबसे कम टेस्ट औसत वाले 5 खिलाड़ी इस लिस्ट में सबसे ऊपर वेस्टइंडीज के जेसन होल्डर का नाम है. उन्होंने टेस्ट फॉर्मेट में 2020 से अब तक में सिर्फ 22.83 की औसत से रन बनाए हैं. इस लिस्ट में दूसरे नंबर पर अंजिक्य रहाणे हैं, जिन्होंने 2020 से अब तक में 24.08 की औसत से रन बनाए हैं.  इस लिस्ट में तीसरे नंबर पर वेस्टइंडीज के जॉन कैंपबेल हैं. उन्होंने इस अंतराल में 24.58 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में चौथे नंबर पर विराट कोहली का नाम आता है. विराट ने 2020 से अब तक में सिर्फ 25.80 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में पांचवे नंबर पर इंग्लैंड के रॉरी बर्न्स का नाम है. उन्होंने 2020 से अब तक टेस्ट फॉर्मेट में 27 की औसत से रन बनाए हैं. क्या दिल्ली टेस्ट में वापसी करेंगे विराट? विराट कोहली का औसत तीनों फॉर्मेट में 50 से ऊपर का हुआ करता था, लेकिन अब पहली बार उनका ओवरऑल टेस्ट औसत 48.68 पर आ गया है. इसका कारण 2020 से उनका 25.80 की औसत से रन बनाना ही है. अब देखना होगा कि विराट कोहली ऑस्ट्रेलिया के खिलाफ चल रही मौजूदा बॉर्डर-गावस्कर ट्रॉफी के दूसरे यानी दिल्ली टेस्ट मैच में अपने टेस्ट औसत को सुधार पाते हैं या नहीं. यह भी पढ़ें: IND vs AUS: दिल्ली में पिछले 3 टेस्ट में विराट कोहली के आंकड़े ऑस्ट्रेलिया को देंगे टेंशन, आप भी देखकर हो जाएंगे हैरान","content":"Virat Kohli Test Average: विराट कोहली की फॉर्म भारतीय क्रिकेट टीम के लिए काफी मायने रखती है, फिर चाहे वो वनडे हो, टी-20 हो या फिर टेस्ट फॉर्मेट ही क्यों न हो. विराट का फॉर्म पिछले कुछ सालों से किसी भी फॉर्मेट में ठीक नहीं चल रहा था. अब वनडे और टी-20 फॉर्मेट में तो उनकी फॉर्म वापस आ गई है, लेकिन टेस्ट क्रिकेट में अभी भी उन्हें एक अच्छे फॉर्म की तलाश है. भारत ने हाल ही में हुए नागपुर टेस्ट में ऑस्ट्रेलिया को पारी और 132 रनों से हराया था. उस मैच में भारत के लिए कई खिलाड़ियों ने अच्छा प्रदर्शन किया है, लेकिन विराट कोहली का बल्ला नहीं चल पाया. विराट ने बॉर्डर-गावस्कर ट्रॉफी 2023 के पहले मैच में 26 गेंदों में सिर्फ 12 रनों की पारी खेली. टेस्ट में बहुत कम हुआ विराट का औसत टेस्ट फॉर्मेट में विराट कोहली कितने बुरे फॉर्म से गुजर रहे हैं, इसका एक आंकड़ा हम आपको बताते हैं. हम आपको उन टॉप 5 खिलाड़ियों के बारे में बताते हैं, जिसने 2020 से अब तक में सबसे कम औसत से रन बनाए हैं. इन आंकड़ों में हमने उन बल्लेबाजों को शामिल किया है, जिन्होंने टॉप-7 में बल्लेबाजी करते हुए कम से कम 25 पारियां खेली हैं. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); सबसे कम टेस्ट औसत वाले 5 खिलाड़ी इस लिस्ट में सबसे ऊपर वेस्टइंडीज के जेसन होल्डर का नाम है. उन्होंने टेस्ट फॉर्मेट में 2020 से अब तक में सिर्फ 22.83 की औसत से रन बनाए हैं. इस लिस्ट में दूसरे नंबर पर अंजिक्य रहाणे हैं, जिन्होंने 2020 से अब तक में 24.08 की औसत से रन बनाए हैं. इस लिस्ट में तीसरे नंबर पर वेस्टइंडीज के जॉन कैंपबेल हैं. उन्होंने इस अंतराल में 24.58 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में चौथे नंबर पर विराट कोहली का नाम आता है. विराट ने 2020 से अब तक में सिर्फ 25.80 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में पांचवे नंबर पर इंग्लैंड के रॉरी बर्न्स का नाम है. उन्होंने 2020 से अब तक टेस्ट फॉर्मेट में 27 की औसत से रन बनाए हैं. क्या दिल्ली टेस्ट में वापसी करेंगे विराट? विराट कोहली का औसत तीनों फॉर्मेट में 50 से ऊपर का हुआ करता था, लेकिन अब पहली बार उनका ओवरऑल टेस्ट औसत 48.68 पर आ गया है. इसका कारण 2020 से उनका 25.80 की औसत से रन बनाना ही है. अब देखना होगा कि विराट कोहली ऑस्ट्रेलिया के खिलाफ चल रही मौजूदा बॉर्डर-गावस्कर ट्रॉफी के दूसरे यानी दिल्ली टेस्ट मैच में अपने टेस्ट औसत को सुधार पाते हैं या नहीं. यह भी पढ़ें: IND vs AUS: दिल्ली में पिछले 3 टेस्ट में विराट कोहली के आंकड़े ऑस्ट्रेलिया को देंगे टेंशन, आप भी देखकर हो जाएंगे हैरान","pubDate":"2023-02-13 18:49:58","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/13/1e0ecacc67644405327bdd962c67e3ef1676312967288428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Nitschke: WPL takes whole game forward","link":"https://www.perthnow.com.au/sport/cricket/nitschke-wpl-takes-whole-game-forward-c-9748170","keywords":null,"creator":["Annesha Ghosh"],"video_url":null,"description":"Head coach Shelley Nitschke is convinced the new WPL will only enhance standards among Australia's top players.","content":"Can the WPL further enhance the professionalism in women's cricket in Australia that has been the bedrock to the national team's success? That was the question posed to head coach Shelley Nitschke, who said: \"Look, I think it does. It takes the whole game forward, and we're just a small part of that. \"But it's going to be really exciting to see all the players back playing in India together in another franchise. And WPL is going to take the game to a different level, I think. \"So it's exciting for Australian cricket as it is for cricket all over the world. I think our girls are excited about it, but focused on the job at hand while we're here in South Africa as well.\"","pubDate":"2023-02-13 18:36:09","image_url":"https://images.perthnow.com.au/publication/C-9748170/7160c5d38e2fdbec6c51e17f74dd0945553b1ae4-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"WPL 2023 auction: Gardner, Mooney, Rana make up Gujarat Giants’ strong squad","link":"https://thenewsmill.com/2023/02/wpl-2023-auction-gardner-mooney-rana-make-up-gujarat-giants-strong-squad/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"As the Women’s Premier League gears up for a grand beginning, all the five cricket franchises have finalised their teams at the first-ever player auction, which took place on 13 February in Mumbai. Gujarat Giants owned by Adani Sportsline has signed up an exciting line-up including the likes of Ashleigh Gardner (Rs 3.2 crore), Beth Mooney (Rs 2 crore), Sneh Rana (Rs 75 lakh) and Harleen Deol (Rs 40 lakh). After a heated bidding war, the Gujarat Giants opened their account with the pick of Australian all-rounder Ashleigh Gardner for INR 3.2 crore, the joint second-highest at the Auction. The three-time World Champion has been one of the pillars of strength for Australia and opened her 2023 T20 World Cup with a 5/12 against New Zealand. “This marks a new beginning for all of us associated with the Adani Sportsline-owned Gujarat Giants. My team and I are thrilled to leave the table feeling delighted with the squad we have put together. With all our bases covered, from here onwards we begin our preparation for the upcoming tournament,” said Mithali Raj, mentor, and advisor for Gujarat Giants. Australian Beth Mooney came in for INR 2 crore for the Giants next. The 2-time T20 World Cup winner, Mooney has scored two centuries and 17 fifties in T20Is and has been one of the stars in the Women’s BBL, helping the Brisbane Heat to back-to-back titles in 2018 and 2019, before moving to Perth Scorchers, where she helped them win their first title in 2021-22. The Giants’ first Indian pick was Harleen Deol, whose famous catch at the boundary against England took the cricketing world by storm, is also a solid batter and quite useful with her spin bowling too. She was also part of the Indian team that won Silver at the 2022 Commonwealth Games. “The Gujarat Giants’ squad looks solid for the inaugural edition of the Women’s Premier League. We have an eclectic mix of Indian and international players, all of whom can turn a game on its head single-handedly. As a coach, I will always cherish this auction experience,” said the team’s head coach, Rachael Haynes. The Giants added a plethora of experience when they opened the doors for the West Indies all-rounder Deandra Dottin. The 31-year-old, with more than 100 caps for WI, has played franchise cricket in the UK, Australia and the Caribbean, apart from having turned for the Trailblazers and Supernovas in the Women’s T20 Challenge. Dottin also boasts of best figures of 5/5 and two centuries in T20Is and is one of the stalwarts in the modern game and has played in every edition of the T20 World Cup from 2009 to 2020. The Adani Sportsline Owned Gujarat Giants squad has also brought in some very talented Indian players like Mansi Joshi, Dayalan Hemalatha, Sushma Verma and Tanuja Kanwer of whom have had significant performances in domestic cricket. Meanwhile, the squad also features the exciting 16-year-old all-rounder Hurley Gala, who was coached by Jemimah Rodrigues’ father in Mumbai and was also part of the Indian U-19 side that won the T20 World Cup in 2023 January in South Africa. “The Gujarat Giants’ squad is quite a well-balanced one and we have a strong set of young Indian players, who are waiting to write their names in the history books of the sport in this country. The youngsters will definitely benefit a lot from being around some of the best international cricketers, and we hope this process helps us unearth legends of the future,” said Nooshin Al Khadeer, Bowling Coach of the Gujarat Giants team. The Gujarat Giants team ended the evening having assembled a strong and well-balanced squad of 18 players with 12 Indian and six overseas players. The team has four Australian players, one from England and another from West Indies. “As our first foray into the Women’s Premier League, the Gujarat Giants’ squad has the potential to leave an indelible mark on the matches ahead. The Giants have some of the finest coaches and mentors on board to ensure that the team carves a niche for themselves. As the eventful auction has come to an end, I’m really looking forward to the games,” said Satyam Trivedi, Head, Adani Sportsline. The Gujarat Giants team is mentored by legendary cricketer Mithali Raj and has six-time world champion Rachael Haynes as the head coach. Nooshin Al Khadeer, coach of the Indian U-19 women’s team that won the 2023 U-19 World Cup, is the bowling coach while all-rounder Tushar Arothe as their batting coach and Gavan Twining will be the fielding coach. The inaugural edition of the Women’s Premier League will commence in Mumbai from March 4 – March 26, 2023. A total of 22 matches will be played at the Brabourne Stadium and at the D.Y. Patil Stadium. Gujarat Giants Squad: Ashleigh Gardner (3.2 Cr), Beth Mooney (2 Cr), Sophia Dunkley (60 Lakhs), Annabel Sutherland (70 Lakhs), Harleen Deol (40 Lakhs), Deandra Dottin (60 Lakhs), Sneh Rana (75 Lakh), S Meghana (30 Lakhs), Georgia Wareham (75 Lakhs), Mansi Joshi (30 Lakhs), Dayalan Hemalatha (30 lakhs), Monica Patel (30 lakhs), Tanuja Kanwer (50 lakhs), Sushma Verma (60 Lakhs), Hurley Gala (10 Lakhs), Ashwani Kumari (35 Lakhs), Parunika Sisodia (10 Lakhs), Shabnam Shakil (10 Lakhs). (ANI)","pubDate":"2023-02-13 18:31:17","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL Auction 2023: 4, 4, 4.. तीन लगातार चौके, और ऋचा घोष के दाम छू गए आसमान, जमकर बरसा पैसा","link":"https://sports.ndtv.com/hindi/cricket/wpl-auction-2023-4-4-4-three-consecutive-fours-and-richa-ghosh-price-got-too-high-in-auction-3779096#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WPL Auction 2023: पाकिस्तान के खिलाफ रविवार को ऋचा घोष (Richa Ghosh) ने ऐसा प्रदर्शन किया, जो नीलामी में उनका भला करा गया.","content":"WPL Auction 2023: ऋचा घोष WPL की आकर्षक खिलाड़ियों में से एक होने जा रही हैं कभी-कभी कुछ बातों की टाइमिंग इतनी सधी हुयी होती कि मानो उससे अच्छा कुछ हो नहीं सकता था. और कुछ ऐसा ही भारतीय टी20 विश्व कप टीम (Women T20 World Cup) टीम की विकेटकीपर ऋचा घोष (Richa Ghosh) के साथ सोमवार को वीमेंस प्रीमियर लीग (WPL 2023) में हुआ. इसमें कोई दो राय नहीं कि ऋचा घोष टीम इंडिया की आतिशी बल्लेबाजों में शुमार हो चली हैं, लेकिन विश्व में पाकिस्तान के खिलाफ यादगार जीत में उनके बल्ले से निकला यादगार प्रदर्शन नीलामी के ठीक एक दिन पहले निकला, तो ऑक्शन में उनके प्राइस की टीआरपी भी बहुत ऊंची चली गयी. हालांकि, पाकिस्तान के खिलाफ 20 गेंदों पर नाबाद 31 रन की पारी के बाद पंडित उम्मीद कर रहे थे कि ऋचा की कीमत तीन करोड़ के पार भी जा सकती है. बहरहाल, यह पाकिस्तान के खिलाफ 18वां शुरू होने से पहले मैच की कहानी कुछ और थी. यहां से भारत को 18 गेंदों पर जीत के लिए 28 रन की दरकार थी. 18वां ओवर लेकर आयी आइमन अमीन और पहली ही गेंद पर जेमिमा ने एक रन लिया, लेकिन अगली तीन गेंदों पर रचा घोष पाकिस्तानी गेंदबाज पर बुरी तरह से टूट पड़ीं. दो कट ऐसे लगाए कि मानो कुल्हाड़ी से कोई पेड़ काट रही हों! और इन तीन लगातार चौकों का असर यह रहा कि भारत के सिर पर मंडरा रहे दबाव रूपी बादल एकदम से गायब हो गए. आगे का काम जेमिना ने अगले ही ओवर में कर दिया, लेकिन इन तीन चौकों का असर वीमेन आईपीएल नीलामी में सोमवार को देखने को साफ मिला. ऋचा घोष के लिए फ्रेंचाइजी टीमों के बीच जमकर रेस चली. आखिर में बाजी हाथ लगी आरसीबी ने और इसके लिए ऋचा को सालाना 1.90 करोड़ रुपये मिलेंगे. वास्तव में अगर नीलामी में ऋचा का नाम शुरुआती राउंड में आता, तो निश्चित तौर पर उन्हें और ज्यादा पैसे मिलते, लेकिन वह मर्की खिलाड़ियों में शामिल नहीं थी. कुल मिलाकर पाकिस्तान के खिलाफ मिली बेहतरीन जीत में 50 लाख के बेस प्राइस वाली ऋचा के लगातार तीन चौकों ने नीलामी में पूरा रंग दिखाया और वह करोड़पति खिलाड़ियों में शामिल हो गयीं. VIDEO: बाकी वीडियो देखने के लिए हमारा चैनल करें पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-13 18:21:20","image_url":"https://c.ndtvimg.com/2020-03/bb7ejauo_richa-ghosh_625x300_30_March_20.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"South Africa ignite Women’s T20 World Cup beating New Zealand","link":"https://www.thesouthafrican.com/sport/cricket/south-africa-strike-at-womens-t20-world-cup-beating-new-zealand-13-february-2023/","keywords":["Cricket","Sport","Featured","ICC Women’s T20 World Cup","Important","New Zealand","Proteas"],"creator":["Zareena Gaibee"],"video_url":null,"description":"South Africa bowled New Zealand over and out in Paarl to keep their Women's T20 World Cup dream alive, winning by 65 runs.","content":"South Africa bowled New Zealand over and out in Paarl to keep their Women’s T20 World Cup dream alive, winning by 65 runs. South Africa won the toss and opted to bat first continuing to break the trend of winning the toss and losing the game. ALSO READ: Sri Lanka beat Bangladesh to top pool at Women’s T20 World Cup South Africa set 132/6 South Africa struggled upfront losing wickets early but Chloe Tryon dropped anchor and steadied the ship. She made 40 off 34 and built a substantial partnership with Nadine de Klerk who finished with an unbeaten 28 off 26 deliveries. South Africa ended their innings with 132/6 in this Women’s T20 World Cup. Eden Carson took 2 for 23 runs for New Zealand. Lea Tahuhu picked up 2/27 and Hayley Jensen got 1/13. The fielders also got into the action dislodging the bails with a runout. ALSO READ: Women’s T20 World Cup: Watch from the grass or couch New Zealand getting its ducks in a row For the second game in a row, New Zealand’s openers have gone for ducks. Sophie Devine, traditionally an opener came in lower down the order and top-scored with 16 off 26. Jess Kerr with 11 from 13 balls and Amelia Kerr with 10 off 12 deliveries were the only other players to crack double figures. New Zealand was 67 all out. South Africa’s bowlers came out firing. Wickets and records falling. Nonkululeko Mlaba set the tone with 3/10 . Player of the Match, Chloe Tryon followed up her batting with 2/12 with the ball. Marizanne Kapp took 2/13 and Ayabonga Khaka got 1/9 and a wonderful runout. Shabnim Ismail, who has consistently been the second fastest female bowler in the world, bowled her record-breaking seventh maiden over in Women’s T20 World Cups and ended the innings with 1/7. ALSO READ: New Zealand bowled over by Australia in Women’s T20 World Cup What next? New Zealand travels to Cape Town to take on Bangladesh on Friday, 17 November at 15:00. The hosts, South Africa move to Gqeberha to face current title holders, Australia on Saturday, 18 February at 19:00. CLICK HERE TO READ MORE ARTICLES BY ZAREENA GAIBEE","pubDate":"2023-02-13 20:26:04","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Eoin Morgan tributes and Super Bowl celebrations – Monday’s sporting social","link":"https://www.independent.co.uk/sport/eoin-morgan-england-henry-winkler-cbe-barmy-army-b2281545.html","keywords":["Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Former England captain Morgan announced his retirement from all forms of cricket on Monday.","content":"Sports stars and clubs across the world continue to provide an insight into their lives on social media. Here, the PA news agency looks at some of the best examples from February 13. Eoin Morgan hung up his boots. Stuart Broad got wet. Mark Boucher? Nathan Tella had a weekend to remember. Joey Barton had his say. Borussia Dortmund were looking forward to Chelsea. Not a bad view of the new AlphaTauri. The Kansas City Chiefs celebrated. Eyyyy. Mixed feelings for Donna Kelce and sons.","pubDate":"2023-02-13 20:20:26","image_url":"https://static.independent.co.uk/2023/02/13/20/a30985eaaff9bbe29f1a0321a850e884Y29udGVudHNlYXJjaGFwaSwxNjc2NDA1OTM0-2.70980110.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Heather Knight says unsold England stars remain ‘very valuable’ despite WPL snub","link":"https://www.independent.co.uk/sport/cricket/nat-sciverbrunt-heather-knight-england-challenger-mumbai-indians-b2281515.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"Nat Sciver-Brunt fetched the joint-highest price for an overseas player after being sold for 3.2 crore (about £320,000) to Mumbai Indians.","content":"Heather Knight insists everyone in England’s T20 World Cup squad remains “very valuable”, irrespective of whether they landed a money-spinning deal in the inaugural Women’s Premier League auction. Nat Sciver-Brunt fetched the joint-highest price for an overseas player after being sold for 3.2 crore (about £320,000) to Mumbai Indians , instantly making her one of Britain’s highest-paid sportswomen. Sophie Ecclestone was also the recipient of a six-figure contract, joining England head coach Jon Lewis at Up Warriorz, who bought the world’s top-ranked T20 bowler for 1.8 crore (around £180,000). Knight, Sophia Dunkley, Alice Capsey, Lauren Bell and Issy Wong were picked up too as seven of the 27 English entrants were signed, but the experienced trio of Katherine Sciver-Brunt, Amy Jones and Danni Wyatt were among those unsold. Knight revealed England would rally round anyone who needed support after being overlooked but was adamant their worth in the squad was unaffected as their mission for a T20 World Cup title continued in South Africa on Monday. “I think the whole team will make sure individuals are looked after, that’s really important and what we’re about as a side,” the England captain said after a four-wicket win over Ireland in Paarl. “The value of players to the England team doesn’t change because they haven’t been picked up, they’re still very valuable, everyone in the squad is hugely valuable to us trying to win a World Cup. “They’ll certainly be looked after and given space if needed to obviously deal with anything and try and refocus and get back on it.” Capsey was snapped up by Delhi Capitals for roughly £75,000, Dunkley got a £60,000 payday from Gujarat Giants while Bell and Wong will earn £30,000 apiece for UP Warriorz and Mumbai Indians respectively. Knight initially went unsold but Royal Challengers Bangalore paid her base price of £40,000 – still higher than the top band of contracts in The Hundred women’s competition of £31,250 last year. It was another landmark day for women’s cricket ahead of a tournament that is scheduled to run from March 4-26, with 22 matches in total in a five-team league. “I’m really excited, I think being involved in the inaugural one will be really special,” Knight added. “It’ll be very new, very different. “Any time you get to play overseas in a franchise competition, you get to work with different coaches, play with different players, play in different conditions. “That’s a huge way to learn and to grow your game. I think it’s a huge positive and I’m looking forward to it.” Overseas spots were at a premium but Australia’s Ashleigh Gardner was bought by Gujarat Giants for the same price as Nat Sciver-Brunt, with teams having a budget of £1.2million to spend on a squad of between 15 and 18 players. But New Zealand’s Suzie Bates and Chamari Athapaththu and Sune Luus, captains of Sri Lanka and South Africa respectively, went unsold. India’s Smriti Mandhana was the first to go under the hammer and attracted the most expensive buy, with Royal Challengers Bangalore paying around £340,000 for her services.","pubDate":"2023-02-13 19:34:55","image_url":"https://static.independent.co.uk/2023/02/13/19/caf9b13a4a6cf588f3fbfe2908da269fY29udGVudHNlYXJjaGFwaSwxNjc2NDAxNTEx-2.62565065.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Women Premier League auction | Smriti shines brightest on a watershed day for women cricketers","link":"https://www.thehindu.com/sport/cricket/women-premier-league-auction-mandhana-steals-thunder-as-10-indian-women-get-crore-plus-deals/article66505803.ece","keywords":null,"creator":["\n        P.K. Ajith Kumar  \n    "],"video_url":null,"description":"The five potential captains are Mandhana (RCB), Harmanpreet (MI), Lanning (DC), Beth Mooney (Gujarat Giants) and Deepti Sharma (UP Warriorz).","content":"Up went the paddle from a smiling Nita Ambani’s right hand. The player under the hammer was Smriti Mandhana. The price was ₹50 lakh. The auction for the inaugural Women’s Premier League was underway at the Jio World Convention Centre here on a hot Monday afternoon. Delhi Capitals made a bid for Smriti at ₹55 lakh. But it soon became an intense battle between Ms. Ambani’s Mumbai Indians and Royal Challengers Bangalore. It ended with RCB winning Smirti for a whopping ₹3.4 crore. When you consider the purse available to a franchise, that amount looks even bigger. What the RCB paid for ensuring those elegant drives on the off-side of Smriti was more than a quarter of the ₹12 core purse. The stylish left-handed Indian opener thus ensured that the WPL’s maiden auction got off to a right start — brisk, frenzied. If her high price wasn’t much of a surprise — she is the poster girl of Indian women’s cricket, has a big fan-following and is very much marketable. Australia’s Ashleigh Gardner getting richer by ₹3.2 crore may have surprised some. The all-rounder had only the other day said after taking five for 12 against New Zealand at the on-going World Cup in South Africa that she had dreamt about the WPL auction. She has now got a dream paycheck, too, from Gujarat Giants. England all-rounder Nat Sciver-Brunt was the only other player to go past the ₹3 crore mark. She was bagged by Mumbai Indians for ₹3.2 crore. Four players went for ₹ 2 crore or more – all-rounder Deepti Sharma (₹ 2.6 crore, UP Warriorz), batter Jemimah Rodrigues (₹ 2.2 crore, Delhi Capitals), Australian wicketkeeper-batter Beth Mooney (₹ 2 crore, Gujarat Giants) and opener Shafali Verma (₹ 2 crore, Delhi Capitals). Among the night’s other big Indian winners were pace-bowling all-rounder Pooja Vastrakar (₹1.9 crore, Mumbai Indians), wicketkeeper-batters Richa Ghosh (₹1.9 crore, RCB) and Yastika Bhatia (₹1.5 crore, Mumbai Indians), captain Harmanpreet Kaur (₹1.8 crore, Mumbai Indians) and seamer Renuka Singh (₹1.5 crore, RCB). Leg-spinning all-rounder Devika Vaidya, who recently made a comeback to the Indian team after a long break, turned heads when she was bought by UP Warriorz for ₹1.4 crore. Not surprisingly, the young Indian players from the Under-19 World Cup winning team attracted quite a bit of interest. India’s biggest star in that tournament in South Africa, Shweta Sehrawat, who was the leading scorer, was bought by UP Warriorz for ₹ 40 lakh, against a base price of ₹ 10 lakh. Seamer Titas Sadhu was bagged by Delhi Capitals for ₹ 25 lakh. Senior Indian seamer Meghna Singh was in for a disappointment. Her base price was ₹ 50 lakh and she went unsold. On the same boat were some big stars from overseas. There were no takers for the England trio of Dani Wyatt, Katherine Sciver-Brunt and Amy Jones, Australia’s Alana King and New Zealand’s Suzie Bates, South Africa’s Sune Luus and Sri Lankan Chamari Athapaththu. Of the 449 players that went under the hammer, 87 players were bought, including 30 overseas.","pubDate":"2023-02-13 19:10:01","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL Auction में छाई ये दिग्गज क्रिकेटर्स , इन 5 खिलाड़ियों पर लगी सबसे महंगी बोली","link":"https://sports.ndtv.com/hindi/cricket/domination-of-these-players-in-wpl-auction-know-who-were-the-5-most-expensive-players-3779373#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WPL Auction में उम्मीद के मुताबिक भारत की स्टार महिला क्रिकेटर्स पर जमकर धन वर्षा हुई. लेकिन कुछ विदेशी सितारों पर बड़ी बोलियां लगी.","content":"WPL Auction में ये रहीं 5 सबसे महंगी खिलाड़ी WPL Auction में उम्मीद के मुताबिक भारत की स्टार महिला क्रिकेटर्स पर जमकर धन वर्षा हुई. लेकिन कुछ विदेशी सितारों पर बड़ी बोलियां लगी. स्मृति मंधाना को लेकर पहले से ही जोर-शोर से चर्चा चल रही थी, लेकिन किसी ने भी नहीं सोचा था कि मंधाना पचास लाख के बेस प्राइस से 3.40 करोड़ रुपये तक पहुंचने में कामयाब रहेंगी. बहरहाल, स्मृति पर पैसा छप्पर फाड़कर बरसा भारत की स्टार बैटर और नेशनल क्रश के नाम से मशहूर स्मृति मंधाना WPL की सबसे महंगी खिलाड़ी रही, जिन्हें रॉयल चैलेंजर्स बेंगलुरु ने 3.4 करोड़ की राशि देकर अपने साथ जोड़ा है. बता दें भारत के पूर्व कप्तान और ग्लोबल स्टार विराट कोहली भी आईपीएल के पहले एडिशन से ही आरसीबी का हिस्सा हैं. अब स्मृति मंधाना भी हमें रॉयल चैलेंजर्स बेंगलुरु से खेलती हुई नज़र आएंगी. ऑस्ट्रेलिया की एश्ले गार्डनर WPL ऑक्शन की दूसरी सबसे महंगी खिलाड़ी रहीं. जिन्हें गुजरात जायंट्स ने 3.2 करोड़ में टीम का हिस्सा बनाया है. इंग्लैड की स्टार खिलाड़ी नेट सीवर को 3.2 करोड़ में मुंबई ने अपनी टीम में शामिल किया है और वे इस ऑक्शन की तीसरी सबसे महंगी खिलाड़ी रही. भारत की दिग्गज ऑलराउंडर दीप्ति शर्मा WPL ऑक्शन की चौथी सबसे महंगी खिलाड़ी रहीं. जिन्हें यूपी वॉरियर्स ने 2.6 करोड़ में टीम के साथ जोड़ा है. वहीं ऐतिहासिक WPL ऑक्शन में जेमिमाह रोड्रिग्स को दिल्ली कैपिटल ने 2.2 करोड़ में टीम में शामिल किया है और वे WPL ऑक्शन की पांचवी सबसे महंगी खिलाड़ी रहीं. पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-13 18:51:05","image_url":"https://c.ndtvimg.com/2023-02/99tljgto_wpl-auction-_625x300_13_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"जसिया जैसी कोई.....\" अब दिल्ली की टीम से खेलेगी कश्मीरी की ये जांबाज़ महिला क्रिकेटर","link":"https://sports.ndtv.com/hindi/cricket/someone-like-jasia-now-this-brave-kashmiri-cricketer-will-play-in-the-delhi-team-3779881#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"विमेंस प्रीमियर लीग का सफल ऑक्शन मुंबई में समाप्त हो चुका है. जहां पर 5 टीमों ने कुल 86 खिलाड़ियों को अपनी-अपनी टीम का हिस्सा बनाया. कश्मीर से लेकर कन्याकुमारी तक फैले विशाल भारत देश की जांबाज़ महिला क्रिकेटर्स के अलावा विदेशी खिलाड़ियों पर भी जमकर पैसा बरसा.","content":"बनेंगी WPL में भाग लेने वाली पहली कश्मीरी क्रिकेटर विमेंस प्रीमियर लीग का सफल ऑक्शन मुंबई में समाप्त हो चुका है. जहां पर 5 टीमों ने कुल 86 खिलाड़ियों को अपनी-अपनी टीम का हिस्सा बनाया. कश्मीर से लेकर कन्याकुमारी तक फैले विशाल भारत देश की जांबाज़ महिला क्रिकेटर्स के अलावा विदेशी खिलाड़ियों पर भी जमकर पैसा बरसा. इंडियन कैप्ड प्लेयर्स और स्टार विदेशी प्लेयर्स तो इस ऑक्शन में चर्चा का विषय रहे ही साथ ही साथ कुछ अंडर 19 प्लेयर्स ने भी सुर्खियां बटोरी. वहीं कश्मीर की एक क्रिकेटर जसिया अख्तर भी इस दौरान सभी का ध्यान अपनी ओर खींच रही हैं. कौन हैं जसिया अख्तर और WPL ऑक्शन में उन्हें किस टीम ने कितने रूपये देकर खरीदा है. आइए विस्तार से आपको बताते हैं ये तमाम जानकारियां जसिया अख्तर दरअसल कश्मीर के शोपियां ज़िले के बारीपोरा गांव की रहने वाली हैं. घरेलू क्रिकेट में वे पंजाब क्रिकेट एसोसिएशन से खेल चुकी हैं. वहीं पिछले दो साल से वे राजस्थान से घरेलू क्रिकेट खेल रही हैं. इसके अलावा जसिया विमेंन टी20 चैलेंज की टीम ट्रेलब्लेजर्स और इंडिया रेड के लिए भी खेल चुकी हैं. जसिया दांए हाथ की आक्रामक बल्लेबाज़ हैं और ज़बरदस्त पावर हिटिंग करने में माहिर हैं. इसी को ध्यान में रखते हुए दिल्ली के थिंक टैंक ने उन्हें 10 लाख की राशि खर्च कर टीम के साथ जोड़ा है और सोशल मीडिया पर पोस्ट करते हुए लिखा है कि \" जसिया जैसा कोई नहीं\". Jasia jaisi koi nahi 😁 The is stoked to have you! कश्मीर की रहने वाली इस महिला क्रिकेटर को साल 2017 में इंडिया कैंप के लिए भी बुलावा आया था. हालांकि वे तब भारतीय टीम में जगह नहीं बना पाई थीं. इसके अलावा जसिया भारत की पूर्व कप्तान मिताली राज, मौजूदा कप्तान हरमनप्रीत कौर व दिग्गज गेंदबाज़ झूलन गोस्वामी के साथ भी खेल चुकी हैं. जसिया के अलावा दिल्ली कैपिटल्स ने मेग लेनिंग, जेमिमाह रोड्रग्स और शेफाली वर्मा को भी टीम का हिस्सा बनाया है. महिला प्रीमियर लीग का पहला सीज़न 4 मार्च से 24 मार्च तक मुंबई में खेला जाएगा. पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-13 18:50:36","image_url":"https://c.ndtvimg.com/2023-02/m8qnnir_jasia-akhtar-_625x300_13_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Virat Kohli: तीन साल से बेहद खराब है विराट कोहली का फॉर्म, सिर्फ 26 के औसत से बना रहे हैं रन","link":"https://www.abplive.com/sports/cricket/5-batsmen-with-lowest-test-average-since-2020-including-virat-kohli-just-before-delhi-test-of-border-gavaskar-trophy-2023-2333697","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Virat Kohli Test Average: विराट कोहली की फॉर्म भारतीय क्रिकेट टीम के लिए काफी मायने रखती है, फिर चाहे वो वनडे हो, टी-20 हो या फिर टेस्ट फॉर्मेट ही क्यों न हो. विराट का फॉर्म पिछले कुछ सालों से किसी भी फॉर्मेट में ठीक नहीं चल रहा था. अब वनडे और टी-20 फॉर्मेट में तो उनकी फॉर्म वापस आ गई है, लेकिन टेस्ट क्रिकेट में अभी भी उन्हें एक अच्छे फॉर्म की तलाश है.  भारत ने हाल ही में हुए नागपुर टेस्ट में ऑस्ट्रेलिया को पारी और 132 रनों से हराया था. उस मैच में भारत के लिए कई खिलाड़ियों ने अच्छा प्रदर्शन किया है, लेकिन विराट कोहली का बल्ला नहीं चल पाया. विराट ने बॉर्डर-गावस्कर ट्रॉफी 2023 के पहले मैच में 26 गेंदों में सिर्फ 12 रनों की पारी खेली.  टेस्ट में बहुत कम हुआ विराट का औसत टेस्ट फॉर्मेट में विराट कोहली कितने बुरे फॉर्म से गुजर रहे हैं, इसका एक आंकड़ा हम आपको बताते हैं. हम आपको उन टॉप 5 खिलाड़ियों के बारे में बताते हैं, जिसने 2020 से अब तक में सबसे कम औसत से रन बनाए हैं. इन आंकड़ों में हमने उन बल्लेबाजों को शामिल किया है, जिन्होंने टॉप-7 में बल्लेबाजी करते हुए कम से कम 25 पारियां खेली हैं.  सबसे कम टेस्ट औसत वाले 5 खिलाड़ी इस लिस्ट में सबसे ऊपर वेस्टइंडीज के जेसन होल्डर का नाम है. उन्होंने टेस्ट फॉर्मेट में 2020 से अब तक में सिर्फ 22.83 की औसत से रन बनाए हैं. इस लिस्ट में दूसरे नंबर पर अंजिक्य रहाणे हैं, जिन्होंने 2020 से अब तक में 24.08 की औसत से रन बनाए हैं.  इस लिस्ट में तीसरे नंबर पर वेस्टइंडीज के जॉन कैंपबेल हैं. उन्होंने इस अंतराल में 24.58 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में चौथे नंबर पर विराट कोहली का नाम आता है. विराट ने 2020 से अब तक में सिर्फ 25.80 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में पांचवे नंबर पर इंग्लैंड के रॉरी बर्न्स का नाम है. उन्होंने 2020 से अब तक टेस्ट फॉर्मेट में 27 की औसत से रन बनाए हैं. क्या दिल्ली टेस्ट में वापसी करेंगे विराट? विराट कोहली का औसत तीनों फॉर्मेट में 50 से ऊपर का हुआ करता था, लेकिन अब पहली बार उनका ओवरऑल टेस्ट औसत 48.68 पर आ गया है. इसका कारण 2020 से उनका 25.80 की औसत से रन बनाना ही है. अब देखना होगा कि विराट कोहली ऑस्ट्रेलिया के खिलाफ चल रही मौजूदा बॉर्डर-गावस्कर ट्रॉफी के दूसरे यानी दिल्ली टेस्ट मैच में अपने टेस्ट औसत को सुधार पाते हैं या नहीं. यह भी पढ़ें: IND vs AUS: दिल्ली में पिछले 3 टेस्ट में विराट कोहली के आंकड़े ऑस्ट्रेलिया को देंगे टेंशन, आप भी देखकर हो जाएंगे हैरान","content":"Virat Kohli Test Average: विराट कोहली की फॉर्म भारतीय क्रिकेट टीम के लिए काफी मायने रखती है, फिर चाहे वो वनडे हो, टी-20 हो या फिर टेस्ट फॉर्मेट ही क्यों न हो. विराट का फॉर्म पिछले कुछ सालों से किसी भी फॉर्मेट में ठीक नहीं चल रहा था. अब वनडे और टी-20 फॉर्मेट में तो उनकी फॉर्म वापस आ गई है, लेकिन टेस्ट क्रिकेट में अभी भी उन्हें एक अच्छे फॉर्म की तलाश है. भारत ने हाल ही में हुए नागपुर टेस्ट में ऑस्ट्रेलिया को पारी और 132 रनों से हराया था. उस मैच में भारत के लिए कई खिलाड़ियों ने अच्छा प्रदर्शन किया है, लेकिन विराट कोहली का बल्ला नहीं चल पाया. विराट ने बॉर्डर-गावस्कर ट्रॉफी 2023 के पहले मैच में 26 गेंदों में सिर्फ 12 रनों की पारी खेली. टेस्ट में बहुत कम हुआ विराट का औसत टेस्ट फॉर्मेट में विराट कोहली कितने बुरे फॉर्म से गुजर रहे हैं, इसका एक आंकड़ा हम आपको बताते हैं. हम आपको उन टॉप 5 खिलाड़ियों के बारे में बताते हैं, जिसने 2020 से अब तक में सबसे कम औसत से रन बनाए हैं. इन आंकड़ों में हमने उन बल्लेबाजों को शामिल किया है, जिन्होंने टॉप-7 में बल्लेबाजी करते हुए कम से कम 25 पारियां खेली हैं. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); सबसे कम टेस्ट औसत वाले 5 खिलाड़ी इस लिस्ट में सबसे ऊपर वेस्टइंडीज के जेसन होल्डर का नाम है. उन्होंने टेस्ट फॉर्मेट में 2020 से अब तक में सिर्फ 22.83 की औसत से रन बनाए हैं. इस लिस्ट में दूसरे नंबर पर अंजिक्य रहाणे हैं, जिन्होंने 2020 से अब तक में 24.08 की औसत से रन बनाए हैं. इस लिस्ट में तीसरे नंबर पर वेस्टइंडीज के जॉन कैंपबेल हैं. उन्होंने इस अंतराल में 24.58 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में चौथे नंबर पर विराट कोहली का नाम आता है. विराट ने 2020 से अब तक में सिर्फ 25.80 की औसत से टेस्ट रन बनाए हैं. इस लिस्ट में पांचवे नंबर पर इंग्लैंड के रॉरी बर्न्स का नाम है. उन्होंने 2020 से अब तक टेस्ट फॉर्मेट में 27 की औसत से रन बनाए हैं. क्या दिल्ली टेस्ट में वापसी करेंगे विराट? विराट कोहली का औसत तीनों फॉर्मेट में 50 से ऊपर का हुआ करता था, लेकिन अब पहली बार उनका ओवरऑल टेस्ट औसत 48.68 पर आ गया है. इसका कारण 2020 से उनका 25.80 की औसत से रन बनाना ही है. अब देखना होगा कि विराट कोहली ऑस्ट्रेलिया के खिलाफ चल रही मौजूदा बॉर्डर-गावस्कर ट्रॉफी के दूसरे यानी दिल्ली टेस्ट मैच में अपने टेस्ट औसत को सुधार पाते हैं या नहीं. यह भी पढ़ें: IND vs AUS: दिल्ली में पिछले 3 टेस्ट में विराट कोहली के आंकड़े ऑस्ट्रेलिया को देंगे टेंशन, आप भी देखकर हो जाएंगे हैरान","pubDate":"2023-02-13 18:49:58","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/13/1e0ecacc67644405327bdd962c67e3ef1676312967288428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Nitschke: WPL takes whole game forward","link":"https://www.perthnow.com.au/sport/cricket/nitschke-wpl-takes-whole-game-forward-c-9748170","keywords":null,"creator":["Annesha Ghosh"],"video_url":null,"description":"Head coach Shelley Nitschke is convinced the new WPL will only enhance standards among Australia's top players.","content":"Can the WPL further enhance the professionalism in women's cricket in Australia that has been the bedrock to the national team's success? That was the question posed to head coach Shelley Nitschke, who said: \"Look, I think it does. It takes the whole game forward, and we're just a small part of that. \"But it's going to be really exciting to see all the players back playing in India together in another franchise. And WPL is going to take the game to a different level, I think. \"So it's exciting for Australian cricket as it is for cricket all over the world. I think our girls are excited about it, but focused on the job at hand while we're here in South Africa as well.\"","pubDate":"2023-02-13 18:36:09","image_url":"https://images.perthnow.com.au/publication/C-9748170/7160c5d38e2fdbec6c51e17f74dd0945553b1ae4-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"WPL 2023 auction: Gardner, Mooney, Rana make up Gujarat Giants’ strong squad","link":"https://thenewsmill.com/2023/02/wpl-2023-auction-gardner-mooney-rana-make-up-gujarat-giants-strong-squad/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"As the Women’s Premier League gears up for a grand beginning, all the five cricket franchises have finalised their teams at the first-ever player auction, which took place on 13 February in Mumbai. Gujarat Giants owned by Adani Sportsline has signed up an exciting line-up including the likes of Ashleigh Gardner (Rs 3.2 crore), Beth Mooney (Rs 2 crore), Sneh Rana (Rs 75 lakh) and Harleen Deol (Rs 40 lakh). After a heated bidding war, the Gujarat Giants opened their account with the pick of Australian all-rounder Ashleigh Gardner for INR 3.2 crore, the joint second-highest at the Auction. The three-time World Champion has been one of the pillars of strength for Australia and opened her 2023 T20 World Cup with a 5/12 against New Zealand. “This marks a new beginning for all of us associated with the Adani Sportsline-owned Gujarat Giants. My team and I are thrilled to leave the table feeling delighted with the squad we have put together. With all our bases covered, from here onwards we begin our preparation for the upcoming tournament,” said Mithali Raj, mentor, and advisor for Gujarat Giants. Australian Beth Mooney came in for INR 2 crore for the Giants next. The 2-time T20 World Cup winner, Mooney has scored two centuries and 17 fifties in T20Is and has been one of the stars in the Women’s BBL, helping the Brisbane Heat to back-to-back titles in 2018 and 2019, before moving to Perth Scorchers, where she helped them win their first title in 2021-22. The Giants’ first Indian pick was Harleen Deol, whose famous catch at the boundary against England took the cricketing world by storm, is also a solid batter and quite useful with her spin bowling too. She was also part of the Indian team that won Silver at the 2022 Commonwealth Games. “The Gujarat Giants’ squad looks solid for the inaugural edition of the Women’s Premier League. We have an eclectic mix of Indian and international players, all of whom can turn a game on its head single-handedly. As a coach, I will always cherish this auction experience,” said the team’s head coach, Rachael Haynes. The Giants added a plethora of experience when they opened the doors for the West Indies all-rounder Deandra Dottin. The 31-year-old, with more than 100 caps for WI, has played franchise cricket in the UK, Australia and the Caribbean, apart from having turned for the Trailblazers and Supernovas in the Women’s T20 Challenge. Dottin also boasts of best figures of 5/5 and two centuries in T20Is and is one of the stalwarts in the modern game and has played in every edition of the T20 World Cup from 2009 to 2020. The Adani Sportsline Owned Gujarat Giants squad has also brought in some very talented Indian players like Mansi Joshi, Dayalan Hemalatha, Sushma Verma and Tanuja Kanwer of whom have had significant performances in domestic cricket. Meanwhile, the squad also features the exciting 16-year-old all-rounder Hurley Gala, who was coached by Jemimah Rodrigues’ father in Mumbai and was also part of the Indian U-19 side that won the T20 World Cup in 2023 January in South Africa. “The Gujarat Giants’ squad is quite a well-balanced one and we have a strong set of young Indian players, who are waiting to write their names in the history books of the sport in this country. The youngsters will definitely benefit a lot from being around some of the best international cricketers, and we hope this process helps us unearth legends of the future,” said Nooshin Al Khadeer, Bowling Coach of the Gujarat Giants team. The Gujarat Giants team ended the evening having assembled a strong and well-balanced squad of 18 players with 12 Indian and six overseas players. The team has four Australian players, one from England and another from West Indies. “As our first foray into the Women’s Premier League, the Gujarat Giants’ squad has the potential to leave an indelible mark on the matches ahead. The Giants have some of the finest coaches and mentors on board to ensure that the team carves a niche for themselves. As the eventful auction has come to an end, I’m really looking forward to the games,” said Satyam Trivedi, Head, Adani Sportsline. The Gujarat Giants team is mentored by legendary cricketer Mithali Raj and has six-time world champion Rachael Haynes as the head coach. Nooshin Al Khadeer, coach of the Indian U-19 women’s team that won the 2023 U-19 World Cup, is the bowling coach while all-rounder Tushar Arothe as their batting coach and Gavan Twining will be the fielding coach. The inaugural edition of the Women’s Premier League will commence in Mumbai from March 4 – March 26, 2023. A total of 22 matches will be played at the Brabourne Stadium and at the D.Y. Patil Stadium. Gujarat Giants Squad: Ashleigh Gardner (3.2 Cr), Beth Mooney (2 Cr), Sophia Dunkley (60 Lakhs), Annabel Sutherland (70 Lakhs), Harleen Deol (40 Lakhs), Deandra Dottin (60 Lakhs), Sneh Rana (75 Lakh), S Meghana (30 Lakhs), Georgia Wareham (75 Lakhs), Mansi Joshi (30 Lakhs), Dayalan Hemalatha (30 lakhs), Monica Patel (30 lakhs), Tanuja Kanwer (50 lakhs), Sushma Verma (60 Lakhs), Hurley Gala (10 Lakhs), Ashwani Kumari (35 Lakhs), Parunika Sisodia (10 Lakhs), Shabnam Shakil (10 Lakhs). (ANI)","pubDate":"2023-02-13 18:31:17","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL Auction 2023: 4, 4, 4.. तीन लगातार चौके, और ऋचा घोष के दाम छू गए आसमान, जमकर बरसा पैसा","link":"https://sports.ndtv.com/hindi/cricket/wpl-auction-2023-4-4-4-three-consecutive-fours-and-richa-ghosh-price-got-too-high-in-auction-3779096#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"WPL Auction 2023: पाकिस्तान के खिलाफ रविवार को ऋचा घोष (Richa Ghosh) ने ऐसा प्रदर्शन किया, जो नीलामी में उनका भला करा गया.","content":"WPL Auction 2023: ऋचा घोष WPL की आकर्षक खिलाड़ियों में से एक होने जा रही हैं कभी-कभी कुछ बातों की टाइमिंग इतनी सधी हुयी होती कि मानो उससे अच्छा कुछ हो नहीं सकता था. और कुछ ऐसा ही भारतीय टी20 विश्व कप टीम (Women T20 World Cup) टीम की विकेटकीपर ऋचा घोष (Richa Ghosh) के साथ सोमवार को वीमेंस प्रीमियर लीग (WPL 2023) में हुआ. इसमें कोई दो राय नहीं कि ऋचा घोष टीम इंडिया की आतिशी बल्लेबाजों में शुमार हो चली हैं, लेकिन विश्व में पाकिस्तान के खिलाफ यादगार जीत में उनके बल्ले से निकला यादगार प्रदर्शन नीलामी के ठीक एक दिन पहले निकला, तो ऑक्शन में उनके प्राइस की टीआरपी भी बहुत ऊंची चली गयी. हालांकि, पाकिस्तान के खिलाफ 20 गेंदों पर नाबाद 31 रन की पारी के बाद पंडित उम्मीद कर रहे थे कि ऋचा की कीमत तीन करोड़ के पार भी जा सकती है. बहरहाल, यह पाकिस्तान के खिलाफ 18वां शुरू होने से पहले मैच की कहानी कुछ और थी. यहां से भारत को 18 गेंदों पर जीत के लिए 28 रन की दरकार थी. 18वां ओवर लेकर आयी आइमन अमीन और पहली ही गेंद पर जेमिमा ने एक रन लिया, लेकिन अगली तीन गेंदों पर रचा घोष पाकिस्तानी गेंदबाज पर बुरी तरह से टूट पड़ीं. दो कट ऐसे लगाए कि मानो कुल्हाड़ी से कोई पेड़ काट रही हों! और इन तीन लगातार चौकों का असर यह रहा कि भारत के सिर पर मंडरा रहे दबाव रूपी बादल एकदम से गायब हो गए. आगे का काम जेमिना ने अगले ही ओवर में कर दिया, लेकिन इन तीन चौकों का असर वीमेन आईपीएल नीलामी में सोमवार को देखने को साफ मिला. ऋचा घोष के लिए फ्रेंचाइजी टीमों के बीच जमकर रेस चली. आखिर में बाजी हाथ लगी आरसीबी ने और इसके लिए ऋचा को सालाना 1.90 करोड़ रुपये मिलेंगे. वास्तव में अगर नीलामी में ऋचा का नाम शुरुआती राउंड में आता, तो निश्चित तौर पर उन्हें और ज्यादा पैसे मिलते, लेकिन वह मर्की खिलाड़ियों में शामिल नहीं थी. कुल मिलाकर पाकिस्तान के खिलाफ मिली बेहतरीन जीत में 50 लाख के बेस प्राइस वाली ऋचा के लगातार तीन चौकों ने नीलामी में पूरा रंग दिखाया और वह करोड़पति खिलाड़ियों में शामिल हो गयीं. VIDEO: बाकी वीडियो देखने के लिए हमारा चैनल करें पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-13 18:21:20","image_url":"https://c.ndtvimg.com/2020-03/bb7ejauo_richa-ghosh_625x300_30_March_20.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"}]}