{"newsArray":[{"article_id":"6dc8cf7f3059089616a8cea6c896a083","title":"Raza named Lucia Kings captain","link":"https://www.chronicle.co.zw/raza-named-lucia-kings-captain/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com ZIMBABWE international cricketer, Sikandar Raza is continuing with his impressive show on the global stage as he has been named the new captain of his Caribbean Premier League (CPL) side, St Lucia Kings. The Chevrons stalwart replaces South African legend Faf Du Plessis at the helm of the top placed St Lucia Kings. […]","content":"The Chronicle ZIMBABWE international cricketer, Sikandar Raza is continuing with his impressive show on the global stage as he has been named the new captain of his Caribbean Premier League (CPL) side, St Lucia Kings. The Chevrons stalwart replaces South African legend Faf Du Plessis at the helm of the top placed St Lucia Kings. Du Plessis suffered an elbow injury and has been ruled out for the rest of the season. This will be Raza’s second stint as a captain in an internationally recognised T20 franchise league. His previous and first stint as a skipper came last year when he captained Dambulla Aura in the absence of Dasun Shanaka in the Lankan Premier League (LPL). Raza’s predecessor, Du Plessis has rallied behind him to do a good job as he comes in with a lot of T20 franchise experience having taken part in some big competitions such as the Indian Premier League (IPL) and the Pakistan Super League (PSL). “Raza is someone who has played a lot of T20 and T10 cricket. So very much an experienced brain there, so, it’s great to have those guys on the field and ask questions. Obviously, it’s a change and probably you could say a big change because it’s someone stepping into the shoes for the first time with the St Lucia Kings. “But luckily, we’ve got someone like Sammy there who will make sure for the first one or two games there will be some direction from his side. And then trust the guy on the field with the resources that he has at his disposal,” said Du Plessis after their match on Saturday. Commenting on the issue, Raza said they will miss Du Plessis as he has done a lot of good work for the team and is grateful to have a team like St Lucia Kings which has a lot of good players and everything will take care of itself. “It is true apparently. Faf has done such a fantastic job with this team, we are going to miss him dearly but most importantly we wish him well because he is going for a surgery so a lot of prayers for him. We wish Faf a successful surgery and quick recovery because this family is incomplete without him. “For my side, when you have so many good professionals and great guys with great attitudes then captaining is not really a big thing, everything looks after itself because everybody is so focused and motivated to do well,” said Raza. In their previous match against Trinbago Knight Riders on Saturday, Raza was named player of the match after helping St. Lucia Kings register a 54 runs win. He put up a good all-round performance. Batting first, Raza scored 32 runs from 23 balls as his side finished on 167/5 in 20 overs before going on to finish with bowling figures of 2/31 in three overs to help St. Lucia Kings bowl out their opponents for 113 runs in 14,5 overs and win their second match in five matches. Raza’s first assignment as the captain comes on Sunday against fifth placed Barbados Royals in Bridgetown. This will be their seventh match of the campaign. – @brandon_malvin","pubDate":"2023-08-29 22:04:43","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"8f24e2b21cd34923b81e76b86bc3ba35","title":"Good, bad, and some UGLY!","link":"https://times-age.co.nz/opinion/some-good-some-bad-and-some-ugly/","keywords":["Opinion","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"More gold medals, a bounce-back win, a gutsy title defence, a spectacular crash, a record defeat, and a hunger strike are highlights and lowlights of the past week in sport. So it’s time to draw revolvers on this week’s ‘Good, Bad and Ugly’. GOOD Hats off to our five cricketers to be awarded major association […]","content":"More gold medals, a bounce-back win, a gutsy title defence, a spectacular crash, a record defeat, and a hunger strike are highlights and lowlights of the past week in sport. So it’s time to draw revolvers on this week’s ‘Good, Bad and Ugly’. Hats off to our five cricketers to be awarded major association contracts. Melissa Hansen, Emma McLeod, Georgia Atkinson, and Ocean Bartlett will don the green and gold of the Central Hinds, and Gemma Sims will pad up for the Wellington Blaze. There is also the selection of the multi-talented Vanessa Taylor for the Capital Football Youth Development squad. Adept at hockey and football, the St Matthew’s student has a bright future. Copthorne Wairarapa-Bush bounced back from their 50–3 shellacking at the hands of North Otago to power home for a 30–24 win over Poverty Bay and move to fifth equal in the Heartland standings. Dame Lisa – three gold medals taking her total haul to 15 at world championships – what more can one say about arguably world canoeing’s greatest-ever paddler? Scot ‘the Iceman’ Dixon kept alive his chances of a seventh IndyCar Championship, cruising to a 22-second win on the St Louis oval and his 55th career victory, while Liam Lawson’s 13th in his debut Formula One start may not look all that flash, but his performance in an uncompetitive car impressed many pundits, who opined there is a good future ahead. It wasn’t pretty, but the Warriors did what they had to in beating the Dragons 18–6 to lock in a top-four finish and two lives for the NRL final series. Fiji 30, England 22 – the Bula Boys scored a memorable win at Twickenham, and Samoa just went down 13-17 to world number one Ireland. Could this be the year of the Pasifika at the World Cup? Let’s hope they and the Tongans can set the tournament alight! Talk about tough, Mea Motu dislocating her shoulder in the first round of her 10-round world super bantamweight fight with Malawi’s Ellen Simwaka and going on to retain her belt. What has happened to Lydia Ko? Not only has she slipped to sixth in the world rankings, but a shambolic 10-over par at the latest LPGA event in Vancouver was her worst-ever round on the tour. Please tell me that the pedantic refereeing, and microscopic intervention of the TMO, which saw the first half of the All-Blacks – Springboks game take an hour to complete, is not the blueprint for the World Cup. If it is, we could be in for the baddest – verging on the ugliest – watch yet. Nascar driver Ryan Preece’s Ford barrel rolling at least 10 times at Daytona after clipping another car at 300kmh. Amazingly Preece was able to climb out of his mangled car, and he escaped any significant injury. Staying on the injury front, Tohu Harris’s injured back, which has the Warriors captain in doubt for the NRL playoffs, and Tyrel Lomax’s gashed knee that needed 30 stitches and will see him miss some of the early All Black World Cup matches. Poor discipline, poor execution, and poor attitude equal an ugly outcome. In my 58 years of watching All Blacks’ rugby, I’m struggling to recall a more inept effort in a test as the 35–7 trouncing at the hands of our fiercest foes. The 2019 semifinal loss to England, the 1999 semifinal defeat to France and a 28–7 loss to Australia, and losses to England in 1983 and 1993 come close, but I’m battling to remember anything akin to the pummelling the rampant Boks subjected us to at Twickenham. Am I worried? No! Nor are the bookies; Ladbrokes still have the men in black joint 3/1 favourites with France to lift the Webb Ellis Cup. The World Cup is a completely different beast, and the Twickenham result means diddlysquat, but why give the already confident Saffas an adrenaline boost two weeks out from the World Cup kickoff? Credit to South Africa, they were very good, but we were awful. Boys, you should’ve stayed on the bus, but going on that effort, I think most of you did. The saga surrounding Spanish Football Federation president Luis Rubiales and the unwanted kiss on Jenni Hermoso’s lips during the World Cup presentation gets uglier and weirder by the day. Not only does Rubiales refuse to resign, but now his mother has gone on a hunger strike because of the “inhumane hounding” of her son. Bizarrely, she has locked herself in a church where no doubt she can survive on communion wafers and wine and confess the sins of her son.","pubDate":"2023-08-29 22:00:00","image_url":"https://times-age.co.nz/wp-content/uploads/2023/08/503033-1024x683.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"8da59438a08eadfdd31338ff7648a5d9","title":"‘India vs Pakistan surpasses the Ashes,’ says Tom Moody","link":"https://kashmirreader.com/2023/08/30/india-vs-pakistan-surpasses-the-ashes-says-tom-moody/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"New Delhi: It’s that time in world cricket again. India play Pakistan in the group stage of the 2023 Asia Cup on Saturday, September 2 at Pallekele. A fixture that may take place two more time over the course of next fortnight as the six-team competition may see the two lock horns in the Super […]","content":"New Delhi: It’s that time in world cricket again. India play Pakistan in the group stage of the 2023 Asia Cup on Saturday, September 2 at Pallekele. A fixture that may take place two more time over the course of next fortnight as the six-team competition may see the two lock horns in the Super 4 and even the final. In October, the two face off in the ODI World Cup in the 1 lakh plus capacitated Narendra Modi Stadium in Ahmedabad. And so, the buzz around the contest is quite palpable. Former Australia cricketer Tom Moody has no doubts, it is the biggest cricket fixture in world cricket. Even above the Ashes, despite the oldest Test cricket rivalry producing an enticing 2-2 series recently in England. “I think this match surpasses the Ashes,” Moody told Star Sports. “It’s always got a lovely story to it, and both are outstanding cricketing nations.” Deciphering the two teams and the players on show, he added, “And when you look at that Pakistan squad, it does boast a lot of talent. But one thing that stands out for me is that it also boasts experience. So now they have the combination of experience and talent, they are a real threat. They can match India with their pace bowling; they’ve got genuine pace on their side, and the only issue I see them potentially having is the depth in the quality of their batting which India has got. So that’s going to be the interesting pressure that they put on the likes of Babar Azam at the top of the order.” The last four meetings between the India and Pakistan have been all in T20Is, with both the teams having shared the spoils. While Pakistan beat India in their group stage fixture of the 2021 T20 World Cup, the men in blue returned the favor in the 2022 edition at Melbourne. At the Asia Cup last year, both would win a game each. The last 50-over contest between the two nations dates back to June 16, 2019 when Virat Kohli-led India beat Sarfaraz Khan’s Pakistan at the 2019 World Cup in Manchester. When asked about which player he thinks possesses the biggest threat to the Indian batting, Moody wouldn’t hesitate before naming, “Shaheen Afridi. Full Stop. I just think that Shaheen Afridi with the new ball is a major threat, which he has done historically. Broken through with that new ball, manages to blow away a couple of early wickets, which then opens up the middle order for India to resurrect things. Particularly for a middle order that hasn’t had a lot of game time.” India and Pakistan are pitted against Nepal in Group A of the Asia Cup, while Sri Lanka – who are co-hosting the tournament alongside Pakistan – are with Bangladesh and Afghanistan in Group B. Agencies ‘India vs Pakistan surpasses the Ashes,’ says Tom Moody added by KR Desk on 3:04 am August 30, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-29 21:34:21","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"84354882d273632354e3c6435afc4a78","title":"Difficult situations still excites me after 15 years of int’l cricket: Kohli","link":"https://kashmirreader.com/2023/08/30/difficult-situations-still-excites-me-after-15-years-of-intl-cricket-kohli/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Virat Kohli has mastered several obstacles during his illustrious career but the former Indian skipper on Monday said the upcoming ICC World Cup 2023 presents him with an exciting new challenge, something he still relishes after a decade and half of top flight cricket. The 13th edition of the quadrennial extravaganza will be […]","content":"New Delhi: Virat Kohli has mastered several obstacles during his illustrious career but the former Indian skipper on Monday said the upcoming ICC World Cup 2023 presents him with an exciting new challenge, something he still relishes after a decade and half of top flight cricket. The 13th edition of the quadrennial extravaganza will be played in India across October and November, and Kohli said he is gearing up for the challenge of playing a World Cup at home. . “Any challenge in front of you, you look forward to it. When difficulty comes in front of you get excited. You don’t shy away from it. After 15 years I still like encounters, and the World Cup 2023 is one (challenge). It excites me, I need something new to, you know, propel me to another level,”said Kohli during a promotional event. Kohli did not deny that there is pressure of expectations on him and the team. But Kohli reminded everyone that no one wants to win the World Cup more than the players themselves. “The pressure is always there. The fans always say we want (the team) to win a cup very badly. I’d like to say not more than me. So, I’m in the right place. Honestly, I know the expectations are there and the emotions of the people are there. But please know that no one wants to win more than players,” he said. Kohli, though, is no stranger to winning a World Cup. He had led India to the ICC U-19 World Cup victory back in 2008 and he was also part of the MS Dhoni-led India side that triumphed in the 2011 50-over World Cup at home. My career highlight ïs obviously winning the World Cup in 2011. I was 23 at the time, and I probably didn’t understand the magnitude of it. But now at 34, and has played many World Cups, which we haven’t been able to win, So,I understand the emotions of all the senior players (in 2011). “All the more for Sachin Tendulkar, as it was his last World Cup. He had already played many World Cups by then and to win it in Mumbai, his hometown, was very special for him. I mean, it was stuff from dreams,” said Kohli. Kohli also remembered the pressure piled on players ahead and during 2011 World Cup. “I remember the amount of pressure there was on all the players when we were travelling, Thankfully, there was no social media back then. It would have been a nightmare, honestly. But through the airports, it was always just one thing — we need to win the Cup,” he said. “The senior players were always under the pump and to handle all that pressure. It was just brilliant. And that night (after the WC win) in itself was something magical,” he added. PTI Difficult situations still excites me after 15 years of int’l cricket: Kohli added by Press Trust of India on 3:01 am August 30, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-29 21:31:45","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"750d69b406ba221c25077030ab10486a","title":"Pakistan favoured to give India a run for its money in hunt for Asia Cup","link":"https://torontosun.com/sports/other-sports/pakistan-favoured-to-give-india-a-run-for-its-money-in-hunt-for-asia-cup","keywords":["Other Sports","Sports"],"creator":["Norm Da Costa"],"video_url":null,"description":"Pride of Asia is on the line","content":"The pride of Asia is on the line in the six-nation Asia Cup that will be played in Pakistan and Sri Lanka. Pakistan opens the six-team tournament against Nepal on Wednesday and on Saturday comes the big one. It’s the showdown between bitter political rivals Pakistan and India who share a border and a bloodied history that includes going to war on four occasions. The two super-giants of the game meet in a group match in the 35,000-seat stadium in Pellekele, Sri Lanka, which will be filled to the brim while there will be millions around the world glued to their television sets. The two countries will essentially grind to a halt as has happened each time these two meet in international competitions. Off the field there has always been a degree of resentment between the fans while there is a modicum of respect and friendliness between the players. One would think these two powerhouses would be separated from meeting each other at the group stage but there has not been such luck. In fact, the International Cricket Council has admitted it pairs these two teams in the same group because of the financial windfall. In this tournament India and Pakistan are placed with Nepal in Group A, while Group B will be more competitive with Afghanistan, Bangladesh and defending champion Sri Lanka. The top two teams from each group will qualify for the Super Four round. The four then play each other once, and the top two will qualify for the final. Cricket fans may be rubbing their eyes in wonder with the inclusion of Nepal in the last six. It’s a country better known for Mount Everest, the Himalayas and the hardy Sherpas who guide the mountain climbers up treacherous trails. But in recent years the landlocked country has become a rising force in associate cricket and caused a huge upset in the 10-team qualifying phase for the Asia Cup by surprising the United Arab Republic in the final by seven wickets. Led by 20-year-old Rohit Paudel the country is ranked 15th in the ICC standings and tiny Nepal is hoping to cause a stir playing the big boys. It’s unlikely to happen but most fans will be rooting for Nepal to spring a Mount Everest-sized upset over Pakistan or India. India has won the Asia Cup on seven occasions and will start as hot favourite to lift the trophy again as it is stacked with a bunch of talented players. Virat Kohli, considered among the top two batsmen in the world, is expected to put up some big scores and he will have solid support from skipper Rohit Sharma, Shubman Gill, Suryakumar Yadav, newcomer Tilak Varma and Ishan Kishan. The bowling is also well balanced with the return of fast bowler Jasprit Bumrah, Mohammad Shami and spinners Ravindra Jadeja and Axar Patel. It’s unfortunate the selectors left out Yashasvi Jaiswal who has had a brilliant run with the bat in recent months and all-rounder Ravichandran Ashwin. Sharma will be imploring his team not to leave anything to chance as winning this tournament will make small amends for failing to win an ICC-run tournament since 2011. A victory would pacify the restless Indian fans who are getting more upset every time their multi-millionaire fail on the choke on the main stage. India’s biggest challenge will come from Pakistan, a team that also has a well-rounded lineup and will be led by captain and run-scoring machine Babar Azam who along with Kohli are the two best batsmen in the world today. Azam has a number of world-class batsmen in Mohammad Rizwan, Abdullah Shafique, Fakhar Zaman and Imam-ul-Haq in the lineup. The country will lean on 23-year-old Shaheen Afridi to rattle the opposition with his fiery pace and his supporting new-ball cast will include Haris Rauf and Naseem Shah. Pakistan hasn’t won the Asia Cup since 2012 and Babar will be hoping to reverse the trend this time. Sri Lanka, a former World Cup champion, has made its mark in this tournament by pocketing the trophy on six occasions but it faces an uphill task this time as the squad led by Dasun Shanakahas been dealt a significant blow through injuries. Fast bowlers Dilshan Madushanka and Lahiru Kumara have been forced to withdraw from the tournament due to injuries and this will leave a huge void in the island’s attack. To add to its woes Wanindu Hasaranga, one of the world’s top spinners, may also not see action because of a thigh strain. The two other countries — Bangladesh and Afghanistan — will be a handful and could mount a huge challenge to both India and Pakistan. Back in the fold for Bangladesh is Shakib Al Hasan who is rated as one the world’s best all-rounders. That alone isn’t good enough to win the crown but the country has a number of players ready to make their presence felt. Despite the problems in their country Afghanistan continues to prove it’s a team to watch internationally as it has the world’s best spin attack in Rashid Khan and Majeedur Rahman. Others set to make their mark include Mohammad Nabi, Hasmatullah Shahidi and Najibullah Zadran. Check out our sports section for the latest news and analysis. Care for a wager? Head to our sports betting section for news and odds.","pubDate":"2023-08-29 19:20:14","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/08/AFP_33TN4GQ-scaled-e1693336806148.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"4d5cffba34d77c817ce225836318c86e","title":"'एशिया कप के सभी मैच पाकिस्तान में होते, तो अच्छा होता', बाबर आजम ने दिया ये चुभने वाला बयान","link":"https://www.indiatv.in/sports/cricket/asia-cup-2023-pakistan-captain-babar-azam-said-that-if-all-the-matches-held-in-pakistan-2023-08-30-984918","keywords":null,"creator":null,"video_url":null,"description":"एशिया कप 2023 का पहला मैच पाकिस्तान और नेपाल के बीच खेला जाएगा, लेकिन इससे पहले पाकिस्तानी कप्तान बाबर आजम ने बड़ा बयान दिया है।","content":"एशिया कप 2023 में पाकिस्तानी टीम अपना पहला नेपाल के खिलाफ खेलेगी। इसके लिए पाकिस्तान ने प्लेइंग इलेवन का भी ऐलान कर दिया है। एशिया कप 2023 का आयोजन पाकिस्तान और नेपाल की धरती पर हो रहा है। पाकिस्तान में लंबे समय बाद कोई बड़ा टूर्नामेंट खेला जाएगा। अब पाकिस्तान के कप्तान बाबर आजम ने एशिया कप से एक दिन पहले बड़ा बयान दिया है। पाकिस्तान के कप्तान बाबर आजम एशिया कप की मेजबानी के 'हाइब्रिड मॉडल' को लेकर किसी तरह का मसला खड़ा नहीं करना चाहते हैं लेकिन उनका मानना है कि अगर इस टूर्नामेंट के सभी मैचों का आयोजन उनके देश में होता तो अच्छा होता। पाकिस्तान क्रिकेट बोर्ड के पास एशिया कप की मेजबानी अधिकार हैं लेकिन जय शाह की अगुवाई वाली एशियाई क्रिकेट परिषद ने हाइब्रिड मॉडल को चुना जिसमें कुछ मैचों की मेजबानी श्रीलंका करेगा। इनमें भारत और पाकिस्तान के बीच होने वाले मैच भी शामिल हैं। बाबर ने नेपाल के खिलाफ मैच से पहले प्रेस कॉन्फ्रेंस में कहा कि अगर आप मुझसे पूछो तो अच्छा होता अगर पूरा टूर्नामेंट पाकिस्तान आयोजित करता लेकिन दुर्भाग्य से इसको लेकर कुछ नहीं किया जा सकता। पेशेवर होने के नाते जो भी शेड्यूल है हम उसके लिए तैयार हैं। इनमें सफर करना और लगातार मैच खेलना भी शामिल हैं और हम इसके लिए तैयार हैं। नेपाल के खिलाफ मैच से पहले पाकिस्तान की ने अपनी प्लेइंग इलेवन का ऐलान कर दिया है। प्लेइंग इलेवन में तीन तेज गेंदबाज, 2 ऑलराउंडर और 6 बल्लेबाजों को जगह मिली है। तेज गेंदबाजों के रूप में शाहीन अफरीदी, हैरिस राऊफ और नसीम शाह को मौका मिला है। बाबर आजम (कप्तान), इमाम उल हक, फखर जमां, मोहम्मद रिजवान, आगा सलमान, इफ्तिखार अहमद, शादाब खान, मोहम्मद नवाज, नसीम शाह, शाहीन शाह अफरीदी, हैरिस राऊफ। (Input: PTI)","pubDate":"2023-08-29 18:46:54","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2fa1aa8379fedbd34ef112f1f98838c9","title":"Would have been good if whole tournament was in Pakistan but unfortunately...: Babar Azam ahead of Asia Cup","link":"https://www.indiatvnews.com/sports/cricket/would-have-been-good-if-whole-tournament-was-in-pakistan-but-unfortunately-babar-azam-ahead-of-asia-cup-2023-2023-08-30-889713","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup will be played in a hybrid model for the first time in its 39-year history. With the BCCI refusing Team India's travel to Pakistan, the tournament will be played in both Pakistan and Sri Lanka with the original hosts getting four games and the remaining nine matches will take place in the island nation. Pakistan skipper Babar Azam said that the situation isn't ideal as it would have been better if the whole tournament was in the home country only but it is what it is.","content":"Asia Cup will be played in a hybrid model for the first time in its 39-year history. With the BCCI refusing Team India's travel to Pakistan, the tournament will be played in both Pakistan and Sri Lanka with the original hosts getting four games and the remaining nine matches will take place in the island nation. Pakistan skipper said that the situation isn't ideal as it would have been better if the whole tournament was in the home country only but it is what it is. Speaking at the press conference ahead of his side's first match of Asia Cup 2023 against Nepal, Babar said, \"If you ask me, it would have been good if the whole tournament would have been held in Pakistan but unfortunately nothing can be done about it. The tournament may have been carefully scheduled and planned but it is definitely going to take a toll on the players with continuous to-and-fro between the two countries. Pakistan place on Wednesday, August 30, travel the next day to Sri Lanka, play India on September 2 and then come back the next day to play their Super Fours game on September 6, \"As professionals, we are ready for any schedule that is given to us. There would be travelling as well as back-to-back games and we are ready for that,\" said Babar regarding travel. The skipper was quick to mention that the team management and the medical staff have carefully planned the itinerary for the team so that they they get optimal rest between games and travel. \"Our coaches and support staff have chalked out plans about how much we would utilise each player and also we have booked our flights in such a manner, that our travelling schedule gives enough time to rest,\" Babar further added. Pakistan have already announced their playing XI for the first-ever clash against Nepal across any format as they will be putting out their strongest XI for the clash.","pubDate":"2023-08-29 18:33:46","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d153f3ec9a1676e7b68248db86df651b","title":"Two centuries in vain in match-week six of NPL","link":"https://www.chronicle.co.zw/two-centuries-in-vain-in-match-week-six-of-npl/","keywords":["Headlines","Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com ONLY two batters managed to reach the magic three digits on Round Six of the National Cricket Premier League (NCPL) over the weekend. However, those two centuries were in vain as they yielded no victories in a week where both batters and bowlers managed to give impressive performances. A total of seven […]","content":"The Chronicle ONLY two batters managed to reach the magic three digits on Round Six of the National Cricket Premier League (NCPL) over the weekend. However, those two centuries were in vain as they yielded no victories in a week where both batters and bowlers managed to give impressive performances. A total of seven matches were played, three on Saturday and four on Sunday. The first century scored this week came from the bat of Golden Bulls skipper, Shane Chigumbura in their 62 runs defeat at the hands of Rainbow Cricket Club on Saturday while the second and the last of the week was scored by Westside Cricket Club’s opening batter Tinashe Chiorah in a match that was cancelled due to bad light against Takashinga Patriots 2 on Sunday. Chigumbura had the highest individual score during round six of the country’s premier club cricket competition. Batting on top of the order, he fell for a gallant 115 runs from 114 balls as they were chasing a target of 278 runs having bowled out their opponents for 275 in 39 overs. Golden Bulls went on to finish on 213 all out in 42,1 overs. Chiorah remained unshaken with the bat as Westside Cricket Club posted a mammoth 304/8 in their 45 overs with the opener scoring a brilliant 105 runs not out from just 83 deliveries. The match however, was brought to a close on the first over of the second innings as umpires deemed it unsafe to continue due to bad light. Takashinga were on six runs without any wicket lost. It turned out to be good individual achievements for Chigumbura and Chiorah, however they would feel hard done as both their respective teams could not go on to collect maximum points on the day. The duo were however not the only ones who had good days at the ovals with the bat on Round Six with a number of batters falling short of their individual milestones as well. On Saturday, young Matthew Campbell fell just 10 runs short of his ton for Rainbow Cricket Club against Chigumbura’s Golden Bulls while his opening partner, Muhammad Zaheer Tufail also looked on course for a ton. Campbell fell for 90 runs from 90 balls while Tufail scored 76 runs after facing 58 deliveries. On the same day, two more half centuries were scored by batters from the same team. Ryan Kamwemba and Tariro Makauyo scored 64 and 57 runs respectively for Uprising Cricket Club while in the same match for Mutare Sports Club, Spencer Magodo scored a gallant 81 runs not out from 91 deliveries as they suffered a 46 runs defeat. Kevin Kasuza, for Westside Cricket Club chipped in with the last half century on Saturday, scoring 77 runs from 61 balls. The other batters who managed to reach half centuries were Milton Shumba, Tony Munyonga and Clive Madande as they helped defending champions Gladiators register a 177 runs win over Bulawayo Athletic Club (BAC). Tinashe Kamhunukamwe and Timycen Maruma also scored half centuries which helped Takashinga Patriots 1 register an eight wickets victory over Mbizo Cricket Club. It was not only a batters’ week to shine as some bowlers stood up to the task with ball in hand to produce match winning spells. Leading the match-week six bowling pack is Queens Cricket Club’s Tanatswa Bechani who took the best figures so far this season. Bechani produced a spell for the ages, finishing with figures of 7/13 in 7,2 overs to help his side register a 105 runs win over Scorpions Cricket Club, which was their second victory in nine matches. He was one of the two bowlers who managed to claim fifers on week six. The other bowler was Chigumbura who finished with figures of 5/46 five overs in Golden Bulls’s 62 runs defeat at the hands of Rainbow Cricket Club. Bowlers such as Daniel Jackiel, Donald Tiripano and Nyasha Dube managed to claim four wickets each for their respective teams to round up an action-packed weekend of entertaining club cricket. The NPL resumes tomorrow with five matches lined up. Headlining the games is a Bulawayo derby pitting Amakhosi and BAC at the latter’s home ground. In other matches, Kadoma Cricket Club will be up against Rainbow Cricket Club at Old Hararians while Takashinga Patriots 1 will host Queens Cricket Club at Kwekwe Sports Club. The last two matches will be between Scorpions Cricket Club and Uprising Cricket Club at Takashinga Cricket Club while Mutare Sports Club will host Westside Cricket Club. – @brandon_malvin","pubDate":"2023-08-29 18:30:04","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"7d8c8dd79db0154185303759a26a8fc0","title":"Asia Cup 2023: We want to be competitive against India and Pakistan, says Nepal skipper Rohit Paudel","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2023-we-want-to-be-competitive-against-india-and-pakistan-says-nepal-skipper-rohit-paudel-13055322.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2023: We want to be competitive against India and Pakistan, says Nepal skipper Rohit Paudel","content":"Cricket Asia Cup 2023: We want to be competitive against India and Pakistan, says Nepal skipper Rohit Paudel The Nepal team is all set to make their Asia Cup debut, having been clubbed in Group A alongside the hosts and India in their first-ever appearance at the Asia Cup. FirstCricket Staff Last Updated:August 29, 2023 23:40:58 IST File image of Nepal captain Rohit Paudel. Image credit: Cricket Association of Nepal Multan : Nepal skipper Rohit Paudel has asserted that his team is capable of being competitive against hosts Pakistan and India in the 2023 Asia Cup, starting Wednesday. The Nepal team is all set to make their Asia Cup debut, having been clubbed in Group A alongside the hosts and India. “We are playing for the first time, and it’s a big achievement for all of us. Pakistan is a very good side, and we want to give a competitive game to them, as well as India. So, we deserve to be here,” cited Paudel during the pre-match press conference on Tuesday. Related Articles Asia Cup 2023: Rape-accused Sandeep Lamichhane doubtful for tournament, set to stand trial Asia Cup 2023: Pakistan vs Nepal to kick things off, live streaming, head-to-head When asked about the biggest difference between his side and the Pakistanis, he said that barring experience, there is not much difference between the two sides. “The difference would be the experience. If you count on skills, both batting and bowling are the same (for both sides). But, if you count on experience, Pakistan is an experienced side.” “Both the teams have world-class bowlers and batsmen. Our focus is to win one ball (at a time), regardless of who the opponent is,” added Paudel. The Rhinos are coming off straight competitive outings, having participated in the ICC World Cup Qualifiers, where it finished eighth, followed by the ACC Emerging Teams Asia Cup, failing to progress beyond the group stage. Paudel credited the two tournaments as good preparation platforms for the Asia Cup, besides admitting that the expectations are high from them. “We had some good preparations. We played in Zimbabwe (ICC World Cup Qualifiers) and the Emerging Asia Cup. So, we are well-prepared.” “There have been a lot of expectations from us. All Neaplese have been dreaming for this Asia Cup.” “We have been playing for more than two decades, and it’s a great opportunity to represent our country at the highest level, especially in Asia Cup. So, it’s a big occasion for all of us,” he concluded. Published on: August 29, 2023 23:40:58 IST Tags: Asia Cup Asia Cup 2023 Nepal Cricket Team Rohit Paudel","pubDate":"2023-08-29 18:10:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/Rohit-Paudel-Cricket-Association-of-Nepal-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"9b836bec6ad6fed25c36f0bd13e4d5b6","title":"Asia Cup 2023: Pakistan should have hosted the entire tournament, says skipper Babar Azam","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2023-pakistan-should-have-hosted-the-entire-tournament-says-skipper-babar-azam-13055292.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2023: Pakistan should have hosted the entire tournament, says skipper Babar Azam","content":"Cricket Asia Cup 2023: Pakistan should have hosted the entire tournament, says skipper Babar Azam While the PCB had originally been awarded the hosting rights for the tournament, several matches had to be moved to Sri Lanka to the BCCI’s refusal to send the Indian team to Pakistan. FirstCricket Staff Last Updated:August 29, 2023 23:37:24 IST File image of Pakistan captain Babar Azam. Image credit: X/@TheRealPCB On the eve of the opening game of the 2023 Asia Cup, Pakistan captain Babar Azam wished the entire tournament had taken place in his home country. The Pakistan Cricket Board (PCB) had been awarded the hosting rights for the 2023 edition of the tournament, marking the first time a major event involving multiple nations has taken place in the country since the 2008 edition of the same event. However, due to the Board of Control for Cricket in India’s (BCCI) reluctance to send the Indian team to Pakistan due to political tensions between the two nations, several matches — including all of India’s fixtures as well as the final — had to be moved to Sri Lanka, although the PCB has retained the hosting rights for the same. Related Articles Clean sweep against Afghanistan 'will give us confidence during the Asia Cup': Pakistan captain Babar Azam Asia Cup 2023: Pakistan vs Nepal to kick things off, live streaming, head-to-head Also Read | Bangladesh express helplessness over travel in hybrid model Speaking ahead of the opening match of the tournament against Nepal in Multan, Pakistan skipper Babar wished the entire tournament had been hosted on Pakistani soil instead of two nations — a first in the tournament’s history. “If you ask me, it would have been good if the whole tournament would have been held in Pakistan, but unfortunately, nothing can be done about it,” Babar told reporters on Tuesday. . @babarazam258 on Pakistan earning the top spot in the ODI rankings Full press conference ➡️ https://t.co/V3oeqje8G0 #AsiaCup2023 pic.twitter.com/5iX4CahlSh — Pakistan Cricket (@TheRealPCB) August 29, 2023 Pakistan start their campaign on Wednesday against Nepal in Multan and then fly to Sri Lanka the very next day for the big-ticket clash against India at Pallekele on 2 September. Within 24 hours, they are back in Lahore for their Super Four game on 6 September and then again fly back to Sri Lanka the next day for the next game on 9 September. Also Read | Pakistan vs Nepal Asia Cup 2023 preview, live streaming, head-to-head “As professionals, we are ready for any schedule that is given to us. There would be travelling as well as back-to-back games and we are ready for that,” said Babar. “Our coaches and support staff have chalked out plans about how much we would utilise each player and also we have booked our flights in such a manner, that our travelling schedule gives enough time to rest,” the skipper said. While he didn’t want to divulge his strategy about the India game, he expects that his team would put up the best show possible. “We want to continue with this momentum. Pakistan’s match against India will be a high-intensity game and we want to play our best cricket on the given day,” he added. Also Read | ‘Pressure match…’, Rizwan on what makes IND-PAK rivalry exciting The skipper, rated as one of the premier batters in contemporary cricket, is happy that Pakistan team is currently ranked No 1 in ODIs and also a lot of their players are in top 10. “I needed to take the team to a different level and change mindset. Now, we have at least 3-4 players in top-10 and when you set a standard, there will be expectations and you have to fulfil those expectations. Performances should be such that the team wins,” he added. With inputs from PTI Published on: August 29, 2023 23:37:24 IST Tags: Asia Cup Asia Cup 2023 Babar Azam Pakistan Cricket Team","pubDate":"2023-08-29 18:07:24","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Babar-Azam.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6dc8cf7f3059089616a8cea6c896a083","title":"Raza named Lucia Kings captain","link":"https://www.chronicle.co.zw/raza-named-lucia-kings-captain/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com ZIMBABWE international cricketer, Sikandar Raza is continuing with his impressive show on the global stage as he has been named the new captain of his Caribbean Premier League (CPL) side, St Lucia Kings. The Chevrons stalwart replaces South African legend Faf Du Plessis at the helm of the top placed St Lucia Kings. […]","content":"The Chronicle ZIMBABWE international cricketer, Sikandar Raza is continuing with his impressive show on the global stage as he has been named the new captain of his Caribbean Premier League (CPL) side, St Lucia Kings. The Chevrons stalwart replaces South African legend Faf Du Plessis at the helm of the top placed St Lucia Kings. Du Plessis suffered an elbow injury and has been ruled out for the rest of the season. This will be Raza’s second stint as a captain in an internationally recognised T20 franchise league. His previous and first stint as a skipper came last year when he captained Dambulla Aura in the absence of Dasun Shanaka in the Lankan Premier League (LPL). Raza’s predecessor, Du Plessis has rallied behind him to do a good job as he comes in with a lot of T20 franchise experience having taken part in some big competitions such as the Indian Premier League (IPL) and the Pakistan Super League (PSL). “Raza is someone who has played a lot of T20 and T10 cricket. So very much an experienced brain there, so, it’s great to have those guys on the field and ask questions. Obviously, it’s a change and probably you could say a big change because it’s someone stepping into the shoes for the first time with the St Lucia Kings. “But luckily, we’ve got someone like Sammy there who will make sure for the first one or two games there will be some direction from his side. And then trust the guy on the field with the resources that he has at his disposal,” said Du Plessis after their match on Saturday. Commenting on the issue, Raza said they will miss Du Plessis as he has done a lot of good work for the team and is grateful to have a team like St Lucia Kings which has a lot of good players and everything will take care of itself. “It is true apparently. Faf has done such a fantastic job with this team, we are going to miss him dearly but most importantly we wish him well because he is going for a surgery so a lot of prayers for him. We wish Faf a successful surgery and quick recovery because this family is incomplete without him. “For my side, when you have so many good professionals and great guys with great attitudes then captaining is not really a big thing, everything looks after itself because everybody is so focused and motivated to do well,” said Raza. In their previous match against Trinbago Knight Riders on Saturday, Raza was named player of the match after helping St. Lucia Kings register a 54 runs win. He put up a good all-round performance. Batting first, Raza scored 32 runs from 23 balls as his side finished on 167/5 in 20 overs before going on to finish with bowling figures of 2/31 in three overs to help St. Lucia Kings bowl out their opponents for 113 runs in 14,5 overs and win their second match in five matches. Raza’s first assignment as the captain comes on Sunday against fifth placed Barbados Royals in Bridgetown. This will be their seventh match of the campaign. – @brandon_malvin","pubDate":"2023-08-29 22:04:43","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"8f24e2b21cd34923b81e76b86bc3ba35","title":"Good, bad, and some UGLY!","link":"https://times-age.co.nz/opinion/some-good-some-bad-and-some-ugly/","keywords":["Opinion","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"More gold medals, a bounce-back win, a gutsy title defence, a spectacular crash, a record defeat, and a hunger strike are highlights and lowlights of the past week in sport. So it’s time to draw revolvers on this week’s ‘Good, Bad and Ugly’. GOOD Hats off to our five cricketers to be awarded major association […]","content":"More gold medals, a bounce-back win, a gutsy title defence, a spectacular crash, a record defeat, and a hunger strike are highlights and lowlights of the past week in sport. So it’s time to draw revolvers on this week’s ‘Good, Bad and Ugly’. Hats off to our five cricketers to be awarded major association contracts. Melissa Hansen, Emma McLeod, Georgia Atkinson, and Ocean Bartlett will don the green and gold of the Central Hinds, and Gemma Sims will pad up for the Wellington Blaze. There is also the selection of the multi-talented Vanessa Taylor for the Capital Football Youth Development squad. Adept at hockey and football, the St Matthew’s student has a bright future. Copthorne Wairarapa-Bush bounced back from their 50–3 shellacking at the hands of North Otago to power home for a 30–24 win over Poverty Bay and move to fifth equal in the Heartland standings. Dame Lisa – three gold medals taking her total haul to 15 at world championships – what more can one say about arguably world canoeing’s greatest-ever paddler? Scot ‘the Iceman’ Dixon kept alive his chances of a seventh IndyCar Championship, cruising to a 22-second win on the St Louis oval and his 55th career victory, while Liam Lawson’s 13th in his debut Formula One start may not look all that flash, but his performance in an uncompetitive car impressed many pundits, who opined there is a good future ahead. It wasn’t pretty, but the Warriors did what they had to in beating the Dragons 18–6 to lock in a top-four finish and two lives for the NRL final series. Fiji 30, England 22 – the Bula Boys scored a memorable win at Twickenham, and Samoa just went down 13-17 to world number one Ireland. Could this be the year of the Pasifika at the World Cup? Let’s hope they and the Tongans can set the tournament alight! Talk about tough, Mea Motu dislocating her shoulder in the first round of her 10-round world super bantamweight fight with Malawi’s Ellen Simwaka and going on to retain her belt. What has happened to Lydia Ko? Not only has she slipped to sixth in the world rankings, but a shambolic 10-over par at the latest LPGA event in Vancouver was her worst-ever round on the tour. Please tell me that the pedantic refereeing, and microscopic intervention of the TMO, which saw the first half of the All-Blacks – Springboks game take an hour to complete, is not the blueprint for the World Cup. If it is, we could be in for the baddest – verging on the ugliest – watch yet. Nascar driver Ryan Preece’s Ford barrel rolling at least 10 times at Daytona after clipping another car at 300kmh. Amazingly Preece was able to climb out of his mangled car, and he escaped any significant injury. Staying on the injury front, Tohu Harris’s injured back, which has the Warriors captain in doubt for the NRL playoffs, and Tyrel Lomax’s gashed knee that needed 30 stitches and will see him miss some of the early All Black World Cup matches. Poor discipline, poor execution, and poor attitude equal an ugly outcome. In my 58 years of watching All Blacks’ rugby, I’m struggling to recall a more inept effort in a test as the 35–7 trouncing at the hands of our fiercest foes. The 2019 semifinal loss to England, the 1999 semifinal defeat to France and a 28–7 loss to Australia, and losses to England in 1983 and 1993 come close, but I’m battling to remember anything akin to the pummelling the rampant Boks subjected us to at Twickenham. Am I worried? No! Nor are the bookies; Ladbrokes still have the men in black joint 3/1 favourites with France to lift the Webb Ellis Cup. The World Cup is a completely different beast, and the Twickenham result means diddlysquat, but why give the already confident Saffas an adrenaline boost two weeks out from the World Cup kickoff? Credit to South Africa, they were very good, but we were awful. Boys, you should’ve stayed on the bus, but going on that effort, I think most of you did. The saga surrounding Spanish Football Federation president Luis Rubiales and the unwanted kiss on Jenni Hermoso’s lips during the World Cup presentation gets uglier and weirder by the day. Not only does Rubiales refuse to resign, but now his mother has gone on a hunger strike because of the “inhumane hounding” of her son. Bizarrely, she has locked herself in a church where no doubt she can survive on communion wafers and wine and confess the sins of her son.","pubDate":"2023-08-29 22:00:00","image_url":"https://times-age.co.nz/wp-content/uploads/2023/08/503033-1024x683.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"8da59438a08eadfdd31338ff7648a5d9","title":"‘India vs Pakistan surpasses the Ashes,’ says Tom Moody","link":"https://kashmirreader.com/2023/08/30/india-vs-pakistan-surpasses-the-ashes-says-tom-moody/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"New Delhi: It’s that time in world cricket again. India play Pakistan in the group stage of the 2023 Asia Cup on Saturday, September 2 at Pallekele. A fixture that may take place two more time over the course of next fortnight as the six-team competition may see the two lock horns in the Super […]","content":"New Delhi: It’s that time in world cricket again. India play Pakistan in the group stage of the 2023 Asia Cup on Saturday, September 2 at Pallekele. A fixture that may take place two more time over the course of next fortnight as the six-team competition may see the two lock horns in the Super 4 and even the final. In October, the two face off in the ODI World Cup in the 1 lakh plus capacitated Narendra Modi Stadium in Ahmedabad. And so, the buzz around the contest is quite palpable. Former Australia cricketer Tom Moody has no doubts, it is the biggest cricket fixture in world cricket. Even above the Ashes, despite the oldest Test cricket rivalry producing an enticing 2-2 series recently in England. “I think this match surpasses the Ashes,” Moody told Star Sports. “It’s always got a lovely story to it, and both are outstanding cricketing nations.” Deciphering the two teams and the players on show, he added, “And when you look at that Pakistan squad, it does boast a lot of talent. But one thing that stands out for me is that it also boasts experience. So now they have the combination of experience and talent, they are a real threat. They can match India with their pace bowling; they’ve got genuine pace on their side, and the only issue I see them potentially having is the depth in the quality of their batting which India has got. So that’s going to be the interesting pressure that they put on the likes of Babar Azam at the top of the order.” The last four meetings between the India and Pakistan have been all in T20Is, with both the teams having shared the spoils. While Pakistan beat India in their group stage fixture of the 2021 T20 World Cup, the men in blue returned the favor in the 2022 edition at Melbourne. At the Asia Cup last year, both would win a game each. The last 50-over contest between the two nations dates back to June 16, 2019 when Virat Kohli-led India beat Sarfaraz Khan’s Pakistan at the 2019 World Cup in Manchester. When asked about which player he thinks possesses the biggest threat to the Indian batting, Moody wouldn’t hesitate before naming, “Shaheen Afridi. Full Stop. I just think that Shaheen Afridi with the new ball is a major threat, which he has done historically. Broken through with that new ball, manages to blow away a couple of early wickets, which then opens up the middle order for India to resurrect things. Particularly for a middle order that hasn’t had a lot of game time.” India and Pakistan are pitted against Nepal in Group A of the Asia Cup, while Sri Lanka – who are co-hosting the tournament alongside Pakistan – are with Bangladesh and Afghanistan in Group B. Agencies ‘India vs Pakistan surpasses the Ashes,’ says Tom Moody added by KR Desk on 3:04 am August 30, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-29 21:34:21","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"84354882d273632354e3c6435afc4a78","title":"Difficult situations still excites me after 15 years of int’l cricket: Kohli","link":"https://kashmirreader.com/2023/08/30/difficult-situations-still-excites-me-after-15-years-of-intl-cricket-kohli/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Virat Kohli has mastered several obstacles during his illustrious career but the former Indian skipper on Monday said the upcoming ICC World Cup 2023 presents him with an exciting new challenge, something he still relishes after a decade and half of top flight cricket. The 13th edition of the quadrennial extravaganza will be […]","content":"New Delhi: Virat Kohli has mastered several obstacles during his illustrious career but the former Indian skipper on Monday said the upcoming ICC World Cup 2023 presents him with an exciting new challenge, something he still relishes after a decade and half of top flight cricket. The 13th edition of the quadrennial extravaganza will be played in India across October and November, and Kohli said he is gearing up for the challenge of playing a World Cup at home. . “Any challenge in front of you, you look forward to it. When difficulty comes in front of you get excited. You don’t shy away from it. After 15 years I still like encounters, and the World Cup 2023 is one (challenge). It excites me, I need something new to, you know, propel me to another level,”said Kohli during a promotional event. Kohli did not deny that there is pressure of expectations on him and the team. But Kohli reminded everyone that no one wants to win the World Cup more than the players themselves. “The pressure is always there. The fans always say we want (the team) to win a cup very badly. I’d like to say not more than me. So, I’m in the right place. Honestly, I know the expectations are there and the emotions of the people are there. But please know that no one wants to win more than players,” he said. Kohli, though, is no stranger to winning a World Cup. He had led India to the ICC U-19 World Cup victory back in 2008 and he was also part of the MS Dhoni-led India side that triumphed in the 2011 50-over World Cup at home. My career highlight ïs obviously winning the World Cup in 2011. I was 23 at the time, and I probably didn’t understand the magnitude of it. But now at 34, and has played many World Cups, which we haven’t been able to win, So,I understand the emotions of all the senior players (in 2011). “All the more for Sachin Tendulkar, as it was his last World Cup. He had already played many World Cups by then and to win it in Mumbai, his hometown, was very special for him. I mean, it was stuff from dreams,” said Kohli. Kohli also remembered the pressure piled on players ahead and during 2011 World Cup. “I remember the amount of pressure there was on all the players when we were travelling, Thankfully, there was no social media back then. It would have been a nightmare, honestly. But through the airports, it was always just one thing — we need to win the Cup,” he said. “The senior players were always under the pump and to handle all that pressure. It was just brilliant. And that night (after the WC win) in itself was something magical,” he added. PTI Difficult situations still excites me after 15 years of int’l cricket: Kohli added by Press Trust of India on 3:01 am August 30, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-29 21:31:45","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"750d69b406ba221c25077030ab10486a","title":"Pakistan favoured to give India a run for its money in hunt for Asia Cup","link":"https://torontosun.com/sports/other-sports/pakistan-favoured-to-give-india-a-run-for-its-money-in-hunt-for-asia-cup","keywords":["Other Sports","Sports"],"creator":["Norm Da Costa"],"video_url":null,"description":"Pride of Asia is on the line","content":"The pride of Asia is on the line in the six-nation Asia Cup that will be played in Pakistan and Sri Lanka. Pakistan opens the six-team tournament against Nepal on Wednesday and on Saturday comes the big one. It’s the showdown between bitter political rivals Pakistan and India who share a border and a bloodied history that includes going to war on four occasions. The two super-giants of the game meet in a group match in the 35,000-seat stadium in Pellekele, Sri Lanka, which will be filled to the brim while there will be millions around the world glued to their television sets. The two countries will essentially grind to a halt as has happened each time these two meet in international competitions. Off the field there has always been a degree of resentment between the fans while there is a modicum of respect and friendliness between the players. One would think these two powerhouses would be separated from meeting each other at the group stage but there has not been such luck. In fact, the International Cricket Council has admitted it pairs these two teams in the same group because of the financial windfall. In this tournament India and Pakistan are placed with Nepal in Group A, while Group B will be more competitive with Afghanistan, Bangladesh and defending champion Sri Lanka. The top two teams from each group will qualify for the Super Four round. The four then play each other once, and the top two will qualify for the final. Cricket fans may be rubbing their eyes in wonder with the inclusion of Nepal in the last six. It’s a country better known for Mount Everest, the Himalayas and the hardy Sherpas who guide the mountain climbers up treacherous trails. But in recent years the landlocked country has become a rising force in associate cricket and caused a huge upset in the 10-team qualifying phase for the Asia Cup by surprising the United Arab Republic in the final by seven wickets. Led by 20-year-old Rohit Paudel the country is ranked 15th in the ICC standings and tiny Nepal is hoping to cause a stir playing the big boys. It’s unlikely to happen but most fans will be rooting for Nepal to spring a Mount Everest-sized upset over Pakistan or India. India has won the Asia Cup on seven occasions and will start as hot favourite to lift the trophy again as it is stacked with a bunch of talented players. Virat Kohli, considered among the top two batsmen in the world, is expected to put up some big scores and he will have solid support from skipper Rohit Sharma, Shubman Gill, Suryakumar Yadav, newcomer Tilak Varma and Ishan Kishan. The bowling is also well balanced with the return of fast bowler Jasprit Bumrah, Mohammad Shami and spinners Ravindra Jadeja and Axar Patel. It’s unfortunate the selectors left out Yashasvi Jaiswal who has had a brilliant run with the bat in recent months and all-rounder Ravichandran Ashwin. Sharma will be imploring his team not to leave anything to chance as winning this tournament will make small amends for failing to win an ICC-run tournament since 2011. A victory would pacify the restless Indian fans who are getting more upset every time their multi-millionaire fail on the choke on the main stage. India’s biggest challenge will come from Pakistan, a team that also has a well-rounded lineup and will be led by captain and run-scoring machine Babar Azam who along with Kohli are the two best batsmen in the world today. Azam has a number of world-class batsmen in Mohammad Rizwan, Abdullah Shafique, Fakhar Zaman and Imam-ul-Haq in the lineup. The country will lean on 23-year-old Shaheen Afridi to rattle the opposition with his fiery pace and his supporting new-ball cast will include Haris Rauf and Naseem Shah. Pakistan hasn’t won the Asia Cup since 2012 and Babar will be hoping to reverse the trend this time. Sri Lanka, a former World Cup champion, has made its mark in this tournament by pocketing the trophy on six occasions but it faces an uphill task this time as the squad led by Dasun Shanakahas been dealt a significant blow through injuries. Fast bowlers Dilshan Madushanka and Lahiru Kumara have been forced to withdraw from the tournament due to injuries and this will leave a huge void in the island’s attack. To add to its woes Wanindu Hasaranga, one of the world’s top spinners, may also not see action because of a thigh strain. The two other countries — Bangladesh and Afghanistan — will be a handful and could mount a huge challenge to both India and Pakistan. Back in the fold for Bangladesh is Shakib Al Hasan who is rated as one the world’s best all-rounders. That alone isn’t good enough to win the crown but the country has a number of players ready to make their presence felt. Despite the problems in their country Afghanistan continues to prove it’s a team to watch internationally as it has the world’s best spin attack in Rashid Khan and Majeedur Rahman. Others set to make their mark include Mohammad Nabi, Hasmatullah Shahidi and Najibullah Zadran. Check out our sports section for the latest news and analysis. Care for a wager? Head to our sports betting section for news and odds.","pubDate":"2023-08-29 19:20:14","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/08/AFP_33TN4GQ-scaled-e1693336806148.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"4d5cffba34d77c817ce225836318c86e","title":"'एशिया कप के सभी मैच पाकिस्तान में होते, तो अच्छा होता', बाबर आजम ने दिया ये चुभने वाला बयान","link":"https://www.indiatv.in/sports/cricket/asia-cup-2023-pakistan-captain-babar-azam-said-that-if-all-the-matches-held-in-pakistan-2023-08-30-984918","keywords":null,"creator":null,"video_url":null,"description":"एशिया कप 2023 का पहला मैच पाकिस्तान और नेपाल के बीच खेला जाएगा, लेकिन इससे पहले पाकिस्तानी कप्तान बाबर आजम ने बड़ा बयान दिया है।","content":"एशिया कप 2023 में पाकिस्तानी टीम अपना पहला नेपाल के खिलाफ खेलेगी। इसके लिए पाकिस्तान ने प्लेइंग इलेवन का भी ऐलान कर दिया है। एशिया कप 2023 का आयोजन पाकिस्तान और नेपाल की धरती पर हो रहा है। पाकिस्तान में लंबे समय बाद कोई बड़ा टूर्नामेंट खेला जाएगा। अब पाकिस्तान के कप्तान बाबर आजम ने एशिया कप से एक दिन पहले बड़ा बयान दिया है। पाकिस्तान के कप्तान बाबर आजम एशिया कप की मेजबानी के 'हाइब्रिड मॉडल' को लेकर किसी तरह का मसला खड़ा नहीं करना चाहते हैं लेकिन उनका मानना है कि अगर इस टूर्नामेंट के सभी मैचों का आयोजन उनके देश में होता तो अच्छा होता। पाकिस्तान क्रिकेट बोर्ड के पास एशिया कप की मेजबानी अधिकार हैं लेकिन जय शाह की अगुवाई वाली एशियाई क्रिकेट परिषद ने हाइब्रिड मॉडल को चुना जिसमें कुछ मैचों की मेजबानी श्रीलंका करेगा। इनमें भारत और पाकिस्तान के बीच होने वाले मैच भी शामिल हैं। बाबर ने नेपाल के खिलाफ मैच से पहले प्रेस कॉन्फ्रेंस में कहा कि अगर आप मुझसे पूछो तो अच्छा होता अगर पूरा टूर्नामेंट पाकिस्तान आयोजित करता लेकिन दुर्भाग्य से इसको लेकर कुछ नहीं किया जा सकता। पेशेवर होने के नाते जो भी शेड्यूल है हम उसके लिए तैयार हैं। इनमें सफर करना और लगातार मैच खेलना भी शामिल हैं और हम इसके लिए तैयार हैं। नेपाल के खिलाफ मैच से पहले पाकिस्तान की ने अपनी प्लेइंग इलेवन का ऐलान कर दिया है। प्लेइंग इलेवन में तीन तेज गेंदबाज, 2 ऑलराउंडर और 6 बल्लेबाजों को जगह मिली है। तेज गेंदबाजों के रूप में शाहीन अफरीदी, हैरिस राऊफ और नसीम शाह को मौका मिला है। बाबर आजम (कप्तान), इमाम उल हक, फखर जमां, मोहम्मद रिजवान, आगा सलमान, इफ्तिखार अहमद, शादाब खान, मोहम्मद नवाज, नसीम शाह, शाहीन शाह अफरीदी, हैरिस राऊफ। (Input: PTI)","pubDate":"2023-08-29 18:46:54","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2fa1aa8379fedbd34ef112f1f98838c9","title":"Would have been good if whole tournament was in Pakistan but unfortunately...: Babar Azam ahead of Asia Cup","link":"https://www.indiatvnews.com/sports/cricket/would-have-been-good-if-whole-tournament-was-in-pakistan-but-unfortunately-babar-azam-ahead-of-asia-cup-2023-2023-08-30-889713","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup will be played in a hybrid model for the first time in its 39-year history. With the BCCI refusing Team India's travel to Pakistan, the tournament will be played in both Pakistan and Sri Lanka with the original hosts getting four games and the remaining nine matches will take place in the island nation. Pakistan skipper Babar Azam said that the situation isn't ideal as it would have been better if the whole tournament was in the home country only but it is what it is.","content":"Asia Cup will be played in a hybrid model for the first time in its 39-year history. With the BCCI refusing Team India's travel to Pakistan, the tournament will be played in both Pakistan and Sri Lanka with the original hosts getting four games and the remaining nine matches will take place in the island nation. Pakistan skipper said that the situation isn't ideal as it would have been better if the whole tournament was in the home country only but it is what it is. Speaking at the press conference ahead of his side's first match of Asia Cup 2023 against Nepal, Babar said, \"If you ask me, it would have been good if the whole tournament would have been held in Pakistan but unfortunately nothing can be done about it. The tournament may have been carefully scheduled and planned but it is definitely going to take a toll on the players with continuous to-and-fro between the two countries. Pakistan place on Wednesday, August 30, travel the next day to Sri Lanka, play India on September 2 and then come back the next day to play their Super Fours game on September 6, \"As professionals, we are ready for any schedule that is given to us. There would be travelling as well as back-to-back games and we are ready for that,\" said Babar regarding travel. The skipper was quick to mention that the team management and the medical staff have carefully planned the itinerary for the team so that they they get optimal rest between games and travel. \"Our coaches and support staff have chalked out plans about how much we would utilise each player and also we have booked our flights in such a manner, that our travelling schedule gives enough time to rest,\" Babar further added. Pakistan have already announced their playing XI for the first-ever clash against Nepal across any format as they will be putting out their strongest XI for the clash.","pubDate":"2023-08-29 18:33:46","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d153f3ec9a1676e7b68248db86df651b","title":"Two centuries in vain in match-week six of NPL","link":"https://www.chronicle.co.zw/two-centuries-in-vain-in-match-week-six-of-npl/","keywords":["Headlines","Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com ONLY two batters managed to reach the magic three digits on Round Six of the National Cricket Premier League (NCPL) over the weekend. However, those two centuries were in vain as they yielded no victories in a week where both batters and bowlers managed to give impressive performances. A total of seven […]","content":"The Chronicle ONLY two batters managed to reach the magic three digits on Round Six of the National Cricket Premier League (NCPL) over the weekend. However, those two centuries were in vain as they yielded no victories in a week where both batters and bowlers managed to give impressive performances. A total of seven matches were played, three on Saturday and four on Sunday. The first century scored this week came from the bat of Golden Bulls skipper, Shane Chigumbura in their 62 runs defeat at the hands of Rainbow Cricket Club on Saturday while the second and the last of the week was scored by Westside Cricket Club’s opening batter Tinashe Chiorah in a match that was cancelled due to bad light against Takashinga Patriots 2 on Sunday. Chigumbura had the highest individual score during round six of the country’s premier club cricket competition. Batting on top of the order, he fell for a gallant 115 runs from 114 balls as they were chasing a target of 278 runs having bowled out their opponents for 275 in 39 overs. Golden Bulls went on to finish on 213 all out in 42,1 overs. Chiorah remained unshaken with the bat as Westside Cricket Club posted a mammoth 304/8 in their 45 overs with the opener scoring a brilliant 105 runs not out from just 83 deliveries. The match however, was brought to a close on the first over of the second innings as umpires deemed it unsafe to continue due to bad light. Takashinga were on six runs without any wicket lost. It turned out to be good individual achievements for Chigumbura and Chiorah, however they would feel hard done as both their respective teams could not go on to collect maximum points on the day. The duo were however not the only ones who had good days at the ovals with the bat on Round Six with a number of batters falling short of their individual milestones as well. On Saturday, young Matthew Campbell fell just 10 runs short of his ton for Rainbow Cricket Club against Chigumbura’s Golden Bulls while his opening partner, Muhammad Zaheer Tufail also looked on course for a ton. Campbell fell for 90 runs from 90 balls while Tufail scored 76 runs after facing 58 deliveries. On the same day, two more half centuries were scored by batters from the same team. Ryan Kamwemba and Tariro Makauyo scored 64 and 57 runs respectively for Uprising Cricket Club while in the same match for Mutare Sports Club, Spencer Magodo scored a gallant 81 runs not out from 91 deliveries as they suffered a 46 runs defeat. Kevin Kasuza, for Westside Cricket Club chipped in with the last half century on Saturday, scoring 77 runs from 61 balls. The other batters who managed to reach half centuries were Milton Shumba, Tony Munyonga and Clive Madande as they helped defending champions Gladiators register a 177 runs win over Bulawayo Athletic Club (BAC). Tinashe Kamhunukamwe and Timycen Maruma also scored half centuries which helped Takashinga Patriots 1 register an eight wickets victory over Mbizo Cricket Club. It was not only a batters’ week to shine as some bowlers stood up to the task with ball in hand to produce match winning spells. Leading the match-week six bowling pack is Queens Cricket Club’s Tanatswa Bechani who took the best figures so far this season. Bechani produced a spell for the ages, finishing with figures of 7/13 in 7,2 overs to help his side register a 105 runs win over Scorpions Cricket Club, which was their second victory in nine matches. He was one of the two bowlers who managed to claim fifers on week six. The other bowler was Chigumbura who finished with figures of 5/46 five overs in Golden Bulls’s 62 runs defeat at the hands of Rainbow Cricket Club. Bowlers such as Daniel Jackiel, Donald Tiripano and Nyasha Dube managed to claim four wickets each for their respective teams to round up an action-packed weekend of entertaining club cricket. The NPL resumes tomorrow with five matches lined up. Headlining the games is a Bulawayo derby pitting Amakhosi and BAC at the latter’s home ground. In other matches, Kadoma Cricket Club will be up against Rainbow Cricket Club at Old Hararians while Takashinga Patriots 1 will host Queens Cricket Club at Kwekwe Sports Club. The last two matches will be between Scorpions Cricket Club and Uprising Cricket Club at Takashinga Cricket Club while Mutare Sports Club will host Westside Cricket Club. – @brandon_malvin","pubDate":"2023-08-29 18:30:04","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"7d8c8dd79db0154185303759a26a8fc0","title":"Asia Cup 2023: We want to be competitive against India and Pakistan, says Nepal skipper Rohit Paudel","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2023-we-want-to-be-competitive-against-india-and-pakistan-says-nepal-skipper-rohit-paudel-13055322.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2023: We want to be competitive against India and Pakistan, says Nepal skipper Rohit Paudel","content":"Cricket Asia Cup 2023: We want to be competitive against India and Pakistan, says Nepal skipper Rohit Paudel The Nepal team is all set to make their Asia Cup debut, having been clubbed in Group A alongside the hosts and India in their first-ever appearance at the Asia Cup. FirstCricket Staff Last Updated:August 29, 2023 23:40:58 IST File image of Nepal captain Rohit Paudel. Image credit: Cricket Association of Nepal Multan : Nepal skipper Rohit Paudel has asserted that his team is capable of being competitive against hosts Pakistan and India in the 2023 Asia Cup, starting Wednesday. The Nepal team is all set to make their Asia Cup debut, having been clubbed in Group A alongside the hosts and India. “We are playing for the first time, and it’s a big achievement for all of us. Pakistan is a very good side, and we want to give a competitive game to them, as well as India. So, we deserve to be here,” cited Paudel during the pre-match press conference on Tuesday. Related Articles Asia Cup 2023: Rape-accused Sandeep Lamichhane doubtful for tournament, set to stand trial Asia Cup 2023: Pakistan vs Nepal to kick things off, live streaming, head-to-head When asked about the biggest difference between his side and the Pakistanis, he said that barring experience, there is not much difference between the two sides. “The difference would be the experience. If you count on skills, both batting and bowling are the same (for both sides). But, if you count on experience, Pakistan is an experienced side.” “Both the teams have world-class bowlers and batsmen. Our focus is to win one ball (at a time), regardless of who the opponent is,” added Paudel. The Rhinos are coming off straight competitive outings, having participated in the ICC World Cup Qualifiers, where it finished eighth, followed by the ACC Emerging Teams Asia Cup, failing to progress beyond the group stage. Paudel credited the two tournaments as good preparation platforms for the Asia Cup, besides admitting that the expectations are high from them. “We had some good preparations. We played in Zimbabwe (ICC World Cup Qualifiers) and the Emerging Asia Cup. So, we are well-prepared.” “There have been a lot of expectations from us. All Neaplese have been dreaming for this Asia Cup.” “We have been playing for more than two decades, and it’s a great opportunity to represent our country at the highest level, especially in Asia Cup. So, it’s a big occasion for all of us,” he concluded. Published on: August 29, 2023 23:40:58 IST Tags: Asia Cup Asia Cup 2023 Nepal Cricket Team Rohit Paudel","pubDate":"2023-08-29 18:10:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/Rohit-Paudel-Cricket-Association-of-Nepal-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"9b836bec6ad6fed25c36f0bd13e4d5b6","title":"Asia Cup 2023: Pakistan should have hosted the entire tournament, says skipper Babar Azam","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2023-pakistan-should-have-hosted-the-entire-tournament-says-skipper-babar-azam-13055292.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2023: Pakistan should have hosted the entire tournament, says skipper Babar Azam","content":"Cricket Asia Cup 2023: Pakistan should have hosted the entire tournament, says skipper Babar Azam While the PCB had originally been awarded the hosting rights for the tournament, several matches had to be moved to Sri Lanka to the BCCI’s refusal to send the Indian team to Pakistan. FirstCricket Staff Last Updated:August 29, 2023 23:37:24 IST File image of Pakistan captain Babar Azam. Image credit: X/@TheRealPCB On the eve of the opening game of the 2023 Asia Cup, Pakistan captain Babar Azam wished the entire tournament had taken place in his home country. The Pakistan Cricket Board (PCB) had been awarded the hosting rights for the 2023 edition of the tournament, marking the first time a major event involving multiple nations has taken place in the country since the 2008 edition of the same event. However, due to the Board of Control for Cricket in India’s (BCCI) reluctance to send the Indian team to Pakistan due to political tensions between the two nations, several matches — including all of India’s fixtures as well as the final — had to be moved to Sri Lanka, although the PCB has retained the hosting rights for the same. Related Articles Clean sweep against Afghanistan 'will give us confidence during the Asia Cup': Pakistan captain Babar Azam Asia Cup 2023: Pakistan vs Nepal to kick things off, live streaming, head-to-head Also Read | Bangladesh express helplessness over travel in hybrid model Speaking ahead of the opening match of the tournament against Nepal in Multan, Pakistan skipper Babar wished the entire tournament had been hosted on Pakistani soil instead of two nations — a first in the tournament’s history. “If you ask me, it would have been good if the whole tournament would have been held in Pakistan, but unfortunately, nothing can be done about it,” Babar told reporters on Tuesday. . @babarazam258 on Pakistan earning the top spot in the ODI rankings Full press conference ➡️ https://t.co/V3oeqje8G0 #AsiaCup2023 pic.twitter.com/5iX4CahlSh — Pakistan Cricket (@TheRealPCB) August 29, 2023 Pakistan start their campaign on Wednesday against Nepal in Multan and then fly to Sri Lanka the very next day for the big-ticket clash against India at Pallekele on 2 September. Within 24 hours, they are back in Lahore for their Super Four game on 6 September and then again fly back to Sri Lanka the next day for the next game on 9 September. Also Read | Pakistan vs Nepal Asia Cup 2023 preview, live streaming, head-to-head “As professionals, we are ready for any schedule that is given to us. There would be travelling as well as back-to-back games and we are ready for that,” said Babar. “Our coaches and support staff have chalked out plans about how much we would utilise each player and also we have booked our flights in such a manner, that our travelling schedule gives enough time to rest,” the skipper said. While he didn’t want to divulge his strategy about the India game, he expects that his team would put up the best show possible. “We want to continue with this momentum. Pakistan’s match against India will be a high-intensity game and we want to play our best cricket on the given day,” he added. Also Read | ‘Pressure match…’, Rizwan on what makes IND-PAK rivalry exciting The skipper, rated as one of the premier batters in contemporary cricket, is happy that Pakistan team is currently ranked No 1 in ODIs and also a lot of their players are in top 10. “I needed to take the team to a different level and change mindset. Now, we have at least 3-4 players in top-10 and when you set a standard, there will be expectations and you have to fulfil those expectations. Performances should be such that the team wins,” he added. With inputs from PTI Published on: August 29, 2023 23:37:24 IST Tags: Asia Cup Asia Cup 2023 Babar Azam Pakistan Cricket Team","pubDate":"2023-08-29 18:07:24","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Babar-Azam.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6dc8cf7f3059089616a8cea6c896a083","title":"Raza named Lucia Kings captain","link":"https://www.chronicle.co.zw/raza-named-lucia-kings-captain/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com ZIMBABWE international cricketer, Sikandar Raza is continuing with his impressive show on the global stage as he has been named the new captain of his Caribbean Premier League (CPL) side, St Lucia Kings. The Chevrons stalwart replaces South African legend Faf Du Plessis at the helm of the top placed St Lucia Kings. […]","content":"The Chronicle ZIMBABWE international cricketer, Sikandar Raza is continuing with his impressive show on the global stage as he has been named the new captain of his Caribbean Premier League (CPL) side, St Lucia Kings. The Chevrons stalwart replaces South African legend Faf Du Plessis at the helm of the top placed St Lucia Kings. Du Plessis suffered an elbow injury and has been ruled out for the rest of the season. This will be Raza’s second stint as a captain in an internationally recognised T20 franchise league. His previous and first stint as a skipper came last year when he captained Dambulla Aura in the absence of Dasun Shanaka in the Lankan Premier League (LPL). Raza’s predecessor, Du Plessis has rallied behind him to do a good job as he comes in with a lot of T20 franchise experience having taken part in some big competitions such as the Indian Premier League (IPL) and the Pakistan Super League (PSL). “Raza is someone who has played a lot of T20 and T10 cricket. So very much an experienced brain there, so, it’s great to have those guys on the field and ask questions. Obviously, it’s a change and probably you could say a big change because it’s someone stepping into the shoes for the first time with the St Lucia Kings. “But luckily, we’ve got someone like Sammy there who will make sure for the first one or two games there will be some direction from his side. And then trust the guy on the field with the resources that he has at his disposal,” said Du Plessis after their match on Saturday. Commenting on the issue, Raza said they will miss Du Plessis as he has done a lot of good work for the team and is grateful to have a team like St Lucia Kings which has a lot of good players and everything will take care of itself. “It is true apparently. Faf has done such a fantastic job with this team, we are going to miss him dearly but most importantly we wish him well because he is going for a surgery so a lot of prayers for him. We wish Faf a successful surgery and quick recovery because this family is incomplete without him. “For my side, when you have so many good professionals and great guys with great attitudes then captaining is not really a big thing, everything looks after itself because everybody is so focused and motivated to do well,” said Raza. In their previous match against Trinbago Knight Riders on Saturday, Raza was named player of the match after helping St. Lucia Kings register a 54 runs win. He put up a good all-round performance. Batting first, Raza scored 32 runs from 23 balls as his side finished on 167/5 in 20 overs before going on to finish with bowling figures of 2/31 in three overs to help St. Lucia Kings bowl out their opponents for 113 runs in 14,5 overs and win their second match in five matches. Raza’s first assignment as the captain comes on Sunday against fifth placed Barbados Royals in Bridgetown. This will be their seventh match of the campaign. – @brandon_malvin","pubDate":"2023-08-29 22:04:43","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"8f24e2b21cd34923b81e76b86bc3ba35","title":"Good, bad, and some UGLY!","link":"https://times-age.co.nz/opinion/some-good-some-bad-and-some-ugly/","keywords":["Opinion","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"More gold medals, a bounce-back win, a gutsy title defence, a spectacular crash, a record defeat, and a hunger strike are highlights and lowlights of the past week in sport. So it’s time to draw revolvers on this week’s ‘Good, Bad and Ugly’. GOOD Hats off to our five cricketers to be awarded major association […]","content":"More gold medals, a bounce-back win, a gutsy title defence, a spectacular crash, a record defeat, and a hunger strike are highlights and lowlights of the past week in sport. So it’s time to draw revolvers on this week’s ‘Good, Bad and Ugly’. Hats off to our five cricketers to be awarded major association contracts. Melissa Hansen, Emma McLeod, Georgia Atkinson, and Ocean Bartlett will don the green and gold of the Central Hinds, and Gemma Sims will pad up for the Wellington Blaze. There is also the selection of the multi-talented Vanessa Taylor for the Capital Football Youth Development squad. Adept at hockey and football, the St Matthew’s student has a bright future. Copthorne Wairarapa-Bush bounced back from their 50–3 shellacking at the hands of North Otago to power home for a 30–24 win over Poverty Bay and move to fifth equal in the Heartland standings. Dame Lisa – three gold medals taking her total haul to 15 at world championships – what more can one say about arguably world canoeing’s greatest-ever paddler? Scot ‘the Iceman’ Dixon kept alive his chances of a seventh IndyCar Championship, cruising to a 22-second win on the St Louis oval and his 55th career victory, while Liam Lawson’s 13th in his debut Formula One start may not look all that flash, but his performance in an uncompetitive car impressed many pundits, who opined there is a good future ahead. It wasn’t pretty, but the Warriors did what they had to in beating the Dragons 18–6 to lock in a top-four finish and two lives for the NRL final series. Fiji 30, England 22 – the Bula Boys scored a memorable win at Twickenham, and Samoa just went down 13-17 to world number one Ireland. Could this be the year of the Pasifika at the World Cup? Let’s hope they and the Tongans can set the tournament alight! Talk about tough, Mea Motu dislocating her shoulder in the first round of her 10-round world super bantamweight fight with Malawi’s Ellen Simwaka and going on to retain her belt. What has happened to Lydia Ko? Not only has she slipped to sixth in the world rankings, but a shambolic 10-over par at the latest LPGA event in Vancouver was her worst-ever round on the tour. Please tell me that the pedantic refereeing, and microscopic intervention of the TMO, which saw the first half of the All-Blacks – Springboks game take an hour to complete, is not the blueprint for the World Cup. If it is, we could be in for the baddest – verging on the ugliest – watch yet. Nascar driver Ryan Preece’s Ford barrel rolling at least 10 times at Daytona after clipping another car at 300kmh. Amazingly Preece was able to climb out of his mangled car, and he escaped any significant injury. Staying on the injury front, Tohu Harris’s injured back, which has the Warriors captain in doubt for the NRL playoffs, and Tyrel Lomax’s gashed knee that needed 30 stitches and will see him miss some of the early All Black World Cup matches. Poor discipline, poor execution, and poor attitude equal an ugly outcome. In my 58 years of watching All Blacks’ rugby, I’m struggling to recall a more inept effort in a test as the 35–7 trouncing at the hands of our fiercest foes. The 2019 semifinal loss to England, the 1999 semifinal defeat to France and a 28–7 loss to Australia, and losses to England in 1983 and 1993 come close, but I’m battling to remember anything akin to the pummelling the rampant Boks subjected us to at Twickenham. Am I worried? No! Nor are the bookies; Ladbrokes still have the men in black joint 3/1 favourites with France to lift the Webb Ellis Cup. The World Cup is a completely different beast, and the Twickenham result means diddlysquat, but why give the already confident Saffas an adrenaline boost two weeks out from the World Cup kickoff? Credit to South Africa, they were very good, but we were awful. Boys, you should’ve stayed on the bus, but going on that effort, I think most of you did. The saga surrounding Spanish Football Federation president Luis Rubiales and the unwanted kiss on Jenni Hermoso’s lips during the World Cup presentation gets uglier and weirder by the day. Not only does Rubiales refuse to resign, but now his mother has gone on a hunger strike because of the “inhumane hounding” of her son. Bizarrely, she has locked herself in a church where no doubt she can survive on communion wafers and wine and confess the sins of her son.","pubDate":"2023-08-29 22:00:00","image_url":"https://times-age.co.nz/wp-content/uploads/2023/08/503033-1024x683.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"8da59438a08eadfdd31338ff7648a5d9","title":"‘India vs Pakistan surpasses the Ashes,’ says Tom Moody","link":"https://kashmirreader.com/2023/08/30/india-vs-pakistan-surpasses-the-ashes-says-tom-moody/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"New Delhi: It’s that time in world cricket again. India play Pakistan in the group stage of the 2023 Asia Cup on Saturday, September 2 at Pallekele. A fixture that may take place two more time over the course of next fortnight as the six-team competition may see the two lock horns in the Super […]","content":"New Delhi: It’s that time in world cricket again. India play Pakistan in the group stage of the 2023 Asia Cup on Saturday, September 2 at Pallekele. A fixture that may take place two more time over the course of next fortnight as the six-team competition may see the two lock horns in the Super 4 and even the final. In October, the two face off in the ODI World Cup in the 1 lakh plus capacitated Narendra Modi Stadium in Ahmedabad. And so, the buzz around the contest is quite palpable. Former Australia cricketer Tom Moody has no doubts, it is the biggest cricket fixture in world cricket. Even above the Ashes, despite the oldest Test cricket rivalry producing an enticing 2-2 series recently in England. “I think this match surpasses the Ashes,” Moody told Star Sports. “It’s always got a lovely story to it, and both are outstanding cricketing nations.” Deciphering the two teams and the players on show, he added, “And when you look at that Pakistan squad, it does boast a lot of talent. But one thing that stands out for me is that it also boasts experience. So now they have the combination of experience and talent, they are a real threat. They can match India with their pace bowling; they’ve got genuine pace on their side, and the only issue I see them potentially having is the depth in the quality of their batting which India has got. So that’s going to be the interesting pressure that they put on the likes of Babar Azam at the top of the order.” The last four meetings between the India and Pakistan have been all in T20Is, with both the teams having shared the spoils. While Pakistan beat India in their group stage fixture of the 2021 T20 World Cup, the men in blue returned the favor in the 2022 edition at Melbourne. At the Asia Cup last year, both would win a game each. The last 50-over contest between the two nations dates back to June 16, 2019 when Virat Kohli-led India beat Sarfaraz Khan’s Pakistan at the 2019 World Cup in Manchester. When asked about which player he thinks possesses the biggest threat to the Indian batting, Moody wouldn’t hesitate before naming, “Shaheen Afridi. Full Stop. I just think that Shaheen Afridi with the new ball is a major threat, which he has done historically. Broken through with that new ball, manages to blow away a couple of early wickets, which then opens up the middle order for India to resurrect things. Particularly for a middle order that hasn’t had a lot of game time.” India and Pakistan are pitted against Nepal in Group A of the Asia Cup, while Sri Lanka – who are co-hosting the tournament alongside Pakistan – are with Bangladesh and Afghanistan in Group B. Agencies ‘India vs Pakistan surpasses the Ashes,’ says Tom Moody added by KR Desk on 3:04 am August 30, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-29 21:34:21","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"84354882d273632354e3c6435afc4a78","title":"Difficult situations still excites me after 15 years of int’l cricket: Kohli","link":"https://kashmirreader.com/2023/08/30/difficult-situations-still-excites-me-after-15-years-of-intl-cricket-kohli/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Virat Kohli has mastered several obstacles during his illustrious career but the former Indian skipper on Monday said the upcoming ICC World Cup 2023 presents him with an exciting new challenge, something he still relishes after a decade and half of top flight cricket. The 13th edition of the quadrennial extravaganza will be […]","content":"New Delhi: Virat Kohli has mastered several obstacles during his illustrious career but the former Indian skipper on Monday said the upcoming ICC World Cup 2023 presents him with an exciting new challenge, something he still relishes after a decade and half of top flight cricket. The 13th edition of the quadrennial extravaganza will be played in India across October and November, and Kohli said he is gearing up for the challenge of playing a World Cup at home. . “Any challenge in front of you, you look forward to it. When difficulty comes in front of you get excited. You don’t shy away from it. After 15 years I still like encounters, and the World Cup 2023 is one (challenge). It excites me, I need something new to, you know, propel me to another level,”said Kohli during a promotional event. Kohli did not deny that there is pressure of expectations on him and the team. But Kohli reminded everyone that no one wants to win the World Cup more than the players themselves. “The pressure is always there. The fans always say we want (the team) to win a cup very badly. I’d like to say not more than me. So, I’m in the right place. Honestly, I know the expectations are there and the emotions of the people are there. But please know that no one wants to win more than players,” he said. Kohli, though, is no stranger to winning a World Cup. He had led India to the ICC U-19 World Cup victory back in 2008 and he was also part of the MS Dhoni-led India side that triumphed in the 2011 50-over World Cup at home. My career highlight ïs obviously winning the World Cup in 2011. I was 23 at the time, and I probably didn’t understand the magnitude of it. But now at 34, and has played many World Cups, which we haven’t been able to win, So,I understand the emotions of all the senior players (in 2011). “All the more for Sachin Tendulkar, as it was his last World Cup. He had already played many World Cups by then and to win it in Mumbai, his hometown, was very special for him. I mean, it was stuff from dreams,” said Kohli. Kohli also remembered the pressure piled on players ahead and during 2011 World Cup. “I remember the amount of pressure there was on all the players when we were travelling, Thankfully, there was no social media back then. It would have been a nightmare, honestly. But through the airports, it was always just one thing — we need to win the Cup,” he said. “The senior players were always under the pump and to handle all that pressure. It was just brilliant. And that night (after the WC win) in itself was something magical,” he added. PTI Difficult situations still excites me after 15 years of int’l cricket: Kohli added by Press Trust of India on 3:01 am August 30, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-29 21:31:45","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"750d69b406ba221c25077030ab10486a","title":"Pakistan favoured to give India a run for its money in hunt for Asia Cup","link":"https://torontosun.com/sports/other-sports/pakistan-favoured-to-give-india-a-run-for-its-money-in-hunt-for-asia-cup","keywords":["Other Sports","Sports"],"creator":["Norm Da Costa"],"video_url":null,"description":"Pride of Asia is on the line","content":"The pride of Asia is on the line in the six-nation Asia Cup that will be played in Pakistan and Sri Lanka. Pakistan opens the six-team tournament against Nepal on Wednesday and on Saturday comes the big one. It’s the showdown between bitter political rivals Pakistan and India who share a border and a bloodied history that includes going to war on four occasions. The two super-giants of the game meet in a group match in the 35,000-seat stadium in Pellekele, Sri Lanka, which will be filled to the brim while there will be millions around the world glued to their television sets. The two countries will essentially grind to a halt as has happened each time these two meet in international competitions. Off the field there has always been a degree of resentment between the fans while there is a modicum of respect and friendliness between the players. One would think these two powerhouses would be separated from meeting each other at the group stage but there has not been such luck. In fact, the International Cricket Council has admitted it pairs these two teams in the same group because of the financial windfall. In this tournament India and Pakistan are placed with Nepal in Group A, while Group B will be more competitive with Afghanistan, Bangladesh and defending champion Sri Lanka. The top two teams from each group will qualify for the Super Four round. The four then play each other once, and the top two will qualify for the final. Cricket fans may be rubbing their eyes in wonder with the inclusion of Nepal in the last six. It’s a country better known for Mount Everest, the Himalayas and the hardy Sherpas who guide the mountain climbers up treacherous trails. But in recent years the landlocked country has become a rising force in associate cricket and caused a huge upset in the 10-team qualifying phase for the Asia Cup by surprising the United Arab Republic in the final by seven wickets. Led by 20-year-old Rohit Paudel the country is ranked 15th in the ICC standings and tiny Nepal is hoping to cause a stir playing the big boys. It’s unlikely to happen but most fans will be rooting for Nepal to spring a Mount Everest-sized upset over Pakistan or India. India has won the Asia Cup on seven occasions and will start as hot favourite to lift the trophy again as it is stacked with a bunch of talented players. Virat Kohli, considered among the top two batsmen in the world, is expected to put up some big scores and he will have solid support from skipper Rohit Sharma, Shubman Gill, Suryakumar Yadav, newcomer Tilak Varma and Ishan Kishan. The bowling is also well balanced with the return of fast bowler Jasprit Bumrah, Mohammad Shami and spinners Ravindra Jadeja and Axar Patel. It’s unfortunate the selectors left out Yashasvi Jaiswal who has had a brilliant run with the bat in recent months and all-rounder Ravichandran Ashwin. Sharma will be imploring his team not to leave anything to chance as winning this tournament will make small amends for failing to win an ICC-run tournament since 2011. A victory would pacify the restless Indian fans who are getting more upset every time their multi-millionaire fail on the choke on the main stage. India’s biggest challenge will come from Pakistan, a team that also has a well-rounded lineup and will be led by captain and run-scoring machine Babar Azam who along with Kohli are the two best batsmen in the world today. Azam has a number of world-class batsmen in Mohammad Rizwan, Abdullah Shafique, Fakhar Zaman and Imam-ul-Haq in the lineup. The country will lean on 23-year-old Shaheen Afridi to rattle the opposition with his fiery pace and his supporting new-ball cast will include Haris Rauf and Naseem Shah. Pakistan hasn’t won the Asia Cup since 2012 and Babar will be hoping to reverse the trend this time. Sri Lanka, a former World Cup champion, has made its mark in this tournament by pocketing the trophy on six occasions but it faces an uphill task this time as the squad led by Dasun Shanakahas been dealt a significant blow through injuries. Fast bowlers Dilshan Madushanka and Lahiru Kumara have been forced to withdraw from the tournament due to injuries and this will leave a huge void in the island’s attack. To add to its woes Wanindu Hasaranga, one of the world’s top spinners, may also not see action because of a thigh strain. The two other countries — Bangladesh and Afghanistan — will be a handful and could mount a huge challenge to both India and Pakistan. Back in the fold for Bangladesh is Shakib Al Hasan who is rated as one the world’s best all-rounders. That alone isn’t good enough to win the crown but the country has a number of players ready to make their presence felt. Despite the problems in their country Afghanistan continues to prove it’s a team to watch internationally as it has the world’s best spin attack in Rashid Khan and Majeedur Rahman. Others set to make their mark include Mohammad Nabi, Hasmatullah Shahidi and Najibullah Zadran. Check out our sports section for the latest news and analysis. Care for a wager? Head to our sports betting section for news and odds.","pubDate":"2023-08-29 19:20:14","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/08/AFP_33TN4GQ-scaled-e1693336806148.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"4d5cffba34d77c817ce225836318c86e","title":"'एशिया कप के सभी मैच पाकिस्तान में होते, तो अच्छा होता', बाबर आजम ने दिया ये चुभने वाला बयान","link":"https://www.indiatv.in/sports/cricket/asia-cup-2023-pakistan-captain-babar-azam-said-that-if-all-the-matches-held-in-pakistan-2023-08-30-984918","keywords":null,"creator":null,"video_url":null,"description":"एशिया कप 2023 का पहला मैच पाकिस्तान और नेपाल के बीच खेला जाएगा, लेकिन इससे पहले पाकिस्तानी कप्तान बाबर आजम ने बड़ा बयान दिया है।","content":"एशिया कप 2023 में पाकिस्तानी टीम अपना पहला नेपाल के खिलाफ खेलेगी। इसके लिए पाकिस्तान ने प्लेइंग इलेवन का भी ऐलान कर दिया है। एशिया कप 2023 का आयोजन पाकिस्तान और नेपाल की धरती पर हो रहा है। पाकिस्तान में लंबे समय बाद कोई बड़ा टूर्नामेंट खेला जाएगा। अब पाकिस्तान के कप्तान बाबर आजम ने एशिया कप से एक दिन पहले बड़ा बयान दिया है। पाकिस्तान के कप्तान बाबर आजम एशिया कप की मेजबानी के 'हाइब्रिड मॉडल' को लेकर किसी तरह का मसला खड़ा नहीं करना चाहते हैं लेकिन उनका मानना है कि अगर इस टूर्नामेंट के सभी मैचों का आयोजन उनके देश में होता तो अच्छा होता। पाकिस्तान क्रिकेट बोर्ड के पास एशिया कप की मेजबानी अधिकार हैं लेकिन जय शाह की अगुवाई वाली एशियाई क्रिकेट परिषद ने हाइब्रिड मॉडल को चुना जिसमें कुछ मैचों की मेजबानी श्रीलंका करेगा। इनमें भारत और पाकिस्तान के बीच होने वाले मैच भी शामिल हैं। बाबर ने नेपाल के खिलाफ मैच से पहले प्रेस कॉन्फ्रेंस में कहा कि अगर आप मुझसे पूछो तो अच्छा होता अगर पूरा टूर्नामेंट पाकिस्तान आयोजित करता लेकिन दुर्भाग्य से इसको लेकर कुछ नहीं किया जा सकता। पेशेवर होने के नाते जो भी शेड्यूल है हम उसके लिए तैयार हैं। इनमें सफर करना और लगातार मैच खेलना भी शामिल हैं और हम इसके लिए तैयार हैं। नेपाल के खिलाफ मैच से पहले पाकिस्तान की ने अपनी प्लेइंग इलेवन का ऐलान कर दिया है। प्लेइंग इलेवन में तीन तेज गेंदबाज, 2 ऑलराउंडर और 6 बल्लेबाजों को जगह मिली है। तेज गेंदबाजों के रूप में शाहीन अफरीदी, हैरिस राऊफ और नसीम शाह को मौका मिला है। बाबर आजम (कप्तान), इमाम उल हक, फखर जमां, मोहम्मद रिजवान, आगा सलमान, इफ्तिखार अहमद, शादाब खान, मोहम्मद नवाज, नसीम शाह, शाहीन शाह अफरीदी, हैरिस राऊफ। (Input: PTI)","pubDate":"2023-08-29 18:46:54","image_url":null,"source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2fa1aa8379fedbd34ef112f1f98838c9","title":"Would have been good if whole tournament was in Pakistan but unfortunately...: Babar Azam ahead of Asia Cup","link":"https://www.indiatvnews.com/sports/cricket/would-have-been-good-if-whole-tournament-was-in-pakistan-but-unfortunately-babar-azam-ahead-of-asia-cup-2023-2023-08-30-889713","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup will be played in a hybrid model for the first time in its 39-year history. With the BCCI refusing Team India's travel to Pakistan, the tournament will be played in both Pakistan and Sri Lanka with the original hosts getting four games and the remaining nine matches will take place in the island nation. Pakistan skipper Babar Azam said that the situation isn't ideal as it would have been better if the whole tournament was in the home country only but it is what it is.","content":"Asia Cup will be played in a hybrid model for the first time in its 39-year history. With the BCCI refusing Team India's travel to Pakistan, the tournament will be played in both Pakistan and Sri Lanka with the original hosts getting four games and the remaining nine matches will take place in the island nation. Pakistan skipper said that the situation isn't ideal as it would have been better if the whole tournament was in the home country only but it is what it is. Speaking at the press conference ahead of his side's first match of Asia Cup 2023 against Nepal, Babar said, \"If you ask me, it would have been good if the whole tournament would have been held in Pakistan but unfortunately nothing can be done about it. The tournament may have been carefully scheduled and planned but it is definitely going to take a toll on the players with continuous to-and-fro between the two countries. Pakistan place on Wednesday, August 30, travel the next day to Sri Lanka, play India on September 2 and then come back the next day to play their Super Fours game on September 6, \"As professionals, we are ready for any schedule that is given to us. There would be travelling as well as back-to-back games and we are ready for that,\" said Babar regarding travel. The skipper was quick to mention that the team management and the medical staff have carefully planned the itinerary for the team so that they they get optimal rest between games and travel. \"Our coaches and support staff have chalked out plans about how much we would utilise each player and also we have booked our flights in such a manner, that our travelling schedule gives enough time to rest,\" Babar further added. Pakistan have already announced their playing XI for the first-ever clash against Nepal across any format as they will be putting out their strongest XI for the clash.","pubDate":"2023-08-29 18:33:46","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d153f3ec9a1676e7b68248db86df651b","title":"Two centuries in vain in match-week six of NPL","link":"https://www.chronicle.co.zw/two-centuries-in-vain-in-match-week-six-of-npl/","keywords":["Headlines","Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com ONLY two batters managed to reach the magic three digits on Round Six of the National Cricket Premier League (NCPL) over the weekend. However, those two centuries were in vain as they yielded no victories in a week where both batters and bowlers managed to give impressive performances. A total of seven […]","content":"The Chronicle ONLY two batters managed to reach the magic three digits on Round Six of the National Cricket Premier League (NCPL) over the weekend. However, those two centuries were in vain as they yielded no victories in a week where both batters and bowlers managed to give impressive performances. A total of seven matches were played, three on Saturday and four on Sunday. The first century scored this week came from the bat of Golden Bulls skipper, Shane Chigumbura in their 62 runs defeat at the hands of Rainbow Cricket Club on Saturday while the second and the last of the week was scored by Westside Cricket Club’s opening batter Tinashe Chiorah in a match that was cancelled due to bad light against Takashinga Patriots 2 on Sunday. Chigumbura had the highest individual score during round six of the country’s premier club cricket competition. Batting on top of the order, he fell for a gallant 115 runs from 114 balls as they were chasing a target of 278 runs having bowled out their opponents for 275 in 39 overs. Golden Bulls went on to finish on 213 all out in 42,1 overs. Chiorah remained unshaken with the bat as Westside Cricket Club posted a mammoth 304/8 in their 45 overs with the opener scoring a brilliant 105 runs not out from just 83 deliveries. The match however, was brought to a close on the first over of the second innings as umpires deemed it unsafe to continue due to bad light. Takashinga were on six runs without any wicket lost. It turned out to be good individual achievements for Chigumbura and Chiorah, however they would feel hard done as both their respective teams could not go on to collect maximum points on the day. The duo were however not the only ones who had good days at the ovals with the bat on Round Six with a number of batters falling short of their individual milestones as well. On Saturday, young Matthew Campbell fell just 10 runs short of his ton for Rainbow Cricket Club against Chigumbura’s Golden Bulls while his opening partner, Muhammad Zaheer Tufail also looked on course for a ton. Campbell fell for 90 runs from 90 balls while Tufail scored 76 runs after facing 58 deliveries. On the same day, two more half centuries were scored by batters from the same team. Ryan Kamwemba and Tariro Makauyo scored 64 and 57 runs respectively for Uprising Cricket Club while in the same match for Mutare Sports Club, Spencer Magodo scored a gallant 81 runs not out from 91 deliveries as they suffered a 46 runs defeat. Kevin Kasuza, for Westside Cricket Club chipped in with the last half century on Saturday, scoring 77 runs from 61 balls. The other batters who managed to reach half centuries were Milton Shumba, Tony Munyonga and Clive Madande as they helped defending champions Gladiators register a 177 runs win over Bulawayo Athletic Club (BAC). Tinashe Kamhunukamwe and Timycen Maruma also scored half centuries which helped Takashinga Patriots 1 register an eight wickets victory over Mbizo Cricket Club. It was not only a batters’ week to shine as some bowlers stood up to the task with ball in hand to produce match winning spells. Leading the match-week six bowling pack is Queens Cricket Club’s Tanatswa Bechani who took the best figures so far this season. Bechani produced a spell for the ages, finishing with figures of 7/13 in 7,2 overs to help his side register a 105 runs win over Scorpions Cricket Club, which was their second victory in nine matches. He was one of the two bowlers who managed to claim fifers on week six. The other bowler was Chigumbura who finished with figures of 5/46 five overs in Golden Bulls’s 62 runs defeat at the hands of Rainbow Cricket Club. Bowlers such as Daniel Jackiel, Donald Tiripano and Nyasha Dube managed to claim four wickets each for their respective teams to round up an action-packed weekend of entertaining club cricket. The NPL resumes tomorrow with five matches lined up. Headlining the games is a Bulawayo derby pitting Amakhosi and BAC at the latter’s home ground. In other matches, Kadoma Cricket Club will be up against Rainbow Cricket Club at Old Hararians while Takashinga Patriots 1 will host Queens Cricket Club at Kwekwe Sports Club. The last two matches will be between Scorpions Cricket Club and Uprising Cricket Club at Takashinga Cricket Club while Mutare Sports Club will host Westside Cricket Club. – @brandon_malvin","pubDate":"2023-08-29 18:30:04","image_url":null,"source_id":"chronicle_zw","source_priority":1567699,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"7d8c8dd79db0154185303759a26a8fc0","title":"Asia Cup 2023: We want to be competitive against India and Pakistan, says Nepal skipper Rohit Paudel","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2023-we-want-to-be-competitive-against-india-and-pakistan-says-nepal-skipper-rohit-paudel-13055322.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2023: We want to be competitive against India and Pakistan, says Nepal skipper Rohit Paudel","content":"Cricket Asia Cup 2023: We want to be competitive against India and Pakistan, says Nepal skipper Rohit Paudel The Nepal team is all set to make their Asia Cup debut, having been clubbed in Group A alongside the hosts and India in their first-ever appearance at the Asia Cup. FirstCricket Staff Last Updated:August 29, 2023 23:40:58 IST File image of Nepal captain Rohit Paudel. Image credit: Cricket Association of Nepal Multan : Nepal skipper Rohit Paudel has asserted that his team is capable of being competitive against hosts Pakistan and India in the 2023 Asia Cup, starting Wednesday. The Nepal team is all set to make their Asia Cup debut, having been clubbed in Group A alongside the hosts and India. “We are playing for the first time, and it’s a big achievement for all of us. Pakistan is a very good side, and we want to give a competitive game to them, as well as India. So, we deserve to be here,” cited Paudel during the pre-match press conference on Tuesday. Related Articles Asia Cup 2023: Rape-accused Sandeep Lamichhane doubtful for tournament, set to stand trial Asia Cup 2023: Pakistan vs Nepal to kick things off, live streaming, head-to-head When asked about the biggest difference between his side and the Pakistanis, he said that barring experience, there is not much difference between the two sides. “The difference would be the experience. If you count on skills, both batting and bowling are the same (for both sides). But, if you count on experience, Pakistan is an experienced side.” “Both the teams have world-class bowlers and batsmen. Our focus is to win one ball (at a time), regardless of who the opponent is,” added Paudel. The Rhinos are coming off straight competitive outings, having participated in the ICC World Cup Qualifiers, where it finished eighth, followed by the ACC Emerging Teams Asia Cup, failing to progress beyond the group stage. Paudel credited the two tournaments as good preparation platforms for the Asia Cup, besides admitting that the expectations are high from them. “We had some good preparations. We played in Zimbabwe (ICC World Cup Qualifiers) and the Emerging Asia Cup. So, we are well-prepared.” “There have been a lot of expectations from us. All Neaplese have been dreaming for this Asia Cup.” “We have been playing for more than two decades, and it’s a great opportunity to represent our country at the highest level, especially in Asia Cup. So, it’s a big occasion for all of us,” he concluded. Published on: August 29, 2023 23:40:58 IST Tags: Asia Cup Asia Cup 2023 Nepal Cricket Team Rohit Paudel","pubDate":"2023-08-29 18:10:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/08/Rohit-Paudel-Cricket-Association-of-Nepal-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"9b836bec6ad6fed25c36f0bd13e4d5b6","title":"Asia Cup 2023: Pakistan should have hosted the entire tournament, says skipper Babar Azam","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2023-pakistan-should-have-hosted-the-entire-tournament-says-skipper-babar-azam-13055292.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2023: Pakistan should have hosted the entire tournament, says skipper Babar Azam","content":"Cricket Asia Cup 2023: Pakistan should have hosted the entire tournament, says skipper Babar Azam While the PCB had originally been awarded the hosting rights for the tournament, several matches had to be moved to Sri Lanka to the BCCI’s refusal to send the Indian team to Pakistan. FirstCricket Staff Last Updated:August 29, 2023 23:37:24 IST File image of Pakistan captain Babar Azam. Image credit: X/@TheRealPCB On the eve of the opening game of the 2023 Asia Cup, Pakistan captain Babar Azam wished the entire tournament had taken place in his home country. The Pakistan Cricket Board (PCB) had been awarded the hosting rights for the 2023 edition of the tournament, marking the first time a major event involving multiple nations has taken place in the country since the 2008 edition of the same event. However, due to the Board of Control for Cricket in India’s (BCCI) reluctance to send the Indian team to Pakistan due to political tensions between the two nations, several matches — including all of India’s fixtures as well as the final — had to be moved to Sri Lanka, although the PCB has retained the hosting rights for the same. Related Articles Clean sweep against Afghanistan 'will give us confidence during the Asia Cup': Pakistan captain Babar Azam Asia Cup 2023: Pakistan vs Nepal to kick things off, live streaming, head-to-head Also Read | Bangladesh express helplessness over travel in hybrid model Speaking ahead of the opening match of the tournament against Nepal in Multan, Pakistan skipper Babar wished the entire tournament had been hosted on Pakistani soil instead of two nations — a first in the tournament’s history. “If you ask me, it would have been good if the whole tournament would have been held in Pakistan, but unfortunately, nothing can be done about it,” Babar told reporters on Tuesday. . @babarazam258 on Pakistan earning the top spot in the ODI rankings Full press conference ➡️ https://t.co/V3oeqje8G0 #AsiaCup2023 pic.twitter.com/5iX4CahlSh — Pakistan Cricket (@TheRealPCB) August 29, 2023 Pakistan start their campaign on Wednesday against Nepal in Multan and then fly to Sri Lanka the very next day for the big-ticket clash against India at Pallekele on 2 September. Within 24 hours, they are back in Lahore for their Super Four game on 6 September and then again fly back to Sri Lanka the next day for the next game on 9 September. Also Read | Pakistan vs Nepal Asia Cup 2023 preview, live streaming, head-to-head “As professionals, we are ready for any schedule that is given to us. There would be travelling as well as back-to-back games and we are ready for that,” said Babar. “Our coaches and support staff have chalked out plans about how much we would utilise each player and also we have booked our flights in such a manner, that our travelling schedule gives enough time to rest,” the skipper said. While he didn’t want to divulge his strategy about the India game, he expects that his team would put up the best show possible. “We want to continue with this momentum. Pakistan’s match against India will be a high-intensity game and we want to play our best cricket on the given day,” he added. Also Read | ‘Pressure match…’, Rizwan on what makes IND-PAK rivalry exciting The skipper, rated as one of the premier batters in contemporary cricket, is happy that Pakistan team is currently ranked No 1 in ODIs and also a lot of their players are in top 10. “I needed to take the team to a different level and change mindset. Now, we have at least 3-4 players in top-10 and when you set a standard, there will be expectations and you have to fulfil those expectations. Performances should be such that the team wins,” he added. With inputs from PTI Published on: August 29, 2023 23:37:24 IST Tags: Asia Cup Asia Cup 2023 Babar Azam Pakistan Cricket Team","pubDate":"2023-08-29 18:07:24","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Babar-Azam.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"}]}