{"newsArray":[{"title":"Gujarat to Bengal to Delhi: Who runs cricket in India? In many cases, depends on who your father is","link":"https://indianexpress.com/article/sports/cricket/gujarat-to-bengal-to-delhi-who-runs-cricket-in-india-in-many-cases-depends-on-who-your-father-is-7875653/","keywords":["Cricket","Sports"],"creator":["Nihal Koshie"," Devendra Pandey"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-18 22:30:13","full_description":"Mahanaaryaman Scindia, son of Union Minister for Civil Aviation Jyotiraditya Scindia, was appointed vice-president of the Gwalior Division Cricket Association early this month. At a time when dynasty isn’t exactly a badge of political honour and when cricket’s playing field looks more level than ever, this hardly raised any eyebrows. For, it was true to Indian cricket board’s age-old tradition: a son following his influential father’s footsteps in cricket’s administration. Indeed, over a third of the 38 full members of the BCCI today include, at the top, sons or relatives of former officials and of powerful politicians — the highest-ever in the board’s history. https://images.indianexpress.com/2020/08/1x1.png “Never have there been so many associations that are ruled by families,” said a veteran BCCI official on the condition of anonymity. This despite red flags waved by the Supreme Court-appointed RM Lodha Committee. Framing the new BCCI constitution way back in 2016, it had underlined: “In some states all members are from a few families or a single family, thereby perpetuating the control over cricket in the hands of a few.” It put an age cap, 70 years, and a three-year cooling off after a six-year term for administrators thus setting the stage for some fathers to hand over to their sons. Consider: * Jay Shah: BCCI secretary, Former Gujarat Cricket Association joint-secretary. Father: Amit Shah, former GCA president and Union Home Minister. * Arun Dhumal: BCCI treasurer; Brother: Anurag Thakur, former BCCI president & Union I&B and Youth Affairs & Sports minister. * Mahanaaryaman Scindia: Gwalior Division Cricket Association (GDCA) vice-president; Father: Jyotiraditya Scindia, former president, MP Cricket Association; president, Chambal Division Cricket Association. * Dhanraj Nathwani: Gujarat Cricket Association (GCA) vice-president; Father: Parimal Nathwani, former GCA vice-president. * Pranav Amin: Baroda Cricket Association (BCA) president; Father: Chirayu Amin, former BCA president and Ex-interim IPL chairman. * Ajit Lele: Baroda Cricket Association (BCA) secretary; Father: Late Jaywant Lele, former BCA & BCCI secretary Check Out Express Premium Gary Kirsten: 'Most successful franchises in IPL had least amount of player churn' Explained: Inflation heats up but why it hasn’t singed political economy yet Opinion: It won’t be easy to bring Moscow to book over the Ukraine invasion Click here for more * Jaydev Shah: Saurashtra Cricket Association (SCA) president; Father: Niranjan Shah, former SCA & BCCI secretary. * Avishek Dalmiya: Cricket Association of Bengal (CAB) president; Father: Late Jagmohan Dalmiya, former CAB, BCCI, ICC president. * Sourav Ganguly : BCCI president; Brother Snehasish Ganguly is Honorary Secretary of the Cricket Association of Bengal; uncle Debasish Ganguly is the treasurer. Ganguly held the posts of secretary and president at CAB before his elevation to the BCCI. * Rohan Jaitley: Delhi & District Cricket Association president; Father: Late Arun Jaitley , former DDCA president, IPL Governing Council member. * Adwait Manohar: Vidarbha Cricket Association (VCA) president; Father: Shashank Manohar, former VCA, BCCI, ICC president. * Sanjay Behera: Odisha Cricket Association (OCA) secretary; Father: Ashirbad Behera, former OCA secretary. * Mahim Verma: Cricket Association of Uttarakhand (CAU) secretary: Father: PC Verma, former CAU secretary. * Nidhipati Singhania, JK Group: UP Cricket Association (UPCA) president; Uncle: Late Yadupati Singhania, former UPCA president. * Vipul Phadke: Goa Cricket Association (GCA) secretary; Father: Vinod Phadke, former GCA secretary. * Kechangulie Rio: Nagaland Cricket Association (NCA) president; Father: Neiphiu Rio, former NCA president & Nagaland Chief Minister. On paper, the road to these posts is via an election in each unit. But that’s just on paper. In practice, the transfer of power to the next generation is “smooth” since the veteran administrators (read fathers) have formed tight coteries around them. For years, they decided on all key appointments in their units so they influence voters in districts, clubs or individual members. “Most units were run like private clubs, it was tough for any outsiders to get in,” says a veteran BCCI hand. When sons and relatives of powerful politicians entered the fray, sometimes the old dynasty had to make way. For example, Rajasthan’s Congress CM Ashok Gehlot’s son Vaibhav Gehlot is in charge of cricket in the state. In MP, dynasty and political power in cricket management run parallel. According to Prasanth Mehta, president of the Gwalior Division, Mahanaaryaman’s appointment had Jyotiraditya’s approval. “The House elects the president, and the president is authorised to appoint the managing committee. Jyotiraditya Scindia was elected president (Gwalior) but he declined and then he gave it (post) to me. Then he made the managing committee with Mahanaaryaman as the vice-president. Jyotiraditya is patron of the Gwalior Division and president of the Chambal Division,” Mehta told The Indian Express . Jay Shah was the Gujarat Cricket Association joint secretary before he became BCCI secretary. His father was GCA president. Saurashtra Cricket Association (SCA) has former Ranji captain Jaydev Shah as the president. His father Niranjan Shah was an SCA secretary for four decades and held the same post in the BCCI. When contacted, Niranjan Shah defended passing the baton within the family. “Who can stop anyone from standing for elections? If a person is a capable administrator and has love for the game does it matter if the person is related to a former official? I have been retired because of Lodha Committee rules. But an institution that has been built over the years should not go into the wrong hands. My son is a first-class cricketer, has his own identity and wants to promote cricket,” Niranjan Shah said.","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"‘The Batman’ is finally streaming online","link":"https://www.deseret.com/2022/4/18/23030707/the-batman-is-finally-streaming-online","keywords":null,"creator":["Gitanjali Poonia"],"video_url":null,"description":null,"content":"A poster for “The Batman” featuring Batman and Catwoman. The film, starring Robert Pattinson, is finally on a streaming service. Warner Bros. After “The Batman” had a successful box office release, it was inevitable for the movie to be released on streaming services. Now the film, starring Robert Pattinson, is finally on a streaming service. Where is ‘The Batman’ available to stream?The movie is currently available to stream on HBO Max. You can also buy or rent “The Batman” online on YouTube, Vudu or Apple TV+. Don’t have an HBO subscription? Here are your optionsIf you’re looking to stream the movie, one way is to buy an HBO Max subscription. Here are the different subscription options: HBO Max with ads costs $9.99 a month. HBO Max without ads costs $14.99 a month. According to Variety, both subscriptions give access to new and original content from HBO, including Warner Bros., Turner Classic Movies, Cartoon Network, and more. How to watch ‘The Batman’ for free?Technically, there isn’t a way to stream the movie for free without an HBO Max subscription. The streaming service doesn’t offer a free trial. According to Rolling Stone, it's possible to get a free subscription via a wireless plan. For example, AT&T customers with a specific plan — AT&T Unlimited Elite, AT&T Fiber – Internet 1000 and the DirectTV Stream Choice plans — may be eligible to get HBO Max at no additional cost. Cricket Wireless also includes an HBO Max subscription with the $60 Unlimited package.","pubDate":"2022-04-18 22:00:00","full_description":null,"image_url":null,"source_id":"deseret","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"“McCoy is an interesting guy”: Sanju Samson commends Obed McCoy for defending 11 runs in RR vs KKR IPL 2022 match","link":"https://thesportsrush.com/cricket-news-mccoy-is-an-interesting-guy-sanju-samson-commends-obed-mccoy-for-defending-11-runs-in-rr-vs-kkr-ipl-2022-match/","keywords":["Cricket","IPL 2022","KKR","Rajasthan Royals","Indian Premier League","Kolkata Knight riders","Obed McCoy","rajasthan royals","RR","Sanju Samson"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sanju Samson commends Obed McCoy: The captain of Rajasthan Royals was impressed by the calmness of a debutant. Rajasthan Royals captain Sanju Samson admits that their recently concluded match against Kolkata Knight Riders got “tensed” with the opposition in touching distance of what would’ve been the third-highest run chase in the IPL. “It got tensed.… The post “McCoy is an interesting guy”: Sanju Samson commends Obed McCoy for defending 11 runs in RR vs KKR IPL 2022 match appeared first on The SportsRush.","content":"Sanju Samson commends Obed McCoy: The captain of Rajasthan Royals was impressed by the calmness of a debutant. Rajasthan Royals captain Sanju Samson admits that their recently concluded match against Kolkata Knight Riders got “tensed” with the opposition in touching distance of what would’ve been the third-highest run chase in the IPL. “It got tensed. The quality of players made it very interesting. Very happy for the win. It was important to be calm and believe in ourselves. There are some things that need to used at the right time. You need to be smart enough to slow it down,” Samson told Star Sports about a cliffhanger finish at the Brabourne Stadium tonight. It was indeed a great game of cricket to mark the 15th year since the inception of #IPL! Congrats on the win, @rajasthanroyals! #KKRHaiTaiyaar #RRvKKR #IPL2022 pic.twitter.com/S768fYNLsZ — KolkataKnightRiders (@KKRiders) April 18, 2022 Needing 40 runs in four overs to seal a 218-run chase, Knight Riders had the upper hand on the match before Royals spinner Yuzvendra Chahal bowled a game-changing over. Chahal’s career-best IPL bowling figures comprised of a maiden five-wicket haul and a hat-trick. Sanju Samson commends Obed McCoy for defending 11 runs in RR vs KKR match However, Kolkata fast bowler Umesh Yadav (21) hitting 19 runs off five Trent Boult deliveries in the 18th over had witnessed the match going down to the wire with KKR needing 11 runs off the last over. According to Samson, Indian Premier League debutant Obed McCoy remained “calm” under pressure to pick two wickets in the final over as Rajasthan registered a 7-run victory. Apart from commending McCoy on a successful IPL debut, Samson also highlighted spinner Ravichandran Ashwin’s contribution. While didn’t pick many wickets like Chahal but his carrom call dismissing Andre Russell (0) on the first ball that he faced played a vital role in RR being able to reduce KKR to 210/10 in 19.4 overs. “We are lucky to have great players. Special mention to [Ravichandran] Ashwin for his delivery to [Andre] Russell. And [Obed] McCoy is an interesting guy. He does not talk much and is calm. His ability to bowl well under pressure was commendable,” Samson added. The post “McCoy is an interesting guy”: Sanju Samson commends Obed McCoy for defending 11 runs in RR vs KKR IPL 2022 match appeared first on The SportsRush.","pubDate":"2022-04-18 19:54:20","full_description":"Sanju Samson commends Obed McCoy: The captain of Rajasthan Royals was impressed by the calmness of a debutant. Rajasthan Royals captain Sanju Samson admits that their recently concluded match against Kolkata Knight Riders got “tensed” with the opposition in touching distance of what would’ve been the third-highest run chase in the IPL. “It got tensed. The quality of players made it very interesting. Very happy for the win. It was important to be calm and believe in ourselves. There are some things that need to used at the right time. You need to be smart enough to slow it down,” Samson told Star Sports about a cliffhanger finish at the Brabourne Stadium tonight. It was indeed a great game of cricket to mark the 15th year since the inception of #IPL ! 👏 Congrats on the win, @rajasthanroyals ! 💜💗 #KKRHaiTaiyaar #RRvKKR #IPL2022 pic.twitter.com/S768fYNLsZ — KolkataKnightRiders (@KKRiders) April 18, 2022 Needing 40 runs in four overs to seal a 218-run chase, Knight Riders had the upper hand on the match before Royals spinner Yuzvendra Chahal bowled a game-changing over. Chahal’s career-best IPL bowling figures comprised of a maiden five-wicket haul and a hat-trick. However, Kolkata fast bowler Umesh Yadav (21) hitting 19 runs off five Trent Boult deliveries in the 18th over had witnessed the match going down to the wire with KKR needing 11 runs off the last over. According to Samson, Indian Premier League debutant Obed McCoy remained “calm” under pressure to pick two wickets in the final over as Rajasthan registered a 7-run victory. Apart from commending McCoy on a successful IPL debut, Samson also highlighted spinner Ravichandran Ashwin’s contribution. While didn’t pick many wickets like Chahal but his carrom call dismissing Andre Russell (0) on the first ball that he faced played a vital role in RR being able to reduce KKR to 210/10 in 19.4 overs. “We are lucky to have great players. Special mention to [Ravichandran] Ashwin for his delivery to [Andre] Russell. And [Obed] McCoy is an interesting guy. He does not talk much and is calm. His ability to bowl well under pressure was commendable,” Samson added.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"RR vs KKR Man of the Match IPL 2022: Who is today IPL Man of the Match 2022 between Rajasthan Royals and Kolkata Knight Riders?","link":"https://thesportsrush.com/cricket-news-rr-vs-kkr-man-of-the-match-ipl-2022-who-is-today-ipl-man-of-the-match-2022-between-rajasthan-royals-and-kolkata-knight-riders/","keywords":["Cricket","IPL 2022","KKR","Rajasthan Royals","Indian Premier League","Kolkata Knight riders","rajasthan royals","RR","Yuzvendra Chahal"],"creator":["Dixit Bhargav"],"video_url":null,"description":"RR vs KKR Man of the Match: The spinner from Rajasthan Royals won his sixth Indian Premier League match award. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Rajasthan Royals beat Kolkata Knight Riders by 7 runs in… The post RR vs KKR Man of the Match IPL 2022: Who is today IPL Man of the Match 2022 between Rajasthan Royals and Kolkata Knight Riders? appeared first on The SportsRush.","content":"RR vs KKR Man of the Match: The spinner from Rajasthan Royals won his sixth Indian Premier League match award. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Rajasthan Royals beat Kolkata Knight Riders by 7 runs in a cliffhanger of a contest. A see-saw contest which witnessed in excess of 400 runs being scored was decided with only a couple of deliveries to spare. Chasing what would’ve been their highest-ever run chase in the IPL, Knight Riders were bundled out for 210 in 19.4 overs. A 107-run second-wicket partnership between opening batter Aaron Finch (58) and captain Shreyas Iyer (85) had kept them active in what would’ve been the third-highest run-chase in the history of the IPL but failure to close the same resulted in a fourth IPL 2022 loss. RR vs KKR Man of the Match Rajasthan spinner Yuzvendra Chahal pinned down opening batter Jos Buttler to win the match award at the Cricket Club of India tonight. While Buttler’s third IPL century had provided Royals with a substantial advantage in the first innings, Chahal’s career-best IPL bowling figures comprising of a maiden IPL five-wicket haul and a maiden IPL hat-trick were too worthy to be ignored in a high-scoring thriller. @yuzi_chahal — Rashid Khan (@rashidkhan_19) April 18, 2022 Chahal, who picked bowling figures of 4-0-40-5, dismissed as many as five batters within seven deliveries to turn the tables powering RR to a fourth victory of the season. Chahalllll @yuzi_chahal — Kuldeep yadav (@imkuldeep18) April 18, 2022 “I had to take wickets in this match to change the result. I worked on my bowling. I spoke to the coaches and the skipper. I was thinking of a googly [hat-trick ball to Pat Cummins] but then I didn’t want to take a chance. Would have been a happy with a dot ball as well on my hat-trick ball. My googly was coming out well and sent it down to Venkatesh Iyer,” Chahal told Star Sports during the post-match presentation ceremony. The post RR vs KKR Man of the Match IPL 2022: Who is today IPL Man of the Match 2022 between Rajasthan Royals and Kolkata Knight Riders? appeared first on The SportsRush.","pubDate":"2022-04-18 18:40:33","full_description":"RR vs KKR Man of the Match: The spinner from Rajasthan Royals won his sixth Indian Premier League match award. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Rajasthan Royals beat Kolkata Knight Riders by 7 runs in a cliffhanger of a contest. A see-saw contest which witnessed in excess of 400 runs being scored was decided with only a couple of deliveries to spare. Chasing what would’ve been their highest-ever run chase in the IPL , Knight Riders were bundled out for 210 in 19.4 overs. A 107-run second-wicket partnership between opening batter Aaron Finch (58) and captain Shreyas Iyer (85) had kept them active in what would’ve been the third-highest run-chase in the history of the IPL but failure to close the same resulted in a fourth IPL 2022 loss. Rajasthan spinner Yuzvendra Chahal pinned down opening batter Jos Buttler to win the match award at the Cricket Club of India tonight. While Buttler’s third IPL century had provided Royals with a substantial advantage in the first innings, Chahal’s career-best IPL bowling figures comprising of a maiden IPL five-wicket haul and a maiden IPL hat-trick were too worthy to be ignored in a high-scoring thriller. @yuzi_chahal 🔥🔥🔥🔥🔥 — Rashid Khan (@rashidkhan_19) April 18, 2022 Chahal, who picked bowling figures of 4-0-40-5, dismissed as many as five batters within seven deliveries to turn the tables powering RR to a fourth victory of the season. Chahalllll 🔥🔥🔥 @yuzi_chahal ♥️ — Kuldeep yadav (@imkuldeep18) April 18, 2022 “I had to take wickets in this match to change the result. I worked on my bowling. I spoke to the coaches and the skipper. I was thinking of a googly [hat-trick ball to Pat Cummins] but then I didn’t want to take a chance. Would have been a happy with a dot ball as well on my hat-trick ball. My googly was coming out well and sent it down to Venkatesh Iyer,” Chahal told Star Sports during the post-match presentation ceremony.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rob Key’s remarkable rise is not just a case of a job for the boys | Ali Martin","link":"https://www.theguardian.com/sport/blog/2022/apr/18/rob-keys-remarkable-rise-is-not-just-a-case-of-a-job-for-the-boys","keywords":["ECB","England cricket team","Cricket","Sport politics","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"Former Kent captain turned broadcaster, who has laid down his microphone and put his head on the block as the director of men’s cricket, is not to be underestimatedIn between England’s ruinous Ashes campaign and the largely dismal epilogue in the Caribbean last month, a panel of Rob Key, Mike Atherton and Nasser Hussain recorded a podcast for Sky in which they analysed the Test team’s myriad problems and discussed how they would change things.Key, though supposedly steering the debate as host, was pressed for his views. After detailed responses that have been widely reported over the past few days and which included his belief that player power needs addressing, Atherton joked the only solution was to take charge of the England set-up himself. “The answer to that is no,” Key replied, amid chuckles from all three. Continue reading...","content":null,"pubDate":"2022-04-18 18:33:36","full_description":"I n between England’s ruinous Ashes campaign and the largely dismal epilogue in the Caribbean last month, a panel of Rob Key, Mike Atherton and Nasser Hussain recorded a podcast for Sky in which they analysed the Test team’s myriad problems and discussed how they would change things. Key, though supposedly steering the debate as host, was pressed for his views. After detailed responses that have been widely reported over the past few days and which included his belief that player power needs addressing, Atherton joked the only solution was to take charge of the England set-up himself. “The answer to that is no,” Key replied, amid chuckles from all three. Fast forward a couple of months and, a bit like the old Bob Monkhouse joke about the first time he told people he wanted to be a comedian, they’re not laughing now. Key starts at the England and Wales Cricket Board on Tuesday as its new managing director of men’s cricket, having bounced from playing career to commentary box to one of the most influential positions in the sport. On the face of it this is a remarkable rise and in some quarters – including Mark Ramprakash – viewed as possibly being a case of jobs for the boys. Certainly Key’s direct experience of sports administration is as thin as the field of candidates from which he emerged, such that the ECB comms team even cited his (admittedly always thought-provoking) Evening Standard column in Easter Sunday’s lunch-ruining announcement in a bid to flesh it out a touch. But then there is a case to say that rather than Key’s lack of hours spent throwing to players in the nets, negotiating county contracts or arguing with groundsmen about the height of the mower blades being a hindrance, his time out of – or at least adjacent to – the English system is a strength. His cricketing knowledge is rich from a lifetime in the sport, even if his Test career was largely unfulfilled, and his captaincy of Kent oversaw all facets of the club. He should be able to not just bring fresh ideas, but also scrutinise decision-making all the way down the food chain without an in-built “well, this is how we’ve always done it” mentality. Key also has an important character trait for a role which will hinge greatly on his relationships both within English cricket and overseas: he is a people person but not a people pleaser. Some may think of him as Andrew Flintoff’s old drinking buddy and then the cherry-cheeked butt of the jokes in the Sky box, such as the time they sent him up the rock climbing wall at the Ageas Bowl. And it’s true, he is amusing company and someone who gets on with people from all walks of life. But on the subject of cricket he doesn’t muck about, with his opinions always considered but forthright, and disagreement something he does not avoid just to keep the peace. It is also interesting to hear the jump from cricket commentary to top level administration being questioned by some when Andrew Strauss, managing director from 2015 to 2019 and someone who emerged mainly in credit, made the exact same move. Unless Test captaincy secretly teaches someone how to oversee pathways and manage budgets, perhaps Key’s estuary accent is the difference. Certainly his aversion to corporate speak, at a time when English cricket is utterly infected with it, should be welcomed. And for another example of how the leap from broadcasting to management can be overcome, look at Ravi Shastri, who swapped describing “tracer bullets” on air to heading up India’s coaching staff without any direct experience after his playing days. Delegating much of the day-to-day coaching work to others, Shastri challenged every area of the set-up, bullishly talked up the goal of winning overseas – something which was not always the case previously – and set the tone and tactics for what became a great team. Their fast bowling in particular, under his right-hand man, Bharat Arun, was revolutionised during this period. It would also be very English to spend years bemoaning the loss of Hussain and Atherton to the running of the sport and then turn noses up at Key, someone whose reading of the game is admired by the two former captains, for putting the microphone down and placing his head on the block. The 42-year-old probably had a job for life at Sky and, as he joked when the ECB’s initial approach became public last month, a lot more time to spend on the golf course. As it is, he has taken a bold decision to grasp the tiller of a ship that is listing right now. And it is a huge tanker to turn around. The white-ball teams may be well-drilled under Eoin Morgan with an over-supply of players but the Test side – fifth in the rankings and bottom of the World Test Championship – will need careful husbandry beyond simply appointing a new captain and head coach. The battle over the future of the domestic game, under review by the ECB, could get spiky. As such, Key will require strong lieutenants, possibly some initial assistance with the unfamiliar elements of the role, a bit of luck and maybe a thick skin. There are no guarantees but to say he is not qualified would be underestimating him.","image_url":"https://i.guim.co.uk/img/media/1e0e2959df4caffb9c250de29f1a893f0a295531/0_117_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=8f9ff5a3b8dfce22ec6be9911ddc6270","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Chahal pose: Yuzvendra Chahal hat trick brings back Chahal meme as RR beat KKR by 7 runs at Brabourne Stadium","link":"https://thesportsrush.com/cricket-news-chahal-pose-yuzvendra-chahal-hat-trick-brings-back-chahal-meme-as-rr-beat-kkr-by-7-runs-at-brabourne-stadium/","keywords":["Cricket","IPL 2022","KKR","Rajasthan Royals","Indian Premier League","Kolkata Knight riders","rajasthan royals","RR","Yuzvendra Chahal"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Yuzvendra Chahal hat trick: The spinner from Rajasthan Royals picked his maiden Indian Premier League five-wicket haul. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Rajasthan Royals spinner Yuzvendra Chahal bowled a game-changing over to power his team… The post Chahal pose: Yuzvendra Chahal hat trick brings back Chahal meme as RR beat KKR by 7 runs at Brabourne Stadium appeared first on The SportsRush.","content":"Yuzvendra Chahal hat trick: The spinner from Rajasthan Royals picked his maiden Indian Premier League five-wicket haul. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Rajasthan Royals spinner Yuzvendra Chahal bowled a game-changing over to power his team to a 7-run victory. Chasing a 218-run target, a 107-run second-wicket partnership between opening batter Aaron Finch (58) and captain Shreyas Iyer (85) put Kolkata ahead to a large extent in what would’ve been their highest-ever IPL run chase. Chahal, who had leaked 38 runs in 2.5 overs without picking a wicket, dismissed KKR batter Nitish Rana (18) in the 13th over to put some curbs to the opposition’s progress. On the first delivery of his final over, Chahal sent Venkatesh Iyer (6) back to the pavilion to further dent Knight Riders. With them needing 40 runs off 23 balls to win the match with Shreyas Iyer in the middle, Chahal dismissed him, Shivam Mavi (0) and Pat Cummins (0) on successive deliveries to turn the tables. 21st hat-trick in the IPL, it was the first-ever for Chahal. In the process, Chahal became the fifth bowler (after Ajit Chandila, Praveen Tambe, Shane Watson and Shreyas Gopal) from Rajasthan to perform an IPL hat-trick. Having missed a hat-trick on a couple of occasions earlier this season, the 31-year old player was ecstatic after finally registering one tonight. Bowling figures of 4-0-40-5 are also Chahal’s best in the IPL. Debutant fast bowler Obed McCoy, who successfully defended 11 runs in the last over of the match, also chipped in with a couple of wickets. Twitter reactions on Yuzvendra Chahal hat trick: Special feat deserves special celebration! Hat-trick hero @yuzi_chahal! Follow the match https://t.co/f4zhSrBNHi#TATAIPL | #RRvKKR | @rajasthanroyals pic.twitter.com/NhAmkGdvxo — IndianPremierLeague (@IPL) April 18, 2022 Chahal. Simply Outstanding . Ball hi nahi Rajasthan ki kismat bhi spin kar di. #RRvKKR pic.twitter.com/ZrChdoMKaS — Virender Sehwag (@virendersehwag) April 18, 2022 What a game-changing spell by @yuzi_chahal! We’ve witnessed the first hat-trick of the season. Loved the pose after your hat-trick. #IPL #RRvKKR pic.twitter.com/K2ByMZg2ai — Yusuf Pathan (@iamyusufpathan) April 18, 2022 You won’t see a better hat-trick celebration #IPL2022 #YuzvendraChahal #RRvKKR pic.twitter.com/w6bsk0kOXn — Wisden India (@WisdenIndia) April 18, 2022 For more cricket-related news, click here. The post Chahal pose: Yuzvendra Chahal hat trick brings back Chahal meme as RR beat KKR by 7 runs at Brabourne Stadium appeared first on The SportsRush.","pubDate":"2022-04-18 18:26:27","full_description":"Yuzvendra Chahal hat trick: The spinner from Rajasthan Royals picked his maiden Indian Premier League five-wicket haul. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Rajasthan Royals spinner Yuzvendra Chahal bowled a game-changing over to power his team to a 7-run victory. Chasing a 218-run target, a 107-run second-wicket partnership between opening batter Aaron Finch (58) and captain Shreyas Iyer (85) put Kolkata ahead to a large extent in what would’ve been their highest-ever IPL run chase . Chahal, who had leaked 38 runs in 2.5 overs without picking a wicket, dismissed KKR batter Nitish Rana (18) in the 13th over to put some curbs to the opposition’s progress. On the first delivery of his final over, Chahal sent Venkatesh Iyer (6) back to the pavilion to further dent the Knight Riders. With them needing 40 runs off 23 balls to win the match with Shreyas Iyer in the middle, Chahal dismissed him, Shivam Mavi (0) and Pat Cummins (0) on successive deliveries to turn the tables in real sense. 21st hat-trick in the IPL , it was the first-ever for Chahal in the biggest T20 tournament across the globe. In the process, Chahal became the fifth bowler (after Ajit Chandila, Praveen Tambe, Shane Watson and Shreyas Gopal) from Rajasthan to perform an IPL hat-trick. Having missed a hat-trick on a couple of occasions earlier this season, the 31-year old player was ecstatic after finally registering one tonight. Bowling figures of 4-0-40-5 are also Chahal’s best in the IPL. Debutant fast bowler Obed McCoy, who successfully defended 11 runs in the last over of the match, also chipped in with a couple of wickets when it mattered the most. Special feat deserves special celebration! 🙌🙌 Hat-trick hero @yuzi_chahal ! 👏 👏 Follow the match ▶️ https://t.co/f4zhSrBNHi #TATAIPL | #RRvKKR | @rajasthanroyals pic.twitter.com/NhAmkGdvxo — IndianPremierLeague (@IPL) April 18, 2022 Chahal. Simply Outstanding . Ball hi nahi Rajasthan ki kismat bhi spin kar di. #RRvKKR pic.twitter.com/ZrChdoMKaS — Virender Sehwag (@virendersehwag) April 18, 2022 What a game-changing spell by @yuzi_chahal ! We’ve witnessed the first hat-trick of the season. Loved the pose after your hat-trick. 🤣 #IPL #RRvKKR pic.twitter.com/K2ByMZg2ai — Yusuf Pathan (@iamyusufpathan) April 18, 2022 You won’t see a better hat-trick celebration 😆 #IPL2022 #YuzvendraChahal #RRvKKR pic.twitter.com/w6bsk0kOXn — Wisden India (@WisdenIndia) April 18, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Venkatesh Iyer and Shreyas Iyer relationship: Is Shreyas Iyer from Kerala?","link":"https://thesportsrush.com/cricket-news-venkatesh-iyer-and-shreyas-iyer-relationship-is-shreyas-iyer-from-kerala/","keywords":["Cricket","IPL 2022","KKR","Indian Premier League","IPL","Kolkata Knight riders","shreyas iyer","Venkatesh Iyer"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Venkatesh Iyer and Shreyas Iyer relationship: Both the batters are playing for KKR in the ongoing season of the marquee league. During the 30th match of the ongoing 15th season of the Indian Premier League at the Brabourne Stadium in Mumbai, Kolkata Knight Riders (KKR) skipper Shreyas Iyer played a scintillating knock of 85 off… The post Venkatesh Iyer and Shreyas Iyer relationship: Is Shreyas Iyer from Kerala? appeared first on The SportsRush.","content":"Venkatesh Iyer and Shreyas Iyer relationship: Both the batters are playing for KKR in the ongoing season of the marquee league. During the 30th match of the ongoing 15th season of the Indian Premier League at the Brabourne Stadium in Mumbai, Kolkata Knight Riders (KKR) skipper Shreyas Iyer played a scintillating knock of 85 off mere 51 deliveries en route the chase of a massive target of 218 handed by the Rajasthan Royals. The KKR chase started on a disastrous note, with Sunil Narine being sold down the river by Aaron Finch on the very first delivery of the innings at naught. However, the chase began from scratch the moment Iyer arrived at the crease, as he joined hands with Finch (58 off 28) to stitch together a 107-run stand in mere 8.5 Overs for the second wicket. With Nitish Rana (18 off 11) getting out cheaply, and the dangerous Andre Russell returning back off a Golden Duck as well, the Shreyas Iyer juggernaut, comprising 7 Fours and 4 Sixes, continued with its own merry-way, smashing pacers and spinners alike. Shreyas Iyer has clobbered Rajasthan Royals, made this huge chase of 218 look so easy @ShreyasIyer15 #KKRvsRR #KKRvRR #RRvKKR — Sushant Mehta (@SushantNMehta) April 18, 2022 ALSO READ: Are Umesh Yadav and Kuldeep Yadav related? Venkatesh Iyer and Shreyas Iyer relationship With 40 runs required off the final four Overs, Shreyas Iyer lost his fellow KKR batter Venkatesh Iyer (6 off 7) after the latter was demoted down the order having opened for his franchise up till now. Despite sharing similar surnames, the only similarity between the Iyer duo is that they have represented KKR and the Indian Cricket team in their respective Cricketing careers so far. Shreyas Iyer, in fact was born in Mumbai, and has represented the West Zone, Mumbai, and the Mumbai Cricket Association XI while growing up in Mumbai before playing for India. Venkatesh Iyer, on the other hand, was born in Indore, Madhya Pradesh and has represented the same in the domestic matches. While Shreyas made his international debut for team India against New Zealand in November 2017, Venkatesh made his debut appearance for Indian last year in November, against New Zealand as well. The post Venkatesh Iyer and Shreyas Iyer relationship: Is Shreyas Iyer from Kerala? appeared first on The SportsRush.","pubDate":"2022-04-18 18:12:18","full_description":"Venkatesh Iyer and Shreyas Iyer relationship: Both the batters are playing for KKR in the ongoing season of the marquee league. During the 30th match of the ongoing 15th season of the Indian Premier League at the Brabourne Stadium in Mumbai, Kolkata Knight Riders (KKR) skipper Shreyas Iyer played a scintillating knock of 85 off mere 51 deliveries en route the chase of a massive target of 218 handed by the Rajasthan Royals. The KKR chase started on a disastrous note, with Sunil Narine being sold down the river by Aaron Finch on the very first delivery of the innings at naught. However, the chase began from scratch the moment Iyer arrived at the crease, as he joined hands with Finch (58 off 28) to stitch together a 107-run stand in mere 8.5 Overs for the second wicket. With Nitish Rana (18 off 11) getting out cheaply, and the dangerous Andre Russell returning back off a Golden Duck as well, the Shreyas Iyer juggernaut, comprising 7 Fours and 4 Sixes, continued with its own merry-way, smashing pacers and spinners alike. Shreyas Iyer has clobbered Rajasthan Royals, made this huge chase of 218 look so easy 🇮🇳🔥 @ShreyasIyer15 #KKRvsRR #KKRvRR #RRvKKR — Sushant Mehta (@SushantNMehta) April 18, 2022 ALSO READ : Are Umesh Yadav and Kuldeep Yadav related? With 40 runs required off the final four Overs, Shreyas Iyer lost his fellow KKR batter Venkatesh Iyer (6 off 7) after the latter was demoted down the order having opened for his franchise up till now. Despite sharing similar surnames, the only similarity between the Iyer duo is that they have represented KKR and the Indian Cricket team in their respective Cricketing careers so far. Shreyas Iyer, in fact was born in Mumbai , and has represented the West Zone, Mumbai, and the Mumbai Cricket Association XI while growing up in Mumbai before playing for India. Venkatesh Iyer, on the other hand, was born in Indore, Madhya Pradesh and has represented the same in the domestic matches. While Shreyas made his international debut for team India against New Zealand in November 2017, Venkatesh made his debut appearance for Indian last year in November, against New Zealand as well.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"England cricket team wants Ricky Ponting as Test coach, says report","link":"https://www.business-standard.com/article/sports/england-cricket-team-wants-ricky-ponting-as-test-coach-says-report-122041801260_1.html","keywords":null,"creator":null,"video_url":null,"description":"The Australian legend Ponting is currently working as head coach with the Indian Premier League (IPL) franchise Delhi Capitals","content":null,"pubDate":"2022-04-18 18:11:00","full_description":"Former Australia captain Ricky Ponting is reportedly being targeted to coach England's Test team. The Australian legend Ponting is currently working as head coach with the Indian Premier League (IPL) franchise Delhi Capitals . Rob Key, the former Kent and England batter who subsequently forged a successful career in broadcasting, has been appointed by the ECB as its new managing director of England men's cricket. According to a report published by The Times, Ponting is 'high on Key's list of targets for Test coach' along with former India and South Africa coach Gary Kirsten. The report also states that Sri Lanka legend Mahela Jayawardene, who has extensive coaching experience on the franchise circuit with the likes of Mumbai Indians in the IPL and Southern Brave in The Hundred, is 'likely to be approached to coach the white-ball team', reports mirror.co.uk. Former England captain Nasser Hussain has previously called for Ponting to get the job. He told the Daily Mail, \"For me, there is no finer brain in cricket at the moment than Ricky Ponting, who reads the game so well. \"The new coach has to be someone the players' respect; the dressing room has been a bit too nice in recent years. And, my goodness, if the batters in that England team aren't going to listen to what Ponting has to say about technique, then why are they playing the game? \"Not all greats of the game become good coaches because they're not sure how to get their message across. Ponting doesn't have that problem,\" Hussain had said. \"But because I can't see him wanting to commit to a year-round gig -- if he wants to commit at all -- then we have to split the role. And there's no reason why Paul Collingwood can't be in charge of the white-ball team.\" --IANS inj/bsk (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220418/thumb-122041801260.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Kolkata Knight Riders Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/rajasthan-royals-vs-kolkata-knight-riders-live-score-over-match-30-t20-16-20-updates-2898998","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Rajasthan Royals vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-18 17:52:12","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 19.4 overs, Kolkata Knight Riders, chasing a target of 218, are 210. The live updates of Rajasthan Royals vs Kolkata Knight Riders scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Rajasthan Royals vs Kolkata Knight Riders, Rajasthan Royals vs Kolkata Knight Riders live score, Rajasthan Royals vs Kolkata Knight Riders scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 19.4 overs (0 Run) OUT! b Obed McCoy. 19.3 overs (1 Run) A slower full-length ball, on the pads. Varun Chakaravarthy flicks it to mid-wicket for a single. Varun Chakaravarthy is the last man in. 19.2 overs (0 Run) OUT! CAUGHT! Obed McCoy strikes and sends back Sheldon Jackson on 8. This is a short ball, on the bodyline. Sheldon Jackson swivels and pulls it to short fine leg. Prasidh Krishna there takes a dolly. Obed McCoy picks up a crucial wicket under pressure on his debut. 19.1 overs (2 Runs) Full length, on leg. Sheldon Jackson heaves it to deep square leg. Shimron Hetmyer does well to keep it down to just two runs. Could've been a boundary if not for Shimron Hetmyer. Obed McCoy will bowl the final over of this game. 18.6 overs (0 Run) A dot ball to end the over. Kolkata need 11 of 6 balls. Full length, outside off, angled across the right-hander. Umesh Yadav tries to reach out but gets beaten on the outside edge. 18.5 overs (1 Run) Back of a length, outside off. Sheldon Jackson punches it through cover for one. 18.4 overs (1 Run) This one lands full and wide outside off. Umesh Yadav reaches out and pushes it through point for a single. 18.4 overs (1 Run) WIDE! On a length, outside off, shaping away off the deck. It flies past the tramline. Yadav leaves it alone. Wide called. 18.3 overs (1 Run) Fuller, wide outside off. Sheldon Jackson guides it to backward point for a single. 18.2 overs (2 Runs) Full length, outside off. Sheldon Jackson slices it to deep point for two runs. 18.1 overs (1 Run) OUCH! That must've hurt Sheldon Jackson. A full-length ball, on off. Umesh Yadav clobbers it down the ground. Sheldon Jackson fails to get out of the way and gets hit on his helmet. He says he is alright. Prasidh Krishna will bowl the penultimate over! 17.6 overs (1 Run) Short ball, on the body. Umesh Yadav pulls it to deep mid-wicket for a single. 17.5 overs (4 Runs) FOUR! Oh my god! Umesh Yadav continues to send the ball beyond the ropes. He moves to 18 off 4 deliveries. A length ball, on off. Umesh Yadav punches it through covers for one. 17.4 overs (6 Runs) SIX! ALL THE WAY! Umesh Yadav is on the charge. Full-length ball, on off. Umesh Yadav shuffles across and sends it over the long on fence for a maximum. 17.3 overs (2 Runs) A short ball, on off. Umesh Yadav pulls it through mid-wicket for two runs. 17.2 overs (6 Runs) SIX! BANG! Umesh Yadav says it is game on! It is full, on off. Umesh Yadav gets under it and lofts it over the bowler's head for a biggie. 17.1 overs (1 Run) A length ball, on off. Sheldon Jackson drives it to long on for a single. 16.6 overs (0 Run) OUT! CAUGHT BEHIND! YES, HE CAN! Yuzvendra Chahal picks up a Hat-Trick and this the first time he has picked up five wickets in an Indian T20 League. It is tossed up, outside off, spinning away. Pat Cummins tries to defend it on the front foot. The ball kisses the outside edge and Sanju Samson takes a sharp catch behind the sticks. This is incredible. Yuzvendra Chahal sprints down for his celebration. Pat Cummins is the new man in. 16.5 overs (0 Run) OUT! CAUGHT! Yuzvendra Chahal, you beauty! He picks up his fourth of the night. What a season he is having. It is full and on off. Shivam Mavi clears his front leg and slogs it to deep mid-wicket. Riyan Parag makes no mistake in the deep. Yuzvendra Chahal is on a hat-trick. Can he do it? Shivam Mavi comes to the crease. 16.4 overs (0 Run) OUT! LBW! Yuzvendra Chahal appeals for LBW and the umpire agrees. Shreyas Iyer opts to take the review. It is fuller, on middle and leg, Iyer walks clears his front leg and tries to heave it across the line but misses. He gets pinged on his pads and sees the dreaded finger. The review does not work in his favour, as the Ball Tracking shows three reds. Yuzvendra Chahal picks up two wickets in this over and gets his side back in the game. 16.4 overs (1 Run) WIDE! Full, wide outside the tramline. Shreyas Iyer leaves it alone. Wide called. 16.3 overs (1 Run) Full, on the pads, Sheldon Jackson clips it to square leg for a single. 16.2 overs (0 Run) Tossed up, full and on off. Sheldon Jackson gets an inside edge on his pads. Sheldon Jackson walks out to the middle. 16.1 overs (0 Run) OUT! STUMPED! Venkatesh Iyer tries to break his shackles but holes out instead. This is a huge wicket for Rajasthan. Yuzvendra Chahal punches the air in delight. He picks up his second of the innings. It if fuller, on off. Venkatesh Iyer dances down the track, tries to heave it away but misses. The ball goes past the blade. Sanju Samson gathers the ball and clips the bails quickly to send back Venkatesh Iyer. 15.6 overs (1 Run) Just a single! Full length, outside off. Venkatesh Iyer slices it to deep point. The batters take one as Shimron Hetmyer was quick to get to the ball. 15.5 overs (1 Run) Full length, on the pads, Iyer flicks it to mid-wicket for a single. 15.4 overs (1 Run) Length ball, on off. Venkatesh Iyer works it to cover for one. 15.3 overs (1 Run) Short ball, on the body. Shreyas Iyer pulls it to deep mid-wicket for a single. 15.2 overs (6 Runs) SIX! Just enough to beat the man in the deep. It is a short ball, on off. Shreyas Iyer moves to the leg side, gives himself some room and upper cuts it over the deep point fence for a biggie. 15.1 overs (1 Run) Full length, outside off. Venkatesh Iyer whips it through mid-wicket for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859209239247276.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Highest chase in IPL history: IPL highest run chase in all seasons","link":"https://thesportsrush.com/cricket-news-highest-chase-in-ipl-history-ipl-highest-run-chase-in-all-seasons/","keywords":["Cricket","IPL 2022","KKR","Rajasthan Royals","Indian Premier League","Kolkata Knight riders","rajasthan royals","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest chase in IPL: Kolkata Knight Riders are chasing what will become their highest-ever successful run chase in the history of the IPL. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Rajasthan Royals put on board a formidable… The post Highest chase in IPL history: IPL highest run chase in all seasons appeared first on The SportsRush.","content":"Highest chase in IPL: Kolkata Knight Riders are chasing what will become their highest-ever successful run chase in the history of the IPL. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Rajasthan Royals put on board a formidable 217/5 in 20 overs after being put in to bat first by Kolkata Knight Riders captain Shreyas Iyer. Needing 218 runs to win the match, Kolkata will have to register the third-highest run chase in the history of the IPL. As far as their personal record is concerned, a successful 218-run chase will become their highest-ever. Been on the wrong side of Rajasthan opening batter Jos Buttler’s third IPL century, Knight Riders’ ploy of promoting spinner Sunil Narine in the batting order didn’t work for them as the left-hand batter returned to the pavilion without even facing a delivery. ALSO READ: Highest partnership score in Indian Premier League history Having said that, opening batter Aaron Finch and captain Shreyas Iyer put together a game-changing 107-run partnership to put Royals on the back foot. An enthralling contest at the Cricket Club of India has since kept both the teams in contention of staging their fourth IPL 2022 victory. Given the current match situation, Iyer will have to lead from the front in KKR are to prevent a fourth defeat this season. Assuming that Iyer manages to seal this record chase, it will bolster his personal reputation in the shortest format to a large extent. Unleashing his SUPERHERO avatar! #CaptainNova, you beauty! @ShreyasIyer15 #KKRHaiTaiyaar #RRvKKR #GalaxyOfKnights #IPL2022 pic.twitter.com/IvLoANaQLY — KolkataKnightRiders (@KKRiders) April 18, 2022 Highest chase in IPL Target Team Oppositon Ground Year 224 Rajasthan Royals Punjab Kings Sharjah 2020 219 Mumbai Indians Chennai Super Kings Delhi 2021 215 Rajasthan Royals Deccan Chargers Hyderabad 2008 209 Delhi Capitals Gujarat Lions Delhi 2017 The post Highest chase in IPL history: IPL highest run chase in all seasons appeared first on The SportsRush.","pubDate":"2022-04-18 17:38:36","full_description":"Highest chase in IPL: Kolkata Knight Riders are chasing what will become their highest-ever successful run chase in the history of the IPL. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Rajasthan Royals put on board a formidable 217/5 in 20 overs after being put in to bat first by Kolkata Knight Riders captain Shreyas Iyer. Needing 218 runs to win the match, Kolkata will have to register the third-highest run chase in the history of the IPL. As far as their personal record is concerned, a successful 218-run chase will become their highest-ever . Been on the wrong side of Rajasthan opening batter Jos Buttler’s third IPL century , Knight Riders’ ploy of promoting spinner Sunil Narine in the batting order didn’t work for them as the left-hand batter returned to the pavilion without even facing a delivery. ALSO READ: Highest partnership score in Indian Premier League history Having said that, opening batter Aaron Finch and captain Shreyas Iyer put together a game-changing 107-run partnership to put Royals on the back foot. An enthralling contest at the Cricket Club of India has since kept both the teams in contention of staging their fourth IPL 2022 victory. Given the current match situation, Iyer will have to lead from the front in KKR are to prevent a fourth defeat this season. Assuming that Iyer manages to seal this record chase, it will bolster his personal reputation in the shortest format to a large extent. Unleashing his SUPERHERO avatar! 🔥 #CaptainNova , you beauty! 😍 @ShreyasIyer15 #KKRHaiTaiyaar #RRvKKR #GalaxyOfKnights #IPL2022 pic.twitter.com/IvLoANaQLY — KolkataKnightRiders (@KKRiders) April 18, 2022","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Kolkata Knight Riders: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/rajasthan-royals-vs-kolkata-knight-riders-live-score-over-match-30-t20-11-15-updates-2898914","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Rajasthan Royals vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-18 17:26:07","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.2 overs, Kolkata Knight Riders, chasing a target of 218, are 174/4. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Rajasthan Royals and Kolkata Knight Riders. Everything related to Rajasthan Royals and Kolkata Knight Riders match will be available on Sports.NDTV.com . Stay updated with Rajasthan Royals vs Kolkata Knight Riders live score. Do check for Rajasthan Royals vs Kolkata Knight Riders scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (0 Run) No run. 14.5 overs (4 Runs) FOUR! Pitches it up again, outside off. Shreyas Iyer walks across and drags it with the inner half of his bat towards deep square leg for a boundary. This is smart batting by Shreyas Iyer. The drop has cost Rajasthan 10 runs so far! 14.5 overs (1 Run) Wide! Wide of off, fuller ball. Shreyas Iyer leaves it alone. Wide called! 14.4 overs (6 Runs) SIX! Up, up and away! Fuller length delivery, around middle. Shreyas Iyer walks across and whips it over deep square leg for a biggie. 14.3 overs (1 Run) Fuller length delivery, outside off. Venkatesh Iyer pushes it uppishly towards mid off. The fielder there collects the ball on a bounce. Single taken! 14.2 overs (1 Run) DROPPED! Oh, dear! Sanju Samson drops an easy catch! Shreyas Iyer gets a life. A shorter ball, down leg. Shreyas Iyer looks to pull this but he gets a slight outside edge towards the keeper. Sanju Samson dives to his left, and gets to the ball, but he fails to hold on to it. Single taken! 14.2 overs (1 Run) Wide! A full toss, wide of off. Shreyas Iyer leaves it alone. Wide called! 14.1 overs (1 Run) On a length, outside off. Venkatesh Iyer pushes it off the back foot towards deep cover for a single. 13.6 overs (2 Runs) Tad shorter, around middle. Shreyas Iyer works it away towards deep mid-wicket for a brace. 13.5 overs (1 Run) Drifting in, on the pads, fuller ball. Venkatesh Iyer flicks it through square leg for a single. Venkatesh Iyer comes out at number 6. 13.4 overs (0 Run) OUT! CLEANED HIM UP! Ravichandran Ashwin gets the dangerous Andre Russell out for a first-ball duck! What a beauty by Ashwin! It's the carrom ball that has done the trick. A fuller ball, slower through the air, spinning away just a tad, around off. Andre Russell looks to defend this but he gets beaten on the outside edge. The ball goes on the hit the off pole. 13.3 overs (1 Run) Fuller ball, on the pads. Shreyas Iyer tucks it towards square leg and takes a single. 13.2 overs (0 Run) Outside off, shortish ball. Shreyas Iyer cuts it towards point. 13.1 overs (0 Run) Slower through the air, full, around off. Shreyas Iyer pushes it towards cover. Strategic break! Kolkata came out with a single intent and that was to chase this target down. The current run rate is way above the required run rate. Thanks to some brutal hitting by Aaron Finch and Shreyas Iyer, the former though found his way back to the pavilion. Rajasthan need to control the run rate and will hope to capitalize on this wicket of Nitish Rana. Andre Russell is the new man at the crease for Kolkata. 12.6 overs (0 Run) OUT! TAKEN! This time Nitish Rana perishes and Yuzvendra Chahal has his man! Much-needed wicket for Rajasthan. A loopy ball, full, around middle. Nitish Rana gets down on his knee once again and sweeps this but the ball goes off the top edge towards long on. Jos Buttler takes an easy there. 12.5 overs (1 Run) Fuller ball, around middle. Shreyas Iyer knocks it down to long on for a single. 12.4 overs (3 Runs) In the air...and that lands safe! Another tosses up delivery, around middle, fuller ball. Nitish Rana once again sweeps this towards deep mid-wicket. Shimron Hetmyer runs to his right, dives forward, and fails to get to the ball. Three taken! 12.3 overs (6 Runs) SIX! This is bigger and better! A loopy ball, around middle, full in length. Nitish Rana gets down on his knee and slog-sweeps it over long on for a biggie. 12.2 overs (4 Runs) FOUR! Top shot! A fuller ball, around middle. Nitish Rana smashes it down the ground for a cracking boundary. 12.1 overs (0 Run) An appeal for LBW, but the umpire says no! A fuller ball, around the leg pole. Nitish Rana looks to reverse-sweep this but he misses and gets hit on the pad. Rajasthan do go up the review! No bat involved confirms UltraEdge. Ball Tracking shows it is the umpire's call on impact and wickets hitting. Th on-field decision stays! 11.6 overs (2 Runs) Fuller ball, down leg. Shreyas Iyer scoops it over short fine leg for a couple of runs. 11.5 overs (6 Runs) SIX! High and handsome! A carrom ball this time, tad fuller, around middle. Shreyas Iyer shimmies down the pitch and dispatches it high over long on for a biggie. 11.4 overs (1 Run) Another fuller delivery, around middle. Nitish Rana strokes it towards long off and takes a single. 11.3 overs (1 Run) Shorter ball, around midde. Shreyas Iyer pushes it down to long on off the back foot for a single. 11.2 overs (1 Run) Slower through the air, very full, around middle. Nitish Rana knocks it towards long on and takes a single. 11.1 overs (0 Run) Fuller ball, down leg. Nitish Rana gets down on his knee and tries to reverse-sweep this but he misses. 10.6 overs (1 Run) Outside off, tad shorter. Nitish Rana cuts it towards point for a single. 10.5 overs (1 Run) Tosses it up, full, around middle. Shreyas Iyer steps down the pitch and pushes it towards long on for a single. 10.4 overs (1 Run) Full length, down the leg side. Nitish Rana sweeps it but he manages to get his glove on it and it goes towards short fine leg. Single taken! 10.3 overs (1 Run) Loopy delivery, full, around middle. Shreyas Iyer knocks it down to long on for a single. 10.3 overs (1 Run) Wide! Wide of off, spinning away, fuller ball. Shreyas Iyer leaves it alone. Wide called. 10.2 overs (1 Run) A full toss, dow leg. Nitish Rana gets down on his knee and sweeps it towards deep square leg for a single. 10.1 overs (1 Run) Tosses it up, fuller, outside off. Shreyas Iyer cuts it to short third man for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859193583710351.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Live IPL Score RR vs KKR Live Cricket Score: Shreyas Iyer Hits Fifty, Kolkata Knight Riders On Track In Chase Of 218 | Cricket News - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1yci12cy1ra3ItbGl2ZS1jcmlja2V0LXNjb3JlLXJhamFzdGhhbi1yb3lhbHMtdnMta29sa2F0YS1rbmlnaHQtcmlkZXJzLWxpdmUtc2NvcmVib2FyZC1hbmQtdXBkYXRlcy0yODk3OTY30gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Live IPL Score RR vs KKR Live Cricket Score: Shreyas Iyer Hits Fifty, Kolkata Knight Riders On Track In Chase Of 218 | Cricket News  NDTV SportsKKR STRATEGY TO BOUNCE BACK  NEWS9 liveSunil Narine Milestone: 150 T20s for KKR | Knight Live Exclusive | KKR IPL 2022  Kolkata Knight RidersRR vs KKR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Royals vs KKR, Indian Premier League 2022, 30th Match  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-04-18 17:03:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Kolkata Knight Riders Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/rajasthan-royals-vs-kolkata-knight-riders-live-score-over-match-30-t20-6-10-updates-2898832","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Rajasthan Royals vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-18 17:01:39","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.1 overs, Kolkata Knight Riders, chasing a target of 218, are 117/2. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Rajasthan Royals and Kolkata Knight Riders. Everything related to Rajasthan Royals and Kolkata Knight Riders match will be available on Sports.NDTV.com . Stay updated with Rajasthan Royals vs Kolkata Knight Riders live score. Do check for Rajasthan Royals vs Kolkata Knight Riders scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (1 Run) 1 run. 9.5 overs (2 Runs) 2 runs. 9.4 overs (0 Run) No run. 9.3 overs (0 Run) Full, outside off. Iyer pushes it back to the bowler. 9.2 overs (6 Runs) SIX! BANG! It is on a length, outside off. Shreyas Iyer reverse-hits it over the third man fence for a maximum. 9.1 overs (0 Run) Fuller, on off. Iyer eases it back to the bowler. Nitish Rana walks out to bat now. 8.6 overs (0 Run) OUT! CAUGHT! Prasidh Krishna strikes and gets rid of the big fish. Aaron Finch valiant knock comes to an end. There are some words being exchanged between the two as Finch walks off the field. It is a short ball, outside off. Aaron Finch stands back and upper cuts it towards deep point. Karun Nair settles under it and takes a sharp catch. 8.6 overs (1 Run) WIDE! Very full, wide outside off. Aaron Finch leaves it alone. Wide called again. 8.6 overs (1 Run) WIDE! Slower one down leg, Finch lets it be. Wide called by the umpire. 8.5 overs (1 Run) Very full, wide outside off. Shreyas Iyer tries to dig it out, it goes to square leg off the bottom edge. They take one. 8.4 overs (1 Run) A yorker now, wide outside off. Finch guides it to deep point for a single. 8.3 overs (4 Runs) FOUR! Nicely played. Length ball, outside off. Aaron Finch guides it past backward point for a boundary. 8.2 overs (4 Runs) FOUR! Kolkata continue to score boundaries in every over. With this boundary Finch also marks his half-century. A short ball, on middle and leg. Aaron Finch pulls it to fine leg for a boundary. 8.2 overs (1 Run) WIDE! Fuller, wide outside off. Aaron Finch does not bother. Wide called as it is outside the tramline. 8.1 overs (1 Run) Full toss, outside off. Shreyas Iyer punches it to sweeper cover for a single. 7.6 overs (2 Runs) Full length, on the pads, Aaron Finch flicks it through mid-wicket for two runs. 19 runs off the over. Kolkata continue to score at a brisk rate. The pressure is on Rajasthan at the moment. 7.5 overs (6 Runs) SIX! Sensational shot by Aaron Finch. He races away to 47. Full length, on off. Aaron Finch greets it with full face of the blade and sends it sailing over the long off fence for a maximum. 7.4 overs (4 Runs) FOUR! EDGY! A short ball, on the bodyline. Aaron Finch tries to hook it way. It goes towards the fine leg off the top-edge and he won't mind that at all. 7.3 overs (3 Runs) Full length, on the pads. Shreyas Iyer flicks it to deep square leg. The batters pick three runs before the fielder cuts it out. 7.3 overs (1 Run) WIDE! Slower one, wide outside the tramline. Shreyas Iyer does not bother. The umpire signals a wide. 7.2 overs (1 Run) Good length, on leg. Aaron Finch flicks it to mid-wicket for a quick single. 7.1 overs (1 Run) Length ball, around the hips. Shreyas Iyer flicks it to square leg for a single. 7.1 overs (1 Run) WIDE! A slower bouncer, down leg. Shreyas Iyer looks to pull it away but misses. Wide called. Strategic break! After losing a wicket on the first ball of the innings, Aaron Finch and Shreyas Iyer have done really well and are within the asking rate for now. Rajasthan will have to find ways to break this partnership and take things under control. Obed McCoy comes back to bowl. 6.6 overs (4 Runs) FOUR! The man in-form, Yuzvendra Chahal, has been sent to the cleaners by Aaron Finch in his first over of the innings. It is full and on off. Aaron Finch hits it to wide of long on and bags a boundary. 17 runs off the over. Kolkata have started strongly despite losing an early wicket. 6.5 overs (4 Runs) FOUR! Aaron Finch hits the second boundary of the over. Tossed up, full and on off. Aaron Finch lofts it over the bowler's head for a boundary. 6.4 overs (1 Run) Another single now, as Shreyas Iyer pushes this full delivery to covers. 6.3 overs (1 Run) Flatter, outside off. Aaron Finch cuts it through point for one. 6.3 overs (1 Run) WIDE! Way outside off. Aaron Finch leaves it alone. Wided. 6.2 overs (4 Runs) FOUR! Aaron Finch is on the charge here. This is full and on the stumps. Aaron Finch gets under it and slaps it down the ground for a boundary. 6.2 overs (1 Run) WIDE! Slower ball, outside off, it turns away off the deck. Aaron Finch does not chase it as it outside the tramline. Wide called. 6.1 overs (1 Run) Short ball, outside off. Shreyas Iyer punches it to cover for a single. 5.6 overs (6 Runs) SIX! WOW! Wonderful shot! A fuller ball, around off. Aaron Finch makes room and lifts it high over long off for a biggie! 5.5 overs (1 Run) Shortish ball, around middle and leg. Shreyas Iyer flicks it towards the leg side, but the ball hits the pads and goes towards the off side. Single taken! 5.4 overs (4 Runs) FOUR! Terrific shot! Flatter and on off. Shreyas Iyer goes back and slashes it through point. The ball races away to the fence. 5.3 overs (2 Runs) Good running! Fuller, on the pads, Shreyas Iyer clips it to mid-wicket for a brace. 5.2 overs (1 Run) Short and outside off. Aaron Finch cuts it through covers for a single. 5.1 overs (0 Run) Aaron Finch moves to the leg side. Ravichandran Ashwin follows him with a fuller delivery. Aaron Finch fails to pick it up.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859178913043997.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Kolkata Knight Riders: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/rajasthan-royals-vs-kolkata-knight-riders-live-score-over-match-30-t20-1-5-updates-2898745","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Rajasthan Royals vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-18 16:33:52","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.4 overs, Kolkata Knight Riders, chasing a target of 218, are 50/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Rajasthan Royals and Kolkata Knight Riders. Everything related to Rajasthan Royals and Kolkata Knight Riders match will be available on Sports.NDTV.com . Stay updated with Rajasthan Royals vs Kolkata Knight Riders live score. Do check for Rajasthan Royals vs Kolkata Knight Riders scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (1 Run) Marginally short, outside off. Aaron Finch taps it towards cover-point for a single. He retains the strike. 4.6 overs (1 Run) Wide! Fuller ball, down the leg side, slower in pace. Aaron Finch leaves it alone. Wide given! 4.5 overs (4 Runs) FOUR! Top shot! On a length, width on offer now. Aaron Finch slices it over point for a boundary. 4.4 overs (1 Run) Short ball, wide of off. Shreyas Iyer makes room and slashes it towards deep point for a single. 4.3 overs (4 Runs) FOUR! Shreyas Iyer is on the charge here. A full-length ball, outside off. Shreyas Iyer waits for it and guides it past backward point for a boundary. 4.2 overs (0 Run) Very full, outside off. Shreyas Iyer taps it towards mid off. 4.1 overs (1 Run) A low full toss, around off. Aaron Finch taps it towards Shimron Hetmyer at cover and he runs across to the other end for a quick single. 3.6 overs (0 Run) Yorker-length delivery, outside off. Shreyas Iyer tries to steer it down to thrid man but he manages to get an inside edge towards the keeper. 3.5 overs (2 Runs) Shorter ball, around middle. Shreyas Iyer pulls it towards deep square leg. Two taken! 3.4 overs (0 Run) Angling in, on a length, around the leg pole. Shreyas Iyer backs away and tries to block this but he misses. The ball goes off the pads towards the keeper. 3.3 overs (1 Run) Fuller length delivery, around middle. Aaron Finch pushes it down the ground. The fielder at mid off will cut it out. Another single! 3.2 overs (1 Run) Outside off, shortish ball again. Shreyas Iyer taps it towards cover off the back foot. Single taken! 3.1 overs (0 Run) Obed McCoy begins with a shorter ball, slower in pace, around middle and leg. Shreyas Iyer looks to pull this but he fails to get any bat on it. 2.6 overs (0 Run) Very full on this occasion, outside off. Aaron Finch pushes it towards point. 2.5 overs (0 Run) Another appeal for LBW, but the umpire says no again! Full again, nipping back in, on the pads. Aaron Finch misses his flick and gets pinged on the pads. That was certainly sliding down leg. 2.4 overs (4 Runs) FOUR! Another boundary for Aaron Finch! He is finding his groove now! Boult pitches it up again, around middle. Aaron Finch smashes it past and over mid off for a boundary. 2.3 overs (0 Run) On a length, outside off. Aaron Finch taps it towards cover. 2.2 overs (4 Runs) FOUR! Nicely done this time! Another fuller delivery, swinging in again, around middle and leg. Aaron Finch flicks it past mid-wicket for a boundary. 2.1 overs (0 Run) An appeal for LBW, but the umpire says no! A fuller delivery, tailing in, on the pads. Aaron Finch looks to flick this but he misses and gets hit on the pads. That was probably sliding down leg. 1.6 overs (0 Run) Beaten! On a length, outside off. Shreyas Iyer stays in his crease and tries to cut this away but he misses. 1.5 overs (4 Runs) FOUR! Cracking shot! A shorter ball, outside off. Shreyas Iyer backs away and slashes it over point. The ball goes one bounce over the ropes for another boundary. 1.4 overs (4 Runs) EDGED AND FOUR! On a length, outside off. Shreyas Iyer leans and tries to push this away but the ball goes off the outside edge past the first slip fielder towards third man for a boundary. 1.3 overs (1 Run) Back of a length, around middle and off. Aaron Finch swivels and pulls it towards the fielder at deep square leg for a single. 1.2 overs (0 Run) Beaten! On a length, shaping away, outside off. Aaron Finch steps down the pitch and looks to push this away but he gets beaten on the outside edge. 1.1 overs (1 Run) Back of a length, around middle. Shreyas Iyer pushes it towards mid-wicket for a single. Prasidh Krishna to bowl from the other end. There a slip in place. 0.6 over (1 Run) On a length again, around middle. Shreyas Iyer taps it towards the right of the bowler and scampers through to the other end. 9 runs and a wicket off the over! 0.5 over (0 Run) On a length, outside off. Shreyas Iyer pushes it towards point off the back foot. 0.4 over (0 Run) Shorter ball, around middle. Shreyas Iyer looks to pull this but he misses. 0.3 over (4 Runs) FOUR! Back-to-back boundaries. A half-volley, on the pads. Shreyas Iyer stays back and flicks it through square leg for a boundary. 0.2 over (4 Runs) FOUR! Shreyas Iyer gets off the mark in style! On a length, outside off. Shreyas Iyer opens the face of the bat and guides it towards third man for a boundary. Shreyas Iyer walks out at number 3. 0.1 over (0 Run) OUT! RUN OUT! Wicket on the first ball! What a start for Rajasthan! A fuller ball, outside off. Aaron Finch leans forward and taps it towards cover and he scampers through to the other end. Shimron Hetmyer collects the ball and score's a direct hit at the striker's end. Sunil Narine was nowhere near. He walks back without facing a ball.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859162242199594.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, RR vs KKR Live Score Updates: Cummins & Mavi work in tandem to dismiss Parag, Rajasthan lose 4th - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiW2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLXJyLXZzLWtrci1saXZlLXNjb3JlLXVwZGF0ZXMtNzg3NDYyMS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, RR vs KKR Live Score Updates: Cummins & Mavi work in tandem to dismiss Parag, Rajasthan lose 4th  The Indian ExpressKKR STRATEGY TO BOUNCE BACK  NEWS9 liveBrendon McCullum & David Hussey talk about the 158* Knock | KKR | IPL  Kolkata Knight RidersMatch Preview - Royals vs KKR, Indian Premier League 2022, 30th Match  ESPNcricinfoRR vs KKR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-18 15:43:39","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Kolkata Knight Riders Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/rajasthan-royals-vs-kolkata-knight-riders-live-score-over-match-30-t20-16-20-updates-2898599","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Rajasthan Royals vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-18 15:33:47","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Rajasthan Royals are 217/5. The live updates of Rajasthan Royals vs Kolkata Knight Riders scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Rajasthan Royals vs Kolkata Knight Riders, Rajasthan Royals vs Kolkata Knight Riders live score, Rajasthan Royals vs Kolkata Knight Riders scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Jos Buttler continues to don the orange cap! Jos Buttler and Shimron Hetmyer continue their good work for Rajasthan. These two men always rise to the occasion for Rajasthan. We have seen it already in the matches this season. Jos Buttler and Devdutt Padikkal got off to a flyer, where the latter was the second fiddle. But it was all about Buttler. The opening pair stitched 97 runs before Padikkal holed out. Sanju Samson came in and played a cameo to keep the run rate over 10. Everything was going right, until Jos Buttler perished. Rajasthan kept losing wickets are regular intervals. It was Shimron Hetmyer that lead his side closer to the predicted total. Nonetheless, they will be happy with 217 and will hope they can defend the target, What a stunning batting performance did we just witness! The Kolkata bowlers were blown away by some brutal batting display from Rajasthan. Kolkata though picked up wickets in cluster in the death over and have managed to restrict Rajasthan at 217/5. The highest score in the Indian T20 League this season. 19.6 overs (4 Runs) FOUR! Shimron Hetmyer finishes the innings off in style! An overpitched delivery, outside off. Shimron Hetmyer drives it over the fielder at cover for a boundary. 18 runs off the over! Rajasthan end at 217 for 5! 19.5 overs (0 Run) Back of a length, around middle. Shimron Hetmyer pulls it towards deep mid-wicket. No single taken! 19.4 overs (0 Run) Slower ball, shorter, around off. Shimron Hetmyer looks to pull this away but he misses. 19.3 overs (6 Runs) SIX! Back-to-back sixes! Fuller ball again, around middle. Shimron Hetmyer clears his front leg and dispatches it over long on for another maximum. 19.2 overs (6 Runs) SIX! KABOOM! A friendly full toss, outside off. Shimron Hetmyer pulls it over deep mid-wicket for a biggie! 19.2 overs (1 Run) Wide! Pitches it up, wide of off. Shimron Hetmyer leaves it alone. Wide called! 19.1 overs (1 Run) Length ball, slower in pace, around middle and leg. Ravichandran Ashwin tucks it towards mid-wicket for a single. 18.6 overs (1 Run) Short ball, outside off. Ravichandran Ashwin pushes it to cover-point for a single. Ravichandran Ashwin comes to the bat now. 18.5 overs (0 Run) OUT! CAUGHT! Another man bites the dust! Full length, on the pads. Karun Nair flicks it aerially towards deep mid-wicket. Karun Nair does not connect well and fails to get the desired distance on it. Pat Cummins takes a solid catch in the deep to send back Nair on a low score. 18.4 overs (1 Run) Shimron Hetmyer works it to mid on for a single. 18.3 overs (2 Runs) Touch short, on off. Shimron Hetmyer pulls it to deep mid-wicket for two runs. 18.2 overs (0 Run) A bouncer now, on off. Shimron Hetmyer tries to heave it across the line but misses. 18.1 overs (1 Run) Slower one, full and outside off. Nair eases it to long off for a single. 17.6 overs (0 Run) Kolkata take a review but Shimron Hetmyer survives! Looped up, full and outside off. It grips and turns away sharply. Shimron Hetmyer tries to defend it out on the front foot but fails to do so. The ball zips past the outside edge. Sunil Narine appeals but the umpire is unmoved. They take a review but the UltraEdge confirms no bat is involved. 17.6 overs (1 Run) WIDE! Full and outside the tramline. Shimron Hetmyer tries to reach out but misses. Wide called. 17.5 overs (1 Run) Fuller, on off. Nair sweeps it to deep square leg for one. 17.4 overs (0 Run) Looped up, down leg. Karun Nair does not connect his shot. The ball goes to the keeper off his pads. 17.3 overs (1 Run) Length, on the pads. Shimron Hetmyer flicks it to mid-wicket for a single. 17.3 overs (1 Run) WIDE! Full, wide outside off. Shimron Hetmyer tries to chase it but misses. Wide called. 17.2 overs (1 Run) On off, Nair works it to long off for a single. Karun Nair walks out to bat. 17.1 overs (0 Run) OUT! CAUGHT! Pat Cummins and Shivam Mavi work in tandem in the deep to get rid of Parag on a timid score. This is exceptional effort by Pat Cummins, he does all the hard work and Mavi smartly stays close by to help his teammate out. Full length, on off. Riyan Parag lofts it down the ground towards long on. Pat Cummins runs to his right and gathers the ball. He realises the momentum is taking him across the line, he uses Shivam Mavi really well by throwing the ball towards him and Mavi completes the catch. 16.6 overs (1 Run) Full length, on off. Parag eases it to mid on for a single. 15 runs come off the over with a wicket. 16.5 overs (4 Runs) FOUR! Deft touch! Riyan Parag gets off the mark with a boundary. A length ball, angled down leg. Riyan Parag flicks it to fine leg for a boundary. 16.5 overs (1 Run) WIDE! A bouncer now, down leg. Riyan Parag tries to chase it but misses. The umpire signals a wide. Riyan Parag comes to the crease. 16.4 overs (0 Run) OUT! CAUGHT! Pat Cummins has the last laugh but that does not wipe out the smile off Jos Buttler's face as he walks back with a ton. A short ball, on middle and leg. Jos Buttler looks to hook it away. The ball goes to fine leg off the top-edge. Varun Chakaravarthy settles under it and takes a sharp catch. Can Kolkata put a lid over the run rate in the death overs? 16.3 overs (1 Run) Full-length ball,outside off. Shimron Hetmyer drives it to cover for a single. 16.2 overs (1 Run) A short ball, on off. Jos Buttler pulls it through mid-wicket for a single. 16.1 overs (6 Runs) SIX! BANG! Jos Buttler gets his second ton of this season. This is incredible batting. He removes his helmet and gets soaked in applauses from the crowd and his teammates. A low full toss, on off. Jos Buttler smokes it over the long on fence for a maximum. 16.1 overs (1 Run) WIDE! Very full, down leg. Jos Buttler swings but misses. The umpire signals but misses. Pat Cummins (3-0-35-0) comes to bowl his final over. 15.6 overs (4 Runs) FOUR! Shimron Hetmyer gets his first boundary of the innings. Full length, wide outside off. Shimron Hetmyer leans and slashes it through backward point for a boundary. 15.5 overs (1 Run) Length ball, on the pads. Jos Buttler flicks it to square leg for a single. 15.4 overs (4 Runs) FOUR! Cracked! Short ball, on off. Jos Buttler stands tall and pulls it through mid-wicket for a boundary. 15.3 overs (1 Run) Length ball, on off. Shimron Hetmyer eases it to the leg side for a single. Strategic break! Rajasthan still cruising along at the moment. Kolkata can breathe a sigh of relief after getting the wicket of Sanju Samson. But they need the wicket of Jos Buttler who is still batting at 91 for now. Rajasthan will aim to get over 200 runs from here provided they continue the same kind of batting. Also, Shimron Hetmyer comes to the crease now. 15.2 overs (0 Run) OUT! CAUGHT! Sanju Samson's cameo comes to an end. He heads back on 38 off 19 balls. Andre Russell provides a breakthrough in his very first over. He has an instant impact in this game. A length ball, on middle and leg. Sanju Samson flicks it aerially towards deep mid-wicket. He does not get enough distance on it. Shivam Mavi settles under it in the deep and takes a sharp catch. 15.1 overs (1 Run) Length ball, on the pads, Jos Buttler flicks it to square leg for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859126197182588.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Kolkata Knight Riders Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/rajasthan-royals-vs-kolkata-knight-riders-live-score-over-match-30-t20-11-15-updates-2898502","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Rajasthan Royals vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-18 15:14:04","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.2 overs, Rajasthan Royals are 164/2. The live updates of Rajasthan Royals vs Kolkata Knight Riders scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Rajasthan Royals vs Kolkata Knight Riders, Rajasthan Royals vs Kolkata Knight Riders live score, Rajasthan Royals vs Kolkata Knight Riders scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (6 Runs) SIX! HAMMERED! Very full again, around off. Sanju Samson dispatches this one over long off for a maximum. 14.5 overs (2 Runs) Another full toss, around middle. Sanju Samson looks to pull this away but he gets a top edge over Andre Russell at mid-wicket. Two taken! 14.4 overs (4 Runs) FOUR! Top shot! A low full toss, outside off. Sanju Samson drives it over cover for a boundary. 14.3 overs (1 Run) Slower ball, full, outside off. Jos Buttler knocks it down to long off. Single taken! 14.2 overs (1 Run) Yorker-length delivery, around off. Sanju Samson pushes it with the inner half of his bat towards long on for a single. 14.1 overs (1 Run) Very full, wide of off. Jos Buttler slices it towards deep cover for a single. 13.6 overs (0 Run) Spinning in, around middle and leg, short in length. Sanju Samson looks to pull this away but he manages to get an under edge back onto his pads. 13.6 overs (1 Run) Wide! Short ball, down the leg side. Sanju Samson leaves it alone. Wide called! 13.5 overs (2 Runs) Shorter ball again, around middle and leg. Sanju Samson works it away towards deep mid-wicket. A couple of runs taken once again. 13.4 overs (2 Runs) Back of a length, around middle. Sanju Samson flicks it towards deep square leg for a couple of runs. 13.3 overs (3 Runs) Fullish ball, outside off. Jos Buttler leans to drive but the ball goes off the outside edge towards third man. Andre Russell runs to his left, dives, and makes a good stop. Three taken! 13.2 overs (1 Run) Tad shorter, outside off. Sanju Samson lifts it over cover. Just a single taken! 13.1 overs (6 Runs) SIX! BOOM! Fuller ball, around middle. Sanju Samson shimmies down the pitch and smashes it over long off for a biggie. 12.6 overs (4 Runs) FOUR! Perfect placement! Not a bad ball at all! A wide yorker this. Jos Buttler steers it past backward point for a boundary. 12.5 overs (1 Run) Length delivery, around middle and leg. Sanju Samson flicks it towards mid-wicket. Single taken! 12.4 overs (1 Run) Slower, shorter, around middle. Jos Buttler pulls it towards deep mid-wicket. Andre Russell does well to stop the ball with this right hand. Only a single. 12.3 overs (4 Runs) FOUR! A kind of a gift to Jos Buttler here! On a length, and on the pads. Jos Buttler heaves it towards deep square leg for a boundary. 12.2 overs (2 Runs) Outside off, on a length. Jos Buttler slashes it towards deep cover for a brace. 12.1 overs (1 Run) In the air...but safe! A length ball, darting it on the pads. Sanju Samson looks to flick this away on the leg side, but he gets a leading edge over the bowler's head. Single taken! 11.6 overs (1 Run) Back of a length, outside off. Sanju Samson taps it towards short third man off the back foot for a single. 11.5 overs (4 Runs) FOUR LEG BYES! An off-break this time, down leg. Sanju Samson looks to reverse-sweep this but he misses. The ball brushes off his pads and goes towards fine leg for a boundary. 11.4 overs (2 Runs) Spinning away, outside off, shortish ball. Sanju Samson pushes it towards sweeper cover for a brace. 11.3 overs (0 Run) Fuller ball, slower through the air, outside off. Sanju Samson presses forward and defends it towards cover. 11.2 overs (1 Run) Tosses it up, full, on the pads. Jos Buttler works it away towards square leg for a single. 11.1 overs (0 Run) Outside off, tad shorter. Jos Buttler stays back and looks to cut this away, but he misses. 10.6 overs (4 Runs) FOUR! Up and over! Another full-length delivery, outside off. Sanju Samson drives it uppishly over cover for a cracking boundary. 10.5 overs (4 Runs) FOUR! Nicely done! Pitches it up, outside off. Sanju Samson drives it past the fielder at mid off for a boundary. 10.4 overs (1 Run) Length delivery, outside off. Jos Buttler taps it towards cover and tasks a quick single. 10.3 overs (0 Run) Good change of pace! Fuller delivery again, outside off. Jos Buttler wait for it and looks to drive this but he gets beaten due to lack of pace. 10.2 overs (2 Runs) On a length, outside off. Jos Buttler pushes it past the diving fielder at cover for a brace. 10.1 overs (2 Runs) Fuller delivery, outside off. Jos Buttler drives it towards sweeper cover. Two taken!","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859114360866183.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, RR vs KKR LIVE Updates: Sanju Samson Departs, Jos Buttler Keeps Rajasthan Royals On Top - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1yci12cy1ra3ItbGl2ZS1jcmlja2V0LXNjb3JlLXJhamFzdGhhbi1yb3lhbHMtdnMta29sa2F0YS1rbmlnaHQtcmlkZXJzLWxpdmUtc2NvcmVib2FyZC1hbmQtdXBkYXRlcy0yODk3OTY30gGgAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2xpdmUtaXBsLXNjb3JlLXJyLXZzLWtrci1saXZlLWNyaWNrZXQtc2NvcmUtcmFqYXN0aGFuLXJveWFscy12cy1rb2xrYXRhLWtuaWdodC1yaWRlcnMtbGl2ZS1zY29yZWJvYXJkLWFuZC11cGRhdGVzLTI4OTc5NjcvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, RR vs KKR LIVE Updates: Sanju Samson Departs, Jos Buttler Keeps Rajasthan Royals On Top  NDTV SportsKKR STRATEGY TO BOUNCE BACK  NEWS9 liveMatch Preview - Royals vs KKR, Indian Premier League 2022, 30th Match  ESPNcricinfoBrendon McCullum & David Hussey talk about the 158* Knock | KKR | IPL  Kolkata Knight RidersRR vs KKR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-18 15:09:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Kolkata Knight Riders: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/rajasthan-royals-vs-kolkata-knight-riders-live-score-over-match-30-t20-6-10-updates-2898402","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Rajasthan Royals vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-18 14:35:57","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Rajasthan Royals are 101/1. The live updates of Rajasthan Royals vs Kolkata Knight Riders scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Rajasthan Royals vs Kolkata Knight Riders, Rajasthan Royals vs Kolkata Knight Riders live score, Rajasthan Royals vs Kolkata Knight Riders scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (1 Run) 1 run. 9.5 overs (1 Run) Short ball, on off. Sanju Samson punches it to deep point for a single. Sanju Samson, the skipper of Rajasthan comes to the crease. 9.4 overs (0 Run) OUT! TIMBER! Devdutt Padikkal tries to hunt for another biggie but holes out instead. Sunil Narine draws the first blood. This should ease the pressure of the Kolkata players. It is looped up, and on the stumps. Devdutt Padikkal stays back and tries to heave it down the ground but ends up being a bit early into his shot. He ends up missing it completely and the ball goes through to rattle the stumps. 9.3 overs (0 Run) Short ball, outside off. Devdutt Padikkal guides it through backward point. 9.2 overs (6 Runs) SIX! Devdutt Padikkal joining the party now. Full length, on off. Devdutt Padikkal gets low and slog-sweeps it over the mid-wicket fence for a maximum. 9.1 overs (1 Run) Full, on the pads, Jos Buttler tucks it to mid-wicket for one. 8.6 overs (0 Run) Short ball, around the hips. Devdutt Padikkal clips it to mid-wicket. 8.5 overs (1 Run) Very full, wide outside off. Jos Buttler squeezes it to point for a single. 8.4 overs (2 Runs) A bounder now, outside off. Jos Buttler upper cuts it to deep point for a brace. 8.3 overs (6 Runs) SIX! High and handsome! Full length, on middle and leg. Jos Buttler clears his front leg and tonks it over the long on fence for a maximum. 8.2 overs (0 Run) Length ball, on off. Jos Buttler gets it to mid-wicket off the inner half. 8.1 overs (4 Runs) FOUR! This will hurt Kolkata. Good length, outside off. Jos Buttler stands tall and cuts it through covers for a boundary. Umesh Yadav (2-0-16-0) comes back to bowl. 7.6 overs (1 Run) A brilliant over by Sunil Narine comes to an end. Just three runs off it. On leg, Buttler flicks it to the leg side for one. 7.5 overs (0 Run) Outside off, Jos Buttler guides it to short third man. 7.4 overs (0 Run) Floated and full, down leg. Jos Buttler tries to reverse-hit it but misses. 7.3 overs (0 Run) A dot now! Fuller, outside off. Jos Buttler defends it to cover. 7.2 overs (1 Run) Flatter, on the pads. Devdutt Padikkal tucks it to square leg for one. 7.1 overs (1 Run) Full, on leg. Jos Buttler flicks it to mid-wicket for one. Sunil Narine comes into the attack. 6.6 overs (1 Run) Short, outside off. Jos Buttler cuts it to deep point for a single. 6.5 overs (4 Runs) FOUR! TOP SHOT! Jos Buttler scores his 14th half-century in the Indian T20 League. Full-length ball, outside off. Jos Buttler drives it on the up, down the ground and past the bowler. It races away for four. 6.4 overs (0 Run) Full length, on the stumps. Jos Buttler blocks it back to the bowler. 6.3 overs (1 Run) Fuller, on the pads. Devdutt Padikkal flicks it to mid-wicket for a single. 9 runs off the first three balls. Can Jos Buttler go bonkers in the last three balls of this over? 6.2 overs (4 Runs) FOUR! This is much better by Devdutt Padikkal. Full length, on off. Devdutt Padikkal drives it uppishly through covers for a boundary. 6.1 overs (4 Runs) FOUR! EDGY! Back of a length, outside off, shaping away a tad. Devdutt Padikkal throws his blade at it. The ball flies off the outside edge and races away towards the ropes at third man. Strategic break! It's all Rajasthan at the moment! Mainly, Jos Buttler! He has raced away to 46 runs in just 27 deliveries and is 4 runs away from yet another half-century. Kolkata will need some plan to stop this carnage by Buttler. 5.6 overs (0 Run) Full length, on middle and leg. Jos Buttler blocks it back to the bowler. Rajasthan are 60/0 at the end of Powerplay. Shivam Mavi goes for 11 runs in his second over of the innings. 5.5 overs (6 Runs) SIX! All the way! This one lands straight on the advertising cushion. Tremendous shot. Full length, on fourth stump. Jos Buttler swings hard at it and lofts it over covers for a maximum. 5.4 overs (4 Runs) FOUR! Clobbered! Back of a length, on off. Jos Buttler stands on the back foot and pulls it through the gap at mid-wicket for a boundary. 5.3 overs (0 Run) Full length and wide outside off. Jos Buttler tries to reach out but fails to connect. 5.2 overs (1 Run) LEG BYE! 50 up for Rajasthan. A length ball, on the pads. Devdutt Padikkal fails to pick it up. The ball goes to square leg off the thigh pads. The batters cross for a leg bye. 5.1 overs (0 Run) A length ball, on off. Devdutt Padikkal taps it to mid on. Jos Buttler ventures out looking for a single but Devdutt Padikkal sends him back wisely.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859091489657076.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Karun Nair stats IPL: Why is Kuldeep Sen not playing today’s IPL 2022 match between Rajasthan Royals and Kolkata Knight Riders?","link":"https://thesportsrush.com/cricket-news-karun-nair-stats-ipl-why-is-kuldeep-sen-not-playing-todays-ipl-2022-match-between-rajasthan-royals-and-kolkata-knight-riders/","keywords":["Cricket","IPL 2022","KKR","Rajasthan Royals","Indian Premier League","Kolkata Knight riders","rajasthan royals","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Kuldeep Sen not playing today: Rajasthan Royals have made three changes to their Playing XI for this match. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Kolkata Knight Riders captain Shreyas Iyer has won the toss and… The post Karun Nair stats IPL: Why is Kuldeep Sen not playing today’s IPL 2022 match between Rajasthan Royals and Kolkata Knight Riders? appeared first on The SportsRush.","content":"Why Kuldeep Sen not playing today: Rajasthan Royals have made three changes to their Playing XI for this match. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Kolkata Knight Riders captain Shreyas Iyer has won the toss and chose to bowl. “We’ll bowl first. The wicket looks amazing and hard. One side seems short and one is long, so that’s another reason why we want to chase. We just practice a lot in the nets, we’ve seen the videos and have had chats in the meetings,” Iyer told Star Sports at the toss. Coming on the back of two consecutive losses, Knight Riders have opted to make a change to their Playing XI. Fast bowler Shivam Mavi has come in for all-rounder Aman Khan to bolster their bowling unit. The Man. The Myth. The Legend. #SunilNarine #KKRHaiTaiyaar #RRvKKR #IPL2022 pic.twitter.com/vgWTW9k8AA — KolkataKnightRiders (@KKRiders) April 18, 2022 “We’ve got one change – Shivam Mavi comes in for Aman Khan. They [overseas stars] have been excellent for KKR in recent years. It’s gonna be important for us that they perform but also the domestic players need to step up,” Iyer added. Why is Kuldeep Sen not playing vs KKR today? Much like Iyer, Rajasthan Royals captain Sanju Samson also wanted to bowl first at the Cricket Club of India tonight. With all their three victories coming batting first, Royals shouldn’t mind setting a total against the Knights. “We would have also liked to bowl first but need to be ready to do both. Our team is well set to do both. New venue for us and we need to understand conditions quickly. Everyone has to contribute to whatever is the team’s requirement, the talk is always about understanding the situation and being smarter,” Samson told Star Sports at the toss. Royals have made three changes to their Playing XI. With fast bowler Trent Boult recovering from an injury, he replaces James Neesham in an obvious change for this match. Having scored 10 runs in his first two IPL innings, Rassie van der Dussen has been benched for Karun Nair. To maintain the Indian-overseas player balance, Rajasthan have handed a debut to West Indies fast bowler Obed McCoy for Kuldeep Sen. In two matches, Sen had picked as many wickets at an economy and strike rate of 10.75 and 24 respectively. Despite bowling a match-winning final over against Lucknow Super Giants, Sen is a tad bit unlucky to sit out tonight. Nair, who has scored 1,480 runs in 66 innings at a strike rate of 128.36 across eight seasons, has returned to the IPL after missing the last season. First IPL 2022 match for Nair has kick-started his second stint at RR. Readers must note that Nair had represented the franchise in 2014-2015 as well scoring 511 runs at an average and strike rate of 24.33 and 135.54 respectively. The post Karun Nair stats IPL: Why is Kuldeep Sen not playing today’s IPL 2022 match between Rajasthan Royals and Kolkata Knight Riders? appeared first on The SportsRush.","pubDate":"2022-04-18 14:00:27","full_description":"Why Kuldeep Sen not playing today: Rajasthan Royals have made three changes to their Playing XI for this match. During the 30th match of the ongoing 15th season of the Indian Premier League between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium, Kolkata Knight Riders captain Shreyas Iyer has won the toss and chose to bowl. “We’ll bowl first. The wicket looks amazing and hard. One side seems short and one is long, so that’s another reason why we want to chase. We just practice a lot in the nets, we’ve seen the videos and have had chats in the meetings,” Iyer told Star Sports at the toss. Coming on the back of two consecutive losses, Knight Riders have opted to make a change to their Playing XI. Fast bowler Shivam Mavi has come in for all-rounder Aman Khan to bolster their bowling unit. The Man. The Myth. The Legend. 🙌 #SunilNarine #KKRHaiTaiyaar #RRvKKR #IPL2022 pic.twitter.com/vgWTW9k8AA — KolkataKnightRiders (@KKRiders) April 18, 2022 “We’ve got one change – Shivam Mavi comes in for Aman Khan. They [overseas stars] have been excellent for KKR in recent years. It’s gonna be important for us that they perform but also the domestic players need to step up,” Iyer added. Much like Iyer, Rajasthan Royals captain Sanju Samson also wanted to bowl first at the Cricket Club of India tonight. With all their three victories coming batting first, Royals shouldn’t mind setting a total against the Knights. “We would have also liked to bowl first but need to be ready to do both. Our team is well set to do both. New venue for us and we need to understand conditions quickly. Everyone has to contribute to whatever is the team’s requirement, the talk is always about understanding the situation and being smarter,” Samson told Star Sports at the toss. Royals have made three changes to their Playing XI. With fast bowler Trent Boult recovering from an injury , he replaces James Neesham in an obvious change for this match. Having scored 10 runs in his first two IPL innings, Rassie van der Dussen has been benched for Karun Nair. To maintain the Indian-overseas player balance, Rajasthan have handed a debut to West Indies fast bowler Obed McCoy for Kuldeep Sen. In two matches, Sen had picked as many wickets at an economy and strike rate of 10.75 and 24 respectively. Despite bowling a match-winning final over against Lucknow Super Giants, Sen is a tad bit unlucky to sit out tonight. Nair, who has scored 1,480 runs in 66 innings at a strike rate of 128.36 across eight seasons, has returned to the IPL after missing the last season. First IPL 2022 match for Nair has kick-started his second stint at RR. Readers must note that Nair had represented the franchise in 2014-2015 as well scoring 511 runs at an average and strike rate of 24.33 and 135.54 respectively.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals vs Kolkata Knight Riders: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/rajasthan-royals-vs-kolkata-knight-riders-live-score-over-match-30-t20-1-5-updates-2898182","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Rajasthan Royals vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-18 13:56:04","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 0.4 overs, Rajasthan Royals are 0/0. The live updates of Rajasthan Royals vs Kolkata Knight Riders scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Rajasthan Royals vs Kolkata Knight Riders, Rajasthan Royals vs Kolkata Knight Riders live score, Rajasthan Royals vs Kolkata Knight Riders scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 0.3 over (0 Run) No run. 0.2 over (0 Run) Good-length delivery, outside off. Jos Buttler looks to push this away on the off side but he gets an inside edge just towards the leg side. 0.1 over (0 Run) Umesh Yadav begins with a length ball, around off. Jos Buttler defends it out off the back foot towards point. The game is set to begin. The two umpires step out on the field. Kolkata players stride out to the middle as well and take their respective fielding positions. Followed by Jos Buttler and Devdutt Padikkal who walk out to open for Rajasthan. Umesh Yadav to start with the new ball. Pat Cummins is down for a chat. He says they do not look too far back, they have had good games previously and they need to have one today as well. Mentions that there was a lot of dew in the previous game and the team batting second does hold a slight advantage. Adds that there is no added pressure when you go out and bat and his main job is that of a fast bowler. Sanju Samson, the captain of Rajasthan is in for a chat. He says, they would've loved to bowl first as well but they try to set up a target after assessing the pitch initially. Mentions, every player needs to perform whenever the team requires. Says, failures are accepted as well with keeping in mind the players learn off it. Says they have three changes, Trent Boult comes into the side, Obed McCoy to make his Indian T20 League debut and Karun Nair makes his way into the side. Shreyas Iyer, the skipper of Kolkata says that they will bowl first, the wicket is quite hard and the boundary on one side is long while the other side is short so they are looking to chase. Mentions that they really need to set a good combination and execute the plans that they have discussed in the team meetings. Informs that they have one change, Mavi comes in for Aman. Further adds that the overseas players have been in good form and it is important for the team if they perform, even the domestic players have been performing well. Rajasthan Royals (Playing XI) - Jos Buttler, Devdutt Padikkal, Sanju Samson(C/ WK), Karun Nair (In for Rassie van der Dussen), Shimron Hetmyer, Riyan Parag, Ravichandran Ashwin, Trent Boult (In for James Neesham), Prasidh Krishna, Yuzvendra Chahal, Obed McCoy (In for Kuldeep Sen). Kolkata (Playing XI) - Aaron Finch, Venkatesh Iyer, Shreyas Iyer (C), Sheldon Jackson (WK), Nitish Rana, Andre Russell, Pat Cummins, Sunil Narine, Shivam Mavi (In for Aman Khan), Varun Chakaravarthy, Umesh Yadav. TOSS - The coin goes up and lands in favour of Kolkata. They have opted to BOWL first. PITCH REPORT - Matthew Hayden is down near the pitch. He says that the wicket is a beauty, with a lot of grass on it, a bit hard as well, and we can expect another high-scoring game. Adds that on one square the boundary is long and while on the other square it is short. It is a batting paradise! Sunil Narine receives his 150th cap and a special jersey from Brendon McCullum. He is all set to play his 150th match for Kolkata. Kolkata have only won two games out of their last five matches and will hope to regain their momentum. The spin-twins of Rajasthan have been in top form and have managed to strangle the opposition in the middle-overs. This time though the task won't be easy against a side filled with power-hitters. Which team will extend their gap with 2 points? We shall find out soon, as the toss is not far away. Hello and a warm welcome to all! It is now time for game number 30 which sees a contest between Rajasthan and Kolkata. Both teams are sailing on the same boat at this point, with 6 points each and both looking to get back to winning ways after suffering a defeat in their previous fixture. This game should be no less than a cracker. ... MATCH DAY ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859067554065350.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Hopefully, I start and finish here”: Sunil Narine wishes to play for KKR throughout IPL career ahead of 150th match","link":"https://thesportsrush.com/cricket-news-hopefully-i-start-and-finish-here-sunil-narine-wishes-to-play-for-kkr-throughout-ipl-career-ahead-of-150th-match/","keywords":["Cricket","IPL 2022","KKR","Sunil Narine"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Sunil Narine has completed his 10 years with the IPL side Kolkata Knight Riders, and he wishes to end his career with the club. Sunil Narine made his IPL debut with Kolkata Knight Riders in 2012, and he is still with the team in 2022. Narine has been one of the most prolific spinners in… The post “Hopefully, I start and finish here”: Sunil Narine wishes to play for KKR throughout IPL career ahead of 150th match appeared first on The SportsRush.","content":"Sunil Narine has completed his 10 years with the IPL side Kolkata Knight Riders, and he wishes to end his career with the club. Sunil Narine made his IPL debut with Kolkata Knight Riders in 2012, and he is still with the team in 2022. Narine has been one of the most prolific spinners in the history of the IPL 2022. After his action remold, Narine has certainly some of his charm, but he is still counted as one of the best IPL spinners. Narine has scalped 147 IPL wickets in 140 games at a staggering economy of 6.67. He is at the 8th position in the overall IPL highest wicket-takers. Sunil Narine expresses desire to end his career at KKR Kolkata Knight Riders released an interview of spinner Sunil Narine on the occasion of completing 10 years with the club. It is quite a rare occasion for any player considering the number of auctions in between. Narine said that he has told Venky Mysore that he wants to end his career with the KKR. “I have always told Venky [Mysore, CEO] that hopefully I don’t play for any other franchise,” Sunil Narine said. “I have loved my stay at KKR so hopefully I start and finish here, and I think it’s a great achievement.” Mamba King all set for his 1⃣5⃣0⃣th T20 match for KKR tonight! Sunil Narine – a small boy from Trinidad to a legend of cricket’s shortest format #SunilNarine • #KnightsTV presented by @glancescreen | #KKRHaiTaiyaar #IPL2022 pic.twitter.com/S68ZUIFJem — KolkataKnightRiders (@KKRiders) April 18, 2022 Despite Narine’s rough patch, Kolkata Knight Riders’ have always trusted in Sunil Narine. Narine managed to scalp just five wickets in ten games of IPL 2020. Ahead of the IPL 2022 auction, KKR again retained Sunil Narine. Sunil Narine agreed that he was not that comfortable bowling after his reaction remold. He said that he knew that he will need to work hard on his bowling to still stay relevant in the game. “I think you can never be too comfortable,” Sunil Narine said about action change. “It was all on me to keep training and working on my game to try to stay relevant to the game and try to get back where I was when I started.” The post “Hopefully, I start and finish here”: Sunil Narine wishes to play for KKR throughout IPL career ahead of 150th match appeared first on The SportsRush.","pubDate":"2022-04-18 13:06:47","full_description":"Sunil Narine has completed his 10 years with the IPL side Kolkata Knight Riders, and he wishes to end his career with the club. Sunil Narine made his IPL debut with Kolkata Knight Riders in 2012, and he is still with the team in 2022. Narine has been one of the most prolific spinners in the history of the IPL 2022. After his action remold, Narine has certainly some of his charm, but he is still counted as one of the best IPL spinners. Narine has scalped 147 IPL wickets in 140 games at a staggering economy of 6.67. He is at the 8th position in the overall IPL highest wicket-takers. Kolkata Knight Riders released an interview of spinner Sunil Narine on the occasion of completing 10 years with the club. It is quite a rare occasion for any player considering the number of auctions in between. Narine said that he has told Venky Mysore that he wants to end his career with the KKR. “I have always told Venky [Mysore, CEO] that hopefully I don’t play for any other franchise,” Sunil Narine said. “I have loved my stay at KKR so hopefully I start and finish here, and I think it’s a great achievement.” Mamba King all set for his 1️⃣5️⃣0️⃣th T20 match for KKR tonight! Sunil Narine – a small boy from Trinidad to a legend of cricket’s shortest format 🇹🇹✈️🌏 #SunilNarine • #KnightsTV presented by @glancescreen | #KKRHaiTaiyaar #IPL2022 pic.twitter.com/S68ZUIFJem — KolkataKnightRiders (@KKRiders) April 18, 2022 Despite Narine’s rough patch, Kolkata Knight Riders’ have always trusted in Sunil Narine. Narine managed to scalp just five wickets in ten games of IPL 2020. Ahead of the IPL 2022 auction, KKR again retained Sunil Narine. Sunil Narine agreed that he was not that comfortable bowling after his reaction remold. He said that he knew that he will need to work hard on his bowling to still stay relevant in the game. “I think you can never be too comfortable,” Sunil Narine said about action change. “It was all on me to keep training and working on my game to try to stay relevant to the game and try to get back where I was when I started.”","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"In numbers: Virat Kohli remains the best Indian batter overall, but the wait for big scores continues","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/in-numbers-virat-kohli-remains-the-best-indian-batter-overall-but-the-wait-for-big-scores-continues/articleshow/90913633.cms","keywords":null,"creator":null,"video_url":null,"description":"He hasn't scored a hundred in more than two years, his overall scoring form has dropped, and despite all his efforts he continues to struggle to get big scores. Despite all these, modern day batting great, Virat Kohli remained the best batter for India even in the last couple of years. What is interesting though is the fact that since his last hundred, Kohli is still the highest run-getter for India in international cricket with 2478 overall runs.","content":null,"pubDate":"2022-04-18 11:54:44","full_description":"NEW DELHI: He hasn't scored a hundred in more than two years, his overall scoring form has dropped, and despite all his efforts he continues to struggle to get big scores. Despite all these, modern day batting great, Virat Kohli remained the best batter for India even in the last couple of years. The description - 'the only batter with 50-plus average in all three formats' - doesn’t hold true anymore for the former India captain, as Kohli’s Test average has gone down below 50 after a long time (49.95 to be precise). Despite the dip, experts and fans admit that he hasn't really lost form, is hitting the ball well and timing his shots perfectly, but somehow the big scores continue to elude a batter who at one time was the most prolific batter in international cricket. What is interesting though is the fact that since his last hundred (across international cricket and the IPL on November 23, 2019), Kohli is still the highest run-getter for India in international cricket with 2478 overall runs at an average of 37.54 in 73 international innings. Overall he is fourth on the list of highest run getters during that period, which is led by Pakistan's Babar Azam (3694 runs @55.96 in 74 innings with 10 hundreds). Top 5 international run-getters since Kohli's last hundred on November 23, 2019: Player Match Innings Runs HS Ave. 100s 50s Babar Azam 68 74 3694 196 55.96 10 27 Joe Root 39 62 3086 228 54.14 9 10 Mohd Rizwan 72 72 2641 115* 47.16 3 20 Virat Kohli 63 73 2478 94* 37.54 0 24 Rohit Sharma 49 60 2367 161 41.52 4 14 Kohli's last century (70th international ton) across both international and IPL cricket was scored in November 2019, that's almost two and half years ago. Since then, Kohli has played a combined 73 innings in Tests, ODIs and T20Is without hitting a century. He came very close to ending that wait, when he scored 94* vs the West Indies in a T20I on December 6, 2019. That remains his best T20I score. Before his last century (in November, 2019), he had 70 tons in 438 international innings, which is equivalent to scoring one hundred every 6.3 games. Now, that stat currently reads - one hundred in every 7.3 games - a substantial dip in a long career. The last of his five IPL hundreds was scored in April 2019, so no century for Kohli in the last two seasons plus in the ongoing 15th edition of the league so far. Nothing seems to be working for Kohli, who even relinquished captaincy to focus on his batting. Kohli's decision to leave captaincy was welcomed by many citing his dip in batting performances – but has that resulted in him getting big scores? Let's take a look: Kohli's international career after relinquishing captaincy Tests: Kohli gave up captaincy of the longest format of the game after the Indian team lost 1-2 to South Africa in January this year. Since then, he has played two Tests - and in the three innings he has played since then, he has scored 81 runs @27.00 average, with a highest score of 45 off 76 against Sri Lanka in Mohali. ODIs: Kohli was replaced as ODI captain by Rohit Sharma in December 2021. Since then he has played six ODIs, three each against South Africa and West Indies, and scored 142 runs at 23.67 average. He has hit two fifties in it with the highest score of 65 off 84 balls vs SA in Cape Town. And he also got out for a duck in two matches. T20Is: Kohli had announced in September 2021 that he will be giving up T20I captaincy after the T20 World Cup in November last year. Since then he has played two T20Is against West Indies, and scored a total of 69 runs with one half-century -- 52 off 41 in Kolkata. Verdict: He has played 11 international innings without the burden of captaincy on him so far, and his highest score was 65 vs SA in Cape Town. The sample size is too small to predict his form after giving up captaincy, but whatever little cricket he has played just as a batter, in that the problem of not getting big scores remains intact. Virat Kohli after leaving captaincy (international cricket): Match Innings Runs HS Ave. 100s 50s 10 11 292 65 26.54 0 3 How has Kohli as a batter fared in IPL 2022 so far? Kohli is playing just as a senior batter in Royal Challengers Bangalore squad this season under the leadership of South African Faf du Plessis. The team is doing well so far and are third in the standings with 8 points from 6 games (till before the KKR vs RR match on April 18, Monday). But the bat of Kohli, the highest run-scorer in the history of the IPL and the only batter with 6000 plus runs in it, is still waiting for a match-defining big knock. He started the 2022 campaign with a good outing with the bat, scoring an unbeaten 41 off 29 balls to help RCB post a massive 205/2. But they ended up losing the game to Punjab Kings by 5 wickets. A string of low scores followed - 12 vs Kolkata Knight Riders, 5 vs Rajasthan Royals, before he looked good with the bat again and contributed 48 off 36 in a successful chase against Mumbai Indians. And that is still Kohli's best knock so far in the season, as two other small scores followed after that - 1 vs Chennai Super Kings & 12 vs Delhi Capitals. So 'not captain' Kohli is still struggling to come up with big scores this season. Virat Kohli’s IPL 2022 season so far: Match Innings Runs HS Ave. SR 100s 50s 6 6 119 48 23.80 125.26 0 0 Anyone who watches Virat bat these days can tell that the confidence is still very much there. The ball is still finding the middle of the bat and his match awareness is as sharp as ever. For the sake of Indian cricket and also to help RCB in their quest for their maiden IPL title, the fans will be hoping that it's just a matter of time before he registers his next mammoth score. And that might just open the floodgate of runs for this modern day great, who is itching to strike his next purple patch.","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"RR vs KKR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L3JyLXZzLWtrci1kcmVhbTExLXByZWRpY3Rpb24tZmFudGFzeS1jcmlja2V0LXRpcHMtZHJlYW0xMS10ZWFtLXBsYXlpbmcteGktcGl0Y2gtcmVwb3J0LWluanVyeS11cGRhdGUtdGF0YS1pcGwtMjAyMi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"RR vs KKR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorKKR STRATEGY TO BOUNCE BACK  NEWS9 liveMatch Preview - Royals vs KKR, Indian Premier League 2022, 30th Match  ESPNcricinfoRajasthan Royals vs Kolkata Knight Riders Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorRajasthan Royals vs Kolkata Knight Riders Predictions, Betting Tips & Odds │18 APRIL, 2022  Telecom AsiaView Full coverage on Google News","content":null,"pubDate":"2022-04-18 11:45:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capital's Match vs Punjab Kings On As Mitchell Marsh Tests Negative: Report | Cricket News - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2RlbGhpLWNhcGl0YWxzLW1hdGNoLXZzLXB1bmphYi1raW5ncy1vbi1hcy1taXRjaGVsbC1tYXJzaC10ZXN0cy1uZWdhdGl2ZS1yZXBvcnQtMjg5Njc4NdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Delhi Capital's Match vs Punjab Kings On As Mitchell Marsh Tests Negative: Report | Cricket News  NDTV SportsDelhi Capitals under quarantine after Covid scare IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzTwo more Covid-positive cases in Delhi Capitals camp  ESPNcricinfoCovid-19 scare in IPL camp: Entire team of Delhi quarantined  The Economic TimesReports: Delhi Capitals players return negative results for COVID-19 in first round of RT-PCR tests  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-04-18 11:28:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 documentary: 2022 IPL documentary name, release date and other details","link":"https://thesportsrush.com/cricket-news-ipl-2022-documentary-2022-ipl-documentary-name-release-date-and-other-details/","keywords":["Cricket","IPL 2022","IPL Documentary"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"IPL 2022 documentary: BCCI is planning to create a documentary of the IPL 2022 season covering all the 10 franchises. Sports documentaries have gained a lot of popularity around the world. In cricket, Amazon Prime’s “The Test: A New Era for Australia’s Team” gained a lot of popularity which covered the journey of the Australian… The post IPL 2022 documentary: 2022 IPL documentary name, release date and other details appeared first on The SportsRush.","content":"IPL 2022 documentary: BCCI is planning to create a documentary of the IPL 2022 season covering all the 10 franchises. Sports documentaries have gained a lot of popularity around the world. In cricket, Amazon Prime’s “The Test: A New Era for Australia’s Team” gained a lot of popularity which covered the journey of the Australian team. All the on-field and off-field activities were properly shown in the documentary. Netflix also showcased Mumbai Indians IPL 2018 journey in their show, whereas Hotstar broadcasted the “Roar of the Lion” documentary about Chennai Super Kings’s comeback in the IPL 2018 season after a two years break. Amazon Prime Video also cover full footballing seasons of the teams around the world on their platform. IPL 2022 documentary In a treat for the cricket fans, BCCI is planning to make a documentary on the IPL 2022 teams. According to News9, The documentary will cover all the on-field and off-field activities of all the franchises. To do the same, a five-member crew has been allotted with each of the ten franchises, and they are a part of bio-bubble as well. The on-field action is clearly visible to everyone, but getting to know what happens off-field brings another level of excitement to the fans. This documentary will highlight all the highs and lows of the biggest cricket league around the world. A central crew of five members will also monitor things. The BCCI working on IPL Documentary involving all 10 IPL franchises. (According to News9) — CricketMAN2 (@ImTanujSingh) April 18, 2022 The broadcasting details of the documentary are not known yet. BCCI will engage and meet with several OTT platforms in order to strike a deal. Considering the brand value and popularity of the Indian Premier League, the rights will be sold at a very hefty price. Generally, the documentaries like these take a lot of post-production time, so the documentary should take some months to release after the end of IPL 2022. The post IPL 2022 documentary: 2022 IPL documentary name, release date and other details appeared first on The SportsRush.","pubDate":"2022-04-18 10:46:45","full_description":"IPL 2022 documentary: BCCI is planning to create a documentary of the IPL 2022 season covering all the 10 franchises. Sports documentaries have gained a lot of popularity around the world. In cricket, Amazon Prime’s “The Test: A New Era for Australia’s Team” gained a lot of popularity which covered the journey of the Australian team. All the on-field and off-field activities were properly shown in the documentary. Netflix also showcased Mumbai Indians IPL 2018 journey in their show, whereas Hotstar broadcasted the “Roar of the Lion” documentary about Chennai Super Kings’s comeback in the IPL 2018 season after a two years break. Amazon Prime Video also cover full footballing seasons of the teams around the world on their platform. In a treat for the cricket fans, BCCI is planning to make a documentary on the IPL 2022 teams. According to News9, The documentary will cover all the on-field and off-field activities of all the franchises. To do the same, a five-member crew has been allotted with each of the ten franchises, and they are a part of bio-bubble as well. The on-field action is clearly visible to everyone, but getting to know what happens off-field brings another level of excitement to the fans. This documentary will highlight all the highs and lows of the biggest cricket league around the world. A central crew of five members will also monitor things. The BCCI working on IPL Documentary involving all 10 IPL franchises. (According to News9) — CricketMAN2 (@ImTanujSingh) April 18, 2022 The broadcasting details of the documentary are not known yet. BCCI will engage and meet with several OTT platforms in order to strike a deal. Considering the brand value and popularity of the Indian Premier League, the rights will be sold at a very hefty price. Generally, the documentaries like these take a lot of post-production time, so the documentary should take some months to release after the end of IPL 2022.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: David Miller's unbeaten 94 leads Gujarat to 3-wicket win over CSK","link":"https://www.sentinelassam.com/sports-news/ipl-2022-david-millers-unbeaten-94-leads-gujarat-to-3-wicket-win-over-csk-588002","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"A fighting unbeaten knock by David Miller (94 off 51) helped Gujarat Titans beat Chennai Super Kings by three wickets in a thrilling IPL 2022 match","content":"PUNE: A fighting unbeaten knock by David Miller (94 off 51) helped Gujarat Titans beat Chennai Super Kings by three wickets in a thrilling IPL 2022 match at the Maharashtra Cricket Association (MCA) Stadium, here on Sunday.Opener Ruturaj Gaikwad returned to run-scoring with an excellent half-century (73 off 48) and helped Chennai Super Kings post 169-5 in 20 overs, after being invited to bat first. Apart from Gaikwad, Ambati Rayudu (46 off 31) played a solid knock and both batters stitched a crucial partnership of 92 runs off 56 balls for the third wicket. Lower down the order, Ravindra Jadeja (22 off 12) and Shivam Dube (19 off 17) also made valuable contributions with the bat for CSK. Alzarri Joseph (2/34) was the most successful bowler for Gujarat while Mohammed Shami (1/20), and Yash Dayal (1/40) chipped in with one wicket each. In reply, Gujarat lost the wickets of Shubman Gill (0), Vijay Shankar (0) and Abhinav Manohar (12) inside the powerplay. CSK tried to maintain the pressure and in return, they got the wickets of Wriddhiman Saha (11) and Rahul Tewatia (6). Even though the wickets were falling at regular intervals at the end, David Miller, who kept sending the balls over the boundary line consistently from the other and kept Gujarat Titans' hopes alive in the game. He stitched a 70-run partnership with Rashid Khan, who played a sensational knock (40 off 21) before getting out in the 19th over. However, Miller remained not out till the end and took Gujarat over the victory line with three wickets in hand and one ball to spare. Dwayne Bravo (3/23) was the most successful bowler for CSK while Maheesh Theekshana (2/24), Mukesh Choudhary (1/18), Ravindra Jadeja (1/25) also picked wickets but it was not enough in the end. Brief scores: Chennai Super Kings 169-5 in 20 overs (Ruturaj Gaikwad 73, Ambati Rayudu 46; Alzarri Joseph 2/34) lost to Gujarat Titans 170-7 in 19.5 overs (David Miller 94 not out, Rashid Khan 40; Dwayne Bravo 3/23) by three wickets. (IANS) Also Read: We knew the guys out there in the middle were capable: ShamsiAlso Watch: Assam, Meghalaya Sign Agreement To Resolve Boundary Dispute","pubDate":"2022-04-18 10:36:02","full_description":"PUNE: A fighting unbeaten knock by David Miller (94 off 51) helped Gujarat Titans beat Chennai Super Kings by three wickets in a thrilling IPL 2022 match at the Maharashtra Cricket Association (MCA) Stadium, here on Sunday. Opener Ruturaj Gaikwad returned to run-scoring with an excellent half-century (73 off 48) and helped Chennai Super Kings post 169-5 in 20 overs, after being invited to bat first. Apart from Gaikwad, Ambati Rayudu (46 off 31) played a solid knock and both batters stitched a crucial partnership of 92 runs off 56 balls for the third wicket. Lower down the order, Ravindra Jadeja (22 off 12) and Shivam Dube (19 off 17) also made valuable contributions with the bat for CSK. Alzarri Joseph (2/34) was the most successful bowler for Gujarat while Mohammed Shami (1/20), and Yash Dayal (1/40) chipped in with one wicket each. In reply, Gujarat lost the wickets of Shubman Gill (0), Vijay Shankar (0) and Abhinav Manohar (12) inside the powerplay. CSK tried to maintain the pressure and in return, they got the wickets of Wriddhiman Saha (11) and Rahul Tewatia (6). Even though the wickets were falling at regular intervals at the end, David Miller, who kept sending the balls over the boundary line consistently from the other and kept Gujarat Titans' hopes alive in the game. He stitched a 70-run partnership with Rashid Khan, who played a sensational knock (40 off 21) before getting out in the 19th over. However, Miller remained not out till the end and took Gujarat over the victory line with three wickets in hand and one ball to spare. Dwayne Bravo (3/23) was the most successful bowler for CSK while Maheesh Theekshana (2/24), Mukesh Choudhary (1/18), Ravindra Jadeja (1/25) also picked wickets but it was not enough in the end. Brief scores: Chennai Super Kings 169-5 in 20 overs (Ruturaj Gaikwad 73, Ambati Rayudu 46; Alzarri Joseph 2/34) lost to Gujarat Titans 170-7 in 19.5 overs (David Miller 94 not out, Rashid Khan 40; Dwayne Bravo 3/23) by three wickets. (IANS) Also Read: We knew the guys out there in the middle were capable: Shamsi Also Watch: Assam, Meghalaya Sign Agreement To Resolve Boundary Dispute","image_url":"https://assets.sentinelassam.com/h-upload/2022/04/18/336563-david-miller.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals Cancel Pune Tour After One More Player Tested Positive For COVID-19","link":"https://www.sentinelassam.com/sports/cricket/delhi-capitals-cancel-pune-tour-after-one-more-player-tested-positive-for-covid-19-588000","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Delhi will play their next match against Mayank Agarwal-led Punjab Kings at the Maharashtra Cricket Association Stadium in Pune on 20 April.","content":"New Delhi: The Delhi Capitals have cancelled its trip to Pune for the next match after another player tested positive for COVID-19 during a Rapid Antigen Test Conducted on Monday morning.According to a report by Indian Express, following the development, the Board of Control for Cricket in India (BCCI) has advised Delhi Capitals to put their departure to Pune on hold till a fresh round of RT-PCR Testing on Monday.Notably, if the positive result is confirmed by the RT-PCR test, it will be the third such case in the DC camp.Earlier, the BCCI had confirmed Patrick Farhart to be COVID-19 positive through a press release. \"Delhi Capitals physio Patrick Farhart has tested positive for COVID-19. The medical team of Delhi Capitals is keeping a close watch on him at this moment,'' BCCI had said in a press release. A day later, a masseur too got infected with the virus.As per the Cricbuzz report, the players of Delhi are in their rooms and today and tomorrow they will go through COVID tests.Delhi will play their next match against Mayank Agarwal-led Punjab Kings at the Maharashtra Cricket Association Stadium in Pune on 20 April. Reportedly, during Delhi Capitals' match against Royal Challengers Bangalore, the BCCI had barred Delhi players from shaking hands with RCB players.Also read: Rahul's century in 100th IPL match leads Lucknow's 18-run win over MumbaiAlso watch:","pubDate":"2022-04-18 10:34:25","full_description":"New Delhi: The Delhi Capitals have cancelled its trip to Pune for the next match after another player tested positive for COVID-19 during a Rapid Antigen Test Conducted on Monday morning. According to a report by Indian Express, following the development, the Board of Control for Cricket in India (BCCI) has advised Delhi Capitals to put their departure to Pune on hold till a fresh round of RT-PCR Testing on Monday. Notably, if the positive result is confirmed by the RT-PCR test, it will be the third such case in the DC camp. Earlier, the BCCI had confirmed Patrick Farhart to be COVID-19 positive through a press release. \"Delhi Capitals physio Patrick Farhart has tested positive for COVID-19. The medical team of Delhi Capitals is keeping a close watch on him at this moment,'' BCCI had said in a press release. A day later, a masseur too got infected with the virus. As per the Cricbuzz report, the players of Delhi are in their rooms and today and tomorrow they will go through COVID tests. Delhi will play their next match against Mayank Agarwal-led Punjab Kings at the Maharashtra Cricket Association Stadium in Pune on 20 April. Reportedly, during Delhi Capitals' match against Royal Challengers Bangalore, the BCCI had barred Delhi players from shaking hands with RCB players. Also read: Rahul's century in 100th IPL match leads Lucknow's 18-run win over Mumbai Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/04/18/336554-delhi.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Men's Uniforms Were Re-Stitched For Women's Players\": Ex-BCCI Panel Head","link":"https://sports.ndtv.com/cricket/mens-uniforms-were-re-stitched-for-womens-players-former-bcci-committee-of-administrators-chairman-vinod-rai-2897481","keywords":null,"creator":null,"video_url":null,"description":"Speaking about women's cricket in India, Mr Rai said that he had to call-up then kit manufacturers Nike to ask them to design women's jerseys separately as earlier the men's jersey's were being...","content":null,"pubDate":"2022-04-18 10:31:10","full_description":null,"image_url":"https://c.ndtvimg.com/2022-03/0ms59f3o_india-women-celebrate-afp_625x300_26_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Assam to face Saurashtra today in Senior Women T20 League at Ranchi","link":"https://www.sentinelassam.com/sports-news/assam-to-face-saurashtra-today-in-senior-women-t20-league-at-ranchi-587996","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Assam will face Saurasthtra in their opening game in the Senior Women T20 League at Ranchi tomorrow. In the group stage Assam will play five games","content":"OUR SPORTS REPORTERGUWAHATI: Assam will face Saurasthtra in their opening game in the Senior Women T20 League at Ranchi tomorrow. In the group stage Assam will play five games and their other opponents are Punjab (April 19), Bengal (April 21), Mumbai (April 22) and Haryana (April 24). Also Read: Nirupoma to lead Assam in Senior Women T20 Cricket tournamentAlso Watch: Supreme Court issues notice to make adoption procedures simple","pubDate":"2022-04-18 10:27:53","full_description":"OUR SPORTS REPORTER GUWAHATI: Assam will face Saurasthtra in their opening game in the Senior Women T20 League at Ranchi tomorrow. In the group stage Assam will play five games and their other opponents are Punjab (April 19), Bengal (April 21), Mumbai (April 22) and Haryana (April 24). Also Read: Nirupoma to lead Assam in Senior Women T20 Cricket tournament Also Watch: Supreme Court issues notice to make adoption procedures simple","image_url":"https://assets.sentinelassam.com/h-upload/2022/04/18/336553-women-t20.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"}]}