{"newsArray":[{"title":"‘It’d be awesome’: Gilly endorses ‘hurt’ Langer’s England defection","link":"https://www.foxsports.com.au/cricket/australia/cricket-australia-2022-news-pakistan-tour-adam-gilchrist-backs-justin-langer-for-england-coaching-role/news-story/9f267c27831fd811ef88564c9d1998b5","keywords":null,"creator":null,"video_url":null,"description":"Adam Gilchrist believes Justin Langer would be the right man to take over as England’s head coach after his ugly divorce with Cricket Australia earlier this month.","content":null,"pubDate":"2022-02-17 23:21:00","full_description":"Adam Gilchrist believes Justin Langer would be the right man to take over as England’s head coach after his ugly divorce with Cricket Australia earlier this month. Langer was eager to stay on-board long-term having won the Ashes and men’s T20 World Cup while bending to the demands of players to be more hands-off. Nonetheless, he was still only offered a six-month renewal, which he turned down. Watch The Dettol T20 Series Australia vs Sri Lanka. Every Game Live & On-Demand on Kayo. New to Kayo? Start your free trial now > Gilchrist called labelled the saga as “pathetic” while Shane Warne said it was an “absolute disgrace” as players sought a coach with a more collaborative and calm approach. Langer’s exit coincided with mass changes within the England set-up with coach Chris Silverwood given his marching orders after the summer’s heavy 4-0 Ashes loss. Speaking Barmy Army podcast The Shackles Are Off , Australia legend Gilchrist backed former teammate Langer to take over the role, but only when the time is right. Aussies experimental order to continue | 02:24 READ MORE Aussies set for mass T20 changes as ‘big three’ sent home ‘Carnage’ as Proteas slump to 90-year low as Black Caps quick takes third best figures ever ‘Not ideal’: Aussie hopeful opens up on frustration as brutal Test wait stretches on “I get the feeling that doing it straight away... it just might be a bit soon,” Gilchrist told the podcast. “He’s been hurt — you don’t need to be Einstein to work that out. “I don’t think he’s going to be short of opportunities, so he needs to work that out. “I don’t say this in a provocative sense, but I do look at the set up at the moment with England and think, ‘geez he would be a good fit’.” Gilchrist said it would be “awesome” to see Langer working with Ben Stokes, who he says has a similar work ethic to Langer. He added: “It would be intriguing to see what could grow and develop and sprout from that. “And Joe (Root) as captain I think would benefit from a figure like Justin alongside him.’ Langer is one of the names under consideration by the ECB to take over from Silverwood. Interim managing director Andrew Strauss confirmed earlier this month that Langer was in contention. “I know him well,” Strauss said. “On the surface, he’s done a very good job of things with the Australian cricket team. So I wouldn’t rule him out.”","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Lachlan Henderson named Cricket Australia’s new chairman","link":"https://www.cairnspost.com.au/sport/cricket/lachlan-henderson-named-cricket-australias-new-chairman/video/c6af79ab317362d79937ccee078716f5","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Lachlan Henderson has been named as Cricket Australia's new Chairman.","content":null,"pubDate":"2022-02-17 22:28:09","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Paine returns in coaching role for Tasmania","link":"https://www.cairnspost.com.au/sport/cricket/paine-returns-in-coaching-role-for-tasmania/video/d67a77b8f6ef0a409cc6edaf603168a7","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Following a short break from the game, former Australian captain Tim Paine is set to return in a coaching role for Tasmania.","content":null,"pubDate":"2022-02-17 22:28:09","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"'Surprising' Kyrgios admission stuns Djokovic","link":"https://wwos.nine.com.au/tennis/djokovic-gets-warm-welcome-in-dubai-before-tennis-tournament/76b5e931-2689-47fe-b634-1c76a85c87c7","keywords":null,"creator":["wwos"],"video_url":null,"description":"Novak Djokovic said he was \"surprised pleasantly\" by the support he received from Nick Kyrgios during his deportation saga in Australia.","content":"Serbian tennis star Novak Djokovic said he was \"surprised pleasantly\" by the support he received from Nick Kyrgios during his deportation saga in Australia.Djokovic received a warm welcome in Dubai, where he visited the world’s fair following the global drama around his decision to remain unvaccinated.After being twice detained and deported from Australia ahead of the year's first Grand Slam Tournament last month, Djokovic was in the United Arab Emirates for the Duty Free Tennis Championships.READ MORE: Aussie matches feat last seen in NBA 61 years agoREAD MORE: Stunning 90-year low rocks South Africa cricket“I’m excited to go out on the tennis court next Monday,” he said when asked by The Associated Press how he feels after the recent twists and turns of the legal dispute over his travel visa. “I miss tennis honestly after everything that has happened.”During a press conference to promote his foundation in Dubai, the world No.1 was asked various questions relating to his controversial short stay in Australia.The line of questioning turned to the support the star received during his time in hotel detention, with the Serbian icon highlighting the widespread encouragement from the tennis community, even Kyrgios.The Australian had been a vocal critic of Djokovic in the past, but the world No.113 was one of the first to take exception to the way the Djokovic was treated upon his arrival into the country.\"Kyrgios surprised me pleasantly, I thanked him and all the others who stood up for me, Alize Cornet for instance,\" Djokovic said.\"I received a lot of messages privately from some of the players, but they didn't want to speak publicly. I understand it, the situation was complicated.Djokovic this week doubled down on his decision to stay unvaccinated. The No. 1-ranked tennis player said he would skip the French Open, Wimbledon and other tournaments if he was required to get a coronavirus vaccine to compete.https://twitter.com/ozmo_sasa/status/1494396025519362056?ref_src=twsrc%5Etfwhttps://twitter.com/Ladal17/status/1494388775480434698?ref_src=twsrc%5EtfwThe government of Dubai does not require visitors to be vaccinated to enter. The men’s tennis tour event begins next week.As he ambled into the pavilion Thursday surrounded by a sea of journalists, fans clapped and chanted “Nole,” his nickname.Djokovic posed for selfies with adoring fans and set off on a guided tour of Serbia’s national pavilion at Expo 2020 days before he was due to hit the courts. The pavilion was hosting an event for his foundation, the Novak Djokovic Foundation, which promotes early childhood education in Serbia.https://twitter.com/ThatPaddyRyan/status/1494301804930248711?ref_src=twsrc%5Etfw“I’m proud to be on this stage,” Djokovic said after his wife Jelena gave a presentation about the foundation’s work with children.He said it was often hard to be involved as much as he wanted to be with the foundation given his whirlwind tournament schedule.But he quickly acknowledged: “It’s not as busy as it used to be.”The audience burst into applause.Wearing a crisp white shirt and black mask emblazoned with his foundation’s logo, Djokovic gave high fives to toddlers and nodded encouragingly as he heard about Serbia’s start-up scene at the pavilion's multimedia exhibit.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-17 20:13:21","full_description":"Serbian tennis star Novak Djokovic said he was \"surprised pleasantly\" by the support he received from Nick Kyrgios during his deportation saga in Australia. Djokovic received a warm welcome in Dubai, where he visited the world’s fair following the global drama around his decision to remain unvaccinated. After being twice detained and deported from Australia ahead of the year's first Grand Slam Tournament last month, Djokovic was in the United Arab Emirates for the Duty Free Tennis Championships. READ MORE: Aussie matches feat last seen in NBA 61 years ago READ MORE: Stunning 90-year low rocks South Africa cricket “I’m excited to go out on the tennis court next Monday,” he said when asked by The Associated Press how he feels after the recent twists and turns of the legal dispute over his travel visa. “I miss tennis honestly after everything that has happened.” During a press conference to promote his foundation in Dubai, the world No.1 was asked various questions relating to his controversial short stay in Australia. The line of questioning turned to the support the star received during his time in hotel detention, with the Serbian icon highlighting the widespread encouragement from the tennis community, even Kyrgios. The Australian had been a vocal critic of Djokovic in the past, but the world No.113 was one of the first to take exception to the way the Djokovic was treated upon his arrival into the country. \"Kyrgios surprised me pleasantly, I thanked him and all the others who stood up for me, Alize Cornet for instance,\" Djokovic said. \"I received a lot of messages privately from some of the players, but they didn't want to speak publicly. I understand it, the situation was complicated. Djokovic this week doubled down on his decision to stay unvaccinated. The No. 1-ranked tennis player said he would skip the French Open, Wimbledon and other tournaments if he was required to get a coronavirus vaccine to compete. The government of Dubai does not require visitors to be vaccinated to enter. The men’s tennis tour event begins next week. As he ambled into the pavilion Thursday surrounded by a sea of journalists, fans clapped and chanted “Nole,” his nickname. Djokovic posed for selfies with adoring fans and set off on a guided tour of Serbia’s national pavilion at Expo 2020 days before he was due to hit the courts. The pavilion was hosting an event for his foundation, the Novak Djokovic Foundation, which promotes early childhood education in Serbia. “I’m proud to be on this stage,” Djokovic said after his wife Jelena gave a presentation about the foundation’s work with children. He said it was often hard to be involved as much as he wanted to be with the foundation given his whirlwind tournament schedule. But he quickly acknowledged: “It’s not as busy as it used to be.” The audience burst into applause. Wearing a crisp white shirt and black mask emblazoned with his foundation’s logo, Djokovic gave high fives to toddlers and nodded encouragingly as he heard about Serbia’s start-up scene at the pavilion's multimedia exhibit. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/411376/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"“It was the worst year of my life”: When Kevin Pietersen opened up on his controversy- marred stint as England captain","link":"https://thesportsrush.com/cricket-news-it-was-the-worst-year-of-my-life-when-kevin-pietersen-opened-up-on-his-controversy-marred-stint-as-england-captain/","keywords":["Cricket","England","kevin pietersen"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Kevin Pietersen opened up on his controversial stay as captain of the England Cricket team which led to his sacking by the ECB. Just going by plain Cricketing numbers or statistics, Kevin Pietersen was and will remain a leading name when it comes to compiling a list of players who have adorned the game with… The post “It was the worst year of my life”: When Kevin Pietersen opened up on his controversy- marred stint as England captain appeared first on The SportsRush.","content":"Kevin Pietersen opened up on his controversial stay as captain of the England Cricket team which led to his sacking by the ECB. Just going by plain Cricketing numbers or statistics, Kevin Pietersen was and will remain a leading name when it comes to compiling a list of players who have adorned the game with their presence. While his career fittingly deserves to be celebrated, it was one marred with plentiful controversies involving the ECB, his fellow former teammates, and the England and Wales Cricket Board (ECB) throughout the different phases of his Cricketing career. The biggest of them all perhaps began post his appointment as England’s Test and ODI captain in 2008, when he replaced the likes of Michael Vaughan (in Tests) and Paul Collingwood (in ODIs). While Pietersen kicked-off his captaincy career with a remarkable century and a Test win against South Africa, it unfortunately could last only for a couple of further Test matches, after which he was sacked from his post due to 1) A fallout with then England coach Peter Moores, and most importantly 2) the lack of backing he received from some of the senior members of the team, including Andrew Flintoff. Kevin Pietersen opened up on his controversial stay as captain In 2017, three years since he was sacked from the England side after a 0-5 Ashes series loss in Australia in 2014, Pietersen reminisced his less than five months stint as skipper, only to term the phase and the entire year (2008) as the worst one of his life. “I was under strict protocols. They tell you where you have be, you have to ask to do this and that. I had the best time playing for England. I wouldn’t live here if I didn’t love England. There have been hurdles. I was under the microscope. When I was captain, it was the worst year of my life. I took stock and gauged what and who was important,” Pietersen was quoted as saying to news.com.au. “That massive fallout I had with England raised my profile and assisted and enabled me to turn a bad thing into a good thing. People think, ‘Cricket, cricket, cricket’. Well, stuff cricket. It means that what Jess and the kids have now is so special. I’ve got such a wonderful life. I wouldn’t want to be back on that England treadmill. It becomes monotonous,” he further added. At the same breath, the right-handed batter also termed it as the ‘best thing of his life’ at hindsight, as he was then able to spend more time with his kids. “That sacking and the hullabaloo it caused for six months has been the best thing for my life. Now I wake up with the kids, put them to bed, take them and pick them up from school. I watch most of Dylan’s sport. I will hands down see my kids more than a lot of people. I’m now hopefully being the best dad my kids could have. All I care about is my family and my African roots,” Pietersen had remarked. The now 41-year-old, had captained in a total of three Tests (one against South Africa and two against India) in 2008, and had won two while lost one against India at Chennai. It was post the Chennai Test, that tensions simmered up between him and coach Moores, where Pietersen had explicably told the ECB to chose one of him or Peter Moores to stay in the team. Ultimately, both the captain-coach duo were axed from their respective posts in January 2009. Along with three Tests, Pietersen also captained in a total of 12 ODIs for England and won 4 of them. The post “It was the worst year of my life”: When Kevin Pietersen opened up on his controversy- marred stint as England captain appeared first on The SportsRush.","pubDate":"2022-02-17 20:10:19","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"VCT vs QUN Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Sheffield Shield, Match 17","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/vct-vs-qun-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-sheffield-shield-match-17?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-17 19:23:21","full_description":"Victoria will take on Queensland in the 17th match of the Sheffield Shield 2021-22 on Friday, 18th February 2022. The match will be played at Junction Oval, Melbourne. Victoria are currently placed third in the points table with two wins and as many draws. They are yet to lose a game and are coming into this match after a draw against South Australia. Meanwhile, Queensland suffered a two-wicket defeat against New South Wales in the previous game. They now stand second with 21.77 points in six games. Victoria Marcus Harris, Peter Handscomb (c), Nic Maddinson, Jonathan Merlo, Matthew Short, Sam Harper (wk), Will Sutherland, Mitchell Perry, Scott Boland, Jon Holland, James Pattinson Queensland Bryce Street, Usman Khawaja (c), Marnus Labuschagne, Matt Renshaw , Sam Truloff, Jimmy Peirson (wk), Jack Wildermuth, Blake Edwards, James Bazley, Mark Steketee , Mitchell Swepson Match: Victoria vs Queensland, Match 17 Date and Time: Friday, 18th February at 5:00 AM IST Venue: Junction Oval, Melbourne The pitch at Junction Oval offers assistance to the batters. Pacers might get some movement initially, but batters are expected to dominate the game. The average first innings score at this surface is 333 runs. Wicketkeeper Peter Handscomb: Handscomb scored a brilliant century in the previous game. Overall, he has scored 329 runs in six innings at an average of 65.80. Batters Usman Khawaja: Khawaja carried his form from the Test series into this tournament with a half-century in the last game. In 10 innings, he has managed to score 529 runs at an average of 58.78. Marnus Labuschagne: Labuschagne is currently the No. 1 ranked Test batter. In this tournament, he has scored 507 runs in 11 innings at an average of 56.33. Travis Dean: Dean performed admirably in the last game. He played a fine knock of 144 runs, including 15 boundaries. All-rounders Jonathan Merlo: Merlo made vital contributions to both departments in the previous game. He scored 64 runs and also managed to take two wickets. Bowlers Mark Steketee: Steketee has been exceptional with the ball this season. He has managed to take 29 wickets in 10 innings at a strike rate of 16. James Pattinson: Pattison had a great all-round showing in the previous game. He had 45 runs and two wickets to his name in the first innings followed by a fifer in the second. Mark Steketee: 652 points Usman Khawaja: 516 points Marnus Labuschagne: 422 points James Pattinson: 258 points Peter Handscomb: 229 points Mark Steketee: 10 innings, 29 wickets Usman Khawaja: 10 innings, 529 runs Marnus Labuschagne: 11 innings, 507 runs James Pattinson: Four innings, 51 runs, 10 wickets Peter Handscomb: Six innings, 329 runs Fantasy Suggestion #1: Peter Handscomb, Usman Khawaja, Marnus Labuschagne, Travis Dean, Jonathan Merlo, Mark Steketee, James Pattinson, Jimmy Pierson, Jack Wildermuth, Scott Boland, Matthew Kuhnemann Captain: Usman Khawaja Vice-Captain: Mark Steketee Fantasy Suggestion #2: Peter Handscomb, Usman Khawaja, Marnus Labuschagne, Travis Dean, Jonathan Merlo, Mark Steketee, James Pattinson, Mitchell Swepson, James Bazley, Nic Maddinson, Matt Renshaw Captain: Marnus Labuschagne Vice-Captain: James Pattinson","image_url":"https://static.sportskeeda.com/editor/2022/02/65b96-16451238705366-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"The Babe and the Don: Babe Ruth’s dalliance with cricket","link":"https://www.pinstripealley.com/2022/2/17/22932194/yankees-history-babe-ruth-don-bradman-cricket-boston-braves-retirement","keywords":null,"creator":["Matt Ferenchick"],"video_url":null,"description":null,"content":"Photo by Central Press/Getty Images Late in his baseball career, Babe Ruth had a meeting with the cricket version of himself and even attempted the fellow bat-and-ball sport a bit. Other than softball, which was created as an offshoot, the sport most often compared to baseball is typically cricket. They’re both bat-and-ball sports that involve hitting, throwing, catching, fielding, and running to “bases” to score runs. There are definitely differences in techniques in batting and pitching/bowling (as it’s called in cricket), but the comparisons are understandable. Over the years, there have been plenty of attempts to see if a player could cross over from one sport to the other. The Jon Hamm-led movie “Million Dollar Arm” was based on a true story about a reality show that wanted to see if Indian cricketers could make it in baseball. Two players that came out of the show spent time in the Pirates’ organization. The Red Sox once tried to see if Australian cricket legend Adam Gilchrist, known for his aggressive, hard hitting, had any interest in switching over upon retirement from cricket. Former Australian captains and brothers Ian and Greg Chappell both played baseball in their youth before focusing on cricket. Ian, who later became a cricket commentator, then even got involved with the broadcast booth when the Diamondbacks and Dodgers played regular season games in Australia in 2014. Plenty of players have looked into potentially transitioning from one sport to the other. Even Babe Ruth tried to give cricket a spin. The story of Ruth’s affiliation with cricket began in 1932. That July, while touring North America, playing cricket, and honeymooning with his wife, the legendary Australian cricketer Don Bradman took in a baseball game at Yankee Stadium. For those unaware, Bradman is basically the Ruth of cricket, in both statistical excellence and in borderline mythic status. In batting average, which actually began in cricket before being adopted by baseball, Bradman is the all-time leader in test cricket (the famed five-day matches), averaging 99.94 runs. That means for every time Bradman got out, he scored 99 runs. Considering that scoring 100 in one time batting (or in an inning as it’s called in cricket) is seen as an excellent achievement, essentially scoring that every time you bat is insanity. For reference, second place on the all-time average list is someone with 61.87. Bradman was hosted by Ruth while at the Yankees game, as the Bambino was out of the lineup on that particular day. During the two legends’ discussions, Ruth told Bradman that he would one day attempt cricket, and a few years later, he did just that. In 1934, Ruth knew he was coming toward the end of his baseball playing career. While he still put up great numbers that year, he was limited to 125 games. Knowing his days as a player were limited, Ruth attempted to campaign for the job as Yankees manager, but the team had no intention of replacing future Hall of Fame skipper Joe McCarthy. After the ‘34 season, Ruth went on a bit of a world tour. He helped organize a barnstorming series in Japan before heading over to Europe. One of his stops across the pond would be London, where he kept his word to Bradman. While in the UK, Ruth was put in contact with former Australian national team member Alan Fairfax. The bloke in whites is the Australian Test all rounder Alan Fairfax - his clueless looking pupil might not be shaping up like much of a batsman, but I expect he'll be hitting the ball a bloody long way - he is George 'Babe' Ruth pic.twitter.com/jqteAt3qXR— Martin Chandler (@fredfertang) June 1, 2020 Fairfax was living in London and running an indoor cricket school when the baseball legend paid him a visit. Fairfax initially attempted to teach Ruth the proper cricket stance and technique, with which the Babe reportedly struggled. Upon switching to his more typical baseball stance, he began smashing balls all over the place, to the point where he broke the bat at the handle. Fairfax was impressed, believing that if he had a couple weeks, he could turn Ruth into cricket’s greatest batter. Ruth was less receptive to the idea upon finding out that cricketers did not make as much as his baseball series. He did quite enjoy using a flat cricket bat though, remarking that he wished he could use it in baseball. So Ruth decided against becoming a cricketer and returned to the US. There, with his Yankees’ managerial ambitions still proving fruitless, the Yankees agreed to let him go to the Boston Braves. The NL club gave Ruth a player-coach role, with a possibility that he could someday ascend to the big role. However, it turned out that the Braves’ owner was more using Ruth to get people in the stands and never actually intended to let him become manager. After hitting just .181 in 92 at-bats, Ruth decided to retire. Years after his playing career ended, Ruth passed away on August 16, 1948. In a weird twist of fate, across the ocean, just two days prior, Bradman’s test cricket career had finished. He had been gotten out for zero runs in his final chance to bat when he needed just four to ensure that his final career batting average would be over 100. Sources https://www.foxsports.com.au/cricket/when-babe-met-sir-don-the-anatomy-of-cricket-and-baseballs-cosy-history/news-story/b2c4880f9624301524019c8ecb855fe3 https://trove.nla.gov.au/newspaper/article/74325352 https://www.dreamcricket.com/articles/dreamcricket-usa-news/when-babe-ruth-tried-his-hand-at-cricket/ https://sabr.org/gamesproj/game/may-30-1935-babe-ruth-plays-his-last-game/ “The Big Bam: The Life and Times of Babe Ruth” by Leigh Montville","pubDate":"2022-02-17 19:00:00","full_description":"Other than softball, which was created as an offshoot, the sport most often compared to baseball is typically cricket. They’re both bat-and-ball sports that involve hitting, throwing, catching, fielding, and running to “bases” to score runs. There are definitely differences in techniques in batting and pitching/bowling (as it’s called in cricket), but the comparisons are understandable. Over the years, there have been plenty of attempts to see if a player could cross over from one sport to the other. The Jon Hamm-led movie “Million Dollar Arm” was based on a true story about a reality show that wanted to see if Indian cricketers could make it in baseball. Two players that came out of the show spent time in the Pirates’ organization. The Red Sox once tried to see if Australian cricket legend Adam Gilchrist, known for his aggressive, hard hitting, had any interest in switching over upon retirement from cricket. Former Australian captains and brothers Ian and Greg Chappell both played baseball in their youth before focusing on cricket. Ian, who later became a cricket commentator, then even got involved with the broadcast booth when the Diamondbacks and Dodgers played regular season games in Australia in 2014. Plenty of players have looked into potentially transitioning from one sport to the other. Even Babe Ruth tried to give cricket a spin. The story of Ruth’s affiliation with cricket began in 1932. That July, while touring North America, playing cricket, and honeymooning with his wife, the legendary Australian cricketer Don Bradman took in a baseball game at Yankee Stadium. For those unaware, Bradman is basically the Ruth of cricket, in both statistical excellence and in borderline mythic status. In batting average, which actually began in cricket before being adopted by baseball , Bradman is the all-time leader in test cricket (the famed five-day matches), averaging 99.94 runs. That means for every time Bradman got out, he scored 99 runs. Considering that scoring 100 in one time batting (or in an inning as it’s called in cricket) is seen as an excellent achievement, essentially scoring that every time you bat is insanity. For reference, second place on the all-time average list is someone with 61.87. Bradman was hosted by Ruth while at the Yankees game, as the Bambino was out of the lineup on that particular day. During the two legends’ discussions, Ruth told Bradman that he would one day attempt cricket, and a few years later, he did just that. In 1934, Ruth knew he was coming toward the end of his baseball playing career. While he still put up great numbers that year, he was limited to 125 games. Knowing his days as a player were limited, Ruth attempted to campaign for the job as Yankees manager, but the team had no intention of replacing future Hall of Fame skipper Joe McCarthy. After the ‘34 season, Ruth went on a bit of a world tour. He helped organize a barnstorming series in Japan before heading over to Europe. One of his stops across the pond would be London, where he kept his word to Bradman. While in the UK, Ruth was put in contact with former Australian national team member Alan Fairfax. The bloke in whites is the Australian Test all rounder Alan Fairfax - his clueless looking pupil might not be shaping up like much of a batsman, but I expect he'll be hitting the ball a bloody long way - he is George 'Babe' Ruth pic.twitter.com/jqteAt3qXR Fairfax was living in London and running an indoor cricket school when the baseball legend paid him a visit. Fairfax initially attempted to teach Ruth the proper cricket stance and technique, with which the Babe reportedly struggled. Upon switching to his more typical baseball stance, he began smashing balls all over the place, to the point where he broke the bat at the handle. Fairfax was impressed, believing that if he had a couple weeks, he could turn Ruth into cricket’s greatest batter. Ruth was less receptive to the idea upon finding out that cricketers did not make as much as his baseball series. He did quite enjoy using a flat cricket bat though, remarking that he wished he could use it in baseball. So Ruth decided against becoming a cricketer and returned to the US. There, with his Yankees’ managerial ambitions still proving fruitless, the Yankees agreed to let him go to the Boston Braves. The NL club gave Ruth a player-coach role, with a possibility that he could someday ascend to the big role. However, it turned out that the Braves’ owner was more using Ruth to get people in the stands and never actually intended to let him become manager. After hitting just .181 in 92 at-bats, Ruth decided to retire. Years after his playing career ended, Ruth passed away on August 16, 1948. In a weird twist of fate, across the ocean, just two days prior, Bradman’s test cricket career had finished . He had been gotten out for zero runs in his final chance to bat when he needed just four to ensure that his final career batting average would be over 100. Sources https://www.foxsports.com.au/cricket/when-babe-met-sir-don-the-anatomy-of-cricket-and-baseballs-cosy-history/news-story/b2c4880f9624301524019c8ecb855fe3 https://trove.nla.gov.au/newspaper/article/74325352 https://www.dreamcricket.com/articles/dreamcricket-usa-news/when-babe-ruth-tried-his-hand-at-cricket/ https://sabr.org/gamesproj/game/may-30-1935-babe-ruth-plays-his-last-game/ “The Big Bam: The Life and Times of Babe Ruth” by Leigh Montville","image_url":null,"source_id":"pinstripealley","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"New Zealand vs South Africa, 1st Test, Day 2: Live Cricket Score, Updates","link":"https://sports.ndtv.com/cricket/new-zealand-vs-south-africa-1st-test-day-2-live-cricket-score-and-updates-2774659","keywords":null,"creator":null,"video_url":null,"description":"New Zealand vs South Africa, 1st Test, Day 2,live cricket score and updates: New Zealand will look to tighten their grip over South Africa in the opening Test when they resume batting on the second...","content":null,"pubDate":"2022-02-17 17:44:05","full_description":"New Zealand vs South Africa, 1st Test, Day 2, live cricket score and updates: New Zealand will look to tighten their grip over South Africa in the opening Test when they resume batting on the second day of play in Christchurch on Friday. Earlier, New Zealand dominated South Africa to hold a 21-run lead on day one of the Test after Matt Henry spearheaded the attack with a career-best seven for 23. Henry's bounce and movement saw South Africa fold for 95 before tea, and at stumps New Zealand had benefitted from the wicket browning off in the late afternoon and were 116 for three. ( LIVE SCORECARD ) Right then, New Zealand are ahead by 21 runs and have 7 wickets in the bank. Their aim would be to bat South Africa out of the match on Day 2. That said, the early morning conditions will bring plenty of challenges their way and that will be the opportunity for South Africa to make a comeback. Can they do it? The first ball on Friday will be at 3.30 am IST (10 pm GMT, previous day) but as usual, our build-up will begin much before. Until we meet again, it's goodbye and cheers! South Africa bowled well but only in patches and their catching was mediocre, to say the least. As many as four catches went down and had they taken all of them, they could have been in a better position. It was a struggle for Tom Latham and Will Young during their stay against the new ball but once they departed, the pair of Devon Conway and Henry Nicholls joined forces and brought a sense of calmness at the crease. They combined for a 75-run stand and helped New Zealand in wiping off the deficit. Conway did fall late in the day but Nicholls is still going strong and a big knock will be expected from him on Day 2. Just for the record, Henry Nicholls was dropped twice by South Africa, once in the slip cordon by Zubayr Hamza at the score of 5 and then by Temba Bavuma at point when he was on 23. A wicket late in the evening will have given South Africa some hope but they are still miles behind in this match after an abysmal batting show. It was a riveting day of Test cricket, dominated by the bowlers as 13 wickets fell altogether. The Hagley Oval had plenty of juice on the surface and the pacers utilized it to their advantage. Matt Henry was the star with his 7-wicket haul as he demolished the South African batting and played a major role in bundling them out for only 95 runs. In reply, it was not easy for New Zealand against some tidy bowling from the Proteas. A length ball, on middle, Nicholls misses his defensive shot and gets hit high on the pads. That will be Stumps on Day 1. New Zealand lead by 21 runs. A full ball, swinging on the pads. Wagner whips it to deep square leg for a single. Length and on middle. Defended out. A short ball, on middle. Wagner dodges and lets it through. PUT DOWN! On a length, angling on middle, Wagner stays back to defend but gets an inside edge to short leg where Rassie van der Dussen fails to gobble it up. He reacted too slowly. Short of a length, angling down. Nicholls gets on top of the bounce as he eases it to deep backward square leg for a single. South Africa are rushing through now. They have around four minutes to bowl two overs. Comes around the wicket for the last delivery and makes it to move away as well but the line is outside off. Easy leave for Wagner. A length ball, on middle, some steep bounce there. Wagner awkwardly keeps it out. Length and on middle. This time Wagner gets inside the line of the ball to block it out. Short ball, angling around off. Wagner is squared up as he tries to defend it. Jansen comes over the wicket and angles it around off, Nicholls guides it through point for a single. Bangs a short ball, on middle, Henry evades it. Full and down the leg side. Wagner misses his flick. Good take by the keeper to his right. Successful over for South Africa, two runs and a big wicket of Conway coming from it. Length ball, on off. Wagner blocks it out. Short of a length, on middle. Wagner looks to block it but the extra bounce takes the shoulder of the blade and lobs just near the pitch. Drops safely. Full ball, outside off. Nicholls defends it with soft hands, past gully for a single.","image_url":"https://c.ndtvimg.com/2022-02/bns670q_henry-nicholls-afp_625x300_17_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket Australia Shares Massive Throwback From First Ever T20I. See Pics","link":"https://sports.ndtv.com/cricket/cricket-australia-shares-massive-throwback-from-first-ever-t20-international-see-pics-2774210","keywords":null,"creator":null,"video_url":null,"description":"On Thursday, exactly 17 years since that day, Cricket Australia shared some throwback photos from that match. The match was won by Australia by a margin of 44 runs, with Ricky Ponting scoring an...","content":null,"pubDate":"2022-02-17 14:02:25","full_description":"The first ever T20 international match was played between Australia and New Zealand at Auckland on February 17, 2005. On Thursday, exactly 17 years since that day, Cricket Australia shared some throwback photos from that match. The match was won by Australia by a margin of 44 runs, with Ricky Ponting scoring an unbeaten 98, to bag the player of the match award. \" #OnThisDay 17 years ago, our Aussie men took on New Zealand in the first-ever men's T20 International!\" Cricket Austrlia wrote on Instagram along with the photos What's interesting is that it took Australia 16 years to win their first World Cup title in the format, when they were crowned champions last year, while New Zealand are yet to win the title. In that match, Australia put up a total of 214 runs after batting first. Apart from Ponting, Andrew Symonds (32), Michael Hussey (31*) and Simon Katich (30) got runs for the Aussies. Promoted The Blackcaps gave a spirited chase to the mammoth target, with Scott Styris scoring a 39-ball 66. But a 4-wicket burst from Michael Kasprowicz helped Australia post a comfortable win. Both the teams decided to go retro and wore coloured jerseys which were used by the teams in the 1980s.","image_url":"https://c.ndtvimg.com/2022-02/3hkpi618_first-ever-t20i_120x90_17_February_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Phil Tufnell was starstruck when Russell Crowe called him ‘Tuffers!’","link":"https://metro.co.uk/2022/02/17/phil-tufnell-was-starstruck-when-russell-crowe-called-him-tuffers-16119353/","keywords":["Cricket","Metro newspaper","Phil Tufnell","Sixty Seconds"],"creator":["Rachel Corcoran"],"video_url":null,"description":"‘He’s Gladiator and he’s just gone, “Hello, Tuffers!”’","content":"‘He’s Gladiator and he’s just gone, “Hello, Tuffers!”’ (Picture: REX) The ex-cricketer, 55, on a Test Match Special tour, writing a book during lockdown and launching his own wine label. What can cricket fans expect from your Test Match Special Live tour? Lots of fun. We’re going up and down the country with Aggers [Jonathan Agnew] and the team and lots of anecdotes. We’ll take people inside the commentary box and show them some never-before-seen footage. We’ve got some well-known people and cricketers popping in to tell their experiences. And I’m sure we’re going to be talking about the Ashes disaster. It’s the first time TMS has gone on tour… TMS has been going a long time and has been a huge part of my life. I remember listening to it with my dad, stuck in a traffic jam going down to Brighton on a summer’s day. It’s probably my first experience of cricket, actually, listening to the iconic voices of Johnners [Brian Johnston] and John Arlott wafting over the airwaves. So I feel very privileged to be a part of such an iconic radio show. Do you channel Geoffrey Boycott or base your commentary style on anyone? Phil’s approach to commentating is to go with the flow (Picture: Andrew Fosker/Bpi/REX/Shutterstock) That’s the first time anyone has asked me if I have a commentary style! I just turn up and get very excited about the game. It’s obviously a passion of mine, having played for 20 years professionally at the highest level. You just go with the buzz and if it’s raining, you have a little chat about something else. I think your own style comes out. Who’s your favourite person to interview? I usually do the colour — I’m not the ball-by-ball commentator, I’m the analyst. But when Aggers was interviewing Russell Crowe, that was quite exciting. Usually, I leave it to Aggers and have a bit of lunch but on this occasion I skipped lunch. Russell was standing there and said, ‘Hello, Tuffers!’ I thought, ‘He’s Gladiator and he’s just gone, “Hello, Tuffers!”’ Do current sportspeople ask for your advice on getting into the media? They do. You’ve got to have a little bit of good fortune to be at the right place at the right time. It also comes down to the passion for the game. Did doing shows such as I’m A Celebrity and Strictly help you? A little bit. I went into the jungle all those years ago and was very fortunate to win it. Radio is completely different to being in front of the camera and is a lovely way to express yourself without the pressures of a TV camera on you. You don’t have to shave every morning or comb your hair quite so much. You wrote your book, How Not To Be A Cricketer, during lockdown… It gave me something to do. I did that with a co-writer on Zoom and I penned a few things down on days when everything was shut down. That was quite cathartic and it also got me out of painting the shed. I’ve done a few books now and find them great fun to do. It’s amazing what you forget so to trawl back through scrapbooks, all these things pop back into your memory and you start chuckling to yourself. What are you most proud of? That first time I pulled on the England jersey. It doesn’t get much better than that, really. Phil thinks he was extremely fortunate to win I’m a Celebrity (Picture: ITV/REX/Shutterstock) Are cricketers under a lot more pressure now? Yes, I think so. It’s very tough to get the best out yourself when everything’s in your favour, never mind when you’re having to be locked in and go through quarantines. So to perform the way they have in some of the games has been incredible. When I was playing, it was 16 fellows going off with a coach and a physio. Now they’ve got more backroom staff than players! Psychologists, analysts, strength and conditioning, dieticians… They have everything to make them the best cricketer they can be, when in our day we’d go down the bar and have a word with the senior players. More: Metro newspaperYour daily horoscope for Thursday, February 17, 2022'Men only seem to want me for sex - is there something wrong with me?'Tess Daly ‘refuses to count calories’ and reveals the secret to her energy Will England bounce back for the next Ashes? Australia have a great bowling unit, which always helps because in order to win Test matches you’ve got to take 20 wickets. We seem to be lacking in the batting department but we’ve got a fabulous white-ball team. We need to address the Test matches. What else have you got going on this year? I’ve launched a range of wine called Tuffers’ Tipple. A friend of mine said, ‘Let’s get some wines together!’ I thought that was a great idea. It was fun tasting and blending and creating wines that suit my lifestyle and taste. They’re like my children, the Sauvignons, Bacchuses and Shirazes. I’m very proud of what we’ve come up with — they taste bloody good! The Test Match Special Live tour runs from April to May. Tickets at Fane. MORE : Shane Warne hits out at ‘pathetic’ Cricket Australia over Justin Langer exit MORE : Middlesex cricket chairman Mike O’Farrell slammed for saying ‘black people prefer football’ at racism inquiry","pubDate":"2022-02-17 13:59:55","full_description":"The ex-cricketer, 55, on a Test Match Special tour, writing a book during lockdown and launching his own wine label. Lots of fun. We’re going up and down the country with Aggers [Jonathan Agnew] and the team and lots of anecdotes. We’ll take people inside the commentary box and show them some never-before-seen footage. We’ve got some well-known people and cricketers popping in to tell their experiences. And I’m sure we’re going to be talking about the Ashes disaster. TMS has been going a long time and has been a huge part of my life. I remember listening to it with my dad, stuck in a traffic jam going down to Brighton on a summer’s day. It’s probably my first experience of cricket, actually, listening to the iconic voices of Johnners [Brian Johnston] and John Arlott wafting over the airwaves. So I feel very privileged to be a part of such an iconic radio show. That’s the first time anyone has asked me if I have a commentary style! I just turn up and get very excited about the game. It’s obviously a passion of mine, having played for 20 years professionally at the highest level. You just go with the buzz and if it’s raining, you have a little chat about something else. I think your own style comes out. I usually do the colour — I’m not the ball-by-ball commentator, I’m the analyst. But when Aggers was interviewing Russell Crowe, that was quite exciting. Usually, I leave it to Aggers and have a bit of lunch but on this occasion I skipped lunch. Russell was standing there and said, ‘Hello, Tuffers!’ I thought, ‘He’s Gladiator and he’s just gone, “Hello, Tuffers!”’ They do. You’ve got to have a little bit of good fortune to be at the right place at the right time. It also comes down to the passion for the game. A little bit. I went into the jungle all those years ago and was very fortunate to win it. Radio is completely different to being in front of the camera and is a lovely way to express yourself without the pressures of a TV camera on you. You don’t have to shave every morning or comb your hair quite so much. It gave me something to do. I did that with a co-writer on Zoom and I penned a few things down on days when everything was shut down. That was quite cathartic and it also got me out of painting the shed. I’ve done a few books now and find them great fun to do. It’s amazing what you forget so to trawl back through scrapbooks, all these things pop back into your memory and you start chuckling to yourself. That first time I pulled on the England jersey. It doesn’t get much better than that, really. Yes, I think so. It’s very tough to get the best out yourself when everything’s in your favour, never mind when you’re having to be locked in and go through quarantines. So to perform the way they have in some of the games has been incredible. When I was playing, it was 16 fellows going off with a coach and a physio. Now they’ve got more backroom staff than players! Psychologists, analysts, strength and conditioning, dieticians… They have everything to make them the best cricketer they can be, when in our day we’d go down the bar and have a word with the senior players. Your daily horoscope for Thursday, February 17, 2022 'Men only seem to want me for sex - is there something wrong with me?' Tess Daly ‘refuses to count calories’ and reveals the secret to her energy Australia have a great bowling unit, which always helps because in order to win Test matches you’ve got to take 20 wickets. We seem to be lacking in the batting department but we’ve got a fabulous white-ball team. We need to address the Test matches. I’ve launched a range of wine called Tuffers’ Tipple. A friend of mine said, ‘Let’s get some wines together!’ I thought that was a great idea. It was fun tasting and blending and creating wines that suit my lifestyle and taste. They’re like my children, the Sauvignons, Bacchuses and Shirazes. I’m very proud of what we’ve come up with — they taste bloody good! The Test Match Special Live tour runs from April to May. Tickets at Fane . MORE : Shane Warne hits out at ‘pathetic’ Cricket Australia over Justin Langer exit MORE : Middlesex cricket chairman Mike O’Farrell slammed for saying ‘black people prefer football’ at racism inquiry","image_url":"https://metro.co.uk/wp-content/uploads/2022/02/SEI_88552013_1645096411.166.jpg?quality=90&strip=all","source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"\"It's What The Team Requires\": Rohit Sharma On Why Talented Batter Wasn't Picked In India's 1st T20I.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy13ZXN0LWluZGllcy0yMDIyL3JvaGl0LXNoYXJtYS1leHBsYWlucy13aHktdGFsZW50ZWQtYmF0dGVyLXdhc250LXBpY2tlZC1pbi1pbmRpYXMtMXN0LXQyMGktdnMtd2VzdC1pbmRpZXMtMjc3NDAwNdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"It's What The Team Requires\": Rohit Sharma On Why Talented Batter Wasn't Picked In India's 1st T20I..  NDTV SportsRavi Bishnoi is a very talented guy, has got a bright future ahead: Rohit Sharma  CricTrackerRecent Match Report - West Indies vs India 1st T20I 2021/22  ESPNcricinfo.comWatch: Rohit Sharma Takes DRS After Virat Kohli Says \"Do Awaz Hai\". Then Umpire Does This In India vs West Indies 1st T20I | Cricket News  NDTV SportsIND beat WI: Pollard unhappy with ball condition after dew  InsideSportView Full coverage on Google News","content":null,"pubDate":"2022-02-17 12:28:26","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"\"It's What The Team Requires\": Rohit Sharma On Why Talented Batter Wasn't Picked In India's 1st T20I.. - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy13ZXN0LWluZGllcy0yMDIyL3JvaGl0LXNoYXJtYS1leHBsYWlucy13aHktdGFsZW50ZWQtYmF0dGVyLXdhc250LXBpY2tlZC1pbi1pbmRpYXMtMXN0LXQyMGktdnMtd2VzdC1pbmRpZXMtMjc3NDAwNdIBmAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy13ZXN0LWluZGllcy0yMDIyL3JvaGl0LXNoYXJtYS1leHBsYWlucy13aHktdGFsZW50ZWQtYmF0dGVyLXdhc250LXBpY2tlZC1pbi1pbmRpYXMtMXN0LXQyMGktdnMtd2VzdC1pbmRpZXMtMjc3NDAwNS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"It's What The Team Requires\": Rohit Sharma On Why Talented Batter Wasn't Picked In India's 1st T20I..  NDTVSports.comRecent Match Report - West Indies vs India 1st T20I 2021/22  ESPNcricinfo.comRavi Bishnoi is a very talented guy, has got a bright future ahead: Rohit Sharma  CricTrackerWatch: Rohit Sharma Takes DRS After Virat Kohli Says \"Do Awaz Hai\". Then Umpire Does This In India vs West Indies 1st T20I | Cricket News  NDTV Sports2nd T20I: Clinical India aim to seal series against West Indies  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-02-17 12:28:26","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"New Cricket Australia chair Lachlan Henderson reaches out to former Test coach Justin Langer","link":"https://thewest.com.au/sport/cricket/wa-cricket-boss-christina-matthews-welcomes-election-of-was-lachlan-henderson-as-cricket-australia-chairman--c-5737552","keywords":null,"creator":["AAP and Braden Quartermaine"],"video_url":null,"description":"New Cricket Australia chair Lachlan Henderson has extended an olive branch to Justin Langer and declared a new era of transparency after the former WA doctor was elected to the top job.","content":null,"pubDate":"2022-02-17 12:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5737552/b7f2613d99caee7fda43a11b6d24e4d503e6e8e4-16x9-x1y0w2446h1376.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ind vs WI Dream11 Prediction Today: Fantasy cricket tips for India vs West Indies 2nd T20I match, Kolkata","link":"https://www.indiatvnews.com/sports/cricket/india-vs-west-indies-dream11-prediction-fantasy-cricket-tips-india-playing-xi-pitch-report-injury-update-ind-vs-wi-2nd-t20i-2022-02-17-760157","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI, 2nd T20I Dream11 prediction: Fantasy cricket tips India vs West Indies; Playing XI India will take on West Indies in the 2nd T20I Match of the ongoing West Indies tour of India, 2022. The game will take place at Eden gardens, Kolkata.","content":null,"pubDate":"2022-02-17 11:56:06","full_description":"India vs West Indies, 2nd T20I Match Eden gardens, Kolkata 7:00 PM IST Ishan Kishan, (c), , Rishabh Pant (wk), Harshal Patel, Ravi Bishnoi, , Nicholas Pooran, Kieron Pollard, , Odean Smith. Ishan Kishan, Rohit Sharma (c), Virat Kohli, Suryakumar Yadav/Shreyas Iyer, Rishabh Pant (wk), Venkatesh Iyer, Deepak Chahar, Ravi Bishnoi, Harshal Patel, Mohammed Siraj, Yuzvendra Chahal. Brandon King, Kyle Mayers, Nicholas Pooran (wk), Rovman Powell, Kieron Pollard (c), Jason Holder, Fabian Allen, Romario Shepherd, Odean Smith, Akeal Hosein, Sheldon Cottrell/Dominic Drakes. Ishan Kishan, Rohit Sharma(c), Virat Kohli, Suryakumar Yadav, Shreyas Iyer, Rishabh Pant(w), Venkatesh Iyer, Deepak Chahar, Shardul Thakur, Harshal Patel, Mohammed Siraj, Yuzvendra Chahal, , , Deepak Hooda, Avesh Khan, Ruturaj Gaikwad, Ravi Bishnoi Brandon King, Kyle Mayers, Nicholas Pooran(w), Rovman Powell, Kieron Pollard(c), Jason Holder, Fabian Allen, Romario Shepherd, Odean Smith, Akeal Hosein, Sheldon Cottrell, Dominic Drakes, Darren Bravo, , Roston Chase, Hayden Walsh. The second match of the three-match T20I series between India and West Indies will be played on Friday, February 18. The second T20I match between India vs West Indies will be played at the Eden Gardens Stadium in Kolkata. The 2nd T20I match between India and West Indies will start at 7:00 PM IST. The toss will take place half an hour before the start of the match i.e. at 6;30 PM IST. India vs West Indies 2nd T20I match will be aired live on Star Sports channels - Star Sports 1, Star Sports 1 HD, Star Sports 1 Hindi, Star Sports 1 Hindi HD, Star Sports 1 Tamil, Star Sports 1 Telugu, and Star Sports 1 Kannada. The online streaming of India vs West Indies 2nd T20I match will be available on the Hotstar app and the website.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia vs Sri Lanka 4th T20I Live Cricket Score Streaming Online: When and where to watch match live?","link":"https://indianexpress.com/article/sports/cricket/aus-vs-sl-4th-t20i-live-streaming-tv-channel-time-ist-7778525/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-17 11:43:44","full_description":"LIVE Stream Australia vs Sri Lanka match Online: Sri Lanka will take on Australia in the 4th T20I on Friday in order to salvage some pride, having already conceded the 5-match series to the hosts, who at the moment lead by 3-0. On Tuesday, Glenn Maxwell and Aaron Finch shared a 50-run third-wicket stand to guide Australia toward a six-wicket win in the third Twenty20 cricket international, clinching the five-match series with two games to spare. Australia won the first game by 20 runs and the second in a Super Over in Sydney on Sunday after the scores were level at the end of the regulation overs. Sri Lanka scored 18 in the last over of that game to gain some confidence but, after scoring 17 in the first two overs at Canberra’s Manuka Oval, struggled against the Australian bowling attack. Squads: https://images.indianexpress.com/2020/08/1x1.png Australia: Aaron Finch (c), Ben McDermott, Josh Inglis, Glenn Maxwell, Moises Henriques, Marcus Stoinis , Matthew Wade (wk), Pat Cummins, Kane Richardson, Adam Zampa , Josh Hazlewood. Sri Lanka: Pathum Nissanka, Danushka Gunathilaka, Charith Asalanka, Avishka Fernando, Dinesh Chandimal (wk), Dasun Shanaka (c), Wanindu Hasaranga, Chamika Karunaratne, Dushmantha Chameera, Maheesh Theekshana, Nuwan Thushara Where is Australia vs Sri Lanka 4th T20I match being played? The Australia vs Sri Lanka 4th T20I will take place at the Melbourne Cricket Ground, Melbourne. At what time does Australia vs Sri Lanka 4th T20I match start? The Australia vs Sri Lanka 4th T20I begins at 1:40 PM IST on Friday (February 18). Where to watch the live coverage of the Australia vs Sri Lanka 4th T20I match? The Australia vs Sri Lanka 4th T20I will be aired live on Sony Six & Sony Six HD (English) channels. How to watch Australia vs Sri Lanka 4th T20I match online? The online streaming of the Australia vs Sri Lanka 4th T20I will be available on the Sonyliv app and the website.","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Young star credits core strength","link":"https://www.news.com.au/sport/cricket/young-star-credits-core-strength/video/6d927c7c4d86a2c443fd9b4fc3cd75ec","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Darcie Brown has revealed core strength training has been key to her high performance as a fast bowler.","content":null,"pubDate":"2022-02-17 11:40:09","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Wide kidhar de rha hai yaar’: Rohit gets agitated with umpire’s decision; stump-mic catches conversation between Rohit and Kohli","link":"https://www.tribuneindia.com/news/sports/wide-kidhar-de-rha-hai-yaar-rohit-gets-agitated-with-umpires-decision-stump-mic-catches-conversation-between-rohit-and-kohli-370737","keywords":null,"creator":null,"video_url":null,"description":"Chandigarh, February 17High sensitivity of stump-mic have provided cricket lovers with the conversation and key decisions that takes place on the ground. Most of the time, spectators excessive cheering gets overpowered and the conversation on the ground cannot be recorded properly.A similar incident took place where conversation between Indian players on ground was recorded during first T20| of the series at Eden Gardens. Debutant Ravi Bishnoi of Indian side made a strong appeal for a caught-behind against Roston Chase. The umpire turned down the appeal and the aftermath was recorder in stump-mic, where Indian skipper Rohit Sharma seemed dissatisfied with umpire over giving the delivery a wide.As soon as the delivery was given wide, Rohit yelled, \"Wide kidhar de raha hai yaar!\" (How is he calling this a wide!).pic.twitter.com/zUFGUyYiYb— Maqbool (@im_maqbool) February 16, 2022This further followed a discussion between Rohit Sharma and Virat Kohli, who insisted the skipper to take review as the latter claims to have heard two voices (probably ball hitting the bat or pad). The player was given not out but umpire had to overturn the decision of wide, as the ball had deflected off the pad.Restricting the Windies to 157/7 in 20 overs, India chased down the target with seven deliveries to spare.","content":null,"pubDate":"2022-02-17 11:32:58","full_description":"Tribune Web Desk Chandigarh, February 17 High sensitivity of stump-mic have provided cricket lovers with the conversation and key decisions that takes place on the ground. Most of the time, spectators excessive cheering gets overpowered and the conversation on the ground cannot be recorded properly. A similar incident took place where conversation between Indian players on ground was recorded during first T20| of the series at Eden Gardens. Debutant Ravi Bishnoi of Indian side made a strong appeal for a caught-behind against Roston Chase. The umpire turned down the appeal and the aftermath was recorder in stump-mic, where Indian skipper Rohit Sharma seemed dissatisfied with umpire over giving the delivery a wide. As soon as the delivery was given wide, Rohit yelled, “Wide kidhar de raha hai yaar!” (How is he calling this a wide!). pic.twitter.com/zUFGUyYiYb This further followed a discussion between Rohit Sharma and Virat Kohli, who insisted the skipper to take review as the latter claims to have heard two voices (probably ball hitting the bat or pad). The player was given not out but umpire had to overturn the decision of wide, as the ball had deflected off the pad. Restricting the Windies to 157/7 in 20 overs, India chased down the target with seven deliveries to spare. #indiavswindies #rohit sharma","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_2103344602.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India Women vs New Zealand Women 3rd ODI Live Streaming: When and Where to Watch IND-W vs NZ-W match Live","link":"https://www.indiatvnews.com/sports/cricket/india-women-vs-new-zealand-women-3rd-odi-live-streaming-when-and-where-to-watch-ind-vs-nz-live-in-india-online-tv-2022-02-17-760146","keywords":null,"creator":null,"video_url":null,"description":"India Women vs New Zealand Women 3rd ODI Live Streaming: When and Where to Watch IND-W vs NZ-W match Live in India NZ-W vs IN-W 3rd ODI Dream11 Prediction: Fantasy Cricket Tips for India Women vs New Zealand Women The Indian women's cricket team will get to fine-tune its ODI World Cup preparations in a six-game limited-overs series against hosts New Zealand by playing in the 3rd ODI match in Queenstown on Friday","content":null,"pubDate":"2022-02-17 11:01:04","full_description":"The 3rd ODI match between India women and New Zealand women will take place on 18 February 2022. India women vs New Zealand women's 3rd ODI match will be played at John Davies Oval in Queenstown. The match will start at 3:30 am IST. The toss between India women vs New Zealand women will take place at 3:00 AM IST. There will be no LIVE telecast of the match on TV. The match will be LIVE streamed on Amazon Prime Video. Sabbhineni Meghana, Shafali Verma, Yastika Bhatia, (c), , Richa Ghosh (w), , , Simran Bahadur, , Rajeshwari Gayakwad. Suzie Bates, Maddy Green, Amelia Kerr, Amy Satterthwaite (c), Sophie Devine, Katey Martin (w), Brooke Halliday, Hayley Jensen, Jess Kerr, Rosemary Mair, Fran Jonas. Suzie Bates, Sophie Devine (c), Amy Satterthwaite, Maddy Green, Katey Martin (w), Amelia Kerr, Brooke Halliday, Hayley Jensen, Hannah Rowe, Jess Kerr, Lea Tahuhu, Fran Jonas, Rosemary Mair, Lauren Down, Frances Mackay , Shafali Verma, Harmanpreet Kaur (c), Yastika Bhatia, Richa Ghosh (w), Pooja Vastrakar, Deepti Sharma, Rajeshwari Gayakwad, Poonam Yadav, Renuka Singh, , Sneh Rana, Sabbhineni Meghana, Meghna Singh, , Simran Bahadur .","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"ISL vs PES Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s PSL 2022 Match No.24 at Gaddafi Stadium, Lahore, 8:00 PM IST February 17","link":"https://zeenews.india.com/cricket/isl-vs-pes-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-psl-2022-match-no-24-at-gaddafi-stadium-lahore-800-pm-ist-february-17-2437383.html","keywords":null,"creator":null,"video_url":null,"description":"Islamabad United vs Peshawar Zalmi Dream11 Team Prediction Islamabad United vs Peshawar Zalmi Match No. 24 - Check My Dream11 Team, Best players list of ISL vs PES, Islamabad United Dream11 Team Player List, Peshawar Zalmi Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Pakistan Super League 2022, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-02-17 11:01:00","full_description":null,"image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Today on Pinstripe Alley - 2/17/22","link":"https://www.pinstripealley.com/2022/2/17/22936534/yankees-mlb-pinstripe-alley-2-17-22","keywords":null,"creator":["Andrew Mearns"],"video_url":null,"description":null,"content":"Photo by Justin Setterfield/Getty Images Opening Day creeps one Thursday closer with no end to the lockout in sight. Happy Thursday. We have slightly better CBA news than we normally do, as there is supposed to be a meeting today between MLB and the MLBPA. The players’ union will present a proposal this afternoon. To be clear, I fully expect the owners to reject it, but hey, better to be meeting than not, I suppose. Today on the site, Jon will begin a two-parter on the worst seasons in Yankees history by position, Jesse will make a modest proposal about what MLB might slash next after attempting to cut many minor league jobs, and John will look back on a recent signing that was a stroke of brilliance: DJ LeMahieu’s first contract. Later on, Matt will detail Babe Ruth’s forgotten-but-amusing dalliance with cricket, and John will break down Aaron Judge and Giancarlo Stanton’s performances based on lineup construction in 2021. Fun Questions: 1. Were you one of the lucky fans who got to see the Yankees play the Red Sox in London back in 2019? 2. Have you ever watched cricket?","pubDate":"2022-02-17 11:00:00","full_description":"Happy Thursday. We have slightly better CBA news than we normally do, as there is supposed to be a meeting today between MLB and the MLBPA. The players’ union will present a proposal this afternoon. To be clear, I fully expect the owners to reject it, but hey, better to be meeting than not, I suppose. Today on the site, Jon will begin a two-parter on the worst seasons in Yankees history by position, Jesse will make a modest proposal about what MLB might slash next after attempting to cut many minor league jobs, and John will look back on a recent signing that was a stroke of brilliance: DJ LeMahieu’s first contract. Later on, Matt will detail Babe Ruth’s forgotten-but-amusing dalliance with cricket, and John will break down Aaron Judge and Giancarlo Stanton’s performances based on lineup construction in 2021. 1. Were you one of the lucky fans who got to see the Yankees play the Red Sox in London back in 2019? 2. Have you ever watched cricket?","image_url":null,"source_id":"pinstripealley","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"NRL inks deal with crypto company","link":"https://wwos.nine.com.au/nrl/nrl-2022-league-signs-deal-with-crypto-currency-exchange-swyftx/f44006dc-497b-456d-bdfe-0b91f197af60","keywords":null,"creator":["wwos"],"video_url":null,"description":"The NRL has become the latest sporting organisation to formally make links with the cryptocurrency industry.","content":"The NRL has become the latest sporting organisation to formally make links with the cryptocurrency industry, today announcing a sponsorship deal with exchange company Swyftx.The three-year deal is reportedly worth more than the AFL's $25 million deal with the same company, and will include naming rights to the 'Bunker' from 2023.\"This is a defining partnership for the NRL and Swyftx and represents a major milestone for the Australian crypto industry,\" the company's CEO Ryan Parsons said.LIVE UPDATES: US commentators' deafening silence during Russian skater's performanceREAD MORE: Aussie matches feat last seen in NBA 61 years agoREAD MORE: Stunning 90-year low rocks South Africa cricket\"Our Brisbane office overlooks the cauldron, Suncorp Stadium, and many of our staff walk to the ground after work to watch the NRL or State of Origin.\"The crypto and NFT spaces have been rapidly expanding in the past couple of years, with plenty of NRL players already involved with various coins and tokens.Late last year, Rabbitohs fullback Latrell Mitchell said he was working with NFT platform Stadio to promote tokens based off his uncle's paintings, as well as his own likeness.\"We're excited to welcome Swyftx as a major partner. Swyftx is an Australian business that operates on a global scale and there are unique ways for our partnership to benefit both organisations,'' NRL boss Andrew Abdo said.\"We have a diverse fan base and Swyftx brings an opportunity to promote the game to a wide audience.\"However, the technology is not without its criticisms. Some view the space, and the volatility that comes with its trading, as a form of gambling - targeting young men in an industry that is already saturated with sports betting advertisements.One leading gambling reform advocate, Reverend Tim Costello, told The Sydney Morning Herald it was \"a bad move\".\"Young men are very susceptible and this is immediately available to them which is very dangerous,\" he said.Reports from aggregation website CoinGecko in late 2021 said that the current combined market value of all cryptocurrency had tripled in 11 months, going from $1 trillion USD in January to $3 trillion USD in November.However, that has now again dropped below $2 trillion USD at time of writing.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-17 10:42:06","full_description":"The NRL has become the latest sporting organisation to formally make links with the cryptocurrency industry, today announcing a sponsorship deal with exchange company Swyftx. The three-year deal is reportedly worth more than the AFL's $25 million deal with the same company, and will include naming rights to the 'Bunker' from 2023. \"This is a defining partnership for the NRL and Swyftx and represents a major milestone for the Australian crypto industry,\" the company's CEO Ryan Parsons said. LIVE UPDATES: US commentators' deafening silence during Russian skater's performance READ MORE: Aussie matches feat last seen in NBA 61 years ago READ MORE: Stunning 90-year low rocks South Africa cricket \"Our Brisbane office overlooks the cauldron, Suncorp Stadium, and many of our staff walk to the ground after work to watch the NRL or State of Origin.\" The crypto and NFT spaces have been rapidly expanding in the past couple of years, with plenty of NRL players already involved with various coins and tokens. Late last year, Rabbitohs fullback Latrell Mitchell said he was working with NFT platform Stadio to promote tokens based off his uncle's paintings, as well as his own likeness . \"We're excited to welcome Swyftx as a major partner. Swyftx is an Australian business that operates on a global scale and there are unique ways for our partnership to benefit both organisations,'' NRL boss Andrew Abdo said. \"We have a diverse fan base and Swyftx brings an opportunity to promote the game to a wide audience.\" However, the technology is not without its criticisms. Some view the space, and the volatility that comes with its trading, as a form of gambling - targeting young men in an industry that is already saturated with sports betting advertisements. One leading gambling reform advocate, Reverend Tim Costello, told The Sydney Morning Herald it was \"a bad move\" . \"Young men are very susceptible and this is immediately available to them which is very dangerous,\" he said. Reports from aggregation website CoinGecko in late 2021 said that the current combined market value of all cryptocurrency had tripled in 11 months, going from $1 trillion USD in January to $3 trillion USD in November. However, that has now again dropped below $2 trillion USD at time of writing. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/411842/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"'Big three' to be rested by Australia","link":"https://wwos.nine.com.au/cricket/australia-v-sri-lanka-t20-josh-hazlewood-pat-cummins-and-mitchell-starc-to-miss-remainder-of-series/b958195e-f9c8-40bf-81d5-8920476c6dcb","keywords":null,"creator":["wwos"],"video_url":null,"description":"Australia will rest their three top fast bowlers for the remainder of the T20 series against Sri Lanka, giving them some much-needed rest.","content":"Australia will rest their three top fast bowlers for the remainder of the T20 series against Sri Lanka, giving them some much-needed rest before the tour of Pakistan. Mitchell Starc, Pat Cummins, and Josh Hazlewood will all miss tomorrow's fourth game and Sunday's finale - Australia have already taken an unassailable 3-0 lead across the opening matches. \"Between Starc and Cummins, they've had a huge workload on the back of the World Cup and then a five-Test match Ashes series,\" captain Aaron Finch told reporters today. LIVE UPDATES: US commentators' deafening silence during Russian skater's performanceREAD MORE: Aussie matches feat last seen in NBA 61 years agoREAD MORE: Stunning 90-year low rocks South Africa cricket\"Josh coming back off a bit of injury and all them going to Pakistan shortly, we felt as though it was really important for them to be able to stay at home and get out of the bubble for a day or two, just to connect with family and friends.\"That was a no-brainer.\"Finch said Jhye Richardson would get the nod, with Adam Zampa also returning to the side after being rested for Tuesday's series-clinching win. Australia's T20 form is red-hot, coming off a World Cup win late last year - although they won't get long as the champions before having to defend their trophy on home soil in October. \"You always tend to have an eye towards ICC events and the fact that the final is here and that it's my that's my home ground personally,\" Finch said.\"I've got some great memories here and a lot of the guys in the last World Cup squad did as well because we had the success of the 2015 ODI World Cup here.\"You can think about it, and dream about it, but the reality of it is a little bit different still,\" he said of winning the tournament in Australia. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-17 10:07:22","full_description":"Australia will rest their three top fast bowlers for the remainder of the T20 series against Sri Lanka, giving them some much-needed rest before the tour of Pakistan. Mitchell Starc, Pat Cummins, and Josh Hazlewood will all miss tomorrow's fourth game and Sunday's finale - Australia have already taken an unassailable 3-0 lead across the opening matches. \"Between Starc and Cummins, they've had a huge workload on the back of the World Cup and then a five-Test match Ashes series,\" captain Aaron Finch told reporters today. LIVE UPDATES: US commentators' deafening silence during Russian skater's performance READ MORE: Aussie matches feat last seen in NBA 61 years ago READ MORE: Stunning 90-year low rocks South Africa cricket \"Josh coming back off a bit of injury and all them going to Pakistan shortly, we felt as though it was really important for them to be able to stay at home and get out of the bubble for a day or two, just to connect with family and friends. \"That was a no-brainer.\" Finch said Jhye Richardson would get the nod, with Adam Zampa also returning to the side after being rested for Tuesday's series-clinching win . Australia's T20 form is red-hot, coming off a World Cup win late last year - although they won't get long as the champions before having to defend their trophy on home soil in October. \"You always tend to have an eye towards ICC events and the fact that the final is here and that it's my that's my home ground personally,\" Finch said. \"I've got some great memories here and a lot of the guys in the last World Cup squad did as well because we had the success of the 2015 ODI World Cup here. \"You can think about it, and dream about it, but the reality of it is a little bit different still,\" he said of winning the tournament in Australia. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://prod.static9.net.au/fs/ed97fc0f-5281-43f8-914c-daa2e0086654","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"England women's team trying to refocus on World Cup after Ashes loss: Knight","link":"https://www.sentinelassam.com/sports-news/england-womens-team-trying-to-refocus-on-world-cup-after-ashes-loss-knight-578756","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"England women’s cricket captain Heather Knight has said that her team was trying to “refocus after an Ashes series that didn’t go our way”, and added that she was looking forward to the ICC Women’s World Cup, scheduled to commence here from March 4.","content":"AUCKLAND: England women's cricket captain Heather Knight has said that her team was trying to \"refocus after an Ashes series that didn't go our way\", and added that she was looking forward to the ICC Women's World Cup, scheduled to commence here from March 4.In her column for the ICC on Wednesday, Knight said that the girls were looking forward to completing their mandatory quarantine and begin their training in right earnest for the showpiece event, to be held at six venues across New Zealand. \"As a group, we need to reset and refocus after an Ashes series that didn't go our way. I was really pleased with how we started the series. We went toe to toe with Australia and heading into the ODI leg of the series, the scoreline could easily have been different to the 6-4 deficit we found ourselves facing. As it was, there just wasn't enough mental energy to go back to the well and fight back in the ODI series,\" admitted the 31-year-old Knight. Hosts Australia emerged 12-4 winners in the recently-concluded multi-format Ashes series and Knight said the aim now was to do well in the upcoming cricketing carnival despite a far-from-normal scenario. \"It's pretty surreal to feel so near to a World Cup and yet so far away! Throwing rolled up socks into your bed to keep ticking over wasn't how I imagined our build-up for this tournament back in 2017 but an awful lot has happened in the world since then. As I write this, we're on day five of our quarantine and we're not far away from being let out, thanks to the New Zealand Government's change of isolation rules! \"We're obviously looking forward to being allowed back out to train. Some of us cope better than others in quarantine but we've been trying to keep busy. We've been up to our eyebrows in crosswords, Sophie Ecclestone has been running HIIT classes on Zoom, Freya Davies organised a brilliant quiz (including 'Guess the baby picture', which was brilliant) and I've taken some inspiration from watching a documentary on the first all-female crew to take part in the Whitbread Round the World Race,\" said Knight. She conceded that the multi-format Ashes series against Australia had taken a toll on the team, but added that despite the losses there was a lot to learn and implement in the Women's World Cup. IANS Also Read: Maxwell to miss Pakistan tourAlso Watch:","pubDate":"2022-02-17 09:29:57","full_description":"AUCKLAND: England women's cricket captain Heather Knight has said that her team was trying to \"refocus after an Ashes series that didn't go our way\", and added that she was looking forward to the ICC Women's World Cup, scheduled to commence here from March 4. In her column for the ICC on Wednesday, Knight said that the girls were looking forward to completing their mandatory quarantine and begin their training in right earnest for the showpiece event, to be held at six venues across New Zealand. \"As a group, we need to reset and refocus after an Ashes series that didn't go our way. I was really pleased with how we started the series. We went toe to toe with Australia and heading into the ODI leg of the series, the scoreline could easily have been different to the 6-4 deficit we found ourselves facing. As it was, there just wasn't enough mental energy to go back to the well and fight back in the ODI series,\" admitted the 31-year-old Knight. Hosts Australia emerged 12-4 winners in the recently-concluded multi-format Ashes series and Knight said the aim now was to do well in the upcoming cricketing carnival despite a far-from-normal scenario. \"It's pretty surreal to feel so near to a World Cup and yet so far away! Throwing rolled up socks into your bed to keep ticking over wasn't how I imagined our build-up for this tournament back in 2017 but an awful lot has happened in the world since then. As I write this, we're on day five of our quarantine and we're not far away from being let out, thanks to the New Zealand Government's change of isolation rules! \"We're obviously looking forward to being allowed back out to train. Some of us cope better than others in quarantine but we've been trying to keep busy. We've been up to our eyebrows in crosswords, Sophie Ecclestone has been running HIIT classes on Zoom, Freya Davies organised a brilliant quiz (including 'Guess the baby picture', which was brilliant) and I've taken some inspiration from watching a documentary on the first all-female crew to take part in the Whitbread Round the World Race,\" said Knight. She conceded that the multi-format Ashes series against Australia had taken a toll on the team, but added that despite the losses there was a lot to learn and implement in the Women's World Cup. IANS Also Read: Maxwell to miss Pakistan tour Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/17/313856-eng.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: Yash Dhull smashes century on first-class debut","link":"https://timesofindia.indiatimes.com/sports/cricket/news/ranji-trophy-u-19-world-cup-winning-captain-yash-dhull-smashes-century-on-first-class-debut/articleshow/89638681.cms","keywords":null,"creator":null,"video_url":null,"description":"Delhi batter Yash Dhull on Thursday registered a century on his first-class debut in the ongoing Ranji Trophy Elite Group H contest. Dhull scored a ton against Tamil Nadu in the ongoing Elite Group H contest here at the Barsapara Cricket Stadium, Guwahati.","content":null,"pubDate":"2022-02-17 09:29:34","full_description":null,"image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Maxwell to miss Pakistan tour","link":"https://www.sentinelassam.com/sports-news/maxwell-to-miss-pakistan-tour-578751","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Australian cricketer Glenn Maxwell has confirmed he will miss the Pakistan tour, and will also likely miss the start of the IPL 2022, due to his upcoming wedding with his Indian-origin finance Vini Raman in late March.","content":"CANBERRA: Australian cricketer Glenn Maxwell has confirmed he will miss the Pakistan tour, and will also likely miss the start of the IPL 2022, due to his upcoming wedding with his Indian-origin finance Vini Raman in late March. The 33-year old Maxwell, who is in the frame to captain Royal Challengers Bangalore this season, had flagged publicly after the T20 World Cup in November last year that he would miss the Pakistan tour due to his wedding in late March.However, given the early start to the IPL season, Maxwell, who still will be in Melbourne due for his wedding, will likely miss the beginning of the cash-rich league. He explained to the host broadcaster Fox Cricket during the third T20I against Sri Lanka that the clash was unavoidable due to the constant schedule changes, despite consulting Cricket Australia. \"Originally when I organised the dates with CA there was a two-week gap where I could potentially have it,\" Maxwell said. \"So when I sorted that out I was pretty happy that I wasn't going to be missing in any series. And then I came to the [CA] contract meeting midway through last year and they said well this is [when] the Pakistan series [is on] and I thought well obviously that's changed since the last conversation we had,\" he added. IANS Also Read: BCCI wants 'collective vision' as work on new NCA facility beginsAlso Watch:","pubDate":"2022-02-17 09:23:17","full_description":"CANBERRA: Australian cricketer Glenn Maxwell has confirmed he will miss the Pakistan tour, and will also likely miss the start of the IPL 2022, due to his upcoming wedding with his Indian-origin finance Vini Raman in late March. The 33-year old Maxwell, who is in the frame to captain Royal Challengers Bangalore this season, had flagged publicly after the T20 World Cup in November last year that he would miss the Pakistan tour due to his wedding in late March. However, given the early start to the IPL season, Maxwell, who still will be in Melbourne due for his wedding, will likely miss the beginning of the cash-rich league. He explained to the host broadcaster Fox Cricket during the third T20I against Sri Lanka that the clash was unavoidable due to the constant schedule changes, despite consulting Cricket Australia. \"Originally when I organised the dates with CA there was a two-week gap where I could potentially have it,\" Maxwell said. \"So when I sorted that out I was pretty happy that I wasn't going to be missing in any series. And then I came to the [CA] contract meeting midway through last year and they said well this is [when] the Pakistan series [is on] and I thought well obviously that's changed since the last conversation we had,\" he added. IANS Also Read: BCCI wants 'collective vision' as work on new NCA facility begins Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/17/313852-clipboard-2022-02-16t030714554-1082030-1644961113.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Hopefully we can start well on day one: Wagner","link":"https://www.sentinelassam.com/sports-news/hopefully-we-can-start-well-on-day-one-wagner-578749","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"New Zealand left-arm pacer Neil Wagner is hopeful of his team commencing the Test series against South Africa on a good note. He also hoped that the pitch at the Hagley Oval plays out the way it typically does.","content":"CHRISTCHURCH: New Zealand left-arm pacer Neil Wagner is hopeful of his team commencing the Test series against South Africa on a good note. He also hoped that the pitch at the Hagley Oval plays out the way it typically does.New Zealand will face a formidable challenge from South Africa when the first of the two Tests begins from Thursday. \"It's looking pretty good at the moment. It's just a typical Hagley wicket really, sort of what we expect from playing down here. There was a bit of sun on it yesterday, so yeah, the covers will be on it now which we obviously prefer, but it looks like a typical wicket. \"We know the conditions here, hopefully we can start well on day one and exploit those conditions, and keep doing what we've been doing for a number of years,\" said Wagner on SENZ Mornings show. Talking further about the challenges posed by the pitch at the Hagley Oval, Wagner remarked, \"It's right up there with one of the top three bounciest wickets in the world. So as a bowler, you like those conditions when it's nice and bouncy. We do love to play here, and we've got a pretty good record here which we are very proud of and hopefully can continue to do.\" Wagner, one of the four pillars of New Zealand's pace attack, feels that pacer and local Canterbury lad Matt Henry will be an excellent replacement for left-arm pacer Trent Boult, who is unavailable due to the birth of his third child. \"Matt has been around the squad for years now, so he knows what is required of him when he comes in, and so do the rest of them. It's just about us summing up the conditions really early, sharing that information, and adapting to what is in front of us.\" Wagner, 35, more known for his role as an enforcer late in the innings, revealed that he is frustrated with cricket watchers not recognising that he can swing the ball well too. IANS Also Read: 13 Dead After Falling Into Well While Performing Pre-Wedding Ritual In UP's KushinagarAlso Watch:","pubDate":"2022-02-17 09:19:06","full_description":"CHRISTCHURCH: New Zealand left-arm pacer Neil Wagner is hopeful of his team commencing the Test series against South Africa on a good note. He also hoped that the pitch at the Hagley Oval plays out the way it typically does. New Zealand will face a formidable challenge from South Africa when the first of the two Tests begins from Thursday. \"It's looking pretty good at the moment. It's just a typical Hagley wicket really, sort of what we expect from playing down here. There was a bit of sun on it yesterday, so yeah, the covers will be on it now which we obviously prefer, but it looks like a typical wicket. \"We know the conditions here, hopefully we can start well on day one and exploit those conditions, and keep doing what we've been doing for a number of years,\" said Wagner on SENZ Mornings show. Talking further about the challenges posed by the pitch at the Hagley Oval, Wagner remarked, \"It's right up there with one of the top three bounciest wickets in the world. So as a bowler, you like those conditions when it's nice and bouncy. We do love to play here, and we've got a pretty good record here which we are very proud of and hopefully can continue to do.\" Wagner, one of the four pillars of New Zealand's pace attack, feels that pacer and local Canterbury lad Matt Henry will be an excellent replacement for left-arm pacer Trent Boult, who is unavailable due to the birth of his third child. \"Matt has been around the squad for years now, so he knows what is required of him when he comes in, and so do the rest of them. It's just about us summing up the conditions really early, sharing that information, and adapting to what is in front of us.\" Wagner, 35, more known for his role as an enforcer late in the innings, revealed that he is frustrated with cricket watchers not recognising that he can swing the ball well too. IANS Also Read: 13 Dead After Falling Into Well While Performing Pre-Wedding Ritual In UP's Kushinagar Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/17/313850-wagner.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI wants 'collective vision' as work on new NCA facility begins","link":"https://www.sentinelassam.com/sports-news/bcci-wants-collective-vision-as-work-on-new-nca-facility-begins-578745","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) will be hoping the new National Cricket Academy (NCA), whose foundation stone was laid by secretary Jay Shah on February 14, will nurture talent and support the growing cricket ecosystem, as the country's players continue to bring back laurels -- the latest being the ICC U-19 Cricket World Cup triumph in the Caribbean.","content":"BENGALURU : The Board of Control for Cricket in India (BCCI) will be hoping the new National Cricket Academy (NCA), whose foundation stone was laid by secretary Jay Shah on February 14, will nurture talent and support the growing cricket ecosystem, as the country's players continue to bring back laurels -- the latest being the ICC U-19 Cricket World Cup triumph in the Caribbean.While laying the foundations stone in Bengaluru, Shah also said that only a \"collective vision\" will see Indian cricket rise to new heights. \"Laid the foundation stone for @BCCI's new NCA. It is our collective vision to have a Centre of Excellence which nurtures talent and supports the cricket ecosystem in India,\" tweeted Shah. BCCI president Sourav Ganguly also posted images of the proposed facility, which will become not just the country's but the world's biggest cricket-nurturing facility once it is completed. The BCCI had invited bids for turnkey design build construction services last year through a tender process. Among the things proposed at the new facility are a 16,000 square feet gymnasium, 40 practice pitches, including 20 having floodlight facility, 243 rooms of varying sizes, and an open-air theatre. According to the NCA blueprint, these and many other world-class facilities, such as indoor training facility comprising futsal, squash, badminton, basketball, tennis, cycling track and temperature-controlled pool. Ancillary provisions such as pharmacy, courier-dispatch facility, bank, ATM, salon, tuck shops will also come up on a 40-acre land in Devanahalli Taluk, near the Bengaluru international airport. The BCCI is keen to pursue a holistic approach for developing cricketers at the new NCA campus. The BCCI has secured the land on a 99-year lease from the Karnataka Industrial Areas Development Board (KIADB) for around INR 50 crore. The land issue couldn't be resolved through successive Karnataka state governments, and was finally registered in the name of the BCCI in 2017. Since the NCA's establishment in 2000, it has been running from the premises of the M. Chinnaswamy Stadium in the heart of Bengaluru. The Karnataka State Cricket Association (KSCA), which owns the stadium, has rented out to the BCCI its Ground B for outdoor practice, besides an indoor practice facility, and separate space for a modern gymnasium. In the first phase of construction, divided into five zones and the \"common facilities\" that spill into the second phase, one main ground, including ancillary facilities, administrative and pavilion block, and two practice grounds will be part of Zone-I. In Zone-II, outdoor training facility, including 40 practice pitches, multipurpose fielding area, swimming pool, and meeting rooms etc. will come up. A 16,000-square feet gymnasium, one acre outdoor facility, and all-weather indoor pitches will be the highlights of Zone-III. As part of Zone-IV, a residential block comprising 10 double occupancy rooms, 10 quad sharing dormitories, eight rooms for guests, central kitchen, and banquet facility will be built. And in Phase-II of the NCA project, a gallery structure to accommodate 7,500 spectators at the main ground, broadcasting and floodlight facilities for all practice grounds and extension of facilities in practice grounds will come up in Zone-I. Floodlights for 20 practice pitches and two tennis courts will be constructed as part of Zone-II. A small temperature-controlled indoor pool will be constructed under Zone-III. Zone-IV will see extension of the residential block, comprising 70 single-occupancy rooms, 120 double-occupancy rooms, 25 quad-sharing dormitories, and recreational facilities. Indoor training facility, consisting of futsal, squash, badminton, basketball courts, and office spaces will be part of Zone-V of the ambitious project. And in the final phase of the project, a creche, open-air theatre, pharmacy, salon, cycling track, ice cream and juice parlours, bank, tucks shops etc. will be built. IANS Also Read: 13 Dead After Falling Into Well While Performing Pre-Wedding Ritual In UP's KushinagarAlso Watch:","pubDate":"2022-02-17 09:11:34","full_description":"BENGALURU : The Board of Control for Cricket in India (BCCI) will be hoping the new National Cricket Academy (NCA), whose foundation stone was laid by secretary Jay Shah on February 14, will nurture talent and support the growing cricket ecosystem, as the country's players continue to bring back laurels -- the latest being the ICC U-19 Cricket World Cup triumph in the Caribbean. While laying the foundations stone in Bengaluru, Shah also said that only a \"collective vision\" will see Indian cricket rise to new heights. \"Laid the foundation stone for @BCCI's new NCA. It is our collective vision to have a Centre of Excellence which nurtures talent and supports the cricket ecosystem in India,\" tweeted Shah. BCCI president Sourav Ganguly also posted images of the proposed facility, which will become not just the country's but the world's biggest cricket-nurturing facility once it is completed. The BCCI had invited bids for turnkey design build construction services last year through a tender process. Among the things proposed at the new facility are a 16,000 square feet gymnasium, 40 practice pitches, including 20 having floodlight facility, 243 rooms of varying sizes, and an open-air theatre. According to the NCA blueprint, these and many other world-class facilities, such as indoor training facility comprising futsal, squash, badminton, basketball, tennis, cycling track and temperature-controlled pool. Ancillary provisions such as pharmacy, courier-dispatch facility, bank, ATM, salon, tuck shops will also come up on a 40-acre land in Devanahalli Taluk, near the Bengaluru international airport. The BCCI is keen to pursue a holistic approach for developing cricketers at the new NCA campus. The BCCI has secured the land on a 99-year lease from the Karnataka Industrial Areas Development Board (KIADB) for around INR 50 crore. The land issue couldn't be resolved through successive Karnataka state governments, and was finally registered in the name of the BCCI in 2017. Since the NCA's establishment in 2000, it has been running from the premises of the M. Chinnaswamy Stadium in the heart of Bengaluru. The Karnataka State Cricket Association (KSCA), which owns the stadium, has rented out to the BCCI its Ground B for outdoor practice, besides an indoor practice facility, and separate space for a modern gymnasium. In the first phase of construction, divided into five zones and the \"common facilities\" that spill into the second phase, one main ground, including ancillary facilities, administrative and pavilion block, and two practice grounds will be part of Zone-I. In Zone-II, outdoor training facility, including 40 practice pitches, multipurpose fielding area, swimming pool, and meeting rooms etc. will come up. A 16,000-square feet gymnasium, one acre outdoor facility, and all-weather indoor pitches will be the highlights of Zone-III. As part of Zone-IV, a residential block comprising 10 double occupancy rooms, 10 quad sharing dormitories, eight rooms for guests, central kitchen, and banquet facility will be built. And in Phase-II of the NCA project, a gallery structure to accommodate 7,500 spectators at the main ground, broadcasting and floodlight facilities for all practice grounds and extension of facilities in practice grounds will come up in Zone-I. Floodlights for 20 practice pitches and two tennis courts will be constructed as part of Zone-II. A small temperature-controlled indoor pool will be constructed under Zone-III. Zone-IV will see extension of the residential block, comprising 70 single-occupancy rooms, 120 double-occupancy rooms, 25 quad-sharing dormitories, and recreational facilities. Indoor training facility, consisting of futsal, squash, badminton, basketball courts, and office spaces will be part of Zone-V of the ambitious project. And in the final phase of the project, a creche, open-air theatre, pharmacy, salon, cycling track, ice cream and juice parlours, bank, tucks shops etc. will be built. IANS Also Read: 13 Dead After Falling Into Well While Performing Pre-Wedding Ritual In UP's Kushinagar Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/17/313845-bcci.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Jorhat take lead on Day I","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/jorhat-take-lead-on-day-i-578739","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Jorhat took full control over NFRSA in the JK Baarooah U-19 Inter District Cricket at Golaghat today. In reply to NFRSA’s first innings total 83 Jorhat were 170-7 at stumps in their first innings.","content":"Our Sports ReporterGUWAHATI: Jorhat took full control over NFRSA in the JK Baarooah U-19 Inter District Cricket at Golaghat today. In reply to NFRSA's first innings total 83 Jorhat were 170-7 at stumps in their first innings. Brief scores: NFRSA 1st innings 83 (33.2 overs), Rohan Jyoti Rabha 25, Debojit Borah 5-19, Reshab Deepak 4-22, Jorhat 1st innings 170-7 (53.4 overs), Bikram Baruah 39, Nehal Roy 39, Ronit Akhtar 3-35, Kangkan Kashyap 2-41. Also Read: 13 Dead After Falling Into Well While Performing Pre-Wedding Ritual In UP's KushinagarAlso Watch:","pubDate":"2022-02-17 09:01:16","full_description":"Our Sports Reporter GUWAHATI: Jorhat took full control over NFRSA in the JK Baarooah U-19 Inter District Cricket at Golaghat today. In reply to NFRSA's first innings total 83 Jorhat were 170-7 at stumps in their first innings. Brief scores: NFRSA 1st innings 83 (33.2 overs), Rohan Jyoti Rabha 25, Debojit Borah 5-19, Reshab Deepak 4-22, Jorhat 1st innings 170-7 (53.4 overs), Bikram Baruah 39, Nehal Roy 39, Ronit Akhtar 3-35, Kangkan Kashyap 2-41. Also Read: 13 Dead After Falling Into Well While Performing Pre-Wedding Ritual In UP's Kushinagar Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/17/313839-barcelona-to-build-1st-cricket-pitch-thanks-to-womens-push.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"NZ-W vs IN-W 3rd ODI Dream11 Prediction: Fantasy Cricket Tips for India Women vs New Zealand- W in Queenstown","link":"https://www.indiatvnews.com/sports/cricket/nz-w-vs-ind-w-dream11-prediction-fantasy-cricket-tips-playing-11-india-women-vs-new-zealand-women-match-in-queenstown-2022-02-17-760120","keywords":null,"creator":null,"video_url":null,"description":"NZ-W vs IN-W 3rd ODI Dream11 Prediction: Fantasy Cricket Tips for India Women vs New Zealand Women in Queenstown India will take on New Zealand in the 3rd ODI Match of the ongoing India Women tour of New Zealand, 2022. The game will take place at John Davies Oval, Queenstown.","content":null,"pubDate":"2022-02-17 09:00:34","full_description":"India vs New Zealand , 3rd ODI Match John Davies Oval, Queenstown 3:30 AM IST Sabbhineni Meghana, Yastika Bhatia, (c), Richa Ghosh (w), , , Maddy Green, Amelia Kerr, Amy Satterthwaite, Hayley Jensen, Rosemary Mair. Sabbhineni Meghana, Shafali Verma, Yastika Bhatia, Mithali Raj (c), , Richa Ghosh (w), Deepti Sharma, , Simran Bahadur, Poonam Yadav, Rajeshwari Gayakwad. Suzie Bates, Maddy Green, Amelia Kerr, Amy Satterthwaite (c), Sophie Devine, Katey Martin (w), Brooke Halliday, Hayley Jensen, Jess Kerr, Rosemary Mair, Fran Jonas. Sabbhineni Meghana, Shafali Verma, Yastika Bhatia, Mithali Raj(c), Harmanpreet Kaur, Richa Ghosh(w), Deepti Sharma, Pooja Vastrakar, Jhulan Goswami, Poonam Yadav, Rajeshwari Gayakwad, Sneh Rana, Meghna Singh, , Renuka Singh, . Suzie Bates, Maddy Green, Amelia Kerr, Amy Satterthwaite, Sophie Devine(c), Lea Tahuhu, Katey Martin(w), Brooke Halliday, Hayley Jensen, Jess Kerr, Hannah Rowe, Lauren Down, Rosemary Mair, Fran Jonas, Frances Mackay.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Bokakhat, Nagaon, Karimganj win","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/bokakhat-nagaon-karimganj-win-578737","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Bokakhat, Nagaon and Karimganj won their respective matches in the Kanaklata Women Inter District Cricket Championhip held in different venues in the city today.","content":"Our Sports ReporterGUWAHATI: Bokakhat, Nagaon and Karimganj won their respective matches in the Kanaklata Women Inter District Cricket Championhip held in different venues in the city today. Bokakhat thrashed Nalbari by 10 wickets while Nagaon, also in a one sided match, beat Dhubri by 190 runs. Karimganj registered 7 wickets victory over Mangaldai. Also Read: 13 Dead After Falling Into Well While Performing Pre-Wedding Ritual In UP's Kushinagar Also Watch:","pubDate":"2022-02-17 08:57:52","full_description":"Our Sports Reporter GUWAHATI: Bokakhat, Nagaon and Karimganj won their respective matches in the Kanaklata Women Inter District Cricket Championhip held in different venues in the city today. Bokakhat thrashed Nalbari by 10 wickets while Nagaon, also in a one sided match, beat Dhubri by 190 runs. Karimganj registered 7 wickets victory over Mangaldai. Also Read: 13 Dead After Falling Into Well While Performing Pre-Wedding Ritual In UP's Kushinagar Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/17/313837-cricketreuters-770x433.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"}]}