{"newsArray":[{"title":"Australia’s spin gamble questioned as England look to defy 139-year hoodoo: Day 1 Talking Points","link":"https://www.foxsports.com.au/cricket/the-ashes/australias-spin-gamble-questioned-as-england-look-to-defy-139year-hoodoo-day-1-talking-points/news-story/56d35753c0b2365ed4e83330aec2f594","keywords":null,"creator":null,"video_url":null,"description":"England has edged ahead in the fourth Ashes Test at Old Trafford after Chris Woakes rocked Australia’s middle order on Wednesday afternoon.","content":"England has edged ahead in the fourth Ashes Test at Old Trafford after Chris Woakes rocked Australia’s middle order on Wednesday afternoon. Australia is 8-299 at stumps on day one , with Marnus Labuschagne and Mitchell Marsh each scoring half-centuries as the visitors failed to capitalise on handy partnerships in Manchester. Woakes, who finished the day with four wickets, knocked over Marsh and Cameron Green in the same over after tea to put England in the superior position at stumps. The Old Trafford Ashes Test will resume on Thursday at 8pm AEST. ‘BLOWS MY MIND’: WILL AUSSIES REGRET SELECTION CALL? Did Australia make a mistake dropping Todd Murphy ahead of the Old Trafford Test? Earlier this week, England’s Moeen Ali warned against leaving out your strike spinner in Manchester, the venue that hosted Shane Warne’s Ball of Century — and the tweaker proved exactly why on Wednesday afternoon. The first delivery of Ali’s second spell spun sharply, raising some eyebrows around Old Trafford. A couple of overs later, he turned a delivery past Marnus Labuschagne’s inside edge, trapping the Queenslander on the pads for 50. Stuart Broad claims 600th Test wicket | 01:20 Ali continued troubling Australia’s right-handers on the dry wicket, with his varying turn proving difficult to tame. The 36-year-old’s probing spell would have left Australian selectors briefly wondering whether they made the right call. “I was surprised they didn’t go in with (a spinner) … if you haven’t got one, you can be found out very easily,” Australian legend Ricky Ponting said on Sky Sports. “Moeen Ali got one to turn, I wouldn’t have expected that by looking at the pitch this morning.” Former Australian captain Mark Taylor continued on Channel 9: “Now that Australia are bowling last in this Test match, you would have loved to have a spinner at your disposal.” READ MORE ‘LET IT SLIP’: Aussies could rue Ashes waste as stars stumble amid epic Broad feat ‘HE CAN BELIEVE IT’: Under-siege star flips Ashes script with absolute stunner Former England opener Mark Butcher was stunned by the omission, telling Sky Sports: “Australia not playing a spin bowler blows my mind a bit … it feels quite defensive. “They don’t have the ability then to change it up should things not work with the seam bowlers.” Former New Zealand wicketkeeper Ian Smith also slammed the decision, arguing Australia could be left red-faced over the coming days. “They would never have considered this if Nathan Lyon was available,” Smith told SEN NZ . “That’s just total lack of faith in Todd Murphy. Absolute total lack of faith, and they might get burned by it if they’re able to get five reasonable days of cricket and the pitch at Old Trafford starts to turn. “They might get embarrassed and caught short here and level the series.” However, there is a lingering threat of rain in Manchester this week, and the added moisture won’t assist spin bowlers as the match progresses. Speaking to reporters on Tuesday, Australian captain Pat Cummins also backed part-timer Travis Head to bowl some spin at Old Trafford if required — the South Australian averages 31.33 with the ball in Tests. “Even when he started his career with Australia, (Head) was basically the frontline spinner in ODI cricket,” Cummins said. “I think he’s got better and better … he defends himself well, uses a bit of drift as much as spin, and he’s quite clever. Lot a confidence in his bowling.” Moeen Ali of England. Photo by Richard Heathcote/Getty Images Source: Getty Images ENGLAND’S BRAVE TOSS CALL COULD DEFY 139-YEAR HOODOO Manchester’s notoriously indifferent weather had already made its mark on the fourth Test at Old Trafford before a ball was bowled. The long-range forecast prompted Australia to name their Test XI without a specialist spinner for the first time since 2012, while England went with the same configuration of their bowling attack at Headingley, with spinner Moeen Ali listed to bat at number three to accommodate the middle order. At the toss, both captains would have opted to bowl first, a decision Ben Stokes took much joy in when the coin fell his way for the fourth time this series. England would have to defy history to level the Ashes series — no Test side has ever elected to bowl first and win at Old Trafford, making the opening session even more crucial for the hosts. England made two breakthroughs before lunch but leaked 107 runs as the sun came out in Manchester to bathe the ground in pristine batting conditions. Bairstow takes one handed 'worldie' | 00:33 Former Australian captain Ricky Ponting was impressed by Australia’s positive intent, not sitting back and getting dictated to in the opening hours of play. “For Australia once they lost the toss, that first session was crucial,” Ponting said on Sky Sports. “Were they thinking about only needing a draw? Doesn’t look like it, they’ve come out with great intent.” Former Australian wicketkeeper Ian Healy was adamant England made the “wrong” call at the toss. “Both captains would have done it, which is wrong,” Healy said on Channel 9. “If Ben Stokes thought I am going to fire up these quicks of mine and really come at the Australians and get that crowd on its feet, it just hasn’t happened.” Ben Stokes of England. Photo by Ryan Pierse/Getty Images Source: Getty Images Former Australian international Callum Ferguson added: “It’s perplexing to me. They’ve disregarded history altogether. “In the last ten Test matches, the team batting first has made on average 386.” With the weather forecasted to intervene later in the Test, Stokes’ decision, coupled with the performance of his bowlers, has allowed the hosts to set the pace. Despite the favourable batting conditions, England continued to take wickets at regular intervals to disrupt Australia as partnerships were beginning to prosper. Four of Australia’s middle-order partnerships were over 45 runs (46, 59, 63 and 65) yet couldn’t kick on to “put the series to bed”, according to former England captain Nasser Hussain. “They’ve been sloppy, Australia,” Hussain said on Sky Sports. “Some soft dismissals, batters getting in, getting out. They could have put this series to bed by batting well today. “It’s a good pitch.” Broad fires early taking Uzzie | 00:35 MARNUS’ ‘SOFT DISMISSAL’ AFTER FINDING GOLDILOCKS STANCE Marnus Labuschagne was in the midst of the longest century drought of his Test career heading into the Old Trafford contest, going 20 consecutive knocks without reaching triple figures. The Australian No. 3 had not even passed fifty in eight innings since the start of the World Test Championship final against India, a worrying slump for the typically prolific Queenslander. He’s been guilty of needlessly throwing his wicket away, most noticeably during the second innings at Lord’s and Headingley. The dismissals were uncharacteristic for Labuschagne, who has looked a shadow of his former self over the past six weeks. “He’s just getting starts and getting out,” Australian teammate Usman Khawaja said this week. “It sucks … but I expect him to get big runs in the next couple of games.” Marnus 'slightly disappointed' by no ton | 00:37 Unfortunately for Labuschagne, he once again fell to a soft dismissal after making a useful start on day one of the Old Trafford Test — he reached his half-century in 114 balls but fell victim to England spinner Moeen Ali on his very next delivery. Ali, coming from over the wicket, turned an innocuous off-break into the right-hander’s pads, with England successfully reviewing the LBW decision. Labuschagne dropped to his haunches when three lights appeared on Hawkeye, rubbing his face in disbelief as he trudged off. “He has to be so sore with himself … gets to fifty and misses a ball he should never miss when you are in and batting for two or three hours,” former England captain Michael Atherton said on Sky Sports commentary. “That is a soft dismissal … much in the same way that Labuschagne rather gifted his wicket at Headingley, he has done it again here at Old Trafford.” Australian legend Ricky Ponting continued: “Slightly lazy from Labuschagne … there was no way in the world that ball should get you out.” Labuschagne has been maniacally tinkering with his batting stance throughout the series, as documented by the Sky Sports commentators during the Headingley Test — the constant technical changes suggest he has lost trust in his game. The 29-year-old continued experimenting ahead of the Old Trafford Test, spending more time in the nets than any of his teammates — Australian captain Pat Cummins joked he should move his hotel pillows towards the training facility. Labuschagne took guard several times before his first ball at Old Trafford on Wednesday, settling on what can be considered his Goldilocks stance — starting on middle stump with a trigger movement across the crease. Unlike the series opener at Edgbaston, where Labuschagne was guilty of fishing at outswingers outside off stump, he left the Dukes ball regularly and confidently, allowing harmless deliveries to sail through. Labuschagne played second fiddle during partnerships with David Warner, Steve Smith and Travis Head, allowing his teammates to dictate the tempo as he nudged and nurdled at the other end. He was also noticeably more confident against Mark Wood — at Headingley, he scored two runs from 42 balls against the England quick, while on Wednesday he managed 19 off 29 deliveries. Marnus Labuschagne of Australia. Photo by Clive Mason/Getty Images Source: FOX SPORTS ‘CALM DOWN’: WARNER IS ‘ALL OVER THE PLACE’ After twin failures during the third Ashes Test at Headingley, Australian opener David Warner fell victim to Chris Woakes for 32 (38) on day one at Old Trafford. Moments after the drinks break on Wednesday morning, the left-hander looked to press Woakes through the covers, instead edging behind to wicketkeeper Jonny Bairstow. He threw his head back in frustration before marching towards the sheds. Warner signalled his intent early in Manchester, thumping the first delivery of the match through the covers for a boundary. The 36-year-old, who vowed to maintain his aggressive mindset throughout the series, wasn’t afraid to attack anything wide, scoring the majority of his runs through point. “If you fear failure, I reckon you will fail,” Warner told the Vaughany and Tuffers Cricket Club podcast this week. “I have never feared failure, so I feel every game I go out thinking it could be my last. When you open the batting, you are going to get out, and you could get out first ball of the game, so I have had that instinct of backing myself and playing my way.” Warner has reached fifty once in nine knocks on this Test tour, averaging 24.11 since the start of the World Test Championship final against India. Speaking on Channel 9, former England cricketer David Lloyd called for Warner to “calm down” in the middle, pleading for the New South Welshman to bat with less urgency. “He is frantic. I don’t get it,” Lloyd said. “He is a wonderful player. He is 36 years of age. He’s seen it all, done it all. I think he should be so calm at the crease, and he looked skittish. He is all over the place at the crease. “It’s a long day opening the batting. Set your stall out, that’s the way to do it. It will get easier this afternoon, no doubt.” Lloyd also said he would have dropped Warner for reserve opener Marcus Harris after the Headingley Test. “I am outside looking in. I don’t know what he is like in the rooms, but I would have thought his time was up after the last game, and Marcus Harris would have come in. Stuart Broad is all over him,” Lloyd continued. “I can’t get away from the fact that he is 36 years of age. Calm down, just calm down a bit.” David Warner of Australia. Photo by Clive Mason/Getty Images Source: Getty Images ‘TOO EARLY FOR THAT’: PUNTER BAFFLED BY AUSSIES TACTIC Australian cricket legend Ricky Ponting was absolutely baffled when Alex Carey started farming the strike on day one of the Old Trafford Test, with the wicketkeeper looking to prevent England quick Mark Wood from bowling to the tail. Mitchell Marsh’s departure left Australia in a spot of bother at 7-255 on Wednesday afternoon, with Mitchell Starc joining Carey in the middle. The following over, Carey creamed a short ball from Wood towards deep point for what should have been a regulation single — but the pair didn’t bother running between the wickets. Boos echoed around the Manchester venue in response to the ignored single. Carey, unbeaten on 1 at the time, continued trying to keep strike against Wood, who had ripped through Australia’s tail during the first innings at Headingley. It allowed England to spread the field, preventing Carey from scoring boundaries. Since the start of 2022, Starc has averaged 6.00 against Wood in Tests, dismissed four times in 46 deliveries. Ponting argued that Starc’s batting didn’t warrant such treatment — the left-hander averages 26.62 with the bat in England, which is higher than David Warner’s equivalent figure, and has ten Test fifties to name. “It’s too early for that, as far as I’m concerned. Mitch Starc can bat. Pat Cummins in next, he can bat. I think Carey has to put some trust in Starc and Cummins,” Ponting said on Sky Sports commentary. “We saw Pat Cummins at Edgbaston do a really good job to get Australia over the line. They can still ink out tail-end runs. Looking back in the first three games, they’ve been very important at different times. “The tail-end runs now for Australia in this first innings are going to be crucial.” Starc backed up Ponting’s remarks, surviving to stumps unbeaten on 23 — incredibly, the left-hander currently averages 157.00 with the bat at Old Trafford. Mitchell Starc of Australia. Photo by Clive Mason/Getty Images Source: Getty Images","pubDate":"2023-07-19 23:39:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Danger sign Australia made a huge Ashes selection blunder as Marnus Labuschagne tries to talk down chances tourists will struggle","link":"https://www.dailymail.co.uk/sport/cricket/article-12317299/Australia-Ashes-selection-blunder-Marnus-Labuschagne.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Australia are hopeful their decision not to play a spinner at Manchester won't backfire, believing the Old Trafford wicket may buck the trend and turn less later in the game.","content":"Danger sign Australia made a huge Ashes selection blunder as Marnus Labuschagne tries to talk down chances tourists will struggle Aussies hopeful they won't need a spinner Moeen Ali has had some success already Labushagne says wicket should flatten out By Scott Bailey For Australian Associated Press Updated: 00:26, 20 July 2023 e-mail View comments Australia are hopeful their decision not to play a spinner at Manchester won't backfire, believing the Old Trafford wicket may buck the trend and turn less later in the game. The tourists' decision to go into the fourth Ashes Test without a spinner continued to raise eyebrows on Wednesday, with Ricky Ponting among those surprised by the decision. With Todd Murphy left out of the team and no frontline spinner picked for the first time since January 2011, Australia will be forced to rely on Travis Head as their main tweaker. Adding to the challenge for Australia is the fact they will be bowling last in the match, at a time when spin is usually the most prodigious and the injured Nathan Lyon has been a go-to option. Concern was heightened further when England spinner Moeen Ali was able to get some purchase out of the wicket, trapping Marnus Labuschagne lbw on 51. Australia are hoping their decision to not choose a spinner at Old Trafford won't backfire England spinner Moeen Ali has had some success already, trapping Marnus Labuschagne But Labuschagne said he believed that could have been a result of a thick grass cover left of the wicket, which will flatten out later in the game. 'Because the wicket has been undercover for a few days, it didn't have that really rock-hardness,' Labuschagne said. 'And the thatchy grass is spinning. So once that wears off, I think the middle of the week it's going to actually not spin so much. 'The ends will rough up, eventually, if the weather stays good. But I think it's actually going to spin less as the game goes on from the good part of the wicket.' Labuschagne was also adamant that Australia's extra batting had not created any complacency, after six men got out between 20 and 51 in their score of 8-299. England again questioned Australia's decision not to play a spinner on Wednesday, with Stuart Broad pointing out Old Trafford is generally a place where spin is effective. It came after Ponting also queried the decision in commentary. 'I was still surprised they didn't go in with one,' Ponting said during Moeen's second spell. Stuart Broad has questioned the Aussie decision, saying Old Trafford is usually good for spin Australian great Ricky Ponting also questioned the decision to leave out a spinner 'Your preference is always to go in with a spinner – unless you are brilliant at reading weather forecasts and cricket pitches. 'So if you haven't got one, you can be found out very easy.' Share or comment on this article: Danger sign Australia made a huge Ashes selection blunder as Marnus Labuschagne tries to talk down chances tourists will struggle e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 23:26:04","image_url":"https://i.dailymail.co.uk/1s/2023/07/20/00/73405953-0-image-a-79_1689807957177.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"What happened on Day 1 of the 4th ENG vs AUS Ashes 2023 Test in Manchester?","link":"https://www.sportskeeda.com/cricket/what-happened-day-1-4th-eng-vs-aus-ashes-2023-test-manchester","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":"Chris Woakes starred with 4/52 as England reduced Australia to 299/8 on Day 1 of the fourth Ashes 2023 Test at Old Trafford in Manchester on Wednesday, July 19. A number of Aussie batters got starts, but none could convert them into a big score. Stuart Broad struck early for the hosts after they won the toss and bowled first, trapping Usman Khawaja (3) leg before with a sharp delivery that nipped back and beat the batter’s defense. The struggling pair of David Warner and Marnus Labuschagne lifted the visitors with a second-wicket stand of 46. Warner did well to reach 32, but was foxed into a drive outside off stump from Woakes and nicked the ball to the keeper. Labuschagne and Steve Smith then added 59 runs for the third wicket. The latter got into 20s but dancing down the track and lofting Moeen Ali for a maximum over long-on. Australia went to lunch on Day 1 in a decent position at 107/2. Mark Wood dealt Australia a massive blow in the second session, trapping Smith leg before for 41 with a quick delivery that jagged back in. The senior Aussie batter paid the price for his premeditated shuffle across the stumps. Labuschagne and Travis Head then added 63 for the fourth wicket. However, Australian batters continued to give their wickets away after getting starts. Labuschagne brought up his first fifty of Ashes 2023, but fell immediately afterwards for 51. He missed a flick off Moeen and was trapped in front as England took a successful review. Head looked in reasonable control during his stay at the crease before perishing to Broad for 48, hooking the bowler straight to the fielder at fine-leg. With the scalp, Broad joined the elite 600-wicket club in Test matches. When Head was dismissed, Australia were in a spot of bother at 189/5. Mitchell Marsh, however, struck an impressive half-century, adding 65 runs for the sixth wicket with Cameron Green. After striking a couple of early fours, Marsh launched Moeen over long-on for six. A few overs later, he slammed the off-spinner for consecutive fours. Marsh reached his fifty off 56 balls by flicking Wood for a four. Just when Australia seemed to be getting some sort of control, Woakes’ double strike put England back on top. Green was trapped lbw by a skidder for 16, while Jonny Bairstow pulled off a blinder behind the wickets to end Marsh’s resistance for 51. Woakes produced a nick off a brilliant probing delivery and Bairstow flung to his right to pull off a one-handed blinder. Alex Carey and Mitchell Starc added a crucial 39 runs for the eighth wicket, but Woakes struck another crucial blow just before stumps. Carey (20) made a late attempt to leave a length delivery outside off, but only managed to nick the ball to the keeper. Australia went on to stumps on Day 1 with Starc unbeaten on 23 and Pat Cummins on 1. Quick Links","pubDate":"2023-07-19 23:23:05","image_url":"https://staticc.sportskeeda.com/editor/2023/07/22d93-16897893182101-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"WC opener to go ahead despite ‘alarming incident’ in Auckland, NZ PM confirms — World Cup Daily","link":"https://www.foxsports.com.au/football/matildas/fifa-womens-world-cup-2023-matildas-news-cathy-freeman-sydney-2000-olympics/news-story/5dbc217fee78de73a1e578fbf5043d02","keywords":null,"creator":null,"video_url":null,"description":"New Zealand Prime Minister Chris Hipkins has confirmed the World Cup opener between New Zealand and former winners Norway will go ahead on Thursday evening.","content":"New Zealand Prime Minister Chris Hipkins has confirmed the World Cup opener between New Zealand and former winners Norway will go ahead on Thursday evening. It comes in the wake of confirmation from New Zealand police that a gunman opened fire at a central Auckland building site on Thursday in an “alarming incident” that left two people and the alleged shooter dead. The Women’s World Cup kicks off with New Zealand taking on Norway in Auckland (at 5pm AEST) before co-hosts Australia face the Republic of Ireland (8pm) in front of 80,000 fans in Sydney. MORE WOMEN’S WORLD CUP NEWS Who’s in the Matildas squad and when do they play their Women’s World Cup games? All 64 World Cup fixtures and full Matildas schedule What time do the Matildas play their first World Cup game? Excitement builds ahead of WC opener | 02:00 “What has unfolded is understandably alarming and we are reassuring the public that this incident has been contained and is an isolated incident. We can also advise that this is not a national security risk,” a statement from New Zealand police read. “Police are now commencing an investigation into what has occurred this morning. Cordons remain in place and we are continuing to ask the public to stay away from the area as our work continues.” The incident is reported by local media to have taken place in a building close to the fan zone for the Women’s World Cup and near Norway’s team hotel on Quay Street. Norway captain Maren Mjeldeb said, per Stuff.co.nz : “Everyone probably woke up quite quickly when the helicopter hovered outside the hotel window and a large number of emergency vehicles arrived. At first we didn’t know what was going on, but eventually there were updates on TV and the local media. “We felt safe the whole time. FIFA has a good security system at the hotel, and we have our own security officer in the squad. Everyone seems calm and we are preparing as normal for the game tonight. Then we may have to adapt if there are any instructions from the authorities.” The New Zealand Women’s National Team said it was “shocked” by the incident in a statement that confirmed all team and staff are “safe”. It added: “Preparations for the game tonight at Eden Park will continue as planned.” The US Women’s National Team, whose camp is based in Auckland, released a statement on Thursday confirming all players and staff are “accounted for and safe”. “Our security team is in communication with local authorities and we are proceeding with our daily schedule,” added the statement. The Phillipine Women’s National Team also confirmed all its players and staff were “safe inside Movenpick Hotel”. “The team is preparing to depart for Dunedin for the match against Switzerland on Friday,” the statement read. Auckland Mayor Wayne Brown, meanwhile, described it as a “scary situation” and advised people to “stay at home” and “avoid travel into the city centre”. He told local TV network TVNZ: “This dreadful situation couldn’t have come at a worse time when the world has its eyes on us. It’s dreadful, particularly since we have never had an incident like this before. It’s very scary.” Former Football Fern Maia Jackman was in the fan zone as the unfolded, providing her account of events to the NZ Herald . “It’s pretty scary actually,” she said. “So they pushed us to the back of the cloud where we are and we’re just trying to keep sane. There’s lots of security and lots of uncertainty.” The Cloud, which was set up as the Women’s World Cup fanzone, was locked down in response to the incident with the Herald reporting people there are “safe”. Journalist Suzanne McFadden, meanwhile, was a guest on the TVNZ Breakfast show that was broadcasting from The Cloud. According to Stuff.co.nz , she said around 30 people — including girls from the Ellerslie Football Club and former Football Ferns — were moved towards the back of the venue into a kitchen area. “The first thing we’d noticed was the police helicopter overhead and then we were moved out the back — we thought we were going there to be filmed. And then we were quietly told there was a gunman outside,” McFadden said. Matildas call out FIFA over gender gap | 01:35 WORLD CUP WILL ‘WAKE UP’ NEW ZEALAND’S LOVE OF FOOTBALL New Zealand hosts Norway at Eden Park on Thursday to open the Women’s World Cup. Jitka Klimkova said on Wednesdsay that staging the Women’s World Cup will “wake up” New Zealand’s passion for football. Football remains well behind rugby, cricket and other sports in popularity in New Zealand, which is jointly hosting the World Cup with Australia. New Zealand have never won a Women’s World Cup game in 15 attempts, but they hope to change that when they face the 1995 champions Norway in the first game of the tournament on Thursday. “It is an opportunity for this country to not just be a rugby country but wake up their love for football,” said their Czech coach Klimkova. Taking up the theme, captain Ali Riley added: “Hopefully this time we will achieve our goal of winning a World Cup game and doing that at home, and that will make it my greatest game of my career. “This feels like an opportunity with the sporting culture, inspiring young people.” After facing Norway at the 50,000-capacity Eden Park -- better known for hosting the All Blacks rugby team -- New Zealand face minnows the Philippines and Switzerland in Group A. New Zealand are ranked 26th in the world and have won just once in their last 11 matches, but Klimkova is backing them to shine in front of their own fans. Matildas set up camp at Brisbane base | 01:34 “The hard work and preparation brought us to where we are now,” she said. “At this stage the preparation is done and now it is time to shine, and I really believe these players will shine.” Norway have fallen away since triumphing in 1995. They were thumped 8-0 in the group stage by hosts and eventual champions England at the 2022 Euros. Their Barcelona winger Caroline Graham Hansen said the World Cup was a chance to redeem themselves and a fresh start. “It is a year ago, a long season behind us,” she said, casting her mind back to their Euro flop. “I think everybody has had time to focus on their club while working on stuff with the new coaching team, so everything feels very different, nothing to compare with how we left the tournament last year. “It is a clean slate, we have a possibility to start afresh and to get going again. “That is the beauty of football -- there is always a new chance, and now we have it again.” — AFP MATILDAS ‘VERY EMOTIONAL’ AFTER FREEMAN VISIT Matildas captain Sam Kerr has repeatedly said she wants to lead Australia to World Cup glory and create her own ‘Cathy Freeman moment’. But Kerr and her Tillies teammates last week received a very special visit from the Australian sporting legend herself. The Sydney 2000 Olympic Games 400m gold medallist Freeman, a proud Kuku Yalanji woman, is the sporting hero of ‘over half the team’, and joined the team in Melbourne last Wednesday. Kerr told Freeman: “You’re an inspiration to the whole team … You’ve been an idol for all of us for so long. What you did for us as a country, hopefully we can replicate even half of that. We’ll remember this night for the rest of our careers. It’s been amazing.” “A lot of girls were very emotional,” Matildas veteran Aivi Luik said. “I still can’t believe that happened because a couple years ago, we were going through some questions about who your sporting hero is and why, and over half the team said that Cathy Freeman was their hero. “The staff, because of that, tried to get her in, and bless her heart, she came in. “She doesn’t do a lot of public speaking but she did that for us. We asked her questions informally and she spoke back to us just like she was a friend, and we got a lot of good insight from that.” FEATURE: How 2019 WC heartbreak exposed Matildas’ great flaw … and the brutal journey to fix it Cathy Freeman of Australia celebrates winning gold in 2000. Source: News Corp Australia WOMEN’S WORLD CUP PREVIEW PODCASTS – LISTEN NOW! PART ONE: Preview of EVERY group and which players could catch your eye PART TWO: Three burning Matildas questions and why their Group B rivals are a threat Freeman told the Aussies: “The power of you just being here is unimaginable. It’s beyond your wildest dreams what you’re going to be able to do. “You’re going to be able to get into the blood of everybody who is on the journey with you. It’s just a crazy, wild ride. “You’re writing your name in history, ladies. And you should be really proud of that.” Luik said: “She told us was that we know who we are, we know why we do this, and while we want to perform and give results for others outside the circle, at the end of the day, you believe in yourself and you do it for yourself.” “All athletes do what they do because they love the sport, and (Freeman said) to not lose track of that, and that gives you the confidence to go out there and do your job.” Luik praised Freeman’s resilience to perform despite having the “weight of the nation” on her shoulders at the Olympics. “She was just one and we’re a whole team, so I think we’re quite lucky in that regard that we have our friends and teammates there to support each other,” Luik said, “We came away from that feeling a little bit of a weight off our shoulders, and just completely inspired.” Freeman and her family joined the Matildas for a team dinner and was presented with a signed team jersey. Australia’s opening match of the tournament is against Ireland on Thursday night in Sydney – at the same stadium where Freeman made history in 2000. Freeman celebrates her iconic win. Source: Supplied MORE NEWS MATILDAS SQUAD: What you need to know about every Aussie FIXTURES: All 64 World Cup games and full Matildas schedule EVERY SQUAD: 736 players, one trophy — Every World Cup squad locked in In February, Sam Kerr said: “The legacy left there from that one special moment at the 2000 Olympics was everlasting for all of us. “Ask half the girls in the team, their idol growing up was Cathy Freeman. “That’s the legacy we want to leave – that we inspire the nation, we move the nation to believe in women’s football, believe in the Matildas.” And Kerr also wrote in her book, My Journey To The World Cup: “I loved her so much. “She was so fast and strong, and she coped so well with the unbelievable pressure that was put on her. I watched her race in the Sydney 2000 Olympics over and over and over again.”","pubDate":"2023-07-19 22:44:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"ASHES DAY ONE, FOURTH TEST - SESSION-BY-SESSION: Honours shared as England take four wickets in the evening after Australia raced to 107 for two in dominant start","link":"https://www.dailymail.co.uk/sport/cricket/article-12317041/ASHES-DAY-ONE-FOURTH-TEST-SESSION-SESSION-Honours-shared-England-four-wickets-evening-Australia-raced-107-two-dominant-start.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH AT OLD TRAFFORD: England finished day one of the fourth Ashes Test on top with Pat Cummins and Mitchell Starc at the crease on 299 for eight.","content":"ASHES DAY ONE, FOURTH TEST - SESSION-BY-SESSION: Honours shared as England take four wickets in the evening after Australia raced to 107 for two in dominant start Steve Smith and Marnus Labuschagne guided Australia to 107 for two at lunch The visitors added 80 more for the loss of two before England took the evening ASHES NOTEBOOK: Pope gives a thumbs-up while McGrath takes scenic route By Lawrence Booth for the Daily Mail Updated: 21:53 BST, 19 July 2023 e-mail View comments England finished day one of the fourth Ashes Test on top with Pat Cummins and Mitchell Starc at the crease on 299 for eight. Chris Woakes starred for the hosts with the ball - taking four wickets including two in one over - while Stuart Broad took his 600th Test scalp to join Jimmy Anderson in exalted company. Anderson himself struggled to dazzle at the ground that has a stand and a bar named after him, while Marnus Labuschagne also had a moment to forget after once again throwing away his wicket to Moeen Ali's off-breaks. There was also a moment of redemption for the much-maligned Jonny Bairstow who took a terrific low grab after coming under fire for his keeping so far this series. Here, Mail Sport's Lawrence Booth takes you through the action from Old Trafford, session-by-session. Stuart Broad made history in taking his 600th Test wicket after dismissing Travis Head Australia ended the day on 299 for nine with captain Pat Cummins (right) at the crease Morning – Australia Invited to bat, Australia for once lost Usman Khawaja early, trapped in front to give Stuart Broad his 599th Test wicket. Chris Woakes then had David Warner caught behind for 32 to make it 61 for two – and almost had Steve Smith caught at long leg first ball. But Smith and Marnus Labuschagne took the tourists to 107 for two by lunch, at a Bazball-esque 4.28 an over. Afternoon – shared In a session of nip and tuck, Australia added 80 runs for the loss of Smith and Labuschagne – who are threatening to lose their pre-series tag as the 'wickets England want most'. Smith was undone by Wood's pace, while Labuschagne – after bringing up his first half-century of the series – played all round an off-break from Moeen Ali. Evening – England Four wickets, including three for Woakes, left England with a slight edge at the end of another absorbing day. Chris Woakes (right) took three of the four wickets to fall in the final session - including two in one over Mitchell Marsh had threatened to turn things Australia's way with a rapid half-century, but he was brilliantly caught by the under-fire Jonny Bairstow as Woakes snared him and Cameron Green in the same over. Verdict - honours split between the two sides. Play of the day With apologies to Stuart Broad’s achievement of 600 Test wickets, there was no better moment than Jonny Bairstow’s right-handed lunge to cling on to an edge from Mitchell Marsh, having briefly been sent the wrong way. Bairstow has spent most of the series under the wicketkeeping microscope – and celebrated on his backside with a mixture of relief and jubilation. Jonny Bairstow took a fantastic catch low to his right have already begun moving the other way Share or comment on this article: ASHES DAY ONE, FOURTH TEST - SESSION-BY-SESSION: Honours shared as England take four wickets in the evening after Australia raced to 107 for two in dominant start e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:53:14","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73396753-0-image-a-70_1689799811253.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Stuart Broad revels in 'special' feeling after taking a landmark 600th Test wicket - as England restrict Australia to 299-8 on day one of the fourth Ashes Test at Old Trafford","link":"https://www.dailymail.co.uk/sport/cricket/article-12316827/Stuart-Broad-revels-special-feeling-taking-landmark-600th-Test-wicket-England-restrict-Australia-299-8-day-one-fourth-Ashes-Test-Old-Trafford.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Stuart Broad is just the fifth man to reach the milestone and only the second pace bowler, after his England team mate Jimmy Anderson to achieve the feat.","content":"Stuart Broad revels in 'special' feeling after taking a landmark 600th Test wicket - as England restrict Australia to 299-8 on day one of the fourth Ashes Test at Old Trafford Stuart Broad dismissed Travis Head to reach the milestone of 600 Test wickets He is just the fifth man to achieve the feat and only the second pace bowler Broad has impressed, taking more wickets this series than any other bowler (18) By Aadam Patel At Old Trafford Updated: 22:24 BST, 19 July 2023 e-mail View comments Stuart Broad admitted he felt ‘really special’ after taking his 600th Test wicket for England, as Australia ended on 299 for eight on the first day of the fourth Ashes Test in Manchester. ‘It’s got a nice ring to it - getting your 600th Test wicket from the James Anderson End. There’s something pretty special about that,’ said Broad after getting Travis Head out in the first over after tea. Broad is just the fifth man to reach the milestone and only the second pace bowler , after Jimmy Anderson to achieve the feat. ‘I got my 500th Test wicket here in front of no crowd (due to Covid). My dad was here as he was the match referee. So it felt pretty special today to get an ovation from the Old Trafford crowd. 'I’ve always loved playing here. To get my 600th here in front of a full house on the first day of an Ashes Test is pretty memorable,’ Broad added. Stuart Broad became just the fifth man to reach the milestone of 600 Test wickets and only the second pace bowler, after England team mate Jimmy Anderson The veteran finished the day with two wickets after earlier dismissing opener Usman Khawaja Broad's 600th Test scalp was Travis Head, who fell just two runs shy of of his half century With more wickets (18) than anyone else in the series, Broad led England off on a day where Ben Stokes’ side bowled well after winning the toss and choosing to bowl first, with Chris Woakes the pick of the England bowlers, taking four wickets. And Broad admitted that he has felt rejuvenated under Stokes and Brendon McCullum since he was recalled last summer. ‘I have definitely got an addiction to Test cricket and the competitive side of it. Ultimately Baz and Stokesy have given me a new lease of life in a way. It is such a free changing room, it feels in the nicest possible way that you are playing club cricket, but at the highest level. That is such a great place to be as a 37-year-old,’ said Broad. ‘I would argue it’s been the most enjoyable year of my Test career which is an awesome thing to say at 36 or 37.’ Broad has played in all five of England’s Tests so far this summer and his 149 wickets across his career against Australia are the most by any bowler against the tourists. ‘I am very competitive on the field and Australia bring the best out of me on that front because they are so competitive as well. It’s been great to be involved in some brilliant battles this summer with Australia and I’ve loved every moment of this series. It’s the series that keeps on giving really,’ said Broad. And Australia’s Marnus Labuschagne was full of praise for the England quick. Marnus Labuschagne was full of praise for Broad after witnessing the Englishman's display Moeen Ali (middle) took the crucial wicket of Labuschagne who was dismissed for 51 runs ‘His statistics speak for themselves. Especially this series, he’s been very impressive to show his versatility on wickets that don’t have as much pace and nip at times but he’s able to create really good angles on the crease with his swing. He was able to work on getting one to shape away a little bit and then he’s able to go the bouncer plan. When you’re doing that, it shows his versatility. We know that if conditions are good for bowling, he’s always going to be a handful but he’s shown through the series and through his career that when it’s not, he can still keep it tight, wait for his opportunity and work a batter out.’ Labuschagne insisted that it was a day where Australia missed out, with himself getting out for 51 after playing all around a straight delivery from Moeen Ali. ‘Where we were, and how many guys got themselves in, I think we would be slightly disappointed with no-one getting a big score,’ said Australia’s No 3. Share or comment on this article: Stuart Broad revels in 'special' feeling after taking a landmark 600th Test wicket - as England restrict Australia to 299-8 on day one of the fourth Ashes Test at Old Trafford e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:39:42","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73401571-0-image-a-93_1689798846053.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"TOP SPIN AT THE TEST: Stuart Broad becomes the fifth bowler to reach 600 wickets - taking his tally against Australia to 149 in the process - and only Don Bradman has more visiting Test runs in England than Steve Smith","link":"https://www.dailymail.co.uk/sport/cricket/article-12316955/TOP-SPIN-TEST-Stuart-Broad-fifth-bowler-reach-600-wickets-taking-tally-against-Australia-149-process-Don-Bradman-visiting-Test-runs-England-Steve-Smith.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"TOP SPIN AT THE TEST: The fourth Ashes Test got underway at Old Trafford, as England's bid for an unlikely series win continued with Australia needing just a draw to retain the urn.","content":"TOP SPIN AT THE TEST: Stuart Broad becomes the fifth bowler to reach 600 wickets - taking his tally against Australia to 149 in the process - and only Don Bradman has more visiting Test runs in England than Steve Smith Stuart Broad overtook Ian Botham to have the most wickets against Australia Jimmy Anderson is the only fast bowler with more Test wickets than Broad now Broad was born for Ashes cricket - it was a fitting stage for his 600th wicket By Lawrence Booth for the Daily Mail Updated: 21:33 BST, 19 July 2023 e-mail View comments Day one of the fourth Ashes Test got underway at Old Trafford on Wednesday , as England's bid for an unlikely series win continued with Australia needing just a draw to retain the urn. England wasted little time in getting going, though, Usman Khawaja going for three to move Stuart Broad onto 599 Test wickets - before later getting himself over the line to record yet another impressive milestone . Travis Head proved to be the 600th victim for England's long-serving fast bowler - the dangerous No 5 following team-mates Warner, Steve Smith and Marnus Labuschagne who all got in but failed to record a big score. By stumps, Australia were 299 for eight with bowlers Pat Cummins and Mitchell Starc at the crease after Chris Woakes took his tally to four after dismissing all-rounders Cameron Green, Mitchell Marsh and the notorious wicket-keeper Alex Carey. Here, Mail Sport's Lawrence Booth takes you through some of the stats you may have missed from the first day of the fourth Test at Old Trafford. Stuart Broad grabbed the headlines with his 600th Test wicket for England in dismissing Travis Head Marnus Labuschagne threw away his wicket once again to Moeen Ali after being dismissed on 51 Stuart Broad became the fifth bowler – and the second seamer, after Jimmy Anderson – to tick off 600 Test wickets when Travis Head pulled him to Joe Root at long leg. It was also Broad’s 149th wicket against Australia – breaking Ian Botham’s England record of 148. Shane Warne remains the Ashes record-holder, with 195. Steve Smith’s innings of 41 means only Don Bradman has scored more Test runs among visiting batsmen in England: 2,674 at an average of 102 to Smith’s 2,113 at 55. Now relegated to third is Allan Border, with 2,082 at 65. Four wickets for Chris Woakes took his Test record at Old Trafford to 27 wickets at just 17 apiece – and his career average below 30 for the first time since the 2021-22 Ashes. Share or comment on this article: TOP SPIN AT THE TEST: Stuart Broad becomes the fifth bowler to reach 600 wickets - taking his tally against Australia to 149 in the process - and only Don Bradman has more visiting Test runs in England than Steve Smith e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:33:54","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73400549-0-image-a-51_1689798515421.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Broad inspired by Australians to wreak havoc on nation","link":"https://www.perthnow.com.au/sport/cricket/broad-inspired-by-australians-to-wreak-havoc-on-nation-c-11330558","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Stuart Broad has taken his 600th Test wicket in the fourth Ashes Test, claiming the record for the most potent bowler in history against Australia.","content":"Stuart Broad has detailed how the likes of Glenn McGrath and Shane Warne inspired him to be Australia's biggest tormenter in Test history and the latest member of the 600-wicket club. Broad became the second seamer, behind teammate James Anderson, and fifth man overall to reach the 600-wicket milestone on Wednesday, when he had Travis Head caught hooking. The wickets of Usman Khawaja and Head at Old Trafford took Broad's tally against Australia to 149, one clear of Ian Botham for the most ever against the nation. And according to Broad, it was a childhood spent watching Australia winning that made him want to emulate their dominant side of the 1990s and early 2000s. \"I grew up completely obsessed watching Ashes cricket and I suppose that's why some of my heroes are Warnie, Glenn McGrath, some of the great Aussie team,\" Broad said. \"As a kid you are influenced by winning sides. \"It also built up my steeliness to want to be part of England teams that could win the Ashes after going through a whole childhood without us lifting them.\" Broad also spent six months playing for Hoppers Crossing in south-west Melbourne as a 17-year-old, another influence he claims has been crucial. \"I probably grew up with a bit more of an Australian mindset rather than a sort of England mindset of the 1990s,\" Broad said. \"Going to Hoppers Crossing was a great experience. \"Opening batting, opening bowling, got into the competitive side of the Australians and loved the battle.\" It was fitting the milestone came against Australia, who went to stumps on day one of the fourth Test on 8-299. From the moment Broad took 5-37 against them at The Oval to win England the Ashes in the 2009 decider, he has been a problem for Australia. In all, 102 of his 149 wickets against Australia have come in England, where he averages 26.14 against them in home conditions. The 37-year-old is perhaps the biggest reason Australia have not won an Ashes series in England since 2001. Broad's spell at The Oval in 2009 won England the Ashes, while his return of 11-121 at Chester-le-Street in 2013 ended any chance of Australia drawing that series. The seamer's finest hour, at Trent Bridge in 2015, also ended Australia's Ashes chances in that match, his 8-15 ensuring England would win that series. Broad has also silenced Australia's best batsmen, famously getting David Warner's wicket for the 16th and 17th time at Headingley earlier this month. He has also removed former captains Steve Smith and Michael Clarke 11 times. The fact he is leading wicket-taker in this series, with 18 at 25.94, also continues to give England hope of coming back from 2-0 down. BOWLERS WITH 600 TEST WICKETS Muttiah Muralitharan - 800 Shane Warne - 708 James Anderson - 688 Anil Kumble - 619 Stuart Broad - 600 MOST WICKETS AGAINST AUSTRALIA Stuart Broad - 149 Ian Botham - 148 Courtney Walsh - 135 Richard Hadlee - 130 Curtly Ambrose - 128 Bob Willis - 128","pubDate":"2023-07-19 20:26:19","image_url":"https://images.perthnow.com.au/publication/C-11330558/3b3a4aec25fae2fabd504e4729aa716cf90cf9b1-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"LAWRENCE BOOTH: Marnus Labuschagne's laziness means he is losing his lustre as the Australian was dismissed by Moeen Ali AGAIN as the No 3's Ashes struggles continue","link":"https://www.dailymail.co.uk/sport/cricket/article-12316791/LAWRENCE-BOOTH-Marnus-Labuschagnes-laziness-means-losing-lustre-Australian-dismissed-Moeen-Ali-No-3s-Ashes-struggles-continue.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH: No one leaves the field more disconsolately than Labuschagne, no one looks so bereft at their dismissal. He had just brought up his first half-century of the summer.","content":"LAWRENCE BOOTH: Marnus Labuschagne's laziness means he is losing his lustre as the Australian was dismissed by Moeen Ali AGAIN as the No 3's Ashes struggles continue Marnus Labuschagne's wicket is slowly becoming less pivotal for England The Australian No 3 has made just one half century so far during the Test summer Four wickets for Chris Woakes puts England on top at the end of the first day By Lawrence Booth for the Daily Mail Updated: 21:21 BST, 19 July 2023 e-mail 3 View comments As the big screen confirmed his fate, Marnus Labuschagne’s head slumped. He turned towards the dressing-room with the agility of an oil tanker, then trudged off, the hull apparently bumping along the seabed. No one leaves the field more disconsolately than Labuschagne, no one looks so bereft at their dismissal. It wasn’t any consolation that he had just brought up his first half-century of the summer. In some ways, it just made things worse. The next ball he faced was a standard off-break from Moeen Ali . It was tossed up a touch and turned a bit – but on the 30th anniversary of Shane Warne ’s surprise here for Mike Gatting, it was no Ball of the Century. And yet Labuschagne missed a gentle work to leg. Umpire Joel Wilson said not out, but that isn’t always the end of the matter: when England reviewed, DRS flashed three reds. For the batsman, there wasn’t even any umpire’s-call orange to get indignant about. For the second Test in succession, Labuschagne had given it away against Ali, a cricketer regarded by many Australians as a luxury pick – not least since he is now England’s No 3. Marnus Labuschagne left the crease disconsolate after a tame dismissal by Moeen Ali The Australian No 3 had made his first 50 of the Test summer at Old Trafford on Wednesday He was dismissed by the English spinner for the second Test match in a row, the ball hitting his pad plum in front of the stumps At Headingley, Labuschagne’s careless slog-sweep against him on the second afternoon had opened the door for England, and was followed moments later by Ali’s dismissal of Steve Smith. Here, Labuschagne had helped take Australia to 183 for three moments before tea – a healthy position after England had chosen to bowl. Five more minutes, and he might have gone on to play the day’s decisive hand. Up in the commentary box, the former Australian captain Ricky Ponting called his demise ‘slightly lazy’ – a waste after playing what he felt had been his best innings of the series. Later, Labuschagne echoed the description. ‘I was happy with my decision-making, which is the part that has been frustrating me,’ he said. ‘I was probably a little bit lazy trying to turn it to the leg side, and Moeen got me. But I was happy with where I was from a technical space, to give myself as much access to the ball as I can.’ And there were, it’s true, a couple of vintage strokes. He got going with a punched off-drive for four off Stuart Broad, and later dealt with one of Mark Wood’s 90mph detonations with a neat clip through midwicket. He twice played second fiddle – first to Smith, then to Travis Head. By and large, it was music to Australian ears. The experts, though, had spotted yet another tweak in a summer full of them, with Labuschagne now using a middle-stump guard in his bid for technical nirvana. He had begun the series on off stump, a consequence perhaps of getting outside the line to avoid falling lbw on slow county pitches with Glamorgan. But he ended up edging his first ball at Edgbaston through to Bairstow, and soon moved to middle and leg. Here, he looked more balanced, but this latest fiddle hinted at a restlessness that has dogged his summer. He has now got to 20 seven times out of nine on this current trip to England this summer Australia's Labuschagne had started the series as the World No 1 ranked batter in Test cricket It’s not that Labuschagne isn’t giving himself a chance. Starting with the World Test Championship final against India at The Oval, he has got to 20 seven times out of nine on this trip. But, until yesterday, he had not passed 47. That’s the kind of record England would happily accept from Ali at No 3, but Labuschagne began this series as the world’s top-ranked batsman, with a propensity for going big: five of his 10 Test hundreds have been 162 or more. During the 2019 Ashes, when he emerged from the shadows as a concussion substitute for Smith to play a central role in Australia’s retention of the urn, he scored four half-centuries – and still ended up slightly unfulfilled. This time, though, it is as if his hunger has got the better of him. After reaching for that first ball of the Ashes, with fatal consequences, he has not shaken off the sense that he is chasing success, rather than allowing success to come to him. His wicket is losing its appeal as one that England seek more than others, with that honour instead passing to Usman Khawaja, Travis Head and even Mitchell Marsh There is also a growing gap between his record at home, where he has scored nine Test hundreds and averages 70, and abroad, where he has scored one and averages 37. Above all, he is losing his tag as one of the wickets England crave most. It is passing instead to Usman Khawaja, Head and even Mitchell Marsh. Smith is still up there, despite himself passing 50 only once. But Labuschagne has shed some of his lustre. He has a maximum of three innings left to right that wrong, which will mean more work with the dog-stick for Australia’s tireless backroom staff, and possibly another tinker or two when he takes guard. If not, the sight of Labuschagne dragging himself from the middle as if he carrying a sack of coal may define a summer that refuses to get going. Share or comment on this article: LAWRENCE BOOTH: Marnus Labuschagne's laziness means he is losing his lustre as the Australian was dismissed by Moeen Ali AGAIN as the No 3's Ashes struggles continue e-mail Add comment Comments 3 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:21:54","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73400809-0-image-a-44_1689797487561.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Honours even in fourth Ashes Test as Broad joins 600 club","link":"https://www.news24.com/sport/Cricket/england-quickie-broad-joins-600-test-wicket-club-20230719","keywords":null,"creator":null,"video_url":null,"description":"England's Stuart Broad became just the fifth bowler to take 600 Test wickets, as Australia ended Wednesday's opening day of the fourth Test at Old Trafford on 299-8.","content":"England's Stuart Broad became just the fifth bowler to take 600 Test wickets, as Australia ended Wednesday's opening day of the fourth Test at Old Trafford on 299-8. LIVE | England v Australia, fourth Ashes Test England's Stuart Broad became just the fifth bowler to take 600 Test wickets, as Australia ended Wednesday's opening day of the fourth Test at Old Trafford on 299-8. Marnus Labuschagne and Mitchell Marsh each made 51 after England captain Ben Stokes won the toss in a match the hosts must win to maintain their hopes of regaining the Ashes at 2-1 down with two to play. Chris Woakes led England's pace attack with 4-52 in 18.5 overs while Broad took 2-68 in 14 en route to his landmark. James Anderson was the only change to the England side that won the third Test at Headingley by three wickets. On his Lancashire home ground a fortnight short of his 41st birthday, Anderson had a frustrating day. England's all-time leading Test bowler with 688 wickets, had figures of 0-43 in 17 overs. History is against England. No side has won a Test at Old Trafford after winning the toss and bowling. Broad was aiming to heap further misery on David Warner, having already dismissed the Australia opener 17 times in Tests - including twice for a total of just five runs at Headingley. But from Wednesday's first ball, Warner thrashed a wide delivery from Broad for four. Broad, however, moved to 599 Test wickets when he had Usman Khawaja, Australia's other opener, lbw for three. Woakes struck next to end a second-wicket stand of 46 when he had Warner caught behind off an edged drive, following an assured 32. The next delivery saw star batsman Steve Smith top-edge a pull off Woakes that just cleared Mark Wood at fine leg before going for four. An increasingly confident Smith drove off-spinner Moeen Ali for a straight six. Having made 41, on a ground where four years ago his double century helped seal a 185-run win over England, Smith was lbw to express quick Wood. Head was struck on the helmet by a Wood bouncer early in his innings and again looked uncomfortable against the short ball. But he battled through. Both Head and Labuschagne unfurled several fine drives. Labuschagne, however, fell one ball after completing his fifty, lbw to Moeen - the only specialist spinner on either side after Australia dropped Todd Murphy. Australia were 187-4 at tea only to lose Head five balls after the resumption as Broad took his 600th Test wicket. Left-hander Head had made 48 when he hooked at a Broad bouncer and Joe Root held a low catch as he ran in from the boundary at fine leg. Marsh, who had marked his first Test since 2019 with a hundred at Headingley, again drove strongly and made England pay for any loose deliveries as he led the way during a partnership of 65 with fellow all-rounder Cameron Green. Their stand was broken when the recalled Green was lbw to Woakes. Australia's 254-6 became 255-7 when Jonny Bairstow, whose wicketkeeping has proved fallible this series, held a one-handed diving catch to remove Marsh from an outside edge off Woakes. The crowd roared in celebration as Marsh departed after hitting seven fours and a six in a quickfire stay of 60 balls. Alex Carey almost made it through to stumps but fell to the new ball, caught behind off Woakes trying to withdraw his bat. Mitchell Starc was 23 not out at the close. England have won 13 of their last 16 Tests at Old Trafford but have not enjoyed an Ashes victory at the Manchester ground since Ian Botham hit a celebrated hundred in 1981.","pubDate":"2023-07-19 20:20:11","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Australia’s spin gamble questioned as England look to defy 139-year hoodoo: Day 1 Talking Points","link":"https://www.foxsports.com.au/cricket/the-ashes/australias-spin-gamble-questioned-as-england-look-to-defy-139year-hoodoo-day-1-talking-points/news-story/56d35753c0b2365ed4e83330aec2f594","keywords":null,"creator":null,"video_url":null,"description":"England has edged ahead in the fourth Ashes Test at Old Trafford after Chris Woakes rocked Australia’s middle order on Wednesday afternoon.","content":"England has edged ahead in the fourth Ashes Test at Old Trafford after Chris Woakes rocked Australia’s middle order on Wednesday afternoon. Australia is 8-299 at stumps on day one , with Marnus Labuschagne and Mitchell Marsh each scoring half-centuries as the visitors failed to capitalise on handy partnerships in Manchester. Woakes, who finished the day with four wickets, knocked over Marsh and Cameron Green in the same over after tea to put England in the superior position at stumps. The Old Trafford Ashes Test will resume on Thursday at 8pm AEST. ‘BLOWS MY MIND’: WILL AUSSIES REGRET SELECTION CALL? Did Australia make a mistake dropping Todd Murphy ahead of the Old Trafford Test? Earlier this week, England’s Moeen Ali warned against leaving out your strike spinner in Manchester, the venue that hosted Shane Warne’s Ball of Century — and the tweaker proved exactly why on Wednesday afternoon. The first delivery of Ali’s second spell spun sharply, raising some eyebrows around Old Trafford. A couple of overs later, he turned a delivery past Marnus Labuschagne’s inside edge, trapping the Queenslander on the pads for 50. Stuart Broad claims 600th Test wicket | 01:20 Ali continued troubling Australia’s right-handers on the dry wicket, with his varying turn proving difficult to tame. The 36-year-old’s probing spell would have left Australian selectors briefly wondering whether they made the right call. “I was surprised they didn’t go in with (a spinner) … if you haven’t got one, you can be found out very easily,” Australian legend Ricky Ponting said on Sky Sports. “Moeen Ali got one to turn, I wouldn’t have expected that by looking at the pitch this morning.” Former Australian captain Mark Taylor continued on Channel 9: “Now that Australia are bowling last in this Test match, you would have loved to have a spinner at your disposal.” READ MORE ‘LET IT SLIP’: Aussies could rue Ashes waste as stars stumble amid epic Broad feat ‘HE CAN BELIEVE IT’: Under-siege star flips Ashes script with absolute stunner Former England opener Mark Butcher was stunned by the omission, telling Sky Sports: “Australia not playing a spin bowler blows my mind a bit … it feels quite defensive. “They don’t have the ability then to change it up should things not work with the seam bowlers.” Former New Zealand wicketkeeper Ian Smith also slammed the decision, arguing Australia could be left red-faced over the coming days. “They would never have considered this if Nathan Lyon was available,” Smith told SEN NZ . “That’s just total lack of faith in Todd Murphy. Absolute total lack of faith, and they might get burned by it if they’re able to get five reasonable days of cricket and the pitch at Old Trafford starts to turn. “They might get embarrassed and caught short here and level the series.” However, there is a lingering threat of rain in Manchester this week, and the added moisture won’t assist spin bowlers as the match progresses. Speaking to reporters on Tuesday, Australian captain Pat Cummins also backed part-timer Travis Head to bowl some spin at Old Trafford if required — the South Australian averages 31.33 with the ball in Tests. “Even when he started his career with Australia, (Head) was basically the frontline spinner in ODI cricket,” Cummins said. “I think he’s got better and better … he defends himself well, uses a bit of drift as much as spin, and he’s quite clever. Lot a confidence in his bowling.” Moeen Ali of England. Photo by Richard Heathcote/Getty Images Source: Getty Images ENGLAND’S BRAVE TOSS CALL COULD DEFY 139-YEAR HOODOO Manchester’s notoriously indifferent weather had already made its mark on the fourth Test at Old Trafford before a ball was bowled. The long-range forecast prompted Australia to name their Test XI without a specialist spinner for the first time since 2012, while England went with the same configuration of their bowling attack at Headingley, with spinner Moeen Ali listed to bat at number three to accommodate the middle order. At the toss, both captains would have opted to bowl first, a decision Ben Stokes took much joy in when the coin fell his way for the fourth time this series. England would have to defy history to level the Ashes series — no Test side has ever elected to bowl first and win at Old Trafford, making the opening session even more crucial for the hosts. England made two breakthroughs before lunch but leaked 107 runs as the sun came out in Manchester to bathe the ground in pristine batting conditions. Bairstow takes one handed 'worldie' | 00:33 Former Australian captain Ricky Ponting was impressed by Australia’s positive intent, not sitting back and getting dictated to in the opening hours of play. “For Australia once they lost the toss, that first session was crucial,” Ponting said on Sky Sports. “Were they thinking about only needing a draw? Doesn’t look like it, they’ve come out with great intent.” Former Australian wicketkeeper Ian Healy was adamant England made the “wrong” call at the toss. “Both captains would have done it, which is wrong,” Healy said on Channel 9. “If Ben Stokes thought I am going to fire up these quicks of mine and really come at the Australians and get that crowd on its feet, it just hasn’t happened.” Ben Stokes of England. Photo by Ryan Pierse/Getty Images Source: Getty Images Former Australian international Callum Ferguson added: “It’s perplexing to me. They’ve disregarded history altogether. “In the last ten Test matches, the team batting first has made on average 386.” With the weather forecasted to intervene later in the Test, Stokes’ decision, coupled with the performance of his bowlers, has allowed the hosts to set the pace. Despite the favourable batting conditions, England continued to take wickets at regular intervals to disrupt Australia as partnerships were beginning to prosper. Four of Australia’s middle-order partnerships were over 45 runs (46, 59, 63 and 65) yet couldn’t kick on to “put the series to bed”, according to former England captain Nasser Hussain. “They’ve been sloppy, Australia,” Hussain said on Sky Sports. “Some soft dismissals, batters getting in, getting out. They could have put this series to bed by batting well today. “It’s a good pitch.” Broad fires early taking Uzzie | 00:35 MARNUS’ ‘SOFT DISMISSAL’ AFTER FINDING GOLDILOCKS STANCE Marnus Labuschagne was in the midst of the longest century drought of his Test career heading into the Old Trafford contest, going 20 consecutive knocks without reaching triple figures. The Australian No. 3 had not even passed fifty in eight innings since the start of the World Test Championship final against India, a worrying slump for the typically prolific Queenslander. He’s been guilty of needlessly throwing his wicket away, most noticeably during the second innings at Lord’s and Headingley. The dismissals were uncharacteristic for Labuschagne, who has looked a shadow of his former self over the past six weeks. “He’s just getting starts and getting out,” Australian teammate Usman Khawaja said this week. “It sucks … but I expect him to get big runs in the next couple of games.” Marnus 'slightly disappointed' by no ton | 00:37 Unfortunately for Labuschagne, he once again fell to a soft dismissal after making a useful start on day one of the Old Trafford Test — he reached his half-century in 114 balls but fell victim to England spinner Moeen Ali on his very next delivery. Ali, coming from over the wicket, turned an innocuous off-break into the right-hander’s pads, with England successfully reviewing the LBW decision. Labuschagne dropped to his haunches when three lights appeared on Hawkeye, rubbing his face in disbelief as he trudged off. “He has to be so sore with himself … gets to fifty and misses a ball he should never miss when you are in and batting for two or three hours,” former England captain Michael Atherton said on Sky Sports commentary. “That is a soft dismissal … much in the same way that Labuschagne rather gifted his wicket at Headingley, he has done it again here at Old Trafford.” Australian legend Ricky Ponting continued: “Slightly lazy from Labuschagne … there was no way in the world that ball should get you out.” Labuschagne has been maniacally tinkering with his batting stance throughout the series, as documented by the Sky Sports commentators during the Headingley Test — the constant technical changes suggest he has lost trust in his game. The 29-year-old continued experimenting ahead of the Old Trafford Test, spending more time in the nets than any of his teammates — Australian captain Pat Cummins joked he should move his hotel pillows towards the training facility. Labuschagne took guard several times before his first ball at Old Trafford on Wednesday, settling on what can be considered his Goldilocks stance — starting on middle stump with a trigger movement across the crease. Unlike the series opener at Edgbaston, where Labuschagne was guilty of fishing at outswingers outside off stump, he left the Dukes ball regularly and confidently, allowing harmless deliveries to sail through. Labuschagne played second fiddle during partnerships with David Warner, Steve Smith and Travis Head, allowing his teammates to dictate the tempo as he nudged and nurdled at the other end. He was also noticeably more confident against Mark Wood — at Headingley, he scored two runs from 42 balls against the England quick, while on Wednesday he managed 19 off 29 deliveries. Marnus Labuschagne of Australia. Photo by Clive Mason/Getty Images Source: FOX SPORTS ‘CALM DOWN’: WARNER IS ‘ALL OVER THE PLACE’ After twin failures during the third Ashes Test at Headingley, Australian opener David Warner fell victim to Chris Woakes for 32 (38) on day one at Old Trafford. Moments after the drinks break on Wednesday morning, the left-hander looked to press Woakes through the covers, instead edging behind to wicketkeeper Jonny Bairstow. He threw his head back in frustration before marching towards the sheds. Warner signalled his intent early in Manchester, thumping the first delivery of the match through the covers for a boundary. The 36-year-old, who vowed to maintain his aggressive mindset throughout the series, wasn’t afraid to attack anything wide, scoring the majority of his runs through point. “If you fear failure, I reckon you will fail,” Warner told the Vaughany and Tuffers Cricket Club podcast this week. “I have never feared failure, so I feel every game I go out thinking it could be my last. When you open the batting, you are going to get out, and you could get out first ball of the game, so I have had that instinct of backing myself and playing my way.” Warner has reached fifty once in nine knocks on this Test tour, averaging 24.11 since the start of the World Test Championship final against India. Speaking on Channel 9, former England cricketer David Lloyd called for Warner to “calm down” in the middle, pleading for the New South Welshman to bat with less urgency. “He is frantic. I don’t get it,” Lloyd said. “He is a wonderful player. He is 36 years of age. He’s seen it all, done it all. I think he should be so calm at the crease, and he looked skittish. He is all over the place at the crease. “It’s a long day opening the batting. Set your stall out, that’s the way to do it. It will get easier this afternoon, no doubt.” Lloyd also said he would have dropped Warner for reserve opener Marcus Harris after the Headingley Test. “I am outside looking in. I don’t know what he is like in the rooms, but I would have thought his time was up after the last game, and Marcus Harris would have come in. Stuart Broad is all over him,” Lloyd continued. “I can’t get away from the fact that he is 36 years of age. Calm down, just calm down a bit.” David Warner of Australia. Photo by Clive Mason/Getty Images Source: Getty Images ‘TOO EARLY FOR THAT’: PUNTER BAFFLED BY AUSSIES TACTIC Australian cricket legend Ricky Ponting was absolutely baffled when Alex Carey started farming the strike on day one of the Old Trafford Test, with the wicketkeeper looking to prevent England quick Mark Wood from bowling to the tail. Mitchell Marsh’s departure left Australia in a spot of bother at 7-255 on Wednesday afternoon, with Mitchell Starc joining Carey in the middle. The following over, Carey creamed a short ball from Wood towards deep point for what should have been a regulation single — but the pair didn’t bother running between the wickets. Boos echoed around the Manchester venue in response to the ignored single. Carey, unbeaten on 1 at the time, continued trying to keep strike against Wood, who had ripped through Australia’s tail during the first innings at Headingley. It allowed England to spread the field, preventing Carey from scoring boundaries. Since the start of 2022, Starc has averaged 6.00 against Wood in Tests, dismissed four times in 46 deliveries. Ponting argued that Starc’s batting didn’t warrant such treatment — the left-hander averages 26.62 with the bat in England, which is higher than David Warner’s equivalent figure, and has ten Test fifties to name. “It’s too early for that, as far as I’m concerned. Mitch Starc can bat. Pat Cummins in next, he can bat. I think Carey has to put some trust in Starc and Cummins,” Ponting said on Sky Sports commentary. “We saw Pat Cummins at Edgbaston do a really good job to get Australia over the line. They can still ink out tail-end runs. Looking back in the first three games, they’ve been very important at different times. “The tail-end runs now for Australia in this first innings are going to be crucial.” Starc backed up Ponting’s remarks, surviving to stumps unbeaten on 23 — incredibly, the left-hander currently averages 157.00 with the bat at Old Trafford. Mitchell Starc of Australia. Photo by Clive Mason/Getty Images Source: Getty Images","pubDate":"2023-07-19 23:39:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Danger sign Australia made a huge Ashes selection blunder as Marnus Labuschagne tries to talk down chances tourists will struggle","link":"https://www.dailymail.co.uk/sport/cricket/article-12317299/Australia-Ashes-selection-blunder-Marnus-Labuschagne.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Australia are hopeful their decision not to play a spinner at Manchester won't backfire, believing the Old Trafford wicket may buck the trend and turn less later in the game.","content":"Danger sign Australia made a huge Ashes selection blunder as Marnus Labuschagne tries to talk down chances tourists will struggle Aussies hopeful they won't need a spinner Moeen Ali has had some success already Labushagne says wicket should flatten out By Scott Bailey For Australian Associated Press Updated: 00:26, 20 July 2023 e-mail View comments Australia are hopeful their decision not to play a spinner at Manchester won't backfire, believing the Old Trafford wicket may buck the trend and turn less later in the game. The tourists' decision to go into the fourth Ashes Test without a spinner continued to raise eyebrows on Wednesday, with Ricky Ponting among those surprised by the decision. With Todd Murphy left out of the team and no frontline spinner picked for the first time since January 2011, Australia will be forced to rely on Travis Head as their main tweaker. Adding to the challenge for Australia is the fact they will be bowling last in the match, at a time when spin is usually the most prodigious and the injured Nathan Lyon has been a go-to option. Concern was heightened further when England spinner Moeen Ali was able to get some purchase out of the wicket, trapping Marnus Labuschagne lbw on 51. Australia are hoping their decision to not choose a spinner at Old Trafford won't backfire England spinner Moeen Ali has had some success already, trapping Marnus Labuschagne But Labuschagne said he believed that could have been a result of a thick grass cover left of the wicket, which will flatten out later in the game. 'Because the wicket has been undercover for a few days, it didn't have that really rock-hardness,' Labuschagne said. 'And the thatchy grass is spinning. So once that wears off, I think the middle of the week it's going to actually not spin so much. 'The ends will rough up, eventually, if the weather stays good. But I think it's actually going to spin less as the game goes on from the good part of the wicket.' Labuschagne was also adamant that Australia's extra batting had not created any complacency, after six men got out between 20 and 51 in their score of 8-299. England again questioned Australia's decision not to play a spinner on Wednesday, with Stuart Broad pointing out Old Trafford is generally a place where spin is effective. It came after Ponting also queried the decision in commentary. 'I was still surprised they didn't go in with one,' Ponting said during Moeen's second spell. Stuart Broad has questioned the Aussie decision, saying Old Trafford is usually good for spin Australian great Ricky Ponting also questioned the decision to leave out a spinner 'Your preference is always to go in with a spinner – unless you are brilliant at reading weather forecasts and cricket pitches. 'So if you haven't got one, you can be found out very easy.' Share or comment on this article: Danger sign Australia made a huge Ashes selection blunder as Marnus Labuschagne tries to talk down chances tourists will struggle e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 23:26:04","image_url":"https://i.dailymail.co.uk/1s/2023/07/20/00/73405953-0-image-a-79_1689807957177.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"What happened on Day 1 of the 4th ENG vs AUS Ashes 2023 Test in Manchester?","link":"https://www.sportskeeda.com/cricket/what-happened-day-1-4th-eng-vs-aus-ashes-2023-test-manchester","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":"Chris Woakes starred with 4/52 as England reduced Australia to 299/8 on Day 1 of the fourth Ashes 2023 Test at Old Trafford in Manchester on Wednesday, July 19. A number of Aussie batters got starts, but none could convert them into a big score. Stuart Broad struck early for the hosts after they won the toss and bowled first, trapping Usman Khawaja (3) leg before with a sharp delivery that nipped back and beat the batter’s defense. The struggling pair of David Warner and Marnus Labuschagne lifted the visitors with a second-wicket stand of 46. Warner did well to reach 32, but was foxed into a drive outside off stump from Woakes and nicked the ball to the keeper. Labuschagne and Steve Smith then added 59 runs for the third wicket. The latter got into 20s but dancing down the track and lofting Moeen Ali for a maximum over long-on. Australia went to lunch on Day 1 in a decent position at 107/2. Mark Wood dealt Australia a massive blow in the second session, trapping Smith leg before for 41 with a quick delivery that jagged back in. The senior Aussie batter paid the price for his premeditated shuffle across the stumps. Labuschagne and Travis Head then added 63 for the fourth wicket. However, Australian batters continued to give their wickets away after getting starts. Labuschagne brought up his first fifty of Ashes 2023, but fell immediately afterwards for 51. He missed a flick off Moeen and was trapped in front as England took a successful review. Head looked in reasonable control during his stay at the crease before perishing to Broad for 48, hooking the bowler straight to the fielder at fine-leg. With the scalp, Broad joined the elite 600-wicket club in Test matches. When Head was dismissed, Australia were in a spot of bother at 189/5. Mitchell Marsh, however, struck an impressive half-century, adding 65 runs for the sixth wicket with Cameron Green. After striking a couple of early fours, Marsh launched Moeen over long-on for six. A few overs later, he slammed the off-spinner for consecutive fours. Marsh reached his fifty off 56 balls by flicking Wood for a four. Just when Australia seemed to be getting some sort of control, Woakes’ double strike put England back on top. Green was trapped lbw by a skidder for 16, while Jonny Bairstow pulled off a blinder behind the wickets to end Marsh’s resistance for 51. Woakes produced a nick off a brilliant probing delivery and Bairstow flung to his right to pull off a one-handed blinder. Alex Carey and Mitchell Starc added a crucial 39 runs for the eighth wicket, but Woakes struck another crucial blow just before stumps. Carey (20) made a late attempt to leave a length delivery outside off, but only managed to nick the ball to the keeper. Australia went on to stumps on Day 1 with Starc unbeaten on 23 and Pat Cummins on 1. Quick Links","pubDate":"2023-07-19 23:23:05","image_url":"https://staticc.sportskeeda.com/editor/2023/07/22d93-16897893182101-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"WC opener to go ahead despite ‘alarming incident’ in Auckland, NZ PM confirms — World Cup Daily","link":"https://www.foxsports.com.au/football/matildas/fifa-womens-world-cup-2023-matildas-news-cathy-freeman-sydney-2000-olympics/news-story/5dbc217fee78de73a1e578fbf5043d02","keywords":null,"creator":null,"video_url":null,"description":"New Zealand Prime Minister Chris Hipkins has confirmed the World Cup opener between New Zealand and former winners Norway will go ahead on Thursday evening.","content":"New Zealand Prime Minister Chris Hipkins has confirmed the World Cup opener between New Zealand and former winners Norway will go ahead on Thursday evening. It comes in the wake of confirmation from New Zealand police that a gunman opened fire at a central Auckland building site on Thursday in an “alarming incident” that left two people and the alleged shooter dead. The Women’s World Cup kicks off with New Zealand taking on Norway in Auckland (at 5pm AEST) before co-hosts Australia face the Republic of Ireland (8pm) in front of 80,000 fans in Sydney. MORE WOMEN’S WORLD CUP NEWS Who’s in the Matildas squad and when do they play their Women’s World Cup games? All 64 World Cup fixtures and full Matildas schedule What time do the Matildas play their first World Cup game? Excitement builds ahead of WC opener | 02:00 “What has unfolded is understandably alarming and we are reassuring the public that this incident has been contained and is an isolated incident. We can also advise that this is not a national security risk,” a statement from New Zealand police read. “Police are now commencing an investigation into what has occurred this morning. Cordons remain in place and we are continuing to ask the public to stay away from the area as our work continues.” The incident is reported by local media to have taken place in a building close to the fan zone for the Women’s World Cup and near Norway’s team hotel on Quay Street. Norway captain Maren Mjeldeb said, per Stuff.co.nz : “Everyone probably woke up quite quickly when the helicopter hovered outside the hotel window and a large number of emergency vehicles arrived. At first we didn’t know what was going on, but eventually there were updates on TV and the local media. “We felt safe the whole time. FIFA has a good security system at the hotel, and we have our own security officer in the squad. Everyone seems calm and we are preparing as normal for the game tonight. Then we may have to adapt if there are any instructions from the authorities.” The New Zealand Women’s National Team said it was “shocked” by the incident in a statement that confirmed all team and staff are “safe”. It added: “Preparations for the game tonight at Eden Park will continue as planned.” The US Women’s National Team, whose camp is based in Auckland, released a statement on Thursday confirming all players and staff are “accounted for and safe”. “Our security team is in communication with local authorities and we are proceeding with our daily schedule,” added the statement. The Phillipine Women’s National Team also confirmed all its players and staff were “safe inside Movenpick Hotel”. “The team is preparing to depart for Dunedin for the match against Switzerland on Friday,” the statement read. Auckland Mayor Wayne Brown, meanwhile, described it as a “scary situation” and advised people to “stay at home” and “avoid travel into the city centre”. He told local TV network TVNZ: “This dreadful situation couldn’t have come at a worse time when the world has its eyes on us. It’s dreadful, particularly since we have never had an incident like this before. It’s very scary.” Former Football Fern Maia Jackman was in the fan zone as the unfolded, providing her account of events to the NZ Herald . “It’s pretty scary actually,” she said. “So they pushed us to the back of the cloud where we are and we’re just trying to keep sane. There’s lots of security and lots of uncertainty.” The Cloud, which was set up as the Women’s World Cup fanzone, was locked down in response to the incident with the Herald reporting people there are “safe”. Journalist Suzanne McFadden, meanwhile, was a guest on the TVNZ Breakfast show that was broadcasting from The Cloud. According to Stuff.co.nz , she said around 30 people — including girls from the Ellerslie Football Club and former Football Ferns — were moved towards the back of the venue into a kitchen area. “The first thing we’d noticed was the police helicopter overhead and then we were moved out the back — we thought we were going there to be filmed. And then we were quietly told there was a gunman outside,” McFadden said. Matildas call out FIFA over gender gap | 01:35 WORLD CUP WILL ‘WAKE UP’ NEW ZEALAND’S LOVE OF FOOTBALL New Zealand hosts Norway at Eden Park on Thursday to open the Women’s World Cup. Jitka Klimkova said on Wednesdsay that staging the Women’s World Cup will “wake up” New Zealand’s passion for football. Football remains well behind rugby, cricket and other sports in popularity in New Zealand, which is jointly hosting the World Cup with Australia. New Zealand have never won a Women’s World Cup game in 15 attempts, but they hope to change that when they face the 1995 champions Norway in the first game of the tournament on Thursday. “It is an opportunity for this country to not just be a rugby country but wake up their love for football,” said their Czech coach Klimkova. Taking up the theme, captain Ali Riley added: “Hopefully this time we will achieve our goal of winning a World Cup game and doing that at home, and that will make it my greatest game of my career. “This feels like an opportunity with the sporting culture, inspiring young people.” After facing Norway at the 50,000-capacity Eden Park -- better known for hosting the All Blacks rugby team -- New Zealand face minnows the Philippines and Switzerland in Group A. New Zealand are ranked 26th in the world and have won just once in their last 11 matches, but Klimkova is backing them to shine in front of their own fans. Matildas set up camp at Brisbane base | 01:34 “The hard work and preparation brought us to where we are now,” she said. “At this stage the preparation is done and now it is time to shine, and I really believe these players will shine.” Norway have fallen away since triumphing in 1995. They were thumped 8-0 in the group stage by hosts and eventual champions England at the 2022 Euros. Their Barcelona winger Caroline Graham Hansen said the World Cup was a chance to redeem themselves and a fresh start. “It is a year ago, a long season behind us,” she said, casting her mind back to their Euro flop. “I think everybody has had time to focus on their club while working on stuff with the new coaching team, so everything feels very different, nothing to compare with how we left the tournament last year. “It is a clean slate, we have a possibility to start afresh and to get going again. “That is the beauty of football -- there is always a new chance, and now we have it again.” — AFP MATILDAS ‘VERY EMOTIONAL’ AFTER FREEMAN VISIT Matildas captain Sam Kerr has repeatedly said she wants to lead Australia to World Cup glory and create her own ‘Cathy Freeman moment’. But Kerr and her Tillies teammates last week received a very special visit from the Australian sporting legend herself. The Sydney 2000 Olympic Games 400m gold medallist Freeman, a proud Kuku Yalanji woman, is the sporting hero of ‘over half the team’, and joined the team in Melbourne last Wednesday. Kerr told Freeman: “You’re an inspiration to the whole team … You’ve been an idol for all of us for so long. What you did for us as a country, hopefully we can replicate even half of that. We’ll remember this night for the rest of our careers. It’s been amazing.” “A lot of girls were very emotional,” Matildas veteran Aivi Luik said. “I still can’t believe that happened because a couple years ago, we were going through some questions about who your sporting hero is and why, and over half the team said that Cathy Freeman was their hero. “The staff, because of that, tried to get her in, and bless her heart, she came in. “She doesn’t do a lot of public speaking but she did that for us. We asked her questions informally and she spoke back to us just like she was a friend, and we got a lot of good insight from that.” FEATURE: How 2019 WC heartbreak exposed Matildas’ great flaw … and the brutal journey to fix it Cathy Freeman of Australia celebrates winning gold in 2000. Source: News Corp Australia WOMEN’S WORLD CUP PREVIEW PODCASTS – LISTEN NOW! PART ONE: Preview of EVERY group and which players could catch your eye PART TWO: Three burning Matildas questions and why their Group B rivals are a threat Freeman told the Aussies: “The power of you just being here is unimaginable. It’s beyond your wildest dreams what you’re going to be able to do. “You’re going to be able to get into the blood of everybody who is on the journey with you. It’s just a crazy, wild ride. “You’re writing your name in history, ladies. And you should be really proud of that.” Luik said: “She told us was that we know who we are, we know why we do this, and while we want to perform and give results for others outside the circle, at the end of the day, you believe in yourself and you do it for yourself.” “All athletes do what they do because they love the sport, and (Freeman said) to not lose track of that, and that gives you the confidence to go out there and do your job.” Luik praised Freeman’s resilience to perform despite having the “weight of the nation” on her shoulders at the Olympics. “She was just one and we’re a whole team, so I think we’re quite lucky in that regard that we have our friends and teammates there to support each other,” Luik said, “We came away from that feeling a little bit of a weight off our shoulders, and just completely inspired.” Freeman and her family joined the Matildas for a team dinner and was presented with a signed team jersey. Australia’s opening match of the tournament is against Ireland on Thursday night in Sydney – at the same stadium where Freeman made history in 2000. Freeman celebrates her iconic win. Source: Supplied MORE NEWS MATILDAS SQUAD: What you need to know about every Aussie FIXTURES: All 64 World Cup games and full Matildas schedule EVERY SQUAD: 736 players, one trophy — Every World Cup squad locked in In February, Sam Kerr said: “The legacy left there from that one special moment at the 2000 Olympics was everlasting for all of us. “Ask half the girls in the team, their idol growing up was Cathy Freeman. “That’s the legacy we want to leave – that we inspire the nation, we move the nation to believe in women’s football, believe in the Matildas.” And Kerr also wrote in her book, My Journey To The World Cup: “I loved her so much. “She was so fast and strong, and she coped so well with the unbelievable pressure that was put on her. I watched her race in the Sydney 2000 Olympics over and over and over again.”","pubDate":"2023-07-19 22:44:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"ASHES DAY ONE, FOURTH TEST - SESSION-BY-SESSION: Honours shared as England take four wickets in the evening after Australia raced to 107 for two in dominant start","link":"https://www.dailymail.co.uk/sport/cricket/article-12317041/ASHES-DAY-ONE-FOURTH-TEST-SESSION-SESSION-Honours-shared-England-four-wickets-evening-Australia-raced-107-two-dominant-start.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH AT OLD TRAFFORD: England finished day one of the fourth Ashes Test on top with Pat Cummins and Mitchell Starc at the crease on 299 for eight.","content":"ASHES DAY ONE, FOURTH TEST - SESSION-BY-SESSION: Honours shared as England take four wickets in the evening after Australia raced to 107 for two in dominant start Steve Smith and Marnus Labuschagne guided Australia to 107 for two at lunch The visitors added 80 more for the loss of two before England took the evening ASHES NOTEBOOK: Pope gives a thumbs-up while McGrath takes scenic route By Lawrence Booth for the Daily Mail Updated: 21:53 BST, 19 July 2023 e-mail View comments England finished day one of the fourth Ashes Test on top with Pat Cummins and Mitchell Starc at the crease on 299 for eight. Chris Woakes starred for the hosts with the ball - taking four wickets including two in one over - while Stuart Broad took his 600th Test scalp to join Jimmy Anderson in exalted company. Anderson himself struggled to dazzle at the ground that has a stand and a bar named after him, while Marnus Labuschagne also had a moment to forget after once again throwing away his wicket to Moeen Ali's off-breaks. There was also a moment of redemption for the much-maligned Jonny Bairstow who took a terrific low grab after coming under fire for his keeping so far this series. Here, Mail Sport's Lawrence Booth takes you through the action from Old Trafford, session-by-session. Stuart Broad made history in taking his 600th Test wicket after dismissing Travis Head Australia ended the day on 299 for nine with captain Pat Cummins (right) at the crease Morning – Australia Invited to bat, Australia for once lost Usman Khawaja early, trapped in front to give Stuart Broad his 599th Test wicket. Chris Woakes then had David Warner caught behind for 32 to make it 61 for two – and almost had Steve Smith caught at long leg first ball. But Smith and Marnus Labuschagne took the tourists to 107 for two by lunch, at a Bazball-esque 4.28 an over. Afternoon – shared In a session of nip and tuck, Australia added 80 runs for the loss of Smith and Labuschagne – who are threatening to lose their pre-series tag as the 'wickets England want most'. Smith was undone by Wood's pace, while Labuschagne – after bringing up his first half-century of the series – played all round an off-break from Moeen Ali. Evening – England Four wickets, including three for Woakes, left England with a slight edge at the end of another absorbing day. Chris Woakes (right) took three of the four wickets to fall in the final session - including two in one over Mitchell Marsh had threatened to turn things Australia's way with a rapid half-century, but he was brilliantly caught by the under-fire Jonny Bairstow as Woakes snared him and Cameron Green in the same over. Verdict - honours split between the two sides. Play of the day With apologies to Stuart Broad’s achievement of 600 Test wickets, there was no better moment than Jonny Bairstow’s right-handed lunge to cling on to an edge from Mitchell Marsh, having briefly been sent the wrong way. Bairstow has spent most of the series under the wicketkeeping microscope – and celebrated on his backside with a mixture of relief and jubilation. Jonny Bairstow took a fantastic catch low to his right have already begun moving the other way Share or comment on this article: ASHES DAY ONE, FOURTH TEST - SESSION-BY-SESSION: Honours shared as England take four wickets in the evening after Australia raced to 107 for two in dominant start e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:53:14","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73396753-0-image-a-70_1689799811253.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Stuart Broad revels in 'special' feeling after taking a landmark 600th Test wicket - as England restrict Australia to 299-8 on day one of the fourth Ashes Test at Old Trafford","link":"https://www.dailymail.co.uk/sport/cricket/article-12316827/Stuart-Broad-revels-special-feeling-taking-landmark-600th-Test-wicket-England-restrict-Australia-299-8-day-one-fourth-Ashes-Test-Old-Trafford.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Stuart Broad is just the fifth man to reach the milestone and only the second pace bowler, after his England team mate Jimmy Anderson to achieve the feat.","content":"Stuart Broad revels in 'special' feeling after taking a landmark 600th Test wicket - as England restrict Australia to 299-8 on day one of the fourth Ashes Test at Old Trafford Stuart Broad dismissed Travis Head to reach the milestone of 600 Test wickets He is just the fifth man to achieve the feat and only the second pace bowler Broad has impressed, taking more wickets this series than any other bowler (18) By Aadam Patel At Old Trafford Updated: 22:24 BST, 19 July 2023 e-mail View comments Stuart Broad admitted he felt ‘really special’ after taking his 600th Test wicket for England, as Australia ended on 299 for eight on the first day of the fourth Ashes Test in Manchester. ‘It’s got a nice ring to it - getting your 600th Test wicket from the James Anderson End. There’s something pretty special about that,’ said Broad after getting Travis Head out in the first over after tea. Broad is just the fifth man to reach the milestone and only the second pace bowler , after Jimmy Anderson to achieve the feat. ‘I got my 500th Test wicket here in front of no crowd (due to Covid). My dad was here as he was the match referee. So it felt pretty special today to get an ovation from the Old Trafford crowd. 'I’ve always loved playing here. To get my 600th here in front of a full house on the first day of an Ashes Test is pretty memorable,’ Broad added. Stuart Broad became just the fifth man to reach the milestone of 600 Test wickets and only the second pace bowler, after England team mate Jimmy Anderson The veteran finished the day with two wickets after earlier dismissing opener Usman Khawaja Broad's 600th Test scalp was Travis Head, who fell just two runs shy of of his half century With more wickets (18) than anyone else in the series, Broad led England off on a day where Ben Stokes’ side bowled well after winning the toss and choosing to bowl first, with Chris Woakes the pick of the England bowlers, taking four wickets. And Broad admitted that he has felt rejuvenated under Stokes and Brendon McCullum since he was recalled last summer. ‘I have definitely got an addiction to Test cricket and the competitive side of it. Ultimately Baz and Stokesy have given me a new lease of life in a way. It is such a free changing room, it feels in the nicest possible way that you are playing club cricket, but at the highest level. That is such a great place to be as a 37-year-old,’ said Broad. ‘I would argue it’s been the most enjoyable year of my Test career which is an awesome thing to say at 36 or 37.’ Broad has played in all five of England’s Tests so far this summer and his 149 wickets across his career against Australia are the most by any bowler against the tourists. ‘I am very competitive on the field and Australia bring the best out of me on that front because they are so competitive as well. It’s been great to be involved in some brilliant battles this summer with Australia and I’ve loved every moment of this series. It’s the series that keeps on giving really,’ said Broad. And Australia’s Marnus Labuschagne was full of praise for the England quick. Marnus Labuschagne was full of praise for Broad after witnessing the Englishman's display Moeen Ali (middle) took the crucial wicket of Labuschagne who was dismissed for 51 runs ‘His statistics speak for themselves. Especially this series, he’s been very impressive to show his versatility on wickets that don’t have as much pace and nip at times but he’s able to create really good angles on the crease with his swing. He was able to work on getting one to shape away a little bit and then he’s able to go the bouncer plan. When you’re doing that, it shows his versatility. We know that if conditions are good for bowling, he’s always going to be a handful but he’s shown through the series and through his career that when it’s not, he can still keep it tight, wait for his opportunity and work a batter out.’ Labuschagne insisted that it was a day where Australia missed out, with himself getting out for 51 after playing all around a straight delivery from Moeen Ali. ‘Where we were, and how many guys got themselves in, I think we would be slightly disappointed with no-one getting a big score,’ said Australia’s No 3. Share or comment on this article: Stuart Broad revels in 'special' feeling after taking a landmark 600th Test wicket - as England restrict Australia to 299-8 on day one of the fourth Ashes Test at Old Trafford e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:39:42","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73401571-0-image-a-93_1689798846053.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"TOP SPIN AT THE TEST: Stuart Broad becomes the fifth bowler to reach 600 wickets - taking his tally against Australia to 149 in the process - and only Don Bradman has more visiting Test runs in England than Steve Smith","link":"https://www.dailymail.co.uk/sport/cricket/article-12316955/TOP-SPIN-TEST-Stuart-Broad-fifth-bowler-reach-600-wickets-taking-tally-against-Australia-149-process-Don-Bradman-visiting-Test-runs-England-Steve-Smith.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"TOP SPIN AT THE TEST: The fourth Ashes Test got underway at Old Trafford, as England's bid for an unlikely series win continued with Australia needing just a draw to retain the urn.","content":"TOP SPIN AT THE TEST: Stuart Broad becomes the fifth bowler to reach 600 wickets - taking his tally against Australia to 149 in the process - and only Don Bradman has more visiting Test runs in England than Steve Smith Stuart Broad overtook Ian Botham to have the most wickets against Australia Jimmy Anderson is the only fast bowler with more Test wickets than Broad now Broad was born for Ashes cricket - it was a fitting stage for his 600th wicket By Lawrence Booth for the Daily Mail Updated: 21:33 BST, 19 July 2023 e-mail View comments Day one of the fourth Ashes Test got underway at Old Trafford on Wednesday , as England's bid for an unlikely series win continued with Australia needing just a draw to retain the urn. England wasted little time in getting going, though, Usman Khawaja going for three to move Stuart Broad onto 599 Test wickets - before later getting himself over the line to record yet another impressive milestone . Travis Head proved to be the 600th victim for England's long-serving fast bowler - the dangerous No 5 following team-mates Warner, Steve Smith and Marnus Labuschagne who all got in but failed to record a big score. By stumps, Australia were 299 for eight with bowlers Pat Cummins and Mitchell Starc at the crease after Chris Woakes took his tally to four after dismissing all-rounders Cameron Green, Mitchell Marsh and the notorious wicket-keeper Alex Carey. Here, Mail Sport's Lawrence Booth takes you through some of the stats you may have missed from the first day of the fourth Test at Old Trafford. Stuart Broad grabbed the headlines with his 600th Test wicket for England in dismissing Travis Head Marnus Labuschagne threw away his wicket once again to Moeen Ali after being dismissed on 51 Stuart Broad became the fifth bowler – and the second seamer, after Jimmy Anderson – to tick off 600 Test wickets when Travis Head pulled him to Joe Root at long leg. It was also Broad’s 149th wicket against Australia – breaking Ian Botham’s England record of 148. Shane Warne remains the Ashes record-holder, with 195. Steve Smith’s innings of 41 means only Don Bradman has scored more Test runs among visiting batsmen in England: 2,674 at an average of 102 to Smith’s 2,113 at 55. Now relegated to third is Allan Border, with 2,082 at 65. Four wickets for Chris Woakes took his Test record at Old Trafford to 27 wickets at just 17 apiece – and his career average below 30 for the first time since the 2021-22 Ashes. Share or comment on this article: TOP SPIN AT THE TEST: Stuart Broad becomes the fifth bowler to reach 600 wickets - taking his tally against Australia to 149 in the process - and only Don Bradman has more visiting Test runs in England than Steve Smith e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:33:54","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73400549-0-image-a-51_1689798515421.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Broad inspired by Australians to wreak havoc on nation","link":"https://www.perthnow.com.au/sport/cricket/broad-inspired-by-australians-to-wreak-havoc-on-nation-c-11330558","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Stuart Broad has taken his 600th Test wicket in the fourth Ashes Test, claiming the record for the most potent bowler in history against Australia.","content":"Stuart Broad has detailed how the likes of Glenn McGrath and Shane Warne inspired him to be Australia's biggest tormenter in Test history and the latest member of the 600-wicket club. Broad became the second seamer, behind teammate James Anderson, and fifth man overall to reach the 600-wicket milestone on Wednesday, when he had Travis Head caught hooking. The wickets of Usman Khawaja and Head at Old Trafford took Broad's tally against Australia to 149, one clear of Ian Botham for the most ever against the nation. And according to Broad, it was a childhood spent watching Australia winning that made him want to emulate their dominant side of the 1990s and early 2000s. \"I grew up completely obsessed watching Ashes cricket and I suppose that's why some of my heroes are Warnie, Glenn McGrath, some of the great Aussie team,\" Broad said. \"As a kid you are influenced by winning sides. \"It also built up my steeliness to want to be part of England teams that could win the Ashes after going through a whole childhood without us lifting them.\" Broad also spent six months playing for Hoppers Crossing in south-west Melbourne as a 17-year-old, another influence he claims has been crucial. \"I probably grew up with a bit more of an Australian mindset rather than a sort of England mindset of the 1990s,\" Broad said. \"Going to Hoppers Crossing was a great experience. \"Opening batting, opening bowling, got into the competitive side of the Australians and loved the battle.\" It was fitting the milestone came against Australia, who went to stumps on day one of the fourth Test on 8-299. From the moment Broad took 5-37 against them at The Oval to win England the Ashes in the 2009 decider, he has been a problem for Australia. In all, 102 of his 149 wickets against Australia have come in England, where he averages 26.14 against them in home conditions. The 37-year-old is perhaps the biggest reason Australia have not won an Ashes series in England since 2001. Broad's spell at The Oval in 2009 won England the Ashes, while his return of 11-121 at Chester-le-Street in 2013 ended any chance of Australia drawing that series. The seamer's finest hour, at Trent Bridge in 2015, also ended Australia's Ashes chances in that match, his 8-15 ensuring England would win that series. Broad has also silenced Australia's best batsmen, famously getting David Warner's wicket for the 16th and 17th time at Headingley earlier this month. He has also removed former captains Steve Smith and Michael Clarke 11 times. The fact he is leading wicket-taker in this series, with 18 at 25.94, also continues to give England hope of coming back from 2-0 down. BOWLERS WITH 600 TEST WICKETS Muttiah Muralitharan - 800 Shane Warne - 708 James Anderson - 688 Anil Kumble - 619 Stuart Broad - 600 MOST WICKETS AGAINST AUSTRALIA Stuart Broad - 149 Ian Botham - 148 Courtney Walsh - 135 Richard Hadlee - 130 Curtly Ambrose - 128 Bob Willis - 128","pubDate":"2023-07-19 20:26:19","image_url":"https://images.perthnow.com.au/publication/C-11330558/3b3a4aec25fae2fabd504e4729aa716cf90cf9b1-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"LAWRENCE BOOTH: Marnus Labuschagne's laziness means he is losing his lustre as the Australian was dismissed by Moeen Ali AGAIN as the No 3's Ashes struggles continue","link":"https://www.dailymail.co.uk/sport/cricket/article-12316791/LAWRENCE-BOOTH-Marnus-Labuschagnes-laziness-means-losing-lustre-Australian-dismissed-Moeen-Ali-No-3s-Ashes-struggles-continue.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH: No one leaves the field more disconsolately than Labuschagne, no one looks so bereft at their dismissal. He had just brought up his first half-century of the summer.","content":"LAWRENCE BOOTH: Marnus Labuschagne's laziness means he is losing his lustre as the Australian was dismissed by Moeen Ali AGAIN as the No 3's Ashes struggles continue Marnus Labuschagne's wicket is slowly becoming less pivotal for England The Australian No 3 has made just one half century so far during the Test summer Four wickets for Chris Woakes puts England on top at the end of the first day By Lawrence Booth for the Daily Mail Updated: 21:21 BST, 19 July 2023 e-mail 3 View comments As the big screen confirmed his fate, Marnus Labuschagne’s head slumped. He turned towards the dressing-room with the agility of an oil tanker, then trudged off, the hull apparently bumping along the seabed. No one leaves the field more disconsolately than Labuschagne, no one looks so bereft at their dismissal. It wasn’t any consolation that he had just brought up his first half-century of the summer. In some ways, it just made things worse. The next ball he faced was a standard off-break from Moeen Ali . It was tossed up a touch and turned a bit – but on the 30th anniversary of Shane Warne ’s surprise here for Mike Gatting, it was no Ball of the Century. And yet Labuschagne missed a gentle work to leg. Umpire Joel Wilson said not out, but that isn’t always the end of the matter: when England reviewed, DRS flashed three reds. For the batsman, there wasn’t even any umpire’s-call orange to get indignant about. For the second Test in succession, Labuschagne had given it away against Ali, a cricketer regarded by many Australians as a luxury pick – not least since he is now England’s No 3. Marnus Labuschagne left the crease disconsolate after a tame dismissal by Moeen Ali The Australian No 3 had made his first 50 of the Test summer at Old Trafford on Wednesday He was dismissed by the English spinner for the second Test match in a row, the ball hitting his pad plum in front of the stumps At Headingley, Labuschagne’s careless slog-sweep against him on the second afternoon had opened the door for England, and was followed moments later by Ali’s dismissal of Steve Smith. Here, Labuschagne had helped take Australia to 183 for three moments before tea – a healthy position after England had chosen to bowl. Five more minutes, and he might have gone on to play the day’s decisive hand. Up in the commentary box, the former Australian captain Ricky Ponting called his demise ‘slightly lazy’ – a waste after playing what he felt had been his best innings of the series. Later, Labuschagne echoed the description. ‘I was happy with my decision-making, which is the part that has been frustrating me,’ he said. ‘I was probably a little bit lazy trying to turn it to the leg side, and Moeen got me. But I was happy with where I was from a technical space, to give myself as much access to the ball as I can.’ And there were, it’s true, a couple of vintage strokes. He got going with a punched off-drive for four off Stuart Broad, and later dealt with one of Mark Wood’s 90mph detonations with a neat clip through midwicket. He twice played second fiddle – first to Smith, then to Travis Head. By and large, it was music to Australian ears. The experts, though, had spotted yet another tweak in a summer full of them, with Labuschagne now using a middle-stump guard in his bid for technical nirvana. He had begun the series on off stump, a consequence perhaps of getting outside the line to avoid falling lbw on slow county pitches with Glamorgan. But he ended up edging his first ball at Edgbaston through to Bairstow, and soon moved to middle and leg. Here, he looked more balanced, but this latest fiddle hinted at a restlessness that has dogged his summer. He has now got to 20 seven times out of nine on this current trip to England this summer Australia's Labuschagne had started the series as the World No 1 ranked batter in Test cricket It’s not that Labuschagne isn’t giving himself a chance. Starting with the World Test Championship final against India at The Oval, he has got to 20 seven times out of nine on this trip. But, until yesterday, he had not passed 47. That’s the kind of record England would happily accept from Ali at No 3, but Labuschagne began this series as the world’s top-ranked batsman, with a propensity for going big: five of his 10 Test hundreds have been 162 or more. During the 2019 Ashes, when he emerged from the shadows as a concussion substitute for Smith to play a central role in Australia’s retention of the urn, he scored four half-centuries – and still ended up slightly unfulfilled. This time, though, it is as if his hunger has got the better of him. After reaching for that first ball of the Ashes, with fatal consequences, he has not shaken off the sense that he is chasing success, rather than allowing success to come to him. His wicket is losing its appeal as one that England seek more than others, with that honour instead passing to Usman Khawaja, Travis Head and even Mitchell Marsh There is also a growing gap between his record at home, where he has scored nine Test hundreds and averages 70, and abroad, where he has scored one and averages 37. Above all, he is losing his tag as one of the wickets England crave most. It is passing instead to Usman Khawaja, Head and even Mitchell Marsh. Smith is still up there, despite himself passing 50 only once. But Labuschagne has shed some of his lustre. He has a maximum of three innings left to right that wrong, which will mean more work with the dog-stick for Australia’s tireless backroom staff, and possibly another tinker or two when he takes guard. If not, the sight of Labuschagne dragging himself from the middle as if he carrying a sack of coal may define a summer that refuses to get going. Share or comment on this article: LAWRENCE BOOTH: Marnus Labuschagne's laziness means he is losing his lustre as the Australian was dismissed by Moeen Ali AGAIN as the No 3's Ashes struggles continue e-mail Add comment Comments 3 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:21:54","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73400809-0-image-a-44_1689797487561.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Honours even in fourth Ashes Test as Broad joins 600 club","link":"https://www.news24.com/sport/Cricket/england-quickie-broad-joins-600-test-wicket-club-20230719","keywords":null,"creator":null,"video_url":null,"description":"England's Stuart Broad became just the fifth bowler to take 600 Test wickets, as Australia ended Wednesday's opening day of the fourth Test at Old Trafford on 299-8.","content":"England's Stuart Broad became just the fifth bowler to take 600 Test wickets, as Australia ended Wednesday's opening day of the fourth Test at Old Trafford on 299-8. LIVE | England v Australia, fourth Ashes Test England's Stuart Broad became just the fifth bowler to take 600 Test wickets, as Australia ended Wednesday's opening day of the fourth Test at Old Trafford on 299-8. Marnus Labuschagne and Mitchell Marsh each made 51 after England captain Ben Stokes won the toss in a match the hosts must win to maintain their hopes of regaining the Ashes at 2-1 down with two to play. Chris Woakes led England's pace attack with 4-52 in 18.5 overs while Broad took 2-68 in 14 en route to his landmark. James Anderson was the only change to the England side that won the third Test at Headingley by three wickets. On his Lancashire home ground a fortnight short of his 41st birthday, Anderson had a frustrating day. England's all-time leading Test bowler with 688 wickets, had figures of 0-43 in 17 overs. History is against England. No side has won a Test at Old Trafford after winning the toss and bowling. Broad was aiming to heap further misery on David Warner, having already dismissed the Australia opener 17 times in Tests - including twice for a total of just five runs at Headingley. But from Wednesday's first ball, Warner thrashed a wide delivery from Broad for four. Broad, however, moved to 599 Test wickets when he had Usman Khawaja, Australia's other opener, lbw for three. Woakes struck next to end a second-wicket stand of 46 when he had Warner caught behind off an edged drive, following an assured 32. The next delivery saw star batsman Steve Smith top-edge a pull off Woakes that just cleared Mark Wood at fine leg before going for four. An increasingly confident Smith drove off-spinner Moeen Ali for a straight six. Having made 41, on a ground where four years ago his double century helped seal a 185-run win over England, Smith was lbw to express quick Wood. Head was struck on the helmet by a Wood bouncer early in his innings and again looked uncomfortable against the short ball. But he battled through. Both Head and Labuschagne unfurled several fine drives. Labuschagne, however, fell one ball after completing his fifty, lbw to Moeen - the only specialist spinner on either side after Australia dropped Todd Murphy. Australia were 187-4 at tea only to lose Head five balls after the resumption as Broad took his 600th Test wicket. Left-hander Head had made 48 when he hooked at a Broad bouncer and Joe Root held a low catch as he ran in from the boundary at fine leg. Marsh, who had marked his first Test since 2019 with a hundred at Headingley, again drove strongly and made England pay for any loose deliveries as he led the way during a partnership of 65 with fellow all-rounder Cameron Green. Their stand was broken when the recalled Green was lbw to Woakes. Australia's 254-6 became 255-7 when Jonny Bairstow, whose wicketkeeping has proved fallible this series, held a one-handed diving catch to remove Marsh from an outside edge off Woakes. The crowd roared in celebration as Marsh departed after hitting seven fours and a six in a quickfire stay of 60 balls. Alex Carey almost made it through to stumps but fell to the new ball, caught behind off Woakes trying to withdraw his bat. Mitchell Starc was 23 not out at the close. England have won 13 of their last 16 Tests at Old Trafford but have not enjoyed an Ashes victory at the Manchester ground since Ian Botham hit a celebrated hundred in 1981.","pubDate":"2023-07-19 20:20:11","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Australia’s spin gamble questioned as England look to defy 139-year hoodoo: Day 1 Talking Points","link":"https://www.foxsports.com.au/cricket/the-ashes/australias-spin-gamble-questioned-as-england-look-to-defy-139year-hoodoo-day-1-talking-points/news-story/56d35753c0b2365ed4e83330aec2f594","keywords":null,"creator":null,"video_url":null,"description":"England has edged ahead in the fourth Ashes Test at Old Trafford after Chris Woakes rocked Australia’s middle order on Wednesday afternoon.","content":"England has edged ahead in the fourth Ashes Test at Old Trafford after Chris Woakes rocked Australia’s middle order on Wednesday afternoon. Australia is 8-299 at stumps on day one , with Marnus Labuschagne and Mitchell Marsh each scoring half-centuries as the visitors failed to capitalise on handy partnerships in Manchester. Woakes, who finished the day with four wickets, knocked over Marsh and Cameron Green in the same over after tea to put England in the superior position at stumps. The Old Trafford Ashes Test will resume on Thursday at 8pm AEST. ‘BLOWS MY MIND’: WILL AUSSIES REGRET SELECTION CALL? Did Australia make a mistake dropping Todd Murphy ahead of the Old Trafford Test? Earlier this week, England’s Moeen Ali warned against leaving out your strike spinner in Manchester, the venue that hosted Shane Warne’s Ball of Century — and the tweaker proved exactly why on Wednesday afternoon. The first delivery of Ali’s second spell spun sharply, raising some eyebrows around Old Trafford. A couple of overs later, he turned a delivery past Marnus Labuschagne’s inside edge, trapping the Queenslander on the pads for 50. Stuart Broad claims 600th Test wicket | 01:20 Ali continued troubling Australia’s right-handers on the dry wicket, with his varying turn proving difficult to tame. The 36-year-old’s probing spell would have left Australian selectors briefly wondering whether they made the right call. “I was surprised they didn’t go in with (a spinner) … if you haven’t got one, you can be found out very easily,” Australian legend Ricky Ponting said on Sky Sports. “Moeen Ali got one to turn, I wouldn’t have expected that by looking at the pitch this morning.” Former Australian captain Mark Taylor continued on Channel 9: “Now that Australia are bowling last in this Test match, you would have loved to have a spinner at your disposal.” READ MORE ‘LET IT SLIP’: Aussies could rue Ashes waste as stars stumble amid epic Broad feat ‘HE CAN BELIEVE IT’: Under-siege star flips Ashes script with absolute stunner Former England opener Mark Butcher was stunned by the omission, telling Sky Sports: “Australia not playing a spin bowler blows my mind a bit … it feels quite defensive. “They don’t have the ability then to change it up should things not work with the seam bowlers.” Former New Zealand wicketkeeper Ian Smith also slammed the decision, arguing Australia could be left red-faced over the coming days. “They would never have considered this if Nathan Lyon was available,” Smith told SEN NZ . “That’s just total lack of faith in Todd Murphy. Absolute total lack of faith, and they might get burned by it if they’re able to get five reasonable days of cricket and the pitch at Old Trafford starts to turn. “They might get embarrassed and caught short here and level the series.” However, there is a lingering threat of rain in Manchester this week, and the added moisture won’t assist spin bowlers as the match progresses. Speaking to reporters on Tuesday, Australian captain Pat Cummins also backed part-timer Travis Head to bowl some spin at Old Trafford if required — the South Australian averages 31.33 with the ball in Tests. “Even when he started his career with Australia, (Head) was basically the frontline spinner in ODI cricket,” Cummins said. “I think he’s got better and better … he defends himself well, uses a bit of drift as much as spin, and he’s quite clever. Lot a confidence in his bowling.” Moeen Ali of England. Photo by Richard Heathcote/Getty Images Source: Getty Images ENGLAND’S BRAVE TOSS CALL COULD DEFY 139-YEAR HOODOO Manchester’s notoriously indifferent weather had already made its mark on the fourth Test at Old Trafford before a ball was bowled. The long-range forecast prompted Australia to name their Test XI without a specialist spinner for the first time since 2012, while England went with the same configuration of their bowling attack at Headingley, with spinner Moeen Ali listed to bat at number three to accommodate the middle order. At the toss, both captains would have opted to bowl first, a decision Ben Stokes took much joy in when the coin fell his way for the fourth time this series. England would have to defy history to level the Ashes series — no Test side has ever elected to bowl first and win at Old Trafford, making the opening session even more crucial for the hosts. England made two breakthroughs before lunch but leaked 107 runs as the sun came out in Manchester to bathe the ground in pristine batting conditions. Bairstow takes one handed 'worldie' | 00:33 Former Australian captain Ricky Ponting was impressed by Australia’s positive intent, not sitting back and getting dictated to in the opening hours of play. “For Australia once they lost the toss, that first session was crucial,” Ponting said on Sky Sports. “Were they thinking about only needing a draw? Doesn’t look like it, they’ve come out with great intent.” Former Australian wicketkeeper Ian Healy was adamant England made the “wrong” call at the toss. “Both captains would have done it, which is wrong,” Healy said on Channel 9. “If Ben Stokes thought I am going to fire up these quicks of mine and really come at the Australians and get that crowd on its feet, it just hasn’t happened.” Ben Stokes of England. Photo by Ryan Pierse/Getty Images Source: Getty Images Former Australian international Callum Ferguson added: “It’s perplexing to me. They’ve disregarded history altogether. “In the last ten Test matches, the team batting first has made on average 386.” With the weather forecasted to intervene later in the Test, Stokes’ decision, coupled with the performance of his bowlers, has allowed the hosts to set the pace. Despite the favourable batting conditions, England continued to take wickets at regular intervals to disrupt Australia as partnerships were beginning to prosper. Four of Australia’s middle-order partnerships were over 45 runs (46, 59, 63 and 65) yet couldn’t kick on to “put the series to bed”, according to former England captain Nasser Hussain. “They’ve been sloppy, Australia,” Hussain said on Sky Sports. “Some soft dismissals, batters getting in, getting out. They could have put this series to bed by batting well today. “It’s a good pitch.” Broad fires early taking Uzzie | 00:35 MARNUS’ ‘SOFT DISMISSAL’ AFTER FINDING GOLDILOCKS STANCE Marnus Labuschagne was in the midst of the longest century drought of his Test career heading into the Old Trafford contest, going 20 consecutive knocks without reaching triple figures. The Australian No. 3 had not even passed fifty in eight innings since the start of the World Test Championship final against India, a worrying slump for the typically prolific Queenslander. He’s been guilty of needlessly throwing his wicket away, most noticeably during the second innings at Lord’s and Headingley. The dismissals were uncharacteristic for Labuschagne, who has looked a shadow of his former self over the past six weeks. “He’s just getting starts and getting out,” Australian teammate Usman Khawaja said this week. “It sucks … but I expect him to get big runs in the next couple of games.” Marnus 'slightly disappointed' by no ton | 00:37 Unfortunately for Labuschagne, he once again fell to a soft dismissal after making a useful start on day one of the Old Trafford Test — he reached his half-century in 114 balls but fell victim to England spinner Moeen Ali on his very next delivery. Ali, coming from over the wicket, turned an innocuous off-break into the right-hander’s pads, with England successfully reviewing the LBW decision. Labuschagne dropped to his haunches when three lights appeared on Hawkeye, rubbing his face in disbelief as he trudged off. “He has to be so sore with himself … gets to fifty and misses a ball he should never miss when you are in and batting for two or three hours,” former England captain Michael Atherton said on Sky Sports commentary. “That is a soft dismissal … much in the same way that Labuschagne rather gifted his wicket at Headingley, he has done it again here at Old Trafford.” Australian legend Ricky Ponting continued: “Slightly lazy from Labuschagne … there was no way in the world that ball should get you out.” Labuschagne has been maniacally tinkering with his batting stance throughout the series, as documented by the Sky Sports commentators during the Headingley Test — the constant technical changes suggest he has lost trust in his game. The 29-year-old continued experimenting ahead of the Old Trafford Test, spending more time in the nets than any of his teammates — Australian captain Pat Cummins joked he should move his hotel pillows towards the training facility. Labuschagne took guard several times before his first ball at Old Trafford on Wednesday, settling on what can be considered his Goldilocks stance — starting on middle stump with a trigger movement across the crease. Unlike the series opener at Edgbaston, where Labuschagne was guilty of fishing at outswingers outside off stump, he left the Dukes ball regularly and confidently, allowing harmless deliveries to sail through. Labuschagne played second fiddle during partnerships with David Warner, Steve Smith and Travis Head, allowing his teammates to dictate the tempo as he nudged and nurdled at the other end. He was also noticeably more confident against Mark Wood — at Headingley, he scored two runs from 42 balls against the England quick, while on Wednesday he managed 19 off 29 deliveries. Marnus Labuschagne of Australia. Photo by Clive Mason/Getty Images Source: FOX SPORTS ‘CALM DOWN’: WARNER IS ‘ALL OVER THE PLACE’ After twin failures during the third Ashes Test at Headingley, Australian opener David Warner fell victim to Chris Woakes for 32 (38) on day one at Old Trafford. Moments after the drinks break on Wednesday morning, the left-hander looked to press Woakes through the covers, instead edging behind to wicketkeeper Jonny Bairstow. He threw his head back in frustration before marching towards the sheds. Warner signalled his intent early in Manchester, thumping the first delivery of the match through the covers for a boundary. The 36-year-old, who vowed to maintain his aggressive mindset throughout the series, wasn’t afraid to attack anything wide, scoring the majority of his runs through point. “If you fear failure, I reckon you will fail,” Warner told the Vaughany and Tuffers Cricket Club podcast this week. “I have never feared failure, so I feel every game I go out thinking it could be my last. When you open the batting, you are going to get out, and you could get out first ball of the game, so I have had that instinct of backing myself and playing my way.” Warner has reached fifty once in nine knocks on this Test tour, averaging 24.11 since the start of the World Test Championship final against India. Speaking on Channel 9, former England cricketer David Lloyd called for Warner to “calm down” in the middle, pleading for the New South Welshman to bat with less urgency. “He is frantic. I don’t get it,” Lloyd said. “He is a wonderful player. He is 36 years of age. He’s seen it all, done it all. I think he should be so calm at the crease, and he looked skittish. He is all over the place at the crease. “It’s a long day opening the batting. Set your stall out, that’s the way to do it. It will get easier this afternoon, no doubt.” Lloyd also said he would have dropped Warner for reserve opener Marcus Harris after the Headingley Test. “I am outside looking in. I don’t know what he is like in the rooms, but I would have thought his time was up after the last game, and Marcus Harris would have come in. Stuart Broad is all over him,” Lloyd continued. “I can’t get away from the fact that he is 36 years of age. Calm down, just calm down a bit.” David Warner of Australia. Photo by Clive Mason/Getty Images Source: Getty Images ‘TOO EARLY FOR THAT’: PUNTER BAFFLED BY AUSSIES TACTIC Australian cricket legend Ricky Ponting was absolutely baffled when Alex Carey started farming the strike on day one of the Old Trafford Test, with the wicketkeeper looking to prevent England quick Mark Wood from bowling to the tail. Mitchell Marsh’s departure left Australia in a spot of bother at 7-255 on Wednesday afternoon, with Mitchell Starc joining Carey in the middle. The following over, Carey creamed a short ball from Wood towards deep point for what should have been a regulation single — but the pair didn’t bother running between the wickets. Boos echoed around the Manchester venue in response to the ignored single. Carey, unbeaten on 1 at the time, continued trying to keep strike against Wood, who had ripped through Australia’s tail during the first innings at Headingley. It allowed England to spread the field, preventing Carey from scoring boundaries. Since the start of 2022, Starc has averaged 6.00 against Wood in Tests, dismissed four times in 46 deliveries. Ponting argued that Starc’s batting didn’t warrant such treatment — the left-hander averages 26.62 with the bat in England, which is higher than David Warner’s equivalent figure, and has ten Test fifties to name. “It’s too early for that, as far as I’m concerned. Mitch Starc can bat. Pat Cummins in next, he can bat. I think Carey has to put some trust in Starc and Cummins,” Ponting said on Sky Sports commentary. “We saw Pat Cummins at Edgbaston do a really good job to get Australia over the line. They can still ink out tail-end runs. Looking back in the first three games, they’ve been very important at different times. “The tail-end runs now for Australia in this first innings are going to be crucial.” Starc backed up Ponting’s remarks, surviving to stumps unbeaten on 23 — incredibly, the left-hander currently averages 157.00 with the bat at Old Trafford. Mitchell Starc of Australia. Photo by Clive Mason/Getty Images Source: Getty Images","pubDate":"2023-07-19 23:39:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Danger sign Australia made a huge Ashes selection blunder as Marnus Labuschagne tries to talk down chances tourists will struggle","link":"https://www.dailymail.co.uk/sport/cricket/article-12317299/Australia-Ashes-selection-blunder-Marnus-Labuschagne.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Australia are hopeful their decision not to play a spinner at Manchester won't backfire, believing the Old Trafford wicket may buck the trend and turn less later in the game.","content":"Danger sign Australia made a huge Ashes selection blunder as Marnus Labuschagne tries to talk down chances tourists will struggle Aussies hopeful they won't need a spinner Moeen Ali has had some success already Labushagne says wicket should flatten out By Scott Bailey For Australian Associated Press Updated: 00:26, 20 July 2023 e-mail View comments Australia are hopeful their decision not to play a spinner at Manchester won't backfire, believing the Old Trafford wicket may buck the trend and turn less later in the game. The tourists' decision to go into the fourth Ashes Test without a spinner continued to raise eyebrows on Wednesday, with Ricky Ponting among those surprised by the decision. With Todd Murphy left out of the team and no frontline spinner picked for the first time since January 2011, Australia will be forced to rely on Travis Head as their main tweaker. Adding to the challenge for Australia is the fact they will be bowling last in the match, at a time when spin is usually the most prodigious and the injured Nathan Lyon has been a go-to option. Concern was heightened further when England spinner Moeen Ali was able to get some purchase out of the wicket, trapping Marnus Labuschagne lbw on 51. Australia are hoping their decision to not choose a spinner at Old Trafford won't backfire England spinner Moeen Ali has had some success already, trapping Marnus Labuschagne But Labuschagne said he believed that could have been a result of a thick grass cover left of the wicket, which will flatten out later in the game. 'Because the wicket has been undercover for a few days, it didn't have that really rock-hardness,' Labuschagne said. 'And the thatchy grass is spinning. So once that wears off, I think the middle of the week it's going to actually not spin so much. 'The ends will rough up, eventually, if the weather stays good. But I think it's actually going to spin less as the game goes on from the good part of the wicket.' Labuschagne was also adamant that Australia's extra batting had not created any complacency, after six men got out between 20 and 51 in their score of 8-299. England again questioned Australia's decision not to play a spinner on Wednesday, with Stuart Broad pointing out Old Trafford is generally a place where spin is effective. It came after Ponting also queried the decision in commentary. 'I was still surprised they didn't go in with one,' Ponting said during Moeen's second spell. Stuart Broad has questioned the Aussie decision, saying Old Trafford is usually good for spin Australian great Ricky Ponting also questioned the decision to leave out a spinner 'Your preference is always to go in with a spinner – unless you are brilliant at reading weather forecasts and cricket pitches. 'So if you haven't got one, you can be found out very easy.' Share or comment on this article: Danger sign Australia made a huge Ashes selection blunder as Marnus Labuschagne tries to talk down chances tourists will struggle e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 23:26:04","image_url":"https://i.dailymail.co.uk/1s/2023/07/20/00/73405953-0-image-a-79_1689807957177.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"What happened on Day 1 of the 4th ENG vs AUS Ashes 2023 Test in Manchester?","link":"https://www.sportskeeda.com/cricket/what-happened-day-1-4th-eng-vs-aus-ashes-2023-test-manchester","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":"Chris Woakes starred with 4/52 as England reduced Australia to 299/8 on Day 1 of the fourth Ashes 2023 Test at Old Trafford in Manchester on Wednesday, July 19. A number of Aussie batters got starts, but none could convert them into a big score. Stuart Broad struck early for the hosts after they won the toss and bowled first, trapping Usman Khawaja (3) leg before with a sharp delivery that nipped back and beat the batter’s defense. The struggling pair of David Warner and Marnus Labuschagne lifted the visitors with a second-wicket stand of 46. Warner did well to reach 32, but was foxed into a drive outside off stump from Woakes and nicked the ball to the keeper. Labuschagne and Steve Smith then added 59 runs for the third wicket. The latter got into 20s but dancing down the track and lofting Moeen Ali for a maximum over long-on. Australia went to lunch on Day 1 in a decent position at 107/2. Mark Wood dealt Australia a massive blow in the second session, trapping Smith leg before for 41 with a quick delivery that jagged back in. The senior Aussie batter paid the price for his premeditated shuffle across the stumps. Labuschagne and Travis Head then added 63 for the fourth wicket. However, Australian batters continued to give their wickets away after getting starts. Labuschagne brought up his first fifty of Ashes 2023, but fell immediately afterwards for 51. He missed a flick off Moeen and was trapped in front as England took a successful review. Head looked in reasonable control during his stay at the crease before perishing to Broad for 48, hooking the bowler straight to the fielder at fine-leg. With the scalp, Broad joined the elite 600-wicket club in Test matches. When Head was dismissed, Australia were in a spot of bother at 189/5. Mitchell Marsh, however, struck an impressive half-century, adding 65 runs for the sixth wicket with Cameron Green. After striking a couple of early fours, Marsh launched Moeen over long-on for six. A few overs later, he slammed the off-spinner for consecutive fours. Marsh reached his fifty off 56 balls by flicking Wood for a four. Just when Australia seemed to be getting some sort of control, Woakes’ double strike put England back on top. Green was trapped lbw by a skidder for 16, while Jonny Bairstow pulled off a blinder behind the wickets to end Marsh’s resistance for 51. Woakes produced a nick off a brilliant probing delivery and Bairstow flung to his right to pull off a one-handed blinder. Alex Carey and Mitchell Starc added a crucial 39 runs for the eighth wicket, but Woakes struck another crucial blow just before stumps. Carey (20) made a late attempt to leave a length delivery outside off, but only managed to nick the ball to the keeper. Australia went on to stumps on Day 1 with Starc unbeaten on 23 and Pat Cummins on 1. Quick Links","pubDate":"2023-07-19 23:23:05","image_url":"https://staticc.sportskeeda.com/editor/2023/07/22d93-16897893182101-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"WC opener to go ahead despite ‘alarming incident’ in Auckland, NZ PM confirms — World Cup Daily","link":"https://www.foxsports.com.au/football/matildas/fifa-womens-world-cup-2023-matildas-news-cathy-freeman-sydney-2000-olympics/news-story/5dbc217fee78de73a1e578fbf5043d02","keywords":null,"creator":null,"video_url":null,"description":"New Zealand Prime Minister Chris Hipkins has confirmed the World Cup opener between New Zealand and former winners Norway will go ahead on Thursday evening.","content":"New Zealand Prime Minister Chris Hipkins has confirmed the World Cup opener between New Zealand and former winners Norway will go ahead on Thursday evening. It comes in the wake of confirmation from New Zealand police that a gunman opened fire at a central Auckland building site on Thursday in an “alarming incident” that left two people and the alleged shooter dead. The Women’s World Cup kicks off with New Zealand taking on Norway in Auckland (at 5pm AEST) before co-hosts Australia face the Republic of Ireland (8pm) in front of 80,000 fans in Sydney. MORE WOMEN’S WORLD CUP NEWS Who’s in the Matildas squad and when do they play their Women’s World Cup games? All 64 World Cup fixtures and full Matildas schedule What time do the Matildas play their first World Cup game? Excitement builds ahead of WC opener | 02:00 “What has unfolded is understandably alarming and we are reassuring the public that this incident has been contained and is an isolated incident. We can also advise that this is not a national security risk,” a statement from New Zealand police read. “Police are now commencing an investigation into what has occurred this morning. Cordons remain in place and we are continuing to ask the public to stay away from the area as our work continues.” The incident is reported by local media to have taken place in a building close to the fan zone for the Women’s World Cup and near Norway’s team hotel on Quay Street. Norway captain Maren Mjeldeb said, per Stuff.co.nz : “Everyone probably woke up quite quickly when the helicopter hovered outside the hotel window and a large number of emergency vehicles arrived. At first we didn’t know what was going on, but eventually there were updates on TV and the local media. “We felt safe the whole time. FIFA has a good security system at the hotel, and we have our own security officer in the squad. Everyone seems calm and we are preparing as normal for the game tonight. Then we may have to adapt if there are any instructions from the authorities.” The New Zealand Women’s National Team said it was “shocked” by the incident in a statement that confirmed all team and staff are “safe”. It added: “Preparations for the game tonight at Eden Park will continue as planned.” The US Women’s National Team, whose camp is based in Auckland, released a statement on Thursday confirming all players and staff are “accounted for and safe”. “Our security team is in communication with local authorities and we are proceeding with our daily schedule,” added the statement. The Phillipine Women’s National Team also confirmed all its players and staff were “safe inside Movenpick Hotel”. “The team is preparing to depart for Dunedin for the match against Switzerland on Friday,” the statement read. Auckland Mayor Wayne Brown, meanwhile, described it as a “scary situation” and advised people to “stay at home” and “avoid travel into the city centre”. He told local TV network TVNZ: “This dreadful situation couldn’t have come at a worse time when the world has its eyes on us. It’s dreadful, particularly since we have never had an incident like this before. It’s very scary.” Former Football Fern Maia Jackman was in the fan zone as the unfolded, providing her account of events to the NZ Herald . “It’s pretty scary actually,” she said. “So they pushed us to the back of the cloud where we are and we’re just trying to keep sane. There’s lots of security and lots of uncertainty.” The Cloud, which was set up as the Women’s World Cup fanzone, was locked down in response to the incident with the Herald reporting people there are “safe”. Journalist Suzanne McFadden, meanwhile, was a guest on the TVNZ Breakfast show that was broadcasting from The Cloud. According to Stuff.co.nz , she said around 30 people — including girls from the Ellerslie Football Club and former Football Ferns — were moved towards the back of the venue into a kitchen area. “The first thing we’d noticed was the police helicopter overhead and then we were moved out the back — we thought we were going there to be filmed. And then we were quietly told there was a gunman outside,” McFadden said. Matildas call out FIFA over gender gap | 01:35 WORLD CUP WILL ‘WAKE UP’ NEW ZEALAND’S LOVE OF FOOTBALL New Zealand hosts Norway at Eden Park on Thursday to open the Women’s World Cup. Jitka Klimkova said on Wednesdsay that staging the Women’s World Cup will “wake up” New Zealand’s passion for football. Football remains well behind rugby, cricket and other sports in popularity in New Zealand, which is jointly hosting the World Cup with Australia. New Zealand have never won a Women’s World Cup game in 15 attempts, but they hope to change that when they face the 1995 champions Norway in the first game of the tournament on Thursday. “It is an opportunity for this country to not just be a rugby country but wake up their love for football,” said their Czech coach Klimkova. Taking up the theme, captain Ali Riley added: “Hopefully this time we will achieve our goal of winning a World Cup game and doing that at home, and that will make it my greatest game of my career. “This feels like an opportunity with the sporting culture, inspiring young people.” After facing Norway at the 50,000-capacity Eden Park -- better known for hosting the All Blacks rugby team -- New Zealand face minnows the Philippines and Switzerland in Group A. New Zealand are ranked 26th in the world and have won just once in their last 11 matches, but Klimkova is backing them to shine in front of their own fans. Matildas set up camp at Brisbane base | 01:34 “The hard work and preparation brought us to where we are now,” she said. “At this stage the preparation is done and now it is time to shine, and I really believe these players will shine.” Norway have fallen away since triumphing in 1995. They were thumped 8-0 in the group stage by hosts and eventual champions England at the 2022 Euros. Their Barcelona winger Caroline Graham Hansen said the World Cup was a chance to redeem themselves and a fresh start. “It is a year ago, a long season behind us,” she said, casting her mind back to their Euro flop. “I think everybody has had time to focus on their club while working on stuff with the new coaching team, so everything feels very different, nothing to compare with how we left the tournament last year. “It is a clean slate, we have a possibility to start afresh and to get going again. “That is the beauty of football -- there is always a new chance, and now we have it again.” — AFP MATILDAS ‘VERY EMOTIONAL’ AFTER FREEMAN VISIT Matildas captain Sam Kerr has repeatedly said she wants to lead Australia to World Cup glory and create her own ‘Cathy Freeman moment’. But Kerr and her Tillies teammates last week received a very special visit from the Australian sporting legend herself. The Sydney 2000 Olympic Games 400m gold medallist Freeman, a proud Kuku Yalanji woman, is the sporting hero of ‘over half the team’, and joined the team in Melbourne last Wednesday. Kerr told Freeman: “You’re an inspiration to the whole team … You’ve been an idol for all of us for so long. What you did for us as a country, hopefully we can replicate even half of that. We’ll remember this night for the rest of our careers. It’s been amazing.” “A lot of girls were very emotional,” Matildas veteran Aivi Luik said. “I still can’t believe that happened because a couple years ago, we were going through some questions about who your sporting hero is and why, and over half the team said that Cathy Freeman was their hero. “The staff, because of that, tried to get her in, and bless her heart, she came in. “She doesn’t do a lot of public speaking but she did that for us. We asked her questions informally and she spoke back to us just like she was a friend, and we got a lot of good insight from that.” FEATURE: How 2019 WC heartbreak exposed Matildas’ great flaw … and the brutal journey to fix it Cathy Freeman of Australia celebrates winning gold in 2000. Source: News Corp Australia WOMEN’S WORLD CUP PREVIEW PODCASTS – LISTEN NOW! PART ONE: Preview of EVERY group and which players could catch your eye PART TWO: Three burning Matildas questions and why their Group B rivals are a threat Freeman told the Aussies: “The power of you just being here is unimaginable. It’s beyond your wildest dreams what you’re going to be able to do. “You’re going to be able to get into the blood of everybody who is on the journey with you. It’s just a crazy, wild ride. “You’re writing your name in history, ladies. And you should be really proud of that.” Luik said: “She told us was that we know who we are, we know why we do this, and while we want to perform and give results for others outside the circle, at the end of the day, you believe in yourself and you do it for yourself.” “All athletes do what they do because they love the sport, and (Freeman said) to not lose track of that, and that gives you the confidence to go out there and do your job.” Luik praised Freeman’s resilience to perform despite having the “weight of the nation” on her shoulders at the Olympics. “She was just one and we’re a whole team, so I think we’re quite lucky in that regard that we have our friends and teammates there to support each other,” Luik said, “We came away from that feeling a little bit of a weight off our shoulders, and just completely inspired.” Freeman and her family joined the Matildas for a team dinner and was presented with a signed team jersey. Australia’s opening match of the tournament is against Ireland on Thursday night in Sydney – at the same stadium where Freeman made history in 2000. Freeman celebrates her iconic win. Source: Supplied MORE NEWS MATILDAS SQUAD: What you need to know about every Aussie FIXTURES: All 64 World Cup games and full Matildas schedule EVERY SQUAD: 736 players, one trophy — Every World Cup squad locked in In February, Sam Kerr said: “The legacy left there from that one special moment at the 2000 Olympics was everlasting for all of us. “Ask half the girls in the team, their idol growing up was Cathy Freeman. “That’s the legacy we want to leave – that we inspire the nation, we move the nation to believe in women’s football, believe in the Matildas.” And Kerr also wrote in her book, My Journey To The World Cup: “I loved her so much. “She was so fast and strong, and she coped so well with the unbelievable pressure that was put on her. I watched her race in the Sydney 2000 Olympics over and over and over again.”","pubDate":"2023-07-19 22:44:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"ASHES DAY ONE, FOURTH TEST - SESSION-BY-SESSION: Honours shared as England take four wickets in the evening after Australia raced to 107 for two in dominant start","link":"https://www.dailymail.co.uk/sport/cricket/article-12317041/ASHES-DAY-ONE-FOURTH-TEST-SESSION-SESSION-Honours-shared-England-four-wickets-evening-Australia-raced-107-two-dominant-start.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH AT OLD TRAFFORD: England finished day one of the fourth Ashes Test on top with Pat Cummins and Mitchell Starc at the crease on 299 for eight.","content":"ASHES DAY ONE, FOURTH TEST - SESSION-BY-SESSION: Honours shared as England take four wickets in the evening after Australia raced to 107 for two in dominant start Steve Smith and Marnus Labuschagne guided Australia to 107 for two at lunch The visitors added 80 more for the loss of two before England took the evening ASHES NOTEBOOK: Pope gives a thumbs-up while McGrath takes scenic route By Lawrence Booth for the Daily Mail Updated: 21:53 BST, 19 July 2023 e-mail View comments England finished day one of the fourth Ashes Test on top with Pat Cummins and Mitchell Starc at the crease on 299 for eight. Chris Woakes starred for the hosts with the ball - taking four wickets including two in one over - while Stuart Broad took his 600th Test scalp to join Jimmy Anderson in exalted company. Anderson himself struggled to dazzle at the ground that has a stand and a bar named after him, while Marnus Labuschagne also had a moment to forget after once again throwing away his wicket to Moeen Ali's off-breaks. There was also a moment of redemption for the much-maligned Jonny Bairstow who took a terrific low grab after coming under fire for his keeping so far this series. Here, Mail Sport's Lawrence Booth takes you through the action from Old Trafford, session-by-session. Stuart Broad made history in taking his 600th Test wicket after dismissing Travis Head Australia ended the day on 299 for nine with captain Pat Cummins (right) at the crease Morning – Australia Invited to bat, Australia for once lost Usman Khawaja early, trapped in front to give Stuart Broad his 599th Test wicket. Chris Woakes then had David Warner caught behind for 32 to make it 61 for two – and almost had Steve Smith caught at long leg first ball. But Smith and Marnus Labuschagne took the tourists to 107 for two by lunch, at a Bazball-esque 4.28 an over. Afternoon – shared In a session of nip and tuck, Australia added 80 runs for the loss of Smith and Labuschagne – who are threatening to lose their pre-series tag as the 'wickets England want most'. Smith was undone by Wood's pace, while Labuschagne – after bringing up his first half-century of the series – played all round an off-break from Moeen Ali. Evening – England Four wickets, including three for Woakes, left England with a slight edge at the end of another absorbing day. Chris Woakes (right) took three of the four wickets to fall in the final session - including two in one over Mitchell Marsh had threatened to turn things Australia's way with a rapid half-century, but he was brilliantly caught by the under-fire Jonny Bairstow as Woakes snared him and Cameron Green in the same over. Verdict - honours split between the two sides. Play of the day With apologies to Stuart Broad’s achievement of 600 Test wickets, there was no better moment than Jonny Bairstow’s right-handed lunge to cling on to an edge from Mitchell Marsh, having briefly been sent the wrong way. Bairstow has spent most of the series under the wicketkeeping microscope – and celebrated on his backside with a mixture of relief and jubilation. Jonny Bairstow took a fantastic catch low to his right have already begun moving the other way Share or comment on this article: ASHES DAY ONE, FOURTH TEST - SESSION-BY-SESSION: Honours shared as England take four wickets in the evening after Australia raced to 107 for two in dominant start e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:53:14","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73396753-0-image-a-70_1689799811253.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Stuart Broad revels in 'special' feeling after taking a landmark 600th Test wicket - as England restrict Australia to 299-8 on day one of the fourth Ashes Test at Old Trafford","link":"https://www.dailymail.co.uk/sport/cricket/article-12316827/Stuart-Broad-revels-special-feeling-taking-landmark-600th-Test-wicket-England-restrict-Australia-299-8-day-one-fourth-Ashes-Test-Old-Trafford.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Stuart Broad is just the fifth man to reach the milestone and only the second pace bowler, after his England team mate Jimmy Anderson to achieve the feat.","content":"Stuart Broad revels in 'special' feeling after taking a landmark 600th Test wicket - as England restrict Australia to 299-8 on day one of the fourth Ashes Test at Old Trafford Stuart Broad dismissed Travis Head to reach the milestone of 600 Test wickets He is just the fifth man to achieve the feat and only the second pace bowler Broad has impressed, taking more wickets this series than any other bowler (18) By Aadam Patel At Old Trafford Updated: 22:24 BST, 19 July 2023 e-mail View comments Stuart Broad admitted he felt ‘really special’ after taking his 600th Test wicket for England, as Australia ended on 299 for eight on the first day of the fourth Ashes Test in Manchester. ‘It’s got a nice ring to it - getting your 600th Test wicket from the James Anderson End. There’s something pretty special about that,’ said Broad after getting Travis Head out in the first over after tea. Broad is just the fifth man to reach the milestone and only the second pace bowler , after Jimmy Anderson to achieve the feat. ‘I got my 500th Test wicket here in front of no crowd (due to Covid). My dad was here as he was the match referee. So it felt pretty special today to get an ovation from the Old Trafford crowd. 'I’ve always loved playing here. To get my 600th here in front of a full house on the first day of an Ashes Test is pretty memorable,’ Broad added. Stuart Broad became just the fifth man to reach the milestone of 600 Test wickets and only the second pace bowler, after England team mate Jimmy Anderson The veteran finished the day with two wickets after earlier dismissing opener Usman Khawaja Broad's 600th Test scalp was Travis Head, who fell just two runs shy of of his half century With more wickets (18) than anyone else in the series, Broad led England off on a day where Ben Stokes’ side bowled well after winning the toss and choosing to bowl first, with Chris Woakes the pick of the England bowlers, taking four wickets. And Broad admitted that he has felt rejuvenated under Stokes and Brendon McCullum since he was recalled last summer. ‘I have definitely got an addiction to Test cricket and the competitive side of it. Ultimately Baz and Stokesy have given me a new lease of life in a way. It is such a free changing room, it feels in the nicest possible way that you are playing club cricket, but at the highest level. That is such a great place to be as a 37-year-old,’ said Broad. ‘I would argue it’s been the most enjoyable year of my Test career which is an awesome thing to say at 36 or 37.’ Broad has played in all five of England’s Tests so far this summer and his 149 wickets across his career against Australia are the most by any bowler against the tourists. ‘I am very competitive on the field and Australia bring the best out of me on that front because they are so competitive as well. It’s been great to be involved in some brilliant battles this summer with Australia and I’ve loved every moment of this series. It’s the series that keeps on giving really,’ said Broad. And Australia’s Marnus Labuschagne was full of praise for the England quick. Marnus Labuschagne was full of praise for Broad after witnessing the Englishman's display Moeen Ali (middle) took the crucial wicket of Labuschagne who was dismissed for 51 runs ‘His statistics speak for themselves. Especially this series, he’s been very impressive to show his versatility on wickets that don’t have as much pace and nip at times but he’s able to create really good angles on the crease with his swing. He was able to work on getting one to shape away a little bit and then he’s able to go the bouncer plan. When you’re doing that, it shows his versatility. We know that if conditions are good for bowling, he’s always going to be a handful but he’s shown through the series and through his career that when it’s not, he can still keep it tight, wait for his opportunity and work a batter out.’ Labuschagne insisted that it was a day where Australia missed out, with himself getting out for 51 after playing all around a straight delivery from Moeen Ali. ‘Where we were, and how many guys got themselves in, I think we would be slightly disappointed with no-one getting a big score,’ said Australia’s No 3. Share or comment on this article: Stuart Broad revels in 'special' feeling after taking a landmark 600th Test wicket - as England restrict Australia to 299-8 on day one of the fourth Ashes Test at Old Trafford e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:39:42","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73401571-0-image-a-93_1689798846053.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"TOP SPIN AT THE TEST: Stuart Broad becomes the fifth bowler to reach 600 wickets - taking his tally against Australia to 149 in the process - and only Don Bradman has more visiting Test runs in England than Steve Smith","link":"https://www.dailymail.co.uk/sport/cricket/article-12316955/TOP-SPIN-TEST-Stuart-Broad-fifth-bowler-reach-600-wickets-taking-tally-against-Australia-149-process-Don-Bradman-visiting-Test-runs-England-Steve-Smith.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"TOP SPIN AT THE TEST: The fourth Ashes Test got underway at Old Trafford, as England's bid for an unlikely series win continued with Australia needing just a draw to retain the urn.","content":"TOP SPIN AT THE TEST: Stuart Broad becomes the fifth bowler to reach 600 wickets - taking his tally against Australia to 149 in the process - and only Don Bradman has more visiting Test runs in England than Steve Smith Stuart Broad overtook Ian Botham to have the most wickets against Australia Jimmy Anderson is the only fast bowler with more Test wickets than Broad now Broad was born for Ashes cricket - it was a fitting stage for his 600th wicket By Lawrence Booth for the Daily Mail Updated: 21:33 BST, 19 July 2023 e-mail View comments Day one of the fourth Ashes Test got underway at Old Trafford on Wednesday , as England's bid for an unlikely series win continued with Australia needing just a draw to retain the urn. England wasted little time in getting going, though, Usman Khawaja going for three to move Stuart Broad onto 599 Test wickets - before later getting himself over the line to record yet another impressive milestone . Travis Head proved to be the 600th victim for England's long-serving fast bowler - the dangerous No 5 following team-mates Warner, Steve Smith and Marnus Labuschagne who all got in but failed to record a big score. By stumps, Australia were 299 for eight with bowlers Pat Cummins and Mitchell Starc at the crease after Chris Woakes took his tally to four after dismissing all-rounders Cameron Green, Mitchell Marsh and the notorious wicket-keeper Alex Carey. Here, Mail Sport's Lawrence Booth takes you through some of the stats you may have missed from the first day of the fourth Test at Old Trafford. Stuart Broad grabbed the headlines with his 600th Test wicket for England in dismissing Travis Head Marnus Labuschagne threw away his wicket once again to Moeen Ali after being dismissed on 51 Stuart Broad became the fifth bowler – and the second seamer, after Jimmy Anderson – to tick off 600 Test wickets when Travis Head pulled him to Joe Root at long leg. It was also Broad’s 149th wicket against Australia – breaking Ian Botham’s England record of 148. Shane Warne remains the Ashes record-holder, with 195. Steve Smith’s innings of 41 means only Don Bradman has scored more Test runs among visiting batsmen in England: 2,674 at an average of 102 to Smith’s 2,113 at 55. Now relegated to third is Allan Border, with 2,082 at 65. Four wickets for Chris Woakes took his Test record at Old Trafford to 27 wickets at just 17 apiece – and his career average below 30 for the first time since the 2021-22 Ashes. Share or comment on this article: TOP SPIN AT THE TEST: Stuart Broad becomes the fifth bowler to reach 600 wickets - taking his tally against Australia to 149 in the process - and only Don Bradman has more visiting Test runs in England than Steve Smith e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:33:54","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73400549-0-image-a-51_1689798515421.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Broad inspired by Australians to wreak havoc on nation","link":"https://www.perthnow.com.au/sport/cricket/broad-inspired-by-australians-to-wreak-havoc-on-nation-c-11330558","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Stuart Broad has taken his 600th Test wicket in the fourth Ashes Test, claiming the record for the most potent bowler in history against Australia.","content":"Stuart Broad has detailed how the likes of Glenn McGrath and Shane Warne inspired him to be Australia's biggest tormenter in Test history and the latest member of the 600-wicket club. Broad became the second seamer, behind teammate James Anderson, and fifth man overall to reach the 600-wicket milestone on Wednesday, when he had Travis Head caught hooking. The wickets of Usman Khawaja and Head at Old Trafford took Broad's tally against Australia to 149, one clear of Ian Botham for the most ever against the nation. And according to Broad, it was a childhood spent watching Australia winning that made him want to emulate their dominant side of the 1990s and early 2000s. \"I grew up completely obsessed watching Ashes cricket and I suppose that's why some of my heroes are Warnie, Glenn McGrath, some of the great Aussie team,\" Broad said. \"As a kid you are influenced by winning sides. \"It also built up my steeliness to want to be part of England teams that could win the Ashes after going through a whole childhood without us lifting them.\" Broad also spent six months playing for Hoppers Crossing in south-west Melbourne as a 17-year-old, another influence he claims has been crucial. \"I probably grew up with a bit more of an Australian mindset rather than a sort of England mindset of the 1990s,\" Broad said. \"Going to Hoppers Crossing was a great experience. \"Opening batting, opening bowling, got into the competitive side of the Australians and loved the battle.\" It was fitting the milestone came against Australia, who went to stumps on day one of the fourth Test on 8-299. From the moment Broad took 5-37 against them at The Oval to win England the Ashes in the 2009 decider, he has been a problem for Australia. In all, 102 of his 149 wickets against Australia have come in England, where he averages 26.14 against them in home conditions. The 37-year-old is perhaps the biggest reason Australia have not won an Ashes series in England since 2001. Broad's spell at The Oval in 2009 won England the Ashes, while his return of 11-121 at Chester-le-Street in 2013 ended any chance of Australia drawing that series. The seamer's finest hour, at Trent Bridge in 2015, also ended Australia's Ashes chances in that match, his 8-15 ensuring England would win that series. Broad has also silenced Australia's best batsmen, famously getting David Warner's wicket for the 16th and 17th time at Headingley earlier this month. He has also removed former captains Steve Smith and Michael Clarke 11 times. The fact he is leading wicket-taker in this series, with 18 at 25.94, also continues to give England hope of coming back from 2-0 down. BOWLERS WITH 600 TEST WICKETS Muttiah Muralitharan - 800 Shane Warne - 708 James Anderson - 688 Anil Kumble - 619 Stuart Broad - 600 MOST WICKETS AGAINST AUSTRALIA Stuart Broad - 149 Ian Botham - 148 Courtney Walsh - 135 Richard Hadlee - 130 Curtly Ambrose - 128 Bob Willis - 128","pubDate":"2023-07-19 20:26:19","image_url":"https://images.perthnow.com.au/publication/C-11330558/3b3a4aec25fae2fabd504e4729aa716cf90cf9b1-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"LAWRENCE BOOTH: Marnus Labuschagne's laziness means he is losing his lustre as the Australian was dismissed by Moeen Ali AGAIN as the No 3's Ashes struggles continue","link":"https://www.dailymail.co.uk/sport/cricket/article-12316791/LAWRENCE-BOOTH-Marnus-Labuschagnes-laziness-means-losing-lustre-Australian-dismissed-Moeen-Ali-No-3s-Ashes-struggles-continue.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH: No one leaves the field more disconsolately than Labuschagne, no one looks so bereft at their dismissal. He had just brought up his first half-century of the summer.","content":"LAWRENCE BOOTH: Marnus Labuschagne's laziness means he is losing his lustre as the Australian was dismissed by Moeen Ali AGAIN as the No 3's Ashes struggles continue Marnus Labuschagne's wicket is slowly becoming less pivotal for England The Australian No 3 has made just one half century so far during the Test summer Four wickets for Chris Woakes puts England on top at the end of the first day By Lawrence Booth for the Daily Mail Updated: 21:21 BST, 19 July 2023 e-mail 3 View comments As the big screen confirmed his fate, Marnus Labuschagne’s head slumped. He turned towards the dressing-room with the agility of an oil tanker, then trudged off, the hull apparently bumping along the seabed. No one leaves the field more disconsolately than Labuschagne, no one looks so bereft at their dismissal. It wasn’t any consolation that he had just brought up his first half-century of the summer. In some ways, it just made things worse. The next ball he faced was a standard off-break from Moeen Ali . It was tossed up a touch and turned a bit – but on the 30th anniversary of Shane Warne ’s surprise here for Mike Gatting, it was no Ball of the Century. And yet Labuschagne missed a gentle work to leg. Umpire Joel Wilson said not out, but that isn’t always the end of the matter: when England reviewed, DRS flashed three reds. For the batsman, there wasn’t even any umpire’s-call orange to get indignant about. For the second Test in succession, Labuschagne had given it away against Ali, a cricketer regarded by many Australians as a luxury pick – not least since he is now England’s No 3. Marnus Labuschagne left the crease disconsolate after a tame dismissal by Moeen Ali The Australian No 3 had made his first 50 of the Test summer at Old Trafford on Wednesday He was dismissed by the English spinner for the second Test match in a row, the ball hitting his pad plum in front of the stumps At Headingley, Labuschagne’s careless slog-sweep against him on the second afternoon had opened the door for England, and was followed moments later by Ali’s dismissal of Steve Smith. Here, Labuschagne had helped take Australia to 183 for three moments before tea – a healthy position after England had chosen to bowl. Five more minutes, and he might have gone on to play the day’s decisive hand. Up in the commentary box, the former Australian captain Ricky Ponting called his demise ‘slightly lazy’ – a waste after playing what he felt had been his best innings of the series. Later, Labuschagne echoed the description. ‘I was happy with my decision-making, which is the part that has been frustrating me,’ he said. ‘I was probably a little bit lazy trying to turn it to the leg side, and Moeen got me. But I was happy with where I was from a technical space, to give myself as much access to the ball as I can.’ And there were, it’s true, a couple of vintage strokes. He got going with a punched off-drive for four off Stuart Broad, and later dealt with one of Mark Wood’s 90mph detonations with a neat clip through midwicket. He twice played second fiddle – first to Smith, then to Travis Head. By and large, it was music to Australian ears. The experts, though, had spotted yet another tweak in a summer full of them, with Labuschagne now using a middle-stump guard in his bid for technical nirvana. He had begun the series on off stump, a consequence perhaps of getting outside the line to avoid falling lbw on slow county pitches with Glamorgan. But he ended up edging his first ball at Edgbaston through to Bairstow, and soon moved to middle and leg. Here, he looked more balanced, but this latest fiddle hinted at a restlessness that has dogged his summer. He has now got to 20 seven times out of nine on this current trip to England this summer Australia's Labuschagne had started the series as the World No 1 ranked batter in Test cricket It’s not that Labuschagne isn’t giving himself a chance. Starting with the World Test Championship final against India at The Oval, he has got to 20 seven times out of nine on this trip. But, until yesterday, he had not passed 47. That’s the kind of record England would happily accept from Ali at No 3, but Labuschagne began this series as the world’s top-ranked batsman, with a propensity for going big: five of his 10 Test hundreds have been 162 or more. During the 2019 Ashes, when he emerged from the shadows as a concussion substitute for Smith to play a central role in Australia’s retention of the urn, he scored four half-centuries – and still ended up slightly unfulfilled. This time, though, it is as if his hunger has got the better of him. After reaching for that first ball of the Ashes, with fatal consequences, he has not shaken off the sense that he is chasing success, rather than allowing success to come to him. His wicket is losing its appeal as one that England seek more than others, with that honour instead passing to Usman Khawaja, Travis Head and even Mitchell Marsh There is also a growing gap between his record at home, where he has scored nine Test hundreds and averages 70, and abroad, where he has scored one and averages 37. Above all, he is losing his tag as one of the wickets England crave most. It is passing instead to Usman Khawaja, Head and even Mitchell Marsh. Smith is still up there, despite himself passing 50 only once. But Labuschagne has shed some of his lustre. He has a maximum of three innings left to right that wrong, which will mean more work with the dog-stick for Australia’s tireless backroom staff, and possibly another tinker or two when he takes guard. If not, the sight of Labuschagne dragging himself from the middle as if he carrying a sack of coal may define a summer that refuses to get going. Share or comment on this article: LAWRENCE BOOTH: Marnus Labuschagne's laziness means he is losing his lustre as the Australian was dismissed by Moeen Ali AGAIN as the No 3's Ashes struggles continue e-mail Add comment Comments 3 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 20:21:54","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/21/73400809-0-image-a-44_1689797487561.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Honours even in fourth Ashes Test as Broad joins 600 club","link":"https://www.news24.com/sport/Cricket/england-quickie-broad-joins-600-test-wicket-club-20230719","keywords":null,"creator":null,"video_url":null,"description":"England's Stuart Broad became just the fifth bowler to take 600 Test wickets, as Australia ended Wednesday's opening day of the fourth Test at Old Trafford on 299-8.","content":"England's Stuart Broad became just the fifth bowler to take 600 Test wickets, as Australia ended Wednesday's opening day of the fourth Test at Old Trafford on 299-8. LIVE | England v Australia, fourth Ashes Test England's Stuart Broad became just the fifth bowler to take 600 Test wickets, as Australia ended Wednesday's opening day of the fourth Test at Old Trafford on 299-8. Marnus Labuschagne and Mitchell Marsh each made 51 after England captain Ben Stokes won the toss in a match the hosts must win to maintain their hopes of regaining the Ashes at 2-1 down with two to play. Chris Woakes led England's pace attack with 4-52 in 18.5 overs while Broad took 2-68 in 14 en route to his landmark. James Anderson was the only change to the England side that won the third Test at Headingley by three wickets. On his Lancashire home ground a fortnight short of his 41st birthday, Anderson had a frustrating day. England's all-time leading Test bowler with 688 wickets, had figures of 0-43 in 17 overs. History is against England. No side has won a Test at Old Trafford after winning the toss and bowling. Broad was aiming to heap further misery on David Warner, having already dismissed the Australia opener 17 times in Tests - including twice for a total of just five runs at Headingley. But from Wednesday's first ball, Warner thrashed a wide delivery from Broad for four. Broad, however, moved to 599 Test wickets when he had Usman Khawaja, Australia's other opener, lbw for three. Woakes struck next to end a second-wicket stand of 46 when he had Warner caught behind off an edged drive, following an assured 32. The next delivery saw star batsman Steve Smith top-edge a pull off Woakes that just cleared Mark Wood at fine leg before going for four. An increasingly confident Smith drove off-spinner Moeen Ali for a straight six. Having made 41, on a ground where four years ago his double century helped seal a 185-run win over England, Smith was lbw to express quick Wood. Head was struck on the helmet by a Wood bouncer early in his innings and again looked uncomfortable against the short ball. But he battled through. Both Head and Labuschagne unfurled several fine drives. Labuschagne, however, fell one ball after completing his fifty, lbw to Moeen - the only specialist spinner on either side after Australia dropped Todd Murphy. Australia were 187-4 at tea only to lose Head five balls after the resumption as Broad took his 600th Test wicket. Left-hander Head had made 48 when he hooked at a Broad bouncer and Joe Root held a low catch as he ran in from the boundary at fine leg. Marsh, who had marked his first Test since 2019 with a hundred at Headingley, again drove strongly and made England pay for any loose deliveries as he led the way during a partnership of 65 with fellow all-rounder Cameron Green. Their stand was broken when the recalled Green was lbw to Woakes. Australia's 254-6 became 255-7 when Jonny Bairstow, whose wicketkeeping has proved fallible this series, held a one-handed diving catch to remove Marsh from an outside edge off Woakes. The crowd roared in celebration as Marsh departed after hitting seven fours and a six in a quickfire stay of 60 balls. Alex Carey almost made it through to stumps but fell to the new ball, caught behind off Woakes trying to withdraw his bat. Mitchell Starc was 23 not out at the close. England have won 13 of their last 16 Tests at Old Trafford but have not enjoyed an Ashes victory at the Manchester ground since Ian Botham hit a celebrated hundred in 1981.","pubDate":"2023-07-19 20:20:11","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"}]}