{"newsArray":[{"title":"News24.com | Ice-man Miller believes Jansen can become his spiritual Proteas successor: 'He has the gift'","link":"https://www.news24.com/sport/Cricket/Proteas/ice-man-miller-believes-jansen-can-become-his-spiritual-proteas-successor-he-has-the-gift-20230201","keywords":null,"creator":null,"video_url":null,"description":"David Miller has little doubt Marco Jansen can add to his ever-expanding cricketing repertoire by eventually becoming the type of \"finisher\" he already is with the bat for the Proteas.","content":"In Kimberley David Miller has little doubt Marco Jansen can add to his ever-expanding cricketing repertoire by eventually becoming the type of \"finisher\" he already is with the bat for the Proteas. READ | Dane van Niekerk's shocking T20 World Cup omission explained: 'We're testing everyone fairly' The lanky 22-year-old, named the ICC's emerging world player of the year last week predominantly for his bowling exploits, has recently started to showcase the batting ability he's regularly touted. Jansen lit up the SA20 with a 27-ball 66 for Sunrisers Eastern Cape against MI Cape Town before playing a crucial if at times imperfect role in South Africa's momentous, series-clinching chase against England in Bloemfontein last Sunday. His unbeaten 32 off 29 deliveries mixed fine power-hitting and excellent placement with some nervy over-exuberance though he had the immense benefit of the ice-cool Miller by his side. \"It's the first time I batted with him. It was really nice just to get that bond together because we've got on well off the field,\" said the Proteas stalwart ahead of Wednesday's third and final ODI here. \"Marco's got a lot to offer, he's still very young and a great talent with bat and ball. It was just nice to be there with him, chatting him through a few scenarios. \"When the pressure is on like that, for him to come through the way he did was just really pleasing to see. Hopefully we get a lot more partnerships together in future.\" Miller also believes the hitches during that innings made him more aware of the ever-changing complexion of matches in the helter skelter of the final moments. \"Marco definitely benefitted from [the fluidity of the situation in Bloemfontein]. He's got long levers, he's like 5 metres tall. Those long arms obviously help him swing the bat with immense power, making him hit the ball very cleanly. Anyone that can do that has an advantage over the opposition already,\" he said. \"For Marco, it's just about trying to work out a game plan as time goes on in international cricket. He's a huge talent and has a lot going for him. As he keeps playing and gaining experience all of things will fall into place. \"He definitely has the gift. It's a great plus.\" Meanwhile, Miller is also excited what the future holds for Bavuma, whose third ODI century at the weekend suggests his form is up to scratch again. \"That was one of the most exciting innings I've seen,\" he said. \"Not necessarily because Temba scored a hundred, but because of the way he did it. He batted phenomenally well. \"He put the pressure on the bowlers from the word go and kept that tempo so it was a match-winning knock. Temba's been working really hard on his game and his innings was just outstanding. The maturity he batted with was so good to see and I'm very chuffed for him. \"He would have taken great learnings out of that and I think he showed everyone and himself that he can score at a very healthy run-rate with just normal cricket shots.\" First ball at the Oval in Kimberley is at 13:00 on Wednesday.","pubDate":"2023-02-01 08:18:16","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Ajinkya Rahane: पुजारा की राह पर रहाणे, काउंटी खेलकर तलाशेंगे फॉर्म; लिसेस्टरशायर की ओर से दिखाएंगे दम","link":"https://www.abplive.com/sports/cricket/ajinkya-rahane-to-play-in-county-cricket-for-leicestershire-season-2023-2322914","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Ajinkya Rahane Follows Cheteshwar Pujara: पिछले एक साल से टीम इंडिया से बाहर चल रहे अंजिक्य रहाणे (Ajinkya Rahane) अब चेतेश्वर पुजारा (Cheteshwar Pujara) की राह पर चलने जा रहे हैं. वह काउंटी क्रिकेट खेलकर अपनी फॉर्म को खोजने की कोशिश करेंगे. उन्होंने लिसेस्टरशायर (Leicestershire) के साथ करार किया है. वह इस साल इंग्लिश समर में काउंटी चैंपियनशिप के 8 मुकाबले खेलने के लिए उपलब्ध रहेंगे. वह वनडे टूर्नामेंट के लिए भी पूरे वक्त लिसेस्टरशायर के लिए मौजूद रहेंगे. गौरतलब है कि पिछले साल जनवरी में दक्षिण अफ्रीका टेस्ट सीरीज के बाद अजिंक्य रहाणे और चेतेश्वर पुजारा को टीम से बाहर कर दिया गया था. इसके बाद पुजारा ने काउंटी क्रिकेट में खेलकर अपनी लय हासिल की थी. उन्होंने बैक टू बैक शतक जड़े थे. इसके बाद पुजारा को फिर से टेस्ट टीम में जगह मिल गई थी. दूसरी ओर रहाणे अब तक अपनी लय हासिल नहीं कर सके हैं. अजिंक्या रहाणे जून 2023 में यानी IPL के ठीक बाद लिसेस्टरशायर की स्क्वाड का जॉइन करेंगे. पूरे चार साल बाद वह काउंटी क्रिकेट खेलेंगे. इससे पहले वह साल 2019 में हैम्पशायर की ओर से काउंटी क्रिकेट खेले थे. रणजी ट्रॉफी में दिए फॉर्म में लौटने के संकेतटेस्ट टीम से बाहर होने के बाद अजिंक्य रहाणे ने रणजी ट्रॉफी के पिछले सीजन में खेलकर फॉर्म खोजने की कोशिश की थी लेकिन वह कुछ खास नहीं कर पाए थे. हालांकि इस सीजन में उन्होंने लय में लौटने के संकेत दिए. इस सीजन रहाणे ने 7 मैचों में 57.63 की औसत से 634 रन जड़े. इस दौरान उन्होंने एक दोहरा शतक भी जड़ा. काउंटी क्रिकेट खेलने के फैसले पर क्या बोले रहाणे?रहाणे ने कहा है, 'मैं आगामी सीजन में लिसेस्टरशायर को जॉइन कर बहुत खुश हूं. मैं अपने नए साथी खिलाड़ियों के साथ क्रिकेट खेलने और लिसेस्टर शहर में घूमने का बेसब्री से इंतजार कर रहा हूं.' वहीं लिसेस्टरशायर क्लब के क्लाउडी हेंडरसन का कहना है, 'मैं लिसेस्टरशायर में अजिंक्य का स्वागत करने के लिए उत्साहित हूं. उनके पास क्रिकेट का बहुत अनुभव है और उनके मेहनत करने की लगन भी लाजवाब है. उन्हें अपनी स्क्वाड में शामिल करने का मौका हमारे लिए बहुत अच्छी बात रही है.' यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","content":"Ajinkya Rahane Follows Cheteshwar Pujara: पिछले एक साल से टीम इंडिया से बाहर चल रहे अंजिक्य रहाणे (Ajinkya Rahane) अब चेतेश्वर पुजारा (Cheteshwar Pujara) की राह पर चलने जा रहे हैं. वह काउंटी क्रिकेट खेलकर अपनी फॉर्म को खोजने की कोशिश करेंगे. उन्होंने लिसेस्टरशायर (Leicestershire) के साथ करार किया है. वह इस साल इंग्लिश समर में काउंटी चैंपियनशिप के 8 मुकाबले खेलने के लिए उपलब्ध रहेंगे. वह वनडे टूर्नामेंट के लिए भी पूरे वक्त लिसेस्टरशायर के लिए मौजूद रहेंगे. गौरतलब है कि पिछले साल जनवरी में दक्षिण अफ्रीका टेस्ट सीरीज के बाद अजिंक्य रहाणे और चेतेश्वर पुजारा को टीम से बाहर कर दिया गया था. इसके बाद पुजारा ने काउंटी क्रिकेट में खेलकर अपनी लय हासिल की थी. उन्होंने बैक टू बैक शतक जड़े थे. इसके बाद पुजारा को फिर से टेस्ट टीम में जगह मिल गई थी. दूसरी ओर रहाणे अब तक अपनी लय हासिल नहीं कर सके हैं. अजिंक्या रहाणे जून 2023 में यानी IPL के ठीक बाद लिसेस्टरशायर की स्क्वाड का जॉइन करेंगे. पूरे चार साल बाद वह काउंटी क्रिकेट खेलेंगे. इससे पहले वह साल 2019 में हैम्पशायर की ओर से काउंटी क्रिकेट खेले थे. रणजी ट्रॉफी में दिए फॉर्म में लौटने के संकेत टेस्ट टीम से बाहर होने के बाद अजिंक्य रहाणे ने रणजी ट्रॉफी के पिछले सीजन में खेलकर फॉर्म खोजने की कोशिश की थी लेकिन वह कुछ खास नहीं कर पाए थे. हालांकि इस सीजन में उन्होंने लय में लौटने के संकेत दिए. इस सीजन रहाणे ने 7 मैचों में 57.63 की औसत से 634 रन जड़े. इस दौरान उन्होंने एक दोहरा शतक भी जड़ा. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); काउंटी क्रिकेट खेलने के फैसले पर क्या बोले रहाणे? रहाणे ने कहा है, 'मैं आगामी सीजन में लिसेस्टरशायर को जॉइन कर बहुत खुश हूं. मैं अपने नए साथी खिलाड़ियों के साथ क्रिकेट खेलने और लिसेस्टर शहर में घूमने का बेसब्री से इंतजार कर रहा हूं.' वहीं लिसेस्टरशायर क्लब के क्लाउडी हेंडरसन का कहना है, 'मैं लिसेस्टरशायर में अजिंक्य का स्वागत करने के लिए उत्साहित हूं. उनके पास क्रिकेट का बहुत अनुभव है और उनके मेहनत करने की लगन भी लाजवाब है. उन्हें अपनी स्क्वाड में शामिल करने का मौका हमारे लिए बहुत अच्छी बात रही है.' यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","pubDate":"2023-02-01 06:59:49","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/4c643d0a7d8c2f63b9001762cdbb36c21675234518758300_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"South Africa vs England: Third ODI LIVE scores","link":"https://www.thesouthafrican.com/sport/cricket/proteas/south-africa-vs-england-third-odi-breaking-live-scores-wednesday-1-february-2023/","keywords":["Proteas","Featured","Important","Live updates","Proteas v England","South Africa"],"creator":["James Richardson"],"video_url":null,"description":"South Africa vs England: The Proteas have upstaged the tourists so far and signs of frustration have shown in their camp.","content":"South Africa vs England: The Proteas have upstaged the tourists so far and signs of frustration have shown in their camp. ALSO READ: England bowler Curran punished for ‘disrespectful’ celebration South Africa chasing CWC place While the series is won, South Africa still have the matter of hauling in the West Indies on the Cricket World Cup Super League to attend to. Winning the third ODI of this series will move South Africa into eighth place on the league to occupy the final Cricket World Cup qualifying spot. The five teams who miss out on a spot in the top eight will enter a qualifier tournament including lower ranked associate teams reaching the tournament through a separate qualification stream. WATCH: ENGLAND CAPTAIN CLASHES WITH PROTEAS STAR South Africa will have two further opportunities to move ahead of the West Indies when they face the Dutch in March and April, concluding the series that kicked off the CWCSL cycle before a COVID-19 related postponement. If the Proteas win the final match of the series against England they will clinch their place in the Cricket World Cup. Follow South Africa vs England LIVE Squad: Temba Bavuma (c), Quinton de Kock, Heinrich Klaasen, Rassie van der Dussen, Keshav Maharaj, Reeza Hendricks, Marco Jansen, Sisanda Magala, Janneman Malan, Aiden Markram, David Miller, Lungi Ngidi, Anrich Nortje, Wayne Parnell, Kagiso Rabada, Tabraiz Shamsi. England ODI Squad: Jos Buttler (c), Moeen Ali, Jofra Archer, Harry Brook, Sam Curran, Ben Duckett, Dawid Malan, Adil Rashid, Jason Roy, Phil Salt, Olly Stone, Reece Topley, David Willey, Chris Woakes. Betway ODI Series South Africa vs England Friday, 27 January – 13:00 South Africa beat England by 27 runs – Mangaung Oval, Bloemfontein Sunday, 29 January – 10:00 South Africa beat England by five wickets – Mangaung Oval, Bloemfontein Wednesday, 01 February – 13:00 South Africa vs England – The Oval, Kimberley CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-01 06:44:31","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IND vs AUS: भारतीय टीम को झटका, पहले 2 टेस्ट से बाहर हुआ यह खिलाड़ी, सूर्यकुमार यादव को मिल सकता है डेब्यू का मौका","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-border-gavaskar-trophy-shreyas-iyer-ruled-out-of-first-test-suryakumar-yadav-likely-to-make-debut-3742168#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs Australia: ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज का आगाज 9 फरवरी से होना है. टेस्ट सीरीज से पहले भारतीय टीम के लिए बुरी खबर है. रिपोर्ट की मानें तो श्रेयस अय्यर (Shreyas Iyer) पहले 2 टेस्ट मैच से बाहर रहेंगे.","content":"IND vs AUS Test: भारत और ऑस्ट्रेलिया: पहले 2 टेस्ट से बाहर हुए श्रेयस अय्यर India vs Australia: ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज का आगाज 9 फरवरी से होना है. टेस्ट सीरीज से पहले भारतीय टीम के लिए बुरी खबर है. रिपोर्ट की मानें तो श्रेयस अय्यर (Shreyas Iyer) पहले 2 टेस्ट मैच से बाहर रहेंगे. दरअसल, कमर की चोट के कारण अय्यर न्यूजीलैंड के खिलाफ सीरीज भी नहीं खेल पाए थे, वहीं, खबर ये है कि अय्यर अभी पूरी तरह से फिट नहीं हैं. यही कारण है कि पहले 2 टेस्ट मैच का हिस्सा यह भारतीय क्रिकेटर नहीं बन पाएगा. अय्यर की गौरमौजूदगी में सूर्यकुमार यादव का टेस्ट मैच में खेलना पक्का नजर आ रहा है. यानि ऑस्ट्रेलिया के खिलाफ पहले टेस्ट मैच में सूर्यकुमार डेब्यू कर सकते हैं. आगामी बॉर्डर-गावस्कर सीरीज भारत के लिए बेहद महत्वपूर्ण होने वाली है, क्योंकि वे विश्व टेस्ट चैंपियनशिप (WTC) फाइनल के लिए क्वालीफाई करने के लिए हर हाल में टेस्ट सीरीज को जीतना होगा. रोहित शर्मा एंड कंपनी इस समय WTC स्टैंडिंग में दूसरे स्थान पर काबिज हैं. इसके अलावा यह टेस्ट सीरीज विराट कोहली, रोहित शर्मा जैसे खिलाड़ियों के लिए काफी अहम है. वहीं, भारत और ऑस्ट्रेलिया के बीच पहला टेस्ट मैच 9 से 13 फरवरी के बीच नागपुर में खेला जाएगा. सीरीज में 4 टेस्ट मैच होने हैं. पहला टेस्ट, नागपुर में - 9-13 फरवरी (विदर्भ क्रिकेट एसोसिएशन स्टेडियम) दूसरा टेस्ट, दिल्ली में - 17-21 फरवरी (अरुण जेटली स्टेडियम) तीसरा टेस्ट धर्मशाला में - 1-5 मार्च (हिमाचल प्रदेश क्रिकेट एसोसिएशन स्टेडियम) चौथा टेस्ट, अहमदाबाद में - 9-13 मार्च (नरेंद्र मोदी स्टेडियम) : रोहित शर्मा (c), केएल राहुल (vc), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, , केएस भरत (wk), इशान किशन (wk), रविचंद्रन अश्विन, अक्षर पटेल, कुलदीप यादव, रवींद्र जडेजा, मोहम्मद शमी, मोहम्मद सिराज, उमेश यादव, जयदेव उनादकट, सूर्यकुमार यादव पैट कमिंस (कप्तान), एश्टन एगर, स्कॉट बोलैंड, एलेक्स केरी, कैमरून ग्रीन, पीटर हैंड्सकॉम्ब, जोश हेजलवुड, ट्रेविस हेड, उस्मान ख्वाजा, मारनस लबसचगने, नाथन लियोन, लांस मॉरिस, टॉड मर्फी, मैथ्यू रेनशॉ, स्टीव स्मिथ, मिचेल स्टार्क, मिचेल स्वेपसन, डेविड वॉर्नर पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 06:39:41","image_url":"https://c.ndtvimg.com/2022-10/dfr5ian8_suryakumar-yadav-sarfaraz-khan-twitter_625x300_02_October_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs NZ 3rd T20: वसीम जाफऱ ने बताया, तीसरे टी-20 में किसकी जगह पर खेल सकते हैं पृथ्वी शॉ","link":"https://sports.ndtv.com/hindi/cricket/india-vs-new-zealand-wasim-jaffer-wants-hardik-pandya-to-retain-yuzvendra-chahal-for-ahmedabad-t20i-also-chance-for-prithvi-shaw-3742130#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ T20I: न्यूजीलैंड के खिलाफ टी-20 सीरीज में भारतीय युवा खिलाड़ी जैसे शुभमन गिल और ईशान किशन अबतक असफल रहे हैं. जिनके फॉर्म को लेकर काफी बातें हो रही है.","content":"Prithvi Shaw: तीसरेटी-20 में एक बदलाव संभव न्यूजीलैंड के खिलाफ टी-20 सीरीज में भारतीय युवा खिलाड़ी जैसे शुभमन गिल और ईशान किशन अबतक असफल रहे हैं. जिनके फॉर्म को लेकर काफी बातें हो रही है. वहीं, भारत के पूर्व क्रिकेटर वसीम जाफर (Wasim Jaffer) ने तीसरे टी-20 मैच से पहले युवा खिलाड़ियों को लेकर अपनी राय दी है और कहा कि अभी भी इन युवा खिलाड़ियों को काफी कुछ सीखने की जरूरत है. के साथ बात करते हुए वसीम ने तीसरे टी-20 से पहले कुछ अहम मुद्दे पर बात की, खासकर भारतीय बल्लेबाजी पर अपनी राय दी. वसीम ने कहा 'जिस तरह की पिच पर बल्लेबाजों ने बैटिंग की, इसलिए यहां मैच आलोचना नहीं करना चाहूंगा. यकीनन अभी भी युवा क्रिकेटरों को काफी कुछ सीखना है लेकिन बल्लेबाजों ने जिस अंदाज में स्पीन वाली पिच पर जान लगाकर बैटिंग की है, वह यह दर्शाता है कि हम संधर्ष भी कर सकते हैं. अभी मैं ज्यादा आलोचना तो नहीं करूंगा लेकिन हां युवा बैटरों को पिच पर सिंगल लेने को लेकर ज्यादा से ज्यादा सोचना होगा.' वसीम ने आगे ये भी कहा कि अहमदाबाद में पिच अच्छी मिलेगी, ऐसे में उम्मीद है कि भारतीय बल्लेबाजों को अच्छी बल्लेबाजी करने मिलेगी. पूर्व भारतीय क्रिकेटर ने युजवेंद्र चहल को भारतीय इलेवन में शामिल किए जाने की वकालत की है और कहा, 'मुझे लगता है कि यदि हमारे पास कलाई वाले स्पिनर हैं तो उसका उपयोग करना चाहिए. वहीं, उमरान को लेकर मेरा मानना है कि वो इस फॉर्मेट में संघर्ष कर रहे हैं, इस फॉर्मेट में जिस तरह की विविधता चाहिए वो अभी कर नहीं पा रहे हैं. ऐसे में मुझे लगता है कि चहल एक सही विकल्प हैं उनकी जगह.' वहीं, प्लेइंग इलेवन में बदलाव को लेकर वसीम ने कहा कि, यदि बदलाव की देखें तो शुभमन गिल की जगह पृथ्वी को शामिल किया जाना चाहिए, शॉ इस समय शानदार फॉर्म में हैं और वो इस फॉर्मेट में अच्छा कर भी रहे हैं. वहीं, जाफर ने कहा कि यदि गिल भी खेलते हैं तो मुझे इससे कोई फर्क नहीं पड़ेगा. बता दें कि आज तीसरा टी20 मैच खेला जाएगा. पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 06:21:29","image_url":"https://c.ndtvimg.com/2023-01/jjs37348_prithvi-shaw-806_625x300_27_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Video: माही मार रहा है...आईपीएल 2023 से पहले दिखा एमएस धोनी का पुराना अवतार, जमकर लगाए चौके-छक्के","link":"https://www.abplive.com/sports/cricket/ms-dhoni-starts-preparation-for-ipl-2023-video-viral-in-social-media-dhoni-net-practice-2322866","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"MS Dhoni Practice Video, IPL 2023: इंडियन प्रीमियर लीग 2023 के सीजन की शुरुआत मार्च अंत या फिर अप्रैल महीने की शुरुआत में हो सकती है. इसको लेकर अभी से सभी फ्रेंचाइजियों के खिलाड़ियों ने भले ही अभ्यास करना ना शुरू किया हो, लेकिन चेन्नई सुपर किंग्स टीम के कप्तान महेंद्र सिंह धोनी ने तैयारी करना शुरू कर दिया है. महेंद्र सिंह धोनी का नेट्स पर अभ्यास करते हुए एक वीडियो सोशल मीडिया पर जमकर वायरल हो रहा है. इस वीडियो में धोनी नेट्स पर लंबे-लंबे छक्के लगाते हुए देखे जा सकते हैं. धोनी स्पिन गेंदबाजों के खिलाफ आक्रामक अंदाज में खेलते हुए दिखाई दिए. इससे साफ पता चलता है कि वह आगामी आईपीएल के सीजन से पहले खुद को पूरी तरह से लय में वापस लाना चाहते हैं. साल 2020 में अंतरराष्ट्रीय क्रिकेट से संन्यास लेने के बाद से धोनी सिर्फ आईपीएल में ही अब तक खेलते हुए दिखाई दिए हैं. पिछले आईपीएल सीजन के शुरू होने से पहले धोनी ने जडेजा को चेन्नई सुपर किंग्स की कप्तानी सौंप दी थी, लेकिन टीम के प्रदर्शन को देखते हुए उन्हें वापस बीच सीजन में कप्तानी की जिम्मेदारी को फिर से संभालना पड़ा था. https://twitter.com/msdfansofficial/status/1620066902004609029 यह धोनी का आखिरी आईपीएल सीजन हो सकता है पिछले सीजन में जब धोनी ने रवींद्र जडेजा को टीम की कप्तानी सौंपी थी तो उस समय सभी को लगा कि यह धोनी का आखिरी सीजन होगा. हालांकि धोनी ने अपने बयान में यह साफ कर दिया था कि वह अपना आखिरी आईपीएल मैच चेन्नई सुपर किंग्स के होम ग्राउंड एम.ए चिदंबरम स्टेडियम में खेलेंगे. बता दें कि पिछले आईपीएल सीजन में धोनी ने 14 मैचों में 33.14 के औसत से कुल 232 रन बनाए थे जिसमें एक अर्धशतकीय पारी भी शामिल थी. हाल में धोनी भारत और न्यूजीलैंड के बीच रांची में खेले गए पहले टी20 मुकाबले को देखने भी पहुंचे थे वहीं उन्होंने भारत और कीवी टीम के खिलाड़ियों के साथ भी समय बिताया था। ये भी पढ़े... IND vs AUS: ऑस्ट्रेलिया को लगा बड़ा झटका, भारत के खिलाफ पहले टेस्ट में नहीं खेलेंगे मिचेल स्टार्क","content":"MS Dhoni Practice Video, IPL 2023: इंडियन प्रीमियर लीग 2023 के सीजन की शुरुआत मार्च अंत या फिर अप्रैल महीने की शुरुआत में हो सकती है. इसको लेकर अभी से सभी फ्रेंचाइजियों के खिलाड़ियों ने भले ही अभ्यास करना ना शुरू किया हो, लेकिन चेन्नई सुपर किंग्स टीम के कप्तान महेंद्र सिंह धोनी ने तैयारी करना शुरू कर दिया है. महेंद्र सिंह धोनी का नेट्स पर अभ्यास करते हुए एक वीडियो सोशल मीडिया पर जमकर वायरल हो रहा है. इस वीडियो में धोनी नेट्स पर लंबे-लंबे छक्के लगाते हुए देखे जा सकते हैं. धोनी स्पिन गेंदबाजों के खिलाफ आक्रामक अंदाज में खेलते हुए दिखाई दिए. इससे साफ पता चलता है कि वह आगामी आईपीएल के सीजन से पहले खुद को पूरी तरह से लय में वापस लाना चाहते हैं. साल 2020 में अंतरराष्ट्रीय क्रिकेट से संन्यास लेने के बाद से धोनी सिर्फ आईपीएल में ही अब तक खेलते हुए दिखाई दिए हैं. पिछले आईपीएल सीजन के शुरू होने से पहले धोनी ने जडेजा को चेन्नई सुपर किंग्स की कप्तानी सौंप दी थी, लेकिन टीम के प्रदर्शन को देखते हुए उन्हें वापस बीच सीजन में कप्तानी की जिम्मेदारी को फिर से संभालना पड़ा था. https://twitter.com/msdfansofficial/status/1620066902004609029 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); यह धोनी का आखिरी आईपीएल सीजन हो सकता है पिछले सीजन में जब धोनी ने रवींद्र जडेजा को टीम की कप्तानी सौंपी थी तो उस समय सभी को लगा कि यह धोनी का आखिरी सीजन होगा. हालांकि धोनी ने अपने बयान में यह साफ कर दिया था कि वह अपना आखिरी आईपीएल मैच चेन्नई सुपर किंग्स के होम ग्राउंड एम.ए चिदंबरम स्टेडियम में खेलेंगे. बता दें कि पिछले आईपीएल सीजन में धोनी ने 14 मैचों में 33.14 के औसत से कुल 232 रन बनाए थे जिसमें एक अर्धशतकीय पारी भी शामिल थी. हाल में धोनी भारत और न्यूजीलैंड के बीच रांची में खेले गए पहले टी20 मुकाबले को देखने भी पहुंचे थे वहीं उन्होंने भारत और कीवी टीम के खिलाड़ियों के साथ भी समय बिताया था। ये भी पढ़े... IND vs AUS: ऑस्ट्रेलिया को लगा बड़ा झटका, भारत के खिलाफ पहले टेस्ट में नहीं खेलेंगे मिचेल स्टार्क","pubDate":"2023-02-01 06:17:04","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/60fb377da9b85b60b982f963f4396ad81675231569989582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"SA vs ENG: सैम कर्रन ने विकेट लेने के बाद मनाया ऐसा जश्न, ICC ने ठोका जुर्माना, ये सज़ा भी मिली!","link":"https://www.abplive.com/sports/cricket/england-all-rounder-sam-curran-fined-match-fee-and-gets-demerit-point-on-excessive-celebration-of-temba-bavuma-wicket-eng-vs-sa-2322837","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Sam Curran Demerit Points: इंग्लैंड के ऑलराउंडर सैम कर्रन (Sam Curran) पर ICC ने मैच फीस का 15 फीसदी जुर्माना लगाया है. साथ ही उन्हें एक डिमैरिट पॉइंट भी दिया गया है. दक्षिण अफ्रीका के खिलाफ टेंबा बावुमा का विकेट मिलने के बाद मनाए गए जश्न के कारण सैम कर्रन पर यह एक्शन लिया गया है. इंग्लैंड और दक्षिण अफ्रीका (ENG vs SA) के बीच रविवार को खेले गए दूसरे मुकाबले में सैम कर्रन ने टेंबा बावुमा (Temba Bavuma) का अहम विकेट लिया था. बावुमा ने 102 गेंद पर 109 रन की पारी खेली थी. इस विकेट के मिलने की खुशी में सैम कर्रन पिच पर दौड़ते हुए बावुमा के काफी करीब तक जा पहुंचे थे. यहां सैम कर्रन ने ICC की आचार संहिता का लेवल-1 अफेंस किया था. इसके मुताबिक उन खिलाड़ियों पर एक्शन लिया जाता है जो बल्लेबाज के आउट होने के बाद जरूरत से ज्यादा सेलिब्रेट करते हैं और उसके बेहद नजदीक तक पहुंचते हुए ऐसी एक्शन करते हैं जो बल्लेबाज को जवाब देने के लिए उग्र करे. अगर एक खिलाड़ी को 24 महीने के पीरियड के दौरान चार या इससे ज्यादा डिमैरिट पॉइंट मिलते हैं तो उस पर कुछ समय के लिए बैन लगा दिया जाता है. वैसे सैम कर्रन का इस पीरियड में पहला डिमैरिट पॉइंट है. सीरीज में 2-0 की अजेय बढ़त बना चुकी है दक्षिण अफ्रीका इंग्लैंड और दक्षिण अफ्रीका के बीच तीन मैचों की वनडे सीरीज के शुरुआती दोनों मुकाबले प्रोटियाज के नाम रहे हैं. पहले मैच में दक्षिण अफ्रीका ने इंग्लैंड को 27 रन से हराया था. वहीं, दूसरे मुकाबले में दक्षिण अफ्रीका ने 5 गेंद बाकी रहते 5 विकेट से जीत दर्ज की थी. अब इंग्लैंड के ऊपर इस सीरीज में क्लीन स्वीप का खतरा मंडरा रहा है. यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","content":"Sam Curran Demerit Points: इंग्लैंड के ऑलराउंडर सैम कर्रन (Sam Curran) पर ICC ने मैच फीस का 15 फीसदी जुर्माना लगाया है. साथ ही उन्हें एक डिमैरिट पॉइंट भी दिया गया है. दक्षिण अफ्रीका के खिलाफ टेंबा बावुमा का विकेट मिलने के बाद मनाए गए जश्न के कारण सैम कर्रन पर यह एक्शन लिया गया है. इंग्लैंड और दक्षिण अफ्रीका (ENG vs SA) के बीच रविवार को खेले गए दूसरे मुकाबले में सैम कर्रन ने टेंबा बावुमा (Temba Bavuma) का अहम विकेट लिया था. बावुमा ने 102 गेंद पर 109 रन की पारी खेली थी. इस विकेट के मिलने की खुशी में सैम कर्रन पिच पर दौड़ते हुए बावुमा के काफी करीब तक जा पहुंचे थे. यहां सैम कर्रन ने ICC की आचार संहिता का लेवल-1 अफेंस किया था. इसके मुताबिक उन खिलाड़ियों पर एक्शन लिया जाता है जो बल्लेबाज के आउट होने के बाद जरूरत से ज्यादा सेलिब्रेट करते हैं और उसके बेहद नजदीक तक पहुंचते हुए ऐसी एक्शन करते हैं जो बल्लेबाज को जवाब देने के लिए उग्र करे. अगर एक खिलाड़ी को 24 महीने के पीरियड के दौरान चार या इससे ज्यादा डिमैरिट पॉइंट मिलते हैं तो उस पर कुछ समय के लिए बैन लगा दिया जाता है. वैसे सैम कर्रन का इस पीरियड में पहला डिमैरिट पॉइंट है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); सीरीज में 2-0 की अजेय बढ़त बना चुकी है दक्षिण अफ्रीका इंग्लैंड और दक्षिण अफ्रीका के बीच तीन मैचों की वनडे सीरीज के शुरुआती दोनों मुकाबले प्रोटियाज के नाम रहे हैं. पहले मैच में दक्षिण अफ्रीका ने इंग्लैंड को 27 रन से हराया था. वहीं, दूसरे मुकाबले में दक्षिण अफ्रीका ने 5 गेंद बाकी रहते 5 विकेट से जीत दर्ज की थी. अब इंग्लैंड के ऊपर इस सीरीज में क्लीन स्वीप का खतरा मंडरा रहा है. यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","pubDate":"2023-02-01 05:58:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/f40bee8693096f7693768a751723f2f81675229644759300_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sam Curran fined for 'excessive celebration' of Temba Bavuma dismissal","link":"https://www.iol.co.za/sport/cricket/international/sam-curran-fined-for-excessive-celebration-of-temba-bavuma-dismissal-b0181271-083d-4b22-8d9a-130c52332ed7","keywords":null,"creator":["AFP"],"video_url":null,"description":"England all-rounder Sam Curran has been fined 15 percent of his match fee and handed a demerit point for ‘excessively celebrating’ his dismissal of Proteas captain Temba Bavuma.","content":"Kimberly - England all-rounder Sam Curran has been fined 15 percent of his match fee and handed a demerit point for \"excessively celebrating\" his dismissal of South African captain Temba Bavuma in the second one-day international on Sunday. The penalty was announced by the International Cricket Council on Tuesday. The teams meet in the third and final match of the World Cup Super League series in Kimberley on Wednesday. Bavuma made 109 as South Africa took a decisive 2-0 series lead in Bloemfontein before scooping a ball from Curran into his stumps. Curran ran down the pitch and got close to Bavuma as he celebrated the wicket. Match referee Jeff Crowe of New Zealand fined Curran following a report by the umpires. Curran admitted the offence and there was no need for a formal hearing. ALSO READ: Temba Bavuma maintained his dignity despite keyboard warriors’ prejudice According to the ICC, Curran was found to have committed a level one offence of the ICC code of conduct when he \"excessively celebrated towards and in close proximity to the dismissed batter, being an action which had the potential to provoke an aggressive reaction from Bavuma\". If a player accumulates four or more demerit points within a 24-month period he faces a ban. It was Curran's first offence within the time period. cb/imm © Agence France-Presse Share","pubDate":"2023-02-01 05:56:47","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/68ba1a53-c5fd-5ab0-ae8c-35b207e0e273&operation=CROP&offset=0x136&resize=3200x1799","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"'मैं भारतीय Visa का इंतजार कर रहा', उस्मान ख्वाजा के साथ हो गई गुगली, Memes शेयर कर बयां किया दर्द..","link":"https://sports.ndtv.com/hindi/cricket/usman-khawaja-missed-the-teams-flight-to-india-due-to-a-visa-delay-3741903#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS test Series: ऑस्ट्रेलियाई क्रिकेटर उस्मान ख्वाजा (Usman Khawaja) के साथ बहुत बड़ी गुगली हो गई है. दरअसल, भारत दौरे के लिए ऑस्ट्रेलियाई टीम अपने देश से भारत आने के लिए निकल पड़ी है लेकिन क्रिकेटर उस्मान ख्वाजा को भारत का वीजा (VISA) समय रहते नहीं मिल पाया जिसके कारण भारत आने वाली फ्लाइट पर ऑस्ट्रेलियाई क्रिकेटर चढ़ नहीं पाए हैं","content":"उस्मान ख्वाजा ने की भारत आने वाली फ्लाइट मिस, जानिए कारण IND vs AUS test Series: ऑस्ट्रेलियाई क्रिकेटर के साथ बहुत बड़ी गुगली हो गई है. दरअसल, भारत दौरे के लिए ऑस्ट्रेलियाई टीम अपने देश से भारत आने के लिए निकल पड़ी है लेकिन क्रिकेटर उस्मान ख्वाजा को भारत का वीजा (VISA) समय रहते नहीं मिल पाया जिसके कारण भारत आने वाली फ्लाइट पर चढ़ नहीं पाए हैं. ख्वाजा ने सोशल मीडिया पर Memes शेयर कर इस बात की जानकारी साझा की है. उस्मानने मजाकिया तस्वीर शेयर कर लिखा है 'मैं भारतीय Visa का इंतजार कर रहा हूं..' बता दें कि भारत और ऑस्ट्रेलिया के बीच सीरीज का पहला मैच 9 फरवरी को नागपुर में खेला जाएगा. 1 फरवरी को ऑस्ट्रेलियाई टीम भारत आने वाली है. वैसे, फैन्स को बता दें कि क्रिकेट ऑस्ट्रेलिया की ओर से बताया गया है कि कि उम्मीद है कि ख्वाजा का वीजा क्लीयर हो जाएगा और वह गुरुवार को भारत के लिए उड़ान भरेंगे. ख्वाजा ऑस्ट्रेलियाई टीम के सबसे अहम खिलाड़ियों में से एक हैं. पहला टेस्ट, नागपुर में - 9-13 फरवरी (विदर्भ क्रिकेट एसोसिएशन स्टेडियम) दूसरा टेस्ट, दिल्ली में - 17-21 फरवरी (अरुण जेटली स्टेडियम) तीसरा टेस्ट धर्मशाला में - 1-5 मार्च (हिमाचल प्रदेश क्रिकेट एसोसिएशन स्टेडियम) चौथा टेस्ट, अहमदाबाद में - 9-13 मार्च (नरेंद्र मोदी स्टेडियम) : रोहित शर्मा (c), केएल राहुल (vc), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, श्रेयस अय्यर, केएस भरत (wk), इशान किशन (wk), रविचंद्रन अश्विन, अक्षर पटेल, कुलदीप यादव, रवींद्र जडेजा, मोहम्मद शमी, मोहम्मद सिराज, उमेश यादव, जयदेव उनादकट, सूर्यकुमार यादव : पैट कमिंस (कप्तान), एश्टन एगर, स्कॉट बोलैंड, एलेक्स केरी, कैमरून ग्रीन, पीटर हैंड्सकॉम्ब, जोश हेजलवुड, ट्रेविस हेड, उस्मान ख्वाजा, मारनस लबसचगने, नाथन लियोन, लांस मॉरिस, टॉड मर्फी, मैथ्यू रेनशॉ, स्टीव स्मिथ, मिचेल स्टार्क, मिचेल स्वेपसन, डेविड वॉर्नर पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 05:51:02","image_url":"https://c.ndtvimg.com/2023-01/abgp156g_usman-khawaja-afp_625x300_07_January_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs NZ 3rd T20: ईशान या गिल, किस पर गिरेगी गाज? दो बदलाव के साथ उतर सकती है टीम इंडिया","link":"https://www.abplive.com/sports/cricket/ind-vs-nz-3rd-t20i-indian-team-can-do-these-2-changes-in-the-last-t20i-match-against-newzealand-2322815","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"India vs New Zealand 3rd T20, India Playing XI: भारत और न्यूजीलैंड के बीच खेली जा रही 3 मैचों की टी20 सीरीज का आखिरी मुकाबला अहमदाबाद के नरेंद्र मोदी स्टेडियम में खेला जाएगा. इस मैच को लेकर ऐसी उम्मीद जताई जा रही है कि भारतीय टीम की प्लेइंग इलेवन में बदलाव देखने को मिल सकता है. ओपनिंग में लंबे समय के बाद टीम में वापसी करने वाले पृथ्वी शॉ को मौका दिया जा सकता है. वहीं अहमदाबाद की पिच को ध्यान में रखते हुए प्लेइंग इलेवन में उमरान मलिक की भी वापसी हो सकती है, जिनको युजवेंद्र चहल की जगह पर टीम में शामिल किया जा सकता है. निर्णायक मुकाबले को देखते हुए भारतीय टीम की प्लेइंग इलेवन में दो बदलाव देखने को मिल सकते हैं. अभी तक इस टी20 सीरीज में भारतीय ओपनिंग बल्लेबाजों ने उम्मीद के अनुसार शुरुआत नहीं दी है. शुभमन गिल का न्यूजीलैंड के खिलाफ वनडे सीरीज में शानदार फॉर्म देखने को मिला था, लेकिन टी20 सीरीज में वह अभी तक उस तरह का प्रदर्शन करने में कामयाब नहीं हो सके हैं. गिल ने अब तक इस सीरीज में 11 और 7 रन की पारियां खेली हैं. शुरुआती ओवरों में तेजी से रन बनाने की क्षमता रखते हैं पृथ्वी शॉ भले ही पृथ्वी शॉ को अभी तक 1 ही टी20 अंतरराष्ट्रीय मुकाबला खेलने का मौका मिला है, लेकिन घरेलू क्रिकेट और आईपीएल में उनका प्रदर्शन शानदार देखने को मिला है. पृथ्वी शॉ शुरुआती ओवरों में तेजी के साथ रन बनाते हैं, जिससे विपक्षी टीम के लिए मैच में वापसी करना मुश्किल भरा हो जाता है. गेंदबाजी में बदलाव को लेकर बात की जाए तो लखनऊ में जहां टीम 4 स्पिन गेंदबाजों के साथ मैदान पर उतरी थी. वहीं इस मैच में टीम 3 तेज गेंदबाजों के साथ मैदान पर उतरने का फैसला कर सकती है. ऐसे में युजवेंद्र चहल की जगह पर उमरान मलिक को खेलने का मौका मिल सकता है जो अहमदाबाद की पिच और हालात को देखते हुए टीम के लिए अधिक उपयोगी साबित हो सकते हैं. ये भी पढ़े... Team India Schedule: फरवरी में हर दिन मैदान पर दिखेगी टीम इंडिया! इस महीने का शेड्यूल देख उड़ जाएंगे होश","content":"India vs New Zealand 3rd T20, India Playing XI: भारत और न्यूजीलैंड के बीच खेली जा रही 3 मैचों की टी20 सीरीज का आखिरी मुकाबला अहमदाबाद के नरेंद्र मोदी स्टेडियम में खेला जाएगा. इस मैच को लेकर ऐसी उम्मीद जताई जा रही है कि भारतीय टीम की प्लेइंग इलेवन में बदलाव देखने को मिल सकता है. ओपनिंग में लंबे समय के बाद टीम में वापसी करने वाले पृथ्वी शॉ को मौका दिया जा सकता है. वहीं अहमदाबाद की पिच को ध्यान में रखते हुए प्लेइंग इलेवन में उमरान मलिक की भी वापसी हो सकती है, जिनको युजवेंद्र चहल की जगह पर टीम में शामिल किया जा सकता है. निर्णायक मुकाबले को देखते हुए भारतीय टीम की प्लेइंग इलेवन में दो बदलाव देखने को मिल सकते हैं. अभी तक इस टी20 सीरीज में भारतीय ओपनिंग बल्लेबाजों ने उम्मीद के अनुसार शुरुआत नहीं दी है. शुभमन गिल का न्यूजीलैंड के खिलाफ वनडे सीरीज में शानदार फॉर्म देखने को मिला था, लेकिन टी20 सीरीज में वह अभी तक उस तरह का प्रदर्शन करने में कामयाब नहीं हो सके हैं. गिल ने अब तक इस सीरीज में 11 और 7 रन की पारियां खेली हैं. शुरुआती ओवरों में तेजी से रन बनाने की क्षमता रखते हैं पृथ्वी शॉ googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); भले ही पृथ्वी शॉ को अभी तक 1 ही टी20 अंतरराष्ट्रीय मुकाबला खेलने का मौका मिला है, लेकिन घरेलू क्रिकेट और आईपीएल में उनका प्रदर्शन शानदार देखने को मिला है. पृथ्वी शॉ शुरुआती ओवरों में तेजी के साथ रन बनाते हैं, जिससे विपक्षी टीम के लिए मैच में वापसी करना मुश्किल भरा हो जाता है. गेंदबाजी में बदलाव को लेकर बात की जाए तो लखनऊ में जहां टीम 4 स्पिन गेंदबाजों के साथ मैदान पर उतरी थी. वहीं इस मैच में टीम 3 तेज गेंदबाजों के साथ मैदान पर उतरने का फैसला कर सकती है. ऐसे में युजवेंद्र चहल की जगह पर उमरान मलिक को खेलने का मौका मिल सकता है जो अहमदाबाद की पिच और हालात को देखते हुए टीम के लिए अधिक उपयोगी साबित हो सकते हैं. ये भी पढ़े... Team India Schedule: फरवरी में हर दिन मैदान पर दिखेगी टीम इंडिया! इस महीने का शेड्यूल देख उड़ जाएंगे होश","pubDate":"2023-02-01 05:36:28","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/95f3b66ef658968c7f185dc697b31aa11675227845888582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | Ice-man Miller believes Jansen can become his spiritual Proteas successor: 'He has the gift'","link":"https://www.news24.com/sport/Cricket/Proteas/ice-man-miller-believes-jansen-can-become-his-spiritual-proteas-successor-he-has-the-gift-20230201","keywords":null,"creator":null,"video_url":null,"description":"David Miller has little doubt Marco Jansen can add to his ever-expanding cricketing repertoire by eventually becoming the type of \"finisher\" he already is with the bat for the Proteas.","content":"In Kimberley David Miller has little doubt Marco Jansen can add to his ever-expanding cricketing repertoire by eventually becoming the type of \"finisher\" he already is with the bat for the Proteas. READ | Dane van Niekerk's shocking T20 World Cup omission explained: 'We're testing everyone fairly' The lanky 22-year-old, named the ICC's emerging world player of the year last week predominantly for his bowling exploits, has recently started to showcase the batting ability he's regularly touted. Jansen lit up the SA20 with a 27-ball 66 for Sunrisers Eastern Cape against MI Cape Town before playing a crucial if at times imperfect role in South Africa's momentous, series-clinching chase against England in Bloemfontein last Sunday. His unbeaten 32 off 29 deliveries mixed fine power-hitting and excellent placement with some nervy over-exuberance though he had the immense benefit of the ice-cool Miller by his side. \"It's the first time I batted with him. It was really nice just to get that bond together because we've got on well off the field,\" said the Proteas stalwart ahead of Wednesday's third and final ODI here. \"Marco's got a lot to offer, he's still very young and a great talent with bat and ball. It was just nice to be there with him, chatting him through a few scenarios. \"When the pressure is on like that, for him to come through the way he did was just really pleasing to see. Hopefully we get a lot more partnerships together in future.\" Miller also believes the hitches during that innings made him more aware of the ever-changing complexion of matches in the helter skelter of the final moments. \"Marco definitely benefitted from [the fluidity of the situation in Bloemfontein]. He's got long levers, he's like 5 metres tall. Those long arms obviously help him swing the bat with immense power, making him hit the ball very cleanly. Anyone that can do that has an advantage over the opposition already,\" he said. \"For Marco, it's just about trying to work out a game plan as time goes on in international cricket. He's a huge talent and has a lot going for him. As he keeps playing and gaining experience all of things will fall into place. \"He definitely has the gift. It's a great plus.\" Meanwhile, Miller is also excited what the future holds for Bavuma, whose third ODI century at the weekend suggests his form is up to scratch again. \"That was one of the most exciting innings I've seen,\" he said. \"Not necessarily because Temba scored a hundred, but because of the way he did it. He batted phenomenally well. \"He put the pressure on the bowlers from the word go and kept that tempo so it was a match-winning knock. Temba's been working really hard on his game and his innings was just outstanding. The maturity he batted with was so good to see and I'm very chuffed for him. \"He would have taken great learnings out of that and I think he showed everyone and himself that he can score at a very healthy run-rate with just normal cricket shots.\" First ball at the Oval in Kimberley is at 13:00 on Wednesday.","pubDate":"2023-02-01 08:18:16","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Ajinkya Rahane: पुजारा की राह पर रहाणे, काउंटी खेलकर तलाशेंगे फॉर्म; लिसेस्टरशायर की ओर से दिखाएंगे दम","link":"https://www.abplive.com/sports/cricket/ajinkya-rahane-to-play-in-county-cricket-for-leicestershire-season-2023-2322914","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Ajinkya Rahane Follows Cheteshwar Pujara: पिछले एक साल से टीम इंडिया से बाहर चल रहे अंजिक्य रहाणे (Ajinkya Rahane) अब चेतेश्वर पुजारा (Cheteshwar Pujara) की राह पर चलने जा रहे हैं. वह काउंटी क्रिकेट खेलकर अपनी फॉर्म को खोजने की कोशिश करेंगे. उन्होंने लिसेस्टरशायर (Leicestershire) के साथ करार किया है. वह इस साल इंग्लिश समर में काउंटी चैंपियनशिप के 8 मुकाबले खेलने के लिए उपलब्ध रहेंगे. वह वनडे टूर्नामेंट के लिए भी पूरे वक्त लिसेस्टरशायर के लिए मौजूद रहेंगे. गौरतलब है कि पिछले साल जनवरी में दक्षिण अफ्रीका टेस्ट सीरीज के बाद अजिंक्य रहाणे और चेतेश्वर पुजारा को टीम से बाहर कर दिया गया था. इसके बाद पुजारा ने काउंटी क्रिकेट में खेलकर अपनी लय हासिल की थी. उन्होंने बैक टू बैक शतक जड़े थे. इसके बाद पुजारा को फिर से टेस्ट टीम में जगह मिल गई थी. दूसरी ओर रहाणे अब तक अपनी लय हासिल नहीं कर सके हैं. अजिंक्या रहाणे जून 2023 में यानी IPL के ठीक बाद लिसेस्टरशायर की स्क्वाड का जॉइन करेंगे. पूरे चार साल बाद वह काउंटी क्रिकेट खेलेंगे. इससे पहले वह साल 2019 में हैम्पशायर की ओर से काउंटी क्रिकेट खेले थे. रणजी ट्रॉफी में दिए फॉर्म में लौटने के संकेतटेस्ट टीम से बाहर होने के बाद अजिंक्य रहाणे ने रणजी ट्रॉफी के पिछले सीजन में खेलकर फॉर्म खोजने की कोशिश की थी लेकिन वह कुछ खास नहीं कर पाए थे. हालांकि इस सीजन में उन्होंने लय में लौटने के संकेत दिए. इस सीजन रहाणे ने 7 मैचों में 57.63 की औसत से 634 रन जड़े. इस दौरान उन्होंने एक दोहरा शतक भी जड़ा. काउंटी क्रिकेट खेलने के फैसले पर क्या बोले रहाणे?रहाणे ने कहा है, 'मैं आगामी सीजन में लिसेस्टरशायर को जॉइन कर बहुत खुश हूं. मैं अपने नए साथी खिलाड़ियों के साथ क्रिकेट खेलने और लिसेस्टर शहर में घूमने का बेसब्री से इंतजार कर रहा हूं.' वहीं लिसेस्टरशायर क्लब के क्लाउडी हेंडरसन का कहना है, 'मैं लिसेस्टरशायर में अजिंक्य का स्वागत करने के लिए उत्साहित हूं. उनके पास क्रिकेट का बहुत अनुभव है और उनके मेहनत करने की लगन भी लाजवाब है. उन्हें अपनी स्क्वाड में शामिल करने का मौका हमारे लिए बहुत अच्छी बात रही है.' यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","content":"Ajinkya Rahane Follows Cheteshwar Pujara: पिछले एक साल से टीम इंडिया से बाहर चल रहे अंजिक्य रहाणे (Ajinkya Rahane) अब चेतेश्वर पुजारा (Cheteshwar Pujara) की राह पर चलने जा रहे हैं. वह काउंटी क्रिकेट खेलकर अपनी फॉर्म को खोजने की कोशिश करेंगे. उन्होंने लिसेस्टरशायर (Leicestershire) के साथ करार किया है. वह इस साल इंग्लिश समर में काउंटी चैंपियनशिप के 8 मुकाबले खेलने के लिए उपलब्ध रहेंगे. वह वनडे टूर्नामेंट के लिए भी पूरे वक्त लिसेस्टरशायर के लिए मौजूद रहेंगे. गौरतलब है कि पिछले साल जनवरी में दक्षिण अफ्रीका टेस्ट सीरीज के बाद अजिंक्य रहाणे और चेतेश्वर पुजारा को टीम से बाहर कर दिया गया था. इसके बाद पुजारा ने काउंटी क्रिकेट में खेलकर अपनी लय हासिल की थी. उन्होंने बैक टू बैक शतक जड़े थे. इसके बाद पुजारा को फिर से टेस्ट टीम में जगह मिल गई थी. दूसरी ओर रहाणे अब तक अपनी लय हासिल नहीं कर सके हैं. अजिंक्या रहाणे जून 2023 में यानी IPL के ठीक बाद लिसेस्टरशायर की स्क्वाड का जॉइन करेंगे. पूरे चार साल बाद वह काउंटी क्रिकेट खेलेंगे. इससे पहले वह साल 2019 में हैम्पशायर की ओर से काउंटी क्रिकेट खेले थे. रणजी ट्रॉफी में दिए फॉर्म में लौटने के संकेत टेस्ट टीम से बाहर होने के बाद अजिंक्य रहाणे ने रणजी ट्रॉफी के पिछले सीजन में खेलकर फॉर्म खोजने की कोशिश की थी लेकिन वह कुछ खास नहीं कर पाए थे. हालांकि इस सीजन में उन्होंने लय में लौटने के संकेत दिए. इस सीजन रहाणे ने 7 मैचों में 57.63 की औसत से 634 रन जड़े. इस दौरान उन्होंने एक दोहरा शतक भी जड़ा. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); काउंटी क्रिकेट खेलने के फैसले पर क्या बोले रहाणे? रहाणे ने कहा है, 'मैं आगामी सीजन में लिसेस्टरशायर को जॉइन कर बहुत खुश हूं. मैं अपने नए साथी खिलाड़ियों के साथ क्रिकेट खेलने और लिसेस्टर शहर में घूमने का बेसब्री से इंतजार कर रहा हूं.' वहीं लिसेस्टरशायर क्लब के क्लाउडी हेंडरसन का कहना है, 'मैं लिसेस्टरशायर में अजिंक्य का स्वागत करने के लिए उत्साहित हूं. उनके पास क्रिकेट का बहुत अनुभव है और उनके मेहनत करने की लगन भी लाजवाब है. उन्हें अपनी स्क्वाड में शामिल करने का मौका हमारे लिए बहुत अच्छी बात रही है.' यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","pubDate":"2023-02-01 06:59:49","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/4c643d0a7d8c2f63b9001762cdbb36c21675234518758300_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"South Africa vs England: Third ODI LIVE scores","link":"https://www.thesouthafrican.com/sport/cricket/proteas/south-africa-vs-england-third-odi-breaking-live-scores-wednesday-1-february-2023/","keywords":["Proteas","Featured","Important","Live updates","Proteas v England","South Africa"],"creator":["James Richardson"],"video_url":null,"description":"South Africa vs England: The Proteas have upstaged the tourists so far and signs of frustration have shown in their camp.","content":"South Africa vs England: The Proteas have upstaged the tourists so far and signs of frustration have shown in their camp. ALSO READ: England bowler Curran punished for ‘disrespectful’ celebration South Africa chasing CWC place While the series is won, South Africa still have the matter of hauling in the West Indies on the Cricket World Cup Super League to attend to. Winning the third ODI of this series will move South Africa into eighth place on the league to occupy the final Cricket World Cup qualifying spot. The five teams who miss out on a spot in the top eight will enter a qualifier tournament including lower ranked associate teams reaching the tournament through a separate qualification stream. WATCH: ENGLAND CAPTAIN CLASHES WITH PROTEAS STAR South Africa will have two further opportunities to move ahead of the West Indies when they face the Dutch in March and April, concluding the series that kicked off the CWCSL cycle before a COVID-19 related postponement. If the Proteas win the final match of the series against England they will clinch their place in the Cricket World Cup. Follow South Africa vs England LIVE Squad: Temba Bavuma (c), Quinton de Kock, Heinrich Klaasen, Rassie van der Dussen, Keshav Maharaj, Reeza Hendricks, Marco Jansen, Sisanda Magala, Janneman Malan, Aiden Markram, David Miller, Lungi Ngidi, Anrich Nortje, Wayne Parnell, Kagiso Rabada, Tabraiz Shamsi. England ODI Squad: Jos Buttler (c), Moeen Ali, Jofra Archer, Harry Brook, Sam Curran, Ben Duckett, Dawid Malan, Adil Rashid, Jason Roy, Phil Salt, Olly Stone, Reece Topley, David Willey, Chris Woakes. Betway ODI Series South Africa vs England Friday, 27 January – 13:00 South Africa beat England by 27 runs – Mangaung Oval, Bloemfontein Sunday, 29 January – 10:00 South Africa beat England by five wickets – Mangaung Oval, Bloemfontein Wednesday, 01 February – 13:00 South Africa vs England – The Oval, Kimberley CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-01 06:44:31","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IND vs AUS: भारतीय टीम को झटका, पहले 2 टेस्ट से बाहर हुआ यह खिलाड़ी, सूर्यकुमार यादव को मिल सकता है डेब्यू का मौका","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-border-gavaskar-trophy-shreyas-iyer-ruled-out-of-first-test-suryakumar-yadav-likely-to-make-debut-3742168#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs Australia: ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज का आगाज 9 फरवरी से होना है. टेस्ट सीरीज से पहले भारतीय टीम के लिए बुरी खबर है. रिपोर्ट की मानें तो श्रेयस अय्यर (Shreyas Iyer) पहले 2 टेस्ट मैच से बाहर रहेंगे.","content":"IND vs AUS Test: भारत और ऑस्ट्रेलिया: पहले 2 टेस्ट से बाहर हुए श्रेयस अय्यर India vs Australia: ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज का आगाज 9 फरवरी से होना है. टेस्ट सीरीज से पहले भारतीय टीम के लिए बुरी खबर है. रिपोर्ट की मानें तो श्रेयस अय्यर (Shreyas Iyer) पहले 2 टेस्ट मैच से बाहर रहेंगे. दरअसल, कमर की चोट के कारण अय्यर न्यूजीलैंड के खिलाफ सीरीज भी नहीं खेल पाए थे, वहीं, खबर ये है कि अय्यर अभी पूरी तरह से फिट नहीं हैं. यही कारण है कि पहले 2 टेस्ट मैच का हिस्सा यह भारतीय क्रिकेटर नहीं बन पाएगा. अय्यर की गौरमौजूदगी में सूर्यकुमार यादव का टेस्ट मैच में खेलना पक्का नजर आ रहा है. यानि ऑस्ट्रेलिया के खिलाफ पहले टेस्ट मैच में सूर्यकुमार डेब्यू कर सकते हैं. आगामी बॉर्डर-गावस्कर सीरीज भारत के लिए बेहद महत्वपूर्ण होने वाली है, क्योंकि वे विश्व टेस्ट चैंपियनशिप (WTC) फाइनल के लिए क्वालीफाई करने के लिए हर हाल में टेस्ट सीरीज को जीतना होगा. रोहित शर्मा एंड कंपनी इस समय WTC स्टैंडिंग में दूसरे स्थान पर काबिज हैं. इसके अलावा यह टेस्ट सीरीज विराट कोहली, रोहित शर्मा जैसे खिलाड़ियों के लिए काफी अहम है. वहीं, भारत और ऑस्ट्रेलिया के बीच पहला टेस्ट मैच 9 से 13 फरवरी के बीच नागपुर में खेला जाएगा. सीरीज में 4 टेस्ट मैच होने हैं. पहला टेस्ट, नागपुर में - 9-13 फरवरी (विदर्भ क्रिकेट एसोसिएशन स्टेडियम) दूसरा टेस्ट, दिल्ली में - 17-21 फरवरी (अरुण जेटली स्टेडियम) तीसरा टेस्ट धर्मशाला में - 1-5 मार्च (हिमाचल प्रदेश क्रिकेट एसोसिएशन स्टेडियम) चौथा टेस्ट, अहमदाबाद में - 9-13 मार्च (नरेंद्र मोदी स्टेडियम) : रोहित शर्मा (c), केएल राहुल (vc), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, , केएस भरत (wk), इशान किशन (wk), रविचंद्रन अश्विन, अक्षर पटेल, कुलदीप यादव, रवींद्र जडेजा, मोहम्मद शमी, मोहम्मद सिराज, उमेश यादव, जयदेव उनादकट, सूर्यकुमार यादव पैट कमिंस (कप्तान), एश्टन एगर, स्कॉट बोलैंड, एलेक्स केरी, कैमरून ग्रीन, पीटर हैंड्सकॉम्ब, जोश हेजलवुड, ट्रेविस हेड, उस्मान ख्वाजा, मारनस लबसचगने, नाथन लियोन, लांस मॉरिस, टॉड मर्फी, मैथ्यू रेनशॉ, स्टीव स्मिथ, मिचेल स्टार्क, मिचेल स्वेपसन, डेविड वॉर्नर पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 06:39:41","image_url":"https://c.ndtvimg.com/2022-10/dfr5ian8_suryakumar-yadav-sarfaraz-khan-twitter_625x300_02_October_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs NZ 3rd T20: वसीम जाफऱ ने बताया, तीसरे टी-20 में किसकी जगह पर खेल सकते हैं पृथ्वी शॉ","link":"https://sports.ndtv.com/hindi/cricket/india-vs-new-zealand-wasim-jaffer-wants-hardik-pandya-to-retain-yuzvendra-chahal-for-ahmedabad-t20i-also-chance-for-prithvi-shaw-3742130#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ T20I: न्यूजीलैंड के खिलाफ टी-20 सीरीज में भारतीय युवा खिलाड़ी जैसे शुभमन गिल और ईशान किशन अबतक असफल रहे हैं. जिनके फॉर्म को लेकर काफी बातें हो रही है.","content":"Prithvi Shaw: तीसरेटी-20 में एक बदलाव संभव न्यूजीलैंड के खिलाफ टी-20 सीरीज में भारतीय युवा खिलाड़ी जैसे शुभमन गिल और ईशान किशन अबतक असफल रहे हैं. जिनके फॉर्म को लेकर काफी बातें हो रही है. वहीं, भारत के पूर्व क्रिकेटर वसीम जाफर (Wasim Jaffer) ने तीसरे टी-20 मैच से पहले युवा खिलाड़ियों को लेकर अपनी राय दी है और कहा कि अभी भी इन युवा खिलाड़ियों को काफी कुछ सीखने की जरूरत है. के साथ बात करते हुए वसीम ने तीसरे टी-20 से पहले कुछ अहम मुद्दे पर बात की, खासकर भारतीय बल्लेबाजी पर अपनी राय दी. वसीम ने कहा 'जिस तरह की पिच पर बल्लेबाजों ने बैटिंग की, इसलिए यहां मैच आलोचना नहीं करना चाहूंगा. यकीनन अभी भी युवा क्रिकेटरों को काफी कुछ सीखना है लेकिन बल्लेबाजों ने जिस अंदाज में स्पीन वाली पिच पर जान लगाकर बैटिंग की है, वह यह दर्शाता है कि हम संधर्ष भी कर सकते हैं. अभी मैं ज्यादा आलोचना तो नहीं करूंगा लेकिन हां युवा बैटरों को पिच पर सिंगल लेने को लेकर ज्यादा से ज्यादा सोचना होगा.' वसीम ने आगे ये भी कहा कि अहमदाबाद में पिच अच्छी मिलेगी, ऐसे में उम्मीद है कि भारतीय बल्लेबाजों को अच्छी बल्लेबाजी करने मिलेगी. पूर्व भारतीय क्रिकेटर ने युजवेंद्र चहल को भारतीय इलेवन में शामिल किए जाने की वकालत की है और कहा, 'मुझे लगता है कि यदि हमारे पास कलाई वाले स्पिनर हैं तो उसका उपयोग करना चाहिए. वहीं, उमरान को लेकर मेरा मानना है कि वो इस फॉर्मेट में संघर्ष कर रहे हैं, इस फॉर्मेट में जिस तरह की विविधता चाहिए वो अभी कर नहीं पा रहे हैं. ऐसे में मुझे लगता है कि चहल एक सही विकल्प हैं उनकी जगह.' वहीं, प्लेइंग इलेवन में बदलाव को लेकर वसीम ने कहा कि, यदि बदलाव की देखें तो शुभमन गिल की जगह पृथ्वी को शामिल किया जाना चाहिए, शॉ इस समय शानदार फॉर्म में हैं और वो इस फॉर्मेट में अच्छा कर भी रहे हैं. वहीं, जाफर ने कहा कि यदि गिल भी खेलते हैं तो मुझे इससे कोई फर्क नहीं पड़ेगा. बता दें कि आज तीसरा टी20 मैच खेला जाएगा. पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 06:21:29","image_url":"https://c.ndtvimg.com/2023-01/jjs37348_prithvi-shaw-806_625x300_27_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Video: माही मार रहा है...आईपीएल 2023 से पहले दिखा एमएस धोनी का पुराना अवतार, जमकर लगाए चौके-छक्के","link":"https://www.abplive.com/sports/cricket/ms-dhoni-starts-preparation-for-ipl-2023-video-viral-in-social-media-dhoni-net-practice-2322866","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"MS Dhoni Practice Video, IPL 2023: इंडियन प्रीमियर लीग 2023 के सीजन की शुरुआत मार्च अंत या फिर अप्रैल महीने की शुरुआत में हो सकती है. इसको लेकर अभी से सभी फ्रेंचाइजियों के खिलाड़ियों ने भले ही अभ्यास करना ना शुरू किया हो, लेकिन चेन्नई सुपर किंग्स टीम के कप्तान महेंद्र सिंह धोनी ने तैयारी करना शुरू कर दिया है. महेंद्र सिंह धोनी का नेट्स पर अभ्यास करते हुए एक वीडियो सोशल मीडिया पर जमकर वायरल हो रहा है. इस वीडियो में धोनी नेट्स पर लंबे-लंबे छक्के लगाते हुए देखे जा सकते हैं. धोनी स्पिन गेंदबाजों के खिलाफ आक्रामक अंदाज में खेलते हुए दिखाई दिए. इससे साफ पता चलता है कि वह आगामी आईपीएल के सीजन से पहले खुद को पूरी तरह से लय में वापस लाना चाहते हैं. साल 2020 में अंतरराष्ट्रीय क्रिकेट से संन्यास लेने के बाद से धोनी सिर्फ आईपीएल में ही अब तक खेलते हुए दिखाई दिए हैं. पिछले आईपीएल सीजन के शुरू होने से पहले धोनी ने जडेजा को चेन्नई सुपर किंग्स की कप्तानी सौंप दी थी, लेकिन टीम के प्रदर्शन को देखते हुए उन्हें वापस बीच सीजन में कप्तानी की जिम्मेदारी को फिर से संभालना पड़ा था. https://twitter.com/msdfansofficial/status/1620066902004609029 यह धोनी का आखिरी आईपीएल सीजन हो सकता है पिछले सीजन में जब धोनी ने रवींद्र जडेजा को टीम की कप्तानी सौंपी थी तो उस समय सभी को लगा कि यह धोनी का आखिरी सीजन होगा. हालांकि धोनी ने अपने बयान में यह साफ कर दिया था कि वह अपना आखिरी आईपीएल मैच चेन्नई सुपर किंग्स के होम ग्राउंड एम.ए चिदंबरम स्टेडियम में खेलेंगे. बता दें कि पिछले आईपीएल सीजन में धोनी ने 14 मैचों में 33.14 के औसत से कुल 232 रन बनाए थे जिसमें एक अर्धशतकीय पारी भी शामिल थी. हाल में धोनी भारत और न्यूजीलैंड के बीच रांची में खेले गए पहले टी20 मुकाबले को देखने भी पहुंचे थे वहीं उन्होंने भारत और कीवी टीम के खिलाड़ियों के साथ भी समय बिताया था। ये भी पढ़े... IND vs AUS: ऑस्ट्रेलिया को लगा बड़ा झटका, भारत के खिलाफ पहले टेस्ट में नहीं खेलेंगे मिचेल स्टार्क","content":"MS Dhoni Practice Video, IPL 2023: इंडियन प्रीमियर लीग 2023 के सीजन की शुरुआत मार्च अंत या फिर अप्रैल महीने की शुरुआत में हो सकती है. इसको लेकर अभी से सभी फ्रेंचाइजियों के खिलाड़ियों ने भले ही अभ्यास करना ना शुरू किया हो, लेकिन चेन्नई सुपर किंग्स टीम के कप्तान महेंद्र सिंह धोनी ने तैयारी करना शुरू कर दिया है. महेंद्र सिंह धोनी का नेट्स पर अभ्यास करते हुए एक वीडियो सोशल मीडिया पर जमकर वायरल हो रहा है. इस वीडियो में धोनी नेट्स पर लंबे-लंबे छक्के लगाते हुए देखे जा सकते हैं. धोनी स्पिन गेंदबाजों के खिलाफ आक्रामक अंदाज में खेलते हुए दिखाई दिए. इससे साफ पता चलता है कि वह आगामी आईपीएल के सीजन से पहले खुद को पूरी तरह से लय में वापस लाना चाहते हैं. साल 2020 में अंतरराष्ट्रीय क्रिकेट से संन्यास लेने के बाद से धोनी सिर्फ आईपीएल में ही अब तक खेलते हुए दिखाई दिए हैं. पिछले आईपीएल सीजन के शुरू होने से पहले धोनी ने जडेजा को चेन्नई सुपर किंग्स की कप्तानी सौंप दी थी, लेकिन टीम के प्रदर्शन को देखते हुए उन्हें वापस बीच सीजन में कप्तानी की जिम्मेदारी को फिर से संभालना पड़ा था. https://twitter.com/msdfansofficial/status/1620066902004609029 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); यह धोनी का आखिरी आईपीएल सीजन हो सकता है पिछले सीजन में जब धोनी ने रवींद्र जडेजा को टीम की कप्तानी सौंपी थी तो उस समय सभी को लगा कि यह धोनी का आखिरी सीजन होगा. हालांकि धोनी ने अपने बयान में यह साफ कर दिया था कि वह अपना आखिरी आईपीएल मैच चेन्नई सुपर किंग्स के होम ग्राउंड एम.ए चिदंबरम स्टेडियम में खेलेंगे. बता दें कि पिछले आईपीएल सीजन में धोनी ने 14 मैचों में 33.14 के औसत से कुल 232 रन बनाए थे जिसमें एक अर्धशतकीय पारी भी शामिल थी. हाल में धोनी भारत और न्यूजीलैंड के बीच रांची में खेले गए पहले टी20 मुकाबले को देखने भी पहुंचे थे वहीं उन्होंने भारत और कीवी टीम के खिलाड़ियों के साथ भी समय बिताया था। ये भी पढ़े... IND vs AUS: ऑस्ट्रेलिया को लगा बड़ा झटका, भारत के खिलाफ पहले टेस्ट में नहीं खेलेंगे मिचेल स्टार्क","pubDate":"2023-02-01 06:17:04","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/60fb377da9b85b60b982f963f4396ad81675231569989582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"SA vs ENG: सैम कर्रन ने विकेट लेने के बाद मनाया ऐसा जश्न, ICC ने ठोका जुर्माना, ये सज़ा भी मिली!","link":"https://www.abplive.com/sports/cricket/england-all-rounder-sam-curran-fined-match-fee-and-gets-demerit-point-on-excessive-celebration-of-temba-bavuma-wicket-eng-vs-sa-2322837","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Sam Curran Demerit Points: इंग्लैंड के ऑलराउंडर सैम कर्रन (Sam Curran) पर ICC ने मैच फीस का 15 फीसदी जुर्माना लगाया है. साथ ही उन्हें एक डिमैरिट पॉइंट भी दिया गया है. दक्षिण अफ्रीका के खिलाफ टेंबा बावुमा का विकेट मिलने के बाद मनाए गए जश्न के कारण सैम कर्रन पर यह एक्शन लिया गया है. इंग्लैंड और दक्षिण अफ्रीका (ENG vs SA) के बीच रविवार को खेले गए दूसरे मुकाबले में सैम कर्रन ने टेंबा बावुमा (Temba Bavuma) का अहम विकेट लिया था. बावुमा ने 102 गेंद पर 109 रन की पारी खेली थी. इस विकेट के मिलने की खुशी में सैम कर्रन पिच पर दौड़ते हुए बावुमा के काफी करीब तक जा पहुंचे थे. यहां सैम कर्रन ने ICC की आचार संहिता का लेवल-1 अफेंस किया था. इसके मुताबिक उन खिलाड़ियों पर एक्शन लिया जाता है जो बल्लेबाज के आउट होने के बाद जरूरत से ज्यादा सेलिब्रेट करते हैं और उसके बेहद नजदीक तक पहुंचते हुए ऐसी एक्शन करते हैं जो बल्लेबाज को जवाब देने के लिए उग्र करे. अगर एक खिलाड़ी को 24 महीने के पीरियड के दौरान चार या इससे ज्यादा डिमैरिट पॉइंट मिलते हैं तो उस पर कुछ समय के लिए बैन लगा दिया जाता है. वैसे सैम कर्रन का इस पीरियड में पहला डिमैरिट पॉइंट है. सीरीज में 2-0 की अजेय बढ़त बना चुकी है दक्षिण अफ्रीका इंग्लैंड और दक्षिण अफ्रीका के बीच तीन मैचों की वनडे सीरीज के शुरुआती दोनों मुकाबले प्रोटियाज के नाम रहे हैं. पहले मैच में दक्षिण अफ्रीका ने इंग्लैंड को 27 रन से हराया था. वहीं, दूसरे मुकाबले में दक्षिण अफ्रीका ने 5 गेंद बाकी रहते 5 विकेट से जीत दर्ज की थी. अब इंग्लैंड के ऊपर इस सीरीज में क्लीन स्वीप का खतरा मंडरा रहा है. यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","content":"Sam Curran Demerit Points: इंग्लैंड के ऑलराउंडर सैम कर्रन (Sam Curran) पर ICC ने मैच फीस का 15 फीसदी जुर्माना लगाया है. साथ ही उन्हें एक डिमैरिट पॉइंट भी दिया गया है. दक्षिण अफ्रीका के खिलाफ टेंबा बावुमा का विकेट मिलने के बाद मनाए गए जश्न के कारण सैम कर्रन पर यह एक्शन लिया गया है. इंग्लैंड और दक्षिण अफ्रीका (ENG vs SA) के बीच रविवार को खेले गए दूसरे मुकाबले में सैम कर्रन ने टेंबा बावुमा (Temba Bavuma) का अहम विकेट लिया था. बावुमा ने 102 गेंद पर 109 रन की पारी खेली थी. इस विकेट के मिलने की खुशी में सैम कर्रन पिच पर दौड़ते हुए बावुमा के काफी करीब तक जा पहुंचे थे. यहां सैम कर्रन ने ICC की आचार संहिता का लेवल-1 अफेंस किया था. इसके मुताबिक उन खिलाड़ियों पर एक्शन लिया जाता है जो बल्लेबाज के आउट होने के बाद जरूरत से ज्यादा सेलिब्रेट करते हैं और उसके बेहद नजदीक तक पहुंचते हुए ऐसी एक्शन करते हैं जो बल्लेबाज को जवाब देने के लिए उग्र करे. अगर एक खिलाड़ी को 24 महीने के पीरियड के दौरान चार या इससे ज्यादा डिमैरिट पॉइंट मिलते हैं तो उस पर कुछ समय के लिए बैन लगा दिया जाता है. वैसे सैम कर्रन का इस पीरियड में पहला डिमैरिट पॉइंट है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); सीरीज में 2-0 की अजेय बढ़त बना चुकी है दक्षिण अफ्रीका इंग्लैंड और दक्षिण अफ्रीका के बीच तीन मैचों की वनडे सीरीज के शुरुआती दोनों मुकाबले प्रोटियाज के नाम रहे हैं. पहले मैच में दक्षिण अफ्रीका ने इंग्लैंड को 27 रन से हराया था. वहीं, दूसरे मुकाबले में दक्षिण अफ्रीका ने 5 गेंद बाकी रहते 5 विकेट से जीत दर्ज की थी. अब इंग्लैंड के ऊपर इस सीरीज में क्लीन स्वीप का खतरा मंडरा रहा है. यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","pubDate":"2023-02-01 05:58:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/f40bee8693096f7693768a751723f2f81675229644759300_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sam Curran fined for 'excessive celebration' of Temba Bavuma dismissal","link":"https://www.iol.co.za/sport/cricket/international/sam-curran-fined-for-excessive-celebration-of-temba-bavuma-dismissal-b0181271-083d-4b22-8d9a-130c52332ed7","keywords":null,"creator":["AFP"],"video_url":null,"description":"England all-rounder Sam Curran has been fined 15 percent of his match fee and handed a demerit point for ‘excessively celebrating’ his dismissal of Proteas captain Temba Bavuma.","content":"Kimberly - England all-rounder Sam Curran has been fined 15 percent of his match fee and handed a demerit point for \"excessively celebrating\" his dismissal of South African captain Temba Bavuma in the second one-day international on Sunday. The penalty was announced by the International Cricket Council on Tuesday. The teams meet in the third and final match of the World Cup Super League series in Kimberley on Wednesday. Bavuma made 109 as South Africa took a decisive 2-0 series lead in Bloemfontein before scooping a ball from Curran into his stumps. Curran ran down the pitch and got close to Bavuma as he celebrated the wicket. Match referee Jeff Crowe of New Zealand fined Curran following a report by the umpires. Curran admitted the offence and there was no need for a formal hearing. ALSO READ: Temba Bavuma maintained his dignity despite keyboard warriors’ prejudice According to the ICC, Curran was found to have committed a level one offence of the ICC code of conduct when he \"excessively celebrated towards and in close proximity to the dismissed batter, being an action which had the potential to provoke an aggressive reaction from Bavuma\". If a player accumulates four or more demerit points within a 24-month period he faces a ban. It was Curran's first offence within the time period. cb/imm © Agence France-Presse Share","pubDate":"2023-02-01 05:56:47","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/68ba1a53-c5fd-5ab0-ae8c-35b207e0e273&operation=CROP&offset=0x136&resize=3200x1799","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"'मैं भारतीय Visa का इंतजार कर रहा', उस्मान ख्वाजा के साथ हो गई गुगली, Memes शेयर कर बयां किया दर्द..","link":"https://sports.ndtv.com/hindi/cricket/usman-khawaja-missed-the-teams-flight-to-india-due-to-a-visa-delay-3741903#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS test Series: ऑस्ट्रेलियाई क्रिकेटर उस्मान ख्वाजा (Usman Khawaja) के साथ बहुत बड़ी गुगली हो गई है. दरअसल, भारत दौरे के लिए ऑस्ट्रेलियाई टीम अपने देश से भारत आने के लिए निकल पड़ी है लेकिन क्रिकेटर उस्मान ख्वाजा को भारत का वीजा (VISA) समय रहते नहीं मिल पाया जिसके कारण भारत आने वाली फ्लाइट पर ऑस्ट्रेलियाई क्रिकेटर चढ़ नहीं पाए हैं","content":"उस्मान ख्वाजा ने की भारत आने वाली फ्लाइट मिस, जानिए कारण IND vs AUS test Series: ऑस्ट्रेलियाई क्रिकेटर के साथ बहुत बड़ी गुगली हो गई है. दरअसल, भारत दौरे के लिए ऑस्ट्रेलियाई टीम अपने देश से भारत आने के लिए निकल पड़ी है लेकिन क्रिकेटर उस्मान ख्वाजा को भारत का वीजा (VISA) समय रहते नहीं मिल पाया जिसके कारण भारत आने वाली फ्लाइट पर चढ़ नहीं पाए हैं. ख्वाजा ने सोशल मीडिया पर Memes शेयर कर इस बात की जानकारी साझा की है. उस्मानने मजाकिया तस्वीर शेयर कर लिखा है 'मैं भारतीय Visa का इंतजार कर रहा हूं..' बता दें कि भारत और ऑस्ट्रेलिया के बीच सीरीज का पहला मैच 9 फरवरी को नागपुर में खेला जाएगा. 1 फरवरी को ऑस्ट्रेलियाई टीम भारत आने वाली है. वैसे, फैन्स को बता दें कि क्रिकेट ऑस्ट्रेलिया की ओर से बताया गया है कि कि उम्मीद है कि ख्वाजा का वीजा क्लीयर हो जाएगा और वह गुरुवार को भारत के लिए उड़ान भरेंगे. ख्वाजा ऑस्ट्रेलियाई टीम के सबसे अहम खिलाड़ियों में से एक हैं. पहला टेस्ट, नागपुर में - 9-13 फरवरी (विदर्भ क्रिकेट एसोसिएशन स्टेडियम) दूसरा टेस्ट, दिल्ली में - 17-21 फरवरी (अरुण जेटली स्टेडियम) तीसरा टेस्ट धर्मशाला में - 1-5 मार्च (हिमाचल प्रदेश क्रिकेट एसोसिएशन स्टेडियम) चौथा टेस्ट, अहमदाबाद में - 9-13 मार्च (नरेंद्र मोदी स्टेडियम) : रोहित शर्मा (c), केएल राहुल (vc), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, श्रेयस अय्यर, केएस भरत (wk), इशान किशन (wk), रविचंद्रन अश्विन, अक्षर पटेल, कुलदीप यादव, रवींद्र जडेजा, मोहम्मद शमी, मोहम्मद सिराज, उमेश यादव, जयदेव उनादकट, सूर्यकुमार यादव : पैट कमिंस (कप्तान), एश्टन एगर, स्कॉट बोलैंड, एलेक्स केरी, कैमरून ग्रीन, पीटर हैंड्सकॉम्ब, जोश हेजलवुड, ट्रेविस हेड, उस्मान ख्वाजा, मारनस लबसचगने, नाथन लियोन, लांस मॉरिस, टॉड मर्फी, मैथ्यू रेनशॉ, स्टीव स्मिथ, मिचेल स्टार्क, मिचेल स्वेपसन, डेविड वॉर्नर पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 05:51:02","image_url":"https://c.ndtvimg.com/2023-01/abgp156g_usman-khawaja-afp_625x300_07_January_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs NZ 3rd T20: ईशान या गिल, किस पर गिरेगी गाज? दो बदलाव के साथ उतर सकती है टीम इंडिया","link":"https://www.abplive.com/sports/cricket/ind-vs-nz-3rd-t20i-indian-team-can-do-these-2-changes-in-the-last-t20i-match-against-newzealand-2322815","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"India vs New Zealand 3rd T20, India Playing XI: भारत और न्यूजीलैंड के बीच खेली जा रही 3 मैचों की टी20 सीरीज का आखिरी मुकाबला अहमदाबाद के नरेंद्र मोदी स्टेडियम में खेला जाएगा. इस मैच को लेकर ऐसी उम्मीद जताई जा रही है कि भारतीय टीम की प्लेइंग इलेवन में बदलाव देखने को मिल सकता है. ओपनिंग में लंबे समय के बाद टीम में वापसी करने वाले पृथ्वी शॉ को मौका दिया जा सकता है. वहीं अहमदाबाद की पिच को ध्यान में रखते हुए प्लेइंग इलेवन में उमरान मलिक की भी वापसी हो सकती है, जिनको युजवेंद्र चहल की जगह पर टीम में शामिल किया जा सकता है. निर्णायक मुकाबले को देखते हुए भारतीय टीम की प्लेइंग इलेवन में दो बदलाव देखने को मिल सकते हैं. अभी तक इस टी20 सीरीज में भारतीय ओपनिंग बल्लेबाजों ने उम्मीद के अनुसार शुरुआत नहीं दी है. शुभमन गिल का न्यूजीलैंड के खिलाफ वनडे सीरीज में शानदार फॉर्म देखने को मिला था, लेकिन टी20 सीरीज में वह अभी तक उस तरह का प्रदर्शन करने में कामयाब नहीं हो सके हैं. गिल ने अब तक इस सीरीज में 11 और 7 रन की पारियां खेली हैं. शुरुआती ओवरों में तेजी से रन बनाने की क्षमता रखते हैं पृथ्वी शॉ भले ही पृथ्वी शॉ को अभी तक 1 ही टी20 अंतरराष्ट्रीय मुकाबला खेलने का मौका मिला है, लेकिन घरेलू क्रिकेट और आईपीएल में उनका प्रदर्शन शानदार देखने को मिला है. पृथ्वी शॉ शुरुआती ओवरों में तेजी के साथ रन बनाते हैं, जिससे विपक्षी टीम के लिए मैच में वापसी करना मुश्किल भरा हो जाता है. गेंदबाजी में बदलाव को लेकर बात की जाए तो लखनऊ में जहां टीम 4 स्पिन गेंदबाजों के साथ मैदान पर उतरी थी. वहीं इस मैच में टीम 3 तेज गेंदबाजों के साथ मैदान पर उतरने का फैसला कर सकती है. ऐसे में युजवेंद्र चहल की जगह पर उमरान मलिक को खेलने का मौका मिल सकता है जो अहमदाबाद की पिच और हालात को देखते हुए टीम के लिए अधिक उपयोगी साबित हो सकते हैं. ये भी पढ़े... Team India Schedule: फरवरी में हर दिन मैदान पर दिखेगी टीम इंडिया! इस महीने का शेड्यूल देख उड़ जाएंगे होश","content":"India vs New Zealand 3rd T20, India Playing XI: भारत और न्यूजीलैंड के बीच खेली जा रही 3 मैचों की टी20 सीरीज का आखिरी मुकाबला अहमदाबाद के नरेंद्र मोदी स्टेडियम में खेला जाएगा. इस मैच को लेकर ऐसी उम्मीद जताई जा रही है कि भारतीय टीम की प्लेइंग इलेवन में बदलाव देखने को मिल सकता है. ओपनिंग में लंबे समय के बाद टीम में वापसी करने वाले पृथ्वी शॉ को मौका दिया जा सकता है. वहीं अहमदाबाद की पिच को ध्यान में रखते हुए प्लेइंग इलेवन में उमरान मलिक की भी वापसी हो सकती है, जिनको युजवेंद्र चहल की जगह पर टीम में शामिल किया जा सकता है. निर्णायक मुकाबले को देखते हुए भारतीय टीम की प्लेइंग इलेवन में दो बदलाव देखने को मिल सकते हैं. अभी तक इस टी20 सीरीज में भारतीय ओपनिंग बल्लेबाजों ने उम्मीद के अनुसार शुरुआत नहीं दी है. शुभमन गिल का न्यूजीलैंड के खिलाफ वनडे सीरीज में शानदार फॉर्म देखने को मिला था, लेकिन टी20 सीरीज में वह अभी तक उस तरह का प्रदर्शन करने में कामयाब नहीं हो सके हैं. गिल ने अब तक इस सीरीज में 11 और 7 रन की पारियां खेली हैं. शुरुआती ओवरों में तेजी से रन बनाने की क्षमता रखते हैं पृथ्वी शॉ googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); भले ही पृथ्वी शॉ को अभी तक 1 ही टी20 अंतरराष्ट्रीय मुकाबला खेलने का मौका मिला है, लेकिन घरेलू क्रिकेट और आईपीएल में उनका प्रदर्शन शानदार देखने को मिला है. पृथ्वी शॉ शुरुआती ओवरों में तेजी के साथ रन बनाते हैं, जिससे विपक्षी टीम के लिए मैच में वापसी करना मुश्किल भरा हो जाता है. गेंदबाजी में बदलाव को लेकर बात की जाए तो लखनऊ में जहां टीम 4 स्पिन गेंदबाजों के साथ मैदान पर उतरी थी. वहीं इस मैच में टीम 3 तेज गेंदबाजों के साथ मैदान पर उतरने का फैसला कर सकती है. ऐसे में युजवेंद्र चहल की जगह पर उमरान मलिक को खेलने का मौका मिल सकता है जो अहमदाबाद की पिच और हालात को देखते हुए टीम के लिए अधिक उपयोगी साबित हो सकते हैं. ये भी पढ़े... Team India Schedule: फरवरी में हर दिन मैदान पर दिखेगी टीम इंडिया! इस महीने का शेड्यूल देख उड़ जाएंगे होश","pubDate":"2023-02-01 05:36:28","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/95f3b66ef658968c7f185dc697b31aa11675227845888582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | Ice-man Miller believes Jansen can become his spiritual Proteas successor: 'He has the gift'","link":"https://www.news24.com/sport/Cricket/Proteas/ice-man-miller-believes-jansen-can-become-his-spiritual-proteas-successor-he-has-the-gift-20230201","keywords":null,"creator":null,"video_url":null,"description":"David Miller has little doubt Marco Jansen can add to his ever-expanding cricketing repertoire by eventually becoming the type of \"finisher\" he already is with the bat for the Proteas.","content":"In Kimberley David Miller has little doubt Marco Jansen can add to his ever-expanding cricketing repertoire by eventually becoming the type of \"finisher\" he already is with the bat for the Proteas. READ | Dane van Niekerk's shocking T20 World Cup omission explained: 'We're testing everyone fairly' The lanky 22-year-old, named the ICC's emerging world player of the year last week predominantly for his bowling exploits, has recently started to showcase the batting ability he's regularly touted. Jansen lit up the SA20 with a 27-ball 66 for Sunrisers Eastern Cape against MI Cape Town before playing a crucial if at times imperfect role in South Africa's momentous, series-clinching chase against England in Bloemfontein last Sunday. His unbeaten 32 off 29 deliveries mixed fine power-hitting and excellent placement with some nervy over-exuberance though he had the immense benefit of the ice-cool Miller by his side. \"It's the first time I batted with him. It was really nice just to get that bond together because we've got on well off the field,\" said the Proteas stalwart ahead of Wednesday's third and final ODI here. \"Marco's got a lot to offer, he's still very young and a great talent with bat and ball. It was just nice to be there with him, chatting him through a few scenarios. \"When the pressure is on like that, for him to come through the way he did was just really pleasing to see. Hopefully we get a lot more partnerships together in future.\" Miller also believes the hitches during that innings made him more aware of the ever-changing complexion of matches in the helter skelter of the final moments. \"Marco definitely benefitted from [the fluidity of the situation in Bloemfontein]. He's got long levers, he's like 5 metres tall. Those long arms obviously help him swing the bat with immense power, making him hit the ball very cleanly. Anyone that can do that has an advantage over the opposition already,\" he said. \"For Marco, it's just about trying to work out a game plan as time goes on in international cricket. He's a huge talent and has a lot going for him. As he keeps playing and gaining experience all of things will fall into place. \"He definitely has the gift. It's a great plus.\" Meanwhile, Miller is also excited what the future holds for Bavuma, whose third ODI century at the weekend suggests his form is up to scratch again. \"That was one of the most exciting innings I've seen,\" he said. \"Not necessarily because Temba scored a hundred, but because of the way he did it. He batted phenomenally well. \"He put the pressure on the bowlers from the word go and kept that tempo so it was a match-winning knock. Temba's been working really hard on his game and his innings was just outstanding. The maturity he batted with was so good to see and I'm very chuffed for him. \"He would have taken great learnings out of that and I think he showed everyone and himself that he can score at a very healthy run-rate with just normal cricket shots.\" First ball at the Oval in Kimberley is at 13:00 on Wednesday.","pubDate":"2023-02-01 08:18:16","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Ajinkya Rahane: पुजारा की राह पर रहाणे, काउंटी खेलकर तलाशेंगे फॉर्म; लिसेस्टरशायर की ओर से दिखाएंगे दम","link":"https://www.abplive.com/sports/cricket/ajinkya-rahane-to-play-in-county-cricket-for-leicestershire-season-2023-2322914","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Ajinkya Rahane Follows Cheteshwar Pujara: पिछले एक साल से टीम इंडिया से बाहर चल रहे अंजिक्य रहाणे (Ajinkya Rahane) अब चेतेश्वर पुजारा (Cheteshwar Pujara) की राह पर चलने जा रहे हैं. वह काउंटी क्रिकेट खेलकर अपनी फॉर्म को खोजने की कोशिश करेंगे. उन्होंने लिसेस्टरशायर (Leicestershire) के साथ करार किया है. वह इस साल इंग्लिश समर में काउंटी चैंपियनशिप के 8 मुकाबले खेलने के लिए उपलब्ध रहेंगे. वह वनडे टूर्नामेंट के लिए भी पूरे वक्त लिसेस्टरशायर के लिए मौजूद रहेंगे. गौरतलब है कि पिछले साल जनवरी में दक्षिण अफ्रीका टेस्ट सीरीज के बाद अजिंक्य रहाणे और चेतेश्वर पुजारा को टीम से बाहर कर दिया गया था. इसके बाद पुजारा ने काउंटी क्रिकेट में खेलकर अपनी लय हासिल की थी. उन्होंने बैक टू बैक शतक जड़े थे. इसके बाद पुजारा को फिर से टेस्ट टीम में जगह मिल गई थी. दूसरी ओर रहाणे अब तक अपनी लय हासिल नहीं कर सके हैं. अजिंक्या रहाणे जून 2023 में यानी IPL के ठीक बाद लिसेस्टरशायर की स्क्वाड का जॉइन करेंगे. पूरे चार साल बाद वह काउंटी क्रिकेट खेलेंगे. इससे पहले वह साल 2019 में हैम्पशायर की ओर से काउंटी क्रिकेट खेले थे. रणजी ट्रॉफी में दिए फॉर्म में लौटने के संकेतटेस्ट टीम से बाहर होने के बाद अजिंक्य रहाणे ने रणजी ट्रॉफी के पिछले सीजन में खेलकर फॉर्म खोजने की कोशिश की थी लेकिन वह कुछ खास नहीं कर पाए थे. हालांकि इस सीजन में उन्होंने लय में लौटने के संकेत दिए. इस सीजन रहाणे ने 7 मैचों में 57.63 की औसत से 634 रन जड़े. इस दौरान उन्होंने एक दोहरा शतक भी जड़ा. काउंटी क्रिकेट खेलने के फैसले पर क्या बोले रहाणे?रहाणे ने कहा है, 'मैं आगामी सीजन में लिसेस्टरशायर को जॉइन कर बहुत खुश हूं. मैं अपने नए साथी खिलाड़ियों के साथ क्रिकेट खेलने और लिसेस्टर शहर में घूमने का बेसब्री से इंतजार कर रहा हूं.' वहीं लिसेस्टरशायर क्लब के क्लाउडी हेंडरसन का कहना है, 'मैं लिसेस्टरशायर में अजिंक्य का स्वागत करने के लिए उत्साहित हूं. उनके पास क्रिकेट का बहुत अनुभव है और उनके मेहनत करने की लगन भी लाजवाब है. उन्हें अपनी स्क्वाड में शामिल करने का मौका हमारे लिए बहुत अच्छी बात रही है.' यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","content":"Ajinkya Rahane Follows Cheteshwar Pujara: पिछले एक साल से टीम इंडिया से बाहर चल रहे अंजिक्य रहाणे (Ajinkya Rahane) अब चेतेश्वर पुजारा (Cheteshwar Pujara) की राह पर चलने जा रहे हैं. वह काउंटी क्रिकेट खेलकर अपनी फॉर्म को खोजने की कोशिश करेंगे. उन्होंने लिसेस्टरशायर (Leicestershire) के साथ करार किया है. वह इस साल इंग्लिश समर में काउंटी चैंपियनशिप के 8 मुकाबले खेलने के लिए उपलब्ध रहेंगे. वह वनडे टूर्नामेंट के लिए भी पूरे वक्त लिसेस्टरशायर के लिए मौजूद रहेंगे. गौरतलब है कि पिछले साल जनवरी में दक्षिण अफ्रीका टेस्ट सीरीज के बाद अजिंक्य रहाणे और चेतेश्वर पुजारा को टीम से बाहर कर दिया गया था. इसके बाद पुजारा ने काउंटी क्रिकेट में खेलकर अपनी लय हासिल की थी. उन्होंने बैक टू बैक शतक जड़े थे. इसके बाद पुजारा को फिर से टेस्ट टीम में जगह मिल गई थी. दूसरी ओर रहाणे अब तक अपनी लय हासिल नहीं कर सके हैं. अजिंक्या रहाणे जून 2023 में यानी IPL के ठीक बाद लिसेस्टरशायर की स्क्वाड का जॉइन करेंगे. पूरे चार साल बाद वह काउंटी क्रिकेट खेलेंगे. इससे पहले वह साल 2019 में हैम्पशायर की ओर से काउंटी क्रिकेट खेले थे. रणजी ट्रॉफी में दिए फॉर्म में लौटने के संकेत टेस्ट टीम से बाहर होने के बाद अजिंक्य रहाणे ने रणजी ट्रॉफी के पिछले सीजन में खेलकर फॉर्म खोजने की कोशिश की थी लेकिन वह कुछ खास नहीं कर पाए थे. हालांकि इस सीजन में उन्होंने लय में लौटने के संकेत दिए. इस सीजन रहाणे ने 7 मैचों में 57.63 की औसत से 634 रन जड़े. इस दौरान उन्होंने एक दोहरा शतक भी जड़ा. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); काउंटी क्रिकेट खेलने के फैसले पर क्या बोले रहाणे? रहाणे ने कहा है, 'मैं आगामी सीजन में लिसेस्टरशायर को जॉइन कर बहुत खुश हूं. मैं अपने नए साथी खिलाड़ियों के साथ क्रिकेट खेलने और लिसेस्टर शहर में घूमने का बेसब्री से इंतजार कर रहा हूं.' वहीं लिसेस्टरशायर क्लब के क्लाउडी हेंडरसन का कहना है, 'मैं लिसेस्टरशायर में अजिंक्य का स्वागत करने के लिए उत्साहित हूं. उनके पास क्रिकेट का बहुत अनुभव है और उनके मेहनत करने की लगन भी लाजवाब है. उन्हें अपनी स्क्वाड में शामिल करने का मौका हमारे लिए बहुत अच्छी बात रही है.' यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","pubDate":"2023-02-01 06:59:49","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/4c643d0a7d8c2f63b9001762cdbb36c21675234518758300_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"South Africa vs England: Third ODI LIVE scores","link":"https://www.thesouthafrican.com/sport/cricket/proteas/south-africa-vs-england-third-odi-breaking-live-scores-wednesday-1-february-2023/","keywords":["Proteas","Featured","Important","Live updates","Proteas v England","South Africa"],"creator":["James Richardson"],"video_url":null,"description":"South Africa vs England: The Proteas have upstaged the tourists so far and signs of frustration have shown in their camp.","content":"South Africa vs England: The Proteas have upstaged the tourists so far and signs of frustration have shown in their camp. ALSO READ: England bowler Curran punished for ‘disrespectful’ celebration South Africa chasing CWC place While the series is won, South Africa still have the matter of hauling in the West Indies on the Cricket World Cup Super League to attend to. Winning the third ODI of this series will move South Africa into eighth place on the league to occupy the final Cricket World Cup qualifying spot. The five teams who miss out on a spot in the top eight will enter a qualifier tournament including lower ranked associate teams reaching the tournament through a separate qualification stream. WATCH: ENGLAND CAPTAIN CLASHES WITH PROTEAS STAR South Africa will have two further opportunities to move ahead of the West Indies when they face the Dutch in March and April, concluding the series that kicked off the CWCSL cycle before a COVID-19 related postponement. If the Proteas win the final match of the series against England they will clinch their place in the Cricket World Cup. Follow South Africa vs England LIVE Squad: Temba Bavuma (c), Quinton de Kock, Heinrich Klaasen, Rassie van der Dussen, Keshav Maharaj, Reeza Hendricks, Marco Jansen, Sisanda Magala, Janneman Malan, Aiden Markram, David Miller, Lungi Ngidi, Anrich Nortje, Wayne Parnell, Kagiso Rabada, Tabraiz Shamsi. England ODI Squad: Jos Buttler (c), Moeen Ali, Jofra Archer, Harry Brook, Sam Curran, Ben Duckett, Dawid Malan, Adil Rashid, Jason Roy, Phil Salt, Olly Stone, Reece Topley, David Willey, Chris Woakes. Betway ODI Series South Africa vs England Friday, 27 January – 13:00 South Africa beat England by 27 runs – Mangaung Oval, Bloemfontein Sunday, 29 January – 10:00 South Africa beat England by five wickets – Mangaung Oval, Bloemfontein Wednesday, 01 February – 13:00 South Africa vs England – The Oval, Kimberley CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-01 06:44:31","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IND vs AUS: भारतीय टीम को झटका, पहले 2 टेस्ट से बाहर हुआ यह खिलाड़ी, सूर्यकुमार यादव को मिल सकता है डेब्यू का मौका","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-border-gavaskar-trophy-shreyas-iyer-ruled-out-of-first-test-suryakumar-yadav-likely-to-make-debut-3742168#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs Australia: ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज का आगाज 9 फरवरी से होना है. टेस्ट सीरीज से पहले भारतीय टीम के लिए बुरी खबर है. रिपोर्ट की मानें तो श्रेयस अय्यर (Shreyas Iyer) पहले 2 टेस्ट मैच से बाहर रहेंगे.","content":"IND vs AUS Test: भारत और ऑस्ट्रेलिया: पहले 2 टेस्ट से बाहर हुए श्रेयस अय्यर India vs Australia: ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज का आगाज 9 फरवरी से होना है. टेस्ट सीरीज से पहले भारतीय टीम के लिए बुरी खबर है. रिपोर्ट की मानें तो श्रेयस अय्यर (Shreyas Iyer) पहले 2 टेस्ट मैच से बाहर रहेंगे. दरअसल, कमर की चोट के कारण अय्यर न्यूजीलैंड के खिलाफ सीरीज भी नहीं खेल पाए थे, वहीं, खबर ये है कि अय्यर अभी पूरी तरह से फिट नहीं हैं. यही कारण है कि पहले 2 टेस्ट मैच का हिस्सा यह भारतीय क्रिकेटर नहीं बन पाएगा. अय्यर की गौरमौजूदगी में सूर्यकुमार यादव का टेस्ट मैच में खेलना पक्का नजर आ रहा है. यानि ऑस्ट्रेलिया के खिलाफ पहले टेस्ट मैच में सूर्यकुमार डेब्यू कर सकते हैं. आगामी बॉर्डर-गावस्कर सीरीज भारत के लिए बेहद महत्वपूर्ण होने वाली है, क्योंकि वे विश्व टेस्ट चैंपियनशिप (WTC) फाइनल के लिए क्वालीफाई करने के लिए हर हाल में टेस्ट सीरीज को जीतना होगा. रोहित शर्मा एंड कंपनी इस समय WTC स्टैंडिंग में दूसरे स्थान पर काबिज हैं. इसके अलावा यह टेस्ट सीरीज विराट कोहली, रोहित शर्मा जैसे खिलाड़ियों के लिए काफी अहम है. वहीं, भारत और ऑस्ट्रेलिया के बीच पहला टेस्ट मैच 9 से 13 फरवरी के बीच नागपुर में खेला जाएगा. सीरीज में 4 टेस्ट मैच होने हैं. पहला टेस्ट, नागपुर में - 9-13 फरवरी (विदर्भ क्रिकेट एसोसिएशन स्टेडियम) दूसरा टेस्ट, दिल्ली में - 17-21 फरवरी (अरुण जेटली स्टेडियम) तीसरा टेस्ट धर्मशाला में - 1-5 मार्च (हिमाचल प्रदेश क्रिकेट एसोसिएशन स्टेडियम) चौथा टेस्ट, अहमदाबाद में - 9-13 मार्च (नरेंद्र मोदी स्टेडियम) : रोहित शर्मा (c), केएल राहुल (vc), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, , केएस भरत (wk), इशान किशन (wk), रविचंद्रन अश्विन, अक्षर पटेल, कुलदीप यादव, रवींद्र जडेजा, मोहम्मद शमी, मोहम्मद सिराज, उमेश यादव, जयदेव उनादकट, सूर्यकुमार यादव पैट कमिंस (कप्तान), एश्टन एगर, स्कॉट बोलैंड, एलेक्स केरी, कैमरून ग्रीन, पीटर हैंड्सकॉम्ब, जोश हेजलवुड, ट्रेविस हेड, उस्मान ख्वाजा, मारनस लबसचगने, नाथन लियोन, लांस मॉरिस, टॉड मर्फी, मैथ्यू रेनशॉ, स्टीव स्मिथ, मिचेल स्टार्क, मिचेल स्वेपसन, डेविड वॉर्नर पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 06:39:41","image_url":"https://c.ndtvimg.com/2022-10/dfr5ian8_suryakumar-yadav-sarfaraz-khan-twitter_625x300_02_October_22.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs NZ 3rd T20: वसीम जाफऱ ने बताया, तीसरे टी-20 में किसकी जगह पर खेल सकते हैं पृथ्वी शॉ","link":"https://sports.ndtv.com/hindi/cricket/india-vs-new-zealand-wasim-jaffer-wants-hardik-pandya-to-retain-yuzvendra-chahal-for-ahmedabad-t20i-also-chance-for-prithvi-shaw-3742130#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ T20I: न्यूजीलैंड के खिलाफ टी-20 सीरीज में भारतीय युवा खिलाड़ी जैसे शुभमन गिल और ईशान किशन अबतक असफल रहे हैं. जिनके फॉर्म को लेकर काफी बातें हो रही है.","content":"Prithvi Shaw: तीसरेटी-20 में एक बदलाव संभव न्यूजीलैंड के खिलाफ टी-20 सीरीज में भारतीय युवा खिलाड़ी जैसे शुभमन गिल और ईशान किशन अबतक असफल रहे हैं. जिनके फॉर्म को लेकर काफी बातें हो रही है. वहीं, भारत के पूर्व क्रिकेटर वसीम जाफर (Wasim Jaffer) ने तीसरे टी-20 मैच से पहले युवा खिलाड़ियों को लेकर अपनी राय दी है और कहा कि अभी भी इन युवा खिलाड़ियों को काफी कुछ सीखने की जरूरत है. के साथ बात करते हुए वसीम ने तीसरे टी-20 से पहले कुछ अहम मुद्दे पर बात की, खासकर भारतीय बल्लेबाजी पर अपनी राय दी. वसीम ने कहा 'जिस तरह की पिच पर बल्लेबाजों ने बैटिंग की, इसलिए यहां मैच आलोचना नहीं करना चाहूंगा. यकीनन अभी भी युवा क्रिकेटरों को काफी कुछ सीखना है लेकिन बल्लेबाजों ने जिस अंदाज में स्पीन वाली पिच पर जान लगाकर बैटिंग की है, वह यह दर्शाता है कि हम संधर्ष भी कर सकते हैं. अभी मैं ज्यादा आलोचना तो नहीं करूंगा लेकिन हां युवा बैटरों को पिच पर सिंगल लेने को लेकर ज्यादा से ज्यादा सोचना होगा.' वसीम ने आगे ये भी कहा कि अहमदाबाद में पिच अच्छी मिलेगी, ऐसे में उम्मीद है कि भारतीय बल्लेबाजों को अच्छी बल्लेबाजी करने मिलेगी. पूर्व भारतीय क्रिकेटर ने युजवेंद्र चहल को भारतीय इलेवन में शामिल किए जाने की वकालत की है और कहा, 'मुझे लगता है कि यदि हमारे पास कलाई वाले स्पिनर हैं तो उसका उपयोग करना चाहिए. वहीं, उमरान को लेकर मेरा मानना है कि वो इस फॉर्मेट में संघर्ष कर रहे हैं, इस फॉर्मेट में जिस तरह की विविधता चाहिए वो अभी कर नहीं पा रहे हैं. ऐसे में मुझे लगता है कि चहल एक सही विकल्प हैं उनकी जगह.' वहीं, प्लेइंग इलेवन में बदलाव को लेकर वसीम ने कहा कि, यदि बदलाव की देखें तो शुभमन गिल की जगह पृथ्वी को शामिल किया जाना चाहिए, शॉ इस समय शानदार फॉर्म में हैं और वो इस फॉर्मेट में अच्छा कर भी रहे हैं. वहीं, जाफर ने कहा कि यदि गिल भी खेलते हैं तो मुझे इससे कोई फर्क नहीं पड़ेगा. बता दें कि आज तीसरा टी20 मैच खेला जाएगा. पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 06:21:29","image_url":"https://c.ndtvimg.com/2023-01/jjs37348_prithvi-shaw-806_625x300_27_January_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Video: माही मार रहा है...आईपीएल 2023 से पहले दिखा एमएस धोनी का पुराना अवतार, जमकर लगाए चौके-छक्के","link":"https://www.abplive.com/sports/cricket/ms-dhoni-starts-preparation-for-ipl-2023-video-viral-in-social-media-dhoni-net-practice-2322866","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"MS Dhoni Practice Video, IPL 2023: इंडियन प्रीमियर लीग 2023 के सीजन की शुरुआत मार्च अंत या फिर अप्रैल महीने की शुरुआत में हो सकती है. इसको लेकर अभी से सभी फ्रेंचाइजियों के खिलाड़ियों ने भले ही अभ्यास करना ना शुरू किया हो, लेकिन चेन्नई सुपर किंग्स टीम के कप्तान महेंद्र सिंह धोनी ने तैयारी करना शुरू कर दिया है. महेंद्र सिंह धोनी का नेट्स पर अभ्यास करते हुए एक वीडियो सोशल मीडिया पर जमकर वायरल हो रहा है. इस वीडियो में धोनी नेट्स पर लंबे-लंबे छक्के लगाते हुए देखे जा सकते हैं. धोनी स्पिन गेंदबाजों के खिलाफ आक्रामक अंदाज में खेलते हुए दिखाई दिए. इससे साफ पता चलता है कि वह आगामी आईपीएल के सीजन से पहले खुद को पूरी तरह से लय में वापस लाना चाहते हैं. साल 2020 में अंतरराष्ट्रीय क्रिकेट से संन्यास लेने के बाद से धोनी सिर्फ आईपीएल में ही अब तक खेलते हुए दिखाई दिए हैं. पिछले आईपीएल सीजन के शुरू होने से पहले धोनी ने जडेजा को चेन्नई सुपर किंग्स की कप्तानी सौंप दी थी, लेकिन टीम के प्रदर्शन को देखते हुए उन्हें वापस बीच सीजन में कप्तानी की जिम्मेदारी को फिर से संभालना पड़ा था. https://twitter.com/msdfansofficial/status/1620066902004609029 यह धोनी का आखिरी आईपीएल सीजन हो सकता है पिछले सीजन में जब धोनी ने रवींद्र जडेजा को टीम की कप्तानी सौंपी थी तो उस समय सभी को लगा कि यह धोनी का आखिरी सीजन होगा. हालांकि धोनी ने अपने बयान में यह साफ कर दिया था कि वह अपना आखिरी आईपीएल मैच चेन्नई सुपर किंग्स के होम ग्राउंड एम.ए चिदंबरम स्टेडियम में खेलेंगे. बता दें कि पिछले आईपीएल सीजन में धोनी ने 14 मैचों में 33.14 के औसत से कुल 232 रन बनाए थे जिसमें एक अर्धशतकीय पारी भी शामिल थी. हाल में धोनी भारत और न्यूजीलैंड के बीच रांची में खेले गए पहले टी20 मुकाबले को देखने भी पहुंचे थे वहीं उन्होंने भारत और कीवी टीम के खिलाड़ियों के साथ भी समय बिताया था। ये भी पढ़े... IND vs AUS: ऑस्ट्रेलिया को लगा बड़ा झटका, भारत के खिलाफ पहले टेस्ट में नहीं खेलेंगे मिचेल स्टार्क","content":"MS Dhoni Practice Video, IPL 2023: इंडियन प्रीमियर लीग 2023 के सीजन की शुरुआत मार्च अंत या फिर अप्रैल महीने की शुरुआत में हो सकती है. इसको लेकर अभी से सभी फ्रेंचाइजियों के खिलाड़ियों ने भले ही अभ्यास करना ना शुरू किया हो, लेकिन चेन्नई सुपर किंग्स टीम के कप्तान महेंद्र सिंह धोनी ने तैयारी करना शुरू कर दिया है. महेंद्र सिंह धोनी का नेट्स पर अभ्यास करते हुए एक वीडियो सोशल मीडिया पर जमकर वायरल हो रहा है. इस वीडियो में धोनी नेट्स पर लंबे-लंबे छक्के लगाते हुए देखे जा सकते हैं. धोनी स्पिन गेंदबाजों के खिलाफ आक्रामक अंदाज में खेलते हुए दिखाई दिए. इससे साफ पता चलता है कि वह आगामी आईपीएल के सीजन से पहले खुद को पूरी तरह से लय में वापस लाना चाहते हैं. साल 2020 में अंतरराष्ट्रीय क्रिकेट से संन्यास लेने के बाद से धोनी सिर्फ आईपीएल में ही अब तक खेलते हुए दिखाई दिए हैं. पिछले आईपीएल सीजन के शुरू होने से पहले धोनी ने जडेजा को चेन्नई सुपर किंग्स की कप्तानी सौंप दी थी, लेकिन टीम के प्रदर्शन को देखते हुए उन्हें वापस बीच सीजन में कप्तानी की जिम्मेदारी को फिर से संभालना पड़ा था. https://twitter.com/msdfansofficial/status/1620066902004609029 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); यह धोनी का आखिरी आईपीएल सीजन हो सकता है पिछले सीजन में जब धोनी ने रवींद्र जडेजा को टीम की कप्तानी सौंपी थी तो उस समय सभी को लगा कि यह धोनी का आखिरी सीजन होगा. हालांकि धोनी ने अपने बयान में यह साफ कर दिया था कि वह अपना आखिरी आईपीएल मैच चेन्नई सुपर किंग्स के होम ग्राउंड एम.ए चिदंबरम स्टेडियम में खेलेंगे. बता दें कि पिछले आईपीएल सीजन में धोनी ने 14 मैचों में 33.14 के औसत से कुल 232 रन बनाए थे जिसमें एक अर्धशतकीय पारी भी शामिल थी. हाल में धोनी भारत और न्यूजीलैंड के बीच रांची में खेले गए पहले टी20 मुकाबले को देखने भी पहुंचे थे वहीं उन्होंने भारत और कीवी टीम के खिलाड़ियों के साथ भी समय बिताया था। ये भी पढ़े... IND vs AUS: ऑस्ट्रेलिया को लगा बड़ा झटका, भारत के खिलाफ पहले टेस्ट में नहीं खेलेंगे मिचेल स्टार्क","pubDate":"2023-02-01 06:17:04","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/60fb377da9b85b60b982f963f4396ad81675231569989582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"SA vs ENG: सैम कर्रन ने विकेट लेने के बाद मनाया ऐसा जश्न, ICC ने ठोका जुर्माना, ये सज़ा भी मिली!","link":"https://www.abplive.com/sports/cricket/england-all-rounder-sam-curran-fined-match-fee-and-gets-demerit-point-on-excessive-celebration-of-temba-bavuma-wicket-eng-vs-sa-2322837","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Sam Curran Demerit Points: इंग्लैंड के ऑलराउंडर सैम कर्रन (Sam Curran) पर ICC ने मैच फीस का 15 फीसदी जुर्माना लगाया है. साथ ही उन्हें एक डिमैरिट पॉइंट भी दिया गया है. दक्षिण अफ्रीका के खिलाफ टेंबा बावुमा का विकेट मिलने के बाद मनाए गए जश्न के कारण सैम कर्रन पर यह एक्शन लिया गया है. इंग्लैंड और दक्षिण अफ्रीका (ENG vs SA) के बीच रविवार को खेले गए दूसरे मुकाबले में सैम कर्रन ने टेंबा बावुमा (Temba Bavuma) का अहम विकेट लिया था. बावुमा ने 102 गेंद पर 109 रन की पारी खेली थी. इस विकेट के मिलने की खुशी में सैम कर्रन पिच पर दौड़ते हुए बावुमा के काफी करीब तक जा पहुंचे थे. यहां सैम कर्रन ने ICC की आचार संहिता का लेवल-1 अफेंस किया था. इसके मुताबिक उन खिलाड़ियों पर एक्शन लिया जाता है जो बल्लेबाज के आउट होने के बाद जरूरत से ज्यादा सेलिब्रेट करते हैं और उसके बेहद नजदीक तक पहुंचते हुए ऐसी एक्शन करते हैं जो बल्लेबाज को जवाब देने के लिए उग्र करे. अगर एक खिलाड़ी को 24 महीने के पीरियड के दौरान चार या इससे ज्यादा डिमैरिट पॉइंट मिलते हैं तो उस पर कुछ समय के लिए बैन लगा दिया जाता है. वैसे सैम कर्रन का इस पीरियड में पहला डिमैरिट पॉइंट है. सीरीज में 2-0 की अजेय बढ़त बना चुकी है दक्षिण अफ्रीका इंग्लैंड और दक्षिण अफ्रीका के बीच तीन मैचों की वनडे सीरीज के शुरुआती दोनों मुकाबले प्रोटियाज के नाम रहे हैं. पहले मैच में दक्षिण अफ्रीका ने इंग्लैंड को 27 रन से हराया था. वहीं, दूसरे मुकाबले में दक्षिण अफ्रीका ने 5 गेंद बाकी रहते 5 विकेट से जीत दर्ज की थी. अब इंग्लैंड के ऊपर इस सीरीज में क्लीन स्वीप का खतरा मंडरा रहा है. यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","content":"Sam Curran Demerit Points: इंग्लैंड के ऑलराउंडर सैम कर्रन (Sam Curran) पर ICC ने मैच फीस का 15 फीसदी जुर्माना लगाया है. साथ ही उन्हें एक डिमैरिट पॉइंट भी दिया गया है. दक्षिण अफ्रीका के खिलाफ टेंबा बावुमा का विकेट मिलने के बाद मनाए गए जश्न के कारण सैम कर्रन पर यह एक्शन लिया गया है. इंग्लैंड और दक्षिण अफ्रीका (ENG vs SA) के बीच रविवार को खेले गए दूसरे मुकाबले में सैम कर्रन ने टेंबा बावुमा (Temba Bavuma) का अहम विकेट लिया था. बावुमा ने 102 गेंद पर 109 रन की पारी खेली थी. इस विकेट के मिलने की खुशी में सैम कर्रन पिच पर दौड़ते हुए बावुमा के काफी करीब तक जा पहुंचे थे. यहां सैम कर्रन ने ICC की आचार संहिता का लेवल-1 अफेंस किया था. इसके मुताबिक उन खिलाड़ियों पर एक्शन लिया जाता है जो बल्लेबाज के आउट होने के बाद जरूरत से ज्यादा सेलिब्रेट करते हैं और उसके बेहद नजदीक तक पहुंचते हुए ऐसी एक्शन करते हैं जो बल्लेबाज को जवाब देने के लिए उग्र करे. अगर एक खिलाड़ी को 24 महीने के पीरियड के दौरान चार या इससे ज्यादा डिमैरिट पॉइंट मिलते हैं तो उस पर कुछ समय के लिए बैन लगा दिया जाता है. वैसे सैम कर्रन का इस पीरियड में पहला डिमैरिट पॉइंट है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); सीरीज में 2-0 की अजेय बढ़त बना चुकी है दक्षिण अफ्रीका इंग्लैंड और दक्षिण अफ्रीका के बीच तीन मैचों की वनडे सीरीज के शुरुआती दोनों मुकाबले प्रोटियाज के नाम रहे हैं. पहले मैच में दक्षिण अफ्रीका ने इंग्लैंड को 27 रन से हराया था. वहीं, दूसरे मुकाबले में दक्षिण अफ्रीका ने 5 गेंद बाकी रहते 5 विकेट से जीत दर्ज की थी. अब इंग्लैंड के ऊपर इस सीरीज में क्लीन स्वीप का खतरा मंडरा रहा है. यह भी पढ़ें... IND vs AUS: टेस्ट सीरीज से पहले शुरू हुई बयानबाजी, ईयान हिली ने बताया भारत में अभ्यास मैच क्यों नहीं खेल रही ऑस्ट्रेलिया","pubDate":"2023-02-01 05:58:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/f40bee8693096f7693768a751723f2f81675229644759300_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sam Curran fined for 'excessive celebration' of Temba Bavuma dismissal","link":"https://www.iol.co.za/sport/cricket/international/sam-curran-fined-for-excessive-celebration-of-temba-bavuma-dismissal-b0181271-083d-4b22-8d9a-130c52332ed7","keywords":null,"creator":["AFP"],"video_url":null,"description":"England all-rounder Sam Curran has been fined 15 percent of his match fee and handed a demerit point for ‘excessively celebrating’ his dismissal of Proteas captain Temba Bavuma.","content":"Kimberly - England all-rounder Sam Curran has been fined 15 percent of his match fee and handed a demerit point for \"excessively celebrating\" his dismissal of South African captain Temba Bavuma in the second one-day international on Sunday. The penalty was announced by the International Cricket Council on Tuesday. The teams meet in the third and final match of the World Cup Super League series in Kimberley on Wednesday. Bavuma made 109 as South Africa took a decisive 2-0 series lead in Bloemfontein before scooping a ball from Curran into his stumps. Curran ran down the pitch and got close to Bavuma as he celebrated the wicket. Match referee Jeff Crowe of New Zealand fined Curran following a report by the umpires. Curran admitted the offence and there was no need for a formal hearing. ALSO READ: Temba Bavuma maintained his dignity despite keyboard warriors’ prejudice According to the ICC, Curran was found to have committed a level one offence of the ICC code of conduct when he \"excessively celebrated towards and in close proximity to the dismissed batter, being an action which had the potential to provoke an aggressive reaction from Bavuma\". If a player accumulates four or more demerit points within a 24-month period he faces a ban. It was Curran's first offence within the time period. cb/imm © Agence France-Presse Share","pubDate":"2023-02-01 05:56:47","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/68ba1a53-c5fd-5ab0-ae8c-35b207e0e273&operation=CROP&offset=0x136&resize=3200x1799","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"'मैं भारतीय Visa का इंतजार कर रहा', उस्मान ख्वाजा के साथ हो गई गुगली, Memes शेयर कर बयां किया दर्द..","link":"https://sports.ndtv.com/hindi/cricket/usman-khawaja-missed-the-teams-flight-to-india-due-to-a-visa-delay-3741903#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS test Series: ऑस्ट्रेलियाई क्रिकेटर उस्मान ख्वाजा (Usman Khawaja) के साथ बहुत बड़ी गुगली हो गई है. दरअसल, भारत दौरे के लिए ऑस्ट्रेलियाई टीम अपने देश से भारत आने के लिए निकल पड़ी है लेकिन क्रिकेटर उस्मान ख्वाजा को भारत का वीजा (VISA) समय रहते नहीं मिल पाया जिसके कारण भारत आने वाली फ्लाइट पर ऑस्ट्रेलियाई क्रिकेटर चढ़ नहीं पाए हैं","content":"उस्मान ख्वाजा ने की भारत आने वाली फ्लाइट मिस, जानिए कारण IND vs AUS test Series: ऑस्ट्रेलियाई क्रिकेटर के साथ बहुत बड़ी गुगली हो गई है. दरअसल, भारत दौरे के लिए ऑस्ट्रेलियाई टीम अपने देश से भारत आने के लिए निकल पड़ी है लेकिन क्रिकेटर उस्मान ख्वाजा को भारत का वीजा (VISA) समय रहते नहीं मिल पाया जिसके कारण भारत आने वाली फ्लाइट पर चढ़ नहीं पाए हैं. ख्वाजा ने सोशल मीडिया पर Memes शेयर कर इस बात की जानकारी साझा की है. उस्मानने मजाकिया तस्वीर शेयर कर लिखा है 'मैं भारतीय Visa का इंतजार कर रहा हूं..' बता दें कि भारत और ऑस्ट्रेलिया के बीच सीरीज का पहला मैच 9 फरवरी को नागपुर में खेला जाएगा. 1 फरवरी को ऑस्ट्रेलियाई टीम भारत आने वाली है. वैसे, फैन्स को बता दें कि क्रिकेट ऑस्ट्रेलिया की ओर से बताया गया है कि कि उम्मीद है कि ख्वाजा का वीजा क्लीयर हो जाएगा और वह गुरुवार को भारत के लिए उड़ान भरेंगे. ख्वाजा ऑस्ट्रेलियाई टीम के सबसे अहम खिलाड़ियों में से एक हैं. पहला टेस्ट, नागपुर में - 9-13 फरवरी (विदर्भ क्रिकेट एसोसिएशन स्टेडियम) दूसरा टेस्ट, दिल्ली में - 17-21 फरवरी (अरुण जेटली स्टेडियम) तीसरा टेस्ट धर्मशाला में - 1-5 मार्च (हिमाचल प्रदेश क्रिकेट एसोसिएशन स्टेडियम) चौथा टेस्ट, अहमदाबाद में - 9-13 मार्च (नरेंद्र मोदी स्टेडियम) : रोहित शर्मा (c), केएल राहुल (vc), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, श्रेयस अय्यर, केएस भरत (wk), इशान किशन (wk), रविचंद्रन अश्विन, अक्षर पटेल, कुलदीप यादव, रवींद्र जडेजा, मोहम्मद शमी, मोहम्मद सिराज, उमेश यादव, जयदेव उनादकट, सूर्यकुमार यादव : पैट कमिंस (कप्तान), एश्टन एगर, स्कॉट बोलैंड, एलेक्स केरी, कैमरून ग्रीन, पीटर हैंड्सकॉम्ब, जोश हेजलवुड, ट्रेविस हेड, उस्मान ख्वाजा, मारनस लबसचगने, नाथन लियोन, लांस मॉरिस, टॉड मर्फी, मैथ्यू रेनशॉ, स्टीव स्मिथ, मिचेल स्टार्क, मिचेल स्वेपसन, डेविड वॉर्नर पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-01 05:51:02","image_url":"https://c.ndtvimg.com/2023-01/abgp156g_usman-khawaja-afp_625x300_07_January_23.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs NZ 3rd T20: ईशान या गिल, किस पर गिरेगी गाज? दो बदलाव के साथ उतर सकती है टीम इंडिया","link":"https://www.abplive.com/sports/cricket/ind-vs-nz-3rd-t20i-indian-team-can-do-these-2-changes-in-the-last-t20i-match-against-newzealand-2322815","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"India vs New Zealand 3rd T20, India Playing XI: भारत और न्यूजीलैंड के बीच खेली जा रही 3 मैचों की टी20 सीरीज का आखिरी मुकाबला अहमदाबाद के नरेंद्र मोदी स्टेडियम में खेला जाएगा. इस मैच को लेकर ऐसी उम्मीद जताई जा रही है कि भारतीय टीम की प्लेइंग इलेवन में बदलाव देखने को मिल सकता है. ओपनिंग में लंबे समय के बाद टीम में वापसी करने वाले पृथ्वी शॉ को मौका दिया जा सकता है. वहीं अहमदाबाद की पिच को ध्यान में रखते हुए प्लेइंग इलेवन में उमरान मलिक की भी वापसी हो सकती है, जिनको युजवेंद्र चहल की जगह पर टीम में शामिल किया जा सकता है. निर्णायक मुकाबले को देखते हुए भारतीय टीम की प्लेइंग इलेवन में दो बदलाव देखने को मिल सकते हैं. अभी तक इस टी20 सीरीज में भारतीय ओपनिंग बल्लेबाजों ने उम्मीद के अनुसार शुरुआत नहीं दी है. शुभमन गिल का न्यूजीलैंड के खिलाफ वनडे सीरीज में शानदार फॉर्म देखने को मिला था, लेकिन टी20 सीरीज में वह अभी तक उस तरह का प्रदर्शन करने में कामयाब नहीं हो सके हैं. गिल ने अब तक इस सीरीज में 11 और 7 रन की पारियां खेली हैं. शुरुआती ओवरों में तेजी से रन बनाने की क्षमता रखते हैं पृथ्वी शॉ भले ही पृथ्वी शॉ को अभी तक 1 ही टी20 अंतरराष्ट्रीय मुकाबला खेलने का मौका मिला है, लेकिन घरेलू क्रिकेट और आईपीएल में उनका प्रदर्शन शानदार देखने को मिला है. पृथ्वी शॉ शुरुआती ओवरों में तेजी के साथ रन बनाते हैं, जिससे विपक्षी टीम के लिए मैच में वापसी करना मुश्किल भरा हो जाता है. गेंदबाजी में बदलाव को लेकर बात की जाए तो लखनऊ में जहां टीम 4 स्पिन गेंदबाजों के साथ मैदान पर उतरी थी. वहीं इस मैच में टीम 3 तेज गेंदबाजों के साथ मैदान पर उतरने का फैसला कर सकती है. ऐसे में युजवेंद्र चहल की जगह पर उमरान मलिक को खेलने का मौका मिल सकता है जो अहमदाबाद की पिच और हालात को देखते हुए टीम के लिए अधिक उपयोगी साबित हो सकते हैं. ये भी पढ़े... Team India Schedule: फरवरी में हर दिन मैदान पर दिखेगी टीम इंडिया! इस महीने का शेड्यूल देख उड़ जाएंगे होश","content":"India vs New Zealand 3rd T20, India Playing XI: भारत और न्यूजीलैंड के बीच खेली जा रही 3 मैचों की टी20 सीरीज का आखिरी मुकाबला अहमदाबाद के नरेंद्र मोदी स्टेडियम में खेला जाएगा. इस मैच को लेकर ऐसी उम्मीद जताई जा रही है कि भारतीय टीम की प्लेइंग इलेवन में बदलाव देखने को मिल सकता है. ओपनिंग में लंबे समय के बाद टीम में वापसी करने वाले पृथ्वी शॉ को मौका दिया जा सकता है. वहीं अहमदाबाद की पिच को ध्यान में रखते हुए प्लेइंग इलेवन में उमरान मलिक की भी वापसी हो सकती है, जिनको युजवेंद्र चहल की जगह पर टीम में शामिल किया जा सकता है. निर्णायक मुकाबले को देखते हुए भारतीय टीम की प्लेइंग इलेवन में दो बदलाव देखने को मिल सकते हैं. अभी तक इस टी20 सीरीज में भारतीय ओपनिंग बल्लेबाजों ने उम्मीद के अनुसार शुरुआत नहीं दी है. शुभमन गिल का न्यूजीलैंड के खिलाफ वनडे सीरीज में शानदार फॉर्म देखने को मिला था, लेकिन टी20 सीरीज में वह अभी तक उस तरह का प्रदर्शन करने में कामयाब नहीं हो सके हैं. गिल ने अब तक इस सीरीज में 11 और 7 रन की पारियां खेली हैं. शुरुआती ओवरों में तेजी से रन बनाने की क्षमता रखते हैं पृथ्वी शॉ googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); भले ही पृथ्वी शॉ को अभी तक 1 ही टी20 अंतरराष्ट्रीय मुकाबला खेलने का मौका मिला है, लेकिन घरेलू क्रिकेट और आईपीएल में उनका प्रदर्शन शानदार देखने को मिला है. पृथ्वी शॉ शुरुआती ओवरों में तेजी के साथ रन बनाते हैं, जिससे विपक्षी टीम के लिए मैच में वापसी करना मुश्किल भरा हो जाता है. गेंदबाजी में बदलाव को लेकर बात की जाए तो लखनऊ में जहां टीम 4 स्पिन गेंदबाजों के साथ मैदान पर उतरी थी. वहीं इस मैच में टीम 3 तेज गेंदबाजों के साथ मैदान पर उतरने का फैसला कर सकती है. ऐसे में युजवेंद्र चहल की जगह पर उमरान मलिक को खेलने का मौका मिल सकता है जो अहमदाबाद की पिच और हालात को देखते हुए टीम के लिए अधिक उपयोगी साबित हो सकते हैं. ये भी पढ़े... Team India Schedule: फरवरी में हर दिन मैदान पर दिखेगी टीम इंडिया! इस महीने का शेड्यूल देख उड़ जाएंगे होश","pubDate":"2023-02-01 05:36:28","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/01/95f3b66ef658968c7f185dc697b31aa11675227845888582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"}]}