{"newsArray":[{"article_id":"02a152fbe1867e63ea5173d86e060a7f","title":"Asia Cup 2023, India vs Nepal: Will rain again end up playing spoilsport?","link":"https://www.indiatoday.in/sports/cricket/story/asia-cup-2023-india-vs-nepal-will-rain-again-end-up-playing-spoilsport-in-pallekele-2430531-2023-09-04?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup 2023, India vs Nepal: Will rain again end up playing spoilsport?","content":"Listen to Story India and Nepal are all set to lock horns in the last and final match in their group in Asia Cup 2023 on Monday, September 4 at the Pallekele International Stadium. Pakistan have already made their way through to the Super Fours from their group. Hence, India's match against Nepal is a knockout affair. Earlier in Saturday, the match between India and Pakistan couldn't produce a result due to constant spells of rain in Pallekele. Since Pakistan had already won a match against Nepal by 238 runs at the Multan Cricket Stadium, they made their way through to the playoffs. India remain the favourites to become the other team from their group to qualify for the Super Fours, although one cannot undermine Nepal by any stretch of the imagination. India's batting looked a tad out of sorts in the first match when the likes of Shaheen Shah Afridi, and Naseem Shah were breathing fire. India’s bowling, however, is yet to be tested. The weather for Monday’s game doesn’t look promising by any means. There is a chance of rain throughout the day, let alone during match-time. Playing conditions will be cloudy and it would not be a surprise if the DLS Method comes into the picture. Temperatures will be around the 26-degree Celsius mark. However, if the match gets called off, India would qualify for the Super Fours. For Nepal to make their way through to the next round, they have to secure an outright win against the Men in Blue.","pubDate":"2023-09-04 01:20:36","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bc495ea6a14398cc411f268cc4f7580b","title":"SA vs AUS T20 series | Aussies whitewashed South Africa by winning the 3rd match!","link":"https://thenewsglory.com/sa-vs-aus-t20-series-aussies-whitewashed-south-africa-by-winning-the-3rd-match/","keywords":["Sports","Australia","Cricket","South Africa","T20","T20I"],"creator":["The News Glory"],"video_url":null,"description":"Durban: Australian cricket team won the 3-match T20I series against South Africa by 3-0. The Australian cricket team is playing a cricket series on tour in South Africa. Both teams played a 3-match T20I series. Australia won the series 3-0. Next, both the teams will play a 5-match ODI series. South Africa won the toss […]","content":"Durban: Australian cricket team won the 3-match T20I series against South Africa by 3-0. The Australian cricket team is playing a cricket series on tour in South Africa. Both teams played a 3-match T20I series. Australia won the series 3-0. Next, both the teams will play a 5-match ODI series. South Africa won the toss and elected to bat in the third T20I on Sunday. The team scored 190 runs for the loss of 8 wickets in 20 overs. Henriques scored 42 runs, skipper Markram 41 runs, Stubbs 25 runs and Donovan Ferreira 48 runs (off 21 balls). Australia chased down the target of 191 runs. Matthew Short and Mitchell Marsh formed a formidable partnership with Travis Head and Josh Inglis to lose quick wickets. The two put on a partnership of 85 runs. Josh Inglis was out after scoring 42 off 22 balls. Head put on a 58-run partnership with Stoinis who followed. He was dismissed for 91 off 48 balls. Unbeaten till the end, Stoinis scored 37 runs off 21 balls. Australia scored 191 runs for the loss of 5 wickets in 17.5 overs. It won the series 3-0. Head, who batted well in the match, won the man of the match award. Australia captain Mitchell Marsh won the man of the series award.","pubDate":"2023-09-04 00:13:14","image_url":null,"source_id":"thenewsglory","source_priority":321007,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c8bd3f3849ea95cc4604ece7eee3991d","title":"Bangladesh beat Afghanistan by 89 runs in Asia Cup","link":"https://thewest.com.au/sport/cricket/bangladesh-beat-afghanistan-by-89-runs-in-asia-cup-c-11793516","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Bangladesh have joined Pakistan in the Asia Cup's Super Fours, centuries from Mehidy Hasan and Najmul Hossain Shanto earning a comfortable win over Afghanistan.","content":"Mehidy Hasan and Najmul Hossain Shanto have smashed centuries to power Bangladesh to an emphatic 89-run win over Afghanistan and seal a place in the Super Fours at the Asia Cup. Mehidy, opening for the first time since the Asia Cup final in 2018, scored 112 and Najmul continued his brilliant run of form with 104 as Bangladesh set an imposing total of 5-334 in the sweltering heat of Lahore. Bangladesh fast bowlers Taskin Ahmed (4-44) and Shoriful Islam (3-36) bagged seven wickets between them as Afghanistan were dismissed for 245 in 44.3 overs. Ibrahim Zadran (75) and captain Hashmatullah Shahidi (51) scored fighting half-centuries but Bangladesh took regular wickets before Taskin wrapped up the innings. Bangladesh, who lost their opening Group B game to Sri Lanka, are the second team to go through to the Super Fours after Pakistan qualified from Group A. Mehidy retired hurt when he hit a superb inside-out six off Mujeeb, walking off with cramp in his finger. Najmul raised his century off 101 balls before he was run out when he slipped after a reverse sweep against Mujeeb in the 45th over. Shoriful's brilliant bowling held down Afghanistan in the powerplay as the left-arm quick had danger man Rahmanullah Gurbaz trapped lbw for one in his eventful first over. Gurbaz escaped a close lbw off Shoriful when Bangladesh didn't go for a referral before he was dismissed in similar fashion later the same over. Zadran and Rahmat Shah (33) consumed too many deliveries - more than 16 overs - in a 78-run second-wicket stand against some steady Bangladesh bowling. Mushfiqur Rahim plucked a stunning one-handed catch low to his right to dismiss Zadran in the 37th over and Shahidi followed when he mistimed a big shot and was caught at third man as Afghanistan lost their last five wickets for 49 runs. Sign up for our emails","pubDate":"2023-09-03 23:49:57","image_url":"https://images.thewest.com.au/publication/C-11793516/d868ba4fff47c0d36f686a01d1048eacd713333f-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"ad7b732cae03df554c365d8209b1137f","title":"England assistant Marcus Trescothick cites World Cup 'noise' about Harry Brook after stinging defeat against New Zealand","link":"https://www.dailymail.co.uk/sport/cricket/article-12476685/England-assistant-Marcus-Trescothick-cites-World-Cup-noise-Harry-Brook-stinging-defeat-against-New-Zealand.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"England were as awful in Birmingham as they were dominant in Durham and Manchester, losing the third T20 against a motivated New Zealand by 74 runs to set up a tense series finale.","content":"England assistant Marcus Trescothick cites 'noise' about Harry Brook's potential World Cup selection affecting batsmen after stinging defeat against New Zealand England lost third T20 against a motivated New Zealand by 74 runs on Sunday Harry Brook fell short, skying leg-spinner Ish Sodhi to mid-on for eight Trescothick admitted talks of Brook’s potential selection may have played a role By Lawrence Booth for the Daily Mail Updated: 00:17 BST, 4 September 2023 e-mail 2 View comments England were as awful in Birmingham as they were dominant in Durham and Manchester, losing the third T20 against a motivated New Zealand by 74 runs to set up a tense series finale. Challenged to make an imposing 203 for victory, Jos Buttler ’s team hobbled to 128, with even Harry Brook — the man of the moment — falling short, skying leg-spinner Ish Sodhi to mid-on for eight. Buttler himself managed 40 off 21 balls, but England were off the pace in almost every respect as the tourists closed the gap to 2-1 ahead of Monday's series finale at Trent Bridge. Assistant coach Marcus Trescothick then admitted that the speculation about Brook’s potential selection for the 50-over World Cup might be playing on the minds of those in the provisional 15-man party. On this evidence, that group may include Dawid Malan and Liam Livingstone. ‘There’s no doubt, when you have that element — noise outside the changing room — you just start to question sometimes, especially if you are not playing well, of course you do,’ said Trescothick. England lost the third T20 against New Zealand by 74 runs to set up a tense series finale Man-of-the-moment Harry Brook fell short, skying leg-spinner Ish Sodhi to mid-on for eight ‘You deal with these anxieties and problems on many occasions, and you know what to do. It’s up to the individuals, with our help as coaches, to get themselves in the right frame of mind.’ If there was any glimmer to emerge, it was that England know they are in a battle after strolling to two victories. Some may argue they are also closer to working out whom to omit from their World Cup squad to accommodate Brook. Malan’s painful 11-ball two drained the life from the powerplay and took his tally from the last two games to two runs from 15 deliveries. At this rate, his half- century at Durham may not be enough to save him. For Livingstone — who bowled four overs for 55 and fell sixth ball for two — it was also a day to forget. But he was hardly alone in struggling against an accurate New Zealand attack boosted by the return of the giant Kyle Jamieson. Marcus Trescothick admitted talks of Brook’s potential selection may have played a role Will Jacks again sparkled all too briefly, before Malan’s torture ended when he carved Tim Southee to deep point. Jonny Bairstow then pulled Sodhi’s first ball to deep midwicket to depart for 12 off 16. Brook glanced his first ball for four, and was then wrongly given lbw to Sodhi after gloving a reverse-sweep. A review saved him, only for Brook to waste the reprieve by falling next delivery. Buttler miscued a heave off Mitchell Santner, and after that only Moeen Ali played with any freedom. ‘Credit to New Zealand,’ said Buttler. ‘They outplayed us. Chasing that kind of score, we needed a fast start and a good powerplay but we didn’t get any partnerships going.’ The New Zealanders’ total of 202 for five — their highest in this format against England — centred on powerful innings from Finn Allen and Glenn Phillips. From 75 for two in the 10th over, they hammered 88 off 47 balls, with Allen hitting the first three balls of Adil Rashid’s final over for six. Joss Buttler paid tribute to New Zealand as he admitted they 'outplayed' England He was eventually bowled by Luke Wood for 83 off 53, with six sixes, while Phillips was superbly yorked by Gus Atkinson in the final over for 69 off 34, with five maximums. Atkinson, who collected four wickets on debut in Manchester on Friday, was again the pick of the attack, and England underlined their preference for pace yesterday by adding Durham’s Brydon Carse to their squad for the four 50-over matches that follow this series. Rested for this game, Carse had taken four for 39 in six overs in the first two matches, and must now be considered a possibility for the World Cup. The squad may not be as set in stone as national selector Luke Wright recently suggested. Share or comment on this article: England assistant Marcus Trescothick cites World Cup 'noise' about Harry Brook after stinging defeat against New Zealand e-mail Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-03 23:17:32","image_url":"https://i.dailymail.co.uk/1s/2023/09/03/23/75020701-0-image-m-20_1693779506726.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"b4d93a62406ff74458a677c53b570e0a","title":"Cricket world mourns Heath Streak","link":"https://www.herald.co.zw/cricket-world-mourns-heath-streak/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […]","content":"LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […] Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","pubDate":"2023-09-03 22:03:54","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"7d15db8160f3ba2394262634df283258","title":"Jim ends unwanted record","link":"https://www.herald.co.zw/jim-ends-unwanted-record/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","content":"HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, it ended a 15-game drought having last netted in their 2-1 win against ZPC Kariba at the National Sports Stadium. Jim was also on target as Herentals and Ngezi Platinum drew 3-3 in the reverse fixture at the Baobab Stadium. Tino Benza’s brilliantly struck free-kick which gave Nelson Chadya no chance was enough to drown the title chasing Ngezi Platinum just moments after the restart. Victory stretched Herentals’ unbeaten run to six games and they have registered four wins during this period. Jim had failed to score when part of the starting XI and the 19-year-old ended the unwanted record on Saturday. Jim said he was excited to finally end his lengthy goal drought. “It was a big win for us and it just feels good to start scoring especially after such a long run. “The team is very motivated to play anytime and I would also prefer to face all the big club in our next games while we are still in this great form. “I was also begging to be worried with why I was failing to score every time I’m in the starting line-up, but I also want to thank my coach and teammates who kept encouraging me,” said Jim. Mutiwekuziva hailed his troop for coming to the part. “I’m very impressed with what I saw from the boys, Ngezi are a tactical side and they are really good in all the departments. “It was never going to be easy for us but the boys fought a good fight in both ends for us to down one of the title favourites. “They showed character and I’m hoping that they will continue with this form in our coming assignments. We need to collect as many points as we can. “Our game plan really worked for us because we knew that Ngezi were going go try to keep the ball, so our mission was just to hit them with counter attacks using our speedy wingers to that effect. They really struggled in containing them and that is what we did right to win the match,” said Mutiwekuziva. Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","pubDate":"2023-09-03 22:02:58","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"a11dc497af54af5bde54a226224e3aa4","title":"Arsenal leave it late to sink Man Utd, Liverpool cruise","link":"https://www.herald.co.zw/arsenal-leave-it-late-to-sink-man-utd-liverpool-cruise/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […]","content":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […] Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","pubDate":"2023-09-03 22:02:58","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"19b9f150de5380b5af9e9dc0f6131066","title":"ZC to expand stadia for 2027 World Cup","link":"https://www.herald.co.zw/zc-to-expand-stadia-for-2027-world-cup/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","content":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","pubDate":"2023-09-03 22:02:55","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"1af3793bfd2ed99a592460704c3d12f5","title":"Chicken Inn silence Highlanders","link":"https://www.herald.co.zw/chicken-inn-silence-highlanders/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Sports Reporter Highlanders . . . . . . . . . . . . . . . . . . 0 Chicken Inn . . . . . . . . . . . . . . . . . . (0) 2 LEADERS Highlanders slumped to a second successive defeat, conceding two second […]","content":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","pubDate":"2023-09-03 22:02:54","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"e7e0a28e89b334cc12d307c983ee5087","title":"Mhofu leads Warriors against Namibia","link":"https://www.herald.co.zw/mhofu-leads-warriors-against-namibia/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"By Lovemore Dube VETERAN coach Sunday “Mhofu” Chidzambwa and his technical team will be watching out for player fatigue while seeking victory as the Zimbabwe senior national soccer team takes on Namibia in a Challenge match during President Emmerson Mnangagwa’s inauguration today. Mhofu, one of Zimbabwe’s most successful soccer personalities, has been entrusted with the […]","content":"VETERAN coach Sunday “Mhofu” Chidzambwa and his technical team will be watching out for player fatigue while seeking victory as the Zimbabwe senior national soccer team takes on Namibia in a Challenge match during President Emmerson Mnangagwa’s inauguration today. Mhofu, one of Zimbabwe’s most successful soccer personalities, has been entrusted with the assignment where soccer will be one of the key entertainment bits for today’s Inauguration programme. He will be assisted by Lizwe Sweswe of Sheasham, goalkeepers’ trainer Tembo Chuma, Highlanders’ fitness coach Abraham Mbayiwa and former Gweru United striker Wonder Chaka as manager. The mix on the bench of old and tried Chidzambwa and Chuma combined with new faces of Chaka and Mbayiwa perhaps is a hint of how the Normalisation Committee and its technical committee will go about their business when they sit anytime from this week to select national teams’ coaches. Zimbabweans must brace for surprises in the new set ups yet some old horses may be retained as their experience may come in handy. Mhofu confirmed yesterday that they had hastily assembled a national team. He also spoke of the technical team he will be working with. “I have been appointed alongside Lizwe Sweswe, the FC Platinum goalkeepers’ trainer Chuma, Highlanders’ trainer Mbayiwa and Wonder Chaka. We look forward to the game. “As for the rest of the logistics we are yet to confirm through Bennedict Moyo,” said Chidzambwa. Moyo is a member of the new technical team that is assisting the Normalisation Committee led by Lincoln Mutasa. Highlanders FC defence stalwart Peter Muduhwa and skillful and slow midfielder Brighton Manhire, Chicken Inn’s outstanding utility player Sherperd Mhlanga, Godknows Murirwa of Caps United and his teammate Thulani Joseph may be affected by the fact that their teams were in action yesterday. Highlanders clashed with Chicken Inn in a Bulawayo derby at Barbourfields Stadium. Caps United were in Gweru for a bruising tie with Black Rhinos in a Harare derby played in the Midlands. Given the significance of the match, the players are expected to give it their best shot on a momentous occasion for Zimbabweans. Several Heads of State, local and international prominent personalities are expected to grace the occasion. Zimbabwe start as favourites as they are under pressure to show the nation that the 18 month break from international football did not rob players of their individual brilliance. Who ever is selected to play will want to impress as scouts want to see what is available in Zimbabwe talent wise. Simbarashe Chinani (Simba Bhora) Nelson Chadya (Ngezi Platinum Stars) Peter Muduhwa (Highlanders) Frank Makarati (Dynamos) Farai Banda (Manica Diamonds) Xolani Ndlovu (Chicken Inn) Thubelihle Jubane (Sheasham) Godknows Murwira (Caps United) Tawanda Chisi (Manica Diamonds) Sheperd Mhlanga (Chicken Inn) Mthokozisi Msebe (Bulawayo Chiefs) Brighton Manhire (Highlanders) Tanaka Shandirwa (Dynamos) Brian Banda (FC Platinum) Thulani Joseph (Caps United) Fortune Binzi (Manica Diamonds) Tinashe Balakasi (Simba Bhora) Obriel Chirinda (Bulawayo Chiefs) Walter Musona (FC Platinum) Liberty Masveure (Sheasham) Head Coach Sunday Marimo Assistant Coach Lizwe Sweswe Goalkeepers Trainer Tembo Chuma Trainer Abraham Mbayiwa Manager Wonder Chaka Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","pubDate":"2023-09-03 22:02:51","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"02a152fbe1867e63ea5173d86e060a7f","title":"Asia Cup 2023, India vs Nepal: Will rain again end up playing spoilsport?","link":"https://www.indiatoday.in/sports/cricket/story/asia-cup-2023-india-vs-nepal-will-rain-again-end-up-playing-spoilsport-in-pallekele-2430531-2023-09-04?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup 2023, India vs Nepal: Will rain again end up playing spoilsport?","content":"Listen to Story India and Nepal are all set to lock horns in the last and final match in their group in Asia Cup 2023 on Monday, September 4 at the Pallekele International Stadium. Pakistan have already made their way through to the Super Fours from their group. Hence, India's match against Nepal is a knockout affair. Earlier in Saturday, the match between India and Pakistan couldn't produce a result due to constant spells of rain in Pallekele. Since Pakistan had already won a match against Nepal by 238 runs at the Multan Cricket Stadium, they made their way through to the playoffs. India remain the favourites to become the other team from their group to qualify for the Super Fours, although one cannot undermine Nepal by any stretch of the imagination. India's batting looked a tad out of sorts in the first match when the likes of Shaheen Shah Afridi, and Naseem Shah were breathing fire. India’s bowling, however, is yet to be tested. The weather for Monday’s game doesn’t look promising by any means. There is a chance of rain throughout the day, let alone during match-time. Playing conditions will be cloudy and it would not be a surprise if the DLS Method comes into the picture. Temperatures will be around the 26-degree Celsius mark. However, if the match gets called off, India would qualify for the Super Fours. For Nepal to make their way through to the next round, they have to secure an outright win against the Men in Blue.","pubDate":"2023-09-04 01:20:36","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bc495ea6a14398cc411f268cc4f7580b","title":"SA vs AUS T20 series | Aussies whitewashed South Africa by winning the 3rd match!","link":"https://thenewsglory.com/sa-vs-aus-t20-series-aussies-whitewashed-south-africa-by-winning-the-3rd-match/","keywords":["Sports","Australia","Cricket","South Africa","T20","T20I"],"creator":["The News Glory"],"video_url":null,"description":"Durban: Australian cricket team won the 3-match T20I series against South Africa by 3-0. The Australian cricket team is playing a cricket series on tour in South Africa. Both teams played a 3-match T20I series. Australia won the series 3-0. Next, both the teams will play a 5-match ODI series. South Africa won the toss […]","content":"Durban: Australian cricket team won the 3-match T20I series against South Africa by 3-0. The Australian cricket team is playing a cricket series on tour in South Africa. Both teams played a 3-match T20I series. Australia won the series 3-0. Next, both the teams will play a 5-match ODI series. South Africa won the toss and elected to bat in the third T20I on Sunday. The team scored 190 runs for the loss of 8 wickets in 20 overs. Henriques scored 42 runs, skipper Markram 41 runs, Stubbs 25 runs and Donovan Ferreira 48 runs (off 21 balls). Australia chased down the target of 191 runs. Matthew Short and Mitchell Marsh formed a formidable partnership with Travis Head and Josh Inglis to lose quick wickets. The two put on a partnership of 85 runs. Josh Inglis was out after scoring 42 off 22 balls. Head put on a 58-run partnership with Stoinis who followed. He was dismissed for 91 off 48 balls. Unbeaten till the end, Stoinis scored 37 runs off 21 balls. Australia scored 191 runs for the loss of 5 wickets in 17.5 overs. It won the series 3-0. Head, who batted well in the match, won the man of the match award. Australia captain Mitchell Marsh won the man of the series award.","pubDate":"2023-09-04 00:13:14","image_url":null,"source_id":"thenewsglory","source_priority":321007,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c8bd3f3849ea95cc4604ece7eee3991d","title":"Bangladesh beat Afghanistan by 89 runs in Asia Cup","link":"https://thewest.com.au/sport/cricket/bangladesh-beat-afghanistan-by-89-runs-in-asia-cup-c-11793516","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Bangladesh have joined Pakistan in the Asia Cup's Super Fours, centuries from Mehidy Hasan and Najmul Hossain Shanto earning a comfortable win over Afghanistan.","content":"Mehidy Hasan and Najmul Hossain Shanto have smashed centuries to power Bangladesh to an emphatic 89-run win over Afghanistan and seal a place in the Super Fours at the Asia Cup. Mehidy, opening for the first time since the Asia Cup final in 2018, scored 112 and Najmul continued his brilliant run of form with 104 as Bangladesh set an imposing total of 5-334 in the sweltering heat of Lahore. Bangladesh fast bowlers Taskin Ahmed (4-44) and Shoriful Islam (3-36) bagged seven wickets between them as Afghanistan were dismissed for 245 in 44.3 overs. Ibrahim Zadran (75) and captain Hashmatullah Shahidi (51) scored fighting half-centuries but Bangladesh took regular wickets before Taskin wrapped up the innings. Bangladesh, who lost their opening Group B game to Sri Lanka, are the second team to go through to the Super Fours after Pakistan qualified from Group A. Mehidy retired hurt when he hit a superb inside-out six off Mujeeb, walking off with cramp in his finger. Najmul raised his century off 101 balls before he was run out when he slipped after a reverse sweep against Mujeeb in the 45th over. Shoriful's brilliant bowling held down Afghanistan in the powerplay as the left-arm quick had danger man Rahmanullah Gurbaz trapped lbw for one in his eventful first over. Gurbaz escaped a close lbw off Shoriful when Bangladesh didn't go for a referral before he was dismissed in similar fashion later the same over. Zadran and Rahmat Shah (33) consumed too many deliveries - more than 16 overs - in a 78-run second-wicket stand against some steady Bangladesh bowling. Mushfiqur Rahim plucked a stunning one-handed catch low to his right to dismiss Zadran in the 37th over and Shahidi followed when he mistimed a big shot and was caught at third man as Afghanistan lost their last five wickets for 49 runs. Sign up for our emails","pubDate":"2023-09-03 23:49:57","image_url":"https://images.thewest.com.au/publication/C-11793516/d868ba4fff47c0d36f686a01d1048eacd713333f-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"ad7b732cae03df554c365d8209b1137f","title":"England assistant Marcus Trescothick cites World Cup 'noise' about Harry Brook after stinging defeat against New Zealand","link":"https://www.dailymail.co.uk/sport/cricket/article-12476685/England-assistant-Marcus-Trescothick-cites-World-Cup-noise-Harry-Brook-stinging-defeat-against-New-Zealand.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"England were as awful in Birmingham as they were dominant in Durham and Manchester, losing the third T20 against a motivated New Zealand by 74 runs to set up a tense series finale.","content":"England assistant Marcus Trescothick cites 'noise' about Harry Brook's potential World Cup selection affecting batsmen after stinging defeat against New Zealand England lost third T20 against a motivated New Zealand by 74 runs on Sunday Harry Brook fell short, skying leg-spinner Ish Sodhi to mid-on for eight Trescothick admitted talks of Brook’s potential selection may have played a role By Lawrence Booth for the Daily Mail Updated: 00:17 BST, 4 September 2023 e-mail 2 View comments England were as awful in Birmingham as they were dominant in Durham and Manchester, losing the third T20 against a motivated New Zealand by 74 runs to set up a tense series finale. Challenged to make an imposing 203 for victory, Jos Buttler ’s team hobbled to 128, with even Harry Brook — the man of the moment — falling short, skying leg-spinner Ish Sodhi to mid-on for eight. Buttler himself managed 40 off 21 balls, but England were off the pace in almost every respect as the tourists closed the gap to 2-1 ahead of Monday's series finale at Trent Bridge. Assistant coach Marcus Trescothick then admitted that the speculation about Brook’s potential selection for the 50-over World Cup might be playing on the minds of those in the provisional 15-man party. On this evidence, that group may include Dawid Malan and Liam Livingstone. ‘There’s no doubt, when you have that element — noise outside the changing room — you just start to question sometimes, especially if you are not playing well, of course you do,’ said Trescothick. England lost the third T20 against New Zealand by 74 runs to set up a tense series finale Man-of-the-moment Harry Brook fell short, skying leg-spinner Ish Sodhi to mid-on for eight ‘You deal with these anxieties and problems on many occasions, and you know what to do. It’s up to the individuals, with our help as coaches, to get themselves in the right frame of mind.’ If there was any glimmer to emerge, it was that England know they are in a battle after strolling to two victories. Some may argue they are also closer to working out whom to omit from their World Cup squad to accommodate Brook. Malan’s painful 11-ball two drained the life from the powerplay and took his tally from the last two games to two runs from 15 deliveries. At this rate, his half- century at Durham may not be enough to save him. For Livingstone — who bowled four overs for 55 and fell sixth ball for two — it was also a day to forget. But he was hardly alone in struggling against an accurate New Zealand attack boosted by the return of the giant Kyle Jamieson. Marcus Trescothick admitted talks of Brook’s potential selection may have played a role Will Jacks again sparkled all too briefly, before Malan’s torture ended when he carved Tim Southee to deep point. Jonny Bairstow then pulled Sodhi’s first ball to deep midwicket to depart for 12 off 16. Brook glanced his first ball for four, and was then wrongly given lbw to Sodhi after gloving a reverse-sweep. A review saved him, only for Brook to waste the reprieve by falling next delivery. Buttler miscued a heave off Mitchell Santner, and after that only Moeen Ali played with any freedom. ‘Credit to New Zealand,’ said Buttler. ‘They outplayed us. Chasing that kind of score, we needed a fast start and a good powerplay but we didn’t get any partnerships going.’ The New Zealanders’ total of 202 for five — their highest in this format against England — centred on powerful innings from Finn Allen and Glenn Phillips. From 75 for two in the 10th over, they hammered 88 off 47 balls, with Allen hitting the first three balls of Adil Rashid’s final over for six. Joss Buttler paid tribute to New Zealand as he admitted they 'outplayed' England He was eventually bowled by Luke Wood for 83 off 53, with six sixes, while Phillips was superbly yorked by Gus Atkinson in the final over for 69 off 34, with five maximums. Atkinson, who collected four wickets on debut in Manchester on Friday, was again the pick of the attack, and England underlined their preference for pace yesterday by adding Durham’s Brydon Carse to their squad for the four 50-over matches that follow this series. Rested for this game, Carse had taken four for 39 in six overs in the first two matches, and must now be considered a possibility for the World Cup. The squad may not be as set in stone as national selector Luke Wright recently suggested. Share or comment on this article: England assistant Marcus Trescothick cites World Cup 'noise' about Harry Brook after stinging defeat against New Zealand e-mail Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-03 23:17:32","image_url":"https://i.dailymail.co.uk/1s/2023/09/03/23/75020701-0-image-m-20_1693779506726.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"b4d93a62406ff74458a677c53b570e0a","title":"Cricket world mourns Heath Streak","link":"https://www.herald.co.zw/cricket-world-mourns-heath-streak/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […]","content":"LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […] Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","pubDate":"2023-09-03 22:03:54","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"7d15db8160f3ba2394262634df283258","title":"Jim ends unwanted record","link":"https://www.herald.co.zw/jim-ends-unwanted-record/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","content":"HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, it ended a 15-game drought having last netted in their 2-1 win against ZPC Kariba at the National Sports Stadium. Jim was also on target as Herentals and Ngezi Platinum drew 3-3 in the reverse fixture at the Baobab Stadium. Tino Benza’s brilliantly struck free-kick which gave Nelson Chadya no chance was enough to drown the title chasing Ngezi Platinum just moments after the restart. Victory stretched Herentals’ unbeaten run to six games and they have registered four wins during this period. Jim had failed to score when part of the starting XI and the 19-year-old ended the unwanted record on Saturday. Jim said he was excited to finally end his lengthy goal drought. “It was a big win for us and it just feels good to start scoring especially after such a long run. “The team is very motivated to play anytime and I would also prefer to face all the big club in our next games while we are still in this great form. “I was also begging to be worried with why I was failing to score every time I’m in the starting line-up, but I also want to thank my coach and teammates who kept encouraging me,” said Jim. Mutiwekuziva hailed his troop for coming to the part. “I’m very impressed with what I saw from the boys, Ngezi are a tactical side and they are really good in all the departments. “It was never going to be easy for us but the boys fought a good fight in both ends for us to down one of the title favourites. “They showed character and I’m hoping that they will continue with this form in our coming assignments. We need to collect as many points as we can. “Our game plan really worked for us because we knew that Ngezi were going go try to keep the ball, so our mission was just to hit them with counter attacks using our speedy wingers to that effect. They really struggled in containing them and that is what we did right to win the match,” said Mutiwekuziva. Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","pubDate":"2023-09-03 22:02:58","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"a11dc497af54af5bde54a226224e3aa4","title":"Arsenal leave it late to sink Man Utd, Liverpool cruise","link":"https://www.herald.co.zw/arsenal-leave-it-late-to-sink-man-utd-liverpool-cruise/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […]","content":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […] Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","pubDate":"2023-09-03 22:02:58","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"19b9f150de5380b5af9e9dc0f6131066","title":"ZC to expand stadia for 2027 World Cup","link":"https://www.herald.co.zw/zc-to-expand-stadia-for-2027-world-cup/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","content":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","pubDate":"2023-09-03 22:02:55","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"1af3793bfd2ed99a592460704c3d12f5","title":"Chicken Inn silence Highlanders","link":"https://www.herald.co.zw/chicken-inn-silence-highlanders/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Sports Reporter Highlanders . . . . . . . . . . . . . . . . . . 0 Chicken Inn . . . . . . . . . . . . . . . . . . (0) 2 LEADERS Highlanders slumped to a second successive defeat, conceding two second […]","content":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","pubDate":"2023-09-03 22:02:54","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"e7e0a28e89b334cc12d307c983ee5087","title":"Mhofu leads Warriors against Namibia","link":"https://www.herald.co.zw/mhofu-leads-warriors-against-namibia/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"By Lovemore Dube VETERAN coach Sunday “Mhofu” Chidzambwa and his technical team will be watching out for player fatigue while seeking victory as the Zimbabwe senior national soccer team takes on Namibia in a Challenge match during President Emmerson Mnangagwa’s inauguration today. Mhofu, one of Zimbabwe’s most successful soccer personalities, has been entrusted with the […]","content":"VETERAN coach Sunday “Mhofu” Chidzambwa and his technical team will be watching out for player fatigue while seeking victory as the Zimbabwe senior national soccer team takes on Namibia in a Challenge match during President Emmerson Mnangagwa’s inauguration today. Mhofu, one of Zimbabwe’s most successful soccer personalities, has been entrusted with the assignment where soccer will be one of the key entertainment bits for today’s Inauguration programme. He will be assisted by Lizwe Sweswe of Sheasham, goalkeepers’ trainer Tembo Chuma, Highlanders’ fitness coach Abraham Mbayiwa and former Gweru United striker Wonder Chaka as manager. The mix on the bench of old and tried Chidzambwa and Chuma combined with new faces of Chaka and Mbayiwa perhaps is a hint of how the Normalisation Committee and its technical committee will go about their business when they sit anytime from this week to select national teams’ coaches. Zimbabweans must brace for surprises in the new set ups yet some old horses may be retained as their experience may come in handy. Mhofu confirmed yesterday that they had hastily assembled a national team. He also spoke of the technical team he will be working with. “I have been appointed alongside Lizwe Sweswe, the FC Platinum goalkeepers’ trainer Chuma, Highlanders’ trainer Mbayiwa and Wonder Chaka. We look forward to the game. “As for the rest of the logistics we are yet to confirm through Bennedict Moyo,” said Chidzambwa. Moyo is a member of the new technical team that is assisting the Normalisation Committee led by Lincoln Mutasa. Highlanders FC defence stalwart Peter Muduhwa and skillful and slow midfielder Brighton Manhire, Chicken Inn’s outstanding utility player Sherperd Mhlanga, Godknows Murirwa of Caps United and his teammate Thulani Joseph may be affected by the fact that their teams were in action yesterday. Highlanders clashed with Chicken Inn in a Bulawayo derby at Barbourfields Stadium. Caps United were in Gweru for a bruising tie with Black Rhinos in a Harare derby played in the Midlands. Given the significance of the match, the players are expected to give it their best shot on a momentous occasion for Zimbabweans. Several Heads of State, local and international prominent personalities are expected to grace the occasion. Zimbabwe start as favourites as they are under pressure to show the nation that the 18 month break from international football did not rob players of their individual brilliance. Who ever is selected to play will want to impress as scouts want to see what is available in Zimbabwe talent wise. Simbarashe Chinani (Simba Bhora) Nelson Chadya (Ngezi Platinum Stars) Peter Muduhwa (Highlanders) Frank Makarati (Dynamos) Farai Banda (Manica Diamonds) Xolani Ndlovu (Chicken Inn) Thubelihle Jubane (Sheasham) Godknows Murwira (Caps United) Tawanda Chisi (Manica Diamonds) Sheperd Mhlanga (Chicken Inn) Mthokozisi Msebe (Bulawayo Chiefs) Brighton Manhire (Highlanders) Tanaka Shandirwa (Dynamos) Brian Banda (FC Platinum) Thulani Joseph (Caps United) Fortune Binzi (Manica Diamonds) Tinashe Balakasi (Simba Bhora) Obriel Chirinda (Bulawayo Chiefs) Walter Musona (FC Platinum) Liberty Masveure (Sheasham) Head Coach Sunday Marimo Assistant Coach Lizwe Sweswe Goalkeepers Trainer Tembo Chuma Trainer Abraham Mbayiwa Manager Wonder Chaka Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","pubDate":"2023-09-03 22:02:51","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"02a152fbe1867e63ea5173d86e060a7f","title":"Asia Cup 2023, India vs Nepal: Will rain again end up playing spoilsport?","link":"https://www.indiatoday.in/sports/cricket/story/asia-cup-2023-india-vs-nepal-will-rain-again-end-up-playing-spoilsport-in-pallekele-2430531-2023-09-04?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup 2023, India vs Nepal: Will rain again end up playing spoilsport?","content":"Listen to Story India and Nepal are all set to lock horns in the last and final match in their group in Asia Cup 2023 on Monday, September 4 at the Pallekele International Stadium. Pakistan have already made their way through to the Super Fours from their group. Hence, India's match against Nepal is a knockout affair. Earlier in Saturday, the match between India and Pakistan couldn't produce a result due to constant spells of rain in Pallekele. Since Pakistan had already won a match against Nepal by 238 runs at the Multan Cricket Stadium, they made their way through to the playoffs. India remain the favourites to become the other team from their group to qualify for the Super Fours, although one cannot undermine Nepal by any stretch of the imagination. India's batting looked a tad out of sorts in the first match when the likes of Shaheen Shah Afridi, and Naseem Shah were breathing fire. India’s bowling, however, is yet to be tested. The weather for Monday’s game doesn’t look promising by any means. There is a chance of rain throughout the day, let alone during match-time. Playing conditions will be cloudy and it would not be a surprise if the DLS Method comes into the picture. Temperatures will be around the 26-degree Celsius mark. However, if the match gets called off, India would qualify for the Super Fours. For Nepal to make their way through to the next round, they have to secure an outright win against the Men in Blue.","pubDate":"2023-09-04 01:20:36","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bc495ea6a14398cc411f268cc4f7580b","title":"SA vs AUS T20 series | Aussies whitewashed South Africa by winning the 3rd match!","link":"https://thenewsglory.com/sa-vs-aus-t20-series-aussies-whitewashed-south-africa-by-winning-the-3rd-match/","keywords":["Sports","Australia","Cricket","South Africa","T20","T20I"],"creator":["The News Glory"],"video_url":null,"description":"Durban: Australian cricket team won the 3-match T20I series against South Africa by 3-0. The Australian cricket team is playing a cricket series on tour in South Africa. Both teams played a 3-match T20I series. Australia won the series 3-0. Next, both the teams will play a 5-match ODI series. South Africa won the toss […]","content":"Durban: Australian cricket team won the 3-match T20I series against South Africa by 3-0. The Australian cricket team is playing a cricket series on tour in South Africa. Both teams played a 3-match T20I series. Australia won the series 3-0. Next, both the teams will play a 5-match ODI series. South Africa won the toss and elected to bat in the third T20I on Sunday. The team scored 190 runs for the loss of 8 wickets in 20 overs. Henriques scored 42 runs, skipper Markram 41 runs, Stubbs 25 runs and Donovan Ferreira 48 runs (off 21 balls). Australia chased down the target of 191 runs. Matthew Short and Mitchell Marsh formed a formidable partnership with Travis Head and Josh Inglis to lose quick wickets. The two put on a partnership of 85 runs. Josh Inglis was out after scoring 42 off 22 balls. Head put on a 58-run partnership with Stoinis who followed. He was dismissed for 91 off 48 balls. Unbeaten till the end, Stoinis scored 37 runs off 21 balls. Australia scored 191 runs for the loss of 5 wickets in 17.5 overs. It won the series 3-0. Head, who batted well in the match, won the man of the match award. Australia captain Mitchell Marsh won the man of the series award.","pubDate":"2023-09-04 00:13:14","image_url":null,"source_id":"thenewsglory","source_priority":321007,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c8bd3f3849ea95cc4604ece7eee3991d","title":"Bangladesh beat Afghanistan by 89 runs in Asia Cup","link":"https://thewest.com.au/sport/cricket/bangladesh-beat-afghanistan-by-89-runs-in-asia-cup-c-11793516","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Bangladesh have joined Pakistan in the Asia Cup's Super Fours, centuries from Mehidy Hasan and Najmul Hossain Shanto earning a comfortable win over Afghanistan.","content":"Mehidy Hasan and Najmul Hossain Shanto have smashed centuries to power Bangladesh to an emphatic 89-run win over Afghanistan and seal a place in the Super Fours at the Asia Cup. Mehidy, opening for the first time since the Asia Cup final in 2018, scored 112 and Najmul continued his brilliant run of form with 104 as Bangladesh set an imposing total of 5-334 in the sweltering heat of Lahore. Bangladesh fast bowlers Taskin Ahmed (4-44) and Shoriful Islam (3-36) bagged seven wickets between them as Afghanistan were dismissed for 245 in 44.3 overs. Ibrahim Zadran (75) and captain Hashmatullah Shahidi (51) scored fighting half-centuries but Bangladesh took regular wickets before Taskin wrapped up the innings. Bangladesh, who lost their opening Group B game to Sri Lanka, are the second team to go through to the Super Fours after Pakistan qualified from Group A. Mehidy retired hurt when he hit a superb inside-out six off Mujeeb, walking off with cramp in his finger. Najmul raised his century off 101 balls before he was run out when he slipped after a reverse sweep against Mujeeb in the 45th over. Shoriful's brilliant bowling held down Afghanistan in the powerplay as the left-arm quick had danger man Rahmanullah Gurbaz trapped lbw for one in his eventful first over. Gurbaz escaped a close lbw off Shoriful when Bangladesh didn't go for a referral before he was dismissed in similar fashion later the same over. Zadran and Rahmat Shah (33) consumed too many deliveries - more than 16 overs - in a 78-run second-wicket stand against some steady Bangladesh bowling. Mushfiqur Rahim plucked a stunning one-handed catch low to his right to dismiss Zadran in the 37th over and Shahidi followed when he mistimed a big shot and was caught at third man as Afghanistan lost their last five wickets for 49 runs. Sign up for our emails","pubDate":"2023-09-03 23:49:57","image_url":"https://images.thewest.com.au/publication/C-11793516/d868ba4fff47c0d36f686a01d1048eacd713333f-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"ad7b732cae03df554c365d8209b1137f","title":"England assistant Marcus Trescothick cites World Cup 'noise' about Harry Brook after stinging defeat against New Zealand","link":"https://www.dailymail.co.uk/sport/cricket/article-12476685/England-assistant-Marcus-Trescothick-cites-World-Cup-noise-Harry-Brook-stinging-defeat-against-New-Zealand.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"England were as awful in Birmingham as they were dominant in Durham and Manchester, losing the third T20 against a motivated New Zealand by 74 runs to set up a tense series finale.","content":"England assistant Marcus Trescothick cites 'noise' about Harry Brook's potential World Cup selection affecting batsmen after stinging defeat against New Zealand England lost third T20 against a motivated New Zealand by 74 runs on Sunday Harry Brook fell short, skying leg-spinner Ish Sodhi to mid-on for eight Trescothick admitted talks of Brook’s potential selection may have played a role By Lawrence Booth for the Daily Mail Updated: 00:17 BST, 4 September 2023 e-mail 2 View comments England were as awful in Birmingham as they were dominant in Durham and Manchester, losing the third T20 against a motivated New Zealand by 74 runs to set up a tense series finale. Challenged to make an imposing 203 for victory, Jos Buttler ’s team hobbled to 128, with even Harry Brook — the man of the moment — falling short, skying leg-spinner Ish Sodhi to mid-on for eight. Buttler himself managed 40 off 21 balls, but England were off the pace in almost every respect as the tourists closed the gap to 2-1 ahead of Monday's series finale at Trent Bridge. Assistant coach Marcus Trescothick then admitted that the speculation about Brook’s potential selection for the 50-over World Cup might be playing on the minds of those in the provisional 15-man party. On this evidence, that group may include Dawid Malan and Liam Livingstone. ‘There’s no doubt, when you have that element — noise outside the changing room — you just start to question sometimes, especially if you are not playing well, of course you do,’ said Trescothick. England lost the third T20 against New Zealand by 74 runs to set up a tense series finale Man-of-the-moment Harry Brook fell short, skying leg-spinner Ish Sodhi to mid-on for eight ‘You deal with these anxieties and problems on many occasions, and you know what to do. It’s up to the individuals, with our help as coaches, to get themselves in the right frame of mind.’ If there was any glimmer to emerge, it was that England know they are in a battle after strolling to two victories. Some may argue they are also closer to working out whom to omit from their World Cup squad to accommodate Brook. Malan’s painful 11-ball two drained the life from the powerplay and took his tally from the last two games to two runs from 15 deliveries. At this rate, his half- century at Durham may not be enough to save him. For Livingstone — who bowled four overs for 55 and fell sixth ball for two — it was also a day to forget. But he was hardly alone in struggling against an accurate New Zealand attack boosted by the return of the giant Kyle Jamieson. Marcus Trescothick admitted talks of Brook’s potential selection may have played a role Will Jacks again sparkled all too briefly, before Malan’s torture ended when he carved Tim Southee to deep point. Jonny Bairstow then pulled Sodhi’s first ball to deep midwicket to depart for 12 off 16. Brook glanced his first ball for four, and was then wrongly given lbw to Sodhi after gloving a reverse-sweep. A review saved him, only for Brook to waste the reprieve by falling next delivery. Buttler miscued a heave off Mitchell Santner, and after that only Moeen Ali played with any freedom. ‘Credit to New Zealand,’ said Buttler. ‘They outplayed us. Chasing that kind of score, we needed a fast start and a good powerplay but we didn’t get any partnerships going.’ The New Zealanders’ total of 202 for five — their highest in this format against England — centred on powerful innings from Finn Allen and Glenn Phillips. From 75 for two in the 10th over, they hammered 88 off 47 balls, with Allen hitting the first three balls of Adil Rashid’s final over for six. Joss Buttler paid tribute to New Zealand as he admitted they 'outplayed' England He was eventually bowled by Luke Wood for 83 off 53, with six sixes, while Phillips was superbly yorked by Gus Atkinson in the final over for 69 off 34, with five maximums. Atkinson, who collected four wickets on debut in Manchester on Friday, was again the pick of the attack, and England underlined their preference for pace yesterday by adding Durham’s Brydon Carse to their squad for the four 50-over matches that follow this series. Rested for this game, Carse had taken four for 39 in six overs in the first two matches, and must now be considered a possibility for the World Cup. The squad may not be as set in stone as national selector Luke Wright recently suggested. Share or comment on this article: England assistant Marcus Trescothick cites World Cup 'noise' about Harry Brook after stinging defeat against New Zealand e-mail Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-03 23:17:32","image_url":"https://i.dailymail.co.uk/1s/2023/09/03/23/75020701-0-image-m-20_1693779506726.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"b4d93a62406ff74458a677c53b570e0a","title":"Cricket world mourns Heath Streak","link":"https://www.herald.co.zw/cricket-world-mourns-heath-streak/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […]","content":"LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […] Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","pubDate":"2023-09-03 22:03:54","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"7d15db8160f3ba2394262634df283258","title":"Jim ends unwanted record","link":"https://www.herald.co.zw/jim-ends-unwanted-record/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","content":"HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, it ended a 15-game drought having last netted in their 2-1 win against ZPC Kariba at the National Sports Stadium. Jim was also on target as Herentals and Ngezi Platinum drew 3-3 in the reverse fixture at the Baobab Stadium. Tino Benza’s brilliantly struck free-kick which gave Nelson Chadya no chance was enough to drown the title chasing Ngezi Platinum just moments after the restart. Victory stretched Herentals’ unbeaten run to six games and they have registered four wins during this period. Jim had failed to score when part of the starting XI and the 19-year-old ended the unwanted record on Saturday. Jim said he was excited to finally end his lengthy goal drought. “It was a big win for us and it just feels good to start scoring especially after such a long run. “The team is very motivated to play anytime and I would also prefer to face all the big club in our next games while we are still in this great form. “I was also begging to be worried with why I was failing to score every time I’m in the starting line-up, but I also want to thank my coach and teammates who kept encouraging me,” said Jim. Mutiwekuziva hailed his troop for coming to the part. “I’m very impressed with what I saw from the boys, Ngezi are a tactical side and they are really good in all the departments. “It was never going to be easy for us but the boys fought a good fight in both ends for us to down one of the title favourites. “They showed character and I’m hoping that they will continue with this form in our coming assignments. We need to collect as many points as we can. “Our game plan really worked for us because we knew that Ngezi were going go try to keep the ball, so our mission was just to hit them with counter attacks using our speedy wingers to that effect. They really struggled in containing them and that is what we did right to win the match,” said Mutiwekuziva. Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","pubDate":"2023-09-03 22:02:58","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"a11dc497af54af5bde54a226224e3aa4","title":"Arsenal leave it late to sink Man Utd, Liverpool cruise","link":"https://www.herald.co.zw/arsenal-leave-it-late-to-sink-man-utd-liverpool-cruise/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […]","content":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […] Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","pubDate":"2023-09-03 22:02:58","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"19b9f150de5380b5af9e9dc0f6131066","title":"ZC to expand stadia for 2027 World Cup","link":"https://www.herald.co.zw/zc-to-expand-stadia-for-2027-world-cup/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Eddie Chikamhi Senior Sports Reporter Zimbabwe Cricket have rolled into motion the plans for the refurbishment of the iconic Harare Sports Club and Queens Sports Club in Bulawayo to boost the seating capacity of the two venues ahead of the 2027 ICC Cricket World Cup. Tavengwa Mukuhlani, who was elected unopposed for a third term […]","content":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","pubDate":"2023-09-03 22:02:55","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"1af3793bfd2ed99a592460704c3d12f5","title":"Chicken Inn silence Highlanders","link":"https://www.herald.co.zw/chicken-inn-silence-highlanders/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Sports Reporter Highlanders . . . . . . . . . . . . . . . . . . 0 Chicken Inn . . . . . . . . . . . . . . . . . . (0) 2 LEADERS Highlanders slumped to a second successive defeat, conceding two second […]","content":"Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","pubDate":"2023-09-03 22:02:54","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"e7e0a28e89b334cc12d307c983ee5087","title":"Mhofu leads Warriors against Namibia","link":"https://www.herald.co.zw/mhofu-leads-warriors-against-namibia/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"By Lovemore Dube VETERAN coach Sunday “Mhofu” Chidzambwa and his technical team will be watching out for player fatigue while seeking victory as the Zimbabwe senior national soccer team takes on Namibia in a Challenge match during President Emmerson Mnangagwa’s inauguration today. Mhofu, one of Zimbabwe’s most successful soccer personalities, has been entrusted with the […]","content":"VETERAN coach Sunday “Mhofu” Chidzambwa and his technical team will be watching out for player fatigue while seeking victory as the Zimbabwe senior national soccer team takes on Namibia in a Challenge match during President Emmerson Mnangagwa’s inauguration today. Mhofu, one of Zimbabwe’s most successful soccer personalities, has been entrusted with the assignment where soccer will be one of the key entertainment bits for today’s Inauguration programme. He will be assisted by Lizwe Sweswe of Sheasham, goalkeepers’ trainer Tembo Chuma, Highlanders’ fitness coach Abraham Mbayiwa and former Gweru United striker Wonder Chaka as manager. The mix on the bench of old and tried Chidzambwa and Chuma combined with new faces of Chaka and Mbayiwa perhaps is a hint of how the Normalisation Committee and its technical committee will go about their business when they sit anytime from this week to select national teams’ coaches. Zimbabweans must brace for surprises in the new set ups yet some old horses may be retained as their experience may come in handy. Mhofu confirmed yesterday that they had hastily assembled a national team. He also spoke of the technical team he will be working with. “I have been appointed alongside Lizwe Sweswe, the FC Platinum goalkeepers’ trainer Chuma, Highlanders’ trainer Mbayiwa and Wonder Chaka. We look forward to the game. “As for the rest of the logistics we are yet to confirm through Bennedict Moyo,” said Chidzambwa. Moyo is a member of the new technical team that is assisting the Normalisation Committee led by Lincoln Mutasa. Highlanders FC defence stalwart Peter Muduhwa and skillful and slow midfielder Brighton Manhire, Chicken Inn’s outstanding utility player Sherperd Mhlanga, Godknows Murirwa of Caps United and his teammate Thulani Joseph may be affected by the fact that their teams were in action yesterday. Highlanders clashed with Chicken Inn in a Bulawayo derby at Barbourfields Stadium. Caps United were in Gweru for a bruising tie with Black Rhinos in a Harare derby played in the Midlands. Given the significance of the match, the players are expected to give it their best shot on a momentous occasion for Zimbabweans. Several Heads of State, local and international prominent personalities are expected to grace the occasion. Zimbabwe start as favourites as they are under pressure to show the nation that the 18 month break from international football did not rob players of their individual brilliance. Who ever is selected to play will want to impress as scouts want to see what is available in Zimbabwe talent wise. Simbarashe Chinani (Simba Bhora) Nelson Chadya (Ngezi Platinum Stars) Peter Muduhwa (Highlanders) Frank Makarati (Dynamos) Farai Banda (Manica Diamonds) Xolani Ndlovu (Chicken Inn) Thubelihle Jubane (Sheasham) Godknows Murwira (Caps United) Tawanda Chisi (Manica Diamonds) Sheperd Mhlanga (Chicken Inn) Mthokozisi Msebe (Bulawayo Chiefs) Brighton Manhire (Highlanders) Tanaka Shandirwa (Dynamos) Brian Banda (FC Platinum) Thulani Joseph (Caps United) Fortune Binzi (Manica Diamonds) Tinashe Balakasi (Simba Bhora) Obriel Chirinda (Bulawayo Chiefs) Walter Musona (FC Platinum) Liberty Masveure (Sheasham) Head Coach Sunday Marimo Assistant Coach Lizwe Sweswe Goalkeepers Trainer Tembo Chuma Trainer Abraham Mbayiwa Manager Wonder Chaka Sports Reporter FORMER Zimbabwe cricket star Heath Streak has died at the age of 49 after a battle with colon and liver cancer, his family have confirmed. Heath’s wife Nadine shared the tragic news on social media, saying their souls would be “joined for eternity.” His passing comes days after false reports claimed the former […] LONDON. — Goals deep in stoppage time by record signing Declan Rice and Gabriel Jesus earned Arsenal a sensational 3-1 victory over Manchester United in the Premier League yesterday. At Anfield, Dominik Szoboszlai scored his first goal for Liverpool and Mohamed Salah netted his seventh in seven games against Aston Villa as the hosts eased […] Bruce Chikuni HERENTALS forward, Tafadzwa Jim, finally found the target having started a Castle Lager Premiership match as his side laboured to a 2-1 victory over Ngezi Platinum Stars at Mandava on Saturday. His glancing header early in the game gave Herentals the lead and took his tally to five goals this season. More significantly, […]","pubDate":"2023-09-03 22:02:51","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"}]}