{"newsArray":[{"title":"Cricket-Australia fast bowler Hazlewood to miss second Ashes test","link":"https://www.thestar.com.my/sport/cricket/2021/12/13/cricket-australia-fast-bowler-hazlewood-to-miss-second-ashes-test","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - Australia fast bowler Josh Hazlewood will miss the second Ashes test in Adelaide with a side injury, Cricket Australia said on Monday. Read full story","content":null,"pubDate":"2021-12-12 23:40:00","full_description":"MELBOURNE (Reuters) - Australia fast bowler Josh Hazlewood will miss the second Ashes test in Adelaide with a side injury, Cricket Australia said on Monday. Hazlewood's injury during the nine-wicket win over England at the Gabba opens the door for Jhye Richardson or Michael Neser to bowl for Australia at Adelaide Oval. Hazlewood bowled sparingly during England's second innings of the series-opener and headed home to Sydney for scans on Sunday rather than travel with the team to Adelaide. The second pink ball test starts Thursday. CA said a decision on Hazlewood's fitness for the third Boxing Day test in Melbourne from Dec. 26 would be made after further assessment and rehab. Selectors will not add any replacements for Hazlewood to the current squad and will instead pick a new squad after Adelaide, CA added. Two-test paceman Richardson is seen as the frontrunner to bowl at Adelaide, though uncapped Queensland veteran Neser put up his hand with a five-wicket innings haul for Australia 'A' against the England Lions last week in Brisbane. Australia, who retained the urn in England in 2019, lead the five-test Ashes 1-0. (Reporting by Ian Ransom; Editing by Toby Davis)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/13/1404010.jpg","source_id":"thestar_my"},{"title":"Stars led by Russel sink Thunder","link":"https://www.news.com.au/sport/cricket/stars-led-by-russel-sink-thunder/video/49f6e288e970e2598d83bd30542076fc","keywords":null,"creator":null,"video_url":null,"description":"Cricket: The Melbourne Stars have defeated the Sydney Thunder once again after a huge performance from Andre Russell.","content":null,"pubDate":"2021-12-12 22:20:08","full_description":null,"image_url":null,"source_id":"news"},{"title":"Stars led by Russel sink Thunder","link":"https://www.cairnspost.com.au/sport/cricket/stars-led-by-russel-sink-thunder/video/49f6e288e970e2598d83bd30542076fc","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The Melbourne Stars have defeated the Sydney Thunder once again after a huge performance from Andre Russell.","content":null,"pubDate":"2021-12-12 22:20:08","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Cricket-England&#039;s Broad and Anderson fit for Adelaide test, says Silverwood","link":"https://www.thestar.com.my/sport/cricket/2021/12/13/cricket-england039s-broad-and-anderson-fit-for-adelaide-test-says-silverwood","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England fast bowlers Stuart Broad and James Anderson are fit and available for the second Ashes test against Australia in Adelaide, head coach Chris Silverwood said on Sunday. Read full story","content":null,"pubDate":"2021-12-12 19:07:00","full_description":"(Reuters) - England fast bowlers Stuart Broad and James Anderson are fit and available for the second Ashes test against Australia in Adelaide, head coach Chris Silverwood said on Sunday. Broad and Anderson share 1,156 test wickets between them but they were rested for the opening test in Gabba, which England lost https://www.reuters.com/lifestyle/sports/milestone-man-lyon-spins-australia-thumping-ashes-win-2021-12-11 by nine wickets to trail 1-0 in the five-match series. The second match, a day-night contest, starts on Thursday at Adelaide Oval. \"They are available, yes,\" Silverwood told British media on Sunday. \"Jimmy will be fit and ready to go for the second test, as will Stuart. (But) I have not told anyone they are playing yet. \"The guys have already been training with the pink ball behind the scenes. And what we have got is a very skilful set of bowlers. \"We have talent and we still have two of the best up our sleeve as well.\" Australia have won every day-night test they have played, including the last Ashes clash in Adelaide during the 2017/18 series. But the hosts also have some injury concerns ahead of the second test, with paceman Josh Hazlewood doubtful due to a side strain and opener David Warner struggling with bruised ribs. (Reporting by Manasi Pathak in Bengaluru; editing by Clare Fallon)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/13/1403949.jpg","source_id":"thestar_my"},{"title":"“He led from the front every time”: Rohit Sharma praises Virat Kohli after replacing him as Team India ODI captain","link":"https://thesportsrush.com/cricket-news-he-led-from-the-front-every-time-rohit-sharma-praises-virat-kohli-after-replacing-him-as-team-india-odi-captain/","keywords":["Cricket","BCCI","Rohit Sharma","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Rohit Sharma praises Virat Kohli and his legacy as India’s White ball captain post replacing him as the Indian team captain in ODI format. The supposed ouster of Virat Kohli as Team India’s ODI captain has opened the floodgates for discussions and debates around the BCCI’s decision on the matter. While a huge section of… The post “He led from the front every time”: Rohit Sharma praises Virat Kohli after replacing him as Team India ODI captain appeared first on The SportsRush.","content":"Rohit Sharma praises Virat Kohli and his legacy as India’s White ball captain post replacing him as the Indian team captain in ODI format. The supposed ouster of Virat Kohli as Team India’s ODI captain has opened the floodgates for discussions and debates around the BCCI’s decision on the matter. While a huge section of fans and some experts have been rallying behind Rohit Sharma as Team India’s skipper in the White format altogether, the manner in which he was alleviated to the post or rather Kohli was removed as the ODI skipper raised quite a many eyebrows. The BCCI, in its press release merely mentioned the fact that Rohit Sharma has been appointed as the team’s new ODI skipper, without citing the reason(s) for Kohli’s removal from the post, or an official statement from Kohli himself on the same. Not until after almost 24 hours of all the confusion and drama, BCCI president Sourav Ganguly did finally shed light on the reason for the move, and why he (and the BCCI) felt India could not go on with two captains in the limited Overs format. There is still not a word from Kohli yet. However, Rohit Sharma, all set to tour South Africa as skipper of the ODI format, did speak on his predecessor over what he has brought to the table over the years as captain of the Indian Cricket team in all formats of the game. Rohit Sharma praises Virat Kohli and his legacy as India’s White ball captain During an interview with the BCCI post being appointed as team India’s new White ball captain, Rohit Sharma shed light on the legacy of the invaluable 5 years of Virat Kohli as team India’s captain in the 50-Over format. In addition to his ‘grit and determination to win every game’- the message which Kohli has sent to the entire team all these years, Rohit exclaimed he enjoyed each and every moment he played with him and would continue to do so in the future. “He’s put the team in a situation where there is no looking back. Those five years that he has led the team, he has led from the front every time; there was clear grit and determination to win every game; that was the message to the entire squad and we had a great time playing under him. I have played a lot of Cricket with him and have enjoyed each and every moment, and will continue to do that,” exclaimed Rohit Sharma. Rohit also remarked on the ICC trophy drought team India has had since 2013, when they has last won a major ICC trophy- the ICC Champions Trophy under then skipper MS Dhoni. He opined that winning championships is imperative but there is a process that the team needs to follow as a group. The message he would like to give to the boys as the skipper would be to tick the small boxes initially, and then focus on the end result. “The pressure will always be there. As a cricketer, it is important to focus on my job.” SPECIAL – @ImRo45‘s first interview after being named #TeamIndia’s white-ball captain coming up on https://t.co/Z3MPyesSeZ. Stay tuned for this feature pic.twitter.com/CPB0ITOBrv — BCCI (@BCCI) December 12, 2021 Team India is set to tour South Africa for a 3-match Test series starting with the Boxing Day Test at Centurion followed by an equal number of ODIs beginning January 19, 2022.       The post “He led from the front every time”: Rohit Sharma praises Virat Kohli after replacing him as Team India ODI captain appeared first on The SportsRush.","pubDate":"2021-12-12 18:50:44","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Venkatesh Iyer Vijay Hazare Trophy 2021: Venkatesh Iyer imitates Rajnikant after scoring century vs Chandigarh in Vijay Hazare Trophy 2021-22","link":"https://thesportsrush.com/cricket-news-venkatesh-iyer-vijay-hazare-trophy-2021-venkatesh-iyer-imitates-rajnikant-after-scoring-century-vs-chandigarh-in-vijay-hazare-trophy-2021-22/","keywords":["Cricket","Madhya Pradesh vs Chandigarh","Venkatesh Iyer","Vijay Hazare Trophy 2021-22"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Venkatesh Iyer Vijay Hazare Trophy 2021: Venkatesh Iyer imitates Rajnikant on latter’s birthday after smashing a ton versus Chandigarh. Continuing with his purple patch in franchise, International and now in the domestic circuit, star Madhya Pradesh all rounder Venkatesh Iyer smashed yet another century, against the opposition Chandigarh this time around during the ongoing Vijay… The post Venkatesh Iyer Vijay Hazare Trophy 2021: Venkatesh Iyer imitates Rajnikant after scoring century vs Chandigarh in Vijay Hazare Trophy 2021-22 appeared first on The SportsRush.","content":"Venkatesh Iyer Vijay Hazare Trophy 2021: Venkatesh Iyer imitates Rajnikant on latter’s birthday after smashing a ton versus Chandigarh. Continuing with his purple patch in franchise, International and now in the domestic circuit, star Madhya Pradesh all rounder Venkatesh Iyer smashed yet another century, against the opposition Chandigarh this time around during the ongoing Vijay Hazare Trophy 2021-22. During round 4 of Elite Group D match against Chandigarh at the Saurashtra Cricket Association stadium in Rajkot, Iyer’s sublime knock of 151 off 113 deliveries coming in at the no.6 batting position was the talk amongst the Cricketing fraternity. His stellar knock was instrumental in Madhya Pradesh’s victory as they prevailed by 5 runs after posting 331/9 in their 50 Overs. However, the manner in which he celebrated post smashing his ton, was all the more eye-catching. ALSO WATCH: Virat Kohli trolls David Warner after he swaps faces with Allu Arjun Venkatesh Iyer Vijay Hazare Trophy 2021: Venkatesh Iyer imitates Rajnikant on latter’s birthday Post scoring his century, Iyer paid a special tribute to Rajinikanth by pulling off his iconic and famous salute. It is worth mentioning that Tamil cinema superstar Rajinikanth was celebrating his 71st birthday on Sunday, and the 26-year-old couldn’t have come up with a better gesture as a lovely tribute to his favourite actor. The BCCI as well as his Indian Premier League franshise Kolkata Knight Riders shared the clip of his celebratory gesture via their social media handles. 1⃣0⃣0⃣ up & going strong! @ivenkyiyer2512 continues his superb run of form. #MPvUTCA #VijayHazareTrophy pic.twitter.com/iiow2ATC2n — BCCI Domestic (@BCCIdomestic) December 12, 2021 Our Sunday couldn’t get any better! Can you decode @ivenkyiyer2512‘s celebration? #VijayHazareTrophy #MPvUTCA #KKR #AmiKKR #CricketTwitterpic.twitter.com/7wpLMKEJ44 — KolkataKnightRiders (@KKRiders) December 12, 2021 Having already scored a century (112 off 84 deliveries) against Kerala and a 71 off 49 deliveries against Uttarakhand, today’s knock by the Southpaw is a further testament on the kind of form he is in currently. Iyer had recently made his debut for team India during the 3-match T20I series against New Zealand in November. He was also retained by KKR for a whopping sum of INR 8 Crore ahead of the IPL 2022 mega auction.         The post Venkatesh Iyer Vijay Hazare Trophy 2021: Venkatesh Iyer imitates Rajnikant after scoring century vs Chandigarh in Vijay Hazare Trophy 2021-22 appeared first on The SportsRush.","pubDate":"2021-12-12 17:31:32","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"“Ben Stokes is not a messiah”: Geoffrey Boycott slams Ben Stokes after poor show in first Ashes Test at The Gabba in Brisbane","link":"https://thesportsrush.com/cricket-news-ben-stokes-is-not-a-messiah-geoffrey-boycott-slams-ben-stokes-after-poor-show-in-first-ashes-test-at-the-gabba-in-brisbane/","keywords":["Cricket","Ashes 2021-22","Australia vs England","Ben Stokes","Geoffrey Boycott"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Geoffrey Boycott slams Ben Stokes after a poor outing with with both bat and ball in the first Ashes 2021-22 Test match at The Gabba. Former England player Geoffrey Boycott came down heavily on star England all rounder Ben Stokes after latter’s humbling outing in the first Ashes Test at The Gabba. Stokes had a… The post “Ben Stokes is not a messiah”: Geoffrey Boycott slams Ben Stokes after poor show in first Ashes Test at The Gabba in Brisbane appeared first on The SportsRush.","content":"Geoffrey Boycott slams Ben Stokes after a poor outing with with both bat and ball in the first Ashes 2021-22 Test match at The Gabba. Former England player Geoffrey Boycott came down heavily on star England all rounder Ben Stokes after latter’s humbling outing in the first Ashes Test at The Gabba. Stokes had a pretty ordinary return to International Cricket, as he failed to impress with both bat and ball during England’s one-sided 9-wicket defeat which lasted for mere 3 1/2 days. He returned with scores of 5 and 14 in the two innings and went wicketless in the 12 Overs he bowled in the first innings, conceding runs at an average of 5.4 per Over. Geoffrey Boycott slams Ben Stokes Former England player and renowned commentator Geoffrey Boycott has slammed the Southpaw all rounder and came down heavily on all the hype created around him in the build-up of Ashes 2021-22. Expressing his views while writing for The Telegraph, Boycott exclaimed that too much of an over-reliance on Stokes is doing the English side no good and that other players need to step up big time. “Ben Stokes needed to play more cricket. All the hype that he’s back and what he brings to the dressing room is b***s**t. He is not a messiah. He can’t bat and bowl for everyone. Ben hasn’t played for five months, had a finger operation and rain ruined his practice. Then his first knock was on a testing pitch against, in my view, the two best seam bowlers in the world – Pat Cummins and Josh Hazlewood,” Boycott wrote in his column for The Telegraph. It is worth of a mention that this was Stokes’ return to International Cricket after five months, as he took a break from Cricket over personal ‘mental well-being concerns’ and an injured finger which recently got operated. He had also mentioned a scaring experience he had gone through during his recovery process. He clearly looked out of sorts, especially with the ball in hand, as he bowled a total of 14 No-Balls which amusingly went unnoticed due to a technical glitch from the broadcaster’s end and lack of proper communication between the officials concerned. Boycott further expressed his amusement over the expectation of a magical performance out of the Blue immediately after his return. “That would be tough for any batsman in good form. Too many players expected some magic from our talismanic all-rounder. His second innings dismissal showed his lack of cricket as he got in a tangle with a bit of bounce. In good nick, there is every chance he would have played it differently.” he further added. Pat Cummins with an absolute beauty to remove Ben Stokes. pic.twitter.com/FSPE4ew103 — Mufaddal Vohra (@mufaddal_vohra) December 8, 2021 For more Cricket related news, click here.     The post “Ben Stokes is not a messiah”: Geoffrey Boycott slams Ben Stokes after poor show in first Ashes Test at The Gabba in Brisbane appeared first on The SportsRush.","pubDate":"2021-12-12 16:24:22","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Rohit Sharma Uses Cricket Analogy To Sum Up Max Verstappen's Dramatic F1 World Title Win - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMigQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9mb3JtdWxhLTEvcm9oaXQtc2hhcm1hLXVzZXMtY3JpY2tldC1hbmFsb2d5LXRvLXN1bS11cC1tYXgtdmVyc3RhcHBlbnMtZHJhbWF0aWMtZjEtd29ybGQtdGl0bGUtd2luLTI2NDc5NDPSAYcBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vZm9ybXVsYS0xL3JvaGl0LXNoYXJtYS11c2VzLWNyaWNrZXQtYW5hbG9neS10by1zdW0tdXAtbWF4LXZlcnN0YXBwZW5zLWRyYW1hdGljLWYxLXdvcmxkLXRpdGxlLXdpbi0yNjQ3OTQzL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma Uses Cricket Analogy To Sum Up Max Verstappen's Dramatic F1 World Title Win  NDTVSports.comRed Bull's Max Verstappen wins Abu Dhabi Grand Prix, clinches F1 championship with last lap move  Times of India\"I know how it feels to be treated horribly\": Boxing heavyweight champion Tyson Fury's advice for Max Verstappen  SportskeedaAbu Dhabi Grand Prix HIGHLIGHTS, Formula 1: Red Bull's Max Verstappen Pips Mercedes' Lewis Hamilton In Thriller To Win Maiden Title  NDTVSports.comIt's 1-0 to Red Bull, says Mercedes F1 boss Toto Wolff | Racing News  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2021-12-12 15:41:23","image_url":null,"source_id":"google"},{"title":"Rohit Uses Cricket Analogy To Sum Up Verstappen's Dramatic F1 Title Win","link":"https://sports.ndtv.com/formula-1/rohit-sharma-uses-cricket-analogy-to-sum-up-max-verstappens-dramatic-f1-world-title-win-2647943","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma used a cricket analogy to describe Max Verstappen's dramatic F1 world championship title win in Abu Dhabi on Sunday.","content":null,"pubDate":"2021-12-12 15:36:02","full_description":"Red Bull's Max Verstappen won the Formula 1 world championship title in the most dramatic of circumstances on Sunday as he rode his luck to overtake Lewis Hamilton in the last lap of the Abu Dhabi Grand Prix on Sunday. With Hamilton leading comfortably in the final few laps of the season-ending race, Nicholas Latifi of Williams crashed towards the end. This saw the safety car being brought in, which allowed Verstappen to close the gap on Hamilton. The lapped cars were then allowed to overtake the safety car just before it was taken off, allowing Verstappen to start the final lap almost alongside Hamilton. Taking advantage of his faster tyres, Verstappen comfortably overtook Hamilton and sealed victory to pip Hamilton to the world championship title. This was Verstappen's maiden title. He also became the first ever Dutch driver to secure the world championship. Rohit Sharma, captain of the Indian cricket team in limited-over internationals, seemed thrilled by the dramatic end to the race. To sum up his thoughts on the race's sensational final lap, Rohit took to Twitter on Sunday evening. The opening batter used a cricket analogy to describe Verstappen's victory, saying it was akin to a batter winning a game with a last-ball six. \"1 ball 6 required and guess what, Max Verstappen hits it. Unbelievable win #AbuDhabiGP #F1TitleChampionship,\" Rohit wrote on his Twitter account. 1 ball 6 required and guess what, Max Verstappen hits it. Unbelievable win #AbuDhabiGP #F1TitleChampionship Earlier in Sunday's race, Hamilton overtook Verstappen at the very beginning and took a comfortable lead. Promoted However, having pitted early in the race, Hamilton's tyres wore out towards the end. The British driver was still in a comfortable position before Latifi's crash allowed Verstappen to close in due to safety car regulations and then seal victory with a final-lap overtake.","image_url":"https://c.ndtvimg.com/2021-12/rd55vs9o_max-verstappen-afp_625x300_12_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Pakistan vs West Indies T20 2021: Pakistan and West Indies squad for T20I and ODI series 2021","link":"https://thesportsrush.com/cricket-news-pakistan-vs-west-indies-t20-2021-pakistan-and-west-indies-squad-for-t20i-and-odi-series-2021/","keywords":["Cricket","Pakistan vs West Indies","West Indies tour of Pakistan 2021"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Pakistan vs West Indies T20 2021: Pakistan and West Indies squad for T20I and ODI; Windies to play on Pakistan soil with big names missing. The West Indies tour of Pakistan is in all readiness to commence on Monday with a three-match T20I series followed by as many ODI matches in the port city of… The post Pakistan vs West Indies T20 2021: Pakistan and West Indies squad for T20I and ODI series 2021 appeared first on The SportsRush.","content":"Pakistan vs West Indies T20 2021: Pakistan and West Indies squad for T20I and ODI; Windies to play on Pakistan soil with big names missing. The West Indies tour of Pakistan is in all readiness to commence on Monday with a three-match T20I series followed by as many ODI matches in the port city of Karachi. All the six matches will take place at the National Stadium in Karachi, with the tour opener to take place on December 13 with the first of the three T20 Internationals. ALSO READ: West Indies tour of Pakistan live streaming details. The imminent limited Overs series is of utmost significance given the harsh treatment meted out to the Pakistan Cricket Board (PCB) and Pakistan fans prior to the 2021 T20 World Cup wherein New Zealand, and a week later England decided not to go ahead with their respective White ball series tours. While the New Zealand camp pulled out in the eleventh hour of the start of the first ODI in September citing a possible security threat, England followed suit by postponing the series (both men’s and women’s) due to concerns over “mental and physical wellbeing” of its players. While New Zealand had quit their first tour to the country in 18 years, it would have been the first tour of Pakistan by an England women’s team in its history and the first by their male counterparts since 2005. Coming back to the imminent series, this would be West Indies’ first visit to Pakistan since 2018. During their last tour to Pakistan the Windies side were decimated by Pakistan 3-0 in the three match T20I series. Team Pakistan, on the other hand, are high on confidence ever since their successful T20 World Cup campaign, followed by a clean sweep against Bangladesh in the recently concluded T2oI and Test series. Pakistan vs West Indies T20 2021: Pakistan and West Indies squad for T20I and ODI Team West Indies, would be without their T20I regulars in Evin Lewis, Shimron Hetmyer, Andre Russell and Lendl Simmons- all opting out due to personal reasons. Former skipper Jason Holder is being rested, while Fabian Allen and Obed McCoy are out because of injuries. Last week captain Kieron Pollard also withdrew through a hamstring injury, leaving the Twenty20 leadership to Nicholas Pooran and ODIs to Shai Hope. Pakistan, having rotated their players in their recently concluded T20I series, are back to full strength, albeit with big names like Shoaib Malik, Imad Wasim and Hasan Ali missing. Pakistan full squad T20Is: Babar Azam (c), Shadab Khan (vc), Asif Ali, Fakhar Zaman, Haider Ali, Haris Rauf, Iftikhar Ahmed, Khushdil Shah, Mohammad Hasnain, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim Jr, Shaheen Shah Afridi, Shahnawaz Dahani, Usman Qadir. ODIs: Babar Azam (c), Shadab Khan (vc), Asif Ali, Fakhar Zaman, Haider Ali, Haris Rauf, Iftikhar Ahmed, Imam-ul-Haq, Khushdil Shah, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim Jr, Mohammad Hasnain, Saud Shakeel, Shaheen Shah Afridi, Shahnawaz Dahani Usman Qadir. West Indies full squad: Roston Chase, Kyle Mayers and Sheldon Cottrell to miss T20I series due to COVID-19 Following PCR tests administered on arrival in Pakistan, Cricket West Indies (CWI) have confirmed that three players from the West Indies squad- all-rounders Roston Chase and Kyle Mayers, and left-arm pacer Sheldon Cottrell have tested positive for COVID-19 and will therefore be unavailable to participate in the upcoming Pakistan series. West Indies Full Squads T20Is: Brandon King, Shai Hope, Darren Bravo, Nicholas Pooran (capt, wk), Rovman Powell, Romario Shepherd, Odean Smith, Dominic Drakes, Akeal Hosein, Hayden Walsh Jr, Oshane Thomas, Roston Chase, Sheldon Cottrell, Kyle Mayers, Gudakesh Motie. ODIs: Shai Hope (c), Darren Bravo, Shamarh Brooks, Roston Chase, Justin Greaves, Akeal Hosein, Alzarri Joseph, Gudakesh Motie, Anderson Phillip, Nicholas Pooran, Raymon Reifer, Romario Shepherd, Odean Smith, Hayden Walsh Jr.         The post Pakistan vs West Indies T20 2021: Pakistan and West Indies squad for T20I and ODI series 2021 appeared first on The SportsRush.","pubDate":"2021-12-12 15:18:12","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Watch: Rohit Sharma Speaks On \"High Pressure\" India Captaincy Role - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvcm9oaXQtc2hhcm1hLXNwZWFrcy1vbi1oaWdoLXByZXNzdXJlLWluZGlhLWNhcHRhaW5jeS1yb2xlLXdhdGNoLTI2NDc4MjLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Rohit Sharma Speaks On \"High Pressure\" India Captaincy Role  NDTV Sports‘I have said it a million times. Talks outside are immaterial’: Rohit opens up after becoming India's white-ball captain  Hindustan TimesRavichandran Ashwin is Definitely Here to Stay in White-Ball Cricket: Rohit Sharma  News18‘He’s definitely here to stay’ – Rohit Sharma lauds Ravi Ashwin for lending Team India flexibility in white-ball cricket  CricTrackerIndia Tour of South Africa 2021-22: Rohit Sharma Heaps Praises on Ravichandran Ashwin; Calls Him Versatile  India.comView Full coverage on Google News","content":null,"pubDate":"2021-12-12 13:46:08","image_url":null,"source_id":"google"},{"title":"Viral: Watch MS Dhoni's 91-run innings in 2011 World Cup final in under three minutes","link":"https://zeenews.india.com/cricket/viral-watch-ms-dhonis-91-run-innings-in-2011-world-cup-final-in-under-three-minutes-2418676.html","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team fans still have not forgotten MS Dhoni's 91-run knock against Sri Lanka in the ODI World Cup final.","content":null,"pubDate":"2021-12-12 13:41:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"New ODI Skipper Rohit Sharma's Message to Team: 'Those Outside Talks Are Immaterial' - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMihQFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvbmV3LW9kaS1za2lwcGVyLXJvaGl0LXNoYXJtYXMtbWVzc2FnZS10by10ZWFtLXRob3NlLXRhbGtzLW91dHNpZGUtYXJlLWltbWF0ZXJpYWwtNDU0NzA3NS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"New ODI Skipper Rohit Sharma's Message to Team: 'Those Outside Talks Are Immaterial'  News18‘I have said it a million times. Talks outside are immaterial’: Rohit opens up after becoming India's white-ball captain  Hindustan TimesRavichandran Ashwin is Definitely Here to Stay in White-Ball Cricket: Rohit Sharma  News18Watch: Rohit Sharma Speaks On \"High Pressure\" India Captaincy Role  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-12 13:29:29","image_url":null,"source_id":"google"},{"title":"‘I have said it a million times. Talks outside are immaterial’: Rohit opens up after becoming India's white-ball captain - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMitwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pLWhhdmUtc2FpZC1pdC1hLW1pbGxpb24tdGltZXMtdGFsa3Mtb3V0c2lkZS1hcmUtaW1tYXRlcmlhbC1yb2hpdC1zaGFybWEtb3BlbnMtdXAtYWZ0ZXItYmVjb21pbmctaW5kaWEtcy13aGl0ZS1iYWxsLWNhcHRhaW4tMTAxNjM5MzEyODg5Mzc4Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘I have said it a million times. Talks outside are immaterial’: Rohit opens up after becoming India's white-ball captain  Hindustan TimesWatch: Rohit Sharma Speaks On \"High Pressure\" India Captaincy Role  NDTV SportsRavichandran Ashwin is Definitely Here to Stay in White-Ball Cricket: Rohit Sharma  News18India Tour of South Africa 2021-22: Rohit Sharma Heaps Praises on Ravichandran Ashwin; Calls Him Versatile  India.com‘He’s definitely here to stay’ – Rohit Sharma lauds Ravi Ashwin for lending Team India flexibility in white-ball cricket  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2021-12-12 12:53:42","image_url":null,"source_id":"google"},{"title":"Shane Warne Picks His Top 5 Current Test Batters, Names 1 Indian In List - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMib2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvc2hhbmUtd2FybmUtcGlja3MtaGlzLXRvcC01LWN1cnJlbnQtdGVzdC1iYXR0ZXJzLW5hbWVzLTEtaW5kaWFuLWluLWxpc3QtMjY0Nzc1NdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne Picks His Top 5 Current Test Batters, Names 1 Indian In List  NDTV Sports'Virat Kohli has dropped off a little': Shane Warne names his top-5 Test batters; one Indian in list  Hindustan TimesNo Rohit Sharma! Only 1 Indian makes Shane Warne's list of top-5 Test batters  Times NowAussie legend Shane Warne names his five best Test batters in world cricket today  CricketTimes.comShane Warne Picks Top-5 Test Batters in Modern Day Cricket, Virat Kohli Not Included in Top Three  India.comView Full coverage on Google News","content":null,"pubDate":"2021-12-12 12:30:38","image_url":null,"source_id":"google"},{"title":"Shane Warne Picks His Top 5 Current Test Batters, Names 1 Indian In List","link":"https://sports.ndtv.com/cricket/shane-warne-picks-his-top-5-current-test-batters-names-1-indian-in-list-2647755","keywords":null,"creator":null,"video_url":null,"description":"Legendary Australia spinner Shane Warne named his top five current batters in Test cricket and included one player from India in the list.","content":null,"pubDate":"2021-12-12 12:30:38","full_description":"Legendary Australia spinner Shane Warne has named his top five current batters in Test cricket. In Warne's list, Australia vice-captain Steve Smith is at the top, followed by England Test skipper Joe Root and New Zealand captain Kane Williamson. \"I've got Steve Smith. In all conditions and against all bowling attacks for a long period of time, Smith is outstanding. Joe Root is number two; he has made six hundreds in this calendar year. Kane Williamson is always in thereabouts,\" said Warne in a video uploaded on Instagram by Fox Cricket . The former leg-spinner also included India's Test captain captain Virat Kohli as his fourth-best batter in the format while Australia's young middle-order batter Marnus Labuschagne made it to the number five spot in Warne's list. \"Virat Kohli has just dropped off a little bit, and then Marnus (Labuschagne) rounds up the top 5 for me,\" added Warne. Kohli hasn't scored an international hundred since 2019 and 2021 has been among his best years as a batter and captain. Earlier this year, the 33-year-old had stepped down as India's T20I captain. He was later removed as ODI skipper, with the BCCI naming Rohit Sharma full-time limited-over captain. Promoted However, Kohli will continue to lead India in Test cricket, where he is the country's most successful skipper with 39 wins. Kohli is also the all-time third most successful Test captain when it comes to the number of wins. South Africa's Graeme Smith leads that table with 53 wins, followed by Australia's Ricky Ponting with 48 victories.","image_url":"https://c.ndtvimg.com/2021-11/hdu1222_shane-warne_650x400_29_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Ashes: Australia's Hazlewood returns home, doubtful for Adelaide Test","link":"https://sportstar.thehindu.com/cricket/australia-hazlewood-returns-home-doubtful-adelaide-test-ashes-2021/article37938837.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Australia pace bowler Josh Hazlewood is doubtful for the second Test against England with a side strain and has returned home, Cricket Australia said on Sunday.","content":null,"pubDate":"2021-12-12 12:18:22","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Hazlewood set to miss second Ashes test","link":"https://www.news.com.au/sport/cricket/hazlewood-set-to-miss-second-ashes-test/video/23dade6f03e5f50ade07a50e829100e6","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Josh Hazlewood is set to be ruled out of the second Ashes Test, meaning Australia will have to make changes to their super-squad line-up that smashed England in the first test.","content":null,"pubDate":"2021-12-12 12:16:06","full_description":null,"image_url":null,"source_id":"news"},{"title":"Hazlewood set to miss second Ashes test","link":"https://www.cairnspost.com.au/sport/cricket/hazlewood-set-to-miss-second-ashes-test/video/23dade6f03e5f50ade07a50e829100e6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Josh Hazlewood is set to be ruled out of the second Ashes Test, meaning Australia will have to make changes to their super-squad line-up that smashed England in the first test.","content":null,"pubDate":"2021-12-12 12:16:06","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Gautam Gambhir BREAKS silence over Rohit Sharma replacing Virat Kohli as ODI captain","link":"https://zeenews.india.com/cricket/gautam-gambhir-breaks-silence-over-rohit-sharma-replacing-virat-kohli-as-odi-captain-2418657.html","keywords":null,"creator":null,"video_url":null,"description":"Former India batter and 2011 World Cup hero Gautam Gambhir said that the split captaincy is good for Indian cricket and it will give Rohit Sharma more time to groom the white-ball team.","content":null,"pubDate":"2021-12-12 12:16:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Cricket-Australia&#039;s Hazlewood returns home, doubtful for Adelaide test","link":"https://www.thestar.com.my/sport/cricket/2021/12/12/cricket-australia039s-hazlewood-returns-home-doubtful-for-adelaide-test","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - Australia pace bowler Josh Hazlewood is doubtful for the second test against England with a side strain and has returned home, Cricket Australia said on Sunday. Read full story","content":null,"pubDate":"2021-12-12 12:01:00","full_description":"SYDNEY (Reuters) - Australia pace bowler Josh Hazlewood is doubtful for the second test against England with a side strain and has returned home, Cricket Australia said on Sunday. The 30-year-old flew to Sydney after sustaining the injury during their nine-wicket victory in the opening test in Brisbane, though he has not been officially ruled out of the day-night match in Adelaide. Should he miss the game which starts on Thursday, Jhye Richardson is expected to take his place in the team. Hazlewood underwent a scan on Friday but bowled on Saturday when Australia cruised to comprehensive victory to go 1-0 up in the five-match series. Captain Pat Cummins said after the match that Hazlewood's injury was nothing too serious. According to local media reports, opener David Warner also returned home with bruised ribs sustained during his knock of 94 in the first innings at the Gabba. Although Cummins was confident the left-hander would be fit for the pink-ball test, the injury could give Usman Khawaja the chance to play his first test since being dropped during the 2019 Ashes series. (Reporting by Amlan Chakraborty in New Delhi; editing by Ed Osmond)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/12/1403531.jpg","source_id":"thestar_my"},{"title":"Sangha hits stumps but bails remain on!","link":"https://www.news.com.au/sport/cricket/sangha-hits-stumps-but-bails-remain-on/video/54328addcfe59b44b8c2b666ef054b68","keywords":null,"creator":null,"video_url":null,"description":"Cricket: In one of the most unlucky deliveries the BBL has ever seen, Sydney Thunder's Tanveer Sangha hits middle stump against the Melbourne Stars, but Andre Russell avoids dismissal.","content":null,"pubDate":"2021-12-12 11:52:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Sangha hits stumps but bails remain on!","link":"https://www.cairnspost.com.au/sport/cricket/sangha-hits-stumps-but-bails-remain-on/video/54328addcfe59b44b8c2b666ef054b68","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: In one of the most unlucky deliveries the BBL has ever seen, Sydney Thunder's Tanveer Sangha hits middle stump against the Melbourne Stars, but Andre Russell avoids dismissal.","content":null,"pubDate":"2021-12-12 11:52:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Thunder claim 2 wickets in 2 balls!","link":"https://www.cairnspost.com.au/sport/cricket/thunder-claim-2-wickets-in-2-balls/video/845e08ce42c949537ca682f727eae4c8","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Sydney Thunder's Sanveer Sangha claimed 2 Melbourne Stars wickets in two consecutive balls in Sunday nights BBL clash at Spotless Stadium.","content":null,"pubDate":"2021-12-12 11:44:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Thunder claim 2 wickets in 2 balls!","link":"https://www.news.com.au/sport/cricket/thunder-claim-2-wickets-in-2-balls/video/845e08ce42c949537ca682f727eae4c8","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Sydney Thunder's Sanveer Sangha claimed 2 Melbourne Stars wickets in two consecutive balls in Sunday nights BBL clash at Spotless Stadium.","content":null,"pubDate":"2021-12-12 11:44:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"India vs South Africa: Tough competition for Shikhar Dhawan from Ruturaj Gaikwad, Venkatesh Iyer all set for SA ODIs - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMirgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbmRpYS12cy1zb3V0aC1hZnJpY2EtdG91Z2gtY29tcGV0aXRpb24tZm9yLXNoaWtoYXItZGhhd2FuLWZyb20tcnV0dXJhai1nYWlrd2FkLXZlbmthdGVzaC1peWVyLWFsbC1zZXQtZm9yLXNhLW9kaXMtMTAxNjM5MzA1MzgxODIyLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa: Tough competition for Shikhar Dhawan from Ruturaj Gaikwad, Venkatesh Iyer all set for SA ODIs  Hindustan TimesTough competition for Shikhar Dhawan from Ruturaj Gaikwad; Venkatesh Iyer all set for South Africa ODIs  Times of India‘He needs just one knock to strike form’ – Anshuman Gaekwad backs Shikhar Dhawan to make limited-overs comeback  CricTrackerRuturaj Gaikwad And Venkatesh Iyer To Be Included In India Tour Of South Africa With The Dip In Shikhar Dhawan's Form – Reports  Cricket Addictor\"Would Keep Him In The Mix\": Ex-India Cricketers Anshuman Gaekwad, Saba Karim Back Shikhar Dhawan Fo..  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-12 10:41:44","image_url":null,"source_id":"google"},{"title":"Ross SMASHES 22 from 4 balls!","link":"https://www.news.com.au/sport/cricket/ross-smashes-22-from-4-balls/video/27856c01a42fe82a3b69f26d8897f132","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Sydney Thunder's Alex Ross made a huge over, smashing 3 sixes and a four, hitting 22 from 4 balls in his team's BBL clash against the Melbourne Strikers.","content":null,"pubDate":"2021-12-12 10:32:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Ross SMASHES 22 from 4 balls!","link":"https://www.cairnspost.com.au/sport/cricket/ross-smashes-22-from-4-balls/video/27856c01a42fe82a3b69f26d8897f132","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Sydney Thunder's Alex Ross made a huge over, smashing 3 sixes and a four, hitting 22 from 4 balls in his team's BBL clash against the Melbourne Strikers.","content":null,"pubDate":"2021-12-12 10:32:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Youngsters Ruturaj Gaikwad, Venkatesh Iyer in Fray for South Africa ODIs As Shikhar Dhawan's Form Dips - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MveW91bmdzdGVycy1ydXR1cmFqLWdhaWt3YWQtdmVua2F0ZXNoLWl5ZXItaW4tZnJheS1mb3Itc291dGgtYWZyaWNhLW9kaXMtYXMtc2hpa2hhci1kaGF3YW5zLWZvcm0tZGlwcy00NTQ2NTY4Lmh0bWzSAZ0BaHR0cHM6Ly93d3cubmV3czE4LmNvbS9jcmlja2V0bmV4dC9hbXAvbmV3cy95b3VuZ3N0ZXJzLXJ1dHVyYWotZ2Fpa3dhZC12ZW5rYXRlc2gtaXllci1pbi1mcmF5LWZvci1zb3V0aC1hZnJpY2Etb2Rpcy1hcy1zaGlraGFyLWRoYXdhbnMtZm9ybS1kaXBzLTQ1NDY1NjguaHRtbA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Youngsters Ruturaj Gaikwad, Venkatesh Iyer in Fray for South Africa ODIs As Shikhar Dhawan's Form Dips  News18Ruturaj Gaikwad And Venkatesh Iyer To Be Included In India Tour Of South Africa With The Dip In Shikhar Dhawan's Form – Reports  Cricket Addictor\"Would Keep Him In The Mix\": Ex-India Cricketers Anshuman Gaekwad, Saba Karim Back Shikhar Dhawan Fo..  NDTV SportsIndia vs South Africa: Tough competition for Shikhar Dhawan from Ruturaj Gaikwad, Venkatesh Iyer all set for SA ODIs  Hindustan TimesBatters Like Shikhar Dhawan Need Just One Good Innings To Strike Form – Former India Head Coach  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2021-12-12 09:55:56","image_url":null,"source_id":"google"},{"title":"‘I was ready to go’ – Stuart Broad ‘disappointed’ to miss Ashes opener as Australia smash England","link":"https://metro.co.uk/2021/12/12/the-ashes-cricket-stuart-broad-reacts-first-test-snub-australia-smash-england-15757293/","keywords":["Cricket","Australia cricket","England cricket","Joe Root","Stuart Broad","The Ashes"],"creator":["Louis Sealey"],"video_url":null,"description":"'It would be wrong in this scenario to kick up a stink'","content":"England pace bowler Stuart Broad was left out of the first Ashes Test (Picture: Getty) Stuart Broad admits he was ‘disappointed’ to miss the first Ashes Test as he feels he could have had a ‘positive influence’ at the Gabba, but understands his omission and will not ‘kick up a stink’ about being left out. ‘I got myself into a mindset where I was ready to go,’ Broad wrote in a column for the Daily Mail. ‘I love Ashes cricket, love bowling at the Gabba and feel like I could’ve had a positive influence on a pitch like that. ‘Of course, in my mind I was 100 per cent preparing to play and that’s especially important given my role. As a new-ball bowler, you are faced with bowling one of the most high-pressured deliveries in world sport. ‘Over the past 12 months, Jimmy and I tried to ensure we were as fit as could be in the current Covid climate, ready to go and available for all five Tests in Australia. I think we ticked that box – but England selection is not in the hands of players. ‘It is in those of people who have to make choices based on conditions and the balance of the team and our job now with four matches to go is to be ready for the next [Test]. ‘I was disappointed not to play but I also realise this series is a marathon and not a sprint. ‘Never have five Test matches been as bunched up as this and it will be exhausting, so realistically I don’t think any seamer will play all five.’ Broad added: ‘It would be wrong in this scenario to kick up a stink. I’ve been left out on numerous occasions and sometimes it comes as a real surprise. ‘This was less of a surprise, maybe because I wasn’t in the team for the previous series against India due to a calf injury.’ On England’s heavy defeat in Brisbane, Broad said: ‘There is no time to feel sorry for ourselves, dwell on not batting, bowling, or catching very well. We know that’s the case. ‘What we mustn’t do is carry negatives with us for the next month. We’ve done that on Ashes tours past and consistently lost. We must pretend it’s 0-0 in a four-match series and go again.’ More to follow…","pubDate":"2021-12-12 09:47:31","full_description":"Stuart Broad admits he was ‘disappointed’ to miss the first Ashes Test as he feels he could have had a ‘positive influence’ at the Gabba, but understands his omission and will not ‘kick up a stink’ about being left out. Senior England bowlers James Anderson and Broad both missed the Ashes opener, with the former not deemed match fit and the latter omitted for tactical reasons. Joe Root’s team selection and his decision to bowl first on day one were criticised as England went on to lose by nine wickets as they remained winless in Brisbane since 1986. After new captain Pat Cummins took five wickets to help bowl England out for just 147, Australia secured a first-innings lead of 278 with Travis Head making 152, David Warner 94 and Marnus Labuschagne 74. England threatened to fight back in the third innings, Root and Dawid Malan scoring 89 and 82 respectively, but another batting collapse left Australia needing just 20 to win on day four and they knocked off the runs for the loss of one wicket. Only Anderson has taken more wickets for England than Broad and the Nottinghamshire bowler was ‘preparing to play’ the opening Test in Australia but insists the Ashes is a ‘marathon not a sprint’. ‘I got myself into a mindset where I was ready to go,’ Broad wrote in a column for the Daily Mail . ‘I love Ashes cricket, love bowling at the Gabba and feel like I could’ve had a positive influence on a pitch like that. ‘Of course, in my mind I was 100 per cent preparing to play and that’s especially important given my role. As a new-ball bowler, you are faced with bowling one of the most high-pressured deliveries in world sport. ‘Over the past 12 months, Jimmy and I tried to ensure we were as fit as could be in the current Covid climate, ready to go and available for all five Tests in Australia. I think we ticked that box – but England selection is not in the hands of players. ‘It is in those of people who have to make choices based on conditions and the balance of the team and our job now with four matches to go is to be ready for the next [Test]. ‘I was disappointed not to play but I also realise this series is a marathon and not a sprint. ‘Never have five Test matches been as bunched up as this and it will be exhausting, so realistically I don’t think any seamer will play all five.’ Broad added: ‘It would be wrong in this scenario to kick up a stink. I’ve been left out on numerous occasions and sometimes it comes as a real surprise. ‘This was less of a surprise, maybe because I wasn’t in the team for the previous series against India due to a calf injury.’ England have not won a Test in Australia since 2010-11, when they secured a brilliant 3-1 series win, and now face an uphill task to reclaim the Ashes. The teams now head to South Australia with a day-night Test at the Adelaide Oval starting on Thursday morning. ‘There is no time to feel sorry for ourselves, dwell on not batting, bowling, or catching very well. We know that’s the case,’ Broad said. ‘What we mustn’t do is carry negatives with us for the next month. We’ve done that on Ashes tours past and consistently lost. We must pretend it’s 0-0 in a four-match series and go again.’ More to follow…","image_url":"https://metro.co.uk/wp-content/uploads/2021/12/GettyImages-1237045501.jpg?quality=90&strip=all","source_id":"metro"}]}