{"newsArray":[{"title":"Shakib al Hasan in trouble for endorsing betting company on social media, Bangladesh cricket board to investigate","link":"https://zeenews.india.com/cricket/shakib-al-hasan-in-trouble-for-endorsing-betting-company-on-social-media-bangladesh-cricket-board-to-investigate-2493502.html","keywords":null,"creator":null,"video_url":null,"description":"As per existing laws in Bangladesh, there is prohibition on facilitation and promotion of any gambling related activities.","content":null,"pubDate":"2022-08-05 07:24:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games 2022 Cricket Updated Points Table: Updated after ENG-W vs NZ-W CWG 2022 clash - August 5, 2022","link":"https://www.sportskeeda.com/cricket/news-commonwealth-games-2022-cricket-updated-points-table-updated-eng-w-vs-nz-w-cwg-2022-clash-august-5-2022?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sports4All Cricket"],"video_url":null,"description":null,"content":null,"pubDate":"2022-08-05 07:12:09","image_url":"https://static.sportskeeda.com/editor/2022/08/f089c-16596766928301-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-ICC hopes to retain all-format players despite busy calendar","link":"https://www.thestar.com.my/sport/cricket/2022/08/05/cricket-icc-hopes-to-retain-all-format-players-despite-busy-calendar","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI (Reuters) - The International Cricket Council (ICC) is optimistic of retaining the game's all-format players despite their mounting workload in a busy calendar, chief executive Geoff Allardice said. Read full story","content":null,"pubDate":"2022-08-05 07:12:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/05/1686194.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games 2022 Cricket: South Africa Women hammer Sri Lanka","link":"https://www.sentinelassam.com/sports/cricket/commonwealth-games-2022-cricket-south-africa-women-hammer-sri-lanka-606047","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"South Africa Women thrashed Sri Lanka by 10 wickets to register their first victory at the event, here on Thursday.","content":"Birmingham: Putting on a dominant display in their final Group B match at the 2022 Commonwealth Games, South Africa Women thrashed Sri Lanka by 10 wickets to register their first victory at the event, here on Thursday.Before beating Sri Lanka, South Africa had lost to New Zealand and England in their first two matches at CWG 2022. Brief scores: Sri Lanka 46 in 17.1 overs (Athapaththu 15, de Klerk 3-7) lost to South Africa 49-0 in 6.1 overs (Brits 21 not out, Bosch 20 not out) by 10 wickets. Also read: Very delighted with Axar's batting show as he did the same for Delhi Capitals: AmreAlso watch: ","pubDate":"2022-08-05 07:05:47","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/05/371574-rety.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"“I was shattered when I got told”: Glenn Maxwell opens up missing a place in the test series against Sri Lanka","link":"https://thesportsrush.com/cricket-news-i-was-shattered-when-i-got-told-glenn-maxwell-opens-up-missing-a-place-in-the-test-series-against-sri-lanka/","keywords":["Cricket","Australia tour of Sri Lanka 2022","Glenn Maxwell"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Australian all-rounder Glenn Maxwell missed a place in the playing eleven in the recent test series against Sri Lanka in Galle. Australian all-rounder Glenn Maxwell was added to the Australian test team for the series against Sri Lanka after a spell of five long years. He was added as an injury cover to Travis Head,… The post “I was shattered when I got told”: Glenn Maxwell opens up missing a place in the test series against Sri Lanka appeared first on The SportsRush.","content":"Australian all-rounder Glenn Maxwell missed a place in the playing eleven in the recent test series against Sri Lanka in Galle. Australian all-rounder Glenn Maxwell was added to the Australian test team for the series against Sri Lanka after a spell of five long years. He was added as an injury cover to Travis Head, but Head got fit in time and Maxwell could not get his opportunity in the playing eleven. Maxwell last played a test in 2017 against Bangladesh. He has played a total of 7 tests in his career, and all seven of them have been in the subcontinent only. He has scored 339 runs at 26.07, courtesy of one century. Glenn Maxwell could not make it to the playing eleven for the Australian side for the two tests against Sri Lanka, and he has admitted that he was shattered when he was told that he was not included in the 2nd test match as well. After a turning track in the 1st test, Maxwell was set to play the 2nd test, but the change in conditions changed the decision of the management. The track looked good for batting, and that’s why Maxwell was not preferred for the same. Maxwell said that he would have played the match if the same pitch would have been used. “I was shattered when I got told,” Maxwell revealed to reporters in the UK. “If it was the same pitch for both Tests, I probably would have played, but they obviously made a slightly better wicket and the selectors made the right call.” “I was just genuinely disappointed. I just really wanted to play, but I loved being a part of it. I loved the thought of playing it (Test cricket) again.” “I’ve tried not to get too excited or get my hopes up too much because I know, having been in that situation so many times.” How Glenn Maxwell has spent his last few minutes in Galle. You can’t help but feel for him #SLvAus pic.twitter.com/24BEinpqHB — Bharat Sundaresan (@beastieboy07) July 8, 2022 Australia will now travel to India in February-March, and Maxwell is expecting to be a part of that tour as well. Although, Maxwell is not getting over-excited about the same, but he is ready if the opportunity strikes.","pubDate":"2022-08-05 06:26:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Chris Gayle To Play In 2nd Edition Of Legends League Cricket","link":"https://sports.ndtv.com/cricket/chris-gayle-to-play-in-2nd-edition-of-legends-league-cricket-3227074","keywords":null,"creator":null,"video_url":null,"description":"Chris Gayle will be playing in the 2nd edition of Legends League Cricket, which will be held in six cities across India","content":"The organisers of Legends League Cricket on Friday confirmed that West Indies opening batter Chris Gayle will be playing in the upcoming second edition of Legends League Cricket. Gayle owns almost every record there is, including that of the most runs (now 10,000+), most hundreds, fastest hundred, and most fours and sixes in the shortest format of the game. The left-handed batter has racked up 15 Test hundreds and over 7,000 runs across 103 matches and frequently turns up for many T20 franchises in jerseys numbered 333-his highest first-Class score, which he made against Sri Lanka at Galle, to become only the fourth batsman after Don Bradman , Brian Lara and Virender Sehwag with two Test triples in a lifetime. \"It gives me immense pleasure and excitement to be part of this prestigious league and to play with the iconic legends of the game. India, see you at the venues,\" said Gayle in an official statement. Earlier it was confirmed that the tournament will be played across six cities in India. Kolkata, Lucknow, Delhi, Jodhpur, Cuttack, and Rajkot will be hosting the matches and the dates planned for the tournament are from September 17-October 8, 2022. The first season of the league was played in January this year in Muscat between three teams - India Maharajas, World Giants, and Asia Lions - and comprised seven games. Promoted In Season 2 the format will have four franchise-owned teams. There will be 15 matches in the league's season 2 and they will be played in these six cities. Earlier, Sourav Ganguly , the former India skipper and current president of the Board of Control for Cricket in India (BCCI) will be playing a special cricket match in Legends League Cricket. Ganguly made the announcement on Instagram, confirming that he would indeed be playing a very special match in the Season 2 of Legends League Cricket.","pubDate":"2022-08-05 06:15:49","image_url":"https://c.ndtvimg.com/2021-11/k88opgag_chris-gayle-afp_625x300_07_November_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Very delighted with Axar's batting show as he did the same for Delhi Capitals: Amre","link":"https://www.sentinelassam.com/sports/cricket/very-delighted-with-axars-batting-show-as-he-did-the-same-for-delhi-capitals-amre-606026","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Pravin Amre, the assistant coach for Delhi Capitals, a side Axar has been part of since 2019, expressed delight over the all-rounder’s recent great batting show.","content":"New Delhi: In the last couple of years, left-arm spin all-rounder Axar Patel's batting stocks have risen in the cricketing world. The proof of it was seen in his unbeaten knock of 64 off 35 balls, also his maiden half-century in ODI cricket which won India the second ODI match and series against West Indies in Trinidad. Pravin Amre, the assistant coach for Delhi Capitals, a side Axar has been part of since 2019, expressed delight over the all-rounder's recent great batting show while pointing out that he had been doing the same for his IPL team. Amre knows it very well as during the IPL season in October 2020, Axar had hit left-arm spin all-rounder Ravindra Jadeja for three sixes in the last over to win a match in Sharjah for Delhi against Chennai Super Kings. More recently in IPL 2022, Axar walked out to bat when Delhi was tottering at 104-6 in a chase of 178 and took the side home against Mumbai Indians with an unbeaten 38 off 17 balls in their opening match at Brabourne Stadium. \"We have to give a lot of credit to the owners also, because they are the ones who got him traded from Punjab (Axar was bought by Delhi for INR 5 crores in player auction ahead of 2019 IPL season) and believed that he can be an asset for the Delhi Capitals . \"He has been doing extremely well for the last three years. We all believe that he is going to be a genuine all rounder and this is what he is actually delivering for Team India.\" \"We are very delighted because he has done the same for us in Delhi Capitals, like in a couple of matches he contributed for us winning with the bat also. We know how good a bowler he is, but his all-rounder role is important, especially in T20 cricket. I am looking forward to him doing the same thing for team India in the World Cup,\" said Amre to IANS on the sidelines of the franchise launching their first cricket academy in Noida. Amre signed off by expressing his pleasure with Delhi skipper and India wicketkeeper-batter Rishabh Pant producing great batting performances in international cricket. Also read: India-West Indies T20Is to happen in Florida as planned Also watch:","pubDate":"2022-08-05 05:57:48","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/05/371492-axar-patel-batting.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"India-West Indies T20Is to happen in Florida as planned","link":"https://www.sentinelassam.com/sports/cricket/india-west-indies-t20is-to-happen-in-florida-as-planned-606017","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The last two T20Is between India and West Indies, to be held in Lauderhill, Florida on August 6 and 7, are all set to happen after both teams received their visas to the US.","content":"Lauderhill: The last two T20Is between India and West Indies, to be held in Lauderhill, Florida on August 6 and 7, are all set to happen after both teams received their visas to the United States of America. A report in Cricbuzz says that the USA visas for some players and support staff in the two teams were obtained at the eleventh hour following the intervention of Guyana President Irfan Ali. \"It was a timely and influential diplomatic effort by His Excellency,\" Ricky Skerritt, the president of Cricket West Indies (CWI), was quoted as saying in the report while thanking Ali. The report further said that those without the USA visas were flown to Georgetown, the capital city of Guyana, after the third T20I in Basseterre, St Kitts ended on Tuesday night for interviews at the US Embassy. \"Among those who attended the interviews were India skipper Rohit Sharma and head coach Rahul Dravid. There were, in fact, 14 of them from the Indian touring party who did not have the travel approvals.\" \"Others, including Ravindra Jadeja, R Ashwin, Dinesh Karthik, Ravi Bishnoi, Suryakumar Yadav and Kuldeep Yadav, have reached Miami meanwhile. They will be joined by the rest of the teammates on Thursday night,\" added the report. Also read: South Africa down Ireland in 1st T20I Also watch:","pubDate":"2022-08-05 05:43:19","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/05/371476-grg.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Suryakumar's 360-degree game makes it incredibly difficult for opposition to defend the field: Styris","link":"https://www.sentinelassam.com/sports/cricket/suryakumars-360-degree-game-makes-it-incredibly-difficult-for-opposition-to-defend-the-field-styris-606006","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Scott Styris has been in awe of Suryakumar’s batting exploits and pointed out that his 360-degree game is making life extremely tough for opposition to defend runs in the field.","content":"New Delhi: Since his T20I debut against England in Ahmedabad last year, Suryakumar Yadav has been a force to reckon with in India's batting order. Right from the time he hit a jaw-dropping hook off the first ball he faced in T20I cricket from Jofra Archer for six to make 57 on debut, he has made batting look ridiculously easy. The latest exhibit of it came in India's seven-wicket victory over West Indies in Basseterre, St Kitts, where on a tricky pitch, Suryakumar opened the batting alongside captain Rohit Sharma (retired hurt on 11 due to back spasm) and made a fine 44-ball 76 for the visitors to hunt down 165 with an over to spare. Former New Zealand all-rounder Scott Styris has been in awe of Suryakumar's batting exploits and pointed out that his 360-degree game is making life extremely tough for opposition to defend runs in the field. \"It is the thing that I like to talk about the most about Suryakumar Yadav and that is his ability to hit the ball into funny areas. And that makes it incredibly difficult for the opposition captains to have to defend the field. He can hit 360 degrees. He is not traditional. It is not always over long on or over long off. It's really over extra cover, fine leg against pace bowlers, which means that he's got so many options.\" \"And when that's the case, he provides that little X factor in terms of something different to the other batsman around him, doesn't always have to be left hand right hand. It can be what areas of the ground and what types of bowling you really do succeed against. And that is one of the strengths he has,\" said Styris on 'Sports Over The Top' show on Sports18. Since his debut in T20I cricket, Suryakumar has hit three fifties as a number three batter and two while coming at number four. But the 76 against West Indies was his first fifty as an opener in T20I cricket. Styris then heaped tons of praise on Suryakumar's versatility. But he expects Suryakumar to bat at number four in future. \"Well, very good players are usually very good, no matter at what position you put them in. So, no, I am not surprised that he has made a great fist of opening the batting, but what a problem to have. I am incredibly jealous and envious of India's issues at the moment.\" \"This is first world problem. Should he open? Should he be at three? How tough is it for you guys going right now? But yeah, I think you might see some seniority step in here and maybe that means SKY might be down at number four,\" signed off Styris. Also read: India face Pakistan in crucial match at Edgbaston Also watch:","pubDate":"2022-08-05 05:25:47","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/05/371462-scott-styris.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"India's Squad For The Asia Cup 2022 [Probable] - ICC CRICKET SCHEDULE","link":"https://news.google.com/__i/rss/rd/articles/CBMiT2h0dHBzOi8vd3d3LmljY2NyaWNrZXRzY2hlZHVsZS5jb20vaW5kaWFzLXNxdWFkLWZvci10aGUtYXNpYS1jdXAtMjAyMi1wcm9iYWJsZS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India's Squad For The Asia Cup 2022 [Probable]  ICC CRICKET SCHEDULEAsia Cup 2022: 5 India-Pakistan players who played in 2018 edition and will miss this year  CricTrackerIndia and Pakistan can face each other three times in Asia Cup 2022. Here's how  Hindustan TimesAsia Cup 2022 Schedule, Date And Time, Teams Cricket, Tickets, Venue, India Squad, Date, Format, Live Telecast Details And Latest Updates  ICC CRICKET SCHEDULESri Lanka to still receive US $ 6m after losing hosting rights for Asia Cup: SLC Secretary  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-08-05 04:36:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"To England and Australia: Don’t interfere in our cricket","link":"https://sportstar.thehindu.com/cricket/sunil-gavaskar-column-do-not-interfere-in-our-cricket-ipl-bcci-big-bash-hundred-england-australia/article65729955.ece","keywords":null,"creator":["\n        Sunil Gavaskar  \n    "],"video_url":null,"description":"The IPL, for a while, ran the danger of being called the Australian league with not just the Aussie players dominating the composition of the teams but the coaches and support staff too. But now other boards are clamouring for Indian participation in their leagues.","content":"It’s been amusing to read that the Indian Premier League is once again seen as a disruptor of the cricketing calendar of other international teams. The moment the news about the South African T20 league and the UAE T20 league came out, the ‘old powers’ started squirming and got their apologists to have a go at the IPL. The IPL has got a 75-day window in the international calendar and that’s simply because, thankfully, there are some administrators who can read the tea leaves and know it’s better to let their players play in the cricket world’s richest league than hold them back with some international commitments. The England & Wales Cricket Board has created a window for its showpiece event The Hundred when the England team don’t play any international matches. The Australians, too, have scheduled their Big Bash when their contracted players will be available to play. But it’s worrying them that the UAE and the South African T20 leagues are scheduled around the same time and there’s the danger of some of their players opting to play there instead of the Big Bash. The Big Bash has been losing popularity and viewership over the years. The limit on what the players can earn and the small change as prize money makes the bigger fees and big prize money at the UAE and South African leagues a more attractive proposition. The composition of the teams in these two new leagues is mainly the franchises that have teams in the IPL and hence the media in the ‘old powers’ has started blaming the IPL. The Board of Control for Cricket in India has nothing to do with these leagues but in all probability may allow some Indian players to play there. Of course, India will be playing international matches during this time and the cream of talent in Indian cricket will be playing for India and not in these leagues. Their franchises, though, may want them to play the odd game if there is a gap between the international matches. Some overseas former players have said that the Indian players should be allowed to play the Big Bash or the Hundred. Basically, they want their leagues to have more sponsorship etc. They are concerned about their cricket, which is totally understandable. But when Indian cricket looks to protect its cricket by ensuring that their players stay fresh for their matches and thus restricting them from playing overseas, that is not acceptable to the guys from the ‘old powers’. They are talking only about the Indian players being made available for their country’s leagues but not the support staff or others who also can do a wonderful job as the cricketing world has found out over the last half dozen years or so. The IPL, for a while, ran the danger of being called the Australian league with not just the Aussie players dominating the composition of the teams but the coaches and support staff too. It’s never a two-way street for the ‘old powers’ of cricket. Remember the times when India as a team was not attractive as far as gate money was concerned. The Indian teams would have a gap of years between tours to the ‘old powers’ shores. The first Indian team toured Australia in 1947/8. Guess when was the next time the Indian team went there? It was 1967/8. Yes, sir, a good 20 years between the two tours. The next was in 1977/8. England, too, had the Indian team coming down after long gaps – 1936, then 1946. The World War II from 1939 to 1945 could have played a part in this. Indian visited England again in 1952, 1959, and then 1967. It was only after the other cricketing boards finally realised that being invited to the MCC President’s box was not helping them promote their cricket and new administrators, who didn’t have any inferiority complexes, came in that India started getting tours at regular four-year intervals. Now these same old powers want India to come to their shores every year because they have understood that the Indian team brings in more moolah than even when they play against each other. So, by all means, look after your cricket interests but hey please don’t interfere in ours and tell us what to do. We will look after our interests and do it better than what you tell us to do. Read more stories on Cricket.","pubDate":"2022-08-05 04:10:22","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Aussie cricket’s Comm Games ‘let down’","link":"https://www.cairnspost.com.au/sport/cricket/pretty-disappointing-australian-cricket-fans-cruelled-by-commonwealth-games-scheduling/news-story/39b058ffd9cb2e280aa3c77b6d1fd66e","keywords":["Commonwealth Games","Cricket news and galleries","Kayo","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"The Australian women’s cricket team will face New Zealand in the Commonwealth Games semi-finals this weekend, but most Aussie supporters won’t be awake for the must-win contest in Birmingham.","content":"Cricket Don't miss out on the headlines from Cricket. Followed categories will be added to My News. The Australian women’s cricket team will face New Zealand in the Commonwealth Games semi-finals this weekend, but most Aussie supporters won’t be awake for the must-win contest in Birmingham. The semi-final fixtures were unveiled on Friday morning AEST, with hosts England scheduled to take on powerhouse nation India on Saturday at 11am local time. Watch The Hundred. Every Match Live & Exclusive to Fox Sports on Kayo. New to Kayo? S tart your free trial now > Meanwhile, world champions Australia will battle their trans-Tasman rivals in the evening timeslot, meaning fans back home hoping to cheer on Meg Lanning’s side will need to set an alarm for 3am AEST on Sunday morning. Kiwi viewers have been dealt a slightly less painful 5am start time. Swapping the fixtures would have given three of the competing nations a prime broadcast timeslot for their respective audiences, but accommodating India’s massive fanbase has seemingly been prioritised. Schedules will never please everyone, but it's pretty disappointing they've put the Australia vs New Zealand semi-final as the second match of the day. A let down for two audiences #B2022 #CWG2022 — Andrew McGlashan (@andymcg_cricket) August 5, 2022 #B2022 T20 semi-final timings. A real shame for fans in Aus (and NZ) who could have watched at prime time on Saturday night if it was the other way around. Get that coffee ready! pic.twitter.com/q176djPxev — Laura Jolly (@JollyLauz18) August 4, 2022 Rejecting (local time start): AUS (8;00pm) v NZ (10:00pm) ENG (6:00pm) v IND (10:30pm) In favour of: ENG (11:00am) v IND (3:30pm) AUS (3:00am) v NZ (5:00am) Seems a bit daft. #B2022 — hypocaust (@_hypocaust) August 4, 2022 Australia was undefeated in the group stage, defeating India, Barbados and Pakistan to cruise through to the knockouts. New Zealand, meanwhile, suffered a horror collapse in their final group stage match against England on Thursday, managing just 9/71 from their 20 overs after winning the toss and electing to bat first at Edgbaston. Maddy Green top-scored for the Kiwis with 19 as veteran seamer Katherine Brunt rattled the New Zealanders with a classy spell of 2/4 from three overs in the Powerplay. “We were well below par and it wasn‘t through lack of effort or lack of planning or anything like that, I think you just get days like that,” New Zealand captain Sophie Devine said. “It’s never nice to be a part of but we’ve got to flush it down the dunny pretty quickly and move on to something that’s actually really exciting for us, playing in a semi-final against Australia at a Commonwealth Games.” England chased the 72-run target with more than eight overs to spare and seven wickets in hand. Nat Sciver of Team England. Photo by Alex Davidson/Getty Images Regardless, Australia remain firm favourites to return home with the coveted gold medal around their necks, having not lost a 20-over match since March 2021. “I think a lot of the pressure is going to be on Australia,” Devine said. More Coverage ‘Cheat code’: Aussie gun is breaking cricket ‘I’ll have nightmares’: Aussie star’s disaster “They‘ve certainly come into this competition as favourites and hopeful of taking that gold medal whereas a lot of people didn’t think we’d maybe make the semi-finals. “We can really take that on board and just play with a bit of freedom and take it to the Aussies. We obviously know them really well, so I think our plans are going to be pretty spot on and likewise they know us really well too. It‘s always just a great battle against the Australians.” Originally published as ‘Pretty disappointing’: Australian cricket fans cruelled by Commonwealth Games scheduling More related stories Cricket Players hit CA with please explain over glaring BBL pay gap The players and Cricket Australia are on the same page with trying to supercharge the Big Bash, but there is one discrepancy that has left them demanding answers. Read more Cricket ‘Cheat code’: Aussie gun is breaking cricket Tahlia McGrath’s mind-bogging purple patch has continued, with the Aussie boasting a batting average that rivals Sir Donald Bradman. Read more","pubDate":"2022-08-05 03:50:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Renuka at it again in India’s win","link":"https://www.tribuneindia.com/news/sports/renuka-at-it-again-in-indias-win-419008","keywords":null,"creator":null,"video_url":null,"description":"Birmingham, August 4Medium-pacer Renuka Singh ran through Barbados' top-order with a four-wicket haul as India beat their lowly opponents by 100 runs to qualify for the semifinals of the women's T20 cricket at the Commonwealth Games on Wednesday.Invited to bat, India posted a competitive 162/4 on the back of a fine unbeaten half-century from Jemimah Rodrigues (56 not out off 46 balls) and a 26-ball 43 from opener Shafali Verma.The Indians then restricted Barbados to 62/8 in 20 overs, with Singh bamboozling the batters with an impressive spell. Captain Harmanpreet Kaur, Sneh Rana, Meghna Singh and Radha Yadav chipped in with a wicket apiece. Kyshona Knight was the top-scorer for Barbados with 16, while Shakera Selman made 12. Seven of their batters failed to reach double figures. Barbados were dismissed for 64 in their nine-wicket defeat to Australia in their last match. India have four points from two wins and finished second behind Australia (6 points from 3 matches) in Group A. They had beaten Pakistan and lost to Australia in their earlier matches.The semifinals will be played on Saturday.Brief Scores: India: 162/4 in 20 overs (Rodrigues 56*, Verma 43; Bruce 1/17); Barbados: 62/8 in 20 overs (Knight 16; Singh 4/10).","content":"PTI Birmingham, August 4 Medium-pacer Renuka Singh ran through Barbados’ top-order with a four-wicket haul as India beat their lowly opponents by 100 runs to qualify for the semifinals of the women’s T20 cricket at the Commonwealth Games on Wednesday. Invited to bat, India posted a competitive 162/4 on the back of a fine unbeaten half-century from Jemimah Rodrigues (56 not out off 46 balls) and a 26-ball 43 from opener Shafali Verma. The Indians then restricted Barbados to 62/8 in 20 overs, with Singh bamboozling the batters with an impressive spell. Captain Harmanpreet Kaur, Sneh Rana, Meghna Singh and Radha Yadav chipped in with a wicket apiece. Kyshona Knight was the top-scorer for Barbados with 16, while Shakera Selman made 12. Seven of their batters failed to reach double figures. Barbados were dismissed for 64 in their nine-wicket defeat to Australia in their last match. India have four points from two wins and finished second behind Australia (6 points from 3 matches) in Group A. They had beaten Pakistan and lost to Australia in their earlier matches. The semifinals will be played on Saturday. Brief Scores: India: 162/4 in 20 overs (Rodrigues 56*, Verma 43; Bruce 1/17); Barbados: 62/8 in 20 overs (Knight 16; Singh 4/10).","pubDate":"2022-08-05 02:38:22","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_2082278904.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket semifinals, Commonwealth Games: India vs England, Australia faces New Zealand; schedule, timings, streaming info","link":"https://sportstar.thehindu.com/commonwealth-games/news/womens-t20-cricket-commonwealth-games-2022-semifinal-schedule-india-vs-england-australia-vs-new-zealand/article65729893.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Commonwealth Games 2022: India, England, Australia and New Zealand are the four semifinalists of the inaugural edition of women’s T20 cricket in CWG.","content":"The Commonwealth Games 2022 women’s T20 cricket semifinals will be held at the Edgbaston Cricket Stadium in Birmingham on Saturday. In the inaugural edition of the T20 format at the CWG, host England faces India in the first semifinal while defending ODI and T20 World Cup champion Australia meets New Zealand in the last four. Saturday’s winners will then move into the gold medal match on Sunday (9:30 pm IST) while the losers face off in the bronze medal match at 2:30 pm IST. Road to Semifinal - India Top Performers Most Runs - Shafali Verma (107); Most Wickets - Renuka Thakur (9) Road to Semifinal - England Top Performers Most Runs - Alice Capsey (117); Most Wickets - Sophie Ecclestone (5) Road to Semifinal - Australia Top Performers Most Runs - Tahlia McGrath (92); Most Wickets - Tahlia McGrath (6) Road to Semifinal - New Zealand Top Performers Most Runs - Suzie Bates (131); Most Wickets - Hayley Jensen (4) Read more stories on News.","pubDate":"2022-08-05 02:35:14","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Faf du Plessis previews upcoming BBL season","link":"https://www.cairnspost.com.au/sport/cricket/faf-du-plessis-previews-upcoming-bbl-season/video/3f21dce703fe603b57a0d1fd899fc5c8","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Former South African captain Faf du Plessis joins the FSN desk to discuss the upcoming BBL draft and the future of ODI cricket.","content":null,"pubDate":"2022-08-05 02:18:19","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs England Women’s cricket semifinal Commonwealth Games (CWG) 2022 Livestream Details: When and where to watch IND-W vs ENG-W, cricket schedule, TV timing","link":"https://zeenews.india.com/cricket/india-vs-england-women-s-cricket-semifinal-commonwealth-games-cwg-2022-livestream-details-when-and-where-to-watch-ind-w-vs-eng-w-cricket-schedule-tv-timing-2493383.html","keywords":null,"creator":null,"video_url":null,"description":"Harmanpreet Kaur's Team India will take on Nat Sciver-led England team in the first semifinal of women's cricket event at the Commonwealth Games 2022 on Saturday (August 6).","content":null,"pubDate":"2022-08-05 02:03:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Australian cricket fears 'missing generation' after Covid","link":"https://www.thenews.com.pk/print/979714-australian-cricket-fears-missing-generation-after-covid","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY: Australian cricket could suffer from a “missing generation” of children taking up the game after first-time participation in junior programmes fell by 15,000 last season because of the coronavirus pandemic.While club players have returned in strong numbers after Covid...","content":null,"pubDate":"2022-08-05 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games 2022: Georgia Williams provides lone medal for New Zealand - day seven wrap","link":"https://www.newstalkzb.co.nz/news/sport/commonwealth-games-2022-georgia-williams-provides-lone-medal-for-new-zealand-day-seven-wrap/","keywords":null,"creator":null,"video_url":null,"description":"All you need to know from a relatively subdued day at the Commonwealth Games for New Zealand athletes, at least compared with the roaring success of the past six days. Cyclists shine again Georgia Williams has claimed New Zealand's 16th cycling medal at the Commonwealth Games, with a bronze in the women's individual time trial. Williams, who took silver in the road race in 2018, added another medal to her collection with a calculated, well-paced ride, crossing all of the four time checks on the 28.8 kilometre course in third place. She didn't threaten the top two riders, with Australia's Grace Brown cruising to victory by 33 seconds over England's Anna Henderson, with Williams a further 47 seconds back in third, but neither was she under pressure from the rest of the field, with her third place always looking secure. Her closing 5.6 kilometres were her slowest split of the race, but she still had a 19 second buffer over fourth-placed Georgia Baker to wrap up another medal for New Zealand's cyclists. Fellow Kiwi Mikayla Harvey finished in 20th while Henrietta Christie did not start. In the men's time trial, Aaron Gate narrowly missed his chance for a fourth medal at the Games. After winning three gold medals on the track, Gate finished fourth in the time trial on the road, though was well behind the trio of medallists, all of whom star on cycling's World Tour. Australia's Rohan Dennis took the gold medal by 26 seconds over Fred Wright, with last month's Tour de France podium finisher Geraint Thomas two seconds further back in third. Gate finished two minutes and 22 seconds behind Dennis, while teammate Tom Sexton finished ninth. Silver Ferns lose the battle, but move in line to win the war? Maia Wilson played multiple positions as Dame Noeline Taurua rotated her squad against England. Photo / Photosport England defeated the Silver Ferns 54-44 in their final pool play match, but New Zealand arguably won the best semifinal fixture after Jamaica claimed an upset win over Australia on the other side of the draw earlier in the day. By finishing second in their group, the Ferns booked a semifinal fixture against Jamaica who, while being a stern opponent, seems like a much more attractive proposition than arch-nemesis Australia, who England will now take on. While firmly denying the side was content to play out a competitive loss, coach Noeline Taurua rested star shooter Grace Nweki and defensive ace Kelly Jury for the full final quarter in what she claims was an attempt to win the match. However, that attempt fell flat as England made their home fans roar in delight with what ended as an easy victory. White Ferns crushed Fortunately for the White Ferns, they were already assured a semifinal spot before their destruction by England. The bad news, however, is now they have to play Australia. New Zealand warmed up for the medal rounds in the worst possible fashion at Edgbaston today, losing to the hosts by seven wickets. The problem wasn't just the margin of the defeat - though that was less than ideal - but the manner. The White Ferns staggered to 71-9 after winning the toss and choosing to bat, a decision that looked ill-considered within four balls. The top order was scythed through, the middle order offered little and the lower order batted for time when runs were desperately needed. It all added up to New Zealand's third-lowest total in T20 internationals, removing some of the gloss from the competitive scores they posted in wins over South Africa and Sri Lanka to begin the tournament. A dejected White Ferns team leaves the field after losing to England. Photo / Photosport In reply, there would only ever be one result, the sole question remaining was how quickly England would reach their target. And despite Fran Jonas striking in the first over of the chase, the answer soon became clear, the hosts roared on to reach their target in the 12th over. The White Ferns' penalty for playing their worst cricket in Birmingham will be a match against the best team in the world. Australia, naturally, advanced unbeaten through pool play, being pushed by India before crushing Barbados and Pakistan. They began the Commonwealth Games as heavy favourites to add this T20 crown to the ODI World Cup they won earlier this year in New Zealand, and nothing about the last week has changed that status. The White Ferns have two days to forget about this defeat and somehow find a way to topple Australia, or they will face a bronze-medal match against the loser of the other semifinal between England and India. New Zealand will certainly need a radically improved performance from their recognised batters to stand a chance. Skipper Sophie Devine saw her leg stump sent cartwheeling in the opening over but she, like Amelia Kerr, was at least the victim of a peach from England bowler Katherine Brunt, who finished with figures of 2-4 from three overs. Suzie Bates, who began the tournament with a brilliant 91 against South Africa, sent a simple catch to midwicket with a nonchalant flick. Brooke Halliday ran herself out in comical fashion before Hayley Jensen fell to an ugly off-side hack. That marked the halfway point of the innings, with the White Ferns on 35-5 and boasting only two boundaries to their name. They would collect just two more in the next 10 overs, as Maddy Green top scored with 19 from 24 balls before the tailenders oddly elected to occupy the crease rather than go down swinging. That left England to chase a straightforward target and, despite Kerr picking up a couple of wickets, left New Zealand to tackle the most unenviable task in cricket. Hammer blow for Kiwi Lauren Bruce sheds a tear after failing to qualify for the final of the women's hammer throw. Photo / Photosport Kiwi hammer thrower Lauren Bruce has seen her Commonwealth Games campaign end in disaster. New Zealand's national record holder, Bruce came into the event as a serious medal contender, holding the second-best throw of the 17 competitors in the field. But it all came unstuck in qualifying for the 25-year-old, failing to record a successful attempt on her three throws. She stepped out of the ring on her first attempt, before her second attempt went into the left webbing of the net. That left Bruce with a do-or-die throw, merely needing to register an effort of over 60 metres to qualify for the final. Instead, the Cantabrian with a personal best of 74.61m threw it wide, and was left with her hands on her head in anguish after a third foul throw eliminated her from the competition. Despite Bruce's shock exit, New Zealand still have two representatives in the final, with Julia Ratcliffe throwing the second-best attempt in qualifying with 68.73m, while Nicole Bradley qualified eighth with 61.77m. Ratcliffe, the defending champion, will have her work cut out to win gold however, with the favourite being Canada's Camryn Rogers, who produced a Games record throw of 74.68m. The hammer throw final is at 6am on Saturday. Elsewhere, Sam Tanner has just snuck into the final of the men's 1500m. After the first heat was run in a winning time of 3.37.57, the second heat was much slower, meaning that only the top five finishers would advance to the final. Tanner had to fight for position multiple times and stumbled before the closing straight in a physical race, but regained his position and then sprinted well in the mass finish to claim fifth. Only 0.31 seconds separated heat winner Jack Wightman and Tanner in fifth, with Tanner holding a 0.33 second gap over sixth place to ensure he'd move on to the final, held at 12.10am on Saturday. In the women's high jump, Keeley O'Hagan qualified for the final, as one of 12 jumpers to hit 1.81m. In the evening session, Portia Bing booked her spot in the 400m hurdles final after finishing third in her heat while Conner Bell finished eighth in the men's discus final in his first major event. Women's Black Sticks make semis The women's Black Sticks will have a decent shot at a Commonwealth Games medal. Photo / Photosport The women's Black Sticks have secured a spot in the semifinals of the Commonwealth Games after a 4-1 win over South Africa. The Black Sticks shot out to a 3-0 lead within 12 minutes through goals from Tessa Jopp, Tyler Lench and Hope Ralph, with Kaitlin Cotter adding another in the final period before a consolation goal from South Africa. The win sees New Zealand finish second in their pool, behind Australia, and will face the unbeaten English in a semifinal on Saturday morning. Meanwhile the men's team failed to make the semifinals after going down 4-3 to South Africa in their final pool game. Bowling for a medal The women's triples lawn bowls team advanced to the semifinals after defeating Australia 14-10. The trio of Val Smith, Tayla Bruce and Nicole Toomey will face Malaysia for a spot in the gold medal match. Men's singles player Shannon McIlroy missed out on the quarter-finals after finishing third in his group with two wins and two defeats. Knockout win Leuila Mau'u dominated his quarter final bout. Photo / Photosport Three Kiwi boxers were in with a shot to make the semifinals but Leuila Mau'u was the only one to advance with a KO in his over 92kg quarter-finals bout against Lera Regis (Saint Lucia). Wendell Stanley lost a tight contest against Tiago Osorio Muxanga (Mozambique) 3-0 in their 71kg quarter-finals while Troy Garton lost 4-1 on points to Jaismine Jaismine (India) in a women's 60kg quarter-final. For the full schedule and results for all the New Zealand teams and athletes, click here. Medals today: Bronze - Georgia Williams - Cycling Road – Women's Individual Time Trial","content":"All you need to know from a relatively subdued day at the Commonwealth Games for New Zealand athletes, at least compared with the roaring success of the past six days. Georgia Williams has claimed New Zealand's 16th cycling medal at the Commonwealth Games, with a bronze in the women's individual time trial. Williams, who took silver in the road race in 2018, added another medal to her collection with a calculated, well-paced ride, crossing all of the four time checks on the 28.8 kilometre course in third place. Her closing 5.6 kilometres were her slowest split of the race, but she still had a 19 second buffer over fourth-placed Georgia Baker to wrap up another medal for New Zealand's cyclists. Fellow Kiwi Mikayla Harvey finished in 20th while Henrietta Christie did not start. In the men's time trial, Aaron Gate narrowly missed his chance for a fourth medal at the Games. After winning three gold medals on the track, Gate finished fourth in the time trial on the road, though was well behind the trio of medallists, all of whom star on cycling's World Tour. Australia's Rohan Dennis took the gold medal by 26 seconds over Fred Wright, with last month's Tour de France podium finisher Geraint Thomas two seconds further back in third. Gate finished two minutes and 22 seconds behind Dennis, while teammate Tom Sexton finished ninth. England defeated the Silver Ferns 54-44 in their final pool play match, but New Zealand arguably won the best semifinal fixture after Jamaica claimed an upset win over Australia on the other side of the draw earlier in the day. By finishing second in their group, the Ferns booked a semifinal fixture against Jamaica who, while being a stern opponent, seems like a much more attractive proposition than arch-nemesis Australia, who England will now take on. While firmly denying the side was content to play out a competitive loss, coach Noeline Taurua rested star shooter Grace Nweki and defensive ace Kelly Jury for the full final quarter in what she claims was an attempt to win the match. However, that attempt fell flat as England made their home fans roar in delight with what ended as an easy victory. Fortunately for the White Ferns, they were already assured a semifinal spot before their destruction by England. The bad news, however, is now they have to play Australia. New Zealand warmed up for the medal rounds in the worst possible fashion at Edgbaston today, losing to the hosts by seven wickets. The problem wasn't just the margin of the defeat - though that was less than ideal - but the manner. The White Ferns staggered to 71-9 after winning the toss and choosing to bat, a decision that looked ill-considered within four balls. The top order was scythed through, the middle order offered little and the lower order batted for time when runs were desperately needed. It all added up to New Zealand's third-lowest total in T20 internationals, removing some of the gloss from the competitive scores they posted in wins over South Africa and Sri Lanka to begin the tournament. In reply, there would only ever be one result, the sole question remaining was how quickly England would reach their target. And despite Fran Jonas striking in the first over of the chase, the answer soon became clear, the hosts roared on to reach their target in the 12th over. The White Ferns' penalty for playing their worst cricket in Birmingham will be a match against the best team in the world. Australia, naturally, advanced unbeaten through pool play, being pushed by India before crushing Barbados and Pakistan. They began the Commonwealth Games as heavy favourites to add this T20 crown to the ODI World Cup they won earlier this year in New Zealand, and nothing about the last week has changed that status. The White Ferns have two days to forget about this defeat and somehow find a way to topple Australia, or they will face a bronze-medal match against the loser of the other semifinal between England and India. New Zealand will certainly need a radically improved performance from their recognised batters to stand a chance. Skipper Sophie Devine saw her leg stump sent cartwheeling in the opening over but she, like Amelia Kerr, was at least the victim of a peach from England bowler Katherine Brunt, who finished with figures of 2-4 from three overs. Suzie Bates, who began the tournament with a brilliant 91 against South Africa, sent a simple catch to midwicket with a nonchalant flick. Brooke Halliday ran herself out in comical fashion before Hayley Jensen fell to an ugly off-side hack. That marked the halfway point of the innings, with the White Ferns on 35-5 and boasting only two boundaries to their name. They would collect just two more in the next 10 overs, as Maddy Green top scored with 19 from 24 balls before the tailenders oddly elected to occupy the crease rather than go down swinging. That left England to chase a straightforward target and, despite Kerr picking up a couple of wickets, left New Zealand to tackle the most unenviable task in cricket. Kiwi hammer thrower Lauren Bruce has seen her Commonwealth Games campaign end in disaster. New Zealand's national record holder, Bruce came into the event as a serious medal contender, holding the second-best throw of the 17 competitors in the field. But it all came unstuck in qualifying for the 25-year-old, failing to record a successful attempt on her three throws. She stepped out of the ring on her first attempt, before her second attempt went into the left webbing of the net. That left Bruce with a do-or-die throw, merely needing to register an effort of over 60 metres to qualify for the final. Instead, the Cantabrian with a personal best of 74.61m threw it wide, and was left with her hands on her head in anguish after a third foul throw eliminated her from the competition. Despite Bruce's shock exit, New Zealand still have two representatives in the final, with Julia Ratcliffe throwing the second-best attempt in qualifying with 68.73m, while Nicole Bradley qualified eighth with 61.77m. Ratcliffe, the defending champion, will have her work cut out to win gold however, with the favourite being Canada's Camryn Rogers, who produced a Games record throw of 74.68m. The hammer throw final is at 6am on Saturday. Elsewhere, Sam Tanner has just snuck into the final of the men's 1500m. After the first heat was run in a winning time of 3.37.57, the second heat was much slower, meaning that only the top five finishers would advance to the final. Tanner had to fight for position multiple times and stumbled before the closing straight in a physical race, but regained his position and then sprinted well in the mass finish to claim fifth. Only 0.31 seconds separated heat winner Jack Wightman and Tanner in fifth, with Tanner holding a 0.33 second gap over sixth place to ensure he'd move on to the final, held at 12.10am on Saturday. In the women's high jump, Keeley O'Hagan qualified for the final, as one of 12 jumpers to hit 1.81m. In the evening session, Portia Bing booked her spot in the 400m hurdles final after finishing third in her heat while Conner Bell finished eighth in the men's discus final in his first major event. The women's Black Sticks have secured a spot in the semifinals of the Commonwealth Games after a 4-1 win over South Africa. The Black Sticks shot out to a 3-0 lead within 12 minutes through goals from Tessa Jopp, Tyler Lench and Hope Ralph, with Kaitlin Cotter adding another in the final period before a consolation goal from South Africa. The win sees New Zealand finish second in their pool, behind Australia, and will face the unbeaten English in a semifinal on Saturday morning. Meanwhile the men's team failed to make the semifinals after going down 4-3 to South Africa in their final pool game. The women's triples lawn bowls team advanced to the semifinals after defeating Australia 14-10. The trio of Val Smith, Tayla Bruce and Nicole Toomey will face Malaysia for a spot in the gold medal match. Men's singles player Shannon McIlroy missed out on the quarter-finals after finishing third in his group with two wins and two defeats. Three Kiwi boxers were in with a shot to make the semifinals but Leuila Mau'u was the only one to advance with a KO in his over 92kg quarter-finals bout against Lera Regis (Saint Lucia). Wendell Stanley lost a tight contest against Tiago Osorio Muxanga (Mozambique) 3-0 in their 71kg quarter-finals while Troy Garton lost 4-1 on points to Jaismine Jaismine (India) in a women's 60kg quarter-final. For the full schedule and results for all the New Zealand teams and athletes, . Bronze - Georgia Williams - Cycling Road – Women's Individual Time Trial","pubDate":"2022-08-04 22:34:42","image_url":"https://www.newstalkzb.co.nz/media/vf3fov21/georgia-williams-after-taking-third-in-the-womens-road-cycling-time-trial-photosport.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Ellis bowls Spirit to London derby win","link":"https://thewest.com.au/sport/cricket/ellis-bowls-spirit-to-london-derby-win-c-7764520","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"Australian quick Nathan Ellis has continued his fine form in English domestic white-ball cricket by setting up London Spirit for a derby win in the Hundred.","content":"Nathan Ellis has bowled London Spirit to a capital derby victory over Oval Invincibles with an impressive opening burst and spell at the death in their Hundred match. The 27-year-old Australian dismissed English hitter Jason Roy with his first ball and followed up by having the dangerous Sam Billings caught to be 2-8 off his first 10 balls on Thursday. Returning at the end, Ellis bowled Jordan Cox (39 off 30) as the Invincibles almost chased down an improbable victory in front of a full house 27,000 at The Oval. Set 172 to win they ended on 7-168, losing by three runs. Ellis finished with 3-28 off his 20 balls. His excellent start to England's 100-ball tournament followed a superb finish to the other domestic short-format competition when Ellis bowled Hampshire Hawks to victory with a last-ball wicket on T20 Blast Finals Day. That followed his breakthrough at international level with debuts for Australia's T20 and ODI team since August 2021. Ellis, who was made Match Hero, said: \"It's happened really quickly for me the last 18 months. I'm just trying to soak it all up and be a bit of a sponge being around some of the best players in the world. \"I'm appreciating it and taking each day as it comes.\" The Australian white-ball international also caught Will Jacks, and with Glenn Maxwell catching Sam Curran the Invincibles were 4-12 and seemingly already out of the hunt to overhaul Spirit's 6-171. However, with hitters teeing off all down the order the Invincibles came close enough to worry the Spirit, Sunil Narine failing to hit the four required for a draw off the last ball. The only mishap for the Australian pair came when they failed to combine on the boundary to catch a big hit from Hilton Cartwright. Ellis caught the ball but was unable to transfer it to the waiting Maxwell before going over the boundary rope. But Cartwright, who had begun to cut loose, edged behind next ball and was dismissed for 42 off 23. Maxwell, who wasn't required to bowl, made 18 in the Spirit's innings, the highlight of which was a hard-hitting 47 off 29 balls by Eoin Morgan, playing his first match since stepping down as England's white-ball skipper in June. Spirit were to be coached by Shane Warne but after his untimely death fellow Australian Trevor Bayliss, the architect of England's ODI World Cup success, stepped in. Sign up for our emails","pubDate":"2022-08-04 20:53:09","image_url":"https://images.thewest.com.au/publication/C-7764520/624a724ba1076a016f0564c9b2d612636d482699-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Mark Irwin: There is only going to be one winner in Cristiano Ronaldo’s tussle with Man Utd and it won’t be Erik ten Hag","link":"https://www.thesun.co.uk/sport/football/19423083/man-utd-cristiano-ronaldo-transfer-exit-comment/","keywords":["Football","Premier League","Man Utd transfer news","Sport Columnists","Transfer News"],"creator":["Anthony Chapman"],"video_url":null,"description":null,"content":"ARSENAL technical director Edu rattled every financial director in football when he claimed that paying unwanted players to leave is “an investment”. That’s quite some economic policy from a club which has delivered more golden handshakes than King Midas in recent months. Among the beneficiaries of Arsenal’s generosity have been Mesut Ozil, Pierre-Emerick Aubameyang, Shkodran Mustafi, Sead Kolasinac and Sokratis - £150million of signings enjoying a kiss-off for outstaying their welcome. Yet the grim reality is that rewarding failure is the lesser of two evils for all those clubs who have married at haste and been forced to repent at leisure. Practically every team in the Premier League has had their fingers burned by a big-money signing who has dramatically failed to live up to expectations. Danny Drinkwater, Eric Bailly, Tanguy Ndombele, Nicolas Pepe, Kepa Arrizabalaga, Cenk Tosun, Felipe Anderson, Dennis Praet, Ross Barkley, Christian Benteke... and they’re just the tip of the scrapheap. But trying to offload those underachievers has become practically impossible now that the bottom has all but dropped out of the transfer market. European clubs who were once happy to sign our cast-offs at a reduced price now expect to get them on loan with a vague promise of maybe paying a nominal fee some time in the distant future. Or, better still, for absolutely nothing. Yet even then many players are happy to sit on the sidelines wringing every last penny from their contracts. FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS So the only way to get rid of these \"killers\" is to take a leaf out of the Edu playbook and pay them to clear off. Barcelona have tried to buck that trend by flogging Frenkie de Jong to Manchester United or Chelsea for £70m while withholding the £14.5m the player is owed in deferred wages. But that bullying approach is doomed to failure because, one way or the other, De Jong is going to get his money before he agrees to leave. For in this game of football poker, it’s the players who now hold all the aces. Which brings us neatly onto Cristiano Ronaldo , currently throwing a hissy-fit because he doesn’t want to slum it in the Europa League with Man Utd. The problem is, he still has a year of his £480,000-a-week contract to run and United don’t appear to have been inundated with offers. New boss Erik ten Hag insists the 37-year-old GOAT still figures in his plans despite missing the pre-season tour and storming off after being hooked in a reserve game. Which leaves United caught between a rock and a hard place. One the one hand there is the risk of undermining Ten Hag’s authority by allowing Ronaldo to cash in on his petulance with another lucrative moment. But the alternative is being lumbered with a sulking prima donna overshadowing everything the new manager is trying to achieve. Either way, there is only going to be one winner. And it won’t be United. ADAM PEATY well and truly let the cat out of the bag when he shrugged off defeat in the 100 metres breaststroke, with words to the effect of: \"I’m not bothered, it’s the Commonwealth Games.\" Cue horrified faces in the BBC studios, where they have been desperately trying to convince us we’ve been watching elite sport for the past week or so. Fair play to the likes of Michael Johnson and Sir Chris Hoy for keeping a straight face as they assess the efforts of a Samoan sprinter or a track cyclist from Tuvalu. But even their best efforts cannot disguise the fact \"the Commies\" are the track-and-field equivalent of the Europa Conference League. Which is why missing out at the Sandwell Aquatics Centre was never going to devastate serial Olympic champion Peaty. EVERTON fan Paul Stratton achieved a lifetime dream when he scored a penalty in front of their Gwladys Street End. The \"portly\" 44-year-old took the kick after replacing Dele Alli late in the pre-season win against Dynamo Kyiv. It was a reward for his work delivering supplies to victims of the war in Ukraine. A fine gesture by Toffees boss Frank Lampard — marred only by the realisation that Stratton was his best player! THE highbrow world of chess does not usually make SunSport pages but I could not ignore the recent match in Moscow between a computer and a seven-year-old child prodigy. According to reports, the match had to be abandoned when the boy picked up a piece to make a move and the robot responded by reaching across the board and crushing his finger. Apparently it is known as the Vinnie Jones defence. CHAIRMAN Bruce Carnegie-Brown got a suspended six-month ban by the MCC for inadvertently upsetting the blazer brigade. The Lord’s boss failed to cover his microphone when he joked about tardy members “taking an age to empty their colostomy bags”. Considering it can take 22 years and cost up to £80,000 to become a full member, it seems just about everyone is taking the p*** at the Home of Cricket.","pubDate":"2022-08-04 20:49:09","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games 2022: Live updates of action from day seven","link":"https://www.newstalkzb.co.nz/news/sport/commonwealth-games-2022-live-updates-of-action-from-day-seven/","keywords":null,"creator":null,"video_url":null,"description":"All the live action from day seven of the Commonwealth Games. For the full schedule and results for all the New Zealand teams and athletes, click here. White Ferns crushed Fortunately for the White Ferns, they were already assured a semifinal spot before their destruction by England. The bad news, however, is now they have to play Australia. New Zealand warmed up for the medal rounds in the worst possible fashion at Edgbaston today, losing to the hosts by seven wickets. The problem wasn't just the margin of the defeat - though that was less than ideal - but the manner. The White Ferns staggered to 71-9 after winning the toss and choosing to bat, a decision that looked ill-considered within four balls. The top order was scythed through, the middle order offered little and the lower order batted for time when runs were desperately needed. It all added up to New Zealand's third-lowest total in T20 internationals, removing some of the gloss from the competitive scores they posted in wins over South Africa and Sri Lanka to begin the tournament. In reply, there would only ever be one result, the sole question remaining was how quickly England would reach their target. And despite Fran Jonas striking in the first over of the chase, the answer soon became clear, the hosts roared on to reach their target in the 12th over. The White Ferns' penalty for playing their worst cricket in Birmingham will be a match against the best team in the world. Australia, naturally, advanced unbeaten through pool play, being pushed by India before crushing Barbados and Pakistan. They began the Commonwealth Games as heavy favourites to add this T20 crown to the ODI World Cup they won earlier this year in New Zealand, and nothing about the last week has changed that status. The White Ferns have two days to forget about this defeat and somehow find a way to topple Australia, or they will face a bronze-medal match against the loser of the other semifinal between England and India. New Zealand will certainly need a radically improved performance from their recognised batters to stand a chance. Skipper Sophie Devine saw her leg stump sent cartwheeling in the opening over but she, like Amelia Kerr, was at least the victim of a peach from England bowler Katherine Brunt, who finished with figures of 2-4 from three overs. Suzie Bates, who began the tournament with a brilliant 91 against South Africa, sent a simple catch to midwicket with a nonchalant flick. Brooke Halliday ran herself out in comical fashion before Hayley Jensen fell to an ugly off-side hack. That marked the halfway point of the innings, with the White Ferns on 35-5 and boasting only two boundaries to their name. They would collect just two more in the next 10 overs, as Maddy Green top scored with 19 from 24 balls before the tailenders oddly elected to occupy the crease rather than go down swinging. That left England to chase a straightforward target and, despite Kerr picking up a couple of wickets, left New Zealand to tackle the most unenviable task in cricket. Cyclists shine again Georgia Williams has claimed New Zealand's 16th cycling medal at the Commonwealth Games, with a bronze in the women's individual time trial. Williams, who took silver in the road race in 2018, added another medal to her collection with a calculated, well-paced ride, crossing all of the four time checks on the 28.8 kilometre course in third place. She didn't threaten the top two riders, with Australia's Grace Brown cruising to victory by 33 seconds over England's Anna Henderson, with Williams a further 47 seconds back in third, but neither was she under pressure from the rest of the field, with her third place always looking secure. Her closing 5.6 kilometres were her slowest split of the race, but she still had a 19 second buffer over fourth-placed Georgia Baker to wrap up another medal for New Zealand's cyclists. Fellow Kiwi Mikayla Harvey finished in 20th while Henrietta Christie did not start. In the men's time trial, Aaron Gate narrowly missed his chance for a fourth medal at the Games. After winning three gold medals on the track, Gate finished fourth in the time trial on the road, though was well behind the trio of medallists, all of whom star on cycling's World Tour. Australia's Rohan Dennis took the gold medal by 26 seconds over Fred Wright, with last month's Tour de France podium finisher Geraint Thomas two seconds further back in third. Gate finished two minutes and 22 seconds behind Dennis, while teammate Tom Sexton finished ninth. Hammer blow for Kiwi Kiwi hammer thrower Lauren Bruce has seen her Commonwealth Games campaign end in disaster. New Zealand's national record holder, Bruce came into the event as a serious medal contender, holding the second-best throw of the 17 competitors in the field. But it all came unstuck in qualifying for the 25-year-old, failing to record a successful attempt on her three throws. She stepped out of the ring on her first attempt, before her second attempt went into the left webbing of the net. That left Bruce with a do-or-die throw, merely needing to register an effort of over 60 metres to qualify for the final. Instead, the Cantabrian with a personal best of 74.61m threw it wide, and was left with her hands on her head in anguish after a third foul throw eliminated her from the competition. Despite Bruce's shock exit, New Zealand still have two representatives in the final, with Julia Ratcliffe throwing the second-best attempt in qualifying with 68.73m, while Nicole Bradley qualified eighth with 61.77m. Ratcliffe, the defending champion, will have her work cut out to win gold however, with the favourite being Canada's Camryn Rogers, who produced a Games record throw of 74.68m. The hammer throw final is at 6am on Saturday. Elsewhere, Sam Tanner has just snuck into the final of the men's 1500m. After the first heat was run in a winning time of 3.37.57, the second heat was much slower, meaning that only the top five finishers would advance to the final. Tanner had to fight for position multiple times and stumbled before the closing straight in a physical race, but regained his position and then sprinted well in the mass finish to claim fifth. Only 0.31 seconds separated heat winner Jack Wightman and Tanner in fifth, with Tanner holding a 0.33 second gap over sixth place to ensure he'd move on to the final, held at 12.10am on Saturday. In the women's high jump, Keeley O'Hagan qualified for the final, as one of 12 jumpers to hit 1.81m. Black Sticks make semis The women's Black Sticks have secured a spot in the semifinals of the Commonwealth Games after a 4-1 win over South Africa. The Black Sticks shot out to a 3-0 lead within 12 minutes through goals from Tessa Jopp, Tyler Lench and Hope Ralph, with Kaitlin Cotter adding another in the final period before a consolation goal from South Africa. The win sees New Zealand finish second in their pool, behind Australia, and will face the unbeaten English in a semifinal on Saturday morning.","content":null,"pubDate":"2022-08-04 20:43:20","image_url":"https://www.newstalkzb.co.nz/media/vf3fov21/georgia-williams-after-taking-third-in-the-womens-road-cycling-time-trial-photosport.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Who is Isa Guha? Cricket champion and BBC Commonwealth Games presenter says she didn't earn money in sport","link":"https://www.birminghammail.co.uk/sport/uk-sport-news/who-isa-guha-cricket-champion-24672134","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Milly Vincent)"],"video_url":null,"description":"The former England Women's Cricket champion has worked as the BBC's Cricket commentator and presenter since 2020. Isa Guha is in Birmingham presenting the Commonwealth Games' highlights on BBC One's Tonight at the Games each evening.","content":null,"pubDate":"2022-08-04 20:41:29","image_url":"https://i2-prod.walesonline.co.uk/incoming/article24657223.ece/ALTERNATES/s615/0_England-v-Australia-2nd-Vitality-International-Twenty20.jpg","source_id":"birminghammail","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"The Hundred: Eoin Morgan returns to form as London Spirit edge derby thriller against Oval Invincibles","link":"https://metro.co.uk/2022/08/04/cricket-the-hundred-london-spirit-edge-out-oval-invincibles-thrilling-derby-17130260/","keywords":["Cricket","England cricket","Eoin Morgan","The Hundred"],"creator":["Louis Sealey"],"video_url":null,"description":"London Spirit begin their Hundred campaign with a narrow win.","content":"Former England captain Eoin Morgan returned to form for London Spirit (Picture: Getty) Former England captain Eoin Morgan returned to form as London Spirit edged out Oval Invincibles in a thrilling derby in The Hundred. Morgan, who retired from international cricket last month, smashed 47 from 29 to take London Spirit to 171-5. Oval Invincibles looked set to slump to a heavy defeat as they slipped to 20-4 but some extraordinary hitting from the lower order kept the game alive. Hilton Cartwright smashed 42 from 23, Tom Curran made 27 from 15 and Danny Briggs hit 29 from 11 balls as the first London derby of the tournament went down to the last ball. Oval Invincibles needed a maximum off the final ball to secure a stunning victory or a four to tie but Sunil Narine failed to make contact as a relieved London Spirit won by three runs. London Spirit finished bottom of The Hundred last summer – winning just one of their seven completed matches – but have made the perfect start to the 2022 edition at the expense of local rivals Oval Invincibles. The Invincibles finished fourth last year, narrowly missing out on a place in the eliminators, but will need to improve if they are to challenge for the title over the next month. Australia’s Nathan Ellis continued his impressive form (Picture: Getty) London Spirit made a fast start to their innings after being inserted, with Adam Rossington hitting two sixes and Zak Crawley able to play some shots following his recent red-ball struggles. Pakistan bowler Mohammad Hasnain dismissed both Spirit openers and when Narine had the dangerous Glenn Maxwell caught in the deep, the visitors’ innings threatened to stall. Morgan and Dan Lawrence ensured the Invincibles’ fightback was short-lived as they shared a 72-run partnership to take the score from 55-3 to 127-3. England’s 2019 World Cup-winning captain Morgan made ducks in his final two international innings but was able to rediscover his form against a strong Oval Invincibles bowling attack, hitting five fours and three sixes. Morgan fell with 12 balls remaining but West Indies all-rounder Kieron Pollard hit found the rope twice at the death to take London Spirit to their highest Hundred total. Hilton Cartwright kept Oval Invincibles in the contest (Picture: Getty) Narine and Reece Topley both impressed with the ball for Oval, claiming figures of 2-25 and 2-26 respectively, but the visitors looked to hold the advantage at the halfway stage. A star-studded Invincibles line-up was more than capable of knocking off the runs but the chase looked all-but over as they slipped to 20-4 in the powerplay. Struggling England opener Jason Roy was dismissed for a first-ball duck by Nathan Ellis and the Australian overseas also had Oval Invincibles captain Sam Billings caught at cover. In between Ellis’ brace, Yorkshire seamer Jordan Thompson picked up the scalps of local stars Sam Curran and Will Jacks to dampen the spirit of the home crowd. The Invincibles fought back through Cartwright, who smashed two sixes in his 23-ball 42, and Jordan Cox, who made a fluent 39, and Curran and Briggs continued the onslaught as the hosts sensed a remarkable win. London Spirit still appeared heavy favourites as Thompson looked to defend 17 from the final five balls but two edged boundaries kept the chase firmly alive. Six to win from the final ball became five when Thompson strayed down the leg-side but he and his London Spirit team-mates were relieved to see Narine fail to produce fireworks from the last ball as the home side’s valiant chase ended in disappointment. London Spirit will look to make it two wins from two when they welcome Manchester Originals to Lord’s on Monday, while Oval Invincibles can pick up their first win on Sunday against Welsh Fire. MORE : The Hundred: Full squads and fixtures for 2022 competition MORE : Jos Buttler vows to have ‘honest chat’ with his England team For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2022-08-04 20:37:05","image_url":"https://metro.co.uk/wp-content/uploads/2022/08/GettyImages-1412932706.jpg?quality=90&strip=all","source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games 2022: White Ferns crushed by England, to face Australia in semifinals","link":"https://www.newstalkzb.co.nz/news/sport/commonwealth-games-2022-white-ferns-crushed-by-england-to-face-australia-in-semifinals/","keywords":null,"creator":null,"video_url":null,"description":"By Kris Shannon in Birmingham Fortunately for the White Ferns, they were already assured a semifinal spot before their destruction by England. The bad news, however, is now they have to play Australia. New Zealand warmed up for the medal rounds in the worst possible fashion at Edgbaston today, losing to the hosts by seven wickets. The problem wasn't just the margin of the defeat - though that was less than ideal - but the manner. The White Ferns staggered to 71-9 after winning the toss and choosing to bat, a decision that looked ill-considered within four balls. The top order was scythed through, the middle order offered little and the lower order batted for time when runs were desperately needed. New Zealand coach Ben Sawyer. Photosport It all added up to New Zealand's third-lowest total in T20 internationals, removing some of the gloss from the competitive scores they posted in wins over South Africa and Sri Lanka to begin the tournament. In reply, there would only ever be one result, the sole question remaining was how quickly England would reach their target. And despite Fran Jonas striking in the first over of the chase, the answer soon became clear, the hosts roared on to reach their target in the 12th over. The White Ferns' penalty for playing their worst cricket in Birmingham will be a match against the best team in the world. Australia, naturally, advanced unbeaten through pool play, being pushed by India before crushing Barbados and Pakistan. They began the Commonwealth Games as heavy favourites to add this T20 crown to the ODI World Cup they won earlier this year in New Zealand, and nothing about the last week has changed that status. The White Ferns have two days to forget about this defeat and somehow find a way to topple Australia, or they will face a bronze-medal match against the loser of the other semifinal between England and India. New Zealand will certainly need a radically improved performance from their recognised batters to stand a chance. Skipper Sophie Devine saw her leg stump sent cartwheeling in the opening over but she, like Amelia Kerr, was at least the victim of a peach from England bowler Katherine Brunt, who finished with figures of 2-4 from three overs. Suzie Bates, who began the tournament with a brilliant 91 against South Africa, sent a simple catch to midwicket with a nonchalant flick. Brooke Halliday ran herself out in comical fashion before Hayley Jensen fell to an ugly off-side hack. That marked the halfway point of the innings, with the White Ferns on 35-5 and boasting only two boundaries to their name. They would collect just two more in the next 10 overs, as Maddy Green top scored with 19 from 24 balls before the tailenders oddly elected to occupy the crease rather than go down swinging. That left England to chase a straightforward target and, despite Kerr picking up a couple of wickets, left New Zealand to tackle the most unenviable task in cricket.","content":null,"pubDate":"2022-08-04 20:09:38","image_url":"https://www.newstalkzb.co.nz/media/ln5btska/brooke-halliday-heads-back-to-the-dressing-room-photosport.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Manchester Originals snap up Proteas rookie Tristan Stubbs for the Hundred – report","link":"https://www.iol.co.za/sport/cricket/manchester-originals-snap-up-proteas-rookie-tristan-stubbs-for-the-hundred-report-188c40dc-3c71-4c3f-8bac-334a9ffe8eea","keywords":null,"creator":["Zaahier Adams"],"video_url":null,"description":"After an impressive introduction to international cricket, Proteas rookie Tristan Stubbs has been snapped up by the Manchester Originals to participate in the Hundred competition.","content":null,"pubDate":"2022-08-04 18:37:48","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/c7256dc5-2d19-5f4c-86b6-041f01afa0fb&operation=CROP&offset=0x124&resize=3424x1924","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"CWG 2022: Indian women&#039;s cricket team maul Barbados by 100 runs, qualify for semifinals","link":"https://www.thehindu.com/sport/cricket/cwg-2022-indian-womens-cricket-team-maul-barbados-by-100-runs-qualify-for-semifinals/article65725224.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"With the win, India finished second behind Australia in Group A with four points from two wins","content":"India posted a competitive 162 for 4 on the back of a fine unbeaten half-century from Jemimah Rodrigues and a 26-ball 43 from opener Shafali Verma. | Photo Credit: PTI Medium pacer Renuka Singh ran through Barbados' top order with a four-wicket haul as India beat their lowly opponents by 100 runs to qualify for the semifinals of the women's T20 cricket at the Commonwealth Games in Birmingham on Wednesday. Invited to bat, India posted a competitive 162 for 4 on the back of a fine unbeaten half-century from Jemimah Rodrigues (56 not out off 46 balls) and a 26-ball 43 from opener Shafali Verma. The Indians then restricted Barbados to 62 for 8 in 20 overs with Renuka bamboozling the Barbados batters with an impressive spell. A fantastic victory for #TeamIndia . They win by 100 runs and advance into the semi-finals at the #CWG2022 👏👏 Scorecard - https://t.co/upMpWogmIP #INDvBAR #B2022 pic.twitter.com/uH6u7psVmG Captain Harmanpreet Kaur, Sneh Rana, Meghna Singh and Radha Yadav chipped in with a wicket apiece. Kyshona Knight was the top-scorer for Barbados with 16 while Shakera Selman made 12. Seven of their batters failed to reach double-digit figures. Barbados were dismissed for 64 in their nine-wicket defeat against Australia in an earlier match. With the win, India finished second behind Australia (6 points from 3 matches) in Group A with four points from two wins. They had beaten Pakistan and lost to Australia in their earlier matches. The semifinals will be played on Saturday. Renuka struck in the third ball of the Barbados innings, removing opener Deandra Dottin for a duck. She then dismissed captain Hayley Matthews (9), Kycia Knight (3) and Aaliyah Alleyne (0) in quick succession to reduce Barbados to 19 for 4 in nine overs. During the Indian innings, opener Smriti Mandhana (5), who hit a half century in India's win over arch-rivals Pakistan, fell cheaply but Verma and Rodrigues stitched a 71-run stand for the second wicket to prop up the innings. India were, however, in a spot of bother as captain Harmanpreet (0) departed just three balls after Verma's dismissal. But a 70-run partnership between Rodrigues and Deepti Sharma (34 not out) for the unbroken fifth wicket took India to a good total. For Barbados, Shanika Bruce, Hayley Matthews and Shakera Selman took a wicket each. Brief Scores: India: 162 for 4 in 20 overs (Jemimah Rodrigues 56 not out, Shafali Verma.43; Shanika Bruce 1/17) Barbados: 62 for 8 in 20 overs (Kyshona Knight 16; Renuka Singh 4/10). Our code of editorial values Printable version | Aug 4, 2022 11:21:36 pm | https://www.thehindu.com/sport/cricket/cwg-2022-indian-womens-cricket-team-maul-barbados-by-100-runs-qualify-for-semifinals/article65725224.ece © THG PUBLISHING PVT LTD.","pubDate":"2022-08-04 17:50:14","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Ireland vs South Africa LIVE: Cricket score and updates from Ireland v South Africa in England 2022","link":"https://www.independent.co.uk/sport/cricket/ireland-south-africa-live-stream-score-updates-b2138424.html","keywords":["Cricket","Sport"],"creator":["Sports Staff"],"video_url":null,"description":"Follow all the action from Seat Unique Stadium","content":null,"pubDate":"2022-08-04 17:30:22","image_url":"https://static.independent.co.uk/2022/06/06/13/newFile-4.jpg?width=1200&auto=webp","source_id":"independentuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"I was 'shattered,' says Glenn Maxwell after missing out on 2nd Test in Sri Lanka","link":"https://www.thehansindia.com/sports/cricket/i-was-shattered-says-glenn-maxwell-after-missing-out-on-2nd-test-in-sri-lanka-756421","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Glenn Maxwell has played 7 Tests for AustraliaHe last played a Test in 2017Australia recently played 2 Tests in Sri Lanka","content":"I was ‘shattered,’ says Glenn Maxwell after missing out on 2nd Test in Sri Lanka Australia all-rounder Glenn Maxwell has revealed he was \"shattered\" after missing out on playing the second Test in Sri Lanka. Maxwell, who last played a Test in 2017, was very close to wearing the Baggy Green again when Australia toured Sri Lanka in June-July this year. However, Australia decided to go with Travis Head instead of the Victorian cricketer due to the conditions in Galle. In a recent interview, Maxwell said that he was looking forward to returning to the Test side and had even prepared some tactics to tackle spin. Nevertheless, he did accept that the conditions certainly suited Head more. \"I was shattered when I got told. I really wanted to play. I loved being a part of it and I loved the thought of playing again. I felt like I was ready again. I loved working with the coaches and coming up with new tactics to deal with difficult spin bowling and balls exploding. \"I'm glad Heady got through his fitness test because I'd have hated to be in because of an injury to one of your players. If it was the same conditions for both Tests, I probably would have played. But they made a slightly better wicket and the selectors made the right call,\" Maxwell was quoted by Cricinfo, as saying in the interview. Australia lost the second Test by an innings and 39 runs and drew the two-match series 1-1. Maxwell is one of the vital cogs of the Aussie limited-overs side, mainly because of his explosive approach. He can also bowl off-spin and his excellent fielding skills are an added bonus. \"It's certainly nice to have support, where I feel like I probably didn't have that in the early days of my Test career. It was probably the other way around, where it was just like, no, can't have this guy in the team. So it's sort of nice to see it change. \"When I came back into the side in 2017, it felt like there was a real shift of positivity coming my way, which was rare. For so long, whenever I played a reverse sweep, it was frowned upon and it's become a staple of Test cricket wherever you play in the world,\" the 33-year-old player added further. Maxwell, who made his Test debut in India in 2013, has scored 339 runs at an average of 26.07, with 104 being his highest score. He has also picked up eight wickets, including a four-wicket haul. Overall, Maxwell has scored over 4,000 runs in First-Class cricket at an average of 39.81, while he also has 77 First-Class wickets to his name. A maiden Test century for Glenn Maxwell! It comes in just his fourth Test #IndvAus pic.twitter.com/8yso7XeqmP The Australians are currently on a break and their next series is scheduled to take place in the end of August when they host Zimbabwe in a three-match ODI series. Following that, the Australians host New Zealand in three ODIs before traveling to India for a three-match T20I series just ahead of the T20 World Cup, which they are set to host in Oct-Nov.","pubDate":"2022-08-04 17:20:55","image_url":"https://assets.thehansindia.com/h-upload/2022/08/04/500x300_1306408-maxe.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE STREAM: Oval Invincibles host London Spirit in The Hundred - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMidGh0dHBzOi8vd3d3LnNreXNwb3J0cy5jb20vY3JpY2tldC9uZXdzLzM2ODkyLzEyNjY0OTY0L2xpdmUtc3RyZWFtLW92YWwtaW52aW5jaWJsZXMtaG9zdC1sb25kb24tc3Bpcml0LWluLXRoZS1odW5kcmVk0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE STREAM: Oval Invincibles host London Spirit in The Hundred  Sky SportsThe Hundred - Oval Invincibles v London Spirit: Important Information - Kia Oval  The Kia OvalThe Hundred 2022, men's match preview: Manchester Originals v Northern Superchargers  The CricketerNorthern Superchargers put their faith in experience for Hundred campaign  Kidderminster ShuttleOval Invincibles v London Spirit predictions and cricket betting tips  Racing PostView Full coverage on Google News","content":null,"pubDate":"2022-08-04 16:58:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"I was getting goosebumps while watching PV Sindhu play: Indian women's cricket team star Renuka Singh","link":"https://www.indiatoday.in/sports/commonwealth-games-2022/story/i-was-getting-goosebumps-while-watching-pv-sindhu-play-indian-women-s-cricket-team-star-renuka-singh-1983905-2022-08-04?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"CWG 2022 | I was getting goosebumps while watching PV Sindhu play: Renuka Singh","content":null,"pubDate":"2022-08-04 16:48:15","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"}]}