{"newsArray":[{"title":"Old Trafford has seen it's fair share of Ashes heroics - from Laker's 10-for to Warne's ball of the century - but now England must hope to create further history against Australia in fourth Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12313191/Old-Trafford-seen-fair-share-Ashes-heroics-Lakers-10-Warnes-ball-century-England-hope-create-history-against-Australia-fourth-Test.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SHUBI ARUN: The first three Tests of this series have gone down to the wire and it's safe to assume that Ben Stokes's Bazball brigade will ensure the fourth Test isn't lacking in theatre.","content":"Old Trafford has hosted its fair share of Ashes heroics - from Laker's 10-for to Warne's ball of the century - now England must hope for more thrills in must-win fourth Test against Australia Old Trafford has played host to some of the most memorable Ashes moments The late Shane Warne bowled the ball of the century in his first Ashes in 1993 Stokes backs his side to play the perfect fast-forward game against Australia By Shubi Arun For Mail+ Updated: 01:07, 19 July 2023 e-mail View comments All eyes are now on Old Trafford. The Ashes head to Manchester, delicately poised at 2-1 in Australia ’s favour. England may have pulled off an important victory at Headingley down to the heroics of Mark Wood and Chris Woakes in the run chase, but nothing less than a repeat performance win will do as the hosts arrive at Old Trafford. The weather forecast is far from promising, too, leading to speculation that Ben Stokes will have something special planned and remains confident his side have time to pull off a memorable win with the fourth Test set to be curtailed by rain. The first three Tests of this series have gone down to the wire and it’s safe to assume that Ben Stokes’s Bazball brigade will ensure the fourth Test isn’t lacking in theatre. We’re in for a treat if it’s anything like these… Ben Stokes' side need to win to take this nail-biting series to the final Test at The Oval Pat Cummins' Australian side just need a draw to hold onto the Ashes urn for another cycle 1. The Tate Test of 1902 Having a Test named after you is normally an honour, but in Fred Tate’s case it was the opposite. England were 1-0 down going into the fourth Test of the 1902 Ashes and in desperate need of a result. After taking a 37-run lead into their second innings, Australia found themselves hobbled at 10 for three. Tate, who until then had been relatively peripheral to proceedings, then stepped to the fore. He dropped a simple catch at square leg to reprieve Australia captain Joe Darling, missing the chance to all but wrap up the tourists’ innings. Darling and Syd Gregory then put on a 54-run partnership and, while Australia were eventually dismissed for 86, the 124 England were set to win looked a Herculean task on a near unplayable pitch. When No 11 Tate stepped out to bat, England were eight runs short. Amazingly, he hit the first ball for four before blocking out the next two. But that’s where his luck ran out and he was bowled with England still four runs shy of their target. It was all too much for Tate, who broke down down in tears on the pitch. It was the only Test he ever played for England. Fred Tate had a Test to forget in 1902 after dropping a number of catches and scoring just four in the ultimately failed run chase 2. Laker’s 10-for in 1956 At Old Trafford in the 1956 series, England’s Jim Laker became the first player in the history of Tests to take 10 wickets in an innings. While that feat has since been replicated by India’s Anil Kumble and New Zealand’s Ajaz Patel, Laker’s figures of 19 for 90 in the match remain the best in Tests. Laker’s heroics saw England win by an innings and 170 runs. 3. ‘Best-ever’ Botham knock in summer of ’81 This was the summer of Ian Botham. The all-rounder’s match-winning displays in the third and fourth Tests had already made him a national hero and put England 2-1 up in the series. Beefy then added to Australia’s misery at Old Trafford. Walking into bat with England 104 for five in the second innings, Botham went on the counter-offensive and scored a staggering 118 from 102 balls. His blitz left the tourists with a near-impossible target of 506, and they fell way short. Botham played plenty of match-defining innings in that series alone but he called his knock at Old Trafford ‘probably the best I ever played’. Botham scored a staggering 118 from 102 balls to rescue England from 104 for five at Old Trafford 4. Warne’s ball of the century in ’93 England spinner Peter Such took six-for on debut, Graham Gooch became only the fifth player to be out for handling the ball and Ian Healy scored a remarkable hundred batting at No 7. But the first Test of the 1993 Ashes is remembered only for Shane Warne’s Ball of the Century. With his first ball in the iconic series, Warne dismissed Mike Gatting with an absolute ripper that pitched outside leg but hit off-stump. The delivery set the tone for the series — Warne went on to take 34 wickets as Australia romped to a 4-1 win. Shane Warne's iconic ball of the century dismissed England veteran Mike Gatting in his first ever ball of Ashes cricket 5. Australia hold on for draw in 2005 Following their two-run win at Edgbaston to level the series, England had their tails up going into the third Test at Old Trafford. From the get-go, they had Australia on the ropes and set the tourists a daunting 423 to win on day five. With the pressure on, captain Ricky Ponting led by example by hitting a remarkable 156. His dismissal four overs before the end of the day’s play left England on the brink of victory, but Glenn McGrath and Brett Lee bravely hung on to take the Aussies to safety Ashes legend Freddie Flintoff revels in dismissing Warne in the nail-biting 2005 draw Share or comment on this article: Old Trafford has hosted its fair share of Ashes heroics - from Laker's 10-for to Warne's ball of the century - but now England must hope to create further history against Australia in fourth Test e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 00:00:20","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/00/73363131-0-image-a-69_1689724761642.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"MATCH POINT: Brilliant men's final must not mask the need for change at Wimbledon... the All England Club must have a fresh look at where the event is heading","link":"https://www.dailymail.co.uk/sport/tennis/article-12313069/MATCH-POINT-Brilliant-mens-final-not-mask-need-change-Wimbledon-England-Club-fresh-look-event-heading.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"MIKE DICKSON: Staring at the back of Brad Pitt's coiffured head during the Wimbledon men's singles final, as you do, there was this strange hope that the Hollywood star was enjoying himself.","content":"MATCH POINT: Brilliant men's final must not mask the need for change at Wimbledon... the All England Club must have a fresh look at where the event is heading Carlos Alcaraz's victory will be the main memory from this edition of Wimbledon The thrilling final must not dampen discussion on how the sport can improve All England Club chairman Deborah Jevans can be a catalyst for positive change Latest Wimbledon 2023 news, including schedule, travel updates and results By Mike Dickson for the Daily Mail Updated: 00:45 BST, 19 July 2023 e-mail View comments Staring at the back of Brad Pitt ’s coiffured head during the Wimbledon men’s final, as you do, there was this strange hope that he was enjoying himself. One of many A-listers in attendance, and seated just in front of the press zone, the Hollywood star must surely have been swept up in the thunderous climax along with everyone else. It was a fantastic occasion and proof that, at its best, tennis can provide unique drama and is peak theatre, at least as good to watch as any other sport. Wimbledon 2023 will be remembered for its brilliant men’s final and quite likely as a defining point in its history, although those rushing to judge this as the end of the Novak Djokovic era could be premature. In six months’ time the Serb will be back in Melbourne, and if Carlos Alcaraz meets him there, he may be expected to beat him again, which is a very different dynamic. Carlos Alcaraz's triumph in the men's singles final may be viewed as a defining point for tennis Actor Brad Pitt, right, must have been among those swept up in the thunderous climax Alcaraz's win was significant but it is too early to declare the end to Novak Djokovic's era Just as the Spaniard’s victory should not be taken as an automatic regime change, the incredible finish to Wimbledon should not place it as one of the great editions of the Championships. This was not a vintage year overall, although it panned out as a better tournament than it might have looked early on. The omens were not great when Nick Kyrgios pulled out at the last minute and Coco Gauff lost on the first day, adding to those already missing from the singles. As it happened there were plenty of storylines and, as ever, a fair smattering of good matches. Chris Eubanks, Mirra Andreeva and Elina Svitolina were among those who always emerge to keep things bubbling. So it was not that the men’s final made this Wimbledon a case of all fur coat and no knickers. Alcaraz-Djokovic, however, should not be allowed to dampen discussion on how the game can improve itself and increase the sum of its total parts. The pace of play and the amount of dead time in matches still need addressing. How, for example, can Djokovic be allowed to stop the final for seven minutes to visit the loo? Many found it utterly tedious when the Serb often bounced the ball around 20 times before both first and second serve (again legally). The spectacle would not have suffered if a tiebreak had come at 5-5, and the 26-minute game in the middle of the third set did not add much. It was interesting to hear Holger Rune, in the vanguard of the next generation, say that he would quite happily play a deciding point at deuce. If matches did not last so long then players would not get injured so often, or pull out of events with the now accepted excuse of ‘fatigue’. One era change that is definitely occurring at Wimbledon, obviously less noticed outside the parish, is the arrival of a new All England Club chairman, Deborah Jevans. It is to be hoped that she recognises some of this, and can be a catalyst for constructive change. Rising star Holger Rune floated the idea of a deciding point when a game reaches deuce New All England Club chairman Deborah Jevans, left, can be a catalyst for positive change Jevans must take a fresh look at where the All England Club is heading and help unify the sport Amid the sport’s fractured governance, Jevans would find an ally in Tennis Australia’s chief executive Craig Tiley, who definitely gets that you cannot stand still in a changing marketplace. As a former player, Jevans will bring much-needed tennis knowledge to the leaders’ table, and also the experience of working in other sports. She ought not to have a problem understanding the wider context. Jevans has a considerable in-tray when it comes to more local matters. A fresh look is required at where the All England Club, this odd hybrid of elite private members’ club and magnificent flagship sporting event, is heading, and how it connects and communicates with the outside world. A particular issue to be resolved is the impasse that has developed around its expansion plans into neighbouring land on the former golf course. Beyond that is bringing the clout that Wimbledon has in helping unify the way the whole sport is run. Not an easy task when all the actors seek to protect what is theirs, and are so reluctant to pool sovereignty. A co-ordinated approach to improving and updating the offering has never been more needed, especially when it comes to the women’s game. Sport and society are changing rapidly, and in the sphere of racket sports, Padel and Pickleball are attractive alternatives. Saudi Arabia waits in the wings, and as Europe gets poorer the Middle East is where the new money is found. Wimbledon will always be a great fortnight. There is a timely parallel as this gripping Ashes series plays out — there should be no worries about the future of England versus Australia in the five-day format, but the wider body of Test cricket has concerns that are very real. Pride restored by our Henry It turned out to be a Wimbledon of two halves for British tennis and the LTA, with the second week more encouraging than the first. It has to be said that the first week was the more important one (by Saturday night there were no home singles players remaining), and serious questions persist about how and where it spends the money generated by the success of the Championships. But credit where it is due, boys’ champion Henry Searle is a product of the system and attends the Loughborough Academy. Somebody has done a good job with a technique that looks well-equipped for the modern game. Henry Searle became Britain's first boys singles champion at Wimbledon since 1962 Neal Skupski triumphed in the men's doubles event alongside Dutchman Wesley Koolhof Congrats, too, to Neal Skupski and others who achieved good wins. It is heartening to see Wimbledon champions coming out of places such as Liverpool and Wolverhampton. It cannot be stressed enough that this is only the end of the beginning for the likes of Searle, 17. The road is long and paved not with the somewhat exceptional surface of grass, but the concrete and clay that prevails at other times of the year. As with every aspiring player, he will have to hack it playing Futures and Challengers in places like Turkey, Tunisia and Egypt, where the audience is made up of coaches, players and a few random holidaymakers. Annabel Croft steps into Sue Barker's shoes Bravo Annabel Croft, who did a fine job stepping into the very considerable shoes of Sue Barker when it came to the highest-profile Centre Court interviews. The 57-year-old authoritatively knows the sport, as well as having strong presentational skills — it might even catch on in the BBC’s coverage. Sitting in the middle of the Wimbledon maelstrom, there is not time to catch a lot of the corporation’s TV output, therefore I cannot offer too much of a critique. However, even when dipping in, it backed up what you heard about too many slip-ups being made — matches are not ‘games’, and Carlos Alcaraz is not a teenager, for example. Anyone can make mistakes, but when investing around £70million of licence payers’ money, you would think the Beeb might insist on all its talent having a working knowledge of tennis, which is more easily acquired by covering events between one Wimbledon and another. Annabel Croft did a fine job in replacing Sue Barker for the main centre court interviews Share or comment on this article: MATCH POINT: Brilliant men's final must not mask the need for change at Wimbledon... the All England Club must have a fresh look at where the event is heading e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 23:45:19","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/00/73362601-0-image-a-85_1689723610687.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Consolation 69-run win for England in final Women's Ashes ODI against Australia","link":"https://www.sootoday.com/national-sports/consolation-69-run-win-for-england-in-final-womens-ashes-odi-against-australia-7293966","keywords":null,"creator":["Canadian Press"],"video_url":null,"description":"TAUNTON, England (AP) — Nat Sciver-Brunt hit another century as England claimed a Women’s Ashes series draw with a 69-run win over Australia under the DLS method in the final one-day international at Taunton.","content":"TAUNTON, England (AP) — Nat Sciver-Brunt hit another century as England claimed a Women’s Ashes series draw with a 69-run win over Australia under the DLS method on Tuesday in the third and final one-day international at Taunton. Victory saw the multi-series format drawn 8-8 on points — the same score as when England last avoided Ashes defeat in Australia five years ago — and meant England had won both the ODI and Twenty20 series 2-1. Urn holder Australia had already retained the Ashes by winning the second ODI in Southampton on Sunday. England trailed 6-0 after the opening two matches of the multi-format series — the solitary test and the T20 opener — but rallied to win four of the remaining five white-ball contests. “To win two series against the world champions in both formats is brilliant,” said England captain Heather Knight, who scored 67. “The Ashes had gone the other day and the disappointment came out then. But the character in the side to turn it around here was unbelievable.\" Fresh from her unbeaten 111 at Southampton, Sciver-Brunt made her second hundred in three days — 129 runs from 149 balls — as England was put into bat and finished on 285-9 to set Australia a challenging target. Sciver-Brunt scored a fourth century from five ODIs against Australia, and the seventh of her England career in this format. Sciver-Brunt’s resistance finally ended in the 48th over as Jess Jonassen tempted an airborne pull into the safe hands of Ashleigh Gardner. Gardner took 3-39 in 10 overs, and Jonassen 3-30 in five. Australia’s target was reduced to 269 from 44 overs by rain and, despite Gardner providing brief hope with 41 from 24 balls, the visitors were bowled out for 199 in 35.3 overs as England ran out comfortable winners to the delight of a capacity crowd. Ellyse Perry top-scored with 53. “We didn’t get over the line in the white-ball stuff but I’m proud the way the series has unfolded. It’s been an amazing spectacle for cricket in general and really cool to be part of it,\" Australia captain Alyssa Healy said. “It’s no secret we haven’t played our best throughout the entire series . . . We’ll sit back now and see what’s not quite gone well for us. In the long run it might do us good to have those reflections and know that we can be better.” ___ AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports The Associated Press","pubDate":"2023-07-18 22:14:53","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/07/2023071817070-64b6fd77173864db0af27989jpeg.jpg;w=960","source_id":"sootoday","category":["sports"],"country":["canada"],"language":"english"},{"title":"‘We’ve got the trophy but we’re not happy’: Australia lose first ODI series in decade as women’s Ashes ends in draw","link":"https://www.theage.com.au/sport/cricket/we-ve-got-the-trophy-but-we-re-not-happy-australia-lose-first-odi-in-a-decade-as-women-s-ashes-ends-in-draw-20230719-p5dpdx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Glenn Moore"],"video_url":null,"description":"Australia had already retained the Ashes, but Tuesday’s heavy one-day defeat means they have drawn the series eight-all under the multi-format points system.","content":"Australia have been beaten in an ODI series for the first time in a decade, thrashed by 69 runs by England in the only blow-out of the women’s Ashes series. Set a revised target of 269 off 44 overs in Taunton on Tuesday, having initially been asked to make their second-highest successful chase of 286, Australia stumbled after the rain break, then crumbled from 6-190 to 199 all out off 35.3 overs. Only Ellyse Perry, with 53 off 58 balls, and Ashleigh Gardner with a blazing 41 off 24, mustered serious resistance. It was Australia’s worst loss in terms of runs since 2008, and England’s biggest win over Australia since their first ODI against them in 1973. Victory in Southampton on Sunday meant Australia had already retained the Ashes, but they have not won the series, which was drawn eight-all under the multi-format points system. England actually won more matches, four to three, taking eight of the last 10 points, but Australia won the Test which was worth four points while the six white-ball matches were worth two apiece. Nat Sciver-Brunt leading the England charge at Taunton. Credit: Reuters “We’ve got the trophy but we’re not happy about not winning this series,” Alyssa Healy said. “We haven’t lost an ODI series for a very long period of time. It feels a bit dirty, at the end of the day.” Nat Sciver-Brunt anchored England’s 9-285 with a second successive century. She hit 129 off 149 balls as the hosts recovered from a bad start to post their highest ODI score. “It feels like a moral victory,” she said. Australia have only once chased a higher total to win, but the Somerset ground is a high-scoring venue so they had reason to believe. Healy put England in and opened with spinner Gardner, who soon dismissed the out-of-form Sophia Dunkley. More significant was Megan Schutt bowling the in-form Tammy Beaumont cheaply. That brought England’s most experienced pair, Heather Knight and Sciver-Brunt, to the crease. They rebuilt, slowly at first, then accelerated towards a century partnership. Having put on 147, Knight was bowled by Alana King for a 72-ball 67 and Alice Capsey holed out off Jess Jonassen soon after. But Sciver-Brunt, who had been dropped by Tahlia McGrath on 54, moved on to a 126-ball century scoring almost exclusively on the leg side. She became the first player to make four centuries against Australia, all scored in her last five Ashes ODIs. Danni Wyatt (43 off 25) provided strong support but was bowled by Gardner, who then caught Sciver-Brunt off Jonassen on the boundary. Gardner finished with 3-39 off 10 overs and Jonassen 3-30 off five as England’s tail wagged limply. The tourists also began slowly, being 2-15 with Phoebe Litchfield (one) caught first slip and Healy (seven) bowled. Perry and McGrath (26) took the score to 68 before the latter was stumped. Beth Mooney joined Perry but nine runs later rain arrived. When the teams returned, Australia needed another 172 runs from 148 balls. Perry moved past her half-century, smashing a no-ball free-hit for six, but was then caught off a leading edge. Mooney went soon after (16) but Gardner came in to smack sixes square and straight. But then she chanced a second run to Wyatt and was run out. After Amy Jones pulled off another smart stumping to dismiss Georgia Wareham (14 off nine), the end came quickly. Annabel Sutherland was bowled for 18, King caught behind for a duck and Jonassen last out for five. AAP Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-18 22:04:27","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘We’ve got the trophy but we’re not happy’: Australia lose first ODI series in decade as women’s Ashes ends in draw","link":"https://www.smh.com.au/sport/cricket/we-ve-got-the-trophy-but-we-re-not-happy-australia-lose-first-odi-in-a-decade-as-women-s-ashes-ends-in-draw-20230719-p5dpdx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"Australia had already retained the Ashes, but Tuesday’s heavy one-day defeat means they have drawn the series eight-all under the multi-format points system.","content":"Australia have been beaten in an ODI series for the first time in a decade, thrashed by 69 runs by England in the only blow-out of the women’s Ashes series. Set a revised target of 269 off 44 overs in Taunton on Tuesday, having initially been asked to make their second-highest successful chase of 286, Australia stumbled after the rain break, then crumbled from 6-190 to 199 all out off 35.3 overs. Only Ellyse Perry, with 53 off 58 balls, and Ashleigh Gardner with a blazing 41 off 24, mustered serious resistance. It was Australia’s worst loss in terms of runs since 2008, and England’s biggest win over Australia since their first ODI against them in 1973. Victory in Southampton on Sunday meant Australia had already retained the Ashes, but they have not won the series, which was drawn eight-all under the multi-format points system. England actually won more matches, four to three, taking eight of the last 10 points, but Australia won the Test which was worth four points while the six white-ball matches were worth two apiece. Nat Sciver-Brunt leading the England charge at Taunton. Credit: Reuters “We’ve got the trophy but we’re not happy about not winning this series,” Alyssa Healy said. “We haven’t lost an ODI series for a very long period of time. It feels a bit dirty, at the end of the day.” Nat Sciver-Brunt anchored England’s 9-285 with a second successive century. She hit 129 off 149 balls as the hosts recovered from a bad start to post their highest ODI score. “It feels like a moral victory,” she said. Australia have only once chased a higher total to win, but the Somerset ground is a high-scoring venue so they had reason to believe. Healy put England in and opened with spinner Gardner, who soon dismissed the out-of-form Sophia Dunkley. More significant was Megan Schutt bowling the in-form Tammy Beaumont cheaply. That brought England’s most experienced pair, Heather Knight and Sciver-Brunt, to the crease. They rebuilt, slowly at first, then accelerated towards a century partnership. Having put on 147, Knight was bowled by Alana King for a 72-ball 67 and Alice Capsey holed out off Jess Jonassen soon after. But Sciver-Brunt, who had been dropped by Tahlia McGrath on 54, moved on to a 126-ball century scoring almost exclusively on the leg side. She became the first player to make four centuries against Australia, all scored in her last five Ashes ODIs. Danni Wyatt (43 off 25) provided strong support but was bowled by Gardner, who then caught Sciver-Brunt off Jonassen on the boundary. Gardner finished with 3-39 off 10 overs and Jonassen 3-30 off five as England’s tail wagged limply. The tourists also began slowly, being 2-15 with Phoebe Litchfield (one) caught first slip and Healy (seven) bowled. Perry and McGrath (26) took the score to 68 before the latter was stumped. Beth Mooney joined Perry but nine runs later rain arrived. When the teams returned, Australia needed another 172 runs from 148 balls. Perry moved past her half-century, smashing a no-ball free-hit for six, but was then caught off a leading edge. Mooney went soon after (16) but Gardner came in to smack sixes square and straight. But then she chanced a second run to Wyatt and was run out. After Amy Jones pulled off another smart stumping to dismiss Georgia Wareham (14 off nine), the end came quickly. Annabel Sutherland was bowled for 18, King caught behind for a duck and Jonassen last out for five. AAP Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-18 22:04:27","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Bumble's guide to Manchester: The pubs and poultry are perfect! As England could level the series if Moeen Ali's 'nuts' decision pays off","link":"https://www.dailymail.co.uk/sport/cricket/article-12312489/Bumbles-guide-Manchester-pubs-poultry-perfect-England-level-series-Moeen-Alis-nuts-decision-pays-off.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID LLOYD: There's no place like Manchester. You can walk anywhere and if you don't fancy a stroll, get on the tram! When I was at Sky, they got me driving one.","content":"Bumble's guide to Manchester: The pubs and poultry are perfect! And England could level the series if Moeen Ali's 'nuts' decision pays off England and Australia begin a pivotal fourth Test at Old Trafford on Wednesday For atmosphere, the Old Trafford crowd matches Edgbaston and Headingley Ben Stokes could opt for an even more offensive approach in Manchester By David Lloyd for the Daily Mail Updated: 17:42 EDT, 18 July 2023 e-mail View comments It’s like coming home. The Green Green Grass of Home as Tom Jones sang. This ground is state-of-the-art and steeped in tradition. We’ve seen fantastic players here over the years. Who can forget our king Wasim Akram? For atmosphere, the Old Trafford crowd matches Edgbaston and Headingley. The party stand will be loud and England need that 12th man! There’s no place like Manchester. You can walk anywhere and if you don’t fancy a stroll, get on the tram! When I was at Sky, they got me driving one. I had to wear the hi-viz. I was driving fine until I missed an automatic spot and the tram stopped suddenly. Everyone inside was thrown forward! On Portland Street, there’s the legendary Grey Horse Inn, the Circus Tavern, which is the smallest pub in the city, and the Old Monkey virtually next to each other. And sandwiched between them is a chicken shop. You can walk anywhere in Manchester and if you don’t fancy a stroll you can get on the tram For atmosphere, the Old Trafford crowd matches those found at Edgbaston and Headingley The Circus Tavern, located in Manchester City centre, is one of the smallest bars in Europe Now that’s what you call planning. Five minutes away, you’ve got the City Arms and the Vine Inn and they’re connected to each other, too. Stand outside and watch the world go by. Then there’s Peveril of the Peak, the Marble Arch Inn and the Briton’s Protection. I’ll be everywhere. If you want a bit of live rock ’n’ roll, get to the Northern Quarter and the Band on the Wall. Canal Street is in the centre of the Gay Village. It’s well worth a visit! For food, just behind Portland Street is the fabulous Chinatown. The Little Yang Sing is a personal favourite. For your curries, go anywhere. Everyone does it right. Head to Fumo for an Italian and some fine people-watching. Dr John Cooper Clarke was there earlier this week. Anyway, we’re here for the cricket and I hear Ben Stokes is going to go even more attacking. I look forward to watching that but it might be kamikaze! It will be a good pitch but with the recent weather I doubt it will have the same pace as Headingley. Moeen Ali, batting at three, has put his hand up for the greater good as nobody wants to do it Australia captain Pat Cummins (right) has decided to drop Todd Murphy (left) meaning the visitors will go into a Test without a specialist spinner for the first time since 2012 Australia are going without a frontline spinner and I don’t know what Shane Warne would have made of that. I’d always pick a spinner here. Stokes loves to chase and he knows Australia’s spin options aren’t strong, so England will surely bowl first if they win the toss. A word for Moeen Ali, batting at three. He’s put his hand up for the greater good because nobody wants to do it. It’s terrific of him. It’s also nuts! From retirement to frontline spinner and batting at three in the Ashes. Main man Mo! By the way, there’s another Old Trafford nearby. They play this thing called football there. Don’t go to the wrong one. And if you want to hear me on the wireless, I’m commentating on this Test for the Australian radio channel SEN. Share or comment on this article: Bumble's guide to Manchester: The pubs and poultry are perfect! As England could level the series if Moeen Ali's 'nuts' decision pays off e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 21:41:38","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/22/73359381-0-image-a-9_1689716481307.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"JASON GILLESPIE: Going into the fourth Ashes Test without a frontline spinner carries considerable risk...but Travis Head's bowling display at Headingley and the returning Cameron Green have convinced Australia's think-tank its one worth taking","link":"https://www.dailymail.co.uk/sport/cricket/article-12312381/JASON-GILLESPIE-Going-fourth-Ashes-Test-without-frontline-spinner-carries-considerable-risk-Travis-Heads-bowling-display-Headingley-returning-Cameron-Green-convinced-Australias-think-tank-one-worth-taking.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JASON GILLESPIE: I would have expected Cummins to use his off-spinner during England's run-chase had Lyon been there. So it's not a surprise that Murphy has been left out of the fourth Test.","content":"JASON GILLESPIE: It's sad when Australia don't trust their spinner. I'd play Todd Murphy... but Pat Cummins has got his way with an all-pace attack England and Australia face off in the fourth Test at Old Trafford on Wednesday Australia go into the tie without a specialist spinner for the first time since 2012 All-rounder Cameron Green returns to the side following a hamstring issue By Jason Gillespie For The Daily Mail Updated: 22:40 BST, 18 July 2023 e-mail View comments If Todd Murphy was truly picked to fill the role vacated by Nathan Lyon, then why was he not bowled for more than two overs on the last day at Headingley by Pat Cummins ? Certainly, I would have expected the Australia captain to use his off-spinner in those key moments of the England run-chase had Lyon been there. So it’s not a great surprise to me that Australia have left Murphy out of Wednesday's fourth Test. Is that a trust issue? Is Cummins not sure whether Murphy has what it takes? Or was he just protecting his young spinner in Leeds when he was up against some really good, aggressive England batsmen ? It is an interesting debate, particularly as on Wednesday Australia are going into a match without a specialist spinner for the first time in Test cricket since 2012. I do rate Murphy. He’s a good young bowler and I would be loath to go into any Test without a frontline spinner. I would have played him at Old Trafford. But maybe Mitchell Marsh created a nice little problem for Australia with the way he played at Headingley. And Travis Head bowled pretty well at Lord’s when Lyon went down, so clearly the think-tank have decided they can use his spin now and leaving Murphy out is their best way of getting Cameron Green back into the side. Australia captain Pat Cummins has decided not to select a specialist spinner for the fourth Test Off-spinner Todd Murphy has been dropped for the fourth Ashes Test at Old Trafford All-rounder Cameron Green has been recalled to the Australia side for the pivotal clash Australia will use Head in a defensive role with the ball and then attack with their quicks and rotate them. Green, after his hamstring niggle, could be used in short, sharp bursts with Marsh bowling some overs alongside the big three quicks. I’m not surprised Josh Hazlewood is back because England have attacked Scotty Boland. It may sound odd but that is a bit of a feather in Boland’s cap because it means England respect him and the way he goes about his work. There is no surprise either in David Warner retaining his place. Australia coach Andrew McDonald likes experienced players and it’s getting to the nitty-gritty of this Ashes now when you need that experience. Cummins would be of the same mind-set. There have been such fine margins in this series. It could be 3-0 to either side now but it’s 2-1 and Australia know if they nail their skills and stick to their processes this week they could become the first touring side to win an Ashes series in England since 2001. England will try to drive this Test forward, particularly if there’s bad weather around, but Australia can play the long game. It’s OK for them to win after tea on day five even if England seem to be looking to win it by the morning of day three! We all know England want to entertain and put on a show but there are many ways to entertain and a Test going deep into day five with a positive result at the end of it is proper entertainment, too. But make no mistake, Australia will be playing to win this Test. They won’t be going into it looking for the draw they need to retain the urn. There is no surprise in David Warner (pictured) retaining his place as Australia coach Andrew McDonald likes to included experienced players in his line-up Australia will use Travis Head (picture) in a defensive role with the ball and then attack with their quicks and rotate them The teams are close but have very different methods and that’s what we love about Test cricket. There are so many ways to approach the game and have success. I was at the first two Tests but I watched the third from home in Adelaide and there is no doubt this series has captured the imagination of both sides of the Ashes divide. It’s been a big deal here in Australia. It’s awesome. And there are similar vibes to 2005. Old Trafford is one of the great venues in cricket and I’ve no doubt the Lancastrians will come out in full support of England. There will be a raucous atmosphere and it’s a really exciting prospect. I predicted a 3-1 victory for Australia before the start of this series and I’m not going to change that now. The rain I expected for at least one Test could have an impact on this game but I hope not. Let’s hope for clear skies and a cracking game. I can’t wait to see what happens. Share or comment on this article: JASON GILLESPIE: Going into the fourth Ashes Test without a frontline spinner carries considerable risk...but Travis Head's bowling display at Headingley and the returning Cameron Green have convinced Australia's think-tank its one worth taking e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 21:40:43","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/20/73354739-0-image-a-66_1689707995618.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Heather Knight proud of England’s Ashes fightback","link":"https://www.independent.co.uk/sport/cricket/england-heather-knight-odi-england-cricket-t20-b2377669.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"England won both white-ball series 2-1.","content":"Captain Heather Knight declared herself “super-proud” after her England team completed a remarkable Women’s Ashes turnaround to draw the series. England trailed 6-0 after the opening two matches of the multi-format series – the solitary Test and the T20 opener – but rallied to win four of the remaining five white-ball contests to draw 8-8. After winning the T20 matches 2-1, England’s 69-run victory by DLS method at Taunton on Tuesday gave them a second white-ball series victory over the world’s number one side. “To win two series against the world champions in both formats is brilliant,” Knight said. “The Ashes had gone the other day and the disappointment came out then. But the character in the side to turn it around here was unbelievable. “We wanted to do justice to the way we have played so far, and it was a sell-out in front of a rowdy crowd. “We wanted to continue to entertain and play how we want to. An ODI series on the line, there’s no bigger (test of) character than that against a team we haven’t beaten in 10 years. “There’s disappointment we haven’t got the Ashes but it’s a draw, and if you’d told me that at 6-0 down I would have bitten your hand off.” Nat Sciver-Brunt’s second century in the space of three days – 129 on the back of an unbeaten 111 at Southampton on Sunday – laid the platform for England’s series-levelling success. England posted a challenging score of 285 for nine from their 50 overs; Australia’s target was reduced to 269 from 44 overs after a 54-minute rain delay. Kate Cross took three wickets and Lauren Bell and Charlie Dean two each as Australia slid to 199 all out in 35.3 overs. “Nat is unbelievable,” said Knight. “She’s got four hundreds in five games against the best team in the world. “We talked about staying positive and believing that we were good enough to beat this side. “Despite losing those two games it actually grew the belief that we were as good as this Australian team and we could go toe to toe with them. “We had to do a few little things better because we felt we were so close in that Edgbaston (T20) defeat. “To play like we have done this summer has been hugely pleasing. The most exciting thing is that we haven’t played our best cricket, this was probably our best performance. “I think this team has got a huge ceiling to keep improving. I don’t think there is a gap between the two sides now. We’ve won two white-ball series, I’m not sure about the gap.” Australia captain Alyssa Healy said the tourists could take satisfaction that the Ashes were “still within our grasp”. Healy said: “We didn’t get over the line in the white-ball stuff but I’m proud the way the series has unfolded. “It’s been an amazing spectacle for cricket in general and really cool to be part of it. “It’s no secret we haven’t played our best throughout the entire series. “England played really well and that’s not diminishing what they’ve achieved, we’ve not. We’ll sit back now and see what’s not quite gone well for us. “In the long run it might do us good to have those reflections and know that we can be better.”","pubDate":"2023-07-18 21:13:23","image_url":"https://static.independent.co.uk/2023/07/18/22/660493df4e68fc12682ac0b090455742Y29udGVudHNlYXJjaGFwaSwxNjg5Nzk5ODE5-2.73023566.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England claim Women’s Ashes series draw after fresh heroics from Nat Sciver-Brunt","link":"https://www.standard.co.uk/sport/cricket/womens-ashes-result-england-australia-nat-sciver-brunt-b1095248.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"Nat Sciver-Brunt was the hero again as England claimed a Women’s Ashes series draw with a 69-run win over Australia on the DLS method in the final ODI in Taunton.","content":"at Sciver-Brunt was the hero again as claimed a series draw with a 69-run win over on the DLS method in the final ODI in Taunton. Victory saw the multi-series format drawn 8-8, the same score as when England last avoided Ashes defeat in Australia five years ago, and meant England had won both the ODI and Twenty20 series 2-1. Australia had already retained the Ashes by winning the second ODI in Southampton on Sunday. Fresh from her unbeaten 111 at Southampton, Sciver-Brunt made her second hundred in the space of three days - 129 from 149 balls - as Australia were set a challenging 286 for victory. Batting of the highest order also secured Sciver-Brunt a fourth century from five ODIs against Australia, and the seventh of her England career in this format. Australia's target was reduced to 269 from 44 overs by rain and, despite Ashleigh Gardner providing brief hope with a bludgeoning 41 from 24 balls, they were bowled out for 199 as England ran out comfortable winners to the delight of a capacity crowd. SPONSORED England, having lost the toss, were soon in trouble as openers Sophia Dunkley and Tammy Beaumont departed with just 12 runs on the board. Captain Heather Knight and Sciver-Brunt rose to the challenge of repairing the innings, leading England to 43 for two by the end of the first powerplay after 10 overs. Runs came freely with Knight finding gaps in the field with ease and Sciver-Brunt, who survived a stumping review off Gardner on 25, landing a six on the boundary cushion with imperious precision. But with McGrath spilling a return chance off Sciver-Brunt, then on 54, the third-wicket partnership was worth 147 when Knight advanced down the wicket to Alana King and was bowled for 67, her 72-ball stay containing six fours and a six. Alice Capsey dragged Jess Jonassen to long-on for five but huge roars greeted Sciver-Brunt as she reached three figures off 126 balls. England entered the final 10 overs seeking to accelerate and Danni Wyatt played the perfect cameo with a whirlwind 43 from 25 balls before being bowled attempting to cut a full-length ball from Gardner. Amy Jones was run out for six and Sciver-Brunt's resistance finally ended in the 48th over as Jonassen tempted an airborne pull into the safe hands of Gardner. The latter then won an lbw review against Charlie Dean to finish with three for 39 and Jonassen also collected a third scalp by castling Kate Cross as England closed on 285 for nine. Australia, as England had done, lost two early wickets. Phoebe Litchfield fell for one to Lauren Bell, with Sophie Ecclestone accepting a low chance at first slip, and Alyssa Healy was cleaned up by a beauty from Cross as Australia slipped to 15 for two. Tahlia McGrath appeared well set on 26 as Australia steadied the ship, but Ecclestone's flight deceived her and Jones completed a smart stumping. The players were forced off by rain with Australia 97 for three after 19.2 overs, with England facing potential heartbreak as they needed to bowl 20 overs to constitute a completed match. But the players were back on the field 54 minutes later, with Australia's revised target asking them to score at seven runs an over. Ellyse Perry, having reached her half-century with a free-hit six, provided a steepling catch to Capsey off Cross on 53, and Beth Mooney drove straight to Ecclestone at mid-off to give Cross a third victim. Australia were given hope as Gardner went on the offensive, taking 17 from a Bell over, but her acceptance of a risky second after Sutherland drove through the covers proved fatal as she was just short of her ground when Cross took the bails off from Wyatt's throw. Australia never recovered as Jones produced another excellent stumping to remove Wareham for 14 and Dean, called up with Sarah Glenn needing surgery for appendicitis, bowled Sutherland for 18. King went for nought as Jones held a towering catch and England's win was completed as Bell held a thick edge from Jonassen at short third.","pubDate":"2023-07-18 20:30:26","image_url":"https://static.standard.co.uk/2023/07/18/21/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Nat Sciver-Brunt leads England to ODI series win as Ashes end all square","link":"https://www.independent.co.uk/sport/cricket/nat-sciverbrunt-australia-england-odi-heather-knight-b2377619.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"The England batter has scored four hundreds in her last five ODIs against Australia","content":"Nat Sciver-Brunt was the hero again as England claimed a Women’s Ashes series draw with a 69-run win over Australia on the DLS method in the final ODI in Taunton. Victory saw the multi-series format drawn 8-8, the same score as when England last avoided Ashes defeat in Australia five years ago, and meant England had won both the ODI and Twenty20 series 2-1. Australia had retained the Ashes by winning the second ODI in Southampton on Sunday. Fresh from her unbeaten 111 at Southampton, Sciver-Brunt made her second hundred in the space of three days – 129 from 149 balls – as Australia were set a challenging 286 for victory. Batting of the highest order also secured Sciver-Brunt a fourth century from five ODIs against Australia, and the seventh of her England career in this format. Australia’s target was reduced to 269 from 44 overs by rain and, despite Ashleigh Gardner providing brief hope with a bludgeoning 41 from 24 balls, England ran out comfortable winners to the delight of a capacity crowd. England, having lost the toss, were soon in trouble as openers Sophia Dunkley and Tammy Beaumont departed with just 12 runs on the board. Captain Heather Knight and Sciver-Brunt rose to the challenge of repairing the innings, leading England to 43 for two by the end of the first powerplay after 10 overs. Runs came freely with Knight finding gaps in the field with ease and Sciver-Brunt, who survived a stumping review off Gardner on 25, landing a six on the boundary cushion with imperious precision. But with McGrath spilling a return chance off Sciver-Brunt, then on 54, the third-wicket partnership was worth 147 when Knight advanced down the wicket to Alana King and was bowled for 67, her 72-ball stay containing six fours and a six. Alice Capsey dragged Jess Jonassen to long-on for five but huge roars greeted Sciver-Brunt as she reached three figures off 126 balls. England entered the final 10 overs seeking to accelerate and Danni Wyatt played the perfect cameo with a whirlwind 43 from 25 balls before being bowled attempting to cut a full-length ball from Gardner. Amy Jones was run out for six and Sciver-Brunt’s resistance finally ended in the 48th over as Jonassen tempted an airborne pull into the safe hands of Gardner. The latter then won an lbw review against Charlie Dean to finish with three for 39 and Jonassen also collected a third scalp by castling Kate Cross as England closed on 285 for nine. Australia, as England had done, lost two early wickets. Phoebe Litchfield fell for one to Lauren Bell, with Sophie Ecclestone accepting a low chance at first slip, and Alyssa Healy was cleaned up by a beauty from Cross as Australia slipped to 15 for two. Tahlia McGrath appeared well set on 26 as Australia steadied the ship, but Ecclestone’s flight deceived her and Jones completed a smart stumping. The players were forced off by rain with Australia 97 for three after 19.2 overs, with England facing potential heartbreak as they needed to bowl 20 overs to constitute a completed match. But the players were back on the field 54 minutes later, with Australia’s revised target asking them to score at seven runs an over. Ellyse Perry , having reached her half-century with a free-hit six, provided a steepling catch to Capsey off Cross on 53, and Beth Mooney drove straight to Ecclestone at mid-off to give Cross a third victim. Australia were given hope as Gardner went on the offensive, taking 17 from a Bell over, but her acceptance of a risky second after Sutherland drove through the covers proved fatal as she was just short of her ground when Cross took the bails off from Wyatt’s throw. Australia never recovered as Jones produced another excellent stumping to remove Wareham for 14 and Dean, called up with Sarah Glenn needing surgery for appendicitis, bowled Sutherland for 18. King went for nought as Jones held a towering catch and England’s win was completed as Bell held a thick edge from Jonassen at short third.","pubDate":"2023-07-18 20:08:33","image_url":"https://static.independent.co.uk/2023/07/18/21/GettyImages-1554072207.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Old Trafford has seen it's fair share of Ashes heroics - from Laker's 10-for to Warne's ball of the century - but now England must hope to create further history against Australia in fourth Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12313191/Old-Trafford-seen-fair-share-Ashes-heroics-Lakers-10-Warnes-ball-century-England-hope-create-history-against-Australia-fourth-Test.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SHUBI ARUN: The first three Tests of this series have gone down to the wire and it's safe to assume that Ben Stokes's Bazball brigade will ensure the fourth Test isn't lacking in theatre.","content":"Old Trafford has hosted its fair share of Ashes heroics - from Laker's 10-for to Warne's ball of the century - now England must hope for more thrills in must-win fourth Test against Australia Old Trafford has played host to some of the most memorable Ashes moments The late Shane Warne bowled the ball of the century in his first Ashes in 1993 Stokes backs his side to play the perfect fast-forward game against Australia By Shubi Arun For Mail+ Updated: 01:07, 19 July 2023 e-mail View comments All eyes are now on Old Trafford. The Ashes head to Manchester, delicately poised at 2-1 in Australia ’s favour. England may have pulled off an important victory at Headingley down to the heroics of Mark Wood and Chris Woakes in the run chase, but nothing less than a repeat performance win will do as the hosts arrive at Old Trafford. The weather forecast is far from promising, too, leading to speculation that Ben Stokes will have something special planned and remains confident his side have time to pull off a memorable win with the fourth Test set to be curtailed by rain. The first three Tests of this series have gone down to the wire and it’s safe to assume that Ben Stokes’s Bazball brigade will ensure the fourth Test isn’t lacking in theatre. We’re in for a treat if it’s anything like these… Ben Stokes' side need to win to take this nail-biting series to the final Test at The Oval Pat Cummins' Australian side just need a draw to hold onto the Ashes urn for another cycle 1. The Tate Test of 1902 Having a Test named after you is normally an honour, but in Fred Tate’s case it was the opposite. England were 1-0 down going into the fourth Test of the 1902 Ashes and in desperate need of a result. After taking a 37-run lead into their second innings, Australia found themselves hobbled at 10 for three. Tate, who until then had been relatively peripheral to proceedings, then stepped to the fore. He dropped a simple catch at square leg to reprieve Australia captain Joe Darling, missing the chance to all but wrap up the tourists’ innings. Darling and Syd Gregory then put on a 54-run partnership and, while Australia were eventually dismissed for 86, the 124 England were set to win looked a Herculean task on a near unplayable pitch. When No 11 Tate stepped out to bat, England were eight runs short. Amazingly, he hit the first ball for four before blocking out the next two. But that’s where his luck ran out and he was bowled with England still four runs shy of their target. It was all too much for Tate, who broke down down in tears on the pitch. It was the only Test he ever played for England. Fred Tate had a Test to forget in 1902 after dropping a number of catches and scoring just four in the ultimately failed run chase 2. Laker’s 10-for in 1956 At Old Trafford in the 1956 series, England’s Jim Laker became the first player in the history of Tests to take 10 wickets in an innings. While that feat has since been replicated by India’s Anil Kumble and New Zealand’s Ajaz Patel, Laker’s figures of 19 for 90 in the match remain the best in Tests. Laker’s heroics saw England win by an innings and 170 runs. 3. ‘Best-ever’ Botham knock in summer of ’81 This was the summer of Ian Botham. The all-rounder’s match-winning displays in the third and fourth Tests had already made him a national hero and put England 2-1 up in the series. Beefy then added to Australia’s misery at Old Trafford. Walking into bat with England 104 for five in the second innings, Botham went on the counter-offensive and scored a staggering 118 from 102 balls. His blitz left the tourists with a near-impossible target of 506, and they fell way short. Botham played plenty of match-defining innings in that series alone but he called his knock at Old Trafford ‘probably the best I ever played’. Botham scored a staggering 118 from 102 balls to rescue England from 104 for five at Old Trafford 4. Warne’s ball of the century in ’93 England spinner Peter Such took six-for on debut, Graham Gooch became only the fifth player to be out for handling the ball and Ian Healy scored a remarkable hundred batting at No 7. But the first Test of the 1993 Ashes is remembered only for Shane Warne’s Ball of the Century. With his first ball in the iconic series, Warne dismissed Mike Gatting with an absolute ripper that pitched outside leg but hit off-stump. The delivery set the tone for the series — Warne went on to take 34 wickets as Australia romped to a 4-1 win. Shane Warne's iconic ball of the century dismissed England veteran Mike Gatting in his first ever ball of Ashes cricket 5. Australia hold on for draw in 2005 Following their two-run win at Edgbaston to level the series, England had their tails up going into the third Test at Old Trafford. From the get-go, they had Australia on the ropes and set the tourists a daunting 423 to win on day five. With the pressure on, captain Ricky Ponting led by example by hitting a remarkable 156. His dismissal four overs before the end of the day’s play left England on the brink of victory, but Glenn McGrath and Brett Lee bravely hung on to take the Aussies to safety Ashes legend Freddie Flintoff revels in dismissing Warne in the nail-biting 2005 draw Share or comment on this article: Old Trafford has hosted its fair share of Ashes heroics - from Laker's 10-for to Warne's ball of the century - but now England must hope to create further history against Australia in fourth Test e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 00:00:20","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/00/73363131-0-image-a-69_1689724761642.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"MATCH POINT: Brilliant men's final must not mask the need for change at Wimbledon... the All England Club must have a fresh look at where the event is heading","link":"https://www.dailymail.co.uk/sport/tennis/article-12313069/MATCH-POINT-Brilliant-mens-final-not-mask-need-change-Wimbledon-England-Club-fresh-look-event-heading.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"MIKE DICKSON: Staring at the back of Brad Pitt's coiffured head during the Wimbledon men's singles final, as you do, there was this strange hope that the Hollywood star was enjoying himself.","content":"MATCH POINT: Brilliant men's final must not mask the need for change at Wimbledon... the All England Club must have a fresh look at where the event is heading Carlos Alcaraz's victory will be the main memory from this edition of Wimbledon The thrilling final must not dampen discussion on how the sport can improve All England Club chairman Deborah Jevans can be a catalyst for positive change Latest Wimbledon 2023 news, including schedule, travel updates and results By Mike Dickson for the Daily Mail Updated: 00:45 BST, 19 July 2023 e-mail View comments Staring at the back of Brad Pitt ’s coiffured head during the Wimbledon men’s final, as you do, there was this strange hope that he was enjoying himself. One of many A-listers in attendance, and seated just in front of the press zone, the Hollywood star must surely have been swept up in the thunderous climax along with everyone else. It was a fantastic occasion and proof that, at its best, tennis can provide unique drama and is peak theatre, at least as good to watch as any other sport. Wimbledon 2023 will be remembered for its brilliant men’s final and quite likely as a defining point in its history, although those rushing to judge this as the end of the Novak Djokovic era could be premature. In six months’ time the Serb will be back in Melbourne, and if Carlos Alcaraz meets him there, he may be expected to beat him again, which is a very different dynamic. Carlos Alcaraz's triumph in the men's singles final may be viewed as a defining point for tennis Actor Brad Pitt, right, must have been among those swept up in the thunderous climax Alcaraz's win was significant but it is too early to declare the end to Novak Djokovic's era Just as the Spaniard’s victory should not be taken as an automatic regime change, the incredible finish to Wimbledon should not place it as one of the great editions of the Championships. This was not a vintage year overall, although it panned out as a better tournament than it might have looked early on. The omens were not great when Nick Kyrgios pulled out at the last minute and Coco Gauff lost on the first day, adding to those already missing from the singles. As it happened there were plenty of storylines and, as ever, a fair smattering of good matches. Chris Eubanks, Mirra Andreeva and Elina Svitolina were among those who always emerge to keep things bubbling. So it was not that the men’s final made this Wimbledon a case of all fur coat and no knickers. Alcaraz-Djokovic, however, should not be allowed to dampen discussion on how the game can improve itself and increase the sum of its total parts. The pace of play and the amount of dead time in matches still need addressing. How, for example, can Djokovic be allowed to stop the final for seven minutes to visit the loo? Many found it utterly tedious when the Serb often bounced the ball around 20 times before both first and second serve (again legally). The spectacle would not have suffered if a tiebreak had come at 5-5, and the 26-minute game in the middle of the third set did not add much. It was interesting to hear Holger Rune, in the vanguard of the next generation, say that he would quite happily play a deciding point at deuce. If matches did not last so long then players would not get injured so often, or pull out of events with the now accepted excuse of ‘fatigue’. One era change that is definitely occurring at Wimbledon, obviously less noticed outside the parish, is the arrival of a new All England Club chairman, Deborah Jevans. It is to be hoped that she recognises some of this, and can be a catalyst for constructive change. Rising star Holger Rune floated the idea of a deciding point when a game reaches deuce New All England Club chairman Deborah Jevans, left, can be a catalyst for positive change Jevans must take a fresh look at where the All England Club is heading and help unify the sport Amid the sport’s fractured governance, Jevans would find an ally in Tennis Australia’s chief executive Craig Tiley, who definitely gets that you cannot stand still in a changing marketplace. As a former player, Jevans will bring much-needed tennis knowledge to the leaders’ table, and also the experience of working in other sports. She ought not to have a problem understanding the wider context. Jevans has a considerable in-tray when it comes to more local matters. A fresh look is required at where the All England Club, this odd hybrid of elite private members’ club and magnificent flagship sporting event, is heading, and how it connects and communicates with the outside world. A particular issue to be resolved is the impasse that has developed around its expansion plans into neighbouring land on the former golf course. Beyond that is bringing the clout that Wimbledon has in helping unify the way the whole sport is run. Not an easy task when all the actors seek to protect what is theirs, and are so reluctant to pool sovereignty. A co-ordinated approach to improving and updating the offering has never been more needed, especially when it comes to the women’s game. Sport and society are changing rapidly, and in the sphere of racket sports, Padel and Pickleball are attractive alternatives. Saudi Arabia waits in the wings, and as Europe gets poorer the Middle East is where the new money is found. Wimbledon will always be a great fortnight. There is a timely parallel as this gripping Ashes series plays out — there should be no worries about the future of England versus Australia in the five-day format, but the wider body of Test cricket has concerns that are very real. Pride restored by our Henry It turned out to be a Wimbledon of two halves for British tennis and the LTA, with the second week more encouraging than the first. It has to be said that the first week was the more important one (by Saturday night there were no home singles players remaining), and serious questions persist about how and where it spends the money generated by the success of the Championships. But credit where it is due, boys’ champion Henry Searle is a product of the system and attends the Loughborough Academy. Somebody has done a good job with a technique that looks well-equipped for the modern game. Henry Searle became Britain's first boys singles champion at Wimbledon since 1962 Neal Skupski triumphed in the men's doubles event alongside Dutchman Wesley Koolhof Congrats, too, to Neal Skupski and others who achieved good wins. It is heartening to see Wimbledon champions coming out of places such as Liverpool and Wolverhampton. It cannot be stressed enough that this is only the end of the beginning for the likes of Searle, 17. The road is long and paved not with the somewhat exceptional surface of grass, but the concrete and clay that prevails at other times of the year. As with every aspiring player, he will have to hack it playing Futures and Challengers in places like Turkey, Tunisia and Egypt, where the audience is made up of coaches, players and a few random holidaymakers. Annabel Croft steps into Sue Barker's shoes Bravo Annabel Croft, who did a fine job stepping into the very considerable shoes of Sue Barker when it came to the highest-profile Centre Court interviews. The 57-year-old authoritatively knows the sport, as well as having strong presentational skills — it might even catch on in the BBC’s coverage. Sitting in the middle of the Wimbledon maelstrom, there is not time to catch a lot of the corporation’s TV output, therefore I cannot offer too much of a critique. However, even when dipping in, it backed up what you heard about too many slip-ups being made — matches are not ‘games’, and Carlos Alcaraz is not a teenager, for example. Anyone can make mistakes, but when investing around £70million of licence payers’ money, you would think the Beeb might insist on all its talent having a working knowledge of tennis, which is more easily acquired by covering events between one Wimbledon and another. Annabel Croft did a fine job in replacing Sue Barker for the main centre court interviews Share or comment on this article: MATCH POINT: Brilliant men's final must not mask the need for change at Wimbledon... the All England Club must have a fresh look at where the event is heading e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 23:45:19","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/00/73362601-0-image-a-85_1689723610687.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Consolation 69-run win for England in final Women's Ashes ODI against Australia","link":"https://www.sootoday.com/national-sports/consolation-69-run-win-for-england-in-final-womens-ashes-odi-against-australia-7293966","keywords":null,"creator":["Canadian Press"],"video_url":null,"description":"TAUNTON, England (AP) — Nat Sciver-Brunt hit another century as England claimed a Women’s Ashes series draw with a 69-run win over Australia under the DLS method in the final one-day international at Taunton.","content":"TAUNTON, England (AP) — Nat Sciver-Brunt hit another century as England claimed a Women’s Ashes series draw with a 69-run win over Australia under the DLS method on Tuesday in the third and final one-day international at Taunton. Victory saw the multi-series format drawn 8-8 on points — the same score as when England last avoided Ashes defeat in Australia five years ago — and meant England had won both the ODI and Twenty20 series 2-1. Urn holder Australia had already retained the Ashes by winning the second ODI in Southampton on Sunday. England trailed 6-0 after the opening two matches of the multi-format series — the solitary test and the T20 opener — but rallied to win four of the remaining five white-ball contests. “To win two series against the world champions in both formats is brilliant,” said England captain Heather Knight, who scored 67. “The Ashes had gone the other day and the disappointment came out then. But the character in the side to turn it around here was unbelievable.\" Fresh from her unbeaten 111 at Southampton, Sciver-Brunt made her second hundred in three days — 129 runs from 149 balls — as England was put into bat and finished on 285-9 to set Australia a challenging target. Sciver-Brunt scored a fourth century from five ODIs against Australia, and the seventh of her England career in this format. Sciver-Brunt’s resistance finally ended in the 48th over as Jess Jonassen tempted an airborne pull into the safe hands of Ashleigh Gardner. Gardner took 3-39 in 10 overs, and Jonassen 3-30 in five. Australia’s target was reduced to 269 from 44 overs by rain and, despite Gardner providing brief hope with 41 from 24 balls, the visitors were bowled out for 199 in 35.3 overs as England ran out comfortable winners to the delight of a capacity crowd. Ellyse Perry top-scored with 53. “We didn’t get over the line in the white-ball stuff but I’m proud the way the series has unfolded. It’s been an amazing spectacle for cricket in general and really cool to be part of it,\" Australia captain Alyssa Healy said. “It’s no secret we haven’t played our best throughout the entire series . . . We’ll sit back now and see what’s not quite gone well for us. In the long run it might do us good to have those reflections and know that we can be better.” ___ AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports The Associated Press","pubDate":"2023-07-18 22:14:53","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/07/2023071817070-64b6fd77173864db0af27989jpeg.jpg;w=960","source_id":"sootoday","category":["sports"],"country":["canada"],"language":"english"},{"title":"‘We’ve got the trophy but we’re not happy’: Australia lose first ODI series in decade as women’s Ashes ends in draw","link":"https://www.theage.com.au/sport/cricket/we-ve-got-the-trophy-but-we-re-not-happy-australia-lose-first-odi-in-a-decade-as-women-s-ashes-ends-in-draw-20230719-p5dpdx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Glenn Moore"],"video_url":null,"description":"Australia had already retained the Ashes, but Tuesday’s heavy one-day defeat means they have drawn the series eight-all under the multi-format points system.","content":"Australia have been beaten in an ODI series for the first time in a decade, thrashed by 69 runs by England in the only blow-out of the women’s Ashes series. Set a revised target of 269 off 44 overs in Taunton on Tuesday, having initially been asked to make their second-highest successful chase of 286, Australia stumbled after the rain break, then crumbled from 6-190 to 199 all out off 35.3 overs. Only Ellyse Perry, with 53 off 58 balls, and Ashleigh Gardner with a blazing 41 off 24, mustered serious resistance. It was Australia’s worst loss in terms of runs since 2008, and England’s biggest win over Australia since their first ODI against them in 1973. Victory in Southampton on Sunday meant Australia had already retained the Ashes, but they have not won the series, which was drawn eight-all under the multi-format points system. England actually won more matches, four to three, taking eight of the last 10 points, but Australia won the Test which was worth four points while the six white-ball matches were worth two apiece. Nat Sciver-Brunt leading the England charge at Taunton. Credit: Reuters “We’ve got the trophy but we’re not happy about not winning this series,” Alyssa Healy said. “We haven’t lost an ODI series for a very long period of time. It feels a bit dirty, at the end of the day.” Nat Sciver-Brunt anchored England’s 9-285 with a second successive century. She hit 129 off 149 balls as the hosts recovered from a bad start to post their highest ODI score. “It feels like a moral victory,” she said. Australia have only once chased a higher total to win, but the Somerset ground is a high-scoring venue so they had reason to believe. Healy put England in and opened with spinner Gardner, who soon dismissed the out-of-form Sophia Dunkley. More significant was Megan Schutt bowling the in-form Tammy Beaumont cheaply. That brought England’s most experienced pair, Heather Knight and Sciver-Brunt, to the crease. They rebuilt, slowly at first, then accelerated towards a century partnership. Having put on 147, Knight was bowled by Alana King for a 72-ball 67 and Alice Capsey holed out off Jess Jonassen soon after. But Sciver-Brunt, who had been dropped by Tahlia McGrath on 54, moved on to a 126-ball century scoring almost exclusively on the leg side. She became the first player to make four centuries against Australia, all scored in her last five Ashes ODIs. Danni Wyatt (43 off 25) provided strong support but was bowled by Gardner, who then caught Sciver-Brunt off Jonassen on the boundary. Gardner finished with 3-39 off 10 overs and Jonassen 3-30 off five as England’s tail wagged limply. The tourists also began slowly, being 2-15 with Phoebe Litchfield (one) caught first slip and Healy (seven) bowled. Perry and McGrath (26) took the score to 68 before the latter was stumped. Beth Mooney joined Perry but nine runs later rain arrived. When the teams returned, Australia needed another 172 runs from 148 balls. Perry moved past her half-century, smashing a no-ball free-hit for six, but was then caught off a leading edge. Mooney went soon after (16) but Gardner came in to smack sixes square and straight. But then she chanced a second run to Wyatt and was run out. After Amy Jones pulled off another smart stumping to dismiss Georgia Wareham (14 off nine), the end came quickly. Annabel Sutherland was bowled for 18, King caught behind for a duck and Jonassen last out for five. AAP Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-18 22:04:27","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘We’ve got the trophy but we’re not happy’: Australia lose first ODI series in decade as women’s Ashes ends in draw","link":"https://www.smh.com.au/sport/cricket/we-ve-got-the-trophy-but-we-re-not-happy-australia-lose-first-odi-in-a-decade-as-women-s-ashes-ends-in-draw-20230719-p5dpdx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"Australia had already retained the Ashes, but Tuesday’s heavy one-day defeat means they have drawn the series eight-all under the multi-format points system.","content":"Australia have been beaten in an ODI series for the first time in a decade, thrashed by 69 runs by England in the only blow-out of the women’s Ashes series. Set a revised target of 269 off 44 overs in Taunton on Tuesday, having initially been asked to make their second-highest successful chase of 286, Australia stumbled after the rain break, then crumbled from 6-190 to 199 all out off 35.3 overs. Only Ellyse Perry, with 53 off 58 balls, and Ashleigh Gardner with a blazing 41 off 24, mustered serious resistance. It was Australia’s worst loss in terms of runs since 2008, and England’s biggest win over Australia since their first ODI against them in 1973. Victory in Southampton on Sunday meant Australia had already retained the Ashes, but they have not won the series, which was drawn eight-all under the multi-format points system. England actually won more matches, four to three, taking eight of the last 10 points, but Australia won the Test which was worth four points while the six white-ball matches were worth two apiece. Nat Sciver-Brunt leading the England charge at Taunton. Credit: Reuters “We’ve got the trophy but we’re not happy about not winning this series,” Alyssa Healy said. “We haven’t lost an ODI series for a very long period of time. It feels a bit dirty, at the end of the day.” Nat Sciver-Brunt anchored England’s 9-285 with a second successive century. She hit 129 off 149 balls as the hosts recovered from a bad start to post their highest ODI score. “It feels like a moral victory,” she said. Australia have only once chased a higher total to win, but the Somerset ground is a high-scoring venue so they had reason to believe. Healy put England in and opened with spinner Gardner, who soon dismissed the out-of-form Sophia Dunkley. More significant was Megan Schutt bowling the in-form Tammy Beaumont cheaply. That brought England’s most experienced pair, Heather Knight and Sciver-Brunt, to the crease. They rebuilt, slowly at first, then accelerated towards a century partnership. Having put on 147, Knight was bowled by Alana King for a 72-ball 67 and Alice Capsey holed out off Jess Jonassen soon after. But Sciver-Brunt, who had been dropped by Tahlia McGrath on 54, moved on to a 126-ball century scoring almost exclusively on the leg side. She became the first player to make four centuries against Australia, all scored in her last five Ashes ODIs. Danni Wyatt (43 off 25) provided strong support but was bowled by Gardner, who then caught Sciver-Brunt off Jonassen on the boundary. Gardner finished with 3-39 off 10 overs and Jonassen 3-30 off five as England’s tail wagged limply. The tourists also began slowly, being 2-15 with Phoebe Litchfield (one) caught first slip and Healy (seven) bowled. Perry and McGrath (26) took the score to 68 before the latter was stumped. Beth Mooney joined Perry but nine runs later rain arrived. When the teams returned, Australia needed another 172 runs from 148 balls. Perry moved past her half-century, smashing a no-ball free-hit for six, but was then caught off a leading edge. Mooney went soon after (16) but Gardner came in to smack sixes square and straight. But then she chanced a second run to Wyatt and was run out. After Amy Jones pulled off another smart stumping to dismiss Georgia Wareham (14 off nine), the end came quickly. Annabel Sutherland was bowled for 18, King caught behind for a duck and Jonassen last out for five. AAP Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-18 22:04:27","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Bumble's guide to Manchester: The pubs and poultry are perfect! As England could level the series if Moeen Ali's 'nuts' decision pays off","link":"https://www.dailymail.co.uk/sport/cricket/article-12312489/Bumbles-guide-Manchester-pubs-poultry-perfect-England-level-series-Moeen-Alis-nuts-decision-pays-off.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID LLOYD: There's no place like Manchester. You can walk anywhere and if you don't fancy a stroll, get on the tram! When I was at Sky, they got me driving one.","content":"Bumble's guide to Manchester: The pubs and poultry are perfect! And England could level the series if Moeen Ali's 'nuts' decision pays off England and Australia begin a pivotal fourth Test at Old Trafford on Wednesday For atmosphere, the Old Trafford crowd matches Edgbaston and Headingley Ben Stokes could opt for an even more offensive approach in Manchester By David Lloyd for the Daily Mail Updated: 17:42 EDT, 18 July 2023 e-mail View comments It’s like coming home. The Green Green Grass of Home as Tom Jones sang. This ground is state-of-the-art and steeped in tradition. We’ve seen fantastic players here over the years. Who can forget our king Wasim Akram? For atmosphere, the Old Trafford crowd matches Edgbaston and Headingley. The party stand will be loud and England need that 12th man! There’s no place like Manchester. You can walk anywhere and if you don’t fancy a stroll, get on the tram! When I was at Sky, they got me driving one. I had to wear the hi-viz. I was driving fine until I missed an automatic spot and the tram stopped suddenly. Everyone inside was thrown forward! On Portland Street, there’s the legendary Grey Horse Inn, the Circus Tavern, which is the smallest pub in the city, and the Old Monkey virtually next to each other. And sandwiched between them is a chicken shop. You can walk anywhere in Manchester and if you don’t fancy a stroll you can get on the tram For atmosphere, the Old Trafford crowd matches those found at Edgbaston and Headingley The Circus Tavern, located in Manchester City centre, is one of the smallest bars in Europe Now that’s what you call planning. Five minutes away, you’ve got the City Arms and the Vine Inn and they’re connected to each other, too. Stand outside and watch the world go by. Then there’s Peveril of the Peak, the Marble Arch Inn and the Briton’s Protection. I’ll be everywhere. If you want a bit of live rock ’n’ roll, get to the Northern Quarter and the Band on the Wall. Canal Street is in the centre of the Gay Village. It’s well worth a visit! For food, just behind Portland Street is the fabulous Chinatown. The Little Yang Sing is a personal favourite. For your curries, go anywhere. Everyone does it right. Head to Fumo for an Italian and some fine people-watching. Dr John Cooper Clarke was there earlier this week. Anyway, we’re here for the cricket and I hear Ben Stokes is going to go even more attacking. I look forward to watching that but it might be kamikaze! It will be a good pitch but with the recent weather I doubt it will have the same pace as Headingley. Moeen Ali, batting at three, has put his hand up for the greater good as nobody wants to do it Australia captain Pat Cummins (right) has decided to drop Todd Murphy (left) meaning the visitors will go into a Test without a specialist spinner for the first time since 2012 Australia are going without a frontline spinner and I don’t know what Shane Warne would have made of that. I’d always pick a spinner here. Stokes loves to chase and he knows Australia’s spin options aren’t strong, so England will surely bowl first if they win the toss. A word for Moeen Ali, batting at three. He’s put his hand up for the greater good because nobody wants to do it. It’s terrific of him. It’s also nuts! From retirement to frontline spinner and batting at three in the Ashes. Main man Mo! By the way, there’s another Old Trafford nearby. They play this thing called football there. Don’t go to the wrong one. And if you want to hear me on the wireless, I’m commentating on this Test for the Australian radio channel SEN. Share or comment on this article: Bumble's guide to Manchester: The pubs and poultry are perfect! As England could level the series if Moeen Ali's 'nuts' decision pays off e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 21:41:38","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/22/73359381-0-image-a-9_1689716481307.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"JASON GILLESPIE: Going into the fourth Ashes Test without a frontline spinner carries considerable risk...but Travis Head's bowling display at Headingley and the returning Cameron Green have convinced Australia's think-tank its one worth taking","link":"https://www.dailymail.co.uk/sport/cricket/article-12312381/JASON-GILLESPIE-Going-fourth-Ashes-Test-without-frontline-spinner-carries-considerable-risk-Travis-Heads-bowling-display-Headingley-returning-Cameron-Green-convinced-Australias-think-tank-one-worth-taking.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JASON GILLESPIE: I would have expected Cummins to use his off-spinner during England's run-chase had Lyon been there. So it's not a surprise that Murphy has been left out of the fourth Test.","content":"JASON GILLESPIE: It's sad when Australia don't trust their spinner. I'd play Todd Murphy... but Pat Cummins has got his way with an all-pace attack England and Australia face off in the fourth Test at Old Trafford on Wednesday Australia go into the tie without a specialist spinner for the first time since 2012 All-rounder Cameron Green returns to the side following a hamstring issue By Jason Gillespie For The Daily Mail Updated: 22:40 BST, 18 July 2023 e-mail View comments If Todd Murphy was truly picked to fill the role vacated by Nathan Lyon, then why was he not bowled for more than two overs on the last day at Headingley by Pat Cummins ? Certainly, I would have expected the Australia captain to use his off-spinner in those key moments of the England run-chase had Lyon been there. So it’s not a great surprise to me that Australia have left Murphy out of Wednesday's fourth Test. Is that a trust issue? Is Cummins not sure whether Murphy has what it takes? Or was he just protecting his young spinner in Leeds when he was up against some really good, aggressive England batsmen ? It is an interesting debate, particularly as on Wednesday Australia are going into a match without a specialist spinner for the first time in Test cricket since 2012. I do rate Murphy. He’s a good young bowler and I would be loath to go into any Test without a frontline spinner. I would have played him at Old Trafford. But maybe Mitchell Marsh created a nice little problem for Australia with the way he played at Headingley. And Travis Head bowled pretty well at Lord’s when Lyon went down, so clearly the think-tank have decided they can use his spin now and leaving Murphy out is their best way of getting Cameron Green back into the side. Australia captain Pat Cummins has decided not to select a specialist spinner for the fourth Test Off-spinner Todd Murphy has been dropped for the fourth Ashes Test at Old Trafford All-rounder Cameron Green has been recalled to the Australia side for the pivotal clash Australia will use Head in a defensive role with the ball and then attack with their quicks and rotate them. Green, after his hamstring niggle, could be used in short, sharp bursts with Marsh bowling some overs alongside the big three quicks. I’m not surprised Josh Hazlewood is back because England have attacked Scotty Boland. It may sound odd but that is a bit of a feather in Boland’s cap because it means England respect him and the way he goes about his work. There is no surprise either in David Warner retaining his place. Australia coach Andrew McDonald likes experienced players and it’s getting to the nitty-gritty of this Ashes now when you need that experience. Cummins would be of the same mind-set. There have been such fine margins in this series. It could be 3-0 to either side now but it’s 2-1 and Australia know if they nail their skills and stick to their processes this week they could become the first touring side to win an Ashes series in England since 2001. England will try to drive this Test forward, particularly if there’s bad weather around, but Australia can play the long game. It’s OK for them to win after tea on day five even if England seem to be looking to win it by the morning of day three! We all know England want to entertain and put on a show but there are many ways to entertain and a Test going deep into day five with a positive result at the end of it is proper entertainment, too. But make no mistake, Australia will be playing to win this Test. They won’t be going into it looking for the draw they need to retain the urn. There is no surprise in David Warner (pictured) retaining his place as Australia coach Andrew McDonald likes to included experienced players in his line-up Australia will use Travis Head (picture) in a defensive role with the ball and then attack with their quicks and rotate them The teams are close but have very different methods and that’s what we love about Test cricket. There are so many ways to approach the game and have success. I was at the first two Tests but I watched the third from home in Adelaide and there is no doubt this series has captured the imagination of both sides of the Ashes divide. It’s been a big deal here in Australia. It’s awesome. And there are similar vibes to 2005. Old Trafford is one of the great venues in cricket and I’ve no doubt the Lancastrians will come out in full support of England. There will be a raucous atmosphere and it’s a really exciting prospect. I predicted a 3-1 victory for Australia before the start of this series and I’m not going to change that now. The rain I expected for at least one Test could have an impact on this game but I hope not. Let’s hope for clear skies and a cracking game. I can’t wait to see what happens. Share or comment on this article: JASON GILLESPIE: Going into the fourth Ashes Test without a frontline spinner carries considerable risk...but Travis Head's bowling display at Headingley and the returning Cameron Green have convinced Australia's think-tank its one worth taking e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 21:40:43","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/20/73354739-0-image-a-66_1689707995618.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Heather Knight proud of England’s Ashes fightback","link":"https://www.independent.co.uk/sport/cricket/england-heather-knight-odi-england-cricket-t20-b2377669.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"England won both white-ball series 2-1.","content":"Captain Heather Knight declared herself “super-proud” after her England team completed a remarkable Women’s Ashes turnaround to draw the series. England trailed 6-0 after the opening two matches of the multi-format series – the solitary Test and the T20 opener – but rallied to win four of the remaining five white-ball contests to draw 8-8. After winning the T20 matches 2-1, England’s 69-run victory by DLS method at Taunton on Tuesday gave them a second white-ball series victory over the world’s number one side. “To win two series against the world champions in both formats is brilliant,” Knight said. “The Ashes had gone the other day and the disappointment came out then. But the character in the side to turn it around here was unbelievable. “We wanted to do justice to the way we have played so far, and it was a sell-out in front of a rowdy crowd. “We wanted to continue to entertain and play how we want to. An ODI series on the line, there’s no bigger (test of) character than that against a team we haven’t beaten in 10 years. “There’s disappointment we haven’t got the Ashes but it’s a draw, and if you’d told me that at 6-0 down I would have bitten your hand off.” Nat Sciver-Brunt’s second century in the space of three days – 129 on the back of an unbeaten 111 at Southampton on Sunday – laid the platform for England’s series-levelling success. England posted a challenging score of 285 for nine from their 50 overs; Australia’s target was reduced to 269 from 44 overs after a 54-minute rain delay. Kate Cross took three wickets and Lauren Bell and Charlie Dean two each as Australia slid to 199 all out in 35.3 overs. “Nat is unbelievable,” said Knight. “She’s got four hundreds in five games against the best team in the world. “We talked about staying positive and believing that we were good enough to beat this side. “Despite losing those two games it actually grew the belief that we were as good as this Australian team and we could go toe to toe with them. “We had to do a few little things better because we felt we were so close in that Edgbaston (T20) defeat. “To play like we have done this summer has been hugely pleasing. The most exciting thing is that we haven’t played our best cricket, this was probably our best performance. “I think this team has got a huge ceiling to keep improving. I don’t think there is a gap between the two sides now. We’ve won two white-ball series, I’m not sure about the gap.” Australia captain Alyssa Healy said the tourists could take satisfaction that the Ashes were “still within our grasp”. Healy said: “We didn’t get over the line in the white-ball stuff but I’m proud the way the series has unfolded. “It’s been an amazing spectacle for cricket in general and really cool to be part of it. “It’s no secret we haven’t played our best throughout the entire series. “England played really well and that’s not diminishing what they’ve achieved, we’ve not. We’ll sit back now and see what’s not quite gone well for us. “In the long run it might do us good to have those reflections and know that we can be better.”","pubDate":"2023-07-18 21:13:23","image_url":"https://static.independent.co.uk/2023/07/18/22/660493df4e68fc12682ac0b090455742Y29udGVudHNlYXJjaGFwaSwxNjg5Nzk5ODE5-2.73023566.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England claim Women’s Ashes series draw after fresh heroics from Nat Sciver-Brunt","link":"https://www.standard.co.uk/sport/cricket/womens-ashes-result-england-australia-nat-sciver-brunt-b1095248.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"Nat Sciver-Brunt was the hero again as England claimed a Women’s Ashes series draw with a 69-run win over Australia on the DLS method in the final ODI in Taunton.","content":"at Sciver-Brunt was the hero again as claimed a series draw with a 69-run win over on the DLS method in the final ODI in Taunton. Victory saw the multi-series format drawn 8-8, the same score as when England last avoided Ashes defeat in Australia five years ago, and meant England had won both the ODI and Twenty20 series 2-1. Australia had already retained the Ashes by winning the second ODI in Southampton on Sunday. Fresh from her unbeaten 111 at Southampton, Sciver-Brunt made her second hundred in the space of three days - 129 from 149 balls - as Australia were set a challenging 286 for victory. Batting of the highest order also secured Sciver-Brunt a fourth century from five ODIs against Australia, and the seventh of her England career in this format. Australia's target was reduced to 269 from 44 overs by rain and, despite Ashleigh Gardner providing brief hope with a bludgeoning 41 from 24 balls, they were bowled out for 199 as England ran out comfortable winners to the delight of a capacity crowd. SPONSORED England, having lost the toss, were soon in trouble as openers Sophia Dunkley and Tammy Beaumont departed with just 12 runs on the board. Captain Heather Knight and Sciver-Brunt rose to the challenge of repairing the innings, leading England to 43 for two by the end of the first powerplay after 10 overs. Runs came freely with Knight finding gaps in the field with ease and Sciver-Brunt, who survived a stumping review off Gardner on 25, landing a six on the boundary cushion with imperious precision. But with McGrath spilling a return chance off Sciver-Brunt, then on 54, the third-wicket partnership was worth 147 when Knight advanced down the wicket to Alana King and was bowled for 67, her 72-ball stay containing six fours and a six. Alice Capsey dragged Jess Jonassen to long-on for five but huge roars greeted Sciver-Brunt as she reached three figures off 126 balls. England entered the final 10 overs seeking to accelerate and Danni Wyatt played the perfect cameo with a whirlwind 43 from 25 balls before being bowled attempting to cut a full-length ball from Gardner. Amy Jones was run out for six and Sciver-Brunt's resistance finally ended in the 48th over as Jonassen tempted an airborne pull into the safe hands of Gardner. The latter then won an lbw review against Charlie Dean to finish with three for 39 and Jonassen also collected a third scalp by castling Kate Cross as England closed on 285 for nine. Australia, as England had done, lost two early wickets. Phoebe Litchfield fell for one to Lauren Bell, with Sophie Ecclestone accepting a low chance at first slip, and Alyssa Healy was cleaned up by a beauty from Cross as Australia slipped to 15 for two. Tahlia McGrath appeared well set on 26 as Australia steadied the ship, but Ecclestone's flight deceived her and Jones completed a smart stumping. The players were forced off by rain with Australia 97 for three after 19.2 overs, with England facing potential heartbreak as they needed to bowl 20 overs to constitute a completed match. But the players were back on the field 54 minutes later, with Australia's revised target asking them to score at seven runs an over. Ellyse Perry, having reached her half-century with a free-hit six, provided a steepling catch to Capsey off Cross on 53, and Beth Mooney drove straight to Ecclestone at mid-off to give Cross a third victim. Australia were given hope as Gardner went on the offensive, taking 17 from a Bell over, but her acceptance of a risky second after Sutherland drove through the covers proved fatal as she was just short of her ground when Cross took the bails off from Wyatt's throw. Australia never recovered as Jones produced another excellent stumping to remove Wareham for 14 and Dean, called up with Sarah Glenn needing surgery for appendicitis, bowled Sutherland for 18. King went for nought as Jones held a towering catch and England's win was completed as Bell held a thick edge from Jonassen at short third.","pubDate":"2023-07-18 20:30:26","image_url":"https://static.standard.co.uk/2023/07/18/21/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Nat Sciver-Brunt leads England to ODI series win as Ashes end all square","link":"https://www.independent.co.uk/sport/cricket/nat-sciverbrunt-australia-england-odi-heather-knight-b2377619.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"The England batter has scored four hundreds in her last five ODIs against Australia","content":"Nat Sciver-Brunt was the hero again as England claimed a Women’s Ashes series draw with a 69-run win over Australia on the DLS method in the final ODI in Taunton. Victory saw the multi-series format drawn 8-8, the same score as when England last avoided Ashes defeat in Australia five years ago, and meant England had won both the ODI and Twenty20 series 2-1. Australia had retained the Ashes by winning the second ODI in Southampton on Sunday. Fresh from her unbeaten 111 at Southampton, Sciver-Brunt made her second hundred in the space of three days – 129 from 149 balls – as Australia were set a challenging 286 for victory. Batting of the highest order also secured Sciver-Brunt a fourth century from five ODIs against Australia, and the seventh of her England career in this format. Australia’s target was reduced to 269 from 44 overs by rain and, despite Ashleigh Gardner providing brief hope with a bludgeoning 41 from 24 balls, England ran out comfortable winners to the delight of a capacity crowd. England, having lost the toss, were soon in trouble as openers Sophia Dunkley and Tammy Beaumont departed with just 12 runs on the board. Captain Heather Knight and Sciver-Brunt rose to the challenge of repairing the innings, leading England to 43 for two by the end of the first powerplay after 10 overs. Runs came freely with Knight finding gaps in the field with ease and Sciver-Brunt, who survived a stumping review off Gardner on 25, landing a six on the boundary cushion with imperious precision. But with McGrath spilling a return chance off Sciver-Brunt, then on 54, the third-wicket partnership was worth 147 when Knight advanced down the wicket to Alana King and was bowled for 67, her 72-ball stay containing six fours and a six. Alice Capsey dragged Jess Jonassen to long-on for five but huge roars greeted Sciver-Brunt as she reached three figures off 126 balls. England entered the final 10 overs seeking to accelerate and Danni Wyatt played the perfect cameo with a whirlwind 43 from 25 balls before being bowled attempting to cut a full-length ball from Gardner. Amy Jones was run out for six and Sciver-Brunt’s resistance finally ended in the 48th over as Jonassen tempted an airborne pull into the safe hands of Gardner. The latter then won an lbw review against Charlie Dean to finish with three for 39 and Jonassen also collected a third scalp by castling Kate Cross as England closed on 285 for nine. Australia, as England had done, lost two early wickets. Phoebe Litchfield fell for one to Lauren Bell, with Sophie Ecclestone accepting a low chance at first slip, and Alyssa Healy was cleaned up by a beauty from Cross as Australia slipped to 15 for two. Tahlia McGrath appeared well set on 26 as Australia steadied the ship, but Ecclestone’s flight deceived her and Jones completed a smart stumping. The players were forced off by rain with Australia 97 for three after 19.2 overs, with England facing potential heartbreak as they needed to bowl 20 overs to constitute a completed match. But the players were back on the field 54 minutes later, with Australia’s revised target asking them to score at seven runs an over. Ellyse Perry , having reached her half-century with a free-hit six, provided a steepling catch to Capsey off Cross on 53, and Beth Mooney drove straight to Ecclestone at mid-off to give Cross a third victim. Australia were given hope as Gardner went on the offensive, taking 17 from a Bell over, but her acceptance of a risky second after Sutherland drove through the covers proved fatal as she was just short of her ground when Cross took the bails off from Wyatt’s throw. Australia never recovered as Jones produced another excellent stumping to remove Wareham for 14 and Dean, called up with Sarah Glenn needing surgery for appendicitis, bowled Sutherland for 18. King went for nought as Jones held a towering catch and England’s win was completed as Bell held a thick edge from Jonassen at short third.","pubDate":"2023-07-18 20:08:33","image_url":"https://static.independent.co.uk/2023/07/18/21/GettyImages-1554072207.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Old Trafford has seen it's fair share of Ashes heroics - from Laker's 10-for to Warne's ball of the century - but now England must hope to create further history against Australia in fourth Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12313191/Old-Trafford-seen-fair-share-Ashes-heroics-Lakers-10-Warnes-ball-century-England-hope-create-history-against-Australia-fourth-Test.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SHUBI ARUN: The first three Tests of this series have gone down to the wire and it's safe to assume that Ben Stokes's Bazball brigade will ensure the fourth Test isn't lacking in theatre.","content":"Old Trafford has hosted its fair share of Ashes heroics - from Laker's 10-for to Warne's ball of the century - now England must hope for more thrills in must-win fourth Test against Australia Old Trafford has played host to some of the most memorable Ashes moments The late Shane Warne bowled the ball of the century in his first Ashes in 1993 Stokes backs his side to play the perfect fast-forward game against Australia By Shubi Arun For Mail+ Updated: 01:07, 19 July 2023 e-mail View comments All eyes are now on Old Trafford. The Ashes head to Manchester, delicately poised at 2-1 in Australia ’s favour. England may have pulled off an important victory at Headingley down to the heroics of Mark Wood and Chris Woakes in the run chase, but nothing less than a repeat performance win will do as the hosts arrive at Old Trafford. The weather forecast is far from promising, too, leading to speculation that Ben Stokes will have something special planned and remains confident his side have time to pull off a memorable win with the fourth Test set to be curtailed by rain. The first three Tests of this series have gone down to the wire and it’s safe to assume that Ben Stokes’s Bazball brigade will ensure the fourth Test isn’t lacking in theatre. We’re in for a treat if it’s anything like these… Ben Stokes' side need to win to take this nail-biting series to the final Test at The Oval Pat Cummins' Australian side just need a draw to hold onto the Ashes urn for another cycle 1. The Tate Test of 1902 Having a Test named after you is normally an honour, but in Fred Tate’s case it was the opposite. England were 1-0 down going into the fourth Test of the 1902 Ashes and in desperate need of a result. After taking a 37-run lead into their second innings, Australia found themselves hobbled at 10 for three. Tate, who until then had been relatively peripheral to proceedings, then stepped to the fore. He dropped a simple catch at square leg to reprieve Australia captain Joe Darling, missing the chance to all but wrap up the tourists’ innings. Darling and Syd Gregory then put on a 54-run partnership and, while Australia were eventually dismissed for 86, the 124 England were set to win looked a Herculean task on a near unplayable pitch. When No 11 Tate stepped out to bat, England were eight runs short. Amazingly, he hit the first ball for four before blocking out the next two. But that’s where his luck ran out and he was bowled with England still four runs shy of their target. It was all too much for Tate, who broke down down in tears on the pitch. It was the only Test he ever played for England. Fred Tate had a Test to forget in 1902 after dropping a number of catches and scoring just four in the ultimately failed run chase 2. Laker’s 10-for in 1956 At Old Trafford in the 1956 series, England’s Jim Laker became the first player in the history of Tests to take 10 wickets in an innings. While that feat has since been replicated by India’s Anil Kumble and New Zealand’s Ajaz Patel, Laker’s figures of 19 for 90 in the match remain the best in Tests. Laker’s heroics saw England win by an innings and 170 runs. 3. ‘Best-ever’ Botham knock in summer of ’81 This was the summer of Ian Botham. The all-rounder’s match-winning displays in the third and fourth Tests had already made him a national hero and put England 2-1 up in the series. Beefy then added to Australia’s misery at Old Trafford. Walking into bat with England 104 for five in the second innings, Botham went on the counter-offensive and scored a staggering 118 from 102 balls. His blitz left the tourists with a near-impossible target of 506, and they fell way short. Botham played plenty of match-defining innings in that series alone but he called his knock at Old Trafford ‘probably the best I ever played’. Botham scored a staggering 118 from 102 balls to rescue England from 104 for five at Old Trafford 4. Warne’s ball of the century in ’93 England spinner Peter Such took six-for on debut, Graham Gooch became only the fifth player to be out for handling the ball and Ian Healy scored a remarkable hundred batting at No 7. But the first Test of the 1993 Ashes is remembered only for Shane Warne’s Ball of the Century. With his first ball in the iconic series, Warne dismissed Mike Gatting with an absolute ripper that pitched outside leg but hit off-stump. The delivery set the tone for the series — Warne went on to take 34 wickets as Australia romped to a 4-1 win. Shane Warne's iconic ball of the century dismissed England veteran Mike Gatting in his first ever ball of Ashes cricket 5. Australia hold on for draw in 2005 Following their two-run win at Edgbaston to level the series, England had their tails up going into the third Test at Old Trafford. From the get-go, they had Australia on the ropes and set the tourists a daunting 423 to win on day five. With the pressure on, captain Ricky Ponting led by example by hitting a remarkable 156. His dismissal four overs before the end of the day’s play left England on the brink of victory, but Glenn McGrath and Brett Lee bravely hung on to take the Aussies to safety Ashes legend Freddie Flintoff revels in dismissing Warne in the nail-biting 2005 draw Share or comment on this article: Old Trafford has hosted its fair share of Ashes heroics - from Laker's 10-for to Warne's ball of the century - but now England must hope to create further history against Australia in fourth Test e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-19 00:00:20","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/00/73363131-0-image-a-69_1689724761642.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"MATCH POINT: Brilliant men's final must not mask the need for change at Wimbledon... the All England Club must have a fresh look at where the event is heading","link":"https://www.dailymail.co.uk/sport/tennis/article-12313069/MATCH-POINT-Brilliant-mens-final-not-mask-need-change-Wimbledon-England-Club-fresh-look-event-heading.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"MIKE DICKSON: Staring at the back of Brad Pitt's coiffured head during the Wimbledon men's singles final, as you do, there was this strange hope that the Hollywood star was enjoying himself.","content":"MATCH POINT: Brilliant men's final must not mask the need for change at Wimbledon... the All England Club must have a fresh look at where the event is heading Carlos Alcaraz's victory will be the main memory from this edition of Wimbledon The thrilling final must not dampen discussion on how the sport can improve All England Club chairman Deborah Jevans can be a catalyst for positive change Latest Wimbledon 2023 news, including schedule, travel updates and results By Mike Dickson for the Daily Mail Updated: 00:45 BST, 19 July 2023 e-mail View comments Staring at the back of Brad Pitt ’s coiffured head during the Wimbledon men’s final, as you do, there was this strange hope that he was enjoying himself. One of many A-listers in attendance, and seated just in front of the press zone, the Hollywood star must surely have been swept up in the thunderous climax along with everyone else. It was a fantastic occasion and proof that, at its best, tennis can provide unique drama and is peak theatre, at least as good to watch as any other sport. Wimbledon 2023 will be remembered for its brilliant men’s final and quite likely as a defining point in its history, although those rushing to judge this as the end of the Novak Djokovic era could be premature. In six months’ time the Serb will be back in Melbourne, and if Carlos Alcaraz meets him there, he may be expected to beat him again, which is a very different dynamic. Carlos Alcaraz's triumph in the men's singles final may be viewed as a defining point for tennis Actor Brad Pitt, right, must have been among those swept up in the thunderous climax Alcaraz's win was significant but it is too early to declare the end to Novak Djokovic's era Just as the Spaniard’s victory should not be taken as an automatic regime change, the incredible finish to Wimbledon should not place it as one of the great editions of the Championships. This was not a vintage year overall, although it panned out as a better tournament than it might have looked early on. The omens were not great when Nick Kyrgios pulled out at the last minute and Coco Gauff lost on the first day, adding to those already missing from the singles. As it happened there were plenty of storylines and, as ever, a fair smattering of good matches. Chris Eubanks, Mirra Andreeva and Elina Svitolina were among those who always emerge to keep things bubbling. So it was not that the men’s final made this Wimbledon a case of all fur coat and no knickers. Alcaraz-Djokovic, however, should not be allowed to dampen discussion on how the game can improve itself and increase the sum of its total parts. The pace of play and the amount of dead time in matches still need addressing. How, for example, can Djokovic be allowed to stop the final for seven minutes to visit the loo? Many found it utterly tedious when the Serb often bounced the ball around 20 times before both first and second serve (again legally). The spectacle would not have suffered if a tiebreak had come at 5-5, and the 26-minute game in the middle of the third set did not add much. It was interesting to hear Holger Rune, in the vanguard of the next generation, say that he would quite happily play a deciding point at deuce. If matches did not last so long then players would not get injured so often, or pull out of events with the now accepted excuse of ‘fatigue’. One era change that is definitely occurring at Wimbledon, obviously less noticed outside the parish, is the arrival of a new All England Club chairman, Deborah Jevans. It is to be hoped that she recognises some of this, and can be a catalyst for constructive change. Rising star Holger Rune floated the idea of a deciding point when a game reaches deuce New All England Club chairman Deborah Jevans, left, can be a catalyst for positive change Jevans must take a fresh look at where the All England Club is heading and help unify the sport Amid the sport’s fractured governance, Jevans would find an ally in Tennis Australia’s chief executive Craig Tiley, who definitely gets that you cannot stand still in a changing marketplace. As a former player, Jevans will bring much-needed tennis knowledge to the leaders’ table, and also the experience of working in other sports. She ought not to have a problem understanding the wider context. Jevans has a considerable in-tray when it comes to more local matters. A fresh look is required at where the All England Club, this odd hybrid of elite private members’ club and magnificent flagship sporting event, is heading, and how it connects and communicates with the outside world. A particular issue to be resolved is the impasse that has developed around its expansion plans into neighbouring land on the former golf course. Beyond that is bringing the clout that Wimbledon has in helping unify the way the whole sport is run. Not an easy task when all the actors seek to protect what is theirs, and are so reluctant to pool sovereignty. A co-ordinated approach to improving and updating the offering has never been more needed, especially when it comes to the women’s game. Sport and society are changing rapidly, and in the sphere of racket sports, Padel and Pickleball are attractive alternatives. Saudi Arabia waits in the wings, and as Europe gets poorer the Middle East is where the new money is found. Wimbledon will always be a great fortnight. There is a timely parallel as this gripping Ashes series plays out — there should be no worries about the future of England versus Australia in the five-day format, but the wider body of Test cricket has concerns that are very real. Pride restored by our Henry It turned out to be a Wimbledon of two halves for British tennis and the LTA, with the second week more encouraging than the first. It has to be said that the first week was the more important one (by Saturday night there were no home singles players remaining), and serious questions persist about how and where it spends the money generated by the success of the Championships. But credit where it is due, boys’ champion Henry Searle is a product of the system and attends the Loughborough Academy. Somebody has done a good job with a technique that looks well-equipped for the modern game. Henry Searle became Britain's first boys singles champion at Wimbledon since 1962 Neal Skupski triumphed in the men's doubles event alongside Dutchman Wesley Koolhof Congrats, too, to Neal Skupski and others who achieved good wins. It is heartening to see Wimbledon champions coming out of places such as Liverpool and Wolverhampton. It cannot be stressed enough that this is only the end of the beginning for the likes of Searle, 17. The road is long and paved not with the somewhat exceptional surface of grass, but the concrete and clay that prevails at other times of the year. As with every aspiring player, he will have to hack it playing Futures and Challengers in places like Turkey, Tunisia and Egypt, where the audience is made up of coaches, players and a few random holidaymakers. Annabel Croft steps into Sue Barker's shoes Bravo Annabel Croft, who did a fine job stepping into the very considerable shoes of Sue Barker when it came to the highest-profile Centre Court interviews. The 57-year-old authoritatively knows the sport, as well as having strong presentational skills — it might even catch on in the BBC’s coverage. Sitting in the middle of the Wimbledon maelstrom, there is not time to catch a lot of the corporation’s TV output, therefore I cannot offer too much of a critique. However, even when dipping in, it backed up what you heard about too many slip-ups being made — matches are not ‘games’, and Carlos Alcaraz is not a teenager, for example. Anyone can make mistakes, but when investing around £70million of licence payers’ money, you would think the Beeb might insist on all its talent having a working knowledge of tennis, which is more easily acquired by covering events between one Wimbledon and another. Annabel Croft did a fine job in replacing Sue Barker for the main centre court interviews Share or comment on this article: MATCH POINT: Brilliant men's final must not mask the need for change at Wimbledon... the All England Club must have a fresh look at where the event is heading e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 23:45:19","image_url":"https://i.dailymail.co.uk/1s/2023/07/19/00/73362601-0-image-a-85_1689723610687.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Consolation 69-run win for England in final Women's Ashes ODI against Australia","link":"https://www.sootoday.com/national-sports/consolation-69-run-win-for-england-in-final-womens-ashes-odi-against-australia-7293966","keywords":null,"creator":["Canadian Press"],"video_url":null,"description":"TAUNTON, England (AP) — Nat Sciver-Brunt hit another century as England claimed a Women’s Ashes series draw with a 69-run win over Australia under the DLS method in the final one-day international at Taunton.","content":"TAUNTON, England (AP) — Nat Sciver-Brunt hit another century as England claimed a Women’s Ashes series draw with a 69-run win over Australia under the DLS method on Tuesday in the third and final one-day international at Taunton. Victory saw the multi-series format drawn 8-8 on points — the same score as when England last avoided Ashes defeat in Australia five years ago — and meant England had won both the ODI and Twenty20 series 2-1. Urn holder Australia had already retained the Ashes by winning the second ODI in Southampton on Sunday. England trailed 6-0 after the opening two matches of the multi-format series — the solitary test and the T20 opener — but rallied to win four of the remaining five white-ball contests. “To win two series against the world champions in both formats is brilliant,” said England captain Heather Knight, who scored 67. “The Ashes had gone the other day and the disappointment came out then. But the character in the side to turn it around here was unbelievable.\" Fresh from her unbeaten 111 at Southampton, Sciver-Brunt made her second hundred in three days — 129 runs from 149 balls — as England was put into bat and finished on 285-9 to set Australia a challenging target. Sciver-Brunt scored a fourth century from five ODIs against Australia, and the seventh of her England career in this format. Sciver-Brunt’s resistance finally ended in the 48th over as Jess Jonassen tempted an airborne pull into the safe hands of Ashleigh Gardner. Gardner took 3-39 in 10 overs, and Jonassen 3-30 in five. Australia’s target was reduced to 269 from 44 overs by rain and, despite Gardner providing brief hope with 41 from 24 balls, the visitors were bowled out for 199 in 35.3 overs as England ran out comfortable winners to the delight of a capacity crowd. Ellyse Perry top-scored with 53. “We didn’t get over the line in the white-ball stuff but I’m proud the way the series has unfolded. It’s been an amazing spectacle for cricket in general and really cool to be part of it,\" Australia captain Alyssa Healy said. “It’s no secret we haven’t played our best throughout the entire series . . . We’ll sit back now and see what’s not quite gone well for us. In the long run it might do us good to have those reflections and know that we can be better.” ___ AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports The Associated Press","pubDate":"2023-07-18 22:14:53","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/07/2023071817070-64b6fd77173864db0af27989jpeg.jpg;w=960","source_id":"sootoday","category":["sports"],"country":["canada"],"language":"english"},{"title":"‘We’ve got the trophy but we’re not happy’: Australia lose first ODI series in decade as women’s Ashes ends in draw","link":"https://www.theage.com.au/sport/cricket/we-ve-got-the-trophy-but-we-re-not-happy-australia-lose-first-odi-in-a-decade-as-women-s-ashes-ends-in-draw-20230719-p5dpdx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Glenn Moore"],"video_url":null,"description":"Australia had already retained the Ashes, but Tuesday’s heavy one-day defeat means they have drawn the series eight-all under the multi-format points system.","content":"Australia have been beaten in an ODI series for the first time in a decade, thrashed by 69 runs by England in the only blow-out of the women’s Ashes series. Set a revised target of 269 off 44 overs in Taunton on Tuesday, having initially been asked to make their second-highest successful chase of 286, Australia stumbled after the rain break, then crumbled from 6-190 to 199 all out off 35.3 overs. Only Ellyse Perry, with 53 off 58 balls, and Ashleigh Gardner with a blazing 41 off 24, mustered serious resistance. It was Australia’s worst loss in terms of runs since 2008, and England’s biggest win over Australia since their first ODI against them in 1973. Victory in Southampton on Sunday meant Australia had already retained the Ashes, but they have not won the series, which was drawn eight-all under the multi-format points system. England actually won more matches, four to three, taking eight of the last 10 points, but Australia won the Test which was worth four points while the six white-ball matches were worth two apiece. Nat Sciver-Brunt leading the England charge at Taunton. Credit: Reuters “We’ve got the trophy but we’re not happy about not winning this series,” Alyssa Healy said. “We haven’t lost an ODI series for a very long period of time. It feels a bit dirty, at the end of the day.” Nat Sciver-Brunt anchored England’s 9-285 with a second successive century. She hit 129 off 149 balls as the hosts recovered from a bad start to post their highest ODI score. “It feels like a moral victory,” she said. Australia have only once chased a higher total to win, but the Somerset ground is a high-scoring venue so they had reason to believe. Healy put England in and opened with spinner Gardner, who soon dismissed the out-of-form Sophia Dunkley. More significant was Megan Schutt bowling the in-form Tammy Beaumont cheaply. That brought England’s most experienced pair, Heather Knight and Sciver-Brunt, to the crease. They rebuilt, slowly at first, then accelerated towards a century partnership. Having put on 147, Knight was bowled by Alana King for a 72-ball 67 and Alice Capsey holed out off Jess Jonassen soon after. But Sciver-Brunt, who had been dropped by Tahlia McGrath on 54, moved on to a 126-ball century scoring almost exclusively on the leg side. She became the first player to make four centuries against Australia, all scored in her last five Ashes ODIs. Danni Wyatt (43 off 25) provided strong support but was bowled by Gardner, who then caught Sciver-Brunt off Jonassen on the boundary. Gardner finished with 3-39 off 10 overs and Jonassen 3-30 off five as England’s tail wagged limply. The tourists also began slowly, being 2-15 with Phoebe Litchfield (one) caught first slip and Healy (seven) bowled. Perry and McGrath (26) took the score to 68 before the latter was stumped. Beth Mooney joined Perry but nine runs later rain arrived. When the teams returned, Australia needed another 172 runs from 148 balls. Perry moved past her half-century, smashing a no-ball free-hit for six, but was then caught off a leading edge. Mooney went soon after (16) but Gardner came in to smack sixes square and straight. But then she chanced a second run to Wyatt and was run out. After Amy Jones pulled off another smart stumping to dismiss Georgia Wareham (14 off nine), the end came quickly. Annabel Sutherland was bowled for 18, King caught behind for a duck and Jonassen last out for five. AAP Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-18 22:04:27","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘We’ve got the trophy but we’re not happy’: Australia lose first ODI series in decade as women’s Ashes ends in draw","link":"https://www.smh.com.au/sport/cricket/we-ve-got-the-trophy-but-we-re-not-happy-australia-lose-first-odi-in-a-decade-as-women-s-ashes-ends-in-draw-20230719-p5dpdx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"Australia had already retained the Ashes, but Tuesday’s heavy one-day defeat means they have drawn the series eight-all under the multi-format points system.","content":"Australia have been beaten in an ODI series for the first time in a decade, thrashed by 69 runs by England in the only blow-out of the women’s Ashes series. Set a revised target of 269 off 44 overs in Taunton on Tuesday, having initially been asked to make their second-highest successful chase of 286, Australia stumbled after the rain break, then crumbled from 6-190 to 199 all out off 35.3 overs. Only Ellyse Perry, with 53 off 58 balls, and Ashleigh Gardner with a blazing 41 off 24, mustered serious resistance. It was Australia’s worst loss in terms of runs since 2008, and England’s biggest win over Australia since their first ODI against them in 1973. Victory in Southampton on Sunday meant Australia had already retained the Ashes, but they have not won the series, which was drawn eight-all under the multi-format points system. England actually won more matches, four to three, taking eight of the last 10 points, but Australia won the Test which was worth four points while the six white-ball matches were worth two apiece. Nat Sciver-Brunt leading the England charge at Taunton. Credit: Reuters “We’ve got the trophy but we’re not happy about not winning this series,” Alyssa Healy said. “We haven’t lost an ODI series for a very long period of time. It feels a bit dirty, at the end of the day.” Nat Sciver-Brunt anchored England’s 9-285 with a second successive century. She hit 129 off 149 balls as the hosts recovered from a bad start to post their highest ODI score. “It feels like a moral victory,” she said. Australia have only once chased a higher total to win, but the Somerset ground is a high-scoring venue so they had reason to believe. Healy put England in and opened with spinner Gardner, who soon dismissed the out-of-form Sophia Dunkley. More significant was Megan Schutt bowling the in-form Tammy Beaumont cheaply. That brought England’s most experienced pair, Heather Knight and Sciver-Brunt, to the crease. They rebuilt, slowly at first, then accelerated towards a century partnership. Having put on 147, Knight was bowled by Alana King for a 72-ball 67 and Alice Capsey holed out off Jess Jonassen soon after. But Sciver-Brunt, who had been dropped by Tahlia McGrath on 54, moved on to a 126-ball century scoring almost exclusively on the leg side. She became the first player to make four centuries against Australia, all scored in her last five Ashes ODIs. Danni Wyatt (43 off 25) provided strong support but was bowled by Gardner, who then caught Sciver-Brunt off Jonassen on the boundary. Gardner finished with 3-39 off 10 overs and Jonassen 3-30 off five as England’s tail wagged limply. The tourists also began slowly, being 2-15 with Phoebe Litchfield (one) caught first slip and Healy (seven) bowled. Perry and McGrath (26) took the score to 68 before the latter was stumped. Beth Mooney joined Perry but nine runs later rain arrived. When the teams returned, Australia needed another 172 runs from 148 balls. Perry moved past her half-century, smashing a no-ball free-hit for six, but was then caught off a leading edge. Mooney went soon after (16) but Gardner came in to smack sixes square and straight. But then she chanced a second run to Wyatt and was run out. After Amy Jones pulled off another smart stumping to dismiss Georgia Wareham (14 off nine), the end came quickly. Annabel Sutherland was bowled for 18, King caught behind for a duck and Jonassen last out for five. AAP Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-07-18 22:04:27","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Bumble's guide to Manchester: The pubs and poultry are perfect! As England could level the series if Moeen Ali's 'nuts' decision pays off","link":"https://www.dailymail.co.uk/sport/cricket/article-12312489/Bumbles-guide-Manchester-pubs-poultry-perfect-England-level-series-Moeen-Alis-nuts-decision-pays-off.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID LLOYD: There's no place like Manchester. You can walk anywhere and if you don't fancy a stroll, get on the tram! When I was at Sky, they got me driving one.","content":"Bumble's guide to Manchester: The pubs and poultry are perfect! And England could level the series if Moeen Ali's 'nuts' decision pays off England and Australia begin a pivotal fourth Test at Old Trafford on Wednesday For atmosphere, the Old Trafford crowd matches Edgbaston and Headingley Ben Stokes could opt for an even more offensive approach in Manchester By David Lloyd for the Daily Mail Updated: 17:42 EDT, 18 July 2023 e-mail View comments It’s like coming home. The Green Green Grass of Home as Tom Jones sang. This ground is state-of-the-art and steeped in tradition. We’ve seen fantastic players here over the years. Who can forget our king Wasim Akram? For atmosphere, the Old Trafford crowd matches Edgbaston and Headingley. The party stand will be loud and England need that 12th man! There’s no place like Manchester. You can walk anywhere and if you don’t fancy a stroll, get on the tram! When I was at Sky, they got me driving one. I had to wear the hi-viz. I was driving fine until I missed an automatic spot and the tram stopped suddenly. Everyone inside was thrown forward! On Portland Street, there’s the legendary Grey Horse Inn, the Circus Tavern, which is the smallest pub in the city, and the Old Monkey virtually next to each other. And sandwiched between them is a chicken shop. You can walk anywhere in Manchester and if you don’t fancy a stroll you can get on the tram For atmosphere, the Old Trafford crowd matches those found at Edgbaston and Headingley The Circus Tavern, located in Manchester City centre, is one of the smallest bars in Europe Now that’s what you call planning. Five minutes away, you’ve got the City Arms and the Vine Inn and they’re connected to each other, too. Stand outside and watch the world go by. Then there’s Peveril of the Peak, the Marble Arch Inn and the Briton’s Protection. I’ll be everywhere. If you want a bit of live rock ’n’ roll, get to the Northern Quarter and the Band on the Wall. Canal Street is in the centre of the Gay Village. It’s well worth a visit! For food, just behind Portland Street is the fabulous Chinatown. The Little Yang Sing is a personal favourite. For your curries, go anywhere. Everyone does it right. Head to Fumo for an Italian and some fine people-watching. Dr John Cooper Clarke was there earlier this week. Anyway, we’re here for the cricket and I hear Ben Stokes is going to go even more attacking. I look forward to watching that but it might be kamikaze! It will be a good pitch but with the recent weather I doubt it will have the same pace as Headingley. Moeen Ali, batting at three, has put his hand up for the greater good as nobody wants to do it Australia captain Pat Cummins (right) has decided to drop Todd Murphy (left) meaning the visitors will go into a Test without a specialist spinner for the first time since 2012 Australia are going without a frontline spinner and I don’t know what Shane Warne would have made of that. I’d always pick a spinner here. Stokes loves to chase and he knows Australia’s spin options aren’t strong, so England will surely bowl first if they win the toss. A word for Moeen Ali, batting at three. He’s put his hand up for the greater good because nobody wants to do it. It’s terrific of him. It’s also nuts! From retirement to frontline spinner and batting at three in the Ashes. Main man Mo! By the way, there’s another Old Trafford nearby. They play this thing called football there. Don’t go to the wrong one. And if you want to hear me on the wireless, I’m commentating on this Test for the Australian radio channel SEN. Share or comment on this article: Bumble's guide to Manchester: The pubs and poultry are perfect! As England could level the series if Moeen Ali's 'nuts' decision pays off e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 21:41:38","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/22/73359381-0-image-a-9_1689716481307.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"JASON GILLESPIE: Going into the fourth Ashes Test without a frontline spinner carries considerable risk...but Travis Head's bowling display at Headingley and the returning Cameron Green have convinced Australia's think-tank its one worth taking","link":"https://www.dailymail.co.uk/sport/cricket/article-12312381/JASON-GILLESPIE-Going-fourth-Ashes-Test-without-frontline-spinner-carries-considerable-risk-Travis-Heads-bowling-display-Headingley-returning-Cameron-Green-convinced-Australias-think-tank-one-worth-taking.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JASON GILLESPIE: I would have expected Cummins to use his off-spinner during England's run-chase had Lyon been there. So it's not a surprise that Murphy has been left out of the fourth Test.","content":"JASON GILLESPIE: It's sad when Australia don't trust their spinner. I'd play Todd Murphy... but Pat Cummins has got his way with an all-pace attack England and Australia face off in the fourth Test at Old Trafford on Wednesday Australia go into the tie without a specialist spinner for the first time since 2012 All-rounder Cameron Green returns to the side following a hamstring issue By Jason Gillespie For The Daily Mail Updated: 22:40 BST, 18 July 2023 e-mail View comments If Todd Murphy was truly picked to fill the role vacated by Nathan Lyon, then why was he not bowled for more than two overs on the last day at Headingley by Pat Cummins ? Certainly, I would have expected the Australia captain to use his off-spinner in those key moments of the England run-chase had Lyon been there. So it’s not a great surprise to me that Australia have left Murphy out of Wednesday's fourth Test. Is that a trust issue? Is Cummins not sure whether Murphy has what it takes? Or was he just protecting his young spinner in Leeds when he was up against some really good, aggressive England batsmen ? It is an interesting debate, particularly as on Wednesday Australia are going into a match without a specialist spinner for the first time in Test cricket since 2012. I do rate Murphy. He’s a good young bowler and I would be loath to go into any Test without a frontline spinner. I would have played him at Old Trafford. But maybe Mitchell Marsh created a nice little problem for Australia with the way he played at Headingley. And Travis Head bowled pretty well at Lord’s when Lyon went down, so clearly the think-tank have decided they can use his spin now and leaving Murphy out is their best way of getting Cameron Green back into the side. Australia captain Pat Cummins has decided not to select a specialist spinner for the fourth Test Off-spinner Todd Murphy has been dropped for the fourth Ashes Test at Old Trafford All-rounder Cameron Green has been recalled to the Australia side for the pivotal clash Australia will use Head in a defensive role with the ball and then attack with their quicks and rotate them. Green, after his hamstring niggle, could be used in short, sharp bursts with Marsh bowling some overs alongside the big three quicks. I’m not surprised Josh Hazlewood is back because England have attacked Scotty Boland. It may sound odd but that is a bit of a feather in Boland’s cap because it means England respect him and the way he goes about his work. There is no surprise either in David Warner retaining his place. Australia coach Andrew McDonald likes experienced players and it’s getting to the nitty-gritty of this Ashes now when you need that experience. Cummins would be of the same mind-set. There have been such fine margins in this series. It could be 3-0 to either side now but it’s 2-1 and Australia know if they nail their skills and stick to their processes this week they could become the first touring side to win an Ashes series in England since 2001. England will try to drive this Test forward, particularly if there’s bad weather around, but Australia can play the long game. It’s OK for them to win after tea on day five even if England seem to be looking to win it by the morning of day three! We all know England want to entertain and put on a show but there are many ways to entertain and a Test going deep into day five with a positive result at the end of it is proper entertainment, too. But make no mistake, Australia will be playing to win this Test. They won’t be going into it looking for the draw they need to retain the urn. There is no surprise in David Warner (pictured) retaining his place as Australia coach Andrew McDonald likes to included experienced players in his line-up Australia will use Travis Head (picture) in a defensive role with the ball and then attack with their quicks and rotate them The teams are close but have very different methods and that’s what we love about Test cricket. There are so many ways to approach the game and have success. I was at the first two Tests but I watched the third from home in Adelaide and there is no doubt this series has captured the imagination of both sides of the Ashes divide. It’s been a big deal here in Australia. It’s awesome. And there are similar vibes to 2005. Old Trafford is one of the great venues in cricket and I’ve no doubt the Lancastrians will come out in full support of England. There will be a raucous atmosphere and it’s a really exciting prospect. I predicted a 3-1 victory for Australia before the start of this series and I’m not going to change that now. The rain I expected for at least one Test could have an impact on this game but I hope not. Let’s hope for clear skies and a cracking game. I can’t wait to see what happens. Share or comment on this article: JASON GILLESPIE: Going into the fourth Ashes Test without a frontline spinner carries considerable risk...but Travis Head's bowling display at Headingley and the returning Cameron Green have convinced Australia's think-tank its one worth taking e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 21:40:43","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/20/73354739-0-image-a-66_1689707995618.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Heather Knight proud of England’s Ashes fightback","link":"https://www.independent.co.uk/sport/cricket/england-heather-knight-odi-england-cricket-t20-b2377669.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"England won both white-ball series 2-1.","content":"Captain Heather Knight declared herself “super-proud” after her England team completed a remarkable Women’s Ashes turnaround to draw the series. England trailed 6-0 after the opening two matches of the multi-format series – the solitary Test and the T20 opener – but rallied to win four of the remaining five white-ball contests to draw 8-8. After winning the T20 matches 2-1, England’s 69-run victory by DLS method at Taunton on Tuesday gave them a second white-ball series victory over the world’s number one side. “To win two series against the world champions in both formats is brilliant,” Knight said. “The Ashes had gone the other day and the disappointment came out then. But the character in the side to turn it around here was unbelievable. “We wanted to do justice to the way we have played so far, and it was a sell-out in front of a rowdy crowd. “We wanted to continue to entertain and play how we want to. An ODI series on the line, there’s no bigger (test of) character than that against a team we haven’t beaten in 10 years. “There’s disappointment we haven’t got the Ashes but it’s a draw, and if you’d told me that at 6-0 down I would have bitten your hand off.” Nat Sciver-Brunt’s second century in the space of three days – 129 on the back of an unbeaten 111 at Southampton on Sunday – laid the platform for England’s series-levelling success. England posted a challenging score of 285 for nine from their 50 overs; Australia’s target was reduced to 269 from 44 overs after a 54-minute rain delay. Kate Cross took three wickets and Lauren Bell and Charlie Dean two each as Australia slid to 199 all out in 35.3 overs. “Nat is unbelievable,” said Knight. “She’s got four hundreds in five games against the best team in the world. “We talked about staying positive and believing that we were good enough to beat this side. “Despite losing those two games it actually grew the belief that we were as good as this Australian team and we could go toe to toe with them. “We had to do a few little things better because we felt we were so close in that Edgbaston (T20) defeat. “To play like we have done this summer has been hugely pleasing. The most exciting thing is that we haven’t played our best cricket, this was probably our best performance. “I think this team has got a huge ceiling to keep improving. I don’t think there is a gap between the two sides now. We’ve won two white-ball series, I’m not sure about the gap.” Australia captain Alyssa Healy said the tourists could take satisfaction that the Ashes were “still within our grasp”. Healy said: “We didn’t get over the line in the white-ball stuff but I’m proud the way the series has unfolded. “It’s been an amazing spectacle for cricket in general and really cool to be part of it. “It’s no secret we haven’t played our best throughout the entire series. “England played really well and that’s not diminishing what they’ve achieved, we’ve not. We’ll sit back now and see what’s not quite gone well for us. “In the long run it might do us good to have those reflections and know that we can be better.”","pubDate":"2023-07-18 21:13:23","image_url":"https://static.independent.co.uk/2023/07/18/22/660493df4e68fc12682ac0b090455742Y29udGVudHNlYXJjaGFwaSwxNjg5Nzk5ODE5-2.73023566.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England claim Women’s Ashes series draw after fresh heroics from Nat Sciver-Brunt","link":"https://www.standard.co.uk/sport/cricket/womens-ashes-result-england-australia-nat-sciver-brunt-b1095248.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"Nat Sciver-Brunt was the hero again as England claimed a Women’s Ashes series draw with a 69-run win over Australia on the DLS method in the final ODI in Taunton.","content":"at Sciver-Brunt was the hero again as claimed a series draw with a 69-run win over on the DLS method in the final ODI in Taunton. Victory saw the multi-series format drawn 8-8, the same score as when England last avoided Ashes defeat in Australia five years ago, and meant England had won both the ODI and Twenty20 series 2-1. Australia had already retained the Ashes by winning the second ODI in Southampton on Sunday. Fresh from her unbeaten 111 at Southampton, Sciver-Brunt made her second hundred in the space of three days - 129 from 149 balls - as Australia were set a challenging 286 for victory. Batting of the highest order also secured Sciver-Brunt a fourth century from five ODIs against Australia, and the seventh of her England career in this format. Australia's target was reduced to 269 from 44 overs by rain and, despite Ashleigh Gardner providing brief hope with a bludgeoning 41 from 24 balls, they were bowled out for 199 as England ran out comfortable winners to the delight of a capacity crowd. SPONSORED England, having lost the toss, were soon in trouble as openers Sophia Dunkley and Tammy Beaumont departed with just 12 runs on the board. Captain Heather Knight and Sciver-Brunt rose to the challenge of repairing the innings, leading England to 43 for two by the end of the first powerplay after 10 overs. Runs came freely with Knight finding gaps in the field with ease and Sciver-Brunt, who survived a stumping review off Gardner on 25, landing a six on the boundary cushion with imperious precision. But with McGrath spilling a return chance off Sciver-Brunt, then on 54, the third-wicket partnership was worth 147 when Knight advanced down the wicket to Alana King and was bowled for 67, her 72-ball stay containing six fours and a six. Alice Capsey dragged Jess Jonassen to long-on for five but huge roars greeted Sciver-Brunt as she reached three figures off 126 balls. England entered the final 10 overs seeking to accelerate and Danni Wyatt played the perfect cameo with a whirlwind 43 from 25 balls before being bowled attempting to cut a full-length ball from Gardner. Amy Jones was run out for six and Sciver-Brunt's resistance finally ended in the 48th over as Jonassen tempted an airborne pull into the safe hands of Gardner. The latter then won an lbw review against Charlie Dean to finish with three for 39 and Jonassen also collected a third scalp by castling Kate Cross as England closed on 285 for nine. Australia, as England had done, lost two early wickets. Phoebe Litchfield fell for one to Lauren Bell, with Sophie Ecclestone accepting a low chance at first slip, and Alyssa Healy was cleaned up by a beauty from Cross as Australia slipped to 15 for two. Tahlia McGrath appeared well set on 26 as Australia steadied the ship, but Ecclestone's flight deceived her and Jones completed a smart stumping. The players were forced off by rain with Australia 97 for three after 19.2 overs, with England facing potential heartbreak as they needed to bowl 20 overs to constitute a completed match. But the players were back on the field 54 minutes later, with Australia's revised target asking them to score at seven runs an over. Ellyse Perry, having reached her half-century with a free-hit six, provided a steepling catch to Capsey off Cross on 53, and Beth Mooney drove straight to Ecclestone at mid-off to give Cross a third victim. Australia were given hope as Gardner went on the offensive, taking 17 from a Bell over, but her acceptance of a risky second after Sutherland drove through the covers proved fatal as she was just short of her ground when Cross took the bails off from Wyatt's throw. Australia never recovered as Jones produced another excellent stumping to remove Wareham for 14 and Dean, called up with Sarah Glenn needing surgery for appendicitis, bowled Sutherland for 18. King went for nought as Jones held a towering catch and England's win was completed as Bell held a thick edge from Jonassen at short third.","pubDate":"2023-07-18 20:30:26","image_url":"https://static.standard.co.uk/2023/07/18/21/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Nat Sciver-Brunt leads England to ODI series win as Ashes end all square","link":"https://www.independent.co.uk/sport/cricket/nat-sciverbrunt-australia-england-odi-heather-knight-b2377619.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"The England batter has scored four hundreds in her last five ODIs against Australia","content":"Nat Sciver-Brunt was the hero again as England claimed a Women’s Ashes series draw with a 69-run win over Australia on the DLS method in the final ODI in Taunton. Victory saw the multi-series format drawn 8-8, the same score as when England last avoided Ashes defeat in Australia five years ago, and meant England had won both the ODI and Twenty20 series 2-1. Australia had retained the Ashes by winning the second ODI in Southampton on Sunday. Fresh from her unbeaten 111 at Southampton, Sciver-Brunt made her second hundred in the space of three days – 129 from 149 balls – as Australia were set a challenging 286 for victory. Batting of the highest order also secured Sciver-Brunt a fourth century from five ODIs against Australia, and the seventh of her England career in this format. Australia’s target was reduced to 269 from 44 overs by rain and, despite Ashleigh Gardner providing brief hope with a bludgeoning 41 from 24 balls, England ran out comfortable winners to the delight of a capacity crowd. England, having lost the toss, were soon in trouble as openers Sophia Dunkley and Tammy Beaumont departed with just 12 runs on the board. Captain Heather Knight and Sciver-Brunt rose to the challenge of repairing the innings, leading England to 43 for two by the end of the first powerplay after 10 overs. Runs came freely with Knight finding gaps in the field with ease and Sciver-Brunt, who survived a stumping review off Gardner on 25, landing a six on the boundary cushion with imperious precision. But with McGrath spilling a return chance off Sciver-Brunt, then on 54, the third-wicket partnership was worth 147 when Knight advanced down the wicket to Alana King and was bowled for 67, her 72-ball stay containing six fours and a six. Alice Capsey dragged Jess Jonassen to long-on for five but huge roars greeted Sciver-Brunt as she reached three figures off 126 balls. England entered the final 10 overs seeking to accelerate and Danni Wyatt played the perfect cameo with a whirlwind 43 from 25 balls before being bowled attempting to cut a full-length ball from Gardner. Amy Jones was run out for six and Sciver-Brunt’s resistance finally ended in the 48th over as Jonassen tempted an airborne pull into the safe hands of Gardner. The latter then won an lbw review against Charlie Dean to finish with three for 39 and Jonassen also collected a third scalp by castling Kate Cross as England closed on 285 for nine. Australia, as England had done, lost two early wickets. Phoebe Litchfield fell for one to Lauren Bell, with Sophie Ecclestone accepting a low chance at first slip, and Alyssa Healy was cleaned up by a beauty from Cross as Australia slipped to 15 for two. Tahlia McGrath appeared well set on 26 as Australia steadied the ship, but Ecclestone’s flight deceived her and Jones completed a smart stumping. The players were forced off by rain with Australia 97 for three after 19.2 overs, with England facing potential heartbreak as they needed to bowl 20 overs to constitute a completed match. But the players were back on the field 54 minutes later, with Australia’s revised target asking them to score at seven runs an over. Ellyse Perry , having reached her half-century with a free-hit six, provided a steepling catch to Capsey off Cross on 53, and Beth Mooney drove straight to Ecclestone at mid-off to give Cross a third victim. Australia were given hope as Gardner went on the offensive, taking 17 from a Bell over, but her acceptance of a risky second after Sutherland drove through the covers proved fatal as she was just short of her ground when Cross took the bails off from Wyatt’s throw. Australia never recovered as Jones produced another excellent stumping to remove Wareham for 14 and Dean, called up with Sarah Glenn needing surgery for appendicitis, bowled Sutherland for 18. King went for nought as Jones held a towering catch and England’s win was completed as Bell held a thick edge from Jonassen at short third.","pubDate":"2023-07-18 20:08:33","image_url":"https://static.independent.co.uk/2023/07/18/21/GettyImages-1554072207.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"}]}