{"newsArray":[{"title":"Will CSK qualify for playoffs 2022: Chennai Super Kings qualification criteria for IPL 2022 playoffs","link":"https://thesportsrush.com/cricket-news-will-csk-qualify-for-playoffs-2022-chennai-super-kings-qualification-criteria-for-ipl-2022-playoffs/","keywords":["Cricket","CSK","Gujarat Titans","IPL 2022","chennai super kings","csk","GT","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Will CSK qualify for playoffs 2022: Chennai Super Kings have ended up on the losing side for the fifth time this season. Defending champions Chennai Super Kings have suffered their fifth Indian Premier League 2022 loss; becoming only the second team to do so this season. While a fifth loss in sixth match is bound… The post Will CSK qualify for playoffs 2022: Chennai Super Kings qualification criteria for IPL 2022 playoffs appeared first on The SportsRush.","content":"Will CSK qualify for playoffs 2022: Chennai Super Kings have ended up on the losing side for the fifth time this season. Defending champions Chennai Super Kings have suffered their fifth Indian Premier League 2022 loss; becoming only the second team to do so this season. While a fifth loss in sixth match is bound to hurt the second-best team in the history of the biggest T20 league across the world, CSK would be all the more hurt after losing a match which they should’ve won. Not that Chennai posted a match-winning total after being put in to bat first by Gujarat Titans at the Maharashtra Cricket Association Stadium tonight but had bowled exceedingly well to reduce the opposition to 48/4 in eight overs while defending a 170-run target. Super Kings, who have had issues with their death overs bowling this season, were found wanting in this department yet again as GT batter David Miller and stand-in captain Rashid Khan managed to score 48 runs in the last three overs to make Super Kings look absolutely clueless. Will CSK qualify for playoffs 2022? Currently at the ninth position on the points table, CSK are only above Mumbai Indians (six losses in as many matches). While their chances of qualifying for the playoffs are next to impossible, only a miraculous second half of IPL 2022 league phase can see them end up among the Top Four teams. In the general run of things, a team requires a minimum of eight victories to qualify for the playoffs of an IPL season. Historically, teams have qualified with seven wins as well but it only happens with a superior NRR (Net Run Rate). Not the result we wanted but a good fight from the boys! #GTvCSK #WhistlePodu #Yellove pic.twitter.com/ktLxVIF97T — Chennai Super Kings (@ChennaiIPL) April 17, 2022 The only way Chennai can look to qualify for IPL 2022 playoffs is by winning seven out of their remaining eight league matches this season. Assuming that they win six matches, Net Run Rate will come into picture. At -0.638, Chennai are among the three teams to have a negative NRR this season. Given their form and the formation of squad, it doesn’t appear like Super Kings will make it to IPL 2022 playoffs until they stage a remarkable comeback into the tournament. Readers must note that Ravindra Jadeja and his men will next face Mumbai in Navi Mumbai on Thursday. The post Will CSK qualify for playoffs 2022: Chennai Super Kings qualification criteria for IPL 2022 playoffs appeared first on The SportsRush.","pubDate":"2022-04-17 19:03:00","full_description":"Will CSK qualify for playoffs 2022: Chennai Super Kings have ended up on the losing side for the fifth time this season. Defending champions Chennai Super Kings have suffered their fifth Indian Premier League 2022 loss; becoming only the second team to do so this season. While a fifth loss in sixth match is bound to hurt the second-best team in the history of the biggest T20 league across the world, CSK would be all the more hurt after losing a match which they should’ve won. Not that Chennai posted a match-winning total after being put in to bat first by Gujarat Titans at the Maharashtra Cricket Association Stadium tonight but had bowled exceedingly well to reduce the opposition to 48/4 in eight overs while defending a 170-run target. Super Kings, who have had issues with their death overs bowling this season, were found wanting in this department yet again as GT batter David Miller and stand-in captain Rashid Khan managed to score 48 runs in the last three overs to make Super Kings look absolutely clueless. Currently at the ninth position on the points table, CSK are only above Mumbai Indians (six losses in as many matches). While their chances of qualifying for the playoffs are next to impossible, only a miraculous second half of IPL 2022 league phase can see them end up among the Top Four teams. In the general run of things, a team requires a minimum of eight victories to qualify for the playoffs of an IPL season. Historically, teams have qualified with seven wins as well but it only happens with a superior NRR (Net Run Rate) . Not the result we wanted but a good fight from the boys! #GTvCSK #WhistlePodu #Yellove 🦁💛 pic.twitter.com/ktLxVIF97T — Chennai Super Kings (@ChennaiIPL) April 17, 2022 The only way Chennai can look to qualify for IPL 2022 playoffs is by winning seven out of their remaining eight league matches this season. Assuming that they win six matches, Net Run Rate will come into picture. At -0.638, Chennai are among the three teams to have a negative NRR this season. Given their form and the formation of squad, it doesn’t appear like Super Kings will make it to IPL 2022 playoffs until they stage a remarkable comeback into the tournament. Readers must note that Ravindra Jadeja and his men will next face Mumbai in Navi Mumbai on Thursday.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Miller, Rashid propel Gujarat to 3-wkt win over CSK","link":"https://www.thehansindia.com/sports/cricket/miller-rashid-propel-gujarat-to-3-wkt-win-over-csk-738522","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"David Miller’s blitzkrieg unbeaten 94 off 51 balls and Rashid Khan’s 40 off 21 balls powered Gujarat Titans to 3-wicket win against Chennai Super Kings in an IPL 2022 match at the Maharashtra Cricket Association (MCA) Stadium, here on Sunday.","content":"David Miller, Rashid KhanDavid Miller, Rashid KhanPune: David Miller's blitzkrieg unbeaten 94 off 51 balls and Rashid Khan's 40 off 21 balls powered Gujarat Titans to 3-wicket win against Chennai Super Kings in an IPL 2022 match at the Maharashtra Cricket Association (MCA) Stadium, here on Sunday. Gujarat consolidated their lead at top with five wins out of 6 games played.Earlier, opener Ruturaj Gaikwad returned to run-scoring with an excellent half-century (73 off 48) and helped Chennai post 169-5 against Gujarat. Apart from Gaikwad, Ambati Rayudu (46 off 31) played a solid knock and both batters stitched a crucial partnership of 92 runs off 56 balls for the third wicket. Lower down the order, Ravindra Jadeja (22 off 12) and Shivam Dube (19 off 17) also made valuable contributions with the bat for CSK. Invited to bat first, CSK didn't have a great start as Mohammed Shami struck in the third over of the innings to dismiss Uthappa, who tried to play across the line but was struck on the back leg. The onfield umpire ruled in favour of the batter but a successful review from Gujarat ended Uthappa's stay for 3 off 10. However, Gaikwad targeted the inexperienced Dayal in the fourth over and hit him for a six and a four. But, on the other end, Moeen Ali didn't seem in touch as his struggle at the crease was ended by Alzarri Joseph. From there on, a well-set Gaikwad and new batter Rayudu kept the scoreboard ticking with constant strike rotation and timely boundaries to take CSK to 66/2 after 10 overs. After spending enough time on the pitch, both Gaikwad and Rayudu decided to free their arms and took Gujarat bowlers to the cleaners by smashing boundaries and sixes all across the ground, taking the score to 124 after 14 overs. During the process, Gaikwad also brought his first half-century of the season in 37 balls. Brief scores: Chennai Super Kings 169-5 in 20 overs (Ruturaj Gaikwad 73, Ambati Rayudu 46; Alzarri Joseph 2/34) vs Gujarat Titans 170/7 in 19.5 overs (David Miller 94 not out, Rashid Khan 40, Dwayne Bravo 3/23, Maheesh Theekshana 2/24).","pubDate":"2022-04-17 18:37:00","full_description":"David Miller, Rashid Khan Pune: David Miller's blitzkrieg unbeaten 94 off 51 balls and Rashid Khan's 40 off 21 balls powered Gujarat Titans to 3-wicket win against Chennai Super Kings in an IPL 2022 match at the Maharashtra Cricket Association (MCA) Stadium, here on Sunday. Gujarat consolidated their lead at top with five wins out of 6 games played. Earlier, opener Ruturaj Gaikwad returned to run-scoring with an excellent half-century (73 off 48) and helped Chennai post 169-5 against Gujarat. Apart from Gaikwad, Ambati Rayudu (46 off 31) played a solid knock and both batters stitched a crucial partnership of 92 runs off 56 balls for the third wicket. Lower down the order, Ravindra Jadeja (22 off 12) and Shivam Dube (19 off 17) also made valuable contributions with the bat for CSK. Invited to bat first, CSK didn't have a great start as Mohammed Shami struck in the third over of the innings to dismiss Uthappa, who tried to play across the line but was struck on the back leg. The onfield umpire ruled in favour of the batter but a successful review from Gujarat ended Uthappa's stay for 3 off 10. However, Gaikwad targeted the inexperienced Dayal in the fourth over and hit him for a six and a four. But, on the other end, Moeen Ali didn't seem in touch as his struggle at the crease was ended by Alzarri Joseph. From there on, a well-set Gaikwad and new batter Rayudu kept the scoreboard ticking with constant strike rotation and timely boundaries to take CSK to 66/2 after 10 overs. After spending enough time on the pitch, both Gaikwad and Rayudu decided to free their arms and took Gujarat bowlers to the cleaners by smashing boundaries and sixes all across the ground, taking the score to 124 after 14 overs. During the process, Gaikwad also brought his first half-century of the season in 37 balls. Brief scores: Chennai Super Kings 169-5 in 20 overs (Ruturaj Gaikwad 73, Ambati Rayudu 46; Alzarri Joseph 2/34) vs Gujarat Titans 170/7 in 19.5 overs (David Miller 94 not out, Rashid Khan 40, Dwayne Bravo 3/23, Maheesh Theekshana 2/24).","image_url":"https://assets.thehansindia.com/h-upload/2022/04/17/500x300_1287466-millerrashid.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian Premier League, GT vs CSK Report: David Miller's Unbeaten 94 Powers Gujarat Titans To Thrilling Win Over Chennai Super Kings | Cricket News - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiqQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pbmRpYW4tcHJlbWllci1sZWFndWUtZ3QtdnMtY3NrLXJlcG9ydC1kYXZpZC1taWxsZXJzLXVuYmVhdGVuLTk0LXBvd2Vycy1ndWphcmF0LXRpdGFucy10by10aHJpbGxpbmctd2luLW92ZXItY2hlbm5haS1zdXBlci1raW5ncy0yODk2Mjg40gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Indian Premier League, GT vs CSK Report: David Miller's Unbeaten 94 Powers Gujarat Titans To Thrilling Win Over Chennai Super Kings | Cricket News  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-04-17 18:26:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Killer Miller is back”: Yuvraj Singh, Aakash Chopra, R Vinay Kumar and others celebrate as David Miller and Rashid Khan beat CSK in IPL 2022","link":"https://thesportsrush.com/cricket-news-killer-miller-is-back-yuvraj-singh-aakash-chopra-r-vinay-kumar-and-others-celebrate-as-david-miller-and-rashid-khan-beat-csk-in-ipl-2022/","keywords":["Cricket","CSK","Gujarat Titans","IPL 2022","chennai super kings","csk","David Miller","GT","Indian Premier League","rashid khan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"David Miller and Rashid Khan: The duo from Gujarat Titans turned the tables to seal an emphatic chase tonight. During the 29th match of the ongoing 15th season of the Indian Premier League between Gujarat Titans and Chennai Super Kings in Pune, Gujarat Titans beat Chennai Super Kings by 3 wickets with a ball to… The post “Killer Miller is back”: Yuvraj Singh, Aakash Chopra, R Vinay Kumar and others celebrate as David Miller and Rashid Khan beat CSK in IPL 2022 appeared first on The SportsRush.","content":"David Miller and Rashid Khan: The duo from Gujarat Titans turned the tables to seal an emphatic chase tonight. During the 29th match of the ongoing 15th season of the Indian Premier League between Gujarat Titans and Chennai Super Kings in Pune, Gujarat Titans beat Chennai Super Kings by 3 wickets with a ball to spare. Chasing a 170-run target, Titans had lost three wickets in the powerplay before eventually being reduced to 48/4 in eight overs. A lacklustre start to a chase in the absence of captain Hardik Pandya was far from an ideal scenario but batter David Miller delivered with his team in deep trouble. Coming in to bat at No. 5 in the fifth over, Miller scored a match-winning 39th T20 half-century, 11th in the IPL and first-ever for GT. A 37-ball 70-run partnership for the sixth wicket between Miller and stand-in captain Rashid Khan (40) turned the tables and how at the Maharashtra Cricket Association Stadium tonight. From needing 112 runs in 10 overs to needing 48 in the last three, Miller and Rashid hit boundaries to all parts of the ground to seal an emphatic chase tonight. While Rashid hit two fours and three sixes at a strike rate of 190.47, Miller ended up with a magnificent 94* (51) comprising of eight fours and six sixes. Rashid, in particular, was ferocious against Chris Jordan to hit three sixes and a four in a game-changing 18th over. First team to collect 10 points this season, Gujarat has further strengthened their position at the top of the points table. Defending champions Super Kings, on the other hand, have become the second team to lose five IPL 2022 matches. Twitter reactions on David Miller and Rashid Khan beating CSK: Killer kills it !! @DavidMillerSA12 you beauty !!! Aur nehra ji ki smile ? #CSKvsGT #IPL2022 at its best !!! — Yuvraj Singh (@YUVSTRONG12) April 17, 2022 Killer Miller. Unbelievable turnaround. #IPL2022 — Aakash Chopra (@cricketaakash) April 17, 2022 Killer Miller finished in style! What an unbelievable chase. #DavidMiller #CSKvGT #IPL2022 — Vinay Kumar R (@Vinay_Kumar_R) April 17, 2022 He’s back. Killer Miller is back … And quite sure the @gujarat_titans back end staff has had a big role to play. To appoint Miller as their finisher for the season.. To give him a second chance, the confidence, to make him feel, he’s the one … Love the sport #GTvsCSK — Jatin Sapru (@jatinsapru) April 17, 2022 Culture building wins. @gujarat_titans just keep finding a way. Remarkable. — Neroli Meadows (@Neroli_Meadows) April 17, 2022 For more cricket-related news, click here. The post “Killer Miller is back”: Yuvraj Singh, Aakash Chopra, R Vinay Kumar and others celebrate as David Miller and Rashid Khan beat CSK in IPL 2022 appeared first on The SportsRush.","pubDate":"2022-04-17 18:00:16","full_description":"David Miller and Rashid Khan: The duo from Gujarat Titans turned the tables to seal an emphatic chase tonight. During the 29th match of the ongoing 15th season of the Indian Premier League between Gujarat Titans and Chennai Super Kings in Pune, Gujarat Titans beat Chennai Super Kings by 3 wickets with a ball to spare. Chasing a 170-run target, Titans had lost three wickets in the powerplay before eventually being reduced to 48/4 in eight overs. A lacklustre start to a chase in the absence of captain Hardik Pandya was far from an ideal scenario but batter David Miller delivered with his team in deep trouble. Coming in to bat at No. 5 in the fifth over, Miller scored a match-winning 39th T20 half-century, 11th in the IPL and first-ever for GT. A 37-ball 70-run partnership for the sixth wicket between Miller and stand-in captain Rashid Khan (40) turned the tables and how at the Maharashtra Cricket Association Stadium tonight. From needing 112 runs in 10 overs to needing 48 in the last three, Miller and Rashid hit boundaries to all parts of the ground to seal an emphatic chase tonight. While Rashid hit two fours and three sixes at a strike rate of 190.47, Miller ended up with a magnificent 94* (51) comprising of eight fours and six sixes. Rashid, in particular, was ferocious against Chris Jordan to hit three sixes and a four in a game-changing 18th over. First team to collect 10 points this season, Gujarat has further strengthened their position at the top of the points table. Defending champions Super Kings, on the other hand, have become the second team to lose five IPL 2022 matches. Killer kills it !! @DavidMillerSA12 you beauty !!! Aur nehra ji ki smile ? 😁 #CSKvsGT #IPL2022 at its best !!! — Yuvraj Singh (@YUVSTRONG12) April 17, 2022 Killer Miller. Unbelievable turnaround. 🥳🤩 #IPL2022 — Aakash Chopra (@cricketaakash) April 17, 2022 Killer Miller finished in style! What an unbelievable chase. #DavidMiller #CSKvGT #IPL2022 — Vinay Kumar R (@Vinay_Kumar_R) April 17, 2022 He’s back. Killer Miller is back … And quite sure the @gujarat_titans back end staff has had a big role to play. To appoint Miller as their finisher for the season.. To give him a second chance, the confidence, to make him feel, he’s the one … Love the sport #GTvsCSK — Jatin Sapru (@jatinsapru) April 17, 2022 Culture building wins. @gujarat_titans just keep finding a way. Remarkable. — Neroli Meadows (@Neroli_Meadows) April 17, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Chennai Super Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-chennai-super-kings-live-score-over-match-29-t20-16-20-updates-2896116","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Chennai Super Kings from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-17 17:25:38","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 19.4 overs, Gujarat Titans, chasing a target of 170, are 168/7. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Gujarat Titans and Chennai Super Kings. Everything related to Gujarat Titans and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Gujarat Titans vs Chennai Super Kings live score. Do check for Gujarat Titans vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. Is it run out? 19.4 overs (4 Runs) FOUR! Just the two needed now in two! Miller finds the gap. This is full, right in the slot again. Jordan misses his length. This is whipped through square leg and it races away to the fence. 19.4 overs (1 Run) NO BALL IT IS! It is a bonus run and a Free Hit too! Just the 6 needed now! A high full toss around off, Miller swings, it goes off the outside edge and it is taken at short third man. Chennai are celebrating but it is taken upstairs to check. Replays show that it's above the waist and has not dipped enough. Is that out? Miller has edged a high full toss and is caught at short third man. The umpires get together and send the decision upstairs. It's a no ball for height. Free Hit loading now! 6 needed off 3 balls. Another meeting. This time Moeen and Bravo are discussing the plans with the bowler. Jordan is sweating. He is feeling the heat. 19.3 overs (6 Runs) SIX! That is the reason why he did not take the run, that is right in the slot, poor bowling from Jordan. This is full and on the pads, Miller loves it there, he flicks it well over the backward square leg fence. 7 needed in 3. Another hit like that will do it. Jordan is the one under pressure. He has already gone for 50 in the 21 balls bowled by him. 19.2 overs (0 Run) Two dots in a row! Really good stuff from Jordan! The length is perfect, really full and on middle, this is jammed down to long on and Miller does not run. 19.1 overs (0 Run) A dot to begin! This is full and on the pads, Miller misses out. He looks to flick but misses to get hit on the pads. Dhoni does brilliantly to dive to his right and stop it. Who will bowl the final over? There is a confab going on with MS Dhoni calling the shots. 13 needed off 6 balls. Lockie Ferguson has walked in and is at the non-striker's end. Chris Jordan to bowl. Here we go... 18.6 overs (0 Run) OUT! Alzarri Joseph holes out! Doesn't matter much as David Miller will be on strike for the final over. This was a free hit for Joseph in a way, he tries his best but fails to clear the fence. Fuller and on off, Alzarri Joseph goes hard and lofts it towards long off. Chris Jordan speeds forward and takes a fine catch. Alzarri Joseph to bat. 18.5 overs (0 Run) OUT! CAUGHT! Rashid is gone and it's a sigh of relief for Chennai. Change in pace, slower one and on a length around off, Rashid runs down the track for a big shot but skies it in the air off the bottom part of his bat. Moeen moves across to his left from mid on and takes the catch at mid off. End of a scintillating cameo from the Gujarat skipper. 13 needed off 7 balls. 18.4 overs (2 Runs) Slower one, full and dipping in around leg, Rashid whips it to deep mid-wicket and picks up a couple. 13 needed off 8 balls. 18.3 overs (1 Run) Fuller in length and wide outside off, Miller drives it to deep cover for one. 18.2 overs (3 Runs) Heavy bottom hand this time! Too full, around off, Rashid flies the mini helicopter and sends it blazing down the ground. This time the long off fielder makes the stop and saves one run. 18.1 overs (4 Runs) FOUR! The Afghan is on fire! Picks the slower length ball around off early and smashes it over the bowler's head for a boundary, no chance for long off. 17.6 overs (2 Runs) Two more and that is 25 from the over! The game has turned on its head! Gujarat surely favouties now. The last ball is full and on the pads, this is worked through square leg for two. 17.5 overs (1 Run) Not sure what Rashid was trying to do there! A full toss outside off, Rashid looks to whip it over the leg side yet again, it goes off the top edge and it lands safely on the leg side. They take one. MS Dhoni is having a word with Chris Jordan now. 17.4 overs (6 Runs) SIX! KABOOM! This one is over the fence too! What a shot, what wrist work! Absolutely brilliant! This is outside off, on a length, Rashid brings his wrists into play and clobbers it over wide long on. 26 needed now in 14. Game is now in Gujarat's favour. 17.3 overs (4 Runs) FOUR! Over mid off now! 16 from the first three balls and just 32 needed now in 15 balls. This is a full toss and it is hit over the mid off fielder for a boundary. 17.2 overs (6 Runs) SIX MORE! Rashid is now turning it on! 12 from the first two balls! This is an outrageous stroke! It is full and outside off, Rashid rockets it over point and it sails over the fence. 17.1 overs (6 Runs) SIX! BANG! This is what Rashid can do and this is what was needed from him! What a hit! This was right in the arc. Full and on middle, Rashid whips it over the mid-wicket fence. Jordan is under pressure now. Change! Chris Jordan is back on. 16.6 overs (0 Run) In the end, it is a dot! A full toss, Miller was probably looking to carve it over short third man but misses. That is an outstanding over. 48 needed from 18 now. Rashid will face the first ball of the next over. 16.5 overs (1 Run) Just the one! A slower one on middle, this is swept through square leg for one. What will Miller look for now, will he go for a boundary or will he take a run? 16.4 overs (0 Run) A loud appeal but turned down! CHENNAI REVIEW! NOT OUT! It is off the bat! A yorker on middle, Rashid gets his bat down in time and jams it out. Bravo appeals as he feels it is off the pad. It is taken upstairs but Chennai end up losing a review. It is a dot though. 16.3 overs (1 Run) Just short! There should have been a better effort! Dube lost it in the lights! A slower one, on middle, this one holds in the surface. Miller looks to pull, it goes off the top edge, Dube at deep mid-wicket runs in but then stops. Takes it on the bounce, only one. Bravo is not pleased. 16.2 overs (1 Run) Almost drags it on! A slower one outside off, Khan looks to swing across the line, he gets an inside edge, it goes past the off pole and towards fine leg for one. 16.1 overs (1 Run) Miller gets off strike with a run! Just what Chennai wanted! Full and outside off, this is carved to deep point for one. 15.6 overs (1 Run) Wanted two but got only a run! A good comeback by Maheesh Theekshana! Shorter and on middle, this is pulled towards deep mid-wicket. Ravindra Jadeja fumbles, Miller thinks for the second run but is sent back. Never take any chance with Jadeja's bullet arm. 15.5 overs (1 Run) Just the one! Outside off, Khan slaps it through covers for one. 15.4 overs (0 Run) Right in the blockhole. Quick and straight at 103.7 kph, credit to Rashid for keeping it out safely. A dot now! Dots are gold! 15.3 overs (1 Run) Flatter and on off, Miller pushes it to covers for one. 8 from the first three. 15.2 overs (6 Runs) SIX! BANG! That is a nothing delivery! It is short and on middle, asking to be hit. David Miller rocks back and hammers it over the mid-wicket fence for a biggie. 15.1 overs (1 Run) Flatter and shorter but outside off, this is dragged down to long on for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637858329304543466.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"RR vs KKR Head to Head in IPL history: Rajasthan Royals vs Kolkata Knight Riders stats and records 2022 IPL","link":"https://thesportsrush.com/cricket-news-rr-vs-kkr-head-to-head-in-ipl-history-rajasthan-royals-vs-kolkata-knight-riders-stats-and-records-2022-ipl/","keywords":["Cricket","IPL 2022","KKR","Rajasthan Royals","Indian Premier League","Kolkata Knight riders","rajasthan royals","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"RR vs KKR Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 30. The 30th match of the ongoing 15th season of the Indian Premier League will be played between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium tomorrow. In the five… The post RR vs KKR Head to Head in IPL history: Rajasthan Royals vs Kolkata Knight Riders stats and records 2022 IPL appeared first on The SportsRush.","content":"RR vs KKR Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 30. The 30th match of the ongoing 15th season of the Indian Premier League will be played between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium tomorrow. In the five matches that Rajasthan have played this season, they have won three and lost two to be at the fifth position on the points table. Kolkata, on the other hand, are at a position lower on the back of winning and losing three matches each this season. As far as playing at the Cricket Club of India is concerned, Royals will be playing at this iconic venue after seven years. In their four previous matches, they have won and lost a couple of matches each. While Knight Riders have also played four matches (including two this season) here, they are yet to register a victory at the Brabourne Stadium. RR vs KKR Head to Head in IPL history Total number of matches played: 25 Matches won by RR: 11 Matches won by KKR: 13 Matches played in April: 14 (RR 7, KKR 6) Matches played in India: 19 (RR 9, KKR 9) Matches played at Brabourne Stadium: 1 (RR 1, KKR 0) RR average score against KKR: 145 KKR average score against RR: 148 Most runs for RR: 248 (Sanju Samson) Most runs for KKR: 170 (Andre Russell) Most wickets for RR: NA Most wickets for KKR: 11 (Shivam Mavi) Most catches for RR: 6 (Sanju Samson) Most catches for KKR: 4 (Shivam Mavi) The last RR vs KKR contest was an IPL 2021 league match at the Sharjah Cricket Stadium. Chasing a 172-run target, RR were bundled out for 85 in 16.1 overs as KKR registered an 86-run victory. – @rajasthanroyals @y_umesh @prasidh43 #KKRHaiTaiyaar #RRvKKR #IPL2022 pic.twitter.com/5Z4vMUgNk4 — KolkataKnightRiders (@KKRiders) April 17, 2022 NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post RR vs KKR Head to Head in IPL history: Rajasthan Royals vs Kolkata Knight Riders stats and records 2022 IPL appeared first on The SportsRush.","pubDate":"2022-04-17 17:17:34","full_description":"RR vs KKR Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 30. The 30th match of the ongoing 15th season of the Indian Premier League will be played between Rajasthan Royals and Kolkata Knight Riders at the Brabourne Stadium tomorrow. In the five matches that Rajasthan have played this season, they have won three and lost two to be at the fifth position on the points table. Kolkata, on the other hand, are at a position lower on the back of winning and losing three matches each this season. As far as playing at the Cricket Club of India is concerned, Royals will be playing at this iconic venue after seven years. In their four previous matches, they have won and lost a couple of matches each. While Knight Riders have also played four matches (including two this season) here, they are yet to register a victory at the Brabourne Stadium. Total number of matches played: 25 Matches won by RR: 11 Matches won by KKR: 13 Matches played in April: 14 (RR 7, KKR 6) Matches played in India: 19 (RR 9, KKR 9) Matches played at Brabourne Stadium: 1 (RR 1, KKR 0) RR average score against KKR: 145 KKR average score against RR: 148 Most runs for RR: 248 (Sanju Samson) Most runs for KKR: 170 (Andre Russell) Most wickets for RR: NA Most wickets for KKR: 11 (Shivam Mavi) Most catches for RR: 6 (Sanju Samson) Most catches for KKR: 4 (Shivam Mavi) The last RR vs KKR contest was an IPL 2021 league match at the Sharjah Cricket Stadium. Chasing a 172-run target, RR were bundled out for 85 in 16.1 overs as KKR registered an 86-run victory. – @rajasthanroyals @y_umesh @prasidh43 #KKRHaiTaiyaar #RRvKKR #IPL2022 pic.twitter.com/5Z4vMUgNk4 — KolkataKnightRiders (@KKRiders) April 17, 2022 NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Gary Kirsten cricket coach: Gujarat Titans batting coach Gary Kirsten past teams coached list","link":"https://thesportsrush.com/cricket-news-gary-kirsten-cricket-coach-gujarat-titans-batting-coach-gary-kirsten-past-teams-coached-list/","keywords":["Cricket","Gujarat Titans","IPL 2022","Gary Kirsten"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Gary Kirsten cricket coach: Former Indian cricket team coach is working with the Gujarat Titans in IPL 2022 along with Ashish Nehra. Gujarat Titans is the all-new team of IPL 2022, and they have started their IPL season with a bang. Ahead of the IPL 2022 auction, Gujarat Titans signed Shubhman Gill, Rashid Khan and… The post Gary Kirsten cricket coach: Gujarat Titans batting coach Gary Kirsten past teams coached list appeared first on The SportsRush.","content":"Gary Kirsten cricket coach: Former Indian cricket team coach is working with the Gujarat Titans in IPL 2022 along with Ashish Nehra. Gujarat Titans is the all-new team of IPL 2022, and they have started their IPL season with a bang. Ahead of the IPL 2022 auction, Gujarat Titans signed Shubhman Gill, Rashid Khan and Hardik Pandya. They also announced a brilliant coaching panel as well. Former Indian pacer Ashish Nehra is the head coach of the side. Former South African batter Gary Kirsten is the batting coach and mentor of Gujarat Titans. India won the ICC World Cup in 2011 under the coaching of Gary Kirsten and Ashish Nehra was a part of that squad. It is interesting to note that both Ashish Nehra and Gary Kirsten have worked together for IPL side Royal Challengers Bangalore as well. Gary Kirsten cricket coach Gary Kirsten is one of the most respected coaches of the current generation. He joined as the coach of the Indian cricket team in 2008 and his tenure lasted till 2011. In 2011, India won their first Cricket World Cup after 28 years under the coaching stint of Gary Kirsten. MS Dhoni called Gary Kirsten “The best thing to happen to Indian cricket.” After winning the world cup with India, Gary Kirsten became the head coach of his national team, South Africa. He took the bold decision of making AB de Villiers the new limited-overs captain of the side replacing Graeme Smith. Due to family reasons, he left the South African coaching job in 2013. #ONTHISDAY The came back home after 28 years #CWC2011 Coach Nehra and Coach @Gary_Kirsten hit the button and relive the memories!#MenInBlue #TeamIndia pic.twitter.com/UgPEYZxwEV — Gujarat Titans (@gujarat_titans) April 2, 2022 After a spell of almost four years, Gary Kirsten took a job with the BBL side Hobart Hurricanes for the BBL 2017-18 season. Under his tenure, Hobart Hurricanes played brilliantly and qualified for the final of the tournament. Adelaide Strikers defeated Hobart Hurricanes in the final game. Gary Kirsten worked with Royal Challengers Bangalore from 2017 to 2019. He is currently the batting coach of IPL 2022 side Gujarat Titans, who have been brilliant in the Indian Premier League so far. The post Gary Kirsten cricket coach: Gujarat Titans batting coach Gary Kirsten past teams coached list appeared first on The SportsRush.","pubDate":"2022-04-17 17:15:17","full_description":"Gary Kirsten cricket coach: Former Indian cricket team coach is working with the Gujarat Titans in IPL 2022 along with Ashish Nehra. Gujarat Titans is the all-new team of IPL 2022, and they have started their IPL season with a bang. Ahead of the IPL 2022 auction, Gujarat Titans signed Shubhman Gill, Rashid Khan and Hardik Pandya. They also announced a brilliant coaching panel as well. Former Indian pacer Ashish Nehra is the head coach of the side. Former South African batter Gary Kirsten is the batting coach and mentor of Gujarat Titans. India won the ICC World Cup in 2011 under the coaching of Gary Kirsten and Ashish Nehra was a part of that squad. It is interesting to note that both Ashish Nehra and Gary Kirsten have worked together for IPL side Royal Challengers Bangalore as well. Gary Kirsten is one of the most respected coaches of the current generation. He joined as the coach of the Indian cricket team in 2008 and his tenure lasted till 2011. In 2011, India won their first Cricket World Cup after 28 years under the coaching stint of Gary Kirsten. MS Dhoni called Gary Kirsten “The best thing to happen to Indian cricket.” After winning the world cup with India, Gary Kirsten became the head coach of his national team, South Africa. He took the bold decision of making AB de Villiers the new limited-overs captain of the side replacing Graeme Smith. Due to family reasons, he left the South African coaching job in 2013. #ONTHISDAY The 🏆 came back home after 28 years #CWC2011 ▶️ Coach Nehra and Coach @Gary_Kirsten hit the ⏪ button and relive the memories! #MenInBlue #TeamIndia pic.twitter.com/UgPEYZxwEV — Gujarat Titans (@gujarat_titans) April 2, 2022 After a spell of almost four years, Gary Kirsten took a job with the BBL side Hobart Hurricanes for the BBL 2017-18 season. Under his tenure, Hobart Hurricanes played brilliantly and qualified for the final of the tournament. Adelaide Strikers defeated Hobart Hurricanes in the final game. Gary Kirsten worked with Royal Challengers Bangalore from 2017 to 2019. He is currently the batting coach of IPL 2022 side Gujarat Titans, who have been brilliant in the Indian Premier League so far.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Chennai Super Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-chennai-super-kings-live-score-over-match-29-t20-11-15-updates-2896063","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Chennai Super Kings from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-17 17:04:09","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.0 overs, Gujarat Titans, chasing a target of 170, are 108/5. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Gujarat Titans and Chennai Super Kings. Everything related to Gujarat Titans and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Gujarat Titans vs Chennai Super Kings live score. Do check for Gujarat Titans vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (0 Run) Beaten again! Even slower than the last one. On a length and wide outside off, Miller chases and misses. Bravo smiles. 9 from the over! 14.5 overs (0 Run) Good comeback from DJ! Mixes his pace and length again. Delivers it outside off, Miller is early into his shot and misses. 14.4 overs (6 Runs) SIX! What a shot! Miller targets the bigger side of the ground and clears the fence with ease. That's the power of this man. Full and outside off, David Miller latches onto it and thwacks it over cover-point. 14.3 overs (1 Run) Very full and around off, Rashid hits it firmly back towards the bowler who only makes a half stop. It rolls behind to mid off and they cross as Bravo chases it down. 14.2 overs (1 Run) Aerial but safe! Slower again, full and wide outside off, Miller mistimes his aerial shot and it lands safely towards wide long off. They cross. 14.1 overs (1 Run) Slower length ball on off, Rashid turns it in front of square leg and picks up a single. 13.6 overs (4 Runs) FOUR! Finds the gap! Jordan goes very full and around off, Miller hangs on the back foot and bludgeons it through the line. It finds the gap between long off and sweeper cover. 71 needed off 36 balls after a 12-run over. 13.5 overs (1 Run) Slightly short and on off, Rashid drags his pull to deep mid-wicket for one. 13.4 overs (1 Run) Slower one, short and on middle, Miller goes back and powers his pull shot towards the cow corner region. Jadeja has stationed himself there and stops the ball cleanly. Only a run. 13.3 overs (1 Run) Another full toss, around off, Rashid pushes it to sweeper cover and rotates the strike. That's all he needs to do. 77 needed off 39 balls. 13.2 overs (1 Run) A low full toss outside off, Miller drills his drive towards extra cover where Moeen makes a fine diving stop. They cross for a run. 13.1 overs (4 Runs) FOUR! Shot! Miller will continue with his counter-attack and that's the right thing to do also. Short in length, around middle, Miller camps back and hammers it to the wide long on boundary. Change! Chris Jordan is back into the attack. He has three overs left. 12.6 overs (0 Run) WICKET MAIDEN! On a length and outside off, Khan drives but finds the cover fielder. 12.5 overs (0 Run) Short and around off, Rashid tries to pull but misses. Rashid Khan walks out to bat! 12.4 overs (0 Run) OUT! CAUGHT! So the strategy pays off. Three dots to create the pressure and Rahul Tewatia tries to cut loose but loses his wicket. Clever bowling from Bravo. Dishes out his traditional slower one and lands it full around off. Rahul Tewatia aims for a big shot down the ground but gets it away from the bottom half of his blade. It towers up in the night sky and Ravindra Jadeja moves across to his left from mid off to take a simple catch. 83 needed off 44 balls! 12.3 overs (0 Run) Three dots now! Rahul will be feeling the pressure now. DJ takes it away from the left-hander, a clever cutter, Rahul Tewatia pushes at it and misses. 12.2 overs (0 Run) Another short one, wide outside off, Tewatia throws his bat at it and it goes off the toe end to extra cover. 12.1 overs (0 Run) Play and a miss! Bravo begins with a short delivery, slower in pace and wide outside off, Rahul Tewatia chases and misses. Change! Dwayne Bravo is on! 11.6 overs (1 Run) Fires it flat on the pads, it's nudged to mid-wicket for a run. 19 from the over and this chase is alive and kicking. 83 needed off 48 balls. 11.5 overs (1 Run) Short and outside off, cut through cover-point for one. 11.4 overs (4 Runs) FOUR! Bang! Miller is on fire, brings up his fifty off just 28 balls. Full and floated outside off, David Miller latches onto the width and rifles it through covers. 11.3 overs (6 Runs) SIX! Boom! Quicker through the air, full and around off, Miller kneels down and plays a rocketing slog-sweep over the deep mid-wicket fence. 11.2 overs (6 Runs) SIX! In the arc again and it's out of the park. Fuller and flatter, around middle, Miller picks it up and dispatches it over wide long on for a biggie. Chennai can't afford to relax till the time he is there! 11.1 overs (1 Run) Flighted and on off, Rahul Tewatia pushes it gently to point and collects a single. 10.6 overs (0 Run) Beaten! A little bit of extra bounce there. Around off and skidding away, Miller tries to cut but misses. 10 from the over. 10.5 overs (1 Run) Short and on off, Rahul Tewatia goes back and pulls it to deep mid-wicket for a run. 10.4 overs (1 Run) Moeen comes from over the wicket now! He delivers a flighted ball, a touch short and skidding away from the batter, Miller guides it wide of short third man for a run. 10.3 overs (6 Runs) SIX! In the arc and dismissed! Very full and on off, David Miller gives it the full whack of his bat and towers it over the bowler's head for a maximum. 8000 runs in T20s for Miller! 10.2 overs (1 Run) Loopy and around off, Rahul Tewatia advances down the track and eases it to covers for a run. 10.1 overs (1 Run) Moeen bowls short and on off, Miller pulls it to deep mid-wicket for a run.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637858316407404704.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, GT vs CSK Live Score: David Miller Fifty Keeps Gujarat Alive But CSK Remove Rahul Tewatia - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiTmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWd0LXZzLWNzay1saXZlLXNjb3JlLXVwZGF0ZXMtMjg5NTQ2M9IBVGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWd0LXZzLWNzay1saXZlLXNjb3JlLXVwZGF0ZXMtMjg5NTQ2My9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, GT vs CSK Live Score: David Miller Fifty Keeps Gujarat Alive But CSK Remove Rahul Tewatia  NDTV SportsGT vs CSK: Revealed - Why Hardik Pandya Is Not Playing For Gujarat Titans Against Chennai Super Kings  Cricket AddictorTata IPL 2022 GT vs CSK Live Cricket Score and Update: Rahul Tewatia departs as Gujarat lose half their side in chase - Firstcricket News  FirstpostGT vs CSK, IPL 2022 stats: Head-to-Head record, players to watch out for, predicted XI  SportstarGT vs CSK Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-17 16:58:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rob Key’s in-tray as new managing director of England men’s cricket","link":"https://uk.sports.yahoo.com/news/rob-key-tray-managing-director-163327801.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-04-17 16:54:21","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Rob Key backed to succeed in bid to ‘shape next great era of English cricket’","link":"https://uk.sports.yahoo.com/news/rob-key-backed-succeed-bid-151337952.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-04-17 16:52:55","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Anshuman Gaekwad son: Is Ruturaj Gaikwad related to Anshuman Gaekwad?","link":"https://thesportsrush.com/cricket-news-anshuman-gaekwad-son-is-ruturaj-gaikwad-related-to-anshuman-gaekwad/","keywords":["Cricket","IPL 2022","Anshuman Gaekwad","Ruturaj Gaikwad"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Anshuman Gaekwad son: Are Chennai Super Kings batter Ruturaj Gaikwad and former Indian player Anshuman Gaekwad related? The rise of Ruturaj Gaikwad has been immense in the IPL. He made his IPL debut in 2020, where he impressed everyone and scored 204 runs at an average of 51.00, courtesy of three half-centuries. Chennai Super Kings… The post Anshuman Gaekwad son: Is Ruturaj Gaikwad related to Anshuman Gaekwad? appeared first on The SportsRush.","content":"Anshuman Gaekwad son: Are Chennai Super Kings batter Ruturaj Gaikwad and former Indian player Anshuman Gaekwad related? The rise of Ruturaj Gaikwad has been immense in the IPL. He made his IPL debut in 2020, where he impressed everyone and scored 204 runs at an average of 51.00, courtesy of three half-centuries. Chennai Super Kings did not do well in IPL 2020, but Ruturaj Gaikwad confirmed his place in the playing eleven. In 2021, Chennai Super Kings made Ruturaj Gaikwad their permanent opener, and the results were clearly visible. Ruturaj finished as the highest run-scorer of the tournament with 635 runs at 45.35, courtesy of four half-centuries and one century. Chennai Super Kings won the title of IPL 2021. Ruturaj Gaikwad had a slow start to IPL 2022, but he proved his class by scoring a brilliant half-century against Gujarat Titans at the MCA Stadium in Pune. Anshuman Gaekwad son Anshuman Gaekwad is a former Indian cricketer whose International career started in 1975 and lasted till 1987. He scored 1985 test runs, courtesy of two centuries and 10 half-centuries. He also scored 269 runs in ODI cricket courtesy of one half-century. Anshuman Gaekwad was impressive with both bat and the ball in FC Cricket. He scored 12136 FC runs, courtesy of 34 centuries and 47 half-centuries. He also scalped 143 wickets in FC cricket with his Offbreak bowling. Gaekwad took around 671 minutes to score his highest test score of 201 runs, which was the slowest double-century at that time. Pune Ka Raj! Rutu Raj! Keep the Whistles coming! #GTvCSK #WhistlePodu #Yellove @Ruutu1331 pic.twitter.com/cuLUQygnxV — Chennai Super Kings (@ChennaiIPL) April 17, 2022 Shatrunjay Gaekwad is the son of Anshuman Gaekwad, who is also a cricketer. Shatrunjay has represented Kolkata Knight Riders in the IPL and Baroda in domestic cricket. He has scored 1015 FC runs and 231 List-A runs. Shatrunjay never represented India at the elite level. Ruturaj Gaikwad is not related to Anshuman Gaekwad at all. Dashrath Gaikwad is Ruturaj’s father and Savita Gaikwad is Ruturaj’s mother. His father is Defense Research Development Officer, whereas his mother is a teacher. The post Anshuman Gaekwad son: Is Ruturaj Gaikwad related to Anshuman Gaekwad? appeared first on The SportsRush.","pubDate":"2022-04-17 16:38:41","full_description":"Anshuman Gaekwad son: Are Chennai Super Kings batter Ruturaj Gaikwad and former Indian player Anshuman Gaekwad related? The rise of Ruturaj Gaikwad has been immense in the IPL. He made his IPL debut in 2020, where he impressed everyone and scored 204 runs at an average of 51.00, courtesy of three half-centuries. Chennai Super Kings did not do well in IPL 2020, but Ruturaj Gaikwad confirmed his place in the playing eleven. In 2021, Chennai Super Kings made Ruturaj Gaikwad their permanent opener, and the results were clearly visible. Ruturaj finished as the highest run-scorer of the tournament with 635 runs at 45.35, courtesy of four half-centuries and one century. Chennai Super Kings won the title of IPL 2021. Ruturaj Gaikwad had a slow start to IPL 2022, but he proved his class by scoring a brilliant half-century against Gujarat Titans at the MCA Stadium in Pune. Anshuman Gaekwad is a former Indian cricketer whose International career started in 1975 and lasted till 1987. He scored 1985 test runs, courtesy of two centuries and 10 half-centuries. He also scored 269 runs in ODI cricket courtesy of one half-century. Anshuman Gaekwad was impressive with both bat and the ball in FC Cricket. He scored 12136 FC runs, courtesy of 34 centuries and 47 half-centuries. He also scalped 143 wickets in FC cricket with his Offbreak bowling. Gaekwad took around 671 minutes to score his highest test score of 201 runs, which was the slowest double-century at that time. Pune Ka Raj! Rutu Raj! Keep the Whistles 🥳 coming! #GTvCSK #WhistlePodu #Yellove 🦁💛 @Ruutu1331 pic.twitter.com/cuLUQygnxV — Chennai Super Kings (@ChennaiIPL) April 17, 2022 Shatrunjay Gaekwad is the son of Anshuman Gaekwad, who is also a cricketer. Shatrunjay has represented Kolkata Knight Riders in the IPL and Baroda in domestic cricket. He has scored 1015 FC runs and 231 List-A runs. Shatrunjay never represented India at the elite level. Ruturaj Gaikwad is not related to Anshuman Gaekwad at all. Dashrath Gaikwad is Ruturaj’s father and Savita Gaikwad is Ruturaj’s mother. His father is Defense Research Development Officer, whereas his mother is a teacher.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Chennai Super Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-chennai-super-kings-live-score-over-match-29-t20-6-10-updates-2896005","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Chennai Super Kings from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-17 16:25:41","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.3 overs, Gujarat Titans, chasing a target of 170, are 66/4. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Gujarat Titans and Chennai Super Kings. Everything related to Gujarat Titans and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Gujarat Titans vs Chennai Super Kings live score. Do check for Gujarat Titans vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (1 Run) Just the one to end! On off, flatter, this is pushed to cover. Another superb over from Jadeja. 9.5 overs (0 Run) Really good from Jadeja, despite bowling to two left-handers he is making it difficult for them to hit! Outside off, flatter, Miller looks to cut but it goes off the under-edge to short third man. 9.4 overs (1 Run) Just the one! Fuller and on middle, this is pushed down to long on for one. 9.3 overs (0 Run) Fired on the pads again, Rahul flicks it to mid-wicket. 9.2 overs (0 Run) On the pads, Rahul Tewatia looks to flick but misses to get hit on the pads. 9.1 overs (1 Run) On the pads, this is worked through square leg for one. Strategic break. Chennai are all over Gujarat like a rash. They have removed the cream of the Gujarat batting and are ruling the roost. The last recognized batters are in the middle and they will have to form a partnership and also take care of the asking rate which is hovering close to 11 now. Will we get to see the Killer Miller? Will Tewatia do a Tewatia again? Exciting times ahead. 8.6 overs (1 Run) Takes one now! On middle, this is pushed down to long on for one. 8.5 overs (4 Runs) FOUR! Whacked! Miller makes room and Moeen goes fuller, this ends up being right in the slot, Miller smashes it to the long on fence. Really good shot and not an easy one on this surface. Miller needs to continue to attack. 8.4 overs (1 Run) Flatter and on off, Rahul pushes it down to long off for one. 8.3 overs (0 Run) Another one, nice and slow, and on off, defended. 8.2 overs (0 Run) Nicely bowled! Slows it up and tosses it up on off, this is blocked. 8.1 overs (1 Run) Slower through the air and on off, Miller goes back and pushes it through covers for one. Rahul Tewatia arrives very early in the middle. Also, Moeen Ali comes into the attack with two left-handers in the middle. 7.6 overs (0 Run) OUT! TAKEN! Saha departs. He needed to try something, he needed to get a few boundaries but falls in the attempt. This wicket though could well be a blessing in disguise for Gujarat. Not the best of deliveries from Jadeja, it is short and on the body, Saha pulls but does so straight to deep square leg. Ruturaj Gaikwad takes the catch safely. Gujarat slip further. 122 needed in 72 balls. 7.5 overs (1 Run) Just the one! Fires it on off, this one holds a bit on the surface. Miller pushes it to covers. 7.4 overs (0 Run) Probably tried to hit that way too hard! Shorter and on leg, Miller rocks back and looks to pull, he gets an inside edge onto the pads. 7.3 overs (0 Run) Well bowled! Sees Miller coming down the track and shortens the length. Miller looks to flick but misses to get hit on the pads. 7.2 overs (1 Run) A slight misfield! Flatter and on off, Saha comes down the track and pushes it towards covers. Shivam Dube dives over the ball and a run is taken. 7.1 overs (1 Run) Fires it on the pads, Miller works it through square leg for one. 6.6 overs (1 Run) The extra ball does not cost a lot! This is full and outside off, Miller looks to hit it hard through covers but he gets an under edge. The ball drops near the popping crease and they steal a quick single. Maheesh Theekshana is replaced in the attack by Ravindra Jadeja. 6.6 overs (1 Run) WIDE! The bowler did not like the call! This is full and wide outside off. Left alone. Wided. Probably the right call. 6.5 overs (4 Runs) FOUR! Finds the gap! This is full and on the pads, poor delivery, easy pickings for Miller who flicks it through backward square leg and this one races away to the fence. 6.4 overs (0 Run) A yorker, on middle, Miller works it to mid-wicket. A dot. 6.3 overs (1 Run) Good length and around off, Saha waits and then guides it down to third man for one. 6.2 overs (0 Run) On middle, defended. Saha also needs to get a move on here. 6.1 overs (1 Run) A short one and on the body, this is pulled through square leg for one. Change in bowling. Mukesh Choudhary is back into the attack. 1/10 in his 2 overs so far. 5.6 overs (1 Run) A single to end the Powerplay and Chennai are on top after it. Gujarat are 37 for 3. On off, Miller looks to push it on the off side, this goes off the inner half towards short fine leg for one. 5.5 overs (4 Runs) FOUR! That's uppish but was hit like a rocket! On middle, fuller, Miller smashes it back towards the bowler. Maheesh Theekshana stretches his hands up but it sneaks through and races behind to find the fence. 5.4 overs (1 Run) On off, this is pushed towards cover for one. 5.3 overs (4 Runs) FOUR BYES! How has that missed the off pole? Dhoni can't believe it too! This lands around off and just holds its line. Wriddhiman Saha looks to sweep but misses. It goes just past the off pole and between the legs of Dhoni and to the fence behind. Gujarat won't mind how they come as long as they come. 5.2 overs (1 Run) Slightly shorter and on middle, Miller pulls it through mid-wicket for one. 5.1 overs (1 Run) On middle, this is worked through square leg for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637858293331307026.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Chennai Super Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-chennai-super-kings-live-score-over-match-29-t20-1-5-updates-2895956","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Chennai Super Kings from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-17 16:16:05","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.3 overs, Gujarat Titans, chasing a target of 170, are 31/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Gujarat Titans and Chennai Super Kings. Everything related to Gujarat Titans and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Gujarat Titans vs Chennai Super Kings live score. Do check for Gujarat Titans vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (0 Run) Fuller and on off, Miller drives but finds the extra cover fielder. 9 from Jordan's first. 4.5 overs (4 Runs) FOUR! Deft from Miller! Short in length and outside off, David Miller plays late and close to his body as he runs it fine down to third man for a boundary. 4.4 overs (1 Run) Drifting down the leg side, Saha fails to flick and it goes off his pads to the keeper. Dhoni fails to make a neat collection and they cross for a leg bye. 4.3 overs (2 Runs) Short in length and on middle, Saha pulls it to deep mid-wicket. Moeen rushes across to his left in the deep and picks up the ball. The batters get two. 4.2 overs (1 Run) Back of a length, around off, Miller wrists it towards square leg for a run. 4.1 overs (1 Run) Short in length and around off, Saha taps it down beside the surface on the off side and steals a quick run. Jordan is down on the pitch in his followthrough. Change! Chris Jordan comes on now. 3.6 overs (0 Run) What a delivery! Nearly sneaked through. Flatter and shorter on middle, Miller goes back to cut but there is no room to work with. He somehow brings his bat down in time to keep it out safely. 2 runs and a wicket from the over! David Miller walks out to bat! He has a big role to play here. Can he deliver? He did find some form in the last game. 3.5 overs (0 Run) OUT! TAKEN! Maheesh Theekshana has two now. Floated delivery, full and close to off, Abhinav Manohar attempts for an inside-out shot but gets too close to the line of the delivery. He ends up chipping an easy catch for Moeen Ali at covers. Gujarat are in a big spot of bother now. 154 needed off 97 balls. 3.4 overs (0 Run) Quicker and flatter on off, blocked to the off side. 3.3 overs (1 Run) Loopy and full outside off, Saha sweeps it to deep mid-wicket for a single. 3.2 overs (1 Run) Very full in length on middle, Abhinav Manohar goes hard at it and bottom-edges his shot towards mid on. They cross. 3.1 overs (0 Run) Flighted and on off, defended from the back foot to point. 2.6 overs (1 Run) Fractionally short and on off, angling away, Manohar stays back and runs it down to deep backward point for a run. 9 from the over! 2.5 overs (0 Run) Again there is width outside off, Manohar chases and hits firmly through the line but finds the fielder at cover-point. 2.4 overs (4 Runs) FOUR! In control this time. Slightly short in length and outside off, Manohar rocks back and slaps it over point for a boundary. 2.3 overs (0 Run) Back of a length, on off, Manohar defends it from the back foot. 2.2 overs (0 Run) Width there outside off, short in length, Abhinav Manohar tries to cut but misses. 2.1 overs (4 Runs) FOUR! Aerial but through the gap! Fuller in length and outside off, Abhinav Manohar slices his attempted drive past the point fielder for a boundary. Flirting with danger! 1.6 overs (1 Run) Once again the line is straight and Manohar eases it to mid-wicket for a single. Top over from Maheesh Theekshana! 1.5 overs (1 Run) Flighted and on middle, Saha this time works it to mid-wicket for one. 1.4 overs (1 Run) Flatter delivery, around middle, Abhinav Manohar helps it towards mid-wicket for a run. Abhinav Manohar walks out to bat! 1.3 overs (0 Run) OUT! CAUGHT BEHIND! This is a perfect start for the defending champions. Vijay Shankar also falls for a duck. Maheesh Theekshana delivers it short and wide outside off, at 101.9 kph, Shankar decides to chase it and cut it through the line but gets a thick outside edge to Dhoni. He is not dropping those. The finger is up and the crowd is roaring. 1.2 overs (0 Run) Tossed up, around off, not giving room, Shankar defends it back from the crease. 1.1 overs (1 Run) Flighted and full, around middle, Saha knocks it down to mid on and takes a quick run. Vijay Shankar walks out to bat now! Also, spin from the other end as the ball is given to Maheesh Theekshana! 0.6 over (0 Run) OUT! CAUGHT! Gill departs for a golden duck and this is a big breakthrough for Chennai. Short in length and outside off at 133.3 kph, Shubman Gill takes a step down the ground and slashes his blade through the line. He hits it aerially but without much elevation and Robin Uthappa takes an easy catch over his head at cover-point. A terrific first over from Mukesh Choudhary, he mixed his lengths superbly. 0.5 over (1 Run) Pitches it up and outside off, Saha drives it from the inside half of his bat and it rolls tamely down the ground. The mid off fielder cuts it off and they cross for a run. Gujarat are away! 0.4 over (0 Run) Shortish this time, around off, Saha plays a mistimed punch to covers. 0.3 over (0 Run) Chases and misses! The natural variation of Mukesh Choudhary. He serves it full and outside off. His natural angle takes it away from the batter. Saha flashes his bat at it but misses. 0.2 over (0 Run) Lands it on a length and close to off, lovely shape again, Wriddhiman Saha gets forward and defends it with a straight blade. 0.1 over (0 Run) Great start! Bit of shape back in along with some extra bounce. It's around off, Saha hops on the back foot and fends it away on the off side.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637858287575473412.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, GT vs CSK Live Score: Ruturaj Gaikwad Returns To Form, CSK Set 170-Run Target For Gujarat Titans - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiTmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWd0LXZzLWNzay1saXZlLXNjb3JlLXVwZGF0ZXMtMjg5NTQ2M9IBY2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWd0LXZzLWNzay1saXZlLXNjb3JlLXVwZGF0ZXMtMjg5NTQ2Mz9hbXA9MSZha2FtYWktcnVtPW9mZg?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, GT vs CSK Live Score: Ruturaj Gaikwad Returns To Form, CSK Set 170-Run Target For Gujarat Titans  NDTV SportsGT vs CSK Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorGT vs CSK, IPL 2022 stats: Head-to-Head record, players to watch out for, predicted XI  SportstarGT vs CSK: Ambati Rayudu becomes 10th Indian to reach 4000-run mark in Indian Premier League  India TodayGT vs CSK: Revealed - Why Hardik Pandya Is Not Playing For Gujarat Titans Against Chennai Super Kings  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-17 15:50:16","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"England name former Kent captain Key as managing director","link":"https://www.kentonline.co.uk/canterbury/sport/england-name-former-kent-captain-key-as-managing-director-265723/","keywords":null,"creator":["mpanting@thekmgroup.co.uk (Matthew Panting)"],"video_url":null,"description":"Former Kent captain Rob Key has been appointed as the new managing director of England Men&#39;s cricket.","content":null,"pubDate":"2022-04-17 15:37:00","full_description":"Former Kent captain Rob Key has been appointed as the new managing director of England Men's cricket. The 42-year-old, who retired from playing six years ago, takes over the role with immediate effect. It means Key will give up his work with Sky Sports, having carved out a successful media career in recent years. Key will be responsible for the strategy behind the England Men’s cricket teams and the performance pathways leading into them. He will also take a key role as part of the High Performance Review which will begin shortly. His first task will be to help appoint a new head coach and captain, after the depature of Joe Root earlier this week. Key said: “It is an absolute honour to take up this role. \"The chance to have an impact and make a difference is an opportunity given to very few and I will give it everything I have to try shape the next great era of English Men’s cricket. “I have absolutely loved my time at Sky and I could never have imagined leaving were it not for this incredible opportunity. \"I’d like to personally thank Bryan Henderson and everyone in the team for their help and support. “Although at this current moment it has been a challenging time in English cricket, I also think it’s as exciting a time as I can remember. \"With two of our teams near or at the top of the world rankings and an undoubted amount of talent in our game, I hope to try and bring everyone along for the ride so we can all help take English Men’s cricket to new heights across all formats.” Prior to the appointment, Sir Andrew Strauss had undertaken the role on an interim basis following Ashley Giles’ departure in February after three years. Key played 15 Tests for England and averaged 31.00, his finest honour coming when he scored a double hundred against the West Indies at Lord's in 2004. He captained Kent in two spells, helping the side win the County Championship Division 2 title in 2010 and reach three domestic finals. He was also part of the England side who won the Under-19 World Cup for the first and only time in 1998. Key has remained involved in the administration side of the game and has previously sat on the ECB’s Performance Cricket Committee. ECB chief executive officer Tom Harrison said: “Following a thorough recruitment process, Rob stood out in a very competitive field. \"His passion and knowledge of the game at domestic and international level is outstanding. \"He is a proven leader and combines an approachable nature with fresh, original thinking and resilience which will stand him in good stead. \"He will bring a lot to the role and I am sure players and staff alike will enjoy working with Rob. I have no doubt he will relish the challenge before us.”","image_url":"https://www.kentonline.co.uk/_media/img/330x0/743LJV8F7U3KRX5GDP31.jpg","source_id":"kentonline","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Chennai Super Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-chennai-super-kings-live-score-over-match-29-t20-16-20-updates-2895860","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Chennai Super Kings from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-17 15:25:45","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 19.4 overs, Chennai Super Kings are 162/4. The live updates of Gujarat Titans vs Chennai Super Kings scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Gujarat Titans vs Chennai Super Kings, Gujarat Titans vs Chennai Super Kings live score, Gujarat Titans vs Chennai Super Kings scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 19.2 overs (0 Run) No run. 19.1 overs (4 Runs) Four! Lockie Ferguson to bowl the final over. 18.6 overs (1 Run) Another run! On middle, Dube pulls it through mid-wicket and gets to the other end. No boundaries in the 19th over. Just what Gujarat wanted. 18.5 overs (1 Run) The googly now, it lands on off and then spins away. This is guided to point for one. 18.4 overs (2 Runs) Two more! Tossed up on middle, Jadeja plays the slog sweep, he finds the gap in the mid-wicket region and takes two. 18.3 overs (1 Run) Just the single again! On middle, this is hit down to long on for one more. 18.2 overs (1 Run) Just the one! The slog sweep is out, it goes off the inner half through deep square leg for one. 18.1 overs (0 Run) The finger is raised as there is an appeal for an LBW! JADEJA REVIEWS! It seems like there is bat involved. NOT OUT! INDEED THERE IS! Jadeja was pretty sure and hence, reviewed straightaway. Another successful review by Chennai! Rashid bowls this on off and this one turns back in. Jadeja looks to defend, but it goes closely past the inside edge and hits him on the flap of the front pad. The ball lobs over the keeper's head. They go for a run as there is an appeal from the bowler. The finger is raised. Jadeja reviews and the UltraEdge shows a spike. Rashid Khan to bowl the penultimate over. 17.6 overs (1 Run) A single to end! 10 from the over then! Not a bad one by Alzarri Joseph! Full and on off, this is hit down to long off for one. 17.5 overs (1 Run) Goes full and wide outside off, Dube carves it towards deep point for one. This is really good bowling, bowling to his field, as they say, making Dube hit towards the longer side. 17.4 overs (4 Runs) FOUR! Finally, a boundary for Dube and Chennai! A welcome one. This one is short and angling away from middle, Dube manages to drag it, it is not off the middle of the bat but in the gap for a boundary in the wide long on region. 17.3 overs (1 Run) Just the single again! Fuller and on off, Jadeja hits it down to long off for one. 17.2 overs (1 Run) Misfield and one! Fuller and outside off, this is hit hard towards cover. Gill misfields and a run is taken. 17.1 overs (2 Runs) Not timed that well! A slower one on middle, Dube drags it wide of long on for two. Alzarri Joseph to bowl out. 3-0-24-2 are his figures so far on debut for Gujarat. 16.6 overs (1 Run) Just the one again! Shorter and on middle, Dube pulls it through mid-wicket for a single. Only 6 from the over! 16.5 overs (1 Run) A quick run! Boundaries are hard to come by! Singles won't really harm Gujarat! A full one on off, this is pushed to mid off for one. 16.4 overs (2 Runs) Two more! Shorter and on middle, Jadeja gets on top of the bounce and pulls it hard through mid-wicket for two. He is off the mark. 16.3 overs (0 Run) A good short ball to welcome Jadeja! He evades it. Ravindra Jadeja arrives. 16.2 overs (0 Run) OUT! TAKEN! Very unfortunate for Ruturaj Gaikwad, he had hit that really well! A low full toss on middle, Ruturaj Gaikwad goes down on one knee and plays the sweep shot towards deep square leg. Abhinav Manohar is stationed there and he takes an easy catch. A really good inning and a much-needed one for Ruturaj Gaikwad and Chennai. He though has fallen at the wrong time. Two new batters out there with just over 3 overs to go. 16.1 overs (2 Runs) Really good cricket all around! A yorker outside off, Ruturaj Gaikwad jams it out towards deep point and takes two. Change! Yash Dayal to bowl out now. 15.6 overs (1 Run) A single now! A yorker to end, on middle, this is jammed down to long on for one. End of a really good over and a brilliant spell from Shami. 15.5 overs (1 Run) This is amazing stuff! A low full toss, not easy to hit, it goes more off the inner half through mid-wicket for one. 15.4 overs (0 Run) A huge appeal for an LBW and the finger is raised! Dube reviews after a chat with his partner! NOT OUT! ULTRA EDGE SHOWS A SPIKE! That comes as a surprise. Dube was walking off when he saw the first replay. Have to call him lucky here. This looked dead. It is a full ball on middle, Dube looks to go downtown but misses and is struck on the back leg. A huge appeal and the finger is raised. A successful review from Dube. He survives to fight another day. 15.3 overs (1 Run) Just the one again! Fuller and on off, Ruturaj Gaikwad makes room and chips it towards long off for one. 15.2 overs (1 Run) Just the single! On a length and around off, this is pushed towards covers for one. 15.1 overs (0 Run) BEATEN! That is a beauty! Length and on off, this lands and moves away. Dube is beaten as he tries to push at it.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637858257366171622.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"DC v RCB: Parody Press Conference | IPL 2022 - Royal Challengers Bangalore","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9bzl4SDZ2X3ZmRGfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"DC v RCB: Parody Press Conference | IPL 2022  Royal Challengers BangaloreThe season of Dinesh Karthik reaches a fever pitch | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022: Veda Krishnamurthy Wrote A Beautiful Tweet For Dinesh Karthik  The Cricket LoungeIndia return on mind, Karthik continues to sizzle for Bangalore  Reuters.com‘Bigger goals’ as IPL star Karthik targets India return  Gulf NewsView Full coverage on Google News","content":null,"pubDate":"2022-04-17 15:00:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Chennai Super Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-chennai-super-kings-live-score-over-match-29-t20-11-15-updates-2895777","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Chennai Super Kings from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-17 14:57:58","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 14.0 overs, Chennai Super Kings are 124/2. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Gujarat Titans and Chennai Super Kings. Everything related to Gujarat Titans and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Gujarat Titans vs Chennai Super Kings live score. Do check for Gujarat Titans vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. Change! 13.6 overs (0 Run) Skidding down the leg side, Ruturaj Gaikwad tries to sweep but misses. It hits his pads and rolls back to the bowler. 11 from this over! 13.5 overs (1 Run) Around middle and leg, it's eased away to deep mid-wicket for another single. They have got a biggie in the over and taking no unnecessary risk against Rashid. 13.4 overs (1 Run) Wrong 'un, short and on off, Gaikwad moves back and punches it to sweeper cover for one. 13.3 overs (1 Run) Quicker through the air, around middle and leg, Rayudu helps it to square leg and rotates the strike. 13.2 overs (6 Runs) SIX! Boom! Rashid Khan drops it short and on middle, Ambati Rayudu goes deep inside the crease and pulls it emphatically over mid-wicket for a maximum. 13.1 overs (2 Runs) Quicker and on middle, it's tucked to square leg for a couple of runs. Change! Rashid Khan is back now. The skipper has got himself into the attack and he needs to lead from the front. 12.6 overs (4 Runs) FOUR! Boundaries are coming thick and fast for Chennai. Full toss around middle and leg, at 148 kph, Ruturaj Gaikwad stays leg-side of this delivery and lofts it over mid off. Rashid gives the chase but comes second. 13 from the over, 47 in the last three. 12.5 overs (6 Runs) SIX! Into the crowd! Shortish and on middle, following the batter, Ruturaj Gaikwad clears his front leg and heaves it over mid-wicket for a biggie. 12.4 overs (1 Run) JUST SHORT! Short in length and outside off, Ambati Rayudu tries to whack it but it comes from the upper half of his bat and loop towards mid off. Rashid Khan tries his best to catch it but the ball drops in front of him. They cross. 12.3 overs (0 Run) Rayudu breaks his bat! Lockie Ferguson spears in an inswinging yorker around off, Ambati Rayudu tries to drive but it takes the bottom edge and a chunk of wood comes off his blade. 12.2 overs (1 Run) Misses the yorker this time and it's a full toss on off, Ruturaj Gaikwad pushes it down to long on for a run. 12.1 overs (1 Run) A yorker on middle, Rayudu digs it out and eases it away to deep mid-wicket for a run. Lockie Ferguson is back on now! His side needs a wicket from him here. Can he get it for them? 11.6 overs (1 Run) A length ball, around middle, Rayudu runs down the track and hits it to deep cover for a run. 19 from the over and 100 comes up for Chennai! 11.5 overs (4 Runs) FOUR! Clever from Ambati Rayudu! Short in length, around off and angling away at 131.6 kph, Rayudu sits back calmly inside the crease and ramps it over short third man for a boundary. 11.4 overs (1 Run) Uses his wrists and flicks a length ball to deep mid-wicket for a run. 11.3 overs (6 Runs) SIX! Ruturaj Gaikwad takes maximum toll. Slower one, short and around off, Gaikwad sits back and across inside the crease, picks his spot and thwacks it over square leg. 11.3 overs (2 Runs) Fuller and around leg, it's worked to deep square leg for a run. The siren goes off and it's a no ball for overstepping. Free Hit coming... 11.2 overs (4 Runs) FOUR! Cracked away! A touch short in length around leg, Rayudu gives himself room with his fancy footwork and crunches it through covers. Abhinav Manohar moves across to his right in the deep, puts in a slide but fails to make a clean stop. 11.1 overs (1 Run) FIFTY FOR GAIKWAD! He is back in form with this knock. Fuller in length around leg, Ruturaj clips it off his pads through mid-wicket for a run. The 50-run stand comes up as well. Yash Dayal is back into the attack! 2-0-15-0 for him so far. 10.6 overs (1 Run) Delivers it on a length around off, Ruturaj Gaikwad strides forward and pushes it with soft hands to cover-point. Another single is taken, 15 from the over! 10.5 overs (1 Run) On a length and around off, Rayudu drives it on the up and finds the gap at cover-point. Picks up a single. 10.4 overs (6 Runs) SIX! Connects and connects handsomely on this occasion! Alzarri Joseph delivers it on a good length around off, at 143.9 kph, Ambati Rayudu gives himself room as he dances down the track and then powers it over long off. 10.3 overs (0 Run) Big swing and a miss! This one is served close to 145 kph, around off and on a length, Ambati Rayudu stays back to heave it over the leg side but fails to connect. 10.2 overs (1 Run) Shortish again, this time it's around off, Ruturaj Gaikwad tries to run it down but only manages to chop it down in front of the keeper. They steal a single. 10.1 overs (6 Runs) SIX! Ruturaj is finding his range and announcing his arrival to form. Back of a length, around middle and leg, Ruturaj Gaikwad swings his bat across the line and dismisses it over square leg for a maximum.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637858240694321471.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, GT vs CSK Live Score Updates: Ruturaj Gaikwad Hits Fifty As CSK Look To Accelerate vs Gujarat | Cricket News - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiTmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWd0LXZzLWNzay1saXZlLXNjb3JlLXVwZGF0ZXMtMjg5NTQ2M9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, GT vs CSK Live Score Updates: Ruturaj Gaikwad Hits Fifty As CSK Look To Accelerate vs Gujarat | Cricket News  NDTV SportsGT vs CSK Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorGT vs CSK, IPL 2022 stats: Head-to-Head record, players to watch out for, predicted XI  SportstarIPL 2022: Match 29, GT vs CSK Match Prediction – Who will win today’s IPL match between GT and CSK?  CricTrackerIPL 2022: 'This Year You'll Have The Chance To Come And Support Us'- Ruturaj Gaikwad Urges Local Support From Pune Ahead Of GT vs CSK Game  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-17 14:42:25","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"PBKS vs SRH - \"Need Him In India Colours ASAP\": Shashi Tharoor's Effusive Praise For Umran Malik | Cricket News - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9wYmtzLXZzLXNyaC1uZWVkLWhpbS1pbi1pbmRpYS1jb2xvdXJzLWFzYXAtc2hhc2hpLXRoYXJvb3JzLWVmZnVzaXZlLXByYWlzZS1mb3ItdW1yYW4tbWFsaWstMjg5NTYyONIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs SRH - \"Need Him In India Colours ASAP\": Shashi Tharoor's Effusive Praise For Umran Malik | Cricket News  NDTV SportsIPL 2022, Punjab Kings vs Sunrisers Hyderabad Highlights: Umran Malik's final-over heroics seal fourth wi  Times of India'Facing Umran in nets is a nightmare. I've got my chest guard to not get hurt'  Hindustan TimesWatch: 4 Wickets And No Run In Dramatic Final Over Bowled By Umran Malik In IPL 2022  NDTV SportsWatching Umran Malik bowl reminded me of the great Waqar Younis: Irfan Pathan  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-04-17 14:38:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"ECB appoint Rob Key as MD of England men's setup","link":"https://www.indiatvnews.com/sports/cricket/england-cricket-board-appoint-rob-key-as-managing-director-of-england-men-s-setup-2022-04-17-770383","keywords":null,"creator":null,"video_url":null,"description":"Former Kent captain, and England batter Rob Key, has been appointed as the new managing director of England's men's setup, the country's cricket board said on Sunday, April 17.","content":null,"pubDate":"2022-04-17 14:37:24","full_description":"Former Kent captain, and England batter Rob Key, has been appointed as the new managing director of England's men's setup, the country's cricket board said on Sunday, April 17. Key, who has made 21 appearances for England and scored over 19,000 first-class runs, was chosen after a rigorous recruitment process. He will take up the role immediately, relinquishing his current role with broadcaster Sky Sports. \"Key will be responsible for the strategy behind the England Men's cricket teams and the performance pathways leading into them. He will also take a key role as part of the High-Performance Review which will shortly begin,\" the England Cricket Board (ECB) said in a press release. Prior to Key's appointment, Andrew Strauss had undertaken the role on an interim basis following Ashley Giles' departure in February after three years. Key played 21 times for England across all three formats including making a Test double hundred against the West Indies at Lord's in 2004 which led to him being named one of the Wisden Cricketers of the Year in 2005. During a playing career that spanned three decades (1998-2015), Key amassed over 28,000 runs with 60 centuries. He captained Kent twice from 2006-2012 and then again from 2014-15. During his time as captain, the side won the County Championship Second Division title in 2010 and reached three white ball domestic finals. He was also part of the England side that won the Under-19 World Cup for the first and only time in 1998. After announcing his retirement in 2016, Key became a successful commentator for Sky Sports alongside writing a regular column for the Evening Standard. He has remained involved in the administration side of the game and has previously sat on the ECB's Performance Cricket Committee. Key said: \"It is an absolute honour to take up this role. The chance to have an impact and make a difference is an opportunity given to very few and I will give it everything I have to try and shape the next great era of English men's cricket. \"I have absolutely loved my time at Sky and I could never have imagined leaving were it not for this incredible opportunity. I'd like to personally thank Bryan Henderson and everyone in the team for their help and support. \"Although at this current moment it has been a challenging time in English cricket, I also think it's as exciting a time as I can remember. \"With two of our teams near or at the top of the world rankings and an undoubted amount of talent in our game, I hope to try and bring everyone along for the ride so we can all help take English men's cricket to new heights across all formats.\" Tom Harrison, ECB Chief Executive Officer said: \"Following a thorough recruitment process, Rob stood out in a very competitive field. His passion and knowledge of the game at the domestic and international level is outstanding. He is a proven leader and combines an approachable nature with fresh original thinking and resilience which will stand him in good stead. \"He will bring a lot to the role and I am sure players and staff alike will enjoy working with Rob. I have no doubt he will relish the challenge before us.\"","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Pujara and Rizwan Sussex: C Pujara scores century on Sussex debut in County Championship 2022","link":"https://thesportsrush.com/cricket-news-pujara-and-rizwan-sussex-c-pujara-scores-century-on-sussex-debut-in-county-championship-2022/","keywords":["Cricket","Cheteshwar Pujara","County Cricket","Mohammad Rizwan","Sussex"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Pujara and Rizwan Sussex: Chesteshwar Pujara scored a brilliant century on his Sussex debut against Derbyshire in County Championship. The County Championship is up and running in England, and Sussex are facing Derbyshire in their County Division-2 game. This is game is getting a lot of attention in South Asia as India’s Cheteshwar Pujara and… The post Pujara and Rizwan Sussex: C Pujara scores century on Sussex debut in County Championship 2022 appeared first on The SportsRush.","content":"Pujara and Rizwan Sussex: Chesteshwar Pujara scored a brilliant century on his Sussex debut against Derbyshire in County Championship. The County Championship is up and running in England, and Sussex are facing Derbyshire in their County Division-2 game. This is game is getting a lot of attention in South Asia as India’s Cheteshwar Pujara and Pakistan’s Mohammad Rizwan are making their Sussex debut. Derbyshire scored 505 runs in the first innings on a batting-friendly track, where Wayne Madsen scored a brilliant century. In return, Sussex were bowled out for just 174 runs in the first innings. Chesteshwar Pujara could score just 6 runs, whereas Mohammad Rizwan scored 22 runs in the first innings. Derbyshire enforced the follow-on on Sussex. Pujara and Rizwan Sussex Sussex batted brilliantly in the 2nd innings, and captain Tom Haynes scored a brilliant double-century for the side. In a beautiful sight for the Indian fans, Cheteshwar Pujara scored a brilliant century on his Sussex debut. Till the time of this article, Cheteshwar Pujara was unbeaten at 151 runs. Both Tom Haines and Chesteshwa Pujara have combined for more than 200 runs. It is a brilliant morale-boosting knock for Chesteshwar Pujara as he is dropped out of the Indian test team, and the Indian team will play a test in England in July 2022. Cheteshwar Pujara has scored 6713 test runs at 43.88 courtesy of 18 centuries and 32 half-centuries. A first Sussex for @cheteshwar1. pic.twitter.com/wrKbNYrXvf — Sussex Cricket (@SussexCCC) April 17, 2022 Sussex is Pujara’s 4th County Club after Derbyshire (2014), Yorkshire (2015 and 2018) and Nottinghamshire (2017). He has been signed as the replacement of Travis Head, who was expected to lead the team this season. Head ruled himself out because of some personal reasons. The pitch is brilliant for batting, and there is a chance that Mohammad Rizwan and Chesteshwar Pujara can bat together in this game. Rizwan also had a rough outing in the first innings, and he would want to make it count in the 2nd innings.     The post Pujara and Rizwan Sussex: C Pujara scores century on Sussex debut in County Championship 2022 appeared first on The SportsRush.","pubDate":"2022-04-17 14:37:01","full_description":"Pujara and Rizwan Sussex: Chesteshwar Pujara scored a brilliant century on his Sussex debut against Derbyshire in County Championship. The County Championship is up and running in England, and Sussex are facing Derbyshire in their County Division-2 game. This is game is getting a lot of attention in South Asia as India’s Cheteshwar Pujara and Pakistan’s Mohammad Rizwan are making their Sussex debut. Derbyshire scored 505 runs in the first innings on a batting-friendly track, where Wayne Madsen scored a brilliant century. In return, Sussex were bowled out for just 174 runs in the first innings. Chesteshwar Pujara could score just 6 runs, whereas Mohammad Rizwan scored 22 runs in the first innings. Derbyshire enforced the follow-on on Sussex. Sussex batted brilliantly in the 2nd innings, and captain Tom Haynes scored a brilliant double-century for the side. In a beautiful sight for the Indian fans, Cheteshwar Pujara scored a brilliant century on his Sussex debut. Till the time of this article, Cheteshwar Pujara was unbeaten at 151 runs. Both Tom Haines and Chesteshwa Pujara have combined for more than 200 runs. It is a brilliant morale-boosting knock for Chesteshwar Pujara as he is dropped out of the Indian test team, and the Indian team will play a test in England in July 2022. Cheteshwar Pujara has scored 6713 test runs at 43.88 courtesy of 18 centuries and 32 half-centuries. A first Sussex 💯 for @cheteshwar1 . 🌟 pic.twitter.com/wrKbNYrXvf — Sussex Cricket (@SussexCCC) April 17, 2022 Sussex is Pujara’s 4th County Club after Derbyshire (2014), Yorkshire (2015 and 2018) and Nottinghamshire (2017). He has been signed as the replacement of Travis Head, who was expected to lead the team this season. Head ruled himself out because of some personal reasons. The pitch is brilliant for batting, and there is a chance that Mohammad Rizwan and Chesteshwar Pujara can bat together in this game. Rizwan also had a rough outing in the first innings, and he would want to make it count in the 2nd innings.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Chennai Super Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-chennai-super-kings-live-score-over-match-29-t20-6-10-updates-2895713","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Chennai Super Kings from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-17 14:35:57","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 8.3 overs, Chennai Super Kings are 54/2. The live updates of Gujarat Titans vs Chennai Super Kings scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Gujarat Titans vs Chennai Super Kings, Gujarat Titans vs Chennai Super Kings live score, Gujarat Titans vs Chennai Super Kings scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 8.2 overs (1 Run) 1 run. 8.1 overs (1 Run) Rayudu takes another run! Fuller and on off, Rayudu pushes it towards mid off and gets to the other end. 7.6 overs (1 Run) Tossed up around leg, Rayudu gets back and drops it with gentle hands in front of square leg. They cross for a run as the leggie attacks the ball. 7.5 overs (0 Run) A loud appeal for a caught behind but turned down! No review taken! The leg spinner, this lands on off and then spins away. Rayudu looks to defend but is beaten. The noise was of the bat hitting the pad. Rashid decides not to review after consulting his keeper. 7.4 overs (1 Run) This one stays a touch low! Shorter and on middle, this is pulled nicely through mid-wicket for another single. 50 is up. 7.3 overs (1 Run) On middle, Rayudu works it through mid-wicket for one more. 7.2 overs (1 Run) Fuller and on middle, Ruturaj Gaikwad works it through mid-wicket for one. 7.1 overs (1 Run) Shorter and on off, Rayudu pushes it through covers and takes one. Skipper Rashid Khan brings himself into the attack. One slip is in place. 6.6 overs (4 Runs) FOUR! That has been smacked! What a hit! Shorter in length and on middle, Ruturaj Gaikwad stays back and hammers the pull over mid-wicket for a boundary. Yet again, the last ball spoils the over. 6.5 overs (0 Run) Another dot! On middle, Ruturaj Gaikwad stays back and defends. 6.4 overs (1 Run) That was a risky run! Luckily for Chennai, Miller did not collect the ball! On a length and around off, this is pushed towards cover and the batters take off. Miller runs in and looks to collect the ball but fails to do so. 6.3 overs (1 Run) Angled into middle, this is worked through square leg for one. 6.2 overs (0 Run) Well bowled! This lands on a length and then moves away. Gaikwad looks to guide it down to third man but is beaten. 6.1 overs (1 Run) Nicely played! Ferguson goes for the yorker first up, it is on the pads, Rayudu works it through square leg for one. Bowling change. Lockie Ferguson to steam in... 5.6 overs (6 Runs) SIX! Into the stands! A biggie to end the Powerplay but a good one for Gujarat! Chennai are 39 for 2 after it. A short one on middle, Gaikwad pulls it hard and over the square leg fence. 5.5 overs (0 Run) Yet another dot! This is a really good start from Alzarri Joseph! Length and on off, this is guided to point. 5.4 overs (0 Run) Angled into middle, Gaikwad stands back and defends it onto the ground. 5.3 overs (1 Run) In the air... safe! The plan was there and it almost came off! A short one on the body with a short leg in place. Rayudu looks to pull, this goes off the splice but lands safely in the square leg region. A single taken. 5.2 overs (0 Run) OUT! TIMBER! Moeen has played it on and Alzarri Joseph does not take long to make an impact on his debut! This is a nothing shot from Moeen Ali and his poor run continues. Length and outside off at 141.3 kph, Moeen goes hard at it as he slashes his bat at it away from the body. This takes the inside edge and then hits the stumps. Alzarri Joseph is elated. Ambati Rayudu walks in next. There is a deepish backward short leg in place. 5.2 overs (1 Run) WIDE! Good carry but this one is way too short, it is outside off. Ali looks to cut but misses. Wided. 5.1 overs (0 Run) Beats the bat first up! Well outside off, on a length. Ali slashes at it but misses.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637858227490105611.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, GT vs CSK Live Score: Chennai lose 2 early wickets as powerplay ends - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiW2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWd0LXZzLWNzay1saXZlLXNjb3JlLXVwZGF0ZXMtNzg3MzM5OS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, GT vs CSK Live Score: Chennai lose 2 early wickets as powerplay ends  The Indian ExpressGT vs CSK Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorGT vs CSK, IPL 2022 stats: Head-to-Head record, players to watch out for, predicted XI  SportstarIPL 2022: Match 29, GT vs CSK Match Prediction – Who will win today’s IPL match between GT and CSK?  CricTrackerIPL 2022: 'This Year You'll Have The Chance To Come And Support Us'- Ruturaj Gaikwad Urges Local Support From Pune Ahead Of GT vs CSK Game  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-17 14:31:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies hero Carlos Brathwaite has car stolen AND out for golden duck on English club cricket debut on shocking day","link":"https://insidexpress.com/sports-athletics/west-indies-hero-carlos-brathwaite-has-car-stolen-and-out-for-golden-duck-on-english-club-cricket-debut-on-shocking-day/","keywords":["Sports & Athletics","Brathwaite","car","Carlos","Club","cricket","day","debut","Duck","English","Golden","hero","Indies","Shocking","stolen","West"],"creator":["The Insidexpress"],"video_url":null,"description":"WEST INDIES hero Carlos Brathwaite had a day to forget on Saturday. The 2016 Twenty20 World Cup-winning all-rounder, 33, made his Birmingham & District Premier League debut for Knowle &… From The Insidexpress, West Indies hero Carlos Brathwaite has car stolen AND out for golden duck on English club cricket debut on shocking day by The Insidexpress.","content":null,"pubDate":"2022-04-17 14:27:25","full_description":"WEST INDIES hero Carlos Brathwaite had a day to forget on Saturday. The 2016 Twenty20 World Cup-winning all-rounder, 33, made his Birmingham & District Premier League debut for Knowle & Dorridge CC at the weekend. West Indies hero Carlos Brathwaite was out for a golden duck and had his car stolen on his English club cricket debut Credit: Getty – Contributor Carlos Brathwaite was out for a golden duck on his English club cricket debut Brathwaite skied a long hop from the opposition spinner as he was caught on his first ball of the first match of the season But Brathwaite endured a disastrous Saturday afternoon on and off the pitch in the first game of the league season. The former Windies star – who last represented his country in 2019 – returned figures of 0/31 from just four overs in his first bowl for six months against Leamington CC. Brathwaite then scooped a long hop into the hands of a fielder from his FIRST BALL in English club cricket, as he was out for a golden duck. The all-rounder later revealed he also had his CAR STOLEN . Reflecting on his bizarre afternoon, Brathwaite tweeted: “What a day yesterday… “First time bowling in a game after injury for six months… “First ball duck from a long hop… “Car stolen…” However, Brathwaite was in remarkably good spirits despite his shocking Saturday. On Easter Sunday morning, he continued: “But you know what, woke up this morning, Sun is shining and giving thanks. “Happy Easter to all.” Brathwaite took to the field for Knowle & Dorridge having signed for the county T20 side Birmingham Bears last year. The club had huge hopes for their overseas pro – even calling themselves ‘The Home of Carlos Brathwaite’ on their social media. But after coming into the attack as fourth-change bowler, Brathwaite failed to show why he was such a huge part of the Windies squad during the 2010s. The all-rounder was knocked around the park as he went at 7.75 runs per over from four wicketless sets of six. Having famously smashed Ben Stokes for four sixes in a row to win the 2016 T20 World Cup final, K&D fans were itching to see Brathwaite with the bat. Chasing just 228 to win from their 50 overs, Brathwaite came in at No5, with the score 76-3. However, the explosive hitter went after Leamington spinner Dinuk da Silva with his first ball. Da Silva threw down a rank long hop, which Brathwaite horribly mis-timed, spooning it up into the air. K&D eventually ended up losing by 12 runs after slipping to 212 all out with just one ball to spare. Publisher 0 0 0 0 Share 0 Tweet 0 Pin it 0 Share 0","image_url":"https://www.thesun.co.uk/wp-content/uploads/2022/04/0c97bf41-7ed0-4b0e-8384-5c63f1b36614.jpg","source_id":"insidexpress","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Hardik Pandya ruled out vs CSK: What happened to Hardik Pandya? Will Hardik Pandya play vs KKR 2022 IPL?","link":"https://thesportsrush.com/cricket-news-hardik-pandya-ruled-out-vs-csk-what-happened-to-hardik-pandya-will-hardik-pandya-play-vs-kkr-2022-ipl/","keywords":["Cricket","Gujarat Titans","IPL 2022","GT vs CSK","Gujarat vs Chennai","Hardik Pandya"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Hardik Pandya ruled out vs CSK: Hardik Pandya has been ruled out of the game against Chennai Super Kings due to a groin injury. Gujarat Titans and Chennai Super Kings are up against each other in the league game of IPL 2022. Gujarat Titans opted to bowl first after winning the toss at the MCA… The post Hardik Pandya ruled out vs CSK: What happened to Hardik Pandya? Will Hardik Pandya play vs KKR 2022 IPL? appeared first on The SportsRush.","content":"Hardik Pandya ruled out vs CSK: Hardik Pandya has been ruled out of the game against Chennai Super Kings due to a groin injury. Gujarat Titans and Chennai Super Kings are up against each other in the league game of IPL 2022. Gujarat Titans opted to bowl first after winning the toss at the MCA Stadium in Pune. Chennai Super Kings were unchanged, whereas Gujarat Titans were forced to make some unwanted changes. Hardik Pandya and Matthew Wade were replaced my Wriddhiman Saha and Alzarri Joseph in the playing eleven. Hardik Pandya ruled out vs CSK When Rashid Khan came out at the toss for Gujarat Titans, it was a surprising sight for the cricket fans. Hardik Pandya has been in brilliant form for the Gujarat Titans, but Rashid Khan confirmed that Hardik Pandya has been ruled out due to a groin injury. “Bit of stiffness in the groin area for Hardik, so as a team we didn’t want to take a chance. He will rest and hopefully be back for the next game. Super excited, it’s kind of a dream,” Rashid Khan said at the toss. Match 29 Toss Update@gujarat_titans have won the toss and elect to bowl first against #CSK. Rashid Khan to the lead the side in the absence of Hardik Pandya.#TATAIPL pic.twitter.com/MXo3PQBGJ1 — IndianPremierLeague (@IPL) April 17, 2022 Hardik Pandya has been a wall for Gujarat Titans in the IPL 2022. He has been batting brilliantly, whereas his bowling has also been great this season. Hardik has scored 228 runs in IPL 2022 at 76.00, whereas he has scalped four wickets in bowling as well. He has smashed a couple of half-centuries in the tournament. Hardik Pandya got injured while bowling against Rajasthan Royals in the last game. He could only bowl 3 balls of his 3rd over, and then he felt pain. Vijay Shankar completed the over of Hardik Pandya. Although, Hardik was adjudged the Man of the Match for his 52 balls 87 runs knock and he also got one wicket in bowling. Rashid Khan has said that Hardik can be back for the next game as it is just stiffness. The return of Hardik Pandya will certainly impact the run of Gujarat Titans in IPL 2022. The post Hardik Pandya ruled out vs CSK: What happened to Hardik Pandya? Will Hardik Pandya play vs KKR 2022 IPL? appeared first on The SportsRush.","pubDate":"2022-04-17 14:22:07","full_description":"Hardik Pandya ruled out vs CSK: Hardik Pandya has been ruled out of the game against Chennai Super Kings due to a groin injury. Gujarat Titans and Chennai Super Kings are up against each other in the league game of IPL 2022. Gujarat Titans opted to bowl first after winning the toss at the MCA Stadium in Pune. Chennai Super Kings were unchanged, whereas Gujarat Titans were forced to make some unwanted changes. Hardik Pandya and Matthew Wade were replaced my Wriddhiman Saha and Alzarri Joseph in the playing eleven. When Rashid Khan came out at the toss for Gujarat Titans, it was a surprising sight for the cricket fans. Hardik Pandya has been in brilliant form for the Gujarat Titans, but Rashid Khan confirmed that Hardik Pandya has been ruled out due to a groin injury. “Bit of stiffness in the groin area for Hardik, so as a team we didn’t want to take a chance. He will rest and hopefully be back for the next game. Super excited, it’s kind of a dream,” Rashid Khan said at the toss. Match 29 Toss Update @gujarat_titans have won the toss and elect to bowl first against #CSK . Rashid Khan to the lead the side in the absence of Hardik Pandya. #TATAIPL pic.twitter.com/MXo3PQBGJ1 — IndianPremierLeague (@IPL) April 17, 2022 Hardik Pandya has been a wall for Gujarat Titans in the IPL 2022. He has been batting brilliantly, whereas his bowling has also been great this season. Hardik has scored 228 runs in IPL 2022 at 76.00, whereas he has scalped four wickets in bowling as well. He has smashed a couple of half-centuries in the tournament. Hardik Pandya got injured while bowling against Rajasthan Royals in the last game. He could only bowl 3 balls of his 3rd over, and then he felt pain. Vijay Shankar completed the over of Hardik Pandya. Although, Hardik was adjudged the Man of the Match for his 52 balls 87 runs knock and he also got one wicket in bowling. Rashid Khan has said that Hardik can be back for the next game as it is just stiffness. The return of Hardik Pandya will certainly impact the run of Gujarat Titans in IPL 2022.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"PBKS vs SRH Highlights, IPL 2022: Pooran-Markaram guide Hyderabad home - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pcGwtMjAyMi1wYmtzLXZzLXNyaC1saXZlLXNjb3JlLXB1bmphYi1raW5ncy12cy1zdW5yaXNlcnMtaHlkZXJhYmFkLXQyMC1tYXRjaC0yOC1saXZlLXVwZGF0ZXMtMTAxNjUwMTc4MzEwNzc0Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs SRH Highlights, IPL 2022: Pooran-Markaram guide Hyderabad home  Hindustan TimesRevealed: Why Mayank Agarwal Isn't Playing Today For Punjab Kings Against Sunrisers Hyderabad  Cricket AddictorLive Cricket Score - PBKS vs SRH, Match 28, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzMayank doing better, ready to be back: Shikhar Dhawan  The Indian ExpressHighlights IPL 2022, PBKS vs SRH Match 28: Umran Malik Shines; Sunrisers Hyderabad Beat Punjab Kings By 7 Wic  India.comView Full coverage on Google News","content":null,"pubDate":"2022-04-17 14:07:30","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, Punjab Kings vs Sunrisers Hyderabad Highlights: Umran Malik's final-over heroics seal fourth wi - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMi1wFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLTIwMjItcHVuamFiLWtpbmdzLXZzLXN1bnJpc2Vycy1oeWRlcmFiYWQtaGlnaGxpZ2h0cy11bXJhbi1tYWxpa3MtZmluYWwtb3Zlci1oZXJvaWNzLXNlYWwtZm91cnRoLXdpbi1vbi10aGUtdHJvdC1mb3Itc3JoL2FydGljbGVzaG93LzkwODk2NTk0LmNtc9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, Punjab Kings vs Sunrisers Hyderabad Highlights: Umran Malik's final-over heroics seal fourth wi  Times of IndiaWatch: 4 Wickets And No Run In Dramatic Final Over Bowled By Umran Malik In IPL 2022  NDTV Sports'Facing Umran in nets is a nightmare. I've got my chest guard to not get hurt'  Hindustan Times‘He and Bumrah in tandem will terrify the Angrez’ – Shashi Tharoor wants ‘phenomenal’ Umran Malik in India colours  CricTrackerPBKS vs SRH - \"Need Him In India Colours ASAP\": Shashi Tharoor's Effusive Praise For Umran Malik | Cricket News  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-04-17 14:07:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Chennai Super Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-chennai-super-kings-live-score-over-match-29-t20-1-5-updates-2895665","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Chennai Super Kings from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-17 14:05:46","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 2.0 overs, Chennai Super Kings are 7/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Gujarat Titans and Chennai Super Kings. Everything related to Gujarat Titans and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Gujarat Titans vs Chennai Super Kings live score. Do check for Gujarat Titans vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 1.6 overs (1 Run) 1 run. 1.6 overs (1 Run) Wide! Yash gets his inswinger going but the line is down the leg side. Robin tries to flick but misses. 1.5 overs (0 Run) Full again, wide outside off, Uthappa pushes at it gently with an angled bat but finds point. 1.4 overs (1 Run) Quick run. Fullish and on off, Gaikwad shows the full face of his bat and bunts it towards mid off. 1.3 overs (1 Run) Fuller and on middle, Robin Uthappa works it to the right side of the mid on fielder and collects a single. 1.2 overs (0 Run) Serves it on a good length and close to off, Robin Uthappa stays back and defends it towards the cover fielder. 1.1 overs (0 Run) Well stopped! Dayal pitches it up and outside off, Uthappa drives it square of the wicket on the off side but fails to beat the diving fielder at point. Who will bowl from the other end then? Yash Dayal it is. 0.6 over (1 Run) Back of a length, outside off, Uthappa pushes inside the line and guides it down to third man for a run. He is off the mark as well. 3 from the first over! 0.5 over (0 Run) Perfect line and length from Shami. He keeps it on and around off, landing it on a good length and getting it to straighten off the seam, Robin Uthappa is solid in his defense. 0.4 over (0 Run) Full and around off, shaping away a bit, Uthappa defends it watchfully to the off side. 0.4 over (1 Run) Wide! Sliding down the leg side, on a length, Robin fails to flick. 0.3 over (1 Run) Slight width there outside off, Ruturaj Gaikwad plays late and uses the pace of the bowler to run it down to third man. He opens his account with a single. 0.2 over (0 Run) This one is angled in, around off and on a good length at 137.1 kph, Gaikwad defends it from the back foot. 0.1 over (0 Run) Movement straightaway for Shami. He serves it short and outside off, Ruturaj Gaikwad chases but hits it to backward point. Time to set the ball rolling. The Gujarat players are spreading on the field after the customary huddle. Ruturaj Gaikwad and Robin Uthappa are the Chennai openers and it is going to be Mohammad Shami to begin proceedings with the ball. Here we go... Stephen Fleming, the head coach of Chennai, comes up for a quick word. The Kiwi says that they are trying to stay calm as the start has not been ideal. Tells that they have worked hard and have a few new faces in the team. Feels that the last win was important which can drive them forward but they still have a lot of work to do. Adds that they certainly have the determination. Admits they have a lot of work still to do as there are teams that are looking better than them but he hopes they can do well from here on. On working with Jadeja, Fleming replies that MS Dhoni is still a big part of the leadership and his job is to provide the information and give freedom to the new captain. Update - Hyderabad have registered an easy win against Punjab by 7 wickets with more than one over to spare. With four wins in a row, Hyderabad now enter the top four. Ravindra Jadeja, the captain of Chennai, says that they would have bowled as well but the pitch looks good and they would now look to put a good total on the board and later defend it. Tells that the atmosphere in the team is positive and everyone is happy. Shares that they spent their off time practising and training. Informs that they are unchanged. Rashid Khan, the stand-in skipper of Gujarat, starts by sharing that Hardik Pandya has a little bit of stiffness and they don't want to take risks with him. Hopes he will be back for their next game. Mentions it is like a dream captaining the side and he will give his 100 per cent. Informs about a couple of changes - Wriddhiman Saha comes in for Matthew Wade and Alzarri Joseph replaces Hardik. Chennai (Unchanged Playing XI) - Ruturaj Gaikwad, Robin Uthappa, Moeen Ali, Ambati Rayudu, Shivam Dube, Ravindra Jadeja (C), MS Dhoni (WK), Dwayne Bravo, Chris Jordan, Maheesh Theekshana, Mukesh Choudhary. Gujarat (Playing XI) - Shubman Gill, Wriddhiman Saha (WK) (In for Matthew Wade), Vijay Shankar, Abhinav Manohar, David Miller, Rahul Tewatia, Rashid Khan (C), Mohammad Shami, Lockie Ferguson, Alzarri Joseph (In for Hardik Pandya), Yash Dayal. Toss - Big breaking! Hardik Pandya is unwell and RASHID KHAN IS LEADING GUJARAT! The Afghan is in the middle along with Ravindra Jadeja. Up goes the coin and it falls in favour of Rashid. GUJARAT ELECT TO FIELD! Latest - Wriddhiman Saha and Alzarri Joseph are all set to make their debut for Gujarat. Update from Match 28 - Hyderabad are comfortably placed in their chase against Punjab. They need another 55 runs in 7 overs to secure their 4th win in a row. Can they do it with ease or is there some drama in store? While we wait for the toss here, you can keep shuffling the tabs and follow that match as well. At the moment, with the result of the ongoing game not out, Gujarat are the table-toppers and would be keen to keep their spot up top with a thumping show against Chennai. Their batting is one area that has shown some vulnerability and the Yellow team will look to exploit the loopholes. The 4-time champions, on the other hand, recently tasted their first success of the season after four flop shows and would like to build on that victory. Unlike their opponents, Chennai's bowling has been an area of worry and could be targeted by the big hitters of Gujarat. This is setting up to be a mouth-watering clash. Welcome, folks! The first game of Super Sunday is still going on but it's time for us to shift our attention to the second match, coming up this evening in Pune. Hardik's Gujarat versus Jadeja's Chennai - that's the contest. Two of the best all-rounders in the country will be crossing swords, both new in their role as the captain of the ship, but one has taken it like a duck to water while the other is learning it the hard way. Individually, both Jadeja and Pandya can do wonders with both bat and ball, but let's see how they lead their troops this evening. Stay tuned for more... ... MATCH DAY ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637858209377395653.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}