{"newsArray":[{"title":"Why do England have Three Lions on their badge, and has the badge always been the same?","link":"https://www.thescottishsun.co.uk/sport/football/2896191/why-do-england-three-lions-badge-world-cup/","keywords":["Football","Sport","World Cup","Explainers"],"creator":["Jim Sheridan"],"video_url":null,"description":null,"content":"ENGLAND's badge is one of the most unique in international football. The iconic Three Lions and ten red roses feature on this summer's World Cup strip, along with a star representing the 1966 win on home turf. 3 England's iconic Three Lions badge and ten red roses Credit: Alamy Why do England have Three Lions on their badge? ENGLAND are representatives of the Football Association - and therefore use their emblem on their shirts. That happens to be the Three Lions crest and was first used in 1872 when England played Scotland in the first ever international. The lion is a huge part of English history and can be traced back to the time of King Henry I and Richard the Lionheart. 3 The great Stanley Matthews wearing England strip in 1954 Credit: Getty - Contributor Banners sporting three golden lions were ridden into battle by Richard and every monarch following him has them on their Royal Coat of Arms. When the FA was formed the crest was designed to show that heritage - and has been a feature of England jerseys ever since. Because it is officially a royal emblem, the FA had to ask permission to use it with the team. You will notice that the crest also features 10 red roses and some believe that they hark back to the War of the Roses between Yorkshire and Lancashire. 3 A young England fan shows her support for the team outside the Samara Arena Credit: PA:Press Association Has the badge always been the same? THERE has been just one major change in the last 146 years. The England cricket team share the same badge and the two were difficult to differentiate between. Before 1949 the football version had crowns on the lions, but these were removed. Otherwise, the design - save for a few cosmetic differences - has remained since 1872.","pubDate":"2022-11-20 20:40:27","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Three Lions lyrics – when did The Lightning Seeds, Baddiel and Skinner release iconic England anthem?","link":"https://www.thescottishsun.co.uk/sport/football/2791207/three-lions-lyrics-england-world-cup/","keywords":["Football","Sport","World Cup","Explainers"],"creator":["Jon Lockett"],"video_url":null,"description":null,"content":"ENGLAND are going for glory once again at the 2022 World Cup in Qatar - and Iran is first on the schedule. The country is going football mad and once again terrace anthem Three Lions is blasting out of fan's windows across the country. Here's the lyrics if you need reminding... 2 David Baddiel and Frank Skinner helped write the hit song Credit: News Group Newspapers Ltd What are the Three Lions song lyrics? [Spoken] I think it's bad news for the English game\" We're not creative enough, and we're not positive enough\" It's coming home It's coming home It's coming Football's coming home [Spoken] \"We'll go on getting bad results, getting bad results, getting bad results, getting bad results\" It's coming home It's coming home It's coming Football's coming home It's coming home It's coming home It's coming Football's coming home It's coming home It's coming home It's coming Football's coming home Everyone seems to know the score They've seen it all before, They just know They're so sure That England's gonna throw it away, Gonna blow it away But I know they can play 'Cos I remember... Three Lions on a shirt Jules Rimet still gleaming Thirty years of hurt Never stopped me dreaming So many jokes, so many sneers But all those oh-so-nears Wear you down Through the years, But I still see that Tackle by Moore And when Lineker scored Bobby belting the ball And Nobby dancing! Three Lions on a shirt Jules Rimet still gleaming Thirty years of hurt Never stopped me dreaming. Commentary - England have done it, in the last minute of extra time. What a save, Gordon Banks Good old England, England who couldn't play football England have got it in the bag. I know that was then But it could be again It's coming home It's coming Football's coming home It's coming home It's coming home It's coming Football's coming home Commentary - England have done it It's coming home It's coming home It's coming Football's coming home It's coming home It's coming home It's coming Football's coming home (It's coming home) Three lions on a shirt (It's coming home) (It's coming) Jules Rimet still gleaming (Football's coming home) (It's coming home) Thirty years of hurt (It's coming home) (It's coming) Never stopped me dreaming (Football's coming home) (It's coming home) Three lions on a shirt (It's coming home) (It's coming) Jules Rimet still gleaming (Football's coming home) (It's coming home) Thirty years of hurt (It's coming home) (It's coming) Never stopped me dreaming (Football's coming home) (It's coming home) Three lions on a shirt (It's coming home) (It's coming) Jules Rimet still gleaming (Football's coming home) (It's coming home) Thirty years of hurt (It's coming home) (It's coming) Never stopped me dreaming (Football's coming home) Why do England fans sing Three Lions? Three Lions was a song released in 1996 by English band The Lightning Seeds to mark England's participation in that year's European Championships, held in England. The music was written by the Lightning Seeds' Ian Broudie, along with comedians David Baddiel and Frank Skinner - presenters of the hit football-themed comedy show Fantasy Football League. This song is one of only three songs to top the British charts twice with different lyrics, the others being \"Mambo No. 5\" (in versions by Lou Bega and Bob the Builder) and \"Do They Know It's Christmas?\" (by Band Aid and Band Aid 30). It was rereleased in 1998 with updated words. It regularly reappears in the UK singles chart around major football tournaments involving the England team. 2 England fans will bellow the Three Lions lyrics when Harry Kane and co step onto the field Why are there three lions on England's shirts? England wear three lions on their shirts - as they have done ever since the first international against Scotland in 1872 - because it is the logo of the FA. However where that logo comes from is a much longer and interesting story. The lions have a history going back to the 12th century, when a standard with three gold lions on a red field was carried into battle to inspire the troops. The first one came from Henry I - known as the lion of England - who had a lion on his standard on taking power in 1100. Shortly afterwards he married Adeliza, whose father also had a lion on his shield, and to commemorate the event he added a second lion to his standard. In 1154, two lions became three when Henry II married Eleanor of Aquitaine, who also had a lion on her family crest. Richard the Lionheart later used three golden lions on a scarlet background as a symbol of the English throne and, after that, it appeared on the Royal Arms of every succeeding monarch. So when the FA was formed in 1863, it seemed natural enough to base their logo on this stirring royal shield. Since then, the design has only been changed once, in 1949 - when the crown that was on top of the lions was removed to differentiate the badge from that of the English cricket team.","pubDate":"2022-11-20 20:34:20","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup: Morgan Freeman, Jung Kook headline day one before Ecuador defeats hosts Qatar","link":"https://www.firstpost.com/fwire/fifa-world-cup-morgan-freeman-jung-kook-headline-day-one-before-ecuador-defeats-hosts-qatar-11663531.html","keywords":["Fwire"],"creator":["Bansal Shah"],"video_url":null,"description":"FIFA World Cup: Morgan Freeman, Jung Kook headline day one before Ecuador defeats hosts Qatar","content":"Fwire FIFA World Cup: Morgan Freeman, Jung Kook headline day one before Ecuador defeats hosts Qatar A glittering opening ceremony was highlighted by the presence of Hollywood actor Morgan Freeman and Korean singer Jung Kook. Bansal Shah November 21, 2022 01:41:22 IST The view of the fireworks at the Al Bayt Stadium during the opening ceremony was exquisite. AP US actor Morgan Freeman (left) talked with FIFA World Cup Ambassador Ghanim Al Muftah, at the start of the opening ceremony. The two had a meaningful conversation on peace and inclusivity. AP The mascot of the Qatar World Cup La’eeb was displayed during the opening ceremony. La’eeb in Arabic means super-skilled player. AP The view of the fireworks at the Al Bayt Stadium during the opening ceremony was exquisite. AP South Korean singer Jung Kook also performed at the opening ceremony as the fans were taken into a frenzy with his song ‘Dreamers’. AP Artists displayed some amazing performances at the opening ceremony. AP Tribute was paid to prior FIFA World Cup anthems including Waka Waka and Wavin Flag. AP After the opening ceremony, Ecuador cruised over Qatar in the opening match at the Al Bayt Stadium in Qatar. AP Qatar fans were in large numbers, but people started to leave before the final whistle. AP Ecuador fans were ecstatic and celebrated their side’s 2-0 win over Qatar at the end of a World Cup group A soccer match. AP Ecuador’s Moises Caicedo threw his shirt to the fans after winning the World Cup group A match against Qatar. AP Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 21, 2022 01:41:22 IST TAGS: Fifa World Cup 2022 Kickingaround Qatar World Cup","pubDate":"2022-11-20 20:11:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/FIFA-WC-Opening-ceremony-6.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Stokes the Test skipper can learn from his recent T20 success: Ian Chappell","link":"https://kashmirreader.com/2022/11/21/stokes-the-test-skipper-can-learn-from-his-recent-t20-success-ian-chappell/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Former Australian captain Ian Chappell feels Ben Stokes the Test captain has plenty to learn from his match-winning performances in the T20 World Cup. Stokes showed his big match prowess once again with a fighting unbeaten half-century in the T20 World Cup final against Pakistan. His innings in the 2019 ODI World Cup […]","content":"New Delhi: Former Australian captain Ian Chappell feels Ben Stokes the Test captain has plenty to learn from his match-winning performances in the T20 World Cup. Stokes showed his big match prowess once again with a fighting unbeaten half-century in the T20 World Cup final against Pakistan. His innings in the 2019 ODI World Cup final and the Ashes Test in the same year have become part of cricketing folklore. In his column for ESPNcricinfo, Chappell wrote what Stokes the captain as well as the batter can learn from his recent T20 success. “Stokes has an enviable record of performing at his best when the stakes are highest. He has done it in crucial Tests and one-day matches and now he has achieved that remarkable feat in T20 cricket. It’s no wonder England captain Jos Buttler demanded his presence in the World Cup squad. “Typical Stokes – he was biding his time in the round-robin games until it came to the must-win match against Sri Lanka,” Chappell wrote. Stokes was elevated to the Test captain job earlier this year at the expense of Joe Root in the wake of England’s prolonged poor run. The southpaw along with coach Brendon McCullum has managed to turn it around for the Test side in quick time. “Having achieved wonders in his debut season as Test captain despite playing some reckless innings, this knock should convince Stokes that at times he needs to bat with a little more caution in the longer format. England need Stokes playing well and contributing his best when it matters most,” the Australian stated. “The fact that Buttler pushed for Stokes’ presence in the T20 squad despite the allrounder’s rare appearances in the format speaks highly of the captain’s short-form knowledge. “Buttler displays much T20 expertise and the one-on-one sessions in which he talked with England players about their role further enhanced those leadership qualities.” Stokes has already retired from ODIs. Chappell, however, feels England limited-overs skipper Jos Buttler doesn’t deserve a place in the Test team. Buttler played his last Test during the Ashes earlier this year. “Despite Buttler’s T20 success, he is an enigma in Test cricket. He is a valuable T20 keeper in addition to being a match-winning batter, but on recent form, there’s no place for him in the Test side. “He’s not a Test keeper, and you can’t play him as a batter because, in addition to being unsure of himself, he’s a dubious proposition when there are slips in place. —PTI Stokes the Test skipper can learn from his recent T20 success: Ian Chappell added by Press Trust of India on 12:15 am November 21, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-20 18:45:04","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Best Sites to Watch Boxing Streams For Free","link":"https://www.gudstory.com/best-sites-to-watch-boxing-streams-for-free/","keywords":["Sports"],"creator":["Shivam"],"video_url":null,"description":"You don’t have to go deep into your money to subscribe to cable TV to quench your passion for all things boxing because several free boxing streams are available. However, owing to geo-restrictions, most of them may not be available where you live. So, here some sites to watch boxing streams for free. Most people […] The post Best Sites to Watch Boxing Streams For Free appeared first on Gud Story.","content":"Home Sports Best Sites to Watch Boxing Streams For Free by Shivam November 20, 2022 in Sports Reading Time: 6 mins read 0 ADVERTISEMENT Share on Facebook Share on Twitter You don’t have to go deep into your money to subscribe to cable TV to quench your passion for all things boxing because several free boxing streams are available. However, owing to geo-restrictions, most of them may not be available where you live. So, here some sites to watch boxing streams for free. Most people enjoy watching boxing. Although some of you may not find the ‘violence’ appealing, most admire the aesthetic and technical talents that go into the sport. However, if you’re ready to loosen your purse strings, you could find it easier to keep up with your favorite boxing matches. Higher-profile boxing contests will be much more difficult to find. ADVERTISEMENT Table of Contents Top Free Sites to Watch Boxing Streams 2022 1. Boxing Stream Links 2. SportRAR.TV 3. Sportsurge 4. Streameast 5. BuffStreams Boxing Channel 6. ESPN 7. Box.Live 8. Team USA Boxing Conclusion Top Free Sites to Watch Boxing Streams 2022 Boxing bouts, like other games, are usually kept behind a paywall. Other unauthorized sites allow you to watch boxing contests for free, depending on your area. Be aware that while free streaming services are legal and permitted in certain areas, they may be considered unlawful in others. Some unofficial streaming sites embed videos from sporting stream servers. This may be considered copyright infringement, so check to see if watching a particular stream is legal and permitted in your country. 1. Boxing Stream Links Boxing Stream Links is Reddit’s free option for getting into some boxing action. Boxing Stream Links provides Reddit boxing stream links in HD quality for you to follow your favorite fighters. The UI is elegant and simple, with conflicts organized and sorted by ‘Yesterday,’ ‘Today,’ and ‘Tomorrow.’ Click on the boxing bout for the Fight Card. The ‘About Match’ column offers a synopsis of the fight. Around 60 minutes before kick-off, the correct stream links will be available. There are news postings on the newest boxing happenings at the foot of the Boxing Stream Links main page. Clicking on the match will bring up pop-ups. Therefore, we use an ad-blocker to ensure a smooth viewing experience. Only one pop-up appeared for me. As a result, the pop-ups seemed minor to me. Reddit is the most popular place for sports fans to congregate. 2. SportRAR.TV Even though SportRAR.TV concentrates on football. They also provide streaming connections to other sports, such as tennis, basketball, boxing, and others. The website has a clean layout that makes it simple to navigate. Select the ‘Fighting’ option to discover what games are available in real-time. You will see another page that lists the accessible streaming platforms by clicking on the selected game. The user interface is simple. TV is more of a search engine that searches the internet for live sports streaming material than a pure streaming platform. SportRAR. TV acts as a sports director, gathering live sports streaming material. 3. Sportsurge One of my favorite free boxing streaming websites is Sportsurge. It is a live sports streaming portal where fans can watch live matches and highlights. It provides free streaming of boxing, basketball, MMA, football, Formula One, and other sports. In addition to its web platform, Sportsurge has an iOS and Android app. It has over 150 countries and millions of users on various platforms. So, whether you’re at home or on the train, Sportsurge gives you the freedom to watch boxing and other sports whenever and wherever you choose. Do you want to know the best part? It is entirely free and ethical. 4. Streameast Streameast has a simple and elegant UI that makes it simple to use. You will separate the conflicts into ‘Yesterday,’ ‘Today,’ and ‘Tomorrow.’ The commercial banners and pop-ups are minimum. When you choose the relevant match, three tabs will appear: ‘Live Streams,’ ‘Fight Card,’ and ‘About.’ It’s as straightforward as it gets. The streaming links will only be available 60 minutes before the fight. You must return within an hour of the match’s start time. Streameast also covers other sports. You are welcome to look over it. Streameast, like other free streaming services, may not be safe. Not only must legal considerations, but you must also make security considerations. 5. BuffStreams Boxing Channel Are you going to be able to see the fight tonight? BuffStreams, a boxing streaming service, is ready to satisfy your boxing hunger. Fighting is one of the most well-known and oldest sports. Hence it has a special streaming channel for boxing and UFC fans. Aside from boxing, it also has channels for MMA/UFC, Football, Formula 1, Cricket, and the NFL. The most important aspect is that BuffStreams is free; you may watch all boxing matches and events for free. There are HD streams available. However, when converted to HD, it becomes an ad-supported service. 6. ESPN ESPN is the greatest website for watching boxing online. It allows you to watch all sports live in high definition on the web, mobile, and television. The simple user interface makes it easy to capture boxing motions and keep up with boxing events and news. Aside from free boxing streaming, ESPN also provides MMA, Soccer, Tennis, Basketball, Baseball, WWE, Cricket, Football, and Hockey. Premium plans are also available. If you wish to avoid adverts, you need to pay for its premium services. ESPN offers the finest audio and visual quality on the market. It’s a fantastic venue to watch fights. Not only can you have boxing, but you may also enjoy punches and kicks in other games. 7. Box.Live Box.Live is an aggregator website dedicated solely to boxing. Scroll down to see an overview of the matches, organized by date. Each bout has its own set of online streaming options. They do specify whether or not the links are free. Box.Live does, in some ways, provide a full picture of the boxing streaming connections accessible for a fight. Follow your fighters and any contests for free, receive updates on anything notable, and enjoy fewer advertisements. At the right panel, you can see the match results and fighter ranks. You might be interested in a lot of recent boxing news. There is also an opportunity to put bets at the top. Continue scrolling down to locate a section where you may find the next battles. At the bottom is a disclaimer on the authenticity of the material supplied and that Box.Live has obtained permission for all licensed media. 8. Team USA Boxing U.S. Olympic and Paralympic Committee (USIPC) manages the Team USA Boxing website in Colorado, USA. They were founded in 1894 and are in charge of supporting and empowering America’s athletes. Team USA Boxing is dedicated to advancing boxing in the United States. You may become a member and donate to Amateur Boxing programs around the United States. On the main page, there are six tabs to explore. The ‘Ring’ tabs will take you to any live boxing fights. The video quality will be HD or SD, depending on your internet connection speed. You may manually modify the video quality by clicking the ‘gear’ button on the video player. Conclusion If you’re looking for a thrill, looking for boxing matches is a no-brainer. You want to cheer on your favorite boxer as he attempts a knockout. If you want to avoid paying money, go as far as the list of free sites to watch boxing streams, which will more than fulfill your need for punching action. Also read: Best Sites to Watch NBA Live Streams for Free Related Posts Manchester City Get Fifth WSL Victory in a Row November 20, 2022 Best Sites to Watch MLB Live Streams November 20, 2022 Meet the Pickleball Teams and Celebrities in Pickled Cast November 19, 2022 Bruno Fernandes Scores Two as Portugal Beat Nigeria 5-0 in The International Cup November 19, 2022","pubDate":"2022-11-20 18:42:11","image_url":null,"source_id":"gudstory","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranjot, Rydham sparkle as J&K inflicts innings defeat on Meghalaya","link":"https://thenorthlines.com/ranjot-rydham-sparkle-as-jk-inflicts-innings-defeat-on-meghalaya/","keywords":["Sports"],"creator":["Northlines"],"video_url":null,"description":"NL CORRESPONDENT MANGALDAI, Nov 20: Promising left-arm spinner Ranjot Singh along with Ritvik Jaitley and Udhay Partap spun web around the rival batters, while talented batter Rydham Sharma and middle-order batter Arnav Gupta displayed extraordinary batting skills as J&K inflicted an innings defeat on Meghalaya in just two days of the ongoing 4-day Cooch Behar […] The post Ranjot, Rydham sparkle as J&K inflicts innings defeat on Meghalaya appeared first on Northlines.","content":"NL CORRESPONDENT MANGALDAI, Nov 20: Promising left-arm spinner Ranjot Singh along with Ritvik Jaitley and Udhay Partap spun web around the rival batters, while talented batter Rydham Sharma and middle-order batter Arnav Gupta displayed extraordinary batting skills as J&K inflicted an innings defeat on Meghalaya in just two days of the ongoing 4-day Cooch Behar Trophy at Mangaldai Cricket Stadium, today. J&K scored a decent total of 290 runs in 76.1 overs in their first innings. Rydham Sharma top scored with 84 runs off 104 balls, studded with 12 fours and one six, while Arnav Gupta contributed 60 runs off 122 balls with 10 boundaries. Skipper Arya Thakur scored brisk 38 runs off 37 balls studded with 7 boundaries. For Meghalaya, Navin Kr Ray took 4 wickets, while BR Marak bagged 3 wickets. In reply, Meghalaya bundled out for 144 runs in 55.5 overs. Mrinal Das top scored with 40 runs while Bharali and Sachin contributed 33 and 25 runs to the total respectively. For J&K, Ranjot Singh was the wrecker-in-chief, who took 5 important wickets by conceding 36 runs in 16.5 overs, while Udhay Partap Singh bagged 3 wickets by giving away 31 runs in 13 overs. Following on Meghalaya collapsed at 114 runs in their second essay, thus lost the match by an innings and 32 runs. Avinash Rai top scored with 48 runs, while Mrinal Das contributed 28 runs. Ranjot Singh and Ritvik Jaitley took 2 wickets each while Udhay Partap claimed one. J&K team is being accompanied by Raju Sharma as the Head Coach, Zahoor Sofi as the Manager, Shafqat Malik as Bowling Coach, Ravi Sharma as Co-Manager, Suresh Singh as Fielding Coach, Pawan Kumar as Trainer, Haseeb Rehman as Physio and Sameer Malik as the Performance/Video Analyst. Meanwhile, the Sub-Committee Members of JKCA namely Brig Anil Gupta, Member-Administration; Cricketer Mithun Manhas, Member Cricket Operations and Development and Advocate Sunil Sethi, Member Legal Affairs JKCA have congratulated the team and the Support Staff for this brilliant victory which enabled J&K to qualify for the knockout stage. “#CoochBeharTrophy2022. JKCA U19 team scores an innings victory over Meghalya winding up the match in less than two days. The spinners cast a web around the opponents. Congratulations. You have the potential to scale greater heights. All the best for remainder matches. #JKCA,” tweeted Brig Gupta Majid Dar, Incharge Cricket Development Srinagar also lavished praise for the team and said that the team had a good preparation at home.","pubDate":"2022-11-20 18:00:29","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"VC’s cricket tournament begins at KU’s Zakura Campus","link":"https://thenorthlines.com/vcs-cricket-tournament-begins-at-kus-zakura-campus/","keywords":["Jammu","Jammu Kashmir","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Correspodent Srinagar, Nov 20: The hostel administration of the University of Kashmir kick-started the Vice-Chancellor’s cosco ball cricket tournament at Zakura Campus. Registrar Dr Nisar A Mir inaugurated the tournament, while Prof Aijaz A Wani, Provost (Boys), Prof Gowhar Bashir Vakil, Director IOT and Dr Imtiyaz Ahmad, Chief Proctor, besides wardens of boys hostels, […] The post VC’s cricket tournament begins at KU’s Zakura Campus appeared first on Northlines.","content":"NL Correspodent Srinagar, Nov 20: The hostel administration of the University of Kashmir kick-started the Vice-Chancellor’s cosco ball cricket tournament at Zakura Campus. Registrar Dr Nisar A Mir inaugurated the tournament, while Prof Aijaz A Wani, Provost (Boys), Prof Gowhar Bashir Vakil, Director IOT and Dr Imtiyaz Ahmad, Chief Proctor, besides wardens of boys hostels, medical officer, deputy chief Proctor and other officers were present. Dr Nisar highlighted the importance of extra-curricular activities and emphasised on holding more extracurricular and sports activities like quiz competition, badminton and volleyball tournaments in future. He assured University’s full support for such programmes. Prof Aijaz Ahmad Wani said he is glad to the see hostel boarders in the field after long disruptions caused by Covid19 pandemic. He stressed that match schedules are designed in a manner so that academic activities of the students are not affected. Earlier, Dr Javaid Ahmad Sheikh, Warden, Sheikh-ul- Alam Boys Hostels, Zakura Campus, welcomed the guests and briefed the audience about various activities carried out so far for the welfare of hostel boarders. The inaugural match was played between the boarders of Sheikh-ul-Alam Boys Hostel Block-A and Sheikh-ul- Aalm Boys Hostel Block-B. The former won the match.","pubDate":"2022-11-20 17:58:28","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Pep Guardiola joins Lewis Hamilton’s Mercedes as stars including Patrice Evra, Shaq and Usain Bolt flock to Abu Dhabi GP","link":"https://www.thescottishsun.co.uk/sport/9794363/pep-guardiola-hamilton-f1-grid-abu-dhabi/","keywords":["Motorsport","Sport","F1","Mercedes-Benz"],"creator":["Kiro Evans"],"video_url":null,"description":null,"content":"PEP GUARDIOLA was among the stars who came along to the Abu Dhabi Grand Prix as big celebrities filled the grid. It was the final F1 race of the season and many big names were out on show to mark the occasion. 5 Guardiola was enjoying some time off with the Premier League season on hiatus Credit: Splash 5 Usain Bolt and Patrice Evra were along the stars enjoying the Abu Dhabi action Credit: Getty 5 American singer Usher enjoyed the action in the UAE Credit: Splash Last year's Abu Dhabi race went down as one of the most controversial in the history of the sport. But with the title resolved several races ago and many other plot lines already wrapped up, it was a relaxed atmosphere on the grid as celebrities descended. Among the biggest names was Manchester City manager Pep Guardiola. He is enjoying a rare mid-season break while the World Cup takes centre-stage. READ MORE IN F1 NICE GESTURE Hamilton picks up the tab after hosting farewell meal for old F1 rival Vettel The Spaniard joined Lewis Hamilton's Mercedes team for the weekend - and became the latest big name to snub Martin Brundle . The former F1 driver and Sky Sports pundit attempted to reel in Guardiola during his traditional pre-race grid walk, but the manager was not in the mood for a chat. As Brundle tried to talk to him about Man City, the manager said: \"No, let's not talk about football today.\" He then walked away as body guards ushered Brundle away, leading the unflappable F1 pundit to quip: \"It's okay, I've been thrown out of better places than this.\" 5 Ben Stokes was one of many English cricketers in attendance Credit: Getty 5 Film star Martin Lawrence took a selfie alongside comedian Michael Dapaah Credit: Getty Most read in Motorsport 'UP AND DOWN' Verstappen on pole for Abu Dhabi GP a year after controversial F1 title win NICE GESTURE Hamilton picks up the tab after hosting farewell meal for old F1 rival Vettel MERC MISTAKE Ecclestone reveals Hamilton would have won title but Mercedes 'missed a trick' F1 CALENDAR 2022 Latest updates for the 2022 Grand Prix schedule, tracks and results CASINO SPECIAL - BEST NEW CUSTOMER SIGN UP DEALS Elsewhere, other major globe-trotting celebs popped up. Olympic legend Usain Bolt was also visible in the paddock ahead of the race, while fellow sports star Shaquille O'Neal was also present. Former Manchester United full-back Patrice Evra also arrived at the star-studded event and mingled alongside other celebs, including American pop star Usher. And England legend Ben Stokes was among several cricketers who turned up to watch the race - only a week after their brilliant T20 Cricket World Cup win. It ended up being a disappointing Grand Prix with Max Verstappen waltzing unchallenged to his 15th win of the season. A frustrated Hamilton meanwhile was forced to retire his Mercedes with only a couple of laps to go.","pubDate":"2022-11-20 16:59:33","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Test call-up is coming: Suryakumar Yadav","link":"https://sportstar.thehindu.com/cricket/nz-vs-ind-2nd-t20-suryakumar-yadav-100-sky-hundred-century-test-call-up-press-conference/article66161745.ece","keywords":null,"creator":["\n         PTI  \n    "],"video_url":null,"description":"The world’s number one batter in the shortest format, Suryakumar Yadav is also a proven performer in red-ball cricket, having represented Mumbai for years in the domestic circuit.","content":null,"pubDate":"2022-11-20 15:19:20","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Injured Shaheen Afridi unlikely to return to international cricket until April","link":"https://timesofindia.indiatimes.com/sports/cricket/news/feeling-better-says-shaheen-shah-afridi-after-surgery/articleshow/95643977.cms","keywords":null,"creator":null,"video_url":null,"description":"Pakistan's top fast bowler Shaheen Shah Afridi is unlikely to return to international cricket until April 2023, effectively ruling him out of the five Tests at home against England and New Zealand. Afridi who was given rest because of a knee injury suffered another setback on Saturday when he had to be rushed to hospital in Islamabad for an appendicitis operation.","content":null,"pubDate":"2022-11-20 15:00:10","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Best Player In The World\": Kane Williamson's Ultimate Praise For Suryakumar Yadav - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL25ldy16ZWFsYW5kLXZzLWluZGlhLTIwMjItMjMvYmVzdC1wbGF5ZXItaW4tdGhlLXdvcmxkLWthbmUtd2lsbGlhbXNvbi1vbi1zdXJ5YWt1bWFyLXlhZGF2LTM1Mzc3ODbSAX9odHRwczovL3Nwb3J0cy5uZHR2LmNvbS9uZXctemVhbGFuZC12cy1pbmRpYS0yMDIyLTIzL2Jlc3QtcGxheWVyLWluLXRoZS13b3JsZC1rYW5lLXdpbGxpYW1zb24tb24tc3VyeWFrdW1hci15YWRhdi0zNTM3Nzg2L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Best Player In The World\": Kane Williamson's Ultimate Praise For Suryakumar Yadav  NDTV SportsSensational Suryakumar scores yet another T20I century  ICC CricketLive: Surya Kumar Yadav Addresses Press Conference after thumping win over New Zealand  ANI NewsSuryakumar Yadav defies reality to play anime cricket  ESPNcricinfoNZ v IND 2nd T20I on Prime Video India: Unstoppable Suryakumar!  Prime Video IndiaView Full coverage on Google News","content":null,"pubDate":"2022-11-20 14:57:27","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand: Suryakumar Yadav’s blistering ton, Yuzvendra Chahal’s comeback and more talking points","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-suryakumar-yadavs-blistering-ton-yuzvendra-chahals-comeback-and-more-talking-points-11662961.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand: Suryakumar Yadav’s blistering ton, Yuzvendra Chahal’s comeback and more talking points","content":"As soon as the T20 World Cup has ended, India is back to business decimating its opposition in bilateral tournaments. Whereas the second T20I was just a start to the tour, India’s leg in the island nation is expected to have similar results even with a second-string side.India not only posted a mammoth total of 191 but also managed to scalp all the 10 Kiwi wickets. Quite contrasting to the last T20I India played, more than a week ago.The only thing constant from the T20 World Cup was Suryakumar Yadav’s blistering form who smashed his second T20I century, having both his T20I centuries on interesting wickets in England and New Zealand.An India match cannot go without having some discussions and debates, as we note down some important talking points.Stat attack: Suryakumar Yadav notches up second T20I ton, Southee bags hat-trickSuryakumar Yadav’s blistering centurySuryakumar Yadav continued his blistering form from the T20 World Cup, and notched it up a bit higher registering his second T20I ton.Numero Uno showing why he’s the best in the world. Didn’t watch it live but I’m sure this was another video game innings by him. 😂 @surya_14kumar— Virat Kohli (@imVkohli) November 20, 2022 Suryakumar scored 111 from 51 deliveries with 11 boundaries and 7 maximums and while other batters struggled, he led the attack and ensured India posted a good total on the board.Tim Southee’s late hat-trickTim Southee bagged a hat-trick dismissing Hardik Pandya, Deepak Hooda, and Washington Sundar on consecutive deliveries.However, the hat-trick came a bit too late in the innings in the 20th over and only restricted India from reaching 200.How is Tim Southee only 33 years old by the way? Seems like he’s been playing for New Zealand forever. #NZvIND— Scott Taylor (@ScottTaylorUK) November 20, 2022 The last over fetched only five runs and India ended their 20 overs on 191.Yuzvendra Chahal’s comeback spellYuzvendra Chahal once again showed why he is pivotal in the middle overs and picked up two important wickets of Glenn Phillips and James Neesham and strangled New Zealand of power hitters.He returned with figures of 2/26 as experts and fans once again raised questions about his absence from the T20 World Cup playing XI.Deepak Hooda’s bowlingDeepak Hooda surprised the Kiwis with his off breaks and scalped four wickets in three overs, dismantling the Kiwi middle and lower order.Hooda proved useful in dismantling the lower order as he picked three wickets in the 19th over and put an end to the Blackcaps’ misery.A well deserved Player of the Match award for @surya_14kumar as #TeamIndia win by 65 runs in the 2nd T20I 👏👏Scorecard – https://t.co/OvmynDiyd8 #NZvIND pic.twitter.com/TuYSRsIIgQ— BCCI (@BCCI) November 20, 2022 Kane Williamson’s slow inningsKane Williamson was the lone warrior for the Kiwis, as he fought with a 52-ball 61-run innings. But he couldn’t accelerate at any point in time and was eventually dismissed by Mohammed Siraj in the 18th over.Williamson seems to have lost his touch for quite a while, as he has been able to score runs but not at a brisk pace that would be expected in T20 cricket.Suryakumar Yadav – 111*(51) Extras – 11 Rest of the batters – 69(69)— Johns. (@CricCrazyJohns) November 20, 2022 Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-20 13:24:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Suryakumar-Yadav-5.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand: Suryakumar Yadav, Deepak Hooda star in Men in Blue's win over Blackcaps","link":"https://www.firstpost.com/photos/india-vs-new-zealand-suryakumar-yadav-deepak-hooda-star-in-men-in-blues-win-over-blackcaps-11662661.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand: Suryakumar Yadav, Deepak Hooda star in Men in Blue's win over Blackcaps","content":"Photos India vs New Zealand: Suryakumar Yadav, Deepak Hooda star in Men in Blue's win over Blackcaps India defeated New Zealand by 65 runs in the 2nd T20I in Mount Manganui and inched ahead in the three-match series after first match was washed out. FirstCricket Staff November 20, 2022 17:30:01 IST 1 /8 India defeated New Zealand by a mammoth 65 runs in the second T20I at Mount Manganui. BCCI/ Twitter 2 /8 Deepak Hooda jolted the Kiwi lineup with figures of 4/10 in just 2.5 overs. AP 3 /8 Yuzvendra Chahal, as well, was excellent on his comeback to action after missing out on the T20 World Cup and scalped two wickets. AP 4 /8 Kane Williamson played a fighting innings scoring 61 runs from 52 balls but didn’t get support from the other end. AP 5 /8 However, Suryakumar Yadav was the star of the match as he notched up his second T20I century – scoring 111 from 51 deliveries. AP 6 /8 Tim Southee registered a hat-trick picking the wickets of Hardik Pandya, Washington Sundar, and Deepak Hooda in the last over, but it was too late as India had posted 191 on the board. AP 7 /8 Ishan Kishan played a steady inning at the top of the order, scoring 36 from 31 deliveries, but other batters could not score anything significant. AP 8 /8 Indian supporters were present in large numbers at the stadium as India is playing in New Zealand after quite a few years. AP","pubDate":"2022-11-20 12:00:01","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Ind-vs-NZ-7.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand, 2nd T20I, Stat attack: Suryakumar Yadav notches up second T20I ton, Southee bags hat-trick","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-2nd-t20i-stat-attack-suryakumar-yadav-notches-up-second-t20i-ton-southee-bags-hat-trick-11662591.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand, 2nd T20I, Stat attack: Suryakumar Yadav notches up second T20I ton, Southee bags hat-trick","content":"Cricket India vs New Zealand, 2nd T20I, Stat attack: Suryakumar Yadav notches up second T20I ton, Southee bags hat-trick Suryakumar Yadav scored his second T20I century against New Zealand FirstCricket Staff November 20th, 2022 17:17:53 IST Suryakumar Yadav struck an unbeaten century against New Zealand. AP India took a 1-0 lead in the three-match T20I series against New Zealand after beating the hosts by 65 runs in the second T20I in Mount Maunganui on Sunday. Riding on Suryakumar Yadav’s ton, India posted 191/6 in 20 overs and then bundled out the Kiwis for 126 in the 19th over. After being put into bat, India lost Rishabh Pant early but Suryakumar Yadav who walked out to bat number three steadied the ship along with Ishan Kishan. The two chipped in with a 33-run stand before Ishan was eventually undone by Ish Sodhi. But SKY continued his form and took on the Blackcaps’ bowling unit to smash them all around the park. The right-handed batter eventually ended up getting 111* off 51 deliveries which included seven sixes and 11 fours. Apart from Suryakumar, it was New Zealand pacer Tim Southee who grabbed the limelight after he bagged a hat-trick in the final over. He removed Pandya, Deeapk Hooda and Washington Sundar on the three deliveries on the trot. A well deserved Player of the Match award for @surya_14kumar as #TeamIndia win by 65 runs in the 2nd T20I 👏👏 Scorecard – https://t.co/OvmynDiyd8 #NZvIND pic.twitter.com/TuYSRsIIgQ — BCCI (@BCCI) November 20, 2022 Here’s a look at some of the stats. 1) Suryakumar Yadav hit his second T20I hundred in the second match against New Zealand. He notched up his first century against England in Nottingham earlier this year. 2) Suryakumar Yadav’s unbeaten 111 off 51 balls against New Zealand is the fourth highest individual score for India in T20Is. Virat Kohli holds the record for the highest individual score in T20Is for the side. He struck 122* off 61 against Afghanistan in the Asia Cup earlier this year. 3) Rohit Sharma and Suryakumar Yadav are the only two Indian players to score two hundreds in a calender year in T20Is. 4) Tim Southee became only the second bowler after Lasith Malinga to claim second hat-trick in T20Is. 5) Rishabh Pant and Ishan Kishan opened the innings for India against New Zealand. The last time two left-handers opened the innings for India in a T20I was back in 2012 when Gautam Gambhir and Irfan Pathan came out to bat against Australia at at Colombo Premadasa. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 20, 2022 17:17:53 IST Tags: Cricket India Vs New Zealand Suryakumar Yadav Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-20 11:47:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Suryakumar-Yadav-1-1-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs NZ Highlights 2nd T20: Suryakumar goes berserk as IND beat NZ by 65 runs - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMilgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9saXZlLXNjb3JlLWluZGlhLXZzLW5ldy16ZWFsYW5kLTJuZC10MjAtMjAyMi1pbmQtdnMtbnotbGF0ZXN0LXNjb3JlY2FyZC1hdC1tb3VudC1tYXVuZ2FudWktMTAxNjY4OTE5MzU4MjEyLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ Highlights 2nd T20: Suryakumar goes berserk as IND beat NZ by 65 runs  Hindustan TimesHighlights | IND VS NZ, 2nd T20 Cricket Match Updates: India beat New Zealand by 65 runs to take 1-0  Zee NewsLive Cricket Score: New Zealand vs India, 2nd T20I, Mount Maunganui | Cricbuzz.com  CricbuzzNew Zealand vs India Prediction, Betting Tips & Odds │ 20 November, 2022  Telecom AsiaHighlights IND vs NZ 2nd T20 Scorecard: India Thump New Zealand By 65 Runs To Go 1-0 In Series  India.comView Full coverage on Google News","content":null,"pubDate":"2022-11-20 10:57:44","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Hales not thinking about playing ODI World Cup in India next year","link":"https://sportstar.thehindu.com/cricket/alex-hales-not-thinking-about-icc-odi-world-cup-2023/article66160476.ece","keywords":null,"creator":["\n         PTI  \n    "],"video_url":null,"description":"Hales is now primarily a one format player and has last played first class cricket in 2018. He believes that quitting red ball cricket has helped him improve his T20 game as it’s no longer feasible to play all formats.","content":null,"pubDate":"2022-11-20 10:42:18","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"NZ vs IND | Twitter criticizes Hardik Pandya's 'bad cop' treatment to Arshdeep Singh despite excellent catch - SportsCafe","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3Nwb3J0c2NhZmUuaW4vY3JpY2tldC9hcnRpY2xlcy8yMDIyL25vdi8yMC9uei12cy1pbmQtdHdpdHRlci1jcml0aWNpemVzLWhhcmRpay1wYW5keWFzLWJhZC1jb3AtdHJlYXRtZW50LXRvLWFyc2hkZWVwLXNpbmdoLWRlc3BpdGUtZXhjZWxsZW50LWNhdGNo0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"NZ vs IND | Twitter criticizes Hardik Pandya's 'bad cop' treatment to Arshdeep Singh despite excellent catch  SportsCafeHardik Pandya Wants To See More Indian Batters Chipping In With The Ball  ICC CRICKET SCHEDULE‘I want to see more…’: Pandya's special request for India batters after 2nd T20I  Hindustan TimesI want more batters to chip in with ball: Skipper Hardik Pandya after India’s win against New Zealand  SportstarNew Zealand vs India: Captain Hardik Pandya wants more batters to chip in with ball after big win in 2nd T20I  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-11-20 10:02:06","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Super Suryakumar torches NZ!","link":"https://www.themercury.com.au/sport/cricket/super-suryakumar-torches-nz/video/38f81b52a65aa66bd8cd304d587bb3e8","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: India's Suryakumar Yadav struck an imperious century as India racked up runs against New Zealand in their T20 clash.","content":"Cricket: India's Suryakumar Yadav struck an imperious century as India racked up runs against New Zealand in their T20 clash.","pubDate":"2022-11-20 09:54:23","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Southee claims final over HATTRICK!","link":"https://www.themercury.com.au/sport/cricket/southee-claims-final-over-hattrick/video/c4d7eece20fa014f42fb16f3c4972647","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Tim Southee was given the task of bowling the final over for New Zealand against India, and picked up an impressive hattrick.","content":"Cricket: Tim Southee was given the task of bowling the final over for New Zealand against India, and picked up an impressive hattrick.","pubDate":"2022-11-20 09:45:20","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Suryakumar Yadav hits brilliant century during IND vs NZ 2nd T20I to join Rohit in elite list; Virat Kohli praises SKY","link":"https://www.firstpost.com/firstcricket/sports-news/suryakumar-yadav-hits-brilliant-century-during-ind-vs-nz-2nd-t20i-to-join-rohit-in-elite-list-virat-kohli-praises-sky-11662231.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Suryakumar Yadav hits brilliant century during IND vs NZ 2nd T20I to join Rohit in elite list; Virat Kohli praises SKY","content":"Cricket Suryakumar Yadav hits brilliant century during IND vs NZ 2nd T20I to join Rohit in elite list; Virat Kohli praises SKY Suryakumar Yadav smashed an unbeaten 111 not out off 51 balls against New Zealand in the second T20I on Sunday. FirstCricket Staff November 20th, 2022 15:14:32 IST Suryakumar Yadav notched up his second T20I ton. AP Team India batter Suryakumar Yadav, who was the third-highest run-scorer in the recently concluded T20 World Cup in Australia, continued his rich vein of form as he smashed a sensational century in the second T20I against New Zealand at the Bay Oval, Mount Maunganui to power the visitors to 191 for six. Surya smashed an unbeaten 111 not out off 51 balls to become only the second Indian after Rohit Sharma to score two T20I centuries in a calendar year. While Rohit has achieved the feat in 2018, Suryakumar has joined the India skipper on the list this year as prior to scoring a century on Sunday, the 32-year-old batter hit a sensational 48-ball ton against England in the third T20I at Trent Bridge in July. Interestingly, India better Virat Kohli, who is rested for the series, also took to Twitter to laud SKY for his superb show against the BlackCaps. Numero Uno showing why he’s the best in the world. Didn’t watch it live but I’m sure this was another video game innings by him. 😂 @surya_14kumar — Virat Kohli (@imVkohli) November 20, 2022 Also, Suryakumar’s 111 is the fourth-highest individual T20I score by an Indian batter. Highest individual T20I scores for India: 122*(61) Virat Kohli vs Afg Dubai 2022 118(43) Rohit Sharma vs SL Indore 2017 117(55) Suryakumar Yadav vs Eng Nottingham 2022 111*(51) Suryakumar Yadav vs NZ Mt Maunganui 2022 111*(61) Rohit Sharma vs WI Lucknow 2018 Surya toyed with the bowlers to lift India to a challenging total after New Zealand put the visitors in to bat. Rain stopped play at the Bay Oval for 26 minutes but no overs were lost. While Surya was once again in a league of his own, other batters who showed intent but could not go on were opener Ishan Kishan (36 off 31) and number four Shreyas Iyer (13 of 9). The experiment to open with Rishabh Pant did not work as he fell after a sluggish six off 13 balls. India’s powerplay approach was in focus before the game but not much was delivered on that front, with the team reaching 42 for one in six overs. Surya came at number three in Virat Kohli’s absence and smashed boundaries and sixes at will, his last 64 runs coming off just 18 balls. It might not look simple to the naked eye but in his own words, Surya kept it ”simple” and executed his amazing range of strokes as per the field placements. If the spinners pitched it full on off stump, he was happy to play the inside-out shot over cover and when the faster bowlers targeted his stumps on a good length, he helped the ball sail past fine leg for a bunch of sixes. In total, Surya collected 11 fours and seven sixes. He brought up his second century off 49 balls with an aerial drive that went wide of sweeper cover. Surya went berserk in the penultimate over bowled by Lockie Ferguson, hammering four boundaries and a phenomenal six over deep point. The fast bowler had clearly run out of ideas with Surya on a song. The last five overs yielded 72 runs. Tim Southee bowled a brilliant 20th over and stemmed the free flow of runs by taking a hat-trick. He dismissed Washington Sundar, Deepak Hooda, and Hardik Pandya on the trot. (With PTI inputs) Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 20, 2022 15:14:32 IST Tags: Cricket India Vs New Zealand Suryakumar Yadav Virat Kohli Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-20 09:44:32","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Suryakumar-Yadav-1-2.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand: Tim Southee picks second T20I hat-trick of his career; watch","link":"https://www.firstpost.com/firstcricket/sports-news/tim-southee-second-t20-hattrick-elite-list-india-vs-new-zealand-11662011.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand: Tim Southee picks second T20I hat-trick of his career; watch","content":"Cricket India vs New Zealand: Tim Southee picks second T20I hat-trick of his career; watch Tim Southee is the second bowler in T20Is to take two hat-tricks in the format. FirstCricket Staff November 20th, 2022 14:47:37 IST Tim Southee took the hat-trick in the last over of India's innings. Image: Twitter/@ICC Pacer Tim Southee picked up a hat-trick on Sunday in the second T20I between India and New Zealand at the Bay Oval. Southee dismissed Hardik Pandya, Deepak Hooda and Washington Sundar on successive deliveries in the last over of India’s innings to become the only bowler after Lasith Malinga to take two hat-tricks in T20Is. Southee’s first hat-trick had come against Pakistan in 2010 At Auckland. View this post on Instagram A post shared by BLACKCAPS (@blackcapsnz) Southee’s heroics left batter Surykumar Yadav stranded at the non-striker’s end in the final over as India posted 191/6 batting first at Mount Maunganui. India had looked destined for a 200+ score. Suryakumar, meanwhile, scored 111 off 51 balls. IND vs BZ: Follow the 2nd ODI live Hat-trick description: 19.3: Southee dismissed Hardik. The India all-rounder got caught at long-off trying to hit a wide yorker for a six. 19.4: Southee dismissed Hooda. A first-ball duck for the India batter as he flicked the middle stump ball straight to the short fine leg fielder. 19.5: Southee dismissed Washington. Fuller delivery outside off was skied by Washington without timing and long-on took the catch. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 20, 2022 14:47:37 IST Tags: India Vs New Zealand Tim Southee Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-20 09:17:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Tim-Southee1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"WBBL wrap: Schutt's record haul secures home final - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3d3dy5jcmlja2V0LmNvbS5hdS9uZXdzL3diYmwwOC1iaWctYmFzaC1maW5hbC1kYXktdG9wLWZvdXItYmF0dGxlLXJlcG9ydC1zY29yZXMtaGlnaGxpZ2h0cy1odXJyaWNhbmVzLXN0cmlrZXJzLXNjb3JjaGVycy8yMDIyLTExLTIw0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"WBBL wrap: Schutt's record haul secures home final  cricket.com.auWBBL round-up: Schutt claims record haul, Perry shines, rain saves Heat, Kershaw eliminates Scorchers  ESPNcricinfoRain forces Brisbane Heat into WBBL eliminator  The CricketerStrikers secure home final after Schutt's record haul | WBBL|08  cricket.com.auReigning champions out as WBBL knockout line-up confirmed  The CricketerView Full coverage on Google News","content":null,"pubDate":"2022-11-20 09:11:15","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"‘We blew it’: Reigning champs bundled out","link":"https://www.couriermail.com.au/sport/cricket/we-blew-it-reigning-champions-perth-scorchers-bundled-out-of-womens-big-bash-league/news-story/0a92ff0bcd820abbdd548d213a7a36ea","keywords":["Cricket news and galleries","Kayo","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"The Perth Scorchers have been bundled out of the Women’s Big Bash League, ending their season with three consecutive defeats to narrowly miss the finals series.","content":"Having started their 2022 campaign with three straight wins, the reigning champions were considered among the favourites to lift the title this season, along with the star-studded Sydney Sixers.But the ladies in orange lost five of their last six regular season matches, slipping down to fifth on the ladder.Watch the Weber WBBL. Every game live and ad-break free during play on Fox Cricket, available on Kayo. New to Kayo? Start your free trial now >The Scorchers’ season ended with a heartbreaking final-over loss to the Melbourne Renegades in regional Victoria on Sunday, a rain-affected contest in Moe that went down to the wire.The Renegades, who at one stage were reeling at 4/15, needed eight runs from the final over of the run chase, with Erica Kershaw slapping back-to-back boundaries off South Africa’s Marizanne Kapp to seal the upset.It comes less than 24 hours after the Scorchers lost to the Melbourne Stars by six runs at the same venue on Saturday.“We showed our potential, but we never clicked as a whole unit,” Scorchers captain Sophie Devine told ABC Grandstand after the defeat, their third consecutive loss.“We’re really disappointed. Put it simply, we blew it.”Scorchers wicketkeeper Beth Mooney once again finished the home-and-away season as the tournament’s highest run-scorer with 434 at 43.40.The talented left-hander remains the leading run-getter in WBBL history with 4108 at 46.68, including 36 fifties and two centuries.Scorchers leg-spinner Alan King also impressed with the ball this season, taking 17 wickets at 16.00 with an economy rate of 5.91.“It’s disappointing,” Nitschke said after Sunday’s loss.“We were pretty disappointing on Saturday too but gave ourselves a chance to, if we won today, potentially make it through to the four depending on some other results.“But with the way today has played out, that’s not going to happen for us.“It’s really disappointing after having a pretty good year last year to not scrape through, but unfortunately we probably haven’t played good enough cricket for long enough this tournament, that’s how I’d sum it up.”Elsewhere in the WBBL on Sunday, the Sixers defeated the Hurricanes by eight wickets at North Sydney Oval to finish the regular season with 11 wins.Sixers captain Ellyse Perry (56 not out off 39 balls) and all-rounder Ash Gardner (45 not out off 29 balls) combined for an unbeaten 88-run partnership for the third wicket to chase the 157-run target with seven balls to spare.Meanwhile, the Brisbane Heat’s clash with the Melbourne Stars in Moe ended as a No Result due to weather.Having comfortably topped the ladder, the Sixers will host the WBBL Final at North Sunday Oval on Saturday, with the first ball scheduled for 5.20pm.The ladies in pink will face either the Heat, Hurricanes or Adelaide Strikers in the tournament finale.","pubDate":"2022-11-20 07:47:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"New Zealand vs India: New Zealand vs India, 2022/23 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/new-zealand-vs-india-live-score-over-2nd-t20i-t20-6-10-updates-3537124","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Live Updates of Today Match between New Zealand vs India from Bay Oval, Mount Maunganui. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-11-20 07:39:58","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_638045465818129787.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs NZ 2nd T20I: दूसरे मैच में संजू को जगह न मिलने पर भड़के फैंस, ट्वीटर पर दिए ऐसे रिएक्शन","link":"https://www.abplive.com/sports/cricket/ind-vs-nz-2nd-t20-fans-looked-unhappy-sanju-samson-in-not-playing-11-against-new-zealand-2263304","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"IND vs NZ 2nd T20I: पहला मैच बारिश की भेंट चढ़ने के बाद अब टीम इंडिया अपना दूसरा टी20 इंटरनेशनल मैच न्यूज़ीलैंड के खिलाफ खेल रही है. यह मैच माउंट माउंगानुई के बे ओवल में खेला जा रहा है. हार्दिक पांड्या (Hardik Pandya) की अगुवाई वाली टीम इंडिया ने टॉस हारकर पहले बल्लेबाज़ी कर रही है. इस सीरीज़ में टीम के स्टार प्लेयर संजू सैमसन (Sanju Samson) को भी शामिल किया है. संजू को लेकर उम्मीद की जा रही थी कि उन्हें टीम की प्लेइंग इलेवन में चुना जाएगा, लेकिन ऐसा नहीं हुआ. एक बार फिर संजू को टीम की प्लेइंग इलेवन से बाहर रखा गया है. गुस्साए फैंस संजू को प्लेइंग इलेवन में न देखकर फैंस काफी गुस्से में दिखाई दे रहे हैं. फैंस ने ट्वीटर क ज़रिए अपना गुस्सा ज़ाहिर किया है. इससे पहले भी संजू को टी20 वर्ल्ड कप 2022 की टीम में भी न चुने जाने पर फैंस गुस्साते दिखाई दिए थे. अब एक बार फिर फैंस का गुस्सा फूटता दिखाई दे रहा है. कप्ताना हार्दिक पांड्या के इस फैसले से फैंस काफी नाखुश हैं. संजू ने 2015 में टी20 इंटरनेशनल में डेब्यू किया था, तब से लेकर अब तक उन्होंने टीम इंडिया के लिए सिर्फ 16 टी20 इंटरनेशनल मैच खेले हैं. फैंस ने अपने-अपने तरीके से अपना गुस्सा ज़ाहिर करते हुए दिख रहे हैं. फैंस ने ऐसे ज़ाहिर किया गुस्सा It's not Sanju Samson lost its India's lost He is Gem but Bcci can't afford this gem #SanjuSamson#NZvIND pic.twitter.com/q8nU4mwsTU — AVI.29 🇮🇳 (@CricketLover015) November 20, 2022 It's not his loseIt's your loseU have not learnt anything from WC defeat #justiceforsanju Sanju Samson, Umran Malik pic.twitter.com/FvqvuxC1Kf — Ekansh Rai (@EkanshRai9) November 20, 2022 Sanju Samson should leave ICT if he not get chances in upcoming matches 😐 #NZvIND pic.twitter.com/hlqAmovp4M — AVI.29 🇮🇳 (@CricketLover015) November 20, 2022 Why ishan kishan over Sanju samson I was eagerly waiting for Rishab pant and Sanju samson left right combination as opener How dumb management can be?#Sanjusamson #INDvNZ pic.twitter.com/yIDqlq7yv0 — Registanroyals (@registanroyals) November 20, 2022 Honestly want Newzealand to win today and I will be glad if Indian top-order and middle-order wickets collapse.Dirty politics from @BCCIeven after the world cup lesson.We feel for you Sanju Samson 💔#SanjuSamson #NZvIND pic.twitter.com/1F5Arh9hwD — R O M E O (@romeyo369) November 20, 2022 Me came to see Sanju Samson and Umran Malik in T20Is vs New Zealand💔#SanjuSamson #UmranMalik #INDvsNZ #NZvIND #T20I pic.twitter.com/pQlv63TlfF — Ashutosh Srivastava (@kingashu1008) November 20, 2022 Politics in Indian Cricket is at its peak. Sanju Samson continously not being selected is astonishing while the 64 match failure Rishabh Pant is getting chances continously. What is this? — Cric Fan (@Geosav87) November 20, 2022 No Sanju Samson in Playing 11Injustice with his talent 😥#SanjuSamson #NZvIND #AmazonPrime pic.twitter.com/mzPcz8D9YI — Arbaaz (@_arbaazali) November 20, 2022   टीम इंडिया प्लेइंग इलेवन ईशान किशन, श्रेयस अय्यर, सूर्यकुमार यादव, ऋषभ पंत, दीपक हुडा, हार्दिक पांड्या, वाशिंगटन सुंदर, मोहम्मद सिराज, भुवनेश्वर कुमार, अर्शदीप सिंह, युजवेंद्र चहल. न्यूजीलैंड प्लेइंग इलेवन फिन एलन, डेवान कॉनवे, केन विलियमसन, ग्लेन फिलिप्स, डेरिल मिचेल, जेम्स नीशम, मिचेल सेंटनर, टीम साउदी, ईश सोढ़ी, एडम मिल्ने, लॉकी फर्ग्यूसन.     ये भी पढ़ें... IND vs NZ 2nd T20I: न्यूजीलैंड ने जीता टॉस, पहले गेंदबाजी का फैसला; ऐसी है दोनों टीमों की प्लेइंग-11 FIFA WC: कतर और इक्वाडोर की भिड़ंत के साथ होगा फीफा वर्ल्ड कप का आगाज, मैच के पहले होगी धमाकेदार ओपनिंग सेरेमनी","content":"IND vs NZ 2nd T20I: पहला मैच बारिश की भेंट चढ़ने के बाद अब टीम इंडिया अपना दूसरा टी20 इंटरनेशनल मैच न्यूज़ीलैंड के खिलाफ खेल रही है. यह मैच माउंट माउंगानुई के बे ओवल में खेला जा रहा है. हार्दिक पांड्या (Hardik Pandya) की अगुवाई वाली टीम इंडिया ने टॉस हारकर पहले बल्लेबाज़ी कर रही है. इस सीरीज़ में टीम के स्टार प्लेयर संजू सैमसन (Sanju Samson) को भी शामिल किया है. संजू को लेकर उम्मीद की जा रही थी कि उन्हें टीम की प्लेइंग इलेवन में चुना जाएगा, लेकिन ऐसा नहीं हुआ. एक बार फिर संजू को टीम की प्लेइंग इलेवन से बाहर रखा गया है. गुस्साए फैंस संजू को प्लेइंग इलेवन में न देखकर फैंस काफी गुस्से में दिखाई दे रहे हैं. फैंस ने ट्विटर के ज़रिए अपना गुस्सा ज़ाहिर किया है. इससे पहले भी संजू को टी20 वर्ल्ड कप 2022 की टीम में भी न चुने जाने पर फैंस गुस्साते दिखाई दिए थे. अब एक बार फिर फैंस का गुस्सा फूटता दिखाई दे रहा है. कप्ताना हार्दिक पांड्या के इस फैसले से फैंस काफी नाखुश हैं. संजू ने 2015 में टी20 इंटरनेशनल में डेब्यू किया था, तब से लेकर अब तक उन्होंने टीम इंडिया के लिए सिर्फ 16 टी20 इंटरनेशनल मैच खेले हैं. फैंस ने अपने-अपने तरीके से अपना गुस्सा ज़ाहिर करते हुए दिख रहे हैं. फैंस ने ऐसे ज़ाहिर किया गुस्सा googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels It's not Sanju Samson lost its India's lost He is Gem but Bcci can't afford this gem #SanjuSamson #NZvIND pic.twitter.com/q8nU4mwsTU — AVI.29 🇮🇳 (@CricketLover015) November 20, 2022 It's not his lose It's your lose U have not learnt anything from WC defeat #justiceforsanju Sanju Samson, Umran Malik pic.twitter.com/FvqvuxC1Kf — Ekansh Rai (@EkanshRai9) November 20, 2022 Sanju Samson should leave ICT if he not get chances in upcoming matches 😐 #NZvIND pic.twitter.com/hlqAmovp4M — AVI.29 🇮🇳 (@CricketLover015) November 20, 2022 Why ishan kishan over Sanju samson I was eagerly waiting for Rishab pant and Sanju samson left right combination as opener How dumb management can be? #Sanjusamson #INDvNZ pic.twitter.com/yIDqlq7yv0 — Registanroyals (@registanroyals) November 20, 2022 Honestly want Newzealand to win today and I will be glad if Indian top-order and middle-order wickets collapse. Dirty politics from @BCCI even after the world cup lesson. We feel for you Sanju Samson 💔 #SanjuSamson #NZvIND pic.twitter.com/1F5Arh9hwD — R O M E O (@romeyo369) November 20, 2022 Me came to see Sanju Samson and Umran Malik in T20Is vs New Zealand💔 #SanjuSamson #UmranMalik #INDvsNZ #NZvIND #T20I pic.twitter.com/pQlv63TlfF — Ashutosh Srivastava (@kingashu1008) November 20, 2022 Politics in Indian Cricket is at its peak. Sanju Samson continously not being selected is astonishing while the 64 match failure Rishabh Pant is getting chances continously. What is this? — Cric Fan (@Geosav87) November 20, 2022 No Sanju Samson in Playing 11 Injustice with his talent 😥 #SanjuSamson #NZvIND #AmazonPrime pic.twitter.com/mzPcz8D9YI — Arbaaz (@_arbaazali) November 20, 2022 टीम इंडिया प्लेइंग इलेवन ईशान किशन, श्रेयस अय्यर, सूर्यकुमार यादव, ऋषभ पंत, दीपक हुडा, हार्दिक पांड्या, वाशिंगटन सुंदर, मोहम्मद सिराज, भुवनेश्वर कुमार, अर्शदीप सिंह, युजवेंद्र चहल. न्यूजीलैंड प्लेइंग इलेवन फिन एलन, डेवान कॉनवे, केन विलियमसन, ग्लेन फिलिप्स, डेरिल मिचेल, जेम्स नीशम, मिचेल सेंटनर, टीम साउदी, ईश सोढ़ी, एडम मिल्ने, लॉकी फर्ग्यूसन. ये भी पढ़ें... IND vs NZ 2nd T20I: न्यूजीलैंड ने जीता टॉस, पहले गेंदबाजी का फैसला; ऐसी है दोनों टीमों की प्लेइंग-11 FIFA WC: कतर और इक्वाडोर की भिड़ंत के साथ होगा फीफा वर्ल्ड कप का आगाज, मैच के पहले होगी धमाकेदार ओपनिंग सेरेमनी var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-11-20 07:15:50","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"\"Management Ignoring Me\": Star's Plea To Pakistan Board Chief Ramiz Raja","link":"https://sports.ndtv.com/cricket/management-is-ignoring-me-stars-plea-to-pakistan-board-chief-ramiz-raja-3537143","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"In a recent interaction with media, Umar Akmal revealed that he wants to play cricket but the team management is ignoring him without any reason.","content":null,"pubDate":"2022-11-20 07:14:06","image_url":"https://c.ndtvimg.com/2022-10/uv68jopo_ramiz-raja_625x300_04_October_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia’s Mitchell Starc to drop white-ball cricket at some stage","link":"https://sportstar.thehindu.com/cricket/mitchell-starc-white-ball-cricket-test-career-australia-england/article66160042.ece","keywords":null,"creator":["\n         Reuters  \n    "],"video_url":null,"description":"Mitchell Starc believes cricket’s hectic schedule will force him to quit limited-overs cricket at some stage to prolong his Test career.","content":null,"pubDate":"2022-11-20 06:22:32","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup opening ceremony live streaming: When and where to watch in India","link":"https://www.firstpost.com/sports/fifa-world-cup-opening-ceremony-live-streaming-when-and-where-to-watch-in-india-11661551.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"FIFA World Cup opening ceremony live streaming: When and where to watch in India","content":"Sports FIFA World Cup opening ceremony live streaming: When and where to watch in India FIFA World Cup 2022: Here are all the details about the FIFA World Cup 2022 opening ceremony. FP Sports November 20, 2022 11:49:50 IST FIFA World Cup Qatar 2022 Doha. AP The controversial FIFA World Cup 2022 in Qatar begins on 20 November. The world’s biggest sporting event will kick off with hosts Qatar playing Ecuador in the opening match. The World Cup opener will be preceded by a glittering opening ceremony which will take at the Al Bayt Stadium. The #FIFAWorldCup party is about to get started! 🙌 🏟️ 🇶🇦 17:30 local time. It’s going to be big. pic.twitter.com/Uj65drRkWV — FIFA World Cup (@FIFAWorldCup) November 19, 2022 FIFA World Cup: Fixtures | Results | Points Table | Squads | Records Here are all the details about the FIFA World Cup 2022 opening ceremony. When is the FIFA World Cup 2022 opening ceremony? The FIFA World Cup 2022 opening ceremony will take place on Sunday, 20 November, 2022. Who will perform at the FIFA World Cup 2022 opening ceremony? South Korea’s BTS has informed that Jungkook, one of seven members of the boy band, will perform at the ceremony. FIFA is yet to release the full list of performers. Where will FIFA World Cup 2022 opening ceremony take place? The FIFA World Cup 2022 opening ceremony will be hosted at the Al Bayt Stadium. What time will FIFA World Cup 2022 opening ceremony start? The FIFA World Cup 2022 opening ceremony will begin at 8 pm IST on Thursday. On which TV channel can I watch FIFA World Cup 2022 opening ceremony? The FIFA World Cup 2022 opening ceremony will be broadcast on Sports18 and Sports18 HD TV. Where can I live stream FIFA World Cup 2022 opening ceremony? The FIFA World Cup 2022 opening ceremony will be live streamed on Jio Cinema app and website for free. Click here to read more FIFA World Cup stories Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 20, 2022 11:57:31 IST TAGS: Fifa World Cup 2022 Kickingaround","pubDate":"2022-11-20 06:19:50","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/FIFA-World-Cup-Qatar-2022-Doha-AP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Starc airs 'strong opinions' on controversial axing","link":"https://wwos.nine.com.au/cricket/news-2022-mitchell-starc-t20-world-cup-australia-team-omission-george-bailey/6d64ea18-6c7f-4f81-b9c7-df4a5ab48140","keywords":null,"creator":["wwos"],"video_url":null,"description":"M﻿itchell Starc has spoken publicly for the first time since he was dropped from Australia's World Cup team.","content":"Australian quick Mitchell Starc has spoken publicly for the first time about his controversial omission from the T20 World Cup team's final game.﻿The 32-year-old left-arm paceman was bizarrely dropped from the side before the Aussies only narrowly snuck home against Afghanistan, but ultimately didn't do enough to get out of the tournament's group stages.It was a miserable showing by the reigning champions, who were also hosting the World Cup 12 months after winning the trophy overseas.READ MORE: Legend's selection plea to losing Wallabies coach﻿READ MORE: Kangaroos win World Cup to end Samoa fairytaleREAD MORE: FIFA president's 'offensive' speech lifts mask on 'dirty' World CupStarc was axed in favour of right-arm fast bowler Kane Richardson, who selectors and coaches argued could serve the team better at the death.That's despite the fact Starc has one of the most lethal swinging yorkers in the game and can be close to unplayable when at his peak - traits Richardson does not boast.Speaking to reporters after Saturday's ODI victory over England, Starc revealed he had \"strong opinions\" on his axing and had sought an explanation from chief selector George Bailey.\"George and I have spoken and that's where it will stay,\" Starc said.\"I spoke to George at length, it was a good conversation. Many different things were floated there.\"I still have ambitions to play T20 cricket for Australia, but it is a long time to the next one and a lot of water to go under the bridge.\"So we will face that when we get to that.\"Starc has long snubbed the riches of the Indian Premier League, a move Australian Test and ODI captain Pat Cummins has now chosen to follow.﻿And the fast bowler says he may soon need to start picking and choosing between other cricket tournaments - even internationals for Australia - given the packed annual schedule.Starc says Test cricket will always be his priority, suggesting he will soon make a decision on axing ODIs or Twenty20 cricket from his reportoire.﻿\"It's certainly impossible at the moment to play every game as a three-format player,\" Starc said.\"Having (the IPL period) to rest might help me keep bowling at decent speeds for a period of time.\"I don't think playing three formats is something I can do for a long period moving forward.\"﻿Australia has one more ODI against England, in Melbourne on Tuesday, then begin the Test summer against the West Indies in Perth from November 30.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here","pubDate":"2022-11-20 06:04:47","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/11/467550/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand LIVE score 2nd T20I: Another wash out on the cards in Mount Maunganui","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-2nd-t20i-ind-vs-nz-live-score-cricket-match-latest-updates-mount-maunganui-rain-weather-11661431.html","keywords":["First Cricket News"],"creator":["Somya Kapoor"],"video_url":null,"description":"India vs New Zealand LIVE score 2nd T20I: Another wash out on the cards in Mount Maunganui","content":"New Zealand Vs India LIVE SCORE (t20) Quick Scorecard Full scorecard Ball by ball commentary FP commentary New Zealand Vs India At Bay Oval, Mount Maunganui, 20 November, 2022 20 November, 2022 Starts 12:00 (IST) Match yet to begin India 0/0 (0.0 ov) 2nd T20I New Zealand Yet To Bat Live Blog India New Zealand 0/0 (0.0 ov) - R/R 0.0 Match yet to begin This Over Batting Status R B 4s 6s Bowling 0 M R W Current Partnership Last Wicket 0/0 (0) 0 (0) R/R: 0 0 0(0) S.R (0) India vs New Zealand LIVE score 2nd T20I: NZ put IND into bat India vs New Zealand, 2nd T20I, LIVE CRICKET SCORE and UPDATES, Ball by ball commentary: Hello and welcome to the LIVE COVERAGE of the second T20I between India and New Zealand. Kane Williamson won the toss and elected to field first. Catch all the LIVE UPDATES here! Live Updates Highlights 11:39 (IST) IND vs NZ LIVE Playing XI India: Ishan Kishan, Rishabh Pant(w), Suryakumar Yadav, Shreyas Iyer, Deepak Hooda, Hardik Pandya(c), Washington Sundar, Bhuvneshwar Kumar, Arshdeep Singh, Mohammed Siraj, Yuzvendra Chahal Full Scorecard 11:38 (IST) IND vs NZ LIVE Playing XI New Zealand: Finn Allen, Devon Conway(w), Kane Williamson(c), Glenn Phillips, Daryl Mitchell, James Neesham, Mitchell Santner, Ish Sodhi, Tim Southee, Adam Milne, Lockie Ferguson Full Scorecard 11:35 (IST) India vs New Zealand Kane Williamson has won the toss and elected to bowl first against India in this second clash. \"Little bit of both - It's been under covers for a large part, and also potentially some weather around (his decision to bowl),\" Williamson said at the toss. Full Scorecard 11:22 (IST) Warm-ups underway ⚽️ Watch the second #NZvIND T20 LIVE on @sparknzsport in NZ or @PrimeVideoIN in India and listen on @TodayFM_nz #CricketNation pic.twitter.com/vtsgVsGZNF — BLACKCAPS (@BLACKCAPS) November 20, 2022 Full Scorecard 11:05 (IST) India vs New Zealand LIVE It looks good at the moment. There is no rain. The players are warming up. We just hope that it stays like this for the rest of the day too Full Scorecard 10:54 (IST) The rain looks to have passed and the covers are coming off at @BayOvalOfficial 👍 Excited for a sold out crowd tonight! #NZvIND #CricketNation pic.twitter.com/VPuCG33obv — BLACKCAPS (@BLACKCAPS) November 20, 2022 Full Scorecard 10:49 (IST) India vs New Zealand First things first. There is a high possibility of rain in Mount Maunganui which can eventually result in a curtailed game or a wash out Full Scorecard 10:39 (IST) Hello and welcome to the LIVE COVERAGE of the second T20I between India and New Zealand Full Scorecard Highlights India vs New Zealand, 2nd T20I, LIVE CRICKET SCORE: IND take on NZ in Mount Maunganui. (Photo Source: BCCI/Twitter) PREVIEW : The action now moves to Mount Maunganui where India and New Zealand will lock horns in the second T20I. The first clash of the three-match series was washed away due to rain in Wellington while the second game is also under dark clouds as there is a possibility of rain today as well. India are touring New Zealand for three T20Is and as many ODIs. While the T20I side is being led by Hardik Pandya in absence of the senior players, Shikhar Dhawan will be the captain of the ODI team. SQUADS: India: Shubman Gill, Ishan Kishan, Sanju Samson, Suryakumar Yadav, Hardik Pandya(c), Rishabh Pant(w), Deepak Hooda, Bhuvneshwar Kumar, Yuzvendra Chahal, Arshdeep Singh, Umran Malik, Washington Sundar, Mohammed Siraj, Shreyas Iyer, Kuldeep Yadav, Harshal Patel New Zealand: Finn Allen, Devon Conway(w), Kane Williamson(c), Glenn Phillips, Daryl Mitchell, James Neesham, Mitchell Santner, Tim Southee, Adam Milne, Lockie Ferguson, Blair Tickner, Michael Bracewell, Ish Sodhi Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 20, 2022 11:46:08 IST Tags: Cricket India Vs New Zealand Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-20 05:26:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/India-vs-New-Zealand-2nd-T20I-LIVE-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}